PARREQCD DS    AL1                 request type                                 
PARRALLO EQU   1                   allocate device                              
PARRUNAL EQU   2                   unallocate device                            
PARRMNT  EQU   3                   allocate device, allow mount                 
PARFLAG  DS    X                   option flag                                  
PARFWAIT EQU   X'80'               ok to wait on enq                            
PARFUNIT EQU   X'40'               unit address specified                       
PARFUCBT EQU   X'20'               ucbtype specified                            
PARFNJFC EQU   X'10'               do not update jfcb                           
PARRESVD DS    H                   reserved (must be zero)                      
PARDDNAM DS    0CL8                ddname to be allocated                       
PARDDCOD DS    CL2                 ddname code (must not be blanks)             
PARDDVOL DS    CL6                 volume serial to be allocated                
PARUSCTA DS    A                   address of use count list                    
PARDEVIC DS    CL8                 name of device to be allocated               
PARAMEND EQU   *                                                                
