*-                                                                              
*-  BINARY SEARCH INFORMATION DSECT                                             
*-                                                                              
*-                                                                              
BSINFO   RECORD BEGIN ,            BINARY SEARCH INFO                           
BSTLEN   DS    F                   TOTAL LENGTH FOR ENTRIES                     
BSELEN   DS    F                   ENTRY LENGTH                                 
BSSLEN   DS    F                   SEARCH FIELD LENGTH                          
BSSOFF   DS    F                   SEARCH FIELD OFFSET                          
BSEND    DS    F                   END OF LAST VALID ENTRY                      
BSCNT    DS    F                   COUNT OF BINARY SEARCH ITERATIONS            
BSSTART  DS    F                   START BINARY SEARCH AT MIDDLE                
BSRSVD   DS    F                   NOT USED                                     
         END                                                                    
