*box                                                                            
*                                                                               
*  WYLBUR global Christa data areas                                             
*                                                                               
         SPACE ,                                                                
CHRPARMS RECORD BEGIN              Global data areas passed to Christa          
CHRPRMID DC    CL4'CHRP'           Christa parm eye-catcher                     
*                                                                               
CHRKPATH DC    CL8' '              Christa path name                            
CHRKTIME DC    A(0)                Christa path timeout in .01 secs             
*                                                                               
CHRUPATH DC    CL8' '              Christa path name                            
CHRUTIME DC    A(0)                Christa path timeout in .01 secs             
*                                                                               
CHRPLEN  EQU   *-CHRPARMS          Length of global Christa parms               
         END   ,                                                                
