CVSTART  DC    CL4'CV'                                                          
*                                                                               
         GBLA  &LINESZ,&PRESSZ,&BUFRMAX,&HACKDEL  (See SYSDEFN)                 
         GBLB  &$PCODE             (see HIBAL macro for info)                   
         GBLC  &MAXLNO             Maximum line-number                          
*                                                                               
CVINSTAL DC    CL8'GENERIC'        Instalation name                             
CVMACHID DC    CL8'SYSX'           Machine name                                 
CVJES    DC    CL4'JES'            Name of JES                                  
*                                                                               
CVNAME   DC    CL8'WYLBUR'         Job name                                     
CVMILSSN DC    CL8'MILTEN'         MILTEN   path name                           
CVWYLSSN DC    CL8' '              WYLBUR   subsystem name                      
CVORVSSN DC    CL8'ORVYL'          ORVYL    subsystem name                      
CVRLGSSN DC    CL8'ORVYLRLG'       ORVYLRLG subsystem name                      
         DC    16X'FF'             Reserved                                     
*                                                                               
CVWORD   DC    XL8'00'             System word                                  
*                                                                               
CVWYLACC DC    CL5' '              Account WYLBUR is running under              
CVWYLJBN DC    CL4' '              WYLBUR's job number                          
CVNOTIFY DC    XL5'00'             Notify account                               
*                                                                               
CVKEY    DS    X                   Our storage key                              
*                                                                               
CVMACH   FLAG                                                                   
         FLAG  CVFSYSA             - SYSA access is allowed                     
         FLAG  CVFSYSB             - SYSB access is allowed                     
         FLAG  CVFSYSC             - SYSC access is allowed                     
         FLAG  CVFSYSD             - SYSD access is allowed                     
         FLAG  CVFSYSE             - SYSE access is allowed                     
         FLAG  CVFSYSF             - SYSF access is allowed                     
         FLAG  CVFSYSG             - SYSG access is allowed                     
*                                                                               
CVLOGMOD FLAG                                                                   
         FLAG  CVLGPATH            Log PATH activity                            
*                                                                               
         DC    CL11' '             Reserved                                     
         DC    20X'FF'             Reserved                                     
*                                                                               
CVLOCK1  FLAG                                                                   
         FLAG  CVL1TQ              - Lock for Timer Queue                       
         FLAG  CVL1TQJ             - Lock for JCBS on Time Queue                
CVLOCK2  FLAG                                                                   
         FLAG  CVL2RSV             Reserved                                     
CVLOCK3  FLAG                                                                   
         FLAG  CVL3RSV             Reserved                                     
CVLOCK4  FLAG                                                                   
         FLAG  CVL4RSV             Reserved                                     
*                                                                               
CVOSRA   DS    A                   OS return addr                               
CVSCLCK  DC    XL8'00'             Clock at start                               
CVPARMP  DS    A                   OS parm ptr                                  
*                                                                               
CVPPDBQH DC    A(0)                Pending send PDB queue head                  
CVPPDBQT DC    A(CVPPDBQH)         Pending send PDB queue tail                  
*                                                                               
CVUPMAX# EQU   25,,C'N'            Maximum number of paths per user             
CVPATH#  EQU   500,,C'N'           Maximum number of paths                      
CVPATHP  DS    A                   UPATH address table ptr                      
*                                                                               
CVUNMAX# EQU   25,,C'N'            Maximum number of UNETs per user             
CVNET#   EQU   500,,C'N'           Maximum number of net connections            
CVNETP   DS    A                   UNET address table ptr                       
*                                                                               
CVPATHQH DC    A(0)                User path wait queue head                    
CVUNETQH DC    A(0)                User network path wait queue head            
*                                                                               
CVAMYP   DC    A(0)                AMELIA UPATH ptr                             
CVTAMYP  DC    A(0)                TESTAMY UPATH ptr                            
*                                                                               
CVSITP   DC    A(0)                Session info table ptr (in CSA)              
*                                                                               
CVVTERMS DC    A(0)                VLOGON terminal list pointer                 
CVVLASTA DC    A(0)                VLOGON terminal last assigned                
*                                                                               
CVVTAMQ  DS    0D                  Align for Compare double and swap            
CVVTAMQH DC    A(0)        [Order] VTAM post queue head                         
CVVTAMQT DC    A(0)        [Order] VTAM post queue tail                         
*                                                                               
CVSLICE  DC    A(X'00400000')      Timeslice interval (2nd clck wd)             
*-                                                                              
*-  The size of a page buffer is controlled by the constant below.              
*-  If you change this, it's probably safest to re-assemble all of              
*-  WYLBUR.  Any value between 8K and 32K-1 is acceptable.                      
*-                                                                              
*-  23476 is a good size for a 3380 device (2 records per track).               
*-  15476 is a good size for a 3380 device (3 records per track).               
*-  27998 is a good size for a 3390 device.                                     
*-  18452 is a good size for a 3390 device.                                     
*-                                                                              
*-  In order to optimize on memory usage the page size is now                   
*-  20K less the space needed for various PBUF control information              
*-  (which is roughly 128 bytes).                                               
*-                                                                              
         AIF   (&$PCODE).WXXPSZ                                                 
CVPIOSZ  EQU   20480-128           Total size of I/O buffer                     
CVPXSZ   EQU   8                   Size of page buffer prefix                   
CVPSZ    EQU   CVPIOSZ-CVPXSZ      Size of page buffer                          
         AGO   .ENDPSZ                                                          
.WXXPSZ  ANOP                                                                   
CVPSZ    EQU   4096-16                                                          
.ENDPSZ  ANOP                                                                   
*                                                                               
*                                                                               
CVPINDEX EQU   8                   Index into PCB to PCBBUFP                    
*                                                                               
CVNUSERS DC    H'0'                No. of users logged on                       
CVRUNCUR DC    H'0'                Current number of users on RUN-Q             
CVRUNMAX DC    H'10'               Maximum allowed RUN Q depth                  
         DC    H'-1'               Reserved                                     
*                                                                               
CVNSMF   DC    F'0'                No. of SMF records written                   
CVNASMF  DC    F'0'                No. of accounting SMF " "                    
*                                                                               
CVNFAIL  DC    H'0'                No. of failsofts                             
CVDFMAX# EQU   5,,C'N'             Allowed dispatcher failsofts                 
CVNDISPF DC    H'0'                No. of dispatcher failsofts                  
CVNSUBF  DC    H'0'                No. of subtask failsofts                     
CVFCLCK  DC    F'0'                Clock at failsoft                            
CVFINFO  DC    XL64'00'            Failsoft text                                
*                                                                               
CVPPG    DC    H'9999'             Max no. of primary (drum) pages              
*                                  ...allowed for a single user                 
*-                                                                              
*-       Change the following number to increase the number                     
*-         of users.  Also change the "LINES" statement in GLOB.                
*-                                                                              
*-         Be careful not to increase the number of users beyond                
*-         what a single track checkpoint record can hold (see                  
*-         INIT).                                                               
*-                                                                              
CVMAXSES DC    H'2600'             Maximum number of users                      
*                                                                               
CVTRCENT DC    H'100'              No. of trace table entries                   
CVMBUFF  DC    A(128*1024)         Size of MILTEN receive buffer                
*                                                                               
CVNIPG   DC    H'-1'               No. of page buffers to initialize            
CVNPG    DC    H'0'                Actual number of page buffers                
CVNPG16M DC    H'0'                No. of buffers below 16M line                
CVPGMIN  DC    H'0'                Current min no. of buffers                   
CVPGMAX  DC    H'0'                Current max no. of buffers                   
*                                                                               
         DC    4H'-1'              Reserved                                     
*                                                                               
CVPGADJ  DC    H'0'                Last auto-pilot adjustment                   
CVPGCLK  DC    F'0'                Clock at last adjustment                     
*                                                                               
CVMAXPNO DC    F'0'                Maximum page number                          
*                                                                               
CVBKUPCT DC    H'0'                Count of vols in backup status       **ISU** 
*                                                                               
&MAXLNO  SETC  '99999.999'         Maximum line-number (for msgs)               
CVMAXLNO DC    A(99999999)         Maximum legal line-number                    
CVHILNO  DC    A(99999999+1)       One plus max line-number                     
*                                                                               
CVMONPTR DC    F'0'                WMONITOR monitor address                     
CVMONWRK DC    F'0'                WMONITOR working cell                        
*                                                                               
CVWGWROP DC    F'0'                Number of Wings opens for write              
CVWGRDOP DC    F'0'                Number of Wings opens for read               
*                                                                               
         DC    3F'-1'              Reserved                                     
*-                                                                              
*-       Failsoft recovery information.                                         
*-                                                                              
CVCURPATH DC   F'0'                Current PATH ptr                             
*-                                                                              
*-       Counters.                                                              
*-                                                                              
CVMSENT  DC    F'0'                Number of mail items sent                    
CVMSEND  DC    F'0'                Number of SEND commands                      
CVMBIT   DC    F'0'                Number of BITNET mail items                  
CVMSHML  DC    F'0'                Number of SHOW MAIL commands                 
CVMSHMLD DC    F'0'                Number of DUMP MAIL commands                 
CVMSHSUM DC    F'0'                Number of SHOW MAIL SUMMARY cmds             
CVMEMS   DC    F'0'                Number of EMS mail items sent                
*                                                                               
* Temporary space used for measurement histograms.                              
*                                                                               
CVHIST   DC    8F'0'                                                            
         EJECT                                                                  
***                                                                             
***                                                                             
***      Global Queue Ptrs                                                      
***                                                                             
***                                                                             
CVFJCB   DC    A(0)                Addr of first JCB                            
CVLJCB   DC    A(0)                Addr of last(+1) JCB                         
CVCURJCB DC    A(0)                Addr of current JCB                          
CVOLDJCB DC    A(0)                Addr of old JCB                              
*                                                                               
CVFPFCB  DC    A(0)        [Order] First avail PFCB         (Drum)              
CVLPFCB  DC    A(0)        [Order] Last(+1) PFCB                                
CVSPFCB  DC    A(0)        [Order] First secondary PFCB     (Disk)              
*                                                                               
CVPCBQH  DC    A(0)                Pointer to first PCB (or zero)               
*                                                                               
         DS    0D                                                               
CVPOSTQH DC    A(0)                First posted PCB (or zero)                   
CVPOSTLK DC    A(0)                Lock word (counter for "CDS")                
*                                                                               
CVEMBUFQ DC    2A(0)               Queue of empty buffers                       
CVBUFQ   DC    2A(0)               Queue of data buffers                        
*                                                                               
CVTQEQH  DC    A(0)                Timer queue head                             
CVTQEID  DS    A(0)                Last timer id used                           
*                                                                               
CVTIMOUT DC    AL2(15*60)          Test system timeout value                    
CVTIMLFT DC    AL2(15*60)          Time remaining                               
*                                                                               
CVTTYQH  DC    A(0)                TTYPE queue head                             
*                                                                               
CVWECBQH DC    A(0)                Waiting ECB queue head                       
CVWECBQT DC    A(0)                Waiting ECB queue tail                       
*                                                                               
*  Information for server connections.  There are two types                     
*    of servers, public servers (which anyone can connect to)                   
*    and user servers.                                                          
*                                                                               
CVPSFNO  EQU   1001,,C'N'          First public server number                   
CVPSLNO  EQU   1999,,C'N'          Last public server number                    
CVPSSIZE EQU   ((CVPSLNO+1)-CVPSFNO)*4,,C'N'  SVIT size                         
CVPSTAB  DC    A(0)                Public SVIT ptr                              
CVPSENDP DC    A(0)                End of SVIT ptr                              
CVPSNXP  DC    A(0)                Next SVIT entry to use ptr                   
*                                                                               
CVUSFNO  EQU   1,,C'N'             First user server number                     
CVUSLNO  EQU   999,,C'N'           Last user server number                      
CVUSSIZE EQU   ((CVUSLNO+1)-CVUSFNO)*4,,C'N'  SVIT size                         
CVUSTAB  DC    A(0)                User SVIT ptr                                
CVUSENDP DC    A(0)                End of SVIT ptr                              
CVUSNXP  DC    A(0)                Next SVIT entry to use ptr                   
*                                                                               
*  General server stuff.                                                        
*                                                                               
CVQMONQ  DC    A(0)                QMONITOR waiting queue                       
         DC    F'0'                Reserved                                     
CVHEAPGT DC    F'0'                User heap GETMAINs                           
CVHEAPFR DC    F'0'                User heap FREEMAINs                          
*                                                                               
*  Client/server counters.                                                      
*                                                                               
CVCSCONN DC    F'0'                Number of connections made                   
CVCSREQ  DC    F'0'                Number of server requests                    
CVCSNIO  DC    F'0'                Number of server I/O's                       
*                                                                               
CVWPATH  DC    CL8'WINGSV00'       Wings path name                              
CVWPATH1 DC    CL8'WINGSV00'       Wings1 path name                             
CVWPATH2 DC    CL8'WINGSV00'       Wings2 path name                             
*                                                                               
CVCHRIS  DC    A(0)                Christa memory area pointer                  
*                                                                               
CVVBINFO DC    A(0)                Sys var binary search info loc               
CVFBINFO DC    A(0)                Sys func binary search info loc              
CVPBINFO DC    A(0)                Sys proc binary search info loc              
*                                                                               
*  Note:  If you change CVSTACKL, you must also update WDEBUG.                  
*                                                                               
CVSTACK# EQU   128                 Stack size in K                              
CVSTACKL DC    A(CVSTACK#*1024)    Stack length                                 
CVDSTK   DC    A(0)                Start of dispatcher stack area               
CVSTACK  DC    A(0)                Start of user stack area                     
CVSTACKE DC    A(0)                End of user stack area                       
*                                                                               
*  Note:  If you change CVHEAPL, you must also update WDEBUG.                   
*                                                                               
CVHEAP#  EQU   512                 Heap size in K                               
CVHEAPL  DC    A(CVHEAP#*1024)     Heap length                                  
CVHEAP   DC    A(0)                Start of heap area                           
CVHEAPE  DC    A(0)                End of heap area                             
*                                                                               
CVPRTQH  DC    A(0)                Printer table queue head                     
*                                                                               
CVHOSTQH DC    A(0)                Host table queue head                        
CVHAILQH DC    A(0)                Host name alias table queue head             
*                                                                               
CVTIMRQ  DC    A(0)                Queue of timer posted JCBs                   
*                                                                               
         DC    F'-1'               Reserved                                     
CVPCSEC  DC    F'300'              Secs before checkpoint page out              
CVPCMAX# EQU   20,,C'N'            Max no. of I/O CHECKOUT can queue            
*                                                                               
CVXMONCT DC    F'0'                No. of current BIG xmon sessions             
*                                                                               
CVVTRC#  EQU   20                  No. of view buffer trace entries             
CVVTRCP  DC    A(0)                View buffer trace queue head                 
CVVNTRC  DC    H'0'                Number of trace entries                      
         DC    H'-1'               Reserved                                     
*                                                                               
CVXTRC#  EQU   50                  No. of Samson trace entries                  
CVXTRCP  DC    A(0)                Samson buffer trace queue head               
CVXNTRC  DC    H'0'                Number of trace entries                      
         DC    H'-1'               Reserved                                     
*                                                                               
CVETRC#  EQU   50                  No. of network trace entries                 
CVETRCP  DC    A(0)                Network buffer trace queue head              
CVENTRC  DC    H'0'                Number of trace entries                      
CVENERL  DC    H'0'                Error packet length (see CVENERP)            
*                                                                               
CVENUSE  DC    F'0'                Number of network uses                       
CVENSAVE DC    F'0'                Number of network saves                      
CVENSCR  DC    F'0'                Number of network scratchs                   
CVENREN  DC    F'0'                Number of network renames                    
CVENDIR  DC    F'0'                Number of network show dir's                 
CVENCMD  DC    F'0'                Number of network commands                   
CVENIO   DC    F'0'                Number of network I/O's                      
CVENERR  DC    F'0'                Number of network errors                     
CVENERP  DC    A(0)                Pointer to last error packet                 
         EJECT                                                                  
*-                                                                              
*-       Global Record Groups                                                   
*-                                                                              
CVTEXT   RG    ,                   Global ACTIVE files                          
CVEXEC   RG    ,                   Global EXEC files                            
CVFLOW   RG    ,                   Global EXEC file flow ctrl info              
CVDATA   RG    ,                   Global EXEC GETDATA/PUTDATA vars             
*  CVDATA key length is the same as "CPDATA" key length.                        
CVRG16   RG    ,                   Global Misc RecGroup (name len=16)           
*  CVRG16 key length is the same as "CPRG16" key length.                        
CVRG64   RG    ,                   Global Misc RecGroup (name len=64)           
*  CVRG64 key length is the same as "CPRG64" key length.                        
         EJECT                                                                  
*-                                                                              
*-       More Record Group Related Info.                                        
*-                                                                              
CV#SYS   EQU   1                   System vars/data (in CVRG16)                 
CV#PUBV  EQU   2                   Public (PUB.) vars (in CVRG16)               
CV#WC    EQU   3                   WCOUNT initialization info                   
*-                                                                              
*-       EXEC stuff.                                                            
*-                                                                              
CV#XFREE DC    F'0'                Next free public Exec set no.                
CV#FEXEC EQU   2048                First free public Exec set no.               
*-                                                                              
*-       CHAZ RESERVED                                                          
*-                                                                              
CVCHAZF1 DC    F'0'                                                             
CVCHAZF2 DC    F'0'                                                             
CVCHAZF3 DC    F'0'                                                             
CVCHAZF4 DC    F'0'                                                             
CVCHAZF5 DC    F'0'                                                             
CVCHAZF6 DC    F'0'                                                             
CVCHAZF7 DC    F'0'                                                             
CVCHAZF8 DC    F'0'                                                             
CVCHSTR  DC    CL256' '                                                         
         EJECT                                                                  
CVFL     FLAG                                                                   
         FLAG  CVFTMIL             - Test MILTEN running                        
         FLAG  CVFPGROT            - Do page rotates (for debugging)            
         FLAG  CVFRLOAD            - Reload is pending                          
         FLAG  CVFRLG              - Running on the RLG machine                 
         FLAG  CVFNDSUB            - No disk subtasking (debugging)             
         FLAG  CVFDISP             - Running in dispatcher mode                 
         FLAG  CVFNTRC             - ENET tracing (see NET module)              
         FLAG  CVFSERVWYL          - Run server functions only                  
*                                                                               
CVFL2    FLAG                                                                   
         FLAG  CVFTRC              - Trace table in use                         
         FLAG  CVFABEND            - Stae abend in progress                     
         FLAG  CVFRBUG             - Recovery debugging info wanted             
         FLAG  CVFRCVY             - WYLBUR recovery running                    
         FLAG  CVFINIT             - WYLBUR init in progress                    
         FLAG  CVFFMT              - Page file reformatting                     
         FLAG  CVFTEST             - Test WYLBUR running                        
         FLAG  CVFFORCE            - Changed pages written (abend)              
*                                                                               
CVFL3    FLAG                                                                   
         FLAG  CVFNOR              - Only go through init                       
         FLAG  CVFNORACF           - No RACF checking                           
         FLAG  CVFPUSR             - Running pseudo "init" user                 
         FLAG  CVFXA               - MVS/XA (not MVS/370)                       
         FLAG  CVFNOTIM            - No timeout timer                           
         FLAG  CVFCMDS             - Do initial commands                        
         FLAG  CVFXA31             - Use 31-bit mode in XA                      
         FLAG  CVWPATCH            - Patch W0-W9 to format(-1,3)                
*                                                                               
CVFL4    FLAG                                                                   
         FLAG  CVFCFMT             - Format checkpoint record                   
         FLAG  CVFNCHK             - No checkpointing                           
         FLAG  CVFMAN              - Manual recovery mode                       
         FLAG  CVFSYST             - Systems time (see CVWORD)                  
         FLAG  CVFNSTAE            - Don't set ESTAE exit (debugging)           
         FLAG  CVFNORET            - No failsoft recovery                       
         FLAG  CVFNSPIE            - Don't set SPIE exit (debugging)            
*                                                                               
CVFL5    FLAG                                                                   
         FLAG  CVFVISTA            - This is VISTA (VLOGON subsys)              
         FLAG  CVFMEMPAGE          - Only memory pages are available            
         FLAG  CVFWINGS            - Use WINGS file sys                         
         FLAG  CVFOLDIBM           - Use OLDIBM file sys, (default)             
*                                                                               
CVFL6    FLAG                                                                   
         FLAG  CVFCHRUBPR          UserID Access: BDAM primary                  
         FLAG  CVFCHRUBSE          UserID Access: BDAM secondary                
         FLAG  (CVFUIDBDM,CVFCHRUBPR+CVFCHRUBSE,NZ)  UserID BDAM                
         FLAG  CVFCHRUCPR          UserID Access: Christa primary               
         FLAG  CVFCHRUCSE          UserID Access: Christa secondary             
         FLAG  (CVFUIDCHR,CVFCHRUCPR+CVFCHRUCSE,NZ)  UserID Christa             
         FLAG  CVFCHRKBPR          Keyword Access: BDAM primary                 
         FLAG  CVFCHRKBSE          Keyword Access: BDAM secondary               
         FLAG  (CVFKWRBDM,CVFCHRKBPR+CVFCHRKBSE,NZ)  Keyword BDAM               
         FLAG  CVFCHRKCPR          Keyword Access: Christa primary              
         FLAG  CVFCHRKCSE          Keyword Access: Christa secondary            
         FLAG  (CVFKWRCHR,CVFCHRKCPR+CVFCHRKCSE,NZ)  Keyword Christa            
*                                                                               
CVJESFLG FLAG                                                                   
         FLAG  CVJFNRUN            - Runs not allowed                           
*                                                                               
CVWTOFLG FLAG                                                                   
         FLAG  CVWTOFWTL           - Do WTL (not WTO)                           
         FLAG  CVWTOFNOPFX         - No WTO prefix at all                       
         FLAG  CVWTOFUPFX          - Put userid in prefix                       
         FLAG  CVWTOFACTION        - Make WTO non-deletable                     
         FLAG  CVWTOFTAPE          - Route WTO to tape station                  
*                                                                               
CVDBGFLG FLAG                                                                   
         FLAG  CVFDEBUGIO          - DEBUG message is waiting                   
*                                                                               
CVONE    DC    F'1'                Constant of one                              
CVFOUR   DC    F'4'                Constant of four                             
CVBLANKS DC    CL(&LINESZ)' '                                                   
         DS    0F                  Exec variable 0 and 1                        
CVPKZERO DC    X'00000000000000000000000C'   F14.9                              
CVPKONE  DC    X'00000000000001000000000C'   F14.9                              
*                                                                               
CVPTP    DC    A(*-*)              Page Table ptr                               
CVXPTP   DC    A(*-*)              (Page Table ptr) - L'PT                      
*                                                                               
CVSTKCEL DC    A(0)                Address of stack cell blocks                 
CVHEAPCL DC    A(0)                Address of heap cell blocks                  
CVTSEGPL DC    A(0)                Address of TSEG buffer cell blocks           
*                                                                               
         DS    2F                  Reserved                                     
CVHACKWT DC    AL2(&HACKDEL*100)   Wait time for password verfication   **ISU** 
*                                                                               
         DC    H'0'                Reserved                                     
CVHLPPTR DC    A(0)                Help directory ptr                           
*                                                                               
CVDICPTR DC    A(0)                Spelling dictionary ptr                      
*                                                                               
         DC    H'-1'               Reserved                                     
*                                                                               
         DC    H'-1'               Reserved                                     
CVNWDATE DC    F'0'                Date of latest news item                     
CVNWSIZ# EQU   16384-16            Size of a news page                          
CVNWMPG# EQU   8                   Max no of news pages                         
CVNWPG   DC    (CVNWMPG#)F'0'      News page (memory) list                      
CVNWINFO EQU   CVNWDATE,*-CVNWDATE,C'X'                                         
*                                                                               
CVDSPCLK DC    D'0'                TOD clock at user dispatch                   
CVOLDCLK DC    D'0'                TOD clock at last checkout                   
CVWTCLK  DC    D'0'                Voluntary wait time                          
         DC    2D'0'               Reserved                                     
         EJECT                                                                  
*-                                                                              
*-       Statistics.                                                            
*-                                                                              
CV#INTVL DC    F'60'               60 second statistics interval                
CV#CPU   DC    F'0'                No. of secs CPU used last intvl              
*                                                                               
CV#IOSEC DS    H                   Page I/O's per second                        
CV#IOCLK DS    F                   Clock at I/O per sec calc                    
*                                                                               
*                                                                               
CV#PAT   EQU   *                   Start of page type stats                     
CV#TXT   DC    C'TEXT'                                                          
CV#TXTIO DC    F'0'                Number of TEXT page I/O's                    
CV#TXTWR DC    F'0'                Number of TEXT page writes                   
*                                                                               
CV#MSC   DC    C'MISC'                                                          
CV#MSCIO DC    F'0'                All other page I/O's                         
CV#MSCWR DC    F'0'                All other page writes                        
*                                                                               
         DC    3XL12'00'           Reserved                                     
         DC    XL4'00'             End of list                                  
*                                                                               
CVCPMEM  DC    F'0'                Memory in use for CP space                   
CVSTKMEM DC    F'0'                Memory in use for STACK space                
*                                                                               
CVSTKFRE DC    F'0'                Number of user stack FREEMAINS               
CV#COUT  DC    F'0'                No. of checkpoint page outs                  
*                                                                               
CV#SNEM  DC    F'0'                Snatched an empty buffer                     
CV#SNB   DC    F'0'                Snatched a buffer                            
CV#SNC   DC    F'0'                Can't snatch a buffer                        
*                                                                               
CVMPGMEM DC    F'0'                Memory in use for MPAGE space                
CVMEMTOT DC    F'0'                Memory allocated by GETCORE                  
*                                                                               
CVSTKGET DC    F'0'                Number of user stack GETMAINS                
         DC    F'-1'               Reserved                                     
         EJECT                                                                  
*-                                                                              
*-       Resource group area.                                                   
*-                                                                              
CVFRSG   DC    A(0)                First rsg ptr                                
*                                                                               
CVRSG    DC    A(0)                Rsg effective start (milrsg)                 
         DC    A(0)                Size of rscgroup                             
         DC    A(0)                Address of last rsg                          
         DC    A(0)                                                             
*                                                                               
CVRRUN   EQU   1                   Run-q          (Not checked)                 
CVRSET   EQU   2                   Setup-q        (Not checked)                 
CVRPAG   EQU   3                   Pageio-q       (Not checked)                 
CVRIOW   EQU   4                   Iowa-q                                       
CVRKWR   EQU   5                   Kwr-q                                        
CVRSUB   EQU   6                   Job sumbission-q                             
CVRHCM   EQU   7                   JES commands-q                               
CVRKEY   EQU   8                   KEYS-q                                       
CVRLAST  EQU   CVRKEY              Highest number resource id                   
*                                                                               
CVECBLST DC    V(ECBLIST)          ECB list ptr                                 
*                                                                               
CVFIOWA  DC    A(0)                First EXIO work area                         
*                                                                               
CVOSDSPT DC    A(0)                @ clock time last os dispatch                
CVTCPUTM DC    A(0)                Total cpu time used by wyl                   
CVSCPUTM DC    A(0)                Cpu time at last stimer                      
CVRCPUTM DC    A(0)                Cpu time at last user disp.                  
CVTIME   DC    A(0)                Total user charged cputime                   
CVCLOCK  DC    D'0'                Clock value @ last gttime                    
*                                                                               
CVSPIEAD DC    A(0)                Spie recovery address                        
CVITCBP  DC    A(0)                Initiator TCB ptr                            
CVASCBP  DC    A(0)                ASCB ptr                                     
CVLUVPTR DC    A(0)                Pointer to eligible device table     **ISU** 
*                                                                               
CVECB    DC    F'0'                Main ECB                                     
*-                                                                              
*-       Volume management area.                                                
*-                                                                              
CVSTYPE  DC    C'IO'               Tiot ident for save vols                     
CVUTYPE  DC    C'DD'               Tiot ident for use vols                      
CVTTYPE  DC    C'TM'               Tiot ident for temp vols                     
         DC    F'-1'               Reserved                                     
CVWTOLID DC    F'0'                Last XWTO id (in case DOM needed)            
CVDEBUGP DC    V(DEBUGSG)          DEBUG SEGCB ptr (see DEBUG macro)            
CVUSECVT DC    A(*-*)              User cvt (scipcvt) ptr                       
CVTCBP   DC    A(0)                TCB ptr                                      
CVVOLIST DC    A(0)                Address of volume list                       
CVRCVOL  DC    A(0)                Address of first recovery vol                
*                                                                               
CVWTOSGP DC    V(WTOSG)            XWTO SEGCB ptr (see XWTO macro)              
         EJECT                                                                  
*PUSH,NOGEN                                                                     
*-                                                                              
*-       Subroutine entry routine (called from PROC/XPROC), entered             
*-       as follows:                                                            
*-                                                                              
*-          BAL   R7,CVENT         Set up base register and trace               
*-          DC    CL8'name'        Trace name                                   
*-          USING *,R7                                                          
*-                                                                              
CVENT    LA    R7,8(,R7)           Bump addr                                    
CVENTBR  BR    R7                  Set to NOPR if tracing                       
CVBRMSK  EQU   CVENTBR+1,1,C'X'    Four bit branch mask                         
CVENTON  EQU   CVBRMSK,X'F0',14    Makes CVENTBR a NOPR                         
CVENTOFF EQU   CVBRMSK,X'F0',1     Makes CVENTBR a BR                           
         XTRACE ENTRY,REGS=(R15,R0,R1)                                          
         BR    R7                  Scram                                        
*-                                                                              
*-       Trace routine (linkage generated by XTRACE), entered as                
*-       follows:                                                               
*-                                                                              
*-          STM   R0,R15,CVLNKRGS                                               
*-          BAL   RAR,CVTRC                                                     
*-          DC    AL2(flgs,rgmsk),CL8'name'                                     
*-                                                                              
CVTRC    ST    RAR,CVLNKRTN        Save return addr                             
         L     RAR,CVTRCRTN        Addr of trace routine                        
         BR    RAR                                                              
*                                                                               
CVEXIT   L     RAR,CVEXIRTN        CV exit routine addr                         
         BR    RAR                 Exit                                         
*                                                                               
CVTRCRTN DC    V(TRC)              (FAIL)                                       
CVEXIRTN DC    V(CVPFXRTN)         (GLOB)                                       
*                                                                               
CVLNKRGS DS    16F                 Register save area                           
CVLNKRTN EQU   CVLNKRGS+(R12*4),4  Use R12 for return addr                      
CVTRCDAT DS    D                   Trace data                                   
         EJECT                                                                  
*                                                                               
*  Exit routines:                                                               
*                                                                               
*   CVNEXT,CVNXTMSG  - Get next command (normal end of command).                
*   CVABORT,CVABTMSG - Command error, don't do auto retry.                      
*   CVERROR,CVERRMSG - Command error, ok to do auto retry.                      
*                                                                               
* CVNXTMSG, CVABTMSG, CVERRMSG entries have a msg in R1,R0 to seg.              
*                                                                               
CVERRMSG OI    CPFERROR,L'CPFERROR                                              
CVABTMSG OI    CPFABORT,L'CPFABORT                                              
CVNXTMSG L     RAR,CVSEGRTN                                                     
         BR    RAR                                                              
*                                                                               
CVERROR  OI    CPFERROR,L'CPFERROR                                              
CVABORT  OI    CPFABORT,L'CPFABORT                                              
CVNEXT   L     RAR,CVCOMRTN                                                     
         BR    RAR                                                              
*                                                                               
CVNVALID L     RAR,CVINVRTN        "x: invalid."                                
         BR    RAR                                                              
*                                                                               
CVNOACTN L     RAR,CVNOARTN        "No action taken."                           
         BR    RAR                                                              
*                                                                               
CVABSENT L     RAR,CVABSRTN        "Missing operand."                           
         BR    RAR                                                              
*                                                                               
CVMILERR L     RAR,CVMILRTN        "MILTEN Interface Error"                     
         BASR  RAR,RAR                                                          
         B     CVERROR                                                          
*                                                                               
         DS    XL64                Reserved                                     
*                                                                               
CVLITMSG LH    R1,@RAR             Signed literal offset                        
         AR    R1,RAR              Form ptr                                     
         LC    R0,@R1              Len                                          
         LA    R1,@R1+1            Loc                                          
         B     @RAR+2                                                           
         EJECT                                                                  
         DC    10F'-1'             Reserved                                     
*                                                                               
CVCOMRTN DC    V(COMMAND)                                                       
CVSEGRTN DC    V(COMMSEG)                                                       
CVMILRTN DC    V(MILERR)                                                        
CVINVRTN DC    V(INVALID)                                                       
CVABSRTN DC    V(ABSCENT)                                                       
CVNOARTN DC    V(NOACTION)                                                      
         DC    3A(-1)              Reserved                                     
*                                                                               
CVPARTBL DC    V(EPARTBL)          (GLOB)  Translate to even parity             
CVNPRTBL DC    V(NPARTBL)          (GLOB)  Translate to zero parity             
CVUPPTBL DC    V(UPPTBL)           (GLOB)  Translate to upper table             
CVLOWTBL DC    V(LOWTBL)           (GLOB)  Translate to lower table             
CVASCTBL DC    V(ASCTBL)           (GLOB)  EBCDIC to ASCII table                
CVEBCTBL DC    V(EBCTBL)           (GLOB)  ASCII to EBCDIC table                
CVBLTBL  DC    V(BLTBL)            (GLOB)  Blanks TRT table                     
CVNBLTBL DC    V(NBLTBL)           (GLOB)  Non-blanks TRT table                 
CVEB7TBL DC    V(EBCTBL7)          (GLOB)  ASCII-7 to EBCDIC table              
CVDOTTBL DC    V(DOTTBL)           (GLOB)  Non-printing to dot table            
         DC    5F'0'               Reserved                                     
*POP                                                                            
*-                                                                              
*-       Global counters                                                        
*-                                                                              
CVNCOM   DC    F'0'                No. of commands                              
CVNCOME  DC    F'0'                No. of commands from exec files              
CVNPIO   DC    F'0'                No. of page I/O's                            
CVNDIO   DC    F'0'                No. of disk I/O's                            
CVNRJE   DC    F'0'                No. of jobs submitted                        
CVNPRINT DC    F'0'                No. of prints                                
CVNSLICE DC    F'0'                No. of timeslice dispatches                  
CVNDISP  DC    F'0'                No. of dispatches                            
*                                                                               
CV#CNT1  DC    F'0'                Statistic counters,                          
CV#CNT2  DC    F'0'                  See SHOW WINFO Command in                  
CV#CNT3  DC    F'0'                  &WYL.MODE for current use                  
CV#CNT4  DC    F'0'                  and display.                               
CV#CNT5  DC    F'0'                                                             
CV#CNT6  DC    F'0'                                                             
*                                                                               
CVLOGCNT DC    F'0'                WYLBUR log info                              
CVLOGSZ  DC    F'0'                Buffer size (actual)                         
CVLOGBF  DC    F'0'                Buffer start                                 
CVLOGPT  DC    F'0'                Buffer ptr                                   
CVLOGBF2 DC    F'0'                Overflow buffer start                        
CVLOGPT2 DC    F'0'                Overflow buffer ptr (ie. end)                
CVLOGBSZ EQU   32*1024-128         Buffer Size (to request)                     
*                                                                               
CVNTIDLE DC    F'0'                No. of TIDLE terminal I/O's                  
         DC    F'-1'               Reserved                                     
*                                                                               
CVCPUTIM DC    F'1000'             10 seconds--CPU threshold                    
*                                                                               
CVNQSERV DC    F'0'                No. of QSERV SVCs issued                     
CVNQSERR DC    F'0'                No. of QSERV SVC errors                      
*                                                                               
         DC    31F'-1'             Reserved                                     
         EJECT                                                                  
***                                                                             
***      Checkpoint Area                                                        
***                                                                             
CVCHKIOB DC    V(CHECKIOB)         Checkpoint IOB                               
CVCHKBUF DC    A(*-*)              Checkpoint I/O buffer                        
CVCHKECB DC    F'0'                Checkpoint I/O ECB                           
CVCHKTAB DC    A(*-*)              User checkpoint table                        
         DC    5F'-1'              Reserved                                     
*                                                                               
CVCHKLEN DC    H'0'                Checkpoint record length                     
CVCHKTLN DC    H'0'                User table length                            
*                                                                               
CVCHKPUC DC    H'0'                Previous checkpoint update count             
         DC    H'-1'               Reserved                                     
*                                                                               
CVCHKNIO DC    F'0'                No. of checkpoint I/O's                      
*                                                                               
*                                                                               
CVCHKST  DS    0D        ********  Start of record prefix                       
         DC    C'CHEK'                                                          
*                                                                               
CVCHKUC  DC    H'0'                Checkpoint update count                      
         DC    H'0'                Reserved                                     
*                                                                               
CVCHKCLK DC    XL8'00'             Clock at last re-write                       
*                                                                               
CVCFLAG  FLAG                                                                   
         FLAG  CVFDUMP             - Do sysudump on abend                       
         FLAG  CVFRSV1             - Reserved flag                              
         FLAG  CVFNOSMF            - No SMF session accounting                  
         FLAG  CVFNONET            - Network interface is disabled              
         FLAG  CVFNONETCHK         - No network path checking                   
*                                                                               
CVPGFLAG FLAG                                                                   
         FLAG  CVPGFREAL           - Page fix page buffers                      
         FLAG  CVPGFVIRT           - Don't page fix page buffers                
         FLAG  CVPGFAUTO           - Auto switch between real/virt              
*                                                                               
CVPGSECS DC    H'60'               No. of secs between page adjusts             
CVPGLMIN DC    H'500'              Large config: min no. of buffers             
CVPGLMAX DC    H'3000'             Large config: max no. of buffers             
CVPGLO   DC    H'4'                Too low if under pages/sec                   
CVPGHI   DC    H'8'                Too high if over pages/sec                   
*                                                                               
CVPGMEG  DC    H'0'                Use small config if LE memory                
CVPGSMIN DC    H'0'                Small config: min no. of buffers             
CVPGSMAX DC    H'0'                Small config: max no. of buffers             
         DC    XL6'0'              Reserved                                     
*                                                                               
CVMSGCK  DC    F'0'                Clock                                        
CVMSG    DC    XL(&LINESZ)'00'     General message                              
*                                                                               
CVUMSGCK DC    F'0'                Clock                                        
CVUMSG   DC    XL(&LINESZ)'00'     User message                                 
*                                                                               
CVAMSGCK DC    F'0'                Clock                                        
CVAMSG   DC    XL(&LINESZ)'00'     Accounting message                           
*                                                                               
CVVMSGCK DC    F'0'                Clock                                        
CVVMSG   DC    XL(&LINESZ)'00'     View message                                 
*                                                                               
CVVOLCUR DC    H'0'                Next volume number to use                    
CVVOLMAX DC    H'0'                Maximum number of volumes                    
CVVOL#   EQU   5                   No. of entries                               
CVVOL    DC    XL(CVVOL#*6)'00'    Volume names                                 
*                                                                               
CVCPUMUL DS    F                   CPU multiplication factor                    
*                                                                               
         DS    9F                  Reserved                                     
         DS    0D                                                               
CVCHKPFX EQU   CVCHKST,*-CVCHKST,C'X'                                           
*                                                                               
*                                                                               
CVCHKST2 DS    0D        ********  Start of record suffix                       
         DS    F                   Reserved                                     
CVCHKEND DC    C'ENDC'                                                          
CVCHKSFX EQU   CVCHKST2,*-CVCHKST2,C'X'                                         
         EJECT                                                                  
***                                                                             
***  Allocated for Non-Stanford Use                                             
***                                                                             
         COPY  CVLOCAL                                                          
         ORG                                                                    
*                                                                               
CVSIZE   EQU   *-CVSTART                                                        
