*                                                                               
*  FCRYPTWA - FEAL CRYPT WORK AREA                                              
*                                                                               
FCRYPTWA RECORD BEGIN                                                           
FCINDEX  DS    F                                                                
FCKEY    DS    CL8                 THESE 24 BYTES SET ON INIT CALL              
FCTEXT   DS    CL8                                                              
FCCIPHER DS    CL8                                                              
         END                                                                    
