         MACRO                                                                  
&L       GENTER &SIZE,&LOCAL,&ID=                                               
.*       Re-done, 1/83, Niz                                                     
         AIF   ('&L' EQ '' OR '&LOCAL' EQ 'LOCAL').NEP                          
         ENTRY &L                                                               
&L       LABEL                                                                  
.NEP     AIF   ('&SIZE' EQ '').NOPUSH                                           
         XPUSH ,,&SIZE                                                          
.NOPUSH  ANOP                                                                   
&NAME    SETC  '&L'                                                             
         AIF   ('&ID' EQ '').SKIPID                                             
&NAME    SETC  '&ID'                                                            
.SKIPID  ANOP                                                                   
         BAL   R7,CVENT                                                         
         DC    CL8'&NAME '                                                      
         USING *,R7                ## base                                      
         MEND                                                                   
