LUVENTRY RECORD BEGIN                                                           
LUVNAME  DS    CL8                 Lookup name                                  
LUVCODE  DS    CL4                 Lookup value                                 
LUVGMTP  DS    A                   A(primary mask table)                        
LUVGENNO DS    A                   Number of generic entries                    
LUVGENP  DS    A                   A(first generic) GENSECT                     
LUVFLAGS DS    BL3                 FLAGS                                        
         DS    0F                                                               
LUVAGMTP DS    A                   A(alternate mask)                            
         END                                                                    
