LUVHDR   RECORD BEGIN                                                           
LUVENTNO DS    A                   Number of lookup entries                     
LUVENTLN DS    A                   Length of lookup entry                       
LUVENTS  DS    0F                  Location of first entry                      
         END                                                                    
