         MACRO                                                                  
&L       OSCRSTR &T                                                             
.*                                                                              
.**  macro to restore scan pointers from specified save area                    
.**  written by esr 9/23/70                                                     
.**  last modified by esr 9/23/70                                               
.*                                                                              
         AIF   ('&T' EQ '').DEFLT                                               
         AIF   ('&T'(1,1) EQ '(').REG   REG SPEC?                               
&L       MVC   CPOSCAN(6),&T                                                    
         MEXIT                                                                  
.DEFLT   ANOP                                                                   
&L       MVC   CPOSCAN(6),CPTELL                                                
         MEXIT                                                                  
.REG     ANOP                                                                   
&L       MVC   CPOSCAN(6),0&T                                                   
         MEND                                                                   
