         MACRO                                                                  
&NM      PAUSE  &FLAG,&JCB=                                                     
&NM      LABEL                                                                  
         AIF   ('&FLAG' EQ '').NOSET                                            
         AIF   ('&JCB' EQ '').HAVJCB                                            
         PUSH  USING                                                            
        $LA    R15,&JCB            Load JCB                                     
         USING JCB,R15                                                          
.HAVJCB  ANOP  ,                                                                
         SET   &FLAG                                                            
.NOSET   LA    R14,*+14                                                         
         STM   R0,R15,CPREGS       Save regs                                    
         L     R15,=V(DISPATCH)                                                 
         BR    R15                                                              
*                                                                               
         AIF   ('&JCB' EQ '' OR '&FLAG' EQ '').DONE                             
         DROP  R15                                                              
         POP   USING                                                            
.DONE    MEND                                                                   
