RDA#GETS DC    A(0)                # getrsc calls                               
RDA#FRED DC    A(0)                # freersc calls                              
RDA#FIND DC    A(0)                # found res group names                      
RDA#NFND DC    A(0)                # not found                                  
RDA#NOWN DC    A(0)                # res not owned by jcb                       
RDA#QJCB DC    A(0)                # jcbs queued                                
RDA#DQJC DC    A(0)                # jcbs dequeued                              
RDA#QRSC DC    A(0)                # resources queued                           
RDA#DQRS DC    A(0)                # resources dequeued                         
RDA#RDLT DC    A(0)                # resources deleted                          
RDA#QCPU DC    A(0)                # jcbs skipped by cpu queue.                 
