RSCGROUP RECORD BEGIN                                                           
RSGNAME  DC    CL8' '              resource group name                          
RSG#AUSE DC    F'0'                no. of use attempts                          
RSG#FREE DC    H'0'                no. of resources free                        
RSG#ACTV DC    H'0'                no. of resources in use                      
RSG#IMFR DC    F'0'                no. of with no wait required                 
RSGQACFW DC    A(0)                active resource forward chain                
RSGQACBK DC    A(0)                active resource backward chain               
RSGQFRFW DC    A(0)                free resource forward chain                  
RSGQFRBK DC    A(0)                free resource backward chain                 
RSG#WAIT DC    F'0'                no. of waits for the resource                
RSG@POST DC    A(0)                address of post routine                      
RSG@QUER DC    A(0)                address of jcb queue routine                 
RSGQJCFW DC    A(0)                forward jcb queue                            
RSGQJCBK DC    A(0)                backward jcb queue                           
RSG#MXJC DC    H'0'                max # jcbs ever queued                       
*                                                                               
RSGWTYPE DC    X'00'               resource wait type                           
RSGWLONG EQU   1                   this is a long wait                          
RSGWTERM EQU   2                   terminal wait                                
RSGWRSC  EQU   3                   resource busy wait                           
RSGWSHRT EQU   4                   short i/o wait                               
*                                                                               
RSGFLG1  FLAG  ,                   flag1                                        
         FLAG  RSG1ACTV            - resource group is active                   
         FLAG  RSG1QUED            - at least one jcb is queued                 
         FLAG  RSG1ASYN            - rsgroup is asynchronous                    
RSGFLGSZ EQU   *-RSGFLG1           size of flag area                            
         DS    0F                                                               
         END                                                                    
         SPACE 3                                                                
RESOURCE RECORD 'RSCHDR'           resource entry definition                    
