         MACRO                                                                  
&NM      RSCHDR &PFX=RSC,&NEXT=0,&PREV=0,&FORM=DSECT                            
.*       modified, 5/77, by JDN                                                 
&NM      LABEL                                                                  
         AIF   ('&FORM' NE 'DSECT').NOX                                         
&PFX.@NEXT DC    A(0)              next resource on queue                       
&PFX.@PREV DC    A(0)              previous resource on queue                   
&PFX.@JCB  DC    A(0)              address of owning jcb                        
&PFX.$ECB  DC    A(0)              resource ecb                                 
&PFX.#USE  DC    A(0)              no. of uses of resource                      
*                                                                               
&PFX.FLAGS FLAG  ,                 flags                                        
         FLAG  &PFX.1ACTV          - ecb is active                              
         FLAG  &PFX.1@ECB          - $ecb is addr                               
         FLAG  &PFX.1ASYN          - asynchronous resource                      
         DS    0F                                                               
         MEXIT                                                                  
.NOX     ANOP                                                                   
         DC    A(&NEXT),A(&PREV)                                                
         DC    A(0),A(0),A(0)                                                   
         DC    X'00'                                                            
         DS    0F                                                               
         MEND                                                                   
