         MACRO                                                                  
&L       SCAN  &SCKWS,&SKIP,&STOP                                               
.*                                                                              
.*  SCAN MACRO                                                                  
.*                                                                              
.*  NEW/SIMPLIFIED  6/90  -CH                                                   
.*                                                                              
         GBLB  &$PCODE                                                          
&L       XPUSH R2,R5                                                            
.*                                                                              
.* SCKWS PARM                                                                   
.DOKWS   ANOP                                                                   
         AIF   ('&SCKWS' EQ '').NOKWS                                           
         AIF   (&$PCODE).CGEN                                                   
         L     R0,=A(&SCKWS)                                                    
         AGO   .DONEKWS                                                         
.CGEN    ANOP                                                                   
         MNOTE *,'C-CODE R0 = (long int)((char *)(  && &SCKWA ));'              
         AGO   .DONEKWS                                                         
.NOKWS   ANOP                                                                   
         CLEAR R0                                                               
         AGO   .DONEKWS                                                         
.DONEKWS ANOP                                                                   
.*                                                                              
.* SKIP PARM                                                                    
.DOSKIP  ANOP                                                                   
         AIF   ('&SKIP' EQ '').NOSKIP                                           
         LS    R2,R3,&SKIP                                                      
         ANOP  .DONESKIP                                                        
.NOSKIP  ANOP                                                                   
         CLEAR R2                                                               
         ANOP  .DONESKIP                                                        
.DONESKIP ANOP                                                                  
.*                                                                              
.* STOP PARM                                                                    
.DOSTOP  ANOP                                                                   
         AIF   ('&STOP' EQ '').NOSTOP                                           
         LS    R4,R5,&STOP                                                      
         ANOP  .DONESTOP                                                        
.NOSTOP  ANOP                                                                   
         CLEAR R4                                                               
         ANOP  .DONESTOP                                                        
.DONESTOP ANOP                                                                  
.*                                                                              
.* CALL SCAN                                                                    
         SCCBADR R1                                                             
         VCALL NSCANINT                                                         
.*                                                                              
.*                                                                              
         XPOP  R2,R5                                                            
         LTR   R15,R15                                                          
.*                                                                              
         MEND                                                                   
