*                                                                               
*  SCRYPTWA - SIMPLE CRYPT WORK AREA                                            
*                                                                               
SCRYPTWA RECORD BEGIN                                                           
SCXN     DS    F                                                                
SCXNM3   DS    F                                                                
SCXNM31  DS    F                                                                
SCKEY    DS    CL32                                                             
         END                                                                    
