         MACRO                                                                  
&L       SETSCKWS &TABLE                                                        
.*                                                                              
.*       New scanner, 11/89, Niz/Chaz                                           
.*                                                                              
.*  CLOBBERS R14, R15                                                           
.*                                                                              
         GBLB  &$PCODE                                                          
         AIF   ('&TABLE' NE '').GOTTABLE                                        
&L       LABEL ,                                                                
         SCCBADR R14                                                            
         CLEAR R15                                                              
         ST    R15,NSCNKWS-NSCNCB(R14)                                          
         CLEAR R14                                                              
         AGO   .MDONE                                                           
.GOTTABLE ANOP                                                                  
         AIF   (&$PCODE).CGEN                                                   
&L       LABEL ,                                                                
         SCCBADR R14                                                            
         MVC   NSCNKWS-NSCNCB(L'NSCNKWS,R14),=A(&TABLE)                         
         CLEAR R14                                                              
         CLEAR R15                                                              
         MEXIT                                                                  
.CGEN    ANOP                                                                   
&L       LABEL ,                                                                
         SCCBADR R14                                                            
         MNOTE *,'C-CODE R15 = (long int)((char *)( && &TABLE )); '             
         ST    R15,NSCNKWS-NSCNCB(R14)                                          
         CLEAR R14                                                              
         CLEAR R15                                                              
.MDONE   ANOP                                                                   
         MEND                                                                   
