SHDSARGS RECORD BEGIN                                                           
SHDSFLAG FLAG  ,                                                                
         FLAG  SHDSALL             All                                          
         FLAG  SHDSTRK             Tracks                                       
         FLAG  SHDSTYP             Typed                                        
         FLAG  SHDSDAT             Dated                                        
         FLAG  SHDSSCR             Scratch                                      
         FLAG  SHDSINT             Internal                                     
         FLAG  SHDSONLY            Only                                         
         FLAG  SHDSLIK             Like was explicit                            
SHDSFLG2 FLAG  SHDSNEW             New format display                           
         DS    0F                                                               
SHDSUPL  DS    F                                                                
SHDSUPB  DS    CL128                                                            
SHDSLOWL DS    F                                                                
SHDSLOWB DS    CL128                                                            
SHDSLIKL DS    F                                                                
SHDSLIKE DS    CL128                                                            
*                                                                               
* Space for page number which contain the output                                
* from SHOW DIR (used only by Wings for now).                                   
*                                                                               
SHDSPGCT DS    H                  Number of pages                               
SHDSPAGS DS    25F                Slots for pages                               
SHDSMXPG EQU   (*-SHDSPAGS)/4                                                   
*                                                                               
* The following fields are used during the display of                           
* the information on the various pages by the DIR                               
* module.                                                                       
SHDSCPG  DS    F                  Current page array index                      
SHDSCOFF DS    F                  Offset in current page                        
         END                                                                    
