         MACRO                                                                  
.* added by noid 02/10/86                                                       
.* changed by CH to be inline 02/91. (ie. no longer calls tpop rtn)             
.* macro pops current tseg buffer.  the former cpseg info is                    
.* is also restored from the stack.  see TPUSH macro and routine.               
&L       TPOP  &OPTIONS                                                         
&L       LABEL ,                                                                
         AIF   ('&OPTIONS' EQ '').NONE                                          
         AIF   ('&OPTIONS' EQ 'WRITE').WRITE                                    
         AIF   ('&OPTIONS' EQ 'JUNK').JUNK                                      
         MNOTE 8,'INVALID TPOP OPTION.  VALID OPTIONS: WRITE, JUNK.'            
.NONE    ANOP                                                                   
.WRITE   ANOP                                                                   
         XPUSH R15,R1                                                           
         SEG   ,,.CPSEG,WR         SAME AS TWRITE                               
         XPOP  R15,R1                                                           
         XPOP  ,,L'CPSEG+1024                                                   
         MVC   CPSEG,@R13                                                       
         MEXIT                                                                  
.JUNK    ANOP                                                                   
         XPOP  ,,L'CPSEG+1024                                                   
         MVC   CPSEG,@R13                                                       
         MEND                                                                   
