         MACRO                                                                  
.* added by noid 02/10/86                                                       
.* macro pushes old tseg buffer,  a new 1024 byte buffer is                     
.* obtained from the stack area.  new cpseg info is set up.                     
&L       TPUSH &OPTIONS,&NEWRTN=SAME                                            
&L       LABEL ,                                                                
         AIF   ('&OPTIONS' EQ '').TPCONT                                        
         MNOTE 8,'Invalid TPUSH option.'                                        
.TPCONT  ANOP                                                                   
         AIF   ('&NEWRTN' EQ 'SAME').TPSAME                                     
         AIF   ('&NEWRTN' EQ 'NULL').TPNULL                                     
         MNOTE 8,'Invalid TPUSH NEWRTN= option.'                                
         AGO   .TPDONE                                                          
.TPSAME  ANOP                                                                   
         VCALL TPUSH                                                            
         AGO   .TPDONE                                                          
.TPNULL  ANOP                                                                   
         VCALL TPUSH                                                            
         CLEAR CPSEGRTN                                                         
.TPDONE  ANOP                                                                   
         MEND                                                                   
