RNE      RECORD BEGIN              Range entry (see rngcb)                      
RNELEN   DS    X                   Length                                       
RNEIFLAG FLAG                                                                   
         FLAG  RNEFMULT            - Multiple                                   
*                                                                               
         DS    XL2                 Reserved                                     
*                                                                               
RNEFLAG  FLAG                                                                   
         FLAG  RNEFQ               - Text was quoted                            
         FLAG  RNEFALL             - Include pseudo stuff                       
         DS    XL3                 Reserved                                     
*                                                                               
         DS    2F                  Reserved                                     
RNEHDR   EQU   RNEFLAG,*-RNEFLAG,C'X'                                           
*                                                                               
RNETEXT  DS    CL20                Range text                                   
         END                                                                    
         EJECT                                                                  
RNGCB    RECORD BEGIN                                                           
*                                                                               
RNGOPT   EQU   *,4,C'F'            Range option word                            
         DS    H                   Reserved                                     
RNGTYPE  DS    X                   Range type                                   
RNGTFE   EQU   1                   - Fe-range wanted                            
RNGTPORT EQU   2                   - Port-range wanted                          
RNGTSES  EQU   3                   - Session-range wanted                       
*                                                                               
RNGOFLAG FLAG                                                                   
         FLAG  RNGFDALL            - Default range is all                       
         FLAG  RNGFDOUR            - Default range is our line                  
         FLAG  RNGFMULT            - Multiple                                   
         FLAG  RNGFLIST            - List                                       
         FLAG  RNGFVER             - Verify                                     
*                                                                               
RNGCOSEL DS    A          [Order]  Selection co-routine addr                    
RNGCORTN DS    A          [Order]  Co-routine addr                              
*                                                                               
RNGFLAG  FLAG                                                                   
         FLAG  RNGFALL             - All                                        
         FLAG  RNGFDIAL            - Dial                                       
         FLAG  RNGFTRAN            - Tran                                       
         FLAG  RNGFDIR             - Direct                                     
         FLAG  RNGFLEAS            - Leased                                     
*                                                                               
RNGFLAG2 FLAG                                                                   
         FLAG  RNGFSOME            - Non-void range                             
*                                                                               
RNGTTYPE DS    X                   Device type to match (see "fsbtype")         
*                                                                               
RNGLTYPE DS    X                   Local copy of "rngtype"                      
*                                                                               
         DS    2F                  Reserved                                     
*                                                                               
RNG#     EQU   8                   Max no. of range items                       
RNGM     DS    H                   Max offset from "rng"                        
RNGN     DS    H                   Current offset from "rng"                    
RNG      DS    (RNG#)XL(L'RNE)     Range area                                   
*                                                                               
RNGITEMX DS    0F                                                               
         ORG   RNGITEMX+L'FSB                                                   
         ORG   RNGITEMX+L'PSB                                                   
         ORG   RNGITEMX+L'SIB                                                   
         ORG                                                                    
RNGITEM  EQU   RNGITEMX,*-RNGITEMX,C'X'                                         
*                                                                               
         END                                                                    
