         MACRO                                                                  
&L       UPATH                                                                  
.*  Added 11/86, Niz; modified 10/91, Niz                                       
         GBLA  &PRESSZ,&LINESZ                                                  
*box                                                                            
*                                                                               
*    User Path control block.                                                   
*                                                                               
         DS    0F                                                               
         DC    CL4'PATH'                                                        
&L.PNO   DC    F'0'                Path number                                  
&L.JCBP  DC    A(0)                Owner's JCB ptr                              
&L.LINK  DC    A(0)                Next UPATH on waiting queue                  
*                                                                               
&L.WRQH  DC    A(0)                Pending write queue head                     
&L.WRQT  DC    A(0)                Pending write queue tail                     
*                                                                               
&L.FLG1  FLAG                                                                   
         FLAG  &L.FGLOBAL          - This is a global path                      
         FLAG  &L.FNOWAIT          - NOWAIT specified                           
         FLAG  &L.FOPENING         - Path is opening                            
         FLAG  &L.FINT             - Path can interrupt term I/O                
         FLAG  &L.FHDR             - Multiple line data format                  
         FLAG  &L.FNOFULLQWAIT     - Don't wait if path queue full              
*                                                                               
&L.RC    DS    F                   Return code                                  
&L.RCMP  DS    2A                  Return code message ptrs                     
*                                                                               
&L.WAIT  DC    F'0'                Max no of secs to wait (0=nolim)             
*                                                                               
&L.DLOC  DC    A(0)                Remaining data location                      
&L.DLEN  DC    A(0)                Remaining data length                        
*                                                                               
&L.XCLK  DC    F'0'                TOD Clock at timeout                         
*                                                                               
&L.PASC  DC    F'0'                Partner's ASCB ptr                           
&L.PLNO  DC    H'0'                Partner's line number                        
&L.PJOB  DC    XL8'00'             Partner's jobname                            
&L.PACT  DC    XL8'00'             Partner's account                            
&L.PNAM  DC    XL20'00'            Partner's user name                          
&L.PTAG  DC    XL16'00'            Partner's session tag                        
*                                                                               
         PATH  VERSION=2,PFX=&L,FLAG=&L.SFLG,ECB=*-*,                  *        
               MYTAG=MYTAG,PASS=PROD,BUFSIZE=16384                              
*                                                                               
&L.SFLG  DC    X'00'               Suzan post flag                              
&L.PMSK  DC    X'00'               PATHWAIT post mask                           
         DC    XL2'00'             Reserved                                     
         MEND                                                                   
