*box                                                                            
*                                                                               
*  Christa initialization parameters                                            
*                                                                               
USINPRMS RECORD BEGIN                                                           
USINID   DC    CL4'USIN'           BLOCK IDENTIFIER                             
USINPATH DC    CL8'CHRISTA'        MAJOR PATHNAME FOR CONNECTION                
USINTOUT DC    A(0)                CONNECTION TIMEOUT (.01 SECS)                
         END   ,                                                                
