         MACRO                                                                  
         VOLINFO                                                                
.* added 9/81, JDN                                                              
VOLINFO  RECORD BEGIN                                                           
VOLNAME  DS    CL6                 volume name                                  
*                                                                               
VOLFRTRK DS    F                   no. of free tracks on volume                 
VOLFREXT DS    F                   no. of free extents on volume                
VOLLGTRK DS    F                   size of largest free extent                  
VOLSTATS EQU   VOLFRTRK,*-VOLFRTRK,C'X'                                         
         END                                                                    
         MEND                                                                   
