         MACRO                                                                  
&NM      WAITON &CALL,&CLEAR                                                    
.*                                                                              
.**  Waiton macro calls routine to resume main task.                            
.**                                                                             
.**    Last modified by JDN 9/02/87                                             
.*                                                                              
         AIF   ('&CALL' EQ '').BAL                                              
         AIF   ('&CALL'(1,1) EQ 'X').VCALL                                      
         MNOTE 4,'&CALL INVALID - VCALL ASSUMED'                                
         AGO   .VCALL                                                           
.BAL     ANOP                                                                   
&NM      LCALL WAITON              Call subtask wait routine                    
         AGO   .USING                                                           
.VCALL   ANOP                                                                   
&NM      VCALL WAITON              Call subtask wait routine                    
.USING   AIF  ('&CLEAR' EQ '').NOCLR                                            
         AIF  ('&CLEAR'(1,1) NE 'C').NOCLR                                      
         CLEAR WAABEND             Zot abend addr                               
.NOCLR   MEND                                                                   
