         MACRO                                                                  
&L       XENTER &R,&S,&SIZE,&LOCAL,&ID=,&TRACE=YES                              
.*       Re-done, 1/83, Niz;  Modified, 11/83, Niz                              
         AIF   ('&L' EQ '' OR '&LOCAL' EQ 'LOCAL').SKIPENT                      
         ENTRY &L                                                               
.SKIPENT ANOP                                                                   
&L       ST    R14,@R13                                                         
         AIF   ('&R&S' NE '').XPUSH                                             
         XPUSH R2,R8,&SIZE,PTR=R8,SKIP=4                                        
         AGO   .COM                                                             
.XPUSH   XPUSH &R,&S,&SIZE,PTR=R8,SKIP=4                                        
.*                                                                              
.COM     AIF   ('&TRACE' EQ 'YES').TRACE                                        
         BASE                                                                   
         MEXIT                                                                  
.*                                                                              
.TRACE   BAL   BR,CVENT                                                         
&NAME    SETC  '&ID'                                                            
         AIF   ('&ID' NE '').NAME                                               
&NAME    SETC  '&L'                                                             
.NAME    DC    CL8'&NAME '                                                      
         USING *,BR                                                             
         MEND                                                                   
