         MACRO
&L       OSFPB &PFX=OSF,&DSECT=NO
         AIF   ('&DSECT' EQ 'NO').NODSECT
OSFPB    DSECT
         AGO   .CHKLABL
.NODSECT ANOP
OSFPB    DS    0F
.CHKLABL AIF   ('&L' EQ '').NOLABL
&L       DS    0F                      LABEL ON MACRO CALL
.NOLABL  ANOP
*
*  OS FILE PARAMETER BLOCK
*
&PFX.PBDS  DS    0F
&PFX.DSN   DC    CL44' '               DSNAME
&PFX.MEM   DC    CL8' '                MEMBER NAME
&PFX.VOL   DC    CL6' '                VOLUME ID
*
&PFX.DISP  DC    X'00'                 DATA SET DISPOSITION FLAGS
&PFX.MOD   EQU   X'80'                 MOD DS
&PFX.NEW   EQU   X'C0'                 NEW DS
&PFX.OLD   EQU   X'40'                 OLD DS
&PFX.SHR   EQU   X'08'                 SHARE (IMPLIES OLD)
*
&PFX.DSORG DC    X'00'                 DATA SET ORGANIZATION FLAGS
&PFX.PS    EQU   X'40'                 SEQUENTIAL DATA SET
&PFX.DA    EQU   X'20'                 DIRECT ACCESS DATA SET
&PFX.PO    EQU   X'02'                 PARTITIONED DATA SET
*
&PFX.RECFM DC    X'00'                 DATA SET FORMAT FLAGS
&PFX.RCFMU EQU   X'C0'                 RECFM=U
&PFX.RCFMF EQU   X'80'                 RECFM=F
&PFX.RCFMV EQU   X'40'                 RECFM=V
&PFX.RCFMB EQU   X'10'                 RECFM=?B
&PFX.RCFMS EQU   X'08'                 RECFM=?S
&PFX.RCFMA EQU   X'04'                 RECFM=?A
&PFX.RCFMM EQU   X'02'                 RECFM=?M
*
&PFX.KEY   DC    X'00'                 KEY LENGTH
&PFX.LRECL DC    H'0'                  LRECL
&PFX.BLKSZ DC    H'0'                  BLOCKSIZE
*
&PFX.SPTYP DC    X'00'                 SPACE FLAGS
&PFX.SPCYL EQU   X'C0'                 CYLINDER ALLOCATION
&PFX.SPTRK EQU   X'80'                 TRACK ALLOCATION
&PFX.SPBLK EQU   X'40'                 BLOCK ALLOCATION
&PFX.SPCON EQU   X'08'                 CONTIG
&PFX.SPMXG EQU   X'04'                 MAXIMUM CONTIG
&PFX.SPRND EQU   X'01'                 ROUND
*
&PFX.FLAG  DC    X'00'                 MISCELLANY
&PFX.SPRLS EQU   X'20'                 RLSE
&PFX.IN    EQU   X'08'                 WILL READ DATA SET
&PFX.OUT   EQU   X'04'                 WILL WRITE DATA SET
&PFX.UPD   EQU   X'02'                 WILL UPDATE DATA SET
*
&PFX.SPQTY DC    F'0'                  PRIMARY ALLOCATION QUANTITY
&PFX.SSQTY DC    F'0'                  SECONDARY ALLOCATION QUANTITY
&PFX.SDBLK DC    H'0'                  NUMBER OF DIRECTORY BLOCKS
*
         DC    22X'00'                 RESERVED
         MEND
