         MACRO                                                          00002000
&L       SYSQS &AR,&LR,&AP,&LP                                          00004000
         LCLA  &X,&N                                                    00006000
         LCLC  &C                                                       00008000
         AIF   ('&AP' EQ '').NSTR                                       00010000
         AIF   ('&AP'(1,1) EQ '''').STR                                 00012000
.NSTR    ANOP                                                           00014000
&L       SYSLR &AR,&AP,ERR='***** LOCATION MISSING *****'               00016000
.LL      AIF   ('&LR' EQ '').END                                        00018000
         SYSLR &LR,&LP,ERR='***** LENGTH MISSING *****'                 00020000
         MEXIT                                                          00022000
.STR     AIF   ('&LP' NE '').LG                                         00024000
&L       LA    &AR,=C&AP                                                00026000
&X       SETA  1                                                        00028000
&C       SETC  '&&'                                                     00030000
.LOOP    ANOP                                                           00032000
&X       SETA  &X+1                                                     00034000
         AIF   (&X GE K'&AP).EL                                         00036000
&N       SETA  &N+1                                                     00038000
         AIF   ('&AP'(&X,1) NE '''' AND '&AP'(&X,1) NE '&C'(1,1)).LOOP  00040000
&X       SETA  &X+1                                                     00042000
         AGO   .LOOP                                                    00044000
.EL      LA    &LR,&N                                                   00046000
         MEXIT                                                          00048000
.LG      ANOP                                                           00050000
&L       LA    &AR,=CL(&LP)&AP                                          00052000
         AGO   .LL                                                      00054000
.END     MEND                                                           00056000
