* %GOTO SKPUPB;                                                         00050000
         MACRO                                                          00100000
         ADRUPB                                                         00150000
         EJECT                                                          00200000
*%SKPUPB:;                                                              00250000
*@EJECT;                                                                00300000
* /* *************************************************************** */ 00350000
* /*                                                                 */ 00400000
* /*   MACRO NAME = ADRUPB                                           */ 00450000
* /*                                                                 */ 00500000
* /*   DESCRIPTIVE NAME = INSTALLATION AUTHORIZATION EXIT ROUTINE    */ 00550000
* /*                      INTERFACE BLOCK                            */ 00600000
* /*                                                                 */ 00627700
* /*******************************************************************/ 00655400
* /*PROPRIETARY V3 STATEMENT                                         */ 00683100
* /*LICENSED MATERIALS - PROPERTY OF IBM                             */ 00710800
* /*"RESTRICTED MATERIALS OF IBM"                                    */ 00738500
* /*5695-DF1                                                         */ 00759200
* /*(C) COPYRIGHT 1980,1986  IBM CORP.                               */ 00779900
* /*END PROPRIETARY V3 STATEMENT                                     */ 00800600
* /*******************************************************************/ 00821600
* /*                                                                 */ 00850000
* /*   STATUS = VERSION 2 RELEASE 1                              @V21*/ 00900000
* /*                                                                 */ 00950000
* /*-------------------------------------------------------- @LA52968*/ 01000000
* /*   ALTHOUGH PROVIDED IN A GENERAL INTERFACE LIBRARY,     @LA52968*/ 01050000
* /*   ADRUPB IS NOT TO BE USED AS A GENERAL PROGRAMMING     @LA52968*/ 01100000
* /*   INTERFACE.  REFER TO PRODUCT DOCUMENTATION TO         @LA52968*/ 01150000
* /*   DETERMINE INTENDED USAGE.                             @LA52968*/ 01200000
* /*-------------------------------------------------------- @LA52968*/ 01250000
* /*                                                                 */ 01300000
* /*   FUNCTION =  INDICATES TO THE EXIT ROUTINE THE FUNCTION TYPE,  */ 01350000
* /*               THE MODE (INPUT/OUTPUT), THE ADDRESS OF THE       */ 01400000
* /*               VOLUME SERIAL FIELD IN THE UCB &, OPTIONALLY,     */ 01450000
* /*               THE ADDRESS OF THE FORMAT 1 DSCB FIELD.           */ 01500000
* /*                                                                 */ 01550000
* /*   INVOCATION = PLS -- INCLUDE ADRUPB                            */ 01600000
* /*                                                                 */ 01650000
* /*   CHANGE ACTIVITY =                                             */ 01700000
* /*        ADD CHANGES FOR RELEASE 2.0 DEVELOPMENT 18MAR82      @R20*/ 01750000
* /*        ADD FLAG BITS FOR COMPRESS AND RELEASE  08FEB85      @V21*/ 01800000
* /*     ADDED WARNING FOR CDPI REQUIREMENTS    NOV 13, 1989 @LA52968*/ 01850000
* /*     MAINTENANCE ROLL-UP                    JUN 14, 1991 @NA00267*/ 01900000
* /*     BUILDSA SUPPORT                        DEC 08, 1995 @OW14835*/ 01912500
* /*                                                                 */ 01925000
* /*   CHANGE DATE: 08DEC95                                  @OW14835*/ 01937500
* /* *************************************************************** */ 01950000
* %GOTO PLSUPB;                                                         02000000
ADRUPB   DSECT                                                          02050000
UPDSCBAD DS    F'0'                /* 0 IF UPIND IS A 1          @R20*/ 02100000
*                                  /* F1 DSCB ADDR IF BOTH UPIND @R20*/ 02150000
*                                  /* AND UPVSMDAT ARE ZERO      @R20*/ 02200000
*                                  /* ADDR OF 44-BYTE CLUSTER    @R20*/ 02250000
*                                  /* NAME IF UPIND IS ZERO AND  @R20*/ 02300000
*                                  /* UPVSMDAT IS A 1            @R20*/ 02350000
UPCATP   DS    F'0'                /* ADDR OF 44-BYTE CATALOG    @R20*/ 02400000
*                                  /* NAME IF UPVSMDAT IS A 1    @R20*/ 02450000
UPUCBVSA DS    F'0'                /* UCB VOLSER ADDR                */ 02500000
UPFLG1   DS    X'0'                /* FLAG BYTE 1                    */ 02550000
UPEOL    EQU   X'80'               /* END OF LIST INDICATOR, ALWAYS 1*/ 02600000
UPFRTO   EQU   X'40'               /* 1 = SOURCE VOL, 0 = DEST. VOL  */ 02650000
UPDUMP   EQU   X'20'               /* 1 = DUMP FUNCTION              */ 02700000
UPREST   EQU   X'10'               /* 1 = RESTORE FUNCTION           */ 02750000
UPCOPY   EQU   X'08'               /* 1 = COPY FUNCTION              */ 02800000
UPPRINT  EQU   X'04'               /* 1 = PRINT FUNCTION             */ 02850000
UPDEFRAG EQU   X'02'               /* 1 = DEFRAG FUNCTION        @R20*/ 02900000
UPCOMPR  EQU   X'01'               /* 1 = COMPRESS FUNCTION      @V21*/ 02950000
UPFLG2   DS    X'0'                /* FLAG BYTE 2                    */ 03000000
UPDSN    EQU   X'80'               /* 1 = DATASET OPERATION          */ 03050000
UPFULL   EQU   X'40'               /* 1 = FULL VOLUME OPERATION      */ 03100000
UPPART   EQU   X'20'               /* 1 = PARTIAL VOLUME OPERATION   */ 03150000
UPRLSE   EQU   X'10'               /* 1 = RELEASE FUNCTION       @V21*/ 03200000
UPBLDSA  EQU   X'08'               /* 1 = BUILDSA IPL(DASD)  @OW14835*/ 03225000
UPFLG3   DS    X'0'                /* FLAG BYTE 3                @R20*/ 03250000
UPIND    EQU   X'80'               /* 1 = VOLUME LEVEL CHECK     @R20*/ 03300000
*                                  /* 0 = DATASET LEVEL CHECK    @R20*/ 03350000
UPVSMDAT EQU   X'40'               /* 1 = CLUSTER AND CATALOG    @R20*/ 03400000
*                                  /* NAMES PASSED               @R20*/ 03450000
UPFLG4   DS    X'0'                /* FLAG BYTE 4 - RESERVED     @V21*/ 03500000
         DS    0F                  /* RESERVED                       */ 03550000
UPBCBLEN EQU   *-ADRUPB                                                 03600000
         MEND                                                           03650000
*%PLSUPB:;                                                              03700000
*   DCL 1 ADRUPB     BASED BDY(WORD),                                   03750000
*         2 UPDSCBAD PTR(31),      /* 0 IF UPIND IS A 1          @R20*/ 03800000
*                                  /* F1 DSCB ADDR IF BOTH UPIND @R20*/ 03850000
*                                  /* AND UPVSMDAT ARE ZERO      @R20*/ 03900000
*                                  /* ADDR OF 44-BYTE CLUSTER    @R20*/ 03950000
*                                  /* NAME IF UPIND IS ZERO AND  @R20*/ 04000000
*                                  /* UPVSMDAT IS A 1            @R20*/ 04050000
*         2 UPCATP   PTR(31),      /* ADDR OF 44-BYTE CATALOG    @R20*/ 04100000
*                                  /* NAME IF UPVSMDAT IS A 1    @R20*/ 04150000
*         2 UPUCBVSA PTR(31),      /* UCB VOLSER ADDR                */ 04200000
*         2 UPFLG1   BIT(8),       /* FLAG BYTE 1                    */ 04250000
*           3 UPEOL  BIT(1),       /* END OF LIST INDICATOR, ALWAYS 1*/ 04300000
*           3 UPFRTO BIT(1),       /* 1 = SOURCE VOL, 0 = DEST. VOL  */ 04350000
*           3 UPDUMP BIT(1),       /* 1 = DUMP FUNCTION              */ 04400000
*           3 UPREST BIT(1),       /* 1 = RESTORE FUNCTION           */ 04450000
*           3 UPCOPY BIT(1),       /* 1 = COPY FUNCTION              */ 04500000
*           3 UPPRINT BIT(1),      /* 1 = PRINT FUNCTION             */ 04550000
*           3 UPDEFRAG BIT(1),     /* 1 = DEFRAG FUNCTION        @R20*/ 04600000
*           3 UPCOMPR BIT(1),      /* 1 = COMPRESS FUNCTION      @V21*/ 04650000
*         2 UPFLG2   BIT(8),       /* FLAG BYTE 2                    */ 04700000
*           3 UPDSN  BIT(1),       /* 1 = DATASET OPERATION          */ 04750000
*           3 UPFULL BIT(1),       /* 1 = FULL VOLUME OPERATION      */ 04800000
*           3 UPPART BIT(1),       /* 1 = PARTIAL VOLUME OPERATION   */ 04850000
*           3 UPRLSE BIT(1),       /* 1 = RELEASE FUNCTION       @V21*/ 04900000
*           3 UPBLDSA BIT(1),      /* 1 = BUILDSA IPL(DASD)  @OW14835*/ 04933300
*           3 *      BIT(3),       /* RESERVED               @OW14835*/ 04966600
*         2 UPFLG3   BIT(8),       /* FLAG BYTE 3                @R20*/ 05000000
*           3 UPIND  BIT(1),       /* 1 = VOLUME LEVEL CHECK     @R20*/ 05050000
*                                  /* 0 = DATASET LEVEL CHECK    @R20*/ 05100000
*           3 UPVSMDAT BIT(1),     /* 1 = CLUSTER AND CATALOG    @R20*/ 05150000
*                                  /* NAMES PASSED               @R20*/ 05200000
*         2 UPFLG4   BIT(8),       /* FLAG BYTE 4 - RESERVED     @V21*/ 05250000
*         2 *       CHAR(0)        /* FORCE WORD ALIGNMENT       @V21*/ 05300000
*                    BDY(WORD);                                         05350000
