* %GOTO SKPUNQB;                                                        00050000
         MACRO                                                          00100000
         ADRUNQB                                                        00150000
         EJECT                                                          00200000
*%SKPUNQB:;                                                             00250000
*@EJECT;                                                                00300000
* /* *************************************************************** */ 00350000
* /*                                                                 */ 00400000
* /*   MACRO NAME = ADRUNQB                                          */ 00450000
* /*                                                                 */ 00500000
* /*   DESCRIPTIVE NAME = INSTALLATION ENQ EXIT ROUTINE              */ 00550000
* /*                      INTERFACE BLOCK                            */ 00600000
* /*                                                                 */ 00627700
* /*******************************************************************/ 00655400
* /*PROPRIETARY V3 STATEMENT                                         */ 00683100
* /*LICENSED MATERIALS - PROPERTY OF IBM                             */ 00710800
* /*"RESTRICTED MATERIALS OF IBM"                                    */ 00738500
* /*5695-DF1                                                         */ 00759200
* /*(C) COPYRIGHT 1983,1986  IBM CORP.                               */ 00779900
* /*END PROPRIETARY V3 STATEMENT                                     */ 00800600
* /*******************************************************************/ 00821600
* /*                                                                 */ 00850000
* /*   STATUS = VERSION 1 RELEASE 2                                  */ 00900000
* /*                                                                 */ 00950000
* /*-------------------------------------------------------- @LA52968*/ 01000000
* /*   ALTHOUGH PROVIDED IN A GENERAL INTERFACE LIBRARY,     @LA52968*/ 01050000
* /*   ADRUNQB IS NOT TO BE USED AS A GENERAL PROGRAMMING    @LA52968*/ 01100000
* /*   INTERFACE.  REFER TO PRODUCT DOCUMENTATION TO         @LA52968*/ 01150000
* /*   DETERMINE INTENDED USAGE.                             @LA52968*/ 01200000
* /*-------------------------------------------------------- @LA52968*/ 01250000
* /*                                                                 */ 01300000
* /*   FUNCTION =  INDICATES TO THE EXIT ROUTINE THE FUNCTION TYPE,  */ 01350000
* /*               AND THE ADDRESS OF THE VOLUME SERIAL FIELD        */ 01400000
* /*               IN THE UCB                                        */ 01450000
* /*                                                                 */ 01500000
* /*   INVOCATION = PLS -- INCLUDE ADRUNQB                           */ 01550000
* /*                                                                 */ 01600000
* /*   CHANGE ACTIVITY =                                             */ 01650000
* /*     ADDED WARNING FOR CDPI REQUIREMENTS    NOV 13, 1989 @LA52968*/ 01700000
* /*     MAINTENANCE ROLL-UP                    JUN 14, 1991 @NA00267*/ 01750000
* /* *************************************************************** */ 01800000
* %GOTO PLSUNQB;                                                        01850000
ADRUNQB  DSECT                                                          01900000
UNUCBVSA DS    F'0'                /* UCB VOLSER ADDR                */ 01950000
UNFLG1   DS    X'0'                /* FLAG BYTE 1                    */ 02000000
UNEOL    EQU   X'80'               /* END OF LIST INDICATOR, ALWAYS 1*/ 02050000
UNDUMP   EQU   X'20'               /* 1 = DUMP FUNCTION              */ 02100000
UNCOPY   EQU   X'08'               /* 1 = COPY FUNCTION              */ 02150000
UNPRINT  EQU   X'04'               /* 1 = PRINT FUNCTION             */ 02200000
UNFLG2   DS    X'0'                /* FLAG BYTE 2                    */ 02250000
UNDSN    EQU   X'80'               /* 1 = DATASET OPERATION          */ 02300000
UNFULL   EQU   X'40'               /* 1 = FULL VOLUME OPERATION      */ 02350000
UNPART   EQU   X'20'               /* 1 = PARTIAL VOLUME OPERATION   */ 02400000
UNFLG3   DS    X'0'                /* FLAG BYTE 3                    */ 02450000
UNTOLNQF EQU   X'80'               /* 1 = TOL(ENQF) USED         @R20*/ 02500000
         DS    CL1                 /* RESERVED                       */ 02550000
UNQBLEN  EQU   *-ADRUNQB                                                02600000
         MEND                                                           02650000
*%PLSUNQB:;                                                             02700000
*   DCL 1 ADRUNQB    BASED BDY(WORD),                                   02750000
*         2 UNUCBVSA   PTR(31),    /* UCB VOLSER ADDR                */ 02800000
*         2 UNFLG1     BIT(8),     /* FLAG BYTE 1                    */ 02850000
*           3 UNEOL    BIT(1),     /* END OF LIST INDICATOR, ALWAYS 1*/ 02900000
*           3 *        BIT(1),     /* RESERVED                       */ 02950000
*           3 UNDUMP   BIT(1),     /* 1 = DUMP FUNCTION              */ 03000000
*           3 *        BIT(1),     /* RESERVED                       */ 03050000
*           3 UNCOPY   BIT(1),     /* 1 = COPY FUNCTION              */ 03100000
*           3 UNPRINT  BIT(1),     /* 1 = PRINT FUNCTION            */  03150000
*           3 *        BIT(1),     /* RESERVED                       */ 03200000
*         2 UNFLG2     BIT(8),     /* FLAG BYTE 2                    */ 03250000
*           3 UNDSN    BIT(1),     /* 1 = DATASET OPERATION          */ 03300000
*           3 UNFULL   BIT(1),     /* 1 = FULL VOLUME OPERATION      */ 03350000
*           3 UNPART   BIT(1),     /* 1 = PARTIAL VOLUME OPERATION   */ 03400000
*           3 *        BIT(5),     /* RESERVED                       */ 03450000
*         2 UNFLG3     BIT(8),     /* FLAG BYTE 2                    */ 03500000
*           3 UNTOLNQF BIT(1),     /* 1 = DATASET OPERATION          */ 03550000
*         2 *          CHAR(1);    /* RESERVED                       */ 03600000
