* %GOTO SKPUFO;           /* SKIP MACRO STMT       */                   00050000
         MACRO                                                          00100000
         ADRUFO                                                         00150000
*%SKPUFO:;                                                              00200000
*@EJECT;                                                                00250000
* /* *************************************************************** */ 00300000
* /*                                                                 */ 00350000
* /*   MACRO NAME = ADRUFO                                           */ 00400000
* /*                                                                 */ 00450000
* /*   DESCRIPTIVE NAME = ADRDSSU USER FUNCTION OPTIONS              */ 00500000
* /*                      PARAMETER LIST                             */ 00550000
* /*                                                                 */ 00600000
* /*******************************************************************/ 00650000
* /*******************************************************************/ 00700000
* /*******************************************************************/ 00750000
* /*                                                                 */ 00800000
* /*   STATUS:  VERSION  2  RELEASE 10  LEVEL  0             @OW50538*/ 00850000
* /*                                                                 */ 00900000
*/*******************************************************************/  00906200
*/*PROPRIETARY V3 STATEMENT                                         */  00912400
*/*LICENSED MATERIALS - PROPERTY OF IBM                             */  00918600
*/*"RESTRICTED MATERIALS OF IBM"                                    */  00924800
*/*5695-DF1                                                         */  00929400
*/*(C) COPYRIGHT 1980,2000  IBM CORP.                               */  00934000
*/*END PROPRIETARY V3 STATEMENT                                     */  00938600
*/*******************************************************************/  00943400
* /*-------------------------------------------------------- @LA52968*/ 00950000
* /*   ALTHOUGH PROVIDED IN A GENERAL INTERFACE LIBRARY,     @LA52968*/ 01000000
* /*   ADRUFO IS NOT TO BE USED AS A GENERAL PROGRAMMING     @LA52968*/ 01050000
* /*   INTERFACE.  REFER TO PRODUCT DOCUMENTATION TO         @LA52968*/ 01100000
* /*   DETERMINE INTENDED USAGE.                             @LA52968*/ 01150000
* /*-------------------------------------------------------- @LA52968*/ 01200000
* /*                                                                 */ 01250000
* /*   FUNCTION =                                                    */ 01300000
* /*      THE USER FUNCTION OPTIONS PARAMETER LIST (UFO) IS THE      */ 01350000
* /*      COMMUNICATIONS LINK BETWEEN THE USER INSTALLATION EXIT     */ 01400000
* /*      AND DFSMSdss. DFSMSdss FILLS THE FIELDS IN THIS LIST USING */ 01450000
* /*      THE OPTIONS SPECIFIED IN THE USER'S CONTROL STATEMENTS     */ 01500000
* /*      AND PASSES IT TO THE EXIT FOR EACH FUNCTION(UFOFUNCT).     */ 01550000
* /*      THE EXIT ROUTINE MAY CHANGE ANY (OR NONE) OF THE OPTIONS   */ 01600000
* /*      AND PASS BACK THE CHANGED/UNCHANGED LIST. DFSMSdss WILL    */ 01650000
* /*      USE THE CHANGED INFORMATION TO OVERRIDE THAT FROM EACH     */ 01700000
* /*      CONTROL STATEMENT IMMEDIATELY BEFORE IT SCHEDULES THE      */ 01750000
* /*      FUNCTIONAL TASK. DFSMSdss WILL PRINT A MESSAGE FOR EACH    */ 01800000
* /*      OPTION CHANGED BY THE EXIT ROUTINE.                        */ 01850000
* /*                                                                 */ 01900000
* /*      THE LIST IS ALSO PASSED AT THE BEGINNING OF EXECUTION OF   */ 01950000
* /*      DFSMSdss(UFOPARM). DFSMSdss WILL PRINT A MESSAGE IF ANY    */ 02000000
* /*      OF THE SIGNIFICANT PARAMETERS ARE CHANGED.                 */ 02050000
* /*                                                                 */ 02100000
* /*      THE HEADER PORTION OF THE BLOCK CONTAINS CONTROL FLAGS     */ 02150000
* /*      FOR THE APPLICATION INTERFACE.                         @V21*/ 02200000
* /*                                                                 */ 02250000
* /*   INVOCATION = PLS -- INCLUDE ADRUFO                            */ 02300000
* /*                BAL --                                           */ 02350000
* /*                                                                 */ 02400000
* /*   CHANGE ACTIVITY =                                             */ 02450000
* /*     UFOINSOP, UFOERASE ADDED                             @REL11 */ 02500000
* /*     UFNORUN,UFOWAITS,UFOWAITR,UFO2ENQE,UFO2ENQS,UFO2ENQN,   @R20*/ 02550000
* /*     UFO1REPL,UFOFRAGI ADDED                                 @R20*/ 02600000
* /*     UFOCLEAR REMOVED                                        @R20*/ 02650000
* /*     UFO2DEL ADDED                                           @R20*/ 02700000
* /*     UFO2CTLG,UFO2UNC AND UFOIACPY ADDED                     @R21*/ 02750000
* /*     UFO2RECT,UFO2RBLK,UFO3FORC,UFOMNGAS,UFOMNSQT,           @V21*/ 02800000
* /*     UFOMNTUS,UFO3FLGS,UFOPARAM,UFAIINV,UFUIMAL,             @V21*/ 02850000
* /*     UFOUIMCH,UFSTOP,UFSYSIN,UFSYSPR,UFNOIN,UFNOOUT ADDED    @V21*/ 02900000
* /*     UFAI31B,UFXABUFF  ADDED                              @V22JJW*/ 02950000
* /*     COPY OPTIMIZE SUPPORT                                @V22BLE*/ 03000000
* /*     VERSION 2 RELEASE 3.0 SUPPORT ADDED                     @V23*/ 03050000
* /*     UFOTGTAL ADDED FOR TARGET ALLOCATION                    @V23*/ 03100000
* /*     VERSION 2 RELEASE 4.0 SUPPORT ADDED                     @V24*/ 03150000
* /*     UFOPROCK ADDED FOR PROCESS OPTIONS        10/11/88   @V25EPR*/ 03200000
* /*     UFWKUNIT AND UFWRKVOL ADDED FOR WORKUNIT/WORKVOL    @LA46326*/ 03250000
* /*     PARAMETERS                                          @LA46326*/ 03300000
* /*     ADDED WARNING FOR CDPI REQUIREMENTS    NOV 13, 1989 @LA52968*/ 03350000
* /*     ADDED BYPASS RACF FACILITY CLASS CHECK    14 SEP 90 @LA64541*/ 03400000
* /*       FLAG, UFBYFCCK                          14 SEP 90 @LA64541*/ 03450000
* /*     AE for PL64094                                      @LA73771*/ 03500000
* /*     MAINTENANCE ROLL-UP                       14 JUN 91 @NA00267*/ 03550000
* /*     UFOT0IND ADDED FOR T0COPY SUPPORT         18 JUL 91     @V26*/ 03600000
* /*     UFORIOPC ADDED FOR T0COPY SUPPORT         18 JUL 91     @V26*/ 03650000
* /*     ADDED UFO2VALD FOR 'VALIDATE' KEYWORD     10 JUN 92 @KEJ0135*/ 03675000
* /*     DELETED UFOMNGAS (NOW RESERVED FIELD)       15DEC92 @OY59458*/ 03683300
* /*     MODIFIED TO SUPPORT OY60602 SECURITY APAR   19JAN93 @OY60602*/ 03691600
* /*     UFOMKMV ADDED FOR MAKEMULTI               14 FEB 94 @OW02973*/ 03695800
* /*     UFOFLEAV ADDED FOR CLOSE WITH LEAVE OPION 14 SEP 94 @OW08175*/ 03697900
* /*     ADD BUILDSA                                 08DEC95 @OW14835*/ 03698900
* /*     VOLCOUNT support                            27FEB96 @OW18380*/ 03699400
* /* $FST=HDZ11D0,10JUL96,TPCMAH: ABARS filestacking 10Jul96     @FST*/ 03699600
* /* $EPC=HDZ11D0,15OCT96,TPCJKS: Enh. Prot. Checkpointed DS     @EPC*/ 03699800
* /* $MSF=HDZ11D0,09JAN97,TPCHCW:Multivolume selection/filtering @MSF*/ 03699900
* /* $RLV=HDZ11D0,04/10/97,TPCPRB: RELEASE LOGICAL & VSAM-EF     @RLV*/ 03716500
* /*     DUMPCONDITIONING SUPPORT                    03AUG00 @OW45674*/ 03724490
* /* CICSVR2.4 DUMP/COPY Backup Notification Support         @OW50538*/ 03726480
* /*   added UFOCVRBK flag.                          17MAY01 @OW50538*/ 03728470
* /*                                                                 */ 03733100
* /*   CHANGE DATE: 17MAY01                                  @OW50538*/ 03749800
* /*                                                                 */ 03766600
* /* *************************************************************** */ 03800000
* %GOTO PLSUFO;           /* GO TO THE PLS VERSION */                   03850000
ADRUFO@  DS    F                    UFO BASING POINTER           @V21   03900000
ADRUFOB  DSECT                      UFO PARM LIST            @V23N703   03950000
UFOHDR   DS    0CL20                HEADER OF UFO PARM LIST             04000000
UFID     DS    CL4                  IDENTIFIER OF EBCDIC "UFO "         04050000
UFLEN    DS    H                    LENGTH OF PARM LIST                 04100000
UFBDYOFF DS    H                    OFFSET TO UFOFUNCT OR UFOPARM       04150000
UFVOLI@  DS    AL4                  ADDR OF INPUT VOLUME LIST OR 0      04200000
*                                   (DESCRIBED BY UFOVENT)              04250000
UFVOLO@  DS    AL4                  ADDR OF OUTPUT VOLUME LIST OR 0     04300000
*                                   (DESCRIBED BY UFOVENT)              04350000
UFFUNCT  DS    0CL2                 FUNCTION BEING PERFORMED            04400000
*                                   '0000'X = PARM CHANGE ENTRY         04450000
*                                   IF ANY BITS ARE ON IN THESE TWO     04500000
*                                   BYTES, IT IS A FUNCTION ENTRY       04550000
*                                   (THIS FIELD MUST BE KEPT IN         04600000
*                                    SYNCHRONIZATION WITH FBMAJOR       04650000
*                                    IN ADRFUNCB)             @V23DTK   04700000
UFFUNCT1 DS    CL1                  FUNCTION BYTE 1                     04750000
UFFUDEF  EQU   X'80'                DEFRAG OPERATION                    04800000
UFFUCOPY EQU   X'40'                COPY OPERATION                      04850000
UFFUREST EQU   X'20'                RESTORE OPERATION                   04900000
UFFUDUMP EQU   X'10'                DUMP OPERATION                      04950000
UFFUPRT  EQU   X'08'                PRINT OPERATION                     05000000
UFFUCPYD EQU   X'04'                COPYDUMP OPERATION                  05050000
*                                   RESERVED                     @V21   05100000
UFFUCOMP EQU   X'01'                COMPRESS OPERATION           @V21   05150000
UFFUNCT2 DS    CL1                  FUNCTION BYTE TWO            @V21   05200000
UFFURLSE EQU   X'80'                RELEASE OPERATION            @V21   05250000
UFFUCONV EQU   X'40'                CONVERTV OPERATION           @V24   05300000
UFFUBLSA EQU   X'20'                BUILDSA  OPERATION       @OW14835   05325000
UFFIND   DS    CL1                  FUNCTIONAL INDICATORS               05350000
UFFIFULL EQU   X'80'                FULL VOLUME REQUEST                 05400000
*                                   (DUMP, RESTORE, COPY & DEFRAG)      05450000
UFFIPART EQU   X'40'                PARTIAL (TRACKS) REQUEST            05500000
*                                   (DUMP, RESTORE, COPY, DEFRAG        05550000
*                                   & PRINT)                            05600000
UFFIFILT EQU   X'20'                REQUEST BY FILTER/DSNAME            05650000
*                                   (DUMP, RESTORE & PRINT)             05700000
UFFIPRTV EQU   X'10'                PRINT VTOC                          05750000
*                                   (PRINT)                             05800000
UFFLOGCL EQU   X'08'                LOGICAL PROCESSING FOR COPY,   @RLV 05850000
*                                   DUMP, OR RELEASE: EITHER NO    @RLV 05900000
*                                   INPUT VOLS SPECIFIED (CATALOG  @RLV 06020000
*                                   FILTERING) OR 1 OF FOLLOWING:  @RLV 06027500
*                                     LOGINDDNAME, LOGINDYNAM,     @RLV 06035000
*                                     LOGDDNAME, LOGDYNAM.         @RLV 06042500
UFAIFLGS DS    CL1                  APPLICATION INTERFACE FLAGS    @V21 06050000
UFAIINV  EQU   X'80'                INVOKED BY APPL. INTERFACE     @V21 06100000
UFUIMAL  EQU   X'40'                ADRUIM NOT TO BE GIVEN CONTROL @V21 06150000
UFUIMCH  EQU   X'20'                DO NOT ALLOW UIM TO MODIFY     @V21 06200000
*                                   OPTIONS, VALUES                @V21 06250000
UFSTOP   EQU   X'10'                TERMINATE OPERATION ( SAME AS  @V21 06300000
*                                   RETURN CODE 8 FROM ADRUIXIT)   @V21 06350000
UFSYSIN  EQU   X'08'                SYSIN OR ALTERNATE NOT PRESENT @V21 06400000
*                                   ALLOWED IF UFPARAM=XX1000XX    @V21 06450000
UFSYSPR  EQU   X'04'                SYSPRINT/ALTERNATE NOT PRESENT @V21 06500000
*                                   ALLOWED IF UFPARAM=XX1000XX    @V21 06550000
UFNOIN   EQU   X'02'                NO INPUT TAPE - FOR RESTORE    @V21 06600000
*                                   ONLY                           @V21 06650000
UFNOOUT  EQU   X'01'                NO OUTPUT TAPE - FOR DUMP ONLY @V21 06700000
UFFLAGS  DS    CL1                  FLAGS                      @LA64541 06750000
UFBYFCCK EQU   X'80'                1=BYPASS FACILITY CLASS CHECKS      06800000
*                                     IF USER AUTHORIZED       @LA64541 06850000
UFSAFOK  EQU   X'40'                1=IT IS OK TO USE THE SAF INTERFACE 06862500
*                                     AT THE HIGHEST SUPPORTED LEVEL    06875000
*                                                              @OY60602 06887500
UFFREWCL EQU   X'20'                1=Rewind on close              @FST 06891600
*        EQU   X'1F'                reserved                       @FST 06895700
         DS    CL3                  RESERVED                   @LA64541 06900000
         SPACE 2                                                        06950000
*FOFUNCT DS    0CL4                 LIST OF OPTIONS FOR FUNCTION.       07000000
UFOFUNCT DSECT                      LIST OF OPTIONS FOR FUNC.@V22BLE    07050000
*                                   PRESENT IF ANT BITS ARE ON ON       07100000
*                                   UFFUNCT                             07150000
*                                   POINTED TO BY THE ADDRESS OF        07200000
*                                   UFOHDR + UFBDYOFF                   07250000
UFO1FLGS DS    CL1                  1ST SET OF OPTION FLAGS             07300000
*                                   (REPRESENT KEYWORDS)                07350000
UFO1COMP EQU   X'80'                1=COMPRESS (DUMP)                   07400000
UFO1CVOL EQU   X'40'                1=COPYVOLID (RESTORE & COPY)        07450000
UFO1PURG EQU   X'20'                1=PURGE                             07500000
*                                   (DUMP, COPY & RESTORE)              07550000
UFO1RESE EQU   X'10'                1=RESET (DUMP)                      07600000
UFO1WRCK EQU   X'08'                1=WRITECHECK (COPY,RESTORE)         07650000
UFO1ALD  EQU   X'04'                1=ALLDATA (COPY,FULL DUMP,          07700000
*                                   FILTER/DSNAME DUMP)                 07750000
UFO1ALDL EQU   X'02'                (COPY,FULL DUMP,                    07800000
*                                   FILTER/DSNAME DUMP)                 07850000
*                                   BIT IS ONLY MEANINGFUL IF UFO1ALD   07900000
*                                   IS 1.                               07950000
*                                   1=ALLDATA(LIST)                     08000000
*                                   0=ALLDATA(*)                        08050000
*                                   BIT MAY NOT BE SET ON BY THE EXIT   08100000
*                                   BUT MAY BE RESET TO CHANGE          08150000
*                                   ALLDATA(LIST) TO ALLDATA(*)         08200000
UFO1ALLE EQU   X'01'                1=ALLEXCP (COPY,FULL DUMP,          08250000
*                                   FILTER/DSNAME DUMP)                 08300000
UFO2FLGS DS    CL1                  2ND SET OF OPTION FLAGS             08350000
*                                   (REPRESENT KEYWORDS)                08400000
UFO2DYNQ EQU   X'80'                DYNALLOC,                           08450000
*                                   0 = USE ENQ TO HOLD DATASET,        08500000
*                                   1 = USE DYNAMIC ALLOCATION TO HOLD  08550000
*                                   DATASET                             08600000
*                                   (DUMP, DEFRAG, PRINT & RESTORE)     08650000
UFO2ENQE EQU   X'40'                ENQ EXCLUSIVE                  @R20 08700000
*                                   DUMP, RESTORE, PRINT           @R20 08750000
UFO2ENQS EQU   X'20'                ENQ SHARED IF EXCL FAILS       @R20 08800000
*                                   DUMP, RESTORE, PRINT           @R20 08850000
UFO2ENQN EQU   X'10'                DO NOT ENQ IF EXCL & SHR FAIL  @R20 08900000
*                                   DUMP, RESTORE, PRINT           @R20 08950000
UFO2DEL  EQU   X'08'                DELETE AFTER DATASET DUMP      @R20 09000000
UFO2CTLG EQU   X'04'                CATALOG DATA SETS DURING A     @V21 09050000
*                                   DATA SET RESTORE, COPY         @V21 09100000
UFO2RECT EQU   UFO2CTLG             RECATALOG FOR                  @V21 09150000
*                                   DATA SET RESTORE, COPY         @V21 09200000
UFO2UNC  EQU   X'02'                UNCATALOG DATA SETS AFTER A    @V21 09250000
*                                   DATA SET DUMP, COPY            @V21 09300000
UFO2VALD EQU   X'01'                VALIDATE - LOGICAL DUMP    @KEJ0135 09325000
UFDUOPTM DS    AL1                  OPTIMIZE VALUE  (DUMP/COPY) @V22BLE 09350000
*                                   (1, 2, 3, OR 4) @V22BLE             09400000
UFOINSOP DS    CL1                  INSTALLATION OPTIONS      @REL11    09450000
UFOERASE EQU   X'80'                ERASE DASD TRACKS         @REL11    09500000
UFOIACPY EQU   X'40'                DUMP MUST PRODUCE ALL OUTPUT COPIES 09550000
*                                   OR NONE AT ALL IF = 1          @R21 09600000
UFOBLDIX EQU   X'20'                INVOKE ICKDSF TO REBLD INDEX@V23DTK 09650000
UFORACLG EQU   X'10'                RACFLOG=YES SPECIFIED OR       @V23 09700000
*                                   FORCE RACF LOGGING             @V23 09750000
UFOBK32K EQU   X'08'                TAPE BLK SIZE = 32K        @LA30041 09800000
UFOARBA  EQU   X'04'                1=AUTORELBLKA SPECIFIED    @LA71950 09850000
UFOMKMV  EQU   X'02'                1=MAKEMULTI SPECIFIED      @OW02973 09875000
UFOFLEAV EQU   X'01'                1=CLOSE LEAVE FLAG         @OW08175 09887500
UFOFRAGI DS    AL4                  FRAGMENTATION INDEX(DEFRAG)    @R20 09900000
*                                   9,90,900=900, 09=90, 009=9     @R20 09950000
UFOVCFLG DS    CL1                  VOLCOUNT FLAGS             @OW18380 09968700
UFOVCCUR EQU   X'80'                1 = VOLCOUNT(*)            @OW18380 09987400
UFOVCSRC EQU   X'40'                1 = VOLCOUNT(SRC)          @OW18380 10006100
UFOVCNUM EQU   X'20'                1 = VOLCOUNT(N(nn))        @OW18380 10024800
UFOVCANY EQU   X'10'                1 = VOLCOUNT(ANY)          @OW18380 10043500
UFOSMALL EQU   X'08'                1 = SELECTMULTI(ALL)           @MSF 10045800
UFOSMANY EQU   X'04'                1 = SELECTMULTI(ANY)           @MSF 10048100
UFOSM1ST EQU   X'02'                1 = SELECTMULTI(FIRST)         @MSF 10050400
UFOCPFRC EQU   X'01'                1 = FORCECP keyword            @EPC 10052800
UFOVCVAL DS    AL1                  VALUE FOR N VOLUMES        @OW18380 10062200
UFOCPDAY DS    AL1                  DAYS value for FORCECP         @EPC 10074800
         DS    CL1                  RESERVED                       @EPC 10087400
UFOMNSQT DS    F                    MINIMUM SECONDARY ALLOCATION   @V21 10100000
*                                   (MINSECQTY) FOR RELEASE        @RLV 10150000
UFOMNTUS DS    F                    MINIMUM UNUSED TRACKS          @RLV 10200000
*                                   (MINTRACKSUNUSED) FOR RELEASE  @RLV 10250000
UFO3FLGS DS    CL1                  3RD SET OF OPTION FLAGS        @V21 10300000
UFO3FORC EQU   X'80'                FORCE                          @V21 10350000
*                                   RESTORE , COPY                 @V21 10400000
UFO3REPL EQU   X'40'                1=REPLACE(DATASET RESTORE,COPY)@V21 10450000
UFOFRBLK EQU   X'20'                1 = FORCE REBLOCKING OF        @V21 10500000
*                                       DATA SETS (COPY, RESTORE)  @V24 10550000
UFODRBLK EQU   X'10'                1 = DISABLE REBLOCKING OF      @V21 10600000
*                                       DATA SETS (COPY, RESTORE)  @V24 10650000
UFOALLMU EQU   X'08'                1 = ALLMULTI (COPY, DUMP WITH  @V23 10700000
*                                   LOGINDDNAME/LOGINDYNAM)        @V23 10750000
UFOSPHER EQU   X'04'                1=PERFORM SPHERE PROCESSING    @V24 10800000
UFONOSMS EQU   X'02'                1=NULLSTORCLAS SPECIFIED       @V24 10850000
UFONMGMT EQU   X'01'                1=NULLMGMTCLAS SPECIFIED       @V24 10900000
UFOWAITS DS    AL1                  WAIT TIME IN SECONDS BETWEEN   @R20 10950000
*                                   RESERVE OR ENQ RETRIES(ALL)    @R20 11000000
UFOWAITR DS    AL1                  NUMBER OF RETRIES ON RESERVE   @R20 11050000
*                                   OR ENQ FAILURES(ALL COMMANDS)  @R20 11100000
UFOTGTAL DS    CL1                  TGTALLOC FLAGS                 @V23 11150000
UFOTGTCY EQU   X'80'                1 = CYLINDER                   @V23 11200000
UFOTGTTR EQU   X'40'                1 = TRACK                      @V23 11250000
UFOTGTBL EQU   X'20'                1 = BLOCK                      @V23 11300000
UFOTGTSR EQU   X'10'                1 = SOURCE                     @V23 11350000
UFOPROCK DS    CL1                  PROCESS KEYWORD OPTIONS     @V25EPR 11400000
*                                   (FIELD MUST BE KEPT IN      @V25EPR 11450000
*                                   SYNCH WITH FBPROCKW)        @V25EPR 11500000
UFOPRUND EQU   X'80'                1 = PROCESS UNDEF DSORG     @V25EPR 11550000
UFOPRSYS EQU   X'40'                1 = PROCESS SYS1 DATASETS   @V25EPR 11600000
*                                                                  @V26 11650000
UFOT0IND DS    CL1                  T0 COPY INDICATORS             @V26 11700000
UFOT0REQ EQU   X'80'                T0 COPY REQUESTED              @V26 11750000
UFODCOND EQU   X'40'                DUMPCONDITIONING           @OW45674 11769990
UFOCVRBK EQU   X'20'                CICSVRBACKUP               @OW50538 11779980
*                                                                  @V26 11800000
UFORIOPC DS    AL2                  READ I/O PACING                @V26 11850000
         SPACE 2                                                        11900000
         ORG   UFO1FLGS                                        @V22BLE  11950000
UFOPARM  DS    0CL4                 EXECUTE CARD PARAMETER OPTION       12000000
*                                   LIST. PRESENT IF ALL BITS IN        12050000
*                                   UFFUNCT ARE ZERO.                   12100000
*                                   POINTED TO BY THE ADDRESS OF        12150000
*                                   UFOHDR + UFBDYOFF                   12200000
UFSERPAR DS    CL1                  SERIAL / PARALLEL                   12250000
UFFORSER EQU   X'80'                IGNORE ALL PARALLEL COMMANDS IN     12300000
*                                   THE COMMAND STREAM (FORCE THEM      12350000
*                                   TO SERIAL)                          12400000
UFDEFPAR EQU   X'40'                DEFAULT TO PARALLEL AT BEGINNING    12450000
*                                   OF COMMAND PROCESSING.              12500000
*                                   IGNORED IF UFFORSER IS 1.           12550000
UFXAFLAG DS    CL1                  CONTROL FLAGS FOR XA MODE  @V22JJW  12600000
*                                                                       12650000
UFXABUFF EQU   X'80'                                           @V22JJW  12700000
UFAI31B  EQU   X'40'                AI BUFFER ABOVE 16M REQSTD @V22JJW  12750000
*                                                                       12800000
UFWKUNIT DS    CL8                  WORKUNIT PARAMETER        @LA46326  12850000
UFWKVOL  DS    CL6                  WORKVOL PARAMETER         @LA46326  12900000
         SPACE 2                                                        12950000
UFOVOL   DSECT                      VOLUME LIST HEADER.                 13000000
*                                   POINTED TO BY UFVOLI@/UFVOLO@.      13050000
UFOVHDR  DS    0CL4                 VOLUME LIST HEADER                  13100000
UFOVCNT  DS    H                    COUNT OF VOLUME LIST ENTRIES        13150000
         DS    CL2                  RESERVED                            13200000
UFOVENT  DS    0CL20                VOLUME LIST ENTRY                   13250000
UFOVUCB@ DS    AL4                  ADDR OF UCB OR 0                    13300000
UFODDNAM DS    CL8                  DDNAME OR BLANK                     13350000
UFOVOLID DS    CL6                  VOLUME SERIAL OR BLANK              13400000
         DS    CL2                  RESERVED                            13450000
         MEND                                                           13500000
*%PLSUFO:;                /* PLS VERSION */                             13550000
*DCL   ADRUFID          CHAR  (4)   /* IDENTIFIER                    */ 13600000
*      CONSTANT('UFO ');                                                13650000
*DCL   ADRUFO@          PTR   (31); /* ADRUFO BASING POINTER     @V21*/ 13700000
*DCL 1 ADRUFOB BASED(ADRUFO@) BDY(WORD),                                13750000
*      2 UFOHDR,                    /* HEADER OF UFO PARM LIST       */ 13800000
*        3 UFID         CHAR  (4),  /* IDENTIFIER EBCDIC "UFO "      */ 13850000
*        3 UFLEN        FIXED (15), /* LENGTH OF PARM LIST           */ 13900000
*        3 UFBDYOFF     FIXED (15), /* OFFSET TO UFOFUNCT OR UFOPARM */ 13950000
*        3 UFVOLI@      PTR   (31), /* ADDR OF INPUT VOL LIST  | 0   */ 14000000
*        3 UFVOLO@      PTR   (31), /* ADDR OF OUTPUT VOL LIST  | 0  */ 14050000
*        3 UFFUNCT      BIT  (16),  /* FUNCTION BEING PERFORMED      */ 14100000
*                                   /* '0000'X = PARM CHANGE ENTRY   */ 14150000
*                                   /* (THIS FIELD MUST BE KEPT IN   */ 14200000
*                                   /*  SYNCHRONIZATION WITH FBMAJOR */ 14250000
*                                   /*  IN ADRFUNCB)          @V23DTK*/ 14300000
*          4 UFFUNCT1   BIT   (8),  /* FUNCTION BYTE ONE             */ 14350000
*            5 UFFUDEF  BIT   (1),  /* 1 = DEFRAG OPERATION          */ 14400000
*            5 UFFUCOPY BIT   (1),  /* 1 = COPY OPERATION            */ 14450000
*            5 UFFUREST BIT   (1),  /* 1 = RESTORE OPERATION         */ 14500000
*            5 UFFUDUMP BIT   (1),  /* 1 = DUMP OPERATION            */ 14550000
*            5 UFFUPRT  BIT   (1),  /* 1 = PRINT OPERATION           */ 14600000
*            5 UFFUCPYD BIT   (1),  /* 1 = COPYDUMP OPERATION        */ 14650000
*            5 *        BIT   (1),  /* RESERVED                  @V21*/ 14700000
*            5 UFFUCOMP BIT   (1),  /* 1 = COMPRESS OPERATION    @V21*/ 14750000
*          4 UFFUNCT2   BIT   (8),  /* FUNCTION BYTE TWO         @V21*/ 14800000
*            5 UFFURLSE BIT   (1),  /* 1 = RELEASE OPERATION     @V21*/ 14850000
*            5 UFFUCONV BIT   (1),  /* 1 = CONVERTV OPERATION    @V24*/ 14900000
*            5 UFFUBLSA BIT   (1),  /* 1 = BUILDSA OPERATION @OW14835*/ 14933300
*            5 *        BIT   (5),  /* RESERVED              @OW14835*/ 14966600
*        3 UFFIND       CHAR  (1),  /* FUNCTIONAL INDICATORS         */ 15000000
*          4 UFFIFULL   BIT   (1),  /*  1 = FULL VOLUME REQUEST         15050000
*                                      (DUMP, RESTORE, COPY & DEFRAG)*/ 15100000
*          4 UFFIPART   BIT   (1),  /*  1 = PARTIAL REQUEST             15150000
*                                      (DUMP, RESTORE, COPY, DEFRAG     15200000
*                                      & PRINT)                      */ 15250000
*          4 UFFIFILT   BIT   (1),  /* 1 = REQUEST BY FILTER/DSNAME     15300000
*                                      (DUMP, RESTORE & PRINT)       */ 15350000
*          4 UFFIPRTV   BIT   (1),  /* 1 = PRINT VTOC                */ 15400000
*          4 UFFLOGCL   BIT   (1),  /* 1=LOGICAL PROCESSING FOR COPY,   15450000
*                                      DUMP, OR RELEASE: EITHER NO      15500000
*                                      INPUT VOLUMES SPECIFIED (CATALOG 15620000
*                                      FILTERING) OR 1 OF FOLLOWING:    15627500
*                                        LOGINDDNAME, LOGINDYNAM,       15635000
*                                        LOGDDNAME, LOGDYNAM.    @RLV*/ 15642500
*          4 *          BIT   (3),  /* RESERVED                  @V23*/ 15650000
*        3 UFAIFLGS     CHAR  (1),  /* APPLICATION INTERFACE FLGS@V21*/ 15700000
*          4 UFAIINV    BIT   (1),  /* 1=INVOKED BY APPL. INTERF.@V21*/ 15750000
*          4 UFUIMAL    BIT   (1),  /* 1=ADRUIM NOT TO BE GIVEN         15800000
*                                           CONTROL              @V21*/ 15850000
*          4 UFUIMCH    BIT   (1),  /* 1=DO NOT ALLOW ADRUIM TO MODIFY  15900000
*                                           OPTIONS, VALUES      @V21*/ 15950000
*          4 UFSTOP     BIT   (1),  /* 1=DO NOT SCHEDULE TASK (SAME AS  16000000
*                                   RETURN CODE 8 FROM ADRUIXIT) @V21*/ 16050000
*          4 UFSYSIN    BIT   (1),  /* 1=SYSIN OR ALTERNATE NOT PRESENT 16100000
*                                   ALLOWED IF UFPARAM=XX1000XX  @V21*/ 16150000
*          4 UFSYSPR    BIT   (1),  /* 1=SYSPRINT/ALTERNATE NOT PRESENT 16200000
*                                   ALLOWED IF UFPARAM=XX1000XX  @V21*/ 16250000
*          4 UFNOIN     BIT   (1),  /* 1=NO INPUT TAPE - ONLY FOR       16300000
*                                   RESTORE                      @V21*/ 16350000
*          4 UFNOOUT    BIT   (1),  /* 1=NO OUTPUT TAPE - ONLY FOR      16400000
*                                   DUMP                         @V21*/ 16450000
*        3 UFFLAGS     CHAR  (1),   /* FLAGS                 @LA64541*/ 16500000
*          4 UFBYFCCK   BIT   (1),  /* 1=BYPASS FACILITY CLASS CHECKS   16550000
*                                        IF USER AUTHORIZED  @LA64541*/ 16600000
*          4 UFSAFOK    BIT   (1),  /* 1=IT IS OK TO USE THE SAF        16620000
*                                        INTERFACE AT THE HIGHEST       16640000
*                                        SUPPORTED LEVEL     @OY60602*/ 16660000
*          4 UFFREWCL   BIT   (1),  /* 1=rewind on close         @FST*/ 16673300
*          4 *          BIT   (5),  /* reserved                  @FST*/ 16686600
*        3 *           CHAR  (3),   /* RESERVED              @LA64541*/ 16700000
*      2 *      CHAR  (0)  BDY(WORD),                                   16750000
*    1 UFOFUNCT BASED(ADDR(UFOHDR) + UFBDYOFF), /* LIST OF OPTIONS FOR  16800000
*                                      FUNCTION. POINTED TO BY THE      16850000
*                                      ADDRESS OF UFOHDR + UFBDYOFF.    16900000
*                                      PRESENT IF ANY BITS ARE ON IN    16950000
*                                      UFFUNCT                       */ 17000000
*        3 UFO1FLGS     BIT   (8),  /*  1ST SET OF OPTION FLAGS      */ 17050000
*          4 UFO1COMP   BIT   (1),  /* 1 = COMPRESS (DUMP)           */ 17100000
*          4 UFO1CVOL   BIT   (1),  /* 1 = COPYVOLID (RESTORE & COPY)*/ 17150000
*          4 UFO1PURG   BIT   (1),  /* 1 = PURGE                        17200000
*                                      (DUMP, COPY & RESTORE)        */ 17250000
*          4 UFO1RESE   BIT   (1),  /* 1 = RESET CHANGE BIT (DUMP)   */ 17300000
*          4 UFO1WRCK   BIT   (1),  /* 1 = WRITECHECK                */ 17350000
*          4 UFO1ALD    BIT   (1),  /* 1 = ALLDATA                   */ 17400000
*          4 UFO1ALDL   BIT   (1),  /* 1 = ALLDATA(LIST),               17450000
*                                      0 = ALLDATA(*), VALID ONLY IF    17500000
*                                      UFO1ALD = 1.                     17550000
*                                      BIT MAY NOT BE SET ON BY THE     17600000
*                                      EXIT BUT MAY BE RESET TO CHANGE  17650000
*                                      ALLDATA(LIST) TO ALLDATA(*)   */ 17700000
*          4 UFO1ALLE   BIT   (1),  /* 1 = ALLEXCP                   */ 17750000
*        3 UFO2FLGS     BIT   (8),  /*  2ND SET OF OPTION FLAGS      */ 17800000
*          4 UFO2DYNQ   BIT   (1),  /* 0 = USE ENQ TO HOLD DATASET,     17850000
*                                      1 = USE DYNALOC TO HOLD DS       17900000
*                                     (DUMP, DEFRAG, PRINT & RESTORE)*/ 17950000
*          4 UFO2ENQE   BIT   (1),  /* 1 = ENQ EXCLUSIVE (DUMP, RESTORE 18000000
*                                       AND PRINT)               @R20*/ 18050000
*          4 UFO2ENQS   BIT   (1),  /* 1 = ENQ SHARED IF EXCL FAILS-    18100000
*                                       DUMP, RESTORE & PRINT    @R20*/ 18150000
*          4 UFO2ENQN   BIT   (1),  /* 1 = DO NOT ENQ IF EXCL & SHR     18200000
*                                     FAIL-DUMP, RESTORE & PRINT @R20*/ 18250000
*          4 UFO2DEL    BIT   (1),  /* 1 = DELETE AFTER DS DUMP  @R20*/ 18300000
*          4 UFO2CTLG   BIT   (1),  /* 1 = CATALOG DATA SETS DURING A   18350000
*                                     DATA SET RESTORE, COPY     @V21*/ 18400000
*            5 UFO2RECT BIT   (1),  /* 1 = RECATALOG DURING A           18450000
*                                     DATA SET RESTORE, COPY     @V21*/ 18500000
*          4 UFO2UNC    BIT   (1),  /* 1 = UNCATALOG DATA SETS AFTER A  18550000
*                                     DATA SET DUMP, COPY        @V21*/ 18600000
*          4 UFO2VALD   BIT   (1),  /* 1 = VALIDATE: DUMP THE VSAM      18625000
*                                     INDEXED DATA SET IN NEW FORMAT    18650000
*                                    (LOGICAL DATA SET DUMP) @KEJ0135*/ 18675000
*        3 UFDUOPTM     FIXED (8),  /* OPTIMIZE VALUE  (DUMP/COPY)      18700000
*                                       (1, 2, 3, OR 4)    @V22BLE   */ 18750000
*      2 UFOINSOP       BIT   (8),  /* INSTALLATION OPTIONS   @REL11 */ 18800000
*        3 UFOERASE     BIT   (1),  /* 1 = ERASE DASD TRACKS  @REL11 */ 18850000
*        3 UFOIACPY     BIT   (1), /* 1 = DUMP MUST PRODUCE ALL OUTPUT  18900000
*                                     COPIES OR NONE AT ALL      @R21*/ 18950000
*        3 UFOBLDIX     BIT   (1),  /* 1 = INVOKE ICKDSF TO REBUILD     19000000
*                                      VTOC INDEX             @V23DTK*/ 19050000
*        3 UFORACLG     BIT   (1),  /* RACFLOG=YES SPECIFIED OR         19100000
*                                      FORCE RACF LOGGING        @V23*/ 19150000
*        3 UFOBK32K     BIT   (1),  /* TAPE BLK SIZE 32K     @LA30041*/ 19200000
*        3 UFOARBA      BIT   (1),  /*1=AUTORELBLKA SPECIFIED@LA71950*/ 19250000
*        3 UFOMKMV      BIT   (1),  /*1=MAKEMULTI SPECIFIED  @OW02973*/ 19283300
*        3 UFOFLEAV     BIT   (1),  /*1=CLOSE LEAVE FLAG     @OW08175*/ 19316600
*      2 UFOFRAGI       FIXED (32), /*FRAGMENTATION INDEX(DEFRAG)       19350000
*                                     9,90,900=900, 09=90, 009=9 @R20*/ 19400000
*      2 *              FIXED (32), /* VOLCOUNT stuff        @OW18380*/ 19415000
*        3 UFOVCFLG     BIT   (8),  /* VOLCOUNT flags        @OW18380*/ 19430000
*          4 UFOVCCUR   BIT   (1),  /* 1 = VOLCOUNT(*)       @OW18380*/ 19445000
*          4 UFOVCSRC   BIT   (1),  /* 1 = VOLCOUNT(SRC)     @OW18380*/ 19460000
*          4 UFOVCNUM   BIT   (1),  /* 1 = VOLCOUNT(N(nn))   @OW18380*/ 19475000
*          4 UFOVCANY   BIT   (1),  /* 1 = VOLCOUNT(ANY)     @OW18380*/ 19490000
*          4 UFOSMALL   BIT   (1),  /* 1 = SELECTMULTI(ALL)      @MSF*/ 19495000
*          4 UFOSMANY   BIT   (1),  /* 1 = SELECTMULTI(ANY)      @MSF*/ 19500000
*          4 UFOSM1ST   BIT   (1),  /* 1 = SELECTMULTI(FIRST)    @MSF*/ 19505000
*          4 UFOCPFRC   BIT   (1),  /* 1 = FORCECP keyword       @EPC*/ 19510000
*        3 UFOVCVAL     FIXED (8),  /* VALUE FOR N VOLUMES   @OW18380*/ 19520000
*        3 UFOCPDAY     FIXED (8),  /* DAYS value for FORCECP    @EPC*/ 19530000
*        3 *            CHAR  (1),  /* reserved                  @EPC*/ 19540000
*      2 UFOMNSQT       FIXED (32), /* MINIMUM SECONDARY ALLOCATION     19550000
*                                     (MINSECQTY) FOR RELEASE    @RLV*/ 19600000
*      2 UFOMNTUS       FIXED (32), /* MINIMUM UNUSED TRACKS            19650000
*                                  (MINTRACKSUNUSED) FOR RELEASE @RLV*/ 19700000
*      2 UFO3FLGS       BIT   (8),  /* 3RD OPTION FLAG BYTE      @V21*/ 19750000
*        3 UFO3FORC     BIT   (1),  /* 1= FORCE UNMOVABLES ON           19800000
*                                         COPY, RESTORE          @V21*/ 19850000
*        3 UFO3REPL     BIT   (1),  /* 1 = REPLACE(DATASET              19900000
*                                         COPY, RESTORE)         @V21*/ 19950000
*        3 UFOFRBLK     BIT   (1),  /* 1 = FORCE REBLOCKING OF          20000000
*                                      DATA SETS (COPY, RESTORE) @V24*/ 20050000
*        3 UFODRBLK     BIT   (1),  /* 1 = DISABLE REBLOCKING OF        20100000
*                                      DATA SETS (COPY, RESTORE) @V24*/ 20150000
*        3 UFOALLMU     BIT   (1),  /* 1=SEARCH ALL VOLUMES FOR         20200000
*                                      COPY OR DUMP              @V23*/ 20250000
*        3 UFOSPHER     BIT   (1),  /* 1=PERFORM SPHERE PROCESSING      20300000
*                                                                @V24*/ 20350000
*        3 UFONOSMS     BIT   (1),  /* 1=NULLSTORCLAS SPECIFIED  @V24*/ 20400000
*        3 UFONMGMT     BIT   (1),  /* 1=NULLMGMTCLAS SPECIFIED  @V24*/ 20450000
*      2 UFOWAITS       FIXED (8),  /* WAIT TIME IN SECONDS BETWEEN     20500000
*                                     RESERVE & ENQ RETRIES(ALL) @R20*/ 20550000
*      2 UFOWAITR       FIXED (8),  /* NUMBER OF RETRIES ON RESERVE OR  20600000
*                                     ENQ FAILURES(ALL COMMANDS) @R20*/ 20650000
*      2 UFOTGTAL       BIT   (8),  /* TGTALLOC FLAGS            @V23*/ 20700000
*        3 UFOTGTCY     BIT   (1),  /* 1 = CYLINDER              @V23*/ 20750000
*        3 UFOTGTTR     BIT   (1),  /* 1 = TRACK                 @V23*/ 20800000
*        3 UFOTGTBL     BIT   (1),  /* 1 = BLOCK                 @V23*/ 20850000
*        3 UFOTGTSR     BIT   (1),  /* 1 = SOURCE                @V23*/ 20900000
*        3 *            BIT   (4),  /* RESERVED                  @V23*/ 20950000
*      2 UFOPROCK       BIT   (8),  /* PROCESS OPTIONS( THIS  @V25EPR   21000000
*                                      FIELD MUST BE KEPT IN  @V25EPR   21050000
*                                      SYNC WITH FBPROCKW)    @V25EPR*/ 21100000
*        3 UFOPRUND     BIT   (1),  /* 1 = PROCESS UNDEFDSORG @V25EPR*/ 21150000
*        3 UFOPRSYS     BIT   (1),  /* 1 = PROCESS SYS1       @V25EPR*/ 21200000
*        3 *            BIT   (6),  /* UNDEFINED              @V25EPR*/ 21250000
*      2 UFOT0IND       BIT   (8),  /* T0 COPY INDICATORS        @V26*/ 21300000
*        3 UFOT0REQ     BIT   (1),  /* T0 COPY REQUESTED         @V26*/ 21350000
*        3 UFODCOND     BIT   (1),  /* DUMPCONDITIONING      @OW45674*/ 21409990
*        3 UFOCVRBK     BIT   (1),  /* CICSVRBACKUP          @OW50538*/ 21429970
*        3 *            BIT   (5),  /* RESERVED              @OW50538*/ 21439960
*      2 UFORIOPC       FIXED (16), /* READ I/O PACING           @V26*/ 21450000
*      2 *      CHAR  (0)  BDY(WORD),                                   21500000
*    1 UFOPARM BASED(ADDR(UFOHDR) + UFBDYOFF),  /* EXECUTE CARD         21550000
*                                       PARAMETER OPTION LIST. POINTED  21600000
*                                       TO BY THE ADDRESS OF UFOHDR     21650000
*                                       + UFBDYOFF. PRESENT IF ALL      21700000
*                                       BITS ARE OFF IN UFFUNCT      */ 21750000
*      2 UFSERPAR       CHAR  (1),  /*  SERIAL / PARALLEL            */ 21800000
*        3 UFFORSER BIT       (1),  /*   1 = FORCE TO SERIAL         */ 21850000
*        3 UFDEFPAR BIT       (1),  /*   1 = DEFAULT TO PARALLEL.       21900000
*                                        IGNORED IF UFFORSER IS 1.   */ 21950000
*        3 *            BIT   (6),  /* RESERVED                      */ 22000000
*      2 UFXAFLAG       CHAR  (1),  /* CNTL FLAGS FOR XA MODE @V22JJW*/ 22050000
*        3 UFXABUFF     BIT   (1),  /*1=I/O BUF ABOVE 16M REQ @V22JJW*/ 22100000
*        3 UFAI31B      BIT   (1),  /*1=AI BUF ABOVE 16M REQD @V22JJW*/ 22150000
*        3 *            BIT   (6),  /*   RESERVED             @V22JJW*/ 22200000
*      2 UFWKUNIT       CHAR  (8),  /* WORKUNIT PARAMETER    @LA46326*/ 22250000
*      2 UFWKVOL        CHAR  (6),  /* WORKVOL PARAMETER     @LA46326*/ 22300000
*      2 *      CHAR  (0)  BDY(WORD);                                   22350000
*DCL 1 UFOVOL  BASED BDY(WORD),     /* VOLUME LIST HEADER. POINTED TO   22400000
*                                      BY UFVOLI@ AND UFVOLO@.       */ 22450000
*      2 UFOVHDR,                   /* HEADER                        */ 22500000
*        3 UFOVCNT      FIXED (15), /* COUNT OF VOLUME LIST ENTRIES  */ 22550000
*        3 *            CHAR  (2),  /* RESERVED                      */ 22600000
*      2 UFOVENT(*),                /* VOLUME LIST ENTRY             */ 22650000
*        3 UFOVUCB@     PTR   (31), /* ADDR OF UCB | 0               */ 22700000
*        3 UFODDNAM     CHAR  (8),  /* DDNAME  | BLANK               */ 22750000
*        3 UFOVOLID     CHAR  (6),  /* VOLUME SERIAL | BLANK         */ 22800000
*        3 *            CHAR  (2);  /* RESERVED                      */ 22850000
