*        %GOTO DSPDPLS1;       /*                                       00012500
         MACRO                                                          00020800
         ADYDSPD                                                        00029100
**/      %DSPDPLS1:;                                                    00037500
*/******************* START OF SPECIFICATIONS ************************/ 00087500
*/*                                                                  */ 00150000
*/*   MACRO NAME =  ADYDSPD                                          */ 00200000
*/*                                                                  */ 00250000
*/*   DSECT NAME =  DSPD                                             */ 00300000
*/*                                                                  */ 00400000
*/*   DESCRIPTIVE NAME = DAE PREDUMP/POSTDUMP PARAMETER LIST         */ 00421400
*/*                                                                  */ 00442800
*/*       COMPONENT = DAE (SC143)                                    */ 00464200
*/*       DISTRIBUTION LIBRARY = SYS1.AMACLIB                        */ 00485600
*/*                                                                  */ 00507000
*/* PROPRIETARY STATEMENT =                                          */ 00528400
*/*                                                                  */ 00549800
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00571200
*/*   THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                   */ 00592600
*/*   5655-068 (C) COPYRIGHT IBM CORP. 1983, 1994                    */ 00614000
*/*   SEE COPYRIGHT INSTRUCTIONS                                     */ 00635400
*/*                                                                  */ 00656800
*/*   STATUS = OS/VS2 HBB5520                                        */ 00678400
*/*                                                                  */ 00700000
*/*   EXTERNAL CLASSIFICATION: DMTI                                  */ 00733300
*/*   END OF EXTERNAL CLASSIFICATION:                                */ 00766600
*/*                                                                  */ 00800000
*/*   FUNCTION =  COMMUNICATION BETWEEN SDUMP AND DAE DURING         */ 00850000
*/*      PREDUMP PROCESSING, AND BETWEEN DAE PREDUMP AND DAE         */ 00900000
*/*      POST DUMP PROCESSING.                                       */ 00950000
*/*                                                                  */ 01000000
*/*   EYE CATCHER: DSP                                               */ 01007100
*/*     OFFSET: 0                                                    */ 01014200
*/*     LENGTH: 3                                                    */ 01021300
*/*                                                                  */ 01028400
*/*   POINTED TO BY: SDDDSPD                                         */ 01035500
*/*                                                                  */ 01042600
*/*   STORAGE ATTRIBUTES:   SUBPOOL: 239                             */ 01049700
*/*                         KEY:  0                                  */ 01056800
*/*                         RESIDENCY:  ABOVE 16M                    */ 01063900
*/*                                                                  */ 01071000
*/*   SIZE:                 106 BYTES                                */ 01078100
*/*                                                                  */ 01085200
*/*   METHOD OF ACCESS =                                             */ 01092300
*/*      PLS - INCLUDE ADYDSPD FROM SYSLIB.                          */ 01100000
*/*            ALSO INCLUDE ADYDSTAT.                                */ 01116600
*/*      ASM - USING ON DSECT DSPD                                   */ 01133200
*/*                                                                  */ 01150000
*/*   CREATED BY= IEAVTSDI                                           */ 01200000
*/*               IEAVTSYS, (FOR SYSMDUMP) VIA GETMAIN               */ 01250000
*/*                                                                  */ 01400000
*/*   SERIALIZATION = NOT REQUIRED.                                  */ 01450000
*/*                                                                  */ 01500000
*/*   CHANGE ACTIVITY =                                              */ 01650000
*/* $MAC(ADYDSPD),COMP(SC143),PROD(DAE):                             */ 01750000
*/* FLAG  REASON  RELEASE    DATE   ORIGIN                           */ 01800000
*/* $L0= DAE      JBB2110   821001   PD31:                           */ 01833300
*/* $01= OY21536  JBB2220   890130   PDCK: MDUMP SUPPORT             */ 01866600
*/* $P1= PN70707  HBB5520   940601   PD00A8: SHOWHDR UPDATES (DMTI)  */ 01883300
*/* $P2= PN70759  HBB5520   940601   PD00A8: SHOWHDR UPDATES         */ 01891600
*/* $02= OW49320  HBB7703   010618   PDKV: Add SDUMP header indicator*/ 01895600
*/*                                                                  */ 01900000
*/******************** END OF SPECIFICATIONS *************************/ 01950000
*        %GOTO DSPDPLS2;    /*                                          02150000
DSPVSNC  EQU  C'DSP1'               NAME AND VERSION OF THIS            02152700
*                                      MACRO                            02155400
         IEZBITS                                                        02158100
DSPD     DSECT                      PRE-DUMP PARAMETER LIST             02160800
DSPID    DS   0CL4                  MACRO ID                            02163500
DSPDSP   DS   CL3                   ACRONYM='DSP'                       02166200
DSPVSN   DS   CL1                   VERSION NUMBER                      02168900
DSPSDWA  DS   F                     PTR-SDWA OR ZERO                    02171600
DSPABDP  DS   F                     PTR-SYMPTOMS FROM SYSMDUMP          02174300
*                                      UNUSED FOR SVCDUMP               02177000
DSPHDR   DS   F                     POINTER TO DUMP HEADER RECORD       02179700
DSPEXTRC DS   F                     RETURN CODE FROM ADYEXT             02182400
DSPERID  DS   0CL10                 ERROR-ID FROM CURRENT PROBLEM       02185100
DSPESEQ# DS   CL2                   SEQUENCE NUMBER                     02187800
DSPECPUI DS   CL2                   LOGICAL CPUID                       02190500
DSPEERAS DS   CL2                   ASID FOR ERROR MEMORY               02193200
DSPEERTM DS   CL4                   TIME STAMP AT TIME OF ERROR         02195900
DSPSCNT  DS   H                     COUNT OF SYMPTOMS                   02198600
DSPSLN   DS   H                     LENGTH OF SYMPTOM STRING            02201300
*                                       INCLUDING A TRAILING BLANK      02204000
DSPPSVD1 DS   CL20                  RESERVED FOR DAE USE                02206700
DSPPSVD2 DS   CL20                  RESERVED FOR SDUMPS USE             02209400
DSPFLG1  DS   BL2                   FLAGS SET BY SVC DUMP               02212100
DSPSVC   EQU  BIT0                  SVC DUMP BEING PROCESSED            02214800
DSPSYSM  EQU  BIT1                  SYSMDUMP DUMP BEING PROCESSED       02217500
DSPSDS   EQU  BIT2                  SDUMP FAILED TO TAKE COMPLETE       02220200
*                                      DUMP. DID TAKE A PARTIAL         02222900
DSPTERM  EQU  BIT3                  SDUMP FAILED TO TAKE ANY DUMP       02225600
*                                      SO THE DATASET IS STILL EMPTY    02228300
DSPSDMPH EQU  BIT4                  SDUMP has updated its header        02229200
*                                      information                @02A  02230100
DSPFLG2  DS   BL2                   FLAGS SET BY DAE                    02231000
DSPNOAVL EQU  BIT0                  1=ADD ENTRY TO SYMPTOM QUEUE        02233700
*                                      ALL QUEUE AREAS ARE EXHAUSTED    02236400
DSPSTAT  DS   CL8                  STATUS BITS FOR DAE TO BE            02239100
*                                       COPIED INTO AMDDATA FIELD       02241800
*                                      S05STAT. MAPPED BY ADYDSTAT      02244500
*        DS   CL2                  RESERVED                      @01A   02245400
DSPSYMP  DS   F                    POINTER TO A SYMPTOM RECORD          02246300
*                                  SUPPLIED AS INPUT TO SDUMP.   @01A   02247200
*                                                                       02248100
         DS   CL14                 RESERVED                      @01C   02249000
         MEND                                                           02250000
**/      %DSPDPLS2:;                                                    02350000
*   DCL                                                                 02400000
*     DSPVSNC CHAR(4) CONSTANT('DSP1');/* NAME AND VERSION OF THIS      02450000
*                                      MACRO                         */ 02500000
*   DCL                                                                 02550000
*     1 DSPD BASED,                 /* PRE-DUMP PARAMETER LIST       */ 02600000
*      2 DSPID CHAR(4),             /* MACRO ID                      */ 02650000
*        4 DSPDSP CHAR(3),          /* ACRONYM='DSP'                 */ 02700000
*        4 DSPVSN CHAR(1),          /* VERSION NUMBER                */ 02750000
*      2 DSPSDWA PTR(31),           /* PTR-SDWA OR ZERO              */ 02800000
*      2 DSPABDP PTR(31),           /* PTR-SYMPTOMS FROM SYSMDUMP       02850000
*                                      UNUSED FOR SVCDUMP            */ 02900000
*      2 DSPHDR PTR(31),            /* POINTER TO DUMP HEADER RECORD */ 02902700
*      2 DSPEXTRC FIXED(31),        /* RETURN CODE FROM ADYEXT       */ 02905400
*      2 DSPERID CHAR(10),          /* ERROR-ID FROM CURRENT PROBLEM */ 02908300
*        4 DSPESEQ# CHAR(2),        /* SEQUENCE NUMBER               */ 02916600
*        4 DSPECPUI CHAR(2),        /* LOGICAL CPUID                 */ 02924900
*        4 DSPEERAS CHAR(2),        /* ASID FOR ERROR MEMORY         */ 02933200
*        4 DSPEERTM CHAR(4),        /* TIME STAMP AT TIME OF ERROR   */ 02941500
*      2 DSPSCNT FIXED(15),         /* COUNT OF SYMPTOMS             */ 02950000
*      2 DSPSLN FIXED(15),          /* LENGTH OF SYMPTOM STRING         02983300
*                                      INCLUDING A TRAILING BLANK    */ 03016600
*      2 DSPPSVD1 CHAR(20),         /* RESERVED FOR DAE USE          */ 03050000
*      2 DSPPSVD2 CHAR(20),         /* RESERVED FOR SDUMPS USE       */ 03100000
*      2 DSPFLG1 BIT(16),           /* FLAGS SET BY SVC DUMP         */ 03250000
*        4 DSPSVC BIT(1),           /* SVC DUMP BEING PROCESSED      */ 03300000
*        4 DSPSYSM BIT(1),          /* SYSMDUMP DUMP BEING PROCESSED */ 03350000
*        4 DSPSDS BIT(1),           /* SDUMP FAILED TO TAKE COMPLETE    03400000
*                                      DUMP. DID TAKE A PARTIAL.     */ 03450000
*        4 DSPTERM BIT(1),          /* SDUMP FAILED TO TAKE ANY DUMP.   03500000
*                                      SO THE DATASET IS STILL EMPTY.*/ 03550000
*        4 DSPSDMPH BIT(1),         /* SDUMP has updated its header     03580990
*                                      information               @02A*/ 03586980
*        4 *        BIT(11),        /* RESERVED                  @02C*/ 03592970
*      2 DSPFLG2 BIT(16),           /* FLAGS SET BY DAE              */ 03600000
*        4 DSPNOAVL BIT(1),         /* 1=ADD ENTRY TO SYMPTOM QUEUE.    03650000
*                                      ALL QUEUE AREAS ARE EXHAUSTED */ 03700000
*        4 *        BIT(15),        /* RESERVED                      */ 03725000
*      2 DSPSTAT CHAR(LENGTH(DSTAT)),/* STATUS BITS FOR DAE TO BE       03750000
*                                      COPIED INTO AMDDATA FIELD        03800000
*                                      S05STAT. MAPPED BY ADYDSTAT   */ 03850000
*      2 * CHAR(2),                 /* RESERVED                  @01A*/ 03900000
*      2 DSPSYMP  PTR(31),          /* POINTER TO A SYMPTOM RECORD      03950000
*                                      SUPPLIED AS INPUT TO SDUMP.      04000000
*                                                                @01A*/ 04050000
*      2 * CHAR(14);                /* RESERVED                  @01C*/ 04100000
