*       %GOTO DSXPLS1;     /*                                           00010000
         MACRO                                                          00020000
         ADYDSX                                                         00030000
**/     %DSXPLS1:;                                                      00040000
*/********************************************************************/ 00050000
*/*   MACRO NAME - ADYDSX                                            */ 00100000
*/*                                                                  */ 00150000
*/*   DESCRIPTIVE NAME - DAE SYMPTOM EXTRACTION ROUTINE              */ 00183300
*/*                      PARAMETER LIST                              */ 00216600
*/*                                                                  */ 00250000
*/*       COMPONENT - SC143                                          */ 00300000
*/*       DISTRIBUTION LIBRARY - AMODGEN                             */ 00350000
*/*                                                                  */ 00400000
*/***PROPRIETARY_STATEMENT********************************************/ 00414200
*/*01* PROPRIETARY STATEMENT=                                        */ 00428400
*/*                                                                  */ 00442800
*/*                                                                  */ 00485600
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00528400
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00571200
*/* 5695-047 (C) COPYRIGHT IBM CORP. 1983, 1992                      */ 00614000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00656800
*/*                                                                  */ 00700000
*/* STATUS= HBB4430                                                  */ 00725000
*/*                                                                  */ 00750000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00775000
*/*                                                                  */ 00800000
*/*   FUNCTION - PROVIDES DATA FOR ALL OF THE FUNCTIONS OF ADYEXT    */ 00850000
*/*              AND ADYEXTT FOR INPUT/OUTPUT INTERFACE FOR          */ 00900000
*/*              OBTAINING SYMPTOMS AND CLUES FROM AN SDWA.          */ 00950000
*/*                                                                  */ 01000000
*/*   METHOD OF ACCESS -                                             */ 01050000
*/*      PLS - INCLUDE ADYDSX  FROM SYSLIB.                          */ 01100000
*/*            INCLUDE ADYDSTAT FROM SYSLIB.                         */ 01125000
*/*            INCLUDE ADYSVCS (FOR RCV) FROM SYSLIB.                */ 01137500
*/*                                                                  */ 01150000
*/*    ASSEM - PROVIDE BASING FOR DSX                                */ 01200000
*/*                                                                  */ 01250000
*/*   CREATED BY- CALLER BEFORE CALLING ADYEXT                       */ 01450000
*/*                                                                  */ 01500000
*/*            THE SIZE OF THE DSX IS VARIABLE BASED ON THE NUMBER   */ 01516600
*/*            OF ENTRIES DESIRED IN THE TABLE (DSXTBLZ),            */ 01524900
*/*            PLUS THE AMOUNT OF STORAGE NEEDED TO CONTAIN THE      */ 01533200
*/*            CHARACTER STRINGS REPRESENTING ANY UNPRINTABLE        */ 01541500
*/*            OR ALTERED SYMPTOM DATA.                              */ 01549800
*/*                                                                  */ 01558100
*/*            LENGTH(DSXFIX) + ( N * LENGTH(DSXTBLZ) )              */ 01566400
*/*            WHERE N IS THE NUMBER OF ENTRIES DESIRED.             */ 01583000
*/*            PLUS THE LENGTH OF CONVERTED DATA.                    */ 01585800
*/*             ONE BYTE OF HEX DATA BECOMES TWO CHARACTERS,         */ 01588600
*/*             ONE BYTE OF FLAGS BECAME EIGHT,                      */ 01591400
*/*             MODULE AND CSECT NAMES MUST BE COPIED OVER TO HAVE   */ 01594200
*/*             A TWO CHARACTER SUFFIX ADDED, ETC.                   */ 01597000
*/*                                                                  */ 01600000
*/*            ALL PARTS OF THE DSX NOT SPECIFICALLY SET TO A        */ 01604100
*/*            NONZERO VALUE MUST BE SET TO ZERO.                    */ 01608200
*/*                                                                  */ 01612300
*/*            IN ADDITION TO THE DSX AN RCV MUST ALSO BE CREATED    */ 01616600
*/*            AND THE ADDRESS PLACED IN DSXRCV.                     */ 01633200
*/*                                                                  */ 01649800
*/*   SERIALIZATION - NONE REQUIRED.                                 */ 01666400
*/*                                                                  */ 01683000
*/*   CHANGE ACTIVITY = CREATED FOR JBB2110                          */ 01700000
*/* $MAC(ADYDSX),COMP(SC143),PROD(DAE):                              */ 01800000
*/* FLAG  REASON  RELEASE    DATE   ORIGIN                           */ 01850000
*/* $L0=   DAE    JBB2110   821201   PD1W:                           */ 01900000
*/* $L1=  FASTS   HBB4430   911202   PDBG: FAST SERVICE SUPPORT      */ 01925000
*/*                                                                  */ 01950000
*/********************************************************************/ 02050000
*   @EJECT;                                                             02071700
*/* THE FOLLOWING SYMBOLS ARE USED TO DENOTE WHO WILL MODIFY         */ 02093400
*/* EACH FIELD IN THE PARMLIST:                                      */ 02115100
*/* -C- CALLER MUST SET AN INITIAL VALUE.                            */ 02136800
*/* -P- ADYEXT WILL SET A RETURN VALUE,                              */ 02158500
*/* -CP- CALLER MUST INIT AND ADYEXT MAY CHANGE.                     */ 02180200
*        %GOTO DSXPLS2;         /*                                      02183300
DSXVSNC  EQU  C'DSX1'                  NAME AND VERSION NUMBER TO      X02183400
                                        BE PUT INTO DSXID WHEN THIS    X02183500
                                        DATAAREA IS CREATED.            02183600
         IEZBITS                                                        02183700
DSX      DSECT                         ADYDSX MACRO FOR ADYEXT          02183800
DSXFIX   DS   0F                                                        02183900
DSXID    DS   0CL4                     -C- ACRONYM AND VERSION NUMBER   02184000
DSXDSX   DS   CL3                      ACRONYM 'DSX'                    02184100
DSXVSN   DS   CL1                      VERSION NUMBER                   02184200
DSXFUNC  DS   BL1                      -C- ADYEXT FUNCTION CODE:       X02184300
                                        DSXKEYS, DSXALL, OR DSXDATA    X02184400
                                        (SEE CONSTANTS BELOW).          02184500
         DS   CL2                      RESERVED                  @L1C   02184600
DSXFLAGS DS   BL1                                                @L1A   02184700
DSXSDWAC EQU  X'80'                    ON => THE SDWA IS COMPRESSED    X02184800
                                       AS IT IS WHEN IT IS WRITTEN     X02184900
                                       OUT TO SYS1.LOGREC BY RECORD.   X02185000
                                       (IEAVTRET SETS THIS).           X02185100
                                       OFF => SDWA IS NOT COMPRESSED.  X02185200
                                                                 @L1A   02185300
DSXWKP   DS   F                        -C- ADDRESS OF WORKAREA PROVIDEDX02185400
                                        BY CALLER. LENGTH DEFINED BY   X02185500
                                        DSXWKTL.                        02185600
DSXSDWA  DS   F                        -C- PTR TO SDWA OR 0 IF THERE   X02185700
                                        IS NONE                         02185800
DSXEXT1  DS   F                        -C- PTR TO SDWA                 X02185900
                                        EXTENSION=SDWARC1, OR THE      X02186000
                                        ADDRESS OF WHERE IT HAS BEEN    02186100
*                                       COPIED TO, OR 0 IF THERE IS     02186200
*                                       NONE                            02186300
DSXEXT2  DS   F                        -C- PTR TO SDWA                 X02186400
                                        EXTENSION=SDWARC2, OR THE      X02186500
                                        ADDRESS OF WHERE IT HAS BEEN    02186600
*                                       COPIED TO, OR 0 IF THERE IS     02186700
*                                       NONE                            02186800
DSXABDP  DS   F                       -C- PTR TO ABDUMP SYMPTOM AREA   X02186900
                                       OR 0 IF THERE IS NONE            02187000
DSXCRIT  DS   0CL84                   CRITERIA FOR SYMPTOM STRING TO   X02187100
                                       BE CONSIDERED AS A UNIQUE       X02187200
                                       IDENTIFIER BY DAE                02187300
DSXMINC  DS   H                       -CP- MINIMUM NUMBER OF           X02187400
                                       SYMPTOMS TO BE CONSIDERED A     X02187500
                                       UNIQUE STRING. MAY BE            02187600
*                                      OVERRIDEN BY THE SDWA VRA KEY    02187700
*                                      VRAMINSC.                        02187800
DSXMINL  DS   H                       -CP- MINIMUM LENGTH OF STRING    X02187900
                                       TO BE CONSIDERED UNIQUE. MAY    X02188000
                                       BE OVERRIDEN BY THE SDWA VRA     02188100
*                                      KEY VRAMINSL.                    02188200
DSXREQ   DS   0CL40                   -CP- CODES OF REQUIRED           X02188300
                                       SYMPTOMS FROM DEFAULTS OR USE   X02188400
                                       OF THE VRAREQ KEY                02188500
DSXREQA  DS   20CL2                   ARRAY CONTAINING ONE REQUIRED    X02188600
                                       KEY PER ENTRY                    02188700
DSXOPT   DS   0CL40                   -CP- CODES OF OPTIONAL           X02188800
                                       SYMPTOMS FROM DEFAULTS OR USE   X02188900
                                       OF THE VRAOPT KEY                02189000
DSXOPTA  DS   20CL2                   ARRAY CONTAINING ONE OPTIONAL    X02189100
                                       KEY PER ENTRY                    02189200
DSXREQF  DS   H                       -P- COUNT-NUMBER OF KEYS IN      X02189300
                                       DSXREQ WHERE SYMPTOMS WERE      X02189400
                                       FOUND                            02189500
DSXOPTF  DS   H                       -P- COUNT-NUMBER OF KEYS IN      X02189600
                                       DSXOPT WHERE SYMPTOMS WERE      X02189700
                                       FOUND                            02189800
DSXRCV   DS   F                       -C- ADDRESS OF THE RECOVERY      X02189900
                                       DATA FOR ADYEXT MAPPED BY RCV   X02190000
                                       DATAAREA IN ADYSVCS.             02190100
DSXERR   DS   CL8                     -P- DUMP SUPPRESSION STATUS      X02190200
                                       AND ERROR FLAGS MAPPED BY       X02190300
                                       ADYDSTAT.                        02190400
DSXSIZE  DS   H                       -C- SIZE IN BYTES OF THE ENTIRE  X02190500
                                       DSX. SEE PROLOG FOR GUIDE LINES X02190600
                                       ON CHOOSING THE PROPER SIZE.     02190700
DSXTUSED DS   H                       -CP- ACTUAL NUMBER OF DSXTBLZ    X02190800
                                       ENTRIES CURRENTLY IN USE.        02190900
DSXTBLZ  DS   0CL40                   ARRAY OF SYMPTOM                 X02191000
                                       DATA RETURNED FROM ADYEXT        02191100
DSXHEX   DS    H                      HEXADECIMAL KEY OF SYMPTOM        02191200
DSXRTNCD DS    H                      RETAIN KEY OF SYMPTOM             02191300
         SPACE 1                                                        02191400
DSXTBLX  DS   0CL2                    DATA TABLE INDEXES                02191500
DSXSRCT  DS   BL1                     -P- INDEX INTO DATA TABLE ADDRESSX02191600
                                       ARRAY INDICATING WHICH TO USE.  X02191700
                                       THE POSSIBLE VALUES ARE BELOW.   02191800
DSXSRCI  DS   BL1                     -P- INDEX OF THE DATA TABLE ENTRYX02191900
                                       FOR THIS SYMPTOM                 02192000
DSXATTR  DS   B                       ATTRIBUTES OF THE SYMPTOM        X02192100
                                       DATA                             02192200
*********************************************************************** 02192300
*      NOTE THAT THE CONTENTS OF THIS FLAG BYTE ARE OBTAINED AS A UNIT* 02192400
*FROM A TABLE AND THEREFORE THE POSITIONS MUST REMAIN UNCHANGED.      * 02192500
*********************************************************************** 02192600
DSXAEBCD EQU  BIT0                    THE SOURCE OF THIS SYMPTOM DATA  X02192700
                                       IS PRINTABLE (EG DSNAME).        02192800
DSXAFLAG EQU  BIT1                    THE SOURCE OF THIS SYMPTOM DATA  X02192900
                                       IS A BIT STRING (EG FLAGS).      02193000
DSXAHEXA EQU  BIT2                    THE SOURCE OF THIS SYMPTOM DATA  X02193100
                                       IS HEX DATA (EG ADDRESS).        02193200
DSXANSTD EQU  BIT4                    THE SOURCE OF THIS SYMPTOM DATA  X02193300
                                       REQUIRES SPECIAL PROCESSING TO  X02193400
                                       DETERMINE THE SYMPTOM VALUE.     02193500
DSXALTSC EQU  BIT5                     SYMPTOM DATA FOR THIS KEY MAY BEX02193600
                                       FOUND IN AN ALTERNALTE AREA.    X02193700
                                       FOR EXAMPLE THE ABDUMP AREA IS   02193800
*                                     THE ALTERNATE TO THE SDWA FOR THE 02193900
*                                      ABEND CODE. IF THE ALTERNATE IS  02194000
*                                      AVAILABLE IT WILL BE USED.       02194100
DSXAOPRN EQU  BIT6                    THE DATA FOR THIS KEY IS NOT     X02194200
                                       SYMPTOM DATA (EG KEY THAT       X02194300
                                       INDICATES THE END OF THE VRA)    02194400
DSXRATTR DS   B                       ATTRIBUTES OF RETAIN SYMPTOM     X02194500
                                       DATA                             02194600
DSXRNSTD EQU  BIT4                    SYMPTOM DATA REQUIRES SPECIAL    X02194700
                                       PROCESSING FOR RETAIN SYMPTOM.   02194800
DSXRFIXD EQU  BIT7                    THE DATA FOR THIS RETAIN SYMPTOM X02194900
                                       MUST BE OF A RETAIN OR SDB      X02195000
                                       DEFINED FIXED LENGTH.            02195100
         SPACE 1                                                        02195200
DSXRTNKL DS   H                       RETAIN VISIBLE KEYWORD LENGTH     02195300
DSXRTNK  DS   CL8                     RETAIN VISIBLE KEYWORD            02195400
DSXMVSKL DS   H                       MVS VISIBLE KEYWORD LENGTH        02195500
DSXMVSK  DS   CL8                     MVS VISIBLE KEYWORD               02195600
         SPACE 1                                                        02195700
DSXMVSS  DS   F                       ADDRESS OF MVS SYMPTOM DATA OR   X02195800
                                       FOR DSXFUNC=DSXDATA THIS WILL   X02195900
                                       CONTAIN THE OFFSET WITHIN THE    02196000
*                                      DATA AREA INDICATED BY DSXSRCT   02196100
DSXRTNS  DS   F                       ADDRESS OF RETAIN SYMPTOM DATA ORX02196200
                                       FOR DSXFUNC=DSXDATA THIS WILL   X02196300
                                       BE 0.                            02196400
DSXMVSSL DS   H                       LENGTH OF MVS SYMPTOM DATA       X02196500
                                       POINTED TO BY DSXMVSS OR        X02196600
                                       FOR DSXFUNC=DSXDATA THIS WILL    02196700
*                                      CONTAIN THE LENGTH OF SOURCE     02196800
*                                      DATA AREA.                       02196900
DSXRTNSL DS   H                       LENGTH OF RETAIN SYMPTOM DATA    X02197000
                                       POINTED TO BY DSXRTNS. FOR      X02197100
                                       DSXFUNC=DSXDATA THIS WILL BE 0.  02197200
*********************************************************************** 02197300
*         VALUES FOR DSXFUNC                                          * 02197400
*********************************************************************** 02197500
DSXKEYS  EQU  1                       EXTRACT ONLY SYMPTOMS            X02197600
                                       DEFINED IN DSXREQ AND DSXOPT     02197700
DSXALL   EQU  2                       EXTRACT ALL SYMPTOMS             X02197800
                                       POSSIBLE                         02197900
DSXDATA  EQU  3                       RETURN DATA DESCRIBING EACH KEY  X02198000
                                       (VISIBLE OR HEX) IN THE TABLE,  X02198100
                                       BUT DO NOT EXTRACT SYMPTOM DATA  02198200
*********************************************************************** 02198300
*   DSXSRCT VALUES. THESE VALUES CAN BE USED AS AN INDEX INTO AN      * 02198400
*   ARRAY OF ADDRESSES WHICH REPRESENT THE BASE POINTERS FOR THE DATA * 02198500
*   ARRAYS INDEXED BY DSXSRCI. THE ARRAY OF ADDRESSES MUST BE LOCALLY * 02198600
*   GENERATED, BUT THE DATA ARRAYS MAY BE OBTAINED BY INCLUDING       * 02198700
*   SEGMENT ADYEXTD.                                                  * 02198800
*********************************************************************** 02198900
DSXDV    EQU  255                 INDICATES THAT THIS KEY IS ONE OF THEX02199000
                                   DEVELOPER ASSIGNED SYMPTOM KEYS FROMX02199100
                                   IHAVRA.  --->THE DSXSRCI VALUE IS    02199200
*                                  THE ACTUAL KEY VALUE                 02199300
DSXVA    EQU  1                   INDICATES THAT THIS SYMPTOM WAS      X02199400
                                   OBTAINED FROM THE SDWAVRA AREA       02199500
DSXFX    EQU  2                   INDICATES THAT THIS SYMPTOM WAS      X02199600
                                   OBTAINED FROM THE SDWA FIXED AREA    02199700
DSXE1    EQU  3                   INDICATES THAT THIS SYMPTOM WAS      X02199800
                                   OBTAINED FROM THE FIRST SDWA        X02199900
                                   RECORDABLE EXTENSION                 02200000
DSXE2    EQU  4                   INDICATES THAT THIS SYMPTOM WAS      X02200100
                                   OBTAINED FROM THE SECOND SDWA       X02200200
                                   RECORDABLE EXTENSION                 02200300
DSXAB    EQU  5                   INDICATES THAT THIS SYMPTOM WAS      X02200400
                                   OBTAINED FROM THE ABDUMP AREA        02200500
*********************************************************************** 02200600
*         ADYEXT WORKAREA LENGTHS                                     * 02200700
*********************************************************************** 02200800
DSXWKTL  EQU  1900                TOTAL LENGTH OF THE WORKAREA TO      X02200900
                                   BE PASSED TO ADYEXT. SEE FIELD      X02201000
                                   DSXWKP                               02201100
DSXWKTTL EQU  400                 LENGTH OF THE PORTION OF THE         X02201200
                                   WORKAREA FOR ADYEXT WHICH WILL      X02201300
                                   BE RESERVED FOR ADYEXTT.             02201400
         MEND                                                           02201500
**/      %DSXPLS2:;                                                     02201600
    DCL                                                                 02201900
      DSXVSNC CHAR(4) CONSTANT('DSX1');/* NAME AND VERSION NUMBER TO    02223600
                                       BE PUT INTO DSXID WHEN THIS      02245300
                                       DATAAREA IS CREATED.          */ 02267000
    DCL                                                                 02288700
      1 DSX BDY(WORD) BASED,        /* ADYDSX MACRO FOR ADYEXT       */ 02310400
       2 DSXFIX,                                                        02332100
         4 DSXID CHAR(4),           /* -C- ACRONYM AND VERSION NUMBER*/ 02353800
           6 DSXDSX CHAR(3),        /* ACRONYM 'DSX'                 */ 02375500
           6 DSXVSN CHAR(1),        /* VERSION NUMBER                */ 02397200
         4 DSXFUNC FIXED(8),        /* -C- ADYEXT FUNCTION CODE:        02402100
                                       DSXKEYS, DSXALL, OR DSXDATA      02407000
                                       (SEE CONSTANTS BELOW).        */ 02410900
         4 *      CHAR(2),          /* RESERVED                  @L1C*/ 02414800
         4 DSXFLAG BIT(8),          /* DSX FLAGS                 @L1A*/ 02418700
           6 DSXSDWAC BIT(1),       /* ON => THE SDWA IS COMPRESSED     02422600
                                       AS IT IS WHEN IT IS WRITTEN      02426500
                                       OUT TO SYS1.LOGREC BY RECORD.    02430400
                                       (IEAVTRET SETS THIS).            02434300
                                       OFF => SDWA IS NOT COMPRESSED.   02438200
                                                                 @L1A*/ 02442100
           6 *        BIT(7),       /* RESERVED                  @L1A*/ 02446000
         4 DSXWKP PTR(31),          /* -C- ADDRESS OF WORKAREA PROVIDED 02450000
                                       BY CALLER. LENGTH DEFINED BY     02483000
                                       DSXWKTL.                      */ 02516000
         4 DSXSDWA PTR(31),         /* -C- PTR TO SDWA OR 0 IF THERE    02549100
                                       IS NONE                       */ 02570800
         4 DSXEXT1 PTR(31),         /* -C- PTR TO SDWA                  02592500
                                       EXTENSION=SDWARC1, OR THE        02614200
                                       ADDRESS OF WHERE IT HAS BEEN     02635900
                                       COPIED TO, OR 0 IF THERE IS      02657600
                                       NONE                          */ 02679300
         4 DSXEXT2 PTR(31),         /* -C- PTR TO SDWA                  02701000
                                       EXTENSION=SDWARC2, OR THE        02722700
                                       ADDRESS OF WHERE IT HAS BEEN     02744400
                                       COPIED TO, OR 0 IF THERE IS      02766100
                                       NONE                          */ 02787800
         4 DSXABDP PTR(31),         /* -C- PTR TO ABDUMP SYMPTOM AREA   02809500
                                       OR 0 IF THERE IS NONE         */ 02831200
         4 DSXCRIT,                 /* CRITERIA FOR SYMPTOM STRING TO   02881200
                                       BE CONSIDERED AS A UNIQUE        02931200
                                       IDENTIFIER BY DAE             */ 02981200
         5 DSXMINC FIXED(15),       /* -CP- MINIMUM NUMBER OF           03031200
                                       SYMPTOMS TO BE CONSIDERED A      03373700
                                       UNIQUE STRING. MAY BE            03395400
                                       OVERRIDEN BY THE SDWA VRA KEY    03417100
                                       VRAMINSC.                     */ 03438800
         5 DSXMINL FIXED(15),       /* -CP- MINIMUM LENGTH OF STRING    03460500
                                       TO BE CONSIDERED UNIQUE. MAY     03482200
                                       BE OVERRIDEN BY THE SDWA VRA     03503900
                                       KEY VRAMINSL.                 */ 03525600
         5 DSXREQ,                  /* -CP- CODES OF REQUIRED           03526500
                                       SYMPTOMS FROM DEFAULTS OR USE    03527400
                                       OF THE VRAREQ KEY             */ 03528300
          6 DSXREQA(20) CHAR(2),    /* ARRAY CONTAINING ONE REQUIRED    03529200
                                       KEY PER ENTRY                 */ 03530100
         5 DSXOPT,                  /* -CP- CODES OF OPTIONAL           03531000
                                       SYMPTOMS FROM DEFAULTS OR USE    03531900
                                       OF THE VRAOPT KEY             */ 03532800
          6 DSXOPTA(20) CHAR(2),    /* ARRAY CONTAINING ONE OPTIONAL    03533700
                                       KEY PER ENTRY                 */ 03534600
         4 DSXREQF FIXED(15),       /* -P- COUNT-NUMBER OF KEYS IN      03535500
                                       DSXREQ WHERE SYMPTOMS WERE       03536400
                                       FOUND                         */ 03537300
         4 DSXOPTF FIXED(15),       /* -P- COUNT-NUMBER OF KEYS IN      03538200
                                       DSXOPT WHERE SYMPTOMS WERE       03539100
                                       FOUND                         */ 03540000
         4 DSXRCV PTR(31),          /* -C- ADDRESS OF THE RECOVERY      03540900
                                       DATA FOR ADYEXT MAPPED BY RCV    03541800
                                       DATAAREA IN ADYSVCS.          */ 03542700
         4 DSXERR CHAR(LENGTH(DSTAT)), /* -P- DUMP SUPPRESSION STATUS   03543600
                                       AND ERROR FLAGS MAPPED BY        03544500
                                       ADYDSTAT.                     */ 03545400
           4 DSXSIZE FIXED(15),     /* -C- SIZE IN BYTES OF THE ENTIRE  03564300
                                       DSX. SEE PROLOG FOR GUIDE LINES  03583200
                                       ON CHOOSING THE PROPER SIZE.  */ 03602100
           4 DSXTUSED FIXED(15),    /* -CP- ACTUAL NUMBER OF DSXTBLZ    03621000
                                       ENTRIES CURRENTLY IN USE.     */ 03639900
       2 DSXTBLZ(*) BDY(WORD),      /* ARRAY OF SYMPTOM                 03658800
                                       DATA RETURNED FROM ADYEXT     */ 03661800
           6 DSXHEX FIXED(16),      /* HEXADECIMAL KEY OF SYMPTOM    */ 03663600
           6 DSXRTNCD  FIXED(16),   /* RETAIN KEY OF SYMPTOM    */      03665500
 @SPACE(1);                                                             03667500
           6 DSXTBLX,               /* DATA TABLE INDEXES            */ 03671400
             7 DSXSRCT FIXED(8),   /* -P- INDEX INTO DATA TABLE ADDRESS 03687000
                                       ARRAY INDICATING WHICH TO USE.   03690900
                                       THE POSSIBLE VALUES ARE DECLARED 03703900
                                       BELOW.                        */ 03716900
             7 DSXSRCI FIXED(8),   /* -P- INDEX OF THE DATA TABLE ENTRY 03729900
                                       FOR THIS SYMPTOM OR IT HEX KEY IF03731300
                                       IT IS A USER DEFINED SYMPTOM. */ 03732700
 /**** NOTE THAT THE CONTENTS OF THE NEXT TWO FLAG BYTES ARE OBTAINED   03734100
       AS A UNIT FROM A TABLE AND THEREFORE THE FLAG POSITIONS MUST     03734400
       REMAIN UNCHANGED */                                              03734700
           6 DSXATTR BIT(8),        /* ATTRIBUTES OF MVS SYMPTOM        03735000
                                       DATA                          */ 03735600
            8 DSXAEBCD BIT(1),      /* THE SOURCE OF THIS SYMPTOM DATA  03735900
                                       IS PRINTABLE (EG DSNAME).     */ 03736000
            8 DSXAFLAG BIT(1),      /* THE SOURCE OF THIS SYMPTOM DATA  03736100
                                       IS A BIT STRING (EG FLAGS).   */ 03736200
            8 DSXAHEXA BIT(1),      /* THE SOURCE OF THIS SYMPTOM DATA  03736300
                                       IS HEX DATA (EG ADDRESS).     */ 03736400
            8 *        BIT(1),      /* RESERVED                      */ 03736500
            8 DSXANSTD BIT(1),      /* THE SOURCE OF THIS SYMPTOM DATA  03736600
                                       REQUIRES SPECIAL PROCESSING TO   03736700
                                       DETERMINE THE SYMPTOM VALUE.  */ 03736800
            8 DSXALTSC BIT(1),      /* SYMPTOM DATA FOR THIS KEY MAY BE 03737200
                                       FOUND IN AN ALTERNALTE AREA.     03737600
                                       FOR EXAMPLE THE ABDUMP AREA IS   03738000
                                       THE ALTERNATE TO THE SDWA FOR THE03738400
                                       ABEND CODE. IF THE ALTERNATE IS  03738800
                                       AVAILABLE IT WILL BE USED.    */ 03739200
            8 DSXAOPRN BIT(1),      /* THE DATA FOR THIS KEY IS NOT     03739600
                                       SYMPTOM DATA (EG KEY THAT        03740000
                                       INDICATES THE END OF THE VRA) */ 03740400
           6 DSXRATTR BIT(8),       /* ATTRIBUTES OF RETAIN SYMPTOM     03740600
                                       DATA                          */ 03740800
            8 *        BIT(4),      /* RESERVED */                      03741000
            8 DSXRNSTD BIT(1),      /* SYMPTOM DATA REQUIRES SPECIAL    03741200
                                       PROCESSING FOR RETAIN SYMPTOM.*/ 03741400
            8 *        BIT(2),      /* RESERVED */                      03741600
            8 DSXRFIXD BIT(1),      /* THE DATA FOR THIS RETAIN SYMPTOM 03741800
                                       MUST BE OF A RETAIN OR SDB       03742000
                                       DEFINED FIXED LENGTH.         */ 03742200
 @SPACE(1);                                                             03742400
           6 DSXRTNKL FIXED(15),    /* RETAIN VISIBLE KEYWORD LENGTH */ 03742600
           6 DSXRTNK CHAR(8),       /* RETAIN VISIBLE KEYWORD PADDED ON 03757000
                                       THE RIGHT WITH BLANKS.        */ 03771400
           6 DSXMVSKL FIXED(15),    /* MVS VISIBLE KEYWORD LENGTH    */ 03786000
           6 DSXMVSK CHAR(8),       /* MVS VISIBLE KEYWORD PADDED ON    03804400
                                       THE RIGHT WITH BLANKS.        */ 03822800
 @SPACE(1);                                                             03841400
           6 DSXMVSS PTR(31),       /* ADDRESS OF MVS SYMPTOM DATA OR   03854000
                                       FOR DSXFUNC=DSXDATA THIS WILL    03866600
                                       CONTAIN THE OFFSET WITHIN THE    03879200
                                       DATA AREA INDICATED BY DSXSRCT.*/03891800
           6 DSXRTNS PTR(31),       /* ADDRESS OF RETAIN SYMPTOM DATA OR03904400
                                       FOR DSXFUNC=DSXDATA THIS WILL    03917000
                                       BE 0. */                         03929600
           6 DSXMVSSL FIXED(15),    /* LENGTH OF MVS SYMPTOM DATA       03942600
                                       POINTED TO BY DSXMVSS OR         03948000
                                       FOR DSXFUNC=DSXDATA THIS WILL    03953400
                                       CONTAIN THE LENGTH OF SOURCE     03958800
                                       DATA AREA.                     */03964200
           6 DSXRTNSL FIXED(15);    /* LENGTH OF RETAIN SYMPTOM DATA    03969600
                                       POINTED TO BY DSXRTNS= MAXIMUM   04007600
                                       OR REQUIRED LENGTH */            04045600
       /* VALUES FOR DSXFUNC */                                         04083600
  DCL   DSXKEYS FIXED(8) CONSTANT(1), /* EXTRACT ONLY SYMPTOMS          04088600
                                       DEFINED IN DSXREQ AND DSXOPT  */ 04093600
        DSXALL FIXED(8) CONSTANT(2), /*EXTRACT ALL SYMPTOMS             04103600
                                       POSSIBLE                      */ 04113600
       DSXDATA FIXED(8) CONSTANT(3); /*RETURN DATA DESCRIBING EACH KEY  04163600
                                       (VISIBLE OR HEX) IN THE TABLE,   04213600
                                       BUT DO NOT EXTRACT SYMPTOM DATA*/04263600
      /* DSXSRCT VALUES. THESE VALUES CAN BE USED AS AN INDEX INTO AN   04268100
      ARRAY OF ADDRESSES WHICH RPRESENT THE BASE POINTERS FOR THE DATA  04272600
      ARRAYS INDEXED BY DSXSRCI. THE ARRAY OF ADDRESSES MUST BE LOCALLY 04277100
      GENERATED, BUT THE DATA ARRAYS MAY BE OBTAINED BY INCLUDING       04281600
      SEGMENT ADYEXTD. */                                               04286100
 DCL                                                                    04290600
   DSXDV FIXED(8) CONSTANT(255),/*INDICATES THAT THIS KEY IS ONE OF THE 04295100
                                  DEVELOPER ASSIGNED SYMPTOM KEYS FROM  04299600
                                  IHAVRA.  --->THE DSXSRCI VALUE IS THE 04304100
                                  ACTUAL KEY VALUE.                   */04308600
   DSXVA FIXED CONSTANT(1),    /* INDICATES THAT THIS SYMPTOM WAS       04313100
                                  OBTAINED FROM THE SDWAVRA AREA     */ 04317600
   DSXFX FIXED CONSTANT(2),    /* INDICATES THAT THIS SYMPTOM WAS       04322100
                                  OBTAINED FROM THE SDWA FIXED AREA   */04326600
   DSXE1 FIXED CONSTANT(3),    /* INDICATES THAT THIS SYMPTOM WAS       04331100
                OBTAINED FROM THE FIRST SDWA RECORDABLE EXTENSION */    04335600
   DSXE2 FIXED CONSTANT(4),    /* INDICATES THAT THIS SYMPTOM WAS       04340100
            OBTAINED FROM THE SECOND SDWA RECORDABLE EXTENSION */       04344600
   DSXAB FIXED CONSTANT(5);    /* INDICATES THAT THIS SYMPTOM WAS       04349100
                                  OBTAINED FROM THE ABDUMP AREA       */04353600
       /* ADYEXT WORKAREA LENGTHS                                     */04358100
  DCL DSXWKTL FIXED CONSTANT(1900),/* TOTAL LENGTH OF THE WORKAREA TO   04363600
                                      BE PASSED TO ADYEXT. SEE FIELD    04413600
                                      DSXWKP.                         */04463600
  DSXWKTTL FIXED CONSTANT(400);     /* LENGTH OF THE PORTION OF THE     04513600
                                       WORKAREA FOR ADYEXT WHICH WILL   04563600
                                       BE RESERVED FOR ADYEXTT. */      04613600
