*        %GOTO ADYPRD1;            /*                                   00050000
         MACRO                                                          00100000
&LABEL   ADYPRD    &DSECT=YES                                        */ 00150000
*%ADYPRD1 : ;                       /*                               */ 00200000
*/****************** Start of Specifications *************************/ 00250000
*/*                                                                  */ 00300000
*/*  Macro Name: ADYPRD                                              */ 00350000
*/*                                                                  */ 00400000
*/*  Descriptive Name: Dump Header mapping for DAE                   */ 00450000
*/*                                                                  */ 00500000
*/***PROPRIETARY_STATEMENT********************************************/ 00550000
*/*01* PROPRIETARY STATEMENT=                                        */ 00600000
*/*                                                                  */ 00850000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00870000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00880000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1983, 1998                  @P2C*/ 00895000
*/*                                                                  */ 00910000
*/* STATUS= HBB6606                                              @P2C*/ 00920000
*/*                                                                  */ 00930000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00940000
*/*                                                                  */ 00942500
*/*01* EXTERNAL CLASSIFICATION: NONE                                 */ 00945000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00947500
*/*                                                                  */ 00950000
*/*  Function:                                                       */ 01000000
*/*     ADYPRD describes the contents of symptom area of the dump    */ 01035700
*/*     header record.  This area contains a primary symptom string  */ 01071400
*/*     and a secondary symptom string which are in structured data  */ 01107100
*/*     base (SDB) RETAIN format.  The symptom area also contains    */ 01142800
*/*     a section to be used for additional information, which DAE   */ 01178500
*/*     uses to save its dump analysis information.                  */ 01214200
*/*                                                                  */ 01250000
*/*  Method of Access:                                               */ 01300000
*/*    BAL  -  Label  ADYPRD                                         */ 01350000
*/*    PL/S:                                                         */ 02000000
*/*         DCL PRDINPTR PTR(31)                                     */ 02050000
*/*         %INCLUDE SYSLIB(AMDDATA)                                 */ 02100000
*/*    Publications:                                                 */ 02150000
*/*         DCL PRDINPTR PTR(31)                                     */ 02200000
*/*         %INCLUDE SYSLIB(AMDDATA)                                 */ 02250000
*/*                                                                  */ 02300000
*/*  Pointed to by: At offset 2048 in PRDDATA                        */ 02350000
*/*                                                                  */ 02400000
*/*  Created by:                                                     */ 02450000
*/*     SVC Dump (IEAVTSDI, IEAVTSDH, ADYPRED)                       */ 02500000
*/*     SADMP (AMDSADM2)                                             */ 02550000
*/*                                                                  */ 02600000
*/*  Deleted by: N/A                                                 */ 02650000
*/*                                                                  */ 02700000
*/*  Subpool and Key: 239 and key 0                                  */ 02750000
*/*                                                                  */ 02800000
*/*  Storage estimate: 2048 bytes                                    */ 02850000
*/*                                                                  */ 02900000
*/*  Serialization: None                                             */ 02950000
*/*                                                                  */ 03000000
*/*  Notes:                                                          */ 03050000
*/*                                                                  */ 03100000
*/*  Change Activity:                                                */ 03150000
*/* FLAG REASON   RELEASE  DATE   ORIGIN                             */ 03200000
*/* $L0= DATASPAC HBB3310  860110  PDFP: New for Data Spaces         */ 03225000
*/* $L1= DATASPAC HBB3310  860110  PDFP: Same as L0                  */ 03250000
*/* $01= OY53319  HBB4420  920620  PD00A8: Correct Header Overrun    */ 03256200
*/* $L2= MSDAE    HBB4430  900911  PDCK: Multi System DAE            */ 03262500
*/* $P1= PIG1808  HBB5510  930611  PDHT: Correct SDUMP header overrun*/ 03266600
*/*                                                              @P1A*/ 03270700
*/* $L3= SERV2D07 HBB5520  940430  PD00A8: RECORDALL support         */ 03272800
*/* $P2= PVT0660  HBB6606  980324  PDHT: Correct SDUMP header overrun*/ 03273900
*/*                                                                  */ 03275000
*/******************* End of Specifications **************************/ 03300000
*                                                                       03350000
*%GOTO ADYPRD2;                    /*                                   03400000
         SPACE 1                                                        03450000
PRDINPUT DSECT                                                     @L1P 03500000
*********************************************************************** 03550000
*    PRINT DUMP SYMPTOM AREA FORMAT                                   * 03600000
*                                                                     * 03650000
*    THIS AREA IS DEFINED ON PRDSR WHICH BEGINS 2048 INTO THE HEADER  * 03700000
*    RECORD BUILT BY SDUMP. THERE IS A REQUIREMENT THAT THE SYMPTOM   * 03750000
*    STRING HEADER RECORD BEGIN AT THAT OFFSET.                       * 03800000
*                                                                     * 03850000
*********************************************************************** 03900000
         SPACE 1                                                   @L1P 03950000
         ORG  PRDDATA+2048                2048 INTO HEADER         @L1P 04000000
PRDSR    DS   0CL2048                     PRINT DUMP SYMTOM RECORD AREA 04050000
*                                                                  @L1P 04100000
SR       DS   CL2                         'SR' SYMPTOM AREA ID     @L1P 04150000
*                                                                       04200000
SRECID   EQU  C'SR'                       'SR' IDENTIFIER          @L1P 04250000
*                                                                       04300000
         DS   CL40                        RESERVED FOR FUTURE USE  @L1P 04350000
*                                                                       04400000
SRID     DS   CL9                         SYSTEM IDENTIFIER (DERIVED    04450000
*                                         FROM  FESN SYSTEM IDENTIFIER) 04500000
*                                         OS/VS2(MVS) C'5752     ' @L1P 04550000
*                                                                  @L1P 04600000
         DS   CL5                         RESERVED FOR FUTURE USE  @L1P 04650000
*                                                                       04700000
SRDTYPE  DS   CL8                         TYPE OF DUMP, SUCH AS         04750000
*                                         C'SVC DUMP'              @L1P 04800000
         DS   CL8                         RESERVED FOR FUTURE USE  @L1P 04850000
*                                                                       04900000
SRSLEN   DS   H                           LENGTH OF BASIC SYSTEM STRINGX04950000
                                          IN SYSTEM DATA BASE (SDB)    X05000000
                                          FORMAT FOR APARS         @L1P 05050000
SRSOFF   DS  H                            OFFSET TO BASIC SYMPTOM      X05100000
                                          STRING                   @L1P 05150000
SROLEN1  DS  H                            LENGTH OF OPTIONAL SYMPTOM   X05200000
                                          STRING IN SDB FMT        @L1P 05250000
SROFF1   DS  H                            OFFSET TO OPTIONAL SYMPTOM   X05300000
                                          STRING IN SDB FORMAT     @L1P 05350000
SROLEN2  DS  H                            LENGTH OF OPTIONAL SYMP  @L1P 05400000
*                                         STRING 2, MAY OR MAY NOT BE   05450000
*                                         IN SDB FORMAT. MAY BE CLUES   05500000
*                                         THAT ARE NOT REPEATABLE,      05550000
*                                         SO THEY MAY NOT BE USEFUL     05600000
*                                         FOR DUPLICATE PROBLEM         05650000
*                                         RECOGNITION              @L1P 05700000
SROFF2   DS  H                            OFFSET TO OPTIONAL SYMPTOM   X05750000
                                          STRING 2                 @L1P 05800000
SRLENCS  DS  H                            LENGTH OF COMPONENT SYMPTOM  X05850000
                                          AREA. ZERO IF NOT SUPPLIED.  X05900000
                                                                   @L1P 05950000
SROFFCS  DS  H                            OFFSET TO COMPONENT SYMPTOM  X06000000
                                          AREA.  ZERO IF NOT IN         06050000
*                                         SYMPTOM AREA.  SRADDRCS       06100000
*                                         CAN BE SUPPLIED IF THIS       06150000
*                                         FIELD IS ZERO.           @L1P 06200000
SRADDRCS DS  F                            VIRTUAL ADDRESS OF COMPONENT  06250000
*                                         SYMPTOM AREA             @L1P 06300000
SRASID   DS  CL4                          SYSTEM DEPENDENT FIELD        06350000
*                                         (ASID FOR MVS)           @L1P 06400000
         DS  CL16                         RESERVED FOR FUTURE USE  @L1P 06450000
*                                                                       06500000
SRHDEND  DS  0F                           END OF HEADER RECORD     @L1P 06550000
*                                                                       06600000
         ORG SRHDEND                      BASIC STRING START       @L1P 06650000
SRBASIC  DS  0CL112                       BASIC SYMPTOM STRING     @L1P 06700000
SRABD    DS  CL8                          ABEND CODE IN SDB FORMAT      06750000
*                                         EX. AB/SC0D              @L1P 06800000
*                                                                       06850000
SRRC     DS  CL16                         REASON CODE (IF EXISTS)       06900000
*                                         EX. PRCS/1C08            @L1P 06950000
SRCID    DS  CL16                         COMPONENT ID                  07000000
*                                         EX. PIDS/5752SC1C3       @L1P 07050000
SRLM     DS  CL16                         LOAD MODULE NAME              07100000
*                                         EX.RIDS/IECIOSAM#L       @L1P 07150000
SRCSECT  DS  CL16                         CSECT NAME                    07200000
*                                         EX. RIDS/IECIOSCN        @L1P 07250000
SRFRR    DS  CL16                         RECOVERY ROUTINE NAME         07300000
*                                         EX.RIDS/IECIOFRR#R       @L1P 07350000
SREGPSW  DS  CL24                         REGISTER/PSW DIFFERENCES      07400000
*                                         EX. REGS/0C01B  REGS/FFFFF    07450000
*                                                                  @L1P 07500000
SRBASEND DS    0F                         END OF BASIC SYMPTOM STRING   07550000
*                                                                  @L1P 07600000
         ORG   SRBASEND                   START OF OPTIONAL SYMPTOM     07700000
SROPT1   DS    0C                         OPTIONAL STRING 1        @L1P 07750000
*                                         STRING - SDB FMT         @L1P 07800000
SROP1END DS    0F                         END OF OPTIONAL STRING 1      07850000
*                                                                  @L1P 07900000
         ORG   SROP1END                   START OF OPTIONAL SYMPTOM     07950000
SROPT2   DS    0CL84                      OPTIONAL STRING 2        @L1P 08000000
*                                         STRING 2 - NON-SDB       @L1P 08050000
SRPGM    DS    CL16                       ABENDING PROGRAM NAME         08100000
*                                         EX. PGM=IEFBR14          @L1P 08150000
SRLVL    DS    CL24                       ASSEMBLY MODULE LEVEL         08200000
*                                         EX. MODLVL=09/10/80UZ19271    08250000
*                                                                  @L1P 08300000
SRSC     DS    CL28                       COMPONENT/SUBCOMPONENT/       08350000
*                                         SUBFUNCTION DESCRIPTION  @L1P 08400000
*                                         EX. SC=IOS-EXCP          @L1P 08450000
SRRRL    DS    CL16                       RECOVERY ROUTINE LABEL        08500000
*                                         EX. RRL=ESTAERTN         @L1P 08550000
SROP2END DS    0F                         END OF OPTIONAL STRING 2      08600000
*                                                                  @L1P 08650000
         ORG                                                            08700000
*        RESTORE POINTER TO HIGHEST VALUE                          @L1P 08750000
*********************************************************************** 08800000
*                                                                     * 08850000
*      THIS SECTION CONTAINS THE RETAIN OR STRUCTURED DATA BASE       * 08900000
*      (SDB) FORMAT SYMPTOM STRING FROM THE DUMP ANALYSIS AND         * 08950000
*      ELIMINATION (DAE) PROGRAM.                                     * 09000000
*                                                                     * 09050000
*********************************************************************** 09100000
ADSSRCRS DSECT                         PRIMARY SYMPTOM STRING, RETAIN  X09150000
                                        FORMAT                     @L1P 09200000
RETANPSS DS   CL150                    RETAIN FORMAT PRIMARY SYMPTOM   X09250000
                                        STRING. THIS MUST END WITH AT  X09300000
                                        LEAST ONE BLANK.           @L1P 09350000
         SPACE 3                                                   @L1P 09400000
*********************************************************************** 09450000
*                                                                     * 09500000
*      THIS SECTION CONTAINS THE RETAIN OR STRUCTURED DATA BASE       * 09550000
*      (SDB) FORMAT SYMPTOM STRING CREATED BY IPCS EXITS THROUGH      * 09600000
*      THE ADD SYMPTOM SERVICE.                                       * 09650000
*                                                                     * 09700000
*********************************************************************** 09750000
ADSSRCSS DSECT                         SECONDARY SYMPTOM STRING    @L1P 09800000
RETANSSS DS  0C                        RETAIN FORMAT SECONDARY SYMPTOM X09850000
                                        STRING. THIS MUST END WITH AT  X09900000
                                        LEAST ONE BLANK.           @L1P 09950000
         SPACE 3                                                   @L1P 10000000
*********************************************************************** 10050000
*                                                                     * 10100000
*      THIS SECTION CONTAINS THE MVS FORMAT SYMPTOM STRING FROM       * 10150000
*      THE DUMP ANALYSIS AND ELIMINATION (DAE) PROGRAM, AND           * 10200000
*      DATA FROM DAE ABOUT THE DUMP AND ABOUT THE DUMP IDENTIFIED AS  * 10250000
*      THE ORIGINAL OCCURRENCE OF THIS PROBLEM.                       * 10300000
*                                                                     * 10350000
*********************************************************************** 10400000
ADSSRNSD DSECT                         OPTIONAL SYMPTOM DATA,          X10450000
                                        NONRETAIN FORMAT           @L1P 10500000
         SPACE 2                                                        10550000
ADSSDAE  DS   0CL291                   DUMP ANALYSIS AND ELIMINATION   X10600000
                                        (DAE) SECTION              @L1P 10650000
DAESSHDR DS   0CL2                     HEADER TO MVS FORMAT SYMPTOM    X10700000
                                        STRING                     @L1P 10750000
DAESSHT  DS   CL1                      DATA TYPE. 'F0'X FOR PRINTABLE  X10800000
                                                                   @L1P 10850000
DAESSHL  DS   HL1                      DATA LENGTH EQUAL TO            X10900000
                                        LENGTH(DAESSMVS)           @L1P 10950000
DAESSMVS DS   CL150                    MVS FORMAT SYMPTOM STRING   @L1P 11000000
         SPACE 2                                                        11050000
DAENSHDR DS   0CL2                     HEADER TO NONSYMPTOM STRING     X11100000
                                        DATA                       @L1P 11150000
DAENSHT  DS   CL1                      DATA TYPE. 'FF'X FOR            X11200000
                                        NONPRINTABLE               @L1P 11250000
DAENSHL  DS   BL1                      DATA LENGTH EQUAL TO            X11300000
                                       LENGTH(DAEDATA)             @L1P 11350000
DAEDATA  DS   0CL137                   NONSYMPTOM STRING DATA      @L1P 11400000
DAELVL   DS   CL4                      DAE LEVEL WHICH CREATED THIS    X11450000
                                        DATA. (ACRONYM AND VERSION     X11500000
                                        NUMBER FROM ADYDFLM).      @L1P 11550000
DAECRIT  DS   0CL84                   CRITERIA FOR SYMPTOM STRING TO   X11600000
                                       BE CONSIDERED AS A UNIQUE       X11650000
                                       IDENTIFIER BY DAE           @L1P 11700000
DAEMINC  DS   HL2                     MINIMUM NUMBER OF SYMPTOMS       X11750000
                                       IN THE SYMPTOM STRING FOR IT TO X11800000
                                       BE CONSIDERED UNIQUE.       @L1P 11850000
DAEMINL  DS   HL2                     MINIMUM LENGTH OF THE            X11900000
                                       SYMPTOM STRING TO BE CONSIDERED X11950000
                                       UNIQUE.                     @L1P 12000000
DAEREQ   DS   CL40                    KEYS REQUIRED FOR MATCHING   @L1P 12050000
*                                                                       12100000
DAEOPT   DS   CL40                    KEYS WHICH ARE OPTIONAL      @L1P 12150000
DAESSACT DS   0CL4                    ACTUAL VALUES USED TO DETERMINE  X12200000
                                       IF THE SYMPTOM STRING MAY BE    X12250000
                                       CONSIDERED UNIQUE.          @L1P 12300000
DAESLN   DS   HL2                     ACTUAL NUMBER OF BYTES OF        X12350000
                                       UNIQUE.                     @L1P 12400000
DAESCNT  DS   HL2                     ACTUAL COUNT OF THE NUMBER OF    X12450000
                                       SYMPTOM STRINGS TO BE CONSIDEREDX12500000
                                       UNIQUE.                     @L1P 12550000
DAESTAT  DS   CL8                     ADYDSTAT                     @L1P 12600000
         DS   CL6                     RESERVED FOR EXPANSION OF        X12650000
                                       DAESTAT                     @L1P 12700000
DAEORIG  DS   0CL21                   IDENTIFICATION OF THE ORIGINAL   X12750000
                                       OCCURRENCE OF THIS PROBLEM  @L1P 12800000
DAEERID  DS   0CL10                   ERROR ID                     @L1P 12850000
DAEERSEQ DS   HL2                     ERROR ID SEQUENCE NUMBER     @L1P 12900000
DAEERCPU DS   HL2                     ERROR ID CPU ID              @L1P 12950000
DAEERAS  DS   HL2                     ERROR ID ADDRESS SPACE ID    @L1P 13000000
DAETIME  DS   FL4                    ORIGINAL TIME-(BINARY             X13050000
                                       NUMBER TENTHS OF A SECOND       X13100000
                                       SINCE MIDNIGHT.)            @L1P 13150000
DAEDATE  DS   PL4                    ORIGINAL DATE (PACKED DECIMAL     X13200000
                                        JULIAN-00YYDDDF)           @L1P 13250000
DAECPUO  DS   CL6                    CPUID FROM STIDP INSTRUCTION  @L1P 13300000
         SPACE 1                                                   @L1P 13350000
DAEFLG   DS   BL1                    FLAGS                         @L1P 13400000
DAESVCD  EQU  BIT0                   AN SVC DUMP CREATED THE           X13450000
                                       ORIGINAL DOCUMENTATION      @L1P 13500000
DAESYSMD EQU  BIT1                   A SYSMDUMP CREATED THE            X13550000
                                        ORIGINAL DOCUMENTATION     @L1P 13600000
DAETRUM  EQU  BIT2                   ORIGINAL MVS SYMPTOM STRING WAS   X13650000
                                        TRUNCATED                  @L1P 13700000
DAERCDA  EQU  BIT3                   Entry was recorded because of     X13716600
                                        RECORDALL                  @L3A 13733300
DAECURR  DS   0CL10                 IDENTIFICATION OF THE CURRENT      X13750000
                                       PROBLEM                     @L1P 13800000
DAEDTIM  DS   FL4                    TIME OF CURRENT PROBLEM           X13850000
                                     (BINARY NUMBER, TENTHS OF A       X13900000
                                      SECOND SINCE MIDNIGHT        @L1P 13950000
DAEDDAT  DS   PL4                    DATE OF CURRENT PROBLEM           X14000000
                                     (PACKED DECIMAL                   X14050000
                                      JULIAN-00YYDDDF)             @L1P 14100000
DAEDCNT  DS   HL2                    NUMBER OF OCCURRENCES         @L1P 14150000
DAESNAMO DS   CL8                    SYSNAME - ORIGINAL            @L2A 14166600
DAESNAML DS   CL8                    SYSNAME - LAST OCCUR          @L2A 14183200
         EJECT                                                          14200000
*********************************************************************** 14250000
*          CONSTANT VALUES FOR VARIABLE DATA AREAS                    * 14300000
*********************************************************************** 14350000
ADSSTPNP EQU  X'FF'                  DATA TYPE IS NOT PRINTABLE    @L1P 14400000
ADSSTPPR EQU  X'F0'                  DATA TYPE IS PRINTABLE        @L1P 14450000
SRSYMML  EQU  15                     SYMPTOM MAXIMUM LENGTH        @L1P 14500000
         MEND                                                    @L1P*/ 14550000
*%ADYPRD2 : ;                       /*                           @L1P*/ 14600000
                                                                        14650000
    /*****************************************************************/ 14700000
    /*                                                               */ 14750000
    /* Dump Symptom Area - Build by DAE at Dump time                 */ 14800000
    /*                                                               */ 14850000
    /*****************************************************************/ 14900000
                                                                        14950000
    DECLARE                          /*                          @L1P*/ 15000000
      PRDSR    CHAR(2048) BASED(ADDR(PRDDATA)+2048) BDY(WORD);          15050000
                                                                        15100000
    DECLARE                                                             15150000
      1    ADSS     DEF(PRDSR) BDY(WORD), /* Beginning of symptom       15200000
                                       string 2048 into header   @L1P*/ 15250000
       2    SR       CHAR(2) BDY(WORD), /* 'SR' symptom area id         15300000
                                                                 @L1P*/ 15350000
       2    *        CHAR(40),      /* Reserved for future use          15400000
                                                                 @L1P*/ 15450000
       2    SRID     CHAR(9),       /* System identifier (derived       15500000
                                       from FESN system identifier)     15550000
                                                                 @L1P*/ 15600000
       2    *        CHAR(5),       /* Reserved for future use          15650000
                                                                 @L1P*/ 15700000
       2    SRDTYPE  CHAR(8),       /* Type of dump, such as 'SVC       15750000
                                       DUMP'                     @L1P*/ 15800000
       2    *        CHAR(8),       /* Reserved for future use          15850000
                                                                 @L1P*/ 15900000
       2    SRSLEN   FIXED(15),     /* Length of primary symptom        15950000
                                       string (ADSSRCRS)         @L1P*/ 16000000
       2    SRSOFF   FIXED(15),     /* Offset to primary symptom        16050000
                                       string (ADSSRCRS)         @L1P*/ 16100000
       2    SROLEN1  FIXED(15),     /* Length of secondary symptom      16150000
                                       string (ADSSRCSS) or 0    @L1P*/ 16200000
       2    SROFF1   FIXED(15),     /* Offset to secondary symptom      16250000
                                       string (ADSSRCSS) or 0    @L1P*/ 16300000
       2    SROLEN2  FIXED(15),     /* Length of optional symptom       16350000
                                       string data (ADSSRNSD) not in    16400000
                                       SDB format.               @L1P*/ 16450000
       2    SROFF2   FIXED(15),     /* Offset to optional symptom       16500000
                                       string data (ADSSRNSD)    @L1P*/ 16550000
       2    SRLENCS  FIXED(15),     /* Length of component symptom      16600000
                                       area. Zero if not supplied.      16650000
                                                                 @L1P*/ 16700000
       2    SROFFCS  FIXED(15),     /* Offset to component symptom      16750000
                                       area. Zero if not in symptom     16800000
                                       area. SRADDRCS can be supplied   16850000
                                       if this field is zero.           16900000
                                                                 @L1P*/ 16950000
       2    SRADDRCS PTR(31),       /* Virtual address of component     17000000
                                       symptom area              @L1P*/ 17050000
       2    SRASID   CHAR(4),       /* System dependent field (ASID     17100000
                                       for MVS)                  @L1P*/ 17150000
       2    *        CHAR(16),      /* Reserved for future use          17200000
                                                                 @L1P*/ 17250000
       2    SRHDEND  CHAR(0);       /* End of header record      @L1P*/ 17300000
    DECLARE                                                             17350000
      SRECID   CHAR(2) CONSTANT('SR'); /* 'SR' identifier        @L1P*/ 17400000
    DECLARE                                                             17450000
      SRSVCID  CHAR(8) CONSTANT('SVC DUMP'); /* SVC dump identifier     17500000
                                                                 @L1P*/ 17550000
    DECLARE                                                             17600000
      SRSYSMID CHAR(8) CONSTANT('SYSMDUMP'); /* SYSMDUMP (ABDUMP)       17650000
                                       identifier                @L1P*/ 17700000
    DECLARE                                                             17750000
      1    SRBASIC  DEF(SRHDEND) BDY(WORD), /* Basic string start       17800000
                                                                 @L1P*/ 17850000
       2    SRABD    CHAR(8),       /* ABEND code in SDB format ex.     17900000
                                       AB/SC0D                   @L1P*/ 17950000
       2    SRRC     CHAR(16),      /* Reason code (if exists) ex.      18000000
                                       PRCS/1C08                 @L1P*/ 18050000
       2    SRCID    CHAR(16),      /* Component id ex.                 18100000
                                       PIDS/5752SC1C3            @L1P*/ 18150000
       2    SRLM     CHAR(16),      /* Load module name                 18200000
                                       EX.RIDS/IECIOSAM#L        @L1P*/ 18250000
       2    SRCSECT  CHAR(16),      /* CSECT Name ex. RIDS/IECIOSCN     18300000
                                                                 @L1P*/ 18350000
       2    SRFRR    CHAR(16),      /* Recovery routine name            18400000
                                       EX.RIDS/IECIOFRR#R        @L1P*/ 18450000
       2    SREGPSW  CHAR(24),      /* Register/PSW differences ex.     18500000
                                       REGS/0C01B REGS/FFFFF     @L1P*/ 18550000
       2    SRBASEND CHAR(0);       /* End of basic string       @L1P*/ 18600000
    DECLARE                                                             18650000
      1    SROPT2   DEF(SRBASEND) BDY(WORD), /* Fixed format symptom    18700000
                                       string                    @L1P*/ 18750000
       2    SRPGM    CHAR(16),      /* Abending program name ex.        18800000
                                       PGM=IEFBR14               @L1P*/ 18850000
       2    SRLVL    CHAR(24),      /* Assembly module level ex.        18900000
                                       MODLVL=09/10/80UZ19271           18950000
                                                                 @L1P*/ 19000000
       2    SRSC     CHAR(28),      /* Component/subcomponent/          19050000
                                       subfunction description ex.      19100000
                                       SC=IOS-EXCP               @L1P*/ 19150000
       2    SRRRL    CHAR(16),      /* Recovery routine label ex.       19200000
                                       RRL=ESTAERTN              @L1P*/ 19250000
       2    SROP2END CHAR(0);       /* End of optional string 2         19300000
                                                                 @L1P*/ 19350000
 @EJECT;                            /*                           @L1P*/ 19400000
                                                                        19450000
    /*****************************************************************/ 19500000
    /*                                                               */ 19550000
    /* This section contains the RETAIN or Structured Data Base (SDB)*/ 19600000
    /* format symptom string from the Dump Analysis and Elimination  */ 19650000
    /* (DAE) program.                                                */ 19700000
    /*                                                               */ 19750000
    /*****************************************************************/ 19800000
                                                                        19850000
    DECLARE                                                             19900000
      1    ADSSRCRS BASED(ADDR(ADSS)+SRSOFF) BDY(WORD), /* Primary      19950000
                                       symptom string, retain format.   20000000
                                                                 @L1P*/ 20050000
        3    RETANPSS CHAR(150);    /* Retain format primary symptom    20100000
                                       string. This must end with at    20150000
                                       least one blank.          @L1P*/ 20200000
                                                                        20250000
    /*****************************************************************/ 20300000
    /*                                                               */ 20350000
    /* This section contains the RETAIN or Structured Data Base (SDB)*/ 20400000
    /* format symptom string created by IPCS exits through the Add   */ 20450000
    /* Symptom service.                                              */ 20500000
    /*                                                               */ 20550000
    /*****************************************************************/ 20600000
                                                                        20650000
    DECLARE                         /* This constant is used only to    20653300
                                       generate a compiler error if the 20656600
                                       size of the declared areas ever  20659900
                                       become too big to allow 512      20663200
                                       bytes of secondary symptom       20666500
                                       strings.  The number 512 is      20669800
                                       somewhat arbitrary, but care     20673100
                                       should be taken when reducing    20676400
                                       this number, as it may impeed    20679700
                                       serviceability.           @01A*/ 20683000
      ADSSCHEK BASED CHAR(LENGTH(PRDSR)-(LENGTH(ADSS)+LENGTH(SRBASIC) + 20686300
                              LENGTH(SROPT2) + LENGTH(ADSSRCRS) + 512 + 20689600
                              LENGTH(ADSSRNSD))); /*             @01A*/ 20692900
                                                                        20696200
    DECLARE                                                             20700000
      1    ADSSRCSS BASED(ADDR(ADSS)+SROFF1) BDY(WORD), /* Secondary    20750000
                                       symptom string, retain format.   20800000
                                                                 @L1P*/ 20850000
        3    RETANSSS CHAR(*);      /* Retain format secondary          20900000
                                       symptom string. This must end    20950000
                                       with at least one blank.  @L1P*/ 21000000
                                                                        21050000
    /*****************************************************************/ 21100000
    /*                                                               */ 21150000
    /* This section contains the MVS format symptom string from the  */ 21200000
    /* Dump Analysis and Elimination (DAE) program, and data from DAE*/ 21250000
    /* about the dump and about the dump identified as the original  */ 21300000
    /* occurrence of this problem.                                   */ 21350000
    /*                                                               */ 21400000
    /*****************************************************************/ 21450000
                                                                        21500000
    DECLARE                                                             21550000
      1    ADSSRNSD BASED(ADDR(ADSS)+SROFF2) BDY(WORD), /* Optional     21600000
                                       symptom data, nonretain format   21650000
                                                                 @L1P*/ 21700000
       2    ADSSDAE,                /* Dump analysis and elimination    21750000
                                       (DAE) section             @L1P*/ 21800000
        3    DAESSHDR,              /* Header to MVS format symptom     21850000
                                       string.                   @L1P*/ 21900000
         4    DAESSHT  CHAR(1),     /* Data type. 'F0'X for printable   21950000
                                                                 @L1P*/ 22000000
         4    DAESSHL  FIXED(8),    /* Data length equal to             22050000
                                       length(DAESSMVS)          @L1P*/ 22100000
        3    DAESSMVS CHAR(150),    /* MVS format symptom string @L1P*/ 22150000
        3    DAENSHDR BDY(WORD,1),  /* Header to nonsymptom string      22200000
                                       data                      @L1P*/ 22250000
         4    DAENSHT  CHAR(1),     /* Data type. 'FF'X for             22300000
                                       nonprintable              @L1P*/ 22350000
         4    DAENSHL  FIXED(8),    /* Data length equal to             22400000
                                       LENGTH(DAEDATA)           @L1P*/ 22450000
        3    DAEDATA  BDY(WORD,3),  /* Nonsymptom string data    @L1P*/ 22500000
         4    DAELVL   CHAR(4),     /* DAE level which created this     22550000
                                       data. (acronym and version       22600000
                                       number from control block        22650000
                                       ADYDFLM)                  @L1P*/ 22700000
         4    DAECRIT  BDY(WORD,3), /* Criteria for symptom string to   22750000
                                       be considered as a unique        22800000
                                       identifier by DAE.        @L1P*/ 22850000
          5    DAEMINC  FIXED(15) BDY(WORD,3), /* Minimum number of     22900000
                                       symptoms in the symptom string   22950000
                                       for it to be considered          23000000
                                       unique.                   @L1P*/ 23050000
          5    DAEMINL  FIXED(15) BDY(WORD,1), /* Minimum length of     23100000
                                       the symptom string to be         23150000
                                       considered unique.        @L1P*/ 23200000
          5    DAEREQ   CHAR(40),   /* Keys required for matching       23250000
                                                                 @L1P*/ 23300000
          5    DAEOPT   CHAR(40),   /* Keys which are optional   @L1P*/ 23350000
         4    DAESSACT BDY(WORD,3), /* Actual values used to            23400000
                                       determine if the symptom         23450000
                                       string may be considered         23500000
                                       unique.                   @L1P*/ 23550000
          5    DAESLN   FIXED(15),  /* Actual number of bytes of        23600000
                                       symptom data found        @L1P*/ 23650000
          5    DAESCNT  FIXED(15),  /* Actual count of the number of    23700000
                                       symptoms found            @L1P*/ 23750000
         4    DAESTAT  CHAR(8),     /* Status codes mapped by           23800000
                                       ADYDSTAT                  @L1P*/ 23850000
         4    *        CHAR(6),     /* Reserved for expansion of        23900000
                                       DAESTAT                   @L1P*/ 23950000
         4    DAEORIG  BDY(WORD),   /* Identification of the original   24000000
                                       occurrence of this problem.      24050000
                                                                 @L1P*/ 24100000
          5    DAEERID  CHAR(10) BDY(WORD), /* Errorid           @L1P*/ 24150000
           6    DAEERSEQ FIXED(16) BDY(WORD), /* Errorid sequence       24200000
                                       number                    @L1P*/ 24250000
           6    DAEERCPU FIXED(16) BDY(WORD,3), /* Errorid CPU id       24300000
                                                                 @L1P*/ 24350000
           6    DAEERAS  FIXED(16) BDY(WORD), /* Errorid ASID    @L1P*/ 24400000
           6    DAETIME  FIXED(31) BDY(WORD,3), /* Original time        24450000
                                       (binary number tenths of seconds 24500000
                                       since midnight.)          @L1P*/ 24550000
          5    DAEDATE  CHAR(4),    /* Original date (packed decimal    24600000
                                       julian-00YYDDDF)          @L1P*/ 24650000
          5    DAECPUO  CHAR(6),    /* CPUid from STIDP instruction     24700000
                                                                 @L1P*/ 24750000
          5    DAEFLG   BIT(8),     /* Flags                     @L1P*/ 24800000
           6    DAESVCD  BIT(1),    /* An SVC dump created the          24850000
                                       original documentation    @L1P*/ 24900000
           6    DAESYSMD BIT(1),    /* A SYSMDUMP created the           24950000
                                       original documentation    @L1P*/ 25000000
           6    DAETRUM  BIT(1),    /* Original MVS symptom string      25050000
                                       was truncated             @L1P*/ 25100000
           6    DAERCDA  BIT(1),    /* Entry is recorded because of     25116600
                                       RECORDALL                 @L3A*/ 25133300
         4    DAECURR  BDY(WORD,2), /* Identification of the current    25150000
                                       problem                   @L1P*/ 25200000
          5    DAEDTIM  FIXED(31) BDY(WORD,2), /* Time of current       25250000
                                       problem (binary number, tenths   25300000
                                       of a second since midnight.)     25350000
                                                                 @L1P*/ 25400000
          5    DAEDDAT  CHAR(4) BDY(WORD,2), /* Date of current         25450000
                                       problem (packed decimal          25500000
                                       julian-00YYDDDF)          @L1P*/ 25550000
          5    DAEDCNT  FIXED(15) BDY(WORD,2), /* Number of             25600000
                                       occurrences               @L1P*/ 25650000
         4     DAESNAMO CHAR(8),    /* System Name - ORIGINAL    @L2A*/ 25666600
         4     DAESNAML CHAR(8),    /* System Name - LAST OCCUR  @L2A*/ 25670300
      2 ADSSHDRL BIT(16),          /* Length of ADSSEND          @01A*/ 25674000
      2 ADSSHDRX CHAR(HDRXLEN),    /* Area in which SVC DUMP places     25677700
                                      either the SYSMDUMP or SLIP       25681400
                                      section of the header.  This      25685100
                                      section must be the last data     25688800
                                      item in ADSSRNSD!          @01A*/ 25692500
      2 ADSSEND CHAR(0);           /* End of the header page     @01A*/ 25696200
 @EJECT;                            /*                           @L1P*/ 25700000
                                                                        25750000
     DCL HDRXLEN CONSTANT(MAX(LENGTH(PRDSYSMD),LENGTH(PRDSLIP))+        25754500
                          Length(PRDINTKD) + SDUMPLEN + 3*3); /*        25757500
                                       Size of area added to            25760500
                                       ADSSRNSD into which SDUMP data is25763500
                                       placed.  Size is: larger of      25768000
                                       SYSMDUMP and SLIP areas, plus    25772500
                                       incident token area, plus        25774700
                                       SDUMP area, plus 3 bytes for each25777000
                                       field to allow the data to be on 25781500
                                       word boundries            @P2C*/ 25786000
     DCL SDUMPLEN CONSTANT(184);    /* Length of version 3 SDUMP        25790500
                                       parameter list            @P1A*/ 25795000
    /*****************************************************************/ 25800000
    /*                                                               */ 25850000
    /* Constant values for variable data areas.                      */ 25900000
    /*                                                               */ 25950000
    /*****************************************************************/ 26000000
                                                                        26050000
    DECLARE                         /* Data types                    */ 26100000
      ADSSTPNP BIT(8) CONSTANT('FF'X), /* Data type is not printable    26150000
                                                                 @L1P*/ 26200000
      ADSSTPPR BIT(8) CONSTANT('F0'X); /* Data type is printable @L1P*/ 26250000
    DECLARE                         /* Symptom maximum length        */ 26300000
      SRSYMML  CONSTANT(15);        /*                           @L1P*/ 26350000
