*        %GOTO SRDCPLS1;         /*                                     00012500
         MACRO                                                          00020800
         ADYSRCD                                                        00029100
**/      %SRDCPLS1:;                                                    00037500
*/* START OF SPECIFICATIONS ******************************************* 00066700
**** PROPRIETARY_STATEMENT ******************************************** 00095900
*01* PROPRIETARY STATEMENT=                                             00125100
*                                                                       00154300
*                                                                       00183500
* LICENSED MATERIALS - PROPERTY OF IBM                                  00212700
* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                           00241900
* 5655-068 (C) COPYRIGHT IBM CORP. 1983, 1994                           00271100
* SEE COPYRIGHT INSTRUCTIONS                                            00300300
*                                                                       00329500
* STATUS= HBB5520                                                       00358700
*                                                                       00387900
**** END_OF_PROPRIETARY_STATEMENT ************************************* 00417100
*                                                                       00446300
*01* DESCRIPTIVE NAME: DAE data set record format                       00475500
*02*  ACRONYM: SRCD                                                     00504700
*                                                                       00533900
*01* MACRO NAME: ADYSRCD                                                00563100
*                                                                       00592300
*01* COMPONENT:  DUMP ANALYSIS AND ELIMINATION (SC143)                  00621500
*                                                                       00650700
*01* STORAGE ATTRIBUTES:                                                00679900
*                                                                       00709100
*01* DSECT NAME: SRCD                                                   00738300
*                                                                       00767500
*01* EYE-CATCHER: SRC                                                   00796700
*02*  OFFSET: 0                                                         00825900
*02*  LENGTH: 3                                                         00855100
*                                                                       00884300
*02*  SUBPOOL:   User Supplied                                          00913500
*02*  KEY:       User Supplied                                          00942700
*02*  RESIDENCY: User Supplied                                          00971900
*02*  ALLOCATION METHOD: User Supplied                                  01001100
*02*  FREQUENCY: User Supplied                                          01030300
*01* SIZE: LENGTH(SRCD)                                                 01059500
*                                                                       01088700
*01* CREATED BY: N/A                                                    01117900
*                                                                       01147100
*01* POINTED TO BY: N/A                                                 01176300
*                                                                       01205500
*01* SERIALIZATION:  NONE                                               01234700
*                                                                       01263900
*01* DEPENDENCIES: NONE                                                 01293100
*                                                                       01322300
*01* DISTRIBUTION LIBRARY:  AMODGEN                                     01351500
*                                                                       01380700
*01* EXTERNAL CLASSIFICATION: GUPI                                      01388000
*01* END OF EXTERNAL CLASSIFICATION:                                    01395300
*                                                                       01402600
*01* FUNCTION:                                                          01409900
*02*   Maps one DAE data set record.                                    01439100
*                                                                       01468300
*01* METHOD OF ACCESS:                                                  01497500
*02*  PL/AS:                                                            01526700
*      %INCLUDE SYSLIB(ADYSRCD)                                         01555900
*02*  ASSEMBLER:                                                        01585100
*      LABEL   ADYSRCD                                                  01614300
*                                                                       01643500
*01* CHANGE ACTIVITY:                                                   01672700
*   $MAC(ADYSRCD),COMP(SC143),PROD(DAE): DUMP ANALYSIS & ELIMINATION    01701900
*   FLAG  REASON  RELEASE    DATE  ORIGIN                               01731100
*   $L0=   DAE    JBB2110   821201  PD1W:                               01760300
*   $P1=  PAB0179 JBB2110   821119  PD2X: ADD BIT TO INDICATE    @P1A   01789500
*                                         SYMPTOM STRING WAS     @P1A   01818700
*                                         TRUNCATED              @P1A   01847900
*   $L1=   MSDAE  HBB4430   900911  PDCK: MULTI SYSTEM DAE              01877100
*   $L2=   MSDAE  HBB4430   920429  PDCK: SHOWHDR Format Complete       01906300
*   $L3= SERV2D07 HBB5520   940310  PDHT: TAKEDUMP, RECORDALL, and      01913600
*                                         suppress already captured     01920900
*                                         dumps support            @L3A 01928200
*                                                                       01935500
*** END OF SPECIFICATIONS ********************************************/ 01964700
*        %GOTO SRDCPLS2;          /*                                    02000000
SRCVSNC  EQU  C'SRC1'                  ACRONYM AND VERSION NUMBER TO   X02002500
                                       BE FILLED INTO SRCID WHEN THIS  X02005000
                                       DATAAREA IS CREATED              02007500
         IEZBITS                                                        02010000
SRCD     DSECT                                                          02012500
SRCDID   DS   0CL4                     ACRONYM AND VERSION NUMBER       02015000
SRCSRC   DS   CL3                      ACRONYM 'SRC'                    02017500
SRCVSN   DS   CL1                      VERSION NUMBER                   02020000
SRCUSERA DS   CL6                      EYE-CATCHER='*USER*'             02022500
SRCUSER  DS   CL20                     RESERVED FOR USER                02025000
SRCTEST  DS   CL1                      VALIDITY CHECKING DATA           02027500
SRCORIG  DS   0CL21                    ORIGINAL DUMP DATA               02030000
SRCERRID DS   0CL10                    ORIGINAL ERRORID                 02032500
SRCERSEQ DS   HL2                      ERROR ID SEQUENCE NUMBER         02035000
SRCERCPU DS   HL2                      ERROR ID CPU ID                  02037500
SRCERAS  DS   HL2                      ERROR ID ADDRESS SPACE ID        02040000
SRCTIME  DS   FL4                      ORIGINAL TIME-(BINARY           X02042500
                                       NUMBER TENTHS OF A SECOND       X02045000
                                       SINCE MIDNIGHT.)                 02047500
SRCDATE  DS   CL4                      ORIGINAL DATE (PACKED DECIMAL   X02050000
                                       JULIAN-00YYDDDF)                 02052500
SRCCPU   DS   CL6                      ORIGINAL CPUID-FROM STIDP       X02055000
                                       INSTRUCTION                      02057500
SRCFLG   DS   B                        FLAGS                            02060000
SRCSVCD  EQU  BIT0                     AN SVC DUMP CREATED THE         X02062500
                                       ORIGINAL DOCUMENTATION           02065000
SRCSYSMD EQU  BIT1                     A SYSMDUMP DUMP CREATED THE     X02067500
                                       ORIGINAL DOCUMENTATION           02070000
SRCTRUM  EQU  BIT2                     ORIGINAL SYMPTOM STRING WAS     X02070800
                                       TRUNCATED                  @P1A  02071600
SRCCURR  DS   0CL10                    LAST OCCURRENCE DATA             02072500
SRCDTIME DS   F                        TIME-LAST OCCURRENCE            X02075000
                                       (BINARY NUMBER TENTHS OF A      X02077500
                                       SECOND SINCE MIDNIGHT.)          02080000
SRCDDATE DS   CL4                      DATE LAST OCCURRENCE (PACKED    X02082500
                                       DECIMAL JULIAN-00YYDDDF)         02085000
SRCDCNT  DS   H                        COUNT OF OCCURRENCES             02087500
SRCSYMPA DS   CL6                      EYE-CATCHER='*SYM**'             02090000
SRCSYMP  DS   CL150                    SYMPTOM STRING                   02092500
SRCSNAMO DS   CL8                      SYSTEM NAME - ORIGNAL OCCURRENCEX02093300
                                                                  @L1A  02094100
SRCSNAML DS   CL8                      SYSTEM NAME - LAST OCCURRENCE   X02094900
                                                                  @L1A  02095700
SCRDFLAG DS   CL1                      Flags                       @L3C 02095800
SRCDTKDP EQU  BIT0                     Take the next dump for this      02095900
*                                      incident regardless of any other 02096000
*                                      DAE indications.            @L3A 02096100
SRCDRCDA EQU  BIT1                     This entry is here only because  02096200
*                                      RECORDALL was specified.    @L3A 02096300
SRCSCDUP EQU  BIT2                     This entry represents a dump     02096400
*                                      that was suppressed because a    02096500
*                                      match was found on the captured  02096600
*                                      dump queue - the dump for the    02096700
*                                      original occurence has not been  02096800
*                                      written yet                 @L3A 02096900
SRCIBM   DS   CL20                     RESERVED FOR IBM USE        @L3C 02097000
SRCDEND  DS   0CL1                     End of SRCD Mapping         @L3A 02097100
SRCTESTC EQU  X'FF'                    VALUE FOR FIELD SRCTEST          02097500
         MEND                                                           02100000
**/      %SRDCPLS2:;                                                    02200000
    @EJECT;                                                             02250000
    DCL                                                                 02300000
      SRCVSNC CHAR(4) CONSTANT('SRC1');/* ACRONYM AND VERSION NUMBER TO 02350000
                                       BE FILLED INTO SRCID WHEN THIS   02400000
                                       DATAAREA IS CREATED.          */ 02450000
    DCL                                                                 02500000
      1 SRCD CHAR(255) BDY(WORD) BASED,/*                            */ 02550000
       2 SRCDID CHAR(4),            /* ACRONYM AND VERSION NUMBER    */ 02600000
         4 SRCSRC CHAR(3),          /* ACRONYM 'SRC'                 */ 02650000
         4 SRCVSN CHAR(1),          /* VERSION NUMBER                */ 02700000
 @SPACE(1);                                                             02750000
       2 SRCUSERA CHAR(6),          /* EYE-CATCHER='*USER*'          */ 02850000
       2 SRCUSER CHAR(20),          /* RESERVED FOR USER             */ 02900000
 @SPACE(1);                                                             02950000
       2 SRCTEST CHAR(1),           /* VALIDITY CHECKING DATA        */ 03000000
       2 SRCORIG BDY(WORD,4),       /* ORIGINAL DUMP DATA            */ 03050000
         4 SRCERRID CHAR(10) BDY(WORD,4),    /* ORIGINAL ERRORID  */    03100000
          5 SRCERSEQ FIXED(16) BDY(WORD,4),/* ERROR ID SEQUENCE NUMBER*/03120000
          5 SRCERCPU FIXED(16) BDY(WORD,2),/* ERROR ID CPU ID   */      03140000
          5 SRCERAS  FIXED(16) BDY(WORD,4),/* ERROR ID ADDRESS SPACE    03160000
                                              ID */                     03180000
          5 SRCTIME FIXED(31) BDY(WORD,2),/* ORIGINAL TIME-(BINARY      03200000
                                       NUMBER TENTHS OF A SECOND        03250000
                                       SINCE MIDNIGHT.)              */ 03300000
         4 SRCDATE CHAR(4),         /* ORIGINAL DATE (PACKED DECIMAL    03350000
                                       JULIAN-00YYDDDF)              */ 03400000
         4 SRCCPU CHAR(6),          /* ORIGINAL CPUID-FROM STIDP        03450000
                                       INSTRUCTION                   */ 03500000
         4 SRCFLG BIT(8),           /* FLAGS                         */ 03550000
             8 SRCSVCD BIT(1),      /* AN SVC DUMP CREATED THE          03600000
                                       ORIGINAL DOCUMENTATION        */ 03650000
             8 SRCSYSMD BIT(1),     /* A SYSMDUMP DUMP CREATED THE      03700000
                                       ORIGINAL DOCUMENTATION        */ 03750000
             8 SRCTRUM  BIT(1),     /* ORIGINAL SYMPTOM STRING WAS      03775000
                                       TRUNCATED                 @P1A*/ 03800000
             8 * BIT(5),            /* RESERVED                  @P1C*/ 03825000
 @SPACE(1);                                                             03850000
       2 SRCCURR,                   /* LAST OCCURRENCE DATA          */ 03900000
         4 SRCDTIME FIXED(31),          /* TIME-LAST OCCURRENCE         04050000
                                       (BINARY NUMBER TENTHS OF A       04100000
                                       SECOND SINCE MIDNIGHT.)       */ 04150000
         4 SRCDDATE CHAR(4),        /* DATE LAST OCCURRENCE (PACKED     04166600
                                       DECIMAL JULIAN-00YYDDDF)      */ 04183200
         4 SRCDCNT FIXED(15),          /* COUNT OF OCCURRENCES       */ 04200000
 @SPACE(1);                                                             04250000
       2 SRCSYMPA CHAR(6),          /* EYE-CATCHER='*SYM**'          */ 04300000
       2 SRCSYMP CHAR(150),         /* SYMPTOM STRING                */ 04350000
 @SPACE(1);                                                             04400000
       2 SRCSNAMO CHAR(8),          /* SYSTEM NAME - ORIGNAL            04416600
                                       OCCURRENCE                @L1A*/ 04433200
       2 SRCSNAML CHAR(8),          /* SYSTEM NAME - LAST               04449800
                                       OCCURRENCE                @L1A*/ 04466400
       2 SRCDFLAG BIT(8),           /* Flags                     @L3A*/ 04468500
         4 SRCDTKDP BIT(1),         /* Take the Next Dump for this      04470600
                                       incident regardless of any other 04472700
                                       DAE indications.          @L3A*/ 04474800
         4 SRCDRCDA BIT(1),         /* This entry is here only because  04476900
                                       RECORDALL was specified.  @L3A*/ 04479000
         4 SRCSCDUP BIT(1),         /* This entry represents a dump     04481100
                                       that was suppressed because a    04483200
                                       match was found on the captured  04485300
                                       dump queue - the dump for the    04487400
                                       original occurence has not been  04489500
                                       written yet               @L3A*/ 04491600
         4 *        BIT(5),         /* Reserved                  @L3A*/ 04493700
       2 SRCIBM CHAR(20),           /* RESERVED FOR IBM USE      @L3C*/ 04495800
       2 SRCDEND CHAR(0);           /* End of SRCD mapping       @L3C*/ 04497900
 DCL                                                                    04500000
     SRCUSERC CHAR(6) CONSTANT('*USER*'),/* VALUE FOR THE SRCUSERA FIELD04550000
                                                                     */ 04600000
     SRCSYMPC CHAR(6) CONSTANT('*SYM**');/* VALUE FOR THE SRCSYMPA      04650000
                                             FIELD                   */ 04700000
 DCL SRCTESTC BIT(8) CONSTANT('FF'X); /* VALUE FOR FIELD SRCTEST    */  04750000
