*%GOTO UDT000;                      /* Bilingual mapping of UDT         00001001
       MACRO                                                            00002001
         CBDZUDT  &UDT=,&UIM=,&LANG=,&DESC=,                           *00003001
               &UNIT=,&FORMAT=,&FEAT=,&CFEAT=,&PARA=,&TEXT=,&MID=,     *00004001
               &HELP=,&ID=,&DEVICE=,&MODEL=,                           *00005001
               &TYPE=,&DONLINE=,&PARATYPE=,                        @L6C*00006001
               &SYSTEM=MVS,                                        @LDA*00007001
               &DUMMY=DUMMY                                        @LDC 00008001
.*                                                                      00009001
.*                                                                      00010001
.*             Globals Definitions                                      00011001
.*                                                                      00012001
         GBLA  &COMPC                  Count of compatible features     00013001
         GBLA  &FEATC                  Count of feature descriptions    00014001
         GBLA  &FNUM                   Count of feature slots      @LDA 00015001
         GBLA  &PARAC                  Count of parameter descriptions  00016001
         GBLA  &UNITC                  Count of unit descriptions       00017001
         GBLA  &MSGC                   Count of messages                00018001
         GBLA  &DEVC                   Count of help panel overwrite   *00019001
                                       table entries                    00020001
         GBLB  &FIRST                  First time through switch        00021001
         GBLB  &USW                    UNIT parameter processed         00022001
         GBLB  &FSW                    FEAT parameter processed         00023001
         GBLB  &VFSW                   VM FEAT parameter processed @LDA 00024001
         GBLB  &MFSW                   MVS FEAT parameter processed@LDA 00025001
         GBLB  &CSW                    CFEAT parameter processed        00026001
         GBLB  &MSW                    MID parameter processed          00027001
         GBLB  &PSW                    PARA parameter processed         00028001
         GBLB  &VPSW                   VM PARA parameter processed @LDA 00029001
         GBLB  &MPSW                   MVS PARA parameter processed@LDA 00030001
         GBLB  &DSW                    Device parameter processed       00031001
         GBLB  &MVS                    MVS section build indicator @LDA 00032001
         GBLB  &VM                     VM section build indicator  @LDA 00033001
         GBLC  &CUR                    Current generation type          00034001
.*                                                                      00035001
         AGO   .L000                   Skip prolog                      00036001
.*                                     End of long PLAS comment      */ 00037001
*%UDT000: ;                                                             00038001
*/********************************************************************/ 00039001
*/*                                                                  */ 00040001
*/*  ACRONYM:  CBDZUDT                                               */ 00040300
*/*  EXTERNAL CLASSIFICATION:  PSPI                                  */ 00040600
*/*  END OF EXTERNAL CLASSIFICATION                                  */ 00040900
*/*  MACRO NAME:  CBDZUDT                                            */ 00041200
*/*  DSECT NAME:  UDT                                                */ 00041500
*/*                                                                  */ 00042001
*/*  PROPRIETARY STATEMENT =                                         */ 00043001
*/*                                                                  */ 00044001
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00045001
*/*     THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                  */ 00046001
*/*     5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                  */ 00047003
*/*                                                                  */ 00049001
*/*  STATUS = HCS6091                                                */ 00050003
*/*                                                                  */ 00051001
*/*  FUNCTION = Maps the UIM Data Table                              */ 00052001
*/*                                                                  */ 00053001
*/*  MODULE TYPE = Mapping macro and UDT generation macro            */ 00054001
*/*                                                                  */ 00055001
*/*  DEPENDENCIES = None                                             */ 00056001
*/*                                                                  */ 00057001
*/*  RESTRICTIONS = None                                             */ 00058001
*/*                                                                  */ 00059001
*/*  PROCESSOR = PL/AS Compiler                                      */ 00060001
*/*                                                                  */ 00061001
*/*  INVOCATION = %DCL UDTDEF CHAR                                   */ 00062001
*/*               %UDTDEF='value'                                    */ 00063001
*/*                   value = 'BASED' or 'BASED(xxxxxxxx)'           */ 00064001
*/*               %INCLUDE SYSLIB(CBDZUDT)                           */ 00065001
*/*                                                                  */ 00066001
*/*               If UDTDEF is not declared and initialized, the     */ 00067001
*/*               default is 'BASED'.                                */ 00068001
*/*                                                                  */ 00069001
*/*  CHANGE ACTIVITY =                                               */ 00070001
*/*                                                                  */ 00071001
*/*  $L0=HCD     HCSH101 900425 BOEB: Hardware Configuration Dialog  */ 00071801
*/*  $L6=HCD     HCSH101 900525 BOEB: UIM private parameters         */ 00072601
*/*  $LD=HCD     HCSH301 910422 BOEB: VM Device Support              */ 00073401
*/*  $N6=UCBVSCR HCSH521 940119 BOEB: UCB VSCR Support               */ 00074201
*/*                                                                  */ 00075001
*/********************************************************************/ 00076001
*%GOTO UDT001;                         /* begin of very long comment    00077001
.*                                                                      00078001
.L000    ANOP                          Skip prolog if already done      00079001
.*                                                                      00080001
.*             Local Definitions                                        00081001
.*                                                                      00082001
         LCLA  &WL                     Used as loop count               00083001
         LCLA  &I                      Loop count for checking          00084001
         LCLA  &ALN                    Alignment length                 00085001
         LCLA  &SUB                    Sublist index value              00086001
         LCLA  &PID                    Parameter identifier             00087001
         LCLA  &PLEN                   Parameter length            @L6A 00088001
         LCLA  &PTYPE                  Parameter type              @L6A 00089001
         LCLA  &LIST                   LIST value of PARATYPE      @LDA 00090001
         LCLA  &RNGMIN                 Range min value of PARATYPE @LDA 00091001
         LCLA  &RNGMAX                 Range max value of PARATYPE @LDA 00092001
         LCLA  &PNDX                   Subparameter index          @LDA 00093001
         LCLA  &PNDX1                  Subparameter index          @LDA 00094001
         LCLA  &FLAGS                  Parameter/feature flags     @L6A 00095001
         LCLA  &DYN                    DONLINE=YES specified       @L6A 00096001
         LCLA  &LISTF                  LIST specified in PARATYPE  @LDA 00097001
         LCLA  &RNGF                   RANGE specified in PARATYPE @LDA 00098001
         LCLA  &MAXVAL                 Maximum value of operand         00099001
         LCLA  &MINVAL                 Minimum value of operand         00100001
         LCLA  &PLMIN(8)               Min parameter value length  @L6A 00101001
         LCLA  &PLMAX(8)               Max parameter value length  @L6A 00102001
         LCLA  &PLDFT(8)               Default parameter value len @L6A 00103001
         LCLA  &ML                     Maximum length of item           00104001
         LCLA  &DESCL                  UIM description length           00105001
         LCLA  &MTL                    Maximum text length              00106001
         LCLA  &TL                     Actual text length               00107001
         LCLA  &TE                     Number of text elements          00108001
         LCLA  &HOT                    Help overwrite type              00109001
         LCLB  &DBCS                   DBCS switch  (FORMAT=DBCS)       00110001
         LCLB  &ABORT                  Error indicator                  00111001
         LCLC  &TTAB(255)              Array of text sublist entries    00112001
         LCLC  &UDTN                   Name of UDT                      00113001
         LCLC  &UIMN                   Name of associated UIM           00114001
         LCLC  &LANGN                  Language name                    00115001
         LCLC  &HELPN                  Help member name                 00116001
         LCLC  &FEATN                  Feature specified by user        00117001
         LCLC  &PARAN                  Parameter name              @L6A 00118001
         LCLC  &P                      Parameter name                   00119001
         LCLC  &PP                     Parameter being processed        00120001
         LCLC  &CHAR1                  Alphabetic Charcater Table       00121001
         LCLC  &CHAR2                  Alphameric Character Table       00122001
.*         VM Parameter Definitions                                @LDA 00123001
         LCLA  &PVADP                  ADAPTER parameter           @LDA 00124001
         LCLA  &PVAFP                  AFP     parameter           @LDA 00125001
         LCLA  &PVBAD                  BASEADD parameter           @LDA 00126001
         LCLA  &PVCHR                  CHARS   parameter           @LDA 00127001
         LCLA  &PVCLS                  CLASS   parameter           @LDA 00128001
         LCLA  &PVCPN                  CPNAME  parameter           @LDA 00129001
         LCLA  &PVDST                  DEST    parameter           @LDA 00130001
         LCLA  &PVDPM                  DPMSIZE parameter           @LDA 00131001
         LCLA  &PVFCB                  FCB     parameter           @LDA 00132001
         LCLA  &PVFLH                  FLASH   parameter           @LDA 00133001
         LCLA  &PVFLD                  FOLD    parameter           @LDA 00134001
         LCLA  &PVFRM                  FORMS   parameter           @LDA 00135001
         LCLA  &PVIMG                  IMAGE   parameter           @LDA 00136001
         LCLA  &PVIND                  INDEX   parameter           @LDA 00137001
         LCLA  &PVMOD                  MODEL   parameter           @LDA 00138001
         LCLA  &PVOFF                  OFFLINE parameter           @LDA 00139001
         LCLA  &PVSEP                  SEP     parameter           @LDA 00140001
         LCLA  &PVSET                  SETADDR parameter           @LDA 00141001
         LCLA  &PVSHR                  SHARED  parameter           @LDA 00142001
         LCLA  &PVUIR                  UIRATE  parameter           @LDA 00143001
.*         VM Feature Definitions                                  @LDA 00144001
         LCLA  &PFEATN                 Number of defined features  @LDA 00145001
         LCLA  &PFCONV                 CONV     feature            @LDA 00146001
         LCLA  &PFDUAL                 DUALDENS feature            @LDA 00147001
         LCLA  &PFEMUL                 EMUL3270 feature            @LDA 00148001
         LCLA  &PFEHLD                 E3270HLD feature            @LDA 00149001
         LCLA  &PFOPRD                 OPRDR    feature            @LDA 00150001
         LCLA  &PFTRNS                 TRANS    feature            @LDA 00151001
         LCLA  &PFUNVS                 UNVCHSET feature            @LDA 00152001
         LCLA  &PF4WCG                 4WCGMS   feature            @LDA 00153001
         LCLA  &PF7TRK                 7-TRACK  feature            @LDA 00154001
         LCLA  &PFDPS                  DPS      feature            @LDA 00154301
         LCLA  &PFRES                  RESERVE  feature            @LDA 00154601
.*                                                                      00155001
.*                                                                      00156001
.* *******************************************************************  00157001
.*                                                                   *  00158001
.*       NOTE: TO MAKE PLAS MACRO EXPANSION SUCCESSFUL FOLLOW THE    *  00159001
.*       =====  LISTED RULES IN THE ASSEMBLER PART OF THE MACRO:     *  00160001
.*             1- AVOID UNMATCHED APOSTROPHES!                       *  00161001
.*             2- AVOID UNMATCHED PLS COMMENT DELIMETERS!            *  00162001
.*             3- AVOID USE OF 'PERCENT SIGN' AND 'QUESTION MARK'!   *  00163001
.*                                                                   *  00164001
.* *******************************************************************  00165001
.*                                                                      00166001
.*                                                                      00167001
&CHAR1   SETC  'ABCDEFGHIJKLMNOPQRSTUVWXYZ@#$'   ALPHABETIC CHARACTERS  00168001
&CHAR2   SETC  'ABCDEFGHIJKLMNOPQRSTUVWXYZ@#$0123456789'  ALPHAMERIC    00169001
.*                                                                      00170001
&DYN     SETA  128                 DONLINE=YES specified           @L6A 00171001
&LISTF   SETA    8                 LIST subparameter specified     @LDA 00172001
&RNGF    SETA    4                 RANGE subparameter specified    @LDA 00173001
.*                                                                      00174001
&PLMIN(1) SETA 1                   Min value length for CHAR type  @L6A 00175001
&PLMAX(1) SETA 8                   Max value length for CHAR type  @L6A 00176001
&PLDFT(1) SETA 8                   Default value length for CHAR   @L6A 00177001
&PLMIN(2) SETA 1                   Min value length for NUM  type  @L6A 00178001
&PLMAX(2) SETA 8                   Max value length for NUM  type  @L6A 00179001
&PLDFT(2) SETA 8                   Default value length for NUM    @L6A 00180001
&PLMIN(3) SETA 2                   Min value length for HEX  type  @L6A 00181001
&PLMAX(3) SETA 8                   Max value length for HEX  type  @L6A 00182001
&PLDFT(3) SETA 8                   Default value length for HEX    @L6A 00183001
&PLMIN(4) SETA 1                   Min value length for ALPHA type @L6A 00184001
&PLMAX(4) SETA 8                   Max value length for ALPHA type @L6A 00185001
&PLDFT(4) SETA 8                   Default value length for ALPHA  @L6A 00186001
&PLMIN(5) SETA 1                   Min value length for ALPHA* type@L6A 00187001
&PLMAX(5) SETA 8                   Max value length for ALPHA* type@L6A 00188001
&PLDFT(5) SETA 8                   Default value length for ALPHA* @L6A 00189001
&PLMIN(6) SETA 0                   Min value length for YESNO type @L6A 00190001
&PLMAX(6) SETA 0                   Max value length for YESNO type @L6A 00191001
&PLDFT(6) SETA 5                   Default value length for YESNO  @L6A 00192001
&PLMIN(7) SETA 1                   Min value length for NAME  type @LDA 00193001
&PLMAX(7) SETA 8                   Max value length for NAME  type @LDA 00194001
&PLDFT(7) SETA 8                   Default value length for NAME   @LDA 00195001
&PLMIN(8) SETA 1                   Min value length for NAME* type @LDA 00196001
&PLMAX(8) SETA 8                   Max value length for NAME* type @LDA 00197001
&PLDFT(8) SETA 8                   Default value length for NAME*  @LDA 00198001
.*                                                                      00199001
.*         VM Parameter Definitions                                @LDA 00200001
&PVADP   SETA  1                       ADAPTER parameter           @LDA 00201001
&PVAFP   SETA  2                       AFP     parameter           @LDA 00202001
&PVBAD   SETA  3                       BASEADD parameter           @LDA 00203001
&PVCHR   SETA  4                       CHARS   parameter           @LDA 00204001
&PVCLS   SETA  5                       CLASS   parameter           @LDA 00205001
&PVCPN   SETA  6                       CPNAME  parameter           @LDA 00206001
&PVDST   SETA  7                       DEST    parameter           @LDA 00207001
&PVDPM   SETA  8                       DPMSIZE parameter           @LDA 00208001
&PVFCB   SETA  9                       FCB     parameter           @LDA 00209001
&PVFLH   SETA  10                      FLASH   parameter           @LDA 00210001
&PVFLD   SETA  11                      FOLD    parameter           @LDA 00211001
&PVFRM   SETA  12                      FORMS   parameter           @LDA 00212001
&PVIMG   SETA  13                      IMAGE   parameter           @LDA 00213001
&PVIND   SETA  14                      INDEX   parameter           @LDA 00214001
&PVMOD   SETA  15                      MODEL   parameter           @LDA 00215001
&PVOFF   SETA  16                      OFFLINE parameter           @LDA 00216001
&PVSEP   SETA  17                      SEP     parameter           @LDA 00217001
&PVSET   SETA  18                      SETADDR parameter           @LDA 00218001
&PVSHR   SETA  19                      SHARED  parameter           @LDA 00219001
&PVUIR   SETA  20                      UIRATE  parameter           @LDA 00220001
.*         VM Feature Definitions                                  @LDA 00221001
&PFEATN  SETA  11                      Number of defined features  @LDA 00222001
&PFCONV  SETA  1                       CONV     feature            @LDA 00223001
&PFDUAL  SETA  2                       DUALDENS feature            @LDA 00224001
&PFEMUL  SETA  3                       EMUL3270 feature            @LDA 00225001
&PFEHLD  SETA  4                       E3270HLD feature            @LDA 00226001
&PFOPRD  SETA  5                       OPRDR    feature            @LDA 00227001
&PFTRNS  SETA  6                       TRANS    feature            @LDA 00228001
&PFUNVS  SETA  7                       UNVCHSET feature            @LDA 00229001
&PF4WCG  SETA  8                       4WCGMS   feature            @LDA 00230001
&PF7TRK  SETA  9                       7-TRACK  feature            @LDA 00231001
&PFDPS   SETA  10                      DPS      feature            @LDA 00231301
&PFRES   SETA  11                      RESERVE  feature            @LDA 00231601
.*                                                                      00232001
.********************************************************************** 00233001
.*             Check for positional operands                          * 00234001
.********************************************************************** 00235001
.L010    ANOP                                                           00236001
         AIF   (N'&SYSLIST EQ 0).L050                                   00237001
         SPACE 2                                                        00238001
         MNOTE 8,'POSITIONAL OPERANDS NOT ALLOWED - MACRO IGNORED.'     00239001
         SPACE 2                                                        00240001
         MEXIT                                                          00241001
.*                                                                      00242001
.********************************************************************** 00243001
.*             handle parameters disallowed on first macro call       * 00244001
.********************************************************************** 00245001
.*                                                                      00246001
.*       The following parameters are not allowed on the first macro    00247001
.*       call. If specified, they will be ignored                       00248001
.*             -  PARA                                                  00249001
.*             -  FEAT and CFEAT                                        00250001
.*             -  MID                                                   00251001
.*             -  HELP                                                  00252001
.*             -  UNIT                                                  00253001
.*             -  TEXT and FORMAT                                       00254001
.*             -  DEVICE and MODEL                                      00255001
.*             -  ID                                                    00256001
.*             -  TYPE                                                  00257001
.*             -  PARATYPE                                         @L6A 00258001
.*             -  DONLINE                                          @L6A 00259001
.*                                                                      00260001
.L050    ANOP                                                           00261001
         AIF   (&FIRST).L200       Branch if not first time through     00262001
         AIF   ('&FEAT' EQ '').L055    Branch if not specified          00263001
         MNOTE 4,'FEAT PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00264001
               D'                                                       00265001
.L055    ANOP                                                           00266001
         AIF   ('&CFEAT' EQ '').L060    Branch if not specified         00267001
         MNOTE 4,'CFEAT PARAMETER NOT VALID ON FIRST MACRO CALL - IGNOR*00268001
               ED'                                                      00269001
.L060    ANOP                                                           00270001
         AIF   ('&PARA' EQ '').L065    Branch if not specified          00271001
         MNOTE 4,'PARA PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00272001
               D'                                                       00273001
.L065    ANOP                                                           00274001
         AIF   ('&UNIT' EQ '').L070    Branch if not specified          00275001
         MNOTE 4,'UNIT PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00276001
               D'                                                       00277001
.L070    ANOP                                                           00278001
         AIF   ('&TEXT' EQ '').L075    Branch if not specified          00279001
         MNOTE 4,'TEXT PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00280001
               D'                                                       00281001
.L075    ANOP                                                           00282001
         AIF   ('&MID' EQ '').L080    Branch if not specified           00283001
        MNOTE 4,'MID PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORED' 00284001
.L080    ANOP                                                           00285001
         AIF   ('&FORMAT' EQ '').L085    Branch if not specified        00286001
         MNOTE 4,'FORMAT PARAMETER NOT VALID ON FIRST MACRO CALL - IGNO*00287001
               RED'                                                     00288001
.L085    ANOP                                                           00289001
         AIF   ('&HELP' EQ '').L090      Branch if not specified        00290001
         MNOTE 4,'HELP PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00291001
               D'                                                       00292001
.L090    ANOP                                                           00293001
         AIF   ('&ID' EQ '').L095     Branch if not specified           00294001
         MNOTE 4,'ID PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORED' 00295001
.L095    ANOP                                                           00296001
         AIF   ('&DEVICE' EQ '').L100    Branch if not specified        00297001
         MNOTE 4,'DEVICE PARAMETER NOT VALID ON FIRST MACRO CALL - IGNO*00298001
               RED'                                                     00299001
.L100    ANOP                                                           00300001
         AIF   ('&MODEL' EQ '').L105    Branch if not specified         00301001
         MNOTE 4,'MODEL PARAMETER NOT VALID ON FIRST MACRO CALL - IGNOR*00302001
               ED'                                                      00303001
.L105    ANOP                                                           00304001
         AIF   ('&TYPE' EQ '').L110    Branch if not specified          00305001
         MNOTE 4,'TYPE PARAMETER NOT VALID ON FIRST MACRO CALL - IGNORE*00306001
               D'                                                       00307001
.L110    ANOP                                                           00308001
         AIF   ('&PARATYPE' EQ '').L115    Branch if not specified @L6A 00309001
         MNOTE 4,'PARATYPE PARAMETER NOT VALID ON FIRST MACRO CALL - IG*00310001
               NORED'                                              @L6A 00311001
.L115    ANOP                                                      @L6A 00312001
         AIF   ('&DONLINE' EQ '').L120    Branch if not specified  @L6A 00313001
         MNOTE 4,'DONLINE PARAMETER NOT VALID ON FIRST MACRO CALL - IGN*00314001
               ORED'                                               @L6A 00315001
.L120    ANOP                                                      @L6A 00316001
.*                                                                      00317001
.********************************************************************** 00318001
.*             handle UDT= Parameter                                  * 00319001
.********************************************************************** 00320001
.UDT00   ANOP                                                           00321001
&ML      SETA  8                       Set maximum length               00322001
         AIF   ('&UDT' EQ '').UDTER1   If omitted, report error         00323001
         AIF   (K'&UDT GT &ML).UDTER3  If greater 8, report error       00324001
.*                                                                      00325001
         AIF   ('&UDT'(1,3) NE 'CBD').UDTER2  if not 'CBD' --> error    00326001
         AIF   (('&UDT'(5,1) NE 'C') AND ('&UDT'(5,1) NE 'S')).UDTER2   00327001
.*                                                                      00328001
&I       SETA  6                   Start checking with 6th character    00329001
.UDT20   ANOP                                                           00330001
         AIF   ('&UDT'(&I,1) LT '0').UDTER2   Check if numeric          00331001
         AIF   ('&UDT'(&I,1) GT '9').UDTER2   0 - 9                     00332001
&I       SETA  &I+1                Check next character of UDT name     00333001
         AIF   (&I LE K'&UDT).UDT20  Continue checking  continue        00334001
&UDTN    SETC  '&UDT'              Save UDT name                        00335001
         AGO   .UDTXT              And continue                         00336001
.*                                                                      00337001
.UDTER1  ANOP                                                           00338001
&ABORT   SETB  1                       Indicate that an error occurred  00339001
         MNOTE 8,'UDT SPECIFICATION REQUIRED ON FIRST MACRO CALL'       00340001
         AGO   .UDTXT                  and continue                     00341001
.*                                                                      00342001
.UDTER2  ANOP                                                           00343001
&ABORT   SETB  1                       Indicate that an error occurred  00344001
         MNOTE 8,'INVALID UDT SPECIFICATION'                            00345001
         AGO   .UDTXT                  and continue                     00346001
.*                                                                      00347001
.UDTER3  ANOP                                                           00348001
&ABORT   SETB  1                       Indicate that an error occurred  00349001
         MNOTE 8,'UDT PARAMETER EXCEEDS &ML CHARACTERS'                 00350001
.*                                                                      00351001
.UDTXT   ANOP                                                           00352001
.*                                                                      00353001
.********************************************************************** 00354001
.*             handle UIM= Parameter                                  * 00355001
.********************************************************************** 00356001
.UIM00   ANOP                                                           00357001
&ML      SETA  8                       Set maximum length               00358001
         AIF   ('&UIM' EQ '').UIMER1   If omitted, report error         00359001
         AIF   (K'&UIM GT &ML).UIMER3  If greater 8, report error       00360001
.*                                                                      00361001
         AIF   ('&UIM'(1,4) NE 'CBDU').UIMER2  if not 'CBDU' --> error  00362001
         AIF   (('&UIM'(5,1) NE 'C') AND ('&UIM'(5,1) NE 'S')).UIMER2   00363001
&I       SETA  6                   Start checking with 6th character    00364001
.UIM20   ANOP                                                           00365001
         AIF   ('&UIM'(&I,1) LT '0').UIMER2   Check if numeric          00366001
         AIF   ('&UIM'(&I,1) GT '9').UIMER2   0 - 9                     00367001
&I       SETA  &I+1                Check next character of UIM name     00368001
         AIF   (&I LE K'&UIM).UIM20  Continue checking  continue        00369001
&UIMN    SETC  '&UIM'                  Save name of UIM                 00370001
         AGO   .UIMXT                  And contine checking             00371001
.*                                                                      00372001
.UIMER1  ANOP                                                           00373001
&ABORT   SETB  1                       Indicate that an error occurred  00374001
         MNOTE 8,'UIM SPECIFICATION REQUIRED ON FIRST MACRO CALL'       00375001
         AGO   .UIMXT                                                   00376001
.*                                                                      00377001
.UIMER2  ANOP                                                           00378001
&ABORT   SETB  1                       Indicate that an error occurred  00379001
         MNOTE 8,'INVALID UIM SPECIFICATION'                            00380001
         AGO   .UIMXT                                                   00381001
.*                                                                      00382001
.UIMER3  ANOP                                                           00383001
&ABORT   SETB  1                       Indicate that an error occurred  00384001
         MNOTE 8,'UIM PARAMETER EXCEEDS &ML CHARACTERS'                 00385001
.*                                                                      00386001
.UIMXT   ANOP                                                           00387001
.*                                                                      00388001
.********************************************************************** 00389001
.*             handle DESC= Parameter                                 * 00390001
.********************************************************************** 00391001
.DESC00  ANOP                                                           00392001
&ML      SETA  60                      Set maximum length               00393001
         AIF   ('&DESC' EQ '').DESCER1   If omitted, report error       00394001
         AIF   (K'&DESC GT &ML).DESCER2  If greater 60, report error    00395001
         AIF   ('&DESC'(1,1) NE '''').DESC50  Hex notation ?            00396001
         AIF   (K'&DESC LE 2).DESCER3  Parameter too short ?            00397001
&DESCL   SETA  K'&DESC-2               Minus 2 for quotes               00398001
         AGO   .DESCXT                 and continue                     00399001
.*                                                                      00400001
.DESC50  ANOP                          handle hex notation              00401001
         AIF   ('&DESC'(1,2) NE 'X''').DESCER4                          00402001
         AIF   (K'&DESC LE 3).DESCER3  Parameter too short ?            00403001
&DESCL   SETA  (K'&DESC-3)/2           Minus 3 for X'---'               00404001
         AGO   .DESCXT                 and continue                     00405001
.*                                                                      00406001
.DESCER1 ANOP                                                           00407001
&ABORT   SETB  1                       Indicate that an error occurred  00408001
         MNOTE 8,'DESC SPECIFICATION REQUIRED ON FIRST MACRO CALL'      00409001
         AGO   .DESCXT                                                  00410001
.*                                                                      00411001
.DESCER2 ANOP                                                           00412001
&ABORT   SETB  1                       Indicate that an error occurred  00413001
         MNOTE 8,'DESC PARAMETER EXCEEDS &ML CHARACTERS'                00414001
         AGO   .DESCXT                                                  00415001
.*                                                                      00416001
.DESCER3 ANOP                                                           00417001
&ABORT   SETB  1                       Indicate that an error occurred  00418001
         MNOTE 8,'DESC PARAMETER IS TOO SHORT'                          00419001
         AGO   .DESCXT                 and branch to continue           00420001
.*                                                                      00421001
.DESCER4 ANOP                                                           00422001
&ABORT   SETB  1                       Indicate that an error occurred  00423001
         MNOTE 8,'DESC PARAMETER DOES NOT START WITH X'' NOR ''.'       00424001
.*                                                                      00425001
.DESCXT  ANOP                                                           00426001
.*                                                                      00427001
.********************************************************************** 00428001
.*             handle LANG= Parameter                                 * 00429001
.********************************************************************** 00430001
.LANG00  ANOP                                                           00431001
&ML      SETA  20                      Set maximum length               00432001
&LANGN   SETC  'ENGLISH'           Set up default language code         00433001
         AIF   ('&LANG' EQ '').LANGXT   Branch if omitted               00434001
         AIF   (K'&LANG GT &ML).LANGER1  If greater 20, report error    00435001
&LANGN   SETC  '&LANG'                 Save user specified language     00436001
         AGO   .LANGXT                 And contine checking             00437001
.*                                                                      00438001
.LANGER1 ANOP                                                           00439001
         MNOTE 8,'LANG PARAMETER EXCEEDS &ML CHARACTERS'                00440001
.*                                                                      00441001
.LANGXT  ANOP                                                           00442001
.*                                                                      00443001
.********************************************************************** 00444001
.*             Generate Unit Data Table Header                        * 00445001
.********************************************************************** 00446001
.*                                                                      00447001
         AIF   (&ABORT).DONE           Go and exit macro if error       00448001
&FIRST   SETB  1                       Set first time through switch    00449001
.*                                                                      00450001
.*                                                                      00451001
         TITLE '&UDTN - &LANGN Unit Data Table for UIM &UIMN'           00452001
*********************************************************************** 00453001
*                                                                     * 00454001
*              UIM Data Table (UDT)                                   * 00455001
*                                                                     * 00456001
*********************************************************************** 00457001
         SPACE 2                                                        00458001
&UDTN    CSECT ,                                                        00459001
&UDTN    AMODE 31                                                       00460001
&UDTN    RMODE ANY                                                      00461001
         SPACE 1                                                        00462001
UDDID    DC    CL4'UDT '               UIM Data Table identifier        00463001
UDDVER   DC    AL1(2)                  UDT version number          @LDC 00464001
         DC    XL3'00'                 Reserved                         00465001
UDDCSECT DC    CL8'&UDTN'              Name of UDT (CSECT name)         00466001
UDDDATE  DC    CL8'&SYSDATE'           Date of assembly (dd/mm/yy)      00467001
UDDUDESC DC    F'0'                    Count of unit descriptions in    00468001
*                                      list                             00469001
UDDUDESP DC    A(0)                    Pointer to list of descriptions  00470001
*                                      of units supported by            00471001
*                                      associated UIM                   00472001
UDDPARMC DC    F'0'                    Count of parameter descriptions  00472101
*                                      in list                    @LDA  00472201
UDDPARMP DC    A(0)                    Pointer to list of descriptions  00472301
*                                      of parameters for devices        00472401
*                                      supported by the associated      00472501
*                                      UIM                        @LDA  00472601
UDDFEATC DC    F'0'                    Count of feature descriptions    00472701
*                                      in list                    @LDA  00472801
UDDFEATP DC    A(0)                    Pointer to list of feature       00472901
*                                      names and descriptions for       00473001
*                                      devices supported by the         00473101
*                                      associated UIM             @LDA  00473201
UDDCOMPC DC    F'0'                    Count of features recognized     00473301
*                                      for compatibility reasons  @LDA  00473401
UDDCOMPP DC    A(0)                    Optional pointer to 10 byte      00473501
*                                      feature names recognized by      00473601
*                                      this UIM for migration           00473701
*                                      compatibility              @LDA  00473801
UDDMSGC  DC    F'0'                    Count of messages issued by      00473901
*                                      associated UIM                   00474001
UDDMSGP  DC    A(0)                    Pointer to messages issued by    00475001
*                                      associated UIM                   00476001
UDDDDESP DC    A(UDDDDES)              Pointer to UIM description       00477001
UDDHPOC  DC    F'0'                    Count of elements in help panel  00477601
*                                      overwrite table            @LDA  00478201
UDDHPOP  DC    A(0)                    Pointer to help panel overwrite  00478801
*                                      table associated with UIM  @LDA  00479401
         DC    CL52'00'                Reserved                   @LDA  00480001
UDDLENG  EQU   *-UDDID                 Length of UDT header             00481001
         SPACE 2                                                        00482001
*********************************************************************** 00483001
*                                                                     * 00484001
*              UIM Description                                        * 00485001
*                                                                     * 00486001
*********************************************************************** 00487001
         SPACE 1                                                        00488001
UDDDDES  DS    0H                      UIM description                  00489001
         DC    CL8'&UIMN'              Name of UIM                      00490001
         DC    AL1(&DESCL)             Length of UIM description        00491001
         AIF   ('&DESC'(1,2) EQ 'X''').L150    hex notation             00492001
         DC    C&DESC                  UIM description                  00493001
         AGO   .L155                   and continue                     00494001
.L150    ANOP                                                           00495001
         DC    &DESC                   UIM description                  00496001
.L155    ANOP                                                           00497001
         SPACE 4                                                        00498001
.*                                                                      00499001
         AGO   .DONE                   go to exit macro                 00500001
.*                                                                      00501001
.*                                                                      00502001
.********************************************************************** 00503001
.*             handle disallowed parameters                           * 00504001
.********************************************************************** 00505001
.*                                                                      00506001
.*       The following parameters are only allowed on the first macro   00507001
.*       call, but disallowed on any subsequent macro calls             00508001
.*             -  UDT                                                   00509001
.*             -  UIM                                                   00510001
.*             -  LANG                                                  00511001
.*             -  DESC                                                  00512001
.*                                                                      00513001
.L200    ANOP                                                           00514001
         AIF   ('&UDT' EQ '').L210    Branch if not specified           00515001
         MNOTE 4,'UDT PARAMETER ONLY VALID ON FIRST MACRO CALL - IGNORE*00516001
               D'                                                       00517001
.L210    ANOP                                                           00518001
         AIF   ('&UIM' EQ '').L220    Branch if not specified           00519001
         MNOTE 4,'UIM PARAMETER ONLY VALID ON FIRST MACRO CALL - IGNORE*00520001
               D'                                                       00521001
.L220    ANOP                                                           00522001
         AIF   ('&LANG' EQ '').L230    Branch if not specified          00523001
         MNOTE 4,'LANG PARAMETER ONLY VALID ON FIRST MACRO CALL - IGNOR*00524001
               ED'                                                      00525001
.L230    ANOP                                                           00526001
         AIF   ('&DESC' EQ '').L240    Branch if not specified          00527001
         MNOTE 4,'DESC PARAMETER ONLY VALID ON FIRST MACRO CALL - IGNOR*00528001
               ED'                                                      00529001
.L240    ANOP                                                           00530001
.*                                                                      00531001
.********************************************************************** 00532001
.*             handle TEXT=   Parameter                               * 00533001
.********************************************************************** 00534001
.TEXT00  ANOP                                                           00535001
&TE      SETA  0                       Set number of text elements = 0  00536001
&TL      SETA  0                       Set text length = 0              00537001
         AIF   ('&TEXT' EQ '').TEXTXT  Branch if not specified          00538001
&SUB     SETA  1                       Initialize sublist index         00539001
.*                                                                      00540001
.*       Loop to validate each sublist entry                            00541001
.*                                                                      00542001
.TEXT10  ANOP                          Begin of loop                    00543001
         AIF   ('&TEXT(&SUB)' EQ '').TEXTER1  Null sublist entry ?      00544001
         AIF   ('&TEXT(&SUB)'(1,1) NE '''').TEXT50  Hex notation ?      00545001
         AIF   (K'&TEXT(&SUB) LE 2).TEXTER2  Sublist entry too short ?  00546001
&TL      SETA  &TL+K'&TEXT(&SUB)-2     Minus 2 for quotes               00547001
&TE      SETA  &SUB                    Set Text array index             00548001
&TTAB(&SUB) SETC  '&TEXT(&SUB)'        Save text element in text array  00549001
         AGO   .TEXT80                 and continue                     00550001
.*                                                                      00551001
.TEXT50  ANOP                          handle hex notation              00552001
         AIF   ('&TEXT(&SUB)'(1,2) NE 'X''').TEXTER3                    00553001
         AIF   (K'&TEXT(&SUB) LE 3).TEXTER2  Sublist entry too short ?  00554001
&TL      SETA  &TL+(K'&TEXT(&SUB)-3)/2    Minus 3 for X'---'            00555001
&TE      SETA  &SUB                    Set Text array index             00556001
&TTAB(&SUB)  SETC  '&TEXT(&SUB)'       Save text element in text array  00557001
.*                                                                      00558001
.TEXT80  ANOP                          process next sublist entry       00559001
&SUB     SETA  &SUB+1                  advance sublist index            00560001
         AIF   (&SUB LE N'&TEXT).TEXT10  and continue if not thru yet   00561001
         AGO   .TEXTXT                 and branch to continue           00562001
.*                                                                      00563001
.TEXTER1 ANOP                                                           00564001
         MNOTE 8,'TEXT SUBLIST ENTRY &SUB IS MISSING'                   00565001
         AGO   .TEXTXT                 and branch to continue           00566001
.*                                                                      00567001
.TEXTER2 ANOP                                                           00568001
         MNOTE 8,'TEXT SUBLIST ENTRY &SUB IS TOO SHORT'                 00569001
         AGO   .TEXTXT                 and branch to continue           00570001
.*                                                                      00571001
.TEXTER3 ANOP                                                           00572001
         MNOTE 8,'TEXT SUBLIST ENTRY &SUB DOES NOT START WITH X'' NOR '*00573001
               '.'                                                      00574001
.*                                                                      00575001
.TEXTXT  ANOP                                                           00576001
.*                                                                      00577001
.********************************************************************** 00578001
.*             handle FORMAT= Parameter                               * 00579001
.********************************************************************** 00580001
.FORM00  ANOP                                                           00581001
         AIF   ('&FORMAT' EQ '').FORMXT  Branch if not specified        00582001
         AIF   ('&FORMAT' NE 'DBCS').FORMER1 report error if not "DBCS" 00583001
&DBCS    SETB  1                       set flag that FORMAt=DBCS was   *00584001
                                       specified                        00585001
         AGO   .FORMXT                 and continue                     00586001
.*                                                                      00587001
.FORMER1 ANOP                                                           00588001
         MNOTE 4,'INVALID FORMAT PARAMETER - IGNORED'                   00589001
.*                                                                      00590001
.FORMXT  ANOP                                                           00591001
.*                                                                      00592001
.********************************************************************** 00593001
.*             handle DONLINE= Parameter                              * 00594001
.********************************************************************** 00595001
.*                                                                      00596001
         AIF   ('&DONLINE' EQ '').DONLXT  Branch if not specified  @L6A 00597001
         AIF   ('&DONLINE' EQ 'NO').DONLXT Branch of NO speciifed  @L6A 00598001
         AIF   ('&DONLINE' NE 'YES').DONLER1  Branch to report error   *00599001
                                                                   @L6A 00600001
&FLAGS   SETA  &FLAGS+&DYN             Indicate that parameter/feature *00601001
                                       is allowed to be changed while  *00602001
                                       device is in online state   @L6A 00603001
         AGO   .DONLXT                 and continue                @L6A 00604001
.*                                                                      00605001
.DONLER1 ANOP                                                      @L6A 00606001
         MNOTE 8,'INVALID DONLINE PARAMETER - MUST BE "YES" or "NO"'   *00607001
                                                                   @L6A 00608001
.*                                                                      00609001
.DONLXT  ANOP                                                      @L6A 00610001
.*                                                                      00611001
.*                                                                      00612001
.********************************************************************** 00613001
.*             handle SYSTEM=  Parameter                          @LDA* 00614001
.********************************************************************** 00615001
.*                                                                      00616001
         AIF   ('&SYSTEM'  EQ '').SYSTXT  Branch if not specified  @LDA 00617001
         AIF   ('&SYSTEM'  EQ 'VM').SYSTXT Branch if VM specified  @LDA 00618001
         AIF   ('&SYSTEM'  NE 'MVS').SYSTER1  Branch to report error   *00619001
                                                                   @LDA 00620001
         AGO   .SYSTXT                 and continue                @LDA 00621001
.*                                                                      00622001
.SYSTER1 ANOP                                                      @LDA 00623001
         MNOTE 8,'INVALID SYSTEM  PARAMETER - MUST BE "MVS" or "VM"'   *00624001
                                                                   @LDA 00625001
.*                                                                      00626001
.SYSTXT  ANOP                                                      @LDA 00627001
.*                                                                      00628001
.********************************************************************** 00629001
.*             handle HELP= Parameter                                 * 00630001
.********************************************************************** 00631001
.HELP00  ANOP                                                           00632001
&ML      SETA  8                       Set maximum length               00633001
&HELPN   SETC  '        '              Set default help member name     00634001
         AIF   ('&HELP' EQ '').HELPXT   Branch if omitted               00635001
         AIF   (K'&HELP GT &ML).HELPER1  If greater 8, report error     00636001
&WL      SETA  1                   Set loop count                       00637001
.HELP10  ANOP                                                           00638001
         AIF   ('&HELP'(1,1) EQ '&CHAR1'(&WL,1)).HELP20                 00639001
&WL      SETA  &WL+1               Bump to next character in table      00640001
         AIF   (&WL GT 29).HELPER2  If not found --> error              00641001
         AGO   .HELP10             and try this one                     00642001
.HELP20  ANOP                                                           00643001
&WL      SETA  1                   Set loop count for other table       00644001
&I       SETA  2                   Start checking with 2nd character    00645001
.HELP25  ANOP                                                           00646001
         AIF   (&I GT K'&HELP).HELP50   It is done, parameter is OK     00647001
.HELP30  ANOP                                                           00648001
         AIF   ('&HELP'(&I,1) EQ '&CHAR2'(&WL,1)).HELP35                00649001
&WL      SETA  &WL+1               Bump to next character in table      00650001
         AIF   (&WL GT 39).HELPER2   Not found --> error                00651001
         AGO   .HELP30             Try this character                   00652001
.HELP35  ANOP                                                           00653001
&WL      SETA  1                   Set loop count again                 00654001
&I       SETA  &I+1                Check next character of HELP parm    00655001
         AGO   .HELP25             and start checking again             00656001
.*                                                                      00657001
.HELP50  ANOP                                                           00658001
&HELPN   SETC  '&HELP'             Save user specified member name      00659001
         AGO   .HELPXT             And contine checking                 00660001
.*                                                                      00661001
.HELPER1 ANOP                                                           00662001
         MNOTE 8,'HELP PARAMETER EXCEEDS &ML CHARACTERS'                00663001
         AGO   .HELPXT                 And contine checking             00664001
.*                                                                      00665001
.HELPER2 ANOP                                                           00666001
         MNOTE 8,'INVALID HELP PARAMETER - IGNORED'                     00667001
.*                                                                      00668001
.HELPXT  ANOP                                                           00669001
.*                                                                      00670001
.********************************************************************** 00671001
.*             handle TYPE= Parameter                                 * 00672001
.********************************************************************** 00673001
.*                                                                      00674001
.*   Valid specifications are:    ...,TYPE= <PARA | FEAT | SPECIAL>     00675001
.*                                                                      00676001
.*                                                                      00677001
.TYPE00  ANOP                                                           00678001
&HOT     SETA  0                       Indicate no help overwrite       00679001
         AIF   ('&TYPE' EQ '').TYPEXT      Branch if not specified      00680001
&HOT     SETA  1                       Assume TYPE=PARA specified       00681001
         AIF   ('&TYPE' EQ 'PARA').TYPEXT                               00682001
&HOT     SETA  2                       Assume TYPE=FEAT specified       00683001
         AIF   ('&TYPE' EQ 'FEAT').TYPEXT                               00684001
&HOT     SETA  3                       Assume TYPE=SPECIAL specified    00685001
         AIF   ('&TYPE' EQ 'SPECIAL').TYPEXT                            00686001
.*                                                                      00687001
.TYPEER1 ANOP                                                           00688001
         MNOTE 8,'INVALID TYPE PARAMETER - IGNORED'                     00689001
.*                                                                      00690001
.TYPEXT  ANOP                                                           00691001
.*                                                                      00692001
.********************************************************************** 00693001
.*             handle ID=   Parameter                                 * 00694001
.********************************************************************** 00695001
.ID00    ANOP                                                           00696001
         AIF   ('&ID' EQ '').IDXT      Branch if not specified          00697001
         AIF   (&HOT EQ 2).ID100     TYPE=FEAT specified                00698001
         AIF   (&HOT EQ 3).ID200       TYPE=SPECIAL specified           00699001
         AIF   ('&SYSTEM' NE 'MVS').IDXT  non MVS parameters       @LDA 00700001
&PID     SETA  1                       assume ID=ADAPTER specified      00701001
         AIF   ('&ID' EQ 'ADAPTER').IDXT                                00702001
&PID     SETA  2                       assume ID=ADDRESS specified      00703001
         AIF   ('&ID' EQ 'ADDRESS').IDXT                                00704001
&PID     SETA  3                       assume ID=EXPBFR specified       00705001
         AIF   ('&ID' EQ 'EXPBFR').IDXT                                 00706001
&PID     SETA  4                       assume ID=FEATURE specified      00707001
         AIF   ('&ID' EQ 'FEATURE').IDXT                                00708001
&PID     SETA  7                       assume ID=NUMSECT specified      00709001
         AIF   ('&ID' EQ 'NUMSECT').IDXT                                00710001
&PID     SETA  8                       assume ID=ADAPTER specified      00711001
         AIF   ('&ID' EQ 'OFFLINE').IDXT                                00712001
&PID     SETA  9                       assume ID=OFFLINE specified      00713001
         AIF   ('&ID' EQ 'PCU').IDXT                                    00714001
&PID     SETA  10                      assume ID=SETADDR specified      00715001
         AIF   ('&ID' EQ 'SETADDR').IDXT                                00716001
&PID     SETA  11                      assume ID=TCU     specified      00717001
         AIF   ('&ID' EQ 'TCU').IDXT                                    00718001
&PID     SETA  13                      assume ID=DYNAMIC specified      00719001
         AIF   ('&ID' EQ 'DYNAMIC').IDXT                                00720001
&PID     SETA  14                      assume ID=OWNER   specified      00721001
         AIF   ('&ID' EQ 'OWNER').IDXT                                  00722001
&PID     SETA  15                      assume ID=LOCANY  specified @N6A 00722301
         AIF   ('&ID' EQ 'LOCANY').IDXT                            @N6A 00722601
&PID     SETA  0                       reset value                      00723001
         AIF   ('&ID' LT '33').IDER1         invalid identifier    @L6A 00724001
         AIF   ('&ID' GT '64').IDER1         invalid identifier    @L6A 00725001
&PID     SETA  &ID                     save identifier             @L6A 00726001
         AGO   .IDXT                   and continue                @L6C 00727001
.*                                                                      00728001
.*                                                                      00729001
.*------------------ Handle ID= parameter for TYPE=FEAT --------------  00730001
.*                                                                      00731001
.ID100   ANOP                                                           00732001
&ML      SETA  2                      Maximum ID  length                00733001
&MAXVAL  SETA  64                     Maximum ID  value                 00734001
         AIF   (N'&ID GT 1).IDER1     ID  is in sublist format          00735001
         AIF   (K'&ID GT &ML).IDER2   Number of digits                  00736001
.*                                                                      00737001
.*       Loop to validate each digit of the ID parameter                00738001
.*                                                                      00739001
&I       SETA  1                      Point to 1st digit                00740001
.ID110   ANOP                                                           00741001
         AIF   ('&ID'(&I,1) LT '0').IDER1    Not decimal                00742001
         AIF   ('&ID'(&I,1) GT '9').IDER1    Not decimal                00743001
&I       SETA  &I+1                   Points to next digit in ID        00744001
         AIF   (&I LE K'&ID).ID110    Check next digit                  00745001
.*                                                                      00746001
         AIF   (&ID LT 1 OR &ID GT &MAXVAL).IDER3                       00747001
&PID     SETA  &ID                                                      00748001
         AGO   .IDXT                   and continue                     00749001
.*                                                                      00750001
.*---------------- Handle ID= parameter for TYPE=SPECIAL  -----------   00751001
.*                                                                      00752001
.ID200   ANOP                                                           00753001
&PID     SETA  1                       assume ID=DEVNUM  specified      00754001
         AIF   ('&ID' EQ 'DEVNUM').IDXT                                 00755001
&PID     SETA  2                       assume ID=DEVRANGE specified     00756001
         AIF   ('&ID' EQ 'DEVRANGE').IDXT                               00757001
&PID     SETA  3                       assume ID=DEVTYPE specified      00758001
         AIF   ('&ID' EQ 'DEVTYPE').IDXT                                00759001
&PID     SETA  4                       assume ID=DEVUA   specified      00760001
         AIF   ('&ID' EQ 'DEVUA').IDXT                                  00761001
.*                                                                      00762001
.*                                                                      00763001
.IDER1   ANOP                                                           00764001
         MNOTE 8,'INVALID ID PARAMETER - IGNORED'                       00765001
         AGO   .IDXT                   and continue                     00766001
.*                                                                      00767001
.IDER2   ANOP                                                           00768001
         MNOTE 8,'ID PARAMETER EXCEEDS &ML DIGITS.'                     00769001
         AGO   .IDXT                   and continue                     00770001
.*                                                                      00771001
.IDER3   ANOP                                                           00772001
         MNOTE 8,'ID VALUE MUST BE A NUMBER FROM 1 TO &MAXVAL.'         00773001
.*                                                                      00774001
.IDXT    ANOP                                                           00775001
.*                                                                      00776001
.********************************************************************** 00777001
.*             handle UNIT=  Parameter                                * 00778001
.********************************************************************** 00779001
.UNIT00  ANOP                                                           00780001
         AIF   ('&UNIT' EQ '').UNITXT  Branch if not specified          00781001
&P       SETC  'UNIT'                  UNIT parameter specified         00782001
         AIF   ('&CUR' EQ 'U').UNIT10  Are we generating the unit      *00783001
                                       description list ?               00784001
         AIF   (&USW).MACER1           We have already built the unit  *00785001
                                       description list ?               00786001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *00787001
                                       not been gen'ed yet              00788001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*00789001
                                       parameter ?                      00790001
.UNIT10  ANOP                                                           00791001
&PP      SETC  '&P'                    We are now processing UNIT=      00792001
&CUR     SETC  'U'                     Show that we are now generating *00793001
                                       the unit description list        00794001
         AIF   (&USW).UNIT20           Branch if header has been gen'ed 00795001
         SPACE 5                                                        00796001
         ORG   UDDUDESP                Set origin                       00797001
         DC    A(UDDUNITL)             Point to begin of unit desc'tion 00798001
         ORG   ,                       Reset origin                     00799001
         SPACE 2                                                        00800001
*********************************************************************** 00801001
*                                                                     * 00802001
*                 Unit Description List                               * 00803001
*                                                                     * 00804001
*********************************************************************** 00805001
         SPACE 1                                                        00806001
UDDUNITL DS    0F                      Start of unit description list   00807001
.*                                                                      00808001
&USW     SETB  1                       Indicate that we have gen'ed the*00809001
                                       header                           00810001
.UNIT20  ANOP                          validate UNIT parameter          00811001
&MTL     SETA  60                      Set maximum length of unit desc  00812001
&ALN     SETA  &MTL                    Set alignment length             00813001
&TL      SETA  0                       Set text length = 0              00814001
&TE      SETA  0                       Set number of text elements = 0  00815001
&SUB     SETA  1                       Initialize sublist index         00816001
.*                                                                      00817001
.*       Loop to validate each sublist entry                            00818001
.*                                                                      00819001
.UNIT30  ANOP                          Begin of loop                    00820001
         AIF   ('&UNIT(&SUB)' EQ '').UNITER1  Null sublist entry ?      00821001
         AIF   ('&UNIT(&SUB)'(1,1) NE '''').UNIT50  Hex notation ?      00822001
         AIF   (K'&UNIT(&SUB) LE 2).UNITER2  Sublist entry too short ?  00823001
&TL      SETA  &TL+K'&UNIT(&SUB)-2     Minus 2 for quotes               00824001
&TE      SETA  &SUB                    Set Text array index             00825001
&TTAB(&TE)  SETC  '&UNIT(&SUB)'        Save text element in text array  00826001
         AGO   .UNIT60                 and continue                     00827001
.*                                                                      00828001
.UNIT50  ANOP                          handle hex notation              00829001
         AIF   ('&UNIT(&SUB)'(1,2) NE 'X''').UNITER3                    00830001
         AIF   (K'&UNIT(&SUB) LE 3).UNITER2  Sublist entry too short ?  00831001
&TL      SETA  &TL+(K'&UNIT(&SUB)/2)-3    Minus 3 for X'---'            00832001
&TE      SETA  &SUB                    Set Text array index             00833001
&TTAB(&TE)  SETC  '&UNIT(&SUB)'        Save text element in text array  00834001
.*                                                                      00835001
.UNIT60  ANOP                          process next sublist entry       00836001
&SUB     SETA  &SUB+1                  advance sublist index            00837001
         AIF   (&TL GT &MTL).UNITER4   UNIT parameter exceeds maximum   00838001
         AIF   (&SUB LE N'&UNIT).UNIT30  and continue if not thru yet   00839001
.*                                                                      00840001
.*       generate Unit Description entry                                00841001
.*                                                                      00842001
&UNITC   SETA  &UNITC+1                increase unit descr count        00843001
         DC    AL1(&UNITC)             Unit description index           00844001
         DC    AL1(&TL)                Length of unit description       00845001
         DC    CL8'&HELPN'             Help member name                 00846001
&SUB     SETA  1                       Initialize text array index      00847001
.UNIT70  ANOP                                                           00848001
         AIF   ('&TTAB(&SUB)'(1,2) EQ 'X''').UNIT80  hex notation       00849001
         DC    C&TTAB(&SUB)                                             00850001
         AGO   .UNIT90                 and continue                     00851001
.UNIT80  ANOP                                                           00852001
         DC    &TTAB(&SUB)                                              00853001
.UNIT90  ANOP                                                           00854001
&SUB     SETA  &SUB+1                  advance text array index         00855001
         AIF   (&SUB LE &TE).UNIT70    all text elements processed ?    00856001
         DC    (&ALN-&TL)AL1(0)        Reserved                         00857001
.*                                                                      00858001
         SPACE 2                                                        00859001
         ORG   UDDUDESC                                                 00860001
         DC    A(&UNITC)               Update count                     00861001
         ORG   ,                       Reset origin                     00862001
         SPACE 3                                                        00863001
.*                                                                      00864001
         AGO   .UNITXT                 and branch to continue           00865001
.*                                                                      00866001
.UNITER1 ANOP                                                           00867001
         MNOTE 8,'UNIT SUBLIST ENTRY &SUB IS MISSING'                   00868001
         SPACE 2                                                        00869001
         MEXIT                                                          00870001
.*                                                                      00871001
.UNITER2 ANOP                                                           00872001
         MNOTE 8,'UNIT SUBLIST ENTRY &SUB IS TOO SHORT'                 00873001
         SPACE 2                                                        00874001
         MEXIT                                                          00875001
.*                                                                      00876001
.UNITER3 ANOP                                                           00877001
         MNOTE 8,'UNIT SUBLIST ENTRY &SUB DOES NOT START WITH X'' NOR '*00878001
               '.'                                                      00879001
         SPACE 2                                                        00880001
         MEXIT                                                          00881001
.*                                                                      00882001
.UNITER4 ANOP                                                           00883001
         MNOTE 8,'UNIT PARAMETER EXCEEDS &MTL CHARACTERS'               00884001
         SPACE 2                                                        00885001
         MEXIT                                                          00886001
.*                                                                      00887001
.UNITXT  ANOP                                                           00888001
.*                                                                      00889001
.*                                                                      00964001
.********************************************************************** 00965001
.*             handle FEAT=  Parameter                                * 00966001
.********************************************************************** 00967001
.FEAT00  ANOP                                                           00968001
         AIF   ('&FEAT' EQ '').FEATXT  Branch if not specified          00969001
&P       SETC  'FEAT'                  Handling FEAT parameter          00970001
         AIF   ('&CUR' EQ 'F').FEAT10  Are we generating the feature   *00971001
                                       list ?                           00972001
         AIF   (&FSW).MACER1           We have already built the       *00973001
                                       feature list                     00974001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *00975001
                                       not been gen'ed yet              00976001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*00977001
                                       parameter ?                      00978001
.FEAT10  ANOP                                                           00979001
&PP      SETC  '&P'                    We are now processing FEAT=      00980001
&CUR     SETC  'F'                     Show that we are now generating *00981001
                                       the feature list                 00982001
         AIF   ('&SYSTEM' EQ 'MVS').MVSFEA0  Process MVS features  @LDA 00983001
         AIF   (&VFSW).FEAT15          Branch if header has been gen'ed*00984001
                                       for VM                           00985001
         SPACE 5                                                        00986001
&FEATC   SETA  0                       Clear feature count         @LDA 00987001
         ORG   UDDFEATP                Set origin                  @LDA 00988001
         DC    A(UDDVFEAL)             Point to begin of feature list   00989001
*                                                                  @LDA 00990001
         ORG   ,                       Reset origin                @LDA 00991001
         SPACE 2                                                        00992001
*********************************************************************** 00993001
*                                                                     * 00994001
*              Feature Description List for VM                        * 00995001
*                                                                     * 00996001
*********************************************************************** 00997001
         SPACE 1                                                        00998001
UDDVFEAL DS    0F                      Start of feature descript'n list 00999001
*                                                                  @LDA 01000001
.*                                                                      01001001
&FSW     SETB  1                       Indicate that we have gen'ed the*01002001
                                       header                      @LDA 01003001
&VFSW    SETB  1                       Indicate that we have gen'ed the*01004001
                                       VM header                   @LDA 01005001
&WL      SETA  1                       start index of features     @LDA 01006001
.VFINIT  ANOP                          Initialize VM features      @LDA 01007001
         DC    CL10' '                 Slot for feature name       @LDA 01008001
         DC    AL1(0)                  Slot for feature flags      @LDA 01009001
         DC    XL7'00'                 Reserved                    @LDA 01010001
         DC    CL8' '                  Slot for help member name   @LDA 01011001
         DC    AL1(0)                  Slot for description index  @LDA 01012001
         DC    AL1(0)                  Slot for description length @LDA 01013001
         DC    CL44' '                 Slot for description        @LDA 01014001
&WL      SETA  &WL+1                   Increment to next slot      @LDA 01015001
         AIF   (&WL LE &PFEATN).VFINIT Do until all initialized    @LDA 01016001
&FNUM    SETA  &PFEATN                 Initialize number of slots  @LDA 01017001
         ORG   UDDFEATC                Update feature count        @LDA 01018001
         DC    A(&FNUM)                Number of feature slots     @LDA 01019001
         ORG   ,                       Reset origin                @LDA 01020001
.FEAT15  ANOP                          Process VM features         @LDA 01021001
&I       SETA  &PFCONV                 Assume feature CONV         @LDA 01022001
         AIF   ('&FEAT' EQ 'CONV').FEAT17     Okay, leave scan     @LDA 01023001
&I       SETA  &PFDUAL                 Assume feature DUALDENS     @LDA 01024001
         AIF   ('&FEAT' EQ 'DUALDENS').FEAT17 Okay, leave scan     @LDA 01025001
&I       SETA  &PFEMUL                 Assume feature EMUL3270     @LDA 01026001
         AIF   ('&FEAT' EQ 'EMUL3270').FEAT17 Okay, leave scan     @LDA 01027001
&I       SETA  &PFEHLD                 Assume feature E3270HLD     @LDA 01028001
         AIF   ('&FEAT' EQ 'E3270HLD').FEAT17 Okay, leave scan     @LDA 01029001
&I       SETA  &PFOPRD                 Assume feature OPRDR        @LDA 01030001
         AIF   ('&FEAT' EQ 'OPRDR').FEAT17    Okay, leave scan     @LDA 01031001
&I       SETA  &PFTRNS                 Assume feature TRANS        @LDA 01032001
         AIF   ('&FEAT' EQ 'TRANS').FEAT17    Okay, leave scan     @LDA 01033001
&I       SETA  &PFUNVS                 Assume feature UNVCHSET     @LDA 01034001
         AIF   ('&FEAT' EQ 'UNVCHSET').FEAT17 Okay, leave scan     @LDA 01035001
&I       SETA  &PF4WCG                 Assume feature 4WCGMS       @LDA 01036001
         AIF   ('&FEAT' EQ '4WCGMS').FEAT17   Okay, leave scan     @LDA 01037001
&I       SETA  &PF7TRK                 Assume feature 7-TRACK      @LDA 01038001
         AIF   ('&FEAT' EQ '7-TRACK').FEAT17  Okay, leave scan     @LDA 01039001
&I       SETA  &PFDPS                  Assume feature DPS          @LDA 01039201
         AIF   ('&FEAT' EQ 'DPS').FEAT17      Okay, leave scan     @LDA 01039401
&I       SETA  &PFRES                  Assume feature RESERVE      @LDA 01039601
         AIF   ('&FEAT' EQ 'RESERVE').FEAT17  Okay, leave scan     @LDA 01039801
         AGO   .FEAT20                 Unknown feature put at end  @LDA 01040001
.FEAT17  ANOP                                                      @LDA 01041001
         ORG   UDDVFEAL+(&I-1)*72      Points to feature slot      @LDA 01042001
&FEATC   SETA  &I-1                    Correct VM feature count    @LDA 01043001
         AGO   .FEAT20                 Process Features            @LDA 01044001
.*                                                                 @LDA 01045001
.MVSFEA0 ANOP                          MVS features                @LDA 01046001
         AIF   (&MFSW).FEAT20          Branch if header has been gen'ed*01047001
                                       for MVS                     @LDA 01048001
&FEATC   SETA  0                       Clear feature count         @LDA 01049001
         ORG   UDDFEATP                Set origin                  @LDA 01050001
         DC    A(UDDFEATL)             Point to begin of feature list   01051001
*                                                                  @LDA 01052001
         ORG   ,                       Reset origin                @LDA 01053001
         SPACE 2                                                        01054001
*********************************************************************** 01055001
*                                                                     * 01056001
*              Feature Description List                               * 01057001
*                                                                     * 01058001
*********************************************************************** 01059001
         SPACE 1                                                        01060001
UDDFEATL DS    0F                      Start of feature descript'n list 01061001
.*                                                                      01062001
&FSW     SETB  1                       Indicate that we have gen'ed the*01063001
                                       header                           01064001
&MFSW    SETB  1                       Indicate that we have gen'ed the*01065001
                                       MVS header                  @LDA 01066001
.*                                                                      01067001
.FEAT20  ANOP                          validate FEAT parameter          01068001
&ML      SETA  10                      Set maximum length of feature    01069001
&MTL     SETA  44                      Set maximum text length          01070001
&ALN     SETA  &MTL                    Set alignment length             01071001
         AIF   (K'&FEAT GT &ML).FEATER1  FEAT parameter exceeds maximum 01072001
         AIF   ('&FEAT' EQ '*').FEAT25   Branch if Placeholder entry    01073001
         AIF   (&TL EQ 0).FEATER2      Text parameter not specified ?   01074001
.FEAT25  ANOP                                                           01075001
&FEATN   SETC  '&FEAT'                 Save user specified feature      01076001
         AIF   ('&FEAT' NE '*').FEAT30   Placeholder entry to be gen ed 01077001
&FEATN   SETC  ' '                     Indicate placeholder entry       01078001
&TL      SETA  0                       Set text length = 0              01079001
.FEAT30  ANOP                                                           01080001
         AIF   (&TL GT &MTL).FEATER3 TEXT parameter exceeds maximum     01081001
.*                                                                      01082001
.*       generate feature list entry                                    01083001
.*                                                                      01084001
&FEATC   SETA  &FEATC+1                increase feature count           01085001
         DC    CL10'&FEATN'            Feature name                     01086001
         DC    AL1(&FLAGS)             Feature flags               @L6A 01087001
         DC    XL7'00'                 Reserved                    @L6C 01088001
         DC    CL8'&HELPN'             Help member name                 01089001
         DC    AL1(&FEATC)             Feature description index        01090001
         DC    AL1(&TL)                Length of feature description    01091001
.*                                                                      01092001
&SUB     SETA  1                       Initialize text array index      01093001
         AIF   ('&FEAT' EQ '*').FEAT75   Placeholder entry to be gen ed 01094001
.FEAT50  ANOP                                                           01095001
         AIF   ('&TTAB(&SUB)'(1,2) EQ 'X''').FEAT60  hex notation       01096001
         DC    C&TTAB(&SUB)                                             01097001
         AGO   .FEAT70                 and continue                     01098001
.FEAT60  ANOP                                                           01099001
         DC    &TTAB(&SUB)                                              01100001
.FEAT70  ANOP                                                           01101001
&SUB     SETA  &SUB+1                  advance text array index         01102001
         AIF   (&SUB LE &TE).FEAT50    all text elements processed ?    01103001
.FEAT75  ANOP                                                           01104001
         DC    (&ALN-&TL)AL1(0)        Reserved                         01105001
.*                                                                      01106001
.FEAT80  ANOP                                                           01107001
         SPACE 2                                                        01108001
         AIF   ('&SYSTEM' EQ 'MVS').MVSFEA9  Process MVS features  @LDA 01109001
         AIF   (&I LE &PFEATN).FEAT85  No increment of slots       @LDA 01110001
&FNUM    SETA  &FNUM+1                 Increment number of slots   @LDA 01111001
         ORG   UDDFEATC                                            @LDA 01112001
         DC    A(&FNUM)                Update count                @LDA 01113001
.FEAT85  ANOP                                                      @LDA 01114001
         ORG   ,                       Reset origin                @LDA 01115001
         SPACE 3                                                        01116001
.*                                                                      01117001
         AGO   .FEATXT                 and continue                @LDA 01118001
.MVSFEA9 ANOP                          MVS features                @LDA 01119001
         ORG   UDDFEATC                                                 01120001
         DC    A(&FEATC)               Update count                     01121001
         ORG   ,                       Reset origin                     01122001
         SPACE 3                                                        01123001
.*                                                                      01124001
         AGO   .FEATXT                 and continue                     01125001
.*                                                                      01126001
.FEATER1 ANOP                                                           01127001
         MNOTE 8,'FEAT PARAMETER EXCEEDS &ML CHARACTERS'                01128001
         SPACE 2                                                        01129001
         MEXIT                                                          01130001
.*                                                                      01131001
.FEATER2 ANOP                                                           01132001
         MNOTE 8,'TEXT PARAMETER MISSING - MANDATORY IN CONJUNCTION WIT*01133001
               H FEAT PARAMETER'                                        01134001
         SPACE 2                                                        01135001
         MEXIT                                                          01136001
.*                                                                      01137001
.FEATER3 ANOP                                                           01138001
         MNOTE 8,'TEXT PARAMETER EXCEEDS &MTL CHARACTERS'               01139001
         SPACE 2                                                        01140001
         MEXIT                                                          01141001
.*                                                                      01142001
.FEATXT  ANOP                                                           01143001
.*                                                                      01144001
.********************************************************************** 01145001
.*             handle CFEAT= Parameter                                * 01146001
.********************************************************************** 01147001
.COMP00  ANOP                                                           01148001
         AIF   ('&CFEAT' EQ '').COMPXT Branch if not specified          01149001
&P       SETC  'CFEAT'                 Handling CFEAT parameter         01150001
         AIF   ('&CUR' EQ 'C').COMP10  Are we generating the compatible*01151001
                                       feature list ?                   01152001
         AIF   (&CSW).MACER1           We have already built the       *01153001
                                       compatible feature list          01154001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *01155001
                                       not been gen'ed yet              01156001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*01157001
                                       parameter ?                      01158001
.COMP10  ANOP                                                           01159001
&PP      SETC  '&P'                    We are now processing CFEAT=     01160001
&CUR     SETC  'C'                     Show that we are now generating *01161001
                                       the compatible feature list      01162001
&ML      SETA  10                      Set maximum length for feature   01163001
         AIF   (&CSW).COMP20           Branch if header has been gen'ed 01164001
         SPACE 5                                                        01165001
         AIF   ('&SYSTEM' EQ 'MVS').MVSCFE0   process MVS features @LDA 01166001
&COMPC   SETA  0                       Clear feature count         @LDA 01167001
         ORG   UDDCOMPP                Set origin                  @LDA 01168001
         DC    A(UDDVCMPL)             Point to compatible feature list 01169001
*                                                                  @LDA 01170001
         ORG   ,                       Reset origin                @LDA 01171001
         SPACE 2                                                        01172001
*********************************************************************** 01173001
*                                                                     * 01174001
*        Compatible Feature Description List for VM               @LDA* 01175001
*                                                                     * 01176001
*********************************************************************** 01177001
         SPACE 1                                                        01178001
UDDVCMPL DS    0F                      Start of compatible feature list 01179001
*                                                                  @LDA 01180001
.*                                                                      01181001
&CSW     SETB  1                       Indicate that we have gen'ed the*01182001
                                       compatible feature list     @LDA 01183001
         AGO   .COMP20                 Process features            @LDA 01184001
.*                                                                      01185001
.MVSCFE0 ANOP                          MVS compatible features     @LDA 01186001
&COMPC   SETA  0                       Clear origin count          @LDA 01187001
         ORG   UDDCOMPP                Set origin                       01188001
         DC    A(UDDCOMPL)             Point to compatible feature list 01189001
         ORG   ,                       Reset origin                     01190001
         SPACE 2                                                        01191001
.*                                                                      01192001
*********************************************************************** 01193001
*                                                                     * 01194001
*        Compatible Feature Description List for MVS              @LDC* 01195001
*                                                                     * 01196001
*********************************************************************** 01197001
         SPACE 1                                                        01198001
UDDCOMPL DS    0F                      Start of compatible feature list 01199001
.*                                                                      01200001
&CSW     SETB  1                       Indicate that we have gen'ed the*01201001
                                       compatible feature list          01202001
.*                                                                      01203001
.*       Loop to check each feature in the sublist                      01204001
.*                                                                      01205001
.COMP20  ANOP                                                           01206001
&SUB     SETA  1                       Initialize sublist index         01207001
.COMP30  ANOP                          Begin of loop                    01208001
         AIF   ('&CFEAT(&SUB)' EQ '').COMPER1  Null sublist entry ?     01209001
         AIF   (K'&CFEAT(&SUB) GT &ML).COMPER2 sublist entyr too long ? 01210001
&COMPC   SETA  &COMPC+1                Increase count of compatible    *01211001
                                       features by 1                    01212001
         DC    CL10'&CFEAT(&SUB)'      Compatible Feature String        01213001
&SUB     SETA  &SUB+1                  advance sublist index            01214001
         AIF   (&SUB LE N'&CFEAT).COMP30 and continue if not thru yet   01215001
.*                                                                      01216001
         SPACE 2                                                        01217001
         AIF   ('&SYSTEM' EQ 'MVS').MVSCMP9   process MVS features @LDA 01218001
         ORG   UDDCOMPC                                            @LDA 01219001
         DC    A(&COMPC)               Update count                @LDA 01220001
         ORG   ,                       Reset origin                @LDA 01221001
         SPACE 3                                                        01222001
.*                                                                      01223001
         AGO   .COMPXT                 and continue                @LDA 01224001
.*                                                                      01225001
.MVSCMP9 ANOP                          MVS features                @LDA 01226001
         ORG   UDDCOMPC                Set to origin                    01227001
         DC    A(&COMPC)               Update count                     01228001
         ORG   ,                       Reset origin                     01229001
         SPACE 3                                                        01230001
.*                                                                      01231001
         AGO   .COMPXT                 and continue                     01232001
.*                                                                      01233001
.COMPER1 ANOP                                                           01234001
         MNOTE 8,'CFEAT SUBLIST ENTRY &SUB IS MISSING'                  01235001
         SPACE 2                                                        01236001
         MEXIT                                                          01237001
.*                                                                      01238001
.COMPER2 ANOP                                                           01239001
         MNOTE 8,'CFEAT SUBLIST ENTRY &SUB EXCEEDS &ML CHARACTERS'      01240001
         SPACE 2                                                        01241001
         MEXIT                                                          01242001
.*                                                                      01243001
.COMPXT  ANOP                                                           01244001
.*                                                                      01245001
.********************************************************************** 01246001
.*             handle PARA=  Parameter                                * 01247001
.********************************************************************** 01248001
.PARM00  ANOP                                                           01249001
         AIF   ('&PARA' EQ '').PARMXT  Branch if not specified          01250001
&P       SETC  'PARA'                  handling PARA parameter          01251001
         AIF   ('&CUR' EQ 'P').PARM10  Are we generating the parameter *01252001
                                       list ?                           01253001
         AIF   (&PSW).MACER1           We have already built the       *01254001
                                       parameter list                   01255001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *01256001
                                       not been gen'ed yet              01257001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*01258001
                                       parameter ?                      01259001
.PARM10  ANOP                                                           01260001
&PP      SETC  '&P'                    We are now processing PARA=      01261001
&CUR     SETC  'P'                     Show that we are now generating *01262001
                                       the parameter list               01263001
&ML      SETA  10                      Set maximum length for parameter 01264001
         AIF   ('&SYSTEM' EQ 'MVS').MVSPRM0  Process MVS parameter @LDA 01265001
         AIF   (&VPSW).PARM20          Branch if header has been gen'ed 01266001
         SPACE 5                                                        01267001
&PARAC   SETA  0                       Clear parameter count       @LDA 01268001
         ORG   UDDPARMP                Set origin                  @LDA 01269001
         DC    A(UDDVPRML)             Point to begin of parameter list 01270001
*                                                                  @LDA 01271001
         ORG   ,                       Reset origin                @LDA 01272001
         SPACE 2                                                        01273001
*********************************************************************** 01274001
*                                                                     * 01275001
*              Parameter Description List for VM                  @LDA* 01276001
*                                                                     * 01277001
*********************************************************************** 01278001
         SPACE 1                                                        01279001
UDDVPRML DS    0F                      Start of parameter list     @LDA 01280001
.*                                                                      01281001
&PSW     SETB  1                       Indicate that we have gen'ed the*01282001
                                       header                      @LDA 01283001
&VPSW    SETB  1                       Indicate that we have gen'ed the*01284001
                                       VM header                   @LDA 01285001
         AGO   .PARM20                 Process parameters          @LDA 01286001
.*                                                                      01287001
.MVSPRM0 ANOP                          MVS parameters              @LDA 01288001
         AIF   (&MPSW).PARM20          Branch if header has been gen'ed 01289001
         SPACE 5                                                        01290001
&PARAC   SETA  0                       Clear parameter count       @LDA 01291001
         ORG   UDDPARMP                Set origin                       01292001
         DC    A(UDDPARML)             Point to begin of parameter list 01293001
         ORG   ,                       Reset origin                     01294001
         SPACE 2                                                        01295001
*********************************************************************** 01296001
*                                                                     * 01297001
*              Parameter Description List for MVS                 @LDA* 01298001
*                                                                     * 01299001
*********************************************************************** 01300001
         SPACE 1                                                        01301001
UDDPARML DS    0F                      Start of parameter desc list     01302001
.*                                                                      01303001
&PSW     SETB  1                       Indicate that we have gen'ed the*01304001
                                       header                           01305001
&MPSW    SETB  1                       Indicate that we have gen'ed the*01306001
                                       MVS header                  @LDA 01307001
.PARM20  ANOP                          validate PARA parameter          01308001
&PARAN   SETC  '&PARA'                 save parameter name         @L6A 01309001
         AIF   (N'&PARA GE 2).PARM100  2 subparameters specified ? @LDC 01310001
.*                                                                      01311001
         AIF   ('&SYSTEM' EQ 'MVS').PARM30   Process MVS parameter @LDA 01312001
.*                                                                      01313001
.*       Process VM parameters                                     @LDA 01314001
&PID     SETA  &PVADP                  assume PARA=ADAPTER         @LDA 01315001
         AIF   ('&PARA' EQ 'ADAPTER').PARM200                      @LDA 01316001
&PID     SETA  &PVAFP                  assume PARA=AFP             @LDA 01317001
         AIF   ('&PARA' EQ 'AFP').PARM200                          @LDA 01318001
&PID     SETA  &PVBAD                  assume PARA=BASEADD         @LDA 01319001
         AIF   ('&PARA' EQ 'BASEADD').PARM200                      @LDA 01320001
&PID     SETA  &PVCHR                  assume PARA=CHARS           @LDA 01321001
         AIF   ('&PARA' EQ 'CHARS').PARM200                        @LDA 01322001
&PID     SETA  &PVCLS                  assume PARA=CLASS           @LDA 01323001
         AIF   ('&PARA' EQ 'CLASS').PARM200                        @LDA 01324001
&PID     SETA  &PVCPN                  assume PARA=CPNAME          @LDA 01325001
         AIF   ('&PARA' EQ 'CPNAME').PARM200                       @LDA 01326001
&PID     SETA  &PVDST                  assume PARA=DEST            @LDA 01327001
         AIF   ('&PARA' EQ 'DEST').PARM200                         @LDA 01328001
&PID     SETA  &PVDPM                  assume PARA=DPMSIZE         @LDA 01329001
         AIF   ('&PARA' EQ 'DPMSIZE').PARM200                      @LDA 01330001
&PID     SETA  &PVFCB                  assume PARA=FCB             @LDA 01331001
         AIF   ('&PARA' EQ 'FCB').PARM200                          @LDA 01332001
&PID     SETA  &PVFLH                  assume PARA=FLASH           @LDA 01333001
         AIF   ('&PARA' EQ 'FLASH').PARM200                        @LDA 01334001
&PID     SETA  &PVFLD                  assume PARA=FOLD            @LDA 01335001
         AIF   ('&PARA' EQ 'FOLD').PARM200                         @LDA 01336001
&PID     SETA  &PVFRM                  assume PARA=FORM            @LDA 01337001
         AIF   ('&PARA' EQ 'FORM').PARM200                         @LDA 01338001
&PID     SETA  &PVIMG                  assume PARA=IMAGE           @LDA 01339001
         AIF   ('&PARA' EQ 'IMAGE').PARM200                        @LDA 01340001
&PID     SETA  &PVIND                  assume PARA=INDEX           @LDA 01341001
         AIF   ('&PARA' EQ 'INDEX').PARM200                        @LDA 01342001
&PID     SETA  &PVMOD                  assume PARA=MODEL           @LDA 01343001
         AIF   ('&PARA' EQ 'MODEL').PARM200                        @LDA 01344001
&PID     SETA  &PVOFF                  assume PARA=OFFLINE         @LDA 01345001
         AIF   ('&PARA' EQ 'OFFLINE').PARM200                      @LDA 01346001
&PID     SETA  &PVSEP                  assume PARA=SEP             @LDA 01347001
         AIF   ('&PARA' EQ 'SEP').PARM200                          @LDA 01348001
&PID     SETA  &PVSET                  assume PARA=SETADDR         @LDA 01349001
         AIF   ('&PARA' EQ 'SETADDR').PARM200                      @LDA 01350001
&PID     SETA  &PVSHR                  assume PARA=SHARED          @LDA 01351001
         AIF   ('&PARA' EQ 'SHARED').PARM200                       @LDA 01352001
&PID     SETA  &PVUIR                  assume PARA=UIRATE          @LDA 01353001
         AIF   ('&PARA' EQ 'UIRATE').PARM200                       @LDA 01354001
         AGO   .PARMER1                go and report error              01355001
.*                                                                      01356001
.PARM30  ANOP                                                           01357001
.*       Process MVS parameters                                    @LDA 01358001
&PID     SETA  1                       assume PARA=ADAPTER specified    01359001
         AIF   ('&PARA' EQ 'ADAPTER').PARM300                           01360001
&PID     SETA  3                       assume PARA=EXPBFR specified     01361001
         AIF   ('&PARA' EQ 'EXPBFR').PARM300                            01362001
&PID     SETA  7                       assume PARA=NUMSECT specified    01363001
         AIF   ('&PARA' EQ 'NUMSECT').PARM300                           01364001
&PID     SETA  8                       assume PARA=ADAPTER specified    01365001
         AIF   ('&PARA' EQ 'OFFLINE').PARM300                           01366001
&PID     SETA  9                       assume PARA=OFFLINE specified    01367001
         AIF   ('&PARA' EQ 'PCU').PARM300                               01368001
&PID     SETA  10                      assume PARA=SETADDR specified    01369001
         AIF   ('&PARA' EQ 'SETADDR').PARM300                           01370001
&PID     SETA  11                      assume PARA=TCU     specified    01371001
         AIF   ('&PARA' EQ 'TCU').PARM300                               01372001
&PID     SETA  13                      assume PARA=DYNAMIC specified    01373001
         AIF   ('&PARA' EQ 'DYNAMIC').PARM300                           01374001
&PID     SETA  14                      assume PARA=OWNER   specified    01375001
         AIF   ('&PARA' EQ 'OWNER').PARM300                             01376001
&PID     SETA  15                      assume PARA=LOCANY  spec    @N6A 01376301
         AIF   ('&PARA' EQ 'LOCANY').PARM300                       @N6A 01376601
         AGO   .PARMER1                go and report error              01377001
.*                                                                      01378001
.*--------------------------------------------------------------------* 01379001
.*       Check for UIM private parameter definitions                  * 01380001
.*--------------------------------------------------------------------* 01381001
.*                                                                      01382001
.PARM100 ANOP                                                           01383001
         AIF   ('&PARA(1)' EQ '').PARMER4  if omitted report error @L6A 01384001
&PARAN   SETC  '&PARA(1)'          Save parameter name             @L6A 01385001
.*                                                                      01386001
         AIF   ('&PARA(2)' EQ '').PARMER5  if omitted report error @L6A 01387001
         AIF   ('&PARA(2)' LT '33').PARMER6  invalid parameter id  @L6A 01388001
         AIF   ('&PARA(2)' GT '64').PARMER6  invalid parameter id  @L6A 01389001
&PID     SETA  &PARA(2)            Save parameter identifier       @L6A 01390001
.*                                                                      01391001
.*--------------------------------------------------------------------* 01392001
.*             Validate PARATYPE parameter                            * 01393001
.*--------------------------------------------------------------------* 01394001
.*                                                                      01395001
.PARM200 ANOP                                                      @LDA 01396001
         AIF   ('&PARATYPE' EQ '').PTYPER1 report error if omitted @L6A 01397001
         AIF   (N'&PARATYPE GT 6).PTYPER2  report error if > 6     @LDC 01398001
&PNDX    SETA  2                       Set parameter index to 2    @LDA 01399001
&LIST    SETA  1                       Init parameter list count   @LDA 01400001
&RNGMIN  SETA  0                       Init minimum range value    @LDA 01401001
&RNGMAX  SETA  0                       Init maximum range value    @LDA 01402001
.*                                                                      01403001
&PTYPE   SETA  1                       assume parameter type CHAR  @L6A 01404001
         AIF   ('&PARATYPE(1)' EQ '').PTYP050  branch if omitted   @L6A 01405001
         AIF   ('&PARATYPE(1)' EQ 'CHAR').PTYP050  branch if CHAR  @L6A 01406001
&PTYPE   SETA  2                       assume parameter type NUM   @L6A 01407001
         AIF   ('&PARATYPE(1)' EQ 'NUM').PTYP050  branch if NUM    @L6A 01408001
&PTYPE   SETA  3                       assume parameter type HEX   @L6A 01409001
         AIF   ('&PARATYPE(1)' EQ 'HEX').PTYP050  branch if HEX    @L6A 01410001
&PTYPE   SETA  4                       assume ALPHANUM             @L6A 01411001
         AIF   ('&PARATYPE(1)' EQ 'ALPHANUM').PTYP050     ALPHANUM @L6A 01412001
&PTYPE   SETA  5                       assume ALPHANUM*            @L6A 01413001
         AIF   ('&PARATYPE(1)' EQ 'ALPHANUM*').PTYP050   ALPHANUM* @L6A 01414001
&PTYPE   SETA  6                       assume parameter type YESNO @L6A 01415001
         AIF   ('&PARATYPE(1)' EQ 'YESNO').PTYP050        YESNO    @L6A 01416001
&PTYPE   SETA  7                       assume NAME                 @LDA 01417001
         AIF   ('&PARATYPE(1)' EQ 'NAME').PTYP050      NAME        @LDA 01418001
&PTYPE   SETA  8                       assume NAME*                @LDA 01419001
         AIF   ('&PARATYPE(1)' EQ 'NAME*').PTYP050   NAME*         @LDA 01420001
         AGO   .PTYPER3                go and report error         @L6A 01421001
.*                                                                      01422001
.PTYP050 ANOP                                                      @L6A 01423001
&PLEN    SETA  0                       set parameter value length  @L6A 01424001
&ML      SETA  1                       Set max length for subparameter *01425001
                                                                   @L6A 01426001
&MINVAL  SETA  1                       set minimum value           @L6A 01427001
&MAXVAL  SETA  9                       set maximum value           @L6A 01428001
.*                                                                      01429001
         AIF   ('&PARATYPE(2)' EQ '').PTYP100  branch if omitted   @L6A 01430001
         AIF   (K'&PARATYPE(2) GT &ML).PTYPER5 Number of digits    @L6A 01431001
.*                                                                      01432001
.*       Loop to validate each digit of the 2nd subparameter            01433001
.*                                                                      01434001
&I       SETA  1                      Point to 1st digit           @L6A 01435001
.PTYP060 ANOP                                                      @L6A 01436001
         AIF   ('&PARATYPE(2)'(&I,1) LT '0').PTYPER5  Not decimal  @L6A 01437001
         AIF   ('&PARATYPE(2)'(&I,1) GT '9').PTYPER5  Not decimal  @L6A 01438001
&I       SETA  &I+1                   Points to next digit         @L6A 01439001
         AIF   (&I LE K'&PARATYPE(2)).PTYP060    Check next digit  @L6A 01440001
.*                                                                      01441001
&PLEN    SETA  &PARATYPE(2)            set parameter value length  @L6A 01442001
.*                                                                      01443001
.PTYP100 ANOP                                                      @L6A 01444001
&MINVAL  SETA  &PLMIN(&PTYPE)          set minimum value           @L6A 01445001
&MAXVAL  SETA  &PLMAX(&PTYPE)          set maximum value           @L6A 01446001
         AIF   (&PLEN LT &MINVAL).PTYPER6                          @L6A 01447001
         AIF   (&PLEN GT &MAXVAL).PTYPER7                          @L6A 01448001
         AIF   (&PLEN GT 0).PTYP110    branch if specified         @L6A 01449001
&PLEN    SETA  &PLDFT(&PTYPE)          take default length         @L6A 01450001
.*                                                                      01451001
.PTYP110 ANOP                                                      @L6A 01452001
&PNDX    SETA  &PNDX+1                 Go to next subparameter     @LDA 01453001
         AIF   (N'&PARATYPE LT &PNDX).PTYPXT End of parm string    @LDA 01454001
         AIF   ('&PARATYPE(&PNDX)' EQ 'LIST').LIST10 LIST spec'd   @LDA 01455001
         AIF   ('&PARATYPE(&PNDX)' EQ 'RANGE').RNG10 RANGE spec'd  @LDA 01456001
         AGO   .PTYPER8                Invalid sublist specifier   @LDA 01457001
.LIST10  ANOP                          Process LIST keyword        @LDA 01458001
&PNDX    SETA   &PNDX+1                Next subparameter           @LDA 01459001
         AIF   (N'&PARATYPE LT &PNDX).PTYPER9 subparm missing      @LDA 01460001
         AIF   ('&PARATYPE(&PNDX)' EQ '').PTYPER9 subparm missing  @LDA 01461001
&FLAGS   SETA  &FLAGS+&LISTF           Indicate LIST given         @LDA 01462001
.*                                                                      01463001
.*       Loop to validate each digit of the next subparameter           01464001
.*                                                                      01465001
&I       SETA  1                       Point to first digit        @LDA 01466001
.PTYP115 ANOP                                                      @LDA 01467001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) LT '0').PTYPER5           @LDA 01468001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) GT '9').PTYPER5           @LDA 01469001
&I       SETA  &I+1                    Points to next digit        @LDA 01470001
         AIF   (&I LE K'&PARATYPE(&PNDX)).PTYP115                  @LDA 01471001
.*                                                                      01472001
&LIST    SETA  &PARATYPE(&PNDX)        Set list count              @LDA 01473001
         AGO   .PTYP110                Check for more supparms     @LDA 01474001
.RNG10   ANOP                          Process RANGE keyword       @LDA 01475001
&PNDX    SETA   &PNDX+1                Next subparameter           @LDA 01476001
&PNDX1   SETA   &PNDX+1                Next subparameter           @LDA 01477001
         AIF   (N'&PARATYPE LT &PNDX1).PTYPERA subparm missing     @LDA 01478001
         AIF   ('&PARATYPE(&PNDX)' EQ '').PTYPERA subparm missing  @LDA 01479001
         AIF   ('&PARATYPE(&PNDX1)' EQ '').PTYPERA subparm missing @LDA 01480001
&FLAGS   SETA  &FLAGS+&RNGF            Indicate RANGE given        @LDA 01481001
.*                                                                      01482001
.*       Loop to validate each digit of the next subparameter           01483001
.*                                                                      01484001
&I       SETA  1                       Point to first digit        @LDA 01485001
.PTYP125 ANOP                                                      @LDA 01486001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) LT '0').PTYPER5           @LDA 01487001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) GT '9').PTYPER5           @LDA 01488001
&I       SETA  &I+1                    Points to next digit        @LDA 01489001
         AIF   (&I LE K'&PARATYPE(&PNDX)).PTYP125                  @LDA 01490001
.*                                                                      01491001
&RNGMIN  SETA  &PARATYPE(&PNDX)        Set minimum range count     @LDA 01492001
&PNDX    SETA  &PNDX+1                 Goto next subparameter      @LDA 01493001
.*                                                                      01494001
.*       Loop to validate each digit of the next subparameter           01495001
.*                                                                      01496001
&I       SETA  1                       Point to first digit        @LDA 01497001
.PTYP135 ANOP                                                      @LDA 01498001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) LT '0').PTYPER5           @LDA 01499001
         AIF   ('&PARATYPE(&PNDX)'(&I,1) GT '9').PTYPER5           @LDA 01500001
&I       SETA  &I+1                    Points to next digit        @LDA 01501001
         AIF   (&I LE K'&PARATYPE(&PNDX)).PTYP135                  @LDA 01502001
.*                                                                      01503001
&RNGMAX  SETA  &PARATYPE(&PNDX)        Set maximum range count     @LDA 01504001
         AGO   .PTYP110                Check for more supparms     @LDA 01505001
.*                                                                      01506001
.PTYPER1 ANOP                                                      @L6A 01507001
         MNOTE 8,'PARATYPE PARAMETER MISSING - REQUIRED IN CONJUNCTION *01508001
               WITH UIM PRIVATE PARAMETER DEFINITION'              @L6A 01509001
         SPACE 2                                                   @L6A 01510001
         MEXIT                                                     @L6A 01511001
.*                                                                      01512001
.PTYPER2 ANOP                                                      @L6A 01513001
         MNOTE 8,'PARATYPE PARAMETER EXCEEDS 2 SUBLIST ENTRIES'    @L6A 01514001
         SPACE 2                                                   @L6A 01515001
         MEXIT                                                     @L6A 01516001
.*                                                                      01517001
.PTYPER3 ANOP                                                      @L6A 01518001
         MNOTE 8,'FIRST SUBPARAMETER OF PARATYPE PARAMETER IS INVALID' *01519001
                                                                   @L6A 01520001
         SPACE 2                                                   @L6A 01521001
         MEXIT                                                     @L6A 01522001
.*                                                                      01523001
.PTYPER4 ANOP                                                      @L6A 01524001
         MNOTE 8,'SECOND SUBPARAMETER OF PARATYPE EXCEEDS &ML DIGITS.' *01525001
                                                                   @L6A 01526001
         SPACE 2                                                   @L6A 01527001
         MEXIT                                                     @L6A 01528001
.*                                                                      01529001
.PTYPER5 ANOP                                                      @L6A 01530001
         MNOTE 8,'SUBPARAMETER &PNDX OF PARATYPE MUST BE A NUMBER FROM *01531001
               &MINVAL TO &MAXVAL.'                               @L6A  01532001
         SPACE 2                                                   @L6A 01533001
         MEXIT                                                     @L6A 01534001
.*                                                                      01535001
.PTYPER6 ANOP                                                      @L6A 01536001
         MNOTE 8,'SPECIFIED PARAMETER VALUE LENGTH LESS THAN &MINVAL.' *01537001
                                                                   @L6A 01538001
         SPACE 2                                                   @L6A 01539001
         MEXIT                                                     @L6A 01540001
.*                                                                      01541001
.PTYPER7 ANOP                                                      @L6A 01542001
         MNOTE 8,'SPECIFIED PARAMETER VALUE LENGTH GREATER THAN &MAXVAL*01543001
               .'                                                  @L6A 01544001
         SPACE 2                                                   @L6A 01545001
         MEXIT                                                     @L6A 01546001
.*                                                                      01547001
.PTYPER8 ANOP                                                      @LDA 01548001
         MNOTE 8,'SUBPARAMETER &PNDX OF PARATYPE MUST BE LIST OR RANGE.*01549001
               '                                                   @LDA 01550001
         SPACE 2                                                   @LDA 01551001
         MEXIT                                                     @LDA 01552001
.*                                                                      01553001
.PTYPER9 ANOP                                                      @LDA 01554001
         MNOTE 8,'LIST SUBPARAMETER OF PARATYPE MUST HAVE ADDITIONAL NU*01555001
               MERIC VALUE.'                                       @LDA 01556001
         SPACE 2                                                   @LDA 01557001
         MEXIT                                                     @LDA 01558001
.*                                                                      01559001
.PTYPERA ANOP                                                      @LDA 01560001
         MNOTE 8,'RANGE SUBPARAMETER OF PARATYPE MUST HAVE ADDITIONAL T*01561001
               WO VALUES.'                                         @LDA 01562001
         SPACE 2                                                   @LDA 01563001
         MEXIT                                                     @LDA 01564001
.*                                                                      01565001
.PTYPXT  ANOP                                                           01566001
.*                                                                      01567001
.*--------------------------------------------------------------------* 01568001
.*             Generate definitions for parameter                     * 01569001
.*--------------------------------------------------------------------* 01570001
.PARM300 ANOP                                                           01571001
&MTL     SETA  44                      Set maximum text length          01572001
&ALN     SETA  &MTL                    Set alignment length             01573001
         AIF   (&TL EQ 0).PARMER2      Text parameter not specified ?   01574001
.PARM350 ANOP                                                           01575001
         AIF   (&TL GT &MTL).PARMER3 TEXT parameter exceeds maximum     01576001
.*                                                                      01577001
.*       generate parameter description entry                           01578001
.*                                                                      01579001
&PARAC   SETA  &PARAC+1                increase parameter count         01580001
         DC    CL10'&PARAN'            Parameter name              @L6C 01581001
         DC    CL8'&HELPN'             Help member name                 01582001
         DC    AL2(&PID)               Parameter Identifier             01583001
         DC    AL1(&TL)                Length of PARA description       01584001
         DC    AL1(&FLAGS)             Parameter flags             @L6A 01585001
         DC    AL1(&PTYPE)             Parameter value type        @L6A 01586001
         DC    AL1(&PLEN)              Parameter value length      @L6A 01587001
         DC    AL1(&LIST)              Max number of parm values   @LDC 01588001
         DC    XL3'00'                 Reserved                    @LDA 01589001
         DC    AL4(&RNGMIN)            Minimum range value         @LDA 01590001
         DC    AL4(&RNGMAX)            Maximum range value         @LDA 01591001
         DC    XL4'00'                 Reserved                    @LDC 01592001
&SUB     SETA  1                       Initialize text array index      01593001
.PARM500 ANOP                                                           01594001
         AIF   ('&TTAB(&SUB)'(1,2) EQ 'X''').PARM520 hex notation       01595001
         DC    C&TTAB(&SUB)                                             01596001
         AGO   .PARM530                and continue                     01597001
.PARM520 ANOP                                                           01598001
         DC    &TTAB(&SUB)                                              01599001
.PARM530 ANOP                                                           01600001
&SUB     SETA  &SUB+1                  advance text array index         01601001
         AIF   (&SUB LE &TE).PARM500   all text elements processed ?    01602001
         DC    (&ALN-&TL)AL1(0)        Reserved                         01603001
.*                                                                      01604001
         SPACE 2                                                        01605001
         AIF   ('&SYSTEM' EQ 'MVS').MVSPRM9  Process MVS parameter @LDA 01606001
         ORG   UDDPARMC                                            @LDA 01607001
         DC    A(&PARAC)               Update count                @LDA 01608001
         ORG   ,                       Reset origin                @LDA 01609001
         SPACE 3                                                        01610001
.*                                                                      01611001
         AGO   .PARMXT                 And continue                @LDA 01612001
.MVSPRM9 ANOP                          MVS parameters              @LDA 01613001
         SPACE 2                                                        01614001
         ORG   UDDPARMC                                                 01615001
         DC    A(&PARAC)               Update count                     01616001
         ORG   ,                       Reset origin                     01617001
         SPACE 3                                                        01618001
.*                                                                      01619001
         AGO   .PARMXT                 and continue                     01620001
.*                                                                      01621001
.PARMER1 ANOP                                                           01622001
         MNOTE 8,'INVALID PARA PARAMETER'                               01623001
         SPACE 2                                                        01624001
         MEXIT                                                          01625001
.*                                                                      01626001
.PARMER2 ANOP                                                           01627001
         MNOTE 8,'TEXT PARAMETER MISSING - MANDATORY IN CONJUNCTION WIT*01628001
               H PARA PARAMETER'                                        01629001
         SPACE 2                                                        01630001
         MEXIT                                                          01631001
.*                                                                      01632001
.PARMER3 ANOP                                                           01633001
         MNOTE 8,'TEXT PARAMETER EXCEEDS &MTL CHARACTERS'               01634001
         SPACE 2                                                        01635001
         MEXIT                                                          01636001
.*                                                                      01637001
.PARMER4 ANOP                                                      @L6A 01638001
         MNOTE 8,'FIRST SUBPARAMETER OF PARA PARAMETER MISSING'    @L6A 01639001
         SPACE 2                                                   @L6A 01640001
         MEXIT                                                     @L6A 01641001
.*                                                                      01642001
.PARMER5 ANOP                                                      @L6A 01643001
         MNOTE 8,'SECOND SUBPARAMETER OF PARA PARAMETER MISSING'   @L6A 01644001
         SPACE 2                                                   @L6A 01645001
         MEXIT                                                     @L6A 01646001
.*                                                                      01647001
.PARMER6 ANOP                                                      @L6A 01648001
         MNOTE 8,'PARAMETER IDENTIFIER MUST BE NUMERIC FROM 33 TO 64'  *01649001
                                                                   @L6A 01650001
         SPACE 2                                                   @L6A 01651001
         MEXIT                                                     @L6A 01652001
.*                                                                      01653001
.PARMXT  ANOP                                                           01654001
.*                                                                      01655001
.********************************************************************** 01656001
.*             handle MID=   Parameter                                * 01657001
.********************************************************************** 01658001
.MID00   ANOP                                                           01659001
         AIF   ('&MID' EQ '').MIDXT    Branch if not specified          01660001
&P       SETC  'MID'                   Handling MID parameter           01661001
         AIF   ('&CUR' EQ 'M').MID10   Are we generating the message   *01662001
                                       list ?                           01663001
         AIF   (&MSW).MACER1           We have already built the       *01664001
                                       Message List                     01665001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *01666001
                                       not been gen'ed yet              01667001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*01668001
                                       parameter ?                      01669001
.MID10   ANOP                                                           01670001
&PP      SETC  '&P'                    We are now processing MID=       01671001
&CUR     SETC  'M'                     Show that we are now generating *01672001
                                       the message list                 01673001
         AIF   (&MSW).MID20            Branch if header has been gen'ed 01674001
         SPACE 5                                                        01675001
         ORG   UDDMSGP                 Set origin                       01676001
         DC    A(UDDMSGL)              Point to begin of message list   01677001
         ORG   ,                       Reset origin                     01678001
         SPACE 2                                                        01679001
*********************************************************************** 01680001
*                                                                     * 01681001
*              Message List                                           * 01682001
*                                                                     * 01683001
*********************************************************************** 01684001
         SPACE 1                                                        01685001
UDDMSGL  DS    0F                      Start of message list            01686001
.*                                                                      01687001
&MSW     SETB  1                       Indicate that we have gen'ed the*01688001
                                       header                           01689001
.MID20   ANOP                          validate MID parameter           01690001
&ML      SETA  8                       Set maximum length of MID        01691001
&MTL     SETA  120                     Set maximum text length          01692001
&ALN     SETA  &MTL                    Set alignment length             01693001
         AIF   (K'&MID GT &ML).MIDER1  MID exceeds maximum length       01694001
         AIF   (&TL EQ 0).MIDER2       Text parameter not specified ?   01695001
.MID25   ANOP                                                           01696001
         AIF   (&TL GT &MTL).MIDER3    TEXT parameter exceeds maximum   01697001
.*                                                                      01698001
.*       generate Message List Entry                                    01699001
.*                                                                      01700001
&MSGC    SETA  &MSGC+1                 increase message count           01701001
         DC    AL2(&PID)               Parameter that message is       *01702001
                                       associated with                  01703001
         DC    CL8'&HELPN'             Help member name                 01704001
         DC    AL1(&TL+8+1)            Length of message (incl ID)      01705001
         DC    CL8'&MID'               Message identifier               01706001
         DC    C' '                    Delimiter, always blank          01707001
&SUB     SETA  1                       Initialize text array index      01708001
.MID50   ANOP                                                           01709001
         AIF   ('&TTAB(&SUB)'(1,2) EQ 'X''').MID60  hex notation        01710001
         DC    C&TTAB(&SUB)                                             01711001
         AGO   .MID70                  and continue                     01712001
.MID60   ANOP                                                           01713001
         DC    &TTAB(&SUB)                                              01714001
.MID70   ANOP                                                           01715001
&SUB     SETA  &SUB+1                  advance text array index         01716001
         AIF   (&SUB LE &TE).MID50     all text elements processed ?    01717001
         DC    (&ALN-&TL)AL1(0)        Reserved                         01718001
.*                                                                      01719001
         SPACE 2                                                        01720001
         ORG   UDDMSGC                                                  01721001
         DC    A(&MSGC)                Update count                     01722001
         ORG   ,                       Reset origin                     01723001
         SPACE 3                                                        01724001
.*                                                                      01725001
         AGO   .MIDXT                  and continue                     01726001
.*                                                                      01727001
.MIDER1  ANOP                                                           01728001
         MNOTE 8,'MID PARAMETER EXCEEDS &ML CHARACTERS'                 01729001
         SPACE 2                                                        01730001
         MEXIT                                                          01731001
.*                                                                      01732001
.MIDER2  ANOP                                                           01733001
         MNOTE 8,'TEXT PARAMETER MISSING - MANDATORY IN CONJUNCTION WIT*01734001
               H MID PARAMETER'                                         01735001
         SPACE 2                                                        01736001
         MEXIT                                                          01737001
.*                                                                      01738001
.MIDER3  ANOP                                                           01739001
         MNOTE 8,'TEXT PARAMETER EXCEEDS &MTL CHARACTERS'               01740001
         SPACE 2                                                        01741001
         MEXIT                                                          01742001
.*                                                                      01743001
.MIDXT  ANOP                                                            01744001
.*                                                                      01745001
.********************************************************************** 01746001
.*             handle DEVICE= and MODEL= Parameter                    * 01747001
.********************************************************************** 01748001
.DEV00   ANOP                                                           01749001
         AIF   ('&DEVICE' EQ '').DEVXT   Branch if not specified        01750001
&P       SETC  'DEVICE'                Handling DEVICE parameter        01751001
         AIF   ('&CUR' EQ 'H').DEV10   Are we generating the help panel*01752001
                                       overwrite table                  01753001
         AIF   (&DSW).MACER1           We have already built the help  *01754001
                                       panel overwrite table            01755001
         AIF   (NOT &FIRST).MACER1     The first part of the UDT has   *01756001
                                       not been gen'ed yet              01757001
         AIF   ('&PP' NE '').MACER2    Are we already process'g another*01758001
                                       parameter ?                      01759001
.DEV10   ANOP                                                           01760001
&PP      SETC  '&P'                    We are now processing DEVICE=    01761001
&CUR     SETC  'H'                     Show that we are now generating *01762001
                                       the help panel overwrite table   01763001
         AIF   (&DSW).DEV20            Branch if header has been gen'ed 01764001
         SPACE 5                                                        01765001
         AIF   ('&SYSTEM' EQ 'MVS').MVSHOP0  Process MVS help      @LDA 01766001
&DEVC    SETA  0                       Clear count                 @LDA 01767001
         ORG   UDDHPOP                 Set origin                  @LDA 01768001
         DC    A(UDDVHOT)              Point to begin of help panel    *01769001
                                       overwrite table             @LDA 01770001
         ORG   ,                       Reset origin                     01771001
         SPACE 2                                                        01772001
*********************************************************************** 01773001
*                                                                     * 01774001
*        Help panel overwrite table for VM                            * 01775001
*                                                                     * 01776001
*********************************************************************** 01777001
         SPACE 1                                                        01778001
UDDVHOT  DS    0F                      Start of help panel overwrite   *01779001
                                       table                       @LDA 01780001
.*                                                                      01781001
&DSW     SETB  1                       Indicate that we have gen'ed the*01782001
                                       header                      @LDA 01783001
         AGO   .DEV20                  Process HOT                 @LDA 01784001
.*                                                                      01785001
.MVSHOP0 ANOP                          MVS Help Overwrite Table    @LDA 01786001
&DEVC    SETA  0                       Clear count                 @LDA 01787001
         ORG   UDDHPOP                 Set origin                       01788001
         DC    A(UDDHPOT)              Point to begin of help panel    *01789001
                                       overwrite table                  01790001
         ORG   ,                       Reset origin                     01791001
         SPACE 2                                                        01792001
*********************************************************************** 01793001
*                                                                     * 01794001
*        Help panel overwrite table for device specific help          * 01795001
*                                                                     * 01796001
*********************************************************************** 01797001
         SPACE 1                                                        01798001
UDDHPOT  DS    0F                      Start of help panel overwrite   *01799001
                                       table                            01800001
.*                                                                      01801001
&DSW     SETB  1                       Indicate that we have gen'ed the*01802001
                                       header                           01803001
.DEV20   ANOP                          validate DEVICE parameter        01804001
&ML      SETA  8                       Set maximum length of DEVICE     01805001
         AIF   (K'&DEVICE GT &ML).DEVER1  DEVICE parametertoo large ?   01806001
.*                                                                      01807001
.*             Validate MODEL= Parameter                                01808001
.*                                                                      01809001
.DEV30   ANOP                          validate MODEL parameter         01810001
&ML      SETA  4                       Set maximum length of MODEL      01811001
         AIF   (K'&MODEL GT &ML).DEVER2  MODEL parameter too large ?    01812001
.*                                                                      01813001
.*       Generate Help panel overwrite table entry                      01814001
.*                                                                      01815001
&DEVC    SETA  &DEVC+1                 increase number of elements in  *01816001
                                       help panel overwrite table       01817001
         DC    CL8'&DEVICE'            Unit name of device              01818001
         AIF   ('&MODEL' EQ '').DEV35    Branch if not specified        01819001
         DC    CL4'&MODEL'             Model name of device             01820001
         AGO   .DEV40               and continue                        01821001
.DEV35   ANOP                                                           01822001
         DC    XL4'00'                 No model specified               01823001
.DEV40   ANOP                                                           01824001
         DC    AL1(&HOT)               Indicate kind of overwrite       01825001
         DC    C' '                    Reserved                         01826001
         DC    AL2(&PID)               Parameter/feature or special id *01827001
                                       the help is associated with      01828001
         DC    CL8'&HELPN'             Help member name                 01829001
.*                                                                      01830001
         SPACE 2                                                        01831001
         AIF   ('&SYSTEM' EQ 'MVS').MVSHOP9  Process MVS help      @LDA 01832001
         ORG   UDDHPOC                 Set origin                  @LDA 01833001
         DC    A(&DEVC)                Update count                @LDA 01834001
         ORG   ,                       Reset origin                     01835001
         SPACE 3                                                        01836001
         AGO   .DEVXT                  and continue                @LDA 01837001
.MVSHOP9 ANOP                          MVS Helps                   @LDA 01838001
         ORG   UDDHPOC                 Set origin                       01839001
         DC    A(&DEVC)                Update count                @LDA 01840001
         ORG   ,                       Reset origin                     01841001
         SPACE 3                                                        01842001
.*                                                                      01843001
         AGO   .DEVXT                  and continue                     01844001
.*                                                                      01845001
.*                                                                      01846001
.DEVER1  ANOP                                                           01847001
         MNOTE 8,'DEVICE PARAMETER EXCEEDS &ML CHARACTERS'              01848001
         SPACE 2                                                        01849001
         MEXIT                                                          01850001
.*                                                                      01851001
.DEVER2  ANOP                                                           01852001
         MNOTE 8,'MODEL PARAMETER EXCEEDS &ML CHARACTERS'               01853001
         SPACE 2                                                        01854001
         MEXIT                                                          01855001
.*                                                                      01856001
.DEVXT  ANOP                                                            01857001
.*                                                                      01858001
         AGO   .DONE                   Go and exit macro                01859001
.*                                                                      01860001
.MACER1  ANOP                                                           01861001
         SPACE 2                                                        01862001
         MNOTE 12,'MACRO SEQUENCE ERROR'                                01863001
         SPACE 2                                                        01864001
         MEXIT                                                          01865001
.*                                                                      01866001
.MACER2  ANOP                                                           01867001
         SPACE 2                                                        01868001
         MNOTE 12,'&P PARAMETER MUTUALLY EXCLUSIVE WITH &PP PARAMETER'  01869001
         SPACE 2                                                        01870001
         MEXIT                                                          01871001
.*                                                                      01872001
.*                                                                      01873001
.********************************************************************** 01874001
.*             Exit                                                   * 01875001
.********************************************************************** 01876001
.DONE    ANOP                                                           01877001
         MEND                          end of ASSEMBLER macro        */ 01878001
*/*---------------- PLAS version follows ----------------------------*/ 01879001
*%UDT001: ;                                                             01880001
*@EJECT;                                                                01881001
*/********************************************************************/ 01882001
*/*                                                                  */ 01883001
*/*   UIM Data Table (UDT)                                           */ 01884001
*/*                                                                  */ 01885001
*/*****************************************************************WS*/ 01886001
*@SPACE (1);                                                            01887001
*%UDT01:;                                                               01888001
*DECLARE                                                                01889001
*%IF UDTDEF='' %THEN                                                    01890001
*  %GOTO UDT100;                                                        01891001
* 1 UDT UDTDEF,                     /* UIM Data Table (UDT)          */ 01892001
*  %GOTO UDT110;                                                        01893001
*%UDT100: ;                                                             01894001
* 1 UDT BASED,                      /* UIM Data Table (UDT)          */ 01895001
*%UDT110: ;                                                             01896001
*  3 UDTID     CHAR(4),             /* UIM Data Table ('UDT ')       */ 01897001
*  3 UDTVER    CHAR(1),             /* UDT Version number            */ 01898001
*  3 *         CHAR(3),             /* Reserved must be zero         */ 01899001
*  3 UDTCSECT  CHAR(8),             /* Name of UDT (CSECT name)      */ 01900001
*  3 UDTDATE   CHAR(8),             /* Date of assembly (dd/mm/yy)   */ 01901001
*  3 UDTUDESC  FIXED(31),           /* Count of unit descriptions in    01902001
*                                      list                          */ 01903001
*  3 UDTUDESP  PTR(31),             /* Pointer to list of descriptions  01904001
*                                      of units supported by            01905001
*                                      associated UIM                */ 01906001
*  3 UDTPARMC  FIXED(31),           /* Count of parameter descriptions  01906101
*                                      in list                       */ 01906201
*  3 UDTPARMP  PTR(31),             /* Pointer to list of descriptions  01906301
*                                      of parameters for devices        01906401
*                                      supported by the associated      01906501
*                                      UIM                           */ 01906601
*  3 UDTFEATC  FIXED(31),           /* Count of features in list     */ 01906701
*  3 UDTFEATP  PTR(31),             /* Pointer to list of feature       01906801
*                                      names and descriptions for       01906901
*                                      devices supported by the         01907001
*                                      associated UIM                */ 01907101
*  3 UDTCOMPC  FIXED(31),           /* Count of features recognized     01907201
*                                      for compatability reasons     */ 01907301
*  3 UDTCOMPP  PTR(31),             /* Optional pointer to 10 byte      01907401
*                                      feature names recognized by      01907501
*                                      this UIM for migration           01907601
*                                      compatability                 */ 01907701
*  3 UDTMSGC   FIXED(31),           /* Count of messages issued by      01907801
*                                      associated UIM                */ 01908001
*  3 UDTMSGP   PTR(31),             /* Pointer to messages issued by    01909001
*                                      associated UIM                */ 01910001
*  3 UDTDDESP  PTR(31),             /* Pointer to UIM description    */ 01911001
*  3 UDTHPOC   FIXED(31),           /* Count of entries in help panel   01911501
*                                      overwrite table for device       01912001
*                                      specific help                 */ 01912501
*  3 UDTHPOP   PTR(31),             /* Pointer to help panel overwrite  01913001
*                                      table for device specific help*/ 01913501
*  3 *         CHAR(52),            /* Reserved                  @LDA*/ 01914001
*  3 UDTEND    CHAR(0);             /* End of the UDT                */ 01915001
*@EJECT;                                                                01916001
*/********************************************************************/ 01917001
*/*                                                                  */ 01918001
*/*  UIM  Description                                                */ 01919001
*/*                                                                  */ 01920001
*/********************************************************************/ 01921001
*@SPACE;                                                                01922001
*DECLARE                                                                01923001
* 1 UDTDDES BASED(UDTDDESP),        /* UIM  description              */ 01924001
*   3 UDTDUIM  CHAR(8),             /* Name of UIM                   */ 01925001
*   3 UDTDLEN  FIXED(8),            /* Length of UIM  description    */ 01926001
*   3 UDTDTXT  CHAR(60);            /* UIM  description text         */ 01927001
*@SPACE(2);                                                             01928001
*/********************************************************************/ 01929001
*/*                                                                  */ 01930001
*/*  Unit Description                                                */ 01931001
*/*                                                                  */ 01932001
*/********************************************************************/ 01933001
*@SPACE;                                                                01934001
*DECLARE                                                                01935001
* 1 UDTUDES(*) BASED(UDTUDESP),     /* Unit description              */ 01936001
*   3 UDTUINDX FIXED(8),            /* Unit description index        */ 01937001
*   3 UDTULEN  FIXED(8),            /* Length of unit description    */ 01938001
*   3 UDTUHELP CHAR(8),             /* Name of Help member associated   01939001
*                                      with this unit                */ 01940001
*   3 UDTUTXT  CHAR(60);            /* Unit description text         */ 01941001
*@SPACE (2);                                                            01974001
*/********************************************************************/ 01975001
*/*                                                                  */ 01976001
*/*  Parameter Description                                           */ 01977001
*/*                                                                  */ 01978001
*/********************************************************************/ 01979001
*@SPACE;                                                                01980001
*DECLARE                                                                01981001
* 1 UDTPDES(*)  BASED(UDTPARMP),    /* Parameter description entry   */ 01982001
*   3 UDTPNAME CHAR(10),            /* Parameter name                */ 01983001
*   3 UDTPHELP CHAR(8),             /* Name of Help member associated   01984001
*                                      with the parameter            */ 01985001
*   3 UDTPID   FIXED(15),           /* Internal parameter id         */ 01986001
*   3 UDTPLEN  FIXED(8),            /* Parameter description length  */ 01987001
*   3 UDTPFLAG BIT(8),              /* Parameter flags           @L6A*/ 01988001
*     5 UDTPFDON BIT(1),            /* If on, the value of the          01989001
*                                      parameter is allowed to be       01990001
*                                      changed while device is in an    01991001
*                                      online state              @L6A*/ 01992001
*     5 *        BIT(3),            /* Reserved                  @LDA*/ 01993001
*     5 UDTPFLST BIT(1),            /* If 1, indicates that UDTPPCNT    01994001
*                                      has been set              @LDA*/ 01995001
*     5 UDTPFRNG BIT(1),            /* IF 1, indicates that a subrange  01996001
*                                      type has been specified   @LDA*/ 01997001
*     5 *        BIT(2),            /* Reserved                  @LDC*/ 01998001
*   3 UDTPTYPE FIXED(8),            /* Parameter type            @L6A*/ 01999001
*   3 UDTPPLEN FIXED(8),            /* Maximum parameter length  @L6A*/ 02000001
*   3 UDTPPCNT FIXED(8),            /* Maximum number of parameter      02001001
*                                      values                    @L6A*/ 02002001
*   3 *        CHAR(3),             /* Reserved                  @LDA*/ 02003001
*   3 UDTPPMIN BIN(31),             /* Minimum value of range type      02004001
*                                      parameter                 @LDA*/ 02005001
*   3 UDTPPMAX BIN(31),             /* Maximum value of range type      02006001
*                                      parameter                 @LDA*/ 02007001
*   3 *        CHAR(4),             /* Reserved                  @LDC*/ 02008001
*   3 UDTPTXT  CHAR(44);            /* Parameter description text    */ 02009001
*@SPACE (2);                                                            02010001
*/********************************************************************/ 02011001
*/*                                                                  */ 02012001
*/*  Feature Description                                             */ 02013001
*/*                                                                  */ 02014001
*/********************************************************************/ 02015001
*@SPACE;                                                                02016001
*DECLARE                                                                02017001
* 1 UDTFEATL(*) BASED(UDTFEATP),    /* Feature decription            */ 02018001
*   3 UDTFNAME CHAR(10),            /* Feature name                  */ 02019001
*   3 UDTFFLAG BIT(8),              /* Feature flags             @L6A*/ 02020001
*     5 UDTFFDON BIT(1),            /* If on, feature is allowed to be  02021001
*                                      changed while device is in an    02022001
*                                      online state              @L6A*/ 02023001
*     5 *        BIT(7),            /* Reserved                  @L6A*/ 02024001
*   3 *        CHAR(7),             /* Reserved                  @L6C*/ 02025001
*   3 UDTFHELP CHAR(8),             /* Name of Help member associated   02026001
*                                      with the feature              */ 02027001
*   3 UDTFINDX FIXED(8),            /* Feature description index     */ 02028001
*   3 UDTFLEN  FIXED(8),            /* Length of feature description */ 02029001
*   3 UDTFTXT  CHAR(44);            /* Feature description text      */ 02030001
*@SPACE (2);                                                            02031001
*DECLARE                                                                02032001
* UDTCOMPL(*) CHAR(10) BASED(UDTCOMPP); /* Compatible feature list   */ 02033001
*@SPACE (2);                                                            02034001
*/********************************************************************/ 02035001
*/*                                                                  */ 02036001
*/*  Message Description                                             */ 02037001
*/*                                                                  */ 02038001
*/********************************************************************/ 02039001
*@SPACE (1);                                                            02040001
*DECLARE                                                                02041001
* 1 UDTMSG(*) BASED(UDTMSGP),       /* Message description           */ 02042001
*   3 UDTMPARM FIXED(15),           /* IODEVICE parameter that message  02043001
*                                      is associated with            */ 02044001
*   3 UDTMHELP CHAR(8),             /* Name of Help member associated   02045001
*                                      with the message              */ 02046001
*   3 UDTMLEN  FIXED(8),            /* Length of message (incl MSGID)*/ 02047001
*   3 UDTMSGID CHAR(8),             /* Message ID                    */ 02048001
*   3 *        CHAR(1),             /* Delimiter, always blank       */ 02049001
*   3 UDTMTXT  CHAR(120);           /* Message text                  */ 02050001
*@EJECT;                                                                02051001
*/********************************************************************/ 02052001
*/*                                                                  */ 02053001
*/*  Help Panel Overwrite Table for device specific help             */ 02054001
*/*                                                                  */ 02055001
*/********************************************************************/ 02056001
*@SPACE;                                                                02057001
*DECLARE                                                                02058001
* 1 UDTHPO(*)  BASED(UDTHPOP),      /* Help panel overwrite table    */ 02059001
*   3 UDTHUNIT CHAR(8),             /* Device type of device for which  02060001
*                                      this help applies             */ 02061001
*   3 UDTHMODL CHAR(4),             /* Device model, contains binary    02062001
*                                      zero if model is not present  */ 02063001
*   3 UDTHTYPE FIXED(8),            /* Type of overwrite             */ 02064001
*   3 *        CHAR(1),             /* Reserved                      */ 02065001
*   3 UDTHID   FIXED(15),           /* Internal parameter, feature or   02066001
*                                      special identifier associated    02067001
*                                      with this help                */ 02068001
*   3 UDTHPNM  CHAR(8);             /* Help panel name               */ 02069001
*@SPACE (2);                                                            02070001
*/********************************************************************/ 02071001
*/*                                                                  */ 02072001
*/*  The following constants define the index in the array           */ 02073001
*/*  UDTSECTP to get the pointer of the OS dependent section.    @LDA*/ 02074001
*/*                                                                  */ 02075001
*/********************************************************************/ 02076001
*DECLARE                                                                02077001
* UDTMVS   FIXED(31) CONSTANT(1),   /* MVS                       @LDA*/ 02078001
* UDTVM    FIXED(31) CONSTANT(2);   /* VM                        @LDA*/ 02079001
*                                                           @SPACE (2); 02080001
*@SPACE (2);                                                            02081001
*/********************************************************************/ 02082001
*/*                                                                  */ 02083001
*/*  The following constants define the type of help overwrite       */ 02084001
*/*  used when setting field UDTHTYPE.                               */ 02085001
*/*                                                                  */ 02086001
*/********************************************************************/ 02087001
*DECLARE                                                                02088001
* UDTHTTP  FIXED(8) CONSTANT(1),    /* Parameter                     */ 02089001
* UDTHTTF  FIXED(8) CONSTANT(2),    /* Feature                       */ 02090001
* UDTHTTS  FIXED(8) CONSTANT(3);    /* Special                       */ 02091001
*                                                           @SPACE (2); 02092001
*/********************************************************************/ 02093001
*/*                                                                  */ 02094001
*/*  The following constants identify the parameter data type. These */ 02095001
*/*  values are set in field UDTPTYPE in the UDTPDES entries         */ 02096001
*/*                                                                  */ 02097001
*/********************************************************************/ 02098001
*DECLARE                                                                02099001
* UDTPCHAR FIXED(8) CONSTANT(1),    /* Character data            @L6A*/ 02100001
* UDTPDEC  FIXED(8) CONSTANT(2),    /* Decimal   data            @L6A*/ 02101001
* UDTPHEX  FIXED(8) CONSTANT(3),    /* Hexadecimal data          @L6A*/ 02102001
* UDTPANUM  FIXED(8) CONSTANT(4),   /* Alphanumeric data         @L6A*/ 02103001
* UDTPANUX  FIXED(8) CONSTANT(5),   /* Alphanumeric data or "*"  @L6A*/ 02104001
* UDTPYN  FIXED(8) CONSTANT(6),     /* YES / NO                  @LDC*/ 02105001
* UDTPNAMC FIXED(8) CONSTANT(7),    /* Name                      @LDA*/ 02106001
* UDTPNAMX FIXED(8) CONSTANT(8);    /* Name or "*"               @LDA*/ 02107001
*                                                           @SPACE (2); 02108001
*/********************************************************************/ 02109001
*/*                                                                  */ 02110001
*/*  The following constants identify the lowest and highest         */ 02111001
*/*  possible parameter ID in the UDTPID entry.                      */ 02112001
*/*                                                                  */ 02113001
*/********************************************************************/ 02114001
*DECLARE                                                                02115001
* UDTPLO   FIXED(15) CONSTANT(33),  /* Lowest possible param.id  @L6A*/ 02116001
* UDTPHI   FIXED(15) CONSTANT(64);  /* Highest possible param.id @L6A*/ 02117001
*                                                           @SPACE (2); 02118001
*/********************************************************************/ 02119001
*/*                                                                  */ 02120001
*/*  The following constants identify the special type of the help   */ 02121001
*/*  overwrite entry when UDTHTYPE = UDTHTTS.                        */ 02122001
*/*                                                                  */ 02123001
*/********************************************************************/ 02124001
*DECLARE                                                                02125001
* UDTHSDNH FIXED(8) CONSTANT(1),    /* Device number help            */ 02126001
* UDTHSDRH FIXED(8) CONSTANT(2),    /* Number of devices help        */ 02127001
* UDTHSDTH FIXED(8) CONSTANT(3),    /* Device type   help            */ 02128001
* UDTHSUAH FIXED(8) CONSTANT(4);    /* Unit address  help            */ 02129001
*@EJECT;                                                                02130001
*/********************************************************************/ 02131001
*/*                                                                  */ 02132001
*/*  The following constants define the various MVS parameters.      */ 02133001
*/*  The identifier assigned to the parameter corresponds to the     */ 02134001
*/*  flag definitions in IODVPRMS in the CBDZIODV macro.             */ 02135001
*/*                                                                  */ 02136001
*/********************************************************************/ 02137001
*@SPACE (2);                                                            02138001
*DECLARE                                                                02139001
* UDTPADP FIXED(15) CONSTANT(1),    /* ADAPTER parameter             */ 02140001
* UDTPDEV FIXED(15) CONSTANT(2),    /* ADDRESS parameter             */ 02141001
* UDTPEXP FIXED(15) CONSTANT(3),    /* EXPBFR  parameter             */ 02142001
* UDTPFEA FIXED(15) CONSTANT(4),    /* FEATURE parameter             */ 02143001
* UDTPGCU FIXED(15) CONSTANT(5),    /* Reserved                      */ 02144001
* UDTPMOD FIXED(15) CONSTANT(6),    /* MODEL parameter               */ 02145001
* UDTPNUM FIXED(15) CONSTANT(7),    /* NUMSECT parameter             */ 02146001
* UDTPOFF FIXED(15) CONSTANT(8),    /* OFFLINE parameter             */ 02147001
* UDTPPCU FIXED(15) CONSTANT(9),    /* PCU parameter                 */ 02148001
* UDTPSET FIXED(15) CONSTANT(10),   /* SETADDR parameter             */ 02149001
* UDTPTCU FIXED(15) CONSTANT(11),   /* TCU parameter                 */ 02150001
* UDTPUNI FIXED(15) CONSTANT(12),   /* UNIT parameter                */ 02151001
* UDTPDYN FIXED(15) CONSTANT(13),   /* DYNAMIC  parameter            */ 02152001
* UDTPOWN FIXED(15) CONSTANT(14),   /* OWNER    parameter        @N6C*/ 02152601
* UDTPLOC FIXED(15) CONSTANT(15);   /* LOCANY   parameter        @N6A*/ 02153201
*@SPACE (2);                                                            02154001
*/********************************************************************/ 02155001
*/*                                                                  */ 02156001
*/*  The following constants define the various VM  parameters.      */ 02157001
*/*  The identifier assigned to the parameter corresponds to the     */ 02158001
*/*  flag definitions in IODVPRMS in the CBDZIODV macro.             */ 02159001
*/*                                                                  */ 02160001
*/********************************************************************/ 02161001
*@SPACE (2);                                                            02162001
*DECLARE                                                                02163001
* UDTV_ADAPTER FIXED(15) CONSTANT(1),  /* ADAPTER parameter      @LDA*/ 02164001
* UDTV_AFP     FIXED(15) CONSTANT(2),  /* AFP parameter          @LDA*/ 02165001
* UDTV_BASEADD FIXED(15) CONSTANT(3),  /* BASEADD parameter      @LDA*/ 02166001
* UDTV_CHARS   FIXED(15) CONSTANT(4),  /* CHARS parameter        @LDA*/ 02167001
* UDTV_CLASS   FIXED(15) CONSTANT(5),  /* CLASS parameter        @LDA*/ 02168001
* UDTV_CPNAME  FIXED(15) CONSTANT(6),  /* CPNAME parameter       @LDA*/ 02169001
* UDTV_DEST    FIXED(15) CONSTANT(7),  /* DEST parameter         @LDA*/ 02170001
* UDTV_DPMSIZE FIXED(15) CONSTANT(8),  /* DPMSIZE parameter      @LDA*/ 02171001
* UDTV_FCB     FIXED(15) CONSTANT(9),  /* FCB parameter          @LDA*/ 02172001
* UDTV_FLASH   FIXED(15) CONSTANT(10), /* FLASH parameter        @LDA*/ 02173001
* UDTV_FOLD    FIXED(15) CONSTANT(11), /* FOLD parameter         @LDA*/ 02174001
* UDTV_FORM    FIXED(15) CONSTANT(12), /* FORM parameter         @LDA*/ 02175001
* UDTV_IMAGE   FIXED(15) CONSTANT(13), /* IMAGE parameter        @LDA*/ 02176001
* UDTV_INDEX   FIXED(15) CONSTANT(14), /* INDEX parameter        @LDA*/ 02177001
* UDTV_MODEL   FIXED(15) CONSTANT(15), /* MODEL parameter        @LDA*/ 02178001
* UDTV_OFFLINE FIXED(15) CONSTANT(16), /* OFFLINE parameter      @LDA*/ 02179001
* UDTV_SEP     FIXED(15) CONSTANT(17), /* SEP parameter          @LDA*/ 02180001
* UDTV_SETADDR FIXED(15) CONSTANT(18), /* SETADDR parameter      @LDA*/ 02181001
* UDTV_SHARED  FIXED(15) CONSTANT(19), /* SHARED parameter       @LDA*/ 02182001
* UDTV_UIRATE  FIXED(15) CONSTANT(20); /* UIRATE parameter       @LDA*/ 02183001
*@SPACE (2);                                                            02184001
*/********************************************************************/ 02185001
*/*                                                                  */ 02186001
*/*  The following constants define the various VM  features.        */ 02187001
*/*  The identifier assigned to the features  corresponds to the     */ 02188001
*/*  flag definitions in IODVFEAT in the CBDZIODV macro.             */ 02189001
*/*                                                                  */ 02190001
*/********************************************************************/ 02191001
*@SPACE (2);                                                            02192001
*DECLARE                                                                02193001
* UDTF_CONV     FIXED(15) CONSTANT(1),     /* feature CONV       @LDA*/ 02194001
* UDTF_DUALDENS FIXED(15) CONSTANT(2),     /* feature DUALDENS   @LDA*/ 02195001
* UDTF_EMUL3270 FIXED(15) CONSTANT(3),     /* feature EMUL3270   @LDA*/ 02196001
* UDTF_E3270HLD FIXED(15) CONSTANT(4),     /* feature E3270HLD   @LDA*/ 02197001
* UDTF_OPRDR    FIXED(15) CONSTANT(5),     /* feature OPRDR      @LDA*/ 02198001
* UDTF_TRANS    FIXED(15) CONSTANT(6),     /* feature TRANS      @LDA*/ 02199001
* UDTF_UNVCHSET FIXED(15) CONSTANT(7),     /* feature UNVCHSET   @LDA*/ 02200001
* UDTF_4WCGMS   FIXED(15) CONSTANT(8),     /* feature 4WCGMS     @LDA*/ 02201001
* UDTF_7_TRACK  FIXED(15) CONSTANT(9),     /* feature 7-TRACK    @LDA*/ 02201501
* UDTF_DPS      FIXED(15) CONSTANT(10),    /* feature DPS        @LDA*/ 02202001
* UDTF_RESERVE  FIXED(15) CONSTANT(11);    /* feature RESERVE    @LDA*/ 02202501
*@SPACE (2);                                                            02203001
*/********************************************************************/ 02204001
*/*                                                                  */ 02205001
*/*  The following constants define the VM RDEVCLASS constants.      */ 02206001
*/*  They correspond to the RDEV CLASS values in the HCPDVTY macro.  */ 02207001
*/*                                                                  */ 02208001
*/********************************************************************/ 02209001
*@SPACE (2);                                                            02210001
*DECLARE                                                                02211001
* 1 UDTCLDEF STATIC LOCAL,                                              02212001
*   3 *,                                                                02213001
*     5 UDTCTERM BIT(8) INIT('80'X),           /* Class TERMINAL @LDA*/ 02214001
*     5 UDTDTERM CHAR(16) INIT('TERMINAL'),    /* Description    @LDA*/ 02215001
*   3 *,                                                                02216001
*     5 UDTCGRAF BIT(8) INIT('40'X),           /* Class GRAPHIC  @LDA*/ 02217001
*     5 UDTDGRAF CHAR(16) INIT('GRAPHIC'),     /* Description    @LDA*/ 02218001
*   3 *,                                                                02219001
*     5 UDTCGRFR BIT(8) INIT('41'X),           /* Class REMOTE          02220001
*                                                 GRAPHIC        @LDA*/ 02221001
*     5 UDTDGRFR CHAR(16) INIT('REMOTE GRAPHIC'), /*                    02222001
*                                                 Description    @LDA*/ 02223001
*   3 *,                                                                02224001
*     5 UDTCSPOL BIT(8) INIT('20'X),           /* Class SPOOL    @LDA*/ 02225001
*     5 UDTDSPOL CHAR(16) INIT('SPOOL'),       /* Description    @LDA*/ 02226001
*   3 *,                                                                02227001
*     5 UDTCTAPE BIT(8) INIT('08'X),           /* Class TAPE     @LDA*/ 02228001
*     5 UDTDTAPE CHAR(16) INIT('TAPE'),        /* Description    @LDA*/ 02229001
*   3 *,                                                                02230001
*     5 UDTCDASD BIT(8) INIT('04'X),           /* Class DASD     @LDA*/ 02231001
*     5 UDTDDASD CHAR(16) INIT('DASD'),        /* Description    @LDA*/ 02232001
*   3 *,                                                                02233001
*     5 UDTCSPEC BIT(8) INIT('02'X),           /* Class SPECIAL  @LDA*/ 02234001
*     5 UDTDSPEC CHAR(16) INIT('SPECIAL');     /* Description    @LDA*/ 02235001
*@SPACE (2);                                                            02236001
* DECLARE                                                               02237001
*   1 UDTCLASS(*) BASED(ADDR(UDTCLDEF)),                                02238001
*     3 *,                                                              02239001
*       5 UDTCLCOD BIT(8),                                              02240001
*       5 UDTCLDES CHAR(16);                                            02241001
*@SPACE (2);                                                            02242001
*%DEACT UDTDEF;                                                         02243001
