         TITLE 'HCD UIM/PIT-RELATED HELP MACRO LISTING -- CBDZHELP'     00050001
*/****  START OF SPECIFICATIONS  *************************************/ 00100001
*/*                                                                  */ 00150001
*/*  ACRONYM:  CBDZHELP                                              */ 00178500
*/*  EXTERNAL CLASSIFICATION:  PSPI                                  */ 00207000
*/*  END OF EXTERNAL CLASSIFICATION                                  */ 00235500
*/*  MACRO NAME:  CBDZHELP                                           */ 00264000
*/*  DSECT NAME:  HELP                                               */ 00292500
*/*  DESCRIPTIVE NAME = Generate help panels                         */ 00321000
*/*                                                                  */ 00350001
*/*  PROPRIETARY STATEMENT =                                         */ 00400001
*/*                                                                  */ 00450001
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00500001
*/*     THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                  */ 00550001
*/*     5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                  */ 00600003
*/*                                                                  */ 00700001
*/*  STATUS = HCS6091                                                */ 00750003
*/*                                                                  */ 00800001
*/*01*  FUNCTION =                                                   */ 00850001
*/*       CBDZHELP contains the macros needed to generate            */ 00900001
*/*       a UIM/PIT-related help panel for the HCD.                  */ 00950001
*/*        o  HDR macro - to generate the header of a PIT/UIM related*/ 01000001
*/*                       help member                                */ 01050001
*/*        o  TXT macro - to generate a text line in the help member */ 01100001
*/*        o  RP  macro - to generate an entry in the reference      */ 01150001
*/*                       phrase array of a PIT/UIM related help     */ 01200001
*/*                       member                                     */ 01250001
*/*                                                                  */ 01300001
*/*02*    OPERATION =                                                */ 01350001
*/*                                                                  */ 01400001
*/*01*  NOTES =                                                      */ 01450001
*/*                                                                  */ 01500001
*/*02*    DEPENDENCIES = Each macro has its own dependencies         */ 01550001
*/*                                                                  */ 01600001
*/*02*    RESTRICTIONS =                                             */ 01650001
*/*                                                                  */ 01700001
*/*01*  MODULE TYPE = BAL MACROS                                     */ 01750001
*/*                                                                  */ 01800001
*/*02*    PROCESSOR = ASSEMBLER-H                                    */ 01850001
*/*                                                                  */ 01900001
*/*02*    INVOCATION = See prologue of each macro                    */ 01950001
*/*                                                                  */ 02000001
*/*                                                                  */ 02050001
*/*01*  CHANGE ACTIVITY =                                            */ 02100001
*/*                                                                  */ 02150001
*/*    $L0= HCD,  HCSH101 900420 BOEB: Hardware Configuration Dialog */ 02200001
*/*                                                                  */ 02250001
*/**** END OF SPECIFICATIONS *****************************************/ 02300001
*/*                                                                  */ 02350001
         TITLE 'Header Macro'                                           02400001
         MACRO                                                          02450001
&SYMBOL  HDR   &NAME=,&TITLE=,&DESC=,&WIDTH=60,                        *02500001
               &HIGHLI=,&RPDLM=,&FORMAT=                                02550001
         AGO   .SKIP                                                    02600001
*/********************************************************************/ 02650001
*/*                                                                  */ 02700001
*/*01*  MACRO NAME = HDR                                             */ 02750001
*/*                                                                  */ 02800001
*/*02*  DESCRIPTIVE NAME = UIM/PIT Help Header Macro                 */ 02850001
*/*                                                                  */ 02900001
*/*01*  MACRO CALL =                                                 */ 02950001
*/*       LABEL HDR    NAME=    name of help member                  */ 03000001
*/*                    TITLE=   title for assembler listing          */ 03050001
*/*                    DESC=    description or copyright info        */ 03100001
*/*                    WIDTH=   width of help window (53, 60 or 70)  */ 03150001
*/*                    FORMAT=  data format of text lines            */ 03200001
*/*                    HIGHLI=  highlight option for title line      */ 03250001
*/*                    RPDLM=   reference phrase delimiters          */ 03300001
*/*                                                                  */ 03350001
*/*01*  FUNCTION = The HDR macro is used to generate the header of   */ 03400001
*/*                a UIM/PIT-related help member.                    */ 03450001
*/*                                                                  */ 03500001
*/*01*  NOTES =  The HDR statement must preceed all RP and TXT       */ 03550001
*/*              statements in the help member.                      */ 03600001
*/*                                                                  */ 03650001
*/*02*    DEPENDENCIES = None.                                       */ 03700001
*/*                                                                  */ 03750001
*/*02*    RESTRICTIONS = For UIM/PIT-related help members only       */ 03800001
*/*                                                                  */ 03850001
*/*01*  INPUT :                                                      */ 03900001
*/*            NAME=     Name of help member. This name will be      */ 03950001
*/*                      used as the CSECT name of the help member   */ 04000001
*/*            TITLE=    title for assembler listing (the title      */ 04050001
*/*                      must be enclosed in apostrophes)            */ 04100001
*/*            DESC=     1 to 255 character description (such as     */ 04150001
*/*                      a copyright statement) that is to appear    */ 04200001
*/*                      within the help load module (the            */ 04250001
*/*                      description must be enclosed in             */ 04300001
*/*                      apostrophes)                                */ 04350001
*/*            WIDTH=    Width of help window (must be either 53,    */ 04400001
*/*                      60, or 70--the default is 60)               */ 04450001
*/*            HIGHLI=   Specifies whether the first text line should*/ 04500001
*/*                      highlighted -- the default is No.           */ 04550001
*/*            RPDLM=    Specifies the starting and ending indicator */ 04600001
*/*                      of a reference phrase - the default is < >  */ 04650001
*/*            FORMAT=   Specifies the data format. DBCS means that  */ 04700001
*/*                      text lines are DBCS characters.             */ 04750001
*/*                                                                  */ 04800001
*/*            The NAME keyword is required. All other keywords      */ 04850001
*/*            are optional. A statement label may be specified      */ 04900001
*/*            but is not required.                                  */ 04950001
*/*                                                                  */ 05000001
*/*01*  OUTPUT = Help member header.                                 */ 05050001
*/*                                                                  */ 05100001
*/********************************************************************/ 05150001
.*                                                                      05200001
.SKIP    ANOP                                                           05250001
         GBLA  &SYSWID            Width of help window                  05300001
         GBLA  &REFL              Length of reference phrase            05350001
         GBLB  &HDRSW             Set when HDR statement found - used  *05400001
                                  to control the correct sequence       05450001
         GBLB  &TXTSW             Set when TXT statement found - used  *05500001
                                  to control the correct sequence       05550001
         GBLB  &RPSW              Set when RP statement found - used   *05600001
                                  to control the correct sequence       05650001
         GBLB  &DBCS              DBCS switch  (FORMAT=DBCS)            05700001
         GBLB  &HILI              Indicates whether the first text line*05750001
                                  should be highlighted                 05800001
         GBLC  &HELPNM            Help member name                      05850001
         GBLC  &SRPC              Start of reference phrase character   05900001
         GBLC  &ERPC              End of reference phrase character     05950001
.*                                                                      06000001
         LCLA  &L                 Maximum or required operand length    06050001
         LCLB  &ERROR             Error flag                            06100001
.*                                                                      06150001
         ACTR  10000              Set for infinite loop control         06200001
.*                                                                      06250001
.********************************************************************** 06300001
.*                                                                    * 06350001
.*       Set Variables                                                * 06400001
.*                                                                    * 06450001
.********************************************************************** 06500001
.*                                                                      06550001
&REFL    SETA  32                  Length of reference phrase           06600001
&SRPC    SETC  '<'                 Initialize RP starting character     06650001
&ERPC    SETC  '>'                 Initialize RP ending character       06700001
.*                                                                      06750001
.********************************************************************** 06800001
.*                                                                    * 06850001
.*       Check for positional operands and correct sequence           * 06900001
.*                                                                    * 06950001
.********************************************************************** 07000001
         AIF   (N'&SYSLIST EQ 0).L020                                   07050001
         MNOTE 8,'Positional operands not allowed - Macro ignored.'     07100001
         SPACE 2                                                        07150001
         MEXIT                                                          07200001
.*                                                                      07250001
.L020    ANOP                                                           07300001
         AIF   (&TXTSW OR &RPSW).L040  Report error if either a HDR or *07350001
                                       RP macro was coded before        07400001
         AGO   .L060                   and continue                     07450001
.*                                                                      07500001
.L040    ANOP                                                           07550001
         MNOTE 8,'Macro sequence error - HDR Macro must coded first.'   07600001
         SPACE 2                                                        07650001
         MEXIT                                                          07700001
.L060    ANOP                                                           07750001
&HDRSW   SETB  1                    Indicate valid HDR statement found  07800001
.*                                                                      07850001
.********************************************************************** 07900001
.*                                                                    * 07950001
.*       Validate NAME Parameter      1 - 7 character                 * 08000001
.*                                                                    * 08050001
.********************************************************************** 08100001
.NAME00  ANOP                                                           08150001
&L       SETA  7                      Maximum length of name            08200001
         AIF   ('&NAME' NE '').NAME10 NAME specified                    08250001
         MNOTE 8,'NAME parameter must be specified'                     08300001
&ERROR   SETB  1                      Indicates error                   08350001
         AGO   .NAMEXT                and continue                      08400001
.*                                                                      08450001
.NAME10  ANOP                                                           08500001
         AIF   (K'&NAME LE &L ).NAME20  Length of name parameter valid  08550001
         MNOTE 8,'NAME parameter exceeds &L characters.'                08600001
&ERROR   SETB  1                      Indicates error                   08650001
         AGO   .NAMEXT                and continue                      08700001
.*                                                                      08750001
.NAME20  ANOP                                                           08800001
&HELPNM  SETC  '&NAME'                Save help member name             08850001
.*                                                                      08900001
.NAMEXT  ANOP                                                           08950001
.*                                                                      09000001
.********************************************************************** 09050001
.*                                                                    * 09100001
.*       Validate WIDTH Parameter     53, 60 or 70                    * 09150001
.*                                                                    * 09200001
.********************************************************************** 09250001
.*                                                                      09300001
&SYSWID  SETA  &WIDTH                      Save window width            09350001
         AIF   ('&WIDTH' EQ '53').WIDTHXT  Valid width specified        09400001
         AIF   ('&WIDTH' EQ '60').WIDTHXT  Valid width specified        09450001
         AIF   ('&WIDTH' EQ '70').WIDTHXT  Valid width specified        09500001
.*                                                                      09550001
         MNOTE 8,'WIDTH must be 53, 60 OR 70'                           09600001
&ERROR   SETB  1                      Indicates error                   09650001
.*                                                                      09700001
.WIDTHXT ANOP                                                           09750001
.*                                                                      09800001
.********************************************************************** 09850001
.*                                                                    * 09900001
.*       Validate HIGHLI parameter    YES | NO                        * 09950001
.*                                                                    * 10000001
.********************************************************************** 10050001
.*                                                                      10100001
&HILI    SETB  0                      Assume no highlighting            10150001
         AIF   ('&HIGHLI' EQ '').HILIXT  Branch if parameter omitted    10200001
         AIF   ('&HIGHLI' EQ 'NO').HILIXT  Default (NO) specified       10250001
         AIF   ('&HIGHLI' EQ 'N').HILIXT  Default (NO) specified        10300001
&HILI    SETB  1                      Assume highlighting wanted        10350001
         AIF   ('&HIGHLI' EQ 'YES').HILIXT  Branch if so                10400001
         AIF   ('&HIGHLI' EQ 'Y').HILIXT  Branch if highlighting wanted 10450001
.*                                                                      10500001
         MNOTE 8,'HIGHLI value must be YES or NO.'                      10550001
&ERROR   SETB  1                      Indicates error                   10600001
.*                                                                      10650001
.HILIXT  ANOP                                                           10700001
.*                                                                      10750001
.********************************************************************** 10800001
.*                                                                    * 10850001
.*       Validate DESC Parameter      1 - 256 character               * 10900001
.*                                                                    * 10950001
.********************************************************************** 11000001
.*                                                                      11050001
&L       SETA  255+2                  Maximum length of description     11100001
         AIF   (K'&DESC LE &L ).DESCXT  Length of description is valid  11150001
         MNOTE 8,'DESC parameter exceeds &L characters.'                11200001
&ERROR   SETB  1                      Indicates error                   11250001
.*                                                                      11300001
.DESCXT  ANOP                                                           11350001
.*                                                                      11400001
.********************************************************************** 11450001
.*                                                                    * 11500001
.*       Validate FORMAT Parameter                                    * 11550001
.*                                                                    * 11600001
.********************************************************************** 11650001
.*                                                                      11700001
         AIF   ('&FORMAT' EQ '').FORMXT  Branch if not specified        11750001
         AIF   ('&FORMAT' NE 'DBCS').FORMER1 report error if not "DBCS" 11800001
&DBCS    SETB  1                       set flag that FORMAt=DBCS was   *11850001
                                       specified                        11900001
         AGO   .FORMXT                 and continue                     11950001
.*                                                                      12000001
.FORMER1 ANOP                                                           12050001
         MNOTE 4,'Invalid FORMAT parameter - ignored'                   12100001
.*                                                                      12150001
.FORMXT  ANOP                                                           12200001
.*                                                                      12250001
.********************************************************************** 12300001
.*                                                                    * 12350001
.*       Validate RPDLM Parameter                                     * 12400001
.*                                                                    * 12450001
.********************************************************************** 12500001
.*                                                                      12550001
&L       SETA  2                      Set exact length                  12600001
         AIF   ('&RPDLM' EQ '').RPDLMXT  Branch if not specified        12650001
         AIF   (K'&RPDLM EQ &L).RPDLM10  Check correct specification    12700001
.*                                                                      12750001
         MNOTE 8,'RPDLM parameter must be &L characters.'               12800001
&ERROR   SETB  1                      Indicates error                   12850001
         AGO   .RPDLMXT               and continue                      12900001
.*                                                                      12950001
.RPDLM10 ANOP                                                           13000001
&SRPC    SETC  '&RPDLM'(1,1)          save RP starting character        13050001
&ERPC    SETC  '&RPDLM'(2,1)          save RP ending character          13100001
.*                                                                      13150001
.RPDLMXT ANOP                                                           13200001
.*                                                                      13250001
.********************************************************************** 13300001
.*                                                                    * 13350001
.*       Generate help member header                                  * 13400001
.*                                                                    * 13450001
.********************************************************************** 13500001
.*                                                                      13550001
.GENTEXT ANOP                                                           13600001
         AIF   (&ERROR EQ 1).EXIT     Exit if an error has been found   13650001
.*                                                                      13700001
         AIF   ('&TITLE' EQ '').GENT10   No title specified             13750001
         TITLE &TITLE                                                   13800001
         AGO   .GENT20                                                  13850001
.GENT10  TITLE '&NAME HELP MEMBER'                                      13900001
.*                                                                      13950001
.GENT20  ANOP                                                           14000001
&NAME    CSECT                        Help member                       14050001
&NAME    AMODE 31                                                       14100001
&NAME    RMODE ANY                                                      14150001
*                                                                       14200001
HELPNAME DC    CL8'&NAME'             Help member name                  14250001
HELPDATE DC    CL8'&SYSDATE'          Date of assembly                  14300001
HELPVERS DC    CL4' '                                                   14350001
HELPREFA DC    A(0)                   Reference phrase array pointer    14400001
HELPREFC DC    F'0'                   Count of reference phrases        14450001
HELPLINA DC    A(0)                   Help text line array pointer      14500001
HELPLINC DC    F'0'                   Count of help text lines          14550001
HELPWCOL DC    H'&WIDTH'              Width of help window              14600001
HELPWROW DC    AL2(00)                                                  14650001
HELPREFL DC    AL2(&REFL+8)           Length of one entry in reference  14700001
*                                     phrase array                      14750001
         DC    AL2(HELPDESL)          Length of description             14800001
HELPDESL EQU   HELPREF-HELPDESC       .. Length of description          14850001
         DC    10AL2(0)                                                 14900001
HELPDESC DS    0C                     Start of description, if any      14950001
         SPACE 2                                                        15000001
         AIF   ('&DESC' EQ '').EXIT                                     15050001
         DC    C&DESC                                                   15100001
.EXIT    ANOP                                                           15150001
HELPREF  DS    0F                                                       15200001
         SPACE 3                                                        15250001
         MEND                                                           15300001
         TITLE 'Help Text Line Macro'                                   15350001
         MACRO                                                          15400001
&SYMBOL  TXT   &TEXT                                                    15450001
         AGO   .SKIP                                                    15500001
*/********************************************************************/ 15550001
*/*                                                                  */ 15600001
*/*01*  MACRO NAME = TXT                                             */ 15650001
*/*                                                                  */ 15700001
*/*02*  DESCRIPTIVE NAME = UIM/PIT Help Text Line Macro              */ 15750001
*/*                                                                  */ 15800001
*/*01*  MACRO CALL =                                                 */ 15850001
*/*       LABEL TXT      help text line                              */ 15900001
*/*                                                                  */ 15950001
*/*01*  FUNCTION = The TXT macro is used to generate a text line in  */ 16000001
*/*                a UIM/PIT-related help member                     */ 16050001
*/*                                                                  */ 16100001
*/*01*  NOTES =  None                                                */ 16150001
*/*                                                                  */ 16200001
*/*02*    DEPENDENCIES = All of the TXT statements within a help     */ 16250001
*/*                      member must be grouped together. (No        */ 16300001
*/*                      non-TXT statements can be imbedded within   */ 16350001
*/*                      the TXT statements).                        */ 16400001
*/*                                                                  */ 16450001
*/*                      The HDR statement must preceed all TXT      */ 16500001
*/*                      statements in the help member.              */ 16550001
*/*                                                                  */ 16600001
*/*                      The TXT statements must follow the RP       */ 16650001
*/*                      statements, if any, in the help member      */ 16700001
*/*                                                                  */ 16750001
*/*02*    RESTRICTIONS = For UIM/PIT-related help members only       */ 16800001
*/*                                                                  */ 16850001
*/*01*  INPUT =           1 to x-1 characters of help text (where x  */ 16900001
*/*                       is the width of the help window specified  */ 16950001
*/*                       in the HDR macro. The help text must be    */ 17000001
*/*                       enclosed in apostrophes) (Required.)       */ 17050001
*/*                                                                  */ 17100001
*/*                       The following special characters must be   */ 17150001
*/*                       coded in the help text:                    */ 17200001
*/*                                                                  */ 17250001
*/*                       <  start of reference phrase               */ 17300001
*/*                       >  end of reference phrase                 */ 17350001
*/*                                                                  */ 17400001
*/*                       Note: the < and > characters can be changed*/ 17450001
*/*                             by means of the RPDLM parameter in   */ 17500001
*/*                             the HDR macro if the default         */ 17550001
*/*                             characters are used within the text. */ 17600001
*/*                                                                  */ 17650001
*/*                       The TXT macro converts these special       */ 17700001
*/*                       characters to the hexadecimal codes that   */ 17750001
*/*                       are required for HCD help panels.          */ 17800001
*/*                                                                  */ 17850001
*/*               A statement label may be specified but is not      */ 17900001
*/*               required.                                          */ 17950001
*/*                                                                  */ 18000001
*/*01*  OUTPUT = Help text line.                                     */ 18050001
*/*                                                                  */ 18100001
*/********************************************************************/ 18150001
.*                                                                      18200001
.SKIP    ANOP                                                           18250001
         GBLA  &SYSLINE           Count of help text lines              18300001
         GBLA  &SYSWID            Width of help window                  18350001
         GBLB  &HDRSW             Set when HDR statement found - used  *18400001
                                  to control the correct sequence       18450001
         GBLB  &TXTSW             Set when TXT statement found - used  *18500001
                                  to control the correct sequence       18550001
         GBLB  &RPSW              Set when RP statement found - used   *18600001
                                  to control the correct sequence       18650001
         GBLB  &DBCS              DBCS switch  (FORMAT=DBCS)            18700001
         GBLB  &HILI              Indicates whether the first text line*18750001
                                  should be highlighted                 18800001
         GBLC  &SRPC              Start of reference phrase character   18850001
         GBLC  &ERPC              End of reference phrase character     18900001
.*                                                                      18950001
         LCLA  &L                 Maximum or required operand length    19000001
         LCLA  &TL                Temporary length                      19050001
         LCLA  &NDX               Substring index                       19100001
         LCLA  &ADJUST            Contains adjust value                 19150001
         LCLB  &ERROR             Error flag                            19200001
         LCLB  &DBM               Double byte mode                      19250001
         LCLC  &TXTOUT            normal text output attribute          19300001
         LCLC  &HILIOUT           highlighted text output attribute     19350001
         LCLC  &REF               reference phrase attribute            19400001
         LCLC  &ATTR              ISPF attribute character              19450001
         LCLC  &SO                Shift out code point                  19500001
         LCLC  &SI                Shift in  code point                  19550001
         LCLC  &XX1               SO and SI code points                 19600001
.*                                                                      19650001
         ACTR  10000              Set for infinite loop control         19700001
.*                                                                      19750001
&TXTOUT  SETC  '05'               Normal text output attribute char     19800001
&HILIOUT SETC  '06'               Highlight text output attribute char  19850001
&REF     SETC  '09'               Highlight input attribute char        19900001
&XX1     SETC  ''               SO(X'0E'), SI(x'0F')                  19950001
&SO      SETC  '&XX1'(1,1)        Set Shift out code point = X'0E'      20000001
&SI      SETC  '&XX1'(2,1)        Set Shift in code point  = X'0F'      20050001
&ADJUST  SETA  0                  Set adjust value to zero              20100001
.*                                                                      20150001
.********************************************************************** 20200001
.*                                                                    * 20250001
.*       Check for correct sequence                                   * 20300001
.*                                                                    * 20350001
.********************************************************************** 20400001
         AIF   (&HDRSW).L040           Report error if no HDR macro    *20450001
                                       was coded before                 20500001
         MNOTE 8,'Macro sequence error - HDR macro must be coded first.*20550001
               '                                                        20600001
         SPACE 2                                                        20650001
         MEXIT                                                          20700001
.*                                                                      20750001
.L040    ANOP                                                           20800001
&TXTSW   SETB  1                   Indicate valid TXT statement found   20850001
.*                                                                      20900001
.********************************************************************** 20950001
.*                                                                    * 21000001
.*       Validate TEXT            1 - &SYSWID characters              * 21050001
.*                                                                    * 21100001
.********************************************************************** 21150001
         AIF   ('&TEXT' NE '').TXT10    Branch if TEXT specified        21200001
         MNOTE 8,'Help text line must be specified.'                    21250001
&ERROR   SETB  1                      Indicates error                   21300001
         AGO   .TXTXT                 and continue                      21350001
.*                                                                      21400001
.TXT10   ANOP                                                           21450001
&L       SETA  &SYSWID-1              Max length of text line           21500001
.*                                                                      21550001
         AIF   (K'&TEXT LE &L+2).TXTXT  Length of text line is valid    21600001
         MNOTE 8,'Text line exceeds &L characters.'                     21650001
&ERROR   SETB  1                      Indicates error                   21700001
.*                                                                      21750001
.TXTXT   ANOP                                                           21800001
.*                                                                      21850001
.********************************************************************** 21900001
.*                                                                    * 21950001
.*       Generate help text                                           * 22000001
.*                                                                    * 22050001
.********************************************************************** 22100001
.*                                                                      22150001
.GENTEXT ANOP                                                           22200001
         AIF   (&ERROR EQ 1).EXIT     Exit if an error has been found   22250001
.*                                                                      22300001
&SYSLINE SETA  &SYSLINE+1             Add 1 to count of text lines      22350001
         ORG   HELPLINC               Set origin                        22400001
         DC    F'&SYSLINE'            Count of text lines               22450001
         ORG   ,                      Reset origin                      22500001
.*                                                                      22550001
&ATTR    SETC  '&TXTOUT'           assume normal text output            22600001
         AIF   (&SYSLINE NE 1).GENT20 Not first text line               22650001
         AIF   (NOT &HILI).GENT10     Branch if no highlighting wanted  22700001
&ATTR    SETC  '&HILIOUT'          use highlight text output            22750001
.GENT10  ANOP  ,                                                        22800001
         ORG   HELPLINA               Set origin                        22850001
         DC    A(HELPLINE)            Pointer to first text line        22900001
         ORG   ,                      Reset origin                      22950001
.*                                                                      23000001
         SPACE 3                                                        23050001
HELPLINE DS    0C                                                       23100001
.GENT20  ANOP  ,                                                        23150001
         AIF   ('&SYMBOL' EQ '').GENT30  Branch if no label specified   23200001
&SYMBOL  DS    0C                                                       23250001
.GENT30  ANOP  ,                                                        23300001
         AIF   ('&TEXT'(2,1) NE '&SRPC').GENT40  Character is not "<"   23350001
&TL      SETA  &L+1                 Compute actual length               23400001
&ADJUST  SETA  1                    Set adjust value to one, this is   *23450001
                                    because the first attribute        *23500001
                                    character and the reference phrase *23550001
                                    start character fall together       23600001
         DC    CL&TL&TEXT                                               23650001
         AGO   .GENT50              and continue                        23700001
.*                                                                      23750001
.GENT40  ANOP  ,                                                        23800001
         DC    X'&ATTR'               Set up ISPF attribute character   23850001
         DC    CL&L&TEXT                                                23900001
.GENT50  ANOP  ,                                                        23950001
.*                                                                      24000001
.*                                                                      24050001
.*       Loop to convert < and > to the required ISPF codes             24100001
.*                                                                      24150001
&DBM     SETB  0                      Indicate single byte mode         24200001
&NDX     SETA  2                      Points to second text character   24250001
.*                                                                      24300001
.TXLOOP  ANOP                                                           24350001
         AIF   (NOT &DBCS).TXL10     Branch if not DBCS format          24400001
         AIF   (NOT &DBM).TXL4       Branch if not in double byte mode  24450001
.*                                                                      24500001
         AIF   ('&TEXT'(&NDX,1) NE '&SI').TXLADD2 Shift in character ?  24550001
&DBM     SETB  0                      Indicate single byte mode         24600001
         AGO   .TXLINCR               Check next character              24650001
.*                                                                      24700001
.TXL4    ANOP                                                           24750001
         AIF   ('&TEXT'(&NDX,1) NE '&SO').TXL10  Shift out character ?  24800001
&DBM     SETB  1                      Indicate double byte mode         24850001
         AGO   .TXLINCR               Check next character              24900001
.*                                                                      24950001
.TXL10   ANOP                                                           25000001
         AIF   ('&TEXT'(&NDX,1) NE '&SRPC').TXL12 Character is not "<"  25050001
         ORG   *-&SYSWID+&NDX-1-&ADJUST  Set origin                     25100001
         DC    X'&REF'                Set output code (replace <)       25150001
         ORG   ,                      Reset origin                      25200001
         AGO   .TXLINCR               Check next character              25250001
.*                                                                      25300001
.TXL12   AIF   ('&TEXT'(&NDX,1) NE '&ERPC').TXLINCR  Char is not ">"    25350001
         ORG   *-&SYSWID+&NDX-1-&ADJUST     Set origin                  25400001
         DC    X'&TXTOUT'             Set input code (replace >)        25450001
         ORG   ,                      Reset origin                      25500001
         AGO   .TXLINCR               Check next character              25550001
.*                                                                      25600001
.TXLADD2 ANOP                                                           25650001
&NDX     SETA  &NDX+1                 Address next character in string  25700001
.*                                                                      25750001
.TXLINCR ANOP                                                           25800001
&NDX     SETA  &NDX+1                 Points to next character          25850001
         AIF   (&NDX LE K'&TEXT).TXLOOP  Check next character           25900001
.EXIT    ANOP  ,                                                        25950001
         SPACE 2                                                        26000001
         MEND                                                           26050001
         TITLE 'Reference Phrase Macro'                                 26100001
         MACRO                                                          26150001
&SYMBOL  RP    &PHRASE=,&HELP=                                          26200001
         AGO   .SKIP                                                    26250001
*/********************************************************************/ 26300001
*/*                                                                  */ 26350001
*/*01*  MACRO NAME = RP                                              */ 26400001
*/*                                                                  */ 26450001
*/*02*  DESCRIPTIVE NAME = UIM/PIT Help Reference Phrase Macro       */ 26500001
*/*                                                                  */ 26550001
*/*01*  MACRO CALL =                                                 */ 26600001
*/*       LABEL RP       PHRASE= 1 to 32 character reference phrase  */ 26650001
*/*                      HELP=   Name of associated help member      */ 26700001
*/*                                                                  */ 26750001
*/*01*  FUNCTION = The RP macro is used to generate an entry in the  */ 26800001
*/*                reference phrase array of a UIM/PIT-related       */ 26850001
*/*                help member.                                      */ 26900001
*/*                                                                  */ 26950001
*/*01*  NOTES =  None                                                */ 27000001
*/*                                                                  */ 27050001
*/*02*    DEPENDENCIES = All of the RP statements within a help      */ 27100001
*/*                      member must be grouped together. (No        */ 27150001
*/*                      non-RP statements can be imbedded within    */ 27200001
*/*                      the RP statements).                         */ 27250001
*/*                                                                  */ 27300001
*/*                      The HDR statement must preceed all RP       */ 27350001
*/*                      statements in the help member.              */ 27400001
*/*                                                                  */ 27450001
*/*                      The RP statements must preceed all TXT      */ 27500001
*/*                      statements in the help member.              */ 27550001
*/*                                                                  */ 27600001
*/*02*    RESTRICTIONS = For UIM/PIT-related help members only       */ 27650001
*/*                                                                  */ 27700001
*/*01*  INPUT =   PHRASE= 1 to 32 character reference phrase that    */ 27750001
*/*                       appears within a single line in the help   */ 27800001
*/*                       text. The reference phrase must be         */ 27850001
*/*                       enclosed in apostrophes. (Required         */ 27900001
*/*                       parameter.)                                */ 27950001
*/*               HELP=   Name of associated help member (Optional   */ 28000001
*/*                       parameter. If omitted, a special name will */ 28050001
*/*                       be generated which will cause, when help is*/ 28100001
*/*                       requested for the phrase, a temporary      */ 28150001
*/*                       combined reference help to be created      */ 28200001
*/*                       by appending all the other listed          */ 28250001
*/*                       reference help members.)                   */ 28300001
*/*                                                                  */ 28350001
*/*               A statement label may be specified but is not      */ 28400001
*/*               required.                                          */ 28450001
*/*                                                                  */ 28500001
*/*01*  OUTPUT = Help member reference phrase array entry.           */ 28550001
*/*                                                                  */ 28600001
*/********************************************************************/ 28650001
.*                                                                      28700001
.SKIP    ANOP                                                           28750001
         GBLA  &SYSREF            Count of reference phrases            28800001
         GBLA  &REFL              Length of reference phrase            28850001
         GBLB  &HDRSW             Set when HDR statement found - used  *28900001
                                  to control the correct sequence       28950001
         GBLB  &TXTSW             Set when TXT statement found - used  *29000001
                                  to control the correct sequence       29050001
         GBLB  &RPSW              Set when RP statement found - used   *29100001
                                  to control the correct sequence       29150001
         GBLB  &DBCS              DBCS switch  (FORMAT=DBCS)            29200001
         GBLC  &HELPNM            Help member name                      29250001
.*                                                                      29300001
         LCLA  &L                 Maximum or required operand length    29350001
         LCLB  &ERROR             Error flag                            29400001
         LCLC  &REFHLP            Reference help member name            29450001
.*                                                                      29500001
         ACTR  10000              Set for infinite loop control         29550001
.*                                                                      29600001
.********************************************************************** 29650001
.*                                                                    * 29700001
.*       Check for positional operands and correct sequence           * 29750001
.*                                                                    * 29800001
.********************************************************************** 29850001
         AIF   (N'&SYSLIST EQ 0).L020                                   29900001
         MNOTE 8,'Positional operands not allowed - Macro ignored.'     29950001
         SPACE 2                                                        30000001
         MEXIT                                                          30050001
.*                                                                      30100001
.L020    ANOP                                                           30150001
         AIF   (&HDRSW).L040           Report error if no HDR macro    *30200001
                                       was coded before                 30250001
         MNOTE 8,'Macro sequence error - HDR macro must be coded first.*30300001
               '                                                        30350001
         SPACE 2                                                        30400001
         MEXIT                                                          30450001
.*                                                                      30500001
.L040    ANOP                                                           30550001
         AIF   (NOT &TXTSW).L060       Report error if TXT statements  *30600001
                                       were coded before                30650001
         MNOTE 8,'Macro sequence error - TXT macro(s) must follow RP ma*30700001
               cro(s).'                                                 30750001
         SPACE 2                                                        30800001
         MEXIT                                                          30850001
.*                                                                      30900001
.L060    ANOP                                                           30950001
&RPSW    SETB  1                   Indicate valid RP statement found    31000001
.*                                                                      31050001
.********************************************************************** 31100001
.*                                                                    * 31150001
.*       Validate PHRASE              1 - 32 characters               * 31200001
.*                                                                    * 31250001
.********************************************************************** 31300001
&L       SETA  &REFL+2                Max length of reference phrase    31350001
         AIF   ('&PHRASE' NE '').PHRASE2   PHRASE specified             31400001
         MNOTE 8,'PHRASE parameter must be specified'                   31450001
&ERROR   SETB  1                      Indicates error                   31500001
         AGO   .PHRASEX               and continue                      31550001
.*                                                                      31600001
.PHRASE2 ANOP                                                           31650001
         AIF   (K'&PHRASE LE &L).PHRASEX  Length of ref phrase is valid 31700001
         MNOTE 8,'Reference phrase exceeds &REFL characters.'           31750001
&ERROR   SETB  1                      Indicates error                   31800001
.*                                                                      31850001
.PHRASEX ANOP                                                           31900001
.*                                                                      31950001
.********************************************************************** 32000001
.*                                                                    * 32050001
.*       Validate HELP                1 - 7 character                 * 32100001
.*                                                                    * 32150001
.********************************************************************** 32200001
&L       SETA  7                      Maximum length of help member     32250001
         AIF   ('&HELP' EQ '').HELP10   HELP not specified              32300001
&REFHLP  SETC  '&HELP'                Save help member name             32350001
         AIF   (K'&HELP LE &L ).HELPXT  Length of help member valid     32400001
         MNOTE 8,'HELP member name exceeds &L characters.'              32450001
&ERROR   SETB  1                      Indicates error                   32500001
         AGO   .HELPXT                and continue                      32550001
.*                                                                      32600001
.HELP10  ANOP                                                           32650001
&REFHLP  SETC  '&HELPNM'.'*'          Construct "combined" name         32700001
.*                                                                      32750001
.HELPXT  ANOP                                                           32800001
.*                                                                      32850001
.********************************************************************** 32900001
.*                                                                    * 32950001
.*       Generate reference phrase                                    * 33000001
.*                                                                    * 33050001
.********************************************************************** 33100001
.*                                                                      33150001
.GENTEXT ANOP                                                           33200001
         AIF   (&ERROR EQ 1).EXIT     Exit if an error has been found   33250001
.*                                                                      33300001
&SYSREF  SETA  &SYSREF+1              Add 1 to count of ref phrases     33350001
         ORG   HELPREFC               Set origin                        33400001
         DC    F'&SYSREF'             Count of reference phrases        33450001
         ORG   ,                      Reset origin                      33500001
.*                                                                      33550001
         AIF   (&SYSREF NE 1).GENT10  Not first reference phrase        33600001
         ORG   HELPREFA               Set origin                        33650001
         DC    A(HELPREF)             Pointer to first ref phrase       33700001
         ORG   ,                      Reset origin                      33750001
         SPACE 2                                                        33800001
.*                                                                      33850001
.GENT10  ANOP  ,                                                        33900001
         AIF   ('&SYMBOL' EQ '').GENT30  Branch if no label specified   33950001
&SYMBOL  DS    0C                                                       34000001
.GENT30  ANOP  ,                                                        34050001
         DC    CL&REFL&PHRASE         Reference phrase                  34100001
         DC    CL8'&REFHLP'           Help member name                  34150001
         SPACE 1                                                        34200001
.*                                                                      34250001
.EXIT    ANOP                                                           34300001
         MEND                                                           34350001
