*%GOTO IODV00;                     /* Bilingual Mapping                 00010004
         MACRO                        IODEVICE Internal Text Record     00020004
         CBDZIODV ,                                                  */ 00030004
*%IODV00: ;                                                             00040004
*/********************************************************************/ 00041004
*/* START OF SPECIFICATIONS                                          */ 00042004
*/*                                                                  */ 00043004
*/*  ACRONYM:  CBDZIODV                                              */ 00044004
*/*  EXTERNAL CLASSIFICATION:  PSPI                                  */ 00045004
*/*  END OF EXTERNAL CLASSIFICATION                                  */ 00046004
*/*                                                                  */ 00047004
*/*  MACRO NAME = CBDZIODV                                           */ 00048004
*/*  DSECT NAME:  IODV, IODVCUNL, IODVFEAL, IODVPARL, IODVDESL,      */ 00049004
*/*  PPVA, PPVAIX, PPVAVAL                                           */ 00049104
*/*                                                                  */ 00049204
*/*  DESCRIPTIVE NAME = IODEVICE Internal Text Record Mapping Macro  */ 00049304
*/*                                                                  */ 00049404
*/*  PROPRIETARY STATEMENT =                                         */ 00049504
*/*                                                                  */ 00049604
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00049704
*/*     THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                  */ 00049804
*/*     5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                  */ 00049909
*/*                                                                  */ 00050004
*/*  STATUS = HCS6091                                                */ 00051009
*/*                                                                  */ 00052004
*/*  COMPONENT:  Hardware Configuration Definition (SC1XL)           */ 00053004
*/*  EYE-CATCHER:  IODEVICE                                          */ 00054004
*/*    OFFSET:   0                                                   */ 00055004
*/*    LENGTH:   8                                                   */ 00056004
*/*  STORAGE ATTRIBUTES:                                             */ 00057004
*/*    MAIN STORAGE:  Obtained by caller                             */ 00058004
*/*    RESIDENCY:     Determined by caller                           */ 00059004
*/*  SIZE:            164 bytes fixed part plus variable length      */ 00059104
*/*                   extensions (IODV)                              */ 00059204
*/*02* 2nd section: 16 bytes (IODVCUNL)                              */ 00059304
*/*02* 3rd section: a variable number of 10 byte fields (IODVFEAL)   */ 00059404
*/*02* 4th section: a variable number of 8 byte fields (IODVPARL)    */ 00059504
*/*02* 5th section: a variable number of 44 byte fields (IODVDESL)   */ 00059604
*/*02* 6th section: 12 byte header (PPVA) followed by 64 array       */ 00059704
*/*    entries (PPVAIX) which are 32 bytes each                      */ 00059804
*/*02* 7th section: a variable length field (PPVAVAL)                */ 00059904
*/*  CREATED BY:      Assembler using CBDZPARS macro, HCD routines   */ 00060004
*/*  POINTED TO BY:   N/A                                            */ 00061004
*/*  SERIALIZATION:   None                                           */ 00062004
*/*                                                                  */ 00063004
*/*  FUNCTION:  The CBDZIODV mapping contains:                       */ 00064004
*/*            -  The I/O device address and number,                 */ 00065004
*/*            -  The device characteristics, and                    */ 00066004
*/*            -  The control units to which the device is assigned, */ 00067004
*/*            -  The Private Parameter Value Array.             @L6A*/ 00068004
*/*                                                                  */ 00069004
*/*  MODULE TYPE = Bilingual Mapping Macro                           */ 00069104
*/*                                                                  */ 00069204
*/*  DEPENDENCIES = Requires CBDZITRH                                */ 00069304
*/*                                                                  */ 00069404
*/*  RESTRICTIONS = For Hardware Configuration Dialog only           */ 00069504
*/*                 The assembler version must be invoked by         */ 00069604
*/*                  the CBDZITRH macro only.                        */ 00069704
*/*                                                                  */ 00069804
*/*  PROCESSOR = ASSEMBLER-H and PL/AS Compiler                      */ 00069904
*/*                                                                  */ 00070004
*/*  INVOCATION:  For PL/AS:                                         */ 00071004
*/*               %DCL IODVKEY CHAR                                  */ 00072004
*/*               %IODVKEY='value'                                   */ 00073004
*/*                   value = 'YES'                                  */ 00074004
*/*                                                                  */ 00075004
*/*               %INCLUDE SYSLIB(CBDZIODV)                          */ 00076004
*/*                                                                  */ 00077004
*/*               If IODVKEY is not declared and initialized, the    */ 00078004
*/*               list of keywords will not appear.                  */ 00079004
*/*                                                                  */ 00079104
*/*               For BAL:                                           */ 00079204
*/*               CBDZITRH ,                                         */ 00079304
*/*                                                                  */ 00079404
*/*  CHANGE ACTIVITY =                                               */ 00079504
*/*                                                                  */ 00079604
*/*  FLAG REASON   RELEASE  DATE   ORIGIN  COMMENT                   */ 00079704
*/*  ---- -------- -------- ------ ------  --------------------------*/ 00079804
*/*  $L0= HCD,     HCSH101  900420 BOEB:   Hardware Config. Dialog   */ 00079904
*/*  $L6= NCP      HCSH201  890730 BD3259: UIM private parameters    */ 00080004
*/*  $LB= MIF      HCSH301  910410 BD3259: MIF support               */ 00081004
*/*  $LD= VM       HCSH301  910610 BD3256: VM Configuration Support  */ 00082004
*/*  $LT= CF       HCSH501  930517 BD3259: Coupling Facility Support */ 00083004
*/*  $N3= MIG      HCSH501  931122 BD3259: Migration Enhancements    */ 00084004
*/*  $N6= UCBVSCR  HCSH521  931124 BD3259: UCB VSCR                  */ 00085004
*/*  $NE= CSTAR    HCSH521  940125 BD3259: Hardware Support          */ 00086004
*/*  $C3= VOL      HCS6031  960621 BBEI:   VOLSER support            */ 00087004
*/*  $H1= SHARK    HCS6051  971020 BKRE:   SHARK support             */ 00087106
*/*                                                                  */ 00088004
*/* END OF SPECIFICATIONS                                            */ 00089004
*/********************************************************************/ 00089104
*/*                                                                  */ 00089204
*%GOTO IODV01;                    /* Skip the assembler mapping         00089304
         ORG   ITRH               ORG to Internal Text Record Header    00089404
IODV     EQU   *                  IODEVICE Internal Text Record         00089504
         DS    CL(ITRHTEXT-ITRH)  Internal text record header (ITRH)    00089604
IODVUNIT DS    CL8                Unit name specified                   00089704
         DS    H                  Reserved.                             00089804
IODVUNIA DS    XL1                Unit address                          00089904
         DS    XL1                Reserved                              00090004
IODVDEVN DS    XL2                Device Number from DEVNUMBR           00090104
IODVDNBR DS    XL2                Hex device number                     00090204
IODVNBRD DS    H                  Number of devices, default=1          00090304
IODVUIMF DS    XL1                UIM Internal flag byte                00090404
IODVUCNT EQU     X'80'              1= IODVNBRD default device count    00090504
IODVPRCF DS    XL1                Processing flag byte                  00090604
IODVPMOD EQU     X'80'            Model is a supported parameter for    00090704
*                                 this device type                      00090804
IODVPREJ EQU     X'40'            Do not process this IODEVICE stmt     00090904
IODVPDEF EQU     X'20'            Define this I/O device                00091004
IODVPISC EQU     X'10'            Device is an ISC device         @LTA  00091104
IODVCUPT DS    A                  Pointer to control unit list          00091204
*                                      (IODVCUNL), zero when no list.   00091304
*                                      Each entry is 2 bytes long       00091404
IODVCUCT DS    H                  Number of control units in list       00091504
IODVFCNT DS    H                  Number of features in FEATURE         00091604
*                                      list (IODVFEAL)                  00091704
IODVFPTR DS    A                  Pointer to features list (IODVFEAL),  00091804
*                                      zero when no features specified  00091904
*                                      (each entry in the list is ten   00092004
*                                      bytes long)                      00092104
         DS    0F                 Word alignment for bit map            00092204
IODVPARM DS    0XL8               Parameter bits                        00092304
IODVPRMS DS    0XL8                Parameter bits                       00092404
IODVFLG1 DS    AL1                  Keyword flag byte 1                 00092504
*      Equates for MVS IODEVICE record                             @LDA 00092604
IODVFADP EQU   X'80'                 1= ADAPTER keyword                 00092704
IODVFADD EQU   X'40'                 1= ADDRESS keyword                 00092804
IODVFFEA EQU   X'10'                 1= FEATURE keyword                 00092904
IODVFMOD EQU   X'04'                 1= MODEL   keyword                 00093004
IODVFNUM EQU   X'02'                 1= NUMSECT keyword                 00093104
IODVFOFF EQU   X'01'                 1= OFFLINE=YES                     00093204
*      Equates for VM RDEVICE record                               @LDA 00093304
IODVVADP EQU   X'80'                 1= ADAPTER keyword            @LDA 00093404
IODVVAFP EQU   X'40'                 1= AFP     keyword            @LDA 00093504
IODVVBAD EQU   X'20'                 1= BASEADD keyword            @LDA 00093604
IODVVCHR EQU   X'10'                 1= CHARS   keyword            @LDA 00093704
IODVVCLS EQU   X'08'                 1= CLASS   keyword            @LDA 00093804
IODVVCPN EQU   X'04'                 1= CPNAME  keyword            @LDA 00093904
IODVVDST EQU   X'02'                 1= DEST    keyword            @LDA 00094004
IODVVDPM EQU   X'01'                 1= DPMSIZE keyword            @LDA 00094104
*                                                                  @LDA 00094204
IODVFLG2 DS    AL1                  Keyword flag byte 2                 00094304
*      Equates for MVS IODEVICE record                             @LDA 00094404
IODVFPCU EQU   X'80'                 1= PCU     keyword                 00094504
IODVFSET EQU   X'40'                 1= SETADDR keyword                 00094604
IODVFTCU EQU   X'20'                 1= TCU     keyword                 00094704
IODVFUNI EQU   X'10'                 1= UNIT    keyword                 00094804
IODVFDYN EQU   X'08'                 1= DYNAMIC keyword                 00094904
IODVFOWN EQU   X'04'                 1= OWNER   keyword                 00095004
IODVFLOC EQU   X'02'                 1= LOCANY  keyword            @N6A 00095104
*      Equates for VM RDEVICE record                               @LDA 00095204
IODVVFCB EQU   X'80'                 1= FCB     keyword            @LDA 00095304
IODVVFLH EQU   X'40'                 1= FLASH   keyword            @LDA 00095404
IODVVFLD EQU   X'20'                 1= FOLD    keyword            @LDA 00095504
IODVVFRM EQU   X'10'                 1= FORM    keyword            @LDA 00095604
IODVVIMG EQU   X'08'                 1= IMAGE   keyword            @LDA 00095704
IODVVIND EQU   X'04'                 1= INDEX   keyword            @LDA 00095804
IODVVMOD EQU   X'02'                 1= MODEL   keyword            @LDA 00095904
IODVVOFF EQU   X'01'                 1= OFFLINE keyword            @LDA 00096004
*                                                                  @LDA 00096104
IODVFLG3 DS    AL1                  Keyword flag byte 3            @LDA 00096204
*      Equates for VM RDEVICE record                               @LDA 00096304
IODVVSEP EQU   X'80'                 1= SEP     keyword            @LDA 00096404
IODVVSET EQU   X'40'                 1= SETADDR keyword            @LDA 00096504
IODVVSHR EQU   X'20'                 1= SHARED  keyword            @LDA 00096604
IODVVUIR EQU   X'10'                 1= UIRATE  keyword            @LDA 00096704
*                                                                  @LDA 00096804
         DS    XL1                  Reserved                            00096904
         DS    XL4                  Reserved                            00097004
IODVIOCP DS    0F                 IOCP-only parameter bits              00097104
IODVIPRM DS    0XL4                IOCP-only parameter bits             00097204
IODVIOF1 DS    AL1                  IOCP-only keyword flag byte         00097304
IODVICUN EQU   X'80'                 1= CUNUMBR keyword                 00097404
IODVIPTH EQU   X'40'                 1= PATH    keyword                 00097504
IODVISTA EQU   X'20'                 1= STADET=N                        00097604
IODVITIM EQU   X'10'                 1= TIMEOUT=N                       00097704
IODVIUNA EQU   X'08'                 1= UNITADD keyword                 00097804
IODVIDEV EQU   X'04'                 1= DEVNUMBR keyword                00097904
IODVISTY EQU   X'02'                 1= STADET=Y                        00098004
IODVITMY EQU   X'01'                 1= TIMEOUT=Y                       00098104
IODVIOF2 DS    AL1                  IOCP-only keyword flag byte 2  @LTA 00098204
IODVIPAR EQU   X'80'                 1= PARTITION keyword          @LTA 00098304
IODVINPA EQU   X'40'                 1= NOTPART keyword            @LTA 00098404
         DS    XL2                  Reserved                       @LTC 00098504
IODVMODL DS    CL4                Model number (valid only when         00098604
*                                      IODVFMOD is set)                 00098704
IODVPFLG DS    XL1                Parameter flags                       00098804
IODVPOFF EQU   X'80'              .. ON = OFFLINE=YES, otherwise NO     00098904
IODVPDYN EQU   X'40'              .. ON = DYNAMIC=YES, otherwise NO     00099004
IODVPLOC EQU   X'20'              .. ON = LOCANY=YES, otherwise NO @N6A 00099104
         DS    XL1                Reserved                              00099204
IODVNUMS DS    H                  Number of 256-byte buffer             00099304
*                                      sections in a 2840 display       00099404
*                                      control unit to be assigned      00099504
*                                      to a 2250 Model 3 (valid only    00099604
*                                      when IODVFNUM is set)            00099704
IODVTCU  DS    CL4                Transmission control unit (valid      00099804
*                                      only when IODVFTCU is set)       00099904
         DS    XL2                Reserved                              00100004
IODVPATH DS    XL1                Channel Path (valid only when         00100104
*                                      IODVFPTH is set)                 00100204
IODVSETA DS    XL1                Set address command indicator         00100304
*                                      for 2702 (valid only when        00100404
*                                      IODVFSET is set)                 00100504
IODVADPT DS    CL5                Transmission adapter specified        00100604
*                                      on ADAPTER keyword (valid only   00100704
*                                      when IODVFADP is set)            00100804
         DS    XL1                Reserved                              00100904
IODVPCU  DS    XL2                Physical control unit ID (valid       00101004
*                                      only when IODVFPCU is set)       00101104
IODVPPVA DS    A                  Address to Private Parameter     @L6C 00101204
*                                      Value Array (PPVA)          @L6C 00101304
         DS    CL2                Reserved                         @L6C 00101404
IODVXLEN DS    AL2                Length of extension area              00101504
IODVXPTR DS    A                  Address to extension area             00101604
IODVFEAT DS    0XL8               Feature bit string                    00101704
IODVFEA1 DS    AL1                Feature flag byte 1              @LDA 00101804
*      Equates for VM RDEVICE record                               @LDA 00101904
IODVFCNV EQU   X'80'                 1= CONV     feature           @LDA 00102004
IODVFDUA EQU   X'40'                 1= DUALDENS feature           @LDA 00102104
IODVFEMU EQU   X'20'                 1= EMUL3270 feature           @LDA 00102204
IODVFHLD EQU   X'10'                 1= E3270HLD feature           @LDA 00102304
IODVFOPR EQU   X'08'                 1= OPRDR    feature           @LDA 00102404
IODVFTRN EQU   X'04'                 1= TRANS    feature           @LDA 00102504
IODVFUNV EQU   X'02'                 1= UNVCHSET feature           @LDA 00102604
IODVF4WC EQU   X'01'                 1= 4WCGMS   feature           @LDA 00102704
*                                                                  @LDA 00102804
IODVFEA2 DS    AL1                Feature flag byte 2              @LDA 00102904
*      Equates for VM RDEVICE record                               @LDA 00103004
IODVF7TR EQU   X'80'                 1= 7-TRACK  feature           @LDA 00103104
IODVFDPS EQU   X'40'                 1= DPS      feature           @LDA 00103204
IODVFRES EQU   X'20'                 1= RESERVE  feature           @LDA 00103304
*                                                                  @LDA 00103404
         DS    XL6                Feature flag bytes 3 to 8        @LDA 00103504
*                                                                  @LDA 00103604
IODVOWNR DS    CL8                Owner identification                  00103704
IODVPARP DS    A                  Pointer to partition list (IODVPARL)  00103804
*                                      zero when no partition specified 00103904
*                                      (each entry in the list is eigth 00104004
*                                      bytes long)                 @LBA 00104104
IODVPARC DS    H                  Number of entries in partition list  *00104204
                                  (IODVPARL)                       @LBA 00104304
IODVDESC DS    H                  Number of entries in IODVDESL    @N3A 00104404
IODVDESP DS    A                  Pointer to list of serial number and  00104504
*                                      description of devices           00104604
*                                      (IODVDESL)                       00104704
*                                      zero when list not available     00104804
IODVEXPO DS    H                  First non-base exposure device        00104904
*                                      number, only valid when          00105004
*                                      IODVMULT is set             @NEA 00105104
IODVFLB  DS    XL1                Flag byte                        @NEA 00105204
IODVMULT EQU   X'80'              Device is a multi-exposure device and 00105304
*                                      IODVEXPO contains the starting   00105404
*                                      device number of the first       00105504
*                                      non-base exposure           @NEA 00105604
IODVFPAV EQU   X'40'              If set, indicates that device         00105708
*                                      is a PAV device             @H1A 00105808
IODVFBAS EQU   X'20'              If set, indicates device is a         00106008
*                                      PAV-base device. IODVFPAV is     00106108
*                                      also set.                   @H1A 00106208
IODVFALI EQU   X'10'              If set, indicates device is a         00106308
*                                      PAV-alias device. IODVFPAV is    00106408
*                                      also set.                   @H1A 00106508
         DS    CL5                Reserved                         @C3A 00106604
IODVVOL  DS    CL6                Reserved                         @C3A 00106704
         DS    CL14               Reserved                         @C3C 00106804
         SPACE 2                                                        00106904
*********************************************************************** 00107004
*                                                                     * 00107104
*    The following list contains the Control Units that were          * 00107204
*    specified for the device with the CUNUMBR keyword.  IODVCUCT     * 00107304
*    contains the count of the elements in this list.                 * 00107404
*                                                                     * 00107504
*********************************************************************** 00107604
         SPACE 1                                                        00107704
IODVCUNL DSECT               Control Unit list - pointed to by IODVCUPT 00107804
IODVCUNO DS    8H               8 is a maximum - may be less or 0       00107904
         SPACE 2                                                        00108004
*********************************************************************** 00108104
*                                                                     * 00108204
*    The following list contains the features that were specified     * 00108304
*    for the device with the FEATURE keyword.  IODVFCNT contains      * 00108404
*    the count of the elements in this list.                          * 00108504
*                                                                     * 00108604
*********************************************************************** 00108704
         SPACE 1                                                        00108804
IODVFEAL DSECT                 Features list - pointed to by IODVFPTR   00108904
IODVFNAM DS    0CL10                Unknown number of features          00109004
         SPACE 2                                                        00109104
*********************************************************************** 00109204
*                                                                     * 00109304
*    The following list contains the partitions that were specified   * 00109404
*    for the device with the PARTITION keyword.  IODVPARC contains    * 00109504
*    the count of the elements in this list.                      @LBA* 00109604
*                                                                     * 00109704
*    The partition list defines the partitions that have "access"     * 00109804
*    to the device.                                                   * 00109904
*                                                                     * 00110004
*********************************************************************** 00110104
         SPACE 1                                                        00110204
IODVPARL DSECT                 Partition list - pointed to by IODVPARP  00110304
IODVPANM DS    0CL8                 Partition name  - unknown number of*00110404
                                    entries                        @LBA 00110504
         SPACE 2                                                        00110604
*********************************************************************** 00110704
*                                                                     * 00110804
*    The following list contains the Serial Number and Description    * 00110904
*    for the devices specified with IODVDNBR and IODVNBRD.            * 00111004
*    (The address of the list is specified in IODVDESP, the count     * 00111104
*     of entries in list in IODVDESC.)                                * 00111204
*                                                                 @N3A* 00111304
*********************************************************************** 00111404
         SPACE 1                                                        00111504
IODVDESL DSECT               Device description list              @N3A  00111604
IODVSER  DS    CL10             - Serial number                   @N3A  00111704
         DS    CL2              - Reserved                        @N3A  00111804
IODVDES  DS    CL32             - Description                     @N3A  00111904
         EJECT                                                          00112004
****************************************************************** @L6A 00112104
*                                                                  @L6A 00112204
*    The following structures contain the definitions for the      @L6A 00112304
*    Private Parameter (user paramater) Value Array.               @L6A 00112404
*    The PPVA consists of an index area and a value area.          @L6A 00112504
*    The index area contains for each possible private parameter   @L6A 00112604
*    the parameter ID, the length of the value and the address     @L6A 00112704
*    appropriate entry in the value area.                          @L6A 00112804
*    The value area contains the parameter values. It is anchored  @L6A 00112904
*    in the PPVA structure in PPVAVAL.                             @L6A 00113004
*    The PPVA is anchored in the IODV in IODVPPVA.                 @L6A 00113104
*                                                                  @L6A 00113204
****************************************************************** @L6A 00113304
         SPACE 2                                                   @L6A 00113404
PPVA     DSECT                   Private Parameter Value Array     @L6A 00113504
PPVASD   DS    CL4               Storage descriptor ('PPVA')       @L6A 00113604
PPVAAVAL DS    A                 address to value area             @L6A 00113704
PPVASVAL DS    F                 size of value area                @L6A 00113804
PPVAAIX  DS    0F                the index area                    @L6A 00113904
         SPACE 2                                                        00114004
****************************************************************** @L6A 00114104
*                                                                  @L6A 00114204
*    The following structure defined an entry                      @L6A 00114304
*    in the PPVA index area                                        @L6A 00114404
*                                                                  @L6A 00114504
****************************************************************** @L6A 00114604
         SPACE 1                                                        00114704
PPVAIX   DSECT                   Private Parameter Value Array     @L6A 00114804
PPVATYP  DS    XL1               parameter type                    @L6A 00114904
PPVATDEC EQU   1                 .. Decimal data                   @L6A 00115004
PPVACHAR EQU   2                 .. Character data                 @L6A 00115104
PPVAHEX  EQU   3                 .. Hexadecimal data               @L6A 00115204
PPVAANUM EQU   4                 .. Alphanumeric data              @L6A 00115304
PPVAANUX EQU   5                 .. Alphanumeric data or '*'       @L6A 00115404
PPVAYN   EQU   6                 .. YES / NO                       @L6A 00115504
PPVALEN  DS    XL1               length of parameter value         @L6A 00115604
PPVACNT  DS    XL1               number of specified parameter     @L6A 00115704
*                                     values                       @L6A 00115804
         DS    CL1               reserved                          @L6A 00115904
         DS    CL24              reserved for later use            @L6A 00116004
PPVAVALP DS    A                 address to the parameter value    @L6A 00116104
*                                     in the value area            @L6A 00116204
         SPACE 2                                                        00116304
****************************************************************** @L6A 00116404
*                                                                  @L6A 00116504
*    The following structure defines an entry                      @L6A 00116604
*    in the PPVA value area.                                       @L6A 00116704
*                                                                  @L6A 00116804
****************************************************************** @L6A 00116904
         SPACE 1                                                        00117004
PPVAVAL  DSECT                   PPVA index area                   @L6A 00117104
PPVAVNAM DS    0C                the parameter value               @L6A 00117204
         SPACE 2                                                        00117304
****************************************************************** @L6A 00117404
*                                                                  @L6A 00117504
*  The following definitions used for field PPVAPNAM if the        @L6A 00117604
*  parameter value is of type PPVAYN.                              @L6A 00117704
*                                                                  @L6A 00117804
****************************************************************** @L6A 00117904
         SPACE 1                                                        00118004
PPVAPNO  EQU   C'0'              'NO' is parameter value           @L6A 00118104
PPVAPYES EQU   C'1'              'YES' is parameter value          @L6A 00118204
         MEND                                                           00118304
         */                                                             00118404
*%IODV01: ;                                                             00118504
 @EJECT;                                                                00118604
 DECLARE                                                                00118704
  1 IODV DEF(ITRH),               /* IODEVICE internal text record   */ 00118804
   3 * CHAR (LENGTH(ITRH)),       /* Internal text record header     */ 00118904
   3 IODVUNIT CHAR(8),            /* Unit name specified             */ 00119004
   3 *        FIXED (15),         /* Reserved                        */ 00119104
   3 IODVUNIA FIXED(8),           /* Unit address                    */ 00119204
   3 *        CHAR(1),            /* Reserved                        */ 00119304
   3 IODVDEVN FIXED(16),          /* Device Number from DEVNUMBR     */ 00119404
   3 IODVDNBR FIXED(16),          /* Hex device number               */ 00119504
   3 IODVNBRD FIXED(16),          /* Number of devices               */ 00119604
   3 IODVUIMF FIXED(8),           /* UIM Internal flag byte          */ 00119704
    5 IODVUCNT BIT(1),             /* IODVNBRD default device count  */ 00119804
    5 *        BIT(7),             /* Reserved                       */ 00119904
   3 IODVPRCF CHAR(1),            /* Processing flag byte.           */ 00120004
    5 IODVPMOD BIT(1),            /* Model is a supported parameter     00120104
                                     for this device type.           */ 00120204
    5 IODVPREJ BIT(1),            /* Do not process this IODEVICE       00120304
                                     statement                       */ 00120404
    5 IODVPDEF BIT(1),            /* Define this I/O device          */ 00120504
    5 IODVPISC BIT(1),            /* Device is an ISC device     @LTA*/ 00120604
    5 *        BIT(4),            /* Reserved                    @LTC*/ 00120704
   3 IODVCUPT PTR(31),            /* Pointer to control unit list       00120804
                                       (IODVCUNL), zero when no list.   00120904
                                       Each entry is 2 bytes long    */ 00121004
   3 IODVCUCT FIXED(16),          /* Number of control units in list */ 00121104
   3 IODVFCNT FIXED(16),          /* Number of features in FEATURE      00121204
                                       list (IODVFEAL)               */ 00121304
   3 IODVFPTR PTR(31),            /* Pointer to features list           00121404
                                       (IODVFEAL), zero when no         00121504
                                       features specified (each entry   00121604
                                       in the list is ten bytes long)*/ 00121704
   3 IODVPARM  BIT(64) BDY(WORD), /* Parameter bits. See IODVPRMS    */ 00121804
   3 IODVIOCP  BIT(32) BDY(WORD), /* Parameter bits. See IODVIPRM    */ 00121904
   3 IODVMODL CHAR(4),            /* Model number (valid only when      00122004
                                       IODVFMOD is set)              */ 00122104
   3 IODVPFLG BIT(16),            /* Parameter flags                 */ 00122204
     5 IODVPOFF BIT(1),           /* ON = OFFLINE=YES, otherwise NO  */ 00122304
     5 IODVPDYN BIT(1),           /* ON = DYNAMIC=YES, otherwise NO  */ 00122404
     5 IODVPLOC BIT(1),           /* ON = LOCANY=YES, otherwise NO      00122504
                                                                 @N6A*/ 00122604
     5 *        BIT(13),          /* Reserved                    @N6C*/ 00122704
   3 IODVNUMS FIXED(15),          /* Number of 256-byte buffer          00122804
                                       sections in a 2840 display       00122904
                                       control unit to be assigned      00123004
                                       to a 2250 Model 3 (valid only    00123104
                                       when IODVFNUM is set)         */ 00123204
   3 IODVTCU  CHAR(4),            /* Transmission control unit          00123304
                                       (valid only when IODVFTCU is     00123404
                                       set)                          */ 00123504
   3 *        CHAR(2),            /* Reserved                        */ 00123604
   3 IODVPATH FIXED(8),           /* Channel Path (valid only when      00123704
                                       IODVFPTH is set)              */ 00123804
   3 IODVSETA FIXED(8),           /* Set address command indicator      00123904
                                       for 2702 (valid only when        00124004
                                       IODVFSET is set)              */ 00124104
   3 IODVADPT CHAR(5),            /* Transmission adapter specified     00124204
                                       on ADAPTER keyword (valid only   00124304
                                       when IODVFADP is set)         */ 00124404
   3 *        CHAR(1),            /* Reserved                        */ 00124504
   3 IODVPCU FIXED(15),           /* Physical control unit ID           00124604
                                       (valid only when IODVFPCU is     00124704
                                       set)                          */ 00124804
   3 IODVPPVA PTR(31),            /* Address to Private Parameter       00124904
                                     Value Array (PPVA           @L6C*/ 00125004
   3 *        CHAR(2),            /* Reserved                    @L6C*/ 00125104
   3 IODVXLEN FIXED(15),          /* Length of extension area        */ 00125204
   3 IODVXPTR PTR(31),            /* Address to extension area       */ 00125304
   3 IODVFEAT BIT(64) BDY(WORD),  /* Feature bit string              */ 00125404
   3 IODVOWNR CHAR(8),            /* Owner identification        @LBC*/ 00125504
   3 IODVPARP PTR(31),            /* Address of partition list,         00125604
                                     contains zero if no partition list 00125704
                                     exists                      @LBA*/ 00125804
   3 IODVPARC FIXED(15),          /* Number of entries in partition     00125904
                                     list                        @LBA*/ 00126004
   3 IODVDESC FIXED(15),          /* Number of entries in device        00126104
                                     description list            @N3A*/ 00126204
   3 IODVDESP PTR(31),            /* Address of device description      00126304
                                     list, contains zero if no device   00126404
                                     description list exists     @N3A*/ 00126504
   3 IODVEXPO FIXED(16),          /* First non-base exposure device     00126604
                                     number, only valid when IODVMULT   00126704
                                     set                         @NEA*/ 00126804
   3 IODVFLB  BIT(8),             /* Flag byte                   @NEA*/ 00126904
     5 IODVMULT BIT(1),           /* ON = multi-exposure device AND     00127004
                                     IODVEXPO contains the starting     00127104
                                     device number of the first         00127204
                                     non-base exposure           @NEA*/ 00127304
     5 IODVFPAV BIT(1),           /* If set, indicates that device      00127407
                                     is a PAV device             @H1A*/ 00127507
     5 IODVFBAS BIT(1),           /* If set, indicates device is a      00127607
                                     PAV-base device. IODVFPAV is       00127707
                                     also set.                   @H1A*/ 00127807
     5 IODVFALI BIT(1),           /* If set, indicates device is a      00127907
                                     PAV-alias device. IODVFPAV is      00128007
                                     also set.                   @H1A*/ 00128107
     5 *        BIT(4),           /* Reserved                    @H1C*/ 00128207
   3 *        CHAR(5),            /* Reserved                    @C3A*/ 00128307
   3 IODVVOL  CHAR(6),            /* Reserved                    @C3A*/ 00128407
   3 *        CHAR(14),           /* Reserved                    @C3C*/ 00128507
   3 *        CHAR(0);            /* End of structure            @LBA*/ 00128607
 @SPACE (2);                                                            00128707
 /********************************************************************/ 00128807
 /*                                                                  */ 00128907
 /*  The following structure contains the parameters defined         */ 00129007
 /*  at IODVPARM. The bits indicate the MVSCP keywords used on       */ 00129107
 /*  the macro call.                                                 */ 00129207
 /*  They are also used by the UIMs to indicate to the parameter     */ 00129307
 /*  checker which keywords are required and recognized.             */ 00129407
 /*                                                                  */ 00129507
 /********************************************************************/ 00129607
 @SPACE (1);                                                            00129707
 DECLARE                                                                00129807
  1 IODVPRMS  BIT(64) BASED(ADDR(IODVPARM)),   /* Parameter bits     */ 00129907
   3 IODVFLG1 BIT(8),              /* Keyword flag byte 1            */ 00130007
    5 IODVFADP BIT(1),              /* 1= ADAPTER keyword            */ 00130107
    5 IODVFADD BIT(1),              /* 1= ADDRESS keyword            */ 00130207
    5 *        BIT(1),              /* Reserved                      */ 00130307
    5 IODVFFEA BIT(1),              /* 1= FEATURE keyword            */ 00130407
    5 *        BIT(1),              /* Reserved                      */ 00130507
    5 IODVFMOD BIT(1),              /* 1= MODEL   keyword            */ 00130607
    5 IODVFNUM BIT(1),              /* 1= NUMSECT keyword            */ 00130707
    5 IODVFOFF BIT(1),              /* 1= OFFLINE keyword            */ 00130807
   3 IODVFLG2 BIT(8),              /* Keyword flag byte 2            */ 00130907
    5 IODVFPCU BIT(1),              /* 1= PCU     keyword            */ 00131007
    5 IODVFSET BIT(1),              /* 1= SETADDR keyword            */ 00131107
    5 IODVFTCU BIT(1),              /* 1= TCU     keyword            */ 00131207
    5 IODVFUNI BIT(1),              /* 1= UNIT    keyword            */ 00131307
    5 IODVFDYN BIT(1),              /* 1= DYNAMIC keyword            */ 00131407
    5 IODVFOWN BIT(1),              /* 1= OWNER   keyword            */ 00131507
    5 IODVFLOC BIT(1),              /* 1= LOCANY  keyword        @N6A*/ 00131607
    5 *        BIT(1),              /* Reserved                  @N6C*/ 00131707
   3 *        BIT(8),              /* Reserved                       */ 00131807
   3 *        BIT(8),              /* Reserved                       */ 00131907
   3 *        BIT(32);             /* UIM Private Parameters         */ 00132007
 @SPACE (2);                                                            00132107
 /********************************************************************/ 00132207
 /*                                                                  */ 00132307
 /*  The following structure contains the parameters defined         */ 00132407
 /*  at IODVPARM. The bits indicate the RDEVICE keywords used on     */ 00132507
 /*  the macro call.                                                 */ 00132607
 /*  They are also used by the UIMs to indicate to the parameter     */ 00132707
 /*  checker which keywords are required and recognized.             */ 00132807
 /*                                                              @LDA*/ 00132907
 /********************************************************************/ 00133007
 @SPACE (1);                                                            00133107
 DECLARE                                                                00133207
  1 IODVVPRM  BIT(64) BASED(ADDR(IODVPARM)),   /* Parameter bits @LDA*/ 00133307
   3 IODVVFL1 BIT(8),              /* Keyword flag byte 1        @LDA*/ 00133407
    5 IODVVADP BIT(1),              /* 1= ADAPTER keyword        @LDA*/ 00133507
    5 IODVVAFP BIT(1),              /* 1= AFP     keyword        @LDA*/ 00133607
    5 IODVVBAD BIT(1),              /* 1= BASEADD keyword        @LDA*/ 00133707
    5 IODVVCHR BIT(1),              /* 1= CHARS   keyword        @LDA*/ 00133807
    5 IODVVCLS BIT(1),              /* 1= CLASS   keyword        @LDA*/ 00133907
    5 IODVVCPN BIT(1),              /* 1= CPNAME  keyword        @LDA*/ 00134007
    5 IODVVDST BIT(1),              /* 1= DEST    keyword        @LDA*/ 00134107
    5 IODVVDPM BIT(1),              /* 1= DPMSIZE keyword        @LDA*/ 00134207
   3 IODVFL2  BIT(8),              /* Keyword flag byte 2        @LDA*/ 00134307
    5 IODVVFCB BIT(1),              /* 1= FCB     keyword        @LDA*/ 00134407
    5 IODVVFLH BIT(1),              /* 1= FLASH   keyword        @LDA*/ 00134507
    5 IODVVFLD BIT(1),              /* 1= FOLD    keyword        @LDA*/ 00134607
    5 IODVVFRM BIT(1),              /* 1= FORM    keyword        @LDA*/ 00134707
    5 IODVVIMG BIT(1),              /* 1= IMAGE   keyword        @LDA*/ 00134807
    5 IODVVIND BIT(1),              /* 1= INDEX   keyword        @LDA*/ 00134907
    5 IODVVMOD BIT(1),              /* 1= MODEL   keyword        @LDA*/ 00135007
    5 IODVVOFF BIT(1),              /* 1= OFFLINE keyword        @LDA*/ 00135107
   3 IODVFL3  BIT(8),              /* Keyword flag byte 3        @LDA*/ 00135207
    5 IODVVSEP BIT(1),              /* 1= SEP     keyword        @LDA*/ 00135307
    5 IODVVSET BIT(1),              /* 1= SETADDR keyword        @LDA*/ 00135407
    5 IODVVSHR BIT(1),              /* 1= SHARED  keyword        @LDA*/ 00135507
    5 IODVVUIR BIT(1),              /* 1= UIRATE  keyword        @LDA*/ 00135607
    5 *        BIT(4),              /* Reserved                  @LDA*/ 00135707
   3 *        BIT(8),              /* Reserved                   @LDA*/ 00135807
   3 *        BIT(32);             /* UIM Private Parameters     @LDA*/ 00135907
 @SPACE (2);                                                            00136007
 /********************************************************************/ 00136107
 /*                                                                  */ 00136207
 /*  The following structure contains the VM features defined        */ 00136307
 /*  at IODVFEAT. The bits indicate the RDEVICE features used on     */ 00136407
 /*  the macro call.                                                 */ 00136507
 /*  They are also used by the UIMs to indicate to the feature       */ 00136607
 /*  checker which keywords are required and recognized.             */ 00136707
 /*                                                              @LDA*/ 00136807
 /********************************************************************/ 00136907
 @SPACE (1);                                                            00137007
 DECLARE                                                                00137107
  1 IODVVFEA  BIT(64) BASED(ADDR(IODVFEAT)),   /* Feature bits   @LDA*/ 00137207
   3 IODVFEA1 BIT(8),              /* Feature flag byte 1        @LDA*/ 00137307
    5 IODVFCNV BIT(1),              /* 1= CONV     feature       @LDA*/ 00137407
    5 IODVFDUA BIT(1),              /* 1= DUALDENS feature       @LDA*/ 00137507
    5 IODVFEMU BIT(1),              /* 1= EMUL3270 feature       @LDA*/ 00137607
    5 IODVFHLD BIT(1),              /* 1= E3270HLD feature       @LDA*/ 00137707
    5 IODVFOPR BIT(1),              /* 1= OPRDR    feature       @LDA*/ 00137807
    5 IODVFTRN BIT(1),              /* 1= TRANS    feature       @LDA*/ 00137907
    5 IODVFUNV BIT(1),              /* 1= UNVCHSET feature       @LDA*/ 00138007
    5 IODVF4WC BIT(1),              /* 1= 4WCGMS   feature       @LDA*/ 00138107
   3 IODVFEA2 BIT(8),              /* Feature flag byte 2        @LDA*/ 00138207
    5 IODVF7TR BIT(1),              /* 1= 7-TRACK  feature       @LDA*/ 00138307
    5 IODVFDPS BIT(1),              /* 1= DPS      feature       @LDA*/ 00138407
    5 IODVFRES BIT(1),              /* 1= RESERVE  feature       @LDA*/ 00138507
    5 *        BIT(5),              /* Reserved                  @LDA*/ 00138607
   3 *        BIT(48);             /* Reserved                   @LDA*/ 00138707
 @SPACE (2);                                                            00138807
 /********************************************************************/ 00138907
 /*                                                                  */ 00139007
 /*  The following structure contains the parameters defined         */ 00139107
 /*  at IODVIOCP. The bits indicate the IOCP-only keywords that      */ 00139207
 /*  were used on the macro call.                                    */ 00139307
 /*                                                                  */ 00139407
 /********************************************************************/ 00139507
 @SPACE (1);                                                            00139607
 DECLARE                                                                00139707
  1 IODVIPRM  BIT(32) BASED(ADDR(IODVIOCP)),   /* Parameter bits     */ 00139807
   3 IODVIOF1 BIT(8),              /* IOCP-only keyword flag byte    */ 00139907
    5 IODVICUN BIT(1),              /* 1= CUNUMBR keyword            */ 00140007
    5 IODVIPTH BIT(1),              /* 1= PATH    keyword            */ 00140107
    5 IODVISTA BIT(1),              /* 1= STADET=N                   */ 00140207
    5 IODVITIM BIT(1),              /* 1= TIMEOUT=N                  */ 00140307
    5 IODVIUNA BIT(1),              /* 1= UNITADD keyword            */ 00140407
    5 IODVIDEV BIT(1),              /* 1= DEVNUMBR keyword           */ 00140507
    5 IODVISTY BIT(1),              /* 1= STADET=Y                   */ 00140607
    5 IODVITMY BIT(1),              /* 1= TIMEOUT=Y                  */ 00140707
   3 IODVIOF2 BIT(8),              /* IOCP-only keyword flag byte 2     00140807
                                                                 @LTA*/ 00140907
    5 IODVIPAR BIT(1),              /* 1= PARTITION keyword      @LTA*/ 00141007
    5 IODVINPA BIT(1),              /* 1= NOTPART keyword        @LTA*/ 00141107
    5 *        BIT(6),              /* Reserved                  @LTA*/ 00141207
   3 *        BIT(8),              /* Reserved                       */ 00141307
   3 *        BIT(8);              /* Reserved                       */ 00141407
 @SPACE (2);                                                            00141507
 /********************************************************************/ 00141607
 /*                                                                  */ 00141707
 /*  The following list contains the Control Units that were         */ 00141807
 /*  specified for the device with the CUNUMBR keyword.              */ 00141907
 /*  IODVCUCT contains the count of the elements in this list.       */ 00142007
 /*                                                                  */ 00142107
 /********************************************************************/ 00142207
 @SPACE (1);                                                            00142307
 DECLARE                                                                00142407
  1 IODVCUNL  BASED (IODVCUPT),     /* Control Unit list             */ 00142507
   3 IODVCUNO(8) FIXED(16);         /*                               */ 00142607
                                                             @SPACE(2); 00142707
 /********************************************************************/ 00142807
 /*                                                                  */ 00142907
 /*  The following list contains the partitions that were specified  */ 00143007
 /*  for the device with the PARTITION keyword.  IODVPARC contains   */ 00143107
 /*  the count of the elements in this list.                     @LBA*/ 00143207
 /*                                                                  */ 00143307
 /*  The partition list defines the partitions that have "access"    */ 00143407
 /*  to the device.                                                  */ 00143507
 /*                                                                  */ 00143607
 /********************************************************************/ 00143707
                                                                @SPACE; 00143807
 DECLARE                                                                00143907
  1 IODVPARL  BASED (IODVPARP),    /* Partition list             @LBA*/ 00144007
    3 IODVPANM(*) CHAR(8);         /* .. Partition name - unknown       00144107
                                      number of entries          @LBA*/ 00144207
                                                             @SPACE(2); 00144307
 /********************************************************************/ 00144407
 /*                                                                  */ 00144507
 /*  The following list contains the device description list for the */ 00144607
 /*  devices IODVDNBR ... IODVNBRD-1. IODVDESP contains the address  */ 00144707
 /*  of this list, IODVDESC the count of list elements.              */ 00144807
 /*                                                              @N3A*/ 00144907
 /********************************************************************/ 00145007
                                                                @SPACE; 00145107
 DECLARE                                                                00145207
  1 IODVDESL  BASED (IODVDESP),    /* Device description list    @N3A*/ 00145307
    3 IODV_DESCR (*),              /* .. Device description             00145407
                                      number of entries          @N3A*/ 00145507
      5 IODVSER  CHAR(10),         /* .. Serial number           @N3A*/ 00145607
      5 *        CHAR(2),          /* .. Reserved                @N3A*/ 00145707
      5 IODVDES  CHAR(32);         /* .. Description             @N3A*/ 00145807
 @EJECT;                                                                00145907
 /********************************************************************/ 00146007
 /*                                                                  */ 00146107
 /*  The following list contains the features that were specified    */ 00146207
 /*  for the device with the FEATURE keyword.  IODVFCNT contains     */ 00146307
 /*  the count of the elements in this list.                         */ 00146407
 /*                                                                  */ 00146507
 /********************************************************************/ 00146607
 @SPACE (1);                                                            00146707
 DECLARE                                                                00146807
  1 IODVFEAL  BASED(IODVFPTR),      /* Features list                 */ 00146907
   3 IODVFNAM(*) CHAR(10);                                              00147007
 @SPACE (2);                                                            00147107
 %IF IODVKEY ~= 'YES' %THEN                                             00147207
   %GOTO IODV210;                                                       00147307
 %IODV200: ;               /* If this unused label is not placed        00147407
                              here, then the PLS compiler will not      00147507
                              print the following block comment.     */ 00147607
 /********************************************************************/ 00147707
 /*                                                                  */ 00147807
 /*  The following list contains the MVSCP keyword operands that     */ 00147907
 /*  are parsed on the macro invocation. The order of the keywords   */ 00148007
 /*  correspond to the flag definitions in IODVPRMS.                 */ 00148107
 /*  There is no ASSEMBLER equivalent for the constants below.       */ 00148207
 /*                                                                  */ 00148307
 /********************************************************************/ 00148407
 @SPACE (1);                                                            00148507
 DECLARE                                                                00148607
  1 IODVKEYS  STATIC LOCAL,         /* Keyword list                  */ 00148707
   3 IODVKEYW(15) CHAR(7) INIT ('ADAPTER','ADDRESS',                    00148807
                      '       ','FEATURE','       ','MODEL  ',          00148907
                      'NUMSECT','OFFLINE','PCU    ',                    00149007
                      'SETADDR','TCU    ','UNIT   ',                    00149107
                      'DYNAMIC','OWNER  ','LOCANY ');          /*@N6A*/ 00149207
 @SPACE (2);                                                            00149307
 /********************************************************************/ 00149407
 /*                                                                  */ 00149507
 /*  The following list contains the RDEVICE keyword operands that   */ 00149607
 /*  are parsed on the macro invocation. The order of the keywords   */ 00149707
 /*  correspond to the flag definitions in IODVVPRM.                 */ 00149807
 /*                                                              @LDA*/ 00149907
 /********************************************************************/ 00150007
 @SPACE (1);                                                            00150107
 DECLARE                                                                00150207
  1 IODVVKYS  STATIC LOCAL,         /* Keyword list              @LDA*/ 00150307
   3 IODVVKEY(20) CHAR(7)                                               00150407
                 INIT('ADAPTER','AFP    ','BASEADD',                    00150507
                      'CHARS  ','CLASS  ','CPNAME ',                    00150607
                      'DEST   ','DPMSIZE','FCB    ',                    00150707
                      'FLASH  ','FOLD   ','FORM   ',                    00150807
                      'IMAGE  ','INDEX  ','MODEL  ',                    00150907
                      'OFFLINE','SEP    ','SETADDR',                    00151007
                      'SHARED ','UIRATE ');            /* values @LDA*/ 00151107
 @SPACE (2);                                                            00151207
 /********************************************************************/ 00151307
 /*                                                                  */ 00151407
 /*  The following list contains the RDEVICE feature operands that   */ 00151507
 /*  are parsed on the macro invocation. The order of the keywords   */ 00151607
 /*  correspond to the flag definitions in IODVVFEA.                 */ 00151707
 /*                                                              @LDA*/ 00151807
 /********************************************************************/ 00151907
 @SPACE (1);                                                            00152007
 DECLARE                                                                00152107
  1 IODVFKYS  STATIC LOCAL,         /* Feature list              @LDA*/ 00152207
   3 IODVFKEY(11) CHAR(10)                                              00152307
                 INIT('CONV      ','DUALDENS  ',                        00152407
                      'EMUL3270  ','E3270HLD  ',                        00152507
                      'OPRDR     ','TRANS     ',                        00152607
                      'UNVCHSET  ','4WCGMS    ',                        00152707
                      '7-TRACK   ','DPS       ',                        00152807
                      'RESERVE   ');                   /* values @LDA*/ 00152907
 @SPACE (2);                                                            00153007
 %IODV210: ;                                                            00153107
 %DEACT IODVKEY;                                                        00153207
 @SPACE (2);                                                            00153307
 /********************************************************************/ 00153407
 /*                                                              @L6A*/ 00153507
 /*  The following structures contain the definitions for the    @L6A*/ 00153607
 /*  Private Parameter (user paramater) Value Array.             @L6A*/ 00153707
 /*  The PPVA consists of an index area and a value area.        @L6A*/ 00153807
 /*  The index area contains for each possible private parameter @L6A*/ 00153907
 /*  the parameter ID, the length of the value and the address   @L6A*/ 00154007
 /*  appropriate entry in the value area.                        @L6A*/ 00154107
 /*  The value area contains the parameter values. It is anchored@L6A*/ 00154207
 /*  in the PPVA structure in PPVAVAL.                           @L6A*/ 00154307
 /*  The PPVA is anchored in the IODV in IODVPPVA.               @L6A*/ 00154407
 /*                                                              @L6A*/ 00154507
 /********************************************************************/ 00154607
 @SPACE (1);                                                            00154707
 DECLARE                           /*                            @L6A*/ 00154807
  1 PPVA      BASED(IODVPPVA),     /* Private Parameter Value Array     00154907
                                                                 @L6A*/ 00155007
   3 PPVASD   CHAR(4),             /* Storage descriptor('PPVA') @L6A*/ 00155107
   3 PPVAAVAL PTR(31),             /* address to value area      @L6A*/ 00155207
   3 PPVASVAL FIXED(31),           /* size of value area         @L6A*/ 00155307
   3 *        CHAR(32),            /* reserved                   @L6A*/ 00155407
   3 PPVAIX(64),                   /* the index area             @L6A*/ 00155507
     5 PPVATYP FIXED(8),           /* parameter type, use the           00155607
                                      definitions on the subsequent     00155707
                                      list for this field        @L6A*/ 00155807
     5 PPVALEN FIXED(8),           /* length of parameter value  @L6A*/ 00155907
     5 PPVACNT FIXED(8),           /* number of specified parameter     00156007
                                      values                     @L6A*/ 00156107
     5 *      CHAR(1),             /* reserved                   @L6A*/ 00156207
     5 *      CHAR(24),            /* reserved for later use     @L6A*/ 00156307
     5 PPVAVALP PTR(31);           /* address to the parameter value    00156407
                                      in the value area          @L6A*/ 00156507
 @SPACE (2);                                                            00156607
 /********************************************************************/ 00156707
 /*                                                              @L6A*/ 00156807
 /*  The following constant defines the storage descriptor       @L6A*/ 00156907
 /*  for PPVASD.                                                 @L6A*/ 00157007
 /*                                                              @L6A*/ 00157107
 /********************************************************************/ 00157207
 @SPACE (1);                                                            00157307
 DECLARE                           /*                            @L6A*/ 00157407
  PPVAID   CHAR(4) CONSTANT('PPVA');/* Constant for descriptor   @L6A*/ 00157507
 @SPACE (2);                                                            00157607
 /********************************************************************/ 00157707
 /*                                                              @L6A*/ 00157807
 /*  The following constants define the length of the            @L6A*/ 00157907
 /*  PPVA index area with the header and the PPVA value area.    @L6A*/ 00158007
 /*                                                              @L6A*/ 00158107
 /********************************************************************/ 00158207
 @SPACE (1);                                                            00158307
 DECLARE                           /*                            @L6A*/ 00158407
  PPVALEN1 FIXED(31) CONSTANT(LENGTH(PPVA)), /* index area & hdr @L6A*/ 00158507
  PPVALEN2 FIXED(31) CONSTANT(DIM(PPVAIX)*8);/* value area       @L6A*/ 00158607
 @SPACE (2);                                                            00158707
 /********************************************************************/ 00158807
 /*                                                              @L6A*/ 00158907
 /*  The following constants are used to set the PPVATYP field   @L6A*/ 00159007
 /*  to define the type of the specified parameter data.         @L6A*/ 00159107
 /*                                                              @L6A*/ 00159207
 /********************************************************************/ 00159307
 @SPACE (1);                                                            00159407
 DECLARE                           /*                            @L6A*/ 00159507
  PPVACHAR FIXED(8) CONSTANT(1),   /* Character data             @L6A*/ 00159607
  PPVATDEC FIXED(8) CONSTANT(2),   /* Decimal data               @L6A*/ 00159707
  PPVAHEX  FIXED(8) CONSTANT(3),   /* Hexadecimal data           @L6A*/ 00159807
  PPVAANUM FIXED(8) CONSTANT(4),   /* Alphanumeric data          @L6A*/ 00159907
  PPVAANUX FIXED(8) CONSTANT(5),   /* Alphanumeric data or '*'   @L6A*/ 00160007
  PPVAYN   FIXED(8) CONSTANT(6);   /* YES / NO                   @L6A*/ 00160107
 @SPACE (2);                                                            00160207
 /********************************************************************/ 00160307
 /*                                                                  */ 00160407
 /*  The following structure maps a PPVA Value Area entry.       @L6A*/ 00160507
 /*                                                                  */ 00160607
 /********************************************************************/ 00160707
 @SPACE (1);                                                            00160807
 DECLARE                           /*                            @L6A*/ 00160907
  1 PPVAVAL   BASED BDY(WORD),     /* Private Parameter Value Area      00161007
                                                                 @L6A*/ 00161107
   3 PPVAPNAM CHAR(*) BDY(WORD),   /* the name of the parameter,        00161207
                                      the size of the parameter is      00161307
                                      stored in field PPVALEN in the    00161407
                                      appropriate index entry    @L6A*/ 00161507
    4 PPVAF31  FIXED(31),          /* .. fullword                @L6A*/ 00161607
     5 PPVAC1  CHAR(1);            /* ..                         @L6A*/ 00161707
 @SPACE (2);                                                            00161807
 /********************************************************************/ 00161907
 /*                                                              @L6A*/ 00162007
 /*  The following constants are used for field PPVAPNAM if the  @L6A*/ 00162107
 /*  parameter is of type PPVAYN.                                @L6A*/ 00162207
 /*                                                              @L6A*/ 00162307
 /********************************************************************/ 00162407
 @SPACE (1);                                                            00162507
 DECLARE                           /*                            @L6A*/ 00162607
   PPVAPNO  CHAR(1) CONSTANT('0'), /* 'NO' is parameter value    @L6A*/ 00162707
   PPVAPYES CHAR(1) CONSTANT('1'); /* 'YES' is parameter value   @L6A*/ 00162807
                                                             @SPACE(1); 00162907
 /*------------------------------------------------------------------*/ 00163007
 /* Map the parameters stored in IODV variable extension area    @LDA*/ 00163107
 /*------------------------------------------------------------------*/ 00163207
    DECLARE                                                  /*  @LDA*/ 00163307
    1 VEA       BASED(IODVXPTR),    /* variable extension area   @LDA*/ 00163407
      3 VEAHEADER,                  /* header                    @LDA*/ 00163507
        5  VEAKEYWORD  CHAR(10),    /* parameter keyword         @LDA*/ 00163607
        5  VEALEN      FIXED(8),    /* length of parameter       @LDA*/ 00163707
        5  VEACNT      FIXED(8),    /* count of following parameters    00163807
                                                                 @LDA*/ 00163907
      3 VEAVAL         CHAR(*);     /* parameter value           @LDA*/ 00164007
