*       %GOTO UXCPROL;        /* BILINGUAL MAPPING                      00050000
        MACRO                                                           00100000
        CBRUXCPL , */                                                   00150000
*%UXCPROL: ;                                                            00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/*  $MAC(CBRUXCPL) COMP(BL) PROD(OAM):                              */ 00350000
*/*                                                                  */ 00400000
*/*  MACRO NAME       = CBRUXCPL                                     */ 00450000
*/*                                                                  */ 00500000
*/*  DESCRIPTIVE NAME = CHANGE USE ATTRIBUTE INSTALLATION EXIT       */ 00550000
*/*                     PARAMETER LIST                               */ 00600000
*/*                                                                  */ 00650000
*/*PROPRIETARY V3 STATEMENT                                          */ 00700000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00750000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00800000
*/*5695-DF1                                                          */ 00850000
*/*(C) COPYRIGHT 1993,1999  IBM CORP.                                */ 00900000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00950000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/*  INVOCATION       = PLX:   %INCLUDE SYSLIB(CBRUXCPL)             */ 01150000
*/*                     ASMH:           CBRUXCPL ,                   */ 01200000
*/*                                                                  */ 01250000
*/*  NOTE:  WHEN CUA PROCESSING IS BEING PERFORMED TO CHANGE         */ 01300000
*/*         THE VOLUME USE ATTRIBUTE TO PRIVATE, THE FIELDS          */ 01350000
*/*         IN THE UXCPL AS PASSED TO THE INSTALLATION EXIT          */ 01400000
*/*         REFLECT THE UPDATED VOLUME RECORD:  I.E., THE            */ 01450000
*/*         USE ATTRIBUTE WILL BE SET TO PRIVATE AND OTHER           */ 01500000
*/*         FIELDS MAY BE UPDATED ACCORDING TO THE CUA REQUEST.      */ 01550000
*/*                                                                  */ 01600000
*/*         WHEN CUA PROCESSING IS BEING PERFORMED TO CHANGE         */ 01650000
*/*         THE VOLUME TO SCRATCH, HOWEVER, THE FIELDS IN THE        */ 01700000
*/*         UXCPL REFLECT THE EXISTING TAPE VOLUME RECORD.           */ 01750000
*/*         THE DEFAULT VALUES FOR A SCRATCH VOLUME WILL BE SET      */ 01800000
*/*         UPON RETURN TO LCS, THEREBY POTENTIALLY OVERRIDING       */ 01850000
*/*         ANY VALUES RETURNED BY THE EXIT FOR THE FOLLOWING:       */ 01900000
*/*                                                                  */ 01950000
*/*             TAPE VOLUME RECORD       DEFAULT SCRATCH             */ 02000000
*/*                 ATTRIBUTE            VALUE SET BY LCS            */ 02050000
*/*                                                                  */ 02100000
*/*              STORAGE GROUP NAME         '*SCRTCH*'               */ 02150000
*/*              EXPIRATION DATE              BLANK                  */ 02200000
*/*              WRITE PROTECTION              'N'                   */ 02250000
*/*              CHECKPOINT VOLUME             'N'                   */ 02300000
*/*                                                                  */ 02350000
*/*                                                                  */ 02400000
*/*  CHANGE ACTIVITY:                                                */ 02450000
*/*  $L0=ATL  410 061091 TUCHLO:  ATL SUPPORT                        */ 02500000
*/*  $P1=ATL  410 010992 TUCHO:   ATL IUT: KBL0246                   */ 02550000
*/*  $D1=ATL  410 022492 TUCHO:   KBL0235: ADD A FIELD TO ALLOW THE  */ 02600000
*/*      ISSUER OF THE CBRXLCS MACRO TO PASS INFORMATION TO THE      */ 02650000
*/*      CHANGE USE ATTRIBUTE INSTALLATION EXIT                  @D1A*/ 02700000
*/*  $L1=ATL2 410 040792 TUCHO:   MIXED MEDIA/MIXED DEVICE SUPPORT   */ 02750000
*/*  $L2=BLYTHE 130 092995 TUCLJS:  3590 DEVICE SUPPORT              */ 02775000
*/*  $L3=CONDOR 140 010897 TUCLJS:  MEDIA4 COMMENT CHANGES ONLY  @L3A*/ 02787500
*/*  $L4=OW38975 1E0 051399 TUCSPP: BLYTHE2 DEVICE SUPPORT       @L4A*/ 02793700
*/*                                                                  */ 02800000
*/********************************************************************/ 02850000
*%GOTO UXCPLAS;                     /*                                  02900000
         SPACE 2                                                        02950000
UXCPL    DSECT ,                    CBRUXCUA PARAMETER LIST             03000000
         SPACE 1                                                        03050000
******************************************************************      03100000
*                                                                *      03150000
*    CHANGE USE ATTRIBUTE INSTALLATION EXIT PARAMETERS           *      03200000
*                                                                *      03250000
******************************************************************      03300000
UXCPARM  DS    0D                   CBRUXCUA PARAMETER SECTION          03350000
UXCLIB   DS    CL8                  LIBRARY NAME                        03400000
*                                     (INPUT VARIABLE)                  03450000
UXCLDEV  DS    CL8                  LIBRARY DEVICE TYPE                 03500000
*                                     (INPUT VARIABLE)                  03550000
UXCLCON  DS    CL8                  LIBRARY CONSOLE NAME                03600000
*                                     (INPUT VARIABLE)                  03650000
UXCLTYP  DS    CL1                  LIBRARY LOGICAL TYPE                03700000
*                                     'R' FOR AUTOMATED LIBRARY         03750000
*                                     'M' FOR MANUAL LIBRARY            03800000
*                                     (INPUT VARIABLE)                  03850000
         DS    CL7                  RESERVED                            03900000
UXCLDESC DS    CL120                LIBRARY DESCRIPTION                 03950000
*                                     (INPUT VARIABLE)                  04000000
         DS    CL8                  RESERVED                            04050000
UXCVOLSR DS    CL6                  VOLUME SERIAL NUMBER                04100000
*                                     (INPUT VARIABLE)                  04150000
         DS    CL1                  RESERVED                       @P1C 04200000
UXCCUSEA DS    CL1                  CURRENT USE ATTRIBUTE OF THE VOLUME 04250000
*                                   AS RECORDED IN THE TAPE VOLUME      04300000
*                                   RECORD IN THE TCDB                  04350000
*                                     'P' FOR PRIVATE                   04400000
*                                     'S' FOR SCRATCH                   04450000
*                                     (INPUT VARIABLE)             @P1A 04500000
UXCUSEA  DS    CL1                  REQUESTED VOLUME USE ATTRIBUTE      04550000
*                                   SPECIFIED ON THE CBRXLCS MACRO      04600000
*                                     'P' FOR PRIVATE                   04650000
*                                     'S' FOR SCRATCH                   04700000
*                                     (INPUT VARIABLE)                  04750000
UXCWPROT DS    CL1                  WRITE PROTECTION STATUS             04800000
*                                     'Y' FOR WRITE-PROTECTED           04850000
*                                     'N' FOR NOT WRITE-PROTECTED       04900000
*                                     (INPUT FOR CHANGE TO SCRATCH      04950000
*                                      OUTPUT FOR CHANGE TO PRIVATE)    05000000
UXCCHKPT DS    CL1                  CHECKPOINT VOLUME INDICATOR         05050000
*                                     'Y' FOR CHECKPOINT VOLUME         05100000
*                                     'N' FOR NOT CHECKPOINT VOLUME     05150000
*                                     (INPUT FOR CHANGE TO SCRATCH      05200000
*                                      OUTPUT FOR CHANGE TO PRIVATE)    05250000
UXCLOC   DS    CL1                  VOLUME LOCATION CODE                05300000
*                                     'L' FOR LIBRARY-RESIDENT          05350000
*                                     'S' FOR SHELF-RESIDENT            05400000
*                                     (INPUT/OUTPUT VARIABLE)           05450000
UXCTDSI  DS    0F                   TAPE DEVICE SELECTION INFORMATION   05500000
UXCREC   DS    XL1                   RECORDING TECHNOLOGY          @L1A 05550000
*                                     (INPUT VARIABLE)             @L1A 05600000
UXCMEDIA DS    XL1                   MEDIA TYPE                    @L1A 05650000
*                                     (INPUT VARIABLE)             @L1A 05700000
UXCCOMP  DS    XL1                   COMPACTION                    @L1A 05750000
*                                     (INPUT VARIABLE)             @L1A 05800000
UXCSPEC  DS    XL1                   SPECIAL ATTRIBUTE             @L1A 05850000
*                                     (INPUT VARIABLE)             @L1A 05900000
UXCGROUP DS    CL8                  STORAGE GROUP NAME                  05950000
*                                     (INPUT FOR CHANGE TO SCRATCH      06000000
*                                      OUTPUT FOR CHANGE TO PRIVATE)    06050000
UXCSHLOC DS    CL32                 SHELF LOCATION                      06100000
*                                     (INPUT/OUTPUT VARIABLE)           06150000
UXCOWNER DS    CL64                 VOLUME OWNER INFORMATION            06200000
*                                     (INPUT/OUTPUT VARIABLE)           06250000
         DS    CL8                  RESERVED                            06300000
UXCCREAT DS    CL10                 VOLUME RECORD CREATION DATE         06350000
*                                     (INPUT VARIABLE)                  06400000
UXCENTEJ DS    CL10                 LAST ENTRY OR EJECTION DATE         06450000
*                                     (INPUT VARIABLE)                  06500000
UXCMOUNT DS    CL10                 LAST MOUNTED DATE                   06550000
*                                     (INPUT/OUTPUT VARIABLE)           06600000
UXCWRITE DS    CL10                 LAST WRITTEN DATE                   06650000
*                                     (INPUT/OUTPUT VARIABLE)           06700000
UXCEXPIR DS    CL10                 VOLUME EXPIRATION DATE              06750000
*                                     (INPUT FOR CHANGE TO SCRATCH      06800000
*                                      OUTPUT FOR CHANGE TO PRIVATE)    06850000
         DS    CL10                 RESERVED                            06900000
         DS    CL4                  RESERVED                            06950000
UXCEXITI DS    CL16                 INFORMATION TO BE PASSED TO THE     07000000
*                                     INSTALLATION EXIT            @D1C 07050000
         DS    0D                   END OF UXCPL                        07100000
UXCPLLEN EQU   *-UXCPL                                                  07150000
         SPACE 1                                                        07200000
****************************************************************        07250000
*                                                              *        07300000
*    RETURN CODES                                              *        07350000
*                                                              *        07400000
****************************************************************        07450000
UXCNOCHG EQU   0                 CHANGE THE VOLUME USE ATTRIBUTE AS     07500000
*                                  REQUESTED USING PARAMETER VALUES     07550000
*                                  PASSED IN ON INPUT                   07600000
UXCCHG   EQU   4                 CHANGE THE USE ATTRIBUTE AS            07650000
*                                  REQUESTED BUT NOTE THAT PARAMETER    07700000
*                                  VALUES HAVE BEEN RETURNED BY EXIT    07750000
UXCFAIL  EQU   8                 DO NOT CHANGE THE VOLUME USE           07800000
*                                  ATTRIBUTE                            07850000
*        EQU   12                RESERVED                               07900000
UXCDONT  EQU   16                DO NOT CALL THE VOLUME USE             07950000
*                                   ATTRIBUTE INSTALLATION EXIT         08000000
*                                   AGAIN, BUT CHANGE THE USE           08050000
*                                   ATTRIBUTE AS REQUESTED USING        08100000
*                                   PARAMETER VALUES PASSED IN          08150000
*                                   ON INPUT                            08200000
         SPACE 1                                                        08250000
******************************************************************      08300000
*                                                                *      08350000
*    LIBRARY LOGICAL TYPE CONSTANTS                              *      08400000
*                                                                *      08450000
******************************************************************      08500000
UXCREAL  EQU   C'R'                 AUTOMATED LIBRARY                   08550000
UXCMAN   EQU   C'M'                 MANUAL LIBRARY                      08600000
         SPACE 1                                                        08650000
******************************************************************      08700000
*                                                                *      08750000
*    USE ATTRIBUTE CONSTANTS                                     *      08800000
*                                                                *      08850000
******************************************************************      08900000
UXCPRIV  EQU   C'P'                 PRIVATE USE ATTRIBUTE               08950000
UXCSCRT  EQU   C'S'                 SCRATCH USE ATTRIBUTE               09000000
         SPACE 1                                                        09050000
******************************************************************      09100000
*                                                                *      09150000
*    TAPE DEVICE SELECTION INFORMATION CONSTANTS                 * @L1A 09200000
*                                                                *      09250000
******************************************************************      09300000
UXNOCAR  EQU   0                    ZERO IS AN ACCEPTABLE TDSI VALUE    09350000
******************************************************************      09400000
*    CONSTANTS TO DEFINE RECORDING TECHNOLOGY                    * @L1A 09450000
******************************************************************      09500000
UXCNOREC EQU   0                    RECORDING TECHNOLOGY UNKNOWN OR     09550000
*                                     UNSPECIFIED                  @L1A 09600000
UXC18TRK EQU   1                    READ/WRITE ON 18-TRACK DEVICE  @L1A 09650000
UXC36TRK EQU   2                    READ/WRITE ON 36-TRACK DEVICE  @L1A 09700000
UXC128TRK EQU  3                    READ/WRITE ON 128-TRACK DEVICE @L2A 09725000
UXC256TRK EQU  4                    READ/WRITE ON 256-TRACK DEVICE @L4A 09737500
******************************************************************      09750000
*    CONSTANTS TO DEFINE MEDIA TYPE                              * @L1A 09800000
******************************************************************      09850000
UXCNOMED EQU   0                    MEDIA TYPE UNKNOWN OR               09900000
*                                     UNSPECIFIED                  @L1A 09950000
UXCMED1  EQU   1                    MEDIA1 - CARTRIDGE SYSTEM TAPE @L1A 10000000
UXCMED2  EQU   2                    MEDIA2 - ENHANCED CAPACITY          10050000
*                                     CARTRIDGE SYSTEM TAPE        @L1A 10100000
UXCMED3  EQU   3                    MEDIA3 - HIGH PERFORMANCE           10110000
*                                     CARTRIDGE TAPE               @L2A 10120000
UXCMED4  EQU   4                    MEDIA4 - EXTENDED HIGH PERFORMANCE  10130000
*                                     CARTRIDGE TAPE               @L3C 10140000
******************************************************************      10150000
*         CONSTANTS TO DEFINE COMPACTION                         * @L1A 10170000
*    (THE MEANING OF THE COMPACTION FIELD HAS CHANGED FROM       * @L2A 10190000
*     TYPE OF COMPACTION TO COMPACTION YES/NO.  UXCIDRC AND      * @L2A 10210000
*     UXCCOMPT CAN BE USED INTERCHANGEABLY.)                     * @L2A 10230000
******************************************************************      10250000
UXCCMPNS EQU   0                    COMPACTION UNKNOWN OR NOT SET  @L1A 10300000
UXCNOCMP EQU   1                    NO COMPACTION                  @L1A 10400000
UXCIDRC  EQU   2                    COMPACTION                     @L2C 10450000
UXCCOMPT EQU   2                    COMPACTION                     @L2A 10500000
******************************************************************      10550000
*    CONSTANTS TO DEFINE SPECIAL ATTRIBUTE                       * @L1A 10600000
******************************************************************      10650000
UXCNOSPC EQU   0                    VOLUME HAS NO SPECIAL ATTRIBUTE     10700000
UXCRDCOM EQU   1                    VOLUME WILL BE MOUNTED FOR READ     10750000
*                                     ONLY - ALL READ-COMPATIBLE        10800000
*                                     DEVICES MAY BE SELECTED      @L1A 10850000
******************************************************************      10900000
*                                                                *      10950000
*    MISCELLANEOUS CONSTANTS                                     *      11000000
*                                                                *      11050000
******************************************************************      11100000
UXCPLSP  EQU   230                  UXCPL SUBPOOL NUMBER           @P1C 11150000
UXCYES   EQU   C'Y'                 YES                                 11200000
UXCNO    EQU   C'N'                 NO                                  11250000
UXCBLANK EQU   C' '                 BLANK                               11300000
         SPACE 2                                                        11350000
         MEND  ,                                                   */   11400000
*%UXCPLAS: ;                                                            11450000
*@SPACE(2);                                                             11500000
*/******************************************************************/   11550000
*/*                                                                */   11600000
*/*   CHANGE USE ATTRIBUTE INSTALLATION EXIT PARAMETERS            */   11650000
*/*                                                                */   11700000
*/******************************************************************/   11750000
*DCL 1 UXCPL BDY(DWORD) BASED,      /* CBRUXCUA PARAMETER LIST     */   11800000
*     3 UXCPARM,                                                        11850000
*       5 UXCLIB    CHAR(8),        /* LIBRARY NAME                     11900000
*                                      (INPUT VARIABLE)            */   11950000
*       5 UXCLDEV   CHAR(8),        /* LIBRARY DEVICE TYPE              12000000
*                                      (INPUT VARIABLE)            */   12050000
*       5 UXCLCON   CHAR(8),        /* LIBRARY CONSOLE NAME             12100000
*                                      (INPUT VARIABLE)            */   12150000
*       5 UXCLTYP   CHAR(1),        /* LIBRARY LOGICAL TYPE             12200000
*                                      'R' FOR AUTOMATED LIBRARY        12250000
*                                      'M' FOR MANUAL LIBRARY           12300000
*                                      (INPUT VARIABLE)            */   12350000
*       5 *         CHAR(7),        /* RESERVED                    */   12400000
*       5 UXCLDESC  CHAR(120),      /* LIBRARY DESCRIPTION              12450000
*                                      (INPUT VARIABLE)            */   12500000
*       5 *         CHAR(8),        /* RESERVED                    */   12550000
*       5 UXCVOLSR  CHAR(6),        /* VOLUME SERIAL NUMBER             12600000
*                                      (INPUT VARIABLE)            */   12650000
*       5 *         CHAR(1),        /* RESERVED                @P1C*/   12700000
*       5 UXCCUSEA  CHAR(1),        /* CURRENT USE ATTRIBUTE OF THE     12750000
*                                      VOLUME AS RECORDED IN THE TAPE   12800000
*                                      VOLUME RECORD IN THE TCDB        12850000
*                                      'P' FOR PRIVATE                  12900000
*                                      'S' FOR SCRATCH                  12950000
*                                      (INPUT VARIABLE)        @P1A*/   13000000
*       5 UXCUSEA   CHAR(1),        /* REQUESTED USE ATTRIBUTE          13050000
*                                      SPECIFIED ON THE CBRXLCS         13100000
*                                      MACRO INVOCATION                 13150000
*                                      'P' FOR PRIVATE                  13200000
*                                      'S' FOR SCRATCH                  13250000
*                                      (INPUT VARIABLE)        @P1C*/   13300000
*       5 UXCWPROT  CHAR(1),        /* WRITE PROTECTION STATUS          13350000
*                                      'Y' FOR WRITE-PROTECTED          13400000
*                                      'N' FOR NOT WRITE-PROTECTED      13450000
*                                     (INPUT VARIABLE FOR CHANGE TO     13500000
*                                      SCRATCH, OUTPUT VARIABLE FOR     13550000
*                                      CHANGE TO PRIVATE)          */   13600000
*       5 UXCCHKPT  CHAR(1),        /* CHECKPOINT VOLUME INDICATOR      13650000
*                                      'Y' FOR CHECKPOINT VOLUME        13700000
*                                      'N' FOR NOT CHECKPOINT VOLUME    13750000
*                                     (INPUT VARIABLE FOR CHANGE TO     13800000
*                                      SCRATCH, OUTPUT VARIABLE FOR     13850000
*                                      CHANGE TO PRIVATE)          */   13900000
*       5 UXCLOC    CHAR(1),        /* VOLUME LOCATION CODE             13950000
*                                      'L' FOR LIBRARY-RESIDENT         14000000
*                                      'S' FOR SHELF-RESIDENT           14050000
*                                      (INPUT/OUTPUT VARIABLE)     */   14100000
*       5 UXCTDSI   BIT(32),        /* TAPE DEVICE SELECTION            14150000
*                                      INFORMATION                      14200000
*                                      (INPUT VARIABLE)        @L1A*/   14250000
*         7 UXCREC FIXED(8),        /* RECORDING TECHNOLOGY             14300000
*                                      (INPUT VARIABLE)        @L1A*/   14350000
*         7 UXCMEDIA FIXED(8),      /* MEDIA TYPE                       14400000
*                                      (INPUT VARIABLE)        @L1A*/   14450000
*         7 UXCCOMP FIXED(8),       /* COMPACTION                       14500000
*                                      (INPUT VARIABLE)        @L1A*/   14550000
*         7 UXCSPEC FIXED(8),       /* SPECIAL ATTRIBUTE                14600000
*                                      (INPUT VARIABLE         @L1A*/   14650000
*       5 UXCGROUP  CHAR(8),        /* STORAGE GROUP NAME               14700000
*                                     (INPUT VARIABLE FOR CHANGE TO     14750000
*                                      SCRATCH, OUTPUT VARIABLE FOR     14800000
*                                      CHANGE TO PRIVATE)          */   14850000
*       5 UXCSHLOC  CHAR(32),       /* SHELF LOCATION                   14900000
*                                      (INPUT/OUTPUT VARIABLE)     */   14950000
*       5 UXCOWNER  CHAR(64),       /* VOLUME OWNER INFORMATION         15000000
*                                      (INPUT/OUTPUT VARIABLE)     */   15050000
*       5 *         CHAR(8),        /* RESERVED                    */   15100000
*       5 UXCCREAT  CHAR(10),       /* VOLUME RECORD CREATION DATE      15150000
*                                      (INPUT VARIABLE)            */   15200000
*       5 UXCENTEJ  CHAR(10),       /* LAST ENTRY OR EJECTION DATE      15250000
*                                      (INPUT VARIABLE)            */   15300000
*       5 UXCMOUNT  CHAR(10),       /* LAST MOUNTED DATE                15350000
*                                      (INPUT/OUTPUT VARIABLE)     */   15400000
*       5 UXCWRITE  CHAR(10),       /* LAST WRITTEN DATE                15450000
*                                      (INPUT/OUTPUT VARIABLE)     */   15500000
*       5 UXCEXPIR  CHAR(10),       /* VOLUME EXPIRATION DATE           15550000
*                                     (INPUT VARIABLE FOR CHANGE TO     15600000
*                                      SCRATCH, OUTPUT VARIABLE FOR     15650000
*                                      CHANGE TO PRIVATE)          */   15700000
*       5 *         CHAR(10),       /* RESERVED                    */   15750000
*       5 *         CHAR(4),        /* RESERVED                    */   15800000
*       5 UXCEXITI  CHAR(16);       /* INFORMATION TO BE PASSED TO      15850000
*                                      THE INSTALLATION EXIT   @D1A*/   15900000
*                                                                       15950000
*@SPACE (1);                                                            16000000
*/******************************************************************/   16050000
*/*                                                                */   16100000
*/*   RETURN CODES                                                 */   16150000
*/*                                                                */   16200000
*/******************************************************************/   16250000
*  DECLARE                                                              16300000
*   UXCNOCHG FIXED(31) CONSTANT(0), /* CHANGE THE VOLUME USE ATTRIBUTE  16350000
*                                      AS REQUESTED USING PARAMETER     16400000
*                                      VALUES PASSED IN ON INPUT   */   16450000
*   UXCCHG   FIXED(31) CONSTANT(4), /* CHANGE THE USE ATTRIBUTE AS      16500000
*                                      REQUESTED BUT NOTE THAT          16550000
*                                      PARAMETER VALUES HAVE BEEN       16600000
*                                      RETURNED BY THE EXIT        */   16650000
*   UXCFAIL  FIXED(31) CONSTANT(8), /* DO NOT CHANGE THE VOLUME         16700000
*                                      USE ATTRIBUTE               */   16750000
*   UXCDONT  FIXED(31) CONSTANT(16);/* DO NOT CALL THE VOLUME USE       16800000
*                                      ATTRIBUTE INSTALLATION EXIT      16850000
*                                      AGAIN, BUT CHANGE THE USE        16900000
*                                      ATTRIBUTE AS REQUESTED USING     16950000
*                                      PARAMETER VALUES PASSED IN       17000000
*                                      ON INPUT                    */   17050000
*                                                                       17100000
*@SPACE (1);                                                            17150000
*/*******************************************************************/  17200000
*/*                                                                 */  17250000
*/*   LIBRARY LOGICAL TYPE CONSTANTS                                */  17300000
*/*                                                                 */  17350000
*/*******************************************************************/  17400000
*  DECLARE                                                              17450000
*   UXCREAL CHAR(1) CONSTANT('R'),  /* AUTOMATED LIBRARY            */  17500000
*   UXCMAN  CHAR(1) CONSTANT('M');  /* MANUAL LIBRARY               */  17550000
*                                                                       17600000
*@SPACE (1);                                                            17650000
*/*******************************************************************/  17700000
*/*                                                                 */  17750000
*/*   USE ATTRIBUTE CONSTANTS                                       */  17800000
*/*                                                                 */  17850000
*/*******************************************************************/  17900000
*  DECLARE                                                              17950000
*   UXCPRIV CHAR(1) CONSTANT('P'),  /* PRIVATE USE ATTRIBUTE        */  18000000
*   UXCSCRT CHAR(1) CONSTANT('S');  /* SCRATCH USE ATTRIBUTE        */  18050000
*                                                                       18100000
*@SPACE (1);                                                            18150000
*/*******************************************************************/  18200000
*/*                                                                 */  18250000
*/*  TAPE DEVICE SELECTION INFORMATION CONSTANTS              @L1A  */  18300000
*/*                                                                 */  18350000
*/*******************************************************************/  18400000
*  DECLARE                                                              18450000
*   UXNOCAR FIXED(31) CONSTANT(0), /* ZERO IS AN ACCEPTABLE TDSI        18500000
*                                     VALUE                     @L1A*/  18550000
*/*******************************************************************/  18600000
*/*  CONSTANTS TO DEFINE RECORDING TECHNOLOGY                   @L1A*/  18650000
*/*******************************************************************/  18700000
*   UXCNOREC FIXED(8) CONSTANT(0), /* RECORDING TECHNOLOGY UNKNOWN OR   18750000
*                                     UNSPECIFIED               @L1A*/  18800000
*   UXC18TRK FIXED(8) CONSTANT(1), /* READ/WRITE ON 18-TRACK            18850000
*                                     DEVICE                    @L1A*/  18900000
*   UXC36TRK FIXED(8) CONSTANT(2), /* READ/WRITE ON 36-TRACK            18950000
*                                     DEVICE                    @L1A*/  19000000
*   UXC128TRK FIXED(8) CONSTANT(3), /* READ/WRITE ON 128-TRACK          19016600
*                                     DEVICE                    @L2A*/  19033200
*   UXC256TRK FIXED(8) CONSTANT(4), /* READ/WRITE ON 256-TRACK          19038800
*                                     DEVICE                    @L4A*/  19044400
*/*******************************************************************/  19050000
*/*  CONSTANTS TO DEFINE MEDIA TYPE                             @L1A*/  19100000
*/*******************************************************************/  19150000
*   UXCNOMED FIXED(8) CONSTANT(0), /* MEDIA TYPE UNKNOWN OR             19200000
*                                     UNSPECIFIED               @L1A*/  19250000
*   UXCMED1  FIXED(8) CONSTANT(1), /* MEDIA1 - CARTRIDGE SYSTEM TAPE    19300000
*                                                               @L1A*/  19350000
*   UXCMED2  FIXED(8) CONSTANT(2), /* MEDIA2 - ENHANCED CAPACITY        19400000
*                                     CARTRIDGE SYSTEM TAPE     @L1A*/  19450000
*   UXCMED3  FIXED(8) CONSTANT(3), /* MEDIA3 - HIGH PERFORMANCE         19460000
*                                     CARTRIDGE TAPE            @L2A*/  19470000
*   UXCMED4  FIXED(8) CONSTANT(4), /* MEDIA4 - EXTENDED HIGH            19480000
*                                    PERFORMANCE CARTRIDGE TAPE @L3C*/  19490000
*/*******************************************************************/  19500000
*/*  CONSTANTS TO DEFINE COMPACTION                             @L1A*/  19520000
*/*    (THE MEANING OF THE COMPACTION FIELD HAS CHANGED         @L2A*/  19540000
*/*     FROM TYPE OF COMPACTION TO COMPACTION YES/NO.           @L2A*/  19560000
*/*     UXCIDRC AND UXCCOMPT CAN BE USED INTERCHANGEABLY.)      @L2A*/  19580000
*/*******************************************************************/  19600000
*   UXCCMPNS FIXED(8) CONSTANT(0), /* COMPACTION UNKNOWN OR NOT         19650000
*                                     SET                       @L1A*/  19700000
*   UXCNOCMP FIXED(8) CONSTANT(1), /* NO COMPACTION             @L1A*/  19750000
*   UXCIDRC  FIXED(8) CONSTANT(2), /* COMPACTION                @L2C*/  19800000
*   UXCCOMPT FIXED(8) CONSTANT(2), /* COMPACTION                @L2A*/  19850000
*/*******************************************************************/  19950000
*/*  CONSTANTS TO DEFINE SPECIAL ATTRIBUTE                      @L1A*/  20000000
*/*******************************************************************/  20050000
*   UXCNOSPC FIXED(8) CONSTANT(0), /* VOLUME HAS NO SPECIAL ATTRIBUTE   20100000
*                                                               @L1A*/  20150000
*   UXCRDCOM FIXED(8) CONSTANT(1); /* VOLUME WILL BE MOUNTED FOR READ   20200000
*                                     ONLY - ALL READ-COMPATIBLE        20250000
*                                     DEVICES MAY BE SELECTED   @L1A*/  20300000
*/*******************************************************************/  20350000
*/*                                                                 */  20400000
*/*   MISCELLANEOUS CONSTANTS                                       */  20450000
*/*                                                                 */  20500000
*/*******************************************************************/  20550000
*  DECLARE                                                              20600000
*    UXCPLLEN FIXED(31) CONSTANT(LENGTH(UXCPL)),                        20650000
*    UXCPLSP  FIXED(8)  CONSTANT(230),                      /*  @P1C*/  20700000
*    UXCYES   CHAR(1)   CONSTANT('Y'),                                  20750000
*    UXCNO    CHAR(1)   CONSTANT('N'),                                  20800000
*    UXCBLANK CHAR(1)   CONSTANT(' ');                                  20850000
*@SPACE(2);                                                             20900000
