*       %GOTO UXEPROL;        /* BILINGUAL MAPPING                      00050000
        MACRO                                                           00100000
        CBRUXEPL , */                                                   00150000
*%UXEPROL: ;                                                            00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/*  $MAC(CBRUXEPL) COMP(LT) PROD(OAM):                              */ 00350000
*/*                                                                  */ 00400000
*/*  MACRO NAME       = CBRUXEPL                                     */ 00450000
*/*                                                                  */ 00500000
*/*  DESCRIPTIVE NAME = CARTRIDGE ENTRY INSTALLATION EXIT (CBRUXENT) */ 00550000
*/*                     PARAMETER LIST                               */ 00600000
*/*                                                                  */ 00650000
*/*PROPRIETARY V3 STATEMENT                                          */ 00700000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00750000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00800000
*/*5695-DF1                                                          */ 00850000
*/*(C) COPYRIGHT 1993,1999  IBM CORP.                                */ 00900000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00950000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/*  INVOCATION       = PLX:   %INCLUDE SYSLIB(CBRUXEPL)             */ 01150000
*/*                     ASMH:           CBRUXEPL ,                   */ 01200000
*/*                                                                  */ 01250000
*/*  CHANGE ACTIVITY  = NONE                                         */ 01300000
*/*                                                                  */ 01350000
*/*  $L0=ATL     410 910816 TUCEMB: ATL SUPPORT                      */ 01400000
*/*  $D1=KBL0171 410 920124 TUCEMB: ADD RC = 12 (IGNORE)             */ 01450000
*/*  $D2=KBL0235 410 920217 TUCEMB: PASS THRU VALUE SUPPORT          */ 01500000
*/*  $L1=ATL2    410 920405 TUCEMB: TDSI SUPPORT                     */ 01550000
*/*  $L2=ASHFORK 120 930527 TUCEMB: MTL SUPPORT                      */ 01575000
*/*  $L3=BLYTHE  130 950929 TUCLJS: 3590 SUPPORT                     */ 01587500
*/*  $L4=CONDOR  140 970108 TUCLJS: MEDIA4 COMMENT CHANGES ONLY  @L4A*/ 01593700
*/*  $L5=VTSIXT  150 981204 TUCLJS: VTS IMPORT TOLERATION        @L5A*/ 01596800
*/*  $L6=VTSIXB  150 980729 TUCLJS: VTS IMPORT SUPPORT           @L6A*/ 01598400
*/*  $L7=OW38975 1E0 990513 TUCSPP: BLYTHE2 DEVICE SUPPORT       @L7A*/ 01599200
*/*  $L8=MTLSOFT 1E0 000413 TUCBJF: CHANGE MTLDS TO MTL AND      @L8A*/ 01599400
*/*                                 UPDATE EXPLANATIONS          @L8A*/ 01599600
*/*                                                                  */ 01600000
*/********************************************************************/ 01650000
*%GOTO UXEPLAS;                     /*                                  01700000
         SPACE 2                                                        01750000
UXEPL    DSECT ,                    CBRUXENT PARAMETER LIST             01800000
         SPACE 1                                                        01850000
*********************************************************************** 01900000
*                                                                     * 01950000
*    CARTRIDGE ENTRY INSTALLATION EXIT PARAMETERS                     * 02000000
*                                                                     * 02050000
*********************************************************************** 02100000
UXEPARM  DS    0D                   CBRUXENT PARAMETER SECTION          02150000
UXELIB   DS    CL8                  LIBRARY NAME                        02200000
*                                     (INPUT VARIABLE)                  02250000
UXELDEV  DS    CL8                  LIBRARY DEVICE TYPE                 02300000
*                                     (INPUT VARIABLE)                  02350000
UXELCON  DS    CL8                  LIBRARY CONSOLE NAME                02400000
*                                     (INPUT VARIABLE)                  02450000
UXELTYP  DS    CL1                  LIBRARY LOGICAL TYPE                02500000
*                                     'R' FOR AUTOMATED LIBRARY         02550000
*                                     'M' FOR MANUAL LIBRARY            02600000
*                                     (INPUT VARIABLE)                  02650000
         DS    CL7                  RESERVED                            02700000
UXELDESC DS    CL120                LIBRARY DESCRIPTION                 02750000
*                                     (INPUT VARIABLE)                  02800000
         DS    CL8                  RESERVED                            02850000
UXEVOLSR DS    CL6                  VOLUME SERIAL NUMBER                02900000
*                                     (INPUT VARIABLE)                  02950000
UXEVATTR DS    XL1                  VOLUME ATTRIBUTE               @L5A 02962500
*                                     0 PHYSICAL NON-VTS VOLUME    @L5A 02975000
*                                     1 LOGICAL VTS VOLUME         @L5A 02987500
*                                     2 IMPORTED VTS LOGICAL       @L6A 03000000
*                                       VOLUME                     @L6A 03012500
*                                     (INPUT VARIABLE)             @L5A 03025000
         DS    CL1                  RESERVED                       @L5C 03037500
UXEUSEA  DS    CL1                  VOLUME USE ATTRIBUTE                03050000
*                                     'P' FOR PRIVATE                   03100000
*                                     'S' FOR SCRATCH                   03150000
*                                     (INPUT/OUTPUT VARIABLE)           03200000
UXEWPROT DS    CL1                  WRITE PROTECTION STATUS             03250000
*                                     'Y' FOR WRITE-PROTECTED           03300000
*                                     'N' FOR NOT WRITE-PROTECTED       03350000
*                                     (INPUT/OUTPUT VARIABLE)           03400000
UXECHKPT DS    CL1                  CHECKPOINT VOLUME INDICATOR         03450000
*                                     'Y' FOR CHECKPOINT VOLUME         03500000
*                                     'N' FOR NOT CHECKPOINT VOLUME     03550000
*                                     (INPUT/OUTPUT VARIABLE)           03600000
UXELOC   DS    CL1                  VOLUME LOCATION CODE                03650000
*                                     'L' FOR LIBRARY-RESIDENT          03700000
*                                     'S' FOR SHELF-RESIDENT            03750000
*                                     (INPUT VARIABLE)                  03800000
UXETDSI  DS    0F                   TAPE DEVICE SELECTION INFO     @L1A 03850000
UXEREC   DS    XL1                  TAPE RECORDING TECHNOLOGY           03900000
*                                     (INPUT/OUTPUT VARIABLE)      @L1A 03950000
UXEMEDIA DS    XL1                  MEDIA TYPE                          04000000
*                                     (INPUT/OUTPUT VARIABLE FOR MTL)   04079990
*                                     (INPUT VARIABLE FOR ATLDS)   @L8C 04109980
UXECOMP  DS    XL1                  COMPACTION                          04150000
*                                     (INPUT/OUTPUT VARIABLE)      @L1A 04200000
UXESPEC  DS    XL1                  SPECIAL ATTRIBUTE                   04250000
*                                     (INPUT/OUTPUT VARIABLE)      @L1A 04300000
UXEGROUP DS    CL8                  STORAGE GROUP NAME                  04350000
*                                     (INPUT/OUTPUT VARIABLE)           04400000
UXESHLOC DS    CL32                 SHELF LOCATION                      04450000
*                                     (INPUT/OUTPUT VARIABLE)           04500000
UXEOWNER DS    CL64                 VOLUME OWNER INFORMATION            04550000
*                                     (INPUT/OUTPUT VARIABLE)           04600000
         DS    CL8                  RESERVED                            04650000
UXECREAT DS    CL10                 VOLUME RECORD CREATION DATE         04700000
*                                     (INPUT VARIABLE)                  04750000
UXEENTEJ DS    CL10                 LAST ENTRY OR EJECTION DATE         04800000
*                                     (INPUT VARIABLE)                  04850000
UXEMOUNT DS    CL10                 LAST MOUNTED DATE                   04900000
*                                     (INPUT/OUTPUT VARIABLE)           04950000
UXEWRITE DS    CL10                 LAST WRITTEN DATE                   05000000
*                                     (INPUT/OUTPUT VARIABLE)           05050000
UXEEXPIR DS    CL10                 VOLUME EXPIRATION DATE              05100000
*                                     (INPUT/OUTPUT VARIABLE)           05150000
         DS    CL10                 RESERVED                            05200000
         DS    CL4                  RESERVED                       @D2C 05250000
UXEEXITI DS    CL16                 INSTALLATION EXIT INFORMATION       05300000
*                                     (INPUT VARIABLE)             @D2A 05350000
         DS    0D                   END OF UXEPL                        05400000
UXEPLLEN EQU   *-UXEPL                                                  05450000
         SPACE 1                                                        05500000
*********************************************************************** 05550000
*                                                                     * 05600000
*    RETURN CODES                                                     * 05650000
*                                                                     * 05700000
*********************************************************************** 05750000
UXENOCHG EQU   0                    PERFORM ENTRY AS REQUESTED          05800000
*                                     USING PARAMETER VALUES            05850000
*                                     PASSED IN ON INPUT                05900000
UXECHG   EQU   4                    PERFORM ENTRY REQUEST BUT           05950000
*                                     NOTE THAT PARAMETER VALUES        06000000
*                                     HAVE CHANGED ON EXIT              06050000
UXEFAIL  EQU   8                    DENY ENTER REQUEST (FOR AN ATLDS    06100000
*                                     THE VOLUME IS EJECTED FROM THE    06169990
*                                     LIBRARY)                     @L8C 06209980
UXEIGNOR EQU   12                   IGNORE ENTER REQUEST (FOR AN ATLDS  06250000
*                                     THE VOLUME REMAINS IN THE         06304990
*                                     LIBRARY IN THE INSERT CATEGORY)   06334980
*                                                                  @L8C 06364970
UXEDONT  EQU   16                   DO NOT CALL THE CARTRIDGE           06400000
*                                     ENTRY INSTALLATION EXIT AGAIN     06450000
*                                     AND PERFORM CARTRIDGE ENTRY       06500000
*                                     AS REQUESTED USING THE            06550000
*                                     PARAMETER VALUES PASSED IN        06600000
*                                     ON INPUT                          06650000
         SPACE 1                                                        06700000
*********************************************************************** 06750000
*                                                                     * 06800000
*    LIBRARY LOGICAL TYPE CONSTANTS                                   * 06850000
*                                                                     * 06900000
*********************************************************************** 06950000
UXEAUTO  EQU   C'R'                 AUTOMATED/REAL LIBRARY              07000000
UXEMAN   EQU   C'M'                 MANUAL LIBRARY                      07050000
         SPACE 1                                                        07055500
*********************************************************************** 07061000
*                                                                     * 07066500
*    VOLUME ATTRIBUTE CONSTANTS                                   @L5A* 07072000
*                                                                     * 07077500
*********************************************************************** 07083000
UXEPHYCL EQU   0                    PHYSICAL NON-VTS VOLUME       @L5A  07088500
UXELOGCL EQU   1                    LOGICAL VTS VOLUME            @L5A  07094000
UXEIMPRT EQU   2                    IMPORTED VTS LOGICAL VOLUME   @L6A  07097000
         SPACE 1                                                        07100000
*********************************************************************** 07150000
*                                                                     * 07200000
*    USE ATTRIBUTE CONSTANTS                                          * 07250000
*                                                                     * 07300000
*********************************************************************** 07350000
UXEPRIV  EQU   C'P'                 PRIVATE USE ATTRIBUTE               07400000
UXESCRT  EQU   C'S'                 SCRATCH USE ATTRIBUTE               07450000
         SPACE 1                                                        07500000
*********************************************************************** 07550000
*                                                                     * 07600000
*    TAPE DEVICE SELECTION INFORMATION (TDSI) CONSTANTS               * 07650000
*                                                                     * 07700000
*********************************************************************** 07750000
UXENOCAR EQU   0                    ZERO IS AN ACCEPTABLE VALUE         07800000
*                                     FOR TDSI                     @L1A 07850000
*********************************************************************** 07900000
*    CONSTANTS TO DEFINE TAPE RECORDING TECHNOLOGY                    * 07950000
*********************************************************************** 08000000
UXENOREC EQU   0                    RECORDING TECHNOLOGY UNKNOWN        08050000
*                                     OR UNSPECIFIED               @L1A 08100000
UXE18TRK EQU   1                    READ/WRITE ON AN 18 TRACK           08150000
*                                     DEVICE                       @L1A 08200000
UXE36TRK EQU   2                    READ/WRITE ON A 36 TRACK            08250000
*                                     DEVICE                       @L1A 08300000
UXE128TRK EQU  3                    READ/WRITE ON A 128 TRACK           08316600
*                                     DEVICE                       @L3A 08333200
UXE256TRK EQU  4                    READ/WRITE ON A 256 TRACK           08338800
*                                     DEVICE                       @L7A 08344400
*********************************************************************** 08350000
*    CONSTANTS TO DEFINE MEDIA TYPE                                   * 08400000
*********************************************************************** 08450000
UXENOMED EQU   0                    MEDIA TYPE UNKNOWN OR               08500000
*                                     UNSPECIFIED                  @L1A 08550000
UXEMED1  EQU   1                    MEDIA1 - CARTRIDGE SYSTEM TAPE @L1A 08600000
UXEMED2  EQU   2                    MEDIA2 - ENHANCED CAPACITY          08650000
*                                     CARTRIDGE SYSTEM TAPE        @L1A 08700000
UXEMED3  EQU   3                    MEDIA3 - HIGH PERFORMANCE           08710000
*                                     CARTRIDGE TAPE               @L3A 08720000
UXEMED4  EQU   4                    MEDIA4 - EXTENDED HIGH PERFORMANCE  08730000
*                                     CARTRIDGE TAPE               @L4C 08740000
*********************************************************************** 08750000
*    CONSTANTS TO DEFINE COMPACTION                                   * 08770000
* (THE MEANING OF THE COMPACTION FIELD HAS CHANGED FROM TYPE OF       * 08790000
*  COMPACTION TO COMPACTION YES/NO - UXEIDRC AND UXECOMPT CAN BE      * 08810000
*  USED INTERCHANGEABLY)                                          @L3C* 08830000
*********************************************************************** 08850000
UXECMPNS EQU   0                    COMPACTION UNKNOWN OR NOT SET  @L1A 08900000
UXENOCMP EQU   1                    NO COMPACTION                  @L1A 09000000
UXEIDRC  EQU   2                    COMPACTION                     @L3C 09033300
UXECOMPT EQU   2                    COMPACTION                     @L3A 09066600
*********************************************************************** 09100000
*    CONSTANTS TO DEFINE SPECIAL ATTRIBUTE                            * 09150000
*********************************************************************** 09200000
UXENOSPC EQU   0                    VOLUME HAS NO SPECIAL               09250000
*                                     ATTRIBUTE                    @L1A 09300000
UXERDCOM EQU   1                    VOLUME WILL BE MOUNTED FOR READ     09350000
*                                     ONLY - ALL READ-COMPATIBLE        09400000
*                                     DEVICES MAY BE SELECTED      @L1A 09450000
         SPACE 1                                                        09500000
*********************************************************************** 09550000
*                                                                     * 09600000
*    MISCELLANEOUS CONSTANTS                                          * 09650000
*                                                                     * 09700000
*********************************************************************** 09750000
UXEPLSP  EQU   0                    UXEPL SUBPOOL NUMBER                09800000
UXEYES   EQU   C'Y'                 YES                                 09850000
UXENO    EQU   C'N'                 NO                                  09900000
UXEBLANK EQU   C' '                 BLANK                               09950000
         SPACE 2                                                        10000000
         MEND  ,                                                     */ 10050000
*%UXEPLAS: ;                                                            10100000
*@SPACE(2);                                                             10150000
*/********************************************************************/ 10200000
*/*                                                                  */ 10250000
*/*   CARTRIDGE ENTRY INSTALLATION EXIT PARAMETERS                   */ 10300000
*/*                                                                  */ 10350000
*/********************************************************************/ 10400000
*DCL 1 UXEPL BDY(DWORD) BASED,      /* CBRUXENT PARAMETER LIST       */ 10450000
*     3 UXEPARM,                                                        10500000
*       5 UXELIB    CHAR(8),        /* LIBRARY NAME                     10550000
*                                      (INPUT VARIABLE)              */ 10600000
*       5 UXELDEV   CHAR(8),        /* LIBRARY DEVICE TYPE              10650000
*                                      (INPUT VARIABLE)              */ 10700000
*       5 UXELCON   CHAR(8),        /* LIBRARY CONSOLE NAME             10750000
*                                      (INPUT VARIABLE)              */ 10800000
*       5 UXELTYP   CHAR(1),        /* LIBRARY LOGICAL TYPE             10850000
*                                      'R' FOR AUTOMATED LIBRARY        10900000
*                                      'M' FOR MANUAL LIBRARY           10950000
*                                      (INPUT VARIABLE)              */ 11000000
*       5 *         CHAR(7),        /* RESERVED                      */ 11050000
*       5 UXELDESC  CHAR(120),      /* LIBRARY DESCRIPTION              11100000
*                                      (INPUT VARIABLE)              */ 11150000
*       5 *         CHAR(8),        /* RESERVED                      */ 11200000
*       5 UXEVOLSR  CHAR(6),        /* VOLUME SERIAL NUMBER             11250000
*                                      (INPUT VARIABLE)              */ 11300000
*       5 UXEVATTR  FIXED(8),       /* VOLUME ATTRIBUTE                 11316600
*                                      0 FOR PHYSICAL NON-VTS VOLUME    11333200
*                                      1 FOR LOGICAL VTS VOLUME         11349800
*                                      2 FOR IMPORTED VTS LOGICAL       11358100
*                                        VOLUME                         11366400
*                                      (INPUT VARIABLE)          @L6C*/ 11374700
*       5 *         CHAR(1),        /* RESERVED                  @L5C*/ 11383000
*       5 UXEUSEA   CHAR(1),        /* VOLUME USE ATTRIBUTE             11400000
*                                      'P' FOR PRIVATE                  11450000
*                                      'S' FOR SCRATCH                  11500000
*                                      (INPUT/OUTPUT VARIABLE)       */ 11550000
*       5 UXEWPROT  CHAR(1),        /* WRITE PROTECTION STATUS          11600000
*                                      'Y' FOR WRITE-PROTECTED          11650000
*                                      'N' FOR NOT WRITE-PROTECTED      11700000
*                                      (INPUT/OUTPUT VARIABLE)       */ 11750000
*       5 UXECHKPT  CHAR(1),        /* CHECKPOINT VOLUME INDICATOR      11800000
*                                      'Y' FOR CHECKPOINT VOLUME        11850000
*                                      'N' FOR NOT CHECKPOINT           11900000
*                                          VOLUME                       11950000
*                                      (INPUT/OUTPUT VARIABLE)       */ 12000000
*       5 UXELOC    CHAR(1),        /* VOLUME LOCATION CODE             12050000
*                                      'L' FOR LIBRARY-RESIDENT         12100000
*                                      'S' FOR SHELF-RESIDENT           12150000
*                                      (INPUT VARIABLE)              */ 12200000
*       5 UXETDSI   FIXED(32),      /* TAPE DEVICE SELECTION            12250000
*                                      INFORMATION               @L1A*/ 12300000
*         7 UXEREC  FIXED(8),       /* TAPE RECORDING TECHNOLOGY        12350000
*                                      (INPUT/OUTPUT VARIABLE)   @L1A*/ 12400000
*         7 UXEMEDIA FIXED(8),      /* MEDIA TYPE                       12450000
*                                      (INPUT/OUTPUT VARIABLE           12500000
*                                       FOR MTL)                        12569990
*                                      (INPUT VARIABLE FOR              12600000
*                                       ATLDS)                   @L8C*/ 12669990
*         7 UXECOMP  FIXED(8),      /* COMPACTION                       12700000
*                                      (INPUT/OUTPUT VARIABLE)   @L1A*/ 12750000
*         7 UXESPEC  FIXED(8),      /* SPECIAL ATTRIBUTE                12800000
*                                      (INPUT/OUTPUT VARIABLE)   @L1A*/ 12850000
*       5 UXEGROUP  CHAR(8),        /* STORAGE GROUP NAME               12900000
*                                      (INPUT/OUTPUT VARIABLE)       */ 12950000
*       5 UXESHLOC  CHAR(32),       /* SHELF LOCATION                   13000000
*                                      (INPUT/OUTPUT VARIABLE)       */ 13050000
*       5 UXEOWNER  CHAR(64),       /* VOLUME OWNER INFORMATION         13100000
*                                      (INPUT/OUTPUT VARIABLE)       */ 13150000
*       5 *         CHAR(8),        /* RESERVED                      */ 13200000
*       5 UXECREAT  CHAR(10),       /* VOLUME RECORD CREATION DATE      13250000
*                                      (INPUT VARIABLE)              */ 13300000
*       5 UXEENTEJ  CHAR(10),       /* LAST ENTRY OR EJECTION DATE      13350000
*                                      (INPUT VARIABLE)              */ 13400000
*       5 UXEMOUNT  CHAR(10),       /* LAST MOUNTED DATE                13450000
*                                      (INPUT/OUTPUT VARIABLE)       */ 13500000
*       5 UXEWRITE  CHAR(10),       /* LAST WRITTEN DATE                13550000
*                                      (INPUT/OUTPUT VARIABLE)       */ 13600000
*       5 UXEEXPIR  CHAR(10),       /* VOLUME EXPIRATION DATE           13650000
*                                      (INPUT/OUTPUT VARIABLE)       */ 13700000
*       5 *         CHAR(10),       /* RESERVED                      */ 13750000
*       5 *         CHAR(4),        /* RESERVED                  @D2C*/ 13800000
*       5 UXEEXITI  CHAR(16);       /* INSTALLATION EXIT INFO           13850000
*                                      (INPUT VARIABLE)          @D2A*/ 13900000
*                                                                       13950000
*@SPACE (1);                                                            14000000
*/********************************************************************/ 14050000
*/*                                                                  */ 14100000
*/*   RETURN CODES                                                   */ 14150000
*/*                                                                  */ 14200000
*/********************************************************************/ 14250000
*  DECLARE                                                              14300000
*   UXENOCHG FIXED(31) CONSTANT(0),  /* PERFORM ENTRY AS REQUESTED      14350000
*                                       USING PARAMETER VALUES PASSED   14400000
*                                       IN ON INPUT                  */ 14450000
*   UXECHG   FIXED(31) CONSTANT(4),  /* PERFORM ENTRY REQUEST BUT       14500000
*                                       NOTE THAT PARAMETER VALUES      14550000
*                                       HAVE CHANGED ON EXIT         */ 14600000
*   UXEFAIL  FIXED(31) CONSTANT(8),  /* DENY ENTER REQUEST (FOR AN      14650000
*                                       ATLDS THE VOLUME IS EJECTED     14714990
*                                       FROM THE LIBRARY)        @L8C*/ 14754980
*   UXEIGNOR FIXED(31) CONSTANT(12), /* IGNORE ENTER REQUEST (FOR AN    14800000
*                                       ATLDS THE VOLUME REMAINS        14868490
*                                       IN THE LIBRARY IN THE INSERT    14908480
*                                       CATEGORY)                @L8C*/ 14948470
*   UXEDONT  FIXED(31) CONSTANT(16); /* DO NOT CALL THE CARTRIDGE       15000000
*                                       ENTRY INSTALLATION EXIT AGAIN   15050000
*                                       AND PERFORM CARTRIDGE ENTRY     15100000
*                                       AS REQUESTED USING THE          15150000
*                                       PARAMETER VALUES PASSED IN      15200000
*                                       ON INPUT                     */ 15250000
*                                                                       15300000
*@SPACE (1);                                                            15350000
*/********************************************************************/ 15400000
*/*                                                                  */ 15450000
*/*   LIBRARY LOGICAL TYPE CONSTANTS                                 */ 15500000
*/*                                                                  */ 15550000
*/********************************************************************/ 15600000
*  DECLARE                                                              15650000
*   UXEAUTO CHAR(1) CONSTANT('R'),  /* AUTOMATED/REAL LIBRARY        */ 15700000
*   UXEMAN  CHAR(1) CONSTANT('M');  /* MANUAL LIBRARY                */ 15750000
*                                                                       15800000
*@SPACE (1);                                                            15850000
*/********************************************************************/ 15900000
*/*   VOLUME ATTRIBUTE CONSTANTS                                 @L5A*/ 15925000
*/*                                                                  */ 15950000
*/********************************************************************/ 15955500
*  DECLARE                                                              15961000
*   UXEPHYCL FIXED(8) CONSTANT(0),  /* PHYSICAL NON-VTS VOLUME   @L5A*/ 15966500
*   UXELOGCL FIXED(8) CONSTANT(1),  /* LOGICAL VTS VOLUME        @L6C*/ 15972000
*   UXEIMPRT FIXED(8) CONSTANT(2);  /* IMPORTED VTS LOGICAL VOLUME      15977500
*                                                                @L6A*/ 15983000
*/********************************************************************/ 15988500
*/*                                                                  */ 15994000
*/*   USE ATTRIBUTE CONSTANTS                                        */ 16000000
*/*                                                                  */ 16050000
*/********************************************************************/ 16100000
*  DECLARE                                                              16150000
*   UXEPRIV CHAR(1) CONSTANT('P'),  /* PRIVATE USE ATTRIBUTE         */ 16200000
*   UXESCRT CHAR(1) CONSTANT('S');  /* SCRATCH USE ATTRIBUTE         */ 16250000
*                                                                       16300000
*@SPACE (1);                                                            16350000
*/********************************************************************/ 16400000
*/*                                                                  */ 16450000
*/*   TAPE DEVICE SELECTION INFORMATION (TDSI) CONSTANTS             */ 16500000
*/*                                                                  */ 16550000
*/********************************************************************/ 16600000
*  DECLARE                                                              16650000
*    UXENOCAR FIXED(32) CONSTANT(0); /* ZERO IS AN ACCEPTABLE VALUE     16700000
*                                       FOR TDSI                 @L1A*/ 16750000
*/********************************************************************/ 16800000
*/*   CONSTANTS TO DEFINE TAPE RECORDING TECHNOLOGY                  */ 16850000
*/********************************************************************/ 16900000
*  DECLARE                                                              16950000
*    UXENOREC FIXED(8) CONSTANT(0), /* RECORDING TECHNOLOGY UNKNOWN     17000000
*                                      UNSPECIFIED               @L1A*/ 17050000
*    UXE18TRK FIXED(8) CONSTANT(1), /* READ/WRITE ON AN 18 TRACK        17100000
*                                      DEVICE                    @L1A*/ 17150000
*    UXE36TRK FIXED(8)  CONSTANT(2), /* READ/WRITE ON A 36 TRACK        17200000
*                                      DEVICE                    @L1A*/ 17250000
*    UXE128TRK FIXED(8) CONSTANT(3), /* READ/WRITE ON A 128 TRACK       17260000
*                                      DEVICE                    @L7C*/ 17270000
*    UXE256TRK FIXED(8) CONSTANT(4); /* READ/WRITE ON A 256 TRACK       17280000
*                                      DEVICE                    @L7A*/ 17290000
*/********************************************************************/ 17300000
*/*   CONSTANTS TO DEFINE MEDIA TYPE                                 */ 17350000
*/********************************************************************/ 17400000
*  DECLARE                                                              17450000
*    UXENOMED FIXED(8) CONSTANT(0), /* MEDIA TYPE UNKNOWN OR            17500000
*                                      UNSPECIFIED               @L1A*/ 17550000
*    UXEMED1  FIXED(8) CONSTANT(1), /* MEDIA1 - CARTRIDGE SYSTEM        17600000
*                                      TAPE                      @L1A*/ 17650000
*    UXEMED2  FIXED(8) CONSTANT(2), /* MEDIA2 - ENHANCED CAPACITY       17700000
*                                      CARTRIDGE SYSTEM TAPE     @L1A*/ 17750000
*    UXEMED3  FIXED(8) CONSTANT(3), /* MEDIA3 - HIGH PERFORMANCE        17760000
*                                      CARTRIDGE TAPE            @L3A*/ 17770000
*    UXEMED4  FIXED(8) CONSTANT(4); /* MEDIA4 - EXTENDED HIGH           17780000
*                                     PERFORMANCE CARTRIDGE TAPE @L4C*/ 17790000
*/********************************************************************/ 17800000
*/*   CONSTANTS TO DEFINE COMPACTION                                 */ 17820000
*/* (THE MEANING OF THE COMPACTION FIELD HAS CHANGED FROM TYPE OF    */ 17840000
*/*  COMPACTION TO COMPACTION YES/NO - UXEIDRC AND UXECOMPT CAN BE   */ 17860000
*/*  USED INTERCHANGEABLY)                                       @L3C*/ 17880000
*/********************************************************************/ 17900000
*  DECLARE                                                              17950000
*    UXECMPNS FIXED(8) CONSTANT(0), /* COMPACTION UNKNOWN               18000000
*                                      OR NOT SET                @L1A*/ 18050000
*    UXENOCMP FIXED(8) CONSTANT(1), /* NO COMPACTION             @L1A*/ 18100000
*    UXEIDRC  FIXED(8) CONSTANT(2), /* COMPACTION                @L3C*/ 18133300
*    UXECOMPT FIXED(8) CONSTANT(2); /* COMPACTION                @L3A*/ 18166600
*/********************************************************************/ 18200000
*/*   CONSTANTS TO DEFINE SPECIAL ATTRIBUTE                          */ 18250000
*/********************************************************************/ 18300000
*  DECLARE                                                              18350000
*    UXENOSPC FIXED(8) CONSTANT(0), /* VOLUME HAS NO SPECIAL            18400000
*                                      ATTRIBUTE                 @L1A*/ 18450000
*    UXERDCOM FIXED(8) CONSTANT(1); /* VOLUME WILL BE MOUNTED FOR       18500000
*                                      READ ONLY - ALL READ-COMPATIBLE  18550000
*                                      DEVICES MAY BE SELECTED   @L1A*/ 18600000
*                                                                       18650000
*@SPACE (1);                                                            18700000
*/********************************************************************/ 18750000
*/*                                                                  */ 18800000
*/*   MISCELLANEOUS CONSTANTS                                        */ 18850000
*/*                                                                  */ 18900000
*/********************************************************************/ 18950000
*  DECLARE                                                              19000000
*    UXEPLLEN FIXED(31) CONSTANT(LENGTH(UXEPL)),                        19050000
*    UXEPLSP  FIXED(8)  CONSTANT(0),                                    19100000
*    UXEYES   CHAR(1)   CONSTANT('Y'),                                  19150000
*    UXENO    CHAR(1)   CONSTANT('N'),                                  19200000
*    UXEBLANK CHAR(1)   CONSTANT(' ');                                  19250000
*@SPACE(2);                                                             19300000
