*/***START OF SPECIFICATIONS******************************************/ 00050000
*/*                                                                  */ 00100000
*/*  $MAC (CSFCCVT) COMP(05101) PROD(ICSF/MVS):                      */ 00150000
*/*                                                                  */ 00200000
*/*01* MACRO NAME: CSFCCVT                                           */ 00250000
*/*                                                                  */ 00300000
*/*01* DESCRIPTIVE NAME: Crypto Communication Vector Table           */ 00350000
*/*                                                                  */ 00400000
*/*01* COPYRIGHT:                                                    */ 00450000
*/*                                                                  */ 00500000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00550000
*/*                                                                  */ 00750000
*/*    "RESTRICTED MATERIALS OF IBM"                                 */ 00762500
*/*                                                                  */ 00775000
*/*    5647-A01                                                      */ 00787500
*/*                                                                  */ 00800000
*/*    (C) COPYRIGHT IBM CORP. 1990, 2000                            */ 00812500
*/*                                                                  */ 00825000
*/*01* STATUS = HCR7703                                              */ 00832000
*/*                                                                  */ 00839000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00840500
*/*02* NOTPI: BASE                                                   */ 00842000
*/*02* PI:    FIELDS                                                 */ 00843500
*/*                 CCVTCCVE CCVTPRPC CCVTINST CCVTINS2 CCVTLNTH     */ 00845000
*/*                 CCVT_FMID CCVT_USERPARM                          */ 00846500
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00848000
*/*                                                                  */ 00850000
*/*01* FUNCTION:                                                     */ 00900000
*/*      The CCVT is the base control block for ICSF/MVS. The CCVT   */ 00950000
*/*      contains addresses of common areas for use by ICSF/MVS      */ 01000000
*/*      components.  Indicators in the CCVT provide status          */ 01050000
*/*      of ICSF/MVS.                                                */ 01100000
*/*                                                                  */ 01150000
*/*01* METHOD OF ACCESS:                                             */ 01200000
*/*                                                                  */ 01250000
*/*02*   PLAS:                                                       */ 01300000
*/*        Use %INCLUDE SYSLIB(CSFCCVT) to get a mapping of the      */ 01350000
*/*        CCVT.  By default, the CCVT is based on SCVTCCVT. If      */ 01400000
*/*        other basing is desired, use %CCVTBASE='BASED(XXXXXX)'.   */ 01450000
*/*        If %CCVTBASE='BASED(CCVTPTR)' is coded, a Declare for     */ 01500000
*/*        CCVTPTR is also generated.                                */ 01550000
*/*                                                                  */ 01600000
*/*02*   ASSEMBLER:                                                  */ 01650000
*/*        Issue the CSFCCVT macro.  A DSECT is produced.  A USING   */ 01700000
*/*        on CCVT provides addressability to all symbols.           */ 01750000
*/*                                                                  */ 01800000
*/*01* POINTED TO BY:                                                */ 01850000
*/*      1) The SCVTCCVT field in the CVT.                           */ 01900000
*/*      2) The SPBCCVT field in the CSFASPB.                        */ 01950000
*/*                                                                  */ 02000000
*/*                                                                  */ 02050000
*/*01* CHANGE ACTIVITY:                                              */ 02100000
*/* $L0=ICSF/MVS ,HCRP100, 881031, PDF4: Crypto Service Facility     */ 02150000
*/* $P1=PHC0050 ,HCRP100, 891219, PDRB: Added CCVTCDX field          */ 02175000
*/* $P2=PHC0202 ,HCRP100, 900516, PDRB: Corrected Comment         @P2*/ 02187500
*/* $M3=DYKS    ,HCRP120, 930428, PDRB: Dynamic CKDS updates     @M3A*/ 02193700
*/* $P3=PMJ0037 ,HCRP120, 931202, KDRB: No_dynam bit             @P3A*/ 02195800
*/* $P4=PMJ0038 ,HCRP120, 931202, KDRB: Subtask caller ID        @P4A*/ 02197900
*/* $N1=ANSI    ,HCRP210, 941001, PDLG: ANSI flags               @N1A*/ 02198900
*/* $N2=CDMF    ,HCRP210, 950501, PDLG: CDMF flags               @N2A*/ 02199400
*/* $N4=PKSC    ,HCRP210, 950426, PDKK: Domain key entry flags   @N4A*/ 02199700
*/* $N4=PKSC    ,HCRP210, 951130, PDKK: PKA MK status            @N4A*/ 02199800
*/* $N4=PKSC    ,HCRP210, 951218, PDKK: remove ECM               @N4A*/ 02199900
*/* $P5=PP90164 ,HCRP210, 960130, PDEN: Load SPKB/SPKX to CSA    @P5A*/ 02216600
*/* $O1=PKDS    ,HCRP210, 960909, PDCL: PKDS support             @O1A*/ 02224900
*/* $O4=TDESP   ,HCRP220, 970520, PDRB: Triple DES               @O4A*/ 02229100
*/* $O2=DMAC2   ,HCRP220, 970912, PDKK: Double-length MAC        @O2A*/ 02231200
*/* $R1=PCINF   ,HCRP230, 980304, PDRB: Public Key Interface 99  @R1A*/ 02231900
*/* $P6=PCINF   ,HCRP230, 990211, PDRB: PKDS required with PCICC @P6A*/ 02232600
*/* $R8=RCRSN   ,HCRP230, 990324, PDMH: ICSF/TSS RC/RS conversion@R8A*/ 02232900
*/* $P7=PWT0200 ,HCRP230, 990827, PDRB: Restore reserved fields  @P7A*/ 02233100
*/* $P8=PWT0216 ,HCRP230, 990827, PDRB: PC to PCICC recovery     @P8A*/ 02233200
*/* $A1=OW40369 ,HCRP230, 990830, PDCD: Add Address of RESMGR PC @A1A*/ 02238800
*/* $P9=PWT0246 ,HCRP230, 990922, PDRB: Terminating flag         @P9A*/ 02241600
*/* $S2=UDXGS   ,HCR7703, 990629, PDRB: UDX/Generic Services     @S2A*/ 02242500
*/* $S6=CICSP   ,HCR7703, 991122, PDME: CICS Wait List           @S6A*/ 02243400
*/* $S1=CSERV   ,HCR7703, 991213, PDRB: Callable Services        @S1A*/ 02243900
*/* $A2=OW40011 ,HCRP220, 990630, PDRB: CICS Multi-thread        @A2A*/ 02244100
*/* $PA=PXT0166 ,HCR7703, 000315, PDKF: NOTE added below         @PAA*/ 02244900
*/* $A3=OW46739 ,HCRP230, 000510, PDRB: ICSF levels              @A3A*/ 02245300
*/* $A4=OW46380 ,HCRP230, 000510, PDKF: Update ICSF Level        @A4A*/ 02245500
*/* $A5=OW46382 ,HCRP230, 001126, PDKF: Update ICSF Level and        */ 02245560
*/*                                     ZKA security compliance  @A5A*/ 02245620
*/*                                                                  */ 02245700
*/* NOTE - If the length of the CCVT is changed, remember to     @PAA*/ 02246500
*/*        re-compile the IPCS Ctrace module - CSFITLOC as well  @PAA*/ 02247300
*/*        any other mainline ICSF modules that are affected.    @PAA*/ 02248100
*/*                                                                  */ 02248900
*/* NOTE - ICSFRLVL history please update this section when the  @A3A*/ 02249100
*/*        current ICSFRLVL is changed.                          @A3A*/ 02249300
*/*               1 - OW46379  SSL SPE                           @A3A*/ 02249500
*/*               2 - OW46380  ICC SPE                           @A4A*/ 02249600
*/*               2 - OW46382  ZKA SPE                           @A5A*/ 02249650
*/*                                                                  */ 02249700
*/*01* COMPONENT: 05101 (ICSF/MVS)                                   */ 02250000
*/*                                                                  */ 02300000
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 02350000
*/*                                                                  */ 02400000
*/***END OF SPECIFICATIONS********************************************/ 02450000
*        %GOTO CCVTPLS  ;         /* Bilingual header                   02500000
         MACRO                                                          02550000
         CSFCCVT                                                        02600000
CCVT     DSECT ,                  CSFCCVT                               02650000
CCVTID   DS    CL4                EBCDIC ID                             02660700
CCVTVER  DS    CL2                Version number of this CCVT           02671400
CCVTLEN  DS    H                  Length of this ccvt                   02682100
         DS    0CL6               Reserved                        @A3C  02697790
CCVTAUX1 DS    BL1                Auxiliary flag byte 1           @P9C  02703500
CCVTTERM EQU   X'80'              ON = ICSF is terminating        @P9A  02714200
         DS    BL1                Reserved                              02724900
         DS    BL1                Reserved                              02735600
         DS    BL1                Reserved                              02746300
         DS    BL1                Reserved                              02757000
         DS    BL1                Reserved                              02767700
*                                                                2@A3D  02780390
CCVTRLVL DS    H                  ICSF Level                      @A3A  02782380
CCVTCURL EQU   3                  ICSF Current Level (OW46382)    @A5C  02787350
CCVTCCVE DS    A                  Address of the CCVT extension         02789100
CCVTPC1  DS    A                  PC1 (CSFANSPC) number                 02800000
CCVTPC2  DS    A                  PC2 (CSFASSPC) number                 02850000
CCVTPRPC DS    A                  CSFAPRPC entry point for ICSF/MVS     02900000
CCVTINST DS    A                  For use by the installation           02950000
CCVTSFG1 DS    BL1                Status byte                           03000000
CCVTACT  EQU   X'80'              Cryptography is active                03200000
CCVTMK   EQU   X'40'              At least one crypto unit has a        03236100
*                                 valid master key                      03272200
CCVTINIT EQU   X'20'              ICSF/MVS initialization complete @P2C 03308300
CCVTCSF  EQU   X'10'              ICSF/MVS is active (not PCF or CUSP)  03344400
CCVTCOMP EQU   X'08'              Compatibility permitted               03380500
CCVTHW   EQU   X'04'              At least one valid crypto unit        03416600
CCVTCUCV EQU   X'02'              SEC250 level or CRYPTO or above  @N1A 03434600
CCVTCMOS EQU   X'01'              CMOS hardware                    @N2A 03443600
CCVTFLAG DS    BL1                Flag byte                             03452700
CCVT31AM EQU   X'80'              VTAM indicator, ON = VTAM puts        03488800
*                                 terminal buffer above 16MB line       03524900
CCVTENVT EQU   X'40'              ON = Hdwre environment tested   @O4A  03542900
CCVTDMAC EQU   X'20'              ON = GTMAC opcode in hardware   @O2A  03551900
CCVTCCPH EQU   X'10'              CCP hardware instructions avail @R1A  03554100
CCVTCCP  EQU   X'08'              At least one CCP is active      @R1A  03556300
CCVTENVK EQU   X'04'              ON = Add'l hrdwre envir. tested @R1A  03558500
CCVTCCPO EQU   X'02'              ON = At least one CCP is online @R1A  03559700
CCVTPCIC EQU   X'01'              ON = At least one CCP is present@P1A  03560300
CCVTOFLG DS    BL1                Operational flags                     03561000
CCVTPRSM EQU   X'80'              ON = configuration is under PR/SM     03597100
CCVTCLOS EQU   X'40'              ON = Close the CKDS             @M3A  03615100
CCVT_NODYNAM EQU X'20'            ON = KRC, KRD & KRD not allowed @P3A  03624100
CCVT_IO_AVAIL EQU X'10'           ON = IO subtask is available    @P4A  03628600
CCVT_DEF_ALG  EQU X'08'           OFF = DEA                       @N2A  03630100
*                                 ON = CDMF                       @N2A  03631600
CCVT_CDMF_ENA EQU X'04'           ON = CDMF enabled               @N2A  03632100
*                                 OFF = CDMF disabled             @N2A  03632600
CCVT_PKA_MK_VALID EQU X'02'       ON = PKA MKs valid              @N4A  03632900
CCVTRSN  EQU   X'01'              ON = Use ICSF Reason codes      @R8A  03633000
*                                 OFF = TSS                       @R8A  03633100
CCVTSVCM DS    BL1                SVC number for key management         03633200
CCVTCDX  DS    BL1                Old CDX, constant for this IPL  @P1C  03669300
CCVTSVCS DS    BL1                DEA interface SVC                     03705400
CCVTASID DS    H                  ASID of ICSF/MVS address space        03741500
CCVTIDNR DS    F                  IO Subtask caller identification @P4A 03777600
CCVTPC3  DS    A                  PC3 (CSFASSPA entry)                  03813700
CCVTSRUT DS    A                  Address of Access Method Module       03850000
CCVTINS2 DS    0D                 Two words for installation exit use   03869200
CCVTINW1 DS    F                  Installation exit word 1              03888400
CCVTINW2 DS    F                  Installation exit word 2              03907600
CCVTMDS  DS    A                  Data spec server PC                   03926800
CCVTLNTH DS    F                  Maximum Unstallation Data Length      03946000
CCVTASCB DS    A                  ICSF/MVS ASCB address                 03965200
CCVTWLST DS    A                  Address of CICS Wait List        @S6C 03984400
         DS    F                  Reserved                              04003600
CCVTENF  DS    F                  ECB for ENF listen                    04022800
CCVTTCB  DS    A                  ICSF/MVS maintask TCB address         04042000
CCVTTRC  DS    F                  ECB for trace                         04061200
CCVTECBA DS    A                  Address of CAMQ ECB Array        @N4C 04080400
CCVTENF1 DS    A                  TOKEN for ENF listen exit             04099600
CCVTENF2 DS    A                  TOKEN for ENF listen exit             04118800
CCVTLX   DS    F                  LX of ICSF/MVS address space          04138000
CCVTDS   DS    0D                 Dataspace information, must be        04157200
*                                 doubleword aligned. (used for         04176400
*                                 compare double and swap)              04195600
CCVTDSA  DS    A                  Address of the beginning of the       04214800
*                                 current data space                    04234000
CCVTDST  DS    F                  ALET of the current data space        04253200
CCVTLFDE DS    F                  ECB to post to start the              04272400
*                                 'look for disabled crypto' task       04291600
CCVTIOSE DS    F                  ECB to post to use IO subtask    @M3A 04298000
CCVTIOSC DS    F                  ECB posted by IO subtask         @M3A 04304400
CCVTIOAS DS    A                  Address of non-CSF @space        @M3A 04312900
CCVTFMID DS    CL8                FMID                             @N1A 04318600
CCVT_USERPARM    DS    CL8        USERPARM                         @N2A 04322400
*                                 PKA register status words        @N4C 04322500
CCVTPKAF DS    BL1                PKA register clear key entry          04322700
*                                 processing flags                 @N4A 04323000
CCVT_PKA_KMMK0_VALID EQU X'80'    KMMK register in valid state for CP 0 04323300
*                                 (completed clear key entry)      @N4A 04323600
CCVT_PKA_SMK0_VALID EQU  X'40'    SMK register in valid state for CP 0  04323900
*                                 (completed clear key entry)      @N4A 04324200
CCVT_PKA_KMMK0_START EQU X'20'    KMMK register has been reset for CP 0 04324500
*                                 (starting clear key entry)       @N4A 04324800
CCVT_PKA_SMK0_START EQU  X'10'    SMK register has been reset for CP 0  04325100
*                                 (starting clear key entry)       @N4A 04325400
CCVT_PKA_KMMK1_VALID EQU X'08'    KMMK register in valid state for CP 1 04325700
*                                 (completed clear key entry)      @N4A 04326000
CCVT_PKA_SMK1_VALID EQU  X'04'    SMK register in valid state for CP 1  04326300
*                                 (completed clear key entry)      @N4A 04326600
CCVT_PKA_KMMK1_START EQU X'02'    KMMK register has been reset for CP 1 04326900
*                                 (starting clear key entry)       @N4A 04327200
CCVT_PKA_SMK1_START EQU  X'01'    SMK register has been reset for CP 1  04327500
*                                 (starting clear key entry)       @N4A 04327800
CCVTPKAR DS    BL1                PKA register status              @N4A 04328000
CCVT_PKA_SMK0_STATUS EQU  X'C0'   SMK register status for KSU 0         04328200
CCVT_PKA_KMMK0_STATUS EQU X'30'   KMMK register status for KSU 0        04328400
CCVT_PKA_SMK1_STATUS EQU  X'C0'   SMK register status for KSU 1         04328600
CCVT_PKA_KMMK1_STATUS EQU X'03'   KMMK register status for KSU 1        04328800
CCVTPKAX DS    BL1                PKA register status (reserved)   @N4A 04329000
CCVTPKAZ DS    BL1                PKA register status (reserved)   @N4A 04329200
CCVTCCC  DS    CL16               CCC                              @N4A 04329400
CCVTSPKB DS    A                  Address of Public Key Build      @P5A 04329500
CCVTSPKX DS    A                  Address of Public Key Extract    @P5A 04329600
CCVTPIOE DS    F                  ECB for PKDS I/O subtask         @O1A 04331300
CCVTPIOC DS    F                  ECB for PKDS I/O work complete   @O1A 04333000
CCVTPIOA DS    A                  Address of ASCB task posting the      04334700
*                                  PKDS I/O subtask                @O1A 04336400
CCVTIDNR_PKDS DS    F             IO Subtask caller identification @P4A 04338100
CCVTPKDF DS    BL1                PKDS processing flags            @O1A 04339800
CCVT_PKDS_AVAIL EQU X'80'         PKDS available                   @O1A 04341500
CCVT_CLOSE_PKDS EQU X'40'         Signal PKDS I/O to CLOSE PKDS    @O1A 04343200
CCVTCICS DS    BL1                CICS processing flags            @A2A 04343400
CCVTPRPA EQU   X'80'              CSFAPRPD installed               @A2A 04343600
CCVTWTLA EQU   X'40'              CSFACKWL installed               @A2A 04343800
CCVTYAFF DS    BL1                Yet another flag flag            @A5A 04344040
CCVTZKAE EQU   X'80'              ZKA compliance environment       @A5A 04344080
         DS    BL1                Reserved                         @A5C 04344120
CCVTPRPD DS    A                  Address of CSFAPRPD              @A2A 04344200
CCVTCKWL DS    A                  Address of CSFACKWL              @A2A 04344400
CCVTPC4  DS    A                  PC4 (CSFMCAMP) number            @A1A 04345100
         DS    CL4                reserved                         @A1C 04345200
CCVTENF3 DS    A                  ENF Token for PCICC online event @R1A 04345300
CCVTENFP DS    F                  ECB for PCICC online event       @R1C 04345700
CCVTENA1 DS    A                  Addr of ENF1 Listen Exit         @R1A 04346100
CCVTENA2 DS    A                  Addr of ENF1 Listen Exit         @R1A 04346500
CCVTENA3 DS    A                  Addr of ENF1 Listen Exit         @R1A 04346900
CCVTPC5  DS    A                  PC5 (CSFMCCPP entry)             @P8A 04347100
         DS    CL20               reserved                              04347300
CCVTGSVT DS    A                  Addr of Generic Serv Vector Tbl  @S2A 04347600
CCVTGSFL DS    BL4                Flags                            @S2A 04347900
CCVTSCVG DS    A                  Addr of CSFSCVG                  @S1A 04348000
CCVTACVG DS    A                  Addr of CSFACVG                  @S1A 04348100
         DS    CL20               reserved                         @S1A 04348200
         DS    0D                 Ensure CCVT end on doubleword boundry 04348300
         MEND                                                           04350000
  Terminating PL/AS comment                                          */ 04400000
         %CCVTPLS : ;                                                   04450000
  %IF CCVTBASE='' %THEN           /*                              */    04500000
    %DO;                                                                04550000
      %CCVTBASE='BASED(SCVTCCVT)'; /* Default is SCVTCCVT         */    04600000
    %END;                                                               04650000
  %IF CCVTBASE='BASED(CCVTPTR)' %THEN                                   04700000
    %DO;                                                                04750000
      DCL CCVTPTR PTR(31);           /* Pointer to the CCVT          */ 04800000
    %END;                                                               04850000
 DCL                                                                    04900000
  1    CCVT       CCVTBASE,                                             04950000
   3   CCVTID     CHAR(4),   /* EBCDIC ID                            */ 05000000
   3   CCVTVER    CHAR(2),   /* Version number of this CCVT          */ 05050000
   3   CCVTLEN    FIXED(16), /* Length of this CCVT                  */ 05100000
   3   *          CHAR(6),   /*                                  @A3C*/ 05169990
     5 CCVTAUX1   BIT(8),    /* Auxiliary flags                  @P9C*/ 05200000
       7 CCVTTERM BIT(1),    /* ON = ICSF is terminating         @P9A*/ 05250000
     5 *          FIXED(8),  /* Reserved                             */ 05300000
     5 *          FIXED(8),  /* Reserved                             */ 05350000
     5 *          FIXED(8),  /* Reserved                             */ 05400000
     5 *          FIXED(8),  /* Reserved                             */ 05450000
     5 *          FIXED(8),  /* Reserved                             */ 05500000
                                                             /* 2@A3D*/ 05559990
   3   CCVTRLVL   FIXED(16), /* ICSF Level                       @A3A*/ 05569980
   3   CCVTCCVE   PTR(31),   /* Address of the CCVT extension        */ 05600000
   3   CCVTPC1    PTR(31),   /* PC1 (CSFANSPC) number                */ 05650000
   3   CCVTPC2    PTR(31),   /* PC2 (CSFASSPC) number                */ 05700000
   3   CCVTPRPC   PTR(31),   /* CSFAPRPC entry point, ICSF/MVS       */ 05750000
   3   CCVTINST   PTR(31),   /* For installation use                 */ 05800000
   3   CCVTSFG1   BIT(8),    /* Status byte                          */ 05850000
    5  CCVTACT    BIT(1),    /* Cryptography is active               */ 05900000
    5  CCVTMK     BIT(1),    /* At least one crypto unit has a          05950000
                                valid master key                     */ 06000000
    5  CCVTINIT   BIT(1),    /* ICSF/MVS initialization complete @P2C*/ 06050000
    5  CCVTCSF    BIT(1),    /* ICSF/MVS is active (not PCF or CUSP) */ 06100000
    5  CCVTCOMP   BIT(1),    /* Compatibility permitted              */ 06150000
    5  CCVTHW     BIT(1),    /* At least one valid crypto unit       */ 06200000
    5  CCVTCUCV   BIT(1),    /* SEC 250 or above                 @N1A*/ 06250000
    5  CCVTCMOS   BIT(1),    /* CMOS hardware                    @N2C*/ 06291600
   3   CCVTFLAG   BIT(8),    /* Flag byte                            */ 06333300
    5  CCVT31AM   BIT(1),    /* VTAM indicator, If 1, VTAM puts         06366600
                                terminal buffers above 16M line      */ 06400000
    5  CCVTENVT   BIT(1),    /* Hardware Environment tested      @O4C*/ 06406200
    5  CCVTDMAC   BIT(1),    /* GTMAC/VTMAC opcodes in hardware  @O2C*/ 06412400
    5  CCVTCCPH   BIT(1),    /* CCP hardware instr. available    @R1C*/ 06418600
    5  CCVTCCP    BIT(1),    /* At least one CCP is active       @R1C*/ 06424800
    5  CCVTENVK   BIT(1),    /* Add'l hrdwre envir. checked      @R1C*/ 06431000
    5  CCVTCCPO   BIT(1),    /* At least one CCP is on line      @R1C*/ 06437300
    5  CCVTPCIC   BIT(1),    /* At least one CCP is present      @P6A*/ 06443600
   3   CCVTOFLG   BIT(8),    /* Operational flags                    */ 06450000
    5  CCVTPRSM   BIT(1),    /* On=configuration is under PR/SM      */ 06500000
    5  CCVTCLOS   BIT(1),    /* On=Close the CKDS                @M3A*/ 06550000
    5  CCVT_NODYNAM BIT(1),  /* On=KRC, KRD & KRW not allowed    @P3A*/ 06600000
    5  CCVT_IO_AVAIL BIT(1), /* On=IO subtask is available       @P4C*/ 06650000
    5  CCVT_DEF_ALG BIT(1),  /* OFF=DEA, ON= CDMF                @N2C*/ 06700000
    5  CCVT_CDMF_ENA BIT(1), /* ON = CDMF ena, OFF = CDMF dis    @N2C*/ 06750000
    5  CCVT_PKA_MK_VALID BIT(1),/* ON - PKA MKs valid            @N4C*/ 06800000
    5  CCVTRSN    BIT(1),    /* ICSF=ON TSS=OFF ReasonCodes      @R8C*/ 06850000
   3   CCVTSVCM   PTR(8),    /* SVC number for key manager           */ 06900000
   3   CCVTCDX    BIT(8),    /* Old CDX, constant this IPL       @P1C*/ 06950000
   3   CCVTSVCS   PTR(8),    /* DES Interface SVC                    */ 07400000
   3   CCVTASID   FIXED(16), /* ASID of ICSF/MVS address space       */ 07450000
   3   CCVTIDNR   FIXED(31), /* Subtask caller ID                @P4A*/ 07500000
   3   CCVTPC3    PTR(31),   /* PC3 (CSFASSPA entry)                 */ 07550000
   3   CCVTSRUT   PTR(31),   /* Address of Access Method Module      */ 07600000
   3 CCVTINS2,               /* Two words for installation              07650000
                                exit use                             */ 07700000
     5 CCVTINW1 FIXED(32),   /* Installation exit word 1             */ 07750000
     5 CCVTINW2 FIXED(32),   /* Installation exit word 2             */ 07800000
   3 CCVTMDS      PTR(31),   /* Data space server PC                 */ 07850000
   3 CCVTLNTH     FIXED(32), /* Maximum Installation Data Length     */ 07900000
   3 CCVTASCB     PTR(31),   /* ICSF/MVS ASCB Address                */ 07950000
   3 CCVTWLST     PTR(31),   /* Address of CICS Wait List        @S6C*/ 08000000
   3 *            PTR(31),   /* Reserved                             */ 08050000
   3 CCVTENF FIXED(32),      /* ECB for ENF listen                   */ 08100000
   3 CCVTTCB PTR(31),        /* ICSF/MVS maintask TCB address        */ 08150000
   3 CCVTTRC FIXED(32),      /* ECB for trace                        */ 08200000
   3 CCVTECBA PTR(31),       /* Adress of CAMQ ECB Array         @N4C*/ 08211400
   3 CCVTENF1 PTR(31),       /* TOKEN for ENF listen exit            */ 08222800
   3 CCVTENF2 PTR(31),       /* TOKEN for ENF listen exit            */ 08234200
   3 CCVTLX   FIXED(32),     /* LX of ICSF/MVS address space         */ 08245900
   3 CCVTDS BDY(DWORD),      /* Dataspace information (must be          08261200
                                doubleword aligned-used for             08276500
                                compare double and swap)             */ 08291800
     5 CCVTDSA    PTR(31),   /* Address of the beginning of the         08307100
                                current data space.                  */ 08322400
     5 CCVTDST    FIXED(32), /* ALET of the current data space.      */ 08337700
   3 CCVTLFDE FIXED(32),     /* ECB to post to start the 'look for      08353000
                                disabled cryptos' task               */ 08368300
   3 CCVTIOSE FIXED(32),     /* ECB to post to use IO subtask    @M3A*/ 08373400
   3 CCVTIOSC FIXED(32),     /* ECB posted by IO subtask         @M3A*/ 08378500
   3 CCVTIOAS PTR(31),       /* ASCB address for non-CSF @space  @M3A*/ 08385600
   3 CCVTFMID CHAR(8),       /* ICSF FMID                        @N1A*/ 08390400
   3 CCVT_USERPARM CHAR(8),  /* ICSF USERPARM                    @N2A*/ 08393600
   3 CCVTPKAF BIT( 8 ),      /* PKA register clear key entry            08394000
                                processing flags                 @N4A*/ 08394400
     5 CCVT_PKA_KMMK0_VALID BIT(1),/* KMMK valid for CP0         @N4A*/ 08394800
     5 CCVT_PKA_SMK0_VALID BIT(1), /* SMK in valid state for CP0 @N4A*/ 08395200
     5 CCVT_PKA_KMMK0_START BIT(1),/* KMMK was reset for CP0     @N4A*/ 08395600
     5 CCVT_PKA_SMK0_START BIT(1), /* SMK has been reset for CP0 @N4A*/ 08396000
     5 CCVT_PKA_KMMK1_VALID BIT(1),/* KMMK valid for CP1         @N4A*/ 08396400
     5 CCVT_PKA_SMK1_VALID BIT(1), /* SMK in valid state for CP1 @N4A*/ 08396800
     5 CCVT_PKA_KMMK1_START BIT(1),/* KMMK was reset for CP1     @N4A*/ 08397200
     5 CCVT_PKA_SMK1_START BIT(1), /* SMK has been reset for CP1 @N4A*/ 08397600
   3 CCVTPKAR BIT( 8 ),      /* PKA register status              @N4A*/ 08397800
     5 CCVT_PKA_SMK0_STATUS BIT(2), /* SMK status for KSU0       @N4A*/ 08398000
     5 CCVT_PKA_KMMK0_STATUS BIT(2), /* KMMK status for KSU0     @N4A*/ 08398200
     5 CCVT_PKA_SMK1_STATUS BIT(2), /* SMK status for KSU1       @N4A*/ 08398400
     5 CCVT_PKA_KMMK1_STATUS BIT(2), /* KMMK status for KSU1     @N4A*/ 08398600
   3 CCVTPKAX BIT( 8 ),      /* PKA register status (reserved)   @N4A*/ 08398800
   3 CCVTPKAZ BIT( 8 ),      /* PKA register status (reserved)   @N4A*/ 08399000
   3 CCVTCCC  BIT( 128 ),    /* CCC                              @N4A*/ 08399200
   3 CCVTSPKB   PTR(31),     /* Address of Public Key Build      @P5A*/ 08405500
   3 CCVTSPKX   PTR(31),     /* Address of Public Key Extract    @P5A*/ 08411800
   3 CCVTPIOE FIXED(32),     /* ECB for PKDS I/O subtask         @O1A*/ 08418100
   3 CCVTPIOC FIXED(32),     /* ECB for PKDS I/O work complete   @O1A*/ 08424400
   3 CCVTPIOA   PTR(31),     /* Address of ASCB task posting the        08430700
                                 PKDS I/O subtask                @O1A*/ 08437000
   3 CCVTIDNR_PKDS FIXED(31), /* Subtask caller ID               @O1A*/ 08443300
   3 CCVTPKDF BIT(8),        /* PKDS processing flags            @O1A*/ 08449600
     5 CCVT_PKDS_AVAIL BIT(1), /* PKDS available when 1          @O1A*/ 08455900
     5 CCVT_CLOSE_PKDS BIT(1), /* Signal PKDS I/O to CLOSE PKDS  @O1A*/ 08462200
     5 *               BIT(6), /* Unused                         @O1A*/ 08468500
   3 CCVTCICS BIT(8),        /* CICS processing flags            @A2A*/ 08469300
     5 CCVTPRPA        BIT(1), /* CSFAPRPD installed             @A2A*/ 08470100
     5 CCVTWTLA        BIT(1), /* CSFACKWL installed             @A2A*/ 08470900
     5 *               BIT(6), /* Reserved                       @A2A*/ 08471700
   3 CCVTYAFF BIT(8),        /* Yet another flag flag ?          @A5A*/ 08472590
     5 CCVTZKAE        BIT(1), /* ON=ZKA compliance environment  @A5A*/ 08472680
     5 *               BIT(7), /* Reserved                       @A5A*/ 08472770
   3 * BIT(8),               /* Reserved                         @A5C*/ 08472860
   3 CCVTPRPD PTR(31),       /* Address of CSFAPRPD              @A2A*/ 08473300
   3 CCVTCKWL PTR(31),       /* Address of CSFACKWL              @A2A*/ 08474100
   3 CCVTPC4   PTR(31),      /* PC4 (CSFMCAMP) number            @A1A*/ 08475600
   3 * CHAR(4),              /* Reserved                         @A1C*/ 08476000
   3 CCVTENF3       PTR(31), /* ENF Token for PCICC online event @R1A*/ 08476600
   3 CCVTENFP     FIXED(32), /* ECB for PCICC online event       @R1A*/ 08478400
   3 CCVTENA1       PTR(31), /* Addr of ENF1 Listen Exit         @R1A*/ 08480200
   3 CCVTENA2       PTR(31), /* Addr of ENF2 Listen Exit         @R1A*/ 08482000
   3 CCVTENA3       PTR(31), /* Addr of ENF3 Listen Exit         @R1A*/ 08483800
   3 CCVTPC5        PTR(31), /* PC5 (CSFMCCPP entry)             @P8A*/ 08484700
   3 * CHAR(20),             /* Reserved                         @R1C*/ 08485600
   3 CCVTGSVT       PTR(31), /* Addr of Generic Serv Vector Tbl  @S2A*/ 08486200
   3 CCVTGSFL       BIT(32), /* Flags                            @S2A*/ 08486800
   3 CCVTSCVG       PTR(31), /* Addr of CSFSCVG                  @S1A*/ 08486900
   3 CCVTACVG       PTR(31), /* Addr of CSFACVG                  @S1A*/ 08487000
   3 * CHAR(20),             /* Reserved                         @S1A*/ 08487100
   3 * CHAR(0) BDY(DWORD);   /* Ensure CCVT ends on doubleword          08487400
                                boundary                             */ 08493700
 DCL                                                                    08500000
   CCVTID_CON CHAR(4) CONSTANT('CCVT'), /* Control Block Acronym     */ 08550000
   CCVTVER_CON CHAR(2) CONSTANT('02'), /* Version of this CCVT   @M3C*/ 08600000
   CCVTLEN_CON FIXED(16) CONSTANT(LENGTH(CCVT)), /* Length of CCVT   */ 08650000
   CCVT_SP FIXED(31) CONSTANT(245), /* Subpool for the CCVT (fixed,     08700000
                                       not fetch protected)          */ 08750000
   CCVTFM  CHAR(8) CONSTANT('HCR7703 '), /* FMID constant        @S6C*/ 08775000
   CCVTQNM CHAR(8) CONSTANT('SYSZCSF '), /* Qname for ENQs           */ 08800000
   CCVTRNM CHAR(12) CONSTANT('UPDATE      '), /* Rname for ENQs  @A3C*/ 08850490
   CCVTCURL FIXED(16) CONSTANT(3); /* ICSF current level OW46382 @A5C*/ 08851960
