*         %GOTO ENTPLAS1;                                               00050000
         MACRO                                                          00100000
         CSFENT                                                         00150000
**/ %ENTPLAS1 : ;                                                       00200000
*/***START OF SPECIFICATIONS******************************************/ 00250000
*/*                                                                  */ 00300000
*/*  $MAC (CSFENT) COMP(05101) PROD(ICSF/MVS):                      */  00350000
*/*                                                                  */ 00400000
*/*01* MACRO NAME: CSFENT                                            */ 00450000
*/*                                                                  */ 00500000
*/*01* DESCRIPTIVE NAME: Installation Exit Name Table                */ 00550000
*/*                                                                  */ 00600000
*/*01* COPYRIGHT:                                                    */ 00650000
*/*                                                                  */ 00700000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00750000
*/*                                                                  */ 00950000
*/*    "RESTRICTED MATERIALS OF IBM"                                 */ 00962500
*/*                                                                  */ 00975000
*/*    5647-A01                                                      */ 00987500
*/*                                                                  */ 01000000
*/*    (C) COPYRIGHT IBM CORP. 1990, 2000                            */ 01012500
*/*                                                                  */ 01025000
*/*01* STATUS = HCR7703                                              */ 01032800
*/*                                                                  */ 01040600
*/*01* EXTERNAL CLASSIFICATION: PI                                   */ 01043700
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01046800
*/*                                                                  */ 01050000
*/*01* FUNCTION:                                                     */ 01100000
*/*      This control block maps the installation exit name table.   */ 01150000
*/*      It is used to control the invocation of installation exits. */ 01200000
*/*                                                                  */ 01250000
*/*01* METHOD OF ACCESS:                                             */ 01300000
*/*                                                                  */ 01350000
*/*02*   PLAS:                                                       */ 01400000
*/*        %INCLUDE SYSLIB(CSFENT).   The ENTPTR is automatically    */ 01450000
*/*        declared by default.  If a non-based structure is         */ 01500000
*/*        desired, Use %ENTBASE='BDY(WORD)' before the INCLUDE.     */ 01550000
*/*                                                                  */ 01600000
*/*02*   ASSEMBLER:                                                  */ 01650000
*/*        A DSECT is produced.  Do USING on ENT for                 */ 01700000
*/*        addressibility to all ENT symbols.                        */ 01750000
*/*                                                                  */ 01800000
*/*01* POINTED TO BY:                                                */ 01850000
*/*        The CCVE  (CCVEENT)                                       */ 01900000
*/*                                                                  */ 01950000
*/*01* CHANGE ACTIVITY:                                              */ 02000000
*/* $L0=ICSF/MVS ,HCRP100, 881031, PDF4: Crypto Service Facility     */ 02050000
*/* $P1=PHC0246  ,HCRP100, 900731, PDRB: Security exit enablement    */ 02075000
*/* $A1=OY43407  ,HCRP100, 910716, PDJB: Allow 60 ENT entries        */ 02087500
*/* $N1=ANSI     ,HCRP210, 941012, PDRB: Allow 90 ENT entries        */ 02093700
*/* $P2=PP90081  ,HCRP210, 950801, PDLG: Allow 120 ENT entries       */ 02096800
*/* $S6=CICSP    ,HCR7703, 991122, PDME: Allow 130 ENT entries       */ 02098400
*/*                                                                  */ 02100000
*/*01* COMPONENT: 05101 (ICSF/MVS)                                   */ 02150000
*/*                                                                  */ 02200000
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 02250000
*/*                                                                  */ 02300000
*/***END OF SPECIFICATIONS********************************************/ 02350000
*        %GOTO ENTPLAS2;                                             /* 02400000
ENT      DSECT                                                          02450000
* basic section of the ENT                                              02487500
ENTHEAD  DS    0CL32                                                    02525000
ENTENT   DS    CL4                EBCDIC ID                             02562500
ENTVER   DS    CL2                Version of this ENT                   02600000
ENTLEN   DS    H                  Length of this ENT                    02637500
ENTENTRY DS    F                  Number of ENT entries                 02675000
ENTSP    DS    F                  Subpool number that the table is in   02712500
         DS    F                  Reserved                              02750000
         DS    F                  Reserved                              02787500
         DS    F                  Reserved                              02825000
         DS    F                  Reserved                              02862500
* Variable section of the ENT                                           02900000
ENTENTE  EQU   *                  Name table Entries                    02937500
ENTENAME_IBM   DS     CL8         IBM assigned name                     02975000
ENTENAME_INST  DS     CL8         Installation assigned name            03012500
ENTEFLAG       DS     0F          Flags                                 03033600
ENTEFLAG1      DS     BL1         First Flag Byte            /*  @P1A*/ 03054700
ENTEREQ        EQU    X'80'       Exit has been requested by /*  @P1C*/ 03075800
*                                 the installation                      03096900
ENTELOAD       EQU    X'40'       Exit has been loaded       /*  @P1C*/ 03118000
ENTEACT        EQU    X'20'       Exit is active             /*  @P1C*/ 03139100
ENTEFAIL_CSF   EQU    X'10'       Terminate ICSF/MVS, if exit fails     03160200
*                                                            /*  @P1C*/ 03181300
ENTEFAIL_EXIT  EQU    X'08'       Don't call exit, if exit fails        03202400
*                                                            /*  @P1C*/ 03223500
ENTEFAIL_SERV  EQU    X'04'       Fail the service, if exit fails       03244600
*                                                            /*  @P1C*/ 03265700
ENTEFAIL_NONE  EQU    X'02'       Don't fail, if exit fails  /*  @P1C*/ 03286800
ENTEEXIT_FAILED EQU   X'01'       Exit has failed previously /*  @P1C*/ 03307900
ENTEFLAG2      DS     BL1         Second Flag Byte           /*  @P1A*/ 03329000
ENTE_CALL_CSFEXIT EQU X'80'       The exit router should be             03350100
*                                                     called /*  @P1C*/ 03371200
ENTE_EXTERNAL  EQU    X'40'       Exit is available                     03392300
*                                                 externally /*  @P1C*/ 03413400
ENTE_SEC_FAILED EQU   X'20'       Security exit failed when this        03434500
*                                 service was being called.  /*  @P1A*/ 03455600
               DS     CL2         Reserved                   /*  @P1A*/ 03476700
ENTEADDR DS    A                  Address of the exit                   03500000
         DS    F                  Reserved                              03537500
         DS    F                  Reserved                              03575000
ENTELENG EQU   *-ENTENTE          Length of each entry                  03612500
         MEND ,                                                      */ 03650000
*%ENTPLAS2 : ;                                                          03700000
* %IF ENTBASE='' %THEN               /*                              */ 03750000
*   %DO;                                                                03800000
*     %ENTBASE='BASED(ENTPTR)';      /*                              */ 03850000
*     DCL ENTPTR PTR(31);            /* Pointer to the ENT           */ 03900000
*   %END;                                                               03950000
*DCL                                                                    04000000
*  1     ENT         ENTBASE,     /* Secondary parameter block       */ 04050000
*   2    ENTHEAD,                 /* Basic section of the ENT        */ 04100000
*    3   ENTENT      CHAR(4),     /* EBCDIC ID                       */ 04150000
*    3   ENTVER      CHAR(2),     /* Version number                  */ 04200000
*    3   ENTLEN      FIXED(16),   /* Length of the ENT               */ 04250000
*    3   ENTENTRY    FIXED(31),   /* Number of entries in the array  */ 04300000
*    3   ENTSP       FIXED(31),   /* Subpool that this table is in   */ 04350000
*    3   *           FIXED(31),   /* Reserved                        */ 04400000
*    3   *           FIXED(31),   /* Reserved                        */ 04450000
*    3   *           FIXED(31),   /* Reserved                        */ 04500000
*    3   *           FIXED(31),   /* Reserved                        */ 04550000
*   2    ENTARRAY,                /* Variable section of the ENT     */ 04600000
*    3   ENTENTE(*),              /* Name table Entries              */ 04650000
*      5 ENTENAME_IBM CHAR(8),    /* IBM assigned name               */ 04700000
*      5 ENTENAME_INST CHAR(8),   /* Installation assigned name      */ 04750000
*      5 ENTEFLAG,                /* Flags                       @P1C*/ 04778200
*       7 ENTEFLAG1 BIT(8),       /* First Flag byte             @P1A*/ 04806400
*        9 ENTEREQ   BIT(1),      /* Exit has been requested by the     04834600
*                                    installation                @P1C*/ 04862800
*        9 ENTELOAD  BIT(1),      /* Exit has been loaded            */ 04891000
*        9 ENTEACT   BIT(1),      /* Exit is active              @P1C*/ 04919200
*        9 ENTEFAIL_CSF   BIT(1), /* Terminate ICSF/MVS if exit fails   04947400
*                                                                @P1C*/ 04975600
*        9 ENTEFAIL_EXIT  BIT(1), /* Don't call exit, if exit fails     05003800
*                                                                @P1C*/ 05032000
*        9 ENTEFAIL_SERV  BIT(1), /* Fail service, if exit fails @P1C*/ 05060200
*        9 ENTEFAIL_NONE  BIT(1), /* Don't fail, if exit fails   @P1C*/ 05088400
*        9 ENTEEXIT_FAILED BIT(1), /* Exit has failed previously @P1C*/ 05116600
*       7 ENTEFLAG2 BIT(8),       /* Second Flag byte            @P1A*/ 05144800
*        9 ENTE_CALL_CSFEXIT  BIT(1), /* The exit router should         05173000
*                                    be called                   @P1C*/ 05201200
*        9 ENTE_EXTERNAL BIT(1),  /* If on, this exit is available      05229400
*                                    to the installation         @P1C*/ 05257600
*        9 ENTE_SEC_FAILED BIT(1), /* If on, security exit failed       05285800
*                                     while this service was being      05314000
*                                     called                     @P1A*/ 05342200
*       7 *          CHAR(2),      /* Reserved                   @P1A*/ 05370400
*      5 ENTEADDR    PTR(31),     /* Address of the exit             */ 05400000
*      5 *           FIXED(31),   /* Reserved for future use         */ 05450000
*      5 *           FIXED(31);   /* Reserved for future use         */ 05500000
*DCL                                                                    05550000
*  ENT_ID CHAR(4) CONSTANT('ENT '), /* Control Block ID              */ 05600000
*  ENT_V  CHAR(2) CONSTANT('01'),   /* Control Block Version         */ 05650000
*  ENT_SP   FIXED(31) CONSTANT(4),  /* Subpool number                */ 05700000
*  ENT_MENT FIXED(31) CONSTANT(130);/* Max number of entries         */ 05750000
                      /* ENT_MENT must be at least 12 more           */ 05800000
                      /* than the number of entries in CSFAINCR      */ 05850000
                      /* ENT_MENT is used in CSFSSTSP (STSW)         */ 05900000
                      /* All users of STSW must be recompiled.   @S6C*/ 05950000
