         MACRO                                                          09099300
         CSFSMF82        ,                                              09149300
*****START OF SPECIFICATIONS******************************************* 09199300
*                                                                     * 09249300
*    $MAC (CSFSMF82) COMP(05101) PROD(ICSF/MVS):                      * 09299300
*                                                                     * 09349300
*  01* MACRO NAME: CSFSMF82                                           * 09399300
*                                                                     * 09449300
*  01* DESCRIPTIVE NAME: SMF Type 82 Record                           * 09499300
*                                                                     * 09549300
*  01* COPYRIGHT:                                                     * 09599300
*                                                                     * 09649300
*      LICENSED MATERIALS - PROPERTY OF IBM                           * 09699300
*                                                                     * 09749300
*      "RESTRICTED MATERIALS OF IBM"                                  * 09799300
*                                                                     * 09849300
*      5647-A01                                                       * 09899300
*                                                                     * 09949300
*      (C) COPYRIGHT IBM CORP. 1990, 2000                             * 09999300
*                                                                     * 10049300
*  01* STATUS = HCRP230                                               * 10099300
*                                                                     * 10149300
*  01* EXTERNAL CLASSIFICATION: PI                                    * 10199300
*  01* END OF EXTERNAL CLASSIFICATION:                                * 10249300
*                                                                     * 10299300
*  01* FUNCTION:                                                      * 10349300
*        This control block maps the SMF Type 82 Record that          * 10399300
*        is used by ICSF/MVS.                                         * 10449300
*                                                                     * 10499300
*  01* METHOD OF ACCESS:                                              * 10549300
*                                                                     * 10599300
*  02*   ASSEMBLER:                                                   * 10649300
*          A DSECT is produced.  Do USING on SMF82 for                * 10699300
*          addressibility to all SMF82 symbols.                       * 10749300
*                                                                     * 10799300
*  01* POINTED TO BY: N/A                                             * 10849300
*                                                                     * 10899300
*  01* CHANGE ACTIVITY:                                               * 10949300
*   $P1=PHC0113 ,HCRP100, 900109, PDSD: Crypto Service Facility       * 10999300
*   $P2=PMJ0042 ,HCRP120, 931215, KDRB: Add SRRW subtype          @P2A* 11049300
*   $P3=PMJ0050 ,HCRP120, 940114, KDRB: Fix label len, subtype 7  @P3A* 11099300
*   $N4=PKSC    ,HCRP210, 950407, KDKK: PKA key part              @N4A* 11149300
*   $P4=PKSC    ,HCRP210, 960213, PDRB: Fixed comment             @P4A* 11199300
*   $C2=CPYRIGHT,HCRP210, 960426, PDVM: Copyright change for V2   @C2A* 11249300
*   $P5=PP90272 ,HCRP210, 960619, PDVM: Add USERPARM to subtype 1 @P5A* 11299300
*   $O1=PKDS    ,HCRP210, 960911, PDCL: PKDS Support              @O1A* 11349300
*   $P6=PVO0045 ,HCRP210, 970623, PDME: Add PKSC mappings         @P6A* 11399300
*   $R2=MKETY   ,HCRP230, 980302, PDKK: CCP master key entry      @R2A* 11436800
*   $R3=CSERV   ,HCRP230, 980508, PDME: CCP callable services     @R3A* 11474300
*   $R1=PCINF   ,HCRP230, 980528, PDRB: CCP infrastructure        @R1A* 11486800
*   $R2=MKETY   ,HCRP230, 980820, PDKK: Asymmetric-key master key @R2A* 11493000
*   $P7=PWT0279 ,HCRP230, 991012, PDCD: PCI Interface Changes     @P7A* 11496100
*   $A1=OW47627 ,HCRP230, 010109, PDKF: Rename Retained key label @A1A* 11497100
*                                                                     * 11499300
*  01* COMPONENT: 05101 (ICSF/MVS)                                    * 11549300
*                                                                     * 11599300
*  01* DISTRIBUTION LIBRARY:  AMACLIB                                 * 11649300
*                                                                     * 11699300
*****END OF SPECIFICATIONS********************************************* 11749300
*                                                                       11799300
SMF82WK               DS    CL20        Workarea needed by SMF          11849300
SMF82MCP              EQU   16          Maximum number of CPs           11899300
SMF82RTP              EQU   82          ICSF/MVS smf record type        11949300
*                                                                       11999300
* Valid smf subtypes                                                    12049300
*                                                                       12099300
SMF82INC              EQU   1           Initialization                  12149300
SMF82STC              EQU   3           Status change                   12199300
SMF82C3C              EQU   4           Condition code 3                12249300
SMF82SSC              EQU   5           Special Security Mode           12299300
SMF82MKC              EQU   6           Master Key part                 12349300
SMF82KEC              EQU   7           KEUK part                       12399300
SMF82CRC              EQU   8           CKDS refresh                    12449300
SMF82CUC              EQU   9           CKDS update               @P2A  12499300
SMF82PKC              EQU   10          PKA key part              @N4A  12549300
SMF82CMC              EQU   11          Clear new master key part @N4A  12599300
SMF82PSC              EQU   12          Public Key Secure Cable   @N4A  12649300
SMF82PKU              EQU   13          Public KDS update         @O1A  12699300
SMF82APM              EQU   14          AP new master key part    @R2A  12711800
SMF82RKY              EQU   15          Retained key create/delete@R3A  12724300
SMF82PCI              EQU   16          PCI Interface             @P7A  12732600
SMF82CPM              EQU   17          CCP time                  @R1A  12740900
SMF82CPC              EQU   18          CCP configuration         @R1A  12745100
*                                                                       12749300
* Basic section of the SMF82                                            12799300
*                                                                       12849300
SMF82                 DSECT                                             12899300
SMF82HDR              EQU   *           Basic section of the MSMF       12949300
SMF82LEN              DS    H           Length of SMF record            12999300
SMF82SEG              DS    H           Segment descriptor              13049300
SMF82FLG              DS    BL1         Bits                            13099300
SMF82SBT              EQU   X'40'       This record has a subtype       13149300
SMF82RTY              DS    BL1         Record type 82                  13199300
SMF82TME              DS    CL4         Time record was moved to log    13249300
*                                       buffer                          13299300
SMF82DTE              DS    CL4         Date record was moved to log    13349300
*                                       buffer                          13399300
SMF82SID              DS    CL4         System Identification           13449300
SMF82SSI              DS    CL4         Subsystem ID                    13499300
SMF82STY              DS    H           Record subtype                  13549300
SMF82LNG              EQU   *-SMF82     Length of basic section         13599300
SMF82RCD              DS    0C          ICSF/MVS subtype record         13649300
*                                                                       13699300
* Record Subtype 1                                                      13749300
*                                                                       13799300
SMF82INI              DSECT                                             13849300
SMF82VES              DS    F           CCVE status bits                13899300
SMF82SMA              EQU   X'80'       Special Security Mode allowed   13949300
SMF82SME              EQU   X'40'       Special Security Mode enabled   13999300
SMF82KA               EQU   X'10'       Key authentication              14049300
SMF82RAC              EQU   X'02'       RACF checking                   14099300
SMF82ENC              EQU   X'0004'     Compenc from options ds   @P5A  14149300
SMF82VTS              DS    BL1         CCVT status bits                14199300
SMF82CPA              EQU   X'08'       Compatibility mode              14249300
SMF82IDO              DS    BL1         Current crypto domain index     14299300
                      DS    CL2         Reserved                        14349300
SMF82ITE              DS    F           Number of trace entries         14399300
SMF82CKD              DS    CL44        CKDS name                       14449300
SMF82IML              DS    F           Maximum length for data         14499300
SMF82USR              DS    CL8         Userparm from options ds  @P5A  14549300
SMF82PKD              DS    CL44        PKDS name                 @O1A  14599300
SMF82ILN              EQU   *-SMF82INI  Length of init section          14649300
*                                                                       14699300
* Record Subtype 3                                                      14749300
*                                                                       14799300
* Note:  A single Status Change Section consisting of all zeroes        14849300
*        indicates that last crypto-capable processor went offline.     14899300
*                                                                       14949300
SMF82STA              DSECT                                             14999300
SMF82SFX              DS    0F                                          15049300
SMF82SNS              DS    F           Number of sections following    15099300
SMF82SS               DS    0F          Status Change Sections          15149300
SMF82SPR              DS    F           CPU number                      15199300
SMF82KSU              DS    F           KSU number                      15249300
SMF82SDX              DS    F           Domain Index                    15299300
SMF82VER              DS    F           Current master key version      15349300
SMF82SSW              DS    F           Zero, if CP is OK.              15399300
*                                       Otherwise, ICSF/MVS status      15449300
*                                       word                            15499300
SMF82STI              DS    F                                           15549300
SMF82CV               EQU X'80'         Current master key ver pattern  15599300
SMF82NA               EQU X'40'         New master key auth pattern     15649300
SMF82NV               EQU X'20'         New master key ver pattern      15699300
SMF82OV               EQU X'10'         Old master key ver pattern      15749300
SMF82CVP              DS    CL8         Current master key ver pattern  15799300
SMF82NAP              DS    CL8         New master key auth pattern     15849300
SMF82NVP              DS    CL8         New master key ver pattern      15899300
SMF82OVP              DS    CL8         Old Master key ver pattern      15949300
SMF82SLN              EQU   *-SMF82STA  Len of status section           15999300
*                                                                       16049300
* Record Subtype 4                                                      16099300
*                                                                       16149300
SMF82CC3              DSECT                                             16199300
SMF823SW              DS    F           Status word from CC3            16249300
SMF823PR              DS    BL1         CPU number                      16299300
SMF823DX              DS    BL1         Current Crypto Domain Index     16349300
                      DS    CL2         Reserved                        16399300
SMF823LN              EQU   *-SMF82CC3  Length of CC3 section           16449300
*                                                                       16499300
* Record Subtype 5                                                      16549300
*                                                                       16599300
SMF82SSM              DSECT                                             16649300
SMF82SSB              DS    D           SSM bits                        16699300
SMF82SSA              EQU   X'80'                                       16749300
*                                       ON=SSM mode went from OFF to ON 16799300
*                                      OFF=SSM mode went from ON to OFF 16849300
SMF82MLN              EQU   *-SMF82SSM  Length of SSM section           16899300
*                                                                       16949300
* Record Subtype 6                                                      16999300
*                                                                       17049300
SMF82MK               DSECT                                             17099300
SMF82MKB              DS    F           MKPART bits                     17149300
SMF82NVV              EQU   X'80'       New master key vp valid         17199300
SMF82OVV              EQU   X'40'       Old master key vp valid         17249300
SMF82NMV              DS    CL8         New master key ver pattern      17299300
SMF82OMV              DS    CL8         Ver pattern for key part        17349300
SMF82MKS              DS    BL1         KSU number                      17399300
SMF82MDX              DS    BL1         Current crypto domain index     17449300
                      DS    CL2         Reserved                        17499300
SMF82KLN              EQU   *-SMF82MK   Length of MKPART section        17549300
*                                                                       17599300
* Record Subtype 7                                                      17649300
*                                                                       17699300
SMF82KP               DSECT                                             17749300
SMF82KPB              DS    F           KPART bits                      17799300
SMF82KVV              EQU   X'80'       Key part VP valid               17849300
SMF82KV               DS    CL8         Ver pattern for key part        17899300
SMF82KKS              DS    BL1         KSU number                      17949300
SMF82KDX              DS    BL1         Current crypto domain index     17999300
                      DS    CL2         Reserved                        18049300
SMF82KCK              DS    CL44        CKDS name                       18099300
SMF82KCL              DS    CL72        CKDS entry being modified  @P3C 18149300
SMF82SKL              EQU   *-SMF82KP   Length of KPART section         18199300
*                                                                       18249300
* Record Subtype 8                                                      18299300
*                                                                       18349300
SMF82REF              DSECT                                             18399300
SMF82ROC              DS    CL44        Old ckds name                   18449300
SMF82RNC              DS    CL44        New ckds name                   18499300
SMF82RLN              EQU   *-SMF82REF  Length of REFRESH section       18549300
*                                                                       18599300
*                                                                       18649300
* Record Subtype 9                                                      18699300
*                                                                       18749300
SMF82UPD              DSECT                                       @P2A  18799300
SMF82UCB              DS    F           Update CKDS bits          @P2A  18849300
SMF82UCA              EQU   X'80000000' CKDS record added         @P2A  18899300
SMF82UCC              EQU   X'40000000' CKDS record changed       @P2A  18949300
SMF82UCD              EQU   X'20000000' CKDS record deleted       @P2A  18999300
SMF82UCN              DS    CL44        CKDS name                 @P2A  19049300
SMF82UCL              DS    CL72        CKDS entry being modified @P2A  19099300
SMF82ULN              EQU   *-SMF82UPD  Length of CKDS section    @P2A  19149300
*                                                                       19199300
* Record Subtype 10                                                     19249300
*                                                                       19299300
SMF82PKR              DSECT                                       @N4A  19349300
SMF82PKB              DS    F           PKA PART bits             @N4A  19399300
SMF82RHV              EQU   X'80'       KMMK processed            @N4A  19449300
SMF82SHV              EQU   X'40'       SMK processed             @N4A  19499300
SMF82KHV              EQU   X'20'       KP hash pattern valid     @N4A  19549300
SMF82MHV              EQU   X'10'       MK hash pattern valid     @N4A  19599300
SMF82PHP              DS    CL16        MK hash pattern           @N4A  19649300
SMF82KPH              DS    CL16        hash pattern for key part @N4A  19699300
SMF82PKS              DS    BL1         KSU number                @N4A  19749300
SMF82PKX              DS    BL1         Current crypto domain     @N4A  19799300
                      DS    CL2         Reserved                  @N4A  19849300
SMF82PKL              EQU   *-SMF82PKR  Length PKA PART section   @N4A  19899300
*                                                                       19949300
* Record Subtype 11                                                     19999300
*                                                                       20049300
SMF82CMK              DSECT                                       @N4A  20099300
SMF82CMB              DS    F           Clear NMK part bits       @N4A  20149300
SMF82CMH              EQU   X'80'       Clear NMK HP valid        @N4A  20199300
SMF82CMV              EQU   X'40'       Clear NMK VP valid        @N4A  20249300
SMF82CHP              DS    CL16        Clear NMK hash pattern    @N4A  20299300
SMF82CNP              DS    CL8         Clear NMK ver pattern     @N4A  20349300
SMF82CPH              DS    CL16        hash pattern for key part @N4A  20399300
SMF82CPV              DS    CL8         ver pattern for part      @N4A  20449300
SMF82CKS              DS    BL1         KSU number                @N4A  20499300
SMF82CDX              DS    BL1         Current crypto domain     @N4A  20549300
                      DS    CL2         Reserved                  @N4A  20599300
SMF82CKL              EQU   *-SMF82CMK  Length of MKPART section  @N4A  20649300
*                                                                       20699300
* Record Subtype 12                                                     20749300
*                                                                       20799300
SMF82PSB              DSECT                                       @N4A  20849300
SMF82PSQ              DS    4CL256      Request                   @N4A  20899300
                      ORG   SMF82PSQ                              @P6A  20949300
SMF82PR1              DS    BL1         Reserved (X'00')          @P6A  20999300
SMF82PRT              DS    BL1         Request message type      @P6A  21049300
SMF82PUC              EQU   X'02'       Type is UCQ (Query        @P6A  21099300
*                                       request)                        21149300
SMF82PCR              EQU   X'03'       Type is SCB (Command      @P6A  21199300
*                                       request)                        21249300
SMF82PRL              DS    BL2         Message length            @P6A  21299300
SMF82PRC              DS    BL1         PKSC command code         @P6A  21349300
SMF82QMI              EQU   X'00'       QUERY MODULE INFORMATION  @P6A  21399300
SMF82QAR              EQU   X'01'       QUERY AUTHORIZATION       @P6A  21449300
*                                       REGISTER                        21499300
SMF82QCB              EQU   X'02'       QUERY PKSC CONTROL BLOCK  @P6A  21549300
SMF82QPC              EQU   X'03'       QUERY PENDING-COMMAND     @P6A  21599300
*                                       REGISTER                        21649300
SMF82QHM              EQU   X'04'       QUERY DH MODULUS          @P6A  21699300
SMF82QHG              EQU   X'05'       QUERY DH GENERATOR        @P6A  21749300
SMF82QHF              EQU   X'06'       QUERY DH FIRST KEY PART   @P6A  21799300
SMF82QBT              EQU   X'07'       QUERY BASIC TRANSPORT     @P6A  21849300
SMF82QDI              EQU   X'08'       QUERY DOMAIN INFORMATION  @P6A  21899300
SMF82QPT              EQU   X'09'       QUERY PKA TRANSPORT       @P6A  21949300
SMF82COS              EQU   X'30'       CO_SIGN                   @P6A  21999300
SMF82LHM              EQU   X'32'       LOAD DH MODULUS           @P6A  22049300
SMF82LHG              EQU   X'33'       LOAD G AND GENERATE DH    @P6A  22099300
*                                       FIRST PART                      22149300
SMF82CHK              EQU   X'34'       COMBINE DH KEY PARTS      @P6A  22199300
SMF82LAP              EQU   X'70'       LOAD AUTHORIZATION PUBLIC @P6A  22249300
*                                       MODULUS                         22299300
SMF82LCB              EQU   X'71'       LOAD PKSC CONTROL BLOCK   @P6A  22349300
SMF82ZD               EQU   X'72'       ZEROIZE DOMAIN            @P6A  22399300
SMF82LEC              EQU   X'73'       LOAD ENVIRONMENT-CONTROL  @P6A  22449300
*                                       MASK                            22499300
SMF82XEM              EQU   X'74'       EXTRACT AND ENCRYPT MASTER@P6A  22549300
*                                       KEY                             22599300
SMF82LKP              EQU   X'75'       LOAD KEY PART             @P6A  22649300
SMF82XES              EQU   X'76'       EXTRACT AND ENCRYPT SMK   @P6A  22699300
SMF82XER              EQU   X'76'       EXTRACT AND ENCRYPT RMK   @P6A  22749300
SMF82LCS              EQU   X'77'       LOAD AND COMBINE SMK      @P6A  22799300
SMF82LCR              EQU   X'77'       LOAD AND COMBINE RMK      @P6A  22849300
SMF82PAR              DS    BL1         Number of authorization   @P6A  22899300
*                                       register to be used to          22949300
*                                       verify signature on a           22999300
*                                       signed command (X'00' for       23049300
*                                       unsigned commands, X'FF'        23099300
*                                       for self-signature              23149300
*                                       initialization commands)        23199300
SMF82PDA              DS    BL1         Domain index or           @P6A  23249300
*                                       Authorization register          23299300
*                                       number                          23349300
SMF82PKT              DS    BL1         Master key type for       @P6A  23399300
*                                       EXTRACT AND ENCRYPT MASTER      23449300
*                                       KEY, key part type for          23499300
*                                       LOAD KEY PART,                  23549300
*                                       X'00' otherwise                 23599300
SMF82PID              DS    CL16        Query ID for request type @P6A  23649300
*                                       UCQ, Crypto Module ID for       23699300
*                                       request type SCB                23749300
SMF82PTS              DS    CL16        Transaction SN for request@P6A  23799300
*                                       type SCB                        23849300
SMF82PR2              DS    CL984       From here to the end of   @P6A  23899300
*                                       the request is available        23949300
*                                       for IBM diagnosis only          23999300
SMF82PSP              DS    4CL256      Response                  @N4A  24049300
                      ORG   SMF82PSP                              @P6A  24099300
SMF82RR1              DS    BL1         Reserved (X'00')          @P6A  24149300
SMF82RRT              DS    BL1         Reply type                @P6A  24199300
SMF82RPU              EQU   X'82'       Unsigned reply (type URN  @P6A  24249300
*                                       or UNI)                         24299300
SMF82RPS              EQU   X'83'       Signed reply (type SRN    @P6A  24349300
*                                       or SRQ)                         24399300
SMF82RPL              DS    BL2         Message length            @P6A  24449300
SMF82RRC              DS    BL1         Reply code                @P6A  24499300
SMF82R00              EQU   X'00'       Normal completion         @P6A  24549300
SMF82R10              EQU   X'10'       Machine failure           @P6A  24599300
SMF82R21              EQU   X'21'       Invalid command           @P6A  24649300
SMF82R22              EQU   X'22'       Command disabled          @P6A  24699300
SMF82R23              EQU   X'23'       Request message length    @P6A  24749300
SMF82R24              EQU   X'24'       Reserved field            @P6A  24799300
SMF82R25              EQU   X'25'       Signature index           @P6A  24849300
SMF82R26              EQU   X'26'       Authorization index       @P6A  24899300
SMF82R27              EQU   X'27'       Domain index              @P6A  24949300
SMF82R28              EQU   X'28'       Command extension         @P6A  24999300
SMF82R31              EQU   X'31'       Facility disabled         @P6A  25049300
SMF82R33              EQU   X'33'       PKSC domain disabled      @P6A  25099300
SMF82R41              EQU   X'41'       CM not initialized        @P6A  25149300
SMF82R42              EQU   X'42'       PRN not initialized       @P6A  25199300
SMF82R51              EQU   X'51'       Configured command        @P6A  25249300
SMF82R61              EQU   X'61'       Incorrect CMID            @P6A  25299300
SMF82R62              EQU   X'62'       ASM violation             @P6A  25349300
SMF82R63              EQU   X'63'       Incorrect TSN             @P6A  25399300
SMF82R64              EQU   X'64'       Authority modulus         @P6A  25449300
SMF82R65              EQU   X'65'       Signature verification    @P6A  25499300
SMF82R71              EQU   X'71'       ACM violation             @P6A  25549300
SMF82R72              EQU   X'72'       DXM violation             @P6A  25599300
SMF82R73              EQU   X'73'       DCM violation             @P6A  25649300
SMF82R81              EQU   X'81'       Pattern mismatch          @P6A  25699300
SMF82R82              EQU   X'82'       DH operand                @P6A  25749300
SMF82R83              EQU   X'83'       Configured modulus        @P6A  25799300
SMF82R91              EQU   X'91'       Key-part-queue full       @P6A  25849300
SMF82RR2              DS    BL1         Reserved (X'00')          @P6A  25899300
SMF82RRP              DS    BL2         For type URN: X'0000'     @P6A  25949300
*                                       For type UNI: 7-bit PRNIC,      25999300
*                                       right-justified                 26049300
                      ORG   SMF82RRP                              @P6A  26099300
SMF82RYP              DS    BL2         For type SRN and SRQ:     @P6A  26149300
*                                       reply type                      26199300
SMF82SRN              EQU   X'0001'     Reply type is SRN         @P6A  26249300
SMF82SRQ              EQU   X'0002'     Reply type is SRQ         @P6A  26299300
SMF82RCM              DS    CL16        Crypto Module ID          @P6A  26349300
SMF82RSN              DS    CL16        Crypto Module Signature   @P6A  26399300
*                                       Sequence Number                 26449300
SMF82RR3              DS    CL152       Available for IBM         @P6A  26499300
*                                       diagnosis only                  26549300
SMF82RTS              DS    CL16        Transaction sequence      @P6A  26599300
*                                       number for QUERY                26649300
*                                       AUTHORIZATION REGISTER          26699300
SMF82RR4              DS    CL816       From here to the end of   @P6A  26749300
*                                       the reply is available          26799300
*                                       for IBM diagnosis only          26849300
SMF82PSL              EQU   *-SMF82PSB  Length of PKSC section    @N4A  26899300
*                                                                       26949300
* Record Subtype 13                                              8@O1A  26999300
*                                                                       27049300
SMF_PKDS              DSECT                                             27099300
SMF_PKDS_BITS         DS    F           PKDS bits                       27149300
SMF_PKDS_ADDED        EQU   X'80000000' PKDS record added               27199300
SMF_PKDS_UPDATED      EQU   X'40000000' PKDS record changed             27249300
SMF_PKDS_DELETED      EQU   X'20000000' PKDS record deleted             27299300
SMF_PKDS_NAME         DS    CL44        PKDS name                       27349300
SMF_PKDS_KEY_LABEL    DS    CL72        PKDS entry being modified       27399300
SMF_PKDS_LEN          EQU   *-SMF_PKDS  Length of PKDS section          27449300
*                                                                       27499300
* Record Subtype 14                                                     27549300
*                                                                       27599300
SMF82AC               DSECT                                       @R2A  27636800
SMF82AAB              DS    F           AP NMK bits               @R2A  27674300
SMF82ASV              EQU   X'80'       Sym-Key NMK VP valid      @R2C  27711800
SMF82AAV              EQU   X'40'       Asym-Key NMK VP valid     @R2A  27749300
SMF82ASK              EQU   X'20'       Sym-Key Key part VP valid @R2C  27786800
SMF82AAK              EQU   X'10'       Asym-Key Key part VP valid@R2A  27824300
SMF82ANV              DS    CL16        NMK verification pattern  @R2A  27861800
SMF82AKV              DS    CL16        Key part VP               @R2A  27899300
SMF82APN              DS    BL1         Processor number          @R2A  27936800
SMF82ASN              DS    CL8         Serial number             @R2A  27974300
SMF82ADM              DS    BL1         Current crypto domain     @R2A  28011800
                      DS    CL2         Reserved                  @R2A  28049300
SMF82CAL              EQU   *-SMF82AC   Length CCP MK section     @R2A  28099300
*                                                                       28149300
* Record Subtype 15                                                     28152800
*                                                                       28156300
SMF82RK               DSECT                                       @R3A  28159800
SMF82RKF              DS    F           Retained key flag bits    @R3A  28163300
SMF82RKC              EQU   X'80000000' Retained key created      @R3A  28166800
SMF82RKD              EQU   X'40000000' Retained key deleted      @R3A  28170300
SMF82RKN              DS    CL64        Label of retained key     @A1C  28174790
SMF82RKP              DS    BL1         Processor number          @R3A  28177300
SMF82RKS              DS    CL8         Serial number             @R3A  28179000
SMF82RDM              DS    BL1         Current crypto domain     @R3A  28180800
                      DS    CL2         Reserved                  @R3A  28184300
SMF82RKL              EQU   *-SMF82RK   Length of Retained key    @R3A  28187800
*                                                                       28188100
* Record Subtype 16                                                     28188400
*                                                                       28188700
SMF82PI                DSECT            PCI Interface             @P7A  28189200
SMF82PFL               DS    F          Bits to indicate request/reply  28189700
SMF82PRQ               EQU   X'80000000' Processing Request CPRB  @P7A  28190200
SMF82PRP               EQU   X'40000000' Processing Reply CPRB    @P7A  28190700
SMF82PPN               DS    BL1        Receiving PCI Index       @P7A  28191200
SMF82PSN               DS    CL8        Receiving PCI Serial Number     28191700
SMF82PDM               DS    BL1        Receiving PCI Domain      @P7A  28192000
                       DS    CL2        Reserved                  @P7A  28192300
SMF82PBL               DS    F          Parameter Block Len       @P7A  28192700
SMF82PDL               DS    F          Parameter Data Block Length     28193200
SMF82PIL               EQU   *-SMF82PI  Length of basic section   @P7A  28193700
SMF82PBK               DS    0C         Parameter data blocks     @P7A  28194200
*                                                                       28194800
* Record Subtype 17                                                     28195100
*                                                                       28195400
SMF82CT               DSECT                                       @R1A  28195700
SMF82CTN              DS    CL8         CCP time before NQAP      @R1A  28196000
SMF82CTD              DS    CL8         CCP time after DQAP       @R1A  28196300
SMF82CTW              DS    CL8         CCP time after WAIT       @R1A  28196600
SMF82CTQ              DS    F           CCP queue length          @R1A  28197500
SMF82CTF              DS    CL2         CCP sub function code     @R1A  28247500
SMF82CTX              DS    BL1         CCP Index                 @R1A  28297500
SMF82CTS              DS    CL8         CCP Serial Number         @R1A  28347500
SMF82CTM              DS    BL1         Domain                    @R1A  28397500
SMF82CTR              DS    BL1         Reference Number          @R1A  28447500
                      DS    CL3         Reserved                  @R1A  28472500
SMF82CTL              EQU   *-SMF82CT   Length of CCP time section@R1A  28497500
*                                                                       28547500
* Record Subtype 18                                                     28597500
*                                                                       28647500
SMF82CG               DSECT                                       @R1A  28697500
SMF82CGB              DS    F           CCP configuration bits    @R1A  28747500
SMF82CGN              EQU   X'80000000' CCP brought online        @R1A  28797500
SMF82CGF              EQU   X'40000000' CCP taken offline         @R1A  28847500
SMF82CGX              DS    BL1         CCP index                 @R1A  28897500
SMF82CGS              DS    CL8         CCP serial number         @R1A  28947500
                      DS    CL3         Reserved                  @R1A  28972500
SMF82CGL              EQU   *-SMF82CG   Length of CCP config      @R1A  28997500
*                                       section                         29047500
*                                                                       29097500
         MEND ,                                                       * 29147500
