* %GOTO EDG1REPF1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
.********************************************************************** 00150000
.* DFSMS/MVS 1.1.0 DFSMSRMM                                           * 00200000
.*                                                                    * 00250000
.*PROPRIETARY V3 STATEMENT                                            * 00300000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00350000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00400000
.*5695-DF1                                                            * 00437500
.*(C) COPYRIGHT 1979,1993  IBM CORP.                                  * 00475000
.*END PROPRIETARY V3 STATEMENT                                        * 00512500
.********************************************************************** 00550000
*********************************************************************** 00600000
***                                                                  ** 00650000
***      RMM CONVERSION UTILITY - TLCS V1 REMOTE STORE RECORD        ** 00700000
***                                                                  ** 00750000
*********************************************************************** 00800000
*********************************************************************** 00850000
***                                                                  ** 00900000
***                                                                  ** 00950000
***                                                                  ** 01000000
*** FUNCTION : EDG1REPF MAPS THE TLCS V1 REPORT RECORD USED BY  @002 ** 01050000
***            THE CONVERSION UTILITIES                         @002 ** 01100000
***                                                                  ** 01150000
*** LOCATION : N/A                                                   ** 01200000
***                                                                  ** 01250000
*** METHOD OF ACCESS:                                                ** 01300000
***            ASSEMBLER - USING ON TV1REPRT                         ** 01350000
***            PLAS      - %INCLUDE  EDG1REPF                   @002 ** 01400000
***                                                                  ** 01450000
*** LISTING  : ASSEMBLER - N/A                                       ** 01500000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE.    ** 01550000
***                                                                  ** 01600000
*********************************************************************** 01650000
**                                                                    * 01700000
** CHANGE ACTIVITY                                                    * 01750000
**                                                                    * 01800000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @001  * 01850000
***        ,WD,110992, CORRECT COPYRIGHT                        @002  * 01900000
*********************************************************************** 01950000
         EDG1REPF  ,                                                    02000000
TV1REPRT DSECT                                                          02050000
*    ** RECORD STRUCTURE FOR REPORT EXTRACT FILE               **       02100000
VOLSER   DS    CL6             ** VOLUME SERIAL NO.          **         02150000
DSNAME   DS    CL44            ** DATASET NAME.              **         02200000
SEQNO    DS    PL2             ** SEQUENCE NUMBER            **         02250000
CRTIME   DS    PL4             ** CREATE TIME.               **         02300000
CRDATE   DS    PL3             ** CREATE DAT                 **         02350000
RETPD    DS    CL4             ** RETENTION PERIOD.          **         02400000
EXDATE1  DS    PL3             ** CURRENT EXPIRY DATE        **         02450000
EXDATE2  DS    PL3             ** PREVIOUS EXPIRY DATE       **         02500000
EXTCNT   DS    PL2             ** EXTENSION COUNT.           **         02550000
JOBNAME  DS    CL8             ** JOB NAME.                  **         02600000
STIP     DS    C               ** PREVIOUS STATUS INDEX      **         02650000
STIC     DS    C               ** CURRENT STATUS INDEX       **         02700000
UNIT     DS    CL3             ** UNIT USED.                 **         02750000
BPIIND   DS    C               ** BPI INDICATOR.             **         02800000
BLKSIZE  DS    PL3             ** BLOCK SIZE.                **         02850000
BLKCNT   DS    PL6             ** BLOCK COUNT.               **         02900000
*                    FLAGS ARE '0' OR '1'                     **        02950000
OPENFLG  DS    C               ** OPEN FLAG.                 **         03000000
CHANGEFL DS    C               ** CHANGE FLAG.               **         03050000
UPDATEFL DS    C               ** UPDATE FLAG.               **         03100000
SCRATCHF DS    C               ** SCRATCH FLAG.              **         03150000
MULTIDSF DS    C               ** MULTIPLE DS FLAG.          **         03200000
SELECTFL DS    C               ** SELECT FLAG                **         03250000
VITALFLG DS    C               ** VITAL RECORD FLAG.         **         03300000
CLEANFLG DS    C               ** CLEANING FLAG.             **         03350000
INITFLG  DS    C               ** INIT FLAG.                 **         03400000
ADDFLG   DS    C               ** ADD FLAG.                  **         03450000
ONLINCFL DS    C               ** ONLINE CHANGE FLAG.        **         03500000
ONLINEFL DS    C               ** ONLINE EXPDT FLAG.         **         03550000
MISCFLG  DS    C               ** MISC TAPE FLAG.            **         03600000
RESVFLG  DS    CL3             ** 3 RESERVED FLAGS.          **         03650000
UPDATE   DS    PL4             ** UPDATE CONTROL.            **         03700000
SYSTEM   DS    CL4             ** SYSTEM ID.                 **         03750000
RSSTAT   DS    C               ** REMOTE STORE STATUS.       **         03800000
RSBIN    DS    PL3             ** REMOTE STORE BIN NO.       **         03850000
RSOWNER  DS    CL4             ** REMOTE STORE OWNER.        **         03900000
RSDATE   DS    PL4             ** REMOTE STORE DATE          **         03950000
RESERVED DS    CL12            ** RESERVED.                  **         04000000
MISCVOL  DS    CL6             ** MISC VOLSER.               **         04050000
         MEND , */                                                      04100000
*%EDG1REPF1:;                                                           04150000
*%IHALPUSH = '@LISTPUSH';                                               04200000
*%IHALOFF  = '@LISTOFF';                                                04250000
*%IHALPOP  = '@LISTPOP';                                                04300000
*IHALPUSH;                                                              04350000
*%IF IHALIST='YES' %THEN                                                04400000
* %GOTO EDG1REPF5;                                                      04450000
*IHALOFF;                                                               04500000
*%EDG1REPF5:; /* P L S M A P P I N G S T A R T */                       04550000
*DCL                                                                    04600000
*  1 TV1REPRT BASED,                /* 1                             */ 04650000
*    2 VOLSER   CHAR(6),            /* VOLUME SERIAL NO.             */ 04700000
*    2 DSNAME   CHAR(44),           /* DATASET NAME.                 */ 04750000
*    2 SEQNO    CHAR(2),            /* SEQUENCE NUMBER               */ 04800000
*    2 CRTIME   CHAR(4),            /* CREATE TIME.                  */ 04850000
*    2 CRDATE   CHAR(3),            /* CREATE DAT                    */ 04900000
*    2 RETPD    CHAR(4),            /* RETENTION PERIOD.             */ 04950000
*    2 EXDATE1  CHAR(3),            /* CURRENT EXPIRY DATE           */ 05000000
*    2 EXDATE2  CHAR(3),            /* PREVIOUS EXPIRY DATE          */ 05050000
*    2 EXTCNT   CHAR(2),            /* EXTENSION COUNT.              */ 05100000
*    2 JOBNAME  CHAR(8),            /* JOB NAME.                     */ 05150000
*    2 STIP     CHAR(1),            /* PREVIOUS STATUS INDEX         */ 05200000
*    2 STIC     CHAR(1),            /* CURRENT STATUS INDEX          */ 05250000
*    2 UNIT     CHAR(3),            /* UNIT USED.                    */ 05300000
*    2 BPIIND   CHAR(1),            /* BPI INDICATOR.                */ 05350000
*    2 BLKSIZE  CHAR(3),            /* BLOCK SIZE.                   */ 05400000
*    2 BLKCNT   CHAR(6),            /* BLOCK COUNT.                  */ 05450000
*    2 OPENFLG  CHAR(1),            /* OPEN FLAG.                    */ 05500000
*    2 CHANGEFL CHAR(1),            /* CHANGE FLAG.                  */ 05550000
*    2 UPDATEFL CHAR(1),            /* UPDATE FLAG.                  */ 05600000
*    2 SCRATCHF CHAR(1),            /* SCRATCH FLAG.                 */ 05650000
*    2 MULTIDSF CHAR(1),            /* MULTIPLE DS FLAG.             */ 05700000
*    2 SELECTFL CHAR(1),            /* SELECT FLAG                   */ 05750000
*    2 VITALFLG CHAR(1),            /* VITAL RECORD FLAG.            */ 05800000
*    2 CLEANFLG CHAR(1),            /* CLEANING FLAG.                */ 05850000
*    2 INITFLG  CHAR(1),            /* INIT FLAG.                    */ 05900000
*    2 ADDFLG   CHAR(1),            /* ADD FLAG.                     */ 05950000
*    2 ONLINCFL CHAR(1),            /* ONLINE CHANGE FLAG.           */ 06000000
*    2 ONLINEFL CHAR(1),            /* ONLINE EXPDT FLAG.            */ 06050000
*    2 MISCFLG  CHAR(1),            /* MISC TAPE FLAG.               */ 06100000
*    2 RESVFLG  CHAR(3),            /* 3 RESERVED FLAGS.             */ 06150000
*    2 UPDATE   CHAR(4),            /* UPDATE CONTROL.               */ 06200000
*    2 SYSTEM   CHAR(4),            /* SYSTEM ID.                    */ 06250000
*    2 RSSTAT   CHAR(1),            /* REMOTE STORE STATUS.          */ 06300000
*    2 RSBIN    CHAR(3),            /* REMOTE STORE BIN NO.          */ 06350000
*    2 RSOWNER  CHAR(4),            /* REMOTE STORE OWNER.           */ 06400000
*    2 RSDATE   CHAR(4),            /* REMOTE STORE DATE             */ 06450000
*    2 RESERVED CHAR(12),           /* RESERVED.                     */ 06500000
*    2 MISCVOL  CHAR(6);            /* MISC VOLSER.                  */ 06550000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   06600000
