* %GOTO EDG1VITS1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
.********************************************************************** 00150000
.* DFSMS/MVS 1.1.0 DFSMSRMM                                           * 00200000
.*                                                                    * 00250000
.*PROPRIETARY V3 STATEMENT                                            * 00300000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00350000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00400000
.*5695-DF1                                                            * 00437500
.*(C) COPYRIGHT 1979,1993  IBM CORP.                                  * 00475000
.*END PROPRIETARY V3 STATEMENT                                        * 00512500
.********************************************************************** 00550000
*********************************************************************** 00600000
***                                                                  ** 00650000
***      RMM CONVERSION UTILITY - TLCS V1 REMOTE STORE RECORD        ** 00700000
***                                                                  ** 00750000
*********************************************************************** 00800000
*********************************************************************** 00850000
***                                                                  ** 00900000
***                                                                  ** 00950000
***                                                                  ** 01000000
*** FUNCTION : EDG1VITS MAPS THE TLCS V1 VITAL RECORDS SELECT   @002 ** 01050000
***            FILE RECORD USED BY THE CONVERSION UTILITIES     @002 ** 01100000
***                                                                  ** 01150000
*** LOCATION : N/A                                                   ** 01200000
***                                                                  ** 01250000
*** METHOD OF ACCESS:                                                ** 01300000
***            ASSEMBLER - USING ON TV1VITRS                         ** 01350000
***            PLAS      - %INCLUDE  EDG1VITS                   @002 ** 01400000
***                                                                  ** 01450000
*** LISTING  : ASSEMBLER - N/A                                       ** 01500000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE.    ** 01550000
***                                                                  ** 01600000
*********************************************************************** 01650000
**                                                                    * 01700000
** CHANGE ACTIVITY                                                    * 01750000
**                                                                    * 01800000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @001  * 01850000
***        ,WD,110992, CORRECT COPYRIGHT                        @002  * 01900000
*********************************************************************** 01950000
         EDG1VITS  ,                                                    02000000
TV1VITRS DSECT                                                          02050000
**-------------------------------------------------------------------** 02100000
**    RECORD LAYOUT OF VITAL RECORD SELECTION FILE                   ** 02150000
**-------------------------------------------------------------------** 02200000
DSNAME   DS    CL44                    ** DATASET NAME.      **         02250000
GDG      DS    C                       ** 'Y','N','D','K' ' '**         02300000
VITRECS  DS    PL2                     ** VITRECS. NUMBER.   **         02350000
RSSTART  DS    P                       ** REM.STORE START NO.**         02400000
RSNUMBR  DS    PL2                     ** REM.STORE NUMBER.  **         02450000
DELAY    DS    P                       ** DELAY DAYS.        **         02500000
OWNER    DS    CL4                     ** OWNER.             **         02550000
ADDATE   DS    PL3                     ** AUTO. DELETE DATE. **         02600000
YYDDD    DS    PL3                     ** DATE LAST CHANGED. **         02650000
X1       DS    CL19                    ** SPARE FIELD.       **         02700000
         MEND , */                                                      02750000
*%EDG1VITS1:;                                                           02800000
*%IHALPUSH = '@LISTPUSH';                                               02850000
*%IHALOFF  = '@LISTOFF';                                                02900000
*%IHALPOP  = '@LISTPOP';                                                02950000
*IHALPUSH;                                                              03000000
*%IF IHALIST='YES' %THEN                                                03050000
* %GOTO EDG1VITS4;                                                      03100000
*IHALOFF;                                                               03150000
*%EDG1VITS4:; /* P L S M A P P I N G S T A R T */                       03200000
*DCL                                                                    03250000
*  1 TV1VITRS BASED,                /* 0                             */ 03300000
*    2 DSNAME   CHAR(44),           /* DATASET NAME.                 */ 03350000
*    2 GDG      CHAR(1),            /* 'Y','N','D','K' ' '           */ 03400000
*    2 VITRECS  CHAR(2),            /* VITRECS. NUMBER.              */ 03450000
*    2 RSSTART  CHAR(1)   ,         /* REM.STORE START NO.           */ 03500000
*    2 RSNUMBR  CHAR(2),            /* REM.STORE NUMBER.             */ 03550000
*    2 DELAY    CHAR(1)   ,         /* DELAY DAYS.                   */ 03600000
*    2 OWNER    CHAR(4),            /* OWNER.                        */ 03650000
*    2 ADDATE   CHAR(3),            /* AUTO. DELETE DATE.            */ 03700000
*    2 YYDDD    CHAR(3),            /* DATE LAST CHANGED.            */ 03750000
*    2 X1       CHAR(19);           /* SPARE FIELD.                  */ 03800000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   03850000
