*/*  BILINGUAL MAPPING,                                                 00010000
         MACRO                                                          00020000
&LABEL   EDGAPIPL &LIST=NO                                              00030000
         PUSH  PRINT                                                    00040000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00050000
         PRINT OFF                                                      00060000
.ASMLIST ANOP                                                           00070000
**** START OF SPECIFICATIONS ****************************************** 00080000
***                                                                  ** 00090000
***  $MAC(EDGAPIPL) COMP(COM) PROD(RMM):                             ** 00100000
***                                                                  ** 00110000
***  MACRO NAME:        EDGAPIPL                                     ** 00120000
***                                                                  ** 00130000
***  DESCRIPTIVE NAME:  EDGAPISR PARAMETER LIST                      ** 00140000
***                                                                  ** 00150000
***  COPYRIGHT/SECURITY:                                             ** 00160000
***                                                                  ** 00170000
** OS/390 DFSMSrmm V2R10                                             ** 00180000
**                                                                   ** 00190000
**PROPRIETARY V3 STATEMENT                                            * 00200000
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00210000
**"RESTRICTED MATERIALS OF IBM"                                       * 00220000
**5647-A01                                                            * 00234990
**(C) COPYRIGHT 2001  IBM CORP.                                       * 00239980
**STATUS = HDZ11F0                                                    * 00244970
**END PROPRIETARY V3 STATEMENT                                        * 00250000
***  INVOCATION:        PL/X                                         ** 00260000
***                                                                  ** 00270000
***                       %INCLUDE SYSLIB(EDGAPIPL)                  ** 00280000
***                                                                  ** 00290000
***                     ASSEMBLER H                                  ** 00300000
***                                                                  ** 00310000
***                       EDGAPIPL  LIST=NO/YES                      ** 00320000
***                                                                  ** 00330000
***  NOTES:                                                          ** 00340000
***                                                                  ** 00350000
***    USAGE:           USED BY EDGUX100 AND CBRUXxxx    TO MAP      ** 00360000
***                     THE PARAMETER LIST.                          ** 00370000
***                                                                  ** 00380000
***    CREATED BY:      EDGUX100 or CBRUXxxx user exits              ** 00390000
***                                                                  ** 00400000
***    COMPLETED BY:    EDGAPISR                                     ** 00410000
***                                                                  ** 00420000
***    POINTED TO BY:   REGISTER 1 ON ENTRY TO EDGAPISR              ** 00430000
***                                                                  ** 00440000
***    FREED BY:        The CALLERS                                  ** 00450000
***                                                                  ** 00460000
***    SERIALIZATION:   NONE                                         ** 00470000
**                                                                    * 00480000
**  CHANGE ACTIVITY = SEE BELOW                                       * 00490000
**  $00=OW47481,150,010119,VD : API call from user exits              * 00500000
**                                                                    * 00510000
*********************************************************************** 00520000
APIVOL   DSECT                                                          00530000
APIVSN   DC CL6' '             ** VOLUME SERIAL NUMBER           **     00540000
APIRACK  DC CL6' '             ** RACK NUMBER                    **     00550000
APIASDTE DC XL4'00'            ** ASSIGNED DATE  (YYYYDDD)       **     00560000
APIASTME DC XL4'00'            ** ASSIGNED TIME  (HHMMSST)       **     00570000
APICRDTE DC XL4'00'            ** VOL  CREATE DATE               **     00580000
APICRTME DC XL4'00'            ** VOL  CREATE TIME               **     00590000
APIEXPDT DC XL4'00'            ** EXPIRATION  DATE               **     00600000
APIEXPDO DC XL4'00'            ** EXPIRATION  DATE  - ORIGINAL   **     00610000
APIRDDTE DC XL4'00'            ** DATE VOLUME LAST READ          **     00620000
APIWTDTE DC XL4'00'            ** DATE VOLUME LAST WRITTEN       **     00630000
APIDSNNO DC XL4'00'            ** DATASET COUNT                  **     00640000
APIVOLSQ DC XL4'00'            ** VOLUME SEQUENCE NUMBER         **     00650000
APIKBYTE DC XL4'00'            ** VOLUME USAGE IN KBYTES         **     00660000
APIUSECT DC XL4'00'            ** VOLUME USE COUNT               **     00670000
APITEMPR DC XL4'00'            ** TEMPORARY READ ERRORS          **     00680000
APITEMPW DC XL4'00'            ** TEMPORARY WRITE ERRORS         **     00690000
APIPERMR DC XL4'00'            ** PERMANENT READ ERRORS          **     00700000
APIPERMW DC XL4'00'            ** PERMANENT WRITE ERRORS         **     00710000
APISTAT  DC XL1'00'            ** VOLUME STATUS                  **     00720000
APIAVAIL DC XL1'00'            ** VOLUME AVAILABILITY            **     00730000
APILABEL DC XL1'00'            ** LABEL TYPE                     **     00740000
APIDEN   DC XL1'00'            ** RECORDING DENSITY              **     00750000
APIMEDIA DC XL1'00'            ** TAPE MEDIA TYPE                **     00760000
APIRLSE  DC XL1'00'            ** ACTIONS ON RELEASE             **     00770000
APIPEND  DC XL1'00'            ** ACTIONS PENDING                **     00780000
APIBIN   DC CL6' '             ** BIN                            **     00790000
APIOBIN  DC CL6' '             ** OLD BIN                        **     00800000
APIDSN   DC CL44' '            ** DATASET NAME                   **     00810000
APIJOB   DC CL8' '             ** JOBNAME                        **     00820000
APIOWNER DC CL8' '             ** OWNER                          **     00830000
APIACCT  DC CL40' '            ** ACCOUNT NUMBER                 **     00840000
APIDESC  DC CL30' '            ** DESCRIPTION                    **     00850000
APILOC   DC CL8' '             ** LOCATION                       **     00860000
APIRQLOC DC CL8' '             ** REQUIRED LOCATION              **     00870000
APILOAN  DC CL8' '             ** LOAN LOCATION                  **     00880000
APIDEST  DC CL8' '             ** DESTINATION                    **     00890000
APIPVSN  DC CL6' '             ** PREVIOUS VOLUME SERIAL         **     00900000
APINVSN  DC CL6' '             ** NEXT VOLUME SERIAL             **     00910000
APIVOLL  EQU *-APIVSN          Length of needed area                    00920000
         POP   PRINT                                                    00930000
         MEND  ,  */                                                    00940000
*%IHALPUSH = '@LISTPUSH';                                               00950000
*%IHALOFF = '@LISTOFF';                                                 00960000
*%IHALPOP = '@LISTPOP';                                                 00970000
*IHALPUSH;                                                              00980000
*%IF IHALIST='YES' %THEN                                                00990000
*    %GOTO EDGPL10004;                                                  01000000
*IHALOFF;                                                               01010000
*%EDGPL10004: ;                                                         01020000
*@EJECT;                                                                01030000
*      /* EDGAPISR PARAMETER LIST                                    */ 01040000
*DECLARE                                                                01050000
*  1 APIVOL  BDY(DWORD) BASED,      /*  EDGAPISR PARAMETER LIST      */ 01060000
*    3 APIVSN   CHAR(6),           /* VOLUME SERIAL NUMBER           */ 01070000
*    3 APIRACK  CHAR(6),           /* RACK NUMBER                    */ 01080000
*    3 APIASDTE CHAR(4),           /* ASSIGNED DATE  (YYYYDDD)       */ 01090000
*    3 APIASTME CHAR(4),           /* ASSIGNED TIME  (HHMMSST)       */ 01100000
*    3 APICRDTE CHAR(4),           /* VOL  CREATE DATE               */ 01110000
*    3 APICRTME CHAR(4),           /* VOL  CREATE TIME               */ 01120000
*    3 APIEXPDT CHAR(4),           /* EXPIRATION  DATE               */ 01130000
*    3 APIEXPDO CHAR(4),           /* EXPIRATION  DATE  - ORIGINAL   */ 01140000
*    3 APIRDDTE CHAR(4),           /* DATE VOLUME LAST READ          */ 01150000
*    3 APIWTDTE CHAR(4),           /* DATE VOLUME LAST WRITTEN       */ 01160000
*    3 APIDSNNO CHAR(4),           /* DATASET COUNT                  */ 01170000
*    3 APIVOLSQ CHAR(4),           /* VOLUME SEQUENCE NUMBER         */ 01180000
*    3 APIKBYTE CHAR(4),           /* VOLUME USAGE IN KBYTES         */ 01190000
*    3 APIUSECT CHAR(4),           /* VOLUME USE COUNT               */ 01200000
*    3 APITEMPR CHAR(4),           /* TEMPORARY READ ERRORS          */ 01210000
*    3 APITEMPW CHAR(4),           /* TEMPORARY WRITE ERRORS         */ 01220000
*    3 APIPERMR CHAR(4),           /* PERMANENT READ ERRORS          */ 01230000
*    3 APIPERMW CHAR(4),           /* PERMANENT WRITE ERRORS         */ 01240000
*    3 APISTAT  BIT(8),            /* VOLUME STATUS                  */ 01250000
*    3 APIAVAIL BIT(8),            /* VOLUME AVAILABILITY            */ 01260000
*    3 APILABEL BIT(8),            /* LABEL TYPE                     */ 01270000
*    3 APIDEN   BIT(8),            /* RECORDING DENSITY              */ 01280000
*    3 APIMEDIA BIT(8),            /* TAPE MEDIA TYPE                */ 01290000
*    3 APIRLSE  BIT(8),            /* ACTIONS ON RELEASE             */ 01300000
*    3 APIPEND  BIT(8),            /* ACTIONS PENDING                */ 01310000
*    3 APIBIN   CHAR(6),           /* BIN                            */ 01320000
*    3 APIOBIN  CHAR(6),           /* OLD BIN                        */ 01330000
*    3 APIDSN   CHAR(44),          /* DATASET NAME                   */ 01340000
*    3 APIJOB   CHAR(8),           /* JOBNAME                        */ 01350000
*    3 APIOWNER CHAR(8),           /* OWNER                          */ 01360000
*    3 APIACCT  CHAR(40),          /* ACCOUNT NUMBER                 */ 01370000
*    3 APIDESC  CHAR(30),          /* DESCRIPTION                    */ 01380000
*    3 APILOC   CHAR(8),           /* LOCATION                       */ 01390000
*    3 APIRQLOC CHAR(8),           /* REQUIRED LOCATION              */ 01400000
*    3 APILOAN  CHAR(8),           /* LOAN LOCATION                  */ 01410000
*    3 APIDEST  CHAR(8),           /* DESTINATION                    */ 01420000
*    3 APIPVSN  CHAR(6),           /* PREVIOUS VOLUME SERIAL         */ 01430000
*    3 APINVSN  CHAR(6);           /* NEXT VOLUME SERIAL             */ 01440000
*IHALPOP;                                                               01450000
