* %GOTO EDGCKREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGCKREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                             **    **************          00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM CONVERSION VRS RECORD MAPPING                           ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
** DFSMS/MVS 1.5.0 DFSMSrmm                                           * 00650000
**                                                                    * 00700000
**PROPRIETARY V3 STATEMENT                                            * 00742800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00785600
**"RESTRICTED MATERIALS OF IBM"                                       * 00828400
**5695-DF1                                                            * 00871200
**(C) COPYRIGHT 1994,1995  IBM CORP.                                  * 00914000
**END PROPRIETARY V3 STATEMENT                                        * 00956800
*********************************************************************** 01000000
***                                                                  ** 01050000
***                                                                  ** 01100000
***                                                                  ** 01150000
*** FUNCTION : EDGCKREC MAPS THE CONVERSION VRS RECORD               ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON RMMKREC                          ** 01450000
***                                                                  ** 01500000
***         LA     Rx,KRECAREA                                       ** 01550000
***         USING  RMMKREC,Rx                                        ** 01600000
***         MVI    VRSRID,C'K'           Set K record type           ** 01650000
***                                                                  ** 01700000
***            PLX       - %INCLUDE EDGCKREC                     @02A** 01716600
***                                                              @02A** 01733200
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01750000
***            PLX       - SPECIFY &IHALIST='YES' BEFORE         @02A*  01766600
***                        INCLUDE                               @02A*  01783200
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
**$00=OW0xxxx,110,940920,MWW: Create Macro                           ** 01900000
**$01=OW11151,110,940921,MWW: Implement Macro                    @01A** 01950000
**$02=OW12935,120,951004,GD:  Add supporting PLX/370             @02A** 01966600
**$K1=K151038,150,980616,BDG: Correct flags in PLX/370 part      @K1A** 01974900
**$S7=OW30969,140,971001,RS : VRS Enhancements                   @S7A** 01979000
**$03=OW32993,130,980607,RS : sync PL/X and Assembler part       @03A** 01989500
***                                                                  ** 02000000
*********************************************************************** 02050000
         SPACE 1                                                        02100000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02150000
         AGO   .GENSTRT                                                 02200000
.GENDSCT ANOP                                                           02250000
RMMKREC  DSECT                                                          02300000
.GENSTRT ANOP                                                           02350000
*                                                                       02400000
* START OF RMMKREC                                                      02450000
*                                                                       02500000
KREC     DS    0D                       BOUNDARY ALIGN                  02550000
KRECRDW  DS    0XL4                     RESERVED FOR RDW           @01C 02600000
         DC    AL2(KRECLEN)             RDW Record Length          @01A 02650000
         DC    AL2(0)                   Zero                       @01A 02700000
VRSRID   DC    CL1'K'         REQ       VITAL RECORDS RECORD ID         02750000
VRSRTYPE EQU   C'K'                     VITAL RECORDS RECORD TYPE  @01A 02800000
VCRDATE  DC    PL4'0'                   VRS CREATION DATE YYYYDDD       02850000
VCRTIME  DC    PL4'0'                   VRS CREATION TIME               02900000
VTYPEID  DC    CL1'D'         REQ       VRS TYPE                   @01C 02950000
VTYPED   EQU   C'D'                     D - DATA SET               @01C 03000000
VTYPEN   EQU   C'N'                     N - NAME                   @01C 03050000
VTYPEV   EQU   C'V'                     V - VOLUME                 @01C 03100000
VDSNAME  DC    CL44' '        COND      DATASET NAME                    03150000
VDSNTYPE DC    XL1'20'        COND      FORMAT OF DATA SET NAME    @01C 03200000
VDSNGDG  EQU   X'80'                    X'80' = GDG                @01C 03250000
VDSNSTD  EQU   X'20'                    X'20' = STANDARD           @01C 03300000
VRETN    DC    XL1'00'        COND      TYPE OF RETENTION               03350000
VRETNCYC EQU   X'80'                    X'80' = BASED ON CYCLES    @01C 03400000
VRETNELP EQU   X'40'                    X'40' = BASED ON ELAPSED   @01C 03450000
*                                               DAYS                    03500000
VRETNLRF EQU   X'20'                    X'20' = BASED ON DAYS      @01C 03550000
*                                               UNREFERENCED            03600000
VRETNCAT EQU   X'10'                    X'10' = BASED ON CATALOGED @01C 03650000
VRETNUEX EQU   X'08'                    X'08' = UNTIL EXPIRED      @01C 03700000
VRETNXD  EQU   X'04'                    X'04' = EXTRADAYS          @S7A 03716600
VRETNBDC EQU   X'02'                    X'02' = BYDAYSCYCLE        @S7A 03733200
VVOLSER  DC    CL6' '         COND      VOLUME SERIAL NUMBER            03750000
VDELAY   DC    H'0'           REQ       DELAY DAYS                      03800000
VRCOUNT  DC    F'99999'       REQ       VITAL RECORDS NUMBER       @01C 03850000
*                                       NUMBER OF CYCLES OR             03900000
*                                       ELAPSED DAYS OF VOLUMES         03950000
*                                       TO BE KEPT IN TOTAL             04000000
VRSNAME  DC    CL8' '         COND      VRS NAME                        04050000
VSTRKEEP DC    F'99999'       REQ       STPRE KEEP NUMBER          @01C 04100000
*                                       NUMBER OF CYCLES OR             04150000
*                                       WORKING DAYS OF VOLUMES         04200000
*                                       TO BE KEPT IN STORE             04250000
VOWNER   DC    CL8' '         REQ       OWNER                           04300000
VDELDATE DC    PL4'0'                   AUTOMATIC DELETE DATE (YYYYDDD) 04350000
VDESC    DC    CL30' '                  DESCRIPTION                     04400000
VLOCNAM  DC    CL8'HOME'      REQ       LOCATION NAME              @01C 04450000
VRSNEXT  DC    CL8' '         COND      NAME OF NEXT VRS DEFINITION     04500000
VRSJOBN  DC    CL8' '         COND      NAME OF CREATING JOB       @01A 04550000
VRSOPTS  DC    XL1'0'                   OPTIONS BYTE               @S7A 04566600
VANDVRS  EQU   X'80'                    VRSNEXT IS ANDVRS()        @S7A 04583200
VRELIXD  EQU   X'40'                    RELEASE(EXPIRYDATEIGNORE)  @S7A 04599800
VRELSI   EQU   X'20'                    RELEASE(SCRATCHIMMEDIATE)  @S7A 04616400
         DS    XL1'0'         RESERVED                             @S7C 04633000
         DS    8F'0'          RESERVED                             @01C 04650000
KRECLEN  EQU   *-KREC                                              @01C 04700000
*                                                                       04750000
* END OF RMM RMMKREC                                                    04800000
*                                                                       04850000
         POP   PRINT                                                    04900000
         MEND  , */                                                     04950000
*%EDGCKREC1:;                                                           05000000
*%IHALPUSH = '@LISTPUSH';                                               05050000
*%IHALOFF  = '@LISTOFF';                                                05100000
*%IHALPOP  = '@LISTPOP';                                                05150000
*IHALPUSH;                                                              05200000
*%IF IHALIST='YES' %THEN                                                05250000
* %GOTO EDGCKREC42;                                                     05300000
*IHALOFF;                                                               05350000
*%EDGCKREC42:; /* P L S M A P P I N G S T A R T */                      05400000
*DCL                                                                    05450000
*  1 CKREC    BASED,                /* 0                             */ 05452900
*    2 KREC     BDY(WORD) CHAR(0),  /* BOUNDARY ALIGN            @02A*/ 05455800
*    2 KRECRDW  FIXED(31),          /* RESERVED FOR RDW          @02A*/ 05458700
*    2 VRSRID   CHAR(1),            /* VRS        RECORD ID      @02A*/ 05461600
*    2 VCRDATE  CHAR(4),            /* VRS CREATE DATE - YYYYDDD @02A*/ 05464500
*    2 VCRTIME  CHAR(4),            /* VRS CREATE TIME - HHMMSST @02A*/ 05467400
*    2 VTYPEID  CHAR(1),            /* VRS TYPE                  @02A*/ 05470300
*    2 VDSNAME  CHAR(44),           /* DATASET NAME              @02A*/ 05473200
*    2 VDSNTYPE BIT(8),             /* FORMAT OF DATA SET NAME   @02A*/ 05476100
*      3 VDSNGDG  BIT(1),           /* GDG FORMAT DSN            @02A*/ 05479000
*      3 *        BIT(1),           /*                           @03C*/ 05481900
*      3 VDSNSTD  BIT(1),           /* STD FORMAT DSN            @02A*/ 05484800
*      3 *        BIT(5),           /*                           @03C*/ 05487700
*    2 VRETN    BIT(8),             /* VRS RETENTION TYPE        @02A*/ 05490600
*      3 VRETNCYC BIT(1),           /* RETAIN BY CYCLES          @02A*/ 05493500
*      3 VRETNELP BIT(1),           /* RETAIN BY ELAPSED DAYS    @02A*/ 05496400
*      3 VRETNLRF BIT(1),           /* RETAIN BY DAYS SINCE REF  @02A*/ 05499300
*      3 VRETNCAT BIT(1),           /* RETAIN WHILST CATALOGUED  @02A*/ 05502200
*      3 VRETNUEX BIT(1),           /* RETAIN UNTIL EXPIERED     @02A*/ 05505100
*      3 VRETNXD  BIT(1),           /* EXTRADAYS                 @S7A*/ 05506500
*      3 VRETNBDC BIT(1),           /* BYDAYSCYCLE               @S7A*/ 05507900
*      3 *        BIT(1),           /*                           @02A*/ 05509300
*    2 VVOLSER  CHAR(6),            /* VOLUME SERIAL NUMBER      @02A*/ 05510900
*    2 VDELAY   FIXED(15),          /* DAYS DELAY BEFORE MOVEMNT @02A*/ 05513800
*    2 VRCOUNT  FIXED(31),          /* VITAL RECORDS NUMBER.     @02A*/ 05516700
*                                   /* NUMBER OF CYCLES OR DAYS  @02A*/ 05519600
*                                   /* FOR VOLUME TO BE KEPT.    @02A*/ 05522500
*    2 VRSNAME  CHAR(8),            /* VRS NAME                  @02A*/ 05525400
*    2 VSTRKEEP FIXED(31),          /* STORE KEEP NUMBER.        @02A*/ 05528300
*                                   /* NUMBER OF CYCLES OR DAYS  @02A*/ 05531200
*                                   /* OF VOLUME TO BE KEPT      @02A*/ 05534100
*                                   /* IN STORE                  @02A*/ 05537000
*    2 VOWNER   CHAR(8),            /* VRS OWNER ID              @02A*/ 05539900
*    2 VDELDATE CHAR(4),            /* AUTO-DELETE DATE -YYYYDDD @02A*/ 05542800
*    2 VDESC    CHAR(30),           /* VRS DESCRIPTION           @02A*/ 05545700
*    2 VLOCNAM  CHAR(8),            /* LOCATION NAME             @02A*/ 05548600
*    2 VRSNEXT  CHAR(8),            /* NAME OF CHAINED VRS       @02A*/ 05551500
*    2 VRSJOBN  CHAR(8),            /* NAME OF CREATING JOB      @02A*/ 05554400
*    2 VRSOPTS  BIT(8),             /* OPTIONS BYTE              @S7A*/ 05555200
*      3 VANDVRS  BIT(1),           /* VRSNEXT IS ANDVRS()       @S7A*/ 05556000
*      3 VRELIXD  BIT(1),           /* EXPIRY DATE IGNORE        @S7A*/ 05556800
*      3 VRELSI   BIT(1),           /* SCRATCH IMMEDIATE         @S7A*/ 05557600
*      3 *        BIT(5),           /* RESERVED                  @S7A*/ 05558400
*    2 *        CHAR(1),            /* RESERVED                  @S7C*/ 05559200
*    2 *(8)     FIXED(31),          /* RESERVED                  @02A*/ 05560200
*    2 CKRECEND BDY(WORD) CHAR(0);  /* END OF CNVKREC            @02A*/ 05563100
*DCL                                /*                           @02A*/ 05566000
*  VRSRTYPE  CHAR(1) CONSTANT('K'), /*                           @02A*/ 05568900
*                                   /* 'K' - VRS RECORD TYPE     @02A*/ 05571800
*  VTYPED    CHAR(1) CONSTANT('D'), /*                           @02A*/ 05574700
*                                   /* 'D' - DATASET TYPE VRS    @02A*/ 05577600
*  VTYPEN    CHAR(1) CONSTANT('N'), /*                           @02A*/ 05580500
*                                   /* 'N  - NAME    TYPE VRS    @02A*/ 05583400
*  VTYPEV    CHAR(1) CONSTANT('V'); /*                           @02A*/ 05586300
*                                   /* 'V' - VOLUME  TYPE VRS    @02A*/ 05589200
*                                   /*                           @02A*/ 05592100
*                                   /*                           @02A*/ 05595000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   05600000
