* %GOTO EDGCLREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGCLREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                             **      **********            00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM CONVERSION LIBRARY RECORD MAPPING                       ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
** DFSMS/MVS 1.5.0 DFSMSrmm                                           * 00650000
**                                                                    * 00700000
**PROPRIETARY V3 STATEMENT                                            * 00742800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00785600
**"RESTRICTED MATERIALS OF IBM"                                       * 00828400
**5695-DF1                                                            * 00871200
**(C) COPYRIGHT 1994,1995  IBM CORP.                                  * 00914000
**END PROPRIETARY V3 STATEMENT                                        * 00956800
*********************************************************************** 01000000
***                                                                  ** 01050000
***                                                                  ** 01100000
***                                                                  ** 01150000
*** FUNCTION : EDGCLREC MAPS THE CONVERSION LIBRARY RECORD           ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON RMMLREC                          ** 01450000
***                                                                  ** 01500000
***         LA     Rx,LRECAREA                                       ** 01550000
***         USING  RMMLREC,Rx                                        ** 01600000
***         MVI    LIBRID,C'L'           Set L record type           ** 01650000
***                                                                  ** 01700000
***            PLX       - %INCLUDE EDGCLREC                     @02A** 01716600
***                                                              @02A** 01733200
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01750000
***            PLX       - SPECIFY &IHALIST='YES' BEFORE         @02A** 01766600
***                        INCLUDE                               @02A** 01783200
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
**$00=OW0xxxx,110,940920,MWW: Create Macro                           ** 01900000
**$01=OW11151,110,940921,MWW: Implement Macro                    @01A** 01950000
**$02=OW12935,120,951004,GD:  Add supporting PLX/370             @02A** 01966600
**$03=OW18740,120,960227,WKN: Mismatch between PLX and ASSM      @03A** 01974900
**$04=OW21275,120,960916,CHK: Alignment                          @04A** 01979000
**$K1=K151038,150,980616,BDG: Correct offsets in ASM part        @K1A** 01981100
**$05=OW32993,130,980607,RS : sync PL/X and Assembler part       @05A** 01990500
**$06=OW37600,140,990112,RS : Add EHPCT media and SMS management @06A** 01993600
**                            class support                      @06A** 01996700
**$07=OW40710,140,990819,RS : Add Creating program name          @07A** 01998300
**$08=OW44589,140,000518,OG : Add NO DATA SET RECORDING flag     @08A** 01999090
**$09=OW48290,160,010220,RS : Add 256 track tedia support        @09A** 01999480
***                                                                  ** 02000000
*********************************************************************** 02050000
         SPACE 1                                                        02100000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02150000
         AGO   .GENSTRT                                                 02200000
.GENDSCT ANOP                                                           02250000
RMMLREC  DSECT                                                          02300000
.GENSTRT ANOP                                                           02350000
*                                                                       02400000
* START OF RMMLREC                                                      02450000
*                                                                       02500000
LREC     DS    0D                       BOUNDARY ALIGN                  02550000
LRECRDW  DS    0XL4                     RESERVED FOR RDW           @01C 02600000
         DC    AL2(LRECLEN)             RDW RECORD LENGTH          @01A 02650000
         DC    AL2(0)                   ZERO                       @01A 02700000
LIBRID   DC    CL1'L'         REQ       LIBRARY RECORD ID               02750000
LVTYPE   EQU   C'L'                     LIBRARY RECORD ID TYPE     @01A 02800000
LVOLSER  DC    CL6' '         REQ       VOLUME SERIAL NUMBER            02850000
LVOWNER  DC    CL8' '         REQ       VOLUME OWNER                    02900000
LVOUID   DC    CL8' '                   VOLUME OWNER USERID             02950000
LVONODE  DC    CL8' '                   VOLUME OWNER NODEID             03000000
LRESRVA  DC    XL1'00'                  RESERVED                        03050000
LVSECLEV DC    H'0'                     VOLUME SECURITY LEVEL           03100000
*                                       EQUIV TO SEC LVL IN PARMLIB     03150000
LVSEQNO  DC    AL2(1)         REQ       VOLUME SEQUENCE NUMBER     @01C 03200000
LVCRDATE DC    PL4'0'         REQ       VOLUME CREATE DATE YYYYDDD      03250000
LVCRTIME DC    PL4'0'                   VOLUME CREATE TIME              03300000
LVCRUID  DC    CL8' '                   VOLUME CREATE USERID            03350000
LVCRJOB  DC    CL8' '                   VOLUME CREATE JOB NAME          03400000
LVUCBTYP DC    XL4'00'                  COPY OF UCBTYP                  03450000
LVTDSI   DC    XL4'00'        COND      TAPE MEDIA TYPE INFORMATION     03500000
*                                       TAPE RECORDING FORMAT           03550000
*                                       ONE OF: X'00' - NOT 3480        03600000
LVM18TRK EQU   X'01'                            X'01' - 18 TRACK   @01C 03650000
LVM36TRK EQU   X'02'                            X'02' - 36 TRACK   @01C 03700000
LVM128TR EQU   X'03'                            X'03' - 128 TRACK  @06A 03725000
LVM256TR EQU   X'04'                            X'04' - 256 TRACK  @09A 03734990
*                                       TAPE MEDIA TYPE. ONE OF:        03750000
*                                       X'00' - NOT 3480                03800000
LVMSTDCP EQU   X'01'                    X'01' - STANDARD CAPACITY  @01C 03850000
LVMENHCP EQU   X'02'                    X'02' - ENHANCED CAPACITY  @01C 03900000
LVMHPCT  EQU   X'03'                    X'03' - HPCT  3590 STD CAP @06A 03916600
LVMEHPCT EQU   X'04'                    X'04' - EHPCT 3590 EXT CAP @06A 03933200
*                                       TAPE COMPACTION TECHNIQUE       03950000
*                                       ONE OF: X'00' - UNKNOWN         04000000
LVMNCOMP EQU   X'01'                           X'01' - NOT COMPACT @01C 04050000
LVMIDRC  EQU   X'02'                           X'02' - IDRC        @01C 04100000
*                                       TAPE SPECIAL ATTRIBUTES.        04150000
*                                       ONE OF: X'00' - NONE            04200000
LVM18TRD EQU   X'01'                     X'01' - 18 TRACK READ ONLY@01C 04250000
LVTUSE   DC    F'0'                     TAPE USAGE IN K-BYTES           04300000
LVEXDATO DC    PL4'0'         REQ       JCL VOL EXPIRATION DATE         04350000
LVEXDATE DC    PL4'0'         REQ       VOLUME  EXPIRATION DATE         04400000
LVRETDTE DC    PL4'0'         COND      VOLUME  RETENTION DATE     @01A 04450000
LVDSNCNT DC    H'0'           REQ       COUNT OF DS W/ORIG ON VOL       04500000
LVTRERR  DC    H'0'                     TEMPORARY READ ERRORS           04550000
LVTWERR  DC    H'0'                     TEMPORARY WRITE ERRORS          04600000
LVPRERR  DC    H'0'                     PERMANENT READ ERRORS           04650000
LVPWERR  DC    H'0'                     PERMANENT WRITE ERRORS          04700000
LVRDEN   DS    XL1'00'                  COPY OF JFCBDEN                 04750000
LBPIIND  DS    CL1'*'         REQ       BPI INDICATOR              @01C 04800000
BPI1600  EQU   C'3'                     '3' - 1600BPI                   04850000
BPI6250  EQU   C'4'                     '4' - 6250BPI                   04900000
BPI3480  EQU   C'9'                     '9' - 3480                      04950000
BPI3480C EQU   C'C'                     'C' - 3480 COMPACT (IDRC)       05000000
BPIUNDEF EQU   C'*'                     '*' - UNDEFINED                 05050000
LVFLAGA  DC    AL1(SCRFLG)    REQ       FLAGS 'A' - STATUS         @01C 05100000
MSTFLG   EQU   X'80'                    VOLUME IS MASTER                05150000
RLSFLG   EQU   X'40'                    VOLUME PENDING RELEASE          05200000
VRFLG    EQU   X'20'                    VITAL RECD - DO NOT RELEASE     05250000
ASSFLG   EQU   X'10'                    USER TAPE (ASSIGNED BY LIB)     05300000
LONFLG   EQU   X'08'                    TAPE IS ON LOAN                 05350000
OPNFLG   EQU   X'04'                    TAPE OPEN - NOT YET CLOSED      05400000
SCRFLG   EQU   X'02'                    VOLUME IS SCRATCH               05450000
OCEFLG   EQU   X'01'                    VOLUME RECORDED BY O/C/EOV      05500000
LVFLGAX  DC    XL1'00'        REQ       FLAG A EXTENTION                05550000
MVGVCFLG EQU   X'80'                    SCRATCH VOL CLAIMED BY GETVOL   05600000
MVXINFLG EQU   X'40'                    SCRATCH VOL NEVER INITIALIZED   05650000
MVINIFLG EQU   X'20'                    SCRATCH VOL W/INIT ACTION PEND  05700000
MVENTFLG EQU   X'10'                    SCARTCH VOL WAIT TO ENTER ATL   05750000
MVFABEND EQU   X'08'                    ABEND IN PROCESS WHEN DS CLOSED 05800000
MVFOCEAB EQU   X'04'                    ABEND PROBABLY IN O/C/EOV       05850000
LVFLAGB  DC    AL1(SLTAPE)    REQ       FLAGS ARE 0 OR 1           @01C 05900000
DEFRET   EQU   X'80'                    DEF. RETEN. PERIOD USED         05950000
NLTAPE   EQU   X'20'                    LABEL TYPE IS NL                06000000
ALTAPE   EQU   X'10'                    LABEL TYPE IS AL                06050000
SLTAPE   EQU   X'08'                    LABEL TYPE IS SL                06100000
BLTAPE   EQU   X'02'                    TAPE LAST WRITTEN w/BLP         06150000
ULTAPE   EQU   X'01'                    SL OR AL w/USER LABELS          06200000
LVFLAGC  DC    XL1'00'                  FLAGS ARE 0 OR 1                06250000
RETSCR   EQU   X'80'                    RETRN TO SCRTCH POOL -DEFLT     06300000
REPREL   EQU   X'40'                    REPLACE TAPE ON RELEASE         06350000
REINIT   EQU   X'20'                    REINITIALIZE                    06400000
DEGAUS   EQU   X'10'                    DEGAUS/SECURITY ERASE           06450000
ROWNER   EQU   X'08'                    RETURN TO OWNER                 06500000
NOWNER   EQU   X'04'                    NOTIFY OWNER                    06550000
LVFLAGD  DC    AL1(OALT+UPROT+MVSUSE) REQ FLAGS ARE 0 OR 1         @01C 06600000
OREAD    EQU   X'80'                    OWNER MAY READ VOLUME           06650000
OUPD     EQU   X'40'                    OWNER MAY UPDATE VOLUME         06700000
OALT     EQU   X'20'                    OWNER MAY ALTER VOLUME          06750000
RPROT    EQU   X'10'                    READ-ONLY PROTECTION            06800000
UPROT    EQU   X'08'                    UPDATE PROTECTION               06850000
MVSUSE   EQU   X'04'                    MAY BE USED ON MVS SYSTEMS      06900000
VMUSE    EQU   X'02'                    MAY BE USED ON VM SYSTEMS       06950000
NODSNR   EQU   X'01'                    NO DATA SET RECORDING      @08A 06969990
LVMEDIA  DC    CL8' '                   MEDIA NAME                      07000000
LVUNITAD DC    CL4' '                   UNIT ADDRESS USED               07050000
LVLSTUAD DC    CL4' '                   LAST UNIT ADDRESS USED     @01A 07100000
LVLONLOC DC    CL8' '                   LOAN LOCATION                   07150000
LVLRDDAT DC    PL4'0'                   DATE VOLUME LAST READ (YYYYDDD) 07200000
LVLWTDAT DC    PL4'0'                   DATE VOLUME LAST WRIT (YYYYDDD) 07250000
LVASDATE DC    PL4'0'                   ASSIGN FROM SCR DATE  (YYYYDDD) 07300000
LVASTIME DC    PL4'0'                   ASSIGN FROM SCR TIME  (HHMMSST) 07350000
LVLTYP   DC    XL1'00'                  COPY OF JFCBLTYP                07400000
LVTRTCH  DC    XL1'00'        REQ       FROM JFCTRTCH - IDRC SUPT       07450000
COMPACT  EQU   X'08'                    DSN USED 3480 IDRC              07500000
NCOMPACT EQU   X'04'                    NO COMPACTION                   07550000
LRESRVB  DC    CL1' '                   RESERVED                        07600000
LVLOCNAM DC    CL8' '         REQ       CURRENT LOCATION OF VOLUME      07650000
LVDEST   DC    CL8' '                   DESTINATION NAME                07700000
LVHLOC   DC    CL8' '                   HOME LOCATION NAME              07750000
LVSGNAME DC    CL8' '                   STORAGE GROUP NAME              07800000
LACCINF  DC    CL40' '                  ACCOUNTING INFORMATION          07850000
LDESC    DC    CL30' '                  USER DESCRIPTION                07900000
LAUTHIDS DC    CL96' '                  AUTHORISED USER IDS AREA        07950000
LAUTHID1 EQU   LAUTHIDS,8                 1ST AUTH. USER ID SLOT        08000000
LAUTHID2 EQU   LAUTHID1+8,8                   AUTH. USER ID SLOT        08050000
LAUTHID3 EQU   LAUTHID2+8,8                   AUTH. USER ID SLOT        08100000
LAUTHID4 EQU   LAUTHID3+8,8                   AUTH. USER ID SLOT        08150000
LAUTHID5 EQU   LAUTHID4+8,8                   AUTH. USER ID SLOT        08200000
LAUTHID6 EQU   LAUTHID5+8,8                   AUTH. USER ID SLOT        08250000
LAUTHID7 EQU   LAUTHID6+8,8                   AUTH. USER ID SLOT        08300000
LAUTHID8 EQU   LAUTHID7+8,8                   AUTH. USER ID SLOT        08350000
LAUTHID9 EQU   LAUTHID8+8,8                   AUTH. USER ID SLOT        08400000
LAUTHIDA EQU   LAUTHID9+8,8                   AUTH. USER ID SLOT        08450000
LAUTHIDB EQU   LAUTHIDA+8,8                   AUTH. USER ID SLOT        08500000
LAUTHIDC EQU   LAUTHIDB+8,8              12TH AUTH. USER ID SLOT        08550000
LRACKNO  DC    CL6' '         REQ       RACK NUMBER                     08600000
LRSBIN   DC    CL6' '         COND      REMOTE STORE BIN NUMBER         08650000
LRSDATE  DC    PL4'0'         COND      REMOTE STORE DATE (YYYYDDD)     08700000
LRBINMDN DC    CL8' '         COND      BIN MEDIA NAME            @20A  08750000
LLABNO1  DC    H'1'           REQ       LABEL NUMBER OF 1ST FILE        08800000
LDS1NAM  DC    CL44' '                  NAME OF 1ST DATASET ON VOL      08850000
LDS1OWNR DC    CL8' '                   FIRST DATA SET'S OWNER          08900000
LDS1SEQ  DC    AL2(1)         COND      SEQ NO OF DATA SET ONE     @01C 08950000
LDS1RECF DC    CL4' '         COND      FIRST DATA SET'S RECFM          09000000
         DS    XL2                      Alignment                  @04A 09025000
LDS1LREC DC    F'0'           COND      FIRST DATA SET'S LRECL          09050000
LDS1BSIZ DC    F'0'           COND      FIRST DATA SET'S BLKSZ          09100000
LDS1BLKS DC    F'0'           COND      FIRST DATA SET'S BLK COUNT      09150000
LDS1KBYT DC    F'0'           COND      FIRST DATA SET'S K-BYTES        09200000
LDS1SCLV DC    H'0'                     FIRST DATA SET SECURITY LEVEL   09250000
LDCRDATE DC    PL4'0'         REQ       DSN1 CREATE DATE YYYYDDD        09300000
LDCRTIME DC    PL4'0'                   DSN1 CREATE TIME                09350000
LDLRDATE DC    PL4'0'         COND      DSN1 DATE LAST READ  YYYYDDD    09400000
LDLWDATE DC    PL4'0'         COND      DSN1 DATE LAST WRITTEN  "       09450000
LDS1FLAG DC    XL1'00'                  DSN1 FLAG BYTE                  09500000
LDS1FCAT EQU   X'80'                    X'80' = DATA SET CATALOGED @01C 09550000
LDS1FABD EQU   X'08'                    X'08' = ABEND IN PROGRESS  @01C 09600000
*                                               WHEN DATA SET CLOSED    09650000
LDVRSVAL DC    CL8' '         COND      VRS MANAGEMENT VALUE            09700000
LDSMSMC  DC    CL8' '         COND      SMS MANAGEMENT CLASS       @06A 09725000
LDS1STEP DC    CL8' '         COND      DSN1 Creating step name    @01A 09750000
LDS1DDNM DC    CL8' '         COND      DSN1 Creating DD   name    @01A 09800000
LDRETDTE DC    PL4'0'         COND      DATA SET RETENTION DATE    @01A 09850000
LDSXNAME DC    CL44' '        COND      NAME OF LAST DATASET ON VOL     09900000
LVCRSID  DC    CL8' '                   Create System ID           @01A 10000000
LDS1CPGM DC    CL8' '                   Create program name        @07A 10004100
LDS1LPGM DC    CL8' '                   Last used program name     @07A 10008200
LDS1LJOB DC    CL8' '                   Last used job name         @07A 10012300
LDS1LSTP DC    CL8' '                   Last used step name        @07A 10016400
LDS1LDD  DC    CL8' '                   Last used DD name          @07A 10020500
         DS    XL1'0'                   RESERVED                   @03M 10025000
         DC    8F'0'                    RESERVED                   @07C 10062500
LRECLEN  EQU   *-LREC                                              @01C 10100000
*                                                                       10150000
* END OF RMM RMMLREC                                                    10200000
*                                                                       10250000
         POP   PRINT                                                    10300000
         MEND  , */                                                     10350000
*%EDGCLREC1:;                                                           10400000
*%IHALPUSH = '@LISTPUSH';                                               10450000
*%IHALOFF  = '@LISTOFF';                                                10500000
*%IHALPOP  = '@LISTPOP';                                                10550000
*IHALPUSH;                                                              10600000
*%IF IHALIST='YES' %THEN                                                10650000
* %GOTO EDGCLREC42;                                                     10700000
*IHALOFF;                                                               10750000
*%EDGCLREC42:; /* P L S M A P P I N G S T A R T */                      10800000
*DCL                                                                    10850000
*  1 CLREC    BASED,                /* 0                         @02C*/ 10850900
*    2 LREC     BDY(WORD) CHAR(0),  /* RESERVED FOR INFORMATION  @02A*/ 10851800
*    2 LRECRDW  FIXED(31),          /* RECORD DESCRIPTOR WORD    @02A*/ 10852700
*    2 LIBRID   CHAR(1),            /* LIBRARY    RECORD ID      @02A*/ 10853600
*    2 LVOLSER  CHAR(6),            /* VOLUME SERIAL NUMBER      @02A*/ 10854500
*    2 LVOWNER  CHAR(8),            /* VOLUME OWNER              @02A*/ 10855400
*    2 LVOUID   CHAR(8),            /* VOLUME NOTIFY USERID      @02A*/ 10856300
*    2 LVONODE  CHAR(8),            /* VOLUME NOTIFY NODE        @02A*/ 10857200
*    2 LRESRVA  CHAR(1),            /* RESERVED                  @02A*/ 10858100
*    2 LVSECLEV FIXED(15),          /* VOLUME SECURITY LEVEL     @02A*/ 10859000
*    2 LVSEQNO  FIXED(15),          /* VOLUME SEQUENCE NUMBER    @02A*/ 10859900
*    2 LVCRDATE CHAR(4),        /* VOLUME CREATE DATE - YYYYDDD  @02A*/ 10860800
*    2 LVCRTIME CHAR(4),        /* VOLUME CREATE TIME - HHMMSST  @02A*/ 10861700
*    2 LVCRUID  CHAR(8),            /* VOLUME CREATE USERID      @02A*/ 10862600
*    2 LVCRJOB  CHAR(8),            /* VOLUME CREATE JOBNAME     @02A*/ 10863500
*    2 LVUCBTYP BIT(32),            /* CUPY OF UCBTYP            @02A*/ 10864400
*    2 LVTDSI   BIT(32),        /* TAPE MEDIA TYPE INFORMATION   @02A*/ 10865300
*      3 LVTDSRC  BIT(8),           /* TAPE RECORDING FORMAT.    @02A*/ 10866200
*      3 LVTDSTY  BIT(8),           /* TAPE MEDIA TYPE. ONE OF:  @02A*/ 10869800
*      3 LVTDSCM  BIT(8),           /* TAPE COMPACTION TECHNIQUE @02A*/ 10873400
*        4 *        BIT(6),         /* ONE OF: X'00' - UNKNOWN   @02A*/ 10874300
*        4 LVMIDRC  BIT(1),         /*       X'02' - IDRC        @02A*/ 10875200
*        4 LVMNCOMP BIT(1),         /*       X'01' - NOT COMPACT @02A*/ 10876100
*      3 LVTDSSA  BIT(8),           /* TAPE SPECIAL ATTRIBUTES.  @02A*/ 10877000
*        4 *        BIT(7),         /* ONE OF: X'00' - NONE      @02A*/ 10877900
*        4 LVM18TRD BIT(1),         /* X'01' - 18 TRACK READ ONL @02A*/ 10878800
*    2 LVTUSE   FIXED(31),          /* TAPE USAGE IN K-BYTES     @02A*/ 10879700
*    2 LVEXDATO CHAR(4),            /* JCL VOL EXPIRATION DATE   @02A*/ 10880600
*    2 LVEXDATE CHAR(4),            /* VOLUME  EXPIRATION DATE   @02A*/ 10881500
*    2 LVRETDTE CHAR(4),            /* VOLUME  RETENTION DATE    @02A*/ 10882400
*    2 LVDSNCNT FIXED(15),          /* COUNT OF DS W/ORIG ONVOL  @02A*/ 10883300
*    2 LVTRERR  FIXED(15),          /* TEMPORARY READ  ERRORS    @02A*/ 10884200
*    2 LVTWERR  FIXED(15),          /* TEMPORARY WRITE ERRORS    @02A*/ 10885100
*    2 LVPRERR  FIXED(15),          /* PERMANENT READ  ERRORS    @02A*/ 10886000
*    2 LVPWERR  FIXED(15),          /* PERMANENT WRITE ERRORS    @02A*/ 10886900
*    2 LVRDEN   BIT(8),             /* COPY OF JFCBDEN           @02A*/ 10887800
*    2 LBPIIND  CHAR(1),            /* BPI INDICATOR             @02A*/ 10888700
*    2 LVFLAGA  BIT(8),             /* FLAGS 'A' - STATUS        @02A*/ 10889600
*      3 LVMSTFLG BIT(1),           /* VOLUME IS MASTER          @02A*/ 10890500
*      3 LVRLSFLG BIT(1),           /* VOLUME PENDING RELEASE    @02A*/ 10891400
*      3 LVVRFLG  BIT(1),      /* VITAL RECORD - DO NOT RELEASE  @02A*/ 10892300
*      3 LVASSFLG BIT(1),      /* USER TAPE (ASSIGNED BY LIB)    @O2A*/ 10893200
*      3 LVLONFLG BIT(1),      /* TAPE IS ON LOAN                @02A*/ 10894100
*      3 LVOPNFLG BIT(1),      /* TAPE OPENED AND NOT YET CLOSED @02A*/ 10895000
*      3 LVSCRFLG BIT(1),      /* VOLUME IS SCRATCH              @02A*/ 10895900
*      3 LVOCEFLG BIT(1),      /* VOLUME RECORDED BY O/C/EOV     @02A*/ 10896800
*    2 LVFLGAX  BIT(8),        /* FLAGS 'A' - STATUS EXTENSION   @02A*/ 10897700
*      3 LVGVCFLG BIT(1),      /* SCRATCH VOL CLAIMED VIA GETVOL @02A*/ 10898600
*      3 LVXINFLG BIT(1),      /* SCRATCH VOL NEVER INITIALIZED  @02A*/ 10899500
*      3 LVINIFLG BIT(1),      /* SCRATCH VOL W/INIT ACTION PEND @02A*/ 10900400
*      3 LVENTFLG BIT(1),      /* SCRATCH VOL WAIT TO ENTER ATL  @02A*/ 10901300
*      3 LVFABEND BIT(1),      /* ABEND IN PROCESS WHEN DS CLOSED@02A*/ 10902200
*      3 LVFOCEAB BIT(1),      /* ABEND PROBABLY IN O/C/EOV      @02A*/ 10903100
*    2 LVFLAGB   BIT(8),       /* FLAGS ARE 0 OR 1               @02A*/ 10904000
*      3 LVDEFRET BIT(1),      /* DEF. RETEN. PERIOD USED        @02A*/ 10904900
*      3 *        BIT(1),      /*                                @02A*/ 10905800
*      3 LVNLTAPE BIT(1),      /* LABEL TYPE IS NL               @02A*/ 10906700
*      3 LVALTAPE BIT(1),      /* LABEL TYPE IS AL               @02A*/ 10907600
*      3 LVSLTAPE BIT(1),      /* LABEL TYPE IS SL               @02A*/ 10908500
*      3 *        BIT(1),      /*                                @02A*/ 10909400
*      3 LVBLTAPE BIT(1),      /* TAPE LAST WRITTEN USING BLP    @02A*/ 10910300
*      3 LVULTAPE BIT(1),      /* SL OR AL W/USER LABELS         @02A*/ 10911200
*    2 LVFLAGC  BIT(8),        /* FLAGS 'C' - RELEASE ACTIONS    @02A*/ 10912100
*      3 LVRETSCR BIT(1),      /* RETRN TO SCRTCH POOL - DEFLT   @02A*/ 10913000
*      3 LVREPREL BIT(1),      /* REPLACE TAPE ON RELEASE        @02A*/ 10913900
*      3 LVREINIT BIT(1),      /* REINITIALISE                   @02A*/ 10914800
*      3 LVDEGAUS BIT(1),      /* DEGAUS/SECURITY ERASE          @02A*/ 10915700
*      3 LVROWNER BIT(1),      /* RETURN TO OWNER                @02A*/ 10916600
*      3 LVNOWNER BIT(1),      /* NOTIFY OWNER                   @02A*/ 10917500
*    2 LVFLAGD   BIT(8),       /* FLAGS 'D' - ACCESS             @02A*/ 10918400
*      3 LVOREAD  BIT(1),      /* OWNER MAY READ VOLUME          @02A*/ 10919300
*      3 LVOUPD   BIT(1),      /* OWNER MAY UPDATE VOLUME        @02A*/ 10920200
*      3 LVOALT   BIT(1),      /* OWNER MAY ALTER VOLUME         @02A*/ 10921100
*      3 LVPROTR  BIT(1),      /* READ-ONLY PROTECTION           @02A*/ 10922000
*      3 LVPROTU  BIT(1),      /* UPDATE PROTECTION              @02A*/ 10922900
*      3 LVMVSUSE BIT(1),      /* MAY BE USED ON MVS SYSTEMS     @02A*/ 10923800
*      3 LVVMUSE  BIT(1),      /* MAY BE USED ON VM SYSTEMS      @02A*/ 10924700
*      3 LVNODSNR BIT(1),      /* NO DATA SET RECORDING          @08A*/ 10925090
*    2 LVMEDIA  CHAR(8),       /* MEDIA NAME                     @02A*/ 10925600
*    2 LVUNITAD CHAR(4),       /* UNIT ADDRESS USED              @02A*/ 10926500
*    2 LVLSTUAD CHAR(4),       /* LAST UNIT ADDRESS USED         @02A*/ 10927400
*    2 LVLONLOC CHAR(8),       /* LOAN LOCATION                  @02A*/ 10928300
*    2 LVLRDDAT CHAR(4),       /* DATE VOLUME LAST READ (YYYYDDD)@02A*/ 10929200
*    2 LVLWTDAT CHAR(4),       /* DATE VOLUME LAST WRIT (YYYYDDD)@02A*/ 10930100
*    2 LVASDATE CHAR(4),       /* ASSIGN FROM SCR DATE (YYYYDDD) @02A*/ 10931000
*    2 LVASTIME CHAR(4),       /* ASSIGN FROM SCR TIME (HHMMSST) @02A*/ 10931900
*    2 LVLTYP   BIT(8),        /* COPY OF JFCBLTYP               @02A*/ 10932800
*    2 LVTRTCH  BIT(8),        /* FROM JFCTRTCH - IDRC SUPPORT   @02A*/ 10933700
*      3 *        BIT(4),      /*                                @02A*/ 10934600
*      3 LVTCOMP  BIT(1),      /* DSN USED 3480 IDRC             @02A*/ 10935500
*      3 LVTNCOMP BIT(1),      /* NO COMPACTION                  @02A*/ 10936400
*    2 LRESRVB  CHAR(1),       /* RESERVED                       @02A*/ 10937300
*    2 LVLOCNAM CHAR(8),       /* CURRENT LOCATION OF VOLUME     @02A*/ 10938200
*    2 LVDEST   CHAR(8),       /* DESTINATION NAME               @02A*/ 10939100
*    2 LVHLOC   CHAR(8),       /* HOME LOCATION NAME             @02A*/ 10940000
*    2 LVSGNAME CHAR(8),       /* STORAGE GROUP NAME             @02A*/ 10940900
*    2 LACCINF  CHAR(40),      /* ACCOUNTING INFORMATION         @02A*/ 10941800
*    2 LDESC    CHAR(30),      /* USER DESCRIPTION               @02A*/ 10942700
*    2 LAUTHIDS CHAR(96),      /* AUTHORISED USER IDS            @02A*/ 10943600
*      3 LAUTHID1 CHAR(8),     /*  1ST USERID SLOT               @02A*/ 10944500
*      3 LAUTHID2 CHAR(8),     /*  2ND USERID SLOT               @02A*/ 10945400
*      3 LAUTHID3 CHAR(8),     /*  3RD USERID SLOT               @02A*/ 10946300
*      3 LAUTHID4 CHAR(8),     /*  4TH USERID SLOT               @02A*/ 10947200
*      3 LAUTHID5 CHAR(8),     /*  5TH USERID SLOT               @02A*/ 10948100
*      3 LAUTHID6 CHAR(8),     /*  6TH USERID SLOT               @02A*/ 10949000
*      3 LAUTHID7 CHAR(8),     /*  7TH USERID SLOT               @02A*/ 10949900
*      3 LAUTHID8 CHAR(8),     /*  8TH USERID SLOT               @02A*/ 10950800
*      3 LAUTHID9 CHAR(8),     /*  9TH USERID SLOT               @02A*/ 10951700
*      3 LAUTHIDA CHAR(8),     /* 10TH USERID SLOT               @02A*/ 10952600
*      3 LAUTHIDB CHAR(8),     /* 11TH USERID SLOT               @02A*/ 10953500
*      3 LAUTHIDC CHAR(8),     /* 12TH USERID SLOT               @02A*/ 10954400
*    2 LRACKNO  CHAR(6),       /* RACK NUMBER                    @02A*/ 10955300
*    2 LRSBIN   CHAR(6),       /* REMOTE STORE BIN NUMBER        @02A*/ 10956200
*    2 LRSDATE  CHAR(4),       /* REMOTE STORE DATE (YYYYDDD)    @02A*/ 10957100
*    2 LRBINMDN CHAR(8),       /* BIN MEDIA NAME                 @02A*/ 10958000
*    2 LLABNO1  FIXED(15),     /* LABEL NUMBER OF FIRST FILE     @02A*/ 10958900
*    2 LDS1NAM  CHAR(44),      /* NAME OF 1ST DATASET ON VOLUME  @02A*/ 10959800
*    2 LDS1OWNR CHAR(8),       /* DATASET OWNER                  @02A*/ 10960700
*    2 LDS1SEQ  FIXED(15),     /* SEQ NO OF DATA SET ONE         @02A*/ 10961600
*    2 LDS1RECF CHAR(4),       /* FIRST DATA SET'S RECFM         @02A*/ 10962500
*    2 *        CHAR(2),       /* ALIGNMENT                      @02A*/ 10963400
*    2 LDS1LREC FIXED(31),     /* FIRST DATA SET'S LRECL         @02A*/ 10964300
*    2 LDS1BSIZ FIXED(31),     /* FIRST DATA SET'S BLKSZ         @02A*/ 10965200
*    2 LDS1BLKS FIXED(31),     /* FIRST DATA SET'S BLK COUNT     @02A*/ 10966100
*    2 LDS1KBYT FIXED(31),     /* FIRST DATA SET'S K-BYTES       @02A*/ 10967000
*    2 LDS1SCLV FIXED(15),     /* FIRST DATA SET SECURITY LEVEL  @02A*/ 10967900
*    2 LDCRDATE CHAR(4),       /* DSN1 CREATE DATE YYYYDDD       @02A*/ 10968800
*    2 LDCRTIME CHAR(4),       /* DSN1 CREATE TIME    - HHMMSST  @02A*/ 10969700
*    2 LDLRDATE CHAR(4),       /* DSN1 DATE LAST READ - YYYYDDD  @02A*/ 10970600
*    2 LDLWDATE CHAR(4),       /* DSN1 DATE LAST WRIT - YYYYDDD  @02A*/ 10971500
*    2 LDS1FLAG BIT(8),        /* DSN1 FLAG BYTE                 @02A*/ 10972400
*      3 LDS1FCAT BIT(1),      /* DATA SET IS CATALOGED          @02A*/ 10973300
*      3 *        BIT(3),      /* RESERVED                       @02A*/ 10974200
*      3 LDS1FABD BIT(1),      /* ABEND IN PROCESS WHEN DS CLOS  @02A*/ 10975100
*    2 LDVRSVAL CHAR(8),       /* VRS MANAGEMENT VALUE           @02A*/ 10976000
*    2 LDSMSMC  CHAR(8),       /* SMS MANAGEMENT CLASS           @06A*/ 10976400
*    2 LDS1STEP CHAR(8),       /* DSN1 Creating step name        @02A*/ 10976900
*    2 LDS1DDNM CHAR(8),       /* DSN1 Creating DD   name        @02A*/ 10977800
*    2 LDRETDTE CHAR(4),       /* DATA SET RETENTION DATE        @02A*/ 10978700
*    2 LDSXNAME CHAR(44),      /* NAME OF LAST DATASET ON VOL    @02A*/ 10979600
*                              /* RESERVED  (OF)                 @02A*/ 10980500
*    2 LVCRSID  CHAR(8),       /* CREATING SYSTEM ID             @02A*/ 10981400
*    2 LDS1CPGM CHAR(8),       /* Create program name            @07A*/ 10981500
*    2 LDS1LPGM CHAR(8),       /* Last used program name         @07A*/ 10981600
*    2 LDS1LJOB CHAR(8),       /* Last used job name             @07A*/ 10981700
*    2 LDS1LSTP CHAR(8),       /* Last used step name            @07A*/ 10981800
*    2 LDS1LDD  CHAR(8),       /* Last used DD name              @07A*/ 10981900
*    2 *        BIT(8),        /* RESERVED                       @02A*/ 10982300
*    2 *(8)     FIXED(31),     /* RESERVED                       @07C*/ 10983200
*    2 CLRECEND  BDY(WORD) CHAR(0);  /* END OF CNVLREC           @02A*/ 10984100
*DCL                                /*                           @02A*/ 10985000
*   LVM256TR FIXED(8) CONSTANT(4),  /*         X'04' - 256 TRACK @09A*/ 10985090
*   LVM128TR FIXED(8) CONSTANT(3),  /*         X'03' - 128 TRACK @09A*/ 10985180
*   LVM36TRK FIXED(8) CONSTANT(2),  /*         X'02' - 36 TRACK  @02A*/ 10985270
*   LVM18TRK FIXED(8) CONSTANT(1),  /*         X'01' - 18 TRACK  @02A*/ 10985360
*   LVMEHPCT FIXED(8) CONSTANT(4),  /* X'04' - EHPCT 3590 EXT CAP@06A*/ 10985450
*   LVMHPCT  FIXED(8) CONSTANT(3),  /* X'03' - HPCT  3590 STD CAP@06A*/ 10985540
*   LVMENHCP FIXED(8) CONSTANT(2),  /* X'02' - ENHANCED CAPACITY @02A*/ 10985630
*   LVMSTDCP FIXED(8) CONSTANT(1),  /* X'01' - STANDARD CAPACITY @02A*/ 10985720
*   LVTYPE   CHAR(1) CONSTANT('L'), /*                           @02A*/ 10985900
*                                   /* 'L' - LIBRARY RECORD TYPE @02A*/ 10986800
*   BPI1600  CHAR(1) CONSTANT('3'), /*                           @02A*/ 10987700
*                                   /* '3' - 1600BPI             @02A*/ 10988600
*   BPI6250  CHAR(1) CONSTANT('4'), /*                           @02A*/ 10989500
*                                   /* '4' - 6250BPI             @02A*/ 10990400
*   BPI3480  CHAR(1) CONSTANT('9'), /*                           @02A*/ 10991300
*                                   /* '9' - 3480                @02A*/ 10992200
*   BPI348C  CHAR(1) CONSTANT('C'), /*                           @02A*/ 10993100
*                                   /* 'C' - 3480 COMPACT (IDRC) @02A*/ 10994000
*   BPIUNDEF CHAR(1) CONSTANT('*'); /*                           @02A*/ 10994900
*                                   /* '*' - UNDEFINED           @02A*/ 10995800
*                                   /*                           @02A*/ 10996700
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   11000000
