* %GOTO EDGCEREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGCEREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                             **      *************         00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM CONVERSION EMPTY SHELF RECORD MAPPING                   ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
** DFSMS/MVS 1.3.0 DFSMSrmm                                           * 00650000
**                                                                    * 00700000
**PROPRIETARY V3 STATEMENT                                            * 00742800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00785600
**"RESTRICTED MATERIALS OF IBM"                                       * 00828400
**5695-DF1                                                            * 00871200
**(C) COPYRIGHT 1994,1995  IBM CORP.                                  * 00914000
**END PROPRIETARY V3 STATEMENT                                        * 00956800
*********************************************************************** 01000000
***                                                                  ** 01050000
***                                                                  ** 01100000
***                                                                  ** 01150000
*** FUNCTION : EDGCEREC MAPS THE CONVERSION EMPTY SHELF RECORD       ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON RMMEREC                          ** 01450000
***                                                                  ** 01500000
***         LA     Rx,ERECAREA                                       ** 01550000
***         USING  RMMEREC,Rx                                        ** 01600000
***         MVI    ESRID,C'E'            Set E record type           ** 01650000
***                                                                  ** 01700000
***            PLX       - %INCLUDE EDGCEREC                     @02A** 01716600
***                                                              @02A** 01733200
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01750000
***            PLX       - SPECIFY &IHALIST='YES' BEFORE         @02A** 01766600
***                        INCLUDE                               @02A** 01783200
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
**$00=OW0xxxx,110,940920,MWW: Create Macro                           ** 01900000
**$01=OW11151,110,940921,MWW: Implement Macro                    @01A** 01950000
**$02=OW12935,120,951004,GD:  Add supporting PLX/370             @02A** 01966600
***                                                                  ** 01983200
***                                                                  ** 02000000
*********************************************************************** 02050000
         SPACE 1                                                        02100000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02150000
         AGO   .GENSTRT                                                 02200000
.GENDSCT ANOP                                                           02250000
RMMEREC  DSECT                                                          02300000
.GENSTRT ANOP                                                           02350000
*                                                                       02400000
* START OF RMMEREC                                                      02450000
*                                                                       02500000
EREC     DS    0D                       BOUNDARY ALIGN                  02550000
ERECRDW  DS    0XL4                     RESERVED FOR RDW           @01C 02600000
         DC    AL2(ERECLEN)             RDW Record Length          @01A 02650000
         DC    AL2(0)                   Zero                       @01A 02700000
ESRID    DC    CL1'E'         REQ       EMPTY RACK/BIN RECORD ID        02750000
ESRTYPE  EQU   C'E'                     RECORD TYPE                @01A 02800000
ESTYPE   DC    CL1' '         REQ       SHELF TYPE                      02850000
ERSHELF  EQU   C'R'                     SHELF IS RACK IN LIBRARY        02900000
EBSHELF  EQU   C'B'                     SHELF IS BIN IN STORE           02950000
ESLOCNAM DC    CL8' '         REQ       NAME OF ASSOCIATED LIBRARY      03000000
ESSTART  DC    CL6' '         REQ       FIRST OF EMPTY SHELVES          03050000
ESCOUNT  DC    CL6' '         REQ       N-1 OF CONTIGUOUS SHELVES  @02C 03100000
EVMEDIA  DC    CL8' '         REQ       Media name                 @01C 03150000
         DS    XL2'0'                   RESERVED                   @02C 03200000
         DS    8F'0'                    RESERVED                   @01C 03250000
ERECLEN  EQU   *-EREC                                              @01C 03300000
*                                                                       03350000
* END OF RMM RMMEREC                                                    03400000
*                                                                       03450000
         POP   PRINT                                                    03500000
         MEND  , */                                                     03550000
*%EDGCEREC1:;                                                           03600000
*%IHALPUSH = '@LISTPUSH';                                               03650000
*%IHALOFF  = '@LISTOFF';                                                03700000
*%IHALPOP  = '@LISTPOP';                                                03750000
*IHALPUSH;                                                              03800000
*%IF IHALIST='YES' %THEN                                                03850000
* %GOTO EDGCEREC42;                                                     03900000
*IHALOFF;                                                               03950000
*%EDGCEREC42:; /* P L S M A P P I N G S T A R T */                      04000000
*DCL                                                                    04050000
*  1 CEREC    BASED,                /* 0                             */ 04057500
*    2 EREC     BDY(WORD) CHAR(0),  /* BOUNDARY ALIGN            @02A*/ 04065000
*    2 ERECRDW  FIXED(31),          /* RESERVED FOR RDW          @02A*/ 04072500
*    2 ESRID    CHAR(1),            /* EMPTY RACK RECORD ID      @02A*/ 04080000
*    2 ESTYPE   CHAR(1),            /* SHELF TYPE                @02A*/ 04087500
*    2 ESLOCNAM CHAR(8),            /* NAME OF ASSOCIATED LIBRY  @02A*/ 04095000
*    2 ESSTART  CHAR(6),            /* FIRST OF EMPTY SHELVES    @02A*/ 04102500
*    2 ESCOUNT  CHAR(6),            /* N-1 OF CONTIGUOUS SHELVES @02A*/ 04110000
*    2 EVMEDIA  CHAR(8),            /* MEDIA NAME                @02A*/ 04117500
*    2 *        FIXED(15),          /* RESERVED                  @02A*/ 04125000
*    2 *(8)     FIXED(31),          /* RESERVED                  @02A*/ 04132500
*    2 CNVEEND  BDY(WORD) CHAR(0);  /* END OF CNVEREC            @02A*/ 04140000
*DCL                                /*                           @02A*/ 04147500
*   ESRTYPE  CHAR(1) CONSTANT('E'), /*                           @02A*/ 04155000
*                                   /* 'E' - EMPTY RACK RECORD   @02A*/ 04162500
*   ERSHELF  CHAR(1) CONSTANT('R'), /*                           @02A*/ 04170000
*                                   /* 'R' - RACK TYPE SHELF     @02A*/ 04177500
*   EBSHELF  CHAR(1) CONSTANT('B'); /*                           @02A*/ 04185000
*                                   /*                           @02A*/ 04192500
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   04200000
