* %GOTO EDGSVREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGSVREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                            **                             00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM SMF RECORD VOLUME INFORMATION                           ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
*** OS/390 DFSMSrmm V2R10                                            ** 00650000
***                                                                  ** 01050000
***PROPRIETARY V3 STATEMENT                                          ** 01056200
***LICENSED MATERIALS - PROPERTY OF IBM                              ** 01062400
***"RESTRICTED MATERIALS OF IBM"                                     ** 01068600
***5647-A01                                                          ** 01074800
***(C) COPYRIGHT 1993,2001  IBM CORP.                                ** 01081000
***END PROPRIETARY V3 STATEMENT                                      ** 01087200
*********************************************************************** 01094000
***                                                                  ** 01100000
*** FUNCTION : EDGSVREC MAPS THE SMF RECORD VOLUME INFORMATION       ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON MVREC                            ** 01450000
***                                                                  ** 01500000
***         LA     RX,SMFADREC                                       ** 01550000
***         USING  MVREC,RX                                          ** 01600000
***         CLI    MVTYPE,MVTYPEID       VOLUME   INFORMATION?       ** 01650000
***                                                                  ** 01700000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01750000
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
***    02/JUL/91 001/       CREATE MACRO                       MWW @001 01900000
***    15/JUL/91 002/NEW FN.  DEFINE FIELD FOR UCB TYPE INFO.  MJA @002 01950000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 02000000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @003 ** 02050000
*** DCR011 ,MC,130892, NEW FIELDS FOR FLAGSTAFF SUPPORT         @004 ** 02100000
*** 268119 ,MA,060193, REDEFINE MVTPVOL  FIELD AS MVOPVOL       @005 ** 02150000
*** $S1=SPESLOC,110,040795,ADM: NEW FIELDS FOR GT 3 STORES SPE  @S1A ** 02175000
*** $06=OW03047,110,160594,MRC: NEW FIELD LAST USED DEVICE      @06A ** 02187500
*** $S2=OW08149,110,041594,ADM: SUPPORT FOR VRS BY JOBNAME SPE  @S2A ** 02193700
*** $S4=BLYTHE ,120,020595,GEM: BLYTHE SPE                      @S4A ** 02195200
*** $07=OW15547,120,950713,WK : Add support for sample reports  @07A ** 02196800
*** $K1=K140934,140,970408,BDG: Corrected mispelled LIBRARY     @K1A ** 02198400
*** $S6=OW29497,110,970924,WK : Toleration for VRS Enhancements @S6A ** 02199200
*** $S7=OW30969,140,971217,AE : VRS Enhancements                @S7A ** 02199600
*** $S8=OW36349,140,980714,AH : VTS Import/Export               @S8A ** 02199700
*** $LB=RMM150 ,150,980313,BDG: ANSI version 4 labels support   @LBA ** 02199800
*** $LC=RMM150 ,150,980205,AH : Catalog Synchronization         @LCA ** 02199900
*** $K2=KIX0074,140,990224,AH : EDG8183 multi-host w/o GRS      @K2A ** 02209900
*** $LF=RMM210 ,210,990419,CHK: VOLSET SUPPORT                  @LFA ** 02215900
*** $LG=RMM210 ,210,990419,CHK: VTS ENHANCEMENT SUPPORT         @LGA ** 02221900
*** $S9=BLYTHE2,210,990818,CHK: Blythe 2 support                @S9A ** 02227900
*** $K3=K160369,210,990825,CHK: Correct allignment problem      @K3A ** 02233900
*** $08=OW46475,210,001009,BG : Remove duplicate entries        @08A ** 02236890
*** $09=OW47947,140,010129,CHK: Toleration Minimal BIN Assignm. @09A ** 02237880
*** $SC=OW49863,210,010529,AP : Minimal Bin Assignment          @SCA ** 02238870
***                                                                  ** 02239900
*********************************************************************** 02250000
         SPACE 1                                                        02300000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02350000
         AGO   .GENSTRT                                                 02400000
.GENDSCT ANOP                                                           02450000
MVREC    DSECT                                                          02500000
.GENSTRT ANOP                                                           02550000
*                                                                       02600000
* START OF RMM MVREC                                                    02650000
*                                                                       02700000
MVRECORD DS    0F                  ** EDGSVREC INFORMATION           ** 02750000
*                                                                       02800000
*                                                                       02850000
*                                                                       02900000
MVKEY    DS    0CL56               **                                ** 02950000
MVTYPE   DC    CL1'V'              ** 'V' - VOLUME INFO TYPE         ** 03000000
MVTYPEID EQU   C'V'                ** VOLUME INFO   ID SYMBOL        ** 03050000
         DC    XL1'00'             ** RESERVED                       ** 03100000
MVVOLSER DS    CL6                 ** VOLUME SERIAL NUMBER           ** 03150000
MVPAD1   DC    XL48'00'            ** RESERVED - BINARY ZEROS        ** 03200000
*                                                                       03250000
* CONTROL INFORMATION                                                   03300000
*                                                                       03350000
MVRECLN  DS    H                   ** RECORD LENGTH                  ** 03400000
         DS    H                   ** RESERVED                       ** 03450000
MVCRDATE DS    PL4                 ** VOL  CREATE DATE - YYYYDDD     ** 03500000
MVCRTIME DS    PL4                 ** VOL  CREATE TIME - HHMMSST     ** 03550000
MVCRSID  DS    CL8                 ** CREATE SYSTEM ID               ** 03600000
MVRCCDS  DS    CL8                 ** RECORD CREATE CDS ID         @004 03650000
*                                  **                                ** 03700000
MVLCDATE DS    PL4                 ** LAST CHANGE DATE  - YYYYDDD    ** 03750000
MVLCTIME DS    PL4                 ** LAST CHANGE TIME -  HHMMSST    ** 03800000
MVLCUID  DS    CL8                 ** LAST CHANGE USER ID            ** 03850000
MVLCSID  DS    CL8                 ** LAST CHANGE SYSTEM ID          ** 03900000
MVUCDATE DS    PL4                 ** LAST "USER" CHANGE DATE        ** 03950000
MVUCTIME DS    PL4                 ** LAST "USER" CHANGE TIME        ** 04000000
*                                                                       04050000
* FLAG BYTES                                                            04100000
*                                                                       04150000
MVCFLG   DS    XL1                 ** CONTROL FLAGS 1                ** 04200000
MVDELFLG EQU   X'80'               ** RECORD DELETED                 ** 04250000
MVSELFLG EQU   X'10'               ** SELECT - PROC BY SATELLITE UPDT** 04300000
MVDUMMY  EQU   X'08'               ** DUMMY RECORD - ALLOW TSO ADD   ** 04350000
MVRECLEV DS    XL1                 ** RECORD LEVEL NUMBER          @004 04400000
         DS    XL6                 ** RESERVED                     @004 04450000
*                                  **                                ** 04500000
* VOLUME INFORMATION                                                    04550000
*                                                                       04600000
MVEXPDTO DS    PL4                 ** EXPIRATION  DATE  - ORIGINAL   ** 04650000
*                                  **                                ** 04700000
MVEXPDT  DS    PL4                 ** EXPIRATION  DATE  - YYYYDDD    ** 04750000
*                                  **                                ** 04800000
MVRDEN   DS    XL1                 ** COPY OF JFCBDEN                ** 04850000
MVDEN    DS    CL1                 ** RECORDING DENSITY:             ** 04900000
MVDEN3   EQU   C'3'                ** '3' - 1600BPI                  ** 04950000
MVDEN4   EQU   C'4'                ** '4' - 6250BPI                  ** 05000000
MVDEN9   EQU   C'9'                ** '9' - 3480                     ** 05050000
MVDENC   EQU   C'C'                ** 'C' - 3480 COMPACTED (IDRC)    ** 05100000
MVDENU   EQU   C'*'                ** '*' - UNDEFINED                ** 05150000
*                                  **                                ** 05200000
MVDSNNO  DS    H                   ** NUMBER OF DATASETS ON VOLUME   ** 05250000
MVTUSE   DS    F                   ** TAPE USAGE IN KBYTES           ** 05300000
MVUSE    DS    H                   ** VOLUME USE COUNT               ** 05350000
*                                  **                                ** 05400000
MVSTSTAT DS    XL1                 ** STORE STATUS:                  ** 05450000
MVSTS001 EQU   X'01'               ** 1 - TAPE LIB TO REMOTE  STORE  ** 05500000
MVSTS002 EQU   X'02'               ** 2 - REMOTE  STORE TO TAPE LIB  ** 05550000
MVSTS003 EQU   X'03'               ** 3 - TAPE LIB TO LOCAL   STORE  ** 05600000
MVSTS004 EQU   X'04'               ** 4 - LOCAL   STORE TO TAPE LIB  ** 05650000
MVSTS005 EQU   X'05'               ** 5 - LOCAL   STORE TO DISTANT   ** 05700000
MVSTS006 EQU   X'06'               ** 6 - TAPE LIB TO DISTANT STORE  ** 05750000
MVSTS007 EQU   X'07'               ** 7 - DISTANT STORE TO TAPE LIB  ** 05800000
MVSTS009 EQU   X'09'               ** 9 - STORE LOCATION VALID       ** 05850000
*                                  **                                ** 05900000
MVVRSREL DS    XL1                 ** VRS RELEASE OPTIONS          @S7C 05920000
MVVRFXDI EQU   X'80'               ** EXPIRY DATE IGNORE           @S7A 05940000
MVVRFSCI EQU   X'40'               ** SCRATCH IMMEDIATE            @S7A 05960000
*   FLAG BITS IN MVVRSREL SHOULD MATCH MKRLSOPT BIT SETTINGS.      @S7A 05980000
MVLABNO1 DS    H                   ** LABEL NUMBER OF 1ST FILE       ** 06000000
MVTDSI   DS    0XL4                ** TAPE MEDIA TYPE INFORMATION  @004 06050000
MVMEDREC DS    XL1                 ** VOL RECORDING FORMAT. ONE OF:@S4C 06091600
*                                  ** X'00' - NON CARTRIDGE        @S9C 06133200
*                                  ** X'01' - 18TRACK              @S4C 06174800
*                                  ** X'02' - 36TRACK              @S4C 06216400
*                                  ** X'03' - 128TRACK             @S4A 06258000
*                                  ** X'04' - 256TRACK             @S9A 06279000
MVMEDTY  DS    XL1                 ** TAPE MEDIA TYPE. ONE OF:     @004 06300000
*                                  ** X'00' - NON CARTRIDGE        @S9C 06336300
*                                  ** X'01' - CST                  @S4C 06372600
*                                  ** X'02' - ECCST                @S4C 06408900
*                                  ** X'03' - HPCT                 @S4A 06445200
*                                  ** X'04' - EHPCT                @S4A 06517800
MVMEDCMP DS    XL1                 ** TAPE COMPACTION. ONE OF:     @S4C 06554100
*                                  ** X'00' - UNKNOWN              @S4C 06590400
*                                  ** X'01' - NOT COMPACTED        @S4C 06626700
*                                  ** X'02' - COMPACTED.           @S4C 06663000
MVMEDATR DS    XL1                 ** TAPE SPECIAL ATTRIBUTES. ONE OF:  06708600
*                                  **  X'00' - NONE                     06754200
*                                  **  X'01' - 18 TRACK READ ONLY  @004 06800000
*                                  **                                ** 06850000
MVSTORID DS    CL1                 ** STORE LOCATION ID:             ** 06900000
MVSTIDD  EQU   C'D'                ** D - DISTANT STORE              ** 06950000
MVSTIDL  EQU   C'L'                ** L - LOCAL STORE                ** 07000000
MVSTIDR  EQU   C'R'                ** R - REMOTE STORE               ** 07050000
MVSTIDT  EQU   C'T'                ** T - TAPE LIBRARY               ** 07100000
MVNSTRID DS    CL1                 ** NEW STORE LOCATION             ** 07150000
*                                  **                                ** 07200000
MVNLOC   DS    CL8                 ** DESIRED LOCATION NAME        @004 07250000
*                                  **                                ** 07300000
MVSTBIN  DS    F                   ** STORE BIN NUMBER               ** 07350000
MVOBIN   DS    F                   ** OLD BIN NUMBER                 ** 07400000
MVSTDATE DS    PL4                 ** DATE STORED (YYYYDDD)          ** 07450000
MVLUDEV  DS    CL4                 ** LAST USED DEVICE             @06C 07500000
MVLONLOC DS    CL8                 ** LOAN LOCATION                  ** 07550000
MVOLNLOC DS    CL8                 ** OLD LOAN LOCATION              ** 07600000
*                                  **                                ** 07650000
MVLRDDAT DS    PL4                 ** DATE VOLUME LAST READ (YYYYDDD)** 07700000
MVLWTDAT DS    PL4                 ** DATE VOLUME LAST WRITTEN       ** 07750000
MVASDATM DS    CL8                 ** ASSIGNED DATE AND TIME         ** 07800000
MVASDATE EQU   MVASDATM,4          ** ASSIGNED DATE  (YYYYDDD)       ** 07850000
MVASTIME EQU   MVASDATM+4,4        ** ASSIGNED TIME  (HHMMSST)       ** 07900000
*                                                                       07950000
MVOWNID  DS    CL8                 ** VOLUME OWNER USERID            ** 08000000
MVCRUID  DS    CL8                 ** CREATING USERID                ** 08050000
MVCRJOB  DS    CL8                 ** CREATING JOBNAME               ** 08100000
MVSECLEV DS    XL1                 ** SECURITY CLASSIFICATION LEVEL  ** 08150000
*                                  **                                ** 08200000
MVFLGAX  DS    XL1                 ** FLAGS 'A' - STATUS EXTENSION   ** 08250000
*                                  **                                ** 08275000
MVGVCFLG EQU   X'80'               ** SCRATCH VOL CLAIMED VIA GETVOL ** 08300000
*                                  **                                ** 08325000
MVXINFLG EQU   X'40'               ** SCRATCH VOLUME HAS NEVER     @004 08350000
*                                  ** BEEN INITIALISED             @004 08400000
MVINIFLG EQU   X'20'               ** SCRATCH VOLUME WITH INIT     @004 08450000
*                                  ** ACTION PENDING               @004 08500000
MVENTFLG EQU   X'10'               ** SCRATCH VOLUME WAITING TO    @004 08550000
*                                  ** ENTER ATL                    @004 08600000
MVFABEND EQU   X'08'               ** ABEND IN PROCESS WHEN A DATA @004 08650000
*                                  ** SET CLOSED                   @004 08700000
MVFOCEAB EQU   X'04'               ** ABEND PROBABLY IN O/C/EOV    @004 08750000
*                                  **                              @S6A 08766600
MVATIFLG EQU   X'02'               ** INIT REQUESTED FOR ATL VOL   @S6A 08783200
*                                  **                                ** 08800000
MVFORCE  EQU   X'01'               ** FORCE SUPPLIED               @S6A 08816600
*                                  **                              @S6A 08833200
MVVOLSEQ DS    H                   ** VOLUME SEQUENCE NUMBER         ** 08850000
*                                  **                                ** 08900000
* VOLUME FLAGS                                                          08950000
*                                                                       09000000
MVFLGA   DS    XL1                 ** FLAGS 'A' - STATUS             ** 09050000
MVMSTFLG EQU   X'80'               ** VOLUME IS MASTER               ** 09150000
MVRLSFLG EQU   X'40'               ** VOLUME PENDING RELEASE         ** 09200000
MVVRFLG  EQU   X'20'               ** VITAL RECORD - DO NOT RELEASE  ** 09250000
MVASSFLG EQU   X'10'               ** USER TAPE (ASSIGNED BY LIB)    ** 09300000
MVLONFLG EQU   X'08'               ** TAPE IS ON LOAN                ** 09350000
MVOPNFLG EQU   X'04'               ** TAPE OPENED AND NOT YET CLOSED ** 09400000
MVSCRFLG EQU   X'02'               ** VOLUME IS SCRATCH              ** 09450000
MVOCEFLG EQU   X'01'               ** VOLUME RECORDED BY O/C/EOV     ** 09500000
MVEXRFLG EQU   MVOCEFLG            ** STV RECORDED BY EXPORT       @LGA 09525000
*                                                                       09550000
MVFLGB   DS    XL1                 ** FLAGS 'B'                      ** 09600000
MVDEFRET EQU   X'80'               ** DEFAULT RETENTION PERIOD USED  ** 09650000
MVPPTAPE EQU   X'40'               ** PROGRAM PRODUCT TAPE           ** 09700000
MVNLTAPE EQU   X'20'               ** LABEL TYPE IS NL               ** 09750000
MVALTAPE EQU   X'10'               ** LABEL TYPE IS AL               ** 09800000
MVSLTAPE EQU   X'08'               ** LABEL TYPE IS SL               ** 09850000
MVBLTAPE EQU   X'02'               ** TAPE LAST WRITTEN USING BLP    ** 09900000
MVULTAPE EQU   X'01'               ** SL OR AL TAPE HAS USER LABELS  ** 09950000
*                                                                       10000000
MVFLGC   DS    XL1                 ** FLAGS 'C' - RELEASE ACTIONS    ** 10050000
MVRETSCR EQU   X'80'               ** RETURN TO SCRATCH POOL -DEFAULT** 10100000
MVRELACT EQU   255-X'80'           ** RELEASE ACTIONS              @S6A 10125000
MVREPREL EQU   X'40'               ** REPLACE TAPE ON RELEASE        ** 10150000
MVREINIT EQU   X'20'               ** REINITIALISE                   ** 10200000
MVDEGAUS EQU   X'10'               ** DEGAUS/SECURITY ERASE          ** 10250000
MVROWNER EQU   X'08'               ** RETURN TO OWNER                ** 10300000
MVNOWNER EQU   X'04'               ** NOTIFY OWNER                   ** 10350000
*                                                                       10400000
MVFLGD   DS    XL1                 ** FLAGS 'D' - ACCESS             ** 10450000
MVOREAD  EQU   X'80'               ** OWNER MAY READ VOLUME          ** 10500000
MVOUPD   EQU   X'40'               ** OWNER MAY UPDATE VOLUME        ** 10550000
MVOALT   EQU   X'20'               ** OWNER MAY ALTER VOLUME         ** 10600000
MVPROTR  EQU   X'10'               ** READ-ONLY PROTECTION           ** 10650000
MVPROTU  EQU   X'08'               ** UPDATE PROTECTION              ** 10700000
MVMVSUSE EQU   X'04'               ** MAY BE USED ON MVS SYSTEMS     ** 10750000
MVVMUSE  EQU   X'02'               ** MAY BE USED ON VM SYSTEMS      ** 10800000
MVNODSNR EQU   X'01'               ** ONLY 1ST TAPE DS RECORDED    @S4A 10825000
*                                                                       10850000
MVFLGE   DS    XL1                 ** FLAGS 'E' - ACTIONS PENDING    ** 10900000
*                                  ** VALUES FOR THIS FLAG ARE       ** 10950000
*                                  ** IDENTICAL TO THOSE FOR MVFLGC, ** 11000000
*                                  ** THE RELEASE ACTIONS FLAG       ** 11050000
*                                                                       11100000
MVLTYP   DS    X                   ** COPY OF JFCBLTYP               ** 11150000
MVALVERS DS    XL2                 ** ANSI LABEL VERSIONS IN BINARY@LBC 11200000
MVALCUR  EQU   MVALVERS,1          ** CURRENT  LABEL VERSION       @LBC 11250000
MVALREQ  EQU   MVALVERS+1,1        ** REQUIRED LABEL VERSION       @LBC 11300000
MVMEDIA  DS    CL8                 ** INSTALLATIONS MEDIA NAME     @004 11350000
MVUNIT   EQU   MVMEDIA,8           ** UNIT TYPE                    @004 11400000
MVRACK   DS    CL6                 ** RACK NUMBER                    ** 11450000
MVPVOL   DS    CL6                 ** PREVIOUS VOLSER IF MULTI-VOL   ** 11500000
MVNVOL   DS    CL6                 ** NEXT VOLSER IF MULTI-VOL       ** 11550000
*                                                                       11600000
MVUCBTYP DS    XL4                ** COPY OF UCBTYP FIELD FROM UCB @002 11650000
*                                                                       11700000
MVERRCNT DS    0CL8                ** ERROR COUNTS                   ** 11750000
MVTRERR  DS    H                   ** TEMPORARY READ ERRORS          ** 11800000
MVTWERR  DS    H                   ** TEMPORARY WRITE ERRORS         ** 11850000
MVPRERR  DS    H                   ** PERMANENT READ ERRORS          ** 11900000
MVPWERR  DS    H                   ** PERMANENT WRITE ERRORS         ** 11950000
*                                                                       12000000
         DS    CL4                 ** RESERVED                       ** 12050000
*                                                                       12100000
MVPPDATA DS    0CL18               ** PROGRAM PRODUCT DATA           ** 12150000
MVPPNUM  DS    CL8                 ** PROGRAM PRODUCT NUMBER         ** 12200000
MVVER    DS    CL6                 ** VERSION/RELEASE/MOD NUMBER     ** 12250000
MVFEAT   DS    CL4                 ** FEATURE CODE                   ** 12300000
*                                                                       12350000
MVTRTCH  DS    XL1                 ** FROM JFCTRTCH - IDRC SUPPORT   ** 12400000
MVTCOMP  EQU   X'08'               ** DSN USED 3480 IDRC             ** 12450000
MVTNCOMP EQU   X'04'               ** NO COMPACTION                  ** 12500000
*                                                                       12550000
MVOPVOL  DS    CL6                 ** OLD PREVIOUS VOLUME          @005 12600000
MVTOKEN  DS    CL8                 ** RESERVED FOR O/C/EOV           ** 12650000
MVLOCFLG DS    XL1                 ** FLAG BYTE FOR LIBRARY SUPPORT@004 12700000
MVTRNFLG EQU   X'80'               ** INDICATES VOLUME IN TRANSIT  @004 12750000
*                                  ** WHEN NOT SET, VOLUME IS IN   @004 12800000
*                                  ** LOCATION                     @004 12850000
MVMVMODE EQU   X'40'               ** MOVE MODE,                   @S1A 12861000
*                                  ** 0 - AUTOMOVE,                @S1A 12872000
*                                  ** 1 - MANUALMOVE               @S1A 12883200
MvExtBinApplied X'20'              ** EXTENDED BIN APPLIED         @SCA 12891190
MVLTYFLG EQU   X'0F'               ** LOCATION TYPE - 4 BITS       @004 12900000
*                                  ** B'0000' SHELF LOCATION       @004 12950000
*                                  ** B'0001' STORAGE LOCATION     @004 13000000
*                                  ** B'0010' MANUAL LIBRARY       @K1C 13050000
*                                  ** B'0011' AUTOMATIC LIBRARY    @004 13100000
*                                  ** B'0100' STORE WITH BINS      @S1A 13116600
*                                  ** B'0101' STORE WITHOUT BINS   @S1A 13133200
MVTYPFLG DS    XL1                 ** FLAGS FOR LOCATION TYPE      @004 13150000
*                                  ** INFORMATION                  @004 13200000
MVNTYFLG EQU   X'F0'               ** LOCATION TYPE - 4 BITS       @004 13250000
*                                  ** B'0000' SHELF LOCATION       @004 13300000
*                                  ** B'0001' STORAGE LOCATION     @004 13350000
*                                  ** B'0010' MANUAL LIBRARY       @K1C 13400000
*                                  ** B'0011' AUTOMATIC LIBRARY    @004 13450000
*                                  ** B'0100' STORE WITH BINS      @S1A 13466600
*                                  ** B'0101' STORE WITHOUT BINS   @S1A 13483200
MVDTYFLG EQU   X'0F'               ** LOCATION TYPE - 4 BITS       @07C 13516600
*                                  ** B'0000' SHELF LOCATION       @004 13550000
*                                  ** B'0001' STORAGE LOCATION     @004 13600000
*                                  ** B'0010' MANUAL LIBRARY       @K1C 13650000
*                                  ** B'0011' AUTOMATIC LIBRARY    @004 13700000
*                                  ** B'0100' STORE WITH BINS      @S1A 13716600
*                                  ** B'0101' STORE WITHOUT BINS   @S1A 13733200
MVTYP2FLG DS   XL1                 ** MORE FLAGS FOR TYPES         @07C 13766600
MVHTYFLG EQU   X'F0'               ** LOCATION TYPE - 4 BITS       @004 13800000
*                                  ** B'0000' SHELF LOCATION       @004 13850000
*                                  ** B'0001' STORAGE LOCATION     @004 13900000
*                                  ** B'0010' MANUAL LIBRARY       @K1C 13950000
*                                  ** B'0011' AUTOMATIC LIBRARY    @004 14000000
*                                  ** B'0100' STORE WITH BINS      @S1A 14016600
*                                  ** B'0101' STORE WITHOUT BINS   @S1A 14033200
MVOTYFLG EQU   X'0F'               ** OLD LOCATION  - 4 BITS       @SCA 14035190
*                                  ** B'0000' SHELF LOCATION       @SCA 14037180
*                                  ** B'0001' STORAGE LOCATION     @SCA 14039170
*                                  ** B'0010' MANUAL LIBRARY       @SCA 14041160
*                                  ** B'0011' AUTOMATIC LIBRARY    @SCA 14043150
*                                  ** B'0100' STORE WITH BINS      @SCA 14045140
*                                  ** B'0101' STORE WITHOUT BINS   @SCA 14047130
*                                                                       14050000
MVRQPRTY DS    H                   ** REQUIRED LOCATION PRIORITY   @S8C 14079700
MVCAPACITY DS  F                   ** Volume capacity in MBytes    @S9A 14099500
*                                  **     (for uncompressed data)  @S9A 14119300
MVHLOC   DS    CL8                 ** HOME LOCATION NAME           @013 14139200
MVSGNAME DS    CL8                 ** STORAGE GROUP NAME           @013 14183800
MVLOC    DS    CL8                 ** LOCATION NAME                @013 14228400
MVDEST   DS    CL8                 ** DESTINATION NAME             @013 14273000
MVOLOC   DS    CL8                 ** PREVIOUS LOCATION NAME       @013 14317600
MVUSBIN  DS    CL6                 ** SHELF MANAGED STORE BIN NO.  @S1A 14362500
MVUBMDN  DS    CL8                 ** BIN MEDIA NAME               @S1A 14381200
MVUSOBIN DS    CL6                 ** SHELF MANAGED STORE OLD BIN  @S1A 14400000
MVUOBMDN DS    CL8                 ** OLD BIN MEDIA NAME           @S1A 14416600
MVRETDAT DS    PL4                 ** RETENTION DATE               @S2A 14433300
         DS    CL6                 ** RESERVED                     @04A 14436600
         DS    CL6                 ** RESERVED                     @04A 14439900
MVLCTOKN DS    CL8                 ** VOLUME LAST CHANGE TOKEN     @06A 14443200
MVVOLTYPE DS   XL1                 ** VOLUME TYPE                  @S8A 14444500
MVVOLTYPE_PHYSICAL EQU X'00'       **                              @S8A 14445800
MVVOLTYPE_LOGICAL  EQU X'01'       **                              @S8A 14447100
MVVOLTYPE_STACKED  EQU X'02'       ** STACKED VOLUME               @LGA 14447800
MVFLGF         DS   XL1            ** FLAGS 'F' -                  @LFA 14448500
MVRBYSET       EQU  X'80'          ** RETAINED BY SET              @LFA 14449200
*---------------------------------------------------------------------* 14475900
*    Level 1 fixed length section (62 bytes)                          * 14502600
*---------------------------------------------------------------------* 14529300
MVLEV0VS DS   0CL268               ** LEVEL 0 VAR. LENGTH SECTION  @S6A 14556200
MVLEV1SC DS   0CL62                ** LEVEL 1 SECTION              @S6A 14562400
MVDCRSID DS    CL8                 ** 1ST DATA SET CREATE SYSID    @LCA 14566500
MVCONTAINER     DS  CL16           ** CONTAINER                    @S8A 14568500
MVCONTAINER_STV EQU MVCONTAINER,6  ** STACKED VOLUME               @S8A 14570500
MVOLD_CONTAINER DS CL16            ** OLD CONTAINER                @K2A 14571500
MVEXPTOKEN      DS CL8             ** EXPORT TOKEN                 @LGA 14572500
                DS CL9             ** RESERVED                     @LGC 14574400
MVLAST_POSN DS  FL1                ** Last file end media position @K3C 14574500
MV_STV_VOLCOUNT DS  F              ** VOLUME COUNT                 @LGA 14574600
*---------------------------------------------------------------------* 14579300
*    Level 2 fixed length section (64 bytes)                          * 14579890
*---------------------------------------------------------------------* 14580480
MvDestBin        DS  CL6           ** Destination bin number       @09A 14581070
MvDestBinMedia   DS  CL8           ** Destination bin media name   @09A 14581660
                 DS  CL50          ** Reserved                     @09A 14582250
*---------------------------------------------------------------------* 14582840
*    Variable length Section                                          * 14584000
*---------------------------------------------------------------------* 14588700
MVVARSEC DS   0CL268               ** VARIABLE LENGTH SECTION      @S6A 14593400
MVDSN1L  DS    XL1                 ** LENGTH OF FIRST DSNAME ON TAPE ** 14600000
MVDSNLL  DS    XL1                 ** LENGTH OF LAST DSNAME ON TAPE  ** 14650000
MVACCLEN DS    XL1                 ** LENGTH OF A/C FIELD (OR ZERO)  ** 14700000
MVUSELEN DS    XL1                 ** LENGTH OF USER DATA (OR ZERO)  ** 14750000
MVACCLST DS    XL1                 ** NUMBER OF ACCESS LIST ENTRIES  ** 14800000
         DS    XL7                 ** RESERVED                       ** 14850000
*                                                                       14900000
MVDSN1   DS    CL44                ** DSNAME OF FIRST FILE ON TAPE   ** 14950000
MVDSNL   DS    CL44                ** DSNAME OF LAST FILE ON TAPE    ** 15000000
MVACCINF DS    CL40                ** ACCOUNTING INFORMATION         ** 15050000
MVDESC   DS    CL30                ** USER DESCRIPTION               ** 15100000
MVUSEFLD EQU  MVDESC               ** USER DESCRIPTION               ** 15125000
         DS    CL2                 ** RESERVED                       ** 15150000
MVAUTIDS DS    CL96                ** AUTHORISED USER IDS AREA       ** 15200000
MVAUTHND DS    0C                  ** AUTH FIELD END MARKER          ** 15250000
MVAUTHID EQU   MVAUTIDS,8          ** FIRST AUTH. USER ID SLOT       ** 15300000
*    MVAUTIDS IS 12 8-BYTE SLOTS, CONTAINING UP TO 12 USER IDS       ** 15350000
*                                                                       15400000
* END OF VOLUME INFORMATION                                             15450000
*                                                                       15500000
MVRCEND  DS    0F                  ** END OF MVRC                    ** 15550000
MVRCLNG  EQU   MVRCEND-MVRECORD    ** MAX LENGTH OF MVRECORD         ** 15600000
*                                  **                                ** 15650000
* END OF RMM MVREC                                                      15700000
*                                  **                                ** 15750000
         POP   PRINT                                                    15800000
         MEND  , */                                                     15850000
*%EDGSVREC1:;                                                           15900000
*%IHALPUSH = '@LISTPUSH';                                               15950000
*%IHALOFF  = '@LISTOFF';                                                16000000
*%IHALPOP  = '@LISTPOP';                                                16050000
*IHALPUSH;                                                              16100000
*%IF IHALIST='YES' %THEN                                                16150000
* %GOTO EDGSVREC42;                                                     16200000
*IHALOFF;                                                               16250000
*%EDGSVREC42:; /* P L S M A P P I N G S T A R T */                      16300000
*DCL                                                                    16350000
*  1 MVREC    BASED,                /* 0                             */ 16400000
*    2 MVRECORD BDY(WORD) CHAR(0),  /* EDGSVREC INFORMATION          */ 16450000
*    2 *        CHAR(56)  ,         /* 0                             */ 16500000
*      3 MVTYPE CHAR(1),            /* 'V' - VOLUME INFO TYPE        */ 16550000
*      3 *      BIT(8),             /* RESERVED                      */ 16600000
*      3 MVVOLSER CHAR(6),          /* VOLUME SERIAL NUMBER          */ 16650000
*      3 MVPAD1 CHAR(48),           /* RESERVED - BINARY ZEROS       */ 16700000
*    2 MVRECLN  FIXED(15),          /* RECORD LENGTH                 */ 16750000
*    2 *        FIXED(15),          /* RESERVED                      */ 16800000
*    2 MVCRDATE CHAR(4),            /* VOL CREATE DATE - YYYYDDD     */ 16850000
*    2 MVCRTIME CHAR(4),            /* VOL CREATE TIME - HHMMSST     */ 16900000
*    2 MVCRSID  CHAR(8),            /* CREATE SYSTEM ID              */ 16950000
*    2 MVRCCDS  CHAR(8),            /* RECORD CREATE CDS ID      @004*/ 17000000
*    2 MVLCDATE CHAR(4),            /* LAST CHANGE DATE - YYYYDDD    */ 17050000
*    2 MVLCTIME CHAR(4),            /* LAST CHANGE TIME - HHMMSST    */ 17100000
*    2 MVLCUID  CHAR(8),            /* LAST CHANGE USER ID           */ 17150000
*    2 MVLCSID  CHAR(8),            /* LAST CHANGE SYSTEM ID         */ 17200000
*    2 MVUCDATE CHAR(4),            /* LAST "USER" CHANGE DATE       */ 17250000
*    2 MVUCTIME CHAR(4),            /* LAST "USER" CHANGE TIME       */ 17300000
*    2 MVCFLG   BIT(8),             /* CONTROL FLAGS 1               */ 17350000
*      3 MVDELFLG BIT(1),           /* RECORD DELETED                */ 17400000
*      3 *        BIT(1),           /*                               */ 17450000
*      3 *        BIT(1),           /*                               */ 17500000
*      3 MVSELFLG BIT(1),           /* SELECT - PROC BY SATELLITE       17550000
*                                      UPDT                          */ 17600000
*      3 MVDUMMY  BIT(1),           /* DUMMY RECORD - ALLOW TSO ADD  */ 17650000
*    2 MVRECLEV BIT(8),             /* RECORD LEVEL NUMBER       @004*/ 17700000
*    2 *        CHAR(6),            /* RESERVED                      */ 17750000
*    2 MVEXPDTO CHAR(4),            /* EXPIRATION DATE - ORIGINAL    */ 17800000
*    2 MVEXPDT  CHAR(4),            /* EXPIRATION DATE - YYYYDDD     */ 17850000
*    2 MVRDEN   BIT(8),             /* COPY OF JFCBDEN               */ 17900000
*    2 MVDEN    CHAR(1),            /* RECORDING DENSITY:            */ 17950000
*    2 MVDSNNO  FIXED(15),          /* NUMBER OF DATASETS ON VOLUME  */ 18000000
*    2 MVTUSE   FIXED(31),          /* TAPE USAGE IN KBYTES          */ 18050000
*    2 MVUSE    FIXED(15),          /* VOLUME USE COUNT              */ 18100000
*    2 MVSTSTAT BIT(8),             /* STORE STATUS:                 */ 18150000
*    2 MVVRSREL BIT(8),             /* VRS RELEASE OPTIONS       @S7C*/ 18166600
*      3 MVVRFXDI BIT(1),           /* EXPIRY DATE IGNORE        @S7A*/ 18183200
*      3 MVVRFSCI BIT(1),           /* SCRATCH IMMEDIATE         @S7A*/ 18199800
*      3 *      BIT(6),             /* RESERVED                  @S7A*/ 18216400
* /*FLAG BITS IN MVVRSREL SHOULD MATCH MKRLSOPT BIT SETTINGS.    @S7A*/ 18233000
*    2 MVLABNO1 FIXED(15),          /* LABEL NUMBER OF 1ST FILE      */ 18250000
*    2 MVTDSI   CHAR(4),            /* TAPE MEDIA TYPE INFORMATION   */ 18300000
*      3 MVMEDREC BIT(8),            ! RECORDING FORMAT. ONE OF:        18333200
*                                    ! X'00' - NON CARTRIDGE     @S9C   18366400
*                                    ! X'01' - 18TRACK                  18399600
*                                    ! X'02' - 36TRACK                  18432800
*                                    ! X'03' - 128TRACK                 18466000
*                                    ! X'04' - 256TRACK          @S9A   18499200
*      3 MVMEDTY  BIT(8),           /* TAPE MEDIA TYPE. ONE OF:  @S4C   18532800
*                                      X'00' - NON-CARTRIDGE     @S9C   18571600
*                                      X'01' - CST               @S4C   18610400
*                                      X'02' - ECCST             @S4C   18649200
*                                      X'03' - HPCT              @S4A   18688000
*                                      X'04' - EHPCT             @S4A*/ 18765600
*      3 MVMEDCMP BIT(8),           /* TAPE COMPACTION. ONE OF:  @S4C   18804400
*                                      X'00' - UNKNOWN           @S4C   18843200
*                                      X'01' - NOT COMPACTED     @S4C   18882000
*                                      X'02' - COMPACTED         @S4C*/ 18920800
*      3 MVMEDATR BIT(8),            ! TAPE SPECIAL ATTRIBUTES. ONE OF: 18965600
*                                    ! X'00' - NONE                     19010400
*                                    ! X'01' - 18 TRACK READ ONLY       19055200
*    2 MVSTORID CHAR(1),            /* STORE LOCATION ID:            */ 19100000
*    2 MVNSTRID CHAR(1),            /* NEW STORE LOCATION            */ 19150000
*    2 MVNLOC   CHAR(8),            /* DESIRED LOCATION NAME     @004*/ 19200000
*    2 MVSTBIN  FIXED(31),          /* STORE BIN NUMBER              */ 19250000
*    2 MVOBIN   FIXED(31),          /* OLD BIN NUMBER                */ 19300000
*    2 MVSTDATE CHAR(4),            /* DATE STORED (YYYYDDD)         */ 19350000
*    2 MVLUDEV  CHAR(4),            /* LAST USED DEVICE          @06C*/ 19400000
*    2 MVLONLOC CHAR(8),            /* LOAN LOCATION                 */ 19450000
*    2 MVOLNLOC CHAR(8),            /* OLD LOAN LOCATION             */ 19500000
*    2 MVLRDDAT CHAR(4),            /* DATE VOLUME LAST READ            19550000
*                                      (YYYYDDD)                     */ 19600000
*    2 MVLWTDAT CHAR(4),            /* DATE VOLUME LAST WRITTEN      */ 19650000
*    2 MVASDATM CHAR(8),            /* ASSIGNED DATE AND TIME        */ 19700000
*      3 MVASDATE CHAR(4),          /* ASSIGNED DATE (YYYYDDD)       */ 19750000
*      3 MVASTIME CHAR(4),          /* ASSIGNED DATE (HHMMSST)       */ 19800000
*    2 MVOWNID  CHAR(8),            /* VOLUME OWNER USERID           */ 19850000
*    2 MVCRUID  CHAR(8),            /* CREATING USERID               */ 19900000
*    2 MVCRJOB  CHAR(8),            /* CREATING JOBNAME              */ 19950000
*    2 MVSECLEV BIT(8),             /* SECURITY CLASSIFICATION          20000000
*                                      LEVEL                         */ 20050000
*    2 MVFLGAX  BIT(8),             /* FLAGS 'A' - STATUS EXTENSION  */ 20100000
*      3 MVGVCFLG BIT(1),           /* SCRATCH VOL CLAIMED VIA          20150000
*                                      GETVOL                        */ 20200000
*      3 MVXINFLG BIT(1),           /* SCRATCH VOLUME HAS NEVER BEEN    20250000
*                                      INITIALISED               @004*/ 20300000
*      3 MVINIFLG BIT(1),           /* SCRATCH VOLUME WITH INIT         20350000
*                                      ACTION PENDING            @004*/ 20400000
*      3 MVENTFLG BIT(1),           /* SCRATCH VOLUME WAITING TO        20450000
*                                      ENTER ATL                 @004*/ 20500000
*      3 MVFABEND BIT(1),           /* ABEND IN PROCESS WHEN A          20550000
*                                      DATA SET CLOSED           @004*/ 20600000
*      3 MVFOCEAB BIT(1),           /* ABEND PROBABLY IN O/C/EOV @004*/ 20650000
*      3 MVATIFLG BIT(1),           /* INIT REQUIRED FOR ATL VOL @S6A*/ 20666600
*      3 MVFORCE  BIT(1),           /* FORCE SUPPLIED            @S6A*/ 20683200
*    2 MVVOLSEQ FIXED(15),          /* VOLUME SEQUENCE NUMBER        */ 20700000
*    2 * UNION,                     /*                           @LGA*/ 20735700
*      3 MVFLGA   BIT(8),           /* FLAGS 'A' - STATUS            */ 20771400
*        4 MVMSTFLG BIT(1),         /* VOLUME IS MASTER              */ 20807100
*        4 MVRLSFLG BIT(1),         /* VOLUME PENDING RELEASE        */ 20842800
*        4 MVVRFLG  BIT(1),         /* VITAL RECORD - DO NOT RELEASE */ 20878500
*        4 MVASSFLG BIT(1),         /* USER TAPE (ASSIGNED BY LIB)   */ 20914200
*        4 MVLONFLG BIT(1),         /* TAPE IS ON LOAN               */ 20949900
*        4 MVOPNFLG BIT(1),         /* TAPE OPENED AND NOT YET CLOSED*/ 20985600
*        4 MVSCRFLG BIT(1),         /* VOLUME IS SCRATCH             */ 21021300
*        4 MVOCEFLG BIT(1),         /* VOLUME RECORDED BY O/C/EOV@LGC*/ 21057000
*      3 *      BIT(8),             /* FLAGS 'A' - STATUS        @LGA*/ 21092700
*        4 *        BIT(7),         /*                           @LGA*/ 21128400
*        4 MVEXRFLG BIT(1),         /* STV RECORDED BY EXPORT    @LGA*/ 21164100
*    2 MVFLGB   BIT(8),             /* FLAGS 'B'                     */ 21200000
*      3 MVDEFRET BIT(1),           /* DEFAULT RETENTION PERIOD         21250000
*                                      USED                          */ 21300000
*      3 MVPPTAPE BIT(1),           /* PROGRAM PRODUCT TAPE          */ 21350000
*      3 MVNLTAPE BIT(1),           /* LABEL TYPE IS NL              */ 21400000
*      3 MVALTAPE BIT(1),           /* LABEL TYPE IS AL              */ 21450000
*      3 MVSLTAPE BIT(1),           /* LABEL TYPE IS SL              */ 21500000
*      3 *        BIT(1),           /*                               */ 21550000
*      3 MVBLTAPE BIT(1),           /* TAPE LAST WRITTEN USING BLP   */ 21600000
*      3 MVULTAPE BIT(1),           /* SL OR AL TAPE HAS USER           21650000
*                                      LABELS                        */ 21700000
*    2 MVFLGC   BIT(8),             /* FLAGS 'C' - RELEASE ACTIONS   */ 21750000
*      3 MVRETSCR BIT(1),           /* RETURN TO SCRATCH POOL           21800000
*                                      -DEFAULT                      */ 21850000
*      3 MVRELACT BIT(7),           /* RELEASE ACTIONS           @S6A*/ 21887500
*        4 MVREPREL BIT(1),         /* REPLACE TAPE ON RELEASE       */ 21925000
*        4 MVREINIT BIT(1),         /* REINITIALISE                  */ 21962500
*        4 MVDEGAUS BIT(1),         /* DEGAUS/SECURITY ERASE         */ 22000000
*        4 MVROWNER BIT(1),         /* RETURN TO OWNER               */ 22037500
*        4 MVNOWNER BIT(1),         /* NOTIFY OWNER                  */ 22075000
*        4 *        BIT(2),         /* RESERVED                  @07A*/ 22112500
*    2 MVFLGD   BIT(8),             /* FLAGS 'D' - ACCESS            */ 22150000
*      3 MVOREAD  BIT(1),           /* OWNER MAY READ VOLUME         */ 22200000
*      3 MVOUPD   BIT(1),           /* OWNER MAY UPDATE VOLUME       */ 22250000
*      3 MVOALT   BIT(1),           /* OWNER MAY ALTER VOLUME        */ 22300000
*      3 MVPROTR  BIT(1),           /* READ-ONLY PROTECTION          */ 22350000
*      3 MVPROTU  BIT(1),           /* UPDATE PROTECTION             */ 22400000
*      3 MVMVSUSE BIT(1),           /* MAY BE USED ON MVS SYSTEMS    */ 22450000
*      3 MVVMUSE  BIT(1),           /* MAY BE USED ON VM SYSTEMS     */ 22500000
*      3 MVNODSNR BIT(1),        /* ONLY FIRST DATA SET RECORDED @S4A*/ 22525000
*    2 MVFLGE   BIT(8) LIKE(MVFLGC), /* FLAGS 'E' - ACTIONS PENDING  */ 22562500
*    2 MVLTYP   BIT(8),             /* COPY OF JFCBLTYP              */ 22600000
*    2 MVALVERS CHAR(2),         /* ANSI LABEL VERSION IN BINARY @LBC*/ 22625000
*      3 MVALCUR FIXED(8),          /* CURRENT  LABEL VERSION    @LBA*/ 22650000
*      3 MVALREQ FIXED(8),          /* REQUIRED LABEL VERSION    @LBA*/ 22675000
*    2 MVMEDIA  CHAR(8),            /* INSTALLATIONS MEDIA NAME  @004*/ 22700000
*      3 MVUNIT  CHAR(8),           /* UNIT TYPE                 @004*/ 22750000
*    2 MVRACK   CHAR(6),            /* RACK NUMBER                   */ 22800000
*    2 MVPVOL   CHAR(6),            /* PREVIOUS VOLSER IF MULTI-VOL  */ 22850000
*    2 MVNVOL   CHAR(6),            /* NEXT VOLSER IF MULTI-VOL      */ 22900000
*    2 MVUCBTYP CHAR(4),            /* COPY OF UCBTYP FIELD FROM        22950000
*                                      UCB                           */ 23000000
*    2 MVERRCNT CHAR(8) BDY(HWORD), /* ERROR COUNTS                  */ 23050000
*      3 MVTRERR FIXED(15),         /* TEMPORARY READ ERRORS         */ 23100000
*      3 MVTWERR FIXED(15),         /* TEMPORARY WRITE ERRORS        */ 23150000
*      3 MVPRERR FIXED(15),         /* PERMANENT READ ERRORS         */ 23200000
*      3 MVPWERR FIXED(15),         /* PERMANENT WRITE ERRORS        */ 23250000
*    2 *        CHAR(4),            /* RESERVED                      */ 23300000
*    2 MVPPDATA CHAR(18)  ,         /* PROGRAM PRODUCT DATA          */ 23350000
*      3 MVPPNUM CHAR(8),           /* PROGRAM PRODUCT NUMBER        */ 23400000
*      3 MVVER  CHAR(6),            /* VERSION/RELEASE/MOD NUMBER    */ 23450000
*      3 MVFEAT CHAR(4),            /* FEATURE CODE                  */ 23500000
*    2 MVTRTCH  BIT(8),             /* FROM JFCTRTCH - IDRC SUPPORT  */ 23550000
*      3 *        BIT(1),           /*                               */ 23600000
*      3 *        BIT(1),           /*                               */ 23650000
*      3 *        BIT(1),           /*                               */ 23700000
*      3 *        BIT(1),           /*                               */ 23750000
*      3 MVTCOMP  BIT(1),           /* DSN COMPACTION                */ 23800000
*      3 MVTNCOMP BIT(1),           /* NO COMPACTION                 */ 23850000
*    2 MVTPVOL  CHAR(6),            /* RESERVED FOR O/C/EOV          */ 23900000
*    2 MVTOKEN  CHAR(8),            /* RESERVED FOR O/C/EOV          */ 23950000
*    2 MVLOCFLG BIT(8),             /* FLAG BYTE FOR LIBRARY     @004   24000000
*                                      SUPPORT                       */ 24050000
*      3 MVTRNFLG BIT(1),           /* INDICATES VOLUME IN TRANSIT.     24100000
*                                      WHEN NOT SET, VOLUME IS IN       24150000
*                                      LOCATION.                 @004*/ 24200000
*      3 MVMVMODE BIT(1),           /* MOVE MODE                 @S1A*/ 24218700
*                                   /* B'0' - AUTOMOVE           @S1A*/ 24237400
*                                   /* B'1' - MANUALMOVE         @S1A*/ 24256100
*      3 MvExtBinApplied BIT(1),    /* extended bin applied      @SCA*/ 24282990
*      3 *        BIT(1),           /*                           @SCC*/ 24290980
*      3 MVLTYFLG BIT(4),           /* LOCATION TYPE - 4 BITS           24300000
*                                      B'0000' SHELF LOCATION           24350000
*                                      B'0001' STORAGE LOCATION         24400000
*                                      B'0010' MANUAL LIBRARY           24450000
*                                      B'0011' AUTOMATIC LIBRARY @004   24475000
*                                      B'0100' STORE WITH BINS   @S1A   24500000
*                                      B'0101' STORE WITHOUT BINS@S1A*/ 24525000
*    2 MVTYPFLG CHAR(2),            /* FLAGS FOR LOCATION TYPE   @004   24550000
*                                      INFORMATION                   */ 24600000
*      3 *        BIT(8),           /*                           @07C*/ 24650000
*        4 MVNTYFLG BIT(4),         /* LOCATION TYPE - 4 BITS    @07C   24700000
*                                      B'0000' SHELF LOCATION           24750000
*                                      B'0001' STORAGE LOCATION         24800000
*                                      B'0010' MANUAL LIBRARY           24850000
*                                      B'0011' AUTOMATIC LIBRARY @004   24875000
*                                      B'0100' STORE WITH BINS   @S1A   24900000
*                                      B'0101' STORE WITHOUT BINS@S1A*/ 24925000
*        4 MVDTYFLG BIT(4),         /* LOCATION TYPE - 4 BITS           24950000
*                                      B'0000' SHELF LOCATION           25000000
*                                      B'0001' STORAGE LOCATION         25050000
*                                      B'0010' MANUAL LIBRARY           25100000
*                                      B'0011' AUTOMATIC LIBRARY @004   25125000
*                                      B'0100' STORE WITH BINS   @S1A   25150000
*                                      B'0101' STORE WITHOUT BINS@S1A*/ 25175000
*      3 *        BIT(8),           /*                           @004*/ 25200000
*        4 MVHTYFLG BIT(4),         /* LOCATION TYPE - 4 BITS           25250000
*                                      B'0000' SHELF LOCATION           25300000
*                                      B'0001' STORAGE LOCATION         25350000
*                                      B'0010' MANUAL LIBRARY           25400000
*                                      B'0011' AUTOMATIC LIBRARY @004   25425000
*                                      B'0100' STORE WITH BINS   @S1A   25450000
*                                      B'0101' STORE WITHOUT BINS@S1A*/ 25475000
*        4 MVOTYFLG BIT(4),         /* LOCATION TYPE - 4 BITS    @SCA   25477990
*                                      B'0000' SHELF LOCATION    @SCA   25480980
*                                      B'0001' STORAGE LOCATION  @SCA   25483970
*                                      B'0010' MANUAL LIBRARY    @SCA   25486960
*                                      B'0011' AUTOMATIC LIBRARY @SCA   25489950
*                                      B'0100' STORE WITH BINS   @SCA   25492940
*                                      B'0101' STORE WITHOUT BINS@SCA*/ 25495930
*    2 MVRQPRTY FIXED(15),          /* REQ. LOCATION PRIORITY    @S8C*/ 25500000
*    2 MVCAPACITY FIXED(31),        ! Volume capacity in MBytes    @S9A 25516600
*                                   !      (for uncompressed data) @S9A 25533200
*    2 MVHLOC   CHAR(8),            /* HOME LOCATION NAME        @004*/ 25550000
*    2 MVSGNAME CHAR(8),            /* STORAGE GROUP NAME        @004*/ 25600000
*    2 MVLOC    CHAR(8),            /* LOCATION NAME             @004*/ 25650000
*    2 MVDEST   CHAR(8),            /* DESTINATION NAME          @004*/ 25700000
*    2 MVOLOC   CHAR(8),            /* PREVIOUS LOCATION NAME    @004*/ 25750000
*    2 MVUSBIN  CHAR(6),            /* SHELF MANAGED STORE BIN   @S1A   25760000
*                                      NUMBER                    @S1A*/ 25770000
*    2 MVUBMDN  CHAR(8),            /* SHELF MANAGED STORE BIN   @S1A   25780000
*                                      MEDIA NAME                @S1A*/ 25790000
*    2 MVUSOBIN CHAR(6),            /* SHELF MANAGED STORE OLD   @S1A   25800000
*                                      BIN NUMBER                @S1A*/ 25810000
*    2 MVUOBMDN CHAR(8),            /* SHELF MANAGED STORE OLD   @S1A   25820000
*                                      BIN MEDIA NAME            @S1A*/ 25830000
*    2 MVRETDAT CHAR(4),            /* RETENTION DATE            @S2A*/ 25836600
*    2 *        CHAR(6),            /* RESERVED                  @S6A*/ 25874100
*    2 *        CHAR(6),            /* RESERVED                  @S6A*/ 25911600
*    2 MVLCTOKN CHAR(8),            /* VOLUME LAST CHANGE TOKEN  @S6A*/ 25949100
*    2 MVVOLTYPE FIXED(8),          /* VOLUME TYPE               @S8A*/ 25974100
*    2 MVFLGF     BIT(8),           /* FLAGS 'F'                 @LFA*/ 25986600
*      3 MVRBYSET BIT(1),           /* RETAINED BY VOLUME/SET    @LFA*/ 25999100
*      3 *        BIT(7),           /* RESERVED                  @LFA*/ 26011600
*    2 MVDCRSID          CHAR(8),    ! 1ST DATA SET CREATE SYSID   @K3C 26043600
*    2 MVCONTAINER       CHAR(16),   ! CONTAINER                   @K3C 26075600
*      3 MVCONTAINER_STV   CHAR(6),  ! STACKED VOLUME              @K3C 26107600
*    2 MVOLD_CONTAINER   CHAR(16),   ! OLD CONTAINER               @K3C 26139600
*    2 MVEXPTOKEN        CHAR(8),    ! EXPORT TOKEN                @K3C 26171600
*    2 *                 CHAR(9),    ! RESERVED                    @K3C 26203600
*    2 MVLAST_POSN       FIXED(8),   ! LAST FILE END MEDIA POS     @K3C 26235600
*    2 MV_STV_VOLCOUNT   FIXED(32),  ! VOLUME COUNT                @K3C 26267600
*    2 MvDestBin         CHAR(6),    ! Destination bin number      @09A 26275590
*    2 MvDestBinMedia    CHAR(8),    ! Destination bin medianame   @09A 26283580
*    2 *                 CHAR(50),   ! Reserved                    @09A 26291570
*    2 MVVARSEC,                     ! VARIABLE LENGTH SECTION     @K3C 26299600
*      3 MVDSN1L    FIXED(8),        ! LENGTH FIRST DSN ON VOLUME  @K3C 26331600
*      3 MVDSNLL    FIXED(8),        ! LENGTH LAST DSN ON VOLUME   @K3C 26363600
*      3 MVACCLEN   FIXED(8),        ! LENGTH OF A/C FIELD (OR 0)  @K3C 26395600
*      3 MVUSELEN   FIXED(8),        ! LENGTH OF USER DATE (OR 0)  @K3C 26427600
*      3 MVACCLST   FIXED(8),        ! NUM OF ACCESS LIST ENTRIES  @K3C 26459600
*      3 *          CHAR(7),         ! RESERVED                    @K3C 26491600
*      3 MVDSN1     CHAR(44),        ! DSNAME OF FIRST FILE        @K3C 26523600
*      3 MVDSNL     CHAR(44),        ! DSNAME OF LAST FILE         @K3C 26555600
*      3 MVACCINF   CHAR(40),        ! ACCOUNTING INFORMATION      @K3C 26587600
*      3 MVDESC     CHAR(30),        ! USER DESCRIPTION            @K3C 26619600
*        4 MVUSEFLD   CHAR(30),      ! USER DESCRIPTION            @K3C 26651600
*      3 *          CHAR(2),         ! RESERVED                    @K3C 26683600
*      3 MVAUTIDS   CHAR(96),        ! AUTHORISED USER IDS AREA    @K3C 26715600
*        4 MVAUTHID   CHAR(8),       ! FIRST AUTH. USER ID SLOT    @K3C 26747600
*      3 MVAUTHND   CHAR(0),         ! AUTH FIELD END MARKER       @K3C 26779600
*    2 MVRCEND  CHAR(0) BDY(WORD);  /* END OF MVRC                   */ 26811600
*DCL                                                                    26850000
*   MVTYPEID CHAR(1) CONSTANT('V')   ,                                  26900000
*                                   /* VOLUME INFO ID SYMBOL         */ 26950000
*   MVDEN3   CHAR(1) CONSTANT('3')   ,                                  27000000
*                                   /* '3' - 1600BPI                 */ 27050000
*   MVDEN4   CHAR(1) CONSTANT('4')   ,                                  27100000
*                                   /* '4' - 6250BPI                 */ 27150000
*   MVDEN9   CHAR(1) CONSTANT('9')   ,                                  27200000
*                                   /* '9' - 3480                    */ 27250000
*   MVDENC   CHAR(1) CONSTANT('C')   ,                                  27300000
*                                   /* 'C' - 3480 COMPACTED (IDRC)   */ 27350000
*   MVDENU   CHAR(1) CONSTANT('*')   ,                                  27400000
*                                   /* '*' - UNDEFINED               */ 27450000
*   MVSTS001 BIT(8) CONSTANT('01'X) ,                                   27500000
*                                   /* 1 - TAPE LIB TO REMOTE STORE  */ 27550000
*   MVSTS002 BIT(8) CONSTANT('02'X) ,                                   27600000
*                                   /* 2 - REMOTE STORE TO TAPE LIB  */ 27650000
*   MVSTS003 BIT(8) CONSTANT('03'X) ,                                   27700000
*                                   /* 3 - TAPE LIB TO LOCAL STORE   */ 27750000
*   MVSTS004 BIT(8) CONSTANT('04'X) ,                                   27800000
*                                   /* 4 - LOCAL STORE TO TAPE LIB   */ 27850000
*   MVSTS005 BIT(8) CONSTANT('05'X) ,                                   27900000
*                                   /* 5 - LOCAL STORE TO DISTANT    */ 27950000
*   MVSTS006 BIT(8) CONSTANT('06'X) ,                                   28000000
*                                   /* 6 - TAPE LIB TO DISTANT          28050000
*                                      STORE                         */ 28100000
*   MVSTS007 BIT(8) CONSTANT('07'X) ,                                   28150000
*                                   /* 7 - DISTANT STORE TO TAPE        28200000
*                                      LIB                           */ 28250000
*   MVSTS009 BIT(8) CONSTANT('09'X) ,                                   28300000
*                                   /* 9 - STORE LOCATION VALID      */ 28350000
*   MVSTIDD  CHAR(1) CONSTANT('D')   ,                                  28400000
*                                   /* D - DISTANT STORE             */ 28450000
*   MVSTIDL  CHAR(1) CONSTANT('L')   ,                                  28500000
*                                   /* L - LOCAL STORE               */ 28550000
*   MVSTIDR  CHAR(1) CONSTANT('R')   ,                                  28600000
*                                   /* R - REMOTE STORE              */ 28650000
*   MVSTIDT  CHAR(1) CONSTANT('T')   ,                           ! @S8C 28700000
*                                   /* T - TAPE LIBRARY              */ 28750000
*   MVVOLTYPE_PHYSICAL FIXED(8) CONSTANT('00'X),                 ! @S8A 28766600
*   MVVOLTYPE_LOGICAL  FIXED(8) CONSTANT('01'X),                 ! @S8A 28777700
*   MVVOLTYPE_STACKED  FIXED(8) CONSTANT('02'X);                 ! @LGA 28788800
*                                                                       28800000
*                                                                       28850000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   28900000
