*        %GOTO EDGSLAB1; /* BILINGUAL MAPPING                           00050000
         MACRO                                                          00100000
         EDGSLAB &DSECT=NO,&LIST=YES                                 */ 00150000
*%EDGSLAB1: ;                                                       /*  00200000
**** START OF SPECIFICATIONS ****************************************** 00250000
***                                                                  ** 00300000
***  $MAC(EDGSLAB)  COMP(COM) PROD(RMM):                             ** 00350000
***                                                                  ** 00400000
***  MACRO NAME:        EDGSLAB                                      ** 00450000
***                                                                  ** 00500000
***  DESCRIPTIVE NAME:  STICKY LABEL LAYOUT                          ** 00550000
***                                                                  ** 00600000
***  COPYRIGHT/SECURITY:                                             ** 00650000
***                                                                  ** 00700000
** OS/390 DFSMSrmm V2R10                                             ** 00750000
**                                                                   ** 00800000
**PROPRIETARY V3 STATEMENT                                            * 00850000
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00900000
**"RESTRICTED MATERIALS OF IBM"                                       * 00950000
**5647-A01                                                            * 01000000
**(C) COPYRIGHT 1998  IBM CORP.                                       * 01050000
**STATUS = HDZ11F0                                                    * 01075000
**END PROPRIETARY V3 STATEMENT                                        * 01100000
***                                                                  ** 01150000
***  INVOCATION:        PL/X                                         ** 01200000
***                                                                  ** 01250000
***                       %INCLUDE SYSLIB(EDGSLAB)                   ** 01300000
***                                                                  ** 01350000
***                     ASSEMBLER H                                  ** 01400000
***                                                                  ** 01450000
***                       EDGSLAB   DSECT=NO/YES                     ** 01500000
***                                                                  ** 01550000
***  NOTES:                                                          ** 01600000
***                                                                  ** 01650000
***    USAGE:           USED BY EDGUX100 AND ITS CALLERS TO MAP      ** 01700000
***                     THE STICKY LABEL LAYOUT                      ** 01750000
***                                                                  ** 01800000
***    CREATED BY:      RMM CLOSE processing                         ** 01850000
***                                                                  ** 01900000
***    COMPLETED BY:    RMM CLOSE processing                         ** 01950000
***                                                                  ** 02000000
***    POINTED TO BY:   EDGPL100 ON ENTRY TO EDGUX100                ** 02050000
***                                                                  ** 02100000
***    FREED BY:        RMM CLOSE processing                         ** 02150000
***                                                                  ** 02200000
***    SERIALIZATION:   NONE                                         ** 02250000
***                                                                  ** 02300000
***  CHANGE ACTIVITY:                                                ** 02350000
***                                                                  ** 02400000
* $L6=RMM150 ,150,970805,AH : GENERATED BY DISPOSITION CONTROL    @L6A* 02450000
* $K1=K150348,150,980128,AH : OFFSETS CORRECTION                  @K1A* 02466600
* $K2=K150349,150,980225,AH : STICKY LABEL W/O USER DATA          @K2A* 02483200
* $K3=K151038,150,980619,BDG: Correct offsets and varaibles       @K3A* 02491600
* $LE=RMM210 ,210,990721,BDG: SUPPORT GT32K BLOCKSIZE             @LEA* 02495800
***                                                                  ** 02500000
**** END OF SPECIFICATIONS ******************************************** 02550000
* */  %GOTO EDGSLAB2 ; /*                                               02600000
         PUSH  PRINT                                                    02650000
         PRINT GEN                                                      02675000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02700000
         PRINT OFF                                                      02750000
.ASMLIST ANOP                                                           02800000
         EJECT                                                          02850000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02900000
         AGO   .GENSTRT                                                 02950000
.GENDSCT ANOP                                                           03000000
SLAB     DSECT                                                          03050000
.GENSTRT ANOP                                                           03100000
SLABENT  DS    0D                  ** BEGIN OF SLAB                  ** 03104500
SLABID   DS    CL8'EDGSLAB'        ** SLAB EYECATCHER                ** 03109000
SLABSPL  DS    XL1                 ** SLAB SUBPOOL NUMBER            ** 03113500
SLABSIZE DS    XL3                 ** SLAB TOTAL SIZE                ** 03118000
SLABKEY  DS    XL1                 ** SLAB PROTECTION KEY            ** 03122500
SLABVER  DS    XL1                 ** SLAB VERSION                   ** 03127000
SLABLRECL DS  XL1                  ** SLAB OUTPUT FILE LRECL         ** 03131500
SLABTYPE DS    CL1                 ** SLAB LABEL TYPE                ** 03136000
SLABTYPE_CART EQU X'80'            ** SLAB CARTRIDGE LABEL BUILT     ** 03140500
SLABTYPE_REEL EQU X'40'            ** SLAB REEL      LABEL BUILT     ** 03145000
SLABCOL  DS    XL1                 ** SLAB NUMBER OF COLUMNS         ** 03149500
SLABROW  DS    XL1                 ** SLAB NUMBER OF ROWS            ** 03154000
SLABLAB  DS    0F                  ** SLAB STICKY LABEL              ** 03158500
         ORG   SLABLAB             ** SLAB MAXIMUM LABEL LAYOUT      ** 03163000
SLABMAX  DS    CL2000              **                                ** 03167500
         ORG   SLABLAB             ** REUSE AREA                   @K3C 03170500
SLABCART DS    0F                  ** SLAB CARTRIDGE LABEL LAYOUT    ** 03173500
SLABCLN1 DS    CL80                ** RECORD 1                       ** 03176500
SLABCLN2 DS    CL80                ** RECORD 2                       ** 03181000
SLABCLN3 DS    CL80                ** RECORD 3                       ** 03185500
SLABCLN4 DS    CL80                ** RECORD 4                       ** 03190000
SLABCLN5 DS    CL80                ** RECORD 5                       ** 03194500
SLABCLN6 DS    CL80                ** RECORD 6                       ** 03199000
SLABCLN7 DS    CL80                ** RECORD 7                       ** 03203500
SLABCLN8 DS    CL80                ** RECORD 8                       ** 03208000
SLABCLN9 DS    CL80                ** RECORD 9                       ** 03212500
SLABCLNA DS    CL80                ** RECORD 10                      ** 03217000
         ORG   SLABCLN1            ** LAYOUT RECORD1                 ** 03221500
SLABCDSN DS    CL44                ** SLAB CART. LABEL DSNAME        ** 03226000
         ORG   SLABCLN2            ** LAYOUT RECORD2                 ** 03230500
SLABCUSR DS    CL69                ** SLAB CART. USER DATA         @K2C 03235000
         ORG   SLABCLN3            ** LAYOUT RECORD3                 ** 03239500
         ORG   SLABCLN4            ** LAYOUT RECORD4                 ** 03244000
         DS    CL1                 **                                ** 03248500
SLABCJBN DS    CL8                 ** SLAB CART. LABEL JOBNAME       ** 03253000
         DS    CL5                 **                                ** 03257500
SLABCCRD DS    CL10                ** SLAB CART. LABEL CREATE DATE   ** 03262000
         ORG   SLABCLN5            ** LAYOUT RECORD5                 ** 03266500
         DS    CL14                **                                ** 03271000
SLABCEXP DS    CL10                ** SLAB CART. LABEL EXPIR. DATE   ** 03275500
         ORG   SLABCLN6            ** LAYOUT RECORD6                 ** 03280000
         DS    CL1                 **                                ** 03284500
SLABCDEN DS    CL4                 ** SLAB CART. LABEL DENSITY       ** 03289000
         DS    CL1                 **                                ** 03293500
SLABCCMP DS    CL4                 ** SLAB CART. LABEL COMPACTION    ** 03298000
         DS    CL1                 **                                ** 03302500
SLABCLRC DS    CL5                 ** SLAB CART. LABEL LRECL         ** 03307000
         DS    CL1                 **                              @LEC 03311500
SLABCBLK DS    CL6                 ** SLAB CART. LABEL BLKSIZE     @LEC 03316000
         DS    CL2                 **                              @K1C 03320500
SLABCRCF DS    CL4                 ** SLAB CART. LABEL RECFM         ** 03325000
         ORG   SLABCLN7            ** LAYOUT RECORD7                 ** 03329500
         ORG   SLABCLN8            ** LAYOUT RECORD8                 ** 03334000
         DS    CL1                 **                                ** 03338500
SLABCVSL DS    CL6                 ** SLAB CART. LABEL VOLSER        ** 03343000
         DS    CL1                 **                                ** 03347500
SLABCSQN DS    CL4                 ** SLAB CART. LABEL VOL SEQUENCE  ** 03352000
         DS    CL1                 **                                ** 03356500
SLABCLAB DS    CL3                 ** SLAB CART. LABEL VOL LABL TYPE ** 03361000
         DS    CL7                 **                              @K1C 03365500
SLABCDVC DS    CL4                 ** SLAB CART. LABEL DEVICE NUMBER ** 03370000
         ORG   SLABCLN9            ** LAYOUT RECORD9                 ** 03371500
         ORG   SLABCLNA            ** LAYOUT RECORDA                 ** 03373000
         ORG   SLABLAB             ** REUSE AREA                   @K3C 03375000
SLABTAPE DS    0F                  ** SLAB TAPE LABEL LAYOUT         ** 03377000
SLABTLN1 DS    CL80                ** RECORD 1                       ** 03379000
SLABTLN2 DS    CL80                ** RECORD 2                       ** 03383500
SLABTLN3 DS    CL80                ** RECORD 3                       ** 03388000
SLABTLN4 DS    CL80                ** RECORD 4                       ** 03392500
SLABTLN5 DS    CL80                ** RECORD 5                       ** 03397000
SLABTLN6 DS    CL80                ** RECORD 6                       ** 03401500
SLABTLN7 DS    CL80                ** RECORD 7                       ** 03406000
SLABTLN8 DS    CL80                ** RECORD 8                       ** 03410500
SLABTLN9 DS    CL80                ** RECORD 9                       ** 03415000
SLABTLNA DS    CL80                ** RECORD 10                      ** 03419500
         ORG   SLABTLN1            ** LAYOUT RECORD1                 ** 03424000
SLABTDSN DS    CL44                ** SLAB TAPE LABEL DSNAME         ** 03428500
         ORG   SLABTLN2            ** LAYOUT RECORD2                 ** 03433000
SLABTUSR DS    CL69                ** SLAB TAPE LABEL USER DATA    @K2C 03437500
         ORG   SLABTLN3            ** LAYOUT RECORD3                 ** 03442000
         DS    CL4                 **                              @K1C 03446500
SLABTJBN DS    CL8                 ** SLAB TAPE LABEL JOBNAME        ** 03451000
         DS    CL18                **                                ** 03455500
SLABTCRD DS    CL10                ** SLAB TAPE LABEL CREATE DATE    ** 03460000
         ORG   SLABTLN4            ** LAYOUT RECORD4                 ** 03464500
         ORG   SLABTLN5            ** LAYOUT RECORD5                 ** 03469000
         DS    CL1                 **                                ** 03473500
SLABTDEN DS    CL4                 ** SLAB TAPE LABEL DENSITY        ** 03478000
         DS    CL1                 **                                ** 03482500
SLABTCMP DS    CL4                 ** SLAB TAPE LABEL COMPACTION     ** 03487000
         DS    CL1                 **                                ** 03491500
SLABTLRC DS    CL5                 ** SLAB TAPE LABEL LRECL          ** 03496000
         DS    CL1                 **                              @LEC 03500500
SLABTBLK DS    CL6                 ** SLAB TAPE LABEL BLKSIZE      @LEC 03505000
         DS    CL2                 **                              @K1C 03509500
SLABTRCF DS    CL4                 ** SLAB TAPE LABEL RECFM          ** 03514000
         DS    CL1                 **                                ** 03518500
SLABTEXP DS    CL10                ** SLAB TAPE LABEL EXPIR. DATE    ** 03523000
         ORG   SLABTLN6            ** LAYOUT RECORD6                 ** 03527500
         ORG   SLABTLN7            ** LAYOUT RECORD7                 ** 03532000
         DS    CL15                **                                ** 03536500
SLABTVSL DS    CL6                 ** SLAB TAPE LABEL VOLSER         ** 03541000
         DS    CL1                 **                                ** 03545500
SLABTSQN DS    CL4                 ** SLAB TAPE LABEL VOL SEQUENCE   ** 03550000
         DS    CL1                 **                                ** 03554500
SLABTLAB DS    CL3                 ** SLAB TAPE LABEL VOL LABL TYPE  ** 03559000
         DS    CL6                 **                                ** 03563500
SLABTDVC DS    CL4                 ** SLAB TAPE LABEL DEVICE NUMBER  ** 03568000
         ORG   SLABTLN8            ** LAYOUT RECORD8                 ** 03569100
         ORG   SLABTLN9            ** LAYOUT RECORD9                 ** 03570200
         ORG   SLABTLNA            ** LAYOUT RECORDA                 ** 03571300
         ORG   ,                   ** END OF STICKY LABEL LAYOUT     ** 03577000
SLABEND  DS    0D                  ** END OF SLAB                    ** 03581500
SLABLNG  EQU   SLABEND-SLABENT     ** LENGTH OF SLAB                 ** 03586000
SLABVER#   EQU    1                ** VERSION NUMBER                 ** 03588000
SLABKEY#   EQU    5                ** KEY NUMBER                     ** 03590000
SLABSP#    EQU    230              ** SUBPOOL NUMBER                 ** 03592000
SLABROW#   EQU    10               ** DEFAULT NUMBER OF ROWS         ** 03594000
SLABCOL#   EQU    80               ** DEFAULT NUMBER OF COLS         ** 03596000
SLABLRECL# EQU    80               ** DEFAULT LRECL                  ** 03598000
         POP   PRINT                                                    03600000
         MEND  , */                                                     03650000
*%EDGSLAB2 :;                                                           03700000
*%IHALPUSH = '@LISTPUSH';                                               03750000
*%IHALOFF = '@LISTOFF';                                                 03800000
*%IHALPOP = '@LISTPOP';                                                 03850000
*IHALPUSH;                                                              03900000
*%IF IHALIST='YES' %THEN                                                03950000
*    %GOTO EDGSLAB3 ;                                                   04000000
*IHALOFF;                                                               04050000
*%EDGSLAB3 :;                                                           04100000
*@SPACE(1);                                                             04150000
*DCL                                                                    04200000
*1 SLAB BDY(DWORD) BASED,                                               04229100
*  2 SLABID   CHAR(8) INIT('EDGSLAB') BDY(DWORD),                       04247800
*  2 SLABSPL  FIXED(8),            ! SLAB SUBPOOL NUMBER                04250600
*  2 SLABSIZE FIXED(24),           ! SLAB TOTAL SIZE                    04253400
*  2 SLABKEY  FIXED(8),            ! SLAB PROTECTION KEY                04256200
*  2 SLABVER  FIXED(8),            ! SLAB VERSION NUMBER                04259000
*  2 SLABLRECL FIXED(8),           ! SLAB OUTPUT FILE LRECL             04261800
*  2 SLABTYPE BIT(8),              ! SLAB LABEL TYPE                    04264600
*    3 SLABTYPE_CART BIT(1),       ! SLAB CARTRIDGE LABEL BUILT         04267400
*    3 SLABTYPE_REEL BIT(1),       ! SLAB REEL      LABEL BUILT         04270200
*    3 *             BIT(6),       ! RESERVED                           04273000
*  2 SLABCOL  FIXED(8),            ! SLAB NUMBER OF COLUMNS             04275800
*  2 SLABROW  FIXED(8),            ! SLAB NUMBER OF ROWS                04278600
*  2 *        FIXED(16),           ! RESERVED                           04281400
*  2 SLABLAB  UNION BDY(WORD),     ! SLAB STICKY LABEL                  04284200
*    3 SLABMAX    CHAR(2000),      ! SLAB MAXIMUM SIZE                  04287000
*    3 SLABCART ,                  ! SLAB CARTRIDGE LABEL LAYOUT        04289800
*      4 SLABCLN1 CHAR(80),        ! RECORD 1                           04292600
*       5 SLABCDSN CHAR(44),       ! SLAB CART. LABEL DSNAME            04295400
*      4 SLABCLN2 CHAR(80),        ! RECORD 2                           04298200
*       5 SLABCUSR CHAR(69),       ! SLAB USER DATA              ! @K2C 04301000
*      4 SLABCLN3 CHAR(80),        ! RECORD 3                           04303800
*      4 SLABCLN4 CHAR(80),        ! RECORD 4                           04306600
*       5 *        CHAR(1),                                             04310300
*       5 SLABCJBN CHAR(8),        ! SLAB CART. LABEL JOBNAME           04312900
*       5 *        CHAR(5),                                             04315500
*       5 SLABCCRD CHAR(10),       ! SLAB CART. LABEL CREATE DATE       04318100
*      4 SLABCLN5 CHAR(80),        ! RECORD 5                           04320700
*       5 *        CHAR(14),                                            04323300
*       5 SLABCEXP CHAR(10),       ! SLAB CART. LABEL EXPIR. DATE       04325900
*      4 SLABCLN6 CHAR(80),        ! RECORD 6                           04328500
*       5 *        CHAR(1),                                             04331100
*       5 SLABCDEN CHAR(4),        ! SLAB CART. LABEL DENSITY           04333700
*       5 *        CHAR(1),                                             04336300
*       5 SLABCCMP CHAR(4),        ! SLAB CART. LABEL COMPACTION        04338900
*       5 *        CHAR(1),                                             04341500
*       5 SLABCLRC CHAR(5),        ! SLAB CART. LABEL LRECL             04344100
*       5 *        CHAR(1),                                      ! @LEC 04346700
*       5 SLABCBLK CHAR(6),        ! SLAB CART. LABEL BLKSIZE      @LEC 04349300
*       5 *        CHAR(2),                                      ! @K1C 04351900
*       5 SLABCRCF CHAR(4),        ! SLAB CART. LABEL RECFM             04354500
*      4 SLABCLN7 CHAR(80),        ! RECORD 7                           04357100
*      4 SLABCLN8 CHAR(80),        ! RECORD 8                           04359700
*       5 *        CHAR(1),                                             04362300
*       5 SLABCVSL CHAR(6),        ! SLAB CART. LABEL VOLSER            04364900
*       5 *        CHAR(1),                                             04367500
*       5 SLABCSQN CHAR(4),        ! SLAB CART. LABEL VOL SEQUENCE      04370100
*       5 *        CHAR(1),                                             04372700
*       5 SLABCLAB CHAR(3),        ! SLAB CART. LABEL VOL LABL TYPE     04375300
*       5 *        CHAR(7),                                      ! @K1C 04377900
*       5 SLABCDVC CHAR(4),        ! SLAB CART. LABEL DEVICE NUMBER     04380500
*      4 SLABCLN9 CHAR(80),        ! RECORD 9                           04383100
*      4 SLABCLNA CHAR(80),        ! RECORD 10                          04385700
*    3 SLABTAPE ,                  ! SLAB TAPE  LABEL LAYOUT            04388300
*      4 SLABTLN1 CHAR(80),        ! RECORD 1                           04390900
*      5 SLABTDSN CHAR(44),        ! SLAB TAPE  LABEL DSNAME            04393500
*      4 SLABTLN2 CHAR(80),        ! RECORD 2                           04396100
*       5 SLABTUSR CHAR(69),       ! SLAB TAPE DATA              ! @K2C 04398700
*      4 SLABTLN3 CHAR(80),        ! RECORD 3                           04401300
*       5 *        CHAR(4),                                      ! @K1C 04403900
*       5 SLABTJBN CHAR(8),        ! SLAB TAPE  LABEL JOBNAME           04406500
*       5 *        CHAR(18),                                            04409100
*       5 SLABTCRD CHAR(10),       ! SLAB TAPE  LABEL CREATE DATE       04411700
*      4 SLABTLN4 CHAR(80),        ! RECORD 4                           04414300
*      4 SLABTLN5 CHAR(80),        ! RECORD 5                           04416900
*       5 *        CHAR(1),                                             04419500
*       5 SLABTDEN CHAR(4),        ! SLAB TAPE  LABEL DENSITY           04422100
*       5 *        CHAR(1),                                             04424700
*       5 SLABTCMP CHAR(4),        ! SLAB TAPE  LABEL COMPACTION        04427300
*       5 *        CHAR(1),                                             04429900
*       5 SLABTLRC CHAR(5),        ! SLAB TAPE  LABEL LRECL             04432500
*       5 *        CHAR(1),                                      ! @LEC 04435100
*       5 SLABTBLK CHAR(6),        ! SLAB TAPE  LABEL BLKSIZE      @LEC 04437700
*       5 *        CHAR(2),                                      ! @K1C 04440300
*       5 SLABTRCF CHAR(4),        ! SLAB TAPE  LABEL RECFM             04442900
*       5 *        CHAR(1),                                             04445500
*       5 SLABTEXP CHAR(10),       ! SLAB TAPE  LABEL EXPIR. DATE       04448100
*      4 SLABTLN6 CHAR(80),        ! RECORD 6                           04450700
*      4 SLABTLN7 CHAR(80),        ! RECORD 7                           04453300
*       5 *        CHAR(15),                                            04455900
*       5 SLABTVSL CHAR(6),        ! SLAB TAPE  LABEL VOLSER            04458500
*       5 *        CHAR(1),                                             04461100
*       5 SLABTSQN CHAR(4),        ! SLAB TAPE  LABEL VOL SEQUENCE      04463700
*       5 *        CHAR(1),                                             04466300
*       5 SLABTLAB CHAR(3),        ! SLAB TAPE  LABEL VOL LABL TYPE     04468900
*       5 *        CHAR(6),                                             04471500
*       5 SLABTDVC CHAR(4),        ! SLAB TAPE  LABEL DEVICE NUMBER     04475500
*      4 SLABTLN8 CHAR(80),        ! RECORD 8                           04479500
*      4 SLABTLN9 CHAR(80),        ! RECORD 9                           04483500
*      4 SLABTLNA CHAR(80),        ! RECORD 10                          04487500
*  2 SLABEND  CHAR(0) BDY(DWORD);  ! END OF STICKY LABEL LAYOUT         04495500
*                                                                       04500000
*DECLARE                                                                04512500
*  SLABVER#     FIXED(8)  CONSTANT(1),    ! VERSION NUMBER              04525000
*  SLABKEY#     FIXED(8)  CONSTANT(5),    ! KEY NUMBER                  04537500
*  SLABSP#      FIXED(8)  CONSTANT(230),  ! SUBPOOL NUMBER              04550000
*  SLABROW#     FIXED(8)  CONSTANT(10),   ! DEFAULT NUMBER OF ROWS      04562500
*  SLABCOL#     FIXED(8)  CONSTANT(80),   ! DEFAULT NUMBER OF COLS      04575000
*  SLABLRECL#   FIXED(8)  CONSTANT(80),   ! DEFAULT NUMBER OF COLS      04581200
*  SLABLNG      FIXED(16) CONSTANT(LENGTH(SLAB));                       04587500
*@SPACE(1);                                                             04600000
*IHALPOP;                                                               04650000
