* %GOTO EDGSPREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGSPREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                             **                            00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM PRODUCT INFORMATION FOR SMF RECORDS                     ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
** DFSMS/MVS 1.1.0 DFSMSrmm                                           * 00650000
**                                                                    * 00700000
**PROPRIETARY V3 STATEMENT                                            * 00742800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00785600
**"RESTRICTED MATERIALS OF IBM"                                       * 00828400
**5695-DF1                                                            * 00871200
**(C) COPYRIGHT 1979,1993  IBM CORP.                                  * 00914000
**END PROPRIETARY V3 STATEMENT                                        * 00956800
*********************************************************************** 01000000
***                                                                  ** 01050000
***                                                                  ** 01100000
***                                                                  ** 01150000
*** FUNCTION : EDGSPREC MAPS THE SMF RECORD PRODUCT INFORMATION      ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON MPREC                            ** 01450000
***                                                                  ** 01500000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01550000
***                                                                  ** 01600000
***         LA     RX,SMFADREC                                       ** 01650000
***         USING  MPREC,RX                                          ** 01700000
***         CLI    MPTYPE,MPTYPEID       PRODUCT  INFORMATION?       ** 01750000
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
***    02/JUL/91 001/       CREATE MACRO                       MWW @001 01900000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01950000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @002 ** 02000000
***                                                                  ** 02050000
*********************************************************************** 02100000
         SPACE 1                                                        02150000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02200000
         AGO   .GENSTRT                                                 02250000
.GENDSCT ANOP                                                           02300000
MPREC    DSECT                                                          02350000
.GENSTRT ANOP                                                           02400000
*                                                                       02450000
* START OF RMM MPREC                                                    02500000
*                                                                       02550000
MPRECORD DS    0F                  ** EDGSPREC INFORMATION           ** 02600000
*                                                                       02650000
*                                                                       02700000
*                                                                       02750000
         DS    0CL56               **                                ** 02800000
MPTYPE   DS    C                   ** PP INFO      ID: 'P'           ** 02850000
MPTYPEID EQU   C'P'                ** PP INFO      ID SYMBOL         ** 02900000
MPPPNUM  DS    CL8                 ** PP NUMBER (NNNN-CCC)           ** 02950000
MPVER    DS    CL6                 ** VERSION/RELEASE/MOD NUMBER     ** 03000000
MPPAD1   DS    CL41                ** RESERVED - BINARY ZEROS        ** 03050000
*                                                                       03100000
* CONTROL INFORMATION                                                   03150000
*                                                                       03200000
MPRECLN  DS    H                   ** RECORD LENGTH                  ** 03250000
         DS    H                   ** RESERVED                       ** 03300000
MPCRDATE DS    PL4                 ** PP   CREATE DATE - YYYYDDD     ** 03350000
MPCRTIME DS    PL4                 ** PP   CREATE TIME - HHMMSST     ** 03400000
MPCRSID  DS    CL8                 ** CREATE SYSTEM ID               ** 03450000
MPRCCDS  DS    CL8                 ** RECORD CREATE CDS ID           ** 03500000
*                                  **                                ** 03550000
MPLCDATE DS    PL4                 ** LAST CHANGE DATE  - YYYYDDD    ** 03600000
MPLCTIME DS    PL4                 ** LAST CHANGE TIME -  HHMMSST    ** 03650000
MPLCUID  DS    CL8                 ** LAST CHANGE USER ID            ** 03700000
MPLCSID  DS    CL8                 ** LAST CHANGE SYSTEM ID          ** 03750000
MPUCDATE DS    PL4                 ** LAST "USER" CHANGE DATE        ** 03800000
MPUCTIME DS    PL4                 ** LAST "USER" CHANGE TIME        ** 03850000
*                                                                       03900000
* CONTROL FLAGS                                                         03950000
*                                                                       04000000
MPCFLG   DS    XL1                 ** CONTROL FLAGS 1                ** 04050000
MPDELFLG EQU   X'80'               ** RECORD DELETED                 ** 04100000
MPSELFLG EQU   X'10'               ** SELECT - PROC BY SATELLITE UPDT** 04150000
MPDUMMY  EQU   X'08'               ** DUMMY RECORD - ALLOW TSO ADD   ** 04200000
*                                                                       04250000
         DS    XL7                 ** RESERVED                       ** 04300000
*                                                                       04350000
* PROGRAM PRODUCT DETAILS                                               04400000
*                                                                       04450000
MPPPOWN  DS    CL8                 ** PROGRAM PRODUCT OWNER ID       ** 04500000
MPPPNAME DS    CL30                ** PROGRAM PRODUCT NAME           ** 04550000
MPPPDESC DS    CL30                ** PROGRAM PRODUCT DESCRIPTION    ** 04600000
         DS    XL64                ** RESERVED                       ** 04650000
*                                                                       04700000
* PROGRAM PRODUCT VOLUME DETAILS                                        04750000
*                                                                       04800000
MPVOLDET DS    0CL8164             ** VOLUME DETAILS                 ** 04850000
MPVOLNO  DS    H                   ** NO OF PP VOLS                  ** 04900000
MPVOLMAX EQU   255                 ** MAX NUMBER OF PP VOLS          ** 04950000
         DS    XL2                 ** RESERVED                       ** 05000000
*                                                                       05050000
* PROGRAM PRODUCT VOLUME ENTRY                                          05100000
*                                                                       05150000
MPVOLENT DS    0CL32               ** VOLUME ENTRY                   ** 05200000
MPVOLSER DS    CL6                 ** VOLUME SERIAL                  ** 05250000
MPRACK   DS    CL6                 ** RACK NUMBER                    ** 05300000
MPFEAT   DS    CL4                 ** FEATURE CODE                   ** 05350000
MPUNIT   DS    CL8                 ** UNIT TYPE                      ** 05400000
         DS    CL8                 ** RESERVED                       ** 05450000
         DS    254CL32             ** RESERVED FOR REMAINING ENTRIES ** 05500000
*                                                                       05550000
* END OF PROGRAM PRODUCT INFORMATION                                    05600000
*                                                                       05650000
MPRCEND  DS    0F                  ** END OF MPREC                   ** 05700000
MPRCLNG  EQU   MPRCEND-MPRECORD    ** MAX LENGTH OF MPRECORD         ** 05750000
*                                  **                                ** 05800000
* END OF RMM MPREC                                                      05850000
*                                  **                                ** 05900000
         POP   PRINT                                                    05950000
         MEND  , */                                                     06000000
*%EDGSPREC1:;                                                           06050000
*%IHALPUSH = '@LISTPUSH';                                               06100000
*%IHALOFF  = '@LISTOFF';                                                06150000
*%IHALPOP  = '@LISTPOP';                                                06200000
*IHALPUSH;                                                              06250000
*%IF IHALIST='YES' %THEN                                                06300000
* %GOTO EDGSPREC14;                                                     06350000
*IHALOFF;                                                               06400000
*%EDGSPREC14:; /* P L S M A P P I N G S T A R T */                      06450000
*DCL                                                                    06500000
*  1 MPREC    BASED,                /* 0                             */ 06550000
*    2 MPRECORD BDY(WORD) CHAR(0), /* EDGSPREC INFORMATION          */  06600000
*    2 *        CHAR(56)  ,         /* 0                             */ 06650000
*      3 MPTYPE CHAR(1),            /* PP INFO ID: 'P'               */ 06700000
*      3 MPPPNUM CHAR(8),           /* PP NUMBER (NNNN-CCC)          */ 06750000
*      3 MPVER  CHAR(6),            /* VERSION/RELEASE/MOD NUMBER    */ 06800000
*      3 MPPAD1 CHAR(41),           /* RESERVED - BINARY ZEROS       */ 06850000
*    2 MPRECLN  FIXED(15),          /* RECORD LENGTH                 */ 06900000
*    2 *        FIXED(15),          /* RESERVED                      */ 06950000
*    2 MPCRDATE CHAR(4),            /* PP CREATE DATE - YYYYDDD      */ 07000000
*    2 MPCRTIME CHAR(4),            /* PP CREATE TIME - HHMMSST      */ 07050000
*    2 MPCRSID  CHAR(8),            /* CREATE SYSTEM ID              */ 07100000
*    2 MPRCCDS  CHAR(8),            /* RECORD CREATE CDS ID          */ 07150000
*    2 MPLCDATE CHAR(4),            /* LAST CHANGE DATE - YYYYDDD    */ 07200000
*    2 MPLCTIME CHAR(4),            /* LAST CHANGE TIME - HHMMSST    */ 07250000
*    2 MPLCUID  CHAR(8),            /* LAST CHANGE USER ID           */ 07300000
*    2 MPLCSID  CHAR(8),            /* LAST CHANGE SYSTEM ID         */ 07350000
*    2 MPUCDATE CHAR(4),            /* LAST "USER" CHANGE DATE       */ 07400000
*    2 MPUCTIME CHAR(4),            /* LAST "USER" CHANGE TIME       */ 07450000
*    2 MPCFLG   BIT(8),             /* CONTROL FLAGS 1               */ 07500000
*      3 MPDELFLG BIT(1),           /* RECORD DELETED                */ 07550000
*      3 *        BIT(1),           /*                               */ 07600000
*      3 *        BIT(1),           /*                               */ 07650000
*      3 MPSELFLG BIT(1),           /* SELECT - PROC BY SATELLITE       07700000
*                                      UPDT                          */ 07750000
*      3 MPDUMMY  BIT(1),           /* DUMMY RECORD - ALLOW TSO ADD  */ 07800000
*    2 *        CHAR(7),            /* RESERVED                      */ 07850000
*    2 MPPPOWN  CHAR(8),            /* PROGRAM PRODUCT OWNER ID      */ 07900000
*    2 MPPPNAME CHAR(30),           /* PROGRAM PRODUCT NAME          */ 07950000
*    2 MPPPDESC CHAR(30),           /* PROGRAM PRODUCT DESCRIPTION   */ 08000000
*    2 *        CHAR(64),           /* RESERVED                      */ 08050000
*    2 MPVOLDET CHAR(8164) BDY(HWORD), /* VOLUME DETAILS             */ 08100000
*      3 MPVOLNO FIXED(15),         /* NO OF PP VOLS                 */ 08150000
*      3 *      CHAR(2),            /* RESERVED                      */ 08200000
*      3 MPVOLENT CHAR(32),         /* VOLUME ENTRY                  */ 08250000
*        4 MPVOLSER CHAR(6),        /* VOLUME SERIAL                 */ 08300000
*        4 MPRACK CHAR(6),          /* RACK NUMBER                   */ 08350000
*        4 MPFEAT CHAR(4),          /* FEATURE CODE                  */ 08400000
*        4 MPUNIT CHAR(8),          /* UNIT TYPE                     */ 08450000
*        4 *    CHAR(8),            /* RESERVED                      */ 08500000
*      3 *      (254) CHAR(32),     /* RESERVED FOR REMAINING           08550000
*                                      ENTRIES                       */ 08600000
*    2 MPRCEND  BDY(WORD) CHAR(0); /* END OF MPREC                  */  08650000
*DCL                                                                    08700000
*   MPTYPEID CHAR(1) CONSTANT('P')   ,                                  08750000
*                                   /* PP INFO ID SYMBOL             */ 08800000
*   MPVOLMAX FIXED(8) CONSTANT(255);                                    08850000
*                                   /* MAX NUMBER OF PP VOLS         */ 08900000
*                                                                       08950000
*                                                                       09000000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   09050000
