* %GOTO EDGSSREC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
&LAB     EDGSSREC &LIST=NO,&DSECT=YES                                   00150000
         PUSH  PRINT                                                    00200000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00250000
         PRINT OFF                                                      00300000
.ASMLIST ANOP                              **                           00350000
*********************************************************************** 00400000
***                                                                  ** 00450000
***      RMM SMF RECORD BIN INFORMATION                              ** 00500000
***                                                                  ** 00550000
*********************************************************************** 00600000
** OS/390 DFSMSrmm V2R10                                              * 00650000
**                                                                    * 00700000
**PROPRIETARY V3 STATEMENT                                            * 00742800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00785600
**"RESTRICTED MATERIALS OF IBM"                                       * 00828400
**5647-A01                                                            * 00891190
**(C) COPYRIGHT 1993,2000  IBM CORP.                                  * 00911180
**END PROPRIETARY V3 STATEMENT                                        * 00956800
*********************************************************************** 01000000
***                                                                  ** 01050000
***                                                                  ** 01100000
***                                                                  ** 01150000
*** FUNCTION : EDGSSREC MAPS THE SMF RECORD BIN INFORMATION          ** 01200000
***                                                                  ** 01250000
*** LOCATION : N/A                                                   ** 01300000
***                                                                  ** 01350000
*** METHOD OF ACCESS:                                                ** 01400000
***            ASSEMBLER - USING ON MSREC                            ** 01450000
***                                                                  ** 01500000
***         LA     RX,SMFADREC                                       ** 01550000
***         USING  MSREC,RX                                          ** 01600000
***         CLI    MSTYPE,MSTYPEID       BIN      INFORMATION?       ** 01650000
***                                                                  ** 01700000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01750000
***                                                                  ** 01800000
*** CHANGE ACTIVITY:                                                 ** 01850000
***    02/JUL/91 001/       CREATE MACRO                       MWW @001 01900000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01950000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @001 ** 02000000
***        ,WD,110992, correct copyright                        @002 ** 02059990
*** $S1=SPESLOC,110,040794,ADM: NEW FIELDS FOR GT 3 STORES SPE  @S1A ** 02069980
*** $09=OW47947,140,010131,CHK: Toleration Minimal BIN Assignm. @09A ** 02079970
***                                                                  ** 02100000
*********************************************************************** 02150000
         SPACE 1                                                        02200000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02250000
         AGO   .GENSTRT                                                 02300000
.GENDSCT ANOP                                                           02350000
MSREC    DSECT                                                          02400000
.GENSTRT ANOP                                                           02450000
*                                                                       02500000
* START OF RMM MSREC                                                    02550000
*                                                                       02600000
MSRECORD DS    0F                  ** EDGSSREC INFORMATION           ** 02650000
*                                                                       02700000
*                                                                       02750000
*                                                                       02800000
         DS    0CL56               **                                ** 02850000
MSTYPE   DS    CL1                 ** STORE INFO   ID:               ** 02900000
MSTYPER  EQU   C'R'                ** 'R' - EMPTY BIN                ** 02950000
MSTYPES  EQU   C'S'                ** 'S' - ASSIGNED BIN             ** 03000000
MSRMSTID DS    CL1                 ** REMOTE STORE ID:               ** 03050000
MSSTIDD  EQU   C'D'                ** 'D' - DISTANT STORE            ** 03100000
MSSTIDL  EQU   C'L'                ** 'L' - LOCAL STORE              ** 03150000
MSSTIDR  EQU   C'R'                ** 'R' - REMOTE STORE             ** 03200000
MSSTIDU  EQU   C'U'                ** 'U' - USER DEFINED STORE   @S1A** 03233300
MSSRSVD1 DC    XL8'00'             ** RESERVED                       ** 03266600
MSBINNO  DS    CL6                 ** BIN NUMBER                     ** 03300000
MSPAD1   DC    XL40'00'            ** RESERVED - BINARY ZEROS        ** 03350000
MSUSTNAM DS    CL8                 ** INSTALLATION DEFINED STORE @S1A** 03357100
*                                  ** NAME                       @S1A** 03364200
MSUMEDNM DS    CL8                 ** INSTALLATION DEFINED STORE @S1A** 03371300
*                                  ** BIN MEDIA NAME             @S1A** 03378400
MSUBINNO DS    CL6                 ** INSTALLATION DEFINED STORE @S1A** 03385500
*                                  ** BIN NUMBER                 @S1A** 03392600
*                                                                       03400000
* CONTROL INFORMATION                                                   03450000
*                                                                       03500000
MSRECLN  DS    H                   ** RECORD LENGTH                  ** 03550000
         DS    H                   ** RESERVED                       ** 03600000
MSCRDATE DS    PL4                 **      CREATE DATE - YYYYDDD     ** 03650000
MSCRTIME DS    PL4                 **      CREATE TIME - HHMMSST     ** 03700000
MSCRSID  DS    CL8                 ** CREATE SYSTEM ID               ** 03750000
MSRCCDS  DS    CL8                 ** RECORD CREATE CDS ID           ** 03800000
*                                  **                                ** 03850000
MSLCDATE DS    PL4                 ** LAST CHANGE DATE  - YYYYDDD    ** 03900000
MSLCTIME DS    PL4                 ** LAST CHANGE TIME -  HHMMSST    ** 03950000
MSLCUID  DS    CL8                 ** LAST CHANGE USER ID            ** 04000000
MSLCSID  DS    CL8                 ** LAST CHANGE SYSTEM ID          ** 04050000
MSUCDATE DS    PL4                 ** LAST "USER" CHANGE DATE        ** 04100000
MSUCTIME DS    PL4                 ** LAST "USER" CHANGE TIME        ** 04150000
*                                                                       04200000
* FLAG BYTES                                                            04250000
*                                                                       04300000
MSCFLG   DS    XL1                 ** CONTROL FLAGS 1                ** 04350000
MSDELFLG EQU   X'80'               ** RECORD DELETED                 ** 04400000
MSSELFLG EQU   X'10'               ** SELECT - PROC BY SATELLITE UPDT** 04450000
MSDUMMY  EQU   X'08'               ** DUMMY RECORD - ALLOW TSO ADD   ** 04500000
*                                                                       04550000
         DS    XL7                 ** RESERVED                       ** 04600000
*                                                                       04650000
* STORE INFORMATION                                                     04700000
*                                                                       04750000
MSVOLSER DS    CL6                 ** ASSIGNED VOLSER OR ZEROS       ** 04800000
*                                  **                                ** 04850000
         DS    CL10                ** RESERVED                       ** 04900000
*                                                                       04950000
*    Level 1 section (24 bytes)                                       * 04955990
*                                                                       04961980
MsMovingInVol    DS  CL6           Moving-in volume                @09A 04967970
MsMovingOutVol   DS  CL6           Moving-Out volume               @09A 04973960
MsOldVol         DS  CL6           Old volume                      @09A 04979950
                 DS  CL6           Reserved                        @09A 04985940
*                                                                       04991930
* END OF DISASTER STORE BIN INFORMATION                                 05000000
*                                                                       05050000
MSRCEND  DS    0F                  ** END OF MSRC                    ** 05100000
MSRCLNG  EQU   MSRCEND-MSRECORD    ** MAX LENGTH OF MSRECORD         ** 05150000
*                                  **                                ** 05200000
* END OF RMM MSREC                                                      05250000
*                                  **                                ** 05300000
         POP   PRINT                                                    05350000
         MEND  , */                                                     05400000
*%EDGSSREC1:;                                                           05450000
*%IHALPUSH = '@LISTPUSH';                                               05500000
*%IHALOFF  = '@LISTOFF';                                                05550000
*%IHALPOP  = '@LISTPOP';                                                05600000
*IHALPUSH;                                                              05650000
*%IF IHALIST='YES' %THEN                                                05700000
* %GOTO EDGSSREC13;                                                     05750000
*IHALOFF;                                                               05800000
*%EDGSSREC13:; /* P L S M A P P I N G S T A R T */                      05850000
*DCL                                                                    05900000
*  1 MSREC    BASED,                /* 0                             */ 05950000
*    2 MSRECORD BDY(WORD) CHAR(0), /* EDGSSREC INFORMATION          */  06000000
*    2 *        CHAR(78)  ,         /* 0                         @S1C*/ 06050000
*      3 MSTYPE CHAR(1),            /* STORE INFO ID:                */ 06100000
*      3 MSRMSTID CHAR(1),          /* REMOTE STORE ID:              */ 06150000
*      3 MSSRSVD1 CHAR(8),          /* RESERVED                      */ 06178500
*      3 MSBINNO  CHAR(6),          /* BIN NUMBER                    */ 06207000
*      3 MSPAD1   CHAR(40),         /* RESERVED - BINARY ZEROS       */ 06235500
*      3 MSUSTNAM CHAR(8),          /* USER DEFINED STORE NAME   @S1A*/ 06264000
*      3 MSUMEDNM CHAR(8),          /* USER DEFINED BIN MEDIA NAM@S1A*/ 06292500
*      3 MSUBINNO CHAR(6),          /* USER DEFINED STORE BIN NO.@S1A*/ 06321000
*    2 MSRECLN  FIXED(15),          /* RECORD LENGTH                 */ 06350000
*    2 *        FIXED(15),          /* RESERVED                      */ 06400000
*    2 MSCRDATE CHAR(4),            /* CREATE DATE - YYYYDDD         */ 06450000
*    2 MSCRTIME CHAR(4),            /* CREATE TIME - HHMMSST         */ 06500000
*    2 MSCRSID  CHAR(8),            /* CREATE SYSTEM ID              */ 06550000
*    2 MSRCCDS  CHAR(8),            /* RECORD CREATE CDS ID          */ 06600000
*    2 MSLCDATE CHAR(4),            /* LAST CHANGE DATE - YYYYDDD    */ 06650000
*    2 MSLCTIME CHAR(4),            /* LAST CHANGE TIME - HHMMSST    */ 06700000
*    2 MSLCUID  CHAR(8),            /* LAST CHANGE USER ID           */ 06750000
*    2 MSLCSID  CHAR(8),            /* LAST CHANGE SYSTEM ID         */ 06800000
*    2 MSUCDATE CHAR(4),            /* LAST "USER" CHANGE DATE       */ 06850000
*    2 MSUCTIME CHAR(4),            /* LAST "USER" CHANGE TIME       */ 06900000
*    2 MSCFLG   BIT(8),             /* CONTROL FLAGS 1               */ 06950000
*      3 MSDELFLG BIT(1),           /* RECORD DELETED                */ 07000000
*      3 *        BIT(1),           /*                               */ 07050000
*      3 *        BIT(1),           /*                               */ 07100000
*      3 MSSELFLG BIT(1),           /* SELECT - PROC BY SATELLITE       07150000
*                                      UPDT                          */ 07200000
*      3 MSDUMMY  BIT(1),           /* DUMMY RECORD - ALLOW TSO ADD  */ 07250000
*    2 *        CHAR(7),            /* RESERVED                      */ 07300000
*    2 MSVOLSER CHAR(6),            /* ASSIGNED VOLSER OR ZEROS      */ 07350000
*    2 *        CHAR(10),           /* RESERVED                      */ 07400000
*                                                                       07403990
*    /*--------------------------------------------------------------*/ 07407980
*    /*  Level 1 section  (24 bytes)                                 */ 07411970
*    /*--------------------------------------------------------------*/ 07415960
*                                                                       07419950
*    2 MsMovingInVol     CHAR(6),   ! Moving-in volume            @09A  07423940
*    2 MsMovingOutVol    CHAR(6),   ! Moving-Out volume           @09A  07427930
*    2 MsOldVol          CHAR(6),   ! Old volume                  @09A  07431920
*    2 *                 CHAR(6),   ! Reserved                    @09A  07435910
*                                                                       07439900
*    2 MSRCEND  BDY(WORD) CHAR(0); /* END OF MSRC                   */  07450000
*DCL                                                                    07500000
*   MSTYPER  CHAR(1) CONSTANT('R')   ,                                  07550000
*                                   /* 'R' - EMPTY BIN               */ 07600000
*   MSTYPES  CHAR(1) CONSTANT('S')   ,                                  07650000
*                                   /* 'S' - ASSIGNED BIN            */ 07700000
*   MSSTIDD  CHAR(1) CONSTANT('D')   ,                                  07750000
*                                   /* 'D' - DISTANT STORE           */ 07800000
*   MSSTIDL  CHAR(1) CONSTANT('L')   ,                                  07850000
*                                   /* 'L' - LOCAL STORE             */ 07900000
*   MSSTIDR  CHAR(1) CONSTANT('R')   ;                                  07950000
*                                   /* 'R' - REMOTE STORE            */ 08000000
*                                                                       08050000
*                                                                       08100000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   08150000
