*@LIST PUSH;                                                            00050000
*@LIST OFF;                                                             00100000
*/*                                                                     00150000
         MACRO                                                          00200000
         EWDMAP                                                         00210700
*                                                                    */ 00221400
*@LIST POP;                                                             00232200
*/***START OF SPECIFICATIONS******************************************/ 00248300
*/*                                                                  */ 00264400
*/* $MAC(EWDMAP): DASD DEVICE DEPENDENT MAP MACRO OF ERP WORK AREA   */ 00280500
*/*                                                                  */ 00296600
*/*PROPRIETARY V3 STATEMENT                                          */ 00308100
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00319600
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00331100
*/*5695-DF1                                                          */ 00342600
*/*(C) COPYRIGHT 1982,1994  IBM CORP.                                */ 00354100
*/*END PROPRIETARY V3 STATEMENT                                      */ 00365600
*/*                                                                  */ 00377100
*/* STATUS - DFSMS, 1.3.0                                            */ 00393200
*/*                                                                  */ 00409300
*/* FUNCTION -                                                       */ 00425400
*/*                                                                  */ 00441500
*/*        THIS DSECT DESCRIBES THE DIRECT ACCESS DEVICE DEPENDENT   */ 00457600
*/*        SECTION OF THE ERP WORKAREA.  IT IS INVOKED BY IECDERWA   */ 00473700
*/*        IF EWD IS SPECIFIED AS AN OPTION ON THE MACRO CALL.       */ 00489800
*/*                                                                  */ 00505900
*/* MODULE TYPE = MACRO                                              */ 00522000
*/*                                                                  */ 00538100
*/* CHANGE ACTIVITY =                                                */ 00554200
*/*                                                                  */ 00570300
*/* $L1=32SB,JDP2223,,STLRDB: 32 SENSE BYTE ERP RESTRUCTURE      @L1A*/ 00602500
*/* $L2=    ,JDP2231,,STLRDB: SUBSYSTEM SUPPORT                  @L2A*/ 00634700
*/* $L3=JDP2232,,STLJAH: 3990-3 LONG BUSY SUPPORT                @L3A*/ 00650800
*/* $L4=JDP3311,,STLJAH: ECKD-32 SUPPORT                         @L4A*/ 00658800
*/* $01=OY20602,HDP3310,C/TKNH: EWDSCCHH MISDECLARED             @01A*/ 00662800
*/* $02=OY46861,HDP3330,SJPLJAH: DEFINE EWDRCSW                  @02A*/ 00664800
*/* $03=OY47348,HDP3330,SJPLJAH: ADD FAILDPLX                    @03A*/ 00665800
*/* $L5=EUREKA,JDZ1110,SJPLJAH: DEFINE EWDSKADR                  @L5A*/ 00666300
*/* $04=OW00697,HDZ11B0,SJPLJAH: ADD EWDSKCC AND EWDSKH1/H2      @04A*/ 00666600
*/* $05=OW05063,HDZ11B0,SJPLSYW: ADD EWDUNREL                    @05A*/ 00666700
*/* $L6=       ,HDZ11C0,SJPLJAH: ADD CCW PARM LIST TO IOS000I    @L6A*/ 00670700
*/*                              MSG FOR CMD REJ                 @L6A*/ 00674700
*/* $06=OW17165,HDZ11C0,SJPLSYW: BECOME SHIPPED MACRO            @06A*/ 00676700
*/* $07=OW20231,HDZ11C0,SJPLHGS: ADDITION TO INVALID PLIST       @07A*/ 00677300
*/*                              WHEN CMD REJ                    @07A*/ 00677900
*/*                                                                  */ 00678700
*/* $08=OW26212,HDZ11C0,SJPLHGS: ADD ERP RETRY LOOP COUNT        @08A*/ 00680800
*/* $09=SHARK,HDZ11E0,SJPLJAH: ADD SUPPORT FOR IECVDER4          @09A*/ 00681900
*/* $10=OW40105,HDZ11E0,SJPLJBC: SAVE EWDPFCMD FOR SIO EXIT      @10A*/ 00682400
*/* $11=OW43935,HDZ11F0,SJPLHGS: PROVIDE TRACE OF SENSE DATA     @11A*/ 00682690
*/* $12=OW44404,HDZ11F0,SJPLHGS: MISC CHANGES TO SENSE TRACE     @12A*/ 00682780
*/* $13=OW51461,HDZ11F0,SJPLHGS: SUPPORT FOR NRF FIX             @13A*/ 00682870
*/********************************************************************/ 00683000
*@LIST PUSH;                                                            00699100
*@LIST OFF;                                                             00715200
*/*                                                                     00731300
         ORG  EWAIERP                                                   00769800
EWADAREA EQU   *                        START OF DASD EWA SECTION       00808300
EWDASNS  DS    CL32                     SENSE INFO                      00846800
         ORG   EWADAREA+0                                               00885300
EWDSNS0  DS    XL1                      SENSE BYTE 0                    00923800
EWDCREJ  EQU   B'10000000'              COMMAND REJECT                  00962300
EWDINT   EQU   B'01000000'              INTERVENTION REQUIRED           01000800
EWDBUSO  EQU   B'00100000'              BUS OUT CHECK                   01039300
EWDEQU   EQU   B'00010000'              EQUIPMENT CHECK                 01077800
EWDDATA  EQU   B'00001000'              DATA CHECK                      01116300
EWDOVRN  EQU   B'00000100'              OVERRUN                         01154800
EWDTCC   EQU   B'00000010'              TRACK CONDITION CHECK           01193300
EWDSKCK  EQU   B'00000001'              SEEK CHECK                      01231800
EWDSNS1  DS    XL1                      SENSE BYTE 1                    01270300
EWDPERM  EQU   B'10000000'              PERMANENT ERROR                 01308800
EWDTVRN  EQU   B'01000000'              TRACK OVERRUN                   01347300
EWDEOC   EQU   B'00100000'              END OF CYLINDER                 01385800
EWDMSG   EQU   B'00010000'              MESSAGE REQUIRED                01424300
EWDNRF   EQU   B'00001000'              NO RECORD FOUND                 01462800
EWDFP    EQU   B'00000100'              FILE PROTECT                    01501300
EWDMAM   EQU   B'00000010'              MISSING ADDR MARKER             01539800
EWDINHI  EQU   B'00000010'              WRITE INHIBIT                   01578300
EWDOFLO  EQU   B'00000001'              OVERFLOW/OP INCOMPLETE          01616800
EWDIMP32 EQU   B'00000001'              ECKD-32 IMPRECISE END      @L4A 01636000
EWDSNS2  DS    XL1                      SENSE BYTE 2                    01655300
EWDZLOG  EQU   B'10000000'              2305 LOG                        01693800
EWDWRPS  EQU   B'10000000'              RPS FEATURE                     01732300
EWDMDA1  EQU   B'10000000'              MEDIA ERROR                     01770800
EWDINHRQ EQU   B'10000000'              WRITE INHIBIT REQUIRED          01809300
EWDCORR  EQU   B'01000000'              CORRECTABLE DATA CHECK          01847800
EWDMDA2  EQU   B'00100000'              MEDIA ERROR                     01886300
EWDEDAT  EQU   B'00010000'              ENVIRONMENTAL DATA PRESENT      01924800
EWDINTNT EQU   B'00001000'              INVALID INTENT ON LOC           01963300
EWDSEMUL EQU   B'00001000'              EMULATION                       02001800
EWDIMPED EQU   B'00000100'              IMPRECISE ENDING                02040300
EWDWRITE EQU   B'00000010'              WRITE IN PROGRESS               02078800
EWDSNS3  DS    XL1                      SENSE BYTE 3                    02117300
EWDSNS4  DS    XL1                      SENSE BYTE 4                    02155800
EWDDPS   EQU   B'10000000'              DYNAMIC PATH FEATURE            02194300
EWDMODDE EQU   B'01000000'              MODEL D OR E                    02232800
EWDPPE   EQU   B'00100000'              PERMANENT PATH ERROR            02271300
EWDSKADR DS    XL2                      SEEK ADDRESS             @L5A   02284100
         ORG   EWADAREA+5                                        @L5A   02296900
EWDSNS5  DS    XL1                      SENSE BYTE 5                    02309800
EWDSNS6  DS    XL1                      SENSE BYTE 6                    02348300
EWDFMT32 EQU   B'00001111'              ECKD-32 SENSE FORMAT     @L4A   02367500
EWDSNS7  DS    XL1                      SENSE BYTE 7                    02386800
EWDSNFMT EQU   B'11110000'              SENSE FORMAT                    02425300
EWDSCCHH DS    CL4                      RECORD ID                 @01M  02438100
         ORG   EWADAREA+8                                         @01C  02450900
EWDSNS8  DS    XL1                      SENSE BYTE 8                    02463800
EWDSNS9  DS    XL1                      SENSE BYTE 9                    02579300
EWDSIMRP EQU   B'10000000'              REPEAT SIM MESSAGE              02617800
EWDSNS10 DS    XL1                      SENSE BYTE 10                   02656300
EWDUNREL EQU   B'01000000'              ERROR UNRELATED TO DEVICE @05A  02675500
EWDDMCHK EQU   B'00001100'              DATA MODULE SEQUENCE CHECK      02694800
EWDSNS11 DS    XL1                      SENSE BYTE 11                   02733300
EWDSNS12 DS    XL1                      SENSE BYTE 12                   02771800
EWDSNS13 DS    XL1                      SENSE BYTE 13                   02810300
EWDSNS14 DS    XL1                      SENSE BYTE 14                   02848800
EWDNRD   EQU   B'00010000'              NON RETENTIVE DATA SUPPORTED    02887300
EWDSIMSN DS    CL5                      SIM SERIAL NUMBER FIELDS        02925800
         ORG   EWADAREA+15                                              02964300
EWDSRDSP DS    CL3                      ECC RESTART DISPLACEMENT        03002800
         ORG   EWADAREA+15                                              03041300
EWDSNS15 DS    XL1                      SENSE BYTE 15                   03079800
EWDSNS16 DS    XL1                      SENSE BYTE 16                   03118300
EWDSNS17 DS    XL1                      SENSE BYTE 17                   03156800
EWDSBDSP DS    CL2                      ECC BACKWARD DISPLACEMENT       03195300
         ORG   EWADAREA+18                                              03233800
EWDSNS18 DS    XL1                      SENSE BYTE 18                   03272300
EWDSNS19 DS    XL1                      SENSE BYTE 19                   03310800
EWDSNECC DS    CL3                      ECC RESTART DISPLACEMENT        03349300
         ORG   EWADAREA+20                                              03387800
EWDSNS20 DS    XL1                      SENSE BYTE 20                   03426300
EWDSNS21 DS    XL1                      SENSE BYTE 21                   03464800
EWDSNS22 DS    XL1                      SENSE BYTE 22                   03503300
EWDSNS23 DS    XL1                      SENSE BYTE 23                   03541800
EWDSCUDL EQU   B'00000001'              CNTL UNIT DETECTED INCORR      X03580300
                                        LENGTH                          03618800
EWDSNS24 DS    XL1                      SENSE BYTE 24                   03657300
EWDSNS25 DS    XL1                      SENSE BYTE 25                   03695800
         ORG   EWADAREA+25                                              03734300
EWDPROG  DS    XL1                      PROGRAMMING ACTION CODE         03772800
EWDSNS26 DS    XL1                      SENSE BYTE 26                   03811300
EWDSNS27 DS    XL1                      SENSE BYTE 27                   03849800
EWD24    EQU   B'10000000'              24 BYTE COMPATIBILITY MODE      03888300
EWDSNS28 DS    XL1                      SENSE BYTE 28                   03926800
EWDSIM   EQU   B'10000000'              SENSE IS FOR A SIM RECORD       03965300
EWDSNS29 DS    XL1                      SENSE BYTE 29                   04003800
EWDSNS30 DS    XL1                      SENSE BYTE 30                   04042300
EWDSNS31 DS    XL1                      SENSE BYTE 31                   04080800
EWDXPTR  DS    A                        EXTENDED EWA PTR                04119300
EWDSAV13 DS    CL4                      REG 13 SAVE AREA FOR GETBLOK    04157800
EWDSAVE  DS    CL72                                                     04196300
         ORG   EWADAREA+40                                              04234800
EWDRSAVE DS    18A       DIMENSION=(18)  18 WORD SAVE AREA FOR GETBLOK  04273300
EWDVOLSR DS    CL6                      VOLSER                          04311800
EWDHOMAD DS    CL6                      FCCHHR                          04350300
         ORG   EWADAREA+118                                             04388800
EWDHAFLG DS    XL1                      FLAG BYTE                       04427300
EWDHA0   EQU   B'10000000'              RESERVED                        04465800
EWDHA1   EQU   B'01000000'              RESERVED                        04504300
EWDHA2   EQU   B'00100000'              RESERVED                        04542800
EWDHA3   EQU   B'00010000'              RESERVED                        04581300
EWDHA4   EQU   B'00001000'              RESERVED                        04619800
EWDHA5   EQU   B'00000100'              RESERVED                        04658300
EWDHADEF EQU   B'00000010'              DEFECTIVE TRACK                 04696800
EWDHAALT EQU   B'00000001'              ALTERNATE TRACK                 04735300
EWDCCHH  DS    CL4                      CCHH RETURNED BY RHA            04773800
         ORG   EWADAREA+119                                      @04A   04781500
EWDSKCC  DS    CL2                      CYLINDER NUMBER          @04A   04789200
EWDSKH1  DS    CL1                      HEAD NUMBER              @04A   04796900
EWDSKH2  DS    CL1                      HEAD NUMBER              @04A   04804600
EWDHARNO DS    AL1                      RECORD NUMBER                   04812300
EWDSNST  DS    A                        PTR TO SENSE TRACE       @11C   04850800
EWDX     DS    CL56                     EXTENDED EWA                    04889300
         ORG   EWADAREA+128                                             04927800
EWDERCCW DS    CL8                      ERROR CCW IN FORMAT 1           04966300
EWDER2WA DS    A                        IECVDER2 MODULE STORAGE AREA    05004800
EWDLOGWA DS    A                        IECVDLOG MODULE STORAGE AREA    05043300
EWDERPWA DS    A                        IECVDERP MODULE STORAGE AREA    05081800
EWDMSGWA DS    A                        IECVDMSG MODULE STORAGE AREA    05120300
EWDPCB   DS    A                        PATH CONTROL BLOCK              05158800
EWDOBR   DS    A                        OBR RECORD                      05197300
EWDCCWWA DS    A                        ADDRESS OF CHANNEL PGM WORK    X05235800
                                        AREA                            05274300
EWDFOOTP DS    A                        EXECUTING MODULES FOOTPRINT    X05312800
                                        ADDR                            05351300
EWDCSECT DS    A                        EXECUTING MODULES CSECT DATA    05389800
EWDPARMS DS    CL4                      ERP MODULE FUNCTION PARMS       05428300
         ORG   EWADAREA+172                                             05466800
EWDDER2P DS    CL1                      PATHING MODULE PARM             05505300
EWDLOGP  DS    CL1                      LOGGING MODULE PARM             05543800
EWDMSGP  DS    CL1                      MESSAGE MODULE PARM             05582300
         DS    CL1                      UNUSED                          05620800
EWDRZRO  DS    CL4                                                      05659300
         DS    CL1                                                      05697800
EWDFIRST EQU   B'11110000'              FIRST ENTRY SWITCHES            05736300
EWDER2FT EQU   B'10000000'              IECVDER2 FIRST ENTRY FLAG       05774800
EWDLOGFT EQU   B'01000000'              IECVDLOG FIRST ENTRY FLAG       05813300
EWDMSGFT EQU   B'00100000'              IECVDMSG FIRST ENTRY FLAG       05851800
EWDFLAGM DS    XL1                      MISCELANEOUS FLAGS       @08C   05890300
EWDNVARY EQU   B'10000000'              DONT VARY PATHS OFFLINE         05928800
EWDRCSW  EQU   B'01000000'              RESTORE CSW              @02A   05948000
EWDPLCOP EQU   B'00100000'              INVALID PLIST COPIED     @07A   05959500
EWD32SNS EQU   B'00010000'              ECKD32 FORMAT SENSE      @07A   05971000
EWDMAXCT EQU   B'00001000'              ERP RETRIES > 2048       @08A   05976700
EWDSTRCE EQU   B'00000100'              SNS TRACE BUFF ADD GOOD  @11C   05978690
EWDPLCNT DS    CL1                      COUNT OF INVALID PLIST   @07A   05982500
EWDPFCMD DS    CL1                      CCW CMD ON FAILED PREFIX @10C   05994100
EWDEND   DS    0C                       REST OF EWA BELONGS TO IOS      06005800
         MEND                                                           06027900
**/                                                                     06050000
*@LIST POP;                                                             06100000
*                                                                       06150000
* DCL                                                                   06192300
* 1 EWADAREA     CHAR(LENGTH(EWAIERP)) DEF(EWAIERP),                    06234600
*  2 EWDASNS     CHAR(32),     /* SENSE INFO                         */ 06276900
*   3 EWDSNS0      BIT(8),     /* SENSE BYTE 0                       */ 06319200
*    4 EWDCREJ     BIT(1),     /* COMMAND REJECT                     */ 06361500
*    4 EWDINT      BIT(1),     /* INTERVENTION REQUIRED              */ 06403800
*    4 EWDBUSO     BIT(1),     /* BUS OUT CHECK                      */ 06446100
*    4 EWDEQU      BIT(1),     /* EQUIPMENT CHECK                    */ 06488400
*    4 EWDDATA     BIT(1),     /* DATA CHECK                         */ 06530700
*    4 EWDOVRN     BIT(1),     /* OVERRUN                            */ 06573000
*    4 EWDTCC      BIT(1),     /* TRACK CONDITION CHECK              */ 06615300
*    4 EWDSKCK     BIT(1),     /* SEEK CHECK                         */ 06657600
*                                                                       06700000
*   3 EWDSNS1      BIT(8),     /* SENSE BYTE 1                       */ 06750000
*    4 EWDPERM     BIT(1),     /* PERMANENT ERROR                    */ 06800000
*    4 EWDTVRN     BIT(1),     /* TRACK OVERRUN                      */ 06850000
*    4 EWDEOC      BIT(1),     /* END OF CYLINDER                    */ 06900000
*    4 EWDMSG      BIT(1),     /* MESSAGE REQUIRED                   */ 06950000
*    4 EWDNRF      BIT(1),     /* NO RECORD FOUND                    */ 07000000
*    4 EWDFP       BIT(1),     /* FILE PROTECT                       */ 07050000
*    4 EWDMAM      BIT(1),     /* MISSING ADDR MARKER                */ 07100000
*     5 EWDINHI    BIT(1),     /* WRITE INHIBIT                      */ 07150000
*    4 EWDOFLO     BIT(1),     /* OVERFLOW/OP INCOMPLETE             */ 07200000
*     5 EWDIMP32   BIT(1),     /* ECKD-32 IMPRECISE END         @L4A */ 07225000
*                                                                       07250000
*   3 EWDSNS2      BIT(8),     /* SENSE BYTE 2                       */ 07289200
*    4 EWDZLOG     BIT(1),     /* 2305 LOG                           */ 07328400
*     5 EWDWRPS    BIT(1),     /* RPS FEATURE                        */ 07367600
*      6 EWDMDA1   BIT(1),     /* MEDIA ERROR                        */ 07406800
*       7 EWDINHRQ BIT(1),     /* WRITE INHIBIT REQUIRED             */ 07446000
*    4 EWDCORR     BIT(1),     /* CORRECTABLE DATA CHECK             */ 07485200
*    4 EWDMDA2     BIT(1),     /* MEDIA ERROR                        */ 07524400
*    4 EWDEDAT     BIT(1),     /* ENVIRONMENTAL DATA PRESENT         */ 07563600
*    4 EWDINTNT    BIT(1),     /* INVALID INTENT ON LOC              */ 07602800
*     5 EWDSEMUL   BIT(1),     /* EMULATION                          */ 07642000
*    4 EWDIMPED    BIT(1),     /* IMPRECISE ENDING                   */ 07681200
*    4 EWDWRITE    BIT(1),     /* WRITE IN PROGRESS                  */ 07720400
*    4    *        BIT(1),     /* RESERVED                           */ 07759600
*                                                                       07800000
*   3 EWDSNS3      BIT(8),     /* SENSE BYTE 3                       */ 07844100
*   3 EWDSNS4      BIT(8),     /* SENSE BYTE 4                       */ 07888200
*    4 EWDDPS      BIT(1),     /* DYNAMIC PATH FEATURE               */ 07932300
*    4 EWDMODDE    BIT(1),     /* MODEL D OR E                       */ 07976400
*    4 EWDPPE      BIT(1),     /* PERMANENT PATH ERROR               */ 08020500
*   3 EWDSKADR     BIT(16),    /* SEEK ADDRESS                   @L5A*/ 08042500
*    4 EWDSNS5     BIT(8),     /* SENSE BYTE 5                   @L5C*/ 08064500
*    4 EWDSNS6     BIT(8),     /* SENSE BYTE 6                   @L5C*/ 08086500
*     5    *       BIT(4),     /*                                @L5C*/ 08108500
*     5 EWDFMT32   BIT(4),     /* ECKD-32 SENSE FORMAT           @L5C*/ 08130500
*   3 EWDSNS7      BIT(8),     /* SENSE BYTE 7                       */ 08152800
*    4 EWDSNFMT    BIT(4),     /* SENSE FORMAT                       */ 08196900
*    4    *        BIT(4),                                              08241000
*   3 EWDSCCHH    CHAR(4),     /* RECORD ID                      @01M*/ 08285100
*    4 EWDSNS8     BIT(8),     /* SENSE BYTE 8                   @01C*/ 08329200
*    4 EWDSNS9     BIT(8),     /* SENSE BYTE 9                       */ 08373300
*     5 EWDSIMRP   BIT(1),     /* REPEAT SIM MESSAGE                 */ 08417400
*    4 EWDSNS10    BIT(8),     /* SENSE BYTE 10                      */ 08461500
*     5   *        BIT(1),     /*                                @05A*/ 08483500
*     5 EWDUNREL   BIT(1),     /* ERROR UNRELATED TO DEVICE      @05A*/ 08505500
*     5   *        BIT(2),     /*                                @05C*/ 08527500
*     5 EWDDMCHK   BIT(2),     /* DATA MODULE SEQUENCE CHECK         */ 08549700
*     5   *        BIT(2),                                              08593800
*    4 EWDSNS11    BIT(8),     /* SENSE BYTE 11                      */ 08637900
*   3 EWDSNS12     BIT(8),     /* SENSE BYTE 12                  @01C*/ 08682000
*   3 EWDSNS13     BIT(8),     /* SENSE BYTE 13                      */ 08726100
*   3 EWDSNS14     BIT(8),     /* SENSE BYTE 14                      */ 08770200
*    4    *        BIT(3),                                              08814300
*    4 EWDNRD      BIT(1),     /* NON-RETENTIVE DATA SUPPORTED       */ 08858400
*   3 EWDSIMSN    CHAR(5),     /* SIM SERIAL NUMBER FIELDS           */ 08902500
*    4 EWDSRDSP   CHAR(3),     /* ECC RESTART DISPLACEMENT           */ 08946600
*     5 EWDSNS15   BIT(8),     /* SENSE BYTE 15                      */ 08990700
*     5 EWDSNS16   BIT(8),     /* SENSE BYTE 16                      */ 09034800
*     5 EWDSNS17   BIT(8),     /* SENSE BYTE 17                      */ 09078900
*    4 EWDSBDSP   CHAR(2),     /* ECC BACKWARD DISPLACEMENT          */ 09123000
*     5 EWDSNS18   BIT(8),     /* SENSE BYTE 18                      */ 09167100
*     5 EWDSNS19   BIT(8),     /* SENSE BYTE 19                      */ 09211200
*   3 EWDSNECC    CHAR(3),     /* ECC RESTART DISPLACEMENT           */ 09255300
*    4 EWDSNS20    BIT(8),     /* SENSE BYTE 20                      */ 09299400
*    4 EWDSNS21    BIT(8),     /* SENSE BYTE 21                      */ 09343500
*    4 EWDSNS22    BIT(8),     /* SENSE BYTE 22                      */ 09387600
*   3 EWDSNS23     BIT(8),     /* SENSE BYTE 23                      */ 09431700
*    4    *        BIT(7),                                              09475800
*    4 EWDSCUDL    BIT(1),     /* CNTL UNIT DETECTED INCORR LENGTH   */ 09519900
*   3 EWDSNS24     BIT(8),     /* SENSE BYTE 24                      */ 09564000
*    4 *           BIT(3),     /* RESERVED                       @L4A*/ 09572800
*    4 EWDLOGM     BIT(1),     /* LOGGING MODE                   @L4A*/ 09581600
*    4 EWDLAC      BIT(2),     /* LOGGING ACTION CODE            @L4A*/ 09590400
*    4 EWDMAC      BIT(2),     /* MESSAGE ACTION CODE            @L4A*/ 09599200
*   3 EWDSNS25     BIT(8),     /* SENSE BYTE 25                      */ 09608100
*    4 EWDPROG     BIT(8),     /* PROGRAMMING ACTION CODE            */ 09652200
*      5 EWDCPAC   BIT(1),     /* COMPOUND PROGRAM ACTION CODE   @L4A*/ 09658500
*      5 EWDCPAC1  BIT(1),     /* CPAC MODIFIED BY SENSE 26-27   @L4A*/ 09664800
*      5 EWDCPAC2  BIT(1),     /* CPAC MODIFIED BY SENSE 28      @L4A*/ 09671100
*      5 EWDCPACP  BIT(1),     /* CPAC ALTERNATE PATH RETRY OK   @L4A*/ 09677400
*      5 *         BIT(2),     /* RESERVED                       @L4A*/ 09683700
*      5 EWDCPACR  BIT(2),     /* CPAC RETRY COUNT               @L4A*/ 09690000
*   3 EWDSNS26     BIT(8),     /* SENSE BYTE 26                      */ 09696300
*    4 *           BIT(2),     /*                                @L2A*/ 09703600
*    4 EWDDUPLX    BIT(1),     /* DUPLEX PAIR VOLUME             @L2A*/ 09711000
*    4 EWDSECND    BIT(1),     /* SECONDARY DEVICE OF DUPLEX     @L2A*/ 09715900
*    4 *           BIT(4),     /*                                @L2A*/ 09728100
*   3 EWDSNS27     BIT(8),     /* SENSE BYTE 27                      */ 09740400
*    4 EWD24       BIT(1),     /* 24 BYTE COMPATIBILITY MODE         */ 09784500
*   3 EWDSNS28     BIT(8),     /* SENSE BYTE 28                      */ 09828600
*    4 EWDSIM      BIT(1),     /* SENSE IS FOR A SIM RECORD          */ 09872700
*   3 EWDCYL       BIT(16),    /* CYLINDER ADDRESS               @L4A*/ 09902200
*    4 EWDSNS29    BIT(8),     /* SENSE BYTE 29                  @L4C*/ 09931700
*    4 EWDSNS30    BIT(8),     /* SENSE BYTE 30                  @L4C*/ 09961200
*   3 EWDHEAD      BIT(8),     /* HEAD ADDRESS                   @L4A*/ 09990700
*    4 EWDSNS31    BIT(8),     /* SENSE BYTE 31                  @L4C*/ 10020200
*                                                                       10050000
*  2 EWDXPTR    PTR(31),       /* EXTENDED EWA PTR                   */ 10100000
*  2 EWDSAV13   CHAR(4),       /* REG 13 SAVE AREA FOR GETBLOK       */ 10150000
*  2 EWDSAVE   CHAR(72) BDY(WORD),                                      10200000
*   3 EWDRSAVE(18) PTR(31),    /* 18 WORD SAVE AREA FOR GETBLOK      */ 10250000
*  2 EWDVOLSR   CHAR(6),       /* VOLSER                             */ 10300000
*  2 EWDHOMAD   CHAR(6),       /* FCCHHR                             */ 10350000
*   3 EWDHAFLG   BIT(8),       /* FLAG BYTE                          */ 10400000
*    4 EWDHA0    BIT(1),       /* RESERVED                           */ 10450000
*    4 EWDHA1    BIT(1),       /* RESERVED                           */ 10500000
*    4 EWDHA2    BIT(1),       /* RESERVED                           */ 10550000
*    4 EWDHA3    BIT(1),       /* RESERVED                           */ 10600000
*    4 EWDHA4    BIT(1),       /* RESERVED                           */ 10650000
*    4 EWDHA5    BIT(1),       /* RESERVED                           */ 10700000
*    4 EWDHADEF  BIT(1),       /* DEFECTIVE TRACK                    */ 10750000
*    4 EWDHAALT  BIT(1),       /* ALTERNATE TRACK                    */ 10800000
*   3 EWDCCHH   CHAR(4),       /* CCHH RETURNED BY RHA               */ 10850000
*    4 EWDSKCC   CHAR(2),      /* CYLINDER NUMBER                @04A*/ 10862500
*    4 EWDSKH1   CHAR(1),      /* HEAD NUMBER                    @04A*/ 10875000
*    4 EWDSKH2   CHAR(1),      /* HEAD NUMBER                    @04A*/ 10887500
*   3 EWDHARNO   PTR(8),       /* RECORD NUMBER                      */ 10900000
*  2  EWDSNST    PTR(31),      /* PTR TO BLOCK WITH SENSE TRACE  @11C*/ 10950000
*  2 EWDX      CHAR(56) BDY(DWORD), /* EXTENDED EWA                  */ 11000000
*   3 EWDERCCW  CHAR(8) BDY(DWORD), /* ERROR CCW IN FORMAT 1         */ 11050000
*   3 EWDER2WA  PTR(31),       /* IECVDER2 MODULE STORAGE AREA       */ 11100000
*   3 EWDLOGWA  PTR(31),       /* IECVDLOG MODULE STORAGE AREA       */ 11150000
*   3 EWDERPWA  PTR(31),       /* IECVDERP MODULE STORAGE AREA       */ 11200000
*   3 EWDMSGWA  PTR(31),       /* IECVDMSG MODULE STORAGE AREA       */ 11250000
*   3 EWDER3WA  PTR(31),       /* IECVDER3 MODULE STORAGE AREA   @L4C*/ 11300000
*   3 EWDER4WA  PTR(31),       /* IECVDER4 MODULE STORAGE AREA   @09A*/ 11350000
*   3 EWDCCWWA  PTR(31),       /* ADDRESS OF CHANNEL PGM WORK AREA   */ 11400000
*   3 EWDFOOTP  PTR(31),       /* EXECUTING MODULES FOOTPRINT ADDR   */ 11450000
*   3 EWDCSECT  PTR(31),       /* EXECUTING MODULES CSECT DATA       */ 11500000
*   3 EWDPARMS  CHAR(4),       /* ERP MODULE FUNCTION PARMS          */ 11550000
*    4 EWDDER2P CHAR(1),       /* PATHING MODULE PARM                */ 11600000
*    4 EWDLOGP  CHAR(1),       /* LOGGING MODULE PARM                */ 11650000
*    4 EWDMSGP  CHAR(1),       /* MESSAGE MODULE PARM                */ 11700000
*    4 EWDDER3P CHAR(1),       /* IECVDER3 MODULE PARM           @L4C*/ 11750000
* ! 3 EWDRZRO   CHAR(4),                                         @13D   11809990
*   3 D34PTR    PTR(31),       !  PTR TO PARMS FOR DER3 AND DER4 @13C   11819980
*   3    *      CHAR(1),                                                11850000
*    4 EWDFIRST  BIT(5),       /* FIRST ENTRY SWITCHES               */ 11900000
*     5 EWDER2FT BIT(1),       /* IECVDER2 FIRST ENTRY FLAG          */ 11950000
*     5 EWDLOGFT BIT(1),       /* IECVDLOG FIRST ENTRY FLAG          */ 12000000
*     5 EWDMSGFT BIT(1),       /* IECVDMSG FIRST ENTRY FLAG          */ 12050000
*     5 EWDER3FT BIT(1),       /* IECVDER3 FIRST ENTRY FLAG      @L4C*/ 12100000
*     5 EWDER4FT BIT(1),       /* IECVDER4 FIRST ENTRY FLAG      @09A*/ 12133300
*    4   *       BIT(3),       /* UNUSED                             */ 12166600
*   3  EWDFLAGM  BIT(8),       /* MISCELANEOUS FLAGS             @08C*/ 12200000
*    4 EWDNVARY  BIT(1),       /* DONT VARY PATHS OFFLINE            */ 12250000
*    4 EWDRCSW   BIT(1),       /* RESTORE CSW                    @02A*/ 12283300
*    4 EWDPLCOP  BIT(1),       /* INVALID PLIST COPIED           @L6A*/ 12299900
*    4 EWD32SNS  BIT(1),       /* ECKD32 FORMAT SENSE            @L6A*/ 12316500
*    4 EWDMAXCT  BIT(1),       /* ERP RETRIES > 2048             @08A*/ 12329400
*    4 EWDSTRCE  BIT(1),       /* SNS BYTE TRACE BUFF ADD GOOD   @11C*/ 12346290
*    4   *       BIT(2),       /* UNUSED                         @11C*/ 12350280
*   3  EWDPLCNT CHAR(1),       /* COUNT OF INVALID PLIST         @07C*/ 12355400
*   3  EWDPFCMD CHAR(1),       /* CCW CMD ON FAILED PREFIX       @10C*/ 12377700
*   3 EWDEND    CHAR(0);       /* REST OF EWA BELONGS TO IOS         */ 12400000
*                                                                       12450000
*/********************************************************************/ 12500000
*/*                                                                  */ 12550000
*/*     FUNCTION CODES USED FOR CALLS BETWEEN DASD ERP MODULES       */ 12600000
*/*                                                                  */ 12650000
*/********************************************************************/ 12700000
*  DCL                               /* MESSAGE CODES FOR IECVDMSG   */ 12750000
*  MSG466I  BIT(8) CONSTANT('01'X),  /* PERM PATH ERROR DETECTED     */ 12800000
*  MSG467CN BIT(8) CONSTANT('02'X),  /* WRITE INHIBITED CONTROLLER   */ 12850000
*  MSG467CH BIT(8) CONSTANT('03'X),  /* WRITE INHIBITED CHANNEL      */ 12900000
*  MSG467SD BIT(8) CONSTANT('04'X),  /* WRITE INHIBITED STORAGE DIR  */ 12950000
*  MSG468I  BIT(8) CONSTANT('05'X),  /* WRITE INHIBITED PATH FOUND   */ 13000000
*  MSG469OK BIT(8) CONSTANT('06'X),  /* PATH VARIED OFFLINE          */ 13050000
*  MSG469FA BIT(8) CONSTANT('07'X),  /* FAILED TO VARY PATH OFFLINE  */ 13100000
*  MSG467F  BIT(8) CONSTANT('09'X),  /* WRITE INHIBIT FAILED         */ 13150000
*  MSG449R  BIT(8) CONSTANT('0A'X),  /* RESET WRITE PROTECT SW       */ 13200000
*  MSGFDUPX BIT(8) CONSTANT('0B'X),  /* FAIL DUPLEX SUCCESS MSG  @L2A*/ 13225000
*  MSGSIM   BIT(8) CONSTANT('A3'X),  /* SIM MESSAGE                  */ 13250000
*  MSGEDP   BIT(8) CONSTANT('FF'X),  /* MTO ENVIRONMENTAL DATA MSG   */ 13300000
*  MSGLBUSY BIT(8) CONSTANT('1D'X);  /* LONG BUSY MESSAGE        @L3A*/ 13350000
*/********************************************************************/ 13400000
*/*                                                                  */ 13450000
*/*     FUNCTION CODES USED FOR CALLS TO IECVDER2                    */ 13500000
*/*                                                                  */ 13550000
*/********************************************************************/ 13600000
*  DCL                                                                  13650000
*  RTRNCK  BIT(8) CONSTANT('01'X),  /* ROUTINE RTRNCHCK              */ 13700000
*  PTHPICK BIT(8) CONSTANT('02'X),  /* ROUTINE PATHPICK              */ 13750000
*  PTHPERM BIT(8) CONSTANT('03'X),  /* ROUTINE PATHPERM              */ 13800000
*  PTHOK   BIT(8) CONSTANT('04'X),  /* ROUTINE PATHOK                */ 13850000
*  PTHEQCK BIT(8) CONSTANT('05'X),  /* ROUTINE PATHEQCK              */ 13900000
*  RDBUFF  BIT(8) CONSTANT('06'X),  /* ROUTINE READBUFF              */ 13910000
*  FAILDPLX BIT(8) CONSTANT('07'X), /* ROUTINE FAILDUPX          @03A*/ 13940000
*  INVPLIST BIT(8) CONSTANT('08'X); /* ROUTINE INVALPL           @L6A*/ 13970000
*                                                                       14000000
*/********************************************************************/ 14050000
*/*                                                                  */ 14100000
*/*     FUNCTION CODES USED FOR CALLS TO IECVDER3                @L4A*/ 14105000
*/*                                                                  */ 14110000
*/********************************************************************/ 14115000
*  DCL                                                                  14120000
*  DER3UCHK BIT(8) CONSTANT('01'X), /* UNIT CHECK RECOVERY       @L4A*/ 14125000
*  DER3PERM BIT(8) CONSTANT('02'X); /* ERP EXITING WITH PERM ERR @L4A*/ 14130000
*                                                                       14135000
*/********************************************************************/ 14140000
*/*                                                                  */ 14145000
*/*     FUNCTION CODES USED FOR CALLS TO IECVDLOG                    */ 14150000
*/*                                                                  */ 14200000
*/********************************************************************/ 14250000
*  DCL                                                                  14300000
*  BLDOBR   BIT(8) CONSTANT('01'X), /* BUILD AN OBR RECORD           */ 14350000
*  TEMPERR  BIT(8) CONSTANT('02'X), /* LOG AS A TEMPORARY ERROR      */ 14400000
*  OBRPERM  BIT(8) CONSTANT('03'X), /* LOG AS A PERMANENT ERROR      */ 14450000
*  PERMPATH BIT(8) CONSTANT('04'X), /* MARK THE OBR AS PERM FOR PATH */ 14500000
*  LOG2305  BIT(8) CONSTANT('05'X), /* LOG AN MDR FOR 2305 BUFF LOG  */ 14533300
*  PERMDUPX BIT(8) CONSTANT('06'X); /* LOG A DUPLEX PRIMARY ERR  @L2A*/ 14566600
*                                                                       14600000
*/********************************************************************/ 14650000
*/*                                                                  */ 14700000
*/*     DEFINITIONS FOR EWA COUNTERS                                 */ 14750000
*/*                                                                  */ 14800000
*/********************************************************************/ 14850000
*  DCL                                                                  14900000
*  RETRYCNT FIXED(8) DEFINED(EWACNTR1), /* RETRY COUNTER             */ 14950000
*  RETRY255 FIXED(8) DEFINED(EWACNTR2); /* RETRY 255 COUNTER         */ 15000000
*                                                                       15050000
*/********************************************************************/ 15100000
*/*                                                                  */ 15150000
*/*     DEFINITIONS FOR EWALAC AND EWAMAC (LOGGING AND MSG ACTIONS)  */ 15151700
*/*                                                              @L4A*/ 15153400
*/********************************************************************/ 15155100
*  DCL                                                                  15156800
*  LACNO    BIT(2) CONSTANT('00'B),  /* NO LOGGING ACTION        @L4A*/ 15158500
*  LACALL   BIT(2) CONSTANT('01'B),  /* UNCONDITIONAL LOGGING    @L4A*/ 15160200
*  LACTEMP  BIT(2) CONSTANT('10'B),  /* LOG ONCE PER ERROR       @L4A*/ 15161900
*  LACPERM  BIT(2) CONSTANT('11'B);  /* LOG ONCE IF PERMANENT    @L4A*/ 15163600
*  DCL                                                                  15165300
*  MACNO    BIT(2) CONSTANT('00'B),  /* NO MESSAGE ACTION        @L4A*/ 15167000
*  MACALL   BIT(2) CONSTANT('01'B),  /* UNCONDITIONAL MESSAGE    @L4A*/ 15168700
*  MACTEMP  BIT(2) CONSTANT('10'B),  /* MSG ONCE PER ERROR       @L4A*/ 15170400
*  MACPERM  BIT(2) CONSTANT('11'B);  /* MSG ONCE IF PERMANENT    @L4A*/ 15172100
*                                                                       15173800
*/********************************************************************/ 15175500
*/*                                                                  */ 15177200
*/*     DEFINITIONS FOR EWDCPACR (COMPOUND ACTION RETRY COUNT)   @L4A*/ 15178900
*/*                                                                  */ 15180600
*/********************************************************************/ 15182300
*  DCL                                                                  15184000
*  CPACR0   BIT(2) CONSTANT('00'B),  /* NO RETRY                 @L4A*/ 15185700
*  CPACR2   BIT(2) CONSTANT('01'B),  /* RETRY 2 TIMES            @L4A*/ 15187400
*  CPACR10  BIT(2) CONSTANT('10'B),  /* RETRY 10 TIMES           @L4A*/ 15189100
*  CPACR255 BIT(2) CONSTANT('11'B);  /* RETRY 255 TIMES          @L4A*/ 15190800
*                                                                       15192500
*/********************************************************************/ 15194200
*/*                                                                  */ 15195900
*/*     FAULT SYMPTOM CODE SENSE                                     */ 15200000
*/*                                                                  */ 15250000
*/********************************************************************/ 15300000
*  DCL                                                                  15350000
*  1 EWDFSC    BIT(16) DEFINED(EWDSNS22),                               15400000
*   2 EWDFSC22  BIT(8),     /* SENSE BYTE 22                         */ 15450000
*    3 EWDLO22  BIT(4),                                                 15500000
*    3 EWDHI22  BIT(4),                                                 15550000
*   2 EWDFSC23  BIT(8),     /* SENSE BYTE 23                         */ 15600000
*    3 EWDLO23  BIT(4),                                                 15650000
*    3 EWDHI23  BIT(4);                                                 15700000
*                                                                       15750000
*/********************************************************************/ 15800000
*/*                                                              @L6A*/ 15850000
*/*     COPY DEFINE EXTENT OR LOCATE RECORD PARMLIST FOR IECLMSGD    */ 15900000
*/*                                                                  */ 15950000
*/********************************************************************/ 16000000
*  DCL                                                                  16050000
*  EWDPLIST  CHAR(72)  DEFINED(EWDSAVE);   /* COPY OF PLIST      @07C*/ 16100000
*                                                                       16150000
*/********************************************************************/ 16200000
*/*     CHANNEL PROGRAM WORK AREA                                    */ 16250000
*/*      THIS BLOCK WAS MOVED FROM IECVDERP                      @L6A*/ 16300000
*/********************************************************************/ 16350000
* DECLARE                                                               16400000
*  1 CHPWA    CHAR(248) BDY(DWORD) BASED(EWDCCWWA),                     16450000
*   2     *     PTR(31),            /* LINK FIELD                    */ 16500000
*   2 CHPWAID   CHAR(4),            /* CHANNEL PROGRAM AREA ID       */ 16550000
*   2 CHPBODY CHAR(240) BDY(DWORD), /* CHANNEL PROGRAM WORK AREA     */ 16600000
*    3     *           ,            /* ERP CHANNEL PGM BUILD AREA    */ 16650000
*     5 CHPCCW1 CHAR(8),            /*                               */ 16700000
*     5 CHPCCW2 CHAR(8),            /*                               */ 16750000
*     5 CHPCCW3 CHAR(8),            /*                               */ 16800000
*     5 CHPCCW4 CHAR(8),            /*                               */ 16850000
*     5 CHPCCW5 CHAR(8),            /*                               */ 16900000
*    3 DEPCCW1  CHAR(8),            /* DEFINE EXTENT PREFIX CCW1     */ 16950000
*    3 DEPCCW2  CHAR(8),            /* DEFINE EXTENT PREFIX CCW2     */ 17000000
*    3 DEPCCW3  CHAR(8),            /* DEFINE EXTENT PREFIX CCW3     */ 17050000
*    3 DEPCCW4  CHAR(8),            /* DEFINE EXTENT PREFIX CCW4     */ 17100000
*    3 CCWWORK  CHAR(8),            /* TEMP WORK AREA FOR CONV0TO1   */ 17150000
*    3 DEPSRCH  PTR(31),            /* POINTER TO AERCH CCW          */ 17200000
*    3 DEPTICDA PTR(31),            /* TIC DATA ADDRESS              */ 17250000
*    3 DEPVST   PTR(31),            /* VIRTUAL START C P             */ 17300000
*    3 SAVECSW  CHAR(8),            /* SAVE CSW WHEN ERP BUILDS CP   */ 17350000
*    3 SAVESNS  CHAR(2),            /* SAVE SENSE WHEN ERP BUILDS CP */ 17400000
*    3 DEPLRD  CHAR(16),            /* LOCATE RECORD DATA AREA       */ 17450000
*    3 SNSARG   CHAR(5),            /* SEARCH ARGUMENT FROM SENSE    */ 17500000
*    3 RHADUMMY CHAR(5),            /* RHA READ INTO AREA            */ 17550000
*    3 READCNT  CHAR(1),            /* TARGET DATA AREA FOR READ COUNT  17600000
*                                      CCW BUILT BY CPBLD            */ 17650000
*    3 SECTOR0  CHAR(1),            /* TARGET DATA AREA FOR SET SECTOR  17700000
*                                      CCW BUILT BY CPBLD            */ 17750000
*    3 NUMCCWS FIXED(8),            /* NUMBER OF CCWS BUILT BY CPBLD */ 17800000
*    3 CCWLOOP FIXED(8),            /* CONVERT CCWS TO FMT0 LOOP CNTR*/ 17850000
*    3 SAVERCCW CHAR(8),            /* SAVE FAIL CCW AROUND TCC RVRY */ 17900000
*    3 I       FIXED(31),           /* LOOP COUNTER                  */ 17950000
*    3 SAVESEEK CHAR(8),            /* SAVE SEEK                     */ 18000000
*    3    *     CHAR(2),            /* SAVE AREA FOR ISOB FIELDS     */ 18050000
*     4 SAVEKEY  CHAR(1),           /* USER CHANNEL PROGRAM SAVE     */ 18100000
*     4 SAVEOPT  CHAR(1),           /* USER OPTS SAVE                */ 18150000
*    3    *   CHAR(2),              /* UNUSED                        */ 18200000
*    3 CCWSAVE PTR(31),             /* CCWPTR SAVE AREA              */ 18250000
*    3 PLISTSAV CHAR(72),           /* INVALID PARM LIST         @07C*/ 18300000
*    3 PARMWORK CHAR(8);            /* UNUSED                    @07C*/ 18350000
*/********************************************************************/ 18400000
*/*  IGGSNS01 SENSE TRACE STORAGE BLOCK                          @11A*/ 18400990
*/********************************************************************/ 18401980
*DCL 1 SNSTBLK BDY(DWORD) CHAR(248) BASED(EWDSNST),       /*     @11A*/ 18402970
*     2 SNSTLNK PTR(31),                /* LINK FIELD            @11A*/ 18403960
*     2 SNSTID CHAR(4),                 /* IDENTIFIER            @11A*/ 18404950
*     2 SNSTWA CHAR(240) BDY(DWORD);    /* WORK AREA             @11A*/ 18405940
*/********************************************************************/ 18406930
*/*       SENSE TRACE STORAGE BLOCK AREA DEFINITION                  */ 18407920
*/*       THERE IS ROOM IN THIS BLOCK FOR SEVEN SETS OF SENSE        */ 18408910
*/*       WITH 32 BYTES EACH.  THE LAST SEVEN SETS WILL BE KEPT      */ 18409900
*/*       IN THIS BLOCK.  FOR MORE THAN SEVEN RETRIES, THE SENSE     */ 18410890
*/*       OLDEST SET OF 32 BYTES WILL BE LOST.                       */ 18411880
*/********************************************************************/ 18412870
*DCL                                                                    18413860
* 1 SNSTDATA  CHAR(240) BDY(DWORD) DEF(SNSTWA),              /*  @11A*/ 18414850
*  2 SNSCOUNT CHAR(1),                  /* # OF 32 BYTE ENTRIES  @12M*/ 18416830
*  2 SNSFLAG  BIT(24),                  /* FLAGS FOR SENSE TRACE @12A*/ 18417820
*   3 SNSTPGDP BIT(1),                  /* LAST TRY HAD PCBGDP   @12A*/ 18418810
*  2 *        CHAR(4),                  /* RESERVED, FILLER      @12A*/ 18419800
*  2 SNSE(7)  CHAR(32),                 /* 7 32 BYTE AREAS       @12C*/ 18420790
*  2 *        CHAR(8);                  /* RESERVED TO END OF BLK@12C*/ 18421780
*/********************************************************************/ 18424750
*/*  The following declare defines the parameter area portion    @13A*/ 18425740
*/*  of the DERPAUTO formerly defined in module IECVDERP.  This      */ 18426730
*/*  parameter area is used by modules IECVDER3 and IECVDER4.        */ 18427720
*/*  The pointer to this parameter was formerly passed in the        */ 18428710
*/*  call to IECVDER3 and IECVDER4, but now is pointed to by         */ 18429700
*/*  pointer D34PTR which is initialized in the EWA by IECVDERP.     */ 18430690
*/*  This was done to establish a single place of definition for     */ 18431680
*/*  this area instead of defining it in each module.                */ 18432670
*/*                                                                  */ 18433660
*/*  The "DECLARES" in IECVDER3 and IECVDER4 for this "parameter"    */ 18434650
*/*  have been removed from each module so they wil now use this.    */ 18435640
*/*  This part of the DERPAUTO area is now defined in IECVDERP as:   */ 18436630
*/*    D34PARM   CHAR(28)                                            */ 18437620
*/*                                                                  */ 18438610
*/*  Note:  Most of the fiche flags for the lines defining these     */ 18439600
*/*         areas were left to show old maintenance.                 */ 18440590
*/*         All of this including this block comment are new to      */ 18441580
*/*         the EWDMAP macro.                                    @13A*/ 18442570
*/********************************************************************/ 18443560
*DCL                                                                    18444550
* 1 D3_4PARM  CHAR(28) BDY(WORD) BASED(D34PTR),  /*             @13A*/  18445540
*  2     ACTION   FIXED(31),    /* ERROR HANDLING ACTION CODE           18446530
*                                                            @L2M*/     18447520
*  2     CCWPTR   PTR(31),      /*                           @L2M*/     18448510
*  2     TICFROM  PTR(31),      /*                               */     18449500
*  2     TICTO    PTR(31),      /*                               */     18450490
*  2     FLAGSX   BIT(16),      /* FLAG BYTES RESET AT ENTRY @L2A*/     18451480
*     5    *        BIT(8),     /*                           @L2A*/     18452470
*      6    IMPERROR BIT(1),    /* IMPRECISE END ERROR       @L2M*/     18453460
*      6    *        BIT(1),    /*                           @13C*/     18454450
*      6    *        BIT(1),    /* CHANNEL PROGRAM USING DEF EXT */     18455440
*      6    *        BIT(5),    /*                           @L2A*/     18456430
*     5    *        BIT(8),     /*                           @L2A*/     18457420
*      6    LOGABLE  BIT(1),    /* CURRENT ENTRY IS LOGABLE  @L2M*/     18458410
*      6    ERRMSG   BIT(1),    /* ERROR MESSAGE REQUIRED    @L2M*/     18459400
*      6    NOPTHRTY BIT(1),    /* NO ALTERNATEPATH RETRY    @L2M*/     18460390
*      6    INTREQD  BIT(1),    /* INT REQ MSG NEEDED        @L2M*/     18461380
*      6    NOCOUNT  BIT(1),    /* DONT BUMP RETRY 10 COUNTER    */     18462370
*      6    MSGSENT  BIT(1),    /* IECVDMSG CALLED, ISSUE MSG@13C*/     18463360
*      6    *        BIT(2),    /*                           @13C*/     18464350
*  2    ECCCOUNT FIXED(8),      /* # OF ECC BYTES FOR THE DEVICE */     18465340
*  2    ECCLOOP  FIXED(8),      /* ECC LOOP COUNTER              */     18466330
*  2    FLAGS    BIT(8),        /* FLAG BYTE RESET AT ENTRY      */     18467320
*   3    SAFCHECK BIT(1),       /* MSS STORAGE ADAPTER FAILURE   */     18468310
*   3    EXTFLAG  BIT(1),       /* END OF EXTENT DETECTED BY            18469300
*                                  DRIVERS END OF EXTENT ROUTINE */     18470290
*   3    *        BIT(6),       /*                           @L2C*/     18471280
*  2    FLAGS2   BIT(8),        /* FLAGS INDIVIDUALLY SET-RESET  */     18472270
*   3    NOLINK   BIT(1),       /* PARM FOR GETBLOK ROUTINE      */     18473260
*   3    ERPRECAL BIT(1),       /* RECALIBRATE                   */     18474250
*   3    READR0   BIT(1),       /* READ RECORD ZERO              */     18475240
*   3    ERPCP    BIT(1),       /* MOVED ERPCP               @13C*/     18476230
*   3    ERPCHND  BIT(1),       /* PREVIOUS CCW HAD DATA CHAIN ON       18477220
*                                  (USED IN CHAN PGM SEARCH RTNS)*/     18478210
*   3    ERPOFLO  BIT(1),       /* OVERFLOW INDICATOR            */     18479200
*   3    DEFINEXT BIT(1),       /* CHAN PGM USING DEF EXT    @13C*/     18480190
*   3    MSSRETRY BIT(1),       /* RETRY OF MSS MISSING INTERRUPT*/     18481180
*  2    FLAGS3   BIT(8),        /* FLAGS INDIVIDUALLY SET-RESET  */     18482170
*   3    INTRETRY BIT(1),       /* RETRY OF INT REQD ERROR       */     18483160
*   3    ITORETRY BIT(1),       /* INTERFACE TIMEOUT RETRY   @04A*/     18484150
*   3    *        BIT(2),       /* RESERVED                  @24A*/     18485140
*   3    IMPREND  BIT(1),       /* IMPRECISE END             @24A*/     18486130
*   3    *        BIT(3),       /* UNUSED                    @24C*/     18487120
*  2    SAVEPKEY CHAR(1),       /*                           @L2A*/     18488110
*  2    ERPLPCNT BIT(16),       /* ERP RETRY LOOP COUNT      @48C*/     18489100
*  2    *        FIXED(15);     /* UNUSED                    @05C*/     18490090
