* %GOTO PLXDRL0; /*                                                     00010000
         MACRO                                                          00020000
         IARDRL                                                         00030000
*                                                                    */ 00040000
* %PLXDRL0:;                                                            00050000
* /*******************************************************************/ 00060000
* /*                                                                 */ 00070000
* /*            DRL  -  DSPSERV Range List Entry                     */ 00080000
* /*                                05/11/95                         */ 00090000
* /*                                                                 */ 00100000
* /*******************************************************************/ 00110000
* %GOTO PLXDRL1; /*                                                     00120000
         AGO .BALDRL                                                    00130000
*                                                                    */ 00140000
*/*** START OF SPECIFICATIONS ****************************************/ 00150000
*/*                                                                  */ 00160000
*/*01* ACRONYM: DRL                                                  */ 00170000
*/*                                                                  */ 00180000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 00190001
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00200000
*/*                                                                  */ 00210000
*/*01* DESCRIPTIVE NAME: DSPSERV Range List Entry                    */ 00220000
*/*                                                                  */ 00230000
*/*01* MACRO NAME: IARDRL                                            */ 00240000
*/*                                                                  */ 00250000
*/*01* DSECT NAME: DRL                                               */ 00260000
*/*                                                                  */ 00270000
*/*01* COMPONENT: Real Storage Manager (SC1CR)                       */ 00280000
*/*                                                                  */ 00290000
*/*01* EYE-CATCHER: None                                             */ 00300000
*/*                                                                  */ 00310000
*/*01* STORAGE ATTRIBUTES:                                           */ 00320000
*/*02*  VIRTUAL STORAGE: Yes                                         */ 00330000
*/*02*  SUBPOOL:         Caller-defined (must be non-pageable        */ 00340000
*/*                        for caller with >16 ranges)               */ 00350000
*/*02*  KEY:             Caller-defined                              */ 00360000
*/*02*  RESIDENCY:       Must be above 16 meg virtual                */ 00370000
*/*02*  FREQUENCY:       One per range                               */ 00380000
*/*                                                                  */ 00390000
*/*01* SIZE: DRLLEN bytes                                            */ 00400000
*/*                                                                  */ 00410000
*/*01* POINTED TO BY: x_ZXRANGLIST field of DSPSERV MF(L,x)          */ 00420000
*/*                     expansion.                                   */ 00430000
*/*                                                                  */ 00440000
*/*01* SERIALIZATION:  None                                          */ 00450000
*/*01* CREATED BY:     Caller                                        */ 00460000
*/*01* INITIALIZED BY: Caller                                        */ 00470000
*/*01* DESTROYED BY:   Caller                                        */ 00480000
*/*                                                                  */ 00490000
*/*01* FUNCTION: Contains mapping for RANGLIST data for the          */ 00500000
*/*              DSPSERV service.                                    */ 00510000
*/*                                                                  */ 00520000
*/*01* PROPRIETARY STATEMENT:                                        */ 00530000
*/*                                                                  */ 00540000
*/*   COPYRIGHT =                                                    */ 00550000
*/*              5655-068                                            */ 00560000
*/*               THIS MACRO IS "RESTRICTED MATERIALS OF IBM"        */ 00570000
*/*              (C) COPYRIGHT IBM CORP. 1994                        */ 00580000
*/*               LICENSED MATERIALS - PROPERTY OF IBM               */ 00590000
*/*                                                                  */ 00600000
*/*  STATUS = JBB5522                                                */ 00610000
*/*                                                                  */ 00620000
*/*                                                                  */ 00630000
*/*  CHANGE-ACTIVITY=                                                */ 00640000
*/*                                                                  */ 00650000
*/*   $L0=OPEN31KE,JBB5522,941014,PD00G1: POSIX support (Performance)*/ 00660000
*/*   $P1=PP20071 ,JBB5522,950511,PD00KI: Fix up for publication     */ 00670000
*/*                                                                  */ 00680000
*/*01* METHOD OF ACCESS:                                             */ 00690000
*/*      NOTES= For BAL - A DSECT will always be generated           */ 00700000
*/*                                                                  */ 00710000
*/*             For PLX -                                            */ 00720000
*/*             A structure based on DRLPTR will be built.           */ 00730000
*/*                                                                  */ 00740000
*/*** END OF SPECIFICATIONS ******************************************/ 00750001
*/*                                                                     00760000
.BALDRL  ANOP                                                           00770000
DRL      DSECT ,             Maps the DSPSERV range list (DRL) entry.   00780000
*                                                                       00790000
DRLSTVSA DS    A             Starting virtual storage address of the    00800000
*                            data space range to be processed.          00810000
*                                                                       00820000
DRLRSV   DS    CL1           Reserved.                                  00830000
*                                                                       00840000
DRLNUMPG DS    FL3           Number of pages in the data space range    00850000
*                            to be processed.                           00860000
*                                                                       00870000
DRLEND   DS    0F            End of DSPSERV range list (DRL) entry      00880000
*                            mapping.                                   00890000
*                                                                       00900000
DRLLEN   EQU   DRLEND-DRL    Length of a DRL.                           00910000
         MEND  ,             */                                         00920000
* %PLXDRL1:;                                                            00930000
*                                                                       00940000
* %IF DRLVIA='YES' %THEN                                                00950000
*   %GOTO PLXDRL2;                                                      00960000
* DCL 1    DRL      BASED(DRLPTR) BDY(WORD), /* Maps the DSPSERV        00970000
*                                      range list (DRL) entry.       */ 00980000
* %GOTO PLXDRL3;                                                        00990000
*                                                                       01000000
* %PLXDRL2:;                                                            01010000
* DCL 1    DRL      BASED(DRLPTR) VIA(DRLALET) BDY(WORD), /* Maps the   01020000
*                                     DSPSERV range list (DRL) entry.*/ 01030000
*                                                                       01040000
* %PLXDRL3:;                                                            01050000
*      2    DRLALL,                                                     01060000
*       3    DRLSTVSA  PTR(31),     /* Starting virtual storage         01070000
*                                      address of the data space range  01080000
*                                      to be processed.              */ 01090000
*       3    DRLRSV   CHAR(1),      /* Reserved.                     */ 01100000
*       3    DRLNUMPG FIXED(24),    /* Number of pages in the data      01110000
*                                      space range to be processed.  */ 01120000
*       3    DRLEND   CHAR(0) BDY(WORD); /* End of DSPSERV range        01130000
*                                      list (DRL) entry mapping.     */ 01140000
*   DECLARE                                                             01150000
*     DRLLEN   FIXED(31) CONSTANT(LENGTH(DRL)); /* Length of a DRL.  */ 01160000
