* %GOTO PLSRAX0; /*                                                     00032100
         MACRO                                                          00064200
         IARRAX                                                         00096300
*                                                                    */ 00112300
* %PLSRAX0:;                                                            00128400
* /*******************************************************************/ 00160500
* /*                                                                 */ 00192600
* /*            RAX  -  RSM ADDRESS SPACE BLOCK EXTENSION            */ 00224700
* /*                                06/01/94                         */ 00256800
* /*                                                                 */ 00288900
* /*******************************************************************/ 00321000
* %GOTO PLSRAX1; /*                                                     00322100
  AGO .BALRAX                                                        */ 00323200
*/****START OF SPECIFICATIONS ****************************************/ 00324500
*/*01* ACRONYM: RAX                                                  */ 00328000
*/*01*  PROPRIETARY STATEMENT:                                       */ 00331500
*/***PROPRIETARY STATEMENT********************************************/ 00335000
*/*                                                                  */ 00338500
*/*     THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                  */ 00339200
*/*     5647-A01  (C) COPYRIGHT IBM CORP. 1983, 2000                 */ 00339900
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00340600
*/*                                                                  */ 00342000
*/* STATUS = HBB7703                                                 */ 00374600
*/*                                                                  */ 00407200
*/****END OF PROPRIETARY STATEMENT************************************/ 00412900
*/* * START OF SPECIFICATIONS *                                      */ 00413400
*/*01* ACRONYM: RAX                                                  */ 00413900
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00414400
*/*02*        DMTI:BASE                                              */ 00414900
*/*02*        PSPI:FIELDS                                            */ 00415400
*/*                 RAXDBFRM                                         */ 00415900
*/*                 RAXDRM                                           */ 00416400
*/*                 RAXDRMIP                                         */ 00416900
*/*                 RAXESCT                                          */ 00417400
*/*                 RAXFMCT                                          */ 00417900
*/*                 RAXHRECT                                         */ 00418100
*/*                 RAXOVBLK                                         */ 00418400
*/*                 RAXSWSM                                          */ 00418900
*/*                 RAXVIOCT                                         */ 00419400
*/*                 RAXVIORC                                         */ 00419600
*/*                 RAXSPVLC                                         */ 00419900
*/*                 RAXTOTSV                                         */ 00420400
*/*                 RAXSVINR                                         */ 00420900
*/*                 RAXTOTFX                                         */ 00421400
*/*                 RAXSPGPI                                         */ 00421900
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00422400
*/*01* DESCRIPTIVE NAME: RSM ADDRESS SPACE BLOCK EXTENSION           */ 00424800
*/*01* MACRO NAME: IARRAX                                            */ 00425300
*/*01* DSECT NAME: RAX                                               */ 00425800
*/*01* COMPONENT: REAL STORAGE MANAGER (SC1CR)                       */ 00426300
*/*01* EYE-CATCHER: RAX                                              */ 00426800
*/*02*  OFFSET:   0                                                  */ 00427300
*/*02*  LENGTH:   4                                                  */ 00427800
*/*01* STORAGE ATTRIBUTES:                                           */ 00428300
*/*02*  VIRTUAL STORAGE: YES                                         */ 00428800
*/*02*  SUBPOOL:          245                                        */ 00429300
*/*02*  KEY:               0                                         */ 00429800
*/*02*  RESIDENCY: MUST BE ABOVE 16 MEG VIRTUAL                      */ 00430300
*/*01* SIZE: 128 BYTES                                               */ 00430800
*/*01* CREATED BY: RSM ADDRESS SPACE CREATE                          */ 00431300
*/*01* POINTED TO BY:  RCERAX   FIELD OF THE RCE  DATA AREA          */ 00431800
*/*                    ASCBRSME FIELD OF THE ASCB DATA AREA          */ 00432300
*/*                                                                  */ 00432800
*/*01* SERIALIZATION: RSM ADDRESS SPACE LEVEL LOCKS                  */ 00433300
*/*01* FUNCTION: CONTAINS RSM ADDRESS SPACE-RELATED CONTROL          */ 00433800
*/*  VALUES AND COUNTERS.                                            */ 00434300
*/*                                                                  */ 00572500
*/*                                                                  */ 00591900
*/*      CHANGE-ACTIVITY=                                            */ 00611300
*/*                                                                  */ 00630700
*/*        $H0=ES,JBB2133,830513,PDYB:EXTENDED STORE                 */ 00650100
*/*        $L1=DIV,JBB2220,840719,PDYB:VDAC SUPPORT                  */ 00669500
*/*        $L2=DREF,HBB3310,860225,PDYB:DISABLED REFERENCE SUPPORT   */ 00688900
*/*        $L3=DATASPAC,HBB3310,860502,PDYB:DATA SPACES              */ 00708300
*/*        $L4=B16MB,JBB3311,871222,PDYB:BELOW 16 MB CONSTRAINT REL. */ 00727700
*/*        $L5=HIPER,JBB3311,871222,PDYB:HIPERSPACES                 */ 00747100
*/*        $L6=WSMGT,HBB4410,890918,PDA8: WORKING SET MANAGEMENT     */ 00753500
*/*        $L7=BPAGE,HBB4410,890918,PDA8: BLOCK PAGING SUPPORT       */ 00759900
*/*                                                                  */ 00766500
*/*        $P1=PH32054,HBB4420,910104,PD00A8: PERFORMANCE PROBLEM    */ 00773500
*/*                                                                  */ 00780500
*/*        $01=OY08836,JBB2220,871030,PD4U:VIO TO EXPANDED           */ 00787500
*/*        $L8=SYSLKI08,HBB5510,910603,PD00HM: XES RSMPIN LEVEL 1    */ 00804100
*/*        $L9=WLMI0001,HBB5510,920801,PD00A8: ESTE UIC SUPPORT      */ 00820700
*/*        $LA=PR440016,HBB5510,930520,PD00A8: SHOWHDR CHANGES       */ 00829100
*/*        $02=OY57603,JBB3311,921130,PD00HM:SWAP RESOURCE FAILURE   */ 00830700
*/*                                          COUNT                   */ 00832300
*/*        $03=OY63296,JBB3311,930430,PD00HM: AE FIX FOR OY57603     */ 00833900
*/*                                       SWAP RESOURCE FAILURE BIT  */ 00835500
*/*        $04=OY62414,HBB4420,930410,PD00HM:DON'T RESOLVE PAGE      */ 00836100
*/*                                          FAULTS DURING AVQLOW    */ 00836700
*/*        $LB=CAPTU1DS,HBB5520,940106,PD002P: CAPTURE SUPPORT       */ 00837100
*/*        $LC=CAPTU3KE,HBB5520,940602,PD00G1: CAPTURE SUPPORT       */ 00837300
*/*        $LD=64BIT   ,HBB7703,980213,PD002D: ESTOR ELIMINATION     */ 00843600
*/*        $LE=64BIT   ,HBB7703,981031,PD00HL: SPIN LOOP AVOIDANCE   */ 00849900
*/*        $LF=64BIT   ,HBB7703,990601,PD002D: SRM NEW COUNT SUPPORT */ 00853000
*/*        $P2=PXD0443 ,HBB7703,991001,PD00SE: COPYRIGHT ERRORS      */ 00854600
*/*        $P3=PXD0576 ,HBB7703,991123,PD00B7: MOVE RABQDFRM TO      */ 00855100
*/*                                            RAXQDFRM              */ 00855600
*/*        $P4=PXD1037 ,HBB7703,990109,PD00VE: VERIFY NEW RAX FIELDS */ 00857900
*/*                                      FOR RSMDATA EXCEPTION REPORT*/ 00860200
*/*01* METHOD OF ACCESS:                                             */ 00862500
*/*      NOTES= FOR BAL - A DSECT WILL ALWAYS BE GENERATED           */ 00887500
*/*                                                                  */ 00937500
*/*             FOR PLS -                                            */ 00987500
*/*             A STRUCTURE BASED ON RAXPTR WILL BE BUILT UNLESS     */ 01037500
*/*             %RABRAX='YES' IS  SPECIFIED.                         */ 01087500
*/*                                                                  */ 01137500
*/*             IF %RABRAX='YES' IS SPECIFIED, THEN A STRUCTURE      */ 01187500
*/*             TO BE EMBEDDED IN ANOTHER STRUCTURE WILL BE BUILT.   */ 01237500
*/*             THAT IS, THERE WILL BE NO LEVEL 1 DCL GENERATED AND  */ 01287500
*/*             THE STRUCTURE WILL TERMINATE WITH A COMMA RATHER     */ 01337500
*/*             THAN A SEMI-COLON.                                   */ 01387500
*/*                                                                  */ 01437500
*/*             THE EMBEDDED RAX WILL BE A LEVEL 4 STRUCTURE.        */ 01487500
*/*                                                                  */ 01537500
*/*             ALL FIELDS ARE APPLICABLE TO THE NON-COMMON RAX.     */ 01550000
*/*             ONLY FIELDS SO DESIGNATED ARE VALID FOR THE COMMON   */ 01562500
*/*             RAX.                                                 */ 01575000
*/*                                                                  */ 01587500
*/*      CAUTION: IF THE RAX CHANGES, THE ALL USERS OF THE IARRAB    */ 01637500
*/*               MACRO MUST BE RECOMPILED AS IARRAB EMBEDS THE RAX  */ 01687500
*/*               INTO THE RAB STRUCTURE.                        @L1C*/ 01737500
*/*                                                                  */ 01787500
*/* END OF SPECIFICATIONS                                            */ 01837500
*/*                                                                     01887500
.BALRAX  ANOP                                                           01937500
RAX      DSECT                                                          01987500
RAXID    DS    4C            RAX CONTROL BLOCK ID                       02037500
RAXCSWRD DS    0CL4          RAX COMPARE AND SWAP WORD             @03A 02062500
RAXFLGS1 DS    BL1           FLAG BYTE 1                                02087500
RAXESSW  EQU   X'80'         SWAP THIS ADDRESS SPACE TO EXTENDED STORE  02137500
*                            - SET BY SRM                               02187500
*                            (ESA MODE ONLY.  NOT USED FOR ESAME)  @LDC 02195800
RAXBLPEA EQU   X'40'         BLOCK PAGING FROM EXPANDED STORAGE IS      02204100
*                            ACTIVE.  SET BY RSM                   @L7A 02220700
*                            (ESA MODE ONLY.  NOT USED FOR ESAME)  @LDC 02223500
RAXSSCRE EQU   X'20'         SRM WANTS RSM SWAP OUT PROCESSING TO CALL  02226300
*                            SECONDARY WORKING SET CREATE          @P1A 02231900
RAXSORFL EQU   X'10'         SWAP OUT FAILED DUE TO LACK OF RESOURCES   02233700
*                                                                  @03A 02235500
RAXDAVQL EQU   X'08'         SRM WANTS RSM TO DEFER 1ST REFERENCE PAGE  02236100
*                            FAULTS IN THIS SPACE DURING AVQLOW    @04A 02236700
RAXRSV1  DS    XL3           RESERVED                                   02237500
RAXESCT  DS    F             NUMBER OF PAGES ON EXTENDED STORAGE        02287500
*                            (ESA MODE ONLY.  NOT USED FOR ESAME)  @LDC 02300000
* THIS FIELD APPLIES TO THE COMMON RAX                             @L6A 02312500
RAXQUOT  DS    F             STORAGE ISOLATION QUOTA OF MAIN STORAGE    02337500
*                            FRAMES.                                    02356200
*                            FOR ESA MODE, IT ALSO INCLUDES             02374900
*                            EXTENDED STORAGE E-FRAMES.            @LDC 02393600
* THIS FIELD APPLIES TO THE COMMON RAX                             @L6A 02412500
RAXSWSM  DS    F             NUMBER OF MIGRATED SECONDARY WORKING SET   02437500
*                            PAGES.                                     02487500
RAXDRM   DS    F             NUMBER OF DREF PAGES THAT HAVE BEEN        02537500
*                            MIGRATED OR ARE IN THE PROCESS OF BEING    02587500
*                            MIGRATED                              @L2A 02637500
RAXDRMIP DS    F             NUMBER OF DREF PAGES WITH  MIGRATION IN    02687500
*                            PROGRESS                              @L2A 02737500
RAXUKDSS DS    F             NUMBER OF BLOCKS (4K BYTES) OF USER KEY    02787500
*                            DATA SPACE IN EXISTENCE FOR THIS ADDRESS   02837500
*                            SPACE.                                @L3A 02887500
RAXDSHWM DS    F             HIGH WATER MARK (IN MEGABYTES) OF USER     02937500
*                            KEY DATA SPACE CREATED FOR THIS ADDRESS    02987500
*                            SPACE. THIS FIELD IS PROVIDED SMF AND MAY  03037500
*                            BE RESET ONLY BY THE SMF COMPONENT    @L3A 03087500
RAXDBFRM DS    F             NUMBER OF DOUBLE FRAME PAIRS CURRENTLY IN  03137500
*                            USE BY THIS ADDRESS SPACE             @L3A 03187500
RAXVIOCT DS    F             NUMBER OF VIO DATA SET PAGES ON EXPANDED   03237500
*                            STORAGE                                    03287500
*                            (ESA MODE ONLY.  NOT USED FOR ESAME)  @LDC 03312500
RAXFMCT  DS    F             NUMBER OF FRAMES CURRENTLY IN USE BY THIS  03337500
*                            ADDRESS SPACE.                             03387500
* THIS FIELD APPLIES TO THE COMMON RAX                             @L6A 03389200
RAXHWRDA DS    H             RESERVED                              @L8C 03395300
RAXFXSTL DS    H             NUMBER OF FIXED PAGES IN THIS LOGICALLY    03401500
*                            SWAPPED ADDRESS SPACE THAT WERE BACKED BY  03405000
*                            REAL STORAGE BELOW 16 MEGABYTES            03408500
*                            (FOR ESA MODE THE PAGES ARE CURRENTLY      03412000
*                             STOLEN TO EXPANDED)                  @LDC 03415500
RAXHSPCT DS    F             NUMBER OF HIPERSPACE PAGES CURRENTLY ON    03419000
*                            EXPANDED STORAGE FOR THIS ADDRESS SPACE    03422500
*                            (THIS COUNT IS ALSO INCLUDED IN RAXESCT)   03424200
*                                                                  @L5A 03426000
*                            (ESA MODE ONLY.  NOT USED FOR ESAME)  @LDC 03428700
RAXCSTAR DS    F             WORKING SET MANAGEMENT CENTRAL STORAGE     03431500
*                            TARGET NUMBER OF FRAMES               @L6A 03437000
RAXFBV   DS    0CL16         STRUCTURE NAME FOR RAXFBV# FIELDS     @L6A 03442500
* THIS AND THE FOLLOWING 4 FIELDS ARE APPLICABLE TO THE COMMON RAX @L6A 03448000
RAXFBV1  DS    F             NUMBER OF FRAMES IN UIC INTERVAL 1 AS SET  03453500
*                            BY SRM VIA THE RCEFRV# FIELDS.        @L6A 03459000
RAXFBV2  DS    F             NUMBER OF FRAMES IN UIC INTERVAL 2 AS SET  03464500
*                            BY SRM VIA THE RCEFRV# FIELDS.        @L6A 03470000
RAXFBV3  DS    F             NUMBER OF FRAMES IN UIC INTERVAL 3 AS SET  03475500
*                            BY SRM VIA THE RCEFRV# FIELDS.        @L6A 03481000
RAXFBV4  DS    F             NUMBER OF FRAMES IN UIC INTERVAL 4 AS SET  03486500
*                            BY SRM VIA THE RCEFRV# FIELDS.        @L6A 03492000
RAXOVBLK DS    F             NUMBER OF IMPLICITLY OVERBLOCKED FRAMES    03497500
*                                                                  @L7A 03503000
RAXBELFX DS    F             NUMBER OF PAGES IN THIS ADDR SPACE         03507400
*                            EXPLICITLY FIXED AND CURRENTLY BACKED      03511800
*                            WITH REAL STORAGE BELOW 16 MEGABYTES  @L8C 03516200
RAXSWSS  DS    F             COUNT OF SECONDARY WORKING SET PAGES  @L9A 03520600
RAXTOTSV DS    F             TOTAL NUMBER OF SHARED PAGE VIEWS IN THIS  03520800
*                            ADDRESS SPACE                         @LBA 03521000
RAXSVINR DS    F             TOTAL NUMBER OF SHARED PAGES IN CENTRAL    03521200
*                            STORAGE THAT ARE VALID IN THIS ADDRESS     03521400
*                            SPACE                                 @LBA 03521600
RAXSPVLC DS    F             CONSTANTLY INCREASING COUNT OF SHARED      03521800
*                            PAGE VALIDATIONS IN THIS ADDRESS SPACE     03522000
*                                                                  @LBA 03522200
RAXSPSNG DS    F             NUMBER OF SHARED PAGE SINGLETONS IN THIS   03522400
*                            ADDRESS SPACE                         @LBA 03522600
RAXTOTFX DS    F             TOTAL NUMBER OF FIXED PAGES IN THIS        03522800
*                            ADDRESS SPACE (DOES NOT INCLUDE SHARED     03523000
*                            PAGES)                                @LBA 03523200
RAXHRECT DS    F             NUMBER OF HIPERSPACE PAGES ON REAL    @LDC 03523400
*                            (ESAME ONLY)                          @LDC 03523600
RAXVIORC DS    F             NUMBER OF VIO DATASET PAGES IN THE         03523800
*                            VIO REAL CACHE                        @LDC 03524000
*                            (ESAME ONLY)                          @LDC 03524200
RAXSPGPI DS    F             TOTAL NUMBER OF SHARED PAGES BROUGHT IN    03524400
*                            FROM AUXILIARY STORAGE BY THIS ADDRESS     03524600
*                            SPACE                                 @LBA 03524800
RAXCSTNO DS    F             NUMBER OF FRAMES USED TO BACK CASTOUT=NO   03526200
*                            HIPERSPACE PAGES IN THIS ADDRESS SPACE     03527600
*                            (ESAME ONLY)                          @LDA 03529000
RAXABVFX DS    F             NUMBER OF PAGES IN THIS ADDRESS SPACE      03530200
*                            FIXED AND CURRENTLY BACKED WITH REAL       03531400
*                            STORAGE BETWEEN 16M AND 2G            @LFA 03532600
RAXLSQA  DS    F             NUMBER OF FIXED LSQA PAGES BACKED IN       03534000
*                            REAL STORAGE                          @LEA 03537500
RAXDREFR DS    F             NUMBER OF LSQA DREF PAGES AND DATA SPACE   03541000
*                            DREF PAGES IN REAL STORAGE            @LEA 03544500
RAXBFQFX DS    F             NUMBER OF PAGES ON A FIXED QUEUE AND       03548000
*                            BACKED BELOW 16M IN REAL              @LEA 03551500
RAXQDFRM DS    F             NUMBER OF QUAD GROUPS CURRENTLY            03553000
*                            IN USE BY THE ADDRESS SPACE                03554500
*                            (ESAME ONLY)                          @P3C 03556000
RAXRSV   DS    CL8           RESERVED                              @P3C 03557500
         MEND  ,             */                                         03559000
* %PLSRAX1:;                                                            03587500
* %DCL RXI CHAR; /* @L6A*/                                              03593700
* %DCL RXZ CHAR; /* @L6A*/                                              03599900
* %IF RABBASE~= 'NO' %THEN /* @L6A*/                                    03606100
*   %GOTO PLSRAX1A; /* @L6A*/                                           03612300
* %RXZ= 'INIT(0)';  /* @L6A*/                                           03618500
* %RXI= 'INIT(''RAXC'')'; /* @L6A*/                                     03624700
* %PLSRAX1A:; /* @L6A*/                                                 03630900
* %IF RABRAX='YES'                                                      03637500
*   %THEN %GOTO PLSRAX2;                                                03687500
* DCL 1 RAX BASED(RAXPTR) BDY(DWORD),                                   03737500
* %PLSRAX2:;                                                            03787500
*        4 RAXID    CHAR(4) RXI,      /* RAX CONTROL BLOCK ID        */ 03837500
*        4 RAXCSWRD CHAR(4) ABNL,     /* RAX COMPARE AND SWAP WORD      03857500
*                                                                @03A*/ 03877500
*           7 RAXFLGS1 BIT(8) RXZ,    /* FLAG BYTE 1             @03C*/ 03897500
*              9 RAXESSW BIT(1),      /* SWAP THIS ADDRESS SPACE TO     03917500
*                                        EXTENDED STORE - SET BY SRM    03937500
*                                                                @03C   03947500
*                                    (ESA MODE ONLY. NOT USED FOR ESAME)03957500
*                                                                @LDA*/ 03967500
*              9 RAXBLPEA BIT(1),     /* BLOCK PAGING FROM EXPANDED     03977500
*                                        STORAGE IS ACTIVE.             03987500
*                                    (ESA MODE ONLY. NOT USED FOR ESAME)03997500
*                                                                @LDA*/ 04007500
*              9 RAXSSCRE BIT(1),     /* SRM WANTS RSM SWAP OUT TO CALL 04017500
*                                        IARSSCRE                @03C*/ 04037500
*              9 RAXSORFL BIT(1),     /* SWAP OUT FAILED DUE TO LACK    04057500
*                                        OF RESOURCES            @03A*/ 04077500
*              9 RAXDAVQL BIT(1),     /* SRM WANTS RSM TO DEFER 1ST     04085500
*                                        REFERENCE PAGE FAULTS IN THIS  04093500
*                                        SPACE DURING AVQLOW     @04A*/ 04101500
*              9 *      BIT(3),       /* RESERVED                @04C*/ 04109500
*           7 *     CHAR(3) RXZ,      /* RESERVED                @03C*/ 04117500
*        4 RAXESCT  FIXED(31) RXZ,    /* NUMBER OF PAGES ON EXTENDED    04137500
*                                        STORAGE.                       04167500
*                                        THIS FIELD APPLIES TO THE      04197500
*                                        COMMON RAX.                    04212500
*                                        (ESA MODE ONLY, NOT USED       04227500
*                                        FOR ESAME MODE)         @LDC*/ 04242500
*        4 RAXQUOT  FIXED(31) RXZ,    /* STORAGE ISOLATION QUOTA OF     04257500
*                                        MAIN STORAGE FRAMES AND        04287500
*                                        EXTENDED STORAGE E-FRAMES.     04317500
*                                        THIS FIELD APPLIES TO THE      04347500
*                                        COMMON RAX.                    04359500
*                                        FOR ESA MODE, IT ALSO INCLUDES 04371500
*                                        EXTENDED STORAGE E-FRAMES.     04383500
*                                                                @LDC*/ 04395500
*        4 RAXSWSM  FIXED(31) RXZ,    /* NUNBER OF MIGRATED SECONDARY   04407500
*                                        WORKING SET PAGES.          */ 04437500
*        4 RAXDRM   FIXED(31) RXZ,    /* NUMBER OF DREF PAGES THAT      04487500
*                                        HAVE BEEN MIGRATED OR ARE IN   04537500
*                                        THE PROCESS OF BEING           04587500
*                                        MIGRATED                @L2A*/ 04637500
*        4 RAXDRMIP FIXED(31) RXZ,    /* NUMBER OF DREF PAGES WITH      04687500
*                                        MIGRATION IN PROGRESS   @L2A*/ 04737500
*        4 RAXUKDSS FIXED(32) RXZ,    /* NUMBER OF BLOCKS (4K BYTES)    04787500
*                                        OF USER KEY DATA SPACE IN      04837500
*                                        EXISTENCE FOR THIS ADDRESS     04887500
*                                        SPACE.                  @L3A*/ 04937500
*        4 RAXDSHWM FIXED(32) RXZ,    /* HIGH WATER MARK (IN MEGABYTES) 04987500
*                                        OF USER KEY DATA SPACE         05037500
*                                        CREATED FOR THIS ADDRESS       05087500
*                                        SPACE. THIS FIELD IS PROVIDED  05137500
*                                        FOR SMF AND MAY BE RESET ONLY  05187500
*                                        BY THE SMF COMPONENT.   @L3A*/ 05237500
*        4 RAXDBFRM FIXED(31) RXZ,    /* NUMBER OF DOUBLE FRAME PAIRS   05287500
*                                        CURRENTLY IN USE BY THIS       05337500
*                                        ADDRESS SPACE           @L3A*/ 05387500
*        4 RAXVIOCT FIXED(31) RXZ,    /* NUMBER OF VIO DATA SET PAGES   05437500
*                                        ON EXPANDED STORAGE.           05454400
*                                        (ESA MODE ONLY, NOT USED       05471300
*                                        FOR ESAME MODE)         @LDC*/ 05488200
*        4 RAXFMCT  FIXED(31) RXZ,    /* NUMBER OF FRAMES CURRENTLY IN  05505200
*                                        USE BY THIS ADDRESS SPACE.     05522900
*                                        THIS FIELD APPLIES TO THE      05540600
*                                        COMMON RAX.             @L6A*/ 05558300
*        4 RAXHWRDA FIXED(16) RXZ,    /* RESERVED                 L8C*/ 05580600
*        4 RAXFXSTL FIXED(16) RXZ,    /* NUMBER OF FIXED PAGES IN THIS  05603000
*                                        LOGICALLY SWAPPED ADDR SPACE   05606100
*                                        THAT WERE BACKED BY REAL BELOW 05609200
*                                        16 MEGABYTES                   05612300
*                                  (FOR ESA MODE THE PAGES ARE CURRENTLY05615400
*                                   STOLEN TO EXPANDED)      @LDC*/     05618500
*        4 RAXHSPCT FIXED(31) RXZ,    /* NUMBER OF HIPERSPACE PAGES     05621600
*                                        CURRENTLY ON EXPANDED STORAGE  05624700
*                                        FOR THIS ADDRESS SPACE (THIS   05626200
*                                        COUNT IS ALSO INCLUDED IN      05627700
*                                        RAXESCT)                       05629200
*                                        (ESA MODE ONLY, NOT USED       05630700
*                                        FOR ESAME MODE)         @LDC*/ 05632200
*        4 RAXCSTAR FIXED(31) RXZ,    /* WORKING SET MANAGEMENT CENTRAL 05633700
*                                        STORAGE TARGET NUMBER OF       05638200
*                                        FRAMES                  @L6A*/ 05642700
*        4 RAXFBV    CHAR(16) BDY(WORD), /* STRUCTURE NAME       @L6A*/ 05647200
*          6 RAXFBV1 FIXED(31) RXZ, /* NUMBER OF FRAMES IN UIC INTERVAL 05651700
*                                        1 AS SET BY SRM VIA THE RCEFRV 05656200
*                                        FIELDS.                 @L6A*/ 05660700
*          6 RAXFBV2 FIXED(31) RXZ, /* NUMBER OF FRAMES IN UIC INTERVAL 05665200
*                                        2 AS SET BY SRM VIA THE RCEFRV 05669700
*                                        FIELDS.                 @L6A*/ 05674200
*          6 RAXFBV3 FIXED(31) RXZ, /* NUMBER OF FRAMES IN UIC INTERVAL 05678700
*                                        3 AS SET BY SRM VIA THE RCEFRV 05683200
*                                        FIELDS.                 @L6A*/ 05687700
*          6 RAXFBV4 FIXED(31) RXZ, /* NUMBER OF FRAMES IN UIC INTERVAL 05692200
*                                        4 AS SET BY SRM VIA THE RCEFRV 05696700
*                                        FIELDS.                 @L6A*/ 05701200
*        4 RAXOVBLK FIXED(31) RXZ,    /* NUMBER OF IMPLICITLY OVER-     05705700
*                                        BLOCKED FRAMES          @L7A*/ 05710200
*        4 RAXBELFX FIXED(31) RXZ,    /* NUMBER PAGES IN THIS ADDRESS   05712700
*                                        SPACE EXPLICITLY FIXED AND     05715200
*                                        CURRENTLY BACKED WITH REAL     05717700
*                                        BELOW 16 MEGABYTES      @L8C*/ 05720200
*        4 RAXSWSS  FIXED(31) RXZ,    /* COUNT OF SECONDARY WORKING     05720400
*                                        PAGES                   @LBC*/ 05720600
*        4 RAXTOTSV FIXED(31) RXZ,    /* TOTAL NUMBER OF SHARED PAGE    05720800
*                                        VIEWS IN THIS ADDRESS SPACE    05721000
*                                                                @LBA*/ 05721200
*        4 RAXSVINR FIXED(31) RXZ,    /* TOTAL NUMBER OF SHARED PAGES   05721400
*                                        IN CENTRAL STORAGE THAT ARE    05721600
*                                        VALID IN THIS ADDRESS          05721800
*                                        SPACE                   @LBA*/ 05722000
*        4 RAXSPVLC FIXED(32) RXZ,    /* CONSTANTLY INCREASING COUNT    05722200
*                                        OF SHARED PAGE VALIDATIONS IN  05722400
*                                        THIS ADDRESS SPACE      @LBA*/ 05722600
*        4 RAXSPSNG FIXED(31) RXZ,    /* NUMBER OF SHARED PAGE          05722800
*                                        SINGLETONS IN THIS ADDRESS     05723000
*                                        SPACE                   @LBA*/ 05723200
*        4 RAXTOTFX FIXED(31) RXZ,    /* TOTAL NUMBER OF FIXED PAGES IN 05723400
*                                        THIS ADDRESS SPACE (DOES NOT   05723600
*                                        INCLUDE SHARED PAGES)   @LBA*/ 05723800
*        4 RAXHRECT FIXED(31) RXZ,    /* NUMBER OF HIPERSPACE PAGES     05724000
*                                        ON REAL                        05724200
*                                        (ESAME ONLY)            @LDC*/ 05724400
*        4 RAXVIORC FIXED(31) RXZ,    /* NUMBER OF VIO DATASET PAGES    05724600
*                                        IN THE VIO REAL CACHE          05724800
*                                        (ESAME ONLY)            @LDC*/ 05725000
*        4 RAXSPGPI FIXED(31) RXZ,    /* TOTAL NUMBER OF SHARED PAGES   05725400
*                                        BROUGHT IN FROM AUXILIARY      05725600
*                                        STORAGE BY THIS ADDRESS SPACE  05725800
*                                                                @LBA*/ 05726000
*        4 RAXCSTNO FIXED(31) RXZ,    /* NUMBER OF FRAMES USED TO       05727100
*                                        BACK CASTOUT=NO CACHE          05728200
*                                        HIPERSPACES IN THIS ADDRESS    05729300
*                                        SPACE                          05730400
*                                        (ESAME ONLY)            @P4C*/ 05730900
*        4 RAXABVFX FIXED(31) RXZ,    /* NUMBER OF PAGES IN THIS        05731400
*                                        ADDRESS SPACE FIXED AND        05731900
*                                        CURRENTLY BACKED WITH REAL     05732100
*                                        STORAGE BETWEEN 16M AND 2G     05732300
*                                                                @P4C*/ 05732700
*        4 RAXLSQA  FIXED(31) RXZ,    /* NUMBER OF FIXED LSQA           05733100
*                                        PAGES BACKED IN REAL           05733500
*                                        STORAGE                 @P4C*/ 05733900
*        4 RAXDREFR FIXED(31) RXZ,    /* NUMBER OF LSQA DREF PAGES AND  05734300
*                                        DATA SPACE DREF PAGES IN       05734700
*                                        REAL STORAGE            @P4C*/ 05735100
*        4 RAXBFQFX FIXED(31) RXZ,    /* NUMBER OF PAGES ON A FIXED     05735500
*                                        QUEUE AND BACKED BELOW 16M     05735900
*                                        IN REAL                 @P4C*/ 05736100
*        4 RAXQDFRM FIXED(31) RXZ,    /* NUMBER OF QUAD GROUPS CURRENTLY05736300
*                                        IN USE BY THE ADDRESS SPACE    05736700
*                                        (ESAME ONLY)            @P4C*/ 05736900
*        4 RAXRSV   CHAR(8),          /* RESERVED                @P3C*/ 05737100
* %IF RABRAX='YES'                                                      05737500
*   %THEN %GOTO PLSRAX3;                                                05787500
*        4 RAXEND CHAR(0) BDY(DWORD); /* KEEP RAX A MULT. OF 8 BYTES */ 05837500
*        %GOTO PLSRAX4;                                                 05887500
* %PLSRAX3:;                                                            05937500
*        4 RAXEND CHAR(0) BDY(DWORD), /* KEEP RAX A MULT. OF 8 BYTES */ 05987500
* %PLSRAX4:;                                                            06037500
* %DEACTIVATE RXI,RXZ;                                                  06087500
