*  %GOTO CDXPRO; /*                                                     00050000
         MACRO                                                          00100000
         CDXPLIST &LIST=NO                                              00150000
*          */                                                           00200000
*  %CDXPRO: ;                                                           00250000
*/*******START OF SPECIFICATIONS**************************************/ 00300000
*/*01* PROPRIETARY STATEMENT=                                        */ 00307600
*/***PROPRIETARY_STATEMENT********************************************/ 00315200
*/*                                                                  */ 00322800
*/*                                                                  */ 00330400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00338000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00345600
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                      */ 00357000
*/*                                                                  */ 00368400
*/* STATUS= HRF7703                                                  */ 00376000
*/*                                                                  */ 00383600
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00391200
*/*01* EXTERNAL CLASSIFICATION: PI                               @P7C*/ 00394100
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00397000
*/*                                                                  */ 00400000
*/* $MAC(ICHCDXP) COMP(XXH00) PROD(RACF):                            */ 00450000
*/*                                                                  */ 00550000
*/*                                                                  */ 00800000
*/* DESCRIPTIVE NAME:                                                */ 00825000
*/*   Notify/Verify/Listing Exit routines Parameter List.            */ 00850000
*/*   (Common Base Mapping).                                         */ 00875000
*/*   RACF Version 2 Release 8                                   @P6C*/ 00925000
*/*                                                                  */ 01650000
*/*                                                                  */ 01750000
*/* FUNCTION:                                                        */ 01775000
*/*   This macro contains the Parameter Lists being passed to the    */ 01800000
*/*   Notify, Verify, and List Exit routines.                        */ 01825000
*/*                                                                  */ 01850000
*/*                                                                  */ 01900000
*/* INVOCATION:                                                      */ 01902300
*/*   BAL  - CDXPLIST (Dsect is always produced).                    */ 01904600
*/*          Using on CDXPLIST gives addressability.                 */ 01906900
*/*   PL/S - For based structure set %EXBASE='BASED'                 */ 01909200
*/*          %INCLUDE SYSLIB(ICHCDXP)                                */ 01911500
*/*                                                                  */ 01913800
*/* DEVELOPERS:                                                      */ 01916100
*/*   BAL Listing - Specify LIST=YES on Macro call to ICHCDXP        */ 01918400
*/*                 Dsect in listing.                                */ 01920700
*/*                                                                  */ 01923000
*/*                                                                  */ 01925300
*/* CHANGE ACTIVITY:                                                 */ 01927600
*/*   $L0= DYNPARS HRF1902 881122 V0RGW1: DYNAMIC PARSE FUNCTION @L0A*/ 01929900
*/*   $P1= PGU0522 HRF1902 890117 V0ALF1: NOSEGMENT FLAG         @P1A*/ 01932200
*/*   $P2= PGU0588 HRF1902 890210 V0RGW1: FIELD ALIGNMENT        @P2A*/ 01933300
*/*   $P3= PGU0732 HRF1902 890523 V0ALF1: LOCK/UNLOCK LIST EXIT  @P3A*/ 01933900
*/*   $P4= PGU0762 HRF1902 890719 PDPWB1: PGU0762                @P4A*/ 01934200
*/*   $P5= PGU1910 HRF1902 900920 PDD_J1: PGU1910                @P5A*/ 01934300
*/*   $L1= RRSF    HRF2220 921230 ALMELW: Remote Sharing         @L1A*/ 01934400
*/*   $P6= PWP0103 HRF2608 981109 PDCCM1: FIN OW35976            @P6A*/ 01935200
*/*   $P7= PXR0024 HRF7703 991029 PDI_S1: PTM PXR0024            @P7C*/ 01936000
*/*                                                                  */ 01936800
*/* CHANGE DESCRIPTIONS:                                             */ 01939100
*/*   A000000-999999 Original code                               @L0A*/ 01941400
*/*   A - Added field to indicate segment has -NO- prefix        @P1A*/ 01943700
*/*   A - Added field to align data on correct boundary          @P2A*/ 01944400
*/*   C - changed field to align on proper boundary              @P2A*/ 01945100
*/*   A - New ENTRYX indicator                                   @P4A*/ 01945500
*/*   A - New TRANSLATE indicator                                @P5A*/ 01945700
*/*   A - New indicator to be passed to VALEXIT routines.        @L1A*/ 01945800
*/*   A - Add bit to indicate segment found to be passed to      @P6A*/ 01946800
*/*       to NOTIFY exits.                                       @P6A*/ 01947800
*/*   C - Change external classification from NONE to PI         @P7C*/ 01948300
*/*                                                                  */ 01948800
*/********************************************************************/ 01950000
*  %GOTO CDXDCL; /*                                                     02000000
         GBLB  &CDXPLIST                                                02050000
         AIF   (&CDXPLIST).END                                          02100000
&CDXPLIST SETB 1                                                        02150000
         PUSH  PRINT                                                    02200000
         AIF   ('&LIST' EQ 'YES').MAP1                                  02250000
         PRINT ON                                                       02300000
.MAP1    ANOP                                                           02350000
         SPACE 1                                                        02400000
*********************************************************************** 02450000
*                                                                     * 02500000
*        PARAMETER LIST FOR NOTIFY/VERIFY/LISTING EXIT ROUTINES,      * 02550000
*        COMMON TO ALL EXITS.                                         * 02600000
*                                                                     * 02650000
*********************************************************************** 02700000
         SPACE 1                                                        02750000
CDXPLIST DSECT             EXIT ROUTINES MAIN PARAMETER LIST            02800000
CDXNXPT  DS    F           ADDRESS OF NEXT PARAMETER LIST               02850000
CDXCPPL  DS    F           ADDRESS OF THE CPPL                          02900000
CDXDAPT  DS    F           ADDRESS OF DATA AREA                         02950000
CDXDWPT  DS    F           ADDRESS OF DATA WORD                         03000000
CDXUWPT  DS    F           ADDRESS OF USER WORD                         03050000
CDXENPT  DS    F           ADDRESS OF ENTRY LENGTH/NAME                 03100000
CDXCLPT  DS    F           ADDRESS OF CLASS LENGTH/NAME                 03150000
CDXPFNM  DS    CL8         PROFILE NAME                                 03200000
CDXPFTP  DS    X           PROFILE TYPE                                 03250000
CDXCLTP  DS    X           CLASS TYPE                                   03300000
CDXOPTP  DS    X           OPERATION TYPE (ADD,ALTER,DELETE)            03350000
CDXFLAGS DS    X           VALUE OF KEYTAB FLAGS                 @P3A   03375000
CDXSGNM  DS    CL8         SEGMENT NAME                                 03400000
CDXKYNM  DS    CL32        KEYWORD NAME                                 03450000
CDXTMNM  DS    CL8         TEMPLATE NAME                                03500000
CDXTMLN  DS    CL2         TEMPLATE LENGTH                              03550000
CDXFLAG2 DS    X           MISCELLANEOUS FLAGS                   @P6A   03583300
         DS    CL1                                               @P6C   03616600
CDXADDL  EQU   *           ADDRESS OF ADDITIONAL PARAMETER LIST         03650000
         EJECT                                                          03700000
*********************************************************************** 03750000
*                                                                     * 03800000
*        ADDITIONAL PARAMETER LIST FOR VERIFY EXIT ONLY               * 03850000
*                                                                     * 03900000
*********************************************************************** 03950000
         SPACE 1                                                        04000000
CDXVPRM  ORG   CDXADDL     ADDITIONAL PARAMETERS - VERIFY               04050000
CDXVMSK  DS    F           VERIFY MASKS                                 04100000
         EJECT                                                          04150000
*********************************************************************** 04200000
*                                                                     * 04250000
*        ADDITIONAL PARAMETER LIST FOR LIST EXIT ONLY                 * 04300000
*                                                                     * 04350000
*********************************************************************** 04400000
         SPACE 1                                                        04450000
CDXLPRM  ORG   CDXADDL     ADDITIONAL PARAMETERS - LIST                 04500000
CDXLHPT  DS    F           ADDRESS OF LIST HEADING                      04550000
CDXLFPT  DS    F           ADDRESS OF DATA FORMAT                       04600000
CDXANMSK DS    F           AND MASK TO BE APPLIED                       04616600
CDXORMSK DS    F           OR MASK TO BE APPLIED                        04633200
         ORG                                                            04650000
         SPACE 1                                                        04700000
         POP PRINT                                                      04750000
.END     MEND  , -         */                                           04800000
*  %CDXDCL: ;                                                           04850000
*      /* NOTIFY/VERIFY/LISTING PARAMETER LIST (COMMON TO ALL EXITS)    04900000
*                                               */                      04950000
*%IF EXBASE ~= 'BASED' %THEN                                            05000000
*       %EXBASE='';                                                     05050000
*DCL 1 CDXPLIST   EXBASE,       /* EXIT ROUTINES MAIN PARAMETER LIST */ 05100000
*     2 CDXNXPT   PTR(31),      /* POINTER TO NEXT PARAMETER LIST    */ 05150000
*     2 CDXCPPL   PTR(31),      /* POINTER TO CPPL                   */ 05200000
*     2 CDXDAPT   PTR(31),      /* POINTER TO DATA AREA              */ 05250000
*     2 CDXDWPT   PTR(31),      /* POINTER TO DATA WORD              */ 05300000
*     2 CDXUWPT   PTR(31),      /* POINTER TO USER WORD              */ 05350000
*     2 CDXENPT   PTR(31),      /* POINTER TO ENTRY NAME (USER NAME,    05400000
*                                  GROUP NAME, RESOURCE NAME, DATA SET  05450000
*                                  NAME                              */ 05500000
*     2 CDXCLPT   PTR(31),      /* POINTER TO CLASS NAME             */ 05550000
*     2 CDXPFNM   CHAR(8),      /* PROFILE NAME                      */ 05600000
*     2 CDXPFTP   BIN (8),      /* PROFILE TYPE                      */ 05650000
*     2 CDXOPTP   BIN (8),      /* OPERATION TYPE (ADD,ALTER,DELETE) */ 05700000
*       3 CDXADD  BIT (1),      /* CALLED BY ADD COMMAND PROCESSOR   */ 05750000
*       3 CDXALT  BIT (1),      /* CALLED BY ALT COMMAND PROCESSOR   */ 05800000
*       3 CDXDEL  BIT (1),      /* CALLED BY DELETE COMMAND PROCESSOR*/ 05850000
*       3 CDXLST  BIT (1),      /* CALLED BY LIST COMMAND PROCESSOR  */ 05900000
*       3 CDXNOSEG BIT(1),      /* SET IF SEGMENT PREFIX IS -NO- @P1A*/ 05933300
*       3 CDXNOEX BIT(1),       /* Bypass existance checks.      @L1A*/ 05945900
*       3 *       BIT(2),       /* RESERVED                      @L1C*/ 05958500
*     2 CDXFLAGS  BIN(8),       /* VALUE OF KEYTAB FLAGS         @P3A*/ 05971300
*       3 CDXLIST BIT(1),       /* INPUT LIST SPECIFIED          @P3A*/ 05976000
*       3 CDXRANGE BIT(1),      /* INPUT RANGE SPECIFIED         @P3A*/ 05980700
*       3 CDXREPT BIT(1),       /* INPUT IS A REPEAT GROUP       @P3A*/ 05985400
*       3 CDXFLAGF BIT(1),      /* INPUT INTO A FLAG FIELD       @P3A*/ 05990100
*       3 CDXNTRYX BIT(1),      /* Extended ENTRY format         @P4A*/ 05993400
*       3 CDXXLATE BIT(1),      /* translate table in CDXVMSK    @P5A*/ 05995600
*       3 *        BIT(2),      /* RESERVED                      @P5C*/ 05997800
*     2 CDXCLTP   BIN (8),      /* CLASS TYPE                        */ 06000000
*     2 CDXSGNM   CHAR(8),      /* SEGMENT NAME                      */ 06050000
*     2 CDXKYNM   CHAR(32),     /* KEYWORD NAME                      */ 06100000
*     2 CDXTMNM   CHAR(08),     /* TEMPLATE NAME                     */ 06150000
*     2 CDXTMLN   FIXED(15),    /* TEMPLATE LENGTH                   */ 06200000
*     2 CDXFLAG2  BIN(8),       /* MISCELLANEUOS FLAGS           @P6A*/ 06220000
*       3 CDXSGFND BIT(1),      /* SEGMENT FOUND                 @P6A*/ 06240000
*       3 *        BIT(7),      /* RESERVED                      @P6A*/ 06260000
*     2 *         CHAR(1),      /* ALIGNMENT                     @P6C*/ 06280000
*     2 CDXADDL   CHAR(0) BDY(WORD);   /* ADDITIONAL PARAMETER LISTS */ 06300000
*      /* ADDITIONAL PARAMETER LIST FOR VERIFY EXIT ROUTINES ONLY       06350000
*                                          @P2C */                      06400000
*DCL 1 CDXVPRM BASED(ADDR(CDXADDL)), /* ADDITIONAL PARMS - VERIFY    */ 06450000
*     2 CDXVMSK FIXED(31);      /* VERIFY MASKS                      */ 06500000
*      /* ADDITIONAL PARAMETER LIST FOR LIST EXIT ROUTINES ONLY         06550000
*                                               */                      06600000
*DCL 1 CDXLPRM BASED(ADDR(CDXADDL)), /* ADDITIONAL PARMS - LIST      */ 06650000
*     2 CDXLHPT PTR(31),        /* POINTER TO LIST HEADING           */ 06700000
*     2 CDXLFPT PTR(31),        /* POINTER TO DATA FORMAT            */ 06750000
*     2 CDXANMSK BIT(32),       /* AND MASK TO BE APPLIED        @P3A*/ 06800000
*     2 CDXORMSK BIT(32);       /* OR MASK TO BE APPLIED         @P3A*/ 06850000
