**********************************************************************  00050000
*                                                                       00100000
* $MAC(ICHNCONV) COMP(XXH00) PROD(RACF):                                00150000
*                                                                       00200000
* DESCRIPTIVE NAME = NAMING CONVENTIONS GENERATOR MACRO                 00250000
*                                                                       00300000
*/*01* PROPRIETARY STATEMENT=                                        */ 00325000
*/***PROPRIETARY_STATEMENT********************************************/ 00350000
*/*                                                                  */ 00375000
*/*                                                                  */ 00400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00425000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00450000
*/* 5695-039 (C) COPYRIGHT IBM CORP. 1987, 1994                      */ 00475000
*/*                                                                  */ 00500000
*/* STATUS= HRF2220                                                  */ 00525000
*/*                                                                  */ 00550000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00575000
*                                                                       00600000
* FUNCTION = ISSUED TO BUILD THE RACF NAMING CONVENTION                 00650000
*            TABLE.                                                     00700000
*                                                                       00750000
* CHANGE ACTIVITY =  $L0=HRF1602,RACF/160,830630,CNTDSD:                00800000
*                    OZ78496                                   @ZA78496 00850000
*                    OZ94668                                   @ZA94668 00900000
*                    OY43903 ADD EVENT CODE D FOR RACXTRT          @01A 00925000
*                    PO80213 ADD AMODE 31 AND RMODE ANY            @P0A 00937500
*                    OW03598 ADD RACUID3 AND RACGPID3 FOR          @02A 00941600
*                            3RD PARTY RACHECK.                    @02A 00945700
*   $P1=PO80735 HRF2220 950516 PDMDB1: AVOID WARNING MESSAGES IN        00949800
*                                      LINKEDIT OUTPUT             @P1A 00953900
*                                                                       00976900
**********************************************************************  01000000
         MACRO                                                          01050000
         ICHNCONV &TYPE,                                               -01100000
               &NAME=,                                                 -01150000
               &COND=,                                                 -01200000
               &SET=,                                                  -01250000
               &NEXT=                                                   01300000
.*                                                                      01350000
.*********************************************************************  01400000
.* DEFINE GLOBAL SET SYMBOLS                                            01450000
.*********************************************************************  01500000
.*                                                                      01550000
         GBLB  &ICHFSTC            SET ON BY THE FIRST ICHNCONV DEFINE  01600000
.*                                 MACRO IN A CONVENTION, TO INDICATE   01650000
.*                                 THAT THIS IS THE FIRST CONVENTION IN 01700000
.*                                 THE TABLE.  SET OFF BY THE ICHNCONV  01750000
.*                                 END MACRO OF THE FIRST CONVENTION.   01800000
         GBLB  &ICHINPR            SET ON BY THE ICHNCONV DEFINE        01850000
.*                                 MACRO OF A CONVENTION, TO INDICATE   01900000
.*                                 THAT A CONVENTION IS IN PROGRESS.    01950000
.*                                 SET OFF BY THE ICHNCONV END MACRO    02000000
.*                                 OF THAT CONVENTION.                  02050000
         GBLB  &ICHSELF            SET ON BY THE FIRST ICHNCONV SELECT  02100000
.*                                 MACRO IN A CONVENTION, TO INDICATE   02150000
.*                                 THAT A SELECT MACRO HAS BEEN FOUND.  02200000
.*                                 SET OFF BY THE ICHNCONV END MACRO    02250000
.*                                 OF THAT CONVENTION.                  02300000
         GBLB  &ICHSELL            SET ON BY THE LAST ICHNCONV SELECT   02350000
.*                                 MACRO IN A CONVENTION, TO INDICATE   02400000
.*                                 THAT THE NEXT MACRO SHOULD BE AN     02450000
.*                                 ACTION.  SET OFF BY THE ICHNCONV     02500000
.*                                 END MACRO OF THAT CONVENTION.        02550000
         GBLB  &ICHACTF            SET ON BY THE FIRST ICHNCONV ACTION  02600000
.*                                 MACRO IN A CONVENTION, TO INDICATE   02650000
.*                                 THAT AN ACTION MACRO HAS BEEN FOUND. 02700000
.*                                 SET OFF BY THE ICHNCONV END MACRO    02750000
.*                                 OF THAT CONVENTION.                  02800000
         GBLB  &ICHNXT             SET ON BY THE ICHNCONV END MACRO, IF 02850000
.*                                 NEXT=NEXT OR NEXT=CONVENTION WAS     02900000
.*                                 SPECIFIED.  SET OFF BY ICHNCONV      02950000
.*                                 DEFINE.                              03000000
         GBLB  &ICHENDT            SET ON BY THE ICHNCONV FINAL MACRO,  03050000
.*                                 TO INDICATE THE END OF THE NAMING    03100000
.*                                 CONVENTION TABLE.                    03150000
         GBLA  &ICHSELC            COUNT OF SELECT MACROS IN A NAMING   03200000
.*                                 CONVENTION.  SET TO ZERO BY ICHNCONV 03250000
.*                                 DEFINE PROCESSING. INCREMENTED BY    03300000
.*                                 SELECT MACRO PROCESSING.             03350000
         GBLA  &ICHACTC            COUNT OF ACTION MACROS IN A NAMING   03400000
.*                                 CONVENTION.  SET TO ZERO BY ICHNCONV 03450000
.*                                 DEFINE PROCESSING. INCREMENTED BY    03500000
.*                                 ACTION MACRO PROCESSING.             03550000
         GBLA  &ICHCV#             ORDINAL POSITION IN THE TABLE OF     03600000
.*                                 THE CONVENTION CURRENTLY BEING       03650000
.*                                 GENERATED. INITIALIZED BY THE FIRST  03700000
.*                                 DEFINE MACRO.  INCREMENTED BY EACH   03750000
.*                                 END MACRO.                           03800000
         GBLC  &ICHCVN(400)        TABLE OF THE NAMES OF ALL            03850000
.*                                 PREVIOUSLY DEFINED CONVENTIONS.      03900000
.*                                 USED BY THE END MACRO TO DETERMINE   03950000
.*                                 IF THE LABEL SPECIFIED ON THE NEXT   04000000
.*                                 KEYWORD IS AN UPWARD LOOP IN THE     04050000
.*                                 TABLE.  THE DIMENSION OF &ICHCVN CAN 04100000
.*                                 BE INCREASED TO ACCOMODATE MORE      04150000
.*                                 CONVENTIONS IF NECESSARY.  THE       04200000
.*                                 GLOBAL SET SYMBOL CVNDIM SHOULD ALSO 04250000
.*                                 BE ADJUSTED IN THIS CASE.            04300000
         GBLC   &ICHNXTL           LABEL OF THE NEXT FIELD DETERMINED   04350000
.*                                 BY THE ICHNCONV END MACRO.  IT IS    04400000
.*                                 SET BY THE DEFINE MACRO OF THE NEXT  04450000
.*                                 CONVENTION, EXCEPT IF SPECIFIED ON   04500000
.*                                 THE LAST CONVENTION'S END.  THEN THE 04550000
.*                                 FINAL MACRO SETS THE NEXT=SUCCESS    04600000
.*                                 FLAG IN THAT CONVENTION HEADER.      04650000
         GBLC   &OPA(2)            ATTRIBUTE BYTES FOR THE OPERANDS     04700000
.*                                 OF EITHER A COND OR A SET, NEEDED SO 04750000
.*                                 TWO OPERANDS CAN BE COMPARED AGAINST 04800000
.*                                 EACH OTHER FOR MATCHING TYPES.       04850000
         GBLA   &LX                INDEX FOR GENERATED LITERAL          04900000
.*                                 ADDRESSES IN ICHNCV01 CSECT.         04950000
         GBLA   &BX                INDEX FOR GENERATED LABELS ON        05000000
.*                                 SUBSCRIPT VALUES IN SELECT OR        05050000
.*                                 ACTION ENTRIES.                      05100000
         GBLB   &INITSW            SWITCH SET TO ONE ONCE ALL THE       05150000
.*                                 FOLLOWING GLOBAL VARIABLES ARE       05200000
.*                                 INITIALIZED, TO PREVENT REEXECUTING  05250000
.*                                 INITIALIZATION CODE.                 05300000
         GBLC   &VARNAM(33)        ARRAY OF NAMES OF ALL VARIABLES.@02C 05350000
.*                                                                      05400000
         GBLA   &VARLEN(33)        ARRAY OF ALLOWED LENGTHS FOR EACH    05413900
.*                                 VARIABLE.                       @02C 05427800
         GBLC   &VARATT(33)        ARRAY OF ALLOWED ATTRIBUTES FOR      05441700
.*                                 EACH VARIABLE.                  @02C 05455600
         GBLC   &EVENT(22)         ARRAY OF ALLOWED EVENT CODES FOR     05637500
.*                                 COMPARING OR SETTING EVENT VARIABLE  05675000
.*                                                                @01C. 05712500
         GBLC  &YES,&NO            CONSTANTS USED AS BIT VALUES.        05750000
.*                                                                      05800000
         GBLC  &SX                 SHORT FORM OF &SYSNDX FOR LABELS.    05850000
.*                                                                      05900000
         GBLA  &CVNDIM             DIMENSION OF ICHCVN ARRAY.  THIS     05950000
.*                                 SYMBOL'S VALUE MUST BE CHANGED IF    06000000
.*                                 THE DIMENSION OF ICHCVN IS CHANGED.  06050000
         GBLA  &EVTDIM             DIMENSION OF EVENT ARRAY.  THIS      06100000
.*                                 SYMBOL'S VALUE MUST BE CHANGED IF    06150000
.*                                 THE DIMENSION OF EVENT IS CHANGED.   06200000
         GBLA  &VARDIM             DIMENSION OF VARNAM, VARLEN, VARATT  06250000
.*                                 ARRAYS.  THESE                       06300000
.*                                 SYMBOLS' VALUES MUST BE CHANGED IF   06350000
.*                                 THE ARRAYS' DIMENSION IS CHANGED.    06400000
         GBLC  &DIGITS,&HIGITS     CONSTANTS FOR COMPARING VALUES TO    06450000
.*                                 DECIMAL OR HEX DIGITS.               06500000
         GBLA  &SSCROK,&NOTMOD,&MODSPEC,&CHARHEX,&SSTROK                06550000
.*                                 INDICES IN THE ARRAY VARATT          06600000
.*                                 FOR BITS CORRESPONDING TO            06650000
.*                                 VARIABLE ATTRIBUTES.                 06700000
.*                                                                      06750000
.********************************************************************   06800000
.* DEFINE LOCAL SET SYMBOLS                                             06850000
.********************************************************************   06900000
.*                                                                      06950000
         LCLA  &ABIT0,&ABIT1,&ABIT2,&ABIT3,&ABIT4,&ABIT5,&ABIT6,&ABIT7  07000000
         LCLA  &BBIT0,&BBIT1,&BBIT2,&BBIT3,&BBIT4,&BBIT5,&BBIT6,&BBIT7  07050000
         LCLA  &CBIT0,&CBIT1,&CBIT2,&CBIT3,&CBIT4,&CBIT5,&CBIT6,&CBIT7  07100000
         LCLA  &OPNO,&REP,&VARCODE,&OPLEN                               07150000
         LCLA  &SUBCODE,&STRST,&STREND,&OPPOS,&OPCNT                    07200000
         LCLA  &I,&J,&RETL,&NX,&LEN                                     07250000
.*                                                                      07300000
         LCLB  &FOUND,&PARENS                                           07350000
.*                                                                      07400000
         LCLC  &OP(4),&LIT,&OPND                                        07450000
         LCLC  &PARAM,&ARG                                              07500000
.*                                                                      07550000
.********************************************************************   07600000
.* INITIALIZE LOCAL VARIABLES THAT WILL BE USED AS CONSTANTS DURING     07650000
.* THE FIRST TIME THROUGH THE MACRO.                                    07700000
.********************************************************************   07750000
.*                                                                      07800000
         AIF   (&INITSW).SKIPINT   IF SYMBOLS USED AS CONSTANTS HAVE    07850000
.*                                 ALREADY BEEN INITIALIZED, BYPASS     07900000
.*                                 INITIALIZATION LOGIC.                07950000
&INITSW  SETB  1                   INDICATE INITIALIZATION OCCURRED     08000000
.*                                                                      08050000
&CVNDIM  SETA  400                 DIMENSION OF ICHCVN ARRAY. MUST BE   08100000
.*                                 ALTERED IN CONJUNCTION WITH THAT     08150000
.*                                 SYMBOL'S DIMENSION.                  08200000
&EVTDIM  SETA  22                  DIMENSION OF EVENT ARRAY. MUST BE    08250000
.*                                 ALTERED IN CONJUNCTION WITH THAT     08300000
.*                                 SYMBOL'S DIMENSION.           @01C   08350000
&VARDIM  SETA  33                  DIMENSION OF VARNAM, VARLEN, VARATT  08400000
.*                                 ARRAYS.  MUST BE                @02C 08450000
.*                                 ALTERED IN CONJUNCTION WITH THOSE    08500000
.*                                 SYMBOLS' DIMENSION.                  08550000
.*                                 POSITIONS IN THE ATTRIBUTE BYTE      08600000
&SSCROK  SETA  1                   SUBSCRIPT ALLOWED                    08650000
&NOTMOD  SETA  2                   VARIABLE NOT MODIFIABLE              08700000
&MODSPEC SETA  3                   VARIABLE MODIFIABLE WITH SPECIFIC    08750000
.*                                 VALUES ONLY (E.G. NAMETYPE)          08800000
&CHARHEX SETA  4                   VARIABLE IS CHARACTER OR HEX         08850000
&SSTROK  SETA  5                   SUBSTRING ALLOWED                    08900000
.*                                                                      08950000
&YES     SETC  '1'                 CONSTANTS TO TEST EACH ATTRIBUTE     09000000
&NO      SETC  '0'                                                      09050000
.*                                                                      09100000
&DIGITS  SETC  '0123456789'        CONSTANT FOR VALIDITY-CHECKING       09150000
&HIGITS  SETC  '0123456789ABCDEF'                                       09200000
.*                                                                      09250000
&SX      SETC  '&SYSNDX'           SHORT INDEX FOR LABELS               09300000
.*                                                                      09350000
&EVENT(1)  SETC  '0100'            EVENT CODE VALUES                    09400000
&EVENT(2)  SETC  '0201'                                                 09450000
&EVENT(3)  SETC  '0202'                                                 09500000
&EVENT(4)  SETC  '0203'                                                 09550000
&EVENT(5)  SETC  '0204'                                                 09600000
&EVENT(6)  SETC  '0205'                                                 09650000
&EVENT(7)  SETC  '0301'                                                 09700000
&EVENT(8)  SETC  '0302'                                                 09750000
&EVENT(9)  SETC  '0303'                                                 09800000
&EVENT(10) SETC  '0401'                                                 09850000
&EVENT(11) SETC  '0402'                                                 09900000
&EVENT(12) SETC  '0501'                                                 09950000
&EVENT(13) SETC  '0502'                                                 10000000
&EVENT(14) SETC  '0601'                                                 10050000
&EVENT(15) SETC  '0602'                                                 10100000
&EVENT(16) SETC  '0603'                                                 10150000
&EVENT(17) SETC  '0701'                                                 10200000
&EVENT(18) SETC  '0702'                                                 10250000
&EVENT(19) SETC  '0801'                                                 10300000
&EVENT(20) SETC  '0802'                                                 10350000
&EVENT(21) SETC  '0900'                                                 10400000
&EVENT(22) SETC  '0D00'            RACXTRT     @01A                     10425000
.*                                                                      10450000
&VARNAM(1)  SETC 'GQ'              VARIABLE NAMES                       10500000
&VARNAM(2)  SETC 'UQ'                                                   10550000
&VARNAM(3)  SETC 'VOLUME'                                               10600000
&VARNAM(4)  SETC ' '                                                    10650000
&VARNAM(5)  SETC ' '                                                    10700000
&VARNAM(6)  SETC 'QUAL'                                                 10750000
&VARNAM(7)  SETC 'WKA'                                                  10800000
&VARNAM(8)  SETC 'WKB'                                                  10850000
&VARNAM(9)  SETC 'WKC'                                                  10900000
&VARNAM(10) SETC ' '                                                    10950000
&VARNAM(11) SETC ' '                                                    11000000
&VARNAM(12) SETC 'OLDVOL'                                               11050000
&VARNAM(13) SETC ' '                                                    11100000
&VARNAM(14) SETC 'QCT'                                                  11150000
&VARNAM(15) SETC 'VCT'                                                  11200000
&VARNAM(16) SETC 'EVENT'                                                11250000
&VARNAM(17) SETC 'WKX'                                                  11300000
&VARNAM(18) SETC 'WKY'                                                  11350000
&VARNAM(19) SETC 'WKZ'                                                  11400000
&VARNAM(20) SETC ' '                                                    11450000
&VARNAM(21) SETC ' '                                                    11500000
&VARNAM(22) SETC ' '                                                    11550000
&VARNAM(23) SETC 'NAMETYPE'                                             11600000
&VARNAM(24) SETC 'USER'                                                 11650000
&VARNAM(25) SETC 'GROUP'                                                11700000
&VARNAM(26) SETC 'UNKNOWN'                                              11750000
&VARNAM(27) SETC 'RACUID'                                               11800000
&VARNAM(28) SETC 'RACGPID'                                              11850000
&VARNAM(29) SETC 'G'                                                    11900000
&VARNAM(30) SETC 'U'                                                    11950000
&VARNAM(31) SETC 'V'                                                    12000000
&VARNAM(32) SETC 'RACUID3'                                         @02A 12016600
&VARNAM(33) SETC 'RACGPID3'                                        @02A 12033200
.*                                                                      12050000
.*                                 VARIABLE LENGTHS                     12100000
&VARLEN(1)  SETA 44                GQ                          @ZA78496 12150000
&VARLEN(2)  SETA 44                UQ                          @ZA78496 12200000
&VARLEN(3)  SETA 6                 VOLUME                               12250000
&VARLEN(4)  SETA 0                                                      12300000
&VARLEN(5)  SETA 0                                                      12350000
&VARLEN(6)  SETA 8                 QUAL                                 12400000
&VARLEN(7)  SETA 8                 WKA                                  12450000
&VARLEN(8)  SETA 8                 WKB                                  12500000
&VARLEN(9)  SETA 8                 WKC                                  12550000
&VARLEN(10) SETA 0                                                      12600000
&VARLEN(11) SETA 0                                                      12650000
&VARLEN(12) SETA 6                 OLDVOL                               12700000
&VARLEN(13) SETA 0                                                      12750000
&VARLEN(14) SETA 2                 QCT                                  12800000
&VARLEN(15) SETA 2                 VCT                                  12850000
&VARLEN(16) SETA 2                 EVENT                                12900000
&VARLEN(17) SETA 2                 WKX                                  12950000
&VARLEN(18) SETA 2                 WKY                                  13000000
&VARLEN(19) SETA 2                 WKZ                                  13050000
&VARLEN(20) SETA 0                                                      13100000
&VARLEN(21) SETA 0                                                      13150000
&VARLEN(22) SETA 0                                                      13200000
&VARLEN(23) SETA 1                 NAMETYPE                             13250000
&VARLEN(24) SETA 1                 USER                                 13300000
&VARLEN(25) SETA 1                 GROUP                                13350000
&VARLEN(26) SETA 1                 UNKNOWN                              13400000
&VARLEN(27) SETA 8                 RACUID                               13450000
&VARLEN(28) SETA 8                 RACGPID                              13500000
&VARLEN(29) SETA 1                 G                                    13550000
&VARLEN(30) SETA 1                 U                                    13600000
&VARLEN(31) SETA 1                 V                                    13650000
&VARLEN(32) SETA 8                 RACUID3                         @02A 13666600
&VARLEN(33) SETA 8                 RACGPID3                        @02A 13683200
.*                                                                      13700000
.****************************************************************       13750000
.* ATTRIBUTE TABLE FOR VARIABLES                                        13800000
.* THE BITS IN EACH BYTE HAVE THE FOLLOWING SIGNIFICANCE:               13850000
.*     BIT0 - VARIABLE IS SUBSCRIPTABLE                                 13900000
.*     BIT1 - VARIABLE IS NOT MODIFIABLE                                13950000
.*     BIT2 - VARIABLE IS MODIFIABLE WITH CERTAIN VALUES ONLY           14000000
.*     BIT3 - VARIABLE IS CHARACTER OR HEX (NOT DECIMAL)                14050000
.*     BIT4 - VARIABLE IS SUBSTRINGABLE                                 14100000
.*     BIT5-7 RESERVED                                                  14150000
.****************************************************************       14200000
.*                                                                      14250000
&VARATT(1)  SETC '11011000'        GQ                                   14300000
&VARATT(2)  SETC '10011000'        UQ                                   14350000
&VARATT(3)  SETC '11011000'        VOLUME                               14400000
&VARATT(4)  SETC '00000000'                                             14450000
&VARATT(5)  SETC '00000000'                                             14500000
&VARATT(6)  SETC '00011000'        QUAL                                 14550000
&VARATT(7)  SETC '00011000'        WKA                                  14600000
&VARATT(8)  SETC '00011000'        WKB                                  14650000
&VARATT(9)  SETC '00011000'        WKC                                  14700000
&VARATT(10) SETC '00000000'                                             14750000
&VARATT(11) SETC '00000000'                                             14800000
&VARATT(12) SETC '01011000'        OLDVOL                               14850000
&VARATT(13) SETC '00000000'                                             14900000
&VARATT(14) SETC '01000000'        QCT                                  14950000
&VARATT(15) SETC '01000000'        VCT                                  15000000
&VARATT(16) SETC '01011000'        EVENT                   @ZA94668     15050000
&VARATT(17) SETC '00000000'        WKX                                  15100000
&VARATT(18) SETC '00000000'        WKY                                  15150000
&VARATT(19) SETC '00000000'        WKZ                                  15200000
&VARATT(20) SETC '00000000'                                             15250000
&VARATT(21) SETC '00000000'                                             15300000
&VARATT(22) SETC '00000000'                                             15350000
&VARATT(23) SETC '00111000'        NAMETYPE                             15400000
&VARATT(24) SETC '01011000'        USER                                 15450000
&VARATT(25) SETC '01011000'        GROUP                                15500000
&VARATT(26) SETC '01011000'        UNKNOWN                              15550000
&VARATT(27) SETC '01011000'        RACUID                               15600000
&VARATT(28) SETC '01011000'        RACGPID                              15650000
&VARATT(29) SETC '00000000'        G                                    15700000
&VARATT(30) SETC '00000000'        U                                    15750000
&VARATT(31) SETC '00000000'        V                                    15800000
&VARATT(32) SETC '01011000'        RACUID3                         @02A 15816600
&VARATT(33) SETC '01011000'        RACGPID3                        @02A 15833200
.*                                                                      15850000
.SKIPINT ANOP  ,                   LABEL TO BYPASS INITIALIZATION       15900000
.****************************************************************       15950000
.* TEST THE POSITIONAL PARAMETER TO SEE WHAT TYPE OF ICHNCONV           16000000
.* HAS BEEN ISSUED                                                      16050000
.****************************************************************       16100000
.*                                                                      16150000
         AIF   ('&TYPE' EQ 'SELECT').SEL00                              16200000
         AIF   ('&TYPE' EQ 'ACTION').ACT00                              16250000
         AIF   ('&TYPE' EQ 'END').END00                                 16300000
         AIF   ('&TYPE' EQ 'FINAL').FIN00                               16350000
         AIF   ('&TYPE' NE 'DEFINE').ERR09   INVALID TYPE SPECIFIED     16400000
.*                                                                      16450000
.****************************************************************       16500000
.****                                                        ****       16550000
.**** CONVENTION DEFINITION PROCESSING (DEFINE)              ****       16600000
.****                                                        ****       16650000
.****************************************************************       16700000
.*                                                                      16750000
         AIF   (&ICHINPR).ERR02    ERROR IF CONVENTION IN PROGRESS      16800000
         AIF   (&ICHENDT).ERR11    ERROR IF END OF TABLE REACHED        16850000
         AIF   ('&COND&SET&NEXT' NE '').ERR01   INVALID KEYWORD FOR     16900000
.*                                 SPECIFIED TYPE                       16950000
&PARAM   SETC  'NAME'              SET VALUE OF PARM BEING CHECKED      17000000
         AIF   ('&NAME' EQ '').ERR10   REQUIRED PARAMETER 'NAME'        17050000
.*                                 NOT SPECIFIED                        17100000
         AIF   (&ICHFSTC).DEF01    NOT FIRST CONVENTION IN TABLE        17150000
.*                                                                      17200000
.*********************************************************************  17250000
.* BUILD TABLE HEADER                                                   17300000
.*********************************************************************  17350000
.*                                                                      17400000
&ICHFSTC SETB  1                   FIRST CONVENTION ENCOUNTERED         17450000
&ICHCV#  SETA  0                   INITIALIZE CONVENTION COUNT          17500000
.*                                                                      17550000
.*       CREATE LINKAGE EDITOR CONTROL CARD FOR ENTRY POINT             17600000
.*                                                                      17650000
         PUNCH ' ENTRY ICHNCV00'                                        17700000
         PUNCH ' MODE AMODE(31),RMODE(ANY)'                             17733300
.*                                                                 @P0A 17766600
.*                                                                      17769600
.*       CREATE LINKAGE EDITOR ESD CARD INFORMATION                     17772600
.*              (CSECT, AMODE, RMODE)                              @P1A 17775600
.*                                                                      17778600
ICHNCV00 AMODE 31                                                       17781600
.*                                                                 @P1A 17784600
ICHNCV00 RMODE ANY                                                      17787600
.*                                                                 @P1A 17790600
ICHNCV01 RMODE ANY                                                      17793600
.*                                                                 @P1A 17796600
ICHNCV00 CSECT                                                          17800000
ICH&SX.A DS    0F                  START OF NAMING CONVENTION TABLE     17850000
         DC    CL4'NCON'           TABLE IDENTIFIER                     17900000
         DC    XL1'00'             VERSION NUMBER                       17950000
         DC    XL3'000000'         RESERVED                             18000000
         DC    CL8'ICHNCV00'       CSECT NAME                           18050000
         DC    CL8'&SYSDATE'       ASSEMBLY DATE                        18100000
         DC    CL8'&SYSTIME'       ASSEMBLY TIME                        18150000
ICH&SX.B DC    AL4(ICHLST)         ADDRESS OF LAST CONVENTION IN TABLE  18200000
         DC    AL4(ICH&SX.C-ICH&SX.A) HEADER LENGTH                     18250000
         DC    XL8'0000000000000000' RESERVED                           18300000
ICH&SX.C DS    0F                  END OF TABLE HEADER                  18350000
ICHNCV01 CSECT                                                          18400000
         DC    C'ICHNCV01'         LITERAL CSECT                        18450000
ICHNCV00 CSECT                                                          18500000
&LX      SETA  0                   INITIALIZE LITERAL INDEX             18550000
&BX      SETA  0                   INITIALIZE SUBSCRIPT LABEL INDEX     18600000
.*                                                                      18650000
.*********************************************************************  18700000
.* CREATE CONVENTION HEADER                                             18750000
.*********************************************************************  18800000
.*                                                                      18850000
.DEF01   ANOP  ,                                                        18900000
         AIF   (&ICHCV# EQ 0).DEF02    BYPASS SETTING THE               18950000
.*                                 NEXT FIELD OF THE PRIOR CONVENTION'S 19000000
.*                                 HEADER                               19050000
         ORG   ICH&ICHCV#.D+8      OVERLAY CONVENTION HEADER            19100000
         DC    AL4(&ICHNXTL)       ADDRESS OF NEXT CONVENTION HEADER    19150000
         ORG                                                            19200000
.DEF02   ANOP  ,                                                        19250000
&NX      SETA  &ICHCV#+1           CREATE THIS CONVENTION'S NUMBER      19300000
&NAME    DS    0H                                                       19350000
ICH&NX.D DS    0H                                                       19400000
         DC    CL8'&NAME'          CONVENTION NAME                      19450000
         DC    AL4(0)              ADDRESS OF NEXT CONVENTION           19500000
         DC    AL1(0)              COUNT OF SELECT MACROS IN CONVENTION 19550000
         DC    AL1(0)              COUNT OF ACTION MACROS IN CONVENTION 19600000
         DC    AL1(0)              FLAGS                                19650000
         DC    XL9'000000000000000000' RESERVED                         19700000
&ICHINPR SETB  1                   SET CONVENTION IN PROGRESS FLAG      19750000
&ICHNXT  SETB  0                   FORGET LAST CONVENTION'S NEXT VALUE  19800000
&ICHSELC SETA  0                   CLEAR SELECT/ACTION COUNTERS         19850000
&ICHACTC SETA  0                                                        19900000
&ICHCV#  SETA  &ICHCV#+1           INCREMENT CONVENTION COUNT           19950000
         AIF   (&ICHCV# GT 400).ERR17  TOO MANY LABELS STORED           20000000
&ICHCVN(&ICHCV#) SETC '&NAME'      SAVE CONVENTION NAME                 20050000
         AGO  .CONVEX              EXIT THE MACRO                       20100000
.*                                                                      20150000
.*********************************************************************  20200000
.****                                                             ****  20250000
.**** CONDITIONAL SELECTION PROCESSING (SELECT)                   ****  20300000
.****                                                             ****  20350000
.*********************************************************************  20400000
.*                                                                      20450000
.SEL00   ANOP  ,                                                        20500000
         AIF   (NOT &ICHINPR).ERR12     ERROR IF NO CONVENTION IN       20550000
.*                                  PROGRESS                            20600000
         AIF   (&ICHSELL).ERR03     ERROR IF THE LAST SELECTION MACRO   20650000
.*                                  HAS BEEN ENCOUNTERED                20700000
         AIF   (&ICHACTF).ERR13     ERROR IF AN ACTION MACRO HAS BEEN   20750000
.*                                  FOUND                               20800000
&ICHSELF SETB  1                    SET SELECT FOUND FLAG ON            20850000
         AIF   ('&NAME&SET&NEXT' NE '').ERR01  INVALID KEYWORDS WITH    20900000
.*                                  SELECT MACRO                        20950000
&PARAM   SETC  'COND'             SET VALUE OF PARM BEING CHECKED       21000000
         AIF   ('&COND' EQ '').ERR10  COND IS A REQUIRED PARAMETER      21050000
.*                                  ON THE SELECT MACRO                 21100000
.*********************************************************************  21150000
.* VALIDATE CONDITIONAL OPERATOR                                        21200000
.*********************************************************************  21250000
.*                                                                      21300000
&ABIT0   SETA  0                    INITIALIZE BITS FOR OPERATOR MASK   21350000
&ABIT1   SETA  0                                                        21400000
&ABIT2   SETA  0                                                        21450000
&ABIT3   SETA  0                                                        21500000
&ABIT4   SETA  0                   THESE 4 BITS MUST BE ZERO            21550000
&ABIT5   SETA  0                                                        21600000
&ABIT6   SETA  0                                                        21650000
&ABIT7   SETA  0                                                        21700000
         AIF   ('&COND(2)' EQ '').ERR14  ERROR IF NO OPERATOR ON THE    21750000
.*                                   CONDITION                          21800000
         AIF   ('&COND(2)' NE 'GT').SEL01  NOT GREATER-THAN             21850000
&ABIT2   SETA  1                     OPERATOR MASK=X'20'                21900000
         AGO   .SEL10                LEAVE OPERATOR VALIDATION          21950000
.SEL01   ANOP  ,                                                        22000000
         AIF   ('&COND(2)' NE 'LT').SEL02  NOT LESS-THAN                22050000
&ABIT1   SETA  1                     OPERATOR MASK=X'40'                22100000
         AGO   .SEL10                LEAVE OPERATOR VALIDATION          22150000
.SEL02   ANOP  ,                                                        22200000
         AIF   ('&COND(2)' NE 'NE').SEL03  NOT NOT-EQUAL                22250000
&ABIT1   SETA  1                                                        22300000
&ABIT2   SETA  1                     OPERATOR MASK=X'60'                22350000
         AGO   .SEL10                LEAVE OPERATOR VALIDATION          22400000
.SEL03   ANOP  ,                                                        22450000
         AIF   ('&COND(2)' NE 'EQ').SEL04  NOT EQUAL                    22500000
&ABIT0   SETA  1                     OPERATOR MASK=X'80'                22550000
         AGO   .SEL10                LEAVE OPERATOR VALIDATION          22600000
.SEL04   ANOP  ,                                                        22650000
         AIF   ('&COND(2)' NE 'GE').SEL05  NOT GREATER-THAN-OR-EQUAL    22700000
&ABIT0   SETA  1                                                        22750000
&ABIT2   SETA  1                     OPERATOR MASK=X'A0'                22800000
         AGO   .SEL10                LEAVE OPERATOR VALIDATION          22850000
.SEL05   ANOP  ,                                                        22900000
         AIF   ('&COND(2)' NE 'LE').ERR14  NOT LESS-THAN-OR-EQUAL,      22950000
.*                                   OPERATOR IS AN INVALID VALUE       23000000
&ABIT0   SETA  1                                                        23050000
&ABIT1   SETA  1                     OPERATOR MASK=X'C0'                23100000
.SEL10   ANOP  ,                     END OF OPERATOR VALIDATION         23150000
.*                                                                      23200000
.*********************************************************************  23250000
.* VALIDATE CONDITIONAL LINKAGE FIELDS                                  23300000
.*********************************************************************  23350000
.*                                                                      23400000
&BBIT0   SETA  0                          INITIALIZE BITS FOR           23450000
.*                                        SELECTION FLAG BYTE           23500000
&BBIT1   SETA  0                                                        23550000
&BBIT2   SETA  0                                                        23600000
&BBIT3   SETA  0                                                        23650000
&BBIT4   SETA  0                                                        23700000
&BBIT5   SETA  0                                                        23750000
&BBIT6   SETA  0                                                        23800000
&BBIT7   SETA  0                                                        23850000
&BBIT0   SETA  1                          SET SELECT-GENERATED BIT      23900000
         AIF   ('&COND(4)' EQ '').SEL18   NO CONDITIONAL LINKAGE        23950000
         AIF   ('&COND(4)' EQ 'OR').SEL12   OR LINKAGE SPECIFIED        24000000
         AIF   ('&COND(4)' NE 'AND').ERR15  CONDITIONAL LINKAGE ERROR,  24050000
.*                                        LINKAGE NEITHER AND NOR OR    24100000
&BBIT1   SETA  1                          SET AND LINKAGE BIT           24150000
         AGO   .SEL20                     LEAVE LINKAGE VALIDATION      24200000
.SEL12   ANOP  ,                                                        24250000
&BBIT2   SETA  1                          SET OR LINKAGE BIT            24300000
         AGO   .SEL20                     LEAVE LINKAGE VALIDATION      24350000
.SEL18   ANOP  ,                          NO LINKAGE FIELD SPECIFIED    24400000
&ICHSELL SETB  1                          MARK THIS AS THE LAST SELECT  24450000
.SEL20   ANOP  ,                          END OF LINKAGE VALIDATION     24500000
.*********************************************************************  24550000
.* GENERATE FLAG BYTE CODE                                              24600000
.*********************************************************************  24650000
.*                                                                      24700000
         DC    B'&BBIT0&BBIT1&BBIT2&BBIT3&BBIT4&BBIT5&BBIT6&BBIT7'      24750000
.*                                                                      24800000
.*********************************************************************  24850000
.* GENERATE OPERATOR BYTE CODE                                          24900000
.*********************************************************************  24950000
.*                                                                      25000000
         DC    B'&ABIT0&ABIT1&ABIT2&ABIT3&ABIT4&ABIT5&ABIT6&ABIT7'      25050000
.*                                                                      25100000
.*                                                                      25150000
.*********************************************************************  25200000
.* VALIDATE AND BUILD CODE FOR FIRST OPERAND USING THE ICHNCV ROUTINE.  25250000
.* THE FOLLOWING SET SYMBOLS ARE SET IN ADVANCE:                        25300000
.*      - OPERAND TO BE VALIDATED       (OPND)                          25350000
.*      - OPERAND'S NUMBER              (OPNO)                          25400000
.*      - RETURN LABEL                  (RETL)                          25450000
.* MNOTES ARE GENERATED BY THE ICHNCV ROUTINE.                          25500000
.*********************************************************************  25550000
.*                                                                      25600000
         AIF   ('&COND(1)' EQ '').ERR16  ERROR, NO FIRST OPERAND        25650000
&OPND    SETC  '&COND(1)'          SET OPERAND NAME                     25700000
&OPNO    SETA  1                   SET OPERAND NUMBER                   25750000
&RETL    SETA  1                   SET RETURN ADDRESS                   25800000
         AGO   .ICHNCV             BRANCH TO OPERAND ROUTINE            25850000
.SEL25   ANOP  ,                   RETURN ADDRESS                       25900000
.*                                                                      25950000
.*********************************************************************  26000000
.* VALIDATE AND BUILD CODE FOR SECOND OPERAND USING THE ICHNCV ROUTINE. 26050000
.* THE FOLLOWING SET SYMBOLS ARE SET IN ADVANCE:                        26100000
.*      - OPERAND TO BE VALIDATED       (OPND)                          26150000
.*      - OPERAND'S NUMBER              (OPNO)                          26200000
.*      - RETURN LABEL                  (RETL)                          26250000
.* MNOTES ARE GENERATED BY THE ICHNCV ROUTINE.                          26300000
.*********************************************************************  26350000
.*                                                                      26400000
         AIF   ('&COND(3)' EQ '').ERR16  ERROR, NO SECOND OPERAND       26450000
&OPND    SETC  '&COND(3)'          SET OPERAND NAME                     26500000
&OPNO    SETA  2                   SET OPERAND NUMBER                   26550000
&RETL    SETA  2                   SET RETURN ADDRESS                   26600000
         AGO   .ICHNCV             BRANCH TO OPERAND ROUTINE            26650000
.SEL30   ANOP  ,                   RETURN ADDRESS                       26700000
.*                                                                      26750000
.*********************************************************************  26800000
.* CHECK THAT THE TWO OPERANDS HAVE THE SAME TYPE                       26850000
.* BY COMPARING THEIR ATTRIBUTE BYTES, AS DETERMINED BY                 26900000
.* ICHNCVAL.                                                            26950000
.*********************************************************************  27000000
.*                                                                      27050000
         AIF   (('&OPA(1)'(&CHARHEX,1) EQ '&YES') AND                  *27100000
               ('&OPA(2)'(&CHARHEX,1) EQ '&YES')).SEL40                 27150000
.*                                 THE TWO OPERANDS MATCH IN TYPE-      27200000
.*                                 (BOTH CHARACTER OR HEX)              27250000
         AIF   (('&OPA(1)'(&CHARHEX,1) EQ  '&NO') AND                  *27300000
               ('&OPA(2)'(&CHARHEX,1) EQ  '&NO')).SEL40                 27350000
.*                                 THE TWO OPERANDS MATCH IN TYPE-      27400000
.*                                 (BOTH DECIMAL)                       27450000
         AGO  .ERR07               OTHERWISE, ITS AN ERROR              27500000
.SEL40   ANOP  ,                                                        27550000
&ICHSELC SETA  &ICHSELC+1          INCREMENT COUNT OF SELECTS           27600000
         AGO  .CONVEX              END OF SELECT PROCESSING             27650000
.*                                                                      27700000
.*********************************************************************  27750000
.****                                                             ****  27800000
.**** ACTION PROCESSING                (ACTION)                   ****  27850000
.****                                                             ****  27900000
.*********************************************************************  27950000
.*                                                                      28000000
.ACT00   ANOP  ,                                                        28050000
         AIF   (NOT &ICHINPR).ERR12     ERROR IF NO CONVENTION IN       28100000
.*                                  PROGRESS                            28150000
         AIF   (&ICHSELF AND NOT &ICHSELL).ERR04  ERROR IF A SELECT WAS 28200000
.*                                  FOUND THAT IS NOT THE LAST SELECT   28250000
&ICHACTF SETB  1                    SET ACTION FOUND FLAG ON            28300000
         AIF   ('&NAME&COND&NEXT' NE '').ERR01  INVALID KEYWORDS WITH   28350000
.*                                  ACTION MACRO                        28400000
&PARAM   SETC  'SET'               SET VALUE OF PARM BEING CHECKED      28450000
         AIF   ('&SET' EQ '').ERR10   SET IS A REQUIRED PARAMETER       28500000
.*                                  ON THE ACTION MACRO                 28550000
.*********************************************************************  28600000
.* GENERATE ACTION FLAG BYTE                                            28650000
.*********************************************************************  28700000
.*                                                                      28750000
&BBIT0   SETA  0                          INITIALIZE BITS FOR           28800000
.*                                        ACTION FLAG BYTE              28850000
&BBIT1   SETA  0                                                        28900000
&BBIT2   SETA  0                                                        28950000
&BBIT3   SETA  0                                                        29000000
&BBIT4   SETA  0                                                        29050000
&BBIT5   SETA  0                                                        29100000
&BBIT6   SETA  0                                                        29150000
&BBIT7   SETA  0                                                        29200000
.*                                                                      29250000
.*********************************************************************  29300000
.* GENERATE FLAG BYTE CODE                                              29350000
.*********************************************************************  29400000
.*                                                                      29450000
         DC    B'&BBIT0&BBIT1&BBIT2&BBIT3&BBIT4&BBIT5&BBIT6&BBIT7'      29500000
         DC    XL1'00'             RESERVED                             29550000
.*                                                                      29600000
.*********************************************************************  29650000
.* VALIDATE AND BUILD CODE FOR FIRST OPERAND USING THE ICHNCV ROUTINE.  29700000
.* THE FOLLOWING SET SYMBOLS ARE SET IN ADVANCE:                        29750000
.*      - OPERAND TO BE VALIDATED       (OPND)                          29800000
.*      - OPERAND'S NUMBER              (OPNO)                          29850000
.*      - RETURN LABEL                  (RETL)                          29900000
.* MNOTES ARE GENERATED BY THE ICHNCV ROUTINE.                          29950000
.*********************************************************************  30000000
.*                                                                      30050000
         AIF   ('&SET(1)' EQ '').ERR16  ERROR, NO FIRST OPERAND         30100000
&OPND    SETC  '&SET(1)'           SET OPERAND NAME                     30150000
&OPNO    SETA  1                   SET OPERAND NUMBER                   30200000
&RETL    SETA  3                   SET RETURN ADDRESS                   30250000
         AGO   .ICHNCV             BRANCH TO OPERAND ROUTINE            30300000
.ACT25   ANOP  ,                   RETURN ADDRESS                       30350000
.*                                                                      30400000
.*********************************************************************  30450000
.* VALIDATE AND BUILD CODE FOR SECOND OPERAND USING THE ICHNCV ROUTINE. 30500000
.* THE FOLLOWING SET SYMBOLS ARE SET IN ADVANCE:                        30550000
.*      - OPERAND TO BE VALIDATED       (OPND)                          30600000
.*      - OPERAND'S NUMBER              (OPNO)                          30650000
.*      - RETURN LABEL                  (RETL)                          30700000
.* MNOTES ARE GENERATED BY THE ICHNCV ROUTINE.                          30750000
.*********************************************************************  30800000
.*                                                                      30850000
         AIF   ('&SET(2)' EQ '').ERR16  ERROR, NO SECOND OPERAND        30900000
&OPND    SETC  '&SET(2)'           SET OPERAND NAME                     30950000
&OPNO    SETA  2                   SET OPERAND NUMBER                   31000000
&RETL    SETA  4                   SET RETURN ADDRESS                   31050000
         AGO   .ICHNCV             BRANCH TO OPERAND ROUTINE            31100000
.ACT30   ANOP  ,                   RETURN ADDRESS                       31150000
.*                                                                      31200000
.*********************************************************************  31250000
.* CHECK THAT THE TWO OPERANDS HAVE THE SAME TYPE                       31300000
.* BY COMPARING THEIR ATTRIBUTE BYTES, AS DETERMINED BY                 31350000
.* ICHNCVAL.                                                            31400000
.*********************************************************************  31450000
.*                                                                      31500000
         AIF   (('&OPA(1)'(&CHARHEX,1) EQ '&YES') AND                  *31550000
               ('&OPA(2)'(&CHARHEX,1) EQ '&YES')).ACT40                 31600000
.*                                 THE TWO OPERANDS MATCH IN TYPE-      31650000
.*                                 (BOTH CHARACTER OR HEX)              31700000
         AIF   (('&OPA(1)'(&CHARHEX,1) EQ  '&NO') AND                  *31750000
               ('&OPA(2)'(&CHARHEX,1) EQ  '&NO')).ACT40                 31800000
.*                                 THE TWO OPERANDS MATCH IN TYPE-      31850000
.*                                 (BOTH DECIMAL)                       31900000
         AGO  .ERR07               OTHERWISE, ITS AN ERROR              31950000
.ACT40   ANOP  ,                                                        32000000
&ICHACTC SETA  &ICHACTC+1          INCREMENT COUNT OF ACTIONS           32050000
         AGO  .CONVEX              END OF ACTION PROCESSING             32100000
.*                                                                      32150000
.*********************************************************************  32200000
.****                                                             ****  32250000
.**** END OF CONVENTION PROCESSING   (END)                        ****  32300000
.****                                                             ****  32350000
.*********************************************************************  32400000
.*                                                                      32450000
.END00   ANOP  ,                                                        32500000
         AIF   (NOT &ICHINPR).ERR12  ERROR IF CONVENTION NOT ALREADY    32550000
.*                                 IN PROGRESS                          32600000
         AIF   (&ICHSELF AND NOT &ICHSELL).ERR04  ERROR IF A SELECT     32650000
.*                                 FOUND THAT IS NOT THE LAST SELECT    32700000
.END01   ANOP                                                           32750000
         AIF   ('&NAME&COND&SET' NE '').ERR01  INVALID PARAMETERS ON    32800000
.*                                 END MACRO                            32850000
.*********************************************************************  32900000
.* TURN OFF GLOBAL PROCESSING FLAGS                                     32950000
.*********************************************************************  33000000
.*                                                                      33050000
&ICHINPR SETB  0                   CONVENTION NO LONGER IN PROGRESS     33100000
&ICHSELF SETB  0                   TURN OFF SELECT FOUND FLAG           33150000
&ICHACTF SETB  0                   TURN OFF ACTION FOUND FLAG           33200000
&ICHSELL SETB  0                   TURN OFF LAST SELECT FLAG            33250000
.*                                                                      33300000
&BBIT0   SETA  0                   INITIALIZE FLAG BITS                 33350000
&BBIT1   SETA  0                                                        33400000
&BBIT2   SETA  0                                                        33450000
&BBIT3   SETA  0                                                        33500000
&BBIT4   SETA  0                                                        33550000
&BBIT5   SETA  0                                                        33600000
&BBIT6   SETA  0                                                        33650000
&BBIT7   SETA  0                                                        33700000
&ICHNXTL SETC  '0'                 NEXT CONVENTION                      33750000
         AIF   ('&NEXT' EQ '').END03  NEXT NOT SPECIFIED, DEFAULT       33800000
.*                                 TO NEXT=NEXT                         33850000
         AIF   ('&NEXT' EQ '''SUCCESS''').END04  NEXT=SUCCESS SPECIFIED 33900000
         AIF   ('&NEXT' EQ '''ERROR''').END04    NEXT=ERROR SPECIFIED   33950000
.END02   ANOP  ,                   NEXT=CONVENTION NAME OR NEXT         34000000
&ICHNXT  SETB  1                   CONVENTION SPECIFIED NEXT=CONVENTION 34050000
.*                                 OR NEXT=NEXT                         34100000
         AIF   ('&NEXT' EQ '''NEXT''').END03  NEXT=NEXT SPECIFIED       34150000
.*                                                                      34200000
.********************************************************************   34250000
.* NEXT=CONVENTION NAME SPECIFIED.  CHECK IT FOLLOWS CURRENT            34300000
.* CONVENTION.                                                          34350000
.********************************************************************   34400000
.*                                                                      34450000
&I       SETA  1                   SET UP TO LOOP THRU ICHCVN           34500000
.LP      AIF   ('&ICHCVN(&I)' EQ '&NEXT').ERR06  ERROR, ATTEMPT TO LOOP 34550000
.*                                 UPWARD IN TABLE                      34600000
&I       SETA  &I+1                LOOK AT NEXT ICHCVN ENTRY            34650000
         AIF   (&I LE &ICHCV#).LP  MORE ENTRIES IN ICHCVN               34700000
&ICHNXTL SETC  '&NEXT'             SET UP NEXT CONVENTION LABEL         34750000
&ICHNXT  SETB  1                   CONVENTION SPECIFIED NEXT=CONVENTION 34800000
.*                                 OR NEXT=NEXT                         34850000
         AGO   .END10                                                   34900000
.END03   ANOP  ,                   NEXT=NEXT SPECIFIED                  34950000
&ICHNXT  SETB  1                   CONVENTION SPECIFIED NEXT=CONVENTION 35000000
.*                                 OR NEXT=NEXT                         35050000
.END04   ANOP  ,                                                        35100000
&NX      SETA  &ICHCV#+1           POSITION OF NEXT CONVENTION          35150000
&ICHNXTL SETC  'ICH&NX.D'          NEXT CONVENTION LABEL                35200000
         AIF   ('&NEXT' NE '''SUCCESS''').END06 NOT NEXT=SUCCESS        35250000
&BBIT0   SETA  1                   NEXT=SUCCESS                         35300000
         AGO   .END10                                                   35350000
.END06   ANOP  ,                                                        35400000
         AIF   ('&NEXT' NE '''ERROR''').END10 NOT NEXT=ERROR            35450000
&BBIT1   SETA  1                   NEXT=ERROR                           35500000
.END10   ANOP  ,                                                        35550000
.*                                                                      35600000
.********************************************************************   35650000
.* PARTIALLY COMPLETE CONVENTION HEADER.  NEXT CONVENTION ADDRESS       35700000
.* IS SET BY NEXT CONVENTION'S DEFINE MACRO.                            35750000
.********************************************************************   35800000
.*                                                                      35850000
         AIF   (&ICHSELC GT 255).ERR25   TOO MANY SELECT MACROS         35900000
         AIF   (&ICHACTC GT 255).ERR25   TOO MANY ACTION MACROS         35950000
         ORG   &ICHCVN(&ICHCV#)+12 OVERLAY CONVENTION HEADER            36000000
         DC    AL1(&ICHSELC)       COUNT OF SELECT MACROS               36050000
         DC    AL1(&ICHACTC)       COUNT OF ACTION MACROS               36100000
         DC    B'&BBIT0&BBIT1&BBIT2&BBIT3&BBIT4&BBIT5&BBIT6&BBIT7'      36150000
         ORG                                                            36200000
         AGO  .CONVEX              EXIT THE MACRO                       36250000
.*                                                                      36300000
.*********************************************************************  36350000
.****                                                             ****  36400000
.**** END OF CONVENTION TABLE PROCESSING  (FINAL)                 ****  36450000
.****                                                             ****  36500000
.*********************************************************************  36550000
.*                                                                      36600000
.FIN00   ANOP  ,                                                        36650000
         AIF   ('&COND&SET&NEXT&NAME' NE '').ERR01 INVALID KEYWORD FOR  36700000
         AIF   (&ICHINPR).ERR02    ERROR IF CONVENTION STILL IN         36750000
.*                                 PROGRESS                             36800000
&ICHENDT SETB  1                   INDICATE END OF TABLE REACHED        36850000
&ICHFSTC SETB  0                   TURN OFF FIRST CONVENTION FLAG       36900000
.*                                                                      36950000
.*********************************************************************  37000000
.* RESET TO NEXT=SUCCESS IF NEXT=NEXT OR NEXT=CONVENTION WAS GIVEN      37050000
.* ON LAST CONVENTION'S END MACRO.                                      37100000
.*********************************************************************  37150000
.*                                                                      37200000
         AIF   (NOT &ICHNXT).FIN02 NO NEED TO RESET LAST CONVENTION'S   37250000
.*                                 HEADER FOR NEXT VALUE                37300000
&ICHNXT  SETB  0                   TURN OFF LAST CONVENTION'S NEXT FLAG 37350000
         ORG   ICH&ICHCV#.D+14     OVERLAY CONVENTION HEADER            37400000
         DC    B'10000000'         NEXT=SUCCESS                         37450000
         ORG                                                            37500000
.*                                                                      37550000
.*********************************************************************  37600000
.* COMPLETE TABLE HEADER                                                37650000
.*********************************************************************  37700000
.*                                                                      37750000
.FIN02   ANOP  ,                                                        37800000
ICHLST   EQU   &ICHCVN(&ICHCV#)    LAST CONVENTION ADDRESS              37850000
         END                                                            37866600
.*                                                                @P1A  37883200
         AGO  .CONVEX              EXIT THE MACRO                       37900000
.*                                                                      37950000
.*********************************************************************  38000000
.****                                                             ****  38050000
.**** ICHNCV - OPERAND VALIDATOR  AND CODE GENERATOR              ****  38100000
.****                                                             ****  38150000
.*********************************************************************  38200000
.*                                                                      38250000
.ICHNCV  ANOP  ,                                                        38300000
.*                                                                      38350000
.*********************************************************************  38400000
.* SEPARATE OPERAND INTO ITS COMPONENTS                                 38450000
.*********************************************************************  38500000
.*                                                                      38550000
&I       SETA  1                   INITIALIZE LOOP VARIABLE             38600000
&OP(1)   SETC  ''                  INITIALIZE COMPONENTS                38650000
&OP(2)   SETC  ''                                                       38700000
&OP(3)   SETC  ''                                                       38750000
&OP(4)   SETC  ''                                                       38800000
&OPPOS   SETA  1                   INITIALIZE POSITION IN STRING        38850000
&OPCNT   SETA  K'&OPND             INITIALIZE STOPPING VALUE            38900000
&PARENS  SETB  0                   INITIALIZE NO PARENTHESIS            38950000
.VALLP0  ANOP  ,                   SCAN OPERAND FOR ITS PARTS           39000000
         AIF   (&OPPOS GE &OPCNT).VAL07  STOP SEARCHING- PAST END       39050000
         AIF   (&OPPOS GT 1).VAL02 NOT IN FIRST POSITION                39100000
         AIF   ('&OPND'(&OPPOS,1) NE '(').VAL03  NOT LEADING PAREN      39150000
&PARENS  SETB  1                   INDICATE PARENTHESIS FOUND           39200000
         AGO   .VAL06              LOOK AT NEXT POSITION                39250000
.VAL02   ANOP  ,                                                        39300000
         AIF   ('&OPND'(&OPPOS,1) NE ',').VAL03 NOT BETWEEN COMPONENTS  39350000
.*                                                                      39400000
.* FOUND A COMMA- BUMP I TO INDICATE NEXT COMPONENT                     39450000
.*                                                                      39500000
&I       SETA  &I+1                LOOK AT NEXT COMPONENT               39550000
         AGO   .VAL06              LOOK AT NEXT CHARACTER               39600000
.VAL03   ANOP  ,                                                        39650000
&OP(&I)  SETC  '&OP(&I)'.'&OPND'(&OPPOS,1) CONCATENATE THIS CHARACTER   39700000
.*                                 TO THE EXISTING COMPONENT            39750000
.VAL06   ANOP  ,                                                        39800000
&OPPOS   SETA  &OPPOS+1            POINT AT NEXT CHARACTER IN OPERAND   39850000
         AGO   .VALLP0             KEEP LOOKING                         39900000
.VAL07   ANOP  ,                                                        39950000
         AIF   (&PARENS).VAL09     LEADING PARENTHESIS WAS FOUND        40000000
.*                                                                      40050000
.* NO PARENTHESES AROUND OPERAND COMPONENT, MUST PICK UP LAST           40100000
.* CHARACTER INDEXED BY OPPOS                                           40150000
.*                                                                      40200000
&OP(&I)  SETC  '&OP(&I)'.'&OPND'(&OPPOS,1) CONCATENATE THIS CHARACTER   40250000
         AGO   .VAL09A             OPERAND IS COMPLETELY PROCESSED      40300000
.VAL09   ANOP  ,                   LAST CHAR MUST BE A RIGHT PAREN      40350000
         AIF   ('&OPND'(&OPPOS,1) NE ')').ERR24 INVALID SYNTAX          40400000
.VAL09A  ANOP  ,                                                        40450000
.*                                                                      40500000
.*********************************************************************  40550000
.* SEARCH TABLE OF VARIABLE NAMES FOR A MATCH ON THIS OPERAND           40600000
.*********************************************************************  40650000
.*                                                                      40700000
&REP     SETA  1                   SET NUMBER OF REPS THROUGH THE       40750000
.*                                 LOGIC THAT SEARCHES THE VARIABLE     40800000
.*                                 TABLE                                40850000
&ARG     SETC  '&OP(1)'            INITIALIZE SEARCH ARGUMENT           40900000
.VALREP  ANOP  ,                   REPEATED FOR VARIABLES AS VARIABLES  40950000
.*                                 OR SUBSCRIPTS                        41000000
&I       SETA  1                   INITIALIZE TABLE INDEX               41050000
&FOUND   SETB  0                   INITIALIZE FOUND FLAG                41100000
.VAL10   ANOP  ,                   TOP OF LOOP THROUGH VARNAM           41150000
         AIF   (&I GT &VARDIM).VAL30 EXCEEDED TABLE- LEAVE LOOP         41200000
         AIF   ('&VARNAM(&I)' NE '&ARG').VAL12  NO MATCH, CONTINUE      41250000
&FOUND   SETB  1                   INDICATE A MATCH                     41300000
         AGO   .VAL30              STOP THE SEARCH                      41350000
.VAL12   ANOP  ,                                                        41400000
&I       SETA  &I+1                LOOK AT NEXT TABLE ENTRY             41450000
         AGO   .VAL10                                                   41500000
.*                                                                      41550000
.VAL30   ANOP  ,                                                        41600000
         AIF   (&REP GE 2).VAL36   SKIP RE-INITIALIZATION IF SUBSCRIPT  41650000
&CBIT0   SETA  0                   OPERAND DESCRIPTOR BTS               41700000
&CBIT1   SETA  0                                                        41750000
&CBIT2   SETA  0                                                        41800000
&CBIT3   SETA  0                                                        41850000
&CBIT4   SETA  0                                                        41900000
&CBIT5   SETA  0                                                        41950000
&CBIT6   SETA  0                                                        42000000
&CBIT7   SETA  0                                                        42050000
         AIF   (&FOUND).VAL35      OPERAND IS A VARIABLE                42100000
         AIF   (&OPNO EQ 1).ERR05  ERROR, FIRST OPERAND                 42150000
.*                                 IS A LITERAL                         42200000
.*                                                                      42250000
.*********************************************************************  42300000
.* GENERATE LITERAL OPERAND DESCRIPTOR                                  42350000
.*********************************************************************  42400000
.*                                                                      42450000
         DC    B'&CBIT0&CBIT1&CBIT2&CBIT3&CBIT4&CBIT5&CBIT6&CBIT7'      42500000
         AGO   .VAL60              PROCESS LITERAL OPERAND              42550000
.*                                                                      42600000
.*********************************************************************  42650000
.* GET VARIABLE'S ATTRIBUTES FROM THE VARATT ARRAY                      42700000
.*********************************************************************  42750000
.*                                                                      42800000
.VAL35   ANOP  ,                                                        42850000
&CBIT0   SETA  1                   INDICATE OPERAND IS VARIABLE         42900000
&VARCODE SETA  &I                  SAVE VARIABLE'S INDEX                42950000
&OPA(&OPNO) SETC  '&VARATT(&I)'    GET VARIABLE'S ALLOWED ATTRIBUTES    43000000
         AIF   ('&OP(2)' EQ '').VAL40  SUBSCRIPT WAS NOT SPECIFIED      43050000
         AIF   ('&VARATT(&I)'(&SSCROK,1) EQ '&NO').ERR08 ERROR,         43100000
.*                                 SUBSCRIPT INVALID FOR THIS VARIABLE  43150000
.*                                                                      43200000
.*********************************************************************  43250000
.* MUST NOW GO BACK AND PROCESS THE SUBSCRIPT, AS IT MAY BE             43300000
.* A VARIABLE ALSO.  BUMP REP, SAVE CURRENT ENVIRONMENT.                43350000
.*********************************************************************  43400000
.*                                                                      43450000
&REP     SETA  &REP+1              NEXT REPETITION OF LOOP              43500000
&ARG     SETC  '&OP(2)'            INITIALIZE SEARCH ARGUMENT           43550000
         AIF   (&REP LE 2).VALREP  REPEAT LOOP                          43600000
.VAL36   ANOP  ,                                                        43650000
&CBIT1   SETA  1                   SUBSCRIPT ALLOWED AND SPECIFIED      43700000
         AIF   (NOT &FOUND).VAL60  PROCESS LITERAL SUBSCRIPT            43750000
         AIF   ('&VARATT(&I)'(&CHARHEX,1) EQ '&YES').ERR19 SUBSCRIPT    43800000
.*                                 NOT NUMERIC                          43850000
&CBIT2   SETA  1                   SUBSCRIPT IS A VARIABLE              43900000
&SUBCODE SETA  &I                  SAVE SUBSCRIPT VARIABLE INDEX        43950000
.*                                                                      44000000
.*********************************************************************  44050000
.* PROCESS SUBSTRING                                                    44100000
.*********************************************************************  44150000
.*                                                                      44200000
.VAL40   ANOP  ,                                                        44250000
&STRST   SETA  0                   INITIALIZE POSITION VALUE            44300000
&STREND  SETA  0                   INITIALIZE POSITION VALUE            44350000
         AIF   ('&OP(3)' EQ '' AND '&OP(4)' EQ '').VAL50  NO SUBSTRING  44400000
.*                                 SPECIFIED                            44450000
         AIF   ('&VARATT(&VARCODE)'(&SSTROK,1) EQ '&NO').ERR23 ERROR,   44500000
.*                                 SUBSTRING NOT ALLOWED FOR THIS       44550000
.*                                 OPERAND                              44600000
&CBIT3   SETA  1                   SET SUBSTRING SPECIFIED BIT          44650000
         AIF   ('&OP(3)' EQ '').VAL41 NO START POSITION GIVEN           44700000
.VAL40A  ANOP   ,                                                       44750000
&I       SETA   1                  INITIALIZE LOOP VARIABLE             44800000
&J       SETA   1                                                       44850000
.VALLP6  ANOP   ,                  VALIDITY-CHECK FOR DECIMAL DIGITS    44900000
         AIF    ('&OP(3)'(&I,1) EQ '&DIGITS'(&J,1)).NEXPOS6 A MATCH     44950000
&J       SETA   &J+1               LOOK AT NEXT POSSIBLE DIGIT          45000000
         AIF    (&J GT K'&DIGITS).ERR18   ERROR, DID NOT MATCH THIS     45050000
.*                                 DIGIT WITH ONE OF THE POSSIBILITIES  45100000
         AGO    .VALLP6                                                 45150000
.NEXPOS6 ANOP   ,                  LOOK AT NEXT POSITION                45200000
&J       SETA   1                  RESET INNER LOOP CONTROL             45250000
&I       SETA   &I+1               POINT AT NEXT POSITION               45300000
         AIF    (&I GT K'&OP(3)).VAL40B SUBSCRIPT IS CHECKED AND OK     45350000
         AGO    .VALLP6                                                 45400000
.VAL40B  ANOP  ,                                                        45450000
&STRST   SETA  &OP(3)              SAVE SUBSTRING START POSITION        45500000
         AGO   .VAL42                                                   45550000
.VAL41   ANOP  ,                                                        45600000
&STRST   SETA  1                   SET DEFAULT START POSITION OF 1      45650000
.VAL42   ANOP  ,                                                        45700000
         AIF   ('&OP(4)' EQ '').VAL43 NO END POSITION GIVEN             45750000
.VAL42A  ANOP   ,                                                       45800000
&I       SETA   1                  INITIALIZE LOOP VARIABLE             45850000
&J       SETA   1                                                       45900000
.VALLP7  ANOP   ,                  VALIDITY-CHECK FOR DECIMAL DIGITS    45950000
         AIF    ('&OP(4)'(&I,1) EQ '&DIGITS'(&J,1)).NEXPOS7 A MATCH     46000000
&J       SETA   &J+1               LOOK AT NEXT POSSIBLE DIGIT          46050000
         AIF    (&J GT K'&DIGITS).ERR18   ERROR, DID NOT MATCH THIS     46100000
.*                                 DIGIT WITH ONE OF THE POSSIBILITIES  46150000
         AGO    .VALLP7                                                 46200000
.NEXPOS7 ANOP   ,                  LOOK AT NEXT POSITION                46250000
&J       SETA   1                  RESET INNER LOOP CONTROL             46300000
&I       SETA   &I+1               POINT AT NEXT POSITION               46350000
         AIF    (&I GT K'&OP(4)).VAL42B SUBSCRIPT IS CHECKED AND OK     46400000
         AGO    .VALLP7                                        @ZA78496 46450000
.VAL42B  ANOP  ,                                                        46500000
&STREND  SETA  &OP(4)              SAVE SUBSTRING END POSITION          46550000
         AGO   .VAL44                                                   46600000
.VAL43   ANOP  ,                                                        46650000
&STREND  SETA  &VARLEN(&VARCODE)   SET DEFAULT END POSITION TO          46700000
.*                                 LENGTH OF VARIABLE                   46750000
.VAL44   ANOP  ,                                                        46800000
         AIF   (&STRST  LT 1).ERR18   INVALID SUBSTRING POSITION        46850000
         AIF   (&STRST GT &STREND).ERR18  STARTING POSITION GREATER     46900000
.*                                 THAN ENDING POSITION                 46950000
         AIF   (&STREND GT &VARLEN(&VARCODE)).ERR18   ENDING POSITION   47000000
.*                                 BEYOND MAX LENGTH FOR VARIABLE       47050000
.*********************************************************************  47100000
.* MODIFIABILITY CHECKS                                                 47150000
.*********************************************************************  47200000
.*                                                                      47250000
.VAL50   ANOP  ,                                                        47300000
         AIF   ('&TYPE' NE 'ACTION' OR &OPNO NE 1).VAL55  NO            47350000
.*                                 MODIFIABILITY CHECKS NEEDED          47400000
         AIF   ('&VARATT(&VARCODE)'(&NOTMOD,1) EQ '&YES').ERR26 ERROR,  47450000
.*                                 VARIABLE NOT MODIFIABLE AT ALL       47500000
         AIF   ('&VARATT(&VARCODE)'(&MODSPEC,1) EQ '&YES').VAL51 CAN    47550000
.*                                 MODIFY VARIABLE WITH SPECIAL VALUES  47600000
         AGO   .VAL55                                                   47650000
.*                                                                      47700000
.********************************************************************** 47750000
.* VARIABLE TESTABLE/MODIFIABLE BY CERTAIN VALUES ONLY- CHECK FOR THESE 47800000
.********************************************************************** 47850000
.*                                                                      47900000
.VAL51   ANOP  ,                                                        47950000
         AIF   ('&COND(1)' NE 'NAMETYPE').VAL52 ONLY CHECK IF NAMETYPE  48000000
         AIF   ('&COND(3)' EQ 'USER').VAL55 ALLOWABLE VALUE TESTED FOR  48050000
         AIF   ('&COND(3)' EQ 'GROUP').VAL55                            48100000
         AIF   ('&COND(3)' NE 'UNKNOWN').ERR20  NOT TESTING ONE OF THE  48150000
.*                                 ALLOWABLE VALUES                     48200000
.VAL52   ANOP  ,                                                        48250000
         AIF   ('&SET(1)' NE 'NAMETYPE').VAL55 ONLY CHECK IF NAMETYPE   48300000
         AIF   ('&SET(2)' EQ 'USER').VAL55 ALLOWABLE VALUE SET          48350000
         AIF   ('&SET(2)' EQ 'GROUP').VAL55                             48400000
         AIF   ('&SET(2)' NE 'UNKNOWN').ERR20  NOT SETTING ONE OF THE   48450000
.*                                 ALLOWABLE VALUES                     48500000
.*                                                                      48550000
.*********************************************************************  48600000
.* GENERATE CODE FOR A VARIABLE AFTER DOING RANGE CHECKS ON             48650000
.* VARIABLES GQ, UQ, AND VOLUME.                                        48700000
.*********************************************************************  48750000
.*                                                                      48800000
.VAL55  ANOP   ,                                                        48850000
        AIF   (NOT(&CBIT1) OR &CBIT2).VAL58  SUBSCRIPT NOT SPECIFIED    48900000
.*                                 OR IS A VARIABLE                     48950000
        AIF   ('&OP(1)' EQ 'GQ' OR '&OP(1)' EQ 'UQ').VAL56              49000000
        AIF   ('&OP(1)' EQ 'VOLUME').VAL57                              49050000
        AGO   .VAL58                                                    49100000
.VAL56  ANOP  ,                    QUALIFIER SUBSCRIPT CHECK            49150000
        AIF   (&SUBCODE GT 22 OR &SUBCODE LT 0).ERR19 ERROR, SUBSCRIPT  49200000
.*                                 IS OUT OF RANGE FOR ITS ARRAY        49250000
        AGO   .VAL58                                                    49300000
.VAL57  ANOP  ,                    VOLUME SUBSCRIPT CHECK               49350000
        AIF   (&SUBCODE GT 255 OR &SUBCODE LE 0).ERR19 ERROR, SUBSCRIPT 49400000
.*                                 IS OUT OF RANGE FOR ITS ARRAY        49450000
.VAL58  ANOP  ,                                                         49500000
         DC    B'&CBIT0&CBIT1&CBIT2&CBIT3&CBIT4&CBIT5&CBIT6&CBIT7'      49550000
         DC    AL1(&VARCODE)       VARIABLE'S CODE NUMBER               49600000
ICH&BX.S DC    AL1(&SUBCODE)       SUBSCRIPT                            49650000
         DC    AL1(&STRST)         SUBSTRING START POSITION             49700000
         DC    AL1(&STREND)        SUBSTRING END POSITION               49750000
         DC    XL4'00000000'       RESERVED                             49800000
&BX      SETA  &BX+1               BUMP LABEL INDEX                     49850000
&SUBCODE SETA  0                   CLEAR SUBSCRIPT INDEX                49900000
         AGO   .VAL99              RETURN                               49950000
.*                                                                      50000000
.*********************************************************************  50050000
.* LITERAL PROCESSING                                                   50100000
.*********************************************************************  50150000
.*                                                                      50200000
.VAL60   ANOP   ,                                                       50250000
         AIF    (&REP GT 1).VAL60A    BRANCH IF PROCESSING SUBSCRIPT    50300000
         AIF    ('&OP(3)' NE '').ERR18    ERROR, SUBSTRING ON LITERAL   50350000
         AIF    ('&OP(2)' NE '').ERR19    ERROR, SUBSCRIPT ON LITERAL   50400000
.VAL60A  ANOP   ,                                                       50450000
         AIF    ('&ARG'(1,2) NE 'X''').VAL66 BRANCH IF NOT HEX LIT      50500000
         AIF    (&REP GE 2).ERR19  ERROR, SUBSCRIPT CANNOT BE HEX       50550000
.*                                                                      50600000
.*********************************************************************  50650000
.* PROCESS HEX LITERALS                                                 50700000
.*********************************************************************  50750000
.*                                                                      50800000
&FOUND   SETB   0                  INITIALIZE LOOP VARIABLES            50850000
&I       SETA   3                                                       50900000
.VALLP1  ANOP   ,                                                       50950000
         AIF    ('&ARG'(&I,1) NE '''').VAL61                            51000000
&LIT     SETC   '&ARG'(3,&I-3)    COPY LITERAL WITHOUT X''              51050000
&FOUND   SETB   1                 INDICATE CLOSING QUOTE FOUND          51100000
         AGO    .VAL62            LEAVE LOOP                            51150000
.VAL61   ANOP   ,                                                       51200000
&I       SETA   &I+1              LOOK AT NEXT LITERAL POSITION         51250000
         AIF    (&I LE K'&ARG).VALLP1  STILL MORE OF LITERAL            51300000
.VAL62   ANOP   ,                                                       51350000
         AIF    (NOT &FOUND).ERR21 INVALID LITERAL                      51400000
&I       SETA   1                  INITIALIZE LOOP VARIABLE             51450000
&J       SETA   1                                                       51500000
.VALLP4  ANOP   ,                  VALIDITY-CHECK FOR HEX DIGITS        51550000
         AIF    ('&LIT'(&I,1) EQ '&HIGITS'(&J,1)).NEXPOS4 FOUND A MATCH 51600000
&J       SETA   &J+1               LOOK AT NEXT POSSIBLE DIGIT          51650000
         AIF    (&J GT K'&HIGITS).ERR21   ERROR, DID NOT MATCH THIS     51700000
.*                                 DIGIT WITH ONE OF THE POSSIBILITIES  51750000
         AGO    .VALLP4                                                 51800000
.NEXPOS4 ANOP   ,                  LOOK AT NEXT LITERAL POSITION        51850000
&J       SETA   1                  RESET INNER LOOP CONTROL             51900000
&I       SETA   &I+1               POINT AT NEXT LITERAL POSITION       51950000
         AIF    (&I GT K'&LIT).VAL62A CHECKED WHOLE LITERAL-IT IS OK    52000000
         AGO    .VALLP4                                                 52050000
.VAL62A  ANOP   ,                                                       52100000
&LEN     SETA   K'&LIT                                                  52150000
&LEN     SETA   &LEN/2                                                  52200000
.*                                                                      52250000
.*********************************************************************  52300000
.* CHECK TO SEE IF LITERAL IS A VALID EVENT CODE                        52350000
.*********************************************************************  52400000
.*                                                                      52450000
         AIF    (&OPNO NE 2).VAL65 NOT SECOND OPERAND                   52500000
         AIF    ('&COND(1)' NE 'EVENT').VAL65 NOT COMPARING EVENT       52550000
&FOUND   SETB   0                  INITIALIZE LOOP VARIABLES            52600000
&I       SETA   1                                                       52650000
.VALLP3  ANOP   ,                  LOOP THROUGH EVENT TABLE             52700000
         AIF    ('&LIT' NE '&EVENT(&I)').VAL63                          52750000
&FOUND   SETB   1                  INDICATE EVENT FOUND                 52800000
         AGO    .VAL64             LEAVE LOOP                           52850000
.VAL63   ANOP   ,                                                       52900000
&I       SETA   &I+1               INCREMENT EVENT TABLE SUBSCRIPT      52950000
         AIF    (&I LE &EVTDIM).VALLP3 MORE EVENTS LEFT                 53000000
.VAL64   ANOP   ,                                                       53050000
         AIF    (NOT &FOUND).ERR22 INVALID EVENT SPECIFIED              53100000
.VAL65   ANOP  ,                                                        53150000
         DC    AL4(ICH&LX.L)       ADDRESS OF LITERAL OPERAND           53200000
         DC    XL4'00000000'       RESERVED                             53250000
ICHNCV01 CSECT                                                          53300000
ICH&LX.L DC    AL1(&LEN),XL&LEN'&LIT'                                   53350000
ICHNCV00 CSECT                                                          53400000
&LX      SETA   &LX+1             INCREMENT LITERAL INDEX IN CSECT      53450000
&OPA(&OPNO) SETC '00010000'       SET TYPE FOR LITERAL                  53500000
         AGO   .VAL80             CONTINUE PROCESSING                   53550000
.*                                                                      53600000
.*********************************************************************  53650000
.* PROCESS CHARACTER LITERALS                                           53700000
.*********************************************************************  53750000
.*                                                                      53800000
.VAL66   ANOP   ,                                                       53850000
         AIF    ('&ARG'(1,1) NE '''').VAL70 THIS A CHAR. LITERAL        53900000
         AIF    (&OPNO EQ 2 AND '&COND(1)' EQ 'EVENT').ERR22            53950000
.*                                 INVALID TYPE LITERAL FOR EVENT       54000000
         AIF    (&REP GE 2).ERR19  ERROR, SUBSCRIPT CANNOT BE CHAR.     54050000
&FOUND   SETB   0                  INITIALIZE LOOP VARIABLES            54100000
&I       SETA   2                                                       54150000
.VALLP2  ANOP   ,                                                       54200000
         AIF    ('&OP(1)'(&I,1) NE '''').VAL67                          54250000
&LIT     SETC   '&OP(1)'(2,&I-2)  COPY LITERAL WITHOUT QUOTES           54300000
&FOUND   SETB   1                 INDICATE CLOSING QUOTE FOUND          54350000
         AGO    .VAL68            LEAVE LOOP                            54400000
.VAL67   ANOP   ,                                                       54450000
&I       SETA   &I+1              LOOK AT NEXT POSITION                 54500000
         AIF    (&I LE K'&OP(1)).VALLP2 STILL MORE OF LITERAL           54550000
.VAL68   ANOP   ,                                                       54600000
         AIF    (NOT &FOUND).ERR21 INVALID LITERAL                      54650000
&LEN     SETA   &I-2                                                    54700000
         DC    AL4(ICH&LX.L)       ADDRESS OF LITERAL OPERAND           54750000
         DC    XL4'00000000'       RESERVED                             54800000
ICHNCV01 CSECT                                                          54850000
ICH&LX.L DC    AL1(&LEN),CL&LEN'&LIT'                                   54900000
ICHNCV00 CSECT                                                          54950000
&LX      SETA   &LX+1             INCREMENT LITERAL INDEX IN CSECT      55000000
&OPA(&OPNO) SETC '00010000'       SET TYPE FOR LITERAL                  55050000
         AGO   .VAL80             CONTINUE PROCESSING                   55100000
.*                                                                      55150000
.*********************************************************************  55200000
.* PROCESS DECIMAL LITERALS                                             55250000
.*********************************************************************  55300000
.*                                                                      55350000
.VAL70   ANOP   ,                                                       55400000
         AIF    (&OPNO EQ 2 AND '&COND(1)' EQ 'EVENT').ERR22            55450000
.*                                 INVALID TYPE LITERAL FOR EVENT       55500000
&I       SETA   1                  INITIALIZE LOOP VARIABLE             55550000
&J       SETA   1                                                       55600000
&LIT     SETC  '&ARG'              SET LITERAL VALUE                    55650000
.VALLP5  ANOP   ,                  VALIDITY-CHECK FOR DECIMAL DIGITS    55700000
         AIF    ('&ARG'(&I,1) EQ '&DIGITS'(&J,1)).NEXPOS5 FOUND A MATCH 55750000
&J       SETA   &J+1               LOOK AT NEXT POSSIBLE DIGIT          55800000
         AIF    (&J GT K'&DIGITS).ERR21   ERROR, DID NOT MATCH THIS     55850000
.*                                 DIGIT WITH ONE OF THE POSSIBILITIES  55900000
         AGO    .VALLP5                                                 55950000
.NEXPOS5 ANOP   ,                  LOOK AT NEXT LITERAL POSITION        56000000
&J       SETA   1                  RESET INNER LOOP CONTROL             56050000
&I       SETA   &I+1               POINT AT NEXT LITERAL POSITION       56100000
         AIF    (&I GT K'&ARG).VAL71 CHECKED WHOLE LITERAL AND IT IS OK 56150000
         AGO    .VALLP5                                                 56200000
.VAL71   ANOP  ,                                                        56250000
         AIF    (&REP GE 2).VAL72 LITERAL IS A SUBSCRIPT                56300000
&LEN     SETA  2                   ALL DECIMAL LITERALS ARE 2 BYTES     56350000
         DC    AL4(ICH&LX.L)       ADDRESS OF LITERAL OPERAND           56400000
         DC    XL4'00000000'       RESERVED                             56450000
ICHNCV01 CSECT                                                          56500000
ICH&LX.L DC    AL1(&LEN),FL&LEN'&LIT'                                   56550000
ICHNCV00 CSECT                                                          56600000
&LX      SETA   &LX+1             INCREMENT LITERAL INDEX IN CSECT      56650000
&OPA(&OPNO) SETC '00000000'       SET TYPE FOR LITERAL                  56700000
         AGO   .VAL80             CONTINUE PROCESSING                   56750000
.VAL72   ANOP  ,                  STORE SUBSCRIPT                       56800000
&SUBCODE SETA  &ARG                                                     56850000
.*                                                                      56900000
.*********************************************************************  56950000
.* DETERMINE WHETHER TO RETURN TO VARIABLE PROCESSING IF PROCESSING     57000000
.* A SUBSCRIPT                                                          57050000
.*********************************************************************  57100000
.*                                                                      57150000
.VAL80   ANOP  ,                                                        57200000
         AIF   (&REP EQ 2).VAL40   PROCESSING A SUBSCRIPT, RETURN TO    57250000
.*                                 VARIABLE PROCESSING                  57300000
         AIF   ('&TYPE' EQ 'ACTION' AND &OPNO EQ 1).ERR26  ERROR,       57350000
.*                                 CANNOT SET A LITERAL                 57400000
         AGO   .VAL99              PROCESSING A LITERAL OPERAND-        57450000
.*                                 RETURN                               57500000
.*                                                                      57550000
.*********************************************************************  57600000
.* RETURN LOGIC                                                         57650000
.*********************************************************************  57700000
.*                                                                      57750000
.VAL99   ANOP   ,                                                       57800000
         AIF   (&RETL EQ 1).SEL25  COMPUTE RETURN LABEL                 57850000
         AIF   (&RETL EQ 2).SEL30                                       57900000
         AIF   (&RETL EQ 3).ACT25                                       57950000
         AGO   .ACT30                                                   58000000
.*                                                                      58050000
.*********************************************************************  58100000
.****                                                             ****  58150000
.**** ERROR MESSAGES                                              ****  58200000
.****                                                             ****  58250000
.*********************************************************************  58300000
.*                                                                      58350000
.ERR01   ANOP                                                           58400000
         MNOTE 12,'*** INVALID PARAMETER FOR &TYPE'                     58450000
         AGO   .ERREX                                                   58500000
.ERR02   ANOP                                                           58550000
         MNOTE 12,'*** END NOT FOUND FOR PRIOR CONVENTION'              58600000
         AGO   .ERREX                                                   58650000
.ERR03   ANOP                                                           58700000
         MNOTE 12,'*** CONTINUATION FOUND BUT PRIOR SELECT DID NOT END *58750000
               WITH ''AND'' OR ''OR'''                                  58800000
         AGO   .ERREX                                                   58850000
.ERR04   ANOP                                                           58900000
         MNOTE 12,'*** PRIOR SELECT ENDED WITH ''AND'' OR ''OR''  BUT  *58950000
               NO CONTINUATION FOUND'                                   59000000
         AIF   ('&TYPE' EQ 'END').END01  TEST IF END INVOKED            59050000
         AGO   .ERREX                                                   59100000
.ERR05   ANOP                                                           59150000
         MNOTE 12,'*** FIRST OPERAND OF &TYPE MUST BE A VARIABLE'       59200000
         AGO   .ERREX                                                   59250000
.ERR06   ANOP                                                           59300000
         MNOTE 12,'*** CONVENTION SPECIFIED WITH ''NEXT'' MUST FOLLOW T*59350000
               HE CURRENT CONVENTION'                                   59400000
         AGO   .ERREX                                                   59450000
.ERR07   ANOP                                                           59500000
         MNOTE 12,'*** OPERANDS OF &TYPE MUST BE OF SAME TYPE'          59550000
         AGO   .ERREX                                                   59600000
.ERR08   ANOP                                                           59650000
         MNOTE 12,'*** VARIABLE IN &OPND MAY NOT BE SUBSCRIPTED'        59700000
         AGO   .ERREX                                                   59750000
.ERR09   ANOP  ,                                                        59800000
         MNOTE 12,'*** INVALID TYPE SPECIFIED'                          59850000
         AGO   .ERREX                                                   59900000
.ERR10   ANOP  ,                                                        59950000
         MNOTE 12,'*** PARAMETER &PARAM REQUIRED WITH &TYPE'            60000000
         AGO   .ERREX                                                   60050000
.ERR11   ANOP                                                           60100000
         MNOTE 12,'*** CONVENTIONS OCCUR BEYOND END OF TABLE'           60150000
         AGO   .ERREX                                                   60200000
.ERR12   ANOP  ,                                                        60250000
         MNOTE 12,'*** MISSING DEFINE MACRO'                            60300000
         AGO   .ERREX                                                   60350000
.ERR13   ANOP  ,                                                        60400000
         MNOTE 12,'*** MISPLACED &TYPE MACRO'                           60450000
         AGO   .ERREX                                                   60500000
.ERR14   ANOP  ,                                                        60550000
         MNOTE 12,'*** INVALID COMPARISON OPERATOR'                     60600000
         AGO   .ERREX                                                   60650000
.ERR15   ANOP  ,                                                        60700000
         MNOTE 12,'*** INVALID CONDITIONAL LINKAGE FIELD'               60750000
         AGO   .ERREX                                                   60800000
.ERR16   ANOP  ,                                                        60850000
         MNOTE 12,'*** MISSING OPERAND ON &TYPE PARAMETER'              60900000
         AGO   .ERREX                                                   60950000
.ERR17   ANOP  ,                                                        61000000
         MNOTE 12,'*** TOO MANY CONVENTIONS SPECIFIED'                  61050000
         AGO   .ERREX                                                   61100000
.ERR18   ANOP  ,                                                        61150000
         MNOTE 12,'*** INVALID SUBSTRING ON OPERAND &OPND'              61200000
         AGO   .ERREX                                                   61250000
.ERR19   ANOP  ,                                                        61300000
         MNOTE 12,'*** INVALID SUBSCRIPT ON OPERAND &OPND'              61350000
         AGO   .ERREX                                                   61400000
.ERR20   ANOP  ,                                                        61450000
         MNOTE 12,'*** VARIABLE IN &OPND CAN BE TESTED AND SET WITH SPE*61500000
               CIFIC VALUES ONLY'                                       61550000
         AGO   .ERREX                                                   61600000
.ERR21   ANOP  ,                                                        61650000
         MNOTE 12,'*** INVALID LITERAL ON OPERAND &LIT'                 61700000
         AGO   .ERREX                                                   61750000
.ERR22   ANOP  ,                                                        61800000
         MNOTE 12,'*** INVALID EVENT CODE'                              61850000
         AGO   .ERREX                                                   61900000
.ERR23   ANOP  ,                                                        61950000
         MNOTE 12,'*** VARIABLE IN &OPND CANNOT BE SUBSTRINGED'         62000000
         AGO   .ERREX                                                   62050000
.ERR24   ANOP  ,                                                        62100000
         MNOTE 12,'*** INVALID SYNTAX FOR OPERAND &OPND'                62150000
         AGO   .ERREX                                                   62200000
.ERR25   ANOP  ,                                                        62250000
         MNOTE 12,'*** TOO MANY &TYPE MACROS'                           62300000
         AGO   .ERREX                                                   62350000
.ERR26   ANOP  ,                                                        62400000
         MNOTE 12,'*** &OPND CANNOT BE SET'                             62450000
         AGO   .ERREX                                                   62500000
.ERREX   ANOP  ,                                                        62550000
.*                                                                      62600000
.*********************************************************************  62650000
.* COMMON EXIT FROM MACRO                                               62700000
.*********************************************************************  62750000
.*                                                                      62800000
.CONVEX  ANOP  ,                                                        62850000
         MEND                                                           62900000
