*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/*                                                                  */ 00150000
*/* $MAC(ICHPCGRP) COMP(SC1BN) PROD(RACF):                           */ 00200000
*/*                                                                  */ 00250000
*/* DESCRIPTIVE NAME:  CONNECT GROUP NAME TABLE DEFINITION           */ 00300000
*/*                                                                  */ 00350000
*/*01* PROPRIETARY STATEMENT=                                        */ 00383300
*/***PROPRIETARY_STATEMENT********************************************/ 00416600
*/*                                                                  */ 00450000
*/*                                                                  */ 00550000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00559300
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00568600
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1981, 2000                      */ 00577900
*/*                                                                  */ 00587200
*/* STATUS= HBB7703                                                  */ 00596500
*/*                                                                  */ 00605800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00615100
*/*                                                                  */ 00624900
*/*01* EXTERNAL CLASSIFICATION: GUPI                             @P5A*/ 00633200
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00641500
*/*                                                                  */ 00650000
*/* METHOD OF ACCESS:                                                */ 00700000
*/*   %INCLUDE SYSLIB(ICHPCGRP) FOR PLS                          @P1C*/ 00750000
*/*                                                                  */ 00800000
*/* FUNCTION:                                                        */ 00850000
*/*   THE CGRP TABLE CONTAINS THE NAMES OF THE GROUPS                */ 00900000
*/*   THAT THE USERID IN THE ACEEUSRI IS A MEMBER OF.                */ 00950000
*/*                                                                  */ 01050000
*/*   THE CONNECT GROUP TABLE IS THE ANCHOR TABLE FOR                */ 01080000
*/*   THE GROUP AUTHORITY TABLE, AND CONTAINS THE USER'S             */ 01110000
*/*   CONNECT GROUP AUTHORITY TO EACH GROUP PRESENT                  */ 01140000
*/*   IN THE TABLE.                                                  */ 01170000
*/*                                                                  */ 01200000
*/*   THIS TABLE IS BASED ON THE 'ACEECGRP' ADDRESS                  */ 01216600
*/*   IN THE ACEE.                                               @P1C*/ 01233200
*/*                                                                  */ 01250000
*/* CHANGE ACTIVITY:                                                 */ 01400000
*/*            $L0=HRF1402,RACF/140,810701,SJRDSD:               @L0A*/ 01450000
*/*            $L6=HRF1602,RACF/160,830509,CNTDSD:               @L6A*/ 01500000
*/*            UZ90283                                       @UZ90283*/ 01550000
*/*            UZ90284                                       @UZ90284*/ 01600000
*/*            UZ90285                                       @UZ90285*/ 01650000
*/*            OZ79446                                       @OZ79446*/ 01700000
*/*   $L9=MVSGTS  RACF/190 880615 PDSHL1: Group Tree in Storage  @L9A*/ 01716600
*/*   $01=OW28907 RACF/220 970909 PDBEC1: OW28580                @01A*/ 01733300
*/*   $LA=DCERT   HBB7730  990909 PDCLC: Digital Cert Extensions @LAA*/ 01741600
*/*                                                                  */ 01750000
*/* CHANGE DESCRIPTION:                                              */ 01757100
*/*   A000000-999999                                             @L0A*/ 01764200
*/*   C - Use CGRPHADR for CGRP header so that LENGTH(CGRPHADR)  @L9A*/ 01771300
*/*       can be used in PL/AS module IRRRCK02.                  @L9A*/ 01778400
*/*   A - Add CGRPGCHG for group connection status change date   @01A*/ 01781900
*/*   A - Added names for reserved fields so that IRRRACM07      @LAA*/ 01783100
*/*       can clear them when expanding the ACEE.                @LAA*/ 01784300
*/*                                                                  */ 01785500
*/********************************************************************/ 01800000
*%GOTO ICHPCGRPLBL01;                 /* BILINGUAL HEADER               01850000
         MACRO                                                          01900000
         ICHPCGRP                                                       01950000
CGRP     DSECT                                                          02000000
CGRPHADR DS   CL32                  CGRP header of 32 bytes.       @L9A 02016600
         ORG  CGRPHADR                                             @L9A 02033200
CGRPID   DS   CL4                   TABLE IDENTIFIER = CGRP             02050000
CGRPCORE DS   F                     TABLE SUBPOOL AND LENGTH.           02100000
         ORG  CGRPCORE                                                  02150000
CGRPSP   DS   AL1                   TABLE SUBPOOL NUMBER.               02200000
CGRPLEN  DS   AL3                   SIZE OF TABLE.                      02250000
CGRPNUM  DS   H                     MAXIMUM NUMBER OF ENTRIES IN        02300000
*                                    TABLE.                             02350000
CGRPVRSN DS   AL1                   VERSION = 1.                   @L6A 02400000
         DS   AL1                   RESERVED.                           02450000
CGRPSYNC DS   F                     SYNCHRONIZE VALUE.                  02500000
CGRPGPAT DS   A                     ADDRESS OF GROUP AUTHORITIES        02550000
*                                   TABLE, OR ZERO IF NO SUCH TABLE     02600000
*                                   EXISTS                         @L6A 02650000
CGRPGCHG DS   CL4                   GROUP CONNECTION STATUS CHANGE      02670000
*                                   DATE (0cyydddF)                @01A 02690000
CGRPMAXD EQU  X'01FFFFFF'           MAXIMUM CHANGE DATE            @01A 02710000
CGRPCHR8 DS   CL8                   RESERVED                       @LAC 02730000
CGRPENT  DS   CL24                  INDIVIDUAL GROUP ENTRY.        @L6A 02750000
*                                                                       02800000
* FOLLOWING DSECT DESCRIBES AN INDIVIDUAL GROUP ENTRY.                  02850000
*                                                                       02900000
CGRPENTD DSECT                                                          02950000
CGRPNAME DS   CL8                   GROUP NAME.                         03000000
CGRPIND  DS   X                     INDICATORS.                         03050000
CGRPCHK  EQU  X'80'                 ALWAYS ZERO, WAS REVOKE             03100000
*                                    INDICATOR.                    @L6A 03150000
CGRPREFR EQU  X'40'                 ON IF GROUP AUTHORITY TABLE MUST    03200000
*                                    BE REFRESHED FOR THIS CONNECT      03250000
*                                    GROUP                         @L6A 03300000
CGRPCOMP EQU  X'20'                 ON IF GROUP ENTERED INTO GROUP      03350000
*                                    AUTHORITY TABLE AND NO LATER       03400000
*                                    AUTHORITY CHANGES WERE MADE        03450000
*                                    OR THE GROUP DID NOT NEED TO BE    03500000
*                                    ENTERED INTO THE TABLE        @L6A 03550000
CGRPPROP EQU  X'10'                 ON IF THIS GROUP IS OWNED BY ITS    03600000
*                                    SUPERIOR GROUP.  INDICATES THE     03650000
*                                    GROUP IS PART OF THE SUBGROUP TREE 03700000
*                                    FOR PROPAGATION OF GROUP           03750000
*                                    AUTHORITIES               @OZ79446 03800000
CGRPAUTH DS   X                     INDICATORS.                         03850000
CGRPSPEC EQU  X'80'                 ON IF GROUP-SPECIAL AUTHORITY  @L6A 03900000
CGRPOPER EQU  X'20'                 ON IF GROUP-OPERATIONS AUTHORITY    03950000
*                                                                  @L6A 04000000
CGRPAUDT EQU  X'10'                 ON IF GROUP-AUDITOR AUTHORITY  @L6A 04050000
*                                    BE REFRESHED FOR THIS CONNECT      04100000
*                                    GROUP                         @L6A 04150000
CGRPGPNM DS   H                     NUMBER OF ENTRIES IN GROUP          04200000
*                                    AUTHORITY TABLE RELATED TO THIS    04250000
*                                    CONNECT GROUP                 @L6A 04300000
CGRPGPTE DS   A                     ADDRESS OF FIRST GROUP AUTHORITY    04350000
*                                    TABLE ENTRY RELATED TO THIS        04400000
*                                    CONNECT GROUP                 @L6A 04450000
CGRPSUPG DS   H                     INDEX IN CGRPENT OF ENTRY FOR       04500000
*                                    SUPERIOR GROUP OF THIS ENTRY,      04550000
*                                    TO WHICH USER IS CONNECTED    @L6A 04600000
         DS   CL6                   RESERVED.                      @L6A 04650000
         MEND                                                           04700000
*  TERMINATE PLS COMMENT                                             */ 04750000
*%ICHPCGRPLBL01:;                                                       04800000
         DCL 1 CGRP BASED,          /* CONNECT GROUP NAME TABLE.     */ 04850000
               2 CGRPHADR,          /* CGRP header               @L9A*/ 04896400
                 3 CGRPID CHAR(4),  /* TABLE ID.                     */ 04942800
                 3 CGRPCORE,        /* CGRP SUBPOOL AND LENGTH.      */ 04989200
                   4 CGRPSP FIXED(8), /* SUBPOOL NUMBER.             */ 05035600
                   4 CGRPLEN PTR(24), /* LENGTH OF CGRP.             */ 05082000
                 3 CGRPNUM FIXED(15), /* MAXIMUM ENTRIES IN TABLE.   */ 05128400
                 3 CGRPVRSN FIXED(8), /* VERSION = 1.                */ 05174800
                 3 * CHAR(1),         /* RESERVED.                   */ 05221200
                 3 CGRPSYNC FIXED(31),/* SYNCRONIZE VALUE.           */ 05267600
                 3 CGRPGPAT PTR(31),  /* ADDRESS OF GROUP AUTHORITIES   05314000
                                        TABLE, OR ZERO IF NO SUCH TABLE 05360400
                                        EXISTS                   @L6A*/ 05406800
                 3 CGRPGCHG CHAR(4),/* GROUP CONNECTION STATUS CHANGE   05430100
                                       DATE (0cyydddF)           @01A*/ 05453400
                 3 CGRPCHR8 CHAR(8),/* RESERVED                  @LAC*/ 05476700
               2 CGRPENT(*),        /* GROUP NAME ENTRY.             */ 05500000
                 3 CGRPNAME CHAR(8),/* GROUP NAME.                   */ 05550000
                 3 CGRPIND BIT(8),  /* INDICATORS FOR THIS ENTRY     */ 05600000
                   4 CGRPCHK BIT(1),/* ALWAYS ZERO, WAS REVOKE          05650000
                                       INDICATOR                 @L6A*/ 05700000
                   4 CGRPREFR BIT(1),/* ON IF GROUP AUTHORITY TABLE     05750000
                                       MUST BE REFRESHED FOR THIS       05800000
                                       CONNECT GROUP             @L6A*/ 05850000
                   4 CGRPCOMP BIT(1),/* ON IF GROUP ENTERED INTO        05900000
                                       GROUP AUTHORITY TABLE AND        05950000
                                       NO LATER AUTHORITY CHANGES       06000000
                                       WERE MADE OR THE                 06050000
                                       GROUP DID NOT NEED TO BE         06100000
                                       ENTERED INTO THE TABLE    @L6A*/ 06150000
                   4 CGRPPROP BIT(1),/* ON IF THIS GROUP IS             06200000
                                     OWNED BY ITS                       06250000
                                     SUPERIOR GROUP.  INDICATES THE     06300000
                                     GROUP IS PART OF THE SUBGROUP TREE 06350000
                                     FOR PROPAGATION OF GROUP           06400000
                                     AUTHORITIES             @OZ79446*/ 06450000
                   4 * BIT(4),       /* RESERVED                 @L6A*/ 06500000
                  3 CGRPAUTH BIT(8), /* GROUP AUTHORITY INDICATORS      06550000
                                                                 @L6A*/ 06600000
                   4 CGRPSPEC BIT(1),/* ON IF GROUP-SPECIAL             06650000
                                        AUTHORITY                @L6A*/ 06700000
                   4 * BIT(1),       /* RESERVED                 @L6A*/ 06750000
                   4 CGRPOPER BIT(1),/* ON IF GROUP-OPERATIONS          06800000
                                        AUTHORITY                @L6A*/ 06850000
                   4 CGRPAUDT BIT(1),/* ON IF GROUP-AUDITOR             06900000
                                        AUTHORITY                @L6A*/ 06950000
                   4 * BIT(4),       /* RESERVED                 @L6A*/ 07000000
                 3 CGRPGPNM FIXED(15),/* NUMBER OF ENTRIES IN GROUP     07050000
                                         AUTHORITY TABLE RELATED TO     07100000
                                         THIS CONNECT GROUP      @L6A*/ 07150000
                 3 CGRPGPTE FIXED(31),/* ADDRESS OF FIRST GROUP         07200000
                                         AUTHORITY TABLE ENTRY RELATED  07250000
                                         TO THIS CONNECT GROUP   @L6A*/ 07300000
                 3 CGRPSUPG FIXED(15),/* INDEX IN CGRPENT OF ENTRY FOR  07350000
                                         SUPERIOR GROUP OF THIS ENTRY,  07400000
                                         TO WHICH THE USER IS           07450000
                                         CONNECTED               @L6A*/ 07500000
                 3 * CHAR(6),         /* RESERVED.               @L6A*/ 07550000
                 3 * CHAR(0);       /* END OF ENTRY.                 */ 07600000
         DCL CGRPTID CHAR(4) CONSTANT('CGRP');/* TABLE ID.           */ 07650000
         DCL CGRPMAXD CHAR(4) INIT('01FFFFFF'X); /* MAXIMUM CHANGE DATE 07700000
                                                                 @01A*/ 07750000
