*%;   /*                                                                00050000
         MACRO                                                          00100000
         ICHSAFV &DSECT=YES                                          */ 00150000
*/********************************************************************/ 00200000
*/*                                                                  */ 00250000
*/*   $MAC(ICHSAFV) COMP(SC1BN) PROD(SAF):                           */ 00300000
*/*                                                                  */ 00350000
*/*   MODULE NAME = ICHSAFV                                          */ 00400000
*/*                                                                  */ 00450000
*/*   DESCRIPTIVE NAME = SAF ROUTER VECTOR TABLE MAP                 */ 00500000
*/*                                                                  */ 00550000
*/*   COPYRIGHT =                                                    */ 00600000
*/*            5740-XYN, 5740-XYS COPYRIGHT IBM CORP 1980, 1992      */ 00650000
*/*            LICENSED MATERIAL - PROGRAM PROPERTY OF IBM           */ 00700000
*/*            REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083 */ 00750000
*/*                                                                  */ 00800000
*/*   STATUS =   HBB4430                                             */ 00850000
*/*                                                                  */ 00900000
*/*   FUNCTION = PROVIDES PL/S AND BAL MAPPING OF THE SAF            */ 00950000
*/*              ROUTER VECTOR TABLE THAT IS BUILT DURING            */ 01000000
*/*              SYSTEM IPL AND USED DURING A CALL TO THE            */ 01050000
*/*              SAF ROUTER.                                         */ 01100000
*/*                                                                  */ 01150000
*/*   METHOD OF ACCESS =                                             */ 01200000
*/*       PL/S = %INCLUDE(ICHSAFV)                                   */ 01250000
*/*                                                                  */ 01300000
*/*              DECLARE SAFVPTR PTR(31),                            */ 01350000
*/*              TO CONTAIN THE ADRESS OF SAFV.                      */ 01400000
*/*                                                                  */ 01450000
*/*        BAL = ICHSAFP MACRO                                       */ 01500000
*/*              A DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED    */ 01550000
*/*                                                                  */ 01600000
*/*              L      REG,SAFVPTR                                  */ 01650000
*/*              USING  SAFV,REG                                     */ 01700000
*/*                     WHERE REG IS ANY REGISTER EXCEPT 0           */ 01750000
*/*                                                                  */ 01800000
*/*      NOTE:   THE ADDRESS OF THE SAF VECTOR TABLE IS              */ 01850000
*/*              STORED IN THE CVT AT POSITION 249 (OFFSET 248),     */ 01900000
*/*              WHEN IT HAS BEEN INITIALIZED                        */ 01950000
*/*                                                                  */ 02000000
*/*   CHANGE-ACTIVITY =                                              */ 02050000
*/*          $L0=UZ90211,SAF/RF15,820817,CNTDSD:                     */ 02100000
*/*          UZ90283                                         @ZA90283*/ 02150000
*/*          UZ90284                                         @ZA90284*/ 02200000
*/*          UZ90285                                         @ZA90285*/ 02250000
*/*          $01=OY40920 RACF/190 910306 PDWJC: APAR OY40920     @01A*/ 02255500
*/*          $L1=HBB4430 OPEN/MVS 910830 PDWBF: OPEN/MVS SUPPORT @L1A*/ 02261000
*/*          $L2=HBB4430 OPEN/MVS 920330 PDDAM: OPEN/MVS SUPPORT @L2A*/ 02263700
*/*                                                                  */ 02266500
*/* 01* CHANGE DESCRIPTIONS:                                         */ 02272000
*/*     A000000-999999                                               */ 02277500
*/*  C - CHANGED CODE TO MAKE ASSEMBLER DECLARATIONS CONSISTENT      */ 02283000
*/*      WITH THE PL/AS DECLARATIONS                             @01A*/ 02288500
*/*  C - ADDED ADDRESSES FOR NEW MODULES FOR OPEN/MVS SUPPORT    @L1A*/ 02294000
*/*  C - MOVED IRRSFR10 ANCHOR TO THE CSRTABLE                   @L2A*/ 02297000
*/*                                                                  */ 02300000
*/********************************************************************/ 02350000
*%;   /*                                                                02400000
         AIF   ('&DSECT' EQ 'NO').SAFVN                                 02450000
SAFV     DSECT ,SAFVPTR            SAF VECTOR TABLE                     02500000
         AGO   .SAFVC                                                   02550000
.SAFVN   ANOP                                                           02600000
SAFV     DS    0D                  SAF VECTOR TABLE                @01C 02650000
.SAFVC   ANOP                                                           02700000
SAFVIDEN DS    CL4                 IDENTIFYING LITERAL FOR DUMPS 'SAFV' 02750000
SAFVVRSN DS    X                   TABLE VERSION NUMBER - '01'X    @L1C 02800000
         DS    CL3                 RESERVED                             02850000
SAFVEXIT DS    A                   ADDRESS OF THE SAF ROUTER EXIT       02900000
*                                    ROUTINE (ICHRTX00)                 02950000
SAFVSAFR DS    A                   ADDRESS OF THE SAF ROUTER            03000000
*                                    ROUTINE (ICHSFR00)                 03050000
SAFVRACR DS    A                   ADDRESS OF THE RACF FRONT END        03100000
*                                    ROUTINE (ICHRFR00), SET BY         03150000
*                                    RACF INITIALIZATION (ICHSEC00)     03200000
*                                    IF RACF IS INSTALLED               03250000
SAFVRACT DS    A                   ADDRESS OF THE RACF FRONT END        03300000
*                                    TABLE (ICHRFR01), SET BY           03350000
*                                    RACF INITIALIZATION (ICHSEC00)     03400000
*                                    IF RACF IS INSTALLED               03450000
SAFVEXUS DS    A                   RESERVED FOR INSTALLATION EXIT USE   03500000
*                                                                 1@L2D 03524900
SAFVRAC2 DS    A                   ADDRESS OF THE RACF FRONT END        03549800
*                                    ROUTINE FOR OMVS  (IRRRFR10)  @L1A 03566400
SAFVXIT2 DS    A                   ADDRESS OF THE SAF ROUTER EXIT       03583000
*                                    ROUTINE FOR OMVS  (IRRSXT00)  @L1A 03599600
         DS    3A                  RESERVED                        @L2C 03616200
         DS    0D                  ENSURE DOUBLE WORD LENGTH       @01C 03632800
SAFVLEN  EQU   *-SAFV              LENGTH OF THE SAF                    03650000
*                                    ROUTER VECTOR TABLE                03700000
SAFVIDC  EQU   C'SAFV'             LITERAL VALUE TO BE STORED           03750000
*                                    IN SAFVIDEN                        03800000
SAFVVNC  EQU   1                   CURRENT VALUE OF SAF VERSION         03821400
*                                    NUMBER STORED IN SAFVVRSN     @L1C 03842800
SAFVVN0  EQU   0                   ORIGINAL VALUE OF SAF VERSION        03864200
*                                    NUMBER STORED IN SAFVVRSN     @L1A 03885600
SAFVVN1  EQU   1                   VALUE OF SAF VERSION NUMBER FOR      03907000
*                                    OMVS STORED IN SAFVVRSN       @L1A 03928400
         MEND                                                        */ 03950000
*   DCL                                                                 04000000
*     1 SAFV BASED(SAFVPTR) BDY(DWORD), /* SAF VECTOR TABLE          */ 04050000
*      2 SAFVIDEN CHAR(4),          /* IDENTIFYING LITERAL FOR DUMPS    04100000
*                                      'SAFV'                        */ 04150000
*      2 SAFVVRSN FIXED(8),         /* TABLE VERSION NUMBER - '00'X  */ 04200000
*      2 * CHAR(3),                 /* RESERVED                      */ 04250000
*      2 SAFVEXIT PTR(31),          /* ADDRESS OF THE SAF ROUTER EXIT   04300000
*                                      ROUTINE (ICHRTX00)            */ 04350000
*      2 SAFVSAFR PTR(31),          /* ADDRESS OF THE SAF ROUTER        04400000
*                                      ROUTINE (ICHSFR00)            */ 04450000
*      2 SAFVRACR PTR(31),          /* ADDRESS OF THE RACF FRONT END    04500000
*                                      ROUTINE (ICHRFR00), SET BY       04550000
*                                      RACF INITIALIZATION (ICHSEC00)   04600000
*                                      IF RACF IS INSTALLED          */ 04650000
*      2 SAFVRACT PTR(31),          /* ADDRESS OF THE RACF FRONT END    04700000
*                                      TABLE (ICHRFR01), SET BY         04750000
*                                      RACF INITIALIZATION (ICHSEC00)   04800000
*                                      IF RACF IS INSTALLED          */ 04850000
*      2 SAFVEXUS PTR(31),          /* RESERVED FOR INSTALLATION EXIT   04900000
*                                      USE                      1@L2D*/ 04943000
*      2 SAFVRAC2 PTR(31),          /* ADDRESS OF THE RACF FRONT END    04986000
*                                      ROUTINE FOR OMVS  (IRRRFR10)     04995000
*                                                                @L1A*/ 05004000
*      2 SAFVXIT2 PTR(31),          /* ADDRESS OF THE SAF ROUTER EXIT   05013000
*                                      ROUTINE FOR OMVS  (IRRSXT00)     05022000
*                                                                @L1A*/ 05031000
*      2 *(3) FIXED (31),           /* RESERVED                  @L2C*/ 05040000
*      2 * CHAR(0) BDY(DWORD);      /* ENSURE DOUBLE WORD LENGTH     */ 05050000
*   DCL SAFVLEN FIXED(31) CONSTANT(LENGTH(SAFV)); /* LENGTH OF THE SAF  05100000
*                                      ROUTER VECTOR TABLE           */ 05150000
*   DCL SAFVIDC CHAR(4) CONSTANT('SAFV');/* LITERAL VALUE TO BE STORED  05200000
*                                      IN SAFVIDEN                   */ 05250000
*   DCL SAFVVNC FIXED(8) CONSTANT(1); /* CURRENT VALUE OF SAF VERSION   05300000
*                                      NUMBER STORED IN SAFVVRSN @L1C*/ 05350000
*   DCL SAFVVN0 FIXED(8) CONSTANT(0); /* ORIGINAL VALUE OF SAF VERSION  05400000
*                                      NUMBER STORED IN SAFVVRSN @L1A*/ 05450000
*   DCL SAFVVN1 FIXED(8) CONSTANT(1); /* VALUE OF SAF VERSION NUMBER    05500000
*                                      FOR OMVS STORED IN SAFVVRSN      05550000
*                                                                @L1A*/ 05600000
