*%GOTO   CVAFPLS;      /* CVAF PARAMETER LIST MAPPING MACRO             00050000
         MACRO                                                          00100000
&LABEL   ICVAFPL &DSECT=YES,&LABELS=YES,&CVPLFSA=NO               @L3C  00150000
.*  START OF SPECIFICATIONS ******************************************* 00200000
.*                                                                      00250000
.*$MAC(ICVAFPL) COMP(DM1CV):  CVAF PARAMETER LIST MAPPING MACRO         00300000
.*                                                                      00350000
.* DESCRIPTIVE-NAME = CVAF PARAMETER LIST MAPPING MACRO                 00400000
.*                                                                      00450000
.*PROPRIETARY V3 STATEMENT                                              00464200
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00478400
.*"RESTRICTED MATERIALS OF IBM"                                         00492600
.*5695-DF1                                                              00506800
.*(C) COPYRIGHT 1980,1993  IBM CORP.                                    00521000
.*END PROPRIETARY V3 STATEMENT                                          00535200
.*                                                                      00550000
.* STATUS = DFSMS/MVS 1.1.0                                             00600000
.*                                                                 @L5C 00650000
.* FUNCTION = THIS MACRO MAPS THE CVAF PARAMETER LIST.                  00700000
.*                                                                      00750000
.* NOTES = THE CVFSA ADDRESS WORD WAS APPENDED TO THE CVPL (AND THE     00764200
.*         CVPL.S LENGTH ADJUSTED) FOR THE IMPLEMENTATION OF CVAF       00778400
.*         FILTER.  THIS MACRO MAY BE USED TO MAP THE ORIGINAL CVPL     00792600
.*         (BY DEFAULT) OR THE MODIFIED CVPL (BY PARAMETER REQUEST).    00806800
.*         THE CVAFFILT MACRO MAY OPTIONALLY BE USED TO MAP THE         00821000
.*         EXPANDED CVPL.                                               00835200
.*                                                                      00850000
.* PATCH-LABEL = NOT APPLICABLE                                         00900000
.*                                                                      00950000
.* MODULE-TYPE = MACRO                                                  01000000
.*                                                                      01050000
.*   PROCESSOR = PLS OR BAL                                             01100000
.*                                                                      01150000
.*   ATTRIBUTES = MAPPING MACRO                                         01200000
.*                                                                      01250000
.* ENTRY-POINT = ICVAFPL                                                01300000
.*                                                                      01350000
.*   PURPOSE = SEE FUNCTION ABOVE.                                      01400000
.*                                                                      01450000
.*   LINKAGE = PLS -  INCLUDE ICVAFPL                                   01500000
.*                    MACRO VARIABLES CVPLPRM AND CVPLFSA               01550000
.*                    MAY BE PROVIDED (SEE INPUT BELOW).                01600000
.*                                                                      01650000
.*             BAL -  LABEL   ICVAFPL  DSECT=NO   | DSECT=YES           01675000
.*                                     LABELS=NO  | LABELS=YES          01700000
.*                                     CVPLFSA=NO | CVPLFSA=YES         01725000
.*                                                                      01750000
.*   INPUT   = PLS - MACRO VARIABLES CVPLPRM AND CVPLFSA MAY            01754400
.*                   BE PROVIDED ---                                    01758800
.*                      IF CVPLPRM='YES' THEN                           01763200
.*                        CVPL WILL NOT BE DECLARED BASED               01767600
.*                      ELSE                                            01772000
.*                        CVPL WILL BE DECLARED BASED(CVPLPTR)          01776400
.*                      IF CVPLFSA='YES' THEN                           01780800
.*                        FIELD CVFSA WILL BE APPENDED                  01785200
.*                      ELSE                                            01789600
.*                        FIELD CVFSA WILL NOT BE DECLARED              01794000
.*                                                                      01798400
.*             BAL - MACRO VARIABLES LABEL, DSECT, LABELS, AND          01802800
.*                   CVPLFSA MAY BE PROVIDED --                         01807200
.*                      DEFAULTS ARE -- LABEL = 'CVPL',                 01811600
.*                                      DSECT=YES,                      01816000
.*                                      LABELS=YES, AND                 01820400
.*                                      CVPLFSA=NO                      01824800
.*                      LABELS=NO IS SUPPORTED FOR A DADSM MODULE       01829200
.*                         WHICH INCLUDES BOTH THE ALLOCATE             01833600
.*                         AND EXTEND WORK AREAS.                       01838000
.*                         IF LABELS=NO IS REQUIRED THEN                01842400
.*                            DSECT=NO MUST ALSO BE CODED.              01846800
.*                   THE MACRO.S EXPANSION CAN BE DESCRIBED AS --       01851200
.*                      IF USER.S LABEL IS NULL                         01855600
.*                        SET ILBL='CVPL'  (SET INTERNAL LABEL)         01860000
.*                      ELSE                                            01864400
.*                        SET ILBL=LABEL   (COPY USER.S LABEL)          01868800
.*                      IF DSECT=NO THEN                                01873200
.*                        IF LABELS=NO THEN                             01877600
.*                          DO                                          01882000
.*                          GENERATE              DS    0F              01886400
.*                          GENERATE REMAINDER OF THE CVPL              01890800
.*                            (SHORT OF CVFSA) WITHOUT LABELS           01895200
.*                          IF CVPLFSA=NO (THE DEFAULT)                 01899600
.*                            GO TO MEND                                01904000
.*                          ELSE                                        01908400
.*                            GENERATE            DS    A               01912800
.*                          END                                         01917200
.*                        ELSE                                          01921600
.*                          DO                                          01926000
.*                          GENERATE       ILBL   DS  0F                01930400
.*                          GENERATE REMAINDER OF THE CVPL              01934800
.*                            (SHORT OF CVFSA) WITH LABELS              01939200
.*                          IF CVPLFSA=NO (THE DEFAULT)                 01943600
.*                            DO NOT GENERATE CVFSA                     01948000
.*                          ELSE                                        01952400
.*                            GENERATE     CVFSA  DS    A               01956800
.*                          GENERATE THE STATXXX EQUATES                01961200
.*                          END                                         01965600
.*                      ELSE                                            01970000
.*                        IF DSECT=YES THEN                             01974400
.*                          IF LABELS=NO THEN                           01978800
.*                            GENERATE AN MNOTE                         01983200
.*                          ELSE                                        01987600
.*                            DO                                        01992000
.*                            GENERATE       ILBL   DSECT               01996400
.*                            GENERATE              DS    0F            02000800
.*                            GENERATE REMAINDER OF THE CVPL            02005200
.*                              (SHORT OF CVFSA) WITH LABELS            02009600
.*                            IF CVPLFSA=NO (THE DEFAULT)               02014000
.*                              GO TO MEND                              02018400
.*                            ELSE                                      02022800
.*                              GENERATE     CVFSA  DS    A             02027200
.*                            GENERATE THE STATXXX EQUATES              02031600
.*                            END                                       02036000
.*                        ELSE                                          02040400
.*                          GENERATE AN MNOTE                           02044800
.*                                                                      02050000
.*   OUTPUT = CVAF PARAMETER LIST EXPANSION.                            02100000
.*                                                                      02150000
.* EXIT-NORMAL = MEND STATEMENT                                         02200000
.*                                                                      02250000
.* EXIT-ERROR = AN MNOTE WILL BE GENERATED IF AN INVALID KEYWORD IS     02300000
.*              PRESENT FOR BAL.                                        02350000
.*                                                                      02400000
.* EXTERNAL-REFERENCES = N/A                                            02450000
.*                                                                      02500000
.* TABLES = NONE                                                        02550000
.*                                                                      02600000
.* MACROS = NONE                                                        02650000
.*                                                                      02700000
.* CHANGE-ACTIVITY =                                                    02750000
.*$L0=IXVTOC,JDM1134,T790225,STLBS: INDEXED VTOC SUPPORT           @L0A 02775000
.*$L1=MVS/XA,JDP1111,STLBS:         MVS/XA DFP SUPPORT             @L1A 02778400
.*$L2=VSCR,HDP2210,T840521,STLMDB: CVAF VSCR                       @L2A 02781800
.*$L3=FILT,JDP2220,,STL:           CVAF FILTER SUPPORT             @L3A 02785200
.*$01=OY03241,HDP2230,T86328,STLAM: ADD CV3PTR31 TO 3RD FLAG BYTE  @01A 02788600
.*$P1=KSJ0050,JDP3311,T89051,STLMW: ADD CV3AVT TO 3RD FLAG BYTE    @P1A 02792000
.*                                  TO SUPPORT BYPASS WRITE INHIBIT@P1A 02795400
.*                                  ERROR FOR O/C/EOV              @P1A 02798800
.*$P2=KC10137/OY29193,                                             @P2A 02802200
.*            HDP3330,T90024,SJPLMW: CHANGE MACRO TO BE COMPATIBLE @P2A 02805600
.*                                   WITH NEW COMPILER RESTRICTION @P2A 02809000
.*$02=KC11146/OY38317,HDP3330,T90275,STLMNW: ADD CVSTAT 160-166    @02A 02812400
.*                               FOR DETECTION OF INVALID FORMAT-4 @02A 02815800
.*$03=OY48214,HDP3330,T911021,SJPLCJC: Dynamic I/O performance     @03A 02819200
.*$L4=IXPRUNE,jdz1110,T920210,SJPLRG: VTOC Index Pruning           @L4A 02822600
.*    add CV3HLIXP bit in 3rd Flag byte to indicate higher level   @L4A 02826000
.*    VTOC Index Pruning.                                          @L4A 02829400
.*$04=OY45592,HDP3330,T910904,SJPLCJC: CVAF VTOC ENQ               @04A 02832800
.*$L5=64KTRACK,JDZ1110,T920616,SJPLCJC: Greater than 64K tracks    @L5A 02836200
.*                                      device support             @L5A 02839600
.*$05=OY58740,JDZ1110,T921028,SJPLRGC:  New function code for      @05A 02843000
.*                                      CVAFDSM with RTA4BYTE=YES  @05A 02846400
.*$L6=UCBVSCR ,HDZ11C0,94MAY25,SJPLRPS: UCB VSCR support           @L6A 02848200
.*$L7=OW46068 ,HDZ11F0,01MAR03,SJPLJBC: Large Volume support       @L7A 02849090
.*** END OF SPECIFICATIONS ******************************************** 02850000
         LCLC  &L                      DEFINE LOCAL CHAR VARIABLE       02900000
&L       SETC  'CVPL'                                                   02950000
         AIF   ('&LABEL' EQ '').CDSECT                                  03000000
&L       SETC  '&LABEL'                                                 03050000
.CDSECT  ANOP                                                           03100000
         SPACE 1                                                        03150000
*********************************************************************** 03200000
*        CVAF PARAMETER LIST                                            03250000
*********************************************************************** 03300000
         SPACE 1                                                        03350000
         AIF   ('&DSECT' EQ 'NO').NDSECT1                               03400000
         AIF   ('&DSECT' EQ 'YES').DSECT1                               03450000
         MNOTE 12,'***  IHB001 INVALID OPERAND - DSECT=&DSECT'          03500000
         AGO   .FINISH                                                  03550000
.*                                                                 @L3A 03575000
.DSECT1  ANOP                                                           03600000
         AIF   ('&LABELS' EQ 'NO').ANOMALY                         @L3A 03625000
&L       DSECT                         CVAF PARAMETER LIST              03650000
         DS    0F                                                       03700000
         AGO   .PL                                                      03750000
.*                                                                 @L3A 03758300
.ANOMALY ANOP                                                      @L3A 03766600
         MNOTE 8,'***  IHB002 DSECT=NO REQUIRED WHEN LABELS=NO'    @L3A 03774900
         AGO   .FINISH                                             @L3A 03783200
.*                                                                 @L3A 03791500
.NDSECT1 ANOP                                                           03800000
         AIF   ('&LABELS' EQ 'NO').NOLAB1                          @L1A 03825000
&L       DS    0F                      CVAF PARAMETER LIST              03850000
.PL      ANOP                                                           03900000
CVLBL    DS    CL4                     EBCDIC 'CVPL'                    03950000
CVLTH    DS    H                       LENGTH OF CVPL                   04000000
CVFCTN   DS    XL1                     FUNCTION BYTE                    04050000
CVDIRD   EQU   X'01'                   CVAFDIR ACCESS=READ              04100000
CVDIWR   EQU   X'02'                   CVAFDIR ACCESS=WRITE             04150000
CVDIRLS  EQU   X'03'                   CVAFDIR ACCESS=RLSE              04200000
CVSEQGT  EQU   X'04'                   CVAFSEQ ACCESS=GT                04250000
CVSEQGTE EQU   X'05'                   CVAFSEQ ACCESS=GTEQ              04300000
CVDMIXA  EQU   X'06'                   CVAFDSM ACCESS=IXADD             04350000
CVDMIXD  EQU   X'07'                   CVAFDSM ACCESS=IXDLT             04400000
CVDMALC  EQU   X'08'                   CVAFDSM ACCESS=ALLOC             04450000
CVDMRLS  EQU   X'09'                   CVAFDSM ACCESS=RLSE              04500000
CVDMMAP  EQU   X'0A'                   CVAFDSM ACCESS=MAPDATA           04550000
CVVOL    EQU   X'0B'                   CVAFVOL ACCESS=VIBBLD            04600000
CVVRFRD  EQU   X'0C'                   CVAFVRF ACCESS=READ              04650000
CVVRFWR  EQU   X'0D'                   CVAFVRF ACCESS=WRITE             04700000
CVFIRD   EQU   X'0E'                   CVAFFILT ACCESS=READ        @L3A 04706200
CVFIRES  EQU   X'0F'                   CVAFFILT ACCESS=RESUME      @L3A 04712400
CVFIRLS  EQU   X'10'                   CVAFFILT ACCESS=RLSE        @L3A 04718600
CVVMALC  EQU   X'11'                   CVAFVSM  ACCESS=ALLOC       @L5A 04724800
CVVMRLS  EQU   X'12'                   CVAFVSM  ACCESS=RLSE        @L5A 04731000
CVDMMAPX EQU   X'AA'                   CVAFDSM  ACCESS=MAPDATA AND @05A 04737200
*                                      RTA4BYTE=YES                @05A 04743400
CVSTAT   DS    XL1                     STATUS INFORMATION (SEE LIST    *04750000
                                       BELOW)                           04800000
CVFL1    DS    XL1                     FIRST FLAG BYTE                  04850000
CV1IVT   EQU   X'80'                   INDEXED VTOC ACCESSED            04900000
CV1IOAR  EQU   X'40'                   IOAREA=KEEP                      04950000
CV1PGM   EQU   X'20'                   BRANCH=(YES,PGM)                 05000000
CV1MRCDS EQU   X'10'                   MAPRCDS=YES                      05050000
CV1IRCDS EQU   X'08'                   IXRCDS=KEEP                      05100000
CV1MAPIX EQU   X'04'                   MAP=INDEX                        05150000
CV1MAPVT EQU   X'02'                   MAP=VTOC                         05200000
CV1MAPVL EQU   X'01'                   MAP=VOLUME                       05250000
CVFL2    DS    XL1                     SECOND FLAG BYTE                 05300000
CV2HIVIE EQU   X'80'                   HIVIER=YES                       05350000
CV2VRF   EQU   X'40'                   VRF DATA EXISTS                  05400000
CV2CNT   EQU   X'20'                   COUNT=YES                        05450000
CV2RCVR  EQU   X'10'                   RECOVER=YES                      05500000
CV2SRCH  EQU   X'08'                   SEARCH=YES                       05550000
CV2DSNLY EQU   X'04'                   DSNONLY=YES                      05600000
CV2VER   EQU   X'02'                   VERIFY=YES                       05650000
CV2NLEVL EQU   X'01'                   OUTPUT-NEW HIGHEST LEVEL VIER    05666600
*                                      CREATED                          05683200
CVFL3    DS    XL1                     THIRD FLAG BYTE             @L3A 05687600
CV3FILT  EQU   X'80'                   FLTAREA=KEEP                @L3A 05692000
CV3IXERR EQU   X'40'                   INDEX ERROR FOUND           @L3A 05696400
CV3PTR31 EQU   X'20'                   ADDRESS WORDS IN CVPL ARE VALID  05700800
*                                      IN AMODE 31                 @01A 05705200
CV3AVT   EQU   X'10'                   SUPPORT BYPASS WRITE INHIBIT@P1A 05709600
*                                      ERROR.                      @P1A 05714000
CV3ENQD  EQU   X'08'                   CVAF caller has serialized  @04A 05718400
*                                      with another task that has  @04A 05722800
*                                      reserved the VTOC           @04A 05727200
CV3NOPIN EQU   X'04'                   Caller requested no UCBPIN  @03A 05731600
CV3HLIXP EQU   X'02'                   Higher level IX Pruning done@L4A 05736000
CV3RTA4B EQU   X'01'                   CVAFDSM RTA4BYTE=YES        @05C 05740400
CVFL4    DS    XL1                     FOURTH FLAG BYTE            @L6A 05742800
CV4UCBCA EQU   X'80'                   UCB has been captured       @L6A 05745200
CV4RSVD  EQU   X'7F'                   Reserved                    @L6A 05747600
CVUCB    DS    A                       UCB ADDRESS                      05750000
CVDSN    DS    A                       DATA SET NAME ADDRESS            05800000
         ORG   CVDSN                                               @L3A 05816600
CVFCL    DS    A                       FILTER CRITERIA LIST ADDR   @L3A 05833200
CVBUFL   DS    A                       BUFFER LIST ADDRESS              05850000
CVIRCDS  DS    A                       INDEX VIR'S BUFFER LIST ADDRESS  05900000
CVMRCDS  DS    A                       MAP VIR'S BUFFER LIST ADDRESS    05950000
CVIOAR   DS    A                       I/O AREA ADDRESS                 06000000
CVDEB    DS    A                       DEB ADDRESS                      06050000
CVARG    DS    A                       ARGUMENT ADDRESS                 06100000
CVSPACE  DS    A                       SPACE PARAMETER LIST ADDRESS     06150000
CVEXTS   DS    A                       EXTENT TABLE ADDRESS             06200000
CVBUFL2  DS    A                       NEW VRF VIXM BUFFER LIST ADDR    06250000
CVVRFDA  DS    A                       VRF DATA ADDRESS                 06300000
CVCTAR   DS    A                       COUNT AREA ADDRESS               06350000
         AIF   ('&CVPLFSA' EQ 'NO').NOFSA1                         @L3A 06362500
CVFSA    DS    A                       FILTER SAVE AREA ADDRESS    @L3A 06375000
.NOFSA1  ANOP                                                      @L3A 06387500
CVPLNGTH EQU   *-&L                                                     06400000
         SPACE 1                                                        06450000
*              VALUES OF CVSTAT                                         06500000
STAT000  EQU   0       NO ERROR                                         06520000
STAT001  EQU   1       DATASET NAME NOT FOUND                           06550000
STAT002  EQU   2       ARGUMENT SUPPLIED OUTSIDE VTOC EXTENTS           06600000
*                      OR VTOC INDEX RBA RANGE.                         06650000
STAT004  EQU   4       INVALID PARAMETER SUPPLIED (WRONG KEY),          06700000
*                      OR VRFAREA TOO SMALL.                            06750000
STAT005  EQU   5       DSN KEYWORD OMITTED.                             06800000
STAT006  EQU   6       NOT AUTHORIZED TO PERFORM THIS FUNCTION.         06850000
STAT007  EQU   7       BUFFER LIST OMITTED.                             06900000
STAT008  EQU   8       DEB INVALID OR OMITTED OR NOT OPEN TO VTOC.      06950000
STAT009  EQU   9       IOAREA=KEEP AND NOT AUTHORIZED,                  07000000
*                      OR I/O AREA SUPPLIED AND EITHER                  07050000
*                      NOT AUTHORIZED OR CVAFVOL FUNCTION.              07100000
STAT010  EQU   10      FUNCTION NOT SUPPORTED ON OS VTOC.               07150000
STAT011  EQU   11      DSCB IS NOT FORMAT 0 DSCB AND VERIFY=YES.        07200000
STAT012  EQU   12      MAPRCDS=YES AND/OR IXRCDS=KEEP BUT OS VTOC.      07250000
STAT013  EQU   13      IXRCDS=KEEP NOT SPECIFIED FOR CVAFDSM            07300000
*                      ACCESS=IXADD OR IXDLT.                           07350000
STAT014  EQU   14      CTAREA KEYWORD OMITTED.                          07400000
STAT015  EQU   15      UCB INVALID. VOLUME NOT MOUNTED,                 07450000
*                      VIO UNIT, NOT DASD.                              07500000
STAT017  EQU   17      DSCB LENGTH INVALID FOR                          07550000
*                      THE FUNCTION REQUESTED: 96 FOR A                 07600000
*                      CVAFDIR ACCESS=WRITE,VERIFY=YES.                 07650000
*                      140 FOR CVAFSEQ READING IN DATA SET              07700000
*                      NAME SEQUENCE. 96 FOR                            07750000
*                      CVAFSEQ READING IN PHYSICAL SEQUENCE.            07800000
STAT019  EQU   19      UCB OMITTED AND CVAF I/O AREA NOT SUPPLIED.      07850000
STAT022  EQU   22      DATASET NAME SUPPLIED ALREADY IN INDEX.          07900000
STAT023  EQU   23      INVALID DSN SUPPLIED (44X'FF').                  07950000
STAT024  EQU   24      ARG KEYWORD NOT SUPPLIED.                        08000000
STAT025  EQU   25      CONFLICTING OR INCOMPLETE INFORMATION            08012400
*                      SPECIFIED IN THE SPACE TABLE FOR A               08024800
*                      CVAFDSM ACCESS=ALLOC,MAP=VOLUME REQUEST OR       08033200
*                      CVAFVSM ACCESS=ALLOC REQUEST.               @L5C 08041600
STAT027  EQU   27      VTOC INDEX FULL. NO FREE VIRS                    08050000
*                      AVAILABLE AND A VIER SPLIT                       08100000
*                      IS REQUIRED.                                     08150000
STAT028  EQU   28      SPACE KEYWORD OMITTED                            08200000
*                      (CVSPACE FIELD ZERO IN CVPL).                    08250000
STAT029  EQU   29      CVAFDSM ACCESS=ALLOC:                            08300000
*                      NO FORMAT 0 DSCB AVAILABLE (MAP=VTOC),           08350000
*                      OR VTOC INDEX FULL (MAP=INDEX), OR               08400000
*                      VOLUME SPACE NOT AVAILABLE (MAP=VOLUME).         08450000
*                      CVAFVSM ACCESS=ALLOC:                            08466600
*                      VOLUME SPACE NOT AVAILABLE.                 @L5C 08483200
STAT030  EQU   30      CVAFDSM ACCESS=ALLOC:                            08500000
*                      CCHHR (MAP=VTOC) OR RBA (MAP=INDEX) OR           08550000
*                      VOLUME SPACE EXTENT (MAP=VOLUME)                 08600000
*                      ALREADY ALLOCATED.                               08650000
*                      CVAFVSM ACCESS=ALLOC:                            08675000
*                      VOLUME SPACE EXTENT ALREADY ALLOCATED.      @L5C 08700000
STAT031  EQU   31      CVAFDSM ACCESS=ALLOC:                            08725000
*                      CCHHR SUPPLIED OUTSIDE VTOC EXTENTS (MAP=VTOC),  08750000
*                      OR RBA OUTSIDE VTOC INDEX EXTENTS                08800000
*                      (MAP=INDEX), OR VOLUME SPACE EXTENT INVALID OR   08850000
*                      OUTSIDE VOLUME (MAP=VOLUME).                     08900000
*                      CVAFVSM ACCESS=ALLOC:                            08936100
*                      VOLUME SPACE EXTENT INVALID OR OUTSIDE           08972200
*                      VOLUME.                                          09008300
*                      CVAFDSM ACCESS=MAPDATA:                          09044400
*                      INPUT STARTING RBN IS INVALID.              @05C 09080500
STAT032  EQU   32      END OF DATA.                                     09116600
*                      (CVAFDSM ACCESS=MAPDATA): NO MORE FREE           09152700
*                      EXTENTS.                                         09188800
*                      (CVAFSEQ): NO MORE NAMES IN INDEX OR DSCBS       09224900
*                      IN VTOC.  FOR INDEXED ACCESS, NO DSN IN          09261000
*                      VTOC INDEX WITH HIGHER OR HIGHER-OR-EQUAL        09297100
*                      KEY THAN THAT SUPPLIED.  FOR PHYSICAL            09333200
*                      SEQUENTIAL ACCESS, NO DSCB IN THE VTOC HAS       09369300
*                      A HIGHER ARGUMENT THAN THAT SUPPLIED.  FOR       09405400
*                      A MULTIPLE DSCB REQUEST, THE LAST DSCB IN        09441500
*                      THE VTOC WAS READ AND MORE DSCBS WERE            09477600
*                      REQUESTED.                                  @L5C 09513700
STAT033  EQU   33      EXTENTS KEYWORD OMITTED OR                       09550000
*                      SUPPLIED NUMBER OF EXTENTS IS ZERO.              09575000
STAT034  EQU   34      CVAFDSM ACCESS=RLSE:                             09600000
*                      FORMAT 0 DSCB ALREADY FREE (MAP=VTOC),           09650000
*                      OR VIER ALREADY UNALLOCATED (MAP=INDEX)          09700000
*                      OR VOLUME SPACE EXTENT                           09750000
*                      ALREADY UNALLOCATED (MAP=VOLUME).                09800000
*                      CVAFVSM ACCESS=RLSE:                             09816600
*                      VOLUME SPACE EXTENT ALREADY UNALLOCATED.    @L5C 09833200
STAT042  EQU   42      VRF DATA SUPPLIED FOR WRITE TOO LONG.            09850000
STAT043  EQU   43      BUFFER LIST IS FOR VTOC INDEX VIRS               09900000
*                      BUT A DSCB BUFFER LIST WAS                       09950000
*                      REQUIRED (OS VTOC ACCESSED. CVAFSEQ CALL).       10000000
STAT044  EQU   44      NO BUFFER LIST ENTRY FOUND.                      10050000
STAT045  EQU   45      INVALID DSCB BUFFER LENGTH                       10100000
*                      (NEITHER 96 NOR 140) IN BUFFER                   10150000
*                      LIST ENTRY, OR VIR BUFFER LENGTH                 10200000
*                      NOT EQUAL TO VIB VIR SIZE.                       10250000
STAT046  EQU   46      NEITHER TTR NOR CCHHR BITS SET                   10300000
*                      IN BUFFER LIST ENTRY FOR A 140 BYTE              10350000
*                      DSCB READ OR WRITE REQUEST.              @L3C    10400000
STAT047  EQU   47      MORE THAN ONE OF THE TTR,                        10500000
*                      CCHHR, AND RBA BITS SET IN                       10550000
*                      THE BUFFER LIST ENTRY.                           10600000
STAT048  EQU   48      BOTH THE DSCB AND VIR BITS                       10650000
*                      SET IN THE BUFFER LIST HEADER.                   10700000
STAT049  EQU   49      RBA BIT SET IN A BUFFER LIST                     10750000
*                      ENTRY FOR A DSCB BUFFER LIST.                    10800000
STAT050  EQU   50      TTR OR CCHHR BIT SET                             10850000
*                      IN BUFFER LIST ENTRY BUT BUFFER                  10900000
*                      LIST HEADER INDICATES VIR BUFFER LIST.           10950000
STAT052  EQU   52      COMBINATION OF MAP AND COUNT NOT SUPPORTED.      11000000
STAT053  EQU   53      MAP OMITTED OR WAS MULTIPLY SPECIFIED       @L5C 11050000
STAT054  EQU   54      VIR BUFFER LIST CHAINED TO                       11100000
*                      OR FROM A DSCB BUFFER LIST.                      11150000
STAT055  EQU   55      UNAUTHORIZED CALLER AND VIB NOT INITIALIZED.     11200000
STAT056  EQU   56      MAPRCDS=YES NOT SPECIFIED BUT REQUIRED.          11250000
STAT057  EQU   57      DSCB BUFFER LIST SUPPLIED BUT                    11300000
*                      VIR BUFFER LIST REQUIRED (IN                     11350000
*                      MAPRCDS OR IXRCDS BUFFER LIST ADDRESS            11400000
*                      IN CVAF PARAMETER LIST).                         11450000
STAT058  EQU   58      NEITHER VIR NOR DSCB BIT SET                     11500000
*                      IN BUFFER LIST HEADER.                           11550000
STAT060  EQU   60      INVALID OR CONFLICTING SETTING OF                11600000
*                      ALLOCATE OPTION BYTE IN SPACE PARAMETER.         11650000
STAT061  EQU   61      FILTER CRITERIA LIST OMITTED,               @L3A 11650400
*                      OR ID NOT 'FCL '.                           @L3A 11650800
STAT062  EQU   62      FCLCOUNT IS ZERO OR NO ELEMENTS TO PROCESS  @L3A 11651200
STAT063  EQU   63      GENERIC ACCESS WITH MORE THAN               @L3A 11651600
*                      ONE PARTIALLY QUALIFIED DATA SET NAME.      @L3A 11652000
STAT064  EQU   64      RESUME RECOMMENDED.                         @L3A 11652400
STAT065  EQU   65      BUFFER LENGTH NOT 140, OR ANOTHER           @L3A 11652800
*                      BUFFER LIST ENTRY ERROR.                    @L3A 11653200
STAT066  EQU   66      RESUME ACCESS WITH FSA ADDRESS OF ZERO OR   @L3A 11653600
*                      FSA NOT IN CVAF KEY.                        @L3A 11654000
STAT067  EQU   67      INVALID PARTIALLY QUALIFIED                 @L3A 11654400
*                      DATA SET NAME FOR GENERIC ACCESS.           @L3A 11654800
STAT068  EQU   68      FCL NOT IN USER KEY.                        @L3A 11655200
STAT069  EQU   69      INTERNAL GETMAIN ERROR.                     @L3A 11655600
STAT070  EQU   70      DIRECT PATH I/O ERROR                       @L3A 11656000
STAT071  EQU   71      SEQUENTIAL PATH I/O ERROR.                  @L3A 11656400
STAT072  EQU   72      ANOMALY PRESENT, NO RESUME                  @L3A 11656800
*                      RECOMMENDED.                                @L3A 11657200
STAT073  EQU   73      ANOMALY PRESENT, RESUME                     @L3A 11657600
*                      RECOMMENDED.                                @L3A 11658000
STAT074  EQU   74      FCLDSNLG IS EITHER 0 OR IS GREATER THAN 44, @L3A 11658400
*                      OR (FCLDSNA IS 0 OR NOT IN USER KEY)        @L3A 11658800
STAT075  EQU   75      EXTENT IS BEYOND 64*1024 TRACKS BOUNDARY.        11659200
*                      For CVAFDSM ACCESS=MAPDATA MAP=VOLUME:           11659600
*                      THE FREE EXTENTS UP TO 64*1024 TRACKS BOUNDARY   11660000
*                      IF ANY, ARE RETURNED IN THE EXTENT TABLE OF      11660400
*                      XXYYZ FORMAT. SUGGEST CALLER TO SPECIFY RTA4BYTE 11660800
*                      =YES AND USE EXTENT TABLE MAPPED BY ICVEDT02.    11661200
*                                                                  @05C 11661600
STAT076  EQU   76      VTOC STATUS FROM F4 DSCB DOES NOT MATCH WHAT     11662000
*                      INDICATED IN CVPL FLAG CV1IVT.              @L5A 11662400
STAT077  EQU   77      ID OF F5 OR F7 DSCB IS INCORRECT.           @L5A 11662800
STAT078  EQU   78      ID OF EXTENT TABLE IS INCORRECT.            @L5A 11663200
STAT079  EQU   79      ID OF SPACE TABLE IS INCORRECT.             @L5A 11663600
STAT080  EQU   80      RTA4BYTE=YES WAS NOT SPECIFIED FOR CVAFDSM  @L5A 11664000
*                      ACCESS=MAPDATA MAP=VOLUME FOR AN OS VTOC    @L5A 11664400
*                      VOLUME.                                     @L5A 11664800
STAT081  EQU   81      RESERVED.                                   @L5A 11665200
STAT127  EQU   127     I/O ERROR OCCURRED.                              11666600
STAT128  EQU   128     RESERVED.                                        11683200
STAT129  EQU   129     THE FIRST HIGH LEVEL VIER                        11700000
*                      AS INDICATED IN THE VIXM                         11750000
*                      DOES NOT HAVE THE FLAG BIT SET INDICATING        11800000
*                      IT IS THE FIRST HIGH LEVEL VIER.                 11850000
STAT130  EQU   130     HORIZONTAL OR VERTICAL VIER                      11900000
*                      POINTER IS OUTSIDE VTOC INDEX RBA RANGE          11950000
STAT131  EQU   131     VERTICAL VIER POINTER                            12000000
*                      POINTS TO A VIR WHICH IS NOT                     12050000
*                      A VIER (INVALID ID IN HEADER).                   12100000
STAT132  EQU   132     LEVEL N VERTICAL INDEX ENTRY                     12150000
*                      POINTER POINTS TO VIER WHICH IS                  12200000
*                      NOT AT LEVEL N-1.                                12250000
STAT133  EQU   133     LEVEL N HORIZONTAL INDEX ENTRY                   12300000
*                      POINTER POINTS TO VIER                           12350000
*                      WHICH IS NOT AT LEVEL N.                         12400000
STAT134  EQU   134     HORIZONTAL VIER/MAP POINTER POINTS TO A          12450000
*                      VIR WHICH IS NOT A VIER/MAP (INVALID ID IN       12483300
*                      HEADER).                                         12516600
STAT135  EQU   135     HORIZONTAL MAP POINTER                           12550000
*                      POINTS TO VIR WHICH IS NOT ONE OF THE            12600000
*                      FIRST N VTOC INDEX RECORDS                       12650000
*                      (N IS RECORDED IN VIXM FIELD VIMRCDS) OR THE     12700000
*                      FIRST RECORD IN THE VTOC INDEX IS NOT A VIXM.    12750000
*                                                                       12800000
STAT136  EQU   136     LEVEL 1 INDEX ENTRY CONTAINS                     12850000
*                      A CCHHR POINTER WHICH IS OUTSIDE                 12900000
*                      THE VTOC EXTENT.                                 12950000
STAT137  EQU   137     THE FIRST HIGH LEVEL VIER,                       13000000
*                      AS INDICATED IN THE VIB                          13050000
*                      DOES NOT HAVE THE FLAG BIT SET                   13100000
*                      INDICATING IT IS THE FIRST HIGH                  13150000
*                      LEVEL VIER. (THIS ERROR IS EITHER                13200000
*                      RECOVERED FROM BY UPDATING                       13250000
*                      THE VIB FROM THE VIXM, OR THE                    13300000
*                      ERROR IS CHANGED TO 129).                        13350000
STAT138  EQU   138     THE RBA OF THE VTOC INDEX VIR                    13400000
*                      DOES NOT MATCH THE RBA RECORDED                  13450000
*                      IN THE HEADER OF THE RECORD.                     13500000
STAT139  EQU   139     THE FIRST RECORD OF A MAP                        13550000
*                      (VIXM, VPSM, OR VMDS) IS NOT ONE OF              13600000
*                      THE FIRST N VTOC INDEX RECORDS                   13650000
*                      (N IS RECORDED IN THE VIXM FIELD,                13700000
*                      VIMRCDS).                                        13750000
STAT140  EQU   140     DATA SET NAME IN LEVEL                           13800000
*                      N+1 VIER ENTRY IS LOWER THAN THE                 13850000
*                      HIGH KEY OF THE LEVEL N VIER                     13900000
*                      WHICH THE LEVEL N+1 VIER ENTRY                   13950000
*                      POINTS TO.                                       14000000
STAT141  EQU   141     FIRST HIGH LEVEL VIER                            14050000
*                      STRUCTURE ERROR BIT ON.                          14100000
STAT142  EQU   142     I/O ERROR INDICATING                             14150000
*                      THE VTOC INDEX IS NOT FORMATTED                  14200000
*                      CORRECTLY.                                       14250000
STAT143  EQU   143     EITHER INDEX BIT ZERO OR                         14300000
*                      DOS BIT ZERO IN FORMAT 4 DSCB                    14350000
*                      OF VTOC PREVIOUSLY FOUND TO BE AN INDEXED VTOC.  14400000
STAT144  EQU   144     NO SYS1.VTOCIX.NNN DATA SET NAME                 14450000
*                      IN VTOC WHOSE FORMAT 4 DSCB                      14500000
*                      HAS THE INDEX BIT ON.                            14550000
STAT145  EQU   145     DATA SET NAME IN LEVEL N+1                       14600000
*                      VIER ENTRY IS HIGHER THAN THE                    14650000
*                      HIGH KEY OF THE LEVEL N VIER WHICH THE           14700000
*                      LEVEL N+1 VIER ENTRY POINTS TO                   14750000
STAT146  EQU   146     FOUR OR MORE HIGH LEVEL                          14800000
*                      VIERS WERE ENCOUNTERED.                          14850000
STAT147  EQU   147     TOO MANY LEVELS IN THE VTOC INDEX. THE           14900000
*                      SEARCH LIST LENGTH (DEFINED IN STATIC TEXT       14950000
*                      MODULE, ICVIXST0) WAS EXCEEDED.                  15000000
STAT148  EQU   148     VIER INVALID. OFFSET                             15050000
*                      TO LAST SECTION INVALID.                         15100000
STAT149  EQU   149     VIER INVALID. OFFSET                             15150000
*                      TO LAST ENTRY IN A SECTION INVALID.              15200000
STAT150  EQU   150     MEDIA MANAGER INITIALIZATION                     15216600
*                      FAILED                                           15233200
STAT151  EQU   151     LEVEL 2 OR HIGHER VIER                           15250000
*                      CONTAINS LESS THAN TWO ENTRIES.                  15300000
STAT152  EQU   152     RECOVER=YES SPECIFIED                            15350000
*                      BUT THE STATIC TEXT MODULE (ICVIXST0)            15400000
*                      INDICATES RECOVERY IS NOT PERMITTED.             15450000
STAT153  EQU   153     THE FORMAT 4 DSCB IS WRITTEN                     15500000
*                      WITH EITHER THE INDEX OR DOS BIT                 15550000
*                      BIT ZEROED ON AN INDEXED VTOC.                   15600000
STAT154  EQU   154     A SPACE MAP EXTENDS OVER                         15650000
*                      MORE THAN 131 VTOC INDEX RECORDS.           @L7C 15700000
STAT155  EQU   155     DSN NOT FOUND IN SECTION WITH KEY                15750000
*                      GREATER THAN OR EQUAL TO THE DSN BEING SEARCHED. 15800000
*                      INVALID SECTION IN VIER.                         15850000
STAT156  EQU   156     INVALID VIER HORIZONTAL                          15900000
*                      POINTER. HORIZONTAL POINTER OF VIER1 POINTS TO   15950000
*                      VIER2 WHOSE HIGH KEY IS LOWER THAN OR EQUAL TO   16000000
*                      THE HIGH KEY OF VIER1.                           16050000
STAT157  EQU   157     COULD NOT FIND ENTRY IN LEVEL 2                  16100000
*                      OR HIGHER VIER THAT MATCHES THE                  16150000
*                      HIGH KEY OF THE VIER.                            16200000
STAT158  EQU   158     INVALID SECTION LENGTH OR INVALID NUMBER         16216600
*                      OF SECTIONS IN VIER HEADER.                      16233200
STAT159  EQU   159     THE FIRST HIGH LEVEL VIER POINTED TO BY THE VIB  16238700
*                      HAS AN INVALID ID IN HEADER.                     16244200
STAT160  EQU   160     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244300
STAT161  EQU   161     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244400
STAT162  EQU   162     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244500
STAT163  EQU   163     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244600
STAT164  EQU   164     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244700
STAT165  EQU   165     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244800
STAT166  EQU   166     DETECT AN INVALID FORMAT-4 DETECTED         @02A 16244900
         AGO   .FINISH                                             @L1A 16245000
.NOLAB1  ANOP                                                      @L1A 16245100
         DS    0F                      CVAF PARAMETER LIST              16245200
         DS    CL4                     EBCDIC 'CVPL'               @L1A 16245300
         DS    H                       LENGTH OF CVPL              @L1A 16245400
         DS    XL1                     FUNCTION BYTE               @L1A 16245500
         DS    XL1                     STATUS INFORMATION          @L1A 16245600
         DS    XL1                     FIRST FLAG BYTE             @L1A 16245700
         DS    XL1                     SECOND FLAG BYTE            @L1A 16245800
         DS    H                       RESERVED                    @L1A 16245900
         DS    A                       UCB ADDRESS                 @L1A 16246000
         DS    A                       DATA SET NAME ADDRESS       @L1A 16246100
         DS    A                       BUFFER LIST ADDRESS         @L1A 16246200
         DS    A                       INDEX VIR'S BUFFER LIST ADDR@L1A 16246300
         DS    A                       MAP VIR'S BUFFER LIST ADDR  @L1A 16246400
         DS    A                       I/O AREA ADDRESS            @L1A 16246500
         DS    A                       DEB ADDRESS                 @L1A 16246600
         DS    A                       ARGUMENT ADDRESS            @L1A 16246700
         DS    A                       SPACE PARAMETER LIST ADDR   @L1A 16246800
         DS    A                       EXTENT TABLE ADDRESS        @L1A 16246900
         DS    A                       NEW VRF VIXM BUFFER LIST ADDRL1A 16247000
         DS    A                       VRF DATA ADDRESS            @L1A 16247100
         DS    A                       COUNT AREA ADDRESS          @L1A 16247200
         AIF   ('&CVPLFSA' EQ 'NO').FINISH                         @L3A 16247300
         DS    A                       FILTER SAVE AREA ADDRESS    @L3A 16247400
.FINISH  MEND                                                           16250000
**********************************************************************/ 16300000
*%CVAFPLS: ;                                                            16350000
*                                                                       16400000
*/********************************************************************/ 16450000
*/*      CVAF PARAMETER LIST                                         */ 16500000
*/********************************************************************/ 16550000
*                                                                       16600000
* DCL 1 CVPL BDY(WORD)                                                  16700000
*%IF CVPLPRM='YES' %THEN %GOTO CVPL1;                                   16750000
*                      BASED(CVPLPTR)                                   16800000
*%CVPL1:;                                                               16850000
*                                , /* CVAF PARAMETER LIST            */ 16900000
*      2 CVLBL      CHAR(4),       /* EBCDIC 'CVPL'                  */ 16950000
*      2 CVLTH    FIXED(15),       /* LENGTH OF CVPL                 */ 17000000
*      2 CVFCTN      BIT(8),       /* FUNCTION BYTE (SEE VALUES         17050000
*                                     BELOW)                         */ 17100000
*      2 CVSTAT    FIXED(8),       /* STATUS INFORMATION (SEE VALUES    17150000
*                                     BELOW)                         */ 17200000
*      2 CVFL1       BIT(8),       /* FIRST FLAG BYTE                */ 17250000
*       3 CV1IVT     BIT(1),       /* INDEXED VTOC ACCESSED          */ 17300000
*       3 CV1IOAR    BIT(1),       /* IOAREA=KEEP                    */ 17350000
*       3 CV1PGM     BIT(1),       /* BRANCH=(YES,PGM)               */ 17400000
*       3 CV1MRCDS   BIT(1),       /* MAPRCDS=YES                    */ 17450000
*       3 CV1IRCDS   BIT(1),       /* IXRCDS=KEEP                    */ 17500000
*       3 CV1MAP     BIT(3),       /* MAP BITS (SEE NEXT THREE BITS) */ 17550000
*        4 CV1MAPIX  BIT(1),       /* MAP=INDEX                      */ 17580000
*        4 CV1MAPVT  BIT(1),       /* MAP=VTOC                       */ 17610000
*        4 CV1MAPVL  BIT(1),       /* MAP=VOLUME                     */ 17640000
*      2 CVFL2       BIT(8),       /* SECOND FLAG BYTE               */ 17700000
*       3 CV2HIVIE   BIT(1),       /* HIVIER=YES                     */ 17750000
*       3 CV2VRF     BIT(1),       /* VRF DATA EXISTS                */ 17800000
*       3 CV2CNT     BIT(1),       /* COUNT=YES                      */ 17850000
*       3 CV2RCVR    BIT(1),       /* RECOVER=YES                    */ 17900000
*       3 CV2SRCH    BIT(1),       /* SEARCH=YES                     */ 17950000
*       3 CV2DSNLY   BIT(1),       /* DSNONLY=YES                    */ 18000000
*       3 CV2VER     BIT(1),       /* VERIFY=YES                     */ 18050000
*       3 CV2NLEVL   BIT(1),       /* OUTPUT-NEW HIGHEST LEVEL VIER     18100000
*                                     CREATED                        */ 18125000
*      2 CVFL3       BIT(8),       /* THIRD FLAG BYTE            @L3A*/ 18130000
*       3 CV3FILT    BIT(1),       /* FLTAREA=KEEP               @L3A*/ 18135000
*       3 CV3IXERR   BIT(1),       /* INDEX ERROR FOUND          @L3A*/ 18140000
*       3 CV3PTR31   BIT(1),       /* ADDRESS WORDS IN CVPL ARE         18145000
*                                     VALID IN AMODE 31          @01A*/ 18150000
*       3 CV3AVT     BIT(1),       /*  SUPPORT BYPASS WRITE INHIBIT     18155000
*                                      ERROR.                    @P1A*/ 18160000
*       3 CV3ENQD    BIT(1),       /* CVAF caller has serialized with   18165000
*                                      another task that has reserved   18170000
*                                      the VTOC                  @04A*/ 18175000
*       3 CV3NOPIN   BIT(1),       /* Caller requested no UCBPIN @03A*/ 18180000
*       3 CV3HLIXP   BIT(1),       /* Higher lvl IX pruning done @L4A*/ 18185000
*       3 CV3RTA4B   BIT(1),       /* CVAFDSM RTA4BYTE=YES       @05C*/ 18190000
*      2 CVFL4       BIT(8),       /* Fourth flag byte           @L6C*/ 18192500
*       3 CV4UCBCA   BIT(1),       /* UCB has been captured      @L6A*/ 18195000
*       3 CV4RSVD    BIT(7),       /* Reserved                   @L6A*/ 18197500
*      2 CVUCB      PTR(31),       /* UCB ADDRESS                    */ 18200000
*      2 CVDSN      PTR(31),       /* DATA SET NAME ADDRESS          */ 18250000
*        3 CVFCL    PTR(31),       /* FILTER CRITERIA LIST ADDR  @L3A*/ 18275000
*      2 CVBUFL     PTR(31),       /* BUFFER LIST ADDRESS            */ 18300000
*      2 CVIRCDS    PTR(31),       /* INDEX VIR'S BUFFER LIST PTR    */ 18350000
*      2 CVMRCDS    PTR(31),       /* MAP VIR'S BUFFER LIST PTR      */ 18400000
*      2 CVIOAR     PTR(31),       /* I/O AREA ADDRESS               */ 18450000
*      2 CVDEB      PTR(31),       /* DEB ADDRESS                    */ 18500000
*      2 CVARG      PTR(31),       /* ARGUMENT ADDRESS               */ 18550000
*      2 CVSPACE    PTR(31),       /* SPACE PARAMETER LIST ADDRESS   */ 18600000
*      2 CVEXTS     PTR(31),       /* EXTENT TABLE ADDRESS           */ 18650000
*      2 CVBUFL2    PTR(31),       /* NEW VRF VIXM BUFFER LIST PTR   */ 18700000
*      2 CVVRFDA    PTR(31),       /* VRF DATA ADDRESS               */ 18750000
*%IF CVPLFSA='YES' %THEN %GOTO GIVEFSA;                     /*   @L3A*/ 18762500
*      2 CVCTAR     PTR(31);       /* COUNT AREA ADDRESS         @L3A*/ 18775000
*%GOTO FSACONT;                                             /*   @L3A*/ 18787500
*%GIVEFSA:;                                                 /*   @L3A*/ 18800000
*      2 CVCTAR     PTR(31),       /* COUNT AREA ADDRESS         @L3C*/ 18812500
*      2 CVFSA      PTR(31);       /* FILTER SAVE AREA ADDRESS   @L3A*/ 18825000
*%FSACONT:;                                                 /*   @L3A*/ 18837500
*                                                                       18850000
*/********************************************************************/ 18860000
*/*            VALUES OF CVFCTN                                      */ 18870000
*/********************************************************************/ 18880000
*                                                                       18890000
* DCL CVDIRD     BIT(8) CONSTANT('01'X); /* CVAFDIR ACCESS=READ      */ 18900000
* DCL CVDIWR     BIT(8) CONSTANT('02'X); /* CVAFDIR ACCESS=WRITE     */ 18950000
* DCL CVDIRLS    BIT(8) CONSTANT('03'X); /* CVAFDIR ACCESS=RLSE      */ 19000000
* DCL CVSEQGT    BIT(8) CONSTANT('04'X); /* CVAFSEQ ACCESS=GT        */ 19050000
* DCL CVSEQGTE   BIT(8) CONSTANT('05'X); /* CVAFSEQ ACCESS=GTEQ      */ 19100000
* DCL CVDMIXA    BIT(8) CONSTANT('06'X); /* CVAFDSM ACCESS=IXADD     */ 19150000
* DCL CVDMIXD    BIT(8) CONSTANT('07'X); /* CVAFDSM ACCESS=IXDLT     */ 19200000
* DCL CVDMALC    BIT(8) CONSTANT('08'X); /* CVAFDSM ACCESS=ALLOC     */ 19250000
* DCL CVDMRLS    BIT(8) CONSTANT('09'X); /* CVAFDSM ACCESS=RLSE      */ 19300000
* DCL CVDMMAP    BIT(8) CONSTANT('0A'X); /* CVAFDSM ACCESS=MAPDATA   */ 19350000
* DCL CVVOL      BIT(8) CONSTANT('0B'X); /* CVAFVOL ACCESS=VIBBLD    */ 19400000
* DCL CVVRFRD    BIT(8) CONSTANT('0C'X); /* CVAFVRF ACCESS=READ      */ 19450000
* DCL CVVRFWR    BIT(8) CONSTANT('0D'X); /* CVAFVRF ACCESS=WRITE     */ 19500000
* DCL CVFIRD     BIT(8) CONSTANT('0E'X); /*CVAFFILT ACCESS=READ  @L3A*/ 19506200
* DCL CVFIRES    BIT(8) CONSTANT('0F'X); /*CVAFFILT ACCESS=RESUME@L3A*/ 19512400
* DCL CVFIRLS    BIT(8) CONSTANT('10'X); /*CVAFFILT ACCESS=RLSE  @L3A*/ 19518600
* DCL CVVMALC    BIT(8) CONSTANT('11'X); /* CVAFVSM ACCESS=ALLOC @L5A*/ 19524800
* DCL CVVMRLS    BIT(8) CONSTANT('12'X); /* CVAFVSM ACCESS=RLSE  @L5A*/ 19531000
* DCL CVDMMAPX   BIT(8) CONSTANT('AA'X); /* CVAFDSM ACCESS=MAPDATA      19537200
*                                           RTA4BYTE=YES         @05A*/ 19543400
*                                                                       19550000
*%DCL CV1MIX     CHAR;                   /* MAP=INDEX  SET TO:       */ 19557000
*%CV1MIX = '''100''B';                   /* BIT PATTERN '100'        */ 19564000
*                                                                       19571000
*%DCL CV1MVT     CHAR;                   /* MAP=VTOC   SET TO:       */ 19578000
*%CV1MVT = '''010''B';                   /* BIT PATTERN '010'        */ 19585000
*                                                                       19592000
*%DCL CV1MVL     CHAR;                   /* MAP=VOLUME SET TO:       */ 19599000
*%CV1MVL = '''001''B';                   /* BIT PATTERN '001'        */ 19606000
*                                                                       19613000
*/********************************************************************/ 19620000
*/*              VALUES OF CVSTAT                                    */ 19670000
*/********************************************************************/ 19720000
*                                                                       19770000
*DCL (                                                                  19820000
*STAT000 CONSTANT(0),   /*NO ERROR*/                                    19870000
*STAT001 CONSTANT(1),   /*DATASET NAME NOT FOUND*/                      19920000
*STAT002 CONSTANT(2),   /*ARGUMENT SUPPLIED OUTSIDE VTOC EXTENTS        19970000
*                         OR VTOC INDEX RBA RANGE.*/                    20020000
*STAT004 CONSTANT(4),   /*INVALID PARAMETER SUPPLIED (WRONG KEY),       20070000
*                         OR VRFAREA TOO SMALL.*/                       20120000
*STAT005 CONSTANT(5),   /*DSN KEYWORD OMITTED.*/                        20170000
*STAT006 CONSTANT(6),   /*NOT AUTHORIZED TO PERFORM THIS FUNCTION.*/    20220000
*STAT007 CONSTANT(7),   /*BUFFER LIST OMITTED.*/                        20270000
*STAT008 CONSTANT(8),   /*DEB INVALID OR OMITTED OR NOT OPEN TO VTOC.*/ 20320000
*STAT009 CONSTANT(9),   /*IOAREA=KEEP AND NOT AUTHORIZED,               20370000
*                         OR I/O AREA SUPPLIED AND EITHER               20420000
*                         NOT AUTHORIZED OR CVAFVOL FUNCTION.*/         20470000
*STAT010 CONSTANT(10),  /*FUNCTION NOT SUPPORTED ON OS VTOC.*/          20520000
*STAT011 CONSTANT(11),  /*DSCB IS NOT FORMAT 0 DSCB AND VERIFY=YES.*/   20570000
*STAT012 CONSTANT(12),  /*MAPRCDS=YES AND/OR IXRCDS=KEEP BUT OS VTOC.*/ 20620000
*STAT013 CONSTANT(13),  /*IXRCDS=KEEP NOT SPECIFIED FOR CVAFDSM         20670000
*                         ACCESS=IXADD OR IXDLT.*/                      20720000
*STAT014 CONSTANT(14),  /*CTAREA KEYWORD OMITTED.*/                     20770000
*STAT015 CONSTANT(15),  /*UCB INVALID. VOLUME NOT MOUNTED,              20820000
*                         VIO UNIT, NOT DASD.*/                         20870000
*STAT017 CONSTANT(17),  /*DSCB LENGTH INVALID FOR THE FUNCTION          20920000
*                         REQUESTED: 96 FOR A CVAFDIR ACCESS=WRITE,     20970000
*                         VERIFY=YES.  140 FOR CVAFSEQ READING          21020000
*                         IN DATA SET NAME SEQUENCE.  96 FOR            21070000
*                         CVAFSEQ READING IN PHYSICAL SEQUENCE.*/       21120000
*STAT019 CONSTANT(19),  /*UCB OMITTED AND CVAF I/O AREA NOT SUPPLIED.*/ 21170000
*STAT022 CONSTANT(22),  /*DATASET NAME SUPPLIED ALREADY IN INDEX.*/     21220000
*STAT023 CONSTANT(23),  /*INVALID DSN SUPPLIED (44X'FF').*/             21270000
*STAT024 CONSTANT(24),  /*ARG KEYWORD NOT SUPPLIED.*/                   21320000
*STAT025 CONSTANT(25),  /*CONFLICTING OR INCOMPLETE INFORMATION         21370000
*                         SPECIFIED IN THE SPACE TABLE FOR A            21420000
*                         CVAFDSM ACCESS=ALLOC,MAP=VOLUME REQUEST OR    21453300
*                         CVAFVSM ACCESS=ALLOC REQUEST           @L5C*/ 21486600
*STAT027 CONSTANT(27),  /*VTOC INDEX FULL. NO FREE VIRS                 21520000
*                         AVAILABLE AND A VIER SPLIT IS REQUIRED.*/     21570000
*STAT028 CONSTANT(28),  /*SPACE KEYWORD OMITTED                         21620000
*                         (CVSPACE FIELD ZERO IN CVPL).*/               21670000
*STAT029 CONSTANT(29),  /*CVAFDSM ACCESS=ALLOC: NO F0 DSCB AVAILABLE    21720000
*                         (MAP=VTOC), OR VTOC INDEX FULL (MAP=INDEX),   21770000
*                         OR VOLUME SPACE NOT AVAILABLE (MAP=VOLUME).   21795000
*                         CVAFVSM ACCESS=ALLOC: VOLUME SPACE NOT        21820000
*                         AVAILABLE.                             @L5C*/ 21845000
*STAT030 CONSTANT(30),  /*CVAFDSM ACCESS=ALLOC:                         21870000
*                         CCHHR (MAP=VTOC) OR RBA (MAP=INDEX) OR        21920000
*                         VOLUME SPACE EXTENT (MAP=VOLUME)              21970000
*                         ALREADY ALLOCATED.                            21995000
*                         CVAFVSM ACCESS=ALLOC:                         22020000
*                         VOLUME SPACE EXTENT ALREADY ALLOCATED. @L5C*/ 22045000
*STAT031 CONSTANT(31),  /*CVAFDSM ACCESS=ALLOC: CCHHR SUPPLIED          22070000
*                         OUTSIDE VTOC EXTENTS (MAP=VTOC),              22120000
*                         OR RBA OUTSIDE VTOC INDEX EXTENTS(MAP=INDEX), 22170000
*                         OR VOLUME SPACE EXTENT INVALID.               22212800
*                         CVAFVSM ACCESS=ALLOC:                         22255600
*                         VOLUME SPACE EXTENT INVALID OR OUTSIDE        22298400
*                         VOLUME.                                       22341200
*                         CVAFDSM ACCESS=MAPDATA:                       22384000
*                         INPUT STARTING RBN IS INVALID.         @05C*/ 22426800
*STAT032 CONSTANT(32),  /*END OF DATA.                                  22469600
*                         (CVAFDSM ACCESS=MAPDATA): NO MORE FREE        22512400
*                         EXTENTS.                                      22555200
*                         (CVAFSEQ):  NO MORE NAMES IN INDEX OR DSCBS   22598000
*                         IN VTOC. FOR INDEXED ACCESS, NO DSN IN VTOC   22640800
*                         INDEX WITH HIGHER OR HIGHER-OR-EQUAL KEY THAN 22683600
*                         THAT SUPPLIED.  FOR PHYSICAL SEQUENTIAL       22726400
*                         ACCESS, NO DSCB IN THE VTOC HAS A HIGHER      22769200
*                         ARGUMENT THAN THAT SUPPLIED. FOR A MULTIPLE   22812000
*                         DSCB REQUEST, THE LAST DSCB IN THE VTOC WAS   22854800
*                         READ AND MORE DSCBS WERE REQUESTED.    @L5C*/ 22897600
*STAT033 CONSTANT(33),  /*EXTENTS KEYWORD OMITTED OR SUPPLIED NUMBER    22940400
*                         OF EXTENTS IS ZERO.                    @L5C*/ 22983200
*STAT034 CONSTANT(34)) FIXED(8); /*CVAFDSM ACCESS=RLSE:                 23026000
*                         FORMAT 0 DSCB ALREADY FREE (MAP=VTOC),        23070000
*                         OR VIER ALREADY UNALLOCATED (MAP=INDEX)       23120000
*                         OR VOLUME SPACE EXTENT ALREADY                23170000
*                         UNALLOCATED (MAP=VOLUME).                     23186600
*                         CVAFVSM ACCESS=RLSE:                          23203200
*                         VOLUME SPACE EXTENT ALREADY UNALLOCATED.      23219800
*                                                                @L5C*/ 23236400
*DCL (                                                                  23253000
*STAT042 CONSTANT(42),  /*VRF DATA SUPPLIED FOR WRITE TOO LONG.*/       23270000
*STAT043 CONSTANT(43),  /*BUFFER LIST IS FOR VTOC INDEX VIRS            23320000
*                         BUT A DSCB BUFFER LIST WAS                    23370000
*                         REQUIRED (OS VTOC ACCESSED. CVAFSEQ CALL).*/  23420000
*STAT044 CONSTANT(44),  /*NO BUFFER LIST ENTRY FOUND.*/                 23470000
*STAT045 CONSTANT(45),  /*INVALID DSCB BUFFER LENGTH                    23520000
*                         (NEITHER 96 NOR 140) IN BUFFER                23570000
*                         LIST ENTRY, OR VIR BUFFER                     23620000
*                         LENGTH NOT EQUAL TO VIB VIR SIZE.*/           23670000
*STAT046 CONSTANT(46),  /*NEITHER TTR NOR CCHHR BITS SET                23720000
*                         IN BUFFER LIST ENTRY FOR A 140 BYTE           23770000
*                         DSCB READ OR WRITE REQUEST.           @L3C*/  23820000
*STAT047 CONSTANT(47),  /*MORE THAN ONE OF THE TTR,                     23870000
*                         CCHHR, AND RBA BITS SET IN                    23920000
*                         THE BUFFER LIST ENTRY.*/                      23970000
*STAT048 CONSTANT(48),  /*BOTH THE DSCB AND VIR BITS                    24020000
*                         SET IN THE BUFFER LIST HEADER.*/              24070000
*STAT049 CONSTANT(49),  /*RBA BIT SET IN A BUFFER LIST                  24120000
*                         ENTRY FOR A DSCB BUFFER LIST.*/               24170000
*STAT050 CONSTANT(50),  /*TTR OR CCHHR BIT SET                          24220000
*                         IN BUFFER LIST ENTRY BUT BUFFER               24270000
*                         LIST HEADER INDICATES VIR BUFFER LIST.*/      24320000
*STAT052 CONSTANT(52),  /*COMBINATION OF MAP AND COUNT NOT SUPPORTED.*/ 24370000
*STAT053 CONSTANT(53),  /*MAP OMITTED OR WAS MULTIPLY SPECIFIED  @L5C*/ 24420000
*STAT054 CONSTANT(54),  /*VIR BUFFER LIST CHAINED TO                    24470000
*                         OR FROM A DSCB BUFFER LIST.*/                 24520000
*STAT055 CONSTANT(55),  /*UNAUTHORIZED CALLER AND VIB                   24570000
*                         NOT INITIALIZED.*/                            24620000
*STAT056 CONSTANT(56),  /*MAPRCDS=YES NOT SPECIFIED BUT REQUIRED.*/     24670000
*STAT057 CONSTANT(57),  /*DSCB BUFFER LIST SUPPLIED BUT                 24720000
*                         VIR BUFFER LIST REQUIRED (IN                  24770000
*                         MAPRCDS OR IXRCDS BUFFER LIST                 24820000
*                         ADDRESS IN CVAF PARAMETER LIST).*/            24870000
*STAT058 CONSTANT(58),  /*NEITHER VIR NOR DSCB BIT SET                  24920000
*                         IN BUFFER LIST HEADER.*/                      24970000
*STAT060 CONSTANT(60),  /*INVALID OR CONFLICTING SETTING OF             24973400
*                         ALLOCATE OPTION BYTE IN SPACE PARAMETER@L3C*/ 24976800
*STAT061 CONSTANT(61),  /*FILTER CRITERIA LIST OMITTED,                 24980200
*                         OR ID NOT 'FCL '.                      @L3A*/ 24983600
*STAT062 CONSTANT(62),  /*FCLCOUNT IS ZERO OR                           24987000
                          NO ELEMENTS TO PROCESS.                @L3A*/ 24990400
*STAT063 CONSTANT(63),  /*GENERIC ACCESS WITH MORE THAN                 24993800
*                         ONE PARTIALLY QUALIFIED DATA SET NAME. @L3A*/ 24997200
*STAT064 CONSTANT(64),  /*RESUME RECOMMENDED.                    @L3A*/ 25000600
*STAT065 CONSTANT(65),  /*BUFFER LENGTH NOT 140, OR ANOTHER             25004000
*                         BUFFER LIST ENTRY ERROR.               @L3A*/ 25007400
*STAT066 CONSTANT(66),  /*RESUME ACCESS WITH FSA ADDRESS OF ZERO        25010800
*                         OR FSA IS NOT IN CVAF KEY.             @L3A*/ 25014200
*STAT067 CONSTANT(67),  /*INVALID PARTIALLY QUALIFIED                   25017600
*                         DATA SET NAME FOR GENERIC ACCESS.      @L3A*/ 25021000
*STAT068 CONSTANT(68),  /*FCL NOT IN USER KEY.                   @L3A*/ 25024400
*STAT069 CONSTANT(69),  /*INTERNAL GETMAIN ERROR.                @L3A*/ 25027800
*STAT070 CONSTANT(70),  /*DIRECT PATH I/O ERROR.                 @L3A*/ 25031200
*STAT071 CONSTANT(71),  /*SEQUENTIAL PATH I/O ERROR.             @L3A*/ 25034600
*STAT072 CONSTANT(72),  /*ANOMALY PRESENT, NO RESUME                    25038000
*                         RECOMMENDED.                           @L3A*/ 25041400
*STAT073 CONSTANT(73),  /*ANOMALY PRESENT, RESUME                       25044800
*                         RECOMMENDED.                           @L3A*/ 25048200
*STAT074 CONSTANT(74),  /*FCLDSNLG IS EITHER 0 OR IS GREATER THAN       25051600
*                         44, OR (FCLDSNA IS 0 OR NOT IN USER           25055000
*                         KEY)                                   @L5C*/ 25058400
*STAT075 CONSTANT(75),  /*EXTENT IS BEYOND 64*1024 TRACKS BOUNDARY.     25061800
*                         FOR CVAFDSM ACCESS=MAPDATA MAP=VOLUME:        25065200
*                         THE FREE EXTENTS UP TO 64*1024 TRACKS         25068600
*                         BOUNDARY IF ANY, ARE RETURNED IN THE EXTENT   25072000
*                         TABLE OF XXYYZ FORMAT. SUGGEST CALLER TO      25075400
*                         SPECIFY RTA4BYTE=YES AND USE EXTENT TABLE     25078800
*                         MAPPED BY ICVEDT02.                    @05C*/ 25082200
*STAT076 CONSTANT(76),  /*VTOC STATUS FROM F4 DSCB DOES NOT MATCH WHAT  25085600
*                         INDICATED IN CVPL FLAG CV1IVT          @L5A*/ 25089000
*STAT077 CONSTANT(77),  /*ID OF F5 DSCB OR F7 DSCB IS INCORRECT  @L5A*/ 25092400
*STAT078 CONSTANT(78),  /*ID OF EXTENT TABLE IS INCORRECT        @L5A*/ 25095800
*STAT079 CONSTANT(79),  /*ID OF SPACE TABLE IS INCORRECT         @L5A*/ 25099200
*STAT080 CONSTANT(80),  /*RTA4BYTE=YES WAS NOT SPECIFIED FOR CVAFDSM    25102600
*                         ACCESS = MAPDATA MAP = VOLUME FOR AN OS       25106000
*                         VTOC VOLUME                            @05C*/ 25109400
*STAT081 CONSTANT(81)) FIXED(8); /*RESERVED                      @L5A*/ 25112800
*                                                                       25116200
*DCL (                                                                  25120000
*STAT127 CONSTANT(127), /*I/O ERROR OCCURRED.*/                         25136600
*STAT128 CONSTANT(128), /*RESERVED.*/                                   25153200
*STAT129 CONSTANT(129), /*THE FIRST HIGH LEVEL VIER                     25170000
*                         AS INDICATED IN THE VIXM                      25220000
*                         DOES NOT HAVE THE FLAG BIT SET INDICATING     25270000
*                         IT IS THE FIRST HIGH LEVEL VIER.*/            25320000
*STAT130 CONSTANT(130), /*HORIZONTAL OR VERTICAL VIER                   25370000
*                         POINTER IS OUTSIDE VTOC INDEX                 25420000
*                         RBA RANGE.*/                                  25470000
*STAT131 CONSTANT(131), /*VERTICAL VIER POINTER                         25520000
*                         POINTS TO A VIR WHICH IS NOT                  25570000
*                         A VIER (INVALID ID IN HEADER).*/              25620000
*STAT132 CONSTANT(132), /*LEVEL N VERTICAL INDEX ENTRY                  25670000
*                         POINTER POINTS TO VIER WHICH IS               25720000
*                         NOT AT LEVEL N-1.*/                           25770000
*STAT133 CONSTANT(133), /*LEVEL N HORIZONTAL INDEX ENTRY                25820000
*                         POINTER POINTS TO VIER                        25870000
*                         WHICH IS NOT AT LEVEL N.*/                    25920000
*STAT134 CONSTANT(134), /*HORIZONTAL VIER/MAP POINTER                   25970000
*                         POINTS TO A VIR WHICH IS NOT                  26020000
*                         A VIER/MAP (INVALID ID IN HEADER).*/          26070000
*STAT135 CONSTANT(135), /*HORIZONTAL MAP POINTER                        26120000
*                         POINTS TO VIR WHICH IS NOT ONE OF THE         26170000
*                         FIRST N VTOC INDEX RECORDS                    26220000
*                         (N IS RECORDED IN VIXM FIELD VIMRCDS)         26270000
*                         OR THE FIRST RECORD IN THE                    26320000
*                         VTOC INDEX IS NOT A VIXM.*/                   26370000
*STAT136 CONSTANT(136), /*LEVEL 1 INDEX ENTRY CONTAINS                  26420000
*                         A CCHHR POINTER WHICH IS OUTSIDE              26470000
*                         THE VTOC EXTENT.*/                            26520000
*STAT137 CONSTANT(137), /*THE FIRST HIGH LEVEL VIER,                    26570000
*                         AS INDICATED IN THE VIB                       26620000
*                         DOES NOT HAVE THE FLAG BIT                    26670000
*                         SET INDICATING IT IS THE FIRST HIGH           26720000
*                         LEVEL VIER. (THIS ERROR IS                    26770000
*                         EITHER RECOVERED FROM BY UPDATING             26820000
*                         THE VIB FROM THE VIXM,                        26870000
*                         OR THE ERROR IS CHANGED TO 129).*/            26920000
*STAT138 CONSTANT(138), /*THE RBA OF THE VTOC INDEX VIR                 26970000
*                         DOES NOT MATCH THE RBA RECORDED               27020000
*                         IN THE HEADER OF THE RECORD.*/                27070000
*STAT139 CONSTANT(139)) FIXED(8); /* THE FIRST RECORD OF A MAP          27120000
*                         (VIXM, VPSM, OR VMDS) IS NOT ONE OF           27170000
*                         THE FIRST N VTOC INDEX RECORDS (N IS          27220000
*                         RECORDED IN THE VIXM FIELD, VIMRCDS).@P2C*/   27253300
*DCL (                                                        /*@P2A*/  27286600
*STAT140 CONSTANT(140), /*DATA SET NAME IN LEVEL                        27320000
*                         N+1 VIER ENTRY IS LOWER THAN THE              27370000
*                         HIGH KEY OF THE LEVEL N VIER WHICH THE        27420000
*                         LEVEL N+1 VIER ENTRY POINTS TO.*/             27470000
*STAT141 CONSTANT(141), /*FIRST HIGH LEVEL VIER                         27520000
*                         STRUCTURE ERROR BIT ON.*/                     27570000
*STAT142 CONSTANT(142), /*I/O ERROR INDICATING                          27620000
*                         THE VTOC INDEX IS NOT FORMATTED               27670000
*                         CORRECTLY.*/                                  27720000
*STAT143 CONSTANT(143), /*EITHER INDEX BIT ZERO OR DOS BIT ZERO         27770000
*                         IN FORMAT 4 DSCB OF VTOC PREVIOUSLY           27820000
*                         FOUND TO BE AN INDEXED VTOC.*/                27870000
*STAT144 CONSTANT(144), /*NO SYS1.VTOCIX.NNN DATA SET NAME              27920000
*                         IN VTOC WHOSE FORMAT 4 DSCB                   27970000
*                         HAS THE INDEX BIT ON.*/                       28020000
*STAT145 CONSTANT(145), /*DATA SET NAME IN LEVEL N+1                    28070000
*                         VIER ENTRY IS HIGHER THAN THE                 28120000
*                         HIGH KEY OF THE LEVEL N VIER WHICH THE        28170000
*                         LEVEL N+1 VIER ENTRY POINTS TO.*/             28220000
*STAT146 CONSTANT(146), /*FOUR OR MORE HIGH LEVEL                       28270000
*                         VIERS WERE ENCOUNTERED.*/                     28320000
*STAT147 CONSTANT(147), /*TOO MANY LEVELS IN THE VTOC INDEX. THE        28370000
*                         SEARCH LIST LENGTH (DEFINED IN STATIC         28420000
*                         TEXT MODULE, ICVIXST0) WAS EXCEEDED.*/        28470000
*STAT148 CONSTANT(148), /*VIER INVALID. OFFSET                          28520000
*                         TO LAST SECTION INVALID.*/                    28570000
*STAT149 CONSTANT(149), /*VIER INVALID. OFFSET                          28620000
*                         TO LAST ENTRY IN A SECTION INVALID.*/         28670000
*STAT150 CONSTANT(150), /*MEDIA MANAGER INITIALIZATION                  28720000
*                         FAILED */                                     28770000
*STAT151 CONSTANT(151), /*LEVEL 2 OR HIGHER VIER                        28820000
*                         CONTAINS LESS THAN TWO ENTRIES.*/             28870000
*STAT152 CONSTANT(152), /*RECOVER=YES SPECIFIED                         28920000
*                         BUT THE STATIC TEXT MODULE (ICVIXST0)         28970000
*                         INDICATES RECOVERY IS NOT PERMITTED.*/        29020000
*STAT153 CONSTANT(153), /*THE FORMAT 4 DSCB IS WRITTEN                  29070000
*                         WITH EITHER THE INDEX OR DOS BIT              29120000
*                         BIT ZEROED ON AN INDEXED VTOC.*/              29170000
*STAT154 CONSTANT(154), /*A SPACE MAP EXTENDS OVER                      29220000
*                         MORE THAN 20 VTOC INDEX RECORDS.       @L5C*/ 29270000
*STAT155 CONSTANT(155), /*DSN NOT FOUND IN SECTION WITH KEY             29320000
*                         GREATER THAN OR EQUAL TO THE DSN              29370000
*                         BEING SEARCHED. INVALID SECTION IN VIER.*/    29420000
*STAT156 CONSTANT(156), /*INVALID VIER HORIZONTAL POINTER.              29470000
*                         HORIZONTAL POINTER IN VIER1 POINTS TO         29520000
*                         VIER2 WHOSE HIGH KEY IS LOWER THAN OR EQUAL   29570000
*                         TO THE HIGH KEY OF VIER1.*/                   29620000
*STAT157 CONSTANT(157),  /*COULD NOT FIND ENTRY IN LEVEL 2              29670000
*                         OR HIGHER VIER THAT MATCHES THE               29720000
*                         HIGH KEY OF THE VIER.*/                       29770000
*STAT158 CONSTANT(158),  /*INVALID SECTION LENGTH OR INVALID            29820000
*                         NUMBER OF SECTIONS IN VIER HEADER */          29870000
*STAT159 CONSTANT(159),  /*THE FIRST HIGH LEVEL VIR POINTED             29885000
*                      TO BY THE VIB HAS AN INVALID ID IN HEADER @02C*/ 29900000
*STAT160 CONSTANT(160),  /* INVALID FORMAT-4 DETECTED            @02A*/ 29915000
*STAT161 CONSTANT(161),  /* INVALID FORMAT-4 DETECTED            @02A*/ 29930000
*STAT162 CONSTANT(162),  /* INVALID FORMAT-4 DETECTED            @02A*/ 29945000
*STAT163 CONSTANT(163),  /* INVALID FORMAT-4 DETECTED            @02A*/ 29960000
*STAT164 CONSTANT(164),  /* INVALID FOMRAT-4 DETECTED            @02A*/ 29975000
*STAT165 CONSTANT(165),  /* INVALID FORMAT-4 DETECTED            @02A*/ 29990000
*STAT166 CONSTANT(166)) FIXED(8); /* INVALID FORMAT-4 DETECTED   @02A*/ 30005000
*/********************************************************************/ 30020000
