*%GOTO   FCLPLS;       /* FILTER CRITERIA LIST MAPPING MACRO            00050000
         MACRO                                                          00100000
&LABEL   ICVFCL &DSECT=YES                                              00150000
.** START OF SPECIFICATIONS ******************************************* 00200000
.*                                                                    * 00250000
.* MODULE-NAME = ICVFCL                                               * 00300000
.*$MAC(ICVFCL) COMP(DM1CV):  FILTER CRITERIA LIST MAPPING MACRO       * 00350000
.*                                                                    * 00400000
.* DESCRIPTIVE-NAME = FILTER CRITERIA LIST MAPPING MACRO              * 00450000
.*                                                                    * 00500000
.*PROPRIETARY V3 STATEMENT                                              00531200
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00562400
.*"RESTRICTED MATERIALS OF IBM"                                         00593600
.*5695-DF1                                                              00624800
.*(C) COPYRIGHT 1986,1988  IBM CORP.                                    00656000
.*END PROPRIETARY V3 STATEMENT                                          00703000
.*                                                                    * 00750000
.*$STATUS = MVS/XA DFP 3.1.0                                          * 00800000
.*                                                                    * 00850000
.* FUNCTION = THIS MACRO MAPS THE FILTER CRITERIA LIST                * 00900000
.*                                                                    * 00950000
.*            THE MACRO GENERATES TWO DSECTS; ONE FOR THE CVAF    @02A* 00960000
.*            FILTER CRITERIA LIST AND ONE FOR THE DATA SET NAME  @02A* 00970000
.*            ELEMENT.                                            @02A* 00980000
.*                                                                    * 00990000
.*            IF THE KEYWORD DSECT=NO IS CODED, NO DSECT STATEMENT    * 01000000
.*            WILL BE GENERATED FOR THE CVAF FILTER CRITERIA      @02A* 01025000
.*            LIST. A DSECT STATEMENT IS ALWAYS GENERATED FOR THE @02A* 01050000
.*            DSN ELEMENT.                                        @02A* 01075000
.*            IF THE KEYWORD DSECT=YES IS CODED, OR OMITTED, TWO  @02C* 01100000
.*            DSECT STATEMENTS WILL BE GENERATED.                 @02C* 01125000
.*                                                                    * 01150000
.* NOTES = NONE                                                       * 01200000
.*                                                                    * 01250000
.* PATCH-LABEL = NOT APPLICABLE                                       * 01300000
.*                                                                    * 01350000
.* MODULE-TYPE = MACRO                                                * 01400000
.*                                                                    * 01450000
.*    PROCESSOR = PLS OR BAL                                          * 01500000
.*                                                                    * 01550000
.*    ATTRIBUTES = MAPPING MACRO                                      * 01600000
.*                                                                    * 01650000
.* ENTRY-POINT = ICVCCB                                               * 01700000
.*                                                                    * 01750000
.*    PURPOSE = SEE FUNCTION ABOVE.                                   * 01800000
.*                                                                    * 01850000
.*    LINKAGE = PLS -  INCLUDE ICVFCL                                 * 01900000
.*                     A PLS MACRO VARIABLE, FCLPRM, MAY BE SET       * 01950000
.*                     TO 'YES'. IF SO, THE VARIABLE, FCL, WILL       * 02000000
.*                     NOT BE DECLARED BASED.                         * 02050000
.*                                                                    * 02100000
.*              BAL -  LABEL ICVFCL DSECT=NO | DSECT=YES              * 02150000
.*                                                                    * 02200000
.*    INPUT   = DSECT=NO IS REQUIRED IF DSECT STATEMENT IS NOT    @02C* 02233300
.*              DESIRED FOR THE CVAF FILTER CRITERIA LIST.        @02A* 02266600
.*                                                                    * 02300000
.*    OUTPUT = FILTER CRITERIA LIST EXPANSION                         * 02350000
.*                                                                    * 02400000
.* EXIT-NORMAL = MEND STATEMENT                                       * 02450000
.*                                                                    * 02500000
.* EXIT-ERROR = AN MNOTE WILL BE GENERATED IF ANY OTHER KEYWORD IS    * 02550000
.*              PRESENT FOR BAL.                                      * 02600000
.*                                                                    * 02650000
.* EXTERNAL-REFERENCES = N/A                                          * 02700000
.*                                                                    * 02750000
.* TABLES = NONE                                                      * 02800000
.*                                                                    * 02850000
.* MACROS = NONE                                                      * 02900000
.*                                                                    * 02950000
.* CHANGE-ACTIVITY =                                                  * 02975000
.*$L0=FILT,JDP2220,,STL:            CVAF FILTER                    @L0A 03000000
.*$L1=F1ONLY,HDP3310,T86071,STLAM:  SUPPORT REQUESTS FOR F1 ONLY   @L1A 03025000
.*$01=OY14225,HDP2230,,NSDBVC: RESHIP OF MACRO                     @01A 03037500
.*$02=OY67266,HDZ11B0,,SJPLRLC: CLEAR UP COMMENTS ON DSECT STATMENT@02A 03043700
.*                                                                    * 03050000
.*** END OF SPECIFICATIONS ******************************************** 03100000
         LCLC  &L                      DEFINE LOCAL CHAR VARIABLE       03150000
&L       SETC  'ICVFCL'                                                 03200000
         AIF   ('&LABEL' EQ '').CDSECT                                  03250000
&L       SETC  '&LABEL'                                                 03300000
.CDSECT  ANOP                                                           03350000
         SPACE 1                                                        03400000
*********************************************************************** 03450000
*        FILTER CRITERIA LIST                                           03500000
*********************************************************************** 03550000
         SPACE 1                                                        03600000
         AIF   ('&DSECT' EQ 'NO').NDSECT1                               03650000
         AIF   ('&DSECT' EQ 'YES').DSECT1                               03700000
         MNOTE 12,'***  IHB001 INVALID OPERAND - DSECT=&DSECT'          03750000
         AGO   .FINISH                                                  03800000
.DSECT1  ANOP                                                           03850000
&L       DSECT                         CVAF FILTER CRITERIA LIST        03900000
         AGO   .FCL1                                                    03950000
.NDSECT1 ANOP                                                           04000000
&L       DS    0F                                                       04050000
.FCL1    ANOP                                                           04100000
FCLID    DS    CL4                     EYE CATCHER 'FCL '               04121200
FCLCOUNT DS    H                       NUMBER OF DSN.S IN LIST          04142400
FCLDSCBR DS    H                       NUMBER OF DSCB.S RETURNED        04163600
FCL1FLAG DS    X                       REQUEST FLAG BYTE                04184800
FCL1LIST EQU   X'80'                   LIST CONTAINS FULLY QUALIFIED    04206000
*                                      DATA SET NAMES                   04227200
FCL1ORDR EQU   X'40'                   CALLER REQUESTS FCL ORDER        04248400
FCL1EQF1 EQU   X'20'                   RETURN FORMAT 1 DSCBS ONLY  @L1A 04259000
FCL2FLAG DS    X                       STATUS FLAG BYTE                 04269600
FCL2SEQ  EQU   X'80'                   SEQUENTIAL VTOC ACCESS SELECTED  04290800
FCL2SDIR EQU   X'40'                   SEQUENTIAL VTOC ACCESS REQUIRED  04312000
*                                      AT LEAST ONE DIRECT DSCB READ    04333200
FCLDRSV  DS    XL6                     RESERVED                         04354400
FCLHDEND EQU   *                       DSN ENTRIES DIRECTLY FOLLOW      04375600
FCLHDLEN EQU   *-FCLID                 LENGTH OF FCL HEADER             04396800
*                                                                       04418000
         DSECT                         MAP OF EACH DSN ELEMENT          04439200
FCLDSN   DS    CL8                     DATA SET NAME INFORMATION        04460400
         ORG   FCLDSN                                                   04481600
FCLDSNST DS    X                       STATUS OF THIS DATA SET NAME     04502800
FCLST00  EQU   X'00'                   DSN REMAINS TO BE PROCESSED      04524000
FCLST01  EQU   X'01'                   DSCB(S) HAVE BEEN RETURNED       04545200
* FOR FCLST02 THROUGH FCLST05 -- CVAFFILT WILL NOT RETURN ANY           04566400
* DSCB(S) FOR THE ASSOCIATED DSN ------------------                     04587600
FCLST02  EQU   X'02'                   DSN NOT FOUND                    04608800
FCLST03  EQU   X'03'                   ANOMALY FOUND IN DSCB(S)         04630000
FCLST04  EQU   X'04'                   ANOMALY FOUND IN CVAFFILT        04651200
FCLST05  EQU   X'05'                   NUMBER OF DSCBS FOR THIS DSN     04672400
*                                      IS GREATER THAN THE TOTAL        04693600
*                                      NUMBER OF BFLE PROVIDED          04714800
*                                                                       04736000
FCLDSNLG DS    X                       DATA SET NAME LENGTH             04757200
FCL3FLAG DS    X                       FLAG BYTE                        04778400
FCL3UPDT EQU   X'80'                   THIS ELEMENT WAS PROCESSED       04799600
*                                      BY THIS INVOCATION               04820800
FCLDSNRV DS    X                       RESERVED                         04842000
FCLDSNA  DS    F                       DATA SET NAME ADDRESS            04863200
FCLDSNEL EQU   *-FCLDSN                LENGTH OF DSN INFO ENTRY         04884400
.FINISH  MEND                                                           04905600
********************************************************************/   04926800
*%FCLPLS:;                                                              04950000
*                                                                       05000000
*/******************************************************************/   05050000
*/*      FILTER CRITERIA LIST                                      */   05100000
*/******************************************************************/   05150000
*                                                                       05200000
*DCL 1 FCL                                                              05250000
*%IF FCLPRM='YES' %THEN %GOTO FCLLBL;                                   05300000
*           BASED(FCLPTR)                                               05350000
*%FCLLBL:;                                                              05400000
*               BDY(WORD),    /* FILTER CRITERIA LIST              */   05450000
*      2 FCLID    CHAR(4),    /* EYE CATCHER 'FCL '                */   05500000
*      2 FCLCOUNT FIXED(15),  /* NUMBER OF DATA SET NAMES SUPPLIED      05550000
*                                IN THE LIST                       */   05600000
*      2 FCLDSCBR FIXED(15),  /* NUM OF DSCBS RETURNED TO CALLER   */   05650000
*      2 FCL1FLAG BIT(8),     /* REQUEST FLAG BYTE                 */   05660400
*        3 FCL1LIST BIT(1),   /* LIST CONTAINS FULLY QUALIFIED          05670800
*                                DATA SET NAMES                    */   05678700
*        3 FCL1ORDR BIT(1),   /* CALLER REQUESTS FCL ORDER         */   05686600
*        3 FCL1EQF1 BIT(1),   /* RETURN FORMAT 1 DSCBS ONLY    @L1A*/   05691800
*        3 *        BIT(5),   /* RESERVED                      @L1C*/   05697000
*      2 FCL2FLAG BIT(8),     /* STATUS FLAG BYTE                  */   05702400
*        3 FCL2SEQ  BIT(1),   /* SEQUENTIAL VTOC ACCESS SELECTED   */   05710300
*        3 FCL2SDIR BIT(1),   /* SEQUENTIAL VTOC ACCESS REQUIRED        05718200
*                                AT LEAST ONE DIRECT DSCB READ     */   05726100
*        3 *        BIT(6),   /* RESERVED                          */   05734000
*      2 FCLDRSV   CHAR(6),   /* RESERVED                          */   05741900
*      2 FCLDSN(*) CHAR(8)                                              05749900
*                   BDY(WORD),/* DATA SET NAME INFO. ENTRY         */   05766600
*        3 FCLDSNST FIXED(8), /* STATUS OF THIS DATA SET NAME           05783300
*                                  (SEE VALUES BELOW)              */   05829600
*        3 FCLDSNLG FIXED(8), /* DATA SET NAME LENGTH              */   05875900
*        3 FCL3FLAG BIT(8),   /* FLAG BYTE                         */   05922200
*          4 FCL3UPDT BIT(1), /* THIS ELEMENT WAS PROCESSED             05968500
*                                BY THIS INVOCATION.               */   06014800
*          4 *        BIT(7), /* RESERVED                          */   06061100
*        3 FCLDSNRV CHAR(1),  /* RESERVED                          */   06107400
*        3 FCLDSNA  PTR(31);  /* DATA SET NAME ADDRESS             */   06153700
*                                                                       06200000
*/******************************************************************/   06250000
*/*              STRUCTURE FOR DSECT OF FCLDSN                     */   06300000
*/******************************************************************/   06350000
*                                                                       06400000
*DCL 1 FCEDSN BASED BDY(WORD),/* REMAP OF FCLDSN                   */   06450000
*      2 FCEDSNST FIXED(8),   /* STATUS OF THIS DATA SET NAME           06500000
*                                  (SEE VALUES BELOW)              */   06550000
*      2 FCEDSNLG FIXED(8),   /* DATA SET NAME LENGTH              */   06600000
*      2 FCE3FLAG BIT(8),     /* FLAG BYTE                         */   06650000
*        3 FCE3UPDT BIT(1),   /* THIS ELEMENT WAS PROCESSED             06700000
*                                BY THIS INVOCATION.               */   06750000
*        3 *        BIT(7),   /* RESERVED                          */   06800000
*      2 FCEDSNRV CHAR(1),    /* RESERVED                          */   06850000
*      2 FCEDSNA  PTR(31);    /* DATA SET NAME ADDRESS             */   06900000
*                                                                       06950000
*/******************************************************************/   07000000
*/*              VALUES OF FCLDSNST                                */   07050000
*/******************************************************************/   07100000
*                                                                       07150000
*DCL (                                                                  07200000
*FCLST00 CONSTANT(0),           /* DSN REMAINS TO BE PROCESSED     */   07227200
*FCLST01 CONSTANT(1),           /* DSCB(S) HAVE BEEN RETURNED      */   07254400
*/* FOR FCLST02 THROUGH FCLST05 -- CVAFFILT WILL NOT RETURN ANY    */   07281600
*/* DSCB(S) FOR THE ASSOCIATED DSN ------------------              */   07308800
*FCLST02 CONSTANT(2),           /* DSN NOT FOUND                   */   07336000
*FCLST03 CONSTANT(3),           /* ANOMALY FOUND IN DSCB(S)        */   07363200
*FCLST04 CONSTANT(4),           /* ANOMALY FOUND IN CVAFFILT       */   07390400
*FCLST05 CONSTANT(5)) FIXED(8); /* NUMBER OF DSCBS FOR THIS DSN         07417600
*                                      IS GREATER THAN THE TOTAL        07444800
*                                      NUMBER OF BFLE PROVIDED     */   07472000
*/******************************************************************/   07500000
