* %GOTO  PACPLS1;                  /* GOTO THE PLS VERSION.         */  00033300
* /*                                                                    00066600
         MACRO                                                          00100000
         IDAXVIM &FUNC=MAP,                                            X00116600
               &ENTRYD=YES,&HDRD=YES,&CLEAR=YES,                       X00133200
               &HL=,&XVIE=,&AREA=,&RPL=,&AREALTH=,&AREAUSE=,&ACB=,     X00149800
               &ECODE=,&EITEM=,&ELTH=,&EEOL=,&TCB=,                @LNCX00166400
               &MF=                                                     00183000
         GBLB  &PACD                                                    00200000
         LCLA  &DISP                                                    00250000
         AIF   (N'&SYSLIST EQ 0).AOK   TEST FOR POSITIONAL PARAMETERS   00350000
         MNOTE 4,'XVIM150 - UNIDENTIFIED POSITIONAL PARAMETERS EXIST'   00400000
.AOK     ANOP                                                           00500000
         AIF   ('&MF' EQ '').AOK11                                      00504000
.**   SEE IF BUILD MF=B IS SPECIFIED                 **                 00508000
         AIF   ('&MF'(1,1) EQ 'B').MFBCALL                              00512000
         AIF   ('&MF'(1,3) EQ '(B,').MFB1                               00516000
     MNOTE 8,'MF=&MF(1) UNSUPPORTED.'                                   00520000
         MEXIT                                                          00524000
.*                                                                      00528000
.MFB1    ANOP                                                           00532000
         AIF   (N'&MF EQ 2).MFOK                                        00536000
     MNOTE 8,'MF=&MF(1) DOES NOT HAVE TWO ARGUMENTS.'                   00540000
         MEXIT                                                          00544000
.*                                                                      00548000
.MFOK    ANOP                                                           00552000
.**    HANDLE MF=B 2ND ARGUMENT                                         00556000
         AIF   ('&MF'(2,1) EQ '(').MF100                                00560000
         LA    R1,&MF(2)       ADDRESS OF HEADER                        00564000
         AGO   .MFBCALL                                                 00568000
.MF100   ANOP                                                           00572000
         LR    R1,&MF(2)                                                00576000
         AGO   .MFBCALL                                                 00580000
.*                                                                      00584000
.*                                                                      00588000
.AOK11   ANOP                                                           00592000
         AIF   ('&FUNC' EQ 'CALLXVI').PRECALL                           00596000
         AIF   ('&FUNC' EQ 'MRKBFR').CALLXVI                            00600000
         AIF   ('&FUNC' EQ 'DUMP').CALLXVI                              00650000
         AIF   ('&FUNC' EQ 'BSPHSRB').CALLXVI                           00700000
         AIF   ('&FUNC' EQ 'PLHSTK1').CALLXVI                           00775000
         AIF   ('&FUNC' EQ 'MAP').DSECT                                 00800000
         AIF   ('&FUNC' EQ 'ENTRY').SETENT                              00805000
         AIF   (K'&FUNC LT 3).UNKF1                                     00810000
         AIF   (K'&FUNC GT 4).UNKF1                                     00820000
         AIF   ('&FUNC'(1,2) EQ 'FR').CALLXVI                           00830000
.UNKF1   ANOP                                                           00840000
         MNOTE 8,'XVIM151 - UNIDENTIFIED FUNCTION'                      00850000
         MEXIT                                                          00925000
.*                                                                      00937500
.DSECT   ANOP                                                           00950000
         AIF   ((&PACD)).ENDMAC    ONLY ONE MAP ALLOWED                 00966600
&PACD    SETB  1                                                        00983200
*                                                                   */  01000000
*%PACPLS1: ;                                                            01050000
*/********************************************************************/ 01100000
*/*                                                                  */ 01150000
*/*      EXTENDED VSAM INTERFACE (XVI)   CONTROL BLOCK               */ 01200000
*/*                                                                  */ 01250000
*/********************************************************************/ 01300000
*/*  $MAC(IDAXVIM) COMP(SC1DE):                                      */ 01325000
*/*                                                                  */ 01350000
*/*PROPRIETARY V3 STATEMENT                                          */ 01353800
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 01357600
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 01361400
*/*5695-DF1                                                          */ 01365200
*/*(C) COPYRIGHT 1987,1989  IBM CORP.                                */ 01369000
*/*END PROPRIETARY V3 STATEMENT                                      */ 01375000
*/*                                                                  */ 01381000
*/*  STATUS  MVS/XA  DFP RELEASE 3.3.0                               */ 01387200
*/*                                                                  */ 01393400
*/*      MACRO NAME: IDAXVIM                                         */ 01400000
*/*                      -CONTROL BLOCKS                             */ 01450000
*/*                      -INVOCATION OF SERVICE                      */ 01500000
*/*                                                                  */ 01550000
*/*      MACRO CONTROL: THE GLOBAL &PACD WILL BE SET TO ONLY ALLOW   */ 01600000
*/*                     ONE GENERATION PER MODULE.                   */ 01650000
*/*                                                                  */ 01700000
*/*                     ALL LABELS ARE PREFIXED WITH 'XVI'.          */ 01750000
*/*                                                                  */ 01800000
*/*      PURPOSE: DEFINE THE EXTENDED VSAM INTERFACE CB'S,           */ 01850000
*/*               MAP EACH SUPPORTED FUNCTION'S REQUIREMENTS,        */ 01900000
*/*               NAVIGATE TO THE VSAM PROCESSING ROUTINE.           */ 01950000
*/*                                                                  */ 02000000
*/*      DSECT NAME: IDAXVIH, IDAXVIE                                */ 02050000
*/*                                                                  */ 02100000
*/*      CONTROL BLOCK NAME: IDAXVIH, IDAXVIE                        */ 02150000
*/*                                                                  */ 02200000
*/*      LOCATION: PRIVATE STORAGE, USER KEY                         */ 02250000
*/*                                                                  */ 02300000
*/*      OBTAINED/FORMATTED BY: USER                                 */ 02350000
*/*                                                                  */ 02400000
*/*      $LN=OY26659,HDP3320,STLTLD: MVS/ESA DFP REL 3.2.0       @LNA*/ 02450000
*/*      $LO=OY41753,HDP3320,SJPLTLD: ADD FC0023-FC0027      @YA41753*/ 02500000
*/*                                                                  */ 02600000
*/*      FUNCTION CODES SUPPORTED:                                   */ 02650000
*/*      - '0001'X RETRIEVE A(AMDDUI)                                */ 02700000
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 02750000
*/*                                                                  */ 02900000
*/*        OUTPUT:                                                   */ 02950000
*/*               XVIEITEM = ADDRESS OF DUI VALUE                    */ 03000000
*/*        R/C:   0 - DUI ADDRESS SUCCESSFULLY RETRIEVED             */ 03050000
*/*                                                                  */ 03200000
*/*      - '0002'X TOGGLE DEFER WRITE MODE FOR COMPONENT             */ 03250000
*/*        INPUT: XVIHACB = ACB ADDRESS, BIT 0 ON IF KSDS ELSE ESDS. */ 03300000
*/*               CALLER IS IN KEY 0                                 */ 03350000
*/*        R/C:   0 - DEFER WRITE MODE WAS TOGGLED                   */ 03400000
*/*               8 - VSAM STRUCTURE WAS BROKEN                      */ 03450000
*/*                                                                  */ 03550000
*/*      - '0003'X GET NUMBER OF CI'S PER TRACK AND ALLOCATION UNIT  */ 03553100
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 03556200
*/*        OUTPUT:                                                   */ 03559300
*/*               XVIEITEM = CI(S) / ALLOCATION UNIT                 */ 03562400
*/*               XVIEITLN = CI(S) / TRACK                           */ 03565500
*/*        R/C:   0 - SUCCESSFULLY RETRIEVED                         */ 03568600
*/*                                                                  */ 03572000
*/*      - '0004'X UPDATE AMDDUI                                     */ 03577500
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 03583000
*/*               XVIEITEM = ADDRESS OF DUI VALUE                    */ 03588500
*/*                                                                  */ 03594000
*/*        OUTPUT:                                                   */ 03644000
*/*               XVIEITEM = ADDRESS OF DUI VALUE                    */ 03694000
*/*        R/C:   0 - DUI VALUE SUCCESSFULLY SET                     */ 03744000
*/*                                                                  */ 03950000
*/*      - '0007'X UPDATE ARDB HIGH USED RBA WITH GIVEN RBA AND VSI  */ 04000000
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 04050000
*/*               XVIEITEM = ADDRESS OF RBA VALUE                    */ 04100000
*/*        R/C:   0 - SUCCESSFULLY CHANGED                           */ 04150000
*/*          OUTPUT: REG 0 IS ZERO                                   */ 04200000
*/*        R/C:   NONZERO - CBUF R/C PROPAGATED FOR VSI CHANGE       */ 04250000
*/*          OUTPUT: REG 0 HAS OLD HIGH USED RBA                     */ 04300000
*/*                                                                  */ 04350000
*/*      - '0008'X GET SUBPOOL COUNT OF BUFFERS READ                 */ 04400000
*/*      - '0009'X GET SUBPOOL COUNT OF BUFFERS FOUND                */ 04450000
*/*      - '000A'X GET SUBPOOL COUNT OF USER INITIATED WRITES        */ 04500000
*/*      - '000B'X GET SUBPOOL COUNT OF VSAM INITIATED WRITES        */ 04550000
*/*        INPUT: XVIEITEM =                                         */ 04600000
*/*                  BYTE 0 - SHARE POOLID 0 THRU 15                 */ 04650000
*/*                  BYTE 1 - I|D FOR INDEX OF DATA COMPONENT        */ 04700000
*/*                  BYTE 2-3 - SUBPOOL BUFFER SIZE                  */ 04750000
*/*        R/C:   0 - SUCCESSFULLY RETRIEVED                         */ 04800000
*/*          OUTPUT: XVIEITEM = COUNTER VALUE                        */ 04850000
*/*        R/C:   8 - SPECIFIED DATA POOL DOES NOT EXIST             */ 04900000
*/*               9 - SPECIFIED INDEX POOL DOES NOT EXIST            */ 04950000
*/*                                                                  */ 05050000
*/*      - '000C'X LOCATE THE BUFC OWNED BY THE PLS PTD TO BY RPL    */ 05100000
*/*        INPUT: XVIHRPL = RPL ADDRESS                              */ 05150000
*/*        OUTPUT: XVIEITEM = BUFC ADDRESS                           */ 05200000
*/*        R/C:   0 SUCCESSFULLY RETRIEVED                           */ 05250000
*/*                                                                  */ 05300000
*/*      - '000D'X UPDATE HIGH USED RBA AND VSI TO LAST CI IN CA     */ 05350000
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 05400000
*/*        OUTPUT: XVIEITEM = RBA VALUE                              */ 05450000
*/*        R/C:   0 - SUCCESSFULLY CHANGED HIGH USED RBA             */ 05500000
*/*               NONZERO - CBUF R/C PROPAGATED FOR VSI CHANGE       */ 05550000
*/*                                                                  */ 05600000
*/*      - '000E'X GET VSI ADDRESS AND LENGTH FOR DATA COMPONENT     */ 05650000
*/*      - '000F'X GET VSI ADDRESS AND LENGTH FOR INDEX COMPONENT    */ 05700000
*/*        INPUT: XVIHACB = ADDRESS OF ACB                           */ 05750000
*/*        R/C:   0 - SUCCESSFULLY RETRIEVED VSI                     */ 05800000
*/*          OUTPUT: XVIEITEM = ADDRESS OF VSI | 0 IF NONE           */ 05850000
*/*                  XVIEITLN = LENGTH OF VSI | 0 IF NONE            */ 05900000
*/*        R/C:   8 - DATA SET HAS NO DATA COMPONENT                 */ 05950000
*/*                                                                  */ 06000000
*/*      - '0010'X TEST DATA COMPONENT FOR CREATE MODE STATUS        */ 06050000
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 06100000
*/*        OUTPUT: XVIEITEM = RBA VALUE                              */ 06150000
*/*        R/C:   0 - IN CREATE MODE                                 */ 06200000
*/*               4 - NOT IN CREATE MODE                             */ 06250000
*/*               8 - THE DATA SET HAS NOT DATA COMPONENT            */ 06300000
*/*                                                                  */ 06350000
*/*      - '0011'X GET CURRENT RECORD POINTER FROM PLH               */ 06400000
*/*        INPUT: XVIHRPL = RPL ADDRESS                              */ 06450000
*/*        OUTPUT: XVIEITEM = PLHRECP CONTENTS                       */ 06500000
*/*        R/C:   0 - SUCCESSFULLY RETRIEVED POINTER                 */ 06550000
*/*                                                                  */ 06650000
*/*      - '0013'X GET HIGH AND LOW CI RBN'S FOR ESDS RBA            */ 06700000
*/*        INPUT: XVIHACB = ACB ADDRESS                              */ 06750000
*/*               XVIEITEM = ADDRESS OF RBA VALUE                    */ 06800000
*/*        R/C:   0 - FOUND ESDS EXTENT THAT RBA BELONGS TO          */ 06850000
*/*          OUTPUT: XVIEITEM = HIGH CI RBN IN EXTENT                */ 06900000
*/*                  XVIECOD  = LOW CI RBN IN EXTENT                 */ 06950000
*/*        R/C:   4 - EXTENT FOR RBA NOT FOUND                       */ 07000000
*/*                                                                  */ 07100000
*/*      - '0017'X GET SUBPOOL COUNT OF HSP BUFFERS READ             */ 07132100
*/*      - '0018'X GET SUBPOOL COUNT OF HSP BUFFERS FOUND            */ 07164200
*/*      - '0019'X GET SUBPOOL COUNT OF HSP USER INITIATED WRITES    */ 07196300
*/*      - '001A'X GET SUBPOOL COUNT OF HSP VSAM INITIATED WRITES    */ 07228400
*/*      - '001B'X GET SUBPOOL COUNT OF BUFFERS              @YC41753*/ 07260500
*/*        INPUT: XVIEITEM =                                         */ 07292600
*/*                  BYTE 0 - SHARE POOLID 0 THRU 15                 */ 07324700
*/*                  BYTE 1 - I|D FOR INDEX OF DATA COMPONENT        */ 07356800
*/*                  BYTE 2-3 - SUBPOOL BUFFER SIZE                  */ 07388900
*/*        R/C:   0 - SUCCESSFULLY RETRIEVED                         */ 07421000
*/*          OUTPUT: XVIEITEM = COUNTER VALUE                        */ 07453100
*/*        R/C:   8 - DATA POOL SPECIFIED DOES NOT EXIST             */ 07485200
*/*               9 - INDEX POOL SPECIFIED DOES NOT EXIST            */ 07517300
*/*                                                                  */ 07550000
*/*      - '0101'X MRKBFRS INVALID WITH ZERO USECOUNT AND RETURN     */ 07600000
*/*                LIST OF BUFFERS WITH USECOUNT FOR AN ACB          */ 07650000
*/*        INPUT: XVIHACB = ADDRESS OF ACB                           */ 07700000
*/*               XVIHAREA = A(AREA FOR BUFC'S WITH USECOUNT LIST)   */ 07750000
*/*               XVIHARLN = LENGTH OF USER'S AREA                   */ 07800000
*/*        R/C:   0 - SUCCESSFULLY PROCESSED THE BUFFER SUBPOOL      */ 07850000
*/*          OUTPUT: XVIHARUS = LENGTH IN WORDS OF BUFC LIST         */ 07900000
*/*                  XVIHAREA = A(SET OF BUFC ADDRESSES WITH USECT)  */ 07950000
*/*        R/C:   8 - NO ROOM IN USER'S AREA                         */ 08000000
*/*              12 - VSAM STRUCTURE ERROR                           */ 08050000
*/*                                                                  */ 08150000
*/*      - '0102'X MRKBFRS AT CLOSE FOR AN ACB AND RETURN A LIST OF  */ 08154600
*/*                SUBPOOL TOKENS FOR WRITE ERROR BUFFERS.           */ 08159200
*/*      - '0104'X SPECIAL TERMINATION - DON'T CHECK FOR WRITE ERRORS*/ 08163800
*/*        INPUT: XVIHACB = ADDRESS OF ACB                           */ 08168400
*/*               XVIEITEM = ADDRESS OF RBA TO FIND BUFC WITH|0 - ALL*/ 08173000
*/*        R/C:   0 - SUCCESSFULLY PROCESS THE BUFFER SUBPOOL        */ 08177600
*/*          OUTPUT: XVIHARUS = WRITE ERROR COUNT FOR INDEX COMPONENT*/ 08182200
*/*                  XVIHARLN+XVIHARUS WRITE ERROR COUNT FOR DATA CMP*/ 08186800
*/*        R/C:  12 - VSAM STRUCTURE ERROR                           */ 08191400
*/*                                                                  */ 08196200
*/*      - '0103'X MRKBFR ALL BUFFERS THAT ARE NOT MODIFIED/LOCKED   */ 08246200
*/*                INVALID IN ALL SUBPOOLS FOR GIVEN RESOURCE POOLS. */ 08296200
*/*        INPUT: XVIEITEM = ADDRESS OF RESOURCE POOL LIST:          */ 08346200
*/*                 - BYTE 0 - NUMBER OF POOLIDS IN LIST (1 THRU 15) */ 08396200
*/*                 - BYTE 1-N - THE RESOURCE POOLIDS                */ 08446200
*/*        OUTPUT: NONE                                              */ 08496200
*/*        R/C:   0 - SUCCESSFULLY PROCESSED THE RESOURCE POOL(S)    */ 08546200
*/*               4 - RESERVED FOR LATER                             */ 08596200
*/*               8 - RESOURCE POOLID TO LARGE                       */ 08646200
*/*                                                                  */ 08700000
*/*      - '0201'X RETURN ADDRESSES AND LENGTHS OF ACB AND RELATED   */ 08750000
*/*        INPUT: 1 ENTRY FOR THE HEADER                             */ 08800000
*/*               1 ENTRY FOR THE CONTROL BLOCK                      */ 08850000
*/*        OUTPUT: XVIEITEM - ADDRESS OF DESCRIPTIVE HEADER          */ 08900000
*/*                XVIEITLN - LENGTH OF DESCRIPTIVE HEADER           */ 08950000
*/*            2ND XVIEITEM - ADDRESS OF VSAM CONTROL BLOCK          */ 09000000
*/*                XVIEITLN - LENGTH OF VSAM CONTROL BLOCK           */ 09050000
*/*        R/C:   0 - SUCCESSFULLY PROCESSED, MORE CB'S TO RETRIEVE  */ 09100000
*/*               4 - SUCCESSFULLY PROCESSED LAST VSAM CB            */ 09150000
*/*               8 - PROBLEM WITH ENTRY (EOLIST, CODE)              */ 09200000
*/*              12 - VSAM STRUCTURE ERROR                           */ 09250000
*/*                                                                  */ 09350000
*/*      - '0203'X RETURN ADDRESSES AND LENGTHS OF ACB, RELATED BSPH,*/ 09377200
*/*                BUFC(S) AND BUFFERS.                              */ 09404400
*/*        INPUT: 1 ENTRY FOR THE HEADER                             */ 09431600
*/*               1 ENTRY FOR THE BSPH                               */ 09458800
*/*               1 ENTRY FOR THE BUFC'S                             */ 09486000
*/*               1 ENTRY FOR THE BUFFERS                            */ 09513200
*/*        OUTPUT: XVIEITEM - ADDRESS OF DESCRIPTIVE HEADER          */ 09540400
*/*                XVIEITLN - LENGTH OF DESCRIPTIVE HEADER           */ 09567600
*/*            2ND XVIEITEM - ADDRESS OF BSPH                        */ 09594800
*/*                XVIEITLN - LENGTH OF BSPH                         */ 09622000
*/*            3RD XVIEITEM - ADDRESS OF BUFC SET                    */ 09649200
*/*                XVIECOD  - LENGTH OF 1 BUFC                       */ 09676400
*/*                XVIEITLN - LENGTH OF BUFC SET                     */ 09703600
*/*            4TH XVIEITEM - ADDRESS OF BUFFER SET                  */ 09730800
*/*                XVIECOD  - LENGTH OF 1 BUFFER                     */ 09758000
*/*                XVIEITLN - LENGTH OF BUFFER SET                   */ 09785200
*/*        R/C:   0 - SUCCESSFULLY PROCESSED, MORE SUBPOOLS EXIST    */ 09812400
*/*               4 - SUCCESSFULLY PROCESSED LAST SUBPOOL            */ 09839600
*/*               5 - RESOURCE POOLID DOESN'T EXIST                  */ 09866800
*/*               8 - PROBLEM WITH ENTRY (EOLIST, CODE)              */ 09894000
*/*              12 - VSAM STRUCTURE ERROR                           */ 09921200
*/*                                                                  */ 09950000
*/*      - '0205'X BUILD MODULE NAME, ENTRYPOINT, FIXLEVEL, AND      */ 09990600
*/*                DATE FOR VSAM RECORD MANAGEMENT IN USER AREA      */ 10031200
*/*        INPUT: 1 ENTRY FOR THE HEADER                             */ 10071800
*/*               1 ENTRY FOR THE RMTBL INFORMATION                  */ 10112400
*/*                XVIHAREA - USER AREA ADDRESS                      */ 10153000
*/*                XVIHARLN - USER AREA LENGTH                       */ 10193600
*/*        OUTPUT: XVIEITEM - ADDRESS OF DESCRIPTIVE HEADER          */ 10234200
*/*                XVIEITLN - LENGTH OF DESCRIPTIVE HEADER           */ 10274800
*/*            2ND XVIEITEM - ADDRESS OF RMTBL OF MODULES            */ 10315400
*/*                XVIEITLN - LENGTH OF RMTBL OF MODULES             */ 10356000
*/*                XVIHARUS - AREA USED AS EACH ENTRY IS BUILT       */ 10396600
*/*        R/C:   0 - SUCCESSFULLY BUILT TABLE IN USER AREA          */ 10437200
*/*               4 - PROBLEM WITH ENTRY (EOLIST, CODE)              */ 10477800
*/*               8 - USER AREA NOT LARGE ENOUGH                     */ 10518400
*/*              12 - VSAM STRUCTURE ERROR                           */ 10559000
*/*                                                                  */ 10600000
*/*      - '0207'X GET ADDR AND LENGTH OF PLHPOOL FOR RESOURCE POOL  */ 10650000
*/*        INPUT: 1 ENTRY FOR THE HEADER                             */ 10700000
*/*               1 ENTRY FOR THE PLHPOOL INFORMATION                */ 10750000
*/*        OUTPUT: XVIEITEM - ADDRESS OF DESCRIPTIVE HEADER          */ 10800000
*/*                XVIEITLN - LENGTH OF DESCRIPTIVE HEADER           */ 10850000
*/*            2ND XVIEITEM - ADDRESS OF PLHPOOL                     */ 10900000
*/*                XVIEITLN - LENGTH OF PLHPOOL                      */ 10950000
*/*                XVIECOD  - LENGTH OF 1 PLH                        */ 11000000
*/*        R/C:   0 - SUCCESSFULLY PROCESSED REQUEST                 */ 11050000
*/*               4 - PROBLEM WITH ENTRY (EOLIST, CODE)              */ 11100000
*/*               8 - VSAM PLH STRUCTURE ERROR                       */ 11150000
*/*                                                                  */ 11700000
*/*      - '0209'X GET ADDR AND LENGTH OF PLHSTACK INFORMATION       */ 11750000
*/*        INPUT: 1 ENTRY FOR THE PLHSTACK                           */ 11800000
*/*                XVIHRPL - ADDRESS OF RPL                          */ 11850000
*/*                XVIHACB - ADDRESS OF ACB                          */ 11900000
*/*        OUTPUT: XVIEITEM - ADDRESS OF PLHSTACK LAST CALLERS       */ 11950000
*/*                XVIEITLN - LENGTH OF STACK RETURNED               */ 12000000
*/*        R/C:   0 - SUCCESSFULLY PROCESSED REQUEST                 */ 12050000
*/*                                                              @LNA*/ 12100000
*/*      - '0210'X RETRIEVE BUFFER ADDRESS AND LENGTH            @LNA*/ 12150000
*/*        INPUT:  XVIEITEM - BUFC ADDRESS                       @LNA*/ 12200000
*/*                XVIEITLN - SHARE POOL ID                      @LNA*/ 12250000
*/*        OUTPUT: XVIEITEM - BUFFER ADDRESS                     @LNA*/ 12300000
*/*                XVIEITLN - BUFFER LENGTH                      @LNA*/ 12350000
*/*        R/C:   0 - SUCCESSFULLY PROCESSED REQUEST             @LNA*/ 12400000
*/*               4 - SPECIFIED POOL DOES NOT EXIST              @LNA*/ 12450000
*/*                                                                  */ 12500000
*/*   MACRO KEYWORDS ---     DESCRIPTION                             */ 12550000
*/*                                                                  */ 13100000
*/*    ---- NOTE: THE HEADER FUNCTIONS EXPECT REG 1 -> HEADER ----   */ 13150000
*/*                                                                  */ 13450000
*/*    HL            - SETS HEADER EYECATCHER AND USER SPECIFIED     */ 13450600
*/*                    LENGTH (REG AND LABEL SUPPORTED).             */ 13451200
*/*                                                                  */ 13452000
*/*    XVIE          - SETS ADDRESS OF FIRST ENTRY IN HEADER         */ 13452600
*/*                    (REG AND LABEL SUPPORTED).                    */ 13453200
*/*                                                                  */ 13454000
*/*    ACB           - SETS USER SUPPLIED ACB ADDRESS IN HEADER      */ 13455500
*/*                                                                  */ 13457000
*/*    AREA          - SETS USER SUPPLIED AREA ADDRESS IN HEADER     */ 13458000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13459000
*/*                                                                  */ 13460000
*/*    AREALTH       - SETS LENGTH OF USER AREA IN HEADER            */ 13460600
*/*                    (REG AND LABEL SUPPORTED).                    */ 13461200
*/*                                                                  */ 13462000
*/*    AREAUSE       - SETS AREA LENGTH USED IN HEADER               */ 13463000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13464000
*/*                                                                  */ 13465000
*/*    RPL           - SETS USER'S RPL ADDRESS IN HEADER             */ 13466000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13467000
*/*                                                                  */ 13468000
*/*    TCB           - SETS USER'S TCB ADDRESS IN HEADER             */ 13469000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13470000
*/*                                                                  */ 13471000
*/*    ---- NOTE: THE ENTRY FUNCTIONS EXPECT USER BASING ----        */ 13472500
*/*                                                                  */ 13474000
*/*    ECODE         - SETS FUNCTION CODE IN ENTRY  (REG AND EQUATE  */ 13474600
*/*                    - CONSTANT FORMS SUPPORTED).                  */ 13475200
*/*                                                                  */ 13476000
*/*    EITEM         - SETS PARAMETER ITEM VALUE IN ENTRY            */ 13477000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13478000
*/*                                                                  */ 13479000
*/*    ELTH          - SETS PARAMETER ITEM LENGTH IN ENTRY           */ 13480000
*/*                    (REG AND LABEL SUPPORTED).                    */ 13481000
*/*                                                                  */ 13482000
*/*    EEOL          - SETS LAST ONE FLAG IN ENTRY.                  */ 13483500
*/*                                                                  */ 13485000
*/*    MAP           - MAPS THE HEADER AND ENTRY BILINGUALLY.        */ 13485500
*/*      - HDRD      -  DEFAULTS TO A HEADER ASSEMBLER DSECT, IF NOT */ 13486000
*/*                     YES, THE DC'S WILL START ON A WORD BOUNDARY. */ 13486500
*/*                                                                  */ 13487000
*/*      - ENTRYD    -  DEFAULTS TO A ENTRY ASSEMBLER DSECT, IF NOT  */ 13488300
*/*                     YES, THE DC'S WILL START ON A WORD BOUNDARY. */ 13489600
*/*                                                                  */ 13491000
*/*    MF (B,HDRADDR)- BUILDS THE HEADER WITH THE SPECIFIED HEADER   */ 13491600
*/*                    KEYWORDS, NO CALL IS MADE.  REG 1 DEFAULTS    */ 13492200
*/*                    TO THE HEADER ADDRESS (IF SPECIFIED, LABEL    */ 13492800
*/*                    AND REG ARE SUPPORTED).                       */ 13493400
*/*                                                                  */ 13494000
*/********************************************************************/ 13500000
* %GOTO  PACPLS2;                                                       13550000
* /*                                                                    13600000
         SPACE 2                                                        13700000
         AIF   ('&HDRD' NE 'YES').HD10                                  13712500
IDAXVIH  DSECT                    XVI HEADER                            13725000
         DS    0D                 ALIGN DSECT ON DBLWD                  13737500
         AGO   .HD20                                                    13750000
.HD10    ANOP                                                           13762500
IDAXVIH  DS    0F                 WITHOUT DSECT WORD ALIGNMENT          13775000
.HD20    ANOP                                                           13787500
*********************************************************************   13800000
**       EXTENDED VSAM INTERFACE REQUEST HEADER                     *   13850000
*********************************************************************   13900000
         DS    0D                                                       13950000
XVIHEYE  DC    CL8'IDAXVIH '  0    CB IDENTIFIER                        13989400
XVIHLTH  DC    F'0'           8    CB LENGTH (3.2 STANDARD)             14028800
XVIHLVL  DC    CL4' '         C    CB LEVEL NUMBER                      14068200
XVIHACB  DC    F'0'          10    ACB ADDRESS                          14107600
XVIHACB0 EQU   128                 BIT 0: INDICATE INDEX COMPONENT      14147000
XVIHRPL  DC    F'0'          14    RPL ADDRESS                          14186400
XVIHAREA DC    F'0'          18    USER AREA ADDRESS                    14225800
XVIHARLN DC    H'0'          1C    USER AREA LENGTH                     14265200
XVIHARUS DC    H'0'          1E    USER AREA USED UP                    14304600
XVIHRC   DC    H'0'          20    OVERALL RETURN CODE                  14344000
XVIHLCOD DC    H'0'          22    LAST ENTRY CODE PROCESSED            14383400
XVIHDBL1 DC    F'0'          24    1ST ENTRY ADDRESS                    14422800
XVIHWRK1 DC    F'0'          28    FUNCTION WORK AREA                   14462200
XVIHWRK2 DC    F'0'          2C    FUNCTION WORK AREA                   14501600
XVIHWRK3 DC    F'0'          30    FUNCTION WORK AREA              @LNC 14541000
XVIWHRK4 DC    F'0'          34    FUNCTION WORK AREA              @LNC 14580400
XVIHLNT  EQU   *-IDAXVIH           CONTROL BLOCK LENGTH                 14619800
XVIHEND  EQU   *                   END OF HEADER                        14659200
*                                                                       14700000
         SPACE 3                                                        14750000
         AIF   ('&ENTRYD' NE 'YES').ED10                                14800000
IDAXVIE  DSECT                     XVI REQUEST ENTRY                    14850000
         DS    0D                 ALIGN DSECT ON DOUBLE WORD            14900000
         AGO   .ED20                                                    14950000
.ED10    ANOP                                                           15000000
IDAXVIE  DS    0F                 WITHOUT DSECT WORD ALIGNMENT          15050000
.ED20    ANOP                                                           15100000
*********************************************************************   15150000
**       EXTENDED VSAM INTERFACE REQUEST ENTRY                      *   15200000
*********************************************************************   15250000
XVIECOD  DS    0CL2               FUNCTION CODE                         15300000
*                                                                       15350000
**    HI ORDER FUNCTION CODE GROUPING 02 FOLLOWS                        15400000
FC0201  EQU   X'0201'             ACB RELATED DUMP HEADER               15450000
FC0202  EQU   X'0202'             ACB RELATED DUMP CB'S                 15500000
FC0203  EQU   X'0203'             POOL RELATED DUMP HEADER              15550000
FC0204  EQU   X'0204'             POOL RELATED DUMP CB'S                15600000
FC0205  EQU   X'0205'             RPL RELATED DUMP HEADER               15650000
FC0206  EQU   X'0206'             RPL RELATED DUMP CB'S                 15700000
FC0207  EQU   X'0207'             PLH POOL DUMP HEADER                  15750000
FC0208  EQU   X'0208'             PLH POOL DATA                         15800000
FC0209  EQU   X'0209'             PLH CALL STACK HEADER                 15850000
FC0210  EQU   X'020A'             RETREIVE BUFFER ADDRESS+LENGTH @LNC   15900000
*                                                                       15950000
XVIECOD1 DC    AL1(0)              HIGH ORDER GROUPING                  15995300
XVIECOD2 DC    AL1(0)              LOW ORDER FUNCTION                   16040600
**    HI ORDER FUNCTION CODE GROUPING 00 FOLLOWS                        16085900
FC0001   EQU   X'0001'            GET A(AMDDUI)                    @LNC 16131200
FC0002   EQU   X'0002'            TOGGLE DEFER WRITE MODE               16176500
FC0003   EQU   X'0003'            GET NUMBER CI'S PER TRK + ALLOC UNIT  16221800
FC0004   EQU   X'0004'            SET AMDDUI                       @LNC 16267100
FC0005   EQU   X'0005'            RESERVED                         @LNC 16312400
FC0006   EQU   X'0006'            RESERVED                         @LNC 16357700
FC0007   EQU   X'0007'            UPDT HRBA AND VSI                     16403000
FC0008   EQU   X'0008'            BUFFER POOL BUFFER READ STATS         16448300
FC0009   EQU   X'0009'            BUFFER POOL BUFFER FOUND STATS        16493600
FC0010   EQU   X'000A'            BUFFER POOL USER INITIATED            16538900
*                                   WRITE STATISTICS                    16584200
FC0011   EQU   X'000B'            BUFFER POOL NON USER INITIATED        16629500
*                                   WRITE STATISTICS                    16674800
FC0012   EQU   X'000C'            GET BUFC ADDRESS GIVEN RPL            16720100
FC0013   EQU   X'000D'            SET HIRBA TO END OF NEW ESDS CA       16765400
FC0014   EQU   X'000E'            GET DATA COMPONENT VSI DATA           16810700
FC0015   EQU   X'000F'            GET INDEX COMPONENT VSI DATA          16856000
FC0016   EQU   X'0010'            TEST FOR CREATE MODE                  16901300
FC0017   EQU   X'0011'            GET CURRENT RECORD POINTER IN PLH     16946600
FC0018   EQU   X'0012'            RESERVED                         @LNC 16991900
FC0019   EQU   X'0013'            GET LO + HI CI RBN FOR ESDS EXTENT    17037200
FC0020   EQU   X'0014'            RESERVED                         @LNC 17082500
FC0021   EQU   X'0015'            RESERVED                         @LNC 17127800
FC0022   EQU   X'0016'            RESERVED                         @LNC 17173100
FC0023   EQU   X'0017'            HIPERSPACE BFR POOL READ STATS        17218400
FC0024   EQU   X'0018'            HIPERSPACE BFR POOL FOUND STATS       17263700
FC0025   EQU   X'0019'            HIPERSPACE USER INITIATED WRTS        17309000
FC0026   EQU   X'001A'            HIPERSPACE NON USER INITIATED WRTS    17354300
FC0027   EQU   X'001B'            HIPERSPACE BUFFER COUNT      @YC41753 17377100
*                                                                       17400000
**    HI ORDER FUNCTION CODE GROUPING 01 FOLLOWS                        17450000
FC0101   EQU   X'0101'            INVALIDATE ZERO USE COUNT BUFFERS     17500000
*                                   AND RETURN LIST OF IN USE BUFFERS   17550000
*                                     FOR AN ACB                        17600000
FC0102   EQU   X'0102'            GET SUBPOOL TOKENS FOR BUFFERS        17650000
*                                   WITH WRITE ERRORS (DATA +           17700000
*                                     INDEX COMPONENTS)                 17750000
FC0103   EQU   X'0103'            INVALIDATE ALL BUFFERS IN             17800000
*                                   EVERY BUFFER POOL                   17850000
*                                                                       17900000
FC0104   EQU   X'0104'            SAME AS FC0102 WITH SPECIAL           17950000
*                                   TERMINATION OPTION.                 18000000
*                                                                       18050000
*                                                                       18100000
XVIEITLN DC    H'0'                ITEM LENGTH                          18150000
XVIEITEM DS    0F                  ITEM ADDRESS                         18200000
         DC    AL1(0)              REDEFINE BIT 0 BYTE                  18250000
XVIEEOL  EQU   128                 BIT 0 IS END OF ENTRY SET            18300000
         DC    AL3(0)              PART OF ITEM ADDRESS                 18350000
XVIELNT  EQU   *-IDAXVIE           CONTROL BLOCK LENGTH                 18400000
XVIEEND  EQU   *                   END OF AN ENTRY                      18450000
*                                                                       18500000
*                                                                       18550000
         MNOTE *,'USE IDABLPRM FOR BLDVRP HDR AND LIST ENTRYS.'         18600000
*                                                                       18650000
.ENDMAC  ANOP  EXIT POINT                                               18700000
         MEXIT                                                          18750000
*                                                                       18800000
.SETENT  ANOP  ,                                                        18801100
**   THE XVI ENTRY IS ASSUMED TO BE BASED BEFORE THIS FUNCTION IS USED. 18802200
         AIF   ('&CLEAR' NE 'YES').BLE0013                              18802400
         XC    IDAXVIE(XVIELNT),IDAXVIE   CLEAR 1 ENTRY                 18802600
.BLE0013 ANOP  ,                                                        18802800
.*                                                                      18803000
         AIF   ('&EITEM' EQ '').BLE0023                                 18813200
         AIF   ('&EITEM'(1,1) EQ '(').BLE002                            18814300
         MVC   XVIEITEM,&EITEM        SET ENTRY PARM FOR USER.          18815400
         AGO   .BLE0023                                                 18816500
.BLE002  ANOP  ,                                                        18817600
         ST    &EITEM,XVIEITEM        SET ENTRY PARM FOR USER.          18818700
.BLE0023 ANOP  ,                                                        18819800
.*                                                                      18820900
         AIF   ('&ELTH' EQ '').BLE0033                                  18822000
         AIF   ('&ELTH'(1,1) EQ '(').BLE003                             18823100
         MVC   XVIEITLN,&ELTH        SET ITEM LENGTH FOR USER.          18824200
         AGO   .BLE0033                                                 18825300
.BLE003  ANOP  ,                                                        18826400
         STH   &ELTH,XVIEITLN        SET ITEM LENGTH FOR USER.          18827500
.BLE0033 ANOP  ,                                                        18828600
.*                                                                      18829700
         AIF   ('&EEOL' EQ '').BLE0043                                  18830800
         OI    XVIEITEM,XVIEEOL      SET LAST ENTRY                     18831900
.BLE0043 ANOP  ,                                                        18833000
.*                                                                      18834100
         AIF   ('&ECODE' EQ '').BLE0053                                 18834200
         AIF   ('&ECODE'(1,1) EQ '(').BLE005                            18834300
         LA    15,&ECODE              PICKUP EQUATE VARIABLE AND        18834400
         STH   15,XVIECOD             SET ENTRY CODE FOR USER.          18834500
         AGO   .BLE0053                                                 18834600
.BLE005  ANOP  ,                                                        18834700
         STH   &ECODE,XVIECOD         SET ENTRY CODE FOR USER.          18834800
.BLE0053 ANOP  ,                                                        18834900
.*                                                                      18835000
         MEXIT                                                          18835200
.*                                                                      18836300
.*                                                                      18836500
.MFBCALL ANOP                                                           18836700
         AIF   ('&CLEAR' NE 'YES').MFB099                               18836900
         XC    IDAXVIH-IDAXVIH(XVIHLNT,1),IDAXVIH-IDAXVIH(1)            18837100
.MFB099  ANOP  ,                                                        18837300
.*                                                                      18837500
.PRECALL ANOP  ,                                                        18837700
.*   SET HEADER EYECATCHER IF REQUESTED.                                18838500
         AIF   ('&HL' EQ '').ILE0013                                    18839600
.*   SET HEADER LENGTH IF REQUESTED. (TRY THIS FOR PLAS RC 16)          18840700
         MVC   XVIHEYE-IDAXVIH(7,1),=C'IDAXVIH '    SET EYECATCHER.     18841800
         MVC   XVIHLVL-IDAXVIH(4,1),=F'1'           SET LEVEL.          18842300
         AIF   ('&HL'(1,1) EQ '(').ILE001                               18842900
         MVC   XVIHLTH-IDAXVIH(4,1),&HL   SET HDR LENGTH FOR USER       18844000
         AGO   .ILE0013                                                 18845100
.ILE001  ANOP  ,                                                        18846200
         ST    &HL,XVIHLTH-IDAXVIH(,1)    SET HDR LENGTH FOR USER       18847300
.ILE0013 ANOP  ,                                                        18848400
.*    SET AREA ADDRESS IF SPECIFIED.                                    18862700
         AIF   ('&AREA' EQ '').ILE0033                                  18863800
         AIF   ('&AREA'(1,1) NE '(').ILE003                             18864900
         ST    &AREA,XVIHAREA-IDAXVIH(,1)   SET AREA ADDRESS            18866000
         AGO   .ILE0033                                                 18867100
.ILE003  MVC   XVIHAREA-IDAXVIH(4,1),&AREA   SET AREA ADDRESS           18868200
.ILE0033 ANOP  ,                                                        18869300
.*    SET AREA LENGTH IF SPECIFIED.                                     18870400
         AIF   ('&AREALTH' EQ '').ILE0043                               18871500
         AIF   ('&AREALTH'(1,1) NE '(').ILE004                          18872600
         STH   &AREALTH,XVIHARLN-IDAXVIH(,1)   SET AREA LENGTH          18873700
         AGO   .ILE0043                                                 18874800
.ILE004  MVC   XVIHARLN-IDAXVIH(2,1),&AREALTH   SET AREA LENGTH         18875900
.ILE0043 ANOP  ,                                                        18877000
.*    SET AREA USED IF SPECIFIED.                                       18878100
         AIF   ('&AREAUSE' EQ '').ILE0053                               18879200
         AIF   ('&AREAUSE'(1,1) NE '(').ILE005                          18880300
         STH   &AREAUSE,XVIHARUS-IDAXVIH(,1)   SET AREA USED            18881400
         AGO   .ILE0053                                                 18882500
.ILE005  MVC   XVIHARUS-IDAXVIH(2,1),&AREAUSE   SET AREA USED           18883600
.ILE0053 ANOP  ,                                                        18884700
.*    SET RPL ADDRESS IF SPECIFIED.                                     18885800
         AIF   ('&RPL' EQ '').ILE0063                                   18886900
         AIF   ('&RPL'(1,1) NE '(').ILE006                              18888000
         ST    &RPL,XVIHRPL-IDAXVIH(,1)   SET RPL ADDRESS               18889100
         AGO   .ILE0063                                                 18890200
.ILE006  MVC   XVIHRPL-IDAXVIH(4,1),&RPL   SET RPL ADDRESS              18891300
.ILE0063 ANOP  ,                                                        18892400
.*   SET ACB ADDRESS IF SPECIFIED.                                      18893500
         AIF   ('&ACB' EQ '').ILE0073                                   18894600
         AIF   ('&ACB'(1,1) NE '(').ILE007                              18895700
         ST    &ACB,XVIHACB-IDAXVIH(,1)   SET ACB ADDRESS               18896800
         AGO   .ILE0073                                                 18897900
.ILE007  MVC   XVIHACB-IDAXVIH(4,1),&ACB   SET ACB ADDRESS              18899000
.ILE0073 ANOP  ,                                                        18900100
.*                                                                      18900200
.*   SET TCB ADDRESS IF SPECIFIED                                  @LNA 18900300
         AIF   ('&TCB' EQ '').ILE0083                              @LNA 18900400
         AIF   ('&TCB'(1,1) NE '(').ILE008                         @LNA 18900500
         ST    &TCB,XVIHWRK1-IDAXVIH(,1)  SET TCB ADDRESS          @LNA 18900600
         AGO   .ILE0083                                            @LNA 18900700
.ILE008  MVC   XVIHWRK1-IDAXVIH(4,1),&TCB  SET TCB ADDRESS         @LNA 18900800
.ILE0083 ANOP ,                                                    @LNA 18900900
.*                                                                      18901000
.*    SET ENTRY ADDRESS IF SPECIFIED.                                   18901100
         AIF   ('&XVIE' EQ '').ILE0093                                  18901200
         AIF   ('&XVIE'(1,7) EQ 'HDRTAIL').ILE0092                      18901300
         AIF   ('&XVIE'(1,1) NE '(').ILE009                             18901400
         ST    &XVIE,XVIHDBL1-IDAXVIH(,1)   SET A(1ST ENTRY)            18901500
         AGO   .ILE0093                                                 18901600
.ILE009  MVC   XVIHDBL1-IDAXVIH(4,1),&XVIE   SET A(1ST ENTRY)           18901700
         AGO   .ILE0093                                                 18901800
.ILE0092 ANOP  ,                                                        18901900
         LA    15,XVIHEND-IDAXVIH(,1)      SET A(1ST ENTRY)             18902000
         ST    15,XVIHDBL1-IDAXVIH(,1)      AT END OF HEADER.           18902100
.ILE0093 ANOP  ,                                                        18902200
         AIF   ('&MF' EQ '').ILE099                                     18902300
         AIF   ('&MF'(1,1) EQ 'B').ILE0991                              18902400
         AIF   ('&MF'(1,3) NE '(B,').ILE099                             18902500
.ILE0991 ANOP  ,                                                        18902800
.* LEAVE AFTER BUILD REQUEST (LAST OF CHANGES FROM TEST MACLIB)         18903400
         MEXIT                                                          18904500
.*                                                                      18906700
.ILE099  ANOP  ,                                                        18907200
.*                                                                      18907700
.CALLXVI ANOP  ,                                                        18908200
.*    SETUP DISPLACEMENT INTO XVI SRB TABLE IF NECESSARY.               18908900
&DISP    SETA  0                   NORMAL CALL WITH HEADER - ENTRY      18912500
         SPACE 2                                                        18925000
         AIF   ('&FUNC'(1,2) NE 'FR').FREND                             18925800
         AIF   ('&FUNC' NE 'FR1').FR2                                   18926600
&DISP    SETA  16                  A(SPECIAL FASTRTN1 - COMPAT)         18927400
         AGO   .MARKEND                                                 18928200
.FR2     ANOP  ,                                                        18929000
         AIF   ('&FUNC' NE 'FR2').FR3                                   18929800
&DISP    SETA  20                  A(SPECIAL FASTRTN2 - COMPAT)         18930600
         AGO   .MARKEND                                                 18931400
.FR3     ANOP  ,                                                        18932200
         AIF   ('&FUNC' NE 'FR3').FR4                                   18933000
&DISP    SETA  24                  A(SPECIAL FASTRTN3 - COMPAT)         18933800
         AGO   .MARKEND                                                 18934600
.FR4     ANOP  ,                                                        18935400
         AIF   ('&FUNC' NE 'FR4').FR5                                   18936200
&DISP    SETA  28                  A(SPECIAL FASTRTN4 - COMPAT)         18937000
         AGO   .MARKEND                                                 18937800
.FR5     ANOP  ,                                                        18938600
         AIF   ('&FUNC' NE 'FR5').FR6                                   18939400
&DISP    SETA  32                  A(SPECIAL FASTRTN5 - COMPAT)         18940200
         AGO   .MARKEND                                                 18941000
.FR6     ANOP  ,                                                        18941800
         AIF   ('&FUNC' NE 'FR6').FRERR                                 18942600
&DISP    SETA  36                  A(SPECIAL FASTRTN6 - COMPAT)         18943400
         AGO   .MARKEND                                                 18944200
.*                                                                      18945000
.FRERR   ANOP  ,                                                        18945800
         MNOTE 8,'XVIM151 - UNIDENTIFIED FAST ROUTINE FUNCTION'         18946600
         MEXIT                                                          18947400
.*                                                                      18948200
*                                                                       18950000
*********************************************************************   19000000
**       EXTENDED VSAM INTERFACE INVOCATION.                        *   19050000
**         CALLER MUST BE IN 31 BIT MODE (CODE ABOVE THE LINE)      *   19100000
*********************************************************************   19150000
*                                                                       19200000
.FREND   ANOP  ,                                                        19250000
         AIF   ('&FUNC' NE 'BSPHSRB').MARK1                             19300000
&DISP    SETA  4                   A(SPECIAL BSPH SRB RTN)              19350000
         AGO   .MARKEND                                                 19650000
.MARK1   ANOP  ,                                                        19675000
         AIF   ('&FUNC' NE 'VSIGSRB').MARK2                             19700000
&DISP    SETA  8                   A(SPECIAL VSI GET SRB RTN)           19733300
         AGO   .MARKEND                                                 19766600
.MARK2   ANOP  ,                                                        19800000
         AIF   ('&FUNC' NE 'PLHSTK1').MARK3                             19807100
&DISP    SETA  12                  A(SPECIAL PLHSTK CALLTRACE)          19814200
         AGO   .MARKEND                                                 19821300
.MARK3   ANOP  ,          GATE ALL OTHER'S THRU, THERE OK               19828400
.MARKEND ANOP  ,                                                        19835500
         L     15,16(0,0)          A(CVT)                               19842600
         L     15,X'2C4'(,15)      A(IEZABP - ACTUAL BLK PROCESSOR)     19849700
.* WILL USE ABP019XV DIRECTLY FOR 3.2.0                                 19856800
         L     15,X'50'(,15)       A(IDA019XV - XVI PROCESSOR)          19863900
         AIF   (&DISP EQ 0).MARKCAL                                     19871000
         L     15,&DISP.(,15)                                           19878100
.*                                                                      19885200
.MARKCAL BASR  14,15               SAVE RETURN, MODE, GO FOR IT         19892300
         MEXIT                                                          19925000
         MEND                                                           19950000
*                                                                       19983300
*  */                                                                   20016600
*%PACPLS2: ;                                                            20050000
* DCL 1 IDAXVIH BASED,                                                  20100000
*/********************************************************************/ 20150000
*/*      EXTENDED VSAM INTERFACE REQUEST HEADER                      */ 20200000
*/********************************************************************/ 20250000
*      3 XVIHEYE  CHAR(8),         /*  0 CB IDENTIFIER               */ 20300000
*      3 XVIHLTH  FIXED(31),       /*  8 LENGTH                      */ 20340600
*      3 XVIHLVL  CHAR(4),         /*  C LEVEL                       */ 20381200
*      3 XVIHACB  PTR(31),         /* 10 ACB ADDRESS                 */ 20421800
*      3 XVIHRPL  PTR(31),         /* 14 RPL ADDRESS                 */ 20462400
*      3 XVIHAREA PTR(31),         /* 18 USERAREA ADDRESS            */ 20503000
*      3 XVIHARLN FIXED(15),       /* 1C USERAREA LENGTH             */ 20543600
*      3 XVIHARUS FIXED(15),       /* 1E USERAREA USED UP            */ 20584200
*      3 XVIHRC   FIXED(16),       /* 20 OVERALL RETURNCODE          */ 20624800
*      3 XVIHLCOD FIXED(15),       /* 22 LAST ENTRY CODE PROCESSED   */ 20665400
*      3 XVIHDBL1 PTR(31),         /* 24 1ST ENTRY ADDRESS           */ 20706000
*      3 XVIHWRK1 CHAR(4),         /* 28 FUNCTION WORKAREA           */ 20746600
*      3 XVIHWRK2 CHAR(4),         /* 2C FUNCTION WORKAREA       @LNC*/ 20787200
*      3 XVIHWRK3 CHAR(4),         /* 30 FUNCTION WORKAREA       @LNA*/ 20827800
*      3 XVIHWRK4 CHAR(4),         /* 34 FUNCTION WORKAREA       @LNA*/ 20868400
*      3 XVIHEND  CHAR(0) BDY(WORD);  /* END HEADER ON WORD BDY      */ 20909000
*/*                                                                  */ 20950000
*/*                                                                  */ 21000000
*/*                                                                  */ 21050000
*/********************************************************************/ 21100000
*/*      EXTENDED VSAM INTERFACE REQUEST ENTRY                       */ 21150000
*/********************************************************************/ 21200000
* DCL 1 IDAXVIE BASED,             /* REQUEST ENTRY                  */ 21250000
*      3 XVIECOD  FIXED(15),       /* FUNCTION CODE                  */ 21300000
*        5 XVIECOD1 PTR(8),        /* HI ORDER GROUPING              */ 21350000
*        5 XVIECOD2 PTR(8),        /* LO ORDER FUNCTION CODE         */ 21400000
*      3 XVIEITLN FIXED(15),       /* ITEM LENGTH                    */ 21450000
*      3 XVIEITEM PTR(31),         /* ITEM ADDRESS                   */ 21500000
*        5 *      BIT(8),          /* HI ORDER BYTE BIT 0            */ 21550000
*          7 XVIEEOL BIT(1),       /* LAST ITEM IN SET               */ 21600000
*          7 *      BIT(7),        /* REST IS 31 BIT ADDRESS         */ 21650000
*      3 XVIEEND CHAR(0) BDY(WORD);  /* END ENTRY ON WORD BDY        */ 21700000
*/*                                                                  */ 21750000
*/*                                                                  */ 21800000
* DCL XVIIDF CHAR(4) CONSTANT('XVI '); /* CONTROL BLOCK IDENTIFIER   */ 21850000
*/*   HI ORDER FUNCTION CODE GROUPING 00 FOLLOWS                     */ 21900000
* DCL FC0001 FIXED(8) CONSTANT(1);  /* RETREIVE AMDDUI           @LNC*/ 21950000
* DCL FC0002 FIXED(8) CONSTANT(2);  /* TOGGLE DEFER WRITE MODE       */ 22000000
* DCL FC0003 FIXED(8) CONSTANT(3);  /* GET NO CI'S/TRK + /ALLOC UNIT */ 22050000
* DCL FC0004 FIXED(8) CONSTANT(4);  /* UPDATE AMDDUI             @LNC*/ 22100000
* DCL FC0005 FIXED(8) CONSTANT(5);  /* RESERVED                  @LNC*/ 22150000
* DCL FC0006 FIXED(8) CONSTANT(6);  /* RESERVED                  @LNC*/ 22200000
* DCL FC0007 FIXED(8) CONSTANT(7);  /* UPDT ESDS VSI DATA GIVEN RBA  */ 22250000
* DCL FC0008 FIXED(8) CONSTANT(8);  /* BUFFPOOL BUFFER FOUND STATS   */ 22300000
* DCL FC0009 FIXED(8) CONSTANT(9);  /* BUFFPOOL BUFFER READ STATS    */ 22350000
* DCL FC0010 FIXED(8) CONSTANT(10); /* BUFFPOOL NON USER INITIATED      22400000
                                                WRITE STATS          */ 22450000
* DCL FC0011 FIXED(8) CONSTANT(11); /* BUFFPOOL USER INITIATED          22500000
                                                WRITE STATS          */ 22550000
* DCL FC0012 FIXED(8) CONSTANT(12); /* GET BUFC ADDRESS GIVEN RPL    */ 22600000
* DCL FC0013 FIXED(8) CONSTANT(13); /* SET HIRBA TO END NEW ESDS CA  */ 22650000
* DCL FC0014 FIXED(8) CONSTANT(14); /* GET DATA COMPONENT VSI DATA   */ 22700000
* DCL FC0015 FIXED(8) CONSTANT(15); /* GET INDEX COMPONENT VSI DATA  */ 22750000
* DCL FC0016 FIXED(8) CONSTANT(16); /* TEST FOR CREATE MODE          */ 22800000
* DCL FC0017 FIXED(8) CONSTANT(17); /* GET CURRENT RECORD POINTER       22850000
                                             FROM PLH                */ 22900000
* DCL FC0018 FIXED(8) CONSTANT(18); /* RESERVED                  @LNC*/ 22950000
* DCL FC0019 FIXED(8) CONSTANT(19); /* GET LO + HI CI RBN ESDS EXTENT*/ 23000000
* DCL FC0020 FIXED(8) CONSTANT(20); /* RESERVED                  @LNC*/ 23050000
* DCL FC0021 FIXED(8) CONSTANT(21); /* SET DATA COMPONENT VSI DATA   */ 23100000
* DCL FC0022 FIXED(8) CONSTANT(22); /* SET INDEX COMPONENT VSI DATA  */ 23150000
* DCL FC0023 FIXED(8) CONSTANT(23); /* HSP BUFFER FOUND STATS@YA41753*/ 23166600
* DCL FC0024 FIXED(8) CONSTANT(24); /* HSP BUFFER READ STATS @YA41753*/ 23183200
* DCL FC0025 FIXED(8) CONSTANT(25); /* HSP NUI WRITE STATS   @YA41753*/ 23199800
* DCL FC0026 FIXED(8) CONSTANT(26); /* HSP UI WRITE STATS    @YA41753*/ 23216400
* DCL FC0027 FIXED(8) CONSTANT(27); /* HSP BUFFER COUNT      @YA41753*/ 23233000
*/*                                                                  */ 23250000
*/*  HI ORDER FUNCTION CODE GROUPING 01 FOLLOWS                      */ 23300000
* DCL FC0101 FIXED(8) CONSTANT(01); /* INVALIDATE ZERO USECOUNT BUFFERS 23350000
                                       AND RETURN LIST OF INUSE BUFFERS 23400000
                                       FOR AN ACB                    */ 23450000
* DCL FC0102 FIXED(8) CONSTANT(02); /* GET SUBPOOL TOKENS FOR BUFFERS   23500000
                                       WITH WRITE ERRORS (DATA +        23550000
                                       INDEX COMPONENTS)             */ 23600000
* DCL FC0103 FIXED(8) CONSTANT(03); /* INVALIDATE ALL BUFFERS IN        23650000
                                       EVERY BUFFERPOOL              */ 23700000
* DCL FC0104 FIXED(8) CONSTANT(04); /* SAME AS 0102 WITH SPECIAL        23750000
                                           TERMINATE OPTION          */ 23800000
*/*                                                                  */ 23850000
*/*  HI ORDER FUNCTION CODE GROUPING 02 FOLLOWS                      */ 23900000
* DCL FC0201 FIXED(16) CONSTANT(513); /* ACB RELATED DUMP HEADER     */ 23950000
* DCL FC0202 FIXED(16) CONSTANT(514); /* ACB RELATED DUMP CB'S       */ 24000000
* DCL FC0203 FIXED(16) CONSTANT(515); /* POOL RELATED DUMP HEADER    */ 24050000
* DCL FC0204 FIXED(16) CONSTANT(516); /* POOL RELATED DUMP CB'S      */ 24100000
* DCL FC0205 FIXED(16) CONSTANT(517); /* MODULE EP, LEVEL, DATE HDR  */ 24150000
* DCL FC0206 FIXED(16) CONSTANT(518); /* MODULE EP, LEVEL, DATE INFO */ 24200000
* DCL FC0207 FIXED(16) CONSTANT(519); /* PLH POOL HDR                */ 24250000
* DCL FC0208 FIXED(16) CONSTANT(520); /* PLH POOL STORAGE            */ 24300000
* DCL FC0209 FIXED(16) CONSTANT(521); /* PLH CALL STACK HEADER       */ 24350000
* DCL FC0210 FIXED(16) CONSTANT(522); /* RETRIEVE BFR ADDR + LN  @LNC*/ 24400000
*/*                                                                  */ 24450000
*/*                                                                  */ 24500000
*/* NOTE:  USAGE NOTES GO HERE                                       */ 24550000
*/*                                                                  */ 24600000
*/*                                                                  */ 24650000
*/*                                                                  */ 24700000
*/*                                                                  */ 24750000
