*                                                                       00050990
*        %GOTO WQEC1;    /* BILINGUAL MAPPING                           00051980
         MACRO                                                          00052970
         IEAVM108                                                       00053960
*                                                                    */ 00054950
*%WQEC1 : ;                                                             00055940
*                                                                       00056930
*/** Start of Specifications *****************************************/ 00057920
*/*01* PROPRIETARY STATEMENT=                                        */ 00058910
*/***PROPRIETARY_STATEMENT********************************************/ 00059900
*/*                                                                  */ 00060890
*/*                                                                  */ 00061880
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00062870
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00063860
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1986, 1999                      */ 00064850
*/*                                                                  */ 00065840
*/* STATUS= JBB6607                                                  */ 00066830
*/*                                                                  */ 00067820
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00068810
*/*                                                                  */ 00069800
*/* EXTERNAL CLASSIFICATION: NONE                                    */ 00070790
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00071780
*/*                                                                  */ 00072770
*/*01*   MACRO-NAME:  IEAVM108                                       */ 00073760
*/*                                                                  */ 00074750
*/*01*   DESCRIPTIVE-NAME:  WQE count table                          */ 00075740
*/*02*    ACRONYM:          WQEC                                     */ 00076730
*/*                                                                  */ 00077720
*/*01*   DSECT NAME:        WQECNTAB                                 */ 00078710
*/*                                                                  */ 00079700
*/*01*   COMPONENT:         SC1CK                                    */ 00080690
*/*                                                                  */ 00081680
*/*01*   EYE_CATCHER:       WQEC                                     */ 00082670
*/*02*   OFFSET:            0                                        */ 00083660
*/*02*   LENGTH:            4                                        */ 00084650
*/*                                                                  */ 00085640
*/*01*   STORAGE ATTRIBUTES:                                         */ 00086630
*/*02*   SUBPOOL:           239                                  @03C*/ 00087620
*/*02*   KEY:               0                                        */ 00088610
*/*02*   RESIDENCY:         Above 16M line                           */ 00089600
*/*                                                                  */ 00090590
*/*01*   SIZE:    Header is 16 (X'10') bytes                         */ 00091580
*/*               Each entry in the count table is 16 bytes          */ 00092570
*/*                                                                  */ 00093560
*/*01*   CREATED BY:        IEAVVINT                                 */ 00094550
*/*                                                                  */ 00095540
*/*01*   POINTED TO BY:     UCMFWQEC                                 */ 00096530
*/*                                                                  */ 00097520
*/*01*   DELETED BY:        N/A  (never deleted)                     */ 00098510
*/*                                                                  */ 00099500
*/*01*   FUNCTION:                                                   */ 00100490
*/*         IEAVM108 provides the mapping of the WQE count table.    */ 00101480
*/*                                                                  */ 00102470
*/*         The table consists of a header, followed by an entry     */ 00103460
*/*         for each address space.  There are ASVTMAXU entries in   */ 00104450
*/*         the table (the number of maximum possible address        */ 00105440
*/*         spaces).  Each entry has a count of WQEs and BWRBs       */ 00106430
*/*         (branch entry DOMs and WQEs) in an address space     @03C*/ 00107420
*/*                                                                  */ 00108410
*/*01*   NOTES:                                                      */ 00109400
*/*                                                                  */ 00110390
*/*02*     DEPENDENCIES:  ASVTMAXU must contain maximum possible     */ 00111380
*/*                       number of address spaces (no address       */ 00112370
*/*                       space can have a higher ASID).             */ 00113360
*/*                                                                  */ 00114350
*/*02*     CHARACTER-CODE-DEPENDENCIES:  None                        */ 00115340
*/*                                                                  */ 00116330
*/*02*     RESTRICTIONS:  None                                       */ 00117320
*/*                                                                  */ 00118310
*/*01*   MODULE-TYPE:  BIL macro                                     */ 00119300
*/*                                                                  */ 00120290
*/*02*     PROCESSOR:  PL/AS or ASM                                  */ 00121280
*/*                                                                  */ 00122270
*/*01*   EXTERNAL-REFERENCES:                                        */ 00123260
*/*                                                                  */ 00124250
*/*02*     ROUTINES:  None                                           */ 00125240
*/*                                                                  */ 00126230
*/*02*     DATA-AREAS:  None                                         */ 00127220
*/*                                                                  */ 00128210
*/*02*     CONTROL-BLOCKS:  None                                     */ 00129200
*/*                                                                  */ 00130190
*/*01*   TABLES:  None                                               */ 00131180
*/*                                                                  */ 00132170
*/*01*   MACROS-EXECUTABLE:  None                                    */ 00133160
*/*                                                                  */ 00134150
*/*01*   METHOD OF ACCESS:                                           */ 00135140
*/*02*     PL/AS - %INCLUDE SYSLIB (IEECUCM) - to get UCMFWQEC       */ 00136130
*/*                %INCLUDE SYSLIB (IEAVM108)                        */ 00137120
*/*                                                                  */ 00138110
*/*02*     BAL   - SPECIFY IEECUCM - to get UCMFWQEC                 */ 00139100
*/*                        IEAVM108                                  */ 00140090
*/*                                                                  */ 00141080
*/*01*   MESSAGES:  None                                             */ 00142070
*/*                                                                  */ 00143060
*/*01*   SERIALIZATION:  Compare and Swap used to alter counts.      */ 00144050
*/*                                                                  */ 00145040
*/*01*   DISTRIBUTION LIBRARY : AMODGEN                          @P1C*/ 00146030
*/*                                                                  */ 00147020
*/*01*   CHANGE-ACTIVITY:                                            */ 00148010
*/*                                                                  */ 00149000
*/*  $MAC(IEAVM108),COMP(SC1CK): WQE Count Table Mapping Macro       */ 00149990
*/*  $00=YA24954 JBB2220 900331  PDHZ : Comm Task storage exhaustion */ 00150980
*/*  $01=OW07896 HBB5510 941031  PDHD : WTO Flooding                 */ 00151970
*/*  $02=OW13951 HBB4430 950815  PDHD : Issue IEA653I in HBB4430 -   */ 00152960
*/*                                  No code change in this release. */ 00153950
*/*  $P1=PWA0053 JBB6607 980128  PDZH : Changed distlib to AMODGEN   */ 00154940
*/*  $03=OW42876 HBB6608 000414  PDKP : BE WTO end of job routine -  */ 00155930
*/*                                     Performance enhancement      */ 00156920
*/*  $04=OW47028 HBB6608 001201  PDKP : PE of OW42876                */ 00157320
*/*                                                                  */ 00157910
*/*** End of Specifications ******************************************/ 00158900
*%GOTO WQEC2;  /*                                                       00159890
         SPACE 1                                                        00160880
WQECSBPL  EQU   239      WQE count table subpool                   @03C 00161870
WQECNTAB  DSECT          WQE Count Table - pointed to by UCMFWQEC       00162860
          DS    0D                                                      00163850
WQECHDR   DS    0C       WQE count table header                         00164840
WQECACRO  DS    CL4      WQE count table acronym 'WQEC'                 00165830
WQECVERN  DS    XL1      Version level                                  00166820
WQECSP22  EQU   1        Version level for SP2.2.0                      00167810
WQECSP51  EQU   2        Version level for SP5.1.0 (APAR OW07896)  @01A 00168800
WQECSP68  EQU   5        Version level for OS/390 HBB6608 (APAR        X00169790
                         OW42876)                                  @03A 00170780
WQECVERS  EQU   WQECSP68 Current version                           @03C 00171770
          DS    XL3      Reserved                                       00172760
WQECNENT  DS    F        Number of table entries                        00173750
          DS    CL4      Reserved                                       00174740
WQECHDRL  EQU   *-WQECHDR  Length of WQE count table header             00175730
WQECTBLE  DS    0F                                                      00176720
          SPACE 2                                                       00177710
WQECENTR  DSECT          Template for a WQE count table entry           00178700
WQECOUNT  DS    F        WQE count for address space                    00179690
WQECDOM   DS    F        DOM ID for address space                       00180680
WQECFLG   DS    BL1      Flags                                     @01A 00181670
WQEC50I   EQU   X'80'    Message IEA653I issued at 50% of MLIM     @01A 00182660
WQECUEND  EQU   X'40'    An unended multiline has been issued.  Do not X00182960
                         use BWRB count (WQECBCNT)                 @04A 00183260
          DS    CL3      Reserved                                  @03C 00183650
WQECBCNT  DS    F        BWRB count for address space              @03A 00184640
WQECNEXT  DS    0F       Used to address next WQE count table entry     00185630
WQECENSZ  EQU   *-WQECENTR Size of one WQE count table entry            00186620
          MEND  , */                                                    00187610
*%WQEC2    :  ;                                                         00188600
* DECLARE                                                               00189590
*  1 WQECNTAB BDY(DWORD) BASED(UCMFWQEC), /* WQE count table         */ 00190580
*     3 WQECHDR,                        /* WQE count table header    */ 00191570
*        5 WQECACRO    CHAR(4),         /* WQE count table acronym   */ 00192560
*        5 WQECVERN    FIXED(8),        /* WQE count table version   */ 00193550
*        5 *           CHAR(3),         /* Reserved                  */ 00194540
*        5 WQECNENT    FIXED(31),       /* Number of table entries   */ 00195530
*        5 *           CHAR(4),         /* Reserved                  */ 00196520
*     3 WQECENTR(*),                    /* WQE count table entry     */ 00197510
*        5 WQECOUNT    FIXED(31),       /* WQE count for address space  00198500
*                                                                    */ 00199490
*        5 WQECDOM     FIXED(32),       /* DOM ID for address space  */ 00200480
*        5 WQECFLG     BIT(8),          /* Flags                 @01A*/ 00201470
*          7 WQEC50I   BIT(1),          /* Message IEA653I issued at    00202460
*                                          50% of MLIM           @01A*/ 00203450
*          7 WQECUEND  BIT(1),          /* An unended multiline has     00203650
*                                          been issued.  Do not use     00203850
*                                          BWRB count (WQECBCNT) @04A*/ 00204050
*        5 *           CHAR(3),         /* Reserved              @03C*/ 00204440
*        5 WQECBCNT    FIXED(31);       /* BWRB count for address       00205430
*                                          space                 @03A*/ 00206420
*                                                                       00207410
*DECLARE                                                                00208400
*  WQECACRN CHAR(4) CONSTANT('WQEC'),   /* WQE count table acronym   */ 00209390
*  WQECVERS FIXED(8) CONSTANT(WQECSP68),/* Current version       @03C*/ 00210380
*  WQECSP22 FIXED(8) CONSTANT(1),       /* MVS/SP220 version level   */ 00211370
*  WQECSP51 FIXED(8) CONSTANT(2),       /* MVS/SP510 version level      00212360
*                                          (APAR OW07896)        @01A*/ 00213350
*  WQECSP68 FIXED(8) CONSTANT(5),       /* OS/390 HBB6608 version       00214340
*                                          level (apar OW42876)  @03A*/ 00215330
*  WQECSBPL FIXED(31) CONSTANT(239);    /* WQE count table subpool      00216320
*                                                                @03C*/ 00217310
