* %GOTO ALLWAPL2; /*                                                    00025000
         MACRO                                                          00050000
&LABEL   IECALLWA &EP,&F4,&NRQ,&D1=(0),&D2=(0),&ADT=NO,&LABELS=YES     X00051500
                                                                   @L6C 00053000
.** START OF SPECIFICATIONS ******************************************* 00054500
.*                                                                    * 00056000
.*$MAC(IECALLWA):    DADSM ALLOCATE WORK AREA                         * 00058000
.*                                                                    * 00060000
.*DESCRIPTIVE NAME = DADSM ALLOCATE WORK AREA ADDRESSING MACRO        * 00062000
.*                                                                    * 00064000
.*PROPRIETARY V3 STATEMENT                                            * 00065100
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00066200
.*"RESTRICTED MATERIALS OF IBM"                                       * 00067300
.*5695-DF1                                                            * 00068400
.*(C) COPYRIGHT 1980,1993  IBM CORP.                                  * 00069500
.*END PROPRIETARY V3 STATEMENT                                        * 00070600
.*                                                                    * 00072000
.* STATUS: DFSMS/MVS 1.6.0                                            * 00074000
.*                                                                    * 00076000
.*FUNCTION = DADSM ALLOCATE MACRO WHICH PROVIDES ADDRESSABILITY       * 00078000
.*           TO THE WORK AREA (NOT INCLUDING THE 8 WORD               * 00080000
.*           PREFIX OR THE 6 WORD RECOVERY ROUTINE PARAMETER          * 00082000
.*           LIST) USED BY ALLOCATE, ISAM ALLOCATE, AND THE VTOC      * 00084000
.*           CONVERSION ROUTINES.                                     * 00086000
.*                                                                    * 00088000
.*NOTES = THIS MACRO IS AN INTERNAL MACRO USED IN THE FOLLOWING       * 00090000
.*        DADSM FUNCTIONS:                                            * 00092000
.*                                                                    * 00094000
.*            ALLOCATE                                                * 00096000
.*            EXTEND (INTERFACE TO VTOC CONVERSION)                   * 00098000
.*            ISAM ALLOCATE                                           * 00100000
.*            VTOC CONVERSION                                         * 00102000
.*                                                                    * 00104000
.*        TO REFERENCE THIS WORK AREA WITHIN THE FUNCTIONS LISTED     * 00106000
.*        ABOVE, CODE A USING STATEMENT ON THE LABEL 'ALLOCWKA'.      * 00108000
.*                                                                    * 00110000
.*     DEPENDENCIES = THIS MACRO IS DESIGNED TO BE USED OPTIONALLY    * 00112000
.*                    WITH THE IECSDSL1 DSCB MAPPING MACRO, THE       * 00114000
.*                    PREFX MACRO (DEFINED IN THE IECDSECS MACRO)     * 00116000
.*                    WHICH DEFINES THE 8 WORD WORK AREA PREFIX,      * 00118000
.*                    THE 20 WORD EXTENDED WORK AREA PREFIX, AND      * 00120000
.*                    THE 4 WORD DADSM WTG TABLE, AND THE DSMADT      * 00122000
.*                    MACRO (ALSO DEFINED IN THE IECDSECS MACRO)      * 00124000
.*                    WHICH DEFINES THE 10 WORD DADSM AUDIT TRAIL.@09C* 00126000
.*                                                                    * 00128000
.*     RESTRICTIONS = NONE                                            * 00130000
.*                                                                    * 00132000
.*     REGISTER CONVENTIONS = NOT APPLICABLE                          * 00134000
.*                                                                    * 00136000
.*PATCH LABEL = NOT APPLICABLE                                        * 00138000
.*                                                                    * 00140000
.*MODULE TYPE = MACRO                                                 * 00142000
.*                                                                    * 00144000
.*     PROCESSOR = ASSEMBLER / PLS                                    * 00146000
.*                                                                    * 00148000
.*     MODULE SIZE = SEE ASSEMBLER LISTING                            * 00150000
.*                                                                    * 00152000
.*     ATTRIBUTES = NOT APPLICABLE                                    * 00154000
.*                                                                    * 00156000
.*ENTRY POINT = ALLPREFX                                              * 00158000
.*                                                                    * 00160000
.*     PURPOSE = THIS MACRO IS CALLED AT ASSEMBLY TIME BY THE         * 00162000
.*               FUNCTIONS LISTED UNDER 'NOTES' TO EXPAND THE         * 00164000
.*               ALLOCATE WORK AREA.                                  * 00166000
.*                                                                    * 00168000
.*     LINKAGE =                                                      * 00170000
.*                                                                    * 00172000
.*     LABEL IECALLWA EP,F4,D1=(N),D2=(N),ADT=YES                     * 00174000
.*                                                                    * 00176000
.*     INPUT =                                                        * 00178000
.*                                                                    * 00180000
.*               OPTIONAL LABEL SPECIFIED AS AN ACCEPTABLE ASSEMBLER  * 00182000
.*               LABEL WHICH CAN BE USED BY THE CALLING CSECT TO      * 00184000
.*               ESTABLISH ADDRESSABILITY TO THE ENTIRE WORK AREA.    * 00186000
.*                                                                    * 00188000
.*               EP IS THE FIRST POSITIONAL PARAMETER, SPECIFYING     * 00190000
.*               THAT THE LABELS FOR EACH OF THE FIELDS IN THE 8      * 00192000
.*               WORD PREFIX, 20 WORD EXTENDED PREFIX, AND THE 4      * 00194000
.*               WORD DADSM WTG TABLE ARE TO BE EXPANDED. IF THESE    * 00196000
.*               FIELDS ARE NOT TO BE DEFINED, A COMMA MUST BE        * 00198000
.*               CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.     * 00200000
.*                                                                    * 00202000
.*               F4 IS THE SECOND POSITIONAL PARAMETER, SPECIFYING    * 00204000
.*               THAT THE FIELDS OF THE FORMAT 4 DSCB ARE TO BE       * 00206000
.*               EXPANDED USING THE IECSDSL1 DSCB MAPPING MACRO.      * 00208000
.*               IF THESE FIELDS ARE NOT TO BE DEFINED AND A          * 00210000
.*               KEYWORD PARAMETER FOLLOWS, A COMMA MUST BE           * 00212000
.*               CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.     * 00214000
.*                                                                    * 00216000
.*               NRQ IS THE THIRD POSITIONAL PARAMETER, SPECIFYING    * 00222600
.*               THAT THE FIELDS IN ALLREQST ARE TO BE OMITTED.       * 00229200
.*                                                                    * 00236000
.*               D1=(N) IS A KEYWORD PARAMETER THAT SPECIFIES THE     * 00238000
.*               FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE       * 00240000
.*               FIRST 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.  * 00242000
.*               N CAN BE A NUMBER FROM 0 - 6.  IF N IS 0 OR 4 OR     * 00244000
.*               IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.  * 00246000
.*               IF N IS 1, 2, 3, 5, OR 6, THE CORRESPONDING FORMAT   * 00248000
.*               OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB    * 00250000
.*               FORMAT CAN BE MAPPED IN THE FIRST 140 BYTE DSCB      * 00252000
.*               AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.     * 00254000
.*                                                                    * 00256000
.*               D2=(N) IS A KEYWORD PARAMETER THAT SPECIFIES         * 00256800
.*               THE FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE   * 00257600
.*               SECOND 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO  * 00258400
.*               N CAN BE A NUMBER FROM 0 - 6.  IF N IS 0 OR 4 OR     * 00259200
.*               IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.  * 00260000
.*               IF N IS 1, 2, 3, 5, OR 6, THE CORRESPONDING FORMAT   * 00260800
.*               OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB    * 00261600
.*               FORMAT CAN BE MAPPED IN THE SECOND 140 BYTE DSCB     * 00262400
.*               AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.     * 00263200
.*                                                                    * 00264000
.*               ADT=YES IS A KEYWORD PARAMETER WHICH SPECIFIES THAT  * 00267000
.*               THE LABELS FOR EACH OF THE FIELDS WITHIN THE 8   @L7C* 00270000
.*               WORD DADSM AUDIT TRAIL ARE TO BE EXPANDED.           * 00273000
.*                                                                    * 00276000
.*               LABELS=YES IS A KEYWORD PARAMETER WHICH SPECIFIES    * 00276600
.*               THAT LABELS FOR IECIEXPL, IECVRFWA, ICVAFPL, AND     * 00277200
.*               ICVAFBFL MACROS WILL BE PRESENT.  IF LABELS=NO IS    * 00277800
.*               SPECIFIED, NO LABELS WILL BE PRESENT FOR THOSE       * 00278400
.*               MACROS.                                              * 00279000
.*                                                                    * 00280000
.*     OUTPUT = DADSM ALLOCATE WORK AREA EXPANSION                    * 00282000
.*                                                                    * 00284000
.*EXIT-NORMAL = MEND STATEMENT                                        * 00286000
.*                                                                    * 00288000
.*EXIT-ERROR = ERROR MESSAGES:                                        * 00292000
.*                                                                    * 00296000
.* MNOTE 12,***  IHB002 INVALID EP OPERAND SPECIFIED-&EP              * 00297500
.* MNOTE 12,***  IHB002 INVALID F4 OPERAND SPECIFIED-&F4              * 00299000
.* MNOTE 12,***  IHB002 INVALID ADT OPERAND SPECIFIED-&ADT            * 00300500
.*                                                                    * 00302000
.*     THE MACRO EXPANSION CONTINUES AS IF THE INVALID PARAMETER      * 00303300
.*     WERE NOT SPECIFIED.                                            * 00304600
.*                                                                    * 00306000
.*EXTERNAL REFERENCES = NONE                                          * 00308000
.*                                                                    * 00310000
.*     ROUTINES = NONE                                                * 00312000
.*                                                                    * 00314000
.*     DATA AREAS = ALLOCATE WORK AREA                                * 00316000
.*                                                                    * 00318000
.*     CONTROL BLOCKS = DSCB, ECB, IOB, DCB, DEB                      * 00320000
.*                                                                    * 00322000
.*TABLES = NONE                                                       * 00331000
.*                                                                    * 00340000
.*MACROS = IECDSECS DSMADT                                            * 00340900
.*         IECDSECS PREFX                                             * 00341800
.*         IECSDSL1                                                   * 00342700
.*         IHBERMAC                                                   * 00343600
.*         IECIEXPL                                                   * 00344500
.*         IECVRFDA                                                   * 00345400
.*         ICVAFPL                                                    * 00346300
.*         ICVAFBFL                                                   * 00347200
.*         IOSDIOBE                 set indicators for EXCP        @10A 00347600
.*                                                                    * 00348100
.*CHANGE ACTIVITY =                                                   * 00349000
.*$L1=IXVTOC,JDM1134,T790227,STLBS: INDEXED VTOC SUPPORT           @L1A 00350900
.*$L2=MVS/XA,JDP1111,STLBS:         REALLOC INTERFACE SUPPORT      @L2A 00359900
.*$L3=MVS/XA,JDP1111,STLBS:         SAF/RACF ALWAYS CALL SUPPORT   @L3A 00368900
.*                           (REQUIRED REMOVAL OF OZ67804 FIX)     @L3A 00377900
.*$L4=MVS/XA,HDP2210,,STLAM:        REALLOC ALLOC=ABS SUPPORT      @L4A 00382400
.*$L5=MVS/XA,HDP2230,T85052,STLMC:  DADSM VSCR                     @L5A 00384600
.*$P1=KPZ0135,HDP2230,T85238,STLMC: SUPPORT CONTAMINATED 24-BIT    @P1A 00385300
.*                                  PARAMETER ADDRESSES            @P1A 00386000
.*$L6=MVS/XA,HDP3310,T86212,STLKAA: DADSM SUPPORT FOR SMS          @L6A 00386400
.*$P2=KJA0755,HDP3310,T86275,STLKAA: ALLOCATE 'N' LARGEST EXTENTS  @P2A 00386500
.*$P3=KJA0756,HDP3310,T86292,STLKAA: COMPACT SAVED SECONDARY QTY   @P3A 00386600
.*$P4=KJA1208,HDP3310,T87015,STLKAA: USE BLKSIZE TO CALCULATE SPACE@P4A 00386700
.*$P5=KJA2136,HDP3310,T87079,STLKAA: DACMINES PROHIBITED WHEN MXIG @P5A 00389000
.*                                   OR ALX REQUEST                @P5A 00391300
.*$P6=KJA2737,HDP3310,T87159,STLKAA: SYSTEM DETERMINED BLOCKSIZE   @P6A 00392400
.*                                                                    * 00393600
.*$P7=KJB5053,HDP3310,T88236,STLKSC: HSM EXTENT REDUCTION PROB.    @P7A 00394100
.*                                   SUPPORT USABLE DATA QUANTITY  @P7A 00394600
.*                                   REQUESTS.                     @P7A 00395100
.*$01=OY20175,HDP3310,T89089,NSDRPS: PRE-EXIT FAILS TO GET CALLED  @01A 00395300
.*$L7=DYNAMIC,HDP3330,T890828,SJPLJDY: DYNAMIC I/O CONFIGURATION   @L7A 00395400
.*$02=OY26551,HDP3320,T90080,NSDRPS: PDS GET WRONG AMOUNT OF SPACE @02A 00395600
.*                                   WHEN AVG. BLK LENGTH 0        @02A 00395800
.*$P8=KC10879,HDP3330,T900921,SJPLJDY: ENSURE ALIGNMENT OF DSMADT  @P8A 00405800
.*$03=OY38616,HDP3330,90288,SJPLKSC:SUPPORT CONDITIONAL            @03A 00415800
.*                                  ACQUISITION OF VTOC ENQ.       @03A 00425800
.*$04=OY41248,HDP3330,910409,SJPLKSC:CONSISTENCY FOR BLK           @04A 00428300
.*                                   ALLOCATIONS WHICH SPECIFY ZERO@04A 00430800
.*                                   AVERAGE BLOCK LENGTH.         @04A 00433300
.*$L8=EMPTYDS,JDZ1110,T920101,SJPLJEB: EMPTY DATA SET RECOGNITION  @L8A 00433800
.*$L8=64KTRACK,JDZ1110,T920312,SJPLKSC:DADSM SUPPORT FOR DASD WITH @L8A 00433900
.*                                   MORE THAN 64K TRACKS          @L8A 00434000
.*$05=OW02629,HDZ11B0,940221,SJPLRLC: EXPOSURE WITH MODEL PROFILE  @05A 00434100
.*                                     FIN APAR OY56678 - K120268  @05A 00434200
.*$06=OW08345,HDZ11B0,940921,SJPLRLC: 64K FREE DSCB SUPPORT        @06A 00434400
.*$07=OW06230,HDZ11B0,95May12,SJPLRLC:Overallocation of compressed @07A 00434500
.*                                   data set                      @07A 00434600
.*$08=OW15396,HDZ11B0,95Sep22,SJPLGAP:Use 1/2 track - 32 bytes     @08A 00434700
.*                               blocksize for compressed SAM DS   @08A 00434800
.*$09=OW16158,HDZ11C0,951006,SJPLKSC: DUMP BROKEN VTOC             @09A 00434900
.*$10=OW34136,HDZ11D0,98Jul01,SJPLRPS: Fiber channel io support    @10A 00435000
.*    NOTE: if Create gets changed to no longer issue EXCP,        @10A 00435100
.*          the code added by this apar should be removed.         @10A 00435200
.*                                                                    * 00435300
.*       NOTE: THIS IS A BILIGUAL MACRO                               * 00435400
.*             MAKE UPDATES IN BOTH ASM AND PLAS                      * 00435500
.*                                                                    * 00435800
.*** END OF SPECIFICATIONS ******************************************** 00445800
         LCLA  &C                                                       07150000
&LABEL   DSECT                                                          07200000
ALLPREFX DS    0CL32                    WORK AREA PREFIX                07250000
         DS    8F        DIMENSION=(8)                                  07483200
         SPACE 1                                                        07500000
ALLSTART DS    0CL2107                                                  07503500
ALLEXTPR DS    0CL80                    EXTENDED PREFIX                 07507000
         DS    20F       DIMENSION=(20)                                 07510500
ALLWTGTB DS    0CL16                    DADSM WTG TABLE                 07514000
         DS    4F        DIMENSION=(4)                                  07517500
ALLDIAGX DS    0F                       DIAGNOSTIC INFORMATION          07521000
ALLERCDX DS    XL1                      ERROR CODE                      07524500
ALLSFIDX DS    XL1                      SUBFUNCTION ID                  07528000
ALLSFRTX DS    XL1                      SUBFUNCTION RETURN CODE         07531500
ALLSFRSX DS    XL1                      SUBFUNCTION REASON CODE         07535000
ALLEXTPT DS    A                        POINTER TO WORK AREA EXTENT     07538500
ALLADTPT DS    A                        POINTER TO AUDIT TRAIL          07542000
ALLXCPPT DS    A                        POINTER TO EXCP WORK AREA       07545500
*********************************************************************** 07550000
*        REQUEST INFORMATION                                          * 07600000
*********************************************************************** 07650000
ALLREQST DS    CL64                     REQUEST INFORMATION             07650800
         AIF   ('&NRQ' EQ 'NRQ').ALL0005                                07651600
         ORG   ALLREQST                                                 07652400
ARQBREPL DS    A                        BRANCH ENTRY PARAMETER LIST     07653000
ARQPLEXT DS    A                        PARAMETER LIST EXTENSION PTR    07653600
ARQRETPT DS    A                        PARAMETER LIST RETURN AREA      07654200
ARQCNTLB DS    A                        JFCB OR PDSCB ADDRESS           07654800
ARQDSABP DS    A                        DSAB LIST ADDRESS               07655400
ARQFLG01 DS    XL1                      REQUEST FLAG BYTE               07656000
AR1CYL   EQU   B'10000000'              CYLINDER SPACE REQUEST          07656600
AR1TRK   EQU   B'01000000'              TRACK SPACE REQUEST             07657200
AR1AVR   EQU   B'00100000'              AVERAGE BLOCK REQUEST           07657800
AR1BYTRQ EQU   B'00010000'              REQUEST IN BYTES                07658400
ARQFLG02 DS    XL1                      REQUEST FLAG BYTE               07659000
AR2CONTG EQU   B'00001000'              CONTIGUOUS REQUEST              07659600
AR2MXIG  EQU   B'00000100'              MXIG REQUEST               @P5C 07660200
AR2ALX   EQU   B'00000010'              ALX REQUEST                     07660800
AR2ROUND EQU   B'00000001'              ROUND TO CYLINDER BOUNDARY      07661400
ARQFLG03 DS    XL1                      REQUEST FLAG BYTE               07662000
AR3RCHBP EQU   B'10000000'              RACHECK BYPASS                  07662600
AR3RDFBP EQU   B'01000000'              RACDEF BYPASS                   07663200
AR3DSCRT EQU   B'00100000'              BUILD DISCRETE RACF PROFILE     07663800
AR3SECMP EQU   B'00010000'              SECURITY MODEL PROFILE REQUEST  07664400
AR3GENMP EQU   B'00001000'              SECURITY MODEL IS A GENERIC    X07665000
                                        PROFILE                         07665600
ARQFLG04 DS    XL1                      REQUEST FLAG BYTE               07666200
AR4ABSTR EQU   B'10000000'              ABSTR SPACE REQUEST             07666800
AR4VIODS EQU   B'01000000'              CREATE A VIO DATA SET           07667400
AR4ZPQTY EQU   B'00100000'              ZERO PRIMARY QUANTITY           07668000
AR4DIRBK EQU   B'00010000'              DIRECTORY BLOCK REQUEST         07668600
AR4USRLB EQU   B'00001000'              USER LABER EXTENT REQUIRED      07669200
AR4LASTV EQU   B'00000100'              LAST VOLUME ON WHICH DATA SET  X07669800
                                        RESIDES                         07670400
AR4LRGEX EQU   B'00000010'              ALLOCATE 'N' LARGEST EXTENTS   X07670600
                                        <= PRIMARY QUANTITY        @P2A 07670800
AR4UDQR  EQU   B'00000001'              USABLE DATA QTY. REQUEST.  @P7A 07670900
ARQSCBYT DS    F                        SECONDARY QUANTITY IN KILOBYTES 07671000
ARQKEYLE DS    XL1                      KEY LENGTH                      07671600
ARQNUMXT DS    F                        NUMBER OF EXTENT POSSIBLE FOR  X07672200
                                        DATA SET ORGANIZATION           07672800
ARQVOLSQ DS    XL1                      VOLUME SEQUENCE NUMBER          07673400
ARQAVGRC DS    XL1                      AVGREC VALUE SPECIFIED          07674000
ARQAVGUB EQU   B'10000000'              SPACE IN BYTES                  07674600
ARQAVGKB EQU   B'01000000'              SPACE IN KILOBYTES              07675200
ARQAVGMB EQU   B'00100000'              SPACE IN MEBABYTES              07675800
ARQPRQTY DS    F                        PRIMARY SPACE REQUEST           07676400
ARQSCQTY DS    F                        SECONDARY SPACE REQUEST         07677000
ARQAVBLN DS    F                        AVERAGE DATA BLOCK LENGTH       07677600
ARQMINES DS    F                        MINIMUM EXTENT SIZE             07678200
ARQDRQTY DS    F                        DIRECTORY BLOCK QUANTITY        07678800
ARQABSVL DS    F                        ABSOLUTE TRACK VALUE       @L8C 07679400
ARQDSSNM DS    CL6                      OLD VOLUME SERIAL               07680000
         DS    0F                       RESERVED                   @L8A 07680300
ARQSECMA DS    A                        ADDR OF SECURITY MODEL PROFILE  07680600
.ALL0005 ANOP                                                           07685200
*********************************************************************** 07686000
*        INTERNAL PROCESSING FLAGS                                    * 07686800
*********************************************************************** 07687600
ALLFLG01 DS    0XL1                     REQUEST FLAG BYTE               07688400
RAFLAG   DS    XL1                      REALLOC FLAG BYTE               07689200
RAFABS   EQU   B'10000000'              REALLOC ALLOC=ABS REQUEST       07690000
RAF2DSCB EQU   B'01000000'              F2DSCB SPECIFIED                07690800
RAF3DSCB EQU   B'00100000'              F3DSCB SPECIFIED                07691600
RAFVTOCE EQU   B'00010000'              REALLOC VTOCENQD REQUEST   @03A 07691800
RAFRSRV1 EQU   B'00001111'              RESERVED.                  @03A 07692000
ALLFLG02 DS    0XL1                     FLAG BYTE (ADSFLAG)             07692400
ADSFLAG  DS    XL1                      ALLOCATE DASD SWITCH FLAG       07693200
IXVTOC   EQU   B'10000000'              INDEXED VTOC EXISTS             07694000
PREEXIT  EQU   B'01000000'              PRE EXIT TAKEN                  07694800
IVRFDATA EQU   B'00100000'              VRF DATA EXISTS                 07695600
NEEDF3   EQU   B'00010000'              NEED AN F3 DSCB                 07696400
NEEDF2   EQU   B'00001000'              NEED AN F2 DSCB                 07697200
AL64KTPV EQU   B'00000100'              DATA SET IS RESTRICTED TO  @L8A 07697300
*                                       64K-1 TRACKS ALLOCATED PER @L8A 07697400
*                                       VOLUME                     @L8A 07697500
ALCYLAL  EQU   B'00000010'              DATA SET REQUIRES CYLINDER @L8A 07697600
*                                       ALIGNED EXTENTS            @L8A 07697700
ALLFLG03 DS    XL1                      FLAG BYTE                       07698000
AL3RCHK  EQU   B'10000000'              ISSUE RACHECK                   07698800
AL3RAVL  EQU   B'01000000'              ISSUE RACDEF TYPE=ADDVOL        07699600
ALLFLG04 DS    0XL1                     FLAG BYTE (ASWITCH)             07700400
ASWITCH  DS    XL1                      ALLOCATE SWITCH                 07701200
WRZERO   EQU   B'10000000'              WRITE F0 DSCB                   07702000
RCDALT   EQU   B'01000000'              FS DSCB HAS BEEN MODIFIED       07702800
PRCNTL   EQU   B'00100000'              PROCESS CONTROL SWITCH          07703600
WRTFNL   EQU   B'00010000'              WRITE FINAL FS DSCB TO VTOC     07704200
FRSTFS   EQU   B'00001000'              FIRST FS DSCB IN ALFSDSCB       07704800
NEWFS    EQU   B'00000100'              NEW FS DSCB HAS BEEN BUILT      07705400
DADBYP   EQU   B'00000010'              BYPASS UPDATING DT2EDT02 PTR    07706000
OUTBYP   EQU   B'00000001'              BYPASS UPDATING OUTPUT          07706600
*                                       FREE-SPACE DSCB CHAIN PTR       07707200
ALLFLG05 DS    0XL1                     FLAG BYTE (ACNVSW)              07708400
ACNVSW   DS    XL1                      ADDITIONAL SWITCHES             07709200
BYPF4WRT EQU   B'10000000'              BYPASS F4 DSCB WRITE            07710000
AI7CNTRL EQU   B'01000000'              IGG032I7 ENTRY CONTROL          07710800
AFSZERO  EQU   B'00100000'              FS DSCB WITH NO EXTENT ENTRIES X07711600
                                        EXISTS ON VTOC                  07712400
LSTFSIN  EQU   B'00010000'              ON = THE LAST DSCB IN THE       07712900
*                                       FREE-SPACE CHAIN HAS BEEN       07713400
*                                       READ                            07713900
LSTFSOUT EQU   B'00001000'              ON = THE OUTPUT FS AREA        X07714400
                                        CONTAINS THE LAST FS DSCB      X07714900
                                        TO BE WRITTEN                   07715400
ALLFLG06 DS    XL1                      FLAG BYTE                  @P3A 07716500
AR6SCCP1 EQU   B'10000000'              SECONDARY QTY IN BYTES WAS     X07716600
                                        COMPACTED ONCE             @P3A 07716700
AR6SCCP2 EQU   B'01000000'              SECONDARY QTY IN BYTES WAS     X07716800
                                        COMPACTED TWICE            @P3A 07716900
AR6CRSDB EQU   B'00100000'              CREATE ORIGINATED BLOCKSIZE    X07717000
                                                                   @P6A 07717100
         DS    XL1                      FLAG BYTE (RESERVED)       @P3C 07717400
SAVERRID DS    XL1                      SAVED SUBFUNCTION ID            07717500
*********************************************************************** 07718000
*        SAVE AREA FOR BRANCH ENTRY MODULE REGISTERS                  * 07718800
*********************************************************************** 07719600
BRESAVE  DS    0CL56                    SAVE AREA                       07720400
         DS    14F       DIMENSION=(14)                                 07721200
*********************************************************************** 07722000
*        THE FOLLOWING CONTROL BLOCKS ARE USED TO READ AND WRITE      * 07722800
*        DSCBS                                                        * 07723600
*        IT IS ALSO USED IN IGG0CLF2 TO FORMAT DIRECTORY BLOCKS    @L8A 07723800
*        AND TO WRITE THE EOF MARK FOR CERTAIN DATA SETS           @L8A 07724000
*********************************************************************** 07724400
         DS    0D                       DOUBLE-WORD ALIGNMENT           07724800
EXCPWKA  DS    0CL224                   EXCP WORK AREA                  07725200
DEB      DS    0CL48                    DEB                             07726000
XDEBTCBA DS    A                        TCB ADDRESS                     07726800
DCB      DS    0CL28                    DCB                             07727600
         DS    CL20                                                     07728400
XDEBDCBA DS    A                        DCB ADDRESS                     07729200
XDEBAPPA DS    A                        I/O APPENDAGE VECTOR TABLE      07730000
XDEBUCBA DS    A                        UCB ADDRESS                     07730800
         DS    CL2                                                      07731600
XDEBSTEX DS    CL4                      START OF EXTENT LIMIT           07732400
         DS    CL6                                                      07733200
DEBPTR   DS    A                        DCB POINTER TO DEB              07734000
ECB      DS    F                        ECB                             07734800
ECBNORM  EQU   B'01111111'              NORMAL I/O OPERATION            07735600
IOB      DS    0CL32                    IOB                             07736400
         DS    CL2                                                      07737200
XIOBSENS DS    CL2                      IOB SENSE BYTES                 07738000
XIOBECBP DS    A                        IOB ECB ADDRESS                 07738800
XIOBCSW  DS    0CL8                     IOB CHANNEL STATUS WORD         07739600
         DS    CL5                                                      07740400
XIOBCHST DS    CL1                      IOB CHANNEL STATUS BYTE         07741200
         DS    CL2                                                      07742000
XIOBSTRT DS    A                        IOB CHANNEL PROGRAM START       07742800
         DS    CL12                                                     07743600
SEEK     DS    CL8                      IOB SEEK ADDRESS                07744400
         ORG   SEEK                     IOB SEEK ADDRESS           @L8A 07744500
SEEKM    DS    XL1                      -   M                      @L8A 07744600
SEEKBB   DS    XL2                      -    BB                    @L8A 07744700
SEEKCCHH DS    0XL4                     -       CCHH               @L8A 07744800
SEEKCCHHR DS   0XL5                     -       CCHHR              @L8A 07744900
SEEKCC   DS    XL2                      -       CC                 @L8A 07745000
SEEKHH   DS    XL2                      -         HH               @L8A 07745100
SEEKR    DS    XL1                      -           R              @L8A 07745200
MBBCCHHR DS    CL8                      VTOC ADDRESS                    07745300
*********************************************************************** 07746000
*        COMMON ALLOCATE CHANNEL CONTROL WORDS AREA                   * 07746800
*********************************************************************** 07747600
CHANPRGM DS    0CL120                   CHANNEL PROGRAM                 07748400
CCW1     DS    CL8                                                      07749200
CCW2     DS    CL8                                                      07750000
CCW3     DS    CL8                                                      07750800
CCW4     DS    CL8                                                      07751600
CCW5     DS    CL8                                                      07752400
CCW6     DS    CL8                                                      07753200
CCW7     DS    CL8                                                      07754000
CCW8     DS    CL8                                                      07754800
CCW9     DS    CL8                                                      07755600
CCW10    DS    CL8                                                      07756400
CCW11    DS    CL8                                                      07757200
CCW12    DS    CL8                                                      07758000
CCW13    DS    CL8                                                      07758800
CCW14    DS    CL8                                                      07759600
CCW15    DS    CL8                                                      07760400
*********************************************************************** 07761200
*        COMMON ALLOCATE DSCB AREAS                                   * 07762000
*********************************************************************** 07762800
ALLDSCB4 DS    CL96                     COMMON ALLOCATE FORMAT 4 DSCB  X07763600
                                        AREA                            07764400
ALLDSCB1 DS    CL140                    COMMON ALLOCATE FORMAT 1 DSCB  X07765200
                                        AREA                            07766000
DADSMADR DS    CL8                      CCHHR OF FIRST FREE-SPACE       07767100
*                                       DSCB                            07767200
ALFSDSCB DS    0CL140                   COMMON ALLOCATE 140 BYTE DSCB  X07767800
                                        AREA                            07768400
FSIN     DS    CL140                                                    07769200
ALLFSWKA DS    0CL140                   COMMON ALLOCATE 140 BYTE DSCB   07770000
FSKEYID  DS    CL4                      AREA                            07770800
FSDATA   DS    0CL136                                                   07771600
FSEXTNT1 DS    0CL40                                                    07772400
         DS    CL25                                                     07773200
FSOUT    DS    CL15                                                     07773400
FSFMTID  DS    CL1                                                      07773600
FSEXTNT2 DS    CL90                                                     07773800
FSPTRDS  DS    CL5                                                      07774000
         ICVEDT02 ENTRY=26,             NEW FORMAT EDT, 26 ENTRIES @L8AX07774300
               DT2PRE=FSI,              FREE-SPACE INPUT (FSI) EDT @L8AX07774600
               DSECT=NO                 NO DSECT                   @L8A 07774900
&LABEL   DSECT                                                          07775200
         ICVEDT02 ENTRY=26,             NEW FORMAT EDT, 26 ENTRIES @L8AX07775500
               DT2PRE=FSO,              FREE-SPACE OUTPUT (FSO) EDT@L8AX07775800
               DSECT=NO                 NO DSECT                   @L8A 07776100
&LABEL   DSECT                                                          07776400
*********************************************************************** 07777200
*        VRF DATA AREA - SEE MACRO IECVRFDA                           * 07778000
*********************************************************************** 07778800
ALLVRFDA DS    0CL1616                                                  07792200
         AIF   ('&LABELS' EQ 'NO').NOLAB GO GENERATE WITH NO LABELS@L1A 07805700
*        IECVRFDA DSECT=NO,FUNCT=ALLOCATE EXPAND VRF DATA AREA     @L1A 07805800
         IECVRFDA DSECT=NO,FUNCT=ALLOCATE                          @L1A 07805900
         AGO      .VRFEND                                          @L1A 07806000
.NOLAB   ANOP                                                      @L1A 07806100
*        IECVRFDA DSECT=NO,FUNCT=ALLOCATE,LABELS=XXX  NO LABELS    @L1A 07806200
         IECVRFDA DSECT=NO,FUNCT=ALLOCATE,LABELS=XXX               @L1A 07806300
.VRFEND  ANOP                                                      @L1A 07806400
*********************************************************************** 07806500
* WORKAREA USED BY MACRO IGGDADTS                                     * 07806600
*********************************************************************** 07806700
ALLDTSWA DS    CL40                     WORK-AREA USED BY MACRO    @L8A 07806800
*                                       IGGDADTS.                  @L8A 07806900
*********************************************************************** 07807000
*        TRKCALC PARAMETER LIST                                       * 07807100
*********************************************************************** 07807600
STARMAP  DS    CL12                                                     07809200
*********************************************************************** 07810000
*        PRE/POST EXIT PARAMETER LIST                                 * 07810800
*********************************************************************** 07811600
ALLIEXPL DS    CL56                                                     07812400
*********************************************************************** 07813200
*        CVAF PARAMETER LIST                                          * 07814000
*********************************************************************** 07814800
ALLCVPL  DS    CL68                                                     07815600
*********************************************************************** 07816400
*        CVAF BUFFER LIST                                             * 07817200
*********************************************************************** 07818000
ALLBFHDR DS    CL8                                                      07818800
ALLBFLE  DS    CL12                                                     07819600
*********************************************************************** 07820400
*        PARAMETER LIST AND PARAMETERS USED BY RESERVE/ENQ/DEQ        * 07821200
*********************************************************************** 07822000
ENQAREA  DS    0CL16                    ENQUEUE PARAMETER LIST          07822800
DEQAREA  DS    CL16                     DEQUEUE PARAMETER LIST          07823600
MJELNAME DS    CL8                      MAJOR ELEMENT NAME              07824400
MIELNAME DS    CL6                      MINOR ENQ/DEQ RESOURCE NAME     07825200
         DS    CL2                      RESERVED                        07826000
*********************************************************************** 07826800
*        WORK AREA FIELDS USED BY THE VTOC CONVERSION ROUTINES        * 07827600
*********************************************************************** 07828400
         DS    0F                                                  @L8A 07828800
VTCSTART DS    0CL112                   VTOC CONVERT WORK AREA     @L8C 07829200
EXEOVPTR DS    F                        EXTEND EOV POINTER              07830000
EXDEBPTR DS    F                        EXTEND DEB POINTER              07830800
EXWKAPTR DS    F                        EXTEND WORK AREA POINTER        07831600
NEXTEXTN DS    F                        POINTER TO NEXT EXTENT          07832400
LASTFSAD DS    F                        ADDRESS OF LAST REBUILT FS      07833200
VTCFLG01 DS    XL1                      VTC FLAG BYTE                   07834000
VT1EXTID EQU   B'10000000'              VTOC CONVERSION ENTERED FROM   X07834800
                                        EXTEND                          07835600
VT1ALLID EQU   B'01000000'              VTOC CONVERSION ENTERED FROM   X07836400
                                        ALLOCATE                        07837200
VT1DIRFB EQU   B'00100000'              VTOC CONVERSION ENTERED        X07838000
                                        BECAUSE DIRF BIT WAS SET        07838800
VT1EOVSW EQU   B'00010000'              LAST DSCB IN VTOC HAS BEEN     X07839600
                                        READ                            07840400
VT1SPLCL EQU   B'00001000'              SPLIT CYLINDER EXTENT FOUND     07841200
* RESERVED     B'00000100'              RESERVED                   @L8C 07841800
VT1GT64K EQU   B'00000010'              >=64 TRACKS ON THE VOLUME       07842400
VTCFLG02 DS    XL1                      WORK AREA FOR CHECKING VTOCI   X07843000
                                        BITS FROM F4 DSCB          @L8A 07843600
         DS    CL2                      VTC FLAG BYTE (RESERVED)   @L8C 07844200
FSFNDCT  DS    H                        NUMBER OF FREE SPACE DSCBS     X07844800
                                        FOUND WHILE SEARCHING THE VTOC  07845400
MAXTRK   DS    H                        MAXIMUM TRACKS/CYLINDER         07846000
FSBLDCT  DS    H                        NUMBER OF REBUILT FREE SPACE   X07846600
                                        DSCBS                           07847200
         DS    H                        RESERVED                   @LXC 07847800
CCHHXTNT DS    CL4                      OVERLAPPING EXTENT 'CCHH'       07848400
PREVFSAD DS    CL5                      VIRTUAL ADDRESS OF PREVIOUS    X07849200
                                        FREE SPACE DSCB                 07850000
CCHHENX  DS    CL4                      2ND CCHH OF BAD F1/F3 EXT. @L8C 07850500
         DS    CL1                                                 @L8A 07851000
CCHHDSCB DS    CL5                      'CCHHR' OF CCHHXTNT DSCB        07851600
VCCHHR1  DS    CL5                      STARTING DSCB FOR TABLE         07852400
VCCHHR2  DS    CL5                      CCHHR OF F4 DSCB                07853200
         DS    CL1                      SKIP ONE BYTE              @L8C 07853500
EOVCCHH  DS    0CL4                     CCHH OF EOV                @L8A 07853800
EOVCC    DS    H                          CC OF EOV                @L8A 07854100
EOVHH    DS    H                          HH OF EOV                @L8A 07854400
VCCHHR4  DS    CL5                      CURRENT DSCB                    07854800
VCCHHR5  DS    CL5                      NEXT DSCB                       07855600
CURRWKAE DS    A                        -> EXTENSION OF WORKAREA   @L8C 07856100
         DS    X                        SKIP ONE BYTE              @L8A 07856600
VCCHHR7  DS    CL5                      2ND DSCB IN VTOC (F5)           07857200
         DS    CL2                      RESERVED                        07858000
VTCWKARA DS    F                        ROOT OF WORKAREA EXTENSION     X07858100
                                        CHAIN                      @L8A 07858200
VTCMAXCT DS    F                        NUMBER OF EXTENTS PER FREE     X07858300
                                        SPACE DSCB                 @L8A 07858400
VTCRTAS  DS    0XL8                     8 BYTE RTA1/RTA2 FOR TARGET OF X07858500
                                        IGGDAEDS CALLS             @L8A 07858600
VTCRTA1  DS    XL4                        RTA OF START OF EXTENT   @L8A 07858700
VTCRTA2  DS    XL4                        RTA+1 OF END OF EXTENT   @L8A 07858800
VTCRTAT  DS    XL8                      IGG0325R EXPND WORK AREA   @L8A 07858900
*********************************************************************** 07859000
*        TEMPORARY REGISTER SAVE AREAS                                * 07859600
*********************************************************************** 07860400
RETNREG  DS    F                        SAVE RETURN REGISTER            07861200
SAVEREGS DS    0CL64                    WORKAREA SAVE REGS AREA         07862000
SAVEREG0 DS    F                        WORKAREA SAVE REG0 AREA         07862800
SAVEREG1 DS    F                        WORKAREA SAVE REG1 AREA         07863600
SAVEREG2 DS    F                        WORKAREA SAVE REG2 AREA         07864400
SAVEREG3 DS    F                        WORKAREA SAVE REG3 AREA         07865200
SAVEREG4 DS    F                        WORKAREA SAVE REG4 AREA         07866000
SAVEREG5 DS    F                        WORKAREA SAVE REG5 AREA         07866800
SAVEREG6 DS    F                        WORKAREA SAVE REG6 AREA         07867600
SAVEREG7 DS    F                        WORKAREA SAVE REG7 AREA         07868400
SAVEREG8 DS    F                        WORKAREA SAVE REG8 AREA         07869200
SAVEREG9 DS    F                        WORKAREA SAVE REG9 AREA         07870000
SAVEREGA DS    F                        WORKAREA SAVE REGA AREA         07870800
SAVEREGB DS    F                        WORKAREA SAVE REGB AREA         07871600
SAVEREGC DS    F                        WORKAREA SAVE REGC AREA         07872400
SAVEREGD DS    F                        WORKAREA SAVE REGD AREA         07873200
SAVEREGE DS    F                        WORKAREA SAVE REGE AREA         07874000
SAVEREGF DS    F                        WORKAREA SAVE REGF AREA         07874800
*********************************************************************** 07875600
*        INTERNAL PROCESSING WORK AREA                                * 07876400
*********************************************************************** 07877200
ALLSPCRQ DS    CL32                     CVAF VOLUME SPACE TABLE         07878000
ATIOTPTR DS    A                        POINTER TO DD ENTRY IN TIOT     07878800
ALLULTRK DS    0CL8                     USER LABEL TRACK (RTA/RTA+1)    07879100
*                                                                  @L6C 07879400
ULRTA    DS    F                        USER LABEL TRACK RTA       @L6A 07879700
ULRTA1   DS    F                        USER LABEL TRACK RTA+1     @L6A 07880000
DS4_NO_DSCBS DS 0F                      NUMBER OF F0 DSCBS IN THE  @06A 07880100
*                                       VTOC. USED BY THE CONVERT  @06A 07880200
*                                       ROUTINES TO CALCULATE VALUE@06A 07880300
FULLWORD DS    0CL4                     FULLWORD                   @L6C 07880400
HALFWRD1 DS    H                        HALFWORD                   @L6A 07880600
HALFWRD2 DS    H                        HALFWORD                   @L6A 07880900
DSSIZE   DS    F                        DATA SET SIZE                   07881200
EXTSIZE  DS    F                        MINIMUM ALLOCATION UNIT         07882000
HOWMUCH  DS    F                        TOTAL PRIMARY QUANTITY          07882800
SLOWCCHH DS    0F                       CCHH OF THE DIRECTORY EXTENT    07883600
DIRQTY   DS    H                        EMBEDDED INDEX QUANTITY         07884400
PRIQTY   DS    H                        PRIMARY QUANTITY ON THIS       X07885200
                                        VOLUME                          07886000
*                                                                 1@L8D 07886800
UHOLECTR DS    H                        NUMBER OF USED F0 DSCBS         07887600
F3REQD   DS    H                        NUMBER OF F3 DSCBS REQUIRED     07888400
F3DSCBS  DS    H                        NUMBER OF F3 DSCBS F3RTN        07889200
PSPLITS  DS    H                        # OF POSSIBLE EXTENT SPLITS     07890000
CCHHRTBL DS    0CL52                    TABLE OF CCHHR'S FOR FREE  @L8CX07890600
                                        SPACE DSCB'S TO BE WRITTEN     X07891200
                                        TO.                             07891800
CCHHRCNT DS    H                        # OF ENTRIES IN CCHHRTBL        07892400
CCHHRTOP DS    CL50                     FIRST ENTRY IN CCHHRTBL         07893200
VTOCADR  DS    CL5                      F4 DSCB CCHHR                   07894000
TTRLL    DS    0CL5                     TTRLL FOR ALLOCATES F1 DSCB,   X07894800
                                        F2 DSCB CCHHR FOR ISAM         X07895600
                                        ALLOCATE                        07896400
CCHHR    DS    CL5                      CCHHR OF F1 DSCB                07897200
COUNT    DS    0CL5                     CHANNEL PROGRAM WORK AREA       07898000
IDAREA   DS    CL5                      CHANNEL PROGRAM WORK AREA       07898800
FMTINAD  DS    0CL5                     CHANNEL PROGRAM WORK AREA       07899600
SAVEADR  DS    CL5                      F1 DSCB CCHHR FOR ISAM         X07900400
                                        ALLOCATE                        07901200
FMTOUTAD DS    CL5                      CHANNEL PROGRAM WORK AREA, F3  X07902000
                                        DSCB CCHHR FOR ISAM ALLOCATE    07902800
ALLCCHHR DS    CL5                      CCHHR HOLD AREA                 07903600
CCHHRSAV DS    CL5                      CCHHR SAVE AREA                 07904400
ADRFSIN  DS    CL5                      CCHHR OF THE NEXT FS DSCB      X07905200
                                        DSCB TO READ                    07906000
ADRFSOUT DS    CL5                      CCHHR OF THE NEXT FS DSCB      X07906800
                                        DSCB TO WRITE                   07907600
*********************************************************************** 07908400
* THE FOLLOWING DEFINE THE EXTENT TYPE VALUES.  THE EXTENT              07909200
* TYPE IS THE FIRST BYTE OF EXTENT DESCRIPTORS IN F1, F3 AND F4         07910000
* DSCBS.                                                                07910800
*********************************************************************** 07911600
XTNTYPE  DS    XL1                      EXTENT TYPE INDICATOR BYTE @L6C 07912400
XSHARCYL EQU   B'10000000'              EXTENT IS SHARING CYLINDER      07913200
XUSERLBL EQU   B'01000000'              EXTENT IS USER LABEL            07914000
XISAMIDX EQU   B'00000100'              EXTENT IS ISAM INDEX            07914800
XISAMOVF EQU   B'00000010'              EXTENT IS ISAM OVERFLOW         07915600
XUSERDAT EQU   B'00000001'              EXTENT IS USER DATA             07916400
VOLCNT   DS    XL1                      VOLUME COUNT, ISAM ONLY    @L6C 07917200
         SPACE 2                                                        07918800
ALLEXTNT DSECT                                                          07919600
ALLRMAIN DS    0CL1672                  ALLOCATE WORK AREA EXTENT  @P2A 07920400
ALLRPSWA DS    0CL128                   RPS DEVICE WORK AREA            07921200
RPSAPGVT DS    CL20                     RPS IOS APPENDAGE VECTOR TBL    07922000
         DS    CL108                                                    07922800
XTRADSCB DS    0CL1400                  ADDITIONAL F3/FS DSCBS          07923600
         DS    10CL140   DIMENSION=(10)                                 07924400
COMPRESSED_BLOCK_FACTOR  DS 0F      Compressed blksize used        @08C 07924500
*  when allocating a compressed data set. The use of the field for @07A 07924600
*  this purpose is before it is needed for use as ALLOCQTY.        @07A 07924700
*                                                                       07924800
ALLOCQTY DS    F                        ALLOCATED SPACE QUANTITY   @P2A 07924900
*                                       Number of tracks allocated @07A 07925000
*                                       for N_largest extent       @07A 07925100
*                                       allocation when less then  @07A 07925200
*                                       requested maximum size.    @07A 07925300
DIRTRKS  DS    CL2                      NUMBER OF DIRECTORY TRACKS @P4A 07925400
SDBLKSIZ DS    CL2                      BLOCKSIZE DETERMINED BY        X07925500
                                        CREATE                     @P6C 07925600
ALL_IOBE DS    CL(IOBEEND-IOBE)         Stg for IOSDIOBE mapping   @10A 07925700
AIOBEPTR DS    A                        Pointer to ALL_IOBE        @10A 07925800
IOBEPTR  DS    A                        To be consistent with PLX  @10A 07925900
DEBUGPL  IGGDADMP                       DEBUG PARAMETER LIST       @09C 07926000
*********************************************************************** 07926100
*        COMMON ALLOCATE RECOVERY ROUTINE AUDIT TRAIL AREA            * 07926200
*        ( MUST BE LAST THING IN WORK AREA, AND MUST END ON A      @P8C 07926300
*          DOUBLE WORD BOUNDARY.  THIS IS BECAUSE IFG0RR0E {DADSM  @P8A 07926400
*          RECOVERY IN O/C/EOV} CALCULATES THE AUDIT TRAIL AREA    @P8A 07926500
*          BY GOING TO THE END OF THIS W/A, AND THEN BACKING UP    @P8A 07926600
*          ON DOUBLEWORD BOUNDARIES.{STRANGE WAY TO DO BUSINESS!}) @P8A 07926700
*********************************************************************** 07926800
         DS    0D                       ENSURE ALIGNMENT           @P8A 07927200
ALLADTRL DS    0CL40                    ALLOCATE AUDIT TRAIL WORDS @09C 07927800
         DS    10F       DIMENSION=(10)                            @09C 07928400
         ORG   XTRADSCB                                                 07929200
         DS    0CL628                                                   07930000
RACFENTA DS    A                        POINTER TO RACF ENTITY=         07930800
RACFOVLA DS    A                        POINTER TO RACF OLDVOL=         07931600
RACFNVLA DS    A                        POINTER TO RACF VOLSER=         07932400
RACFCLSA DS    CL8                      HOLDS RACF CLASS REQUEST        07933200
SAFPLIST DS    CL96                     SAF PARAMETER LIST AREA         07934000
MODELVOL DS    CL6                      Volser for model profile   @05A 07934400
SAFWAREA DS    CL512                    RACF ROUTER SAF WORKAREA        07934800
*                                                                       07935600
         AIF   ('&ADT' EQ 'YES').ALL0090                                07936400
         AIF   ('&ADT' EQ 'NO').ALL0100                                 07937200
         IHBERMAC 1001,ADT,&ADT                                         07938000
         AGO   .ALL0100                                                 07938800
.ALL0090 ANOP                                                           07939600
         ORG   ALLADTRL                                                 07940400
         MNOTE '         IECDSECS DSMADT,EXPAND=YES'                    07941200
         IECDSECS DSMADT,EXPAND=YES                                     07942000
.ALL0100 ANOP                                                           07942800
&LABEL   DSECT                                                          07943600
         ORG   STARMAP                                                  07944400
         TRKCALC MF=D                                              @L1A 07945200
         AIF   ('&EP' EQ 'EP').ALL0010                                  07950000
         AIF   ('&EP' EQ '').ALL0020                                    08000000
         IHBERMAC 1001,EP,&EP                                           08050000
         AGO   .ALL0020                                                 08100000
.ALL0010 ANOP                                                           08150000
         ORG   ALLPREFX                                                 08200000
         MNOTE '         IECDSECS PREFX,EXPAND=YES'                     08250000
         IECDSECS PREFX,EXPAND=YES                                      08300000
.ALL0020 ANOP                                                           08350000
         AIF   ('&F4' EQ 'F4').ALL0030                                  12781500
         AIF   ('&F4' EQ '').ALL0040                                    12786000
         IHBERMAC 1001,F4,&F4                                           12790500
         AGO   .ALL0040                                                 12795000
.ALL0030 ANOP                                                           12799500
         ORG   ALLDSCB4                                                 12804000
*        IECSDSL1 (4)                                                   12808500
         IECSDSL1 (4)                                                   12813000
.ALL0040 ANOP                                                           12817500
&C       SETA  1                                                        12835500
.ALL0050 AIF   (&C GT N'&D1).ALL0060                                    12840000
         AIF   (&D1(&C) EQ 0 OR &D1(&C) EQ 4).ALL0055                   12844500
         ORG   ALLDSCB1                                                 12849000
         MNOTE '         IECSDSL1 (&D1(&C))'                            12853500
         IECSDSL1 (&D1(&C))                                             12858000
.ALL0055 ANOP                                                           12862500
&C       SETA  &C+1                                                     12867000
         AGO   .ALL0050                                                 12871500
.ALL0060 ANOP                                                           12876000
&C       SETA  1                                                        12894000
.ALL0070 AIF   (&C GT N'&D2).ALL0080                                    12898500
         AIF   (&D2(&C) EQ 0 OR &D2(&C) EQ 4).ALL0075                   12903000
         AIF   (&D2(&C) EQ 7).ALL0072                                   12906000
         ORG   ALFSDSCB                                           @L8A  12909000
         MNOTE '         IECSDSL1 (&D2(&C))'                            12912000
         IECSDSL1 (&D2(&C))                                             12916500
         AGO   .ALL0075                                           @L8A  12917400
.ALL0072 ANOP                                                     @L8A  12918300
         ORG   ALFSDSCB                                           @L8A  12919200
         IGGDADS7 DSECT=NO                                        @L8A  12920100
.ALL0075 ANOP                                                           12921000
&C       SETA  &C+1                                                     12925500
         AGO   .ALL0070                                                 12930000
.ALL0080 ANOP                                                           12934500
         AIF   ('&LABELS' EQ 'NO').LAB1 GO GENERATE WITH NO LABELS @L1A 13155600
         ORG   ALLSPCRQ                                                 13155700
*        ICVVLSDT DSECT=NO              EXPAND SPACE REQUEST P.L.  @L2A 13155800
         ICVVLSDT DSECT=NO                                              13155900
         ORG   ALLSPCRQ                                                 13156000
*        ICVVLSPC DSECT=NO              EXPAND SPACE REQUEST P.L.  @L2A 13156100
         ICVVLSPC DSECT=NO                                              13156200
         ORG   ALLIEXPL                                                 13156300
*        IECIEXPL DSECT=NO              EXPAND PRE/POST P.L.       @L1A 13156400
         IECIEXPL DSECT=NO                                         @L1A 13157200
         ORG   ALLCVPL                                                  13157600
*        ICVAFPL  DSECT=NO              EXPAND CVAF P.L.           @L1A 13158000
         ICVAFPL  DSECT=NO                                         @L1A 13158800
         ORG   ALLBFHDR                                                 13159200
*        ICVAFBFL DSECT=NO              EXPAND BUFFER LIST         @L1A 13159600
         ICVAFBFL DSECT=NO                                         @L1A 13160400
         AGO      .CARRATA                                         @L1A 13162800
.LAB1    ANOP                                                      @L1A 13163600
         ORG   ALLSPCRQ                                                 13163700
*        ICVVLSDT DSECT=NO,LABELS=NO           LABELS NOT SHOWN    @L2A 13163800
         ICVVLSDT DSECT=NO,LABELS=NO                               @L2A 13163900
         ORG   ALLSPCRQ                                                 13164000
*        ICVVLSPC DSECT=NO,LABELS=NO           LABELS NOT SHOWN    @L2A 13164100
         ICVVLSPC DSECT=NO,LABELS=NO                               @L2A 13164200
         ORG   ALLIEXPL                                                 13164300
*        IECIEXPL DSECT=NO,LABELS=NO           LABELS NOT SHOWN    @L1A 13164400
         IECIEXPL DSECT=NO,LABELS=NO                               @L1A 13165200
         ORG   ALLCVPL                                                  13165600
*        ICVAFPL  DSECT=NO,LABELS=NO           LABELS NOT SHOWN    @L1A 13166000
         ICVAFPL  DSECT=NO,LABELS=NO                               @L1A 13166800
         ORG   ALLBFHDR                                                 13167200
*        ICVAFBFL DSECT=NO,LABELS=NO           LABELS NOT SHOWN    @L1A 13167600
         ICVAFBFL DSECT=NO,LABELS=NO                               @L1A 13168400
.CARRATA ANOP                                                      @L1A 13170800
         GBLC  &IOBE                    Indicator for include      @10A 13172400
         AIF   ('&IOBE' EQ 'YES').DONE1 If IOBE already defined,   @10A 13174000
         IOSDIOBE                       IOSBE mapping              @10A 13175600
&IOBE    SETC 'YES'                     Indicates mapping included @10A 13177200
.DONE1   ANOP                                                      @10A 13178800
*******************************************************************@04A 13180800
*       WORK AREA CONSTANTS                                        @04A 13190800
*******************************************************************@04A 13200800
ECBPERR  EQU   X'41'                    PERMANENT I/O ERROR             13220800
VTCWKEND EQU   RETNREG                                                  13270800
BLKDFLT  EQU   X'00001000'              DEFAULT BLOCKING FACTOR    @04CX13280800
                                        FOR SPACE CALCULATIONS ONLY     13290800
PDSEBKSZ EQU   X'00001000'              BLOCKING FACTOR FOR PDSES  @04A 13300800
PDSBKSZ  EQU   X'00000100'              BLOCKING FACTOR FOR PDS    @04AX13310800
                                        DIRECTORIES                @04A 13320800
PDSEKYLN EQU   X'00000000'              KEYLENGTH FOR PDSE         @04AX13330800
                                        DIRECTORIES                @04A 13340800
PDSKYLN  EQU   X'00000008'              KEYLENGTH FOR PDS          @04AX13350800
                                        DIRECTORIES                @04A 13360800
         MEND                                                           20800000
*   */                                                                  20850000
* %ALLWAPL2: ;                                                          20900000
* %IF ALL_REQ = 'YES' %THEN %GOTO ALLWAPL3;                             20950000
*/********************************************************************/ 21000000
*/*                                                                  */ 21050000
*/* ALLOCATE WORK AREA : PLAS VERSION                                */ 21052900
*/*  ENTRY POINT: ALLPREFX                                           */ 21055800
*/*                                                                  */ 21058700
*/*    PURPOSE: MAPS DADSM CREATE (ALLOCATE) WORK AREA               */ 21061600
*/*    LINKAGE: %INCLUDE SYSLIB(IECALLWA) OR IECALLWA MF=D           */ 21064500
*/*    INPUT:                                                        */ 21067400
*/*      SYMBOLIC NAME: PL/AS                                        */ 21070300
*/*        DESCRIPTION: PROVIDES A VARIABLE MAPPING FOR MODULES      */ 21073200
*/*        WRITTEN IN PLAS.                                          */ 21076100
*/*                                                                  */ 21079000
*/*        IN THE FOLLOWING EXAMPLES, COLONS HAVE BEEN USED IN       */ 21081900
*/*        PLACE OF SEMICOLONS TO AVOID COMPILER MESSAGES.           */ 21084800
*/*                                                                  */ 21087700
*/*        ALL SECTIONS, NON-BASED VERSION, CAN BE INCLUDED BY       */ 21090600
*/*        SPECIFYING:                                               */ 21093500
*/*                                                                  */ 21096400
*/*           %INCLUDE SYSLIB(IECALLWA):                             */ 21099300
*/*                                                                  */ 21102200
*/*        ALL SECTIONS, BASED VERSION, CAN BE INCLUDED BY           */ 21105100
*/*        SPECIFYING:                                               */ 21108000
*/*           %DCL ALL_BASE CHAR:                                    */ 21110900
*/*           %ALL_BASE = 'BASED':                                   */ 21113800
*/*           %INCLUDE SYSLIB(IECALLWA):                             */ 21116700
*/*                                                                  */ 21119600
*/*              OR                                                  */ 21122500
*/*                                                                  */ 21125400
*/*           %DCL ALL_BASE CHAR:                                    */ 21128300
*/*           %ALL_BASE = 'BASED(ALL_PTR)'                           */ 21131200
*/*           DCL ALL_PTR POINTER:                                   */ 21134100
*/*           %INCLUDE SYSLIB(IECALLWA):                             */ 21137000
*/*                                                                  */ 21139900
*/*        THE MACRO VARIABLE ALL_BASE IS USED AS THE BASING         */ 21142800
*/*        EXPRESSION FOR THE EXTENDED PREFIX STRUCTURE.             */ 21145700
*/*                                                                  */ 21150000
*/********************************************************************/ 21200000
*@SPACE;                                                                21250000
*DECLARE                                                                21300000
*    /****************************************************************/ 21350000
*    /* COMMON ALLOCATE PREFIX                                       */ 21400000
*    /****************************************************************/ 21450000
*   1 ALLPREFX BASED(ADDR(ALLSTART)-32), /* WORK AREA PREFIX         */ 21500000
*    2 *        (8) FIXED(31);                                          21550000
*@SPACE;                                                                21650000
* %IF ALL_BASE = 'ALL_BASE' %THEN %ALL_BASE = '';                       21675000
*DECLARE                                                                21700000
*    /****************************************************************/ 21750000
*    /* EXTENDED PREFIX, AND WTG TABLE AREA                          */ 21800000
*    /****************************************************************/ 21850000
*   1 ALLSTART ALL_BASE BDY(DWORD),                                     21900000
*    2 ALLEXTPR,                    /* EXTENDED PREFIX               */ 21950000
*     3 *        (20) FIXED(31),                                        22000000
*    2 ALLWTGTB,                    /* DADSM WTG TABLE               */ 22050000
*     3 *        (4) FIXED(31),                                         22100000
*    2 ALLDIAGX FIXED(32),          /* DIAGNOSTIC INFORMATION        */ 22150000
*     3 ALLERCDX FIXED(8),          /* ERROR CODE                    */ 22200000
*     3 ALLSFIDX FIXED(8),          /* SUBFUNCTION ID                */ 22250000
*     3 ALLSFRTX FIXED(8),          /* SUBFUNCTION RETURN CODE       */ 22300000
*     3 ALLSFRSX FIXED(8),          /* SUBFUNCTION REASON CODE       */ 22350000
*    2 ALLEXTPT PTR(31),            /* POINTER TO WORK AREA EXTENT   */ 22400000
*    2 ALLADTPT PTR(31),            /* POINTER TO AUDIT TRAIL        */ 22450000
*    2 ALLXCPPT PTR(31),            /* POINTER TO EXCP WORK AREA     */ 22500000
*    /****************************************************************/ 22550000
*    /* REQUEST INFORMATION                                          */ 22600000
*    /****************************************************************/ 22650000
*    2 ALLREQST,                    /* REQUEST INFORMATION           */ 22700000
* %GOTO ALLWAPL4;                                                       22750000
*                                                                       22800000
* /*******************************************************************/ 22850000
* /* DECLARE REQUEST INFORMATION FIELDS TO BE USED BY IGG0325I       */ 22900000
* /*******************************************************************/ 22950000
*                                                                       23000000
* %ALLWAPL3: ;                                                          23050000
*DECLARE                                                                23100000
* ALLREQST CHAR(*) GENERATED BDY(WORD);                                 23150000
*DECLARE                                                                23200000
*    /****************************************************************/ 23250000
*    /* REQUEST INFORMATION                                          */ 23300000
*    /****************************************************************/ 23350000
*   1 *       DEFINED(ALLREQST),                                        23400000
* %ALLWAPL4: ;                                                          23450000
*     3 ARQBREPL PTR(31),           /* BRANCH ENTRY PARAMETER LIST   */ 23495800
*     3 ARQPLEXT PTR(31),           /* PARAMETER LIST EXTENSION PTR  */ 23541600
*     3 ARQRETPT PTR(31),           /* PARAMETER LIST RETURN AREA    */ 23587400
*     3 ARQCNTLB PTR(31),           /* JFCB OR PDSCB ADDRESS         */ 23633200
*     3 ARQDSABP PTR(31),           /* DSAB LIST ADDRESS             */ 23679000
*     3 ARQFLG01 BIT(8),            /* REQUEST FLAG BYTE             */ 23724800
*      4 AR1CYL   BIT(1),           /* CYLINDER SPACE REQUEST        */ 23770600
*      4 AR1TRK   BIT(1),           /* TRACK SPACE REQUEST           */ 23816400
*      4 AR1AVR   BIT(1),           /* AVERAGE BLOCK REQUEST         */ 23862200
*      4 AR1BYTRQ BIT(1),           /* REQUEST IN BYTES              */ 23908000
*     3 ARQFLG02 BIT(8),            /* REQUEST FLAG BYTE             */ 23953800
*      4 *        BIT(4),           /* RESERVED                      */ 24000000
*      4 AR2CONTG BIT(1),           /* CONTIGUOUS REQUEST            */ 24041600
*      4 AR2MXIG  BIT(1),           /* MXIG REQUEST              @P5C*/ 24083200
*      4 AR2ALX   BIT(1),           /* ALX REQUEST                   */ 24124800
*      4 AR2ROUND BIT(1),           /* ROUND TO CYLINDER BOUNDARY    */ 24166400
*     3 ARQFLG03 BIT(8),            /* REQUEST FLAG BYTE             */ 24208000
*      4 AR3RCHBP BIT(1),           /* RACHECK BYPASS                */ 24249600
*      4 AR3RDFBP BIT(1),           /* RACDEF BYPASS                 */ 24291200
*      4 AR3DSCRT BIT(1),           /* BUILD DISCRETE RACF PROFILE   */ 24332800
*      4 AR3SECMP BIT(1),           /* SECURITY MODEL PROFILE REQUEST*/ 24374400
*      4 AR3GENMP BIT(1),           /* SECURITY MODEL IS A GENERIC      24416000
*                                      PROFILE                       */ 24457600
*     3 ARQFLG04 BIT(8),            /* REQUEST FLAG BYTE             */ 24499200
*      4 AR4ABSTR BIT(1),           /* ABSTR SPACE REQUEST           */ 24540800
*      4 AR4VIODS BIT(1),           /* CREATE A VIO DATA SET         */ 24582400
*      4 AR4ZPQTY BIT(1),           /* ZERO PRIMARY QUANTITY         */ 24624000
*      4 AR4DIRBK BIT(1),           /* DIRECTORY BLOCK REQUEST       */ 24665600
*      4 AR4USRLB BIT(1),           /* USER LABER EXTENT REQUIRED    */ 24707200
*      4 AR4LASTV BIT(1),           /* LAST VOLUME ON WHICH DATA SET    24748800
*                                      RESIDES                       */ 24790400
*      4 AR4LRGEX BIT(1),           /* ALLOCATE 'N' LARGEST EXTENTS     24804200
*                                      <= PRIMARY QUANTITY       @P2A*/ 24818000
*      4 AR4UDQR  BIT(1),           /* USABLE DATA QTY. REQUEST  @P7A*/ 24825000
*     3 ARQSCBYT FIXED(31),         /* SECONDARY QUANTITY IN KBYTES  */ 24832000
*     3 ARQKEYLE FIXED(8),          /* KEY LENGTH                    */ 24873600
*     3 ARQNUMXT FIXED(31),         /* NUMBER OF EXTENT POSSIBLE FOR    24915200
*                                      DATA SET ORGANIZATION         */ 24956800
*     3 ARQVOLSQ FIXED(8),          /* VOLUME SEQUENCE NUMBER        */ 24998400
*     3 ARQAVGRC BIT(8),            /* AVGREC VALUE SPECIFIED        */ 25040000
*      4 ARQAVGUB  BIT(1),          /* SPACE IN BYTES                */ 25081600
*      4 ARQAVGKB  BIT(1),          /* SPACE IN KILOBYTES            */ 25123200
*      4 ARQAVGMB  BIT(1),          /* SPACE IN MEGABYTES            */ 25164800
*     3 ARQPRQTY FIXED(31),         /* PRIMARY SPACE REQUEST         */ 25206400
*     3 ARQSCQTY FIXED(31),         /* SECONDARY SPACE REQUEST       */ 25248000
*     3 ARQAVBLN FIXED(31),         /* AVERAGE DATA BLOCK LENGTH     */ 25289600
*     3 ARQMINES FIXED(31),         /* MINIMUM EXTENT SIZE           */ 25331200
*     3 ARQDRQTY FIXED(31),         /* DIRECTORY BLOCK QUANTITY      */ 25372800
*     3 ARQABSVL FIXED(31),         /* ABSOLUTE TRACK VALUE      @L8C*/ 25414400
*     3 ARQDSSNM CHAR(6),           /* OLD VOLUME SERIAL             */ 25456000
*     3 *        CHAR(0) BDY(WORD), /* RESERVED                  @L8C*/ 25478000
* %IF ALL_REQ = 'YES' %THEN %GOTO ALLWAPL5;                             25500000
*     3 ARQSECMA PTR(31),           /* ADDR OF SECURITY MODEL PROFILE*/ 25550000
* %GOTO ALLWAPL6;                                                       25600000
* %ALLWAPL5: ;                                                          25650000
*     3 ARQSECMA PTR(31);           /* ADDR OF SECURITY MODEL PROFILE*/ 25700000
* %GOTO ALLWAPLX;                                                       25750000
* %ALLWAPL6: ;                                                          25800000
*    /****************************************************************/ 25850000
*    /* INTERNAL PROCESSING FLAGS                                    */ 25900000
*    /****************************************************************/ 25950000
*    2 ALLFLG01 BIT(8),             /* REQUEST FLAG BYTE             */ 26000000
*     3 RAFLAG   BIT(8),            /* REALLOC FLAG BYTE             */ 26050000
*      4 RAFABS   BIT(1),           /* REALLOC ALLOC=ABS REQUEST     */ 26100000
*      4 RAF2DSCB BIT(1),           /* F2DSCB SPECIFIED              */ 26150000
*      4 RAF3DSCB BIT(1),           /* F3DSCB SPECIFIED              */ 26200000
*      4 RAFVTOCE BIT(1),           /* REALLOC VTOCENQD REQUEST  @03A*/ 26210000
*      4 RAFRSRV1 BIT(4),           /* RESERVED.                 @03C*/ 26220000
*    2 ALLFLG02 BIT(8),             /* FLAG BYTE (ADSFLAG)           */ 26250000
*     3 ADSFLAG  BIT(8),            /* ALLOCATE DASD SWITCH FLAG     */ 26300000
*      4 IXVTOC   BIT(1),           /* INDEXED VTOC EXISTS           */ 26350000
*      4 PREEXIT  BIT(1),           /* PRE-EXIT TAKEN                */ 26400000
*      4 IVRFDATA BIT(1),           /* VRF DATA EXISTS               */ 26450000
*      4 NEEDF3   BIT(1),           /* NEED AN F3 DSCB               */ 26500000
*      4 NEEDF2   BIT(1),           /* NEED AN F2 DSCB               */ 26550000
*      4 AL64KTPV BIT(1),           /* DATA SET RESTRICTED TO           26558300
*                                      64K-1 TRACKS ALLOCATED           26566600
*                                      PER VOLUME                @L8A*/ 26574900
*      4 ALCYLAL  BIT(1),           /* DATA SET REQUIRES CYLINDER       26583200
*                                      ALIGNED EXTENTS           @L8A*/ 26591500
*    2 ALLFLG03 BIT(8),             /* FLAG BYTE                     */ 26600000
*     3 AL3RCHK  BIT(1),            /* ISSUE RACHECK                 */ 26650000
*     3 AL3RAVL  BIT(1),            /* ISSUE RACDEF TYPE=ADDVOL      */ 26700000
*    2 ALLFLG04 BIT(8),             /* FLAG BYTE (ASWITCH)           */ 26750000
*     3 ASWITCH  BIT(8),            /* ALLOCATE SWITCH               */ 26800000
*      4 WRZERO   BIT(1),           /* WRITE F0 DSCB                 */ 26850000
*      4 RCDALT   BIT(1),           /* FS DSCB HAS BEEN MODIFIED     */ 26900000
*      4 PRCNTL   BIT(1),           /* PROCESS CONTROL SWITCH        */ 26950000
*      4 WRTFNL   BIT(1),           /* WRITE FINAL FS DSCB TO VTOC   */ 26992800
*      4 FRSTFS   BIT(1),           /* FIRST FS DSCB IS IN ALFSDSCB  */ 27035600
*      4 NEWFS    BIT(1),           /* NEW FS DSCB HAS BEEN BUILT    */ 27078400
*      4 DADBYP   BIT(1),           /* BYPASS UPDATING DT2EDT02 PTR  */ 27121200
*      4 OUTBYP   BIT(1),           /* BYPASS UPDATING OUTPUT           27164000
*                                      FREE-SPACE DSCB CHAIN PTR     */ 27206800
*    2 ALLFLG05 BIT(8),             /* FLAG BYTE (ACNVSW)            */ 27250000
*     3 ACNVSW   BIT(8),            /* ADDITIONAL SWITCHES           */ 27300000
*      4 BYPF4WRT BIT(1),           /* BYPASS F4 DSCB WRITE          */ 27350000
*      4 AI7CNTRL BIT(1),           /* IGG032I7 ENTRY CONTROL        */ 27400000
*      4 AFSZERO  BIT(1),           /* FS DSCB WITH NO EXTENT ENTRIES   27450000
*                                      EXISTS ON VTOC                */ 27500000
*      4 LSTFSIN  BIT(1),           /* ON = THE LAST DSCB IN THE        27537000
*                                      FREE-SPACE CHAIN HAS BEEN        27574000
*                                      READ                          */ 27611000
*      4 LSTFSOUT BIT(1),           /* ON = THE OUTPUT FS DSCB          27648000
*                                      AREA CONTAINS THE LAST FS        27685000
*                                      DSCB TO BE WRITTEN            */ 27722000
*    2 ALLFLG06 BIT(8),             /* FLAG BYTE                 @P3A*/ 27759500
*     3 AR6SCCP1 BIT(1),            /* SECONDARY QTY IN BYTES WAS       27769000
*                                      COMPACTED ONCE            @P3A*/ 27778500
*     3 AR6SCCP2 BIT(1),            /* SECONDARY QTY IN BYTES WAS       27788000
*                                      COMPACTED TWICE           @P3A*/ 27797500
*     3 AR6CRSDB BIT(1),            /* CREATE ORIGINATED BLOCKSIZE      27800600
*                                                                @P6A*/ 27803700
*    2 *        BIT(8),             /* FLAG BYTE (RESERVED)      @P3C*/ 27807000
*    2 SAVERRID FIXED(8),           /* SAVED SUBFUNCTION ID          */ 27816600
*    /****************************************************************/ 27850000
*    /* SAVE AREA FOR BRANCH ENTRY MODULE REGISTERS                  */ 27900000
*    /****************************************************************/ 27950000
*    2 BRESAVE,                     /* SAVE AREA                     */ 28000000
*     3 *        (14) FIXED(31),                                        28050000
*    /****************************************************************/ 28100000
*    /* THE FOLLOWING CONTROL BLOCKS ARE USED TO READ AND WRITE DSCBS*/ 28150000
*    /*  IT IS ALSO USED IN IGG0CLF2 TO FORMAT DIRECTORY BLOCKS  @L8A*/ 28166600
*    /*  AND TO WRITE THE EOF MARK FOR CERTAIN DATA SETS         @L8A*/ 28183200
*    /****************************************************************/ 28200000
*    2 EXCPWKA BDY(DWORD),          /* EXCP WORK AREA                */ 28250000
*     3 DEB      CHAR(48) BDY(WORD), /* DEB                          */ 28300000
*      4 XDEBTCBA PTR(31),          /* TCB ADDRESS                   */ 28350000
*      4 DCB BDY(WORD),             /* DCB                           */ 28400000
*       5 *        CHAR(20),                                            28450000
*       5 XDEBDCBA PTR(31),         /* DCB ADDRESS                   */ 28500000
*       5 XDEBAPPA PTR(31),         /* I/O APPENDAGE VECTOR TABLE    */ 28550000
*      4 XDEBUCBA PTR(31),          /* UCB ADDRESS                   */ 28600000
*      4 *        CHAR(2),                                              28650000
*      4 XDEBSTEX CHAR(4),          /* START OF EXTENT LIMIT         */ 28700000
*     3 DEBPTR   PTR(31),           /* DCB POINTER TO DEB            */ 28750000
*     3 ECB      FIXED(31),         /* ECB                           */ 28800000
*      4 *        BIT(1),                                               28850000
*      4 ECBNORM  BIT(7),           /* NORMAL I/O OPERATION          */ 28900000
*     3 IOB      CHAR(32) BDY(DWORD), /* IOB                         */ 28950000
*      4 *        CHAR(2),                                              29000000
*      4 XIOBSENS CHAR(2),          /* IOB SENSE BYTES               */ 29050000
*      4 XIOBECBP PTR(31),          /* IOB ECB ADDRESS               */ 29100000
*      4 XIOBCSW  CHAR(8),          /* IOB CHANNEL STATUS WORD       */ 29150000
*       5 *        CHAR(5),                                             29200000
*       5 XIOBCHST CHAR(1),         /* IOB CHANNEL STATUS BYTE       */ 29250000
*      4 XIOBSTRT PTR(31),          /* IOB CHANNEL PROGRAM START     */ 29300000
*     3 SEEK     CHAR(8) BDY(DWORD), /* IOB SEEK ADDRESS             */ 29350000
*     3 MBBCCHHR CHAR(8),           /* VTOC ADDRESS                  */ 29400000
*     /***************************************************************/ 29450000
*     /* COMMON ALLOCATE CHANNEL CONTROL WORDS AREA                  */ 29500000
*     /***************************************************************/ 29550000
*     3 CHANPRGM BDY(DWORD),        /* CHANNEL PROGRAM               */ 29600000
*      4 CCW1     CHAR(8),                                              29650000
*      4 CCW2     CHAR(8),                                              29700000
*      4 CCW3     CHAR(8),                                              29750000
*      4 CCW4     CHAR(8),                                              29800000
*      4 CCW5     CHAR(8),                                              29850000
*      4 CCW6     CHAR(8),                                              29900000
*      4 CCW7     CHAR(8),                                              29950000
*      4 CCW8     CHAR(8),                                              30000000
*      4 CCW9     CHAR(8),                                              30050000
*      4 CCW10    CHAR(8),                                              30100000
*      4 CCW11    CHAR(8),                                              30150000
*      4 CCW12    CHAR(8),                                              30200000
*      4 CCW13    CHAR(8),                                              30250000
*      4 CCW14    CHAR(8),                                              30300000
*      4 CCW15    CHAR(8),                                              30350000
*    /****************************************************************/ 30400000
*    /* COMMON ALLOCATE DSCB AREAS                                   */ 30450000
*    /****************************************************************/ 30500000
*    2 ALLDSCB4 CHAR(96) BDY(WORD), /* COMMON ALLOCATE FORMAT 4 DSCB    30550000
*                                      AREA                          */ 30600000
*    2 ALLDSCB1 CHAR(140),          /* COMMON ALLOCATE FORMAT 1 DSCB    30650000
*                                      AREA                          */ 30700000
*    2 DADSMADR CHAR(8),            /* CCHHR OF FIRST FREE-SPACE        30737500
*                                      DSCB                          */ 30775000
*    2 ALFSDSCB CHAR(140),          /* COMMON ALLOCATE 140-BYTE DSCB    30812500
*                                      AREA                          */ 30850000
*     3 FSIN     CHAR(140),                                             30900000
*    2 ALLFSWKA,                    /* COMMON ALLOCATE 140-BYTE DSCB */ 30950000
*     3 FSKEYID  CHAR(4),           /* AREA                          */ 31000000
*     3 FSDATA,                                                         31050000
*      4 FSEXTNT1,                                                      31100000
*       5 *        CHAR(25),                                            31150000
*       5 FSOUT    CHAR(15),                                            31167800
*      4 FSFMTID  CHAR(1),                                              31185600
*      4 FSEXTNT2 CHAR(90),                                             31203400
*      4 FSPTRDS  CHAR(5),                                              31221200
*    /****************************************************************/ 31239000
*    /* FREE-SPACE PROCESSING EXTENT DESCRIPTOR TABLES           @L8A*/ 31256800
*    /****************************************************************/ 31274600
*    2 ALLFSI   CHAR(LENGTH(DT2X7HDR) + /* FREE-SPACE INPUT EDT  @L8A*/ 31292400
*                    (26 * LENGTH(DT2EXT)))                             31310200
*               BDY(WORD),                                              31328000
*    2 ALLFSO   CHAR(LENGTH(DT2X7HDR) + /* FREE-SPACE OUTPUT EDT @L8A*/ 31345800
*                    (26 * LENGTH(DT2EXT)))                             31363600
*               BDY(WORD),                                              31381400
*    /****************************************************************/ 31400000
*    /* VRF DATA AREA - SEE MACRO IECVRFDA                           */ 31450000
*    /****************************************************************/ 31500000
*    2 ALLVRFDA CHAR(LENGTH(VRFDA) +           /* VRF HEADER     @L8C*/ 31520000
*                    (10 * LENGTH(VRFF3PTR)) + /* VRF F3 CCHHRS  @L8A*/ 31540000
*                    LENGTH(VRFEDTS))          /* VRF EDTS       @L8A*/ 31560000
*               BDY(WORD),                                    /* @L8A*/ 31580000
*    /****************************************************************/ 33410000
*    /* WORKAREA USED BY MACRO IGGDADTS                          @L8A*/ 33420000
*    /****************************************************************/ 33430000
*    2 ALLDTSWA CHAR(40) BDY(WORD),                           /* @L8A*/ 33440000
*    /****************************************************************/ 33450000
*    /* TRKCALC PARAMETER LIST                                       */ 33500000
*    /****************************************************************/ 33550000
*    2 STARMAP CHAR(12) BDY(WORD),                                      33600000
*    /****************************************************************/ 33650000
*    /* PRE/POST EXIT PARAMETER LIST                                 */ 33700000
*    /****************************************************************/ 33750000
*    2 ALLIEXPL CHAR(LENGTH(IEXPL)) BDY(WORD),                          33800000
*    /****************************************************************/ 33850000
*    /* CVAF PARAMETER LIST                                          */ 33900000
*    /****************************************************************/ 33950000
*    2 ALLCVPL  CHAR(68) BDY(WORD),                                     34000000
*    /****************************************************************/ 34050000
*    /* CVAF BUFFER LIST                                             */ 34100000
*    /****************************************************************/ 34150000
*    2 ALLBFHDR CHAR(8) BDY(WORD),                                      34200000
*    2 ALLBFLE  CHAR(12) BDY(WORD),                                     34250000
*    /****************************************************************/ 34300000
*    /* PARAMETER LIST AND PARAMETERS USED BY RESERVE/ENQ/DEQ        */ 34350000
*    /****************************************************************/ 34400000
*    2 ENQAREA BDY(WORD),           /* ENQUEUE PARAMETER LIST        */ 34450000
*     3 DEQAREA  CHAR(16),          /* DEQUEUE PARAMETER LIST        */ 34500000
*    2 MJELNAME CHAR(8),            /* MAJOR ELEMENT NAME            */ 34550000
*    2 MIELNAME CHAR(6),            /* MINOR ENQ/DEQ RESOURCE NAME   */ 34600000
*    2 *        CHAR(2),            /* RESERVED                      */ 34650000
*    /****************************************************************/ 34700000
*    /* WORK AREA FIELDS USED BY THE/VTOC CONVERSION ROUTINES        */ 34750000
*    /****************************************************************/ 34800000
*    2 VTCSTART BDY(WORD),          /* VTOC CONVERT WORK AREA        */ 34850000
*     3 EXEOVPTR FIXED(31),         /* EXTEND EOV POINTER            */ 34900000
*     3 EXDEBPTR FIXED(31),         /* EXTEND DEB POINTER            */ 34950000
*     3 EXWKAPTR FIXED(31),         /* EXTEND WORK AREA POINTER      */ 35000000
*     3 NEXTEXTN FIXED(31),         /* POINTER TO NEXT EXTENT        */ 35050000
*     3 LASTFSAD FIXED(31),         /* ADDRESS OF LAST REBUILT          35083300
*                                      FREE-SPACE DSCB               */ 35116600
*     3 VTCFLG01 BIT(8),            /* VTC FLAG BYTE                 */ 35150000
*      4 VT1EXTID BIT(1),           /* VTOC CONVERSION ENTERED FROM     35200000
*                                      EXTEND                        */ 35250000
*      4 VT1ALLID BIT(1),           /* VTOC CONVERSION ENTERED FROM     35300000
*                                      ALLOCATE                      */ 35350000
*      4 VT1DIRFB BIT(1),           /* VTOC CONVERSION ENTERED          35400000
*                                      BECAUSE DIRF BIT WAS SET      */ 35450000
*      4 VT1EOVSW BIT(1),           /* LAST DSCB IN VTOC HAS BEEN READ  35500000
*                                                                    */ 35550000
*      4 VT1SPLCL BIT(1),           /* SPLIT CYLINDER EXTENT FOUND   */ 35600000
*      4 *        BIT(1),           /* RESERVED                  @L8C*/ 35635700
*      4 VT1GT64K BIT(1),           /* >=64K TRACKS ON THE VOLUME@L8A*/ 35671400
*      4 *        BIT(1),           /* RESERVED                  @L8C*/ 35707100
*     3 VTCFLG02 BIT(8),            /* VTC FLAG BYTE (USED TO           35742800
*                                      VALIDATE DS4VTOCI BITS)       */ 35778500
*     3 *        CHAR(2),           /* VTC FLAG BYTE (RESERVED)      */ 35814200
*     3 FSFNDCT  FIXED(15),         /* NUMBER OF FS DSCBS FOUND         35850000
*                                      WHILE SEARCHING THE VTOC      */ 35900000
*     3 MAXTRK   FIXED(15),         /* MAXIMUM TRACKS/CYLINDER       */ 35950000
*     3 FSBLDCT  FIXED(15),         /* NUMBER OF REBUILT FS DSCBS    */ 35987500
*     3 *        FIXED(15),         /* RESERVED                  @L8C*/ 36037500
*     3 CCHHXTNT CHAR(4),           /* OVERLAPPING EXTENT 'CCHH'     */ 36100000
*     3 PREVFSAD CHAR(5),           /* VIRTUAL ADDRESS OF PREVIOUS      36150000
*                                      FREE SPACE DSCB               */ 36200000
*     3 *        CHAR(5),           /* RESERVED                  @L8D*/ 36250000
*     3 CCHHDSCB CHAR(5),           /* 'CCHHR' OF CCHHXTNT DSCB      */ 36300000
*     3 VCCHHR1  CHAR(5),           /* STARTING DSCB FOR TABLE       */ 36350000
*     3 VCCHHR2  CHAR(5),           /* CCHHR OF F4 DSCB              */ 36400000
*     3 *        CHAR(5),           /* RESERVED                  @L8D*/ 36450000
*     3 VCCHHR4  CHAR(5),           /* CURRENT DSCB                  */ 36500000
*     3 VCCHHR5  CHAR(5),           /* NEXT DSCB                     */ 36550000
*     3 *        CHAR(5),           /* RESERVED                  @L8D*/ 36600000
*     3 VCCHHR7  CHAR(5),           /* 2ND DSCB IN VTOC (F5)         */ 36650000
*    2 *        CHAR(2),            /* RESERVED                      */ 36700000
*    2 VTCWKARA  FIXED(31),         /* POINTER TO FIRST EXTENSION@L8A*/ 36705500
*    2 VTCMAXCT  FIXED(31),         /* NUMBER OF EXTENTS IN A FREE      36711000
*                                      SPACE DSCB                @L8A*/ 36716500
*    2 VTCRTAS,                     /* RTA1/RTA2 PAIR FOR USE WITH      36722000
*                                      IGGDAEDS                  @L8A*/ 36727500
*      3 RTA1 CHAR(4),              /*   RTA OF START OF EXTENT  @L8A*/ 36733000
*      3 RTA2 CHAR(4),              /*   RTA+1 OF END OF EXTENT  @L8A*/ 36738500
*    2 VTCRTAT  CHAR(8),            /* IGG0325R EXPND WORK AREA  @L8A*/ 36744000
*    /****************************************************************/ 36750000
*    /* TEMPORARY REGISTER SAVE AREAS                                */ 36800000
*    /****************************************************************/ 36850000
*    2 RETNREG  FIXED(31),          /* SAVE RETURN REGISTER          */ 36900000
*    2 SAVEREGS,                    /* WORKAREA SAVE REGS AREA       */ 36950000
*     3 SAVEREG0 FIXED(31),         /* WORKAREA SAVE REG0 AREA       */ 37000000
*     3 SAVEREG1 FIXED(31),         /* WORKAREA SAVE REG1 AREA       */ 37050000
*     3 SAVEREG2 FIXED(31),         /* WORKAREA SAVE REG2 AREA       */ 37100000
*     3 SAVEREG3 FIXED(31),         /* WORKAREA SAVE REG3 AREA       */ 37150000
*     3 SAVEREG4 FIXED(31),         /* WORKAREA SAVE REG4 AREA       */ 37200000
*     3 SAVEREG5 FIXED(31),         /* WORKAREA SAVE REG5 AREA       */ 37250000
*     3 SAVEREG6 FIXED(31),         /* WORKAREA SAVE REG6 AREA       */ 37300000
*     3 SAVEREG7 FIXED(31),         /* WORKAREA SAVE REG7 AREA       */ 37350000
*     3 SAVEREG8 FIXED(31),         /* WORKAREA SAVE REG8 AREA       */ 37400000
*     3 SAVEREG9 FIXED(31),         /* WORKAREA SAVE REG9 AREA       */ 37450000
*     3 SAVEREGA FIXED(31),         /* WORKAREA SAVE REGA AREA       */ 37500000
*     3 SAVEREGB FIXED(31),         /* WORKAREA SAVE REGB AREA       */ 37550000
*     3 SAVEREGC FIXED(31),         /* WORKAREA SAVE REGC AREA       */ 37600000
*     3 SAVEREGD FIXED(31),         /* WORKAREA SAVE REGD AREA       */ 37650000
*     3 SAVEREGE FIXED(31),         /* WORKAREA SAVE REGE AREA       */ 37700000
*     3 SAVEREGF FIXED(31),         /* WORKAREA SAVE REGF AREA       */ 37750000
*    /****************************************************************/ 37800000
*    /* INTERNAL PROCESSING WORK AREA                                */ 37850000
*    /****************************************************************/ 37900000
*    2 ALLSPCRQ CHAR(32),           /* CVAF VOLUME SPACE TABLE       */ 37950000
*    2 ATIOTPTR PTR(31),            /* POINTER TO DD ENTRY IN TIOT   */ 38000000
*    2 ALLULTRK,                    /* USER LABEL TRACK (RTA/RTA+1)  */ 38021400
*     3 ULRTA    FIXED(31),         /* USER LABEL TRACK RTA          */ 38042800
*     3 ULRTA1   FIXED(31),         /* USER LABEL TRACK RTA+1        */ 38064200
*    2 DS4_NO_DSCBS FIXED(31),      /* NUMBER OF F0 DSCBS IN THE @06A*/ 38081300
*     3 FULLWORD FIXED(31),         /* FULLWORD                  @06C*/ 38098400
*      4 HALFWRD1 FIXED(16),        /* HALFWORD                  @06C*/ 38115500
*      4 HALFWRD2 FIXED(16),        /* HALFWORD                  @06C*/ 38132600
*    2 DSSIZE   FIXED(31),          /* DATA SET SIZE                 */ 38150000
*    2 EXTSIZE  FIXED(31),          /* MINIMUM ALLOCATION UNIT       */ 38200000
*    2 HOWMUCH  FIXED(31),          /* TOTAL PRIMARY QUANTITY        */ 38250000
*    2 SLOWCCHH FIXED(31),          /* CCHH OF THE DIRECTORY EXTENT  */ 38300000
*     3 DIRQTY   FIXED(15),         /* EMBEDDED INDEX QUANTITY       */ 38350000
*     3 PRIQTY   FIXED(15),         /* PRIMARY QUANTITY ON THIS VOLUME  38400000
*                                                                    */ 38450000
*                                   /*                          1@L8D*/ 38500000
*    2 UHOLECTR FIXED(15),          /* NUMBER OF USED F0 DSCBS       */ 38550000
*    2 F3REQD   FIXED(15),          /* NUMBER OF F3 DSCBS REQUIRED   */ 38600000
*    2 F3DSCBS  FIXED(15),          /* NUMBER OF F3 DSCBS- F3RTN     */ 38650000
*    2 PSPLITS  FIXED(15),          /* # OF POSSIBLE EXTENT SPLITS   */ 38700000
*    2 CCHHRTBL,                    /* TABLE OF FS DSCB CCHHRS THAT     38750000
*                                      CAN BE WRITTEN TO.            */ 38800000
*     3 CCHHRCNT FIXED(15),         /* # OF ENTRIES IN CCHHRTBL      */ 38850000
*     3 CCHHRTOP CHAR(50),          /* FIRST ENTRY IN CCHHRTBL   @L8C*/ 38900000
*    2 VTOCADR  CHAR(5),            /* F4 DSCB CCHHR                 */ 38950000
*    2 TTRLL    CHAR(5),            /* TTRLL FOR ALLOCATES F1 DSCB,     39000000
*                                      F2 DSCB CCHHR FOR ISAM ALLOCATE  39050000
*                                                                    */ 39100000
*     3 CCHHR    CHAR(5),           /* CCHHR OF F1 DSCB              */ 39150000
*    2 COUNT    CHAR(5),            /* CHANNEL PROGRAM WORK AREA     */ 39200000
*     3 IDAREA   CHAR(5),           /* CHANNEL PROGRAM WORK AREA     */ 39250000
*    2 FMTINAD  CHAR(5),            /* CHANNEL PROGRAM WORK AREA     */ 39300000
*     3 SAVEADR  CHAR(5),           /* F1 DSCB CCHHR FOR ISAM ALLOCATE  39350000
*                                                                    */ 39400000
*    2 FMTOUTAD CHAR(5),            /* CHANNEL PROGRAM WORK AREA,       39450000
*                                      F3 DSCB CCHHR FOR ISAM ALLOCATE  39500000
*                                                                    */ 39550000
*    2 ALLCCHHR CHAR(5),            /* CCHHR HOLD AREA               */ 39600000
*    2 CCHHRSAV CHAR(5),            /* CCHHR SAVE AREA               */ 39650000
*    2 ADRFSIN  CHAR(5),            /* CCHHR OF THE NEXT FREE-SPACE     39700000
*                                      DSCB TO READ                  */ 39750000
*    2 ADRFSOUT CHAR(5),            /* CCHHR OF THE NEXT FREE-SPACE     39800000
*                                      DSCB TO WRITE                 */ 39850000
*    2 ALLWAEND CHAR(0) BDY(DWORD); /* END OF ALLOCATE WORK AREA @L8A*/ 39850300
*    /****************************************************************/ 39850600
*    /*  VTOC RECOVERY FACILITY DATA AREA (VRFDA) MAPPING.       @L8A*/ 39855100
*    /****************************************************************/ 39855400
*    % VRFDA_BASE = 'BASED(ADDR(ALLVRFDA))';                /*   @L8A*/ 39855700
*    % INCLUDE SYSLIB(IECVRFDA);                            /*   @L8A*/ 39856000
*    /****************************************************************/ 39858300
*    /*  PRE/POST EXIT PARAMETER LIST.                           @01A*/ 39866600
*    /****************************************************************/ 39874900
*    % IEXPL_BASE = 'BASED(ADDR(ALLIEXPL))';                /*   @01A*/ 39883200
*    % INCLUDE SYSLIB(IECIEXPL);                            /*   @01A*/ 39891500
*DECLARE                                                                39900000
*    /****************************************************************/ 39950000
*    /* COMMON ALLOCATE WORK EXTENSION                               */ 40000000
*    /****************************************************************/ 40050000
* %IF ALLRMAIN_BASE = 'ALLRMAIN_BASE' %THEN                             40075000
*   %ALLRMAIN_BASE = 'BASED(ALLEXTPT)';                                 40100000
*   1 ALLRMAIN ALLRMAIN_BASE,       /* ALLOCATE WORK AREA EXTENT     */ 40125000
*    2 ALLRPSWA CHAR(128),          /* RPS DEVICE WORK AREA          */ 40150000
*     3 RPSAPGVT CHAR(20),          /* RPS IOS APPENDAGE VECTOR TBL  */ 40200000
*    2 XTRADSCB BDY(WORD),          /* ADDITIONAL F3/FS DSCBS        */ 40250000
*     3 *        (10) CHAR(140),                                        40300000
*    2 ALLOCQTY FIXED(31),          /* ALLOCATED SPACE QUANTITY         40302500
*                                       Number of tracks allocated for  40305000
*                                       N_largest extent allocation     40307500
*                                       when less then requested        40310000
*                                       maximum size.            @07C*/ 40312500
*    /****************************************************************/ 40315000
*    /* The use of the following field for compressed block size @07A*/ 40317500
*    /* is before it is needed for use as ALLOCQTY               @07A*/ 40320000
*    /****************************************************************/ 40322500
*     3 COMPRESSED_BLOCK_FACTOR FIXED(31),  /* compressed blk size used 40325200
*                                      by DADSM when allocating a       40327900
*                                      compressed data set.      @08C*/ 40330600
*    2 DIRTRKS  CHAR(2),            /* NUMBER OF DIRECTORY TRACKS@P4A*/ 40333300
*    2 SDBLKSIZ CHAR(2),            /* BLOCKSIZE DETERMINED BY          40338800
*                                      CREATE                    @P6C*/ 40344300
*    2 DEBUGPL  CHAR(LENGTH(DADMP)),/* DADSM DUMP MOD. PARM LIST @09A*/ 40347100
*    2 ALL_IOBE CHAR(LENGTH(IOBE)), /* IOBE area (IOSDIOBE)      @10A*/ 40347800
*    2 AIOBEPTR PTR(31),            /* Pointer to ALL_IOBE       @10A*/ 40348500
*    2 IOBEPTR  PTR(31),            /* Pointer to IOBE           @10A*/ 40349200
*    /****************************************************************/ 40350000
*    /* COMMON ALLOCATE RECOVERY ROUTINE AUDIT TRAIL AREA            */ 40400000
*    /****************************************************************/ 40450000
*    2 ALLADTRL BDY(DWORD),         /* ALLOCATE AUDIT TRAIL WORDS    */ 40500000
*     3 *        (10) FIXED(31);                               /*@09C*/ 40514200
*    /****************************************************************/ 40528400
*    /*  DADSM DUMP ROUTINE PARAMETER LIST (DADMP)               @09A*/ 40542600
*    /****************************************************************/ 40556800
*    % DADMP_BASE = 'BASED(ADDR(DEBUGPL))';                 /*   @09A*/ 40571000
*    % INCLUDE SYSLIB(IGGDADMP);                            /*   @09A*/ 40585200
*    %IOBEBASE = 'BASED(IOBEPTR)';                          /*   @10A*/ 40590100
*    %INCLUDE SYSLIB(IOSDIOBE);                             /*   @10A*/ 40595000
*DECLARE                                                                40600000
*    /****************************************************************/ 40650000
*    /* WORK AREA FIELDS USED BY RACF RACROUTE                       */ 40700000
*    /****************************************************************/ 40750000
*   1 *         BASED(ADDR(XTRADSCB)) BDY(WORD),                        40800000
*    2 RACFENTA PTR(31),            /* POINTER TO RACF ENTITY=       */ 40850000
*    2 RACFOVLA PTR(31),            /* POINTER TO RACF OLDVOL=       */ 40900000
*    2 RACFNVLA PTR(31),            /* POINTER TO RACF VOLSER=       */ 40950000
*    2 RACFCLSA CHAR(8),            /* HOLDS RACF CLASS REQUEST      */ 41000000
*    2 SAFPLIST CHAR(96) BDY(WORD), /* SAF PARAMETER LIST AREA       */ 41050000
*    2 MODELVOL CHAR(6),            /* Volser for model profile  @05A*/ 41075000
*    2 SAFWAREA CHAR(512);          /* RACF ROUTER SAF WORKAREA      */ 41100000
*DECLARE                                                                41150000
*    /****************************************************************/ 41200000
*    /* WORK AREA CONSTANTS                                          */ 42050000
*    /****************************************************************/ 42100000
*   ALLWALN  FIXED(31) INIT(LENGTH(ALLSTART)),                          42125000
*   ALLRMNLN FIXED(31) INIT(LENGTH(ALLRMAIN)),                          42150000
*   ALLXPRLN FIXED(31) INIT(LENGTH(ALLEXTPR)),                          42183300
*   BLKDFLT  FIXED(31) CONSTANT(4096), /* DEFAULT BLOCKING FACTOR       42189300
*                                         FOR SPACE CALCULATIONS @04C*/ 42195300
*   PDSEBKSZ FIXED(31) CONSTANT(4096), /* BLOCKING FACTOR FOR PDSES     42201300
*                                                                @04A*/ 42207300
*   PDSBKSZ  FIXED(31) CONSTANT(256),  /* BLOCKING FACTOR FOR PDS       42213300
*                                         DIRECTORIES            @04A*/ 42219300
*   PDSEKYLN FIXED(31) CONSTANT(0),    /* KEYLENGTH FOR PDSE            42225300
*                                         DIRECTORIES            @04A*/ 42231300
*   PDSKYLN  FIXED(31) CONSTANT(8);    /* KEYLENGTH FOR PDS             42237300
*                                         DIRECTORIES            @04A*/ 42243300
*DECLARE                                                                42250000
*   /*****************************************************************/ 42300000
*   /* WORK AREA EXTENT STARTS AT THE END OF THE PRIMARY WORK AREA   */ 42350000
*   /*****************************************************************/ 42400000
*   ALLEXTNT CHAR(0) AUTO GEND;     /* START OF WORK AREA EXTENT     */ 42450000
*@SPACE (2);                                                            42500000
*GENERATE DATA DEFS(ALLEXTNT); /*                                       42550000
*ALLEXTNT DS   0D                                                       42600000
*@ENDGEN; */                                                            42650000
* %ALLWAPLX: ;                                                          42700000
