*/*  INCLUDE SYSLIB(IECCRSA)                                         */ 00050000
*   %GOTO PLSCRSA1;                     /*EXPAND PLS PORTION         */ 00100000
*/*                                                                     00150000
*    CRSA (COMPONENT RECOVERY STATUS AREA) DECLARATION                  00200000
*         THE OPEN/CLOSE/EOV (O/C/E) CRSA IS A VARIABLE LENGTH          00250000
*         CONTROL BLOCK CONSISTING OF THE FOLLOWING:                    00300000
*            (1) A HEADER SECTION (COMMON TO ALL CRSA'S)                00350000
*            (2) A COMPONENT-RELATED SECTION (O/C/E)                    00400000
*         THE O/C/E-RELATED SECTION CONTAINS A BASIC SECTION AND A      00450000
*         TWELVE-BYTE ENTRY FOR EACH DCB/ACB THAT UNDERGOES O/C/E       00500000
*         RECOVERY ROUTINE PROCESSING.                                  00550000
*                                                                       00600000
*         THE CRSA WILL BE POINTED TO BY AN ADDRESS IN THE              00650000
*         SDWACOMP FIELD OF THE RTCA, THUS MAKING IT AVAILABLE          00700000
*         FOR INTERROGATION BY A USER ESTAE ROUTINE.                    00750000
*                                                                       00800000
*                                                                       00850000
*                                                                       00900000
*        CRSA DIAGRAM                                                   00950000
*                                                                       01000000
*        CRSA HEADER (COMMON FORMAT)                                    01050000
*         ___________________________________________________           01100000
*        | 0(0)                                 | 3(3)       |          01150000
*        |               CRSIECID               |  CRSIECMM  |          01200000
*        |______________________________________|____________|          01250000
*        | 4(4)                    | 6(6)       |  7(7)      |          01300000
*        |        CRSIECLN         |  CRSIECSP  |  CRSIECKY  |          01350000
*        |_________________________|____________|____________|          01400000
*        | 8(8)                                              |          01450000
*        |                     RESERVED                      |          01500000
*        |___________________________________________________|          01550000
*        |12(C)                                              |          01600000
*        |                     RESERVED                      |          01650000
*        |_____________________________________________15(F)_|          01700000
*                                                                       01750000
*        CRSA BASIC SECTION (O/C/E ONLY)                                01800000
*         ___________________________________________________           01850000
*        |16(10)      |17(11)                                |          01900000
*        |  CRSIECFN  |               RESERVED               |          01950000
*        |____________|_______________________________19(13)_|          02000000
*                                                                       02050000
*        CRSA ENTRY (O/C/E ONLY)                                        02100000
*         ___________________________________________________           02150000
*        | +0                                                |          02200000
*        |                     CRSIECNT                      |          02250000
*        |___________________________________________________|          02300000
*        | +4                                                |          02350000
*        |                     CRSFCXAT                      |          02360000
*        |___________________________________________________|          02370000
*        | +8                                                |          02380000
*        |                     RESERVED                      |          02400000
*        |___________________________________________________|          02450000
*                                                                       02455500
*PROPRIETARY V3 STATEMENT                                               02461000
*LICENSED MATERIALS - PROPERTY OF IBM                                   02466500
*"RESTRICTED MATERIALS OF IBM"                                          02472000
*5695-DF1                                                               02477500
*(C) COPYRIGHT 1992  IBM CORP.                                          02483000
*END PROPRIETARY V3 STATEMENT                                           02491500
*                                                                    */ 02500000
* %PLSCRSA1: ;                                                          02550000
*DCL 1 IECCRSA BASED(SDWACOMP) BDY(WORD),                               02600000
*      2 CRSIECHD,                      /*CRSA HEADER SECTION        */ 02650000
*        3 CRSIECID   CHAR(3),          /*COMPONENT ID: 'IEC'        */ 02700000
*        3 CRSIECMM   BIT(8),           /*MAPPING MACRO FORMAT ID    */ 02750000
*        3 CRSIECLN   FIXED(15),        /*LENGTH OF CRSA             */ 02800000
*        3 CRSIECSP   FIXED(8),         /*SUBPOOL NO. OF CRSA        */ 02850000
*        3 CRSIECKY   FIXED(8),         /*KEY OF CRSA                */ 02900000
*        3 *          CHAR(8),          /*RESERVED                   */ 02950000
*      2 CRSIECBS     CHAR(4),          /*O/C/E CRSA BASIC SECTION   */ 03000000
*        3 CRSIECFN   CHAR(1),          /*O/C/E FUNCTION IN CONTROL  */ 03050000
*        3 *          CHAR(3);          /*RESERVED                   */ 03100000
*DCL 1 CRSIECNT BASED BDY(WORD),        /*O/C/E CRSA ENTRY           */ 03150000
*      2 CRSIECFC   CHAR(1),            /*DCB/ACB FORCE CLOSE STATUS */ 03200000
*        3 CRSLAST  BIT(1),             /*LAST ENTRY                 */ 03250000
*        3 CRSFCAT  BIT(1),             /*FORCE CLOSE ATTEMPTED      */ 03300000
*        3 CRSOPMOD BIT(1),             /*DCB/ACB FIELDS MODIFIED BY    03350000
*                                         OPEN WERE RESTORED         */ 03400000
*        3 CRSFCINC BIT(1),             /*FORCE CLOSE INCOMPLETE     */ 03450000
*        3 CRSFCCOM BIT(1),             /*FORCE CLOSE COMPLETE       */ 03500000
*        3 *        BIT(2),             /*RESERVED                   */ 03550000
*        3 CRSREOPN BIT(1),             /*OPEN CAN BE REISSUED          03600000
*                                         FOR THIS DCB/ACB           */ 03650000
*      2 CRSIECTP   CHAR(1),            /*TAPE DATA SET STATUS       */ 03700000
*        3 CRSTMAD  BIT(1),             /*TM WRITTEN AFTER DATA      */ 03750000
*        3 CRSTM2AD BIT(1),             /*2ND TM WRITTEN AFTER DATA  */ 03800000
*        3 CRSEOF1  BIT(1),             /*TRAILER LABEL EOF1 WRITTEN */ 03850000
*        3 CRSEOF2  BIT(1),             /*TRAILER LABEL EOF2 WRITTEN */ 03900000
*        3 CRSEOF1T BIT(1),             /*TM WRITTEN AFTER EOF1      */ 03950000
*        3 CRSEOF2T BIT(1),             /*TM WRITTEN AFTER EOF2      */ 04000000
*        3 CRSDISP  BIT(1),             /*REWIND DISPOSITION TAKEN   */ 04050000
*        3 CRSNSL   BIT(1),             /*NSL OUTPUT ROUTINE HAD        04100000
*                                         CONTROL BEFORE ERROR       */ 04150000
*      2 CRSIECDA   CHAR(1),            /*DIRECT ACCESS D/S STATUS   */ 04200000
*        3 CRSDSCB  BIT(1),             /*UPDATED DSCB WRITTEN       */ 04250000
*        3 CRSEOFM  BIT(1),             /*EOF MARK WRITTEN FOR          04300000
*                                         OUTPUT PS DATA SET         */ 04350000
*        3 *        BIT(6),             /*RESERVED                   */ 04400000
*      2 CRSFCXRC   FIXED(8),           /*FORCE CLOSE EXEC RETURN CODE*/04410000
*      2 CRSFCXAT   CHAR(4),            /*FORCE CLOSE EXEC AUDIT TRAIL*/04420000
*      2 *          CHAR(4);            /*RESERVED                   */ 04450000
*                                                                       04500000
* %GOTO PLSCRSA2;                                                       04550000
*                                                                       04600000
*                                                                       04650000
         MACRO                                                          04700000
&LABEL   IECCRSA                                                        04750000
&LABEL   DSECT                          COMPONENT RECOVERY STATUS AREA  04760000
*                                                                       04810000
*                                                                       04860000
CRSIECHD DS    0CL16                    CRSA HEADER SECTION             04900000
CRSIECID DS    CL3                      COMPONENT ID:  'IEC'            04950000
CRSIECMM DS    C                        MAPPING MACRO FORMAT ID         05000000
CRSMMOCE EQU   X'01'                    OPEN/CLOSE/EOV FORMAT           05010000
CRSIECLN DS    CL2                      LENGTH OF CRSA                  05050000
CRSIECSP DS    C                        SUBPOOL NO. OF CRSA             05100000
CRSIECKY DS    C                        KEY OF CRSA                     05150000
         DS    CL8                      RESERVED                        05200000
*                                                                       05250000
*                                                                       05300000
CRSIECBS DS    0CL4                     O/C/E CRSA BASIC SECTION        05350000
CRSIECFN DS    C                        O/C/E FUNCTION IN CONTROL       05400000
CRSIECO  EQU   X'13'                    OPEN                            05450000
CRSIECOJ EQU   X'16'                    OPEN TYPE=J                     05500000
CRSIECC  EQU   X'14'                    CLOSE                           05550000
CRSIECCT EQU   X'17'                    CLOSE TYPE=T                    05600000
CRSIECE  EQU   X'37'                    EOV                             05650000
CRSIECFE EQU   X'1F'                    FEOV                            05700000
         DS    CL3                      RESERVED                        05750000
*                                                                       05800000
*                                                                       05850000
CRSIECNT DS    0CL12                    O/C/E CRSA ENTRY                05900000
CRSIECFC DS    C                        DCB/ACB FORCE CLOSE STATUS      05950000
CRSLAST  EQU   X'80'                    LAST ENTRY                      06000000
CRSFCAT  EQU   X'40'                    FORCE CLOSE ATTEMPTED           06050000
CRSOPMOD EQU   X'20'                    DCB/ACB FIELDS MODIFIED BY      06100000
*                                       OPEN WERE RESTORED              06150000
CRSFCINC EQU   X'10'                    FORCE CLOSE INCOMPLETE          06200000
CRSFCCOM EQU   X'08'                    FORCE CLOSE COMPLETE            06250000
CRSREOPN EQU   X'01'                    OPEN CAN BE REISSUED FOR        06300000
*                                       THIS DCB/ACB                    06350000
CRSIECTP DS    C                        TAPE DATA SET STATUS            06400000
CRSTMAD  EQU   X'80'                    TAPEMARK WRITTEN AFTER DATA     06450000
CRSTM2AD EQU   X'40'                    2ND TAPEMARK WRITTEN AFTER DATA 06500000
CRSEOF1  EQU   X'20'                    TRAILER LABEL EOF1 WRITTEN      06550000
CRSEOF2  EQU   X'10'                    TRAILER LABEL EOF2 WRITTEN      06600000
CRSEOF1T EQU   X'08'                    TAPEMARK WRITTEN AFTER EOF1     06650000
CRSEOF2T EQU   X'04'                    TAPEMARK WRITTEN AFTER EOF2     06700000
CRSDISP  EQU   X'02'                    REWIND DISPOSITION TAKEN        06750000
CRSNSL   EQU   X'01'                    NSL OUTPUT ROUTINE HAD CONTROL  06800000
*                                       BEFORE ERROR OCCURRED           06850000
CRSIECDA DS    C                        DIRECT ACCESS DATA SET STATUS   06900000
CRSDSCB  EQU   X'80'                    UPDATED DSCB WRITTEN            06950000
CRSEOFM  EQU   X'40'                    EOF MARK WRITTEN FOR OUTPUT     07000000
*                                       PS DATA SET                     07050000
CRSFCXRC DS    C                        FORCE CLOSE EXEC RETURN CODE    07060000
CRSFCXAT DS    CL4                      FORCE CLOSE EXEC AUDIT TRAIL    07070000
         DS    CL4                      RESERVED                        07100000
         MEND                                                           07150000
*  %PLSCRSA2: ;                                                         07200000
