* %GOTO PLS1;                       /*                                  00050000
                                       MACRO                            00100000
                                       DPCTMAP                          00150000
                                       AGO   .ASM1                      00200000
*                                                                    */ 00250000
* %PLS1: ;                                                              00300000
*/********************************************************************/ 00350000
*/*                                                                  */ 00400000
*/*      MACRO NAME: IECDDPCT                                        */ 00450000
*/*                                                                  */ 00500000
*/*      DESCRIPTION: Device Performance Capabilities Table          */ 00550000
*/*                                                                  */ 00600000
*/*                                                                  */ 00650000
*/*      STATUS: VERSION 3 RELEASE 1                                 */ 00700000
*/*                                                                  */ 00750000
*/*PROPRIETARY V3 STATEMENT                                          */ 00781200
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00812400
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00843600
*/*5695-DF1                                                          */ 00874800
*/*(C) COPYRIGHT 1988  IBM CORP.                                     */ 00916500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00958200
*/*                                                                  */ 01000000
*/*      FUNCTION: MAPS THE DEVICE PERFORMANCE CAPABILITIES TABLE    */ 01050000
*/*                                                                  */ 01100000
*/*      PROCESSOR: PLAS/ASM                                         */ 01150000
*/*      MACRO SIZE: 20                                              */ 01200000
*/*      DISTRIBUTION LIBRARY: MACLIB                                */ 01250000
*/*      ATTRIBUTES:                                                 */ 01300000
*/*                                                                  */ 01350000
*/*      CHANGE ACTIVITY:                                            */ 01400000
*/*$01,OY63202,HDZ11B0,SJPLNAS: ADD INITIAL ACCESS RESPONSE TIME @01A*/ 01425000
*/********************************************************************/ 01450000
*@EJECT M;                                                              01500000
*DECLARE                                                                01550000
* 1 DPCT BASED BDY(WORD),          /* DEV PERFORMANCE CAPABILITIES   */ 01600000
*   2 DPCCACHE CHAR(8) BDY(WORD),  /* CACHE PERFORMANCE CAPABILITIES */ 01650000
*     3 DPCDREAD FIXED(15),        /* DIRECT READ                    */ 01700000
*     3 DPCDWRT  FIXED(15),        /* DIRECT WRITE                   */ 01750000
*     3 DPCSREAD FIXED(15),        /* SEQUENTIAL READ                */ 01800000
*     3 DPCSWRT  FIXED(15),        /* SEQUENTIAL WRITE               */ 01850000
*   2 DPCNATIV CHAR(8) BDY(WORD),  /* NATIVE PERFORMANCE CAPABILITIES*/ 01900000
*     3 DPCDRNAT FIXED(15),        /* NATIVE DIRECT READ             */ 01950000
*     3 DPCDWNAT FIXED(15),        /* NATIVE DIRECT WRITE            */ 02000000
*     3 DPCSRNAT FIXED(15),        /* NATIVE SEQUENTIAL READ         */ 02050000
*     3 DPCSWNAT FIXED(15),        /* NATIVE SEQUENTIAL WRITE        */ 02083300
*   2 DPCIART  CHAR(2);            /* INIT ACCESS RESPONSE TIME  @01A*/ 02116600
*                                                                       02150000
* %GOTO PLS2;           /*                                              02200000
.ASM1    ANOP                                                           02250000
DPCT     DSECT                          DEV PERFORMANCE CAPABILITIES    02300000
DPCCACHE DS    XL8                      CACHE CAPABILITIES              02350000
         ORG   DPCT+0                                                   02400000
DPCDREAD DS    XL2                      DIRECT READ                     02450000
DPCDWRT  DS    XL2                      DIRECT WRITE                    02500000
DPCSREAD DS    XL2                      SEQUENTIAL READ                 02550000
DPCSWRT  DS    XL2                      SEQUENTIAL WRITE                02600000
DPCNATIV DS    XL8                      NATIVE CAPABILITIES             02650000
         ORG   DPCT+8                                                   02700000
DPCDRNAT DS    XL2                      NATIVE DIRECT READ              02750000
DPCDWNAT DS    XL2                      NATIVE DIRECT WRITE             02800000
DPCSRNAT DS    XL2                      NATIVE SEQUENTIAL READ          02850000
DPCSWNAT DS    XL2                      NATIVE SEQUENTIAL WRITE         02900000
DPCIART  DS    XL2                      INIT ACCESS RESPONSE TIME @01A  02925000
*                                                                       02950000
          MEND  ,         */  %PLS2: ;                                  03000000
