*%GOTO   IOSBX1;                   /* BILINGUAL MAPPING                 00050000
         MACRO                                                          00100000
         IECDIOSB  &IOSIOSBE=NO                                         00100700
.*--------------------------------------------------------------------  00101400
.*  If the parameter IOSIOSBE=YES is specified, the IOSB extension      00102100
.*  is included with the mapping.  This parameter is intended for       00102800
.*  those functions that require the additional IOSB data provided      00103500
.*  in the IOSB extension.  To date, only IOS functions have been       00104200
.*  included in the IOSB extension.                                     00104900
.*                                                                      00105600
.*  Those modules that want to use the standard IOSB                    00106300
.*  (say for the IOS services; STSCH, MSCH, or others)                  00107000
.*  and also need to reference the extension                            00107700
.*  must use the label IOSBSTD  when obtaining storage for the          00108400
.*  standard IOSB (instead of IOSB as used previously).                 00109100
.*                                                                      00109800
.*  To specify this parameter in PLS, %IOSIOSBE = 'YES'                 00110500
.*  must be set before the INCLUDE for the IECDIOSB.                    00111200
.*                                                                      00111900
.*  If IOSIOSBE=YES is not specified, only the standard (basic)         00112600
.*  IOSB is mapped.  The macro default is NO.                           00113300
.*                                                                      00114000
.*  Note: Mapping macro IOSDSRIO also depends on the IOSIOSBE           00114100
.*  parameter.  When specified as YES, the SRIO will map fields         00114200
.*  specific to IOSBs with extensions.  If the name of this             00114300
.*  parameter ever changes, macro IOSDSRIO will also need to be         00114400
.*  updated.                                                     @19A   00114500
.*-------------------------------------------------------------------*/ 00114700
*%IOSBX1: ;                                                             00115400
*/***START OF SPECIFICATIONS*************************************@L8C*/ 00116100
*/*                                                                  */ 00116800
*/*01* PROPRIETARY STATEMENT =                                   @L8C*/ 00119400
*/*                                                                  */ 00122000
*/*    Licensed materials - Property of IBM                          */ 00123400
*/*    This macro is "RESTRICTED MATERIALS OF IBM"                   */ 00123500
*/*    5647-A01 (C) COPYRIGHT IBM CORP. 1986, 2000               @LFC*/ 00123600
*/*                                                                  */ 00123800
*/* STATUS - HBB7703                                             @LFC*/ 00124400
*/*                                                                  */ 00125000
*/*01* DESCRIPTIVE NAME = IOS (I/O Supervisor) Block             @P5C*/ 00125500
*/*                                                                  */ 00125600
*/*02*  ACRONYM = IOSB                                           @L8A*/ 00125700
*/*                                                                  */ 00125800
*/*01* MACRO NAME = IECDIOSB                                     @P5C*/ 00125900
*/*                                                                  */ 00126000
*/*01* DSECT NAME = IOSB                                         @L8A*/ 00126100
*/*                                                              @L8A*/ 00126200
*/*01* COMPONENT = I/O Supervisor (SC1C3)                        @P5C*/ 00126300
*/*                                                              @L8A*/ 00126400
*/*01* EYE-CATCHER = IOSB, if IOSB extension exists              @L8A*/ 00126500
*/*                                                              @L8A*/ 00126600
*/*02*  OFFSET = 06C                                             @L8A*/ 00126700
*/*                                                              @L8A*/ 00126800
*/*02*  LENGTH = 4 Bytes                                         @L8A*/ 00126900
*/*                                                              @L8A*/ 00127000
*/*01* STORAGE ATTRIBUTES =                                      @L8A*/ 00127100
*/*                                                              @L8A*/ 00127200
*/*02*  SUBPOOL           = Any subpool that satisfies fixed     @L8A*/ 00127300
*/*                         global storage attributes. Subpool   @P5C*/ 00127400
*/*                         226 when obtained from the IOS       @P5A*/ 00127500
*/*                         storage manager.                     @P5A*/ 00127600
*/*02*  KEY               = 0                                    @L8A*/ 00127700
*/*02*  RESIDENCY         =                                      @P5C*/ 00127800
*/*           Below the 16M line when obtained                  .@P5A*/ 00127900
*/*           from the IOS storage manager.                      @P5A*/ 00128000
*/*           Other IOS drivers could obtain                     @P5A*/ 00128100
*/*           the IOSB from either below                         @P5A*/ 00128200
*/*           or above the 16M line.                             @P5A*/ 00128300
*/*                                                              @L8A*/ 00128800
*/*                                                              @L8A*/ 00129100
*/*01* SIZE =                                                    @P5C*/ 00129400
*/*  108 bytes for basic IOSB.                                   @P5A*/ 00129700
*/*  44 bytes for an in-line extension (optional).               @P5A*/ 00130000
*/*                                                              @L8A*/ 00130600
*/*01* CREATED BY = User of the STARTIO service                  @L8A*/ 00130900
*/*                                                              @L8A*/ 00131200
*/*01* POINTED TO BY =                                           @L8A*/ 00131500
*/*                    IOQIOSB of IECDIOQ                        @L8A*/ 00131800
*/*                    SRBPARM of IHASRB                         @L8A*/ 00132100
*/*                    RQESRB field of the RQE data area         @P5A*/ 00132400
*/*                                                              @L8A*/ 00132700
*/*01* SERIALIZATION = None                                      @L8A*/ 00133000
*/*                                                              @L8A*/ 00133300
*/*01* FUNCTION:  The IOSB contains all the information needed       */ 00134900
*/*   to process an I/O request through the I/O initiation and       */ 00136500
*/*   completion.  It is used to communicate between the I/O         */ 00138100
*/*   supervisor and the requestor of an I/O service, between        */ 00139700
*/*   the I/O supervisor and and error-recovery procedure,           */ 00141300
*/*   between an ERP and write-to- operator and                      */ 00142900
*/*   statistics-update modules, and among the components of         */ 00144500
*/*   the I/O supervisor.  It is also used to control successive     */ 00146100
*/*   entries from the I/O supervisor to an ERP.                 @P5C*/ 00147700
*/*                                                                  */ 00149700
*/*01* Note:The IOSB extension is contiguous to the standard         */ 00150100
*/*         IOSB.  To include the IOSB extension, the                */ 00150500
*/*         parameter IOSIOSBE = YES must be provided when           */ 00150900
*/*         including the macro in a module.  The extension id       */ 00151300
*/*         must be initialized to IOSB, the length of the           */ 00151700
*/*         extension must be set, and flag IOSBEXTF must be set     */ 00152100
*/*         on to indicate that the extension exists.                */ 00152500
*/*                                                                  */ 00153200
*/* EXTERNAL CLASSIFICATION: DMTI                                @LBA*/ 00153300
*/* END OF EXTERNAL CLASSIFICATION                               @LBA*/ 00153400
*/*                                                                  */ 00153500
*/*01* METHOD OF ACCESS =                                        @L8A*/ 00153600
*/*02*      ASM: IECDIOSB (with IOSIOSBE=YES for extension)      @L8A*/ 00153700
*/*02*    PL/AS: %INCLUDE SYSLIB(IECDIOSB)  (with %IOSIOSBE='YES'    */ 00153800
*/*              before include statement for extension)         @L8A*/ 00153900
*/*                                                              @L8A*/ 00154000
*/* DEPENDENCIES - None                                              */ 00154100
*/*                                                                  */ 00154600
*/* MODULE TYPE - Control block                                      */ 00155300
*/*                                                                  */ 00156000
*/* PROCESSOR - PLS3 Compiler or Assembler H                         */ 00156700
*/*                                                                  */ 00157400
*/* CHANGE ACTIVITY -                                                */ 00158100
*/* THE FOLLOWING APARS ARE INCLUDED:                                */ 00158800
*/*  OZ18121, OZ25620, OZ35535, OZ38931                      @G81LPLS*/ 00159500
*/*                                                                  */ 00160200
*/*  HBB2102 - IOS Rewrite to support new architecture.      @G860PLN*/ 00160900
*/*                                                                  */ 00161600
*/*A-000000-9999999  - JBB2125 - Reformat the IOSB               @D3C*/ 00162300
*/*                                                                  */ 00163000
*/*  $MAC(IECDIOSB),COMP(SC1C3):I/O Supervisor Block                 */ 00163700
*/*                                                                  */ 00164400
*/*  PN  REASON   RLSE    DATE   ORG  COMMENTS                       */ 00165100
*/*  $D1=DCR046   JBB2110 820701 PDLN:Intercept Support              */ 00165800
*/*  $D2=DCR014   JBB2110 820701 PDLZ:Volume Verification (DAVV)     */ 00166500
*/*                                   rewrite.                       */ 00167200
*/*  $D3=DCR083   JBB2125 830601 PDLE:Provide in-line IOSB extension */ 00167900
*/*                                                              @D3A*/ 00168600
*/*  $D4=DCR080   HBB4410 881205 PDLQ:Support for handling missing   */ 00169300
*/*                                   interrupt and manual interven- */ 00170000
*/*                                   tion conditions for couple data*/ 00170700
*/*                                   sets for Cross-system coupling */ 00171400
*/*                                   facility.                  @D4A*/ 00172100
*/*  $D5=DCR0087  HBB4430 920617 PDLH:                           @D5A*/ 00172200
*/*                                                                  */ 00172400
*/*  $H1=3480     JBB2125 821201 PDLE:Provide new driver IDs.    @H1A*/ 00172800
*/*                                                                  */ 00173500
*/*  $L1=HARP01   JBB2216 831115 PDLE:Provide IOPID field.       @L1A*/ 00174500
*/*  $L2=VERS     HBB3310 860416 PDLE:Versioning macro into          */ 00175600
*/*                                   product                    @L2A*/ 00176300
*/*  $L3=ILIBS    JBB3311 880222 PDLC:Provide ILIB driver ID     @L3A*/ 00177000
*/*  $L4=IOSE1    HBB4410 880627 PDLL:Provide early intermediate     */ 00177700
*/*                                   status exit bit (Note:         */ 00178400
*/*                                   originally in DCR003)          */ 00179100
*/*                                   Provide support for CCWs in    */ 00179800
*/*                                   data spaces. (Note:            */ 00180500
*/*                                   originally in DCR008)          */ 00181200
*/*                                   Provide early intermediate     */ 00181900
*/*                                   status exit space switch bit   */ 00182600
*/*                                   (Note: originally in DCR013)   */ 00183300
*/*                                                              @L4A*/ 00184000
*/*  $L5=COUPL    HBB4410 880627 PDLL:Provide XCF driver id      @L5A*/ 00184700
*/*  $L6=DYNAM    HBB4420 900122 PDLZ: Dynamic I/O Support       @L6A*/ 00185400
*/*  $L7=ATLIB    HBB4430 911001 PDMC: Automated Tape Library    @L7A*/ 00185500
*/*  $L8=MVTAM    HBB4430 911202 PDNO: VTAM HPT Support.  Provided   */ 00185600
*/*                                    MIH Processing Inhibit bit.   */ 00185700
*/*                                    Update PROLOG to meet SHOWHDR */ 00185800
*/*                                    requirements.             @L8A*/ 00185900
*/*  $L9=DYNCM    HBB4430 920617 PDLZ: Dynamic Cache Management  @L9A*/ 00186000
*/*  $LA=IOSA     HBB5510 920813 PDLV: IOS Automate Message          */ 00186100
*/*                                    Change IOSVSLFD's driver ID   */ 00186200
*/*                                    from '88' to '18'.            */ 00186300
*/*                                    (Transmitted via PIG0673) @LAA*/ 00186400
*/*  $LB=PR440    HBB5510 921112 PDLV: Retransmit for rebase and     */ 00186500
*/*                                    copyright change              */ 00186600
*/*  $LC=UCBVP    HBB5520 940106 PDLU: UCBVS support                 */ 00186700
*/*                                    Added post code 54x       @LCA*/ 00186800
*/*  $LD=UCBVP    HBB5520 940310 PDKB: UCBVS support                 */ 00186900
*/*                                    Add two word field to be used */ 00187000
*/*                                    by CMSET in IECTCATN. This    */ 00187100
*/*                                    field will be defined in the  */ 00187200
*/*                                    IOSATTWA for an attention     */ 00187300
*/*                                    IOSB                      @LDA*/ 00187400
*/*  $LE=PAVS     HBB5520 940602 PDLC: PAV support - add IOSXIOSN    */ 00187500
*/*                                    bit                       @LEA*/ 00187600
*/*  $LF=64BIT    HBB7703 000901 PDRH: 64-Bit IDAWs                  */ 00187700
*/*                                                                  */ 00187800
*/*  $P1=PH31832  HBB4420 901126 PDLV: Fast path pinning         @P1A*/ 00187900
*/*                                                                  */ 00188000
*/*  $P2=PKB3057  HBB4430 920729 PDKB: 10X DEFECT ELIMINATION        */ 00188100
*/*                                    Add IOSXASPR which will have  */ 00188200
*/*                                    the ASID of the ASCB that will*/ 00188300
*/*                                    contain the preferable IO     */ 00188400
*/*                                    dispatching priority          */ 00188500
*/*                                                              @P2A*/ 00188600
*/*  $P3=PIG1524  HBB5510 930520 PDLZ: 33X DEFECT ELIMINATION        */ 00188700
*/*                                    Allow I/O drivers to specify  */ 00188800
*/*                                    timeout value, independent    */ 00188900
*/*                                    of device MIH time        @P3A*/ 00189000
*/*  $P4=PIG2270  HBB5510 930823 PDLU: Prolog updates            @P4A*/ 00189100
*/*  $P5=PIG3270  HBB5510 931104 PDLU: Prolog updates, CDPI      @P5A*/ 00189200
*/*  $P6=PQC2366  HBB6603 961001 PDLZ: Enclave I/O priority      @P6A*/ 00189300
*/*  $P7=PWA0208  JBB6607 980630 PDNO: Remove obsolete copyright     */ 00189400
*/*                                    statement                 @P7A*/ 00189500
*/*                                                                  */ 00189600
*/*  $01=OZ73484  JBB2216 831115 PDLE:Duplicate the IOSB extension   */ 00189700
*/*                                   IOSXNORQ bit in the IOSB basic */ 00189800
*/*                                   and name it IOSMNORQ.      @01A*/ 00189900
*/*  $02=OY04180  HBB3310 871001 PDLE:Provide flag IOSGDPLP to allow */ 00190000
*/*                                   GDP requests only to           */ 00190100
*/*                                   logically available paths  @02A*/ 00190300
*/*  $03=OY11315  JBB2220 860901 PDLB:Add AOM support.           @03A*/ 00191000
*/*  $04=OY15072  JBB2220 880729 PDLG:Add IOSNOLL to solve local     */ 00191700
*/*                                   lock deadlock problem in post  */ 00192400
*/*                                   status                     @04A*/ 00193100
*/*  $05=OY24898  JBB2220 890909 PDLB:Add IOS002NO to prevent msg    */ 00193300
*/*                                   IOS002A flooding console.  @05A*/ 00193500
*/*  $06=OY28666  HBB3310 900115 PDLL:Add bit field definition for   */ 00193700
*/*                                   IOSNORTY                   @06A*/ 00193900
*/*  $07=OY39007  JBB2220 910331 PDLL:3490 tape support          @07A*/ 00194000
*/*                                                                  */ 00194100
*/*  $08=OY39007  JBB2220 910331 PDLA:Unsolicited Interrupt and      */ 00194200
*/*                                   Attention Exit Interfaces  @08A*/ 00194300
*/*  $09=OY38424  HBB3310 910301 PDLK:I/O Timing SPE             @09A*/ 00194400
*/*  $0A=OY55261  JBB2220 920821 PDMC:Remove IOS002NO bit.  Message  */ 00194500
*/*                                   IOS002A will now be suppressed */ 00194600
*/*                                   for GDP requests that result   */ 00194700
*/*                                   in an N-bit condition.     @0AA*/ 00194800
*/*  $0B=OW02079  HBB5510 940207 PDLU:Add flag to indicate that      */ 00194900
*/*                                   the I/O driver is performing   */ 00195000
*/*                                   non-disruptive I/O.        @0BA*/ 00195100
*/*  $0C=OY67690  HBB4430 940527 PDNO:Fixed by PTM PIG1524.          */ 00195300
*/*                                   No code changes.           @0CA*/ 00195500
*/*  $0D=OW07560  HBB4430 940920 PDLZ:Open Systems Adapter       @0DA*/ 00195600
*/*  $0E=OW11308  HBB5510 960110 PDNO:Add bit to indicate that the   */ 00195700
*/*                                   attention routine was already  */ 00195800
*/*                                   scheduled for this I/O         */ 00195900
*/*                                   operation                  @0EA*/ 00196000
*/*  $0F=OW19667  HBB5510 960823 PDMC:Additional word required for   */ 00196100
*/*                                   CMSET save area as DIE=YES     */ 00196200
*/*                                   is used by IECTCATN.       @0FA*/ 00196300
*/*  $10=OW25260  HBB4430 970331 PDNO:3590 support for OS/390 R3 @10A*/ 00196400
*/*  $11=OW22669  HBB4420 961115 PDNO:No code changes.               */ 00196500
*/*                                   (Fixed by OW11308)         @11A*/ 00196600
*/*  $12=OW20154  HBB4430 961115 PDNO:Save attention index in sense  */ 00196700
*/*                                   IOSB                       @12A*/ 00196800
*/*  $13=OW26938  HBB4430 970521 PDHC:Move ORGs for IOSXEIOP and     */ 00197200
*/*                                   IOSXATI                        */ 00197600
*/*                                   Un-comment reserved field  @13A*/ 00198000
*/*  $14=OW37980  HBB6603 990531 PDLZ:Shark dynamic PAV support  @14A*/ 00198100
*/*  $15=OW38541  HBB6603 990430 PDLE:FICON Support              @15A*/ 00198300
*/*  $16=OW40408  HBB6603 990831 PDNO:Shark PAV Support.             */ 00198400
*/*                                   - Define new Driver ID for     */ 00198500
*/*                                     IOSVIOPA processing      @16A*/ 00198600
*/*  $17=OW43557  HBB6606 000505 PDMM: Add IOSXDSMC bit          @17A*/ 00198740
*/*  $18=OW48518  HBB6606 010630 PDNO: Save USLRRAT2 and USLRRAT3    */ 00198760
*/*                                    in sense IOSB             @18A*/ 00198780
*/*  $19=OW50257  HBB6606 011015 PDNO: Change comments pertaining    */ 00198785
*/*                                    to IOSNOLL usage to reflect   */ 00198790
*/*                                    the meaning of the bit.   @19A*/ 00198795
*/****END OF SPECIFICATIONS*******************************************/ 00198800
*%GOTO   IOSBX5;                   /*                                   00199200
         SPACE 1                                                        00199600
IOSB     DSECT                                                          00200000
         SPACE 1                                                        00250000
         DS    0F                                                       01100000
IOSBSTD  DS    0CL108        Length of the IOSB without the extension   01101400
* -------------------------------IOSFLA bit definitions---------------  01102800
IOSFLA   DS    XL1           Flag byte A                                01104200
*        EQU   X'00'             ..No CCW chaining                      01105600
IOSDCHN  EQU   X'80'             ..Data chaining                        01107000
IOSCCHN  EQU   X'40'             ..Command chaining                     01108400
IOSACHN  EQU   X'C0'             ..Command and data chaining            01109800
IOSERR   EQU   X'20'             ..Error Recovery Routine (ERP) in     X01111200
                                   control.  Bit must be set to 0      X01112600
                                   by the driver.                      X01114000
                                   If the ERP returns with this bit    X01115400
                                   set to 1, a retry is requested.     X01116800
                                   If the ERP returns with this bit    X01118200
                                   set to 0, the error is either       X01119600
                                   corrected or to be considered       X01121000
                                   permanent depending on the          X01122400
                                   setting of the IOSEX bit.            01123800
IOSSMDA  EQU   X'10'             ..ERP status modifier bit A.          X01125200
                                   Must be set to zero by driver.      X01126600
                                     TAPE- Reposition device.          X01128000
                                     U/R- Immediate operation,         X01129400
                                           CCW OP code in IOSMDB.       01130800
IOSSMDB  EQU   X'08'             ..ERP status modifier bit B.          X01132200
                                   Must be set to zero by driver.      X01133600
                                   Set by PCI fetch in appendage       X01135000
                                   for posting:                        X01136400
                                     TAPE- CRC needed.                 X01137800
                                     DASD- PCI fetch stop flag.         01139200
IOSEX    EQU   X'04'             ..Exceptional condition. Upon         X01140600
                                   return from normal or abnormal      X01142000
                                   exit with this bit on, ERP          X01143400
                                   processing is initiated if initial  X01144800
                                   error condition. If bit is          X01146200
                                   set to 0, it is assumed that        X01147600
                                   the exit corrected the condition    X01149000
                                   or did not consider it an error.    X01150400
                                   When the error routine returns      X01151800
                                   with this bit set to a 1            X01153200
                                   and the IOSERR set to a 0, the      X01154600
                                   error is considered permanent.      X01156000
                                   When the ERP returns with both      X01157400
                                   bits set to 0, the error has        X01158800
                                   been corrected.                      01160200
IOSDOM   EQU   X'02'             ..DOM macro required                   01161600
IOSIOSB  EQU   X'01'             ..IOSB created by IOS.                X01163000
                                   Must be set to zero by driver.       01164400
*********************************************************************** 01165800
* IOSFLB bit definitions -  For Start Subchannel requests.            * 01167200
*---------------------------------------------------------------------* 01168600
* See redefinition area for modify subchannel requests.               * 01170000
*********************************************************************** 01171400
IOSFLB   DS    XL1           Flag byte B-----------------------------   01172800
IOSDIESE EQU   X'80'             ..Second entry to DIE                  01174200
IOSSDR   EQU   X'40'             ..ERP doesnt want OBR                  01175600
IOSNOTRS EQU   X'20'             ..Driver does not require an address  X01177000
                                    space switch on entry to DIE.       01178400
IOSRESRC EQU   X'10'             ..IOS resources are held.  Must be    X01179800
                                   initialized to zero by driver.      X01181200
                                   With bit set, the DIE cannot return X01182600
                                   on  codes 12 and 16.                 01184000
IOSIONRD EQU   X'08'             ..Set by a driver to request that the X01185400
                                   I/O request be issued to a          X01186800
                                   not-ready device.                    01188200
IOSMSG   EQU   X'04'             ..Message indicator to WTO service    X01189600
                                   0 = Intervention required msg       X01191000
                                   1 = I/O error message                01192400
IOSBDCST EQU   X'02'             ..Broadcast bit                        01193800
IOSLOG   EQU   X'01'             ..Create an OBR record.                01195200
         SPACE 1                                                        01200000
IOSFLC   DS    XL1               Flag byte C -------------------------  01205500
IOSGDPLP EQU   X'80'             ..With IOSGDP bit set, limit IOSGPMSK X01211000
                                   field to logically available paths  X01216500
                                   (UCBLPM field).                 @02C 01222000
IOSEIDAW EQU   X'40'             ..Extended 4K 8-byte IDAWs        @LFC 01226100
IOSVERIF EQU   X'40'             ..Unsolicited device end verification X01230200
                                   needed for non-DASD devices          01234300
IOSCC3WE EQU   X'20'             ..Set by a driver to request deferred X01238500
                                   condition code 3 posting (post code X01244000
                                   of X'6D')                            01249500
IOSEXP   EQU   X'10'             ..Specific exposure requested.  The   X01255000
                                   IOSUCB field contains the specific  X01260500
                                   exposure UCB address.                01266000
IOSNORWS EQU   X'08'             ..No Read/Write Synchronization:      X01266300
                                   Set on by I/O driver to indicate    X01266600
                                   that the channel should not         X01266900
                                   synchronize on read/write           X01267200
                                   transitions when prefetching        X01267500
                                   (IOSP) is also set.  The driver     X01267800
                                   insures that the read and           X01268100
                                   writes are from different I/O       X01268400
                                   buffers                         @15A 01268700
IOS2CSWS EQU   X'04'             ..Two Channel Status Words:           X01269000
                                   Set on by the I/O driver to         X01269300
                                   indicate that when CCW prefetching  X01269600
                                   is requested (IOSP), if an error    X01269900
                                   occurs where the control unit       X01270200
                                   executes ahead of the channel,      X01270500
                                   two ending CCW addresses            X01270800
                                   should be presented to the          X01271100
                                   driver.  The second ending          X01271400
                                   CCW address is contained in the     X01271700
                                   IEDB.  If this bit is off,          X01272000
                                   an invalid ending CCW address       X01272300
                                   is simulated by IOS             @15A 01272600
IOSNORTY EQU   X'02'             ..No retry allowed.               @06A 01274100
IOSCTCNR EQU   X'02'             ..CTC - No retry allowed      @ZA11845 01277000
IOSGDP   EQU   X'01'             ..A guaranteed device path            X01282500
                                   has been requested. IOSGPMSK        X01288000
                                   contains the path(s) involved.       01293500
         SPACE 1                                                        01300000
*********************************************************************** 01350000
*   IOSPROC - This byte indicates what type of special processing     * 01400000
*             that is to be performed for IOS generated IOSBs.        * 01450000
*             This processing normally runs asynchronous to           * 01500000
*             IOS mainline processing.  This field must be set to     * 01550000
*             zero by drivers.                                        * 01600000
*********************************************************************** 01650000
IOSPROC  DS    XL1                 IOS special processing procedures    01700000
*        EQU   X'00'               ..Reserved                           01750000
IOSAPCI  EQU   X'04'               ..Intermediate status                01800000
IOSATTN  EQU   X'08'               ..Attention                          01850000
IOSAPURG EQU   X'0C'               ..Purge                              01900000
*        EQU   X'10'               ..Reserved                           01950000
IOSAWTO  EQU   X'14'               ..WTO                                02000000
IOSADDR  EQU   X'18'               ..DDR                                02050000
IOSADIER EQU   X'1C'               ..DIE Redrive- different UCB         02100000
IOSAUR   EQU   X'20'               ..Unconditional Reserve              02150000
IOSAST1  EQU   X'F9'               ..IOS subchannel type 1 request @L6A 02200000
IOSASNRQ EQU   X'FA'               ..IOS sense request                  02250000
IOSACLR  EQU   X'FC'               ..CLEAR Subchannel request           02300000
IOSAHALT EQU   X'FD'               ..HALT Subchannel request            02350000
IOSAMOD  EQU   X'FE'               ..MODIFY Subchannel request          02400000
IOSASTOR EQU   X'FF'               ..STORE Subchannel request           02450000
         SPACE 1                                                        03350000
*********************************************************************** 03364200
*  IOSDVRID - This byte indentifies the I/O driver requesting the     * 03378400
*             I/O request.  Driver identification values are          * 03392600
*             assigned by IOS.                                        * 03406800
*********************************************************************** 03421000
IOSDVRID DS    XL1                 Driver identification value          03435200
         SPACE 1                                                        03450000
IOSIOSID EQU   X'00'               ..Reserved for IOS                   03452700
IOSMISID EQU   X'01'               ..Miscellaneous ID for I/O requests X03455400
                                     that cannot be purged,            X03458100
                                     associated with a task, or        X03460800
                                     violate extents                    03463500
IOSXCPID EQU   X'02'               ..EXCP Processor                     03466200
IOSVSAID EQU   X'03'               ..VSAM                               03468900
IOSATMID EQU   X'04'               ..VTAM                               03471600
IOSTCMID EQU   X'05'               ..TCAM                               03474300
IOSOLTID EQU   X'06'               ..OLTEP                              03477000
IOSFCHID EQU   X'07'               ..PCI FETCH                          03479700
IOSJESID EQU   X'08'               ..JES3                               03482400
IOSSS1ID EQU   X'09'               ..MSC                                03485100
IOSPRGID EQU   X'0A'               ..IECVIOPM PURGE                     03487800
IOSVPSID EQU   X'0B'               ..VPSS                               03490500
*        EQU   X'0C'               ..CRYPTO                             03493200
IOSASMID EQU   X'0E'               ..ASM                                03495900
IOSMDSID EQU   X'0F'               ..Message Display Service       @H1A 03498600
IOSAUSID EQU   X'10'               ..Assign/Unassign Service       @H1A 03501300
IOSDYPID EQU   X'11'               ..Dynamic Pathing                    03504000
IOSDAVV  EQU   X'12'               ..DAVV                          @D2A 03506700
IOSDCSID EQU   X'13'               ..Device control service        @03A 03509400
IOSAOMID EQU   X'14'               ..Asychronous Operation Manager @03A 03512100
IOSSMSID EQU   X'15'               ..DFSMS                         @P5C 03514800
IOSXCFID EQU   X'16'               ..XCF CTC I/O Driver            @L5A 03517500
IOSCDRID EQU   X'17'               ..IOS use driver ID             @D5A 03518800
IOSSLFID EQU   X'18'               ..IOSVSLFD driver ID            @LAC 03519500
IOSPAVID EQU   X'19'               ..IOSVIOPA driver ID            @16A 03519800
IOSV33ID EQU   X'80'               ..SVC33                              03520200
IOSCLRID EQU   X'81'               ..Clear Device Recovery              03522900
IOSSCRID EQU   X'82'               ..Subchannel Recovery                03525600
IOSV16ID EQU   X'83'               ..SVC16 PURGE                        03528300
IOSAPRID EQU   X'84'               ..Unconditional Reserve              03531000
IOSMIHID EQU   X'85'               ..Missing Interrupt Handler          03533700
IOSPRVID EQU   X'86'               ..I/O Prevention Handler             03536400
IOSRSVID EQU   X'87'               ..Re-reserve service            @02A 03539100
*---------------------------------------------------------------------* 03544500
         SPACE 1                                                        03550000
IOSFLD   DS    XL1                 Flag byte D                     @D1A 03561100
IOSNOINT EQU   X'80'               ..Set by a driver to request that   X03572200
                                       the I/O request be issued       X03583300
                                       to a device with an intercept   X03594400
                                       condition.  The intercept       X03605500
                                       condition is to be saved for    X03616600
                                       the next I/O request.       @D1A 03627700
IOSMNORQ EQU   X'40'               ..IOS is not to requeue this IOSB   X03638800
                                     if Start Pending condition is     X03649900
                                     detected (MIH, etc).          @01C 03661000
IOSEPCIF EQU   X'20'               ..Early PCI exit call Flag.         X03672100
                                     Set by the I/O driver to get      X03683200
                                     called from the SLIH, instead of  X03694300
                                     from post status for good         X03705400
                                     intermediate status.          @L4C 03716500
IOSCCWDS EQU   X'10'               ..Channel program resides in a data X03727600
                                     space.  Set by the I/O driver @L4C 03738700
IOSEPCIS EQU   X'08'               ..Early PCI exit Space switch flag.  03749800
*                                    Set by the I/O driver to indicate  03760900
*                                    that IOSVSLIH should CMSET to the  03772000
*                                    driver's address space prior to    03783100
*                                    invoking the PCI exit.        @L4C 03794200
IOSLIOPF EQU   X'04'               ..Long I/O Post flag set by the I/O  03805300
*                                    driver to indicate that the driver 03816400
*                                    should be posted back if the I/O   03827500
*                                    request will take a long time to   03838600
*                                    complete due to an MIH condition,  03849700
*                                    manual intervention, etc..    @D4C 03860800
IOSNOLL  EQU   X'02'               Set by the driver to indicate that   03871900
*                                  post status must not get the local   03883000
*                                  lock in order to use the local lock  03894100
*                                  save area, as deadlock could occur.  03905200
*                                  IOSPSLL must also be set on by the   03923290
*                                  driver.                         @19C 03930280
IOSBEXTF EQU   X'01'               ..IOSB extension valid          @D3C 03938500
         SPACE 1                                                        03950000
*---------------------------------------------------------------------* 03954100
IOSASID  DS    H                   Address space identification of     X03958200
                                   address space to be scheduled at    X03962300
                                   termination of I/O request.          03966400
*---------------------------------------------------------------------* 03970500
IOSPGAD  DS    A                   I/O driver termination address.     X03974600
                                   High order bit defines the          X03978700
                                   addressing mode.                    X03982800
                                   For attention processing, the       X03986900
                                   attention address.                   03991000
*---------------------------------------------------------------------* 03995100
IOSPKEY  DS    XL1                 Protect key of IOSPGAD               03999200
*        EQU   X'F0'               Protect key field                    04003300
IOSLCL   EQU   X'08'               ASID schedule at local level         04007400
IOSIDR   EQU   X'04'               Asynchronous ERP scheduling         X04011500
                                   should be used for this I/O         X04015600
                                   request (Indirect recording         X04019700
                                   for paging I/O requests).            04023800
IOSPGDPX EQU   X'02'               This request has a backed up        X04027900
                                   copy (duplexed page).                04032000
IOSCHCMP EQU   X'01'               Driver has a complete channel       X04036100
                                   program, IOS must not build a       X04040200
                                   standard prefix.                     04044300
         SPACE 1                                                        04050000
*---------------------------------------------------------------------* 04051300
IOSCOD   DS    XL1                 I/O completion code field            04052600
*********************************************************************** 04053900
*   Completion codes 41 - 5F are reserved for permanent error         * 04055200
*   conditions. These codes will always be the last entry codes to    * 04056500
*   the abnormal end exits.                                           * 04057800
*---------------------------------------------------------------------* 04059100
*   Completion codes 60 - 73 are reserved for IOS definition use.     * 04060400
*   These codes indicate conditions that IOS has detected in          * 04061700
*   processing the I/O request.                                       * 04063000
*---------------------------------------------------------------------* 04064300
*   Completion codes 74 - 7E denote abnormal conditions for           * 04065600
*   which correction may be possible. These codes denote first        * 04066900
*   entry to abnormal end exits.                                      * 04068200
*---------------------------------------------------------------------* 04069500
*   Completion codes 7F denotes normal I/O completion.  It does       * 04070800
*   not indicate that the I/O request completed successfully.         * 04072100
*---------------------------------------------------------------------* 04073400
*   Completion code 49 applies only to Store and Modify Subchannel    * 04074700
*   requests.                                                         * 04076000
*********************************************************************** 04077300
IOSERRC  EQU   X'41'               Permanent I/O error                  04078600
IOSEXTC  EQU   X'42'               DASD extent error                    04079900
IOSDPXC  EQU   X'43'               Duplexed I/O request was not        X04081200
                                   started because of the UCB level    X04082500
                                   or a not ready device.               04083800
IOSINTC  EQU   X'44'               Request was intercepted because     X04085100
                                   an error occurred after the last    X04086400
                                   time the device was used and the    X04087700
                                   requestors error recovery           X04089000
                                   procedures wants this intercept     X04090300
                                   condition treated as a permanent    X04091600
                                   error.                               04092900
IOSABNC  EQU   X'45'               I/O request abnormally terminated   X04094200
                                   because of program check, machine   X04095500
                                   check, etc in IOS or an exit.        04096800
IOSCD46  EQU   X'46'               Reserved                             04098100
IOSEXTRM EQU   X'47'               I/O request not started - driver    X04099400
                                   Start Subchannel exit (See IOSXSSXA X04100700
                                   field) requested termination prior  X04102000
                                   to the SSCH being issued.            04103300
IOSPRGC  EQU   X'48'               I/O request purged.                  04104600
IOSCNCLD EQU   X'49'               Store or Modify Subchannel request  X04105900
                                   has been cancelled.                  04107200
IOSPVTIO EQU   X'4A'               I/O Prevention - either the I/O     X04108500
                                   request has not been started        X04109800
                                   or the I/O request                  X04111100
                                   has been terminated.            @L1A 04112400
IOSTAPEC EQU   X'4B'               Error in tape repositioning          04113700
IOSIVEXP EQU   X'4C'               Invalid exposure number              04115000
IOSGDPCC EQU   X'4D'               CC=3 - GDP or NIP in control, or    X04116300
                                          with IOSGDPLP set, no        X04117600
                                          logically available paths    X04118900
                                          (UCBLPM).                @02C 04120200
IOSGDPRD EQU   X'4E'               GDP - Reserved device or in         X04121500
                                     conjunction with IOSRELSE, device X04122800
                                     cannot be released.                04124100
IOSCD50  EQU   X'50'               Reserved                             04125400
IOSMIHCA EQU   X'51'               The I/O request has been declared   X04126700
                                     in permanent error.                04128000
IOSMIHSP EQU   X'52'               The I/O request was found pending   X04129300
                                     in the subchannel by IOS, and     X04130600
                                     the driver requested that the     X04131900
                                     IOSB not be requeued(MIH,etc) @02C 04133200
IOSIOTCR EQU   X'53'               IOS cancelled the I/O request due   X04133600
                                     to an I/O timeout condition   @09A 04134000
IOSCAPAS EQU   X'54'               The I/O request could not be        X04134200
                                   started.  The current address space X04134400
                                   did not match IOSASID and a         X04134600
                                   Captured UCB address was used       X04134800
                                   in IOSUCB.                      @LCA 04135000
IOSGDPWE EQU   X'6D'               CC=3 on all paths with IOSCC3WE bit X04135200
                                     set- return request to requestor.  04135800
IOSFTCHC EQU   X'71'               For Fetch driver- hardware          X04137100
                                     corrected data check.              04138400
IOSMIHC  EQU   X'74'               Simulated error status.              04139700
IOSXERPL EQU   X'7D'               I/O exit requested the ERP to log   X04141000
                                     this request                  @L6A 04142300
IOSFINTC EQU   X'7E'               Intercept condition before          X04143600
                                     entrance to error routine.         04144900
IOSNRMC  EQU   X'7F'               Normal I/O completion.               04146200
         SPACE 1                                                        04150000
*********************************************************************** 04158000
* IOSOPT and IOSOPT2 bit definitions - For Start Subchannel requests. * 04166000
*********************************************************************** 04174000
*   See redefinition area for modify and store subchannel requests.   * 04182000
*********************************************************************** 04190000
IOSOPT   DS    XL1                 Options byte                         04198000
IOSOPT2  DS    XL1                 Second option byte                   04206000
*-------IOSOPT--bit-definitions---------------------------------------- 04214000
IOSBYP   EQU   X'80'               Bypass IOS channel program prefixing 04222000
IOSDEP   EQU   X'40'               Device end posting requested         04230000
IOSQISCE EQU   X'20'               This request initiated by a functionX04238000
                                   which has set the quiesce level in  X04246000
                                   the UCB. (This bit should only be   X04254000
                                   set when using the STARTIO macro    X04262000
                                   compatibilty interface. All others  X04270000
                                   should place the Quiesce level in   X04278000
                                   the IOSLEVEL field.)                 04286000
IOSPSLL  EQU   X'10'               If 0, Local lock needed for IOS     X04294000
                                         Post status processing.       X04302000
                                   If 1, Local lock not needed.         04310000
IOSNERP  EQU   X'08'               If flag UCBLERP is off, ERPs are    X04311300
                                   not to be used.  If UCBLERP is on,  X04312600
                                   ERPs will unconditionally get       X04313900
                                   control.  ERPs will only be allowed X04315200
                                   to perform recovery of non-error    X04316500
                                   unit checks and any additional      X04317800
                                   function as defined by intermediate X04319100
                                   ERP mask flags.  When this flag is  X04320400
                                   on, ERPs may not perform any        X04321700
                                   recovery for error cases except as  X04323000
                                   defined by the ERP mask flags.  @07C 04324300
IOSTSLL  EQU   X'04'               If 0, Local lock needed by the      X04326000
                                         termination routine.          X04334000
                                         (IOSPSLL bit must be off)     X04342000
                                   If 1, Local lock not needed by the  X04350000
                                         termination routine            04358000
IOSAPR   EQU   X'02'               Alternate path retry active.        X04366000
                                   Must be set to zero by driver.       04374000
IOSRELSE EQU   X'01'               Request for stand-alone RELEASE     X04382000
                                   CCW to be issued.                    04390000
         SPACE 1                                                        04400000
*---------------------------------------------------------------------* 04411600
* IOSOPT2 - This byte reflects the I/O driver conditions for          * 04423200
*           initiating an I/O request to the subchannel. See          * 04434800
*           architecture for the meaning of these conditions.         * 04446400
*           This byte also reflects the interrupt status from the IRB.* 04458000
*---------------------------------------------------------------------* 04469600
IOSF     EQU   X'80'               If 0, Format 0 CCW channel program.  04481200
*                                  If 1, Format 1 CCW channel program.  04492800
IOSP     EQU   X'40'               If 0, the driver does not want       04504400
*                                        'Unlimited CCW  Prefetch'.     04516000
*                                  If 1, the driver wants 'Unlimited    04527600
*                                        CCW Prefetch' active with      04539200
*                                        the channel program.           04550800
IOSI     EQU   X'20'               If 0, The driver does not want       04562400
*                                        'Initial Status Interruption'  04574000
*                                        generated.                     04585600
*                                  If 1, The driver wants 'Initial      04597200
*                                        Status Interruption'           04608800
*                                        generated.                     04620400
IOSA     EQU   X'10'               If 1, Address limit check required.  04632000
IOSSI    EQU   X'08'               If 1, Suppress Suspend Interrupt.    04643600
IOSZ     EQU   X'04'               If 1, Zero condition code to         04655200
*                                        Initial selection.             04666800
IOSE     EQU   X'02'               Extended control information stored X04678400
                                   with interrupt. (This bit is        X04690000
                                   provided for information only,      X04701600
                                   the stored data cannot be found     X04713200
                                   from the IOSB.)                      04724800
IOSN     EQU   X'01'               If 1, path not operational.          04736400
         SPACE 1                                                        04750000
IOSUCB   DS    A                   Unit Control Block (UCB) address,    04800000
*                                   address to common segment.          04850000
*********************************************************************** 04900000
*  IOSFCSW  field - Subchannel Status Word field.                       04950000
*---------------------------------------------------------------------- 05000000
*  Format 0 CCW requests - Start Subchannel deferred condition code   * 05050000
*    is stored in IOSCC field and the 3 byte command address in       * 05100000
*    IOSCSWCA (compatable with System/370).                           * 05150000
*********************************************************************** 05200000
IOSFCSW  DS    0XL8                Eight byte Subchannel CSW            05250000
IOSCCWAD DS    A                   Format 1 CCW address                 05300000
         ORG   IOSCCWAD                                                 05350000
IOSCC    DS    XL1                 Start Subchannel deferred CC         05400000
IOSCC3   EQU   X'30'                Deferred condition code 3           05450000
IOSCC1   EQU   X'10'                Deferred condition code 1           05500000
IOSCC0   EQU   X'00'                Deferred condition code 0           05550000
IOSCSW   DS    XL7                 Low order 7 bytes of CSW             05600000
         ORG   IOSCSW                                                   08850000
IOSCSWCA DS    AL3                 Format 0 CCW address                 08900000
IOSTATUS DS    XL2                 CSW status bytes                     08950000
         ORG   IOSTATUS                                                 09000000
IOSTSA   DS    XL1                 Device status byte of SCSW           09008300
         ORG   IOSTSA                                                   09016600
IOSDSTAT DS    XL1                 Device status                        09024900
IOSDSATN EQU   X'80'                ..Attention                         09033200
IOSDSSM  EQU   X'40'                ..Status Modifier                   09041500
IOSDSCUE EQU   X'20'                ..Control Unit End                  09049800
IOSDSBSY EQU   X'10'                ..Busy                              09058100
IOSDSCE  EQU   X'08'                ..Channel End                       09066400
IOSDSDE  EQU   X'04'                ..Device End                        09074700
IOSDSUC  EQU   X'02'                ..Unit Check                        09083000
IOSDSUEX EQU   X'01'                ..Unit Exception                    09091300
IOSTSB   DS    XL1                 Subchannel status byte               09099600
         ORG   IOSTSB                                                   09107900
IOSSSTAT DS    XL1                 Subchannel status                    09116200
IOSSSPCI EQU   X'80'                ..Program-controlled interrupt      09124500
IOSSSIL  EQU   X'40'                ..Incorrect Length                  09132800
IOSSSPGC EQU   X'20'                ..Program Check                     09141100
IOSSSPTC EQU   X'10'                ..Protection Check                  09149400
IOSSSCDC EQU   X'08'                ..Channel Data Check                09157700
IOSSSCCC EQU   X'04'                ..Channel Control Check             09166000
IOSSSICC EQU   X'02'                ..Interface Control Check           09174300
IOSSSCC  EQU   X'01'                ..Chaining Check                    09182600
IOSCSWRC DS    XL2                 Residual Count                       09190900
         ORG   IOSCSW+L'IOSCSW     '                                    09200000
         SPACE 1                                                        09250000
*---------------------------------------------------------------------- 09260200
IOSSRB   DS    A                   Back pointer to I/O requestors SRB   09270400
IOSUSE   DS    A                   IOSB owner use field.                09280600
IOSIOPID DS    A                   The I/O prevention identifier       X09290800
                                   (IOPID) that covers this            X09301000
                                   I/O request.                    @L1C 09311200
*---------------------------------------------------------------------- 09352000
IOSAPMSK DS    0XL2                Compatibility label                  09362200
IOSSCHC  DS    0XL2                Subchannel Control field which      X09372400
                                   is presented in the subchannel      X09382600
                                   status word(SCSW) of IRB.            09392800
IOSSCHC0 DS    XL1                 Subchannel Control - Byte 0          09403000
*        EQU   X'80'               Reserved for architecture            09413200
IOSFC    EQU   X'70'               Function Control field               09423400
IOSFSSCH EQU   X'40'               - Start Subchannel                   09433600
IOSFHSCH EQU   X'20'               - Halt  Subchannel                   09443800
IOSFCSCH EQU   X'10'               - Clear Subchannel                   09454000
IOSAC    EQU   X'0F'               Activity Control                     09464200
IOSARSCH EQU   X'08'               - Resume Pending                     09474400
IOSASSCH EQU   X'04'               - Start Pending                      09484600
IOSAHSCH EQU   X'02'               - Halt Pending                       09494800
IOSACSCH EQU   X'01'               - Clear Pending                      09505000
IOSSCHC1 DS    XL1                 Subchannel Control - byte 1          09515200
IOSAC2   EQU   X'E0'               Activity Control                     09525400
IOSASUBA EQU   X'80'               - Subchannel active                  09535600
IOSADEVA EQU   X'40'               - Device active                      09545800
IOSSSPND EQU   X'20'               - Subchannel Suspended               09556000
IOSSC    EQU   X'1F'               Status Control                       09566200
IOSSALRT EQU   X'10'               - Alert Status                       09576400
IOSSINTR EQU   X'08'               - Intermediate status                09586600
IOSSPRIM EQU   X'04'               - Primary Status                     09596800
IOSSSEC  EQU   X'02'               - Secondary Status                   09607000
IOSSPNDG EQU   X'01'               - Status Pending.                   X09617200
                                     If 0, Simulated status.            09627400
IOSSNS   DS    H                   Sense data - 1st 2 bytes             09637600
IOSSNSBD EQU   X'10FE'             Value supplied to indicate          X09647800
                                   unsuccessful sense                   09658000
*********************************************************************** 09668200
*  End of common IOSB section - start of processing dependent sections* 09678400
*---------------------------------------------------------------------- 09688600
*  NML - Normal I/O request processing                                * 09698800
*  WTO - attention processing                                         * 09709000
*  PCI - Intermediate status processing                               * 09719200
*********************************************************************** 09729400
IOSSECT  EQU   *                                                        09739600
         SPACE 1                                                        09750000
IOSIPIB  DS    A                   NML- IPIB address (IOS/Purge)       X09800000
                                       Initially set to zero by driver X09850000
                                       and not to be reset by exits.   X09900000
                                   PCI- Intermediate status SRB/IOSB   X09950000
                                        chain pointer.                  10000000
         SPACE 1                                                        12250000
IOSPCHN  DS    A                   PCI- Ptr to ending status IOSB for  X12257300
                                       Intermediate status SRB/IOSBS.  X12264600
                                   NML- Ptr to 1st intermediate status X12271900
                                       SRB/IOSB for ending status IOSB. 12279200
         ORG   IOSPCHN                                                  12286500
IOSSCHIB DS    A                   For Modify and Store Subchannel     X12293800
                                   requests, IOSPCHN contains the      X12301100
                                   address of the SCHIB data           X12308400
                                   associated with the request         X12315700
                                   (Address provided by the caller).    12323000
         SPACE 1                                                        12330300
IOSERP   DS    A                   ERP - Error work area address (EWA).X12337600
                                         Must initially be set to zero X12344900
                                         by the driver.                 12352200
*********************************************************************** 12359500
*  Caller Exit addresses - High order bit defines addressing mode.    * 12366800
*---------------------------------------------------------------------- 12374100
IOSPCI   DS    A                   Intermediate status exit address    X12381400
                                   or zero                              12388700
IOSNRM   DS    A                   Normal end exit address (required)   12396000
IOSABN   DS    A                   Anormal end exit address(required)   12403300
IOSDIE   DS    A                   Disabled Interrupt Exit address     X12410600
                                   or zero                              12417900
*********************************************************************** 12425200
*  Real channel program virtual and real addresses.                   * 12432500
*---------------------------------------------------------------------- 12439800
IOSRST   DS    A                   Real address                         12447100
IOSVST   DS    A                   Virtual address                      12454400
         SPACE 1                                                        12461700
*---------------------------------------------------------------------- 12469000
IOSDSID  DS    A                   Data set identifier(DSID)- purge     12476300
IOSLEVEL DS    XL1                 IOS serialization level              12483600
IOSGPMSK DS    XL1                 GDP- Guaranteed Device path mask    X12490900
                                        with IOSGDP bit set.           X12498200
                                   APR- Alternate path retry path      X12505500
                                        mask with IOSAPR bit set.       12512800
IOSDCTI  DS    XL2                 DCTI field from IRB- the I/O        X12520100
                                        request device connect time.    12527400
         SPACE 1                                                        12534700
IOSFMSK  DS    XL1                 Mode set/File mask field.            12542000
IOSCKEY  DS    XL1                 On STARTIO- Channel program         X12549300
                                               protect key.            X12556600
                                   On interrupt- 1st byte of the IRB.   12563900
IOSIRBKY EQU   X'F0'               . Protect key - bits 0-3             12571200
IOSS     EQU   X'08'               . Request has Suspend capability     12578500
IOSIRBL  EQU   X'04'               . ESW contains logout data           12585800
IOSIRBCC EQU   X'03'               . SSCH Deferred condition code------ 12593100
IOSIRBC3 EQU   X'03'                  -Deferred condition code 3        12600400
IOSIRBC1 EQU   X'01'                  -Deferred condition code 1        12607700
IOSIRBC0 EQU   X'00'                  -Deferred condition code 0        12615000
         SPACE 1                                                        12622300
*---------------------------------------------------------------------- 12629600
IOSMDB   DS    XL1                 ERP immediate CCW op code            12636900
IOSMDM   DS    XL1                 ERP modifier mask                    12644200
*---------------------------------------------------------------------- 12651500
IOSEEK   DS    CL8                 Static seek address                  12658800
*                                  NOTE: CTC section starts at          12666100
*                                        IOSEEK + 4.                    12673400
*---------------------------------------------------------------------- 12680700
IOSEEKA  DS    CL8                 Dynamic seek address                 12688000
         ORG   IOSEEKA                                                  12700000
IOSSKM   DS    XL1                 M                                    12750000
IOSSKBB  DS    XL2                 BB                                   12800000
IOSCCHH  DS    0XL4                CCHH                                 12825000
IOSSKCC  DS    XL2                 CC                                   12850000
IOSSKHH  DS    0XL2                HH                                   12900000
IOSSKH1  DS    XL1                 H                                    12910000
IOSSKH2  DS    XL1                 H                                    12920000
IOSSKR   DS    XL1                 R                                    12950000
         SPACE 1                                                        13050000
IOSEND   EQU   *                   End of IOSB w/o extension            13057100
         SPACE 2                                                        13064200
*********************************************************************** 13071300
*  Channel to Channel (CTC) section                                   * 13078400
*---------------------------------------------------------------------- 13085500
         ORG   IOSEEKA-4           Start of CTC section                 13092600
IOSCTCDW DS    D                   Sense command byte CCW slot          13099700
         ORG   IOSCTCDW+5          Command byte slot in CCW             13106800
IOSCTCMD DS    XL1                 CTC command byte from sense         X13113900
                                   if format 0 CCW (IOSF=OFF)           13121000
         ORG   IOSCTCDW+L'IOSCTCDW '                                    13128100
IOSCTCOP DS    XL1                 CTC command byte from sense         X13135200
                                   if format 1 CCW (IOSF=ON)            13142300
         SPACE 1                                                        13150000
*********************************************************************** 13169200
*  Attention section - IOS generated IOSB when IOSPROC = X'08'        * 13188400
*---------------------------------------------------------------------* 13207600
         ORG   IOSSECT             Start of attention section           13226800
IOSATTSN DS    XL40                Additional sense ( after IOSNS)      13246000
         ORG   IOSATTSN            Start of attention section      @03A 13265200
IOSATSNS DS    XL30                Additional sense data           @03A 13284400
IOSATPMK DS    XL1                 Attention path mask - path mask of   13303600
*                                  path on which attention interrupt    13322800
*                                  was received                    @03A 13342000
IOSAFLGS DS    XL1                 Attention Flags                 @08A 13344100
IOSAINTR EQU   X'80'               Indicates that attention routine is  13346200
*                                  requesting intercept processing @08A 13348300
IOSAINTE EQU   X'40'               Indicates an intercept has been      13350400
*                                  generated for this attention         13352500
*                                  interrupt                       @08A 13354600
*        EQU   X'20'               Unused                          @08A 13356700
*        EQU   X'10'               Unused                          @08A 13358800
*        EQU   X'08'               Unused                          @08A 13360900
*        EQU   X'04'               Unused                          @08A 13363000
*        EQU   X'02'               Unused                          @08A 13365100
*        EQU   X'01'               Unused                          @08A 13367200
IOSAATI  DS    FL1                 Index to the attention table    @08A 13369300
         DS    XL7                 Reserved                        @08C 13371400
IOSATTWA DS    0XL24               Attention routine work area     @P1C 13374100
IOSXMSAV DS    XL12                CMSET savearea                  @0FC 13382700
         DS    XL12                Reserved                        @0FC 13391300
         SPACE 1                                                        13400000
*********************************************************************** 13418700
*  Intermediate status section- IOS generated IOSB when IOSPROC= X'04'* 13556000
*---------------------------------------------------------------------* 13559000
         ORG   IOSSECT             Start of Intermediate status section 13562000
         DS    A                   IOSIPIB field- must not be          X13565000
                                   changed                              13568000
         DS    A                   IOSPCHN field- must not be          X13571000
                                   changed                              13574000
IOSPCIRS DS    XL32                Intermediate status reserved        X13577000
                                   area                                 13580000
IOSPCIWA DS    XL(IOSEND-*)        Intermediate status work area        13583000
         SPACE  2                                                       13586000
*********************************************************************** 13589000
*  IOSB mapping fields for modify and store subchannel requests.      * 13592000
*---------------------------------------------------------------------* 13595000
*  Fields IOSFLB, IOSOPT and IOSOPT2 are mapped, as follows.          * 13598000
*********************************************************************** 13601000
*IOSFLB field bit definitions -- Modify Subchannel requests only      * 13604000
*---------------------------------------------------------------------* 13607000
IOSMLPMO EQU   X'80'               If 1, old LPM is to be              X13610000
                                        'ORED' with new LPM.           X13613000
                                   If 0, old LPM is to BE              X13616000
                                        'ANDED' with new LPM.          X13619000
                                         This bit valid only if        X13622000
                                         IOSMLPM is on.                 13625000
IOSMPOMO EQU   X'40'               If 1, Old PSW is to be              X13628000
                                        'ORED' with new POM.           X13631000
                                   If 0, Old POM is to be              X13634000
                                        'ANDED' with new POM.          X13637000
                                         This bit valid only if        X13640000
                                         IOSMPOM is on.                 13643000
IOSMMMO  EQU   X'20'               If 1, old measurement mode is       X13646000
                                         to be 'ORED'with new          X13649000
                                         new measurement mode.         X13652000
                                   If 0, old measurement mode is to    X13655000
                                         be 'ANDED'  with new          X13658000
                                         measurement mode.             X13661000
                                         This bit valid only if        X13664000
                                         IOSMMM is on.                  13667000
IOSASIS  EQU   X'10'               If 1, IOSMLPMO and IOSMPOMO are     X13670000
                                         ignored, and the old LPM      X13673000
                                         and/or POM are to be          X13676000
                                         replaced by the new           X13679000
                                         LPM/POM.                       13682000
*********************************************************************** 13685000
*   IOSOPT and IOSOPT2 bit definitions                                * 13688000
*---------------------------------------------------------------------* 13691000
*   For Modify and Store Subchannel requests.                         * 13694000
*********************************************************************** 13697000
*--------IOSOPT-------------------------------------------------------- 13700000
IOSSYN   EQU   X'80'               If 1, indicates STORE or MODIFY     X13703000
                                         subchannel request is to be   X13706000
                                         done synchronously.           X13709000
                                   If 0, indicates caller can          X13712000
                                         handle asynchronous issuing   X13715000
                                         of STORE or MODIFY Subchannel. 13718000
IOSNOPTH EQU   X'40'               If 1, indicates for path message    X13721000
                                         request, a conditional        X13724000
                                         no path condition.             13727000
*        EQU   X'3F'               Reserved- initialized to zero        13730000
*--------IOSOPT2------------------------------------------------------- 13733000
IOSMISC  EQU   X'80'               If 1, interrupt subclass is to      X13736000
                                         be modified by MSCH            13739000
IOSME    EQU   X'40'               If 1, enabled indicator is to       X13742000
                                         be modified by MSCH (IOS use  X13745000
                                         only)                          13748000
IOSMLM   EQU   X'20'               If 1, limit mode is to be modified  X13751000
                                         by MSCH                        13754000
IOSMMM   EQU   X'10'               If 1, measurement mode is to be     X13757000
                                         modified by MSCH               13760000
IOSMLPM  EQU   X'08'               If 1, logical path mask is to be    X13763000
                                         modified by MSCH               13766000
IOSMMBI  EQU   X'04'               If 1, measurement block index is    X13769000
                                         to be modified by MSCH         13772000
IOSMPOM  EQU   X'02'               If 1, path operational mask is to   X13775000
                                         be modified by MSCH            13778000
IOSMD    EQU   X'01'               If 1, dynamic pathing indicator     X13781000
                                         is to be modified by MSCH      13784000
*/********************************************************************/ 13787000
*/* Notes on Bit Combinations                                        */ 13790000
*/*                                                                  */ 13793000
*/* IOSPSLL - 0 = local lock needed for IOS post status processing,  */ 13796000
*/*               the local lock is obtained and the local lock save */ 13799000
*/*               area is passed via register 13 to various exits.   */ 13802000
*/*           1 = local lock is not needed                           */ 13805000
*/* IOSIDR  - 1 = paging I/O therefore, ERPs must use indirect       */ 13808000
*/*               recording for requests, ie, the ERP sets IOSPROC to*/ 13811000
*/*               IOSWTO to have ERP messages scheduled.  Also,      */ 13814000
*/*               if ASM (IOSNOLL = 0), the address of a save area   */ 13817000
*/*               is passed via the ASM control block IORB.          */ 13820000
*/* IOSNOLL - 0 = the local lock may be obtained.                    */ 13823000
*/*           1 = the I/O driver has indicated that the local lock   */ 13826000
*/*               cannot be obtained.  The local lock may already be */ 13829000
*/*               owned in which case dead lock could occur.  Also,  */ 13832000
*/*               the local lock may not be owned, but the I/O driver*/ 13835000
*/*               has reasons for not wanting IECVPST to obtain it.  */ 13838000
*/*               Generally used by paging subsystems other than ASM */ 13841000
*/*               (for example, Media Manager) that are called by    */ 13844000
*/*               applications that could own the local lock but     */ 13847000
*/*               cannot pass a save area in an IORB.  IOSPSLL must  */ 13851990
*/*               also be on.  Post status gets the CPU lock, calls  */ 13853980
*/*               the IOS storage manager for a block of storage,    */ 13855970
*/*               frees the CPU lock and passes the IOS large block  */ 13857960
*/*               as a save area.  Performance should be considered  */ 13859950
*/*               when using this method.                        @19C*/ 13861940
*/*                                                                  */ 13868000
*/* Post Status valid bit combinations for requesting local lock     */ 13871000
*/* and/or save areas.                                               */ 13874000
*/*                                                                  */ 13877000
*/* |---------------------------------------------------------------|*/ 13880000
*/* |IOSPSLL | IOSIDR | IOSNOLL | Description                       |*/ 13883000
*/* |---------------------------------------------------------------|*/ 13886000
*/* |   0    |    0   |    0    | I/O driver requires the local lock|*/ 13889000
*/* |        |        |         | or a save area in which case, the |*/ 13892000
*/* |        |        |         | local lock is obtained and the    |*/ 13895000
*/* |        |        |         | save area passed is the local lock|*/ 13898000
*/* |        |        |         | save area.                        |*/ 13901000
*/* |---------------------------------------------------------------|*/ 13904000
*/* |   1    |    0   |    0    | I/O driver does not require the   |*/ 13907000
*/* |        |        |         | local lock or a save area.        |*/ 13910000
*/* |---------------------------------------------------------------|*/ 13913000
*/* |   1    |    1   |    0    | I/O driver must use indirect      |*/ 13916000
*/* |        |        |         | recording.  A save area is passed |*/ 13919000
*/* |        |        |         | via the IORB.  This combination is|*/ 13922000
*/* |        |        |         | ASM only.  ERPs are scheduled.    |*/ 13925000
*/* |---------------------------------------------------------------|*/ 13928000
*/* |   1    | 0 or 1 |    1    | Post status must not obtain the   |*/ 13931990
*/* |        |        |         | local lock.  Driver exits are     |*/ 13934000
*/* |        |        |         | passed a save area obtained from  |*/ 13937000
*/* |        |        |         | the IOS storage manager.          |*/ 13940000
*/* |---------------------------------------------------------------|*/ 13943990
*/*                                                                  */ 13946000
*/* All other combinations are invalid and will produce unpredictable*/ 13949000
*/* results.                                                         */ 13952000
*/*                                                              @19C*/ 13955990
*/********************************************************************/ 13958000
         AIF   ('&IOSIOSBE' NE 'YES').IOSBX3                       @D3A 13961000
         SPACE 2                                                        13964000
*/********************************************************************/ 13967000
*/* IOSB Extension - This optional extension is indicated by the     */ 13970000
*/*                  user by setting the IOSBEXTF flag to a 1        */ 13973000
*/*                  in byte IOSFLD.                                 */ 13976000
*/*                  The IOSB extension is designed to be upward     */ 13979000
*/*                  compatible.                                     */ 13982000
*/*                                                                  */ 13982600
*/* Note - The IOSB extension cannot grow beyond the end of an       */ 13983200
*/*        IOS large block (SRIO).                               @L3A*/ 13983800
*/*                                                                  */ 13984400
*/********************************************************************/ 13985000
IOSBEXT  DS    0XL48               IOSB extension                  @D3A 13988000
IOSXID   DS    CL4                 IOSB extension ID 'IOSB'             13991000
IOSXLEN  DS    H                   Length of IOSB extension             13994000
IOSXFLG1 DS    XL1                 Flag byte 1                          13997000
IOSXNORQ EQU   X'80'               .IOS is not to requeue this IOSB    X14000000
                                    if a Start Pending condition is    X14003000
                                    detected.                      @D3C 14006000
IOSXGDPR EQU   X'40'               .Do I/O even if device is           X14009000
                                    reserved on another path.  Only    X14012000
                                    valid if IOSGDP is set to a 1. @D3C 14015000
IOSXDDRT EQU   X'20'               .Flag to prevent repeated swapping   14017000
*                                   in a Tape Library environment  @L7C 14019000
IOSXMIHI EQU   X'10'               .Flag to inhibit MIH processing for  14020000
*                                  a single request.  If this bit is    14021000
*                                  set, then MIH processing is disabled 14022000
*                                  for this request only.  This bit is  14022200
*                                  applicable for STARTIO requests      14022400
*                                  only and is ignored for all other    14022600
*                                  requests (HSCH, CSCH, etc).  This    14022800
*                                  bit does not override the I/O        14023000
*                                  timing facility.                @L8C 14023200
IOSXIOSI EQU   X'08'               Flag indicating that the I/O         14023700
*                                  driver is performing non-disruptive  14024200
*                                  I/O.  This will cause the NTXTIOSR   14024700
*                                  bit to later be set to indicate this 14025200
*                                  condition to the notification        14025700
*                                  exit.                           @0BC 14026200
IOSXDPSV EQU   X'04'               DPS validation on CC3           @0DC 14026600
IOSXIOSN EQU   X'02'               Set by a driver indicating to        14027000
*                                  start the I/O operation              14027400
*                                  even if I/O synchronization is       14028000
*                                  active on the device (for IOS        14028600
*                                  recovery use only).             @LEA 14029200
IOSXATPS EQU   X'01'               Indicates that attention processing  14030500
*                                  was initiated for this I/O           14031800
*                                  operation.  Note: This bit is valid  14033100
*                                  only in an IOS sense IOSB.      @0EA 14034400
IOSXFLG2 DS    XL1                 Flag byte 2                     @D3A 14036000
IOSXIOT  EQU   X'80'               When off - IOSXTIME is for active    14037000
*                                  request only.                        14038000
*                                  When on - IOSXTIME is for active     14039000
*                                  and queued requests.            @10C 14040000
IOSXNMIH EQU   X'40'               When on - MIH should not create a    14041000
*                                  logrec entry or issue a message      14042000
*                                  when a timeout occurs due to         14043000
*                                  IOSXTIME                        @10C 14044000
IOSXCPNM EQU   X'20'               When set, the channel program        14044800
*                                   is not modified by the driver       14045600
*                                   during execution, other than        14046400
*                                   to add CCWs at the end         @15C 14047200
IOSXIDA2 EQU   X'10'               2K 8-Byte IDAWs                 @LFC 14047900
IOSXPCIS EQU   X'08'               PCI Synchronization:                 14048700
*                                   Set on by I/O driver to indicate    14049400
*                                   that the channel must               14050100
*                                   synchronize after the next CCW      14050800
*                                   following the the PCI (CCW+8)       14051500
*                                   when prefetching (IOSP) is also     14052200
*                                   set.                           @15C 14052900
IOSXDSMC EQU   X'04'               Set ON when Streaming Mode Control   14054690
*                                  is disabled for the current I/O      14055380
*                                  operation.                      @17C 14056070
*        EQU   X'02'               Reserved- initialized to zero        14057000
*        EQU   X'01'               Reserved for future expansion of     14060000
*                                  of the IOSB extension- initialized   14063000
*                                  to zero.                             14066000
IOSXSSXA DS    A                   Address of driver Start Subchannel  X14069000
                                   exit to be called if the UCB is not X14072000
                                   set to the normal level.             14075000
IOSXIOBE DS    A                   Address of the IOB extension.   @07A 14075600
IOSXRCOD DS    XL1                 Reason code detailing the IOSCOD     14076200
*                                  value                           @09A 14076800
IOSXRC9  EQU   X'09'               Reason code indicating started I/O   14077400
*                                  request timed-out               @09A 14078000
IOSXRC10 EQU   X'0A'               Reason code indicating queued I/O    14078600
*                                  request timed-out               @09A 14079200
IOSXRC11 EQU   X'0B'               Reason code indicating PAV binding   14079300
*                                  changed under IOSEXP request    @14A 14079400
IOSXRC12 EQU   X'0C'               Reason code for 64-bit IDAWs    @LFA 14079500
*                                  requested on unsupported host   @LFA 14079600
IOSXTIME DS    XL1                 Maximum time value, in seconds,      14079700
*                                  that the I/O driver allows           14079800
*                                  before an MIH condition is           14079900
*                                  declared, regardless of the MIH      14080000
*                                  setting for the device or            14080100
*                                  whether MIH is being bypassed.       14080200
*                                  (Mutually exclusive with IOSXMIHI    14080300
*                                   and IOS queue time is not counted   14080400
*                                  For IOS recovery use only            14080500
*                                  because a timeout condition will     14080600
*                                  be surfaced as an MIH condition      14080700
*                                  for the device                  @P3A 14080800
IOSXASPR DS    H                   Asid that will be used for I/O       14080900
*                                  priority queuing                @P2A 14081000
IOSXFLG3 DS    XL1                 Flag byte 3                     @14A 14081100
IOSXNSER EQU   X'80'               Indicates that the device may        14081200
*                                  bypass the channel program extent    14081300
*                                  collision checking.  Extent range    14081400
*                                  enforcement will remain active.      14081500
*                                  (DASD only)                     @14A 14081600
IOSXNVAL EQU   X'40'               Indicates that the device is to      14081700
*                                  bypass the validation checking       14081800
*                                  of the paramaters on Define Extent   14081900
*                                  and Locate Record commands.          14082000
*                                  Extent enforcement remains active.   14082100
*                                  (DASD only)                     @14A 14082200
*        EQU   X'3F'               Reserved                        @14A 14082300
         DS    XL3                 Reserved                        @14C 14082400
IOSXIOD  DS    A                   I/O Data Area                   @L9A 14082500
*********************************************************************** 14082600
*  IOS Extension miscellaneous field.  Dependent based on I/O         * 14082700
*  type.  Specific mappings are defined below.                    @P6A* 14082800
*********************************************************************** 14083000
IOSXMSC  DS    XL8                 Miscellaneous field            @P6A  14083200
*********************************************************************** 14085400
* Redefines IOSXMSC for normal I/O.                               @13M* 14086100
*---------------------------------------------------------------------* 14086800
         ORG   IOSXMSC             IOS Extension Miscellaneous mapping  14087500
*                                  for normal I/O requests        @13M  14087900
IOSXEIOP DS    2A                  Enclave I/O priority           @13M  14088300
*---------------------------------------------------------------------* 14088700
*********************************************************************** 14089200
* Redefines IOSXMSC for a sense I/O request.  IOSPROC= X'FA'      @13M* 14089500
*---------------------------------------------------------------------* 14089800
         ORG   IOSXMSC             IOS Extension Miscellaneous          14090100
*                                  mapping for sense I/O requests @13M  14090400
IOSXATI  DS    XL4                 Attention index save area.  Used     14090700
*                                  to preserve the attention index      14091000
*                                  while processing an unsolicited      14091300
*                                  interrupt with unit check            14091600
*                                  status                         @13M  14091700
IOSXSFLG DS    XL1                 Sense Flag byte                @18A  14091809
IOSXRAT2 EQU   X'80'               USLRRAT2 save area.  Used to         14091818
*                                  preserve this bit while processing   14091827
*                                  an unsolicited interrupt with        14091836
*                                  unit check status              @18A  14091845
IOSXRAT3 EQU   X'40'               USLRRAT3 save area.  Used to         14091854
*                                  preserve this bit while processing   14091863
*                                  an unsolicited interrupt with        14091872
*                                  unit check status              @18A  14091881
         DS    XL3                 Reserved for future use        @18C  14091890
*---------------------------------------------------------------------* 14091900
IOSXBASE DS    XL4                 When IOSEXP is set, this field       14092000
*                                  contains the corresponding           14092100
*                                  PAV-base UCB address           @14A  14092200
IOSXRSVF DS    XL8                 Reserved IOSB extension area         14092300
*                                  - initialized to zero          @14C  14092400
IOSEEND  EQU   *                   End of IOSB with extension     @D3C  14092500
         SPACE 3                                                  @12A  14092600
.IOSBX3  ANOP                                                           14092700
         MEND                                                        */ 14093000
*%IOSBX5: ;                        /*                                */ 14096000
*                                                                       14100000
* DCL 1 IOSB      BDY(WORD)    BASED(IOSBPTR),                          14120400
*       2 IOSBSTD              ,   /* IOSB Standard- includes the       14140800
*                                     modify amd store services         14161200
*                                     IOSB size.                     */ 14181600
*         4 IOSFLA      CHAR(1),   /* Flag byte A---                 */ 14202000
*           6 IOSACHN     BIT(2),  /* Command & Data chaining        */ 14222400
*             8 IOSDCHN   BIT(1),  /* Data chaining                  */ 14242800
*             8 IOSCCHN   BIT(1),  /* Command chaining               */ 14263200
*           6 IOSERR      BIT(1),  /* Error routine procedure (ERP)     14283600
*                                     in control.  Bit must be          14304000
*                                     initially set to zero by driver.  14324400
*                                     If ERP returns with this bit      14344800
*                                     set to a 1, a retry is assumed.   14365200
*                                     If the ERP returns with the bit   14385600
*                                     set to 0, the error is            14406000
*                                     considered permanent or           14426400
*                                     corrected depending on the        14446800
*                                     setting of the IOSEX bit.      */ 14467200
*           6 IOSSMDA     BIT(1),  /* ERP status modifier bit A.        14487600
*                                     Must be zeroed by driver.         14508000
*                                      TAPE - Reposition device.        14528400
*                                      U/R  - Immediate operation,      14548800
*                                        CCW OP code in  IOSMDB.     */ 14569200
*           6 IOSSMDB     BIT(1),  /* ERP status modifier bit B.        14589600
*                                     Must be zeroed by driver.         14610000
*                                     Set by fetch in exit for          14630400
*                                     posting.                          14650800
*                                      TAPE- CRC needed.                14671200
*                                      DASD- PCI fetch stop flag.    */ 14691600
*           6 IOSEX       BIT(1),  /* Exceptional condition.            14712000
*                                     Upon return from normal or        14732400
*                                     abnormal exit with this bit set   14752800
*                                     to a 1, ERP processing is         14773200
*                                     initiated if initial error        14793600
*                                     condition.  If bit is set to      14814000
*                                     0, it is assumed that the exit    14834400
*                                     corrected the condition or did    14854800
*                                     not consider it an error.  When   14875200
*                                     the ERP returns with this bit     14895600
*                                     set to a 1 and the IOSERR bit     14916000
*                                     set to 0, the error is            14936400
*                                     considered permanent.             14956800
*                                     When the ERP returns with this    14977200
*                                     bit set to a 1, the error         14997600
*                                     has been corrected.            */ 15018000
*           6 IOSDOM      BIT(1),  /* DOM macro required.            */ 15038400
*           6 IOSIOSB     BIT(1),  /* IOS generated IOSB and obtained   15058800
*                                     from the IOS storage manager.  */ 15079200
*                                                                       15100000
*         4 IOSFLB       CHAR(1),  /* Flag byte B                    */ 15150000
*           6 IOSDIESE    BIT(1),  /* Second entry to DIE            */ 15200000
*           6 IOSSDR      BIT(1),  /* ERP doesnt want OBR            */ 15250000
*           6 IOSNOTRS    BIT(1),  /* Driver does not require an        15300000
*                                     address space switch on entry     15350000
*                                     to DIE.                        */ 15400000
*           6 IOSRESRC    BIT(1),  /* IOS resources are held.  Must     15450000
*                                     be initialized to zero by driver. 15500000
*                                     With bit set, the drivers DIE     15550000
*                                     cannot return on codes 12         15600000
*                                     or 16.                         */ 15650000
*           6 IOSIONRD    BIT(1),  /* Set by a driver to request that   15700000
*                                     the I/O request be issued to a    15750000
*                                     not-ready device.              */ 15800000
*           6 IOSMSG      BIT(1),  /* Message indicators for WTO        15850000
*                                     service.                          15900000
*                                     0 = Intervention required msg.    15950000
*                                     1 = I/O error message.         */ 16000000
*           6 IOSBDCST    BIT(1),  /* Broadcast bit                  */ 16050000
*           6 IOSLOG      BIT(1),  /* Create an OBR record.          */ 16100000
*                                                                       17500000
*         4 IOSFLC       CHAR(1),  /* Flag byte C                    */ 17511200
*           6 IOSGDPLP    BIT(1),  /* With IOSGDP set, limit IOSGPMSK   17522400
*                                     field to logically available      17533600
*                                     paths (UCBLPM).            @02C*/ 17544800
*           6 IOSEIDAW    BIT(1),  /* Extended 4K 8-byte IDAWs   @LFC*/ 17558800
*             8 IOSVERIF  BIT(1),  /* Non-DASD unsolicited device end   17572800
*                                     verification needed.           */ 17586800
*           6 IOSCC3WE    BIT(1),  /* Set by a driver to request        17600800
*                                     deferred condition code 3         17612000
*                                     posting (post code of X'6D').  */ 17623200
*           6 IOSEXP      BIT(1),  /* Set by a driver to request a      17634400
*                                     specific exposure request.        17645600
*                                     IOSUCB contains the specific      17656800
*                                     exposure UCB address.          */ 17668000
*           6 IOSNORWS    BIT(1),  /* No Read/Write Synchronization:    17668900
*                                     Set on by I/O driver to indicate  17669800
*                                     that the channel should not       17670700
*                                     synchronize on read/write         17671600
*                                     transitions when prefetching      17672500
*                                     (IOSP) is also set.  The driver   17673400
*                                     insures that the read and         17674300
*                                     writes are from different I/O     17675200
*                                     buffers                    @15A*/ 17676100
*           6 IOS2CSWS    BIT(1),  /* Two Channel Status Words:         17677000
*                                     Set on by the I/O driver to       17677900
*                                     indicate that when CCW prefetch   17678800
*                                     is requested (IOSP), if an error  17679700
*                                     occurs where the control unit     17680600
*                                     executes ahead of the channel,    17681500
*                                     two ending CCW addresses          17682400
*                                     should be presented to the        17683300
*                                     driver.  The second ending        17684200
*                                     CCW address is contained in the   17685100
*                                     IEDB.  If this bit is off,        17686000
*                                     an invalid ending CCW address     17686900
*                                     is simulated by IOS        @15A*/ 17687800
*           6 IOSNORTY    BIT(1),  /* No retry allowed           @06A*/ 17690400
*             8 IOSCTCNR  BIT(1),  /* CTC-No retry allowed       @06C*/ 17696000
*           6 IOSGDP      BIT(1),  /* Set by a driver to indicate a     17701600
*                                     guaranteed device path (GDP)      17712800
*                                     request.  IOSGPMSK contains       17724000
*                                     the path(s) involved.          */ 17735200
*/********************************************************************/ 17746400
*/* IOSPROC - This byte indicates what type of special processing    */ 17757600
*/*           that is to be performed for IOS generated IOSBs.       */ 17768800
*/*           This processing normally runs asynchronous to          */ 17780000
*/*           IOS mainline processing.  This field must be set to    */ 17791200
*/*           zero by drivers.  IOSPROC values are assigned by IOS.  */ 17802400
*/*------------------------------------------------------------------*/ 17813600
*/*           DCLs constants are provided at end of IOSB.            */ 17824800
*/********************************************************************/ 17836000
*         4 IOSPROC       CHAR(1), /* IOSPROC field                  */ 17847200
*/********************************************************************/ 17858400
*/* IOSDVRID - This byte indentifies the I/O driver requesting the   */ 17869600
*/*            I/O request.  Driver identification values are        */ 17880800
*/*            assigned by IOS.                                      */ 17892000
*/*------------------------------------------------------------------*/ 17903200
*/*           DCLs constants are provided at end of IOSB.            */ 17914400
*/********************************************************************/ 17925600
*         4 IOSDVRID  CHAR(1),     /* Driver ID value field          */ 17936800
*                                                                       17950000
*         4 IOSFLD    CHAR(1),     /* Flag byte D                @D1C*/ 17950800
*           6 IOSNOINT BIT(1),     /* Set by a driver to request that   17951600
*                                     the I/O request be issued to      17952400
*                                     a device that has an intercept    17953200
*                                     condition.  The intercept         17954000
*                                     condition is to be saved for      17954800
*                                     the next I/O request.      @D1C*/ 17955600
*           6 IOSMNORQ BIT(1),     /* IOS is not to requeue this        17956400
*                                     IOSB if a Start Pending           17957200
*                                     condition is detected (MIH, etc). 17958000
*                                                                @01C*/ 17958800
*           6 IOSEPCIF BIT(1),     /* Early PCI exit call Flag. Set     17959600
*                                     by the I/O driver to get called   17960400
*                                     from the SLIH, instead of from    17961200
*                                     post status for good intermediate 17962000
*                                     status.                    @L4C*/ 17962800
*           6 IOSCCWDS BIT(1),     /* Channel program resides in a      17963600
*                                     data space.  Set by the I/O       17964400
*                                     driver.                    @L4C*/ 17965200
*           6 IOSEPCIS BIT(1),     /* Early PCI exit Space switch       17966000
*                                     flag.  Set by the I/O driver to   17966800
*                                     indicate that IOSVSLIH should     17967600
*                                     CMSET to the driver's address     17968400
*                                     space prior to invoking the PCI   17969200
*                                     exit.                      @L4C*/ 17970000
*           6 IOSLIOPF BIT(1),     /* Long I/O Post flag set by the I/O 17970800
*                                     driver to indicate that driver    17971600
*                                     should be posted back if the I/O  17972400
*                                     request will take a long time to  17973200
*                                     complete due to an MIH condition, 17974000
*                                     manual intervention, etc.. @D4C*/ 17974800
*           6 IOSNOLL  BIT(1),     /* Set by the driver to indicate     17975600
*                                  that post status must not get the    17976400
*                                  local lock in order to use the local 17977200
*                                  lock save area, as deadlock could    17978000
*                                  occur. IOSPSLL must also be set      17979290
*                                  by the driver.                @19C*/ 17979780
*           6 IOSBEXTF BIT(1),     /* IOSB extension valid       @D3A*/ 17980400
*         4 IOSASID   FIXED(15),   /* Address space identification of   17981200
*                                     address space to be scheduled     17982000
*                                     at termination of the I/O         17982800
*                                     request.                       */ 17983600
*         4 IOSPGAD   PTR(31),     /* I/O driver termination address.   17984400
*                                     High order bit defines the        17985200
*                                     addressing mode.  For attention   17986000
*                                     processing, this field contains   17986800
*                                     the attention address.         */ 17987600
*         4 IOSPKEY BIT(8),        /* Protect key of IOSPGAD         */ 17988400
*           6 *       BIT(4),      /* Protect key field.             */ 17989200
*           6 IOSLCL  BIT(1),      /* ASID schedule at local level   */ 17990000
*           6 IOSIDR  BIT(1),      /* Asynchronous ERP scheduling       17990800
*                                     should be used for this           17991600
*                                     request (indirect recording       17992400
*                                     for paging I/O).               */ 17993200
*           6 IOSPGDPX BIT(1),     /* This request has a back-up        17994000
*                                     copy (duplexed page)           */ 17994800
*           6 IOSCHCMP BIT(1),     /* Set by driver to indicate that    17995600
*                                     the driver has built a complete   17996400
*                                     channel program, IOS is not to    17997200
*                                     build a standard prefix.       */ 17998000
*/********************************************************************/ 17998800
*/*  Field IOSCOD values - I/O completion codes                      */ 17999600
*/*                        IOSCOD values assigned by IOS.            */ 18000400
*/*                        DCLs constants are provided at the end    */ 18001200
*/*                        of the IOSB.                              */ 18002000
*/*------------------------------------------------------------------*/ 18002800
*/*  Completion codes 41 - 5F - Indicate permanent error conditions  */ 18003600
*/*                             these codes will always be last      */ 18004400
*/*                             entry codes to abnormal end exits.   */ 18005200
*/*  Completion codes 60 - 73 - Indicate conditions that IOS has     */ 18006000
*/*                             detected in processing the I/O       */ 18006800
*/*                             request.                             */ 18007600
*/*  Completion codes 74 - 7E - Indicate abnormal conditions for     */ 18008400
*/*                             which correction may be possible.    */ 18009200
*/*                             These codes denote first entry to    */ 18010000
*/*                             abnormal exits.                      */ 18010800
*/*  Completion code  7F      - Indicate normal I/O completion.      */ 18011600
*/*                             It does not indicate that the I/O    */ 18012400
*/*                             request completed successfully.      */ 18013200
*/*------------------------------------------------------------------*/ 18014000
*/*  Completion code  49      - Applies only to Store and Modify     */ 18014800
*/*                             subchannel requests.                 */ 18015600
*/********************************************************************/ 18016400
*         4 IOSCOD    CHAR(1),     /* I/O completion code field.     */ 18017200
*/********************************************************************/ 18018000
*/* IOSOPT and IOSOPT2 bit definitions - For Start Subchannel        */ 18018800
*/*        requests.  See redefinition area for definitions for      */ 18019600
*/*        modify and store subchannel requests.                     */ 18020400
*/********************************************************************/ 18021200
*         4 IOSOPT    CHAR(1),     /* Driver requested option byte.  */ 18022000
*           6 IOSBYP  BIT(1),      /* Bypass IOS channel program        18022800
*                                     prefixing.                     */ 18023600
*           6 IOSDEP  BIT(1),      /* Device-end post requested.     */ 18024400
*           6 IOSQISCE BIT(1),     /* For callers using the STARTIO     18025200
*                                     macro compatability interface     18026000
*                                     (all others should place the      18026800
*                                     quiesce level in the IOSLEVEL     18027600
*                                     field).  This request initiated   18028400
*                                     by a request that has set the     18029200
*                                     quiesce level in the UCB.      */ 18030000
*           6 IOSPSLL BIT(1),      /* If 0, Local lock needed for IOS   18030800
*                                           Post Status processing.     18031600
*                                     If 1, Local lock not needed.   */ 18032400
*           6 IOSNERP BIT(1),      /* If flag UCBLERP is off, ERPs      18032500
*                                     are not to be used.  If UCBLERP   18032600
*                                     is on, ERPs will unconditionally  18032700
*                                     get control.  ERPs will only be   18032800
*                                     allowed to perform recovery of    18032900
*                                     non-error unit checks and any     18033000
*                                     additional function as defined by 18033100
*                                     intermediate ERP mask flags. When 18033200
*                                     this flag is on, ERPs may not     18033300
*                                     perform any recovery for error    18033400
*                                     cases except as defined by the    18033500
*                                     ERP mask flags.            @07C*/ 18033600
*           6 IOSTSLL BIT(1),      /* If 0, Local lock needed by the    18034000
*                                           termination routine.        18034800
*                                           (IOSPSLL must be off).      18035600
*                                     If 1, Local lock not needed by    18036400
*                                           the termination routine     18037200
*                                                                    */ 18038000
*           6 IOSAPR  BIT(1),      /* Alternate path retry (APR)        18038800
*                                     active.  IOSGPMSK contains the    18039600
*                                     available retry paths.  Must be   18040400
*                                     initially set to zero by driver*/ 18041200
*           6 IOSRELSE BIT(1),     /* Request for a stand-alone         18042000
*                                     release CCW to be issued       */ 18042800
*/********************************************************************/ 18043600
*/* IOSOPT2 - This byte reflects the I/O driver conditions for       */ 18044400
*/*           initiating an I/O request to the subchannel. See       */ 18045200
*/*           architecture for the meaning of these conditions.      */ 18046000
*/*           This byte also reflects the IRB interrupt status.      */ 18046800
*/*------------------------------------------------------------------*/ 18047600
*         4 IOSOPT2   CHAR(1),     /* Driver requested option byte 2 */ 18048400
*           6 IOSF    BIT(1),      /* CCW FORMAT-----                   18049200
*                                     If 0, Format 0 CCWs provided.     18050000
*                                     If 1, Format 1 CCWS provided.  */ 18050800
*           6 IOSP    BIT(1),      /* If 0, the driver does not         18051600
*                                           want 'unlimited CCW         18052400
*                                           prefetch'.                  18053200
*                                     If 1, the driver wants            18054000
*                                           'unlimited CCW prefetch' */ 18054800
*           6 IOSI    BIT(1),      /* If 0, the driver does not         18055600
*                                           want 'initial status        18056400
*                                           interruption' generated.    18057200
*                                     If 1, the driver wants            18058000
*                                           'initial status             18058800
*                                           interruption' generated. */ 18059600
*           6 IOSA    BIT(1),      /* If 1, the driver requests         18060400
*                                           address limit check.     */ 18061200
*           6 IOSSI   BIT(1),      /* If 1, the driver requests         18062000
*                                           suppress suspend            18062800
*                                           interruption.            */ 18063600
*           6 IOSZ    BIT(1),      /* If 1, zero condition code to      18064400
*                                           initial selection           18065200
*                                           (interrupt condition).   */ 18066000
*           6 IOSE    BIT(1),      /* If 1, Extended control            18066800
*                                           information stored with     18067600
*                                           interrupt (this bit is      18068400
*                                           provided for information    18069200
*                                           only, the stored data       18070000
*                                           cannot be found from        18070800
*                                           the IOSB).               */ 18071600
*           6 IOSN    BIT(1),      /* If 1, path not operationsl.    */ 18072400
*/********************************************************************/ 18073200
*/* Unit Control Block (UCB) address - address to common segment.    */ 18074000
*/********************************************************************/ 18074800
*         4 IOSUCB    PTR(31),     /* Unit Control Block address     */ 18075600
*/********************************************************************/ 18076400
*/*IOSFCSW  field - Subchannel Status Word field.                    */ 18077200
*/*------------------------------------------------------------------*/ 18078000
*/*Format 0 CCW requests - Start Subchannel deferred condition code  */ 18078800
*/*         is stored in the IOSCC field and the 3 byte command      */ 18079600
*/*         address in IOSCSWCA (compatable with System/370).        */ 18080400
*/*         See redefinition area for format 0 CCW.                  */ 18081200
*/********************************************************************/ 18082000
*         4 IOSFCSW   CHAR(8) BDY(WORD),  /* 8 byte subchannel CSW.  */ 18082800
*           6 IOSCCWAD PTR(31),    /* Format 1 CCW address.             18083600
*                                     See redefinition area for         18084400
*                                     format 0 usage of the word.    */ 18085200
*           6 IOSTATUS  CHAR(2),   /* CSW status                     */ 18086000
*             8 IOSTSA,            /* Device status                  */ 18086800
*               10 IOSDSTAT    BIT(8), /* Device status              */ 18087600
*                  12 IOSDSATN BIT(1), /* Attention                  */ 18088400
*                  12 IOSDSSM  BIT(1), /* Status Modifier            */ 18089200
*                  12 IOSDSCUE BIT(1), /* Control Unit End           */ 18090000
*                  12 IOSDSBSY BIT(1), /* Busy                       */ 18090800
*                  12 IOSDSCE  BIT(1), /* Channel End                */ 18091600
*                  12 IOSDSDE  BIT(1), /* Device End                 */ 18092400
*                  12 IOSDSUC  BIT(1), /* Unit Check                 */ 18093200
*                  12 IOSDSUEX BIT(1), /* Unit Exception             */ 18094000
*             8 IOSTSB,                /* Subchannel Status          */ 18094800
*               10 IOSSSTAT   BIT(8),  /* Subchannel Status          */ 18095600
*                  12 IOSSSPCI BIT(1), /* Program-Controlled Interupt*/ 18096400
*                  12 IOSSSIL  BIT(1), /* Incorrect Length           */ 18097200
*                  12 IOSSSPGC BIT(1), /* Program Check              */ 18098000
*                  12 IOSSSPTC BIT(1), /* Protection Check           */ 18098800
*                  12 IOSSSCDC BIT(1), /* Channel-Data Check         */ 18099600
*                  12 IOSSSCCC BIT(1), /* Channel-Control Check      */ 18100400
*                  12 IOSSSICC BIT(1), /* Interface-Control Check    */ 18101200
*                  12 IOSSSCC  BIT(1), /* Chaining Check             */ 18102000
*           6 IOSCSWRC PTR(16) BDY(WORD,3), /* Residual Count        */ 18102800
*/*------------------------------------------------------------------*/ 18103600
*         4 IOSSRB    PTR(31),     /* Pointer back to drivers SRB.   */ 18104400
*         4 IOSUSE    PTR(31),     /* IOSB owner use field           */ 18105200
*         4 IOSIOPID  PTR(31),     /* The I/O prevention identifier     18106000
*                                     (IOPID) that covers this          18106800
*                                     I/O request.               @L1C*/ 18107600
*/********************************************************************/ 18108400
*/* Subchannel control field provided with the Subchannel status     */ 18109200
*/* word (SCSW).                                                     */ 18110000
*/********************************************************************/ 18110800
*         4 IOSSCHC   BIT(16),     /* Subchannel Control field       */ 18111600
*           6 *       BIT(1),      /* Reserved for architecture      */ 18112400
*           6 IOSFC   BIT(3),      /* Function Control field.........*/ 18113200
*             8 IOSFSSCH  BIT(1),  /* .. Start Subchannel            */ 18114000
*             8 IOSFHSCH  BIT(1),  /* .. Halt Subchannel             */ 18114800
*             8 IOSFCSCH  BIT(1),  /* .. Clear Subchannel            */ 18115600
*           6 IOSAC   BIT(7),      /* Activity Control field.........*/ 18116400
*             8 IOSARSCH  BIT(1),  /* .. Resume Pending              */ 18117200
*             8 IOSASSCH  BIT(1),  /* .. Start  Pending              */ 18118000
*             8 IOSAHSCH  BIT(1),  /* .. Halt   Pending              */ 18118800
*             8 IOSACSCH  BIT(1),  /* .. Clear  Pending              */ 18119600
*             8 IOSASUBA  BIT(1),  /* .. Subchannel Active           */ 18120400
*             8 IOSADEVA  BIT(1),  /* .. Device Active               */ 18121200
*             8 IOSSSPND  BIT(1),  /* .. Subchannel Suspended        */ 18122000
*           6 IOSSC   BIT(5),      /* Status Control Field...........*/ 18122800
*             8 IOSSALRT  BIT(1),  /* .. Alert status                */ 18123600
*             8 IOSSINTR  BIT(1),  /* .. Intermediate status         */ 18124400
*             8 IOSSPRIM  BIT(1),  /* .. Primary status              */ 18125200
*             8 IOSSSEC   BIT(1),  /* .. Secondary status            */ 18126000
*             8 IOSSPNDG  BIT(1),  /* .. Status pending  (if bit is 0,  18126800
*                                        this is simulated status).  */ 18127600
*/********************************************************************/ 18128400
*/* IOSSNS  - With unit check, contains the first two bytes of the   */ 18129200
*/*           sense data.  With field set to X'10FE', this is an     */ 18130000
*/*           indication of unsuccessful sense.                      */ 18130800
*/********************************************************************/ 18131600
*         4 IOSSNS    BIT(16),     /* 1st two bytes of sense data    */ 18132400
*/********************************************************************/ 18133200
*/*  End of common section - start of processing dependent sections. */ 18134000
*/*  ..  NML - Normal I/O request processing                         */ 18134800
*/*  ..  WTO - attention processing                                  */ 18135600
*/*  ..  PCI - Intermediate status processing                        */ 18136400
*/********************************************************************/ 18137200
*         4 IOSIPIB   PTR(31),     /* NML- IPIB address (IOS/Purge).    18138000
*                                     Initially set to zero by driver   18138800
*                                     and not to be reset by exits.     18139600
*                                     PCI- Intermediate status          18140400
*                                     SRB/IOSB chain pointer.        */ 18141200
*         4 IOSPCHN   PTR(31),     /* NML- Pointer to 1st               18142000
*                                     intermediate status SRB/IOSBs.    18142800
*                                     PCI- Pointer to ending status     18143600
*                                     IOSB for intermediate status      18144400
*                                     SRB/IOSBs.                     */ 18145200
*         4 IOSERP    PTR(31),     /* ERP - Error Work Area (EWA)       18146000
*                                     address provided.  Must           18146800
*                                     initially be set to zero          18147600
*                                     by driver.                     */ 18148400
*/********************************************************************/ 18149200
*/* Driver Exit addresses - High order bit defines addressing mode.  */ 18150000
*/********************************************************************/ 18150800
*         4 IOSPCI    PTR(31),     /* Intermediate status exit          18151600
*                                     address or zero.               */ 18152400
*         4 IOSNRM    PTR(31),     /* Normal end exit address        */ 18153200
*         4 IOSABN    PTR(31),     /* Abnormal end exit address      */ 18154000
*         4 IOSDIE    PTR(31),     /* Disabled Interrupt Exit           18154800
*                                     address or zero.               */ 18155600
*/********************************************************************/ 18156400
*/* Real Channel program - virtual and real addresses.               */ 18157200
*/********************************************************************/ 18158000
*         4 IOSRST    PTR(31),     /* Real    address                */ 18158800
*         4 IOSVST    PTR(31),     /* Virtual address                */ 18159600
*/*------------------------------------------------------------------*/ 18160400
*         4 IOSDSID   PTR(31),     /* Data set ID for purge- set by     18161200
*                                     driver or zero.                */ 18162000
*         4 IOSLEVEL  FIXED(8),    /* IOS serialization level        */ 18162800
*         4 IOSGPMSK  BIT(8),      /* GDP- Guaranteed Device path       18163600
*                                           mask with IOSGDP bit set.   18164400
*                                     APR- Alternate Path Retry path    18165200
*                                           mask with IOSAPR bit set */ 18166000
*         4 IOSDCTI   FIXED(16),   /* IRB DCTI field- the I/O request   18166800
*                                     device connect time.           */ 18167600
*         4 IOSFMSK   CHAR(1),     /* Mode set/File mask             */ 18168400
*/*------------------------------------------------------------------*/ 18169200
*         4 IOSCKEY   BIT(8),      /* On STARTIO- Channel program       18170000
*                                     protect key.                      18170800
*                                     On interrupt- 1st byte of IRB  */ 18171600
*           6 IOSIRBKY BIT(4),     /* Protect key - bits 0-3         */ 18172400
*           6 IOSS     BIT(1),     /* The I/O request has suspend       18173200
*                                     capability.                    */ 18174000
*           6 IOSIRBL  BIT(1),     /* If 1, ESW contains logout data */ 18174800
*           6 IOSIRBCC BIT(2),     /* SSCH deferred condition code   */ 18175600
*/*------------------------------------------------------------------*/ 18176400
*         4 IOSMDB    CHAR(1),     /* ERP immediate CCW oper code    */ 18177200
*         4 IOSMDM    CHAR(1),     /* ERP modifier mask              */ 18178000
*/*------------------------------------------------------------------*/ 18178800
*         4 IOSEEK    CHAR(8),     /* Static seek address            */ 18179600
*           6 *         CHAR(4),   /* Padding                @G860PLN*/ 18180400
*           6 IOSCTC    CHAR(4),   /* Start of CTC overlay- see below   18181200
*                                                            @G860PLN*/ 18182000
*/*------------------------------------------------------------------*/ 18182800
*         4 IOSEEKA CHAR(8) BDY(WORD), /* Dynamic seek address       */ 18183600
*           6 IOSSKM  PTR(8),               /*   M                   */ 18184400
*           6 IOSSKBB PTR(16) BDY(WORD,2),  /*  BB                   */ 18185200
*           6 IOSCCHH CHAR(4) BDY(WORD,4),  /*  CCHH                 */ 18186000
*             8 IOSSKCC PTR(16) BDY(WORD,4),/*  CC                   */ 18186800
*             8 IOSSKHH PTR(16) BDY(WORD,2),/*  HH                   */ 18187600
*               10 IOSSKH1 PTR(8),          /*   H                   */ 18188400
*               10 IOSSKH2  PTR(8),         /*   H                   */ 18189200
*           6 IOSSKR  PTR(8),               /*   R                   */ 18190000
*/*------------------------------------------------------------------*/ 18190800
*%IF IOSIOSBE='YES'  %THEN                                              18191600
*    %GOTO IOSBX7;                                                      18192400
*       2 IOSEND   CHAR(0);         /* End of IOSB w/o extension     */ 18193200
*%GOTO IOSBX8;                                                          18194000
*%IOSBX7: ;                                                             18194800
*       2 IOSEND   CHAR(0),         /* End of standard IOSB      @D3C*/ 18195600
*/********************************************************************/ 18196400
*/* IOSB Extension - This optional IOSB extension is indicated by    */ 18197200
*/*                  the user by setting the IOSBEXTF flag in        */ 18198000
*/*                  byte IOSFLD.                                    */ 18198800
*/*                  The IOSB extension is designed to be            */ 18199600
*/*                  upward compatible.                              */ 18200400
*/*                                                                  */ 18200700
*/* Note - The IOSB extension cannot grow beyod the end of the       */ 18201000
*/*        IOS large block (SRIO).                               @L3A*/ 18201300
*/*                                                                  */ 18201600
*/********************************************************************/ 18201900
*       2 IOSBEXT  CHAR(48)  BDY(WORD), /* IOSB Extension        @L3A*/ 18202200
*         4 IOSXID   CHAR(4) BDY(WORD), /* ID - C'IOSB'          @D3C*/ 18202800
*         4 IOSXLEN  FIXED(15),        /* IOSB extension length      */ 18203600
*         4 IOSXFLG1 BIT(8),           /* Flag byte 1............    */ 18204400
*           6 IOSXNORQ BIT(1),         /* .. MIH is not to requeue      18205200
*                                            this IOSB if a Start       18206000
*                                            Pending condition is       18206800
*                                            detected.           @D3C*/ 18207600
*           6 IOSXGDPR BIT(1),         /* .. Do I/O even if device      18208400
*                                            is reserved on another     18209200
*                                            path.  Valid if            18210000
*                                            IOSGDP bit is on.   @D3C*/ 18210800
*           6 IOSXDDRT BIT(1),     /* Flag used to prevent swapping     18211600
*                                    in Tape Library Environment @L7C*/ 18212400
*           6 IOSXMIHI BIT(1),     /* Flag used to inhibit MIH          18212700
*                                     processing for a single request.  18212900
*                                     If this bit is set, then MIH      18213100
*                                     processing is disabled for this   18213300
*                                     request only.  This bit is        18213400
*                                     applicable for STARTIO requests   18213500
*                                     only and is ignored for all other 18213600
*                                     requests (HSCH, CSCH, etc).  This 18213700
*                                     bit does not override the I/O     18213800
*                                     timing facility.           @L8C*/ 18213900
*           6 IOSXIOSI BIT(1),     /* Flag indicating that the I/O      18214000
*                                     driver is performing non-         18214100
*                                     disruptive I/O.  This will cause  18214200
*                                     the NTXTIOSR bit to later be set  18214300
*                                     to indicate this condition to     18214400
*                                     the notification exit.     @0BC*/ 18214500
*           6 IOSXDPSV BIT(1),     /* DPS validation on CC3      @0DC*/ 18214600
*           6 IOSXIOSN BIT(1),     /* Set by a driver indicating to     18214700
*                                     start the I/O operation           18214800
*                                     even if I/O synchronization is    18214900
*                                     active on the device (for IOS     18215000
*                                     recovery use only).        @LEA*/ 18215100
*           6 IOSXATPS BIT(1),     /* Indicates that attention          18215300
*                                     processing was initiated for      18215500
*                                     this I/O operation.  Note:        18215700
*                                     This bit is valid only in an      18215900
*                                     IOS sense IOSB.            @0EA*/ 18216100
*         4 IOSXFLG2 BIT(8),       /* Flag byte 2..............  @D3A*/ 18216400
*           6 IOSXIOT  BIT(1),     /* When off - IOSXTIME is for        18216500
*                                     active request only.              18216600
*                                     When on - IOSXTIME is for         18216700
*                                     active and queued requests.       18216800
*                                                                @10C*/ 18216900
*           6 IOSXNMIH BIT(1),     /* When on - MIH should not create   18217000
*                                     a logrec entry or issue a         18217100
*                                     message when a timeout occurs     18217200
*                                     due to IOSXTIME            @10C*/ 18217300
*           6 IOSXCPNM BIT(1),     /* When set, the Channel program     18217400
*                                     is not modified by the driver     18217500
*                                     during execution, other than      18217600
*                                     to add CCWs at the end.    @15C*/ 18217700
*           6 IOSXIDA2 BIT(1),     /* When on - 2K 8-byte IDAWs  @LFC*/ 18218000
*           6 IOSXPCIS BIT(1),     /* PCI Synchronization:              18218300
*                                      Set on by I/O driver to          18218600
*                                      indicate that the channel must   18218900
*                                      synchronize after the next CCW   18219200
*                                      following the the PCI (CCW+8)    18219500
*                                      when prefetching (IOSP) is       18219800
*                                      also set.                 @15C*/ 18220100
*           6 IOSXDSMC BIT(1),     /* Set ON when Streaming Mode Control18220590
*                                     is disabled for the current I/O   18220780
*                                     operation.                 @17C*/ 18220970
*           6 *        BIT(1),     /* Reserved- initialized to zero  */ 18221200
*           6 *        BIT(1),     /* Reserved for future expansion     18222800
*                                     of the IOSB extension-            18223600
*                                     initialized to zero            */ 18224400
*         4 IOSXSSXA PTR(31),      /* Address of driver start           18225200
*                                     subchannel exit to be             18226000
*                                     called if the UCB is not          18226800
*                                     set to the normal level.          18227600
*                                     IOSXSSXV bit must be set to       18228400
*                                     a 1 in order to use this          18229200
*                                     field.                         */ 18230000
*         4 IOSXIOBE PTR(31),      /* Address of the IOB extension.     18230200
*                                                                @07A*/ 18230400
*         4 IOSXRCOD FIXED(8),     /* Reason code detailing IOSCOD      18230600
*                                     value                      @09A*/ 18230800
*         4 IOSXTIME FIXED(8),     /* Maximum time value, in seconds,   18231600
*                                     that the I/O driver allows        18232400
*                                     before an MIH condition is        18233200
*                                     declared, regardless of the MIH   18234000
*                                     setting for the device or         18234800
*                                     whether MIH is being bypassed.    18235600
*                                    (Mutually exclusive with IOSXMIHI, 18236400
*                                     and IOS queue time is not         18237200
*                                     counted)                          18238000
*                                    For IOS recovery use only          18238800
*                                    because a timeout condition will   18239600
*                                    be surfaced as an MIH condition    18240400
*                                    for the device              @P3A*/ 18241200
*         4 IOSXASPR FIXED(15),    /* Asid that will be used for I/O    18242000
*                                     priority queuing           @P2A*/ 18242800
*         4 IOSXFLG3 BIT(8),       /* Flag byte 3                @14A*/ 18243000
*           5 IOSXNSER BIT(1),     /* Indicates that the device may     18243200
*                                     bypass the channel program        18243400
*                                     extent collision checking.        18243600
*                                     Extent range enforcement will     18243800
*                                     remain active. (DASD only) @14A*/ 18244000
*           5 IOSXNVAL BIT(1),     /* Indicates that the device is to   18244200
*                                     bypass the validation checking    18244400
*                                     of the paramaters on Define       18244600
*                                     Extent and Locate Record          18244800
*                                     commands.  Extent enforcement     18245000
*                                     will remain active.               18245200
*                                     (DASD only)                @14A*/ 18245400
*           5 *        BIT(6),     /* Reserved                   @14A*/ 18245600
*         4 *        CHAR(3),      /* Reserved                   @14C*/ 18245800
*         4 IOSXIOD  PTR(31),      /* I/O Data Area              @L9A*/ 18246000
*/********************************************************************/ 18246300
*/*  IOS Extension miscellaneous field.  Dependent based on I/O      */ 18246600
*/*  type.  Specific mappings are defined below.                 @P6A*/ 18246900
*/********************************************************************/ 18247200
*         4 IOSXMSC  CHAR(8) BDY(WORD), /* Miscellaneous Field   @P6A*/ 18247500
*         4 IOSXBASE PTR(31),      /* When IOSEXP is set, this field    18247600
*                                     contains the corresponding        18247700
*                                     PAV-base UCB address       @14A*/ 18247800
*         4 IOSXRSVF CHAR(08),     /* Reserved IOSB extension area-     18247900
*                                     initialized to zero        @14C*/ 18248000
*     2 IOSEEND   CHAR(0);         /* End of IOSB w extension        */ 18248400
*                                                                       18250000
*@SPACE(3);                                                             18255500
*/********************************************************************/ 18261000
*/*  Redefines IOSXMSC for a normal I/O request.                 @P6A*/ 18266500
*/********************************************************************/ 18272000
* DCL 1 IOSXMSCN DEF(IOSXMSC) CHAR(8), /* IOS Extension Miscellaneous   18277500
*                                     mapping for normal I/O            18283000
*                                     requests.                  @P6A*/ 18288500
*         4 IOSXEIOP CHAR(8);      /* Enclave I/O priority       @P6A*/ 18294000
*/********************************************************************/ 18294400
*/*  Redefines IOSXMSC for a sense I/O request.  IOSPROC= X'FA'  @12A*/ 18294800
*/********************************************************************/ 18295200
* DCL 1 IOSXMSCS DEF(IOSXMSC) CHAR(8), /* IOS Extension Miscellaneous   18295600
*                                     mapping for sense I/O             18296000
*                                     requests.                  @12A*/ 18296400
*         4 IOSXATI FIXED(31),     /* Attention index save area.        18296800
*                                     Used to preserve the attention    18297200
*                                     index while processing an         18297600
*                                     unsolicited interrupt with        18298000
*                                     unit check status          @12A*/ 18298400
*         4 IOSXSFLG BIT(8),       /* Sense flag byte            @18A*/ 18298880
*           6 IOSXRAT2 BIT(1),     /* USLRRAT2 save area.  Used to      18298960
*                                     preserve this bit while           18299040
*                                     processing an unsolicited         18299120
*                                     interrupt with unit check         18299200
*                                     status                     @18A*/ 18299280
*           6 IOSXRAT3 BIT(1),     /* USLRRAT3 save area.  Used to      18299360
*                                     preserve this bit while           18299440
*                                     processing an unsolicited         18299520
*                                     interrupt with unit check         18299600
*                                     status                     @18A*/ 18299680
*         4 *       CHAR(3);       /* Reserved for future use    @18C*/ 18299760
*%IOSBX8:   ;                                                           18300000
*@SPACE(3);                                                             18303900
*%IF IOSST1~='YES'  %THEN             /*                         @L6A*/ 18307800
*    %GOTO IOSB10;                    /*                         @L6A*/ 18311700
*/********************************************************************/ 18315600
*/* Subchannel type 1 request section -  IOSPROC= X'F9'              */ 18319500
*/********************************************************************/ 18323400
*   DCL 1 IOSCST1   CHAR(LENGTH(IOSBEXT))  DEF(IOSBEXT), /*      @L6A*/ 18327300
*         4 IOSCRB   PTR(31),         /* Address of request block       18331200
*                                                                @L6A*/ 18335100
*         4 IOSCECB  PTR(31),         /* Address of ECB to post         18339000
*                                        for task mode callers   @L6A*/ 18342900
*         4 IOSCIOSB PTR(31),         /* Address of requestors          18346800
*                                        IOSB                    @L6A*/ 18350700
*         4 IOSCSTAT CHAR(4),         /* Synchronous status      @L6A*/ 18354600
*           6 IOSCHCC CHAR(1),        /* Condition code          @L6A*/ 18358500
*           6 IOSCFLG1 BIT(8),        /* Flag byte - set by             18362400
*                                         requestor              @L6A*/ 18366300
*             8 IOSCPSTR BIT(1),      /* Post required           @L6A*/ 18370200
*           6 IOSCFLG2 BIT(8),        /* Flag byte - state info  @L6A*/ 18374100
*             8 IOSCHSCE BIT(1),      /* Command was issued      @L6A*/ 18378000
*             8 IOSCPURG BIT(1),      /* Request was purged      @L6A*/ 18381900
*             8 IOSCPOST BIT(1),      /* Request was posted      @L6A*/ 18385800
*           6 *      CHAR(1),         /* Reserved                @L6A*/ 18389700
*         4 IOSCIRB  CHAR(12),        /* Status                  @L6A*/ 18393600
*         4 IOSCSTKN CHAR(8),         /* Requestor's STOKEN      @L6A*/ 18397500
*         4 IOSCTIME FIXED(32),       /* Time taken for request,        18401400
*                                        does not include UCB           18405300
*                                        queue time              @L6A*/ 18409200
*         4 IOSCADD  PTR(31);         /* Chain of additional 4K         18413100
*                                        blocks                  @L6A*/ 18417000
* DCL IOSCHCC3 BIT(8) CONSTANT('30'X), /* Condition code 3       @L6A*/ 18420900
*     IOSCHCC2 BIT(8) CONSTANT('20'X), /* Condition code 2       @L6A*/ 18424800
*     IOSCHCC1 BIT(8) CONSTANT('10'X), /* Condition code 1       @L6A*/ 18428700
*     IOSCHCC0 BIT(8) CONSTANT('00'X); /* Condition code 0       @L6A*/ 18432600
*@SPACE (2);                                                            18436500
*%IOSB10: ;                           /*                         @L6A*/ 18440400
*/********************************************************************/ 18444300
*/*  Channel-To-Channel (CTC) overlay section                        */ 18450000
*/********************************************************************/ 18500000
*   DCL 1 * DEF(IOSCTC),           /* CTC overlay            @G860PLN*/ 18550000
*         4 IOSCTCDW CHAR(8),      /* Sense command byte CCW            18600000
*                                     (on a doubleword boundary)        18650000
*                                                            @G860PLN*/ 18700000
*           6 *        CHAR(5),    /* Padding                @G860PLN*/ 18750000
*           6 IOSCTCMD CHAR(1),    /* Command byte from sense OP        18800000
*                                     if format 0 CCW (IOSF= 0 )        18850000
*                                                            @G860PLN*/ 18900000
*           6 *        CHAR(2),    /* Padding                @G860PLN*/ 18950000
*         4 IOSCTCOP CHAR(1);      /* Command byte from sense OP        19000000
*                                     if format 1 CCW (IOSF= 1 )        19050000
*                                                            @G860PLN*/ 19100000
*@SPACE (2);                                                            19150000
*/********************************************************************/ 19200000
*/*  Attention section - IOS generated IOSB when IOSPROC = 08        */ 19250000
*/********************************************************************/ 19300000
*   DCL 1 *         CHAR(66) DEF(IOSSNS), /*                         */ 19350000
*         4 IOSATTNS CHAR(42),     /* With UC- sense data area   @03C*/ 19400000
*           6 IOSASNS CHAR(32),    /* Sense data area            @03A*/ 19450000
*           6 *       CHAR(10);    /* Reserved.                  @03A*/ 19500000
*   DCL 1 IOSATTSC  CHAR(64) DEF(IOSIPIB),                              28100000
*         4 IOSATTSN CHAR(40),     /* Additional sense if any        */ 28125000
*           6 IOSATSNS CHAR(30),   /* Additional sense data      @03A*/ 28150000
*           6 IOSATPMK BIT(8),     /* Attention path mask - path mask   28175000
*                                     of path on which attention        28200000
*                                     interrupt was received     @03A*/ 28225000
*           6 IOSAFLGS BIT(8),     /* Attention flags            @08A*/ 28228500
*              8 IOSAINTR BIT(1),  /* Indicates that attention routine  28232000
*                                     is requesting intercept           28235500
*                                     processing                 @08A*/ 28239000
*              8 IOSAINTE BIT(1),  /* Indicates an intercept has been   28242500
*                                     generated for this attention      28246000
*                                     interrupt                  @08A*/ 28249500
*              8 *        BIT(6),  /* Unused                     @08A*/ 28253000
*           6 IOSAATI  PTR(8),     /* Index to the attention table      28256500
*                                                                @08A*/ 28260000
*           6 * CHAR(7),           /* Reserved                   @08C*/ 28263500
*         4 IOSATTWA CHAR(24),     /* Attention routine work area    */ 28273200
*           6 IOSXMSAV CHAR(12),   /* CMSET savearea in IECTCATN @0FC*/ 28282900
*           6 *      CHAR(12);     /* Reserved                   @0FC*/ 28292600
*/********************************************************************/ 28302500
*/*  Intermediate Status scheduling section - IOS generated IOSB     */ 28332000
*/*                                           when IOSPROC = 04.     */ 28338000
*/********************************************************************/ 28344000
*   DCL 1 IOSPCISC  CHAR(64)  DEF(IOSIPIB) BDY(WORD),                   28350000
*         4 *       PTR(31),       /* IOSIPIB field- must not be        28353100
*                                                    used.           */ 28356200
*         4 *       PTR(31),       /* IOSPCHN field- Must not be        28359300
*                                                    used.           */ 28362400
*         4 IOSPCIRS CHAR(32),     /* Intermediate status reserved      28365500
*                                                    section.        */ 28368600
*         4 IOSPCIWA CHAR(24);     /* Intermediate status work area  */ 28371700
*@SPACE(2);                                                             28382600
*/********************************************************************/ 28383200
*/*  Redefines IOSSCHC for compatibility with previous versions      */ 28383500
*/********************************************************************/ 28384100
* DCL 1  *  DEF(IOSSCHC)  CHAR(2), /*                                */ 28387200
*         4 IOSAPMSK  CHAR(2);     /* Redefined field                */ 28390300
*@SPACE(3);                                                             28393400
*/********************************************************************/ 28396500
*/*  Redefines IOSFCSW for format 0 CCW requests.                    */ 28399600
*/*      Format 1 CCW requests defined above under IOSFCSW.          */ 28402700
*/********************************************************************/ 28405800
* DCL 1  *  DEF(IOSFCSW)  CHAR(8), /* Format 0 CCW layout.........   */ 28408900
*         4 IOSCC BIT(8),          /* Start subchannel deferred         28412000
*                                     condition code (Not to be used    28415100
*                                     for format 1 CCWs).               28418200
*                                     The SSCH deferred condition       28421300
*                                     code will always be stored        28424400
*                                     (regardless of CCW format) in     28427500
*                                     IOSIRBCC.                      */ 28430600
*         4 IOSCSW CHAR(7) BDY(WORD,2),  /* CSW low order 7 bytes    */ 28433700
*           6 IOSCSWCA  PTR(24) BDY(WORD,2), /*                         28436800
*                                     Last command address           */ 28439900
*           6 *         CHAR(4);   /* Status & residual count -         28443000
*                                     see format 1 definitions above */ 28446100
*@SPACE(2);                                                             28449200
*/********************************************************************/ 28452300
*/*  Redefined areas for Modify and Store Subchannel I/O requests.   */ 28455400
*/*------------------------------------------------------------------*/ 28458500
*/*  IOSOPT - Applicable to both modify and store requests.          */ 28461600
*/********************************************************************/ 28464700
*  DCL 1 *          BIT(8)    DEF(IOSOPT),   /*                      */ 28467800
*         4 IOSSYN   BIT(1),       /* If 1,  indicates store or modify  28470900
*                                            subchannel request is to   28474000
*                                            be done synchronously.     28477100
*                                     If 0,  indicates caller can       28480200
*                                            handle asynchronous        28483300
*                                            issuing of store or        28486400
*                                            modify subchannel.      */ 28489500
*         4 IOSNOPTH BIT(1),       /* If 1,  indicates for a path       28492600
*                                            message request, a         28495700
*                                            conditional no path        28498800
*                                            condition.              */ 28501900
*         4 *        BIT(6);       /* Reserved- initialized to zero  */ 28505000
*@SPACE(1);                                                             28508100
*/********************************************************************/ 28511200
*/*  IOSOPT2  - These bits when set to a 1, indicate to the          */ 28514300
*/*             modify services which fields are to be modified      */ 28517400
*/*             by issuing the MSCH instruction.                     */ 28520500
*/********************************************************************/ 28523600
*  DCL 1 *          BIT(8)     DEF(IOSOPT2),  /*                     */ 28526700
*        4 IOSMISC  BIT(1),        /* If 1, interrupt subclass       */ 28529800
*        4 IOSME    BIT(1),        /* If 1, enabled indicator           28532900
*                                           (IOS use only)           */ 28536000
*        4 IOSMLM   BIT(1),        /* If 1, limit mode indicator     */ 28539100
*        4 IOSMMM   BIT(1),        /* If 1, measurement mode         */ 28542200
*        4 IOSMLPM  BIT(1),        /* If 1, logical path mask        */ 28545300
*        4 IOSMMBI  BIT(1),        /* If 1, Measurement block index  */ 28548400
*        4 IOSMPOM  BIT(1),        /* If 1, path operational mask    */ 28551500
*        4 IOSMD    BIT(1);        /* If 1, dynamic path indicator      28554600
*                                           (IOS use only)           */ 28557700
*@SPACE(1);                                                             28560800
*/********************************************************************/ 28563900
*/*  IOSFLB   - These bits when set to a 1, indicate to the          */ 28567000
*/*             modify services how fields in the SCHIB are to be    */ 28570100
*/*             modified.                                            */ 28573200
*/********************************************************************/ 28576300
*  DCL 1 *          BIT(8)    DEF(IOSFLB), /*                        */ 28579400
*        4 IOSMLPMO BIT(1),        /* If 1, old LPM is to be 'ored'     28582500
*                                           with new LPM.               28585600
*                                     If 0, old LPM is to be 'anded'    28588700
*                                           with new LPM.               28591800
*                                           This bit valid only if      28594900
*                                           IOSMLPM is on.           */ 28598000
*        4 IOSMPOMO BIT(1),        /* If 1, old POM is to be 'ored'     28601100
*                                           with new POM.               28604200
*                                     If 0, old POM is to be 'anded'    28607300
*                                           with new POM.               28610400
*                                           This bit valid only if      28613500
*                                           IOSMPOM is on.           */ 28616600
*        4 IOSMMMO  BIT(1),        /* If 1, old measurement mode is     28619700
*                                           to be 'ored' with new       28622800
*                                           measurement mode.           28625900
*                                     If 0, old measurement mode is     28629000
*                                           to be 'anded' with the      28632100
*                                           new measurement mode.       28635200
*                                           This bit valid only if      28638300
*                                           IOSMMM is on.            */ 28641400
*        4 IOSASIS  BIT(1),        /* If 1, IOSMLPMO and IOSMPOMO       28644500
*                                           are ignored, and the old    28647600
*                                           LPM and/or POM are to be    28650700
*                                           replaced by the new         28653800
*                                           LPM/POM.                 */ 28656900
*        4 *        BIT(4);        /* Reserved- initialized to zero  */ 28660000
*@SPACE(2);                                                             28663100
* DCL IOSSCHIB  DEF(IOSPCHN) PTR(31); /* Address of SCHIB for modify    28666200
*                                        subchannel and store           28669300
*                                        subchannel requests. Address   28672400
*                                        provided by I/O requestor.  */ 28675500
*@SPACE (2);                                                            28678600
*/********************************************************************/ 28681700
*/*  Following are the PLS declares which replace the previously     */ 28950000
*/*  defined %dclares.  The fields to which the values apply are     */ 29000000
*/*  reproduced as comments.  This change allows a cross reference   */ 29050000
*/*  of the names used as field values.                              */ 29100000
*/********************************************************************/ 29150000
*                                                                       29200000
*/********************************************************************/ 29214200
*/*  Constants for the IOSCC field - deferred condition codes        */ 29228400
*/********************************************************************/ 29242600
*   DCL IOSCC3 BIT(8) CONSTANT('30'X); /* Deferred condition code 3  */ 29256800
*   DCL IOSCC1 BIT(8) CONSTANT('10'X); /* Deferred condition code 1  */ 29271000
*   DCL IOSCC0 BIT(8) CONSTANT('00'X); /* Deferred condition code 0  */ 29285200
*                                                                       29300000
*/********************************************************************/ 29350000
*/*  Constants for the IOSIRBCC field - deferred condition codes     */ 29400000
*/********************************************************************/ 29450000
*   DCL IOSIRBC3 BIT(2) CONSTANT('11'B); /* Deferred condition code 3*/ 29500000
*   DCL IOSIRBC1 BIT(2) CONSTANT('01'B); /* Deferred condition code 1*/ 29550000
*   DCL IOSIRBC0 BIT(2) CONSTANT('00'B); /* Deferred condition code 0*/ 29600000
*                                                                       29700000
*/********************************************************************/ 29716600
*/*  Field IOSPROC values - for IOSB generated IOSB identification.  */ 29733200
*/*                         IOSPROC values assigned by IOS.          */ 29749800
*/*------------------------------------------------------------------*/ 29766400
*   /*  4 IOSPROC  CHAR(1),           SEE DCL FOR DESCRIPTION        */ 29783000
*                                                                       29800000
*   DCL IOSAPCI  BIT(8) CONSTANT('04'X); /* Intermediate Status      */ 29850000
*   DCL IOSATTN  BIT(8) CONSTANT('08'X); /* Attention                */ 29900000
*   DCL IOSAPURG BIT(8) CONSTANT('0C'X); /* Purge                    */ 29950000
*   DCL IOSAWTO  BIT(8) CONSTANT('14'X); /* WTO                      */ 30000000
*   DCL IOSADDR  BIT(8) CONSTANT('18'X); /* DDR                      */ 30050000
*   DCL IOSADIER BIT(8) CONSTANT('1C'X); /* DIE redrive for             30100000
*                                           different UCB            */ 30150000
*   DCL IOSAUR   BIT(8) CONSTANT('20'X); /* Unconditional Reserve    */ 30200000
*   DCL IOSAST1  BIT(8) CONSTANT('F9'X); /* Subchannel type 1 request   30233300
*                                                                @L6A*/ 30266600
*   DCL IOSASNRQ BIT(8) CONSTANT('FA'X); /* IOS Sense Request        */ 30300000
*   DCL IOSACLR  BIT(8) CONSTANT('FC'X); /* Clear Subchannel request */ 30350000
*   DCL IOSAHALT BIT(8) CONSTANT('FD'X); /* Halt Subchannel request  */ 30400000
*   DCL IOSAMOD  BIT(8) CONSTANT('FE'X); /* Modify Subchannel request*/ 30450000
*   DCL IOSASTOR BIT(8) CONSTANT('FF'X); /* Store Subchannel request */ 30500000
*                                                                       30800000
*/********************************************************************/ 30816600
*/*  Field IOSDVRID values - IOS driver identifier.                  */ 30833200
*/*                          IOSDVRID values assigned by IOS.        */ 30849800
*/*------------------------------------------------------------------*/ 30866400
*   /*  4 IOSDVRID CHAR(1),           SEE DCL FOR DESCRIPTION        */ 30883000
*                                                                       30900000
*   DCL IOSIOSID BIT(8) CONSTANT('00'X); /* Reserved for IOS         */ 30950000
*   DCL IOSMISID BIT(8) CONSTANT('01'X); /* Miscellanous ID for I/O     31000000
*                                           requestors that cannot be   31050000
*                                           purged, associated with a   31100000
*                                           task, or violate extents */ 31150000
*   DCL IOSXCPID BIT(8) CONSTANT('02'X);  /* EXCP driver             */ 31200000
*   DCL IOSVSAID BIT(8) CONSTANT('03'X);  /* VSAM driver             */ 31250000
*   DCL IOSATMID BIT(8) CONSTANT('04'X);  /* VTAM driver             */ 31300000
*   DCL IOSTCMID BIT(8) CONSTANT('05'X);  /* TCAM driver             */ 31350000
*   DCL IOSOLTID BIT(8) CONSTANT('06'X);  /* OLTEP driver            */ 31400000
*   DCL IOSFCHID BIT(8) CONSTANT('07'X);  /* Program Fetch driver    */ 31450000
*   DCL IOSJESID BIT(8) CONSTANT('08'X);  /* JES3 driver             */ 31500000
*   DCL IOSSS1ID BIT(8) CONSTANT('09'X);  /* MSC driver              */ 31550000
*   DCL IOSPRGID BIT(8) CONSTANT('0A'X);  /* IECVIOPM driver         */ 31600000
*   DCL IOSVPSID BIT(8) CONSTANT('0B'X);  /* VPSS                    */ 31650000
*/*                              '0C'X        CRYPTO                 */ 31700000
*   DCL IOSASMID BIT(8) CONSTANT('0E'X);  /* ASM Driver              */ 31750000
*   DCL IOSMDSID BIT(8) CONSTANT('0F'X);  /* Message Display service    31800000
*                                                                @H1A*/ 31850000
*   DCL IOSAUSID BIT(8) CONSTANT('10'X);  /* Assign/Unassign service    31900000
*                                                                @H1A*/ 31950000
*   DCL IOSDYPID BIT(8) CONSTANT('11'X);  /* Dynamic pathing driver  */ 32000000
*   DCL IOSDAVV  BIT(8) CONSTANT('12'X);  /* IOSVDAVV driver     @D2A*/ 32050000
*   DCL IOSDCSID BIT(8) CONSTANT('13'X);  /* Device Control Service     32100000
*                                                                @03A*/ 32150000
*   DCL IOSAOMID BIT(8) CONSTANT('14'X);  /* Asychronous operation      32200000
*                                            manager             @03A*/ 32250000
*   DCL IOSSMSID BIT(8) CONSTANT('15'X);  /* DFSMS driver        @P5A*/ 32300000
*   DCL IOSXCFID BIT(8) CONSTANT('16'X);  /* XCF CTC I/O Driver  @L5A*/ 32350000
*   DCL IOSCDRID BIT(8) CONSTANT('17'X);  /* IOS use driver ID   @D5A*/ 32375000
*   DCL IOSSLFID BIT(8) CONSTANT('18'X);  /* IOSVSLFD driver ID  @LAC*/ 32387500
*   DCL IOSPAVID BIT(8) CONSTANT('19'X);  /* IOSVIOPA driver ID  @16A*/ 32393700
*   DCL IOSV33ID BIT(8) CONSTANT('80'X);  /* SVC33 driver            */ 32400000
*   DCL IOSCLRID BIT(8) CONSTANT('81'X);  /* Clear Device recovery   */ 32450000
*   DCL IOSSCRID BIT(8) CONSTANT('82'X);  /* Subchannel Recovery     */ 32500000
*   DCL IOSV16ID BIT(8) CONSTANT('83'X);  /* SVC16 Purge driver      */ 32550000
*   DCL IOSAPRID BIT(8) CONSTANT('84'X);  /* Unconditional Reserve      32600000
*                                            (UR) Recovery driver    */ 32650000
*   DCL IOSMIHID BIT(8) CONSTANT('85'X);  /* Missing Interrupt          32700000
*                                            Handler (MIH) driver    */ 32750000
*   DCL IOSPRVID BIT(8) CONSTANT('86'X);  /* I/O Prevention             32800000
*                                            Handler driver          */ 32850000
*   DCL IOSRSVID BIT(8) CONSTANT('87'X);  /* Re-reserve service  @02A*/ 32900000
*                                                                       33600000
*   /*  4 IOSCOD CHAR(1),             SEE DCL FOR DESCRIPTION        */ 33650000
*                                                                       33700000
*   DCL IOSERRC  BIT(8) CONSTANT('41'X); /* Permanent I/O error      */ 33750000
*   DCL IOSEXTC  BIT(8) CONSTANT('42'X); /* Extent Error             */ 33800000
*   DCL IOSDPXC  BIT(8) CONSTANT('43'X); /* Duplexed I/O request was    33850000
*                                           not started because of the  33900000
*                                           UCB level or not ready      33950000
*                                           device.                  */ 34000000
*   DCL IOSINTC  BIT(8) CONSTANT('44'X); /* Request was intercepted     34050000
*                                           because an error occurred   34100000
*                                           after the last time the     34150000
*                                           device was used and the     34200000
*                                           requestors error recovery   34250000
*                                           procedure wants this        34300000
*                                           intercept condition         34350000
*                                           treated as a permanent      34400000
*                                           error.                   */ 34450000
*   DCL IOSABNC  BIT(8) CONSTANT('45'X); /* I/O request abnormally      34500000
*                                           terminated because of a     34550000
*                                           program check, machine      34600000
*                                           check, etc. in IOS or       34650000
*                                           an exit.                 */ 34700000
*   DCL IOSCD46  BIT(8) CONSTANT('46'X); /* Reserved                 */ 34750000
*   DCL IOSEXTRM BIT(8) CONSTANT('47'X); /* I/O request not started     34800000
*                                           as the driver start         34850000
*                                           Subchannel exit requested   34900000
*                                           termination prior to the    34950000
*                                           SSCH being issued (See      35000000
*                                           IOSXSSCH).               */ 35050000
*   DCL IOSPRGC  BIT(8) CONSTANT('48'X); /* Request was purged       */ 35100000
*   DCL IOSCNCLD BIT(8) CONSTANT('49'X); /* Store or Modify subchannel  35150000
*                                           has been cancelled       */ 35200000
*   DCL IOSPVTIO BIT(8) CONSTANT('4A'X); /* I/O Prevention - either     35250000
*                                           the I/O request has not     35300000
*                                           been started or the         35350000
*                                           I/O request has been        35400000
*                                           terminated.          @L1A*/ 35450000
*   DCL IOSTAPEC BIT(8) CONSTANT('4B'X); /* Tape repositioning error */ 35500000
*   DCL IOSIVEXP BIT(8) CONSTANT('4C'X); /* Invalid exposure number  */ 35550000
*   DCL IOSGDPCC BIT(8) CONSTANT('4D'X); /* Deferred condition code 3   35600000
*                                           on a GDP request or while   35650000
*                                           NIP in control, or          35700000
*                                           with IOSGDPLP set, no       35750000
*                                           logically available         35800000
*                                           paths (UCBLPM).      @02C*/ 35850000
*   DCL IOSGDPRD BIT(8) CONSTANT('4E'X); /* GDP- Reserved device or in  35900000
*                                           conjunction with IOSRELSE,  35950000
*                                           device can not be           36000000
*                                           released.                */ 36050000
*   DCL IOSCD50  BIT(8) CONSTANT('50'X); /* Reserved                 */ 36100000
*   DCL IOSMIHCA BIT(8) CONSTANT('51'X); /* The I/O Request not         36150000
*                                           started- the device is in   36200000
*                                           permanent error.         */ 36250000
*   DCL IOSMIHSP BIT(8) CONSTANT('52'X); /* IOS found the I/O request   36300000
*                                           Start Pending in the        36350000
*                                           subchannel, and the         36400000
*                                           driver requests that the    36450000
*                                           I/O request not to be       36500000
*                                           retried (MIH,etc)    @02C*/ 36550000
*   DCL IOSIOTCR BIT(8) CONSTANT('53'X); /* IOS cancelled the I/O       36562500
*                                           request due to an I/O       36575000
*                                           timeout condition    @09A*/ 36587500
*   DCL IOSCAPAS BIT(8) CONSTANT('54'X); /* The I/O request could not   36589500
*                                  be started.  The current address     36591500
*                                  space did not match IOSASID and a    36593500
*                                  Captured UCB address was used        36595500
*                                  in IOSUCB.                    @LCA*/ 36597500
*   DCL IOSGDPWE BIT(8) CONSTANT('6D'X); /* Deferred Condition Code 3   36600000
*                                           condition with the          36650000
*                                           IOSCC3WE bit set.        */ 36700000
*   DCL IOSFTCHC BIT(8) CONSTANT('71'X); /* Hardware corrected data     36750000
*                                           check for Fetch          */ 36800000
*   DCL IOSMIHC  BIT(8) CONSTANT('74'X); /* A Simulated error status,   36850000
*                                           generated by IOS         */ 36900000
*   DCL IOSXERPL BIT(8) CONSTANT('7D'X); /* An I/O exit requested the   36950000
*                                           ERP to log this request     37000000
*                                                                @L6A*/ 37050000
*   DCL IOSFINTC BIT(8) CONSTANT('7E'X); /* Intercept condition before  37100000
*                                           entrance to the ERP.     */ 37150000
*   DCL IOSNRMC  BIT(8) CONSTANT('7F'X); /* Normal Completion        */ 37200000
*                                                                       37250000
*@SPACE(2);                                                             37300000
*/********************************************************************/ 37350000
*/*  Field IOSSNS value  - Bad sense indication                      */ 37400000
*/*------------------------------------------------------------------*/ 37450000
*   DCL IOSSNSBD BIT(16) CONSTANT('10FE'X); /* Value supplied for       37500000
*                                              unsuccessful sense   */  37550000
*@SPACE(2);                                                             37555500
*/********************************************************************/ 37561000
*/*  Field IOSXRCOD value - Reason code detailing IOSCOD value   @09A*/ 37566500
*/*------------------------------------------------------------------*/ 37572000
*   DCL IOSXRC9 BIT(8) CONSTANT('09'X); /* Value indicating started I/O 37577500
*                                          request timed-out     @09A*/ 37583000
*   DCL IOSXRC10 BIT(8) CONSTANT('0A'X); /* Value indicating queued I/O 37588500
*                                          request timed-out     @09A*/ 37594000
*   DCL IOSXRC11 BIT(8) CONSTANT('0B'X); /* Value indicating PAV        37595200
*                                          binding changed out from     37596400
*                                          underneath IOSEXP request    37597600
*                                                                @14A*/ 37598800
*   DCL IOSXRC12 BIT(8) CONSTANT('0C'X); /* Value indicating 64-bit     37599100
*                                          IDAWs requested on an        37599400
*                                          unsupported host      @LFA*/ 37599700
*@SPACE(2);                                                             37600000
*/********************************************************************/ 37650000
*/*  IOSEXITS - Label for calling the IOS exits routines             */ 37700000
*/*------------------------------------------------------------------*/ 37750000
*   DCL IOSEXITS ENTRY BASED OPTIONS(AMODE(*) RMODE(ANY)) VALRG(*);     37800000
*                                        /* LABEL FOR CALLING EXIT      37850000
*                                           ROUTINES         @G860PLN*/ 37900000
*/*------------------------------------------------------------------*/ 37950000
*/********************************************************************/ 38000000
*/* Notes on Bit Combinations                                        */ 38050000
*/*                                                                  */ 38100000
*/* IOSPSLL - 0 = local lock needed for IOS post status processing,  */ 38150000
*/*               the local lock is obtained and the local lock save */ 38200000
*/*               area is passed via register 13 to various exits.   */ 38250000
*/*           1 = local lock is not needed                           */ 38300000
*/* IOSIDR  - 1 = paging I/O therefore, ERPs must use indirect       */ 38350000
*/*               recording for requests, ie, the ERP sets IOSPROC to*/ 38400000
*/*               IOSWTO to have ERP messages scheduled.  Also,      */ 38450000
*/*               if ASM (IOSNOLL = 0), the address of a save area   */ 38500000
*/*               is passed via the ASM control block IORB.          */ 38550000
*/* IOSNOLL - 0 = the local lock may be obtained.                    */ 38600000
*/*           1 = the I/O driver has indicated that the local lock   */ 38650000
*/*               cannot be obtained.  The local lock may already be */ 38700000
*/*               owned in which case dead lock could occur.  Also,  */ 38750000
*/*               the local lock may not be owned, but the I/O driver*/ 38800000
*/*               has reasons for not wanting IECVPST to obtain it.  */ 38850000
*/*               Generally used by paging subsystems other than ASM */ 38900000
*/*               (for example, Media Manager) that are called by    */ 38950000
*/*               applications that could own the local lock but     */ 39000000
*/*               cannot pass a save area in an IORB.  IOSPSLL must  */ 39089990
*/*               also be on.  Post status gets the CPU lock, calls  */ 39129980
*/*               the IOS storage manager for a block of storage,    */ 39169970
*/*               frees the CPU lock and passes the IOS large block  */ 39209960
*/*               as a save area.  Performance should be considered  */ 39249950
*/*               when using this method.                        @19C*/ 39289940
*/*                                                                  */ 39350000
*/* Post Status valid bit combinations for requesting local lock     */ 39400000
*/* and/or save areas.                                               */ 39450000
*/*                                                                  */ 39500000
*/* |---------------------------------------------------------------|*/ 39550000
*/* |IOSPSLL | IOSIDR | IOSNOLL | Description                       |*/ 39600000
*/* |---------------------------------------------------------------|*/ 39650000
*/* |   0    |    0   |    0    | I/O driver requires the local lock|*/ 39700000
*/* |        |        |         | or a save area in which case, the |*/ 39750000
*/* |        |        |         | local lock is obtained and the    |*/ 39800000
*/* |        |        |         | save area passed is the local lock|*/ 39850000
*/* |        |        |         | save area.                        |*/ 39900000
*/* |---------------------------------------------------------------|*/ 39950000
*/* |   1    |    0   |    0    | I/O driver does not require the   |*/ 40000000
*/* |        |        |         | local lock or a save area.        |*/ 40050000
*/* |---------------------------------------------------------------|*/ 40100000
*/* |   1    |    1   |    0    | I/O driver must use indirect      |*/ 40150000
*/* |        |        |         | recording.  A save area is passed |*/ 40200000
*/* |        |        |         | via the IORB.  This combination is|*/ 40250000
*/* |        |        |         | ASM only.  ERPs are scheduled.    |*/ 40300000
*/* |---------------------------------------------------------------|*/ 40350000
*/* |   1    | 0 or 1 |    1    | Post status must not obtain the   |*/ 40419990
*/* |        |        |         | local lock.  Driver exits are     |*/ 40450000
*/* |        |        |         | passed a save area obtained from  |*/ 40500000
*/* |        |        |         | the IOS storage manager.          |*/ 40550000
*/* |---------------------------------------------------------------|*/ 40600000
*/*                                                                  */ 40650000
*/* All other combinations are invalid and will produce unpredictable*/ 40700000
*/* results.                                                         */ 40750000
*/*                                                              @19C*/ 40819990
*/********************************************************************/ 40850000
*@EJECT;                                                                40900000
