*/*  INCLUDE SYSLIB(IECDSECT)                                  Y02134*/ 00010000
*    % GOTO DSECTL1;                    /*EXPAND PLS PORTION     @H1C*/ 00012000
*/*                                                              Y02134 00014000
         MACRO                                                          00020000
         IECDSECT &IOB=YES                                       S21940 00040000
*                                                                @H1A*/ 00076400
*  %DSECTL1 : ;                                                /*@H1A*/ 00112800
*                                                                       00149400
*/* **************************************************************** */ 00150100
*/*                                                                  */ 00150800
*/*$MAC(IECDSECT): O/C/E WORK AREA ADDRESSING MACRO                  */ 00151500
*/*                                                                  */ 00152200
*/*PROPRIETARY V3 STATEMENT                                          */ 00153000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00153800
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00154600
*/*5694-A01                                                          */ 00155400
*/*(C) COPYRIGHT 1984,2000  IBM CORP.                                */ 00156200
*/*END PROPRIETARY V3 STATEMENT                                      */ 00157000
*/*                                                                  */ 00157800
*/* STATUS - OS/390 DFSMS 3.10                                   @LFC*/ 00158500
*/*                                                                  */ 00159200
*/* FUNCTION = O/C/E MACRO USED TO PROVIDE ADDRESSABILITY TO         */ 00159900
*/*            INTERNAL WORK AREAS                                   */ 00160600
*/*                                                                  */ 00161300
*/* NOTES = NONE.                                                    */ 00162000
*/*                                                                  */ 00162700
*/*     DEPENDENCIES = IEFJFCBN (JFCB = 176 BYTES IN LENGTH).        */ 00163400
*/*                    ONLY IN BAL VERSION.                    Y02134*/ 00164100
*/*                                                                  */ 00164800
*/*     RESTRICTIONS = CHANGES TO THIS MACRO MUST BE COORDINATED     */ 00165500
*/*                    WITH THE IECDSECS MACRO AND FUNCTIONS         */ 00166200
*/*                    WHICH INTERFACE INTERNALLY WITH O/C/E         */ 00166900
*/*                    ROUTINES. THIS MACRO WAS DESIGNED TO          */ 00167600
*/*                    BE USED IN A DSECT.                           */ 00168300
*/*                                                                  */ 00169000
*/*     REGISTER CONVENTIONS = NOT APPLICABLE.                       */ 00169700
*/*                                                                  */ 00170400
*/* PATCH LABEL = NOT APPLICABLE.                                    */ 00171100
*/*                                                                  */ 00171800
*/* MODULE TYPE = MACRO.                                             */ 00172500
*/*                                                                  */ 00173200
*/*     PROCESSOR = ASSEMBLER LANGUAGE.                              */ 00173900
*/*                                                                  */ 00174600
*/*     MODULE SIZE = DESCRIBED BY THE LABEL DSECTSIZ. THE ACTUAL    */ 00175300
*/*                   WORK AREA SIZE IS DESCRIBED BY LABELS WITHIN   */ 00176000
*/*                   IECDSECS.                                      */ 00176700
*/*                                                                  */ 00177400
*/*     ATTRIBUTES = DSECT FIELDS.                                   */ 00178100
*/*                                                                  */ 00178800
*/* ENTRY POINT = DXLBL IN BAL VERSION                         Y02134*/ 00179500
*/*               FORCORE IN PLS VERSION                       Y02134*/ 00180200
*/*                                                                  */ 00180900
*/*     PURPOSE = THIS MACRO IS TO BE USED IN CONJUNCTION WITH       */ 00181600
*/*               THE IECDSECS MACRO TO DEFINE AND MAP INTERNAL      */ 00182300
*/*               WORK AREAS USED BY O/C/E AND FUNCTIONS WHICH       */ 00183000
*/*               INTERNALLY INTERFACE WITH O/C/E. THIS MACRO IS     */ 00183700
*/*               CALLED BY O/C/E CSECTS AT ASSEMBLY TIME.           */ 00184400
*/*                                                                  */ 00185100
*/*     LINKAGE = IECDSECT IOB=(YES/NO) FOR BAL CALL           Y02134*/ 00185800
*/*               % INCLUDE SYSLIB(IECDSECT) IN PLS CALL       Y02134*/ 00186500
*/*                                                                  */ 00187200
*/*     INPUT = IOB=, IOB=YES, OR IOB=NO.                            */ 00187900
*/*                                                                  */ 00188600
*/*           IF IOB=YES OR IOB=, (DEFAULT) IS SPECIFIED, INTERNALLY */ 00189300
*/*           DEFINED FIELDS IN THE IOB ARE GENERATED. THE LABELS    */ 00190000
*/*           FOR THESE FIELDS ARE MUTUALLY EXCLUSIVE OF THE LABELS  */ 00190700
*/*           GENERATED BY THE IOBLOCKS MACRO.                       */ 00191400
*/*           FOR A PLS CALL THE IOB AREA IS EXPANDED          Y02134*/ 00192100
*/*           WITHOUT IOB LABELS.                              Y02134*/ 00192800
*/*                                                                  */ 00193500
*/*     OUTPUT = MAPPING OF COMMON O/C/E WORK AREA.                  */ 00194200
*/*              SEE COMMENTS BELOW.                                 */ 00194900
*/*                                                                  */ 00195600
*/* EXIT NORMAL = MEND STATEMENT                                     */ 00196300
*/*                                                                  */ 00197000
*/* EXIT ERROR = IHBERMAC 183,IOB,YES                                */ 00197700
*/*                                                                  */ 00198400
*/* EXTERNAL REFERENCES = SEE BELOW.                                 */ 00199100
*/*                                                                  */ 00199800
*/*     ROUTINES = NONE.                                             */ 00200500
*/*                                                                  */ 00201200
*/*   1 DATA AREAS = O/C/E COMMON WORK AREA.                         */ 00201900
*/*     2 DATA AREAS = VOLUME LABEL AREA.                            */ 00202600
*/*       3 DATA AREAS = ANSI VOLUME LABEL AREA.                     */ 00203300
*/*       3 DATA AREAS = FILE LABEL 1 AREA.                          */ 00204000
*/*       3 DATA AREAS = FILE LABEL 2 AREA.                          */ 00204700
*/*       3 DATA AREAS = ANSI FILE LABEL 2 AREA.                     */ 00205400
*/*       3 DATA AREAS = DATA SET CONTROL BLOCK LABEL AREA (DSCB).   */ 00206100
*/*       3 DATA AREAS = DATA SET CONTROL BLOCK FORMAT 3 KEY AREA.   */ 00206800
*/*       3 DATA AREAS = DATA SET CONTROL BLOCK FORMAT 3 RECORD AREA.*/ 00207500
*/*       3 DATA AREAS = MESSAGE AREA.                               */ 00208200
*/*       3 DATA AREAS = MESSAGE LENGTHS.                            */ 00208900
*/*       3 DATA AREAS = MESSAGE FORMAT.                             */ 00209600
*/*     2 DATA AREAS = JOB FILE CONTROL BLOCK AREA (JFCB).           */ 00210300
*/*     2 DATA AREAS = O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB).*/ 00211000
*/*     2 DATA AREAS = O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB). */ 00211700
*/*     2 DATA AREAS = O/C/E INTERNAL DATA EXTENT BLOCK AREA (DEB).  */ 00212400
*/*     2 DATA AREAS = O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB). */ 00213100
*/*     2 DATA AREAS = O/C/E INTERNAL CONTROL WORDS AREA (CCW).      */ 00213800
*/*     2 DATA AREAS = O/C/E COMMON EXTENDED WORK AREAS.             */ 00214500
*/*     2 DATA AREAS = O/C/E PROTECTED CONTROL BLOCK POINTERS AREA.  */ 00215200
*/*     2 DATA AREAS = USER DCB COPY POINTERS AREA.                  */ 00215900
*/*     2 DATA AREAS = O/C/E ACCESS METHOD AREA.                     */ 00216600
*/*     2 DATA AREAS = O/C/E RECOVERY ROUTINE AUDIT TRAIL AREA.      */ 00217300
*/*     2 DATA AREAS = O/C/E SWA CURRENT JFCB POINTER            @H1A*/ 00218000
*/*     2 DATA AREAS = O/C/E CVAF/CP REBUILD                     @L7A*/ 00218700
*/*     2 DATA AREAS = RESERVED                                  @L7A*/ 00219400
*/*                                                                  */ 00220100
*/*     CONTROL BLOCKS = DSCB,JFCB,ECB,IOB,DCB,DEB                   */ 00220800
*/*                                                                  */ 00221500
*/* TABLES = NONE.                                                   */ 00222200
*/*                                                                  */ 00222900
*/* MACROS = IHBERMAC.                                               */ 00223600
*/*                                                                  */ 00224300
*/* CHANGE ACTIVITY =                                                */ 00225000
*/*                                                                  */ 00225700
*/*$01=OZ56437,EDM1102,,XX: PREVENT RECATLG IF DSN CHNGD IN OPENJ@01A*/ 00226400
*/*$LM=DFP,JDP1111,,STLLRU:    MEDIA MANAGER SUPPORT             @LMA*/ 00227100
*/*$L1=DFP,JDP1111,,STLLRU:    DCB USER EXIT SUPPORT FOR HSM     @L1A*/ 00227800
*/*$L2=ANSI,JDP1111,,STLLRU:   ANSI-78 TAPE LABEL SUPPORT        @L2A*/ 00228500
*/*$02=OZ73362,HDP1102,,FEGJG: INVALID STMTS AFTER MEND     @ZA73362A*/ 00229200
*/*$L3=DFP/XA,HDP2210,84115,STLRGB: NEW COPYRIGHT MACRO          @L3A*/ 00229900
*/*$L4=DFP/XA,HDP2210,84195,STLPD: 3480 BLOCK COUNT SUPPORT      @L4A*/ 00230600
*/*$L5=DFP/XA,HDP2230,,STLRGB: SWA                               @L5A*/ 00231300
*/*$L6=SDB,HDP3310,,STLDJP: SYSTEM DETERMINED BLOCKSIZE          @L6A*/ 00232000
*/*$03=OZ97195,HDP2210,,ISGRJV: IFG0TC0A ABEND0C4 CICB/ACB FREED @03A*/ 00232700
*/*$04=OZ98002,HDP2210,,ISGPD : CORRUPTED F1 DSCB                @04A*/ 00233400
*/*$05=OY03916,HDP2230,86230,STLJDL: 3480 LABEL PERFORMANCE      @05A*/ 00234100
*/*$H1=3480X,JDP3311,88260,STLFAO:   3480 COMPACTION SUPPORT     @H1A*/ 00234800
*/*$L7=NSYNC,JDP3311,88260,STLPD:    INCREASE WORK AREA SIZE     @L7A*/ 00235500
*/*$L8=KET1796,HDP3320,,STLSS:   PDSE SUPPORT                    @L8A*/ 00236200
*/*$H2=OY36675,HDP3320,89025,STLCMS: BRYCE 2 SUPPORT             @H2A*/ 00236900
*/*$06=OY41433,HDP3330,053091,SJPLJAL: LB BLK CNT CONSTRAINT RLF @06A*/ 00237600
*/*$07=OY47798,HDP3330,911031,SJPLJAL: DEFINE VOLID IN SENSE FLG @07A*/ 00238300
*/*$L9=TAPELIB,HDP4410,,SJPLMV:  FLAGSTAFF SUPPORT               @L9A*/ 00239000
*/*$P1=KMS0089,JDZ1110,,SJPLMV:  LACS VERIFY CALLED TWICE        @P1A*/ 00239700
*/*$P2=KMM1724,JDZ1110,,SJPLMV:  JES2 ABEND0C4 WA SIZE CHANGED   @P2A*/ 00240400
*/*$P3=KBL0262,JDZ1110,,SJPLMV:  LACS DEMOUNT AFTER MOUNT FAILED @P3A*/ 00241100
*/*$LA=STRIPES,JDZ1110,920217,SJPLREB: STRIPE DATA SET SUPPORT   @LAA*/ 00241800
*/*$P4=KMM2091,JDZ1110,920430,SJPLJAL: REMOVE 'P'(COMP BYTE) VOL1@P4A*/ 00242500
*/*$P5=KMM2258,JDZ1110,920501,SJPLMV: ATL ABEND INDICATOR        @P5A*/ 00243200
*/*$P6=KMM2476,JDZ1110,920604,SJPLJAL: A13-08                    @P6A*/ 00243900
*/*$P7=KMM2782,JDZ1110,920716,SJPLJAL: ATL,VISION DOWN, SCRTCH,  @P7A*/ 00244600
*/*                                    NO VOL RECORD ERROR STATUS@P7A*/ 00245300
*/*$P8=KMM2588,JDZ1110,920720,SJPLJAL: ERA5B EOV ANSI LBL OUTPUT @P8A*/ 00246000
*/*$08=OZ57907,JDZ1110,921002,SJPLGEC: DEFINE REBLKABLE SET FLG  @08A*/ 00246700
*/*$09=OY59051,JDZ1110,921111,SJPLMV:  ATL UNINITIALIZED SCRATCH @09A*/ 00247400
*/*                                    TAPES NOT LABELED         @09A*/ 00248100
*/*$10=OY58424,JDZ1110,921018,SJPLMV:  ATL BIG3 SUPPORT          @10A*/ 00248800
*/*$11=OY62261,JDZ1110,930304,SJPLGEC: DEFINE CONDITIONAL        @11A*/ 00249000
*/*                                    PARTREL FLAG              @11A*/ 00249200
*/*$12=OY61965,JDZ1110,030493,SJPLRLC: MSGIEC135A WITH UPDATE    @12A*/ 00249300
*/*                              AUTH AND INPUT PASSWORD PROT DS @12A*/ 00249400
*/*$LB=VSAMRLS,HDZ11C0,040293,SJPLRLC: VSAM RECORD LEVEL SHARING @LBA*/ 00249600
*/*$13=OY63171,JDZ1110,051793,SJPLRLC: RMM FLAGS                 @13A*/ 00249700
*/*$14=OY64948,JDZ1110,063093,SJPLJAL: UCBMOUNT SET FOR SMS      @14A*/ 00249800
*/*$15=OW00735,HDZ11B0,040693,SJPLGEC: CHECKPOINTED BIT IN FMT1  @15A*/ 00249900
*/*$P9=K130016,HDZ11C0,101493,SJPLGEC: CORRECT DXSIMWA DECLARE   @P9A*/ 00250000
*/*$16=OY67429,HDZ11B0,940106,SJPLRLC: SMS MNGT TAPE OUT OF      @16A*/ 00250100
*/*                                    SCRTCH CATEGORY           @16A*/ 00250200
*/*$17=OW02358,HDZ11B0,940210,SJPLRLC: RMM EXIT ENHANCEMENTS     @17A*/ 00250300
*/*$18=OW03072,HDZ11B0,940308,SJPLRCW: REWRITE TAPE AFTER IEC509A@18A*/ 00250400
*/*$19=OW03748,HDZ11B0,940309,SJPLGEC: MULTIVOLUME SINGLE STRIPE @19A*/ 00250500
*/*                                    SUPPORT                   @19A*/ 00250600
*/*$PA=k130226,HDZ11C0,940630,SJPLJAL: UNCOND VOL REJECT IF ATL, @PAA*/ 00250800
*/*                                    RACF TVP AND INVALID VOLID@PAA*/ 00251000
*/*$20=OW06305,HDZ11B0,940706,SJPLMV:  ATL BLP & NL O/P SUPPORT  @20A*/ 00251100
*/*$21=OW06475,HDZ11B0,940730,SJPLJAL: DMABCOND PCK INSTEAD OF LP@21A*/ 00251200
*/*$22=OW06638,HDZ11B0,940713,SJPLGEC: ALLOW OPENJ VOLSEQ GREATER@22A*/ 00251300
*/*                                    THAN ONE FOR NEW DATASETS @22A*/ 00251400
*/*$23=OW08676,HDZ11B0,941013,SJPLJAL: UNNECESSARY CALLS TO FILEV@23A*/ 00251500
*/*$24=OW08707,HDZ11B0,941013,SJPLMV:  ENFORCE SPECIFIC REQUEST  @24A*/ 00251600
*/*$25=OW11345,HDZ11B0,950221,SJPLGAP: MAP DXDEBUCB FOR PL/X USE @25A*/ 00251700
*/*$lC=K130891,HDZ11C0,950224,SJPLJAL: EXCP DCB XTIOT SUPPORT    @lCA*/ 00251800
*/*$26=OW12408,HDZ11B0,950416,SJPLJAL: LNUMBER ALREADY ENQ'D     @26A*/ 00251900
*/*$27=OW13268,HDZ11B0,950415,SJPLJAL: DETECT VOLM AFTER LBL ED  @27A*/ 00252100
*/*$LX=KEYMONT,HDZ11C0,950502,SJPLMV:  KEY=MOUNT                 @LXA*/ 00252200
*/*$28=OW11401,HDZ11B0,940512,SJPLGEC: SSI NEW VOLUME CALL FLAG  @28A*/ 00252300
*/*$29=OW14342,HDZ11C0,940512,SJPLJAL: FILEV EX OPTION TO BYPASS @29A*/ 00252400
*/*                                    PW SEC FOR SL DATASETS    @29A*/ 00252500
*/*$30=OW14936,HDZ11C0,940830,SJPLJAL: RMM VOLM EXIT BYPASSED    @30A*/ 00252600
*/*$31=OW16977,HDZ11C0,951219,SJPLJAL: NO IECR02E RSN CODE FOR   @31A*/ 00252700
*/*                                    ENQ FAILURE               @31A*/ 00252800
*/*$32=OW17084,HDZ11C0,951117,SJPLGEC: ACB LRECL DEFAULT FLAG    @32A*/ 00252900
*/*$33=OW17600,HDZ11C0,960131,SJPLJAL: VOLM VOLSER NOT DEQ'D WHEN@33A*/ 00253000
*/*                                    REJECTED BY LA OR FV EXITS@33A*/ 00253100
*/*$34=OW21615,HDZ11C0,960910,SJPLJAL: LABAN VOLSR NOT USED FOR  @34A*/ 00253200
*/*                                    NL SCRATCH AFTER IO ERROR @34A*/ 00253300
*/*$LY=SERVICE,HDZ11D0,960822,SJPLGEC: ADD O/C/E WORKAREA        @LYA*/ 00253400
*/*                                    EXTENSION                 @LYA*/ 00253500
*/*$35=OW21115,HDZ11C0,960628,SJPLMV:  OAKCREEK SUPPORT          @35A*/ 00253600
*/*$36=OW23936,HDZ11C0,961230,SJPLJAL: VOLM VOLSER NOT USED FOR  @36A*/ 00253700
*/*                                    NL SCR INSTEAD OF LNUM    @36A*/ 00253800
*/*$LZ=K140017,HDZ11D0,970131,SJPLJAL: HANG AFTER MANUAL RW/UNLD @LZA*/ 00253900
*/*$37=OW28994,HDZ11D0,980430,SJPLJAL: LABAN: RACDEL BYPASS OPT  @37A*/ 00254000
*/*$LD=ANSIV4,HDZ11E0,981230,SJPLJAL:  ANSI VER4 CCSID SUPPORT   @LDA*/ 00254100
*/*$38=KFI0048,HDZ11E0,980830,SJPLJAL: ESTAE ERRORS AFTER CANCEL @38A*/ 00254200
*/*$39=OW36962,HDZ11E0,990130,SJPLJAL: IO SIMULATION PREMATURELY @39A*/ 00254300
*/*                                    DISABLED WHEN JFCPOSID SET@39A*/ 00254400
*/*$40=OW37770,HDZ11E0,990218,SJPLGEC: AE OW36962                @40A*/ 00254500
*/*$41=OW38866,HDZ11E0,990430,SJPLJAL: DADSM NEEDS HFS INDICATOR @41A*/ 00254600
*/*                                    IN OCE WA                 @41A*/ 00254700
*/*$LE=HIGHSPL,HDZ11F0,990730,SJPLJAL: HSL AND RMM ENHANCEMENTS  @LEA*/ 00254800
*/*$LF=GT32K,HDZ11F0,990106,SJPLGEC: LBI LARGE BLKSIZE SUPPORT   @LFA*/ 00254900
*/*$42=OW38438,HDZ11E0,990430,SJPLJAL: INVALID 613-0C            @42A*/ 00255000
*/*$LG=OW38717,HDZ11E0,990629,SJPLJAL: BLYTHE2 SUPPORT           @LGA*/ 00255100
*/*$LH=K160810,HDZ11F0,991130,SJPLJAL: AL/EBCDIC TRANS INDICATOR @LHA*/ 00255200
*/*$LI=K160826,HDZ11F0,991130,SJPLJAL: TAPE DISP END OF FILE IND @LIA*/ 00255300
*/*$44=OW41257,HDZ11F0,991220,SJPLJAL: MISSING RSN ENTRY LBL EDT @44A*/ 00255420
*/*$45=OW45178,HDZ11F0,000630,SJPLJAL: VTOC OVERLAY              @45A*/ 00255440
*/*$LJ=OW45309,HDZ11F0,000730,SJPLJAL: MTLSUPPORT                @LJA*/ 00255460
*/*$46=OW50434,HDZ11F0,010830,SJPLJAL: 613-0C ATL LOOKAHEAD MOUNT@46A*/ 00255470
*/*                                                                  */ 00255500
*/* **************************************************************** */ 00255600
*/*                                                                  */ 00255700
*/*                                                                  */ 00255800
*/*      THIS MACRO IS USED TO DEFINE AND MAP THE O/C/E WORK AREA.   */ 00255900
*/*                                                                  */ 00256000
*/*      O/C/E = OPEN, OPEN TYPE=J, CLOSE, CLOSE TYPE=T,             */ 00256100
*/*              EOV, FEOV, & RDJFCB.                                */ 00256200
*/*                                                                  */ 00256300
*/* **************************************************************** */ 00256500
*/*                                                                  */ 00257200
*/* **************************************************************** */ 00257900
*/*                                                                  */ 00258600
*/*      O/C/EOV MAIN WORK AREA, FORMAT AND LENGTHS                  */ 00259300
*/*                                                                  */ 00260000
*/* **************************************************************** */ 00260700
*/*                                                                  */ 00261400
*/* 1. O/C/E COMMON WORK AREA.                 TOTAL = 664 BYTES @L7C*/ 00262100
*/*   2. VOLUME LABEL AREA.                            100 BYTES     */ 00262800
*/*   **** TAPE LABELS                                               */ 00263500
*/*     3. ANSI VOLUME LABEL AREA.                                   */ 00264200
*/*     3. FILE LABEL 1 AREA.                                        */ 00264900
*/*     3. FILE LABEL 2 AREA.                                        */ 00265600
*/*     3. ANSI FILE LABEL 2 AREA.                                   */ 00266300
*/*   **** DIRECT ACCESS LABELS                                      */ 00267000
*/*     3. DATA SET CONTROL BLOCK LABEL AREA (DSCB).                 */ 00267700
*/*     3. DATA SET CONTROL BLOCK FORMAT 3 KEY AREA.                 */ 00268400
*/*     3. DATA SET CONTROL BLOCK FORMAT 3 RECORD AREA.              */ 00269100
*/*   **** MESSAGE AREA                                          @H1A*/ 00269800
*/*     3. MESSAGE AREA.                                             */ 00270500
*/*     3. MESSAGE LENGTHS.                                          */ 00271200
*/*     3. MESSAGE FORMAT.                                           */ 00271900
*/*   2. JOB FILE CONTROL BLOCK AREA (JFCB).           176 BYTES     */ 00272600
*/*   2. O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB).  4 BYTES     */ 00273300
*/*   2. O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB).  40 BYTES     */ 00274000
*/*   2. O/C/E INTERNAL DATA EXTENT BLOCK AREA (DEB).   44 BYTES     */ 00274700
*/*   2. O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB).   4 BYTES     */ 00275400
*/*   2. O/C/E INTERNAL CONTROL WORDS AREA (CCW).       96 BYTES     */ 00276100
*/*   2. O/C/E COMMON EXTENDED WORK AREAS.              64 BYTES     */ 00276800
*/*   2. O/C/E PROTECTED CONTROL BLOCK POINTERS AREA.   40 BYTES     */ 00277500
*/*   2. USER DCB COPY POINTERS AREA.                   16 BYTES     */ 00278200
*/*   2. O/C/E ACCESS METHOD AREA.                       4 BYTES     */ 00278900
*/*   2. O/C/E RECOVERY ROUTINE AUDIT TRAIL AREA.       24 BYTES     */ 00279600
*/*   2. O/C/E SWA CURRENT JFCB POINTER                  4 BYTES     */ 00280300
*/*   2. O/C/E CVAF/CP REBUILD                           8 BYTES @L7A*/ 00281000
*/*   2. RESERVED                                       40 BYTES @L7A*/ 00281700
*/*                                                    ---------     */ 00282400
*/*                                  DSECTSIZ TOTAL =  664 BYTES @L7C*/ 00283100
*/*                                                                  */ 00283800
*/* **************************************************************** */ 00284500
*/*                                                                  */ 00285200
*%GOTO DSECTL2; /*                                                 @H1A 00285900
         EJECT                                                          00303300
*********************************************************************** 00842000
*                                                                       00850000
*        VOLUME LABEL AREA - SEE 'DATA SET LABELS- FL1 AND FL2'         00860000
*                                                                       00870000
*********************************************************************** 00872000
         SPACE 1                                                        00880000
DXLBL    DS    0CL80                                                    00900000
VOLAREA  DS    0CL80               VOLUME LABEL AREA               @H1A 00910000
VOLLABI  DS    CL3                 LABEL IDENTIFIER                     00920000
VOLNO    DS    CL1                 VOLUME LABEL NUMBER                  00940000
VOLSERNO DS    CL6                                                      00960000
VOLSEC   DS    CL1                                                      00980000
         DS    0CL10               RESERVED                             01000000
VOLVTOC  DS    CL5                                                      01020000
         DS    CL5                                                      01040000
         DS    CL10                RESERVED                        @P4C 01060000
         DS    CL10                RESERVED                        @P4C 01080000
VOLOWNER DS    CL10                OWNER NAME AND ADDRESS CODE          01100000
         DS    CL29                RESERVED                             01120000
         SPACE 1                                                        01120100
*********************************************************************** 01120400
*                                                                       01120800
*        ANSI VOLUME LABEL AREA                                         01122000
*        (ANSI AND IBM STANDARD LABEL DIFFERENCES)                      01124000
*                                                                       01126000
*********************************************************************** 01126400
         SPACE 1                                                        01126800
         ORG   DXLBL+37                                                 01128000
AVOLOWNR DS    CL14                     OWNER IDENTIFICATION            01130000
         DS    CL28                     RESERVED                        01132000
LABSTAND DS    CL1                      LABEL STANDARD LEVEL            01134000
         SPACE 1                                                        01140000
*********************************************************************** 01150000
*                                                                       01152000
*        FILE LABEL 1 AREA - SEE 'DATA SET LABEL -- FL1'                01160000
*                                                                       01170000
*********************************************************************** 01172000
         SPACE 1                                                        01180000
         ORG   DXLBL                                                    01200000
FL1AREA  DS    0CL80               FILE LABEL 1 AREA               @H1A 01210000
FL1LABI  DS    CL3                 LABEL IDENTIFIER                     01220000
FL1NO    DS    CL1                 FILE LABEL NUMBER                    01240000
FL1ID    DS    CL17                FILE IDENTIFIER                      01260000
FL1FILSR DS    CL6                 FILE SERIAL NUMBER                   01280000
FL1VOLSQ DS    CL4                 VOLUME SEQUENCE NUMBER               01300000
FL1FILSQ DS    CL4                 FILE SEQUENCE NUMBER                 01320000
FL1GNO   DS    CL4                 GENERATION NUMBER                    01340000
FL1VNG   DS    CL2                 VERSION NUMBER OF GENERATION         01360000
FL1CREDT DS    CL6                 CREATION DATE                        01380000
FL1EXPDT DS    CL6                 EXPIRATION DATE                      01400000
FL1FSEC  DC    C'0'                FILE SECURITY INDICATOR              01420000
FL1BLKCT DS    CL6                 BLOCK COUNT LOW ORDER           @06C 01440000
FL1SYSCD DS    CL13                SYSTEM CODE                          01460000
FL1RES   DS    0CL3                RESERVED FOR FUTURE USE         @06C 01480000
         DS    CL1                                                      01500000
FL1RES1  DS    CL2                                                 @06C 01513300
FL1BLKHI DS    CL4                 BLOCK COUNT HIGH ORDER          @06A 01526600
         SPACE 1                                                        01540000
*********************************************************************** 01550000
*                                                                       01552000
*        FILE LABEL 2 AREA - SEE 'DATA SET LABEL -- FL2'                01560000
*                                                                       01570000
*********************************************************************** 01572000
         SPACE 1                                                        01580000
         ORG   DXLBL                                               @H1C 01588000
FL2AREA  DS    0CL80               FILE LABEL 2 AREA               @H1A 01596000
FL2LABI  DS    CL3                 LABEL IDENTIFIER                @H1A 01604000
FL2NO    DS    CL1                 FILE LABEL NUMBER               @H1A 01612000
FL2RECFM DS    CL1                 RECORD FORMAT                        01620000
FL2BLKL  DS    CL5                 BLOCK LENGTH                         01640000
FL2LRECL DS    CL5                 BLOCKING FACTOR/RECORD LENGTH        01660000
FL2DEN   DS    CL1                 DENSITY                              01680000
FL2FILP  DS    CL1                 FILE POSITION                        01700000
FL2JSID  DS    0CL17               JOB/STEP IDENTIFICATION              01720000
FL2JOBD  DS    CL8                 JOB IDENTIFICATION                   01740000
FL2JSSP  DC    C'/'                SLASH                                01760000
FL2STEPD DS    CL8                 STEP IDENTIFICATION                  01780000
*                                                                  @H1A 01790000
FL2TRTCH DS    CL2                 TAPE RECORDING TECHNIQUE             01800000
FL2CNVRS EQU   C'C'                     7-TRACK CONVERSION         @H1A 01803300
FL2XLATE EQU   C'T'                     7-TRACK TRANSLATION        @H1A 01806600
FL2EVENP EQU   C'E'                     7-TRACK EVEN PARITY        @H1A 01809900
FL2CMPAC EQU   C'P'                     COMPACTION RECORDING MODE  @H1A 01813200
*                                                                  @H1A 01816500
FL2CNTRL DS    CL1                 CARRAIGE CONTROL CHARACTER           01820000
         DS    CL1                     RESERVED FOR FUTURE USE          01830000
FL2BLKA  DS    CL1                     BLOCK ATTRIBUTE                  01840000
         DS    CL1                 RESERVED                      99223  01842000
FL2DRID  DS    0CL7                TAPE DRIVE ID                 99223  01844000
         DS    CL1                 RESERVED                        @35C 01845400
FL2ID    DS    CL6                 ID OF CREATING DRIVE            @35C 01846800
FL2DSIND DS    CL1                 DATA SET INDICATOR FIELD      Y02083 01848400
FL2CKDS  EQU   C'C'                     CHECKPOINT DATA SET        @H1A 01849200
FL2RES   DS    CL22                RESERVED FOR FUTURE USE         @LFC 01849500
FL2LBLKL DS    CL10                LBI BLOCK LENGTH                @LFA 01849800
         SPACE 1                                                        01850100
*********************************************************************** 01850400
*                                                                       01851000
*        ANSI FILE LABEL 2 AREA                                         01852000
*        (ANSI AND IBM STANDARD FILE LABEL 2 DIFFERENCES)               01852400
*                                                                       01853000
*********************************************************************** 01853400
         SPACE 1                                                        01853800
         ORG   DXLBL+39                                            @LDA 01854100
FL2CCSID DS    CL5                      CCSID TRANSLATION V4 ONLY  @LDA 01854400
         ORG   DXLBL+50                                                 01854700
FL2BUFOF DS    CL2                      BUFFER OFFSET                   01855000
         SPACE 1                                                        01860000
*********************************************************************** 01870000
*                                                                       01872000
*        DATA SET CONTROL BLOCK AREA - SEE 'FORMAT 1 DSCB'              01880000
*                                                                       01892000
*********************************************************************** 01894000
         SPACE 1                                                        01900000
         ORG   DXLBL                                                    01920000
DXDSCB   DS    0CL96                                                    01940000
DSCFMTID DC    C'1'                                                     01960000
DSCFILSR DS    CL6                 FILE SERIAL NUMBER                   01980000
DSCVOLSR DS    CL2                                                      02000000
DSCCREDT DS    CL3                 CREATION DATE IN DISCONTINOUS BIN    02020000
DSCEXPDT DS    CL3                 EXPIRATION DATE IN DISCONTINOUS BIN  02040000
DSCNOEXT DS    CL1                                                      02060000
DSCBLDBL DS    CL1                                                      02080000
DSCFLAG1 DS    CL1                 FLAG 1                          @15A 02100000
DSCSYSCD DS    CL13                SYSTEM CODE                          02120000
DSCREFD  DS    CL3                 DATE LAST REFERENCED        @ZA43489 02140000
DSCSMSFG DS    XL1                 SYSTEM MANAGED STORAGE INDICATORS   X02141700
                                                                   @L6A 02143400
DSCSMSDS EQU   X'80'   1... ....   SYSTEM MANAGED DATA SET         @L6A 02145100
DSCSMSUC EQU   X'40'   .1.. ....   UNCATALOGED SYSTEM MANGED DATA SET  X02146800
                                                                   @L6A 02148500
DSCREBLK EQU   X'20'   ..1. ....  DATA SET MAY BE REBLOCKED        @L6A 02150200
DSCCRSDB EQU   X'10'   ...1 ....  DADSM CREATE ORIGINATED BLKSZIE  @L6A 02151900
DSCPDSE  EQU   X'08'   .... 1...  DATA SET IS AN PDSE              @L8A 02153600
DSCSTRP  EQU   X'04'   .... .1..  DATA SET IS STRIPED              @LAA 02155300
*                      .... ..11  RESERVED                         @LAC 02157000
DSCSCEXT DS    0XL3               SECONDARY SPACE EXTENSION        @L6A 02158700
DSCSCXTF DS    XL1                SECONDARY SPACE EXTENSION        @L6A 02160400
DSCSCAVB EQU   X'80'   1... ....  IF 1, DS1SCXTV IS THE ORIGINAL   @L6A 02162100
*                                 AVERAGE BLOCK LENGTH             @L6A 02163800
DSCSCMB  EQU   X'40'   .1.. ....  IF 1, DS1SCXTV IS IN MEGABYTES   @L6A 02165500
DSCSCKB  EQU   X'20'   ..1. ....  IF 1, DS1SCXTV IS IN KILOBYTES   @L6A 02167200
DSCSCUB  EQU   X'10'   ...1 ....  IF 1, DS1SCXTV IS IN BYTES       @L6A 02168900
*                      .... 1111  RESERVED                         @L6A 02170600
DSCSCXTV DS    XL2                SECONDARY SPACE EXTENSION VALUE  @L6A 02172300
*                                                                  @L6A 02174000
*        DS    CL4                                                 @L6D 02175700
DSCFILTY DS    CL2                 FILE TYPE (DSORG)               @L6C 02177400
DSCRECFM DS    CL1                 RECORD FORMAT                        02180000
DSCOPTCD DS    CL1                 OPTION CODE                          02200000
DSCBLKL  DS    CL2                 BLOCK LENGTH                         02220000
DSCLRECL DS    CL2                 RECORD LENGTH                        02240000
DSCKEYL  DS    CL1                 KEY LENGTH                           02260000
DSCRKP   DS    CL2                 KEY LOCATION                         02280000
DSCDSIND DS    CL1                                                      02300000
DSCLSTVL EQU   X'80'               LAST VOLUME INDICATOR           @LAA 02310000
DSCSCALO DS    CL4                                                      02320000
DSCLSTAR DS    CL3                 LAST USED TRACK AND BLOCK ON TRACK   02340000
*                                   FOR STRIPED- LOW  ORDER HALF   @LAA 02342500
*                                   WORD FOR RELATIVE TRACK ADDR   @LAA 02345000
*                                   OF LAST RECORD WRITTEN IN BYTES@LAA 02347500
*                                   0 AND 1, BYTE 2 CONTAINS RECORD@LAA 02350000
*                                   NUMBER ON TRACK. HIGH ORDER    @LAA 02352500
*                                   HALFWORD TRACK ADDR IN DSCTRBAL@LAA 02355000
DSCTRBAL DS    CL2                 BYTES REMAINING ON LAST TRACK USED.  02357500
*                                   FOR STRIPED- HIGH ORDER HALF   @LAA 02360000
*                                   WORD FOR RELATIVE TRACK ADDR   @LAA 02362500
*                                   OF LAST RECORD WRITTEN, LOW    @LAA 02365000
*                                   ORDER HALF WORD IN DSCLSTAR.   @LAA 02367500
         DS    CL2                 RESERVED                             02370000
DSCEXTYP DS    CL1                 EXTENT TYPE INDICATOR                02380000
DSCEXTSQ DS    CL1                 EXTENT SEQUENCE NUMBER               02400000
DSCLOWLM DS    CL4                                                      02420000
DSCUPPLM DS    CL4                                                      02440000
DSCEXT1  DS    CL10                                                     02460000
DSCEXT2  DS    CL10                                                     02480000
DSCNEXT  DS    CL5                 POINTER TO NEXT RECORD               02500000
DSCCORE  DS    CL4                 CORE ADDRESS OF NEXT DSCB RECORD     02520000
DSCBEND  EQU   *                                                        02540000
         SPACE 1                                                        02560000
*********************************************************************** 02570000
*                                                                       02572000
*        DATA SET CONTROL BLOCK (FORMAT 3) KEY AREA                     02580000
*                                                                       02592000
*********************************************************************** 02594000
         SPACE 1                                                        02600000
         ORG   DXDSCB                                                   02620000
DXDSCB3K DS    0CL40                                                    02640000
DSCBF3C  DC    X'03030303'                                              02660000
DSCBEXSK DS    0CL40                                                    02680000
DSCBEXTY DS    CL1                 EXTENT TYPE INDICATOR                02700000
DSCBEXSQ DS    CL1                 EXTENT SEQUENCE NUMBER               02720000
DSCBLLMT DS    CL4                 CCHH LOWER LIMIT                     02740000
DSCBULMT DS    CL4                 CCHH UPPER LIMIT                     02760000
DSCBEX2  DS    CL10                ADDITIONAL EXTENT                    02780000
DSCBEX3  DS    CL10                ADDITIONAL EXTENT                    02800000
DSCBEX4  DS    CL10                ADDITIONAL EXTENT                    02820000
         SPACE 1                                                        02840000
*********************************************************************** 02850000
*                                                                       02852000
*        DATA SET CONTROL BLOCK (FORMAT 3) RECORD AREA                  02860000
*                                                                       02862000
*********************************************************************** 02870000
         SPACE 1                                                        02880000
         ORG   DXDSCB                                                   02900000
DSCBFMID DC    C'3'                FORMAT ID                            02920000
DSCBEXSD DS    0CL90               ADDITIONAL EXTENTS                   02940000
DSCBEX5  DS    CL10                ADDITIONAL EXTENT                    02960000
DSCBEX6  DS    CL10                ADDITIONAL EXTENT                    02980000
DSCBEX7  DS    CL10                ADDITIONAL EXTENT                    03000000
DSCBEX8  DS    CL10                ADDITIONAL EXTENT                    03020000
DSCBEX9  DS    CL10                ADDITIONAL EXTENT                    03040000
DSCBEXA  DS    CL10                ADDITIONAL EXTENT                    03060000
DSCBEXB  DS    CL10                ADDITIONAL EXTENT                    03080000
DSCBEXC  DS    CL10                ADDITIONAL EXTENT                    03100000
DSCBEXD  DS    CL10                ADDITIONAL EXTENT                    03120000
DSCBNEXT DS    CL5                 CCHHR OF NEXT FORMAT 3 DSCB          03140000
         SPACE 1                                                   @05A 03141500
*******************************************************************@05A 03143000
*                                                                  @05A 03144500
*        ADDRESS OF I/O SIMULATION WORK AREA (SIMW)                @05A 03146000
*        (USED BY IFG019RC).                                       @05A 03147500
*        NOTE - THE AREA USED IS REPLY, THE LAST 4 BYTES OF        @05A 03149000
*        THE REPLY AREA.                                           @05A 03150500
*                                                                  @05A 03152000
*******************************************************************@05A 03153500
         ORG   DSCBNEXT+1                                          @05A 03155000
DXSIMWA  DS    A                   ADDR SIMW                       @05A 03156500
SIMWINIT EQU   X'80'               ADDR SIMW INITIALIZED           @05A 03158000
         SPACE 1                                                        03160000
*********************************************************************** 03170000
*                                                                       03172000
*        MESSAGE AREA                                                   03180000
*                                                                       03182000
*********************************************************************** 03190000
         SPACE 1                                                        03200000
         ORG   DXDSCB                                                   03220000
REPLYLTH DS    CL1                                                      03240000
REPLYADR DS    CL3                                                      03260000
REPLYECB DS    CL4                                                      03280000
MSGLSTSZ DS    CL2  MSG LENGTH                                     DM0Q 03290000
MCSFLAGS DS    CL2  FLAG FIELD FOR MCS                             DM0Q 03300000
MESSAGEA DS    CL68 MESSAGE AREA                                   DM0Q 03310000
DESCODE  DS    CL2  DESCRIPTOR CODE FOR MCS                        DM0Q 03320000
ROUTCODE DS    CL2  ROUTING CODE FOR MCS                           DM0Q 03330000
REPLY    DS    CL12 REPLY AREA                                     DM0Q 03340000
*                                                                       03360000
         ORG   MESSAGEA                                                 03380000
         SPACE 1                                                        03390000
*********************************************************************** 03392000
*                                                                       03400000
*        DEFINITION OF LENGTH OF MESSAGE COMPONENTS                     03420000
*                                                                       03440000
*********************************************************************** 03450000
         SPACE 1                                                        03452000
MSERL    EQU   3                        MESSAGE SERIAL NUMBER LENGTH    03460000
MINSTL   EQU   6                        MSG INSTRUCTION LTH INC MSG SER 03480000
MUNL     EQU   3                        MESSAGE UNIT NAME LENGTH        03500000
MVOLL    EQU   6                        MESSAGE VOLUME SERIAL LENGTH    03520000
         SPACE 1                                                        03530000
*********************************************************************** 03532000
*                                                                       03534000
* MTXTL        LENGTH MAY BE DEFINED BY EACH MODULE TO FIT REQUIREMENT  03540000
* MSGLTH       LENGTH OF FULL MSG DEFINED BY EACH MODULE                03560000
*                                                                       03562000
*********************************************************************** 03564000
         SPACE 1                                                        03570000
*********************************************************************** 03572000
*                                                                       03574000
*        MESSAGE FORMAT IS 'IEC000A M 000,00000  (TEXT)         '       03580000
*                                                                       03582000
*********************************************************************** 03590000
         SPACE 1                                                        03592000
MSGIOSUP DC    CL3'IEC'                 I/O SUPPORT MESSAGE IDENTITY    03600000
MSGSER   DS    0CL3                     MESSAGE SERIAL NUMBER           03620000
         ORG   MSGSER+MSERL-1                                           03640000
MSGSERLO DS    CL1                      VOLUME SERIAL LO ORDER BYTE     03660000
         ORG   MSGSER                                                   03680000
MSGINSTR DC    CL6'000A M'              MESSAGE INSTRUCTION INCL MSGSER 03700000
         ORG   MSGINSTR+MINSTL-1                                        03720000
MSGACTN  DS    CL1                      MESSAGE ACTION REQD BY OPERATOR 03740000
         DC    C' '                                                     03760000
MSGUN    DC    CL3'000'                 UNIT NAME THAT MSG REFERS TO    03780000
         DC    C','                                                     03800000
MSGVOLSR DC    CL6'000000'              VOLUME SERIAL THAT MSG REFRS TO 03820000
         DC    C','                                                     03840000
MSGTEXT  DS    0CL47                                               DM0Q 03860000
         SPACE 1                                                        03865000
         ORG   DSCCORE                                            @LBA  03870000
DXVSAMRC DS    F                        VSAM RETURN CODE          @LBA  03875000
         SPACE 1                                                        03880000
*********************************************************************** 03892000
*                                                                       03894000
*        JOB FILE CONTROL BLOCK AREA - SEE 'JFCB'                       03900000
*                                                                       03910000
*********************************************************************** 03912000
         SPACE 1                                                        03920000
         ORG   DSCBEND                                                  03940000
DXJBF    DS    0CL176                                                   03960000
*        IEFJFCBN                                                Y02080 03980000
         IEFJFCBN LIST=YES                                              03986000
         SPACE 1                                                        03992000
*********************************************************************** 04000000
*                                                                       04010000
*        O/C/E INTERNAL CONTROL BLOCKS AREA -                           04020000
*        SEE 'ECB', 'IOB', 'DEB', 'DCB'                                 04020400
*        THE CONTROL BLOCK AREAS THAT FOLLOW (DXECB, DXIOB,             04020800
*        DXADDR, DXXXX, AND THE CHANNEL COMMAND WORDS) ARE              04021200
*        USED BY THE O/C/EOV ROUTINES TO PERFORM I/O: READ              04021600
*        AND WRITE LABELS, POSITION TAPE VOLUMES, ETC.                  04021700
*                                                                       04022000
*********************************************************************** 04030000
         SPACE 1                                                        04040000
DXECB    DS    0CL4                     EVENT CONTROL BLOCK             04060000
         DC    X'00000000'                                              04080000
         SPACE 1                                                        04100000
*********************************************************************** 04110000
*                                                                       04112000
*        O/C/E INTERNAL INPUT/OUTPUT BLOCK                              04120000
*                                                                       04130000
*********************************************************************** 04132000
*                                                                       04134000
*  IF IOB=NO IS SPECIFIED 'DXIOB CL32' WILL BE THE ONLY                 04136000
*  FIELD GENERATED IN THE IOB SECTION OF IECDSECT.                      04138000
*  IF IOB=YES IS SPECIFIED OR IF IOB= IS OMITTED ALL IOB LABELS,        04138400
*  AS DESCRIBED IN THE IOB SECTION OF THIS MACRO, WILL BE EXPANDED.     04138800
*                                                                       04139200
*********************************************************************** 04139600
         SPACE 1                                                        04140000
         AIF   ('&IOB' EQ 'NO').IECA010                          S21940 04150000
         AIF   ('&IOB' EQ 'YES').IECA005                         S21940 04152000
         IHBERMAC 183,&IOB,YES                                          04154000
.IECA005 ANOP                                                    S21940 04156000
DXIOB    DS    0CL32                                                    04160000
IOBWRITE EQU   X'40' -                  IOB USE FOR WRITE        Y02080 04170000
IOBREAD  EQU   X'20' -                  IOB USED FOR READ        Y02080 04172000
IOBFLAG1 DC    X'00'                                                    04180000
IOBUNREL EQU   X'02' -                  UNRELATED FLAG           Y02080 04190000
IOBFLAG2 DC    X'00'                                                    04200000
IOBSENSE DS    0H                                                       04220000
IOBSENS0 DS    CL1                                                      04240000
IOBSENS1 DS    CL1                 SENSE BYTE "1"                       04260000
IOBECBPT DS    XL1                                                      04280000
         DC    AL3(DXECB)                                               04300000
IOBCSW   DS    0D                                                       04320000
IOBCOMAD DC    X'00000000'         KEY,0000,COMMAND ADDRESS             04340000
IOBSTAT0 DC    X'00'               STATUS BYTE 0                        04360000
IOBSTAT1 DC    X'00'               STATUS BYTE 1                        04380000
IOBCNT   DC    X'0000'             COUNT                                04400000
IOBSIOCC DS    XL1                                                      04420000
IOBSTART DC    AL3(DXCCW)                                               04440000
IOBWGHT  DS    XL1                                                      04460000
IOBFLAG4 EQU   IOBWGHT                                             @H2A 04466600
IOBCEF   EQU   X'10'               IOB EXTENSION EXISTS            @H2A 04473200
IOBDCBPT DC    AL3(DXDCB)                                               04480000
         DS    XL1                                                      04500000
         DS    XL3                                                      04520000
IOBINCAM DC    X'0000'                                                  04540000
IOBERRCT DS    XL2                                                      04560000
         AGO   .IECA015                                          S21940 04570000
.IECA010 ANOP                                                    S21940 04570100
DXIOB    DS    CL32                                              S21940 04570400
.IECA015 ANOP                                                    S21040 04572000
         SPACE 1                                                        04572400
DXDAADDR DS    D                   DIRECT ACCESS ADDRESS (MBBCCHHR)     04580000
         SPACE 1                                                        04600000
*********************************************************************** 04610000
*                                                                       04612000
*        O/C/E INTERNAL DATA EXTENT BLOCK                               04620000
*                                                                       04622000
*********************************************************************** 04630000
         SPACE 1                                                        04640000
DYYYY    DS    0CL44                                                    04660000
DXDEB    EQU   DYYYY-4                                                  04680000
DXDEBDEB DC    X'00000000'                                              04700000
DXDEBOFL DS    0CL1                                                     04720000
DXDEBIRB DC    X'00000000'                                              04740000
DXDEBSYS DC    X'00000000'                                              04760000
DXDEBUSR DC    X'00000000'                                              04780000
DXDEBECB DC    X'00000000'                                              04800000
DXDEBID  DS    0CL1                                                     04820000
DXDEBDCB DC    AL4(DXDCB)                                               04840000
DXDCBAD  EQU   DXDEBDCB                                                 04860000
DXDEBAPP DS    CL4                                                      04880000
DXDEBMOD DS    0CL1                                                     04900000
DXDEBUCB DS    F                                                        04920000
DXDEBBIN DS    H                                                        04940000
DXDEBSCC DS    H                                                        04960000
DXDEBSHH DS    H                                                        04980000
DXDEBECC DS    H                                                        05000000
DXDEBEHH DS    H                                                        05020000
DXDEBNTR DS    H                                                        05040000
         SPACE 1                                                        05060000
*********************************************************************** 05070000
*                                                                       05072000
*        O/C/E INTERNAL DATA CONTROL BLOCK                              05080000
*                                                                       05090000
*********************************************************************** 05092000
         SPACE 1                                                        05100000
DXXXX    DS    0F                                                       05120000
DXDCB    EQU   DXXXX-44            POINTER TO RELATIVE BEGINNING OF DCB 05140000
DXDCBDEB DC    A(DXDEB)                                                 05160000
         SPACE 1                                                        05180000
*********************************************************************** 05190000
*                                                                       05192000
*        O/C/E INTERNAL CHANNEL CONTROL WORDS                           05194000
*                                                                       05196000
*********************************************************************** 05204000
         SPACE 1                                                        05220000
         CNOP  0,8                                                      05240000
DXCCW    DS    0CL96                                                    05260000
DXCCW1   DS    D                                                        05280000
DXCCW2   DS    D                                                        05300000
DXCCW3   DS    D                                                        05320000
DXCCW4   DS    D                                                        05340000
DXCCW5   DS    D                                                        05360000
DXCCW6   DS    D                                                        05380000
DXCCW7   DS    D                                                        05400000
DXCCW8   DS    D                                                        05420000
DXCCW9   DS    D                                                        05440000
DXCCW10  DS    D                                                        05460000
DXCCW11  DS    D                                                        05480000
DXCCW12  DS    D                                                        05500000
         SPACE 1                                                 Y02080 05510000
*******************************************************************@H1M 05510800
*                                                                  @H1M 05511600
*        O/C/E COMMON EXTENDED WORK AREA                           @H1M 05512400
*                                                                  @H1M 05513200
*******************************************************************@H1M 05514000
         SPACE 1                                                   @H1M 05514800
DXOLDVOL DS    CL6                      LAST VOL SER IN EOV    @G32DSMI 05516000
DXRCFLAG DS    X                        RACF FLAG BYTE         @G32DSMI 05516600
DXRCOUT  EQU   X'80'                    RACF AUTH FOR OUTPUT   @G32DSMI 05517200
DXRCINP  EQU   X'40'                    RACF AUTH FOR INPUT    @G32DSMI 05517800
DXRCDEF  EQU   X'20'                    RACDEF DELETE NEEDED   @G32DSMI 05518400
DXFLAGG1 DS    X                        FLAG BYTE              @ZA40178 05519000
DXEX0A01 EQU   X'80'                    IFG0EX0A ASKS REREAD   @G60ASRB*05519300
                                        OF DSCB NOT FOUND-NEXT @G60ASRB*05519400
                                        NOT FOUND SKIPS EXIT   @G60ASRB 05519600
DXNRECAT EQU   X'40'                    DSN CHANGED DURING OPENJ   @01A 05520800
DXRECOVR EQU   X'20'                    DCB ABEND EXIT RECOVERY    @LECX05522000
                                        ENTERED ONCE.              @LEC 05523200
DXEXPDAT EQU   X'10'                    SKIP EXPIRATION DATE CHECK @L1A 05524400
DXPASSWD EQU   X'08'                    SKIP PASSWORD CHECK        @L1A 05525600
DXLKAHDV EQU   X'04'                    TEST FOR LOOK AHEAD VOLSER @L1A 05526800
DXF1MMS  EQU   X'02'                    MEDIA MANAGER SERVICES     @LMA 05528000
DXF1MSIX EQU   X'01'                    MMS INDEX CONNECT          @LMA 05529200
DXBTMASK EQU   X'E7'                    BIT MASK                   @L1A 05530400
         SPACE 1                                                        05531600
*                                                                 6@H1D 05532800
DXXCTL   DS    CL8                      TRANSFER CONTROL AREA    Y02134 05534400
         SPACE 1                                                 Y02134 05534800
DXWORK   DS    F                        WORK FIELD               Y02134 05535200
DXWORK1  DS    F                        WORK FIELD               Y02134 05535600
DXWORK2  DS    F                        WORK FIELD               Y02134 05535700
DXWORK3  DS    F                        WORK FIELD               Y02134 05535800
DXWORK4  DS    F                        WORK FIELD               Y02134 05535900
         SPACE 1                                                 Y02134 05536700
DXVOLSR  DS    0CL18                    VOLUME SERIAL NUMBERS    Y02080 05538600
DXVOLMT1 DS    0CL6                     VOLUME TO BE DISMOUNTED  Y02134 05540000
DXVOLSR1 DS    CL6                      VOLUME TO BE DISMOUNTED  Y02134 05540200
DXVOLMT2 DS    0CL6                     VOLUME TO BE MOUNTED     Y02134 05541000
DXVOLSR2 DS    CL6                      VOLUME TO BE MOUNTED     Y02134 05541800
DXVOLMT3 DS    0CL6                     LOOK AHEAD MOUNT VOLUME  Y02134 05542600
DXVOLSR3 DS    CL6                      LOOK AHEAD MOUNT VOLUME  Y02134 05543400
         SPACE 1                                                        05544200
DXVOLSEQ DS    H                        VOLUME SEQUENCE NUMBER   Y02080 05545000
DXNOUNIT DS    H                        NUMBER UNITS ALLOCATED   Y02080 05546300
DXUNITOF DS    H                        OFFSET TO CURRENT UNIT   Y02080 05546600
         SPACE 1                                                 Y02080 05550000
DXRESSW  DS    CL1                      RESIDENT ROUTINE INDICTR Y02134 05552000
DXWKEYSV DS    AL1                      SAVED KEY OF IECRES CALL Y02082 05554000
DXUKEY   DS    AL1                      O/C/E CALLERS KEY        Y02080 05555200
DXEXTSW  DS    AL1                      EXTEND SWITCH            Y02080 05555600
         SPACE 1                                                 Y02080 05556100
*********************************************************************** 05556600
*                                                                       05557000
*        POINTERS TO CONTROL BLOCKS IN PROTECTED STORAGE                05558000
*                                                                       05558400
*********************************************************************** 05566400
         SPACE 1                                                 Y02080 05574600
DXASCBAD DS    AL4                      POINTER TO ASCB          Y02080 05582600
DXTCBADR DS    AL4                      POINTER TO TCB           Y02080 05590600
DXJSCBAD DS    AL4                      POINTER TO JSCB          Y02080 05598600
DXDSABQD DS    AL4                      POINTER TO DSAB QDB      Y02080 05606600
DXDSABAD DS    AL4                      POINTER TO FIRST DSAB    Y02080 05616600
DXDSAB   DS    AL4                      POINTER TO CURRENT DSAB  Y02080 05618600
DXDEBXAD DS    AL4                      POINTER TO DEB EXTENSION Y02080 05626600
DXTIOTAD DS    AL4                      POINTER TO TIOT          Y02080 05636600
DXUCBADR DS    AL4                      POINTER TO CURRENT UCB   Y02080 05646600
DXUCBSAV DS    AL4                      SAVED UCB POINTER        Y02134 05646700
         SPACE 1                                                 Y02080 05647000
*********************************************************************** 05648900
*                                                                       05650900
*        USER DCB COPY POINTERS AREA:                                   05651100
*                                                                       05652700
*********************************************************************** 05652800
         SPACE 1                                                 Y02082 05655000
*                                                                Y02082 05656600
* ORIGINAL DCB INFO NEEDED BY INIT AND INITIAL COPY              Y02082 05656700
*                                                                Y02082 05656800
         SPACE 1                                                 Y02082 05656900
* INFO FROM COMMON INTERFACE                                     Y02082 05657000
         ORG   DXWORK                   AFTER FOUNDATION         Y02134 05657400
DXWDSORG DS    0BL2                     COPIED DATA SET ORG USED Y02082 05657800
DXWDSRG1 DS    BL1                      FIRST BYTE OF DCBDSORG   Y02082 05657900
DXWDSRG2 DS    BL1                      SECOND BYTE OF DCBDSORG  Y02082 05658000
         SPACE 1                                                 Y02082 05658200
* FOUNDATION BEFORE OPEN                                         Y02082 05658300
         ORG   DXWORK+4                 OVERLAY 16 BYTES         Y02082 05658400
DXWFOUN  DS    0CL12                    DCB FOUNDATION           Y02082 05658500
DXWDDNAM DS    CL8                      DDNAME                   Y02082 05658600
DXWOFLGS DS    BL1                      OPEN FLAGS               Y02082 05658700
DXWIFLG  DS    BL1                      ERROR FLAGS FOR IOS      Y02082 05658800
DXWMACR  DS    0BL2                     TYPE I/O MACRO INSTR     Y02082 05658900
DXWMACR1 DS    BL1                      FIRST BYTE DCBMACR1      Y02082 05659000
DXWMACR2 DS    BL1                      SECOND BYTE DCBMACR2     Y02082 05659200
         SPACE 1                                                 Y02082 05659300
* FOUNDATION AFTER OPEN                                          Y02082 05659400
         ORG   DXWORK+4                 OVERLAY 4 WORDS          Y02082 05659500
DXWTIOT  DS    H                        OFFSET TO DD ENTRY TIOT  Y02082 05659600
DXWMACRF DS    0BL2                     TYPE I/O MACRO INSTR     Y02082 05659700
DXWMACF1 DS    BL1                      FIRST BYTE DCBMACF1      Y02082 05659800
DXWMACF2 DS    BL1                      SECOND BYTE DCBMACF2     Y02082 05660000
DXWDEBAD DS    0A                       ADDR OF DEB              Y02082 05660400
DXWIFLGS DS    BL1                      ERROR FLAGS FOR IOS      Y02082 05660500
         DS    AL3                      DEB ADDR                 Y02134 05660600
         ORG   DXWORK+16                ORG PAST FOUNDATION      Y02082 05660700
DXWCOPYE DS    BL1                      COPY ERROR CODE:         Y02082 05661000
*                                       0 = GOOD, 1 = BAD        Y02082 05661400
DXWMCR   DS    0BL2                     COMMON MACREF            Y02134 05661800
DXWMCR1  DS    BL1                      FIRST BYTE OF DCB MACREF Y02134 05661900
DXWMCR2  DS    BL1                      SECOND BYTE OF DCB MACRF Y02134 05662000
         DS    0F                                                Y02082 05662100
         ORG   ,                        RESET LOCATION COUNTER   Y02082 05662200
DXUDCBAD DS    AL4                      POINTER TO USER DCB      Y02082 05662500
DXPDCBAD DS    AL4                      POINTER TO COPIED DCB    Y02082 05663800
DXUDCBPL DS    H                        LNTH OF USER DCB PREFIX  Y02082 05664200
DXUDCBML DS    H                        LNTH OF MOVED DCB        Y02082 05664600
DXPRPARC DS    AL4                      SAVED PARM LIST POINTER  Y02082 05664700
         SPACE 1                                                 Y02080 05667000
*********************************************************************** 05667600
*                                                                       05668200
*        ACCESS METHOD AREA                                      Y02080 05668900
*                                                                       05670200
*********************************************************************** 05671500
         SPACE 1                                                 Y02080 05672800
DXMSGADR DS    AL4                      POINTER TO MSG CSECT     Y02080 05674100
         SPACE 1                                                 Y02080 05675800
*********************************************************************** 05676700
*                                                                       05678000
*        RECOVERY ROUTINE DCB AUDIT TRAIL AREA                   Y02080 05679300
*                                                                       05680600
*********************************************************************** 05681900
         SPACE 1                                                 Y02080 05683200
DXATCOM1 DS    0CL4                     COMMON O/C/E AUDIT INFO  Y02144 05683300
*                                                                Y02144 05683700
DXATGENS DS    B                        GENERAL STATUS           Y02144 05684100
*                                                                Y02144 05684500
DXATDMCT EQU   X'80'                    DATA MGMT CNT INCREMENT  Y02144 05684900
DXATREFR EQU   X'40'                    ON, DON'T COPY BACK DCB  YM1275 05685300
DXATDISP EQU   X'20'                    VOLUME DISP PERFORMED    Y02144 05685700
DXATJFCB EQU   X'10'                    JFCB READ OK             Y02144 05686100
DXATVGIV EQU   X'0E'                    A.M. STRING/CI GIVEN CTL Y02144 05686500
DXATVSMG EQU   X'08'                    VSAM STRING GIVEN CONTRL Y02144 05686900
DXATVTMG EQU   X'04'                    VTAM STRING GIVEN CONTRL Y02144 05687300
DXATVCIG EQU   X'02'                    ISAM-VSAM CI GIVEN CNTRL Y02144 05687700
DXATSRET EQU   X'01'                    A.M. STRING RETURNED CTL Y02144 05688100
*                                                                Y02144 05688500
DXATCLOS DS    C                        CLOSE FINAL PROCESSING   Y02144 05688900
*                                                                Y02144 05689300
DXATDBCK EQU   X'02'                    DEB DELETED FROM DEB TBL Y02144 05689400
DXATDELT EQU   X'04'                    A.M. ROUTINES AND I/O    Y02144 05689700
*                                       APPENDAGES DELETED       Y02144 05690100
DXATUTOT EQU   X'08'                    USER TOTALING SAVE AREA  Y02144 05690500
*                                       RELEASED                 Y02144 05690900
DXATRDCB EQU   X'0C'                    DCB RESTORATION FINISHED Y02144 05691300
DXATRDEB EQU   X'10'                    DEB REMOVED FR DEB CHAIN Y02144 05691400
DXATSABS EQU   X'14'                    STARTED DECREMENTING     Y02144 05691500
*                                       OPEN COUNT IN DSAB(S)    Y02144 05691600
DXATSABF EQU   X'18'                    FINISHED DECREMENTING    Y02144 05691800
*                                       OPEN COUNT IN DSAB(S)    Y02144 05691900
DXATDMS  EQU   X'1C'                    STARTED DECREMENTING     Y02144 05692000
*                                       DATA MGMT CNT IN UCB(S)  Y02144 05692100
DXATDMF  EQU   X'20'                    FINISHED DECREMENTING    Y02144 05692300
*                                       DATA MGMT CNT IN UCB(S)  Y02144 05692400
DXATIRB  EQU   X'28'                    IRB (IF ANY) HANDLED     Y02144 05692600
DXATRRQ  EQU   X'2C'                    RELATED REQUEST Q FREED  Y02144 05692700
DXATDEB  EQU   X'30'                    DEB CORE FREED           Y02144 05692800
DXATDEBX EQU   X'34'                    DEB EXTENSION CORE FREED Y02144 05692900
*                                                                Y02144 05693000
DXATOUTA DS    B                        OUTPUT TAPE DATA SET     Y02144 05693100
*                                       STATUS                   Y02144 05693200
DXATVLHD EQU   X'80'                    VOL1 OR HDR LBL WRITTEN  Y02144 05693300
DXATHDTM EQU   X'40'                    TM WRITTEN AFTER HDR LBL Y02144 05693400
DXATDATM EQU   X'20'                    TM WRITTEN AFTER DATA    Y02144 05693500
DXATTRL1 EQU   X'10'                    TRL1 LABEL WRITTEN       Y02144 05693700
DXATTRL2 EQU   X'08'                    TRL2 LABEL WRITTEN       Y02144 05694100
DXATTTM1 EQU   X'04'                    1ST TRAILING TM WRITTEN  Y02144 05694500
DXATTTM2 EQU   X'02'                    2ND TRAILING TM WRITTEN  Y02144 05694900
DXATNSL  EQU   X'01'                    NSL OUTPUT RTN GIVEN CTL Y02144 05695300
*                                                                Y02144 05695700
DXATDACC DS    B                        DIRECT ACCESS D/S STATUS Y02144 05696100
*                                                                Y02144 05696500
DXATF1CE EQU   X'80'                    FMT 1 DSCB REREAD IF     Y02144 05696900
*                                       CLOSE EXECS CALLED EOV   Y02144 05697300
DXATTRAK EQU   X'40'                    LAST TRACK USED & TRACK  Y02144 05697700
*                                       BALANCE FIELDS IN DSCB   Y02144 05698100
*                                       UPDATED FOR OUTPUT PS    Y02144 05698500
*                                       AND PO DATA SETS         Y02144 05698900
DXATDRCT EQU   X'20'                    DIRECTORY COUNT UPDATED  Y02144 05699300
DXATUPDB EQU   X'10'                    UPDATED DSCB WRITTEN     Y02144 05699700
DXATSMF  EQU   X'08'                    SMF RTN GIVEN CONTROL    YM4614 05700100
DXATSMS  EQU   X'04'                    SMS DATA SET TO BE         @14C 05700300
*                                       EXTENDED ON NEXT VOLUME    @14A 05700500
DXATEOF  EQU   X'02'                    EOF MARK WRITTEN: PS D/S Y02144 05700900
DXATRDDB EQU   X'01'                    DSCB READ                Y02144 05701300
*                                                                Y02144 05701700
DXATCOM2 DS    0CL4                     COMMON O/C/E AUDIT INFO  Y02144 05702100
*                                                                Y02144 05702500
DXATEOV  DS    B                        EOV PROCESSING           Y02144 05702900
*                                                                Y02144 05703300
DXATCCAT EQU   X'80'                    CONCATENATION            Y02144 05703700
DXATNVOL EQU   X'40'                    NEW VOLUME               Y02144 05704100
DXATDCHN EQU   X'20'                    DEB DECHAINED            Y02144 05704500
DXATDFRE EQU   X'10'                    DEB CORE FREED           Y02144 05704600
DXATDNEW EQU   X'08'                    NEW DEB CORE GOTTEN      Y02144 05704700
DXATREMT EQU   X'04'                    DEB REMOVED FROM DEB TBL Y02144 05704800
DXATDADM EQU   X'02'                    EOV WENT TO EXTEND       Y02144 05705200
DXATVCAT EQU   X'01'                    EOV WENT TO VSAM CATLG   Y02144 05705300
*                                                                Y02144 05705400
DXATOPEN DS    B                        OPEN PROCESSING          Y02144 05705500
*                                                                Y02144 05705600
DXATIGN  EQU   X'80'                    IGNORE OPTION ACTIVE     Y02144 05708300
DXATMODS EQU   X'40'                    DCB MERGE LOOP STARTED   Y02144 05708400
DXATMODE EQU   X'20'                    DCB MERGE DONE           Y02144 05709000
DXATMODM EQU   X'10'                    DCB MOD MASK IN DEB      Y02144 05709400
*                                       EXTENSION IS VALID       Y02144 05709800
DXATDSIN EQU   X'08'                    DSAB COUNT INCR STARTED  Y02144 05711000
DXATDFIN EQU   X'04'                    DSAB COUNT INCR FINISHED Y02144 05711400
*                                                                Y02144 05711500
DXATALL  DS    B                        COMMON AUDIT FLAGS       YM7099 05712600
*                                                                YM7099 05712800
DXATFC   EQU   X'80'                    PAST PT FOR NORMAL CLOSE YM7099 05713000
*                                       MUST ATTEMPT FORCE CLOSE YM7099 05713200
*                                       ON EOV OR TCLOSE ERROR   YM7099 05713400
DXATSWAP EQU   X'40'                    SYSEVENT OKSWAP INDICATR YM8511 05713600
DXATQUIS EQU   X'20'                    QUIESCE I/O NOT HALT IN    @04A 05713700
*                                       RECOVERY ROUTINES               05713800
DXATQUSD EQU   X'10'                    PURGE QUIESCE ISSUED BY    @04A 05713900
*                                       RECOVERY ROUTINE                05714000
DXATLBLE EQU   X'08'                    TAPE LB ED RTNS RECEIVED   @27A 05714100
*                                       CNTL FOR CURRENTLY MOUNTED @27A 05714200
*                                       VOLUME. NOT USED BY ESTAE  @27A 05714300
DXATSDCK EQU   X'04'                    DEBCHK DELETE STARTED IN   @38A 05714400
*                                       CLOSE PROCESSING           @38A 05714500
*                                       NOTE: DXATDBCK INDICATES   @38A 05714600
*                                       DEBCHK DELETE ENDED IN     @38A 05714700
*                                       CLOSE PROCESSING           @38A 05714800
*              THE FOLLOWING BYTE IS NOT USED BY THE ESTAE            * 05714900
DXCAFFG5 DS    CL1                      CAF FIFTH FLAG             @35C 05715000
DX06READ EQU   X'80'                    DEVICE SUPPORT X'06' READ  @35A 05715100
DXCAFMD3 EQU   X'40'                    3591 STANDARD CARTRIDGE    @35A 05715200
DXCAFMD4 EQU   X'20'                    3591 ENHANCED CARTRIDGE    @35A 05715300
DXCA128T EQU   X'10'                    3591 128TRK RECORDING TECH @35A 05715500
DXBLYSPE EQU   X'08'                    BLYTHE ENABLING PTF ON SYS @35A 05715700
DXAT3591 EQU   X'04'                    TP DRIVE ATTACHED VIA 3590 @35A 05715900
DXCAFMDE EQU   X'02'                    3590 TAPE MEDIUM ERROR     @35A 05716100
*                                       CONTROL UNIT               @35A 05716300
DXTVLPOS EQU   X'01'                    TAPE PREPOSITIONED AT FILE @39A 05716500
*                                       PRIOR TO OPEN              @39A 05716700
DXATCOM3 DS    AL4                      RRPLIST ADDRESS          Y02144 05716900
DXATCOM4 DS    AL4                      CRSA PTR FOR RECOVERY    Y02144 05717400
         SPACE 1                                                 Y02080 05723000
DXATEXC1 DS    0CL4                     EXECUTOR AUDIT TRAIL WD 1  @03C 05723900
DXATEXB1 DS    B                        EXEC. AUDIT TRAIL BYTE 1   @03A 05724800
DXEXHASP EQU   X'80'                    HASP CONTROL IND       @ZA02504 05725900
DXEXTCAM EQU   X'40'                    TCAM CONTROL IND       @ZA41849 05726900
DXATEXB2 DS    B                        EXEC. AUDIT TRAIL BYTE 2   @03A 05727300
DXATCFRE EQU   X'40'                    CICB/ACB HAS BEEN FREED    @03A 05727700
DXATEXB3 DS    B                        EXEC. AUDIT TRAIL BYTE 3   @03A 05728100
DXATEXB4 DS    B                        EXEC. AUDIT TRAIL BYTE 4   @03A 05728500
DXATEXC2 DS    0CL4                     EXECUTOR AUDIT TRAIL WD 2  @03C 05728900
DXATEXB5 DS    B                        EXEC. AUDIT TRAIL BYTE 5   @03A 05729300
DXATEXB6 DS    B                        EXEC. AUDIT TRAIL BYTE 6   @03A 05729700
DXATEXB7 DS    B                        EXEC. AUDIT TRAIL BYTE 7   @03A 05730100
DXATEXB8 DS    B                        EXEC. AUDIT TRAIL BYTE 8   @03A 05730500
         SPACE 1                                                   @L2A 05730900
*******************************************************************@H1A 05731300
*                                                                  @H1A 05731700
*        O/C/E SWA CURRENT JFCB POINTER                            @H1A 05732100
*                                                                  @H1A 05732500
*******************************************************************@H1A 05732900
         SPACE 1                                                   @H1A 05733300
DXJBFPTR DS    A                        CURRENT JFCB POINTER       @L5A 05733700
         SPACE 1                                                   @H1A 05734100
DXCVRBAD DS    A                        CVAF/CP REBUILD WA ADDRESS @L7A 05734500
DXENDCCW DS    A                        POINTER TO LAST CCW        @L7A 05734900
DXUTSW1  DS    BL1                      UTILITY SWITCH 1           @07A 05735300
DXSNSSL  EQU   X'80'                    SL VOLID FROM SENSE        @07A 05735700
DXSNSAL  EQU   X'40'                    AL VOLID FROM SENSE        @07A 05736100
DXRBKSET EQU   X'20'                    SDB REBLOCKABLE BIT SET ON @08A 05736500
*                                       DURING THIS OPEN           @08A 05736900
DXSNSOK  EQU   X'10'                    INSTALLATION ACCEPTS VOLID @09A 05737300
*                                         FROM SENSE DATA          @09A 05737700
DXNOMRK  EQU   X'08'                    NO FORMAT ID MARK DETECTED @09A 05738100
DXCPTREL EQU   X'04'                    CONDITIONAL PARTREL        @11A 05738200
*                                       SPECIFIED FOR EXCP         @11A 05738300
DXRINGOK EQU   X'02'                    OK TO LEAVE NOT WRITE      @12A 05739000
*                                       PROTECTED ON INPUT, TAPE   @12A 05739100
*                                       IS LOGICAL PROTECTED       @12A 05739200
*                                       OR USER HAS UPDATE AUTH    @12A 05739300
DXNSCRCH EQU   X'01'                    UCBNSRCH BIT 'ON' FOR TAPE @18A 05739400
*                                                                  @L9D 05739500
DXCAFFG1 DS    B                        CAF FIRST FLAG             @L9C 05739600
DXCAFMAM EQU   X'80'                    ATL IN MANUAL MODE         @09C 05739700
DXCAFATL EQU   X'40'                    ATL DEVICE                 @L9A 05739800
DXCAFMTL EQU   X'20'                    MTL DEVICE                 @L9A 05740100
DXCAFOUT EQU   X'10'                    CAF O/P PROCESSING         @L9A 05740500
DXCAFMWT EQU   X'08'                    CAF MOUNT WAIT COMPLETED   @L9A 05740900
DXCAFCDE EQU   X'04'                    CAF/MISC IEC502E CODE      @31C 05741300
DXCAFAVR EQU   X'02'                    CAF AVR MOUNTED VOLUME     @L9A 05741700
DXCAFBYP EQU   X'01'                    SMS SSI BYPASS SG ASSIGN   @L9A 05742100
DXCAFFG2 DS    B                        CAF SECOND FLAG            @L9A 05742500
DXCAFNLB EQU   X'80'                    CAF NOT SL/AL LABEL        @L9A 05742900
DXCAFBLK EQU   X'40'                    CAF BLANK TAPE, NO LABEL   @L9A 05743300
DXCAFUNR EQU   X'20'                    CAF UNREADABLE LABEL       @L9A 05743700
DXCAFUND EQU   X'10'                    CAF UNDETERMINE VOL LABEL  @L9A 05744100
DXCAFVER EQU   X'08'                    LACS VERIFY COMPLETED      @P1A 05744500
DXCAFNDE EQU   X'04'                    NO LACS DEMOUNT REQUIRED   @P3A 05744900
DXCAFABD EQU   X'02'                    CAF ABEND INDICATOR        @P5A 05745300
DXCAFVRY EQU   X'01'                    CAF VERIFY RETRY FLAG      @P6A 05745700
DXCAFCKP DS    CL1                      CAF VCR CHECKPOINT         @L9A 05746100
DXCAFTKN DS    F                        CAF LACS TOKEN             @L9A 05746500
DXCAFPRM DS    F                        CAF LACS PARMLIST          @L9A 05746900
DXCAFERC DS    H                        CAF DEMOUNT ERROR CODE     @L9A 05747300
DXCAFVOL DS    CL6                      CAF EXTERNAL VOLUME SERIAL @L9A 05747700
DXCAFRTY DS    H                        CAF ERROR RETRY            @L9A 05748100
DXCAFMOD DS    H                        CAF CATALOG MOD ID         @L9A 05748500
DXCAFRET DS    F                        CAF SERVICE RETURN CODE    @L9A 05748900
DXCAFREA DS    F                        CAF SERVICE REASON CODE    @L9A 05749300
DXCAFERR DS    F                        CAF LACS ERROR PARMLIST    @P6A 05749700
DXCAFFG3 DS    B                        CAF THIRD FLAG             @P7A 05750100
DXCAFNOV EQU   X'80'                    CAF ATL VISION FAILURE     @P7A 05750500
DXCAF18T EQU   X'40'                    CAF/MISC 18TRK CARTRIDGE   @P8A 05750900
DXCAF36T EQU   X'20'                    CAF/MISC 36TRK CARTRIDGE   @10A 05751300
DXCAFMD1 EQU   X'10'                    CAF MEDIA 1 TAPE MOUNTED   @10A 05751700
DXCAFMD2 EQU   X'08'                    CAF MEDIA 2 TAPE MOUNTED   @10A 05752100
DXCAFUNV EQU   X'04'                    CAF UNINITIALIZED SCRATCH  @09A 05752500
DXCAFNOS EQU   X'02'                    CAF EMPTY SCRTCH CATEGORY  @16A 05752600
DXCAFOSM EQU   X'01'                    CAF JFCMEDIA SET BY OPEN   @24A 05752700
DXRMMFLG DS    B                        RMM FLAGS                  @13A 05752800
DXRMMSCR EQU   X'80'                    SCRATCH CHANGED TO SPECIFIC@13A 05752900
DXRMMDES EQU   X'40'                    LABEL EDITOR DESTROY LABEL @13A 05753000
DXRMMSER EQU   X'20'                    VOLUME SERIAL CONFLICT     @13A 05753100
DXRMMCHV EQU   X'10'                    Volume mount exit changed  @17A 05753300
*                                        the requested VOLSER      @17A 05753600
DXRMMCVL EQU   X'08'                    Volume mount exit changed  @17A 05753900
*                                        the VOLSER in label read  @17A 05754200
DXRMME5C EQU   X'04'                    ERA5C TAPE INCOMPATIBLE    @30A 05754400
*                                         TRACK CONFLICT ERROR     @30A 05754600
DXRMMVRJ EQU   X'02'                    VOLUME REJECTED BY LABAN   @33A 05754700
*                                         OR FILEV TAPE EXIT       @33A 05754800
DXRMMEXV EQU   X'01'                    LABAN SUPPLIED VOLSER FOR  @36C 05754900
*                                         NL SCRATCH (NOT ATL/MTL) @34A 05755000
DXUTSW2  DS    BL1                      UTILITY SWITCH 2           @19A 05755100
DXEXSTR  EQU   X'80'                    TELL DADSM A STRIPED D/S   @19A 05755200
*                                       IS EXTENDING TO A NEW VOL  @19A 05755300
DXEXCOM  EQU   X'40'                    TELL DADSM A COMPRESSABLE  @19A 05755400
*                                       D/S IS EXTENDING TO A NEW  @19A 05755600
*                                       VOLUME.                    @19A 05755800
DXBADMRK EQU   X'20'                    INVALID VOLID MARK ON TAPE @20A 05756000
*                                       VOLUME.                    @20A 05756200
DXUCBCKD EQU   X'10'                    ALL UCBS IN TIOT CHECKED   @21A 05756400
DXOJVLSQ EQU   X'08'                    OK TO HAVE VOLUME SEQUENCE @22A 05756600
*                                       NUMBER GREATER THAN 1 FOR  @22A 05756800
*                                       DISP=NEW TAPE DATASET IF   @22A 05757000
*                                       OPENJ AND APPLICATION      @22A 05757200
*                                       PROVIDED A NEW FILE        @22A 05757400
*                                       SEQUENCE NUMBER            @22A 05757600
DXRMMIGN EQU   X'04'                    FILEV SET TEPVIGNORE BIT   @23A 05757800
DXRMMHNR EQU   X'02'                    FILEV SET TEPVHONOR BIT    @23A 05758000
DXXTIOTC EQU   X'01'                    XTIOT COPIED TO 24BIT ADD  @LCA 05758200
DXCAFFG4 DS    BL1                      CAF FLAG 4                 @26C 05758400
DXBYRACD EQU   X'80'                    LABAN OPTED TO SKIP RACDEL @37C 05758500
DXLRCLDF EQU   X'40'                    ACB LRECL WAS SET TO       @32A 05758600
*                                       DEFAULT VALUE              @32A 05758700
DXBLKRMM EQU   X'20'                    RMM/VOLM SUPPLIED BLKID    @LEA 05758800
DXNBLKRM EQU   X'10'                    RMM/VOLM DID NOT SUPPLY    @LEA 05758900
*                                       BLOCKID IN JFCRBIDO        @LEA 05759000
DXLNUM   EQU   X'08'                    SET LNUMBER/ENQ IN PROCESS @26A 05759100
DXSSICLD EQU   X'04'                    SSI NEW VOLUME CHECK       @28A 05759200
*                                        INTERFACE HAS BEEN CALLED @28A 05759300
DXKEYMNT EQU   X'02'                    KEY=MOUNT WTO/WTOR SUPPORT @LXA 05759400
DXRMMSEC EQU   X'01'                    FILEV SET TEPVBYSEC BIT    @29A 05759500
DXUTSW3  DS    BL1                                                 @LZA 05759700
DXRWUNLD EQU   X'80'                    REWIND/UNLOAD ISSUED IN 4J @LZA 05760000
DXEM3490 EQU   X'40'                    BLY2 EMULATING 3490E       @LGA 05760100
DXEM3590 EQU   X'20'                    BLY2 EMULATING 3590        @LGA 05760200
DXBL2ENA EQU   X'10'                    BLYTHE2 ENABLED            @LGA 05760300
DXEXHFS  EQU   X'08'                    TELL DADSM AN HFS D/S IS   @41A 05760400
*                                       EXTENDING TO A NEW VOL     @41A 05760500
DXOCEMNT EQU   X'04'                    OCE ISSUED MNT FOR SMS TP  @42A 05760600
DXNLFS1  EQU   X'02'                    NL TAPE FILE SEQUENCE 1    @LGA 05760700
DXCSWUE  EQU   X'01'                    TAPE MARK READ             @LGA 05760800
DXUTSW4  DS    BL1                                                 @LGA 05760900
DXRMMOKD EQU   X'80'                    LABAN EXIT INDICATES OK TO @LGM 05761000
*                                         DESTROY VOL1 SO BYPASS   @LGM 05761100
*                                         IEC534D                  @LGM 05761200
DXXCTLAL EQU   X'40'                    AL VOL1 TRANSL TO EBCDIC   @LHA 05761300
DXTPLEFT EQU   X'20'                    TAPE DISP IS END OF FILE   @LIA 05761400
DXTPREW  EQU   X'10'                    TAPE DISP IS REWIND        @LIA 05761500
DXBLANK  EQU   X'08'                    BLANK DEGAUSSED TAPE       @44A 05761600
DXMTLREJ EQU   X'04'                    MTL VOL REJECT NL MOUNTED  @LJA 05761606
*                                       SL SPECIFIC REQUESTED      @LJA 05761612
DXDAGSNP EQU   X'02'                    DASD GUARANTEED SPACE      @45A 05761620
*                                       NO PRIMARY INDICATOR       @45A 05761640
DXUTSW5  DS    BL1                                                 @46A 05761710
DXLKAHSM EQU   X'80'                    OPEN DETECTED LOOKAHEAD    @46A 05761720
*                                       MOUNTED SMS TAPE VOLUME    @46A 05761730
         DS    CL1                      RESERVED                   @46C 05761740
DXOCEWAX DS    A                        ADDRESS OF O/C/E WORK AREA @LYA 05761800
*                                        EXTENSION                 @LYA 05761900
         SPACE 1                                                   @H1A 05762000
*                                                                       05762100
**************************************************************** Y02080 05762200
*                                                                       05762300
DSECTSIZ EQU   *-DXLBL                  WORKAREA SIZE            Y02080 05763200
*                                                                       05769400
**************************************************************** Y02080 05775600
*                                                                  @H1A 05776800
*             END OF SYMBOLS GENERATED BY IECDSECT                 @H1A 05778000
*                                                                  @H1A 05779200
****************************************************************   @H1A 05780400
         MEND                                                           05781800
*                                                           @ZA73362C*/ 05831800
*/*                                                              @H1A*/ 05881800
*/* BLOCK COMMENT DESCRIBING THE SIZE OF EACH PORTION OF THE     @H1A*/ 05931800
*/* WORK AREA HAS BEEN MADE COMMON TO BOTH ASSMBLER AND PL/S     @H1A*/ 05981800
*/*                                                              @H1A*/ 06031800
*/*                                                            37@H1D*/ 06081800
*%DSECTL2 : ;                                                  /*@H1C*/ 06131800
*DCL 1 FORCORE BASED(RCORE) BDY(DWORD),                                 07956600
*      2 DXDSCB   CHAR(96),             /* DATA SET CONTROL BLOCK    */ 07958600
*        3 DXLBL    CHAR(80),           /* DATA SET LABEL            */ 07960600
*          5 DSCFMTID CHAR(1),          /* FORMAT IDENTIFIER     @L7A*/ 07962600
*          5 DSCFILSR CHAR(6),          /* FILE SERIAL NUMBER    @L7A*/ 07964600
*          5 DSCVOLSR CHAR(2),          /* VOLUME SEQUENCE #     @L7A*/ 07966600
*          5 DSCCREDT CHAR(3),          /* CREATION DATE         @L7A*/ 07968600
*          5 DSCEXPDT CHAR(3),          /* EXPIRATION DATE       @L7A*/ 07970600
*          5 DSCNOEXT CHAR(1),          /* # OF DATA EXTENTS     @L7A*/ 07972600
*          5 DSCBLDBL CHAR(1),          /* BYTES IN LAST DIR BLK @L7A*/ 07974600
*          5 DSCFLAG1 CHAR(1),          /* FLAG 1                @15C*/ 07976600
*          5 DSCSYSCD CHAR(13),         /* SYSTEM CODE           @L7A*/ 07978600
*          5 DSCREFD  CHAR(3),          /* DATE LAST REFERENCED  @L7A*/ 07980600
*          5 DSCSMSFG CHAR(1),          /*SYSTEM MANAGED STORAGE        07982600
*                                         INDICATORS             @L6A*/ 07984600
*            7 DSCSMSDS BIT(1),         /*SYSTEM MANAGED DATA SET@L6A*/ 07986600
*            7 DSCSMSUC BIT(1),         /*UNCATALOGUED SYSTEM    @L6A   07988600
*                                         MANAGED DATA SET       @L6A*/ 07990600
*            7 DSCREBLK BIT(1),         /*DATA SET MAY BE        @L6A   07992600
*                                         REBLOCKED              @L6A*/ 07994600
*            7 DSCCRSDB BIT(1),         /*DADSM CREATE           @L6A   07996600
*                                         ORIGINATED BLOCKSIZE   @L6A*/ 07998600
*            7 DSCPDSE  BIT(1),         /* DATA SET IS AN PDSE   @L8A*/ 08000600
*            7 DSCSTRP  BIT(1),         /* DATA SET IS STRIPED   @LAA*/ 08002600
*            7 *        BIT(2),         /* RESERVED              @LAC*/ 08004600
*          5 DSCSCEXT   CHAR(3),        /* SECONDARY SPACE EXTEN @L6A*/ 08006600
*            7 DSCSCXTF BIT(8),         /* SECONDARY SPACE EXTEN @L6A   08008600
*                                          FLAGS                 @L6A*/ 08010600
*              9 DSCSCAVB BIT(1),       /* IF 1, DSC1SCXTV IS THE@L6A   08012600
*                                          ORIGINAL AVG BLOCK LEN@L6A*/ 08014600
*              9 DSCSCMB  BIT(1),       /* IF 1, DS1SCXTV IS IN  @L6A   08016600
*                                          MEGABYTES             @L6A*/ 08018600
*              9 DSCSCKB  BIT(1),       /* IF 1, DS1SCXTV IS IN  @L6A   08020600
*                                          KILOBYTES             @L6A*/ 08022600
*              9 DSCSCUB  BIT(1),       /* IF 1, DS1SCXTV IS IN  @L6A   08024600
*                                          BYTES                 @L6A*/ 08026600
*              9 *        BIT(4),       /* RESERVED              @L6A*/ 08028600
*            7 DSCSCXTV FIXED(16) BDY(BYTE), /* SECONDARY EXTEN  @L6A   08030600
*                                               VALUE            @L6A*/ 08032600
*          5 DSCFILTY CHAR(2),          /* FILE TYPE (DSORG)     @L7A*/ 08034600
*            7 *        BIT(6),         /*                       @L7A*/ 08036600
*            7 DSCPART  BIT(1),         /* PARTITIONED DATA SET  @L7A*/ 08038600
*            7 *        BIT(9),         /*                       @L7A*/ 08040600
*          5 DSCRECFM CHAR(1),          /* RECORD FORMAT         @L7A*/ 08042600
*          5 DSCOPTCD CHAR(1),          /* OPTION CODE           @L7A*/ 08044600
*          5 DSCBLKL  CHAR(2),          /* BLOCK LENGTH          @L7A*/ 08046600
*          5 DSCLRECL CHAR(2),          /* RECORD LENGTH         @L7A*/ 08048600
*          5 DSCKEYL  CHAR(1),          /* KEY LENGTH            @L7A*/ 08050600
*          5 DSCRKP   CHAR(2),          /* RELATIVE KEY POSITION @L7A*/ 08052600
*          5 DSCDSIND CHAR(1),          /* DATA SET INDICATORS   @L7A*/ 08054600
*            7 DSCLSTVL BIT(1),         /* LAST VOLUME INDICATOR @L7A*/ 08056600
*            7 *        BIT(7),         /*                       @L7A*/ 08058600
*          5 DSCSCALO CHAR(4),          /* SECONDARY ALLOCATION  @L7A*/ 08060600
*          5 DSCLSTAR CHAR(3),  /*         LAST USED TRK AND BLK @L7A*/ 08064600
*                               /*FOR STRIPED- LOW  ORDER HALF   @LAA*/ 08066600
*                               /*WORD FOR RELATIVE TRACK ADDR   @LAA*/ 08068600
*                               /*OF LAST RECORD WRITTEN IN BYTES@LAA*/ 08070600
*                               /*0 AND 1, BYTE 2 CONTAINS RECORD@LAA*/ 08072600
*                               /*NUMBER ON TRACK. HIGH ORDER    @LAA*/ 08074600
*                               /*HALFWORD TRACK ADDR IN DSCTRBAL@LAA*/ 08076600
*          5 DSCTRBAL CHAR(2),          /* BYTES REMAINING ON    @L7A*/ 08078600
*                                       /*    LAST TRACK USED    @L7A*/ 08080600
*                               /*  FOR STRIPED- HIGH ORDER HALF @LAA*/ 08082600
*                               /*  WORD FOR RELATIVE TRACK ADDR @LAA*/ 08084600
*                               /*  OF LAST RECORD WRITTEN, LOW  @LAA*/ 08086600
*                               /*  ORDER HALF WORD IN DSCLSTAR. @LAA*/ 08088600
*          5 *        CHAR(2),          /* RESERVED              @L7A*/ 08090600
*          5 DSCEXTYP CHAR(1),          /* EXTENT TYPE INDICATOR @L7A*/ 08092600
*          5 DSCEXTSQ CHAR(1),          /* EXTENT SEQUENCE NO.   @L7A*/ 08094600
*          5 DSCLOWLM CHAR(4),          /* LOWER LIMIT           @L7A*/ 08096600
*          5 DSCUPPLM CHAR(4),          /* UPPER LIMIT           @L7A*/ 08098600
*          5 *        CHAR(9),          /*                       @L7A*/ 08100600
*        3 *        CHAR(11),           /*                       @L7A*/ 08102600
*        3 DSCNEXT  CHAR(5),            /* POINTER TO NEXT DSCB  @L7A*/ 08104600
*          4 * CHAR(1),                 /* FILLER                @P9A*/ 08105200
*          4 DXSIMWA PTR(31) BDY(BYTE), /* ADDRESS OF SIMIO W.A. @P9M*/ 08105900
*      2 DSCCORE  PTR(31),              /*CORE ADDRESS OF NEXT DSCB  */ 08106600
*        3 DXVSAMRC CHAR(4),            /*VSAM RETURN CODE    .  @LBA*/ 08121600
*                                                                       08126600
*/*         JOB FILE CONTROL BLOCK AREA (JFCB)                   @H1A*/ 08136600
*                                                                       08146600
*      2 DXJBF    CHAR(176),            /*JOB FILE CONTROL BLOCK     */ 08156600
*                                                                       08169100
*/*         O/C/E INTERNAL EVENT CONTROL BLOCK AREA (ECB)        @H1A*/ 08181600
*                                                                       08194100
*      2 DXECB    CHAR(4),              /*INTERNAL ECB               */ 08206600
*                                                                       08219100
*/*         O/C/E INTERNAL INPUT/OUTPUT BLOCK AREA (IOB)         @H1A*/ 08231600
*                                                                       08244100
*      2 DXIOB    CHAR(32),             /*INTERNAL IOB               */ 08256600
*      2 DXDAADDR CHAR(8) BDY(DWORD),   /*MBBCCHHR               @H1C*/ 08286600
*        3 *        CHAR(4),            /*FILLER               YM8551*/ 08316600
*          4 DXANWA CHAR(4),            /*PTR TO ANSI WORK AREA  @L2A*/ 08318600
*                                                                       08320600
*/*         O/C/E INTERNAL DATA EXTENT BLOCK (DEB)               @H1A*/ 08322600
*                                                                       08324600
*        3 DXDEB    CHAR(4),            /*INTERNAL DEB         YM8551*/ 08326600
*          4 ACCLEN CHAR(1),            /*ACCODE LENGTH          @L2A*/ 08329900
*          4 ACCODE CHAR(1),            /*ACCODE VALUE           @L2A*/ 08333200
*          4 DXVARIUS CHAR(1),          /*MISCELLANEOUS          @L2A*/ 08336500
*            5 DXGMANWA BIT(1),         /*ANWA BEEN GETMAINED    @L2A*/ 08339800
*            5 *        BIT(7),         /*UNUSED                 @L2A*/ 08343100
*                                                                       08346400
*/*         O/C/E INTERNAL DATA CONTROL BLOCK AREA (DCB)         @H1A*/ 08349700
*                                                                       08353000
*      2 DXDCB    CHAR(48) BDY(WORD),   /*INTERNAL DCB               */ 08356600
*        3 *        CHAR(20),           /*FILLER               YM8551*/ 08366600
*        3 DXDEBDCB PTR(31),            /*INTERNAL DCB PTR     YM8551*/ 08376600
*        3 *        CHAR(4),            /*FILLER                 @25C*/ 08396600
*        3 DXDEBUCB PTR(31),            /*INTERNAL PTR TO UCB    @25A*/ 08416600
*        3 *        CHAR(12),           /*FILLER                 @25A*/ 08436600
*        3 DXDCBDEB PTR(31),            /*INTERNAL DCB'S DEB POINTER */ 08456600
*                                                                       08466600
*/*            O/C/E INTERNAL CCWS                                   */ 08506600
*                                                                       08556600
*      2 DXCCW    CHAR(96) BDY(DWORD),  /*CCW AREA                   */ 08606600
*        3 DXCCW1   CHAR(8) BDY(DWORD),                                 08656600
*        3 DXCCW2   CHAR(8) BDY(DWORD),                                 08706600
*        3 DXCCW3   CHAR(8) BDY(DWORD),                                 08756600
*        3 DXCCW4   CHAR(8) BDY(DWORD),                                 08806600
*        3 DXCCW5   CHAR(8) BDY(DWORD),                                 08856600
*        3 DXCCW6   CHAR(8) BDY(DWORD),                                 08906600
*        3 DXCCW7   CHAR(8) BDY(DWORD),                                 08956600
*        3 DXCCW8   CHAR(8) BDY(DWORD),                                 09006600
*        3 DXCCW9   CHAR(8) BDY(DWORD),                                 09056600
*        3 DXCCW10  CHAR(8) BDY(DWORD),                                 09106600
*        3 DXCCW11  CHAR(8) BDY(DWORD),                                 09156600
*        3 DXCCW12  CHAR(8) BDY(DWORD),                                 09206600
*                                                                       09506600
*/*            O/C/E COMMON EXTENDED WORKAREA                        */ 09556600
*                                                                       09606600
*      2 DXOLDVOL CHAR(6),              /* LAST VOL SER - EOV@G32DSMI*/ 09607400
*      2 DXRCFLAG CHAR(1),              /* RACF FLAG BYTE    @G32DSMI*/ 09607500
*        3 DXRCOUT BIT(1),              /* RACF AUTH FOR OUT @G32DSMI*/ 09607600
*        3 DXRCINP BIT(1),              /* RACF AUTH FOR IN  @G32DSMI*/ 09607700
*        3 DXRCDEF BIT(1),              /* RACDEF DELETE     @G32DSMI*/ 09607800
*        3 *       BIT(5),              /* RESERVED          @G32DSMI*/ 09607900
*      2 DXFLAGG1 CHAR(1),              /* FLAG BYTE         @ZA40178*/ 09608000
*        3 DXEX0A01 BIT(1),             /* IFG0EX0A ASKS REREAD OF      09608400
*                                          DSCB NOT FOUND - NEXT NOT    09608800
*                                          FOUND SKIPS EXIT  @G60ASRB*/ 09609200
*        3 DXNRECAT BIT(1),             /* DSN CHANGED...               09609300
*                                          ...DURING OPENJ  @ZA73362A*/ 09609400
*        3 DXRECOVR BIT(1),             /* DCB ABEND EXIT        @LEA   09609500
*                                          RECOVERY ENTERED ONCE @LEA*/ 09609600
*        3 DXEXPDAT BIT(1),             /* SKIP EXPIRATION DATE CHECK   09609700
*                                                                @L1A*/ 09609800
*        3 DXPASSWD BIT(1),             /* SKIP PASSWORD CHECK   @L1A*/ 09609900
*        3 DXLKAHDV BIT(1),             /* TEST FOR LOOK AHEAD VOLSER   09610000
*                                                                @L1A*/ 09610100
*        3 DXF1MMS  BIT(1),             /*MEDIA MANAGER SERVICES @LMA*/ 09610200
*        3 DXF1MSIX BIT(1),             /*MMS INDEX CONNECT      @LMA*/ 09610300
*      2 DXXCTL   CHAR(8),              /*TRANSFER CONTROL AREA      */ 09610400
*      2 DXWORK   CHAR(4),              /*WORK FIELD                 */ 09610600
*      2 DXWORK1  CHAR(4),              /*WORK FIELD                 */ 09611000
*      2 DXWORK2  CHAR(4),              /*WORK FIELD                 */ 09616300
*      2 DXWORK3  CHAR(4),              /*WORK FIELD                 */ 09616400
*      2 DXWORK4  CHAR(4),              /*WORK FIELD                 */ 09616500
*      2 DXVOLSR CHAR(18),              /*VOLUME SERIAL NUMBERS      */ 09616600
*        3 DXVOLSR1 CHAR(6),            /*VOLUME TO BE DISMOUNTED    */ 09636600
*          4 DXVOLMT1 CHAR(6),          /*VOLUME TO BE DISMOUNTED    */ 09646600
*        3 DXVOLSR2 CHAR(6),            /*VOLUME TO BE MOUNTED       */ 09648600
*          4 DXVOLMT2 CHAR(6),          /*VOLUME TO BE MOUNTED       */ 09649000
*        3 DXVOLSR3 CHAR(6),            /*LOOK AHEAD MOUNT VOLUME    */ 09650600
*          4 DXVOLMT3 CHAR(6),          /*LOOK AHEAD MOUNT VOLUME    */ 09652600
*      2 DXVOLSEQ FIXED(15),            /*VOLUME SEQUENCE NUMBER     */ 09654600
*      2 DXNOUNIT FIXED(15),            /*NO. UNITS ALLOCATED        */ 09655000
*      2 DXUNITOF FIXED(15),            /*OFFSET TO CURRENT UNIT     */ 09705000
*      2 DXRESSW  CHAR(1),              /*RESIDENT ROUTINE INDICATOR */ 10006600
*      2 DXWKEYSV CHAR(1),              /*SAVED KEY OF IECRES CALL   */ 10016600
*      2 DXUKEY   CHAR(1),              /*CALLER'S KEY               */ 10036600
*      2 DXEXTSW  CHAR(1),              /*DADSM EXTEND SWITCH        */ 10086600
*                                                                       10186600
*/*            O/C/E PROTECTED CONTROL BLOCK POINTERS AREA           */ 10236600
*                                                                       10286600
*      2 DXASCBAD PTR(31),              /*ASCB ADDRESS               */ 10336600
*      2 DXTCBADR PTR(31),              /*TCB ADDRESS                */ 10386600
*      2 DXJSCBAD PTR(31),              /*ACTIVE JSCB ADDRESS        */ 10436600
*      2 DXDSABQD PTR(31),              /*DSAB QDB ADDRESS           */ 10486600
*      2 DXDSABAD PTR(31),              /*FIRST DSAB ADDRESS         */ 10536600
*      2 DXDSAB   PTR(31),              /*CURRENT DSAB ADDRESS       */ 10546600
*      2 DXDEBXAD PTR(31),              /*DEB EXTENSION ADDRESS      */ 10586600
*      2 DXTIOTAD PTR(31),              /*CURRENT TIOT ENTRY ADDRESS */ 10636600
*      2 DXUCBADR PTR(31),              /*UCB ADDRESS                */ 10686600
*      2 DXUCBSAV PTR(31),              /*SAVED UCB ADDRESS          */ 10696600
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10716600
*        3 DXUCBSVV PTR(24),            /*SAVED UCB ADDRESS    YM6525*/ 10720600
*                                                                       10736600
*/*            USER DCB COPY POINTERS AREA                           */ 10786600
*                                                                       10836600
*      2 DXUDCBAD PTR(31),              /*POINTER TO CALLER'S DCB    */ 10886600
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10906600
*        3 DXUACBAD PTR(24),            /*USER ADDR OF ACB/DCB YM6525*/ 10926600
*      2 DXPDCBAD PTR(31),              /*POINTER TO COPIED DCB      */ 10986600
*        3 * CHAR(1),                   /*FLAG BYTE            YM6525*/ 10990600
*        3 DXPACBAD PTR(24),            /*COPY ADDR OF ACB/DCB YM6525*/ 10994600
*      2 DXUDCBPL FIXED(15),            /*LENGTH OF USER DCB PREFIX  */ 10996600
*      2 DXUDCBML FIXED(15),            /*LENGTH OF MOVED DCB        */ 11006600
*      2 DXPRPARC PTR(31),              /*SAVED PARM LIST POINTER    */ 11036600
*                                                                       11136600
*/*            O/C/E ACCESS METHOD AREA                          @H1A*/ 11153200
*                                                                       11169800
*      2 DXMSGADR PTR(31),              /*POINTER TO MSG CSECT       */ 11186600
*                                                                       11236600
*/*            RECOVERY ROUTINE DCB AUDIT TRAIL AREA                 */ 11286600
*                                                                       11336600
*      2 DXATCOM1        CHAR(4),       /*COMMON O/C/E AUDIT TRAIL   */ 11386600
*        3 DXATGENS      CHAR(1),       /*GENERAL STATUS             */ 11386700
*          4 DXATDMCT    BIT(1),        /*DATA MGMT CNT INCREMENTED  */ 11386800
*          4 DXATREFR    BIT(1),        /*ON,DON'T COPY DCB    YM1275*/ 11386900
*          4 DXATDISP    BIT(1),        /*VOLUME DISP PERFORMED      */ 11387000
*          4 DXATJFCB    BIT(1),        /*JFCB READ OK               */ 11387100
*          4 DXATVGIV    BIT(3),        /*A.M. STRING/CI GIVEN CONTRL*/ 11387200
*            5 DXATVSMG  BIT(1),        /*VSAM STRING GIVEN CONTROL  */ 11387300
*            5 DXATVTMG  BIT(1),        /*VTAM STRING GIVEN CONTROL  */ 11387400
*            5 DXATVCIG  BIT(1),        /*ISAM-VSAM CI GIVEN CONTROL */ 11387500
*          4 DXATSRET    BIT(1),        /*A.M. STRING RETURNED CONTRL*/ 11387600
*        3 DXATCLOS      FIXED(8),      /*CLOSE FINAL PROCESSING     */ 11387800
*        3 DXATOUTA      CHAR(1),       /*OUTPUT TAPE D/S STATUS     */ 11387900
*          4 DXATVLHD    BIT(1),        /*VOL1 OR HDR LABEL WRITTEN  */ 11388000
*          4 DXATHDTM    BIT(1),        /*TM WRITTEN AFTER HDR LABELS*/ 11388100
*          4 DXATDATM    BIT(1),        /*TM WRITTEN AFTER DATA      */ 11388200
*          4 DXATTRL1    BIT(1),        /*TRL1 LABEL WRITTEN         */ 11388300
*          4 DXATTRL2    BIT(1),        /*TRL2 LABEL WRITTEN         */ 11388400
*          4 DXATTTM1    BIT(1),        /*FIRST TRAILING TM WRITTEN  */ 11388500
*          4 DXATTTM2    BIT(1),        /*SECOND TRAILING TM WRITTEN */ 11388600
*          4 DXATNSL     BIT(1),        /*NSL OUTPUT RTN GIVEN CONTRL*/ 11388700
*        3 DXATDACC      CHAR(1),       /*DIRECT ACCESS D/S STATUS   */ 11388900
*          4 DXATF1CE    BIT(1),        /*FMT 1 DSCB REREAD IF CLOSE    11389000
*                                         EXECUTORS CALLED EOV       */ 11389100
*          4 DXATTRAK    BIT(1),        /*LAST TRACK USED AND TRACK     11389200
*                                         BALANCE FIELDS IN DSCB        11389300
*                                         UPDATED FOR OUTPUT PS AND     11389400
*                                         PO DATA SETS               */ 11389500
*          4 DXATDRCT    BIT(1),        /*DIRECTORY COUNT UPDATED FOR   11389600
*                                         BPAM DATA SET              */ 11389700
*          4 DXATUPDB    BIT(1),        /*UPDATED DSCB WRITTEN       */ 11389900
*          4 DXATSMF     BIT(1),        /*SMF RTN GIVEN CONTRL YM4614*/ 11390000
*          4 *           BIT(1),        /*RESERVED             YM4614*/ 11390100
*          4 DXATEOF     BIT(1),        /*EOF MARK WRITTEN FOR PS DS */ 11390200
*          4 DXATRDDB    BIT(1),        /*DSCB READ                  */ 11390300
*      2 DXATCOM2        CHAR(4),       /*COMMON O/C/E AUDIT TRAIL   */ 11436600
*        3 DXATEOV       CHAR(1),       /*EOV PROCESSING             */ 11436700
*          4 DXATCCAT    BIT(1),        /*CONCATENATION              */ 11436800
*          4 DXATNVOL    BIT(1),        /*NEW VOLUME                 */ 11436900
*          4 DXATDCHN    BIT(1),        /*DEB DECHAINED              */ 11437000
*          4 DXATDFRE    BIT(1),        /*DEB CORE FREED             */ 11437100
*          4 DXATDNEW    BIT(1),        /*NEW DEB CORE GOTTEN        */ 11437200
*          4 DXATREMT    BIT(1),        /*DEB REMOVED FROM DEB TBL   */ 11437300
*          4 DXATDADM    BIT(1),        /*EOV WENT TO EXTEND         */ 11437500
*          4 DXATVCAT    BIT(1),        /*EOV WENT TO VSAM CATLG 550Y*/ 11437600
*        3 DXATOPEN      CHAR(1),       /*OPEN PROCESSING            */ 11438000
*          4 DXATIGN     BIT(1),        /*IGNORE OPTION ACTIVE       */ 11438200
*          4 DXATMODS    BIT(1),        /*DCB MERGE LOOP STARTED     */ 11438300
*          4 DXATMODE    BIT(1),        /*DCB MERGE DONE             */ 11438700
*          4 DXATMODM    BIT(1),        /*DEBX DCB MOD MASK IS VALID */ 11438800
*          4 DXATDSIN    BIT(1),        /*DSAB COUNT INCR STARTED    */ 11439000
*          4 DXATDFIN    BIT(1),        /*DSAB COUNT INCR FINISHED   */ 11439400
*          4 *           BIT(2),        /*RESERVED                   */ 11439500
*        3 DXATALL       CHAR(1),       /*COMMON AUDIT FLAGS   YM7099*/ 11440000
*          4 DXATFC      BIT(1),        /*PAST POINT FOR NORMAL CLOSE-- 11441000
*                                         MUST ATTEMPT FORCE CLOSE ON   11441200
*                                         EOV OR TCLOSE ERROR  YM7099*/ 11441700
*          4 DXATSWAP    BIT(1),        /*SYSEVENT OKSWAP IND  YM8511*/ 11441900
*          4 DXATQUIS    BIT(1),        /*QUIESCE I/O NOT HALT IN  @04A 11444900
*                                         RECOVERY ROUTINES          */ 11447900
*          4 DXATQUSD    BIT(1),        /*PURGE QUIESCE ISSUED BY  @04A 11450900
*                                         RECOVERY ROUTINE           */ 11453900
*          4 DXATLBLE    BIT(1),        /*TP LB ED RTNS RECEIVED @27A   11454900
*                                         CONTROL FOR CURRENTLY  @27A   11455900
*                                         MOUNTED VOLUME. NOT    @27A   11456900
*                                         NOT USED BY ESTAE      @27A*/ 11457900
*          4 DXATSDCK    BIT(1),     /*DEBCHK DELETE STARTED IN  @38A   11458400
*                                        CLOSE PROCESSING        @38A   11458900
*                                      NOTE: DXATDBCK INDICATES  @38A   11459400
*                                        DEBCHK DELETE ENDED IN  @38A   11459900
*                                        CLOSE PROCESSING        @38A*/ 11460400
*          4 *           BIT(2),        /*RESERVED               @38C*/ 11460900
*                                       /*DXCAFFG5 NOT USED ESTAE@35A*/ 11461400
*        3 DXCAFFG5      BIT(8),    /* CAF FLAG 5                @35A*/ 11463900
*          4 DX06READ    BIT(1),    /* DEVICE SUPPORT X'06' READ @35A*/ 11466400
*          4 DXCAFMD3    BIT(1),    /* 3591 STANDARD CARTRIDGE   @35A*/ 11468900
*          4 DXCAFMD4    BIT(1),    /* 3591 ENHANCED CARTRIDGE   @35A*/ 11471400
*          4 DXCA128T    BIT(1),    /* 3591 128TRK RECORD TECH   @35A*/ 11473900
*          4 DXBLYSPE    BIT(1),    /* BLYTHE ENABLING PTF ON SYS@35A*/ 11476400
*          4 DXAT3591    BIT(1),    /* SELECTED DR IS 3590-1     @35A*/ 11478900
*          4 DXCAFMDE    BIT(1),    /* 3590 TAPE MEDIUM ERROR    @39A*/ 11480800
*          4 DXTVLPOS    BIT(1),    /* TAPE PREPOSITIONED AT FILE@39A   11482700
*                                      PRIOR TO OPEN             @39A*/ 11484600
*      2 DXATCOM3        PTR(31),       /*RRPLIST ADDRESS            */ 11486600
*      2 DXATCOM4        PTR(31),       /*CRSA PTR USED BY RECOVERY  */ 11536600
*                                                                       11586600
*      2 DXATEXC1        CHAR(4),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11636600
*        3 DXATEXB1      BIT(8),        /*A.M. AUDIT TRAIL BYTE1 @03C*/ 11640400
*          4 DXEXHASP    BIT(1),        /*HASP IN CONTROL    @ZA02504*/ 11644200
*          4 DXEXTCAM    BIT(1),        /*TCAM IN CONTROL    @ZAAPISP*/ 11648000
*          4 *           BIT(6),        /*A.M. RESERVED BIT(S)   @03A*/ 11651800
*        3 DXATEXB2      BIT(8),        /*A.M. AUDIT TRAIL BYTE2 @03A*/ 11655600
*          4 *           BIT(1),        /*A.M. RESERVED BIT(S)   @03A*/ 11659400
*          4 DXATCFRE    BIT(1),        /*A.M. CICB/ACB FREED    @03A*/ 11663200
*          4 *           BIT(6),        /*A.M. RESERVED BIT(S)   @03A*/ 11667000
*        3 DXATEXB3      BIT(8),        /*A.M. AUDIT TRAIL BYTE3 @03A*/ 11670800
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11674600
*        3 DXATEXB4      BIT(8),        /*A.M. AUDIT TRAIL BYTE4 @03A*/ 11678400
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11682200
*      2 DXATEXC2        CHAR(4),       /*A.M. EXECUTOR AUDIT TRAIL  */ 11686600
*        3 DXATEXB5      BIT(8),        /*A.M. AUDIT TRAIL BYTE5 @03C*/ 11686700
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11686800
*        3 DXATEXB6      BIT(8),        /*A.M. AUDIT TRAIL BYTE6 @03A*/ 11686900
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11687000
*        3 DXATEXB7      BIT(8),        /*A.M. AUDIT TRAIL BYTE7 @03A*/ 11687100
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11687200
*        3 DXATEXB8      BIT(8),        /*A.M. AUDIT TRAIL BYTE8 @03A*/ 11687300
*          4 *           BIT(8),        /*A.M. RESERVED BIT(S)   @03A*/ 11687400
*/*                                                              @H1A*/ 11687500
*/*      O/C/E SWA CURRENT JFCB POINTER                          @H1A*/ 11687600
*/*                                                              @H1A*/ 11687700
*      2 DXJBFPTR        PTR(31),       /*CURRENT JFCB POINTER @L5A  */ 11687800
*      2 DXCVRBAD        PTR(31),       /*CVAF/CP RBUILD WA ADDR @L7A*/ 11687900
*      2 DXENDCCW        PTR(31),       /*CPRBL LAST CCW ADDR    @L7A*/ 11688000
*      2 DXUTSW1         CHAR(1),       /*UTILITY SWITCHES       @07A*/ 11688100
*        3 DXSNSSL       BIT(1),        /*SL VOLID FROM SENSE    @07A*/ 11688200
*        3 DXSNSAL       BIT(1),        /*AL VOLID FROM SENSE    @07A*/ 11688300
*        3 DXRBKSET      BIT(1),        /*SDB REBLOCKABLE BIT SET ON    11688400
*                                         DURING THIS OPEN       @08A*/ 11688500
*        3 DXSNSOK       BIT(1),        /*INSTALLATION ACCEPTS   @09A*/ 11688600
*/*                                       VOLID FROM SENSE DATA  @09A*/ 11688700
*        3 DXNOMRK       BIT(1),        /*NO FMTID DETECTED      @09A*/ 11688800
*        3 DXCPTREL      BIT(1),        /*CONDITIONAL PARTREL SPECIFIED 11688900
*                                         FOR EXCP               @11A*/ 11689000
*        3 DXRINGOK      BIT(1),        /*OK TO LEAVE NOT WRITE         11689100
*                                         PROTECTED ON INPUT, TAPE IS   11689200
*                                         EITHER LOGICAL PROTECTED OR   11689300
*                                         USER HAS UPDATE AUTH   @12A*/ 11689400
*        3 DXNSCRCH      BIT(1),        /*UCBNSRCH BIT 'ON' FOR         11689500
*                                         TAPE                   @18C*/ 11689600
*/*                                                              @L9D*/ 11689700
*                                                                       11689800
*      2 DXCAFFG1        BIT(8),        /*CAF FIRST FLAG         @L9C*/ 11689900
*        3 DXCAFMAM      BIT(1),        /*ATL IN MANUAL MODE     @09C*/ 11690000
*        3 DXCAFATL      BIT(1),        /*ATL DEVICE             @L9A*/ 11690100
*        3 DXCAFMTL      BIT(1),        /*MTL DEVICE             @L9A*/ 11690200
*        3 DXCAFOUT      BIT(1),        /*CAF O/P PROCESSING     @L9A*/ 11690300
*        3 DXCAFMWT      BIT(1),        /*CAF MOUNT WAIT COMPLTED@L9A*/ 11690400
*        3 DXCAFCDE      BIT(1),        /*CAF/MISC IEC502E CODE  @31C*/ 11690500
*        3 DXCAFAVR      BIT(1),        /*CAF AVR MOUNTED VOLUME @L9A*/ 11690600
*        3 DXCAFBYP      BIT(1),        /*BYPASS SG ASSIGN       @L9A*/ 11690700
*      2 DXCAFFG2        BIT(8),        /*CAF SECOND FLAG        @L9A*/ 11690800
*        3 DXCAFNLB      BIT(1),        /*CAF NOT SL/AL LABEL    @L9A*/ 11690900
*        3 DXCAFBLK      BIT(1),        /*CAF BLANK TAPE/NO LBL  @L9A*/ 11691000
*        3 DXCAFUNR      BIT(1),        /*CAF UNREADABLE LABEL   @L9A*/ 11691100
*        3 DXCAFUND      BIT(1),        /*CAF UNDETERMINE VOL LBL@L9A*/ 11691200
*        3 DXCAFVER      BIT(1),        /*LACS VERIFY COMPLETED  @P1A*/ 11691300
*        3 DXCAFNDE      BIT(1),        /*LACS NO DEMOUNT REQUR'D@P3A*/ 11691400
*        3 DXCAFABD      BIT(1),        /*CAF ABEND INDICATOR    @P5A*/ 11691500
*        3 DXCAFVRY      BIT(1),        /*CAF VERIFY RETRY FLAG  @P6A*/ 11691600
*      2 DXCAFCKP        CHAR(1),       /*CAF TVR CHPT INDICATOR @L9A*/ 11691700
*      2 DXCAFTKN        CHAR(4),       /*CAF LACS TOKEN         @L9A*/ 11691800
*      2 DXCAFPRM        PTR(31),       /*CAF LACS PARMLIST      @L9A*/ 11691900
*      2 DXCAFERC        CHAR(2),       /*CAF DEMOUNT ERROR CODE @L9A*/ 11692000
*      2 DXCAFVOL        CHAR(6),       /*EOV CURRENT VOL SERIAL @L9A*/ 11692100
*      2 DXCAFRTY        FIXED(15),     /*CAF ERROR RETRY CNTR   @L9A*/ 11692200
*      2 DXCAFMOD        CHAR(2),       /*CAF CATALOG MOD ID     @L9A*/ 11692300
*      2 DXCAFRET        FIXED(31),     /*CAF SERVICE RETURN CODE@L9A*/ 11692400
*      2 DXCAFREA        FIXED(31),     /*CAF SERVICE REASON CODE@L9A*/ 11692500
*      2 DXCAFERR        FIXED(31),     /*CAF LACS ERROR PARMLIST@P6A*/ 11692600
*      2 DXCAFFG3        BIT(8),        /*CAF THIRD FLAG         @P7A*/ 11692700
*        3 DXCAFNOV      BIT(1),        /*CAF ATL VISION FAILURE @P7A*/ 11692800
*        3 DXCAF18T      BIT(1),        /*CAF/MISC 18TRK CART    @P8A*/ 11692900
*        3 DXCAF36T      BIT(1),        /*CAF/MISC 36TRK CART    @10A*/ 11693000
*        3 DXCAFMD1      BIT(1),        /*CAF MEDIA 1 TAPE       @10A*/ 11693100
*        3 DXCAFMD2      BIT(1),        /*CAF MEDIA 2 TAPE       @10A*/ 11693200
*        3 DXCAFUNV      BIT(1),        /*CAF UNINITIALIZED SCRTH@09A*/ 11693300
*        3 DXCAFNOS      BIT(1),        /*CAF EMPTY SCRTCH CATGRY@16A*/ 11693400
*        3 DXCAFOSM      BIT(1),        /*CAF JFCMEDIA SET B/OPEN@24C*/ 11693600
*      2 DXRMMFLG        BIT(8),    /* RMM FLAGS                 @13A*/ 11693800
*        3 DXRMMSCR      BIT(1),    /* SCRATCH CHANGED TO SPEC   @13A*/ 11694300
*        3 DXRMMDES      BIT(1),    /* LABEL EDITOR DESTROY LABEL@13A*/ 11694800
*        3 DXRMMSER      BIT(1),    /* VOLUME SERIAL CONFLICT    @13A*/ 11695300
*        3 DXRMMCHV      BIT(1),    /* Volume mount exit changed        11695400
*                                        the requested VOLSER    @17A*/ 11695500
*        3 DXRMMCVL      BIT(1),    /* Volume mount exit changed        11695600
*                                        the VOLSER in label read@17A*/ 11695700
*        3 DXRMME5C      BIT(1),    /* ERA5C TAPE INCOMPATIBLE   @30A   11695800
*                                        TRACK CONFLICT ERROR    @30A*/ 11695900
*        3 DXRMMVRJ      BIT(1),    /* VOLUME REJECTED BY LABAN  @33A   11696000
*                                        OR FILEV TAPE EXIT      @33A*/ 11696100
*        3 DXRMMEXV      BIT(1),    /* LABAN EXIT SUPPLIED VOLSER@36C   11696200
*                                        FOR NL SCR (NOT ATL/MTL)@34A*/ 11696300
*      2 DXUTSW2         BIT(8),    /* UTILITY SWITCHES 2        @19A*/ 11696500
*        3 DXEXSTR       BIT(1),    /* TELL DADSM A STRIPED D/S IS      11696600
*                                       EXTENDING TO A NEW VOL   @19A*/ 11696700
*        3 DXEXCOM       BIT(1),    /* TELL DADSM A COMPRESSED D/S IS   11696800
*                                       EXTENDING TO A NEW VOL   @19A*/ 11696900
*        3 DXBADMRK      BIT(1),    /* INVALID VOLID MARK ON TAPE       11697000
*                                      VOLUME                    @20A*/ 11697100
*        3 DXUCBCKD      BIT(1),    /* ALL TIOT UCBS CHECKED     @21A*/ 11697200
*        3 DXOJVLSQ      BIT(1),    /* OK TO HAVE VOLUME SEQUENCE       11697300
*                                      NUMBER GREATER THAN 1 FOR        11697400
*                                      DISP=NEW TAPE DATASET IF         11697500
*                                      OPENJ                     @22A*/ 11697600
*        3 DXRMMIGN      BIT(1),    /* TEPVIGNORE SET BY FILEV   @23A*/ 11697700
*        3 DXRMMHNR      BIT(1),    /* TEPVHONOR SET BY FILEV    @23A*/ 11697800
*        3 DXXTIOTC      BIT(1),    /* XTIOT COPIED TO 24BIT ADD @LCA*/ 11697900
*      2 DXCAFFG4        BIT(8),    /* CAF FLAG 4                @26C*/ 11702900
*        3 DXBYRACD      BIT(1),    /* LABAN OPTED TO SKIP RACDEL@37C*/ 11707900
*        3 DXLRCLDF      BIT(1),    /* ACB LRECL SET TO DEFAULT         11712900
*                                      VALUE                     @32A*/ 11717900
*        3 DXBLKRMM      BIT(1),    /* RMM/VOLM SUPPLIED BLOCKID @LEA*/ 11720400
*        3 DXNBLKRM      BIT(1),    /* RMM/VOLM DID NOT SUPPLY   @LEC   11722900
*                                      BLOCKID IN JFCRBIDO       @LEA*/ 11725400
*        3 DXLNUM        BIT(1),    /* LNUMBER/ENQ IN PROCESS    @26A*/ 11727900
*        3 DXSSICLD      BIT(1),    /* SSI NEW VOLUME CHANGE            11729500
*                                       INTERFACE HAS BEEN CALLED@28A*/ 11731100
*        3 DXKEYMNT      BIT(1),    /* KEY=MOUNT WTO/WTOR SUPPORT@LXA*/ 11732900
*        3 DXRMMSEC      BIT(1),    /* TEPVBYSEC SET BY FILEV    @29A*/ 11737900
*      2 DXUTSW3         BIT(8),    /*                           @LZA*/ 11738300
*        3 DXRWUNLD      BIT(1),    /* REWIND/UNLD ISSUED IN 4J  @LZA*/ 11738700
*        3 DXEM3490      BIT(1),    /* BLYTHE2 EMULATING 3490E   @LGA*/ 11738800
*        3 DXEM3590      BIT(1),    /* BLYTHE2 EMULATING 3590    @LGA*/ 11738900
*        3 DXBL2ENA      BIT(1),    /* BLYTHE 2 ENALBED          @LGA*/ 11739000
*        3 DXEXHFS       BIT(1),    /* TELL DADSM AN HFS D/S IS         11739200
*                                      EXTENDING TO A NEW VOL    @41A*/ 11739300
*        3 DXOCEMNT      BIT(1),    /* OCE ISSUED MNT FOR SMS TP @42C*/ 11739400
*        3 DXNLFS1       BIT(1),    /* NL TAPE FILE SEQUENCE 1   @LGA*/ 11739500
*        3 DXCSWUE       BIT(1),    /* TAPE MARK READ            @LGA*/ 11739600
*      2 DXUTSW4         BIT(8),    /*                           @LGA*/ 11739700
*        3 DXRMMOKD      BIT(1),    /* LABAN EXIT INDICATES OK   @LGM*/ 11739800
*                                   /* TO DESTROY VOL1 SO BYPASS @LGM*/ 11739900
*                                   /* IEC534D                   @LGM*/ 11740000
*        3 DXXCTLAL      BIT(1),    /* AL VOL1 TRANSL TO EBCDIC  @LHA*/ 11740200
*        3 DXTPLEFT      BIT(1),    /* TAPE DISP IS END OF FILE  @LIA*/ 11740400
*        3 DXTPREW       BIT(1),    /* TAPE DISP IS REWIND       @LIA*/ 11740600
*        3 DXBLANK       BIT(1),    /* BLANK DEGAUSSED TAPE      @44A*/ 11740700
*        3 DXMTLREJ      BIT(1),    /* MTL VOL REJECT NL MOUNTED @LJA   11740850
*                                       SL SPECIFIC REQUESTED    @LJA*/ 11740860
*        3 DXDAGSNP      BIT(1),    /* DASD GUAR SP NO PRIMARY   @45A*/ 11740880
*        3 RESERVED      BIT(1),    /*                           @45A*/ 11740950
*      2 DXUTSW5         BIT(8),    /*                           @46A*/ 11740980
*        3 DXLKAHSM      BIT(1),    /* OPEN DETECTED LOOKAHEAD   @46A*/ 11741010
*                                   /* MOUNTED SMS VOLUME        @46A*/ 11741040
*      2 *               CHAR(1),   /* RESERVED                  @46C*/ 11741070
*      2 DXOCEWAX        PTR(31),   /* ADDRESS OF O/C/E WORK AREA       11741200
*                                       EXTENSION                @LYA*/ 11741500
*      2 DSECTSIZ CHAR(0) BDY(WORD);    /*END OF IECDSECT            */ 11742900
*/*                                                              @LYA*/ 11752200
*/*      O/C/E WORK AREA EXTENSION                               @LYA*/ 11761500
*/*                                                              @LYA*/ 11770800
*        %INCLUDE SYSLIB(IFGWAX);   /* OCE WORK AREA EXTENSION   @LYA*/ 11780100
*/*                                                              @LYA*/ 11789400
*/*      DATA SET LABELS (REMAPPINGS OF DXLBL)                   @H1A*/ 11798700
*/*                                                              @H1A*/ 11823700
*/*                                                              @H1A*/ 11848700
*   DECLARE                                                    /*@H1A*/ 11898700
*     1    VOLAREA  DEFINED(DXLBL), /* VOLUME LABEL AREA         @H1A*/ 11948700
*      2    VOLLABI  CHAR(3),       /* LABEL IDENTIFIER          @H1A*/ 11998700
*      2    VOLNO    CHAR(1),       /* VOLUME LABEL NUMBER       @H1A*/ 12048700
*      2    VOLSERNO CHAR(6),       /* VOLUME SERIAL NUMBER      @H1A*/ 12098700
*      2    VOLSEC   CHAR(1),       /* VOLUME SECURITY           @H1A*/ 12148700
*      2    *        CHAR(10),      /* RESERVED                  @H1A*/ 12198700
*       3   VOLVTOC  CHAR(5),       /*                           @H1A*/ 12248700
*       3   *        CHAR(5),       /*                           @H1A*/ 12298700
*      2    *        CHAR(14),      /* RESERVED                  @H1A*/ 12348700
*      2    VOLTRTCH CHAR(2),       /* TAPE RECORDING TECHNIQUE  @H1A*/ 12398700
*      2    AVOLOWNR CHAR(14),      /* ANSI OWNER IDENTIFICATION @H1A*/ 12448700
*                                   /* IBM LABELS USE THE        @H1A*/ 12498700
*                                   /*     FOLLOWING MAPPING:    @H1A*/ 12548700
*       3   *        CHAR(4),       /* -RESERVED                 @H1A*/ 12598700
*       3   VOLOWNER CHAR(10),      /* -OWNER NAME AND ADDR CODE @H1A*/ 12648700
*      2    *        CHAR(29),      /* RESERVED IN IBM LABELS    @H1A*/ 12698700
*                                   /* ANSI LABELS USE THE       @H1A*/ 12748700
*                                   /*     FOLLOWING MAPPING:    @H1A*/ 12798700
*       3    *        CHAR(28),     /* -RESERVED                 @H1A*/ 12848700
*       3    LABSTAND CHAR(1);      /* -LABEL STANDARD LEVEL     @H1A*/ 12898700
*/*                                                              @H1A*/ 12948700
*   DECLARE                                                    /*@H1A*/ 12998700
*     VOLCMPAC CHAR(1) CONSTANT('P'); /*    COMPACTION RECORDING @H1A*/ 13048700
*/*                                                              @H1A*/ 13098700
*   DECLARE                                                    /*@H1A*/ 13148700
*     1    FL1AREA  DEFINED(DXLBL), /* FILE LABEL 1 AREA         @H1A*/ 13198700
*      2    FL1LABI  CHAR(3),       /* LABEL IDENTIFIER          @H1A*/ 13248700
*      2    FL1NO    CHAR(1),       /* FILE LABEL NUMBER         @H1A*/ 13298700
*      2    FL1ID    CHAR(17),      /* FILE IDENTIFIER           @H1A*/ 13348700
*      2    FL1FILSR CHAR(6),       /* FILE SERIAL NUMBER        @H1A*/ 13398700
*      2    FL1VOLSQ CHAR(4),       /* VOLUME SEQUENCE NUMBER    @H1A*/ 13448700
*      2    FL1FILSQ CHAR(4),       /* FILE SEQUENCE NUMBER      @H1A*/ 13498700
*      2    FL1GNO   CHAR(4),       /* GENERATION NUMBER         @H1A*/ 13548700
*      2    FL1VNG   CHAR(2),       /* VERSION NUMBER            @H1A*/ 13598700
*      2    FL1CREDT CHAR(6),       /* CREATION DATE             @H1A*/ 13648700
*      2    FL1EXPDT CHAR(6),       /* EXPIRATION DATE           @H1A*/ 13698700
*      2    FL1FSEC  CHAR(1),       /* FILE SECURITY INDICATOR   @H1A*/ 13748700
*      2    FL1BLKCT CHAR(6),       /* BLOCK COUNT               @H1A*/ 13798700
*      2    FL1SYSCD CHAR(13),      /* SYSTEM CODE               @H1A*/ 13848700
*      2    FL1RES   CHAR(3),       /* RESERVED                  @06C*/ 13898700
*       3    *        CHAR(1),      /*                           @H1A*/ 13948700
*       3    FL1RES1  CHAR(2),      /*                           @06C*/ 13998700
*      2    FL1BLKHI CHAR(4);       /* HIGH ORDER BLOCK COUNT    @06A*/ 14048700
*/*                                                              @H1A*/ 14098700
*   DECLARE                                                    /*@H1A*/ 14148700
*     1    FL2AREA  DEFINED(DXLBL), /* FILE LABEL 2 AREA         @H1A*/ 14198700
*      2    FL2LABI  CHAR(3),       /* LABEL IDENTIFIER          @H1A*/ 14248700
*      2    FL2NO    CHAR(1),       /* FILE LABEL NUMBER         @H1A*/ 14298700
*      2    FL2RECFM CHAR(1),       /* RECORD FORMAT             @H1A*/ 14348700
*      2    FL2BLKL  CHAR(5),       /* BLOCK LENGTH              @H1A*/ 14398700
*      2    FL2LRECL CHAR(5),       /* RECORD LENGTH             @H1A*/ 14448700
*      2    FL2DEN   CHAR(1),       /* DENSITY                   @H1A*/ 14498700
*      2    FL2FILP  CHAR(1),       /* FILE POSITION             @H1A*/ 14548700
*      2    FL2JSID  CHAR(17),      /* JOB/STEP IDENTIFICATION   @H1A*/ 14598700
*       3    FL2JOBD  CHAR(8),      /* JOB IDENTIFICATION        @H1A*/ 14648700
*       3    FL2JSSP  CHAR(1),      /* SLASH                     @H1A*/ 14698700
*       3    FL2STEPD CHAR(8),      /* STEP IDENTIFICATION       @H1A*/ 14748700
*      2    FL2TRTCH CHAR(2),       /* TAPE RECORDING TECHNIQUE  @H1A*/ 14798700
*      2    FL2CNTRL CHAR(1),       /* CARRIAGE CONTRL CHARACTER @H1A*/ 14848700
*      2    *        CHAR(1),       /* RESERVED                  @H1A*/ 14898700
*      2    FL2BLKA  CHAR(1),       /* BLOCK ATTRIBUTE           @H1A*/ 14948700
*      2    FL2RES1  CHAR(8),       /*                           @LDA*/ 14990300
*       3    *        CHAR(1),      /*                           @LDA*/ 15031900
*       3    FL2DRID  CHAR(7),      /* TAPE DRIVE ID             @LDA*/ 15073500
*        4    *        CHAR(1),     /* RESERVED                  @LDA*/ 15115100
*        4    FL2ID    CHAR(6),     /* ID OF CREATING DRIVE      @LDA*/ 15156700
*      2    FL2DSIND CHAR(1),       /* DATA SET INDICATOR        @H1A*/ 15198700
*      2    FL2RES   CHAR(32),      /* RESERVED IN IBM LABELS    @H1A*/ 15248700
*                                   /* ANSI LABELS USE THE       @H1A*/ 15298700
*                                   /*     FOLLOWING MAPPING:    @H1A*/ 15348700
*       3    *        CHAR(2),      /* -RESERVED                 @H1A*/ 15398700
*       3    FL2BUFOF CHAR(2),      /* -BUFFER OFFSET            @H1A*/ 15448700
*       3    *        CHAR(28),     /* -RESERVED                 @LFC*/ 15459100
*                                   /* IBM LABELS USE THE        @LFA*/ 15469500
*                                   /*     FOLLOWING MAPPING:    @LFA*/ 15479900
*        4    *        CHAR(18),    /* -RESERVED                 @LFA*/ 15490300
*        4    FL2LBLKL CHAR(10);    /* -LBI LARGE BLOCK LENGTH   @LFA*/ 15500700
*/*                                                              @H1A*/ 15511200
*   DECLARE FL2CCSID CHAR(5) DEFINED(FL2RES1); /* ANSI V4 CCSID  @LDA*/ 15523700
*                                              /* TRANSLATION    @LDA*/ 15536200
*/*                                                              @H1A*/ 15548700
*   DECLARE                 /* 7-TRACK TAPE RECORDING TECHNIQUE  @H1A*/ 15598700
*     FL2CNVRS CHAR(1) CONSTANT('C'), /*    7-TRACK CONVERSION   @H1A*/ 15648700
*     FL2XLATE CHAR(1) CONSTANT('T'), /*    7-TRACK TRANSLATION  @H1A*/ 15698700
*     FL2EVENP CHAR(1) CONSTANT('E'); /*    7-TRACK EVEN PARITY  @H1A*/ 15748700
*/*                                                              @H1A*/ 15798700
*   DECLARE                 /*   3480X TAPE RECORDING TECHNIQUE  @H1A*/ 15848700
*     FL2CMPAC CHAR(1) CONSTANT('P'); /*    COMPACTION RECORDING @H1A*/ 15898700
*/*                                                              @H1A*/ 15948700
*   DECLARE                 /*   DATA SET INDICATORS             @H1A*/ 15998700
*     FL2CKDS  CHAR(1) CONSTANT('C'); /*    CHECKPOINT DATA SET  @H1A*/ 16048700
*/*                                                              @H1A*/ 16098700
*/* ************************************************************ @H1A*/ 16148700
*/*                                                              @H1A*/ 16198700
*/*           END OF SYMBOLS GENERATED BY IECDSECT               @H1A*/ 16248700
*/*                                                              @H1A*/ 16298700
*/* ************************************************************ @H1A*/ 16348700
