*%GOTO PLSDCE1;                    /* BILINGUAL MACRO                   00000100
         MACRO                                                          00000200
&LABEL   IECDDCE                                                        00000300
         SPACE 1                                                     */ 00039300
*%PLSDCE1:;                                                             00078300
*/**** START OF SPECIFICATIONS ***************************************/ 00117300
*/*                                                                  */ 00156300
*/* $MAC(IECDDCE):     UCB DASD EXTENSION MAPPING MACRO - BILINGUAL  */ 00195300
*/*                                                                  */ 00234300
*/* DESCRIPTIVE-NAME = UCB DASD CLASS EXTENSION                      */ 00273300
*/*                                                                  */ 00312300
*/*PROPRIETARY V3 STATEMENT                                          */ 00340100
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00367900
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00395700
*/*5695-DF1                                                          */ 00423500
*/*(C) COPYRIGHT 1983,1994  IBM CORP.                                */ 00451300
*/*END PROPRIETARY V3 STATEMENT                                      */ 00479100
*/*                                                                  */ 00507300
*/* STATUS: DF/SMS 1.3.0                                         @H9A*/ 00546300
*/*                                                                  */ 00585300
*/* FUNCTION = THIS MACRO MAPS THE UCB DASD CLASS EXTENSION (DCE)    */ 00624300
*/*                                                                  */ 00663300
*/* NOTES = NONE                                                     */ 00702300
*/*                                                                  */ 00741300
*/* PATCH-LABEL = NOT APPLICABLE                                     */ 00780300
*/*                                                                  */ 00819300
*/* MODULE-TYPE = MACRO                                              */ 00858300
*/*                                                                  */ 00897300
*/*   PROCESSOR = PLS OR BAL                                         */ 00936300
*/*                                                                  */ 00975300
*/*   ATTRIBUTES = MAPPING MACRO                                     */ 01014300
*/*                                                                  */ 01053300
*/* ENTRY-POINT = IECDDCE                                            */ 01092300
*/*                                                                  */ 01131300
*/*   PURPOSE = SEE FUNCTION ABOVE.                                  */ 01170300
*/*                                                                  */ 01209300
*/*   LINKAGE = PLS -  INCLUDE IECDDCE                               */ 01248300
*/*             BAL -  LABEL   IECDDCE                               */ 01287300
*/*                                                                  */ 01326300
*/*   INPUT   = PLS - NONE                                           */ 01365300
*/*             BAL - 'LABEL' WILL CAUSE A LABEL DSECT STATEMENT     */ 01404300
*/*                   INSTEAD OF 'DCE' DSECT STATEMENT.              */ 01443300
*/*                                                                  */ 01482300
*/*   OUTPUT = DCE EXPANSION.                                        */ 01521300
*/*                                                                  */ 01560300
*/* EXIT-NORMAL = END OR MEND STATEMENT                              */ 01599300
*/*                                                                  */ 01638300
*/* EXIT-ERROR = NONE                                                */ 01677300
*/*                                                                  */ 01716300
*/* EXTERNAL-REFERENCES = N/A                                        */ 01755300
*/*                                                                  */ 01794300
*/* TABLES = NONE                                                    */ 01833300
*/*                                                                  */ 01872300
*/* MACROS = NONE                                                    */ 01911300
*/*                                                                  */ 01950300
*/*CHANGE-ACTIVITY =                                                 */ 01989300
*/*$H1=3380SMB,JDM1136,T800475,STLFS: DEVICE SUPPORT                 */ 02028300
*/*$H2=3380M11,JDP1110,T820724,STLGMD:  PAGING DEVICE                */ 02067300
*/*$H3=3380M13,JDP1110,T820760,STLHGM: DEVICE SUPPORT                */ 02106300
*/*$H4=CACHE,JDP1111,,STLRDB: CACHE DEVICE SUPPORT                   */ 02145300
*/*$01=OZ82110,UZ76176,,STLRJF: GENERIC DEVICE SUPPORT           @01A*/ 02179400
*/*$02=OZ90735,UZ90451,,STLRJF: DEVICE SERVICE EXIT SPE          @02A*/ 02213500
*/*$03=OY03902,,STLRDB:         NO ALTERNATE CYLINDER BIT        @03A*/ 02247600
*/*$04=HDP2210,,STLJAH:         3380 J AND K SUPPORT             @04A*/ 02281700
*/*$05=JDP2231,,STLRDB:         SUBSYSTEM SUPPORT                @05A*/ 02315800
*/*$06=JDP2231,,STLRDB:         THRESHOLD SUPPORT                @06A*/ 02349900
*/*$07=JDP2232,,STLJAH:         3990-3 LONG BUSY SUPPORT         @07A*/ 02367000
*/*$08=JDP2232,,STLJAH:         RESET ALLEGIANCE SUPPORT         @08A*/ 02384100
*/*$09=HDP3310,,STLJAH:         DPCT POINTER                     @09A*/ 02401200
*/*$10=HDP3310,,C/TKNH:         SQA EXHSUSTION ON START PENDING  @10A*/ 02409700
*/*$11=OY26590,HDP3320,C/TKNH:  DEFINE NEW BIT, DCEUCBRR         @11A*/ 02413900
*/*    OY28310,HDP3320,C/TKNH: ADD HOLD FOR PATCH 1142               */ 02416000
*/*$12=HDP3330,SJPLJAH:         DEFINE BITS DCENSMB, DCEASYNC    @12A*/ 02417100
*/*                             AND DCELRE                       @12A*/ 02417500
*/*    OY37628,HDP3330,SJPLJAH: OY37718 COMPATIBILITY                */ 02417900
*/*$H5=HDP4410,SJPLJAH:         T0 COPY SUPPORT                  @H5A*/ 02418100
*/*$13=OY49456,HDP3330,SJPLJAH: DEFINE NEW FLAG DCECMB           @13A*/ 02418200
*/*$H6=EUREKA ,JDZ1110,SJPLJAH: ADD ALTERNATE CYL                @H6A*/ 02431200
*/*$L1=DCME,JDZ1110,SJPLLRU: NEWS FLAGS FOR CACHE/DFW/CFW ACTIVE @L1A*/ 02437700
*/*$H7=STRIPING,JDZ1110,SJPLJAH: DEFINE FLAG FOR ESCON ATTACH    @H7A*/ 02440900
*/*$14=OY63202,JDZ1110,SJPLJAH: NEW FUNCTIONS                    @14A*/ 02441800
*/*$15=OW00335,JDZ1110,SJPLRDB: STOP RECURSIVE UCBUDE PACK CHANGE@15A*/ 02442700
*/*$16=OW00364,HDZ11B0,SJPLSYW: RECORD LEVEL ACCESS              @16A*/ 02443600
*/*$17=OW05063,HDZ11B0,SJPLSYW: ADD DCELSA                       @17A*/ 02443700
*/*$H8=OW08878,HDZ11B0,SJPLSYW: XRC/PPRC SUPPORT                 @H8A*/ 02443800
*/*$H9=SEASTAR,HDZ11C0,SJPLSYW: SEASTAR SUPPORT                  @H9A*/ 02443900
*/*$18=OW16665,HDZ11C0,SJPLSYW: REMOVE DCEPID, DCELSA, DCECAPAC  @18A*/ 02444000
*/*$19=XXXXXXX,HDZ11D0,SJPLJAH: ADD REAL DEVICE AND CU ID        @19A*/ 02444100
*/*$20=OW20930,HDZ11C0,SJPLHGS: DCME IMPROVEMENTS                @20A*/ 02448500
*/*$21=OW25547,HDZ11C0,SJPLHGS: PREVENT MIH LOOP                 @21A*/ 02449900
*/*$22=OW28059,HDZ11D0,SJPLJBC: VERSIONING SUPPORT               @22A*/ 02450600
*/*$23=OW34114,HDZ11D0,SJPLJAH: ADD DCEXTIME FLAG                @23A*/ 02450700
*/*                                                                  */ 02450800
*/*$HA=SHARK  ,HDZ11E0,SJPLJBC: SHARK SUPPORT, EXPAND DCE        @HAA*/ 02451000
*/*$24=OW36111,HDZ11E0,SJPLJBC: CCWS & VOL INSTANT IMAGE         @HAA*/ 02451900
*/*$25=OW36529,HDZ11E0,SJPLHGS: PREVENT MULTIPLE UCBUDE I/O REQ  @25A*/ 02452400
*/*$26=OW35912,HDZ11E0,SJPLHGS: CORRECT COMMENT IDENTIFIER       @26A*/ 02452600
*/*$HB=OW38833,HDZ11E0,SJPLJBC: SHARK LSA EXTENSIONS             @HBA*/ 02452700
*/*$27=OW41169,HDZ11E0,SJPLJBC: VM DISK - DOES NOT SUPPORT PAVS  @27A*/ 02453600
*/*                             PREVENT SELFD IO IN SIO EXIT     @28A*/ 02454500
*/*                             WHEN LONG BUSY/DEV BLOCKING      @28A*/ 02455400
*/*$29=OW43250,HDZ11E0,SJPLJBC: DEV IO DID NOT START OR COMPLETE @29A*/ 02455600
*/*                             DUE TO TIMEOUT WHEN IOSXTIME     @29A*/ 02455800
*/*                             WAS USED                         @29A*/ 02456000
*/*$HC=OW44955,HDZ11F0,SJPLJBC: 3990-2 WITH CACHE FLAG           @HCA*/ 02456090
*/*$30=OW45620,HDZ11F0,SJPLHGS: LONG BUSY SUPPORT                @30A*/ 02456180
*/*$31=OW47009,HDZ11F0,SJPLHGS: HELP PREVENT UCBNRY BEING LEFT   @31A*/ 02456190
*/*                             ON BECAUSE SCI OCCURS BEFORE     @31A*/ 02456200
*/*                             END OF SENSE TURNS ON UCBNRY.    @31A*/ 02456210
*/*$32=OW46936,HDZ11F0,SJPLJBC: INVALIDATED VIB FLAG             @32A*/ 02456230
*/*$33=OW50808,HDZ11F0,SJPLHGS: DCESQC RESERVE CNT NOW IN DCE    @33A*/ 02456250
*/** END OF SPECIFICATIONS *******************************************/ 02456300
*%GOTO PLSDCE; /*                                                       02457300
         LCLC  &L                      DEFINE LOCAL CHAR VARIABLE       02500600
&L       SETC  'DCE'                                                    02550600
         AIF   ('&LABEL' EQ '').DSECT                                   02600600
&L       SETC  '&LABEL'                                                 02650600
.DSECT   ANOP                                                           02700600
&L       DSECT -                       UCB DASD CLASS EXTENSION         03000600
DCELEN   DS    B -                     LENGTH OF DCE IN BYTES           03050600
DCEFLAG1 DS    B -                     DCE FLAG BYTE 1                  03100600
DCECVGTF EQU   X'80' -                   CVAF GTF ACTIVE                03150600
DCEVFEAT EQU   X'40' -                 FEATURE BITS VALID          @H1A 03175500
DCEVALFS EQU   X'20' -                 DEVICE FIELDS VALID         @01A 03188000
DCENOALT EQU   X'10' -                 NO ALTERNATE CYLINDERS      @03A 03192200
DCECUVAL EQU   X'08' -                 CONTROL UNIT ID PRESENT     @04A 03196400
DCELBUSY EQU   X'04' -                 LONG BUSY INDICATION        @07A 03197800
DCELBNRY EQU   X'02' -                 MIH REDRIVE FLAG            @07A 03199200
DCEMIMIH EQU   X'01' -                 MINIMUM MIH                 @H8C 03199900
DCEFLAG2 DS    B -                     DCE FLAG BYTE 2 - RESERVED       03200600
DCEVALSS EQU   X'80'                   SUBSYSTEM VALID             @10A 03208900
DCESSDPX EQU   X'40'                   DUPLEX DEVICE               @10A 03217200
DCESSPRI EQU   X'20'                   DUPLEX PRIMARY DEVICE       @10A 03225500
DCESSSEC EQU   X'10'                   DUPLEX SECONDARY DEVICE     @10A 03233800
DCEPACK  EQU   X'08'                   PACK CHANGE IN PROCESS      @10A 03242100
DCEUCBRR EQU   X'04'                   DEVICE SYSGENNED SHARED     @11A 03246300
DCEPACKS EQU   X'02'                   COMPARE SWAP BIT            @21C 03247900
*        EQU   X'01'                                               @18C 03249500
DCEFLAG3 DS    B -                     DCE FLAG BYTE 3 - RESERVED       03250600
DCENSMB  EQU   X'80'                   GAP SYCHRONOUS              @12A 03263100
DCELRE   EQU   X'40'                   LR EXTENDED CCW SUPPORTED   @12A 03275600
DCEASYNC EQU   X'20'                   ASYCHRONOUS                 @12A 03288100
DCEBKUP  EQU   X'10'                   T0 COPY SUPPORTED           @H5A 03294300
DCECMB   EQU   X'08'                   DCE UPDATE IN PROGRESS      @13A 03297400
DCEESCON EQU   X'04'                   ATTACHED TO ESCON CHANNEL   @H7A 03299000
DCEALTV  EQU   X'02'                   DCEALCYL VALID              @H6A 03299800
DCEOKRLC EQU   X'01'                   RECORD LEVEL CACHE VALID    @16A 03300200
DCEVIB   DS    A -                     VTOC INFORMATION BLOCK PTR       03300600
DCEVVDS  DS    A -                     PTR TO VVDS OPEN BLOCK      @H9C 03350600
DCEVSB   DS    A                       PTR TO VOLUME STATISTICS    @20C 03400600
DCEFEATS DS    0XL2                    SENSE ID FEATURE BITS       @H1A 03450600
DCEFEAT1 DS    BL1                     SENSE ID BYTE 3             @H1A 03453700
*                                      CKD EXTENSIONS-REFERENCE         03456800
*                                      DCENECKD,DCEDEFEX,DCEDEFLR       03459900
DCENECKD EQU   X'00'                   00XX,XXXX= CKD EXTENSIONS NOT    03463000
*                                      IMPLEMENTED                 @H1A 03466100
DCEDEFLR EQU   X'C0'                   11XX,XXXX= DEFINE EXTENT, LOCATE 03469200
*                                      RECORD AND RELATED TRANSFER      03472300
*                                      COMMANDS IMPLEMENTED        @H1A 03475400
*                                      IMPLEMENTED                 @H1A 03478500
DCERSVD1 EQU   X'80'                   10XX,XXXX=RSVD FOR EXT      @H1A 03481600
DCEDEFEX EQU   X'40'                   01XX,XXXX=DEF EXT ONLY      @H1A 03484700
DCEPAGES EQU   X'20'                   XX1X,XXXX=SUPPORTS NEW PAGING   X03486700
                                       CCWS                        @H2C 03488700
DCECACHE EQU   X'10'                   CACHING DEVICE              @H4C 03489700
DCEMODEL EQU   X'0F'                   DEVICE ID FROM SENSE IO TYPE@H4A 03490700
DCEFEAT2 DS    BL1                     DEVICE IDENTIFIERS          @H3C 03491900
DCEDEV00 EQU   X'00'                   0000,XXXX = DEVICE TYPE 0   @H3A 03492900
DCEDEV01 EQU   X'10'                   0001,XXXX = 3380 SHERIFF    @H3A 03493900
DCEDEV02 EQU   X'20'                   0010,XXXX = DEVICE TYPE 2   @H3A 03494900
DCEDEV03 EQU   X'30'                   0011,XXXX = DEVICE TYPE 3   @H3A 03495900
DCEDCT   DS    0XL6                    DEVICE CHARACTERISTICS      @02A 03496100
DCEUDCYL DS    H                       NUMBER OF DATA+ALT CYL      @01A 03496300
DCEHICYL DS    H                       HI SEEK ADDRESS             @01A 03496500
DCEMDRDT DS    B  -                    MDR DEVICE TYPE CODE        @01A 03496700
DCEOBRDT DS    B  -                    OBR DEVICE TYPE CODE BYTE 4 @01A 03496900
DCECUID  DS    B                       CONTROL UNIT ID             @04A 03497000
*                                                                  @L1A 03497100
****************************************************************** @L1A 03497200
*   THE FOLLOWING BITS DEFINED FOR DCEXFEAT INDICATE THAT THE      @L1A 03497300
*   DEVICE IS CAPABLE OF THE FEATURE, NOT THAT THE FEATURE IS      @L1A 03497400
*   CURRENTLY ACTIVE ON THE DEVICE.  ANOTHER BYTE, DCEACTFE,       @L1A 03497500
*   HAS BEEN DEFINED BELOW THAT WILL INDICATE IF THE RELEVANT      @L1A 03497600
*   FEATURE IS CURRENTLY ACTIVE ON THE DEVICE.                     @L1A 03497700
*                                                                  @L1A 03497800
*   NOTE THAT:                                                     @L1A 03497900
*                                                                  @L1A 03498000
*     DCENRD REFERS TO CACHE FAST WRITE,                           @L1A 03498100
*     DCETCACH REFERS TO REGULAR CACHING, AND                      @L1A 03498200
*     DCEFSTWT REFERS TO DASD FAST WRITE.                          @L1A 03498300
*                                                                  @L1A 03498400
****************************************************************** @L1A 03498500
*                                                                  @L1A 03498600
DCEXFEAT DS    B                       RDC BYTE 9                  @04A 03498700
DCENRD   EQU   X'80'                   0-NON-RETENTIVE DATA        @04A 03498800
DCELINKS EQU   X'40'                   1-LINKS                     @04A 03498900
DCEMORAN EQU   X'20'                   2-MORAN FEATURE             @16C 03499000
DCETCACH EQU   X'10'                   3-TRACK CACHING             @04A 03499100
DCEDCOPY EQU   X'08'                   4-DUAL COPY                 @04A 03499200
DCEFSTWT EQU   X'04'                   5-FAST WRITE                @04A 03499300
DCERSTA  EQU   X'02'                   6-RESET ALLEGIENCE          @08A 03499400
DCE32SNS EQU   X'01'                   7-32 SENSE BYTES            @04A 03499500
DCEFLAG5 DS    BL1                     DCE FLAG BYTE 5             @HBC 03499600
DCEMIHIW EQU   X'10'                   UCBMIHIW DETECTED           @30A 03499610
DCEMIHMI EQU   X'08'                   UCBMIHMI DETECTED           @30A 03499620
DCEST85  EQU   X'04'                   UNSOL STATUS X'85'          @31C 03499625
DCEVIBIV EQU   X'02'                   INVALIDATED VIB             @32A 03499630
DCETPCAC EQU   X'01'                   TRANSPARENT CACHE           @HCA 03499640
DCEMIHCT DS    BL1                     MIH COUNTER                 @07C 03499700
*                                      EXTEND DCE LENGTH           @06A 03500700
DCECNTRS DS    CL4                     THRESHOLD COUNTERS          @06A 03501400
DCEDPCT  DS    A -                     DPTC POINTER                @09A 03502100
*                                                                  @L1A 03502200
****************************************************************** @L1A 03502300
*                                                                  @L1A 03502400
*   THE FOLLOWING BITS DEFINED FOR DCEACTFE INDICATE WHETHER       @L1A 03502500
*   THE INDICATED FEATURE IS ACTIVE ON THE DEVICE.  THE FEATURES   @L1A 03502600
*   OF INTEREST FOR THIS LINE ITEM ARE:                            @L1A 03502700
*                                                                  @L1A 03502800
*                  REGULAR CACHING -  DECACACH                     @L1A 03502900
*                  DASD FAST WRITE -  DCEAFWRT                     @L1A 03503000
*                  CACHE FAST WRITE - DCEANRD                      @L1A 03503100
*                                                                  @L1A 03503200
*   NOTE THAT 'NON-RETENTIVE DATA' (AKA, CACHE FAST WRITE) IS      @L1A 03503300
*   ACTUALLY ONLY DEFINED AT THE SUB-SYSTEM LEVEL.  THAT BIT IS    @L1A 03503400
*   IS BEING DEFINED AND USED HERE TO MEAN THE SAME THING THAT     @L1A 03503500
*   DCENRD MEANS.  THE REDUNDANCY IS BEING ALLOWED TO AVOID        @L1A 03503600
*   CHANGING THE WAY DCENRD IS CURRENTLY BEING SET.                @L1A 03503700
*                                                                  @L1A 03503800
*      CURRENTLY DCENRD IS BEING INITIALIZED IN IECDINIT.  A       @L1A 03503900
*      READ SUB-SYSTEM DATA IS DONE AND THE APPROPRIATE BYTE IN    @L1A 03504000
*      THE RETURNED DATA IS COPIED INTO DCEXFEAT.  NO LOGIC IS     @L1A 03504100
*      APPLIED TO THE SETTING OF THE BITS.  WHILE IT IS NOT        @L1A 03504200
*      LIKELY THAT THE BITS SETTINGS RETURNED IN THE RSSD (OR      @L1A 03504300
*      THE SNSS, FOR THAT MATTER) ARE BEING SET IN A WAY           @L1A 03504400
*      INCONSISTENT WITH THE LOGIC BEING APPLIED TO THE SETTINGS   @L1A 03504500
*      OF THESE NEW BITS IN IECCINIT, IT IS POSSIBLE.  TO AVOID    @L1A 03504600
*      THE POTENTIAL INCONSISTENCY (AND POSSIBLE DEPENDENCY) ON    @L1A 03504700
*      THE OLD BIT SETTINGS VS NEW BIT SETTINGS, WE HAVE OPTED TO  @L1A 03504800
*      DEFINE THE REDUNDANT DCEANRD.                               @L1A 03504900
*                                                                  @L1A 03505000
*   THE BITS ARE DEFINED IN THE SAME RELATIVE POSITION IN THIS     @L1A 03505100
*   BYTE AS THEY ARE IN DCEXFEAT ABOVE.                            @L1A 03505200
*                                                                  @L1A 03505300
*   THESE BITS ARE SET BY IECCINIT WHEN ENTERED FOR NIP, VARY      @L1A 03505400
*   OR WHEN A PACK CHANGE OCCURS THAT GENERATES AN UNSOLICITED     @L1A 03505500
*   INTERRUPT TO AOM.                                              @L1A 03505600
*                                                                       03505800
*   NOTE: THE BITS DEFINED FOR DCESYSFE AND DCEFLV0 DO NOT              03505900
*         NECESSARILY EQUATE TO BITS IN RDC DATA.  ON SOME              03506000
*         DEVICES, THE PRESENCE OF A PARTICULAR FEATURE IS              03506100
*         INDICATED BY THE "VALUE" OF A STRING OF BITS RATHER           03506200
*         THAN THE SETTING OF A SINGLE BIT.  IECDINIT AND               03506300
*         IECCINIT PROVIDE THE LOGIC FOR MAPPING RDC VALUES             03506400
*         INTO BITS IN THIS UCB CONTROL BLOCK.                          03506500
*                                                                  @L1A 03506600
****************************************************************** @L1A 03506700
*                                                                  @L1A 03506800
DCEACTFE DS    B                       FEATURE ACTIVE BYTE         @L1A 03506900
DCEANRD  EQU   X'80'                   CACHE FAST WRITE            @L1A 03507000
DCEACAM  EQU   X'40'                   CAMPUS DUAL COPY ACTIVE     @H8A 03507100
DCEACCC  EQU   X'20'                   CCC ACTIVE ON DEVICE        @H8A 03507200
DCEACACH EQU   X'10'                   TRACK CACHING               @L1A 03507300
DCEAFWRT EQU   X'04'                   DASD FAST WRITE             @L1A 03507400
*                                                                  @L1A 03507500
DCEALCYL DS    CL1                     NUMBER OF ALTERNATE CYL     @H6A 03507600
DCESYSFE DS    BL1                     SYSTEM FEATURES             @14A 03507700
DCECONTA EQU   X'80'                   CONTINUOUS AVAILABILITY     @14A 03507800
DCEEXFMT EQU   X'40'                   EXTENDED FEATURES           @14A 03507900
DCESCMPR EQU   X'20'                   SOFTWARE COMPRESSION        @14A 03508000
DCESPLIT EQU   X'10'                   SPLIT CE/DE                 @14A 03508100
DCEIOPRI EQU   X'08'                   IOQ PRIORITY QUEUNIG        @H9A 03508200
DCEXTIME EQU   X'04'                   USE IOS XTIME               @23A 03508300
DCEUDELB EQU   X'02'                   LONG BUSY/DEV BLOCKING UDE  @28A 03508400
DCEXTIMF EQU   X'01'                   IO FAILED WITH XTIME        @29C 03508500
DCEFLV0  DS    BL1                     FUNCTIONAL LEVEL            @HAC 03508600
DCEDPT   EQU   X'80'                   DEFECTIVE PRIM TRK          @H8A 03508700
DCERDTRK EQU   X'40'                   READ TRACK                  @HAC 03508800
DCECCC   EQU   X'20'                   CCC SUPPORTED               @H8A 03508900
DCST     EQU   X'10'                   STRIPING/COMP ON OEMI       @H8A 03509000
DCEPFX   EQU   X'08'                   PREFIX CMD SUPPORTED        @H8A 03509100
DCECAM   EQU   X'04'                   CAMPUS DUAL COPY            @H8A 03509200
DCEVOLII EQU   X'02'                   VOL INSTANT IMAGE           @HAA 03509300
DCEVERS  EQU   X'01'                   DEV SUPPORTS VERSIONING     @22C 03509400
DCECCA   DS    X                       CHANNEL CONNECTION ADDRESS  @H8A 03509500
*                                                                  @H9A 03509600
DCERCUID DS    B                       REAL CU ID                  @19C 03509700
DCERDVID DS    B                       REAL DEVICE ID              @19C 03509800
DCEFLAG4 DS    B                       DCE FLAG BYTE 4             @21A 03509900
DCEUDE   EQU   X'80'                   REMEMBER UDE PROCESSING     @21A 03510000
DCEUDEMI EQU   X'40'                   REMEMBER MIH OCCURED        @21A 03510100
DCEUDEPK EQU   X'20'                   UDE FROM PACK CHANGE        @21A 03510200
DCERTRD  EQU   X'10'                   READ TRACK DATA CCW SUPPTD  @HAA 03510300
DCEWTRK  EQU   X'08'                   WRITE FULL TRACK CCW SUPPTD @HAA 03510400
DCEWTRD  EQU   X'04'                   WRITE TRACK DATA CCW SUPPTD @HAA 03510500
DCELRERS EQU   X'02'                   LOCATE RECORD ERASE         @HAA 03510600
DCEPPQ   EQU   X'01'                   AOMPPQ IN PROGRESS          @25A 03510700
DCESSCTI DS    BL2                     SUBSYSTEM TABLE INDEX       @HAM 03510800
DCEFLAG7 DS    B                       DCE FLAG BYTE 7=RDCBYTE7    @HAA 03510900
DCEPRSTG EQU   X'80'                   PRESTAGE TRACKSET           @HAA 03511000
DCENSPAV EQU   X'40'                   DOES NOT SUPPORT PAV (VM)   @27A 03511100
DCERESV3 DS    CL3                     RESERVED                    @33C 03511210
DCESQC   DS    CL2                     REAL UCBSQC COUNT           @33A 03511220
DCERESV4 DS    CL4                     RESERVED                    @33A 03511230
*                                                                       03511300
DCEUCBEX EQU   X'18'                   OFFSET INTO THE COMMON UCB       03511400
*                                      EXTENSION OF THE FULLWORD WHICH  03511500
*                                      CONTAINS THE DCE ADDRESS (THE    03511600
*                                      EXTENSION IS POINTED TO BY       03511700
*                                      UCBEXTPT)                        03511800
DCECVTCV EQU   X'0C'                   OFFSET INTO THE OS/VS COMMON     03511900
*                                      EXTENSION TO THE CVT OF THE      03512000
*                                      FULLWORD WHICH CONTAINS THE      03512100
*                                      POINTER TO THE CVAF TABLE (THE   03512700
*                                      EXTENSION IS POINTED TO BY       03513700
*                                      CVTEXT1)                         03514700
D3380J   EQU   X'21'                   3380 MODEL J                @04A 03516400
D3380K   EQU   X'23'                   3380 MODEL K                @04A 03533500
         MEND                                                           03550600
**********************************************************************/ 03600600
*%PLSDCE:;                                                              03650600
* DECLARE                                                               03700600
*  1 DCE BASED(UCBCLEXT) BDY(WORD), /* UCB DASD CLASS EXTENSION      */ 03750600
*   2 DCELEN    FIXED(8),          /* LENGTH OF DCE IN BYTES         */ 03800600
*   2 DCEFLAG1    BIT(8),          /* DCE FLAG BYTE 1                */ 03850600
*    3 DCECVGTF   BIT(1),          /* CVAF GTF ACTIVE                */ 03900600
*    3 DCEVFEAT   BIT(1),          /* FEATURE BITS VALID         @H1A*/ 03950600
*    3 DCEVALFS   BIT(1),          /* DEV CHARACTERISTICS VALID  @02A*/ 03980600
*    3 DCENOALT   BIT(1),          /* NO ALTERNATE CYLINDERS     @03A*/ 04010600
*    3 DCECUVAL   BIT(1),          /* CONTROL UNIT ID PRESENT    @04A*/ 04040600
*    3 DCELBUSY   BIT(1),          /* LONG BUSY INDICATION       @07A*/ 04055600
*    3 DCELBNRY   BIT(1),          /* MIH REDRIVE FLAG           @07A*/ 04070600
*    3 DCEMIMIH   BIT(1),          /* MINIMUM MIH                @H8C*/ 04085600
*   2 DCEFLAG2    BIT(8),          /* DCE FLAG BYTE 2                */ 04100600
*    3 DCEVALSS   BIT(1),          /* SUBSYSTEM VALID            @05A*/ 04108900
*    3 DCESSDPX   BIT(1),          /* DUPLEX DEVICE              @05A*/ 04117200
*    3 DCESSPRI   BIT(1),          /* DUPLEX PRIMARY DEVICE      @05A*/ 04125500
*    3 DCESSSEC   BIT(1),          /* DUPLEX SECONDARY DEVICE    @05A*/ 04133800
*    3 DCEPACK    BIT(1),          /* PACK CHANGE IN PROCESS     @10A*/ 04139400
*    3 DCEUCBRR   BIT(1),          /* DEVICE SYSGENNED SHARED    @11A*/ 04143100
*    3 DCEPACKS   BIT(1),          /* COMPARE SWAP BIT           @21C*/ 04145600
*    3 DCELSA     BIT(1),          /* DEVICE IS LSA TYPE         @17C*/ 04148100
*   2 DCEFLAG3    BIT(8),          /* DCE FLAG BYTE 3                */ 04150600
*    3 DCENSMB    BIT(1),          /* GAP SYCHRONOUE             @12A*/ 04163100
*    3 DCELRE     BIT(1),          /* LR EXTENDED CCW SUPPORTED  @12A*/ 04175600
*    3 DCEASYNC   BIT(1),          /* ASYCHRONOUS                @12A*/ 04181800
*    3 DCEBKUP    BIT(1),          /* T0 COPY SUPPORTED          @H5A*/ 04188000
*    3 DCECMB     BIT(1),          /* CMB UPDATE IN PROGRESS     @13A*/ 04192200
*    3 DCEESCON   BIT(1),          /* ATTACHED TO ESCON CHANNEL  @H7A*/ 04195000
*    3 DCEALTV    BIT(1),          /* DCEALCYL VALID             @H6A*/ 04196800
*    3 DCEOKRLC   BIT(1),          /* RECORD LEVEL CACHE VALID   @16C*/ 04198700
*   2 DCEVIB     PTR(31),          /* VTOC INFORMATION BLOCK PTR     */ 04200600
*   2 DCEVVDS    PTR(31),          /* PTR TO VVDS OPEN BLOCK     @H9C*/ 04250600
*   2 DCEVSB     PTR(31),          /* PTR TO VOLUME STATISTICS   @20C*/ 04300600
*   2 DCEFEATS   CHAR(2),          /* SENSE ID FEATURE BITS      @H1A*/ 04350600
*    3 DCEFEAT1    BIT(8),         /* SENSE ID BYTE 3            @H1A*/ 04400600
*     4 DCECKDEX    BIT(2),        /* CKD EXTENSIONS REFERENCE-DCENECKD 04450600
*                                     DCEDEFEX,DCEDEFLR          @H1A*/ 04650600
*     4 DCEPAGES    BIT(1),        /* SUPPORTS PAGING CCWS       @H2A*/ 04700600
*     4 DCECACHE    BIT(1),        /* CACHING DEVICE             @H4C*/ 04750600
*     4 DCEMODEL    BIT(4),        /* MODEL ID FROM SENSE        @H4A*/ 04800600
*    3 DCEFEAT2    BIT(8),         /* FEATURE BITS 2             @H3C*/ 04820600
*     4 DCEDEVID    BIT(4),        /* DEVICE IDENTIFIERS REFERENCE -    04840600
*                                     DCEDEV00,DCEDEV01,...      @H3A*/ 04860600
*     4 DCESDID     BIT(4),        /* STORAGE DIRECTOR MODEL TYP @01C*/ 04874600
*   2 DCEDCT CHAR(6) BDY(HWORD),   /* DEVICE CHARACTERISTICS     @02A*/ 04888600
*    3 DCEUDCYL FIXED(16),         /* NUMBER OF DATA+ALT CYL     @02C*/ 04902600
*    3 DCEHICYL FIXED(16),         /* HI SEEK ADDRESS            @02C*/ 04916600
*    3 DCEMDRDT    BIT(8),         /* MDR DEVICE TYPE CODE       @02C*/ 04930600
*    3 DCEOBRDT    BIT(8),         /* OBR UNIT TYPE              @02C*/ 04944600
*   2 DCECUID   CHAR(1),           /* CONTROL UNIT ID            @04A*/ 04958600
*/*                                                              @L1A*/ 04960000
*/************************************************************** @L1A*/ 04961400
*/* THE FOLLOWING BITS DEFINED FOR DCEXFEAT INDICATE THAT THE    @L1A*/ 04962800
*/* DEVICE IS CAPABLE OF THE FEATURE, NOT THAT THE FEATURE IS    @L1A*/ 04964200
*/* CURRENTLY ACTIVE ON THE DEVICE.  ANOTHER BYTE, DCEACTFE,     @L1A*/ 04965600
*/* HAS BEEN DEFINED BELOW THAT WILL INDICATE IF THE RELEVANT    @L1A*/ 04967000
*/* FEATURE IS CURRENTLY ACTIVE ON THE DEVICE.                   @L1A*/ 04968400
*/************************************************************** @L1A*/ 04969800
*/*                                                              @L1A*/ 04971200
*   2 DCEXFEAT  FIXED(8),          /* RDC BYTE 9                 @04A*/ 04972600
*    3 DCENRD      BIT(1),         /* 0-NON-RETENTIVE DATA       @04A*/ 04986600
*    3 DCELINKS    BIT(1),         /* 1-LINKS                    @04A*/ 05000600
*    3 DCEMORAN    BIT(1),         /* 2-MORAN FEATURE            @16C*/ 05014600
*    3 DCETCACH    BIT(1),         /* 3-TRACK CACHING            @04A*/ 05028600
*    3 DCEDCOPY    BIT(1),         /* 4-DUAL COPY                @04A*/ 05042600
*    3 DCEFSTWT    BIT(1),         /* 5-FAST WRITE               @04A*/ 05056600
*    3 DCERSTA     BIT(1),         /* 6-RESET ALLEGIANCE         @08C*/ 05070600
*    3 DCE32SNS    BIT(1),         /* 7-32 SENSE BYTES           @04A*/ 05084600
*   2 DCEFLAG5     BIT(8),         /* DCE FLAG BYTE 5            @HBC*/ 05087100
*    3 DCECAPST    BIT(3),         /* LSA CAPACITY OPER LEVEL    @HBA*/ 05089700
*    3 DCEMIHIW    BIT(1),         /* UCBMIHIW DETECTED          @30A*/ 05090380
*    3 DCEMIHMI    BIT(1),         /* UCBMIHMI DETECTED          @30A*/ 05090470
*    3 DCEST85     BIT(1),         /* UNSOL STAT X'85'           @31C*/ 05090650
*    3 DCEVIBIV    BIT(1),         /* INVALIDATED VIB            @32A*/ 05090740
*    3 DCETPCAC    BIT(1),         /* TRANSPARENT CACHE          @HCA*/ 05090880
*   2 DCEMIHCT  FIXED(8),          /* MIH COUNTER                @07C*/ 05091600
*                                  /* EXTEND DCE LENGTH          @06C*/ 05095100
*   2 DCECNTRS  CHAR(4) BDY(WORD), /* THRESHOLD COUNTERS         @06A*/ 05098600
*    3 DCESIOCT FIXED(15),         /* COUNT OF START I/O'S       @06A*/ 05102100
*    3 DCEERRCT FIXED(15),         /* ERROR THRESHOLD COUNT      @06A*/ 05105600
*   2 DCEDPCT   PTR(31),           /* DPCT POINTER               @09A*/ 05107900
*/*                                                              @L1A*/ 05108500
*/************************************************************** @L1A*/ 05109100
*/*                                                              @L1A*/ 05109700
*/* THE FOLLOWING BITS DEFINED FOR DCEACTFE INDICATE WHETHER     @L1A*/ 05110300
*/* THE INDICATED FEATURE IS ACTIVE ON THE DEVICE.  THE FEATURES @L1A*/ 05110900
*/* OF INTEREST FOR THIS LINE ITEM ARE:                          @L1A*/ 05111500
*/*                                                              @L1A*/ 05112100
*/*                REGULAR CACHING -  DECACACH                   @L1A*/ 05112700
*/*                DASD FAST WRITE -  DCEAFWRT                   @L1A*/ 05113300
*/*                CACHE FAST WRITE - DCEANRD                    @L1A*/ 05113900
*/*                                                              @L1A*/ 05114500
*/* NOTE THAT 'NON-RETENTIVE DATA' (AKA, CACHE FAST WRITE) IS    @L1A*/ 05115100
*/* ACTUALLY ONLY DEFINED AT THE SUB-SYSTEM LEVEL.  THAT BIT IS  @L1A*/ 05115700
*/* IS BEING DEFINED AND USED HERE TO MEAN THE SAME THING THAT   @L1A*/ 05116300
*/* DCENRD MEANS.  THE REDUNDANCY IS BEING ALLOWED TO AVOID      @L1A*/ 05116900
*/* CHANGING THE WAY DCENRD IS CURRENTLY BEING SET.              @L1A*/ 05117500
*/*                                                              @L1A*/ 05118100
*/*    CURRENTLY DCENRD IS BEING INITIALIZED IN IECDINIT.  A     @L1A*/ 05118700
*/*    READ SUB-SYSTEM DATA IS DONE AND THE APPROPRIATE BYTE IN  @L1A*/ 05119300
*/*    THE RETURNED DATA IS COPIED INTO DCEXFEAT.  NO LOGIC IS   @L1A*/ 05119900
*/*    APPLIED TO THE SETTING OF THE BITS.  WHILE IT IS NOT      @L1A*/ 05120500
*/*    LIKELY THAT THE BITS SETTINGS RETURNED IN THE RSSD (OR    @L1A*/ 05121100
*/*    THE SNSS, FOR THAT MATTER) ARE BEING SET IN A WAY         @L1A*/ 05121700
*/*    INCONSISTENT WITH THE LOGIC BEING APPLIED TO THE SETTINGS @L1A*/ 05122300
*/*    OF THESE NEW BITS IN IECCINIT, IT IS POSSIBLE.  TO AVOID  @L1A*/ 05122900
*/*    THE POTENTIAL INCONSISTENCY (AND POSSIBLE DEPENDENCY) ON  @L1A*/ 05123500
*/*    THE OLD BIT SETTINGS VS NEW BIT SETTINGS, WE HAVE OPTED   @L1A*/ 05124100
*/*    TO DEFINE THE REDUNDANT DCEANRD.                          @L1A*/ 05124700
*/*                                                              @L1A*/ 05125300
*/* THE BITS ARE DEFINED IN THE SAME RELATIVE POSITION IN THIS   @L1A*/ 05125900
*/* BYTE AS THEY ARE IN DCEXFEAT ABOVE.                          @L1A*/ 05126500
*/*                                                              @L1A*/ 05127100
*/* THESE BITS ARE SET BY IECCINIT WHEN ENTERED FOR NIP, VARY    @L1A*/ 05127700
*/* OR WHEN A PACK CHANGE OCCURS THAT GENERATES AN UNSOLICITED   @L1A*/ 05128300
*/* INTERRUPT TO AOM.                                            @L1A*/ 05128900
*/*                                                              @L1A*/ 05129500
*/* NOTE: THE BITS DEFINED FOR DCESYSFE AND DCEFLV0 DO NOT           */ 05129600
*/*       NECESSARILY EQUATE TO BITS IN RDC DATA.  ON SOME           */ 05129700
*/*       DEVICES, THE PRESENCE OF A PARTICULAR FEATURE IS           */ 05129800
*/*       INDICATED BY THE "VALUE" OF A STRING OF BITS RATHER        */ 05129900
*/*       THAN THE SETTING OF A SINGLE BIT.  IECDINIT AND            */ 05130000
*/*       IECCINIT PROVIDE THE LOGIC FOR MAPPING RDC VALUES          */ 05130100
*/*       INTO BITS IN THIS UCB CONTROL BLOCK.                       */ 05130200
*/*                                                              @L1A*/ 05130300
*/************************************************************** @L1A*/ 05130400
*/*                                                              @L1A*/ 05130700
*   2 DCEACTFE  FIXED(8),          /* FEATURE ACTIVE BYTE        @L1A*/ 05131300
*    3 DCEANRD     BIT(1),         /* CACHE FAST WRITE           @L1A*/ 05131900
*    3 DCEACAM     BIT(1),         /* CAMPUS DUAL COPY ACTIVE    @H8A*/ 05132300
*    3 DCEACCC     BIT(1),         /* CCC ACTIVE ON DEVICE       @H8A*/ 05132700
*    3 DCEACACH    BIT(1),         /* TRACK CACHING              @L1A*/ 05133100
*    3 *           BIT(1),         /* RESERVED                   @L1A*/ 05133700
*    3 DCEAFWRT    BIT(1),         /* DASD FAST WRITE            @L1A*/ 05134300
*    3 *           BIT(2),         /* RESERVED                   @L1A*/ 05134900
*   2 DCEALCYL  CHAR(1),           /* NUMBER OF ALTERNAT CYL     @H6A*/ 05135500
*   2 DCESYSFE  FIXED(8),          /* SYSTEM FEATURES            @14A*/ 05135600
*    3 DCECONTA    BIT(1),         /* CONTINUOUS AVAILABILITY    @14A*/ 05135700
*    3 DCEEXFMT    BIT(1),         /* EXTENDED FORMAT            @14A*/ 05135800
*    3 DCESCMPR    BIT(1),         /* SOFTWARE COMPRESSION       @14A*/ 05135900
*    3 DCESPLIT    BIT(1),         /* SPLIT CE/DE                @14A*/ 05136000
*    3 DCEIOPRI    BIT(1),         /* IOQ PRIORITY QUEUING       @H9A*/ 05136100
*    3 DCEXTIME    BIT(1),         /* USE IOS XTIME              @23A*/ 05136200
*    3 DCEUDELB    BIT(1),         /* LONG BUSY/DEV BLOCKING UDE @28A*/ 05136300
*    3 DCEXTIMF    BIT(1),         /* IO FAILED WITH XTIME       @29C*/ 05136400
*   2 DCEFLV0    BIT(8),           /* FUNCTIONAL LEVEL           @HAC*/ 05136500
*    3 DCEDPT      BIT(1),         /*  DEFECTIVE PRIM TRK        @H8A*/ 05136700
*    3 DCERDTRK    BIT(1),         /*  READ TRACK                @HAC*/ 05137000
*    3 DCECCC      BIT(1),         /*  CCC SUPPORTED             @H8A*/ 05137300
*    3 DCEST       BIT(1),         /*  STRIPING/COMP ON OEMI     @H8A*/ 05137600
*    3 DCEPFX      BIT(1),         /*  PREFIX CMD SUPPORTED      @H8A*/ 05137900
*    3 DCECAM      BIT(1),         /*  CAMPUS DUAL COPY          @H8A*/ 05138200
*    3 DCEVOLII    BIT(1),         /*  VOL INSTANT IMAGE         @HAA*/ 05138500
*    3 DCEVERS     BIT(1),         /*  DEV SUPPORTS VERSIONING   @22A*/ 05138800
*   2 DCECCA     FIXED(8),         /* CHANNEL CONNECTION ADDRESS @H8A*/ 05139100
*   2 DCERCUID   CHAR(1),          /* REAL CU ID                 @19C*/ 05141500
*   2 DCERDVID   CHAR(1),          /* REAL DEVICE ID             @19C*/ 05143900
*   2 DCEFLAG4   BIT(8),           /* DCE FLAG BYTE 4            @21C*/ 05144900
*    3 DCEUDE      BIT(1),         /* REMEMBER UDE PROCESSING    @21A*/ 05145900
*    3 DCEUDEMI    BIT(1),         /* REMEMBER MIH OCCURED       @21A*/ 05146900
*    3 DCEUDEPK    BIT(1),         /* UDE FROM PACK CHANGE       @21A*/ 05147900
*    3 DCERTRD     BIT(1),         /* READ TRACK DATA CCW SUPPTD @HAA*/ 05148200
*    3 DCEWTRK     BIT(1),         /* WRITE FULL TRACK CCW SUPPTD@HAA*/ 05148500
*    3 DCEWTRD     BIT(1),         /* WRITE TRACK DATA CCW SUPPTD@HAA*/ 05148800
*    3 DCELRERS    BIT(1),         /* LOCATE RECORD ERASE        @HAA*/ 05149100
*    3 DCEPPQ      BIT(1),         /* AOMPPQ IN PROGRESS         @26C*/ 05149400
*   2 DCESSCTI  FIXED(15),         /* SUBSYSTEM TABLE INDEX      @HAM*/ 05149700
*   2 DCEFLAG7   BIT(8),           /* DCE FLAG BYTE 7=RDCBYTE7   @HAA*/ 05150000
*    3 DCEPRSTG    BIT(1),         /* PRESTAGE TRACKSET          @HAA*/ 05150300
*    3 DCENSPAV    BIT(1),         /* DOES NOT SUPPORT PAV (VM)  @27A*/ 05150400
*   2 DCERESV3  CHAR(3),           /* RESERVED                   @33C*/ 05150690
*   2 DCESQC    FIXED(16),         /* REAL UCBSQC COUNT          @33A*/ 05150780
*   2 DCERESV4  CHAR(4);           /* RESERVED                   @33A*/ 05150870
* DECLARE                                                               05151000
*  DCENECKD BIT(2) CONSTANT('00'B), /* CKD EXTENSIONS NOT USED   @H1A*/ 05165000
*  DCEDEFEX BIT(2) CONSTANT('01'B), /* DEFINE EXTENT IMPLEMENTED @H1A*/ 05168600
*  DCERSVD1 BIT(2) CONSTANT('10'B), /* RESERVED FOR EXTENSION    @H1A*/ 05196600
*  DCEDEFLR BIT(2) CONSTANT('11'B), /* DEFINE EXTENT, LOCATE RECORD AND 05224600
*                                      RELATED TRANSFER COMMANDS        05252600
*                                     IMPLEMENTED                @H1A*/ 05280600
*  DCEDEV00 BIT(4) CONSTANT('0000'B), /* DEVICE TYPE 0           @H3A*/ 05308600
*  DCEDEV01 BIT(4) CONSTANT('0001'B), /* 3380 SHERIFF DEVICE     @H3A*/ 05336600
*  DCEDEV02 BIT(4) CONSTANT('0010'B), /* DEVICE TYPE 2           @H3A*/ 05364600
*  DCEDEV03 BIT(4) CONSTANT('0011'B), /* DEVICE TYPE 3           @H3A*/ 05392600
*  DCEUCBEX BIT(8) CONSTANT('18'X), /* OFFEST INTO THE COMMON UCB       05420600
*                                      EXTENSION OF THE FULLWORD WHICH  05450600
*                                      CONTAINS THE DCE ADDRESS (THE    05500600
*                                      EXTENSION IS POINTED TO BY       05550600
*                                      UCBEXTPT)                     */ 05600600
*  DCECVTCV BIT(8) CONSTANT('0C'X), /* OFFSET INTO THE OS/VS COMMON     05650600
*                                      EXTENSION TO THE CVT OF THE      05700600
*                                      FULLWORD WHICH CONTAINS THE      05750600
*                                      POINTER TO THE CVAF TABLE (THE   05800600
*                                      EXTENSION IS POINTED TO BY       05850600
*                                      CVTEXT1)                      */ 05900600
* D3380J    BIT(8) CONSTANT('21'X), /* 3380 MODEL J              @04A*/ 05950600
* D3380K    BIT(8) CONSTANT('23'X); /* 3380 MODEL K              @04A*/ 06000600
*                                                                       06050600
* DECLARE                           /* VALUES FOR DCECAPST       @HBA*/ 06100600
* DCEHASUB  BIT(3) CONSTANT('000'B),/* HOME AREA SUBSYSTEM       @HBA*/ 06150600
* DCECNORM  BIT(3) CONSTANT('001'B),/* LSA NOT CONSTRAINED       @HBA*/ 06200600
* DCECSTRE  BIT(3) CONSTANT('011'B),/* LSA BEYOND RECOMMENDED    @HBA*/ 06250600
* DCECCRIT  BIT(3) CONSTANT('101'B),/* LSA ALMOST OUT OF SPACE   @HBA*/ 06300600
* DCECEMER  BIT(3) CONSTANT('111'B);/* LSA TOTALLY FULL          @HBA*/ 06350600
