* %GOTO ATBPLS1;          /*                                            00052000
         MACRO                                                          00060021
         IECDATB                                                        00076600
         SPACE  1         */                                            00093200
* %ATBPLS1: ;                                                           00110021
*/********************************************************************* 00114400
*                                                                       00118800
*01*  Module Name - IECDATB                                             00123200
*                                                                       00127600
*     ATB - I/O attention table                                         00132000
*                                                                       00136400
*01*  Created By - IOSVATTN                                             00140800
*                                                                       00145200
*01*  Pointed To By -                                                   00149600
*      Pointer to attention table - IOCATTBL field in IOCOM             00154000
*      Offset value for an entry  - UCBATI field in the UCB             00158400
*                                   common extension                    00162800
*                                   (The UCBATI value has to            00167200
*                                    multiplied by 2 to get to          00171600
*                                    attention table entry).            00176000
*                                                                       00180400
*01*  Function - This macro describes an IOS attention table            00184800
*                entry                                                  00189200
*                                                                       00193600
*01*  Copyright -                                                       00198000
*      5685-001                                                         00204100
*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      00210200
*      (C) COPYRIGHT IBM CORP. 1982, 1988                               00216300
*      LICENSED MATERIALS - PROPERTY OF IBM                             00222400
*                                                                       00228800
*01*  Status - HBB3310                                                  00233200
*                                                                       00237600
*01*  Dependencies - None                                               00242000
*                                                                       00246400
*01*  Restrictions - None                                               00250800
*                                                                       00255200
*01*  Description  - The UCBATI values are detailed in module           00258100
*                    IOSVATTN.                                          00261000
*                                                                       00264000
*01*  Module Type - Control Block                                       00347600
*                                                                       00352000
*01*  Processor - PLS3 compiler and ASSEMBLER-H                         00356400
*                                                                       00360800
*01*  Change Activity -                                                 00365200
*                                                                       00369600
*   $MAC(IECDATB),COMP(SC1C3): Attention table mapping                  00374000
*                                                                       00378400
*   $L0=VERS     HBB3310 860416 PDLE: Versioning macro into             00382800
*                                     product. Standard prolog          00387200
*                                     added.                            00391600
*                                                                       00396000
*   $01=OW13795  HBB3310 950730 PDLZ: Allow scheduling attention        00396700
*                                     directly to the address space     00397400
*                                     that has allocated the device.    00398100
*                                                                 @01A  00398800
*                                                                       00399500
**********************************************************************/ 00400400
* %GOTO ATBPLS;       /*                                                00410000
ATB      DSECT                                                          00450021
*********************************************************************** 00460000
*    Attention Table Flags                                            * 00470000
*********************************************************************** 00480000
ATBFLA   DS    C                   Attention Table Flags                00490000
ATBSEP   EQU   X'80'               Attention Separation required        00500000
ATBLLKR  EQU   X'40'               Local lock required                  00510000
ATBQSC   EQU   X'20'               Set UCBLEVEL to Quiesce level        00520000
ATBITF   EQU   X'10'               Create an intercept condition        00530000
ATBUCBAS EQU   X'08'               Use the ASID that has allocated      00533300
*                                  the UCB (UCBASID) to schedule the    00536600
*                                  attention routine (non-DASD          00539900
*                                  devices only).                 @01A  00543200
ATBRESVR EQU   X'07'               Reserved - set to zeros        @01C  00546500
         SPACE 1                                                        00550021
         DS    C                   Reserved flag byte                   00596300
*********************************************************************** 00642600
*    Address Space for scheduling the attention routine               * 00688900
*********************************************************************** 00735200
ATBASID  DS    H                   ASID field                           00781500
*********************************************************************** 00827800
*    Attention Routine Address field                                  * 00874100
*********************************************************************** 00920400
ATBRTN   DS    A                   Address of attention routine         00966700
*********************************************************************** 01013000
ATBMP2   EQU   1                   POWER OF 2 MULTIPLIER FOR            01060021
*                                  UCBATI                               01070021
         MEND          */                                               01100000
* %ATBPLS: ;                                                            01150021
*   DCL 1 ATB  BDY(WORD)  BASED(ATBPTR),                                01160021
*/********************************************************************/ 01210000
*/*  Attention Table Flags                                           */ 01260000
*/********************************************************************/ 01310000
*        2 ATBFLA     BIT(8),         /* Attention table flags       */ 01360000
*          3 ATBSEP   BIT(1),         /* Separation required         */ 01410000
*          3 ATBLLKR  BIT(1),         /* Local lock required         */ 01460000
*          3 ATBQSC   BIT(1),         /* Set UCBLEVEL to Quiesce        01510000
*                                        level                       */ 01560000
*          3 ATBITF   BIT(1),         /* Create an intercept            01610000
*                                        condition                   */ 01660000
*          3 ATBUCBAS BIT(1),         /* Use the ASID that has          01674200
*                                        allocated the UCB (UCBASID)    01688400
*                                        to schedule the attention      01702600
*                                        routine (non-DASD devices      01716800
*                                        only).                  @01A*/ 01731000
*          3 ATBRESVR BIT(3),         /* Reserved, set to zeros  @01C*/ 01745200
*        2 *          BIT(8),         /* Reserved flags - set to 0   */ 01760000
*/********************************************************************/ 01810000
*/*  Address space for scheduling the attention routine              */ 01860000
*/********************************************************************/ 01910000
*        2 ATBASID   PTR(15),         /* ASID field                  */ 01960000
*/********************************************************************/ 02010000
*/*  Attention Routine address field                                 */ 02060000
*/********************************************************************/ 02110000
*        2 ATBRTN   PTR(31),          /* Attention routine address   */ 02160000
*        2 *        CHAR(0);          /* End of ATTENTION entry      */ 02210000
*/********************************************************************/ 02260000
*  DCL  ATBMP2 BIT(8) CONSTANT('01'X);  /* Power of 2 multiplier        02310000
*                                          for UCBATI                */ 02360000
