* %GOTO EXTWAPL2; /*                                              @06A  00025000
         MACRO                                                          00050000
&LABEL   IECEXTWA &EP,&D1=(0),&D2=(0),&ADT=NO                           00100000
.*** START OF SPECIFICATIONS ****************************************** 00350000
.*                                                                      00400000
.*$MAC(IECEXTWA):                                                       00450000
.*                                                                      00500000
.* DESCRIPTIVE NAME = DADSM EXTEND WORK AREA ADDRESSING MACRO           00550000
.*                                                                      00600000
.*PROPRIETARY V3 STATEMENT                                            * 00616600
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00633200
.*"RESTRICTED MATERIALS OF IBM"                                       * 00649800
.*5695-DF1                                                            * 00662300
.*(C) COPYRIGHT 1980,1991  IBM CORP.                                  * 00674800
.*END PROPRIETARY V3 STATEMENT                                        * 00687300
.*                                                                      00700000
.* STATUS = DFSMS/MVS 1.6.0                                             00750000
.*                                                                      00800000
.* FUNCTION = DADSM EXTEND MACRO WHICH PROVIDES ADDRESSABILITY          00850000
.*            EXTEND WORK AREA WHOSE LENGTH                        @L7C 00861700
.*            DOES NOT INCLUDE:                                    @L7C 00873400
.*               THE 8 WORD PREFIX OR                              @L7C 00885100
.*               THE 6 WORD RECOVERY ROUTINE PARAMETER LIST        @L7C 00896800
.*                                                                      00908500
.*            NOTE:  STORAGE FOR THE EXTEND WORK AREA IS           @L7A 00920200
.*                   OBTAINED BY IECRES.  IECRES OBTAINS           @L7A 00931900
.*                   THIS AMOUNT OF STORAGE:                       @L7A 00943600
.*                     LENGTH OF EXTEND WORK AREA FROM WTG TABLE   @L7A 00955300
.*                       TO END OF AUDIT TRAIL (WE ASK FOR THIS    @L7A 00967000
.*                       AMOUNT)                                   @L7A 00978700
.*                    +PREFIX (IECRES GIVES US THIS)               @L7A 00990400
.*                    +EXTENDED PREFIX (IECRES GIVES US THIS)      @L7A 01002100
.*                                                                      01013800
.*                   IECRES ALSO OBTAINS STORAGE FOR THE           @L7A 01025500
.*                   RECOVERY ROUTINE PARAMETER LIST               @L7A 01037200
.*                                                                      01050000
.* NOTES = THIS MACRO IS AN INTERNAL MACRO USED IN THE FOLLOWING        01100000
.*         DADSM FUNCTIONS:                                             01150000
.*                                                                      01200000
.*             EXTEND                                                   01250000
.*                                                                      01300000
.*         TO REFERENCE THIS WORK AREA WITHIN THE FUNCTIONS LISTED      01350000
.*         ABOVE, CODE A USING STATEMENT ON THE LABEL 'EXTNDWKA'.       01400000
.*                                                                      01450000
.*      DEPENDENCIES = THIS MACRO IS DESIGNED TO BE USED OPTIONALLY     01500000
.*                     WITH THE IECSDSL1 DSCB MAPPING MACRO, THE        01550000
.*                     PREFX MACRO (DEFINED IN THE IECDSECS MACRO)      01600000
.*                     WHICH DEFINES THE 8 WORD WORK AREA PREFIX,       01650000
.*                     THE 20 WORD EXTENDED WORK AREA PREFIX, AND       01700000
.*                     THE 4 WORD DADSM WTG TABLE, AND THE DSMADT       01750000
.*                     MACRO (ALSO DEFINED IN THE IECDSECS MACRO)       01800000
.*                     WHICH DEFINES THE TEN WORD                 @06C  01833300
.*                     DADSM AUDIT TRAIL.                         @06A  01866600
.*                                                                      01900000
.*      RESTRICTIONS = NONE                                             01950000
.*                                                                      02000000
.*      REGISTER CONVENTIONS = NOT APPLICABLE                           02050000
.*                                                                      02100000
.* PATCH LABEL = NOT APPLICABLE                                         02150000
.*                                                                      02200000
.* MODULE TYPE = MACRO                                                  02250000
.*                                                                      02300000
.*      PROCESSOR = ASSEMBLER LANGUAGE                                  02350000
.*                                                                      02400000
.*      MODULE SIZE = SEE ASSEMBLY LISTING                         @L5C 02450000
.*                                                                      02500000
.*      ATTRIBUTES = NOT APPLICABLE                                     02550000
.*                                                                      02600000
.* ENTRY POINT = EXTPREFX                                               02650000
.*                                                                      02700000
.*      PURPOSE = THIS MACRO IS CALLED AT ASSEMBLY TIME BY THE          02750000
.*                FUNCTIONS LISTED UNDER 'NOTES' TO EXPAND THE          02800000
.*                EXTEND WORK AREA.                                     02850000
.*                                                                      02900000
.*      LINKAGE =                                                       02950000
.*                                                                      03000000
.*              ASSEMBLER:                                         @06A 03025000
.*                LABEL IECEXTWA EP,D1=(N),D2=(N),ADT=YES               03050000
.*              PL/X:                                              @06A 03066600
.*                INCLUDE SYSLIB(IECEXTWA):                        @06A 03083200
.*                                                                      03100000
.*      INPUT =                                                         03150000
.*                                                                      03200000
.*                OPTIONAL LABEL SPECIFIED AS AN ACCEPTABLE ASSEMBLER   03250000
.*                LABEL WHICH CAN BE USED BY THE CALLING CSECT TO       03300000
.*                ESTABLISH ADDRESSABILITY TO THE ENTIRE WORK AREA.     03350000
.*                                                                      03400000
.*                EP IS THE FIRST POSITIONAL PARAMETER, SPECIFYING      03450000
.*                THAT THE LABELS FOR EACH OF THE FIELDS IN THE 8       03500000
.*                WORD PREFIX, 20 WORD EXTENDED PREFIX, AND THE 4       03550000
.*                WORD DADSM WTG TABLE ARE TO BE EXPANDED. IF THESE     03600000
.*                FIELDS ARE NOT TO BE DEFINED, A COMMA MUST BE         03650000
.*                CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.      03700000
.*                                                                      03750000
.*                D1=(N) IS A KEYWORD PARAMETER THAT SPECIFIES THE      03800000
.*                FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE        03850000
.*                FIRST 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.   03900000
.*                N CAN BE A NUMBER FROM 0 - 7.  IF N IS 0 OR 4 OR @L7C 03950000
.*                IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.   04000000
.*                IF N IS 1, 2, 3, 5, 6, OR 7,                     @L7C 04033300
.*                THE CORRESPONDING FORMAT                         @L7C 04066600
.*                OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB     04100000
.*                FORMAT CAN BE MAPPED IN THE FIRST 140 BYTE DSCB       04150000
.*                AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.      04200000
.*                                                                      04250000
.*                D2=(N) IS A KEYWORD PARAMETER THAT SPECIFIES          04300000
.*                THE FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE    04350000
.*                SECOND 140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.  04400000
.*                N CAN BE A NUMBER FROM 0 - 7.  IF N IS 0 OR 4 OR      04450000
.*                IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.   04500000
.*                IF N IS 1, 2, 3, 5, 6, OR 7,                     @L7C 04533300
.*                THE CORRESPONDING FORMAT                         @L7C 04566600
.*                OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB     04600000
.*                FORMAT CAN BE MAPPED IN THE SECOND 140 BYTE DSCB      04650000
.*                AREA BY SEPARATING THE FORMAT NUMBERS BY COMMAS.      04700000
.*                                                                      04750000
.*                ADT=YES IS A KEYWORD PARAMETER WHICH SPECIFIES THAT   04800000
.*                THE LABELS FOR EACH OF THE FIELDS WITHIN THE 10  @06C 04850000
.*                WORD DADSM AUDIT TRAIL ARE TO BE EXPANDED.            04900000
.*                                                                      04950000
.*      OUTPUT = DADSM EXTEND WORK AREA EXPANSION                       05000000
.*                                                                      05050000
.* EXIT-NORMAL = MEND STATEMENT                                         05100000
.*                                                                      05150000
.* EXIT-ERROR = ERROR MESSAGES:                                         05200000
.*                                                                      05250000
.*      MNOTE 12,***  IHB002 INVALID EP OPERAND SPECIFIED-&EP           05300000
.*      MNOTE 12,***  IHB002 INVALID ADT OPERAND SPECIFIED-&ADT         05350000
.*                                                                      05400000
.*      THE MACRO EXPANSION CONTINUES AS IF THE INVALID PARAMETER       05450000
.*      WERE NOT SPECIFIED.                                             05500000
.*                                                                      05550000
.* EXTERNAL REFERENCES = NONE                                           05600000
.*                                                                      05650000
.*      ROUTINES = NONE                                                 05700000
.*                                                                      05750000
.*      DATA AREAS = EXTEND WORK AREA                                   05800000
.*                                                                      05850000
.*      CONTROL BLOCKS = DSCB                                           05900000
.*                                                                      05950000
.* TABLES = NONE                                                        06000000
.*                                                                      06050000
.* MACROS = IECDSECS DSMADT                                             06100000
.*          IECDSECS PREFX                                              06150000
.*          IECEXIPD             PDSE PARAMETER LIST               @L5A 06175000
.*          IECSDSL1                                                    06200000
.*          IHBERMAC                                                    06250000
.*          IOSDIOBE             Used to set indicators for EXCP   @07A 06275000
.*                                                                      06300000
.* CHANGE ACTIVITY =                                                    06305500
.*$L1=IXVTOC,JDM1134,T790227,STLBS: INDEXED VTOC SUPPORT           @L1A 06311000
.*$L2=ICFCAT,JDM1113,T790073,STLMD: DFEF CATALOG SUPPORT (ICFCAT)  @L2A 06316500
.*$01=OZ67804,HDP1102,STLMDB:  FIX FOR ENQ LOCKOUT PROB            @01A 06322000
.*$L3=MVS/XA,JDP1111,STLBS:    SAF/RACF ALWAYS CALL SUPPORT        @L3A 06327500
.*$L4=MVS/XA,HDP2230,T85029,STLMC: DADSM VSCR                      @L4A 06333000
.*$L5=PDSE,HDP3320,T87300,STLMW: PDSE SUPPORT                      @L5A 06338500
.*$P1=KET1797,HDP3320,T89047,STLMNW: NAME CHANGE TO PDSE           @P1A 06344000
.*$L6=DYNAMIC,HDP3330,T890828,SJPLJDY: DYNAMIC I/O CONFIGURATION   @L6A 06349500
.*$P2=KC10879,HDP3330,T900921,SJPLJDY: ENSURE ALIGNEMENT OF DSMADT @P2A 06355000
.*$02=OY36570,HDP3330,T910201,SJPLKAA: SUPPORT FOR AVGREC DATA SETS@02A 06360500
.*$L7=64KTRACK,JDZ1110,920320,SJPLJEB: SUPPORT FOR DASD WITH MORE  @L7A 06366000
.*                                     THAN 64K TRACKS             @L7A 06371500
.*$P3=KMM2889,JDZ1110,920727,SJPLJEB: 553B PROBLEM. ADD IGGDADTS   @P3A 06377000
.*                                    COMMON MACROS.               @P3A 06382500
.*$03=OY59954,JDZ1110,921209,SJPLJEB: VTOC ERRORS IF FREE-SPACE    @03A 06388000
.*                                    GROWS TO ANOTHER DSCB        @03A 06393500
.*$04=OY60006,JDZ1110,921209,SJPLJEB: CORRECT ALTERNATE TRACKS     @04A 06395600
.*                                    CALCULATIONS                 @04A 06397700
.*$05=OY64980,JDZ1110,930617,SJPLJEB: HANDLE DETECTED FREE-SPACE   @05A 06398400
.*                                    SPACE ERRORS                 @05A 06399100
.*$L8=UCBVSCR,HDZ11C0,940601,SJPLRPS  UCB VSCR SUPPORT             @L8A 06400000
.*$06=OW16158,HDZ11C0,951006,SJPLJEB: DUMP BROKEN VTOC             @06A 06400900
.*$L8=UCBVSCR,HDZ11C0,940601,SJPLRPS: UCB VSCR SUPPORT             @L8A 06401300
.*                                    PL/X VERSION FOR IPCS        @06A 06401800
.*$07=OW34136,HDZ11E0,98Jul01,SJPLRPS: Fiber channel io support    @07A 06402700
.*    NOTE: if Extend gets changed to no longer issue EXCP,        @07A 06403600
.*          the code added by this apar should be removed.         @07A 06404500
.*$L9=VSAMEOV,HDZ11F0,99MAY15,SJPLRPS: RETURN EXTENTS FOR VSAM EOV @L9A 06405100
.*$P4=K160439,HDZ11F0,99SEP24,SJPLGAP: Wrong Value used for VSAMEOV@P4A 06405400
.*                                                                      06405800
.* NOTE: THIS MACRO IS BILINGUAL - PLEASE UPDATE BOTH PARTS        @06A 06412100
.*       ADD NEW FIELDS BELOW THE IGGDADMP SO ITS OFFSET WILL      @06A 06418400
.*       REMAIN CONSTANT FOR RELEASES 3.2.1 AND 3.3.2.             @06A 06424700
.*       THIS WILL ENSURE THAT THE IPCS USER EXIT MAY BE USED      @06A 06431000
.*       FOR THOSE RELEASES.                                       @06A 06437300
.*                                                                      06443600
.*** END OF SPECIFICATIONS ******************************************** 06471800
.*                                                                      06500000
         LCLA  &C                                                       06550000
&LABEL   DSECT                                                          06600000
*********************************************************************** 06650000
*                                                                       06700000
*        EXTEND WORK AREA                                               06750000
*                                                                       06800000
*********************************************************************** 06850000
         SPACE 1                                                        06900000
*********************************************************************** 06950000
*        PREFIX, EXTENDED PREFIX, AND WTG TABLE AREA                    07000000
*        OPTIONAL EXPANSION OF IECDSECS                            @L7A 07025000
*********************************************************************** 07050000
         SPACE 1                                                        07100000
EXTPREFX DS    8F                       WORK AREA PREFIX                07150000
EXTNDWKA DS    20F                      EXTENDED PREFIX                 07200000
EWTGTBL  DS    4F                       DADSM WTG TABLE                 07250000
         AIF   ('&EP' EQ 'EP').EXT0010                                  07300000
         AIF   ('&EP' EQ '').EXT0020                                    07350000
         IHBERMAC 1001,EP,&EP                                           07400000
         AGO   .EXT0020                                                 07450000
.EXT0010 ANOP                                                           07500000
         ORG   EXTPREFX                                                 07550000
         MNOTE '         IECDSECS PREFX,EXPAND=YES'                     07600000
         IECDSECS PREFX,EXPAND=YES                                      07650000
.EXT0020 ANOP                                                           07700000
*********************************************************************** 07800000
*        FSDSCB - THE FREE-SPACE DSCB WORK AREA                    @03C 07820000
*                 (USED FOR READING IN THE F5/F7 DSCBS FOR         @03A 07840000
*                 NON-INDEXED VOLUMES BY MODULE IGG0553B AND       @03A 07860000
*                 MODULE IGG0553D.)                                @03A 07880000
*********************************************************************** 07900000
         SPACE 1                                                        07950000
FSDSCB   DS    XL140                    140-BYTE DSCB AREA              08000000
&C       SETA  1                                                        08100000
.EXT0050 AIF   (&C GT N'&D1).EXT0060                                    08150000
         AIF   (&D1(&C) EQ 0 OR &D1(&C) EQ 4).EXT0055                   08200000
         AIF   (&D1(&C) EQ 7).EXT0052                                   08233300
         ORG   FSDSCB                                                   08266600
         MNOTE '         IECSDSL1 (&D1(&C))'                            08300000
         IECSDSL1 (&D1(&C))                                             08350000
         AGO   .EXT0055                                                 08360000
.EXT0052 ORG   FSDSCB                                                   08370000
         MNOTE '         IGGDADS7 '                                     08380000
         IGGDADS7 DSECT=NO                                              08390000
.EXT0055 ANOP                                                           08400000
&C       SETA  &C+1                                                     08450000
         AGO   .EXT0050                                                 08500000
.EXT0060 ANOP                                                           08550000
         SPACE 1                                                        08600000
*                                                                 4@03D 08627700
*****************************************************************  @03A 08655400
*       F3DSCB - THE F3 DSCB WORK AREA                             @03A 08683100
*                (ALSO USED AS A WORK AREA FOR OUTPUT F5/F7 DSCB   @03A 08710800
*                FOR NON-INDEXED VOLUMES BY MODULE                 @03A 08738500
*                IGG0553D AFTER THE F3 IS NO LONGER NEEDED.)       @03A 08766200
*****************************************************************  @03A 08793900
*                                                                  @03A 08821600
F3DSCB   DS    XL140                    140-BYTE DSCB AREA              08850000
&C       SETA  1                                                        08900000
.EXT0070 AIF   (&C GT N'&D2).EXT0080                                    08950000
         AIF   (&D2(&C) EQ 0 OR &D2(&C) EQ 4).EXT0075                   09000000
         AIF   (&D2(&C) EQ 7).EXT0072                                   09025000
         ORG   F3DSCB                                                   09050000
         MNOTE '         IECSDSL1 (&D2(&C))'                            09100000
         IECSDSL1 (&D2(&C))                                             09150000
         AGO   .EXT0075                                                 09160000
.EXT0072 ORG   F3DSCB                                                   09170000
         MNOTE '         IGGDADS7 '                                     09180000
         IGGDADS7                                                       09190000
.EXT0075 ANOP                                                           09200000
&C       SETA  &C+1                                                     09250000
         AGO   .EXT0070                                                 09300000
.EXT0080 ANOP                                                           09350000
         SPACE 1                                                        09400000
*                                                                  @L7M 09401500
*****************************************************************  @L7M 09403000
*       FNDSCB - THE NTH F3 DSCB, NEW DSCB F3 CREATED BY EXTEND.   @L7M 09404500
*****************************************************************  @L7M 09406000
*                                                                  @L7M 09407500
         DS    XL3                      RESERVED                   @L7M 09409000
FNCCHHR  DS    XL5                      CCHHR OF FORMAT 'N' DSCB   @L7M 09410500
FNDSCB   DS    XL140                    FORMAT 'N' DSCB            @L7M 09412000
*                                                                  @L7M 09413500
         ORG   FNDSCB                   DEFINE THE BIT AND BYTES.  @L7M 09415000
         DS    XL4                      KEY IDENTIFIER             @L7M 09416500
FNEXTNT  DS    XL40                     FOUR EXTENT DESCRIPTORS    @L7M 09418000
FNFMTID  DS    CL1                      FORMAT ID (X'F3')          @L7M 09419500
FNADEXT  DS    XL90                     NINE ADDITIONAL EXTENTS    @L7M 09421000
FNPTRDS  DS    XL5                      ADDRESS OF NEXT DSCB       @L7M 09422500
*                                                                  @L7M 09424000
*******************************************************************@L7M 09425500
*        FORMAT 1 DSCB                                             @L7A 09427000
*******************************************************************@L7M 09428500
F1BUFFER DS    XL140                    FORMAT 1 DSCB BUFFER       @L7M 09430000
F1DSCB   ORG   F1BUFFER                 F1DSCB IS SAME AS F1BUFFER @L7M 09431500
         ORG   F1BUFFER                 START AT BEGINNING         @L7M 09433000
         IECSDSL1 (1)                   EXPAND THE F1 DSCB         @L7M 09434500
         EJECT                                                          09436000
*******************************************************************@L7A 09437500
*        FORMAT 0 DSCB BUFFER                                      @L7A 09439000
*        THIS IS NEEDED FOR THE SEARCH FOR AN F0 FOR THE OSVTOC    @L7A 09440500
*        PATH.                                                     @L7A 09442000
*******************************************************************@L7A 09443500
F0BUFFER DS    XL96                     FORMAT 0 DSCB BUFFER       @L7A 09445000
         EJECT                                                          09446500
*********************************************************************** 09450000
*        REGISTER SAVEAREA                                         @02A 09500000
*********************************************************************** 09550000
         DS    0F                       ALIGN TO WORD BOUNDARY     @02A 09600000
EREGSAVE DS    12F                      SAVEAREA FOR R2 THRU R13   @02A 09650000
*********************************************************************** 10300000
*        EXTENT DESCRIPTOR TABLES HOLD RTA,RTA+1 PAIRS OR          @L7A 10333300
*        RTA,LENGTH PAIRS FOR INPUT AND OUTPUT PROCESSING          @L7A 10366600
*********************************************************************** 10400000
         ICVEDT02 ENTRY=26,             BIG ENOUGH FOR A F5 DSCB   @L7AX10417300
               DT2PRE=FRI,              FREE-SPACE INPUT (FRI) EDT @L7AX10434600
               DSECT=NO                 NO DSECT                   @L7A 10451900
&LABEL   DSECT                                                          10469200
         ICVEDT02 ENTRY=26,             BIG ENOUGH FOR A F5 DSCB   @L7AX10486500
               DT2PRE=FRO,              FREE-SPACE OUTPUT (FRO) EDT@L7AX10503800
               DSECT=NO                 NO DSECT                   @L7A 10521100
&LABEL   DSECT                                                          10538400
*********************************************************************** 10555700
*        PROCESSING FIELDS FOR EXTENT DESCRIPTOR TABLE             @L7A 10573000
*********************************************************************** 10590300
EXTDTSWA DS    CL40                     WORK AREA USED BY DTS MACRO@L7A 10607600
*********************************************************************** 10624900
*        PUSH-DOWN LIST                                            @L7A 10642200
*********************************************************************** 10659500
*                                                                 2@L7D 10676800
         ICVEDT02 ENTRY=5,              BIG ENOUGH FOR 5 ENTRIES   @L7AX10694100
               DT2PRE=PDL,              PUSH-DOWN LIST             @L7AX10711400
               DSECT=NO                 NO DSECT                   @L7A 10728700
&LABEL   DSECT                                                          10746000
*                                       EQUATES FOR OFFSETS OF:    @L7A 10763300
ENTRY1    EQU  0                        FIRST ENTRY IN PDLIST      @L7A 10780600
ENTRY2    EQU  1*L'PDLEXT               SECOND ENTRY IN PDLIST     @L7A 10797900
ENTRY4    EQU  3*L'PDLEXT               FOURTH ENTRY IN PDLIST     @L7A 10815200
ENTRY5    EQU  4*L'PDLEXT               FIFTH ENTRY IN PDLIST      @L7A 10832500
*********************************************************************** 10850000
*        ABSOLUTE TRACK ADDRESSES                                       10900000
*********************************************************************** 10950000
         SPACE 1                                                        11000000
EVTOCADR DS    XL5                      CCHHR OF F4 DSCB ON CURRENT     11050000
*                                       VOLUME                          11060000
EDADSMAD DS    XL5                      CCHHR OF FREE-SPACE DSCB   @L7C 11072800
*                                       (F5 OR F7) ON VOLUME       @L7C 11085600
F1ADD    DS    XL5                      CCHHR OF F1 DSCB FOR DATA  @L7A 11098400
*                                       SET                        @L7A 11111200
LSTF3ADD DS    XL5                      CCHHR OF LAST F3 DSCB FOR  @L7A 11124000
*                                       DATA SET                   @L7A 11136800
ECOUNT   DS    XL5                      CHANNEL PROGRAM WORK AREA       11150000
COUNT2   DS    XL5                      CHANNEL PROGRAM WORK AREA       11250000
ETTRLL   DS    XL5                      TTRLL FOR F1 DSCB OF DATA       11350000
*                                       SET BEING EXTENDED              11360000
*                                                                  @L7D 11368800
*********************************************************************** 11377600
*                                                                  @L2A 11386600
EIDAREA  DS    XL5                      CHANNEL PROGRAM WORK AREA       11400000
ENEXTADR DS    XL5                      CHANNEL PROGRAM WORK AREA       11450000
EXTCCHHR DS    XL5                      CCHHR HOLD AREA                 11460000
         DS    0F                                                       11473300
IDCOUNT  DS    XL4                      ID AREA COUNT              @L7A 11486600
         SPACE 1                                                        11500000
*********************************************************************** 11550000
*        INTERNAL EXTEND SWITCHES                                       11575000
*        TO REMAIN COMPATIBLE WITH CREATE'S EQUATES                @L7A 11600000
*        THESE NAMES ARE PREFIXED WITH 'E'                         @L7A 11625000
*********************************************************************** 11650000
         SPACE 1                                                        11700000
ESWITCH  DS    XL1                      EXTEND F5/F7 MERGING SWITCH@L7C 11750000
*                                                                       11800000
EWRZERO  EQU   X'80'                    WRITE F0 DSCB              @L7A 11850000
ERCDALT  EQU   X'40'                    F5/F7 DSCB MODIFIED        @L7A 11900000
EPRCNTL  EQU   X'20'                    PROCESS CONTROL SWITCH     @L7A 11950000
EWRTFNL  EQU   X'10'                    WRITE FINAL F5 DSCB        @L7A 12000000
EFRSTFSD EQU   X'08'                    FIRST F5/F7 IN WORK AREA   @L7A 12050000
ENEWFS   EQU   X'04'                    NEW F5/F7 HAS BEEN BUILT   @L7A 12100000
EDADBYP  EQU   X'02'                    BYPASS UPDATING EDT PTR    @L7A 12150000
EOUTBYP  EQU   X'01'                    BYPASS UPDATING F5/F7 PTR  @L7A 12200000
         SPACE 1                                                        12400000
ESWITCH2 DS    XL1                      EXTEND SWITCHES CONTINUED       12410000
*                                                                       12430000
EFSZERO  EQU   X'01'                    F5/F7 WITH NO EXTENTS      @L7C 12443500
*                                       EXISTS ON VTOC                  12457000
VERIFYFN EQU   X'02'                    VERIFY FN DSCB HOLE.       @L2A 12462700
FNSWITCH EQU   X'04'                    FN DSCB NEEDS WRITING OUT. @L2A 12468400
ICFXTND  EQU   X'08'                    EXTENTD OF ICF DATA SET.   @L2A 12474100
ESWBR    EQU   X'10'                    BRANCH ENTRY TO EXTEND     @L3A 12474900
LKASSIST EQU   X'20'                    LINKAGE ASSIST ENTRY       @L4A 12475700
NODEB    EQU   X'40'                    AUTH CALL WITH NO DEB      @L4A 12476500
RSTRSIZE EQU   X'80'                    RESTRICT SIZE OF THIS DATA @L7C 12477300
*                                       SET TO LESS THAN 64K TRACKS@L7A 12478100
         SPACE 1                                                        12478900
ESWITCH3 DS    XL1                      THIRD SWITCH BYTE          @L7A 12479700
*                                                                  @L7A 12480500
EF7FREES EQU   X'01'                    PROCESS FOR F7 FREE SPACE  @L7A 12481300
EXTCYLAL EQU   X'02'                    EXTENT REQUIRES CYLINDER   @L7A 12482100
*                                       ALIGNMENT                  @L7A 12482900
NO614I   EQU   X'04'                    DO NOT ISSUE IEC614I       @L7A 12483700
*                                       MESSAGE                    @L7A 12484500
FSPACERR EQU   X'08'                    FREESPACE ERROR FROM       @05A 12484800
*                                       IGGDADTS OR IGGDAEDS MACRO @05A 12485100
EUCBCAP  EQU   X'10'                    UCB WAS CAPTURED           @L8A 12485300
VSAMEOV  EQU   X'10'                    CALLER IS VSAM EOV         @P4A 12485400
         EJECT                                                          12485500
*********************************************************************** 12491500
*        EXTEND DASD SWITCH FLAG BYTE                                   12491600
*********************************************************************** 12491700
EDSFLAG  DS    XL1                      FLAG BYTE FOR BASIC        @L1A 12491800
*                                       DEVICE SUPPORT             @L1A 12491900
IXVTOCX  EQU   X'80'                    INDEXED VTOC EXISTS        @L1A 12492000
PREXTKN  EQU   X'40'                    PRE-EXIT TAKEN             @L1A 12492100
VRFXSTS  EQU   X'20'                    ACTIVE VRF DATA EXISTS     @L1A 12492200
PREXERR  EQU   X'10'                    PRE-EXIT ROUTINE REJECT.   @L2A 12492300
IXDSNERR EQU   X'08'                    INDEX DATA SET, NO EXTEND  @L1A 12492400
VERIFYF3 EQU   X'04'                    VERIFY F3 DSCB HOLE        @L1A 12492500
VERIFYF1 EQU   X'02'                    VERIFY F1 DSCB HOLE        @L1A 12492600
IXVTOCRX EQU   X'01'                    INDEXED VTOC ERROR EXISTS  @L1A 12492700
EDSFLAG2 DS    XL1                      SECOND FLAG BYTE           @L4C 12492800
ISJFERR  EQU   X'04'                    ISJF SERVICE FAILED        @02A 12492900
MAXEXERR EQU   X'02'                    EXCEED 123 EXTENTS FOR PDSE@L5A 12493000
DEBERR   EQU   X'01'                    NON-AUTH CALL WITH NO DEB  @L4A 12493100
*********************************************************************** 12493200
*        MISC                                                           12493300
*********************************************************************** 12493400
SAVEREG  DS    F                        SAVE A RETURN REGISTER     @L1A 12493500
SAVEHOLD DS    F                        SAVE HOLD REGISTER         @L7A 12493600
ULTRK    DS    F                        USER LABEL TRACK           @L1A 12493700
*                                                                16@L7D 12493800
ICFPARM  DS    F                        ADDRESS OF ICF PARM LIST.  @L2C 12494400
SAVERETN DS    F                        LINKAGE ASSIST RETURN ADDR @L4A 12494900
TCBADDR  DS    F                        TCB ADDRESS                @L4A 12495400
*                                       ALLOCATED TO DATA SET.     @L7A 12495900
LSTF3EXT DS    F                        NUMBER OF EXTENTS IN F3    @L7A 12496400
CURNUMTR DS    F                        CURRENT NUMBER OF TRACKS   @L7A 12496900
ALTERTRK DS    F                        NUMBER OF ALTERNATE TRACKS @04A 12497000
*                                         ON THIS VOLUME           @04A 12497100
TOTALTRK DS    F                        TOTAL NUMBER OF TRAKCS     @L7A 12497400
*                                         AFTER THIS REQUEST       @L7A 12497900
         DS   0D                                                   @L7A 12498400
RTAWORK  DS    D                        DOUBLEWORD FOR RTA WORK    @L7A 12498900
NUM_EXTENTS DS    XL1                   NUMBER OF EXTENTS          @L7C 12499400
*                                                                17@L7D 12499900
*********************************************************************** 12500400
*        MISCELLANEOUS EQUATES                                          12500900
*        TO REMAIN COMPATIBLE WITH CREATE'S EQUATES                @L7A 12501400
*        THESE NAMES ARE PREFIXED WITH 'E'                         @L7A 12501900
*********************************************************************** 12502400
EECBPERR  EQU X'41'                     EXCP PERMANENT ERROR       @L7A 12502900
EECBNORM  EQU X'7F'                     EXCP NORMAL END            @L7A 12503400
*******************************************************************@L7A 12503900
*        DIAGNOSTIC AND RELATED INFORMATION                        @L7A 12504400
*********************************************************************** 12504900
SAVESFID DS    XL1                      SAVE SUBFUNCTION ID FOR    @L7A 12505400
*                                       SUBFUNCTION ID             @L7A 12505900
         DS    XL2                      RESERVED                   @L7A 12506400
EXTDIAG  DS    0F                       DIAGNOSTIC INFORMATION     @L7A 12506900
EXTERCD  DS    XL1                      ERROR CODE                 @L7A 12507400
EXTSFID  DS    XL1                      SUBFUNCTION ID             @L7A 12507900
EXTSFRT  DS    XL1                      SUBFUNCTION RETURN CODE    @L7A 12508400
EXTSFRS  DS    XL1                      SUBFUNCTION REASON CODE    @L7A 12508900
         SPACE 1                                                        12509400
*        IGGDAEXT DSECT=NO              EXPAND DIAGNOSTIC PL       @L7A 12509900
         IGGDAEXT DSECT=NO                                         @L7A 12510400
         EJECT                                                          12510900
*******************************************************************@06A 12511000
*        IGGDADMP      PARAMETER LIST                              @06A 12511100
*******************************************************************@06A 12511200
*        IGGDADMP                       EXPAND SDUMP PARM LIST     @06A 12511300
EDEBUGPL IGGDADMP EXT=YES                                          @06A 12511400
         EJECT                                                          12511500
*******************************************************************@L7A 12511600
*        PRE/POST-EXIT PARAMETER LIST                              @L7A 12511900
*******************************************************************@L7A 12512400
*        IECIEXPL DSECT=NO              EXPAND PRE/POST-EXIT PL    @L1A 12512900
         IECIEXPL DSECT=NO                                         @L1A 12513400
         EJECT                                                          12513900
*******************************************************************@L7A 12514400
*        CVAF PARAMETER LIST                                       @L7C 12514900
*******************************************************************@L7A 12515400
*        ICVAFPL  DSECT=NO              EXPAND CVAF PARM LIST      @L1A 12515900
         ICVAFPL  DSECT=NO                                         @L1A 12516400
         EJECT                                                          12516900
*****************************************************************  @L7A 12517400
* CVAF VOLUME SPACE DESCRIPTION TABLE                              @L7A 12517900
*****************************************************************  @L7A 12518400
*                                                                13@L7D 12518900
*        ICVVLSDT DSECT=NO                                         @L7A 12519400
         ICVVLSDT DSECT=NO                                         @L7A 12519900
         EJECT                                                          12520400
*******************************************************************@L7A 12520900
*        CVAF BUFFER LIST                                          @L7C 12521400
*******************************************************************@L7A 12521900
*        ICVAFBFL DSECT=NO              EXPAND BUFFER LIST         @L1A 12522400
         ICVAFBFL DSECT=NO                                         @L1A 12522900
         EJECT                                                          12523400
*********************************************************************** 12523900
*        FLAG FOR DT8AREDT WHICH IS LOCATED IN VRFDA               @L7A 12524400
*********************************************************************** 12524900
RSMC     EQU   X'80'                    STEP-MUST-COMPLETE ISSUED       12525400
*******************************************************************@L7A 12525900
*        VRF DATA                                                  @L7C 12526400
*        (CONTAINS THE EXTENT DESCRIPTOR TABLES)                   @03A 12526900
*******************************************************************@L7A 12527400
*        IECVRFDA DSECT=NO,FUNCT=EXTEND VRF DATA AREA              @L1A 12527900
         IECVRFDA DSECT=NO,FUNCT=EXTEND                            @L1A 12528400
         EJECT                                                          12528900
*                                                                 9@L7D 12529400
*******************************************************************@L5A 12529900
*        PDSE PARAMETER LIST                                       @L5A 12530400
*******************************************************************@L5A 12530900
PDSEPL   IECEXIPD DSECT=NO              PDSE PARAMETER LIST        @P1C 12531400
         EJECT                                                     @L5A 12531900
*                                                                 4@L7M 12532400
*******************************************************************@L8A 12532500
*        IOSCAPU PARAMETER LIST (TO CAPTURE AND UNCAPTURE UCBS)    @L8A 12532600
*******************************************************************@L8A 12532700
SAVEUCB  DS   A                         FOR IOSCAPU CALL           @L8C 12532800
IOSCAPPL IOSCAPU MF=(L,IOSCAPPA)                                   @L8C 12532900
         EJECT                                                     @L8A 12533000
*                                                                  @L8A 12533100
*******************************************************************@L5A 12533200
*        PARAMETER LIST FOR THE INVOKE SJF SERVICE, IGGDAJ01,      @02A 12533400
*        AND ASSOCIATED VARIABLES                                  @02A 12533900
*******************************************************************@02A 12534400
         DS   0F                                                        12534900
KEYRETRV DS   XL1                       KEYWORDS RETRIEVED FLAG    @02A 12535400
KYAVGREC EQU  X'80'                     AVGREC VALUE RETRIEVED     @02A 12535900
         DS   XL2                       RESERVED - UNUSED          @02A 12536400
AVGREC   DS   XL1                       AVERAGE RECORD VALUE       @02A 12536900
DAJ01NAM DS   CL8                       IGGDAJ01 MODULE NAME - USED@02A 12537400
*                                       FOR TRACING                @02A 12537900
DAJ01EP  DS   F                         IGGDAJ01 ENTRY POINT - USED@02A 12538400
*                                       FOR TRACING                @02A 12538900
         IGGDASJF DSECT=NO              IGGDAJ01 PLIST             @02A 12539400
*******************************************************************@02A 12539900
         EJECT                                                          12540400
         DS   0F                        ALIGN TO WORD BOUNDARY     @02A 12540900
STARPL   DS   CL12                      TRKCALC (STAR) PLIST       @02A 12541400
EXT_IOBE DS    CL(IOBEEND-IOBE)         Stg for IOSDIOBE mapping   @07A 12541500
EIOBEPTR DS   A                         Pointer to EXT_IOBE        @07A 12541600
*********************************************************************** 12541900
*        EXTEND RECOVERY ROUTINE AUDIT TRAIL AREA                       12542400
*        ( MUST BE LAST THING IN WORK AREA, AND MUST END ON A      @P2C 12542900
*          DOUBLE WORD BOUNDARY.  THIS IS BECAUSE IFG0RR0E {DADSM       12544300
*          RECOVERY IN O/C/EOV} CALCULATES THE AUDIT TRAIL AREA         12545700
*          BY GOING TO THE END OF THIS W/A, AND THEN BACKING UP         12547100
*          ON DOUBLEWORD BOUNDARIES.{STRANGE WAY TO DO BUSINESS!})      12548500
*********************************************************************** 12550000
         SPACE 1                                                        12600000
         DS    0D                       ALIGN TO DOUBLE WORD BDY   @02A 12625000
         DS    0D                       ENSURE ALIGNMENT           @P2A 12650000
EXTADTRL DS   10F                       EXTEND AUDIT TRAIL WORDS   @06C 12675000
         AIF   ('&ADT' EQ 'YES').EXT0090                                12700000
         AIF   ('&ADT' EQ 'NO').EXT0100                                 12750000
         IHBERMAC 1001,ADT,&ADT                                         12800000
         AGO   .EXT0100                                                 12850000
.EXT0090 ANOP                                                           12900000
         ORG   EXTADTRL                                                 12950000
         MNOTE '         IECDSECS DSMADT,EXPAND=YES'                    13000000
         IECDSECS DSMADT,EXPAND=YES                                     13050000
.EXT0100 ANOP                                                           13100000
         SPACE 1                                                        13150000
*********************************************************************** 13200000
EXTWAEND EQU   *                        EXTEND WORK AREA END            13250000
EWALNGTH EQU   EXTWAEND-EWTGTBL         WORK AREA LENGTH FOR IECRES GET 13300000
*********************************************************************** 13350000
         GBLC  &IOBE                    Indicator for include      @07A 13358300
         AIF   ('&IOBE' EQ 'YES').DONE1 If IOBE already defined,   @07A 13366600
         IOSDIOBE                       IOSBE mapping              @07A 13374900
&IOBE    SETC 'YES'                     Indicates mapping included @07A 13383200
.DONE1   ANOP                                                      @07A 13391500
         MEND                                                           13400000
*   */                                                                  13450000
* %EXTWAPL2: ;                                                          13500000
* %IF EXT_REQ = 'YES' %THEN %GOTO EXTWAPL3;                             13550000
*/********************************************************************/ 13600000
*/* PL/X VERSION. USED ONLY FOR IPCS.                            @06A*/ 13650000
*/* PLEASE KEEP THIS IN SYNC WITH THE ASSEMBLER VERSION.         @06A*/ 13700000
*/* NOT ALL FIELDS HAVE BEEN MAPPED.  OTHERS MAY NEED TO BE      @06A*/ 13750000
*/* ADDED TO SUPPORT THE IPCS USER EXIT.                         @06A*/ 13800000
*/********************************************************************/ 13850000
*@SPACE;                                                                13900000
*DECLARE                                                                13950000
*    /****************************************************************/ 14000000
*    /* COMMON EXTEND PREFIX                                         */ 14050000
*    /****************************************************************/ 14100000
*   1 EXTPREFX BASED(ADDR(EXTSTART)-32), /* WORK AREA PREFIX         */ 14150000
*    2 *        (8) FIXED(31);                                          14200000
*@SPACE;                                                                14250000
*DECLARE                                                                14300000
*    /****************************************************************/ 14350000
*    /* EXTENDED PREFIX, AND WTG TABLE AREA                          */ 14400000
*    /****************************************************************/ 14450000
*   1 EXTSTART BASED    BDY(DWORD),                                     14500000
*    2 EXTNDWKA,                    /* EXTENDED PREFIX               */ 14550000
*     3 *        (20) FIXED(31),                                        14600000
*    2 EWTGTBL,                     /* DADSM WTG TABLE               */ 14650000
*     3 *        (4) FIXED(31),                                         14700000
*    2 FSDSCB   CHAR(140),          /* F5/F7 INPUT AREA              */ 14750000
*    2 F3DSCB   CHAR(140),          /* F3/F5/F7 WORK AREA            */ 14800000
*    2 *        CHAR(3),            /* RESERVED                      */ 14850000
*    2 FNCCHHR  CHAR(5),            /* FORMAT 'N' DSCB CCHHR         */ 14900000
*    2 FNDSCB   CHAR(140),          /* FN DSCB                       */ 14950000
*    2 F1BUFFER CHAR(140),          /* F1 DSCB                       */ 15000000
*    2 F0BUFFER CHAR(96),           /* F0 DSCB                       */ 15050000
*    2 EREGSAVE (12) FIXED(31)      /* SAVE AREA FOR R2 TO R13       */ 15100000
*                    BDY(WORD),                                         15150000
*    /****************************************************************/ 15200000
*    /* FREE-SPACE PROCESSING EXTENT DESCRIPTOR TABLES               */ 15250000
*    /****************************************************************/ 15300000
*    2 EXTFRI   CHAR(244)               /* FREE-SPACE INPUT EDT      */ 15350000
*               BDY(WORD),                                              15400000
*    2 EXTFRO   CHAR(244)               /* FREE-SPACE OUTPUT EDT     */ 15450000
*               BDY(WORD),                                              15500000
*    /****************************************************************/ 15550000
*    /* WORKAREA USED BY MACRO IGGDADTS                              */ 15600000
*    /****************************************************************/ 15650000
*    2 EXTDTSWA CHAR(40) BDY(WORD),                                     15700000
*    /****************************************************************/ 15750000
*    /* PUSH-DOWN LIST                                               */ 15800000
*    /****************************************************************/ 15850000
*    2 EXTPDL   CHAR(76)                /* PUSH-DOWN LIST EDT        */ 15900000
*               BDY(WORD),                                              15950000
*    /****************************************************************/ 16000000
*    /* ABSOLUTE TRACK ADDRESSES                                     */ 16050000
*    /****************************************************************/ 16100000
*    2 EVTOCADR CHAR(5),                                                16150000
*    2 EDADSMAD CHAR(5),                                                16200000
*    2 F1ADD    CHAR(5),                                                16250000
*    2 LSTF3ADD CHAR(5),                                                16300000
*    2 ECOUNT   CHAR(5),                                                16350000
*    2 COUNT2   CHAR(5),                                                16400000
*    2 ETTRLL   CHAR(5),                                                16450000
*    2 EIDAREA  CHAR(5),                                                16500000
*    2 ENEXTADR CHAR(5),                                                16550000
*    2 EXTCCHHR CHAR(5),                                                16600000
*    2 IDCOUNT  CHAR(4) BDY(WORD),                                      16650000
*    /****************************************************************/ 16700000
*    /* INTERNAL EXTEND SWITCHES                                     */ 16750000
*    /****************************************************************/ 16800000
*    2 ESWITCH  FIXED(8),           /* SWITCH                        */ 16850000
*    2 ESWITCH2 FIXED(8),           /* SWITCH                        */ 16900000
*    2 ESWITCH3 FIXED(8),           /* SWITCH                        */ 16950000
*    2 EDSFLAG  FIXED(8),           /* SWITCH                        */ 17000000
*    2 EDSFLAG2 FIXED(8),           /* SWITCH                        */ 17050000
*    /****************************************************************/ 17100000
*    /* MISCELLANEOUS                                                */ 17150000
*    /****************************************************************/ 17200000
*    2 *    (10) FIXED(31),                                             17250000
*    2 RTAWORK   CHAR(8) BDY(DWORD),/* FOR RTAWORK                   */ 17300000
*    2 NUM_EXTENTS FIXED(8) BDY(DWORD),  /*                          */ 17350000
*    /****************************************************************/ 17400000
*    /* DIAGNOSTIC AND RELATED INFORMATION                           */ 17450000
*    /****************************************************************/ 17500000
*    2 SAVESFID  FIXED(8),          /* SAVE SUBFUNCTION ID           */ 17550000
*    2 EXTDIAG,                     /* DIAGNOSTIC CODE               */ 17600000
*     3 EXTERCD  FIXED(8),          /* ERROR CODE                    */ 17650000
*     3 EXTSFID  FIXED(8),          /* SUBFUNCTION ID                */ 17700000
*     3 EXTSFRT  FIXED(8),          /* SUBFUNCTION RETURN CODE       */ 17750000
*     3 EXTSFRS  FIXED(8),          /* SUBFUNCTION REASON CODE       */ 17800000
*    2 DAEXTPL   CHAR(LENGTH(DAEXT)), /* IGGDAEXT PARAMETER LIST     */ 17850000
*    /****************************************************************/ 17900000
*    /* IGG032DB PARAMETER LIST                                      */ 17950000
*    /****************************************************************/ 18000000
*    2 DEBUGPL  CHAR(LENGTH(DADMP)) BDY(WORD),                          18050000
*    /****************************************************************/ 18100000
*    /* PRE/POST EXIT PARAMETER LIST                                 */ 18150000
*    /****************************************************************/ 18200000
*    2 EXTIEXPL CHAR(LENGTH(IEXPL)) BDY(WORD),                          18250000
*    /****************************************************************/ 18300000
*    /* CVAF PARAMETER LIST                                          */ 18350000
*    /****************************************************************/ 18400000
*    2 EXTCVPL  CHAR(68) BDY(WORD),                                     18450000
*    /****************************************************************/ 18500000
*    /* CVAF BUFFER LIST                                             */ 18550000
*    /****************************************************************/ 18600000
*    2 EXTVLSDT CHAR(LENGTH(VLSDT)),                                    18650000
*    /****************************************************************/ 18700000
*    /* CVAF BUFFER LIST                                             */ 18750000
*    /****************************************************************/ 18800000
*    2 EXTBFHDR CHAR(8) BDY(WORD),                                      18850000
*    2 EXTBFLE  CHAR(12) BDY(WORD),                                     18900000
*    /****************************************************************/ 18950000
*    /* VRF DATA AREA - SEE MACRO IECVRFDA                           */ 19000000
*    /****************************************************************/ 19050000
*    2 EXTVRFDA CHAR(LENGTH(VRFDA) +           /* VRF HEADER         */ 19100000
*                    (2 * LENGTH(VRFF3PTR)) +  /* VRF F3 CCHHRS      */ 19150000
*                    76 + 24)                  /* VRF EDT02 AND EDT01*/ 19200000
*               BDY(WORD),                                              19250000
*    /****************************************************************/ 19300000
*    /* PDSE PARAMETER LIST                                          */ 19350000
*    /****************************************************************/ 19400000
*    2 EPDSEPL   CHAR(LENGTH(PDSEPL)),                                  19450000
*    /***********************************************************@L8A*/ 19500000
*    /*  IOSCAPU PARAMETER LIST (TO CAPTURE AND UNCAPTURE UCBS)  @L8A*/ 19550000
*    /***********************************************************@L8A*/ 19600000
*    2 SAVEUCB  PTR(31),             /* FOR IOSCAPU CALL       /*@L8C*/ 19650000
IOSCAPPL IOSCAPU MF=(L,IOSCAPPA)                               /*@L8C*/ 19700000
         EJECT                                                 /*@L8A*/ 19750000
*                                                              /*@L8A*/ 19800000
*    /****************************************************************/ 19850000
*    /* PARAMETER LIST FOR THE INVOKE SJF SERVICE, IFGGDAJO1,        */ 19900000
*    /* AND ASSOCIATED VARIABLES.                                    */ 19950000
*    /****************************************************************/ 20000000
*    2 KEYRETRV CHAR(1)  BDY(WORD),                                     20050000
*    2 *        CHAR(2),                                                20100000
*    2 AVGREC   FIXED(8),                                               20150000
*    2 DAJ01NAM CHAR(8),                                                20200000
*    2 DAJ01EP  FIXED(31),                                              20250000
*    2 EXTDASJF CHAR(LENGTH(DASJF)),                                    20300000
*    /****************************************************************/ 20350000
*    /* TRKCALC PARAMETER LIST                                       */ 20400000
*    /****************************************************************/ 20450000
*    2 STARPL  CHAR(12) BDY(WORD),                                      20500000
*    /****************************************************************/ 20550000
*    /* AREA FOR IOSDIOBE TO BE BUILT                            @07A*/ 20558300
*    /****************************************************************/ 20566600
*    2 EXT_IOBE CHAR(LENGTH(IOBE)), /* IOBE area (IOSDIOBE)      @07A*/ 20574900
*    2 EIOBEPTR PTR(31),            /* Pointer to IOBEAREA       @07A*/ 20583200
*    /****************************************************************/ 20591500
*    /* COMMON EXTEND   RECOVERY ROUTINE AUDIT TRAIL AREA            */ 20600000
*    /****************************************************************/ 20650000
*    2 EXTADTRL BDY(DWORD),           /* EXTEND AUDIT TRAIL WORDS    */ 20700000
*     3 *       (10) FIXED(31);                                         20750000
*    /****************************************************************/ 20800000
*    /*  VTOC RECOVERY FACILITY DATA AREA (VRFDA) MAPPING.           */ 20850000
*    /****************************************************************/ 20900000
*    % VRFDA_BASE = 'BASED(ADDR(EXTVRFDA))';                            20950000
*    % INCLUDE SYSLIB(IECVRFDA);                                        21000000
*    /****************************************************************/ 21050000
*    /*  PRE/POST EXIT PARAMETER LIST.                               */ 21100000
*    /****************************************************************/ 21150000
*    % IEXPL_BASE = 'BASED(ADDR(EXTIEXPL))';                            21200000
*    % INCLUDE SYSLIB(IECIEXPL);                                        21250000
*    /****************************************************************/ 21300000
*    /*  IGGDAE02 PARAMETER LIST.                               */      21350000
*    /****************************************************************/ 21400000
*    % DAEXT_BASE = 'BASED(ADDR(DAEXTPL))';                             21450000
*    % INCLUDE SYSLIB(IGGDAEXT);                                        21500000
*    /****************************************************************/ 21550000
*    /*  IGGDADMP PARAMETER LIST.                               */      21600000
*    /****************************************************************/ 21650000
*    % DADMBASE = 'BASED(ADDR(DEBUGPL))';                               21700000
*    % INCLUDE SYSLIB(IGGDADMP);                                        21750000
*    /****************************************************************/ 21800000
*    /*  ICVVLSDT PARAMETER LIST.                               */      21850000
*    /****************************************************************/ 21900000
*    % VLSDT_BASE = 'ADDR(EXTVLSDT)';                                   21950000
*    % INCLUDE SYSLIB(ICVVLSDT);                                        22000000
*    /****************************************************************/ 22050000
*    /*  IGGDASJF PARAMETER LIST.                               */      22100000
*    /****************************************************************/ 22150000
*    % DASJF_BASE = 'BASED(ADDR(EXTDASJF))';                            22200000
*    % INCLUDE SYSLIB(IGGDASJF);                                        22250000
*    /****************************************************************/ 22300000
*    /*  IECEXIPD PARAMETER LIST.  PDSE PLIST                   */      22350000
*    /****************************************************************/ 22400000
*    % INCLUDE SYSLIB(IECEXIPD);                                        22450000
*    /****************************************************************/ 22500000
*    /*  IOSDIOBE mapping for use with EXCP                      @07A*/ 22550000
*    /****************************************************************/ 22600000
*    %IOBEBASE = 'BASED(IOBEPTR)';                          /*   @07A*/ 22650000
*    %INCLUDE SYSLIB(IOSDIOBE);                             /*   @07A*/ 22700000
