         MACRO                                                          00050000
&LABEL   IECLSPWA &EP,&F4,&D1=(0),&ADT=NO                               00093700
.**** START OF SPECIFICATIONS ***************************************** 00137400
.*                                                                      00181100
.*$MAC(IECLSPWA):     DADSM LSPACE WORK AREA ADDRESSING MACRO           00224800
.*                                                                      00268500
.* DESCRIPTIVE NAME = DADSM LSPACE WORK AREA ADDRESSING MACRO           00312200
.*                                                                      00355900
.*PROPRIETARY V3 STATEMENT                                              00399600
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00443300
.*"RESTRICTED MATERIALS OF IBM"                                         00487000
.*5695-DF1                                                              00530700
.*(C) COPYRIGHT 1991  IBM CORP.                                         00574400
.*END PROPRIETARY V3 STATEMENT                                          00618100
.*                                                                      00661800
.* STATUS = DFSMS/MVS  1.6.0                                       @L5C 00705500
.*                                                                      00749200
.* FUNCTION = DADSM LSPACE MACRO WHICH PROVIDES ADDRESSABILITY          00792900
.*            TO THE 552 DECIMAL BYTE WORK AREA (NOT INCLUDING THE @L2C 00836600
.*            8 WORD PREFIX OR THE 8 WORD RECOVERY ROUTINE         @L4C 00880300
.*            PARAMETER LIST) USED BY LSPACE.                           00924000
.*                                                                      00967700
.* NOTES = THIS MACRO IS AN INTERNAL MACRO USED IN THE FOLLOWING        01011400
.*         DADSM FUNCTIONS:                                             01055100
.*                                                                      01098800
.*             LSPACE                                                   01142500
.*                                                                      01186200
.*         TO REFERENCE THIS WORK AREA WITHIN THE FUNCTIONS LISTED      01229900
.*         ABOVE, CODE A USING STATEMENT ON THE LABEL 'LSPACWKA'.       01273600
.*                                                                      01317300
.*      DEPENDENCIES = THIS MACRO IS DESIGNED TO BE USED OPTIONALLY     01361000
.*                     WITH THE IECSDSL1 DSCB MAPPING MACRO, THE        01404700
.*                     PREFX MACRO (DEFINED IN THE IECDSECS MACRO)      01448400
.*                     WHICH DEFINES THE 8 WORD WORK AREA PREFIX,       01492100
.*                     THE 20 WORD EXTENDED WORK AREA PREFIX, AND       01535800
.*                     THE 4 WORD DADSM WTG TABLE, AND THE DSMADT       01579500
.*                     MACRO (ALSO DEFINED IN THE IECDSECS MACRO)       01623200
.*                     WHICH DEFINES THE 8 WORD DADSM AUDIT TRAIL. @L4C 01666900
.*                                                                      01710600
.*      RESTRICTIONS = NONE                                             01754300
.*                                                                      01798000
.*      REGISTER CONVENTIONS = NOT APPLICABLE                           01841700
.*                                                                      01885400
.* PATCH LABEL = NOT APPLICABLE                                         01929100
.*                                                                      01972800
.* MODULE TYPE = MACRO                                                  02016500
.*                                                                      02060200
.*      PROCESSOR = ASSEMBLER LANGUAGE                                  02103900
.*                                                                      02147600
.*      MODULE SIZE = 548 DECIMAL BYTES (NOT INCLUDING THE PREFIX) @L2C 02191300
.*                                                                      02235000
.*      ATTRIBUTES = NOT APPLICABLE                                     02278700
.*                                                                      02322400
.* ENTRY POINT = LSPPREFX                                               02366100
.*                                                                      02409800
.*      PURPOSE = THIS MACRO IS CALLED AT ASSEMBLY TIME BY THE          02453500
.*                FUNCTIONS LISTED UNDER 'NOTES' TO EXPAND THE          02497200
.*                LSPACE WORK AREA.                                     02540900
.*                                                                      02584600
.*      LINKAGE =                                                       02628300
.*                                                                      02672000
.*                LABEL IECLSPWA EP,F4,D1=(N),ADT=YES                   02715700
.*                                                                      02759400
.*      INPUT =                                                         02803100
.*                                                                      02846800
.*                OPTIONAL LABEL SPECIFIED AS AN ACCEPTABLE ASSEMBLER   02890500
.*                LABEL WHICH CAN BE USED BY THE CALLING CSECT TO       02934200
.*                ESTABLISH ADDRESSABILITY TO THE ENTIRE WORK AREA.     02977900
.*                                                                      03021600
.*                EP IS THE FIRST POSITIONAL PARAMETER, SPECIFYING      03065300
.*                THAT THE LABELS FOR EACH OF THE FIELDS IN THE 8       03109000
.*                WORD PREFIX, THE 20 WORD EXTENDED PREFIX, AND THE 4   03152700
.*                WORD DADSM WTG TABLE ARE TO BE EXPANDED.  IF THESE    03196400
.*                FIELDS ARE NOT TO BE DEFINED, A COMMA MUST BE CODED   03240100
.*                TO INDICATE THE ABSENCE OF THIS PARAMETER.            03283800
.*                                                                      03327500
.*                F4 IS THE SECOND POSITIONAL PARAMETER, SPECIFYING     03371200
.*                THAT THE FIELDS OF THE FORMAT 4 DSCB ARE TO BE        03414900
.*                EXPANDED USING THE IECSDSL1 DSCB MAPPING MACRO.       03458600
.*                IF THESE FIELDS ARE NOT TO BE DEFINED AND A           03502300
.*                KEYWORD PARAMETER FOLLOWS, A COMMA MUST BE            03546000
.*                CODED TO INDICATE THE ABSENCE OF THIS PARAMETER.      03589700
.*                                                                      03633400
.*                D1=(N) IS A KEYWORD PARAMETER THAT SPECIFIES THE      03677100
.*                FORMAT(S) OF THE DSCB(S) TO BE EXPANDED IN THE        03720800
.*                140 BYTE DSCB AREA, USING THE IECSDSL1 MACRO.         03764500
.*                N CAN BE A NUMBER FROM 0 - 6.  IF N IS 0 OR 4 OR      03808200
.*                IF THIS KEYWORD IS OMITTED, NO LABELS ARE EXPANDED.   03851900
.*                IF N IS 1, 2, 3, 5, OR 6, THE CORRESPONDING FORMAT    03895600
.*                OF THE DSCB WILL BE EXPANDED.  MORE THAN ONE DSCB     03939300
.*                FORMAT CAN BE MAPPED IN THE 140 BYTE DSCB AREA        03983000
.*                BY SEPARATING THE FORMAT NUMBERS BY COMMAS.           04026700
.*                                                                      04070400
.*                ADT=YES IS A KEYWORD PARAMETER WHICH SPECIFIES THAT   04114100
.*                THE LABELS FOR EACH OF THE FIELDS WITHIN THE 8   @L4C 04157800
.*                WORD DADSM AUDIT TRAIL ARE TO BE EXPANDED.            04201500
.*                                                                      04245200
.*      OUTPUT = DADSM LSPACE WORK AREA EXPANSION                       04288900
.*                                                                      04332600
.* EXIT-NORMAL = MEND STATEMENT                                         04376300
.*                                                                      04420000
.* EXIT-ERROR = ERROR MESSAGES:                                         04463700
.*                                                                      04507400
.*      MNOTE 12,***  IHB002 INVALID EP OPERAND SPECIFIED-&EP           04551100
.*      MNOTE 12,***  IHB002 INVALID F4 OPERAND SPECIFIED-&F4           04594800
.*      MNOTE 12,***  IHB002 INVALID ADT OPERAND SPECIFIED-&ADT         04638500
.*                                                                      04682200
.*      THE MACRO EXPANSION CONTINUES AS IF THE INVALID PARAMETER       04725900
.*      WERE NOT SPECIFIED.                                             04769600
.*                                                                      04813300
.* EXTERNAL REFERENCES = NONE                                           04857000
.*                                                                      04900700
.*      ROUTINES = NONE                                                 04944400
.*                                                                      04988100
.*      DATA AREAS = LSPACE WORK AREA                                   05031800
.*                                                                      05075500
.*      CONTROL BLOCKS = DSCB, ECB, IOB, DCB, DEB                       05119200
.*                                                                      05162900
.* TABLES = NONE                                                        05206600
.*                                                                      05250300
.* MACROS = IECDSECS DSMADT                                             05294000
.*          IECDSECS PREFX                                              05337700
.*          IECSDSL1                                                    05381400
.*          IHBERMAC                                                    05425100
.*          ICVAFPL                                                @L1A 05468800
.*          ICVAFBFL                                               @L1A 05512500
.*          ICVEDT02                                               @P4A 05556200
.*          IOSCAPU                  UCB CAPTURE                   @L5A 05599900
.*                                                                      05687300
.* CHANGE ACTIVITY =                                                    05731000
.*$L1=IXVTOC,JDM1134,T790227,STLCLM: INDEX VTOC                    @L1A 05774700
.*$L2=MVS/XA,HDP2230,T85007,STLMC:   DADSM VSCR                    @L2A 05818400
.*$L3=MVS/XA,HDP2230,T85248,STLMC:   SUPPORT THE ISMF VOLUME APPL  @L3A 05862100
.*$01=OY19881,HDP3320,T88222,STLMD:  ADD EXPANDED MESSAGE AREA     @01A 05905800
.*$02=OY34263,HDP3330,T90233,SJPLCBS: BYPASS I/O ERROR DUMPS       @02A 05949500
.*$L4=DYNAMIC,HDP3330,T890828,SJPLJDY: DYNAMIC I/O CONFIGURATION   @L4A 05993200
.*$P1=KC10879,HDP3330,T900921,SJPLJDY: ENSURE DSMADT ALIGNMENT     @P1A 06036900
.*$P2=KC11154,HDP3330,T901125,SJPLJDY: ADD SUPPORT FOR UCB COPIES  @P2A 06080600
.*$P3=KC11183,HDP3330,T901129,SJPLJDY: FIX ALIGNMENT OF LSPIDATA   @P3A 06124300
.*$P4=GT64KTR,JDZ1110,T920506,SJPLDIW: >64K TRACK DEVICE SUPPORT   @P4A 06168000
.*$03=OW06564,JDZ1110,940815,SJPLRAT: ASSY ERRORS (ICVEDT02)       @03A 06211700
.*$04=OW16158,HDZ11C0,951006,SJPLJEB: DUMP BROKEN VTOC             @04A 06255400
.*                                    (LSPACE CHANGES TO IX PATH)  @04A 06299100
.*$06=OW47585,HDZ11F0,01JAN02,SJPLJBC: Remove IOSDIOBE             @06A 06319090
.*$L6=OW48527,HDZ11F0,01MAR08,SJPLJBC: TIMEOUT SUPPORT             @L6A 06329080
.*                                                                      06342800
.**** END OF SPECIFICATIONS ******************************************* 06386500
.*                                                                      06433200
         LCLA  &C                                                       06450000
&LABEL   DSECT                                                          06500000
*********************************************************************** 06550000
*                                                                       06600000
*        LSPACE WORK AREA                                               06650000
*                                                                       06700000
*********************************************************************** 06750000
         SPACE 1                                                        06800000
*********************************************************************** 06850000
*        PREFIX, EXTENDED PREFIX, AND WTG TABLE AREA                    06900000
*********************************************************************** 06950000
         SPACE 1                                                        07000000
LSPPREFX DS    8F                       WORK AREA PREFIX                07050000
LSPACWKA DS    20F                      EXTENDED PREFIX                 07100000
FIRST    EQU   LSPACWKA                                                 07150000
LSPWTGTB DS    4F                       DADSM WTG TABLE            @L3C 07200000
         AIF   ('&EP' EQ 'EP').LSP0010                                  07250000
         AIF   ('&EP' EQ '').LSP0020                                    07300000
         IHBERMAC 1001,EP,&EP                                           07350000
         AGO   .LSP0020                                                 07400000
.LSP0010 ANOP                                                           07450000
         ORG   LSPPREFX                                                 07500000
*        IECDSECS PREFX,EXPAND=YES                                      07550000
         IECDSECS PREFX,EXPAND=YES                                      07600000
.LSP0020 ANOP                                                           07650000
         SPACE 1                                                        07700000
*********************************************************************** 07750000
*        FORMAT 4 DSCB AREA                                             07800000
*********************************************************************** 07850000
         SPACE 1                                                        07900000
DSCBF4   DS    XL96                     FORMAT 4 DSCB              @L3C 07942800
DSCBF4LN EQU   *-DSCBF4                 LENGHT OF FORMAT 4 DSCB    @L3A 07985600
ENQAREA  EQU   DSCBF4+4                 ENQ PARAMETER LIST         @L3C 08028400
.*                                                                 @L3D 08071200
         AIF   ('&F4' EQ 'F4').LSP0030                                  08114000
         AIF   ('&F4' EQ '').LSP0040                                    08156800
         IHBERMAC 1001,F4,&F4                                           08200000
         AGO   .LSP0040                                                 08250000
.LSP0030 ANOP                                                           08300000
         ORG   DSCBF4                                              @L3C 08350000
*        IECSDSL1 (4)                                                   08400000
         IECSDSL1 (4)                                                   08450000
.LSP0040 ANOP                                                           08500000
         SPACE 1                                                        08550000
*********************************************************************** 08600000
*        140-BYTE DSCB AREA                                             08650000
*********************************************************************** 08700000
         SPACE 1                                                        08750000
DSCBF5   DS    XL140                    140-BYTE DSCB AREA              08800000
&C       SETA  1                                                        08850000
.LSP0050 AIF   (&C GT N'&D1).LSP0060                                    08900000
         AIF   (&D1(&C) EQ 0 OR &D1(&C) EQ 4).LSP0055                   08950000
         ORG   DSCBF5                                                   09000000
         MNOTE '         IECSDSL1 (&D1(&C))'                            09050000
         IECSDSL1 (&D1(&C))                                             09100000
.LSP0055 ANOP                                                           09150000
&C       SETA  &C+1                                                     09200000
         AGO   .LSP0050                                                 09214200
.LSP0060 ANOP                                                           09228400
         SPACE 1                                                        09242600
DSCBF7   DS    0H                                                       09256800
         ICVEDT02 DSECT=NO,ENTRY=80                                     09271000
&LABEL   DSECT                                                     @03A 09285200
*********************************************************************** 09299400
*        LSPACE INTERNAL DEB/DCB AREA                                   09313600
*********************************************************************** 09327800
         SPACE 1                                                        09342000
DEB      DS    12F                      DEB                             09356200
DEBPTR   DS    F                        DCB POINTER TO DEB              09370400
DCB      EQU   DEBPTR-44                DCB                             09384600
         SPACE 1                                                        09400000
*********************************************************************** 09402600
*        LSPACE CHANNEL CONTROL WORDS AREA                              09405200
*********************************************************************** 09407800
         SPACE 1                                                        09410400
CCW0     DS    D                                                   @L3M 09416400
CCW1     DS    D                                                   @L3M 09422400
CCW2     DS    D                                                   @L3M 09428400
CCW3     DS    D                                                   @L3M 09434400
CCW4     DS    D                                                   @L3M 09440400
         SPACE 1                                                        09446800
*********************************************************************** 09447800
*        LSPACE CONVERSION AREA                                         09448800
*********************************************************************** 09450000
         SPACE 1                                                        09458100
CNVWORKA DS    D                        CONVERSION WORK AREA       @L3C 09466200
         SPACE 1                                                        09474300
*********************************************************************** 09482500
*        LSPACE INTERNAL ECB/IOB AREA                                   09516200
*********************************************************************** 09550000
         SPACE 1                                                        09600000
*        NEXT TWO VARIABLES MUST BE CONTIGUOUS                     @L3A 09642700
IOB      DS    8F                       IOB                             09685400
IOBSEEK  DS    D                        DIRECT ACCESS ADDRESS      @L3M 09728100
ECB      DS    F                        ECB                             09770800
         SPACE 1                                                        09813500
*********************************************************************** 09856200
*        LSPACE INTERNAL FLAG BYTES                                     09898900
*********************************************************************** 09941600
         SPACE 1                                                        09984300
LSPFLAG1 DS    XL1                      LSPACE FLAG BYTE           @L3C 10027000
CALLAUTH EQU   X'80'                    AUTHORIZED CALLER          @L3A 10069700
CALL24BT EQU   X'40'                    24-BIT ADDR MODE CALLER    @L3A 10112400
CALLPLST EQU   X'20'                    PARAMETER LIST INTERFACE   @L3A 10155100
INFOAREA EQU   X'10'                    INFO RETURN AREA SPECIFIED @L3A 10197800
FMT4AREA EQU   X'08'                    FMT4 RETURN AREA SPECIFIED @L3A 10240500
IXVTOC   EQU   X'04'                    INDEXED VTOC               @L3C 10283200
IOERROR  EQU   X'02'                    I/O ERROR OCCURED          @02A 10325900
LUCBCAP  EQU   X'01'                    UCB IS CAPTURED            @L5A 10368600
*                                                                       10411300
         DS    XL1                      RESERVED                   @L3A 10454000
LSPERMSG DS    XL1                      ERROR MESSAGE CODE         @L3A 10496700
LSPMSG1  EQU   X'01'                    INVALID PARAMETER          @L3A 10539400
LSPMSG2  EQU   X'02'                    NOT A DIRECT ACCESS DEVICE @L3A 10582100
LSPMSG3  EQU   X'03'                    UCBVTOC IS ZERO            @L3A 10624800
LSPMSG4  EQU   X'04'                    UCB NOT READY              @L3A 10667500
LSPMSG5  EQU   X'05'                    PERMANENT I/O ERROR        @L3A 10710200
LSPMSG6  EQU   X'06'                    NON-STANDARD OS VOLUME     @L3A 10752900
LSPMSG7  EQU   X'07'                    I/O TIMEOUT ERROR          @L6A 10772890
*                                                                       10795600
         DS    XL1                      RESERVED                   @L3A 10838300
         SPACE 1                                                        10881000
*********************************************************************** 10923700
*        LSPACE WORK AREA FIELDS                                        10966400
*********************************************************************** 11009100
         SPACE 1                                                        11051800
.*                                                                 @L3D 11094500
TCBADDR  DS    F                        TCB ADDRESS                @L3C 11137200
PARMADDR DS    F                        REGISTER ONE PARAMETER     @L3C 11179900
RETNADDR DS    F                        RETURN ADDRESS             @L3A 11222600
EXLOGSUM DS    F                        RETURN ADDRESS             @L3A 11265300
*******************************************************************@L5A 11308000
*        IOSCAPU PARAMETER LIST (TO CAPTURE AND UNCAPTURE UCBS)    @L5A 11350700
*******************************************************************@L5A 11393400
SAVEUCB  DS   A                         FOR IOSCAPU CALL           @L5C 11436100
IOSCAPPL IOSCAPU MF=(L,IOSCAPPA)                                   @L5C 11478800
         EJECT                                                     @L5A 11521500
*                                                                  @L5A 11564200
         DS    F                        RESERVED                   @L2A 11606900
MJELNAME DS    CL8                      MAJOR ELEMENT ENQ NAME          11649600
MIELNAME DS    CL6                      MINOR ELEMENT ENQ NAME          11692300
.*                                                                 @L3D 11735000
RPSTHETA DS    XL1                      SECTOR VALUE FOR RPS DEVICE@L3C 11777700
LSPUCBID DS    XL1                      COPY OF THE UCBID FIELD    @P2A 11820400
LSPUCBCH DS    XL2                      COPY OF THE UCB CHAN FIELD @P2A 11863100
.*                                                                 @L3D 11905800
         SPACE 1                                                        11950000
*********************************************************************** 12000000
*        ABSOLUTE TRACK ADDRESSES                                       12050000
*********************************************************************** 12100000
         SPACE 1                                                        12150000
VTOCADDR DS    XL5                      FORMAT 4 CCHHR             @L3C 12154200
         SPACE 1                                                        12158400
*********************************************************************** 12162600
*        FREE SPACE AND VOLUME DATA                                     12162700
*********************************************************************** 12162800
         SPACE 1                                                        12162900
         DS    0F                       CORRECT WORD ALIGNMENT     @P3A 12163000
LSPIDATA DS    0XL66                    START OF DATA              @01C 12163100
LSPIRETN DS    XL1                      RETURN AREA STATUS         @L3A 12163200
LSPISTAT DS    XL1                      STATUS                     @L3A 12163300
         DS    XL2                      RESERVED                   @L3A 12163400
LSPINEXT DS    0F                       NUM OF FREE EXTENTS        @P4A 12163500
LSPRNEXT DS    H                        RESERVE FOR FREE EXTENTS   @P4A 12163600
LSPNNEXT DS    H                        # OF FREE EXTENTS          @P4A 12163700
LSPITCYL DS    0F                       TOTAL FREE CYLINDERS       @P4A 12163800
LSPRTCYL DS    H                        RESERVE FOR FREE CYLINDERS @P4A 12163900
LSPNTCYL DS    H                        # OF FREE CYLINDERS        @P4A 12164000
LSPITTRK DS    0F                       TOTAL ADDL FREE TRKS       @P4A 12164100
LSPRTTRK DS    H                        RESERVE FOR ADDL FREE TRKS @P4A 12164200
LSPNTTRK DS    H                        # OF FREE TRKS             @P4A 12164300
LSPILCYL DS    0F                       NUM CYLINDERS IN           @P4A 12164400
LSPRLCYL DS    H                        RESERVE FOR FREE CYLINDERS @P4A 12164500
LSPNLCYL DS    H                        NUM FREE CYLINDERS IN      @P4A 12164600
LSPILTRK DS    0F                       NUM ADDL TRACKS IN         @P4A 12164700
LSPRLTRK DS    H                        RESERVE FOR ADDL TRKS      @P4A 12164800
LSPNLTRK DS    H                        NUM ADDL FREE TRKS IN      @P4A 12164900
LSPIF0S  DS    F                        FORMAT 0 DSCB COUNT        @L3A 12165000
LSPIVIRS DS    F                        FREE VIR COUNT             @L3A 12165100
LSPIFRAG DS    F                        FRAGMENTATION INDEX        @L3A 12165200
         SPACE 1                                                   @L3A 12165300
*********************************************************************** 12165400
*  FIELDS FOR THE EXPANDED MESSAGE AREA                            @01A 12165500
*********************************************************************** 12165600
LSPIENXT DS    XL6                      EXPANDED FREE EXTENTS      @01A 12165700
LSPIETCY DS    XL6                      EXPANDED TOTAL FREE CYLS   @01A 12165800
LSPIETAT DS    XL6                      EXPANDED TOT ADDL FREE TKS @01A 12165900
LSPIELCY DS    XL6                      EXPANDED NUM CYLINDERS IN  @01A 12166000
LSPIELTK DS    XL6                      EXPANDED NUM ADDL TRKS IN  @01A 12166100
         SPACE 1                                                   @01A 12166200
*********************************************************************** 12166300
*        PROTECTED COPY OF PARAMETER LIST                          @L3A 12166400
*********************************************************************** 12166500
         SPACE 1                                                   @L3A 12166600
         DS    0D                                                  @01A 12166700
LSPIPARM DS    0XL24                    START OF PARAMETER LIST    @L3A 12166800
         DS    XL6                                                 @L3A 12166900
LSPIFLG1 DS    XL1                      PARAMETER LIST FLAG        @L3A 12167000
LSPIXTIM DS    XL1                      TIMEOUT VALUE              @L6A 12167100
LSPIDIAG DS    0F                       DIAGNOSTIC INFORMATION     @L3A 12167200
LSPIERCD DS    XL1                      LSPACE RETURN CODE         @L3A 12167300
LSPISFID DS    XL1                      SUBFUNCTION ID             @L3A 12167400
LSPISFRT DS    XL1                      SUBFUNCTION RETURN CODE    @L3A 12167500
LSPISFRS DS    XL1                      SUBFUNCTION REASON CODE    @L3A 12167600
LSPIUCB  DS    A                        UCB ADDRESS                @L3A 12167700
LSPIFRSP DS    A                        INFORMATION RETURN AREA    @L3A 12167800
LSPIFMT4 DS    A                        FMT4 RETURN AREA           @L3A 12167900
         SPACE 1                                                   @L1A 12168000
*********************************************************************** 12168100
*        CVAF PARAMETER LIST AND BUFFER LIST FOR INDEXED VTOC      @L1A 12168200
*        PROCESSING                                                @L1A 12168300
*********************************************************************** 12171000
         SPACE 1                                                   @L1A 12182400
CVPLWA   ICVAFPL DSECT=NO                                          @L1A 12193800
BUFLWA   ICVAFBFL DSECT=NO                                         @L1A 12205200
         UCBPIN MF=(L,PINLIST)          UCBPIN PARAMETER LIST      @L4A 12216600
         UCBLOOK MF=(L,LOOKLIST)        UCBLOOK PARAMETER LIST     @P2A 12228000
.*                                                                 @L3D 12239400
         SPACE 1                                                        12250800
         EJECT                                                          12262200
*******************************************************************@04A 12273600
*        IGGDADMP      PARAMETER LIST                              @04A 12285000
*******************************************************************@04A 12296400
*        IGGDADMP                       EXPAND SDUMP PARM LIST     @04A 12307800
DEBUGPL  IGGDADMP                                                  @04A 12319200
         EJECT                                                          12330600
*********************************************************************** 12343200
*        LSPACE RECOVERY ROUTINE AUDIT TRAIL AREA                       12357400
*        ( MUST BE LAST THING IN WORK AREA, AND MUST END ON A      @P1C 12371600
*          DOUBLE WORD BOUNDARY )                                  @P1A 12385800
*********************************************************************** 12400000
         SPACE 1                                                        12450000
         DS    0D                       ENSURE ALIGNMENT           @P1A 12490000
LSPADTRL DS   10F                       LSPACE AUDIT TRAIL WORDS   @04C 12530000
         AIF   ('&ADT' EQ 'YES').LSP0090                                12570000
         AIF   ('&ADT' EQ 'NO').LSP0100                                 12610000
         IHBERMAC 1001,ADT,&ADT                                         12650000
         AGO   .LSP0100                                                 12700000
.LSP0090 ANOP                                                           12750000
         ORG   LSPADTRL                                                 12800000
*        IECDSECS DSMADT,EXPAND=YES                                     12850000
         IECDSECS DSMADT,EXPAND=YES                                     12900000
.LSP0100 ANOP                                                           12950000
         SPACE 1                                                        13000000
*********************************************************************** 13050000
LSPWAEND EQU   *                        LSPACE WORK AREA END            13100000
LWALNGTH EQU   LSPWAEND-LSPWTGTB        WORK AREA LENGTH           @L3C 13150000
*********************************************************************** 13200000
         MEND                                                           13250000
