*%GOTO PDSCBPLS;                        /*  GO TO THE PL/S VERSION      00025000
         MACRO                                                          00050000
         IECPDSCB                                                       00100000
.*** START OF SPECIFICATIONS ****************************************** 00150000
.*                                                                    * 00200000
.*$MAC(IECPDSCB): PARTIAL DSCB MAPPING MACRO                          * 00250000
.*                                                                    * 00300000
.*DESCRIPTIVE NAME = PARTIAL DSCB MAPPING MACRO                       * 00350000
.*                                                                    * 00400000
*/*PROPRIETARY V3 STATEMENT                                          */ 00425000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00450000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00475000
*/*5695-DF1                                                          */ 00500000
*/*(C) COPYRIGHT 1984,1989  IBM CORP.                                */ 00533300
*/*END PROPRIETARY V3 STATEMENT                                      */ 00566600
.*                                                                    * 00600000
.* STATUS: DFSMS/MVS 1.2.0                                        @L6C* 00650000
.*                                                                    * 00700000
.*FUNCTION = MAP THE PARTIAL DSCB OVER THE INFMJFCB FIELD OF THE      * 00750000
.*           JFCB.  THE PARTIAL DSCB IS PASSED TO ALLOCATE BY         * 00800000
.*           UTILITIES SUCH AS IEHMOVE AND DF/DSS.                    * 00850000
.*                                                                    * 00900000
.*MODULE-TYPE = MACRO                                                 * 00950000
.*                                                                    * 01000000
.*PROCESSOR = ASSEMBLER OR PLS                                        * 01050000
.*                                                                    * 01100000
.*ATTRIBUTES = MAPPING MACRO                                          * 01150000
.*                                                                    * 01200000
.*ENTRY-POINT = MACRO STATEMENT                                       * 01250000
.*                                                                    * 01300000
.*INPUT = PLS -- MACRO VARIABLE PDSCBJFB MAY BE SPECIFIED --          * 01316600
.*               IF PDSCBJFB = 'YES' THEN                             * 01333200
.*                 DCL IECPDSCB BASED(ADDR(INFMJFCB)),                * 01349800
.*               ELSE                                                 * 01366400
.*                 DCL IECPDSCB BASED(PDSCBPTR),                      * 01383000
.*                                                                    * 01400000
.*OUTPUT = MAPPING OF A PARTIAL DSCB                                  * 01450000
.*                                                                    * 01500000
.*EXIT = MEND STATEMENT                                               * 01550000
.*                                                                    * 01600000
.*EXTERNAL-REFERENCES = NONE                                          * 01650000
.*                                                                    * 01700000
.*TABLES = NONE                                                       * 01750000
.*                                                                    * 01800000
.*MACROS = NONE                                                       * 01850000
.*                                                                    * 01900000
.*CHANGE-ACTIVITY =                                                     01950000
.*                                                                    * 02000000
.*$L0=MVS/XA,JDP1111,,STLBS:   MAPPING MACRO OF PARTIAL DSCB       @L0A 02020000
.*$P1=MVS/XA,HDP2210,,STLAM:   ADD/CHANGE COMMENTS                 @P1A 02040000
.*$01=OZ97926,HDP2210,,STLAM:  ADD PLS MAPPING                     @01A 02060000
.*$L1=MVS/XA,HDP3310,T85304,STLMC: DADSM SUPPORT FOR SMS           @L1A 02080000
.*$P2=KJA0756,HDP3310,T85294,STLKAA: COMPACT SAVED SECONDARY QTY   @P2A 02090000
.*$P3=KJB3389,HDP3310,T87201,STLKAA: ADD SYSTEM DETERMINED BLKSIZE      02093300
.*                                   FLAG                          @P3A 02096600
.*$L2=PDSE,HDP3320,T87201,STLKAA:  PDSE DATA SET SUPPORT           @L2A 02098300
.*$P4=KJB3529,HDP3310,T87251,STLKAA: CLARIFY UNCATALOGED BIT       @P4A 02099100
.*$P5=KET1799,HDP3320,T89044,STLKSC: CHANGE TO PD1PDSE             @P5A 02099500
.*$02=OY33693,HDP3330,T90281,SJPLKSC: PDPRIQTY & PDDIRQTY CONTAIN  @02A 02099600
.*                                    GARBAGE WHEN IGGPRE00 CALLED.@02A 02099700
.*$L3=STRIPE,JDZ1110,T911003,SJPLRPS: EXTENDED SEQUENTIAL SUPPORT  @L3A 02106400
.*$L4=POSIX,JDZ1110,T920117,SJPLRPS:  HFS DATA SET SUPPORT         @L4A 02113100
.*$L5=EXTATTR,JDZ1110,T920910,SJPLRPS: EXTENDED ATTRIBUTE SUPPORT  @L5A 02119800
.*$L6=COMPRESS,HDZ11B0,93MAY18,SJPLRG: EXTENDED FORMAT SUPPORT     @L6A 02126500
.*$03=OW00735,HDZ11B0,93AUG09,SJPLGEC: ADD CPOIT BIT               @03A 02129900
.*$04=OW02328,HDZ11B0,94FEB08,SJPLRPS: OW00735 regressed compr bit @04A 02131600
.*                                                                    * 02133300
.*** END OF SPECIFICATIONS ******************************************** 02150000
.*                                                                    * 02200000
*********************************************************************** 02250000
***                 PARTIAL DSCB MAPPED OVER THE JFCB               *** 02300000
*********************************************************************** 02350000
*                                                                       02400000
         ORG   INFMJFCB                                                 02450000
PD1DSNAM DS    CL44                DATA SET NAME                        02500000
PD1FMTID DS    CL1                 FORMAT IDENTIFIER (X'F1')       @P1C 02550000
PD1DSSN  DS    CL6                 DATA SET SERIAL NUMBER               02600000
*                                     (IDENTIFIES THE FIRST OR     @P1A 02620000
*                                      ONLY VOLUME CONTAINING THE  @P1A 02640000
*                                      DATA SET/SPACE)             @P1A 02660000
PD1VOLSQ DS    XL2                 VOLUME SEQUENCE NUMBER (1-9999) @P1C 02680000
PD1CREDT DS    XL3                 CREATION DATE                        02700000
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 02725000
PD1EXPDT DS    XL3                 EXPIRATION DATE                      02750000
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 02783300
PD1NOEPV DS    XL1                 NUMBER OF DATA EXTENTS ON VOLUME@P1C 02816600
PD1NOBDB DS    XL1                 NUMBER OF BYTES USED IN LAST         02850000
*                                     DIRECTORY BLOCK                   02900000
PD1FLAG1 DS    XL1                 FLAG 1                          @L6A 02925000
PD1COMPR EQU   X'80'  1... ....    COMPRESSABLE EXTENDED FORMAT    @04A 02933300
*                                  (PD1STRP MUST ALSO BE SET)      @04A 02941600
PD1CPOIT EQU   X'40'  .1.. ....    CHECKPOINTED DATASET            @03A 02950000
*                     ..11 1111    RESERVED                        @04C 02975000
PD1SYSCD DS    CL13                SYSTEM CODE                          03000000
PD1REFD  DS    XL3                 DATE LAST REFERENCED            @P1C 03037500
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 03075000
*                                    OR ZERO IF NOT MAINTAINED     @P1C 03112500
PD1SMSFG DS    XL1                 SYSTEM MANAGED STORAGE INDICATORS   X03122200
                                                                   @L1A 03131900
PD1SMSDS EQU   X'80'  1... ....    SYSTEM MANAGED DATA SET         @L1A 03141600
PD1SMSUC EQU   X'40'  .1.. ....    NO BCS ENTRY EXISTS FOR DATA SET    X03151300
                                                                   @P4C 03161000
PD1REBLK EQU   X'20'  ..1. ....    DATA SET MAY BE REBLOCKED       @L1A 03170700
PD1CRSDB EQU   X'10'  ...1 ....    DADSM CREATE ORIGINATED BLKSIZE @P3A 03174500
PD1PDSE  EQU   X'08'  .... 1...    PDSE DATA SET                   @L6C 03176000
PD1STRP  EQU   X'04'  .... .1..    EXTENDED FORMAT DATA SET        @L6C 03177500
PD1PDSEX EQU   X'02'  .... ..1.    HFS DATA SET                    @L6C 03179000
PD1DSAE  EQU   X'01'  .... ...1    EXTENDED ATTRIBUTES EXIST       @L6C 03180500
PD1SCEXT DS    0XL3                SECONDARY SPACE EXTENSION       @L1C 03182300
PD1SCXTF DS    XL1                 SECONDARY SPACE EXTENSION FLAG  @L1C 03184200
PD1SCAVB EQU   X'80'  1... ....    IF 1, PD1SCXTV IS THE ORIGINAL  @L1A 03186100
*                                  AVERAGE BLOCK LENGTH            @L1A 03188000
PD1SCMB  EQU   X'40'  .1.. ....    IF 1, PD1SCXTV IS IN MEGABYTES  @L1A 03189900
PD1SCKB  EQU   X'20'  ..1. ....    IF 1, PD1SCXTV IS IN KILOBYTES  @L1A 03191800
PD1SCUB  EQU   X'10'  ...1 ....    IF 1, PD1SCXTV IS IN BYTES      @L1A 03193700
PD1SCCP1 EQU   X'08'  .... 1...    IF 1, PD1SCXTV HAS BEEN COMPACTED   X03194300
                                   ONCE                            @P2A 03194900
PD1SCCP2 EQU   X'04'  .... .1..    IF 1, PD1SCXTV HAS BEEN COMPACTED   X03195500
                                   TWICE                           @P2A 03196100
*                     .... ..11    RESERVED                        @P2C 03196700
PD1SCXTV DS    XL2                 SECONDARY SPACE EXTENSION VALUE @L1A 03197500
PD1DSORG DS    0XL2                DATA SET ORGANIZATION                03200000
PD1DSRG1 DS    XL1                 BYTE 1 OF DSORG                      03250000
PD1ORGIS EQU   X'80'  1... ....    IS - INDEXED SEQUENTIAL         @P1C 03284600
*                                     ORGANIZATION                 @P1A 03319200
PD1ORGPS EQU   X'40'  .1.. ....    PS - PHYSICAL SEQUENTIAL        @P1C 03353800
*                                     ORGANIZATION                 @P1A 03388400
PD1ORGDA EQU   X'20'  ..1. ....    DA - DIRECT ORGANIZATION        @P1C 03423000
PD1ORGCX EQU   X'10'  ...1 ....    CX - BTAM OR QTAM LINE GROUP    @P1C 03457600
PD1ORGCQ EQU   X'08'  .... 1...    CQ - QTAM DIRECT ACCESS MSG QUE @P1C 03492200
PD1ORGMQ EQU   X'04'  .... .1..    MQ - QTAM PROBLEM PROG MSG QUEUE@P1C 03526800
PD1ORGPO EQU   X'02'  .... ..1.    PO - PARTITIONED ORGANIZATION   @P1C 03561400
PD1ORGU  EQU   X'01'  .... ...1    U - UNMOVABLE, THE DATA SET     @P1C 03596000
*                                     CONTAINS LOCATION DEPENDENT  @P1A 03630600
*                                     INFORMATION                  @P1A 03665200
PD1DSRG2 DS    XL1                 BYTE 2 OF DSORG                      03700000
PD1ORGGS EQU   X'80'  1... ....    GS - GRAPHICS ORGANIZATION      @P1C 03750000
PD1ORGTX EQU   X'40'  .1.. ....    TX - TCAM LINE GROUP            @P1C 03800000
PD1ORGTQ EQU   X'20'  ..1. ....    TQ - TCAM MESSAGE QUEUE         @P1C 03850000
*                     ...1 ....    RESERVED                        @P1C 03900000
PD1ORGAM EQU   X'08'  .... 1...    AM - VSAM DATA SET/SPACE        @P1C 03950000
PD1ORGTR EQU   X'04'  .... .1..    TR - TCAM 3705                  @P1C 04000000
PD1RSV15 EQU   X'02'  .... ..X.    RESERVED                        @P1C 04050000
PD1RSV16 EQU   X'01'  .... ...X    RESERVED                        @P1C 04100000
PD1RECFM DS    XL1                 RECORD FORMAT                        04150000
*              X'80'  10.. ....    F - FIXED LENGTH                @P1A 04158400
*              X'40'  01.. ....    V - VARIABLE LENGTH             @P1A 04166800
*              X'C0'  11.. ....    U - UNDEFINED LENGTH            @P1A 04175200
*              X'20'  ..1. ....    T - TRACK OVERFLOW              @P1A 04183600
*              X'10'  ...1 ....    B - BLOCKED: MAY NOT OCCUR WITH @P1A 04192000
*                                      UNDEFINED (U).              @P1A 04200400
*              X'08'  .... 1...    FIXED LENGTH: (X'88')           @P1A 04208800
*                                     STANDARD BLOCKS, NO TRUNCATED@P1A 04217200
*                                     BLOCKS OR UNFILLED TRACKS.   @P1A 04225600
*                                  VARIABLE LENGTH: (X'48')        @P1A 04234000
*                                     SPANNED RECORDS.             @P1A 04242400
*              X'04'  .... .10.    ANSI CONTROL CHARACTER          @P1A 04250800
*              X'02'  .... .01.    MACHINE CONTROL CHARACTER       @P1A 04259200
*                     .... .00.    NO CONTROL CHARACTER            @P1A 04267600
*                     .... ...0    ALWAYS ZERO                     @P1A 04276000
PD1OPTCD DS    XL1                 OPTION CODES -- INDICATES THE   @P1C 04284400
*                                     VARIOUS OPTIONS USED IN      @P1C 04292800
*                                     BUILDING THE DATA SET        @P1C 04301200
*                                                                  @P1A 04309600
* BDAM PD1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN PD1ORGDA IS ON) @P1A 04318000
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 04326400
*              X'40'  .1.. ....      - TRACK OVERFLOW              @P1A 04334800
*              X'20'  ..1. ....    E - EXTENDED SEARCH             @P1A 04343200
*              X'10'  ...1 ....    F - FEEDBACK                    @P1A 04351600
*              X'08'  .... 1...    A - ACTUAL ADDRESSING           @P1A 04360000
*              X'04'  .... .1..      - DYNAMIC BUFFERING           @P1A 04368400
*              X'02'  .... ..1.      - READ EXCLUSIVE              @P1A 04376800
*              X'01'  .... ...1    R - RELATIVE BLOCK ADDRESSING   @P1A 04385200
*                                                                  @P1A 04393600
* ISAM PD1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN PD1ORGIS IS ON) @P1A 04402000
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 04410400
*              X'40'  .1.. ....    U - ACCUMULATE TRACK INDEX ENT  @P1A 04418800
*              X'20'  ..1. ....    M - MASTER INDECIES             @P1A 04427200
*              X'10'  ...1 ....    I - INDEPENDENT OVERFLOW AREA   @P1A 04435600
*              X'08'  .... 1...    Y - CYLINDER OVERFLOW AREA      @P1A 04444000
*              X'04'  .... .X..    RESERVED                        @P1A 04452400
*              X'02'  .... ..1.    L - DELETE OPTION               @P1A 04460800
*              X'01'  .... ...1    R - REORGANIZATION CRITERIA     @P1A 04469200
*                                                                  @P1A 04477600
* BPAM/BSAM/QSAM PD1OPTCD FIELD ASSIGNMENTS                        @P1A 04486000
*                   (APPLY ONLY WHEN PD1ORGPO OR PD1ORGPS IS ON)   @P1A 04494400
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 04502800
*              X'40'  .1.. ....    U - ALLOW DATA CHECK (1403 PRTR)@P1A 04511200
*              X'20'  ..1. ....    C - CHAINED SCHEDULING USING PCI@P1A 04519600
*              X'10'  ...1 ....    H - DOS/OS INTERCHANGE FEATURE  @P1A 04528000
*              X'08'  .... 1...    B - TREAT EOF AS EOV (TAPE)     @P1A 04536400
*              X'04'  .... .1..    Z - SEARCH DIRECT               @P1A 04544800
*              X'02'  .... ..1.    T - USER LABEL TOTALING         @P1A 04553200
*              X'01'  .... ...1    J - FOR 3800 PRINTING SUBSYSTEM @P1A 04561600
*                                                                  @P1A 04570000
* VSAM PD1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN PD1ORGAM IS ON) @P1C 04578400
PD1OPTIC EQU   X'80'  1... ....    DATA SET CATALOGED IN ICF CTLG  @P1C 04586800
PD1OPTBC EQU   X'40'  .1.. ....    DATA SET IS ICF CATALOG         @P1C 04595200
PD1OPT3F EQU   X'3F'  ..XX XXXX    RESERVED                        @P1C 04603600
PD1BLKL  DS    XL2                 BLOCK LENGTH (TYPE F RECORDS),  @P1C 04612000
*                                  OR MAX BLKSIZE (U OR V RECORDS) @P1A 04620400
PD1LRECL DS    XL2                 LOGICAL RECORD LENGTH           @P1C 04628800
*                                  FIXED LENGTH: RECORD LENGTH     @P1A 04637200
*                                  UNDEFINED LENGTH: ZERO          @P1A 04645600
*                                  VARIABLE UNSPANNED: MAX REC LEN @P1A 04654000
*                                  VARIABLE SPANNED:               @P1A 04662400
*                                   < 32756 BYTES- MAX REC LEN     @P1A 04670800
*                                   > 32756 BYTES- X'8000'         @P1A 04679200
PD1KEYL  DS    XL1                 KEY LENGTH (0-255)              @P1C 04687600
PD1RKP   DS    XL2                 RELATIVE KEY POSITION                04700000
PD1DSIND DS    XL1                 DATA SET INDICATORS                  04750000
PD1IND80 EQU   X'80'  1... ....    LAST VOLUME ON WHICH THE DATA   @P1C 04787500
*                                     SET RESIDES                  @P1A 04825000
PD1IND40 EQU   X'40'  .1.. ....    DATA SET IS RACF DEFINED        @P1C 04862500
PD1IND20 EQU   X'20'  ..1. ....    BLOCK LENGTH IS A MULTIPLE      @P1C 04900000
*                                     OF 8 BYTES                   @P1A 04937500
PD1IND10 EQU   X'10'  ...1 ....    PASSWORD IS REQUIRED FOR READ   @P1C 04975000
*                                  OR WRITE OR BOTH (SEE PD1IND04) @P1C 05012500
PD1IND08 EQU   X'08'  .... 1...    RESERVED                        @P1C 05050000
PD1IND04 EQU   X'04'  .... .1..    IF PD1IND10 IS 1 THEN           @P1C 05087500
*                                     IF PD1IND04 IS . . .         @P1C 05125000
*                                        1-PASSWORD REQUIRED TO    @P1C 05162500
*                                          WRITE BUT NOT TO READ   @P1C 05200000
*                                        0-PASSWORD REQUIRED TO    @P1C 05237500
*                                          WRITE AND TO READ       @P1C 05275000
PD1IND02 EQU   X'02'  .... ..1.    DATASET OPENED FOR OTHER THAN   @P1C 05312500
*                                  INPUT SINCE LAST BACKUP COPY MADE.   05350000
PD1IND01 EQU   X'01'  .... ...1    SECURE CHECKPOINT DATA SET      @P1C 05400000
PD1SCALO DS    0XL4                SECONDARY ALLOCATION                 05450000
PD1SCAL1 DS    XL1                 SPACE PARAMETERS                     05500000
PD1DSPAC EQU   X'C0'  11.. ....    BIT PATTERN FOR SPACE REQUEST   @P1C 05550000
PD1CYL   EQU   X'C0'  11.. ....    CYLINDER REQUEST                @P1C 05600000
PD1TRK   EQU   X'80'  10.. ....    TRACK REQUEST                   @P1C 05650000
PD1AVR   EQU   X'40'  01.. ....    AVERAGE BLOCK LENGTH REQUEST    @P1C 05700000
PD1AVRND EQU   X'41'  01.. ...1    AVERAGE BLOCK AND ROUND REQUEST @P1C 05750000
PD1MSGP  EQU   X'20'  ..1. ....    MASS STORAGE VOL GROUP (MSVGP)  @P1C 05800000
PD1EXT   EQU   X'10'  ...1 ....    EXTENSION TO SECONDARY SPACE    @L1A 05833300
*                                  DESCRIPTION EXISTS (PD1SCEXT)   @L1A 05866600
PD1CONTG EQU   X'08'  .... 1...    CONTIGUOUS REQUEST              @P1C 05900000
PD1MXIG  EQU   X'04'  .... .1..    MXIG REQUEST                    @P1C 05950000
PD1ALX   EQU   X'02'  .... ..1.    ALX  REQUEST                    @P1C 06000000
PD1ROUND EQU   X'01'  .... ...1    ROUND REQUEST                   @P1C 06050000
PD1DSABS EQU   X'00'  0000 0000    ABSOLUTE TRACK REQUEST          @P1C 06100000
PD1SCAL3 DS    XL3                 SECONDARY ALLOCATION QUANTITY        06150000
PD1LSTAR DS    XL3                 LAST USED TRACK                 @P1C 06183300
*                                     AND BLOCK ON TRACK (TTR)     @P1A 06216600
PD1TRBAL DS    XL2                 BYTES REMAINING ON LAST TRACK USED   06250000
         DS    XL2                 RESERVED                             06300000
PD1EXT1  DS    XL1                 EXTENT TYPE INDICATOR                06350000
PD1ULBL  EQU   X'40'               USER LABEL REQUEST                   06400000
         DS    XL1                 RESERVED                        @02C 06408800
PD1FLG1  DS    XL1                 FLAG BYTE.                      @02A 06417600
PD1PSPAC EQU   X'F8'               PRIMARY SPACE UNITS.            @02A 06426400
*                                  AT MOST ONE OF THESE BITS            06435200
*                                  MAY BE SET.  IF NONE ARE             06444000
*                                  SET, PDPRIQTY IS ASSUMED             06452800
*                                  TO BE IN TRACKS.                     06461600
PD1PCYL  EQU   X'80'               PDPRIQTY IN CYL.                @02A 06470400
PD1PTRK  EQU   X'40'               PDPRIQTY IN TRK.                @02A 06479200
PD1PBLK  EQU   X'20'               PDPRIQTY IN BLOCKS.             @02A 06488000
PD1PMB   EQU   X'10'               PDPRIQTY IN MEGABYTES           @02A 06496800
PD1PKB   EQU   X'08'               PDPRIQTY IN KILOBYTES           @02A 06505600
PD1PRSV1 EQU   X'07'               RESERVED.                       @02A 06514400
*                                                                  @02A 06523200
PDPRIQTY DS    F                   PRIMARY SPACE REQUEST IN UNITS  @02C 06532000
*                                  INDICATED BY PD1PSPAC.          @02A 06540800
PDDIRQTY DS    F                   NUMBER OF DIRECTORY BLOCKS           06550000
         MEND                                                           06600000
******************************************************************** */ 06650000
*%PDSCBPLS: ;                                                           06700000
*%IF PDSCBJFB = 'YES' %THEN %GOTO PDSCBDFT;                             06750000
*DCL 1 IECPDSCB BASED(PDSCBPTR),        /* START OF THE PARTIAL DSCB */ 06800000
*%GOTO PDSCBCMN;                                                        06850000
*%PDSCBDFT: ;                                                           06900000
*DCL 1 IECPDSCB BASED(ADDR(INFMJFCB)),  /* START OF THE PARTIAL DSCB */ 06950000
*%PDSCBCMN: ;                                                           07000000
*        2 PD1DSNAM    CHAR(44),        /* DATA SET NAME             */ 07050000
*        2 PD1FMTID    CHAR(1),         /* FORMAT IDENTIFIER ('F1'X) */ 07100000
*        2 PD1DSSN     CHAR(6),         /* DATA SET SERIAL NUMBER       07150000
*                                          (IDENTIFIES THE FIRST OR     07200000
*                                          ONLY VOLUME CONTAINING       07250000
*                                          THE DATA SET/SPACE)       */ 07300000
*        2 PD1VOLSQ    CHAR(2),         /* VOLUME SEQUENCE NUMBER       07350000
*                                          (1-9999)                  */ 07400000
*        2 PD1CREDT    CHAR(3),         /* CREATION DATE                07450000
*                                          ('YYDDDD'X, DISCONTINUOUS)*/ 07500000
*        2 PD1EXPDT    CHAR(3),         /* EXPIRATION DATE              07550000
*                                          ('YYDDDD'X, DISCONTINUOUS)*/ 07600000
*        2 PD1NOEPV    CHAR(1),         /* NUMBER OF DATA EXTENTS       07650000
*                                          ON VOLUME                 */ 07700000
*        2 PD1NOBDB    CHAR(1),         /* NUMBER OF BYTES USED IN      07750000
*                                          LAST DIRECTORY BLOCK      */ 07800000
*        2 PD1FLAG1    CHAR(1),         /* FLAG 1                @L6A*/ 07825000
*          3 PD1COMPR  BIT(1),          /* COMPRESSABLE EXTENDED FORMAT 07837400
*                                      (DS1STRP MUST ALSO BE SET)@04A*/ 07849800
*          3 PD1CPOIT  BIT(1),          /* CHECKPOINTED DATASET  @03A*/ 07862400
*          3 *         BIT(6),          /* RESERVED              @03C*/ 07881100
*        2 PD1SYSCD    CHAR(13),        /* SYSTEM CODE               */ 07900000
*        2 PD1REFD     CHAR(3),         /* DATE LAST REFERENCED         07950000
*                                          ('YYDDDD'X, DISCONTINUOUS)*/ 08000000
*        2 PD1SMSMG    CHAR(1),         /* SYSTEM MANAGED STORAGE       08050000
*                                          INDICATORS            @L1A*/ 08100000
*         3 PD1SMSDS   BIT(1),          /* SYSTEM MANAGED DATA SET      08150000
*                                                                @L1A*/ 08200000
*         3 PD1SMSUC   BIT(1),          /* NO BCS ENTRY EXISTS FOR      08250000
*                                          DATA SET              @P4C*/ 08300000
*         3 PD1REBLK   BIT(1),          /* DATA SET MAY BE REBLOCKED    08350000
*                                                                @L1A*/ 08400000
*         3 PD1CRSDB   BIT(1),          /* DADSM CREATE ORIGINATED      08414100
*                                          BLKSIZE               @P3A*/ 08428200
*         3 PD1PDSE    BIT(1),          /* PDSE DATA SET         @L6C*/ 08433800
*         3 PD1STRP    BIT(1),          /* EXTENDED FORMAT D S   @L6C*/ 08439400
*         3 PD1PDSEX   BIT(1),          /* HFS DATA SET          @L6C*/ 08445000
*         3 PD1DSAE    BIT(1),          /* EXTENDED ATTR EXIST   @L6C*/ 08450600
*        2 PD1SCEXT    CHAR(3),         /* SECONDARY SPACE EXTENSION    08456600
*                                                                @L1A*/ 08463200
*         3 PD1SCXTF   BIT(8),          /* SECONDARY SPACE EXTENSION    08469800
*                                          FLAG BYTE             @L1A*/ 08476400
*          4 PD1SCAVB  BIT(1),          /* IF 1, PD1SCXTV = ORIGINAL    08483000
*                                          AVERAGE BLOCK LENGTH  @L1A*/ 08489600
*          4 PD1SCMB   BIT(1),          /* IF 1, PD1SCXTV IS IN         08496200
*                                                MEGABYTES       @L1A*/ 08502800
*          4 PD1SCKB   BIT(1),          /* IF 1, PD1SCXTV IS IN         08509400
*                                                KILOBYTES       @L1A*/ 08516000
*          4 PD1SCUB   BIT(1),          /* IF 1, PD1SCXTV IS IN         08522600
*                                                BYTES           @L1A*/ 08529200
*          4 PD1SCCP1  BIT(1),          /* IF 1, PD1SCXTV HAS BEEN      08530500
*                                          COMPACTED ONCE        @P2A*/ 08531800
*          4 PD1SCCP2  BIT(1),          /* IF 1, PD1SCXTV HAS BEEN      08533100
*                                          COMPACTED TWICE       @P2A*/ 08534400
*         3 PD1SCXTV   FIXED(16) BDY(BYTE), /* SECONDARY SPACE          08535800
*                                          EXTENSION VALUE       @L1A*/ 08542400
*        2 PD1DSORG    CHAR(2),         /* DATA SET ORGANIZATION     */ 08550000
*         3 PD1DSRG1   CHAR(1),         /* FIRST BYTE OF PD1DSORG    */ 08600000
*          4 PD1ORGIS  BIT(1),          /* IS - INDEXED SEQUENTIAL      08650000
*                                               ORGANIZATION         */ 08700000
*          4 PD1ORGPS  BIT(1),          /* PS - PHYSICAL SEQUENTIAL     08750000
*                                               ORGANIZATION         */ 08800000
*          4 PD1ORGDA  BIT(1),          /* DA - DIRECT                  08850000
*                                               ORGANIZATION         */ 08900000
*          4 PD1ORGCX  BIT(1),          /* CX - BTAM OR QTAM LINE       08950000
*                                               GROUP                */ 09000000
*          4 PD1ORGCQ  BIT(1),          /* CQ - QTAM DIRECT ACCESS      09050000
*                                               GROUP                */ 09100000
*          4 PD1ORGMQ  BIT(1),          /* MQ - QTAM PROBLEM PROGRAM    09150000
*                                               MESSAGE QUEUE        */ 09200000
*          4 PD1ORGPO  BIT(1),          /* PO - PARTITIONED             09250000
*                                               ORGANIZATION         */ 09300000
*          4 PD1ORGU   BIT(1),          /* U -  UNMOVABLE, THE          09350000
*                                               DATA SET CONTAINS       09400000
*                                               LOCATION DEPENDENT      09450000
*                                               INFORMATION          */ 09500000
*         3 PD1DSRG2   CHAR(1),         /* SECOND BYTE OF PD1DSORG   */ 09550000
*          4 PD1ORGGS  BIT(1),          /* GS - GRAPHICS                09600000
*                                               ORGANIZATION         */ 09650000
*          4 PD1ORGTX  BIT(1),          /* TX - TCAM LINE GROUP      */ 09700000
*          4 PD1ORGTQ  BIT(1),          /* TQ - TCAM MESSAGE QUEUE   */ 09750000
*          4 *         BIT(1),          /* RESERVED                  */ 09800000
*          4 PD1ORGAM  BIT(1),          /* AM - VSAM                 */ 09850000
*          4 PD1ORGTR  BIT(1),          /* TR - TCAM 3705            */ 09900000
*          4 *         BIT(2),          /* RESERVED                  */ 09950000
*        2 PD1RECFM    CHAR(1),         /* RECORD FORMAT             */ 10000000
*        2 PD1OPTCD    CHAR(1),         /* OPTION CODE               */ 10050000
*          4 PD1OPTIC  BIT(1),          /*   D/S IN AN ICF CTLG      */ 10100000
*          4 PD1OPTBC  BIT(1),          /*   THIS IS AN ICF CTLG     */ 10150000
*          4 *         BIT(6),          /*   RESERVED, UNUSED.       */ 10200000
*        2 PD1BLKL     CHAR(2),         /* BLKSIZE OR MAX BLKSIZE    */ 10250000
*        2 PD1LRECL    CHAR(2),         /* LOGICAL RECORD LENGTH     */ 10300000
*        2 PD1KEYL     CHAR(1),         /* KEY LENGTH (0-255)        */ 10350000
*        2 PD1RKP      CHAR(2),         /* RELATIVE KEY POSITION     */ 10400000
*        2 PD1DSIND    CHAR(1),         /* DATA SET INDICATORS       */ 10450000
*         3 PD1IND80    BIT(1),         /* LAST VOLUME ON               10500000
*                                          WHICH A DATA SET             10550000
*                                          RESIDES.                  */ 10600000
*         3 PD1IND40    BIT(1),         /* DATA SET IS RACF             10650000
*                                          DEFINED                   */ 10700000
*         3 PD1IND20    BIT(1),         /* BLOCK LENGTH IS A            10750000
*                                          MULTIPLE OF 8 BYTES       */ 10800000
*         3 PD1IND10    BIT(1),         /* PASSWORD IS                  10850000
*                                          REQUIRED TO READ             10900000
*                                          OR WRITE OR BOTH-            10950000
*                                          SEE PD1IND04              */ 11000000
*         3 PD1IND08    BIT(1),         /* RESERVED.                 */ 11050000
*         3 PD1IND04    BIT(1),         /* IF PD1IND10 IS 1             11100000
*                                          THEN IF PD1IND04             11150000
*                                          IS . . .                     11200000
*                                          1 - PASSWORD IS              11250000
*                                          REQUIRED TO WRITE            11300000
*                                          BUT NOT TO READ              11350000
*                                          0 - PASSWORD IS              11400000
*                                          REQUIRED TO WRITE            11450000
*                                          AND TO READ               */ 11500000
*         3 PD1IND02    BIT(1),         /* DATASET HAS BEEN             11550000
*                                          OPENED FOR OTHER             11600000
*                                          THAN INPUT SINCE             11650000
*                                          LAST BACKUP COPY             11700000
*                                          WAS MADE.                 */ 11750000
*         3 PD1IND01    BIT(1),         /* SECURE CHECKPOINT DATA       11800000
*                                          SET                       */ 11850000
*        2 PD1SCALO    CHAR(4),         /* SECONDARY ALLOCATION      */ 11900000
*         3 PD1SCAL1   CHAR(1),         /* SPACE PARAMETERS          */ 11950000
*          4 PD1DSPAC    BIT(2),        /* BIT PATTERN FOR SPACE        12000000
*                                          REQUEST                   */ 12050000
*           5 PD1CYL      BIT(2),       /* CYLINDER REQUEST          */ 12100000
*            6 PD1TRK      BIT(1),      /* TRACK REQUEST             */ 12150000
*            6 PD1AVR      BIT(1),      /* AVERAGE BLOCK LENGTH         12200000
*                                          REQUEST                   */ 12250000
*          4 PD1MSGP     BIT(1),        /* MASS STORAGE VOLUME          12300000
*                                          GROUP (MSVGP)             */ 12350000
*          4 PD1EXT      BIT(1),        /* EXTENSION TO SECONDARY SPACE 12383300
*                                          EXISTS (PD1SCEXT)     @L1A*/ 12416600
*          4 PD1CONTG    BIT(1),        /* CONTIGUOUS REQUEST        */ 12450000
*          4 PD1MXIG     BIT(1),        /* MXIG REQUEST              */ 12500000
*          4 PD1ALX      BIT(1),        /* ALX REQUEST               */ 12550000
*          4 PD1ROUND    BIT(1),        /* ROUND REQUEST             */ 12600000
*         3 PD1SCAL3   CHAR(3),         /* SECONDARY ALLOCATION         12650000
*                                          QUANTITY                  */ 12700000
*        2 PD1LSTAR    CHAR(3),         /* LAST USED TRACK AND LAST     12750000
*                                          BLOCK ON TRACK            */ 12800000
*        2 PD1TRBAL    CHAR(2),         /* BYTES REMAINING ON LAST      12850000
*                                          TRACK USED                */ 12900000
*        2 *           CHAR(2),         /* RESERVED                  */ 12950000
*        2 PD1EXT1     CHAR(1),         /* EXTENT TYPE INDICATOR     */ 13000000
*          4 *         BIT(1),          /* RESERVED                  */ 13050000
*          4 PD1ULBL   BIT(1),          /* USER LABEL REQUEST        */ 13100000
*        2 *           CHAR(1),         /* RESERVED              @02C*/ 13112500
*        2 PD1FLG1     BIT(8),          /* FLAG BYTE.            @02A*/ 13125000
*          4 PD1PSPAC  BIT(5),          /* PRIMARY SPACE UNITS.  @02A*/ 13137500
*                                       /* AT MOST ONE OF THESE BITS */ 13150000
*                                       /* MAY BE SET.  IF NONE ARE  */ 13162500
*                                       /* SET, PDPRIQTY IS ASSUMED  */ 13175000
*                                       /* TO BE IN TRACKS.          */ 13187500
*            6 PD1PCYL   BIT(1),        /* PDPRIQTY IN CYL.      @02A*/ 13200000
*            6 PD1PTRK   BIT(1),        /* PDPRIQTY IN TRK.      @02A*/ 13212500
*            6 PD1PBLK   BIT(1),        /* PDPRIQTY IN BLOCKS.   @02A*/ 13225000
*            6 PD1PMB    BIT(1),        /* PDPRIQTY IN MEGABYTES.@02A*/ 13237500
*            6 PD1PKB    BIT(1),        /* PDPRIQTY IN KILOBYTES.@02A*/ 13250000
*          4 *         BIT(3),          /* RESERVED.        .    @02A*/ 13262500
*        2 PDPRIQTY    CHAR(4),         /* PRIMARY SPACE QTY IN UNITS   13275000
*                                          INDICATED BY PD1PSPAC.@02C*/ 13287500
*        2 PDDIRQTY    CHAR(4),         /* NUMBER OF DIRECTORY          13300000
*                                          BLOCKS                    */ 13350000
*        2 PD1END      CHAR(0);         /* END OF THE FORMAT 1 DSCB  */ 13400000
