*% GOTO PLSDSCB;                        /*  GO TO THE PL/S VERSION   */ 00050000
*/* *** START OF SPECIFICATIONS ************************************ */ 00200000
*/*                                                                  */ 00400000
*/*$MAC(IECSDSL1):  DSCB MAPPING MACRO                               */ 00450013
*/*                                                                  */ 00800000
*/*PROPRIETARY V3 STATEMENT                                          */ 00818700
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00837400
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00856100
*/*5695-DF1                                                          */ 00874800
*/*(C) COPYRIGHT 1980,1994  IBM CORP.                                */ 00893500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00921700
*/*                                                                  */ 00950000
*/*  STATUS: DFSMS/MVS 1.5.0                                         */ 01000000
*/*                                                                  */ 01200000
*/********************************************************************/ 01216613
*/*                                                                  */ 01233213
*/*              ASSEMBLY LANGUAGE VERSION OF IECSDSL1               */ 01250000
*/*                                                                  */ 01600000
*/*      ******************************************************      */ 01800000
*/*                                                                  */ 02000000
*/*      THE FORMAT OF EACH OF THE DATA SET CONTROL                  */ 02200000
*/*      BLOCKS (DSCB'S) CAN BE GENERATED BY CODING                  */ 02400000
*/*                    IECSDSL1 (N)                                  */ 02600000
*/*      WHERE N IS A NUMBER 1 - 6 CORRESPONDING TO THE              */ 02800000
*/*      FORMAT NUMBER OF THE DSCB TO BE MAPPED.  MORE               */ 03000000
*/*      THAN ONE DSCB CAN BE MAPPED PER MACRO CALL BY               */ 03200000
*/*      SEPARATING THE FORMAT NUMBERS BY COMMAS.  THE               */ 03400000
*/*      DSCB'S THUS GENERATED WILL BE MAPPED IN THE                 */ 03600000
*/*      ORDER IN WHICH THE FORMAT NUMBERS ARE CODED.                */ 03800000
*/*                                                                  */ 03822200
*/*      ******************************************************      */ 03844400
*/*                                                                  */ 03866600
*/*      NOTE: THIS MACRO DOES NOT GENERATE A DSECT STATEMENT.   @02A*/ 03888800
*/*      IT CONTINUES THE PREVIOUS DSECT OR CSECT.  FOR ONE      @02A*/ 03911000
*/*      INVOCATION, THE DSCB'S ARE CONTIGUOUS, NOT OVERLAID ON  @02A*/ 03933200
*/*      SAME AREA.  THIS APPLIES ONLY TO THE ASSEMBLER; IT      @02A*/ 03955400
*/*      MEANS NOTHING IN PL/X.                                  @02A*/ 03977600
*/*                                                                  */ 04000000
*/*      ******************************************************      */ 04200000
*/*                                                                  */ 04400000
         MACRO                                                          04600000
         IECSDSL1 &PARA                                                 04800000
.********************************************************************** 04810013
.*                                                                      04820000
.*MODULE-TYPE = MACRO                                                   04820500
.*                                                                      04821000
.*PROCESSOR = ASSEMBLER OR PLS                                          04821500
.*                                                                      04822000
.*CHANGE ACTIVITY =                                                     04822500
.*$L1=IXVTOC,JDM1134,T790227,STLBS: INDEXED VTOC SUPPORT           @L1A 04823313
.*$L2=ICFCAT,JDM1113,T790225,STLMD: ICF CATALOG SUPPORT            @L2A 04826613
.*$01=OZ52996,JDM1113,81110,STLRRB: DATE LAST REFERENCED           @01A 04829913
.*$L3=MVS/XA,JDP1111,,STLBS:        BIT DESCRIPTIONS               @L3A 04831000
.*$P1=KKC0088,HDP2210,,STLAM:       REMOVE SEMICOLON FROM ASM REM  @P1A 04832100
.*$L4=MVS/XA,HDP3310,T86304,STLMC:  DADSM SUPPORT FOR SMS          @L4A 04832600
.*$P2=KPQ0028,HDP2230,T86111,STLAM: ADD INDEX DISABLE BIT IN F4    @P2A 04832900
.*                                  (FROM APAR OZ97209 FOR HDP2210)@P2A 04833000
.*$P3=KJA0756,HDP3310,T86293,STLKAA: COMPACT SAVED SECONDARY QTY   @P3A 04833100
.*$P4=KJA2615,HDP3310,T87118,STLKAA: CLARIFY FIELD DESCRIPTIONS    @P4A 04875400
.*$P5=KJA2737,HDP3310,T87159,STLKAA: ADD SYSTEM DETERMINED         @P5A 04889500
.*                                   BLOCKSIZE FLAG IN FMT1        @P5A 04903600
.*$L5=PDSE,HDP3320,T87201,STLKAA:  PDSE DATA SET SUPPORT           @L5A 04910600
.*$P6=KJB3529,HDP3310,T87251,STLKAA: CLARIFY UNCATALOGED BIT       @P6A 04914100
.*$P7=KET1795,HDP3320,T89044,STLKSC: CHANGE TO DS1PDSE.            @P7A 04915900
.*$L6=64KTRACK,JDZ1110,T920103,SJPLKSC: DADSM SUPPORT FOR DASD WITH@L6A 04916200
.*                                      MORE THAN 64K TRACKS       @L6A 04916500
.*$L7=STRIPE,JDZ1110,911003,SJPLRPS:  EXTENDED SEQUENTIAL SUPPORT  @L7A 04916600
.*$L8=PDSEX,JDZ1110,920115,SJPLRPS:     HFS DATA SET SUPPORT       @L8A 04916700
.*$L9=EXTATTR,JDZ1110,920910,SJPLRPS:   EXTENDED ATTRIBUTE SUPPORT @L9A 04916800
.*$02=OY_____,HDP3330,930122,SJPLRPS:   ASSORTED CLEANUP           @02A 04916900
.*$LA=COMPRESS,HDZ11B0,930122,SJPLRPS:  EXTENDED FORMAT SUPPORT    @LAA 04917000
.*$03=OW00735,HDZ11B0,93AUG09,SJPLRG: ADD BIT DS1CPOIT TO FMT1     @03A 04917300
.*$04=OW22041,HDZ11C0,96Aug09,SJPLRPS alternate cylinder           @04A 04917500
.*$LB=SERVICE,HDZ11D0,960201,SJPLGEC: O/C/EOV SERVICEABILITY       @LBA 04917600
.*$05=OW32541,HDZ11D0,98Mar27,SJPLRPS define Amberjack bit         @05A 04931700
.*                                                                      04945800
.**** END OF SPECIFICATIONS ******************************************* 04960000
         LCLA  &CTR                                                     05000000
&CTR     SETA  1                                                        05200000
.LOOP    AIF   (&CTR GT N'&PARA).ENDOFIT                                05600000
         AIF   ('&PARA(&CTR)' EQ '1').FIRSTON                           05800000
         AIF   ('&PARA(&CTR)' EQ '2').SECNDON                           06000000
         AIF   ('&PARA(&CTR)' EQ '3').THIRDON                           06200000
         AIF   ('&PARA(&CTR)' EQ '4').FORTHON                           06400000
         AIF   ('&PARA(&CTR)' EQ '5').FIFTHON                           06600000
         AIF   ('&PARA(&CTR)' EQ '6').SIXTHON                           06800000
         AGO   .ERROR                                                   07000000
.FIRSTON ANOP                                                           07200000
IECSDSL1 EQU   *                   FORMAT 1 DSCB                        07400000
IECSDSF1 EQU   IECSDSL1            SAME AS IECSDSL1                @P1C 07600000
DS1DSNAM DS    CL44                DATA SET NAME                        07800000
DS1FMTID DS    CL1                 FORMAT IDENTIFIER (X'F1')       @L3C 08000000
DS1DSSN  DS    CL6                 DATA SET SERIAL NUMBER               08200000
*                                     (IDENTIFIES THE FIRST OR     @P1A 08250000
*                                      ONLY VOLUME CONTAINING THE  @P1A 08300000
*                                      DATA SET/SPACE)             @P1A 08350000
DS1VOLSQ DS    XL2                 VOLUME SEQUENCE NUMBER (1-9999) @P1C 08400000
DS1CREDT DS    XL3                 CREATION DATE                        08600000
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 08650000
DS1EXPDT DS    XL3                 EXPIRATION DATE                      08800000
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 08850000
DS1NOEPV DS    XL1                 NUMBER OF DATA EXTENTS ON VOLUME@P1C 08900000
DS1NOBDB DS    XL1                 NUMBER OF BYTES USED IN LAST         09200000
*                                     DIRECTORY BLOCK (PDS ONLY)   @02C 09250000
DS1FLAG1 DS    XL1                 FLAG 1                          @LAA 09300000
DS1COMPR EQU   X'80'  1... ....    COMPRESSABLE EXTENDED FORMAT    @LAA 09350000
*                                  (DS1STRP MUST ALSO BE SET)      @LAA 09400000
DS1CPOIT EQU   X'40'  .1.. ....    CHECKPOINTED DATASET            @03A 09450000
*                     ..11 1111    RESERVED                        @03C 09500000
DS1SYSCD DS    CL13                SYSTEM CODE                          09800000
DS1REFD  DS    XL3                 DATE LAST REFERENCED            @01C 09850000
*                                    (DISCONTINUOUS BIN, X'YYDDDD')@P1A 09900000
*                                    OR ZERO IF NOT MAINTAINED     @P1A 09950000
DS1SMSFG DS    XL1                 SYSTEM MANAGED STORAGE INDICATORS   X09977700
                                                                   @L4A 10005400
DS1SMSDS EQU   X'80'  1... ....    SYSTEM MANAGED DATA SET         @L4A 10033100
DS1SMSUC EQU   X'40'  .1.. ....    NO BCS ENTRY EXISTS FOR DATA SET    X10060800
                                                                   @P6C 10088500
DS1REBLK EQU   X'20'  ..1. ....    SDB AND D.S. MAY BE REBLOCKED   @02C 10107900
DS1CRSDB EQU   X'10'  ...1 ....    DADSM CREATE ORIGINATED BLKSIZE @P5A 10127300
DS1PDSE  EQU   X'08'  .... 1...    PDSE DATA SET                   @P7C 10131700
DS1STRP  EQU   X'04'  .... .1..    EXTENDED FORMAT DATA SET        @LAC 10136100
DS1PDSEX EQU   X'02'  .... ..1.    HFS DATA SET                    @L8A 10140500
DS1DSAE  EQU   X'01'  ........1    EXTENDED ATTRIBUTES EXIST       @L9C 10144900
DS1SCEXT DS    0XL3                SECONDARY SPACE EXTENSION       @L4C 10149500
DS1SCXTF DS    XL1                 SECONDARY SPACE EXTENSION FLAG -    X10152300
                                   ONLY ONE OF THE FOLLOWING FLAGS     X10155100
                                   WILL BE SET 'ON'                @P4C 10157900
DS1SCAVB EQU   X'80'  1... ....    IF 1, DS1SCXTV IS THE ORIGINAL  @L4A 10160700
*                                  AVERAGE BLOCK LENGTH            @L4A 10166300
DS1SCMB  EQU   X'40'  .1.. ....    IF 1, DS1SCXTV IS IN MEGABYTES  @L4A 10171900
DS1SCKB  EQU   X'20'  ..1. ....    IF 1, DS1SCXTV IS IN KILOBYTES  @L4A 10177500
DS1SCUB  EQU   X'10'  ...1 ....    IF 1, DS1SCXTV IS IN BYTES      @L4A 10183100
DS1SCCP1 EQU   X'08'  .... 1...    IF 1, DS1SCXTV HAS BEEN COMPACTED   X10184900
                                   BY A FACTOR OF 256              @P4C 10186700
DS1SCCP2 EQU   X'04'  .... .1..    IF 1, DS1SCXTV HAS BEEN COMPACTED   X10188500
                                   BY A FACTOR OF 65536            @P4C 10190300
*                     .... ..11    RESERVED                        @P3C 10192100
DS1SCXTV DS    XL2                 SECONDARY SPACE EXTENSION VALUE @L4A 10194300
DS1DSORG DS    XL2                 DATA SET ORGANIZATION                10200000
*                                                                       10207413
*                    FIRST BYTE OF DS1DSORG                             10214813
DS1DSGIS EQU   X'80'  1... ....    IS - INDEXED SEQUENTIAL         @L1A 10222200
*                                  ORGANIZATION                         10229613
DS1DSGPS EQU   X'40'  .1.. ....    PS - PHYSICAL SEQUENTIAL        @L1A 10237000
*                                  ORGANIZATION                         10244413
DS1DSGDA EQU   X'20'  ..1. ....    DA - DIRECT ORGANIZATION        @L1A 10251800
DS1DSGCX EQU   X'10'  ...1 ....    CX - BTAM OR QTAM LINE GROUP    @L1A 10259200
*        EQU   X'08'  .... 1...    CQ - QTAM DIRECT ACCESS MSG QUE @P1C 10266600
*        EQU   X'04'  .... .1..    MQ - QTAM PROBLEM PROG MSG QUEUE@P1C 10274000
DS1DSGPO EQU   X'02'  .... ..1.    PO - PARTITIONED ORGANIZATION   @L1A 10281400
DS1DSGU  EQU   X'01'  .... ...1    U - UNMOVABLE, THE DATA SET     @P1C 10288800
*                                      CONTAINS LOCATION DEPENDENT      10296200
*                                      INFORMATION                      10303600
*                                                                       10311013
*                     SECOND BYTE OF DS1DSORG                           10318413
DS1DSGGS EQU   X'80'  1... ....    GS - GRAPHICS ORGANIZATION      @L1A 10325800
DS1DSGTX EQU   X'40'  .1.. ....    TX - TCAM LINE GROUP            @L1A 10333200
DS1DSGTQ EQU   X'20'  ..1. ....    TQ - TCAM MESSAGE QUEUE         @L1A 10340600
*        EQU   X'10'  ...1 ....    RESERVED                        @LAC 10346100
DS1ACBM  EQU   X'08'  .... 1...    AM - ACCESS METHOD CONTROL BLOCK@P1C 10351600
DS1ORGAM EQU   X'08'  .... 1...    AM - VSAM DATA SET/SPACE        @P1M 10357100
DS1DSGTR EQU   X'04'  .... .1..    TR - TCAM 3705                  @L1A 10362800
*        EQU   X'02'  .... ..X.    RESERVED                        @P1C 10372100
*        EQU   X'01'  .... ...X    RESERVED                        @P1C 10381400
*                                                                  @P1C 10390700
DS1RECFM DS    XL1                 RECORD FORMAT                        10400000
DS1RECFF EQU   X'80'  10.. ....    F - FIXED LENGTH                @L3A 10412500
DS1RECFV EQU   X'40'  01.. ....    V - VARIABLE LENGTH             @L3A 10425000
DS1RECFU EQU   X'C0'  11.. ....    U - UNDEFINED LENGTH            @L3A 10437500
DS1RECFT EQU   X'20'  ..1. ....    T - TRACK OVERFLOW              @L3A 10450000
DS1RECFB EQU   X'10'  ...1 ....    B - BLOCKED: MAY NOT OCCUR WITH @L3A 10462500
*                                      UNDEFINED (U).              @L3A 10475000
DS1RECFS EQU   X'08'  .... 1...    FIXED LENGTH: (X'88')           @L3A 10487500
*                                     STANDARD BLOCKS, NO TRUNCATED@L3A 10500000
*                                     BLOCKS OR UNFILLED TRACKS.   @L3A 10512500
*                                  VARIABLE LENGTH: (X'48')        @L3A 10525000
*                                     SPANNED RECORDS.             @L3A 10537500
DS1RECFA EQU   X'04'  .... .10.    ANSI CONTROL CHARACTER          @L3A 10550000
DS1RECMC EQU   X'02'  .... .01.    MACHINE CONTROL CHARACTER       @L3A 10562500
*                     .... .00.    NO CONTROL CHARACTER            @L3A 10575000
*                     .... ...0    ALWAYS ZERO                     @L3A 10587500
DS1OPTCD DS    XL1                 OPTION CODES -- INDICATES THE   @P1C 10595500
*                                  VARIOUS OPTIONS USED IN         @P1C 10603500
*                                  BUILDING THE DATA SET           @P1C 10611500
*                                                                  @P1A 10619500
* BDAM DS1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN DS1DSGDA IS ON) @P1A 10627500
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 10635500
*              X'40'  .1.. ....      - TRACK OVERFLOW              @P1A 10643500
*              X'20'  ..1. ....    E - EXTENDED SEARCH             @P1A 10651500
*              X'10'  ...1 ....    F - FEEDBACK                    @P1A 10659500
*              X'08'  .... 1...    A - ACTUAL ADDRESSING           @P1A 10667500
*              X'04'  .... .1..      - DYNAMIC BUFFERING           @P1A 10675500
*              X'02'  .... ..1.      - READ EXCLUSIVE              @P1A 10683500
*              X'01'  .... ...1    R - RELATIVE BLOCK ADDRESSING   @P1A 10691500
*                                                                  @P1A 10699500
* ISAM DS1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN DS1DSGIS IS ON) @P1A 10707500
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 10715500
*              X'40'  .1.. ....    U - ACCUMULATE TRACK INDEX ENT  @P1A 10723500
*              X'20'  ..1. ....    M - MASTER INDECIES             @P1A 10731500
*              X'10'  ...1 ....    I - INDEPENDENT OVERFLOW AREA   @P1A 10739500
*              X'08'  .... 1...    Y - CYLINDER OVERFLOW AREA      @P1A 10747500
*              X'04'  .... .X..    RESERVED                        @P1A 10755500
*              X'02'  .... ..1.    L - DELETE OPTION               @P1A 10763500
*              X'01'  .... ...1    R - REORGANIZATION CRITERIA     @P1A 10771500
*                                                                  @P1A 10779500
* BPAM/BSAM/QSAM DS1OPTCD FIELD ASSIGNMENTS                        @P1A 10787500
*                   (APPLY ONLY WHEN DS1DSGPO OR DS1DSGPS IS ON)   @P1A 10795500
*              X'80'  1... ....    W - WRITE VALIDITY CHECK        @P1A 10803500
*              X'40'  .1.. ....    U - ALLOW DATA CHECK (1403 PRTR)@P1A 10811500
*              X'20'  ..1. ....    C - CHAINED SCHEDULING USING PCI@P1A 10819500
*              X'10'  ...1 ....    H - VSE/OS INTERCHANGE FEATURE  @P1A 10827500
*              X'08'  .... 1...    B - TREAT EOF AS EOV (TAPE)     @P1A 10835500
*              X'04'  .... .1..    Z - SEARCH DIRECT               @P1A 10843500
*              X'02'  .... ..1.    T - USER LABEL TOTALING         @P1A 10851500
*              X'01'  .... ...1    J - FOR 3800 PRINTING SUBSYSTEM @P1A 10859500
*                                                                  @P1A 10867500
* VSAM DS1OPTCD FIELD ASSIGNMENTS (APPLY ONLY WHEN DS1ORGAM IS ON) @02C 10875500
DS1OPTIC EQU   X'80'  1... ....    DATA SET CATALOGED IN ICF CTLG  @P1C 10883500
DS1OPTBC EQU   X'40'  .1.. ....    DATA SET IS ICF CATALOG         @P1C 10891500
*                     ..XX XXXX    RESERVED                        @P1C 10899500
*                                                                       10910800
DS1BLKL  DS    XL2                 BLOCK LENGTH (TYPE F RECORDS),  @L3C 10955200
*                                  OR MAX BLKSIZE (U OR V RECORDS) @L3A 10999600
DS1LRECL DS    XL2                 LOGICAL RECORD LENGTH                11044000
*                                  FIXED LENGTH: RECORD LENGTH     @L3A 11088400
*                                  UNDEFINED LENGTH: ZERO          @L3A 11132800
*                                  VARIABLE UNSPANNED: MAX REC LEN @L3A 11177200
*                                  VARIABLE SPANNED:               @L3A 11221600
*                                   <= 32756 BYTES- MAX REC LEN    @02C 11266000
*                                   > 32756 BYTES- X'8000'         @L3A 11310400
DS1KEYL  DS    XL1                 KEY LENGTH (0 - 255)                 11354800
DS1RKP   DS    XL2                 RELATIVE KEY POSITION                11400000
DS1DSIND DS    XL1                 DATA SET INDICATORS                  11600000
DS1IND80 EQU   X'80'  1... ....    LAST VOLUME CONTAINING DATA IN  @P1C 11611100
*                                     THIS DATA SET                @02C 11622200
DS1IND40 EQU   X'40'  .1.. ....    DATA SET IS RACF DEFINED    @G60ASBJ 11633300
DS1RACDF EQU   DS1IND40            SAME USE AS BIT DS1IND40        @LBA 11638800
DS1IND20 EQU   X'20'  ..1. ....    BLOCK LENGTH IS A MULTIPLE  @G60ASBJ 11644400
*                                     OF 8 BYTES               @G60ASBJ 11655500
DS1IND10 EQU   X'10'  ...1 ....    PASSWORD IS REQUIRED TO     @G60ASBJ 11666600
*                                  READ OR WRITE OR BOTH-SEE   @G60ASBJ 11677700
*                                     DS1IND04                 @G60ASBJ 11688800
DS1SECTY EQU   DS1IND10            SAME USE AS BIT DS1IND10        @LBA 11694300
DS1IND08 EQU   X'08'  .... X...    RESERVED                        @P1C 11699900
DS1IND04 EQU   X'04'  .... .1..    IF DS1IND10 IS 1 THEN           @P1C 11711000
*                                     IF DS1IND04 IS . . .         @P1C 11722100
*                                        1-PASSWORD REQUIRED TO    @P1C 11733200
*                                          WRITE BUT NOT TO READ   @P1C 11744300
*                                        0-PASSWORD REQUIRED TO    @P1C 11755400
*                                          WRITE OR TO READ        @02C 11766500
DS1WRSEC EQU   DS1IND04            SAME USE AS BIT DS1IND04        @LBA 11772000
DS1IND02 EQU   X'02'  .... ..1.    DATA SET OPENED FOR OTHER   @G60ASBJ 11777600
*                                     THAN INPUT SINCE LAST    @G60ASBJ 11788700
*                                     BACKUP COPY MADE.        @G60ASBJ 11799800
DS1DSCHA EQU   DS1IND02            SAME USE AS BIT DS1IND02    @G60ASBJ 11810900
DS1IND01 EQU   X'01'  .... ...1    SECURE CHECKPOINT DATA SET      @01C 11822000
DS1CHKPT EQU   DS1IND01            SAME AS DS1IND01                @L3C 11833100
DS1SCALO DS    0XL4                SECONDARY ALLOCATION            @L3C 11844200
DS1SCAL1 DS    XL1                 SPACE PARAMETERS                @P1C 11855300
DS1DSPAC EQU   X'C0'  XX.. ....    BIT PATTERN FOR SPACE REQUEST   @L3A 11866400
DS1CYL   EQU   X'C0'  11.. ....    CYLINDER REQUEST                @L3A 11877500
DS1TRK   EQU   X'80'  10.. ....    TRACK REQUEST                   @L3A 11888600
DS1AVR   EQU   X'40'  01.. ....    AVERAGE BLOCK LENGTH REQUEST    @L3A 11899700
DS1AVRND EQU   X'41'  01.. ...1    AVERAGE BLOCK AND ROUND REQUEST @P1C 11910800
DS1MSGP  EQU   X'20'  ..1. ....    RESERVED (WAS MSGP)             @02C 11920000
DS1EXT   EQU   X'10'  ...1 ....    EXTENSION TO SECONDARY SPACE    @L4A 11929300
*                                  DESCRIPTION EXISTS (DS1SCEXT)   @L4A 11936700
DS1CONTG EQU   X'08'  .... 1...    CONTIGUOUS REQUEST              @L3A 11944100
DS1MXIG  EQU   X'04'  .... .1..    MXIG REQUEST                    @L3A 11955200
DS1ALX   EQU   X'02'  .... ..1.    ALX REQUEST                     @L3A 11966300
*              X'01'  .... ...1    ROUND REQUEST                   @P1A 11971800
DS1DSABS EQU   X'00'  0000 0000    ABSOLUTE TRACK REQUEST          @L3A 11977400
DS1SCAL3 DS    XL3                 SECONDARY ALLOCATION QUANTITY   @P1C 12027400
DS1LSTAR DS    XL3                 LAST USED TRACK AND BLOCK ON    @P1C 12056000
*                                     TRACK (TTR).  NOTE:  FOR     @02C 12084600
*                                     EXTENDED FORMAT, HIGH ORDER  @02C 12113200
*                                     BYTES OF TT MAY BE CONTAINED @02C 12141800
*                                     DS1TRBAL.                    @02C 12170400
DS1TRBAL DS    XL2                 FOR EXTENDED FORMAT: 2 HIGH     @02C 12199000
*                                     ORDER BYTES OF LAST USED     @02C 12227600
*                                     TRACK (TTTTR).               @02C 12256200
*                                  FOR PDSE, HFS, OR VSAM: ZERO    @02C 12284800
*                                  OTHERWISE: CODE INDICATING      @02C 12313400
*                                     SPACE REMAINING ON LAST      @02C 12342000
*                                     USED TRACK.                  @02C 12370600
         DS    XL2                 RESERVED                             12400000
DS1EXT1  DS    XL10                FIRST EXTENT DESCRIPTION             12600000
*        FIRST BYTE                EXTENT TYPE INDICATOR                12800000
*              X'81'  1... ...1    EXTENT ON CYLINDER BOUNDARIES   @L3A 12818100
*              X'80'  1... ....    RESERVED (WAS SPLIT CYLINDER)   @LAC 12832500
*              X'40'  01.. ....    USER LABEL EXTENT (FIRST EXTENT @L3A 12846900
*                                     ONLY, AND IS NOT COUNTED     @P1C 12861300
*                                     IN DS1NOEPV)                 @P1A 12875700
*              X'04'  .... .1..    INDEX AREA EXTENT (ISAM)        @L3A 12890500
*              X'02'  .... ..1.    OVERFLOW AREA EXTENT (ISAM)     @L3A 12908600
*              X'01'  .... ...1    USER'S DATA BLOCK EXTENT OR     @L3A 12926700
*                                     IS A PRIME AREA EXTENT (ISAM)@P1C 12944800
*              X'00'  0000 0000    FOLLOWING 9 BYTES DO NOT        @L3A 12962900
*                                     INDICATE ANY EXTENT          @P1C 12981000
*        SECOND BYTE               EXTENT SEQUENCE NUMBER               13000000
*        THIRD - SIXTH BYTES       LOWER LIMIT (CCHH)                   13200000
*        SEVENTH - TENTH BYTES     UPPER LIMIT (CCHH)                   13400000
DS1EXT2  DS    XL10                SECOND EXTENT DESCRIPTION            13600000
DS1EXT3  DS    XL10                THIRD EXTENT DESCRIPTION             13800000
DS1PTRDS DS    XL5                 POINTER (CCHHR) TO A FORMAT 2   @P1C 13850000
*                                     OR 3 DSCB, OR ZERO           @P1A 13900000
DS1END   EQU   *                   EQUATE AT END OF DSCB1 MAP      @P1C 13950000
&CTR     SETA  &CTR+1                                                   14400000
         AGO   .LOOP                                                    14600000
.SECNDON ANOP                                                           14800000
IECSDSL2 EQU   *                   FORMAT 2 DSCB                        15000000
IECSDSF2 EQU   IECSDSL2            SAME AS IECSDSL2                @P1C 15200000
         DS    XL1                 KEY IDENTIFIER  (X'02')              15400000
DS22MIND DS    XL7                 ADDRESS OF 2ND LEVEL MASTER INDEX    15600000
DS2L2MEN DS    XL5                 LAST 2ND LEVEL MASTER INDEX ENTRY    15800000
DS23MIND DS    XL7                 ADDRESS OF 3RD LEVEL MASTER INDEX    16000000
DS2L3MIN DS    XL5                 LAST 3RD LEVEL MASTER INDEX ENTRY    16200000
         DS    XL11                RESERVED                             16400000
DS2LPDT  DS    XL8                 LAST PRIME TRACK ON LAST PRIME CYL   16600000
DS2FMTID DS    CL1                 FORMAT IDENTIFIER (X'F2')            16800000
DS2NOLEV DS    XL1                 NUMBER OF INDEX LEVELS               17000000
DS2DVIND DS    XL1                 HIGH LEVEL INDEX DEVELOPMENT         17200000
*                                     INDICATOR                         17400000
DS21RCYL DS    XL3                 FIRST DATA RECORD IN CYLINDER        17600000
DS2LTCYL DS    XL2                 LAST DATA TRACK IN CYLINDER          17800000
DS2CYLOV DS    XL1                 NUMBER OF TRACKS FOR CYLINDER        18000000
*                                     OVERFLOW                          18200000
DS2HIRIN DS    XL1                 HIGHEST 'R' ON HIGH-LEVEL INDEX TRK  18400000
DS2HIRPR DS    XL1                 HIGHEST 'R' ON PRIME DATA TRACK      18600000
DS2HIROV DS    XL1                 HIGHEST 'R' ON OVERFLOW DATA TRACK   18800000
DS2RSHTR DS    XL1                 'R' OF LAST DATA RECORD ON SHARED    19000000
*                                     TRACK                             19200000
DS2HIRTI DS    XL1                 HIGHEST 'R' ON UNSHARED TRACK OF     19400000
*                                     TRACK INDEX                       19600000
DS2HIIOV DS    XL1                 HIGHEST 'R' FOR INDEPENDENT OVERFLOW 19800000
*                                     DATA TRACKS                       20000000
DS2TAGDT DS    XL2                 TAG DELETION COUNT                   20200000
DS2RORG3 DS    XL3                 NON-FIRST OVERFLOW REFERENCE COUNT   20400000
DS2NOBYT DS    XL2                 NUMBER OF BYTES FOR HIGHEST-LEVEL    20600000
*                                     INDEX                             20800000
DS2NOTRK DS    XL1                 NUMBER OF TRACKS FOR HIGHEST-LEVEL   21000000
*                                     INDEX                             21200000
DS2PRCTR DS    XL4                 PRIME RECORD COUNT                   21400000
DS2STIND DS    XL1                 STATUS INDICATORS                    21600000
*                     .1.. ....    PERFORM KEY SEQUENCE CHECKING   @L3A 21633300
*                     ..1. ....    INITIAL LOAD HAS BEEN COMPLETED @L3A 21666600
*                     .... ..1.    LAST BLOCK FULL                 @L3A 21699900
*                     .... ...1    LAST TRACK FULL                 @L3A 21733200
*                     X..X XX..    RESERVED BITS                   @L3A 21766500
DS2CYLAD DS    XL7                 ADDRESS OF CYLINDER INDEX            21800000
DS2ADLIN DS    XL7                 ADDRESS OF LOWEST LEVEL MASTER INDEX 22000000
DS2ADHIN DS    XL7                 ADDRESS OF HIGHEST LEVEL MASTER      22200000
*                                     INDEX                             22400000
DS2LPRAD DS    XL8                 LAST PRIME DATA RECORD ADDRESS       22600000
DS2LTRAD DS    XL5                 LAST TRACK INDEX ENTRY ADDRESS       22800000
DS2LCYAD DS    XL5                 LAST CYLINDER INDEX ENTRY ADDRESS    23000000
DS2LMSAD DS    XL5                 LAST MASTER INDEX ENTRY ADDRESS      23200000
DS2LOVAD DS    XL8                 LAST INDEPENDENT OVERFLOW RECORD     23400000
*                                     ADDRESS                           23600000
DS2BYOVL DS    XL2                 BYTES REMAINING ON OVERFLOW TRACK    23800000
DS2RORG2 DS    XL2                 TRACKS REMAINING IN INDEPENDENT      24000000
*                                     OVERFLOW AREA                     24200000
DS2OVRCT DS    XL2                 OVERFLOW RECORD COUNT                24400000
DS2RORG1 DS    XL2                 CYLINDER OVERFLOW AREA COUNT         24600000
DS2NIRT  DS    XL3                 DUMMY TRACK INDEX ENTRY ADDRESS      24800000
DS2PTRDS DS    XL5                 POINTER (CCHHR) TO FORMAT 3 DSCB@P1C 24850000
*                                     OR ZERO                      @P1A 24900000
DS2END   EQU   *                   EQUATE AT END OF DSCB2 MAP      @P1C 24950000
&CTR     SETA  &CTR+1                                                   25400000
         AGO   .LOOP                                                    25600000
.THIRDON ANOP                                                           25800000
IECSDSL3 EQU   *                   FORMAT 3 DSCB                        26000000
IECSDSF3 EQU   IECSDSL3            SAME AS IECSDSL3                @P1C 26200000
DS3DSCB  DS    0XL140              FORMAT 3 DSCB                   @L6A 26250000
DS3KEYID DS    XL4                 KEY IDENTIFIER (X'03030303')         26300000
DS3EXT1  DS    0XL10               FIRST EXTENT DESCRIPTOR         @L6A 26350000
*        FIRST BYTE                EXTENT TYPE INDICATOR                26800000
*        SECOND BYTE               EXTENT SEQUENCE NUMBER               27000000
*        THIRD - SIXTH BYTES       LOWER LIMIT (CCHH)              @P1C 27200000
*        SEVENTH - TENTH BYTES     UPPER LIMIT (CCHH)              @P1C 27400000
DS3EXTNT DS    XL40                FOUR EXTENT DESCRIPTIONS             27450000
DS3FMTID DS    CL1                 FORMAT IDENTIFIER (X'F3')            27600000
DS3ADEXT DS    XL90                NINE ADDITIONAL EXTENT DESCRIPTIONS  27800000
DS3PTRDS DS    XL5                 FORWARD CHAIN POINTER (CCHHR)   @P1C 27850000
*                                     TO FORMAT 3 DSCB OR ZERO     @P1A 27900000
DS3END   EQU   *                   EQUATE AT END OF DSCB3 MAP      @P1C 27950000
&CTR     SETA  &CTR+1                                                   28400000
         AGO   .LOOP                                                    28600000
.FORTHON ANOP                                                           28800000
IECSDSL4 EQU   *                   FORMAT 4 DSCB                        29000000
IECSDSF4 EQU   IECSDSL4            SAME AS IECSDSL4                @P1C 29200000
DS4IDFMT DS    CL1                 FORMAT IDENTIFIER (X'F4')            29400000
DS4HPCHR DS    XL5                 HIGHEST ADDRESS (CCHHR) OF A    @P1C 29450000
*                                     FORMAT 1 DSCB (SET TO END OF @P1A 29500000
*                                     VTOC IF INDEXED VTOC)        @P1A 29550000
DS4DSREC DS    XL2                 NUMBER OF AVAILABLE DSCB'S (NOT @P1C 29600000
*                                     MAINTAINED IF INDEXED VTOC)  @P1A 29650000
DS4HCCHH DS    XL4                 CCHH OF NEXT AVAILABLE ALTERNATE TRK 30000000
DS4NOATK DS    XL2                 NUMBER OF REMAINING ALTERNATE TRACKS 30200000
DS4VTOCI DS    XL1                 VTOC INDICATORS                      30400000
DS4DOSBT EQU   X'80'  1... ....    VSE CONTAMINATION BIT (WAS DOS) @L6C 30403800
*                                    ON IMPLIES F5 DSCB CHAIN IS   @L6A 30407600
*                                    INVALID.  ONE OF THE          @02C 30411400
*                                    FOLLOWING IS TRUE:  FREE      @02C 30415200
*                                    SPACE INFORMATION IS          @02C 30419000
*                                    MAINTAINED IN THE VTOC INDEX  @02C 30422800
*                                    (SEE DS4IVTOC), OR FREE SPACE @02C 30426600
*                                    INFO IS MAINTAINED IN THE     @02C 30430400
*                                    FORMAT 7 CHAIN (SEE DS4EFVLD) @02C 30434200
*                                    OR FREE SPACE INFORMATION IS  @02C 30438000
*                                    NOT AVAILABLE.                @02C 30441800
DS4DVTOC EQU   X'40'  .1.. ....    IF ON, THE INDEX WAS DISABLED   @P2A 30446500
DS4EFVLD EQU   X'20'  ..1. ....    EXTENDED FREE-SPACE MANAGEMENT  @L6A 30447300
*                                  VALIDITY FLAG.  ON IMPLIES      @L6A 30448100
*                                  EXTENDED FREE-SPACE MANAGEMENT  @L6A 30448900
*                                  IS ACTIVE AND FREE-SPACE IS     @L6A 30449700
*                                  VALID.  SEE DS4EFLVL.           @L6A 30450500
DS4DSTKP EQU   X'10'  ...1 ....    VSE STACKED PACK                @P1C 30459000
DS4DOCVT EQU   X'08'  .... 1...    VSE CONVERTED VTOC              @P1C 30467500
DS4DIRF  EQU   X'04'  .... .1..    DIRF BIT (DADSM INTERRUPT RECORDING  30476000
*                                            FACILITY)             @P1C 30484500
DS4DICVT EQU   X'02'  .... ..1.    DIRF RECLAIMED                  @P1C 30493100
DS4IVTOC EQU   X'01'  .... ...1    IF ON, AN INDEX HAS BEEN CREATED@P1C 30506400
*                                     FOR THE VTOC.                @P1A 30519700
*                                  IF DS4DOSBT IS ON, THE INDEX IS @P1A 30533000
*                                     VALID.                       @P1A 30546300
*                                  IF EITHER OF THESE BITS IS OFF, @P1A 30559600
*                                    THE INDEX HAS BEEN INVALIDATED@P1A 30572900
DS4NOEXT DS    XL1                 NUMBER OF EXTENTS IN THE VTOC        30600000
DS4SMSFG DS    XL1                 SYSTEM MANAGED STORAGE INDICATORS   X30636300
                                                                   @L4A 30672600
DS4SMSTS EQU   X'C0'  11.. ....    SYSTEM MANAGED VOLUME TEST      @L4A 30708900
DS4SMS   EQU   X'C0'  11.. ....    SYSTEM MANAGED VOLUME           @L4A 30745200
*              X'80'  10.. ....    RESERVED                        @L4A 30781500
DS4SMSCV EQU   X'40'  01.. ....    SYSTEM MANAGED VOLUME IN INITIAL    X30817800
                                   STATUS                          @L4A 30854100
DS4NTSMS EQU   X'00'  00.. ....    NON SYSTEM MANAGED VOLUME       @L4A 30890400
*              X'3F'  ..11 1111    RESERVED                        @L4A 30926700
DS4DEVAC DS    AL1                 Number of alternate cylinders   @04C 30938900
*                                  Subtract from first two bytes   @04A 30951100
*                                  of DS4DEVSZ to get number of    @04A 30963300
*                                  usable cylinders.  Can be zero. @04A 30975500
*                                  Valid only if DS4DEVAV is on.   @04A 30987700
DS4DEVCT DS    0XL14               DEVICE CONSTANTS                     31000000
DS4DEVSZ DS    XL4                 DEVICE SIZE                     @P1C 31050000
         ORG   DS4DEVSZ            MAPPING OF DS4DEVSZ FIELDS      @L6A 31087500
DS4DSCYL DS    XL2                 NUMBER OF LOGICAL CYLINDERS     @L6C 31125000
*                                    (INCLUDES ALTERNATES IF ANY   @02A 31137500
*                                       EXIST)                     @02A 31150000
DS4DSTRK DS    XL2                 NUMBER OF TRACKS IN A           @L6C 31162500
*                                     LOGICAL CYLINDER             @P1A 31200000
DS4DEVTK DS    XL2                 DEVICE TRACK LENGTH                  31400000
DS4DEVOV DS    0XL2                KEYED RECORD OVERHEAD                31600000
DS4DEVI  DS    XL1                    NON-LAST KEYED RECORD OVERHEAD    31800000
DS4DEVL  DS    XL1                    LAST KEYED RECORD OVERHEAD        32000000
DS4DEVK  DS    XL1                 NON-KEYED RECORD OVERHEAD            32200000
*                                     DIFFERENTIAL                      32400000
DS4DEVFG DS    XL1                 FLAG BYTE                            32600000
DS4AMBJ  EQU   X'40'  .1.. ....    Formatted for sharing with      @05A 32600300
*                                  non MVS systems.  When this bit @05A 32600600
*                                  is on, this volume will appear  @05A 32600900
*                                  to MVS to have all space        @05A 32601200
*                                  allocated in one or more        @05A 32601500
*                                  FMT1 DSCBs.                     @05A 32601800
DS4DSF   EQU   X'20'  ..1. ....    Set by ICKDSF                   @05C 32602100
DS4DEVAV EQU   X'10'  ...1 ....    Value in DS4DEVAC, number of    @04A 32603000
*                                  alternate cylinders is valid.   @04A 32606000
*                                  Otherwise, the number is not    @04A 32609000
*                                  available in this DSCB.         @04A 32612000
*                     .... 1...    THE KEYED RECORD OVERHEAD FIELD @L3A 32615300
*                                  (DS4DEVOV) IS USED AS A 2-BYTE  @L3A 32630600
*                                  FIELD TO SPECIFY THE OVERHEAD   @L3A 32645900
*                                  REQUIRED FOR A KEYED RECORD     @L3A 32661200
*                     .... .1..    THE CCHH OF AN ABSOLUTE ADDRESS IS   32676500
*                                  USED AS A CONTINUOUS BINARY VALUE    32691800
*                     .... ..1.    THE CCHH OF AN ABSOLUTE ADDRESS IS   32707100
*                                  USED AS 4 SEPARATE BINARY VALUES     32722400
*                     .... ...1    A TOLERANCE FACTOR MUST BE APPLIED   32737700
*                                  TO ALL BUT THE LAST BLOCK OF THE     32753000
*                                  TRACK.                          @L3A 32768300
*                     XXX. ....    RESERVED BITS                   @04C 32784100
DS4DEVTL DS    XL2                 DEVICE TOLERANCE                     32800000
DS4DEVDT DS    XL1                 NUMBER OF DSCB'S PER TRACK           33000000
DS4DEVDB DS    XL1                 NUMBER OF DIRECTORY BLOCKS PER TRACK 33200000
DS4AMTIM DS    XL8                 VSAM TIME STAMP                      33250000
DS4AMCAT DS    0XL3                VSAM CATALOG INDICATOR               33300000
DS4VSIND DS    XL1                 VSAM INDICATORS                      33350000
*                     1... ....    A VSAM CATALOG REFERENCES THIS  @L3A 33351200
*                                  VOLUME.                         @L3A 33352400
*                     .1.. ....    THE VSAM DATA SETS ON THIS VOLUME    33353600
*                                  ARE UNUSUABLE BECAUSE AN MSS         33354800
*                                  CONVERTV COMMAND HAS NOT COMPLETED   33356000
*                                  SUCCESSFULLY FOR THIS VOLUME.   @L3A 33357200
*                     ..XX XXXX    RESERVED BITS                   @L3A 33358400
DS4VSCRA DS    XL2                 RELATIVE TRACK LOCATION OF THE CRA   33360000
DS4R2TIM DS    XL8                 VSAM VOLUME/CATALOG MATCH            33370000
*                                  TIME STAMP                           33380000
         DS    XL5                 RESERVED                             33400000
DS4F6PTR DS    XL5                 POINTER (CCHHR) TO FIRST FORMAT @P1C 33450000
*                                     6 DSCB OR ZERO               @P1A 33500000
DS4VTOCE DS    XL10                VTOC EXTENT DESCRIPTION              33800000
         DS    XL10                RESERVED                        @L6C 33817300
DS4EFLVL DS    CL1                 EXTENDED FREE-SPACE MANAGEMENT  @L6A 33834600
*                                  LEVEL.                          @L6A 33851900
*                                  X'00' MEANS EXTENDED FREE-      @L6A 33869200
*                                  SPACE MANAGEMENT WILL NOT BE    @L6A 33886500
*                                  USED FOR THIS VOLUME.           @L6A 33903800
*                                  X'07' MEANS WHEN IN NON-INDEXED @02C 33921100
*                                  FORMAT, FREE-SPACE MANAGED IN   @L6A 33938400
*                                  F7 DSCB'S.                      @L6A 33955700
DS4EFL00 EQU   00                  EXTENDED FREE-SPACE             @L6A 33973000
*                                  LEVEL 0.                        @L6A 33990300
DS4EFL07 EQU   07                  EXTENDED FREE-SPACE             @L6A 34007600
*                                  LEVEL 7.                        @L6A 34024900
DS4EFPTR DS    CL5                 POINTER TO EXTENDED FREE-SPACE  @L6A 34042200
*                                  INFORMATION:                    @L6A 34059500
*                                  FOR DS4LVL=X'00' THIS IS ZERO.  @L6A 34076800
*                                  FOR DS4EFLVL=X'07' THIS IS THE  @L6A 34094100
*                                  CCHHR OF THE FIRST F7 DSCB.     @L6A 34111400
         DS    XL9                 RESERVED                        @L6A 34180600
DS4END   EQU   *                   EQUATE AT END OF DSCB4          @P1C 34200000
&CTR     SETA  &CTR+1                                                   34400000
         AGO   .LOOP                                                    34600000
.FIFTHON ANOP                                                           34800000
.********************************************************************** 34805500
.*                                                                      34811000
.*    FORMAT 5 (FREE-SPACE) DSCB                                        34816500
.*                                                                      34822000
.*       +-------------+-------------+-------------+-------------+      34827500
.*    0  |     05      |     05      |     05      |     05      |      34833000
.*       +-------------+-------------+-------------+-------------+      34838500
.*    4  |EXT1  X      |      X      |      Y      |      Y      |      34844000
.*       +-------------+-------------+-------------+-------------+      34849500
.*    8  |      Z      |EXT2  X      |      X      |      Y      |      34855000
.*       +-------------+-------------+-------------+-------------+      34860500
.*                                   :             +-------------+      34866000
.*                                   :             |EXT8  X      |      34871500
.*       +-------------+-------------+-------------+-------------+      34877000
.*    40 |      X      |      Y      |      Y      |      Z      |      34882500
.*       +-------------+-------------+-------------+-------------+      34888000
.*    44 |  X'F5'      |EXT9  X      |      X      |      Y      |      34893500
.*       +-------------+-------------+-------------+-------------+      34899000
.*    48 |      Y      |      Z      |EXT10 X      |      X      |      34904500
.*       +-------------+-------------+-------------+-------------+      34910000
.*    52 |      Y      |      Y      |      Z      |EXT11 X      |      34915500
.*       +-------------+-------------+-------------+-------------+      34921000
.*                                   :                                  34926500
.*                                   :                                  34932000
.*       +-------------+-------------+-------------+-------------+      34937500
.*    124|      Z      |EXT25 X      |      X      |      Y      |      34943000
.*       +-------------+-------------+-------------+-------------+      34948500
.*    128|      Y      |      Z      |EXT26 X      |      X      |      34954000
.*       +-------------+-------------+-------------+-------------+      34959500
.*    132|      Y      |      Y      |      Z      |  CCHHR      |      34965000
.*       +-------------+-------------+-------------+-------------+      34970500
.*    136|        POINTER TO NEXT FORMAT 5 DSCB, OR ZERO         |      34976000
.*       +-------------+-------------+-------------+-------------+      34981500
.*                                                                      34987000
.********************************************************************** 34992500
* VALID ONLY IF DS4EFVLD AND DS4DOSBT ARE OFF.                     @02A 34996200
IECSDSL5 EQU   *                   FORMAT 5 DSCB                        35000000
IECSDSF5 EQU   IECSDSL5            SAME AS IECSDSL5                @P1C 35200000
DS5KEYID DS    XL4                 KEY IDENTIFIER (X'05050505')         35400000
DS5AVEXT DS    XL5                 AVAILABLE EXTENT                     35600000
*        BYTES 1 - 2     RELATIVE TRACK ADDRESS OF THE FIRST TRACK      35800000
*                        IN THE EXTENT                                  36000000
*        BYTES 3 - 4     NUMBER OF UNUSED CYLINDERS IN THE EXTENT       36200000
*        BYTE  5         NUMBER OF ADDITIONAL UNUSED TRACKS             36400000
DS5EXTAV DS    XL35                SEVEN AVAILABLE EXTENTS              36600000
DS5FMTID DS    CL1                 FORMAT IDENTIFIER (X'F5')            36800000
DS5MAVET DS    XL90                EIGHTEEN AVAILABLE EXTENTS           37000000
DS5PTRDS DS    XL5                 FORWARD CHAIN POINTER (CCHHR)   @P1C 37050000
*                                     TO FORMAT 5 DSCB OR ZERO     @P1A 37100000
DS5END   EQU   *                   EQUATE AT END OF DSCB5          @P1C 37150000
DS5EXTLN EQU   DS5EXTAV-DS5AVEXT   LENGTH OF AN EXTENT             @L6A 37200000
*                                  DESCRIPTOR IN A FMT 5           @L6A 37250000
*                                  DSCB                            @L6A 37300000
DS5EXTMX EQU   26                  MAXIMUM NUMBER OF FREE          @L6A 37350000
*                                  EXTENTS IN A FMT5 DSCB          @L6A 37400000
DS5RTALN EQU   2                   LENGTH OF AN RTA IN A FMT 5          37450000
*                                  EXTENTS IN A FMT5 DSCB          @L6A 37500000
DS5IDC   EQU   X'F5'               FORMAT 5 IDENTIFIER CONSTANT    @L6A 37550000
&CTR     SETA  &CTR+1                                                   37600000
         AGO   .LOOP                                                    37800000
.SIXTHON ANOP                                                           38000000
* MVS NO LONGER SUPPORT HTIS FORMAT OF DSCB.  ALL CODE THAT USES   @02A 38050000
* THIS CONTROL BLOCK CAN BE DELETED.                               @02A 38100000
IECSDSL6 EQU   *                   FORMAT 6 DSCB                        38200000
IECSDSF6 EQU   IECSDSL6            SAME AS IECSDSL6                @P1C 38400000
DS6KEYID DS    XL4                 KEY IDENTIFIER (X'06060606')         38600000
DS6AVEXT DS    XL5                 SHARED EXTENT DESCRIPTION            38800000
*        BYTES 1 - 2     RELATIVE TRACK ADDRESS OF THE FIRST CYLINDER   39000000
*        BYTES 3 - 4     NUMBER OF FULL CYLINDERS BEING SHARED          39200000
*        BYTE  5         NUMBER OF DATA SETS SHARING THE EXTENT         39400000
DS6EXTAV DS    XL35                SEVEN SHARED EXTENTS                 39600000
DS6FMTID DS    CL1                 FORMAT IDENTIFIER (X'F6')            39800000
DS6MAVET DS    XL90                EIGHTEEN SHARED EXTENTS              40000000
DS6PTRDS DS    XL5                 FORWARD CHAIN POINTER (CCHHR)   @P1C 40050000
*                                     TO FORMAT 6 DSCB OR ZERO     @P1A 40100000
DS6END   EQU   *                   EQUATE AT END OF DSCB6          @P1C 40150000
&CTR     SETA  &CTR+1                                                   40600000
         AGO   .LOOP                                                    40800000
.ERROR   MNOTE 7,'***INCORRECT FORMAT NUMBER'                           41000000
.ENDOFIT MEND                                                           41200000
*/*                                                                  */ 41400000
*/* **************************************************************** */ 41600000
*/*                                                                  */ 41800000
*/*                     PL/S VERSION OF IECSDSL1                     */ 41850000
*/*                                                                  */ 42200000
*/*      ******************************************************      */ 42400000
*/*                                                                  */ 42600000
*/*      BEFORE THE INCLUDE STATEMENT FOR THIS MACRO, THE            */ 42800000
*/*      VARIABLES CORRESPONDING TO THE DSCB'S TO BE MAPPED          */ 43000000
*/*      MUST BE INITIALIZED IN THE FOLLOWING MANNER -               */ 43200000
*/*                                                                  */ 43400000
*/*      FOR A FORMAT 1 DSCB -                                       */ 43600000
*/*      FORMAT1 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 43800000
*/*      F1PTR MUST BE A POINTER VARIABLE.                           */ 44000000
*/*                                                                  */ 44200000
*/*      FOR A FORMAT 2 DSCB -                                       */ 44400000
*/*      FORMAT2 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 44600000
*/*      F2PTR MUST BE A POINTER VARIABLE.                           */ 44800000
*/*                                                                  */ 45000000
*/*      FOR A FORMAT 3 DSCB -                                       */ 45200000
*/*      FORMAT3 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 45400000
*/*      F3PTR MUST BE A POINTER VARIABLE.                           */ 45600000
*/*                                                                  */ 45800000
*/*      FOR A FORMAT 4 DSCB -                                       */ 46000000
*/*      FORMAT4 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 46200000
*/*      F4PTR MUST BE A POINTER VARIABLE.                           */ 46400000
*/*                                                                  */ 46600000
*/*      FOR A FORMAT 5 DSCB -                                       */ 46800000
*/*      FORMAT5 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 47000000
*/*      F5PTR MUST BE A POINTER VARIABLE.                           */ 47200000
*/*                                                                  */ 47400000
*/*      FOR A FORMAT 6 DSCB -                                       */ 47600000
*/*      FORMAT6 MUST BE A MACRO VARIABLE SET TO 'YES'.              */ 47800000
*/*      F6PTR MUST BE A POINTER VARIABLE.                           */ 48000000
*/*                                                                  */ 48200000
*/*      NOTE THAT MORE THAN ONE DSCB CAN BE MAPPED PER INCLUDE      */ 48400000
*/*      STATEMENT BY SETTING MORE THAN ONE MACRO VARIABLE TO        */ 48600000
*/*      'YES'.  HOWEVER, THE DSCB'S WILL BE MAPPED IN ASCENDING     */ 48800000
*/*      NUMERIC SEQUENCE.  TO MAP THE DSCB'S IN NON-ASCENDING       */ 49000000
*/*      NUMERIC ORDER, SEPARATE POINTER VARIABLES MUST BE USED.     */ 49050000
*/*                                                                  */ 49200000
*/*      ******************************************************      */ 49400000
*/*                                                                  */ 49600000
*%PLSDSCB: ;                                                            49650000
*%IF FORMAT1 ~= 'YES'                   /* IF FORMAT1 = YES, THEN    */ 49800000
*    %THEN %GOTO F2;                    /* BUILD A FORMAT 1 DSCB     */ 50000000
*/*                    FORMAT 1 DSCB                                 */ 50200000
*DCL 1 IECSDSF1 BASED(F1PTR),           /* FORMAT 1 DSCB - DESCRIBED */ 50400000
*        2 *           CHAR(140);       /* IN THE FOLLOWING STRUCTURE*/ 50600000
*DCL 1 IECSDSL1 BASED(ADDR(IECSDSF1)),  /* START OF THE FORMAT 1 DSCB*/ 50800000
*        2 DS1DSNAM    CHAR(44),        /* DATA SET NAME             */ 51000000
*        2 DS1FMTID    CHAR(1),         /* FORMAT IDENTIFIER         */ 51200000
*        2 DS1DSSN     CHAR(6),         /* DATA SET SERIAL NUMBER    */ 51400000
*        2 DS1VOLSQ    CHAR(2),         /* VOLUME SEQUENCE NUMBER    */ 51600000
*        2 DS1CREDT    CHAR(3),         /* CREATION DATE             */ 51800000
*        2 DS1EXPDT    CHAR(3),         /* EXPIRATION DATE           */ 52000000
*        2 DS1NOEPV    CHAR(1),         /* NUMBER OF EXTENTS ON         52200000
*                                          VOLUME                    */ 52400000
*        2 DS1NOBDB    CHAR(1),         /* NUMBER OF BYTES USED IN      52600000
*                                          LAST DIRECTORY BLOCK (PDS    52650000
*                                          ONLY)                     */ 52700000
*        2 DS1FLAG1    CHAR(1),         /* FLAG 1                @LAA*/ 52750000
*          3 DS1COMPR BIT(1),           /* COMPRESSABLE EXTENDED        52800000
*                                            FORMAT (DS1STRP MUST       52850000
*                                            ALSO BE SET)        @LAA*/ 52900000
*          3 DS1CPOIT  BIT(1),          /* CHECKPOINTED DATASET  @03A*/ 52950000
*          3 *         BIT(6),          /* RESERVED              @03A*/ 53000000
*        2 DS1SYSCD    CHAR(13),        /* SYSTEM CODE               */ 53200000
*        2 DS1REFD     CHAR(3),         /* DATE LAST                    53250013
*                                          REFERENCED            @01C*/ 53300013
*        2 DS1SMSFG    CHAR(1),         /* SYSTEM MANAGED STORAGE       53327200
*                                          INDICATORS            @L4A*/ 53354400
*         3 DS1SMSDS   BIT(1),          /* SYSTEM MANAGED DATA SET      53381600
*                                                                @L4A*/ 53408800
*         3 DS1SMSUC   BIT(1),          /* NO BCS ENTRY EXISTS FOR      53436000
*                                          DATA SET              @P6C*/ 53463200
*         3 DS1REBLK   BIT(1),          /* SDB AND D.S. MAY BE          53483900
*                                                     REBLOCKED  @L4A*/ 53504600
*         3 DS1CRSDB   BIT(1),          /* DADSM CREATE ORIGINATED      53525300
*                                          BLOCKSIZE             @P5A*/ 53533000
*         3 DS1PDSE    BIT(1),          /* PDSE DATA SET         @P7C*/ 53535200
*         3 DS1STRP    BIT(1),          /* EXTENDED FORMAT DATA         53537400
*                                             SET                @LAC*/ 53539600
*         3 DS1PDSEX   BIT(1),          /* HFS DATA SET          @L8A*/ 53541800
*         3 DS1DSAE    BIT(1),          /* EXTENDED ATTRIBUTES          53544000
*                                             EXIST              @L9C*/ 53546200
*        2 DS1SCEXT    CHAR(3),         /* SECONDARY SPACE EXTENSION    53548400
*                                                                @L4A*/ 53552000
*         3 DS1SCXTF   BIT(8),          /* SECONDARY SPACE EXTENSION    53555600
*                                          FLAG BYTE - ONLY ONE OF THE  53557400
*                                          FOLLOWING FLAGS WILL BE      53559200
*                                          SET 'ON'              @P4C*/ 53561000
*          4 DS1SCAVB  BIT(1),          /* IF 1, DS1SCXTV = ORIGINAL    53562800
*                                          AVERAGE BLOCK LENGTH  @L4A*/ 53566400
*          4 DS1SCMB   BIT(1),          /* IF 1, DS1SCXTV IS IN         53570000
*                                                MEGABYTES       @L4A*/ 53573600
*          4 DS1SCKB   BIT(1),          /* IF 1, DS1SCXTV IS IN         53577200
*                                                KILOBYTES       @L4A*/ 53580800
*          4 DS1SCUB   BIT(1),          /* IF 1, DS1SCXTV IS IN         53584400
*                                                BYTES           @L4A*/ 53588000
*          4 DS1SCCP1  BIT(1),          /* IF 1, DS1SCXTV HAS BEEN      53588700
*                                          COMPACTED BY A FACTOR        53589100
*                                          OF 256                @P4C*/ 53589500
*          4 DS1SCCP2  BIT(1),          /* IF 1, DS1SCXTV HAS BEEN      53590100
*                                          COMPACTED BY A FACTOR        53590600
*                                          OF 65536              @P4C*/ 53591100
*         3 DS1SCXTV   FIXED(16) BDY(BYTE), /* SECONDARY SPACE          53591600
*                                              EXTENSION VALUE   @L4A*/ 53595200
*        2 DS1DSORG    CHAR(2),         /* DATA SET ORGANIZATION     */ 53600000
*         3 DS1DSRG1 CHAR(1),          /* FIRST BYTE OF DS1DSORG @L1A*/ 53607113
*          4 DS1DSGIS BIT(1),           /* IS - INDEXED                 53614213
*                                        SEQUENTIAL ORGANIZATION @L1A*/ 53621313
*          4 DS1DSGPS BIT(1),           /* PS - PHYSICAL                53628413
*                                        SEQUENTIAL ORGANIZATION @L1A*/ 53635513
*          4 DS1DSGDA BIT(1),           /* DA - DIRECT                  53642613
*                                                   ORGANIZATION @L1A*/ 53649713
*          4 DS1DSGCX BIT(1),           /* CX - BTAM OR QTAM LINE       53656813
*                                           GROUP                @L1A*/ 53663913
*          4 *   BIT(1),                /* RESERVED              @L1A*/ 53671013
*          4 *   BIT(1),                /* RESERVES              @L1A*/ 53678113
*          4 DS1DSGPO BIT(1),           /* PO - PARTITIONED             53685213
*                                           ORGANIZATION         @L1A*/ 53692313
*          4 DS1DSGU BIT(1),            /* U - UNMOVABLE, THE           53699413
*                                           DATA CONTAINS LOCATION      53706513
*                                          DEPENDENT INFORMATION @L1A*/ 53713613
*         3 DS1DSRG2 CHAR(1),          /*SECOND BYTE OF DS1DSORG @L1A*/ 53720713
*          4 DS1DSGGS BIT(1),           /* GS - GRAPHICS                53727813
*                                           ORGANIZATION         @L1A*/ 53734913
*          4 DS1DSGTX BIT(1),           /* TX - TCAM LINE GROUP  @L1A*/ 53742013
*          4 DS1DSGTQ BIT(1),          /*TQ - TCAM MESSAGE QUEUE @L1A*/ 53749113
*          4 *        BIT(1),           /* RESERVED              @LAC*/ 53756200
*          4 DS1ACBM BIT(1),            /* ACCESS METHOD CONTROL        53763313
*                                           BLOCK                @L1A*/ 53770413
*            5 DS1ORGAM BIT(1),         /*   VSAM DATA SET.      @L2A*/ 53777513
*          4 DS1DSGTR BIT(1),           /* TR - TCAM 3705        @L1A*/ 53784613
*          4 *  BIT(2),                 /*  RESERVED             @L1A*/ 53791713
*        2 DS1RECFM    CHAR(1),         /* RECORD FORMAT             */ 53800000
*        2 DS1OPTCD    CHAR(1),         /* OPTION CODE               */ 54000000
*          4 DS1OPTAM  BIT(8),          /*  VSAM OPTCD SETTINGS: @L2A*/ 54040013
*           6 DS1OPTIC BIT(1),          /*   D/S IN AN ICF CTLG  @L2A*/ 54080013
*           6 DS1OPTBC BIT(1),          /*   THIS IS AN ICF CTLG @L2A*/ 54120013
*           6 *        BIT(6),          /*   RESERVED, UNUSED.   @L2A*/ 54160013
*        2 DS1BLKL     CHAR(2),         /* BLOCK LENGTH              */ 54200000
*        2 DS1LRECL    CHAR(2),         /* RECORD LENGTH             */ 54400000
*        2 DS1KEYL     CHAR(1),         /* KEY LENGTH                */ 54600000
*        2 DS1RKP      CHAR(2),         /* RELATIVE KEY POSITION     */ 54800000
*        2 DS1DSIND    CHAR(1),         /* DATA SET INDICATORS       */ 55000000
*         3 DS1IND80    BIT(1),         /* LAST VOLUME ON               55008013
*                                          WHICH A DATA SET             55016013
*                                          RESIDES.          @G60ASBJ*/ 55024013
*         3 DS1IND40    BIT(1),         /* DATA SET IS RACF             55032013
*                                          DEFINED           @G60ASBJ*/ 55040013
*           4 DS1RACDF  BIT(1),         /* SAME USE AS DS1IND40  @LBA*/ 55044000
*         3 DS1IND20    BIT(1),         /* BLOCK LENGTH IS A            55048013
*                                        MULTIPLE OF 8 BYTES @G60ASBJ*/ 55056013
*         3 DS1IND10    BIT(1),         /* PASSWORD IS                  55064013
*                                          REQUIRED TO READ             55072013
*                                          OR WRITE OR BOTH-            55080013
*                                          SEE DS1IND04      @G60ASBJ*/ 55084013
*           4 DS1SECTY  BIT(1),         /* SAME USE AS DS1IND10  @LBA*/ 55086000
*         3 DS1IND08    BIT(1),         /* RESERVED.         @G60ASBJ*/ 55088000
*         3 DS1IND04    BIT(1),         /* IF DS1IND10 IS 1             55092013
*                                          THEN IF DS1IND04             55096013
*                                          IS . . .                     55100013
*                                          1 - PASSWORD IS              55104013
*                                          REQUIRED TO WRITE            55108013
*                                          BUT NOT TO READ              55112013
*                                          0 - PASSWORD IS              55116013
*                                          REQUIRED TO WRITE            55120013
*                                          OR TO READ            @02C*/ 55130600
*           4 DS1WRSEC  BIT(1),         /* SAME USE AS DS1IND04  @LBA*/ 55135900
*         3 DS1IND02    BIT(1),         /* DATA SET HAS BEEN            55141200
*                                          OPENED FOR OTHER             55152013
*                                          THAN INPUT SINCE             55160013
*                                          LAST BACKUP COPY             55168013
*                                          WAS MADE.         @G60ASBJ*/ 55176013
*          4 DS1DSCHA   BIT(1),         /* SAME AS DS1IND02  @G60ASBJ*/ 55184000
*         3 DS1IND01    BIT(1),         /* SECURE CHECKPOINT DATA       55188013
*                                          SET                   @01C*/ 55192013
*          4 DS1CHKPT    BIT(1),        /* SAME AS DS1IND01      @01A*/ 55196000
*        2 DS1SCALO    CHAR(4),         /* SECONDARY ALLOCATION      */ 55200000
*         3 DS1SCAL1   CHAR(1),         /* SECONDARY ALLOCATION         55211100
*                                          FLAG BYTE             @L3A*/ 55222200
*          4 DS1DSPAC    BIT(2),        /* BIT PATTERN FOR SPACE        55233300
*                                          REQUEST               @L3A*/ 55244400
*           5 DS1CYL      BIT(2),       /* CYLINDER REQUEST      @L3A*/ 55255500
*            6 DS1TRK      BIT(1),      /* TRACK REQUEST         @L3A*/ 55266600
*            6 DS1AVR      BIT(1),      /* AVERAGE BLOCK LENGTH         55277700
*                                          REQUEST               @L3A*/ 55288800
*          4 DS1MSGP     BIT(1),        /* RESERVED (WAS DS1MSGP)@LAC*/ 55303600
*          4 DS1EXT      BIT(1),        /* EXTENSION TO SECONDARY SPACE 55318400
*                                          EXISTS (DS1SCEXT)     @L4A*/ 55325800
*          4 DS1CONTG    BIT(1),        /* CONTIGUOUS REQUEST    @L3A*/ 55333200
*          4 DS1MXIG     BIT(1),        /* MXIG REQUEST          @L3A*/ 55344300
*          4 DS1ALX      BIT(1),        /* ALX REQUEST           @L3A*/ 55355400
*          4 DS1ROUND    BIT(1),        /* ROUND REQUEST         @L3A*/ 55366500
*         3 DS1SCAL3   CHAR(3),         /* SECONDARY ALLOCATION         55377600
*                                          QUANTITY              @L3A*/ 55388700
*        2 DS1LSTAR    CHAR(3),         /* LAST USED TRACK AND BLOCK    55438700
*                                          ON TRACK (TTR).  NOTE:  FOR  55488700
                                           EXTENDED FORMAT, HIGH ORDER  55538700
                                           BYTES OF TT MAY BE CONTAINED 55588700
                                           DS1TRBAL.             @02C*/ 55638700
*        2 DS1TRBAL    CHAR(2),         /* FOR EXTENDED FORMAT: 2 HIGH  55688700
                                           ORDER BYTES OF LAST USED     55738700
                                           TRACK (TTTTR).               55788700
                                           FOR PDSE, HFS, OR VSAM: ZERO 55838700
                                           OTHERWISE: CODE INDICATING   55888700
                                           SPACE REMAINING ON LAST      55938700
                                           USED TRACK.           @02C*/ 55988700
*        2 *           CHAR(2),         /* RESERVED                  */ 56200000
*        2 DS1EXNTS,                    /* THREE EXTENT FIELDS   @L1A*/ 56250013
*          3 DS1EXT1     CHAR(10),      /* FIRST EXTENT DESCRIP.        56300013
*                                          FIRST BYTE                   56600000
*                                            EXTENT TYPE INDICATOR      56800000
*                                          SECOND BYTE                  57000000
*                                            EXTENT SEQUENCE NUMBER     57200000
*                                          THIRD - SIXTH BYTES          57400000
*                                            LOWER LIMIT                57600000
*                                          SEVENTH - TENTH BYTES        57800000
*                                            UPPER LIMIT         @L1C*/ 58000013
*          3 DS1EXT2     CHAR(10),      /* SECOND EXTENT DESCRIP.@L1C*/ 58050000
*          3 DS1EXT3     CHAR(10),      /* THIRD EXTENT DESCRIP. @L1C*/ 58400013
*        2 DS1PTRDS    CHAR(5),         /* POSSIBLE PTR TO A FORMAT     58600000
*                                          2 OR 3 DSCB               */ 58800000
*        2 DS1END      CHAR(0);         /* END OF THE FORMAT 1 DSCB  */ 59000000
*%F2: ;                                                                 59200000
*%IF FORMAT2 ~= 'YES'                   /* IF FORMAT2 = YES, THEN    */ 59400000
*    %THEN %GOTO F3;                    /* BUILD A FORMAT 2 DSCB     */ 59600000
*/*                    FORMAT 2 DSCB                                 */ 59800000
*DCL 1 IECSDSF2 BASED(F2PTR),           /* FORMAT 2 DSCB - DESCRIBED */ 60000000
*        2 *           CHAR(140);       /* IN THE FOLLOWING STRUCTURE*/ 60200000
*DCL 1 IECSDSL2 BASED(ADDR(IECSDSF2)),  /* START OF THE FORMAT 2 DSCB*/ 60400000
*        2 *           CHAR(1),         /* KEY IDENTIFIER            */ 60600000
*        2 DS22MIND    CHAR(7),         /* ADDRESS OF 2ND LEVEL         60800000
*                                          MASTER INDEX              */ 61000000
*        2 DS2L2MEN    CHAR(5),         /* LAST 2ND LEVEL MASTER        61200000
*                                          INDEX ENTRY               */ 61400000
*        2 DS23MIND    CHAR(7),         /* ADDRESS OF 3RD LEVEL         61600000
*                                          MASTER INDEX              */ 61800000
*        2 DS2L3MIN    CHAR(5),         /* LAST 3RD LEVEL MASTER        62000000
*                                          INDEX ENTRY               */ 62200000
*        2 *           CHAR(11),        /* RESERVED                  */ 62400000
*        2 DS2LPDT     CHAR(8),         /* LAST PRIME TRACK ON THE      62600000
*                                          LAST PRIME CYLINDER       */ 62800000
*        2 DS2FMTID    CHAR(1),         /* FORMAT IDENTIFIER         */ 63000000
*        2 DS2NOLEV    CHAR(1),         /* NUMBER OF INDEX LEVELS    */ 63200000
*        2 DS2DVIND    CHAR(1),         /* HIGH LEVEL INDEX             63400000
*                                          DEVELOPMENT INDICATOR     */ 63600000
*        2 DS21RCYL    CHAR(3),         /* FIRST DATA RECORD ON         63800000
*                                          EACH CYLINDER             */ 64000000
*        2 DS2LTCYL    CHAR(2),         /* LAST DATA TRACK ON           64200000
*                                          EACH CYLINDER             */ 64400000
*        2 DS2CYLOV    CHAR(1),         /* NUMBER OF TRACKS FOR         64600000
*                                          CYLINDER OVERFLOW         */ 64800000
*        2 DS2HIRIN    CHAR(1),         /* HIGHEST 'R' ON HIGH-LEVEL    65000000
*                                          INDEX TRACK               */ 65200000
*        2 DS2HIRPR    CHAR(1),         /* HIGHEST 'R' ON PRIME         65400000
*                                          DATA TRACKS               */ 65600000
*        2 DS2HIROV    CHAR(1),         /* HIGHEST 'R' ON OVERFLOW      65800000
*                                          DATA TRACKS               */ 66000000
*        2 DS2RSHTR    CHAR(1),         /* 'R' OF LAST DATA RECORD      66200000
*                                          ON A SHARED TRACK         */ 66400000
*        2 DS2HIRTI    CHAR(1),         /* HIGHEST 'R' ON UNSHARED      66600000
*                                          TRACK OF THE TRACK INDEX  */ 66800000
*        2 DS2HIIOV    CHAR(1),         /* HIGHEST 'R' FOR INDEPENDENT  67000000
*                                          OVERFLOW DATA TRACKS      */ 67200000
*        2 DS2TAGDT    CHAR(2),         /* TAG DELETION COUNT        */ 67600000
*        2 DS2RORG3    CHAR(3),         /* NON-FIRST OVERFLOW           67800000
*                                          REFERENCE COUNT           */ 68000000
*        2 DS2NOBYT    CHAR(2),         /* NUMBER OF BYTES FOR          68200000
*                                          HIGHEST-LEVEL INDEX       */ 68400000
*        2 DS2NOTRK    CHAR(1),         /* NUMBER OF TRACKS FOR         68600000
*                                          HIGHEST-LEVEL INDEX       */ 68800000
*        2 DS2PRCTR    CHAR(4),         /* PRIME RECORD COUNT        */ 69000000
*        2 DS2STIND    CHAR(1),         /* STATUS INDICATORS         */ 69200000
*        2 DS2CYLAD    CHAR(7),         /* ADDRESS OF CYLINDER INDEX */ 69400000
*        2 DS2ADLIN    CHAR(7),         /* ADDRESS OF LOWEST LEVEL      69600000
*                                          MASTER INDEX              */ 69800000
*        2 DS2ADHIN    CHAR(7),         /* ADDRESS OF HIGHEST LEVEL     70000000
*                                          MASTER INDEX              */ 70200000
*        2 DS2LPRAD    CHAR(8),         /* LAST PRIME DATA RECORD       70400000
*                                          ADDRESS                   */ 70600000
*        2 DS2LTRAD    CHAR(5),         /* LAST TRACK INDEX ENTRY       70800000
*                                          ADDRESS                   */ 71000000
*        2 DS2LCYAD    CHAR(5),         /* LAST CYLINDER INDEX          71200000
*                                          ENTRY ADDRESS             */ 71400000
*        2 DS2LMSAD    CHAR(5),         /* LAST MASTER INDEX ENTRY      71600000
*                                          ADDRESS                   */ 71800000
*        2 DS2LOVAD    CHAR(8),         /* LAST INDEPENDENT OVERFLOW    72000000
*                                          RECORD ADDRESS            */ 72200000
*        2 DS2BYOVL    CHAR(2),         /* BYTES REMAINING ON           72400000
*                                          OVERFLOW TRACK            */ 72600000
*        2 DS2RORG2    CHAR(2),         /* TRACKS REMAINING IN          72800000
*                                          INDEPENDENT OVERFLOW AREA */ 73000000
*        2 DS2OVRCT    CHAR(2),         /* OVERFLOW RECORD COUNT     */ 73200000
*        2 DS2RORG1    CHAR(2),         /* CYLINDER OVERFLOW AREA       73400000
*                                          COUNT                     */ 73600000
*        2 DS2NIRT     CHAR(3),         /* DUMMY TRACK INDEX ENTRY      73800000
*                                          ADDRESS                   */ 74000000
*        2 DS2PTRDS    CHAR(5),         /* POSSIBLE POINTER TO A        74200000
*                                          FORMAT 3 DSCB             */ 74400000
*        2 DS2END      CHAR(0);         /* END OF THE FORMAT 2 DSCB  */ 74600000
*%F3: ;                                                                 74800000
*%IF FORMAT3 ~= 'YES'                   /* IF FORMAT3 = YES, THEN    */ 75000000
*    %THEN %GOTO F4;                    /* BUILD A FORMAT 3 DSCB     */ 75200000
*/*                    FORMAT 3 DSCB                                 */ 75400000
*DCL 1 IECSDSF3 BASED(F3PTR),           /* FORMAT 3 DSCB - DESCRIBED */ 75600000
*        2 DS3DSCB     CHAR(140);       /* IN THE FOLLOWING STRUCTURE*/ 75800000
*DCL 1 IECSDSL3 BASED(ADDR(IECSDSF3)),  /* START OF THE FORMAT 3 DSCB*/ 76000000
*        2 DS3KEYID    CHAR(4),         /* KEY IDENTIFIER        @L6C*/ 76050000
*        2 DS3EXTNT    CHAR(40),        /* 4 EXTENT DESCRIPTIONS @L6C*/ 76100000
*          3 DS3EXT1   CHAR(10),        /* FIRST EXTENT DESCIPTOR       76150000
*                                          FIRST BYTE                   76600000
*                                            EXTENT TYPE INDICATOR      76800000
*                                          SECOND BYTE                  77000000
*                                            EXTENT SEQUENCE NUMBER     77200000
*                                          THIRD - SIXTH BYTES          77400000
*                                            LOWER LIMIT                77600000
*                                          SEVENTH - TENTH BYTES        77800000
*                                            UPPER LIMIT             */ 78000000
*          3 *         CHAR(30),        /* 3 MORE EXTENTS        @L6A*/ 78050000
*        2 DS3FMTID    CHAR(1),         /* FORMAT IDENTIFIER         */ 78200000
*        2 DS3ADEXT    CHAR(90),        /* NINE ADDITIONAL EXTENT       78400000
*                                          DESCRIPTIONS              */ 78600000
*        2 DS3PTRDS    CHAR(5),         /* Forward chain ptr (CCHHR)    78650000
*                                          to FMT3 DSCB or zero.     */ 78700000
*        2 DS3END      CHAR(0);         /* END OF THE FORMAT 3 DSCB  */ 79000000
*                                                                       79008313
*DCL 1 DS3EXTBL(4) DEF(DS3EXTNT),       /* ONE EXTENT DESCRIPTION       79016613
*                                          (FOUR TIMES)              */ 79024913
*        2 DS3EXTYP  CHAR(1),           /* FIRST BYTE                   79033213
*                                            EXTENT TYPE INDICATOR   */ 79041513
*        2 DS3EXTSN  CHAR(1),           /* SECOND BYTE                  79049813
*                                            EXTENT SEQUENCE NUMBER  */ 79058113
*        2 DS3EXTLL  CHAR(4),           /* THIRD - SIXTH BYTES          79066413
*                                            LOWER LIMIT             */ 79074713
*        2 DS3EXTUL  CHAR(4);           /* SEVENTH - TENTH BYTES        79083013
*                                            UPPER LIMIT             */ 79091313
*                                                                       79099613
*DCL 1 DS3ADTBL(9) DEF(DS3ADEXT),       /* ONE ADDITIONAL EXTENT        79107913
*                                          DESCRIPTION (NINE TIMES)  */ 79116213
*        2 DS3ADTYP  CHAR(1),           /* FIRST BYTE                   79124513
*                                            EXTENT TYPE INDICATOR   */ 79132813
*        2 DS3ADTSN  CHAR(1),           /* SECOND BYTE                  79141113
*                                            EXTENT SEQUENCE NUMBER  */ 79149413
*        2 DS3ADTLL  CHAR(4),           /* THIRD - SIXTH BYTES          79157713
*                                            LOWER LIMIT             */ 79166013
*        2 DS3ADTUL  CHAR(4);           /* SEVENTH - TENTH BYTES        79174313
*                                            UPPER LIMIT             */ 79182613
*                                                                       79190913
*%F4: ;                                                                 79200000
*%IF FORMAT4 ~= 'YES'                   /* IF FORMAT4 = YES, THEN    */ 79400000
*    %THEN %GOTO F5;                    /* BUILD A FORMAT 4 DSCB     */ 79600000
*/*                    FORMAT 4 DSCB                                 */ 79800000
*DCL 1 IECSDSF4 BASED(F4PTR),           /* FORMAT 4 DSCB - DESCRIBED */ 80000000
*        2 *           CHAR(96);        /* IN THE FOLLOWING STRUCTURE*/ 80200000
*DCL 1 IECSDSL4 BASED(ADDR(IECSDSF4)),  /* START OF THE FORMAT 4 DSCB*/ 80400000
*        2 DS4IDFMT    CHAR(1),         /* FORMAT IDENTIFIER         */ 80600000
*        2 DS4HPCHR    CHAR(5),         /* HIGHEST ADDRESS OF A         80800000
*                                          FORMAT 1 DSCB             */ 81000000
*        2 DS4DSREC    CHAR(2),         /* NUMBER OF AVAILABLE DSCB'S*/ 81200000
*        2 DS4HCCHH    CHAR(4),         /* CCHH OF NEXT AVAILABLE       81600000
*                                          ALTERNATE TRACK           */ 81800000
*        2 DS4NOATK    CHAR(2),         /* NUMBER OF REMAINING          82000000
*                                          ALTERNATE TRACKS          */ 82200000
*        2 DS4VTOCI     BIT(8),         /* VTOC INDICATORS       @L1C*/ 82240013
*         3 DS4DOSBT    BIT(1), /* VSE CONTAMINATION BIT(WAS DOS)@L6A*/ 82245500
*                               /* ON IMPLIES F5 DSCB CHAIN IS       */ 82251000
*                               /* INVALID.  ONE OF THE          @02C*/ 82256500
*                               /* FOLLOWING IS TRUE:  FREE      @02C*/ 82262000
*                               /* SPACE INFORMATION IS          @02C*/ 82267500
*                               /* MAINTAINED IN THE VTOC INDEX  @02C*/ 82273000
*                               /* (SEE DS4IVTOC), OR FREE SPACE @02C*/ 82278500
*                               /* INFO IS MAINTAINED IN THE     @02C*/ 82284000
*                               /* FORMAT 7 CHAIN (SEE DS4EFVLD) @02C*/ 82289500
*                               /* OR FREE SPACE INFORMATION IS  @02C*/ 82295000
*                               /* NOT AVAILABLE.                @02C*/ 82300500
*         3 DS4DVTOC    BIT(1),         /* INDEX WAS DISABLED    @P2A*/ 82306600
*         3 DS4EFVLD    BIT(1), /* EXTENDED FREE-SPACE MANAGEMENT@L6A*/ 82313200
*                               /* VALIDITY FLAG.  ON IMPLIES    @L6A*/ 82319800
*                               /* EXTENDED FREE-SPACE MANAGEMENT@L6A*/ 82326400
*                               /* IS ACTIVE AND FREE-SPACE IS   @L6A*/ 82333000
*                               /* VALID.  SEE DS4EFLVL.         @L6A*/ 82339600
*         3 DS4DSTKP    BIT(1),         /* VSE STACKED PACK      @L1A*/ 82373000
*         3 DS4DOCVT    BIT(1),         /* VSE CONVERTED VTOC    @L1A*/ 82406400
*         3 DS4DIRF     BIT(1),         /* DIRF BIT              @L1A*/ 82440013
*         3 DS4DICVT    BIT(1),         /* DIRF RECLAIMED        @L1A*/ 82480013
*         3 DS4IVTOC    BIT(1),         /* VOLUME USES AN INDEXED       82520013
*                                          VTOC                  @L1A*/ 82560000
*        2 DS4NOEXT    CHAR(1),         /* NUMBER OF EXTENTS IN VTOC */ 82600000
*        2 DS4SMSFG    CHAR(1),         /* SYSTEM MANAGED STORAGE       82633300
*                                          INDICATORS            @L4A*/ 82666600
*         3 DS4SMSTS   BIT(2),          /* SYSTEM MANAGED VOLUME TEST   82699900
*                                          11 - SYSTEM MANAGED VOLUME,  82733200
*                                          10 - RESERVED,               82766500
*                                          01 - SYSTEM MANAGED VOLUME   82799800
*                                               IN INITIAL STATUS,      82833100
*                                          00 - NON SYSTEM MANAGED      82866400
*                                               VOLUME           @L4A*/ 82899700
*         3 *          BIT(6),          /* RESERVED              @L4A*/ 82933000
*        2 DS4DEVAC    CHAR(1),         /* Number of alternate          82942500
                                           cylinders.  Subtract from    82952000
                                           first two bytes of DS4DEVSZ  82961500
                                           to get number of usable      82971000
                                           cylinders. Can be zero. Valid82980500
                                           only if DS4DEVAV on.  @04C*/ 82990000
*        2 DS4DEVCT    CHAR(14),        /* DEVICE CONSTANTS          */ 83000000
*         3 DS4DEVSZ    CHAR(4),        /* DEVICE SIZE               */ 83200000
*          4 DS4DSCYL    CHAR(2),       /* NUMBER OF LOGICAL CYLS       83225000
*                                          (INCLUDES ALTERNATES         83250000
*                                           IF ANY EXIST)        @02C*/ 83275000
*          4 DS4DSTRK    CHAR(2),       /* NUMBER OF TRACKS IN A        83300000
*                                          LOGICAL CYLINDER      @L6A*/ 83350000
*         3 DS4DEVTK    CHAR(2),        /* DEVICE TRACK LENGTH       */ 83400000
*         3 DS4DEVOV    CHAR(2),        /* KEYED RECORD OVERHEAD     */ 83600000
*          4 DS4DEVI     CHAR(1),       /* - NON-LAST KEYED RECORD      83800000
*                                            OVERHEAD                */ 84000000
*          4 DS4DEVL     CHAR(1),       /* - LAST KEYED RECORD          84200000
*                                            OVERHEAD                */ 84400000
*         3 DS4DEVK     CHAR(1),        /* NON-KEYED RECORD OVERHEAD    84600000
*                                          DIFFERENTIAL              */ 84800000
*         3 DS4DEVFG    CHAR(1),        /* FLAG BYTE                 */ 85200000
*          4 DS4RSVD     BIT(1),        /* Reserved              @06C*/ 85206300
*          4 DS4AMBJ     BIT(1),        /* Formatted for sharing with   85212600
*                                       non MVS systems.  When this bit 85218900
*                                       is on, this volume will appear  85225200
*                                       to MVS to have all space        85231500
*                                       allocated in one or more        85237800
*                                       FMT1 DSCBs.              @06A*/ 85244100
*          4 DS4DSF      BIT(1),        /* Set by ICKDSF         @06C*/ 85250400
*          4 DS4DEVAV    BIT(1),        /* Value in DS4DEVAC, number of 85257000
*                                          alternate cylinders, is      85285500
*                                          valid.  Otherwise the number 85314000
*                                          is not available in this     85342500
*                                          DSCB.                 @04A*/ 85371000
*         3 DS4DEVTL    CHAR(2),        /* DEVICE TOLERANCE          */ 85400000
*         3 DS4DEVDT    CHAR(1),        /* NUMBER OF DSCB'S PER TRACK*/ 85600000
*         3 DS4DEVDB    CHAR(1),        /* NUMBER OF DIRECTORY          86000000
*                                          BLOCKS PER TRACK          */ 86200000
*        2 DS4AMTIM    CHAR(8),         /* VSAM TIME STAMP           */ 86250000
*        2 DS4AMCAT    CHAR(3),         /* VSAM CATALOG INDICATOR    */ 86300000
*         3 DS4VSIND    BIT(8),         /* VSAM INDICATORS           */ 86350000
*          4 DS4VSREF    BIT(1),        /* A VSAM CATALOG REFERENCES    86360000
*                                          THIS VOLUME               */ 86370000
*          4 DS4VSBAD    BIT(1),        /* VSAM DATA SETS ON VOLUME     86380000
*                                          ARE UNUSABLE              */ 86390000
*          4 *           BIT(6),        /* RESERVED                  */ 86392000
*         3 DS4VSCRA    PTR(16) BDY(BYTE),/* RELATIVE TRACK LOCATION    86394000
*                                          OF THE CRA                */ 86396000
*        2 DS4R2TIM    CHAR(8),         /* VSAM VOLUME/CATALOG MATCH    86446000
*                                          TIME STAMP                */ 86496000
*        2 *           CHAR(5),         /* RESERVED                  */ 86546000
*        2 DS4F6PTR    CHAR(5),         /* POINTER TO FIRST FORMAT      86600000
*                                          6 DSCB                    */ 86800000
*        2 DS4VTOCE    CHAR(10),        /* VTOC EXTENT DESCRIPTION   */ 87000000
*        2 *           CHAR(10),        /* RESERVED                  */ 87022200
*        2 DS4EFLVL    FIXED(8),/* EXTENDED FREE-SPACE MANAGEMENT@L6A*/ 87044400
*                               /* LEVEL.                        @L6A*/ 87066600
*                               /* X'00' MEANS EXTENDED FREE-    @L6A*/ 87088800
*                               /* SPACE MANAGEMENT WILL NOT BE  @L6A*/ 87111000
*                               /* USED FOR THIS VOLUME.         @L6A*/ 87133200
*                               /* X'07' MEANS WHEN IN NON-INDEX @02C*/ 87155400
*                               /* FORMAT, FREE-SPACE MANAGED IN @L6A*/ 87177600
*                               /* F7 DSCB'S.                    @L6A*/ 87199800
*        2 DS4EFPTR    CHAR(5), /* POINTER TO EXTENDED FREE-SPACE@L6A*/ 87222000
*                               /* INFORMATION:                  @L6A*/ 87244200
*                               /* FOR DS4EFLVL=X'00' THIS IS 0. @L6A*/ 87266400
*                               /* FOR DS4EFLVL=X'07' THIS IS THE@L6A*/ 87288600
*                               /* CCHHR OF THE FIRST F7 DSCB.   @L6A*/ 87310800
*        2 *           CHAR(9), /* RESERVED                      @L6A*/ 87377400
*        2 DS4END      CHAR(0);         /* END OF THE FORMAT 4 DSCB  */ 87400000
*DCL DS4SMS   BIT(2) CONSTANT('11'B);   /* SYSTEM MANAGED VOLUME @P3C*/ 87433300
*DCL DS4SMSCV BIT(2) CONSTANT('01'B);   /* SYSTEM MANAGED VOLUME IN     87466600
*                                          INITIAL STATUS        @P3C*/ 87499900
*DCL DS4NTSMS BIT(2) CONSTANT('00'B);   /* NON SYSTEM MANAGED VOLUME    87533200
*                                                                @P3C*/ 87566500
*DCL DS4EFL00 FIXED(8) CONSTANT(0);     /* EXTENDED FREE-SPACE   @L6A*/ 87573200
*                                       /* LEVEL 0.              @L6A*/ 87579900
*DCL DS4EFL07 FIXED(8) CONSTANT(7);     /* EXTENDED FREE-SPACE   @L6A*/ 87586600
*                                       /* LEVEL 7.              @L6A*/ 87593300
*%F5: ;                                                                 87600000
*%IF FORMAT5 ~= 'YES'                   /* IF FORMAT5 = YES, THEN    */ 87800000
*    %THEN %GOTO F6;                    /* BUILD A FORMAT 5 DSCB     */ 88000000
*/*                    FORMAT 5 DSCB                                 */ 88200000
*DCL 1 IECSDSF5 BASED(F5PTR),           /* FORMAT 5 DSCB - DESCRIBED */ 88400000
*        2 *           CHAR(140);       /* IN THE FOLLOWING STRUCTURE*/ 88600000
*DCL 1 IECSDSL5 BASED(ADDR(IECSDSF5)),  /* START OF THE FORMAT 5 DSCB*/ 88800000
*        2 DS5KEYID    CHAR(4),         /* KEY IDENTIFIER            */ 89000000
*        2 DS5AVEXT    CHAR(5),         /* FIRST AVAILABLE (FREE-SPACE) 89050000
*                                          EXTENT.  FMT 5 EXTENTS ARE   89100000
*                                          IN XXYYZ FORMAT.  SEE        89150000
*                                          DS5EXT BELOW.         @L6C*/ 89200000
*        2 DS5EXTAV    CHAR(35),        /* SEVEN AVAILABLE EXTENTS   */ 91400000
*        2 DS5FMTID    CHAR(1),         /* FORMAT IDENTIFIER         */ 91600000
*        2 DS5MAVET    CHAR(90),        /* EIGHTEEN AVAILABLE EXTENTS*/ 91800000
*        2 DS5PTRDS    CHAR(5),         /* POINTER TO NEXT FORMAT 5     92200000
*                                          DSCB                      */ 92400000
*        2 DS5END      CHAR(0);         /* END OF THE FORMAT 5 DSCB  */ 92600000
*                                       /* DSCB                  @L6A*/ 92601200
*DCL 1 DS5EXT BASED,                    /* MAPPING OF AN F5      @L6A*/ 92602400
*                                       /* EXTENT ENTRY (XXYYZ). @L6A*/ 92603600
*     2 DS5EXTXX FIXED(16),             /* RTA OF FIRST TRACK OF @L6A*/ 92604800
*                                       /* THE FREE EXTENT.      @L6A*/ 92606000
*     2 DS5EXTYY FIXED(16),             /* NUMBER OF WHOLE       @L6A*/ 92607200
*                                       /* CYLINDERS IN THE      @L6A*/ 92608400
*                                       /* FREE EXTENT.          @L6A*/ 92609600
*     2 DS5EXTZ  FIXED(8);              /* NUMBER OF ADDITIONAL  @L6A*/ 92610800
*                                       /* TRACKS, NOT WITHIN    @L6A*/ 92612000
*                                       /* WHOLE CYLINDERS, THAT @L6A*/ 92613200
*                                       /* ARE PART OF THE FREE  @L6A*/ 92614400
*                                       /* EXTENT.               @L6A*/ 92615600
*DCL DS5EXTLN FIXED(8)                  /* LENGTH OF AN EXTENT       */ 92618100
*             CONSTANT(LENGTH(DS5AVEXT)); /* DESCRIPTOR IN A FMT 5   */ 92636200
*                                         /* DSCB                @L6A*/ 92654300
*DCL DS5EXTMX FIXED(8) CONSTANT(26);    /* MAXIMUM NUMBER OF FREE    */ 92672400
*                                       /* EXTENTS IN A FMT5 DSCB@L6A*/ 92690500
*DCL DS5RTALN FIXED(8)                  /* LENGTH OF AN RTA IN A     */ 92708600
*             CONSTANT(2);              /* FMT 5 DSCB EXTENT         */ 92726700
*                                       /* DESCRIPTOR            @L6A*/ 92744800
*DCL DS5IDC   BIT(8)                    /* FORMAT 5 IDENTIFIER       */ 92762900
*             CONSTANT('F5'X);          /* CONSTANT              @L6A*/ 92781000
*%F6: ;                                                                 92800000
*%IF FORMAT6 ~= 'YES'                   /* IF FORMAT6 = YES, THEN    */ 93000000
*    %THEN %GOTO MACROEND;              /* BUILD A FORMAT 6 DSCB     */ 93200000
*/*                    FORMAT 6 DSCB                                 */ 93400000
*DCL 1 IECSDSF6 BASED(F6PTR),           /* FORMAT 6 DSCB - DESCRIBED */ 93600000
*        2 *           CHAR(140);       /* IN THE FOLLOWING STRUCTURE*/ 93800000
*DCL 1 IECSDSL6 BASED(ADDR(IECSDSF6)),  /* START OF THE FORMAT 6 DSCB*/ 94000000
*        2 DS6KEYID    CHAR(4),         /* KEY IDENTIFIER            */ 94200000
*        2 DS6AVEXT    CHAR(5),         /* SHARED EXTENT DESCRIPTION    94400000
*                                          BYTES 1 - 2                  94600000
*                                            RELATIVE TRACK ADDRESS     94800000
*                                            OF THE FIRST CYLINDER      95000000
*                                          BYTES 3 - 4                  95200000
*                                            NUMBER OF FULL             95400000
*                                            CYLINDERS BEING SHARED     95600000
*                                          BYTE 5                       95800000
*                                            NUMBER OF DATA SETS        96000000
*                                            SHARING THE EXTENT      */ 96200000
*        2 DS6EXTAV    CHAR(35),        /* SEVEN SHARED EXTENTS      */ 96400000
*        2 DS6FMTID    CHAR(1),         /* FORMAT IDENTIFIER         */ 96600000
*        2 DS6MAVET    CHAR(90),        /* EIGHTEEN SHARED EXTENTS   */ 96800000
*        2 DS6PTRDS    CHAR(5),         /* POINTER TO NEXT FORMAT 6     97000000
*                                          DSCB                      */ 97200000
*        2 DS6END      CHAR(0);         /* END OF THE FORMAT 6 DSCB  */ 97400000
*%MACROEND: ;                                                           97600000
