*%GOTO   UCBCX;     /* TAPE CLASS EXTENSION MAPPING MACRO               00050000
         MACRO                                                          00100000
&LABEL   IECUCBCX                                                       00150000
.*******************   START OF SPECIFICATIONS   ********************** 00200000
.*                                                                      00250000
.* $MAC(IECUCBCX):     UCB TAPE CLASS EXTENSION                         00300000
.*                                                                      00350000
.*PROPRIETARY V3 STATEMENT                                              00375000
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00400000
.*"RESTRICTED MATERIALS OF IBM"                                         00425000
.*5694-A01                                                              00454100
.*(C) COPYRIGHT 1984,2000  IBM CORP.                                    00483200
.*END PROPRIETARY V3 STATEMENT                                          00512500
.*                                                                      00550000
.* STATUS =   OS/390 DFSMS 3.10                                         00600000
.*                                                                      00650000
.* FUNCTION = THIS MACRO MAPS THE UCB TAPE CLASS EXTENSION (UCBCX)      00700000
.*                                                                      00750000
.* NOTES =  THE TAPE CLASS EXTENSION AREA GENERATED FOR A UCB           00782100
.*          WILL BE ADDRESSED BY UCBCLEXT, A 4 BYTE POINTER, IN         00814200
.*          THE UCB COMMON EXTENSION.  THE CLASS EXTENSION IS      @H3C 00846300
.*          GENERATED FOR ALL TAPE DEVICES.  THE EXTENSION IS      @H3C 00878400
.*          THE SAME LENGTH FOR ALL TAPE DEVICES WHEN THE 3590     @H3A 00910500
.*          SUPPORT IS INSTALLED AND AN IOGEN PERFORMED.           @H3A 00942600
.*                                                                 @H3A 00974700
.*          THE POINTER WILL BE ZERO WHEN NO CLASS EXTENSION            01006800
.*          EXISTS.  THE TAPE CLASS EXTENSION WILL CONTAIN ZEROES       01038900
.*          AT IPL.  FOR ANSI, THE MAIN PURPOSE OF THE CLASS            01071000
.*          EXTENSION IS TO HOLD VOLUME LABEL DATA ACROSS OPENS         01103100
.*          WHEN THERE IS NO INTERVENING VOLUME LABEL                   01135200
.*          REVERIFICATION.                                             01167300
.*                                                                      01200000
.* PATCH-LABEL = NOT APPLICABLE                                         01250000
.*                                                                      01300000
.* MODULE-TYPE = MACRO                                                  01350000
.*                                                                      01400000
.*    PROCESSOR = PLX OR BAL                                       @H3C 01450000
.*                                                                      01500000
.*    ATTRIBUTES = MAPPING MACRO                                        01550000
.*                                                                      01600000
.* ENTRY-POINT = IECUCBCX                                               01650000
.*                                                                      01700000
.*    PURPOSE = SEE FUNCTION ABOVE                                      01750000
.*                                                                      01800000
.*    LINKAGE = PLX - INCLUDE IECUCBCX                             @H3C 01850000
.*              BAL - IECUCBCX                                          01900000
.*                                                                      01950000
.*    INPUT   = NONE                                                    02000000
.*                                                                      02050000
.*    OUTPUT  = UCBCX EXPANSION                                         02100000
.*                                                                      02150000
.* EXIT-NORMAL = END OR MEND STATEMENT                                  02200000
.*                                                                      02250000
.* EXIT-ERROR = NONE                                                    02300000
.*                                                                      02350000
.* EXTERNAL-REFERENCES = N/A                                            02400000
.*                                                                      02450000
.* TABLES = NONE                                                        02500000
.*                                                                      02550000
.* MACROS = NONE                                                        02600000
.*                                                                      02650000
.* CHANGE-ACTIVITY =                                                    02700000
.*                                                                      02750000
.* $L0=ANSI,JDP1111,STLGLA:          ANSI-78 TAPE LABEL SUPPORT    @L0A 02775000
.* $H1=3480,JDP1111,STLLRU:          NEW DEVICE SUPPORT            @H1A 02800000
.* $L2=DFP/XA,HDP2210,84115,STLRGB:  NEW COPYRIGHT MACRO           @L2A 02825000
.* $01=OY03916,HDP2230,86230,STLJDL: 3480 LABEL PERFORMANCE        @01C 02850000
.* $H2=NEWTAPES,JDP2231,87290,STLPD: O/C/E 9348, 3424 TAPE SUPPORT @H2A 02875000
.* $02=OY32510,HDP3320,,GPDJAL: IEC706I OVERRIDE TO NON-COMPACT    @02A 02885000
.* $L3=TAPELIB,HDP4410,,SJPLRDB:     FLAGSTAFF SUPPORT             @L3A 02892500
.* $L4=K130370,HDZ11C0,941294,SJPLJAL: LBL1 DSSN CHG FROM TECH OFF @L4A 02896200
.* $H3=OW21115,HDZ11C0,SJPLLRU:      3590 SUPPORT                  @H3A 02897100
.* $F1=OW21115,HDZ11C0,SJPLLRU:      REDUCED FUNCTION 3590         @F1A 02898000
.* $H5=OW25293,HDZ11C0,SJPLRDB:      TAPE LIBRARY HCD SUPPORT      @H5A 02899000
.* $H6=OW27448,HDZ11B0,SJPLGSJ:      FCR0249 - ADDED ERDS PHYSICAL      02899300
.*                                   IDENTIFIER                    @H6A 02899600
.* $03=OW33525,HDZ11C0,SJPLJAL: LACS WAIT INCORRECTLY BYPASSED     @03A 02911990
.* $H7=OW34237,HDZ11C0,SJPLGSJ:      FIBER CHANNEL SUPPORT         @H7A 02915980
.* $P1=ANSIV4,HDZ11E0,SJPLGEC:       ANSI VERSION 4 TAPE LABEL     @P1A 02919970
.*                                   SUPPORT                       @P1A 02923960
.* $P2=SAMGT32,HDZ11F0,SJPLGSJ:      SAM GREATER THAN 32K SUPPORT  @P2A 02927950
.* $H8=OW40361,HDZ11E0,SJPLLRU:      BLYTHE2 SUPPORT                    02931940
.*                                   - ADD NEW EPI VALUES               02938400
.*                                   - ADD INDICATOR THAT THE DEVICE    02939400
.*                                     SUPPORTS MEDIUM SENSE CCW   @H8A 02940400
.* $04=OW40508,HDZ11C0,SJPLGSJ: NO CODE CHANGE - JUST RESHIP TO ADD     02940800
.*                              ++HOLD INFO AND COMMENTS           @04A 02941200
.* $P3=KFI0091,HDZ11F0,SJPLJAL: SAVE PSEUDO LABEL BLOCKIDS         @P3A 02941400
.* $05=OW38717,HDZ11E0,SJPLJAL: SHIP IN OW38717                    @05A 02941500
.* $06=OW42430,HDZ11E0,SJPLLRU: RESTORE X'04' EPI DEFINITION       @06A 02944300
.* $07=OW44530,HDZ11C0,SJPLGSJ: THIS APAR WAS WRITTEN TO FIX A          02944390
.*                              PROBLEM IN IECTTRAP.  ADDED IECTDSRV    02944480
.*                              AND IECUCBCX TO IT TO FIX A PROBLEM     02944570
.*                              THAT TAPE MICROCODE RAN INTO.  CHECK    02944750
.*                              RDC DATA TO SEE IF THE PSF/SSC ORDER    02944840
.*                              IS SUPPORTED PRIOR TO ISSUING IT.       02944930
.*                              ISSUING THE COMMAND WITHOUT MICROCODE   02945020
.*                              SUPPORT COULD CAUSE THE CONTROL TO      02945110
.*                              CRASH.  NONE OF THIS HAD ANYTHING       02945200
.*                              TO DO WITH THE IECTTRAP PROBLEM.        02945290
.*                              THIS WAS JUST A CONVENIENT APAR TO      02945380
.*                              SHIP THIS CHANGE IN SINCE IT HIT        02945470
.*                              ALL THE RELEASES WHERE WE WERE          02945560
.*                              ISSUING THE PSF/SSC.               @07A 02945650
.* $08=OW45417,HDZ11B0,SJPLGSJ: REMOVE THE UCBCX_LBREDRIVE BIT     @08A 02945740
.* $H9=OW49830,HDZ11E0,SJPLGSJ: CAPACITY UTILIZATION AND                02946130
.*                              PERFORMANCE ENHANCEMENTS           @H9A 02946520
.*                                                                      02947100
.********************   END OF SPECIFICATIONS   **********************/ 02950000
.*                                                                      03000000
.*       *------------------------------------------------*        @H3A 03001000
.*       *  THE 8 BYTE PREFIX IS INITIALIZED AT IPL TIME  *        @H3A 03002000
.*       *  AND SHOULD NEVER BE RESET.                    *        @H3A 03003000
.*       *                                                *        @H3A 03004000
.*       *  THE FIELD UCBCXCLR IS INTENDED TO BE USED     *        @H3A 03005000
.*       *  WHEN THE REMAINDER OF THIS EXTENSION DOES     *        @H3A 03006000
.*       *  REQUIRE INTIALIZATION, SUCH AS BY OPEN OR     *        @H3A 03007000
.*       *  EOV.  UCBCXCLR WILL CONTAIN THE LENGTH OF     *        @H3A 03008000
.*       *  UCBCXANS, CURRENTLY 20 DECIMAL BYTES, WHEN    *        @H3A 03009000
.*       *                                                *        @H3A 03010000
.*       *    1. THE DRIVE IS NOT A 3480, 3490, OR 3590   *        @H3A 03011000
.*       *                      AND                       *        @H3A 03012000
.*       *    2. ASCII IS NOT GENNED FOR THE DRIVE.       *        @H3A 03013000
.*       *                                                *        @H3A 03014000
.*       *  IF EITHER (OR BOTH) OF THE 2 CONDITIONS ABOVE *        @H3A 03015000
.*       *  ARE NOT TRUE, THE LENGTH IN UCBCXCLR WILL BE  *        @H3A 03016000
.*       *  THE AGGREGATE OF THE LENGTHS OF:              *        @H3A 03017000
.*       *                                                *        @H3A 03018000
.*       *               1. UCBCXANS AND                  *        @H3A 03019000
.*       *               2. UCBCX1                        *        @H3A 03020000
.*       *                                                *        @H3A 03021000
.*       *  UCBCXCLR WAS INTENDED TO ALLOW COMPONENTS     *        @H3A 03022000
.*       *  THAT CLEAR THE CLASS EXTENSION AN AUTOMATIC   *        @H3A 03023000
.*       *  METHOD FOR DOING SO.  UNFORTUNATELY, THERE    *        @H3A 03024000
.*       *  ARE NOW FIELDS IN UCBCXANS AND UCBCX1 THAT    *        @H3A 03025000
.*       *  MUST BE MAINTAINED FOR THE DURATION OF AN     *        @H3A 03026000
.*       *  IPL AND CANNOT BE CLEARED.  THOSE FIELDS ARE: *        @H3A 03027000
.*       *                                                *        @H3A 03028000
.*       *     UCBCXFL5: A BYTE OF FLAGS                  *        @H3A 03028300
.*       *     UCBCXEPI  ERDS PHYSICAL IDENTIFIER         *        @H3A 03028600
.*       *     UCBLAEXT: THE POINTER TO THE TAPE          *        @H3A 03029000
.*       *               LIBRARY EXTENSION,               *        @H3A 03030000
.*       *     UCBCXATL: INDICATOR THAT THE DEVICE        *        @H3A 03031000
.*       *               RESIDES IN AN ATL, AND           *        @H3A 03032000
.*       *     UCBCXMTL: INDICATOR THAT THE DEVICE        *        @H3A 03033000
.*       *               RESIDES IN AN MTL.               *        @H3A 03034000
.*       *                                                *        @H3A 03035000
.*       *  SINCE THIS CAN NO LONGER BE DONE, COMPONENTS  *        @H3A 03036000
.*       *  THAT CLEAR THE CLASS EXTENSION SHOULD CLEAR   *        @H3A 03037000
.*       *  THE FIRST THREE BYTES OF UCBCXANS.  THEN      *        @H3A 03038000
.*       *  CLEAR UCBCXENV IN ITS ENTIRETY.  CLEAR        *        @H3A 03039000
.*       *  UCBCXSEQ SEPARATELY, AND FINALLY CLEAR        *        @H3A 03040000
.*       *  THE FIRST 5 BITS IN UCBCXFL2.  BITS           *        @H3A 03041000
.*       *  UCBCXATL AND UCBCXMTL MUST NOT BE CLEARED.    *        @H3A 03042000
.*       *                                                *        @H3A 03043000
.*       *  UCBCXCLR WAS REMOVED WITH 3590 SUPPORT        *        @H3A 03044000
.*       *------------------------------------------------*        @H3A 03045000
.*                                                                      03046000
UCBCX    DSECT                                                          03050000
*                                                                       03060000
*        *------------------------------------------------*        @H3A 03070000
*        *                     PREFIX                     *        @H3A 03080000
*        *------------------------------------------------*        @H3A 03090000
*                                                                       03100000
UCBCXPRE DS    0CL8                    TAPE CLASS EXTENSION PREFIX      03150000
UCBCXID  DS    CL4                     IDENTIFIER - UCBT                03200000
UCBCXTLN DS    XL2                     TOTAL LENGTH OF EXTENSION   @H2A 03250000
UCBCXGNL DS    CL1                     GENERAL FLAGS               @H8A 03257400
UCBCX_RDCVALID       EQU  X'80'        CB DATA FROM RDC IS GOOD    @H8A 03264800
*                    EQU  X'7F'        RESERVED                    @H8A 03272200
UCBCXRS7 DS    XL1                     RESERVED FOR FUTURE USE     @H8C 03279600
*                                      END OF UCBCXPRE SECTION     @H3A 03287400
*                                                                       03306100
*        *------------------------------------------------*        @H3C 03324800
*        *                ANSI SECTION                    *        @H3C 03343500
*        *------------------------------------------------*        @H3C 03362200
*                                                                       03380900
UCBCXANS DS    0CL20                   ANSI PORTION OF EXTENSION        03400000
UCBCXACC DS    CL1                     VOL1 ACCODE FROM VOL1 LABEL      03450000
*                                                                       03500000
*        *------------------------------------------------*        @H3C 03550000
*        *  THE UCB EXIT FLAGS (UCBCXFL1) ARE SET WITH AN *        @H3C 03600000
*        *  AUDIT TRAIL FOR ANSI EXIT ACTIVITY DURING     *        @H3C 03650000
*        *  VOLUME VERIFICATION.                          *        @H3C 03700000
*        *------------------------------------------------*        @H3C 03750000
*                                                                       03850000
UCBCXFL1 DS    B                       FLAG BYTE                        03900000
UCBCXVAL EQU   X'80'                   VALIDATION EXIT ENTERED          03950000
UCBCXSUP EQU   X'40'                   SUPPRESS LABEL VALIDATION CHECK  04000000
*                                                                       04050000
UCBCXVER DS    CL1                     VOL1 LABEL-STANDARD VERSION      04100000
UCBCXV3  EQU   C'3'                    VERSION 3                        04150000
UCBCXV4  EQU   C'4'                    VERSION 4                   @P1A 04150700
*                                                                 7@H2M 04151500
UCBCXFL5 DS    XL1                     DO NOT CLEAR THIS BYTE      @H3C 04151800
UCBCX_ATT3590        EQU  X'80'        DEVICE ATTACHED VIA 3590    @H3A 04152100
UCBCX_HOT85          EQU  X'40'        85 INTERRUPT BEING PROCESD  @H3A 04152400
UCBCXNTL             EQU  X'20'        HCD DEFINED NON-LIBRARY DEV @H5A 04152700
UCBCXPID_OK          EQU  X'10'        ATL WAS DEFINED WITH HCD    @H5A 04153000
UCBCX_BLOCKID_VALID  EQU  X'08'        WHEN SET THE UCBCX_CHAN_BLOCKID  04153100
*                                      FIELD IS VALID              @H7A 04153200
UCBCX_PSFSSC         EQU  X'04'        PSF/SSC ORDER SUPPORTED     @07A 04153390
UCBCXDTM             EQU  X'02'        CLOSE WROTE A DEFERRED TM   @H9A 04153480
UCBCX_NULL_ELIM      EQU  X'01'        BOTH THE DEVICE AND THE CHANNEL  04153700
*                                      SUBSYSTEM SUPPORT ELIMINATION OF 04153800
*                                      THE NULLIFICATION WINDOW    @H7A 04153900
UCBCXOWN DS    CL14                    VOL1 OWNER IDENTIFICATION        04154500
UCBCXEPI DS    XL1                     ERDS PHYSICAL IDENTIFIER - AN    04154600
*                                      INDICATION OF THE ACTUAL         04154700
*                                      PHYSICAL DEVICE THAT MAY BE      04154800
*                                      EMULATING ANOTHER DEVICE. THE    04154900
*                                      EPI IS RETRIEVED FROM RDC DATA   04155000
*                                      AT VARY ONLINE TIME. DO NOT @H6C 04155100
*                                      CLEAR THIS BYTE.            @H6C 04155200
NATIVE_NOEMUL      EQU X'00'           NATIVE, NO EMULATION        @H8A 04155240
REAL3590_EMUL3490  EQU X'01'           3590 EMULATING 3490         @H6A 04155300
VTSB16_EMUL3490    EQU X'02'           VIRTUAL TAPE SERVER B16     @H6A 04155400
REAL3591_EMUL3490  EQU X'03'           3591 EMULATING 3490         @H6A 04155500
*                  EQU X'04'           RESERVED                    @H8C 04155600
*                  EQU X'05'           RESERVED                    @H8C 04155700
*                  EQU X'06'           RESERVED                    @H8C 04155800
REAL349F_EMUL3490  EQU X'07'           3490F EMULATING 3490        @H6A 04155900
*                  EQU X'08'           RESERVED                    @H8C 04156200
REALBL2_EMUL3590   EQU X'09'           BLYTHE2 EMULATING 3590-1    @H8A 04156500
REALBL2_EMUL3490   EQU X'0A'           BLYTHE2 EMULATING 3490      @H8A 04156800
*                                                                       04157100
UCBCXRS2 DS    XL1                     RESERVED FOR FUTURE USE     @H2C 04157400
*                                      END OF UCBCXANS SECTION     @H3A 04157700
*                                                                       04159400
*        *------------------------------------------------*        @H3C 04161100
*        *                3480 SECTION                    *        @H3C 04162800
*        *------------------------------------------------*        @H3C 04164500
*                                                                       04166200
UCBCX1   DS    0CL28                   3480 PORTION OF EXTENSION   @H2C 04168000
UCBCXENV DS    0CL16                   3480 ENVIRONMENTAL DATA          04169500
UCBCXERG DS    CL2                     # OF ERASE GAPS             @H1A 04171000
UCBCXCLN DS    CL2                     # OF CLEANER ACTIONS        @H1A 04172500
UCBCXRD  DS    CL2                     TEMP READ ERROR COUNTER     @H1A 04174000
UCBCXRDB DS    CL2                     TEMP READ BKWD ERR COUNTER  @H1A 04175500
UCBCXWR  DS    CL2                     TEMP READ WRITE COUNTER     @H1A 04177000
UCBCXMBR DS    CL3                     # BYTES READ/4K             @H1A 04177300
UCBCXMBW DS    CL3                     # BYTES WRITTEN/4K          @H1A 04177600
*                                      END OF UCBCXENV SECTION     @H3A 04177900
UCBCXSEQ DS    H                       TRAILER FILE SEQUENCE NUM   @01A 04178200
*                                                                       04178500
*        *------------------------------------------------*        @H3C 04178800
*        *  TWO FLAGS CONTAINED IN UCBCXFL2 SHOULD NOT    *        @H3C 04179100
*        *  BE RESET WHEN THE CLASS EXTENSION IS CLEARED, *        @H3A 04179400
*        *  BY OPEN, FOR EXAMPLE.  THOSE TWO BITS ARE:    *        @H3A 04179700
*        *  UCBCXATL AND UCBCXMTL.                        *        @H3A 04180000
*        *------------------------------------------------*        @H3C 04180300
*                                                                  @H2C 04181500
UCBCXFL2 DS    XL1                     3480 FLAG BYTE              @01A 04184500
UCBCXCKP EQU   X'80'                   CHKPNT ('C') IN EOF2        @01A 04187500
UCBCXSC1 EQU   X'40'                   PASSWD REQ'D R/W (EOF1)     @01A 04200000
UCBCXSC3 EQU   X'20'                   PASSWD REQ'D WR ONLY (EOF1) @01A 04212500
UCBCXWRT EQU   X'10'                   EOF LABEL WAS WRITTEN       @01A 04225000
UCBCXCMP EQU   X'08'                   COMPACTED ('P') IN EOF2     @02A 04231200
UCBCXATL EQU   X'04'                   ATL LIBRARY DEVICE          @L3A 04233300
UCBCXMTL EQU   X'02'                   MTL LIBRARY DEVICE          @L3A 04235400
UCBCXLTO EQU   X'01'                   LIBRARY I/O TIMEOUT         @H9A 04236400
UCBCX_OCEFLGS DS    XL1                OCE FLAGS                   @03C 04270100
UCBCX_OCEMNT  EQU   X'80'              OCE ISSUED MOUNT MESSAGE    @03A 04303800
UCBCXTUS DS    CL4                     SERIAL NUMBER OF TAPE DRIVE @H1A 04337500
UCBLAEXT DS    A                       LIBRARY EXTENSION ADDRESS   @L3C 04387500
*                                      END OF UCBCX1 SECTION       @H3A 04395000
*                                                                       04402500
*        *------------------------------------------------*        @H3C 04410000
*        *              3480 AND UP SECTION               *        @H3C 04417500
*        *------------------------------------------------*        @H3C 04425000
*                                                                       04432500
UCBCX2               DS  0CL36                                     @H3C 04440000
UCBCXRS6             DS   CL6          RESERVED FOR FUTURE USE     @H3C 04447500
UCBCXMID             DS   CL3          MTL-ID                      @L3A 04455000
UCBCXDSS             DS   CL6          1ST IN AGGREGATE VOLSER     @L4A 04462500
UCBCXCNT             DS   CL1          ATTENTION I/O COUNT - MUST BE   X04466200
                                       THE LAST BYTE JUST PRIOR TO A   X04469900
                                       WORD BOUNDARY               @H7A 04473600
UCBCX_MIHTIME        DS   CL4          TIME ACCUMULATOR FOR MIH    @H3A 04477500
UCBCX_ATT3590_MBR    DS   F            # BYTES READ/4K             @H3A 04485000
UCBCX_ATT3590_MBW    DS   F            # BYTES WRITTEN/4K          @H3A 04492500
UCBCX_DEVID          DS   CL2          DEVICE ID, ACQUIRED FM RDC  @H3A 04500000
UCBCXFL3             DS   XL1          1ST 3590 FLAGS BYTE         @H3A 04507500
UCBCX_32BIT_BLKPTR   EQU  X'80'         DEVICE SUPPORTS 32 BIT LOGICAL X04515000
                                       ..BLOCK NUMBER              @H3A 04522500
UCBCX_BRAC_SENSE     EQU  X'40'         DEVICE SUPPORTS 3590 SENSE     X04530000
                                       ..FORMAT                    @H3A 04537500
UCBCX_36BYTE_MODESET EQU  X'20'         DEVICE SUPPORTS X'CB' MODESET  X04545000
                                       ..THAT TRANSFERS 36 BYTES OF    X04552500
                                       ..DATA                      @H3A 04560000
UCBCX_06READ         EQU  X'10'        DEVICE SUPPORTS X'06' READ      X04567500
                                       ..FORWARE COMMAND           @H3A 04575000
UCBCX_READPREV       EQU  X'08'        READ PREVIOUS.  WHEN ON, THE    X04582500
                                       ..DEVICE SUPPORTS THE READ      X04590000
                                       ..PREVIOUS COMMAND ON AT        X04597500
                                       ..LEAST ONE FORMAT SUPPORTED    X04605000
                                       ..BY THE DEVICE.            @H1A 04612500
UCBCX_RESETALG       EQU  X'04'        DEVICE SUPPORTS X'44' RESET     X04620000
                                       ..ALLEGIANCE COMMAND        @H3A 04627500
UCBCX_READ_BUFFER    EQU  X'02'        READ BUFFER CCW SUPPORTED   @F1A 04635000
UCBCX_MSNS           EQU  X'01'        MEDIUM SENSE CCW SUPPORTED  @H8A 04642500
UCBCXFL4             DS   XL1          2ND 3590 FLAGS BYTE         @H3A 04650000
UCBCX_BLKPTR_SWITCH  EQU  X'80'        BLOCK POINTER FORMAT SWITCHING  X04671480
                                       IS SUPPORTED                @H9A 04675470
UCBCX_WRITE_MARK     EQU  X'40'        WRITE MARK.  WHEN THE COMMAND   X04680000
                                       ..IS SUPPORTED, AT LEAST THE    X04687500
                                       ..MARK LOGICAL BLOCK ORDER IS   X04695000
                                       ..SUPPORTED. SUPPORT FOR        X04702500
                                       ..CERTAIN OTHER ORDERS IS       X04710000
                                       ..INDICATED BY DATA PRESENTED   X04717500
                                       ..TO THE READ MEDIA             X04725000
                                       ..CHARACTERISTICS COMMAND.  @F1A 04732500
UCBCX_BLOCKID        EQU  X'20'        DEVICE SUPPORTS BLOCK ID FOR AT X04740000
                                       ..LEAST ONE MEDIUM FORMAT   @F1A 04747500
UCBCX_STAGE          EQU  X'10'        STAGE COMMAND.  WHEN THE        X04755000
                                       ..COMMAND IS SUPPORTED AND THE  X04762500
                                       ..SYSTEM MODE LOADER            X04770000
                                       ..INDICATION IS ONE, THE        X04777500
                                       ..DEVICE SUPPORTS THE UNLOAD    X04785000
                                       ..AND LOAD ORDERS. WHEN THE     X04792500
                                       ..COMMAND IS SUPPORTED AND THE  X04800000
                                       ..RANDOM MODE LOADER            X04807500
                                       ..INDICATION IS ONE, THE        X04815000
                                       ..DEVICE SUPPORTS THE MOVE AND  X04822500
                                       ..READ CELL STATUS ORDERS.  @F1A 04830000
UCBCX_LONGBUSY       EQU  X'08'        DEVICE IS LONGBUSY, USED IN     X04837500
                                       ..MIH PROCESSING            @H3A 04845000
UCBCX_POSREL         EQU  X'04'        POSITION RELATIVE COMMAND       X04855490
                                       IS SUPPORTED                @H9A 04858480
UCBCX_DCTM           EQU  X'02'        DEFERRED CONDITIONAL TAPE MARKS X04861470
                                       ARE SUPPORTED               @H9A 04864460
UCBCX_32BIT_INUSE    EQU  X'01'        USED BY OCE TO INDICATE THE     X04867450
                                       DEVICE IS IN 32-BIT MODE    @H9A 04870440
UCBCXPID             DS   F            LIBRARY-ID (FROM HCD)       @H5A 04875000
*                                                                       04882500
*        *------------------------------------------------*        @H7A 04882700
*        *            DO NOT CLEAR UCBCX3                 *        @H7A 04882900
*        *                                                *        @H7A 04883100
*        *    THIS SECTION CAN BE USED FOR FIELDS THAT    *        @H7A 04883300
*        *    MAY NEED TO BE MAINTAINED OVER THE LIFE     *        @H7A 04883500
*        *    OF AN IPL, OR A VARY ONLINE/OFFLINE, ETC.   *        @H7A 04883700
*        *    TWENTY BYTES WERE ADDED TO BRING THE        *        @H7A 04883900
*        *    TOTAL LENGTH OF THE EXTENSION BACK TO A     *        @H7A 04884100
*        *    MULTIPLE OF 8 BYTES.  IF IT ISN'T A         *        @H7A 04884300
*        *    MULTIPLE OF 8 BYTES STORAGE IS SKIPPED      *        @H7A 04884500
*        *    WHEN THE UCB'S ARE BUILT.                   *        @H7A 04884700
*        *                                                *        @H7A 04884900
*        *------------------------------------------------*        @H7A 04885100
*                                                                       04885300
UCBCX3               DS  0CL28                                     @H7A 04885500
UCBCX_MAXBLKSZ       DS   F            MAXIMUM BLOCK SIZE SUPPORTED    X04885700
                                       BY THE DEVICE               @P2A 04885900
UCBCX_OPTBLKSZ       DS   F            OPTIMUM BLOCK SIZE SUPPORTED    X04886100
                                       BY THE DEVICE               @P2A 04886300
UCBCX_SIO            DS   F            THE NUMBER OF STARTIOS          X04886500
                                       THAT HAVE OCCURRED.  THIS       X04886700
                                       FIELD WAS ADDED BECAUSE THE     X04886900
                                       UCBSIO FIELD IN THE MAGNETIC    X04887100
                                       TAPE SEGMENT IS A 2-BYTE FIELD  X04887300
                                       THAT TENDS TO OVERFLOW.  BOTH   X04887500
                                       FIELDS ARE UPDATED BY THE TAPE  X04887700
                                       TRAP EXIT (IECTTRAP).       @P2A 04887900
UCBCX_CHAN_BLOCKID   DS   CL8          BLOCKID READ FROM THE DEVICE     04888100
*                                      AND UPDATED BY THE TAPE TRAP     04888300
*                                      EXIT AFTER COMPLETION OF EVERY   04888500
*                                      NON-UNIT CHECK I/O.  USED BY     04888700
*                                      TAPE ERPS (IGE0001E AND          04888900
*                                      IGE0003E) TO RECOVER FROM        04889100
*                                      CHANNEL ERRORS              @H7A 04889300
UCBCX_BLKID          DS   F            BLOCKID TM FOLLOWING DATA   @P3A 04889400
UCBCXFL6             DS   XL1          FLAG BYTE                        04889510
UCBCX_BUFFTM         EQU  X'80'        BUFFRD TAPE MARKS SUPPORTED @H9A 04889520
UCBCX_DSE1           EQU  X'40'        CALL DSE1 AFTER PATH GROUPS     X04889530
                                       HAVE BEEN ESTABLISHED DURING    X04889540
                                       IPL                         @H9A 04889550
*                    EQU  X'20'        UNUSED                           04889560
*                    EQU  X'10'        UNUSED                           04889570
*                    EQU  X'08'        UNUSED                           04889580
*                    EQU  X'04'        UNUSED                           04889590
*                    EQU  X'02'        UNUSED                           04889600
*                    EQU  X'01'        UNUSED                           04889610
UCBCXRS4             DS   CL3          RESERVED FOR FUTURE USE          04889620
*                                                                       04889700
UCBCXEND             EQU   *           END OF TAPE CLASS EXTENSION      04890000
         MEND                                                           04900000
**********************************************************************/ 04950000
*%UCBCX:  ;                                                             05000000
                                                                        05039600
  DECLARE                                                               05079200
  1   UCBCX BASED(UCBCLEXT) BDY(DWORD), /* UCB TAPE CLASS EXTENSION  */ 05118800
                                                                        05158400
 /*      *------------------------------------------------*      @H3A*/ 05198000
 /*      *                     PREFIX                     *      @H3A*/ 05237600
 /*      *------------------------------------------------*      @H3A*/ 05277200
                                                                        05316800
   2  UCBCXPRE             CHAR(8) BDY(DWORD), /* PREFIX             */ 05356400
    3 UCBCXID              CHAR(4), /* ID = UCBT                     */ 05396000
    3 UCBCXTLN           FIXED(16), /* TOTAL LENGTH              @H2C*/ 05435600
    3 UCBCXGNL             CHAR(1), /* GENERAL FLAGS             @H8A*/ 05451400
     4 UCBCX_RDCVALID       BIT(1), /* CB DATA FROM RDC IS GOOD  @H8A*/ 05467200
     4 *                    BIT(7), /* RESERVED                  @H8A*/ 05483000
    3 UCBCXRS7            FIXED(8), /* RESERVED FOR FUTURE USE   @H8C*/ 05498800
                                                                        05514800
 /*     *------------------------------------------------*       @H3C*/ 05554400
 /*     *                ANSI SECTION                    *       @H3C*/ 05594000
 /*     *------------------------------------------------*       @H3C*/ 05633600
                                                                        05673200
  2 UCBCXANS              CHAR(20), /* ANSI PORTION OF EXTENSION     */ 05712800
   3 UCBCXACC              CHAR(1), /* VOL1 ACCESS CODE FROM LABEL   */ 05752400
                                                                        05792000
 /*      *------------------------------------------------*      @H3C*/ 05831600
 /*      *  THE UCB EXIT FLAGS (UCBCXFL1) ARE SET WITH AN *      @H3C*/ 05871200
 /*      *  AUDIT TRAIL FOR ANSI EXIT ACTIVITY DURING     *      @H3C*/ 05910800
 /*      *  VOLUME VERIFICATION.                          *      @H3C*/ 05950400
 /*      *------------------------------------------------*      @H3C*/ 05990000
                                                                        06029600
   3 UCBCXFL1               BIT(8), /* FLAG BYTE                     */ 06069200
    4 UCBCXVAL              BIT(1), /* VALIDATION EXIT ENTERED       */ 06108800
    4 UCBCXSUP              BIT(1), /* SUPPRESS LBL VALIDATION CHECK */ 06148400
   3 UCBCXVER              CHAR(1), /* VOL1 LABEL-STANDARD VERSION   */ 06188000
                                                            /*  7@H2D*/ 06227600
   3 UCBCXFL5              CHAR(1), /* DO NOT CLEAR THIS BYTE    @H3C*/ 06267200
    4 UCBCX_ATT3590         BIT(1), /* DEVICE ATTACHED VIA 3590  @H3A*/ 06306800
    4 UCBCX_HOT85           BIT(1), /* 85 INTRUPT BEING PROCESD  @H3A*/ 06346400
    4 UCBCXNTL              BIT(1), /* ATL USED AS NON-LIBRARY   @H5A*/ 06366200
    4 UCBCXPID_OK           BIT(1), /* ATL WAS DEFINED WITH HCD  @H5A*/ 06386000
    4 UCBCX_BLOCKID_VALID   BIT(1), /* WHEN SET THE UCBCX_CHAN_BLOCKID  06389900
                                       FIELD IS VALID            @H7A*/ 06393800
    4 UCBCX_PSFSSC          BIT(1), /* PSF/SSC ORDER SUPPORTED   @07A*/ 06404290
    4 UCBCXDTM              BIT(1), /* CLOSE WROTE A DEFERRED TM @H9A*/ 06408280
    4 UCBCX_NULL_ELIM       BIT(1), /* BOTH THE DEVICE AND THE CHANNEL  06413300
                                       SUBSYSTEM SUPPORT ELIMINATION OF 06417200
                                       THE NULLIFICATION WINDOW  @H7A*/ 06421100
   3 UCBCXOWN             CHAR(14), /* VOL1 OWNER IDENTIFICATION     */ 06425600
   3 UCBCXEPI              CHAR(1), /* ERDS PHYSICAL IDENTIFIER - AN    06434400
                                       INDICATION OF THE ACTUAL         06443200
                                       PHYSICAL DEVICE THAT MAY BE      06452000
                                       EMULATING ANOTHER DEVICE. THE    06460800
                                       EPI IS RETRIEVED FROM RDC DATA   06469600
                                       AT VARY ONLINE TIME.  DO NOT     06478400
                                       CLEAR THIS BYTE.          @H6C*/ 06487200
   3 UCBCXRS2              CHAR(1), /* RESERVED FOR FUTURE USE   @H2C*/ 06496000
                                                                        06504800
 /*      *------------------------------------------------*      @H3C*/ 06544400
 /*      *                3480 SECTION                    *      @H3C*/ 06584000
 /*      *------------------------------------------------*      @H3C*/ 06623600
                                                                        06663200
  2 UCBCX1,                         /* 3480 PORTION         @H2C @H3C*/ 06702800
   3 UCBCXENV,                      /* 3480 ENVIRON DATA         @H3C*/ 06742400
    4 UCBCXERG           FIXED(16), /* # OF ERASE GAPS           @H1A*/ 06782000
    4 UCBCXCLN           FIXED(16), /* # OF CLEANER ACTIONS      @H1A*/ 06821600
    4 UCBCXRD            FIXED(16), /* READ FWD DATA CHECKS      @H1A*/ 06861200
    4 UCBCXRDB           FIXED(16), /* READ BKWD DATA CHECKS     @H1A*/ 06900800
    4 UCBCXWR            FIXED(16), /* WRITE DATA CHECKS         @H1A*/ 06940400
    4 UCBCXMBR           FIXED(24) BDY(WORD,3),  /* # BYTES READ        06980000
                                       ..SCALED BY 4K       @H1A @H3C*/ 07019600
    4 UCBCXMBW           FIXED(24) BDY(WORD,2),  /* # BYTES WRITTEN     07059200
                                       ..SCALED BY 4K       @H1A @H3C*/ 07098800
   3 UCBCXSEQ            FIXED(16), /* TRAILER FILE SEQ NUM @01A @H3C*/ 07138400
                                                                        07178000
 /*      *------------------------------------------------*      @H3A*/ 07217600
 /*      *              3480 AND UP SECTION               *      @H3A*/ 07257200
 /*      *------------------------------------------------*      @H3A*/ 07296800
                                                                        07336400
   3 UCBCXFL2               BIT(8), /* 3480 FLAG BYTE       @H2C @H3C*/ 07376000
    4 UCBCXCKP              BIT(1), /* CHKPNT ('C') IN EOF2      @01A*/ 07415600
    4 UCBCXSC1              BIT(1), /* PASSWD REQD R/W IN EOF1   @01A*/ 07455200
    4 UCBCXSC3              BIT(1), /* PASSWD REQD WR ONLY EOF1  @01A*/ 07494800
    4 UCBCXWRT              BIT(1), /* EOF LABEL WAS WRITTEN     @01A*/ 07534400
    4 UCBCXCMP              BIT(1), /* COMPACTED ('P') IN EOF2   @02A*/ 07574000
    4 UCBCXATL              BIT(1), /* ATL LIBRARY  DEVICE       @L3A*/ 07613600
    4 UCBCXMTL              BIT(1), /* MTL LIBRARY  DEVICE       @L3A*/ 07653200
    4 UCBCXLTO              BIT(1), /* LIBRARY I/O TIMEOUT       @H9A*/ 07692800
   3 UCBCX_OCEFLGS         CHAR(1), /* OCE FLAGS                 @03A*/ 07712600
    4 UCBCX_OCEMNT          BIT(1), /* OCE ISSUED MOUNT MSG X'80'@03A*/ 07732400
    4 *                     BIT(7), /* RESERVED FOR FUTURE USE   @03A*/ 07752200
   3 UCBCXTUS              CHAR(4), /* TAPE DRIVE SER #     @H1A @H3C*/ 07772000
   3 UCBLAEXT              PTR(31), /* LIBRARY EXTEN PTR    @L3A @H3C*/ 07811600
                                                                        07851200
 /*      *------------------------------------------------*      @H3C*/ 07890800
 /*      *              3590 AND UP SECTION               *      @H3C*/ 07930400
 /*      *------------------------------------------------*      @H3C*/ 07970000
                                                                        08009600
 2 UCBCX2               BDY(DWORD), /*                           @H2A*/ 08049200
   3 UCBCXRS6 CHAR(6),              /* RESERVED FOR FUTURE USE   @H3C*/ 08088800
   3 UCBCXMID CHAR(3),              /* MTL-ID                    @L3A*/ 08133300
   3 UCBCXDSS CHAR(6),              /* 1ST IN AGGREGATE VOLSER   @L4A*/ 08155500
   3 UCBCXCNT CHAR(1),              /* ATTENTION I/O COUNT - MUST BE    08180500
                                       THE LAST BYTE JUST PRIOR TO A    08205500
                                       WORD BOUNDARY             @H7A*/ 08230500
   3 UCBCX_MIHTIME       FIXED(32), /* TIME ACCUMULATOR FOR MIH         08255500
                                       .. PROCESSING             @H3A*/ 08305500
   3 UCBCX_ATT3590_MBR   FIXED(32), /* NUMBER BYTES READ/4K      @H3A*/ 08355500
   3 UCBCX_ATT3590_MBW   FIXED(32), /* NUMBER BYTES WRITTEN/4K   @H3A*/ 08405500
   3 UCBCX_DEVID           CHAR(2), /* DEVICE ID, FROM RCD DATA  @H3A*/ 08455500
   3 UCBCXFL3               BIT(8), /* 1ST 3590 FLAGS BYTE       @H3A*/ 08505500
     4 UCBCX_32BIT_BLKPTR   BIT(1), /* DEVICE SUPPORTS 32 BIT LOGICAL   08555500
                                       ..BLOCK NUMBER            @H3A*/ 08605500
     4 UCBCX_BRAC_SENSE     BIT(1), /* DEVICE SUPPORTS 3590 SENSE       08655500
                                       ..FORMAT                  @H3A*/ 08705500
     4 UCBCX_36BYTE_MODESET BIT(1), /* DEVICE SUPPORTS X'CB' MODESET    08755500
                                       ..THAT TRANSFERS 36 BYTES OF     08805500
                                       ..DATA                    @H3A*/ 08855500
     4 UCBCX_06READ         BIT(1), /* DEVICE SUPPORTS X'06' READ       08905500
                                       ..FORWARD COMMAND         @H3A*/ 08955500
     4 UCBCX_READPREV       BIT(1), /* DEVICE SUPPORTS X'0A' READ       09005500
                                       ..PREVIOUS COMMAND        @H3A*/ 09055500
     4 UCBCX_RESETALG       BIT(1), /* DEVICE SUPPORTS X'44' RESET      09105500
                                       ..ALLEGIANCE COMMAND      @H3A*/ 09155500
     4 UCBCX_READ_BUFFER    BIT(1), /* READ BUFFER CCW SUPPORTED @F1A*/ 09205500
     4 UCBCX_MSNS           BIT(1), /* MEDIUM SENSE CCW SUPPORTED@H8A*/ 09255500
   3 UCBCXFL4               BIT(8), /* 2ND 3590 FLAGS BYTE       @H3A*/ 09305500
     4 UCBCX_BLKPTR_SWITCH  BIT(1), /* BLOCK POINTER FORMAT SWITCHING   09445480
                                       IS SUPPORTED              @H9A*/ 09465470
     4 UCBCX_WRITE_MARK     BIT(1), /* WRITE MARK.  WHEN THE COMMAND    09505500
                                       ..IS SUPPORTED, AT LEAST THE     09555500
                                       ..MARK LOGICAL BLOCK ORDER IS    09605500
                                       ..SUPPORTED. SUPPORT FOR         09655500
                                       ..CERTAIN OTHER ORDERS IS        09705500
                                       ..INDICATED BY DATA PRESENTED    09755500
                                       ..TO THE READ MEDIA              09805500
                                       ..CHARACTERISTICS COMMAND.@F1A*/ 09855500
     4 UCBCX_BLOCKID        BIT(1), /* DEVICE SUPPORTS BLOCK ID FOR AT  09905500
                                       ..LEAST ONE MEDIUM FORMAT @F1A*/ 09955500
     4 UCBCX_STAGE          BIT(1), /* STAGE COMMAND.  WHEN THE         10005500
                                       ..COMMAND IS SUPPORTED AND       10055500
                                       ..THE SYSTEM MODE LOADER         10105500
                                       ..INDICATION IS ONE, THE         10155500
                                       ..DEVICE SUPPORTS THE UNLOAD     10205500
                                       ..AND LOAD ORDERS. WHEN THE      10255500
                                       ..COMMAND IS SUPPORTED AND       10305500
                                       ..THE RANDOM MODE LOADER         10355500
                                       ..INDICATION IS ONE, THE         10405500
                                       ..DEVICE SUPPORTS THE MOVE       10455500
                                       ..AND READ CELL STATUS           10505500
                                       ..ORDERS.                 @F1A*/ 10555500
     4 UCBCX_LONGBUSY       BIT(1), /* DEVICE IS LONGBUSY, USED IN      10605500
                                       ..MIH PROCESSING          @H3A*/ 10655500
     4 UCBCX_POSREL         BIT(1), /* POSITION RELATIVE COMMAND        10705890
                                       IS SUPPORTED              @H9A*/ 10706280
     4 UCBCX_DCTM           BIT(1), /* DEFERRED CONDITIONAL TAPE MARKS  10706670
                                       ARE SUPPORTED             @H9A*/ 10707060
     4 UCBCX_32BIT_INUSE    BIT(1), /* USED BY OCE TO INDICATE THE      10707450
                                       DEVICE IS IN 32-BIT MODE  @H9A*/ 10707840
   3 UCBCXPID              CHAR(4), /* LIBRARY-ID (FROM HCD)     @H5A*/ 10708900
                                                                        10712300
 /*      *------------------------------------------------*      @H7A*/ 10715700
 /*      *            DO NOT CLEAR UCBCX3                 *      @H7A*/ 10719100
 /*      *                                                *      @H7A*/ 10722500
 /*      *    THIS SECTION CAN BE USED FOR FIELDS THAT    *      @H7A*/ 10725900
 /*      *    MAY NEED TO BE MAINTAINED OVER THE LIFE     *      @H7A*/ 10729300
 /*      *    OF AN IPL, OR A VARY ONLINE/OFFLINE, ETC.   *      @H7A*/ 10732700
 /*      *    TWENTY BYTES WERE ADDED TO BRING THE        *      @H7A*/ 10736100
 /*      *    TOTAL LENGTH OF THE EXTENSION BACK TO A     *      @H7A*/ 10739500
 /*      *    MULTIPLE OF 8 BYTES.  IF IT ISN'T A         *      @H7A*/ 10742900
 /*      *    MULTIPLE OF 8 BYTES STORAGE IS SKIPPED      *      @H7A*/ 10746300
 /*      *    WHEN THE UCB'S ARE BUILT.                   *      @H7A*/ 10749700
 /*      *                                                *      @H7A*/ 10753100
 /*      *------------------------------------------------*      @H7A*/ 10756500
                                                                        10759900
 2 UCBCX3                BDY(WORD), /*                           @H7A*/ 10763300
   3 UCBCX_MAXBLKSZ      FIXED(32), /* MAXIMUM BLOCK SIZE SUPPORTED     10763800
                                       BY THE DEVICE             @P2A*/ 10764300
   3 UCBCX_OPTBLKSZ      FIXED(32), /* OPTIMUM BLOCK SIZE SUPPORTED     10764800
                                       BY THE DEVICE             @P2A*/ 10765300
   3 UCBCX_SIO           FIXED(32), /* THE NUMBER OF START I/O'S        10765800
                                       THAT HAVE OCCURRED.  THIS        10766300
                                       FIELD WAS ADDED BECAUSE THE      10766800
                                       UCBSIO FIELD IN THE MAGNETIC     10767300
                                       TAPE SEGMENT IS A 2-BYTE FIELD   10767800
                                       THAT TENDS TO OVERFLOW.  BOTH    10768300
                                       FIELDS ARE UPDATED BY THE TAPE   10768800
                                       TRAP EXIT (IECTTRAP).     @P2A*/ 10769300
   3 UCBCX_CHAN_BLOCKID,            /* BLOCKID READ FROM THE DEVICE     10770100
                                       AND UPDATED BY THE TAPE TRAP     10773500
                                       EXIT AFTER COMPLETION OF EVERY   10776900
                                       NON-UNIT CHECK I/O.  USED BY     10780300
                                       TAPE ERPS (IGE0001E AND          10783700
                                       IGE0003E) TO RECOVER FROM        10787100
                                       CHANNEL ERRORS            @H7A*/ 10790500
    4 UCBCX_HBLKID       FIXED(32), /* HOST BLOCK ID             @H7A*/ 10793900
    4 UCBCX_DBLKID       FIXED(32), /* DRIVE BLOCK ID            @H7A*/ 10797300
   3 UCBCX_BLKID         FIXED(32), /* BLOCKID TM FOLLOWING DATA @P3A*/ 10800000
   3 UCBCXFL6               BIT(8), /* FLAG BYTE                     */ 10802990
     4 UCBCX_BUFFTM         BIT(1), /* BFRD TAPE MARKS SUPPORTED @H9A*/ 10803280
     4 UCBCX_DSE1           BIT(1), /* CALL DSE1 AFTER PATH GROUPS      10803570
                                       HAVE BEEN ESTABLISHED DURING     10803860
                                       IPL                       @H9A*/ 10804150
     4      *               BIT(6), /* UNUSED                        */ 10804440
   3 UCBCXRS4              CHAR(3); /* RESERVED FOR FUTURE USE       */ 10804730
                                                                        10805500
* DCL UCBCXV3  CHAR(1) CONSTANT('3');/* VERSION 3                    */ 10855500
* DCL UCBCXV4  CHAR(1) CONSTANT('4');/* VERSION 4                @P1A*/ 10880500
                                                                        10905500
 /********************************************************************/ 10955500
 /* IF THIS CONTROL BLOCK IS INCREASED IN SIZE, INDEPENDENT SOFTWARE */ 10958200
 /* VENDORS NEED TO BE NOTIFIED.  SOME ISVS WRITE THEIR OWN UIMS AND */ 10960900
 /* THEY NEED TO CHANGE TO ACCOMODATE ANY INCREASE IN SIZE.  HERE IS */ 10963600
 /* AN EXAMPLE OF SOME ++HOLD DATA THAT WE SHIPPED WITH THE FICON    */ 10966300
 /* SUPPORT:                                                         */ 10969000
 /*                                                                  */ 10971700
 /* ++ HOLD(UW62062) SYS FMID(HDZ11E0) REASON(DEP) DATE(99221)       */ 10974400
 /*    COMMENT                                                       */ 10977100
 /*     (DO NOT APPLY THIS PTF IF YOUR INSTALLATION HAS OEM TAPE     */ 10979800
 /*     DRIVES OR CHANNEL EXTENSION EQUIPMENT WHICH USES VENDOR      */ 10982500
 /*     WRITTEN UNIT INFORMATION MODULES (UIMS). UIMS DEFINE THE     */ 10985200
 /*     EQUIPMENT TO MVS AND THE VENDOR SUPPLIED UIMS MUST BE        */ 10987900
 /*     UPDATED TO ACCOMODATE THE GROWTH OF THE UCB TAPE CLASS       */ 10990600
 /*     EXTENSION BY 28 BYTES.).                                     */ 10993300
 /********************************************************************/ 10996000
                                                                        10998700
 /********************************************************************/ 11001400
 /*        UCBCXEPI CONSTANTS                                        */ 11005500
 /********************************************************************/ 11055500
                                                                        11105500
 DECLARE                                  /*                     @H6A*/ 11155500
 NATIVE_NOEMUL     BIT(8) CONSTANT('00'X),/*NATIVE, NO EMULATION @H8A*/ 11180500
 REAL3590_EMUL3490 BIT(8) CONSTANT('01'X),/*3590 EMULATING 3490  @H6A*/ 11205500
 VTSB16_EMUL3490   BIT(8) CONSTANT('02'X),/*VIRTUAL TAPE SRVR B16@H6A*/ 11255500
 REAL3591_EMUL3490 BIT(8) CONSTANT('03'X),/*3591 EMULATING 3490  @H6A*/ 11305500
 ICUDAT_EMUL3490   BIT(8) CONSTANT('04'X),/*INTEGR DAT EMUL 3490 @06A*/ 11355500
 *                 BIT(8) CONSTANT('05'X),/*RESERVED             @H8C*/ 11405500
 *                 BIT(8) CONSTANT('06'X),/*RESERVED             @H8C*/ 11455500
 REAL349F_EMUL3490 BIT(8) CONSTANT('07'X),/*3490F EMULATING 3490 @H6A*/ 11505500
 *                 BIT(8) CONSTANT('08'X),/*RESERVED             @H8C*/ 11555500
 REALBL2_EMUL3590  BIT(8) CONSTANT('09'X),/*BLY2  EMULATING 3590 @H8A*/ 11605500
 REALBL2_EMUL3490  BIT(8) CONSTANT('0A'X);/*BLY2  EMULATING 3490 @H8A*/ 11655500
