*        %GOTO BASEPROL;           /* BILINGUAL MAPPING                 00100000
         MACRO                                                          00130000
         IEEBASEA   &NOD            */                                  00160000
*%BASEPROL : ;                                                          00190000
*/**START OF SPECIFICATIONS*******************************************/ 00191300
*/*                                                                  */ 00192600
*/*01* MACRO NAME: IEEBASEA                                      @P3C*/ 00193900
*/*                                                                  */ 00195200
*/*01* DESCRIPTIVE NAME: MASTER SCHEDULER RESIDENT DATA AREA         */ 00196500
*/*01* ACRONYM: BASEA                                            @P3C*/ 00197800
*/*01* EXTERNAL CLASSIFICATION: DMTI                             @L9A*/ 00199100
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @L9A*/ 00200400
*/*                                                              @P3A*/ 00201700
*/*01* PROPRIETARY STATEMENT=                                        */ 00203000
*/***PROPRIETARY_STATEMENT********************************************/ 00204300
*/*                                                                  */ 00205600
*/*                                                                  */ 00206900
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00208200
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00209500
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2001                      */ 00212390
*/*                                                                  */ 00213400
*/* STATUS= HBB7703                                                  */ 00214700
*/*                                                                  */ 00216000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00217300
*/*                                                                  */ 00218600
*/*01* DSECT NAME: BASE                                          @P3A*/ 00219900
*/*                                                                  */ 00221200
*/*01* COMPONENT: MASTER SCHEDULER (SC1B8)                       @P3A*/ 00222500
*/*                                                                  */ 00223800
*/*01* EYE-CATCHER: MSER                                         @P3A*/ 00225100
*/*02*  OFFSET: 4                                                @P3A*/ 00226400
*/*02*  LENGTH: 4                                                @P3A*/ 00227700
*/*                                                                  */ 00229000
*/*01* STORAGE ATTRIBUTES:                                       @P3A*/ 00230300
*/*02*   SUBPOOL:                                                @P3A*/ 00231600
*/*02*   KEY: 0                                                  @P3A*/ 00232900
*/*02*   RESIDENCY: NUCLEUS                                      @P3A*/ 00234200
*/*                                                              @L6A*/ 00235500
*/*01* SIZE: 212 BYTES                                           @P3A*/ 00236800
*/*                                                                  */ 00238100
*/*01* CREATED BY: IEEBASEC (CSECT IN THE NUCLEUS DURING SYSGEN) @P3A*/ 00239400
*/*                                                                  */ 00240700
*/*01* POINTED TO BY: CVTMSER FIELD OF THE CVT DATA AREA         @P3A*/ 00242000
*/*                                                                  */ 00243300
*/*01* SERIALIZATION: NONE                                       @P3A*/ 00244600
*/*                                                                  */ 00245900
*/*01* METHOD OF ACCESS:                                         @P3A*/ 00247200
*/*   ASM: SPECIFY IEEBASEA WITH OR WITHOUT THE NODSECT OPTION   @P3A*/ 00248500
*/*   PL/AS: INCLUDE SYSLIB(IEEBASEA)                            @P3A*/ 00249800
*/*                                                                  */ 00251100
*/* METHOD OF ACCESS TO THE BASEA EXTENSION:                     @L6A*/ 00252400
*/*           BASEXP IN BASEA CONTAINS THE ADDRESS OF BASEX--    @L6A*/ 00253700
*/*           BAL                     SPECIFY IEEBASEA           @L6A*/ 00255000
*/*                                   USING ON BASEX             @L6A*/ 00256300
*/*           PLAS                    INCLUDE IEEBASEA           @L6A*/ 00257600
*/*                                   BASEX IS BASED ON BASEXP   @L6A*/ 00258900
*/*           The BASEX is created by compiling module IEEBASEM  @07A*/ 00259500
*/*                                                              @L6A*/ 00260200
*/* DELETED BY: NOT DELETED                                      @P3A*/ 00261500
*/*                                                                  */ 00262800
*/* FREQUENCY: ONE PER SYSTEM                                    @P3A*/ 00264100
*/*                                                                  */ 00265400
*/* DEPENDENCIES: NONE                                           @P3A*/ 00266700
*/*                                                                  */ 00268000
*/* DISTRIBUTION LIBRARY: AMODGEN                                @P3A*/ 00269300
*/*                                                                  */ 00270600
*/*                                                                  */ 00271900
*/*                                                                  */ 00273200
*/* OPERATION:                                               @G64MP2D*/ 00274500
*/*           THE MACRO HAS TWO CALLING SEQUENCES--                  */ 00275800
*/*           IEEBASEA                PROVIDES A DSECT STATEMENT FOR */ 00277100
*/*                                   MODULES WHICH USE THE MACRO    */ 00278400
*/*                                   ONLY AS A MAPPING.             */ 00279700
*/*           IEEBASEA  NODSECT       DOES NOT PROVIDE A DSECT STATE-*/ 00281000
*/*                                   MENT WHICH CAUSES THE STATE-   */ 00282300
*/*                                   MENTS TO OCCUPY SPACE UNDER    */ 00283600
*/*                                   THE CALLER'S CSECT.            */ 00284900
*/*                                   BASEX, THE BASEA EXTENSION,@L6A*/ 00286200
*/*                                   IS ALWAYS A DSECT          @L6A*/ 00287500
*/*                                                                  */ 00288800
*/*01* FUNCTION: THIS MACRO PROVIDES THE MAPPING OF MASTER RESI- @P3C*/ 00290100
*/*     DENT CORE UNIQUE TO THE OS/VS2 SYSTEM AND A MAPPING OF   @P3C*/ 00291400
*/*     THE MASTER COMMUNICATIONS REGION WHICH IS COMMON TO ALL  @P3C*/ 00292700
*/*     SYSTEMS OF OS/VS2. THE AREA MAY BE ADDRESSED THROUGH THE @P3C*/ 00294000
*/*     COMMUNICATIONS VECTOR TABLE UNDER LABEL  CVTMSER.            */ 00295300
*/*     THE BASEA EXTENSION, BASEX, RESIDES IN ESQA AND IS       @L6A*/ 00296600
*/*     BUILT IN IEEMB881 WHEN THE FIRST ADDRESS SPACE IS        @L6A*/ 00297900
*/*     CREATED.                                                 @L6A*/ 00299200
*/*                                                              @L6A*/ 00300500
*/* MODULE TYPE:  MACRO                                      @G64MP2D*/ 00301800
*/*                                                          @G64MP2D*/ 00303100
*/* PROCESSOR:  BILINGUAL PL/AS   AND ASSEMBLER H                @P3C*/ 00304400
*/*                                                          @G64MP2D*/ 00305700
*/* CHANGE ACTIVITY =                                            @L1A*/ 00307000
*/* $L1=XMCTASK,  JBB1326,  801031,  L12I:  ADDED CAST AND MTT WORK  */ 00308300
*/*                                         POINTERS                 */ 00309600
*/* $P1=PMM0253,  JBB1326,  810402,  P12I:  REMOVED COMM TASK RB     */ 00310900
*/*                                         FIELD                    */ 00312200
*/* $L2=MSTRDUMP, JBB2110,  820820,  PDE6:  MASTER SCHEDULER DUMP    */ 00313500
*/*                                         IMPROVEMENTS             */ 00314800
*/*                   ZA79880                                @ZA79880*/ 00316100
*/* $L3=IOGEN,    JBB2220,  850408,  PDM8:  IOGEN RESTRUCTURE        */ 00317400
*/*                   YA32004 - ADD MISSING COMMENT DELIMITER@YA32004*/ 00318700
*/* $01=OY33860   JBB2220,  901214,  PDBT:  VARY COMMAND VSCR        */ 00320000
*/* $02=OY35537,  JBB2220,  901102,  PDCR:  WTL BUFFER CONSTRAINT    */ 00321300
*/*                                         RELIEF                   */ 00322600
*/* $03=OY42177,  JBB2220,  900423,  PDCR:  IEEVWAIT RECOVERY        */ 00323900
*/* $L4=SP313,    JBB3313,  880226,  PDCR:  MVS B1 SECURITY SUPPORT  */ 00325200
*/* $L5=CNMG2,    HBB4410,  870319,  PDR3:  CONSOLE MERGE STAGE II   */ 00326500
*/* $L6=CSCBVSDK  HBB4410,  881010,  PDDK:  CSCB VSCR                */ 00327800
*/* $L7=CSCBVCHF  HBB4410,  881221,  PDHF:  CSCB VSCR BAMANR COMMENT */ 00329100
*/* $L8=CSCBVFDF  HBB4410,  890630,  PDDF:  CSCB VSCR RESERVE BACSCXB*/ 00330400
*/* $P2=PEO2312   HBB4410,  891127,  PDHF:  ADD BAESTAE FOR IEECB860 */ 00331700
*/* $P3=PKB3038   HBB4430,  920618,  PDCM:  CORRECT FIELD OFFSET     */ 00333000
*/* $L9=JBSTCED   HBB5510,  930715,  PDED:  ADD BAMSJOBS             */ 00334300
*/* $P4=PIG1976   HBB5510,  930715,  PDCF:  MAKE BAS3603D RESERVED   */ 00334900
*/* $04=OW11332   HBB4420,  950215,  PDHD:  ADD BAFSTOR              */ 00335100
*/* $05=OW00063   JBB4422,  950315,  PDED:  No change this release   */ 00335300
*/* $06=OW31489   HBB6601,  980215,  PDHD:  A BARCOUNT, D BAMSWORK   */ 00335400
*/* $P5=PXD0828   HBB7703,  991231,  PD2U:  Compiler warning message */ 00335700
*/*                                         for IEEBASEA             */ 00336000
*/* $07=OW45398   HBB7703,  010330,  PDXB:  Command Flooding Rollback*/ 00336190
*/**END OF SPECIFICATIONS*********************************************/ 00336300
*/*                                                          @G38EP2L*/ 00336900
*%GOTO BSLBASEA; /*                                                     00340000
.* A SYSTEM CONTROL PROGRAM 2                                  @G64MP2D 00665600
.* C SYSTEM CONTROL PROGRAM 2                                  @G64MP2D 00715600
.* A 096000,329500                                             @VS49464 00735600
.* A MSINIT                                                    @G741P2G 00735700
.* NO CODE CHANGES                                             @G81LPSS 00750600
.* A BAMJSCB, BAMTIOT                                          @G38EP2L 00752600
.* D BAICTR                                                    @G38EP2L 00754700
.* C MSCOMMND TO MSSCHED FOR SUBSYSTEM DEFINITION FACILITY     @G385P2N 00760100
.* A BACASTPT,BAVERN,BASCTPTR,BAVERNID, BASP13, BAMTTENT,          @L1A 00761400
.*   BAMSIECB, BAMTTSWP, AND BAMTTWKP                              @L1A 00762200
.* D BALAD, BASPBT01, BASPWD07, BASPWD02, AND BASPWD03             @L1A 00763000
.* M BASPWD08                                                      @L1A 00764000
.* C REMOVED IEACVPRB VCON FROM BAIPL                              @P1A 00764800
.* D BASTSPSZ,BASTSP,BASTSZ,BATRACE                            @G860PSS 00765200
.* A BAOKDUMP                                                      @L2A 00765400
.* A BAMSWORK,BASENDLM                                         @ZA79880 00815400
.* D MSTODWTO, BABCMAX                                             @L3A 00865400
.* A ADD MISSING COMMENT DELIMITER ON EJECT STATEMENT          @YA32004 00870400
.* A BAS3603D TO BASEA FOR ADDRESS OF IEE3603D                     @01A 00872000
.* A BAEBAPTR, MSLOGCHN, MSLOGTND                                  @02A 00873600
.* A BASNDCNT                                                      @03A 00874500
.* A BASCPLID                                                      @L4A 00875400
.* A MSDDNAME                                                      @L5A 00885400
.* A ADDED BACHFLGS,BACSCBA,BACSCXB,BARESV,BACHNL,BASEXP TO BASEA  @L6A 00895400
.* A ADDED BASEX FOR CSCB VSCR                                     @L6A 00905400
.* C CHANGED COMMENT FOR LOADING CHAIN MANIPULATION'S MODULE NAME  @L7A 00908700
.*   INTO BAMANR FIELD IN THE BASEX (NEW MODULE NAME IS IEEMB845)  @L7A 00912000
.* C RESERVED BACSCXB BIT                                          @L8A 00913700
.* A ADD BAESTAE FIELD TO THE BASEA EXTENSION FOR ADDR OF IEECB860 @P2A 00914500
.* C CORRECT OFFSET FOR MSSTRTRB IN PL/AS VERSION                  @P3A 00914900
.* A ADD BAFSTOR - MOVED FROM EBAFSTOR IN IEEZB845                 @04A 00915000
.* A ADD BAMSJOBS TO MSECBFL                                       @L9A 00915100
.* C MAKE PROLOG SHOWHDR COMPATIBLE                                @L9A 00915200
.* C MAKE BAS3603D RESERVED                                        @P4A 00915300
.* A BARCOUNT, D BAMSWORK                                          @06A 00965300
.* C Need to close a comment                                       @P5A 01015300
.* C BASEXP, BAXFLGX, A BAXINIT, A BAXRES                          @07A 03015290
.* D BASENDLM, BASNDCNT, BASCOUNT, BARCOUNT, BAROUTE, BAROUTLM     @07A 04015280
.* A BARSV1, BARSV2                                                @07A 05015270
         AIF   ('&NOD' EQ 'NODSECT').S0                          Y01012 06095100
BASE     DSECT                                                          06100000
         AGO   .S1                                               Y01037 06150000
.S0      ANOP                                                    Y01939 06200000
         ENTRY IEAMSLNK                                          Y01037 06250000
.S1      ANOP                                                    Y01037 06260000
         SPACE                                                          06300000
* THE FOLLOWING VALUES DEFINE BIT PATTERNS FOR SWITCHES                 06400000
         SPACE                                                          06500000
BA0      EQU   128                                                      06600000
BA1      EQU   64                                                       06700000
BA2      EQU   32                                                       06800000
BA3      EQU   16                                                       06900000
BA4      EQU   8                                                        07000000
BA5      EQU   4                                                        07100000
BA6      EQU   2                                                        07200000
BA7      EQU   1                                                        07300000
         SPACE                                                          07310000
BAVKEY   EQU   BA7            VIRTUAL REGION PROTECT KEY         Y01029 07350000
         SPACE                                                          08200000
BACHN    DC    F'0'           HANDLE TO COMMAND SCHEDULING CHAIN        08300000
BACBID   DC    C'MSER'        CONTROL BLOCK IDENTIFIER             @P3C 08350000
BASCPLID DC    F'0'           UTOKEN CELL POOL ID                  @L4A 08500000
BAIPL    DC    F'0'           COMMUNICATION WORD                   @P1C 08550000
BAIPLCC  EQU   BAIPL+3        USED BY TOD CLOCK MANAGEMENT       Y02139 08750000
BAQ      DS    F              OVERLAYED BY BAMSLNK WORD 1      @G64MP2D 08770000
BAPRC    DS    F              OVERLAYED BY BAMSLNK WORD 2      @G64MP2D 08810000
BALGSTAT DS    0D                                                       08950000
MSLOGSVC DC    F'0'           COUNT OF EXECUTING WTL SVC'S              09000000
BALOG    DS    F              ADDRESS OF LOG CONTROL TABLE       Y01037 09200000
BALOGINT EQU   BA0            INITIALIZED LOG INDICATOR          Y01939 09202000
BAEBAPTR DC    A(0)           POINTER TO EXTENDED MASTER SCHEDULER     X09204000
                              RESIDENT DATA AREA                       X09206000
                              (INITIALIZED BY IEEMB860)            @02C 09208000
         ORG   BAQ                                               Y01037 09210000
BAMSLNK  EQU   *         NIP PARM LIST FOR NIP LINK TO IEEVIPL   Y01037 09250000
IEAMSLNK LINK  EP=IEEVIPL,SF=L                                   Y01037 09260000
BAPMLGTH EQU   *-BAMSLNK            LINK LIST LENGTH             Y01037 09270000
         SPACE                                                          09300000
         DC    F'00'       FILLER FOR PROJECT #Y02669                   09350000
BARSW    DS    0C                                                       09400000
BASFL    DC    X'00'                                                    09500000
BAIN     EQU   BA0       IPL FLAG                                       09600000
BAINTSET EQU   BA2    INDICATES INTERNAL SET FOR TOD           @VS49464 09700000
BAFSTOR  EQU   BA3    ALL LOG BUFFERS ARE BEING FREED              @04A 09750000
         SPACE                                                          10300000
BAVERN   DC    AL1(BAVERNID)  VERSION LEVEL                        @L1A 10350000
BASP13   EQU   1              VERSION LEVEL OS/VS2 JBB1326         @L1A 10362500
BASP410  EQU   2              VERSION LEVEL OS/VS2 HBB4410         @L6A 10371800
BAVERNID EQU   BASP410        VERSION LEVEL - UPDATED FOR SIZE OR      X10381100
                              INCOMPATIBLE CHANGE                  @L6C 10390400
BASPHW04 DC    H'0'           RESERVED HALFWORD                @G38EP2L 10400000
BAPKES   DC    H'0'           MASK OF INITIATOR PROTECT KEYS            10450000
BASPHW01 DC    H'0'           RESERVED HALFWORD                @G64MP2D 10500000
BASPHW02 DC    H'0'           RESERVED HALFWORD                @G64MP2D 10550000
MSLOGST  DC    X'00'          LOG STATUS                           XMCS 11200000
MSLOGENQ EQU   BA0                LOG DATASET SCHEDULED TO BE     XMCS  11300000
*                                 QUEUED TO SYSOUT WRITER         XMCS  11400000
MSLOGTHD EQU   BA1                LOG NOT SUPPORTED BIT           XMCS  11500000
MSLOGCOM EQU   BA2                SIGNAL FOR COM TASK TO STOP     XMCS  11600000
*                                 ISSUING WTLS                    XMCS  11700000
MSLOGDAR EQU   BA3                LOG INTERNAL ABEND FLAG      @G64MP2D 11750000
MSLOGIPL EQU   BA4            LOG FIRST-TIME ENTRY SWITCH               12050000
MSLOGSTA EQU   BA5            LOG STAE ENVIRONMENT SWITCH               12060000
MSLOGCHN EQU   BA6            LOG CHAIN MANIPULATION ERROR        @02A  12073300
MSLOGTND EQU   BA7            LOG TASK END INDICATOR              @02A  12086600
BASPBYTE DC    X'00'                   MSTR SCH INIT CPL          20030 12100000
BAMSSTAR EQU   BA0            STAR RECURSION POINTER             Y01037 12200000
BAMASCH  EQU   BA2            MASTER SCHEDULER REGION                  *12400000
                                INITIALIZATION STARTED         @YM3520P 12420000
BAMSINIT EQU   BA3            MASTER SCHEDULER INITIALIZATION          *12440000
                                IS COMPLETE                    @G741P2G 12460000
BAOKDUMP EQU   BA4            A DUMP WAS TAKEN BY THE INITIATOR DURING *12473300
                                MASTER SCHEDULER INITIALIZATION    @L2A 12486600
BALOGECB DC    F'0'               LOG ECB                          XMCS 12500000
BAMTTWKP DC    F'0'           MASTER TRACE TABLE ENTRY PROCESSOR       *12550000
                              WORKAREA POINTER                     @L1A 12600000
BAMONITR DC    X'00'          MONITOR FLAGS (TERMINALS-TJB CHAIN, 20030 12700000
*                             CONSOLES-UCME CHAIN)                20030 12800000
BADSN    EQU   BA0            DSNAMES ARE BEING MONITORED        Y02669 12850000
BASPACE  EQU   BA1            SPACE IS BEING MONITORED           Y02669 12900000
BAMONTR2 DC    X'00'          RESERVED FOR MONITOR                20030 12950000
BACHFLGS DS    CL1            CSCB FLAGS                           @L6C 12970000
BACSCBA  EQU   BA0            CSCB LOCATION IS ABOVE 16M           @L6A 12990000
BACSCXB  EQU   BA1            RESERVED                             @L8C 13010000
BARESV   DS    CL1            RESERVED                             @L6A 13030000
BAMSIECB DC    F'0'           MASTER SCHEDULER INITIALIZATION ECB  @L1A 13050000
         DC    F'0'           RESERVED (WAS BAS3603D)              @P4C 13141980
BARSV1   DC    XL8'00'        RESERVED                             @07C 13181970
BALOGCOM DC    F'0'           SYSLOG DEB TABLE ADDR            @G64MP2D 13250000
BASUBECB DC    F'0'           SYSTEM SERIALIZATION ECB           Y02668 14300000
BAJNCNT  DC    H'0'           # OF DEVICES MONITORING JOBNAMES   Y02669 14350000
BASESCT  DC    H'0'           # OF DEVICES MONITORING SESSIONS   Y02669 14400000
BASTCNT  DC    H'0'           # OF DEVICES MONITORING STATUS     Y02669 14450000
BARSV2   DC    H'0'           RESERVED                             @07C 14519990
MSSCHED  DC    F'0'           POINTER TO SCHEDULER NIP PARAMETER       *14570000
                              LIST                             @G385P2N 14575000
MSSMFPRM DC    F'0'           POINTER TO THE SMF PARMLIB MEMBER LIST   *14580000
                                                                 Y02675 14590000
BAASCB   DC    F'0'           MASTER SCHEDULER ASCB ADDRESS      R20290 14592000
MSLOGCLS DC    X'00'          LOG OUTPUT CLASS                   Y02669 14594000
MSLOGLMT DC    XL3'00'        NO. OF WTLS IN ONE LOG DATA SET  @G64MP2D 14596000
MSLGCLOZ DS    0F             LOG TERMINATION ECB                       14598000
MSCLOSSW DC    X'00'          ECB WAIT/POST FIELD                       14598400
MSCLOSW  EQU   BA0            ECB WAIT BIT                              14598800
MSCLOSP  EQU   BA1            ECB POST BIT                              14599200
         DC    XL3'00'                                                  14599600
MSLGWLOG DS    0F             LOG DATA SET SWITCH ECB                   14599700
MSWLOGSW DC    X'00'          ECB WAIT/POST FIELD                       14599800
MSWLOGW  EQU   BA0            ECB WAIT BIT                              14599900
MSWLOGP  EQU   BA1            ECB POST BIT                              14633200
         DC    XL3'00'                                                  14643200
MSLGWTR  DS    0F             LOG WTL QUEUE WRITER ECB                  14653200
MSWTRSW  DC    X'00'          ECB WAIT/POST FIELD                       14663200
MSWTRW   EQU   BA0            ECB WAIT BIT                              14665200
MSWTRP   EQU   BA1            ECB POST BIT                              14665600
         DC    XL3'00'                                                  14666000
MSLGSTRT DS    0F             LOG RE-ACTIVATION ECB                     14666400
MSSTRTSW DC    X'00'          ECB WAIT/POST FIELD                       14666500
MSSTRTW  EQU   BA0            ECB WAIT BIT                              14666600
MSSTRTP  EQU   BA1            ECB POST BIT                              14677700
MSSTRTRB DC    XL3'00'        ECB RB   ADDRESS                 @G64MP2D 14678700
MSLGJSCB DC    F'0'           LOG SWAPPED JSCB ADDRESS         @G64MP2D 14728700
BASCTPTR DC    A(0)           POINTER TO SCHEDULED COMMANDS            X14778700
                              TABLE (IEEMB884)                     @L1A 14828700
BACASTPT DC    A(0)           POINTER TO CAST                      @L1A 14878700
.*                                                                      15300000
.* THE FOLLOWING MACRO CALL GENERATES THE SYMBOLS TO BE USED     I272   15400000
.* IN EQUATES FOR BIT MASKS                                      I272   15500000
.*                                                                      15600000
         IEZBITS                                                        15650000
MS1BASEX EQU   *                                                        15700000
         DC    XL76'00'       76 BYTES ZEROED                  @G64MP2D 15800000
         ORG   MS1BASEX                                                 16100000
         SPACE                                                          16200000
BASPBT02 DC    X'0'          RESERVED BYTE                     @G64MP2D 16250000
MSSSB    DC    X'00'         MONITOR TIME NOTE BYTE            @G64MP2D 16300000
MSBTN    EQU   MSSSB         TIME NOTE BIT IS BIT 6            @G64MP2D 16350000
MSTN     EQU   BA6           VALUE TO TURN ON TIME NOTE        @G64MP2D 16400000
         SPACE                                                          16450000
BASPBT03 DC    X'0'          RESERVED BYTE                     @G64MP2D 16500000
         SPACE                                                          16550000
MSECBFL  DC    X'0'          SCHEDULER FLAGBYTE                @G64MP2D 16600000
BAMSJOBS EQU   BIT0          IEFJOBS DD IS IN MASTER JCL           @L9A 16625000
MSWTL    EQU   BIT2          LOG ABEND RECURSION BIT           @G64MP2D 16650000
MSSUM    EQU   BIT7          SUMMARY BIT, VARY UCB SCAN REQUIRED.       16700000
         SPACE                                                          16750000
BAMTTBL  DC    F'0'          MASTER TRACE TABLE ADDRESS        @G64MP2D 16800000
BAMTRTN  DC    F'0'          MASTER TRACE DATA ENTRY RTN       @G860P39*16833300
                             IEEMB808 IS AMODE(24) RMODE(24)   @G860P39 16866600
BAMTSPSZ DS    0F            MASTER TRACE TABLE SIZE AND       @G64MP2D 16900000
*                            SUBPOOL                           @G64MP2D 16950000
BAMTSP   DS    B             MASTER TRACE TABLE SUBPOOL        @G64MP2D 17000000
BAMTLEN  DS    3B            MASTER TRACE TABLE SIZE           @G64MP2D 17050000
BASPWD0F DS    F             RESERVED                          @G860PSS 17087500
BAMTCDR  DC    F'0'          MASTER TRACE TABLE CHNGE RTN ADDR @G860P39*17125000
                             IEEMB809 IS AMODE(24) RMODE(24)   @G860P39 17162500
BAMTDTAB DC    F'0'          ADDRESS OF TABLE DUMPED BY THE    @G64MP2D 17200000
*                            MASTER TRACE RECOVERY ROUTINE     @G64MP2D 17250000
BAMTDTSZ DS    0F            SIZE AND SUBPOOL OF TABLE DUMPED  @G64MP2D 17300000
*                            BY THE MASTER TRACE RECOVERY RTN  @G64MP2D 17350000
BAMTDTSP DS    B             SUBPOOL OF RECOVERY DUMPED TABLE  @G64MP2D 17400000
BAMTDTLN DS    3B            SIZE OF RECOVERY DUMPED TABLE     @G64MP2D 17450000
BAMTCNTL DC    X'00'         MASTER TRACE CONTROL FLAG         @G64MP2D 17500000
BAMT808  EQU   BA0            IEEMB808 IN CONTROL              @G64MP2D 17600000
BAMT809  EQU   BA1            IEEMB809 IN CONTROL              @G64MP2D 17650000
BAMT816  EQU   BA2            IEEMB816 IN CONTROL              @G64MP2D 17700000
BAMTRTRY EQU   BA3            IEEMB816 RETRY RTN ENTERED       @G64MP2D 17750000
BAMTTSWP EQU   BA4            MTT SWAP IN PROCESS                  @L1A 17766600
BAMTTENT EQU   BA5            MTT ENTRY IN PROCESS                 @L1A 17783200
BAMTRECF DC    X'00'         MASTER TRACE ERROR RECURSION      @G64MP2D 17800000
*                            FLAG                              @G64MP2D 17830000
BAMTR808 EQU   BA0            RECURSION IN IEEMB808            @G64MP2D 17900000
BAMTR809 EQU   BA1            RECURSION IN IEEMB809            @G64MP2D 17950000
BAMTR816 EQU   BA2            FAILURE IN IEEMB816              @G64MP2D 18000000
BAMTRUNK EQU   BA3            UNKNOWN IEEMB816 INVOCATION      @G64MP2D 18050000
BAMTITFL DC    X'80'         INTERNAL PROCESSING FLAG USED BY  @G64MP2D 18100000
*                            MASTER TRACE FACILITY             @G64MP2D 18120000
BAMTITAB EQU   BA0            MASTER TRACE TABLE REQUIRED AT   @G64MP2D 18140000
*                             SYSTEM INITIALIZATION BIT        @G64MP2D 18170000
BAMTSFRR EQU   BA1            SETFRR ADD ISSUED BY IEEMB809    @G64MP2D 18200000
BAMTFRRR EQU   BA2            SETFRR DELETE RETURNED CONTROL   @G64MP2D 18230000
*                             TO IEEMB809                      @G64MP2D 18260000
BASPBT04 DC    X'00'         RESERVED BYTE                     @G64MP2D 18350000
BAMTDECB DS    0F            MASTER TRACE RECOVERY SDUMP       @G64MP2D 18400000
*                            COMPLETION ECB                    @G64MP2D 18450000
BAMTDSW  DC    X'00'         ECB WAIT/POST FIELD               @G64MP2D 18460000
BAMTDW   EQU   BA0           ECB WAIT BIT                      @G64MP2D 18470000
BAMTDP   EQU   BA1           ECB POST BIT                      @G64MP2D 18480000
         DC    XL3'00'                                         @G64MP2D 18490000
BAMTINIT DS    0F            DEFAULT MASTER TRACE TABLE SIZE   @G64MP2D 18493000
*                            AND SUBPOOL REQUESTED             @G64MP2D 18494000
*                            AT SYSTEM INITIALIZATION          @G64MP2D 18495000
BAMTINSP DS    B             DEFAULT SUBPOOL                   @G64MP2D 18496000
BAMTINLN DS    3B            DEFAULT SIZE                      @G64MP2D 18497000
BAMTVTCB DC    F'0'          ADDRESS OF IEEVIPLS TCB FOR       @G64MP2D 18500000
*                            USE IN MASTER TRACE TABLE         @G64MP2D 18510000
*                            GETMAIN AND FREEMAIN IN IEEMB809  @G64MP2D 18520000
BAMJSCB  DC    A(0)          ADDRESS OF MASTER SCHEDULER JSCB  @G38EP2L 18530000
BAMTIOT  DC    A(0)          ADDRESS OF MASTER SCHEDULER TIOT  @G38EP2L 18540000
MSDDNAME DS    H'0'          DDNAME OF SYSLOG DATASET              @L5A 18570000
BASPWD0A DS    XL2'00'       RESERVED FULLWORD                 @G64MP2D 18600000
BACHNL   DC    A(0)          LAST CSCB ON PERSISTENT CHAIN         @L6C 18630000
BASEXP   DC    V(IEEBASEX)   ADDRESS OF BASEA EXTENSION            @07C 18679990
BASPWD0D DS    F'0'          RESERVED FULLWORD                 @G64MP2D 18699980
BASPWD0E DS    F'0'          RESERVED FULLWORD                 @G64MP2D 18720000
* BASEA EXTENSION                                                  @L6A 18722300
BASEX    DSECT               BASEA EXTENSION                       @L6A 18724600
BAXACR   DS    CL4           BASEA EXTENSION ACRONYM               @L6A 18726900
BAXVERS  DS    XL1           BASEA EXTENSION VERSION               @L6A 18729200
BAXFLGX  DS    CL1           Flags                                 @07A 18731990
BAXINIT  EQU   BA0           BASEX initialized                     @07A 18732480
BAXRES   DS    CL2           RESERVED                              @07C 18732970
BACMDP   DS    A             FIRST CSCB FOR TRANSIENT CHAIN        @L6A 18733800
BACMDL   DS    A             LAST CSCB FOR TRANSIENT CHAIN         @L6A 18735500
BACHID   DS    CL4           CSCB CELL POOL TOKEN ID               @L6A 18737200
BACHXID  DS    CL4           CSCX CELL POOL TOKEN ID               @L6A 18738900
BACHNLST DS    A             LAST CSCB IEEVWAIT PROCESSED          @L6A 18740700
BAGFSR   DS    A             GET/FREE SERVICE ROUTINE - IEEMB843   @L6A 18743000
BAMANR   DS    A             CHAIN MANIPULATION ROUTINE-IEEMB845   @L7C 18745300
BAREBREC DS    A             REBUILD RECOVERY ROUTINE  -IEEMB844   @L6A 18746800
BAESTAE  DS    A             ESTAE CREATE/EXIT ROUTINE -IEECB860   @P2A 18747500
BACMFA@  DS    A             Address of command flood area         @07A 18747700
BACRSV   DS    CL8           Reserved                              @07A 18747900
BACXID   DC    C'BASX'       BASEA EXTENSION ACRONYM               @L6A 18748300
         MEND  , */                                                     18750000
*   %BSLBASEA:  ;                                                       18800000
*   @EJECT;                              /*                  @YA32004*/ 18850000
*   %IF NOD~='NODSECT'  %THEN            /*                   Y01012 */ 29666700
*      %GOTO BASEAL01;                                                  29700000
*   %ELSE                                                               29800000
*      %GOTO S0      ;                   /*                   Y01939 */ 29900000
*   %BASEAL01:  ;                                                       30000000
*                                                                       30100000
*   DECLARE                                                             30200000
*     1 BASE     BASED(CVTMSER),                                        30300000
*   %S0     :  ;                         /*                   Y01939 */ 30400000
*   % DCL BAVKEY FIXED;                  /* VIRTUAL REGION    Y01029 */ 30450000
*   %     BAVKEY=1;                      /* PROTECT KEY       Y01029 */ 30460000
*                                                                       30500000
*                                                                       30560000
*   /* FOLLOWING VALUES DEFINE BIT PATTERNS FOR SWITCHES             */ 30600000
*                                                                       30700000
*                                                                       30800000
*      2 BACHN       PTR(31),            /* HANDLE TO COMMAND           30900000
*                                           SCHEDULING CHAIN  Y01939 */ 31000000
*      2 BACBID      CHAR(4),            /* CONTROL BLOCK ID @G64MP2D*/ 31050000
*      2 BASCPLID    FIXED(31),          /* UTOKEN CELL POLL ID  @L4C*/ 31100000
*      2 BAIPL       FIXED(31),          /* COMMUNICATION WORD   @P1C*/ 31200000
*       3 *          CHAR(3),            /*                      @P1C*/ 31250000
*       3 BAIPLCC    CHAR(1),            /* USED BY TOD CLOCK           31300000
*                                           MANAGEMENT           @P1C*/ 31350000
*      2 BAQ         PTR(31),            /* OVERLAYED BY BAMSLNK WORD1  31780000
*                                                            @G64MP2D*/ 31786000
*      2 BAPRC       PTR(31),            /* OVERLAYED BY BAMSLNK WORD2  31816000
*                                                            @G64MP2D*/ 31846000
*      2 BALGSTAT    BDY(DWORD),                                        31950000
*       3 MSLOGSVC   PTR(31) BDY(WORD),                                 32000000
*       3 BALOG      PTR(31),            /* POINTER TO LOG CONTROL      32300000
*                                           TABLE              Y01939*/ 32400000
*        4 BALOGINT  BIT(1),             /* INITIALIZED LOG             32450000
*                                            INDICATOR         Y01939*/ 32500000
*        4 *         BIT(1),             /* RESERVED                 */ 32550000
*        4 *         BIT(1),             /* RESERVED                 */ 32560000
*        4 *         BIT(1),             /* RESERVED                 */ 32570000
*        4 *         BIT(1),             /* RESERVED                 */ 32580000
*        4 *         BIT(1),             /* RESERVED                 */ 32590000
*        4 *         BIT(1),             /* RESERVED                 */ 32592000
*        4 *         BIT(1),             /* RESERVED                 */ 32594000
*      2 BAEBAPTR    PTR(31),            /* POINTER TO EXTENDED         32595000
*                                           MASTER SCHEDULER            32596000
*                                           RESIDENT DATA AREA          32597000
*                                           (INITIALIZED BY IEEMB860)   32598000
*                                                                @02C*/ 32599000
*      2 BASFL       CHAR(1),                                           32600000
*       3 BARSW       CHAR(1),                                          32700000
*        4 BAIN     BIT(1),              /* IPL FLAG                 */ 32800000
*        4 *        BIT(1),              /* RESERVED             @L3C*/ 32850000
*        4 BAINTSET BIT(1),              /* INDICATES INTERNAL SET      32970000
*                                           FOR TOD          @VS49464*/ 32980000
*        4 BAFSTOR  BIT(1),              /* ALL LOG BUFFERS ARE BEING   32990000
*                                           FREED                @04A*/ 33000000
*        4 *        BIT(4),              /* RESERVED BITS        @04C*/ 33010000
*                                                                       33020000
*      2 BAVERN      FIXED(8),           /* VERSION LEVEL        @L1A*/ 33070000
*      2 BASPHW04    FIXED(15),          /* RESERVED         @G38EP2L*/ 33120000
*      2 BAPKES      FIXED(15),          /* MASK OF INITIATOR           34400000
*                                           PROTECT KEYS             */ 34500000
*      2 BASPHW01    FIXED(15),          /* RESERVED HALF               34550000
*                                           WORD             @G64MP2D*/ 34600000
*      2 BASPHW02    FIXED(15),          /* RESERVED HALFWORD           34650000
*                                                            @G64MP2D*/ 34700000
*      2 MSLOGST     CHAR(1),            /* LOG STATUS XMCS          */ 35500000
*       3 MSLOGENQ BIT(1),               /* LOG DATASET SCHEDULED TO    35600000
*                                           BE XMCS  QUEUED TO          35700000
*                                           SYSOUT WRITER XMCS       */ 35800000
*       3 MSLOGTHD BIT(1),               /* LOG NOT SUPPORTED BIT       35900000
*                                           XMCS                     */ 36000000
*       3 MSLOGCOM BIT(1),               /* SIGNAL FOR COM TASK TO      36100000
*                                           STOP XMCS  ISSUING WTLS     36200000
*                                           XMCS                     */ 36300000
*       3 MSLOGDAR BIT(1),               /* LOG INTERNAL ABEND          36350000
*                                           FLAG             @G64MP2D*/ 36400000
*       3 MSLOGIPL BIT(1),               /* LOG FIRST-TIME ENTRY SWITCH 36450000
*                                                                    */ 36500000
*       3 MSLOGSTA BIT(1),               /* LOG STAE ENVIRONMENT SWITCH 36550000
*                                                                    */ 36600000
*       3 MSLOGCHN BIT(1),               /* LOG CHAIN MANIPULATION      36650000
*                                           ERROR                @02C*/ 36700000
*       3 MSLOGTND BIT(1),               /* LOG TASK END INDICATOR      36750000
*                                                                @02C*/ 36800000
*      2 BASPBYTE    CHAR(1),            /* MSTR SCH INIT CPL 20030  */ 37300000
*       3 BAMSSTAR BIT(1),               /* STAR RECURSION POINTER      37400000
*                                                             Y01037 */ 37500000
*       3 *        BIT(1),               /* RESERVED         @G860PSS*/ 37550000
*       3 BAMASCH  BIT(1),               /* MASTER SCHEDULER REGION     38000000
*                                           INITIALIZATION STARTED      38020000
*                                                           @YM3520P */ 38030000
*       3 BAMSINIT BIT(1),               /* MASTER SCHEDULER            38040000
*                                           INITIALIZATION IS COMPLETE  38050000
*                                                            @G741P2G*/ 38060000
*       3 BAOKDUMP BIT(1),               /* A DUMP WAS TAKEN BY THE     38078000
*                                           INITIATOR DURING MASTER     38096000
*                                           SCHED INIT           @L2A*/ 38114000
*       3 *        BIT(3),               /* RESERVED             @L1C*/ 38132000
*      2 BALOGECB    FIXED(31),          /* LOG ECB XMCS             */ 38150000
*      2 BAMTTWKP    PTR(31),            /* MASTER TRACE TABLE ENTRY    38200000
*                                           PROCESSOR WORKAREA POINTER  38250000
*                                                                @L1A*/ 38300000
*      2 BAMONITR    CHAR(1),            /* MONITOR FLAGS               38900000
*                                           (TERMINALS-TJB CHAIN,       39000000
*                                           20030 CONSOLES-UCME         39100000
*                                           CHAIN) 20030             */ 39200000
*       3 BADSN    BIT(1),               /* DSNAME ARE BEING MONITORED  39300000
*                                                                @L5C*/ 39400000
*       3 BASPACE  BIT(1),               /* SPACE IS BEING MONITORED    39500000
*                                                             Y02669 */ 39600000
*       3 *        BIT(1),               /* RESERVED         @G64MP2D*/ 39630000
*       3 *        BIT(1),               /* SPARE             Y02669 */ 39680000
*       3 *        BIT(1),               /* SPARE             Y02669 */ 39730000
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 39780000
*       3 *        BIT(1),               /* RESERVED                 */ 39830000
*       3 *        BIT(1),               /* RESERVED         @G64MP2D*/ 39880000
*      2 BAMONTR2    CHAR(1),            /* RESERVED FOR MONITOR        40700000
*                                           20030                    */ 40800000
*      2 BACHFLGS    CHAR(1),            /* CSCB FLAGS           @L6C*/ 40825900
*       3 BACSCBA  BIT(1),               /* CSCB LOCATION IS ABOVE 16M  40843100
*                                                                @L6A*/ 40860300
*       3 BACSCXB  BIT(1),               /* RESERVED                    40877700
*                                                                @L8C*/ 40903600
*     2 BARESV       CHAR(1),            /* RESERVED             @L6A*/ 41007200
*      2 BAMSIECB    FIXED(31),          /* MASTER SCHEDULER            41033300
*                                           INITIALIZATION ECB   @L1A*/ 41066600
*      2 *           PTR(31),            /* RESERVED (WAS BAS3603D)     41126280
*                                                                @P4C*/ 41166270
*      2 BARSV1      CHAR(8),            /* RESERVED             @07C*/ 41206260
*      2 BALOGCOM    FIXED(31),          /* SYSLOG DEB                  41250000
*                                           TABLE ADDRESS    @G64MP2D*/ 41300000
*      2 BASUBECB    FIXED(31),          /* SUBSYSTEM SERIALIZATION ECB 41800000
*                                                             Y02668 */ 41810000
*      2 BAJNCNT     FIXED(15),          /* # OF DEVICES MONITORING     41850000
*                                           JOBNAMES          Y02669 */ 41860000
*      2 BASESCT     FIXED(15),          /* # OF DEVICES MONITORING     41900000
*                                           SESSIONS          Y02669 */ 41910000
*      2 BASTCNT     FIXED(15),          /* # OF DEVICES MONITORING     41950000
*                                           STATUS            Y02669 */ 41960000
*      2 BARSV2      FIXED(15),          /* RESERVED             @07C*/ 42029990
*      2 MSSCHED     PTR(31),            /* POINTER TO SCHEDULER NIP    42090000
*                                           PARAMETER LIST   @G385P2N*/ 42092000
*      2 MSSMFPRM    PTR(31),            /* POINTER TO THE SMF          42094000
*                                           PARMLIB MEMBER    Y02675 */ 42096000
*      2 BAASCB      PTR(31),            /* MASTER SCHEDULER ASCB       42098000
*                                           ADDRESS           R20290 */ 42098400
*      2 *           BDY(WORD),          /*                   Y02669 */ 42098500
*       3 MSLOGCLS   CHAR(1),            /* LOG OUTPUT CLASS  Y02669 */ 42098800
*       3 MSLOGLMT   FIXED(24),          /* NO. OF WTLS IN ONE DATA     42099600
*                                           SET              @G64MP2D*/ 42106600
*      2 MSLGCLOZ    PTR(31),            /* LOG TERMINATION ECB      */ 42121200
*       3 MSCLOSSW   PTR(8),             /* ECB WAIT/POST FIELD      */ 42127200
*        4 MSCLOSW   BIT(1),             /* ECB WAIT BIT             */ 42133200
*        4 MSCLOSP   BIT(1),             /* ECB POST BIT             */ 42143200
*        4 *         BIT(6),             /* RESERVED                 */ 42153200
*      2 MSLGWLOG    PTR(31),            /* LOG DATA SET SWITCH ECB  */ 42163200
*       3 MSWLOGSW   PTR(8),             /* ECB WAIT/POST FIELD      */ 42165200
*        4 MSWLOGW   BIT(1),             /* ECB WAIT BIT             */ 42165600
*        4 MSWLOGP   BIT(1),             /* ECB POST BIT             */ 42166000
*        4 *         BIT(6),             /* RESERVED                 */ 42166400
*      2 MSLGWTR     PTR(31),            /* LOG WTL QUEUE WRITER ECB */ 42166500
*       3 MSWTRSW    PTR(8),             /* ECB WAIT/POST FIELD      */ 42166600
*        4 MSWTRW    BIT(1),             /* ECB WAIT BIT             */ 42177700
*        4 MSWTRP    BIT(1),             /* ECB POST BIT             */ 42187700
*        4 *         BIT(6),             /* RESERVED                 */ 42188100
*       3 *          PTR(24),            /* RESERVED             @P3A*/ 42188300
*      2 MSLGSTRT    PTR(31),            /* LOG RE-ACTIVATION ECB    */ 42188500
*       3 MSSTRTSW   PTR(8),             /* ECB WAIT/POST FIELD      */ 42188600
*        4 MSSTRTW   BIT(1),             /* ECB WAIT BIT             */ 42188700
*        4 MSSTRTP   BIT(1),             /* ECB POST BIT             */ 42188800
*        4 *         BIT(6),             /* RESERVED                 */ 42192500
*       3 MSSTRTRB   PTR(24),            /* ECB RB ADDRESS       @P3M*/ 42193500
*      2 MSLGJSCB    FIXED(31),          /* LOG SWAPPED JSCB ADDRESS    42194500
*                                                            @G64MP2D*/ 42194800
*      2 BASCTPTR    PTR(31),            /* POINTER TO SCHEDULED        42211600
*                                           COMMANDS TABLE (IEEMB884)   42228400
*                                                                @L1A*/ 42245400
*      2 BACASTPT    PTR(31),            /* POINTER TO CAST      @L1A*/ 42295400
*      2 MS1BASEX  BDY(BYTE),                                           43200000
*       3 *           CHAR(20),                                         43300000
*       3 *           CHAR(20),                                         43400000
        3 *           CHAR(16),                                         43500000
*       3 *           CHAR(20);          /* 76 BYTES ZEROED.         */ 43530000
*   DECLARE 1  BASES01 CHAR(LENGTH(MS1BASEX))                 /* @07C*/ 43649990
*         DEFINED(MS1BASEX),             /*                      @L1C*/ 43700000
*                                                                       43800000
*      2 BASPBT02    CHAR(1),            /* RESERVED BYTE    @G64MP2D*/ 43850000
*                                                                       43900000
*      2 MSSSB       CHAR(1),            /* MONITOR TIME NOTE           43950000
*                                           BYTE             @G64MP2D*/ 44000000
*       3 MSBTN       CHAR(1),           /* TIME NOTE BIT IS BIT 6   */ 44050000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44100000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44150000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44200000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44250000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44300000
*        4 *        BIT(1),              /* RESERVED BIT     @G64MP2D*/ 44350000
*        4 MSTN     BIT(1),              /* VALUE TO TURN ON TIME       46100000
*                                           NOTE                     */ 46200000
*        4 *        BIT(1),              /* RESERVED                 */ 46300000
*                                                                       46400000
*      2 BASPBT03    CHAR(1),            /* RESERVED BYTE    @G64MP2D*/ 46450000
*                                                                       46490000
*      2 MSECBFL     CHAR(1),            /* SCHEDULER FLAG              46530000
*                                           BYTE             @G64MP2D*/ 46570000
*       3 BAMSJOBS BIT(1),               /* IEFJOBS DD IS IN MASTER     46596600
*                                           JCL                  @L9C*/ 46623200
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 46650000
*       3 MSWTL    BIT(1),               /* LOG ABEND                   46690000
*                                           RECURSION BIT    @G64MP2D*/ 46730000
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 46770000
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 46810000
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 46850000
*       3 *        BIT(1),               /* RESERVED BIT     @G64MP2D*/ 46890000
*       3 MSSUM    BIT(1) ABNL,          /* SUMMARY BIT, VARY UCB       46930000
*                                           SCAN REQUIRED.           */ 46970000
*      2 BAMTTBL     PTR(31),            /* MASTER TRACE                47010000
*                                           TABLE ADDRESS    @G64MP2D*/ 47050000
*      2 BAMTRTN     PTR(31),            /* MASTER TRACE DATA ENTRY     47090000
*                                           ROUTINE ADDRESS  @G64MP2D*/ 47130000
*                                                                       47170000
*      2 BAMTSPSZ    CHAR(4),            /* MASTER TRACE TABLE          47210000
*                                           SUBPOOL AND SIZE @G64MP2D*/ 47250000
*       3 BAMTSP     CHAR(1),            /* SUBPOOL OF MASTER           47290000
*                                           TRACE TABLE      @G64MP2D*/ 47330000
*       3 BAMTLEN    CHAR(3),            /* SIZE OF MASTER              47370000
*                                           TRACE TABLE      @G64MP2D*/ 47380000
*      2 BASPWD0F    FIXED(31),          /* RESERVED         @G860PSS*/ 47430000
*      2 BAMTCDR     PTR(31),            /* MASTER TRACE TABLE CHANGE   47530000
*                                           ROUTINE ADDRESS  @G64MP2D*/ 47570000
*      2 BAMTDTAB    PTR(31),            /* ADDR OF TABLE DUMPED BY     47610000
*                                           THE MASTER TRACE            47650000
*                                           RECOVERY ROUTINE @G64MP2D*/ 47690000
*      2 BAMTDTSZ    CHAR(4),            /* SIZE AND SUBPOOL OF TABLE   47730000
*                                           DUMPED BY THE MASTER TRACE  47770000
*                                           RECOVERY ROUTINE @G64MP2D*/ 47810000
*       3 BAMTDTSP   CHAR(1),            /* SUBPOOL OF RECOVERY         47850000
*                                           DUMPED TABLE     @G64MP2D*/ 47890000
*       3 BAMTDTLN   CHAR(3),            /* SIZE OF RECOVERY DUMPED     47930000
*                                           TABLE            @G64MP2D*/ 47970000
*      2 BAMTCNTL    BIT(8),             /* MASTER TRACE CONTROL FLAG   48010000
*                                                            @G64MP2D*/ 48050000
*       3 BAMT808    BIT(1),             /* IEEMB808 IN CONTROL         48090000
*                                                            @G64MP2D*/ 48130000
*       3 BAMT809    BIT(1),             /* IEEMB809 IN CONTROL         48170000
*                                                            @G64MP2D*/ 48210000
*       3 BAMT816    BIT(1),             /* IEEMB816 IN CONTROL         48250000
*                                                            @G64MP2D*/ 48290000
*       3 BAMTRTRY   BIT(1),             /* IEEMB816 RETRY ROUTINE      48330000
*                                           ENTERED          @G64MP2D*/ 48370000
*       3 BAMTTSWP   BIT(1),             /* MTT SWAP IN PROCESS         48410000
*                                                                @L1A*/ 48418000
*       3 BAMTTENT   BIT(1),             /* MTT ENTRY IN PROCESS        48426000
*                                                                @L1A*/ 48434000
*       3 *          BIT(2),             /* RESERVED             @L1A*/ 48442000
*      2 BAMTRECF    BIT(8),             /* MASTER TRACE ERROR          48450000
*                                           RECURSION FLAG   @G64MP2D*/ 48490000
*       3 BAMTR808   BIT(1),             /* RECURSION IN IEEMB808       48530000
*                                                            @G64MP2D*/ 48570000
*       3 BAMTR809   BIT(1),             /* RECURSION IN IEEMB809       48610000
*                                                            @G64MP2D*/ 48650000
*       3 BAMTR816   BIT(1),             /* FAILURE IN IEEMB816         48690000
*                                                            @G64MP2D*/ 48730000
*       3 BAMTRUNK   BIT(1),             /* UNKNOWN IEEMB816            48770000
*                                           INVOCATION       @G64MP2D*/ 48810000
*       3 *          BIT(4),             /* RESERVED         @G64MP2D*/ 48850000
*      2 BAMTITFL    BIT(8),             /* INTERNAL PROCESSING         49288000
*                                           FLAG USED BY MASTER         49294000
*                                           TRACE FACILITY   @G64MP2D*/ 49300000
*       3 BAMTITAB   BIT(1),             /* MASTER TRACE TABLE          49306000
*                                           REQUIRED AT SYSTEM          49312000
*                                           INITIALIZATION BIT          49318000
*                                                            @G64MP2D*/ 49324000
*       3 BAMTSFRR   BIT(1),             /* SETFRR A MACRO              49330000
*                                           ISSUED BY IEEMB809          49336000
*                                                            @G64MP2D*/ 49342000
*       3 BAMTFRRR   BIT(1),             /* SETFRR D RETURNED CONTROL   49348000
*                                           TO IEEMB809      @G64MP2D*/ 49354000
*       3 *          BIT(5),             /* RESERVED         @G64MP2D*/ 49360000
*      2 BASPBT04    CHAR(1),            /* RESERVED BYTE    @G64MP2D*/ 49376000
*                                                                       49396000
*      2 BAMTDECB    FIXED(31),          /* MASTER TRACE RECVRY SDUMP   49416000
*                                           COMPLETION ECB   @G64MP2D*/ 49436000
*       3 BAMTDSW    PTR(8),             /* ECB WAIT/POST FIELD      */ 49440000
*        4 BAMTDW    BIT(1),             /* ECB WAIT BIT             */ 49444000
*        4 BAMTDP    BIT(1),             /* ECB POST BIT             */ 49448000
*        4 *         BIT(6),             /* RESERVED                 */ 49452000
*      2 BAMTINIT    FIXED(31),          /* DEFAULT MASTER TRACE        49452600
*                                           TABLE SIZE AND              49452800
*                                           SUBPOOL REQUESTED           49453000
*                                           AT SYSTEM                   49453200
*                                           INITIALIZATION   @G64MP2D*/ 49453400
*       3 BAMTINSP   CHAR(1),            /* DEFAULT SUBPOOL  @G64MP2D*/ 49453600
*       3 BAMTINLN   CHAR(3),            /* DEFAULT SIZE     @G64MP2D*/ 49453800
*      2 BAMTVTCB    FIXED(31),          /* ADDRESS OF IEEVIPLS         49454400
*                                           TCB FOR MASTER TRACE        49454600
*                                           TABLE GETMAIN AND           49454800
*                                           FREEMAIN IN                 49455000
*                                           IEEMB809         @G64MP2D*/ 49455200
*      2 BAMJSCB     PTR(31),            /* ADDRESS OF MASTER           49455300
*                                           SCHEDULER JSCB   @G38EP2L*/ 49455400
*      2 BAMTIOT     PTR(31),            /* ADDRESS OF MASTER           49455500
*                                           SCHEDULER TIOT   @G38EP2L*/ 49455600
*      2 MSDDNAME    FIXED(15),          /* DDNAME OF SYSLOG DATASET    49505600
*                                                                 @L5A*/49605600
*      2 BASPWD0A    CHAR(2),            /* RESERVED              @L5C*/49631000
*      2 BACHNL      PTR(31),            /* LAST CSCB ON PERSISTENT     49656400
*                                           CHAIN                 @L6A*/49681800
*      2 BASEXP      PTR(31),            /* ADDRESS OF BASEA EXTENSION  49707200
*                                                                 @L6A*/49732600
*      2 BASPWD0D    FIXED(31),          /* RESERVED FULL               49758000
*                                           WORD              @G46MP2D*/49783400
*      2 BASPWD0E    FIXED(31);          /* RESERVED FULL               49808800
*                                           WORD              @G46MP2D*/49834200
*@SPACE(2);                                                             49860000
*/********************************************************************/ 49890000
*/*                                                                  */ 49940000
*/*  BASEX - BASEA EXTENSION                                     @L6A*/ 49941900
*/*                                                                  */ 49943800
*/********************************************************************/ 49945700
* %IF IEEBASEX_BASE = '' %THEN                                          49947890
*   %IEEBASEX_BASE = 'BASED(BASEXP)';                                   49948180
* %IF IEEBASEX_CMFA = '' %THEN;                                         49948470
* %IF IEEBASEXC = '' %THEN;                                             49948760
* %IF IEEBASEXC1 = '' %THEN;                                            49949050
* %IF IEEBASEXF1 = '' %THEN;                                            49949340
* %IF IEEBASEXP = '' %THEN;                                             49949630
* DCL 1 BASEX IEEBASEX_BASE,             /* BASEA EXTENSION       @L6A*/49949920
*       3 BAXACR     CHAR(4) IEEBASEXC1, /* BASEA EXTENSION ACRONYM     49950210
*                                                                 @L6A*/49951400
*       3 BAXVERS    FIXED(8) IEEBASEXF1, /* BASEA EXTENSION VERSION    49954190
*                                                                 @L6A*/49955200
*       3 BAXFLGX    CHAR(1) IEEBASEXC,  /* Flags                 @07A*/49957790
*         5 BAXINIT BIT(1),              /* BASEX initialized     @07A*/49958480
*       3 BAXRES     CHAR(2) IEEBASEXC,  /* RESERVED              @L6A*/49959170
*       3 BACMDP     PTR(31) IEEBASEXP,  /* FIRST CSCB FOR TRANSIENT    49959860
*                                           CHAIN                 @L6A*/49960900
*       3 BACMDL     PTR(31) IEEBASEXP,  /* LAST CSCB FOR TRANSIENT     49963690
*                                           CHAIN                 @L6A*/49964700
*       3 BACHID     CHAR(4) IEEBASEXC,  /* CSCB CELL POOL TOKEN ID     49967490
*                                                                 @L6A*/49968500
*       3 BACHXID    CHAR(4) IEEBASEXC,  /* CSCX CELL POOL TOKEN ID     49969390
*                                                                 @L6A*/49969700
*       3 BACHNLST   PTR(31) IEEBASEXP,  /* LAST CSCB IEEVWAIT PROCESSED49971290
*                                                                 @L6A*/49972300
*       3 BAGFSR     PTR(31) IEEBASEXP,  /* GET/FREE SERVICE ROUTINE -  49975090
*                                           IEEMB843              @L6A*/49976100
*       3 BAMANR     PTR(31) IEEBASEXP,  /* CHAIN MANIPULATION ROUTINE  49978890
*                                           IEEMB845              @L7C*/49979900
*       3 BAREBREC   PTR(31) IEEBASEXP,  /* REBUILD RECOVERY ROUTINE    49981090
*                                           IEEMB844              @P2C*/49981500
*       3 BAESTAE    PTR(31) IEEBASEXP,  /* COMMAND ESTAE CREATION/EXIT 49982690
*                                           ROUTINE (IEECB860)    @P2A*/49983100
*       3 BACMFA@    PTR(31) IEEBASEX_CMFA,  /* Address of command      49983300
*                                           flood area           @07A*/ 49983500
*       3 BACRSV     CHAR(8) IEEBASEXC;      /* Reserved         @07A*/ 49983700
*@SPACE(2);                                                             49984200
*/********************************************************************/ 49985600
*/*                                                                  */ 49987500
*/*  IEEBASEA - ENTRY POINT DECLARES                                 */ 49990000
*/*                                                                  */ 50040000
*/********************************************************************/ 50090000
*                                                                       50140000
* DECLARE                                                               50190000
* MB808 ENTRY BASED(BAMTRTN) VALUERANGE(*)                              50225700
*                            OPTIONS(AMODE(24),RMODE(24));/*            50261400
*                                         SYMBOLIC ENTRY POINT TO       50297100
*                                         MASTER TRACE DATA ENTRY       50332800
*                                         ROUTINE IEEMB808 - TO USE,    50368500
*                                         ISSUE CALL MB808   @G860P2L*/ 50404200
* DECLARE                                                               50440000
* MB809 ENTRY BASED(BAMTCDR) VALUERANGE(*)                              50475700
*                            OPTIONS(AMODE(24),RMODE(24));/*            50511400
*                                         SYMBOLIC ENTRY POINT TO       50547100
*                                         MASTER TRACE TABLE CREATE     50582800
*                                         - DEACTIVATE RTN IEEMB809     50618500
*                                  -TO USE, ISSUE CALL MB809 @G860P2L*/ 50654200
*@SPACE(2);                                                             50657700
*/********************************************************************/ 50661200
*/*                                                                  */ 50664700
*/*       CONSTANTS FOR ACRONYM                                      */ 50668200
*/*                                                                  */ 50671700
*/********************************************************************/ 50675200
*                                                                       50678700
* DCL BACXID CHAR(4) CONSTANT('BASX');   /* BASEX ACRONYM        @L6A*/ 50682200
*                                                                       50685700
*/**********************************************************     @L1A*/ 50690000
*/*                                                              @L1A*/ 50740000
*/*       CONSTANTS FOR VERSION LEVEL (BAVERN)                   @L1A*/ 50790000
*/*                                                              @L1A*/ 50840000
*/**********************************************************     @L1A*/ 50890000
* DCL BAVERNID FIXED(8) CONSTANT(BASP410);/* VERSION LEVEL - UPDATED    50940000
*                        FOR SIZE OR INCOMPATIBLE CHANGE         @L6C*/ 50990000
* DCL BASP13   FIXED(8) CONSTANT(1);     /* VERSION LEVEL OS/VS2        51040000
*                                           JBB1326              @L1A*/ 51090000
* DCL BASP410  FIXED(8) CONSTANT(2);     /* VERSION LEVEL OS/VS2 @P5C*/ 51140000
*/**********************************************************     @06A*/ 51190000
*/*                                                              @06A*/ 51240000
*/*       MISCELLANEOUS CONSTANTS                                @06A*/ 51290000
*/*                                                              @06A*/ 51340000
*/**********************************************************     @06A*/ 51390000
