*        %GOTO CHL1;    /* BILINGUAL MAPPING                            00450000
         MACRO                                                          00600000
         IEECHAIN &INCCSCX=YES ,   */                                   00800000
*%CHL1 : ;                                                              00850000
*/***START OF SPECIFICATIONS******************************************/ 00900000
*/*                                                              @PAA*/ 00950000
*/*01* MACRO NAME:  IEECHAIN                                     @LDC*/ 01000000
*/*                                                              @PAA*/ 01050000
*/*01* DESCRIPTIVE NAME:  COMMAND SCHEDULING CONTROL BLOCK       @LDC*/ 01080000
*/*01* ACRONYM:  CSCB                                            @LDC*/ 01110000
*/*01* EXTERNAL CLASSIFICATION: DMTI                             @LDA*/ 01140000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @LDA*/ 01170000
*/*                                                              @PAA*/ 01200000
*/*                                                                  */ 02200000
*/*01* PROPRIETARY STATEMENT=                                        */ 02207000
*/***PROPRIETARY_STATEMENT********************************************/ 02214000
*/*                                                                  */ 02215000
*/*                                                                  */ 02220500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 02226000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 02231500
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2001                      */ 02243690
*/*                                                                  */ 02248000
*/* STATUS= HBB7703                                                  */ 02255490
*/*                                                                  */ 02259000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02264500
*/*                                                                  */ 02270000
*/*01*  DSECT NAME:  CHAIN                                       @LDC*/ 02270800
*/*                                                              @PAA*/ 02271600
*/*01*  COMPONENT:  Master Scheduler (SC1B8)                     @LDC*/ 02272400
*/*                                                              @PAA*/ 02273200
*/*01*  EYE-CATCHER:  CSCB for the CSCB                          @LDC*/ 02274000
*/*                CSCX for the CSCB extension                   @PAA*/ 02274800
*/*02*    OFFSET:  CSCB: 216                                     @PEC*/ 02275600
*/*                CSCX: 0                                       @LDC*/ 02276400
*/*02*    LENGTH:  CSCB: 4                                       @LDC*/ 02277200
*/*                CSCX: 4                                       @LDC*/ 02278000
*/*                                                              @PAA*/ 02278800
*/*01*  STORAGE ATTRIBUTES:                                      @LDC*/ 02279600
*/*02*    SUBPOOL:  241 for the CSCB, 245 for the CSCX           @LDC*/ 02280400
*/*02*    KEY:  0                                                @LDC*/ 02281200
*/*02*    RESIDENCY:  The CSCB is above the 16M line by default, @LDC*/ 02282000
*/*                but may be specified as below the 16M line    @PAA*/ 02282800
*/*                during system initialization. The CSCX is     @PAA*/ 02283600
*/*                below the 16M line.                           @PAA*/ 02284400
*/*                                                              @PAA*/ 02285200
*/*01*  SIZE:  256 bytes for the CSCB                            @LFC*/ 02286000
*/*         36 bytes for the CSCX                                @PAA*/ 02286800
*/*                                                              @PAA*/ 02287600
*/*01*  METHOD OF ACCESS:                                        @LDC*/ 02288400
*/*      BAL  - DSECT CARD SHOULD PRECEDE MACRO CALL.  USING ON      */ 02290000
*/*             CHAIN GIVES ADDRESSABILITY FOR ALL SYMBOLS.          */ 02292000
*/*                                                                  */ 02292300
*/*             IF THE CSCX DSECT IS NOT WANTED, SPECIFY         @L8A*/ 02292600
*/*             INCCSCX=NO UPON MACRO INVOCATION.  THE DEFAULT   @L8A*/ 02292900
*/*             IS TO PROVIDE A CSCX.                            @L8A*/ 02293200
*/*                                                                  */ 02293500
*/*      PL/S - DCL CSCBPTR PTR                                      */ 02294000
*/*                                                                  */ 02300000
*/*             IF THE CSCX DSECT IS NOT WANTED, DELCARE A       @L8A*/ 02300500
*/*             VARIABLE NAMED '% INCCSCX' AND SET IT EQUAL TO   @L8A*/ 02301000
*/*             'NO' PRIOR TO MACOR INVOCATION.   THE DEFAULT IS @L8A*/ 02301500
*/*             TO PROVIDE A CSCX MAPPING.                       @L8A*/ 02302000
*/*                                                                  */ 02302500
*/*01* CREATED BY:  Callers of the GETCSCB service.              @LDC*/ 02302700
*/*                                                                  */ 02302900
*/*01* POINTED TO BY:                                            @LDC*/ 02303100
*/*      ASCBCSCB FIELD OF THE ASCB DATA AREA                    @L7A*/ 02303500
*/*      BACHN FIELD OF THE BASEA DATA AREA                      @L7A*/ 02304000
*/*      CHPTR FIELD OF THE CSCB DATA AREA                       @L7A*/ 02304500
*/*      CHPREVP FIELD OF THE CSCB DATA AREA                     @L7A*/ 02305000
*/*      CHCSCBP FIELD OF THE CSCX DATA AREA                     @L7A*/ 02305500
*/*      JSCBCSCB FIELD OF THE JSCB DATA AREA                    @L7A*/ 02306000
*/*      LCTQDRTY FIELD OF THE LCT DATA AREA                     @L7A*/ 02306500
*/*                                                                  */ 02307000
*/*01* SERIALIZATION:  ENQ on major SYSIEFSD minor Q10           @LDC*/ 02307100
*/*                                                                  */ 02307200
*/*01* FUNCTION:  Contains run time job description data passed  @LDC*/ 02307300
*/*            to command execution routines from command        @LDC*/ 02307400
*/*            scheduling routines.                              @PAA*/ 02307500
*/*                                                                  */ 02307600
*/* DEPENDENCIES:                                                @LDC*/ 02307700
*/*      THE AUTHORITY AND DISPOSITION BYTES (CHAUTH AND CHDISP) @L3A*/ 02308000
*/*      MUST BE EXACTLY MAPPED BY THE CORRESPONDING FIELDS IN   @L3A*/ 02308500
*/*      THE XSA (XAAUTH AND XADISP IN IEEXSA).                  @L3A*/ 02309000
*/*                                                              @L3A*/ 02309500
*/*  NOTES:                                                      @LDC*/ 02310000
*/*      RUN TIME JOB DESCRIPTOR RESIDENT IN GLOBAL SQA AND          */ 02350000
*/*      COMMUNICATION AREA PASSED VIA CSCB QUEUE                    */ 02400000
*/*      FROM COMMAND SCHEDULING ROUTINES                            */ 02600000
*/*      TO COMMAND EXECUTION ROUTINES                               */ 02800000
*/*                                                                  */ 03000000
*/*      UPDATED BY COMMAND SCHEDULER IN EVENT OF -                  */ 05000000
*/*      CANCEL JOBNAME AFTER SELECTION / CANCEL WRITER DEVICE /     */ 05200000
*/*      MODIFY / STOP                                               */ 05400000
*/*                                                                  */ 05600000
*/*      THE CSCB AND CSCX ARE CREATED AND MANIPULATED BY THE    @L7A*/ 05600100
*/*      GETCSCB AND MGCR MACROS.                                @L7A*/ 05600200
*/*                                                                  */ 05600300
*/*  CHANGE ACTIVITY - ZA29618, X60BE9A, ZM50188, G17FP9A        @L1A*/ 05600400
*/*                    G38EP2L, ZMB0266, G380P2N, G381P2E        @L1A*/ 05600600
*/* $L1=XMCTASK, JBB1326,  800620,  L1SJ: EXPAND CSCB                */ 05600700
*/* $D1=DCR51 JBB1326 801001 PD39: DIRECT INVOCATION OF VARY         */ 05600800
*/* $H1=3840AU JBB2125 830420 PD2L: ASSIGN/UNASSIGN SUPPORT          */ 05600900
*/* $D2=DCR152 JBB2125 830420 PD2L: ADD COMMAND DEPENDENT FLAG BYTE  */ 05601000
*/* $L2=SP313  JBB3313 880226 PDCR: MVS B1 SECURITY SUPPORT          */ 05601100
*/* $L3=SP3134CR JBB3313 880729 PDCR: MVS B1 SECURITY SUPPORT        */ 05601200
*/* $P1=PGP0196  JBB3313 880201 PDDK: INCORRECT MACRO LENGTH         */ 05601300
*/* $P2=PGP0323  JBB3313 890516 PDHK: ADDED CHPOST FLAG              */ 05601400
*/* $P3=PGP0466  JBB3313 890616 PDHK: MOVED CHPOST FLAG TO BEGINNING */ 05601500
*/* $P4=PGP0470  JBB3313 890619 PDHK: MOVED CHPOST FLAG TO BEGINNING */ 05601600
*/*                                   FOR PLAS VERSION (SP313 ONLY)  */ 05601700
*/* $L4=COUPLCNS, HBB4410, 870316, PDV1: "BYPASS INIATOR GET REGION  */ 05601800
*/*                                      PROCESSING" OPTION SUPPORT  */ 05601900
*/* $L5=CNMG2MG,  HBB4410, 870420, PDU9:    CONSOLE MERGE STAGE II   */ 05602000
*/* $P5=PEO0055,  HBB4410, 880120, PDDI:    OPERATOR SSI             */ 05602100
*/* $L6=OPSSI6V1, HBB4410, 881020, PDV1: REORGANIZATION OF SP410     */ 05602200
*/*                                        CSCB FIELDS               */ 05602300
*/* $L7=CSCBVAHG, HBB4410, 881026, PDHG: CSCB VSCR                   */ 05602400
*/* $L8=CSCBVDHF, HBB4410, 890206, PDHF: MOVE CSCB FIELDS TO CSCX    */ 05602500
*/* $P6=PEO1662,  HBB4410, 890515, PDV1: MOVE CHBIGRP                */ 05602600
*/* $P7=PEO1921,  HBB4410, 890626, PDHK: MOVE CHDITOKN TO RES FIELD  */ 05602700
*/* $P8=PGP0600  JBB3313 890921 PDHK: REMOVED CHPOST FLAG            */ 05602900
*/* $P9=PEO2900,  HBB4410, 891127, PDHG: CORRECT VERSION FIELD       */ 05603000
*/* $L9=APPC13AD, HBB4420, 890602, PDAD: APPC SUPPORT                */ 05603100
*/* $LA=TLIBR,    HBB4430, 911008, PD35: TAPE LIBRARY SUPPORT        */ 05603200
*/* $PA=PKB0806,  HBB4430, 920725, PDCM: PROLOG CLEANUP              */ 05603300
*/* $LB=SYSOP2ED, HBB5510, 921119, PDED: SYSPLEX OPERATIONS          */ 05603400
*/* $LC=4DGIT3J,  HBB5510, 930415, PD3J: Four Digit Device Support   */ 05603500
*/* $LD=SYSOP16,  HBB5510, 930520, PD3J: SHOWHDR updates             */ 05603600
*/* $D3=DIG0126,  HBB5510, 930703, PDED: JOBNAME= on START command   */ 05604500
*/* $LE=JBSTCHED, HBB5510, 930703, PDED: Job Support for Started Task*/ 05605400
*/* $PB=PIG2753,  HBB5510, 930909, PDCC: Special Allocation          */ 05605800
*/* $PC=PIG2698,  HBB5510, 931104, PDED: Move MODIFY back inline     */ 05606000
*/* $LF=ARM04NK,  HBB5520, 931109, PDNK: ARM restart support         */ 05606100
*/* $PD=PIG3714,  HBB5510, 931119, PDLC: Add back CHUNIT             */ 05606200
*/* $LG=CLONE7HD, HBB5520, 940310, PDHD: Sysclone support            */ 05606300
*/* $01=OW09528,  HBB5510, 940831, PDBB: Add CHCMFL44 aka CHRTDM:    */ 05606400
*/*                                      ROUTE-generated command @01A*/ 05606600
*/* $PE=PQC0098,  HBB6603, 950224, PDCM: Correct eye-catcher offset  */ 05606700
*/* $LH=TQC0715,  HBB6603, 950831, PDCM: Add LIKE structure          */ 05606800
*/* $02=OW15497,  HBB5510, 960222, PDED: Add originating console id  */ 05606900
*/* $03=OW21413,  HBB5520, 960815, PDCI: Add CHNOBY                  */ 05607000
*/* $LI=TUX0310,  HBB6605, 970530, PDCM: PLS/3 test for LIKE struct. */ 05607200
*/* $04=OW45398,  HBB7703, 010330, PDXB: Command Flooding Rollback   */ 05607300
*/* $05=OW48175,  HBB7703, 010213, PDBV: Add CHPMSI                  */ 05607350
*/*                                                                  */ 05607400
*/* *END OF SPECIFICATIONS********************************************/ 05607600
*%GOTO CHL2;  /*                                                        05608100
         SPACE 1                                                        05609000
         DS    0D -      COMMAND SCHEDULING CONTROL BLOCK               05610000
CHAIN    EQU   * -       CSCBPTR -> CSCB                                05800000
*                                                                       06000000
*              BEGINNING OF MAPPING COMMON                              06200000
*              TO CONTROL AND INPUT CSCB FORMATS                        06400000
*                                                                       06600000
CHPTR    DS    A -       CHAIN PTR TO NEXT CSCB                         06800000
CHFLG    DS    0CL4 -    FOUR BYTES                                     07000000
CHVCD    DS    C -       COMMAND VERB CODE                              07200000
CHDIRINV EQU   X'00' -   VERB CODE FOR DIRECT COMMAND INVOCATION   @D1A 07250000
CHSZE    DS    FL1 -     SIZE OF THIS CSCB IN DOUBLE WORDS              07400000
CHSTS    DS    B -       STATUS FLAGS                                   07600000
CHAP     EQU   X'80' -   ASSIGNMENT PENDING                             07800000
CHINFMT  EQU   X'40' -   CSCB IN PRE-INTERPRETATION (INPUT) FORMAT     *08000000
                                                               @ZMB0266 08050000
CHSOUT   EQU   X'20' -   CANCEL ALL SYSOUT                              08200000
CHQSPC   EQU   X'10' -   INSUFFICIENT QSPACE CAUSING ABEND 422          08400000
CHAD     EQU   X'08' -   ADD THIS CSCB TO CHAIN                         08600000
CHDL     EQU   X'04' -   DELETE THIS CSCB FROM CHAIN                    08800000
CHFC     EQU   X'02' -   FREE THIS CSCB'S CORE                          09000000
CHABTERM EQU   X'01' -   EXECUTE BRANCH ENTRY TO ABTERM                 09200000
CHACT    DS    B -       FLAGS INDICATING ACTIVITY INVOLVED             09400000
CHSWAP   EQU   X'80' -   SWAPPABLE JOB                                  09600000
CHTERM   EQU   X'40' -   TERMINAL JOB                                   09800000
CHDISC   EQU   X'20' -   CANCEL IMPLIES DISCONNECT                      09810000
CHDSI    EQU   X'10' -   ON MEANS NO DATA SET INTEGRITY (OS/VS1) MDC045 10200000
CHCL     EQU   X'08' -   CANCELABLE JOB STEP                            10400000
CHCLD    EQU   X'04' -   CANCEL COMMUNICATION SWITCH                    10600000
CHAIFX   EQU   X'02' -   CANCELABLE (OS/VS1)                            10800000
CHPOSTSS EQU   X'02' -   POST EARLY ADDRESS SPACE    (MDC313)  @G38EP2L 10850000
CHIFY    EQU   X'01' -   SYSTEM ASSIGNED PROCEDURE (OS/VS1)             10900000
CHAFORCE EQU   X'01' -   CANCEL ISSUED FOR THIS CSCB (FORCE COMMAND    *10920000
                         CAN BE ACCEPTED) (OS/VS2)  (MDC301)   @G17FP9A 10970000
CHPARM   DS    0A -      POINTER TO PARAMETER LIST USED FOR             11050000
*                        COMMUNICATION BETWEEN SVC 34 COMMANDS AND      11100000
*                        MASTER SCHEDULER TASK (OS/VS1)          MDC040 11150000
CHPCOI   EQU   X'80' -   SUBSYSTEM COMMAND INDICATOR  (MDC300) @X60BE9A 11155000
CHKEY    DS    CL8 -     1. ID OF A STARTED TASK                        11200000
*                        (THIS ID IS THE TASK'S STEPNAME)               11400000
*                        2. JOBNAME OF AN EXECUTED JOB.                 11600000
*                        3. Name of the ATX.                       @L9A 11650000
CHCLS    DS    CL8 -     1.PROCNAME OF A STARTED TASK                   11800000
*                        (THE PROCNAME IS THE TASK'S JOBNAME.)          12000000
*                        2. JOBNAME OF AN EXECUTED JOB (SAME AS CHKEY)  12200000
CHUNIT   DS    CL3 -     UNITNAME (Set for started tasks only)     @PDC 12250000
*                        This field is not valid for 4-digit       @PDC 12300000
*                        device numbers. Use CHUNIT4 instead.      @PDC 12350000
CHCIBCTR DS    FL1 -     MAXIMAL NUMBER OF QUEUED CIB'S                 12600000
CHPKE    DS    0CL1 -    PROTECT KEY (OS/VS1)                    ICB345 12650000
CHTRKID  DS    CL1 -     DISPLAY/TRACK IDENTIFIER (OS/VS2)       MDC014 12700000
CHTSID   EQU   X'01' -   TIME SHARING USER IDENTIFIER            MDC015 12750000
CHJOBID  EQU   X'02' -   JOB IDENTIFIER                          MDC016 12800000
CHINITID EQU   X'03' -   INITIATOR IDENTIFIER                    MDC017 12850000
CHSASID  EQU   X'04' -   SYSTEM ADDRESS SPACE IDENTIFIER               *12900000
                                                      (MDC313) @G38EP2L 12950000
CHATXPID EQU   X'05' -   ATX ADDRESS SPACE IDENTIFIER              @L9A 12966600
CHATXID  EQU   X'05' -   ATX ADDRESS SPACE IDENTIFIER              @L9A 12983200
CHUCMP   DS    CL1 -     UCMI (UNIT CONTROL MODULE INDICATOR)           13000000
*                        THIS IS THE ID OF THE CONSOLE WHICH            13200000
*                        ISSUED THE COMMAND,                            13400000
*                        OR FOR OS/VS2, X'80' FOR A VARY COMMAND        13450000
*                        ISSUED IN THE INPUT STREAM              MDC046 13500000
CHTJID   DS    0H -      TERMINAL ID (OS/VS1)                           13600000
CHASID   DS    H -       ADDRESS SPACE ID (ASID) (OS/VS2)        MDC018 13610000
CHPROCSN DS    0CL8 -    PROCEDURE STEP NAME (OS/VS2)  (MDC049)  YM6960 13630000
CHQID    DS    H -       QID OF REMOTE USER (OS/VS1)             ICB384 13650000
CHRES    DS    FL1 -     RESERVED (WAS CHVERSN)                    @L7C 13700000
CHSP13   EQU   1         VERSION LEVEL OS/VS2 JBB1326              @L1A 13712500
CHSP41   EQU   2         VERSION LEVEL HBB4410                     @P9C 13723100
CHSP42   EQU   3         VERSION LEVEL HBB4420                     @L9A 13729400
CHSP44   EQU   4         VERSION LEVEL HBB5510                     @LBA 13734100
CHROALL  EQU   5         VERSION LEVEL WITH OW15497                @02A 13737600
CHVERID  EQU   CHROALL   VERSION LEVEL - UPDATED FOR SIZE OR           *13741100
                         INCOMPATIBLE CHANGE                       @02C 13744600
CHACT1   DS    B -       COMMAND DEPENDENT FLAG BYTE                   *13748300
                         (SEE END OF LISTING)                      @D2C 13759100
CHRTOKIN DS    CL4 -         31 BIT RIGHT JUSTIFIED TOKEN              *13770000
                                                     (MDC313)  @G380P2N 13785000
*                                                                       13800000
*              END OF MAPPING COMMON                                    14000000
*              TO CONTROL AND INPUT CSCB FORMATS                        14200000
*                                                                       14400000
CHASM    EQU   *                                                        14600000
*                        BEGINNING OF OVERLAY SEGMENT                   14800000
*                                                                       15000000
*              BEGINNING OF MAPPING UNIQUE                              15200000
*              TO CONTROL FORMAT CSCB AFTER                             15400000
*              INTERPRETATION OF COMMAND OPERANDS                       15600000
*                                                                       15800000
CHRES1   DS    A -       RESERVED (WAS POINTER TO STOP/MODIFY ECB) @L8C 15850000
CHRES2   DS    A -       RESERVED (WAS POINTER TO CIB)             @L8C 15900000
CHRES0   DS    A -       RESERVED (WAS CHRTOKEN)                   @L8C 15950000
*                                                                  @L7A 16000000
CHRGNAD  DS    F -       STARTING ADDRESS OF REGION IF V=R              18000000
*                        (OS/VS2)                                MDC002 18050000
CHRES3   DS    F -       RESERVED (WAS STOP/MODIFY ECB)            @L8C 18200000
CHCECB   DS    F -       CANCEL ECB                                     18400000
CHSTEP   DS    0CL8 -    STEP NAME (OS/VS2)  (MDC050)            YM6960 18600000
CHSWT    DS    B -       COMMUNICATIONS SWITCHES (OS/VS1)               19800000
CHARSV20 EQU   X'80',,C'X' RESERVED                                     20000000
CHJCT    EQU   X'40' -   READER RETURN WITH IN-CORE JCT                 20200000
CHPSD    EQU   X'20' -   WRITER PAUSE DATASET                           20400000
CHPSF    EQU   X'10' -   WRITER PAUSE FORMS                             20600000
CHAC     EQU   X'08' -   ID SPECIFIED ON S COMMAND                      20800000
CHARSV21 EQU   X'04',,C'X' RESERVED                                     20850000
CHARSV22 EQU   X'02',,C'X' RESERVED                                     20900000
CHARSV23 EQU   X'01',,C'X' RESERVED                                     20950000
CHTCB    DS    AL3 -     TCB POINTER (OS/VS1)                           21600000
CHSPB    DS    A -       TCB PTR FOR ABTERM (OS/VS1)                    21660000
CHRGNSZ  DS    F -       JOB REGION SIZE IF V=R (OS/VS2)               *21668500
                                                 (MDC314)      @ZM50188 21677000
CHARSV40 DS    0F -      RESERVED AFTER IEFSD161 (MDC314)      @ZM50188 21685500
CHJCL    DS    A -       JCLS PTR --                                   *21694000
                         IN-CORE JCT PTR -- DA JCT TTR,                *21702500
                                                 (MDC314)      @ZM50188 21711000
*                                                                       21720000
CHRES4   DS    CL4       RESERVED (WAS CHCSIDSH)                   @L7C 21770000
CHRES8   DS    XL4       RESERVED (WAS CHCMFLSH)                   @L7C 21820000
*                                                                       22080000
         DS    7F -      RESERVED                                  @L1C 22130000
CHSQA    DS    9F -      SYSOUT Q MANAGER PARAMETER AREA                23400000
*                                                                       23600000
* NOTE--THIS QMPA EXISTS IN OS/VS2 CSCB'S ONLY BEFORE INITIATOR    @L1C 23800000
* JOB SELECT TIME.                                                      24000000
*                                                                       24200000
         DS    F -       TENTH WORD OF CHSQA (OS/VS1)                   24250000
*                        RESERVED (OS/VS2)                MDC022,MDC023 24300000
         DS    F -       ELEVENTH WORD OF CHSQA (OS/VS1)                24350000
*                        RESERVED (OS/VS2)                MDC022,MDC024 24360000
CHUSCVS  DS    F -       TIOT LENGTH (OS/VS1)                    MDC025 24400000
CHJSCBVS DS    A -       POINTER TO JSCB (OS/VS1)                MDC026 24600000
CHSAVWD1 DS    A -       START CMD. TEMP. S/A 1  (MDC311)      @ZA29618 24900000
CHSAVWD2 DS    F -       RESERVED                (MDC314)      @ZM50188 24949900
CHJBFLGS DS    B -       FLAGS FOR STARTED JOBS                    @D3A 24955400
CHJBSTRT EQU   X'80'     JOBNAME= WAS SPECIFIED ON START COMMAND   @D3A 24960900
CHISJOB  EQU   X'40'     MEMBER BEING STARTED WAS A JOB            @LEA 24966400
CHJBRSV1 EQU   X'3F'     RESERVED                                  @LEC 24971900
         DS    CL3 -     RESERVED                                  @D3C 24977400
         DS    XL4 -     SAME AS FIELD CHCMFLGS                    @L1A 24983100
CHRESG   DS    CL40 -    USED TO RETURN THE PROPER LENGTH          @D3A 24986400
CHMEMNAM DS    CL8  -    MEMBER NAME SPECIFIED WITH JOBNAME=       @D3A 24989700
CHRESF   DS    CL4  -    USED TO RETURN THE PROPER LENGTH          @D3C 24993000
         DS    CL4  -    DO NOT USE - MAPS CHUNIT4                 @D3A 24996300
         DS    CL4  -    DO NOT USE - MAPS CHSTTXTA                @LFA 24997500
CHRESH   DS    CL12 -    RESERVED                                  @LFA 24998700
*                                                                       25000000
*              END OF MAPPING UNIQUE                                    25200000
*              TO CONTROL FORMAT CSCB AFTER                             25400000
*              INTERPRETATION OF COMMAND OPERANDS                       25600000
*                                                                       25800000
         ORG   CHASM -   OVERLAY                                        26000000
*                                                                       26200000
*              BEGINNING OF MAPPING UNIQUE                              26400000
*              TO INPUT FORMAT CSCB BEFORE                              26600000
*              INTERPRETATION OF COMMAND OPERANDS                       26800000
*                                                                       27000000
         DS    0F                                                  @L2A 27050000
CHBUF    DS    0CL124 -  COMMAND IMAGE (OPERAND FIELD)             @L2C 27100000
CHLOGOPS DS    A     -   POINTER TO MCS LOGON OPERANDS             @L2A 27150000
         DS    CL120                                               @L2A 27200000
CHTYPE   DS    B -       FLAGS                                          27250000
CHDSTAT  EQU   X'80' -   STATUS DISPLAY (SVC 104) CMD                   27300000
CHARSV25 EQU   X'40',,C'X' RESERVED                                     27310000
CHARSV26 EQU   X'20',,C'X' RESERVED                                     27320000
CHARSV27 EQU   X'10',,C'X' RESERVED                                     27330000
CHARSV28 EQU   X'08',,C'X' RESERVED                                     27340000
CHARSV29 EQU   X'04',,C'X' RESERVED                                     27342000
CHHIAR   EQU   X'02' -   ON MEANS H1 SPECIFIED ON COMMAND (ICB337)40890 27350000
CHDEF    EQU   X'01' -   ON MEANS DEFAULT TO H0 (ICB337)          40890 27400000
CHARSV31 DS    B -       Reserved                                  @L9C 27450000
CHCNID   DS    C -       DISPLAY-RECEIVING CONSOLE ID                   27660000
CHARID   DS    C -       DISPLAY SCREEN-AREA ID                         27680000
CHPEND   DS    A -       CHAIN PTR FOR PENDING START COMMANDS (OS/VS1)  27700000
         ORG   CHTYPE                                          @G38EP2L 27720000
CHRIMWT  DS    A -       ECB FOR NIP RIM TO WAIT ON            @G38EP2L 27740000
CHASWT   DS    A -       ECB FOR INITIALIZATION TO WAIT ON     @G38EP2L 27760000
CHINC    DS    H -       UNIQUE CTR FOR INTERPRETER                     27800000
*                        OR FOR OS/VS2, COMMAND AUTHORITY FOR VARY      27850000
*                        COMMAND ISSUED FROM THE INPUT STREAM    MDC047 27900000
CHCSYSO  DS    BL1 -     EXPRESS CANCEL SYSOUT (OS/VS1)                 28000000
CHALL    EQU   X'80' -   ALL SPECIFIED                                  28200000
CHINN    EQU   X'40' -   IN SPECIFIED                                   28400000
CHOUT    EQU   X'20' -   OUT SPECIFIED                                  28600000
CHHOLD   EQU   X'10' -   HOLD Q SPECIFIED                               28800000
CHQUE    EQU   X'08' -   SPECIFIC QUEUE                                 29000000
CHDUMP   EQU   X'04' -   DUMP SPECIFIED                                 29200000
CHJB     EQU   X'02' -   END SCAN SWITCH                                29400000
CHUSERID EQU   X'01' -   INDICATES 'USER=' SPECIFIED ON CANCEL          29600000
*                        COMMAND (OS/VS1)                        ICB396 29650000
CHSPA    DS    CL1 -     OS/VS1 SYSTEM TASK CONTROL SWITCHES            29850000
CHRES5   DS    CL4 -     RESERVED (WAS CHCSCBID)                   @L7C 29861200
*                                                                  @L1A 29872400
*        THE FOLLOWING FIELDS ARE COPIED DIRECTLY FROM             @L1A 29883600
*        THE SVC 34 XSA. THE FIELD NAMES ARE IDENTICAL             @L1A 29894800
*        EXCEPT FOR THE FIRST TWO CHARACTERS WHICH ARE             @L1A 29906000
*        XA IN THE XSA (MAPPED BY MACRO IEEXSA).                   @L1A 29917200
*                                                                  @L1A 29928400
CHCMFLGS DS    0XL4 -    COPY OF SVC 34 COMMAND FLAGS              @L1A 29939600
CHCMFLGA DS    0XL2 -    SEE XSA FOR DESCRIPTION                   @L1A 29950800
CHCMFLG1 DS    XL1 -     SEE XSA FOR DESCRIPTION                   @L1A 29962000
CHCMFL11 EQU   X'80' -   SEE XSA FOR DESCRIPTION                   @L1A 29973200
CHCMFL12 EQU   X'40' -   SEE XSA FOR DESCRIPTION                   @L1A 29984400
CHCMFL13 EQU   X'20' -   SEE XSA FOR DESCRIPTION                   @L1A 29995600
CHCMFL14 EQU   X'10' -   SEE XSA FOR DESCRIPTION                   @L1A 30006800
CHCMFL15 EQU   X'08' -   SEE XSA FOR DESCRIPTION                   @L1A 30018000
CHCMFL16 EQU   X'04' -   SEE XSA FOR DESCRIPTION                   @L1A 30029200
CHCMFL17 EQU   X'02' -   SEE XSA FOR DESCRIPTION                   @L1A 30040400
CHCMFL18 EQU   X'01' -   SEE XSA FOR DESCRIPTION                   @L1A 30051600
CHCMFLG2 DS    XL1 -     SEE XSA FOR DESCRIPTION                   @L1A 30062800
CHCMFL21 EQU   X'80' -   SEE XSA FOR DESCRIPTION                   @L1A 30074000
CHCMFL22 EQU   X'40' -   SEE XSA FOR DESCRIPTION                   @L1A 30085200
CHCMFL23 EQU   X'20' -   SEE XSA FOR DESCRIPTION                   @L1A 30096400
CHCMFL24 EQU   X'10' -   SEE XSA FOR DESCRIPTION                   @L1A 30107600
CHCMFL25 EQU   X'08' -   SEE XSA FOR DESCRIPTION                   @L1A 30118800
CHCMFL26 EQU   X'04' -   SEE XSA FOR DESCRIPTION                   @L1A 30130000
CHCMFL27 EQU   X'02' -   SEE XSA FOR DESCRIPTION                   @L1A 30141200
CHCMFL28 EQU   X'01' -   SEE XSA FOR DESCRIPTION                   @L1A 30152400
CHCMFLGB DS    0XL2 -    SEE XSA FOR DESCRIPTION                   @L1A 30163600
CHCMFLG3 DS    XL1 -     SEE XSA FOR DESCRIPTION                   @L1A 30174800
CHCMFLG4 DS    XL1 -     SEE XSA FOR DESCRIPTION                   @L1A 30186000
CHCMFL44 EQU   X'10' -   SEE XSA FOR DESCRIPTION                   @01A 30186100
CHRTDM   EQU   X'10' -   SEE XSA FOR DESCRIPTION                   @01A 30186200
CHNOBY   EQU   X'02' -   SEE XSA FOR DESCRIPTION                   @03A 30186300
*********************************************************************** 30186400
*        THE CHAUTH FIELD MUST BE EXACTLY MAPPED BY THE XAAUTH     @L2A 30186800
*        FIELD IN THE XSA (IEEXSA).                                @L2A 30187200
*********************************************************************** 30187600
CHAUTH   DS    0BL2 -    COMMAND AUTHORITY LEVEL                   @L2A 30188000
CHAUTHA  DS    X     -   1ST BYTE OF COMMAND CODE AUTH FLAGS       @L2A 30188400
CHAUTH1  EQU   X'80' -   COMMAND HAS SYS AUTHORITY                 @L2A 30188800
CHAUTH2  EQU   X'40' -   COMMAND HAS I/O AUTHORITY                 @L2A 30189200
CHAUTH3  EQU   X'20' -   COMMAND HAS CONS AUTHORITY                @L2A 30189600
CHARES1  EQU   X'1F' -   RESERVED                                  @L2A 30190000
CHAUTHB  DS    X     -   2ND BYTE OF COMMAND CODE AUTH FLAGS       @L2A 30190400
*********************************************************************** 30190800
*        THE CHDISP FIELD MUST BE EXACTLY MAPPED BY THE XADISP     @L2A 30191200
*        FIELD IN THE XSA (IEEXSA).                                @L2A 30191600
*********************************************************************** 30192000
CHDISP   DS    B     -   COMMAND DISPOSITION                       @L2A 30192400
CHDISPA  EQU   X'80' -   COMMAND HAS MASTER AUTHORITY              @L2A 30192800
CHDISPM  EQU   X'40' -   COMMAND HAS PSEUDO MASTER AUTHORITY       @L2A 30193200
CHDISPC  EQU   X'20' -   COMMAND ISSUED FROM MCS CONSOLE           @L3A 30193600
CHDISPR  EQU   X'10' -   COMMAND ISSUED BEFORE RACF ACTIVE         @L3A 30194000
CHDISPE  EQU   X'08' -   COMMAND ISSUED BY ARM                     @LGA 30194200
CHARES2  EQU   X'07' -   RESERVED                                  @LGC 30194400
CHFLGS   DS    B -       FLAGS                                     @P2C 30194600
CHPMSI   EQU   X'80' -   Command issued before MSI was complete    @05A 30194800
CHBIGRP  EQU   X'40' -   BYPASS INITIATOR GET REGION PROCESSING    @P6M 30195000
CHNOALC  EQU   X'20' -   Bypass setup of Allocation Environment    @PBA 30195100
CHUTOK   DS    A         POINTER TO COMMAND ISSUER UTOKEN          @L2A 30195200
CHCNSIDT DS    XL4       TARGET CONSOLE ID                         @L6C 30195600
CHCNSIDI DS    XL4       ISSUING CONSOLE ID                        @L6C 30196000
CHCART   DS    XL8       COMMAND AND RESPONSE TOKEN (CART)         @L5A 30196400
CHRSV1   DS    XL1       RESERVED                                  @P6C 30197000
CHVERSN  DS    FL1 -     CSCB VERSION ID                           @L7A 30197600
CHRES7   DS    CL2 -     RESERVED                                  @L7A 30198000
CHPREVP  DS    A -       PREVIOUS CSCB POINTER                     @L7A 30198400
CHCSCBID DS    CL4 -     CSCB ACRONYM                              @L7A 30198800
CHCSCXP  DS    A -       POINTER TO CSCX                           @L8C 30199200
CHDITOKN DS    A -       CALLERS TOKEN FOR DIRECT CMD INVOCATION   @P7A 30199400
CHOCID   DS    XL4       ORIGINATING CONSOLE ID                    @02A 30199500
CHRSV2   DS    CL4 -     RESERVED                                  @02C 30199600
CHUNIT4  DS    CL4 -     UNITNAME (SET FOR STARTED TASKS ONLY)     @LCC 30199700
CHSTTXTA DS    A -       POINTER TO SCTS(IEEZB884)                 @LFA 30199800
CHRESV   DS    CL12      RESERVED                                  @LHC 30199900
*                                                                       30200000
*              END OF MAPPING UNIQUE                                    30400000
*              TO INPUT FORMAT CSCB BEFORE                              30600000
*              INTERPRETATION OF COMMAND OPERANDS                       30800000
*                                                                       31000000
CHLAST   EQU   *                                                        31200000
         EJECT                                                     @D2A 31208600
****************************************************************** @D2A 31217200
*                                                                * @D2A 31225800
*   BIT DEFINITIONS FOR COMMAND DEPENDENT FLAG BYTE (CHACT1)     * @D2A 31234400
*                                                                * @D2A 31243000
****************************************************************** @D2A 31251600
         SPACE ,                                                   @D2A 31260200
****************************************************************** @D2A 31268800
*                                                                * @D2A 31277400
*   BITS FOR VARY ONLINE, OFFLINE, AND CONSOLE                   * @D2A 31286000
*                                                                * @D2A 31294600
****************************************************************** @D2A 31303200
CHVDIENQ EQU   X'80' -   PERFORM ENQS AND DEQ ON DIRECT INVOCATION     *31311800
                         OF VARY  (VALID ONLY IF CHVCD=0)          @D2A 31320400
CHVSUNPM EQU   X'40' -   SUPPRESS 'NO PATHS' MESSAGE               @D2A 31329000
CHSMSVL  EQU   X'20' -   VARY FOR SMS LIBRARY                      @LAC 31337600
CHVRSV2  EQU   X'10' -   RESERVED                                  @D2A 31346200
CHVRSV3  EQU   X'08' -   RESERVED                                  @D2A 31354800
CHVRSV4  EQU   X'04' -   RESERVED                                  @D2A 31363400
CHVRSV5  EQU   X'02' -   RESERVED                                  @D2A 31372000
CHVRSV6  EQU   X'01' -   RESERVED                                  @D2A 31380600
         SPACE 2                                                   @D2A 31389200
*                        END OF CSCB                                    31400000
* IF INVOKED WITH INCCSCX=NO, THEN DON'T PROVIDE A CSCX DSECT      @L8A 31427500
*                                                                       31455000
         AIF    ('&INCCSCX' EQ 'NO').NOCSCX                        @L7A 31482500
*                                                                       31510000
* CSCX DSECT                                                       @L7A 31537500
*                                                                  @L7A 31565000
CSCX DSECT                                                         @L7A 31592500
*                                                                  @L7A 31620000
CHCSCXID DS    CL4 -     CSCX ACRONYM                              @L7A 31647500
CHXVERSN DS    FL1 -     VERSION LEVEL                             @L7A 31675000
CHXRES   DS    CL3 -     RESERVED                                  @L7A 31702500
CHECBP   DS    A -       POINTER TO STOP/MODIFY ECB                @L8C 31730000
CHCIBP   DS    A -       POINTER TO CIB                            @L8C 31757500
CHRTOKEN DS    CL4 -         31 BIT RIGHT JUSTIFIED TOKEN          @L8C 31785000
CHRTOKHR EQU   X'80' -       BIT = 1 INDICATES TOKEN EXISTS        @L8C 31812500
*                                                                  @L7A 31840000
*              THE ABOVE ECB AND CIB POINTERS AND TOKEN FORM       @L7A 31867500
*              THE COMMUNICATIONS PARAMETER LIST MAPPED BY IEZCOM  @L7A 31895000
*                                                                  @L7A 31922500
CHECB    DS    F -       STOP/MODIFY ECB                           @L8C 31950000
CHNAME   DS    CL8 -     JOBNAME or ATXname of a TP initiated by APPC  *31977500
                                                                   @L9C 32005000
CHCSCBP  DS    A -       ADDRESS OF CSCB                           @L7A 32032500
CXSP41   EQU   1         VERSION LEVEL HBB4410                     @L7A 32060000
CXVERID  EQU   CXSP41    VERSION LEVEL - UPDATED FOR SIZE OR           *32087500
                         INCOMPATIBLE CHANGE                       @L7C 32115000
.NOCSCX  ANOP                                                           32142500
*                                                                  @L7A 32170000
         MEND  , */                                                     32200000
* %CHL2   :  ;                                                          32400000
*                                                                       32600000
* %IF IEECHAIN_BASE = '' %THEN                                          33600000
*    %IEECHAIN_BASE = 'BASED(CSCBPTR)';                                 34600000
* DECLARE                                                               37400000
*   1 CHAIN    IEECHAIN_BASE BDY(WORD),                                 37799990
*    2 CHPTR       PTR(31),          /* CHAIN PTR TO NEXT CSCB       */ 38000000
*    2 CHFLG       CHAR(4) BDY(WORD),/* FOUR BYTES                   */ 38200000
*     3 CHVCD       CHAR(1),         /* COMMAND VERB CODE - FOR DIRECT  38250000
*                                       COMMAND INVOCATION SEE          38300000
*                                       CHDIRINV                 @D1C*/ 38350000
*     3 CHSZE       PTR(8),          /* SIZE OF THIS CSCB IN DOUBLE     38600000
*                                       WORDS                        */ 38800000
*     3 CHSTS       CHAR(1),         /* STATUS FLAGS                 */ 39000000
*      4 CHAP     BIT(1),            /* ASSIGNMENT PENDING           */ 39200000
*      4 CHINFMT  BIT(1),            /* CSCB IN PRE-INTERPRETATION      39400000
*                                       (INPUT) FORMAT       @ZMB0266*/ 39450000
*      4 CHSOUT   BIT(1),            /* CANCEL ALL SYSOUT            */ 39600000
*      4 CHQSPC   BIT(1),            /* INSUFFICIENT Q SPACE FOR 422    39800000
*                                       ABEND                        */ 40000000
*      4 CHAD     BIT(1),            /* ADD THIS CSCB TO CHAIN       */ 40200000
*      4 CHDL     BIT(1),            /* DELETE THIS CSCB FROM CHAIN  */ 40400000
*      4 CHFC     BIT(1),            /* FREE THIS CSCB'S CORE        */ 40600000
*      4 CHABTERM BIT(1),            /* EXECUTE BRANCH ENTRY TO         40800000
*                                       ABTERM                       */ 41000000
*     3 CHACT       CHAR(1),         /* FLAGS INDICATING ACTIVITY       41200000
*                                       INVOLVED                     */ 41400000
*      4 CHSWAP   BIT(1),            /* SWAPPABLE JOB                */ 41600000
*      4 CHTERM   BIT(1),            /* TERMINAL JOB                 */ 41800000
*      4 CHDISC   BIT(1),            /* CANCEL IMPLIES DISCONNECT    */ 42000000
*      4 CHDSI    BIT(1),            /* ON MEANS NO DATA SET            42200000
*                                       INTEGRITY (OS/VS1)     MDC045*/ 42400000
*      4 CHCL     BIT(1),            /* CANCELABLE JOB STEP          */ 42600000
*      4 CHCLD    BIT(1),            /* CANCEL COMMUNICATION SWITCH  */ 42800000
*      4 CHAIFX   BIT(1),            /* CANCELABLE (OS/VS1)          */ 43000000
*       5 CHPOSTSS BIT(1),           /* POST EARLY ADDRESS SPACE        43050000
*                                                   (MDC313) @G38EP2L*/ 43100000
*      4 CHIFY    BIT(1),            /* SYSTEM ASSIGNED                 43200000
*                                       PROCEDURE (OS/VS1)           */ 43400000
*       5 CHAFORCE BIT(1),           /* CANCEL ISSUED FOR THIS CSCB     43420000
*                                       (FORCE COMMAND CAN BE           43480000
*                                       ACCEPTED) (OS/VS2)              43520000
*                                       (MDC301)             @G17FP9A*/ 43540000
*    2 CHKEY       CHAR(8) BDY(WORD),/* 1. ID OF A STARTED TASK         43600000
*                                       (THIS ID IS THE TASK'S          43800000
*                                       STEPNAME)  2. JOBNAME OF AN     44000000
*                                       EXECUTED JOB.                   44050000
*                                       3. Name of the ATX       @L9C*/ 44100000
*     3 CHPARM      PTR(31),         /* POINTER TO PARAMETER LIST       44250000
*                                       USED FOR COMMUNICATION          44300000
*                                       BETWEEN SVC 34 COMMANDS AND     44350000
*                                       MASTER SCHEDULER TASK           44360000
*                                       (OS/VS1)               MDC040*/ 44370000
*      4 CHPCOI   BIT(1),            /* SUBSYSTEM COMMAND INDICATOR     44373000
*                                       (MDC300)             @X60BE9A*/ 44376000
*    2 CHCLS       CHAR(8) BDY(WORD),/* 1.PROCNAME OF A STARTED TASK    44400000
*                                       (THE PROCNAME IS THE TASK'S     44600000
*                                       JOBNAME.)  2. JOBNAME OF AN     44800000
*                                       EXECUTED JOB (SAME AS CHKEY) */ 45000000
*    2 CHUNIT      CHAR(3) BDY(WORD),/* UNITNAME (set for started       45050000
*                                       tasks only) This field is       45100000
*                                       not valid for 4-digit device    45150000
*                                       numbers. Use CHUNIT4 instead    45200000
*                                                                @PDC*/ 45250000
*    2 CHCIBCTR    PTR(8),           /* MAXIMAL NUMBER OF QUEUED        45600000
*                                       CIB'S                        */ 45800000
*    2 CHPKE       CHAR(1) BDY(WORD),/* PROTECT KEY (0S/VS1)   ICB345*/ 45850000
*     3 CHTRKID     CHAR(1),         /* DISPLAY/TRACK IDENTIFIER        45900000
*                                       (OS/VS2)               MDC014*/ 45950000
*%IF IEECHAIN_CONST ~= '' %THEN %GOTO CHA10A;                           45970000
*%CHTSID='''01''X';                  /* TIME SHARING USER IDENTIFIER    46000000
*                                                              MDC015*/ 46010000
*%CHJOBID='''02''X';                 /* JOB IDENTIFIER         MDC016*/ 46050000
*%CHINITID='''03''X';                /* INITIATOR IDENTIFIER   MDC017*/ 46100000
*%CHSASID='''04''X';                 /* SYSTEM ADDRESS SPACE            46130000
*                                       IDENTIFIER           @G38EP2L*/ 46160000
*%CHATXPID='''05''X';                /* ATX ADDRESS SPACE IDENTIFIER    46168000
*                                                                @L9A*/ 46176000
*%CHATXID='''05''X';                 /* ATX ADDRESS SPACE IDENTIFIER    46184000
*                                                                @L9A*/ 46192000
*%CHA10A:;                                                              46196000
*    2 CHUCMP      CHAR(1),          /* UCMI (UNIT CONTROL MODULE       46200000
*                                       INDICATOR)  THIS IS THE ID      46400000
*                                       OF THE CONSOLE WHICH  ISSUED    46600000
*                                       THE COMMAND,                    46800000
*                                       OR FOR OS/VS2, X'80' FOR A      46850000
*                                       VARY COMMAND ISSUED IN THE      46900000
*                                       INPUT STREAM           MDC046*/ 46950000
*    2 CHTJID      FIXED(15),        /* TERMINAL ID (OS/VS1)         */ 47000000
*     3 CHASID      FIXED(15),       /* ADDRESS SPACE ID (ASID)         47010000
*                                       (OS/VS2)               MDC018*/ 47020000
*    2 CHPROCSN    CHAR(8) BDY(WORD),/* PROCEDURE STEP NAME (OS/VS2)    47030000
*                                       (MDC049)               YM6960*/ 47040000
*     3 CHQID       FIXED(15),       /* QID OF REMOTE USER              47050000
*                                       (OS/VS1)               ICB384*/ 47060000
*     3 CHRES       FIXED(8),        /* RESERVED (WAS CHVERSN)   @L7C*/ 47100000
*     3 CHACT1      BIT(8),          /* COMMAND DEPENDENT FLAG BYTE     47129000
*                                       (SEE END OF LISTING)     @D2C*/ 47158000
*     3 CHRTOKIN CHAR(4),            /* 31 BIT RIGHT JUSTIFIED TOKEN    47187000
*                                                  (MDC313)  @G380P2N*/ 47191000
*                                                                       47200000
*    2 CHASM  BDY(WORD),                                                47400000
* /*                     BEGINNING OF OVERLAY SEGMENT                */ 47600000
*                                                                       47800000
* /*           BEGINNING OF CONTROL FORMAT MAPPING AFTER             */ 48000000
* /*           INTERPRETATION OF COMMAND OPERANDS                    */ 48200000
*                                                                       48400000
*     3 CHRES1      PTR(31),         /* RESERVED (WAS POINTER TO STOP   48450000
                                        MODIFY ECB)              @L8C*/ 48500000
*     3 CHRES2      PTR(31),         /* RESERVED (WAS CIB PTR)   @L8C*/ 48550000
*     3 CHRES0      PTR(31),         /* RESERVED (WAS CHRTOKEN)  @L8C*/ 48600000
*     3 CHRGNAD     PTR(31),         /* STARTING ADDRESS OF REGION      52400000
*                                       IF V=R (OS/VS2)        MDC002*/ 52450000
*     3 CHRES3      FIXED(31),       /* RESERVED (WAS STOP/MODIFY ECB)  52500000
                                                                 @L8C*/ 52550000
*     3 CHCECB      FIXED(31),       /* CANCEL ECB                   */ 52800000
*     3 CHSTEP      CHAR(8) BDY(WORD),/* STEPNAME (OS/VS2)  (MDC050)    52900000
*                                                              YM6960*/ 53000000
*      4 CHSWT       CHAR(1),        /* COMMUNICATIONS SWITCHES         54200000
*                                       (OS/VS1)                     */ 54300000
*       5 CHARSV20 BIT(1),           /* RESERVED                     */ 54400000
*       5 CHJCT    BIT(1),           /* READER RETURN WITH IN-CORE      54600000
*                                       JCT                          */ 54800000
*       5 CHPSD    BIT(1),           /* WRITER PAUSE DATASET         */ 55000000
*       5 CHPSF    BIT(1),           /* WRITER PAUSE FORMS           */ 55200000
*       5 CHAC     BIT(1),           /* ID SPECIFIED ON S COMMAND    */ 55400000
*       5 CHARSV21 BIT(1),           /* RESERVED                     */ 55600000
*       5 CHARSV22 BIT(1),           /* RESERVED                     */ 55650000
*       5 CHARSV23 BIT(1),           /* RESERVED                     */ 55700000
*      4 CHTCB       PTR(24),        /* TCB PTR (OS/VS1)             */ 56400000
*      4 CHSPB       PTR(31),        /* TCB PTR FOR ABTERM (OS/VS1)  */ 56450000
*     3 CHRGNSZ      FIXED(31),      /* JOB REGION SIZE IF V=R          56456200
*                                       (OS/VS2)    (MDC314) @ZM50188*/ 56462400
*                                                                       56474900
*     3 CHARSV40     FIXED(31),      /* RESERVED AFTER IEFSD161         56487400
*                                                   (MDC314) @ZM50188*/ 56499900
*       4 CHJCL       PTR(31),       /* JCLS PTR -- IN-CORE JCT PTR     56512400
*                                       -- DA JCT TTR                   56524900
*                                                   (MDC314) @ZM50188*/ 56537400
*     3  *  BDY(WORD),               /* PRESERVE DECLARE STRUCTURE      56550000
*                                                                @L1A*/ 56600000
*       4 CHRES4   CHAR(4),          /* RESERVED (WAS CHCSIDSH)  @L7C*/ 56650000
*       4 CHRES8   BIT(32),          /* RESERVED (WAS CHCMFLSH)  @L7C*/ 56700000
*       4 *       BDY(WORD),         /*                       @L7C*/    56750000
*        5 *    CHAR(28),            /* RESERVED                 @L1A*/ 57050000
*      4 CHSQA    (9) FIXED(31),     /* SYSOUT Q MANAGER PARAMETER      58600000
*                                       AREA  NOTE--THIS QMPA EXISTS    58800000
*                                       IN OS/VS2 CSCB'S ONLY BEFORE    59000000
*                                       INITIATOR JOB SELECT TIME.      59200000
*                                                                @L1C*/ 59400000
*      4 *           FIXED(31),      /* TENTH WORD OF CHSQA (OS/VS1)    59450000
*                                       RESERVED (OS/VS2)               59500000
*                                                       MDC022,MDC023*/ 59550000
*      4 *           FIXED(31),      /* ELEVENTH WORD OF CHSQA          59600000
*                                       (OS/VS1) RESERVED (OS/VS2)      59650000
*                                                       MDC022,MDC024*/ 59700000
*      4 CHUSCVS     FIXED(31),      /* TIOT LENGTH (OS/VS1)   MDC025*/ 59800000
*      4 CHJSCBVS    PTR(31),        /* JSCB POINTER (OS/VS1)  MDC026*/ 60000000
*      4 CHSAVWD1    PTR(31),        /* START CMD. TEMP. S/A 1          60300000
*                                       (MDC311)             @ZA29618*/ 60333300
*      4 CHSAVWD2    FIXED(31),      /* RESERVED   (MDC314)  @ZM50188*/ 60366600
*      4 CHJBFLGS    BIT(8),         /* FLAGS FOR STARTED JOBS   @D3A*/ 60369000
*        5 CHJBSTRT    BIT(1),       /* JOBNAME= WAS SPECIFIED ON START 60371400
*                                       COMMAND                  @D3A*/ 60373800
*        5 CHISJOB     BIT(1),       /* MEMBER BEING STARTED WAS A JOB  60376200
*                                                                @LEA*/ 60378600
*        5 CHJBRSV1    BIT(6),       /* RESERVED                 @LEC*/ 60381000
*      4 *           CHAR(3),        /* RESERVED                 @D3C*/ 60383400
*      4 *           BIT(32),        /* SAME AS FIELD CHCMFLGS          60386400
*                                                                @L1A*/ 60393000
*  2 CHRESG          CHAR(40),       /* USED TO RETURN PROPER LENGTH    60393700
*                                                                @D3A*/ 60394400
*  2 CHMEMNAM        CHAR(8),        /* MEMBER NAME STARTED WITH        60395100
*                                       JOBNAME=                 @D3A*/ 60395800
*  2 CHRESF          CHAR(4),       /* USED TO RETURN THE PROPER        60396900
*                                 LENGTH FOR THE LENGTH FUNCTION @D3C*/ 60398500
*  2 *               CHAR(4),        /* Do not use - maps chunit4@D3A*/ 60398800
*  2 *               PTR(31),        /* Do not use-maps chsttxta @LFA*/ 60399100
*  2 CHRESH          CHAR(12);       /* Reserved                 @LHC*/ 60399500
*%IF IEECHAIN_CONST = '' %THEN %GOTO CHA10B;                            60399530
*DCL CHTSID CONSTANT(1);             /* TIME SHARING USER IDENTIFIER    60399560
*                                                              MDC015*/ 60399590
*DCL CHJOBID CONSTANT(2);            /* JOB IDENTIFIER         MDC016*/ 60399620
*DCL CHINITID CONSTANT(3);           /* INITIATOR IDENTIFIER   MDC017*/ 60399650
*DCL CHSASID CONSTANT(4);            /* SYSTEM ADDRESS SPACE            60399680
*                                       IDENTIFIER           @G38EP2L*/ 60399710
*DCL CHATXPID CONSTANT(5);           /* ATX ADDRESS SPACE IDENTIFIER    60399740
*                                                                @L9A*/ 60399770
*DCL CHATXID CONSTANT(5);            /* ATX ADDRESS SPACE IDENTIFIER    60399800
*                                                                @L9A*/ 60399830
*%CHA10B:;                                                              60399860
*                                                                       60400000
* /*           END OF CONTROL FORMAT MAPPING AFTER                   */ 60600000
* /*           INTERPRETATION OF COMMAND OPERANDS                    */ 60800000
*                                                                       61000000
* DECLARE 1 CHAINS01                                                    61200000
*%IF IKEPLS='2'  %THEN                                                  61250000
*    %GOTO CHA2;                                                        61300000
*       BASED(ADDR(CHASM)) BDY(WORD), /* OVERLAY                     */ 61400000
*%GOTO CHA3;                                                            61450000
*%CHA2 : ;                                                              61500000
*%IF SYSVERSION ~= '' %THEN %GOTO CHA4;    /*                    @LHA*/ 61525000
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO CHA4;   /*              @LIA*/ 61537500
*       DEF(CHASM) BDY(WORD),                                           61550000
*%GOTO CHA3;                               /*                    @LHA*/ 61552500
*%CHA4 : ;                                 /*                    @LHA*/ 61555000
*       DEF(CHAIN.CHASM) BDY(WORD),        /*                    @LHA*/ 61557500
*%CHA3 : ;                                                              61560000
*                                                                       61600000
* /*           BEGINNING OF INPUT FORMAT MAPPING BEFORE              */ 61800000
* /*           INTERPRETATION OF COMMAND OPERANDS                    */ 62000000
*                                                                       62200000
*    2 CHBUF       CHAR(124) BDY(WORD), /* COMMAND IMAGE (OPERAND       62400000
*                                       FIELD)                       */ 62600000
*      4 CHLOGOPS  PTR(31),          /* POINTER TO MCS LOGON OPERANDS   62616600
*                                                                @L2A*/ 62633200
*    2 CHRIMWT     FIXED(31),        /* ECB FOR NIP RIM TO WAIT ON      62650000
*                                                 (MDC313)   @G38EP2L*/ 62670000
*     3 CHTYPE     CHAR(1) BDY(WORD),/* FLAGS       (MDC313) @G38EP2L*/ 62690000
*      4 CHDSTAT  BIT(1),            /* STATUS DISPLAY (SVC 104) CMD    62710000
*                                                   (MDC313) @G38EP2L*/ 62730000
*      4 CHARSV25 BIT(1),            /* RESERVED    (MDC313) @G38EP2L*/ 62750000
*      4 CHARSV26 BIT(1),            /* RESERVED    (MDC313) @G38EP2L*/ 62770000
*      4 CHARSV27 BIT(1),            /* RESERVED    (MDC313) @G38EP2L*/ 62790000
*      4 CHARSV28 BIT(1),            /* RESERVED    (MDC313) @G38EP2L*/ 62810000
*      4 CHARSV29 BIT(1),            /* RESERVED    (MDC313) @G38EP2L*/ 62830000
*      4 CHHIAR   BIT(1),            /* ON MEANS H1 SPECIFIED ON        62850000
*                                       COMMAND     (MDC313) @G38EP2L*/ 62870000
*      4 CHDEF    BIT(1),            /* ON MEANS DEFAULT TO             62890000
*                                       H0          (MDC313) @G38EP2L*/ 62910000
*     3 CHARSV31    BIT(8),          /* Reserved                 @L9C*/ 62960000
*     3 CHCNID      CHAR(1),         /* DISPLAY-RECEIVING CONSOLE ID    63190000
*                                                   (MDC313) @G38EP2L*/ 63210000
*     3 CHARID      CHAR(1),         /* DISPLAY SCREEN-AREA ID          63230000
*                                                   (MDC313) @G38EP2L*/ 63250000
*    2 CHPEND      PTR(31),          /* CHAIN PTR FOR PENDING START     63270000
*                                       COMMANDS (OS/VS1)            */ 63290000
*     3 CHASWT      FIXED(31),       /* ECB FOR INITIALIZATION TO       63310000
*                                       WAIT ON              @G38EP2L*/ 63330000
*    2 CHINC       PTR(16),          /* UNIQUE CTR FOR INTERPRETER      63400000
*                                       OR FOR OS/VS2, COMMAND          63450000
*                                       AUTHORITY FOR VARY COMMAND      63500000
*                                       ISSUED FROM THE INPUT           63550000
*                                       STREAM                 MDC047*/ 63560000
*    2 CHCSYSO     CHAR(1),          /* EXPRESS CANCEL SYSOUT(OS/VS1)*/ 63600000
*     3 CHALL    BIT(1),             /* ALL SPECIFIED                */ 63800000
*     3 CHINN    BIT(1),             /* IN SPECIFIED                 */ 64000000
*     3 CHOUT    BIT(1),             /* OUT SPECIFIED                */ 64200000
*     3 CHHOLD   BIT(1),             /* HOLD Q SPECIFIED             */ 64400000
*     3 CHQUE    BIT(1),             /* SPECIFIC QUEUE               */ 64600000
*     3 CHDUMP   BIT(1),             /* DUMP SPECIFIED               */ 64800000
*     3 CHJB     BIT(1),             /* END SCAN SWITCH              */ 65000000
*     3 CHUSERID BIT(1),             /* INDICATES 'USER=' SPECIFIED     65200000
*                                       ON CANCEL COMMAND (OS/VS1)      65250000
*                                                              ICB396*/ 65300000
*    2 CHSPA       CHAR(1),          /* OS/VS1 SYSTEM TASK CONTROL      65400000
*                                       SWITCHES                     */ 65600000
*    2 CHRES5      CHAR(4),          /* RESERVED (WAS CHCSCBID)  @L7C*/ 65606200
*                                                                       65612400
*     /* THE FOLLOWING FIELDS ARE COPIED DIRECTLY FROM                  65618600
*        THE SVC 34 XSA. THE FIELD NAMES ARE IDENTICAL                  65624800
*        EXCEPT FOR THE FIRST TWO CHARACTERS WHICH ARE                  65631000
*        XA IN THE XSA (MAPPED BY MACRO IEEXSA).      @L1A*/            65637200
*                                                                       65643400
*    2 CHCMFLGS    BIT(32),          /* COPY OF SVC34 COMMAND FLAGS     65649600
*                                                                @L1A*/ 65655800
*     3 CHCMFLGA   BIT(16),          /* SEE XSA DESCRIPTION      @L1A*/ 65662000
*      4 CHCMFLG1  BIT(8),           /* SEE XSA DESCRIPTION      @L1A*/ 65668200
*       5 CHCMF11  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65674400
*       5 CHCMF12  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65680600
*       5 CHCMF13  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65686800
*       5 CHCMF14  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65693000
*       5 CHCMF15  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65699200
*       5 CHCMF16  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65705400
*       5 CHCMF17  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65711600
*       5 CHCMF18  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65717800
*      4 CHCMFLG2  BIT(8),           /* SEE XSA DESCRIPTION      @L1A*/ 65724000
*       5 CHCMF21  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65730200
*       5 CHCMF22  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65736400
*       5 CHCMF23  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65742600
*       5 CHCMF24  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65748800
*       5 CHCMF25  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65755000
*       5 CHCMF26  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65761200
*       5 CHCMF27  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65767400
*       5 CHCMF28  BIT(1),           /* SEE XSA DESCRIPTION      @L1A*/ 65773600
*     3 CHCMFLGB   BIT(16),          /* SEE XSA DESCRIPTION      @L1A*/ 65779800
*      4 CHCMFLG3  BIT(8),           /* SEE XSA DESCRIPTION      @L1A*/ 65786000
*      4 CHCMFLG4  BIT(8),           /* SEE XSA DESCRIPTION      @L1A*/ 65792200
*       5 *        BIT(3),           /* SEE XSA DESCRIPTION      @01A*/ 65792300
*       5 CHCMFL44 BIT(1),           /* SEE XSA DESCRIPTION      @01A*/ 65792400
*         7 CHRTDM BIT(1),          /* SEE XSA DESCRIPTION       @01A*/ 65792500
*       5 *        BIT(2),           /* Reserved                 @03A*/ 65792600
*       5 CHNOBY   BIT(1),           /* See XSA description      @03A*/ 65792700
*       8 *        BIT(1),           /* Reserved                 @03A*/ 65792800
*/********************************************************************/ 65792900
*/*      THE CHAUTH FIELD MUST BE EXACTLY MAPPED BY THE XAAUTH   @L2A*/ 65793000
*/*      FIELD IN THE XSA (IEEXSA).                              @L2A*/ 65793100
*/********************************************************************/ 65793200
*    2 CHAUTH    CHAR(2),            /* COMMAND CODE AUTHORITY   @L2A*/ 65793300
*     3 CHAUTHA   BIT(8),            /* 1ST BYTE OF COMMAND CODE @L2A*/ 65793400
*         4 CHAUTH1  BIT(1),         /* COMMAND GROUP 1 (SYS)    @L2A*/ 65793600
*         4 CHAUTH2  BIT(1),         /* COMMAND GROUP 2 (I/O)    @L2A*/ 65793800
*         4 CHAUTH3  BIT(1),         /* COMMAND GROUP 3 (CONS)   @L2A*/ 65794000
*         4 *        BIT(5),         /* RESERVED                 @L2A*/ 65794200
*     3 CHAUTHB   BIT(8),            /* 2ND BYTE OF COMMAND CODE @L2A*/ 65794400
*/********************************************************************/ 65794600
*/*      THE CHDISP FIELD MUST BE EXACTLY MAPPED BY THE XADISP   @L2A*/ 65794800
*/*      FIELD IN THE XSA (IEEXSA).                              @L2A*/ 65795000
*/********************************************************************/ 65795200
*    2 CHDISP    CHAR(1),            /* AUTHORITY OF COMMAND     @L2A*/ 65795400
*         4 CHDISPA  BIT(1),         /* MASTER AUTHORITY         @L2A*/ 65795600
*         4 CHDISPM  BIT(1),         /* SECONDARY MASTER AUTHORITY      65795800
*                                                                @L2A*/ 65796000
*         4 CHDISPC  BIT(1),         /* COMMAND ISSUED FROM MCS         65796200
*                                       CONSOLE                  @L3A*/ 65796400
*         4 CHDISPR  BIT(1),         /* COMMAND ISSUED BEFORE RACF      65796600
*                                       ACTIVE                   @L3A*/ 65796800
*         4 CHDISPE  BIT(1),         /* COMMAND ISSUED BY ARM    @LGA*/ 65796900
*         4 *        BIT(3),         /* RESERVED                 @LGC*/ 65797000
*    2 CHFLGS    CHAR(1),            /* FLAGS                    @P6M*/ 65797100
*         4 CHPMSI   BIT(1),        /* COMMAND WAS ISSUED BEFORE MSI    65797220
*                                      COMPLETE                  @05A*/ 65797240
*         4 CHBIGRP  BIT(1),        /* BYPASS INITIATOR GET REGION      65797300
*                                        PROCESSING              @P6M*/ 65797400
*         4 CHNOALC  BIT(1),        /* Bypass setup of Allocation       65797500
*                                      Environment               @PBA*/ 65797600
*         4 *        BIT(5),         /* RESERVED                 @L7C*/ 65797700
*    2 CHUTOK    PTR(31),            /* POINTER TO COMMAND ISSUER       65797800
*                                         UTOKEN                 @L2A*/ 65797900
*    2 CHCNSIDT  FIXED(32),          /* TARGET CONSOLE ID        @L6M*/ 65798000
*    2 CHCNSIDI  FIXED(32),          /* ISSUING CONSOLE ID       @L6M*/ 65798100
*    2 CHCART    CHAR(8),            /* COMMAND AND RESPONSE TOKEN(CART)65798200
*                                                                @L5A*/ 65798400
*    2 CHRSV1    FIXED(8),           /* RESERVED                 @P6M*/ 65807500
*    2 CHVERSN     FIXED(8),        /* CSCB VERSION ID           @L7A*/ 65816600
*                                                                       65833200
*    2 CHRES7     CHAR(2),          /* RESERVED                  @L7A*/ 65849800
*                                                                       65866400
*    2 CHPREVP     PTR(31),         /* PREVIOUS CSCB POINTER     @L7A*/ 65883000
*                                                                       65899600
*    2 CHCSCBID    CHAR(4),         /* CSCB ACRONYM              @L7A*/ 65916200
*                                                                       65932800
*    2 CHCSCXP     PTR(31),         /* POINTER TO THE CSCX       @L8C*/ 65949400
*    2 CHDITOKN    CHAR(4),          /* CALLERS TOKEN FOR DIRECT        65974500
*                                       COMMAND INVOCATION       @P7A*/ 65983000
*    2 CHOCID      FIXED(32),       /* ORIGINATING CONSOLE ID    @02A*/ 65987300
*    2 CHRSV2      CHAR(4),         /* RESERVED                  @02C*/ 65991600
*    2 CHUNIT4     CHAR(4),         /* UNITNAME (SET FOR STARTED        65996100
*                                      TASKS ONLY)               @LCC*/ 65998000
*    2 CHSTTXTA    PTR(31),         /* POINTER TO SCTS(IEEZB884) @LFA*/ 65998600
*    2 CHRESV      CHAR(12),        /* Reserved                  @LHC*/ 65999300
* /*           END OF INPUT FORMAT MAPPING BEFORE                    */ 66000000
* /*           INTERPRETATION OF COMMAND OPERANDS                    */ 66200000
*    2 CHLAST      CHAR(0) BDY(WORD);                                   66600000
*                                                                       66800000
* /*           MACRO RELATED DECLARATIONS                            */ 66850000
*                                                                       66900000
* DCL                                                                   66950000
*    CHCSIDDC  CHAR(4) CONSTANT('CSCB'); /* CSCB ACRONYM CONSTANT       67000000
*                                                                @L1A*/ 67050000
*                                                                       67100000
* DCL                                                                   67150000
*    CHSP13   FIXED(8) CONSTANT(1),    /* VERSION LEVEL OS/VS2 JBB1326  67200000
*                                                                @L7C*/ 67250000
*    CHSP41   FIXED(8) CONSTANT(2),    /* VERSION LEVEL HBB4410  @L9C*/ 67300000
*    CHSP42   FIXED(8) CONSTANT(3),    /* VERSION LEVEL HBB4420  @LBC*/ 67350000
*    CHSP44   FIXED(8) CONSTANT(4),    /* VERSION LEVEL HBB5510  @LBA*/ 67400000
*    CHROALL  FIXED(8) CONSTANT(5);    /* VERSION LEVEL W/OW15497@02A*/ 67450000
*                                                                       67500000
* DCL                                                                   67510000
*    CHVERID  FIXED(8) CONSTANT(CHROALL); /* VERSION LEVEL - UPDATED    67512000
*                            FOR SIZE OR INCOMPATIBLE CHANGE     @02C*/ 67514000
*                                                                       67516000
* DCL                                                                   67518000
*    CHDIRINV FIXED(8) CONSTANT(0);      /* VERB CODE FOR DIRECT        67520000
*                                           COMMAND INVOCATION   @D1A*/ 67530000
*                                                                       67540000
*      /* BIT DEFINITIONS FOR COMMAND DEPENDENT                         67540500
*         FLAG BYTE (CHACT1)                                     @D2A*/ 67541000
*    @SPACE;                             /*                      @D2A*/ 67541500
*      /* BITS FOR VARY ONLINE, OFFLINE, AND CONSOLE             @D2A*/ 67542000
* DCL 1 CHVARY                                                          67542540
*%IF SYSVERSION ~= '' %THEN %GOTO CHA6;    /*                    @LHA*/ 67542580
*%IF SYSRULESMOD='PL/S-III ' %THEN %GOTO CHA6;   /*              @LIA*/ 67542620
*       DEF(CHACT1)                                                     67542660
*%GOTO CHA5;                               /*                    @LHA*/ 67542700
*%CHA6 : ;                                 /*                    @LHA*/ 67542740
*       DEF(CHAIN.CHACT1)                                               67542780
*%CHA5 : ;                                                              67542820
*                              , /* VARY DEVICE AND CONSOLE FLAG BYTE   67542860
*                                                                @D2A*/ 67543000
*      2 CHVDIENQ BIT(1),        /* PERFORM ENQS AND DEQ ON             67543500
*                                   DIRECT INVOCATION OF VARY           67544000
*                                   (VALID ONLY IF CHVCD=0)      @D2A*/ 67544500
*      2 CHVSUNPM BIT(1),        /* SUPPRESS 'NO PATHS' MESSAGE  @D2A*/ 67545000
*      2 CHSMSVL  BIT(1),        /* VARY FOR SMS LIBRARY         @LAC*/ 67545500
*      2 CHVRSV2  BIT(1),        /* RESERVED                     @D2A*/ 67546000
*      2 CHVRSV3  BIT(1),        /* RESERVED                     @D2A*/ 67546500
*      2 CHVRSV4  BIT(1),        /* RESERVED                     @D2A*/ 67547000
*      2 CHVRSV5  BIT(1),        /* RESERVED                     @D2A*/ 67547500
*      2 CHVRSV6  BIT(1);        /* RESERVED                     @D2A*/ 67548000
* /*                     END OF CSCB                                 */ 67550000
* /*IF INVOKED WITH INCCSCX=NO, DON'T THEN PROVIDE A CSCX DSECT  @L8A*/ 67600000
*                                                                       67650000
* %IF INCCSCX = 'NO' %THEN %GOTO NOPLCSCX;                     /*@L8A*/ 67700000
* /* CSCX DSECT                                                  @L8A*/ 67750000
*                                                                       67800000
* DECLARE                                                               67850000
*   1 CSCX BASED(CHCSCXP) BDY(WORD), /* CSCX DSECT               @L7A*/ 67919990
*       3 CHCSCXID  CHAR(4),     /* CSCX ACRONYM                 @L7A*/ 67950000
*       3 CHXVERSN  FIXED(8),    /* VERSION LEVEL                @L7A*/ 68000000
*       3 CHXRES    CHAR(3),     /* RESERVED                     @L7A*/ 68050000
*       3 CHECBP    PTR(31),     /* POINTER TO STOP/MODIFY ECB   @L8C*/ 68100000
*       3 CHCIBP    PTR(31),     /* POINTER TO CIB               @L8C*/ 68150000
*       3 CHRTOKEN  CHAR(4),     /* 31 BIT RIGHT JUSTIFIED TOKEN @L8C*/ 68200000
*         4 CHRTOKHR BIT(1),     /* BIT = 1 INDICATES A TOKEN    @L8C*/ 68250000
*                                                                       68300000
* /*      THE ABOVE ECB AND CIB POINTERS AND TOKEN FORM @G380P2N @L7A*/ 68350000
* /*      THE COMMUNICATIONS PARAMETER LIST MAPPED BY IEZCOM     @L7A*/ 68400000
*                                                                       68450000
*       3 CHECB      FIXED(31),  /* STOP/MODIFY ECB              @L8C*/ 68500000
*       3 CHNAME     CHAR(8),    /* JOBNAME or ATXname of an TP         68550000
*                                   initiated by APPC            @L9C*/ 68600000
*       3 CHCSCBP    PTR(31);    /* ADDRESS OF CSCB              @L7A*/ 68650000
* DCL                                                                   68700000
*    CHXID  CHAR(4) CONSTANT('CSCX'); /* CSCX ACRONYM CONSTANT   @L7A*/ 68750000
* DCL                                                                   68800000
*    CXSP41   FIXED(8) CONSTANT(1);    /* VERSION LEVEL HBB4410  @L8C*/ 68850000
*                                                                       68900000
* DCL                                                                   68950000
*    CXVERID  FIXED(8) CONSTANT(CXSP41); /* VERSION LEVEL - UPDATED     69000000
*                            FOR SIZE OR INCOMPATIBLE CHANGE     @L7C*/ 69050000
*                                                                       69100000
* %NOPLCSCX : ;                                                /*@L7A*/ 69150000
                                                                        69200000
