*       %GOTO DCMPROLG;            /*                        @G811PSS   00050000
        MACRO                                                           00066000
        IEETDCM                                                         00082000
        SPACE 1                                              @G811PSS*/ 00098000
*%DCMPROLG:;                       /*                        @G811PSS*/ 00114000
*/***START OF SPECIFICATIONS******************************************/ 00121600
*/*                                                                  */ 00129200
*/*01*  MACRO NAME:      IEETDCM                                 @P2C*/ 00136800
*/*                                                                  */ 00144400
*/*01*  DSECT NAME:  DCMSTRT, DCMSCTA, DCMSCTC, DCMORDER         @P2C*/ 00152000
*/*                                                                  */ 00159600
*/*01*  DESCRIPTIVE NAME:                                        @P2C*/ 00167200
*/*        PAGEABLE DISPLAY CONTROL MODULE MAPPING MACRO             */ 00174800
*/*                                                                  */ 00182400
*/* EXTERNAL CLASSIFICATION: NOTPI                                   */ 00190000
*/* END OF EXTERNAL CLASSIFICATION                               @P2C*/ 00197600
*/*                                                                  */ 00205200
*/*01*  COMPONENT:  DIDOCS  (SC1C4)                              @P2C*/ 00212800
*/*                                                                  */ 00220400
*/*                                                                  */ 00228000
*/*01* PROPRIETARY STATEMENT=                                        */ 00236600
*/***PROPRIETARY_STATEMENT********************************************/ 00263200
*/*                                                                  */ 00290000
*/*                                                                  */ 00293500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00297000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00300500
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 1999                      */ 00304000
*/*                                                                  */ 00307500
*/* STATUS= JBB6607                                                  */ 00311000
*/*                                                                  */ 00314500
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00318000
*/*                                                                  */ 00334000
*/*01*  EYE-CATCHER:  TDCM                                       @P2A*/ 00334200
*/*02*   OFFSET: 0                                               @P2A*/ 00334400
*/*02*   LENGTH: 4                                               @P2A*/ 00334600
*/*                                                                  */ 00334800
*/*01*  STORAGE ATTRIBUTES:                                      @P2A*/ 00335000
*/*02*   MAIN STORAGE:                                           @P2A*/ 00335200
*/*02*   VIRTUAL STORAGE:                                        @P2A*/ 00335400
*/*02*   AUXILIARY STORAGE:                                      @P2A*/ 00335600
*/*02*   DATA SPACE:                                             @P2A*/ 00335800
*/*02*   SUBPOOL:  229                                           @P2A*/ 00336000
*/*02*   KEY:  0                                                 @P2A*/ 00336200
*/*02*   RESIDENCY:                                              @P2A*/ 00336400
*/*                                                                  */ 00336600
*/*01*  SIZE:  FIRST SECTION:  1040 BYTES                        @P2A*/ 00336700
*/*            SECOND SECTION:    4 BYTES                        @P2A*/ 00336800
*/*            THIRD SECTION:     2 BYTES                        @P2A*/ 00336900
*/*            FOURTH SECTION:   11 BYTES                        @P2A*/ 00337000
*/*            FIFTH SECTION:    18 BYTES                        @P2A*/ 00337100
*/*                                                                  */ 00337200
*/*01*  METHOD OF ACCESS:                                        @P2A*/ 00337300
*/* INVOCATION - SPECIFY FOR BAL: IEETDCM                    @G811PSS*/ 00338000
*/*                      FOR PLS: %INCLUDE SYSLIB(IEETDCM)   @G811PSS*/ 00354000
*/*                               DCL (DCMSTPTR,DCMSCTB) PTR     @L7A*/ 00362000
*/*                               DCL (DCMSCTD,DCMORDPT) PTR     @L7A*/ 00370000
*/*                                                              @L7A*/ 00378000
*/*01*  FUNCTION:  THIS MACRO MAPS THE PAGEABLE DISPLAY          @P2C*/ 00391300
*/*              CONTROL MODULE (TDCM).                              */ 00404600
*/*                                                                  */ 00412000
*/*01*  CREATED BY:     IEECVFTU                                 @P2C*/ 00419400
*/*                                                              @L2A*/ 00420800
*/*01*  POINTED-TO-BY:  DCMADTRN IN RDCM                         @P2C*/ 00422200
*/*                                                              @L2A*/ 00423600
*/*01* SERIALIZATION: LOCAL AND CMS LOCKS                        @P2C*/ 00425000
*/*                                                              @L2A*/ 00426400
*/* LOCATION      =                                              @L2A*/ 00427800
*/*           MAIN STORAGE = SUBPOOL 229 KEY 0 IN COMM TASK ASID @L2A*/ 00429200
*/*           AUXILIARY STORAGE = N/A                            @L2A*/ 00430600
*/*                                                              @L2A*/ 00432000
*/* CHANGE                                                   @G811PSS*/ 00434000
*/*   ACTIVITY - G811PSS,ZA44483                             @G811PSS*/ 00444600
*/* $L1=CONCOLOR, JBB1326,  801205,  PDSS: BASE COLOR SUPPORT        */ 00455200
*/*              G860P2G - ADD BACKWARD POINTER TO RDCM,     @G860P2G*/ 00458800
*/*                        DROP 3066 SUPPORT                 @G860P2G*/ 00462400
*/*              G860PSS - EXTENDED COLOR SUPPORT            @G860PSS*/ 00464200
*/* $L2=OCCF,     JBB2110,  820531,  PDSJ: ROUTABLE K S              */ 00465100
*/* $D1=DCR43,    JBB2125,  821225,  PDSS: 3290 SUPPORT              */ 00465500
*/*              ZA66980                                             */ 00465700
*/* $L3=COEXDIDO, JBB2220,  840229,  PDE8: JES3/MCS COEXISTENCE      */ 00465800
*/* $L4=COEXPFK,  JBB2220,  850101,  PDFB: JES3/MCS COEXISTENCE      */ 00465900
*/* $L5=COEXKS,   JBB2220,  850130,  PDS7: JES3/MCS COEXISTENCE      */ 00471200
*/* $P1=PA20369,  JBB2220,  850815,  PDFI: REMOVE THE GARBAGE FROM   */ 00472900
*/*                                        THE SIB                   */ 00474600
*/*               OY10056                                    @YA10056*/ 00475000
*/* $01=OY28301,  JBB2220,  901226,  PDCS: INCORRECT LINE SPACE      */ 00475100
*/*                                        CALCULATION               */ 00475200
*/* $02=OY39865,  JBB2220,  910118,  PDCR: Multiple command retrieve */ 00475300
*/* $L6=CONSVSCR, HBB3310,  851204,  PDV1: MULTIPLE COMMAND SUPPORT  */ 00475500
*/*                                        IMPROVEMENTS              */ 00475700
*/* $L7=CONSVSCR, HBB3310,  860419,  PDW1: COMM TASK PERFORMANCE     */ 00475900
*/*                                        IMPROVEMENTS              */ 00476100
*/*                                                          @G811PSS*/ 00476500
*/* $L8=SP313,    JBB3313,  880226,  PDCR: MVS B1 SECURITY SUPPORT   */ 00477800
*/*                                                                  */ 00479100
*/* $L9=CNMG2,    HBB4410,  871026,  PDCR: CONSOLE MERGE STAGE II    */ 00480000
*/* $LA=CNSL1DS9, HBB4410,  890123,  PDS9: CONSOLE ENHANCEMENTS I    */ 00480900
*/* $LB=CNSL1DHH, HBB4410,  890123,  PDHH: CONSOLE ENHANCEMENTS I    */ 00481400
*/* $LC=CNSL1DBD, HBB4410,  890123,  PDBD: CONSOLE ENHANCEMENTS I    */ 00481700
*/* $LD=CNSL1EBD, HBB4410,  890410,  PDBD: Console Enhancements I    */ 00481800
*/* $LE=CNSL1EHH, HBB4410,  890403,  PDHH: Console Enhancements 1    */ 00481900
*/* $LF=CNSL1GBD, HBB4410,  890705,  PDBD: Console Enhancements 1    */ 00487200
*/* $D2=DCR237,   HBB4410,  890821,  PDBD: DCR 237 - MPF separator   */ 00488900
*/*                                        line                      */ 00490600
*/* $P1=PWA0053,  JBB6607,  980128,  PDZH: CHANGED DISTLIB TO AMODGEN*/ 00491500
*/* $P2=PWA0362,  JBB6607,  980818,  PDZH: CHANGED EXTERNAL          */ 00491800
*/*                                        CLASSIFICATION TO NOTPI   */ 00492100
*/***END OF SPECIFICATIONS********************************************/ 00495000
*        %GOTO DCMPBSL;                                              /* 00498000
.*                                                             @G860P2G 00500600
.* D (DCMIRCTR,DCMMSGDM,DCMMSGIR,DCMMSGWR,DCMDSINR)                @L1A 00503300
.* A (DCMMSGR1,DCMMSGR2,DCMMSGUA,DCMMSGEA)                         @L1A 00508600
.* A (DCMTVERN, DCMTSP21, DCMTRDCM)                            @G860P2G 00509900
.* A (DCMNXTOR,DCMCROW,DCMCCOL,DCMORDER,DCMAEORD,DCMSCRW)      @G860PSS 00510600
.* A (DCMMSGOR)  DEFINE WTOR BIT                               @ZA66980 00510700
.* A (DCMDELFC,DCMSEGFC,DCMCONFC,DCMRNUMF,DCMRTMEF,DCMMFRMF)       @L2A 00510800
.* A (DCMDELMS,DCMSEGMS,DCMCONMS,DCMRNUMM,DCMRTMEM,DCMMFRMM)       @L2A 00511000
.* D (DCMMODAD)                                                    @D1A 00511300
.* C (DCMTLEN)                                                     @D1A 00511600
.* A (DCMISRPQ,DCMRDRPQ,DCMRETIO,DCMSWAPT,DCMQAPTR,DCMQULEN)       @D1A 00511900
.* A (DCMLENTY)                                                    @D1A 00512200
.* D (DCMELGN,DCMRPCUR)                                            @D1A 00512500
.* A (DCMSAO)                                                      @D1A 00512800
.* C (DCMORDER) CHANGED IN PL/S TO BE BASED                        @L3A 00513000
.* C (DCMSCTA,DCMSCTC) SCT TO 4 BYTES, SSCT TO 2 BYTES             @L3A 00513200
.* A (DCMSCTA ) DSECT TO MAP SCT ENTRY                             @L3A 00513300
.* A (DCMSCTC ) DSECT TO MAP SSCT ENTRY                            @L3A 00513400
.* A (DCMDOMEN) DSECT TO MAP DOM INFORMATION                       @L3A 00513500
.* A (DCMSSCTL) LENGTH OF AN SSCT                                  @L3A 00513600
.* A (DCMBUFER) WORK AREA TO BE USED ON A MODULE-BY-MODULE BASIS   @L3A 00513700
.*              ONLY                                               @L3A 00513800
.* D (DCMPFKWR)                                                    @L4A 00517000
.* A (DCMNPFKT , DCMTABND , DCMKRPIP)                              @L4A 00520200
.* A (DCMMFRMF, DCMMFRMM) K S,MFORM=(M,T,J,S) SUPPORT              @L5A 00521800
.* C APAR OY10056 WAS ADDED TO SP3.1.0 VIA LINE ITEM MULTIPLE           00521900
.*   COMMAND SUPPORT                                           @YA10056 00522000
.* D (DCMEJNUM, DCMNROLL, DCMNINT1)                                @01A 00522100
.* A (DCMRBUFA, DCMRBUFR, DCMRBUFE, DCMRBUFC, DCMRBUF, DCMRBUFF)   @02A 00522200
.* A (DCMRBUFB, DCMRBUFT, DCMRBFLN, DCMRBFRC, DCMKPROC)            @02A 00522300
.* A (DCMSTOFF,DCMNDOFF,DCMCQUED) MULTIPLE COMMAND SUPPORT PARSING @L6A 00522400
.*                                OFFSETS AND IN-PROCESS FLAG      @L6A 00522800
.* A (PROLOG) FIXED PROLOG                                         @L7A 00523100
.*                                                             @G860P2G 00523400
.* A (DCMWLGPR,DCMDIDLG,DCMLGACT,DCMLGMSG,DCMEMTYP,DCMICUGP)       @L8A 00524000
.* A (DCMICUSC,DCMUSRID,DCMPWORD,DCMGROUP,DCMSCCLS)                @L8A 00524600
.* A (CNMG2) ADDED FIELDS FOR HOLDMODE                             @L9A 00525200
.* A (DCMMFRFX, DCMMFRMX) K S,MFORM=X SUPPORT                      @LAA 00525500
.* A (DCMFMCT1,DCMDMCT1,DCMFIMCT,DCMLAMCT,DCMMSGCO,DCMMSGHI,       @LBA 00525900
.*    DCMMSGIT,DCMMCTEN) ADDED FIELDS FOR EXTENDED MESSAGE         @LBA 00526000
.*    HIGHLIGHTING                                                 @LBA 00526100
.* C (DCMRTME,DCMRTMEM,DCMRTMEF,DCMRTMED) ADJUSTED COMMENTS TO     @LCA 00526200
.*    INDICATE VALUE IS IN TENTHS OF SECONDS                       @LCA 00526300
.* C (DCMOPRLL) Adjusted comment to indicate console could be in   @LDA 00527000
.*    roll or wrap mode                                            @LDA 00527700
.* A (DCMCSNM) Command Association in TDCM for MCS console         @LEA 00528000
.* D (DCMNINT1) Removed IEECVFTL                                   @LFA 00528200
.* A (DCMSEPLN) Added indicator for separator line to DCMSCTA3     @D2A 00528300
.* C Changed External Classification to NOTPI                      @P2A 00528500
.*                                                                      00528700
         EJECT                                                          00529100
*********************************************************************** 00530000
*                                                                     * 00550000
*        WORK AND SAVE AREAS                                          * 00570000
*                                                                     * 00590000
*********************************************************************** 00610000
         SPACE 1                                               @G811PSS 00630000
DCMSTRT  DSECT DCMSTPTR                                                 00654600
DCMOACRO DS    CL4                 CNTL BLK ACRONYM 'TDCM'         @D1C 00704600
         SPACE 1                                               @G811PSS 00777600
DCMFLG1  DS    BL1                 TDCM AREA INDICATORS                 00802200
DCMOUTPT EQU   X'02'               TDCM UPDATED FOR OUTPUT ONLY         00826800
         SPACE 1                                               @G811PSS 00851400
DCMATI   DS    XL1                 SAVED UCB ATTN INDEX        @G811PSS 00876000
         DS    AL2                 RESERVED                    @G811PSS 00900600
         SPACE 1                                               @G811PSS 00925200
DCMWTINT DS    A                   DCMWTINT INITIAL VALUE               00949800
DCMLNCNT DS    H                   NUMBER OF LINES TO BLANK  MC SA53462 00974400
DCMLNNUM DS    XL1                 FIRST LINE TO BLANK         @G811PSS 00999000
DCMGFLG  DS    BL1                 HOLDMODE INDICATORS             @L9A 01011300
DCMHOLD  EQU   X'80'               CONSOLE IS IN HOLDMODE          @L9A 01023600
DCMMWISS EQU   X'40'               MESSAGE IEE159I HAS BEEN ISSUED @L9A 01035900
DCMPACK  DS    F                   AREA TO PLACE NUMBER FOR PACKING     01048200
DCMCVBIN DS    F                   AREA FOR CONVERSION TO BINARY        01072800
         SPACE 1                                                        01097400
*********************************************************************** 01122000
*                                                                     * 01146600
*        TIMER COMMUNICATION FIELD                             @G811PSS 01171200
*                                                                     * 01195800
*********************************************************************** 01220400
         SPACE 1                                               @G811PSS 01245000
DCMTIMES DS    BL1                 TIME RTNS INDICATOR BYTE             01270000
DCMTIMER EQU   X'80'               TIME ELAPSED FOR THIS DISPLAY        01350002
DCMOPTTI EQU   X'40'               OPTIONS TO TI RTN                    01400002
DCMOTTMM EQU   X'10'               OPTIONS OR TI RTNS TO MSG MODULE     01450002
DCMTASYN EQU   X'04'               TIMER SET FOR ASYNC ERROR MSG        01500002
DCMOCTTI EQU   X'02'               OPEN-CLOSE TO TI RTN                 01550002
DCMRMTTI EQU   X'01'               ROLL MODE TO TIMER ROUTINE           01600002
         EJECT                                                          01650000
*********************************************************************** 01655000
*                                                                     * 01660000
*        CONTROL BLOCK VERSION IDENTIFICATION                  @G860P2G 01665000
*                                                                     * 01670000
*********************************************************************** 01675000
         SPACE 1                                               @G860P2G 01680000
DCMTVERN DS    AL1                 CONTROL BLOCK VERSION       @G860P2G 01685000
DCMTSP21 EQU   1                   OS/VS2 HBB2102 LEVEL        @G860PSS 01690000
DCMTS212 EQU   2                   OS/VS2 JBB2125 LEVEL            @D1A 01692700
DCMTS220 EQU   3                   OS/VS2 JBB2220 LEVEL            @L3A 01694000
         SPACE 1                                               @G811PSS 01695400
         DS    H                   RESERVED                        @D1C 01718100
         SPACE 1                                               @G811PSS 01740800
*********************************************************************** 01763500
*                                                                     * 01786200
*        ADDRESS TABLE                                         @G811PSS 01808900
*                                                                     * 01831600
*********************************************************************** 01854300
         SPACE 1                                               @G811PSS 01877000
         DS    A                   RESERVED                        @L3C 01900000
DCMDOMPK DS    A                   ADDRESS OF FIRST DOM NUMBER          01950002
DCMAMTAB DS    A                   ADDRESS OF FIRST SCT ENTRY           02000002
DCMADSEC DS    A                   ADDRESS OF FIRST SSCT ENTRY          02050002
DCMADDRL DS    A                   ADDRESS OF LAST SCT ENTRY            02100002
DCMASCRN DS    A                   POINTER TO SCREEN IMAGE BUFFER       02150002
DCMLSCRN DS    A                   POINTER TO LAST BUFFER LINE          02200002
DCMWTBUF DS    A                   SCREEN LENGTH POINTER                02250002
DCMAINS  DS    A                   POINTER TO INSTRUCTION LINE          02300002
DCMAENTR DS    A                   POINTER TO ENTRY AREA                02350002
DCMAWARN DS    A                   POINTER TO WARNING LINE              02400002
DCMADCHP DS    A                   ADDRESS OF CHANNEL PROGRAM AREA      02450002
DCMPFKLN DS    A                   POINTER TO PFK LINE                  02500002
         SPACE 1                                               @G811PSS 02550000
DCMCXSVE DS    F                   CXSA SAVE AREA                       02576600
DCMADOPN DS    A                   ADDRESS OF COMMAND OPERAND           02603200
         SPACE 1                                               @G811PSS 02629800
DCMDSAV  DS    5F                  SAVE AND WORK AREA                   02656400
         EJECT                                                 @G811PSS 02683000
*********************************************************************** 02710000
*                                                                     * 02720000
*        INPUT BUFFER FOR ISSUING SVC 34 AND SVC 35                   * 02730000
*        FIELDS DCMWQEXP THROUGH DCMINPUT MUST REMAIN IN ORDER        * 02736000
*                                                                     * 02750000
*********************************************************************** 02760000
         SPACE 1                                               @G811PSS 02770000
DCMWQEXP DS    0F                  ENSURE FULL WORD BOUNDARY            02850002
DCMINLGN DS    H                   FIELD FOR INPUT LENGTH               02900002
DCMMCSFL DS    H                   MCS FLAGS FIELD                      02950002
DCMINPUT DS    CL128               INPUT MESSAGE TEXT              @L4C 03000000
         SPACE 1                                               @G811PSS 03050000
*********************************************************************** 03057100
*                                                                     * 03064200
*        GENERAL LENGTH VALUES                                 @G811PSS 03071300
*                                                                     * 03078400
*********************************************************************** 03085500
         SPACE 1                                               @G811PSS 03092600
DCMLGNTH DS    H                   LENGTH OF A LINE                     03100002
DCMBAINC DS    H                   ADDRESS TO INSERT CURSOR             03150002
DCMSSCTL DS    H                   LENGTH OF ONE SSCT ENTRY        @L3C 03200000
DCMBADLN DS    H                   BUFFER ADDR TO BEGIN MSG WRITE       03250002
DCMBYTCT DS    H                   NUMBER OF BYTES TO WRITE             03300002
DCMADNUM DS    H                   NEXT LINE NUMBER                     03350002
DCMAXLGN DS    H                   MAXIMUM LINE LENGTH                  03400002
DCMMSGAL DS    H                   NUMBER OF LINES IN MESSAGE AREA      03450002
DCMRMINC DS    H                   INCREMENT INTO RMI                   03500002
DCMSCTCN DS    H                   LENGTH OF ONE SCT ENTRY              03550002
DCMCORLN DS    H                   LENGTH OF TDCM LINE IN CORE          03600000
         DS    H                   TIME COUNTER                         03650002
DCMPFKNM DS    XL1                 NUMBER OF KEY BEING PROCESSED        03700002
DCMPFKKN DS    XL1                 LIST KEY NUMBER                      03750002
         SPACE 1                                               @G811PSS 03800000
*********************************************************************** 03807100
*                                                                     * 03814200
*        VALUES FOR OPTIONS                                    @G811PSS 03821300
*                                                                     * 03828400
*********************************************************************** 03835500
         SPACE 1                                               @G811PSS 03842600
DCMDEL   DS    CL2                 DEL VALUE                            03850002
DCMCON   DS    CL1                 CON VALUE                            03900002
DCMSEG   DS    FL1                 SEG VALUE                            03950002
DCMDL    DS    FL1                 DISPLAY AREA OPTION                  04000002
DCMRNUM  DS    FL1                 ROLL NUMBER VALUE                    04050002
DCMRTME  DS    H                   ROLL TIME VALUE IN TENTHS OF        X04083300
                                   SECONDS                         @LCC 04116600
         EJECT                                                 @G811PSS 04150000
*********************************************************************** 04190000
*                                                                     * 04230000
*        DEFAULT VALUES FOR OPTIONS                                   * 04270000
*                                                                     * 04310000
*********************************************************************** 04350000
         SPACE 1                                               @G811PSS 04390000
DCMSEGDF DS    FL1                 SEG DEFAULT                          04428500
DCMRNUMD DS    FL1                 RNUM DEFAULT                         04467000
DCMRTMED DS    H                   RTME DEFAULT IN TENTHS OF SECONDS   X04492600
                                                                   @LCC 04518200
         SPACE 1                                               @G811PSS 04544000
*********************************************************************** 04553600
*                                                                 @LBA* 04582400
*        MCT TABLE CONTANTS                                       @LBA* 04585600
*                                                                 @LBA* 04588800
*********************************************************************** 04592000
DCMMCTCN DS    H                   LENGTH OF ONE MCT ENTRY         @LBA 04601600
         DS    XL3                 RESERVED                        @LBC 04611200
         SPACE 1                                               @G811PSS 04621000
*********************************************************************** 04660000
*                                                                     * 04690000
*        COMMUNICATIONS AREAS                                         * 04720000
*                                                                     * 04790000
*********************************************************************** 04830000
         SPACE 1                                               @G811PSS 04870000
DCMOPTST DS    BL1                 STATUS OF SCREEN CONTROL OPTIONS     04910000
DCMOPTVR EQU   X'80'               DELETE VERIFICATION  CON=(Y=1,N=0)   05150002
DCMOPTAD EQU   X'40'               AUTOMATIC DELETION   DEL=(Y=1,N=0)   05200002
DCMOPTSG EQU   X'20'               DEFAULT SEGMENT SPECIFIED  SEG=(0=0) 05250002
DCMOPRLL EQU   X'10'               Roll/Wrap mode?  (Y=1, N=0)     @LDC 05300000
         SPACE 1                                               @G811PSS 05350000
DCMCS    DS    BL1                 OPEN/CLOSE REQUEST                   05400000
DCMCSC   EQU   X'80'               CLOSE REQUEST                        05450000
DCMCSO   EQU   X'40'               OPEN REQUEST                         05500000
DCMISRPQ EQU   X'20'               ISSUE READ PARTITION QUERY      @D1A 05508300
DCMRDRPQ EQU   X'10'               READ RESULT OF READ PARTITION QUERY X05516600
                                                                   @D1A 05524900
DCMRETIO EQU   X'08'               RETURN TO I/O ROUTINE           @D1A 05533200
DCMSWAPT EQU   X'04'               TDCM SWAP IS NEEDED             @D1A 05541500
         SPACE 1                                               @G811PSS 05550000
DCMUTILT DS    BL1                 INTERNAL FLAGS              @G811PSS 05600000
DCMUTILA EQU   X'80'               THESE BITS ARE                       05750002
DCMUTILB EQU   X'40'                 INITIALIZED AND USED               05800002
DCMUTILC EQU   X'20'                 SOLELY WITHIN                      05850002
DCMUTILD EQU   X'10'                 EACH MODULE                        05900002
DCMUTILE EQU   X'08'               THEY ARE NEVER                       05950002
DCMUTILF EQU   X'04'               USED FOR INTERFACE                   06000002
DCMTEST1 EQU   X'02'               FOR TESTING                          06050002
DCMTEST2 EQU   X'01'               FOR TESTING                          06100002
         SPACE 1                                               @G811PSS 06150000
DCMDSTAT DS    BL1                 CURRENT DISPLAY STATUS               06200000
DCMDSTNM EQU   X'20'               MESSAGES ARE NUMBERED                06300002
DCMDSTNH EQU   X'10'               MSGS NUMBERED - HOLD OPTION          06350002
.* X'08' WAS DCMDSINR - INTERVENTION REQ'D DELETION TRIED          @L1A 06400000
DCMDSAUT EQU   X'04'               AUTOMATIC DELETION TRIED             06450002
         EJECT                                                 @G811PSS 06457000
*********************************************************************** 06486000
*                                                                     * 06515000
*        MCS INTERFACE FIELD                                   @G811PSS 06544000
*                                                                     * 06573000
*********************************************************************** 06602000
         SPACE 1                                               @G811PSS 06631000
DCMMCSST DS    BL1                 MCS INTERFACE BYTE                   06660000
DCMDUSE  EQU   X'80'               DIDOCS IN CONTROL           @G811PSS 06689000
DCMOOMSS EQU   X'04'               MESSAGE STREAM ENTRY                 06718000
DCMOOSDS EQU   X'01'               STATUS DISPLAY ENTRY                 06747000
         SPACE 1                                               @G811PSS 06776000
*********************************************************************** 06805000
*                                                                     * 06834000
*        UNIQUE INTERFACE FIELD                                @G811PSS 06863000
*                                                                     * 06892000
*********************************************************************** 06921000
         SPACE 1                                               @G811PSS 06950000
DCMIOUNQ DS    BL1                 UNIQUE IO BYTE                       06980000
.* DCMIO226 EQU   X'80' RMI PERFORMED - DELETED FOR -------------> @L3C 07020000
.* DCMRPCUR EQU   X'40' ADVANCE CURSOR TO BLANKS - DELETED FOR --> @D1C 07060000
DCMFRSCN EQU   X'20'               PUT OUTPUT IN HOLD MODE              07100000
DCMRDARM EQU   X'10'               PERFORM READ AFTER RMI               07250002
DCMW2250 EQU   X'08'               DEVICE HAS LIGHT PEN        @G811PSS 07300000
DCMINNOR EQU   X'04'               NORMAL INSTRUCTION LINE              07320000
DCMINERR EQU   X'02'               ERROR INSTRUCTION LINE               07340000
DCMEWASP EQU   X'01'               ERASE/WRITE ALTERNATE COMMAND       X07360000
                                   SUPPORTED                   @G811PSS 07380000
         EJECT                                                 @G811PSS 07400000
*********************************************************************** 07420000
*                                                                     * 07440000
*        I/O COMMUNICATION FIELDS                              @G811PSS 07460000
*                                                                     * 07480000
*********************************************************************** 07500000
         SPACE 1                                               @G811PSS 07520000
DCMIOCM1 DS    BL1                 IO COMMUNICATIONS BYTE 1             07540000
DCMDORMI EQU   X'80'               ISSUE RMI                            07600002
DCMSOUND EQU   X'40'               SOUND ALARM                          07650002
DCMWRWRN EQU   X'20'               WRITE WARNING LINE                   07700002
DCMWRMSG EQU   X'10'               WRITE FULL MESSAGE AREA              07750002
DCMWRPAR EQU   X'08'               WRITE PARTIAL MESSAGE AREA           07800002
DCMWRINS EQU   X'04'               WRITE INSTRUCTION LINE               07850002
DCMWRENT EQU   X'02'               WRITE ENTRY AREA                     07900002
DCMINSC  EQU   X'01'               INSERT CURSOR                        07950002
         SPACE 1                                               @G811PSS 08000000
DCMIOCM2 DS    BL1                 IO COMMUNICATIONS BYTE 2             08050000
DCMBLENT EQU   X'80'               BLANK ENTRY AREA                     08150002
DCMBLWRL EQU   X'40'               BLANK LEFT HALF WARNING LINE         08200002
DCMBLWRR EQU   X'20'               BLANK RIGHT HALF WARNING LINE        08250002
DCMINSSH EQU   X'10'               INIT AND SHIFT INSTRUCTION LINE      08300002
DCMWINFD EQU   X'08'               WRITE INFORMATIONAL DISPLAY          08350002
DCMERASE EQU   X'04'               PERFORM ERASE                        08400002
DCMIOCRD EQU   X'02'               PERFORM READ                    @L3C 08450000
DCMWRASY EQU   X'01'               WRITE ASYNC ERROR MSG TO MID-SCREEN  08500002
         SPACE 1                                               @G811PSS 08550000
DCMIOCM3 DS    BL1                 IO COMMUNICATIONS BYTE 3             08580000
DCMOPRMI EQU   X'80'               RMI AFTER OPEN TO UNLOCK KEYBOARD    08610000
DCMSSRG  EQU   X'40'               SUPPRESS START REGENERATION          08640000
DCMEWAND EQU   X'20'               ERASE/WRITE ALTERNATE COMMAND       X08670000
                                   NEEDED                      @G811PSS 08700000
DCMWRPFK EQU   X'10'               TDCM WRITE PFK AREA                  08733600
DCMPFKAT EQU   X'08'               PFK ATTENTION                        08767200
DCMRDPFK EQU   X'04'               PFK AREA READ                        08800800
DCMCQUED EQU   X'02'               MULTIPLE COMMANDS QUEUED        @L6C 08845600
DCMKPROC EQU   X'01'               PFK being processed             @02C 08890400
         SPACE 1                                               @G811PSS 08935200
DCMLINEN DS    XL1                 LINE NUMBER TO BEGIN WRITE           08968800
DCMCULNO DS    XL1                 LINE IN ENTRY AREA TO INSERT CURSOR  09002400
DCMPOSCU DS    XL1                 POSITION TO INSERT CURSOR            09036000
         EJECT                                                 @G811PSS 09069600
*********************************************************************** 09103200
*                                                                     * 09136800
*        ASYNCHRONOUS ERROR COMMUNICATIONS FIELD               @G811PSS 09170400
*                                                                     * 09204000
*********************************************************************** 09237600
         SPACE 1                                               @G811PSS 09271200
DCMASYNC DS    BL1                 ASYN ERROR COMMUNICATIONS/RETRY BYTE 09304800
DCMASDA  EQU   X'40'               DATA CHECK RETRY BIT        @G811PSS 09338400
DCMASIN  EQU   X'20'               INVALID BUFFER ADDR CHECK RETRY BIT X09372000
                                                               @G811PSS 09405600
DCMASBA  EQU   X'10'               BUFFER ADDR PARITY CHECK RETRY BIT  X09439200
                                                               @G811PSS 09472800
DCMASEWA EQU   X'08'               PERMANENT ERROR ON EWA DEVICE       X09506400
                                   RETRIED                     @G811PSS 09540000
         SPACE 1                                               @G811PSS 09573600
*********************************************************************** 09607200
*                                                                     * 09640800
*        COMMUNICATION FIELDS                                  @G811PSS 09674400
*                                                                     * 09708000
*********************************************************************** 09741600
         SPACE 1                                               @G811PSS 09775200
DCMCOM1  DS    BL1                 COMMUNICATIONS BYTE                  09810000
DCMLPENT EQU   X'80'               ENTER BY LP OR CURSOR                09850002
DCMIOPRD EQU   X'40'               READ PERFORMED                       09900002
DCMCOMRM EQU   X'20'               RMI PERFORMED                        09950002
DCMCOMAU EQU   X'10'               PERFORM AUTO DELETE                  10000002
DCMCOMRD EQU   X'08'               PERFORM REGULAR DELETE               10050002
DCMCOMNM EQU   X'04'               NUMBER MESSAGES                      10100002
DCMCLEAR EQU   X'02'               CLEAR KEY WAS PRESSED       @G811PSS 10150000
DCMCANCL EQU   X'01'               INDICATE CANCEL TO COMMAND ROUTINE   10190000
         SPACE 1                                               @G811PSS 10230000
DCMCOM2  DS    BL1                 COMMUNICATIONS BYTE                  10270000
DCMCM2I  EQU   X'80'               INPUT TO BE PROCESSED                10350002
DCMSPLIT EQU   X'40'               MSG TO BE SPLIT                      10400002
DCMCOMAR EQU   X'20'               ACCEPTED REPLY                       10450002
DCMREPLC EQU   X'10'               REPEAT LAST COMMAND KEY (PA1)       X10460000
                                   PRESSED                     @G811PSS 10470000
DCMERPF  EQU   X'08'               ERASE PERF-PROC CAN NOW CLOSE DEVICE 10500002
DCMCMIN5 EQU   X'04'               RETURN TO INTER. 5 FOR BLNK          10550002
DCMCBLNK EQU   X'02'               BLANKING REQUIRED                    10600002
DCMAE    EQU   X'01'               CLEANUP FOR ASY ERROR                10650002
         SPACE 1                                               @G811PSS 10700000
DCMCOM3  DS    BL1                 COMMUNICATIONS BYTE                  10750000
DCMCDSP3 EQU   X'80'               DISPLAY 3 COMPLETED WORK             10850002
DCMRTPFK EQU   X'40'               RETURN TO PFK ROUTINE                10900002
DCMVLPFK EQU   X'20'               VERIFYING LAST COMMAND               10950002
DCMXINT1 EQU   X'10'               ENTRY FOR INTERFACE 1 ROUTINE        11000002
DCMOLUNV EQU   X'08'               O-O-L MSG CAUSED UNVIEW. MSG.        11050002
DCMOLHLD EQU   X'02'               OUT OF LINE MESSAGES HELD  MB Y02958 11110002
DCMCMIN7 EQU   X'01'               RETURN TO INTER. 7 FOR BLANKING      11150002
         EJECT                                                 @G811PSS 11200000
*********************************************************************** 11210000
*                                                                     * 11220000
*        MESSAGE MODULES COMMUNICATION FIELDS                  @G811PSS 11230000
*                                                                     * 11240000
*********************************************************************** 11250000
         SPACE 1                                               @G811PSS 11260000
DCMCMSG1 DS    BL1                 MSG MODULE COMMUNICATIONS BYTE 1     11270000
DCMMSGWT EQU   X'80'               MOVE IN MESSAGE WAITING              11350002
DCMUNMSG EQU   X'40'               MOVE IN UNVIEWABLE MESSAGE           11400002
DCMSTEX  EQU   X'20'               MOVE IN STATUS EXISTS                11450002
DCMCHOPT EQU   X'10'               MOVE IN CHANGE OPTIONS               11500002
DCMELONG EQU   X'08'               MOVE IN ENTRY TOO LONG               11550002
DCMWRCDL EQU   X'04'               MOVE IN CON=N,DEL=Y                  11600002
DCMDELNT EQU   X'02'               MOVE IN DEL UNCHANGED, NO TIMER      11650002
         SPACE 1                                               @G811PSS 11750000
DCMCMSG2 DS    BL1                 MSG MODULE COMMUNICATIONS BYTE 2     11800000
DCMDLREQ EQU   X'80'               MOVE IN DELETION REQUESTED           11900002
DCMRQINC EQU   X'40'               MOVE IN REQUEST INCONSISTENT         11950002
DCMMSGCR EQU   X'20'               MOVE IN INVALID CURSOR OPERATION     12000002
DCMINVOP EQU   X'10'               MOVE IN INVALID OPERAND              12050002
DCMCILLP EQU   X'08'               MOVE IN ILLEGAL LP OPERATION         12100002
DCMDELRI EQU   X'04'               MOVE IN DELETE REQUEST INCONSISTENT  12150000
DCMASYRT EQU   X'02'               MOVE IN ASYN ERROR RETRYABLE         12200002
DCMASYCD EQU   X'01'               MOVE IN ASYN ERROR MAYBE RETRYABLE   12250002
         SPACE 1                                               @G811PSS 12300000
DCMCMSG3 DS    BL1                 MSG MODULE COMMUNICATIONS BYTE 3     12350000
DCMCMRLL EQU   X'80'               MOVE IN ROLL MODE MESSAGE            12450002
DCMCDLR1 EQU   X'40'               NO DELETABLE MESSAGES                12500002
DCMCDLR2 EQU   X'20'               INVALID RANGE                        12550002
DCMCDLR3 EQU   X'10'               SEG EQU TO ZERO                      12600002
DCMCDLR4 EQU   X'08'               DISPLAY NOT ON SCREEN                12650002
DCMCDLR5 EQU   X'04'               INVALID OPERAND                      12700002
DCMDTBSY EQU   X'01'               COMMAND REJECTED - TASK BUSY         12800002
         SPACE 1                                               @G811PSS 12850000
DCMCMSG4 DS    BL1                 MSG MODULE COMMUNICATIONS BYTE 4     12900000
DCMPFKNA EQU   X'80'               MOVE IN PFK NOT ALLOCATED FOR        13000002
DCMPFKND EQU   X'40'               MOVE IN PFK NOT DEFINED              13050002
DCMPFKNO EQU   X'20'               MOVE IN NO PFK ALLOCATION            13100002
DCMPFKIP EQU   X'10'               MOVE IN PFK IN PROCESS               13150002
DCMNPFKT EQU   X'08'               MOVE IN NO PFK TABLES           @L4A 13160000
DCMTABND EQU   X'04'               MOVE IN PFK TABLE NOT DEFINED   @L4A 13170000
DCMKRPIP EQU   X'02'               MOVE IN K REQUEST INCONSISTENT -PFK X13180000
                                   IN USE                          @L4A 13190000
         EJECT                                                 @G811PSS 13200000
*********************************************************************** 13220000
*                                                                     * 13240000
*        SVC 34 COMMUNICATIONS FIELD                           @G811PSS 13260000
*                                                                     * 13280000
*********************************************************************** 13300000
         SPACE 1                                               @G811PSS 13320000
DCMSVC34 DS    BL1                 SVC 34 COMMUNICATION BYTE            13340000
DCMMYCMD EQU   X'80'               COMMAND TO BE HANDLED BY THIS CONS   13360000
DCMINVLD EQU   X'40'               INVALID K COMMAND                    13380000
DCMTYPE1 EQU   X'20'               K COMMAND IS NOT ROUTABLE            13400000
         SPACE 1                                               @G811PSS 13420000
DCMCOM4  DS    BL1                 COMMUNICATION BYTE 4        @ZA44483 13426200
DCMCNTRL EQU   X'80'               CONTROL LINE INDICATOR      @ZA44483 13432400
         SPACE 1                                               @G811PSS 13438600
*********************************************************************** 13447900
*                                                                     * 13457200
*        INDEX FOR I/O ROUTINE                                 @G811PSS 13466500
*                                                                     * 13475800
*********************************************************************** 13485100
         SPACE 1                                               @G811PSS 13494400
DCMIONDX DS    XL1                 INDEX FOR SELECTING THE    MB Y02958 13503700
*                                  APPROPRIATE I/O ROUTINE    MB Y02958 13513000
*                                  X'04' - RESERVED            @G860P2G 13522300
*                                  X'08' - RESERVED                @L3C 13531600
*                                  X'0C' - RESERVED                @D1C 13540900
*                                  X'10' - 3270 TYPE DEVICE -      @D1C 13550200
*                                               IEECVETU       @G811PSS 13559500
         SPACE 1                                               @G811PSS 13568800
DCMTEST  DS    H                   RESERVED FOR TESTING       MB Y02958 13578800
         EJECT                                                          13598800
*********************************************************************** 13618800
*                                                                     * 13638800
*        MODULE ADDRESSES                                             * 13658800
*                                                                     * 13678800
*********************************************************************** 13698800
         SPACE 1                                              MB Y02958 13800002
DCMADMOD DS    0CL(30*4)           STRUCTURE OF MODULE ADDRESSES. 30   X13812500
                                   IS NUMBER OF MODULE ADDRESSES AND 4 X13825000
                                   IS LENGTH OF EACH FIELD         @D1A 13837500
DCMIORTN DS    F                   APPROPRIATE I/O ROUTINE    MB Y02958 13850000
*                  NAME   TRACE ID   DESCRIPTION              MB Y02958 13900002
*                 IEECVETU    EU   3270 TYPE DEVICE IO ROUTINE     @D1C 13981200
         SPACE 1                                              MB Y02958 14000002
*                  NAME   TRACE ID   DESCRIPTION              MB Y02958 14010002
DCMNMODS EQU   *                   MODULE ADDRESSES                @L4A 14056600
         DS    F                   RESERVED                        @L4C 14103200
DCMNPROC DS    F  IEECVET1    E1   PROCESSOR ROUTINE LOAD ONE MB Y02958 14150002
DCMNDSP1 DS    F  IEECVET2    E2   DISPLAY ROUTINE 1          MB Y02958 14250002
DCMNDSP2 DS    F  IEECVET3    E3   DISPLAY ROUTINE 2          MB Y02958 14300002
DCMNDSP3 DS    F  IEECVFT2    F2   DISPLAY ROUTINE 3          MB Y02958 14350002
DCMNCMD1 DS    F  IEECVET4    E4   COMMAND ROUTINE 1          MB Y02958 14400002
DCMNDEL1 DS    F  IEECVET6    E6   DELETE ROUTINE 1           MB Y02958 14500002
DCMNDEL2 DS    F  IEECVET7    E7   DELETE ROUTINE 2           MB Y02958 14550002
DCMNDEL3 DS    F  IEECVET8    E8   DELETE ROUTINE 3           MB Y02958 14600002
DCMNDEL4 DS    F  IEECVET9    E9   DELETE ROUTINE 4           MB Y02958 14650002
DCMNOPT1 DS    F  IEECVETA    EA   OPTIONS ROUTINE 1          MB Y02958 14700002
DCMNPFK1 DS    F  IEECVFTA    FA   PFK ROUTINE 1              MB Y02958 14750002
DCMNPFK2 DS    F  IEECVFTB    FB   PFK ROUTINE 2              MB Y02958 14800002
DCMNERRO DS    F  IEECVETC    EC   ASYNCHRONOUS ERROR ROUTINE MB Y02958 14850002
DCMNMSG1 DS    F  IEECVETD    ED   MESSAGE ROUTINE 1          MB Y02958 14900002
DCMNMSG2 DS    F  IEECVETE    EE   MESSAGE ROUTINE 2          MB Y02958 14950002
DCMNMSG3 DS    F  IEECVFTD    FD   MESSAGE ROUTINE 3          MB Y02958 14960002
DCMNLPCR DS    F  IEECVETF    EF   LIGHT PEN/CURSOR SERVICE   MB Y02958 15000002
DCMNOPCL DS    F  IEECVETG    EG   OPEN-CLOSE ROUTINE         MB Y02958 15050002
DCMNCLN  DS    F  IEECVFTG    FG   CLEANUP MODULE             MB Y02958 15100002
         DS    F                   Reserved                        @01C 15150000
DCMNTIMR DS    F  IEECVETK    EK   TIMER INTERPRETER ROUTINE  MB Y02958 15200002
         DS    F                   Reserved (was IEECVFTL)         @LFC 15250000
DCMNINT2 DS    F  IEECVFTM    FM   INTERFACE 2 ROUTINE        MB Y02958 15300002
DCMNINT3 DS    F  IEECVFTN    FN   INTERFACE 3 ROUTINE        MB Y02958 15350002
DCMNINT4 DS    F  IEECVFTO    FO   INTERFACE 4 ROUTINE        MB Y02958 15400002
DCMNINT5 DS    F  IEECVFTP    FP   INTERFACE 5 ROUTINE        MB Y02958 15450002
DCMNINT6 DS    F  IEECVFTQ    FQ   INTERFACE 6 ROUTINE        MB Y02958 15500002
DCMNINT7 DS    F  IEECVFTT    FT   INTERFACE 7 ROUTINE        MB Y02958 15550002
         EJECT                                                 @G811PSS 15560000
*********************************************************************** 15565700
*                                                                     * 15571400
*        DIDOCS MODULE TRACE AREA                              @G811PSS 15577100
*                                                                     * 15582800
*********************************************************************** 15588500
         SPACE 1                                               @G811PSS 15594200
DCMTRACE DS    CL30                DIDOCS MODULE TRACE AREA   MB Y02958 15600002
DCMTRAC2 EQU   DCMTRACE+2          TRACE MOVE FROM-ADDRESS    MB Y02958 15650002
DCMTRLEN EQU   *-DCMTRACE          LENGTH FOR TRACE MOVE      MB Y02958 15700002
DCMTREN1 DS    C                   1ST BYTE OF TRACE ENTRY    MB Y02958 15750002
DCMTREN2 DS    C                   2ND BYTE OF TRACE ENTRY    MB Y02958 15760002
         SPACE 1                                               @G811PSS 15800000
*********************************************************************** 15800700
*                                                                     * 15801400
*        FOLLOWING GROUP OF BYTES ARE DEVICE DEPENDENT         @G811PSS 15802100
*                                                                     * 15802800
*********************************************************************** 15803500
         SPACE 1                                               @G811PSS 15804200
DCMASKEN DS    XL1                 ENTER MASK                           15805200
DCMASKCN DS    XL1                 CANCEL MASK                          15805900
DCMASKCR DS    XL1                 CURSOR MASK                          15806600
DCMASKLP DS    XL1                 LIGHT PEN MASK                       15807300
DCMSKPF1 DS    XL1                 1ST PFK TYPE MASK           @G811PSS 15808000
DCMSKPF2 DS    XL1                 2ND PFK TYPE MASK           @G811PSS 15808700
DCMSKPF3 DS    XL1                 3RD PFK TYPE MASK           @G811PSS 15809400
DCMSKPF4 DS    XL1                 4TH PFK TYPE MASK           @G811PSS 15810100
DCMASKCL DS    XL1                 CLEAR KEY MASK              @G811PSS 15810800
DCMSKPA1 DS    XL1                 PA1 KEY MASK                @G811PSS 15811500
DCMSKPA3 DS    XL1                 PA3 KEY MASK                @G811PSS 15812200
         DS    5XL1                RESERVED                    @G811PSS 15812900
         SPACE 1                                               @G811PSS 15813600
*********************************************************************** 15814300
*                                                                     * 15815000
*        ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER WHEN IN @G811PSS 15815700
*        FULL CAPABILITY MODE                                  @G811PSS 15816400
*                                                                     * 15817100
*********************************************************************** 15817800
         SPACE 1                                               @G811PSS 15818500
DCMSADCN EQU   *                  FIRST ADCON IN LIST          @G811PSS 15819200
DCMFLLA  DS    A                  LAST LINE IN MSG AREA        @G811PSS 15819900
DCMFLL1A DS    A                  LAST LINE IN MSG AREA + 1    @G811PSS 15820600
DCMFLSCT DS    A                  SCT FOR LAST LINE IN MSG             X15821300
                                  AREA                         @G811PSS 15822000
DCMFSCT1 DS    A                  SCT FOR LAST LINE IN MSG AREA + 1    X15822700
                                                               @G811PSS 15823400
DCMFSSCT DS    A                  SSCT FOR LAST LINE IN MSG AREA + 1   X15824100
                                                               @G811PSS 15824800
DCMFENT2 DS    A                  2ND LINE OF ENTRY AREA       @G811PSS 15825500
DCMFMCT1 DS    A                  MCT FOR LAST LINE IN MSG AREA + 1    X15825800
                                                                   @LBA 15826100
         DS    5A                 RESERVED                         @LBC 15826400
         EJECT                                                 @G811PSS 15826900
*********************************************************************** 15827600
*                                                                     * 15828300
*        ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER WHEN IN @G811PSS 15829000
*        MESSAGE STREAM MODE                                   @G811PSS 15829700
*                                                                     * 15830400
*********************************************************************** 15831100
         SPACE 1                                               @G811PSS 15831800
DCMMLLA  DS    A                  LAST LINE MSG AREA           @G811PSS 15832500
DCMMLL1A DS    A                  LAST LINE IN MSG AREA + 1    @G811PSS 15833200
DCMMLSCT DS    A                  SCT FOR LAST LINE IN MSG             X15833900
                                  AREA                         @G811PSS 15834600
DCMMSCT1 DS    A                  SCT FOR LAST LINE IN MSG AREA + 1    X15835300
                                                               @G811PSS 15836000
DCMMSSCT DS    A                  SSCT FOR LAST LINE IN MSG AREA + 1   X15836700
                                                               @G811PSS 15837400
DCMMMCT1 DS    A                  MCT FOR LAST LINE IN MSG AREA + 1    X15837700
                                                                   @LBA 15838000
         DS    A                  RESERVED                         @LBC 15838300
         SPACE 1                                               @G811PSS 15838800
*********************************************************************** 15839500
*                                                                     * 15840200
*        ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER WHEN IN @G811PSS 15840900
*        STATUS DISPLAY MODE                                   @G811PSS 15841600
*                                                                     * 15842300
*********************************************************************** 15843000
         SPACE 1                                               @G811PSS 15843700
DCMDLLA  DS    A                  LAST LINE IN MSG AREA        @G811PSS 15844400
DCMDLL1A DS    A                  LAST LINE IN MSG AREA + 1    @G811PSS 15845100
DCMDLSCT DS    A                  SCT FOR LAST LINE IN MSG             X15845800
                                  AREA                         @G811PSS 15846500
DCMDSCT1 DS    A                  SCT FOR LAST LINE IN MSG AREA + 1    X15847200
                                                               @G811PSS 15847900
DCMDSSCT DS    A                  SSCT FOR LAST LINE IN MSG AREA + 1   X15849300
                                                               @G811PSS 15850000
DCMDMCT1 DS    A                  MCT FOR LAST LINE IN MSG AREA + 1    X15850100
                                                                   @LBA 15850200
         DS    A                  RESERVED                         @LBC 15850300
         SPACE 1                                               @G811PSS 15850700
*********************************************************************** 15850800
*                                                                     * 15850900
*        ADDRESSES TO BE RESOLVED DURING OPEN                      @L1A 15851000
*                                                                     * 15851100
*********************************************************************** 15851200
         SPACE 1                                               @G811PSS 15851300
DCMLSSCT DS    A                  ADDRESS OF THE LAST SSCT         @L1A 15851400
DCMAEORD DS    A                  ADDR OF ADJUNCT EXTENDED ORDERS      X15851500
                                                               @G860PSS 15851600
DCMQAPTR DS    A                  ADDR OF DATA OBTAINED FROM READ      X15851700
                                  PARTITION QUERY                  @D1A 15851800
DCMFIMCT DS    A                  ADDR OF FIRST MCT                @LBA 15851900
DCMLAMCT DS    A                  ADDR OF LAST MCT                 @LBA 15852000
         DS    4A                 RESERVED                         @LBC 15852100
DCMLADCN EQU   *                  LAST ADCON IN LIST               @L1A 15852200
         DS    A                  RESERVED                         @L1A 15852300
         EJECT                                                 @G811PSS 15852400
*********************************************************************** 15852800
*                                                                     * 15853500
*        NUMBER OF LINES IN MESSAGE AREA AND ENTRY AREA VALUES @G811PSS 15854200
*                                                                     * 15854900
*********************************************************************** 15855600
         SPACE 1                                               @G811PSS 15856300
DCMFNLMA DS    FL1                 MAX NUMBER LINES IN MSG AREA WHEN   X15857000
                                   IN FULL CAPABILITY MODE     @G811PSS 15857700
DCMMNLMA DS    FL1                 MAX NUMBER LINES IN MSG AREA WHEN   X15858400
                                   IN MESSAGE STREAM MODE      @G811PSS 15859100
DCMDNLMA DS    FL1                 MAX NUMBER LINES IN MSG AREA WHEN   X15859800
                                   IN STATUS DISPLAY MODE      @G811PSS 15860500
DCMENTL1 DS    FL1                 LINE NUMBER -1 OF 1ST LINE IN ENTRY X15861200
                                   AREA                        @G811PSS 15861900
DCMENTL2 DS    FL1                 LINE NUMBER -1 OF 2ND LINE IN ENTRY X15862600
                                   AREA                        @G811PSS 15863300
DCMINLNM DS    FL1                 LINE NUMBER-1 OF INSTR LINE @G860PSS 15863700
         DS    FL2                 RESERVED                    @G860PSS 15864100
DCMFENRC DS    XL2                 ADDR OF 2ND LINE IN ENTRY AREA IN   X15864700
                                   ROW-COLUMN FORMAT           @G811PSS 15865400
DCMENTPO DS    H                   OFFSET OF 1ST CHAR IN ENTRY AREA    X15866100
                                                               @G811PSS 15866800
DCMSCRW  DS    H                   WIDTH OF SCREEN             @G860PSS 15867100
DCMLENTY DS    H                   LENGTH OF ENTRY AREA            @D1C 15867400
         DS    1F                  RESERVED                    @G860PSS 15867700
         SPACE 1                                               @G811PSS 15868200
*********************************************************************** 15868900
*                                                                  @02C 15869600
*        Last command retrieve buffer pointers.                    @02C 15870300
*                                                                  @02C 15871000
*********************************************************************** 15871700
         SPACE 1                                                   @02C 15871800
DCMRBUFC DS    A                   Pointer to next command to be       X15871900
                                   executed by the enter function  @02A 15872000
DCMRBUFA DS    A                   Pointer to last command retrieve    X15872100
                                   buffer                          @02A 15872200
DCMRBUFR DS    A                   Pointer to next entry in last       X15872300
                                   command buffer to be retrieved  @02A 15872400
DCMRBUFE DS    A                   Pointer to next entry in last       X15872500
                                   command buffer to be copied into    X15872600
                                                                   @02A 15872700
DCMRBFRC DS    A                   Pointer to current entry in last    X15872800
                                   command buffer used for retrieve    X15872900
                                   function                        @02A 15873000
         DS    CL108               Reserved                        @02C 15873200
         EJECT                                                          15874500
*********************************************************************** 15875200
*                                                                     * 15875900
*        SAVE AREAS                                            @G811PSS 15876600
*                                                                     * 15877300
*********************************************************************** 15878000
         SPACE 1                                               @G811PSS 15878700
DCMTLEN  DS    H                   TDCM LENGTH                     @D1A 15879800
         DS    H                   PADDING FOR LENGTH              @D1M 15880900
DCMAIDSV DS    XL6                 SAVE AREA FOR AID FROM RMI  @G811PSS 15882200
         DS    H                   RESERVED                    @G811PSS 15882900
DCMTRDCM DS    A                   POINTER TO RDCM             @G860P2G 15883300
DCMNXTOR DS    A                   ADDR OF NEXT ADJUNCT EXTENDED ORDER X15883400
                                                               @G860PSS 15883500
DCMCROW  DS    XL1                 CURRENT ROW NUMBER - 1      @G860PSS 15883600
DCMCCOL  DS    XL1                 CURRENT COL NUMBER - 1      @G860PSS 15883700
DCMMFRMF DS    XL1                 FULL CAPABILITY MFORM VALUE     @L5C 15883800
DCMMFRFT EQU   X'80'               DISPLAY TIME STAMP              @L5A 15883900
DCMMFRFJ EQU   X'40'               DISPLAY JOB NAME                @L5A 15884000
DCMMFRFS EQU   X'20'               DISPLAY SYSTEM NAME             @L5A 15884100
DCMMFRFX EQU   X'10'               DON'T DISPLAY SYSTEM NAME AND JOB   X15884200
                                   NAME                            @LAA 15884300
DCMDELFC DS    CL2                 FULL CAPABILITY DEL VALUE       @L2A 15884400
DCMCONFC DS    CL1                 FULL CAPABILITY CON VALUE       @L2A 15884500
DCMSEGFC DS    FL1                 FULL CAPABILITY SEG VALUE       @L2A 15884600
DCMRNUMF DS    FL1                 FULL CAPABILITY RNUM VALUE      @L2A 15884700
DCMRTMEF DS    H                   FULL CAPABILITY RTME VALUE IN       X15884800
                                   TENTHS OF SECONDS               @LCC 15884900
DCMMFRMM DS    XL1                 MESSAGE STREAM MFORM VALUE      @L5C 15885000
DCMMFRMT EQU   X'80'               DISPLAY TIME STAMP              @L5A 15885100
DCMMFRMJ EQU   X'40'               DISPLAY JOB NAME                @L5A 15885200
DCMMFRMS EQU   X'20'               DISPLAY SYSTEM NAME             @L5A 15885300
DCMMFRMX EQU   X'10'               DON'T DISPLAY SYSTEM NAME AND JOB   X15885400
                                   NAME                            @LAA 15885500
DCMDELMS DS    CL2                 MESSAGE STREAM DEL VALUE        @L2A 15885600
DCMCONMS DS    CL1                 MESSAGE STREAM CON VALUE        @L2A 15885700
DCMSEGMS DS    FL1                 MESSAGE STREAM SEG VALUE        @L2A 15885800
DCMRNUMM DS    FL1                 MESSAGE STREAM RNUM VALUE       @L2A 15885900
DCMRTMEM DS    H                   MESSAGE STREAM RTME VALUE IN TENTHS X15886000
                                   OF SECONDS                      @LCC 15886100
DCMQALEN DS    H                   LENGTH OF AREA TO HOLD READ         X15886200
                                   PARTITION QUERY                 @D1A 15886300
DCMSTOFF DS    H                   START OFFSET OF MULTIPLE COMMAND    X15886400
                                   PARSE                           @L6A 15886500
DCMNDOFF DS    H                   END OFFSET OF MULTIPLE COMMAND      X15886600
                                   TEXT                            @L6A 15886700
         DS    2F                  RESERVED                        @L6C 15886800
         SPACE 1                                                   @L3A 15886900
*********************************************************************** 15887000
*                                                                     * 15887100
* THE DCMBUFER WORK AREA IS TO BE USED ON A MODULE-BY-MODULE BASIS    * 15887200
* ONLY.  THIS AREA MUST NOT BE USED AS A COMMUNICATION MEDIUM. DOING  * 15887300
* SO WOULD DEFEAT THE PURPOSE OF GIVING THE DIDOCS MODULES A SAFE     * 15887500
* WORK AREA .                                                      @L3A 15887700
*                                                                     * 15887900
*********************************************************************** 15888100
DCMBUFER DS    CL168               MODULE WORK AREA                     15888200
         SPACE 1                                                        15888300
*********************************************************************** 15888400
*                                                                     * 15888500
*        MCS LOGON COMMUNICATIONS FIELDS                           @L8A 15888600
*                                                                     * 15888700
*********************************************************************** 15888800
         SPACE 1                                                   @L8A 15888900
DCMBFLGS DS    BL1                 MCS LOGON COMMUNICATIONS BYTE   @L8A 15889000
DCMWLGPR EQU   X'80'               GENERATE LOGON PROMPT           @L8A 15889100
DCMDIDLG EQU   X'40'               DIDOCS GENERATED LOGON          @L8A 15889200
DCMLGMSG EQU   X'20'               WRITE LOGON MESSAGE             @L8A 15889300
DCMICUPW EQU   X'10'               INSERT CURSER UNDER PASSWORD    @L8A 15889400
DCMICUGP EQU   X'08'               INSERT CURSER UNDER GROUP       @L8A 15889500
DCMICUSC EQU   X'04'               INSERT CURSER UNDER SECCLASS    @L8A 15889600
DCMEMTYP DS    CL1                 ERROR MESSAGE TYPE              @L8A 15889700
DCMUSRID DS    CL8                 USERID ENTERED WITH LOGON       @L8A 15889800
DCMPWORD DS    CL26                PASSWORD ENTERED WITH LOGON     @L8A 15889900
DCMGROUP DS    CL8                 GROUP ENTERED WITH LOGON        @L8A 15890000
DCMSCCLS DS    CL8                 SECCLASS ENTERED WITH LOGON     @L8A 15890100
         SPACE 1                                                   @L3A 15890200
*********************************************************************** 15890300
*                                                                 @LBA* 15890900
* THE DCMWORK WORK AREA IS TO BE USED ON A MODULE-BY-MODULE BASIS @LBA* 15891000
* ONLY.  THIS AREA MUST NOT BE USED AS A COMMUNICATION MEDIUM.    @LBA* 15891100
* DOING SO WOULD DEFEAT THE PURPOSE OF GIVING THE DIDOCS MODULES  @LBA* 15891200
* A SAFE WORK AREA.                                               @LBA* 15891300
*                                                                 @LBA* 15891400
*********************************************************************** 15891500
DCMWORK  EQU   *                   MODULE WORK AREA                @LBA 15891600
DCMWORKA DS    F                   WORK AREA A                     @LBA 15891700
DCMWORKB DS    F                   WORK AREA B                     @LBA 15891800
DCMWORKC DS    F                   WORK AREA C                     @LBA 15891900
DCMWORKD DS    F                   WORK AREA D                     @LBA 15892000
*********************************************************************** 15892100
*                                                                 @LEA* 15892200
* THE DCMCSNM STORES THE COMMAND ASSOCIATION FOR MCS CONSOLE      @LEA* 15892300
*                                                                 @LEA* 15892400
*********************************************************************** 15892500
DCMCSNM  DS    CL8                 COMMAND ASSOCIATION             @LEA 15892600
DCMEND   DS    0C                  END OF TDCM                     @L3M 15892700
         EJECT                                                          15892800
*********************************************************************** 15892900
*                                                                     * 15893000
*        MAPPING OF A SCREEN CONTROL TABLE (SCT) ENTRY         @G811PSS 15893100
*                                                                     * 15893200
*        FIRST BYTE OF AN SCT                                  @G811PSS 15893400
*                                                                     * 15894100
*********************************************************************** 15894800
         SPACE 1                                               @G811PSS 15895500
DCMSCTA  DSECT                     SCT ENTRY                       @L3A 15897000
DCMSCTA1 DS    B                   FIRST BYTE OF AN SCT            @L3A 15898500
DCMMSGOR EQU   X'80'               WTOR MESSAGE DISPLAYED      @ZA66980 15900000
DCMMSGIN EQU   X'40'               MESSAGE DISPLAYED IN LINE            15950002
DCMMSGCN EQU   X'20'               MESSAGE CONTINUED ON NEXT LINE       16000002
DCMMSGJK EQU   X'10'               TO WRITE OUT-OF-LINE DISPLAY FROM    16050002
*                                  MAY CONTAIN JUNK (SDS INTERFACE 2)   16100002
DCMMSGAD EQU   X'08'               MESSAGE CAN BE DELETED AUTOMATICALLY 16150002
DCMMSGRD EQU   X'04'               REQUEST HAS SPECIFIED MSG BE REMOVED 16200002
DCMMSGIF EQU   X'02'               INFORMATIONAL MESSAGE IN LINE        16250002
DCMMSGST EQU   X'01'               END OF TABLE INDICATOR               16300002
         SPACE 1                                               @G811PSS 16350000
*********************************************************************** 16377200
*                                                                     * 16404400
*        SECOND BYTE OF AN SCT                                 @G811PSS 16431600
*                                                                     * 16458800
*********************************************************************** 16486000
         SPACE 1                                               @G811PSS 16513200
DCMSCTA2 DS    B                   SECOND BYTE OF AN SCT           @L3A 16526800
DCMMSGAC EQU   X'80'               ACTION MESSAGE                       16540400
DCMMSGC7 EQU   X'40'               DESCRIPTOR CODE 7 MESSAGE            16567600
DCMMSGR2 EQU   X'20'               RESERVED - WAS DCMMSGDM         @L1A 16581200
DCMMSGUA EQU   X'10'               URGENT ATTENTION MESSAGE DISPLAYED  X16594800
                                   IN LINE                         @L1A 16608400
.* BIT DCMMSGAR DELETED BY SUPPORT G811PSS                     @G811PSS 16622000
DCMMSGEA EQU   X'08'               EVENTUAL ACTION MESSAGE DISPLAYED   X16648000
                                   IN LINE - WAS DCMMSGIR          @L1A 16674000
DCMMSGCT EQU   X'04'               THIS IS A CONTINUED LINE        @L3C 16700000
DCMMSGPP EQU   X'02'               ISSUED BY PROBLEM PROGRAM            16750002
DCMMSGCL EQU   X'01'               CONTROL LINE OF IN LINE MLWTO        16800002
         SPACE 1                                               @G811PSS 16802700
*********************************************************************** 16805400
*                                                                     * 16808100
*        THIRD BYTE OF AN SCT                                      @L3A 16810800
*                                                                     * 16813500
*********************************************************************** 16816200
         SPACE 1                                               @G811PSS 16818900
DCMSCTA3 DS    B                   THIRD BYTE OF AN SCT            @L3A 16821600
DCMSEPLN EQU   X'40'               Separator line is in this line  @D2A 16824000
         SPACE 1                                               @G811PSS 16824300
*********************************************************************** 16827000
*                                                                     * 16829700
*        FOURTH BYTE OF AN SCT                                     @L3A 16832400
*                                                                     * 16835100
*********************************************************************** 16837800
         SPACE 1                                               @G811PSS 16840500
DCMSCTA4 DS    B                   FOURTH BYTE OF AN SCT           @L3A 16843200
DCMMSGCO EQU   X'80'               MESSAGE COLOR CHANGED BY WTO EXIT   X16843500
                                                                   @LBA 16843800
DCMMSGHI EQU   X'40'               MESSAGE HIGHLIGHTING CHANGED BY WTO X16844100
                                   EXIT                            @LBA 16844400
DCMMSGIT EQU   X'20'               MESSAGE INTENSITY CHANGED BY WTO    X16844700
                                   EXIT                            @LBA 16845000
DCMSCTLN EQU   *-DCMSCTA           LENGTH OF ONE SCT ENTRY         @L3A 16845900
         SPACE 3                                                        16850000
*********************************************************************** 16860000
*                                                                     * 16870000
*    MAPPING OF A SECONDARY SCREEN CONTROL TABLE (SSCT) ENTRY  @G811PSS 16880000
*                                                                     * 16897500
*********************************************************************** 16915000
         SPACE 1                                               @G811PSS 16932500
DCMSCTC  DSECT                     SCT ENTRY                       @L3A 16938300
DCMSCTC1 DS    B                   FIRST BYTE OF AN SCT            @L3A 16944100
DCMSECCL EQU   X'80'               CONTROL LINE OF OUT OF LINE DISPLAY  16950002
DCMSECLL EQU   X'40'               LABEL LINE OF OUT OF LINE DISPLAY    17000002
DCMSECDL EQU   X'20'               DATA LINE OF OUT OF LINE DISPLAY     17050002
DCMSECBL EQU   X'10'               THIS LINE IS BLANKED                 17100002
DCMSECDD EQU   X'02'               LINE RESERVED FOR DYNAMIC DISPLAY    17150002
DCMSECST EQU   X'01'               END OF TABLE INDICATOR               17200002
         SPACE 1                                                   @L3A 17203200
*********************************************************************** 17208600
*                                                                     * 17214000
*        SECOND BYTE OF AN SSCT                                    @L3A 17219400
*                                                                     * 17224800
*********************************************************************** 17230200
         SPACE 1                                                   @L3A 17235600
DCMSCTC2 DS    B                   SECOND BYTE OF AN SSCT          @L3A 17241000
DCMSECLN EQU   *-DCMSCTC           LENGTH OF ONE SSCT ENTRY        @L3A 17246400
         EJECT                                                 @G860PSS 17251800
***************************************************************@G860PSS 17253600
*                                                              @G860PSS 17255400
*        MAP OF THE EXTENDED START EXTENDED FIELD ORDERS FOR 3270  @D1A 17256600
*        DEVICES                                                   @D1A 17257800
*                                                              @G860PSS 17259000
***************************************************************@G860PSS 17260800
         SPACE 1                                               @G860PSS 17262600
DCMORDER DSECT                                                 @G860PSS 17264400
DCMSBAO  DS    0XL3               SET BUFFER ADDRESS FIELD     @G860PSS 17266200
DCMSBA   DS    XL1                SET BUFFER ADDRESS ORDER     @G860PSS 17268000
DCMSBAA1 DS    XL1                SET BUFFER ADDRESS ROW ADDR  @G860PSS 17269800
DCMSBAA2 DS    XL1                SET BUFFER ADDRESS COL ADDR  @G860PSS 17271600
         SPACE 1                                               @G860PSS 17273400
DCMSFEO  DS    0XL8               START FIELD EXTENDED FIELD   @G860PSS 17275200
DCMSFE   DS    XL1                START FIELD EXTENDED ORDER   @G860PSS 17277000
DCMSFEN  DS    XL1                NUMBER OF TYPE/VALUE PAIRS WHICH     X17278800
                                  FOLLOW                       @G860PSS 17280600
DCMSFEFT DS    XL1                FIELD ATTRIBUTE TYPE         @G860PSS 17282400
DCMSFEFA DS    XL1                FIELD ATTRIBUTE VALUE        @G860PSS 17284200
DCMSFECT DS    XL1                COLOR ATTRIBUTE TYPE         @G860PSS 17286000
DCMSFECA DS    XL1                COLOR ATTRIBUTE VALUE        @G860PSS 17287800
DCMSFEHT DS    XL1                HIGHLIGHTING ATTRIBUTE TYPE  @G860PSS 17289600
DCMSFEHA DS    XL1                HIGHLIGHTING ATTRIBUTE VALUE @G860PSS 17291400
         SPACE 1                                               @G860PSS 17293200
DCMORDLN EQU   *-DCMORDER         LENGTH OF EXTENDED ORDER FIELDS      X17295000
                                                               @G860PSS 17296800
*********************************************************************** 17297000
*                                                                     * 17297200
*     MAP OF THE EXTENDED SET ATTRIBUTE ORDERS FOR 3270 DEVICES    @D1A 17297400
*                                                                     * 17297600
*********************************************************************** 17297800
         ORG      DCMSFEO                                          @D1A 17298000
DCMSAO   DS       0XL7             SET ATTRIBUTE FIELD             @D1A 17298200
DCMSA1   DS       XL1              SET ATTRIBUTE ORDER             @D1A 17298400
DCMSAHT  DS       XL1              HIGHLIGHTING ATTRIBUTE TYPE     @D1A 17298600
DCMSAHA  DS       XL1              HIGHLIGHTING ATTRIBUTE VALUE    @D1A 17298800
DCMSADAT DS       CL1              DATA TO HIGHLIGHT               @D1A 17299000
DCMSA2   DS       XL1              SET ATTRIBUTE ORDER             @D1A 17299200
DCMSARST DS       XL2              CHARACTER ATTRIBUTE RESET       @D1A 17299400
DCMSAOLN EQU      *-DCMORDER       LENGTH OF EXTENDED SA ORDER     @D1A 17299600
         ORG      ,                                                @D1A 17299800
         EJECT                                                     @L3A 17302200
*********************************************************************** 17304600
*                                                                     * 17307000
* MAP OF THE DOM INFORMATION.                                      @L3A 17309400
*                                                                     * 17311800
*********************************************************************** 17314200
         SPACE 1                                                   @L3A 17316600
         DSECT                                                     @L3A 17319000
DCMDOMEN DS    0CL18               MAP OF A DOM ENTRY              @L3A 17321400
DCMDTCB  DS    A                   JOBSTEP TCB ADDRESS             @L3A 17323800
DCMDOMID DS    0CL4                FOUR BYTE DOM ID                @L3A 17326200
DCMDSYID DS    FL1                 SYSTEM ID                       @L3A 17328600
DCMDMID  DS    FL3                 DOM ID                          @L3A 17331000
DCMDTKAS DS    0CL6                TOKEN AND ASID                  @L3A 17333400
DCMDTOKN DS    FL4                 DOM TOKEN                       @L3A 17335800
DCMDASID DS    H                   ASID                            @L3A 17338200
DCMDRSVD DS    CL4                 RESERVED                        @L3A 17340600
DCMDOMLN EQU   *-DCMDOMEN          LENGTH OF A DCM DOM ENTRY       @L3A 17343000
         EJECT                                                     @02A 17343600
*********************************************************************** 17344200
*                                                                  @02A 17344800
* Map of an entry in the last command retrieve buffer.             @02A 17345400
*                                                                  @02A 17348600
*********************************************************************** 17348700
         SPACE 1                                                   @02A 17348800
         DSECT                                                     @02A 17348900
         DS    0F                  Force fullword boundary         @02A 17349000
DCMRBUF  DS    0CL136              Map of a command retrieve buffer    X17349100
                                                                   @02A 17349600
DCMRBUFF DS    A                   Pointer to next command retrieve    X17350200
                                   buffer entry                    @02A 17350800
DCMRBUFB DS    A                   Pointer to previous command         X17351400
                                   retrieve buffer entry           @02A 17352000
DCMRBUFT DS    CL126               Command text                    @02A 17352400
         DS    CL2                 Reserved                        @02A 17352800
DCMRBFLN EQU   *-DCMRBUF           Length of a command retrieve buffer X17353200
                                   entry                           @02A 17353800
         SPACE 1                                                   @LBA 17354400
*********************************************************************** 17355000
*                                                                 @LBA* 17355600
*        MAPPING OF A MESSAGE CONTROL TABLE (MCT) ENTRY           @LBA* 17356200
*                                                                 @LBA* 17356800
*        FIRST BYTE OF A MCT                                      @LBA* 17357400
*                                                                 @LBA* 17358000
*********************************************************************** 17358600
         SPACE 1                                                   @LBA 17359200
DCMMCTEN DSECT                     MCT ENTRY                       @LBA 17359800
DCMMCTCO DS    B                   FIRST BYTE OF A MCT             @LBA 17360400
DCMBLUE  EQU   X'80'               MESSAGE COLOR IS BLUE           @LBA 17361000
DCMRED   EQU   X'40'               MESSAGE COLOR IS RED            @LBA 17361600
DCMPINK  EQU   X'20'               MESSAGE COLOR IS PINK           @LBA 17362200
DCMGREEN EQU   X'10'               MESSAGE COLOR IS GREEN          @LBA 17362800
DCMTURQ  EQU   X'08'               MESSAGE COLOR IS TURQUOISE      @LBA 17363400
DCMYELOW EQU   X'04'               MESSAGE COLOR IS YELLOW         @LBA 17364000
DCMWHITE EQU   X'02'               MESSAGE COLOR IS WHITE          @LBA 17364600
DCMMCTST EQU   X'01'               TABLE STOPPER                   @LBA 17365200
         SPACE 1                                                   @LBA 17365800
*********************************************************************** 17366400
*                                                                 @LBA* 17367000
*        SECOND BYTE OF A MCT                                     @LBA* 17367600
*                                                                 @LBA* 17368200
*********************************************************************** 17368800
         SPACE 1                                                   @LBA 17369400
DCMMCTHI DS    B                   SECOND BYTE OF A MCT            @LBA 17370000
DCMHNONE EQU   X'80'               NO HIGHLIGHTING IN EFFECT       @LBA 17370600
DCMBLINK EQU   X'40'               BLINKING HIGHLIGHT              @LBA 17371200
DCMRVIDO EQU   X'20'               REVERSE VIDEO HIGHLIGHT         @LBA 17371800
DCMUNDER EQU   X'10'               UNDERLINE HIGHLIGHT             @LBA 17372400
         SPACE 1                                                   @LBA 17373000
*********************************************************************** 17373600
*                                                                 @LBA* 17374200
*        THIRD BYTE OF A MCT                                      @LBA* 17374800
*                                                                 @LBA* 17375400
*********************************************************************** 17376000
         SPACE 1                                                   @LBA 17376600
DCMMCTIN DS    B                   THIRD BYTE OF A MCT             @LBA 17377200
DCMINORM EQU   X'80'               NORMAL INTENSITY                @LBA 17377800
DCMIHIGH EQU   X'40'               HIGH INTENSITY                  @LBA 17378400
         SPACE 1                                                   @LBA 17379000
*********************************************************************** 17379600
*                                                                 @LBA* 17380200
*        FOURTH BYTE OF A MCT                                     @LBA* 17380800
*                                                                 @LBA* 17381400
*********************************************************************** 17382000
         SPACE 1                                                   @LBA 17382600
DCMMCTRV DS    B                   FOURTH BYTE OF A MCT            @LBA 17383200
         SPACE 1                                                   @LBA 17383800
DCMMCTLN EQU   *-DCMMCTEN          LENGTH OF ONE MCT ENTRY         @LBA 17384400
         SPACE 3                                                   @LBA 17385000
         MEND  , */                                                     17385600
*%DCMPBSL  :  ;                                                         17386200
*@EJECT;                                                                17392800
*/********************************************************************/ 17435600
*/*                                                                  */ 17478400
*/*           WORK AND SAVE AREAS                                    */ 17521200
*/*                                                                  */ 17564000
*/********************************************************************/ 17606800
*DECLARE                                                                17650000
*  1 DCMSTRT  BASED(DCMSTPTR),                                          17700000
*   2 DCMOACRO  CHAR(4),                 /* CNTL BLK ACRONYM 'TDCM'     17750000
*                                                                @D1C*/ 17800000
*   2 DCMFLG1     CHAR(1),               /* TDCM AREA INDICATORS     */ 17850000
*    3 *        BIT(1),                  /* RESERVED                 */ 18250002
*    3 *        BIT(1),                  /* RESERVED                 */ 18300002
*    3 *        BIT(1),                  /* RESERVED                 */ 18350002
*    3 *        BIT(1),                  /* RESERVED                 */ 18400002
*    3 *        BIT(1),                  /* RESERVED                 */ 18450002
*    3 *        BIT(1),                  /* RESERVED                 */ 18500002
*    3 DCMOUTPT BIT(1),                  /* TDCM UPDATED FOR OUTPUT     18550000
*                                           ONLY                     */ 18600002
*    3 *        BIT(1),                  /* RESERVED                 */ 18650002
*   2 DCMATI      CHAR(1),               /* SAVED UCB ATTN INDEX     */ 18700000
*   2 *           CHAR(2),               /* RESERVED                 */ 18750000
*   2 DCMWTINT    PTR(31),               /* DCMWTINT INITIAL VALUE   */ 19050002
*   2 DCMLNCNT    FIXED(15),             /* NUMBER OF LINES TO BLANK */ 19060002
*   2 DCMLNNUM    CHAR(1),               /* FIRST LINE TO BLANK      */ 19070002
*   2 DCMGFLG     FIXED(8),              /* HOLDMODE INDICATORS  @L9C*/ 19081400
*    3 DCMHOLD    BIT(1),                /* CONSOLE IS IN HOLDMODE      19092800
*                                                                @L9A*/ 19104200
*    3 DCMMWISS   BIT(1),                /* MESSAGE IEE159I HAS BEEN    19115600
*                                           ISSUED               @L9A*/ 19127000
*    3 *          BIT(6),                /* RESERVED             @L9A*/ 19138400
*   2 DCMPACK     FIXED(31),             /* AREA TO PLACE NUMBER FOR    19150002
*                                           PACKING                  */ 19200002
*   2 DCMCVBIN    FIXED(31),             /* AREA FOR CONVERSION TO      19250002
*                                           BINARY                   */ 19300002
*@SPACE(1);                                                             19320000
*/********************************************************************/ 19342500
*/*                                                                  */ 19365000
*/*           TIMER COMMUNICATION FIELD                      @G811PSS*/ 19387500
*/*                                                                  */ 19410000
*/********************************************************************/ 19430000
*   2 DCMTIMES    CHAR(1),               /* TIME RTNS INDICATOR BYTE */ 19450000
*    3 DCMTIMER BIT(1),                  /* TIME ELAPSED FOR THIS       19550002
*                                           DISPLAY                  */ 19600002
*    3 DCMOPTTI BIT(1),                  /* OPTIONS TO TI RTN        */ 19650002
*    3 *        BIT(1),                  /* RESERVED                 */ 19700002
*    3 DCMOTTMM BIT(1),                  /* OPTIONS OR TI RTNS TO       19750002
*                                           MSG MODULE               */ 19800002
*    3 *        BIT(1),                  /* RESERVED                 */ 19850002
*    3 DCMTASYN BIT(1),                  /* TIMER SET FOR ASYNC         19900002
*                                           ERROR MSG                */ 19950002
*    3 DCMOCTTI BIT(1),                  /* OPEN-CLOSE TO TI RTN     */ 20000002
*    3 DCMRMTTI BIT(1),                  /* ROLL MODE TO TIMER          20050002
*                                           ROUTINE                  */ 20100002
*@EJECT;                                                                20150000
*/********************************************************************/ 20157700
*/*                                                                  */ 20165400
*/*           CONTROL BLOCK VERSION IDENTIFICATION           @G860P2G*/ 20173100
*/*                                                                  */ 20180800
*/********************************************************************/ 20188500
*   2 DCMTVERN    FIXED(8),              /* CONTROL BLOCK VERSION       20196200
*                                                            @G860P2G*/ 20203900
* @SPACE(1);                             /*                  @G811PSS*/ 20212200
*   2 *           FIXED(15),             /* RESERVED             @D1C*/ 20258800
* @SPACE(1);                             /*                  @G811PSS*/ 20305500
*/********************************************************************/ 20336600
*/*                                                                  */ 20367700
*/*           ADDRESS TABLE                                  @G811PSS*/ 20398800
*/*                                                                  */ 20430000
*/********************************************************************/ 20470000
*   2 *           PTR(31),               /* RESERVED             @L3C*/ 20520000
*   2 DCMDOMPK    PTR(31),               /* ADDRESS OF FIRST DOM        20650002
*                                           NUMBER                   */ 20700002
*   2 DCMAMTAB    PTR(31),               /* ADDRESS OF FIRST SCT        20750002
*                                           ENTRY                    */ 20800002
*   2 DCMADSEC    PTR(31),               /* ADDRESS OF FIRST SSCT       20850002
*                                           ENTRY                    */ 20900002
*   2 DCMADDRL    PTR(31),               /* ADDRESS OF LAST SCT         20950002
*                                           ENTRY                    */ 21000002
*   2 DCMASCRN    PTR(31),               /* POINTER TO SCREEN IMAGE     21050002
*                                           BUFFER                   */ 21100002
*   2 DCMLSCRN    PTR(31),               /* POINTER TO LAST BUFFER      21150002
*                                           LINE                     */ 21200002
*   2 DCMWTBUF    PTR(31),               /* SCREEN LENGTH POINTER    */ 21250002
*   2 DCMAINS     PTR(31),               /* POINTER TO INSTRUCTION      21300002
*                                           LINE                     */ 21350002
*   2 DCMAENTR    PTR(31),               /* POINTER TO ENTRY AREA    */ 21400002
*   2 DCMAWARN    PTR(31),               /* POINTER TO WARNING LINE  */ 21450002
*   2 DCMADCHP    PTR(31),               /* ADDRESS OF CHANNEL          21500002
*                                           PROGRAM AREA             */ 21550002
*   2 DCMPFKLN    PTR(31),               /* POINTER TO PFK LINE      */ 21600002
* @SPACE(1);                             /*                  @G811PSS*/ 21650000
*   2 DCMCXSVE    FIXED(31),             /* CXSA SAVE AREA           */ 21678500
*   2 DCMADOPN    PTR(31),               /* ADDRESS OF COMMAND          21707000
*                                           OPERAND                  */ 21735500
* @SPACE(1);                             /*                  @G811PSS*/ 21764000
*   2 DCMDSAV  (5) FIXED(31),            /* SAVE AND WORK AREA       */ 21792500
* @EJECT;                           /*                       @G811PSS*/ 21821000
*/********************************************************************/ 21850000
*/*                                                                  */ 21870000
*/*           INPUT BUFFER FOR ISSUING SVC 34 AND SVC 35             */ 21890000
*/*           FIELDS DCMWQEXP THROUGH DCMINPUT MUST REMAIN IN ORDER  */ 21900000
*/*                                                                  */ 21930000
*/********************************************************************/ 21950000
*   2 DCMWQEXP    FIXED(31),             /* ENSURE FULL WORD            22050002
*                                           BOUNDARY                 */ 22100002
*    3 DCMINLGN    FIXED(15),            /* FIELD FOR INPUT LENGTH   */ 22150002
*    3 DCMMCSFL    FIXED(15),            /* MCS FLAGS FIELD          */ 22200002
*   2 DCMINPUT     CHAR(128),            /* INPUT MESSAGE TEXT   @L4C*/ 22250000
* @SPACE(1);                             /*                  @G811PSS*/ 22260000
*/********************************************************************/ 22270000
*/*                                                                  */ 22280000
*/*           GENERAL LENGTH VALUES                          @G811PSS*/ 22290000
*/*                                                                  */ 22300000
*/********************************************************************/ 22310000
*   2 DCMLGNTH    FIXED(15),             /* LENGTH OF A LINE         */ 22400002
*   2 DCMBAINC    FIXED(15),             /* ADDRESS TO INSERT CURSOR */ 22450002
*   2 DCMSSCTL    FIXED(15),             /* LENGTH OF ONE SSCT ENTRY    22500000
*                                                                @L3A*/ 22550000
*   2 DCMBADLN    FIXED(15),             /* BUFFER ADDR TO BEGIN MSG    22600002
*                                           WRITE                    */ 22650002
*   2 DCMBYTCT    FIXED(15),             /* NUMBER OF BYTES TO WRITE */ 22700002
*   2 DCMADNUM    FIXED(15),             /* NEXT LINE NUMBER         */ 22750002
*   2 DCMAXLGN    FIXED(15),             /* MAXIMUM LINE LENGTH      */ 22800002
*   2 DCMMSGAL    FIXED(15),             /* NUMBER OF LINES IN          22850002
*                                           MESSAGE AREA             */ 22900002
*   2 DCMRMINC    FIXED(15),             /* INCREMENT INTO RMI       */ 22950002
*   2 DCMSCTCN    FIXED(15),             /* LENGTH OF ONE SCT ENTRY  */ 23000002
*   2 DCMCORLN    FIXED(15),             /* LENGTH OF TDCM LINE IN      23050000
*                                           CORE                     */ 23100002
*   2 *           FIXED(15),             /* TIME COUNTER             */ 23150002
*   2 DCMPFKNM    CHAR(1),               /* NUMBER OF KEY BEING         23200002
*                                           PROCESSED                */ 23250002
*   2 DCMPFKKN    CHAR(1),               /* LIST KEY NUMBER          */ 23300002
* @SPACE(1);                             /*                  @G811PSS*/ 23310000
*/********************************************************************/ 23320000
*/*                                                                  */ 23330000
*/*           VALUES FOR OPTIONS                             @G811PSS*/ 23340000
*/*                                                                  */ 23350000
*/********************************************************************/ 23360000
*   2 DCMDEL      CHAR(2),               /* DEL VALUE                */ 23400002
*   2 DCMCON      CHAR(1),               /* CON VALUE                */ 23450002
*   2 DCMSEG      PTR(8),                /* SEG VALUE                */ 23500002
*   2 DCMDL       PTR(8),                /* DISPLAY AREA OPTION      */ 23550002
*   2 DCMRNUM     PTR(8),                /* ROLL NUMBER VALUE        */ 23600002
*   2 DCMRTME     FIXED(15),             /* ROLL TIME VALUE IN TENTHS   23633300
*                                           OF SECONDS           @LCC*/ 23666600
* @EJECT;                                /*                  @G811PSS*/ 23700000
*/********************************************************************/ 23720000
*/*                                                                  */ 23740000
*/*           DEFAULT VALUES FOR OPTIONS                             */ 23760000
*/*                                                                  */ 23820000
*/********************************************************************/ 23860000
*   2 DCMSEGDF    PTR(8),                /* SEG DEFAULT              */ 23900000
*   2 DCMRNUMD    PTR(8),                /* RNUM DEFAULT             */ 23940000
*   2 DCMRTMED    FIXED(15),             /* RTME DEFAULT IN TENTHS OF   23990000
*                                           SECONDS              @LCC*/ 24040000
* @SPACE(1);                             /*                  @G811PSS*/ 24100000
*/********************************************************************/ 24100100
*/*                                                              @LBA*/ 24100400
*/*           MCT TABLE CONSTANTS                                @LBA*/ 24100500
*/*                                                              @LBA*/ 24100600
*/********************************************************************/ 24100700
*   2 DCMMCTCN    FIXED(15),             /* LENGTH OF ONE MCT ENTRY     24100800
*                                                                @LBA*/ 24100900
*   2 *           CHAR(3),               /* RESERVED             @LBC*/ 24101000
* @SPACE(1);                             /*                  @G811PSS*/ 24101100
*/********************************************************************/ 24101200
*/*                                                                  */ 24101300
*/*           COMMUNICATIONS AREAS                                   */ 24101400
*/*                                                                  */ 24101500
*/********************************************************************/ 24101600
*   2 DCMOPTST    CHAR(1),               /* STATUS OF SCREEN CONTROL    24101700
*                                           OPTIONS                  */ 24101800
*    3 DCMOPTVR BIT(1),                  /* DELETE VERIFICATION         24101900
*                                           CON=(Y=1,N=0)            */ 24102000
*    3 DCMOPTAD BIT(1),                  /* AUTOMATIC DELETION          24102100
*                                           DEL=(Y=1,N=0)            */ 24102200
*    3 DCMOPTSG BIT(1),                  /* DEFAULT SEGMENT             24102300
*                                           SPECIFIED  SEG=(0=0)     */ 24102400
*    3 DCMOPRLL BIT(1),                  /* Roll/Wrap mode?  (Y=1,      24102500
*                                           N=0)                 @LDC*/ 24102600
*    3 *        BIT(1),                  /* RESERVED                 */ 24102700
*    3 *        BIT(1),                  /* RESERVED                 */ 24102800
*    3 *        BIT(1),                  /* RESERVED                 */ 24102900
*    3 *        BIT(1),                  /* RESERVED                 */ 24103000
*   2 DCMCS       CHAR(1),               /* OPEN/CLOSE REQUEST       */ 24103100
*    3 DCMCSC   BIT(1),                  /* CLOSE REQUEST            */ 24103200
*    3 DCMCSO   BIT(1),                  /* OPEN REQUEST             */ 24103300
*    3 DCMISRPQ BIT(1),                  /* ISSUE READ PARTITION QUERY  24103400
*                                                                @D1A*/ 24103500
*    3 DCMRDRPQ BIT(1),                  /* READ RESULT OF READ         24103600
*                                           PARTITION QUERY      @D1A*/ 24103700
*    3 DCMRETIO BIT(1),                  /* RETURN TO I/O ROUTINE       24103800
*                                                                @D1A*/ 24103900
*    3 DCMSWAPT BIT(1),                  /* TDCM SWAP IS NEEDED  @D1A*/ 24104000
*    3 *        BIT(1),                  /* RESERVED                 */ 24104100
*    3 *        BIT(1),                  /* RESERVED                 */ 24104200
*   2 DCMUTILT    CHAR(1),               /* INTERNAL FLAGS   @G811PSS*/ 24104300
*    3 DCMUTILA BIT(1),                  /* THESE BITS ARE           */ 24104400
*    3 DCMUTILB BIT(1),                  /* INITIALIZED AND USED     */ 24104500
*    3 DCMUTILC BIT(1),                  /* SOLELY WITHIN            */ 24104600
*    3 DCMUTILD BIT(1),                  /* EACH MODULE              */ 24104700
*    3 DCMUTILE BIT(1),                  /* THEY ARE NEVER           */ 24104800
*    3 DCMUTILF BIT(1),                  /* USED FOR INTERFACE       */ 24104900
*    3 DCMTEST1 BIT(1),                  /* FOR TESTING              */ 24105000
*    3 DCMTEST2 BIT(1),                  /* FOR TESTING              */ 24105100
*   2 DCMDSTAT    CHAR(1),               /* CURRENT DISPLAY STATUS   */ 24105200
*    3 *        BIT(1),                  /* RESERVED                 */ 24105300
*    3 *        BIT(1),                  /* RESERVED                 */ 24105400
*    3 DCMDSTNM BIT(1),                  /* MESSAGES ARE NUMBERED    */ 24105500
*    3 DCMDSTNH BIT(1),                  /* MSGS NUMBERED - HOLD        24105600
*                                           OPTION                   */ 24105700
*    3 *        BIT(1),                  /* RESERVED - WAS DCMDSINR     24105800
*                                                                @L1A*/ 24105900
*    3 DCMDSAUT BIT(1),                  /* AUTOMATIC DELETION TRIED */ 24106000
*    3 *        BIT(1),                  /* RESERVED                 */ 24106100
*    3 *        BIT(1),                  /* RESERVED                 */ 24106200
* @SPACE(1);                             /*                  @G811PSS*/ 24106300
*/********************************************************************/ 24106400
*/*                                                                  */ 24106500
*/*           MCS INTERFACE FIELD                            @G811PSS*/ 24106600
*/*                                                                  */ 24106700
*/********************************************************************/ 24106800
*   2 DCMMCSST    CHAR(1),               /* MCS INTERFACE BYTE       */ 24106900
*    3 DCMDUSE  BIT(1),                 /* DIDOCS IN CONTROL @G811PSS*/ 24107000
*    3 *        BIT(1),                  /* RESERVED                 */ 24107100
*    3 *        BIT(1),                  /* RESERVED                 */ 24107200
*    3 *        BIT(1),                  /* RESERVED                 */ 24107300
*    3 *        BIT(1),                  /* RESERVED                 */ 24107400
*    3 DCMOOMSS BIT(1),                  /* MESSAGE STREAM ENTRY     */ 24107500
*    3 *        BIT(1),                  /* RESERVED                 */ 24107600
*    3 DCMOOSDS BIT(1),                  /* STATUS DISPLAY ENTRY     */ 24107700
* @SPACE(1);                             /*                  @G811PSS*/ 24107800
*/********************************************************************/ 24107900
*/*                                                                  */ 24108000
*/*           UNIQUE INTERFACE FIELD                         @G811PSS*/ 24108100
*/*                                                                  */ 24108200
*/********************************************************************/ 24108300
*   2 DCMIOUNQ    CHAR(1),               /* UNIQUE IO BYTE           */ 24108400
*    3 *        BIT(1),                  /* RESERVED WAS DCMIO226       24108500
*                                                                @L3C*/ 24108600
*    3 *        BIT(1),                  /* RESERVED             @D1C*/ 24108700
*    3 DCMFRSCN BIT(1),                  /* PUT OUTPUT IN HOLD MODE  */ 24108800
*    3 DCMRDARM BIT(1),                  /* PERFORM READ AFTER RMI   */ 24108900
*    3 DCMW2250 BIT(1),                  /* DEVICE HAS LIGHT PEN        24109000
*                                                            @G811PSS*/ 24109100
*    3 DCMINNOR BIT(1),                  /* NORMAL INSTRUCTION LINE  */ 24109200
*    3 DCMINERR BIT(1),                  /* ERROR INSTRUCTION LINE   */ 24109300
*    3 DCMEWASP BIT(1),                  /* ERASE/WRITE ALTERNATE       24109400
*                                           COMMAND SUPPORTED           24109500
*                                                            @G811PSS*/ 24109600
* @EJECT;                           /*                       @G811PSS*/ 24109700
*/********************************************************************/ 24109800
*/*                                                                  */ 24109900
*/*           I/O COMMUNICATION FIELDS                       @G811PSS*/ 24110000
*/*                                                                  */ 24110100
*/********************************************************************/ 24110200
*   2 DCMIOCM1    CHAR(1),               /* IO COMMUNICATIONS BYTE 1 */ 24110300
*    3 DCMDORMI BIT(1),                  /* ISSUE RMI                */ 24110400
*    3 DCMSOUND BIT(1),                  /* SOUND ALARM              */ 24110500
*    3 DCMWRWRN BIT(1),                  /* WRITE WARNING LINE       */ 24110600
*    3 DCMWRMSG BIT(1),                  /* WRITE FULL MESSAGE AREA  */ 24110700
*    3 DCMWRPAR BIT(1),                  /* WRITE PARTIAL MESSAGE       24110800
*                                           AREA                     */ 24110900
*    3 DCMWRINS BIT(1),                  /* WRITE INSTRUCTION LINE   */ 24111000
*    3 DCMWRENT BIT(1),                  /* WRITE ENTRY AREA         */ 24111100
*    3 DCMINSC  BIT(1),                  /* INSERT CURSOR            */ 24111200
*   2 DCMIOCM2    CHAR(1),               /* IO COMMUNICATIONS BYTE 2 */ 24111300
*    3 DCMBLENT BIT(1),                  /* BLANK ENTRY AREA         */ 24111400
*    3 DCMBLWRL BIT(1),                  /* BLANK LEFT HALF WARNING     24111500
*                                           LINE                     */ 24111600
*    3 DCMBLWRR BIT(1),                  /* BLANK RIGHT HALF WARNING    24111700
*                                           LINE                     */ 24111800
*    3 DCMINSSH BIT(1),                  /* INIT AND SHIFT              24111900
*                                           INSTRUCTION LINE         */ 24112000
*    3 DCMWINFD BIT(1),                  /* WRITE INFORMATIONAL         24112100
*                                           DISPLAY                  */ 24112200
*    3 DCMERASE BIT(1),                  /* PERFORM ERASE            */ 24112300
*    3 DCMIOCRD BIT(1),                  /* PERFORM READ                24112400
*                                                                @L3C*/ 24112500
*    3 DCMWRASY BIT(1),                  /* WRITE ASYNC ERROR MSG TO    24112600
*                                           MID-SCREEN               */ 24112700
*   2 DCMIOCM3    CHAR(1),               /* IO COMMUNICATIONS BYTE 3 */ 24112800
*    3 DCMOPRMI BIT(1),                  /* RMI AFTER OPEN TO UNLOCK    24112900
*                                           KEYBOARD                 */ 24113000
*    3 DCMSSRG  BIT(1),                  /* SUPPRESS START              24113100
*                                           REGENERATION             */ 24113200
*    3 DCMEWAND BIT(1),                  /* ERASE/WRITE ALTERNATE       24113300
*                                           COMMAND NEEDED   @G811PSS*/ 24113400
*    3 DCMWRPFK BIT(1),                  /* TDCM WRITE PFK AREA      */ 24113500
*    3 DCMPFKAT BIT(1),                  /* PFK ATTENTION            */ 24113600
*    3 DCMRDPFK BIT(1),                  /* PFK AREA READ            */ 24113700
*    3 DCMCQUED BIT(1),                  /* MULTIPLE COMMANDS QUEUED    24113800
*                                                                @L6C*/ 24113900
*    3 DCMKPROC BIT(1),                  /* PFK being proecessed        24114000
*                                                                @02C*/ 24114100
* @SPACE(1);                             /*                  @G811PSS*/ 24114200
*   2 DCMLINEN    CHAR(1),               /* LINE NUMBER TO BEGIN        24114300
*                                           WRITE                    */ 24114400
*   2 DCMCULNO    CHAR(1),               /* LINE IN ENTRY AREA TO       24114500
*                                           INSERT CURSOR            */ 24114600
*   2 DCMPOSCU    CHAR(1),               /* POSITION TO INSERT          24114700
*                                           CURSOR                   */ 24114800
* @EJECT;                                /*                  @G811PSS*/ 24114900
*/********************************************************************/ 24115000
*/*                                                                  */ 24115100
*/*           ASYNCHRONOUS ERROR COMMUNICATIONS FIELD        @G811PSS*/ 24115200
*/*                                                                  */ 24115300
*/********************************************************************/ 24115400
*   2 DCMASYNC    CHAR(1),               /* ASYN ERROR                  24115500
*                                           COMMUNICATIONS/RETRY        24115600
*                                           BYTE                     */ 24115700
*    3 *        BIT(1),                  /* RESERVED                 */ 24115800
*    3 DCMASDA  BIT(1),                  /* DATA CHECK RETRY BIT        24115900
*                                                            @G811PSS*/ 24116000
*    3 DCMASIN  BIT(1),                  /* INVALID BUFFER ADDR CHECK   24116100
*                                           RETRY BIT        @G811PSS*/ 24116200
*    3 DCMASBA  BIT(1),                  /* BUFFER ADDR PARITY CHECK    24116300
*                                           RETRY BIT        @G811PSS*/ 24116400
*    3 DCMASEWA BIT(1),                  /* PERMANENT ERROR ON EWA      24116500
*                                           DEVICE RETRIED   @G811PSS*/ 24116600
*    3 *        BIT(1),                  /* RESERVED                 */ 24116700
*    3 *        BIT(1),                  /* RESERVED                 */ 24116800
*    3 *        BIT(1),                  /* RESERVED                 */ 24116900
*/********************************************************************/ 24117000
*/*                                                                  */ 24117100
*/*           COMMUNICATION FIELDS                           @G811PSS*/ 24117200
*/*                                                                  */ 24117300
*/********************************************************************/ 24117400
*   2 DCMCOM1     CHAR(1),               /* COMMUNICATIONS BYTE      */ 24117500
*    3 DCMLPENT BIT(1),                  /* ENTER BY LP OR CURSOR    */ 24117600
*    3 DCMIOPRD BIT(1),                  /* READ PERFORMED           */ 24117700
*    3 DCMCOMRM BIT(1),                  /* RMI PERFORMED            */ 24117800
*    3 DCMCOMAU BIT(1),                  /* PERFORM AUTO DELETE      */ 24117900
*    3 DCMCOMRD BIT(1),                  /* PERFORM REGULAR DELETE   */ 24118000
*    3 DCMCOMNM BIT(1),                  /* NUMBER MESSAGES          */ 24118100
*    3 DCMCLEAR BIT(1),                  /* CLEAR KEY WAS PRESSED       24118200
*                                                            @G811PSS*/ 24118300
*    3 DCMCANCL BIT(1),                  /* INDICATE CANCEL TO          24118400
*                                           COMMAND ROUTINE          */ 24118500
*   2 DCMCOM2     CHAR(1),               /* COMMUNICATIONS BYTE      */ 24118600
*    3 DCMCM2I  BIT(1),                  /* INPUT TO BE PROCESSED    */ 24118700
*    3 DCMSPLIT BIT(1),                  /* MSG TO BE SPLIT          */ 24118800
*    3 DCMCOMAR BIT(1),                  /* ACCEPTED REPLY           */ 24118900
*    3 DCMREPLC BIT(1),                  /* REPEAT LAST COMMAND KEY     24119000
*                                           (PA1) PRESSED    @G811PSS*/ 24119100
*    3 DCMERPF  BIT(1),                  /* ERASE PERF-PROC CAN NOW     24119200
*                                           CLOSE DEVICE             */ 24119300
*    3 DCMCMIN5 BIT(1),                  /* RETURN TO INTER. 5 FOR      24119400
*                                           BLNK                     */ 24119500
*    3 DCMCBLNK BIT(1),                  /* BLANKING REQUIRED        */ 24119600
*    3 DCMAE    BIT(1),                  /* CLEANUP FOR ASY ERROR    */ 24119700
*   2 DCMCOM3     CHAR(1),               /* COMMUNICATIONS BYTE      */ 24119800
*    3 DCMCDSP3 BIT(1),                  /* DISPLAY 3 COMPLETED WORK */ 24119900
*    3 DCMRTPFK BIT(1),                  /* RETURN TO PFK ROUTINE    */ 24120000
*    3 DCMVLPFK BIT(1),                  /* VERIFYING LAST COMMAND   */ 24120100
*    3 DCMXINT1 BIT(1),                  /* ENTRY FOR INTERFACE 1       24120200
*                                           ROUTINE                  */ 24120300
*    3 DCMOLUNV BIT(1),                  /* O-O-L MSG CAUSED UNVIEW.    24120400
*                                           MSG.                     */ 24120500
*    3 *        BIT(1),                  /* RESERVED             @L4C*/ 24120600
*    3 DCMOLHLD BIT(1),                  /* OUT OF LINE MESSAGES HELD*/ 24120700
*    3 DCMCMIN7 BIT(1),                  /* RETURN TO INTER. 7 FOR      24120800
*                                           BLANKING                 */ 24120900
* @EJECT;                           /*                       @G811PSS*/ 24121000
*/********************************************************************/ 24121100
*/*                                                                  */ 24121200
*/*           MESSAGE MODULES COMMUNICATION FIELDS           @G811PSS*/ 24121300
*/*                                                                  */ 24121400
*/********************************************************************/ 24121500
*   2 DCMCMSG1    CHAR(1),               /* MSG MODULE                  24121600
*                                           COMMUNICATIONS BYTE 1    */ 24121700
*    3 DCMMSGWT BIT(1),                  /* MOVE IN MESSAGE WAITING  */ 24121800
*    3 DCMUNMSG BIT(1),                  /* MOVE IN UNVIEWABLE          24121900
*                                           MESSAGE                  */ 24122000
*    3 DCMSTEX  BIT(1),                  /* MOVE IN STATUS EXISTS    */ 24122100
*    3 DCMCHOPT BIT(1),                  /* MOVE IN CHANGE OPTIONS   */ 24122200
*    3 DCMELONG BIT(1),                  /* MOVE IN ENTRY TOO LONG   */ 24122300
*    3 DCMWRCDL BIT(1),                  /* MOVE IN CON=N,DEL=Y      */ 24122400
*    3 DCMDELNT BIT(1),                  /* MOVE IN DEL UNCHANGED,      24122500
*                                           NO TIMER                 */ 24122600
*    3 *        BIT(1),                  /* RESERVED                 */ 24122700
*   2 DCMCMSG2    CHAR(1),               /* MSG MODULE                  24122800
*                                           COMMUNICATIONS BYTE 2    */ 24122900
*    3 DCMDLREQ BIT(1),                  /* MOVE IN DELETION            24123000
*                                           REQUESTED                */ 24123100
*    3 DCMRQINC BIT(1),                  /* MOVE IN REQUEST             24123200
*                                           INCONSISTENT             */ 24123300
*    3 DCMMSGCR BIT(1),                  /* MOVE IN INVALID CURSOR      24123400
*                                           OPERATION                */ 24123500
*    3 DCMINVOP BIT(1),                  /* MOVE IN INVALID OPERAND  */ 24123600
*    3 DCMCILLP BIT(1),                  /* MOVE IN ILLEGAL LP          24123700
*                                           OPERATION                */ 24123800
*    3 DCMDELRI BIT(1),                  /* MOVE IN DELETE REQUEST      24123900
*                                           INCONSISTENT             */ 24124000
*    3 DCMASYRT BIT(1),                  /* MOVE IN ASYN ERROR          24124100
*                                           RETRYABLE                */ 24124200
*    3 DCMASYCD BIT(1),                  /* MOVE IN ASYN ERROR MAYBE    24124300
*                                           RETRYABLE                */ 24124400
*   2 DCMCMSG3    CHAR(1),               /* MSG MODULE                  24124500
*                                           COMMUNICATIONS BYTE 3    */ 24124600
*    3 DCMCMRLL BIT(1),                  /* MOVE IN ROLL MODE           24124700
*                                           MESSAGE                  */ 24124800
*    3 DCMCDLR1 BIT(1),                  /* NO DELETABLE MESSAGES    */ 24124900
*    3 DCMCDLR2 BIT(1),                  /* INVALID RANGE            */ 24125000
*    3 DCMCDLR3 BIT(1),                  /* SEG EQU TO ZERO          */ 24125100
*    3 DCMCDLR4 BIT(1),                  /* DISPLAY NOT ON SCREEN    */ 24125200
*    3 DCMCDLR5 BIT(1),                  /* INVALID OPERAND          */ 24125300
*    3 *        BIT(1),                  /* RESERVED                 */ 24125400
*    3 DCMDTBSY BIT(1),                  /* COMMAND REJECTED - TASK     24125500
*                                           BUSY                     */ 24125600
*   2 DCMCMSG4    CHAR(1),               /* MSG MODULE                  24125700
*                                           COMMUNICATIONS BYTE 4    */ 24125800
*    3 DCMPFKNA BIT(1),                  /* MOVE IN PFK NOT             24125900
*                                           ALLOCATED FOR            */ 24126000
*    3 DCMPFKND BIT(1),                  /* MOVE IN PFK NOT DEFINED  */ 24126100
*    3 DCMPFKNO BIT(1),                  /* MOVE IN NO PFK              24126200
*                                           ALLOCATION               */ 24126300
*    3 DCMPFKIP BIT(1),                  /* MOVE IN PFK IN PROCESS   */ 24126400
*    3 DCMNPFKT BIT(1),                  /* MOVE IN NO PFK TABLES       24126500
*                                                                @L4C*/ 24126600
*    3 DCMTABND BIT(1),                  /* MOVE IN PFK TABLE NOT       24126700
*                                           DEFINED              @L4C*/ 24126800
*    3 DCMKRPIP BIT(1),                  /* MOVE IN K REQUEST           24126900
*                                           INCONSISTENT - PFK IN       24127000
*                                           USE                  @L4C*/ 24127100
*    3 *        BIT(1),                  /* RESERVED                 */ 24127200
* @EJECT;                           /*                       @G811PSS*/ 24127300
*/********************************************************************/ 24127400
*/*                                                                  */ 24127500
*/*           SVC 34 COMMUNICATIONS FIELD                    @G811PSS*/ 24127600
*/*                                                                  */ 24127700
*/********************************************************************/ 24127800
*   2 DCMSVC34    CHAR(1),               /* SVC 34 COMMUNICATION        24127900
*                                           BYTE                     */ 24128000
*    3 DCMMYCMD BIT(1),                  /* COMMAND TO BE HANDLED BY    24128100
*                                           THIS CONS                */ 24128200
*    3 DCMINVLD BIT(1),                  /* INVALID K COMMAND        */ 24128300
*    3 DCMTYPE1 BIT(1),                  /* K COMMAND IS NOT            24128400
*                                           ROUTABLE                 */ 24128500
*    3 *        BIT(1),                  /* RESERVED                 */ 24128600
*    3 *        BIT(1),                  /* RESERVED                 */ 24128700
*    3 *        BIT(1),                  /* RESERVED                 */ 24128800
*    3 *        BIT(1),                  /* RESERVED                 */ 24128900
*    3 *        BIT(1),                  /* RESERVED                 */ 24129000
* @SPACE(1);                             /*                  @G811PSS*/ 24129100
*   2 DCMCOM4     CHAR(1),               /* COMMUNICATION BYTE       */ 24129200
*    3 DCMCNTRL   BIT(1),         /* CONTROL LINE INDICATOR  @ZA44483*/ 24129300
*    3 *          BIT(7),                /* RESERVED         @ZA44483*/ 24129400
* @SPACE(1);                             /*                  @G811PSS*/ 24129500
*/********************************************************************/ 24129600
*/*                                                                  */ 24129700
*/*           INDEX FOR I/O ROUTINE                          @G811PSS*/ 24129800
*/*                                                                  */ 24129900
*/********************************************************************/ 24130000
*   2 DCMIONDX    CHAR(1),               /* INDEX FOR SELECTING THE     24130100
*                                           APPROPRIATE IO ROUTINE      24130200
*                                           X'04'=RESERVED              24130300
*                                           X'08'=RESERVED              24130400
*                                           X'0C'=RESERVED              24130500
*                                           X'10'=3270-TYPE-DEVICE,     24130600
*                                                   IEECVETU     @L3C*/ 24130700
* @SPACE(1);                             /*                  @G811PSS*/ 24130800
*   2 DCMTEST     FIXED(15),             /* RESERVED FOR TESTING     */ 24130900
*@EJECT;                                                                24131000
*/********************************************************************/ 24131100
*/*                                                                  */ 24131200
*/*           MODULE ADDRESSES                                       */ 24131300
*/*                                                                  */ 24131400
*/********************************************************************/ 24131500
*   2 DCMADMOD,               /* STRUCTURE OF MODULE ADDRESSES          24131600
*                                                                @D1A*/ 24131700
*     3 DCMIORTN  PTR(31),    /* IEECVETU - APPROPRIATE I/O ROUTINE     24131800
*                                                                @L3C*/ 24131900
*     3 DCMNMODS  CHAR(116) BDY(WORD),  /* MODULE ADDRESS        @L4A*/ 24132000
*      4 *         PTR(31),   /*            RESERVED             @L4C*/ 24132100
*      4 DCMNPROC  PTR(31),   /* IEECVET1 - PROCESSOR ROUTINE LOAD      24132200
*                                           ONE                  @D1C*/ 24132300
*      4 DCMNDSP1  PTR(31),   /* IEECVET2 - DISPLAY ROUTINE 1    @D1C*/ 24132400
*      4 DCMNDSP2  PTR(31),   /* IEECVET3 - DISPLAY ROUTINE 2    @D1C*/ 24132500
*      4 DCMNDSP3  PTR(31),   /* IEECVFT2 - DISPLAY ROUTINE 3    @D1C*/ 24132600
*      4 DCMNCMD1  PTR(31),   /* IEECVET4 - COMMAND ROUTINE 1    @D1C*/ 24132700
*      4 DCMNDEL1  PTR(31),   /* IEECVET6 - DELETE ROUTINE 1     @D1C*/ 24132800
*      4 DCMNDEL2  PTR(31),   /* IEECVET7 - DELETE ROUTINE 2     @D1C*/ 24132900
*      4 DCMNDEL3  PTR(31),   /* IEECVET8 - DELETE ROUTINE 3     @D1C*/ 24133000
*      4 DCMNDEL4  PTR(31),   /* IEECVET9 - DELETE ROUTINE 4     @D1C*/ 24133100
*      4 DCMNOPT1  PTR(31),   /* IEECVETA - OPTIONS ROUTINE 1    @D1C*/ 24133200
*      4 DCMNPFK1  PTR(31),   /* IEECVFTA - PFK ROUTINE 1        @D1C*/ 24133300
*      4 DCMNPFK2  PTR(31),   /* IEECVFTB - PFK ROUTINE 2        @D1C*/ 24133400
*      4 DCMNERRO  PTR(31),   /* IEECVETC - ASYNCHRONOUS ERROR          24133500
*                                           ROUTINE              @D1C*/ 24133600
*      4 DCMNMSG1  PTR(31),   /* IEECVETD - MESSAGE ROUTINE 1    @D1C*/ 24133700
*      4 DCMNMSG2  PTR(31),   /* IEECVETE - MESSAGE ROUTINE 2    @D1C*/ 24133800
*      4 DCMNMSG3  PTR(31),   /* IEECVFTD - MESSAGE ROUTINE 3    @D1C*/ 24133900
*      4 DCMNLPCR  PTR(31),   /* IEECVETF - LIGHT PEN/CURSOR SERVICE    24134000
*                                           ROUTINE              @D1C*/ 24134100
*      4 DCMNOPCL  PTR(31),   /* IEECVETG - OPEN/CLOSE ROUTINE   @D1C*/ 24134200
*      4 DCMNCLN   PTR(31),   /* IEECVFTG - CLEANUP MODULE       @D1C*/ 24134300
*      4 *         PTR(31),   /* Reserved                        @01C*/ 24134400
*      4 DCMNTIMR  PTR(31),   /* IEECVETK - TIMER INTERPRETER           24134500
*                                           ROUTINE              @D1A*/ 24134600
*      4 *         PTR(31),   /* Reserved                        @01C*/ 24134700
*      4 DCMNINT2  PTR(31),   /* IEECVFTM - INTERFACE 2 ROUTINE  @D1C*/ 24134800
*      4 DCMNINT3  PTR(31),   /* IEECVFTN - INTERFACE 3 ROUTINE  @D1C*/ 24134900
*      4 DCMNINT4  PTR(31),   /* IEECVFTO - INTERFACE 4 ROUTINE  @D1C*/ 24135000
*      4 DCMNINT5  PTR(31),   /* IEECVFTP - INTERFACE 5 ROUTINE  @D1C*/ 24135100
*      4 DCMNINT6  PTR(31),   /* IEECVFTQ - INTERFACE 6 ROUTINE  @D1C*/ 24135200
*      4 DCMNINT7  PTR(31),   /* IEECVFTT - INTERFACE 7 ROUTINE  @D1C*/ 24135300
* @SPACE(1);                             /*                  @G811PSS*/ 24135400
*/********************************************************************/ 24135500
*/*                                                                  */ 24135600
*/*           DIDOCS MODULE TRACE AREA                       @G811PSS*/ 24135700
*/*                                                                  */ 24135800
*/********************************************************************/ 24135900
*%DCL DCMTRLEN CHAR;                     /* TRACE MOVE LENGTH        */ 24136000
*%DCMTRLEN='30';                         /* 2 LESS THAN WHOLE AREA   */ 24136100
*   2 DCMTRACE CHAR(DCMTRLEN+2),         /* TO-AREA FOR TRACE MOVE      24136200
*                                                            @G811PSS*/ 24136300
*    3 *        CHAR(2),                 /* OLDEST TRACE ENTRY       */ 24136400
*    3 DCMTRAC2 CHAR(DCMTRLEN),          /* FROM-AREA FOR TRACE MOVE */ 24136500
*      4 *      CHAR(DCMTRLEN-2),        /*                      @D1A*/ 24136600
*      4 DCMTREN CHAR(2),                /* CURRENT TRACE ENTRY  @D1C*/ 24136700
*        5 DCMTREN1 CHAR(1),             /* 1ST BYTE OF NEW ENTRY       24136800
*                                                                @D1A*/ 24136900
*        5 DCMTREN2 CHAR(1),             /* 2ND BYTE OF NEW ENTRY       24137000
*                                                                @D1A*/ 24137100
* @EJECT;                           /*                       @G811PSS*/ 24137200
*/********************************************************************/ 24137300
*/*                                                                  */ 24137400
*/*           FOLLOWING GROUP OF BYTES ARE DEVICE DEPENDENT  @G811PSS*/ 24137500
*/*                                                                  */ 24137600
*/********************************************************************/ 24137700
*   2 DCMASKEN    CHAR(1),               /* ENTER MASK               */ 24137800
*   2 DCMASKCN    CHAR(1),               /* CANCEL MASK              */ 24137900
*   2 DCMASKCR    CHAR(1),               /* CURSOR MASK              */ 24138000
*   2 DCMASKLP    CHAR(1),               /* LIGHT PEN MASK           */ 24138100
*   2 DCMSKPF1    CHAR(1),              /* 1ST PFK TYPE MASK @G811PSS*/ 24138200
*   2 DCMSKPF2    CHAR(1),              /* 2ND PFK TYPE MASK @G811PSS*/ 24138300
*   2 DCMSKPF3    CHAR(1),              /* 3RD PFK TYPE MASK @G811PSS*/ 24138400
*   2 DCMSKPF4    CHAR(1),              /* 4TH PFK TYPE MASK @G811PSS*/ 24138500
*   2 DCMASKCL    CHAR(1),               /* CLEAR KEY MASK   @G811PSS*/ 24138600
*   2 DCMSKPA1    CHAR(1),               /* PA1 KEY MASK     @G811PSS*/ 24138700
*   2 DCMSKPA3    CHAR(1),               /* PA3 KEY MASK     @G811PSS*/ 24138800
*   2 *           CHAR(5),               /* RESERVED         @G811PSS*/ 24150000
* @SPACE(1);                             /*                  @G811PSS*/ 24200000
*/********************************************************************/ 24250000
*/*                                                                  */ 24300000
*/*           ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER  @G811PSS*/ 45093500
*/*           WHEN IN FULL CAPABILITY MODE                   @G811PSS*/ 45096000
*/*                                                                  */ 45098500
*/********************************************************************/ 45101000
*   2 DCMSADCN PTR(31),             /* FIRST ADCON IN LIST   @G811PSS*/ 45103500
*    3 DCMFLLA   PTR(31),           /* LAST LINE IN MSG AREA @G811PSS*/ 45106000
*   2 DCMFLL1A  PTR(31),            /* LAST LINE IN MSG AREA + 1        45108500
*                                                            @G811PSS*/ 45111000
*   2 DCMFLSCT PTR(31),             /* SCT FOR LAST LINE IN MSG AREA    45113500
*                                                            @G811PSS*/ 45116000
*   2 DCMFSCT1  PTR(31),            /* SCT FOR LAST LINE IN MSG AREA    45118500
*                                      + 1                   @G811PSS*/ 45121000
*   2 DCMFSSCT  PTR(31),            /* SSCT FOR LAST LINE IN MSG AREA   45123500
*                                      + 1                   @G811PSS*/ 45126000
*   2 DCMFENT2  PTR(31),            /* 2ND LINE OF ENTRY AREA           45128500
*                                                            @G811PSS*/ 45131000
*   2 DCMFMCT1  PTR(31),            /* MCT FOR LAST LINE IN MSG AREA    45132200
*                                      + 1                       @LBA*/ 45133400
*   2 *(5)      PTR(31),            /* RESERVED                  @LBC*/ 45134600
* @EJECT;                                                               45136000
*/********************************************************************/ 45138500
*/*                                                                  */ 45141000
*/*           ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER  @G811PSS*/ 45143500
*/*           WHEN IN MESSAGE STREAM MODE                    @G811PSS*/ 45146000
*/*                                                                  */ 45148500
*/********************************************************************/ 45151000
*   2 DCMMLLA   PTR(31),            /* LAST LINE IN MSG AREA @G811PSS*/ 45153500
*   2 DCMMLL1A  PTR(31),            /* LAST LINE IN MSG AREA + 1        45156000
*                                                            @G811PSS*/ 45158500
*   2 DCMMLSCT  PTR(31),            /* SCT FOR LAST LINE IN MSG AREA    45161000
*                                                            @G811PSS*/ 45163500
*   2 DCMMSCT1  PTR(31),            /* SCT FOR LAST LINE IN MSG AREA    45166000
*                                      + 1                   @G811PSS*/ 45168500
*   2 DCMMSSCT  PTR(31),            /* SSCT FOR LAST LINE IN MSG AREA   45171000
*                                      + 1                   @G811PSS*/ 45173500
*   2 DCMMMCT1  PTR(31),            /* MCT FOR LAST LINE IN MSG AREA    45174700
*                                      + 1                       @LBA*/ 45175900
*   2 *(1)      PTR(31),            /* RESERVED                  @LBC*/ 45177100
* @SPACE(1);                                                            45178500
*/********************************************************************/ 45181000
*/*                                                                  */ 45183500
*/*           ADDRESSES OF PARTS OF THE SCREEN IMAGE BUFFER  @G811PSS*/ 45186000
*/*           WHEN IN STATUS DISPLAY MODE                    @G811PSS*/ 45188500
*/*                                                                  */ 45191000
*/********************************************************************/ 45193500
*   2 DCMDLLA   PTR(31),            /* LAST LINE IN MSG AREA @G811PSS*/ 45196000
*   2 DCMDLL1A  PTR(31),            /* LAST LINE IN MSG AREA + 1        45198500
*                                                            @G811PSS*/ 45201000
*   2 DCMDLSCT  PTR(31),            /* SCT FOR LAST LINE IN MSG AREA    45203500
*                                                            @G811PSS*/ 45206000
*   2 DCMDSCT1  PTR(31),            /* SCT FOR LAST LINE IN MSG AREA    45208500
*                                      + 1                   @G811PSS*/ 45211000
*   2 DCMDSSCT  PTR(31),            /* SSCT FOR LAST LINE IN MSG AREA   45213500
*                                      + 1                   @G811PSS*/ 45216000
*   2 DCMDMCT1  PTR(31),            /* MCT FOR LAST LINE IN MSG AREA    45216100
*                                      + 1                       @LBA*/ 45216200
*   2 *(1)      PTR(31),            /* RESERVED                  @LBC*/ 45216300
* @SPACE(1);                                                            45216400
*/********************************************************************/ 45216500
*/*                                                                  */ 45216600
*/*           ADDRESSES TO BE RESOLVED DURING OPEN               @L1A*/ 45216700
*/*                                                                  */ 45216800
*/********************************************************************/ 45216900
*   2 DCMLSSCT  PTR(31),            /* ADDRESS OF LAST SSCT      @L1A*/ 45217000
*   2 DCMAEORD  PTR(31),            /* ADDR OF ADJUNCT EXTENDED ORDERS  45217100
*                                                            @G860PSS*/ 45217200
*   2 DCMQAPTR  PTR(31),            /* ADDR OF DATA OBTAINED FROM READ  45217300
                                       PARTITION QUERY           @D1A*/ 45217400
*   2 DCMFIMCT  PTR(31),            /* ADDRESS OF FIRST MCT      @LBA*/ 45217500
*   2 DCMLAMCT  PTR(31),            /* ADDRESS OF LAST MCT       @LBA*/ 45217600
*   2 *(4)      PTR(31),            /* RESERVED                  @LBC*/ 45217700
*   2 *         PTR(31),            /* RESERVED                  @L1A*/ 45217800
*    3 DCMLADCN PTR(31),            /* LAST ADCON IN LIST        @L1A*/ 45217900
* @EJECT;                                                               45218000
*/********************************************************************/ 45218100
*/*                                                                  */ 45218200
*/*           NUMBER OF LINES IN MESSAGE AREA AND ENTRY      @G811PSS*/ 45218300
*/*           AREA VALUES                                    @G811PSS*/ 45218400
*/*                                                                  */ 45218500
*/********************************************************************/ 45218600
*   2 DCMFNLMA  FIXED(8),           /* MAX NUMBER LINES IN MSG AREA     45218700
*                                      WHEN IN FULL CAPABILITY MODE     45218800
*                                                            @G811PSS*/ 45218900
*   2 DCMMNLMA  FIXED(8),           /* MAX NUMBER LINES IN MSG AREA     45219000
*                                      WHEN IN MESSAGE STREAM MODE      45219100
*                                                            @G811PSS*/ 45219200
*   2 DCMDNLMA  FIXED(8),           /* MAX NUMBER LINES IN MSG AREA     45219300
*                                      WHEN IN STATUS DISPLAY MODE      45219400
*                                                            @G811PSS*/ 45219500
*   2 DCMENTL1  FIXED(8),           /* LINE NUMBER -1 OF 1ST LINE       45219600
*                                      IN ENTRY AREA         @G811PSS*/ 45219700
*   2 DCMENTL2  FIXED(8),           /* LINE NUMBER -1 OF 2ND LINE       45219800
*                                      IN ENTRY AREA         @G811PSS*/ 45219900
*   2 DCMINLNM  FIXED(8),           /* LINE NUMBER -1 OF INSTRUCTION    45220000
*                                      LINE                  @G860PSS*/ 45220100
*   2 *         FIXED(15),          /* RESERVED              @G860PSS*/ 45220200
*   2 DCMFENRC  FIXED(15),          /* ADDR OF 2ND LINE IN ENTRY AREA   45220300
*                                      IN ROW-COLUMN FORMAT  @G811PSS*/ 45220400
*   2 DCMENTPO  FIXED(15),          /* OFFSET OF 1ST CHAR IN ENTRY AREA 45220500
*                                                            @G811PSS*/ 45220600
*   2 DCMSCRW   FIXED(15),          /* WIDTH OF SCREEN       @G860PSS*/ 45220700
*   2 DCMLENTY  FIXED(15),          /* LENGTH OF ENTRY AREA      @D1C*/ 45220800
*   2 *         FIXED(31),          /* RESERVED              @G860PSS*/ 45220900
* @EJECT;                           /*                       @G811PSS*/ 45221000
*/********************************************************************/ 45221100
*/*                                                              @02C*/ 45221200
*/* Pointers for last command retrieve buffer.                   @02C*/ 45221300
*/*                                                              @02C*/ 45221400
*/********************************************************************/ 45221600
*   2 DCMRBUFC  PTR(31),            /* Pointer to next command to be    45221700
*                                      executed by the enter function   45221800
*                                                                @02A*/ 45221900
*   2 DCMRBUFA  PTR(31),            /* Pointer to last command retrieve 45222000
*                                      buffer                    @02A*/ 45222100
*   2 DCMRBUFR  PTR(31),            /* Pointer to next entry in last    45222200
*                                      command buffer to be retrieved   45222300
*                                                                @02A*/ 45222400
*   2 DCMRBUFE  PTR(31),            /* Pointer to next entry in last    45222500
*                                      command buffer to be copied      45222600
*                                      into                      @02A*/ 45222700
*   2 DCMRBFRC  PTR(31),            /* Pointer to current entry in      45222800
*                                      last command buffer used for     45222900
*                                      retrieve function         @02A*/ 45223000
*   2 *         CHAR(108),          /* Reserved                  @02A*/ 45223100
* @SPACE(1);                             /*                  @G811PSS*/ 45223500
*/********************************************************************/ 45226000
*/*                                                                  */ 45228500
*/*           SAVE AREAS                                     @G811PSS*/ 45287500
*/*                                                                  */ 45288900
*/********************************************************************/ 45290300
*   2 DCMTLEN   FIXED(15),          /* TDCM LENGTH               @D1A*/ 45292600
*   2 *         FIXED(15),          /* PADDING FOR LENGTH        @D1A*/ 45294900
*   2 DCMAIDSV  CHAR(6),            /* SAVE AREA FOR AID FROM RMI       45297300
*                                                            @G811PSS*/ 45298700
*   2 *         FIXED(15),          /* RESERVED              @G811PSS*/ 45300100
*   2 DCMTRDCM  PTR(31),            /* POINTER TO RDCM       @G860P2G*/ 45301000
*   2 DCMNXTOR  PTR(31),            /* ADDR OF NEXT ADJUNCT EXTENDED    45301200
*                                      ORDER                 @G860PSS*/ 45301400
*   2 DCMCROW   FIXED(8),           /* CURRENT ROW NUMBER -1 @G860PSS*/ 45301600
*   2 DCMCCOL   FIXED(8),           /* CURRENT COL NUMBER -1 @G860PSS*/ 45301800
*   2 DCMMFRMF  BIT(8),             /* FULL CAPABILITY MFORM SAVEAREA   45302200
*                                                                @L5C*/ 45302600
*     3 DCMMFRFT BIT(1),            /* DISPLAY TIME STAMP        @L5A*/ 45303000
*     3 DCMMFRFJ BIT(1),            /* DISPLAY JOB NAME          @L5A*/ 45303400
*     3 DCMMFRFS BIT(1),            /* DISPLAY SYSTEM NAME       @L5A*/ 45303800
*     3 DCMMFRFX BIT(1),            /* DON'T DISPLAY SYSTEM NAME AND    45304000
*                                      JOB NAME                  @LAA*/ 45304200
*     3 *        BIT(4),            /* RESERVED                  @LAC*/ 45304400
*   2 DCMDELFC  CHAR(2),            /* FULL CAPABILITY DEL SAVE  @L2A*/ 45304600
*   2 DCMCONFC  CHAR(1),            /* FULL CAPABILITY CON SAVE  @L2A*/ 45305000
*   2 DCMSEGFC  FIXED(8),           /* FULL CAPABILITY SEG SAVE  @L2A*/ 45305400
*   2 DCMRNUMF  FIXED(8),           /* FULL CAPABILITY RNUM SAVE @L2A*/ 45305800
*   2 DCMRTMEF  FIXED(16),          /* FULL CAPABILITY RTME SAVE IN     45306000
*                                      TENTHS OF SECONDS         @LCC*/ 45306200
*   2 DCMMFRMM  BIT(8),             /* MESSAGE STREAM MFORM SAVEAREA    45306600
*                                                                @L5C*/ 45307000
*     3 DCMMFRMT BIT(1),            /* DISPLAY TIME STAMP        @L5A*/ 45307400
*     3 DCMMFRMJ BIT(1),            /* DISPLAY JOB NAME          @L5A*/ 45307800
*     3 DCMMFRMS BIT(1),            /* DISPLAY SYSTEM NAME       @L5A*/ 45308200
*     3 DCMMFRMX BIT(1),            /* DON'T DISPLAY SYSTEM NAME AND    45308400
*                                      JOB NAME                  @LAA*/ 45308600
*     3 *        BIT(4),            /* RESERVED                  @LAC*/ 45308800
*   2 DCMDELMS  CHAR(2),            /* MESSAGE STREAM DEL SAVE   @L2A*/ 45309000
*   2 DCMCONMS  CHAR(1),            /* MESSAGE STREAM CON SAVE   @L2A*/ 45309400
*   2 DCMSEGMS  FIXED(8),           /* MESSAGE STREAM SEG SAVE   @L2A*/ 45309800
*   2 DCMRNUMM  FIXED(8),           /* MESSAGE STREAM RNUM SAVE  @L2A*/ 45310200
*   2 DCMRTMEM  FIXED(16),          /* MESSAGE STREAM RTME SAVE IN      45310400
*                                      TENTHS OF SECONDS         @LCC*/ 45310600
*   2 DCMQALEN  FIXED(15),          /* LENGTH OF AREA TO HOLD READ      45311000
*                                      PARTITION QUERY           @D1A*/ 45311400
*   2 DCMSTOFF  FIXED(15),          /* START OFFSET OF MULTIPLE COMMAND 45311500
*                                      PARSE                     @L6A*/ 45311600
*   2 DCMNDOFF  FIXED(15),          /* END OFFSET OF MULTIPLE COMMAND   45311700
*                                      TEXT                      @L6A*/ 45311800
*   2 *(2)      FIXED(31),          /* RESERVED                  @L6C*/ 45311900
* @SPACE(1);                        /*                           @L3A*/ 45312200
*/********************************************************************/ 45312600
*/*                                                                  */ 45313000
*/* THE DCMBUFER WORK AREA IS TO BE USED ON A MODULE-BY-MODULE BASIS */ 45313400
*/* ONLY.  THIS AREA MUST NOT BE USED AS A COMMUNICATION MEDIUM.     */ 45313800
*/* DOING SO WOULD DEFEAT THE PURPOSE OF GIVING THE DIDOCS           */ 45314200
*/* MODULES A SAFE WORK AREA.                                    @L3A*/ 45314600
*/*                                                                  */ 45315000
*/********************************************************************/ 45315400
*   2 DCMBUFER CHAR(168),           /* MODULE WORK AREA          @L3A*/ 45315500
*/********************************************************************/ 45315600
*/*                                                                  */ 45315700
*/*           MCS LOGON COMMUNICATIONS FIELDS                    @L8A*/ 45315800
*/*                                                                  */ 45315900
*/********************************************************************/ 45316000
* @SPACE(1);                    /*                               @L8A*/ 45316100
*   2 DCMBFLGS   BIT(8),        /* MCS LOGON COMMUNICATIONS FLAGS@L8A*/ 45316200
*    3 DCMWLGPR  BIT(1),        /* GENERATE LOGON PROMPT         @L8A*/ 45316300
*    3 DCMDIDLG  BIT(1),        /* DIDOCS GENERATED LOGON        @L8A*/ 45316400
*    3 DCMLGMSG  BIT(1),        /* WRITE LOGON MESSAGE           @L8A*/ 45316500
*    3 DCMICUPW  BIT(1),        /* INSERT CURSER UNDER PASSWORD  @L8A*/ 45316600
*    3 DCMICUGP  BIT(1),        /* INSERT CURSER UNDER GROUP     @L8A*/ 45316700
*    3 DCMICUSC  BIT(1),        /* INSERT CURSER UNDER SECCLASS  @L8A*/ 45316800
*    3 *         BIT(2),        /* RESERVED                      @L8A*/ 45316900
*   2 DCMEMTYP   FIXED(8),      /* ERROR MESSAGE TYPE            @L8A*/ 45317000
*   2 DCMUSRID   CHAR(8),       /* USERID ENTERED WITH LOGON     @L8A*/ 45317100
*   2 DCMPWORD   CHAR(26),      /* PASSWORD ENTERED WITH LOGON   @L8A*/ 45317200
*   2 DCMGROUP   CHAR(8),       /* GROUP ENTERED WITH LOGON      @L8A*/ 45317300
*   2 DCMSCCLS   CHAR(8),       /* SECCLASS ENTERED WITH LOGON   @LBC*/ 45317400
* @SPACE(1);                        /*                           @L3A*/ 45317500
*/********************************************************************/ 45317600
*/*                                                              @LBA*/ 45318200
*/* THE DCMWORK WORK AREA IS TO BE USED ON A MODULE-BY-MODULE    @LBA*/ 45318300
*/* BASIS ONLY.  THIS AREA MUST NOT BE USED AS A COMMUNICATION   @LBA*/ 45318400
*/* MEDIUM. DOING SO WOULD DEFEAT THE PURPOSE OF GIVING THE      @LBA*/ 45318500
*/* DIDOCS MODULES A SAFE WORK AREA.                             @LBA*/ 45318600
*/*                                                              @LBA*/ 45318700
*/********************************************************************/ 45318800
*   2 DCMWORK  CHAR(16),            /* MODULE WORK AREA          @LBA*/ 45318900
*    3 DCMWORKA CHAR(4),            /* WORK AREA A               @LBA*/ 45319000
*    3 DCMWORKB CHAR(4),            /* WORK AREA A               @LBA*/ 45319100
*    3 DCMWORKC CHAR(4),            /* WORK AREA A               @LBA*/ 45319200
*    3 DCMWORKD CHAR(4),            /* WORK AREA A               @LEC*/ 45319300
*/********************************************************************/ 45319400
*/*   DCMCSNM STORES THE COMMAND ASSOCIATION FOR MCS CONSOLE     @LEA*/ 45319500
*/********************************************************************/ 45319600
*   2 DCMCSNM CHAR(8);              /* COMMAND ASSOCIATION       @LEA*/ 45319700
*@EJECT;                                                                45319800
*/********************************************************************/ 45319900
*/*   CONTROL BLOCK VERSIONS - POSSIBLE VALUES OF DCMTVERN   @G860P2G*/ 45320800
*/********************************************************************/ 45321700
* DECLARE                                                               45322600
*   DCMTSP21    FIXED(8) CONSTANT(1), /* OS/VS2 HBB2102 LEVEL           45323500
*                                                            @G860PSS*/ 45324400
*   DCMTS212    FIXED(8) CONSTANT(2), /* OS/VS2 JBB2125 LEVEL    @D1A*/ 45325500
*   DCMTS220    FIXED(8) CONSTANT(3); /* OS/VS2 JBB2220 LEVEL    @L3A*/ 45328700
*/********************************************************************/ 45332000
*/*                                                                  */ 45338500
*/*           MAPPING OF A SCREEN CONTROL TABLE (SCT) ENTRY  @G811PSS*/ 45345000
*/*                                                                  */ 45351500
*/*           FIRST BYTE OF AN SCT                           @G811PSS*/ 45358000
*/*                                                                  */ 45365000
*/********************************************************************/ 45372000
*DECLARE                                                                45400002
*  1 DCMSCTA CHAR(4) BASED(DCMSCTB),                      /*     @L3C*/ 45450000
*   2 DCMSCTA1 BIT(8),             /* FIRST BYTE OF AN SCT       @L3A*/ 45481400
*    3 DCMMSGOR BIT(1),            /* WTOR MESSAGE DISPLAYED     @L3C*/ 45512800
*    3 DCMMSGIN BIT(1),            /* MESSAGE DISPLAYED IN LINE  @L3C*/ 45544200
*    3 DCMMSGCN BIT(1),            /* MESSAGE CONTINUED ON NEXT         45575600
*                                     NEXT LINE                  @L3C*/ 45607000
*    3 DCMMSGJK BIT(1),            /* TO WRITE O-O-L DISPLAY FROM.      45638400
*                                     MAY CONTAIN JUNK (SDS INTERFACE   45670000
*                                     2)                         @L3C*/ 45701100
*    3 DCMMSGAD BIT(1),            /* MESSAGE CAN BE AUTO               45732200
*                                     DELETED                    @L3C*/ 45763300
*    3 DCMMSGRD BIT(1),            /* REQUEST HAS SPECIFIED             45794400
*                                     MESSAGE BE REMOVED         @L3C*/ 45825500
*    3 DCMMSGIF BIT(1),            /* INFORMATIONAL MESSAGE             45856600
*                                     IN LINE                    @L3C*/ 45887700
*    3 DCMMSGST BIT(1),            /* END OF TABLE INDICATOR     @L3C*/ 45918800
* @SPACE(1);                             /*                  @G811PSS*/ 45950000
*/********************************************************************/ 45957500
*/*                                                                  */ 45965000
*/*           SECOND BYTE OF AN SCT                          @G811PSS*/ 45972500
*/*                                                                  */ 45980000
*/********************************************************************/ 45990000
*   2 DCMSCTA2 BIT(8),             /* SECOND BYTE OF AN SCT      @L3A*/ 46018800
*    3 DCMMSGAC BIT(1),            /* ACTION MESSAGE             @L3C*/ 46047600
*    3 DCMMSGC7 BIT(1),            /* DESCRIPTOR CODE 7 MESSAGE  @L3C*/ 46076400
*    3 DCMMSGR2 BIT(1),            /* RESERVED - WAS DCMMSGDM           46105200
*                                                                @L3C*/ 46134000
*    3 DCMMSGUA BIT(1),            /* URGENT ATTENTION MESSAGE          46162800
*                                     DISPLAYED IN LINE          @L3C*/ 46191600
*    3 DCMMSGEA BIT(1),            /* EVENTUAL ACTION MESSAGE           46220400
*                                     DISPLAYED IN LINE - WAS           46250000
*                                     DCMMSGIR                   @L3C*/ 46268600
*    3 DCMMSGCT BIT(1),            /* THIS IS A CONTINUED LINE   @L3C*/ 46287200
*    3 DCMMSGPP BIT(1),            /* ISSUED BY PROBLEM PROGRAM  @L3C*/ 46305800
*    3 DCMMSGCL BIT(1),            /* CONTROL LINE OF AN                46324400
*                                     IN-LINE MLWTO              @L3C*/ 46343000
* @SPACE(1);                             /*                      @L3A*/ 46361600
*/********************************************************************/ 46367400
*/*                                                                  */ 46373200
*/*           THIRD BYTE OF AN SCT                               @L3A*/ 46379000
*/*                                                                  */ 46384800
*/********************************************************************/ 46390600
*   2 DCMSCTA3 BIT(8),             /* THIRD BYTE OF AN SCT       @L3A*/ 46396400
*     3 *        BIT(1),            /* Reserved                  @01C*/ 46398900
*     3 DCMSEPLN BIT(1),           /* Separator line is in this line    46401500
*                                                                @D2A*/ 46401800
*     3 *        BIT(6),            /* Reserved                  @01A*/ 46402000
* @SPACE(1);                             /*                      @L3A*/ 46402200
*/********************************************************************/ 46408000
*/*                                                                  */ 46413800
*/*           FOURTH BYTE OF AN SCT                              @L3A*/ 46419600
*/*                                                                  */ 46425400
*/********************************************************************/ 46431200
*   2 DCMSCTA4 BIT(8),             /* FOURTH BYTE OF AN SCT      @LBA*/ 46433500
*    3 DCMMSGCO BIT(1),            /* MESSAGE COLOR CHANGED BY          46435800
*                                     WTO EXIT                   @LBA*/ 46438100
*    3 DCMMSGHI BIT(1),            /* MESSAGE HIGHLIGHTING              46440400
*                                     CHANGED BY WTO EXIT        @LBA*/ 46442700
*    3 DCMMSGIT BIT(1);            /* MESSAGE INTENSITY CHANGED         46445000
*                                     BY WTO EXIT                @LBA*/ 46447300
* @SPACE(1);                       /*                            @L3A*/ 46450000
*/********************************************************************/ 46457500
*/*                                                                  */ 46465000
*/* MAPPING OF A SECONDARY SCREEN CONTROL TABLE (SSCT) ENTRY @G811PSS*/ 46472500
*/* FIRST BYTE OF AN SSCT                                        @L3A*/ 46476200
*/*                                                                  */ 46480000
*/********************************************************************/ 46490000
*DECLARE                                                                46550002
*  1 DCMSCTC CHAR(2) BASED(DCMSCTD),                                    46600000
*   2 DCMSCTC1 BIT(8),             /* FIRST BYTE OF AN SSCT      @L3A*/ 46634800
*    3 DCMSECCL BIT(1),            /* CONTROL LINE OF O-O-L             46669600
*                                     DISPLAY                    @L3C*/ 46704400
*    3 DCMSECLL BIT(1),            /* LABEL LINE OF O-O-L               46739200
*                                     DISPLAY                    @L3C*/ 46774000
*    3 DCMSECDL BIT(1),            /* DATA LINE OF O-O-L DISPLAY @L3C*/ 46808800
*    3 DCMSECBL BIT(1),            /* THIS LINE IS BLANKED       @L3C*/ 46843600
*    3 *        BIT(1),            /* RESERVED - WAS DCMSECXX           46878400
*                                                                @L3C*/ 46913200
*    3 *        BIT(1),            /* RESERVED - WAS DCMSECYY           46948000
*                                                                @L3C*/ 46982800
*    3 DCMSECDD BIT(1),            /* LINE RESERVED FOR DYNAMIC DISPLAY 47017600
*                                                                @L3C*/ 47052400
*    3 DCMSECST BIT(1),            /* END OF TABLE INDICATOR         */ 47087200
* @SPACE (1);                            /*                      @L3A*/ 47122200
*/********************************************************************/ 47133300
*/*                                                                  */ 47144400
*/* SECOND BYTE OF AN SSCT ENTRY                                 @L3A*/ 47155500
*/*                                                                  */ 47166600
*/********************************************************************/ 47177700
*   2 DCMSCTC2 BIT(8);             /* SECOND BYTE OF AN SSCT     @L3A*/ 47188800
* @EJECT;                           /*                           @L3A*/ 47200000
*/********************************************************************/ 47201600
*/*                                                                  */ 47203200
*/* MAP OF THE EXTENDED START EXTENDED FIELD ORDERS FOR 3270     @D1A*/ 47204200
*/* DEVICES                                                      @D1A*/ 47205200
*/*                                                                  */ 47206400
*/********************************************************************/ 47208000
*DECLARE                                                                47209600
*  1 DCMORDER BASED(DCMORDPT),    /* EXTENDED ORDERS           @L4C*/   47211200
*    2 DCMSBAO  CHAR(3),            /* SET BUFFER ADDRESS FIELD         47212800
*                                                            @G860PSS*/ 47214400
*      3 DCMSBA   FIXED(8),         /* SET BUFFER ADDRESS ORDER         47216000
*                                                            @G860PSS*/ 47217600
*      3 DCMSBAA1 FIXED(8),         /* SET BUFFER ADDRESS ROW ADDR      47219200
*                                                            @G860PSS*/ 47220800
*      3 DCMSBAA2 FIXED(8),         /* SET BUFFER ADDRESS COL ADDR      47222400
*                                                            @G860PSS*/ 47224000
*    2 DCMSFEO  CHAR(8),            /* START FIELD EXTENDED FIELD       47225600
*                                                            @G860PSS*/ 47227200
*      3 DCMSFE   FIXED(8),         /* START FIELD EXTENDED ORDER       47228800
*                                                            @G860PSS*/ 47230400
*      3 DCMSFEN  FIXED(8),         /* NUMBER OF TYPE/VALUE PAIRS WHICH 47232000
*                                      FOLLOW                @G860PSS*/ 47233600
*      3 DCMSFEFT FIXED(8),         /* FIELD ATTRIBUTE TYPE  @G860PSS*/ 47235200
*      3 DCMSFEFA FIXED(8),         /* FIELD ATTRIBUTE VALUE @G860PSS*/ 47236800
*      3 DCMSFECT FIXED(8),         /* COLOR ATTRIBUTE TYPE  @G860PSS*/ 47238400
*      3 DCMSFECA FIXED(8),         /* COLOR ATTRIBUTE VALUE @G860PSS*/ 47240000
*      3 DCMSFEHT FIXED(8),         /* HIGHLIGHTING ATTRIBUTE TYPE      47241600
*                                                            @G860PSS*/ 47243200
*      3 DCMSFEHA FIXED(8);         /* HIGHLIGHTING ATTRIBUTE VALUE     47244800
*                                                            @G860PSS*/ 47246400
* @EJECT;                                /*                      @D1C*/ 47246600
*/********************************************************************/ 47246800
*/*                                                                  */ 47247000
*/* MAP OF THE EXTENDED SET ATTRIBUTE ORDERS FOR 3270 DEVICES    @D1A*/ 47247200
*/*                                                                  */ 47247400
*/********************************************************************/ 47247600
* DCL 1 DCMSAO DEF(DCMSFEO),        /* SET ATTRIBUTE FIELD       @D1A*/ 47247800
*       2 DCMSA1  FIXED(8),         /* SET ATTRIBUTE ORDER       @D1A*/ 47248000
*       2 DCMSAHT FIXED(8),         /* HIGHLIGHTING ATTRIBUTE TYPE      47248200
*                                                                @D1A*/ 47248400
*       2 DCMSAHA FIXED(8),         /* HIGHLIGHTING ATTRIBUTE VALUE     47248600
*                                                                @D1A*/ 47248800
*       2 DCMSADAT CHAR(1),         /* DATA TO HIGHLIGHT         @D1A*/ 47249000
*       2 DCMSA2  FIXED(8),         /* SET ATTRIBUTE ORDER       @D1A*/ 47249200
*       2 DCMSARST FIXED(16) BDY(BYTE); /* CHARACTER                    47249400
*                                                ATTRIBUTE RESET @D1A*/ 47249600
* @SPACE(1);                             /*                      @L3A*/ 47252200
*/********************************************************************/ 47254800
*/*                                                                  */ 47257400
*/* MAP OF THE DOM INFORMATION                                   @L3A*/ 47260000
*/*                                                                  */ 47262600
*/********************************************************************/ 47265200
* DCL 1 DCMDOMEN BASED,             /* MAP OF A DOM ENTRY        @L3A*/ 47269100
*       2 DCMDTCB  PTR(31),         /* JOBSTEP TCB ADDRESS       @L3A*/ 47273000
*       2 DCMDOMID,                 /* FOUR BYTE DOM ID          @L3A*/ 47275600
*         3 DCMDSYID FIXED(8),      /* SYSTEM ID                 @L3A*/ 47278200
*         3 DCMDMID  CHAR(3),       /* DOM ID                    @L3A*/ 47280800
*       2 DCMDTKAS,                 /* TOKEN AND ASID            @L3A*/ 47282100
*         3 DCMDTOKN CHAR(4),       /* DOM TOKEN                 @L3A*/ 47283400
*         3 DCMDASID FIXED(16),     /* ASID                      @L3A*/ 47284700
*       2 DCMDRSVD CHAR(4);         /* RESERVED                  @L3A*/ 47286000
* @SPACE(1);                             /*                  @G811PSS*/ 47293800
*/********************************************************************/ 47343800
*/*                                                              @02A*/ 47393800
*/* Map of an entry in the last command retrieve buffer.         @02A*/ 47443800
*/*                                                              @02A*/ 47493800
*/********************************************************************/ 47543800
* DCL 1 DCMRBUF BASED,              /* Map of a command retrieve buffer 47593800
*                                      entry                     @02A*/ 47643800
*       2 DCMRBUFF PTR(31),         /* Pointer to next command retrieve 47693800
*                                      buffer entry              @02A*/ 47743800
*       2 DCMRBUFB PTR(31),         /* Pointer to previous command      47793800
*                                      retrieve buffer entry     @02A*/ 47843800
*       2 DCMRBUFT CHAR(126),       /* Command text              @02A*/ 47877100
*       2 *        CHAR(2);         /* Reserved                  @02A*/ 47910400
* @SPACE(1);                        /*                           @02A*/ 47943800
* DCL DCMRBFLN CONSTANT(LENGTH(DCMRBUF));  /* Length of command         47993800
*                                      retrieve buffer entry     @02A*/ 48043800
* DCL DCMDOMLN CONSTANT(LENGTH(DCMDOMEN)); /* Length of DOM entry       48093800
*                                                                @LDA*/ 48143800
* @SPACE(1);                                                  /* @LDA*/ 48193800
*/********************************************************************/ 48243800
*/*                                                              @LBA*/ 48293800
*/*           MAPPING OF A MESSAGE CONTROL TABLE (MCT) ENTRY     @LBA*/ 48343800
*/*                                                              @LBA*/ 48393800
*/*           FIRST BYTE OF A MCT                                @LBA*/ 48443800
*/*                                                              @LBA*/ 48493800
*/********************************************************************/ 48543800
*DECLARE                           /*                            @LBA*/ 48593800
*  1 DCMMCTEN CHAR(4) BASED,       /*                            @LBA*/ 48643800
*   2 DCMMCTCO BIT(8),             /* FIRST BYTE OF A MCT ENTRY  @LBA*/ 48693800
*    3 DCMBLUE BIT(1),             /* MESSAGE COLOR IS BLUE      @LBA*/ 48743800
*    3 DCMRED BIT(1),              /* MESSAGE COLOR IS RED       @LBA*/ 48793800
*    3 DCMPINK BIT(1),             /* MESSAGE COLOR IS PINK      @LBA*/ 48843800
*    3 DCMGREEN BIT(1),            /* MESSAGE COLOR IS GREEN     @LBA*/ 48893800
*    3 DCMTURQ BIT(1),             /* MESSAGE COLOR IS TURQUOISE @LBA*/ 48943800
*    3 DCMYELOW BIT(1),            /* MESSAGE COLOR IS YELLOW    @LBA*/ 48993800
*    3 DCMWHITE BIT(1),            /* MESSAGE COLOR IS WHITE     @LBA*/ 49043800
*    3 DCMMCTST BIT(1),            /* TABLE STOPPER              @LBA*/ 49093800
* @SPACE(1);                       /*                            @LBA*/ 49143800
*/********************************************************************/ 49193800
*/*                                                              @LBA*/ 49243800
*/*           SECOND BYTE OF A MCT                               @LBA*/ 49293800
*/*                                                              @LBA*/ 49343800
*/********************************************************************/ 49393800
*   2 DCMMCTHI BIT(8),             /* SECOND BYTE OF A MCT ENTRY @LBA*/ 49443800
*    3 DCMHNONE BIT(1),            /* NO HIGHLIGHTING IN EFFECT  @LBA*/ 49493800
*    3 DCMBLINK BIT(1),            /* BLINKING HIGHLIGHTING      @LBA*/ 49543800
*    3 DCMRVIDO BIT(1),            /* REVERSE VIDEO HIGHLIGHT    @LBA*/ 49593800
*    3 DCMUNDER BIT(1),            /* UNDERLINE HIGHLIGHT        @LBA*/ 49643800
* @SPACE(1);                       /*                            @LBA*/ 49693800
*/********************************************************************/ 49743800
*/*                                                              @LBA*/ 49793800
*/*           THIRD BYTE OF A MCT                                @LBA*/ 49843800
*/*                                                              @LBA*/ 49893800
*/********************************************************************/ 49943800
*   2 DCMMCTIN BIT(8),             /* THIRD BYTE OF A MCT        @LBA*/ 49993800
*     3 DCMINORM BIT(1),           /* NORMAL INTENSITY           @LBA*/ 50043800
*     3 DCMIHIGH BIT(1),           /* HIGH INTENSITY             @LBA*/ 50093800
* @SPACE(1);                       /*                            @LBA*/ 50143800
*/********************************************************************/ 50193800
*/*                                                              @LBA*/ 50243800
*/*           FOURTH BYTE OF A MCT                               @LBA*/ 50293800
*/*                                                              @LBA*/ 50343800
*/********************************************************************/ 50393800
*   2 DCMMCTRV BIT(8);             /* FOURTH BYTE OF A MCT       @LBA*/ 50443800
* @SPACE(1);                       /*                            @LBA*/ 50493800
*DECLARE DCMEND  (*) CHAR(1)   BASED                                    50543800
*  (ADDR(DCMSTRT )+LENGTH(DCMSTRT ));                                   50593800
