         MACRO                                                          00050001
         IEEUCDX                                                        00100001
*********************************************************************** 00109500
*                                                                 @D1A* 00119000
*   MACRO NAME=       IEEUCDX                                     @D1A* 00128500
*                                                                 @D1A* 00138000
*   DESCRIPTIVE NAME= DCB AND IOB CONTROL BLOCKS FOR USE BY       @D1A* 00166500
*                     THE COMMUNICATIONS TASK DEVICE SUPPORT      @D1A* 00172800
*                     PROCESSORS                                  @D1A* 00179100
*                                                                 @D1A* 00185500
* *01* PROPRIETARY STATEMENT=                                        *  00191900
*  **PROPRIETARY_STATEMENT********************************************  00198300
*                                                                    *  00204700
*                                                                    *  00211100
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00217500
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  00223900
*   5647-A01 (C) COPYRIGHT IBM CORP. 1984, 1999                      *  00230300
*                                                                    *  00236700
*   STATUS= JBB6607                                                  *  00243100
*                                                                    *  00249500
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00255900
*                                                                     * 00263400
*   EXTERNAL CLASSIFICATION: NONE                                     * 00265300
*   END OF EXTERNAL CLASSIFICATION                                    * 00267200
*                                                                     * 00269100
*   FUNCTION=         DEFINES AND MAPS THE DCB AND IOB USED       @D1A* 00271000
*                     BY THE COMMUNICATIONS TASK DEVICE SUPPORT   @D1A* 00277300
*                     PROCESSORS                                  @D1A* 00283600
*                                                                 @D1A* 00290000
*   METHOD OF ACCESS= BAL  - IEEUCDX                              @D1A* 00299500
*                                                                 @D1A* 00309000
*   CREATED BY=       IEAVSWCH, IEECVETG, IEECVETW, IEECVGCI      @D1A* 00337500
*                                                                 @D1A* 00347000
*   SERIALIZATION=    N/A                                         @D1A* 00356500
*                                                                 @D1A* 00366000
*   SUBPOOL AND KEY=  SUBPOOL 255 KEY 0                           @D1A* 00375500
*                                                                 @D1A* 00385000
*   CHANGE ACTIVITY =                                             @D1A* 00394500
* $D1=DCR43,    JBB2125, 821225, PDSS: 3290 SUPPORT                   * 00404000
*                                                                 @D1A* 00413500
* $P1=PWA0053,  JBB6607, 980128, PDZH: CHANGED DISTLIB TO AMODGEN     * 00418200
*********************************************************************** 00423000
.* D 008500                                                    @ZM30471 00432500
.* A EXPAND THE IOB TO INCLUDE EXTENSION FOR DISPLAY DEVICES       @D1A 00442000
         EJECT                                                          00451500
*********************************************************************** 00461000
*        DEFINE THE DCB                                            @D1A 00470500
*********************************************************************** 00480000
         SPACE 1                                                        00489500
         DS    0D            DOUBLE WORD ALIGNMENT                      00500001
DMDCB    DCB DDNAME=IEECVTSK,MACRF=(E),DSORG=PS                         00550001
         ORG                                                            00650001
         EJECT                                                          00660000
*********************************************************************** 00670000
*        DEFINE THE STATUS WORK AREA                               @D1A 00680000
*********************************************************************** 00690000
         SPACE                                                          00700001
         DC    D'0'               WORK AREA.                            00900001
         SPACE 1                                                        00910000
*********************************************************************** 00920000
*        DEFINE THE IOB                                            @D1A 00930000
*********************************************************************** 00940000
         SPACE                                                          00950001
         DS    0D                                                       01050001
         DC    BL1'01000010'      COMMAND CHAINING,UNRELATED(42).       01100001
         DC    X'00'              2ND FLAG BYTE                         01150001
         DC    H'0'               TWO SENSE BYTES.                      01200001
         DC    F'0'               (DYNAMIC) ECB CODE AND PTR.           01250000
         DC    D'0'               CHANNEL STATUS WORD.                  01300001
         DC    F'0'               (DYNAMIC) CHANNEL PROGRAM ADDRESS     01350000
         DC    F'0'               (DYNAMIC) DCB PTR.                    01400000
         DC    F'0'               RESTART POINTER.                      01450001
         DC    H'0'               BLOCK COUNT (UNUSED)                  01500001
         DC    H'0'               ERROR COUNT (UNUSED)                  01550001
         DC    2F'0'              IOB EXTENSION FOR DISPLAY CONSOLES   X01562500
                                                                   @D1A 01575000
         SPACE 1                                                        01587500
*********************************************************************** 01600000
*        CCW DEFINITIONS - READ                                    @D1A 01612500
*********************************************************************** 01625000
         SPACE 1                                                        01637500
         DS    0D            CCW DEFINITIONS.                      @D1C 01650000
         DC    X'0A'         READ CODE.                                 01750001
         DC    FL3'0'        DATA PTR.                                  01800001
         DC    BL1'01100000' CC,SLI.                                    01850001
         DC    X'00'                                                    01900001
         DC    FL2'1'        COUNT FIELD.                               01950001
         SPACE 1                                                        01966600
*********************************************************************** 01983200
*        CCW DEFINITIONS - TRANSFER TO NOP                         @D1A 01999800
*********************************************************************** 02016400
         SPACE 1                                                        02033000
         DC    X'08'         TRANSFER IN CHANNEL.                       02050001
         DC    FL3'0'        (DYNAMIC) TO NOP.                          02100001
         DC    F'0'          IGNORED.                                   02150001
         SPACE 1                                                        02166600
*********************************************************************** 02183200
*        CCW DEFINITIONS - WRITE                                   @D1A 02199800
*********************************************************************** 02216400
         SPACE 1                                                        02233000
         DC    X'09'         WRITE CODE.                                02250001
         DC    FL3'0'        DATA PTR.                                  02300001
         DC    BL1'01100000' CC,SLI.                                    02350001
         DC    X'00'                                                    02400001
         DC    FL2'1'             COUNT FIELD.                          02450001
         EJECT                                                          02480000
*********************************************************************** 02510000
*        CCW DEFINITIONS - NOP                                     @D1A 02540000
*                                                                  @D1A 02570000
*        ACTIVE COMMANDS CHAINED TO NOP FORCES DEVICE END AND      @D1A 02600000
*        CHANNEL END TO OCCUR TOGETHER, AVOIDING FUTURE INTERCEPTS,@D1A 02630000
*        ALLOWING CURRENT ERROR CHECK.                             @D1A 02660000
*********************************************************************** 02690000
         SPACE 1                                                        02720000
         DC    X'03'              NOP CODE                              02750001
         DC    FL3'0'             NO DATA                               02800001
         DC    BL1'00100000'      SLI                                   02850001
         DC    X'00'                                                    02900001
         DC    FL2'1'             NON-ZERO COUNT                        02950001
         SPACE 1                                                        02966600
*********************************************************************** 02983200
*        CCW DEFINITIONS - ALARM                                   @D1A 02999800
*********************************************************************** 03016400
         SPACE 1                                                        03033000
         DC    X'0B'              GONG CODE                             03050001
         DC    FL3'0'             NO DATA                               03100001
         DC    BL1'00100000'      SLI.                                  03150001
         DC    X'00'                                                    03200001
         DC    FL2'1'             NON ZERO COUNT                        03250001
         SPACE 1                                                        03258300
*********************************************************************** 03266600
*        DEFINE STORAGE REQUIREMENTS FOR THE DCB AND IOB           @D1A 03274900
*********************************************************************** 03283200
         SPACE 1                                                        03291500
DMLAST   EQU   *                  END.                                  03300001
DMCORE   EQU   *-DMDCB            CORE REQUIREMENT.                     03350001
         EJECT                                                          03375000
         IHADCB DSORG=XE                                                03400001
         ORG                                                            03450001
         EJECT                                                          03483300
*********************************************************************** 03516600
*        MAPPING OF STATUS WORK AREA                               @D1A 03549900
*********************************************************************** 03583200
         SPACE 1                                                        03616500
DMX      DC    D'0'               WORK AREA.                            03650001
DMXR     EQU   0                  READ LAST.                            03700001
DMXW     EQU   4                  WRITE LAST.                           03750001
DMXE     EQU   8                  GOING LAST.                           03800001
DMX4     EQU   DMX+4              TERMINAL FLAG BYTE                    03850001
DMX4C    EQU   X'80'              CLOSE                                 03900001
DMXERR   EQU   DMX+6                                                    03950001
         SPACE                                                          04000001
*********************************************************************** 04020000
*        MAPPING OF IOB                                            @D1A 04040000
*********************************************************************** 04060000
         SPACE 1                                                        04080000
DMIOB    DS    0D                                                       04100001
DMIF1    DC    BL1'01000010'      COMMAND CHAINING,UNRELATED(42).       04150001
DMIF2    DC    X'00'              2ND FLAG BYTE                         04200001
DMISNS   DC    H'0'               TWO SENSE BYTES.                      04250001
DMIECBP  DC    F'0'               (DYNAMIC) ECB CODE AND PTR.           04300000
DMIECBK  EQU   X'7F'                         7F  ERROR FREE             04350001
DMIECBX  EQU   X'41'                         41  PERMANENT ERROR        04400001
DMIECBR  EQU   X'44'                         44  INTERCEPT RETRY        04450001
DMIUX    EQU   1                  CANCEL, UNIT EXCEPTION.               04500001
DMICSW   DC    D'0'               CHANNEL STATUS WORD.                  04550001
DMISTUS  EQU   DMICSW+4           STATUS BYTE.                          04600001
DMICPA   DC    A(DMCCW)           (DYNAMIC) CHANNEL PROGRAM ADDRESS.    04650000
DMIDCB   DC    F'0'               (DYNAMIC) DCB PTR.                    04700000
DMIRST   DC    F'0'               RESTART POINTER.                      04750001
DMIBLK   DC    H'0'               BLOCK COUNT (UNUSED)                  04800001
DMIERR   DC    H'0'               ERROR COUNT (UNUSED)                  04850001
         DC    2F'0'              IOB EXTENSION FOR DISPLAY CONSOLES   X04866600
                                                                   @D1A 04883200
         SPACE                                                          04900001
*********************************************************************** 04910000
*        MAPPING OF CCW DEFINITIONS - READ                         @D1A 04920000
*********************************************************************** 04930000
         SPACE 1                                                        04940000
DMCCW    DS    0D            CCW DEFINITIONS.                      @D1C 04950000
DMCREAD  DC    X'0A'         READ CODE.                                 05050001
DMCRDATA DC    FL3'0'        DATA PTR.                                  05100001
DMCRFLAG DC    BL1'01100000' CC,SLI.                                    05150001
         DC    X'00'                                                    05200001
DMCRNBR  DC    FL2'1'        COUNT FIELD.                               05250001
         SPACE                                                          05266600
*********************************************************************** 05283200
*        MAPPING OF CCW DEFINITIONS - TRANSFER TO NOP              @D1A 05299800
*********************************************************************** 05316400
         SPACE 1                                                        05333000
DMCTRA   DC    X'08'         TRANSFER IN CHANNEL.                       05350001
         DC    AL3(DMCNOP)   TO NOP.                                    05400001
         DC    F'0'          IGNORED.                                   05450001
         EJECT                                                          05466600
*********************************************************************** 05483200
*        MAPPING OF CCW DEFINITIONS - WRITE                        @D1A 05499800
*********************************************************************** 05516400
         SPACE 1                                                        05533000
DMCWRITE DC    X'09'         WRITE CODE.                                05550001
DMCWDATA DC    FL3'0'        DATA PTR.                                  05600001
DMCWFLAG DC    BL1'01100000' CC,SLI.                                    05650001
         DC    X'00'                                                    05700001
DMCWNBR  DC    FL2'1'             COUNT FIELD.                          05750001
         SPACE 1                                                        05780000
*********************************************************************** 05810000
*        MAPPING OF CCW DEFINITIONS - NOP                          @D1A 05840000
*                                                                  @D1A 05870000
*        ACTIVE COMMANDS CHAINED TO NOP FORCES DEVICE END AND      @D1A 05900000
*        CHANNEL END TO OCCUR TOGETHER, AVOIDING FUTURE INTERCEPTS,@D1A 05930000
*        ALLOWING CURRENT ERROR CHECK.                             @D1A 05960000
*********************************************************************** 05990000
         SPACE 1                                                        06020000
DMCNOP   DC    X'03'              NOP CODE                              06050001
         DC    FL3'0'             NO DATA                               06100001
         DC    BL1'00100000'      SLI                                   06150001
         DC    X'00'                                                    06200001
         DC    FL2'1'             NON-ZERO COUNT                        06250001
         SPACE 1                                                        06266600
*********************************************************************** 06283200
*        MAPPING OF CCW DEFINITIONS - ALARM                        @D1A 06299800
*********************************************************************** 06316400
         SPACE 1                                                        06333000
DMCGONG  DC    X'0B'              GONG CODE                             06350001
         DC    FL3'0'             NO DATA                               06400001
         DC    BL1'00100000'      SLI.                                  06450001
         DC    X'00'                                                    06500001
         DC    FL2'1'             NON ZERO COUNT                        06550001
         MEND                                                           06600001
