* %GOTO CLRAL1;                     /* BILINGUAL MAPPING                00050000
         MACRO                                                          00100000
         IEEVC102 ,                                                  */ 00150000
*%CLRAL1: ;                                                             00200000
*/**START OF SPECIFICATIONS**************************************@P2C*/ 00250000
*/*                                                                  */ 00300000
*/*                            IEEVC102                              */ 00350000
*/*                                                                  */ 00400000
*/* DESCRITPIVE                                                      */ 00450000
*/*        NAME   - COLOR ATTRIBUTE TABLE (CLRATT)                   */ 00500000
*/*                                                                  */ 00550000
*/*01* PROPRIETARY STATEMENT=                                        */ 00587500
*/***PROPRIETARY_STATEMENT********************************************/ 00625000
*/*                                                                  */ 00662500
*/*                                                                  */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00737500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00775000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1981, 1999                      */ 00812500
*/*                                                                  */ 00850000
*/* STATUS= JBB6607                                                  */ 00865600
*/*                                                                  */ 00881200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00896800
*/*                                                                  */ 00912500
*/* EXTERNAL CLASSIFICATION: NONE                                    */ 00925000
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00937500
*/*                                                                  */ 00950000
*/* FUNCTION      - MAPS THE COLOR/HIGHLIGHTING ATTRIBUTE TABLES     */ 01000000
*/*                                                                  */ 01050000
*/* INVOCATION    - IN PLS SPECIFY: %INCLUDE SYSLIB(IEEVC102)        */ 01100000
*/*                 IF ALL TABLES ARE REQUIRED, SET %CLRALLTB        */ 01116600
*/*                 TO 'YES'.                                        */ 01124900
*/*                 IF THE TABLE SHOULD BE INITIALIZED, SET      @D1A*/ 01133200
*/*                 %CLRINIT TO 'YES'.                           @D1A*/ 01141500
*/*                                                                  */ 01150000
*/*                 IN BAL SPECIFY: IEEVC102                         */ 01200000
*/*                 USING ON CLRATT GIVES ADDRESSABILITY TO ALL      */ 01250000
*/*                 SYMBOLS.                                         */ 01300000
*/*                                                                  */ 01350000
*/* CREATED BY    - IEECVGCI(DIDOCS INITIALIZATION)                  */ 01400000
*/*                 IEECB805(SET MPF COMMAND PROCESSOR)              */ 01450000
*/*                                                                  */ 01500000
*/* POINTED TO BY - UCMFCLRA IN THE UCM FIXED EXTENSION BASE         */ 01550000
*/*                                                                  */ 01600000
*/* SERIALIZATION - CMS AND LOCAL LOCKS                              */ 01650000
*/*                                                                  */ 01700000
*/* SUBPOOL/KEY   - 230 AND 0                                        */ 01750000
*/*                                                                  */ 01800000
*/* CHANGE                                                           */ 01850000
*/*    ACTIVITY   - G860PSS - NEW FOR THIS SUPPORT                   */ 01900000
*/*                 ZMC0852                                  @ZMC0852*/ 01925000
*/* $D1=DCR43,    JBB2125, 821225, PDSS: 3290 SUPPORT                */ 01937500
*/* $L1=NETSY6HK, JBB4422, 901112, PDHK: NETVIEW AUTOMATION          */ 01943700
*/* $P1=PKI0227,  JBB4422, 910515, PDHL: CHANGE COPYRIGHT STATEMENT  */ 01946800
*/* $P2=PKI0335,  JBB4422, 910620, PDCM: CHANGE COPYRIGHT STATEMENT  */ 01948400
*/* $P3=PWA0053,  JBB6607, 980128, PDZH: CHANGED DISTLIB TO AMODGEN  */ 01949200
*/*                                                                  */ 01950000
*/**END OF SPECIFICATIONS****************************************@P2C*/ 02000000
* %GOTO CLRAL2;                     /*                                  02050000
.* A 000000-999999 EXTENDED COLOR SUPPORT                      @G860PSS 02100000
.* C CLRATRLN FOR EVETACTN TO CORRECT LENGTH                   @ZMC0852 02125000
.* A ADD INTENSITY FIELDS                                          @D1A 02137500
.* A ADD SUFFIX FIELDS, DELETE CLRMEMBR                            @L1A 02138300
.* C CHANGE COPYRIGHT STATEMENT                                    @P1C 02138700
.* C CHANGE COPYRIGHT STATEMENT                                    @P2C 02138900
         EJECT                                                          02139200
*********************************************************************** 02140900
*                                                                     * 02142600
*        COLOR/HIGHLIGHTING ATTRIBUTE TABLE                           * 02144300
*                                                                     * 02146000
*********************************************************************** 02147700
         SPACE 1                                                        02150000
CLRATT   DSECT                    COLOR/HIGHLIGHTING ATTRIBUTE TABLE    02200000
CLRNAME  DS    CL4                ACROYNM 'CLRA'                        02250000
CLRVER   DS    CL1                VERSION LEVEL                         02300000
CLRSP21  EQU   1                  CLRATT IS AT OS/VS2 HBB2102 LEVEL     02350000
CLRSP212 EQU   2                  CLRATT IS AT OS/VS2 JBB2125 LEVEL    X02375000
                                                                   @D1A 02400000
CLRSP422 EQU   3                  CLRATT IS AT MVS/ESA JBB4222 LEVEL   X02425000
                                                                   @L1A 02450000
CLRVERSN EQU   CLRSP422           CURRENT VERSION LEVEL            @L1C 02500000
CLRATTRS DS    0C                 ATTRIBUTES                            02525000
         DS    0CL6               ATTRIBUTES FOR URGENT ATTENION       X02550000
                                  MESSAGES                         @L1C 02600000
CLRCAURG DS    CL1                  COLOR ATTRIBUTE                     02650000
CLRHAURG DS    CL1                  HIGHLIGHTING ATTRIBUTE              02700000
CLRIAURG DS    CL1                  INTENSITY ATTRIBUTE            @D1A 02737500
CLRSAURG DS    CL3                  SUFFIX                         @L1A 02765600
         DS    0CL6               ATTRIBUTES FOR IMMEDIATE ACTION      X02793700
                                  MESSAGES                         @L1C 02821800
CLRCAIMM DS    CL1                  COLOR ATTRIBUTE                     02850000
CLRHAIMM DS    CL1                  HIGHLIGHTING ATTRIBUTE              02900000
CLRIAIMM DS    CL1                  INTENSITY ATTRIBUTE            @D1A 02937500
CLRSAIMM DS    CL3                  SUFFIX                         @L1A 02965600
         DS    0CL6               ATTRIBUTES FOR EVENTUAL ACTION       X02993700
                                  MESSAGES                         @L1C 03021800
CLRCAEVE DS    CL1                  COLOR ATTRIBUTE                     03050000
CLRHAEVE DS    CL1                  HIGHLIGHTING ATTRIBUTE              03100000
CLRIAEVE DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03133300
CLRSAEVE DS    CL3                  SUFFIX                         @L1A 03155500
         DS    0CL6               ATTRIBUTES FOR GENERAL MESSAGES  @L1C 03177700
CLRCAGEN DS    CL1                  COLOR ATTRIBUTE                     03200000
CLRHAGEN DS    CL1                  HIGHLIGHTING ATTRIBUTE              03250000
CLRIAGEN DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03287500
CLRSAGEN DS    CL3                  SUFFIX                         @L1A 03315600
         DS    0CL6               ATTRIBUTES FOR PROBLEM PROGRAM       X03343700
                                  MESSAGES                         @L1C 03371800
CLRCAPPM DS    CL1                  COLOR ATTRIBUTE                     03400000
CLRHAPPM DS    CL1                  HIGHLIGHTING ATTRIBUTE              03450000
CLRIAPPM DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03475000
CLRSAPPM DS    CL3                  SUFFIX                         @L1A 03493700
         DS    0CL6               ATTRIBUTES FOR SELECTOR PEN FIELDS   X03512400
                                                                   @L1C 03531100
CLRCASEL DS    CL1                  COLOR ATTRIBUTE                     03550000
CLRHASEL DS    CL1                  HIGHLIGHTING ATTRIBUTE              03600000
CLRIASEL DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03637500
CLRSASEL DS    CL3                  SUFFIX                         @L1A 03665600
         DS    0CL6               ATTRIBUTES FOR ERROR MESSAGES        X03693700
                                  DISPLAYED IN INSTRUCTION LINE    @L1C 03721800
CLRCAINS DS    CL1                  COLOR ATTRIBUTE                     03750000
CLRHAINS DS    CL1                  HIGHLIGHTING ATTRIBUTE              03800000
CLRIAINS DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03833300
CLRSAINS DS    CL3                  SUFFIX                         @L1A 03855500
         DS    0CL6               ATTRIBUTES FOR ENTRY AREA        @L1C 03877700
CLRCAENT DS    CL1                  COLOR ATTRIBUTE                     03900000
CLRHAENT DS    CL1                  HIGHLIGHTING ATTRIBUTE              03950000
CLRIAENT DS    CL1                  INTENSITY ATTRIBUTE            @D1A 03987500
CLRSAENT DS    CL3                  SUFFIX                         @L1A 04015600
         DS    0CL6               ATTRIBUTES FOR LEFT SIDE OF          X04043700
                                  WARNING LINE - GENERAL MESSAGES  @L1C 04071800
CLRCAWLG DS    CL1                  COLOR ATTRIBUTE                     04100000
CLRHAWLG DS    CL1                  HIGHLIGHTING ATTRIBUTE              04150000
CLRIAWLG DS    CL1                  INTENSITY ATTRIBUTE            @D1A 04187500
CLRSAWLG DS    CL3                  SUFFIX                         @L1A 04215600
         DS    0CL6               ATTRIBUTES FOR RIGHT SIDE OF         X04243700
                                  WARNING LINE - GENERAL MESSAGES  @L1C 04271800
CLRCAWRG DS    CL1                  COLOR ATTRIBUTE                     04300000
CLRHAWRG DS    CL1                  HIGHLIGHTING ATTRIBUTE              04350000
CLRIAWRG DS    CL1                  INTENSITY ATTRIBUTE            @D1A 04383300
CLRSAWRG DS    CL3                  SUFFIX                         @L1A 04405500
         DS    0CL6               ATTRIBUTES FOR RIGHT SIDE OF         X04427700
                                  WARNING LINE - URGENT ATTENTION      X04450000
                                  MESSAGES                         @L1C 04500000
CLRCAWRU DS    CL1                  COLOR ATTRIBUTE                     04550000
CLRHAWRU DS    CL1                  HIGHLIGHTING ATTRIBUTE              04600000
CLRIAWRU DS    CL1                  INTENSITY ATTRIBUTE            @D1A 04625000
CLRSAWRU DS    CL3                  SUFFIX                         @L1A 04643700
         DS    0CL6               ATTRIBUTES FOR O-O-L CONTROL LINE    X04662400
                                                                   @L1C 04681100
CLRCAOLC DS    CL1                  COLOR ATTRIBUTE                     04700000
CLRHAOLC DS    CL1                  HIGHLIGHTING ATTRIBUTE              04750000
CLRIAOLC DS    CL1                  INTENSITY ATTRIBUTE            @D1A 04783300
CLRSAOLC DS    CL3                  SUFFIX                         @L1A 04805500
         DS    0CL6               ATTRIBUTES FOR O-O-L LABEL LINES @L1C 04827700
CLRCAOLL DS    CL1                  COLOR ATTRIBUTE                     04850000
CLRHAOLL DS    CL1                  HIGHLIGHTING ATTRIBUTE              04900000
CLRIAOLL DS    CL1                  INTENSITY ATTRIBUTE            @D1A 04933300
CLRSAOLL DS    CL3                  SUFFIX                         @L1A 04955500
         DS    0CL6               ATTRIBUTES FOR O-O-L DATA LINES  @L1C 04977700
CLRCAOLD DS    CL1                  COLOR ATTRIBUTE                     05000000
CLRHAOLD DS    CL1                  HIGHLIGHTING ATTRIBUTE              05050000
CLRIAOLD DS    CL1                  INTENSITY ATTRIBUTE            @D1A 05058300
CLRSAOLD DS    CL3                  SUFFIX                         @L1A 05062400
         SPACE 1                                                        05066600
CLRALEN  EQU   *-CLRATT           LENGTH OF ATTRIBUTE TABLE             05083200
         EJECT                                                          05100000
*********************************************************************** 05150000
*                                                                     * 05200000
*        VALUES FOR THE COLOR ATTRIBUTES                              * 05250000
*                                                                     * 05300000
*********************************************************************** 05350000
         SPACE 1                                                        05400000
CLRBLUE  EQU   X'F1'              THE COLOR BLUE                        05450000
CLRRED   EQU   X'F2'              THE COLOR RED                         05500000
CLRPINK  EQU   X'F3'              THE COLOR PINK                        05550000
CLRGREEN EQU   X'F4'              THE COLOR GREEN                       05600000
CLRTURQ  EQU   X'F5'              THE COLOR TURQUOISE                   05650000
CLRYELOW EQU   X'F6'              THE COLOR YELLOW                      05700000
CLRWHITE EQU   X'F7'              THE COLOR WHITE                       05750000
         SPACE 1                                                        05800000
*********************************************************************** 05850000
*                                                                     * 05900000
*        VALUES FOR THE HIGHLIGHTING ATTRIBUTES                       * 05950000
*                                                                     * 06000000
*********************************************************************** 06050000
         SPACE 1                                                        06100000
CLRHNONE EQU   X'00'              NO HIGHLIGHTING IS IN EFFECT     @D1C 06150000
CLRBLINK EQU   X'F1'              HIGHLIGHTING IS BLINKING              06200000
CLRRVIDO EQU   X'F2'              HIGHLIGHTING IS REVERSE VIDEO         06250000
CLRUNDER EQU   X'F4'              HIGHLIGHTING IS UNDERSCORING          06300000
         SPACE 1                                                        06305000
*********************************************************************** 06310000
*                                                                     * 06315000
*        VALUES FOR THE INTENSITY ATTRIBUTES                       @D1A 06320000
*                                                                     * 06325000
*********************************************************************** 06330000
         SPACE 1                                                        06335000
CLRINORM EQU   X'E4'              INTENSITY IS NORMAL              @D1A 06340000
CLRIHIGH EQU   X'E8'              INTENSITY IS HIGH                @D1A 06345000
         MEND  , */                                                     06350000
*%CLRAL2: ;                                                             06400000
*%IF CLRINIT = 'YES' %THEN %GOTO CLRAL3; %ELSE %; /*             @D1A*/ 06418700
*@EJECT;                                                                06428100
*           /* COLOR/HIGHLIGHTING ATTRIBUTE TABLE                    */ 06437500
*DCL 1 CLRATT BDY(WORD) BASED(CLRAPTR),                                 06475000
*                                                                       06512500
*      2 CLRNAME      CHAR(4),      /* ACROYNM 'CLRA'                */ 06550000
*      2 CLRVER       CHAR(1),      /* VERSION LEVEL                 */ 06600000
*      2 CLRATTRS,                  /* ATTRIBUTES                    */ 06733300
*       3 *,                        /* ATTRIBUTES FOR URGENT ATTENION   06766600
*                                      MESSAGES                      */ 06800000
*        4 CLRCAURG CHAR(1),        /* COLOR ATTRIBUTE               */ 06850000
*        4 CLRHAURG CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 06900000
*        4 CLRIAURG CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 06925000
*        4 CLRSAURG CHAR(3),        /* SUFFIX                    @L1A*/ 06937500
*       3 *,                        /* ATTRIBUTES FOR IMMEDIATE ACTION  06950000
*                                      MESSAGES                      */ 07000000
*        4 CLRCAIMM CHAR(1),        /* COLOR ATTRIBUTE               */ 07050000
*        4 CLRHAIMM CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 07100000
*        4 CLRIAIMM CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 07125000
*        4 CLRSAIMM CHAR(3),        /* SUFFIX                    @L1A*/ 07137500
*       3 *,                        /* ATTRIBUTES FOR EVENTUAL ACTION   07150000
*                                      MESSAGES                      */ 07200000
*        4 CLRCAEVE CHAR(1),        /* COLOR ATTRIBUTE               */ 07250000
*        4 CLRHAEVE CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 07300000
*        4 CLRIAEVE CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 07325000
*        4 CLRSAEVE CHAR(3),        /* SUFFIX                    @L1A*/ 07337500
*       3 *,                        /* ATTRIBUTES FOR GENERAL           07350000
*                                      MESSAGES                      */ 07400000
*        4 CLRCAGEN CHAR(1),        /* COLOR ATTRIBUTE               */ 07450000
*        4 CLRHAGEN CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 07500000
*        4 CLRIAGEN CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 07525000
*        4 CLRSAGEN CHAR(3),        /* SUFFIX                    @L1A*/ 07537500
*       3 *,                        /* ATTRIBUTES FOR PROBLEM PROGRAM   07550000
*                                      MESSAGES                      */ 07600000
*        4 CLRCAPPM CHAR(1),        /* COLOR ATTRIBUTE               */ 07650000
*        4 CLRHAPPM CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 07700000
*        4 CLRIAPPM CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 07725000
*        4 CLRSAPPM CHAR(3),        /* SUFFIX                    @L1A*/ 07737500
*       3 *,                        /* ATTRIBUTES FOR SELECTOR PEN      07750000
*                                      FIELDS                        */ 07800000
*        4 CLRCASEL CHAR(1),        /* COLOR ATTRIBUTE               */ 07850000
*        4 CLRHASEL CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 07900000
*        4 CLRIASEL CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 07925000
*        4 CLRSASEL CHAR(3),        /* SUFFIX                    @L1A*/ 07937500
*       3 *,                        /* ATTRIBUTES FOR ERROR MESSAGES    07950000
*                                      DISPLAYED IN INSTRUCTION LINE */ 08000000
*        4 CLRCAINS CHAR(1),        /* COLOR ATTRIBUTE               */ 08050000
*        4 CLRHAINS CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 08100000
*        4 CLRIAINS CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 08125000
*        4 CLRSAINS CHAR(3),        /* SUFFIX                    @L1A*/ 08137500
*       3 *,                        /* ATTRIBUTES FOR ENTRY AREA     */ 08150000
*        4 CLRCAENT CHAR(1),        /* COLOR ATTRIBUTE               */ 08200000
*        4 CLRHAENT CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 08250000
*        4 CLRIAENT CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 08275000
*        4 CLRSAENT CHAR(3),        /* SUFFIX                    @L1A*/ 08287500
*       3 *,                        /* ATTRIBUTES FOR LEFT SIDE OF      08300000
*                                      WARNING LINE - GENERAL MESSAGES  08350000
*                                                                    */ 08400000
*        4 CLRCAWLG CHAR(1),        /* COLOR ATTRIBUTE               */ 08450000
*        4 CLRHAWLG CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 08500000
*        4 CLRIAWLG CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 08525000
*        4 CLRSAWLG CHAR(3),        /* SUFFIX                    @L1A*/ 08537500
*       3 *,                        /* ATTRIBUTES FOR RIGHT SIDE OF     08550000
*                                      WARNING LINE - GENERAL MESSAGES  08600000
*                                                                    */ 08650000
*        4 CLRCAWRG CHAR(1),        /* COLOR ATTRIBUTE               */ 08700000
*        4 CLRHAWRG CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 08750000
*        4 CLRIAWRG CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 08775000
*        4 CLRSAWRG CHAR(3),        /* SUFFIX                    @L1A*/ 08787500
*       3 *,                        /* ATTRIBUTES FOR RIGHT SIDE OF     08800000
*                                      WARNING LINE - URGENT ATTENTION  08850000
*                                      MESSAGES                      */ 08900000
*        4 CLRCAWRU CHAR(1),        /* COLOR ATTRIBUTE               */ 08950000
*        4 CLRHAWRU CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 09000000
*        4 CLRIAWRU CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 09025000
*        4 CLRSAWRU CHAR(3),        /* SUFFIX                    @L1A*/ 09037500
*       3 *,                        /* ATTRIBUTES FOR O-O-L CONTROL     09050000
*                                      LINE                          */ 09100000
*        4 CLRCAOLC CHAR(1),        /* COLOR ATTRIBUTE               */ 09150000
*        4 CLRHAOLC CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 09200000
*        4 CLRIAOLC CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 09225000
*        4 CLRSAOLC CHAR(3),        /* SUFFIX                    @L1A*/ 09237500
*       3 *,                        /* ATTRIBUTES FOR O-O-L LABEL       09250000
*                                      LINES                         */ 09300000
*        4 CLRCAOLL CHAR(1),        /* COLOR ATTRIBUTE               */ 09350000
*        4 CLRHAOLL CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 09400000
*        4 CLRIAOLL CHAR(1),        /* INTENSITY ATTRIBUTE       @D1A*/ 09425000
*        4 CLRSAOLL CHAR(3),        /* SUFFIX                    @L1A*/ 09437500
*       3 *,                        /* ATTRIBUTES FOR O-O-L DATA        09450000
*                                      LINES                         */ 09500000
*        4 CLRCAOLD CHAR(1),        /* COLOR ATTRIBUTE               */ 09521400
*        4 CLRHAOLD CHAR(1),        /* HIGHLIGHTING ATTRIBUTE        */ 09521700
*        4 CLRIAOLD CHAR(1),        /* INTENSITY ATTRIBUTE       @L1C*/ 09521900
*        4 CLRSAOLD CHAR(3);        /* SUFFIX                    @L1A*/ 09522100
* %GOTO CLRAL4;                     /*                           @D1A*/ 09522300
*%CLRAL3:;                        /*                             @D1C*/ 09522400
*@EJECT;                                                                09522500
*           /* COLOR/HIGHLIGHTING ATTRIBUTE TABLE                    */ 09522600
*DCL 1 CLRATT,                      /* COLOR/HIGHLIGHTING ATTRIBUTE     09522700
*                                      TABLE                     @D1A*/ 09522900
*      2 CLRNAME  CHAR(4) INIT('CLRA'), /* ACRONYM               @D1A*/ 09523200
*      2 CLRVER   CHAR(1) INIT(CLRVERSN),/* VERSION LEVEL        @D1A*/ 09523500
*      2 CLRATTRS,                  /* ATTRIBUTES                @D1A*/ 09524700
*       3 *,                        /* ATTRIBUTES FOR URGENT ATTENION   09525000
*                                      MESSAGES                  @D1A*/ 09525300
* 4 CLRCAURG CHAR(1) INIT(CLRRED),  /* COLOR ATTRIBUTE           @D1A*/ 09525600
* 4 CLRHAURG CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09525900
* 4 CLRIAURG CHAR(1) INIT(CLRIHIGH),/* INTENSITY ATTRIBUTE       @D1A*/ 09526200
* 4 CLRSAURG CHAR(3) INIT('DFL'),  /* INTENSITY ATTRIBUTE       @D1A*/  09526300
*       3 *,                        /* ATTRIBUTES FOR IMMEDIATE ACTION  09526500
*                                      MESSAGES                  @D1A*/ 09526800
* 4 CLRCAIMM CHAR(1) INIT(CLRWHITE),/* COLOR ATTRIBUTE           @D1A*/ 09527100
* 4 CLRHAIMM CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09527400
* 4 CLRIAIMM CHAR(1) INIT(CLRIHIGH),/* INTENSITY ATTRIBUTE       @D1A*/ 09527700
* 4 CLRSAIMM CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09527800
*       3 *,                        /* ATTRIBUTES FOR EVENTUAL ACTION   09528000
*                                      MESSAGES                  @D1A*/ 09528300
* 4 CLRCAEVE CHAR(1) INIT(CLRGREEN),/* COLOR ATTRIBUTE           @D1A*/ 09528600
* 4 CLRHAEVE CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09528900
* 4 CLRIAEVE CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09529200
* 4 CLRSAEVE CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09529300
*       3 *,                        /* ATTRIBUTES FOR GENERAL           09529500
*                                      MESSAGES                  @D1A*/ 09529800
* 4 CLRCAGEN CHAR(1) INIT(CLRGREEN),/* COLOR ATTRIBUTE           @D1A*/ 09530100
* 4 CLRHAGEN CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09530400
* 4 CLRIAGEN CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09530700
* 4 CLRSAGEN CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09530800
*       3 *,                        /* ATTRIBUTES FOR PROBLEM PROGRAM   09531000
*                                      MESSAGES                  @D1A*/ 09531300
* 4 CLRCAPPM CHAR(1) INIT(CLRGREEN),/* COLOR ATTRIBUTE           @D1A*/ 09531600
* 4 CLRHAPPM CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09531900
* 4 CLRIAPPM CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09532200
* 4 CLRSAPPM CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09532300
*       3 *,                        /* ATTRIBUTES FOR SELECTOR PEN      09532500
*                                      FIELDS                    @D1A*/ 09532800
* 4 CLRCASEL CHAR(1) INIT(CLRBLUE), /* COLOR ATTRIBUTE           @D1A*/ 09533100
* 4 CLRHASEL CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09533400
* 4 CLRIASEL CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09533700
* 4 CLRSASEL CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09533800
*       3 *,                        /* ATTRIBUTES FOR ERROR MESSAGES    09534000
*                                      DISPLAYED IN INSTRUCTION LINE */ 09534300
* 4 CLRCAINS CHAR(1) INIT(CLRWHITE),/* COLOR ATTRIBUTE           @D1A*/ 09534600
* 4 CLRHAINS CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09534900
* 4 CLRIAINS CHAR(1) INIT(CLRIHIGH),/* INTENSITY ATTRIBUTE       @D1A*/ 09535200
* 4 CLRSAINS CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09535300
*       3 *,                        /* ATTRIBUTES FOR ENTRY AREA @D1A*/ 09535500
* 4 CLRCAENT CHAR(1) INIT(CLRGREEN),/* COLOR ATTRIBUTE           @D1A*/ 09535800
* 4 CLRHAENT CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09536100
* 4 CLRIAENT CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09536400
* 4 CLRSAENT CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09536500
*       3 *,                        /* ATTRIBUTES FOR LEFT SIDE OF      09536700
*                                      WARNING LINE - GENERAL MESSAGES  09537000
*                                                                @D1A*/ 09537300
* 4 CLRCAWLG CHAR(1) INIT(CLRBLUE), /* COLOR ATTRIBUTE           @D1A*/ 09537600
* 4 CLRHAWLG CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09537900
* 4 CLRIAWLG CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09538200
* 4 CLRSAWLG CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09538300
*       3 *,                        /* ATTRIBUTES FOR RIGHT SIDE OF     09538500
*                                      WARNING LINE - GENERAL MESSAGES  09538800
*                                                                @D1A*/ 09539100
* 4 CLRCAWRG CHAR(1) INIT(CLRBLUE), /* COLOR ATTRIBUTE           @D1A*/ 09539400
* 4 CLRHAWRG CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09539700
* 4 CLRIAWRG CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09540000
* 4 CLRSAWRG CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09540100
*       3 *,                        /* ATTRIBUTES FOR RIGHT SIDE OF     09540300
*                                      WARNING LINE - URGENT ATTENTION  09540600
*                                      MESSAGES                  @D1A*/ 09540900
* 4 CLRCAWRU CHAR(1) INIT(CLRRED),  /* COLOR ATTRIBUTE           @D1A*/ 09541200
* 4 CLRHAWRU CHAR(1) INIT(CLRBLINK),/* HIGHLIGHTING ATTRIBUTE    @D1A*/ 09541500
* 4 CLRIAWRU CHAR(1) INIT(CLRIHIGH),/* INTENSITY ATTRIBUTE       @D1A*/ 09541800
* 4 CLRSAWRU CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09541900
*       3 *,                        /* ATTRIBUTES FOR O-O-L CONTROL     09542100
*                                      LINE                      @D1A*/ 09542400
* 4 CLRCAOLC CHAR(1) INIT(CLRTURQ), /* COLOR ATTRIBUTE           @D1A*/ 09542700
* 4 CLRHAOLC CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09543000
* 4 CLRIAOLC CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09543300
* 4 CLRSAOLC CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09543400
*       3 *,                        /* ATTRIBUTES FOR O-O-L LABEL       09543600
*                                      LINES                     @D1A*/ 09543900
* 4 CLRCAOLL CHAR(1) INIT(CLRTURQ), /* COLOR ATTRIBUTE           @D1A*/ 09544200
* 4 CLRHAOLL CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09544500
* 4 CLRIAOLL CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @D1A*/ 09544800
* 4 CLRSAOLL CHAR(3) INIT('DFL'),   /* SUFFIX                    @L1A*/ 09544900
*       3 *,                        /* ATTRIBUTES FOR O-O-L DATA        09545100
*                                      LINES                     @D1A*/ 09545400
* 4 CLRCAOLD CHAR(1) INIT(CLRGREEN),/* COLOR ATTRIBUTE           @D1A*/ 09545700
* 4 CLRHAOLD CHAR(1) INIT(CLRHNONE), /* HIGHLIGHTING ATTRIBUTE   @D1A*/ 09546000
* 4 CLRIAOLD CHAR(1) INIT(CLRINORM),/* INTENSITY ATTRIBUTE       @L1C*/ 09546200
* 4 CLRSAOLD CHAR(3) INIT('DFL');   /* SUFFIX                    @L1A*/ 09546400
*%CLRAL4:;                          /*                           @D1A*/ 09546600
* @EJECT;                                                               09553500
*           /* COLOR/HIGHLIGHTING ATTRIBUTE TABLE ENTRY MAPPING      */ 09564200
*DCL 1 CLRATTR(14) BASED(ADDR(CLRATTRS)),                               09585600
*     2  CLRCOLOR CHAR(1),          /* COLOR ATTRIBUTE               */ 09607000
*     2  CLRLIGHT CHAR(1),          /* HIGHLIGHTING ATTRIBUTE        */ 09638000
*     2  CLRINTEN CHAR(1),          /* INTENSITY ATTRIBUTE       @D1A*/ 09658600
*     2  CLRSUFFX CHAR(3);          /* MEMBER SUFFIX             @L1A*/ 09679200
*         /* VALUES OF THE VERSION LEVEL TO BE PUT IN FIELD CLRVER   */ 09700000
*DCL CLRSP21  FIXED(8) CONSTANT(1), /* CLRATT IS AT OS/VS2 HBB2102      09750000
*                                      LEVEL                         */ 09800000
*    CLRSP212 FIXED(8) CONSTANT(2), /* CLRATT IS AT OS/VS2 JBB2125      09820000
*                                      LEVEL                     @D1A*/ 09840000
*    CLRSP422 FIXED(8) CONSTANT(3), /* CLRATT IS AT MVS/ESA JBB4422     09852000
*                                      LEVEL                     @L1A*/ 09864000
*    CLRVERSN FIXED(8) CONSTANT(CLRSP422);/* CURRENT VERSION LEVEL      09876000
*                                                                @L1C*/ 09888000
* @SPACE(1);                                                            09900000
*         /* VALUES FOR THE COLOR ATTRIBUTES                         */ 09950000
*DCL CLRBLUE  BIT(8) CONSTANT('F1'X), /* THE COLOR BLUE              */ 10000000
*    CLRRED   BIT(8) CONSTANT('F2'X), /* THE COLOR RED               */ 10050000
*    CLRPINK  BIT(8) CONSTANT('F3'X), /* THE COLOR PINK              */ 10100000
*    CLRGREEN BIT(8) CONSTANT('F4'X), /* THE COLOR GREEN             */ 10150000
*    CLRTURQ  BIT(8) CONSTANT('F5'X), /* THE COLOR TURQUOISE         */ 10200000
*    CLRYELOW BIT(8) CONSTANT('F6'X), /* THE COLOR YELLOW            */ 10250000
*    CLRWHITE BIT(8) CONSTANT('F7'X); /* THE COLOR WHITE             */ 10300000
* @SPACE(1);                                                            10350000
*         /* VALUES FOR THE HIGHLIGHTING ATTRIBUTES                  */ 10400000
*DCL CLRHNONE BIT(8) CONSTANT('00'X), /* NO HIGHLIGHTING IS IN EFFECT   10433300
                                                                 @D1C*/ 10466600
*    CLRBLINK BIT(8) CONSTANT('F1'X), /* HIGHLIGHTING IS BLINKING    */ 10500000
*    CLRRVIDO BIT(8) CONSTANT('F2'X), /* HIGHLIGHTING IS REVERSE        10550000
*                                         VIDEO                      */ 10600000
*    CLRUNDER BIT(8) CONSTANT('F4'X); /* HIGHLIGHTING IS UNDERSCORING   10650000
*                                                                    */ 10700000
* @SPACE(1);                                                            10716600
*         /* VALUES FOR THE INTENSITY ATTRIBUTES                 @L1C*/ 10733200
*DCL CLRINORM BIT(8) CONSTANT('E4'X), /* INTENSITY IS NORMAL     @D1A*/ 10749800
*    CLRIHIGH BIT(8) CONSTANT('E8'X); /* INTENSITY IS HIGH       @L1C*/ 10766400
*%IF CLRALLTB ~= 'YES' %THEN %GOTO CLRAL5; %ELSE %; /*           @D1C*/ 10783000
*      /* ATTRIBUTE TABLE MAPPING                                    */ 10850000
*DCL 1 CLRATTRM (14) BASED(ADDR(CLRATTRT)),                             10900000
*     2 * CHAR(9),                /* ATTRIBUTE ENTRY                 */ 10950000
*      3 CLRATRKY CHAR(8),        /* ATTRIBUTE KEYWORD               */ 11000000
*      3 CLRATRLN FIXED(8);       /* ATTRIBUTE KEYWORD LENGTH        */ 11050000
*@EJECT;                                                                11066600
*      /* ATTRIBUTE TABLE - THIS TABLE MUST MATCH IN ORDER THE          11083300
*         COLOR/HIGHLIGHTING FIELDS IN CLRATTRS */                      11116600
*DCL 1 CLRATTRT STATIC LOCAL,                                           11150000
*     2 * CHAR(9),                /* ATTRIBUTE ENTRY                 */ 11200000
*      3 * CHAR(8) INIT('URGATTN '), /* ATTRIBUTE KEYWORD            */ 11250000
*      3 * CHAR(1) INIT(7),       /* ATTRIBUTE KEYWORD LENGTH        */ 11300000
*     2 * CHAR(9),                                                      11350000
*      3 * CHAR(8) INIT('IMEDACTN'),                                    11400000
*      3 * CHAR(1) INIT(8),                                             11450000
*     2 * CHAR(9),                                                      11500000
*      3 * CHAR(8) INIT('EVETACTN'),                                    11550000
*      3 * CHAR(1) INIT(8),                   /*             @ZMC0852*/ 11551700
*     2 * CHAR(9),                                                      11553400
*      3 * CHAR(8) INIT('GENMSG  '),                                    11555100
*      3 * CHAR(1) INIT(6),                                             11556800
*     2 * CHAR(9),                                                      11558500
*      3 * CHAR(8) INIT('PPMSG   '),                                    11560200
*      3 * CHAR(1) INIT(5),                                             11561900
*     2 * CHAR(9),                                                      11563600
*      3 * CHAR(8) INIT('SELPEN  '),                                    11565300
*      3 * CHAR(1) INIT(6),                                             11567000
*     2 * CHAR(9),                                                      11568700
*      3 * CHAR(8) INIT('INSTRERR'),                                    11570400
*      3 * CHAR(1) INIT(8),                                             11572100
*     2 * CHAR(9),                                                      11573800
*      3 * CHAR(8) INIT('ENTRYARA'),                                    11575500
*      3 * CHAR(1) INIT(8),                                             11577200
*     2 * CHAR(9),                                                      11578900
*      3 * CHAR(8) INIT('WARNLGEN'),                                    11580600
*      3 * CHAR(1) INIT(8),                                             11582300
*     2 * CHAR(9),                                                      11584000
*      3 * CHAR(8) INIT('WARNRGEN'),                                    11585700
*      3 * CHAR(1) INIT(8),                                             11587400
*     2 * CHAR(9),                                                      11589100
*      3 * CHAR(8) INIT('WARNRURG'),                                    11590800
*      3 * CHAR(1) INIT(8),                                             11592500
*     2 * CHAR(9),                                                      11594200
*      3 * CHAR(8) INIT('OOLCNTL '),                                    11595900
*      3 * CHAR(1) INIT(7),                                             11600000
*     2 * CHAR(9),                                                      11650000
*      3 * CHAR(8) INIT('OOLLABEL'),                                    13050000
*      3 * CHAR(1) INIT(8),                                             13100000
*     2 * CHAR(9),                                                      13150000
*      3 * CHAR(8) INIT('OOLDATA '),                                    13200000
*      3 * CHAR(1) INIT(7);                                             13250000
*@EJECT;                                                                13300000
*      /* COLOR     TABLE MAPPING                                    */ 13350000
*DCL 1 CLRCOLRM (7) BASED(ADDR(CLRCOLRT)),                              13400000
*     2 * CHAR(7),                /* COLOR     ENTRY                 */ 13450000
*      3 CLRCOLKY CHAR(6),        /* COLOR     KEYWORD               */ 13500000
*      3 CLRCOLCD FIXED(8);       /* COLOR     CODE                  */ 13550000
*      /* COLOR     TABLE                                            */ 13600000
*DCL 1 CLRCOLRT STATIC LOCAL,                                           13650000
*     2 * CHAR(7),                        /* COLOR     ENTRY         */ 13700000
*      3 * CHAR(6) INIT('BLUE  '),        /* COLOR     KEYWORD       */ 13750000
*      3 * BIT (8) INIT(CLRBLUE),         /* COLOR     CODE          */ 13800000
*     2 * CHAR(7),                                                      13850000
*      3 * CHAR(6) INIT('RED   '),                                      13900000
*      3 * BIT (8) INIT(CLRRED),                                        13950000
*     2 * CHAR(7),                                                      14000000
*      3 * CHAR(6) INIT('PINK  '),                                      14050000
*      3 * BIT (8) INIT(CLRPINK),                                       14100000
*     2 * CHAR(7),                                                      14150000
*      3 * CHAR(6) INIT('GREEN '),                                      14200000
*      3 * BIT (8) INIT(CLRGREEN),                                      14250000
*     2 * CHAR(7),                                                      14300000
*      3 * CHAR(6) INIT('TURQU '),                                      14350000
*      3 * BIT (8) INIT(CLRTURQ),                                       14400000
*     2 * CHAR(7),                                                      14450000
*      3 * CHAR(6) INIT('YELLOW'),                                      14500000
*      3 * BIT (8) INIT(CLRYELOW),                                      14550000
*     2 * CHAR(7),                                                      14600000
*      3 * CHAR(6) INIT('WHITE '),                                      14650000
*      3 * BIT (8) INIT(CLRWHITE);                                      14700000
*@EJECT;                                                                14750000
*      /* HIGHLIGHTING TABLE MAPPING                                 */ 14800000
*DCL 1 CLRLITEM (4) BASED(ADDR(CLRLITET)),                              14850000
*     2 *,                          /* HIGHLIGHTING ENTRY        @D1C*/ 14900000
*      3 CLRLITKY CHAR(6),          /* HIGHLIGHTING KEYWORD      @D1C*/ 14950000
*      3 CLRLITCD BIT(8);           /* HIGHLIGHTING CODE             */ 15000000
*      /* HIGHLIGHTING TABLE                                         */ 15050000
*DCL 1 CLRLITET STATIC LOCAL,                                           15100000
*     2 *,                          /* HIGHLIGHTING ENTRY        @D1C*/ 15150000
*      3 * CHAR(6) INIT('NONE  '),  /* HIGHLIGHTING KEYWORD      @D1C*/ 15200000
*      3 * BIT (8) INIT(CLRHNONE),  /* HIGHLIGHTING CODE         @D1C*/ 15250000
*     2 *,                          /*                           @D1C*/ 15300000
*      3 * CHAR(6) INIT('BLINK '),  /*                           @D1C*/ 15350000
*      3 * BIT (8) INIT(CLRBLINK),                                      15400000
*     2 *,                          /*                           @D1C*/ 15450000
*      3 * CHAR(6) INIT('RE-VID'),  /*                           @D1C*/ 15500000
*      3 * BIT (8) INIT(CLRRVIDO),                                      15550000
*     2 *,                          /*                           @D1C*/ 15600000
*      3 * CHAR(6) INIT('UNDSCR'),  /*                           @D1C*/ 15650000
*      3 * BIT (8) INIT(CLRUNDER);                                      15700000
*@EJECT;                                                                15750000
*      /* INTENSITY TABLE MAPPING                                @D1A*/ 15800000
*DCL 1 CLRINTM  (2) BASED(ADDR(CLRINTT)),/*                      @D1A*/ 15850000
*     2 *,                        /* INTENSITY ENTRY             @D1A*/ 15900000
*      3 CLRINTKY CHAR(4),        /* INTENSITY KEYWORD           @D1A*/ 15950000
*      3 CLRINTCD BIT(8);         /* INTENSITY CODE              @D1A*/ 16000000
*      /* INTENSITY TABLE                                        @D1A*/ 16050000
*DCL 1 CLRINTT  STATIC LOCAL,     /*                             @D1A*/ 16100000
*     2 *,                        /* INTENSITY ENTRY             @D1A*/ 16150000
*      3 * CHAR(4) INIT('NORM'),  /* INTENSITY KEYWORD           @D1A*/ 16200000
*      3 * BIT (8) INIT(CLRINORM),/* INTENSITY CODE              @D1A*/ 16250000
*     2 *,                        /*                             @D1A*/ 16300000
*      3 * CHAR(4) INIT('HIGH'),  /*                             @D1A*/ 16350000
*      3 * BIT (8) INIT(CLRIHIGH);/*                             @D1A*/ 16400000
*%CLRAL5:;                        /*                             @D1C*/ 16450000
