*%GOTO VC101PRO;    /*                                                  00050000
         MACRO                                                          00100000
         IEEVC101 &DSECT=YES                                            00150000
         SPACE 1    */                                                  00200000
*%VC101PRO: ;                                                           00250000
*/* START OF SPECIFICATIONS ******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* MACRO NAME:  IEEVC101                                     @P3C*/ 00362500
*/*                                                                  */ 00375000
*/*01* DESCRIPTIVE NAME:  Maps workarea C101WORK for D U modules @P3A*/ 00387500
*/*                                                                  */ 00400000
*/*01* ACRONYM:     N/A                                          @P3A*/ 00412500
*/*01* EXTERNAL CLASSIFICATION: NONE                             @P3A*/ 00425000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @P3A*/ 00437500
*/*                                                                  */ 00450000
*/*01* PROPRIETARY STATEMENT=                                        */ 00500000
*/***PROPRIETARY_STATEMENT********************************************/ 00550000
*/*                                                                  */ 00650000
*/*                                                                  */ 00659000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00668000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00677000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 1999                      */ 00690500
*/*                                                                  */ 00704000
*/* STATUS= JBB6607                                                  */ 00713000
*/*                                                                  */ 00722000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00731000
*/*                                                                  */ 00731300
*/*01* DSECT NAME:  C101WORK                                     @P3A*/ 00731600
*/*                                                              @P3A*/ 00731900
*/*01* COMPONENT: DIDOCS (SC1C4)                                 @P3A*/ 00732200
*/*                                                              @P3A*/ 00732500
*/*01* EYE-CATCHER: C101                                         @P3A*/ 00732800
*/*02*   OFFSET: 0                                               @P3A*/ 00733100
*/*02*   LENGTH: 4                                               @P3A*/ 00733400
*/*                                                              @P3A*/ 00733700
*/*01* STORAGE ATTRIBUTES:                                       @P3A*/ 00734000
*/*02*   MAIN STORAGE:                                           @P3A*/ 00734300
*/*02*   VIRTUAL STORAGE:                                        @P3A*/ 00734600
*/*02*   AUXILIARY STORAGE:                                      @P3A*/ 00734900
*/*02*   DATA SPACE:                                             @P3A*/ 00735200
*/*02*   SUBPOOL:  229                                           @P3A*/ 00735500
*/*02*   KEY:  N/A                                               @P3A*/ 00735800
*/*02*   RESIDENCY:  This storage is obtained below the line     @P3A*/ 00736100
*/*                                                              @P3A*/ 00736400
*/*                                                              @P3A*/ 00736700
*/*01* SIZE: 1372 bytes                                          @P3A*/ 00737000
*/*                                                              @P3A*/ 00737300
*/*01* FUNCTION:    This macro maps C101WORK, the workarea for   @P3C*/ 00737600
*/*              the DISPLAY U command modules:  IEE20110,       @P3C*/ 00737900
*/*              IEE21110, IEE22110, IEE23110, IEE24110, and     @P3C*/ 00738200
*/*              IEECB859.                                       @P3C*/ 00738500
*/*                                                              @P3A*/ 00738800
*/*01* METHOD OF ACCESS:                                         @P3A*/ 00739100
*/*                                                                  */ 00740000
*/* INVOCATION -                                                     */ 00770000
*/*          BAL  - SPECIFY: IEEVC101                                */ 00800000
*/*                 UNLESS A DSECT IS NOT WANTED.  IN THAT CASE      */ 00830000
*/*                 SPECIFY: IEEVC101 DSECT=NO                       */ 00860000
*/*          PL/S - SPECIFY: %INCLUDE SYSLIB(IEEVC101)               */ 00890000
*/*                 IF IT IS DESIRED THAT THE MAPPING BE BASED ON    */ 00920000
*/*                 A POINTER, DEFINE A MACRO CHARACTER VARIABLE     */ 00950000
*/*                 VC101BAS AND SET IT TO BE THE NAME OF THE        */ 01050000
*/*                 POINTER TO USE.                                  */ 01100000
*/*                   EX. %DCL VC101BAS CHAR                         */ 01150000
*/*                       % VC101BAS = 'CV101PTR'                    */ 01200000
*/*                                                                  */ 01250000
*/*                 IF THE MAPPING IS NOT TO BE BASED AT ALL, DEFINE */ 01300000
*/*                 A MACRO CHARACTER VARIABLE VC101BAS AND SET IT   */ 01350000
*/*                 TO 'NONE'.                                       */ 01400000
*/*                                                                  */ 01450000
*/*01* CREATED BY:       IEE20110                                @P3A*/ 01466600
*/*      FREED BY:       IEE22110                                @P3A*/ 01483200
*/*01* POINTED TO BY:    N/A                                     @P3A*/ 01499800
*/*                                                              @P3A*/ 01516400
*/*01* SERIALIZATION:  N/A                                       @P3A*/ 01533000
*/*                                                              @P3A*/ 01549600
*/*01* DISTRIBUTION:    AMODGEN                                  @P5C*/ 01566200
*/*                                                              @P3A*/ 01582800
*/*01* OPERATION:                                                @P3A*/ 01599400
*/*              THIS MACRO REQUIRES THAT THE UCB MAPPING        @P3C*/ 01616000
*/*              MACRO, IEFUCBOB, BE INCLUDED.                   @P3C*/ 01632600
*/*                                                                  */ 01650000
*/* CHANGE ACTIVITY - G382P2I - NEW FOR THIS RELEASE                 */ 01700000
*/*                   G860P2G - SUPPORT 3-BYTE UCB ADDRESSES @G860P2G*/ 01730000
*/*                                                                  */ 01745700
*/*   $L1=COEXSVC,  JBB2220, 840601, PD2L: JES3/MCS COEXISTENCE      */ 01750900
*/*   $D1=DCR71,    JBB2220, 850231, PD2L: JES3/MCS COEXISTENCE      */ 01753500
*/*                   ZA93931                                @ZA93931*/ 01754800
*/*   $L2=TSOOP,    HBB4410, 870916, PDBT: TSO OPERATOR              */ 01755100
*/*   $L3=TSOOP8DC, HBB4410, 880725, PDDC: TSO OPERATOR              */ 01755400
*/*   $L4=DIOPL,    HBB4410, 900122, PDAD: UCB Services              */ 01755700
*/*   $P1=PEO3753,  HBB4410, 900330, PDAD: Need an 8-char variable   */ 01755900
*/*   $01=OY44677,  HBB4410, 910719, PDCI: Invoke EDTINFO macro      */ 01756800
*/*                                        instead of calling        */ 01757700
*/*                                        IEFEB4UV                  */ 01758600
*/*   $P2=PH31461,  HBB4420, 900917, PDAD: ENQ/DEQ parmlist          */ 01759500
*/*   $L5=TLIBR,    HBB4430, 911008, PDHZ: TAPE LIBRARY              */ 01759900
*/*   $L6=4DGITBT,  HBB5510, 930304, PDBT: Four Digit Device Support */ 01760000
*/*   $L7=4DGIT3J,  HBB5510, 930415, PD3J: Four Digit Device Support */ 01760100
*/*   $L8=SHRTP3HL, HBB5520, 940310, PDHL: Sysplex Share Tape Support*/ 01760200
*/*   $P3=PN70326,  HBB5520, 940617, PDHL: Move Macro Parm Lists,    */ 01770200
*/*                                        SHOWHDR updates           */ 01780200
*/*   $P4=PN70392,  HBB5520, 941020, PDHL: Sysplex Share Tape Support*/ 01785200
*/*   $02=OW16965,  HBB5520, 951115, PC89GD: D U,IPLDEV support      */ 01786800
*/*   $03=OW16983,  HBB5520, 951215, PDED: Move TEXT out of DSECT    */ 01788400
*/*   $04=OW19019,  HBB5520, 960816, PDCM: -NRD and -PND in display  */ 01789300
*/*   $P5=PWA0053,  JBB6607, 980128, PDZH: CHANGED DISTLIB TO AMODGEN*/ 01789700
*/*   $05=OW45345,  JBB6607, 000801, PDNN: Manual Tape Library       */ 01790790
*/*                                        Support                   */ 01791380
*/*  DANGER! DANGER! DANGER!                                     @03A*/ 01792200
*/*    If you add any fields after TEXT and use them in IEE21110 @03A*/ 01794200
*/*    you may need to roll down OW16983.                        @03A*/ 01796200
*/*                                                                  */ 01798200
*/* END OF SPECIFICATIONS ********************************************/ 01800200
* %GOTO VC101PLS;        %/*                                            01840000
.********************************************************************** 01845000
.*                                                                    * 01850000
.* A 000000-999999                                            @G382P2I* 01855000
.* A (CRTYPE, C101F24, C101F33, C101VERN, C101VRID, C101SP21) @G860P2G* 01860000
.* A (UVPLIST, SCPLIST, MSRASPTR)                             @G860P2G* 01865000
.* C (UCBADDRA, UCBADDRB, CTCTYPE, URTYPE, ALLTYPE, REGSAV)   @G860P2G* 01870000
.* D (VIRTUAL, SINGLE, DEVDEF, C101RB)                        @G860P2G* 01875000
.* C (NODEVDEF)  CHANGE DEFAULT NUMBER OF UNITS TO 1              @L1A* 01877500
.* A (ALLOCDEF)  DEFAULT NUMBER OF UNITS FOR D U,,ALLOC           @L1A* 01878700
.* C (NODEVDEF)  CHANGE DEFAULT NUMBER OF UNITS TO 16             @D1A* 01879300
.* A (SUFFIXS)   SPE FOR CARTRIDGE STACK LOADER               @ZA93931* 01879600
.* A (CONSOLID, CART)                                             @L2A* 01879800
.* A (C101WPX)                                                    @L3A* 01879900
.* A Storage for UCB Services                                     @L4A* 01881600
.* C An 8-character name must be defined for PLS3                 @P1A* 01882400
.* C Remove IEFEB4UV parameter list.  Add list form for EDTINFO   @01A* 01882500
.*   macro and associated fields.                                 @01A* 01882600
.* A (SUFFIXL)   SUPPORT FOR LIBRARY DEVICES                      @L5A* 01882700
.* A ENQ/DEQ parameter list                                       @P2A* 01882900
.* A (ZONEAREA,PACKWORK) INPUT/OUTPUT AREAS FOR PACK INSTRUCTION  @L6A* 01883100
.* A (DEVNSAV1,DEVNSAV2)  REG SAVEAREAS FOR CALL TO UCBDEVN       @L6A* 01883300
.* A (DEVN)  FIELD TO HOLD COPY OF 4 DIGIT DEVICE NUMBER FROM UCB @L6A* 01883500
.* C (UCBN1) CHANGE LENGTH FROM 5 TO 4 - FOLLOWED BY ONE BLANK    @L6A* 01883700
.* C (NODEVICS,NODEVDEF,ALLOCDEF) CHANGE TO FULL WORD             @L6A* 01883900
.* A (ASAX4DGT) MACRO LIST FORM & RELATED DECLARATIONS            @L6A* 01884100
.* C (FLAG2) CHANGE X'08' BIT TO VOLSER ON DISPLAY COMMAND        @L7A* 01884300
.* A (VOLSRVAL) VALUE SPECIFIED ON VOLSER                         @L7A* 01884500
.* A (ASWITCH) TO INDICATE D U,,AUTOSWITCH WAS SPECIFIED          @L8A* 01885100
.* A (MSG5) TO ISSUE MESSAGE IEE456I IF D U,,AUTOSWITCH IS        @L8A* 01885700
.*   SPECIFIED AND THE DEVICE TYPE SPECIFIED IS NOT TAPE          @L8A* 01886300
.* A (CMPPTR) POINTER TO THE CMPL                                 @L8A* 01886900
.* C (DEFTEXT) REDEFINED THIS FIELD FOR MESSAGE IEE457I           @L8A* 01887500
.* C (EDTINFPL, WTOSET) MOVE MACRO PARMLISTS TO THE END           @P3A* 01887700
.*   OF THE C101WORK MAPPING.  ALSO DID SHOWHDR UPDATES.          @P3A* 01887900
.* A (FLAG5) Add a flag to indicate whether a new data line       @P4A* 01888100
.*    should be obtained for message IEE343I.                     @P4A* 01888300
.* C (FLAG2) CHANGE X'02' BIT TO IPLVOL ON DISPLAY COMMAND        @02A* 01888500
.* M (TEXT) Move the TEXT ORG out of the DSECT.  When TEXT had    @03A* 01888700
.*    a basing all fields after it were based off the wrong reg   @03A* 01888900
.* C (USTAT4) Use 3 bytes of unused area of USTAT4 for new area,  @04A* 01889000
.*   USTAT5, to display -PO. -PO is similar to -PND (pending      @04A* 01889100
.*   offline) and is displayed only when -NRD is already being    @04A* 01889200
.*   displayed, because sometimes it's necessary to know both.    @04A* 01889300
.* A (SUFFIXM) Support for Manual Tape Library Devices.           @05A* 01889350
.*                                                                    * 01889400
.********************************************************************** 01889500
         EJECT                                                 @G860P2G 01890000
         AIF   ('&DSECT' EQ 'NO').VC101B1                               01940000
C101WORK DSECT           D U WORKAREA                                   01990000
         AGO   .VC101B2                                                 02150000
.VC101B1 ANOP                                                           02200000
         DS    0D                                                       02250000
C101WORK EQU   *         D U WORKAREA                                   02290000
.VC101B2 ANOP                                                           02330000
C101HDR  DS    CL4       IEEVC101 HEADER ('C101')                       02349900
UCBADDRA DS    7F        UCB ADDRESSES                         @G860P2G 02370000
UCBADDRB DS    F         FOUND BY IEE23110                     @G860P2G 02411900
UNIT1    DS    F         HOLD ADDRESS ONE -                             02663300
LOW      EQU   UNIT1     THE LOW UNIT ADDRESS                           02705200
UNIT2    DS    F         HOLD ADDRESS TWO -                             02747100
CURRENT  EQU   UNIT2     THE CURRENT UNIT ADDRESS                       02789000
UNIT3    DS    F         HOLD ADDRESS THREE -                           02830900
HIGH     EQU   UNIT3     THE HIGH UNIT ADDRESS                          02872800
ZONEAREA DS    CL8       INPUT AREA FOR PACK INSTRUCTION          @L6A  02886700
PACKWORK DS    D         OUTPUT AREA FOR PACK INSTRUCTION         @L6A  02900600
         SPACE 2                                                        02914700
*********************************************************************** 02956600
*                                                                       02998500
* FLAG1 BYTE IS SET BY IEE20110 TO REFLECT THE DEVICE TYPE(S)           03040400
* REQUESTED BY THE D U COMMAND.  THE BITS SET CORRESPOND TO THE BIT     03082300
* SETTINGS IN BYTE 3 OF THE UCBTYP FIELD.                               03124200
*                                                                       03166100
*********************************************************************** 03208000
         SPACE 1                                                        03250000
FLAG1    DS    XL1       *FLAG1 FIELD*                                  03300000
TATYPE   EQU   UCB3TAPE  TAPE DEVICE                                    03350000
TPTYPE   EQU   UCB3COMM  TELECOMMUNICATIONS DEVICES                     03400000
CTCTYPE  EQU   UCB3CTC   CHANNEL-TO-CHANNEL ADAPTER TYPE       @G860P2G 03425000
DATYPE   EQU   UCB3DACC  DIRECT ACCESS DEVICES                          03450000
GRTYPE   EQU   UCB3DISP  GRAPHICS DISPLAY DEVICES                       03500000
URTYPE   EQU   UCB3UREC  UNIT RECORD                           @G860P2G 03550000
CRTYPE   EQU   UCB3CHAR  CHARACTER  READER DEVICES             @G860P2G 03600000
ALLTYPE  EQU   X'FF'     ALL DEVICE TYPES                      @G860P2G 03610000
MOD1     EQU   X'09'     3330 MOD1                                      03620000
MOD11    EQU   X'0D'     3330 MOD11                                     03630000
SUFFIX1  EQU   C'1'      MARK AS 3330 MOD11                             03650000
SUFFIXV  EQU   C'V'      MARK AS 3330 MOD1 AND MSS                      03660000
SUFFIXS  EQU   C'S'      MARK AS 3480 CARTRIDGE STACK LOADER   @ZA93931 04180000
SUFFIXL  EQU   C'L'      MARK AS LIBRARY DEVICE                    @L5A 04230000
SUFFIXM  EQU   C'M'      MARK AS MANUAL LIBRARY DEVICE             @05A 04430000
         SPACE 2                                                        04700000
*********************************************************************** 04750000
*                                                                       04758300
* FLAG2 BYTE IS SET BY IEE20110 TO REFLECT THE D U COMMAND REQUEST      04758500
*                                                                       04758700
*********************************************************************** 04758900
         SPACE 1                                                        04759100
FLAG2    DS    XL1       *DISPLAY FLAGS*                                04759300
ONLINS   EQU   X'80'     DISPLAY ONLINE DEVICES                         04759500
OFFLNS   EQU   X'40'     DISPLAY OFFLINE DEVICES                        04759700
ALLS     EQU   X'20'     DISPLAY OFFLINE + ONLINE DEVICES               04759900
ALLOCS   EQU   X'10'     DISPLAY ALLOCATED DEVICES                      04760100
VOLSER   EQU   X'08'     VOLSER ON DISPLAY COMMAND                 @L7C 04760300
ASWITCH  EQU   X'04'     DISPLAY AUTOSWITCH DEVICES                @L8C 04760500
IPLVOL   EQU   X'02'     IPLVOL ON DISPLAY COMMAND                 @02C 04760700
R13UCBNM EQU   X'01'     FLAG FOR COMPSET ROUTINE                       04760900
         EJECT                                                 @G860P2G 04761100
*********************************************************************** 04761300
*                                                                       04761500
* FLAG3 BYTE - COMMUNICATIONS FLAGS                                     04761700
*                                                                       04761900
*********************************************************************** 04762100
         SPACE 1                                                        04762300
FLAG3    DS    XL1       *COMMUNICATIONS FLAGS*                         04762500
C101F30  EQU   X'80'     RESERVED                                       04762700
C101F31  EQU   X'40'     RESERVED                                       04762900
C101F32  EQU   X'20'     RESERVED                                       04763100
C101F33  EQU   X'10'     RESERVED                              @G860P2G 04763300
HEADOUTF EQU   X'08'     HEADING AND LABELS ARE OUT                     04763500
C101F35  EQU   X'04'     RESERVED                                       04763700
C101F36  EQU   X'02'     RESERVED                                       04763900
C101F37  EQU   X'01'     RESERVED                                       04764100
         SPACE 2                                                        04764300
*********************************************************************** 04764500
*                                                                       04764700
* FLAG4 BYTE IS USED FOR COMMUNICATING OUTPUT MESSAGES                  04766600
*                                                                       04774900
*********************************************************************** 04783200
         SPACE 1                                                        04791500
FLAG4    DS    XL1       *MESSAGE INDEX FOR IEE22110*                   04800000
EXITBIT  EQU   X'00'     NO MESSAGE - RETURN TO CALLER                  04850000
MSG1     EQU   X'04'     NO DEVICE WITH REQUESTED ATTRIBUTES            04900000
MSG3     EQU   X'08'     INVALID OPERAND RE-ENTER                       04950000
MSG4     EQU   X'0C'     INSUFFICIENT STORAGE                           04970000
MSG5     EQU   X'10'     MSG IEE456I INVALID DEVICE TYPE FOR           X04980000
                         D U,,AUTOSWITCH                       @L8A     04990000
         SPACE 2                                                        05000000
*********************************************************************** 05007100
*                                                                       05014200
* FLAG5 BYTE - COMMUNICATIONS FLAGS                                     05021300
*                                                                       05028400
*********************************************************************** 05035500
         SPACE 1                                                        05042600
FLAG5    DS    XL1       *COMMUNICATIONS FLAGS*                         05050000
NODEF    EQU   X'80'     LINE DEFAULT NOT TAKEN                         05100000
INITENT  EQU   X'40'     INITIAL ENTRY TO IEE23110                      05150000
NOLINE   EQU   X'20'     USED TO INDICATE WHETHER WE SHOULD OBTAIN A   X05183300
                         NEW DATA LINE FOR MESSAGE IEE343I        @P4C  05216600
CRTMSG2  EQU   X'10'     NO. OF UNITS REQUESTED EXCEEDS NO. AVAILABLE   05250000
CB859EP  EQU   X'08'     USED TO INDICATE THAT IEECB859 WAS ENTERED    X05283300
                                                                   @L8C 05316600
DISPBIT  EQU   X'04'     VALID ADDRESS FOUND                            05350000
DISPEND  EQU   X'02'     END OF DISPLAY                                 05400000
GOTSTOR  EQU   X'01'     TUCBLST STORAGE HAS BEEN OBTAINED              05450000
         EJECT                                                 @G860P2G 05500000
*********************************************************************** 05507100
*                                                                       05514200
* FLAG6 BYTE - MESSAGE FLAGS FOR IEE24110                               05521300
*                                                                       05528400
*********************************************************************** 05535500
         SPACE 1                                                        05542600
FLAG6    DS    XL1       *MESSAGE FLAGS FOR IEE24110*                   05550000
FLG6MSG1 EQU   X'80'     DISPLAY TRUNCATED - INSUFFICIENT STORAGE       05600000
FLG6MSG2 EQU   X'40'     INCOMPLETE UNIT ALLOCATION STATUS              05633300
FLG6MSG3 EQU   X'20'     ALLOC STATUS UNAVAILABLE                       05666600
C101F63  EQU   X'10'     RESERVED                                       05700000
C101F64  EQU   X'08'     RESERVED                                       05735500
C101F65  EQU   X'04'     RESERVED                                       05771000
C101F66  EQU   X'02'     RESERVED                                       05806500
C101F67  EQU   X'01'     RESERVED                                       05842000
         SPACE 2                                               @G860P2G 05843900
*********************************************************************** 05845800
*                                                                     * 05847700
* MISCELLANEOUS SAVE AREAS                                    @G860P2G* 05849600
*                                                                     * 05851500
*********************************************************************** 05853400
         SPACE 1                                               @G860P2G 05855300
HOLD2    DS    F         MLWTO ID/CONSOLE ID FOR WTO                    05857200
NODEVICS DS    F         NUMBER OF UNITS REQUESTED                 @L6C 05859100
NODEVDEF EQU   16        DEFAULT                                   @D1C 05861000
ALLOCDEF EQU   8         DEFAULT FOR D U,,ALLOC                    @L1C 05861900
IDFLD    DS    CL1       AREA ID SAVE AREA                              05862900
C101VERN DS    AL1       CONTROL BLOCK VERSION                 @G860P2G 05864300
C101VRID EQU   C101SP41  CURRENT VERSION IS HBB4410                @L4C 05865700
C101SP21 EQU   1         OS/VS2 HBB2102                        @G860P2G 05867100
C101SP41 EQU   2         HBB4410                                   @L4A 05867800
REGSAV   DS    18F       SAVEAREA FOR REGISTERS                @G860P2G 05868600
DEVNSAV1 DS    5F        UCBDEVN SAVEAREA - REGS 0,1,13,14,15      @L6A 05868800
DEVNSAV2 DS    18F       UCBDEVN SAVEAREA - ADDRESS PASSED IN R13  @L6A 05869000
X4DGTSAV DS    18F       ASAX4DGT SAVEAREA                         @L6A 05869200
MSRASPTR DS    F         POINTER TO MSRASDCA                   @G860P2G 05869500
DATAADDR DS    F         DATA AREA POINTER FOR IEE24110                 05870500
SAVREG0  DS    F         REGISTER 0 SAVE AREA                      @01A 05871100
SAVREG13 DS    F         REGISTER 13 SAVE AREA                     @01A 05871700
SAVREG14 DS    F         REGISTER 14 SAVE AREA                          05872400
CONSOLID DS    F         CONSOLE ID                                @L2A 05873600
CART     DS    CL8       COMMAND AND RESPONSE TOKEN                @L2A 05874800
DEVN     DS    CL4       COPY OF 4 DIGIT DEVICE NUMBER FROM UCB    @L6A 05875300
X4DGTWRK DS    CL300     WORK AREA FOR ASAX4DGT SERVICE            @L6A 05875800
VOLSRVAL DS    CL6       VALUE SPECIFIED ON VOLSER                 @L7A 05876300
CMPLPTR  DS    A         POINTER TO THE CMPL                       @L8A 05876700
C101RESV DS    CL18      RESERVED                                  @L8C 05877100
         EJECT                                                 @G860P2G 05877500
*********************************************************************** 05913000
*                                                                       05963000
* PARAMETER LIST FOR SVC 35 (WTO)                                       06013000
*                                                                       06263000
*********************************************************************** 07566500
         SPACE 1                                                        07567000
WTOWPL   DS    0F        AUTOMATIC FORM OF WPL                     @P3M 07567500
WTOSET   DS    XL1       FOR ADDRESSABILITY                        @P3M 07568000
TEXTLEN  DS    XL1       OUTPUT LENGTH                             @P3M 07568500
FULLINE  EQU   76         FULL LINE - FOR TEXTLEN                  @P3M 07569000
MCSONE   DS    XL1       MCS FLAGS PART ONE                        @P3M 07569500
SETONE   EQU   X'A0'      ROUTING + DESCRIPTOR CODE EXIST,         @P3M 07570000
*                         COMMAND RESPONSE - FOR MCSONE            @P3M 07570500
MCSTWO   DS    XL1       MCS FLAGS PART TWO                        @P3M 07571000
SETTWO   EQU   X'50'      MLWTO - FOR MCSTWO                       @P3M 07571500
MSGT     DS    0C        BEGIN TEXT LINE                           @P3M 07572000
TEXT     DS    CL71      TEXT FOR SVC 35                           @P3M 07572500
         ORG   TEXT                                                @P3M 07573000
TITLEID  DS    CL8       MESSAGE ID                                @P3M 07573500
TITLEDGH DS    CL3       HOURS.                                    @P3M 07574000
TITLEDGM DS    CL3       MINUTES.                                  @P3M 07574500
TITLEDGS DS    CL2       SECONDS                                   @P3M 07575000
TITLENM  DS    CL11      DISPLAY NAME                              @P3M 07575500
         ORG   ,         ORG FOR WTO TAIL                          @P3M 07581500
         SPACE 1                                                   @P3M 07582000
C101WPX  DS    CL(WPXLEN)     WPX STORAGE                          @P3M 07582500
TYPEFLAG DS    CL2            MESSAGE TYPES                        @P3M 07583000
AID      DS    CL1            AREA ID FIELD                        @P3M 07583500
LNUM     DS    CL1            NUMBER OF LINES                      @P3M 07584000
         SPACE 1                                                   @P3M 07584500
*********************************************************************** 07585000
*                                                                       07585500
* END OF PARAMETER LIST FOR SVC 35                                 @P3M 07586000
*                                                                       07586500
*********************************************************************** 07587000
         EJECT                                                          07587500
*********************************************************************** 07589500
*                                                                     * 07589900
* PARAMETER LIST FOR UCB SCAN ROUTINE (IOSVSUCB)              @G860P2G* 07590300
*                                                                     * 07590700
*********************************************************************** 07591100
         SPACE 1                                               @G860P2G 07591500
SCPLIST  DS    0F        BEGINNING OF PARAMETER LIST           @G860P2G 07591900
SCWKPTR  DS    A         ADDR OF 100-BYTE WORK AREA            @G860P2G 07592300
SCCLSPTR DS    A         ADDR OF DEVICE CLASS INDICATOR        @G860P2G 07592700
SCUCBPTR DS    A         LOCATION TO RETURN UCB ADDRESS IN     @G860P2G 07593100
         DS    0D        WORK AREA MUST BE ON A DWORD BDY      @G860P2G 07593300
SCANWORK DS    XL100     WORK AREA FOR UCB SCAN ROUTINE        @G860P2G 07593500
SCANUCB  DS    A         UCB ADDR FOUND BY SCAN ROUTINE        @G860P2G 07593900
SCANDEVT DS    X         DEVICE TYPE TO BE SEARCHED FOR        @G860P2G 07594300
         DS    XL3       RESERVED                              @G860P2G 07594700
         SPACE 2                                               @G860P2G 07595100
*********************************************************************** 07595500
* Parameter list for UCBSCAN Service and storage to hold 7 copies @L4A* 07596000
* of UCB to match with the list of UCB addresses (UCBADDRA)       @L4A* 07596500
*********************************************************************** 07597100
         SPACE 1                                                   @L4A 07608200
         DS    0F                                                  @L4A 07619300
UCBRSVER DS    XL8       Reserved                                  @L4A 07630400
UCBPTKEN DS    XL8       Place holder of the PTOKEN when PINning a UCB X07641500
                                                                   @L4A 07652600
         UCBPIN   MF=(L,UCBPINPL) UCBPIN  parameter list           @L4A 07663700
         UCBSCAN  MF=(L,UCBPARML) UCBSCAN parameter list           @L4A 07674800
ENQPARML ENQ      (,,S,,SYSTEM),ECB=0,TCB=0,MF=L ENQ parm list used    X07677000
                                  by IEE20110                      @P2A 07679200
DEQPARML DEQ      (,,,),TCB=0,UCB=0,MF=L        DEQ parameter list     X07681400
                                  used by IEE22110                 @P2A 07683600
         DS    0F                                                  @L4A 07685900
         SPACE 1                                                   @L4A 07697000
*********************************************************************** 07708100
*                                                                     * 07719200
* End of parameter list for UCB Service                            @L4A 07730300
*                                                                     * 07741400
*********************************************************************** 07752500
         EJECT                                                 @G860P2G 07763600
*********************************************************************** 07775700
*                                                                     * 07776100
* PARAMETER LIST FOR EDTINFO                                      @P3M* 07776500
*                                                                     * 07776900
*********************************************************************** 07777300
         SPACE 1                                                   @P3M 07780000
         EDTINFO  MF=(L,EDTINFPL) EDTINFO parameter list           @P3M 07782700
INFUNIT  DS    CL8       UNIT NAME                                 @P3M 07785400
INFRETC  DS    F         EDTINFO RETURN CODE                       @P3M 07788100
         SPACE 2                                                   @P3M 07790800
*********************************************************************** 07793900
*                                                                       07794200
* PARAMETER LIST FOR ASAX4DGT                                      @L6A 07794500
*                                                                       07794800
*********************************************************************** 07795100
         SPACE                                                          07795400
         ASAX4DGT MF=(L,X4DGTPRM)  ASAX4DGT PARAMETER LIST         @L6A 07795700
*                                                                       07796000
         SPACE 2                                                        07796600
WAL      EQU   *-C101WORK     LENGTH OF PARAMETER LIST - D U WORKAREA   07800000
DEFTEXT  DSECT           REDEFINE TEXT FIELD                       @03A 07803800
UCBN1    DS    CL4       UNIT ADDRESS                              @03M 07807600
         DS    CL1       BLANK                                     @03M 07811400
MODL1    DS    CL5       DEVICE TYPE (UND,CTC ,CTC1,CTCV)          @03M 07815200
USTAT1   DS    CL1       STATUS (O,A,S,C,OFFLINE)                  @03M 07819000
USTAT2   DS    CL4       STATUS (-BSY,-MTP,-NRD,-RAL)              @03M 07822800
USTAT3   DS    CL2       STATUS (-R)                               @03M 07826600
USTAT4   DS    CL3       STATUS (-AS)                              @04C 07829100
USTAT5   DS    CL4       STATUS (-PO)                              @04A 07831600
VOLID1   DS    CL11      VOLUME SERIAL NUMBER                      @03M 07834200
VOST1A   DS    CL4       VOLUME STATE (PUB,PRIV,STRG)              @03M 07838000
VOST1B   DS    CL6       VOLUME STATE (-REMOV,-RSDNT,-RSERV)       @03M 07841800
         SPACE 1                                                   @03M 07845600
         MEND            */;                                            07850000
*%VC101PLS: ;                                                           07900000
*@EJECT;                         /*                          @G860P2G*/ 07925000
*%IF VC101BAS ~= 'NONE' % THEN %GOTO VC101P1;                           07950000
* DCL 1 C101WORK BDY(DWORD),     /* D U WORKAREA                     */ 08000000
*%GOTO VC101P3;                                                         08040000
*%VC101P1: ;                                                            08080000
*%IF VC101BAS ~= '' %THEN %GOTO VC101P2;                                08120000
* DCL 1 C101WORK BDY(DWORD) BASED, /* D U WORKAREA                   */ 08160000
*%GOTO VC101P3;                                                         08250000
*%VC101P2: ;                                                            08300000
* DCL 1 C101WORK BDY(DWORD) BASED(VC101BAS), /* D U WORKAREA */         08350000
*%VC101P3: ;                                                            08400000
*       3 C101HDR CHAR(4),      /* IEEVC101 HEADER                   */ 08424900
*       3 UCBADDRA CHAR(28) BDY(WORD),/* UCB ADDRESSES       @G860P2G*/ 08450000
*         5 UCBADDRS(7) PTR(31),/* HOLDS 7 UCB ADDRESSES     @G860P2G*/ 08493700
*       3 UCBADDRB PTR(31),     /* FOUND BY IEE23110         @G860P2G*/ 08537400
*       3 UNIT1 FIXED(31),      /* HOLD ADDRESS ONE -                */ 08800000
*         5 LOW FIXED(31),      /* THE LOW UNIT ADDRESS              */ 08820000
*       3 UNIT2 FIXED(31),      /* HOLD ADDRESS TWO -                */ 08840000
*         5 CURRENT FIXED(31),  /* THE CURRENT UNIT ADDRESS          */ 08860000
*       3 UNIT3 FIXED(31),      /* HOLD ADDRESS THREE -              */ 08880000
*         5 HIGH FIXED(31),     /* THE HIGH UNIT ADDRESS             */ 08900000
*       3 ZONEAREA CHAR(8),     /* INPUT AREA FOR PACK           @L6A*/ 08906600
*       3 PACKWORK CHAR(8) BDY(DWORD), /* OUTPUT AREA FOR PACK   @L6A*/ 08913200
*@SPACE;                        /*                           @G860P2G*/ 08920000
*/********************************************************************/ 08940000
*/*                                                                  */ 08960000
*/*    FLAG1 BYTE IS SET BY IEE20110 TO REFLECT THE DEVICE TYPE(S)   */ 08980000
*/*    REQUESTED BY THE D U COMMAND.  THE BITS SET CORRESPOND TO THE */ 09000000
*/*    BIT SETTINGS IN BYTE 3 OF THE UCBTYPE FIELD.                  */ 09050000
*/*                                                                  */ 09100000
*/********************************************************************/ 09150000
*       3 FLAG1 BIT(8),                                                 09200000
*         5 TATYPE BIT(1),      /* TAPE DEVICES                      */ 09250000
*         5 TPTYPE BIT(1),      /* TELECOMMUNICATIONS DEVICES        */ 09300000
*         5 DATYPE BIT(1),      /* DIRECT ACCESS DEVICES             */ 09350000
*         5 GRTYPE BIT(1),      /* GRAPHICS DISPLAY DEVICES          */ 09400000
*         5 URTYPE BIT(1),      /* UNIT RECORD               @G860P2G*/ 09426600
*         5 CRTYPE BIT(1),      /* CHAR RDR DEVICES          @G860P2G*/ 09453200
*@SPACE;                        /*                           @G860P2G*/ 09480000
*/********************************************************************/ 09510000
*/*                                                                  */ 09530000
*/*    FLAG2 BYTE IS SET BY IEE20110 TO REFLECT THE D U COMMAND      */ 09550000
*/*    REQUEST.                                                      */ 09570000
*/*                                                                  */ 09590000
*/********************************************************************/ 09610000
*       3 FLAG2 BIT(8),         /* **DISPLAY FLAGS **                */ 09650000
*         5 ONLINS BIT(1),      /* DISPLAY ONLINE DEVICES            */ 09700000
*         5 OFFLNS BIT(1),      /* DISPLAY OFFLINE DEVICES           */ 09750000
*         5 ALLS   BIT(1),      /* DISPLAY OFFLINE + ONLINE DEVICES  */ 09800000
*         5 ALLOCS BIT(1),      /* DISPLAY ALLOCATED DEVICES         */ 09850000
*         5 VOLSER  BIT(1),     /* VOLSER ON DISPLAY COMMAND     @L7C*/ 09900000
*         5 ASWITCH BIT(1),     /* DISPLAY AUTOSWITCH DEVICES    @L8C*/ 09941400
*         5 IPLVOL  BIT(1),     /* IPLVOL ON DISPLAY COMMAND     @02C*/ 09978500
*         5 R13UCBNM BIT(1),    /* FLAG FOR COMPSET ROUTINE          */ 10015600
*@EJECT;                        /*                           @G860P2G*/ 10032000
*/********************************************************************/ 10048400
*/*                                                                  */ 10081200
*/*    FLAG3 BYTE - COMMUNICATIONS FLAGS                             */ 10114000
*/*                                                                  */ 10146800
*/********************************************************************/ 10179600
*       3 FLAG3 BIT(8),         /* ** COMMUNICATIONS FLAGS **        */ 10212400
*         5 C101F30  BIT(1),    /* RESERVED                          */ 10245200
*         5 C101F31  BIT(1),    /* RESERVED                          */ 10278000
*         5 C101F32  BIT(1),    /* RESERVED                          */ 10310800
*         5 C101F33  BIT(1),    /* RESERVED                  @G860P2G*/ 10343600
*         5 HEADOUTF BIT(1),    /* HEADING AND LABELS ARE OUT        */ 10376400
*         5 C101F35  BIT(1),    /* RESERVED                          */ 10409200
*         5 C101F36  BIT(1),    /* RESERVED                          */ 10442000
*         5 C101F37  BIT(1),    /* RESERVED                          */ 10474800
*@SPACE;                        /*                           @G860P2G*/ 10491400
*/********************************************************************/ 10508000
*/*                                                                  */ 10516000
*/*         FLAG4 BYTE IS USED FOR COMMUNICATING OUTPUT MESSAGES     */ 10524000
*/*                                                                  */ 10532000
*/********************************************************************/ 10540000
*       3 FLAG4 FIXED(8),       /* ** MSG INDEX FOR IEE22110 **      */ 10590000
*@SPACE;                        /*                           @G860P2G*/ 10640000
*/********************************************************************/ 10710000
*/*                                                                  */ 10725000
*/*         FLAG5 BYTE - COMMUNICATIONS FLAGS                        */ 10740000
*/*                                                                  */ 10755000
*/********************************************************************/ 10770000
*       3 FLAG5 BIT(8),         /* ** COMMUNICATIONS FLAGS **        */ 10785000
*         5 NODEF    BIT(1),    /* LINE DEFAULT NOT TAKEN            */ 10800000
*         5 INITENT  BIT(1),    /* INITIAL ENTRY TO IEE23110         */ 10850000
*         5 NOLINE   BIT(1),    /* USED TO INDICATE IF A NEW DATA LINE  10875000
*                                  SHOULD BE OTAINED FOR MESSAGE        10900000
*                                  IEE343I                       @P4C*/ 10925000
*         5 CRTMSG2  BIT(1),    /* NO. OF UNITS REQUESTED EXCEEDS NO.   10950000
*                                  AVAILABLE                         */ 11000000
*         5 CB859EP  BIT(1),    /* USED TO INDICATE THAT IEECB859       11024000
*                                  WAS ENTERED                   @L8C*/ 11048100
*         5 DISPBIT  BIT(1),    /* VALID ADDRESS FOUND               */ 11072200
*         5 DISPEND  BIT(1),    /* END OF DISPLAY                    */ 11094400
*         5 GOTSTOR  BIT(1),    /* TUCBLST STORAGE HAS BEEN OBTAINED */ 11116600
*@EJECT;                        /*                           @G860P2G*/ 11127700
*/********************************************************************/ 11138800
*/*                                                                  */ 11161000
*/*         FLAG6 BYTE - MESSAGE FLAGS FOR IEE24110                  */ 11183200
*/*                                                                  */ 11205400
*/********************************************************************/ 11227600
*       3 FLAG6 BIT(8),         /* ** MESSAGE FLAGS FOR IEE24110 **  */ 11250000
*         5 FLG6MSG1 BIT(1),    /* DISPLAY TRUNCATED - INSUFFICIENT     11300000
*                                  STORAGE                           */ 11350000
*         5 FLG6MSG2 BIT(1),    /* INCOMPLETE UNIT ALLOCATION STATUS */ 11400000
*         5 FLG6MSG3 BIT(1),    /* ALLOC STATUS UNAVAILABLE          */ 11450000
*         5 C101F63  BIT(1),    /* RESERVED                          */ 11500000
*         5 C101F64  BIT(1),    /* RESERVED                          */ 11508300
*         5 C101F65  BIT(1),    /* RESERVED                          */ 11516600
*         5 C101F66  BIT(1),    /* RESERVED                          */ 11524900
*         5 C101F67  BIT(1),    /* RESERVED                          */ 11533200
*       3 * FIXED(16),          /* RESERVED                          */ 11541500
*@SPACE;                        /*                           @G860P2G*/ 11541600
*/********************************************************************/ 11541700
*/*                                                                  */ 11541800
*/*   MISCELLANEOUS SAVE AREAS                               @G860P2G*/ 11541900
*/*                                                                  */ 11542000
*/********************************************************************/ 11542100
*       3 HOLD2 FIXED(31),      /* MLWTO ID/CONSOLE ID FOR WTO       */ 11542200
*       3 NODEVICS FIXED(31),   /* NUMBER OF UNITS REQUESTED     @L6C*/ 11542300
*       3 IDFLD CHAR(1),        /* AREA ID SAVE AREA                 */ 11542400
*       3 C101VERN FIXED(8),    /* CONTROL BLOCK VERSION     @G860P2G*/ 11542500
*       3 REGSAV(18) FIXED(31), /* SAVEAREA FOR REGISTERS    @G860P2G*/ 11542600
*       3 DEVNSAV1(5) FIXED(31), /* UCBDEVN SAVEAREA -                  11542700
*                                   REGS 0,1,13,14,15            @L6A*/ 11542800
*       3 DEVNSAV2(18) FIXED(31),/* UCBDEVN SAVEAREA                    11542900
*                                   ADDRESS PASSED IN R13        @L6A*/ 11543000
*       3 X4DGTSAV(18) FIXED(31),/* ASAX4DGT SAVEAREA            @L6A*/ 11543100
*       3 MSRASPTR PTR(31),     /* POINTER TO MSRASDCA       @G860P2G*/ 11543200
*       3 DATAADDR PTR(31),     /* DATA AREA POINTER FOR IEE24110    */ 11543300
*       3 SAVREG0  PTR(31),     /* REGISTER 0  SAVE AREA         @01A*/ 11543400
*       3 SAVREG13 PTR(31),     /* REGISTER 13 SAVE AREA         @01A*/ 11543500
*       3 SAVREG14 PTR(31),     /* REGISTER 14 SAVE AREA             */ 11543600
*       3 CONSOLID FIXED(31),   /* CONSOLE ID                    @L2A*/ 11543700
*       3 CART     CHAR(8),     /* COMMAND AND RESPONSE TOKEN    @L2A*/ 11543800
*       3 DEVN     CHAR(4),     /* COPY OF 4 DIGIT DEVICE               11543900
*                                  NUMBER FROM UCB               @L6A*/ 11544000
*       3 X4DGTWRK CHAR(300),   /* WORK AREA FOR ASAX4DGT               11544100
*                                  SERVICE                       @L6A*/ 11544200
*       3 VOLSRVAL CHAR(6),     /* VALUE SPECIFIED ON VOLSER     @L7A*/ 11544300
*       3 CMPLPTR  PTR(31),     /* POINTER TO THE CMPL           @L8A*/ 11544400
*       3 C101RESV CHAR(18) BDY(WORD), /* RESERVED               @L8C*/ 11544500
*@EJECT;                        /*                           @G860P2G*/ 11544600
*/********************************************************************/ 11544700
*/*                                                                  */ 11544800
*/*    PARAMETER LIST FOR SVC 35 (WTO)                               */ 11545400
*/*                                                                  */ 11549000
*/********************************************************************/ 11549600
*       3 WTOSET FIXED(8) BDY(WORD),    /* FOR ADDRESSABILITY    @P3M*/ 11550200
*       3 TEXTLEN FIXED(8),     /* OUTPUT LENGTH                 @P3M*/ 11550800
*       3 MCSONE  FIXED(8),     /* MCS FLAGS PART ONE            @P3M*/ 11551400
*       3 MCSTWO  FIXED(8),     /* MCS FLAGS PART TWO            @P3M*/ 11552000
*       3 MSGT,                 /* BEGIN TEXT LINE               @P3M*/ 11552600
*         5 TEXT CHAR(71),      /* TEXT FOR SVC 35               @P3C*/ 11553200
*           7 TITLEID CHAR(8),  /* MESSAGE ID                    @P3M*/ 11553800
*           7 TITLEDGH CHAR(3), /* HOURS.                        @P3M*/ 11554400
*           7 TITLEDGM CHAR(3), /* MINUTES.                      @P3M*/ 11555000
*           7 TITLEDGS CHAR(2), /* SECONDS                       @P3M*/ 11555600
*           7 TITLENM  CHAR(11), /* DISPLAY NAME                 @P3M*/ 11556200
*         5 C101WPX  CHAR(LENGTH(WPX)), /* WPX                   @P3M*/ 11556800
*         5 TYPEFLAG CHAR(2),   /* MESSAGE TYPES                 @P3M*/ 11557400
*         5 AID      CHAR(1),   /* AREA ID FIELD                 @P3M*/ 11558000
*         5 LNUM     CHAR(1),   /* NUMBER OF LINES               @P3M*/ 11558600
*@SPACE;                        /*                               @P3M*/ 11559200
*/********************************************************************/ 11559800
*/*                                                                  */ 11560400
*/*   PARAMETER LIST FOR UCB SCAN ROUTINE (IOSVSUCB)         @G860P2G*/ 11561000
*/*                                                                  */ 11561600
*/********************************************************************/ 11562200
*       3 SCPLIST CHAR(12) BDY(WORD),/* START OF PARM LIST   @G860P2G*/ 11562800
*         5 SCWKPTR PTR(31),    /* ADDR OF SCANWORK          @G860P2G*/ 11563400
*         5 SCCLSPTR PTR(31),   /* ADDR OF SCANDEVT          @G860P2G*/ 11564000
*         5 SCUCBPTR PTR(31),   /* LOCATION TO RETURN UCB ADDRESS IN    11564600
*                                                            @G860P2G*/ 11565200
*       3 SCANWORK CHAR(100) BDY(DWORD),/* WORK AREA FOR SCANNER        11565800
*                                                            @G860P2G*/ 11566400
*       3 SCANUCB PTR(31),      /* UCB ADDR FOUND BY SCANNER @G860P2G*/ 11567000
*       3 * CHAR(4),            /*                           @G860P2G*/ 11567600
*         5 SCANDEVT FIXED(8),  /* DEVICE TYPE TO BE SEARCHED FOR       11568200
*                                                            @G860P2G*/ 11568800
*         5 * CHAR(3),          /* RESERVED                  @G860P2G*/ 11569400
*@SPACE(2);                     /*                               @L4A*/ 11570800
*/********************************************************************/ 11594100
*/*                                                                  */ 11617400
*/*   Dynamic storage for the UCBSCAN service parm list and      @L4A*/ 11640700
*/*   storage to hold 7 copies of UCB to match with the list     @L4A*/ 11664000
*/*   of UCB addresses (UCBADDRA).                               @L4A*/ 11687300
*/*                                                                  */ 11710600
*/********************************************************************/ 11733900
*       3 UCBRSVER BIT(64),     /* Reserved                      @L4A*/ 11757200
*       3 UCBPTKEN BIT(64),     /* Place holder of the PTOKEN when      11780500
*                                  PINning a UCB                 @L4A*/ 11803800
*       3 UCBPINPL CHAR(LENGTH(UCBPINLS)) BDY(DWORD),                   11814300
*                                          /* UCBPIN parameter list     11824800
*                                                                @P3C*/ 11835300
*       3 UCBPARML CHAR(LENGTH(UCBSCANL)) BDY(DWORD),                   11845800
*                                          /* UCBSCAN parameter list    11856300
*                                                                @P3C*/ 11866800
*       3 ENQPARML CHAR(LENGTH(ENQLT)) BDY(WORD),                       11877300
*                                          /* ENQ parameter list @P3C*/ 11887800
*       3 DEQPARML CHAR(LENGTH(DEQLT)) BDY(WORD),                       11898300
*                                          /* DEQ parameter list @P3C*/ 11908800
*@SPACE;                        /*                               @L4A*/ 11920300
*/********************************************************************/ 11943600
*/*                                                                  */ 11966900
*/*   End of parameter list for UCB Service                      @L4A*/ 11990200
*/*                                                                  */ 12013500
*/********************************************************************/ 12036800
* @EJECT ASM;                                                           12060100
*/********************************************************************/ 12083400
*/*                                                                  */ 12106700
*/*  PARAMETER LIST FOR EDTINFO                                  @P3M*/ 12156700
*/*                                                                  */ 12269800
*/********************************************************************/ 12293100
*      3 EDTINFPL CHAR(LENGTH(EDTINFLS)) BDY(DWORD),           /*@P3M*/ 12343100
*      3 INFUNIT  CHAR(8),       /* UNIT                         @P3M*/ 12393100
*      3 INFRETC  FIXED(32);     /* RETURN CODE                  @P3M*/ 12443100
*@SPACE;                         /*                              @P3M*/ 12493100
*/********************************************************************/ 12689200
*/*                                                                  */ 12712500
*/*    END OF PARAMETER LIST FOR SVC 35                              */ 12738000
*/*                                                                  */ 12742000
*/********************************************************************/ 12746000
*@SPACE(2);                     /*                           @G860P2G*/ 12938900
*/********************************************************************/ 12952600
*/*                                                                  */ 12956700
*/*   REDEFINE TEXT FIELD OF SVC 35 PARAMETER LIST                   */ 12960800
*/*                                                                  */ 12964900
*/********************************************************************/ 12969000
* DCL 1 DEFTEXT  DEFINED(TEXT), /* REDEFINE TEXT FIELD               */ 12973700
*       3 UCBN1 CHAR(4),        /* UNIT ADDRESS                  @L6C*/ 12990500
*       3 *     CHAR(1),        /* BLANK FIELD                   @L6A*/ 13007300
*       3 MODL1 CHAR(5),        /* DEVICE TYPE (UND,CTC ,CTC1,CTCV)  */ 13024100
*       3 USTAT1 CHAR(1),       /* STATUS (O,A,S,C,OFFLINE)          */ 13049300
*       3 USTAT2 CHAR(4),       /* STATUS (-BSY,-MTP,-NRD,-RAL)      */ 13074500
*       3 USTAT3 CHAR(2),       /* STATUS (-R)                   @L8C*/ 13105800
*       3 USTAT4 CHAR(3),       /* STATUS (-AS)                  @04C*/ 13126600
*       3 USTAT5 CHAR(4),       /* STATUS (-PO)                  @04A*/ 13147400
*       3 VOLID1 CHAR(11),      /* VOLUME SERIAL NUMBER          @L8C*/ 13168400
*       3 VOST1A CHAR(4),       /* VOLUME STATE (PUB,PRIV,STRG)      */ 13200000
*       3 VOST1B CHAR(6);       /* VOLUME STATE (-REMOV,-RSDNT,-RSERV)  13250000
*                                                                    */ 13300000
*@SPACE(2);                     /*                           @G860P2G*/ 13325000
*/********************************************************************/ 13350000
*/*                                                                  */ 13400000
*/*         FOR FLAG1 MULTIPLE BIT CHECKS                            */ 13450000
*/*                                                                  */ 13500000
*/********************************************************************/ 13550000
* DCL ALLTYPE BIT(8) CONSTANT('FF'X);   /* ALL DEVICE TYPES  @G860P2G*/ 13600000
* DCL CTCTYPE BIT(8) CONSTANT(UCBCTC);  /* CHANNEL-TO-CHANNEL           13633300
*                                          ADAPTER TYPE      @G860P2G*/ 13666600
* DCL MOD1    BIT(8) CONSTANT('09'X);   /* 3330 MOD1                 */ 13700000
* DCL MOD11   BIT(8) CONSTANT('0D'X);   /* 3330 MOD11                */ 13750000
* DCL SUFFIX1 CHAR(1) CONSTANT('1');    /* MARK AS 3330              */ 13850000
* DCL SUFFIXV CHAR(1) CONSTANT('V');    /* MARK AS 3330 AND MSS      */ 13900000
* DCL SUFFIXS CHAR(1) CONSTANT('S');    /* MARK AS 3480 CSL  @ZA93931*/ 13916600
* DCL SUFFIXL CHAR(1) CONSTANT('L');   /* MARK AS LIBRARY DEVICE @L5A*/ 13933200
* DCL SUFFIXM CHAR(1) CONSTANT('M');   /* MARK AS MANUAL LIBRARY @05A*/ 13941200
*@SPACE;                                /*                   @G860P2G*/ 13950000
*/********************************************************************/ 14000000
*/*                                                                  */ 14050000
*/*         FLAG4 MESSAGE INDEXES                                    */ 14100000
*/*                                                                  */ 14150000
*/********************************************************************/ 14200000
* DCL EXITBIT FIXED(8) CONSTANT(0); /* NO MESSAGE - RETURN TO CALLER */ 14250000
* DCL MSG1    FIXED(8) CONSTANT(4); /* NO DEVICE WITH REQUESTED         14280000
*                                      ATTRIBUTES                    */ 14310000
* DCL MSG3    FIXED(8) CONSTANT(8); /* INVALID OPERAND RE-ENTER      */ 14340000
* DCL MSG4    FIXED(8) CONSTANT(12); /* INSUFFICIENT STORAGE         */ 14370000
* DCL MSG5    FIXED(8) CONSTANT(16); /* MSG IEE456I INVALID DEVICE      14374900
*                                       TYPE FOR D U,,AUTOSWITCH @L8A*/ 14379800
* @EJECT ASM;                                                           14384900
*/********************************************************************/ 14400000
*/*                                                                  */ 14450000
*/*    CONSTANTS FOR WTO PARAMETER LIST                      @G860P2G*/ 14500000
*/*                                                                  */ 14550000
*/********************************************************************/ 14600000
* DCL FULLINE FIXED(8) CONSTANT(76);    /* FULL LINE - FOR TEXTLEN   */ 14650000
* DCL SETONE  BIT(8) CONSTANT('A0'X); /* ROUTING AND DESCRIPTOR CODES   14700000
*                                        EXIST,COMMAND RESPONSE - FOR   14750000
*                                        MCSONE                  @L3C*/ 14800000
* DCL SETTWO  BIT(8) CONSTANT('50'X);  /* MLWTO - FOR MCSTWO     @L3C*/ 14850000
*/********************************************************************/ 14854100
*/*                                                                  */ 14858200
*/*    END OF CONSTANTS FOR WTO PARAMETER LIST               @G860P2G*/ 14862300
*/*                                                                  */ 14866400
*/********************************************************************/ 14870500
*@SPACE;                               /*                    @G860P2G*/ 14874600
*/********************************************************************/ 14878700
*/*                                                                  */ 14882800
*/*    MISCELLANEOUS CONSTANTS                               @G860P2G*/ 14886900
*/*                                                                  */ 14891000
*/********************************************************************/ 14895100
* DCL NODEVDEF FIXED(31) CONSTANT(16); /* DEFAULT - FOR NODEVICS @L6C*/ 14900000
* DCL ALLOCDEF FIXED(31) CONSTANT(8);  /* DEFAULT - FOR NODEVICS -      14916600
                                          FOR D U,,ALLOC         @L6C*/ 14933200
* DCL C101VRID FIXED(8) CONSTANT(C101SP41); /* CURRENT VERSION IS       14950000
*                                             HBB4410            @L4C*/ 15000000
* DCL C101SP21 FIXED(8) CONSTANT(1); /* OS/VS2 HBB2102       @G860P2G*/ 15050000
* DCL C101SP41 FIXED(8) CONSTANT(2); /* HBB4410                  @L4A*/ 15100000
* ?UCBPIN  MF(L,UCBPINLS,STATIC);    /* UCBPIN  parameter list   @L4A*/ 15150000
* ?UCBSCAN MF(L,UCBSCANL,STATIC);    /* UCBSCAN parameter list   @P1C*/ 15200000
* ?EDTINFO MF(L,EDTINFLS,STATIC);    /* EDTINFO parameter list   @01A*/ 15225000
* ?ENQ (,,S,,SYSTEM) MF(L,ENQLT,STATIC); /* ENQ parameter list   @P2A*/ 15250000
* ?DEQ (,,,SYSTEM) MF(L,DEQLT,STATIC);   /* ENQ parameter list   @P2A*/ 15300000
* ?ASAX4DGT MF(L,X4DGTPRM);          /* ASAX4DGT parameter list  @L6A*/ 15350000
