*        %GOTO ZB806LBL; /*                                             00020000
         MACRO                                                          00040000
         IEEZB806                                                       00060000
         SPACE 1         */                                             00080000
*% ZB806LBL: ;                                                          00100000
*/********************************************************************/ 00150000
*/*                                                                  */ 00200000
*/* MODULE NAME = IEEZB806                                           */ 00250000
*/*                                                                  */ 00300000
*/* DESCRIPTIVE NAME = MASTER TRACE TABLE MAPPING MACRO              */ 00350000
*/*                                                                  */ 00400000
*/* STATUS = OS/VS2, SYSTEM CONTROL PROGRAM 2                        */ 00450000
*/*                                                                  */ 00480000
*/*   LAST UPDATE = 05/11/78                                         */ 00510000
*/*                                                                  */ 00600000
*/* FUNCTION = MAPS THE MASTER TRACE TABLE                           */ 00650000
*/*                                                                  */ 00700000
*/*   OPERATION = THIS MACRO PROVIDES TWO MAPPINGS                   */ 00750000
*/*                                                                  */ 00800000
*/*                1 MTTABLE - MAPS THE MASTER TRACE TABLE           */ 00850000
*/*                                                                  */ 00900000
*/*                2 MTENTRY - MAPS A MASTER TRACE TABLE ENTRY       */ 00950000
*/*                                                                  */ 01000000
*/* MODULE TYPE = MACRO                                              */ 01050000
*/*                                                                  */ 01100000
*/*   PROCESSOR = PLS2                                               */ 01150000
*/* CHANGE ACTIVITY = G64MP2D                                        */ 01200000
*/*                                                                  */ 01250000
*/********************************************************************/ 01300000
*/*                                                                  */ 01350000
*        %GOTO IEEZB806; /*                                             01400000
MTTABLE  DSECT                                                          01550000
         DS    0D                  ALIGN MASTER TRACE TABLE             01600000
*                                  MAPPING TO A DOUBLE                  01640000
*                                  WORD BOUNDARY                        01680000
MTTHDRA  DS    0C                  HEADER AREA OF TABLE                 01720000
MTTID    DS    CL4                 MASTER TRACE TABLE IDENTIFIER        01760000
MTTCURPT DS    F                   ADDRESS OF CURRENT ENTRY             01800000
MTTENTPT DS    F                   ADDRESS OF STORAGE AREA FOR          01850000
*                                  TABLE ENTRIES                        01900000
MTTENDPT DS    F                   ADDRESS OF FIRST BYTE BEYOND         01950000
*                                  END OF THE TABLE                     02000000
MTTSIZE  DS    0F                  SUBPOOL AND LENGTH OF TABLE FOR      02050000
*                                  FREEMAIN                             02100000
MTTSP    DS    B                   SUBPOOL OF TABLE                     02150000
MTTLEN   DS    3B                  LENGTH  OF TABLE                     02200000
MTTWRPTM DS    CL12                TIME TABLE WAS INITIALIZED OR        02250000
*                                  LAST WRAPPED, IN FORM                02300000
*                                  IT/WTHH:MM:SS.S PRODUCED BY          02320000
*                                  THE USE OF THE CONTIME MACRO         02340000
MTTWRPPT DS    F                   ADDRESS OF LAST ENTRY STORED         02400000
*                                  BEFORE TABLE WRAP                    02450000
MTTPFLAG DS    F                   MASTER TRACE FACILITY INTERNAL       02500000
*                                  TRACING FLAGS USED BY IEEMB808       02550000
MTTDAREA DS    F                   DATA AREA LENGTH                     02600000
MTTRSVD1 DS    4C                  RESERVED WORD                        02700000
MTTWK808 DS    16F                 WORK AREA FOR IEEMB808               02705000
MTTRSVD2 DS    16C                 RESERVED WORDS                       02710000
MTTHDRLN EQU   *-MTTHDRA           LENGTH OF MASTER TRACE HEADER        02720000
MTTENTA  DS    0C                  STORAGE AREA FOR TABLE ENTRIES       02750000
         SPACE                                                          02800000
*********************************************************************** 02850000
*                                                                     * 02900000
* MT ENTRY MAPS A SINGLE MASTER TRACE TABLE ENTRY                     * 02950000
*                                                                     * 02980000
*  A DETAILED DESCRIPTION OF FIELDS MTENTFLG AND MTENTTAG             * 03010000
*  CAN BE FOUND IN MACRO IEZMTPRM                                     * 03100000
*                                                                     * 03150000
*********************************************************************** 03200000
         SPACE                                                          03250000
MTENTRY  DSECT                                                          03300000
MTENTHDR DS   0CL10                TABLE ENTRY HEADER                   03450000
MTENTFLG DS   CL2                  FLGS SET BY CALLER                   03500000
MTENTTAG DS   CL2                  IDENTIFIES CALLER                    03540000
MTENTIMM DS   CL4                  CALLERS IMMEDIATE DATA               03580000
MTENTLEN DS   CL2                  LENGTH OF CALLERS DATA               03620000
MTENTDAT DS   0C                   DATA PASSED BY CALLER                03700000
         MEND                                                        */ 03750000
*% IEEZB806:  ;                                                         03760000
*/*                                                                  */ 03770000
*DECLARE                                                                03800000
*                                                                       03850000
*1 MTTABLE  BDY(DWORD) BASED(BAMTTBL), /* ALIGN MASTER TRACE            03900000
*                                         TABLE MAPPING TO A            03940000
*                                         DOUBLE WORD BOUNDARY       */ 03980000
*                                                                       04020000
*  2 MTTHDRA       BDY(DWORD),         /* HEADER AREA OF TABLE       */ 04060000
*                                                                       04150000
*    4 MTTID       CHAR(4),            /* MASTER TRACE TABLE IDENT.  */ 04160000
*                                                                       04170000
*    4 MTTCURPT    PTR(31),            /* ADDR OF CURRENT ENTRY      */ 04200000
*                                                                       04250000
*    4 MTTENTPT    PTR(31),            /* ADDR OF STORAGE AREA          04300000
*                                         FOR TABLE ENTRIES          */ 04350000
*                                                                       04400000
*    4 MTTENDPT    PTR(31),            /* ADDR OF FIRST BYTE            04450000
*                                         BEYOND END OF TABLE        */ 04500000
*                                                                       04550000
*    4 MTTSIZE     FIXED(32),          /* SUBPOOL AND LENGTH            04600000
*                                         FOR FREEMAIN               */ 04640000
*      6 MTTSP     FIXED(8),           /* SUBPOOL OF TABLE           */ 04680000
*      6 MTTLEN    FIXED(24),          /* LENGTH OF TABLE            */ 04720000
*    4 MTTWRPTM    CHAR(12),           /* TIME TABLE INITIALIZED        04800000
*                                         OR TIME LAST WRAPPED IN       04850000
*                                         FORM IT/WTHH:MM:SS.S,         04900000
*                                         PRODUCED VIA THE USE OF       04920000
*                                         THE CONTIME MACRO          */ 04940000
*                                                                       05000000
*    4 MTTWRPPT    PTR(31),            /* ADDR OF LAST ENTRY            05050000
*                                         STORED BEFORE TABLE WRAP   */ 05100000
*                                                                       05150000
*    4 MTTPFLAG    BIT(32),            /* MASTER TRACE FACILITY         05200000
*                                         PROCESSING INTERNAL           05250000
*                                         TRACING FLAGS USED BY         05300000
*                                         IEEMB808 AND IEEMB809      */ 05350000
*                                                                       05450000
*    4 MTTDAREA    FIXED(31),          /* DATA AREA LENGTH           */ 05500000
*                                                                       05550000
*    4 MTTRSVD1    CHAR(4),            /* RESERVED WORD TO ASSURE       05600000
*                                         DWORD BDY FOR MTTWK808     */ 05607000
*                                                                       05614000
*    4 MTTWK808    CHAR(64),           /* WORK AREA FOR IEEMB808     */ 05621000
*                                                                       05628000
*    4 MTTRSVD2    CHAR(16),           /* RESERVED WORDS             */ 05635000
*                                                                       05650000
*  2 MTTENTA       CHAR(*);            /* STORAGE AREA FOR              05700000
*                                         TABLE ENTRIES              */ 05750000
*@EJECT;                                                                05770000
*/********************************************************************/ 05800000
*/*                                                                  */ 05850000
*/* IEEZB806-                                                        */ 05900000
*/*                                                                  */ 05910000
*/* MTENTRY MAPS A SINGLE MASTER TRACE TABLE ENTRY                   */ 05920000
*/*                                                                  */ 05970000
*/*  A DETAILED DESCRIPTION OF FIELDS  MTENTFLG AND MTENTTAG         */ 06000000
*/*  CAN BE FOUND IN MACRO IEZMTPRM                                  */ 06050000
*/*                                                                  */ 06100000
*/********************************************************************/ 06150000
*DECLARE                                                                06200000
*                                                                       06250000
*  1 MTENTRY BDY(BYTE) BASED(MTTCURPT),/*    ALIGNS TO BYTE BNDRY    */ 06300000
*                                                                       06350000
*    2 MTENTHDR    CHAR(10),           /* TABLE ENTRY HEADER         */ 06400000
*                                                                       06450000
*      4 MTENTFLG  BIT(16),            /* FLAGS SET BY CALLER        */ 06500000
*                                                                       06550000
*      4 MTENTTAG  BIT(16),            /* IDENTIFIES CALLER          */ 06600000
*                                                                       06650000
*      4 MTENTIMM  BIT(32),            /* CALLERS IMMEDIATE DATA     */ 06700000
*                                                                       06750000
*      4 MTENTLEN  BIT(16),            /* LENGTH OF CALLER'S DATA    */ 06800000
*                                                                       06850000
*    2 MTENTDAT    CHAR(*);            /* DATA PASSED BY CALLER      */ 06900000
