*         %GOTO MSRA1;   /* BILINGUAL MAPPING                           00100000
          MACRO                                                         00150000
          IEEZB808   ,   */                                             00200000
*%MSRA1: ;                                                              00250000
*/***START OF SPECIFICATIONS******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01*  MACRO NAME:       IEEZB808                               @P3C*/ 00380000
*/*                                                                  */ 00410000
*/*01*  DSECT NAME:       MSRASDCA                               @P3A*/ 00440000
*/*                                                                  */ 00470000
*/*01*  DESCRIPTIVE NAME: MASTER SCHEDULER COMMAND RAS DATA      @P3C*/ 00500000
*/*                   COMMUNICATIONS AREA (MSRASDCA)                 */ 00530000
*/*                                                                  */ 00541600
*/* EXTERNAL CLASSIFICATION: NOTPI                                   */ 00553200
*/* END OF EXTERNAL CLASSIFICATION                               @P3C*/ 00564800
*/*                                                                  */ 00576400
*/*01*  COMPONENT:  SYSTEM COMMAND   (SC1B8)                     @P3A*/ 00588200
*/*                                                                  */ 00600000
*/*01* PROPRIETARY STATEMENT=                                        */ 00632500
*/***PROPRIETARY_STATEMENT********************************************/ 00665000
*/*                                                                  */ 00697500
*/*                                                                  */ 00730000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00737100
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00744200
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1981, 1999                      */ 00751300
*/*                                                                  */ 00758500
*/* STATUS= JBB6607                                                  */ 00760200
*/*                                                                  */ 00761900
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00763600
*/*                                                                  */ 00765600
*/*01*  EYE-CATCHER:  MRAS                                       @P3A*/ 00766700
*/*02*    OFFSET:  0                                             @P3A*/ 00767800
*/*02*    LENGTH:  4                                             @P3A*/ 00768900
*/*                                                                  */ 00770000
*/*01*  STORAGE ATTRIBUTES:                                      @P3A*/ 00773000
*/*02*    MAIN STORAGE:                                          @P3A*/ 00776000
*/*02*    VIRTUAL STORAGE:                                       @P3A*/ 00779000
*/*02*    AUXILARY STORAGE:                                      @P3A*/ 00782000
*/*02*    DATA SPACE:                                            @P3A*/ 00785000
*/*02*    SUBPOOL:  230                                          @P3A*/ 00788000
*/*02*    KEY:      0                                            @P3A*/ 00791000
*/*02*    RESIDENCY:                                             @P3A*/ 00794000
*/*                                                                  */ 00797000
*/*01*  SIZE:  116 BYTES                                         @P3A*/ 00800000
*/*                                                                  */ 00803000
*/*01*  FUNCTION:    MAPS THE DATA AREA USED TO COMMUNICATE SDWA @P3C*/ 00806000
*/*                   DATA BETWEEN:                                  */ 00810000
*/*                   . MAINLINE SYSTEM COMMAND PROCESSORS AND THE   */ 00816000
*/*                     MASTER SCHEDULER COMMAND PROCESSOR ESTAE     */ 00822000
*/*                     RECOVERY MODULE - IEECB860                   */ 00828000
*/*                   . MODULES IN THE SVC 34 LOAD(IGC0003D) AND     */ 00834000
*/*                     THE SVC 34 ESTAE MODULE - IEE5103D           */ 00852000
*/*                                                                  */ 00870000
*/*01*  METHOD OF ACCESS:                                        @P3C*/ 00890000
*/*                   BAL  - SPECIFY IEEZB808                        */ 00910000
*/*                          USING ON MSRASDCA GIVES ADDRESSABILITY  */ 00930000
*/*                          FOR ALL SYMBOLS, EXCEPT MSRVRA.         */ 00950000
*/*                          A LOAD FOR MSRVRAD AND A USING ON       */ 00955000
*/*                          MSRVRADS GIVES ADDRESSABILITY FOR       */ 00960000
*/*                          MSRVRA                                  */ 00965000
*/*                                                                  */ 00970000
*/*                   PL/S - %INCLUDE SYSLIB(IEEZB808)               */ 00990000
*/*                          IF IT IS DESIRED THAT THE MAPPING       */ 01016600
*/*                          BE BASED ON A POINTER, DEFINE THE       */ 01043200
*/*                          MACRO CHARACTER VARIABLE                */ 01069800
*/*                          MSRBASE AND SET IT TO BE THE            */ 01096400
*/*                          NAME OF THE POINTER                     */ 01123000
*/*                                                                  */ 01150000
*/*                          EXAMPLE:  %DCL MSRBASE CHAR             */ 01150300
*/*                                    % MSRBASE='MSRASPTR'          */ 01150600
*/*                                                                  */ 01150900
*/*                          IF THE MAPPING IS NOT TO BE BASED       */ 01151200
*/*                          ON A POINTER, DEFINE THE MACRO          */ 01151500
*/*                          VARIABLE MSRBASE AND SET IT             */ 01151800
*/*                          TO 'NONE'.                              */ 01152100
*/*                                                                  */ 01152400
*/* USAGE =           ANY SYSTEM COMMAND PROCESSOR PROTECTED BY      */ 01153000
*/*                   IEECB860 OR IEE5103D MAY USE THIS AREA TO      */ 01156300
*/*                   COMMUNICATE DATA TO BE RECORDED IN THE SDWA.   */ 01159600
*/*                                                                  */ 01162900
*/*01*  CREATED BY:   IEECB860 AND IEE0003D                      @P3C*/ 01166200
*/*                                                                  */ 01169500
*/*01*  POINTED-TO-BY:    REGISTER 3, ON RETURN FROM IEECB860    @P3C*/ 01172800
*/*                   FIELD XAMSRAS IN THE XSA                       */ 01176100
*/*                                                                  */ 01180000
*/*01*  SERIALIZATION:    NONE                                   @P3C*/ 01186000
*/*                                                                  */ 01192000
*/* CHANGE ACTIVITY = G860P2I - NEW FOR OS/VS2 HBB2102       @G860P2I*/ 01200000
*/* $L1=MRRRECOV, JBB2125, 830727, PDF9: COMMAND RECOVERY            */ 01216600
*/*                                      ENHANCEMENTS                */ 01233200
*/* $P1=PEO2675,  HBB4410, 891020, PDHK: ADD LENGTH AND POINTER TO   */ 01238800
*/*                                      IEECB860'S PARAMETER AREA   */ 01244400
*/* $P2=PWA0053,  JBB6607, 980128, PDZH: CHANGED DISTLIB TO AMODGEN  */ 01247200
*/* $P3=PWA0362,  JBB6607, 980818, PDZH: CHANGED EXTERNAL            */ 01248100
*/*                                      CLASSIFICATION TO NOTPI     */ 01249000
*/*                                                                  */ 01250000
*/**END OF SPECIFICATIONS*********************************************/ 01300000
*%GOTO MSRA2;   /*                                                      01350000
.* A 000000-999999                                             @G860P2I 01400000
.* A RETRY, CLEANUP, RUB AND DUMP EXIT ADDRS, 'NO MESSAGE' BIT     @L1A 01424900
.* C CHANGED EXTERNAL CLASSIFICATION TO NOTPI                      @P3A 01437400
         SPACE                                                          01449900
MSRASDCA DSECT   -       MASTER SCHEDULER RAS DATA COMMUNICATIONS AREA  01500000
         SPACE                                                          01550000
MSRCBID  DS    CL4                CONTROL BLOCK ID - MRAS               01570000
MSRVERSN DS    CL1                VERSION LEVEL                         01573300
MSRSP21  EQU   1                  VERSION LEVEL OS/VS2 HBB2102          01574100
MSRSP212 EQU   2                  VERSION LEVEL OS/VS2 JBB2125     @L1A 01575900
MSRVERID EQU   MSRSP212           VERSION LEVEL - UPDATED FOR SIZE OR  X01576100
                                  INCOMPATIBLE CHANGE              @L1C 01576300
MSRFLGS1 DS    XL1                FLAGS BYTE                       @L1A 01577000
MSRNOMSG EQU   X'80'              DO NOT ISSUE MESSAGE             @L1A 01578000
MSRES1   DS    CL2                RESERVED                         @L1C 01579100
MSRLNAME DS    CL8                FAILING LOAD MODULE NAME              01579900
MSRCNAME DS    CL8                FAILING CSECT NAME                    01583200
         ORG   MSRCNAME+5         POSITION ON SIXTH CHARACTER OF CSECT X01586500
                                  NAME                                  01588400
MSREXITF DS    CL1                IF SET TO 'X' CSECT IS NOT IN CONTROL 01590300
MSREXITI EQU   C'X'               USED TO INDICATE CSECT NOT IN CONTROL 01592200
         ORG                                                            01594100
MSRCMPID DS    CL5                COMPONENT ID OF FAILING MODULE        01596400
MSRCMND  DS    CL23               FAILING COMMAND                       01599700
MSRMODLV DS    CL16               LEVEL OF FAILING MODULE               01603000
MSREASNC DS    CL4                REASON CODE OR RETURN CODE FOR ABEND  01606300
MSRDSIZE DS    XL2                LENGTH OF VARIABLE DATA AREA          01610000
MSRDLEN  DS    XL2                LENGTH OF VARIABLE DATA               01630000
MSRDPVA  DS    0H                 FLAGS DESCRIBING MSRVRA, TO BE       X01650000
                                  MOVED TO SDWAVRA                      01670000
MSRDPVA1 DS    XL1                BYTE ONE OF SDWADPVA                  01690000
MSRHEX   EQU   X'80'              MSRVRA DATA TO BE PRINTED BY EREP    X01710000
                                  IN HEX                                01730000
MSREBC   EQU   X'40'              MSRVRA DATA TO BE PRINTED BY EREP    X01750000
                                  IN EBCDIC                             01770000
MSRVRAM  EQU   X'20'              MSRVRA DATA IS IN THE FORMAT MAPPED  X01790000
                                  BY THE IHAVRA MACRO                   01810000
MSRDPVA2 DS    XL1                RESERVED                              01830000
MSRES2   DS    H                  RESERVED                              01850000
MSRES3   DS    F                  RESERVED                              01853000
MSRVRAD  DS    A                  ADDRESS OF MSRVRA                @L1C 01854700
MSRRTYAD DS    A                  ADDRESS OF RETRY ROUTINE WHERE AN    X01855300
                                  SDWA IS AVAILABLE                @L1A 01855900
MSRRTYNS DS    A                  ADDRESS OF RETRY ROUTINE IN THE      X01856500
                                  EVENT OF NO SDWA                 @L1A 01857100
MSRCLPAD DS    A                  ADDRESS OF CLEANUP ROUTINE       @L1A 01858100
MSRRUBAD DS    A                  ADDRESS OF REGISTER UPDATE BLOCK -   X01859800
                                  MUST BE PROVIDED IF RETRY            X01861500
                                  SPECIFIED                        @L1A 01863200
MSRDMPEX DS    A                  ADDRESS OF DUMP EXIT             @L1A 01868300
MSRPARMP DS    A                  POINTER TO IEECB860'S PARM AREA  @P1A 01868700
MSRPARML DS    XL2                LENGTH OF IEECB860'S PARM AREA   @P1A 01869100
MSRES4   DS    CL2                RESERVED                         @P1C 01869500
         SPACE                                                          01870000
MSRVRADS DSECT                    VARIABLE DATA AREA DSECT              01880000
MSRVRA   DS    CL255              VARIABLE DATA TO BE MOVED TO SDWAVRA  01890000
         MEND   , */                                                    01900000
* %MSRA2:  ;                                                            01910000
*@SPACE;                                                                01920000
*%IF MSRBASE ~= '' %THEN %GOTO MSRA3;                                   01990000
* DCL 1 MSRASDCA BDY(WORD)                                              02010000
*                BASED(MSRASPTR),/*MASTER SCHEDULER RAS DATA            02030000
*                                  COMMUNICATIONS AREA               */ 02050000
*%GOTO MSRA5;                                                           02054100
*%MSRA3: ;                                                              02058200
*   %IF MSRBASE ~= 'NONE' %THEN %GOTO MSRA4;                            02062300
* DCL 1 MSRASDCA BDY(WORD),      /* MASTER SCHEDULER RAS DATA           02066400
*                                  COMMUNICATIONS AREA               */ 02070500
*%GOTO MSRA5;                                                           02074600
*%MSRA4: ;                                                              02078700
* DCL 1 MSRASDCA BDY(WORD)                                              02082800
*                BASED(MSRBASE),/*MASTER SCHEDULER RAS DATA             02086900
*                                  COMMUNICATIONS AREA               */ 02091000
*%MSRA5: ;                                                              02095100
*      2 MSRCBID  CHAR(4),       /*CONTROL BLOCK ID - MRAS           */ 02100000
*      2 MSRVERSN FIXED(8),      /*VERSION LEVEL                     */ 02107600
*      2 MSRFLGS1 BIT(8),        /*FLAGS BYTE                    @L1A*/ 02110600
*        3 MSRNOMSG BIT(1),      /*DO NOT ISSUE MESSAGE          @L1A*/ 02115100
*      2 MSRES1   CHAR(2),       /*RESERVED                      @L1C*/ 02119600
*      2 MSRLNAME CHAR(8),       /*FAILING LOAD MODULE NAME          */ 02122800
*      2 MSRCNAME CHAR(8),       /*FAILING CSECT NAME                */ 02130400
*        3 *      CHAR(5),                                              02138000
*        3 MSREXITF CHAR(1),     /*IF SET TO 'X' CSECT IS NOT IN        02145600
*                                  CONTROL                           */ 02153200
*      2 MSRCMPID CHAR(5),       /*COMPONENT ID OF FAILING MODULE    */ 02160800
*      2 MSRCMND  CHAR(23),      /*FAILING COMMAND                   */ 02168400
*      2 MSRMODLV CHAR(16),      /*LEVEL OF FAILING MODULE           */ 02176000
*      2 MSREASNC CHAR(4),       /*REASON CODE OR RETURN CODE FOR       02183600
*                                  ABEND                             */ 02191200
*      2 MSRDSIZE FIXED(15),     /*LENGTH OF VARIABLE DATA AREA      */ 02200000
*      2 MSRDLEN FIXED(15),      /*LENGTH OF VARIABLE DATA           */ 02250000
*      2 MSRDPVA FIXED(16),      /* FLAGS DESCRIBING MSRVRA, TO BE      02300000
*                                   MOVED TO SDWADPVA                */ 02350000
*       3 MSRDPVA1 BIT(8),       /* BYTE ONE OF SDWADPVA             */ 02400000
*        4 MSRHEX BIT(1),        /* MSRVRA DATA TO BE PRINTED BY EREP   02450000
*                                   IN HEX                           */ 02500000
*        4 MSREBC BIT(1),        /* MSRVRA DATA TO BE PRINTED BY EREP   02550000
*                                   IN EBCDIC                        */ 02600000
*        4  MSRVRAM BIT(1),       /* MSRVRA DATA IS IN THE FORMAT       02650000
*                                   MAPPED BY THE IHAVRA MACRO       */ 02700000
*       3 MSRDPVA2 BIT(8),       /* RESERVED                         */ 02750000
*      2 MSRES2  FIXED(16),      /*RESERVED                          */ 02800000
*      2 MSRES3  FIXED(31),      /*RESERVED                          */ 02850000
*      2 MSRVRAD PTR(31),        /* ADDRESS OF MSRVRA            @L1C*/ 02870000
*      2 MSRRTYAD PTR(31),       /* ADDRESS OF RETRY ROUTINE WHERE AN   02876000
*                                   SDWA IS AVAILABLE            @L1A*/ 02882000
*      2 MSRRTYNS PTR(31),       /* ADDRESS OF RETRY ROUTINE IN THE     02888000
*                                   EVENT OF NO SDWA             @L1A*/ 02894000
*      2 MSRCLPAD PTR(31),       /* ADDRESS OF CLEANUP ROUTINE   @L1A*/ 02900000
*      2 MSRRUBAD PTR(31),       /* ADDRESS OF REGISTER UPDATE          02910000
*                                   BLOCK - MUST BE PROVIDED IF         02918300
*                                   RETRY SPECIFIED              @L1A*/ 02926600
*      2 MSRDMPEX PTR(31),       /* ADDRESS OF DUMP EXIT         @L1A*/ 02934400
*      2 MSRPARMP PTR(31),                /*PARAMETER POINTER - FOR     02937000
*                               IEECB860'S GETMAINED AREA        @P1A*/ 02939600
*      2 MSRPARML FIXED(16),             /*PARAMETER LENGTH - FOR       02942200
*                               IEECB860'S GETMAINED AREA        @P1A*/ 02944800
*      2 MSRES4  CHAR(2);        /*RESERVED                      @P1C*/ 02947400
* DCL MSRVRA CHAR(255) BASED(MSRVRAD);          /* VARIABLE DATA TO BE  02950000
*                                  MOVED TO SDWAVRA                  */ 03000000
* @EJECT;                          /*                        @G860P2I*/ 03025000
*/********************************************************************/ 03050000
*/*                                                                  */ 03100000
*/*    VALUE TO PUT IN MSREXITF TO INDICATE THE CSECT IN MSRCNAME    */ 03150000
*/*                 IS NOT IN CONTROL                                */ 03200000
*/*                                                                  */ 03250000
*/********************************************************************/ 03300000
* DCL MSREXITI CHAR(1) CONSTANT('X'); /*USED TO INDICATE CSECT NOT IN   03350000
*                                        CONTROL                     */ 03400000
*/********************************************************************/ 03450000
*/*                                                                  */ 03500000
*/*    VALUES FOR VERSION LEVEL - PUT IN FIELD MSRVERSN              */ 03550000
*/*                                                                  */ 03600000
*/********************************************************************/ 03650000
* DCL MSRSP21 FIXED(8) CONSTANT(1),/*VERSION LEVEL IS OS/VS2 HBB2102 */ 03700000
*     MSRSP212 FIXED(8) CONSTANT(2); /* VERSION LEVEL OS/VS2            03850000
*                                       JBB2125                  @L1A*/ 03900000
* DCL MSRVERID FIXED(8) CONSTANT(MSRSP212);/*VERSION LEVEL - UPDATED    03950000
*                               FOR SIZE OR INCOMPATIBLE CHANGE  @L1C*/ 04000000
