*        %GOTO VSRIPRLG;     /*   BILINGUAL MAPPING                     00000100
         MACRO                                                          00000200
         IEEZB812    ,       */                                         00000300
*%VSRIPRLG : ;                                                          00000400
*/********************************************************************/ 00000500
*/*                                                                  */ 00000600
*/*01* MACRO NAME=       IEEZB812                                    */ 00000700
*/*                                                                  */ 00000800
*/*01* DESCRIPTIVE NAME= VARY SERVICE ROUTINE INTERFACE LIST (VSRI)  */ 00000900
*/*                                                                  */ 00001000
*/*01* PROPRIETARY STATEMENT=                                        */ 00001100
*/***PROPRIETARY_STATEMENT********************************************/ 00001200
*/*                                                                  */ 00001500
*/*                                                                  */ 00001600
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00001700
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00001800
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1984, 1999                      */ 00001900
*/*                                                                  */ 00002000
*/* STATUS= JBB6607                                                  */ 00002100
*/*                                                                  */ 00002200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00002300
*/*                                                                  */ 00002400
*/* EXTERNAL CLASSIFICATION: NONE                                    */ 00002500
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00002600
*/*                                                                  */ 00002700
*/*01* METHOD OF ACCESS=                                             */ 00002800
*/*                    BAL- SPECIFY IEEZB812                         */ 00002900
*/*                         USING ON VSRI GIVES ADDRESSABILITY       */ 00003000
*/*                         TO THE COMMON HEADER SECTION.            */ 00003100
*/*                                                                  */ 00003200
*/*                         LOAD A REGISTER WITH VSRFRSTP TO         */ 00003300
*/*                         ADDRESS THE FIRST DEVICE ENTRY OR        */ 00003400
*/*                         VSRSNGLP TO ADDRESS THE DEVICE           */ 00003500
*/*                         ENTRY TO BE PROCESSED. A USING           */ 00003600
*/*                         ON VSRENTRY GIVES ADDRESSABILITY         */ 00003700
*/*                         FOR THE DEVICE ENTRY.                    */ 00003800
*/*                                                                  */ 00003900
*/*                         LOAD A REGISTER WITH VSRFPTR TO          */ 00004000
*/*                         ADDRESS THE FOOTPRINTS. A USING          */ 00004100
*/*                         ON VSRFPT GIVES ADDRESSABILITY           */ 00004200
*/*                         FOR THE VARY FOOTPRINTS.                 */ 00004300
*/*                                                                  */ 00004400
*/*                   PL/S- %INCLUDE SYSLIB(IEEZB812)                */ 00004500
*/*                         IF IT IS DESIRED THAT THE MAPPING BE     */ 00004600
*/*                         BASED ON A POINTER, DEFINE A MACRO       */ 00004700
*/*                         CHARACTER VARIABLE VSRIBASE AND SET IT   */ 00004800
*/*                         TO BE THE NAME OF THE POINTER TO USE.    */ 00005100
*/*                           EXAMPLE:                               */ 00005300
*/*                                %DCL VSRIBASE CHAR                */ 00005500
*/*                                % VSRIBASE = 'VSRIPARM'           */ 00005900
*/*                                                                  */ 00006300
*/*                         IF THE MAPPING IS NOT TO BE BASED AT ALL,*/ 00006700
*/*                         DEFINE A MACRO CHARACTER VARIABLE        */ 00007100
*/*                         VSRIBASE AND SET IT TO 'NONE'            */ 00007500
*/*                                                                  */ 00007900
*/*                         DCL VSRDVPTR PTR(31)   DEVICE ENTRY WORK */ 00008300
*/*                                                PTR               */ 00008700
*/*01* CREATED BY=     IEE3603D                                      */ 00009100
*/*                                                                  */ 00009500
*/*01* SUBPOOL=        229                                           */ 00009900
*/*                                                                  */ 00010300
*/*01* FUNCTION=       MAPS THE VARY COMMAND REQUESTS TO             */ 00010700
*/*                    ASSIGN/UNASSIGN AND ASSOCIATE/DISASSOCIATE    */ 00011100
*/*                    DYNAMIC PATHING FOR SPECIFIC DEVICES TO       */ 00011500
*/*                    SINGLE OR MULTI-SYSTEMS.                      */ 00011900
*/*                                                                  */ 00012300
*/*                    THE VARY FOOTPRINTS MAP THE FLOW OF           */ 00012700
*/*                    VARY ONLINE/OFFLINE/CONSOLE COMMAND           */ 00013100
*/*                    PROCESSING AND SERVE AS A DEBUGGING           */ 00013500
*/*                    AID.                                          */ 00013900
*/*                                                                  */ 00014300
*/*01* CHANGE ACTIVITY=                                              */ 00014700
*/*   $H0=3480AU   JBB2125 830620 PD2I: NEW MAPPING MACRO            */ 00014900
*/*   $L1=TSOOP    HBB4410 870916 PDCW: TSO OPERATOR                 */ 00015100
*/*   $L2=TSOOPACW HBB4410 881010 PDCW: TSO OPERATOR                 */ 00015300
*/*   $L3=TLIBR    HBB4410 891218 PD35: TAPE LIBRARY SUPPORT         */ 00015400
*/*   $P1=PEO3879  HBB4410 900406 PDAD: MISSNG TSOOP SUPPORT         */ 00015500
*/*   $P2=PWA0053  JBB6607 980128 PDZH: CHANGED DISTLIB TO AMODGEN   */ 00015600
*/*                                                                  */ 00015700
*/********************************************************************/ 00015900
*%GOTO PLSVSRI;     /*                                                  00016300
         EJECT                                                          00016700
VSRI     DSECT              VARY SERVICE ROUTINE INTERFACE LIST         00017100
         SPACE                                                          00017500
*********************************************************************** 00017900
*                                                                     * 00018300
*           THIS IS THE COMMON HEADER SECTION AND CONTAINS            * 00018700
*           THE ADDRESS OF THE DEVICE ENTRIES AND VARY                * 00019100
*           FOOTPRINTS.                                               * 00019500
*                                                                     * 00019900
*********************************************************************** 00020300
         SPACE                                                          00020700
VSRACRN  DS    CL4                ACRONYM - VSRI                        00021100
VSRVERS  DS    CL1                VERSION LEVEL                         00021500
VSRSP212 EQU   1                  VERSION LEVEL OS/VS2 JBB2125          00021900
VSRSP410 EQU   2                  VERSION LEVEL - HBB4410          @L1A 00022200
VSRVERID EQU   VSRSP410           VERSION LEVEL - UPDATED FOR SIZE OR  X00022500
                                   INCOMPATIBLE CHANGE             @L1C 00022800
VSRNUM   DS    FL1                NUMBER OF DEVICE ENTRIES              00023100
VSRCNID  DS    CL1                CONSOLE ID                            00023500
VSRFLGS  DS    BL1                FLAG BYTE                             00023900
VSRMLSYS EQU   X'80'               SHR SPECIFIED ON VARY ONLINE         00024300
VSRSMSVL EQU   X'40'               VARY FOR SMS LIBRARY            @L3A 00024400
VSRMIFSV EQU   X'20'               TEXT ADDED TO MESSAGE BUFFER    @L3A 00024500
VSRRSV0  DS    H                  RESERVED                              00024700
VSRRETCD DS    CL2                VARY RETURN CODE FOR DIRECT          X00025100
                                   INVOCATION OF VARY                   00025500
VSRFRSTP DS    A                  ADDRESS OF FIRST DEVICE ENTRY         00025900
VSRSNGLP DS    A                  ADDRESS OF A SINGLE DEVICE ENTRY TO  X00026300
                                   BE PROCESSED                         00026700
VSRTOKEN DS    A                  ESTAE TOKEN PTR FOR IEECB862          00027100
VSRFPTR  DS    A                  VARY FOOTPRINTS POINTER               00027500
VSRMODNM DS    CL8                ACTIVE MODULE NAME                    00027900
VSRMODLV DS    CL16               FAILING MODULE LEVEL                  00028300
VSRXSAP  DS    A                  ADDR OF DUMMY XSA BUILT IN 3603D @L1C 00028700
VSRXSACP DS    F                  ADDR OF THE XSA COPY FOR 503D    @L2C 00029100
VSRCNIDI DS    F                  4-BYTE CONSOLE ID                @P1A 00029200
VSRCART  DS    CL8                COMMAND AND RESPONSE TOKEN       @P1A 00029300
VSRMIFB  DS    A                  ADDRESS OF MESSAGE BUFFER TOKEN  @L3A 00029400
VSRRSV2  DS    F                  RESERVED                         @P1A 00029500
VSRRSV3  DS    F                  RESERVED                              00029600
VSRRSV4  DS    F                  RESERVED                              00029900
VSRILEN  EQU   *-VSRI             LENGTH OF VSRI HEADER                 00030100
         SPACE                                                          00030300
*********************************************************************** 00030700
*                                                                     * 00031100
*             THIS SECTION MAPS A DEVICE ENTRY                        * 00031500
*             THERE IS A MAXIMUM OF 28 DEVICE ENTRIES FOR             * 00031900
*             EACH VARY COMMAND.                                      * 00032300
*                                                                     * 00032700
*********************************************************************** 00033100
         SPACE                                                          00033500
VSRENTRY DSECT             DEVICE ENTRY DSECT                           00033900
         SPACE                                                          00034300
VSRINPUT DS    BL1                INPUT FLAGS                           00034700
VSRADYNP EQU   X'80'               ASSOCIATE DYNAMIC PATHING            00035100
VSRASGN  EQU   X'40'               ASSIGN DEVICE                        00035500
VSRDDYNP EQU   X'20'               DISASSOCIATE DYNAMIC PATHING         00035900
VSRUNASN EQU   X'10'               UNASSIGN DEVICE                      00036300
VSRRSV5  EQU   X'08'               RESERVED                             00036700
VSRRSV6  EQU   X'04'               RESERVED                             00037100
VSRRSV7  EQU   X'02'               RESERVED                             00037500
VSRRSV8  EQU   X'01'               RESERVED                             00037900
         SPACE                                                          00038300
VSRRSV9  DS    BL1                RESERVED                              00038700
         SPACE                                                          00039100
VSRSTAT  DS    BL1                STATUS FLAGS                          00039500
VSRASSOC EQU   X'80'               DYNAMIC PATHING ASSOCIATED           00039900
VSRASSND EQU   X'40'               DEVICE ASSIGNED                      00040300
VSRONLIN EQU   X'20'               DEVICE ONLINE                        00040700
VSRPROB  EQU   X'10'               PROBLEM OCCURRED DURING IEECB809    X00041100
                                     PROCESSING                         00041500
VSRRSVA  EQU   X'08'               RESERVED                             00041900
VSRRSVB  EQU   X'04'               RESERVED                             00042300
VSRRSVC  EQU   X'02'               RESERVED                             00042700
VSRRSVD  EQU   X'01'               RESERVED                             00043100
         SPACE                                                          00043500
VSRRSVE  DS    BL1                RESERVED                              00043900
VSRUCBP  DS    A                  UCB ADDRESS                           00044300
VSRIENLN EQU   *-VSRENTRY         LENGTH OF VSRI ENTRY                  00044500
         SPACE                                                          00044700
*********************************************************************** 00045100
*                                                                     * 00045500
*      DEBUGGING FOOTPRINTS FOR VARY MODULES                          * 00045900
*                                                                     * 00046300
*********************************************************************** 00046700
         SPACE                                                          00047100
VSRFPT   DSECT              VARY FOOTPRINTS MAP                         00047500
         SPACE                                                          00047900
VSRNAME  DS    CL7                 ACRONYM - VARYFPT                    00048300
         SPACE                                                          00049100
VSRFPT1  DS    BL1                 FLAG BYTE 1                          00049500
V3603DE  EQU   X'20'                IEE3603D WAS ENTERED                00049900
V3603DA  EQU   X'10'                IEE3603D IS ACTIVE                  00050300
VCB904E  EQU   X'02'                IEECB904 WAS ENTERED                00050700
VCB904A  EQU   X'01'                IEECB904 IS ACTIVE                  00051100
         SPACE                                                          00051500
VSRFPT2  DS    BL1                 FLAG BYTE 2                          00051900
V3303DE  EQU   X'20'                IEE3303D WAS ENTERED                00052300
V3303DA  EQU   X'10'                IEE3303D IS ACTIVE                  00052700
V4403DE  EQU   X'02'                IEE4403D WAS ENTERED                00053100
V4403DA  EQU   X'01'                IEE4403D IS ACTIVE                  00053500
         SPACE                                                          00053900
VSRFPT3  DS    BL1                 FLAG BYTE 3                          00054300
V4203DE  EQU   X'20'                IEE4203D WAS ENTERED                00054700
V4203DA  EQU   X'10'                IEE4203D IS ACTIVE                  00055100
V4603DE  EQU   X'02'                IEE4603D WAS ENTERED                00055500
V4603DA  EQU   X'01'                IEE4603D IS ACTIVE                  00055900
         SPACE                                                          00056300
VSRFPT4  DS    BL1                 FLAG BYTE 4                          00056700
V3103DE  EQU   X'20'                IEE3103D WAS ENTERED                00057100
V3103DA  EQU   X'10'                IEE3103D IS ACTIVE                  00057500
V4903DE  EQU   X'02'                IEE4903D WAS ENTERED                00057900
V4903DA  EQU   X'01'                IEE4903D IS ACTIVE                  00058300
         SPACE                                                          00058700
VSRFPT5  DS    BL1                 FLAG BYTE 5                          00059100
*        EQU   X'20'                RESERVED                            00059500
*        EQU   X'10'                RESERVED                            00059900
*        EQU   X'02'                RESERVED                            00060300
*        EQU   X'01'                RESERVED                            00060700
         SPACE                                                          00061100
VSRFPT6  DS    BL1                 FLAG BYTE 6                          00061500
VCB862E  EQU   X'20'                IEECB862 WAS ENTERED                00061900
VCB862A  EQU   X'10'                IEECB862 IS ACTIVE                  00062300
VCB860C  EQU   X'02'                IEECB860 WAS CALLED BY IEE3603D     00062700
VCB860R  EQU   X'01'                RETURN FROM IEECB860                00063100
         SPACE                                                          00063500
VSRFPT7  DS    BL1                 FLAG BYTE 7                          00063900
VCB809C  EQU   X'20'                IEECB809 WAS CALLED BY IEE3103D    X00064300
                                      OR IEECB862                       00064700
VCB809A  EQU   X'10'                IEECB809 IS  ACTIVE                 00065100
V2303DE  EQU   X'02'                IEE2303D WAS ENTERED                00065700
V2303DA  EQU   X'01'                IEE2303D IS ACTIVE                  00066300
         SPACE                                                          00067100
VSRFPT8  DS    BL1                 FLAG BYTE 8                          00068400
VCVFDEVE EQU   X'20'                IECVFDEV WAS ENTERED (VARY FORCE)   00086500
VCVFDEVA EQU   X'10'                IECVFDEV IS ACTIVE                  00104600
VENFMODE EQU   X'02'                IEFENFFX WAS ENTERED VIA IEE3103D   00122700
VENFMODA EQU   X'01'                IEFENFFX IS ACTIVE                  00140800
         SPACE                                                          00158900
VSRFPT9  DS    BL1                 FLAG BYTE 9                          00177000
VVDEVE   EQU   X'20'                IEEVDEV WAS ENTERED VIA IEE3603D    00195100
VVDEVA   EQU   X'10'                IEEVDEV IS ACTIVE                   00213200
V0503DE  EQU   X'02'                IEE0503D WAS ENTERED                00231300
V0503DA  EQU   X'01'                IEE0503D IS ACTIVE                  00249400
         SPACE                                                          00250700
VSRFPT10 DS    BL1                 FLAG BYTE 10                         00252000
VMNTRE   EQU   X'20'                IEAVMNTR WAS ENTERED VIA IEE4603D   00253300
VMNTRA   EQU   X'10'                IEAVMNTR IS ACTIVE                  00254600
VVMIFE   EQU   X'02'                IEEMIFSV WAS ENTERED           @L3A 00255900
VVMIFA   EQU   X'01'                IEEMIFSV IS ACTIVE             @L3A 00257200
VSRFPTLN EQU   *-VSRFPT             LENGTH OF FOOTPRINTS MAPPING        00258900
         MEND    , */                                                   00268400
*%PLSVSRI: ;                                                            00318400
*@EJECT;                                                                00368400
*/********************************************************************/ 00374600
*/*                                                                  */ 00380800
*/*         THIS IS THE COMMON HEADER SECTION AND CONTAINS           */ 00387000
*/*         THE ADDRESS OF THE DEVICE ENTRIES AND VARY               */ 00393200
*/*         FOOTPRINTS.                                              */ 00399400
*/*                                                                  */ 00405600
*/********************************************************************/ 00411800
*%IF VSRIBASE ~= ''  %THEN %GOTO PLSVSRI1;                              00418400
* DCL 1 VSRI BDY(WORD) BASED(VSRIPTR),/* VARY SERVICE ROUTINE           00468400
*                                         INTERFACE LIST             */ 00518400
*%GOTO PLSVSRI3;                                                        00523000
*%PLSVSRI1: ;                                                           00527600
*   %IF VSRIBASE ~= 'NONE' %THEN %GOTO PLSVSRI2;                        00532200
* DCL 1 VSRI BDY(WORD) ,              /* VARY SERVICE ROUTINE           00537000
*                                         INTERFACE LIST             */ 00543200
*%GOTO PLSVSRI3;                                                        00547300
*%PLSVSRI2: ;                                                           00551400
* DCL 1 VSRI BDY(WORD) BASED(VSRIBASE),/* VARY SERVICE ROUTINE          00555600
*                                         INTERFACE LIST             */ 00561800
*%PLSVSRI3: ;                                                           00565100
*      3 VSRACRN CHAR(4),         /* ACRONYM - VSRI                  */ 00918400
*      3 VSRVERS FIXED(8),        /* VERSION LEVEL                   */ 00968400
*      3 VSRNUM  FIXED(8),        /* NUMBER OF DEVICE ENTRIES        */ 01018400
*      3 VSRCNID CHAR(1),         /* CONSOLE ID                      */ 01068400
*      3 VSRFLGS CHAR(1),         /* FLAG BYTE                       */ 01118400
*       5 VSRMLSYS  BIT(1),       /*  SHR SPECIFIED ON VARY             01168400
*                                     ONLINE                         */ 01218400
*       5 VSRSMSVL  BIT(1),       /*  VARY FOR SMS LIBRARY              01228400
*                                     SPECIFIED                  @L3A*/ 01238400
*       5 VSRMIFSV  BIT(1),       /*  TEXT WAS ADDED TO THE             01248400
*                                     MESSAGE BUFFER             @L3A*/ 01258400
*      3 VSRRSV0 FIXED(16),       /* RESERVED                        */ 01268400
*      3 VSRRETCD FIXED(16),      /* VARY RETURN CODE FOR DIRECT        01318400
*                                    INVOCATION OF VARY              */ 01368400
*      3 VSRFRSTP PTR(31),        /* ADDRESS OF FIRST DEVICE ENTRY   */ 01418400
*      3 VSRSNGLP PTR(31),        /* ADDRESS OF SINGLE DEVICE ENTRY     01468400
*                                     TO BE PROCESSED                */ 01518400
*      3 VSRTOKEN PTR(31),        /* ESTAE TOKEN PTR FOR IEECB862    */ 01568400
*      3 VSRFPTR  PTR(31),        /* VARY FOOTPRINTS POINTER         */ 01618400
*      3 VSRMODNM CHAR(8),        /* ACTIVE MODULE NAME              */ 01668400
*      3 VSRMODLV CHAR(16),       /* FAILING MODULE LEVEL            */ 01718400
*      3 VSRXSAP  PTR(31),        /* ADDR OF DUMMY XSA BUILT IN         01751700
*                                     IEE3603D                   @L1C*/ 01785000
*      3 VSRXSACP PTR(31),        /* ADDR OF THE XSA COPY FOR 0503D     01812800
*                                                                @L2C*/ 01840600
*      3 VSRCNIDI  FIXED(32),     /* 4-BYTE CONSOLE ID           @P1A*/ 01846100
*      3 VSRCART   CHAR(8),       /* COMMAND AND RESPONSE TOKEN  @P1A*/ 01851600
*      3 VSRMIFB   PTR(31),       /* ADDRESS OF MESSAGE BUFFER TOKEN    01855200
*                                                                @L3A*/ 01858800
*      3 VSRRSV2 FIXED(31),       /* RESERVED                    @P1A*/ 01862600
*      3 VSRRSV3 FIXED(31),       /* RESERVED                        */ 01868400
*      3 VSRRSV4 FIXED(31);       /* RESERVED                        */ 01918400
*@SPACE;                                                                01968400
*/********************************************************************/ 02018400
*/*                                                                  */ 02068400
*/*           THIS SECTION MAPS A DEVICE ENTRY                       */ 02118400
*/*           THERE IS A MAXIMUM OF 28 DEVICE ENTRIES                */ 02168400
*/*           FOR EACH VARY COMMAND.                                 */ 02218400
*/*           THE POINTER VSRDVPTR SHOULD BE SET EQUAL               */ 02268400
*/*           TO EITHER VSRSNGLP OR VSRFRSTP.                        */ 02318400
*/*                                                                  */ 02368400
*/********************************************************************/ 02418400
* DCL 1 VSRENTRY BDY(WORD) BASED(VSRDVPTR),/* DEVICE ENTRY           */ 02518400
*      3 VSRINPUT CHAR(1),        /* INPUT FLAGS                     */ 02568400
*       5 VSRADYNP  BIT(1),       /*  ASSOCIATE DYNAMIC PATHING      */ 02618400
*       5 VSRASGN   BIT(1),       /*  ASSIGN DEVICE                  */ 02668400
*       5 VSRDDYNP  BIT(1),       /*  DISASSOCIATE DYNAMIC PATHING   */ 02718400
*       5 VSRUNASN  BIT(1),       /*  UNASSIGN DEVICE                */ 02768400
*       5 VSRRSV5   BIT(1),       /*  RESERVED                       */ 02818400
*       5 VSRRSV6   BIT(1),       /*  RESERVED                       */ 02868400
*       5 VSRRSV7   BIT(1),       /*  RESERVED                       */ 02918400
*       5 VSRRSV8   BIT(1),       /*  RESERVED                       */ 02968400
*      3 VSRRSV9  CHAR(1),        /* RESERVED                        */ 03018400
*      3 VSRSTAT  CHAR(1),        /* STATUS FLAGS                    */ 03068400
*       5 VSRASSOC  BIT(1),       /*  DYNAMIC PATHING ASSOCIATED     */ 03118400
*       5 VSRASSND  BIT(1),       /*  DEVICE ASSIGNED                */ 03168400
*       5 VSRONLIN  BIT(1),       /*  DEVICE ONLINE                  */ 03218400
*       5 VSRPROB   BIT(1),       /*  PROBLEM OCCURRED DURING           03268400
*                                      IEECB809 PROCESSING           */ 03318400
*       5 VSRRSVA   BIT(1),       /*  RESERVED                       */ 03368400
*       5 VSRRSVB   BIT(1),       /*  RESERVED                       */ 03418400
*       5 VSRRSVC   BIT(1),       /*  RESERVED                       */ 03468400
*       5 VSRRSVD   BIT(1),       /*  RESERVED                       */ 03518400
*      3 VSRRSVE   CHAR(1),       /* RESERVED                        */ 03568400
*      3 VSRUCBP   PTR(31);       /* UCB ADDRESS                     */ 03618400
*@SPACE;                                                                03668400
*/********************************************************************/ 03718400
*/*    VALUES FOR VERSION LEVEL - PUT IN FIELD  VSRVERS              */ 03768400
*/********************************************************************/ 03918400
*  DCL VSRVERID FIXED(8) CONSTANT(VSRSP410);/* VERSION LEVEL - UPDATED  04168400
*                                FOR SIZE OR INCOMPATIBLE CHANGE @L1C*/ 04218400
*  DCL VSRSP212 FIXED(8) CONSTANT(1);/* VERSION LEVEL IS                04268400
*                                        OS/VS2 JBB2125              */ 04318400
*  DCL VSRSP410 FIXED(8) CONSTANT(2);/* VERSION LEVEL - HBB4410  @L1A*/ 04343400
*@EJECT;                                                                04368400
*/********************************************************************/ 04418400
*/*                                                                  */ 04468400
*/*     DEBUGGING FOOTPRINTS FOR VARY MODULES                        */ 04518400
*/*                                                                  */ 04568400
*/********************************************************************/ 04618400
*@SPACE;                                                                04668400
* DCL 1 VSRFPT BDY(WORD) BASED(VSRFPTR),/* VARY FOOTPRINTS MAP       */ 04718400
*      3 VSRNAME  CHAR(7),        /* ACRONYM - VARYFPT               */ 04768400
*      3 VSRFPT1  BIT(8),         /* FLAG BYTE 1                     */ 04868400
*       5 *       BIT(2),         /*  RESERVED                       */ 04918400
*       5 V3603DE BIT(1),         /*  IEE3603D WAS ENTERED           */ 04968400
*       5 V3603DA BIT(1),         /*  IEE3603D IS ACTIVE             */ 05018400
*       5 *       BIT(2),         /*  RESERVED                       */ 05068400
*       5 VCB904E BIT(1),         /*  IEECB904 WAS ENTERED           */ 05118400
*       5 VCB904A BIT(1),         /*  IEECB904 IS ACTIVE             */ 05168400
*      3 VSRFPT2  BIT(8),         /* FLAG BYTE 2                     */ 05218400
*       5 *       BIT(2),         /*  RESERVED                       */ 05268400
*       5 V3303DE BIT(1),         /*  IEE3303D WAS ENTERED           */ 05318400
*       5 V3303DA BIT(1),         /*  IEE3303D IS ACTIVE             */ 05368400
*       5 *       BIT(2),         /*  RESERVED                       */ 05418400
*       5 V4403DE BIT(1),         /*  IEE4403D WAS ENTERED           */ 05468400
*       5 V4403DA BIT(1),         /*  IEE4403D IS ACTIVE             */ 05518400
*      3 VSRFPT3  BIT(8),         /* FLAG BYTE 3                     */ 05568400
*       5 *       BIT(2),         /*  RESERVED                       */ 05618400
*       5 V4203DE BIT(1),         /*  IEE4203D WAS ENTERED           */ 05668400
*       5 V4203DA BIT(1),         /*  IEE4203D IS ACTIVE             */ 05718400
*       5 *       BIT(2),         /*  RESERVED                       */ 05768400
*       5 V4603DE BIT(1),         /*  IEE4603D WAS ENTERED           */ 05818400
*       5 V4603DA BIT(1),         /*  IEE4603D IS ACTIVE             */ 05868400
*      3 VSRFPT4  BIT(8),         /* FLAG BYTE 4                     */ 05918400
*       5 *       BIT(2),         /*  RESERVED                       */ 05968400
*       5 V3103DE BIT(1),         /*  IEE3103D WAS ENTERED           */ 06018400
*       5 V3103DA BIT(1),         /*  IEE3103D IS ACTIVE             */ 06068400
*       5 *       BIT(2),         /*  RESERVED                       */ 06118400
*       5 V4903DE BIT(1),         /*  IEE4903D WAS ENTERED           */ 06168400
*       5 V4903DA BIT(1),         /*  IEE4903D IS ACTIVE             */ 06218400
*      3 VSRFPT5  BIT(8),         /* FLAG BYTE 5                     */ 06268400
*      3 VSRFPT6  BIT(8),         /* FLAG BYTE 6                     */ 06618400
*       5 *       BIT(2),         /*  RESERVED                       */ 06668400
*       5 VCB862E BIT(1),         /*  IEECB862 WAS ENTERED           */ 06718400
*       5 VCB862A BIT(1),         /*  IEECB862 IS ACTIVE             */ 06768400
*       5 *       BIT(2),         /*  RESERVED                       */ 06818400
*       5 VCB860C BIT(1),         /*  IEECB860 WAS CALLED BY IEE3603D*/ 06868400
*       5 VCB860R BIT(1),         /*  RETURN FROM IEECB860           */ 06918400
*      3 VSRFPT7  BIT(8),         /* FLAG BYTE 7                     */ 06968400
*       5 *       BIT(2),         /*  RESERVED                       */ 07018400
*       5 VCB809C BIT(1),         /*  IEECB809 WAS CALLED BY IEE3103D   07068400
*                                        OR IEECB862                 */ 07118400
*       5 VCB809A BIT(1),         /*  IEECB809 IS  ACTIVE            */ 07168400
*       5 *       BIT(2),         /*  RESERVED                       */ 07218400
*       5 V2303DE BIT(1),         /*  IEE2303D WAS ENTERED           */ 07268400
*       5 V2303DA BIT(1),         /*  IEE2303D IS ACTIVE             */ 07318400
*      3 VSRFPT8  BIT(8),         /* FLAG BYTE 8                     */ 07468400
*       5 *       BIT(2),         /*  RESERVED                       */ 07518400
*       5 VCVFDEVE BIT(1),        /*  IECVFDEV WAS ENTERED           */ 07568400
*       5 VCVFDEVA BIT(1),        /*  IECVFDEV IS ACTIVE             */ 07618400
*       5 *       BIT(2),         /*  RESERVED                       */ 07668400
*       5 VENFMODE BIT(1),        /*  IEFENFFX WAS ENTERED           */ 07676700
*       5 VENFMODA BIT(1),        /*  IEFENFFX IS ACTIVE             */ 07685000
*      3 VSRFPT9  BIT(8),         /* FLAG BYTE 9                     */ 07701600
*       5 *       BIT(2),         /*  RESERVED                       */ 07709900
*       5 VVDEVE  BIT(1),         /*  IEEVDEV WAS ENTERED VIA           07718200
*                                     IEE3603D                       */ 07726500
*       5 VVDEVA  BIT(1),         /*  IEEVDEV IS ACTIVE              */ 07734800
*       5 *       BIT(2),         /*  RESERVED                       */ 07743100
*       5 V0503DE BIT(1),         /*  IEE0503D WAS ENTERED           */ 07751400
*       5 V0503DA BIT(1),         /*  IEE0503D IS ACTIVE             */ 07801400
*      3 VSRFPT10 BIT(8),         /* FLAG BYTE 10                    */ 07851400
*       5 *       BIT(2),         /*  RESERVED                       */ 07901400
*       5 VMNTRE  BIT(1),         /*  IEAVMNTR WAS ENTERED VIA IEE4603D 07951400
*                                                                    */ 08001400
*       5 VMNTRA  BIT(1),         /*  IEAVMNTR IS ACTIVE             */ 08051400
*       5 *       BIT(2),         /*  RESERVED                       */ 08101400
*       5 VVMIFE  BIT(1),         /*  IEEMIFSV WAS ENTERED       @L3A*/ 08151400
*       5 VVMIFA  BIT(1);         /*  IEEMIFSV IS ACTIVE         @L3A*/ 08201400
