*        %GOTO SETL1;               /* BILINGUAL MAPPING                00050000
         MACRO                                                          00100000
         IEEZB818   ,               */                                  00150000
*%SETL1: ;                                                              00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MACRO NAME = IEEZB818                                            */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE                                                      */ 00450000
*/*      NAME  = SET COMMAND KEYWORD TABLE MAPPING                   */ 00500000
*/*                                                                  */ 00550000
*/*01* PROPRIETARY STATEMENT=                                        */ 00722900
*/***PROPRIETARY_STATEMENT********************************************/ 00736200
*/*                                                                  */ 00750000
*/*                                                                  */ 00760000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00770000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00780000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1986, 1999                      */ 00795000
*/*                                                                  */ 00810000
*/* STATUS= JBB6607                                                  */ 00820000
*/*                                                                  */ 00822500
*/* EXTERNAL CLASSIFICATION: NONE                                    */ 00825000
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00827500
*/*                                                                  */ 00830000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00840000
*/*                                                                  */ 00850000
*/* FUNCTION   = MAPS THE HEADER AND A TABLE ENTRY FOR IEEMB876      */ 00900000
*/*                                                                  */ 01000000
*/* METHOD OF                                                        */ 01050000
*/*    ACCESS  = BAL   - SPECIFY IEEZB818                            */ 01100000
*/*                      USING ON KEYTBHDR MAPS THE IEEMB876 KEYWORD */ 01112500
*/*                      TABLE HEADER.  USING ON KEYTBENT MAPS ONE   */ 01125000
*/*                      ENTRY IN THE IEEMB876 TABLE HEADER.         */ 01137500
*/*              PL/S  - %INCLUDE SYSLIB(IEEZB818)                   */ 01150000
*/*                      DCL (KEYTBPT,KEYEPTR) PTR(31)               */ 01200000
*/*                                                                  */ 01400000
*/* USAGE      = MAP THE SET COMMAND KEYWORD TABLE HEADER AND A      */ 01450000
*/*              SET COMMAND KEYWORD TABLE ENTRY IN IEEMB876.        */ 01500000
*/*              IEEZB818 IS USED BY IEEMB811 AND IEE0603D.          */ 01525000
*/*                                                                  */ 01550000
*/* DEPENDENCIES = When the format of an entry is changed or     @L3A*/ 01560000
*/*              when a new entry is added, IEEMB876 must also   @L3A*/ 01570000
*/*              be updated.                                     @L3A*/ 01580000
*/*              = The number of entries resides in IEEMB876     @L5A*/ 01585000
*/*                                                                  */ 01590000
*/* CREATED BY = N/A                                                 */ 01600000
*/*                                                                  */ 01650000
*/* POINTED TO BY = N/A                                              */ 01700000
*/*                                                                  */ 01750000
*/* SERIALIZATION = NONE                                             */ 01800000
*/*                                                                  */ 01850000
*/* LOCATION   = IEEMB876 STORAGE                                    */ 01900000
*/*                                                                  */ 01950000
*/* CHANGE ACTIVITY =                                                */ 02200000
*/*    $L0=COEXSET,  JBB2220, 840622, PDP8: JES3/MCS COEXISTENCE     */ 02250000
*/*    $L1=SMSSTG2,  JBB2223, 860404, PDFB: STORAGE MANAGEMENT       */ 02262500
*/*                                         SUBSYSTEM STAGEII SUPPORT*/ 02275000
*/*    $L2=IOSRAS,   HBB3310, 860219, PDV1: SET IOS COMMAND SUPPORT  */ 02287500
*/*    $D1=DCR221,   HBB3310, 870330, PDV1: SET EXS COMMAND SUPPORT  */ 02293700
*/*    $L3=DRNL,     HBB4410, 890410, PDHL: GRSRNL Support           */ 02294900
*/*    $L4=MMSFBT,   HBB4410, 890515, PDBT: MVS Message Service      */ 02296600
*/*    $L5=DRNL,     HBB4410, 890626, PDAD: GRSRNL Support           */ 02297700
*/*    $L6=APPC13AD, HBB4420, 890602, PDAD: APPC Support.            */ 02298800
*/*    $P2=PWA0053,  JBB6607 980128,  PDZH: CHANGED DISTLIB TO       */ 02315800
*/*                                         AMODGEN                  */ 02332900
*/********************************************************************/ 02350000
*%GOTO SETL2;                         /*                                02351200
**********************************************************************  02352400
*                                                                    *  02353600
*      SET KEYWORD TABLE HEADER                                      *  02354800
*                                                                    *  02356000
**********************************************************************  02357200
         SPACE 1                                                        02358400
KEYTBHDR DSECT                         IEEMB876 SET KEYWORD TABLE      X02359200
                                       HEADER                           02360000
KEYTBACR DS    CL8                     SET KEYWORD TABLE NAME -        X02360800
                                       "IEEMB876"                       02362000
KEYTBVRS DS    FL1                     VERSION LEVEL FOR IEEMB876       02363200
KEYTBNUM DS    FL1                     NUMBER OF ENTRIES IN THE        X02363500
                                       KEYWORD TABLE                    02363800
KEYTBR1  DS    CL2                     RESERVED                         02364100
KEYTBEPT DS    A                       POINTER TO THE FIRST ENTRY IN   X02364400
                                       THE KEYWORD TABLE                02365600
KEYTBR2  DS    CL4                     RESERVED                         02368000
         SPACE 1                                                        02370400
**********************************************************************  02371600
*                                                                    *  02372800
*      SET KEYWORD TABLE ENTRY                                       *  02374000
*                                                                    *  02375200
**********************************************************************  02376400
         SPACE 1                                                        02377000
KEYTBENT DSECT                         KEYWORD TABLE ENTRY              02377600
KEYDLM   DS    FL1                     PARAMETER DELIMITER (HOW MANY   X02380000
                                       CHARACTERS FOLLOW THE EQUALS    X02381200
                                       SIGN)                            02382400
KEYLEN   DS    FL1                     LENGTH OF KEYWORD MINUS ONE      02383000
KEYWRD   DS    CL9                     SET COMMAND KEYWORD              02383600
KEYIND   DS    FL1                     INDEX INTO SUBROUTINE BRANCH    X02384800
                                       TABLE WITHIN IEE0603D            02386000
KEYMSK   DS    BL8                     MASK TO INDICATE WHICH KEYWORD  X02386400
                                       THIS IS                          02386800
KEYEP    DS    CL8                     ENTRY POINT NAME OF KEYWORD     X02387200
                                       PROCESSOR                        02388400
KEYPRM   DS    CL6                     SYS1.PARMLIB MEMBER NAME PREFIX  02389600
KEYFLG   DS    0BL2                    KEYWORD FLAGS                    02390400
KEYFLG1  DS    B                       FIRST BYTE OF KEYWORD FLAGS      02391200
KEYPRC   EQU   X'80'                   IEEMB811 IS TO PROCESS THIS     X02392000
                                       KEYWORD                          02393200
KEYINSTL EQU   X'40'                   SET SMS COMMAND IS TO BE        X02393400
                                       PROCESSED                   @L1A 02393600
KEYMOP   EQU   X'20'                   Multi-operands allowed with     X02393700
                                       this keyword                @L3A 02393800
KEYLIST  EQU   X'10'                   L option allowed with this      X02393900
                                       keyword                     @L3A 02394000
KEYFLG2  DS    B                       SECOND BYTE OF KEYWORD FLAGS     02394100
KEYRV1   DS    CL4                     RESERVED                         02394400
KEYTELEN EQU   *-KEYTBENT              LENGTH OF A KEYWORD TABLE ENTRY  02395600
         MEND  ,                    */                                  02398200
*%SETL2: ;                                                              02398400
*@EJECT;                                                                02400000
*/********************************************************************/ 02438200
*/*                                                                  */ 02476400
*/*    SET KEYWORD TABLE HEADER                                      */ 02514600
*/*                                                                  */ 02552800
*/********************************************************************/ 02591000
*DCL 1 KEYTBHDR BASED(KEYTBPT),          /* IEEMB876 SET KEYWORD        02629200
*                                           TABLE HEADER             */ 02667400
*        3 KEYTBACR CHAR(8),             /* SET KEYWORD TABLE           02705600
*                                           NAME - "IEEMB876"        */ 02743800
*        3 KEYTBVRS FIXED(8),            /* VERSION LEVEL FOR           02782000
*                                           IEEMB876                 */ 02820200
*        3 KEYTBNUM FIXED(8),            /* NUMBER OF ENTRIES IN THE    02829700
*                                           KEYWORD TABLE            */ 02839200
*        3 KEYTBR1  CHAR(2),             /* RESERVED                 */ 02848700
*        3 KEYTBEPT PTR(31),             /* POINTER TO THE FIRST        02858400
*                                           ENTRY IN THE KEYWORD        02896600
*                                           TABLE                    */ 02934800
*        3 KEYTBR2 CHAR(4);              /* RESERVED                 */ 02984800
*@SPACE(2);                                                             03068500
*/********************************************************************/ 03087600
*/*                                                                  */ 03125800
*/*    SET KEYWORD TABLE ENTRY                                       */ 03164000
*/*                                                                  */ 03202200
*/********************************************************************/ 03240400
*DCL 1 KEYTBENT(*) BASED(KEYEPTR),       /* KEYWORD TABLE ENTRY         03290400
*                                           MAPPING                  */ 03355000
*        3 KEYDLM FIXED(8),              /* PARAMETER DELIMITER (HOW    03469600
*                                           MANY CHARACTERS FOLLOW      03507800
*                                           THE EQUAL SIGN)          */ 03546000
*        3 KEYLEN FIXED(8),              /* LENGTH OF KEYWORD MINUS     03558700
*                                           ONE                      */ 03571400
*        3 KEYWRD CHAR(9),               /* SET COMMAND KEYWORD      */ 03584200
*        3 KEYIND FIXED(8),              /* INDEX INTO SUBROUTINE       03622400
*                                           BRANCH TABLE WITHIN         03660600
*                                           IEE0603D                 */ 03700000
*        3 KEYMSK BIT(64),               /* MASK TO INDICATE WHICH      03716600
*                                           KEYWORD THIS IS          */ 03733200
*        3 KEYEP  CHAR(8),               /* ENTRY POINT NAME OF         03750000
*                                           KEYWORD PROCESSOR        */ 03800000
*        3 KEYPRM CHAR(6),               /* SYS1.PARMLIB MEMBER         03850000
*                                           NAME PREFIX              */ 03900000
*        3 KEYFLG  BIT(16),              /* FLAGS                    */ 03950000
*          5 KEYFLG1  BIT(8),            /* First byte of keyword       03964200
*                                           flags                @L3C*/ 03978400
*            7 KEYPRC BIT(1),            /* IEEMB811 is to process      03992600
*                                           this keyword         @L3C*/ 04006800
*            7 KEYINSTL BIT(1),          /* SET SMS command is to be    04021000
*                                           processed            @L1A*/ 04035200
*            7 KEYMOP  BIT(1),           /* Multi-operands allowed      04049400
*                                           with this keyword    @L3A*/ 04063600
*            7 KEYLIST BIT(1),           /* L option allowed            04077800
*                                           with this keyword    @L3A*/ 04092000
*            7 *   BIT(4),               /* Reserved             @L3A*/ 04106200
*          5 KEYFLG2  BIT(8),            /* Second byte of keyword      04120400
*                                           flags. Reserved.     @L3C*/ 04134600
*        3 KEYRV1 CHAR(4);               /* RESERVED                 */ 04150000
