* % GOTO LCTPROLG;  /*                                         @G743P2E 00300000
         MACRO                                                          00600001
         IEFALLCT                                                       00900001
         SPACE 1                                                        00917400
*                                                                    */ 00934800
*%LCTPROLG: ;                                                           00952200
*/* START OF SPECIFICATIONS ******************************************/ 00960900
*/*01* PROPRIETARY STATEMENT=                                        */ 00978300
*/***PROPRIETARY_STATEMENT********************************************/ 00981200
*/*                                                                  */ 00984100
*/*                                                                  */ 00987000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01167800
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01179100
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1988, 1993                      */ 01190400
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 01201700
*/*                                                                  */ 01213200
*/* STATUS= HBB5510                                                  */ 01216100
*/*                                                                  */ 01219000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01221900
*/*                                                              @P6C*/ 01224800
*/*01* DESCRIPTIVE NAME:  Linkage Control Table                      */ 01232500
*/*02*  ACRONYM:  LCT                                                */ 01240200
*/*                                                                  */ 01248000
*/*01* MACRO NAME:  IEFALLCT                                     @L2C*/ 01250400
*/*                                                                  */ 01252800
*/*01* DSECT NAME:  None provided                                    */ 01255200
*/*                                                                  */ 01257600
*/*01* COMPONENT:  Initiator (SC1B6)                                 */ 01260000
*/*                                                                  */ 01262400
*/*01* EYE-CATCHER:  None                                            */ 01264800
*/*                                                                  */ 01267200
*/*01* STORAGE ATTRIBUTES:                                           */ 01269600
*/*02*  SUBPOOL:  236, 237, or 241, as indicated by the JSCBSWSP     */ 01272000
*/*     field of the JSCB pointed to by the jobstep TCB              */ 01274400
*/*02*  KEY:  Key 1                                                  */ 01276800
*/*02*  RESIDENCY:  Below 16 MB in virtual storage                   */ 01279200
*/*                                                                  */ 01281600
*/*01* SIZE:  512 bytes                                              */ 01284000
*/*                                                                  */ 01286400
*/*01* CREATED BY:                                                   */ 01288800
*/*     IEFSD160                                                     */ 01291200
*/*                                                                  */ 01293600
*/*01* POINTED TO BY:                                                */ 01296000
*/*     SSJSLCT field of the SSJS data area                          */ 01297500
*/*                                                                  */ 01299000
*/*01* POINTED TO BY (IBM use only):                             @P6A*/ 01300500
*/*   - The LCT is also pointed to by the IEFLCTAD field of the  @P6M*/ 01302000
*/*     PARAM data area.                                         @P6M*/ 01303500
*/*   - Within the initiator, usually register 1 points to the   @P6M*/ 01305000
*/*     LCT on entry to the modules.                             @P6M*/ 01306500
*/*                                                                  */ 01308000
*/*01* SERIALIZATION:                                                */ 01310400
*/*      Overall there is no serialization of the LCT, it is         */ 01312800
*/*      expected to be addressable by 1 task at a time.             */ 01315200
*/*                                                                  */ 01317600
*/*01* FUNCTION:                                                     */ 01320000
*/*02* Communications area used by the initiator routines.           */ 01322400
*/*                                                                  */ 01323000
*/*01* EXTERNAL CLASSIFICATION:  DMTI                            @P6A*/ 01323600
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P6A*/ 01324200
*/*                                                                  */ 01324800
*/*01* METHOD OF ACCESS:                                             */ 01327200
*/*      Specify LIST=YES for listing, etc.                          */ 01329600
*/*02*  ASM:         - IEFALLCT                                  @L2C*/ 01332000
*/*02*  PL/AS:       - DCL LCTPTR PTR(31)                        @L2A*/ 01334400
*/*                         OR                                   @L9A*/ 01339300
*/*                  - %DCL LCTATTR CHAR                         @L9A*/ 01343600
*/*                  - %LCTATTR = 'BASED' OR 'BDY(WORD)'         @L9A*/ 01347900
*/*                  - %INCLUDE SYSLIB(IEFALLCT)                 @L2C*/ 01352400
*/*                                                                  */ 01369800
*/*01* DELETED BY:                                                   */ 01382100
*/*     IEFSD160                                                     */ 01386200
*/*                                                                  */ 01390300
*/*01* FREQUENCY:                                                    */ 01394400
*/*        One LCT for each instance of the initiator.               */ 01398500
*/*                                                                  */ 01402600
*/*01* NOTES:                                                        */ 01404600
*/*                                                                  */ 01406600
*/*02*   DEPENDENCIES:                                               */ 01408600
*/*          IEFSD160 assumes that this macro is no longer than      */ 01410800
*/*          512 bytes.                                              */ 01414900
*/*                                                                  */ 01419000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 01423100
*/*                                                                  */ 01427200
*/*01* CHANGE ACTIVITY: Y02652, Y02669, G743P2E, OZ20168, OZ30173,   */ 01431300
*/*                     OZ33389, G81LP2K, L2, G860PB2, OZ48696,      */ 01435400
*/*                     PCC1264, PCC2477, P1, D1, H1, OZ68215,       */ 01439500
*/*                     P2, H2, D2, L3, OZ93790, OZ97908, OY18106,   */ 01443600
*/*                     OY23999, L5, L6, L7, L8, L9, LA, P3, D3  @D3C*/ 01447700
*/*                     OY26208, P4, 01                          @01C*/ 01451800
*/*The above section of the Change Activity is no longer updated @02A*/ 01460100
*/*                                                                  */ 01468400
*/* $L2=ALLOCPER JBB1326 801001 PD2M: ALLOCATION PERFORMANCE     @L2A*/ 01474200
*/* $P1=PAB0090  JBB2110 821008 PD2N: ERROR IN INITIATOR RETRY   @P1A*/ 01491600
*/* $D1=DCR120   JBB2110 821008 PD2N: SUPPORT OF UNAUTHORIZED    @D1A*/ 01509000
*/*                                   LIBRARIES IN THE LNKLST    @D1A*/ 01526400
*/* $H1=ADVPROC2 JBB2133 831228 PDC6: AXP                        @H1A*/ 01543800
*/* $P2=PAE0172  JBB2133 840716 PDC6: CLEAR ASCB TIMING FIELDS   @P2A*/ 01561200
*/*                                   IF TIMING ERROR OCCURS IN  @P2A*/ 01578600
*/*                                   INITIATOR                  @P2A*/ 01596000
*/* $H2=VF       JBB2214 840604 PDM7: VF TIMING SUPPORT          @H2A*/ 01613400
*/* $D2=DCR2     JBB2214 840604 PDM7: VF AFFINITY TIMING SUPPORT @D2A*/ 01630800
*/* $L3=IOGEN    JBB2220 840813 PDC6: SUPPORT FOR IOGEN          @L3A*/ 01648200
*/*                                   RESTRUCTURE                @L3A*/ 01665600
*/* $L5=SERVC    HBB4410 880111 PDKK: >1440 TIME= SUPPORT        @L5A*/ 01670500
*/* $L6=SERVC    HBB4410 880111 PDB2: INITIATOR FOOTPRINTING     @L6A*/ 01675400
*/* $L7=SERVC    HBB4410 880420 PDB2: INITIATOR FOOTPRINTING     @L7A*/ 01680300
*/* $L8=SERVC    HBB4410 880420 PDKK: REMOVE AXP SUPPORT         @L8A*/ 01685200
*/* $L9=EMVS2    HBB4410 890213 PDB2: ENTERPRISE/MVS II          @L9A*/ 01690100
*/* $LA=APPC1    HBB4420 890310 PDT4: TRANSACTION INITIATOR      @LAA*/ 01691300
*/* $P3=PEO2597  HBB4410 900105 PDDZ: LCTENTR/LCTIELP CLEANUP    @P3A*/ 01692500
*/* $D3=DP30037  HBB4420 900122 PDCC: Catastrophic JES Error     @D3A*/ 01693300
*/* $D3=DP30037  HBB4420 900122 PDCC: SHOWHDR format complete    @D3A*/ 01694100
*/* $P4=PH31312  HBB4420 900905 PDH1: Creation of LCTPARAM field @P4A*/ 01694500
*/* $01=OY48798  HBB4410 911101 PDCC: Tell Allocation about NDSI @01A*/ 01694600
*/* $02=OY49266  HBB4410 911125 PDCC: Job Time > 1440            @02A*/ 01694700
*/* $LB=POSIX    HBB4430 920106 PDBG: OPEN/MVS Support           @LBA*/ 01694800
*/* $P5=PKB1239  HBB4430 920318 PDCC: Define LCTPRSCT            @P5A*/ 01694900
*/* $D4=DCR0142  HBB4430 920729 PDCC: 10X Defect Elimination     @D4A*/ 01696700
*/* $P6=PIG1423  HBB5510 930715 PDDZ: SHOWHDR Compliance         @P6A*/ 01697600
*/* $03=OW00929  HBB4420 931223 PDH1: CANCEL Processed           @03A*/ 01698000
*/*                                                                  */ 01698500
*/* End of Specifications ********************************************/ 01700400
*/*            C - VS2 SU16 PTF                              @ZA20168*/ 01717800
*/*            C - MERGE SU4,10,16 BACK TO BASE PTF          @ZA30173*/ 01735200
*/*            C - RESHIPMENT OF UZ17119                     @ZA33389*/ 01752600
*/*            C - DEFINE FIELDS TO MAINTAIN ADDRESSES OF THE    @L2A*/ 01770000
*/*                DATA SET ASSOCIATION BLOCK (DSAB) QUEUE       @L2A*/ 01787400
*/*                DESCRIPTOR BLOCK (QDB) AND TASK INPUT/OUTPUT  @L2A*/ 01804800
*/*                TABLE (TIOT) ACROSS THE JOB                   @L2A*/ 01822200
*/*            C - LCTDATA1 THRU LCTDATA4 DEFINED AS         @G860PB2*/ 01839600
*/*                MULTIPLE USE FIELDS USING PREVIOUSLY      @G860PB2*/ 01857000
*/*                RESERVED FIELDS AFTER LCTJSCB             @G860PB2*/ 01874400
*/*            C - ADDED 8 CHAR JES3 JOB CLASS               @ZA48696*/ 01891800
*/*                AND NEW FIELD FOR SMF APAR OZ48672        @ZA48696*/ 01909200
*/*            C - CORRECTED STATUS LINE TO HBB2102          @ZMC1264*/ 01926600
*/*            C - CORRECTED COPYRIGHT NUMBER TO 5740-XC6    @ZMC2477*/ 01944000
*/*            A - ADDED FLAG LCTJSRGN IN LCTINTS2 TO INDICATE   @P1A*/ 01961400
*/*                THAT A REGION WAS SUCCESSFULLY OBTAINED FOR   @P1A*/ 01978800
*/*                THE JOB STEP.  THIS INDICATOR IS NEEDED TO    @P1A*/ 01996200
*/*                INFORM IEFIB621 WHETHER A DEFAULT REGION MUST @P1A*/ 02013600
*/*                BE OBTAINED FOR RETRY PROCESSING.             @P1A*/ 02031000
*/*            A - ADDED FLAG LCTSPREM IN LCTINTS2 TO INDICATE   @D1A*/ 02048400
*/*                THAT SPECIAL PROPERTIES WERE ASSIGNED BUT     @D1A*/ 02065800
*/*                THEN REMOVED BECAUSE THE JOBLIB OR STEPLIB    @D1A*/ 02083200
*/*                WAS NOT AUTHORIZED.                           @D1A*/ 02100600
*/*            A - ADDED TCB AND SRB FIELDS FOR CP AND AXP TIME  @H1A*/ 02118000
*/*            A - ADDED JCTX SWA BLOCK ADDRESS                  @H1A*/ 02135400
*/*            A - DEFINE BIT LCTTIMAB TO SUPPORT OZ60241    @ZA68215*/ 02152800
*/*            A - DEFINE BIT LCTTIMNG IN LCTQENTY TO INDICATE   @P2A*/ 02170200
*/*                WHETHER A ERROR OCCURED IN IEFSD263 WHILE     @P2A*/ 02187600
*/*                PERFORMING TIMING CALCULATIONS                @P2A*/ 02205000
*/*            A - ADDED VF USAGE TIME FIELD - LCTTVFUT          @H2A*/ 02222400
*/*            A - ADDED VF AFFINITY TIME FIELD - LCTTVFAT       @D2A*/ 02239800
*/*            C - CHANGED LCTENTR AND LCTJSCB TO HAVE FIELD     @L3A*/ 02257200
*/*                NAMES FOR THE ADDRESS OF THE IEL AND JSCB     @L3A*/ 02274600
*/*                SO AMODE(31) INITIATOR ROUTINES CAN           @L3A*/ 02292000
*/*                REFERENCE THEM                                @L3A*/ 02309400
*/*            A - DEFINE BIT LCTRFBND TO INDICATE NON-      @ZA93790*/ 02326800
*/*                DEFERRED RESTART TO SUPPORT SMF OZ92038   @ZA93790*/ 02344200
*/*                THIS IS FOR EXCLUSIVE USE OF SMF          @ZA93790*/ 02361600
*/*            C - MOVED THE FIELDS IN LCTRDER, LCTNSYS,     @ZA97908*/ 02365900
*/*                LCTJNLF, AND LCTALERR SO THAT LCTJSCB     @ZA97908*/ 02370200
*/*                COULD BE USED AS A 31 BIT ADDRESS         @ZA97908*/ 02374500
*/*            A - DEFINE WORD LCTACEE TO HOLD ACEE POINTER  @YA18106*/ 02376700
*/*            A - DEFINE BIT LCTRSTST TO INDICATE THE FIRST @YA23999*/ 02377400
*/*                STEP OF A RESTART (SUPPORT FOR OY23932)   @YA23999*/ 02378100
*/*            A - ADDED LCTSCTXB                                @L5A*/ 02378200
*/*            A - ADDED LCTFPNT (PTR TO INITIATOR FOOTPRINT)    @L6A*/ 02378300
*/*            D - REMOVE ALL AXP FIELDS - LCTSTIME,LCTTCPT,         */ 02378400
*/*                LCTTAXT,LCTSCPT,LCTSAXT                       @L8A*/ 02378500
*/*            A - ADDED LCTATTR MACRO VARIABLE FOR CONTROL      @L9A*/ 02378600
*/*                OF LCT BASING ATTRIBUTE                       @L9A*/ 02378700
*/*            A - ADDED LCTGTWRK, LCTRTWRK, LCTSCHNM            @LAA*/ 02380900
*/*            A - Defined bit LCTTIMDN to indicate to       @YA26208*/ 02383100
*/*                IEFIB621 that IEFSD263 completed the      @YA26208*/ 02387300
*/*                timing functions.                         @YA26208*/ 02391500
*/*            C - CHANGED LCTENTR BAL DEFINITIONS SO LCTIELP    @P3A*/ 02392500
*/*                STARTS AT CORRECT OFFSET (LCTENTR + 1).       @P3A*/ 02393500
*/*            A - ADDED LCTJESCE - Catastrophic JES Error       @D3A*/ 02394500
*/* A - Added LCTPARAM field - to contain the address of the     @P4A*/ 02394800
*/*     Termination Parameter List.                              @P4A*/ 02395100
*/* D - Removed LCTNDSI - the value is now in the SCT (SCTNDSI)  @01A*/ 02395300
*/* A - Added LCTNOTIM - This step must not be timed (TIME=1440) @02A*/ 02395400
*/* A - Moved LCTTMBYT to a previously reserved area             @02A*/ 02395500
*/* D - Deleted the following obsolete fields:                   @LBA*/ 02395600
*/*     LCTCMCBA LCTNSPAD LCTSTIND LCTJFCBH LCTS2PEM LCTS2COP    @LBA*/ 02395900
*/*     LCTS2FES LCTSNUMB LCTACTON LCTSMBAD LCTREGSV LCTQMPAM    @LBA*/ 02396300
*/*     LCTCOREA LCTBATMN LCTRTRN  LCTSREG  LCTMINRG LCTIDENT    @LBA*/ 02396700
*/*     LCTPIB   LCTSPIL  LCTDSBCT LCTALCFG LCTODSFL LCTMSGWT    @LBA*/ 02397100
*/*     LCTRDER  LCTJNLF  LCTDWFF  LCTSTATA LCTSUSPD LCTSNOWK    @LBA*/ 02397500
*/*     LCTBTJOB LCTNECBL LCTJCPIB LCTNOSDP LCTNOGCB LCTCPART    @LBA*/ 02397900
*/*     LCTSTATB LCTECBPB LCTNOREG LCTNOATC LCTWRITE LCTNREAD    @LBA*/ 02398300
*/*     LCTSBPOL LCTNPKEY LCTMFTIO LCTLBWAP LCTIMSG              @LBA*/ 02398700
*/* A - Created LCTPRSCT to point to the previous SCT executed   @P5A*/ 02398900
*/* A - Created LCTINRES to indicate that the Initiator will be  @D4A*/ 02399000
*/*     automatically restarted if it terminates. The value of   @D4A*/ 02399100
*/*     IEL bit IELINRES is propagated to LCTINRES by IEFSD160.  @D4A*/ 02399200
*/* C - Updated the prolog to be SHOWHDR compliant               @P6A*/ 02399300
*/* A - Added LCTCANCL to show that a CANCEL is being processed  @03A*/ 02399400
*/********************************************************************/ 02399500
* %GOTO LCTBSL;   /*                                                    02399600
         DS    0F                                                       02400001
LCTQDRTY DS    CL4 -                   POINTER TO JOB CSCB       Y02652 02450000
*  LCTSRTAD HAS BEEN DELETED IT CAN BE OBTAINED FROM CVTDCQ             02500000
LCTSAVEA DS    A                       ADDRESS OF THE IEFSD161 SAVE     02550000
*                                      AREA USED FOR CALLS TO IEFSD101, 02600000
*                                      AND IEFSD164                @LAC 02650000
LCTTCBAD DS    CL4 -                   CURRENT TCB ADDRESS       Y02652 04250000
LCTQENTY DS    CL4 -                                                    04300000
LCTTIMAB EQU   X'80' -                 BIT 0 - TIMER ABEND HAS @ZA68215 04350000
*                                      OCCURRED.               @ZA68215 04400000
*                                      BIT 1 OF HIGH ORDER BYTE USED    04450000
*                                      IN CONJUNCTION WITH 'NOSEP'.     05100001
*                                      BIT 2 - DEVICE WAIT RECOVERY     05400001
*                                      BIT 3 - SPACE WAIT RECOVERY      05700001
LCTTIMNG EQU   X'08' -                 BIT 4 - ERROR HAS OCCURED   @P2A 05750000
*                                      DURING INITIATOR TIMING     @P2A 05800000
*                                      CALCULATIONS                @P2A 05850000
LCTTIMDN EQU   X'04' -                 Bit 5 - indicates to IEFIB621    05887500
*                                      that IEFSD263 completed the      05925000
*                                      timing calculations.    @YA26208 05962500
LCTNOTIM EQU   X'02'                   Do not time this step, since     05975000
*                                      TIME=1440 was specified.    @02A 05987500
LCTERRM  EQU   1 -                     BIT 7 - JOB TERMINATION STATUS   06000001
*                                      THREE LOW ORDER BYTES CONTAIN    06300000
*                                      THE ADDRESS OF THE REGISTER      06600000
*                                      SAVE AREA OF LINKER              06900000
LCTJCTAD DS    CL4 -                   JCT STORAGE ADDRESS OR 0         07200000
LCTSCTAD DS    CL4 -                   SCT STORAGE ADDRESS OR 0  Y02669 07500000
LCTWORKA EQU   * -                     MINSYS 3 TEMP INSERT             07550001
LCTSCTDA DS    0F -                    SCT SWA ADDRESS           Y02669 07600000
LCTSCTVA DS    CL3 -                   SCT SWA VIRTUAL ADDRESS   Y02669 07650000
         DS    CL1 -                   RESERVED                    @LAC 07700000
* LCTPSPAR HAS BEEN DELETED USE CVTQMWR                                 07750000
LCTSCHNM DS    CL4 -                   SCHEDULER NAME              @LAC 07800000
LCTERR   DS    0C -                    LCTERR bits initialized by       07850000
*                                      Batch Allocation          Y02670 07900000
LCTJFAIL EQU   X'80' -                 IF ON, JOB FAILED         Y02670 08735200
LCTSALCD EQU   X'40' -                 IF ON, AT LEAST ONE STEP         08752800
*                                      WAS ALLOCATED             Y02670 08770400
LCTPALCD EQU   X'20' -                 IF ON, THIS STEP                 08788000
*                                      PARTIALLY ALLOCATED       Y02670 08805600
LCTSFAIL EQU   X'10' -                 IF ON, STEP BYPASSED      Y02670 08823200
LCTACOMP EQU   X'08' -                 IF ON ALLOCATION HAS     YM07219 08840800
*                                      BEEN COMPLETED BUT       YM07219 08858400
*                                      UNALLOCATION IS YET TO   YM07219 08876000
*                                      RUN. USED TO TEST FOR    YM07219 08893600
*                                      RETRY IN THE INIT ESTAE  YM07219 08911200
LCTJCFAL EQU   X'04' -                 ON IF JOB FAILED        @Z30CPPH 08928800
*                                      BECAUSE OF COND CODES   @Z30CPPH 08946400
LCTVTERM EQU   X'02' -                 ON IF ALLOC FAILED AND  @G24LPSJ 08964000
*                                      MSS SELECTS DONE        @G24LPSJ 08981600
LCTCANCL EQU   X'01' -                 On if a CANCEL command      @03A 08987700
*                                      is being processed          @03A 08993800
LCTERROR DS    CL4 -                   ERROR CODE                       09000001
LCTPARM1 DS    CL4 -                   MULTI USE PARAMETER FIELD        09300001
LCTPARM2 DS    CL4 -                   MULTI USE PARAMETER FIELD        09600001
LCTPARM3 DS    CL4 -                   MULTI USE PARAMETER FIELD        09900001
LCTPARM4 DS    CL4 -                   MULTI USE PARAMETER FIELD        10200001
         DS    CL16                    Reserved area               @LBC 10250000
*                                                                22@LBD 10300000
LCTCOMCD DS    0F -                    WARMSTART ABEND CODE      Y02641 17750000
LCTCOMD1 DS    H -                     WARMSTART COMP. CODE      Y02641 17800000
LCTCOMD2 DS    H -                     WARMSTART COMP. CODE      Y02641 17850000
         DS    1F -                    Reserved                    @LBC 17900000
*                                                                 2@LBD 17950000
LCTINTSW DS    C -                     INITIATOR INTERNAL SWITCHES      19000000
LCTINPPT EQU   128 -                   PGM. NAME IS IN PPT       Y02656 19050000
LCTPRIV  EQU   64 -                    PROGRAM IS PRIVILEGED     Y02655 19100000
LCTPPAA  EQU   32 -                    ISSUE MESSAGE FOR PROBLEM        19150000
*                                      PROG. ATTRIBUTES ASSIGNED Y02655 19200000
*                                                                  @LBD 20100000
LCTSTART EQU   8 -                     TASK NAME NOT FOUND ON COMMAND   20400001
LCTSTOP  EQU   4 -                     INIT INTERNAL STOP               20700001
LCTABEND EQU   2 -                     EXECUTED PGM ABENDED             20750001
*        EQU   1 -                     Reserved                   3@01D 20800000
LCTPUBYT DS    CL1 -                   PREFERRED USAGE FLAGS   @ZA16877 20950000
LCT2LPU  EQU   X'80' -                 2ND LEVEL PREFERRED     @ZA16877 21000000
LCT1LPU  EQU   X'40' -                 1ST LEVEL PREFERRED     @ZA16877 21050000
LCTN2LP  EQU   X'20' -                 NOT 2ND LEVEL PREFERRED @ZA16877 21100000
LCTNSWP  EQU   X'10' -                 NON-SWAPPABLE           @ZA16877 21150000
         DS    CL2 -                   RESERVED                @ZA16877 21200000
LCTTMWRK DS    4F -                    TIMER WORK AREA           Y02669 21250000
         ORG   LCTTMWRK                                          Y02669 21300000
LCTTJTU4 DS    0F -                    TOTAL JOB TIME USED       Y02669 21350000
         DS    C -                     RESERVED                  Y02669 21400000
LCTTJTU3 DS    FL3 -                   TOTAL JOB TIME USED       Y02669 21450000
LCTTSTL4 DS    0F -                    STEP TIME LIMIT           Y02669 21500000
         DS    C -                     RESERVED                  Y02669 21550000
LCTTSTL3 DS    FL3 -                   STEP TIME LIMIT           Y02669 21600000
LCTTSTR4 DS    0F -                    STEP TIME REMAINING       Y02669 21650000
         DS    C -                     RESERVED                    @02C 21700000
LCTTSTR3 DS    FL3 -                   STEP TIME REMAINING       Y02669 21800000
LCTTSTU4 DS    0F -                    STEP TIME USED            Y02669 21850000
         DS    C -                     RESERVED                  Y02669 21900000
LCTTSTU3 DS    FL3 -                   STEP TIME USED            Y02669 21950000
*                                                                 2@LBD 22000000
LCTJOBLB DS   1F -                     ADDRESS OF JOBLIB OR             24000001
*                                      STEPLIB DCB                      24300001
LCTATLST DS   1F -                     ADDRESS OF ALLOCATE-TERMINATE    24600001
*                                      PARAMETER LISTS                  24900001
REGSAVE  DS   36F -                    A/T REG SAVE AREA                25200001
*                                      REGISTER SAVEAREA                25250001
QMGR1    DS   9F -                     QMPA FOR SWA                     25500001
LCTSMFLG DS   1F -                     FOR SMF USE AT JOB TERM @ZA48672 25550000
LCTVFWRK DS   0CL8 -                   VF TIMER WORK AREA          @D2C 25600000
LCTTVFUT DS   1F -                     STEP VF USAGE TIME          @H2A 25650000
LCTTVFAT DS   1F -                     STEP VF AFFINITY TIME       @D2A 25700000
LCTSCTXB DS   A  -                     SCTX BLOCK ADDRESS          @L7C 25720000
LCTACEE  DS   A  -                     ADDR OF RACF ACEE       @YC18106 25740000
LCTPRSCT DS   F  -                     Pointer to prior SCT        @P5C 25746600
LCTGTWRK DS   A  -                     POINTER TO THE GETWORK ROUTINE   25753200
*                                      LOADED BY IEFSD160          @LAC 25759800
LCTRTWRK DS   A  -                     POINTER TO THE RETWORK ROUTINE   25766400
*                                      LOADED BY IEFSD160          @LAC 25773000
LCTFPNT  DS   1F -                     PTR TO INITIATOR FOOTPRINT  @L6A 25780000
LCTASCBA DS   1F -                     POINTER TO CURRENT ASCB   Y02669 25800000
LCTJMRAD DS   A  -                     JMR ADDRESS                 @D4C 25850000
LCTECBAD DS   1F -                     ECB LIST ADDRESS                 27300001
ECBLIST  EQU   LCTECBAD -                                               27350001
*                                      WITH LCTECBAD                    27650001
         DS    CL8                     Reserved                    @LBC 27700000
*                                                                 6@LBD 27750000
LCTCLASS DS    CL8 -                   JES3 JOB CLASS          @ZA48696 28150000
LCTTSRB4 DS    0F -                    STEP SRB TIME USED        Y02669 28200000
         DS    C -                     RESERVED                  Y02669 28250000
LCTTSRB3 DS    FL3 -                   STEP SRB TIME USED        Y02669 28300000
*   THESE FIELDS ARE NEEDED FOR L-SHAPE/INIT MERGE                      30300001
LCTENTR  DS    0F -                    INIT ENTRANCE LIST ADDR     @P3C 30350000
LCTEXIT  EQU   LCTENTR -               INIT EXIT LIST ADDR         @P3M 30400000
         DS    C  -                    Reserved for IEL            @P3C 30450000
LCTIELP  DS    AL3  -                  ADDRESS OF IEL              @P3C 32750000
*                                                                       32800000
LCTOPSW2 DS    C -                     INIT OPTIONS BYTE 2              33600000
*                                      BITS 5, 6 UNUSED                 33650000
LCTTIMEF EQU   128 -                   DO NOT TIME THIS                 33900000
LCTCRF   EQU   64 -                    DISALLOW CKPT/RESTART            34200001
LCTCKRST EQU   32 -                    THIS BIT IS SET BY IEFXB609      34250000
*                                      TO INFORM IEFSD101 TO INSERT     34300000
*                                      PROGRAM NAME IEFRSTRT IN SCT     34350000
*                                      AFTER PPT PROCESSING    @ZA20168 34400000
LCTINRES EQU   8 -                     Initiator is automatically  @D4A 34416600
*                                      restarted after termination @D4A 34433200
LCTBPRAC EQU   4 -                     BYPASS RACINIT          @Z40RPPJ 34450000
LCTNORC  EQU   2 -                     BYPASS ALLOC. RECOVERY    Y02652 34500000
LCTENQU  EQU   1 -                     DO NOT WAIT FOR DATA SETS        34550000
LCTOPSW3 DS    1C -                    INIT OPTION BYTE 3      @ZM97908 34600000
*                                                                 2@LBD 34650000
LCTNSYS  EQU   32 -                    DO NOT ASSIGN SPECIAL   @ZM97908 34750000
*                                      PROPERTIES              @ZM97908 34800000
*                                                                  @LBD 34850000
LCTALERR EQU   4 -                     ALLOC ERROR EXISTED     @ZM97908 34900000
LCTJESCE EQU   1 -                     On if JES had a Catastrophic     34907600
*                                      Error during a Transaction       34915200
*                                      select or Transaction terminate  34922800
*                                      call                        @D3A 34930400
LCTTMBYT DS    B -                     Flag Byte - all bits used   @02M 34935400
LCTTIFJ  EQU   X'80' -                 TIME IS LIMIT FOR JOB       @02M 34940400
LCTOPSW1 DS    C -                     INIT OPTION BYTE 1               34945600
LCTDPSWA EQU   128 -                   DO NOT SET 'DO NOT SHARE SWA'    34953200
*                                      ON ATTACH                 Y02621 34960800
*                                                                 2@LBD 34972200
LCTCANF  EQU   8 -                     ALLOW CANCEL ONLY AT ALLOC       34983600
LCTONEJF EQU   4 -                     STARTED TASK INDICATOR           34991200
LCTJSCB  DS    0F -                    ADDRESS OF JSCB         @ZC97908 35000000
         DS    1C -                    RESERVED AS PART OF JSCB    @P3C 35033300
*                                      ADDRESS                     @P3A 35066600
LCTJSCBP DS    AL3 -                   ADDRESS OF JSCB 24 BIT  @ZA97908 35100000
LCTDATA1 DS    F -                     MULTI-USE DATA FIELD    @G860PB2 36010500
LCTDATA2 DS    F -                     MULTI-USE DATA FIELD    @G860PB2 36011000
LCTDATA3 DS    C -                     MULTI-USE DATA FIELD    @G860PB2 36011500
LCTDATA4 DS    C -                     MULTI-USE DATA FIELD    @G860PB2 36012000
         DS    2C -                    RESERVED                @G860PB2 36012500
LCTPARAM DS    1F                      Address of the termination  @P4A 36013100
*                                      parameter list              @P4A 36013700
         DS    3F                      RESERVED                    @P4C 36014300
*                                                                 4@L8D 36015100
LCTJCTXB DS    A  -                    JCTX SWA BLOCK ADDRESS      @D4C 36016500
LCTSYSPL DS    1F -                    ADDRESS OF SYSEVENT     @G743P2E 36017000
*                                      PARAMETER LIST          @G743P2E 36017500
LCTSTEPL DS    1F -                    POINTER TO STAE EXIT PARAMETER   36018000
*                                      LIST FOR INITIATOR        Y02653 36018500
LCTSSOBA DS    1F -                    SSOB FOR THIS TASK        Y02668 36019000
LCTJCTDA DS    0F -                    JCT SWA ADDRESS           Y02652 36019500
LCTJCTVA DS    CL3 -                   JCT SWA VIRTUAL ADDRESS   Y02652 36020000
         DS    C -                     RESERVED                  Y02652 36020500
LCTTIOTI DS    1F -                    INIT TIOT TTR                    36021601
         DS    CL2                     Reserved                    @LBC 36055000
*                                                                17@LBD 36088400
LCTRFB   DS    1C -                    RESTART FUNCTION SWITCHES        36121801
*                                      BIT 7 UNUSED                     36131900
LCTRFBSM EQU   128 -                   CALL IEFXB601                    36138501
LCTRFBCR EQU   64 -                    AUTOMATIC CHKPT. RESTART  Y02641 36148500
LCTRFBRV EQU   32 -                    SPECIAL INTERP PROCESSING        36150501
*                                      DURING WARM START                36150901
LCTRFBDC EQU   16 -                    DEFERRED CKPNT/RESTART           36152501
LCTRFBMS EQU   8 -                     DO NOT MODIFY JSB FIELDS         36153300
LCTRFBEF EQU   4 -                     MERGE TO EOF OF JOURNAL          36154100
LCTRFBRP EQU   2 -                     CALL IEFPREP                     36155001
LCTRFBND EQU   1 -                     NON-DEFERRED RESTART BIT FOR USE 36155400
*                                      BY SMF EXCLUSIVELY.  SET IN      36155800
*                                      RESTART INTERFACE AND TURNED     36156200
*                                      OFF DURING JOB TERMINATION       36156600
*                                                              @ZA93790 36157000
LCTRFB1  DS    1C -                    RESERVED FOR WARMSTART/RESTART   36157400
LCTRSTST EQU   128 -                   FIRST STEP OF RESTART   @YA23999 36157600
LCTTSIZ  DS    1C -                    TO INFORM ALLOCATION OF SIZE     36157800
*                                      OF MASTER SCHED. TIOT     Y02670 36158200
LCTINTS2 DS    B -                     INTERNAL SWITCHES, BYTE 2 Y02652 36158600
*        IT WILL BE CLEARED FOR EVERY STEP BY IEFSD101           Y02652 36159000
LCTSYS   EQU   X'80'                   SYSTEM TASK REQUESTED     Y02652 36159400
LCTBPPAS EQU   X'40'                   BYPASS PASSWD PROTECT.  @ZA03944 36159800
LCTTSWPC EQU   X'20'                   TRANSWAP COMPLETED      @ZA16877 36160200
LCTATTC  EQU   X'10'                   INITATT HAS BEEN ISSUED          36160600
*                                      (RESET AT INITDET TIME) @ZA16877 36161000
LCTJSRGN EQU   X'08'                   A REGION HAS BEEN OBTAINED  @P1A 36161400
*                                      FOR THE JOB STEP            @P1A 36161800
LCTSPREM EQU   X'04'                   SPECIAL PROPERTIES ASSIGNED @D1A 36162200
*                                      BUT THEN REMOVED BECAUSE    @D1A 36162600
*                                      JOBLIB/STEPLIB NOT AUTH     @D1A 36163000
         DS    2C -                    RESERVED                  Y02652 36163400
LCTTIOTP DS    1F -                    ADDR OF TIOT STOR. FOR JOB  @L2C 36163800
         DS    1F -                    Reserved area               @LBC 36165100
         DS    1F -                    Reserved area               @LBC 36165500
LCTDSABQ DS    1F -                    ADDRESS OF DSAB QDB STORAGE @L2C 36166300
*                                      FOR THE JOB                 @L2A 36167100
LCTIWORK DS    CL64 -                  TEMPORARY WORK AREA, TO @Y02BPSR 36167900
*                                      BE USED ONLY BY THE     @Y02BPSR 36168700
*                                      INITIATOR               @Y02BPSR 36169500
LCTLABEL DS    C'ENDOFLCT'             TO HELP IDENTIFY THE    @Y02BPSR 36170300
*                                      LCT IN A STORAGE DUMP   @Y02BPSR 36171100
IEFEND   EQU   * -                     END OF LCT                       36171901
         MEND                                                           37200001
**/      %LCTBSL:;                                          /*  20032*/ 37500001
* %IF LCTATTR = '' %THEN          /*                             @L9A*/ 37550000
*   %LCTATTR = 'BASED(LCTPTR) BDY(WORD)';  /* SET DEFAULT BASING @L9A*/ 37600000
* DECLARE                                                               37800001
* 1 LCT LCTATTR,                  /*                             @L9C*/ 38100000
*   3  LCTQDRTY  PTR(31),         /* Address of the CSCB for the        38150000
*                                    current piece of work           */ 38200000
*      5  *        BIT(8),        /* RESERVED                  Y02652*/ 38450000
*      5  *        PTR(24),       /* ADDRESS OF THE JOB CSCB         */ 38500000
*/*  LCTSRTAD HAS BEEN DELETED THIS CAN BE OBTAINED FROM CVTDCQ      */ 38550000
*   3  LCTSAVEA  PTR(31),         /* POINTER TO THE SAVEAREA FROM       38600000
*                                    IEFSD161 ON ENTRY TO: IEFSD101,    38650000
*                                    IEFSD164                    @LAC*/ 38700000
*   3  LCTTCBAD  PTR(31),                                               40500001
*      5  *        BIT(8),        /* UNUSED                          */ 40800001
*      5  *        PTR(24),       /* CURRENT TCB ADDRESS       Y02652*/ 41100000
*   3  LCTQENTY  PTR(31),                                               41400001
*      5  *        BIT(8),                                              41700001
*         7  LCTTIMAB BIT(1),     /*TIMER ABEND HAS OCCURRED @ZA68215*/ 42000000
*         7  *        BIT(1),     /* USED IN CONJUCTION WITH NOSEP   */ 42300001
*         7  *        BIT(1),     /* DEVICE WAIT RECOVERY            */ 42600001
*         7  *        BIT(1),     /* SPACE  WAIT RECOVERY            */ 42900001
*         7  LCTTIMNG BIT(1),     /* ERROR HAS OCCURED DURING           42950000
*                                    INITIATOR TIMING CALCULATIONS      43000000
*                                                                @P2C*/ 43050000
*         7  LCTTIMDN BIT(1),     /* Indicates to IEFIB621 that         43087500
*                                    IEFSD263 completed the             43125000
*                                    timing calculations.    @YA26208*/ 43162500
*         7  LCTNOTIM BIT(1),     /* Do not time this step, since       43212500
*                                    TIME=1440 was specified.    @02A*/ 43262500
*         7  LCTERRM  BIT(1),     /* JOB TERMINATION STATUS          */ 44100001
*      5  *        PTR(24),       /* SAVE AREA ADDRESS OF LINKER     */ 44150000
*   3  LCTJCTAD  PTR(31),                                               44400001
*      5  *        BIT(8),        /* UNUSED                          */ 44700001
*      5  *        PTR(24),       /* JCT STORAGE ADDRESS OR 0        */ 45000000
*   3  LCTSCTAD  PTR(31),                                               45300001
*      5  *        BIT(8),        /* UNUSED                          */ 45600001
*      5  *        PTR(24),       /* SCT STORAGE ADDRESS OR 0  Y02669*/ 45900000
*   3  LCTSCTDA  PTR(31),         /* SCT SWA ADDRESS                 */ 46200000
*    4  LCTWORKA PTR(31),                                               46250001
*      5 LCTSCTVA PTR(24) BDY(WORD), /* SCT SWA VIRTUAL ADDRESS      */ 46300000
*      5  *       BIT(8),         /* UNUSED                          */ 46500001
*/* LCTPSPAR HAS BEEN DELETED USE CVTQMWR                            */ 46550000
*   3  LCTSCHNM  CHAR(4),         /* SCHEDULER NAME              @LAC*/ 46600000
*   3  LCTERROR  FIXED(31),       /* ERROR CODES                     */ 48300001
*      5 LCTERR   BIT(8),         /* LCTERR bits initialized by         48311700
*                                    Batch Allocation          Y02670*/ 48323400
*        7 LCTJFAIL BIT(1),       /* IF ON, JOB FAILED         Y02670*/ 48335200
*        7 LCTSALCD BIT(1),       /* IF ON, AT LEAST ONE STEP           48352800
*                                    WAS ALLOCATED             Y02670*/ 48370400
*        7 LCTPALCD BIT(1),       /* IF ON, THIS STEP                   48388000
*                                    PARTIALLY ALLOCATED       Y02670*/ 48405600
*        7 LCTSFAIL BIT(1),       /* IF ON, STEP BYPASSED      Y02670*/ 48423200
*        7 LCTACOMP BIT(1),       /* IF ON ALLOCATION HAS BEEN          48440800
*                                    COMPLETED BUT UNALLOCATION         48458400
*                                    IS YET TO RUN.  USED TO TEST       48476000
*                                    FOR RETRY IN THE INIT              48493600
*                                    ESTAE                    YM07219*/ 48511200
*        7 LCTJCFAL BIT(1),       /* ON IF JOB FAILED BECAUSE           48528800
*                                    CONDITION CODES         @Z30CPPH*/ 48546400
*        7 LCTVTERM BIT(1),       /* ON IF ALLOC FAILED AND             48564000
*                                    MSS SELECTS DONE        @G24LPSJ*/ 48581600
*        7 LCTCANCL BIT(1),       /* On if a CANCEL command             48587700
*                                    is being processed          @03A*/ 48593800
*   3  LCTPARM1  FIXED(31),       /* MULTI USE PARAMETER FIELD       */ 48600001
*   3  LCTPARM2  FIXED(31),       /* MULTI USE PARAMETER FIELD       */ 48900001
*   3  LCTPARM3  FIXED(31),       /* MULTI USE PARAMETER FIELD       */ 49200001
*   3  LCTPARM4  FIXED(31),       /* MULTI USE PARAMETER FIELD       */ 49500001
*   3  *         CHAR(16),        /* Reserved                    @LBC*/ 49550000
*                                 /*                           25@LBD*/ 49600000
*   3  LCTCOMCD  PTR(31),         /* WARMSTART ABEND CODE      Y02641*/ 57050000
*      5 LCTCOMD1 PTR(15),        /* WARMSTART COMP. CODE      Y02641*/ 57100000
*      5 LCTCOMD2 PTR(15),        /* WARMSTART COMP. CODE      Y02641*/ 57150000
*   3  *         PTR(31),         /* Reserved                    @LBC*/ 57200000
*                                 /*                            5@LBD*/ 57250000
*   3  *         PTR(31),                                               60000000
*      5  LCTINTSW  BIT(8),       /* INITIATOR INTERNAL SWITCH       */ 60300001
*         7 LCTINPPT BIT(1),      /* PGM. NAME IS IN PPT       Y02656*/ 60350000
*         7 LCTPRIV BIT(1),       /* PROGRAM IS PRIVILEGED     Y02655*/ 60400000
*         7 LCTPPAA BIT(1),       /* ISSUE MESSAGE FOR 'PROBLEM PROG.   60450000
*                                    ATTRIBURES ASSIGNED'      Y02656*/ 60500000
*         7  *        BIT(1),     /* Reserved                    @LBC*/ 61500000
*         7  LCTSTART BIT(1),     /* TASKNAME NOT FOUNND ON             61800001
*                                    COMMAND                         */ 62100001
*         7  LCTSTOP  BIT(1),     /* INITIATOR INTERNAL STOP         */ 62400001
*         7  LCTABEND BIT(1),     /* EXECUTED PGM ABENDED            */ 62700001
*         7  *        BIT(1),     /* Reserved                    @01C*/ 62750000
*                                 /*                            2@01D*/ 62800000
*      5  LCTPUBYT BIT(8),        /* PREFERRED USAGE STORAGE @ZA16877*/ 62860000
*         7  LCT2LPU BIT(1),      /* 2ND LEVEL PREFERRED     @ZA16877*/ 62900000
*         7  LCT1LPU BIT(1),      /* 1ST LEVEL PREFERRED     @ZA16877*/ 62940000
*         7  LCTN2LP BIT(1),      /* NOT 2ND LEVEL PREFERRED @ZA16877*/ 62980000
*         7  LCTNSWP BIT(1),      /* NON-SWAPPABLE           @ZA16877*/ 63020000
*         7  *       BIT(1),      /* UNUSED                  @ZA16877*/ 63060000
*         7  *       BIT(1),      /* UNUSED                  @ZA16877*/ 63100000
*         7  *       BIT(1),      /* UNUSED                  @ZA16877*/ 63140000
*         7  *       BIT(1),      /* UNUSED                  @ZA16877*/ 63180000
*      5  *         CHAR(2),      /* RESERVED                @ZA16877*/ 63220000
*   3  LCTTMWRK  CHAR(16) BDY(WORD), /* TIMER WORK AREA        Y02669*/ 63260000
*    5 LCTTJTU4 FIXED(31),        /* TOTAL JOB TIME USED       Y02669*/ 63300000
*     7 * BIT(8),                 /* RESERVED                  Y02669*/ 63340000
*     7 LCTTJTU3 FIXED(24),       /* TOTAL JOB TIME USED       Y02669*/ 63380000
*    5 LCTTSTL4 FIXED(31),        /* STEP TIME LIMIT           Y02669*/ 63420000
*     7 * BIT(8),                 /* RESERVED                  Y02669*/ 63460000
*     7 LCTTSTL3 FIXED(24),       /* STEP TIME LIMIT           Y02669*/ 63500000
*    5 LCTTSTR4 FIXED(31),        /* STEP TIME REMAINING       Y02669*/ 63540000
*                                 /*                            2@LBD*/ 63590000
*     7 * BIT(8),                 /* Reserved                    @02C*/ 63640000
*     7 LCTTSTR3 FIXED(24),       /* STEP TIME REMAINING       Y02669*/ 63740000
*    5 LCTTSTU4 FIXED(31),        /* STEP TIME USED            Y02669*/ 63780000
*     7 * BIT(8),                 /* RESERVED                  Y02669*/ 63820000
*     7 LCTTSTU3 FIXED(24),       /* Step time used            Y02669*/ 63860000
*   3  LCTJOBLB  PTR(31),                                               63900001
*      5  *         BIT(8),       /* UNUSED                          */ 64200001
*      5  *         PTR(24),      /* POINTER TO JOBLIB OR               64500001
*                                    STEPLIB DCB                     */ 64800001
*   3  LCTATLST  PTR(31),                                               65100001
*      5  *         BIT(8),       /* UNUSED                          */ 65400001
*      5  *         PTR(24),      /* ADDRESS OF ALLOCATE/TERMINATE      65700001
*                                    PARAMETER LIST                  */ 66000001
*   3  REGSAVE  (36)FIXED(31),    /* ALLOC/TERM REGISTER                66300001
*                                    SAVE AREA                       */ 66600001
*   3  QMGR1    (9) FIXED(31),    /* QUEUE MGR PARAMETER AREA        */ 66900001
*   3  LCTSMFLG CHAR(4),          /* FOR SMF USE AT JOB TERM @ZA48672*/ 67200000
*   3  LCTVFWRK BDY(WORD),        /* VF TIMER WORK AREA          @H2A*/ 67250000
*      5  LCTTVFUT FIXED(31),     /* STEP VF USAGE TIME          @H2A*/ 67300000
*      5  LCTTVFAT FIXED(31),     /* STEP VF AFFINITY TIME       @D2A*/ 67350000
*   3  LCTSCTXB PTR(31),          /* SCTX BLOCK ADDRESS          @L7C*/ 67387500
*   3  LCTACEE   PTR(31),         /* ADDR OF RACF ACEE       @YC18106*/ 67425000
*   3  LCTPRSCT PTR(31),          /* Pointer to prior SCT        @P5C*/ 67433300
*   3  LCTGTWRK PTR(31),          /* ADDRESS OF GETWORK ROUTINE         67441600
*                                    LOADED BY IEFSD160          @LAA*/ 67449900
*   3  LCTRTWRK PTR(31),          /* ADDRESS OF RETWORK ROUTINE         67458200
*                                    LOADED BY IEFSD160          @LAA*/ 67466500
*   3  LCTFPNT   PTR(31),         /* PTR TO INITIATOR FOOTPRINT  @L6A*/ 67475000
*   3  LCTASCBA  PTR(31),         /* ADDR OF CURRENT ASCB      Y02669*/ 67500000
*   3  LCTJMRAD  PTR(31),         /* JMR address                 @D4C*/ 67800000
*   3  LCTECBAD  PTR(31),                                               68100001
*     4  ECBLIST PTR(31),                                               68150001
*      5  *        BIT(8),                                              68400001
*      5  *        PTR(24),       /* PTR TO ECB LIST                 */ 68700001
*   3  *        CHAR(8) BDY(WORD), /* Reserved                   @LBC*/ 68750000
*                                 /*                           13@LBD*/ 68800000
*   3  LCTCLASS  CHAR(8) BDY(WORD), /* JES3 JOB CLASS        @ZA48696*/ 69346000
*   3  LCTTSRB4  FIXED(31),       /* STEP SRB TIME USED        Y02669*/ 69396000
*    4  *       BIT(8),           /* RESERVED                  Y02669*/ 69446000
*    4  LCTTSRB3 FIXED(24),       /* STEP SRB TIME USED        Y02669*/ 69496000
*   3  LCTENTR   PTR(31),         /* ADDR OF INIT ENTRANCE LIST      */ 70500001
*    4  LCTEXIT  PTR(31),         /* ADDR OF INIT EXIT LIST          */ 70550001
*      5  *           BIT(8),     /*                             @LAC*/ 70600000
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 73500000
*      5  LCTIELP     PTR(24),    /* ADDRESS OF IEL - USE FOR BASING    73550000
*                                                                @P3C*/ 73600000
*   3  *         PTR(31),         /* RESERVED                  Y02652*/ 74100000
*      5  LCTOPSW2 BIT(8),        /* INITIATOR OPTION BYTE 2         */ 74400001
*         7  LCTTIMEF BIT(1),     /* DO NOT TIME THIS                */ 74450000
*         7  LCTCRF   BIT(1),     /* DO NOT ALLOW CHECK/RESTART      */ 74500000
*         7 LCTCKRST  BIT(1),     /* THIS BIT IS SET BY IEFXB609 TO     74550000
*                                    INFORM IEFSD101 TO INSERT PROGRAM  74600000
*                                    NAME IEFRSTRT IN SCT AFTER         74650000
*                                    PPT PROCESSING          @ZA20168*/ 74700000
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 74750000
*         7  LCTINRES BIT(1),     /* Initiator is automatically         74783300
*                                    restarted after termination @D4A*/ 74816600
*         7  LCTBPRAC BIT(1),     /* BYPASS RACINIT          @Z40RPPJ*/ 74850000
*         7  LCTNORC  BIT(1),     /* BYPASS ALLOC. RECOVERY    Y02652*/ 74900000
*         7  LCTENQU  BIT(1),     /* DO NOT WAIT FOR DATA SETS       */ 74950000
*      5  LCTOPSW3 BIT(8),        /* INITIATOR OPTION BYTE THREE        75000000
*                                                            @ZM97908*/ 75050000
*         7  *        BIT(1),     /* RESERVED                @ZM97908*/ 75100000
*         7  *        BIT(1),     /* Reserved                    @LBC*/ 75150000
*         7  LCTNSYS  BIT(1),     /* DO NOT ASSIGN SPECIAL              78723300
*                                    PROPERTIES              @ZM97908*/ 78743900
*         7  *        BIT(1),     /* UNUSED                  @ZM97908*/ 78764500
*         7  *        BIT(1),     /* Reserved                    @LBC*/ 78785100
*         7  LCTALERR BIT(1),     /* ERROR DURING ALLOCATION @ZM97908*/ 78805700
*         7  *        BIT(1),     /* RESERVED                @ZM97908*/ 78826300
*         7  LCTJESCE BIT(1),     /* On if JES had a Catastrophic Error 78830100
*                                    during a Transaction select or     78833900
*                                    Transaction terminate call  @D3A*/ 78837700
*      5  LCTTMBYT BIT(8),        /* Flag byte - all bits used   @02M*/ 78840200
*         7  LCTTIFJ BIT(1),      /* Time Limit is from JOB card @02M*/ 78842700
*      5  LCTOPSW1 BIT(8),        /* INITIATOR OPTION BYTE 1         */ 78845300
*         7  LCTDPSWA BIT(1),     /* DO NOT SET 'DO NOT SHARE SWA'      78849100
*                                    ON ATTACH                 Y02621*/ 78852900
*         7  *        BIT(1),     /* Reserved                    @LBC*/ 78858600
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 78864300
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 78868100
*         7  LCTCANF  BIT(1),     /* ALLOW CANCEL ONLY AT ALLOC      */ 78871900
*         7  LCTONEJF BIT(1),     /* STARTED TASK INDICATOR          */ 78875700
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 78879500
*         7  *        BIT(1),     /* RESERVED                  Y02652*/ 78883300
*   3  LCTJSCB   PTR(31),         /* ADDRESS OF JSCB         @ZC97908*/ 78888100
*      5  *      PTR(8),          /* RESERVED AS PART OF JSCB ADDRESS   78902000
*                                                                @P3C*/ 78915900
*      5  LCTJSCBP PTR(24),       /* ADDRESS OF JSCB             @L3C*/ 78930000
*   3  LCTDATA1 FIXED(31),        /* MULTI - USE DATA FIELD  @G860PB2*/ 78980000
*   3  LCTDATA2 FIXED(31),        /* MULTI - USE DATA FIELD  @G860PB2*/ 79030000
*   3  LCTDATA3 BIT(8),           /* MULTI - USE DATA FIELD  @G860PB2*/ 79080000
*   3  LCTDATA4 BIT(8),           /* MULTI - USE DATA FIELD  @G860PB2*/ 79130000
*   3  *        FIXED(15),        /* RESERVED                @G860PB2*/ 79180000
*   3  LCTPARAM PTR(31),          /* Address of the termination         79205000
*                                    parameter list              @P4A*/ 79230000
*   3  *        CHAR(12),         /* RESERVED                    @P4C*/ 79255000
*/*                                                             4@L8D*/ 79280000
*   3  LCTJCTXB PTR(31),          /* JCTX SWA block address      @D4C*/ 79580000
*   3  LCTSYSPL PTR(31),          /* ADDR OF SYSEVENT                   79630000
*                                    PARAMETER LIST          @G743P2E*/ 79680000
*   3  LCTSTEPL PTR(31),          /* ADDR OF STAE EXIT PARAMETER        79730000
*                                    LIST FOR INITIATOR        Y02653*/ 79780000
*   3  LCTSSOBA PTR(31),          /* ADDR OF SSOB FOR THIS TASKY02668*/ 79830000
*   3  LCTJCTDA  PTR(31),         /* JCT SWA ADDRESS           Y02652*/ 79880000
*      5 LCTJCTVA PTR(24) BDY(WORD), /*JCT SWA VIRTUAL ADDRESS Y02652*/ 79930000
*      5 *        PTR(8),         /* RESERVED                  Y02652*/ 79980000
*   3  LCTTIOTI FIXED(31),        /* INIT TIOT TTR                   */ 80250001
*   3  *        CHAR(2),          /* Reserved                    @LBC*/ 80299600
*                                 /*                           17@LBD*/ 80349200
*   3  LCTRFB   BIT(8),           /* RESTART FUNCTION SWITCHES       */ 80398801
*      5  LCTRFBSM BIT(1),        /* CALL IEFXB601                   */ 80399201
*      5  LCTRFBCR BIT(1),        /* AUTOMATIC  CHKPT. RESTART Y02641*/ 80399600
*      5  LCTRFBRV BIT(1),        /* SPECIAL WARMSTART PROCESSING    */ 80399701
*      5  LCTRFBDC BIT(1),        /* DEFERRED CHECKPOINT/RESTART     */ 80399801
*      5  LCTRFBMS BIT(1),        /* DO NOT MODIFY JSB FIELDS        */ 80399900
*      5  LCTRFBEF BIT(1),        /* MERGE TO EOF OF JOURNAL         */ 80449900
*      5  LCTRFBRP BIT(1),        /* CALL IEFPREP                    */ 80459901
*      5  LCTRFBND BIT(1),        /* NON-DEFERRED RESTART BIT FOR USE   80461400
*                                    BY SMF EXCLUSIVELY.  SET IN RESTART80462900
*                                    INTERFACE AND TURNED OFF DURING    80464400
*                                    JOB TERMINATION         @ZA93790*/ 80465900
*   3  LCTRFB1  BIT(8),           /* RESERVED FOR WARMSTART/RESTART  */ 80467400
*      5  LCTRSTST  BIT(1),       /* FIRST STEP OF RESTART   @YA23999*/ 80467900
*      5  *         BIT(7),       /* RESERVED                @YA23999*/ 80468400
*   3  *        PTR(31),          /* RESERVED                  Y02652*/ 80468900
*      5  LCTTSIZ  PTR(8),        /* TO INFORM ALLCOATION OF SIZE OF    80470400
*                                    MASTER SCHED. TIOT        Y02641*/ 80471900
*      5 LCTINTS2 BIT(8),         /* INTERNAL SWITCHES, BYTE 2.         80473400
*        IT WILL BE CLEARED FOR EVERY STEP BY IEFSD101.        Y02652*/ 80474900
*        7 LCTSYS BIT(1),         /* SYSTEM TASK REQUESTED     Y02652*/ 80476400
*        7 LCTBPPAS BIT(1),       /* BYPASS PASSWD PROTECT.  @ZA03944*/ 80477900
*        7 LCTTSWPC BIT(1),       /* TRANSWAP COMPLETED      @ZA16877*/ 80479400
*        7 LCTATTC  BIT(1),       /* INITATT HAS BEEN ISSUED            80480900
*                                    (RESET AT INITDET TIME) @ZA16877*/ 80482400
*        7 LCTJSRGN BIT(1),       /* A REGION HAS BEEN OBTAINED FOR     80483900
*                                    THE JOB STEP                @P1A*/ 80485400
*        7 LCTSPREM BIT(1),       /* SPECIAL PROPERTIES ASSIGNED BUT    80486900
*                                    THEN REMOVED BECAUSE JOBLIB OR     80488400
*                                    STEPLIB NOT AUTHORIZED.     @D1A*/ 80489900
*        7 *        BIT(2),       /* RESERVED                    @D1C*/ 80491400
*      5 *        CHAR(2),        /* RESERVED                    @L2A*/ 80492900
*   3  LCTTIOTP PTR(31),          /* ADDR OF TIOT STOR. FOR JOB  @L2C*/ 80494400
*   3  *        PTR(31),          /* Reserved                    @LBC*/ 80495900
*   3  *        PTR(31),          /* Reserved                    @LBC*/ 80545900
*   3  LCTDSABQ PTR(31),          /* ADDRESS OF DSAB QDB STORAGE        80595900
*                                    FOR JOB                     @L2C*/ 80645900
*   3 LCTIWORK CHAR(64),          /* TEMPORARY WORK AREA, TO BE USED    80695900
*                                  ONLY BY THE INITIATOR     @Y02BPSR*/ 80745900
*   3 LCTLABEL CHAR(8);           /* TO CONTAIN THE CHARACTERS          80795900
*                                  'ENDOFLCT', TO HELP IDENTIFY         80845900
*                                  THE LCT IN A STORAGE DUMP @Y02BPSR*/ 80895900
* DCL 1 LCTRSAVE DEFINED(REGSAVE), /* THIS STRUCTURE REDEFINES THE      80945900
*                                    REGISTER SAVEAREA SO THAT IT CAN   80995900
*                                    BE MORE EASILY USED         @LAA*/ 81045900
*       2 REGSAV1 (18) FIXED(31), /* FIRST SAVE AREA - Usually contains 81095900
*                                    EPAs for SWA Manager        @LAA*/ 81145900
*       2 REGSAV2 (18) FIXED(31); /* SECOND SAVEAREA USUALLY FOR SWA    81195900
*                                    MANAGER                     @LAA*/ 81245900
