* %      GOTO  SIOTPRO; /*                                         @H1C 00007400
         MACRO                                                          00014800
         IEFASIOT                                                       00022200
.*/ %SIOTPRO: ;                                                /*@H1A*/ 00029600
*/***START OF SPECIFICATIONS******************************************/ 00037000
*/*                                                                  */ 00044400
*/*01* MACRO NAME = IEFASIOT                                         */ 00051800
*/*                                                                  */ 00059200
*/*01* ACRONYM = SIOT                                                */ 00066600
*/*                                                                  */ 00074000
*/*01* DESCRIPTIVE NAME = Step Input/Output Table                    */ 00079000
*/*                                                                  */ 00084000
*/*01* PROPRIETARY STATEMENT=                                        */ 00089000
*/***PROPRIETARY_STATEMENT********************************************/ 00094000
*/*                                                                  */ 00099000
*/*                                                                  */ 00104000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00109000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00114000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1982, 2000                  @P6C*/ 00121800
*/*                                                                  */ 00129700
*/* STATUS= HBB7703                                                  */ 00132000
*/*                                                                  */ 00134300
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00138900
*/*                                                                  */ 00143500
*/*01* FUNCTION =                                                    */ 00146900
*/*      Contains information concerning a data definition (DD)      */ 00150300
*/*      JCL statement                                               */ 00153700
*/*                                                                  */ 00153900
*/*01* EXTERNAL CLASSIFICATION:                                  @04A*/ 00154100
*/*02* DMTI: BASE                                                @04A*/ 00154300
*/*02* PSPI: FIELDS                                              @04A*/ 00154500
*/*          SCTSDISP   SCTSBYT1   SCTSBYT2   SCTSBYT3           @04A*/ 00154700
*/*          SCTSBYT4   SCTUTYPE   SIOTDEVT   SIOUBYT3           @04A*/ 00154900
*/*          SCTDDNAM   SIOTSMSM                                 @LBC*/ 00155100
*/*                                                              @04A*/ 00155300
*/*01* END OF EXTERNAL CLASSIFICATION:                           @04A*/ 00155500
*/*    Classification notes:                                     @04A*/ 00155700
*/*       The PSPI fields were established because of the        @04A*/ 00155900
*/*       information passed to IATUX32, JES3 installation       @04A*/ 00156100
*/*       exit.                                                  @04A*/ 00156300
*/*                                                                  */ 00157300
*/*01* NOTES =                                                       */ 00158500
*/*      Bilingual mapping macro (PL/AS and BAL)                     */ 00159700
*/*                                                                  */ 00160900
*/*  02* DEPENDENCIES =                                              */ 00162100
*/*                                                                  */ 00163300
*/*        Changes to this macro should be reflected in IPCS control */ 00164500
*/*        block model IEFMSIOT                                  @L6A*/ 00165700
*/*                                                                  */ 00166900
*/*  02* RESTRICTIONS = None                                         */ 00168100
*/*                                                                  */ 00169300
*/***INVOCATION*******************************************************/ 00170500
*/*                                                                  */ 00171700
*/*01* METHOD OF ACCESS =                                            */ 00172900
*/*                                                                  */ 00174100
*/*  02* PL/AS INVOCATION =                                          */ 00175300
*/*                                                                  */ 00176500
*/*        DCL SIOTPTR PTR(31)                                       */ 00177700
*/*        %INCLUDE SYSLIB(IEFASIOT)                                 */ 00178900
*/*                                                                  */ 00180100
*/*  02* BAL INVOCATION =                                            */ 00181300
*/*        SIOT   DSECT                                              */ 00182500
*/*               IEFASIOT                                           */ 00183700
*/*                                                                  */ 00184900
*/********************************************************************/ 00195200
*/*                                                                  */ 00205600
*/*01* DSECT NAME = INDMSIOT                                         */ 00215900
*/*                                                                  */ 00226300
*/*01* COMPONENT = Interpreter (SC1B9)                               */ 00226400
*/*                                                                  */ 00226500
*/*01* EYE CATCHER = 'SIOT'                                          */ 00226600
*/*                                                                  */ 00226700
*/*02*  OFFSET = -4 (SWA prefix)                                     */ 00226800
*/*                                                                  */ 00226900
*/*02*  LENGTH = 4 bytes                                             */ 00227000
*/*                                                                  */ 00227100
*/*01* CREATED BY =                                                  */ 00227200
*/*     Interpreter and Dynamic Allocation                           */ 00227300
*/*01* CREATED BY (IBM use only) =                                   */ 00227400
*/*     Interpreter Modules (IEFVDA, IEFVEA)                         */ 00227500
*/*     Dynamic Allocation Module (IEFDB414)                         */ 00227600
*/*                                                                  */ 00227700
*/*01* POINTED TO BY =                                               */ 00227800
*/*   - AWARSAV1 field (pointer) of the IATYAWA data area (IATUX32)  */ 00227900
*/*                                                              @04A*/ 00228000
*/*01* POINTED TO BY (IBM use only) =                            @04A*/ 00228200
*/*   - DSABSSVA field (SVA token) of the DSAB data area         @04A*/ 00228300
*/*   - SCTFSIOT field of the SCT data area                          */ 00228400
*/*   - SCTPSIOT field of the SIOT data area                         */ 00228500
*/*   - SCTLSIOT field of the SCT data area                      @04A*/ 00228600
*/*   - EREQSSVA field of the ETIORB data area                   @04A*/ 00228700
*/*   - EREQSIOT field of the ETIORB data area                   @04A*/ 00228800
*/*   - SWBUFPTR field in IEFZB506 upon return from IEFQMREQ         */ 00228900
*/*      macro (Preferred method of SVA translation)             @04A*/ 00229000
*/*   - SWBLKPTR field in IEFZB505 upon return from SWAREQ           */ 00229100
*/*      macro                                                   @04A*/ 00229200
*/*                                                                  */ 00229300
*/*01* DELETED BY = IEFDB4A1, IEFDB418                               */ 00229400
*/*                                                                  */ 00229500
*/*01* SERIALIZATION = None                                          */ 00229600
*/*                                                                  */ 00229700
*/*01* STORAGE ATTRIBUTES =                                          */ 00229800
*/*                                                                  */ 00229900
*/*  02* ALLOCATION METHOD = SWA Manager call                        */ 00230000
*/*                                                                  */ 00230100
*/*  02* SUBPOOL = 236 or 237 (SWA), 241 for MSTR address space  @04C*/ 00230200
*/*                                                                  */ 00230300
*/*  02* KEY = 1                                                     */ 00230400
*/*                                                                  */ 00230500
*/*  02* RESIDENCY = Any                                             */ 00230600
*/*                                                                  */ 00230700
*/*01* SIZE = 174 bytes                                              */ 00230900
*/*                                                                  */ 00231400
*/*  02* FREQUENCY = One per specified or generated DD statement.    */ 00232800
*/*                                                                  */ 00234300
*/*01* CHANGE ACTIVITY =                                             */ 00237500
*/*                                                                  */ 00240700
*/*   OZ12405, OZ13854, OZ20610, OZ28955, OZ33579, OZ34258, OZ41829, */ 00243900
*/*   OZ52570, OZ58701, OZ61887, OY01081, OY11473, OY15130, OY20190, */ 00247100
*/*   OY31386                                                        */ 00250300
*/*                                                                  */ 00253900
*/*  $H1=EXTJCL  JBB2110 821015 PD43: SUPPORT FOR EXTENDED JCL   @H1A*/ 00260800
*/*  $P1=PA20586 JBB2220 851014 PDR6: PA20586                    @P1C*/ 00267700
*/*  $T1=OY40098 JBB2220 910301 PDHB: 3490 device support        @T1A*/ 00268800
*/*  $01=OY36721 JBB2220 901020 PDB2: BLKSIZE SPECIFIED FLAG     @01A*/ 00270000
*/*  $L1=SMSSTG2 JBB2223 860127 PDB1: STOR MGMT SUBSYS STG2 SUPT @L1A*/ 00274600
*/*  $L2=SMSSTG2 JBB2223 860324 PDN3: STOR MGMT SUBSYS STG2 SUPT @L2A*/ 00281500
*/*  $D1=DCR57   JBB2223 870923 PDN3: STOR MGMT SUBSYS STG2 SUPT @D1A*/ 00282700
*/*  $03=OY41404 JBB2223 910320 PDE1: VOL/UNIT-count specification   */ 00283900
*/*                                   DFP APAR OY40197           @03A*/ 00285100
*/*  $04=OY62301 JBB2223 930318 PDBD: Tape Library Support       @04A*/ 00285800
*/*  $06=OY63724 JBB2223 930513 PDCL: Quoted Data Set Indicator  @06A*/ 00286200
*/*  $L3=SP313   JBB3313 880331 PDM9: MVS/SP3.1.3                @L3A*/ 00286600
*/*  $L4=JUP03   HBB4410 870323 PDN3: USER/WRITER NAME               */ 00287400
*/*                                   DIFFERENTIATION            @L4A*/ 00287800
*/*  $D2=DCR245  HBB4410 891016 PDAZ: MVS/SP 4.1.0               @D2A*/ 00288100
*/*  $02=OY41078 HBB4410 910320 PDN3: HOLD= specification for        */ 00288600
*/*                                   JES2 APAR OY38698          @02A*/ 00289100
*/*  $L5=APPC1   HBB4420 890428 PDCC: ALLOCATION FROM TP PROFILE @L5A*/ 00289600
*/*  $L6=DDPERF  HBB4420 900406 PDDS: DDPERFIPCS DD LIMIT PERF   @L6A*/ 00290100
*/*  $P2=PH32065 HBB4420 910108 PDB2: ALLOCATION FROM TP PROFILE @P2A*/ 00290600
*/*  $07=OY67196 HBB4420 931207 PDEV: TMM DEFER support          @07A*/ 00291100
*/*  $L7=ATLIB   HBB4430 911007 PDM1: Tape Library Support       @L7A*/ 00291700
*/*  $L8=POSIX   HBB4430 911028 PDBN: OPEN/MVS Support           @L8A*/ 00292000
*/*  $L9=ATLIB   HBB4430 911202 PDB6: TAPE LIBRARY SUPPORT       @L9A*/ 00292300
*/*  $LA=POSIX   HBB4430 920108 PDBN: OPEN/MVS Support           @LAA*/ 00292600
*/*  $P3=PKB0275 HBB4430 920108 PDBN: PTM PKB0275                @P3A*/ 00292700
*/*  $D3=DCR0020 HBB4430 920429 PDCL: Tape Library Support       @D3A*/ 00292800
*/*  $P4=PKB3899 HBB4430 920729 PDJY: PTM PKB3899                @P4A*/ 00293600
*/*  $LB=UCBVP   HBB5520 940210 PDDZ: UCB VSCR                   @LBA*/ 00293800
*/*  $LC=UCBVP   HBB5520 941020 PDEM: Update SIOTDYNU comments   @LCA*/ 00294000
*/*  $LD=TMM     JBB5522 940819 PDEV: TMM Fixup                  @LDA*/ 00294200
*/*  $LE=TMM     JBB5522 950105 PDEV: TMM Fixup                  @LEA*/ 00294300
*/*  $LF=TMM     JBB5522 950105 PDEV: TMM Fixup                  @LFA*/ 00294600
*/*  $08=OW10839 HBB4420 950127 PDHB: Define new flag, SIOTSACP,     */ 00294700
*/*                                   in the SIOTBYT2 field.         */ 00294800
*/*                                   This APAR is in support of     */ 00294900
*/*                                   Allocation APAR OW09787.   @08A*/ 00295000
*/*  $P5=PVT0016 HBB6606 980131 PDDH: FIN APAR OW24334           @P5A*/ 00295100
*/*     =PVT0604 HBB6606 980224 PDDH: Cleanup Copyright Statement    */ 00297100
*/*  $09=OW31783 HBB6601 980331 PDHB: Define new flag, SIOTPTTS,     */ 00297700
*/*                                   in the SIOTBYT2 field.     @09A*/ 00298300
*/*  $0A=OW36774 HBB4430 990316 PDNN: Define new flag, SIOTCRIJ,     */ 00298500
*/*                                   in SIOTBYT0.               @0AA*/ 00298700
*/*  $0B=OW37655 HBB6601 990312 PDHB: Request REQ00072224.       @0BA*/ 00298900
*/*  $LG=SIOTX   HBB7703 990831 PDOO: Update SIOTSIOX comments   @LGA*/ 00299400
*/*  $LH=UNAFF   HBB7703 990831 PDNN: Unit Affinity for SMS Tape @LHA*/ 00299900
*/*  $0C=OW38370 HBB5510 991115 PDNN: Remove SYSZDSTB serialization  */ 00300000
*/*                                   and fix DISP=SHR           @0CA*/ 00300100
*/*  $P6=PXD1020 HBB7703 000201 PDFD: Fix copyright              @P6A*/ 00300200
*/*  $0D=OW44785 HBB7703 000915 PDOO: Duplicate Volume Support       */ 00300260
*/*                                   for JES3                   @0DA*/ 00300320
*/*                                                                  */ 00300400
*/***END OF SPECIFICATIONS********************************************/ 00301100
*/* PRIVATE CATALOG SUPPORT                         Y010001 01/27/72 */ 00303400
*/* C - 024090,718600                                         @Y01113*/ 00309700
*/* A - 024090-024099,719100-720100                           @Y01113*/ 00316000
*/* C - 024420-024440                                          @21774*/ 00322300
*/* C - 669600                                                 @M0237*/ 00328600
*/* C - 022600-023400,669600-676600                            @M0231*/ 00334900
*/* C - TWO BITS DEFINED AS MSS-ALL (SIOTMSS) AND            @ZA34258*/ 00341600
*/*     MSS-MIXED(SIOTMXD) INDICATORS                        @ZA34258*/ 00350200
*/* C - UPDATED SCTSBYT4 IN BAL TO ADD SYMBOLIC NAMES        @ZA34258*/ 00358800
*/* C - DEFINE SIOTAFF, CODE DROPPED FROM SU16               @ZA33579*/ 00367400
*/* C - UPDATED SCTUTYPE IN BAL TO ADD SYMBOLIC NAMES        @ZA41829*/ 00376000
*/*     CLARIFY COMMENTS ABOUT LABEL SIOUCNVT                @ZA41829*/ 00384600
*/*     IN BOTH PLS AND BAL.                                 @ZA41829*/ 00393200
*/* C - REDEFINE SIOTATE TO SIOTPSVA-SUPPORT FOR OZ38945     @ZA52570*/ 00401800
*/* C - DEFINE SIOTEDLG TO SAVE THE SUBPOOL NUMBER           @ZA58701*/ 00410400
*/*     FOR STORAGE FOR THE EDL                              @ZA58701*/ 00419000
*/* A - PROLOGUE                                                 @H1A*/ 00427600
*/* A - SCHEDULER WORK BLOCK(SWB) STRUCTURE POINTER              @H1A*/ 00436600
*/* C - SIOTDEFC DEFINED. INDICATOR TO JES3 THAT DEFAULT     @ZA61887*/ 00444000
*/*     COPIES WAS SET.                                      @ZA61887*/ 00451400
*/* A - SIOTDCLA DEFINED. INDICATOR TO JES'S THAT DEFAULT SYSOUT     */ 00458800
*/*     WAS SET.                                                 @H1A*/ 00460200
*/* C - CHANGED TTR AND DISK ADDRESS TO SVA IN COMMENTS          @P1A*/ 00461600
*/* C - CHANGED RESERVED BYTE AFTER SIOTEDLG TO SIOTSMS TO           */ 00463000
*/*     CONTAIN THE SMS MANAGED BIT                              @L1A*/ 00464400
*/* C - CHANGED SIOTNDSB FIELD NAME TO SIOTSCT. THIS FIELD'S         */ 00465800
*/*     USE IS CHANGED FROM CONTAINING THE NEXT DSB SVA TO           */ 00467200
*/*     THE SVA OF THIS STEP'S STEP CONTROL TABLE (SCT).         @L1A*/ 00468600
*/* C - CHANGED 3 RESERVED WORDS AFTER SIOTSSNM, RESPECTIVELY,       */ 00470000
*/*     TO SIOTSTMT, SIOTSIOX, AND SIOTAMSG.                     @L1A*/ 00471400
*/* A - STRUCTURE SIOTASCT                                       @L2A*/ 00472800
*/* C - SIODSNTE CHANGED TO FIXED(16) IN PLS TO ALLOW A      @YA01081*/ 00474200
*/*     MAXIMUM VALUE OF 64K.                                @YA01081*/ 00475600
*/* C - SIOVDSNT CHANGED TO FIXED(16) IN PLS TO ALLOW A      @YA01081*/ 00477000
*/*     MAXIMUM VALUE OF 64K.                                @YA01081*/ 00478400
*/* C - ADDED SCTSYSOU DEFINITION TO THE ASM VERSION             @L3A*/ 00480300
*/* A - SIOTWTRN INDICATOR TO SIOTBYT5 TO DIFFERENTIATE BETWEEN      */ 00480500
*/*     USER NAME AND WRITER NAME                                @L4A*/ 00480700
*/* C - SIOTSMS DEFINITION                                           */ 00481100
*/*     (NOTE: these indicators are targetted for relocation)    @D1C*/ 00481500
*/* C - DEFINE ASSEMBLER MAPPING COMPATIBLE TO PLS MAPPING   @YA11473*/ 00481900
*/* C - SIOTDDST DEFINED. INDICATOR TO JES'S THAT DEFAULT    @YA15130*/ 00482700
*/*                DEST WAS SET.                             @YA15130*/ 00483500
*/* A - DEFINITION OF SIOTADUN IN SIOTBYT5. THIS CHANGE IS IN        */ 00484300
*/*     SUPPORT OF ALLOCATION APAR OY19572.                  @OY20190*/ 00485100
*/* A - SIOTBLKD BIT TO DESIGNATE THAT THE USER SPECIFIED THE        */ 00485200
*/*                BLKSIZE KEYWORD VALUE, SO ALLOCATION SHOULD NOT   */ 00485300
*/*                OVERWRITE BLKSIZE VALUE WITH VALUE FROM           */ 00485400
*/*                MODEL DSCB                                    @01A*/ 00485500
*/* A - ADDED SIOTGPRV TO INDICATE THAT A TEMPORARY DATASET NAME @L5A*/ 00485700
*/*     WAS GENERATED IN A PRIOR STEP                            @L5A*/ 00485800
*/* A - SCTANAME MAY NOW CONTAIN THE SVA OF A SIOT IN A PRIOR    @L5A*/ 00486000
*/*     STEP                                                     @L5A*/ 00486300
*/* A - SIOTRCNT indicator to track the number of times          @D2A*/ 00486900
*/*     Recovery Allocation was entered                          @D2A*/ 00487100
*/* A - SIOTDYNU indicator to tell SMS that UNIT parameter is        */ 00487300
*/*     Dynamic Allocation default unit                      @YA31386*/ 00487500
*/* C - SIOTBLKD BIT TO DESIGNATE THAT THE USER SPECIFIED THE        */ 00487800
*/*                BLKSIZE KEYWORD VALUE, SO ALLOCATION SHOULD NOT   */ 00488100
*/*                OVERWRITE BLKSIZE VALUE WITH VALUE FROM           */ 00488400
*/*                MODEL DSCB                                    @01A*/ 00488700
*/* A - SIOTOVES was defined which indicates when a SIOT is          */ 00489000
*/*     associated with an 'overriding' esoteric.                @T1A*/ 00489300
*/* A - Added dependency note in prolog for IPCS control block   @L6A*/ 00489600
*/*     model                                                    @L6A*/ 00489900
*/* C - Move SIOTGPRV to SIOTBYT4 from SIOTBYT5                  @P2A*/ 00490200
*/* A - SIOTHLD in SIOTBYT3 to indicate when HOLD= was specified     */ 00490500
*/*     for the Allocation.  This is set by IEFVDA in batch.  This   */ 00490800
*/*     APAR is in support of JES2 APAR OY38698.                 @02A*/ 00491100
*/* A - SIOTUCNT in SIOTBYT4 to indicate when the unit-count         */ 00491400
*/*     subparameter of the UNIT= keyword was specified for the      */ 00491700
*/*     allocation.  Set by IEFVDA in batch.  This APAR is in        */ 00492000
*/*     support of DFP APAR OY40197.  (NOTE: this indicator is       */ 00492300
*/*     targetted for relocation)                                @03A*/ 00492600
*/* A - SIOTVCNT in SIOTBYT4 to indicate when the volume-count       */ 00492900
*/*     subparameter of the VOLUME= keyword was specified for the    */ 00493200
*/*     allocation.  Set by IEFVDA in batch.  This APAR is in        */ 00493500
*/*     support of DFP APAR OY40197.  (NOTE: this indicator is       */ 00493800
*/*     targetted for relocation)                                @03A*/ 00494100
*/* C - Removed SIOTEDLG field, which was used to save the           */ 00494200
*/*     subpool number for EDL storage                           @L7A*/ 00494300
*/* C - SIOTEDLS replaced by SIOTDDWA (pointer to IEFZDDWA)          */ 00494400
*/*   - SIOTSMS1 thru SIOTSMS7 - comment documentation           @L7A*/ 00494500
*/* C - SIOTSIOX to SIOTDDIB to contain the address of the DDIB      */ 00495000
*/*     used by Allocation for hierarchical file names (POSIX path   */ 00495500
*/*     names)                                                   @L8A*/ 00496000
*/* A - SIOTHIER to SIOTBYT4 to indicate that SIOT represents a      */ 00498500
*/*     hierarchical file                                        @L8A*/ 00499000
*/* C - Changed prologue to SHOWHDR format                       @L8A*/ 00499500
*/* C - Removed SIOTMSS, SIOTMXD, SIOTFUDA, SPVTAMSG, SIOTGIGN,      */ 00499700
*/*     SIOTRTRY, SIOPSCNT, SIOTRCNT, SIOTGIID, SIOTSSIC,SVOLUNAD,   */ 00499900
*/*     SVOLUNNO and SIOTAMSG                                    @L9A*/ 00500100
*/* C - Restored SIOTSIOX, moved SIOTDDIB to location formerly       */ 00500300
*/*     occupied by SVOLUNAD.  Corrected alignment problems from     */ 00500500
*/*     previous change.                                         @LAA*/ 00500700
*/* C - Restored SIOTAMSG field                                  @P3A*/ 00500900
*/* C - Redefined reserved field (which was SIOTEDLG described   @D3A*/ 00501000
*/*     above with L7) as SIOTSMSF to contain bits used by       @D3A*/ 00501100
*/*     SJF Access                                               @D3A*/ 00501200
*/* C - Changed 'POSIX' to 'OpenMVS' in line comments            @P4A*/ 00501300
*/* M - Move the SIOTSMSF field to the last byte of SIOTOPUC field   */ 00501400
*/*     to contain flags used by SJF ACCESS beginning at HBB4430     */ 00501500
*/*     in support of Automatic Tape Library.  DKB0020 redefine the  */ 00501600
*/*     field SIOTEDLG as the SIOTSMSF field.  However, since this   */ 00501700
*/*     field was not available in the previous release, and the     */ 00501800
*/*     code need to be rolled down to previous releases due to      */ 00501900
*/*     APAR OY62301, a new reserved field (SIOTOPUC) is used.   @04A*/ 00502000
*/* C - Corrected prologue and comment fields for data areas         */ 00502100
*/*     publication                                              @04A*/ 00502200
*/* C - Removed IWASIOTP reference in prolog                     @04C*/ 00502300
*/* A - Added SIOTDSQU to indicate that data set name was            */ 00502400
*/*     specified in quotes.  In support of DF/SMS apar OY63717.     */ 00502500
*/*     Corresponding SJF & Dynamic Alloc apars OY63723,OY63722. @06A*/ 00502600
*/* A - Added SIOTREDT and SIOTOPEN.  In support of Allocation       */ 00503600
*/*     APAR OY66484. These indicators are only set by Allocation    */ 00504600
*/*     and are only intended for use by Allocation.             @07A*/ 00505600
*/* C - Updated comments for the SIOTDYNU field.                 @LCA*/ 00506100
*/* A - Added SIOTRESL.  When OFF and the SIOT represents a DD       */ 00506300
*/*     being referenced by an other DD that is SMS managed, the     */ 00506500
*/*     DD requires Allocation to call SMS VOLREF services to        */ 00506700
*/*     allow SMS to resolve the reference.  When ON, the reference  */ 00506900
*/*     to the DD has been resolved.                             @LDA*/ 00507100
*/* A - Added support for SIOTCLRV flag.  If this flag is ON, it     */ 00507300
*/*     indicates that Allocation is to clear the volsers from the   */ 00507500
*/*     JFCB/JFCBXs associated with this SIOT.  This indicator is    */ 00507700
*/*     set by SMS.                                              @LEA*/ 00507900
*/* D - Remove support for SIOTCLRV flag.                        @LFA*/ 00508000
*/* A - Added SIOTSACP flag to the unused bit 6 of the SIOTBYT2      */ 00508100
*/*     field.  This flag will be set in IEFAB490 whenever messages  */ 00508200
*/*     are moved from either the SMS 'IGDMCSC2 MSG CELL POOL' Cell  */ 00508300
*/*     Pool or the Allocation 'ALLOCATION ERROR MESSAGE' Cell Pool  */ 00508400
*/*     to the Allocation 'SC1B4 AB490' Cell Pool.               @08A*/ 00508500
*/* A - Added SIOTDSOP.  This bit will be set by DFP so that RESTART */ 00508600
*/*     processing will know if a dataset had been opened prior to a */ 00508700
*/*     system crash.  Allocation disposition processing (IEFAB4A2)  */ 00508800
*/*     will use this bit to determine the correct disposition.  @P5A*/ 00508900
*/* A - Added SIOTPTTS flag to the unused bit 7 of the SIOTBYT2      */ 00509000
*/*     field.  This flag will be set in IEFAB48A for all Tape       */ 00509100
*/*     Requests.  IEFAB489 will check this flag and mark all        */ 00509200
*/*     SIOTs that do not have it on as 'ignore'.                @09A*/ 00509300
*/* A - Added SIOTCRIJ flag to the unused bit 2 of the SIOTBYT0      */ 00509700
*/*     field.  This flag will be set in IEFAB459, copied in         */ 00510100
*/*     IEFAB464, and propagated in IEFAB469 to indicate the data    */ 00510500
*/*     set was created within this job.  IEFBB416 uses the          */ 00510900
*/*     information to determine the fate of passed unreceived       */ 00511300
*/*     data sets.                                               @0AA*/ 00511700
*/* A - Added SIOTWOWO flag to the unused bit 3 of the SIOTBYT0      */ 00512100
*/*     field.  This flag will be set by IEFAB452 whenever a         */ 00512500
*/*     Dynamic Allocation is Demanding an ATL device that is        */ 00512900
*/*     already allocated to the current task.  It will be           */ 00513300
*/*     checked by IEFAB42B and IEFAB424 to ensure this Request      */ 00513700
*/*     is not failed.                                           @0BA*/ 00514100
*/* C - Updated comments for the SIOTSIOX field.  Since this         */ 00514200
*/*     field is now in use, the "Reserved for future use" verbage   */ 00514300
*/*     was removed.  Changed the (reserved) field named SIOTOPUC    */ 00514400
*/*     to SIOTXSVA.  This field will hold the SVA of the SIOTX      */ 00514500
*/*     associated with the current SIOT.                        @LGA*/ 00514600
*/* C - Updated comments for the SIOTRESL field.  If SIOTRESL is     */ 00514700
*/*     on, SMS has completed determining the type of request        */ 00514800
*/*     (i.e., SMS tape, SMS DASD, non-SMS tape, non-SMS DASD).  @LHA*/ 00514900
*/* A - Added SIOTDDSP (Disposition Defaulted) indicator.  This      */ 00515000
*/*     flag will be set by IEFAB459 when no disposition is coded    */ 00515100
*/*     on the JCL or the SVC99 (e.g., DISP=SHR rather than          */ 00515200
*/*     DISP=(SHR,KEEP)).  It will be checked by IEFAB4A2.       @0CA*/ 00515300
*/*     (Scenario #3)                                            @0CA*/ 00515400
*/* C - Fixed copyright/program number statements.               @P6A*/ 00515500
*/* A - Added SIOTDUPV (Duplicate Volume) bit to indicate that       */ 00515520
*/*     the SIOT is for a duplicate volume, but outside the          */ 00515540
*/*     SMS managed library.  This bit is updated via SJF,           */ 00515560
*/*     Key = '8530'X.                                           @0DA*/ 00515580
*/*------------------------------------------------------------------*/ 00515600
*       %GOTO SIOTBSL;                                         /*@H1A   00515700
         DS    0D                                                       00515800
INDMSIOT EQU   *      STEP I-O TABLE                                    00516100
SIOTDSKA DS    CL3    SVA OF THIS SIOT                                  00516500
SIOTTYPE DS    CL1    TABLE ID OF SIOT =3                               00518000
SIOTID   EQU   3                                                        00525400
DSNID    EQU   7                                                        00532800
SCTDDNAM DS    CL8    THE DDNAME FROM THE DD CARD                       00541200
SIOTDEST DS    CL8    USER ID ENABLING SYSOUT TO BE ROUTED             +00549600
                      VIA JCL                                   @Y02668 00558000
SCTUSADD DS    CL2    INTERNAL NUMBER OF THE DD STATEMENT FOR          +00566400
                      WHICH UNIT AFFINITY IS SPECIFIED IN THIS         +00574800
                      DD STATEMENT                              @Y02668 00583200
SIOTUNAF EQU   SCTUSADD                                         @Y02670 00592000
SIODSNTE DS    CL2    OFFSET INTO DSNT FOR DCB REFERENCE TO A          +00598300
                      DATA SET                                  @Y02668 00604600
SIOTVLSP DS    CL2    VOL SEP DD NO.                           @G24LPSJ 00610900
SIOTAFID DS    CL2    AFFINITY ASSOCIATION ID WITH                     +00617200
                      MULTI-UNIT/GENERIC REQUEST                @Y02668 00623500
SCTPSIOT DS    CL4    SVA OF NEXT SIOT IN CHAIN                         00629800
SCTPJFCB DS    CL4    SVA OF JFCB                                       00636100
SIOTVRSB DS    CL3    SVA OF SIOT FOR VOLREF OR SUBALLOCATE     @Y02670 00642400
SIOTOTUN DS    CL1    TOTAL NUMBER OF UNITS USED FOR THIS SIOT  @Y02670 00648700
SIOTREFN DS    CL2    DD NUMBER OF INTRA STEP                   @Y02670 00655000
         DS    CL1    Reserved                                     @LAC 00661300
*                                                                       00668000
SIOTBYT1 DS    CL1    MVM INDICATORS                            @Y02670 00669500
SIOTOCKP EQU   128    BIT 0 - DATA SET OPEN AT LAST CHECKPOINT  @Y02641 00671000
SIOTHOLD EQU   64     BIT 1 - SYSOUT DATA SET TO BE PLACED ON          +00672500
                              HOLD QUEUE.                       @Y02670 00674000
SIOVAMDS EQU   32     BIT 2 - VAM DATA SET                      @Y02670 00675500
SIODUNAL EQU   16     BIT 3 - DATA SET HAS BEEN DYNAMICALLY            +00677000
                              UNALLOCATED                       @Y02670 00678500
SIOTDADR EQU   8      BIT 4 - DADSM IS REQUIRED                 @Y02670 00680000
SIODADSM EQU   4      BIT 5 - DADSM WAS SUCCESSFUL              @Y02670 00681500
SIOTALCD EQU   2      BIT 6 - THIS SIOT IS COMPLETELY ALLOCATED @Y02670 00683000
SIOTDDNT EQU   1      BIT 7 - IN TSO, COMMAND PROCESSOR MUST           +00684500
                              PUT DDNAME IN DDNT                @Y02668 00686000
*                                                                       00687500
SCTDDINO DS    CL2    INTERNAL NUMBER OF THE DD STATEMENT       @Y02940 00689000
*                                                                       00690500
SIOTBYT3 DS    CL1    ALLOCATION INDICATOR BYTE                @YM03582 00692000
SIOALIAS EQU   128    BIT 0 - ALIAS EXISTS FOR THIS DATA SET   @YM03582 00693500
SIOCDEVT EQU   64     BIT 1 - DEVICE TYPE FOR THIS DATA SET            +00695000
                              OBTAINED FROM CATALOG            @YM03582 00696500
SIOTJES3 EQU   32     BIT 2 - DEVICES FOR THIS ALLOCATION              +00698000
                              SELECTED BY JES3                  @Y02668 00699500
S3400OFF EQU   16     BIT 3 - INITALIZE S3400DSP TO OFF        @ZA13854 00701000
SIOTDSID EQU   8      BIT 4 - ON FOR DSID KEYWORD              @ZA20610 00702500
SIOUCVTD EQU   4      BIT 5 - On when unit name conversion has     @LBC 00703600
*                             been done.                           @LBA 00704700
*                             Also refer to SIOUCNVT.              @LBA 00705800
SIOTDSOP EQU   2      BIT 6 - On when the dataset has been opened. @P5C 00707600
SIOTHLD  EQU   1      BIT 7 - HOLD= WAS SPECIFIED FOR THIS             +00709500
                              ALLOCATION                           @02C 00710500
*                                                                       00711500
SIOTTSTC DS    CL1    INDICATORS FOR TIME SHARING AND TCAM       @20001 00713000
SIOTINFC EQU   128    BIT 0 - SIOT INF CODE INDICATOR          @G24LPSJ 00714500
SIOTTERM EQU   64     BIT 1 - TSO TERMINAL BIT - DD TERM=TS            +00716000
                              PARAMETER SET BY IEFVDA            @20001 00717500
*        EQU   32     BIT 2 - RESERVED                         @G29AN2F 00719000
SIOTSSGP EQU   16     BIT 3 - GROUP SUBSYSTEM REQUEST(SUBSYS)  @G29AN2F 00720500
SIOTSSMG EQU   8      BIT 4 - SUBSYSTEM ERROR MSG INDICATOR    @G29AN2F 00722200
SIOTTRKM EQU   4      BIT 5 - XB609 SETS FOR AB427 WHEN                +00723900
                              DYNAMIC                          @ZA06466 00725600
SIOTDSNM EQU   2      BIT 6 - SYSOUT DSDR FOUND ON CHECKPOINT          +00727300
                              DATA SET                         @ZA06466 00729000
SIOTQNAM EQU   1      BIT 7 - FOR TCAM USE =1 IF QNAME= ON DD          +00731000
                              STATEMENT.  SET BY IEFVDA, TESTED        +00732500
                              BY ALLOCATION                      @20002 00734000
*                                                                       00735500
SCTSPOOL DS    CL1    INTERNAL NO. OF POOL DD                           00740000
SCTVOLCT DS    CL1    NUMBER OF VOLUMES FOR THIS DATASET        @Y02670 00760000
         DS    CL2    Reserved                                     @LAC 00779000
*                                                                       00798100
SIOTBYT0 DS    CL1    EXTENDED ALLOCATION INDICATORS                    00810800
SIOTSSDS EQU   128    BIT 0 - DATA SET WILL BE PROCESSED BY            +00823500
                              A SUBSYSTEM                       @Y02668 00836200
SIOTDYAL EQU   64     BIT 1 - DATA SET DYNAMICALLY ALLOCATED    @Y02641 00848900
SIOTCRIJ EQU   32     BIT 2 - Data set created in this job         @0AC 00855400
SIOTWOWO EQU   16     BIT 3 - Who Owns, We Own flag.  When on,          00861900
*                             it indicates that this is a Dynamic       00868400
*                             Allocation that is Demanding an ATL       00874900
*                             device that is already allocated to       00881400
*                             this job.                                 00887900
*                             This flag is set by IEFAB452 and then     00894400
*                             checked by IEFAB42B and IEFAB424 to       00900900
*                             avoid failing the subject Request.   @0BC 00907400
SIOTDDSP EQU   8      BIT 4 - Value in SCTSDISP was defaulted      @0CA 00914100
SIOTNOPV EQU   4      BIT 5 - USE ATTRIBUTE OF UCB HAS BEEN MADE       +00920800
                              PRIVATE                           @Y02670 00932000
SIOTPUPV EQU   2      BIT 6 - USE ATT. OF UCB CHANGED FROM PUB         +00943200
                              TO PRIVATE                        @Y02670 00954400
*        EQU   1      BIT 7 - Not used and available.              @L9C 00971200
*                                                                       00988000
SCTNMBUT DS    CL1    THE NUMBER OF UNITS FOR THE DATA SET              01038000
*                                                                       01320000
SIOTVLCT DS    CL1    VALUE OF SPECIFIED VOL COUNT( = JFCBVLCT)         01322300
*                                                                       01324600
SCTSDISP DS    CL1    SCHEDULER DISPOSITION OF THE DATA SET (AT THE    +01326900
                      END OF THE STEP OR JOB) INDICATORS                01329200
SIOTRETN EQU   128    BIT 0 - RETAIN BIT                       @ZD03010 01331500
S3400DSP EQU   64     BIT 1 - FOR DISP. PROCESSING OF DATA SET         +01333800
                              ON ASPEN DEVICE                   @Y02670 01336100
PRIVATE  EQU   32                   BIT 2 - PRIVATE VOLUME      @Y02668 01338400
SIOTPRIV EQU   32                   BIT 2 - PRIVATE VOLUME     @YA11473 01339500
SIOTPASS EQU   16                   BIT 3 - PASS THE DATA SET  @YA11473 01340700
SIOTKEEP EQU   8                    BIT 4 - KEEP THE DATA SET  @YA11473 01343000
SIOTDLET EQU   4                    BIT 5 - DELETE DATA SET    @YA11473 01345300
SIOTCTLG EQU   2                    BIT 6 - CATALOG THE DATA   @YA11473 01347600
*                                           SET                         01349900
SIOTUNCT EQU   1                    BIT 7 - UNCATALOG THE      @YA11473 01352200
*                                           DATA SET                    01354500
SCTSBYT1 DS    CL1    INDICATOR BYTE NUMBER 1                           01356800
SCTDUMMY EQU   128    BIT 0 - DUMMY DATA SET                            01360000
SCTSYSIN EQU   64     BIT 1 - SYSIN DATA SET                            01380000
SIOTCCAT EQU   32     BIT 2 - BLANK DD NAME - CONCATENATION     @Y02668 01400000
SIOTGDSN EQU   16     BIT 3 - GENERATED DATA SET NAME           @Y02668 01420000
SIOTQDSN EQU   8      BIT 4 - QUALIFIED DATA SET IS SPECIFIED   @Y02668 01440000
SCTPARLM EQU   4      BIT 5 - PARALLEL MOUNT INDICATOR         @YA11473 01460000
SCTUNAFF EQU   2      BIT 6 - UNIT AFFINITY                             01480000
SIOTJSCT EQU   1      BIT 7 - SIOT IS ASSOCIATED WITH A JOBCAT         +01500000
                              OR STEPCAT                        @Y02668 01520000
*                                                                       01540000
SCTSBYT2 DS    CL1    INDICATOR BYTE NUMBER 2                           01556300
SIOCLUNL EQU   128    BIT 0 - CLOSE SHOULD DYNAMICALLY UNALLOCATE      +01572600
                              DATA SET                          @Y02668 01588900
SIOTCATL EQU   64     BIT 1-  DATA SET IS A CATALOG            @YM03553 01605200
SCTVOLAF EQU   32     BIT 2 - VOLUME AFFINITY                           01621500
SCTJOBLB EQU   16     BIT 3 - JOBLIB DD STMNT                           01637800
SCTUNLBD EQU   8      BIT 4 - UNLABELED                                 01654100
SCTLABEL EQU   4      BIT 5 - NONSTANDARD LABEL                         01670400
SCTDEFER EQU   2      BIT 6 - DEFER MOUNTING                            01686700
SCTRECVD EQU   1      BIT 7 - RECEIVED DATA SET                         01703000
*                                                                       01720000
SCTSBYT3 DS    CL1    INDICATOR BYTE NUMBER 3                           01749000
SCTDSNRF EQU   128    BIT 0 - VOLUME REFERENCE DSNAME PRESENT           01778000
SCTSYSNE EQU   64     BIT 1 - SYSIN EXPECTED (PROCEDURES ONLY)   @19874 01796000
SCTALCHK EQU   32     BIT 2 - THIS SIOT ALLOCATED AT LAST              +01814000
                              CHECKPOINT                       @ZA09426 01832000
SCTVREF  EQU   16     BIT 3 - VOLUME REFERENCE IN STEP         @YM05425 01850000
SCTSYSOU EQU   8      BIT 4 SYSOUT IS SPECIFIED                @YA11473 01868000
SCTSNEW  EQU   4      BIT 5 - NEW DATA SET                     @YA11473 01886000
SCTSMOD  EQU   2      BIT 6 - MODIFIED DATA SET                @YA11473 01904000
SCTSOLD  EQU   1      BIT 7 - OLD DATA SET                     @YA11473 01922000
*                                                                       01940000
SCTSBYT4 DS    CL1    INDICATOR BYTE NUMBER 4                           01960000
SCTSGDGS EQU   128    BIT 0 - SET BY R/O TO INDICATE GDG               +01961800
                              SINGLE                           @ZA34258 01963600
SIOTGDGA EQU   64     BIT 1 - THIS IS A GENERATED SIOT         @ZA34258 01965400
SIOTAFF  EQU   32     BIT 2 - SIOT AFFINITY INDICATOR          @ZA33579 01967200
SIOTASCI EQU   16     BIT 3 - USASCII TAPE LABEL.                      +01969000
                              SET BY IEFVDA,TESTED BY IEFWA000   @19200 01970800
SIOTSTEP EQU   8      BIT 4 - STEP PROCESSED                   @ZA34258 01972600
SIOTVAFF EQU   4      BIT 5 - INTRA-STEP VOLUME AFFINITY       @ZA34258 01974400
SIOTIPDI EQU   2      BIT 6 - DATA SET IS IN PDI               @ZA34258 01976200
SIOTOMN  EQU   1      BIT 7 - 1 = OLD OR MODIFIED DATA SET             +01977700
                              0 = NEW DATA SET                 @ZA34258 01979200
*                                                                       01980700
SCTUTYPE DS    0CL8   UNIT TYPE                                @ZA41829 01982200
SIOTDEVT DS    0CL4   DEVICE TYPE                              @ZA41829 01986000
SIOUBYT1 DS    CL1                                             @ZA41829 01989800
SIOUBYT2 DS    CL1                                             @ZA41829 01993600
*                                                                       01995500
SIOUBYT3 DS    CL1    DEVICE CLASS                             @ZA41829 01997400
SIO3TAPE EQU   128    BIT 0 - TAPE DEVICE                      @ZA41829 02001200
SIO3COMM EQU   64     BIT 1 - COMMUNICATIONS DEVICE            @ZA41829 02005000
SIO3DACC EQU   32     BIT 2 - DIRECT ACCESS DEVICE             @ZA41829 02008800
SIO3DISP EQU   16     BIT 3 - GRAPHICS DEVICE                  @ZA41829 02012600
SIO3UREC EQU   8      BIT 4 - UNIT RECORD DEVICE               @ZA41829 02016400
*        EQU   4      BIT 5 - RESERVED                                  02026900
*        EQU   2      BIT 6 - RESERVED                                  02037400
*        EQU   1      BIT 7 - RESERVED                                  02047900
*                                                                       02058400
SIOUBYT4 DS    CL1                                             @ZA41829 02068900
SIOUCBA4 DS    0XL4   UCB address (4-bytes)                        @LBA 02074700
SIOUCNVT DS    CL1    IF = X'FF' SIOUCBAD is an SVA,               @LBC 02080500
*                     IF = X'00' Unit name conversion has          @LBC 02086300
*                                been done.                        @LBA 02095900
*                     Also refer to flag SIOUCVTD.                 @LBA 02105500
SIOUCBAD DS    CL3    3-byte UCB address or SVA for UNIT=AFF       @LBC 02115300
*                                                                       02121400
*                                                                       02131900
SCTOUTNM DS    CL8    THE SYSTEM OUTPUT PROGRAM NAME                    02142400
SCTOUTNO DS    CL4    THE FORM NUMBER OF THE CARD OR PAPER             +02152900
                      STOCK TO BE USED WHEN THIS DATA SET IS           +02163400
                      PUNCHED OR PRINTED                                02173900
SCTOUTPN DS    CL1    THE SYSTEM OUTPUT CLASS NAME                      02184400
*                                                                       02194900
SIOTBYT4 DS    CL1    SIOT INDICATORS BYTE 4                   @G32HPPJ 02205400
SIOTPROT EQU   128    BIT 0 - PROTECT SPECIFIED ON DD          @G32HPPJ 02216000
SIOTRACD EQU   64     BIT 1 - PROTECT OK IF ALLOC TO DASD      @G32HPPJ 02232000
SIOTRACT EQU   32     BIT 2 - PROTECT OK IF ALLOC TO TAPE      @G32HPPJ 02248000
SIOTGPRV EQU   16     BIT 3 - INDICATES THAT SCTANAME CONTAINS AN SVA  +02249300
                              WHICH IS USED TO FIND A PREVIOUSLY       +02250600
                              GENERATED TEMPORARY DATASET NAME     @P2M 02251900
SIOTHIER EQU   8      BIT 4 - SIOT represents a hierarchical file  @L8C 02253200
SIOTDSQU EQU   4      BIT 5 - Reference via SJF Access routine     @06A 02255800
SIOTUCNT EQU   2      BIT 6 - Reference via SJF Access routine     @03C 02258400
SIOTVCNT EQU   1      BIT 7 - Reference via SJF Access routine     @03C 02261000
*                                                                       02264000
         DS    CL1    Reserved                                     @04C 02277200
SIOTSMS  DS    CL1    STORAGE MANAGEMENT SUBSYSTEM INDICATORS      @L1C 02290400
SIOTSMSM EQU   128    BIT 0 - DATASET IS SMS MANAGED               @LFC 02295600
SIOTSMS1 EQU   64     BIT 1 - Reserved SJF Access (SMS)            @L7C 02300800
SIOTSMS2 EQU   32     BIT 2 - Reserved SJF Access (SMS)            @L7C 02306000
SIOTSMS3 EQU   16     BIT 3 - Reserved SJF Access (SMS)            @L7C 02311200
SIOTSMS4 EQU   8      BIT 4 - Reserved SJF Access (SMS)            @L7C 02316400
SIOTSMS5 EQU   4      BIT 5 - Reserved SJF Access (SMS)            @L7C 02321600
SIOTSMS6 EQU   2      BIT 6 - Reserved SJF Access (SMS)            @L7C 02326800
SIOTSMS7 EQU   1      BIT 7 - Reserved SJF Access (SMS)            @L7C 02332000
*                                                                       02337200
SIOTSWB  DS    CL4    SCHEDULER WORK BLOCK (SWB) STRUCTURE POINTER @H1A 02349000
SIOTASCT DS    0CL4   SVA STRUCTURE OF STEP CONTROL TABLE (SCT)        +02360800
                      FOR THIS STEP                                @L2C 02372600
         DS    CL1      RESERVED                                   @L2C 02384400
SIOTSCT  DS    CL3      SVA OF SCT FOR THIS STEP                   @L2C 02396200
*                                                                       02408000
SIOTALTD DS    CL1    CONDITIONAL DISPOSITION                           02409600
SIOTREDT EQU   128    BIT 0 - Tape redirected to SMS DASD          @07A 02411200
SIOTOPEN EQU   64     BIT 1 - Data set opened in step              @07A 02412800
SIOJCATS EQU   32     BIT 2 - JOB CAT SWITCH USED ONLY BY              +02414400
                              INTERPRETER WHEN READING IN COPIES       +02416000
                              OF CONCATENATED JOBCAT SIOTS      @Y01113 02417600
SIOTNPRV EQU  16      BIT 3 -THIS BIT IS SET AT RESTART TIME   @YA11473 02419200
*                     TO INDICATE THAT THIS DD IS NON-PRIVATE  @YA11473 02420800
*                     EVEN THOUGH IT MAY NOW APPEAR TO BE PRIVATE @AACA 02422400
SIOTAKEP EQU   8      BIT 4 - KEEP DATA SET IF ABEND           @YA11473 02424000
SIOTADEL EQU   4      BIT 5 - DELETE DATA SET IF ABEND         @YA11473 02425600
SIOTACAT EQU   2      BIT 6 - CATALOG DATA SET IF              @YA11473 02427200
*                             ABNORNAL TERMINATION             @YA11473 02428800
SIOTAUNC EQU   1      BIT 7 - UNCATALOG DATA SET IF            @YA11473 02430400
*                             ABNORMAL TERMINATION             @YA11473 02432000
*                                                                       02435000
SIOTSSWA DS    CL3    SVA OF SSWA                              @G29AN2F 02437100
SIOTOUTC DS    CL1    NUMBER OF SYSOUT COPIES TO BE PRINTED     @Y02668 02438200
*                                                                       02438700
SIOTBYT5 DS    CL1    SIOT INDICATOR BYTE 5                    @ZA61887 02439300
SIOTDEFC EQU   128    BIT 0 - INDICATE DEFAULT COPIES WAS SET  @ZA61887 02440400
SIOTDCLA EQU   64     BIT 1 - INDICATE DEFAULT SYSOUT WAS SET      @H1A 02441500
SIOTDDST EQU   32     BIT 2 - INDICATE DEFAULT DEST WAS SET    @YA15130 02441700
SIOTADUN EQU   16     BIT 3 - INDICATE DEFAULT UNITS - SET BY          +02441900
                              DYNALLOC                         @OY20190 02442100
SIOTDYNU EQU   8      BIT 4 - Indicates to SMS that the unit parameter  02442200
*                             in SCTUTYPE is the Dynamic Allocation     02442300
*                             default unit from the Device Allocation   02442400
*                             Defaults Table                       @LCC 02442500
SIOTOVES EQU   4      BIT 5 - When set, it indicates this SIOT is       02442600
*                             associated with an 'overriding' esoteric. 02442700
*                             It is set by IEFAB464 and used by         02442800
*                             IEFAB4A2, IEFAB464, and IEFAB490.    @T1C 02442900
SIOTBLKD EQU   2      BIT 6 - USER SPECIFIED BLKSIZE KEYWORD VALUE,     02443000
*                             SO ALLOCATION SHOULD NOT OVERWRITE        02443100
*                             WITH VALUE IN MODEL DSCB             @01A 02443200
SIOTWTRN EQU   1      BIT 7 - INDICATE PROGRAM NAME IS A WRITER        +02443300
                              NAME                                 @L4A 02443400
*                                                                       02443500
         DS    CL1    Reserved                                     @LAC 02443800
SIOTXSVA DS    CL3    SIOT Extension block (SIOTX) SVA             @LGC 02443900
*                                                                       02444000
SIOTSMSF DS    CL1    STORAGE MANAGEMENT SUBSYSTEM INDICATORS      @04M 02444100
SIOTUSEQ EQU   128    BIT 0 - Reserved SJF Access (SMS)            @04M 02444200
SIOTULAB EQU   64     BIT 1 - Reserved SJF Access (SMS)            @04M 02444300
SIOTUTRT EQU   32     BIT 2 - Reserved SJF Access (SMS)            @04M 02444400
SIOTTRTD EQU   16     BIT 3 - Reserved SJF Access (SMS)            @04M 02444500
SIOTKEYD EQU   8      BIT 4 - Reserved SJF Access (SMS)            @04M 02444600
SIOTRESL EQU   4      BIT 5 - Reserved SJF Access (SMS)            @LDA 02444700
SIOTDUPV EQU   2      BIT 6 - Duplicate Volume support for JES3         02444810
*                             Updated via SJF key '8530'X          @0DC 02444820
*        EQU   1      BIT 7 - Reserved                             @0DA 02444830
*                                                                       02444900
SIOTBYT2 DS    CL1    MVM INDICATOR BYTE                        @Y02670 02445000
SIOTDMND EQU   128    BIT 0 - INDICATES SPECIFIC UNIT REQ MADE  @Y02670 02445100
SIOTDSPD EQU   64     BIT 1 - DISP FOR THIS DATA SET HAS BEEN          +02445300
                              PROCESSED                         @Y02670 02445700
SIOTGALL EQU   32     BIT 2 - SIOT IS PART OF GDG ALL REQUEST   @Y02670 02446100
SIOTCALC EQU   16     BIT 3 - DATA SET CATLGD WHEN ALLOC'D      @Y02670 02446500
SIOTCNEW EQU   8      BIT 4 - ORIG ALLOC'D STAT OF NEW CONVRTD  @Y02670 02446900
SIOTCVOL EQU   4      BIT 5 - SIOT REPRESENTS AN OS CVOL       @YM03576 02447300
SIOTSACP EQU   2      Bit 6 - When on, indicates that message cells    +02447400
                      pointed to by SIOTAMSG for this request have     +02447500
                      been moved to the Allocation 'SC1B4 AB490' Cell  +02447600
                      Pool.                                            +02447700
                    - This flag is set in IEFAB490 and then checked    +02447800
                      and reset in IEFDB4A1 when the cells are FREEd.  +02447900
                                                                   @08C 02448000
SIOTPTTS EQU   1      BIT 7 - When on, indicates that we are           +02448600
                      'Processing This Tape Siot' in Recovery          +02449200
                      Allocation.                                      +02449800
                    - This flag is set in IEFAB48A, checked in         +02450400
                      IEFAB489 and is never reset.                 @09C 02451000
*                                                                       02451600
SIOTSSNM DS    CL4    NAME OF SUBSYSTEM TO PROCESS DATASET      @Y02670 02452300
SIOTSTMT DS    CL4    JCL STATEMENT NUMBER CORRESPONDING TO            +02456100
                      THIS DD STATEMENT                            @L1C 02459900
SIOTSIOX DS    A      SIOT Extension block (SIOTX) virtual address @LGC 02462700
SIOTAMSG DS    CL4    - Pointer to the first Allocation message cell   +02465600
                        in any one of the following message Cell Pools,+02466100
                        'IGDMCSCG MSG CELL POOL', or 'ALLOCATION ERROR +02466600
                        MESSAGE', or 'SC1B4 AB490'.                    +02467100
                      - If SIOTSACP is on, the message cell(s) for     +02467600
                        this request have been moved from either of    +02468100
                        of the first two Cell Pools into the 'SC1B4    +02468600
                        AB490' Cell Pool.                          @08C 02469100
         DS    CL2    Reserved                                     @LAC 02470400
SCTANAME DS    0CL8   &NAME FROM DSNAME=                           @L5C 02472500
         DS    CL2    DEFINES THE REST OF THE SCTANAME FIELD       @L5A 02473700
SIOPGSVA DS    CL3    THIS FORM CONTAINS THE SVA OF A JFCB WITH A      +02474900
                      PREVIOUSLY GENERATED TEMPORARY DATASET NAME. @L5A 02476100
         DS    CL3    DEFINES THE REST OF THE SCTANAME FIELD       @L5A 02477300
SIOTRSNC DS    CL2    ERROR CODE                                @Y02670 02478900
SIOTDDWA DS    CL4    Virtual address of the IEFZDDWA which is          02481400
*                     valid only during allocation                 @L7C 02483900
SIOTEDLP DS    CL4    EDL POINTER                               @Y02670 02486500
SIOTDDIB DS    A      Pointer to DDIB block used by Allocation to      +02488400
                      contain the path name for a hierarchical         +02490300
                      file (OpenMVS path name)                     @P4C 02492200
SIOTPSVA DS    CL4    SVA OF PASSING SIOT                      @ZA52570 02494100
SIOTETIO DS    CL4    ETIOT ENTRY                               @Y02670 02497900
SIOTNPTR DS    CL4    VIRTUAL ADDRESS OF NEXT SIOT              @Y02670 02501700
SJFCBPTR DS    CL4    VIRTUAL ADDRESS OF JFCB                   @Y02670 02505500
SIOTJFX  DS    CL4    VIRTUAL ADDRESS OF JFCBX                  @Y02670 02509300
SIOTVMVP DS    CL4    VOLUME MNT AND VERIFY REQUEST             @Y02670 02513100
         DS    CL2    Reserved                                     @LAC 02516900
SIOVDSNT DS    CL2    OFFSET INTO DSNT FOR VOL REF TO A                +02520700
                      DATA SET NAME                             @Y02670 02524500
SIOVDSNL DS    CL1    LENGTH OF DATA SET NAME OF VOL REF TO A          +02528300
                      DATA SET NAME                             @Y02670 02532100
SIODDSNL DS    CL1    LENGTH OF DATA SET NAME OF DCB REF TO A          +02535900
                      DATA SET NAME                             @Y02670 02539700
         DS    CL6    TO MAKE 180(SIOT)                                 02543500
SIOTLGTH EQU   174    LENGTH OF SIOT                                    02547300
         DS    CL4    HDR(INTERPRETER ONLY)                             02551100
JFCBID   EQU   28                                               @Y02670 02554900
         MEND                                                           02560000
  */ %   SIOTBSL: ;                                                     03260000
  DECLARE 1 INDMSIOT BDY(DWORD) BASED(SIOTPTR),  /* NAME OF TABLE */    03960000
     4 SIOTDSKA PTR(24) BDY(WORD),  /* SVA OF SIOT                */    04660000
     4 SIOTTYPE CHAR(1),  /* TABLE ID OF SIOT = 3 */                    05360000
     4 SCTDDNAM CHAR(8),  /* DD NAME */                                 06060000
     4 SIOTDEST CHAR(8),  /* USER ID FOR SYSOUT               @Y02668*/ 06110000
     4 SCTUSADD FIXED(15), /* INT. DD NO. FOR UNIT AFF.REQ    @Y02668*/ 06160000
        6 SIOTUNAF FIXED(15),                             /*  @Y02670*/ 06210000
     4 SIODSNTE FIXED(16), /* DSNT OFFSET FOR DCB REF TO DS  @YA01081*/ 06260000
     4 SIOTVLSP FIXED(15), /* VOL SEP DD NO.                 @G24LPSJ*/ 06310000
     4 SIOTAFID FIXED(15), /* AFFINITY ID ASSOCIATION WITH              06360000
                              MULTI-UNIT/GENERIC REQUEST      @Y02668*/ 06410000
     4 SCTPSIOT PTR(24) BDY(WORD), /* SVA OF NEXT SIOT */               06460000
     4    *     CHAR(1),  /* RESERVED FOR FUTURE USE */                 08860000
     4 SCTPJFCB PTR(24) BDY(WORD),  /* SVA OF JFCB   */                 09560000
     4    *     CHAR(1),  /* RESERVED FOR FUTURE USE */                 10260000
     4 SIOTVRSB PTR(24) BDY(WORD),  /*  SVA OF SIOT FOR VOLREF          10960000
                                   OR SUBALLOCATE */                    11660000
     4 SIOTOTUN FIXED(8), /* NO. OF UNITS FOR THIS SIOT       @Y02670*/ 11710000
     4 SIOTREFN FIXED(15), /* DD NO. OF INTRA STEP VOL REF    @Y02670*/ 11760000
     4 *        FIXED(8),  /* Reserved                           @L9C*/ 11810000
     4 SIOTBYT1 BIT(8), /* MVM INDICATORS                     @Y02670*/ 11860000
        6 SIOTOCKP BIT(1), /* DATA SET OPEN AT LAST                     11910000
                              CHECKPOINT                      @Y02641*/ 11960000
        6 SIOTHOLD BIT(1), /* SYSOUT DATA SET TO BE PLACED              12010000
                              ON THE HOLD QUEUE               @Y02670*/ 12060000
        6 SIOVAMDS BIT(1), /* VAM DATA SET                    @Y02670*/ 12110000
        6 SIODUNAL BIT(1), /* DS HAS BEEN DYNAM. UNALLOC      @Y02670*/ 12160000
        6 SIOTDADR BIT(1), /* DADSM IS REQUIRED               @Y02670*/ 12210000
        6 SIODADSM BIT(1), /* DADSM WAS SUCCESSFUL            @Y02670*/ 12260000
        6 SIOTALCD BIT(1), /* THIS SIOT IS COMPLETED ALLOC    @Y02670*/ 12310000
        6 SIOTDDNT BIT(1), /* IN TSO, COMMAND PROCESSOR SVC             12360000
                              MUST PUT DDNAME IN DDNT         @Y02668*/ 12410000
     4 SCTDDINO FIXED(15), /* INTERNAL NUMBER OF DD STMT      @Y02940*/ 12460000
     4 SIOTBYT3 BIT(8), /* ALLOCATION INDICATOR BYTE         @YM03582*/ 12510000
        6 SIOALIAS BIT(1), /* ALIAS EXISTS FOR THIS DATA SET @YM03582*/ 12560000
        6 SIOCDEVT BIT(1), /* DEVICE TYPE FOR THIS DS OBTAINED          12610000
                              FROM CATALOG                   @YM03582*/ 12660000
        6 SIOTJES3 BIT(1), /* DEVICES FOR THIS ALLOCATION               12710000
                              SELECTED BY JES3                @Y02668*/ 12760000
        6 S3400OFF BIT(1), /* INITIALIZE S3400DSP TO OFF     @ZA13854*/ 12810000
        6 SIOTDSID BIT(1), /* ON FOR DSID KEYWORD            @ZA20610*/ 12860000
        6 SIOUCVTD BIT(1), /* On when unit name conversion has          12885000
                              been done.                                12910000
                              Also refer to SIOUCNVT.            @LBC*/ 12935000
        6 SIOTDSOP BIT(1), /* On when dataset has been opened.   @P5C*/ 12985000
        6 SIOTHLD  BIT(1), /* HOLD= WAS SPECIFIED FOR THIS              13110000
                              ALLOCATION                         @02C*/ 13160000
     4 SIOTTSTC BIT(8),           /* INDIC FOR TSO & TCAM            */ 15860000
        6 SIOTINFC BIT(1),        /* SIOT INF CODE INDIC     @G24LPSJ*/ 15910000
        6 SIOTTERM BIT(1),        /* TSO TERMINAL (DD TERM=TS)          17960000
                                   SET BY IEFVDA                     */ 18660000
        6    *     BIT(1),        /* RESERVED FOR FUTURE USE @G29AN2F*/ 18710000
        6 SIOTSSGP BIT(1),        /*GROUP SS REQUEST(SUBSYS) @G29AN2F*/ 18760000
        6 SIOTSSMG BIT(1),        /*SUBSYSTEM ERROR MSG IND. @G29AN2F*/ 18810000
        6 SIOTTRKM BIT(1),        /*XB609 SETS FOR AB427 WHEN DYNAMIC   18860000
                                                             @ZA06466*/ 18910000
        6 SIOTDSNM BIT(1),        /*SYSOUT DSDR FOUND ON CHECKPOINT     18960000
                                     DS                      @ZA06466*/ 19010000
        6 SIOTQNAM BIT(1),        /* TCAM - ON IF QNAME= ON DD STMT     22160000
                                   SET BY IEFVDA, CHECKED BY ALLOC.  */ 22860000
     4 SCTSPOOL CHAR(1),  /* INTERNAL NO. OF POOL DD */                 23560000
     4 SCTVOLCT FIXED(8), /* NUMBER OF VOLUMES FOR THIS DS    @Y02670*/ 23610000
     4 *        PTR(15),   /* Reserved                           @L9C*/ 23660000
     4 SIOTBYT0 BIT(8), /* FOR EXTENDED ALLOCATION            @Y02670*/ 23710000
        6 SIOTSSDS BIT(1), /*DS WILL BE PROC. BY A SUBSYSTEM  @Y02668*/ 23760000
        6 SIOTDYAL BIT(1), /*DATA SET DYNAMICALLY ALLOCATED   @Y02641*/ 23810000
        6 SIOTCRIJ BIT(1), /*Data set was created in this job    @0AC*/ 23827000
        6 SIOTWOWO BIT(1), /* Who Owns, We Own flag.  When on,          23844000
                              it indicates that this is a Dynamic       23861000
                              Allocation that is Demanding an ATL       23878000
                              device that is already allocated to       23895000
                              this job.                                 23912000
                            - This flag is set by IEFAB452 and then     23929000
                              checked by IEFAB42B and IEFAB424 to       23946000
                              avoid failing the subject Request. @0BC*/ 23963000
        6 SIOTDDSP BIT(1), /* Value in SCTSDISP was defaulted.          23971600
                              Set by IEFAB459.  Checked by              23980200
                              IEFAB4A2.                          @0CC*/ 23988800
        6 SIOTNOPV BIT(1), /*USE ATTR.  MADE PRIV.            @Y02670*/ 23997500
        6 SIOTPUPV BIT(1), /*USE ATTR. CHANGED FROM PUBLIC TO           24035000
                             PRIVATE                          @Y02670*/ 24072500
        6 *        BIT(1), /* Not used and available.            @L9C*/ 24122500
     4 SCTNMBUT CHAR(1),  /* NUMBER OF UNITS FOR THE DATA SET        */ 26360000
     4 SIOTVLCT CHAR(1),  /* VOLUME COUNT */                            27060000
     4 SCTSDISP BIT(8),   /* SCHEDULER DISPOSITION */                   27760000
        6 SIOTRETN BIT(1),  /* RETAIN BIT                    @ZD03010*/ 28460000
        6 S3400DSP BIT(1),  /* DISP PROCESSING OF DS ON ASPEN @Y02670*/ 28510000
        6 SIOTPRIV BIT(1),  /* PRIVATE VOLUME                @YA11473*/ 28560000
        6 SIOTPASS BIT(1),  /* PASS DATA SET */                         30560000
        6 SIOTKEEP BIT(1),  /* KEEP DATA SET */                         31260000
        6 SIOTDLET BIT(1),  /* DELETE DATA SET  */                      31960000
        6 SIOTCTLG BIT(1),  /* CATALOG DATA SET */                      32660000
        6 SIOTUNCT BIT(1),  /* UNCATALOG DATA SET */                    33360000
     4 SCTSBYT1 BIT(8),   /* INDICATOR BYTE 1 */                        34060000
        6 SCTDUMMY BIT(1),  /* DUMMY DATA SET */                        34760000
        6 SCTSYSIN BIT(1),  /* SYSIN DATA SET */                        35460000
        6 SIOTCCAT BIT(1), /* BLANK DD NAME - CONCATENATION   @Y02668*/ 36160000
        6 SIOTGDSN BIT(1), /* GENERATED DATA SET NAME         @Y02668*/ 36860000
        6 SIOTQDSN BIT(1), /* QUALIFIED DATA SET IS SPECIFIED @Y02668*/ 37560000
        6 SCTPARLM BIT(1),  /* PARALLEL MOUNT */                        38260000
        6 SCTUNAFF BIT(1),  /* UNIT AFFINITY */                         38960000
        6 SIOTJSCT BIT(1), /* SIOT ASSOC. WITH JOBCAT/STEPCAT @Y02668*/ 39660000
     4 SCTSBYT2 BIT(8),   /* INDICATOR BYTE 2 */                        40360000
        6 SIOCLUNL BIT(1), /* CLOSE SHOULD DYNAM UNALLOC DS   @Y02668*/ 41060000
        6 SIOTCATL BIT(1), /* DATA SET IS A CATALOG          @YM03553*/ 41760000
        6 SCTVOLAF BIT(1),  /* VOLUME AFFINITY */                       42460000
        6 SCTJOBLB BIT(1),  /* JOBLIB DD STATEMENT */                   43160000
        6 SCTUNLBD BIT(1),  /* NO LABEL */                              43860000
        6 SCTLABEL BIT(1),  /* NON-STANDARD LABEL */                    44560000
        6 SCTDEFER BIT(1),  /* DEFER MOUNTING */                        45260000
        6 SCTRECVD BIT(1),  /* RECEIVED DATA SET */                     45960000
     4 SCTSBYT3 BIT(8),   /* INDICATOR BYTE 3 */                        46660000
        6 SCTDSNRF BIT(1),  /* VOLUME REFERENCE IS DSNAME */            47360000
        6 SCTSYSNE BIT(1),  /* SYSIN EXPECTED (PROCS ONLY) */           48060000
        6 SCTALCHK BIT(1), /* THIS SIOT ALLOCD AT LAST CHKPT @ZA09426*/ 48760000
        6 SCTVREF  BIT(1),  /* VOLUME REFERENCE IN STEP      @YM05425*/ 49460000
        6 SCTSYSOU BIT(1),  /* SYSOUT IS SPECIFIED */                   50160000
        6 SCTSNEW BIT(1),  /* NEW DATA SET */                           50860000
        6 SCTSMOD BIT(1),  /* MODIFIED DATA SET */                      51560000
        6 SCTSOLD BIT(1),  /* OLD DATA SET */                           52260000
     4 SCTSBYT4 BIT(8),   /* INDICATOR BYTE 4 */                        52960000
        6 SCTSGDGS BIT(1),  /* GDG SINGLE */                            53660000
        6 SIOTGDGA BIT(1),  /*THIS IS A GENERATED SIOT        @Y02670*/ 54360000
        6 SIOTAFF BIT(1), /* SIOT AFFINITY INDICATOR         @ZA33579*/ 55060000
        6 SIOTASCI BIT(1),         /* USASCII TAPE LABEL                55760000
                                   SET BY IEFVDA, TEST BY IEFWA000 */   56460000
        6 SIOTSTEP BIT(1),  /* STEP PROCESSED */                        57160000
        6 SIOTVAFF BIT(1),  /* INTRA-STEP VOLUME AFFINITY */            57860000
        6 SIOTIPDI BIT(1),  /* DATA SET IS IN PDI             @Y02670*/ 58560000
        6 SIOTOMN BIT(1),  /* OLD (MOD) INDICATOR */                    59260000
     4 SCTUTYPE CHAR(8) BDY(WORD),                         /* @Y02670*/ 59310000
        6 SIOTDEVT CHAR(4), /* DEVICE TYPE                    @Y02670*/ 59360000
           8 SIOUBYT1 BIT(8),                              /* @Y02670*/ 59410000
           8 SIOUBYT2 BIT(8),                              /* @Y02670*/ 59460000
           8 SIOUBYT3 BIT(8), /* DEVICE CLASS                 @Y02670*/ 59510000
              10 SIO3TAPE BIT(1), /* TAPE DEVICE              @Y02670*/ 59560000
              10 SIO3COMM BIT(1), /* COMMUNICATIONS DEVICE    @Y02670*/ 59610000
              10 SIO3DACC BIT(1), /* DIRECT ACCESS DEVICE     @Y02670*/ 59660000
              10 SIO3DISP BIT(1), /*GRAPHICS DEVICE           @Y02670*/ 59710000
              10 SIO3UREC BIT(1), /* UNIT RECORD DEVICE       @Y02670*/ 59760000
              10   *      BIT(3),                          /* @Y02670*/ 59810000
           8 SIOUBYT4 BIT(8),                              /* @Y02670*/ 59860000
        6 SIOUCBA4 PTR(31),   /* UCB address (4-bytes)           @LBA*/ 59910000
           8 SIOUCNVT CHAR(1), /* IF = X'FF' SIOUCBAD is an SVA,        59960000
                                  IF = X'00' Unit name conversion       60010000
                                             has been done.             60060000
                                  Also refer to flag SIOUCVTD.   @LBC*/ 60110000
           8 SIOUCBAD PTR(24) BDY(WORD,2), /* 3-byte UCB address or     60260000
                             SVA for UNIT=AFF                    @LBC*/ 60310000
     4 SCTOUTNM CHAR(8),  /* SYSTEM OUTPUT PROGRAM NAME */              63460000
     4 SCTOUTNO CHAR(4),  /* SYSTEM OUTPUT FORM NUMBER */               64160000
     4 SCTOUTPN CHAR(1),  /* SYSOUT CLASS NAME */                       64860000
     4 SIOTBYT4 BIT(8),   /*                                 @G32HPPJ*/ 64910000
       6 SIOTPROT BIT(1), /* PROTECT SPECIFIED ON DD         @G32HPPJ*/ 64960000
       6 SIOTRACD BIT(1), /* PROTECT OK IF ALLOCATED TO DASD @G32HPPJ*/ 65010000
       6 SIOTRACT BIT(1), /* PROTECT OK IF ALLOCATED TO TAPE @G32HPPJ*/ 65060000
       6 SIOTGPRV BIT(1), /* INDICATES THAT SCTANAME CONTAINS AN SVA    65080000
                             WHICH IS USED TO FIND A PREVIOUSLY         65100000
                             GENERATED TEMPORARY DATASET NAME    @P2M*/ 65120000
       6 SIOTHIER BIT(1), /* SIOT represents a hierarchical file @L8C*/ 65126600
       6 SIOTDSQU BIT(1), /* Indicates that the data set name was       65129900
                             specified in quotes - referenced           65133200
                             via SJF Access                      @06A*/ 65136500
       6 SIOTUCNT BIT(1), /* Reference via SJF Access routine    @03A*/ 65140000
       6 SIOTVCNT BIT(1), /* Reference via SJF Access routine    @03A*/ 65150000
     4 *        CHAR(1),  /* Reserved                            @04C*/ 65163300
     4 SIOTSMS   BIT(8),  /* STORAGE MANAGEMENT SUBSYTEM INDICATORS     65176600
                                                                 @L1C*/ 65193200
        6 SIOTSMSM BIT(1), /* BIT 0 - DATASET IS SMS MANAGED     @LFC*/ 65213300
        6 SIOTSMS1 BIT(1), /* BIT 1 - Indicate KEYLEN was specified     65233400
                                                                 @L7C*/ 65240400
        6 SIOTSMS2 BIT(1), /* BIT 2 - Indicate LRECL was specified      65247400
                                                                 @L7C*/ 65254400
        6 SIOTSMS3 BIT(1), /* BIT 3 - Indicate RKP was specified @L7C*/ 65261400
        6 SIOTSMS4 BIT(1), /* BIT 4 - Indicate SPACE related            65268400
                                      information was specified  @L7C*/ 65275400
        6 SIOTSMS5 BIT(1), /* BIT 5 - Indicate UNIT related             65282400
                                      information was specified  @L7C*/ 65289400
        6 SIOTSMS6 BIT(1), /* BIT 6 - Indicate VOLUME related           65296400
                                      information was specified  @L7C*/ 65303400
        6 SIOTSMS7 BIT(1), /* BIT 7 - Indicate the request is for       65310400
                                      an SMS-managed mountable          65317400
                                      device                     @L7C*/ 65324400
     4 SIOTSWB PTR(31) BDY(WORD), /* SCHEDULER WORK BLOCK(SWB)          65332800
                                     STRUCTURE POINTER           @H1C*/ 65346100
     4 SIOTASCT,            /* SVA STRUCTURE OF STEP CONTROL TABLE      65360000
                               FOR THIS STEP                     @L2C*/ 65410000
        6 *        CHAR(1), /* RESERVED                          @L2C*/ 65460000
        6 SIOTSCT  PTR(24), /* SVA OF SCT FOR THIS STEP          @L2C*/ 65510000
                            /*                                   @L1D*/ 65560000
     4 SIOTALTD BIT(8),     /* CONDITIONAL DISPOSITION */               65610000
        6 SIOTREDT BIT(1),  /* Tape redirected to SMS DASD       @07A*/ 65660000
        6 SIOTOPEN BIT(1),  /* Data set opened in step           @07A*/ 65710000
        6 SIOJCATS BIT(1),  /* JOBCAT SWITCH USED ONLY BY               65760000
                               INTERPRETER WHEN READING IN              65810000
                               COPIES OF CONCATENATED JOBCAT            65860000
                               SIOTS                          @Y01113*/ 65910000
        6 SIOTNPRV BIT (1), /* NOT PRIVATE ( RESTART )               */ 65960000
        6 SIOTAKEP BIT(1),  /* KEEP DATA SET                         */ 66010000
        6 SIOTADEL BIT(1),  /* DELETE DATA SET                       */ 66060000
        6 SIOTACAT BIT(1),  /* CATALOG DATA SET                      */ 66110000
        6 SIOTAUNC BIT(1),  /* UNCATALOG DATA SET                    */ 66160000
     4 SIOTSSWA PTR(24), /*SVA OF SSWA                       @G29AN2F*/ 75410000
     4 SIOTOUTC CHAR(1), /*NO. OF SYSOUT COPIES TO BE PRINTED @Y02668*/ 75460000
     4 SIOTBYT5 BIT(8),  /* INDICATORS                       @ZA61887*/ 75510000
       6 SIOTDEFC BIT(1),/* INDICATES DEFAULT COPIES WAS SET @ZA61887*/ 75560000
       6 SIOTDCLA BIT(1),/* INDICATES DEFAULT SYSOUT WAS SET     @H1A*/ 75610000
       6 SIOTDDST BIT(1),/* INDICATES DEFAULT DEST WAS SET   @YA15130*/ 75624200
       6 SIOTADUN BIT(1),/* INDICATES DEFAULT UNIT. SET BY              75638400
                            DYNAMIC ALLOCATION               @OY20190*/ 75652600
       6 SIOTDYNU BIT(1),/* Indicates to SMS that the UNIT parameter    75655700
                            in SCTUTYPE is the Dynamic Allocation       75658800
                            default unit from the Device Allocation     75660500
                            Defaults Table                       @LCC*/ 75662200
       6 SIOTOVES BIT(1),           /* When set, it indicates this      75663900
                                       SIOT is associated with an       75665900
                                       'overriding' esoteric.  It is    75667900
                                       set by IEFAB464 and used by      75669900
                                       IEFAB4A2, IEFAB464, and          75671900
                                       IEFAB490.                 @T1A*/ 75673900
       6 SIOTBLKD BIT(1),/* USER SPECIFIED BLKSIZE KEYWORD VALUE,       75675900
                            SO ALLOCATION SHOULD NOT OVERWRITE WITH     75677500
                            VALUE FROM MODEL DSCB                @01A*/ 75679100
       6 SIOTWTRN BIT(1),/* INDICATES PROGRAM NAME IS A WRITER          75681000
                            NAME                                 @L4A*/ 75695200
     4 *        FIXED(8), /*Reserved                             @L9C*/ 75745200
     4 SIOTXSVA CHAR(3),  /* SIOT Extension block (SIOTX) SVA           75765200
                             Set by:  IEFVDA, IEFDB414, IEFDB402        75785200
                             Used by: IEFDB413, IEFAB428, IEFAB4FE      75805200
                                      IEFDB418, IEFAB428         @LGC*/ 75825200
     4 SIOTSMSF BIT(8),   /* Flags used by SJF Access to return data    75845200
                             to SMS                              @04M*/ 75895200
       6 SIOTUSEQ BIT(1), /* User specified data set sequence nunber    75945200
                                                                 @04M*/ 75995200
       6 SIOTULAB BIT(1), /* User specified label type           @04M*/ 76045200
       6 SIOTUTRT BIT(1), /* User specified data for TRTCH       @04M*/ 76095200
       6 SIOTTRTD BIT(1), /* TRTCH data present in JFCB field           76145200
                             JFCTRTCH which is doubly defined           76195200
                             with JFCB field JFCKEYLE            @04M*/ 76245200
       6 SIOTKEYD BIT(1), /* Keylen data present in JFCB field          76295200
                             JFCKEYLE which is doubly defined           76345200
                             with JFCB field JFCTRTCH            @04M*/ 76395200
       6 SIOTRESL BIT(1), /* Set on by SMS when they have completed     76417700
                             determining the request type (i.e., SMS    76440200
                             tape, SMS DASD, non-SMS tape, non-SMS      76462700
                             DASD).  Checked by Allocation.      @LHC*/ 76485200
       6 SIOTDUPV BIT(1), /* Duplicate volume support for JES3          76517690
                             Updated via SJF key '8530'X         @0DC*/ 76527680
       6 *        BIT(1), /* Reserved                            @04M*/ 76545200
     4 SIOTBYT2 BIT(8),  /* MORE MVM INDICATORS               @Y02670*/ 76595200
        6 SIOTDMND BIT(1), /* BIT 0 - SPECIFIC UNIT REQUEST             78942600
                                      MADE                    @Y02670*/ 78975200
        6 SIOTDSPD BIT(1), /* BIT 1 - DISP FOR THIS DATA SET            79007800
                                      HAS BEEN PROCESSED      @Y02670*/ 79040400
        6 SIOTGALL BIT(1), /* BIT 2 - SIOT IS PART OF A GDG             79073000
                                      ALL REQUEST             @Y02670*/ 79105600
        6 SIOTCALC BIT(1), /* BIT 3 -  DATA SET CATALOGED               79138200
                                       WHEN ALLOCATED         @Y02670*/ 79170800
        6 SIOTCNEW BIT(1), /* BIT 4 - ORIG ALLOCATEDD STATE OF          79203400
                                      NEW CONVRERTED          @Y02670*/ 79236000
        6 SIOTCVOL BIT(1), /* BIT 5 - SIOT IS FOR OS CVOL    @YM03576*/ 79268600
        6 SIOTSACP BIT(1), /* Bit 6 - When on, indicates that message   79275900
                              cells pointed to by SIOTAMSG for this     79283200
                              request have been moved to the Allocation 79290500
                              'SC1B4 AB490' Cell Pool.                  79297800
                            - This flag is set in IEFAB490 and then     79305100
                              checked and reset in IEFDB4A1 when the    79312400
                              cells are FREEd.                   @08C*/ 79319700
        6 SIOTPTTS BIT(1), /* BIT 7 - When on, indicates that we are    79321800
                              'Processing This Tape Siot' in Recovery   79323900
                              Allocation.                               79326000
                            - This flag is set in IEFAB48A, checked     79328100
                              in IEFAB489 and is never reset.    @09A*/ 79330200
                                                                        79332300
     4 SIOTSSNM CHAR(4), /* NAME OF SUBSYSTEM TO PROCESS DS   @Y02670*/ 79335000
     4 SIOTSTMT FIXED(32), /* JCL STATEMENT NUMBER CORRESPONDING TO     79360000
                              THIS DD STATEMENT                  @L1C*/ 79385000
     4 SIOTSIOX PTR(31),   /* SIOT Extension block pointer              79404200
                             Set by:  IEFVDA, IEFDB414, IEFDB402 @LGC*/ 79423400
     4 SIOTAMSG PTR(31),            /* Pointer to the first Allocation  79442800
                                       message cell in any one of the   79447200
                                       following message Cell Pools,    79451600
                                       'IGDMCSCG MSG CELL POOL', or     79456000
                                       'ALLOCATION ERROR MESSAGE', or   79460400
                                       'SC1B4 AB490'.                   79464800
                                     - If SIOTSACP is on, the message   79469200
                                       cell(s) for this request have    79473600
                                       been moved from either of the    79478000
                                       first two Cell Pools into the    79482400
                                       'SC1B4 AB490' Cell Pool.  @08C*/ 79486800
     4 *        FIXED(15), /* Reserved                           @L9C*/ 79491800
     4 SCTANAME CHAR (8),  /* &NAME FROM DSNAME=                 @L5C*/ 79510000
       6 *        CHAR(2), /* ALLOW CORRECT BASING FOR SIOPGSVA  @L5A*/ 79560000
       6 SIOPGSVA CHAR(3),  /* CONTAINS THE SVA OF A JFCB WITH A        79610000
                               PREVIOUSLY GENERATED TEMPORARY           79660000
                               DATASET NAME.                     @L5A*/ 79710000
       6 *        CHAR(3), /* ALLOW CORRECT BASING FOR SIOPGSVA  @L5A*/ 79760000
     4 SIOTRSNC FIXED(15), /* ERROR CODE                      @Y02670*/ 80310000
     4 SIOTDDWA PTR(31),   /* Virtual address of the IEFZDDWA           80335000
                              which is valid only during                80360000
                              allocation                         @L7C*/ 80385000
     4 SIOTEDLP PTR(31), /* EDL POINTER */                 /* @Y02670*/ 80410000
     4 SIOTDDIB PTR(31),   /* Pointer to DDIB block used by             80430000
                              Allocation to contain the path name       80450000
                              for a hierarchical file (OpenMVS path     80470000
                              name)                              @P4C*/ 80490000
     4 SIOTPSVA PTR(24)  BDY(WORD), /* SVA OF PASSING SIOT   @ZA52570*/ 80510000
     4    *     CHAR(1), /* RESERVED FOR FUTURE USE          @ZA52570*/ 80560000
     4 SIOTETIO PTR(31), /* PTR TO ETIOT ENTRY */          /* @Y02670*/ 80610000
     4 SIOTNPTR PTR(31), /* VIRTUAL ADDRESS OF NEXT SIOT      @Y02670*/ 80660000
     4 SJFCBPTR PTR(31), /* VIRTUAL ADDRESS OF JFCB           @Y02670*/ 80710000
     4 SIOTJFX  PTR(31), /* VIRTUAL ADDRESS OF JFCBX          @Y02670*/ 80760000
     4 SIOTVMVP PTR(31), /* VOLUME MOUNT AND VERIFY REQ       @Y02670*/ 80810000
     4 *        PTR(15), /* Reserved                             @L9C*/ 80860000
     4 SIOVDSNT FIXED(16), /* OFFSET INTO DSNT FOR VOLREF               80910000
                              TO DSNAME                      @YA01081*/ 80960000
     4 SIOVDSNL FIXED(8), /* LEN. OF DSN OF VOL REF TO DSN    @Y02670*/ 81010000
     4 SIODDSNL FIXED(8); /* LEN. OF DSN OF DCB REF TO DSN    @Y02670*/ 81060000
   %DECLARE SIOTID   FIXED,                                             81660000
            DSNID    FIXED,                                             83060000
            JFCBID   FIXED,                                             83760000
            SIOTLGTH FIXED;                                             84460000
  %DSNID=7;                 /* DSNAME TABLE ID = 7 */                   85860000
  %JFCBID=28;               /* JFCB */                                  86560000
  %SIOTLGTH=174;            /* LENGTH OF SIOT */                        87260000
   %SIOTID=3;               /* SIOT ID = 3 */                           87960000
