*  %GOTO AUSPMPRO; /*                                                   00050000
         MACRO                                                          00100000
         IEFAUSPM                                                       00150000
*  */                                                                   00200000
*  %AUSPMPRO:  ;                                                        00250000
*/**START OF SPECIFICATIONS*******************************************/ 00300000
*/* MACRO NAME:  IEFAUSPM                                            */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME:  ASSIGN/UNASSIGN SERVICE PARAMETER LIST        */ 00450000
*/*                                                                  */ 00500000
*/* ACRONYM:  AUSPM                                              @L3A*/ 00550000
*/*                                                                  */ 00600000
*/* DSECT NAME:  AUSPM                                           @L3A*/ 00650000
*/*                                                                  */ 00700000
*/*01* PROPRIETARY_STATEMENT *****************************************/ 00750000
*/**** PROPRIETARY STATEMENT=                                        */ 00800000
*/*                                                                  */ 00850000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00861100
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00872200
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1983, 1994                      */ 00883300
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00894400
*/*                                                                  */ 00905500
*/* STATUS= HBB5520                                                  */ 00916600
*/*                                                                  */ 00927700
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00938800
*/*                                                                  */ 00950000
*/* FUNCTION:  This Assign/Unassign Service Parameter List is        */ 00953200
*/*            used as input to the Assign/Unassign Service      @L3A*/ 00956400
*/*            (IEFAUSRV)                                        @L3A*/ 00959600
*/*                                                                  */ 00962800
*/* COMPONENT: Assign/Unassign (SC144)                           @L3A*/ 00966000
*/*                                                                  */ 00969200
*/* EYE-CATCHER:  None                                           @L3A*/ 00972400
*/*                                                                  */ 00975600
*/* STORAGE ATTRIBUTES:                                          @L3A*/ 00978800
*/*   SUBPOOOL: Caller defined (230 for Allocation, 245 and      @L3A*/ 00982000
*/*             252 for OLTEP, 245 and 252 for IOS)              @L3A*/ 00985200
*/*   KEY: Caller's Key (Key 1 for Allocation, Key 0 for OLTEP   @L3A*/ 00988400
*/*        and IOS)                                              @L3A*/ 00991600
*/*   RESIDENCY:  Any                                            @L3A*/ 00994800
*/*   MAIN STORAGE: No                                           @L3A*/ 00998000
*/*   AUXILIARY STORAGE:  Yes                                    @L3A*/ 01001200
*/*   VIRTUAL STORAGE:  Yes                                      @L3A*/ 01004400
*/*   DATA SPACE:  No                                            @L3A*/ 01007600
*/*                                                                  */ 01010800
*/* SIZE: Version 0 - 24 Bytes, Version 1 - 36 Bytes             @01C*/ 01014000
*/*                                                                  */ 01017200
*/*01* CREATED BY: Allocation (IEFAUINT, IEFAB488, IEFAB429),    @L3A*/ 01020400
*/*                OLTEP, IOS                                    @L3A*/ 01023600
*/*                                                                  */ 01026800
*/* POINTED TO BY:  On entry to IEFAUSRV Register 1 points to    @L3A*/ 01030000
*/*                 the address of this parameter list           @L3A*/ 01033200
*/*                                                                  */ 01036400
*/* DELETED BY: Creators                                         @L3A*/ 01039600
*/*                                                                  */ 01042800
*/* SERIALIZATION:  None                                         @L3A*/ 01046000
*/*                                                                  */ 01050000
*/* INVOCATION =                                                     */ 01100000
*/*                                                                  */ 01150000
*/*   BAL - IEFAUSPM                                                 */ 01200000
*/*                                                                  */ 01250000
*/*   PL/AS - %DCL AUSPMBAS CHAR                                     */ 01300000
*/*          %AUSPMBAS = 'BASED' OR                                  */ 01350000
*/*          %AUSPMBAS = 'BDY(WORD)'                                 */ 01400000
*/*          %INCLUDE SYSLIB(IEFAUSPM)                               */ 01450000
*/*       NOTE: DEFAULT VALUE FOR AUSPMBAS IS 'BDY WORD'             */ 01500000
*/*                                                                  */ 01550000
*/* DISTRIBUTION LIBRARY:  AMACLIB                               @L3A*/ 01558300
*/*                                                                  */ 01566600
*/* EXTERNAL CLASSIFICATION:  NONE                               @L3A*/ 01574900
*/* END OF EXTERNAL CLASSIFICATION:                              @L3A*/ 01583200
*/*                                                                  */ 01591500
*/* CHANGE ACTIVITY: OZ87685                                         */ 01609990
*/*                                                                  */ 01619980
*/*   $H0=3480AU  JBB2125 830420 PDFB: ASSIGN/UNASSIGN               */ 01633300
*/*   $L1=SHRTP   HBB5520 940310 PDN2: SYSPLEX SHARED TAPE       @L1A*/ 01666600
*/*   $L2=SHRTP   HBB5520 940602 PDNN: SYSPLEX SHARED TAPE       @L2A*/ 01683300
*/*   $L3=SHRTP   HBB5520 940728 PDNN: Sysplex Shared Tape       @L3A*/ 01691600
*/*   $01=OW25262 HBB6603 970528 PDRR: Roll Blythe into HBB6605. @01A*/ 01695800
*/*   $02=OW44670 HBB6606 010131 PDHB: Handle Assign Time Out errors.*/ 01696800
*/*                                                              @02A*/ 01697800
*/*                                                                  */ 01700000
*/***END OF SPECIFICATIONS********************************************/ 01717200
*/* IEFAUSPM -C- Added a declare for an Assign Timeout error         */ 01718000
*/*              (AUSPATIO) Return/Reason Code.                  @02A*/ 01718800
*/* IEFAUSPM -C- Added return code AUSPNASG to indicate a device     */ 01719600
*/*              was not assigned.                                   */ 01722000
*/*          -C- Added a control block version number and an         */ 01724400
*/*              optional message buffer token pointer (for Assign)  */ 01726800
*/*              and increased the size of the parameter list to     */ 01729200
*/*              accommodate the new pointer.                    @01A*/ 01731600
*/* IEFAUSPM -C- Updated Prolog for SHOWHDR Compliance           @L3A*/ 01734400
*/* IEFAUSPM -C- ADDED RETURN CODE AUSPNASG AND REASON CODE      @L2A*/ 01751800
*/*              AUSPNELG.                                       @L2A*/ 01753600
*/* IEFAUSPM -C- ADDED FLAG TO INDICATE THAT A REQUEST IS FOR    @L1A*/ 01755500
*/*              AN AUTOMATICALLY SWITCHABLE DEVICE SO THAT      @L1A*/ 01761000
*/*              THE ASSIGN OR UNASSIGN WILL NOT BE DONE.  ALSO  @L1A*/ 01766500
*/*              ADDED A FLAG TO INDICATE THAT A SENSE COMMAND   @L1A*/ 01772000
*/*              SHOULD BE PERFORMED AFTER A SUCCESSFUL ASSIGN   @L1A*/ 01777500
*/*              COMMAND TO GET THE CURRENT ACL STATUS FOR THE   @L1A*/ 01783000
*/*              DEVICE.  FINALLY, ADDED CONSTANTS FOR TWO       @L1A*/ 01788500
*/*              CURRENT RETURN CODES AND ONE NEW REASON CODE.   @L1A*/ 01794000
*/* IEFAUSPM -C- ADDED FLAG AUSPSTAT INDICATING THAT THE     @ZA87685*/ 01800000
*/*              ASSIGNMENT STATUS (UCBMASGN) OF THE DEVICE  @ZA87685*/ 01850000
*/*              IS TO BE SAVED WHEN THE DEVICE IS           @ZA87685*/ 01900000
*/*              UNASSIGNED.                                 @ZA87685*/ 01950000
*  %GOTO AUSPMDCL;                                                      02000000
AUSPM    DSECT          ASSIGN/UNASSIGN PARAMETER LIST                  02050000
         DS    0F                                                       02100000
AUSPFUNC DS    XL1      FUNCTION CODE                                   02150000
AUSPFASN EQU   X'01'    ASSIGN                                          02200000
AUSPFUNA EQU   X'02'    UNASSIGN                                        02250000
AUSPFRST EQU   X'03'    RESTORE ASSIGN                                  02300000
AUSPFBLA EQU   X'04'    BUILD CCW FOR RESTORE ASSIGN                    02350000
AUSPFBLU EQU   X'05'    BUILD CCW FOR UNASSIGN                          02400000
AUSPGPTH DS    CL1      GUARANTEED PATH MASK                            02450000
AUSPLVL  DS    CL1      I/O LEVEL                                       02500000
AUSPVERS DS    CL1      Control Block Version                      @01C 02516600
AUSPCURV EQU   X'01'    Current Version                            @01A 02533200
AUSPVER0 EQU   X'00'    Control Block Version 0                    @01A 02549800
AUSPVER1 EQU   X'01'    Control Block Version 1 - with message     @01A 02566400
*                       buffer token pointer                       @01A 02583000
AUSPUCBP DS    F        ADDRESS OF THE UCB                              02600000
AUSPIDP  DS    F        ADDRESS OF MULTI-SYS ASSIGN ID                  02650000
AUSPCCWP DS    F        INPUT: ADDR OF BUFFER TO CONTAIN OUTPUT         02700000
*                       OUTPUT: ADDR OF ARRAY OF PTRS TO CCW STRING     02750000
*                       NOTE:THE OUTPUT MUST BE DOUBLE WORD ALIGNED     02800000
AUSPBUFL DS    H        LENGTH OF CCW BUFFER                            02850000
AUSPCCW# DS    H        #OF ELEMENTS IN OUTPUT ARRAY                    02900000
AUSPFLGS DS    XL1      FLAGS                                           02950000
AUSPNTIM EQU   X'80'    IF ON, DO NOT SET A TIMER INTERVAL              03000000
AUSPQISC EQU   X'40'    IF ON, DEVICE IS QUIESCED                       03050000
AUSPSTAT EQU   X'20'    IF ON, SAVE ASSIGNMENT STATUS          @ZA87685 03100000
AUSPAUTO EQU   X'10'    IF ON, THIS IS AN AUTOSWITCH DEVICE        @L1A 03116600
AUSPSENS EQU   X'08'    IF ON, PERFORM SENSE FOR THIS DEVICE       @L1A 03133200
AUSPRSN  DS    XL1      REASON CODE                                     03150000
         DS    CL2      Reserved                                   @01A 03158300
AUSPMBUF DS    A        Optional Message Buffer Token Pointer -    @01A 03166600
*                       Assign.  Buffer must be created using      @01A 03174900
*                       IEEMIFSV CREATE.                                03183200
         DS    CL8      Reserved                                   @01A 03191500
AUSPBFSZ EQU   75       BUFFER SIZE REASON CODE                         03200000
AUSPNASG EQU   8        Not Assigned Return Code                   @01A 03204100
AUSPATIO EQU   16       Assign Timed Out.                          @02A 03206100
AUSPFDSE EQU   28       DSE Modeset failure                        @01A 03208200
AUSPASGE EQU   4        ASSIGN ERROR RETURN CODE                   @L1A 03212500
AUSPACLI EQU   2        ACL STATUS INCORRECT REASON CODE           @L1A 03225000
AUSPINCA EQU   8        INCOMPATIBLE ASSIGN RETURN CODE            @L1A 03237500
         DS    H        RESERVED                                        03250000
         MEND                                                           03300000
*  %AUSPMDCL: ;                                                         03350000
*%IF AUSPMBAS='' %THEN                /* DEFAULT IF NOT SET          */ 03400000
*     %AUSPMBAS='BDY(WORD)';                                            03450000
*DCL 1 AUSPM AUSPMBAS,                                                  03500000
*     2 AUSPFUNC BIT(8),           /* FUNCTION CODE                  */ 03550000
*     2 AUSPGPTH CHAR(1),          /* GUARANTEED PATH MASK           */ 03600000
*     2 AUSPLVL  CHAR(1),          /* I/O LEVEL                      */ 03650000
*     2 AUSPVERS CHAR(1),          /* Control Block Version      @01C*/ 03700000
*     2 AUSPUCBP PTR(31),          /* ADDRESS OF UCB                 */ 03750000
*     2 AUSPIDP PTR(31),           /* ADDRESS OF MULTI-SYSTEM           03800000
*                                     ASSIGN ID                      */ 03850000
*     2 AUSPCCWP PTR(31),          /* INPUT: ADDRESS OF BUFFER TO       03900000
*                                     CONTAIN OUTPUT  OUTPUT: ADDRESS   03950000
*                                     OF ARRAY OF PTRS TO CCW STRING    04000000
*                                     FOR BUILD CCW. THE OUTPUT MUST    04050000
*                                     BE DOUBLE WORD ALIGNED         */ 04100000
*     2 AUSPBUFL FIXED(16),        /* LENGTH OF CCW BUFFER           */ 04150000
*     2 AUSPCCW# FIXED(16),        /* # OF ELEMENTS IN OUTPUT ARRAY  */ 04200000
*     2 AUSPFLGS BIT(8),           /* FLAGS                          */ 04250000
*       3 AUSPNTIM BIT(1),         /* IF ON, DO NOT SET A TIME INTVL */ 04300000
*       3 AUSPQISC BIT(1),         /* IF ON, DEVICE IS QUIESCED      */ 04350000
*       3 AUSPSTAT BIT(1),         /* IF ON, SAVE ASSIGNMENT            04400000
*                                     STATUS OF DEVICE       @ZA87685*/ 04450000
*       3 AUSPAUTO BIT(1),         /* IF ON, THIS IS AN AUTOSWITCH      04466600
*                                     DEVICE                     @L1A*/ 04483200
*       3 AUSPSENS BIT(1),         /* IF ON, PERFORM SENSE FOR THIS     04499800
*                                     DEVICE                     @L1A*/ 04516400
*       3 *        BIT(3),         /* RESERVED                   @L1C*/ 04533000
*     2 AUSPRSN  FIXED(8),         /* REASON CODES                   */ 04550000
*     2 *        FIXED(16),        /* Not used and available.    @01C*/ 04562500
*     2 AUSPV1,                    /* Start of Version 1 fields  @01A*/ 04575000
*       3 AUSPMBUF PTR(31),        /* Optional Message Buffer Token     04587500
*                                     Pointer - Assign.  Buffer must    04600000
*                                     be created using IEEMIFSV         04612500
*                                     CREATE                     @01A*/ 04625000
*       3 *        CHAR(8);        /* Reserved                   @01A*/ 04637500
*DCL                               /* FUNCTION CODES                 */ 04650000
*   AUSPFASN BIT(8) CONSTANT('01'X),  /* ASSIGN                      */ 04700000
*   AUSPFUNA BIT(8) CONSTANT('02'X),  /* UNASSIGN                    */ 04750000
*   AUSPFRST BIT(8) CONSTANT('03'X),  /* RESTORE ASSIGN              */ 04800000
*   AUSPFBLA BIT(8) CONSTANT('04'X),  /* BUILD CCW FOR RESTORE ASSIGN*/ 04850000
*   AUSPFBLU BIT(8) CONSTANT('05'X);  /* BUILD CCW FOR UNASSIGN      */ 04900000
*DCL                                                                    04950000
*   AUSPBFSZ FIXED CONSTANT(75);      /* BUFFER SIZE REASON CODE     */ 05000000
*DCL AUSPATIO FIXED(15) CONSTANT(16); /* Assign Timed Out.       @02A*/ 05004000
*DCL AUSPFDSE FIXED(15) CONSTANT(28); /* DSE Modeset failure.    @01A*/ 05008300
*DCL AUSPCURV FIXED(16) CONSTANT(1);  /* Current version.        @01A*/ 05016600
*DCL AUSPVER0 FIXED(16) CONSTANT(0);  /* Version 0               @01A*/ 05024900
*DCL AUSPVER1 FIXED(16) CONSTANT(1);  /* Version 1 - with message       05033200
*                                        buffer token pointer.   @01A*/ 05041500
*DCL AUSPASGE FIXED(15) CONSTANT(4);  /*ASSIGN ERROR RETURN CODE @L1A*/ 05050000
*DCL AUSPACLI FIXED(15) CONSTANT(2);  /*ACL STATUS INCORRECT            05100000
*                                       REASON CODE              @L1A*/ 05150000
*DCL AUSPNASG FIXED(15) CONSTANT(8);  /*NOT ASSIGNED RETURN CODE @L2A*/ 05160000
*DCL AUSPNELG FIXED(15) CONSTANT(2);  /*THIS AS DEVICE NOT ELIGIBLE     05170000
                                        FOR ASSIGN, UNASSIGN OR         05180000
                                        BUILD UNASSIGN CCW       @L2A*/ 05190000
*DCL AUSPINCA FIXED(15) CONSTANT(8);  /*INCOMPATIBLE ASSIGN             05200000
*                                       RETURN CODE              @L1A*/ 05250000
