*        %GOTO DSNTPLS1;               /*                      @ZA03545 00050000
         MACRO                                                          00100000
         IEFDSNT                                                        00150000
* */                                                                    00200000
* %DSNTPLS1: ;                                                          00250000
* /*******************************************************************/ 00300000
* /*                                                           Y02668*/ 00350000
* /*                    DATA SET NAME TABLE                    Y02668*/ 00400000
* /*                                                           Y02668*/ 00450000
* /*                                                                 */ 00454500
* /*  DEPENDENCY = CHANGES TO THIS MACRO SHOULD BE REFLECTED         */ 00459000
* /*               IN IPCS MODEL IEFMDSNT                        @L0A*/ 00463500
* /*                                                                 */ 00468000
* /*                                                                 */ 00472500
* /*  CHANGE ACTIVITY = L0                                       @L0A*/ 00477000
* /*                                                                 */ 00481500
* /*  $L0= DDPERF   HBB4420 900406 PDDS: DDPERFIPCS DD LIMIT         */ 00486000
* /*                                                PERFORMANCE  @L0A*/ 00490500
* /*                                                                 */ 00495000
* /*******************************************************************/ 00500000
* /* A - ADD DEPENDENCY NOTE FOR IPCS CONTROL BLOCK MODEL        @L0A*/ 00516600
* /*                                                                 */ 00533200
*        %GOTO DSNTPLS2;               /*                               00550000
* MACMEAN DSNT MEANS DATA SET NAME TABLE                         Y02668 00600000
* MACCOMP Y-2 SC1B9/PZD83                                      @ZA03545 00650000
* MACSTAT Y-2 75041/ZA03545                                    @ZA03545 00700000
DSNTABLE EQU   *                                                 Y02668 00750000
DSNTSVA  DS    CL3                 SVA OF THIS RECORD            Y02668 00800000
DSNTID   DS    CL1                 TABLE ID                      Y02668 00850000
DSNTTID  EQU   X'07'               TABLE ID X'07'                Y02668 00900000
DSNTNSVA DS    CL3                 SVA OF NEXT RECORD            Y02668 00950000
         DS    CL1                 RESERVED                      Y02668 01000000
DSNENTRY DS    CL168               DATA SET NAMES                Y02668 01050000
DSNTBLN  EQU   DSNTABLE+168                                      Y02668 01100000
DSNTLN   EQU   DSNTABLE+176                                      Y02668 01150000
         MEND ,  */                                                     01200000
* %DSNTPLS2: ;                                                          01250000
*                                                                       01300000
* /* MACMEAN DSNT MEANS DATA SET NAME TABLE                   Y02668 */ 01350000
* /* MACCOMP Y-2 SC1B9/PZD83                                @ZA03545 */ 01400000
* /* MACSTAT Y-2 75041/ZA03545                              @ZA03545 */ 01450000
* DCL                                                                   01500000
*   1 DSNTABLE CHAR(176) BASED(DSNTPTR) BDY(WORD), /*DSN TABLE Y02668*/ 01550000
*     2 DSNTSVA CHAR(3),           /* SVA OF THIS RECORD       Y02668*/ 01600000
*     2 DSNTID CHAR(1),            /* TABLE ID                 Y02668*/ 01650000
*     2 DSNTNSVA CHAR(3) BDY(WORD), /* SVA OF NEXT RECORD      Y02668*/ 01700000
*     2    *     CHAR(1),          /* RESERVED                 Y02668*/ 01750000
*     2 DSNENTRY CHAR(168);        /* DATA SET NAMES           Y02668*/ 01800000
* DCL DSNTTID BIT(8) CONSTANT('07'X); /* TABLE ID X'07'        Y02668*/ 01850000
* DCL DSNTBLN FIXED(31) CONSTANT(168); /* LENGTH OF DSNAME     Y02668*/ 01900000
* DCL DSNTLN FIXED(31) CONSTANT(176); /* LENGTH OF DSN TABLE   Y02668*/ 01950000
