*        %GOTO JICAPRO;            /*                                   00050000
         MACRO                                                          00100000
         IEFJICA   &DSECT=YES                                           00150000
.*/ %JICAPRO: ;                                                         00200000
*/** START OF SPECIFICATIONS *****************************************/ 00250000
*/*                                                                  */ 00300000
*/* MACRO NAME = IEFJICA                                             */ 00325000
*/*                                                                  */ 00350000
*/*     ACRONYM = JICA                                               */ 00375000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = JES/INTERPRETER COMMUNICATIONS AREA           */ 00450000
*/*                                                                  */ 00500000
*/*01* PROPRIETARY STATEMENT=                                        */ 00550000
*/***PROPRIETARY_STATEMENT********************************************/ 00600000
*/*                                                                  */ 00650000
*/*                                                                  */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00750000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00800000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1982, 1993                      */ 00850000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00900000
*/*                                                                  */ 01000000
*/* STATUS= HBB5510                                                  */ 01050000
*/*                                                                  */ 01150000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01200000
*/*                                                                  */ 01250000
*/* FUNCTION =  Mapping for the JES/Interpreter Communications       */ 01254500
*/*             Area (JICA), which is an extension of IEFNEL.        */ 01259000
*/*                                                                  */ 01263500
*/*01* EXTERNAL CLASSIFICATION:  DMTI                                */ 01268000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01272500
*/*                                                                  */ 01277000
*/*    NOTES =                                                       */ 01281500
*/*                                                                  */ 01286000
*/*        Bilingual Mapping Macro (PL/S and BAL)                    */ 01290500
*/*                                                                  */ 01295000
*/*         This mapping macro serves as a parameter extension       */ 01299500
*/*         of the Interpreter part of the NEL. It contains job      */ 01304000
*/*         information in addition to that in the NEL and should    */ 01308500
*/*         be used for any additional job parameters that need      */ 01313000
*/*         to be passed, instead of increasing the size of the      */ 01317500
*/*         NEL.                                                     */ 01322000
*/*                                                                  */ 01326500
*/*                                                                  */ 01331000
*/**** INVOCATION ****************************************************/ 01335500
*/*                                                                  */ 01340000
*/*    METHOD OF ACCESS =                                            */ 01344500
*/*                                                                  */ 01350000
*/*   BAL  - IEFJICA DSECT=YES OR NO                                 */ 01400000
*/*          DSECT=YES IS THE DEFAULT                                */ 01450000
*/*          DEFINE A  CONSTANT EQUAL TO                             */ 01500000
*/*          'JICA' TO  STORE IN JICAID.                             */ 01550000
*/*                                                                  */ 01600000
*/*   PL/S   %INCLUDE SYSLIB(IEFJICA)                                */ 01650000
*/*          (Use JICAATTR to change the default basing of           */ 01666600
*/*           the macro)                                             */ 01683200
*/*                                                                  */ 01700000
*/*    DSECT NAME = JICA                                             */ 01750000
*/*                                                                  */ 02050000
*/*    COMPONENT = Interpreter (SC1B9)                               */ 02053300
*/*                                                                  */ 02056600
*/*    EYE CATCHER = JICA                                            */ 02059900
*/*     OFFSET = 0                                                   */ 02063200
*/*     LENGTH = 4 bytes                                             */ 02066500
*/*                                                                  */ 02069800
*/*    CREATED BY =                                                  */ 02073100
*/*     The Initiator and JES3                                       */ 02076400
*/*01* CREATED BY (IBM use only) =                                   */ 02079700
*/*     Initiator Module (IEFIB600) and JES3 Module (IATIICA)        */ 02083000
*/*                                                                  */ 02086300
*/*    POINTED TO BY = NELJICA field of the IEFNEL data area         */ 02089600
*/*                                                                  */ 02092900
*/*    DELETED BY = Invoker of Interpreter                           */ 02096200
*/*                                                                  */ 02099500
*/*    SERIALIZATION = None                                          */ 02102800
*/*                                                                  */ 02106100
*/*    STORAGE ATTRIBUTES =                                          */ 02109400
*/*                                                                  */ 02112700
*/*      ALLOCATION METHOD = Determined by caller                    */ 02116000
*/*      SUBPOOL           = 253                                     */ 02119300
*/*      KEY               = 0                                       */ 02122600
*/*      RESIDENCY         = Below                                   */ 02125900
*/*    SIZE                = 256 bytes                               */ 02129200
*/*      Frequency:  1 per invocation of Interpreter                 */ 02132500
*/*                                                                  */ 02135800
*/*    DISTRIBUTION LIBRARY = AMODGEN                                */ 02139100
*/*                                                                  */ 02142400
*/* CHANGE ACTIVITY = L0,L1,D1,L2,01,P1                          @P1C*/ 02145700
*/* $L0= SMSSTG2 JBB2223 860324 PDT3: STOR MGMT SUBSYS STG2 SUPT @L0A*/ 02150000
*/* $L1= SMSSTG2 JBB2223 860512 PDT3: STOR MGMT SUBSYS STG2 SUPT @L1A*/ 02200000
*/* $D1= DCR0001 JBB3313 880802 PDM9: SMS IDAX/UTOKEN DCR        @D1A*/ 02225000
*/* $L2= APPC1   HBB4420 890310 PDT4: APPC                       @L2A*/ 02237500
*/* $01= OY37968 JBB2223 901221 PDN3: STOR MGMT SUBSYS STG2 SUPT @01A*/ 02243700
*/* $P1= PIG1422 HBB5510 930715 PDML: SHOWHDR Format Complete    @P1A*/ 02246800
*/*                                                                  */ 02250000
*/*                                                                  */ 02283300
*/** END OF SPECIFICATIONS *******************************************/ 02316600
*/* A 000000-999999                                              @L0A*/ 02350000
*/* A Add                                                        @L1A*/ 02400000
*/* A - a 80 byte field for UTOKEN                               @D1A*/ 02403300
*/* A - version number from 1 to 2                               @D1A*/ 02406600
*/* A - Code to set an attribute macro variable                  @L2A*/ 02409900
*/* A - @YA34260 Updates from DFP   JICADYAS bit setting             */ 02413200
*/*     Compatibility must be maintained with DFP macro              */ 02416500
*/*     IEFSSSA.  If any updates are made to the JICAXMOD            */ 02419800
*/*     indicators, they must also be mirrored in byte               */ 02423100
*/*     SSSA7XMD of the IEFSSSA macro.                           @01A*/ 02426400
*/* A - JICASCAN indicator to record the fact that TYPRUN=SCAN       */ 02429700
*/*     was specified on the JOB card for this job.  This            */ 02433000
*/*     information is required by SMS (IDAX) coreq APAR OY37664.    */ 02436300
*/*     TYPRUN+SCAN information is used by IDAX to control RACF      */ 02439600
*/*     checks isued during parameter validation.                @01A*/ 02442900
*/* C - Changed prolog to be SHOWHDR compliant                   @P1A*/ 02444500
*/* ---------------------------------------------------------------- */ 02446200
*        %GOTO JICAPLS;            /*                                   02450000
         AIF   ('&DSECT' EQ 'NO').NODSECT                               02500000
JICA     DSECT                                                          02550000
         AGO   .CONT                                                    02600000
.NODSECT ANOP                                                           02650000
JICA     DS     0F                                                      02700000
.CONT    ANOP                                                           02750000
JICAID   DS     CL4              IDENTIFIER 'JICA' ACRONYM              02800000
JICAVERS DS     XL1              VERSION NUMBER                         02850000
JICARSV1 DS     CL1              RESERVED                               02900000
JICALGTH DS     H                LENGTH OF JICA                         02950000
JICASPAF DS     0CL8             SPOOL ACCESS FACILITY TOKENS           03000000
JICASRQT DS     A                SCHEDULING REQUIREMENTS TOKEN          03050000
JICAJOBT DS     A                JOB INFORMATION SPOOL ACCESS           03100000
*                                FACILITY TOKEN                         03150000
JICAUSER DS     CL8              USER ID                                03200000
JICAGRP  DS     CL8              GROUP ID                               03250000
JICASSNM DS     CL4              SUBSYSTEM NAME                         03300000
JICAXMOD DS     XL1              EXECUTION MODE  NOTE: any changes     +03320000
                                    made to this field must also be    +03340000
                                    made to field SSSA7XMD in the      +03360000
                                    IEFSSSA mapping macro               03380000
JICABTCH EQU    X'80'            BATCH                                  03400000
JICATASK EQU    X'40'            TASK                                   03450000
JICATSO  EQU    X'20'            TSO                                    03500000
JICADYAS EQU    X'10'            BYPASS DYNALLOC SPACE PROCESSING @01A  03516600
JICASCAN EQU    X'08'            TYPRUN=SCAN SPECIFIED            @01A  03533200
JICARSV2 DS     CL3              RESERVED                               03550000
JICAPLCO DS     A                SCHEDULING SERVICES PLCO OUTPUT        03600000
*                                SSOB EXTENSION                         03650000
JICANVOL DS     A                POINTER TO A LIST OF NON-STORAGE       03700000
*                                SUBSYSTEM MANAGED CATALOG VOLUMES      03750000
JICADSBP DS     XL1              SUBPOOL TO RETURN DATA IN        @L1A  03800000
JICAUTKN DS     CL80             UTOKEN TO PASS TO SMS IDAX       @D1A  03833300
JICARSV3 DS     CL127            RESERVED                         @D1C  03866600
*********************************************************************** 03900000
*                                                                     * 03950000
*    ADDITIONAL DATA                                                  * 04000000
*                                                                     * 04050000
*********************************************************************** 04100000
JICACVER EQU   2                  VERSION NUMBER                  @D1C  04150000
JICAFIXD EQU   *-JICA             LENGTH OF JICA                        04200000
         MEND                                                           04250000
**/                                                                     04300000
*%JICAPLS: ;                                                            04350000
*%IF JICAATTR = '' %THEN           /* Set default attributes     @L2A*/ 04380000
*  %JICAATTR = 'BASED(NELJICA)';   /*                            @L2A*/ 04410000
*DECLARE 1 JICA JICAATTR,          /* JES/Interpreter Communication     04440000
*                                     Area                       @L2C*/ 04470000
*   2 JICAID CHAR(4),              /* Identifier 'JICA'              */ 04500000
*   2 JICAVERS FIXED(8),           /* Version number                 */ 04550000
*   2 JICARSV1 CHAR(1),            /* Reserved                       */ 04600000
*   2 JICALGTH FIXED(15),          /* Length of the JICA             */ 04650000
*   2 JICASPAF,                    /* Spool Access Facility tokens   */ 04700000
*    4 JICASRQT PTR(31),           /* Scheduling Requirements token  */ 04750000
*    4 JICAJOBT PTR(31),           /* Job Information Spool Access      04800000
*                                     Facility token                 */ 04850000
*   2 JICAUSER CHAR(8),            /* User id                        */ 04900000
*   2 JICAGRP CHAR(8),             /* Group id                       */ 04950000
*   2 JICASSNM CHAR(4),            /* Subsystem name                 */ 05000000
*   2 JICAXMOD CHAR(1),            /* Execution mode -                  05020000
*                                     Changes made to this field must   05040000
*                                     also be made to field SSSA7XMD    05060000
*                                     in the IEFSSSA mapping macro   */ 05080000
*    4 JICABTCH BIT(1),            /* Batch                          */ 05100000
*    4 JICATASK BIT(1),            /* Task                           */ 05150000
*    4 JICATSO  BIT(1),            /* TSO                            */ 05200000
*    4 JICADYAS BIT(1),            /* Bypass DYNALLOC Space             05208300
*                                     Processing                 @01A*/ 05216600
*    4 JICASCAN BIT(1),            /* TYPRUN=SCAN Specified for         05224900
*                                     job                        @01A*/ 05233200
*    4 *        BIT(3),            /* Reserved                   @01C*/ 05241500
*   2 JICARSV2 CHAR(3),            /* Reserved                       */ 05250000
*   2 JICAPLCO PTR(31),            /* Scheduling Services PLCO output   05300000
*                                     SSOB extension                 */ 05350000
*   2 JICANVOL PTR(31),            /* Pointer to a list of non-storage  05400000
*                                     subsystem managed catalog         05450000
*                                     volumes                        */ 05500000
*   2 JICADSBP FIXED(8),           /* Subpool to return data in  @L1A*/ 05550000
*   2 JICAUTKN CHAR(80),           /* UTOKEN to pass to SMS IDAX @D1A*/ 05583300
*   2 JICARSV3 CHAR(127);          /* Reserved                   @D1C*/ 05616600
*/********************************************************************/ 05650000
*/*                                                                  */ 05700000
*/*  ADDITIONAL DATA                                                 */ 05750000
*/*                                                                  */ 05800000
*/********************************************************************/ 05850000
*DECLARE                                                                05900000
*  JICACID  CHAR(4) CONSTANT('JICA'),/* IDENTIFIER                   */ 05950000
*  JICACVER FIXED(8) CONSTANT(2);    /* VERSION NUMBER           @D1C*/ 06000000
