*                                                                       00050000
*        %GOTO JFCBEL1;    /*                                           00100000
         MACRO                                                          00150000
         IEFJFCBE &DSECT=YES    */                                      00200000
*%JFCBEL1 : ;                                                           00250000
*                                                                       00300000
*/**** START OF SPECIFICATIONS ***************************************/ 00350000
*/*                                                                  */ 00400000
*/*  MACRO NAME = IEFJFCBE                                       @P1C*/ 00425000
*/*                                                                  */ 00450000
*/*   ACRONYM = JFCBE                                            @P1A*/ 00475000
*/*                                                                  */ 00500000
*/*  DESCRIPTIVE NAME =  JOB FILE CONTROL BLOCK EXTENSION            */ 00550000
*/*                      FOR 3800 PRINTER KEYWORDS                   */ 00600000
*/*                                                                  */ 00650000
*/*01* PROPRIETARY STATEMENT=                                        */ 00683300
*/***PROPRIETARY_STATEMENT********************************************/ 00716600
*/*                                                                  */ 00749900
*/*                                                                  */ 00783200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00816500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00849800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1973, 1994                      */ 00883100
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00916400
*/*                                                                  */ 00950000
*/* STATUS= HBB5520                                                  */ 01000000
*/*                                                                  */ 01150000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01200000
*/*                                                                  */ 01500000
*/*  FUNCTION   = This macro maps the Job File Control Block         */ 01506000
*/*               Extension for the 3800 device.                     */ 01512000
*/*                                                                  */ 01518000
*/*01* EXTERNAL CLASSIFICATION:                                  @P1A*/ 01524000
*/*02*   DMTI:  BASE                                             @P1A*/ 01530000
*/*02*   PSPI:  FIELDS                                           @P1A*/ 01536000
*/*             JFCBEOPN                                         @P1A*/ 01542000
*/*02*   GUPI:  FIELDS                                           @P1A*/ 01548000
*/*             JFCBBST  JFCBCFS  JFCBELEN JFCBMAGT JFCBTRS1     @P1A*/ 01554000
*/*             JFCBTRS2 JFCBTRS3 JFCBTRS4 JFCDSID  JFCGRP1      @P1A*/ 01560000
*/*             JFCGRP2  JFCGRP3  JFCGRP4  JFCGRP5  JFCGRP6      @P1A*/ 01566000
*/*             JFCGRP7  JFCGRP8  JFCIDTRC JFCIMTOT JFCMODIF     @P1A*/ 01572000
*/*                                                              @P1A*/ 01578000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P1A*/ 01584000
*/*                                                                  */ 01590000
*/*  NOTES =                                                     @P1A*/ 01596000
*/*                                                                  */ 01602000
*/*      Bilingual Mapping Macro (PL/S and BAL)                  @P1A*/ 01608000
*/*                                                                  */ 01614000
*/*      Reference Fields:                                       @P1A*/ 01620000
*/*           JFCBFLAG                                           @P1A*/ 01626000
*/*                                                                  */ 01632000
*/*      Field JSCBSWSP of the JSCB pointed to by the jobstep    @P1A*/ 01638000
*/*      TCB indicates which subpool the control block resides.  @P1A*/ 01644000
*/*                                                                  */ 01644800
*/*      Field JSCDSID was defined to hold the DSID=id value     @01A*/ 01645600
*/*      for 3540 diskette compatibility purposes.  The DSID=id  @01A*/ 01646400
*/*      support became obsolete at JES version 4.               @01A*/ 01647200
*/*      When JES version 4 is the lowest level supported on     @01A*/ 01648000
*/*      MVS, the field will be obsolete and can be reclaimed.   @01A*/ 01648800
*/*                                                                  */ 01650000
*/*    DEPENDENCY = CHANGES TO THIS MACRO SHOULD BE REFLECTED    @L1A*/ 01670000
*/*               IN IPCS MODEL IEFMJFCE                         @L1A*/ 01690000
*/*                                                                  */ 01710000
*/** INVOCATION ******************************************************/ 01710700
*/*  Method of Access =                                              */ 01711400
*/*      BAL  - IEFJFCBE                                             */ 01712100
*/*             USING ON JFCBE GIVES ADDRESSABILITY FOR ALL SYMBOLS. */ 01712800
*/*             DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 01713500
*/*                                                                  */ 01714200
*/*      PL/S - %INCLUDE SYSLIB(IEFJFCBE)                            */ 01714900
*/*             DCL JFCBEPTR PTR(31)                                 */ 01715600
*/********************************************************************/ 01716300
*/*                                                                  */ 01717000
*/*    DSECT NAME = JFCBE                                        @P1A*/ 01717700
*/*                                                                  */ 01718400
*/*    COMPONENT = Interpreter (SC1B9)                           @P1A*/ 01719100
*/*                                                                  */ 01719800
*/*    EYE CATCHER = None                                        @P1A*/ 01720500
*/*     OFFSET = N/A                                             @P1A*/ 01721200
*/*     LENGTH = N/A                                             @P1A*/ 01721900
*/*                                                                  */ 01722600
*/*    CREATED BY =                                                  */ 01723300
*/*     Interpreter and Dynamic Allocation                       @P1A*/ 01724000
*/*01* CREATED BY (IBM use only) =                                   */ 01724700
*/*     Interpreter Modules (IEFVDA, IEFVEA)                         */ 01725400
*/*     Dynamic Allocation Module (IEFDB414)                         */ 01726100
*/*                                                                  */ 01726800
*/*    POINTED TO BY =                                               */ 01727500
*/*   - Register 0 on entry to the DFSMS OPEN JFCBE user exit    @P1A*/ 01728200
*/*01* POINTED TO BY (IBM use only) =                            @P1A*/ 01728900
*/*   - JFCBEXAD field (SVA) of the JFCB data area               @P1A*/ 01729600
*/*   - JFCBEXTR field (SVA) of the JFCBE data area              @P1A*/ 01730300
*/*   - SWBUFPTR field in IEFZB506 upon return from IEFQMREQ         */ 01731000
*/*      macro (Preferred method of SVA translation)             @P1A*/ 01731700
*/*   - SWBLKPTR field in IEFZB505 upon return from SWAREQ           */ 01732400
*/*      macro                                                   @P1A*/ 01733100
*/*                                                                  */ 01733800
*/*    DELETED BY = SWA Manager, SWA Subpool Delete (IEFQB551)   @P1A*/ 01734500
*/*                                                                  */ 01735200
*/*    SERIALIZATION = None for Interpreter, SVC 99 processing   @P1A*/ 01735900
*/*                    for Dynamic Allocation and Unallocation   @P1A*/ 01736600
*/*                                                                  */ 01737300
*/*    STORAGE ATTRIBUTES =                                      @P1A*/ 01738000
*/*                                                                  */ 01738700
*/*      ALLOCATION METHOD = via SWA Manager call (assign)       @P1A*/ 01739400
*/*      SUBPOOL = 236 or 237 (SWA), or 241 (MSTR)               @P1A*/ 01740100
*/*      KEY = 1                                                 @P1A*/ 01740800
*/*      RESIDENCY = Above or Below                              @P1A*/ 01741500
*/*                                                                  */ 01742200
*/*    SIZE = 176                                                @P1A*/ 01742900
*/*      Frequency:  One per DD when 3800 device information     @P1A*/ 01743600
*/*                  specified on the allocation request.        @P1A*/ 01744300
*/*                                                                  */ 01745000
*/*    DISTRIBUTION LIBRARY = AMACLIB                            @P1A*/ 01745700
*/*                                                                  */ 01746400
*/*  CHANGE ACTIVITY   =  R1,L1,01,P1                            @P1C*/ 01747100
*/*                                                                  */ 01750000
*/*  $R1 = PA20586 JBB2220 851014 PDD7: PA20586                  @R1A*/ 01800000
*/*  $L1 = DDPERF  HBB4420 900406 PDDS: DDLPERFIPCS DD LIMIT         */ 01816600
*/*                                                 PERFORMANCE  @L1A*/ 01833200
*/*  $01 = OY37964 JBB3313 901215 PDN3: DSID= SUPPORT FOR JES    @01A*/ 01841600
*/*  $P1 = PIG1422 HBB5510 930715 PDN3: SHOWHDR/PLASMAP update   @P1A*/ 01853200
*/**** END OF SPECIFICATIONS *****************************************/ 01864800
*/*** RECORD OF CHANGES (recorded chronologically) *******************/ 01876400
*/*                                                                  */ 01888000
*/* A - PROLOGUE                                                 @R1A*/ 01900000
*/* A - ADD DEPENDENCY NOTE FOR IPCS CONTROL BLOCK MODEL         @L1A*/ 01925000
*/* A - DEFINITION OF THE JFCDSID FIELD IN CONJUNCTION WITH THE      */ 01929100
*/*     SUPPORT FOR THE DSID= KEYWORD.  JES NOW REQUIRES THAT THE    */ 01933200
*/*     INTERPRETER HANDLE THE INFORMATION SPECIFIED ON THE DSID=    */ 01937300
*/*     KEYWORD.  THE JFCDSID FIELD HAS BEEN DEFINED IN THE JFCBE    */ 01941400
*/*     CONTROL BLOCK TO HOLD THE INFORMATION.                   @01A*/ 01945500
*/* C - Corrected prologue and comments for data areas pub       @P1A*/ 01951500
*/*                                                                  */ 01957500
*/*** END OF RECORD OF CHANGES ***************************************/ 01963500
*/*** COMPONENT OWNER SECTION ****************************************/ 01969500
*/* This section may be used to document suggestions for improvement */ 01975500
*/*                                                                  */ 01981500
*/*  FOLLOW ON:                                                      */ 01987500
*/*** END OF COMPONENT OWNER SECTION *********************************/ 01993500
*%GOTO JFCBEL2;  /*                                                     02000000
         SPACE 1                                                        02050000
         AIF   ('&DSECT' EQ 'NO').JFCBE10                               02100000
JFCBE    DSECT  , -                                            @Y17CP9A 02150000
         AGO   .JFCBE20                                                 02200000
.JFCBE10 ANOP                                                           02250000
         DS    0F -                                            @Y17CP9A 02300000
JFCBE    EQU   * -                                             @Y17CP9A 02350000
.JFCBE20 ANOP                                                           02400000
JFCBEXTR DS    CL3 -          SVA FOR NEXT EXTENSION                    02450000
*                             BLOCK                            @Y17CP9A 02500000
JFCBETYP DS    B -            TABLE ID OF JFCBE                @Y17CP9A 02550000
JFCBEID  EQU   41 -           JFCBE IDENTIFIER                 @Y17CP9A 02600000
JFCBFLAG DS    B -            FLAG BYTE                        @Y17CP9A 02650000
JFCBEOPN EQU   X'80' -        USER OPEN EXIT MODIFIED THIS BLOCK - The  02683300
*                             flag is set in the exit routine           02716600
*                             (MDC304)                         @Y17CP9A 02750000
JFCBE003 EQU   X'40',,C'X' -  RESERVED                         @Y17CP9A 02800000
JFCBE004 EQU   X'20',,C'X' -  RESERVED                         @Y17CP9A 02850000
JFCBE005 EQU   X'10',,C'X' -  RESERVED                         @Y17CP9A 02900000
JFCBE006 EQU   X'08',,C'X' -  RESERVED                         @Y17CP9A 02950000
JFCBCFS  EQU   X'04' -        CONTINUOUS FORM STACKING                 +02980000
                              (BURST=NO)                       @Y17CP9A 03010000
JFCBBST  EQU   X'02' -        BURST FORM STACKING                      +03040000
                              (BURST=YES)                      @Y17CP9A 03070000
JFCBE007 EQU   X'01',,C'X' -  RESERVED                         @Y17CP9A 03100000
JFCIDTRC DS    FL1 -          TABLE REFERENCE CHARACTER FOR COPY       +03137500
                              MODIFICATION PATTERN                     +03175000
                              (MODIFY=(,trc))                  @Y17CP9A 03212500
JFCBE008 DS    XL1 -          RESERVED                         @Y17CP9A 03250000
JFCIMTOT DS    FL1 -          NUMBER OF IMAGE COPIES                   +03278500
                              (FLASH=(,count))                 @Y17CP9A 03307000
JFCBMAGT DS    CL4 -          FORMS IMAGE CARTRIDGE ID                 +03335500
                              (FLASH=(overlay-name))           @Y17CP9A 03364000
JFCMODIF DS    CL4 -          COPY MODIFICATION ID                     +03392500
                              (MODIFY=module-name)             @Y17CP9A 03421000
JFCBE009 DS    CL4 -          RESERVED  (MDC301)               @Y17CP9A 03450000
JFCBTRS1 DS    CL4 -          NAME OF TRANSLATE TABLE 1                +03477700
                              (CHARS=tbl-name1)                @Y17CP9A 03505400
JFCBTRS2 DS    CL4 -          NAME OF TRANSLATE TABLE 2                +03533100
                              (CHARS=(t1,tbl-name2))           @Y17CP9A 03560800
JFCBTRS3 DS    CL4 -          NAME OF TRANSLATE TABLE 3                +03588500
                              (CHARS=(t1,t2,tbl-name3))        @Y17CP9A 03616200
JFCBTRS4 DS    CL4 -          NAME OF TRANSLATE TABLE 4                +03643900
                              (CHARS=(t1,t2,t3,tbl-name4))     @Y17CP9A 03671600
JFCGROUP DS    0CL8 -         OUTPUT DISTRIBUTION IN GROUPS    @Y17CP9A 03700000
JFCGRP1  DS    FL1 -          FOR FIRST GROUP, NUMBER OF TIMES EACH     03750000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      03800000
*                             PAGE (COPIES=(n,(gp1)))          @Y17CP9A 03850000
JFCGRP2  DS    FL1 -          FOR SECOND GROUP, NUMBER OF TIMES EACH    03900000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      03950000
*                             PAGE (COPIES=(n,(,gp2)))         @Y17CP9A 04000000
JFCGRP3  DS    FL1 -          FOR THIRD GROUP, NUMBER OF TIMES EACH     04050000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04100000
*                             PAGE (COPIES=(n,(,,gp3)))        @Y17CP9A 04150000
JFCGRP4  DS    FL1 -          FOR FOURTH GROUP, NUMBER OF TIMES EACH    04200000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04250000
*                             PAGE (COPIES=(n,(,,,gp4)))       @Y17CP9A 04300000
JFCGRP5  DS    FL1 -          FOR FIFTH GROUP, NUMBER OF TIMES EACH     04350000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04400000
*                             PAGE (COPIES=(n,(,,,,gp5)))      @Y17CP9A 04450000
JFCGRP6  DS    FL1 -          FOR SIXTH GROUP, NUMBER OF TIMES EACH     04500000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04550000
*                             PAGE (COPIES=(n,(,,,,,gp6)))     @Y17CP9A 04600000
JFCGRP7  DS    FL1 -          FOR SEVENTH GROUP, NUMBER OF TIMES EACH   04650000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04700000
*                             PAGE (COPIES=(n,(,,,,,,gp7)))    @Y17CP9A 04750000
JFCGRP8  DS    FL1 -          FOR EIGHTH GROUP, NUMBER OF TIMES EACH    04800000
*                             PAGE IS PRINTED BEFORE GOING TO NEXT      04850000
*                             PAGE (COPIES=(n,(,,,,,,,gp8)))   @Y17CP9A 04900000
JFCDSID  DS    CL8   -        DSID ID VALUE (DSID=id), placed here @01A 04922200
*                             for 3540 diskette compatibility      @01A 04944400
JFCBE010 DS    XL124 -        RESERVED                             @01C 04966600
JFCBELEN EQU   *-JFCBE -      LENGTH OF JFCB EXTENSION                  05000000
*                             (MDC302)                         @Y17CP9A 05050000
JFCBEULN EQU   JFCBE010-JFCBE LENGTH OF USED FIELDS IN JFCB EXTENSION   05100000
*                             (MDC303)                         @Y17CP9A 05150000
         MEND  , -    */                                                05200000
*%JFCBEL2 : ;                                                           05250000
*                                                                       05300000
*DECLARE                                                                05350000
*  1 JFCBE    BASED(JFCBEPTR)  BDY(WORD),/*                  @Y17CP9A*/ 05400000
*   2 JFCBEXTR    CHAR(3),               /* SVA FOR NEXT EXTENSION      05450000
*                                           BLOCK            @Y17CP9A*/ 05500000
*   2 JFCBETYP    BIT(8),                /* TABLE ID OF                 05550000
*                                           JFCBE            @Y17CP9A*/ 05600000
*%JFCBEID='''29''X';                     /* JFCBE IDENTIFIER @Y17CP9A*/ 05650000
*   2 JFCBFLAG    BIT(8),                /* FLAG BYTE        @Y17CP9A*/ 05700000
*    3 JFCBEOPN BIT(1),                  /* USER OPEN EXIT MODIFIED     05750000
*                                           THIS BLOCK - the flag is    05783300
*                                           set in the exit routine     05816600
*                                           (MDC304)         @Y17CP9A*/ 05850000
*    3 JFCBE003 BIT(1),                  /* RESERVED         @Y17CP9A*/ 05900000
*    3 JFCBE004 BIT(1),                  /* RESERVED         @Y17CP9A*/ 05950000
*    3 JFCBE005 BIT(1),                  /* RESERVED         @Y17CP9A*/ 06000000
*    3 JFCBE006 BIT(1),                  /* RESERVED         @Y17CP9A*/ 06050000
*    3 JFCBCFS  BIT(1),                  /* CONTINUOUS FORM             06100000
*                                           STACKING         @Y17CP9A*/ 06150000
*    3 JFCBBST  BIT(1),                  /* BURST FORM                  06200000
*                                           STACKING         @Y17CP9A*/ 06250000
*    3 JFCBE007 BIT(1),                  /* RESERVED         @Y17CP9A*/ 06300000
*   2 JFCIDTRC    BIT(8),                /* TABLE REFERENCE CHARACTER   06350000
*                                           FOR COPY MODIFICATION       06400000
*                                           PATTERN          @Y17CP9A*/ 06450000
*   2 JFCBE008    CHAR(1),               /* RESERVED         @Y17CP9A*/ 06500000
*   2 JFCIMTOT    PTR(8),                /* NUMBER OF IMAGE             06550000
*                                           COPIES           @Y17CP9A*/ 06600000
*   2 JFCBMAGT    CHAR(4) BDY(WORD),     /* FORMS IMAGE CARTRIDGE       06650000
*                                           ID               @Y17CP9A*/ 06700000
*   2 JFCMODIF    CHAR(4) BDY(WORD),     /* COPY MODIFICATION           06750000
*                                           ID               @Y17CP9A*/ 06800000
*   2 JFCBE009    CHAR(4) BDY(WORD),     /* RESERVED                    06850000
*                                           (MDC301)         @Y17CP9A*/ 06900000
*   2 JFCBTRS1    CHAR(4) BDY(WORD),     /* NAME OF TRANSLATE TABLE     06950000
*                                           1                @Y17CP9A*/ 07000000
*   2 JFCBTRS2    CHAR(4) BDY(WORD),     /* NAME OF TRANSLATE TABLE     07050000
*                                           2                @Y17CP9A*/ 07100000
*   2 JFCBTRS3    CHAR(4) BDY(WORD),     /* NAME OF TRANSLATE TABLE     07150000
*                                           3                @Y17CP9A*/ 07200000
*   2 JFCBTRS4    CHAR(4) BDY(WORD),     /* NAME OF TRANSLATE TABLE     07250000
*                                           4                @Y17CP9A*/ 07300000
*   2 JFCGROUP    CHAR(8) BDY(WORD),     /* OUTPUT DISTRIBUTION IN      07350000
*                                           GROUPS           @Y17CP9A*/ 07400000
*    3 JFCGRP1     PTR(8),               /* FOR FIRST GROUP, NUMBER     07450000
*                                           OF TIMES EACH PAGE IS       07500000
*                                           PRINTED BEFORE GOING TO     07550000
*                                           NEXT PAGE        @Y17CP9A*/ 07600000
*    3 JFCGRP2     PTR(8),               /* FOR SECOND GROUP, NUMBER    07650000
*                                           OF TIMES EACH PAGE IS       07700000
*                                           PRINTED BEFORE GOING TO     07750000
*                                           NEXT PAGE        @Y17CP9A*/ 07800000
*    3 JFCGRP3     PTR(8),               /* FOR THIRD GROUP, NUMBER     07850000
*                                           OF TIMES EACH PAGE IS       07900000
*                                           PRINTED BEFORE GOING TO     07950000
*                                           NEXT PAGE        @Y17CP9A*/ 08000000
*    3 JFCGRP4     PTR(8),               /* FOR FOURTH GROUP, NUMBER    08050000
*                                           OF TIMES EACH PAGE IS       08100000
*                                           PRINTED BEFORE GOING TO     08150000
*                                           NEXT PAGE        @Y17CP9A*/ 08200000
*    3 JFCGRP5     PTR(8),               /* FOR FIFTH GROUP, NUMBER     08250000
*                                           OF TIMES EACH PAGE IS       08300000
*                                           PRINTED BEFORE GOING TO     08350000
*                                           NEXT PAGE        @Y17CP9A*/ 08400000
*    3 JFCGRP6     PTR(8),               /* FOR SIXTH GROUP, NUMBER     08450000
*                                           OF TIMES EACH PAGE IS       08500000
*                                           PRINTED BEFORE GOING TO     08550000
*                                           NEXT PAGE        @Y17CP9A*/ 08600000
*    3 JFCGRP7     PTR(8),               /* FOR SEVENTH GROUP, NUMBER   08650000
*                                           OF TIMES EACH PAGE IS       08700000
*                                           PRINTED BEFORE GOING TO     08750000
*                                           NEXT PAGE        @Y17CP9A*/ 08800000
*    3 JFCGRP8     PTR(8),               /* FOR EIGHTH GROUP, NUMBER    08850000
*                                           OF TIMES EACH PAGE IS       08900000
*                                           PRINTED BEFORE GOING TO     08950000
*                                           NEXT PAGE        @Y17CP9A*/ 09000000
*   2 JFCDSID     CHAR(8),               /* DSID=id, placed here for    09018700
*                                           3540 diskette compatibility 09037400
*                                                                @01A*/ 09056100
*   2 JFCBE010    CHAR(124) BDY(WORD);   /* RESERVED             @01C*/ 09075000
*%JFCBELEN='LENGTH(JFCBE)';              /* LENGTH OF JFCB EXTENSION    09100000
*                                           (MDC302)         @Y17CP9A*/ 09150000
*%JFCBEULN='LENGTH(JFCBE) - LENGTH(JFCBE010)'; /* LENGTH OF USED        09200000
*                                           FIELDS IN JFCB EXTENSION    09250000
*                                           (MDC303)         @Y17CP9A*/ 09300000
