*        %GOTO NELPRO;                                              /*  00050000
         MACRO                                                          00200000
         IEFNEL &SUBCOM=NO,&EXITS=                                      00250000
         LCLA  &N,&NELDUM                                               00300020
*                                                            @VS49762*/ 00350000
*        %NELPRO: ;                                       /* @VS49762*/ 00400000
*/** START OF SPECIFICATIONS *****************************************/ 00450000
*/*                                                          @VS49762*/ 00500000
*/*01* MACRO NAME= IEFNEL                                        @P2C*/ 00525000
*/*                                                                  */ 00550000
*/*01* ACRONYM = NEL                                             @P2A*/ 00575000
*/*                                                          @VS49762*/ 00600000
*/*01* DESCRIPTIVE NAME = Interpreter Entrance List              @H1C*/ 00636300
*/*                                                                  */ 00672600
*/*01* PROPRIETARY STATEMENT=                                        */ 00708900
*/***PROPRIETARY_STATEMENT********************************************/ 00745200
*/*                                                                  */ 00781500
*/*                                                                  */ 00817800
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00854100
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00890400
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1982, 1992                      */ 00926700
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00963000
*/*                                                                  */ 01000000
*/* STATUS= HBB5510                                              @P3C*/ 01014800
*/*                                                                  */ 01029600
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01044400
*/*                                                                  */ 01059200
*/* FUNCTION =                                                   @H1C*/ 01074000
*/* This macro provides a symbolic mapping of the parameter lists    */ 01088800
*/* required when invoking the Converter or Interpreter subroutines. */ 01103600
*/* Each list and its exit sublist must be constructed in dynamically*/ 01118400
*/* allocated storage prior to calling the Converter or Interpreter. */ 01133200
*/*                                                                  */ 01145800
*/*                                                              @P2C*/ 01148000
*/*01* EXTERNAL CLASSIFICATION:                                  @P3C*/ 01162800
*/*02*   DMTI:  BASE                                             @P3A*/ 01177600
*/*02*   PSPI:  FIELDS                                           @P3A*/ 01192400
*/*                    NELXA2                                    @P3A*/ 01207200
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P2A*/ 01222000
*/*                                                                  */ 01340400
*/*01* NOTES =                                                   @P2A*/ 01343600
*/*        Bilingual Mapping Macro (PL/S and BAL)                @P2A*/ 01346800
*/*                                                                  */ 01350000
*/*02*   DEPENDENCIES = Refer to Method of Access                @P2A*/ 01353200
*/*                                                                  */ 01356400
*/*02*   RESTRICTIONS = None                                     @P2A*/ 01359600
*/*                                                                  */ 01362800
*/*                                                                  */ 01366000
*/**** INVOCATION ***********************************************@P2A*/ 01370000
*/*01* METHOD OF ACCESS =                                        @H1C*/ 01384800
*/*              BAL  - SPECIFY: NEL   DSECT                 @VS49762*/ 01400000
*/*                                    IEFNEL SUBCOM=xx          @P2C*/ 01450000
*/*              PL/S - SPECIFY: %INCLUDE SYSLIB(IEFNEL)     @VS49762*/ 01500000
*/*                              (USE NELATTR TO CHANGE THE      @L5A*/ 01516600
*/*                               DEFAULT BASING)                @L5A*/ 01533200
*/*                                                                  */ 01850000
*/* TWO MACRO OPERANDS ARE AVAILABLE FOR SPECIFING CERTAIN DETAILS OF*/ 01900000
*/* THE MAPPING.                                                 @H1C*/ 01950000
*/*                                                              @H1C*/ 02000000
*/* ONE OPERAND, SUBCOM= , MUST BE SPECIFIED. ITS VALUE          @H1C*/ 02050000
*/* DETERMINES WHICH SUBCOMPONENT(CONVERTER(C), INTERPRETER(I),  @P1C*/ 02100000
*/* OR BOTH(CI)) THE PARAMETER LIST IS BEING BUILT FOR.  IF      @P1C*/ 02150000
*/* NEITHER SUBCOM=C, SUBCOM=I, NOR SUBCOM=CI ARE SPECIFIED,     @P1C*/ 02200000
*/* THEN THE MACRO EXPANSION FAILS AND AN ERROR                  @P1A*/ 02250000
*/* MESSAGE IS ISSUED.  ALL INFORMATION PASSED TO THE CONVERTER AND  */ 02300000
*/* INTERPRETER VIA THE NEL IS RETURNED TO THE CALLER, UNALTERED.    */ 02350000
*/*                                                                  */ 02400000
*/* THE OTHER OPERAND, EXITS= ,(ASSEMBLER INVOCATION ONLY)       @H1C*/ 02450000
*/* IS OPTIONAL AND PROVIDES A MAPPING OF                        @H1C*/ 02500000
*/* THE EXIT LIST. IF SPECIFIED THIS PARAMETER CONSISTS OF EITHER A  */ 02550000
*/* SINGLE ENTRY OR LIST OF ENTRIES ENCLOSED IN PARENTHESIS, WHICH   */ 02600000
*/* INDICATE THE TYPE OF USER EXITS TO BE TAKEN DURING THE CONVERTER */ 02650000
*/* OR INTERPRETER PROCESSING. THE AVAILABLE EXITS ARE IDENTIFIED    */ 02700000
*/* AS FOLLOWS -                                                     */ 02750000
*/*              TXT - POST SCAN EXIT                                */ 02800000
*/*              RTN - RETURN EXIT                                   */ 02850000
*/*              QEP - QUEUE MANAGER ENTRY POINT                     */ 02900000
*/*              QLP - QUEUE MANAGER LOCATE MODE ENTRY POINT @G29AN2E*/ 02950000
*/*              SMF - SYSTEM MANAGEMENT FACILITIES EXIT             */ 03000000
*/*              IAM - SPECIAL INPUT ACCESS METHOD                   */ 03050000
*/*              FAM - SPECIAL PROCEDURE FIND ACCESS METHOD EXIT.    */ 03100000
*/*              JDV - JCL DEFINITION VECTOR TABLE NAME POINTER  @H1A*/ 03150000
*/*              UJV - IEFUJV Exit                               @P2A*/ 03175000
*/*  THE SPECIFICATION OF ANY OF THESE IDENTIFIERS IN THE EXITS=     */ 03200000
*/*  PARAMETER WILL RESULT IN THE MAPPING OF AN EXIT LIST HEADER AND,*/ 03250000
*/*  CORRESPONDING TO EACH GIVEN IDENTIFIER (DENOTED XXX BELOW), THE */ 03300000
*/*  FOLLOWING EXIT LIST ENTRY WILL BE GENERATED.                @H1C*/ 03350000
*/*              XXXEXIT   DS   0CL8                                 */ 03400000
*/*              XXXEXLK   DS   XL1                                  */ 03450000
*/*              XXXEXID   DS   XL1                                  */ 03500000
*/*              XXXEXEP   DS   CL6                                  */ 03550000
*/*  REGARDLESS OF THE EXITS PARAMETER, A LIST OF SYMBOLS WILL BE    */ 03600000
*/*  GENERATED WHICH MAY BE USED AT EXECUTION TIME FOR ESTABLISHING  */ 03650000
*/*  VALUES IN THE LINKAGE (EXLK) AND IDENTIFIER (EXID) FIELDS.      */ 03700000
*/*                                                              @H1A*/ 03750000
*/*       EXAMPLE:  (ASSEMBLER INVOCATION)                       @H1A*/ 03800000
*/*                 NEL    DSECT                                 @H1A*/ 03850000
*/*                        IEFNEL   SUBCOM=I,EXITS=(QEP,RTN,JDV) @H1A*/ 03900000
*/*                                                              @H1A*/ 03950000
*/*  The offsets of the NEL exits (IAM, FAM, QEP, SMF, TXT, RTN,     */ 03958300
*/*  JDV, QLP, and UJV) will not always appear as shown.  These      */ 03966600
*/*  offsets depend on the order and number at the time the          */ 03974900
*/*  NEL is expanded.                                            @P2A*/ 03983200
*/*                                                              @P2A*/ 03991500
*/*  WHEN INVOKING THIS MACRO IN PL/S, THE OPTIONS MUST BE       @H1A*/ 04000000
*/*  SPECIFIED PRIOR TO INCLUDING THE MACRO.  THE SUBCOM= OPTION @H1A*/ 04050000
*/*  MUST BE SPECIFIED AS:                                       @P1C*/ 04100000
*/*                         %SUBCOM='C'  (CONVERTER)             @P1A*/ 04150000
*/*                    OR   %SUBCOM='I'  (INTERPRETER)           @P1A*/ 04200000
*/*                    OR   %SUBCOM='CI' (BOTH).                 @P1A*/ 04250000
*/*  THE 'EXIT' OPTIONS ARE SPECIFIED AS FOLLOWS:                @P1C*/ 04300000
*/*                                                              @H1A*/ 04350000
*/*    %TXTEXIT='X'  - POST SCAN EXIT                            @H1A*/ 04400000
*/*    %RTNEXIT='X'  - RETURN EXIT                               @H1A*/ 04450000
*/*    %QEPEXIT='X'  - QUEUE MANAGER ENTRY POINT                 @H1A*/ 04500000
*/*    %QLPEXIT='X'  - QUEUE MANAGER LOCATE MODE ENTRY POINT     @H1A*/ 04550000
*/*    %SMFEXIT='X'  - SYSTEM MANAGEMENT FACILITIES EXIT         @H1A*/ 04600000
*/*    %IAMEXIT='X'  - SPECIAL INPUT ACCESS METHOD               @H1A*/ 04650000
*/*    %FAMEXIT='X'  - SPECIAL PROCEDURE FIND ACCESS METHOD EXIT @H1A*/ 04700000
*/*    %JDVEXIT='X'  - JCL DEFINITION VECTOR TABLE NAME POINTER  @H1A*/ 04750000
*/*    %UJVEXIT='X'  - IEFUJV exit                               @P2A*/ 04775000
*/*                                                              @H1A*/ 04800000
*/*   NOTE: THE X IN 'X' MEANS ANY NON-BLANK CHARACTER.          @H1A*/ 04850000
*/*                                                              @H1A*/ 04900000
*/*   THE SPECIFICATION OF ANY OF THE ABOVE OPTIONS WILL RESULT  @H1A*/ 04950000
*/*   IN THE MAPPING OF AN EXIT LIST AS INDICATED.               @H1A*/ 05000000
*/*                                                              @H1A*/ 05050000
*/*       EXAMPLE:  (PL/S INVOCATION)                            @H1A*/ 05100000
*/*                 %SUBCOM='I'                                  @H1A*/ 05150000
*/*                 %QEPEXIT='X'                                 @H1A*/ 05200000
*/*                 %RTNEXIT='X'                                 @H1A*/ 05250000
*/*                 %JDVEXIT='X'                                 @H1A*/ 05300000
*/*                 %INCLUDE SYSLIB(IEFNEL)                      @H1A*/ 05350000
*/***************************************************************@P2A*/ 05351500
*/*                                                                  */ 05353000
*/*01* DSECT NAME = NEL (defined by invoker),                    @P2A*/ 05353700
*/*                 NELEXITS and NELEXENT (when exits are        @P2A*/ 05354400
*/*                 included)                                    @P2A*/ 05355100
*/*                                                                  */ 05356000
*/*01* COMPONENT = Converter / Interpreter (SC1B9)               @P2A*/ 05357500
*/*                                                                  */ 05359000
*/*01* EYE CATCHER =  None                                       @P2A*/ 05360500
*/*02*  OFFSET = N/A                                             @P2A*/ 05362000
*/*02*  LENGTH = N/A                                             @P2A*/ 05363500
*/*                                                                  */ 05365000
*/*01* CREATED BY =  Invoker of Converter or Interpreter         @P2A*/ 05366500
*/*                                                                  */ 05368000
*/*01* POINTED TO BY =                                               */ 05369500
*/*    - Register 1 on entry to the Converter                    @P3A*/ 05370600
*/*    - Register 1 on entry to the Interpreter                  @P3C*/ 05371700
*/*    - NELEXLST points to NELEXITS when exits are included     @P3C*/ 05372800
*/*                                                                  */ 05374000
*/*01* POINTED TO BY (IBM use only) =                            @P3A*/ 05375000
*/*    - WANELPTR field of the COMWA data area                   @P3A*/ 05376000
*/*                                                                  */ 05377000
*/*01* DELETED BY = Invoker of Converter or Interpreter          @P2A*/ 05378500
*/*                                                                  */ 05380000
*/*01* SERIALIZATION = None                                      @P2A*/ 05381500
*/*                                                                  */ 05383000
*/*01* STORAGE ATTRIBUTES =                                      @P2A*/ 05383800
*/*                                                                  */ 05384600
*/*02*   ALLOCATION METHOD = Determined by caller                @P2A*/ 05385400
*/*02*   SUBPOOL           = 10, 252, 253                        @P2A*/ 05386200
*/*02*   KEY               = Determined by caller                @P2A*/ 05387000
*/*02*   RESIDENCY         = Below                               @P2A*/ 05387800
*/*                                                                  */ 05388600
*/*01* SIZE                = 40 (decimal) for Interpreter,       @P2A*/ 05389400
*/*                          66 (decimal) for Converter,         @P2A*/ 05390600
*/*                          when exits are included then        @P2A*/ 05391400
*/*                          additional 8 + 8*number of exits    @P2A*/ 05392200
*/*                          (plus 6 for double-word alignment   @P2A*/ 05393000
*/*                           for Converter)                     @P2A*/ 05393800
*/*01* FREQUENCY           = 1 per invocation of Interpreter     @P2A*/ 05394600
*/*                          and Converter                       @P2A*/ 05395400
*/*                                                                  */ 05396500
*/*01* DISTRIBUTION LIBRARY = AMODGEN                            @P2A*/ 05398000
*/*                                                          @VS49762*/ 05400000
*/*01* CHANGE ACTIVITY =                                         @H1C*/ 05450000
*/*            CODE HAS BEEN ADDED FOR THE FOLLOWING SUPPORT         */ 05500000
*/*            CODES: G16AP2F,G29AN2E,ZA28955,VS49762,               */ 05550000
*/*                   0Z54007,H1,P1,L1,L2,L3,L4,L5,P2,P3         @P3A*/ 05600000
*/*                                                              @H1A*/ 05650000
*/* $H1= EXTJCL  JBB2110 820706 PD43: SUPPORT FOR EXTENDED JCL   @H1A*/ 05700000
*/* $P1= PAB0215 JBB2110 830103 PDFF: SUPPORT FOR C/I MAPPING    @P1A*/ 05750000
*/* $L1= SWABOVE JBB2220 850603 PDU2: SWA ABOVE THE LINE         @L1A*/ 05800000
*/* $L2= SMSSTG2 JBB2223 860324 PDT3: STOR MGMT SUBSYS STG2 SUPT @L2A*/ 05850000
*/* $L3= EMVS2   HBB4410 881031 PDR6: ENTERPRISE/MVS II          @L3A*/ 05875000
*/* $L4= APPC1   HBB4420 890310 PDM1: APPC                       @L4A*/ 05887500
*/* $L5= APPC1   HBB4420 890310 PDT4: APPC                       @L5A*/ 05893700
*/* $P2= PKB2676 HBB4430 920729 PDDZ: 10X DEFECT ELIMINATION     @P2A*/ 05896800
*/* $P3= PIG1422 HBB5510 930715 PDBN: Documentation improvement  @P3A*/ 05897800
*/*                                                                  */ 05898800
*/** END OF SPECIFICATIONS *******************************************/ 05900000
*/*                                                                  */ 05925000
*/* VS2 SU16 - IN THIS MACRO, SU 16 SUPPORTS                 @G16AP2F*/ 05950000
*/* VPSS SUPPORT (SU29 - @G29AN2E).                          @G16AP2F*/ 06000000
*/* MERGE SU 4,10,16 CODE TO REL 037 BASE PTF                @ZA28955*/ 06050000
*/* A - ADDED NEW POINTER NELSYSNP TO COMMON AREA            @VS49762*/ 06100000
*/* A - ADDED NEW BIT TO NELOPSWT FOR CONDTIONAL GETMAINS    @ZA54007*/ 06150000
*/* A - ADDED NEW EXIT LIST ENTRY(JDV) FOR POINTER TO A JCL      @H1A*/ 06200000
*/*     DEFINITION VECTOR TABLE(JDVT) NAME                       @H1A*/ 06250000
*/* A - A SWITCH REQUESTING SWB SUPPORT                          @H1A*/ 06300000
*/* A - SUPPORT TO ALLOW MAPPING OF BOTH C & I IN ONE CSECT      @P1A*/ 06350000
*/* A - SUPPORT TO ALLOW SWA TO RESIDE ABOVE THE LINE            @L1A*/ 06400000
*/* A - ADDED POINTER TO THE JES/INTERPRETER COMMUNICATIONS AREA @L2A*/ 06450000
*/* C - CHANGED 2 RESERVED BITS TO BE USED AS AN INDICATOR THAT      */ 06458300
*/*     THE NEW FORMAT PARAMETER LIST IS BEING PASSED AND AN         */ 06466600
*/*     INDICATOR THAT THE CONVERTER ENVIRONMENT IS TO BE TERMINATED.*/ 06474900
*/*     REDEFINED A RESERVED WORD TO CONTAIN THE ADDRESS OF AN       */ 06483200
*/*     EXISTING CONVERTER ENVIRONMENT.                          @L3A*/ 06491500
*/* C - CHANGED 2 RESERVED OPTION BITS IN THE INTERPRETER AREA TO    */ 06495700
*/*     INDICATE THAT WTO PROCESSING SHOULD BE SUPPRESSED, AND THAT  */ 06497100
*/*     DFSMS IDAX PROCESSING SHOULD BE BYPASSED                 @L4A*/ 06497800
*/* C - CHANGED PLS CODE TO CHECK FOR AN ATTRIBUTE IF CODED ON NEL   */ 06498500
*/*     MAPPING                                                  @L5A*/ 06499200
*/* C - Added UJVEXIT, NELUJVEX, and UJVEXT along with NELUJV6   @P2A*/ 06499300
*/*     to allow the subsystem information to be passed in and   @P2A*/ 06499400
*/*     be used as 6th parameter on UJV exit calls.              @P2A*/ 06499500
*/* C - SHOWHDR format in prologue                               @P2A*/ 06499600
*/* C - Corrected CDPI information in prologue.  Cleaned up          */ 06499700
*/*     comments for Data Areas pub.                             @P3A*/ 06499800
*/*------------------------------------------------------------------*/ 06499900
*        %GOTO NELBSL;                                    /* @VS49762   06500000
.*  COMPUTE LENGTH OF NEL EXIT LIST                                     36000000
&NELDUM  SETA  N'&EXITS                                                 36100000
&NELDUM  SETA  8*&NELDUM      # OF EXIT ENTRIES TIMES 8                 36200000
         AIF   (&NELDUM EQ 0).NELSTRT   IF NO EXITS DON'T ADD HDR LEN   36300000
&NELDUM  SETA  &NELDUM+8      ADD LENGTH OF EXIT LIST HEADER            36400000
.NELSTRT ANOP                                                           36500000
         AIF   ('&SUBCOM' NE 'NO').NELERR                               36550000
         MNOTE ,'SUBCOMPONENT SPECIFICATION MISSING'                    36600000
         MEXIT                                                          36650000
.NELERR  ANOP                                                           36700000
         AIF   ('&SUBCOM' EQ 'C').NELBEGN  CONVERTER SPECIFIED          36750000
         AIF   ('&SUBCOM' EQ 'I').NELBEGN  INTERPRETER SPECIFIED        36800000
         AIF   ('&SUBCOM' EQ 'CI').NELBEGN  BOTH SPECIFIED         @P1A 36850000
         MNOTE ,'SUBCOMPONENT SPECIFICATION INVALID'                    36900000
         MEXIT                                                          36950000
.NELBEGN ANOP                                                           37000000
*                                                                       37050000
*  POINTERS COMMON TO CONVERTER AND INTERPRETER ENTRANCE LIST           37100000
*                                                                       37150000
NELLIST  DS    0D                                                       37200000
*                                                                       37250000
NELQMPA  DS    A         PTR TO QMPA PROVIDING ACCESS TO                37300000
*                        CALLER'S SWA                                   37350000
NELEXLST DS    A         PTR TO C/I'S LIST OF SPECIAL EXITS             37400000
NELCOMID DS    A         PTR TO CONSOLE IDENTIFIER                      37450000
NELTXTCB DS    A         PTR TO OPEN ACB FOR INTERNAL TEXT              37500000
*                        DATA SET                                       37550000
NELMSGCB DS    A         PTR TO OPEN ACB FOR MESSAGE DATA SET           37600000
NELJMR   DS    A         PTR TO JOB MANAGEMENT RECORD                   37650000
*                                                                       37700000
*  NEL OPTION SWITCHES COMMON TO CONVERTER AND INTERPRETER              37750000
*                                                                       37800000
NELOPSWT DS    XL1       OPTION SWITCHES                                37850000
*                                                                       37900000
NELSMF   EQU   X'80'     IF ZERO, INDICATES A STARTED TASK     @VS49762 37950000
NELTSOP  EQU   X'40'     TERM=TS HAS BEEN SPECIFIED AND OVERRIDES       38000000
*                        ALL OTHER PARAMETERS ON THE DD STATEMENT       38050000
NELRECVY EQU   X'20'     PROCESSING IS IN RECOVERY MODE AND             38100000
*                        MESSAGES ARE TO BE SURPRESSED                  38150000
NELCNDGM EQU   X'10'     USE CONDITIONAL GETMAINS              @ZA54007 38200000
NELNEW   EQU   X'08'     NEW FORMAT PARAMETER LIST                 @L3A 38216600
NELTERM  EQU   X'04'     TERMINATE CONVERTER ENVIRONMENT           @L3A 38233200
NELSYSNP DS    AL3       POINTER TO NAME OF THE SUBSYSTEM THAT @VS49762 38250000
*                        SELECTED THIS JOB                     @VS49762 38300000
         AIF   ('&SUBCOM' EQ 'I').GENINTR - GO GEN INTERPRETER LIST     38350000
*                                                                       38400000
*  CONVERTER POINTERS                                                   38450000
*                                                                       38500000
NELJCLCB DS    A         PTR TO OPEN ACB FOR SPOOLED JCL DATA SET       38550000
NELPROCB DS    A         PTR TO OPEN DCB FOR PROCEDURE LIBRARY          38600000
NELSTMCB DS    A         PTR TO OPEN ACB FOR STATEMENT IMAGE DATA SET   38650000
*                                                                       38700000
*  CONVERTER PARM FIELD MAPPING                                         38750000
*                                                                       38800000
NELPARMO DS    CL1       PARAMETER OPTIONS                              38850000
*                                                                       38900000
NELPGMN  EQU   X'01'     PROGRAMMER NAME REQUIRED                       38950000
NELACCT  EQU   X'02'     ACCOUNT NUMBER REQUIRED                        39000000
NELXA2   EQU   X'04'     USER SWA ABOVE INDICATOR                  @L1A 39050000
NELJPRTY DS    ZL2       DEFAULT JOB PRIORITY                           39100000
NELTIME  DS    ZL6       DEFAULT FOR JOB TIME LIMIT                     39150000
NELREG   DS    ZL3       DEFAULT REGION SIZE                            39200000
NELCOMDS DS    ZL1       COMMAND DISPOSITION                            39250000
*                        0 - EXECUTE COMMAND                            39300000
*                        1 - DISPLAY AND EXECUTE COMMAND                39350000
*                        2 - DISPLAY AND REQUEST DISPOSITION            39400000
*                        3 - IGNORE COMMAND                             39450000
NELLABEL DS    ZL1       LABEL PROCESSING                               39500000
*                        0 - BLP WILL BE TREATED AS NL                  39550000
*                        1 - BLP WILL BE TREATED AS BYPASS LABEL        39600000
NELAUTH  DS    CL4       MCS COMMAND AUTHORITY                          39650000
NELMSGL  DS    0CL2      MESSAGE LEVEL DEFAULTS                    @L3A 39675000
NELMSGL1 DS    CL1       JCL MSGLEVEL DEFAULT                           39700000
NELMSGL2 DS    CL1       ALLOCATION MSGLEVEL DEFAULT                    39750000
NELMSGCL DS    CL1       DEFAULT SYSTEM OUTPUT CLASS(MSGCLASS)          39800000
         DS    CL1       RESERVED                                  @L3C 39833300
NELENVIR DS    XL4       ADDRESS OF EXISTING CONVERTER ENVIRONMENT @L3A 39866600
NELCSIZE EQU   *         USED TO DETERMINE SIZE OF CONVERTER DATA  @P1A 39900000
         AIF   ('&SUBCOM' EQ 'CI').GENCI                           @P1A 39950000
         AGO   .ENDNEL                                                  40000000
.GENCI   ANOP                                                      @P1A 40050000
         ORG   NELJCLCB+0 DEFINE INTERPRETER ON CONVERTER MAPPING  @P1A 40100000
.GENINTR ANOP                                                           40150000
*                                                                       40200000
*  INTERPRETER POINTERS                                                 40250000
*                                                                       40300000
NELJCT   DS    A         PTR TO JCT IN SWA                              40350000
*                                                                       40400000
*  INTERPRETER OPTION SWITCH                                       @H1C 40450000
*                                                                       40500000
NELOPSW2 DS    XL1       OPTION SWITCHES - BYTE 2                       40550000
NELADSPC EQU   X'80'     FAIL JOB IF ADDRSPC=REAL CODED                 40600000
*                        BY UNAUTHORIZED USER(E.G. LOGON PROC)          40650000
NELSWBSP EQU   X'40'     SWB SUPPORT IS TO BE PROVIDED             @H1A 40700000
NELXA1   EQU   X'20'     CALLER SWA ABOVE INDICATOR                @L1A 40750000
NELSISO  EQU   X'10'     SYSIN/SYSOUT SWA BELOW INDICATOR          @L1A 40800000
NELWTOSP EQU   X'08'     SUPPRESS WTO MESSAGES                     @L4A 40816600
NELSMSBY EQU   X'04'     BYPASS DFSMS IDAX PROCESSING              @L4A 40833200
         DS    CL3       RESERVED                                  @L2C 40850000
NELJICA  DS    A         PTR TO JES/INTERPRETER COMMUNICATION AREA @L2A 40900000
NELISIZE EQU   *        USED TO DETERMINE SIZE OF INTERPRETER DATA @P1A 40950000
         AIF   ('&SUBCOM' EQ 'CI').ENDCI                           @P1A 41000000
         AGO   .ENDNEL                                             @P1A 41050000
.ENDCI   ANOP                                                      @P1A 41100000
         ORG   NELJCLCB+(NELCSIZE-NELJCLCB)                        @P1A 41150000
.ENDNEL  ANOP                                                           41200000
         SPACE 1                                                        41250000
*********************************************************************** 41300000
*                                                                     * 41350000
*  NEL EXIT LIST MAPPING                                              * 41400000
*                                                                     * 41450000
*********************************************************************** 41500000
         SPACE 1                                                        41550000
NELEXTLN EQU   &NELDUM - SYMBOLIC LENGTH OF EXIT LIST                   47300000
&N       SETA  1                                                        47400000
         AIF   (N'&EXITS EQ 0).GENCON                                   47500000
NELEXITS DS    0D                                                       47600000
NELEXHDR DS    0CL8      EXIT LIST HEADER RECORD                        47700000
NELEXLEN DS    H         LIST LENGTH                                    47800000
NELXRTCD DS    H         INTERPRETER RETURN CODE                        47900000
         DS    CL4                                                      48000000
.NEXT    ANOP                                                           48100000
.*  EXIT ENTRY NUMBER &N                                                48200000
         AIF   ('&EXITS(&N)' EQ 'IAM').GENENTY                          48300000
         AIF   ('&EXITS(&N)' EQ 'FAM').GENENTY                          48400000
         AIF   ('&EXITS(&N)' EQ 'QEP').GENENTY                          48500000
         AIF   ('&EXITS(&N)' EQ 'SMF').GENENTY                          48600000
         AIF   ('&EXITS(&N)' EQ 'TXT').GENENTY                          48700000
         AIF   ('&EXITS(&N)' EQ 'RTN').GENENTY                          48800000
         AIF   ('&EXITS(&N)' EQ 'QLP').GENENTY                 @G29AN2E 48833300
         AIF   ('&EXITS(&N)' EQ 'JDV').GENENTY                     @H1C 48866600
         AIF   ('&EXITS(&N)' EQ 'UJV').GENENTY                     @P2A 48883300
         MNOTE ,'INVALID NEL EXIT SPECIFIED'                            48900000
         MEXIT                                                          49000000
.GENENTY ANOP                                                           49100000
&EXITS(&N).EXIT DS 0CL8                                                 49200000
&EXITS(&N).EXLK DS XL1       LINKAGE DEFINITION                         49300000
&EXITS(&N).EXID DS XL1       EXIT IDENTIFICATION                        49400000
&EXITS(&N).EXEP DS CL6       ENTRY POINT                                49500000
         AIF   (N'&EXITS EQ &N).GENCON                                  49600000
&N       SETA  &N+1                                                     49700000
         AGO   .NEXT                                                    49800000
.GENCON  ANOP                                                           49900000
         SPACE 2                                                        49912500
*********************************************************************** 49925000
*                                                                     * 49937500
*              GENERAL EXIT LIST ENTRY MAPPING                        * 49950000
*                                                                     * 49962500
*********************************************************************** 49975000
         SPACE 2                                                        49987500
NELEXENT DS    0C                  ORIGIN ZERO                          50000000
NELEXLK  DS    CL1                 LINKAGE IDENTIFICATION               50012500
NELEXID  DS    CL1                 EXIT IDENTIFICATION                  50025000
NELEXEP  DS    CL6                 EXIT ENTRY POINT                     50037500
NELEXEPA EQU   NELEXEP+2           DISPL OF ADDR SPECIFIED              50050000
         SPACE 2                                                        50062500
*********************************************************************** 50075000
*                                                                     * 50087500
*  CONSTANTS USED IN EXIT LIST GENERATION                             * 50100000
*                                                                     * 50150000
*********************************************************************** 50200000
*                                                                     * 50212500
*  LINKAGE ID                                                         * 50225000
*                                                                     * 50237500
NELEXAD4 EQU   X'20'     ENTRY POINT SPECIFIED AS 4-BYTE ADDR  @G29AN2E 50250000
NELEXADD EQU   X'40'     ENTRY POINT SPECIFIED AS 3-BYTE ADDRESS        50300000
NELEXNAM EQU   X'80'     ENTRY POINT SPECIFIED AS 6-BYTE MODULE NAME    50400000
NELEXVCN EQU   X'C0'     ENTRY POINT SPECIFIED AS V-CON AT EXIT POINT   50500000
NELEXNOP EQU   X'00'     EXIT ENTRY IS TO BE IGNORED                    50600000
*                                                                     * 50640000
*                                                                     * 50680000
*  EXIT ID                                                            * 50720000
*                                                                     * 50760000
NELIAMEX EQU   X'40'     SPECIAL INPUT ACCESS METHOD EXIT ID            50800000
NELJDVEX EQU   X'30'     SPECIAL DATA JDVT NAME POINTER ID         @H1A 50850000
NELRTNEX EQU   X'20'     SPECIAL RETURN EXIT ID                         50900000
NELFAMEX EQU   X'10'     SPECIAL FIND ACCESS METHOD EXIT ID             51000000
NELQEPEX EQU   X'08'     SPECIAL QUEUE MANAGER ENTRY POINT ID           51100000
NELTXTEX EQU   X'80'     POST SCAN TEXT EXIT ID                         51200000
NELSMFEX EQU   X'07'     SYSTEM MANAGEMENT FACILITIES EXIT ID           51300000
NELQLPEX EQU   X'04'     SPECIAL QUEUE MANAGER FOR LOCATE MODE @G29AN2E 51333300
*                        ENTRY POINT ID                        @G29AN2E 51366600
NELUJVEX EQU   X'09'     IEFUJV with Subsystem Environment         @P2A 51377700
*                        Information ID                            @P2A 51388800
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 51400000
         MEND  , */                                                     51600002
*%NELBSL:;                                                              51700002
*%; /***************************************/                           51820002
*%; /*                                     */                           51870002
*%; /*   COMPUTE LENGTH OF NEL EXIT LIST   */                           51920002
*%; /*                                     */                           51970002
*%; /***************************************/                           52020002
*  % DCL NELDUM FIXED;                                                  52300000
*   % NELDUM = 0;                                                       52400000
*   % IF IAMEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    52500000
*   % IF FAMEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    52600000
*   % IF QEPEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    52700000
*   % IF SMFEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    52800000
*   % IF TXTEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    52900000
*   % IF RTNEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;                    53000000
*   % IF QLPEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;      /* @G29AN2E*/ 53033300
*   % IF JDVEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;      /*     @H1A*/ 53066600
*   % IF UJVEXIT ~= ' ' %THEN % NELDUM = NELDUM + 1;      /*     @P2A*/ 53083300
*   % NELDUM = 8*NELDUM;    /* NUMBER OF EXIT ENTRIES TIMES 8 */        53100000
*   % IF NELDUM = 0 %THEN %GOTO NELSTRT;   /* IF NO EXITS SPECIFIED ,   53200000
*                                             DONT ADD HEADER LENGTH */ 53300000
*   % NELDUM = NELDUM + 8;   /* ADD HEADER LENGTH  */                   53400000
*  % DCL NELLEN CHAR;                                                   53500000
*   % NELLEN = 'LENGTH(NELLIST)';   /* LENGTH OF THE NEL OPTION LIST */ 53600002
* % NELSTRT:;                                                           53800000
* %IF NELATTR = '' %THEN            /* SET A DEFAULT ATTRIBUTE   @L5A*/ 53833300
*   %NELATTR = 'BASED(NELPTR) BDY(DWORD)'; /*                    @L5A*/ 53866600
* DECLARE                                                               53900000
* 1 NEL NELATTR,                    /*                           @L5C*/ 54000000
* % IF SUBCOM='NO' % THEN % GOTO ENDNEL;      /*ERROR - INVALID      */ 54050000
* % IF SUBCOM='C' % THEN % GOTO NELBEGN;                                54100000
* % IF SUBCOM='I' % THEN % GOTO NELBEGN;                                54150000
* % IF SUBCOM='CI' % THEN % GOTO NELBEGN;     /*                 @P1A*/ 54200000
* % GOTO ENDNEL;   /* SPECIFICATION ERROR */                            54250000
* % NELBEGN:;                                                           54300000
*  2 NELLIST  BDY(DWORD),                                               54350000
* /*******************************************************************/ 54400000
* /*                                                                 */ 54450000
* /*  PTRS COMMON TO CONVERTER AND INTERPRETER ENTRANCE LIST         */ 54500000
* /*                                                                 */ 54550000
* /*******************************************************************/ 54600000
*   3 NELQMPA PTR(31),            /* PTR TO QMPA PROVIDING ACCESS       54650000
*                                    TO CALLER'S SWA                 */ 54700000
*   3 NELEXLST PTR(31),           /* PTR TO C/I'S LIST OF SPECIAL       54750000
*                                    EXITS                           */ 54800000
*   3 NELCOMID PTR(31),           /* PTR TO CONSOLE IDENTIFIER       */ 54850000
*   3 NELTXTCB PTR(31),           /* PTR TO OPEN ACB FOR INTERNAL       54900000
*                                    TEXT DATA SET                   */ 54950000
*   3 NELMSGCB PTR(31),           /* PTR TO OPEN ACB FOR MESSAGE        55000000
*                                    DATA SET                        */ 55050000
*   3 NELJMR PTR(31),             /* PTR TO JOB MANAGEMENT RECORD    */ 55100000
* /*******************************************************************/ 55150000
* /*                                                                 */ 55200000
* /*    NEL OPTION SWITCHES                                          */ 55250000
* /*                                                                 */ 55300000
* /*******************************************************************/ 55350000
*   3 NELOPSWT BIT(8),            /* OPTION SWITCHES                 */ 55400000
*    4 NELSMF  BIT(1),            /* IF ZERO, INDICATES A STARTED       55450000
*                                    TASK                    @VS49762*/ 55500000
*    4 NELTSOP BIT(1),            /* TERM=TS HAS BEEN SPECIFIED         55550000
*                                    AND OVERRIDES ALL OTHER PARMS      55600000
*                                    ON THE DD STATEMENT             */ 55650000
*    4 NELRECVY BIT(1),           /* PROCESSING IS IN RECOVERY MODE     55700000
*                                    AND MESSAGES ARE TO BE             55750000
*                                    SURPRESSED                      */ 55800000
*    4 NELCNDGM BIT(1),          /* USE CONDITIONAL GETMAINS @ZA54007*/ 55850000
*    4 NELNEW   BIT(1),          /* NEW FORMAT PARAMETER LIST    @L3A*/ 55875000
*    4 NELTERM  BIT(1),          /* TERMINATE CONVERTER ENV.     @L3A*/ 55900000
*    4  *  BIT(2),               /*                              @L3C*/ 55925000
*   3 NELSYSNP PTR(24),           /* POINTER TO NAME OF THE SUBSYSTEM   55950000
*                                   THAT SELECTED THIS JOB   @VS49762*/ 56000000
* % IF SUBCOM='I' % THEN % GOTO GENINTR;                                56050000
* /*******************************************************************/ 56100000
* /*                                                                 */ 56150000
* /*    CONVERTER POINTERS                                           */ 56200000
* /*                                                                 */ 56250000
* /*******************************************************************/ 56300000
*   3 NELJCLCB PTR(31),           /* PTR TO OPEN ACB FOR SPOOLED        56350000
*                                    JCL DATA SET                    */ 56400000
*   3 NELPROCB PTR(31),           /* PTR TO OPEN DCB FOR PROCEDURE      56450000
*                                    LIBRARY                         */ 56500000
*   3 NELSTMCB PTR(31),           /* PTR TO OPEN ACB FOR STATEMENT      56550000
*                                    IMAGE DATA SET                  */ 56600000
* /*******************************************************************/ 56650000
* /*                                                                 */ 56700000
* /*    CONVERTER PARM FIELD MAPPING                                 */ 56750000
* /*                                                                 */ 56800000
* /*******************************************************************/ 56850000
*   3 NELPARMO BIT(8),            /* PARAMETER OPTIONS               */ 56900000
*    4  *  BIT(5),                /* RESERVED                    @L1C*/ 56950000
*    4 NELXA2 BIT(1),             /* USER SWA ABOVE INDICATOR    @L1A*/ 57000000
*    4 NELACCT BIT(1),            /* ACCOUNT NUMBER REQUIRED         */ 57050000
*    4 NELPGMN  BIT(1),           /* PROGRAMMER NAME REQUIRED        */ 57100000
*   3 NELJPRTY CHAR(2),           /* DEFAULT JOB PRIORITY            */ 57150000
*   3 NELTIME CHAR(6),            /* DEFAULT FOR JOB TIME LIMIT      */ 57200000
*   3 NELREG CHAR(3),             /* DEFAULT REGION SIZE             */ 57250000
*   3 NELCOMDS CHAR(1),           /* COMMAND DISPOSITION                57300000
*                                    0 - EXECUTE COMMAND                57350000
*                                    1 - DISPLAY AND EXECUTE COMMAND    57400000
*                                    2 - DISPLAY AND REQUEST DISP       57450000
*                                    3 - IGNORE COMMAND              */ 57500000
*   3 NELLABEL CHAR(1),           /* LABEL PROCESSING                   57550000
*                                    0 - BLP WILL BE TREATED AS NL      57600000
*                                    1 - BLP TREATED AS BYPASS LABEL */ 57650000
*   3 NELAUTH CHAR(4),            /* MCS COMMAND AUTHORITY           */ 57700000
*   3 NELMSGL,                    /* MESSAGE LEVEL DEFAULTS      @L3A*/ 57737500
*    5 NELMSGL1 CHAR(1),          /* JCL MSGLEVEL DEFAULT            */ 57775000
*    5 NELMSGL2 CHAR(1),          /* ALLOCATION MSGLEVEL DEFAULT     */ 57812500
*   3 NELMSGCL CHAR(1),           /* DEFAULT MESSAGE CLASS           */ 57850000
*   3  *  CHAR(1),                /* RESERVED                    @L3C*/ 57875000
*   3 NELENVIR PTR(31) BDY(WORD,3);/* ADDRESS OF EXISTING CONVERTER     57900000
*                                    ENVIRONMENT                 @L3A*/ 57925000
* % IF SUBCOM='CI' % THEN % GOTO GENCI;       /* BOTH C & I      @P1A*/ 57950000
* % GOTO NELEXIT;                                                       58000000
* % GENCI:;                                   /*                 @P1A*/ 58050000
* DECLARE                                     /*                 @P1A*/ 58100000
* 1 NELCI DEFINED(NELJCLCB),                                            58150000
*   3 NELJCT PTR(31),             /* PTR TO JCT IN SWA           @P1A*/ 58200000
* % GOTO SKIPPTR;                             /*                 @P1A*/ 58250000
* % GENINTR:;                                                           58300000
* /*******************************************************************/ 58350000
* /*                                                                 */ 58400000
* /*    INTERPRETER POINTERS                                         */ 58450000
* /*                                                                 */ 58500000
* /*******************************************************************/ 58550000
*   3 NELJCT PTR(31),             /* PTR TO JCT IN SWA               */ 58600000
* % SKIPPTR:;                                 /*                 @P1A*/ 58650000
* /*******************************************************************/ 58700000
* /*                                                                 */ 58750000
* /*    INTERPRETER OPTION SWITCH                                    */ 58800000
* /*                                                                 */ 58850000
* /*******************************************************************/ 58900000
*   3 NELOPSW2 BIT(8),            /* OPTION SWITCHES-BYTE 2          */ 58950000
*    4 NELADSPC BIT(1),           /* FAIL JOB IF ADDRSPC=REAL CODED     59000000
*                                    BY UNAUTHORIZED USER(LOGON)     */ 59050000
*    4 NELSWBSP BIT(1),           /* SWB SUPPORT TO BE PROVIDED  @H1A*/ 59100000
*    4 NELXA1 BIT(1),             /* CALLER SWA ABOVE INDICATOR  @L1A*/ 59150000
*    4 NELSISO BIT(1),            /* SYSIN/SYSOUT ABOVE                 59200000
*                                    INDICATOR                   @L1A*/ 59250000
*    4 NELWTOSP BIT(1),           /* SUPPRESS WTO MESSAGES       @L4A*/ 59287500
*    4 NELSMSBY BIT(1),           /* BYPASS DFSMS IDAX PROCESSING@L4A*/ 59325000
*    4  *  BIT(2),                /* RESERVED                    @L4C*/ 59362500
*   3  *  CHAR(3),                /* RESERVED                    @L2C*/ 59400000
*   3  NELJICA PTR(31);           /* POINTER TO JES/INTERPRETER         59450000
*                                    COMMUNICATIONS AREA         @L2A*/ 59500000
* % NELEXIT:;                                                           59700000
* /*******************************************************************/ 59750000
* /*                                                                 */ 59800000
* /*     NEL EXIT LIST MAPPING                                       */ 59850000
* /*                                                                 */ 59900000
* /*******************************************************************/ 59950000
* % IF NELDUM = 0 % THEN          /* IF NO  EXITS SPECIFIED          */ 64300000
*   % GOTO GENCON;                /* DON'T EXPAND THE HEADER RECORD  */ 64400000
* DECLARE                                                               64500000
* 1 NELEXITS BDY(DWORD) BASED(NELEXLST), /*                      @H1C*/ 64600000
*   3 NELEXHDR  CHAR(8) BDY(WORD),/* EXIT LIST HEADER RECORD         */ 64700002
*    4 NELEXLEN FIXED(15),        /* LIST LENGTH                     */ 64800002
*    4 NELXRTCD FIXED(15),        /* INTERPRETER RETURN CODE         */ 64900002
*    4 * CHAR(4),                                                       65000000
*   % IF IAMEXIT = ' ' %THEN %GOTO NELEX1;                              65100000
*   3 IAMEXT  CHAR(8),                                                  65200000
*    4 NELIAMLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 65300000
*    4 NELIAMID CHAR(1),          /* EXIT IDENTIFICATION             */ 65400000
*    4 NELIAMEP CHAR(6),          /* ENTRY POINT                     */ 65500000
*  % NELEX1:;                                                           65600000
*   % IF FAMEXIT = ' ' %THEN %GOTO NELEX2;                              65700000
*   3 FAMEXT  CHAR(8),                                                  65800000
*    4 NELFAMLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 65900000
*    4 NELFAMID CHAR(1),          /* EXIT IDENTIFICATION             */ 66000000
*    4 NELFAMEP CHAR(6),          /* ENTRY POINT                     */ 66100000
*  % NELEX2:;                                                           66200000
*   % IF QEPEXIT = ' ' %THEN %GOTO NELEX3;                              66300000
*   3 QEPEXT  CHAR(8),                                                  66400000
*    4 NELQEPLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 66500000
*    4 NELQEPID CHAR(1),          /* EXIT IDENTIFICATION             */ 66600000
*    4 NELQEPEP CHAR(6),          /* ENTRY POINT                     */ 66700000
*  % NELEX3:;                                                           66800000
*   % IF SMFEXIT = ' ' %THEN %GOTO NELEX4;                              66900000
*   3 SMFEXT  CHAR(8),                                                  67000000
*    4 NELSMFLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 67100000
*    4 NELSMFID CHAR(1),          /* EXIT IDENTIFICATION             */ 67200000
*    4 NELSMFEP CHAR(6),          /* ENTRY POINT                     */ 67300000
*  % NELEX4:;                                                           67400000
*   % IF TXTEXIT = ' ' %THEN %GOTO NELEX5;                              67500000
*   3 TXTEXT  CHAR(8),                                                  67600000
*    4 NELTXTLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 67700000
*    4 NELTXTID CHAR(1),          /* EXIT IDENTIFICATION             */ 67800000
*    4 NELTXTEP CHAR(6),          /* ENTRY POINT                     */ 67900000
*  % NELEX5:;                                                           68000000
*  % IF RTNEXIT = ' ' %THEN %GOTO NELEX6; /*                 @G29AN2E*/ 68100000
*   3 RTNEXT  CHAR(8),                                                  68200000
*    4 NELRTNLK CHAR(1),          /* LINKAGE IDENTIFICATION          */ 68300000
*    4 NELRTNID CHAR(1),          /* EXIT IDENTIFICATION             */ 68400000
*    4 NELRTNEP CHAR(6),          /* ENTRY POINT                     */ 68500000
*  % NELEX6:;                     /*                         @G29AN2E*/ 68506600
*  % IF QLPEXIT = ' ' %THEN %GOTO NELEX7; /*                     @H1C*/ 68513200
*   3 QLPEXT  CHAR(8),            /*                         @G29AN2E*/ 68519800
*     4 NELQLPLK CHAR(1),         /*                         @G29AN2E*/ 68526400
*     4 NELQLPID CHAR(1),         /*                         @G29AN2E*/ 68533000
*     4 NELQLPEP CHAR(6),         /*                         @G29AN2E*/ 68539600
*  % NELEX7:;                     /*                             @H1A*/ 68546200
*  % IF JDVEXIT = ' ' %THEN %GOTO NELEX8; /*                     @P2C*/ 68552800
*   3 JDVEXT  CHAR(8) BDY(DWORD), /*                             @H1A*/ 68559400
*     4 NELJDVLK CHAR(1),         /* LINKAGE IDENTIFICATION      @H1A*/ 68566000
*     4 NELJDVID CHAR(1),         /* EXIT IDENTIFICATION         @H1A*/ 68572600
*     4 NELJDVEP CHAR(6) BDY(DWORD,3), /*                        @H1A*/ 68579200
*       5 * CHAR(2),              /*                             @H1A*/ 68585800
*       5 NELJDVTP PTR(31),       /* ADDRESS OF JDVT NAME        @H1A*/ 68592400
*  % NELEX8:;                     /*                             @P2A*/ 68593000
*   % IF UJVEXIT = ' ' %THEN %GOTO EXITEND; /*                   @P2A*/ 68593600
*   3 UJVEXT  CHAR(8) BDY(DWORD), /*                             @P2A*/ 68594200
*    4 NELUJVLK CHAR(1),          /* Linkage identification, set to     68594800
*                                    NELEXNOP to be ignored      @P2A*/ 68595400
*    4 NELUJVID CHAR(1),          /* Exit identification         @P2A*/ 68596000
*    4 NELUJVEP CHAR(6) BDY(DWORD,3), /*                         @P2A*/ 68596600
*       5 * CHAR(2),              /* Reserved                    @P2A*/ 68597200
*       5 NELUJV6 FIXED(31),      /* Caller's environment               68597800
*                                    information                 @P2A*/ 68598400
* % EXITEND:;                                                           68600000
*          10  * CHAR (1);        /* END OF LIST PLACEHOLDER         */ 68700002
* % GENCON:;                                                            68800000
*/*******************************************************************/  68807600
*/*                                                                 */  68815200
*/*   GENERAL EXIT LIST ENTRY MAPPING                               */  68822800
*/*                                                                 */  68830400
*/*******************************************************************/  68838000
* DECLARE                                                               68845600
* 1 NELEXENT BASED,                                                     68853200
*   3 NELEXLK CHAR(1),             /* LINKAGE IDENTIFICATION        */  68860800
*   3 NELEXID CHAR(1),             /* EXIT IDENTIFICATION           */  68868400
*   3 NELEXEP CHAR(6),             /* EXIT RTN ENTRY POINT          */  68876000
*     4    *   CHAR(2),            /* START IF NAME SPEC'D          */  68883600
*     4 NELEXEPA CHAR(4);          /* DISPL OF ADDR SPEC'D          */  68891200
*%; /**************************************************/                68900002
*%; /*     CONSTANTS USED IN EXIT LIST GENERATION     */                69000002
*%; /**************************************************/                69100002
*/********************************************************************/ 69106200
*/*   LINKAGE  ID                                                    */ 69112400
*/********************************************************************/ 69118600
*  % DCL NELEXAD4 CHAR;           /*                         @G29AN2E*/ 69125000
*  % NELEXAD4 = '''20''X';        /* ENTRY POINT GIVEN AS               69150000
*                                    4 BYTE PTR              @G29AN2E*/ 69175000
*  % DCL NELEXADD CHAR;                                                 69200000
*  % NELEXADD = '''40''X';        /* ENTRY POINT GIVEN AS 3-BYTE PTR.*/ 69300000
*  % DCL NELEXNAM CHAR;                                                 69400000
*  % NELEXNAM = '''80''X';        /* ENTRY POINT GIVEN AS 6-BYTE NAME*/ 69500000
*  % DCL NELEXVCN CHAR;                                                 69600000
*  % NELEXVCN = '''C0''X';        /* ENTRY POINT GIVEN AS VCON          69700002
*                                    AT EXIT POINT                   */ 69800002
*  % DCL NELEXNOP CHAR;                                                 69900000
*  % NELEXNOP = '''00''X';        /* EXIT ENTRY IS TO BE IGNORED     */ 70000000
*/********************************************************************/ 70025000
*/*   EXIT ID                                                        */ 70050000
*/********************************************************************/ 70075000
*  % DCL NELIAMEX CHAR;                                                 70100000
*  % NELIAMEX = '''40''X';        /* SPECIAL INPUT ACCESS METHOD ID  */ 70200000
*  % DCL NELJDVEX CHAR;           /*                             @H1A*/ 70225000
*  % NELJDVEX = '''30''X';        /* SPECIAL DATA JDVT NAME POINTER     70250000
*                                    ID                          @H1A*/ 70275000
*  % DCL NELRTNEX CHAR;                                                 70300000
*  % NELRTNEX = '''20''X';        /* SPECIAL RETURN EXIT ID          */ 70400000
*  % DCL NELFAMEX CHAR;                                                 70500000
*  % NELFAMEX = '''10''X';        /* SPECIAL FIND ACCESS METHOD      */ 70600000
*  % DCL NELQEPEX CHAR;                                                 70700000
*  % NELQEPEX = '''08''X';        /* SPECIAL Q-MNGR ENTRY POINT ID   */ 70800000
*  % DCL NELTXTEX CHAR;                                                 70900000
*  % NELTXTEX = '''80''X';        /* POST SCAN TEXT EXIT ID          */ 71000000
*  % DCL NELSMFEX CHAR;                                                 71100000
*  % NELSMFEX = '''07''X';        /* SYSTEM MANAGEMENT FACILITIES ID */ 71200000
*  % DCL NELQLPEX CHAR;           /*                         @G29AN2E*/ 71250000
*  % NELQLPEX = '''04''X';        /* SPECIAL Q-MNGR FOR LOCATE          71300000
*                                    MODE ENTRY POINT ID     @G29AN2E*/ 71350000
*  % DCL NELUJVEX CHAR;           /*                             @P2A*/ 71400000
*  % NELUJVEX = '''09''X';        /* IEFUJV with Subsystem Environment  71450000
*                                    Information ID              @P2A*/ 71500000
* %ENDNEL:;                                                             76000000
