*  %GOTO RSTBPRO;                        /*                             00050000
       MACRO                                                            00100000
       IEFRSTB                                                          00150000
.*/ %RSTBPRO: ;                                                         00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/*    MODULE NAME = IEFRSTB                                         */ 00350000
*/*                                                                  */ 00400000
*/*    DESCRIPTIVE NAME = MAPPING OF THE TABLE OF CODES ELIGIBLE     */ 00450000
*/*                       FOR AUTOMATIC RESTART                      */ 00500000
*/*                                                                  */ 00550000
*/*    COPYRIGHT =                                                   */ 00600000
*/*             5740-XC6                                             */ 00650000
*/*             CONTAINS RESTRICTED MATERIALS OF IBM.                */ 00700000
*/*             (C) COPYRIGHT IBM CORP. 1984, 1986                   */ 00750000
*/*             LICENSED MATERIALS - PROPERTY OF IBM                 */ 00800000
*/*             REFER TO COPYRIGHT INSTRUCTIONS                      */ 00850000
*/*             FORM NUMBER G120-2083.                               */ 00900000
*/*                                                                  */ 00950000
*/*    STATUS = OS/VS2 JBB2220                                       */ 01000000
*/*                                                                  */ 01050000
*/*    FUNCTION = MAPS THE RESTART CODES TABLE                       */ 01100000
*/*                                                                  */ 01150000
*/*    MODULE TYPE = MACRO                                           */ 01200000
*/*                                                                  */ 01250000
*/*    INVOCATION =                                                  */ 01300000
*/*                                                                  */ 01350000
*/*     BAL - IEFRSTB                                                */ 01400000
*/*                                                                  */ 01450000
*/*     PLAS - %INCLUDE SYSLIB(IEFRSTB)                              */ 01500000
*/*                                                                  */ 01550000
*/*    THE MAPPINGS OF THE CODES SECTION (RSTBSECT) AND THE          */ 01600000
*/*    INDIVIDUAL CODES (RSTBCODS) ARE BASED STRUCTURES THAT         */ 01650000
*/*    REQUIRE THE DECLARATION OF POINTER VARIABLES.                 */ 01700000
*/*                                                                  */ 01750000
*/*    CHANGE ACTIVITY =                                             */ 01800000
*/*     $L0 = IOGEN JBB2220  841119  PDN3: SUPPORT FOR IOGEN         */ 01850000
*/*                                      RESTRUCTURE                 */ 01900000
*/*                                                                  */ 01950000
*/********************************************************************/ 02000000
*/* A 000000-999999                                              @L0A*/ 02050000
*  %GOTO RSTBPLS;                 /*                                    02100000
RSTB      DSECT                      RESTART CODES TABLE                02150000
*********************************************************************** 02200000
*                                                                     * 02250000
*   RESTART CODES TABLE HEADER SECTION                                * 02300000
*                                                                     * 02350000
*********************************************************************** 02400000
RSTBHEAD  DS  0F                     START OF HEADER                    02450000
RSTBID    DS  CL4                    IDENTIFIER 'RSTB'                  02500000
RSTBVER   DS  XL1                    VERSION NUMBER                     02550000
RSTBRSRV  DS  CL3                    RESERVED                           02600000
*********************************************************************** 02650000
*                                                                     * 02700000
*   RESTART CODES TABLE POINTER SECTION                               * 02750000
*                                                                     * 02800000
*********************************************************************** 02850000
RSTBPTRS  DS  0F                     POINTER SECTION                    02900000
RSTBIBM   DS  A                      IBM CODES POINTER                  02950000
RSTBIBMN  DS  A                      END OF IBM CODES SECTION           03000000
RSTBUSR   DS  A                      USER CODES POINTER                 03050000
RSTBUSRN  DS  A                      END OF USER CODES SECTION          03100000
RSTBLAST  DS  A                      END OF CODES POINTER               03150000
*********************************************************************** 03200000
*                                                                     * 03250000
*   RESTART CODES TABLE CODES SECTION                                 * 03300000
*                                                                     * 03350000
*********************************************************************** 03400000
RSTBSECT  DSECT                      START OF CODES SECTION             03450000
RSTBSLEN  DS  XL2                    LENGTH OF CODES SECTION            03500000
RSTBCODS  DSECT                      RESTART CODES TABLE                03550000
RSTBCODE  DS  XL2                    INDIVIDUAL RESTART CODE            03600000
*********************************************************************** 03650000
*                                                                     * 03700000
*   ADDITIONAL DATA FOR THE RESTART CODES TABLE                       * 03750000
*                                                                     * 03800000
*********************************************************************** 03850000
RSTBCVER  EQU 01                     CURRENT VERSION NUMBER             03900000
          MEND                                                          03950000
.*/ %RSTBPLS: ;                                                         04000000
*/********************************************************************/ 04050000
*/*                                                                  */ 04100000
*/* RESTART CODES TABLE HEADER SECTION                               */ 04150000
*/*                                                                  */ 04200000
*/********************************************************************/ 04250000
* DCL 1 RSTB   BASED(JESRSTRT),    /* RESTART CODES TABLE            */ 04300000
*       3 RSTBHEAD BDY(WORD),      /* START OF HEADER SECTION        */ 04350000
*         5 RSTBID CHAR(4),        /* IDENTIFIER 'RSTB'              */ 04400000
*         5 RSTBVER FIXED(8),      /* VERSION NUMBER                 */ 04450000
*         5 RSTBRSRV CHAR(3),      /* RESERVED                       */ 04500000
*/********************************************************************/ 04550000
*/*                                                                  */ 04600000
*/* RESTART CODES TABLE POINTER SECTION                              */ 04650000
*/*                                                                  */ 04700000
*/********************************************************************/ 04750000
*         5 RSTBPTRS BDY(WORD),    /* POINTER SECTION                */ 04800000
*           7 RSTBIBM    PTR(31),  /* IBM CODES POINTER              */ 04850000
*           7 RSTBIBMN   PTR(31),  /* END OF IBM CODES SECTION       */ 04900000
*           7 RSTBUSR    PTR(31),  /* USER CODES POINTER             */ 04950000
*           7 RSTBUSRN   PTR(31),  /* END OF USER CODES SECTION      */ 05000000
*           7 RSTBLAST   PTR(31);  /* END OF CODES POINTER           */ 05050000
*/********************************************************************/ 05100000
*/*                                                                  */ 05150000
*/* RESTART CODES TABLE CODES SECTION                                */ 05200000
*/*                                                                  */ 05250000
*/********************************************************************/ 05300000
*  DCL 1 RSTBSECT BASED,           /* MAPPING OF CODES SECTION       */ 05350000
*        3 RSTBSLEN    FIXED(15);  /* LENGTH OF CODES SECTION        */ 05400000
*  DCL 1 RSTBCODS  BASED,          /* MAPPING OF LIST OF CODES       */ 05450000
*        3 RSTBCODE    FIXED(15);  /* INDIVIDUAL RESTART CODE        */ 05500000
*/********************************************************************/ 05550000
*/*                                                                  */ 05600000
*/* ADDITIONAL DATA FOR THE RESTART CODES TABLE                      */ 05650000
*/*                                                                  */ 05700000
*/********************************************************************/ 05750000
*  DCL RSTBCID CHAR(4) CONSTANT('RSTB'); /* IDENTIFIER               */ 05800000
*  DCL RSTBCVER FIXED(8) CONSTANT(1); /* CURRENT VERSION NUMBER      */ 05850000
