*        %GOTO SWBPRO;              /*                                  00050000
         MACRO                                                          00100000
         IEFSWB                                                         00150000
.*/ %SWBPRO: ;                                                          00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME = IEFSWB                                             */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = SCHEDULER WORK BLOCK                          */ 00450000
*/*                                                                  */ 00500000
*/* PROPRIETARY STATEMENT =                                          */ 00550000
*/*                                                                  */ 00700000
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */ 00708300
*/*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     */ 00716600
*/*  5695-047 (C) COPYRIGHT IBM CORP. 1982, 1990                     */ 00724900
*/*  SEE COPYRIGHT INSTRUCTIONS                                  @P2C*/ 00733200
*/*                                                                  */ 00741500
*/* STATUS =   HBB4420                                           @L4C*/ 00750000
*/*                                                                  */ 00800000
*/* FUNCTION = THE SCHEDULER WORK BLOCK (SWB) CONTAINS DATA          */ 00850000
*/*            IN THE FORMAT DEFINED IN JCL DEFINITION               */ 00900000
*/*            TABLES (JDT).                                         */ 00950000
*/*                                                                  */ 01000000
*/* MODULE TYPE = MACRO                                              */ 01050000
*/*                                                                  */ 01100000
*/* INVOCATION =                                                     */ 01150000
*/*                                                                  */ 01200000
*/*      ASM  -  IEFSWB                                              */ 01250000
*/*              DSECT ONLY                                          */ 01300000
*/*                                                                  */ 01350000
*/*      PL/S -  %INCLUDE SYSLIB(IEFSWB)                             */ 01400000
*/*              THE SWB IS DEFINED AS A BASED STRUCTURE             */ 01450000
*/*              BY DEFAULT BUT MAY BE OVERRIDDEN USING          @D1A*/ 01466600
*/*              %SWBATTR = '', 'BDY(WORD)', ETC.                @D1A*/ 01483200
*/*                                                                  */ 01500000
*/*                                                                  */ 01600000
*/* NOTES =                                                      @L2A*/ 01603600
*/*                                                              @L2A*/ 01607200
*/*    SWBFLAGS IS A WORD THAT IS USED IN A COMPARE AND SWAP     @L2A*/ 01610800
*/*    FOR SERIALIZING ON THE SWB CHAIN. EXTREME CARE SHOULD     @L2A*/ 01614400
*/*    BE TAKEN WHEN ADDING BITS TO THIS WORD. DYNAMICALLY       @L2A*/ 01618000
*/*    UPDATEABLE BITS SHOULD NOT BE DEFINED WITHIN THIS FIELD   @L2A*/ 01621600
*/*    UNLESS THEY ARE EXPLICITLY CHECKED BY IEFSJSER BEFORE     @L2A*/ 01625200
*/*    ATTEMPTING TO SERIALIZE ON THE SWB CHAIN.                 @L2A*/ 01628800
*/*                                                              @L3A*/ 01629000
*/*    SWBNEXT is used for four different queues:                @L3A*/ 01629200
*/*    1.  Chain of SWBs representing a single JCL Verb (original    */ 01629400
*/*        definition).                                              */ 01629600
*/*    2.  Chain of SWBs that have been logically deleted and        */ 01629800
*/*        are not referenced SWB chains (delete q).             @P1C*/ 01630000
*/*    3.  Chain of SWBs that have been unchained from the anchor    */ 01630200
*/*        SWB chain and are not yet ready to be freed               */ 01630300
*/*        (unchained q).                                        @P1C*/ 01630400
*/*    4.  Chain of SWBs that have been unchained from the anchor    */ 01630500
*/*        SWB chain and are ready to be freed (free q).         @P1C*/ 01630600
*/*    Numbers 2, 3 and 4 above are used by the shared latch     @P1C*/ 01630700
*/*    processing to physically delete the anchor SWBs when          */ 01630800
*/*    they have been logically deleted and there are no             */ 01631000
*/*    outstanding references (use count is zero).  Refer to         */ 01631500
*/*    macro IEFSJSLW and module IEFSJSLS for information on how     */ 01632000
*/*    the SWBNEXT field is used for the different queues.       @P1C*/ 01632500
*/*                                                                  */ 01633200
*/* CHANGE ACTIVITY = H0,L1,D1,T0,L2,L3,P1,P2,L4                 @L4C*/ 01638700
*/*                                                                  */ 01644200
*/*                                                                  */ 01647000
*/* $H0=EXTJCL JBB2110 820702 PD2N: SUPPORT OF EXTENDED JCL          */ 01649800
*/* $L1=SMSSTG2 JBB2223 860512 PDN4: STOR MGMT SUBSYS STG2 SUP   @L1A*/ 01666400
*/* $D1=DCR0023 JBB2223 861117 PDT4: DYNAMIC OUTPUT SUPPORT      @D1A*/ 01683000
*/* $T0=OY22236 HBB3310 890403 PDY1: ONE USE SUPPORT             @T0A*/ 01691500
*/* $L2=SERVC   HBB4410 871102 PDN4: SERVICEABILITY              @L2A*/ 01695700
*/* $L3=EMVS2   HBB4410 890626 PDDZ: SWB Serialization           @L3A*/ 01697100
*/* $P1=PEO2733 HBB4410 891127 PDDZ: SWB Serialization Cleanup   @P1A*/ 01698500
*/* $P2=PEO3528 HBB4410 900226 PDDZ: Clean up copyright          @P2A*/ 01699200
*/* $L4= APPC1  HBB4420 900990 PDCL: SJF Performance             @L4A*/ 01699600
*/********************************************************************/ 01700000
*/* A 000000-999999                                              @H0A*/ 01750000
*/* A FIELD TO STORE THE JCL STATEMENT NUMBER                    @L1A*/ 01766600
*/* A BITS SWBDYNS AND SWBLDEL                                   @D1A*/ 01783200
*/* A DEFINED BIT FOR CREATION OF ONE USE SWB CHAINS             @T0A*/ 01787400
*/* A USE COUNT FIELD FOR USE WITH SJF SERIALIZE                 @L2A*/ 01797900
*/* C - Changed the description for SWBNEXT.  The field is also  @L3A*/ 01798300
*/*     used for shared latch processing of anchor SWBs.         @L3A*/ 01798700
*/* A - An indicator to reflect that the SWB use count field     @L3A*/ 01799100
*/*     maxed out and the SWB will never be available for reuse. @L3A*/ 01799500
*/* C - Changed copyright.                                       @L3A*/ 01799700
*/* C - Changed description of SWBNEXT to match usage in shared      */ 01799800
*/*     latch serialization scheme.                              @P1A*/ 01799900
*/* C - Changed copyright to SP410 standard                      @P2A*/ 01816600
*/* C - Add character string qualifier to validity bits          @L4A*/ 01824900
*        %GOTO SJSWB;    /*                                             01833300
SWB      DSECT                                                          01850000
SWBPREFX DS    0F                      SWB PREFIX                       01900000
SWBVERS  DS    XL1                     VERSION NUMBER                   01950000
SWBRSV1  DS    XL1                     RESERVED                         02000000
SWBID    DS    0XL10                   SWB IDENTIFICATION               02050000
SWBOWNM  DS    CL8                     OWNER NAME                       02100000
SWBBKID  DS    XL2                     BLOCK ID                         02150000
SWBCHNID DS    0XL16                   SWB CHAIN IDENTIFICATION         02200000
SWBVERB  DS    CL8                     VERB                             02250000
SWBVRBL  DS    CL8                     VERB LABEL                       02300000
SWBFLAGS DS    0CL4                    SWB FLAGS - SEE "NOTES" FOR      02316600
*                                      MORE INFORMATION            @L2C 02333200
SWBFLAG1 DS    XL1                     FLAG BYTE, RESERVED              02350000
SWBFLAG2 DS    XL1                     FLAG BYTE                        02400000
SWBNSWA  EQU   X'80'                   SWB DOES NOT RESIDE IN SWA -     02420000
*                                      NOTE: THIS BIT IS SET ONCE AND   02440000
*                                      WILL NOT CHANGE. IT IS SET       02460000
*                                      IN EACH SWB ON THE CHAIN    @L2C 02480000
SWBLDEL  EQU   X'40'                   SWB IS LOGICALLY DELETED -  @D1A 02500000
*                                      THIS FIELD CAN CHANGE       @D1A 02520000
*                                      DYNAMICALLY, AND IS SET ON  @D1A 02525000
*                                      ONLY IN THE FIRST SWB ON THE     02530000
*                                      CHAIN                       @L2C 02535000
SWBDYNS  EQU   X'20'                   SWB WAS DYNAMICALLY CREATED @D1A 02540000
*                                      THIS IS SET ON ONLY IN THE       02540800
*                                      FIRST SWB ON THE CHAIN      @L2C 02541600
SWBONEUS EQU   X'10'                   SWB IS THE HEADER SWB ON A ONE   02542500
*                                      USE SWB CHAIN (THIS FIELD CAN    02545000
*                                      CHANGE DYNAMICALLY)         @T0A 02547500
SWBMAXED EQU   X'08'                   SWB use count exceeded           02551800
*                                      maximum value.  The SWB will     02556100
*                                      never be available for reuse.    02560400
*                                      Field is set dynamically and     02564700
*                                      only in anchor SWB.         @L3A 02569000
SWBUSECT DS    XL2                     USE COUNT - INDICATES NUMBER OF  02573600
*                                      ACTIVE USES ON THIS SWB CHAIN    02582300
*                                                                  @L2C 02591000
SWBNEXT  DS    F                       Address of next SWB's SWA        02606500
*                                      block prefix on same chain.      02622000
*                                      This field is also used in       02637500
*                                      the shared latch processing      02653000
*                                      to delete anchor SWBs.  Refer    02668500
*                                      to prologue 'Notes'.        @P1C 02684000
SWBCHNXT DS    F                       ADDR OF NEXT SWB ON NEXT         02700000
*                                      CHAIN (APPLICABLE TO             02750000
*                                      FIRST SWB ON CHAIN,              02800000
*                                      OTHERWISE ZERO)                  02850000
SWBSTMT  DS    XL4                     JCL STATEMENT NUMBER       @L1A  02883300
SWBRSV3  DS    CL4                     RESERVED                   @L1C  02916600
**********************************************************************  02950000
*                                                                    *  03000000
* THE SWB DATA EXTENT IS COMPRISED OF A 128 BYTE DATA PORTION        *  03050000
* AND 16 BYTES OF VALIDITY INDICATORS.  FOR EACH BYTE IN THE         *  03100000
* SWB DATA PORTION, THERE IS A CORRESPONDING BIT IN THE VALIDITY     *  03150000
* INDICATORS.  IF DATA HAS BEEN STORED IN THAT BYTE,THE VALIDITY     *  03200000
* INDICATOR WILL BE ON, OTHERWISE THE BIT WILL BE OFF.               *  03250000
*                                                                    *  03300000
* THE DATA PORTION OF THE SWB IS BUILT FROM INFORMATION THAT IS      *  03350000
* DEFINED THROUGH THE SCHEDULER JCL FACILITY (SJF), AND ITS          *  03400000
* FORMAT IS DEFINED IN A JCL DEFINITION TABLE (JDT).                 *  03450000
*                                                                    *  03500000
**********************************************************************  03550000
SWBEXTNT DS    0CL144                  SWB DATA EXTENT                  03600000
SWBVCHAR DS    0CL16                   STRING OF VALIDITY INDICATORS    03616600
*                                                                 @L4A  03633200
SWBVALID DS    16XL1                   VALIDITY INDICATORS              03650000
SWBDATA  DS    CL128                   SWB DATA PORTION                 03700000
SWBLGTH  EQU   *-SWB                   SIZE OF FIXED AREA OF SWB        03750000
**********************************************************************  03800000
*                                                                    *  03850000
*  ADDITIONAL DATA FOR THE SWB                                       *  03900000
*                                                                    *  03950000
**********************************************************************  04000000
SWBCVERS EQU   2                       CURRENT VERSION            @L1C  04050000
         MEND                                                           04100000
.*/ %SJSWB: ;                                                           04150000
*%IF SWBATTR = '' %THEN            /* IF THE SWB ATTRIBUTES ARE NOT     04166600
*                                     SPECIFIED THEN SET A DEFAULT      04183200
*                                                                @D1A*/ 04199800
*   %SWBATTR = 'BASED';            /* SET THE DEFAULT TO BASED   @D1A*/ 04216400
*DCL 1 SWB SWBATTR,                /*                            @D1C*/ 04233000
*     2 SWBPREFX,                  /* SWB PREFIX                     */ 04250000
*      3 SWBVERS  FIXED(8),        /* VERSION NUMBER                 */ 04300000
*      3 SWBRSV1  FIXED(8),        /* RESERVED                       */ 04350000
*      3 SWBID,                    /* SWB IDENTIFICATION             */ 04400000
*       4 SWBOWNM  CHAR(8),        /* OWNER NAME                     */ 04450000
*       4 SWBBKID  FIXED(16),      /* BLOCK ID                       */ 04500000
*      3 SWBCHNID,                 /* SWB CHAIN IDENTIFICATION       */ 04550000
*       4 SWBVERB  CHAR(8),        /* VERB                           */ 04600000
*       4 SWBVRBL  CHAR(8),        /* VERB LABEL                     */ 04650000
*      3 SWBFLAGS,                 /* SWB FLAG BITS - SEE NOTES  @D1A*/ 04678500
*       4 SWBFLAG1  BIT(8),        /* FLAG BYTE, RESERVED            */ 04707000
*       4 SWBFLAG2  BIT(8),        /* FLAG BYTE                      */ 04735500
*        5 SWBNSWA  BIT(1),        /* SWB DOES NOT RESIDE IN SWA. NOTE: 04746900
*                                     THIS BIT IS SET ONCE AND WILL NOT 04758300
*                                     CHANGE. IT IS SET ON IN EACH SWB  04769700
*                                     ON THE CHAIN               @L2C*/ 04781100
*        5 SWBLDEL  BIT(1),        /* SWB IS LOGICALLY DELETED          04792500
*                                     (THIS BIT CAN CHANGE              04821000
*                                     DYNAMICALLY, AND IS SET           04835200
*                                     ON ONLY IN THE FIRST SWB          04849400
*                                     ON THE CHAIN)              @L2C*/ 04863600
*        5 SWBDYNS  BIT(1),        /* SWB WAS DYNAMICALLY CREATED       04878000
*                                     THIS IS SET ON ONLY IN THE        04891300
*                                     FIRST SWB ON THE CHAIN     @L2C*/ 04904600
*        5 SWBONEUS BIT(1),        /* SWB IS THE HEADER ON A ONE USE    04917900
*                                     SWB CHAIN (THIS BIT CAN CHANGE    04929300
*                                     DYNAMICALLY)               @T0A*/ 04940700
*        5 SWBMAXED BIT(1),        /* SWB use count exceeded            04941500
*                                     maximum value.  The SWB will      04942300
*                                     never be available for reuse      04943100
*                                     Field is set dynamically and      04943900
*                                     only in anchor SWB.        @L3A*/ 04944700
*        5 *        BIT(3),        /* RESERVED                   @L3C*/ 04945500
*       4 SWBUSECT  FIXED(16),     /* USE COUNT - INDICATES NUMBER OF   04958700
*                                     ACTIVE USES ON THIS SWB CHAIN     04965400
*                                                                @L2C*/ 04978700
*      3 SWBNEXT   PTR(31),        /* Address of next SWB's SWA block   04984600
*                                     prefix on same chain.  This field 04990500
*                                     is also used in the shared latch  04996400
*                                     processing to delete anchor       05002300
*                                     SWBs.  Refer to prologue 'Notes'. 05008200
*                                                                @P1C*/ 05014100
*      3 SWBCHNXT  PTR(31),        /* ADDR OF NEXT SWB ON NEXT CHAIN    05020500
*                                     (APPLICABLE TO FIRST SWB ON       05050000
*                                     CHAIN, OTHERWISE ZERO)         */ 05100000
*      3 SWBSTMT  FIXED(32),       /* JCL STATEMENT NUMBER       @L1A*/ 05133300
*      3 SWBRSV3  CHAR(4),         /* RESERVED                   @L1C*/ 05166600
*/********************************************************************/ 05200000
*/*                                                                  */ 05250000
*/* THE SWB DATA EXTENT IS COMPRISED OF A 128 BYTE DATA PORTION      */ 05300000
*/* AND 16 BYTES OF VALIDITY INDICATORS.  FOR EACH BYTE IN THE       */ 05350000
*/* SWB DATA PORTION, THERE IS A CORRESPONDING BIT IN THE VALIDITY   */ 05400000
*/* INDICATORS.  IF DATA HAS BEEN STORED IN THAT BYTE, THE VALIDITY  */ 05450000
*/* INDICATOR WILL BE ON, OTHERWISE THE BIT WILL BE OFF.             */ 05500000
*/*                                                                  */ 05550000
*/* THE DATA PORTION OF THE SWB IS BUILT FROM INFORMATION THAT IS    */ 05600000
*/* DEFINED THROUGH THE SCHEDULER JCL FACILITY (SJF), AND ITS        */ 05650000
*/* FORMAT IS DEFINED IN A JCL DEFINITION TABLE (JDT).               */ 05700000
*/*                                                                  */ 05750000
*/********************************************************************/ 05800000
*     2 SWBEXTNT CHAR(144),        /* SWB DATA EXTENT                */ 05850000
*      3 SWBVCHAR CHAR(16),        /* STRING OF VALIDITY INDICATORS     05875000
*                                                                @L4A*/ 05900000
*       4 SWBVALID(16) BIT(8),     /* VALIDITY INDICATORS        @L4C*/ 05925000
*      3 SWBDATA  CHAR(128);       /* SWB DATA PORTION               */ 05950000
*/********************************************************************/ 06000000
*/*                                                                  */ 06050000
*/*   ADDITIONAL DATA FOR THE SWB                                    */ 06100000
*/*                                                                  */ 06150000
*/********************************************************************/ 06200000
*   DCL SWBCVERS FIXED(8) CONSTANT(2), /* CURRENT VERSION NUMBER @L1C*/ 06250000
*       SWBCID   CHAR(4) CONSTANT('SWB '); /* SWB IDENTIFIER (STORED    06300000
*                                          IN SWA PREFIX)            */ 06350000
*/*                                                                  */ 06400000
*/****************************END OF IEFSWB***************************/ 06450000
