*        %GOTO SJDLPRO;            /*                                   00050000
         MACRO                                                          00100000
         IEFSJDLP  &DSECT=YES                                           00150000
.*/ %SJDLPRO: ;                                                         00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME = IEFSJDLP                                           */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = SCHEDULER JCL FACILITY DELETE SCHEDULER WORK  */ 00450000
*/*                    BLOCK (SWB) PARAMETER LIST                    */ 00500000
*/*                                                                  */ 00550000
*/* COPYRIGHT = 5740-XC6                                             */ 00600000
*/*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"          */ 00650000
*/*             (C) COPYRIGHT IBM CORP. 1982, 1987                   */ 00700000
*/*             LICENSED MATERIAL - PROPERTY OF IBM                  */ 00750000
*/*             REFER TO COPYRIGHT INSTRUCTIONS                      */ 00800000
*/*             FORM NUMBER G120-2083.                           @D1C*/ 00850000
*/*                                                                  */ 00900000
*/* STATUS = OS/VS2 JBB2223                                      @D1C*/ 00950000
*/*                                                                  */ 01000000
*/* FUNCTION = MAPPING FOR THE SCHEDULER JCL FACILITY DELETE SWB     */ 01050000
*/*            PARAMETER LIST.                                       */ 01100000
*/*                                                                  */ 01150000
*/* MODULE TYPE = MACRO                                              */ 01200000
*/*                                                                  */ 01250000
*/* INVOCATION =                                                     */ 01300000
*/*                                                                  */ 01350000
*/*   BAL  - IEFSJDLP DSECT=YES OR NO                                */ 01400000
*/*          DSECT=YES IS THE DEFAULT                                */ 01450000
*/*          DEFINE A  CONSTANT EQUAL TO                             */ 01500000
*/*          'SJDL' TO  STORE IN SJDLCID.                            */ 01550000
*/*                                                                  */ 01600000
*/*   PL/S - %DCL SJDLATRB CHAR                                      */ 01650000
*/*          %SJDLATRB = 'BASED' OR 'BDY(WORD)' OR ''                */ 01700000
*/*          %INCLUDE SYSLIB(IEFSJDLP)                               */ 01750000
*/*                                                                  */ 01800000
*/* NOTES =                                                          */ 01850000
*/*                                                                  */ 01900000
*/*   THE FIRST 16 BYTES (UP TO AND INCLUDING SJDLREAS) ARE          */ 01950000
*/*   COMMON MAPPING AREAS FOR ALL SCHEDULER JCL FUNCTIONS.          */ 02000000
*/*                                                                  */ 02050000
*/*   The token must point to a SWB chain that contains the      @D1A*/ 02054000
*/*   anchor address of the SWB chain for physical               @D1A*/ 02058000
*/*   SWB chain deletion.  The token must point directly to the  @D1A*/ 02062000
*/*   SWB chain for a logical SWB chain deletion.                @D1A*/ 02066000
*/*                                                                  */ 02070000
*/*   For example, if an SJF Token points to a SWB chain 'A'     @D1A*/ 02074000
*/*   which is followed by a SWB chain 'B' as illustrated        @D1A*/ 02078000
*/*   below, then:                                               @D1A*/ 02082000
*/*                                                                  */ 02086000
*/*     Token                                                    @D1A*/ 02090000
*/*    +-------+                                                 @D1A*/ 02094000
*/*    |       |                                                 @D1A*/ 02098000
*/*    +-------+  ===>  SWB CHAIN A                              @D1A*/ 02102000
*/*    |       |        |                                        @D1A*/ 02106000
*/*    +-------+        V                                        @D1A*/ 02110000
*/*                     SWB CHAIN B                              @D1A*/ 02114000
*/*                                                                  */ 02118000
*/*  -For logical deletion SWB chain A is deleted.               @D1A*/ 02122000
*/*                                                                  */ 02126000
*/*  -For physical deletion SWB chain B is deleted (this is      @D1A*/ 02130000
*/*   because SWB chain B's anchor is stored in SWB chain A).    @D1A*/ 02134000
*/*                                                                  */ 02138000
*/* CHANGE ACTIVITY = H0,L1,D1                                   @D1C*/ 02142000
*/*                                                                  */ 02146000
*/*  $H0= EXTJCL  JBB2110 820702 PDC5: EXTENDED JCL SUPPORT          */ 02150000
*/*  $L1= SWABOVE JBB2220 850805 PDT3: SWA ABOVE THE LINE        @L1A*/ 02200000
*/*  $D1= DCR0023 JBB2223 861117 PDT4: DYNAMIC OUTPUT SUPPORT    @D1A*/ 02225000
*/*                                                                  */ 02250000
*/********************************************************************/ 02300000
*/* A 000000-999999                                              @H0A*/ 02350000
*/* A UPDATE DESCRIPTION OF TOKEN FIELDS                         @L1A*/ 02400000
*/* A BIT (SJDLLDEL) TO INDICATE THAT THE SWB CHAIN POINTED TO   @D1A*/ 02416600
*/*   BY THE TOKEN SHOULD BE LOGICALLY DELETED                   @D1A*/ 02433200
*        %GOTO SJDLPLS;            /*                                   02450000
         AIF   ('&DSECT' EQ 'NO').NODSECT                               02500000
SJDLP    DSECT                                                          02550000
         AGO   .CONT                                                    02600000
.NODSECT ANOP                                                           02650000
SJDLP    DS    0F                                                       02700000
.CONT    ANOP                                                           02750000
SJDLID   DS    CL4                 IDENTIFIER 'SJDL'                    02800000
SJDLVERS DS    XL1                 VERSION NUMBER                       02850000
SJDLFLAG DS    XL1                 CONTROL FLAG BYTE                    02900000
SJDLNREC EQU   X'80'               NO RECOVERY                          02950000
SJDLNOCU EQU   X'40'               NO CLEANUP                           03000000
SJDLLEN  DS    H                   LENGTH OF PARAMETER LIST             03050000
SJDLSTOR DS    A                   LOCAL STORAGE POINTER OR ZERO        03100000
SJDLREAS DS    F                   REASON CODE                          03150000
SJDLRSV1 DS    F                   RESERVED                             03200000
SJDLTOKN DS    0CL8                SWB CHAIN TOKEN (SEE NOTE ABOVE)     03250000
SJDLANBK DS    A                   ADDRESS OF CONTROL BLOCK FOR         03300000
*                                  A JCL STATEMENT (JCT, SCT, SIOT      03350000
*                                  OR SWB) OR THE ADDRESS OF A          03400000
*                                  SWB CHAIN                            03450000
SJDLANCA DS    A                   ADDRESS OF A WORD POINTING TO        03500000
*                                  A SWB CHAIN OR ZERO                  03550000
SJDLFUNC DS    XL1                 FUNCTION FLAGS FOR DELETE       @D1A 03570000
SJDLLDEL EQU   X'80'               LOGICALLY DELETE THE SWB CHAIN  @D1A 03590000
*                                  INDICATED BY THE TOKEN          @D1A 03610000
SJDLRSV2 DS    CL3                 RESERVED                        @D1C 03630000
*********************************************************************** 03650000
*                                                                     * 03700000
*   ADDITIONAL DATA NEEDED FOR PARAMETER LIST                         * 03750000
*                                                                     * 03800000
*********************************************************************** 03850000
SJDLCVER EQU   1                   VERSION NUMBER                       03900000
SJDLFIXD EQU   *-SJDLP             LENGTH OF DELETE PARAMETER LIST      03950000
         MEND                                                           04000000
.*/ %SJDLPLS: ;                                                         04050000
*DECLARE                                                                04100000
*  1 SJDLP  SJDLATRB,              /* DELETE SWB PARAMETER LIST      */ 04150000
*    2 SJDLID      CHAR(4),        /* IDENTIFIER C'SJDL'             */ 04200000
*    2 SJDLVERS    FIXED(8),       /* VERSION NUMBER                 */ 04250000
*    2 SJDLFLAG    BIT(8),         /* CONTROL FLAG BYTE              */ 04300000
*      3 SJDLNREC    BIT(1),       /* NO RECOVERY                    */ 04350000
*      3 SJDLNOCU    BIT(1),       /* NO CLEANUP                     */ 04400000
*      3 *           BIT(6),       /* RESERVED                       */ 04450000
*    2 SJDLLEN     FIXED(15),      /* LENGTH OF PARAMETER LIST       */ 04500000
*    2 SJDLSTOR    PTR(31),        /* LOCAL STORAGE POINTER OR ZERO  */ 04550000
*    2 SJDLREAS    FIXED(31),      /* REASON CODE                    */ 04600000
*    2 SJDLRSV1    CHAR(4),        /* RESERVED                       */ 04650000
*    2 SJDLTOKN,                   /* SWB CHAIN TOKEN (SEE NOTE ABOVE)  04683300
*                                                                    */ 04716600
*      3 SJDLANBK    PTR(31),      /* ADDRESS OF CONTROL BLOCK FOR      04750000
*                                     A JCL STATEMENT (JCT, SCT, SIOT   04800000
*                                     OR SWB) OR THE ADDRESS OF A       04850000
*                                     SWB CHAIN                      */ 04900000
*      3 SJDLANCA    PTR(31),      /* ADDRESS OF A WORD POINTING        04950000
*                                     TO A SWB CHAIN OR ZERO         */ 05000000
*    2 SJDLFUNC,                   /* FUNCTION FLAGS FOR DELETE  @D1A*/ 05014200
*      3 SJDLLDEL BIT(1),          /* LOGICALLY DELETE THE SWB          05028400
*                                     CHAIN INDICATED BY THE TOKEN      05042600
*                                                                @D1A*/ 05056800
*      3 *        BIT(7),          /* RESERVED                   @D1A*/ 05071000
*    2 SJDLRSV2    CHAR(3);        /* RESERVED                   @D1C*/ 05085200
*/********************************************************************/ 05100000
*/*                                                                  */ 05150000
*/* ADDITIONAL DATA NEEDED FOR PARAMETER LIST                        */ 05200000
*/*                                                                  */ 05250000
*/********************************************************************/ 05300000
*DECLARE                                                                05350000
*  SJDLCID  CHAR(4)  CONSTANT('SJDL'),/* IDENTIFIER                  */ 05400000
*  SJDLCVER FIXED(8) CONSTANT(1);  /* VERSION NUMBER                 */ 05450000
