* %GOTO SSSOCMT;              /*                               @ZA34144 00050000
         MACRO                                                 @ZA34144 00100000
         IEFSSSO &SOEXT=NO                                         @T1C 00150000
.*/ %SSSOCMT:;                /*                             @ZA34144*/ 00200000
*/****START OF SPECIFICATIONS************************************@P1C*/ 00250000
*/*                                                          @T0268C6*/ 00300000
*/*  MACRO NAME = IEFSSSO                                        @P1C*/ 00325000
*/*                                                                  */ 00350000
*/*  ACRONYM = SSSO                                              @P1C*/ 00375000
*/*                                                          @T0268C6*/ 00400000
*/*                                                                  */ 00437500
*/* DESCRIPTIVE NAME=SSOB Extension for Processing SYSOUT            */ 00462500
*/*                  Datasets                                    @P1C*/ 00487500
*/*                                                                  */ 00512500
*/*01* PROPRIETARY STATEMENT=                                        */ 00562500
*/***PROPRIETARY_STATEMENT********************************************/ 00612500
*/*                                                                  */ 00750000
*/*                                                                  */ 00765000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00780000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00795000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1981, 1993                      */ 00810000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00825000
*/*                                                                  */ 00840000
*/* STATUS= HBB5510                                                  */ 00855000
*/*                                                                  */ 00870000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00885000
*/*                                                          @T0268C6*/ 00900000
*/*  MODULE TYPE = MACRO                                     @T0268C6*/ 01050000
*/*                                                          @T0268C6*/ 01100000
*/*  FUNCTION = Parameter list for the Subsystem Interface for       */ 01105500
*/*             processing sysout datasets.                      @P1A*/ 01111000
*/*                                                                  */ 01116500
*/*  NOTES = None                                                @P3C*/ 01124800
*/*                                                                  */ 01133200
*/*01* EXTERNAL CLASSIFICATION:                                  @P4C*/ 01139800
*/*02* GUPI: BASE                                                @P4A*/ 01146400
*/*02* DMTI: FIELDS                                              @P4A*/ 01153000
*/*          SSSOFLG3  SSSOFLG4  SSSOGRID                        @P4A*/ 01159600
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P3A*/ 01166400
*/*                                                                  */ 01183000
*/** INVOCATION ******************************************************/ 01199600
*/*                                                                  */ 01216200
*/*01* METHOD OF ACCESS =                                        @P3A*/ 01232800
*/*                                                                  */ 01249400
*/*02* BAL =                                                     @P3A*/ 01266000
*/*           THE MACRO HAS TWO CALLING SEQUENCES:           @T0268C6*/ 01282600
*/*           1) IEFJSSOB (SO,...),CONTIG=YES/NO             @T0268C6*/ 01300000
*/*                                                                  */ 01350000
*/*                  WHERE THE VALUES WITHIN THE PARENTHESES @T0268C6*/ 01400000
*/*                  ARE THE FUNCTION IDS OF THE INDIVIDUAL  @T0268C6*/ 01450000
*/*                  SSI EXTENSIONS REQUESTED. SO IS THE     @T0268C6*/ 01500000
*/*                  FUNCTION ID FOR THE PROCESS SYSOUT DATA @T0268C6*/ 01550000
*/*                  SETS EXTENSION. ALSO PRODUCED IS THE    @T0268C6*/ 01600000
*/*                  SSOB HEADER.                            @T0268C6*/ 01650000
*/*                                                                  */ 01700000
*/*                  CONTIG=NO RESULTS IN A DSECT BEING      @T0268C6*/ 01750000
*/*                  GENERATED BETWEEN THE SSOB HEADER AND   @T0268C6*/ 01800000
*/*                  THE EXTENSION.                          @T0268C6*/ 01850000
*/*                                                                  */ 01900000
*/*                  CONTIG=YES RESULTS IN THE EXTENSION     @T0268C6*/ 01950000
*/*                  BEING CONTIGUOUS WITH THE SSOB HEADER.  @T0268C6*/ 02000000
*/*                  (THIS IS THE DEFAULT)                   @T0268C6*/ 02050000
*/*                                                                  */ 02100000
*/*           2) SSSO DSECT (OPTIONAL)                       @T0268C6*/ 02150000
*/*                  IEFSSSO   SOEXT=YES/NO                      @T1C*/ 02200000
*/*                                                                  */ 02250000
*/*                  SOEXT= YES-PRODUCE EXTENDED SYSOUT          @T1C*/ 02300000
*/*                         DATA FIELDS                          @T1C*/ 02350000
*/*                  SOEXT= NO (DEFAULT) - DO NOT PRODUCE        @T1C*/ 02400000
*/*                         EXTENDED SYSOUT DATA FIELDS          @T1A*/ 02450000
*/*                                                                  */ 02500000
*/*                  THIS CALLING SEQUENCE WILL PRODUCE          @T1A*/ 02550000
*/*                  ONLY THE SO DATA AREA NOT THE SSOB          @T1A*/ 02600000
*/*                  HEADER.                                     @T1A*/ 02650000
*/*                                                                  */ 02700000
*/*      NOTES ON THE ASSEMBLER INVOCATION:                  @T0268C6*/ 02750000
*/*       - AN 'ORG SSOBGN' APPEARS AT THE BEGINNING OF      @T0268C6*/ 02800000
*/*         IEFSSSO. IEFJSSOB GENERATES THE DEFINITION OF    @T0268C6*/ 02850000
*/*         SSOBGN ONLY WHEN AN EXTENSION IS SPECIFIED. IF   @T0268C6*/ 02900000
*/*         IEFJSSOB IS NOT INVOKED, THE CALLER MUST DEFINE  @T0268C6*/ 02950000
*/*         THIS SYMBOL.                                     @T0268C6*/ 03000000
*/*                                                                  */ 03050000
*/*       - THE SYMBOL SSOBHSIZ IS REFERENCED IN THIS MACRO. @T0268C6*/ 03100000
*/*         SSOBHSIZ IS DEFINED IN THE MAPPING OF THE SSOB   @T0268C6*/ 03150000
*/*         HEADER AS THE LENGTH OF THAT HEADER.             @T0268C6*/ 03200000
*/*------------------------------------------------------------------*/ 03237500
*/*02* PL/AS =                                                   @P3A*/ 03275000
*/*           %DCL SSOBSO CHAR                               @T0268C6*/ 03312500
*/*           %SSOBSO='VALUE'                                @T0268C6*/ 03350000
*/*                                                                  */ 03400000
*/*                   WHERE 'VALUE'='BASED' OR               @T0268C6*/ 03450000
*/*                         'VALUE'='BDY(WORD)'.             @T0268C6*/ 03500000
*/*                                                                  */ 03550000
*/*           THE FOLLOWING SEQUENCE IS USED TO CONTROL THE      @T1A*/ 03600000
*/*           INCLUSION OF THE EXTENDED SYSOUT DATA FIELDS       @T1A*/ 03650000
*/*           IN THE SO DATA AREA ONLY.                          @T1A*/ 03700000
*/*                                                                  */ 03750000
*/*           %DCL SOEXT CHAR                                    @T1A*/ 03800000
*/*           %SOEXT='YES' (PRODUCE EXTENDED SYSOUT DATA         @T1A*/ 03850000
*/*                         FIELDS) OR                           @T1A*/ 03900000
*/*                  'NO'  (DO NOT PRODUCE EXTENDED SYSOUT       @T1A*/ 03950000
*/*                         DATA FIELDS)                         @T1A*/ 04000000
*/*                                                                  */ 04050000
*/*           THEN CODE EITHER ONE OF THE FOLLOWING:         @T0268C6*/ 04100000
*/*                                                                  */ 04150000
*/*                  %INCLUDE SYSLIB(IEFJSSOB)               @T0268C6*/ 04200000
*/*                    NOTE: INCLUDING IEFJSSOB WILL ALSO    @T0268C6*/ 04250000
*/*                    GENERATE THE SSOB HEADER IF A MACRO   @T0268C6*/ 04300000
*/*                    VARIABLE CALLED SSOBSSOB IS SET       @T0268C6*/ 04350000
*/*                    TO A NON NULL/BLANK VALUE.            @T0268C6*/ 04400000
*/*                                                                  */ 04554600
*/*                  %INCLUDE SYSLIB(IEFSSSO)                @T0268C6*/ 04556100
*/********************************************************************/ 04557600
*/*                                                                  */ 04559200
*/*    DSECT NAME = User specified, optional SSOBEXT if invoked      */ 04562200
*/*                 including IEFJSSOB(SO),CONTIG=NO             @P1A*/ 04565200
*/*                                                                  */ 04568400
*/*    COMPONENT = Subsystem Interface (SC1B6)                   @P1A*/ 04570700
*/*                                                                  */ 04573000
*/*    EYE-CATCHER = None                                        @P1A*/ 04575300
*/*                                                                  */ 04577600
*/*    CREATED BY = Invoker of IEFSSREQ macro                    @P3C*/ 04578300
*/*                                                                  */ 04579000
*/*    POINTED TO BY = SSOBINDV field of the SSOB data area      @P1A*/ 04579700
*/*                                                                  */ 04580400
*/*    SERIALIZATION = None                                      @P1A*/ 04581100
*/*                                                                  */ 04582200
*/*    STORAGE ATTRIBUTES =                                          */ 04584500
*/*                                                                  */ 04586800
*/*      SUBPOOL  = Determined by invoker of IEFSSREQ            @P3C*/ 04589100
*/*      KEY      = Determined by invoker of IEFSSREQ            @P3C*/ 04591400
*/*      SIZE     = X'B0' bytes with extended SYSOUT data        @P1A*/ 04592300
*/*                 fields (SOEXT=YES)                           @P1A*/ 04593200
*/*                 X'78' bytes without extended SYSOUT          @P1A*/ 04594100
*/*                 data fields                                  @P1A*/ 04595000
*/*                                                                  */ 04596000
*/*  CHANGE ACTIVITY = YM02726,Z30OPSD,ZA34144,T0268C6,              */ 04600000
*/*                    T1,D1,T2,D2                               @D2C*/ 04650000
*/*  WE ARE NO LONGER UPDATING THE ABOVE 'CHANGE ACTIVITY' FIELD @P1A*/ 04675000
*/*                                                                  */ 04700000
*/*  $T1= OZ85933  JBB2133 850603 PDR6: PROCESS SYSOUT EXTENSION @T1A*/ 04750000
*/*  $D1= DCR0004  JBB3313 880802 PDM9: USER/WRITER NAME         @D1A*/ 04775000
*/*  $T2= OY26433  JBB3313 891016 PDB2: DATASET DD NAME          @T2A*/ 04806200
*/*  $D2= DEO0291  HBB4410 891127 PDB2: SECURITY TOKEN ADDRESS   @D2A*/ 04837400
*/*  $P1= PKB0571  HBB4430 920318 PDPS: 10X DEFECT ELIMINATION   @P1A*/ 04853000
*/*  $P2= PKB1537  HBB4430 920617 PDPS: 10X DEFECT ELIMINATION   @P2A*/ 04858200
*/*  $P3= PIG1423  HBB5510 930715 PDBN: SHOWHDR format complete  @P3A*/ 04861600
*/*  $P4= PIG2419  HBB5510 930909 PDBN: CDPI                     @P4A*/ 04865000
*/*                                                                  */ 04868600
*/****END OF SPECIFICATIONS**************************************@P1C*/ 04900000
*/*  SPLITOUT OF IEFSSSO MACRO FROM IEFJSSOB                 @ZA34144*/ 04950000
*/*  ADDED SSSOEXTD TO INDICATE AN EXTENDED PROCESS SYSOUT   @T0268C6*/ 05000000
*/*    REQUEST                                               @T0268C6*/ 05050000
*/*  ADDED CODE FOR PROCESS SYSOUT EXTENSION FOR APAR OZ85933    @T1A*/ 05100000
*/*  ADDED FLAGS TO INDICATE IF THE PROGRAM NAME IS A WRITER     @D1A*/ 05116600
*/*    NAME OR A USER ID.                                        @D1A*/ 05123200
*/*  ADDED FLAG AND FIELDS TO INDICATE THE DATASET DD NAME       @T2A*/ 05129800
*/*    IS PRESENT                                                @T2A*/ 05136400
*/*  ADDED AN ADDRESS FIELD THAT POINTS TO THE SECURITY TOKEN    @D2A*/ 05143000
*/*  CORRECTED MISMATCH OF BAL AND PL/AS FIELDS (SSSODST, SSSOSDST). */ 05145300
*/*    COMMENTED SSSOSDST AS AN ALTERNATE NAME FOR REMOTE USERID.    */ 05146800
*/*    ALSO UPDATED PROLOG FOR SHOW HEADER INFORMATION.          @P1A*/ 05148300
*/* A - ADDED PSO EXTENSIONS.                                    @P2A*/ 05149100
*/* C - Updated prologue with CDPI information and completed         */ 05149300
*/*     SHOWHDR information.                                     @P3A*/ 05149500
*/* C - Corrected CDPI information to be consistent with HBB4430 @P4A*/ 05149600
*/********************************************************************/ 05149700
* %GOTO SSSOPLS;              /*                               @ZA34144 05150000
SSOBSOUT EQU   1                  SYSOUT FUNCTION ID (SSOBFUNC)         05200000
SSSOCVER EQU   4                  CURRENT VERSION NUMBER OF             05230000
*                                 THIS DATA AREA                   @P2C 05260000
SSSODDVR EQU   3                  VERSION SINCE WHICH DD NAME IS   @T2A 05290000
*                                 DEFINED IN THE SSSO EXTENSION    @T2A 05320000
SSSOGRNM EQU   4                  FIRST VERSION IN WHICH THE            05327500
*                                   SSSOOGNM, SSSOFOR8 AND              05335000
*                                   SSSOACCT FIELDS SUPPORTED      @P2A 05342500
*                                                                       05350000
*  PROCESS SYSOUT DATA SETS RETURN CODES (SSOBRETN)                     05400000
*                                                                       05450000
SSSORTOK EQU   0                  EVERYTHING IS OK                      05500000
SSSOEODS EQU   4                  NO MORE DATA SETS TO SELECT           05550000
SSSONJOB EQU   8                  JOB NOT FOUND                         05600000
SSSOINVA EQU   12                 INVALID SEARCH ARGUMENTS              05650000
SSSOUNAV EQU   16                 UNABLE TO PROCESS NOW                 05700000
SSSODUPJ EQU   20                 DUPLICATE JOBNAMES                    05750000
SSSOINVJ EQU   24                 INVALID JOBNAME/JOBID COMBINATION     05800000
SSSOIDST EQU   28                 INVALID DESTINATION SPECIFIED         05850000
SSSOAUTH EQU   32                 AUTHORIZATION FAILED             @D2A 05875000
SSSOTKNM EQU   36                 TOKEN MAP FAILED                 @P2A 05887500
*                                                                       05900000
         ORG   SSOBGN                                                   05950000
SSSOBGN  EQU   *                                                        06000000
SSSOLEN  DC    AL2(SSSOSIZE)      SYSOUT EXTENSION LENGTH               06050000
SSSOUFLG DS    B                  USER SELECTION OPTIONS CLASS          06100000
*                                 ROUTING AND DISPOSITION FLAGS         06150000
SSSOSETC EQU   X'80'              USE SSSOCLAS AS DISPOSITION           06200000
SSSODELC EQU   X'40'              DELETE SELECTED DATA SET              06250000
SSSOROUT EQU   X'20'              REROUTE SELECTED DATA SET TO          06300000
*                                 DESTINATION IN SSSODEST               06350000
SSSOHOLD EQU   X'10'              HOLD ALL SELECTED DATA SETS           06400000
SSSORLSE EQU   X'08'              RELEASE ALL SELECTED DATA SETS        06450000
*        EQU   X'07'              RESERVED FLAGS                        06500000
SSSOVER  DS    X                  VERSION NUMBER               @T0268C6 06550000
SSSOFLG1 DS    B                  DATA SET SELECTION CONTROL FLAGS      06600000
SSSOHLD  EQU   X'80'              SELECTION SHOULD INCLUDE HELD         06650000
*                                 SYSOUT DATA SETS                      06700000
SSSOSCLS EQU   X'40'              USE CLASS                             06750000
SSSODST  EQU   X'20'              USE REMOTE DESTINATION                06800000
SSSOSDST EQU   SSSODST            ALTERNATE NAME FOR REMOTE             06816600
*                                 DESTINATION                      @P1A 06833200
SSSOSJBN EQU   X'10'              USE JOB NAME                          06850000
SSSOSJBI EQU   X'08'              USE JOB ID                            06900000
SSSOSPGM EQU   X'04'              USE USER WRITER PROGRAM NAME          06950000
SSSOSFRM EQU   X'02'              USE FORM NUMBER                       07000000
         SPACE 1                                                   @P2A 07006600
*********************************************************************** 07013200
*                                                                     * 07019800
*        CAUTION.  IF THE SSSOSFR8 BIT IS TURNED ON AND THE JES       * 07026400
*        IS NOT AT THE LEVEL WHICH SUPPORTS 8 BYTE FORMS, THEN        * 07033000
*        THE CALLER WILL GET UNPREDICTABLE RESULTS.  THE JES WILL     * 07039600
*        USE THE 4 BYTE FORMS CODE FOR SELECTION (SINCE SSSOSFRM      * 07046200
*        IS ON).                                                      * 07052800
*                                                                     * 07059400
*******************************************************************@P2A 07066000
         SPACE 1                                                   @P2A 07072600
SSSOSFR8 EQU   X'01'              USE 8 BYTE FORM NUMBER FIELD FOR      07079200
*                                   SELECTION (SSSOSFRM MUST BE         07085800
*                                     ON TOO)                      @P2C 07092400
*                                                                       07100000
SSSOFLG2 DS    B                  CURRENT DATA SET DISPOSITION FLAGS    07150000
SSSOCTRL EQU   X'80'              1 - PROCESSING COMPLETED              07200000
*                                 0 - RETURN DATA SET NAME              07250000
SSSOCHKP EQU   X'40'              USE SSSORBA TO CHECKPOINT RBA         07300000
*                                 OF CURRENT DATA SET IN CLASS          07350000
SSSOEXTD EQU   X'20'              EXTENDED PROCESS SYSOUT      @T0268C6 07400000
*                                 REQUEST                      @T0268C6 07450000
SSSOPSEE EQU   X'10'              PROCESS SYSOUT EXTENSION EXISTS  @T1C 07500000
SSSODDST EQU   X'08'              DD NAME HAS BEEN SET IN EXT.     @T2A 07533300
SSSORSV3 EQU   X'07'              RESERVED FLAGS                   @T2C 07566600
SSSOCOPY DS    H                  NUMBER OF COPIES                      07600000
SSSOJOBN DS    CL8                JOB NAME                              07650000
SSSOJOBI DS    CL8                JOB ID                                07700000
SSSOCLAS DS    CL1                NAME OF DESTINATION CLASS SPECIFIED   07750000
*                                 VIA THE NEWCLASS PARAMETER            07800000
SSSOMLRL DS    CL2                MAXIMUM LOGICAL RECORD LENGTH    @T1C 07850000
SSSOFLGA DS    CL1                FLAG BYTE                        @D1C 07875000
SSSOWTRN EQU   X'80'              WRITER NAME                      @D1A 07900000
SSSOUSER EQU   X'40'              USERID                           @D1A 07925000
SSSODEST DS    CL8                REMOTE DESTINATION SPECIFIED          07950000
*                                 VIA THE DEST PARAMETER                08000000
SSSOPGMN DS    CL8                USER WRITER NAME                      08050000
SSSORBA  DS    CL8                RBA OF SYSOUT DATA SET                08100000
SSSODSN  DS    CL44               SYSOUT DATA SET NAME                  08150000
SSSOFORM DS    CL4                FORM NUMBER (FIRST 4 BYTES IF 8       08183300
*                                  CHARACTER NUMBER)               @P2C 08216600
*                                                                       08250000
*  SSSOCLSL WILL CONTAIN 1-8 CLASSES WHEN USED FOR REROUTING OR DELETE  08300000
*  FUNCTIONS AND WILL CONTAIN ONLY ONE CLASS WHEN USED FOR PRINTING.    08350000
*                                                                       08400000
SSSOCLSL DS    CL8                CLASS SELECTION LIST FOR              08450000
*                                 DATA SET SELECTION                    08500000
SSSOWTRC DS    A                  A POINTER TO A COMMUNICATION  YM02726 08550000
*                                 AREA FOR THE USER WRITTEN     YM02726 08600000
*                                 WRITER                        YM02726 08650000
SSSODSID DS    CL8                DATA SET ID TO PLACE SYSOUT  @Z30OPSD 08700000
*                                 ON EXTERNAL DEVICES          @Z30OPSD 08750000
*                                                                  @T1A 08800000
         AIF   ('&SOEXT' NE 'YES').NONEXT                          @T1A 08850000
*                                                                  @T1A 08900000
*  PROCESS SYSOUT EXTENSION                                        @T1A 08950000
*                                                                  @T1A 09000000
*                                                                  @T1A 09050000
SSSOPSE  EQU   *                  PROCESS SYSOUT EXTENSION         @T1A 09100000
SSSOFLG3 DS    B                  BDT CONTROL BYTE                 @T1A 09150000
SSSOSGID EQU   X'80'              SELECT BY GROUP IDENTIFIER       @T1A 09200000
SSSOJH   EQU   X'40'              JOB HEADER                       @T1A 09250000
SSSODSH  EQU   X'20'              DATA SET HEADER                  @T1A 09300000
SSSODS   EQU   X'10'              SYSOUT DATA SET                  @T1A 09350000
SSSOJT   EQU   X'08'              JOB TRAILER                      @T1A 09400000
*        EQU   X'07'              RESERVED                         @T1A 09450000
SSSOFLG4 DS    B                  USER JOB OPTION FLAG             @T1A 09500000
SSSOJDEL EQU   X'80'              DELETE SPECIFIED JOB             @T1A 09550000
SSSOJREL EQU   X'40'              RELEASE SPECIFIED JOB            @T1A 09600000
SSSOJHLD EQU   X'20'              HOLD SPECIFIED JOB               @T1A 09650000
*        EQU   X'1F'              RESERVED                         @T1A 09700000
         SPACE 1                                                   @P2A 09703700
*********************************************************************** 09707400
*                                                                     * 09711100
*        THE FIRST RELEASE OF SUPPORT FOR SECURITY TOKENS             * 09714800
*        PROVIDED THE FIELD SSSOSECT AS THE ADDRESS OF THE SECURITY   * 09718500
*        TOKEN AREA WHICH WAS TO BE PROVIDED BY THE CALLER.  THERE    * 09722200
*        WAS NO REQUIREMENT THAT THE CALLER PROVIDE THE LENGTH OR     * 09725900
*        VERSION THAT WAS EXPECTED TO BE RETURNED.  IT WAS ASSUMED    * 09729600
*        THAT THE CALLER WOULD PROVIDE AN AREA LARGE ENOUGH FOR THE   * 09733300
*        VERSION ONE FORM OF THE SAF TOKEN.  THIS NEW SUPPORT WILL    * 09737000
*        ALLOW THE CALLER TO SPECIFY THE LENGTH AND VERSION OF THE    * 09740700
*        SAF TOKEN.  THE TOKEN WILL BE TRANSFORMED FROM THE CURRENT   * 09744400
*        VERSION AND LENGTH TO THE VERSION AND LENGTH REQUESTED BY    * 09748100
*        THE CALLER VIA THE TOKENMAP SERVICE OF THE SAF INTERFACE.    * 09751800
*                                                                     * 09755500
*        IN ORDER TO ALLOW MIGRATION OF PROCESS SYSOUT USERS, A TWO   * 09759200
*        STAGE 'COMMIT' IS PROVIDED.  THE PSO USER CAN ASK THAT THE   * 09762900
*        LENGTH AND VERSION IN THE AREA POINTED TO BY SSSOSECT BE     * 09766600
*        USED FOR TOKENMAP BY SETTING SSSOTKNR.                       * 09770300
*                                                                     * 09774000
*        IF THE JES SERVICING THE REQUEST HAS HAD THE OTHER HALF      * 09777700
*        OF THIS UPDATE, IT WILL RETURN THE DATA IN THE REQUESTED     * 09781400
*        FORMAT AND SET SSSOTKNG THAT SAYS IT DID SO.                 * 09785100
*                                                                     * 09788800
*        IF THE PROCESS SYSOUT USER DOES NOT ASK FOR THIS SERVICE,    * 09792500
*        (BY NOT SETTING SSSOTKNR), THE JES WILL COPY THE TOKEN TO    * 09796200
*        THE ADDRESS SPECIFIED IN SSSOSECT ASSUMING THAT THE LENGTH   * 09799900
*        OF THE AREA IS THE SAME AS THE SAF VERSION ONE TOKEN LENGTH  * 09803600
*                                                                     * 09807300
*******************************************************************@P2A 09811000
         SPACE 1                                                   @P2A 09814700
SSSOFLG5 DS    B                  FLAGS                            @P2A 09818400
SSSOTKNR EQU   X'80'              SAF TOKEN LEN/VER SET            @P2A 09822100
SSSOTKNG EQU   X'40'              SAF TOKEN TOKENMAPED             @P2A 09825800
SSSOGNVA EQU   X'20'              OUTPUT GROUP NAME PROVIDED       @P2A 09829500
*        EQU   X'1F'              RESERVED                         @P2A 09833200
SSSORSV6 DS    CL1                RESERVED                         @P2C 09836900
SSSOGRID DS    CL8                GROUP IDENTIFIER (FOR BDT TO JES3     09840600
*                                   COMMUNICATION ONLY)            @P2C 09844300
SSSOLNCT DS    F                  DATASET LINE COUNT               @T1A 09850000
SSSOPRCD DS    CL8                DATASET PROC NAME                @T2A 09866600
SSSOSTPD DS    CL8                DATASET STEP NAME                @T2A 09883200
SSSODDND DS    CL8                DATASET DD NAME                  @T2A 09899800
SSSOSECT DS    A                  POINTER TO SECURITY TOKEN (SEE        09900900
*                                   EXPLANATION OF SSSOFLG5             09902000
*                                   ABOVE)                         @P2C 09903100
SSSOFOR8 DS    CL8                FORM NUMBER                      @P2C 09904200
         SPACE 1                                                   @P2A 09905300
*********************************************************************** 09906400
*                                                                     * 09907500
*        THE FOLLOWING WORD (SSSOACCT) CONTAINS THE ADDRESS OF        * 09908600
*        A STRING OF ACCOUNTING INFORMATION.  THE MEMORY POINTED      * 09909700
*        TO IS MANAGED BY THE JES SERVICING THE PSO REQUEST.          * 09910800
*        THE XWTR SHOULD HAVE AMODE 31 TO ACCESS THE MEMORY.          * 09911900
*                                                                     * 09913000
*        THE ACCOUNTING STRING HAS THE FOLLOWING FORMAT:              * 09914100
*                                                                     * 09915200
*        AL1(NUMBER-OF-PAIRS-THAT-FOLLOW)                             * 09916300
*          FOLLOWED BY 0 OR MORE ACCOUNTING PAIRS                     * 09917400
*                                                                     * 09918500
*        ACCOUNTING PAIRS ARE OF THE FORM:                            * 09919600
*          AL1(LENGTH),C'STRING OF LENGTH "LENGTH"'                   * 09920700
*                                                                     * 09921800
*        A LENGTH OF 0 INDICATES AN OMITTED FIELD                     * 09922900
*                                                                     * 09924000
*******************************************************************@P2A 09925100
         SPACE 1                                                        09926200
SSSOACCT DS    A                  ADDRESS OF ACCOUNTING                 09927300
*                                   STRING (OR ZERO)               @P2A 09928400
         SPACE 1                                                   @P2A 09929500
*********************************************************************** 09930600
*                                                                     * 09931700
*        THE FOLLOWING FIELD HAS THE 26 CHARACTER JES2 JOE NAME       * 09932800
*        (JOB OUTPUT ELEMENT NAME).  THE STRING CAN BE USED AS        * 09933900
*        GIVEN IN JES2 COMMANDS WHICH REQUIRE OUTGRP= SPECIFICATIONS. * 09935000
*        FLAG SSSOGNVA (IN SSSOFLG5) IS SET IF THE FIELD IS VALID.    * 09936100
*                                                                     * 09937200
*        THE DATA SET RETURNED WITH A GIVEN OUTPUT GROUP NAME WILL    * 09938300
*        NOT NECESSARILY CONTINUE TO HAVE THE GIVEN OUTPUT GROUP NAME * 09939400
*        IF THIS REQUEST (OR A LATER REQUEST) ASKS FOR HELD DATA SETS * 09940500
*        (SSSOUFLG ON) AND DATA SET CHARACTERISTICS ARE CHANGED       * 09941600
*        (VIA A NON-ZERO SSSOUFLG).                                   * 09942700
*                                                                     * 09943800
*******************************************************************@P2A 09944900
         SPACE 1                                                   @P2A 09946000
SSSOOGNM DS    CL26               JES2 OUTPUT GROUP NAME           @P2A 09947100
         DS    CL14               RESERVED FOR FUTURE USE          @P2A 09948200
*                                                                  @T1A 09950000
.NONEXT  ANOP                                                      @T1A 10000000
*                                                                  @T1A 10050000
SSSOSIZE EQU   *-SSSOBGN          SYSOUT EXTENSION LENGTH          @T1M 10100000
SSOBLEN1 EQU   SSOBHSIZ+SSSOSIZE  SSOB LENGTH=HEADER + SYSOUT EXTENSION 10150000
         MEND                                                @ZA34144*/ 10200000
* %SSSOPLS:;                            /*                   @ZA34144*/ 10250000
*  %IF SSOBSO = '' %THEN                                   /*    @P2A*/ 10266600
*    %SSOBSO = 'BDY(WORD)';                                /*    @P2A*/ 10283200
*  DCL SSOBSOUT FIXED(15) CONSTANT(01); /* FUNCTION ID (SSOBFUNC)    */ 10300000
*  DCL SSSOCVER FIXED(8) CONSTANT(4);   /* CURRENT VERSION NUMBER OF    10330000
*                                          THIS DATA AREA        @P2C*/ 10360000
*  DCL SSSODDVR FIXED(8) CONSTANT(3);   /* VERSION SINCE WICH DDNAME    10390000
*                                          IS DEFINED IN EXT.    @T2A*/ 10420000
*  DCL SSSOGRNM FIXED(8) CONSTANT(4);   /* FIRST VERSION IN WHICH THE   10427500
*                                   SSSOOGNM, SSSOFOR8, SSSOACCT        10435000
*                                   FIELDS SUPPORTED             @P2A*/ 10442500
*   /*                                                               */ 10450000
*   /*  PROCESS SYSOUT DATA SETS RETURN CODES (SSOBRETN)             */ 10500000
*   /*                                                               */ 10550000
*   DCL SSSORTOK FIXED(31) CONSTANT(0); /* EVERYTHING IS OK          */ 10600000
*   DCL SSSOEODS FIXED(31) CONSTANT(4); /*NO MORE DATA SETS TO SELECT*/ 10650000
*   DCL SSSONJOB FIXED(31) CONSTANT(8); /* JOB NOT FOUND             */ 10700000
*   DCL SSSOINVA FIXED(31) CONSTANT(12);/* INVALID SEARCH ARGUMENTS  */ 10750000
*   DCL SSSOUNAV FIXED(31) CONSTANT(16);/* UNABLE TO PROCESS NOW     */ 10800000
*   DCL SSSODUPJ FIXED(31) CONSTANT(20);/* DUPLICATE JOBNAMES        */ 10850000
*   DCL SSSOINVJ FIXED(31) CONSTANT(24);/* INVALID JOBNAME/JOBID        10900000
*                                          COMBINATION               */ 10950000
*   DCL SSSOIDST FIXED(31) CONSTANT(28); /* INVALID DESTINATION         11000000
*                                          SPECIFIED                 */ 11050000
*   DCL SSSOAUTH FIXED(31) CONSTANT(32); /* AUTHORIZATION FAILED @D2A*/ 11075000
*   /*   S S S O                                                     */ 11100000
*  DECLARE                                                              11150000
*   1       SSSO          SSOBSO,                                       11200000
*     2       SSSOLEN     FIXED(15),/* LENGTH OF SSSO                */ 11250000
*     2       SSSOUFLG    BIT(8),   /* USER SELECTION OPTIONS CLASS     11300000
*                                      ROUTING AND DISPOSITION FLAGS */ 11350000
*       3       SSSOSETC  BIT(1),   /* USE SSSOCLAS AS DISPOSITION   */ 11400000
*       3       SSSODELC  BIT(1),   /* DELETE SELECTED DATA SET      */ 11450000
*       3       SSSOROUT  BIT(1),   /* REROUTE SELECTED DATA SET        11500000
*                                      TO DESTINATION IN SSSODEST    */ 11550000
*       3       SSSOHOLD  BIT(1),   /* HOLD ALL SELECTED DATA SETS   */ 11600000
*       3       SSSORLSE  BIT(1),   /* RELEASE ALL SELECTED DATA SETS*/ 11650000
*       3       *         BIT(3),   /* RESERVED FLAGS                */ 11700000
*     2       SSSOVER   FIXED(8),   /* VERSION NUMBER        @T0268C6*/ 11750000
*     2       SSSOFLG1    BIT(8),   /* FLAGS TO CONTROL SELECTION       11800000
*                                      OF DATA SETS                  */ 11850000
*       3       SSSOSHLD  BIT(1),   /* SELECTION SHOULD INCLUDE -HELD-  11900000
*                                      SYSOUT DATA SETS              */ 11950000
*       3       SSSOSCLS  BIT(1),   /* USE CLASS                     */ 12000000
*       3       SSSODST   BIT(1),   /* USE REMOTE USERID         @P1A*/ 12025000
*         5     SSSOSDST  BIT(1),   /* ALTERNATE NAME FOR REMOTE        12050000
*                                      USERID                    @P1C*/ 12075000
*       3       SSSOSJBN  BIT(1),   /* USE JOB NAME                  */ 12100000
*       3       SSSOSJBI  BIT(1),   /* USE JOB ID                    */ 12150000
*       3       SSSOSPGM  BIT(1),   /* USE USER WRITER PROGRAM NAME  */ 12200000
*       3       SSSOSFRM  BIT(1),   /* USE FORM NUMBER               */ 12250000
*       3       SSSOSFR8  BIT(1),   /* USE 8 BYTE FORM NUMBER FIELD     12275000
*                                      FOR SELECTION (SSSOSFRM          12300000
*                                      MUST ALSO BE ON)          @P2C*/ 12325000
*     2       SSSOFLG2    BIT(8),   /* FLAGS INDICATING DISPOSITION     12350000
*                                      OF CURRENT DATA SET           */ 12400000
*       3       SSSOCTRL  BIT(1),   /* 1 - PROCESSING COMPLETED         12450000
*                                      0 - RETURN DATA SET NAME      */ 12500000
*       3       SSSOCHKP  BIT(1),   /* USE SSSORBA TO CHECKPOINT RBA    12550000
*                                      OF CURRENT DATA SET IN CLASS  */ 12600000
*       3       SSSOEXTD  BIT(1),   /* EXTENDED PROCESS SYSOUT REQUEST  12650000
*                                                            @T0268C6*/ 12700000
*       3       SSSOPSEE  BIT(1),   /* PROCESS SYSOUT EXTENSION         12750000
*                                      EXISTS                    @T1C*/ 12800000
*       3       SSSODDST  BIT(1),   /* DD NAME HAS BEEN SET IN          12825000
*                                      EXTENSION                 @T2A*/ 12850000
*       3       *         BIT(3),   /* RESERVED                  @T2C*/ 12875000
*     2       SSSOCOPY    FIXED(15),/* NUMBER OF COPIES              */ 12900000
*     2       SSSOJOBN    CHAR(8),  /* JOB NAME                      */ 12950000
*     2       SSSOJOBI    CHAR(8),  /* JOB ID                        */ 13000000
*     2       SSSOCLAS    CHAR(1),  /* NAME OF DEST CLASS SPECIFIED     13050000
*                                      VIA THE NEWCLASS PARAMETER    */ 13100000
*     2       SSSOMLRL    CHAR(2),  /* MAXIMUM LOGICAL RECORD LENGTH    13150000
*                                                                @T1C*/ 13200000
*     2       SSSOFLGA    CHAR(1),  /* FLAG BYTE                 @D1C*/ 13220000
*       3       SSSOWTRN    BIT(1), /* WRITER NAME               @D1A*/ 13240000
*       3       SSSOUSER    BIT(1), /* USERID                    @D1A*/ 13260000
*       3       *           BIT(6), /* NOT USED                  @D1A*/ 13280000
*     2       SSSODEST    CHAR(8),  /* REMOTE DESTINATION SPECIFIED     13300000
*                                      VIA THE DEST PARAMETER        */ 13350000
*     2       SSSOPGMN    CHAR(8),  /* USER WRITER NAME              */ 13400000
*     2       SSSORBA     CHAR(8),  /* RBA OF SYSOUT DATA SET        */ 13450000
*     2       SSSODSN     CHAR(44), /* SYSOUT DATA SET NAME          */ 13500000
*     2       SSSOFORM    CHAR(4),  /* FORM NUMBER (FIRST 4 BYTES IF    13533300
*                                        8 CHARACTER NUMBER      @P2C*/ 13566600
*   /* SSSOCLSL WILL CONTAIN 1-8 CLASSES WHEN USED FOR REROUTING OR  */ 13600000
*   /* DELETE FUNCTIONS AND WILL CONTAIN ONLY ONE CLASS WHEN USED    */ 13650000
*   /* FOR PRINTING.                                                 */ 13700000
*     2       SSSOCLSL    CHAR(8),  /* CLASS SELECTION LIST FOR         13750000
*                                      DATA SET SELECTION            */ 13800000
*     2       SSSOWTRC    PTR(31),  /* POINTER TO COMMUNICATION         13850000
*                                      AREA FOR THE USER                13900000
*                                      WRITTEN WRITER         YM02726*/ 13950000
*     2       SSSODSID    CHAR(8),  /* DATA SET ID TO PLACE SYSOUT      14000000
*                                      ON EXTERNAL DEVICES   @Z30OPSD*/ 14050000
* %IF SOEXT~='YES' %THEN %GOTO NONEXT; /*                        @T1A*/ 14100000
*     2       SSSOPSE,              /* PROCESS SYSOUT EXTENSION  @T1A*/ 14150000
*       3       SSSOFLG3    BIT(8), /* BDT CONTROL BYTE          @T1A*/ 14200000
*         5       SSSOSGID  BIT(1), /* SELECT BY GROUP IDENTIFIER       14250000
*                                                                @T1A*/ 14300000
*         5       SSSOJH    BIT(1), /* JOB HEADER                @T1A*/ 14350000
*         5       SSSODSH   BIT(1), /* DATA SET HEADER           @T1A*/ 14400000
*         5       SSSODS    BIT(1), /* SYSOUT DATA SET           @T1A*/ 14450000
*         5       SSSOJT    BIT(1), /* JOB TRAILER               @T1A*/ 14500000
*         5       *         BIT(3), /* RESERVED                  @T1A*/ 14550000
*       3       SSSOFLG4    BIT(8), /* USER JOB OPTION FLAG      @T1A*/ 14600000
*         5       SSSOJDEL  BIT(1), /* DELETE SPECIFIED JOB      @T1A*/ 14650000
*         5       SSSOJREL  BIT(1), /* RELEASE SPECIFIED JOB     @T1A*/ 14700000
*         5       SSSOJHLD  BIT(1), /* HOLD SPECIFIED JOB        @T1A*/ 14750000
*         5       *         BIT(5), /* RESERVED                  @T1A*/ 14800000
*/********************************************************************* 14803500
*                                                                     * 14807000
*        THE FIRST RELEASE OF SUPPORT FOR SECURITY TOKENS             * 14810500
*        PROVIDED THE FIELD SSSOSECT AS THE ADDRESS OF THE SECURITY   * 14814000
*        TOKEN AREA WHICH WAS TO BE PROVIDED BY THE CALLER.  THERE    * 14817500
*        WAS NO REQUIREMENT THAT THE CALLER PROVIDE THE LENGTH OR     * 14821000
*        VERSION THAT WAS EXPECTED TO BE RETURNED.  IT WAS ASSUMED    * 14824500
*        THAT THE CALLER WOULD PROVIDE AN AREA LARGE ENOUGH FOR THE   * 14828000
*        VERSION ONE FORM OF THE SAF TOKEN.  THIS NEW SUPPORT WILL    * 14831500
*        ALLOW THE CALLER TO SPECIFY THE LENGTH AND VERSION OF THE    * 14835000
*        SAF TOKEN.  THE TOKEN WILL BE TRANSFORMED FROM THE CURRENT   * 14838500
*        VERSION AND LENGTH TO THE VERSION AND LENGTH REQUESTED BY    * 14842000
*        THE CALLER VIA THE TOKENMAP SERVICE OF THE SAF INTERFACE.    * 14845500
*                                                                     * 14849000
*        IN ORDER TO ALLOW MIGRATION OF PROCESS SYSOUT USERS, A TWO   * 14852500
*        STAGE 'COMMIT' IS PROVIDED.  THE PSO USER CAN ASK THAT THE   * 14856000
*        LENGTH AND VERSION IN THE AREA POINTED TO BY SSSOSECT BE     * 14859500
*        USED FOR TOKENMAP BY SETTING SSSOTKNR.                       * 14863000
*                                                                     * 14866500
*        IF THE JES SERVICING THE REQUEST HAS HAD THE OTHER HALF      * 14870000
*        OF THIS UPDATE, IT WILL RETURN THE DATA IN THE REQUESTED     * 14873500
*        FORMAT AND SET SSSOTKNG THAT SAYS IT DID SO.                 * 14877000
*                                                                     * 14880500
*        IF THE PROCESS SYSOUT USER DOES NOT ASK FOR THIS SERVICE,    * 14884000
*        (BY NOT SETTING SSSOTKNR), THE JES WILL COPY THE TOKEN TO    * 14887500
*        THE ADDRESS SPECIFIED IN SSSOSECT ASSUMING THAT THE LENGTH   * 14891000
*        OF THE AREA IS THE SAME AS THE SAF VERSION ONE TOKEN LENGTH  * 14894500
*                                                                     * 14898000
*****************************************************************@P2A*/ 14901500
*       3       SSSOFLG5    BIT(8), /* FLAGS                     @P2A*/ 14905000
*         5       SSSOTKNR  BIT(1), /* SAF TOKEN LENGTH AND             14908500
*                                        VERSION SET             @P2A*/ 14912000
*         5       SSSOTKNG  BIT(1), /* SAF TOKEN HAS BEEN               14915500
*                                        TOKENMAPED              @P2A*/ 14919000
*         5       SSSOGNVA  BIT(1), /* OUTPUT GROUP NAME                14922500
*                                        PROVIDED                @P2A*/ 14926000
*         5       *         BIT(5), /* RESERVED                  @P2A*/ 14929500
*       3       SSSORSV6    CHAR(1),/* RESERVED                  @P2C*/ 14933000
*       3       SSSOGRID    CHAR(8),/* GROUP IDENTIFIER (FOR BDT TO     14936500
*                                        JES3 COMMUNICATION ONLY)       14940000
*                                                                @P2C*/ 14943500
*       3       SSSOLNCT    FIXED(31),/* DATASET LINE COUNT      @T1A*/ 14950000
*       3       SSSOPRCD    CHAR(8),/* DATASET PROC NAME         @T2A*/ 14966600
*       3       SSSOSTPD    CHAR(8),/* DATASET STEP NAME         @T2A*/ 14983200
*       3       SSSODDND    CHAR(8),/* DATASET DD NAME           @T2A*/ 14999800
*       3       SSSOSECT    PTR(31),/* POINTER TO SECURITY TOKEN        15001000
*                                       (SEE EXPLANATION OF SSSOFLG5    15002200
*                                        ABOVE)                  @P2C*/ 15003400
*       3       SSSOFOR8    CHAR(8),/* FORM NUMBER               @P2C*/ 15004600
*/********************************************************************* 15005800
*                                                                     * 15007000
*        THE FOLLOWING WORD (SSSOACCT) CONTAINS THE ADDRESS OF        * 15008200
*        A STRING OF ACCOUNTING INFORMATION.  THE MEMORY POINTED      * 15009400
*        TO IS MANAGED BY THE JES SERVICING THE PSO REQUEST.          * 15010600
*                                                                     * 15011800
*        THE ACCOUNTING STRING HAS THE FOLLOWING FORMAT:              * 15013000
*                                                                     * 15014200
*        AL1(NUMBER-OF-PAIRS-THAT-FOLLOW)                             * 15015400
*          FOLLOWED BY 0 OR MORE ACCOUNTING PAIRS                     * 15016600
*                                                                     * 15017800
*        ACCOUNTING PAIRS ARE OF THE FORM:                            * 15019000
*          AL1(LENGTH),C'STRING OF LENGTH "LENGTH"'                   * 15020200
*                                                                     * 15021400
*        A LENGTH OF 0 INDICATES AN OMITTED FIELD                     * 15022600
*                                                                     * 15023800
*****************************************************************@P2A*/ 15025000
*       3       SSSOACCT    PTR(31),/* ADDRESS OF ACCOUNTING STRING     15026200
*                                        (OR ZERO)               @P2A*/ 15027400
*/********************************************************************* 15028600
*                                                                     * 15029800
*        THE FOLLOWING FIELD HAS THE 26 CHARACTER JES2 JOE NAME       * 15031000
*        (JOB OUTPUT ELEMENT NAME).  THE STRING CAN BE USED AS        * 15032200
*        GIVEN IN JES2 COMMANDS WHICH REQUIRE OUTGRP= SPECIFICATIONS. * 15033400
*        FLAG SSSOGNVA (IN SSSOFLG5) IS SET IF THE FIELD IS VALID.    * 15034600
*                                                                     * 15035800
*        THE DATA SET RETURNED WITH A GIVEN OUTPUT GROUP NAME WILL    * 15037000
*        NOT NECESSARILY CONTINUE TO HAVE THE GIVEN OUTPUT GROUP NAME * 15038200
*        IF THIS REQUEST (OR A LATER REQUEST) ASKS FOR HELD DATA SETS * 15039400
*        (SSSOUFLG ON) AND DATA SET CHARACTERISTICS ARE CHANGED       * 15040600
*        (VIA A NON-ZERO SSSOUFLG).                                   * 15041800
*                                                                     * 15043000
*****************************************************************@P2A*/ 15044200
*       3       SSSOOGNM    CHAR(26),/* JES2 OUTPUT GROUP NAME          15045400
*                                                                @P2A*/ 15046600
*       3       *           CHAR(14),/* RESERVED                 @P2A*/ 15047800
* %NONEXT:;                         /*                           @T1A*/ 15050000
*     2       *           CHAR(0);  /* END OF EXTENSION          @T1A*/ 15100000
