* %GOTO SSDMCMT;              /*                               @ZA34144 00050003
         MACRO                                                 @ZA34144 00100003
         IEFSSDM                                                        00150003
.*/ %SSDMCMT:;                /*                             @ZA34144*/ 00200003
*/********************************************************************/ 00250003
*/*                                                                  */ 00258300
*/* MACRO NAME -   IEFSSDM                                           */ 00266600
*/*                                                                  */ 00274900
*/* DESCRIPTIVE NAME - SSOB EXTENSION FOR DELETE OPERATOR MESSAGE    */ 00283200
*/* COPYRIGHT  -                                                     */ 00291500
*/*              5740-XC6                                            */ 00316400
*/*              RESTRICTED MATERIALS OF IBM                         */ 00341300
*/*              (C) COPYRIGHT IBM CORP. 1986                        */ 00343600
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 00345900
*/*              REFER TO COPYRIGHT INSTRUCTIONS                     */ 00348200
*/*              FORM NUMBER G120-2083                               */ 00350500
*/*                                                                  */ 00352800
*/* STATUS     - OS/VS2 JBB2220                                      */ 00355100
*/*                                                                  */ 00357900
*/* FUNCTION   - DELETES OPERATOR MESSAGES                           */ 00366200
*/*                                                                  */ 00374500
*/* INVOCATION - INVOKED VIA IEFJSSOB MACRO                          */ 00386900
*/*                                                                  */ 00399400
*/* CREATED-BY -                                                     */ 00424300
*/*              IEAVMDOM, IEAVMED2, IEAVXDOM                        */ 00432600
*/*                                                                  */ 00440900
*/* LOCATION   -                                                     */ 00449200
*/*              SUBPOOL AND KEY OF CREATOR                          */ 00457500
*/*                                                                  */ 00465800
*/* POINTED-TO-BY -                                                  */ 00474100
*/*              N/A                                                 */ 00482400
*/*                                                                  */ 00490700
*/* SERIALIZATION -                                                  */ 00499000
*/*              NONE                                                */ 00507300
*/*                                                                  */ 00515600
*/* CHANGE ACTIVITY -                                                */ 00523900
*/* $L1=COEXDOM,   JBB2220,  840801, PDFB: JES3/MCS COEXISTENCE      */ 00532200
*/* $D1=DCR028,    JBB2220,  841128, PDFB: DOWNWARD COMMUNICATION OF */ 00534900
*/*                                        MESSAGE DELETION REQUESTS */ 00537600
*/*                                                                  */ 00540500
*/********************************************************************/ 00550003
*/* A 000000-999999                                                  */ 00575000
*/* A SSDMSEND                                                   @D1A*/ 00587500
* %GOTO SSDMPLS;              /*                               @ZA34144 00600003
*                                                                       00700003
SSOBDOM  EQU   14                 DOM FUNCTION ID (SSOBFUNC)            00750003
*                                                                       00800003
*  DOM RETURN CODES (SSOBRETN) -                                        00850003
*                                                                       00900003
*    NO DOM RETURN CODES CURRENTLY DEFINED                              00950003
*                                                                       01000003
         ORG   SSOBGN                                                   01050003
SSDMBGN  EQU   *                                                        01100003
SSDMLEN  DC    AL2(SSDMSIZE)      DOM EXTENSION LENGTH                  01150003
SSDMFLG1 DS    XL1                FLAGS BYTE                     @D1A   01167200
SSDMSEND EQU   X'80'              DOM REQUEST SHOULD BE COMMUNICATED TOX01184500
                                  OTHER SYSTEMS                  @D1A   01196000
SSDMRES2 DS    XL1                RESERVED                       @D1A   01207500
SSDMDMCB DS    A                  DOM CONTROL BLOCK ADDRESS (DOMC      X01219000
                                  SECTION OF THE DOMCB)          @L1C   01238000
SSDMDMC2 DS    A                  DOM CONTROL BLOCK ADDRESS (ENTIRE    X01246700
                                  DOMCB)                         @L1A   01255400
SSDMACRN DS    CL4                CONTROL BLOCK ACRONYM - 'SSDM' @L1A   01264200
SSDMVRSN DS    XL1                VERSION LEVEL                  @L1A   01271300
SSDMSP22 EQU   1                  VERSION LEVEL FOR OS/VS2             X01276000
                                                JBB2220          @L1A   01280700
SSDMVRID EQU   SSDMSP22           VERSION LEVEL-UPDATED FOR SIZE OR    X01285500
                                  INCOMPATIBLE CHANGE            @L1A   01292600
*                                                                       01300003
SSDMSIZE EQU   *-SSDMBGN          DOM EXTENSION LENGTH                  01350003
SSOBLENA EQU   SSOBHSIZ+SSDMSIZE  TOTAL SSOB LENGTH                     01400003
         MEND                                                @ZA34144*/ 01450003
* %SSDMPLS:;                            /*                   @ZA34144*/ 01480003
*   DCL SSOBDOM FIXED(15) CONSTANT(14); /* DOM FUNCTION ID (SSOBFUNC)*/ 01550003
*   /*                                                               */ 01600003
*   /*  DOM RETURN CODES (SSOBRETN) -                                */ 01650003
* /*                                                                 */ 01700003
* /*    NO DOM RETURN CODES CURRENTLY DEFINED                        */ 01750003
* /*                                                                 */ 01800003
*   /*   S S D M                                                     */ 01850003
*   DECLARE                                                             01900003
*   1       SSDM          SSOBDM,   /* DELETE OPERATOR MESSAGES      */ 01950003
*     2       SSDMLEN     FIXED(15),/* LENGTH OF SSDM                */ 02000003
*     2       SSDMFLG1    BIT(8),  /* FLAGS BYTE                 @D1A*/ 02013400
*          3    SSDMSEND  BIT(1),  /* DOM REQUEST SHOULD BE             02026800
*                                      COMMUNICATED TO OTHER SYSTEMS    02040400
*                                                                @D1A*/ 02049900
*     2       SSDMRES2    BIT(8),   /* RESERVED                  @D1A*/ 02066600
*     2       SSDMDMCB    PTR(31),  /* ADDRESS OF DOM CONTROL BLOCK     02083300
*                                    (DOMC SECTION OF THE DOMCB) @L1C*/ 02116600
*     2       SSDMDMC2    PTR(31),  /* DOM CONTROL BLOCK ADDRESS        02144400
*                                      (ENTIRE DOMCB)            @L1A*/ 02172200
*     2       SSDMACRN    CHAR(4),  /* CONTROL BLOCK ACRONYM     @L1A*/ 02200000
*     2       SSDMVRSN    FIXED(8); /* VERSION LEVEL FOR-'SSDM'  @L1A*/ 02250000
*   DCL SSDMSP22 FIXED(8) CONSTANT(1); /*VERSION LEVEL FOR OS/VS2       02300000
*                                                 JBB2220        @L1A*/ 02350000
*   DCL SSDMVRID FIXED(8) CONSTANT(SSDMSP22); /*VERSION LEVEL - UPDATED 02400000
*                                FOR SIZE OR INCOMPATIBLE CHANGE @L1A*/ 02450000
*   DCL SSDMID CHAR(4) CONSTANT('SSDM'); /*SSDM ACRONYM          @L1A*/ 02500000
