*        %GOTO SJDFPRO;            /*                                   00050000
         MACRO                                                          00100000
         IEFSJDFP  &DSECT=YES                                           00150000
.*/ %SJDFPRO: ;                                                         00200000
*/*** START OF SPECIFICATIONS ****************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME = IEFSJDFP                                           */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = SCHEDULER JCL FACILITY DEFINE JDVT PARAMETER  */ 00450000
*/*                    LIST                                          */ 00500000
*/*                                                                  */ 00550000
*/* PROPRIETARY STATEMENT=                                           */ 00600000
*/***PROPRIETARY_STATEMENT********************************************/ 00650000
*/*                                                                  */ 00800000
*/*                                                                  */ 00802500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00805000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00807500
*/* 5695-047 (C) COPYRIGHT IBM CORP. 1982, 1992                      */ 00810000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00812500
*/*                                                                  */ 00815000
*/* STATUS= HBB4430                                                  */ 00817500
*/*                                                                  */ 00820000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00822500
*/*                                                                  */ 00825000
*/*                                                                  */ 00837500
*/* FUNCTION = MAPPING FOR THE SCHEDULER JCL FACILITY DEFINE JDVT    */ 00850000
*/*            PARAMETER LIST.                                       */ 00900000
*/*                                                                  */ 00950000
*/*01* EXTERNAL CLASSIFICATION: NONE                             @01A*/ 00983300
*/*01* END OF EXTERNAL CLASSIFICATION:                           @01A*/ 01016600
*/*                                                                  */ 01050000
*/* MODULE TYPE = MACRO                                              */ 01100000
*/*                                                                  */ 01150000
*/* INVOCATION =                                                     */ 01200000
*/*                                                                  */ 01250000
*/*   BAL  - IEFSJDFP DSECT=YES OR NO                                */ 01300000
*/*          DSECT=YES IS THE DEFAULT                                */ 01350000
*/*          DEFINE A  CONSTANT EQUAL TO                             */ 01400000
*/*          'SJDF' TO  STORE IN SJDFID.                             */ 01450000
*/*                                                                  */ 01500000
*/*   PL/S - %DCL SJDFATRB CHAR                                      */ 01550000
*/*          %SJDFATRB = 'BASED' OR 'BDY(WORD)'                      */ 01600000
*/*          %INCLUDE SYSLIB(IEFSJDFP)                               */ 01650000
*/*                                                                  */ 01700000
*/* NOTES =                                                          */ 01750000
*/*                                                                  */ 01800000
*/*   THE FIRST 16 BYTES (UP TO AND INCLUDING SJDFREAS) ARE          */ 01850000
*/*   COMMON MAPPING AREAS FOR ALL SCHEDULER JCL FUNCTIONS.          */ 01900000
*/*                                                                  */ 01950000
*/* DEPENDENCIES =                                               @L1A*/ 01975000
*/*    ANY ADDITIONS OR DELETIONS TO THE SJF DEFINE PARAMETER    @L1A*/ 02000000
*/*    LIST THAT WOULD CAUSE A CHANGE IN ITS LENGTH MUST BE      @L1A*/ 02025000
*/*    REFLECTED IN THE LENGTH OF THE 'SJFSTOR' VARIABLE IN      @L1A*/ 02050000
*/*    MODULE IEFSJINT.                                          @L1A*/ 02075000
*/*                                                                  */ 02100000
*/* CHANGE ACTIVITY = H0,L1,L2,01                                @01C*/ 02110000
*/*$H0= EXTJCL  JBB2110 820702 PDC5: SUPPORT FOR EXTENDED JCL        */ 02120000
*/*$L1= SMSSTG2 JBB2223 860324 PDN4: STOR MGMT SUBSYS STGII SUPT @L1A*/ 02130000
*/*$L2= EMVS2   HBB4410 890626 PDCC: SJF O.C.O.                  @L2A*/ 02133300
*/*$01= OW05473 HBB4430 940729 PDH1: ENTERPRISE - ESI            @01A*/ 02136600
*/*                                                                  */ 02140000
*/*** END OF SPECIFICATIONS ******************************************/ 02170000
*/* A 000000-999999                 JDT-DEFINED JCL SUPPORT      @H0A*/ 02200000
*/* A ADDED SJDFSDTN FOR SDT NAME                                @L1A*/ 02216600
*/* A UPDATED COPYRIGHT FOR O.C.O. PART                          @L2A*/ 02224900
*/* C Changed distlib to APVTMACS so that customers can get it   @01A*/ 02233200
*/*   with optional source materials.                            @01A*/ 02241500
*/*------------------------------------------------------------------*/ 02250000
*        %GOTO SJDFPLS;            /*                                   02300000
         AIF   ('&DSECT' EQ 'NO').NODSECT                               02350000
SJDFP    DSECT                                                          02400000
         AGO  .SJDF02                                                   02450000
.NODSECT ANOP                                                           02500000
SJDFP    DS    0F                                                       02550000
.SJDF02  ANOP                                                           02600000
SJDFID   DS    CL4                 IDENTIFIER 'SJDF' ACRONYM            02650000
SJDFVERS DS    XL1                 VERSION NUMBER                       02700000
SJDFFLAG DS    XL1                 CONTROL FLAG BYTE                    02750000
SJDFNREC EQU   X'80'               NO RECOVERY                          02800000
SJDFNOCU EQU   X'40'               NO CLEANUP                           02850000
SJDFLEN  DS    H                   LENGTH OF PARAMETER LIST             02900000
SJDFSTOR DS    F                   LOCAL STORAGE POINTER OR ZERO        02950000
SJDFREAS DS    F                   REASON CODE                          03000000
SJDFJDVT DS    CL8                 JDVT NAME                            03050000
SJDFFUNC DS    XL1                 FLAG BYTE                            03100000
SJDFDFLT EQU   X'80'               THIS JDVT IS THE SYSTEM DEFAULT      03150000
SJDFRSV1 DS    CL1                 RESERVED                             03200000
SJDF#JDT DS    H                   NUMBER OF JDTS FOR THIS JDVT         03250000
SJDFJLNF DS    H                   NO. OF THE JDT THAT FAILED TO LOAD   03300000
SJDFSDTN DS    CL8                 SDT NAME                       @L1A* 03325000
SJDFIXED EQU   *-SJDFP             SIZE OF FIXED AREA OF SJDFP          03350000
*********************************************************************** 03400000
*                                                                     * 03450000
*   THE VARIABLE PART OF SJDFP                                        * 03500000
*                                                                     * 03550000
*********************************************************************** 03600000
SJDFVAR  DSECT                                                          03650000
SJDFJDTN DS    CL8                 JDT NAMES, NUMBER OF OCCURRENCES     03700000
*                                  DEPENDENT ON SJDT#JDT                03750000
SJDFVLEN EQU   *-SJDFVAR           SIZE OF VARIABLE AREA OF SJDFP       03800000
*********************************************************************** 03850000
*                                                                     * 03900000
*   ADDITIONAL DATA NEEDED FOR PARAMETER LIST                         * 03950000
*                                                                     * 04000000
*********************************************************************** 04050000
SJDFCVER EQU   2                   VERSION NUMBER                 @L1C* 04100000
         MEND                                                           04150000
.*/ %SJDFPLS: ;                                                         04200000
*DECLARE                                                                04250000
*  1 SJDFP    SJDFATRB,            /* DEFINE JDVT PARAMETER LIST     */ 04300000
*    2 SJDFID      CHAR(4),        /* IDENTIFIER C'SJDF'             */ 04350000
*    2 SJDFVERS    FIXED(8),       /* VERSION NUMBER                 */ 04400000
*    2 SJDFFLAG    BIT(8),         /* CONTROL FLAG BYTE              */ 04450000
*      3 SJDFNREC    BIT(1),       /* NO RECOVERY                    */ 04500000
*      3 SJDFNOCU    BIT(1),       /* NO CLEANUP                     */ 04550000
*      3 *           BIT(6),       /* RESERVED                       */ 04600000
*    2 SJDFLEN     FIXED(15),      /* LENGTH OF PARAMETER LIST       */ 04650000
*    2 SJDFSTOR    PTR(31),        /* LOCAL STORAGE POINTER OR ZERO  */ 04700000
*    2 SJDFREAS    FIXED(31),      /* REASON CODE                    */ 04750000
*    2 SJDFJDVT    CHAR(8),        /* JDVT NAME                      */ 04800000
*    2 SJDFFUNC    BIT(8),         /* FLAG BYTE                      */ 04850000
*      3 SJDFDFLT    BIT(1),       /* THIS JDVT IS THE SYSTEM DEFAULT*/ 04900000
*      3 *           BIT(7),       /* RESERVED                       */ 04950000
*    2 SJDFRSV1    CHAR(1),        /* RESERVED                       */ 05000000
*    2 SJDF#JDT    FIXED(15),      /* NUMBER OF JDTS FOR THIS JDVT   */ 05050000
*    2 SJDFJLNF    FIXED(15),      /* NUMBER OF THE JDT THAT FAILED     05100000
*                                     TO LOAD                        */ 05150000
*    2 SJDFSDTN    CHAR(8),        /* SDT NAME - IEFSJSDT        @L1A*/ 05175000
*    2 SJDFJDTN(*) CHAR(8);        /* JDT NAMES, NUMBER OF OCCURRENCES  05200000
*                                     DEPENDENT ON SJDF#JDT          */ 05250000
*/********************************************************************/ 05300000
*/*                                                                  */ 05350000
*/* ADDITIONAL DATA NEEDED FOR PARAMETER LIST                        */ 05400000
*/*                                                                  */ 05450000
*/********************************************************************/ 05500000
*DECLARE                                                                05550000
*  SJDFCID  CHAR(4)  CONSTANT('SJDF'),/* IDENTIFIER                  */ 05600000
*  SJDFCVER FIXED(8) CONSTANT(2);  /* VERSION NUMBER             @L1C*/ 05650000
