* %GOTO SSAGCMT;              /*                               @ZA34144 00050000
         MACRO                                                 @ZA34144 00100000
         IEFSSAG                                                        00150000
.*/ %SSAGCMT:;                /*                             @ZA34144*/ 00200000
*/********************************************************************/ 00250000
*/*  MACRO NAME =       IEFSSAG                              @ZA34144*/ 00300000
*/*  DESCRIPTIVE NAME = ALLOCATION GROUPING OF SUBSYS        @ZA34144*/ 00350000
*/*                     DD REQUESTS                          @ZA34144*/ 00400000
*/*  STATUS =           EBB1102                              @ZA34144*/ 00450000
*/*  ACCESS METHOD =    INVOKED VIA IEFJSSOB MACRO           @ZA34144*/ 00500000
*/********************************************************************/ 00600000
* %GOTO SSAGPLS;              /*                               @ZA34144 00650000
*                                                              @G29AN2F 00700000
SSOBAGRP EQU   39           GROUP SUBSYS REQUEST(SSOBFUNC)     @G29AN2F 00750000
*                                                              @G29AN2F 00800000
*        ALLOCATION GROUP RETURN CODES (SSOBRETN)              @G29AN2F 00850000
*                                                              @G29AN2F 00900000
SSAGRTOK EQU   0            ALL REQUESTS ALLOCATED             @G29AN2F 00950000
SSAGDDER EQU   4            NO ALLOCATION-ONE OR MORE          @G29AN2F 01000000
*                           REQUESTS IN ERROR - SSAGRBEC IS TO @G29AN2F 01050000
*                           BE SET FOR THE REQUESTS IN ERROR   @G29AN2F 01100000
SSAGGPER EQU   8            NO ALLOCATION-GROUP IN ERROR       @G29AN2F 01150000
*                           SSAGGPEC IS TO BE SET AND SSAGRBEC @G29AN2F 01200000
*                           MAY OPTIONALLY BE SET              @G29AN2F 01250000
*                                                              @G29AN2F 01300000
*   THE FOLLOWING RETURN CODES WILL BE RETURNED BY THE         @G29AN2F 01350000
*   SUBSYSTEM IN FIELDS SSAGGPEC AND SSAGRBEC.                 @G29AN2F 01400000
*   - FIELD SSAGGPEC (AND OPTIONALLY SSAGRBEC) IS TO BE        @G29AN2F 01450000
*     SET WHEN SSAGGPER IS RETURNED IN SSOBRETN.               @G29AN2F 01500000
*   - FIELD SSAGRBEC CORRESPONDING TO THE REQUEST(S) IN        @G29AN2F 01550000
*     ERROR IS TO BE SET WHEN SSAGDDER IS RETURNED IN          @G29AN2F 01600000
*     SSOBRETN.                                                @G29AN2F 01650000
*                                                              @G29AN2F 01700000
*   THE ASSOCIATED FIELDS SSAGGPIC AND SSAGRBIC ARE TO BE      @G29AN2F 01750000
*   SET TO SUBSYSTEM DEFINED VALUES THAT WILL BE RETURNED      @G29AN2F 01800000
*   AS DYNAMIC ALLOCATION INFORMATIONAL REASON CODES.          @G29AN2F 01850000
*                                                              @G29AN2F 01900000
*   ERROR MESSAGE PROCESSING                                   @G29AN2F 01950000
*   - WHEN SSAGSMSG IS SET BY THE CALLER FIELDS SSAGGMP        @G29AN2F 02000000
*     AND SSAGDMGP WILL EACH CONTAIN A POINTER TO AN AREA      @G29AN2F 02050000
*     IN WHICH THE SUBSYSTEM IS TO RETURN SUBSYSTEM DEFINED    @G29AN2F 02100000
*     ERROR MESSAGES CORRESPONDING TO THE VALUES SET IN        @G29AN2F 02150000
*     FIELDS SSAGGPIC AND SSAGRBIC.                            @G29AN2F 02200000
*   - EACH MESSAGE AREA CONSISTS OF A 2 BYTE LENGTH FOLLOWED   @G29AN2F 02250000
*     BY A MESSAGE TEXT AREA OF LENGTH DEFINED IN SSAGGMLN     @G29AN2F 02300000
*     AND SSAGDMLN. THE MESSAGE AREA IS NOT INITIALIZED        @G29AN2F 02350000
*     BY THE CALLER AND THE SUBSYSTEM MUST SET THE LENGTH      @G29AN2F 02400000
*     OF THE MESSAGE TEXT RETURNED.  BLANKS WILL BE            @G29AN2F 02450000
*     COMPRESSED BY THE CALLER.                                @G29AN2F 02500000
*   - MESSAGES ARE TO BE RETURNED ONLY FOR REQUESTS THAT ARE   @G29AN2F 02550000
*     IN ERROR.                                                @G29AN2F 02600000
*                                                              @G29AN2F 02650000
*   NOTE:  FIELDS SSAGRBEC, SSAGRBIC, SSAGDMGP, AND            @G29AN2F 02700000
*          SSAGDMLN ARE DEFINED IN THE GROUP ALLOCATION        @G29AN2F 02750000
*          REQUEST BLOCK, 'SSAGARBK' - MAPPED BY MACRO         @G29AN2F 02800000
*          IEFSSARB.                                           @G29AN2F 02850000
*                                                              @G29AN2F 02900000
SSAGRQOK EQU   0            REQUEST ALLOCATED                  @G29AN2F 02950000
SSAGORUN EQU   4            OPERATING SYSTEM RESOURCE          @G29AN2F 03000000
*                           NOT AVAILABLE                      @G29AN2F 03050000
SSAGSRUN EQU   8            SUBSYSTEM RESOURCE NOT AVAILABLE   @G29AN2F 03100000
SSAGIPRM EQU   12           INVALID PARAMETER SPECIFIED        @G29AN2F 03150000
SSAGIREQ EQU   16           INVALID REQUEST                    @G29AN2F 03200000
SSAGCREQ EQU   20           CANCEL REQUESTED                   @G29AN2F 03250000
SSAGSSER EQU   24           SUBSYSTEM LOGIC ERROR              @G29AN2F 03300000
         ORG   SSOBGN                                          @G29AN2F 03350000
SSAGBGN  EQU   *            SSAG BEGINNING                     @G29AN2F 03400000
SSAGLEN  DC    AL2(SSAGSIZE)  EXTENSION SIZE                   @G29AN2F 03450000
SSAGFLGS DS    B            FLAG BYTE                          @G29AN2F 03500000
SSAGWAIT EQU   X'80'        OK TO WAIT                         @G29AN2F 03550000
SSAGSMSG EQU   X'40'        SUBSYSTEM TO RETURN ERROR MESSAGES @G29AN2F 03600000
SSAGRSV1 EQU   X'20'        RESERVED FLAG                      @G29AN2F 03650000
SSAGRSV2 EQU   X'10'        RESERVED FLAG                      @G29AN2F 03700000
SSAGRSV3 EQU   X'08'        RESERVED FLAG                      @G29AN2F 03750000
SSAGRSV4 EQU   X'04'        RESERVED FLAG                      @G29AN2F 03800000
SSAGRSV5 EQU   X'02'        RESERVED FLAG                      @G29AN2F 03850000
SSAGRSV6 EQU   X'01'        RESERVED FLAG                      @G29AN2F 03900000
SSAGFLG2 DS    X            RESERVED                           @G29AN2F 03950000
SSAGGPEC DS    H            GROUP(STEP) LEVEL ERROR CODE       @G29AN2F 04000000
SSAGGPIC DS    H            GROUP(STEP) LEVEL INFO CODE        @G29AN2F 04050000
SSAGARBP DS    A            POINTER TO FIRST RB                @G29AN2F 04100000
SSAGCNCL DS    A            ADDRESS OF CANCEL ECB              @G29AN2F 04150000
SSAGJBNM DS    A            ADDRESS OF JOB NAME                @G29AN2F 04200000
SSAGGMLN DS    A            MAXIMUM LENGTH OF GROUP            @G29AN2F 04250000
*                           LEVEL MESSAGE                      @G29AN2F 04300000
SSAGGMGP DS    A            ADDRESS OF GROUP LEVEL MSG BLOCK   @G29AN2F 04350000
SSAGSIZE EQU   *-SSAGBGN    SIZE OF EXTENSION HEADER           @ZM44655 04400000
SSOBLN1B EQU   SSOBHSIZ+SSAGSIZE                               @ZM44655 04450000
         MEND                                                @ZA34144*/ 04500000
* %SSAGPLS:;                            /*                   @ZA34144*/ 04550000
*/*      FUNCTION IDS (SSOBFUNC)                             @G29AN2F*/ 04600000
*  DCL  SSOBAGRP FIXED(15) CONSTANT(39);/* GROUP SUBSYS REQUESTS        04650000
*                                                            @G29AN2F*/ 04700000
*/*                                                          @G29AN2F*/ 04750000
*/*      ALLOCATION GROUP REQUEST RETURN CODES (SSOBRETN)    @G29AN2F*/ 04800000
*/*                                                          @G29AN2F*/ 04850000
*  DCL SSAGRTOK FIXED(15) CONSTANT(0); /* SUCCESSFUL - ALL REQUESTS     04900000
*                                         WERE ALLOCATED     @G29AN2F*/ 04950000
*  DCL SSAGDDER FIXED(15) CONSTANT(4); /* NO ALLOCATION- ONE OR MORE    05000000
*                                         REQUEST IN ERROR   @G29AN2F*/ 05050000
*  DCL SSAGGPER FIXED(15) CONSTANT(8); /* NO ALLOCATION - GROUP         05100000
*                                         LEVEL ERROR        @G29AN2F*/ 05150000
* /*                                                         @G29AN2F*/ 05200000
* /*   THE FOLLOWING RETURN CODES WILL BE RETURNED BY THE    @G29AN2F*/ 05250000
* /*   SUBSYSTEM IN FIELDS SSAGGPEC AND SSAGRBEC.            @G29AN2F*/ 05300000
* /*   - FIELD SSAGGPEC (AND OPTIONALLY SSAGRBEC) IS TO BE   @G29AN2F*/ 05350000
* /*     SET WHEN SSAGGPER IS RETURNED IN SSOBRETN.          @G29AN2F*/ 05400000
* /*   - FIELD SSAGRBEC CORRESPONDING TO THE REQUEST(S) IN   @G29AN2F*/ 05450000
* /*     ERROR IS TO BE SET WHEN SSAGDDER IS RETURNED IN     @G29AN2F*/ 05500000
* /*     SSOBRETN.                                           @G29AN2F*/ 05550000
* /*                                                         @G29AN2F*/ 05600000
* /*   THE ASSOCIATED FIELDS SSAGGPIC AND SSAGRBIC ARE TO BE @G29AN2F*/ 05650000
* /*   SET TO SUBSYSTEM DEFINED VALUES THAT WILL BE RETURNED @G29AN2F*/ 05700000
* /*   AS DYNAMIC ALLOCATION INFORMATIONAL REASON CODES.     @G29AN2F*/ 05750000
* /*                                                         @G29AN2F*/ 05800000
* /********************************************************* @G29AN2F*/ 05850000
* /* ERROR MESSAGE PROCESSING                                @G29AN2F*/ 05900000
* /* -WHEN SSAGSMSG IS SET BY THE CALLER, FIELDS SSAGGMGP    @G29AN2F*/ 05950000
* /*  AND SSAGDMGP WILL EACH CONTAIN A POINTER TO AN AREA    @G29AN2F*/ 06000000
* /*  IN WHICH THE SUBSYSTEM IS TO RETURN SUBSYSTEM DEFINED  @G29AN2F*/ 06050000
* /*  ERROR MESSAGES CORRESPONDING TO THE VALUES SET IN      @G29AN2F*/ 06100000
* /*  FIELDS SSAGGPIC AND SSAGRBIC.                          @G29AN2F*/ 06150000
* /* -EACH MESSAGE AREA CONSISTS OF A 2 BYTE LENGTH FOLLOWED @G29AN2F*/ 06200000
* /*  BY A MESSAGE TEXT AREA OF LENGTH DEFINED IN SSAGGMLN   @G29AN2F*/ 06250000
* /*  AND SSAGDMLN. THE MESSAGE AREA IS NOT INITIALIZED      @G29AN2F*/ 06300000
* /*  BY THE CALLER AND THE SUBSYSTEM MUST SET THE LENGTH    @G29AN2F*/ 06350000
* /*  OF THE MESSAGE TEXT RETURNED.  BLANKS WILL BE          @G29AN2F*/ 06400000
* /*  COMPRESSED BY THE CALLER.                              @G29AN2F*/ 06450000
* /* -MESSAGES ARE TO BE RETURNED ONLY FOR REQUESTS THAT ARE @G29AN2F*/ 06500000
* /*  IN ERROR.                                              @G29AN2F*/ 06550000
* /********************************************************* @G29AN2F*/ 06600000
* /*                                                         @G29AN2F*/ 06650000
* /*   NOTE:  FIELDS SSAGRBEC, SSAGRBIC, SSAGDMGP, AND       @G29AN2F*/ 06700000
* /*          SSAGDMLN ARE DEFINED IN THE GROUP              @G29AN2F*/ 06750000
* /*          ALLOCATION REQUEST BLOCK, 'SSAGARBK' -         @G29AN2F*/ 06800000
* /*          MAPPED BY MACRO IEFSSARB.                      @G29AN2F*/ 06850000
* /*                                                         @G29AN2F*/ 06900000
* /********************************************************* @G29AN2F*/ 06950000
*  DCL SSAGRQOK FIXED(15) CONSTANT(0); /*REQUEST ALLOCATED   @G29AN2F*/ 07000000
*  DCL SSAGORUN FIXED(15) CONSTANT(4); /*OPERATING SYSTEM RESOURCE      07050000
*                                        NOT AVAILABLE       @G29AN2F*/ 07100000
*  DCL SSAGSRUN FIXED(15) CONSTANT(8); /*SUBSYSTEM RESOURCE NOT         07150000
*                                        AVAILABLE           @G29AN2F*/ 07200000
*  DCL SSAGIPRM FIXED(15) CONSTANT(12);/*INVALID PARAMETER   @G29AN2F*/ 07250000
*  DCL SSAGIREQ FIXED(15) CONSTANT(16);/*INVALID REQUEST     @G29AN2F*/ 07300000
*  DCL SSAGCREQ FIXED(15) CONSTANT(20);/*CANCEL REQUESTED    @G29AN2F*/ 07350000
*  DCL SSAGSSER FIXED(15) CONSTANT(24);/*SUBSYSTEM LOGIC ERR @G29AN2F*/ 07400000
* /*                                                         @G29AN2F*/ 07450000
* /*  S S A G                                                @G29AN2F*/ 07500000
* /*                                                         @G29AN2F*/ 07550000
* DECLARE                     /*                             @G29AN2F*/ 07600000
*  1       SSAG     SSOBAG,   /* BEGINNING OF EXTENSION      @G29AN2F*/ 07650000
*    2     SSAGEHDR,          /* EXTENSION HEADER            @G29AN2F*/ 07700000
*      3   SSAGLEN  FIXED(15),/* LENGTH OF EXTENSION         @G29AN2F*/ 07750000
*      3   SSAGFLGS BIT(16),  /* GROUP LEVEL FLAGS           @G29AN2F*/ 07800000
*        4 SSAGWAIT BIT(1),   /* OK TO WAIT FLAG             @G29AN2F*/ 07850000
*        4 SSAGSMSG BIT(1),   /* SUBSYSTEM TO RETURN ERROR              07900000
*                                MESSAGES FLAG               @G29AN2F*/ 07950000
*        4 *        BIT(14),  /* RESERVED FLAGS              @G29AN2F*/ 08000000
*      3   SSAGGPEC FIXED(15),/* GROUP LEVEL ERROR CODE      @G29AN2F*/ 08050000
*      3   SSAGGPIC FIXED(15),/* GROUP LEVEL INFO CODE - DEFINED        08100000
*                                BY THE SUBSYSTEM            @G29AN2F*/ 08150000
*      3   SSAGARBP PTR(31),  /* PTR TO FIRST RB             @G29AN2F*/ 08200000
*      3   SSAGCNCL PTR(31),  /* POINTER TO CANCEL ECB       @G29AN2F*/ 08250000
*      3   SSAGJBNM PTR(31),  /* POINTER TO JOB NAME         @G29AN2F*/ 08300000
*      3   SSAGGMLN FIXED(31),/* MAXIMUM LENGTH OF SUBSYSTEM            08350000
*                                GROUP LEVEL MESSAGE         @G29AN2F*/ 08400000
*      3   SSAGGMGP PTR(31);  /* POINTER TO GROUP LEVEL MESSAGE         08450000
*                                BLOCK                       @G29AN2F*/ 08500000
