         MACRO                                                          00401000
         IEFSDPAR                                                       00801000
IEFSDPAR DSECT                                                          01201000
****PROPRIETARY-STATEMENT********************************************** 01601000
*                                                                     * 02402100
*   LICENSED MATERIALS-PROPERTY OF IBM                                * 02402200
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 02402300
*   5647-A01 (C) COPYRIGHT IBM CORP 1978, 2000                        * 02402400
*                                                                     * 02402500
*   STATUS = HBB7703                                                  * 02402600
*                                                                     * 02402700
*01* EXTERNAL CLASSIFICATION:  NONE                                   * 02402800
*01* END OF EXTERNAL CLASSIFICATION:                                  * 02402900
*                                                                     * 02403000
****END-OF-PROPRIETARY-STATEMENT*************************************** 02403100
*                                                                MAPMAC 02403200
*          RELEASE 20 DELETIONS/CHANGES                          MAPMAC 03003200
*                                                          20202 MAPMAC 03603200
*005600-005800                                            A32047 MAPMAC 04203200
*                                                          20202 MAPMAC 04803200
*****************************************************************MAPMAC 05403200
*                THE FOLLOWING IS THE PARAMETER LIST             MAPMAC 06003200
*                COMMON TO ALL SYSOUT WRITER MODULES             MAPMAC 06603200
*                EXCEPT MODULES IEFSD070,IEFSD088,               MAPMAC 07203200
*                IEFSD095 AND IEFSDXXX.  ALSO INCLUDED           MAPMAC 07803200
*                IN THE FOLLOWING MACRO IS THE START             MAPMAC 08403200
*                PARAMETER LIST USED BY THE SYSOUT               MAPMAC 09003200
*                WRITER MODULES                                  MAPMAC 09603200
*                                                                MAPMAC 10203200
*                ANY CHANGES MADE TO THIS MACRO MUST             MAPMAC 10803200
*                BE VALID FOR ALL MODULES CONTAINING             MAPMAC 11403200
*                THIS MACRO                                      MAPMAC 12003200
*****************************************************************MAPMAC 12603200
PARLIST  DS    0F                                                MAPMAC 13203200
PARSPL   DS    A                                                 MAPMAC 13803200
PARDCB   DS    A                                                 MAPMAC 14403200
PARFORM  DS    A                                                 MAPMAC 15003200
PARECBL  DS    A                                                 MAPMAC 15603200
         SPACE 1                                               @OW07061 16810000
*------------------------------------------------------------* @OW07061 16820000
*                                                            * @OW07061 16830000
*        PARQMPAR is also defined as PARWORK2. PARWORK2      * @OW07061 16840000
*        is used by IASXSD81 as a double word work area      * @OW07061 16850000
*        to hold parameters specified by the user when the   * @OW07061 16860000
*        writer is started. Note that PARSMB is also used    * @OW07061 16870000
*        for this function as well.                          * @OW07061 16880000
*                                                            * @OW07061 16890000
*------------------------------------------------------------* @OW07061 16900000
         SPACE 1                                               @OW07061 16910000
PARQMPAR DS    A                                                 MAPMAC 17410000
PARSMB   DS    A                                                 MAPMAC 17910000
PARSWCH  DS    A                   SWITCHES                      MAPMAC 18410000
PARDAT   EQU   1                   DATASET PAUSE SWITCH          MAPMAC 18910000
PARPUN   EQU   2                   PUNCH TYPE SWITCH             MAPMAC 19410000
PARTTE   EQU   4                   086 ENTRY TO TTE        20202 MAPMAC 19910000
PARDUMMY EQU   8                   DUMMY DATA SET SW     A32047  MAPMAC 20410000
PARTTE1  EQU   16                  078 ENTRY TO TTE        20202 MAPMAC 20910000
PARCERTD EQU   32                  CERTIFY=Y was specified     @OW07061C21920000
                                    on start-up parms          @OW07061 21930000
PARBLANK EQU   64                  Found blank character       @OW07061C21940000
                                    during scan                @OW07061 21950000
PARCERTF EQU   128                 Found CERTIFY keyword       @OW07061C21960000
                                    during scan                @OW07061 21970000
         SPACE 1                                               @OW07061 21980000
PARCHAR  EQU   PARSWCH+1           CONDITIONAL SWITCHES          MAPMAC 22580000
PARCPAU  EQU   1                   CONDITIONAL PAUSE SWITCH      MAPMAC 23180000
PARCDAT  EQU   2                   CONDITIONAL DS PAUSE SW       MAPMAC 23780000
PARCCLA  EQU   4                   CONDITIONAL CLASSES SW        MAPMAC 24380000
PARJBSEP DS    A                   JOB SEPARATION NAME PNTR.     MAPMAC 24980000
PARGCLN  DS    CL8                 Current good class names    @OW07061 25580000
PAREXCP  DS    A                   FIRST 0 BYTE 0 = BUFF NO      MAPMAC 26180000
*                                    BYTE 1 = TTXXXCCX           MAPMAC 26780000
*                                      TT = RECORD TYPE          MAPMAC 27380000
*                                       01 = VARIABLE            MAPMAC 27980000
*                                      CC = CONTROL CHAR.        MAPMAC 28580000
*                                       00 = NO CNTRL CHAR.      MAPMAC 29180000
*                                    BYTES 2-3 = A BUF LNTH      MAPMAC 29780000
*                                  THEN 0 PTR TO CORE GOT        MAPMAC 30380000
*                                    FOR EXCP I/O TABLES         MAPMAC 30980000
PARJSNM  DS    A                   JOB                           MAPMAC 31580000
         DS    A                     SEPERATOR NAME              MAPMAC 32180000
PARXXX   DS    A                   LOCATION OF SPAN MODULE       MAPMAC 32780000
PARXXA   DS    A                   LOCATION OF SPAN CORE         MAPMAC 33380000
PARLRECL DS    A                   OUTPUT LRECL SIZE             MAPMAC 33980000
PARSMF   DS    1F                                                MAPMAC 34580000
PARWKLST DS    A                   ADDR. OF WORK SPACE (SIZE=B4) MAPMAC 35180000
PARCOMM  DS    A                   ADDR OF COMM AREA IN CSCB     MAPMAC 35780000
PARWKSOR DS    A                   WK AREA FOR STD & EXCP OUTPUT MAPMAC 36380000
ACTIVE   EQU   X'80'               COMMAND ACTIVE BIT            MAPMAC 36980000
PARUCSID DS    A                   UCS DEFAULT-ID          20202 MAPMAC 37580000
PARFCBID DS    A                   FCB DEFAULT-ID          20202 MAPMAC 38180000
PARUCB   DS    A                   UCB address of output       @OW37014C38780000
                                    device (or zero)           @OW37014 38790000
PARSAP   DS    A                        SAVE AREA POINTER        M359   39380000
PARSAV   DS    18F                      REGISTER SAVE AREA       M359   39980000
PARWORK  DS    F                   WORK AREA ADDRESS                    40580000
PARALLOC DS    A                   ADDR. OF DYNALLOC PARM AREA CORE     41180000
PARNAMES DS    A                   ADDR. OF VALID NAMES TABLE    MAPMAC 41780000
PARWTRNM DS    CL4                 Writer Device Number        @510LFDD 42380000
PARDUM   DS    X                   BYTE OF WAIT SWITCHES                42980000
PARWAIT  EQU   X'80'               INDICATOR TO WRITE WAIT MSG.         43580000
PARMOD   EQU   X'40'               INDICATOR TO WAIT ON COMMAND ECB     44180000
PARUCBT3 DS    X                   DEVTYPE-synthesized version @OW37014C44190000
                                    of UCBTBYT3 for the output @OW37014C44200000
                                    device                     @OW37014 44210000
PARNOUCB EQU   X'01'               No UCB for this device      @OW37014 44220000
         DS    CL2                 Reserved for future use     @OW37014 44790000
PAREND   EQU   *              END OF PARAMETER LIST              MAPMAC 45390000
*                                                                MAPMAC 45990000
PARLENGT EQU   PAREND-PARLIST                                    MAPMAC 46590000
PARDSB   EQU   PARSMB                                            MAPMAC 47190000
PARWORK1 EQU   PARECBL                                           MAPMAC 47790000
PARWORK2 EQU   PARQMPAR                                          MAPMAC 48390000
*                                                                MAPMAC 48990000
*                                                                MAPMAC 49590000
*        /---------------------------------------------------/   MAPMAC 50190000
*        / PARSPL   -START PARAMETER LIST ADDRESS            /   MAPMAC 50790000
*        /---------------------------------------------------/   MAPMAC 51390000
*        / PARDCB   -OUTPUT DCB ADDRESS                      /   MAPMAC 51990000
*        /---------------------------------------------------/   MAPMAC 52590000
*        / PARFORM  -IDENTIFICATION OF DESIRED OUTPUT FORMS  /   MAPMAC 53190000
*        /---------------------------------------------------/   MAPMAC 53790000
*        / PARECBL  -ADDRESS OF CSCB ECB                     /   MAPMAC 54390000
*        /---------------------------------------------------/   MAPMAC 54990000
*        / PARQMPAR -QUEUE MANAGER PARAMETERS ADDRESS        /   MAPMAC 55590000
*        /---------------------------------------------------/   MAPMAC 56190000
*        / PARSMB   -SYSTEM MESSAGE BLOCK ADDRESS            /   MAPMAC 56790000
*        /---------------------------------------------------/   MAPMAC 57390000
*        / PARSWCH  -SWITCHES                                /   MAPMAC 57990000
*        /---------------------------------------------------/   MAPMAC 58590000
*        / PARJBSEP -JOB SEPERATION NAME POINTER             /   MAPMAC 59190000
*        /---------------------------------------------------/   MAPMAC 59790000
*        / PARGCLN  -CURRENT GOOD CLASS NAMES                /   MAPMAC 60390000
*        /---------------------------------------------------/   MAPMAC 60990000
*        /     ( 1 MORE FULL WORD )                          /   MAPMAC 61590000
*        /---------------------------------------------------/   MAPMAC 62190000
*        / PAREXCP  -INFORMATION FOR EXCP ROUTINE            /   MAPMAC 62790000
*        /---------------------------------------------------/   MAPMAC 63390000
*        / PARJSNM  -JOB SEPERATION NAME                     /   MAPMAC 63990000
*        /---------------------------------------------------/   MAPMAC 64590000
*        /     ( 1 MORE FULL WORD )                          /   MAPMAC 65190000
*        /---------------------------------------------------/   MAPMAC 65790000
*        / PARXXX   -LOCATION OF SPANNING MODULE             /   MAPMAC 66390000
*        /---------------------------------------------------/   MAPMAC 66990000
*        / PARXXA   -LOCATION OF SPANNING CORE               /   MAPMAC 67590000
*        /---------------------------------------------------/   MAPMAC 68190000
*        / PARLRECL -OUTPUT LRECL SIZE (FIRST HALF WORD)     /   MAPMAC 68790000
*        /---------------------------------------------------/   MAPMAC 69390000
*        / PARSMF   -SYSTEM MANAGEMENT FACILITY              /   MAPMAC 69990000
*        /---------------------------------------------------/   MAPMAC 70590000
*        / PARWKLST -DSB & SMB WORKLIST (WORKLST) ADDRESS    /   MAPMAC 71190000
*        /---------------------------------------------------/   MAPMAC 71790000
*        / PARCOMM  -CSCB COMMUNICATION AREA ADDRESS         /   MAPMAC 72390000
*        /---------------------------------------------------/   MAPMAC 72990000
*        / PARWKSOR -STD & EXCP OUTPUT WORK AREA (WKSOR) ADDR/   MAPMAC 73590000
*        /---------------------------------------------------/   MAPMAC 74190000
*        / PARUCSID -S WTR UCS IMAGE-ID USED FOR DEFAULT / 20202 MAPMAC 74790000
*        /---------------------------------------------------/   MAPMAC 75390000
*        / PARFCBID -S WTR FCB IMAGE-ID USED FOR DEFAULT / 20202 MAPMAC 75990000
*        /---------------------------------------------------/   MAPMAC 76590000
*        / PARUCB   -UCB ADDRESS                             /   MAPMAC 77190000
*        /----------------------------------------------/ A32047 MAPMAC 77790000
*        / PARSAP   -LOCATION OF LINKORS REG SAVE AREA   / 20202 MAPMAC 78390000
*        /---------------------------------------------------/   MAPMAC 78990000
*        / PARSAV   -REGISTER SAVE AREA                  / 20202 MAPMAC 79590000
*        /---------------------------------------------------/   MAPMAC 80190000
*        /     ( 17 MORE FULL WORDS )                    / 20202 MAPMAC 80790000
*        /---------------------------------------------------/   MAPMAC 81390000
*        / PARWORK  -ADDR. OF JFCB, MSG. & SSOB WORK AREAS   /   MAPMAC 81990000
*        /---------------------------------------------------/   MAPMAC 82590000
*        / PARALLOC -ADDR. OF DYNAMIC ALLOCATE PARAMETER LIST/   MAPMAC 83190000
*        /---------------------------------------------------/   MAPMAC 83790000
*        / PARNAMES -ADDR. OF VALID USER WRITER NAME TABLE   /   MAPMAC 84390000
*        /---------------------------------------------------/   MAPMAC 84990000
*        / PARWTRNM -DEVICE NUMBER OF THIS EXTERNAL WRITER   / @510LFDD 85590000
*        /---------------------------------------------------/   MAPMAC 86190000
*        / PARDUM   -WAIT FLAG BYTE                          / @510LFDD 87102000
*        /---------------------------------------------------/ @510LFDD 87108000
*        / PARUCBT3 -DEVTYPE-synthesized UCBTBYT3 flag byte  / @OW37014 87112000
*        /---------------------------------------------------/ @OW37014 87116000
*                                                          20202 MAPMAC 87120020
*                                                          20202 MAPMAC 87220020
*                                                                MAPMAC 88000020
SPLAD    DSECT                                                          88800020
SPLPAR   DS    A                   EXECUTE PARM                  MAPMAC 89600020
*                                                                MAPMAC 92800020
*****************************************************************MAPMAC 93600020
         MEND                                                           94400020
