* %GOTO SSCMCMT;              /*                               @ZA34144 00050003
         MACRO                                                 @ZA34144 00100003
         IEFSSCM                                                        00150003
.*/ %SSCMCMT:;                /*                             @ZA34144*/ 00200003
*                                                                       00200300
*/**** START OF SPECIFICATIONS ***************************************/ 00200600
*/*                                                                  */ 00200900
*/*01* MACRO NAME:  IEFSSCM                                      @LAC*/ 00201200
*/*                                                                  */ 00201500
*/*01* DESCRIPTIVE NAME:  SSOB EXTENSION FOR COMMAND PROCESSING  @LAC*/ 00201800
*/*                       EXIT                                   @LAA*/ 00202100
*/*01* ACRONYM:     SSCM                                         @LAA*/ 00202400
*/*01* EXTERNAL CLASSIFICATION: PSPI                             @LAA*/ 00202700
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @LAA*/ 00203000
*/*                                                                  */ 00203300
*/*01* PROPRIETARY STATEMENT=                                        */ 00203800
*/***PROPRIETARY_STATEMENT********************************************/ 00207600
*/*                                                                  */ 00211400
*/*                                                                  */ 00215200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00219000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00222800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1983, 1994                      */ 00226600
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00230400
*/*                                                                  */ 00234200
*/* STATUS= HBB5520                                                  */ 00238000
*/*                                                                  */ 00241800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00245600
*/********************************************************************/ 00250003
*/*01*  DSECT NAME:  SSCM                                        @LAA*/ 00253300
*/*01*  COMPONENT:  INITIATOR/TERMINATOR (SC1B6)                 @LAA*/ 00256600
*/*01*  EYE-CATCHER:  SSCM                                       @LAA*/ 00259900
*/*02*    OFFSET:    12                                          @LAA*/ 00263200
*/*02*    LENGTH:    4                                           @LAA*/ 00266500
*/*01*  STORAGE ATTRIBUTES:                                      @LAA*/ 00269800
*/*02*    MAIN STORAGE:                                          @LAA*/ 00273100
*/*02*    VIRTUAL STORAGE:                                       @LAA*/ 00276400
*/*02*    AUXILIARY STORAGE:                                     @LAA*/ 00279700
*/*02*    DATA SPACE:                                            @LAA*/ 00283000
*/*02*    SUBPOOL:      USER SUBPOOL AND KEY                     @LAA*/ 00286300
*/*02*    KEY:          USER SUBPOOL AND KEY                     @LAA*/ 00289600
*/*02*    RESIDENCY:                                             @LAA*/ 00292900
*/*01*  SIZE: 20 BYTES FOR SSOB PLUS 88 BYTES FOR SSCM           @LAA*/ 00296200
*/*01*  FUNCTION:  PARAMETER LIST FOR THE SUBSYSTEM COMMAND      @LAC*/ 00298400
*/*                EXIT.                                         @LAC*/ 00300600
*/*                                                              @L1A*/ 00302800
*/*01* METHOD OF ACCESS:                                         @LAA*/ 00306100
*/*    ASM - THIS MACRO HAS TWO CALLING SEQUENCES:               @L1A*/ 00310000
*/*          1) IEFJSSOB (CM,...),CONTIG=YES/NO                  @L1A*/ 00314000
*/*                                                              @L1A*/ 00318000
*/*                 WHERE THE VALUES WITHIN THE PARENTHESES      @L1A*/ 00322000
*/*                 ARE THE FUNCTION IDS FOR THE SSI             @L1A*/ 00326000
*/*                 EXTENSIONS REQUESTED. CM IS THE FUNCTION     @L1A*/ 00330000
*/*                 ID FOR THIS FUNCTIONAL EXTENSION.            @L1A*/ 00334000
*/*                 ALSO PROCUCED IS THE SSOB HEADER.            @L1A*/ 00338000
*/*                                                              @L1A*/ 00342000
*/*                 CONTIG=NO RESULTS IN A DSECT BEING           @L1A*/ 00346000
*/*                 GENERATED (WITH A NAME OF SSOBEXT)           @L1A*/ 00350000
*/*                 BETWEEN THE SSOB HEADER AND THE              @L1A*/ 00354000
*/*                 EXTENSION(S).                                @L1A*/ 00358000
*/*                                                              @L1A*/ 00362000
*/*                 CONTIG=YES RESULTS  IN THE EXTENSION(S)      @L1A*/ 00366000
*/*                 BEING CONTIGUOUS WITH THE SSOB HEADER.       @L1A*/ 00370000
*/*                 THIS IS THE DEFAULT.                         @L1A*/ 00374000
*/*                                                              @L1A*/ 00378000
*/*          2) SSCM DSECT     (OPTIONAL)                        @L1A*/ 00382000
*/*                  IEFSSCM                                     @L1A*/ 00386000
*/*                                                              @L1A*/ 00390000
*/*                  THIS WILL ONLY PRODUCE THE CM EXTENSION     @L1A*/ 00394000
*/*                                                              @L1A*/ 00398000
*/*    NOTES ON THE ASSEMBLER INVOCATION:                        @L1A*/ 00402000
*/*     - IEFSSCM REFERENCES FIELD SSOBHSIZ (TO DETERMINE THE    @L1A*/ 00406000
*/*       TOTAL SSOB SIZE: HEADER PLUS EXTENSION), THIS FIELD    @L1A*/ 00410000
*/*       IS DEFINED IN THE SSOB HEADER.                         @L1A*/ 00414000
*/*     - AN 'ORG SSOBGN' APPEARS AT THE BEGINNING OF IEFSSCM.   @L1A*/ 00418000
*/*       IEFJSSOB GENERATES THE DEFINITION OF SSOBGN. IF        @L1A*/ 00422000
*/*       IEFJSSOB IS NOT INVOKED, THE CALLER MUST DEFINE        @L1A*/ 00426000
*/*       THIS SYMBOL.                                           @L1A*/ 00430000
*/*                                                              @L1A*/ 00434000
*/*    PL/S - %DCL SSOBCM CHAR                                   @L1A*/ 00438000
*/*           %SSOBCM='VALUE'                                    @L1A*/ 00442000
*/*                  WHERE 'VALUE' = 'BASED' OR 'BDY(WORD)'      @L1A*/ 00446000
*/*                                                              @L1A*/ 00450000
*/*           THEN CODE EITHER OF THE FOLLOWING:                 @L1A*/ 00454000
*/*           %INCLUDE SYSLIB(IEFJSSOB)                          @L1A*/ 00458000
*/*                   OR                                         @L1A*/ 00462000
*/*           %INCLUDE SYSLIB(IEFSSCM)                           @L1A*/ 00466000
*/*                                                                  */ 00470000
*/*                                                                  */ 00474000
*/*01* CREATED BY:  IEE0403D                                     @LAC*/ 00480000
*/*                                                              @L1A*/ 00486000
*/*01* POINTED TO BY:  SSOBINDV FIELD OF THE SSOB DATA AREA      @LAC*/ 00492000
*/*                                                              @L1A*/ 00498000
*/*01* SERIALIZATION:  NONE                                      @LAC*/ 00516000
*/*                                                              @L1A*/ 00534000
*/*  CHANGE ACTIVITY =                                           @L1A*/ 00538000
*/*  $MAC(IEFSSCM) COMP(SC1B6): COMMAND PROCESSING EXIT              */ 00540000
*/*  $L1=OCCF,      JBB2110,  820531,  PD2I: OCCF UPDATES            */ 00542000
*/*  $L2=COEXINPT,  JBB2220,  840822,  PDP8: JES3/MCS COEXISTENCE    */ 00544000
*/*  $01=OY38182,   JBB2220,  901221,  PDHE: ADD PROGRAM TOKEN       */ 00544500
*/*  $L3=SP313,     JBB3313,  880226,  PDCR: MVS B1 SECURITY SUPPORT */ 00545000
*/*  $L4=SP3134CR,  JBB3313,  880729,  PDCR: MVS B1 SECURITY SUPPORT */ 00545500
*/*  $L5=CNMG2MG,   HBB4410,  870420,  PDU9: CONSOLE MERGE STAGE II  */ 00545600
*/*  $L6=OPSSI,     HBB4410,  870831,  PDBD: COMMAND AUTHORIZATION   */ 00545700
*/*  $L7=TSOOP,     HBB4410,  870916,  PDDI: TSO OPERATOR            */ 00545800
*/*  $D1=DEO0253,   HBB4410,  891127,  PDAU: SYSPLEX REPLIES         */ 00545900
*/*  $P1=PEO3123,   HBB4410,  891127,  PDCR: BAD UTOKEN OFFSET       */ 00547200
*/*  $L8=OPSSI21BD, HBB4410,  900105,  PDBD: SYSPLEX REPLIES         */ 00547800
*/*  $P2=PEO3729,   HBB4410,  900226,  PD35: SSCMVRPL DEFINITION     */ 00548100
*/*  $L9=SYSOPFDQ,  HBB5510,  930304,  PDDQ: SYSOPS ROUTE *ALL       */ 00548200
*/*  $LA=SYSOP16,   HBB5510,  930520,  PD3J: SHOWHDR UPDATES         */ 00548300
*/*  $P3=PIG3721,   HBB5510,  931129,  PDED: STRUCTURE ERRORS        */ 00548700
*/*  $LB=CLONE7Q8,  HBB5520,  940315,  PDQ8: Sysclone support        */ 00548900
*/*  $P4=PN70355,   HBB5520,  940415,  PDQ8: Restore Location        */ 00549000
*/*                                          Counter                 */ 00549100
*/*  $02=OW15497,   HBB5510,  960222,  PDED: Originating console id  */ 00549200
*/*     YA31146 --- ALLOW SCCM AS CMDAUTH MACRO CONTROL BLOCK INPUT  */ 00549400
*/*                                                                  */ 00549500
*/********************************************************************/ 00550003
*/* END OF SPECIFICATIONS                                        @LAA*/ 00575000
* %GOTO SSCMPLS;              /*                               @ZA34144 00600003
*                                                                       00700003
SSOBCMND EQU   10                 CMD PROCESSING FUNCTION ID (SSOBFUNC) 00750003
*                                                                       00800003
*  COMMAND PROCESSING RETURN CODES (SSOBRETN)                           00850003
*                                                                       00900003
SSCMSCMD EQU   0                  SVC 34 SHOULD PROCESS THIS COMMAND    00950003
*                                                                       00964200
SSCMSUBC EQU   4                  FUNCTION 10:                     @L1A 00978500
*                                   SUBSYSTEM HAS PROCESSED THE    @L1A 01007000
*                                   COMMAND                        @L1A 01035500
*                                                                       01150003
SSCMIMSG EQU   8                  FUNCTION 10:                     @L1A 01155500
*                                   SUBSYSTEM COULD NOT EXECUTE    @L1A 01161000
*                                   THE COMMAND - SVC 34 ISSUES    @L1A 01166500
*                                   MESSAGE                        @L1A 01172000
*                                                                       01194000
         ORG   SSOBGN                                                   01200003
SSCMBGN  EQU   *                                                        01250003
SSCMLEN  DC    AL2(SSCMSIZE)      COMMAND EXTENSION LENGTH              01300003
SSCMRESV DS    X                  RESERVED                         @L1C 01320000
SSCMVRSN DC    AL1(SSCMVRID)      VERSION LEVEL                    @L1A 01340000
SSCM211  EQU   1                  VERSION LEVEL FOR OS/VS2 JBB2110 @L1A 01360000
SSCM220  EQU   2                  VERSION LEVEL FOR OS/VS2 JBB2220 @L2A 01373300
SSCM410  EQU   3                  VERSION LEVEL FOR HBB4410        @L5A 01382200
SSCM520  EQU   4                  VERSION LEVEL FOR HBB5520        @LBA 01388100
SSCMVRID EQU   SSCM520            VERSION LEVEL VALUE              @LBC 01394000
SSCMBUFF DS    A                  COMMAND BUFFER ADDRESS                01400003
SSCMSCID DS    F                  COMMAND SOURCE - CONSOLE ID OR 0      01450003
*                                      - ASID OF TIME-SHARING USER      01500003
*                                      - CMD AUTHORITY OF INPUT STREAM  01550003
*                                                                       01600003
SSCMACRN DS    CL4                CONTROL BLOCK ACRONYM - 'SSCM'   @L2A 01608300
SSCMAUTH DS    0BL2               COMMAND AUTHORITY                @L2A 01609800
SSCMAUTA DS    BL1                COMMAND AUTHORITY BYTE 1         @L2A 01611300
SSCMSYS  EQU   X'80'              COMMAND GROUP 1 (SYS)            @L2A 01612300
SSCMIO   EQU   X'40'              COMMAND GROUP 2 (I/O)            @L2A 01613300
SSCMCONS EQU   X'20'              COMMAND GROUP 3 (CONS)           @L2A 01614300
SSCMAUTB DS    BL1                COMMAND AUTHORITY BYTE 2         @L2A 01615300
SSCMDISP DS    BL1                DISPOSITION FLAGS                @L2A 01624200
SSCMMC   EQU   X'80'              MASTER AUTHORITY                 @L6C 01633200
SSCMNMCS EQU   X'40'              NON MCS CONSOLE ID               @L5A 01636000
SSCMC    EQU   X'20'              COMMAND FROM MCS CONSOLE         @L3A 01636500
SSCMDSPR EQU   X'10'              COMMAND ISSUED BEFORE RACF ACTIVE    X01637000
                                                                   @L4A 01638000
SSCMXR2  EQU   X'0F'              RESERVED                         @L4C 01639000
SSCMBLEN DS    CL1                COMMAND BUFFER LENGTH        @YA31146 01639600
SSCMPTOK DS    CL4                PROGRAM TOKEN                    @01A 01639900
SSCMPTHR EQU   X'80'              PROGRAM TOKEN EXISTS             @01A 01640200
SSCMOLIP DS    A                  If SSCMSYMS = ON, address of         X01640300
                                  structure SSCMOLIB (original command X01640400
                                  text before symbolic variable        X01640500
                                  substitution)                    @LBC 01640600
SSCMUTOK DS    A                  POINTER TO UTOKEN                @L3A 01641000
SSCMULTH DS    H                  UTOKEN LENGTH                    @L3A 01642000
SSCMFLG  DS    BL1                MISC FLAGS                       @L9A 01642500
SSCMRTDM EQU   X'80'              ROUTED BY ROUTE *ALL COMMAND     @L9A 01643000
SSCMSYMS EQU   X'40'              Command text was changed by          X01643100
                                  substitution of symbolic             X01643200
                                  variables                        @LBA 01643300
SSCMIDOK EQU   X'20'              SSCMOCID valid                   @02A 01643400
SSCMRES3 DS    CL1                RESERVED                         @L9C 01643500
SSCMCNID DS    F                  4-BYTE CONSOLE ID                @L5A 01644000
SSCMSCNM DS    CL8                CONSOLE NAME                     @L5A 01645000
SSCMCTXT DS    A                  POINTER TO COMMAND TEXT          @L5A 01646000
SSCMCLEN DS    H                  COMMAND TEXT LENGTH              @L5A 01647000
SSCMCART DS    CL8                COMMAND AND RESPONSE TOKEN       @L7A 01648000
SSCMRES4 DS    CL2                RESERVED                         @D1C 01648200
SSCMCXPT DS    A                  ADDRESS OF COMMAND SENSITIVE AREA    X01648400
                                                                   @D1A 01648500
* THIS AREA SHOULD ALWAYS BE AT THE BOTTOM OF THE SSCM.            @D1A 01648600
* SSCMXPT SHOULD BE USED TO LOCATE THE COMMAND SESITIVE AREA       @D1A 01648700
SSCMCMDX DS    CL20               COMMAND SENSITIVE AREA FOR REPLIES   X01649000
                                                                   @D1A 01649200
SSCMSIZE EQU   *-SSCMBGN          COMMAND EXTENSION LENGTH              01650003
SSOBLEN7 EQU   SSOBHSIZ+SSCMSIZE  TOTAL SSOB LENGTH                     01700003
         SPACE 1                                                        01700700
*********************************************************************** 01701400
*        COMMAND SENSITIVE AREA FOR REPLY COMMAND                     * 01702100
*********************************************************************** 01702800
         SPACE 1                                                        01703500
SSCMCMDR ORG   SSCMCMDX                                            @D1A 01704500
SSCMCVRB DS    B                  COMMAND VERB (X'85')             @L8A 01706000
SSCMRES6 DS    CL3                RESERVED                         @L8A 01707500
SSCMRTCB DS    A                  TCB OF WTOR ISSUER               @D1A 01709000
SSCMRASI DS    H                  ASID OF WTOR ISSUER              @D1A 01713500
SSCMRTXT DS    H                  OFFSET TO REPLY TEXT             @D1A 01718000
SSCMRFLG DS    CL1                SYSPLEX REPLY FLAGS              @D1A 01722500
SSCMRSEC EQU   X'80'              REPLY TO A SECURITY WTOR (ROUTE CODE X01726400
                                  OF 9)                            @L8C 01730300
SSCMRRES EQU   X'7F'              RESERVED                         @D1A 01734200
SSCMRES5 DS    CL3                RESERVED                         @02C 01735200
SSCMOCID DS    F                  Originating console id (used in auth X01736200
                                  checking                         @02A 01737200
*********************************************************************** 01738400
* The following structure (SSCMOLIB) is pointed to by SSCMOLIP        * 01738700
*      if SSCMSYMS = ON. It contains the length and text of the       * 01739000
*      original command before any symbolic variables were            * 01739300
*      substituted.                                              @LBA * 01739600
*********************************************************************** 01739900
         SPACE 1                                                   @LBA 01740200
SSCMOLIB DSECT            Original command text                    @LBA 01740500
SSCMOMDL DS    H          Length of the command text               @LBA 01740800
SSCMOMDI DS    0CL1       Command image text                       @LBA 01741100
.*                                                                      01744400
&SYSLOC  LOCTR            Set location counter                     @P4A 01744700
         SPACE 1                                                        01745000
SSCMVRPL EQU   X'85'              VERB CODE FOR REPLY              @L8A 01745900
         MEND                                                @ZA34144*/ 01750003
* %SSCMPLS:;                              /*                 @ZA34144*/ 01780003
*   DCL SSOBCMND  FIXED(15) CONSTANT(10); /*CMD FUNCTION ID(SSOBFUNC)*/ 01830000
*   /*                                                               */ 01900003
*   /*  COMMAND PROCESSING RETURN CODES (SSOBRETN)                   */ 01950003
*   /*                                                               */ 02000003
*   DCL SSCMSCMD  FIXED(31) CONSTANT(0); /* SVC 34 SHOULD PROCESS       02050003
*                                           THE COMMAND              */ 02100003
*   DCL SSCMSUBC  FIXED(31) CONSTANT(4);                                02109200
*/*                               FUNCTION 10:                     @L1A 02118400
*                                   SUBSYSTEM HAS PROCESSED THE    @L1A 02127600
*                                   COMMAND                        @L1A 02136800
*                                                                    */ 02173600
*   DCL SSCMIMSG  FIXED(31) CONSTANT(8);                                02182800
*/*                               FUNCTION 10:                     @L1A 02192000
*                                   SUBSYSTEM COULD NOT EXECUTE    @L1A 02201200
*                                   THE COMMAND - SVC 34 ISSUES    @L1A 02210400
*                                   MESSAGE                        @L1A 02219600
*                                                                    */ 02256400
*/************************************************************** @L1A*/ 02265600
*/*                                                              @L1A*/ 02274800
*/*                VERSION LEVEL CONSTANTS                       @L1A*/ 02284000
*/*               AND CONTROL BLOCK ACRONYM                      @L2A*/ 02288600
*/*                                                              @L1A*/ 02293200
*/************************************************************** @L1A*/ 02302400
* DECLARE                           /*                           @L1A*/ 02311600
*  SSCM211 FIXED(8) CONSTANT(1),    /* VERSION LEVEL FOR OS/VS2 JBB2110 02320800
*                                                                @L1A*/ 02330000
*  SSCM220 FIXED(8) CONSTANT(2),    /* VERSION LEVEL FOR OS/VS2 JBB2220 02333300
*                                                                @L2A*/ 02336600
*  SSCM410 FIXED(8) CONSTANT(3),    /* VERSION LEVEL FOR HBB4410 @L5A*/ 02338800
*  SSCM520 FIXED(8) CONSTANT(4),    /* VERSION LEVEL FOR HBB5520 @LBA*/ 02340200
*  SSCMVRID FIXED(8) CONSTANT(SSCM520); /* VERSION LEVEL VALUE   @LBC*/ 02341600
* DECLARE                           /*                           @L2A*/ 02343200
*  SSCMID CHAR(4) CONSTANT('SSCM'); /* SSCM ACRONYM              @L2A*/ 02346500
*   /*   S S C M                                                     */ 02350003
*DECLARE                                                                02400003
*   1       SSCM          SSOBCM,                                       02450003
*     2       SSCMLEN     FIXED(15),/* LENGTH OF SSCM                */ 02500003
*     2       SSCMRESV    FIXED(8), /* RESERVED                  @L1C*/ 02533300
*     2       SSCMVRSN    FIXED(8), /* VERSION LEVEL             @L1A*/ 02566600
*     2       SSCMBUFF    PTR(31),  /* ADDRESS OF THE COMMAND BUFFER */ 02600003
*     2       SSCMSCID    PTR(31),  /* COMMAND SOURCE -> CONSOLE ID     02650000
*                                      OR ZERO, ASID OF TIME-SHARING    02700000
*                                      USER OR CMD AUTHORITY OF         02750000
*                                      INPUT STREAM                  */ 02800000
*     2       SSCMACRN    CHAR(4),  /* CONTROL BLOCK ACRONYM -          02850000
*                                      SSCM                      @L2A*/ 02900000
*     2       SSCMAUTH    BIT(16),  /* COMMAND AUTHORITY         @L2A*/ 02908200
*       3     SSCMAUTA    BIT(8),   /* COMMAND AUTHORITY BYTE 1  @L2A*/ 02916500
*         5   SSCMSYS     BIT(1),   /* COMMAND GROUP 1 (SYS)     @L2A*/ 02922000
*         5   SSCMIO      BIT(1),   /* COMMAND GROUP 2 (I/O)     @L2A*/ 02927500
*         5   SSCMCONS    BIT(1),   /* COMMAND GROUP 3 (CONS)    @L2A*/ 02933000
*         5   *           BIT(5),   /* RESERVED                  @L2A*/ 02938500
*       3     SSCMAUTB    BIT(8),   /* COMMAND AUTHORITY BYTE 2  @L2A*/ 02944000
*     2       SSCMDISP    BIT(8),   /* DISPOSITION FLAGS         @L2A*/ 02994000
*       3     SSCMMC      BIT(1),   /* MASTER AUTHORITY          @L6C*/ 03050000
*       3     SSCMNMCS    BIT(1),   /* NON MCS CONSOLE ID        @L5A*/ 03100000
*       3     SSCMC       BIT(1),   /* COMMAND FROM MCS CONSOLE  @L3A*/ 03120000
*       3     SSCMDSPR    BIT(1),   /* COMMAND ISSUED BEFORE RACF       03140000
*                                      ACTIVE                    @L4A*/ 03190000
*       3     *           BIT(4),   /* RESERVED                  @L4C*/ 03240000
*     2 SSCMBLEN          CHAR(1),  /* COMMAND BUFFER LENGTH @YA31146*/ 03273300
*     2 SSCMPTOK          CHAR(4),  /* PROGRAM TOKEN             @01A*/ 03289900
*       3 SSCMPTHR        BIT(1),   /* PROGRAM TOKEN EXISTS      @01A*/ 03306500
*     2 SSCMOLIP          PTR(31),  /* If SSCMSYMS = ON, address        03313200
*                                      of structure SSCMOLIB (original  03319900
*                                      command text before symbolic     03326600
*                                      variable substitution)    @LBC*/ 03333300
*     2 SSCMUTOK          PTR(31),  /* POINTER TO UTOKEN         @L3A*/ 03340000
*     2 SSCMULTH          FIXED(15),  /* LENGTH OF UTOKEN        @L3A*/ 03390000
*     2 SSCMFLG           BIT(8),   /* MISC FLAGS                @L9A*/ 03410000
*       3 SSCMRTDM        BIT(1),   /* ROUTED BY ROUTE *ALL CMD  @P3C*/ 03430000
*       3 SSCMSYMS        BIT(1),   /* Command text was changed by      03438000
*                                      substitution of symbolic         03446000
*                                      variables                 @LBA*/ 03454000
*       3 SSCMIDOK        BIT(1),   /* SSCMOCID valid            @02A*/ 03459300
*       3 *               BIT(5),   /* RESERVED                  @02C*/ 03464600
*     2 SSCMRES3          CHAR(1),  /* RESERVED                  @L9C*/ 03470000
*     2 SSCMCNID          FIXED(32),/* 4-BYTE CONSOLE ID         @L5A*/ 03490000
*     2 SSCMSCNM          CHAR(8),  /* CONSOLE NAME              @L5A*/ 03540000
*     2 SSCMCTXT          PTR(31),  /* POINTER TO COMMAND TEXT   @L5A*/ 03590000
*     2 SSCMCLEN          FIXED(16),/* COMMAND TEXT LENGTH       @L5A*/ 03640000
*     2 SSCMCART          CHAR(8),  /* COMMAND & RESPONSE TOKEN  @L7A*/ 03690000
*     2 SSCMRES4          CHAR(2),  /* RESERVED                  @D1C*/ 03740000
*     2 SSCMCXPT          PTR(31),  /* ADDRESS OF COMMAND SENSITIVE     03790000
*                                      AREA                      @02C*/ 03840000
*     2 SSCMCMDX          CHAR(20); /* COMMAND SENSITIVE AREA    @D1A*/ 03890000
*@SPACE;                                                                03915000
*/* SSCMCXPT SHOULD BE USED TO LOCATE THE COMMAND SENSITIVE AREA @D1A*/ 03940000
*@SPACE;                                                                03954200
*/********************************************************************/ 03968400
*/*     COMMAND SENSITIVE AREA FOR REPLY COMMAND                     */ 03982600
*/********************************************************************/ 03996800
*@SPACE;                                                                04011000
*DCL 1 SSCMCMDR  BASED(SSCMCXPT),   /* COMMAND SENSITIVE AREA FOR       04025200
*                                      REPLIES                   @D1A*/ 04040000
*    2 SSCMCVRB          FIXED(8),  /* COMMAND VERB (X'85')      @L8A*/ 04083700
*    2 SSCMRES6          CHAR(3),   /* RESERVED                  @L8A*/ 04127400
*    2 SSCMRTCB          PTR(31),   /* TCB OF WTOR ISSUER        @D1A*/ 04171100
*    2 SSCMRASI          FIXED(16), /* ASID OF WTOR ISSUER       @D1A*/ 04214800
*    2 SSCMRTXT          PTR(15),   /* OFFSET TO REPLY TEXT      @D1A*/ 04258500
*    2  *                       ,   /* SYSPLEX REPLY FLAGS       @D1A*/ 04302200
*       3 SSCMRSEC       BIT(1),    /* REPLY TO A SECURITY WTOR (ROUTE  04345900
*                                      CODE OF 9)                @D1A*/ 04390000
*       3 *              BIT(7),    /* RESERVED                  @D1A*/ 04440000
*    2 SSCMRES5          CHAR(3),   /* RESERVED                  @02C*/ 04465000
*    2 SSCMOCID          FIXED(31); /* Originating console id (used for 04490000
*                                      auth checking             @02A*/ 04515000
*@SPACE;                                                                04540000
*/********************************************************************/ 04544500
*/*     The following structure (SSCMOLIB) is pointed to by SSCMOLIP */ 04549000
*/*     if SSCMSYMS = ON.  It contains the length and text of the    */ 04553500
*/*     original command before any symbolic variables were          */ 04558000
*/*     substituted.                                             @LBA*/ 04562500
*/********************************************************************/ 04567000
*DCL 1 SSCMOLIB BASED(SSCMOLIP),/* Original command text         @LBA*/ 04571500
*      3 SSCMOMDL FIXED(15),    /* Length of the command text    @LBA*/ 04576000
*      3 SSCMOMDI CHAR(*);      /* Command image text            @LBA*/ 04580500
*@SPACE;                                                                04585000
* DCL SSCMVRPL BIT(8) CONSTANT('85'X); /* VERB CODE FOR REPLY    @P2C*/ 04590000
