* %GOTO   TEXTPRO;   /*                                          @H1C   00050000
         MACRO                                                          00100000
         IEFTXTFT                                                       00150000
.*/ %TEXTPRO:;       /*                                          @H1C*/ 00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00350000
*/*01* MACRO NAME = IEFTXTFT                                         */ 00400000
*/*                                                                  */ 00450000
*/*01* DESCRIPTIVE NAME = C/I Text Format Mapping                    */ 00466600
*/*                                                                  */ 00483200
*/*02*  ACRONYM = TXTFT                                              */ 00499800
*/*                                                                  */ 00516400
*/*01* PROPRIETARY STATEMENT =                                       */ 00547900
*/***PROPRIETARY_STATEMENT********************************************/ 00579400
*/*                                                                  */ 00610900
*/*                                                                  */ 00642400
*/* LICENSED MATERIAL - PROPERTY OF IBM                              */ 00673900
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00705400
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1983, 1992                      */ 00736900
*/* SEE COPYRIGHT INSTRUCTIONS                                   @L3C*/ 00768400
*/*                                                                  */ 00800000
*/* STATUS = HBB5510                                             @P4C*/ 00850000
*/*                                                                  */ 00900000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00915000
*/*                                                                  */ 00930000
*/*01* FUNCTION = This Macro is used to map the Converter            */ 00945000
*/*               Interpreter (C/I) text string, generated by        */ 00960000
*/*               the MVS Converter.                                 */ 00975000
*/*                                                                  */ 01000000
*/*01* EXTERNAL CLASSIFICATION: PSPI                                 */ 01001600
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01003200
*/*                                                                  */ 01004800
*/*01* NOTES =                                                       */ 01006400
*/*        - Bilingual Mapping Macro (PL/AS and BAL)                 */ 01008000
*/*        - The Macro reflects the format of C/I Text implemented   */ 01020000
*/*          in support of VS/2.  The formats for JOB, PROC/EXEC,    */ 01024000
*/*          DD, JDT-Defined verbs (introduced at SP2.1.0) and       */ 01028000
*/*          the Extended Statement Types (introduced at SP4.1.0),   */ 01032000
*/*          differ except for the first two fields.  The Length     */ 01036000
*/*          and statement type fields are common to all formats.    */ 01040000
*/*          Subsequent references to a particular text string       */ 01044000
*/*          are based upon the setting of the statement type        */ 01048000
*/*          field (STRINDCS). The fields that preceed the first     */ 01052000
*/*          key field are referred to as the C/I Text String        */ 01056000
*/*          Prefix.                                                 */ 01060000
*/*                                                                  */ 01064000
*/*02*   DEPENDENCIES =  None                                        */ 01068000
*/*                                                                  */ 01072000
*/*02*   RESTRICTIONS =  None                                        */ 01076000
*/*                                                                  */ 01080000
*/*                                                                  */ 01084000
*/**** INVOCATION ****************************************************/ 01088000
*/*                                                                  */ 01092000
*/*01* METHOD OF ACCESS =                                            */ 01096000
*/*                                                                  */ 01100000
*/*02*   PL/AS =                                                     */ 01116600
*/*                  DEFAULT IS A BASED STRUCTURE                @L2C*/ 01133200
*/*                  OPTIONALLY:                                     */ 01150000
*/*                  %TXTATTR = 'BASED(X)' OR 'DEFINED(X)'       @L2C*/ 01175000
*/*                  %INCLUDE SYSLIB(IEFTXTFT)                   @H1A*/ 01200000
*/*                                                                  */ 01250000
*/*02*   BAL =                                                       */ 01283300
*/*                  IEFTXTFT                                        */ 01316600
*/*                                                                  */ 01350000
*/*                  A DSECT is generated                        @H1A*/ 01400000
*/*                                                                  */ 02038200
*/********************************************************************/ 02040900
*/*                                                                  */ 02043600
*/*01* DSECT NAME = TEXT                                             */ 02046300
*/*                                                                  */ 02049000
*/*01* COMPONENT = MVS Converter/Interpreter (SC1B9)                 */ 02051700
*/*                                                                  */ 02054400
*/*01* EYE-CATCHER = None                                            */ 02057100
*/*                                                                  */ 02059800
*/*02*  OFFSET = N/A                                                 */ 02062500
*/*                                                                  */ 02065200
*/*02*  LENGTH = N/A                                                 */ 02067900
*/*                                                                  */ 02070600
*/*01* CREATED BY = Converter                                        */ 02073300
*/*                                                                  */ 02076000
*/*01* POINTED TO BY =                                               */ 02077300
*/*          -  Register 1, Word 2 on entry to JES2 Exit 6       @P4A*/ 02078600
*/*          -  Register 1, Word 1 on entry to JES3 Exit IATUX03 @P4A*/ 02079900
*/*                                                                  */ 02081400
*/*01* POINTED TO BY (IBM use only) =                            @P4A*/ 02083200
*/*          - TEXTBUFP field of the COMWA data area             @P4A*/ 02085000
*/*                                                                  */ 02086800
*/*01* DELETED BY = JES                                              */ 02096200
*/*                                                                  */ 02105700
*/*01* SERIALIZATION = None                                          */ 02108400
*/*                                                                  */ 02111100
*/*01* STORAGE ATTRIBUTES =                                          */ 02111600
*/*                                                                  */ 02112100
*/*02*   ALLOCATION METHOD = Buffered in GETMAINed storage           */ 02112600
*/*02*   SUBPOOL           = 0                                       */ 02113100
*/*02*   KEY               = 1                                       */ 02113600
*/*02*   RESIDENCY         = ANY                                     */ 02114100
*/*02*   FREQUENCY         = 1 per JCL Statement                     */ 02114600
*/*                                                                  */ 02115100
*/*01* SIZE = Variable                                               */ 02115600
*/*                                                                  */ 02116100
*/*01* DISTRIBUTION LIBRARY = AMODGEN                                */ 02116600
*/*                                                                  */ 02117100
*/*01* CHANGE ACTIVITY = G16APPK,OZ28955,OZ53693,H1,L1,L2,P1,P2,     */ 02117600
*/*                    P3,L3,P4                                  @P4C*/ 02118100
*/*                                                                  */ 02119200
*/*   ID= Item    release yymmdd PDnn:  full item name               */ 02121900
*/*  ---=-------- ------- ------ ----: -----------------------       */ 02124600
*/*  $H1=EXTJCL   JBB2110 820702 PD2R: SUPPORT EXTENDED JCL      @H1A*/ 02127300
*/*  $L1=SWABOVE  JBB2220 850603 PDU2: SWA ABOVE THE LINE        @L1A*/ 02130000
*/*  $L2=EMVS2    HBB4410 890213 PDM9: ENTERPRISE MVS/II         @L2A*/ 02132700
*/*  $P1=PEO3150  HBB4410 900405 PDE1: ENTERPRISE MVS/II         @P1A*/ 02135400
*/*  $P2=PEO4116  HBB4410 900419 PDN3: ENTERPRISE MVS/II         @P2A*/ 02138100
*/*  $P3=PH31184  HBB4420 900711 PDN3: ENTERPRISE MVS/II         @P3A*/ 02140800
*/*  $01=OY36362  JBB1329 910131 PDBN: DSN=NULLFILE SUPPORT      @01A*/ 02143500
*/*  $L3=PR430    HBB4430 911105 PDN3: Serviceability            @L3A*/ 02146200
*/*  $P4=PIG1422  HBB5510 930715 PDBN: CDPI update               @P4A*/ 02148100
*/*                                                                  */ 02150000
*/**** END OF SPECIFICATIONS *****************************************/ 02200000
*/*  A - Prologue                                                @H1A*/ 02218100
*/*  A - EXTENDED STATEMENT TYPE INDICATOR AND BYTES.            @L2A*/ 02236200
*/*  A - ADDED DEFINTION OF STATEMENT TYPES FOR IF, ELSE AND         */ 02254300
*/*      ENDIF STATEMENTS.                                       @L2A*/ 02272400
*/*  A - ADDED INDICATOR TO JOB TEXT STRING TO REPRESENT THAT        */ 02290500
*/*      THE JCL VERSION NUMBER IS PRESENT IN THE JOB TEXT STRING,   */ 02308600
*/*      THE STATEMENT NUMBER IS IN THE TEXT AND THAT THE JDT KEYS   */ 02326700
*/*      RATHER THAN KEYWORDS ARE PRESENT IN THE TEXT STRINGS.   @L2A*/ 02344800
*/*  A - JDXPROC BIT ON THE STATEMENTS TO MATCH DTXPROC ON DD        */ 02350800
*/*      STATEMENTS - USED TO DESIGNATE OUTPUT STMTS IN PROCS    @P1A*/ 02356800
*/*  A - ETXCOVR bit in the STREINDC flags on the EXEC statement.    */ 02358300
*/*      This bit is used to identify COND key origination (from     */ 02359800
*/*      override or not).                                       @P2A*/ 02360800
*/*  C - Corrected error in prologue (missing PL/AS comment end) @P3A*/ 02361800
*/*  C - Documentation of DTXDUMMY bit                           @01A*/ 02362300
*/*  C - Prologue to conform to SHOWHDR                          @L3A*/ 02366900
*/*  C - Corrected CDPI-related information in prologue          @P4A*/ 02369200
*/*                                                                  */ 02371500
*/* ---------------------------------------------------------------- */ 02376100
*                                                                       02381000
*       %GOTO  TEXTPLS;       /*                                 @H1A   02400000
*                                                                       02450000
TEXT     DSECT                                                          02500000
*                                                                       02550000
*  THE FOLLOWING FIELDS ARE COMMON TO ALL TEXT STRING TYPES.            02600000
*                                                                       02650000
STRLTH   DS    CL2                 LENGTH OF TEXT STRING.               02700000
STRINDCS DS    CL1                 STATEMENT TYPE AND                   02750000
*                                  MISCELLANEOUS INDICATORS             02800000
JOBSTR   EQU   X'01'               JOB STATEMENT TEXT STRING            02850000
EXECSTR  EQU   X'02'               EXEC STATEMENT TEXT STRING           02900000
DDSTR    EQU   X'04'               DD STATEMENT TEXT STRING             02950000
PROCSTR  EQU   X'08'               PROC STATEMENT TEXT STRING           03000000
LASTSTMT EQU   X'10'               LAST STMT FOR THIS STEP.             03050000
JDVBSTR  EQU   X'20'               JDT-DEFINED VERB STRING         @H1A 03100000
JDTJCL   EQU   X'40'               JDT-DEFINED JCL APPEARS IN THIS @H1A 03150000
*                                  STATEMENT                            03200000
STRINDE  EQU   X'80'               INDICATES THE EXTENDED STATEMENT    *03205000
                                   BYTES ARE PRESENT IN THE TEXT       *03210000
                                   PREFIX                          @L2A 03215000
STRINDCE DS    0CL2                EXTENDED STATEMENT TYPE FIELDS  @L2A 03220000
STRINDC1 DS    CL1                 EXTENDED STATEMENT TYPE FIELD 1 @L2A 03225000
IFSTR    EQU   X'80'               IF STATEMENT TEXT STRING        @L2A 03230000
ELSESTR  EQU   X'40'               ELSE STATEMENT TEXT STRING      @L2A 03235000
ENDIFSTR EQU   X'20'               ENDIF STATEMENT TEXT STRING     @L2A 03240000
STRINDC2 DS    CL1                 EXTENDED STATEMENT TYPE FIELD 2 @L2A 03245000
         SPACE 3                                                        03250000
*                                                                       03300000
*  FORMAT FOR JOB TEXT STRING                                           03350000
*******************************************************************     03400000
*              2*        1*        1*        1*        1*        1*     03450000
*     STRLTH    *STRINDCS *STRJINDC *STRJIND2 *STRJLABD *STRJKEY  *     03500000
*              2*        1*        1*        1*        1*        1*     03550000
*******************************************************************     03600000
*                                                                       03650000
         ORG   STRINDCS+1                                         @L2A  03675000
*                                                                       03700000
STRJINDC DS    CL1                 JOB INDICATORS                       03750000
JTXACCTN EQU   X'01'               ACCT NO. REQUIRED.                   03800000
JTXPROGN EQU   X'02'               PROGRAMMER NAME REQUIRED.            03850000
JTXJOBFL EQU   X'04'               JOB HAS BEEN FAILED.                 03900000
JTXSYSCK EQU   X'08'               JOB HAS SYSCHK DD.                   03950000
JTXCPSTF EQU   X'10'               C/R - FLUSH TO RESTART STEPNAME.     04000000
JTXMHEDR EQU   X'20'               MESSAGE HEADER HAS BEEN WRITTEN.     04050000
JTXREGDF EQU   X'40'               REGION VALUE IS A DEFAULT.           04100000
JTXJDJCL EQU   X'80'               JDT-DEFINED JCL APPEARS IN THIS @H1A 04150000
*                                  JOB'S JCL                            04200000
*                                                                       04250000
STRJIND2 DS    CL1                 BYTE 2 OF JOB TEXT INDICATORS.       04300000
JDJCLERR EQU   X'01'               JDT-DEFINED JCL ERROR IN THIS   @H1A 04350000
*                                  JOB'S JCL                            04400000
JBXA     EQU   X'02'               USER SWA ABOVE INDICATOR        @L1A 04450000
JTXJCLV  EQU   X'04'               INDICATES JCL VERSION NUMBER        *04460000
                                   CONTAINED IN JOB TEXT, STATEMENT    *04470000
                                   NUMBER IN TEXT AND JDT DEFINED      *04480000
                                   KEYS IN TEXT                    @L2A 04490000
*                                                                       04500000
STRJLABD DS    CL1                 BYPASS LABEL PROCESSING DEFAULT.     04550000
* ENTIRE BYTE IS USED, AS IEFVDA OR'S BYTE DIRECTLY INTO JFCB.          04600000
JTXLABNL EQU   X'01'               DEFAULT IS NO LABEL.                 04650000
JTXLABLP EQU   X'10'               DEFAULT IS BYPASS LABEL              04700000
*                                  PROCESSING.                          04750000
*  END OF JOB TEXT STRING PREFIX                                        04800000
STRJKEY  DS    0C                  VERB KEY FOR JOB TEXT STRING         04850000
STRJPFXL EQU   STRJKEY-TEXT        LENGTH OF JOB TEXT STRING PREFIX     04900000
         SPACE 3                                                        04950000
*                                                                       05000000
*  FORMAT FOR EXEC/PROC TEXT STRINGS                                    05050000
***************************************************                     05100000
*                  2*         1*       1*        1*                     05150000
*     STRLTH        *STRINDCS *STREINDC *STREKEY  *                     05200000
*                   *         *         *         *                     05250000
***************************************************                     05300000
*                                                                       05350000
*                                                                       05400000
         ORG   STRINDCS+1                                               05450000
*                                                                       05500000
STREINDC DS    CL1                 EXEC INDICATORS.                     05550000
ETXCPFLG EQU   X'01'               CHECKPT/RESTART EXEC STMT.           05600000
ETXSTPCT EQU   X'02'               STEP HAS A STEPCAT DD.               05650000
ETXSTPLB EQU   X'04'               STEP HAS A STEPLIB DD.               05700000
ETXPROC  EQU   X'08'               STATEMENT IS FROM A PROC.            05750000
ETXNODD  EQU   X'10'               STEP HAS NO DD STATEMENTS.           05800000
ETXPRCV  EQU   X'20'               STATEMENT INVOKES A PROCEDURE.       05850000
ETXCOVR  EQU   X'40'               COND key - override processing @P2A  05875000
*  END OF EXEC/PROC TEXT STRING PREFIX                                  05900000
STREKEY  DS    0C                  VERB KEY FOR EXEC/PROC TEXT STRING   05950000
STREPFXL EQU   STREKEY-TEXT        LENGTH OF EXEC/PROC TEXT STRING PFX  06000000
         SPACE 3                                                        06050000
*                                                                       06100000
*  FORMAT FOR DD TEXT STRINGS                                           06150000
***************************************************                     06200000
*                  2*         1*       1*        1*                     06250000
*     STRLTH        *STRINDCS *STRDINDC *STRDKEY  *                     06300000
*                   *         *         *         *                     06350000
***************************************************                     06400000
*                                                                       06450000
*                                                                       06500000
         ORG   STRINDCS+1                                               06550000
*                                                                       06600000
STRDINDC DS    CL1                 DD TEXT STRING INDICATORS.           06650000
*                                                                       06700000
DTXDUMMY EQU   X'01'               DUMMY OR DSN=NULLFILE SPECIFIED @01C 06733300
*                                    ON DD AND NOT OVERRIDDEN      @01A 06766600
DTXDDNM  EQU   X'02'               DDNAME= SPECIFIED ON STATEMENT.      06800000
DTXDSNLT EQU   X'04'               DSNAME SPECIFIED AS A LITERAL.       06850000
DTXDYNAM EQU   X'08'               DYNAM SPECIFIED ON STATEMENT.        06900000
DTXSYSIN EQU   X'10'               TEXT IS FOR A SPOOLED DATA SET.      06950000
DTXSYOUT EQU   X'20'               TEXT IS FOR A SYSOUT DATASET         07000000
DTXSUBSK EQU   X'40'               SUBSYS= SPECIFIED ON STMT   @G29AN2E 07050000
DTXPROC  EQU   X'80'               STATEMENT IS FROM A PROC.   @ZA53693 07100000
*                                                                       07150000
*  END OF DD TEXT STRING PREFIX                                         07200000
STRDKEY  DS    0C                  VERB KEY FOR DD TEXT STRING          07250000
STRDPFXL EQU   STRDKEY-TEXT        LENGTH OF DD TEXT STRING PREFIX      07300000
*                                                                       07350000
*  FORMAT FOR JDT-DEFINED VERB TEXT STRINGS                        @H1A 07400000
***************************************************                     07450000
*                  2*         1*       1*        1*                @H1A 07500000
*     STRLTH        *STRINDCS *STRSINDC *STRSKEY  *                @H1A 07550000
*                   *         *         *         *                     07600000
***************************************************                     07650000
*                                                                       07700000
*                                                                       07750000
         ORG   STRINDCS+1                                               07800000
*                                                                       07850000
STRSINDC DS    CL1                 JDT-DEFINED TEXT STRING FLAGS   @H1A 07900000
JDXPROC  EQU   X'80'               STATEMENT IS FROM A PROC.       @P1A 07925000
*                                                                       07950000
*  END OF JDT-DEFINED TEXT STRING PREFIX                           @H1A 08000000
STRSKEY  DS    0C                  VERB KEY FOR JDT TEXT STRING    @H1A 08050000
STRSPFXL EQU   STRSKEY-TEXT        LENGTH OF JDT-DEFINED VERB TEXT @H1A 08100000
*                                  STRING PREFIX                   @H1A 08150000
*                                                                       08153100
*  FORMAT FOR IF, THEN AND ELSE TEXT STRINGS PREFIX                @L2A 08156200
************************************************************            08159300
*                  2*         1*              2*          1*            08162400
*     STRLTH        *STRINDCS *STRINDCE        *STRIKEY    *            08165500
*                   *         *                *           *            08168600
************************************************************            08171700
*                                                                       08174800
         ORG   STRINDCE+2                                               08177900
*                                                                       08181000
*                                                                       08184100
STRIKEY  DS    0C                  VERB KEY FOR IF, THEN AND ELSE  @L2A 08187200
*  END OF IF, THEN AND ELSE TEXT STRING PREFIX                     @L2A 08190300
STRIPFXL EQU   STRIKEY-TEXT        LENGTH OF IF, THEN AND ELSE     @L2A 08193400
*                                  TEXT STRING PREFIX              @L2A 08196500
         MEND                */                                         08200000
    %TEXTPLS: ;              /*                                  @H1C*/ 08250000
*/*                                                                     08300000
*  THE FOLLOWING FIELDS ARE COMMON TO ALL TEXT STRINGS                  08350000
*                                                                    */ 08400000
*%IF TXTATTR = '' %THEN          /*                              @L2A*/ 08425000
*   %TXTATTR ='BASED(TEXTPTR)';  /*                              @L2A*/ 08450000
*DCL 1 TEXT TXTATTR,             /* FORMAT FOR COMMON AREA       @L2C*/ 08475000
*                                /* USE LENGTH FUNCTION OF THIS      */ 08500000
*                                /* LABEL TO GET THE LENGTH OF       */ 08550000
*                                /* THE COMMON AREA                  */ 08600000
*      2 STRLTH CHAR(2),         /* LENGTH OF TEXT STRING            */ 08650000
*      2 STRINDCS CHAR(1),       /*STATEMENT TYPE AND                   08683300
*                                  MISCELLANEOUS INDICATORS          */ 08716600
*           3 STRINDE  BIT(1),   /*INDICATES THE EXTENDED STATEMENT     08749900
*                                  BYTES ARE PRESENT IN THE TEXT        08783200
*                                  PREFIX                        @L2A*/ 08816500
*           3 JDTJCL  BIT(1),    /*JDT-DEFINED JCL THIS STATEMNT @H1A*/ 08850000
*           3 JDVBSTR BIT(1),    /*JDT-DEFINED VERB STRING       @H1A*/ 08900000
*           3 LASTSTMT BIT(1),   /* LAST STMT FOR THIS STEP          */ 08950000
*           3 PROCSTR BIT(1),    /*PROC STATEMENT TEXT STRING        */ 09000000
*           3 DDSTR   BIT(1),    /*DD STATEMENT TEXT STRING          */ 09050000
*           3 EXECSTR BIT(1),    /*EXEC STATEMENT TEXT STRING        */ 09100000
*           3 JOBSTR   BIT(1),   /*JOB STATEMENT TEXT STRING         */ 09114200
*      2 STRINDCE      CHAR(2), /*EXTENDED STATEMENT TYPE FIELDS @L2A*/ 09128400
*           3 IFSTR    BIT(1),   /*IF STATEMENT TEXT STRING      @L2A*/ 09142600
*           3 ELSESTR  BIT(1),   /*ELSE STATEMENT TEXT STRING    @L2A*/ 09156800
*           3 ENDIFSTR BIT(1),   /*ENDIF STATEMENT TEXT STRING   @L2A*/ 09171000
*           3 *        BIT(13);  /*NOT USED                      @L2A*/ 09185200
*/*                                                                     09200000
*                                                                       09250000
*  FORMAT FOR JOB TEXT STRING                                           09300000
*******************************************************************     09350000
*              2*        1*        1*        1*        1*        1*     09400000
*     STRLTH    *STRINDCS *STRJINDC *STRJIND2 *STRJLABD *STRJKEY  *     09450000
*              2*        1*        1*        1*        1*        1*     09500000
*******************************************************************     09550000
*                                                                       09600000
*                                                                    */ 09650000
*DCL 1 STRJPFX DEFINED(TEXT),    /*FORMAT FOR JOB TEXT STRING    @L2C*/ 09700000
*                                /* USE LENGTH FUNCTION OF THIS      */ 09750000
*                                /* LABEL TO GET THE LENGTH OF       */ 09800000
*                                /* THE JOB PREFIX                   */ 09850000
*      2 *        CHAR(3),       /*COMMON FIELDS                     */ 09900000
*      2 STRJINDC,               /*JOB INDICATORS                    */ 09950000
*           3 JTXJDJCL BIT(1),   /* JDT-DEFINED JCL APPEARS IN THIS     10000000
*                                   JOB'S JCL                    @H1A*/ 10050000
*           3 JTXREGDF BIT(1),   /* REGION VALUE IS A DEFAULT        */ 10100000
*           3 JTXMHEDR BIT(1),   /* MESSAGE HEADER HAS BEEN WRITTEN  */ 10150000
*           3 JTXCPSTF BIT(1),   /* C/R - FLUSH TO RESTART STEPNAME  */ 10200000
*           3 JTXSYSCK BIT(1),   /* JOB HAS SYSCHK DD                */ 10250000
*           3 JTXJOBFL BIT(1),   /* JOB HAS BEEN FAILED              */ 10300000
*           3 JTXPROGN BIT(1),   /* PROGRAMMER NAME REQUIRED         */ 10350000
*           3 JTXACCTN BIT(1),   /* ACCT NUMBER REQUIRED             */ 10400000
*                                                                       10450000
*      2 STRJIND2,               /* BYTE 2 OF JOBTEXT INDICATORS @H1C*/ 10500000
*           3 * BIT(5),          /* UNUSED                       @L2C*/ 10516600
*           3 JTXJCLV BIT(1),    /* INDICATES JCL VERSION NUMBER        10533200
*                                   CONTAINED IN JOB TEXT, STATEMENT    10549800
*                                   NUMBER IN TEXT AND JDT DEFINED      10566400
*                                   KEYS IN TEXT                 @L2A*/ 10583000
*           3 JBXA BIT(1),       /* USER SWA ABOVE               @L1A*/ 10600000
*           3 JDJCLERR BIT(1),   /* JDT JCL ERROR IN THIS JOB    @H1A*/ 10650000
*                                                                       10700000
*      2 STRJLABD,               /* BYPASS LABEL PROCESSING DEFAULT  */ 10750000
*/* ENTIRE BYTE IS USED, AS IEFVDA OR'S BYTE DIRECTLY INTO JFCB      */ 10800000
*           3 JTXLABLP BIT(4),   /* DEFAULT IS BYPASS LABEL             10850000
*                                   PROCESSING                 Y02668*/ 10900000
*           3 JTXLABNL BIT(4),   /* DEFAULT IS NO LABEL        Y02668*/ 10950000
*/*  END OF JOB TEXT STRING PREFIX                                   */ 11000000
*      2 STRJKEY CHAR(1);        /*VERB KEY FOR JOB TEXT STRING  @L2C*/ 11050000
*                                                                       11150000
*                                                                       11200000
*/*  FORMAT FOR EXEC/PROC TEXT STRINGS                                  11250000
***************************************************                     11300000
*                  2*         1*       1*        1*                     11350000
*     STRLTH        *STRINDCS *STREINDC *STREKEY  *                     11400000
*                   *         *         *         *                     11450000
***************************************************                     11500000
*                                                                       11550000
*                                                                    */ 11600000
*DCL 1 STREPFX DEFINED(TEXT),    /*FORMAT FOR EXEC TEXT STRING   @L2C*/ 11650000
*                                /* USE LENGTH FUNCTION OF THIS      */ 11700000
*                                /* LABEL TO GET THE LENGTH OF       */ 11750000
*                                /* THE EXEC PREFIX                  */ 11800000
*      2 *        CHAR(3),       /*COMMON FIELDS                     */ 11850000
*      2 STREINDC,               /* EXEC INDICATORS                  */ 11900000
*           3 *        BIT(1),   /*           UNUSED                 */ 11925000
*           3 ETXCOVR  BIT(1),   /* COND Key from override process   */ 11950000
*                                /*                              @P2A*/ 11975000
*           3 ETXPRCV  BIT(1),   /* STATMENT INVOKES A PROCEDURE     */ 12000000
*           3 ETXNODD  BIT(1),   /* STEP HAS NO DD STATEMENTS        */ 12050000
*           3 ETXPROC  BIT(1),   /* STATEMENT IS FROM A PROC         */ 12100000
*           3 ETXSTPLB BIT(1),   /* STEP HAS A STEPLIB               */ 12150000
*           3 ETXSTPCT BIT(1),   /* STEP HAS A STEPCAT               */ 12200000
*           3 ETXCPFLG BIT(1),   /* CHECKPT/RESTART EXEC STMT        */ 12250000
*/*  END OF EXEC/PROC TEXT STRING PREFIX                             */ 12300000
*      2 STREKEY CHAR(1);        /*VERB KEY EXEC TEXT STRING     @L2C*/ 12350000
*                                                                       12450000
*                                                                       12500000
*/*FORMAT FOR DD TEXT STRINGS                                           12550000
***************************************************                     12600000
*                  2*         1*       1*        1*                     12650000
*     STRLTH        *STRINDCS *STRDINDC *STRDKEY  *                     12700000
*                   *         *         *         *                     12750000
***************************************************                     12800000
*                                                                       12850000
*                                                                    */ 12900000
*DCL 1 STRDPFX DEFINED(TEXT),    /*FORMAT FOR DD TEXT STRING     @L2C*/ 12950000
*                                /* USE LENGTH FUNCTION OF THIS      */ 13000000
*                                /* LABEL TO GET THE LENGTH OF       */ 13050000
*                                /* THE DD PREFIX                    */ 13100000
*      2 * CHAR(3),              /*COMMON FIELDS                     */ 13150000
*      2 STRDINDC,               /* DD TEXT STRING INDICATORS        */ 13200000
*           3 DTXPROC  BIT(1),   /* STATEMENT IS FROM A PROC @ZA53693*/ 13250000
*           3 DTXSUBSK BIT(1),   /* SUBSYS= SPECIFIED ON STMT@G29AN2E*/ 13300000
*           3 DTXSYOUT BIT(1),   /* TEXT IS FOR A SYSOUT DATA SET    */ 13350000
*           3 DTXSYSIN BIT(1),   /* TEXT IS FOR A SPOOLED DATA SET   */ 13400000
*           3 DTXDYNAM BIT(1),   /* DYNAM SPECIFIED ON STATEMENT     */ 13450000
*           3 DTXSNLTM BIT(1),   /* DSNAME SPECIFIED AS A LITERAL    */ 13500000
*           3 DTXDDNM  BIT(1),   /* DDNAME= SPECIFIED ON STATEMENT   */ 13550000
*           3 DTXDUMMY BIT(1),   /* DUMMY OR DSN=NULLFILE ON DD         13583300
*                                     AND NOT OVERRIDDEN         @01C*/ 13616600
*                                                                       13650000
*/*  END OF DD TEXT STRING PREFIX                                    */ 13700000
*      2 STRDKEY CHAR(1);        /*VERB KEY FOR DD TEXT STRING   @L2C*/ 13750000
*                                                                       13850000
*                                                                       13900000
*/*FORMAT FOR JDT-DEFINED TEXT STRING PREFIX                            13950000
***************************************************                     14000000
*                  2*         1*       1*        1*                     14050000
*     STRLTH        *STRINDCS *STRSINDC *STRSKEY  *                     14100000
*                   *         *         *         *                     14150000
***************************************************                     14200000
*                                                                       14250000
*                                                                    */ 14300000
*DCL 1 STRSPFX DEFINED(TEXT),    /*FORMAT FOR JDT-DEFINED TEXT          14350000
*                                  STRING PREFIX                 @L2C*/ 14400000
*                                /* USE LENGTH FUNCTION OF THIS      */ 14450000
*                                /* LABEL TO GET THE LENGTH OF       */ 14500000
*                                /* THE JDT-DEFINED VERB PREFIX      */ 14550000
*      2 * CHAR(3),              /*COMMON FIELDS                 @H1A*/ 14600000
*      2 STRSINDC,               /* JDT-DEFINED VERB TEXT STRING        14650000
*                                   INDICATORS                   @H1A*/ 14700000
*           3 JDXPROC  BIT(1),   /* STATEMENT IS FROM A PROC     @P1A*/ 14733300
*           3 *        BIT(7),   /* RESERVED                     @P1C*/ 14766600
*/*  END OF JDT-DEFINED VERB TEXT STRING PREFIX                  @H1A*/ 14800000
*      2 STRSKEY CHAR(1);        /*VERB KEY FOR JDT-DEFINED TEXT        14850000
*                                  STRING                        @L2C*/ 14900000
*/*FORMAT FOR IF, ELSE AND ENDIF TEXT STRING PREFIX                     14950000
************************************************************            15000000
*                  2*         1*              2*          1*            15050000
*     STRLTH        *STRINDCS *STRINDCE        *STRIKEY    *            15100000
*                   *         *                *           *            15150000
************************************************************            15200000
*                                                                       15250000
*                                                                @L2A*/ 15300000
*DCL 1 STRIPFX DEFINED(TEXT),    /*FORMAT FOR IF, THEN, ELSE TEXT       15350000
*                                  STRING PREFIX                 @L2A*/ 15400000
*      2 * CHAR(5),              /*COMMON FIELDS                 @L2A*/ 15450000
*/*  END OF IF, ELSE AND ENDIF TEXT STRING PREFIX                @L2A*/ 15500000
*      2 STRIKEY CHAR(1);        /*VERB KEY FOR IF, THEN AND ELSE TEXT  15550000
*                                  STRINGS                       @L2A*/ 15600000
