*                                                                       00011100
*        %GOTO TCTL1;     /*                                            00022200
         MACRO                                                          00033300
         IEFTCT    &DSECT=YES    */                                     00044400
*%TCTL1 : ;                                                             00055500
*                                                                       00066600
*/**** START OF SPECIFICATIONS ***************************************/ 00077700
*/*                                                                  */ 00088800
*/*    MACRO NAME = IEFTCT                                       @L9C*/ 00095000
*/*                                                                  */ 00101200
*/*     ACRONYM = TCT                                                */ 00102400
*/*                                                                  */ 00103600
*/*    DESCRIPTIVE NAME = SMF TIMING CONTROL TABLE                   */ 00104200
*/*                                                                  */ 00104800
*/*01* PROPRIETARY STATEMENT=                                        */ 00106900
*/***PROPRIETARY_STATEMENT********************************************/ 00109000
*/*                                                                  */ 00111100
*/*                                                                  */ 00113200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00114600
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00116000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1984, 2000                      */ 00117400
*/*                                                                  */ 00118800
*/* STATUS= HBB7703                                                  */ 00119500
*/*                                                                  */ 00120200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00120900
*/*                                                                  */ 00121600
*/*    DESCRIPTION =                                                 */ 00122800
*/*                                                                  */ 00124000
*/*      THE IEFTCT IS THE SMF TIMING CONTROL TABLE MAPPING MACRO.   */ 00125200
*/*      THIS MAPPING MACRO IS COMPOSED OF THREE CONTROL BLOCKS.     */ 00126400
*/*      THE DATA IN THESE CONTROL BLOCKS IS RELATED, HOWEVER,       */ 00127600
*/*      THE CONTROL BLOCKS ARE NOT CONTIGUOUS TO EACH OTHER IN      */ 00128800
*/*      STORAGE.  THE THREE CONTROL BLOCKS ARE:                     */ 00130000
*/*                                                                  */ 00131200
*/*      1. THE TCT WHICH CONSISTS OF:                               */ 00132400
*/*            A. THE TCT COMMON SECTION (SMFTCT) WHICH CONTAINS     */ 00133600
*/*               INFORMATION ABOUT THE JOB AND STEP.  IT ALSO       */ 00134800
*/*               CONTAINS POINTERS TO THE TCT STORAGE TABLE,        */ 00136000
*/*               TCTTIOT AND ETCTIOT.                               */ 00137200
*/*            B. THE TCT STORAGE TABLE (TCTCORE) WHICH IS USED TO   */ 00138400
*/*               DESCRIBE THE STORAGE OBTAINED BY A TASK.       @PVC*/ 00139600
*/*                                                                  */ 00139700
*/*            c. The TCT OpenMVS PROCESS TABLE (TCTOMVS) which  @P2C*/ 00139800
*/*               is used to collect the syscall information for @LUA*/ 00139900
*/*               an address space that is using OpenMVS         @P2C*/ 00140000
*/*               services during the life of the OpenMVS        @P2C*/ 00140100
*/*               process.                                       @LUA*/ 00140200
*/*                                                                  */ 00140600
*/*            d. The TCT ARM Table (TCTARM) which contains      @L1A*/ 00140800
*/*               information about an element that is           @L1A*/ 00141000
*/*               registered to ARM.                             @L1A*/ 00141200
*/*                                                                  */ 00141400
*/*         THE TCT COMMON SECTION AND TCT STORAGE TABLE ARE ONE     */ 00141600
*/*         STRUCTURE AND ARE CONTIGUOUS IN STORAGE.                 */ 00142000
*/*                                                                  */ 00142200
*/*         The TCTOMVS Table is not contiguous to the TCT in    @LUA*/ 00142400
*/*         storage and is allocated in 31-bit Storage.          @LUA*/ 00142800
*/*                                                                  */ 00142900
*/*         The TCTARM Table is contiguous with the TCTOMVS      @L1A*/ 00143000
*/*         Table in storage.  Because of this, the size of the  @P4C*/ 00143100
*/*         TCTOMVS Table must be a multiple of 8 to eliminate   @P4A*/ 00143200
*/*         FREEMAIN errors related to doubleword boundaries.    @P4A*/ 00143300
*/*                                                                  */ 00143800
*/*      2. THE TCT I/O MEASUREMENT TABLE (TCTTIOT) WHICH        @P1C*/ 00144400
*/*         CONSISTS OF THE TCT I/O LOOK-UP TABLE AND TCT I/O    @P1C*/ 00145600
*/*         COUNTER TABLE. THE I/O MEASUREMENTS ARE COLLECTED IN @P1C*/ 00146800
*/*         THE TCTTIOT.  THE TCTTIOT IS NOT CONTIGUOUS TO THE   @P1C*/ 00148000
*/*         TCT.  IT IS POINTED TO BY THE TCTIOTBL FIELD IN THE  @P1C*/ 00149200
*/*         TCT COMMON SECTION.                                  @P1C*/ 00150400
*/*                                                                  */ 00151600
*/*      3. THE EXTENDED TCT I/O TABLE (ETCTIOT) WHICH IS A CHAIN OF */ 00152800
*/*         4K BLOCKS.  EACH BLOCK CONSISTS OF A HEADER AND AN       */ 00154000
*/*         ARRAY OF ENTRIES WHICH REPRESENT A DD DEVICE ENTRY       */ 00155200
*/*         IN THE TCTIOT.  THE ETCTIOT IS NOT CONTIGOUS TO THE      */ 00156400
*/*         TCT OR THE TCTTIOT.  THE FIRST ETCTIOT ENTRY IS POINTED  */ 00157600
*/*         TO BY THE TCTFETIO FIELD IN THE TCT COMMON SECTION.      */ 00158800
*/*         THERE ARE ADDITIONAL FIELDS IN THE TCT COMMON SECTION    */ 00160000
*/*         WHICH DESCRIBE THE ETCTIOT CHAIN.                        */ 00161200
*/*                                                                  */ 00162400
*/*      A FULL DESCRIPTION OF EACH CONTROL BLOCK CAN BE FOUND       */ 00163600
*/*      PRIOR TO EACH INDIVIDUAL CONTROL BLOCK MAPPING.             */ 00164800
*/*                                                                  */ 00166000
*/*    FUNCTION = This mapping macro is composed of three            */ 00166100
*/*               control blocks (TCT, TCT I/O Measurement table,    */ 00166200
*/*               and Extended TCT I/O table).  The TCT consists     */ 00166300
*/*               of a common section (SMFTCT), storage table        */ 00166400
*/*               (TCTCORE), OpenMVS Process table (TCTOMVS),        */ 00166500
*/*               and ARM table (TCTARM).                        @L1A*/ 00166600
*/*               SMFTCT and TCTCORE are one structure and are       */ 00166700
*/*               contiguous in storage.  TCTOMVS is not contiguous  */ 00166800
*/*               with SMFTCT or TCTCORE.  However, the TCTOMVS  @L1C*/ 00166900
*/*               and TCTARM are contiguous.  The TCT I/O        @L1A*/ 00167000
*/*               Measurement table (TCTTIOT) and Extended TCT I/O   */ 00167100
*/*               table (ETCTIOT) are seperate structures mapped     */ 00167200
*/*               within the IEFTCT mapping macro and pointed to     */ 00167300
*/*               from fields within the TCT.  However, they are     */ 00167400
*/*               NOT contiguous in storage to the TCT or each       */ 00167500
*/*               other.                                             */ 00167600
*/*                                                                  */ 00167700
*/*    EXTERNAL CLASSIFICATION:                                      */ 00167800
*/*    DMTI: BASE                                                    */ 00167900
*/*    PSPI: FIELDS                                                  */ 00168000
*/*          TCTJMR                                                  */ 00168100
*/*    END OF EXTERNAL CLASSIFICATION:                               */ 00168200
*/*                                                                  */ 00168300
*/*    NOTES =                                                       */ 00168400
*/*                                                                  */ 00168500
*/*        Bilingual Mapping Macro (PL/AS and BAL)                   */ 00168600
*/*                                                                  */ 00168700
*/*      DEPENDENCIES =                                              */ 00168800
*/*                                                                  */ 00168900
*/*        Always check the CICS macro DFHTCTZE before defining  @P5A*/ 00169000
*/*        field names to the TCT (DFHTCTZE has 'TCT' prefixes). @P5A*/ 00169100
*/*                                                                  */ 00169200
*/*        PL/AS Version =                                           */ 00169300
*/*         %INCLUDE SYSLIB(IKJTCB) TO DEFINE TCBTCT                 */ 00169400
*/*                                                                  */ 00169500
*/*        BAL Version =                                             */ 00169600
*/*         DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.          */ 00169700
*/*         USING ON SMFTCT GIVES ADDRESSABILITY FOR ALL SYMBOLS.    */ 00169800
*/*                                                                  */ 00169900
*/*      RESTRICTIONS =                                              */ 00170000
*/*                                                                  */ 00170100
*/*        PL/AS Version = None                                      */ 00170200
*/*                                                                  */ 00170300
*/*        BAL Version = None                                        */ 00170400
*/*                                                                  */ 00170500
*/**** INVOCATION ****************************************************/ 00170600
*/*                                                                  */ 00170700
*/*    METHOD OF ACCESS =                                            */ 00170800
*/*                                                                  */ 00170900
*/*      PL/AS Invocation =                                          */ 00171000
*/*                                                                  */ 00171100
*/*  %INCLUDE SYSLIB(IEFTCT)                                         */ 00171200
*/*                                                                  */ 00171300
*/*    PARAMETER DESCRIPTION =  None                                 */ 00171400
*/*                                                                  */ 00171500
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00171600
*/*                                                                  */ 00171700
*/*------------------------------------------------------------------*/ 00171800
*/*                                                                  */ 00171900
*/*      BAL Invocation =                                            */ 00172000
*/*                                                                  */ 00172100
*/*      name            name: symbol. Begin name in column 1.       */ 00172200
*/*  b                   one or more blanks (up to nine)             */ 00172300
*/*  IEFTCT              should start in column 10                   */ 00172400
*/*  b                   one or more blanks                          */ 00172500
*/*                                                                  */ 00172600
*/*    PARAMETER DESCRIPTION =  None                                 */ 00172700
*/*                                                                  */ 00172800
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00172900
*/*                                                                  */ 00173000
*/********************************************************************/ 00173100
*/*                                                                  */ 00173200
*/*    DSECT NAME = SMFTCT                                           */ 00173300
*/*                                                                  */ 00173400
*/*    COMPONENT = System Management Facilities (SC100)              */ 00173500
*/*                                                                  */ 00173600
*/*    EYE-CATCHER = "TCT     "                                      */ 00173700
*/*     OFFSET = 208 ('D0' in hex)                                   */ 00173800
*/*     LENGTH = 8 bytes                                             */ 00173900
*/*                                                                  */ 00174000
*/*    CREATED BY = IEFSMFIE                                         */ 00174100
*/*                                                                  */ 00174200
*/*    POINTED TO BY = TCBTCT                                        */ 00174300
*/*                                                                  */ 00174400
*/*    DELETED BY = IEFTB721                                         */ 00174500
*/*                                                                  */ 00174600
*/*    SERIALIZATION = Compare and Swap on some fields.              */ 00174700
*/*                                                                  */ 00174800
*/*    STORAGE ATTRIBUTES =                                          */ 00174900
*/*                                                                  */ 00175000
*/*      ALLOCATION METHOD = GETMAIN                                 */ 00175100
*/*      SUBPOOL           = 255                                     */ 00175200
*/*      KEY               = 0                                       */ 00175300
*/*      RESIDENCY         = Below                                   */ 00175400
*/*      SIZE              = 652 bytes ('284' in hex)            @LAC*/ 00175500
*/*                          - 600 Common Section                @LAC*/ 00175600
*/*                          -  52 Storage Table                 @L1A*/ 00175700
*/*      FREQUENCY         = 1 per address space                     */ 00175800
*/*                                                                  */ 00175900
*/*    DISTRIBUTION LIBRARY = AMODGEN                                */ 00176000
*/*                                                                  */ 00176100
*/**** END OF SPECIFICATIONS *****************************************/ 00176200
*/*                                                                  */ 00176300
*/* CHANGE ACTIVITY = ZA52714, ZA67311, TFA, @DP                     */ 00176400
*/*                                                                  */ 00176500
*/*   $MAC(IEFTCT),COMP(SC100)                                       */ 00176600
*/*                                                                  */ 00176700
*/* C - TCTTIOT DCL'S FOR VALUES OVER X'7FFF'                @ZA52714*/ 00176800
*/* C - CORRECT TCTEHWM MISSPELLING                          @ZA67311*/ 00176900
*/* C - CHANGED TCTRSV06 TO TCTACTRT INDICATOR               @ZA90520*/ 00177000
*/* C - RESHIP TO SUP OZ90520 PE PTFS                        @ZA91999*/ 00177100
*/* C - CHANGED TCTRSV07 TO TCTDCOPN INDICATOR               @ZA93106*/ 00177200
*/* A - Add Pointers to T30AREAs for EXCP and Process Data       @LUA*/ 00177300
*/* A - Add TCTOMVS Table for saving O/MVS Process Data          @LUA*/ 00177400
*/* A - Add common declare for T30AREA to PL/S mapping           @LUA*/ 00177500
*/* C - Change description of TCTOMVS fields                     @D1A*/ 00177600
*/* A - Add SMF Interval Start Time field (TCTISS)               @DVA*/ 00177700
*/* A - Change description of O/MVS to OpenMVS                   @P2A*/ 00177800
*/* C - Make prolog SHOWHDR compliant                            @P3A*/ 00177900
*/* A - Add New APPC/MVS Resource section                        @01A*/ 00178000
*/* A - Add TCTADMFW ,TCTADMFR in support of ADMF                @02A*/ 00178100
*/* C - Change the OpenMVS Process Data Table to include a       @03A*/ 00178200
*/*     minor structure to isolate the data section from the     @03A*/ 00178300
*/*     header section.                                          @03A*/ 00178400
*/* A - Add pointer to TCTARM table                              @L1A*/ 00178500
*/* A - Add pointers to T30AREA for ARM HOLD, STEP, and JOB      @L1A*/ 00178600
*/* A - Add TCTARM table for holding ARM element information     @L1A*/ 00178700
*/* A - Add 'Sockets' fields to TCTOMVS in support of Sockets    @L2A*/ 00178800
*/* A - Add reserved field to TCTOMVS to ensure size of table is @P4A*/ 00178900
*/*     a multiple of 8                                          @P4A*/ 00179000
*/* A - Add 'Enclave' fields to SMFTCT in support of Enclaves    @L3A*/ 00179100
*/* A - Define Pointers to Usage Control Areas (ACA, TCA, FCA)   @04A*/ 00179200
*/* A - Define Pointer to Usage Timer Element                    @04A*/ 00179300
*/* A - Define Pointers to Usage Type 30 Record Areas            @05A*/ 00179400
*/* A - Add message queues fields in support of OpenMVS XPG4     @L8A*/ 00179500
*/* A - Add sync() count fields in support of OpenMVS XPG4       @L9A*/ 00179600
*/* A - Define Enclaves (cumulative) storage areas               @06A*/ 00179700
*/* C - Changed TCTRV1 to 1 Byte reserved.  Created a flag byte. @07A*/ 00179800
*/* C - Define pointer to consolidated FCA (reuse TCTUFCL).      @08A*/ 00179900
*/* A - Bases for new accounting data from SRM                   @D3A*/ 00180000
*/* C - Rename TCTETRC to TCTETC (to avoid multiple define).     @P5A*/ 00180100
*/* C - Define pointer to consolidated TCA (reuse TCTUTCL).      @09A*/ 00180300
*/* A - Add pointers to T30AREA for Remote System Data HOLD,     @L1A*/ 00180400
*/*     STEP, and JOB                                            @LAA*/ 00180500
*/* C - Define new indicator bit (TCTDUMMY) to signify when TCTIOTBL */ 00180600
*/*     points at a dummy TCTIOT.  This flag is set by IEFIB660 and  */ 00180700
*/*     checked by IEFDB4F9.                                     @0AA*/ 00180800
*/* A - Add TCTXBLKS to contain a blocksize greater than 32K.    @LDA*/ 00180900
*/* A - Add fields to anchor storage for sysevent parameter          */ 00181000
*/*     lists IRARQSRV.RQSV and IRAE39P.E39P                 @WLMPGMC*/ 00181100
*/* C - Added block comment to ensure IEFAB428 and IEFAB4FC will     */ 00181400
*/*     be appropriately updated whenever TCTDDENT is changed.   @P6A*/ 00181500
*/*                                                                  */ 00181600
*/* $PV=PAJ0111 ,JBB2125,830627,PDFS: INCREASE THE SIZE TCTRSZ   @PVA*/ 00181700
*/* $H2=ADVPROC2,JBB2133,830627,PDFS: AXP SUPPORT                @H2A*/ 00181900
*/* $H4=VF      ,JBB2214,840320,PDFS: VECTORS SUPPORT            @H4A*/ 00182100
*/* $D6=DCR2    ,JBB2214,840501,PDFS: ADD VECTOR AFFINITY TIME   @D6A*/ 00182300
*/* $L4=QUALITY ,JBB2214,840510,PDFS: QUALITY                    @L4A*/ 00182800
*/* $D9=DCR93   ,JBB2220,850221,PDFS: I/O MEASUREMENT SUPPORT    @D9A*/ 00184000
*/* $Q8=PA20442 ,JBB2220,851014,PDFC: CLEAR ETCTIOT FIELDS       @Q8A*/ 00185200
*/* $LB=HIPER   ,JBB3311,880418,PDFS: HIPERSPACE SUPPORT         @LBA*/ 00186400
*/* $TF=OY26842 ,HBB4410,890808,PDLO: DD LIMIT SUPPORT           @TFA*/ 00187600
*/* $P1=PEO4167 ,HBB4410,900507,PDBR: COMMENT ERRORS             @P1A*/ 00188800
*/* $0C=OY34157 ,HBB4410,900726,PDBR: TCTDCBTD FIELD ERROR       @0CA*/ 00190000
*/* $LO=APPC1   ,HBB4420,901204,PDBR: APPC TRANS ACCTING SUPPORT @LOA*/ 00191200
*/* $TE=OY27075 ,HBB4420,890310,PDLO: INTEGRATED CRYPTO SERVICE COUNT*/ 00192400
*/*                                   FIELD ADDED                @TEA*/ 00193600
*/* $DP=DCR0163 ,HBB4420,901114,PDBR: APPC Trans Re-write        @DPA*/ 00194800
*/* $0K=OY24857 ,HBB4420,910110,PDLO: BAD TIMER VALUE            @0KA*/ 00200000
*/* $LU=POSIX   ,HBB4430,920115,PDLO: O/MVS Process Accounting   @LUA*/ 00200300
*/* $D1=DKB0127 ,HBB4430,920624,PDBR: O/MVS Field Descriptions   @D1A*/ 00200400
*/* $D2=DKB0107 ,HBB4430,920624,PDBR: DFP Dataset I/O Stats      @DVA*/ 00200500
*/* $P2=PKB4322 ,HBB4430,921022,PDMF: OpenMVS Field Descriptions @P2A*/ 00200700
*/* $P3=PIG2206 ,HBB5510,930720,PDDH: CDPI: SHOWHDR Compliance   @P3A*/ 00200900
*/* $01=OY63634 ,HBB4420,930510,PDDH: APPC Cumulative Data       @01A*/ 00201000
*/* $02=OY65142 ,HBB4430,930614,PDSL: ADMF support               @02A*/ 00201100
*/* $03=OW01700 ,HBB4430,940201,PDDH: ABENDS822: OpenMVS Process @03A*/ 00201300
*/*                                   Data not freed             @03A*/ 00201400
*/* $L1=ARM     ,HBB5520,931109,PDDH: SMF-ARM Support            @L1A*/ 00201500
*/* $L2=SMFOE   ,HBB5510,931129,PDDH: SMF Sockets Support        @L2A*/ 00201600
*/* $P4=PN70239 ,HBB5520,940222,PDDH: TCTARM FREEMAIN Error      @P4A*/ 00201700
*/* $L3=ENCLV   ,HBB5520,940414,PDDH: SMF-Enclave Support        @L3A*/ 00201800
*/* $04=OW02855 ,JBB3313,931115,PDBR: Usage Data Collection      @04A*/ 00201900
*/* $05=OW02855 ,HBB5510,940131,PDBR: Usage Address Sapce Record @05A*/ 00202000
*/* $L8=OPEN3   ,JBB5522,940915,PDDH: OpenMVS XPG4 Support       @L8A*/ 00202100
*/* $L9=OPEN3   ,JBB5522,950216,PDDH: OpenMVS XPG4 Support       @L9A*/ 00202200
*/* $06=OW15692 ,HBB5520,950918,PDDH: Enclaves time not included @06A*/ 00202300
*/*                                   in IEF374I and IEF376I     @06A*/ 00202400
*/* $07=OW10686 ,JBB3313,951115,PDNN: Add TCTTCT2 indicator      @07A*/ 00202500
*/* $08=OW16176 ,HBB5510,951031,PDDH: Performance/Storage problems   */ 00202600
*/*                                   w/TASK FUNCTION registers  @08A*/ 00202700
*/* $D3=DQC0023 ,HBB6603,960613,PDBB: John Arwe                      */ 00202800
*/*                                   Dependent enclaves             */ 00202900
*/* $P5=PQC1668 ,HBB6603,960801,PDDH: TCTETRC found DFHTCTZE     @P5A*/ 00203000
*/* $09=OW30153 ,HBB5510,980131,PDDH: Performance/Storage problems   */ 00203100
*/*                                   w/TASK ALL registers       @09A*/ 00203200
*/* $LA=WLMPMES ,JBB6609,980901,PDCG: Stephen McGrath            @LAA*/ 00203300
*/*                                   MultiSystem Enclaves           */ 00203400
*/* $0A=OW40704  HBB6603 990830 PDNN: Make IEFDB4F9 processing       */ 00203500
*/*                                   aware of Dummy TCTIOTs.    @0AA*/ 00203600
*/* $LD=GT32K   ,HBB7703,990831 PDFD: >32K BLOCKSIZE SUPPORT     @LDA*/ 00203700
*/* $WLMPGMC    ,HBB7703,991202 PDBB: John Arwe                      */ 00203800
*/*                                   Add TctRqsvP, E39PP            */ 00203900
*/* $P6=PXD1129 ,HBB7703,000115 PDNN: Account for expansion of       */ 00204000
*/*                                   the TCTIOT DD entry        @P6A*/ 00204100
*/*                                                                  */ 00204300
*/********************************************************************/ 00204400
*%GOTO TCTL2;  /*                                                       00204500
         SPACE 2                                                        00204600
*********************************************************************** 00204700
*********************************************************************** 00204800
*                                                                     * 00204900
*                                                                     * 00205000
*                                                                     * 00205100
*                             TCT                                     * 00205200
*                                                                     * 00205400
*      THE TCT CONSISTS OF THE TCT COMMON SECTION (SMFTCT) AND TCT    * 00206000
*      STORAGE TABLE (TCTCORE).  IT IS CREATED BY IEFSMFIE IN SUBPOOL * 00206600
*      255/KEY 0 AND RESIDES BELOW THE 16M LINE.                      * 00207200
*      THE TCT OpenMVS PROCESS DATA TABLE IS ALSO A PART OF THE   @P2C* 00207300
*      TCT - IT IS ALLOCATED BY IEFSMFIE IN SUBPOOL 255, KEY 0    @LUA* 00207400
*      AND RESIDES ABOVE THE 16M LINE.                                * 00207500
*      THE TCT ARM Data Table is also a part of the TCT.          @L1A* 00207700
*      It is allocated by IEFSMFIE in subpool 255, key 0          @L1A* 00207900
*      and resides above the 16M line.                            @L1A* 00208100
*                                                                     * 00208300
*      THE SIZE OF THE TCT IS 652 BYTES.  THE COMMON SECTION IS   @LAC* 00208600
*      600 BYTES AND THE TCT STORAGE TABLE IS 52 BYTES.           @LAC* 00208900
*      ONE TCT IS CREATED PER ADDRESS SPACE.                      @LUC* 00209400
*                                                                     * 00210200
*      THE TCT COMMON SECTION IS POINTED TO BY TCBTCT, OFFSET 164     * 00210800
*      DECIMAL, OF THE TASK CONTROL BLOCK (TCB).  THE TCT STORAGE     * 00211400
*      TABLE IS POINTED TO BY TCTCRTBL, OFFSET 8 DECIMAL, OF THE      * 00212000
*      TCT COMMON SECTION.                                            * 00212600
*                                                                 @D9A* 00213200
*********************************************************************** 00213800
         IEZBITS , -          SYMBOLIC BIT DEFINITIONS                  00214400
         AIF   ('&DSECT' EQ 'NO').NODSCT                                00215000
SMFTCT   DSECT , -            START OF TCT                              00215600
         AGO   .CONT                                                    00216200
.NODSCT  ANOP                                                           00216800
         DS    0D                                                       00217400
SMFTCT   EQU   * -            START OF TCT                              00218000
.CONT    ANOP                                                           00218600
         SPACE                                                          00219200
TCTQA    DS    CL3 -          QUEUE ADDRESS OF TCT                      00219800
TCTEXP   DS    0B -           JOB/STEP TIME INDICATOR MASK              00220400
TCTSW    DS    B -            TCT SWITCHES                              00221000
TCTJSTI  EQU   BIT0 -         TQE JOB/STEP TIME INDICATOR.              00221600
*                             IF 0, TQE CONTAINS STEP TIME.             00222200
*                             IF 1, TQE CONTAINS JOB TIME.              00222800
TCTIEX   EQU   BIT1 -         ERROR IN TCT I/O TABLE I/O COUNTS         00223400
*                             (OS/VS2)                           MDC017 00224000
TCTISK30 EQU   BIT2,,C'X' -   TYPE 30 INTERVAL RECORD SKIPPED  @G743PJW 00224600
TCTISK32 EQU   BIT3,,C'X' -   TYPE 32 INTERVAL RECORD SKIPPED  @G743PJW 00225200
TCTIABD  EQU   BIT4,,C'X' -   PREVIOUS INTERVAL ABENDED        @G743PJW 00225800
TCTSTPRN EQU   BIT5,,C'X' -   STEP RAN INDICATOR               @ZMC1603 00226400
TCTACTRT EQU   BIT6,,C'X' -   IEFACTRT IN CONTROL INDICATOR    @ZA90520 00227000
TCTDCOPN EQU   BIT7,,C'X' -   DMPCHCK RTN IN CONTROL INDICATOR @ZA93106 00227600
TCTTCB   DS    A -            ADDRESS OF THE INITIATOR TCB              00228200
TCTCRTBL DS    A -            ADDRESS OF THE TCT STORAGE TABLE          00228800
TCTIOTBL DS    A -            ADDRESS OF THE TCT I/O TABLE.  TCT I/O    00229400
*                             TABLE IS NOT NECESSARILY CONTIGUOUS WITH  00230000
*                             THE TCT.                                  00230600
TCTPOOL  DS    0F -           SUBPOOL/LENGTH FOR TCT PROPER             00231200
         DS    H -            SUBPOOL IN WHICH THE TCT RESIDES          00231800
TCTSZE   DS    H -            SIZE IN BYTES OF THE TCT AND THE TCT      00232400
*                             STORAGE TABLE                             00233000
TCTUTL   DS    A -            ADDRESS OF USER TIME LIMIT ROUTINE        00233600
TCTUDATA DS    A -            ADDRESS OF A ONE-WORD PARAMETER LIST      00234200
*                             WHICH POINTS TO THE JOB MANAGEMENT        00234800
*                             RECORD (JMR)                              00235400
TCTJMR   DS    A -            ADDRESS OF THE JOB MANAGEMENT RECORD      00236000
TCTCPUS  DS    0F             ACCUM SESSION CPU SERVICE(OS/VS2)@G50FPRL 00236600
TCTRSV08 DS    XL4 -          *** TCTUSO FIELD RESERVED IN OS/VS ***    00237200
TCTJSTX  DS    0F -           AMOUNT OF TIME THAT JOB OR STEP HAS BEEN  00237800
*                             EXTENDED BY USER EXIT IEFUTL (32-BIT      00238400
*                             UNSIGNED BINARY NUMBER)  (OS/VS2)  MDC005 00239000
TCTSTOF  DS    F -            OVERFLOW FIELD FOR USER-SUPPLIED STEP     00239600
*                             TIME EXTENSIONS (OS/VS1)           MDC001 00240200
TCTTJLM  DS    0F -           CONTAINS REMAINING JOB TIME (32-BIT       00240800
*                             UNSIGNED BINARY NUMBER)  (OS/VS2)  MDC006 00241400
TCTSACT  DS    F -            A RUNNING TOTAL OF THE USER-SUPPLIED STEP 00242000
*                             TIME EXTENSIONS EXPRESSED IN TIMER UNITS  00242600
*                             (OS/VS1)                           MDC002 00243200
TCTIOCS  DS    0F             ACCUM SESSION I/O SERVICE(OS/VS2)@G50FPRL 00243800
TCTWLMT  DS    F -            THE JOB OR STEP MAXIMUM WAIT TIME LIMIT   00244400
*                             AS SPECIFIED IN SMFDEFLT, EXPRESSED IN    00245000
*                             TIMER UNITS (OS/VS1)                      00245600
*                             RESERVED - SET TO ZERO (OS/VS2)    MDC016 00246200
TCTLIN   DS    F -            TSO - COUNT OF LINES OF TERMINAL INPUT    00246800
TCTLOUT  DS    F -            TSO - COUNT OF LINES OF TERMINAL OUTPUT   00247400
TCTAST   DS    F -            THE TIME OF DAY (TO ONE HUNDREDTH OF A    00248000
*                             SECOND) THAT DEVICE ALLOCATION STARTED    00248600
*                                                                ICB365 00249200
TCTPPST  DS    F -            THE TIME OF DAY (TO ONE HUNDREDTH OF A    00249800
*                             SECOND THAT THE PROBLEM PROGRAM WAS       00250400
*                             INITIALLY LOADED INTO MAIN STORAGE ICB365 00251000
TCTPGSMF DS    0CL20 -        SMF REGION-RELATED STATISTICS             00251600
*                             (OS/VS1)                           MDC007 00252200
TCTAJS   DS    0F -           ACCUMULATED SESSION SERVICE TIME          00252800
*                             (OS/VS2)  (MDC019)                 YM7459 00253400
TCTPGIN  DS    F -            TOTAL PAGE-INS FOR THIS REGION            00254000
*                             (INCLUDING SWAP-INS) (OS/VS1)      MDC007 00254600
TCTACT   DS    0F -           ACCUMULATED ACTIVE TIME (OS/VS2)          00255200
*                             (MDC020)                           YM7459 00255800
TCTPGOUT DS    F -            TOTAL PAGE-OUTS FOR THIS REGION           00256400
*                             (INCLUDING SWAP-OUTS) (OS/VS1)     MDC008 00257000
TCTATR   DS    0F -           ACCUMULATED TRANSACTION RESIDENCY TIME    00257600
*                             (OS/VS2)  (MDC302)               @Z40FP9A 00258200
TCTRGNS  DS    F -            TOTAL SWAPS PERFORMED FOR THIS TSO        00258800
*                             USER (SWAP-INS + SWAP-OUTS)               00259400
*                             (OS/VS1)                           MDC009 00260000
TCTMSOS  DS    0F             ACCUM SESSION MAIN STORAGE SERVICE        00260600
*                             (OS/VS2)                         @G50FPRL 00261200
TCTSIN   DS    F -            TOTAL PAGES SWAPPED-IN FOR THIS TSO       00261800
*                             USER (OS/VS1)                      MDC010 00262400
TCTSRBS  DS    0F             ACCUM SESSION SRB SERVICE (OS/VS2)        00263000
*                                                              @G50FPRL 00263600
TCTSOUT  DS    F -            TOTAL PAGES SWAPPED-OUT FOR THIS TSO      00264200
*                             USER (OS/VS1)                      MDC011 00264800
TCTPDASD DS    F -           NO OF MOUNTS FOR NONSPECIFIC DASD @G742PJW 00265400
TCTRDASD DS    F -           NO OF MOUNTS FOR SPECIFIC DASD    @G742PJW 00266000
TCTPTAPE DS    F -           NO OF MOUNTS FOR NONSPECIFIC TAPE @G742PJW 00266600
TCTRTAPE DS    F -           NO OF MOUNTS FOR SPECIFIC TAPE    @G742PJW 00267200
TCTPMSS  DS    F -           NO OF MOUNTS FOR NONSPECIFIC MSS  @G742PJW 00267800
TCTRMSS  DS    F -           NO OF MOUNTS FOR SPECIFIC MSS     @G742PJW 00268400
TCTEJST  DS    F -           LAST VALUE OF ELAPSED TCB TIME    @G742PJW 00269000
TCTSRBT  DS    F -           LAST VALUE OF ELAPSED SRB TIME    @G742PJW 00269600
TCTSVTEP DS    F -           LAST VALUE OF TOTAL BLOCK COUNT   @G742PJW 00270200
TCTLINSV DS    F -           LAST VALUE OF TPUT COUNT          @G742PJW 00270800
TCTLOUTS DS    F -           LAST VALUE OF TGET COUNT          @G742PJW 00271400
TCTTRAN  DS    F -           LAST VALUE OF FOREGROUND TRANS    @G742PJW 00272000
TCTITCB  DS    F -           INITIATOR TCB TIME                @G742PJW 00272600
TCTISRB  DS    F -           INITIATOR SRB TIME                @G742PJW 00273200
TCTT30J  DS    F -           ADDRESS OF JOB TOTAL TYPE 30 RCD  @G742PJW 00273800
TCTT30S  DS    F -           ADDRESS OF STEP TOTAL TYPE 30 RCD @G742PJW 00274400
TCTT30H  DS    F -           ADDRESS OF EXCP HOLD TYPE 30 RCD  @G742PJW 00275000
TCTLCTAD DS    F -           ADDRESS OF LCT                    @G742PJW 00275600
TCTT32J  DS    F -           ADDRESS OF JOB TOTAL TYPE 32 RCD  @G742PJW 00276200
TCTT32S  DS    F -           ADDRESS OF STEP TOTAL TYPE 32 RCD @G742PJW 00276800
TCT32SP  DS    F -           SUBPOOL AND SIZE OF TYPE 32 RCDS  @G742PJW 00277400
TCT32BLK DS    F -           ADDRESS OF DETAIL CONTROL BLOCK   @VS49913 00278000
TCTLRRCT DS    F -           LAST VALUE OF THE ADDRESS SPACE       @D9C 00278600
*                            RE-READ COUNT                         @D9C 00279200
TCTIOSAV DS    F -           ADDRESS OF SAVE AREA FOR IEASMFEX @PCC0508 00279800
TCTDCTI  DS    F -           LAST VALUE OF DEVICE CONNECT TIME @G860P27 00280400
TCTTIMER DS    F -           ADDRESS OF SMF TIMER ELEMENT      @G742PJW 00281000
TCTTMRSP DS    F -           SUBPOOL AND SIZE OF TIMER ELT     @G742PJW 00281600
TCTPARMS DS    F -           ADDRESS OF TIMER PARAMETER LIST   @G742PJW 00282200
TCTPRMSP DS    F -           SUBPOOL AND SIZE OF PARM LIST     @G742PJW 00282800
TCTSNAME DS    CL8           STEP NAME OF CURRENT STEP         @VS49841 00283400
TCTTCT   DS    CL8           TCT IDENTIFIER FIELD              @G860P27 00284000
TCTMSCT  DS    F -           NUMBER OF TIMES I/O MEASUREMENTS           00284600
*                            HAVE BEEN TURNED OFF AT JOB START @G860P27 00285200
TCTMSOFF EQU   X'80'         I/O MEASUREMENTS ARE ON           @G860P27 00285800
TCTEIIP  DS    F -           ELAPSED I/O INTERRUPT TIME            @LBC 00286400
TCTERCT  DS    F -           ELAPSED RCT CPU TIME                  @LBC 00287000
TCTRQSVP DS    F             Pointer to sysevent REQSVDAT               00287100
*                                       parameter list         @WLMPGMC 00287200
TCTE39PP DS    F             Pointer to sysevent REQPGDAT               00287300
*                                       parameter list         @WLMPGMC 00287400
TCTXR0DC DS    CL4           RESERVED                          @WLMPGMC 00287500
TCTADMFW DS    F             Number of pages moved with ADMF WRITE @02A 00287600
TCTADMFR DS    F             Number of pages moved with ADMF READ  @02A 00287900
TCTEHPT  DS    F -           ELAPSED HIPERSPACE PROCESSING TIME    @LBC 00288200
TCTEVFUT DS    F -           LAST VALUE ELAPSED VF USAGE TIME      @H4A 00288800
TCTEVFAT DS    F -           LAST VALUE ELAPSED VF AFFINITY TIME   @D6A 00289400
TCTIVFUT DS    F -           INITIATOR VF USAGE TIME               @H4A 00290000
TCTIVFAT DS    F -           INITIATOR VF AFFINITY TIME            @D6A 00290600
TCTINTST DS    F -           INTERVAL START TIME                   @L4A 00291200
TCTINTDT DS    F -           INTERVAL START DATE                   @L4A 00291800
TCTEINFO DS    0CL32         ETCTIOT INFORMATION                   @Q8A 00292400
TCTFETIO DS    F -           ADDRESS OF FIRST ETCTIOT BLOCK        @D9A 00293000
TCTLETIO DS    F -           ADDRESS OF LAST ETCTIOT BLOCK         @D9A 00293600
TCTESUBP DS    H -           ETCTIOT SUBPOOL                       @D9A 00294200
TCTELEN  DS    H -           LENGTH OF ONE ETCTIOT BLOCK           @D9A 00294800
TCTEBLK  DS    F -           NUMBER OF ETCTIOT 4K BLOCKS           @D9A 00295400
TCTEFAVL DS    F -           1ST AVAILABLE ETCTIOT TOKEN           @D9A 00296000
TCTELAVL DS    F -           LAST AVAILABLE ETCTIOT TOKEN          @D9A 00296600
TCTENAVL DS    F -           NUMBER OF AVAILABLE ETCTIOT ENTRIES   @D9A 00297200
TCTEFLGS DS    CL4 -         ETCTIOT FLAGS                         @D9A 00297800
TCTCOMP  EQU   X'80' -       TCTTIOT BEING MOVED INDICATOR         @D9A 00298400
TCTDUMMY EQU   X'40' -       When set by IEFIB660, this flag represents 00298500
*                            a Dummy TCTIOT.  It will be checked by     00298600
*                            IEFDB4F9.                             @0AA 00298700
TCTANSC  DS    F -           INTEGRATED CRYPTO SERVICE COUNT       @TEA 00299000
TCTTMRFL DS    2BL1'0'       PREVIOUS INTERVAL TIMER BIT FLAGS     @0KA 00300000
TCTCTF   EQU   X'80'         SMF30CPT TIMER INVALID                @0KA 00350000
TCTCSF   EQU   X'40'         SMF30CPS TIMER INVALID                @0KA 00400000
TCTVUF   EQU   X'20'         SMF30JVU TIMER INVALID                @0KA 00450000
TCTVAF   EQU   X'10'         SMF30JVA TIMER INVALID                @0KA 00500000
TCTISF   EQU   X'08'         SMF30ISB TIMER INVALID                @0KA 00600000
TCTICF   EQU   X'04'         SMF30ICU TIMER INVALID                @0KA 00650000
TCTIVF   EQU   X'02'         SMF30IVU TIMER INVALID                @0KA 00700000
TCTIAF   EQU   X'01'         SMF30IVA TIMER INVALID                @0KA 00750000
TCTIIF   EQU   X'80'         SMF30IIP TIMER INVALID                @0KA 00800000
TCTHPF   EQU   X'40'         SMF30HPT TIMER INVALID                @0KA 00850000
TCTRCF   EQU   X'20'         SMF30RCT TIMER INVALID                @0KA 00950000
TCTASF   EQU   X'10'         SMF30ASR TIMER INVALID                @L3A 00966600
TCTENF   EQU   X'08'         SMF30ENC TIMER INVALID                @L3A 00983200
TCTDEF   EQU   X'04'         SMF30DET TIMER INVALID                @D3A 01008200
TCTFLAGS DS    BL1           TCT Flags                             @07A 01033200
TCTTCT2  EQU   X'80'         DSABTCT2 should be used to contain    @07A 01083200
*                            the offset to the lookup table entry  @07A 01133200
TCTSRMSP DS    XL1           Subpool for TCTRQSVP,TCTE39PP     @WLMPGMC 01183200
TCTT33SP DS    F             Address of Type 33 TP Work Area       @DPA 10154400
TCTT33J  DS    F             Address of Type 33 TP JOB Record      @DPA 10154600
TCTT33S  DS    F             Address of Type 33 TP STEP Record     @DPA 10154800
TCTTPTYP DS    F             APPC TP Type (Standard/Multi)         @DPA 10155000
TCTTPTCB DS    F             Last Value of TCB Time for TP         @DPA 10155200
TCTTPSRB DS    F             Last Value of SRB Time for TP         @DPA 10155400
TCTTPEXP DS    F             Last Value of EXCP Count for TP       @DPA 10155600
TCTTPDCT DS    F             Last Value of Dev Conn Time for TP    @DPA 10155800
TCTTPNUM DS    F             Number of Transactions Processed      @DPA 10156000
TCTTPCON DS    F             Number of Conversations               @DPA 10156200
TCTTPTAC DS    F             Number of Active Cons                 @DPA 10156400
TCTTPCNA DS    F             Number of Cons Allocated              @DPA 10156600
TCTTPSEN DS    F             Number of Sends for TP                @DPA 10156800
TCTTPDAT DS    CL8           Amount of Data Sent                   @DPA 10157000
TCTTPREC DS    F             Number of Recvs for TP                @DPA 10157200
TCTTPDAR DS    CL8           Amount of Data Received               @DPA 10157400
TCTSUBNM DS    CL4           Scheduler of Job                      @DPA 10157600
TCTOMVSP DS    A             Address of TCTOMVS Table              @LUA 10157700
TCTT30PH DS    A             Address of T30AREA for Process Data   @LUA 10157800
TCTT30SE DS    A             Address of T30AREA for Step EXCP Data @LUA 10157900
TCTT30SP DS    A             Address of T30AREA for Step Process   @LUA 10158000
*                              Data                                @LUA 10158100
TCTT30JE DS    A             Address of T30AREA for Job EXCP Data  @LUA 10158200
TCTT30JP DS    A             Address of T30AREA for Job Process    @LUA 10158300
*                              Data                                @LUA 10158400
TCTISS   DS    CL8           SMF Interval Start Time (STCK Format) @DVA 10158500
TCT30CN  DS    F             Last Number of Conversations          @01A 10158600
TCT30CNA DS    F             Last Number of Cons Allocated         @01A 10158700
TCT30SEN DS    F             Last Number of Sends for TP           @01A 10158800
TCT30DAT DS    CL8           Last Amount of Data Sent              @01A 10158900
TCT30REC DS    F             Last Number of Recvs for TP           @01A 10159000
TCT30DAR DS    CL8           Last Amount of Data Received          @01A 10159100
TCT30ATR DS    F             Last Number of Transactions Processed @01A 10159200
TCTUACL  DS    F             Usage ACA Lockword                    @04A 10159300
TCTUACA  DS    A             Address of First ACA for job          @04A 10159400
TCTUTCAC DS    A             Addr of 1st TCA on consolidated chain @09C 10159600
TCTUTCA  DS    A             Address of First TCA on chain         @04A 10159700
TCTUFCAC DS    A             Addr of 1st FCA on consolidated chain @08C 10159800
TCTUFCA  DS    A             Address of First FCA on chain         @04A 10159900
TCTRSMGT DS    F             Usage RESMGR Token                    @04A 10160000
TCTUTIMR DS    A             Usage Timer Element                   @04A 10160100
TCTUTPRM DS    A             Usage Timer ParmArea                  @04A 10160200
TCTT30UH DS    A             Address of T30AREA Hold area for      @05A 10160300
*                            Usage Entries                         @05A 10160400
TCTT30US DS    A             Address of T30AREA Step Hold Area for @05A 10160500
*                            Usage Entries                         @05A 10160600
TCTT30UJ DS    A             Address of T30AREA Job Hold Area for  @05A 10160700
*                            Usage Entries                         @05A 10160800
TCTARMP  DS    A             Address of TCTARM table               @L1A 10160900
TCTT30AH DS    A             Address of T30AREA for ARM Data       @L1A 10161000
TCTT30SA DS    A             Address of T30AREA for Step ARM Data  @L1A 10161100
TCTT30JA DS    A             Address of T30AREA for Job ARM Data   @L1A 10161200
TCTASST  DS    F             Additional SRB Service Time           @L3A 10161300
TCTECPT  DS    F             Enclave CPU Time                      @L3A 10161400
TCTETIM  DS    F             Enclave Transaction Active Time       @L3A 10161500
TCTECPU  DS    F             Enclave CPU Service Units             @L3A 10161600
TCTETC   DS    F             Enclave Transaction Count             @P5C 10161700
TCTASSTC DS    F             Additional SRB Service Time (Cumulative)   10161800
*                                                                  @06A 10161900
TCTECPTC DS    F             Enclave CPU Time (Cumulative)              10162000
*                            including dependent enclave time      @D3C 10162100
TCTDET   DS    F             Dependent enclave CPU time            @D3A 10162200
TCT30AIC DS    F             Saved copy of RQSVAIC                 @D3A 10162300
TCT30AID DS    F             Saved copy of RQSVAID                 @D3A 10162400
TCT30AIW DS    F             Saved copy of RQSVAIW                 @D3A 10162500
TCT30AIS DS    F             Saved copy of RQSVAIS                 @D3A 10162600
TCT30EIC DS    F             Saved copy of RQSVEIC                 @D3A 10162700
TCT30EID DS    F             Saved copy of RQSVEID                 @D3A 10162800
TCT30EIW DS    F             Saved copy of RQSVEIW                 @D3A 10162900
TCT30EIS DS    F             Saved copy of RQSVEIS                 @D3A 10163000
TCTT30SR DS    F             Address of STEP area for Remote       @LAA 10163300
*                            System Data entries.                  @LAA 10163400
TCTT30JR DS    F             Address of JOB area for Remote        @LAA 10163500
*                            System Data entries.                  @LAA 10163600
         DS   1F             pad to doubleword boundary            @D3A 10163700
TCTEND   EQU   *             END OF TCT MAPPING                    @LOA 10163800
TCTCOMZ  EQU   *-SMFTCT -    LENGTH OF TCT COMMON SECTION               10163900
         SPACE                                                          10164000
*********************************************************************** 10164100
*                                                                     * 10164200
*                      TCT STORAGE TABLE                              * 10164300
*                                                                     * 10164400
*       A SEPARATE TABLE IS USED TO DESCRIBE THE STORAGE OBTAINED     * 10164500
*       FOR A TASK.  THE STORAGE TABLE IS CONTIGUOUS TO THE TCT.      * 10164600
*       IT IS POINTED TO BY THE TCTCRTBL FIELD IN THE TCT COMMON      * 10164700
*       SECTION.                                                      * 10164800
*                                                                 @D9C* 10164900
*********************************************************************** 10165000
         SPACE                                                          10165100
TCTCORE  EQU   * -            START OF TCT STORAGE TABLE POINTED TO     10165200
*                             BY TCTCRTBL                               10165300
TCTLWM   DS    F -            MAX VIRTUAL STORAGE IN USER SUBPOOLS      10165400
*                             BELOW 16M                            @P1C 10165500
TCTHWM   DS    F -            MAX VIRTUAL STORAGE IN SWA AND LSQA       10165600
*                             BELOW 16M                            @P1C 10165700
TCTMINC  DS    H -            THE MINIMUM DIFFERENCE (IN 2K BLOCKS)     10165800
*                             BETWEEN TCTLWM AND TCTHWM.  THIS FIGURE   10165900
*                             REPRESENTS THE UNUSED PORTION OF THE      10166000
*                             USER'S REGION.                            10166100
TCTRSV00 DS    H -            RESERVED.  REGION FIELD INCREASED TO      10166200
*                             FULLWORD AND MOVED TO THE END OF          10166300
*                             THE TCT STORAGE TABLE                @PVC 10166400
TCTRBA   DS    A -            FOR A V=V PROBLEM PROGRAM, LOWEST ADDRESS 10166500
*                             IN PRIVATE AREA.  FOR A V=R PROBLEM       10166600
*                             PROGRAM, LOWEST ADDRESS IN REGION.        10166700
*                             (OS/VS2)                           MDC012 10166800
TCTEHWM  DS    F -            MAX VIRTUAL STORAGE IN SWA AND LSQA       10166900
*                             ABOVE 16M                            @P1C 10167000
TCTELWM  DS    F -            MAX VIRTUAL STORAGE IN USER SUBPOOLS      10167100
*                             ABOVE 16M                            @P1C 10167200
TCTRGNB  DS    F              PRIVATE AREA BELOW 16M IN BYTES      @PVC 10167300
TCTERGNB DS    F              PRIVATE AREA ABOVE 16M IN BYTES      @PVC 10167400
TCTRSZ   DS    F              ORIGINAL REGION REQUEST IN 2K BLOCKS @PVM 10167500
TCTRSV01 DS    4F -           RESERVED                             @PVC 10167600
TCTCREZ  EQU   *-TCTCORE -    LENGTH OF TCT STORAGE TABLE          @PVM 10167700
TCTBIG   EQU   *-SMFTCT -     COMBINED LENGTH OF TCT COMMON SECTION     10167800
*                             AND TCT STORAGE TABLE                @PVC 10167900
         SPACE 2                                                        10168000
*********************************************************************** 10168100
*                                                                     * 10168200
*                  TCT INPUT/OUTPUT MEASUREMENT TABLE                 * 10168300
*                                                                     * 10168400
*        THE TCT I/O MEASUREMENT TABLE (TCTTIOT) IS COMPOSED OF THE   * 10168500
*        TCT I/O  LOOKUP TABLE AND THE TCT I/O COUNTER TABLE.  IT IS  * 10168600
*        USED TO COLLECT I/O MEASUREMENTS AT THE DD LEVEL.  THE       * 10168700
*        TCTTIOT IS NOT CONTIGIOUS TO THE TCT.  THE TCTIOTBL FIELD    * 10168800
*        IN THE TCT COMMON SECTION POINTS TO THE TCTTIOT.             * 10168900
*                                                                     * 10169000
*        THE TCTTIOT IS CREATED BY IEFIB660 IN SUBPOOL 255/KEY 0      * 10169100
*        AND RESIDES BELOW THE 16M LINE.                              * 10169200
*                                                                     * 10169300
*        THE TCT I/O LOOKUP TABLE CONTAINS 1 COMMON SECTION AND A     * 10169400
*        DD LOOKUP TABLE.  THE DD LOOKUP TABLE IS AN ARRAY WITH       * 10169500
*        EACH ELEMENT REPRESENTING ONE DD ENTRY IN THE TIOT (IEFTIOT).* 10169600
*        SMF REFERENCES THESE DD LOOK-UP ENTRIES TO FIND THE FIRST    * 10169700
*        DEVICE ENTRY IN THE TCT I/O COUNTER TABLE ASSOCIATED WITH    * 10169800
*        A PARTICULAR DD.                                             * 10170000
*                                                                     * 10170200
*        THE TCT I/O COUNTER TABLE CONSISTS OF ONE DD ENTRY PER       * 10170400
*        ENTRY IN THE DD LOOK-UP TABLE.  EACH DD ENTRY CONSISTS OF    * 10170600
*        1 OR MORE 24 BYTE DEVICE ENTRIES WHICH REPRESENT THE UCBS    * 10170800
*        ASSOCIATED WITH THE DD.  THERE IS ONE 8 BYTE OUTPUT LIMIT    * 10171000
*        EXTENSION WHICH IS USED BY GPD.                              * 10171200
*                                                                     * 10171400
*        THE SIZE OF THE TCTTIOT IS DEPENDENT ON THE NUMBER OF        * 10171600
*        DDS PER JOB.  THERE IS 1 DD LOOKUP TABLE PER DD AND          * 10171800
*        1 DEVICE ENTRY PER DEVICE (UCB) PER DD.                      * 10172000
*                                                                     * 10172200
*********************************************************************** 10172400
         SPACE                                                          10172600
TCTTIOT  EQU   * -            BEGINNING OF TCT I/O TABLE                10172800
         SPACE                                                          10173000
*********************************************************************** 10173200
*                                                                     * 10173400
*        TCT I/O LOOKUP TABLE  (ONE TABLE PER DD)                     * 10173600
*                                                                     * 10173800
*********************************************************************** 10174000
         SPACE                                                          10174200
TCTPLEXT DS    0F -           SUBPOOL/LENGTH OF TCT I/O TABLE           10174400
         DS    B -            SUBPOOL IN WHICH THE TCT I/O TABLE        10174600
*                             RESIDES                          @G860P27 10174800
TCTSZEXT DS    BL3            SIZE IN BYTES OF TCT I/O TABLE            10175000
TCTSZLKP DS    F -            NUMBER OF DEVICE ENTRIES IN THE TCT       10175200
*                             TCTDDLEN TABLE TIMES 24          @G860P27 10175400
TCTCOMIO EQU   *-TCTTIOT -    LENGTH OF TCT I/O TABLE COMMON SECTION    10175600
         SPACE                                                          10175800
*********************************************************************** 10176000
*                                                                     * 10176200
*        DD LOOKUP TABLE ENTRY (ONE ENTRY PER DD ENTRY IN THE TIOT)   * 10176400
*                                                                     * 10176600
*********************************************************************** 10176800
         SPACE                                                          10177000
TCTIODSP EQU   * -            START OF DD LOOKUP TABLE ENTRY            10177200
TCTDCBTD DS    F -            OFFSET FROM THE TIOT ORIGIN TO THE TIOT   10177400
*                             ENTRY FOR THE DD STATEMENT ASSOCIATED     10177600
*                             WITH THE ACCESSED DATA SET                10177800
*                             NOTE: THE TIOT ENTRIES MAY -NOT- BE       10178000
*                             CONTIGUOUS.                          @0CC 10178200
TCTIOTSD DS    F -            OFFSET FROM THE TCT I/O TABLE ORIGIN TO   10178400
*                             THE DD ENTRY, WITHIN THE TCT I/O COUNTER  10178600
*                             TABLE, ASSOCIATED WITH THE ACCESSED DATA  10178800
*                             SET                              @G860P27 10179000
TCTDCBLE DS    F -            END OF TCT I/O LOOKUP TABLE (ZEROS)       10179200
         SPACE                                                          10179400
*********************************************************************** 10179600
*                                                                     * 10179800
*        TCT I/O COUNTER TABLE  (ONE ENTRY PER DD ENTRY IN THE        * 10180000
*                                DD LOOK-UP TABLE)                    * 10180200
*                                                                     * 10180400
*********************************************************************** 10180600
         SPACE                                                          10180800
*********************************************************************** 10181000
*                                                                     * 10181200
*        DEVICE ENTRY  (ONE ENTRY PER DEVICE (UCB) PER DD)            * 10181400
*                                                                     * 10181600
*********************************************************************** 10181800
         SPACE                                                          10182000
TCTDDENT EQU   * -            START OF TCT I/O COUNTER TABLE (DEVICE    10182200
*                             ENTRY)                                    10182400
TCTUCBP  DS    F -            ADDRESS OF THE UCB ASSOCIATED   @G860P27  10182600
*                             WITH THIS DEVICE                @G860P27  10182800
TCTSCTR  DS    FL1 -          NUMBER OF DEVICES ASSOCIATED WITH THIS    10183000
*                             DD STATEMENT.  THIS NUMBER REPRESENTS     10183200
*                             THE NUMBER OF DEVICE ENTRIES WITHIN THIS  10183400
*                             DD ENTRY.  THIS FIELD CONTAINS ZEROS IN   10183600
*                             ALL BUT ITS FIRST APPEARANCE IN ANY DD    10183800
*                             ENTRY.                                    10184000
*                             X'FF' INDICATES SYSIN DATA SET (OS/VS1).  10184200
*                                                                ICB375 10184400
TCTFLGS  DS    B -            FLAG BYTE                          MDC013 10184600
TCTDDIND EQU   X'80' -        END OF CONCATENATED DD STRING (OS/VS1)    10184800
*                                                                MDC014 10185000
TCTVAMDS EQU   X'40' -        VAM DATA SET ENTRY.  TCTUCBP FIELD IS     10185200
*                             ZERO WHEN THIS BIT IS ONE.         MDC015 10185400
TCTNOCNT EQU   X'20' -        IF ON, DO NOT COUNT THE EXCP (OS/VS1)     10185600
*                             (MDC301)                         @XA09673 10185800
TCTRSV22 EQU   X'10',,C'X' -  RESERVED                                  10186000
TCTRSV23 EQU   X'08',,C'X' -  RESERVED                                  10186200
TCTRSV24 EQU   X'04',,C'X' -  RESERVED                                  10186400
TCTRSV25 EQU   X'02',,C'X' -  RESERVED                                  10186600
TCTRSV26 EQU   X'01',,C'X' -  RESERVED                                  10186800
TCTBLKSZ DS    H -            BLOCK SIZE FOR THIS DD NAME     @G742PJW  10187000
TCTCBSZ  EQU   X'80'          CHANGED BLOCK SIZE IF ON        @G742PJW  10187200
TCTDCTR  DS    F -            COUNTER FOR EXCP'S ISSUED AGAINST THIS    10187400
*                             UCB (DEVICE)                              10187600
TCTDCTRS DS    F -            SAVED EXCP COUNT FOR THIS ENTRY @G860P27  10187800
TCTCONN  DS    F -            DEVICE CONNECT TIME             @G860P27  10188000
TCTCONNS DS    F -            SAVED DEVICE CONNECT TIME       @G860P27  10188200
TCTXBLKS DS    XL8            BLOCKSIZE >32K FOR THIS DD NAME     @LDA  10188300
TCTDDLEN EQU   *-TCTUCBP                                      @G742PJW  10188400
         SPACE                                                          10188600
*********************************************************************** 10188800
*                                                                     * 10189000
*        OUTPUT LIMIT EXTENSION                                       * 10189200
*                                                                     * 10189400
*********************************************************************** 10189600
         SPACE                                                          10189800
TCTRSV10 DS    XL4 -          *** TCTOUTLM FIELD RESERVED IN OS/VS ***  10190000
TCTEXRLD DS    FL1 -          A BINARY NUMBER OF EXTENTS RELEASED BY    10190200
*                             THE DADSM RELEASE ROUTINE.  COLLECTED     10190400
*                             ONLY IF RLSE WAS SPECIFIED IN THE SPACE   10190600
*                             PARAMETER FOR THIS DATA SET.              10190800
TCTTKRLD DS    FL3 -          A BINARY NUMBER OF TRACKS RELEASED BY THE 10191000
*                             DADSM RELEASE ROUTINE.  COLLECTED ONLY    10191200
*                             IF RLSE WAS SPECIFIED IN THE SPACE        10191400
*                             PARAMETER FOR THIS DATA SET.              10191600
         SPACE 2                                                        10191800
*********************************************************************** 10192000
*                                                                     * 10192200
*                 EXTENDED TCTIOT CONTROL BLOCK                       * 10192400
*                                                                     * 10192600
*   THE ETCTIOT IS A CHAIN OF 4K BLOCKS.  EACH 4K BLOCK CONSISTS OF   * 10192800
*   A 16 BYTE HEADER AND AN ARRAY OF A MAXIMUM OF 340 ELEMENTS.  EACH * 10193000
*   ELEMENT IS 12 BYTES IN LENGTH AND REPRESENTS A DD ENTRY IN        * 10193200
*   THE TCTTIOT.                                                      * 10193400
*                                                                     * 10193600
*   THE ETCTIOT IS NOT CONTIGUOUS TO THE TCT COMMON SECTION OR THE    * 10193800
*   TCTTIOT.  THE FIRST ETCTIOT IS POINTED TO BY THE TCTFETIO         * 10194000
*   FIELD IN THE TCT COMMON SECTION.  ADDITIONAL FIELDS EXIST IN      * 10194200
*   THE TCT COMMON SECTION WHICH DESCRIBE THE ETCTIOT CHAIN.          * 10194400
*                                                                     * 10194600
*   THE ETCTIOT IS CREATED BY IEFIB660 IN SUBPOOL 255 AND KEY 0.      * 10194800
*   THE CHAIN RESIDES ABOVE THE 16M LINE.                             * 10195000
*                                                                     * 10195200
*   THERE IS 1 ETCTIOT CHAIN PER ADDRESS SPACE.  THE SIZE OF THE      * 10195400
*   CHAIN IS BASED ON THE NUMBER OF DDS PER JOB:                      * 10195600
*                                                                     * 10195800
*        MINUMUM CHAIN =  1 4K BLOCK  (1*4096 = 4096 BYTES)           * 10196000
*        AVERAGE CHAIN =  1 4K BLOCK  (AVERAGE JOB < 100 DDS)         * 10196200
*       *MAXIMUM CHAIN = 10 4K BLOCKS (10*4096 = 40,960 BYTES)        * 10196400
*                                                                     * 10196600
*   * = MAXIMUM CHAIN IS BASED ON 3273 DDS                            * 10196800
*                                                                 @D9A* 10197000
*********************************************************************** 10197200
         SPACE 2                                                        10197400
*********************************************************************** 10197600
*                                                                     * 10197800
*        ETCTIOT HEADER  (ONE HEADER PER BLOCK)                       * 10198000
*                                                                     * 10198200
*********************************************************************** 10198400
ETCTIOT  EQU   * -            EXTENDED TCTIOT                      @D9A 10198600
ETCTHDR  EQU   * -            ETCTIOT HEADER SECTION               @D9A 10198800
ETCTID   DS    CL7 -          ETCTIOT IDENTIFIER = 'ETCTIOT'       @D9A 10199000
ETCTVER  DS    CL1 -          ETCTIOT VERSION NUMBER = X'01'       @D9A 10199200
ETCTFCHN DS    F -            NEXT ETCTIOT BLOCK ADDRESS           @D9A 10199400
ETCTBCHN DS    F -            PREVIOUS ETCTIOT BLOCK ADDRESS       @D9A 10199600
         SPACE 2                                                        10199800
*********************************************************************** 10200000
*                                                                     * 10200200
*        ETCTIOT ELEMENT (MAXIMUM OF 340 12 BYTE ELEMENTS PER BLOCK)  * 10200400
*                                                                     * 10200600
*********************************************************************** 10200800
ETCTNTRY EQU   *              ETCTIOT DD ENTRY                     @D9A 10201000
ETCTNEXT DS    F -            NEXT TOKEN                           @D9A 10201200
ETCTIUSE EQU   X'80' -        ENTRY IN USE  (1=IN USE)             @D9A 10201400
ETCTDSAB DS    F -            DSAB ADDRESS OF ENTRY                @D9A 10201600
ETCTSTIO DS    F -            TCTIOT DD LOOKUP ENTRY OFFSET        @D9A 10201800
         SPACE 2                                                   @LUA 10201900
*********************************************************************** 10202000
*                                                                     * 10202100
*        TCTOMVS - TCT OpenMVS Process Data Table                 @P2C* 10202200
*                                                                     * 10202300
*      The OpenMVS Process Data Table is 104 bytes.               @L8C* 10202400
*      Size should always be a multiple of 8.                     @P4A* 10202500
*                                                                     * 10202600
*      THE TCT OpenMVS PROCESS DATA TABLE (TCTOMVS) IS POINTED    @P2C* 10202700
*      TO BY TCTOMVSP IN THE TCT COMMON SECTION.                  @LUA* 10202800
*                                                                     * 10202900
*********************************************************************** 10203000
TCTOMVS  EQU   * -            TCT OpenMVS Table                    @P2C 10203100
TCTOMVSH DS    0CL8 -         TCT OpenMVS Header Section           @03A 10203200
TCTOID   DS    CL4            Control Block ID  'TCTO'             @LUA 10203300
TCTOSPLN DS    0F             Control Block Subpool and Length     @LUA 10203400
TCTOSP   DS    BL1            - Subpool                            @LUA 10203500
TCTOLN   DS    BL3            - Length                             @LUA 10203600
TCTOMVSD DS    0CL96 -        TCT OpenMVS Data Section             @L9C 10203700
TCTOPI   DS    F -            Process ID                           @LUA 10203800
TCTOPG   DS    F -            Process Group ID                     @LUA 10203900
TCTOUI   DS    F -            Process User ID                      @LUA 10204000
TCTOUG   DS    F -            Process User Group ID                @LUA 10204100
TCTOSI   DS    F -            Process Session ID                   @LUA 10204200
TCTOSC   DS    F -            Number of syscals requested          @LUA 10204300
TCTOST   DS    F -            Total CPU Time accumulated by the    @LUA 10204400
*                             syscals requested                    @LUA 10204500
TCTODR   DS    F -            Number of directory I/O blocks read @D1C  10204600
TCTOFR   DS    F -            Number of I/O blocks read for             10204700
*                             standard files                       @D1C 10204800
TCTOFW   DS    F -            Number of I/O blocks written for          10204900
*                             standard files                       @D1C 10205000
TCTOPR   DS    F -            Number of I/O blocks read for pipe        10205100
*                             files                                @D1C 10205200
TCTOPW   DS    F -            Number of I/O blocks written for          10205300
*                             pipe files                           @D1C 10205400
TCTOSR   DS    F -            Number of I/O blocks read for             10205500
*                             special files                        @D1C 10205600
TCTOSW   DS    F -            Number of I/O blocks written for          10205700
*                             special files                        @D1C 10205800
TCTOLL   DS    F -            Number of path name Lookup calls to  @LUA 10205900
*                             the logical file system              @LUA 10206000
TCTOLP   DS    F -            Number of path name Lookup calls to  @LUA 10206100
*                             the physical file system             @LUA 10206200
TCTOGL   DS    F -            Number of path name Generation calls @LUA 10206300
*                             to the logical file system           @LUA 10206400
TCTOGP   DS    F -            Number of path name Generation calls @LUA 10206500
*                             to the physical file system          @LUA 10206600
TCTOPP   DS    F -            OpenMVS parent process ID number     @L2A 10206700
TCTOKR   DS    F -            Number of I/O blocks read for Remote      10206800
*                             socket by the process                @L2A 10206900
TCTOKW   DS    F -            Number of I/O blocks written for          10207000
*                             Remote socket by the process         @L2A 10207100
TCTOMS   DS    F -            Number of message queues bytes sent  @L8A 10207200
TCTOMR   DS    F -            Number of message queues bytes received   10207300
*                                                                  @L8A 10207400
TCTOSY   DS    F -            Number of sync() function calls      @L9C 10207500
         SPACE 2                                                   @L1A 10207600
*********************************************************************** 10207700
*                                                                     * 10207800
*        TCTARM - TCT ARM Data Table                              @L1A* 10207900
*                                                                     * 10208000
*      The ARM data table is 88 bytes.                            @L1A* 10208100
*                                                                     * 10208200
*      The TCT ARM Data Table (TCTARM) is pointed to by           @L1A* 10208300
*      TCTARMP in the TCT common section.                         @L1A* 10208400
*                                                                     * 10208500
*********************************************************************** 10208600
TCTARM   EQU   * -            TCT ARM Table                        @L1A 10208700
TCTAID   DS    CL4            Control Block ID  'TCTA'             @L1A 10208800
TCTASPLN DS    0F             Control Block Subpool and Length     @L1A 10208900
TCTASP   DS    BL1            - Subpool                            @L1A 10209000
TCTALN   DS    BL3            - Length                             @L1A 10209100
TCTARMD  DS    0CL80 -        TCT ARM Data                         @L1A 10209200
TCTARNM  DS    CL16           Element Name                         @L1A 10209300
TCTARTP  DS    CL8            Element Type                         @L1A 10209400
TCTARRG  DS    CL16           Restart Group for Element            @L1A 10209500
TCTARSN  DS    CL8            The system name for the system on    @L1A 10209600
*                             which the element was initially      @L1A 10209700
*                             started. blank, for the initial      @L1A 10209800
*                             start                                @L1A 10209900
TCTARGT  DS    F -            Time (local) Element requested       @L1A 10210000
*                             REGISTER Function, in hundredths of  @L1A 10210100
*                             a second                             @L1A 10210200
TCTARGD  DS    P -            Date Element requested REGISTER      @L1A 10210300
*                             Function, in the form 0cyydddF       @L1A 10210400
*                             (where 'F' is the sign)              @L1A 10210500
TCTARWT  DS    F -            Time (local) Element requested       @L1A 10210600
*                             WAITPRED function, in hundredths of  @L1A 10210700
*                             a second                             @L1A 10210800
*                             Note that this is the time that      @L1A 10210900
*                             the function was requested, not      @L1A 10211000
*                             satisfied.                           @L1A 10211100
*                             0, if the element has not            @L1A 10211200
*                             requested the function.              @L1A 10211300
TCTARWD  DS    P -            Date Element requested WAITPRED      @L1A 10211400
*                             function, in the following format:   @L1A 10211500
*                             0cyydddF (where 'F' is the sign)     @L1A 10211600
*                             0, if the element has not            @L1A 10211700
*                             requested the function.              @L1A 10211800
TCTARYT  DS    F -            Time (local) Element was READY,      @L1A 10211900
*                             in hundredths of a second            @L1A 10212000
*                             0, if the element is not yet READY   @L1A 10212100
TCTARYD  DS    P -            Date Element was READY, in the       @L1A 10212200
*                             following format:  0cyydddF (where   @L1A 10212300
*                             'F' is the sign)                     @L1A 10212400
*                             0, if the element is not yet READY   @L1A 10212500
TCTARTT  DS    F -            Time (local) Element was             @L1A 10212600
*                             DEREGISTERED, in hundredths of a     @L1A 10212700
*                             second                               @L1A 10212800
*                             0, if the element is not yet         @L1A 10212900
*                             DEREGISTERED or ended abnormally.    @L1A 10213000
TCTARTD  DS    P -            Date Element was DEREGISTERED, in    @L1A 10213100
*                             the following format:  0cyydddF      @L1A 10213200
*                             (where 'F' is the sign)              @L1A 10213300
*                             0, if the element is not yet         @L1A 10213400
*                             DEREGISTERED or ended abnormally.    @L1A 10213500
         MEND  , */                                                     10213600
*%TCTL2  :  ;                                                           10213700
*                                                                       10213800
*DECLARE                                                                10213900
*/********************************************************************/ 10214000
*/*                                                                  */ 10214100
*/*                                                                  */ 10214200
*/*                           TCT                                    */ 10214300
*/*                                                                  */ 10214400
*/*    THE TCT CONSISTS OF THE TCT COMMON SECTION (SMFTCT) AND TCT   */ 10214500
*/*    STORAGE TABLE (TCTCORE).  IT IS CREATED BY IEFSMFIE IN SUBPOOL*/ 10214600
*/*    255/KEY 0 AND RESIDES BELOW THE 16M LINE.                     */ 10214700
*/*                                                                  */ 10214800
*/*    The TCT OpenMVS Process Data Table is also a part of the  @L1A*/ 10214900
*/*    TCT - it is allocated by IEFSMFIE in subpool 255, key 0   @L1A*/ 10215000
*/*    and resides above the 16M line.                           @L1A*/ 10215100
*/*                                                                  */ 10215200
*/*    THE TCT ARM Data Table is also a part of the TCT.         @L1A*/ 10215300
*/*    It is allocated by IEFSMFIE in subpool 255, key 0         @L1A*/ 10215400
*/*    and resides above the 16M line.                           @L1A*/ 10215500
*/*                                                                  */ 10215600
*/*    THE SIZE OF THE TCT IS 604 BYTES.  THE COMMON SECTION IS  @06C*/ 10215700
*/*    552 BYTES AND THE STORAGE TABLE IS 52 BYTES.  ONE TCT     @06C*/ 10215800
*/*    IS CREATED PER ADDRESS SPACE.                                 */ 10215900
*/*                                                                  */ 10216000
*/*    THE TCT COMMON SECTION IS POINTED TO BY TCBTCT, OFFSET 164    */ 10216100
*/*    DECIMAL, OF THE TASK CONTROL BLOCK (TCB).  THE TCT STORAGE    */ 10216200
*/*    TABLE IS POINTED TO BY TCTCRTBL, OFFSET 8 DECIMAL, OF THE     */ 10216300
*/*    TCT COMMON SECTION.                                           */ 10216400
*/*                                                              @D9A*/ 10216500
*/********************************************************************/ 10216600
*  1 SMFTCT   BASED(TCBTCT) BDY(WORD),   /* START OF TCT             */ 10216700
*   2 TCTQA       CHAR(3) BDY(WORD),     /* QUEUE ADDRESS OF TCT     */ 10216800
*   2 TCTSW       BIT(8),                /* TCT SWITCHES             */ 10216900
*    3 TCTJSTI  BIT(1),                  /* TQE JOB/STEP TIME           10217000
*                                           INDICATOR.  IF 0, TQE       10217100
*                                           CONTAINS STEP TIME.  IF     10217200
*                                           1, TQE CONTAINS JOB TIME.*/ 10217300
*    3 TCTIEX   BIT(1),                  /* ERROR IN TCT I/O TABLE      10217400
*                                           I/O COUNTS  (OS/VS2)        10217500
*                                                              MDC017*/ 10217600
*    3 TCTISK30 BIT(1), /* TYPE 30 INTERVAL RECORD SKIPPED  @G743PJW*/  10217700
*    3 TCTISK32 BIT(1), /* TYPE 32 INTERVAL RECORD SKIPPED  @G743PJW*/  10217800
*    3 TCTIABD  BIT(1), /* PREVIOUS INTERVAL ABENDED        @G743PJW*/  10217900
*    3 TCTSTPRN BIT(1), /* STEP RAN INDICATOR. IF OFF AT END OF         10218000
*                         STEP, STEP WAS FLUSHED.           @ZMC1603*/  10218100
*    3 TCTACTRT BIT(1),                  /* IEFACTRT IN CONTROL         10218200
*                                           INDICATOR       @ZA90520*/  10218300
*    3 TCTDCOPN BIT(1),                  /* DMPCHCK RTN IN CONTROL      10218400
*                                           INDICATOR       @ZA93106*/  10218500
*   2 TCTTCB      PTR(31),               /* ADDRESS OF THE INITIATOR    10218600
*                                           TCB                      */ 10218700
*   2 TCTCRTBL    PTR(31),               /* ADDRESS OF THE TCT          10218800
*                                           STORAGE TABLE            */ 10218900
*   2 TCTIOTBL    PTR(31),               /* ADDRESS OF THE TCT I/O      10219000
*                                           TABLE.  TCT I/O TABLE IS    10219100
*                                           NOT NECESSARILY CONTIGUOUS  10219200
*                                           WITH THE TCT.            */ 10219300
*   2 TCTPOOL     FIXED(31),             /* SUBPOOL/LENGTH FOR TCT      10219400
*                                           PROPER                   */ 10219500
*    3 *           FIXED(15),            /* SUBPOOL IN WHICH THE TCT    10219600
*                                           RESIDES                  */ 10219700
*    3 TCTSZE      FIXED(15),            /* SIZE IN BYTES OF THE TCT    10219800
*                                           AND THE TCT STORAGE         10219900
*                                           TABLE                    */ 10220000
*   2 TCTUTL      PTR(31),               /* ADDRESS OF USER TIME        10220100
*                                           LIMIT ROUTINE            */ 10220200
*   2 TCTUDATA    PTR(31),               /* ADDRESS OF A ONE-WORD       10220300
*                                           PARAMETER LIST WHICH        10220400
*                                           POINTS TO THE JOB           10220500
*                                           MANAGEMENT RECORD (JMR)  */ 10220600
*   2 TCTJMR      PTR(31),               /* ADDRESS OF THE JOB          10220700
*                                           MANAGEMENT RECORD        */ 10220800
*   2 TCTRSV08    CHAR(4) BDY(WORD),     /* *** TCTUSO FIELD UNUSED     10220900
*                                           IN OS/VS ***             */ 10221000
*    3 TCTCPUS FIXED(31),                /* ACCUM SESSION CPU SERVICE   10221100
*                                           (OS/VS2)         @G50FPRL*/ 10221200
*   2 TCTJSTX     PTR(32),               /* AMOUNT OF TIME THAT JOB     10221300
*                                           OR STEP HAS BEEN EXTENDED   10221400
*                                           BY USER EXIT IEFUTL         10221500
*                                           (32-BIT UNSIGNED BINARY     10221600
*                                           NUMBER)  (OS/VS2)  MDC005*/ 10221700
*    3 TCTSTOF     FIXED(31),            /* OVERFLOW FIELD FOR          10221800
*                                           USER-SUPPLIED STEP TIME     10221900
*                                           EXTENSIONS (OS/VS1)         10222000
*                                                              MDC001*/ 10222100
*   2 TCTTJLM     PTR(32),               /* CONTAINS REMAINING JOB      10222200
*                                           TIME (32-BIT UNSIGNED       10222300
*                                           BINARY NUMBER)              10222400
*                                           (OS/VS2)           MDC006*/ 10222500
*    3 TCTSACT     FIXED(31),            /* A RUNNING TOTAL OF THE      10222600
*                                           USER-SUPPLIED STEP TIME     10222700
*                                           EXTENSIONS, EXPRESSED IN    10222800
*                                           TIMER UNITS (OS/VS1)        10222900
*                                                              MDC002*/ 10223000
*   2 TCTWLMT     FIXED(31),             /* THE JOB OR STEP MAXIMUM     10223100
*                                           WAIT TIME LIMIT AS          10223200
*                                           SPECIFIED IN SMFDEFLT,      10223300
*                                           EXPRESSED IN TIMER UNITS.   10223400
*                                           (OS/VS1)                    10223500
*                                           RESERVED - SET TO ZERO      10223600
*                                           (OS/VS2)           MDC016*/ 10223700
*    3 TCTIOCS FIXED(31),                /* ACCUM SESSION I/O SERVICE   10223800
*                                           (OS/VS2)         @G50FPRL*/ 10223900
*   2 TCTLIN      FIXED(31),             /* TSO - COUNT OF LINES OF     10224000
*                                           TERMINAL INPUT           */ 10224100
*   2 TCTLOUT     FIXED(31),             /* TSO - COUNT OF LINES OF     10224200
*                                           TERMINAL OUTPUT          */ 10224300
*   2 TCTAST      FIXED(31),             /* THE TIME OF DAY (TO ONE     10224400
*                                           HUNDREDTH OF A SECOND)      10224500
*                                           THAT DEVICE ALLOCATION      10224600
*                                           STARTED            ICB365*/ 10224700
*   2 TCTPPST     FIXED(31),             /* THE TIME OF DAY (TO ONE     10224800
*                                           HUNDREDTH OF A SECOND)      10224900
*                                           THAT THE PROBLEM PROGRAM    10225000
*                                           WAS INITIALLY LOADED INTO   10225100
*                                           MAIN STORAGE       ICB365*/ 10225200
*   2 TCTPGSMF    CHAR(20) BDY(WORD),    /* SMF PAGING AND TSO          10225300
*                                           STATISTICS (OS/VS1)         10225400
*                                                              MDC007*/ 10225500
*    3 TCTPGIN     FIXED(31),            /* TOTAL PAGE-INS FOR THIS     10225600
*                                           REGION (INCL/SWAP-INS)      10225700
*                                           (OS/VS1)           MDC007*/ 10225800
*     4 TCTAJS      FIXED(31),           /* ACCUMULATED SESSION         10225900
*                                           SERVICE TIME (OS/VS2)       10226000
*                                           (MDC019)           YM7459*/ 10226100
*    3 TCTPGOUT    FIXED(31),            /* TOTAL PAGE-OUTS FOR THIS    10226200
*                                           REGION (INCL/SWAP-OUTS)     10226300
*                                           (0S/VS1)           MDC008*/ 10226400
*     4 TCTACT      FIXED(31),           /* ACCUMULATED ACTIVE TIME     10226500
*                                           (OS/VS2)  (MDC020) YM7459*/ 10226600
*    3 TCTRGNS     FIXED(31),            /* TOTAL SWAPS PERFORMED FOR   10226700
*                                           THIS TSO USER (SWAP-INS +   10226800
*                                           SWAP-OUTS)                  10227000
*                                           (0S/VS1)           MDC009*/ 10227200
*     4 TCTATR      FIXED(31),           /* ACCUMULATED TRANSACTION     10227400
*                                           RESIDENCY TIME (OS/VS2)     10227600
*                                           (MDC302)         @Z40FP9A*/ 10227800
*    3 TCTSIN      FIXED(31),            /* TOTAL PAGES SWAPPED-IN      10228000
*                                           FOR THIS TSO USER           10228200
*                                           (0S/VS1)           MDC010*/ 10228400
*     4 TCTMSOS FIXED(31),               /* ACCUM MAIN STORAGE SERVICE  10228600
*                                           (OS/VS2)         @G50FPRL*/ 10228800
*    3 TCTSOUT     FIXED(31),            /* TOTAL PAGES SWAPPED-OUT     10229000
*                                           FOR THIS TSO USER           10229200
*                                           (0S/VS1)           MDC011*/ 10229400
*     4 TCTSRBS FIXED(31),               /* ACCUM SRB SERVICE (OS/VS2)  10229600
*                                                            @G50FPRL*/ 10229800
*    2 TCTPDASD    FIXED(31),            /* NUMBER OF MOUNTS FOR        10230000
*                                          NONSPECIFIC DASD @G742PJW*/  10230200
*    2 TCTRDASD    FIXED(31),            /* NUMBER OF MOUNTS FOR        10230400
*                                        SPECIFIC   DASD    @G742PJW*/  10230600
*    2 TCTPTAPE    FIXED(31),            /* NUMBER OF MOUNTS FOR        10230800
*                                        NONSPECIFIC TAPE   @G742PJW*/  10231000
*    2 TCTRTAPE    FIXED(31),            /* NUMBER OF MOUNTS FOR        10231200
*                                        SPECIFIC   TAPE    @G742PJW*/  10231400
*    2 TCTPMSS     FIXED(31),            /* NUMBER OF MOUNTS FOR        10231600
*                                        NONSPECIFIC MSS    @G742PJW*/  10231800
*    2 TCTRMSS     FIXED(31),            /* NUMBER OF MOUNTS FOR        10232000
*                                        SPECIFIC   MSS     @G742PJW*/  10232200
*    2 TCTEJST     FIXED(31),            /* LAST VALUE OF ELASPED       10232400
*                                         TCB TIME IN MSEC  @G742PJW*/  10232600
*    2 TCTSRBT     FIXED(31),            /* LAST VALUE OF ELAPSED       10232800
*                                         SRB TIME IN MSEC  @G742PJW*/  10233000
*    2 TCTSVTEP    FIXED(31),            /* LAST VALUE OF TOTAL BLOCK   10233200
*                                           COUNT           @G742PJW*/  10233400
*    2 TCTLINSV    FIXED(31),            /* LAST VALUE OF TGET COUNT    10233600
*                                                           @G742PJW*/  10233800
*    2 TCTLOUTS    FIXED(31),            /* LAST VALUE OF TPUT COUNT    10234000
*                                                           @G742PJW*/  10234200
*    2 TCTTRAN     FIXED(31),            /* LAST VALUE OF TRANSACTION   10234400
*                                           COUNT           @G742PJW*/  10234600
*    2 TCTITCB     FIXED(31),            /* INITIATOR TCB TIME      */  10234800
*    2 TCTISRB     FIXED(31),            /* INITIATOR SRB TIME      */  10235000
*    2 TCTT30J     PTR(31),              /* ADDRESS OF JOB TOTAL        10235200
*                                           TYPE 30 RECORD  @G742PJW*/  10235400
*    2 TCTT30S     PTR(31),              /* ADDRESS OF STEP TOTAL       10235600
*                                           TYPE 30 RECORD  @G742PJW*/  10235800
*    2 TCTT30H     PTR(31),              /* ADDRESS OF EXCP HOLD TYPE   10236000
*                                           30 RECORD       @G742PJW*/  10236200
*    2 TCTLCTAD    PTR(31),              /* ADDRESS OF LCT              10236400
*                                                           @G742PJW*/  10236600
*    2 TCTT32J     PTR(31),              /* ADDRESS OF JOB TOTAL        10236800
*                                           TYPE 32 RECORD  @G742PJW*/  10237000
*    2 TCTT32S     PTR(31),              /* ADDRESS OF STEP TOTAL       10237200
*                                           TYPE 32 RECORD  @G742PJW*/  10237400
*    2 TCT32SP     FIXED(31),          /* SUBPOOL AND SIZE OF TYPE 32   10237600
*                                        RECORD             @G742PJW*/  10237800
*      3  TCT32SPL FIXED(8),         /* SUBPOOL OF RECORD  @ZA44071*/   10238000
*      3  TCT32SIZ FIXED(24),        /* SIZE OF RECORDS    @ZA44071*/   10238200
*    2 TCT32BLK    PTR(31),            /* POINTER TO TYPE 32 DETAIL     10238400
*                                             CONTROL BLOCK  @VS49913*/ 10238600
*    2 TCTLRRCT    FIXED(31),          /* LAST VALUE OF THE ADDRESS     10238800
*                                           SPACE RE-READ COUNT  @D9C*/ 10239000
*    2 TCTIOSAV    PTR(31),            /* ADDRESS OF SAVE AREA FOR      10239200
*                                          IEASMFEX          @PCC0508*/ 10239400
*    2 TCTDCTI     FIXED(31),   /* SAVED VALUE OF TOTAL DEVICE CONNECT  10239600
*                                  TIME   @G860P27*/                    10239800
*    2 TCTTIMER    PTR(31),              /* ADDRESS OF SMF TIMER        10240000
*                                           ELEMENT         @G742PJW*/  10240200
*    2 TCTTMRSP    PTR(31),              /* SUBPOOL AND SIZE OF TIMER   10240400
*                                           ELEMENT         @G742PJW*/  10240600
*    2 TCTPARM     PTR(31),              /* ADDRESS OF SMF TIMER PARM   10240800
*                                           LIST            @G742PJW*/  10241000
*    2 TCTPRMSP    PTR(31),              /* SUBPOOL AND SIZE OF PARM    10241200
*                                           LIST            @G742PJW*/  10241400
*    2 TCTSNAME   CHAR(8) ,              /* STEP NAME FOR CURRENT STEP  10241600
*                                                           @VS49913*/  10241800
*    2 TCTTCT     CHAR(8),               /* TCT IDENTIFIER FIELD        10242000
*                                                           @G860P27*/  10242200
*    2 TCTMSCT  FIXED(31),          /* NUMBER OF TIMES I/O MEASUREMTS   10242400
*                                      HAVE BEEN TURNED OFF AT          10242600
*                                      JOB START            @G860P27*/  10242800
*       3 TCTMSOFF   BIT(1),        /* I/O MEASUREMENTS ON  @G860P27*/  10243000
*    2 TCTEIIP  FIXED(31),          /* ELAPSED I/O INTERRUPT            10243200
*                                      PROCESSING TIME           @LBC*/ 10243400
*    2 TCTERCT  FIXED(31),          /* ELPASED RCT CPU TIME      @LBC*/ 10243600
*    2 TCTRQSVP   PTR(31),          /* Ptr to storage for SRM sysevent  10243700
*                                      parameter list IRARQSRV.RQSV     10243800
*                                      Allocated by IEFSMFIE, freed by  10243900
*                                      IEFTB721.             @WLMPGMC*/ 10244000
*    2 TCTE39PP   PTR(31),          /* Ptr to storage for SRM sysevent  10244100
*                                      parameter list IRAE39P.E39P      10244200
*                                      Allocated by IEFSMFIE, freed by  10244300
*                                      IEFTB721.             @WLMPGMC*/ 10244400
*    2 TCTXR0DC CHAR( 4),           /* RESERVED              @WLMPGMC*/ 10244500
*    2 TCTADMFW FIXED(31),          /* Number of pages moved with ADMF  10244600
*                                      WRITE operation           @02A*/ 10244700
*    2 TCTADMFR FIXED(31),          /* Number of pages moved with ADMF  10244800
*                                      READ operation            @02A*/ 10244900
*    2 TCTEHPT  FIXED(31),          /* ELAPSED HIPERSPACE PROCESSING    10245000
*                                       TIME                     @LBC*/ 10245100
*                                   /*                           @LCD*/ 10245200
*                                   /*                           @LCD*/ 10245300
*                                   /*                           @LCD*/ 10245400
*                                   /*                           @LCD*/ 10245500
*                                   /*                           @LCD*/ 10245600
*    2 TCTEVFUT FIXED(31),          /* LAST VALUE OF STEP ELAPSED VF    10245700
*                                        USAGE TIME             @H4A*/  10245800
*    2 TCTEVFAT FIXED(31),          /* LAST VALUE ELAPSED VF AFFINITY   10245900
*                                        TIME                   @D6A*/  10246000
*    2 TCTIVFUT FIXED(31),          /* INITIATOR VS USAGE TIME  @H4A*/  10246200
*    2 TCTIVFAT FIXED(31),          /* INITIATOR VS AFFINITY TIME       10246400
*                                                               @D6A*/  10246600
*    2 TCTINTST FIXED(31),          /* INTERVAL START TIME      @L4A*/  10246800
*    2 TCTINTDT FIXED(31),          /* INTERVAL START DATE      @L4A*/  10247000
*    2 TCTEINFO,                    /* ETCTIOT INFORMATION      @Q8A*/  10247200
*      3 TCTFETIO PTR(31),          /* ADDRESS OF FIRST ETCTIOT @Q8C*/  10247400
*      3 TCTLETIO PTR(31),          /* ADDRESS OF LAST ETCTIOT  @Q8C*/  10247600
*      3 TCTESUBP FIXED(16),        /* ETCTIOT SUBPOOL          @Q8C*/  10247800
*      3 TCTELEN  FIXED(16),        /* LENGTH OF ETCTIOT ENTRY  @Q8C*/  10248000
*      3 TCTEBLK  FIXED(31),        /* NUMBER OF ETCTIOT BLOCKS @Q8C*/  10248200
*      3 TCTEFAVL FIXED(31),        /* FIRST AVAILABLE ENTRY    @Q8C*/  10248400
*      3 TCTELAVL FIXED(31),        /* LAST AVAILABLE ENTRY     @Q8C*/  10248600
*      3 TCTENAVL FIXED(31),        /* NUMBER OF AVAIL ENTRIES  @Q8C*/  10248800
*      3 TCTEFLGS CHAR(4),          /* ETCTIOT FLAGS            @Q8C*/  10249000
*        4 *       BIT(8),          /* ETCTIOT STATUS FLAGS     @Q8C*/  10249200
*          5 TCTCOMP BIT(1),        /* ON = TIOT BEING MOVED    @Q8C*/  10249400
*                                                                       10249800
*          5 TCTDUMMY BIT(1),     /* When set by IEFIB660, this flag    10250200
*                                    represents a Dummy TCTIOT.  It     10250600
*                                    will be checked by IEFDB4F9.@0AA*/ 10251000
*                                                                       10251400
*          5 *        BIT(6),     /* Not used and available.     @0AC*/ 10251800
*                                                                       10252200
*        4 TCTERSV1 CHAR(3),        /* RESERVED                  @Q8C*/ 10252600
*    2 TCTANSC  FIXED(31),          /* INTEGRATED CRYPTO SERVICE        10253000
*                                        COUNT                   @TEA*/ 10253400
*    2 TCTTMRFL   BIT(16),          /* PREVIOUS INTERVAL TIMER BIT      10254400
*                                      FLAGS                     @0KA*/ 10354400
*      3 TCTCTF   BIT(1),           /* SMF30CPT TIMER INVALID    @0KA*/ 10404400
*      3 TCTCSF   BIT(1),           /* SMF30CPS TIMER INVALID    @0KA*/ 10504400
*      3 TCTVUF   BIT(1),           /* SMF30JVU TIMER INVALID    @0KA*/ 10554400
*      3 TCTVAF   BIT(1),           /* SMF30JVA TIMER INVALID    @0KA*/ 10654400
*      3 TCTISF   BIT(1),           /* SMF30ISB TIMER INVALID    @0KA*/ 10704400
*      3 TCTICF   BIT(1),           /* SMF30ICU TIMER INVALID    @0KA*/ 10804400
*      3 TCTIVF   BIT(1),           /* SMF30IVU TIMER INVALID    @0KA*/ 10854400
*      3 TCTIAF   BIT(1),           /* SMF30IVA TIMER INVALID    @0KA*/ 10954400
*      3 TCTIIF   BIT(1),           /* SMF30IIP TIMER INVALID    @0KA*/ 11004400
*      3 TCTHPF   BIT(1),           /* SMF30HPT TIMER INVALID    @0KA*/ 11104400
*      3 TCTRCF   BIT(1),           /* SMF30RCT TIMER INVALID    @0KA*/ 11154400
*      3 TCTASF   BIT(1),           /* SMF30ASR TIMER INVALID    @L3A*/ 11191900
*      3 TCTENF   BIT(1),           /* SMF30ENC TIMER INVALID    @L3A*/ 11229400
*      3 TCTDEF   BIT(1),           /* SMF30DET timer invalid    @D3A*/ 11258500
*      3 *        BIT(2),           /* RESERVED                  @D3C*/ 11287600
*    2 TCTFLAGS   BIT(8),           /* TCT Flags                 @07A*/ 11316900
*      3 TCTTCT2  BIT(1),           /* DSABTCT2 should be used to       11366900
*                                      contain the offset to the        11416900
*                                      lookup table entry        @07A*/ 11466900
*      3 *        BIT(7),           /* Reserved                  @07A*/ 11516900
*    2 TCTSRMSP FIXED(8),           /* TctRqsvP/TctE39PP subpool        11566900
*                                                            @WLMPGMC*/ 11616900
*    2 TCTT33SP PTR(31),            /* Addr of Type 33 Work Area @DPA*/ 44386100
*    2 TCTT33J  PTR(31),            /* Addr of Type 33 JOB Rec   @DPA*/ 44386300
*    2 TCTT33S  PTR(31),            /* Addr of Type 33 STEPRec   @DPA*/ 44386500
*    2 TCTTPTYP FIXED(31),          /* APPC TP Type (Standard           44386700
*                                      or Multi-trans            @DPA*/ 44386900
*    2 TCTTPTCB FIXED(31),          /* Last Value of TP TCB Time @DPA*/ 44387100
*    2 TCTTPSRB FIXED(31),          /* Last Value of TP SRB Time @DPA*/ 44387300
*    2 TCTTPEXP FIXED(31),          /* Last Value of EXCP Count for     44387500
*                                      TP                        @DPA*/ 44387700
*    2 TCTTPDCT FIXED(31),          /* Last Value of Device Conn Time   44387900
*                                      for TP                    @DPA*/ 44388100
*    2 TCTTPNUM FIXED(31),          /* Number of Trans Processed @DPA*/ 44388300
*    2 TCTTPCON FIXED(31),          /* Number of Conversations   @DPA*/ 44438300
*    2 TCTTPTAC FIXED(31),          /* Number of Active Cons     @DPA*/ 44488300
*    2 TCTTPCNA FIXED(31),          /* Number of Allocated Cons  @DPA*/ 44538300
*    2 TCTTPSEN FIXED(31),          /* Number of Sends           @DPA*/ 44588300
*    2 TCTTPDAT CHAR(8),            /* Amount of Data Sent       @DPA*/ 44638300
*    2 TCTTPREC FIXED(31),          /* Number of Receives        @DPA*/ 44688300
*    2 TCTTPDAR CHAR(8),            /* Amount of Data Received   @DPA*/ 44738300
*    2 TCTSUBNM CHAR(4),            /* Scheduler of JOB          @DPA*/ 44788300
*    2 TCTOMVSP PTR(31),            /* Address of TCTOMVS Table  @LUA*/ 44792400
*    2 TCTT30PH PTR(31),            /* Address of T30AREA hold area     44796500
*                                      for process entries       @LUA*/ 44800600
*    2 TCTT30SE PTR(31),            /* Address of T30AREA hold area     44804700
*                                      for step EXEC entries     @LUA*/ 44808800
*    2 TCTT30SP PTR(31),            /* Address of T30AREA hold area     44812900
*                                      for step process entries  @LUA*/ 44817000
*    2 TCTT30JE PTR(31),            /* Address of T30AREA hold area     44821100
*                                      for job EXEC entries      @LUA*/ 44825200
*    2 TCTT30JP PTR(31),            /* Address of T30AREA hold area     44829300
*                                      for job process entries   @LUA*/ 44833400
*    2 TCTISS   CHAR(8),            /* SMF Interval Start Time          44835000
*                                      (STCK Format)             @DVA*/ 44836600
*    2 TCT30CN  FIXED(31),     /* Last Number of Conversations   @01A*/ 44836800
*    2 TCT30CNA FIXED(31),     /* Last Number of Allocated Cons  @01A*/ 44837000
*    2 TCT30SEN FIXED(31),     /* Last Number of Sends           @01A*/ 44837200
*    2 TCT30DAT CHAR(8),       /* Last Amount of Data Sent       @01A*/ 44837400
*    2 TCT30REC FIXED(31),     /* Last Number of Receives        @01A*/ 44837600
*    2 TCT30DAR CHAR(8),       /* Last Amount of Data Received   @01A*/ 44837800
*    2 TCT30ATR FIXED(31),     /* Last Number of Trans Processed @01A*/ 44838000
*    2 TCTUACL  FIXED(31),          /* Usage ACA Lockword        @04A*/ 44840400
*    2 TCTUACA  PTR(31),            /* Addr of first ACA for job @04A*/ 44842800
*    2 TCTUTCAC PTR(31),         /* Addr of 1st consolidated TCA @09C*/ 44847600
*    2 TCTUTCA  PTR(31),            /* Addr of first TCA         @04A*/ 44848800
*    2 TCTUFCAC PTR(31),         /* Addr of 1st consolidated FCA @08C*/ 44850000
*    2 TCTUFCA  PTR(31),            /* Addr of first FCA         @04A*/ 44852400
*    2 TCTRSMGT FIXED(32),          /* Usage RESMGR Token        @04A*/ 44854800
*    2 TCTUTIMR PTR(31),            /* Usage Timer Element       @04A*/ 44857200
*    2 TCTUTPRM PTR(31),            /* Usage Timer ParmArea      @04A*/ 44859600
*    2 TCTT30UH PTR(31),            /* Address of T30AREA hold area     44862000
*                                      for Usage entries         @05A*/ 44864400
*    2 TCTT30US PTR(31),            /* Addr of T30AREA Step hold area   44866800
*                                      for Usage entries         @05A*/ 44869200
*    2 TCTT30UJ PTR(31),            /* Addr of T30AREA Job hold area    44871600
*                                      for Usage entries         @05A*/ 44874000
*    2 TCTARMP  PTR(31), /* Address of TCTARM table              @L1A*/ 44874500
*    2 TCTT30AH PTR(31), /* Address of T30AREA for ARM Data      @L1A*/ 44875000
*    2 TCTT30SA PTR(31), /* Address of T30AREA for Step ARM Data @L1A*/ 44875500
*    2 TCTT30JA PTR(31), /* Address of T30AREA for Job ARM Data  @L1A*/ 44876000
*    2 TCTASST  FIXED(31),  /* Additional SRB Service Time       @L3A*/ 44876500
*    2 TCTECPT  FIXED(31),       /* Independent Enclave CPU Time @L3A*/ 44877000
*    2 TCTETIM  FIXED(31),  /* Enclave Transaction Active Time   @L3A*/ 44877500
*    2 TCTECPU  FIXED(31),  /* Enclave CPU Service Units         @L3A*/ 44878000
*    2 TCTETC   FIXED(31),  /* Enclave Transaction Count         @P5C*/ 44878300
*    2 TCTASSTC FIXED(31),  /* Additional SRB Service Time (Cumulative) 44878700
*                                                                @06A*/ 44878900
*    2 TCTECPTC FIXED(31),  /* Enclave CPU Time (Cumulative)            44879200
*                              including dependent enclaves      @D3C*/ 44879500
*    2 TCTDET   FIXED(31),         /* Dependent Enclave CPU Time @D3A*/ 44879800
*    2 TCT30AIC FIXED(32),         /* Saved copy of RQSVAIC      @D3A*/ 44880100
*    2 TCT30AID FIXED(32),         /* Saved copy of RQSVAID      @D3A*/ 44880400
*    2 TCT30AIW FIXED(32),         /* Saved copy of RQSVAIW      @D3A*/ 44880700
*    2 TCT30AIS FIXED(32),         /* Saved copy of RQSVAIS      @D3A*/ 44881000
*    2 TCT30EIC FIXED(32),         /* Saved copy of RQSVEIC      @D3A*/ 44881300
*    2 TCT30EID FIXED(32),         /* Saved copy of RQSVEID      @D3A*/ 44881600
*    2 TCT30EIW FIXED(32),         /* Saved copy of RQSVEIW      @D3A*/ 44881900
*    2 TCT30EIS FIXED(32),         /* Saved copy of RQSVEIS      @D3A*/ 44882200
*    2 TCTT30SR   PTR(31),         /* Address of STEP area for Remote   44882500
*                                     System Data entries.       @LAA*/ 44882600
*    2 TCTT30JR   PTR(31),         /* Address of JOB area for Remote    44882700
*                                     System Data entries.       @LAA*/ 44882800
*    2 *(1)     FIXED(31),          /* to doubleword boundary    @D3A*/ 44882900
*    2 TCTEND   CHAR(0);            /* END OF TCT MAPPING        @LOA*/ 44883000
*                                                                       44883900
*%TCTCOMZ = 'LENGTH(SMFTCT)';       /* GET LENGTH OF TCT COMMON         44888300
*                                      SECTION                      */  44938300
*                                                                       44988300
*                                                                       45038300
*/********************************************************************/ 45088300
*/*                                                                  */ 45138300
*/*                    TCT STORAGE TABLE                             */ 45188300
*/*                                                                  */ 45238300
*/*     A SEPARATE TABLE IS USED TO DESCRIBE THE STORAGE OBTAINED    */ 45288300
*/*     FOR A TASK.  THE STORAGE TABLE IS CONTIGUOUS TO THE TCT.     */ 45338300
*/*     IT IS POINTED TO BY THE TCTCRTBL FIELD IN THE TCT COMMON     */ 45388300
*/*     SECTION.                                                     */ 45438300
*/*                                                              @D9C*/ 45488300
*/********************************************************************/ 45538300
*DECLARE                                                                45588300
*  1 TCTCORE BASED(TCTCRTBL) BDY(WORD),  /* START OF TCT STORAGE        45638300
*                                           TABLE                    */ 45688300
*   2 TCTLWM      FIXED(31),        /* MAX VIRTUAL STORAGE IN USER      45738300
*                                      SUBPOOLS BELOW 16M        @P1C*/ 45788300
*   2 TCTHWM      FIXED(31),        /* MAX VIRTUAL STORAGE IN SWA AND   45838300
*                                      LSQA BELOW 16M            @P1C*/ 45888300
*   2 TCTMINC     FIXED(15),             /* THE MINIMUM DIFFERENCE      45938300
*                                           (IN 2K BLOCKS) BETWEEN      45988300
*                                           TCTLWM AND TCBHWM.  THIS    46038300
*                                           FIGURE REPRESENTS THE       46088300
*                                           UNUSED PORTION OF THE       46138300
*                                           USER'S REGION.           */ 46188300
*   2 TCTRSV00    FIXED(15),             /* RESERVED.  REGION FIELD     46238300
*                                           INCREASED TO A FULLWORD     46288300
*                                           AND MOVED TO THE END OF     46338300
*                                           TCT STORAGE TABLE    @PVC*/ 46388300
*   2 TCTRBA      PTR(31),               /* FOR A V=V PROBLEM PROGRAM,  46438300
*                                           LOWEST ADDRESS IN PRIVATE   46488300
*                                           AREA.  FOR A V=R PROBLEM    46538300
*                                           PROGRAM, LOWEST ADDRESS     46588300
*                                           IN REGION.  (OS/VS2)        46638300
*                                                              MDC012*/ 46688300
*                                                                       46738300
*   2 TCTEHWM    FIXED(31),         /* MAX VIRTUAL STORAGE IN SWA AND   46788300
*                                      LSQA ABOVE 16M            @P1C*/ 46838300
*   2 TCTELWM    FIXED(31),         /* MAX VIRTUAL STORAGE IN USER      46888300
*                                      SUBPOOLS ABOVE 16M        @P1C*/ 46938300
*   2 TCTRGNB    FIXED(31),             /*  PRIVATE AREA BELOW 16M      46988300
*                                           IN BYTES             @PVC*/ 47038300
*   2 TCTERGNB   FIXED(31),             /*  PRIVATE AREA ABOVE 16M      47088300
*                                           IN BYTES             @PVC*/ 47138300
*   2 TCTRSZ     FIXED(31),              /* THE ORIGINAL REGION         47188300
*                                           REQUEST IN 2K BLOCKS @PVM*/ 47238300
*   2 TCTRSV01 (4) FIXED(31);            /* RESERVED             @PVC*/ 47288300
*%TCTCREZ = 'LENGTH(TCTCORE)';           /* LENGTH OF THE TCT STORAGE   47338300
*                                           TABLE                @PVC*/ 47388300
*%TCTBIG = 'LENGTH(SMFTCT)+LENGTH(TCTCORE)'; /* COMBINED LENGTH OF      47438300
*                                           TCT COMMON SECTION AND TCT  47488300
*                                           STORAGE TABLE        @PVC*/ 47538300
*                                                                       47588300
*/********************************************************************/ 47638300
*/*                                                                  */ 47688300
*/*               TCT INPUT/OUTPUT MEASUREMENT TABLE                 */ 47738300
*/*                                                                  */ 47788300
*/*     THE TCT I/O MEASUREMENT TABLE (TCTTIOT) IS COMPOSED OF THE   */ 47838300
*/*     TCT I/O  LOOKUP TABLE AND THE TCT I/O COUNTER TABLE.  IT IS  */ 47888300
*/*     USED TO COLLECT I/O MEASUREMENTS AT THE DD LEVEL.  THE       */ 47938300
*/*     TCTTIOT IS NOT CONTIGIOUS TO THE TCT.  THE TCTIOTBL FIELD    */ 47988300
*/*     IN THE TCT COMMON SECTION POINTS TO THE TCTTIOT.             */ 48038300
*/*                                                                  */ 48088300
*/*     THE TCTTIOT IS CREATED BY IEFIB660 IN SUBPOOL 255/KEY 0      */ 48138300
*/*     AND RESIDES BELOW THE 16M LINE.                              */ 48188300
*/*                                                                  */ 48238300
*/*     THE TCT I/O LOOKUP TABLE CONTAINS 1 COMMON SECTION AND A     */ 48288300
*/*     DD LOOKUP TABLE.  THE DD LOOKUP TABLE IS AN ARRAY WITH       */ 48338300
*/*     EACH ELEMENT REPRESENTING ONE DD ENTRY IN THE TIOT (IEFTIOT).*/ 48388300
*/*     SMF REFERENCES THESE DD LOOK-UP ENTRIES TO FIND THE FIRST    */ 48438300
*/*     DEVICE ENTRY IN THE TCT I/O COUNTER TABLE ASSOCIATED WITH    */ 48488300
*/*     A PARTICULAR DD.                                             */ 48538300
*/*                                                                  */ 48588300
*/*     THE TCT I/O COUNTER TABLE CONSISTS OF ONE DD ENTRY PER       */ 48638300
*/*     ENTRY IN THE DD LOOK-UP TABLE.  EACH DD ENTRY CONSISTS OF    */ 48688300
*/*     1 OR MORE 24 BYTE DEVICE ENTRIES WHICH REPRESENT THE UCBS    */ 48738300
*/*     ASSOCIATED WITH THE DD.  THERE IS ONE 8 BYTE OUTPUT LIMIT    */ 48788300
*/*     EXTENSION WHICH IS USED BY GPD.                              */ 48838300
*/*                                                                  */ 48888300
*/*     THE SIZE OF THE TCTTIOT IS DEPENDENT ON THE NUMBER OF        */ 48938300
*/*     DDS PER JOB.  THERE IS 1 DD LOOKUP TABLE PER DD AND          */ 48988300
*/*     1 DEVICE ENTRY PER DEVICE (UCB) PER DD.                      */ 49038300
*/*                                                                  */ 49088300
*/********************************************************************/ 49138300
*                                                                       49188300
*/********************************************************************/ 49238300
*/*                                                                  */ 49288300
*/*      TCT I/O LOOKUP TABLE  (ONE TABLE PER DD)                    */ 49338300
*/*                                                                  */ 49388300
*/********************************************************************/ 49438300
*DECLARE                                                                49488300
*                                                                       49538300
*  1 TCTTIOT BASED(TCTIOTBL) BDY(WORD),  /* START OF TCT I/O TABLE   */ 49588300
*   2 TCTPLEXT    FIXED(31),             /* SUBPOOL/LENGTH OF TCT       49638300
*                                           I/O TABLE                */ 49688300
*    3 *           FIXED(8),            /* SUBPOOL IN WHICH THE TCT     49738300
*                                          I/O TABLE RESIDES @G860P27*/ 49788300
*    3 TCTSZEXT    FIXED(24),            /* SIZE IN BYTES OF TCT I/O    49838300
*                                           TABLE            @ZA52714*/ 49888300
*   2 TCTSZLKP    FIXED(31);             /* NUMBER OF DEVICE ENTRIES    49938300
*                                           IN THE TCT I/O LOOKUP       49988300
*                                           TABLE TIMES 24   @G860P27*/ 50038300
*%TCTCOMIO = 'LENGTH(TCTTIOT)';          /* LENGTH OF TCT I/O TABLE     50088300
*                                           COMMON SECTION           */ 50138300
*                                                                       50188300
*/********************************************************************/ 50238300
*/*                                                                  */ 50288300
*/*      DD LOOKUP TABLE ENTRY (ONE ENTRY PER DD ENTRY IN THE TIOT)  */ 50338300
*/*                                                                  */ 50388300
*/********************************************************************/ 50438300
*                                                                       50488300
*DECLARE                                                                50538300
*%IF TCTLUEPT=''  %THEN                                                 50588300
*    %GOTO TCTA1;                                                       50638300
*  1 TCTIODSP (*) BASED(TCTLUEPT) BDY(WORD),              /* @G743PJW*/ 50688300
*%GOTO TCTA3;                                                           50738300
*%TCTA1 : ;                                                             50788300
*%IF IKEPLS='2' %THEN                                                   50838300
*    %GOTO TCTA2;                                                       50888300
*  1 TCTIODSP (*) BASED(ADDR(TCTPLEXT)+8) BDY(WORD),      /* @G743PJW*/ 50938300
*%GOTO TCTA3;                                                           50988300
*%TCTA2 : ;                                                             51038300
*  1 TCTIODSP (*) DEF(TCTPLEXT) POS(9) BDY(WORD),         /* @G743PJW*/ 51088300
*%TCTA3 : ;                                                             51138300
*                                        /* BEGINNING OF DD LOOKUP      51188300
*                                           TABLE ENTRY              */ 51238300
*   2 TCTDCBTD    FIXED(31),             /* OFFSET FROM THE TIOT ORIGIN 51288300
*                                           TO THE TIOT ENTRY FOR THE   51338300
*                                           DD STATEMENT ASSOCIATED     51388300
*                                           WITH THE ACCESSED DATA SET  51438300
*                                           NOTE: THE TIOT ENTRIES MAY  51488300
*                                           -NOT- BE CONTIGUOUS. @0CC*/ 51538300
*   2 TCTIOTSD    FIXED(31);             /* OFFSET FROM THE TCT I/O     51588300
*                                           TABLE ORIGIN TO THE DD      51638300
*                                           ENTRY, WITHIN THE TCT I/O   51688300
*                                           COUNTER TABLE, ASSOCIATED   51738300
*                                           WITH THE ACCESSED DATA      51788300
*                                           SET              @G860P27*/ 51838300
*%TCTLLTE='LENGTH(TCTIODSP)';/* LENGTH DD LOOKUP TABLE ENTRY @G743PJW*/ 51888300
*DECLARE                                                  /* @G743PJW*/ 51938300
* 1 TCTLTEE       DEF(TCTIODSP) POS(9) BDY(WORD),         /* @ZMC2725*/ 51988300
*   2 TCTDCBLE    FIXED(31);             /* END OF TCT I/O LOOKUP       52038300
*                                           TABLE (ZEROS)    @G743PJW*/ 52088300
*                                                                       52138300
*/********************************************************************/ 52188300
*/*                                                                  */ 52238300
*/*      TCT I/O COUNTER TABLE  (ONE ENTRY PER DD ENTRY IN THE       */ 52288300
*/*                              DD LOOK-UP TABLE)                   */ 52338300
*/*                                                                  */ 52388300
*/********************************************************************/ 52438300
*                                                                       52488300
*/********************************************************************/ 52538300
*/*                                                                  */ 52588300
*/*      DEVICE ENTRY  (ONE ENTRY PER DEVICE (UCB) PER DD)           */ 52638300
*/*                                                                  */ 52688300
*/* IEFAB428 and IEFAB4FC map TCTDDENT using TCDDENTR.  Therefore,   */ 52696600
*/* whenever TCTDDENT is modified, the definition of TCDDENTR in     */ 52704900
*/* both IEFAB428 and IEFAB4FC must also be modified to reflect      */ 52713200
*/* the changes.                                                 @P6A*/ 52721500
*/*                                                                  */ 52729800
*/********************************************************************/ 52738300
*                                                                       52788300
*DECLARE                                                                52838300
*%IF TCTCTEPT=''  %THEN                                                 52888300
*    %GOTO TCTA4;                                                       52938300
*  1 TCTDDENT (*) BASED(TCTCTEPT) BDY(WORD),              /* @G743PJW*/ 52988300
*%GOTO TCTA6;                                                           53038300
*%TCTA4 : ;                                                             53088300
*%IF IKEPLS='2'  %THEN                                                  53138300
*    %GOTO TCTA5;                                                       53188300
*  1 TCTDDENT (*) BASED(ADDR(TCTDCBLE)+4) BDY(WORD),      /* @G743PJW*/ 53238300
*%GOTO TCTA6;                                                           53288300
*%TCTA5 : ;                                                             53338300
*  1 TCTDDENT (*) DEF(TCTDCBLE) POS(5) BDY(WORD),         /* @G743PJW*/ 53388300
*%TCTA6 : ;                                                             53438300
*                                        /* BEGINNING OF I/O COUNTER    53488300
*                                           TABLE DEVICE ENTRY       */ 53538300
*   2 TCTUCBP     PTR(31),               /* ADDRESS OF THE UCB          53588300
*                                           ASSOCIATED WITH THIS        53638300
*                                           DEVICE           @G860P27*/ 53688300
*   2 TCTSCTR     PTR(8),                /* NUMBER OF DEVICES           53738300
*                                           ASSOCIATED WITH THIS DD     53788300
*                                           STATEMENT.  THIS NUMBER     53838300
*                                           REPRESENTS THE NUMBER OF    53888300
*                                           DEVICE ENTRIES WITHIN       53938300
*                                           THIS DD ENTRY.  THIS        53988300
*                                           FIELD CONTAINS ZEROS IN     54038300
*                                           ALL BUT ITS FIRST           54088300
*                                           APPEARANCE IN ANY DD        54138300
*                                           ENTRY.                      54188300
*                                           'FF'X INDICATES SYSIN       54238300
*                                           DATA SET (OS/VS1). ICB375*/ 54288300
*   2 TCTFLGS     BIT(8),                /* FLAG BYTE          MDC013*/ 54338300
*    3 TCTDDIND BIT(1),                  /* END OF CONCATENATED DD      54388300
*                                           STRING (OS/VS1)    MDC014*/ 54438300
*    3 TCTVAMDS BIT(1),                  /* VAM DATA SET ENTRY.         54488300
*                                           TCTUCBP FIELD IS ZERO       54538300
*                                           WHEN THIS BIT IS ONE.       54588300
*                                                              MDC015*/ 54638300
*    3 TCTNOCNT BIT(1),                  /* IF ON, DO NOT COUNT THE     54688300
*                                           EXCP (OS/VS1)               54738300
*                                           (MDC301)         @XA09673*/ 54788300
*    3 TCTRSV22 BIT(1),                  /* RESERVED                 */ 54838300
*    3 TCTRSV23 BIT(1),                  /* RESERVED                 */ 54888300
*    3 TCTRSV24 BIT(1),                  /* RESERVED                 */ 54938300
*    3 TCTRSV25 BIT(1),                  /* RESERVED                 */ 54988300
*    3 TCTRSV26 BIT(1),                  /* RESERVED                 */ 55038300
*   2 TCTBLKSZ    FIXED(16),             /* BLOCK SIZE FOR THIS         55088300
*                                           DD            @G742PJW*/    55138300
*     3 TCTCBSZ   BIT(1),                /* CHANGED BLOCK SIZE FLAG     55188300
*                                                         @G742PJW*/    55238300
*     3 TCTRSV27  BIT(15),               /* BLKSIZE       @G742PJW*/    55288300
*   2 TCTDCTR     FIXED(31),             /* COUNTER FOR EXCP'S ISSUED   55338300
*                                           AGAINST THIS UCB (DEVICE)*/ 55388300
*   2 TCTDCTRS    FIXED(31),             /* SAVED EXCP COUNT @G860P27*/ 55438300
*   2 TCTCONN     FIXED(31),             /* DEVICE CONNECT TIME         55488300
*                                                            @G860P27*/ 55538300
*   2 TCTCONNS    FIXED(31),             /* SAVED DEVICE CONNECT TIME   55577100
*                                                                @LDC*/ 55615900
*   2 TCTXBLKS    CHAR(8);               /* BLOCKSIZE GREATER THAN 32K  55654900
*                                                                @LDA*/ 55671500
*   %TCTDDLEN='LENGTH(TCTDDENT)';        /*                  @G743PJW*/ 55688300
*                                                                       55738300
*/********************************************************************/ 55788300
*/*                                                                  */ 55838300
*/*      OUTPUT LIMIT EXTENSION                                      */ 55888300
*/*                                                                  */ 55938300
*/********************************************************************/ 55988300
*                                                                       56038300
*DECLARE                                                  /* @G743PJW*/ 56088300
* 1 TCTOLE        DEF(TCTCONNS) POS(5) BDY(WORD),         /* @PCC0790*/ 56138300
*   2 TCTRSV10    CHAR(4),               /* *** TCTOUTLM FIELD UNUSED   56188300
*                                           IN OS/VS ***     @G743PJW*/ 56238300
*   2 TCTEXRLD    PTR(8),                /* A BINARY NUMBER OF          56288300
*                                           EXTENTS RELEASED BY THE     56338300
*                                           DADSM RELEASE ROUTINE.      56388300
*                                           COLLECTED ONLY IF RLSE      56438300
*                                           WAS SPECIFIED IN THE        56488300
*                                           SPACE PARAMETER FOR THIS    56538300
*                                           DATA SET.                */ 56588300
*   2 TCTTKRLD    PTR(24);               /* A BINARY NUMBER OF TRACKS   56638300
*                                           RELEASED BY THE DADSM       56688300
*                                           RELEASE ROUTINE.            56738300
*                                           COLLECTED ONLY IF RLSE      56788300
*                                           WAS SPECIFIED IN THE        56838300
*                                           SPACE PARAMETER FOR THIS    56888300
*                                           DATA SET.                */ 56938300
*%TCTLOLE='LENGTH(TCTOLE)';  /* LENGTH OF OUTPUT LIMIT EXT. @G743PJW */ 56988300
*/********************************************************************/ 57038300
*/*                                                                  */ 57088300
*/*               EXTENDED TCTIOT CONTROL BLOCK                      */ 57138300
*/*                                                                  */ 57188300
*/* THE ETCTIOT IS A CHAIN OF 4K BLOCKS.  EACH 4K BLOCK CONSISTS OF  */ 57238300
*/* A 16 BYTE HEADER AND AN ARRAY OF A MAXIMUM OF 340 ELEMENTS.  EACH*/ 57288300
*/* ELEMENT IS 12 BYTES IN LENGTH AND REPRESENTS A DD ENTRY IN       */ 57338300
*/* THE TCTTIOT.                                                     */ 57388300
*/*                                                                  */ 57438300
*/* THE ETCTIOT IS NOT CONTIGUOUS TO THE TCT COMMON SECTION OR THE   */ 57488300
*/* TCTTIOT.  THE FIRST ETCTIOT IS POINTED TO BY THE TCTFETIO        */ 57538300
*/* FIELD IN THE TCT COMMON SECTION.  ADDITIONAL FIELDS EXIST IN     */ 57588300
*/* THE TCT COMMON SECTION WHICH DESCRIBE THE ETCTIOT CHAIN.         */ 57638300
*/*                                                                  */ 57688300
*/* THE ETCTIOT IS CREATED BY IEFIB660 IN SUBPOOL 255 AND KEY 0.     */ 57738300
*/* THE CHAIN RESIDES ABOVE THE 16M LINE.                            */ 57788300
*/*                                                                  */ 57838300
*/* THERE IS 1 ETCTIOT CHAIN PER ADDRESS SPACE.  THE SIZE OF THE     */ 57888300
*/* CHAIN IS BASED ON THE NUMBER OF DDS PER JOB:                     */ 57938300
*/*                                                                  */ 57988300
*/*      MINUMUM CHAIN =  1 4K BLOCK  (1*4096 = 4096 BYTES)          */ 58038300
*/*      AVERAGE CHAIN =  1 4K BLOCK  (AVERAGE JOB < 100 DDS)        */ 58088300
*/*     *MAXIMUM CHAIN = 10 4K BLOCKS (10*4096 = 40,960 BYTES)       */ 58138300
*/*                                                                  */ 58188300
*/* * = MAXIMUM CHAIN IS BASED ON 3273 DDS                           */ 58238300
*/*                                                              @D9A*/ 58288300
*/********************************************************************/ 58338300
*                                                                       58388300
*DECLARE                            /*                          @D9A*/  58438300
*/*******************************************************************/  58488300
*/*                                                                 */  58538300
*/*      ETCTIOT HEADER  (ONE HEADER PER BLOCK)                     */  58588300
*/*                                                                 */  58638300
*/*******************************************************************/  58688300
* 1 ETCTIOT  BASED(TCTFETIO),       /* EXTENDED TCTIOT          @D9A*/  58738300
*   2 ETCTHDR,                      /* ETCTIOT HEADER SECTION   @D9A*/  58788300
*     3 ETCTID   CHAR(7),           /* ETCTIOT IDENTIFIER       @D9A*/  58838300
*     3 ETCTVER  CHAR(1),           /* ETCTIOT VERSION NUMBER   @D9A*/  58888300
*     3 ETCTFCHN PTR(31),           /* NEXT ETCTIOT ENTRY       @D9A*/  58938300
*     3 ETCTBCHN PTR(31),           /* PREVIOUS ETCTIOT ENTRY   @D9A*/  58988300
*/*******************************************************************/  59038300
*/*                                                                 */  59088300
*/*     ETCTIOT ELEMENT (MAXIMUM OF 340 12 BYTE ELEMENTS PER BLOCK) */  59138300
*/*                                                                 */  59188300
*/*******************************************************************/  59238300
*   2 ETCTNTRY(*),                  /* ETCTIOT DD ENTRY         @D9A*/  59288300
*     3 ETCTNEXT FIXED(31),         /* NEXT ENTRY               @D9A*/  59338300
*       4 ETCTIUSE BIT(1),         /* IN USE FLAG (ON = IN USE) @D9A*/  59388300
*       4 *        BIT(31),         /* RESERVED                 @D9A*/  59438300
*     3 ETCTDSAB PTR(31),           /* DSAB ADDRESS OF ENTRY    @D9A*/  59488300
*     3 ETCTSTIO FIXED(31);         /* TCTIOT DD LOOKUP ENTRY   @D9A*/  59538300
*                                                                       59588300
*DECLARE                            /*                          @D9A*/  59638300
* ETCTBKID CHAR(7) CONSTANT('ETCTIOT'), /*ETCTIOT EBCDIC NAME   @D9A*/  59688300
* ETCTVER1 BIT(8)  CONSTANT('01'X);    /*INITIAL VERSION NUMBER @D9A*/  59738300
*                                                                       59788300
*/********************************************************************/ 59838300
*/*                                                                  */ 59888300
*/*               TCTOMVS - OpenMVS Process Data Table           @P2C*/ 59938300
*/*                                                                  */ 59988300
*/*    The OpenMVS Process Data Table is 104 bytes.              @L8C*/ 59991600
*/*    Size should always be a multiple of 8.                    @P4A*/ 59994900
*/*                                                                  */ 59998300
*/*    THE TCT OpenMVS PROCESS DATA TABLE (TCTOMVS) IS POINTED   @P2C*/ 60003300
*/*    TO BY TCTOMVSP IN THE TCT COMMON SECTION.                 @LUA*/ 60008300
*/*                                                                  */ 60013300
*/*    THE TCT OpenMVS PROCESS DATA TABLE IS ALSO A PART OF THE  @P2C*/ 60018300
*/*    TCT - IT IS ALLOCATED BY IEFSMFIE IN SUBPOOL 255, KEY 0   @LUA*/ 60023300
*/*    AND RESIDES ABOVE THE 16M LINE.                           @LUA*/ 60028300
*/*                                                                  */ 60033300
*/********************************************************************/ 60038300
*                                                                       60088300
*DECLARE                            /*                           @LUA*/ 60138300
* 1 TCTOMVS BASED(TCTOMVSP) BDY(DWORD), /* OpenMVS Process Data  @P4C*/ 60170400
*   3 TCTOMVSH,                   /* TCT OpenMVS Header Section  @03A*/ 60202500
*     5 TCTOID   CHAR(4),           /* Control Block ID - 'TCTO' @03C*/ 60236700
*     5 TCTOSPLN FIXED(32),         /* Block Subpool/Length      @03C*/ 60270900
*       7 TCTOSP FIXED(8),          /* - Subpool                 @03C*/ 60305100
*       7 TCTOLN FIXED(24),         /* - Length                  @03C*/ 60339300
*   3 TCTOMVSD,                     /* TCT OpenMVS Data Section  @03A*/ 60373500
*     5 TCTOPI   FIXED(32),         /* Process ID                @03C*/ 60407700
*     5 TCTOPG   FIXED(32),         /* Process Group ID          @03C*/ 60441900
*     5 TCTOUI   FIXED(32),         /* Process User ID           @03C*/ 60476100
*     5 TCTOUG   FIXED(32),         /* Process User Group ID     @03C*/ 60510300
*     5 TCTOSI   FIXED(32),         /* Process Session ID        @03C*/ 60544500
*     5 TCTOSC   FIXED(32),         /* Number of syscalls requested     60578700
*                                                                @03C*/ 60612900
*     5 TCTOST   FIXED(32),         /* Total CPU Time accumulated by    60647100
*                                      the syscalls requested    @03C*/ 60681300
*     5 TCTODR   FIXED(32),         /* Number of Directory I/O          60715500
*                                      blocks read               @03C*/ 60749700
*     5 TCTOFR   FIXED(32),         /* Number of I/O blocks read        60783900
*                                      for standard files        @03C*/ 60818100
*     5 TCTOFW   FIXED(32),         /* Number of I/O blocks             60852300
*                                      written for standard files       60887300
*                                                                @03C*/ 60919700
*     5 TCTOPR   FIXED(32),         /* Number of I/O blocks read        60952100
*                                      for pipe files            @03C*/ 60984500
*     5 TCTOPW   FIXED(32),         /* Number of I/O blocks             61016900
*                                      written for pipe files    @03C*/ 61049300
*     5 TCTOSR   FIXED(32),         /* Number of I/O blocks read        61081700
*                                      for special files         @03C*/ 61114100
*     5 TCTOSW   FIXED(32),         /* Number of I/O blocks             61146500
*                                      written for special files @03C*/ 61178900
*     5 TCTOLL   FIXED(32),         /* Number of path name Look calls   61211300
*                                    to the logical file system  @03C*/ 61243700
*     5 TCTOLP   FIXED(32),         /* Number of path name Look calls   61276100
*                                    to the physical file system @03C*/ 61308500
*     5 TCTOGL   FIXED(32),         /* Number of path name generation   61340900
*                                    calls to the logical file system   61373500
*                                                                @03C*/ 61411700
*     5 TCTOGP   FIXED(32),         /* Number of path name generation   61449900
*                                    calls to the physical file system  61488300
*                                                                @03C*/ 61532700
*     5 TCTOPP   FIXED(32),/* OpenMVS parent process ID number   @03C*/ 61577100
*     5 TCTOKR   FIXED(32),/* Number of I/O blocks read for Remote      61621500
*                             socket by the process              @03C*/ 61665900
*     5 TCTOKW   FIXED(32),/* Number of I/O blocks written for          61710300
*                             Remote socket by the process       @03C*/ 61754700
*     5 TCTOMS   FIXED(32),/* Number of message queues bytes sent       61763900
*                                                                @L8A*/ 61773100
*     5 TCTOMR   FIXED(32),/* Number of message queues bytes received   61782300
*                                                                @L8A*/ 61791500
*     5 TCTOSY   FIXED(32),/* Number of sync() function calls    @L9C*/ 61800700
*   3 TCTOEND  CHAR(0) BDY(DWORD);  /* End of TCTOMVS Table      @P4C*/ 61810300
*                                                                       61838300
*/********************************************************************/ 61888300
*/*                                                                  */ 61938300
*/*               TCTOMVS - Constants                            @LUA*/ 61988300
*/*                                                                  */ 62038300
*/********************************************************************/ 62088300
*                                                                       62138300
*DECLARE                            /*                           @LUA*/ 62188300
* TCTOIDC  CHAR(4) CONSTANT('TCTO');  /* Control Block ID for           62188400
*                                        TCTOMVS table           @LUA*/ 62188500
*                                                                       62188600
*/********************************************************************/ 62188700
*/*                                                                  */ 62188800
*/*               TCTARM - TCT ARM Data Table                    @L1A*/ 62188900
*/*                                                                  */ 62189000
*/*    The ARM data table is 88 bytes.                           @L1A*/ 62189100
*/*                                                                  */ 62189200
*/*    The TCT ARM Data Table (TCTARM) is pointed to by          @L1A*/ 62189300
*/*    TCTARMP in the TCT common section.                        @L1A*/ 62189400
*/*                                                                  */ 62189500
*/*    THE TCT ARM Data Table is also a part of the TCT.         @L1A*/ 62189600
*/*    It is allocated by IEFSMFIE in subpool 255, key 0         @L1A*/ 62189700
*/*    and resides above the 16M line.                           @L1A*/ 62189800
*/*                                                                  */ 62189900
*/********************************************************************/ 62190000
*                                                                       62190100
*DECLARE                            /*                           @L1A*/ 62190200
* 1 TCTARM BASED(TCTARMP) BDY(DWORD), /* TCT ARM Table           @P4C*/ 62190300
*   3 TCTAID   CHAR(4),             /* Control Block ID - 'TCTA' @L1A*/ 62190400
*   3 TCTASPLN FIXED(32),           /* Block Subpool/Length      @L1A*/ 62190500
*     5 TCTASP FIXED(8),            /* - Subpool                 @L1A*/ 62190600
*     5 TCTALN FIXED(24),           /* - Length                  @L1A*/ 62190700
*   3 TCTARMD,                      /* TCT ARM Data              @L1A*/ 62190800
*     5 TCTARNM CHAR(16),           /* Element Name              @L1A*/ 62190900
*     5 TCTARTP CHAR(8),            /* Element Type              @L1A*/ 62191000
*     5 TCTARRG CHAR(16),           /* Restart Group for Element @L1A*/ 62191100
*     5 TCTARSN CHAR(8),           /* The system name for the system on 62191200
*                                     which the element was initially   62191300
*                                     started. blank, for the initial   62191400
*                                     start                      @L1A*/ 62191500
*     5 TCTARGT FIXED(31),       /* Time (local) Element requested      62191600
*                                   REGISTER Function, in hundredths of 62191700
*                                   a second                     @L1A*/ 62191800
*     5 TCTARGD FIXED(31),          /* Date Element requested REGISTER  62191900
*                                      Function, in the form 0cyydddF   62192000
*                                      (where 'F' is the sign)   @L1A*/ 62192100
*     5 TCTARWT FIXED(31),      /* Time (local) Element requested       62192200
*                                  WAITPRED function, in hundredths of  62192300
*                                  a second                             62192400
*                                  Note that this is the time that      62192500
*                                  the function was requested, not      62192600
*                                  satisfied.                           62192700
*                                  0, if the element has not            62192800
*                                  requested the function.       @L1A*/ 62192900
*     5 TCTARWD FIXED(31),      /* Date Element requested WAITPRED      62193000
*                                  function, in the following format:   62193100
*                                  0cyydddF (where 'F' is the sign)     62193200
*                                  0, if the element has not            62193300
*                                  requested the function.       @L1A*/ 62193400
*     5 TCTARYT FIXED(31),      /* Time (local) Element was READY,      62193500
*                                  in hundredths of a second            62193600
*                            0, if the element is not yet READY  @L1A*/ 62193700
*     5 TCTARYD FIXED(31),      /* Date Element was READY, in the       62193800
*                                  following format:  0cyydddF (where   62193900
*                                  'F' is the sign)                     62194000
*                            0, if the element is not yet READY  @L1A*/ 62194100
*     5 TCTARTT FIXED(31),      /* Time (local) Element was             62194200
*                                  DEREGISTERED, in hundredths of a     62194300
*                                  second                               62194400
*                                  0, if the element is not yet         62194500
*                            DEREGISTERED or ended abnormally.   @L1A*/ 62194600
*     5 TCTARTD FIXED(31),      /* Date Element was DEREGISTERED, in    62194700
*                                  the following format:  0cyydddF      62194800
*                                  (where 'F' is the sign)              62194900
*                                  0, if the element is not yet         62195000
*                            DEREGISTERED or ended abnormally.   @L1A*/ 62195100
*   3 TCTAEND  CHAR(0) BDY(DWORD);  /* End of TCTARM Table       @P4C*/ 62195200
*                                                                       62195300
*/********************************************************************/ 62195400
*/*                                                                  */ 62195500
*/*               TCTARM  - Constants                            @L1A*/ 62195600
*/*                                                                  */ 62195700
*/********************************************************************/ 62195800
*                                                                       62195900
*DECLARE                            /*                           @L1A*/ 62196000
* TCTAIDC  CHAR(4) CONSTANT('TCTA');  /* Control Block ID for           62196100
*                                        TCTARM table            @L1A*/ 62196200
*                                                                       62198300
*/********************************************************************/ 62203300
*/*                                                                  */ 62208300
*/*               T30AREA - SMF Type 30 Hold Area                @LUA*/ 62213300
*/*                                                                  */ 62218300
*/********************************************************************/ 62223300
*                                                                       62228300
*DECLARE                            /*                           @LUA*/ 62233300
* 1 T30AREA BASED BDY(WORD),        /* Type 30 Hold Area         @LUA*/ 62238300
*   3 T30LDR,                       /* Header Section            @LUA*/ 62288300
*     5 T30SPSZ  FIXED(31),         /* Subpool and Len of Area   @LUA*/ 62338300
*       7 T30SP    FIXED(8),        /* - Subpool                 @LUA*/ 62388300
*       7 T30LNG   FIXED(24),       /* - Length                  @LUA*/ 62438300
*     5 T30NXT  PTR(31),            /* Ptr to Next Record Area   @LUA*/ 62488300
*   3 T30RECD  CHAR(*);             /* Type 30 Record Area       @LUA*/ 62538300
*                                                                       62588300
