* % GOTO MWAPRO;   /*                                                   00050000
         MACRO                                                          00100000
         IEFVMMWA                                                       00150000
.*/ %MWAPRO: ;     /*                                                */ 00200000
*/********************************************************************/ 00250000
*/* MODULE NAME = IEFVMMWA                                           */ 00300000
*/*                                                                  */ 00350000
*/* DESCRIPTIVE NAME = VARIABLE MESSAGE WORK AREA                    */ 00400000
*/*                                                                  */ 00450000
*/* COPYRIGHT = 5740-XC6 COPYRIGHT IBM CORP., 1982,1983              */ 00500000
*/*             LICENSED MATERIAL - PROGRAM, PROPERTY                */ 00550000
*/*             OF IBM, REFER TO COPYRIGHT INSTRUCTIONS              */ 00600000
*/*             FORM NUMBER G120-2083                                */ 00650000
*/*                                                                  */ 00700000
*/* STATUS = OS/VS2 JBB2110                                          */ 00750000
*/*                                                                  */ 00800000
*/* MODULE TYPE = MACRO                                              */ 00850000
*/*                                                                  */ 00900000
*/* FUNCTION =                                                       */ 00950000
*/*                                                                  */ 01000000
*/* MSGPARMS IS USED BY CONVERTER/INTERPRETER ROUTINES FOR BUILDING  */ 01050000
*/* VARIABLE MESSAGES.  THE PARAMETERS ARE ARRANGED AS IN THIS       */ 01100000
*/* PICTURE.                                                         */ 01150000
*/*                                                                  */ 01200000
*/*              |<--------- PART 1 -------->||<---- PART 2 ---      */ 01250000
*/*                                                                  */ 01300000
*/* ___________________________________/ /___________________/       */ 01350000
*/* |     |PART-||     |     |VAR- |         ||     |     |          */ 01400000
*/* |FLAGS|CONT || FIXEDKEY  |LENTH|VARSECT  || FIXEDKEY  | ETC.     */ 01450000
*/* |_____|_____||_____|_____|_____|___/ /___||_____|_____|__/       */ 01500000
*/*                                                                  */ 01550000
*/*                                                                  */ 01600000
*/* |<--------------------- 80 BYTES TOTAL --------------------      */ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/*       FIELD        LENGTH/MASK    DESCRIPTION                    */ 01800000
*/*       _____        ___________    ___________                    */ 01850000
*/*                                                                  */ 01900000
*/*                         80        MULTI-VARIABLE MESSAGE         */ 01950000
*/*                                   PARAMETER AREA                 */ 02000000
*/*        MSGFLAGS          1        FLAGS                          */ 02050000
*/*          SSTMTNUM     X'80'       1 - DO NOT PRINT STATEMENT     */ 02100000
*/*                                       NUMBER                     */ 02150000
*/*                                   0 - PRINT STATEMENT NUMBER     */ 02200000
*/*                                                                  */ 02250000
*/*        PARTCONT          1        COUNT OF MESSAGE PARTS         */ 02300000
*/*                                                                  */ 02350000
*/*        PARTDATA         78        STORAGE FOR MESSAGE PARTS      */ 02400000
*/*                                                                  */ 02450000
*/*         MSGPART(*)       *        MESSAGE PARTS                  */ 02500000
*/*          FIXEDKEY        2        KEY FOR FIXED SECTION OF       */ 02550000
*/*                                   THIS MESSAGE PART              */ 02600000
*/*          VARLENTH        1        LENGTH OF VARIABLE SECTION     */ 02650000
*/*                                   OF THIS MESSAGE PART           */ 02700000
*/*          VARSECT         *        VARIABLE SECTION OF THIS       */ 02750000
*/*                                   MESSAGE PART                   */ 02800000
*/*                                                                  */ 02850000
*/*                                                                  */ 02900000
*/*                                                                  */ 02950000
*/*  THE MESSAGE WRITER WILL CHECK PARTCONT, THE SECOND BYTE OF      */ 03000000
*/*  MSGPARMS, FOR A NON-ZERO ENTRY BEFORE PROCESSING AN ERROR       */ 03050000
*/*  MESSAGE.  A NON-ZERO ENTRY WILL CAUSE THE MESSAGE WRITER        */ 03100000
*/*  (IEFVGM) TO IGNORE OTHER MESSAGE INDICATORS AND USE ONLY        */ 03150000
*/*  THE INFORMATION IN THIS PARAMETER LIST.                         */ 03200000
*/*                                                                  */ 03250000
*/* INVOCATION =                                                     */ 03300000
*/*                                                                  */ 03350000
*/*        PL/S - DCL MSGPARMP PTR(31)                               */ 03400000
*/*               %INCLUDE SYSLIB(IEFVMMWA)                          */ 03450000
*/*                                                                  */ 03500000
*/*        BAL  - DSECT IS GENERATED                                 */ 03550000
*/*                                                                  */ 03600000
*/* CHANGE ACTIVITY = H0                                             */ 03650000
*/*  $H0= EXTJCL JBB2110 820702 PD2R: SUPPORT FOR EXTENDED JCL       */ 03700000
*/*                                                                  */ 03750000
*/********************************************************************/ 03800000
*/* A 000000-999999                                              @H0A*/ 03850000
*  %GOTO MWAPLS;             /*                                         03900000
MSGPARMS DSECT                     PARAMETER LIST FOR VARIABLE MESSAGE  03950000
MSGPARID DS    CL4                 IDENTIFIER 'CIMP' CONVERTER/         04000000
*                                   INTERPRETER MESSAGE PARAMETERS      04050000
MSGPRVER DS    XL1                 VERSION NUMBER                       04100000
MSGPRLEN DS    CL1                 LENGTH OF PARAMETER AREA             04150000
MSGRSV1  DS    XL2                 RESERVED                             04200000
MSGPTR   DS    A                   MESSAGE POINTER FOR BUILDING         04250000
*                                  MESSAGE PARTS                        04300000
MSGFLAGS DS    CL1                 FLAG BYTE                            04350000
SSTMTNUM EQU   X'80'                 0 = PRINT STATEMENT NUMBER         04400000
*                                    1 = SUPPRESS PRINTING STMT NM      04450000
PARTCONT DS    XL1                 NUMBER OF MESSAGE PARTS              04500000
PARTDATA DS    CL78                MESSAGE PARTS                        04550000
MSGEND   DS    0C                  END OF MSGPARMS                      04600000
MSGPARML EQU   MSGEND-MSGPARMS     LENGTH OF MSGPARMS                   04650000
*                                                                       04700000
*********************************************************************** 04750000
*   THE FOLLOWING DECLARES DESCRIBE THE MAPPING FOR A SINGLE          * 04800000
*   MESSAGE PART.                                                     * 04850000
*********************************************************************** 04900000
*                                                                       04950000
MSGPART  DSECT                     MAPPING FOR ONE MESSAGE PART         05000000
FIXEDKEY DS    H                   TWO-BYTE KEY FOR FIXED SECTION       05050000
VARLENTH DS    XL1                 LENGTH OF VARIABLE SECTION           05100000
VARSECT  DS    0C                  VARIABLE SECTION                     05150000
         SPACE                                                          05200000
*********************************************************************** 05250000
*        CONSTANTS FOR USE WITH THE VARIABLE MESSAGE FACILITY         * 05300000
*********************************************************************** 05350000
MSGPCVER EQU   1                   CURRENT VERSION NUMBER               05400000
ONEPART  EQU   1                                                        05450000
TWOPART  EQU   2                                                        05500000
THRPART  EQU   3                                                        05550000
FOURPART EQU   4                                                        05600000
         SPACE                                                          05650000
*********************************************************************** 05700000
*       END OF VARIABLE MESSAGE PARAMETER LIST                        * 05750000
*********************************************************************** 05800000
         MEND                */                                         05850000
*  %MWAPLS: ;                                                           05900000
*/*                                                                  */ 05950000
* DCL 1 MSGPARMS BASED(MSGPARMP),  /*WORK AREA FOR VARIABLE MESSAGES */ 06000000
*      2 MSGPARID CHAR(4),   /*  IDENTIFIER 'CIMP'--C/I MESSAGE         06050000
*                                                         PARAMETERS */ 06100000
*      2 MSGPRVER FIXED(8),  /*  VERSION NUMBER                      */ 06150000
*      2 MSGPRLEN  FIXED(8), /*  LENGTH OF PARAMETER LIST            */ 06200000
*      2 MSGRSV1   CHAR(2),  /*  RESERVED                            */ 06250000
*      2 MSGPTR    PTR(31),  /*  MESSAGE POINTER FOR BUILDING MESSAGE   06300000
*                                PARTS                               */ 06350000
*      2 MSGFLAGS BIT(8),    /*  FLAG BYTE                           */ 06400000
*       3 SSTMTNUM BIT(1),   /*  1 = SUPPRESS PRINTING STATEMENT        06450000
*                                    NUMBER                             06500000
*                                0 = PRINT STATEMENT NUMBER          */ 06550000
*       3 * BIT(7),          /*  RESERVED                            */ 06600000
*      2 PARTCONT FIXED(8),  /*  NUMBER OF MESSAGE PARTS             */ 06650000
*      2 PARTDATA CHAR(78);  /*  MESSAGE PARTS (MAPPING BELOW)       */ 06700000
*/*                                                                  */ 06750000
*/********************************************************************/ 06800000
*/* THE FOLLOWING DECLARES DESCRIBE THE MAPPING FOR A SINGLE         */ 06850000
*/* MESSAGE PART.                                                    */ 06900000
*/********************************************************************/ 06950000
*/*                                                                  */ 07000000
* DCL 1 MSGPART BASED(ADDR(PARTDATA)), /* MESSAGE PART               */ 07050000
*      2 FIXEDKEY FIXED(16), /*  KEY FOR FIXED SECTION OF PART       */ 07100000
*      2 VARLENTH FIXED(8),  /*  LENGTH OF VARIABLE SECTION          */ 07150000
*      2 VARSECT  CHAR(*);   /*  VARIABLE SECTION                    */ 07200000
*/********************************************************************/ 07250000
*/*    CONSTANTS FOR USE WITH THE VARIABLE MESSAGE FACILITY:         */ 07300000
*/********************************************************************/ 07350000
* DCL MSGPRCID CHAR(4) CONSTANT('CIMP'),  /* IDENTIFIER              */ 07400000
*     MSGPCVER FIXED(8) CONSTANT(1),      /* CURRENT VERSION NUMBER  */ 07450000
*     ONEPART  FIXED(8) CONSTANT(1),      /* ONE PART                */ 07500000
*     TWOPART  FIXED(8) CONSTANT(2),      /* TWO PARTS               */ 07550000
*     THRPART  FIXED(8) CONSTANT(3),      /* THREE PARTS             */ 07600000
*     FOURPART FIXED(8) CONSTANT(4);      /* FOUR PARTS              */ 07650000
*/********************************************************************/ 07700000
*/*     END OF VARIABLE MESSAGE PARAMETER LIST                       */ 07750000
*/********************************************************************/ 07800000
