         MACRO                                                          00020000
         IEFVMDWA &X                                                    00040000
*/********************************************************************/ 00040500
*/*                                                                  */ 00041000
*/* MODULE NAME - IEFVMDWA                                           */ 00041500
*/*                                                                  */ 00042000
*/* DESCRIPTIVE NAME - INTERPRETER DD ROUTINE WORK AREA              */ 00042500
*/*                                                                  */ 00043000
* *01* PROPRIETARY STATEMENT=                                         * 00043500
*  **PROPRIETARY_STATEMENT********************************************* 00044000
*                                                                     * 00044500
*                                                                     * 00045000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00045500
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00046000
*   5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                   @P0C* 00046500
*                                                                     * 00047000
*   STATUS= HBB7703                                                   * 00047500
*                                                                     * 00048000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00048500
*/*                                                                  */ 00049600
*/* INVOCATION - BAL  -  IEFVMDWA X=NA OR NULL                       */ 00050200
*/*                      THE DEFAULT IS NO PARAMETER (NULL).         */ 00050800
*/*                      IF THE NA PARAMETER IS SPECIFIED,           */ 00051400
*/*                      IEFVMAWA WILL NOT BE INCLUDED.              */ 00052000
*/*                                                                  */ 00053300
*/* FUNCTION   - THIS MACRO MAPS DATA FIELDS AND SWITCHES UNIQUE     */ 00053400
*/*              TO THE INTERPRETER DD ROUTINE.                      */ 00053800
*/*                                                                  */ 00053900
*/* EXTERNAL CLASSIFICATION:  NONE                               @L2A*/ 00054000
*/* END OF EXTERNAL CLASSIFICATION:                              @L2A*/ 00054100
*/*                                                                  */ 00054200
*/*                                                                  */ 00054400
*/* NOTES      - THE INFORMATION MAPPED BY THIS MACRO IS USED    @L1C*/ 00055000
*/*              BY THE INTERPRETER DD ROUTINE AND IS NOT        @L1C*/ 00055600
*/*              PRESERVED BY OTHER INTERPRETER ROUTINES.        @L1C*/ 00056200
*/*                                                                  */ 00056800
*/* CHANGE ACTIVITY - L1                                         @L1A*/ 00057400
*/*                                                                  */ 00058000
*/* $L1= APPC1   HBB4420 880428 PDCC: ALLOCATION FROM TP PROFILE @L1A*/ 00058600
*/* $L2= SIOTX   HBB7703 990831 PDOO: SUPPORT FOR SIOT EXTENSION @L2A*/ 00058900
*/* $P0= PXD1020 HBB7703 000201 PDFD: Fix copyright              @P0A*/ 00059300
*/********************************************************************/ 00059800
*/* A - MACRO PROLOGUE AND COMMENTARY CLEANUP                    @L1A*/ 00060400
*/* A - SAVE SVA FOR SIOT CONTAINING PREVIOUSLY GENERATED        @L1A*/ 00061000
*/*     DATASET NAME                                             @L1A*/ 00061600
*/* A - ADDED SIOTX WORK AREA AND SAVEREG3 FOR SIOTX SUPPORT     @L2A*/ 00062800
*/* C - Fixed copyright/program number statements.               @P0A*/ 00063200
*/*                                                                  */ 00063600
* MACMEAN  DWA MEANS IEFVDA LOCAL WORK AREA                    @Z40MPTH 00064000
* MACCOMP Y-3 SC1B9/PZD83                                      @Z40MPTH 00068000
* MACSTAT Y-3 74305/Z40MPTH                                    @Z40MPTH 00072000
*         MERGE SU4,10,16 CODE TO REL 037 BASE PTF             @ZA28955 00076000
*                                                                       00220000
DWA      DSECT                                                          00240000
         USING DWA,RA                                                   00260000
         DS    0D                                                       00280000
INAMDDWA EQU   *                                                        00300000
         AIF   ('&X' EQ 'NA').SKIP                                      00320000
         IEFVMAWA                                                       00340000
.SKIP    ANOP                                                           00360000
TTRS     DS    F SAVE FOR TTR                               289         00380000
DDSWA    DS    CL1 DD SWITCHES                              289         00400000
DDWAA    DS    CL3                                                      00420000
DDWAB    DS    0F ALIGNMENT                                             00440000
DDWA1    DS    CL1                                                      00460000
DDWA2    DS    CL1                                                      00480000
DDWA3    DS    CL3                                                      00500000
DDWA4    DS    CL3                                                      00520000
DDWA5    DS    CL8                                                      00540000
DDWA6    DS    CL1                                                      00560000
DDWA61   DS    CL1 *                   WORK AREA FOR BUFIN,BUFOUT 20002 00580000
DDWA62   DS    CL1                                                      00600000
DDWA63   DS    CL1                                                      00620000
DDWA64   DS    F                                                        00640000
DDWA7    DS    D                                                        00660000
DDWA8    DS    0D                                                       00680000
SIOT     DS    CL176                                                    00700000
DDWA10   DS    0D                                                       00720000
JFCB     DS    CL176                                                    00740000
DDWA12   DS    0D                                                       00760000
JFCBX    DS    CL176        ALSO USED AS WORK AREA IN IEFVDA            00780000
         DS    0D                                                       00786600
JFCBEX   DS    CL176        JFCB EXTENSION FOR 3800 DATA       @Z40MPTH 00793200
SAVESVA  DS    CL3          SAVED SVA OF SIOT CONTAINING PREVIOUSLY    *00795400
                            GENERATED DATASET NAME                 @L1A 00797600
         DS    0D                                                  @L2A 00798200
SIOX     DS    CL352        SIOT EXTENSION WORK AREA               @L2A 00798800
SAVEREG3 DS    F                                                   @L2A 00799400
         MEND                                                           00800000
