*%GOTO INTPROLG;    /*                                                  00010000
         MACRO                                                          00020000
         IEFVMIWA                                                       00040000
*                                                                       00068300
.*/      %INTPROLG:;  /*                                             */ 00096700
*/* START OF SPECIFICATIONS ******************************************/ 00106700
*/*                                                                  */ 00376700
*/*01* DESCRIPTIVE NAME: Interpreter Work Area                       */ 00426700
*/*                                                                  */ 00476700
*/*01* PROPRIETARY STATEMENT=                                        */ 00480200
*/***PROPRIETARY_STATEMENT********************************************/ 00483700
*/*                                                                  */ 00487200
*/*                                                                  */ 00490700
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00494200
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00497700
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1979, 2000                  @P7C*/ 00502900
*/*                                                                  */ 00508200
*/* STATUS= HBB7703                                                  */ 00511700
*/*                                                                  */ 00515200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00518700
*/*                                                              @L5C*/ 00522200
*/*02*  ACRONYM: INTWA                                               */ 00526700
*/*                                                                  */ 00756700
*/*01* MACRO NAME:  IEFVMIWA                                     @H1C*/ 00776700
*/*                                                                  */ 00779200
*/*01* FUNCTION:                                                     */ 00781700
*/*02*  Mapping of data fields and switches unique to the            */ 00784200
*/*     Interpreter.                                                 */ 00786700
*/*                                                                  */ 00789200
*/*01* EXTERNAL CLASSIFICATION:  NONE                                */ 00791700
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00794200
*/*                                                                  */ 00796700
*/*01* DSECT NAME:                                                   */ 00797000
*/*     INTWA                                                        */ 00797300
*/*                                                                  */ 00797600
*/*01* COMPONENT:  Interpreter (SC1B9)                               */ 00797900
*/*                                                                  */ 00798200
*/*01* EYE-CATCHER:  None                                            */ 00798500
*/*                                                                  */ 00798800
*/*01* STORAGE ATTRIBUTES:                                           */ 00799100
*/*02*  SUBPOOL:  252                                                */ 00799400
*/*02*  KEY:  0                                                      */ 00799700
*/*02*  RESIDENCY:  Below 16 MB in virtual storage                   */ 00800000
*/*                                                                  */ 00800500
*/*01* SIZE:  2188 bytes                                             */ 00800700
*/*     Frequency:  One per instance of the Interpreter              */ 00800800
*/*                                                                  */ 00800900
*/*01* CREATED BY: The Interpreter                                   */ 00801300
*/*                                                                  */ 00801800
*/*01* CREATED BY (IBM use only) =                                   */ 00802000
*/*     Interpreter Module  (IEFNB903)                               */ 00802200
*/*                                                                  */ 00802400
*/*01* POINTED TO BY: N/A, contiguous to COMWA                       */ 00802600
*/*                                                                  */ 00802800
*/*01* DELETED BY: The Interpreter                                   */ 00803000
*/*                                                                  */ 00803200
*/*01* DELETED BY (IBM use only) =                                   */ 00803400
*/*     Interpreter Module  (IEFVHN)                                 */ 00803600
*/*                                                                  */ 00803800
*/*01* SERIALIZATION:                                                */ 00804000
*/*     None required                                                */ 00804200
*/*                                                                  */ 00804500
*/*01* METHOD OF ACCESS:                                             */ 00804800
*/*02*  ASM:                                                         */ 00805100
*/*      Specify:  IEFVMIWA                                  @G743P2E*/ 00805400
*/*02*  PL/AS:                                                       */ 00805700
*/*      Specify:  %INCLUDE SYSLIB(IEFVMIWA)                 @G743P2E*/ 00806000
*/*                                                          @G743P2E*/ 00806300
*/*                                                                  */ 00808400
*/*01* NOTES:                                                        */ 00808500
*/*                                                                  */ 00808600
*/*02* DEPENDENCIES:                                                 */ 00808700
*/*       This macro must be invoked immediately following   @G743P2E*/ 00809000
*/*       IEFCOMWA, to insure correct addressability.        @G743P2E*/ 00809300
*/*       Register 12 is the base register across the entire @G743P2E*/ 00809600
*/*       work area mapped by both IEFCOMWA and IEFVMIWA.    @G743P2E*/ 00809900
*/*       Therefore displacements for the Interpreter Work   @G743P2E*/ 00810200
*/*       Area must be a continuation of those for the       @G743P2E*/ 00810500
*/*       Common Work Area.                                  @G743P2E*/ 00810800
*/*                                                                  */ 00811100
*/*02* RESTRICTIONS:                                             @06A*/ 00811300
*/*      - The following restrictions apply to the use of the    @06A*/ 00811500
*/*        IWAWORK field:                                        @06A*/ 00811700
*/*        o The IWAWORK field cannot be used to communicate     @06A*/ 00811900
*/*          between Interpreter modules.                        @06A*/ 00812100
*/*        o It cannot be used to retain information between     @06A*/ 00812300
*/*          invocations of a single module.                     @06A*/ 00812500
*/*        o A module using the IWAWORK field cannot call any    @06A*/ 00812700
*/*          other module using the IWAWORK field until the      @06A*/ 00812900
*/*          calling module has finished its use of the field.   @06A*/ 00813100
*/*        o Service routines (IEFVGI, IEFVGK, IEFVGM, IEFVGS,   @06A*/ 00813300
*/*          IEFVGT, IEFVHQ, IEFVHR, IEFCISCN) should not use    @06A*/ 00813500
*/*          the IWAWORK field.                                  @06A*/ 00813700
*/*                                                                  */ 00813900
*/*01* DISTRIBUTION LIBRARY: APVTMACS                                */ 00814100
*/*                                                                  */ 00814300
*/*01* CHANGE ACTIVITY: G743P2E,H1,D1,L1,R1,R2,L2,R3,R4,L3,L4,       */ 00814500
*/*                     P1,P2,01,02,04,05,03,L5,P4,L6,06,07,P5,      */ 00814600
*/*                     P6                                       @P6A*/ 00814700
*/*                                                                  */ 00814900
*/* $H1= EXTJCL   JBB2110 820827 PD43: SUPPORT FOR EXTENDED JCL  @H1A*/ 00816700
*/* $D1= DCR89    JBB2125 830928 PDJ2: REWORK OF AFP SPE         @D1A*/ 00836700
*/* $L1= SWABOVE  JBB2220 850603 PDU2: SWA ABOVE THE LINE        @L1A*/ 00856700
*/* $R1= PA20323  JBB2220 850603 PDU2: SUPPORT FOR PA20323       @R1A*/ 00876700
*/* $R2= PA20335  JBB2220 850603 PDU2: SUPPORT FOR PA20335       @R2A*/ 00896700
*/* $L2= EXPDATE  JBB2220 860226 PDB1: EXPIRATION DATE SUPPORT   @L2A*/ 00916700
*/* $R3= PA20976  JBB2220 860409 PDN3: SUPPORT FOR PA20976       @R3A*/ 00936700
*/* $R4= PA20929  JBB2220 860409 PDN3: SUPPORT FOR PA20929       @R4A*/ 00956700
*/* $04= OY45992 JBB2220 910823 PDBD: INTERPRETER COMPATIBILITY  @04A*/ 00960000
*/* $05= OY48162 JBB2220 911011 PDBD: INTERPRETER COMPATIBILITY  @05A*/ 00963300
*/* $03= OY45233 JBB2220 911108 PDBD: INTERPRETER COMPATIBILITY  @03A*/ 00965000
*/* $L3= SMSSTG2 JBB2223 860324 PDT3: STG MGMT SUBSYS STG2 SUPT  @L3A*/ 00966700
*/* $01= OY44334 JBB2223 910710 PDBD: STOR MGMT SUBSYS STG2 SUPT @01A*/ 00969200
*/* $L4= EMVS2   HBB4410 890213 PDM9: ENTERPRISE MVS/II          @L4A*/ 00971700
*/* $P1= PH30275 HBB4420 891009 PDCC: REMOVE UNUSED FIELDS       @P1A*/ 00974200
*/* $P1= PH30275 HBB4420 891009 PDCC: SHOWHDR format complete    @P1A*/ 00975400
*/* $P2= PH30929 HBB4420 900514 PDE1: Fix reserved fields        @P2A*/ 00976000
*/* $P3= PH31921 HBB4420 901126 PDCC: JES3 uniqueness problem    @P3A*/ 00976300
*/* $02= OY45671 HBB4420 910719 PDN3: Support for ALLOC OY44702  @02A*/ 00981100
*/* $07= OY58484 HBB4420 921120 PDBN: DDNAME with concatenations @07A*/ 00982200
*/* $L5= POSIX   HBB4430 911122 PDBN: OpenMVS Support            @L5A*/ 00983300
*/* $P4= PKB2676 HBB4430 920292 PDDZ: 10X Defect Elimination     @P4A*/ 00984400
*/* $06= OY59040 HBB4430 921113 PDBN: OpenMVS Support            @06A*/ 00984600
*/* $L6= PE2STSCH HBB5510 921217 PDXB: Dynamic exit support      @L6A*/ 00984800
*/* $P5= PIG4207 HBB5510 920420 PDBN: Comment delimiters         @P5A*/ 00985000
*/* $P6= PIG2436 HBB5510 931104 PDCC: Temporary data set names in a  */ 00985100
*/*                                   Sysplex                    @P6A*/ 00985200
*/* $08= OW21215 HBB5510 960701 PDLS: INIT abend0C4 on I/O error @08A*/ 00985300
*/* $L7= SIOTX   HBB7703 990831 PDOO: Support for SIOT Extension @L7A*/ 00986900
*/* $P7= PXD1020 HBB7703 000201 PDFD: Fix copyright              @P7A*/ 00987700
*/* $09= OW44540 HBB7703 000501 PDOH: BLKSZLIM Support           @09A*/ 00988100
*/* $0A= OW51127 HBB7703 011005 PDOO: Abend0B0,RSN=08 when multiple  */ 00988200
*/*                                   DDNAME references used     @0AA*/ 00988300
*/* $0B= OW51834 HBB7703 011107 PDOO: DDNAME resolves to DUMMY   @0BA*/ 00988400
*/*                                   PE of OW51127              @0BA*/ 00988500
*/*                                                                  */ 00988600
*/* END OF SPECIFICATIONS ********************************************/ 00990000
*/*                                                                  */ 01003300
*/* A - FIELDS TO SUPPORT THE CONVERSION OF HEX AND NAME DATA,   @H1A*/ 01016700
*/*     AND FOR SPECIAL CHARACTER INDICATION                     @H1A*/ 01036700
*/* A - CHECKING FOR BLANKS IN CHARACTER TYPE PARAMETERS         @D1A*/ 01056700
*/* A - FIELD TO SAVE THE VALUE RETURNED AS A RESULT OF THE      @L1A*/ 01076700
*/*     TOKEN PARAMETER ON THE ESTAE MACRO.  ALSO ADDED FIELDS   @L1A*/ 01096700
*/*     TO SAVE ASSIGNED SVAS FOR INTERPRETER CONTROL BLOCKS     @L1A*/ 01116700
*/* A - EXTENDED FIELD IWAINSVA TO ALLOW FOR A MAXIMUM OF 15     @R1A*/ 01136700
*/*     ASSIGNS                                                  @R1A*/ 01156700
*/* A - FIELD JFCEABVE TO HOLD THE ABOVE THE LINE JFCBE SVA      @R2A*/ 01176700
*/* A - FIELD, CRNTDATE, TO HOLD FULLY QUALIFIED CURRENT DATE    @L2A*/ 01196700
*/* A - PREVIOUS SIOT/JFCB RESIDENCY INDICATOR (IWAPREUP)        @R3A*/ 01216700
*/* A - DDNAME= REFERENCE OBJECT INDICATOR (IWADDOBJ)            @R4A*/ 01236700
*/* A - FIELD IWASSOB TO POINT TO STORAGE MANAGEMENT SUBSYSTEM   @L3A*/ 01243300
*/*     SSOB                                                     @L3A*/ 01249900
*/* A - FLAG IWAJCLV TO INDICATE THAT JCL VERSION NUMBER IS      @L4A*/ 01250300
*/*     PRESENT IN THE JOB TEXT, STATEMENT NUMBER IS IN THE      @L4A*/ 01250700
*/*     TEXT, AND THE JDT KEYS RATHER THAN KEYWORDS ARE PRESENT  @L4A*/ 01251100
*/*     IN THE TEXT STRING.                                      @L4A*/ 01251500
*/* A - FLAG GTFACTIV TO INDICATE THAT GTF TRACE IS ACTIVE       @L4A*/ 01251900
*/* A - A STRUCTURE FOR A STACK TO HOLD THE SVA TOKENS FOR UP TO @L4A*/ 01252300
*/*     15 IF STATEMENT BLOCK, WITH A BIT CORRESPONDING TO EACH  @L4A*/ 01252700
*/*     IF STMT INDICATING WHETHER IT IS AN IF CLAUSE OR ELSE    @L4A*/ 01253100
*/*     CLAUSE. ALSO AN INDEX TO THE TOP-OF-STACK ENTRY IS ADDED @L4A*/ 01253500
*/* A - FIELD IWATUXP TO POINT TO TRACE BUFFER FOR TRACING       @L4A*/ 01253900
*/*     IEFUJV EXIT.                                             @L4A*/ 01254300
*/* A - FIELD IWACRECP TO POINT TO CURRENT TRACE RECORD FOR      @L4A*/ 01254700
*/*     IEFUJV EXIT.                                             @L4A*/ 01255100
*/* A - FIELD IWAGTRCP TO POINT TO GTRACE PARM LIST              @L4A*/ 01255500
*/* A - FIELDS UNNU AND UNQNAME ARE NO LONGER USED               @P1A*/ 01256100
*/* A - Field UNNU is restored for JES3 uniqueness requirement   @P3A*/ 01256400
*/* A - ADDED 64 BYTES OF STORAGE, 4 BYTES ARE BEING USED TO         */ 01258900
*/*     STORE THE CONTENT OF AOWSTMT.  THE REMAINING 60 BYTES        */ 01261400
*/*     ARE RESERVED FOR FUTURE USE, IF NEEDED.  THIS ADDITIONAL     */ 01263900
*/*     STORAGE IS NEEDED TO STORE THE CONTENTS OF AOWSTMT, AS       */ 01266400
*/*     AOWSTMT IS REUSED IN IEFVHH TO STORE THE ADDRESS OF THE      */ 01268900
*/*     SMS MESSAGE BUFFER.                                      @01A*/ 01271500
*/* A - Reinstated UNQNAME removed by @P1                        @02A*/ 01271600
*/* A - ADDED 64 BYTES OF STORAGE, 4 BYTES ARE BEING USED TO         */ 01271700
*/*     STORE THE OVERRIDE TIME TO BE USED BY THE RESTART STEP       */ 01271800
*/*     IN IEFVEA.  THE REMAINING 60 BYTES ARE RESERVED FOR          */ 01271900
*/*     FUTURE USE, IF NEEDED.                                   @04A*/ 01272000
*/* A - ADDED FLAG RESTIME (RESTART TIME) IN SWITCH A - THIS         */ 01272100
*/*     FLAG IS INITIALIZED TO OFF IN IEFVHE AND USED IN IEFVEA.     */ 01272200
*/*     THIS FLAG IS USED TO DETERMINE IF THE TIME FOR THE           */ 01272300
*/*     RESTART STEP IS TO BE REPLACED FOR JOB CONVERTED ON 410      */ 01272400
*/*     LEVEL.                                                   @04A*/ 01272500
*/* A - ADDED FIELD SAVECALL TO SAVE R14 IN IEFVEA - RESTART         */ 01272600
*/*     STEP CHECKING SUBROUTINE - BEFORE BRANCHING TO THE           */ 01272700
*/*     CHECKPOINT/RESTART SUBROUTINE, AND RESTORING R14 UPON        */ 01272800
*/*     RETURN FROM THE CHECKPOINT/RESTART SUBROUINTE.  THIS         */ 01272900
*/*     IS A PE APAR FOR APAR OY44524.                           @05A*/ 01273000
*/* A - FIELD CILEVEL, TO HOLD THE LEVEL FOR EACH C/I TEXT           */ 01273100
*/*     RECORD.  THIS WILL BE STORED IN THE DICTIONARY TO BE         */ 01273200
*/*     USED BY IEFVGS TO SEARCH FOR STEPS WITHIN THE SAME           */ 01273300
*/*     PROCEDURES.  ALSO ADDED ARRAY FOR ALL LEVELS OF NESTED       */ 01273400
*/*     PROCEDURES.                                              @03A*/ 01273500
*/* A - Added unmapped work area for general use by Interpreter      */ 01273600
*/*     modules.  The area can be used as a scratch area to store    */ 01273800
*/*     information that does not have to be retained between        */ 01274100
*/*     invocations of the module.  Each module using this area      */ 01274400
*/*     must map it and must clear it before use.  Size of area      */ 01274500
*/*     chosen to provide sufficient storage for OpenMVS support     */ 01274600
*/*     and leave size of IWA approximately unchanged.           @L5A*/ 01274700
*/* D - Deleted field definitions used only as 'automatic storage'   */ 01275000
*/*     by single modules                                        @L5A*/ 01275300
*/* A - Added pointer to SJF Validate parameter list             @L5A*/ 01275600
*/* A - Added UJV subsystem environment information field        @P4A*/ 01275700
*/*     IWAUJV6, used as 6th parameter on IEFUJV exit calls      @P4A*/ 01275800
*/* A - Added pointer to dynamic exit workarea                   @L6A*/ 01276900
*/* C - Changed 32 bytes of RBLOCK field to IWAEPAWA, work area      */ 01278000
*/*     for building EPAs.  The address of this field is placed      */ 01279100
*/*     in the QMPA by IEFVHE.  This replaces the use of the         */ 01280200
*/*     IWAWORK area for this purpose.  TRSQ for PKB4343.        @06A*/ 01281300
*/* C - Documented additional restrictions on the use of the         */ 01282400
*/*     IWAWORK field.                                           @06A*/ 01283500
*/* C - Reclaimed unused IWADDOBJ flag to indicate that the          */ 01284600
*/*     most recently processed labeled DD was the object of a       */ 01285700
*/*     DDNAME reference.  The flag is used when processing an       */ 01286800
*/*     unlabeled (concatenated) DD to determine whether an          */ 01287900
*/*     incorrect DDNAME reference to a concatenation has            */ 01289000
*/*     occurred.                                                @07A*/ 01290100
*/* C - Corrected comment delimiter errors introduced during         */ 01291200
*/*     APAR rollup.  Corrected line flags for Data Areas pub.   @P5A*/ 01292300
*/* C - Defined UNQSYS to hold a unique system qualifier used for    */ 01292600
*/*     temporary data set names.                                @P6A*/ 01292900
*/* A - Added flag to indicate QMPA was copied.                  @08A*/ 01293100
*/* A - Added TSIOXA, TSIOXB, SIOXABVE, and SIOTXS fields to         */ 01293200
*/*     hold SIOT Extension SVAs and work area pointers.         @L7A*/ 01293300
*/* C - Fixed copyright/program number statements.               @P7A*/ 01293600
*/* A - Added TBLKSZLM field to hold blocksize limit (set in         */ 01293990
*/*     IEFVJDTI and copied to the SIOTX in IEFVDA).             @09A*/ 01294080
*/* A - Added IWAMSVAS and IWAMSVAJ which will be used to hold   @L8A*/ 01294110
*/*     the SVAs of the SIOT and JFCB when DDNAM references are  @L8A*/ 01294140
*/*     used.                                                    @L8A*/ 01294170
*/* A - Added IWAMSVAS and IWAMSVAJ to hold the SVAs of the      @0AA*/ 01294175
*/*     SIOT and JFCB for DDNAME reference processing.           @0AA*/ 01294180
*/* D - Removed IWAMSVAS and IWAMSVAJ which was used to hold     @0BA*/ 01294185
*/*     the SVAs of the SIOT and JFCB for DDNAME reference       @0BA*/ 01294190
*/*     processing.                                              @0BA*/ 01294195
*/*------------------------------------------------------------------*/ 01294200
*%GOTO INTWAPLS;                                                        01294500
*/*                                                                     01296700
*                                                                       01316700
INTWA    DS    0F                  START OF INTRP WORK AREA.    @Y02668 01336700
*                                                                       01356700
*  POINTERS, WORK AND DATA AREAS.                                       01376700
*                                                                       01396700
IWAINTS5 DS    F                   PTR TO JOB MNGMT RECORD        @AABA 01416700
TSIOT    DS    F                        NEXT AVAIL SIOT SVA             01436700
*                                  SVA'S OF TABLES IN THE Q             01456700
TJOBLIB  DS    F                        SVA OF JOBLIB SIOT              01476700
TSREFB   DS    F                        SVA OF 1ST DICTIONARY           01496700
TACT     DS    F                        SVA OF O'RIDE ACT               01516700
TPROC    DS    F                        NEXT PROC STEP O'RIDE TABLE     01536700
RELPROC  DS    F                        OFFSET LAST PROC/ SVA DICT      01556700
RELPGM   DS    F                        OFFSET LAST PGM/ SVA DICT       01576700
DSENQTP  DS    F                   POINTER TO DSENQ TABLE (ZERO IN SSS) 01596700
IWAJOBS1 DS    2F                  CHKPT/REST - CALLING STEPNAME  @AAAA 01616700
IWAJOBS3 DS    2F                  CHKPT/REST - STEPNAME/PROCSTEP @AAAA 01636700
IWAJOBS6 DS    F                        REGION SIZE ON JOB STMT   @AAAA 01656700
IWASTAPL DS    F         POINTER TO R/I STAE PARAMETER LIST     @A39047 01676700
IWAEXPNO DS    F             EXEC PROC STMT NUMBER             @YM02714 01696700
CRNTDATE DS    F         FULLY QUALIFIED CURRENT DATE - CCYYDDDF   @L2C 01716700
IWAJMRPT DS    F                   POINTER TO JMR               @Y02668 01733300
TSAVEP   DS    2F                  WORK AND REG SAVE AREA               01749900
IWAJSIOT DS    F         SVA OF JOBCAT SIOT                     @Y01113 01766500
IWASCTAD DS    F                   ADDRESS OF SCT.              @Y02668 01783100
IWASIOTP DS    F                   ADDR OF SIOT.                @Y02668 01799700
IWAJFCBP DS    F                   ADDR OF JFCB.                @Y02668 01816300
DSNTPSA  DS    F                   DSNT PROCESSING ROUTINE              01832900
*                                    REGISTER SAVE AREA         @Y02668 01849500
IWASAVPT DS    F                   POINTER TO SAVEAREA OF               01866100
*                                    INTERPRETER'S CALLER       @Y02668 01882700
AOJRNLEX DS    CL8                 JRNL/MERGE EXIT LIST ENTRY.  @Y02668 01899300
ORIDSNM  DS    CL8                 NAME OF NEXT PROC STEP OVERRIDDEN    01916700
*                                  UNIQUE NAME QUALIFIER                01936700
*******************************************************************     01945700
*  The following declaration (and comments) have been reinstated        01954700
*  through this change                                             @02A 01963700
*                                                                       01972700
UNQNAME  DS   0CL23     SYSYYDDD.TTTTTTT.XYZZZ.JOBNAME.&NAME  OR  @AADA*01981700
                                                      .UNIQUE NO.  @02C 01990700
UNQSDATE DS   0CL8      SYSYYDDD - CONSTANT "SYS" FOLLOWED BY 5   @AADA*01999700
                                   NUMERIC CHARACTERS DENOTING    @AADA*02008700
                                   DATE                            @02C 02017700
UNQSYSD  DS    CL3        SYS    - CONSTANT "SYS"                  @02C 02026700
UNQDATE  DS   0CL5        YYDDD  - DATE                            @02C 02035700
UNQYEAR  DS    CL2        YY     - YEAR                            @02C 02044700
UNQDAY   DS    CL3        DDD    - DAY                             @02C 02053700
UNQDATEP DS    CL1        "."    - Date delimiter                  @02C 02062700
UNQTTIME DS   0CL7      Tnnnnnn  - CONSTANT "T" FOLLOWED BY A 6   @AADA*02071700
                                   CHARACTER NUMERIC TIME STAMP    @02C 02080700
UNQTIMET DS    CL1        T      - CONSTANT "T"                    @02C 02089700
UNQTSTMP DS    CL6        nnnnnn - TIME STAMP                      @02C 02098700
UNQTIMEP DS    CL1        "."    - Time delimiter                  @02C 02107700
UNQSVRID DS   0CL5      XYZZZ    - Unique Identifier created from @AADA*02116700
                                   the following Components        @02C 02125700
UNQSVRDT DS    CL1        X      - ONE ALPHA CHARACTER            @AADA*02134700
                                   DENOTING DATASET TYPE - CURRENTLY   *02143700
                                   SPECIFIED AS 'R' (SYSIN)        @02C 02152700
UNQSVRSN DS    CL1        Y      - ONE ALPHA CHARACTER            @AADA*02161700
                                   DENOTING SYSTEM VERSION -           *02170700
                                   CURRENTLY SPECIFIED AS "A"          *02179700
                                   A = VS2/RELEASE 2               @02C 02188700
UNQSVRCT DS    CL3        ZZZ    - 3 NUMERIC CHARACTERS -         @AADA*02197700
                                   CURRENTLY SET TO "000"          @02C 02206700
UNQSVRP  DS    CL1        "."    - Unique Identifier delimiter     @02A 02215700
*  NOTE: the remaining portion of the generated name is built      @02A 02224700
*        in the JFCB                                               @02A 02233700
*                       JOBNAME  - NAME OF JOB FOR WHICH THE DATA @AADA 02242700
*                                  SET WAS GENERATED              @AADA 02251700
*                        The JOBNAME is followed by one of these        02260700
*                        two fields                                     02269700
*                       &NAME    - AN ALPHANUMERIC FIELD CONTAINING     02278700
*                                  THE "NAME" PORTION OF AN &NAME @AADA 02287700
*                     UNIQUE NO. - A UNIQUE CHARACTER STRING BEGIN-     02296700
*                                  NING WITH "R" AND ENDING WITH A      02305700
*                                  NUMERIC VALUE.                       02314700
**********************************************************************  02323700
IWARVBYT DS    CL1                 Reserved - HEXNIBBL definition      +02331900
                                     moved to local work area          +02340100
                                     (IEFVJDTI)                    @L5C 02348300
UNNU     DS    H                        UNIQUE NAME SERIAL IN BINARY    02356700
JEDSWS   DS    H                        JOB, EXEC, OR DD SWITCHES (LWA) 02376700
JCTS     DS    H                        JCT POINTER (IWA)               02396700
SCTS     DS    H                        SCT POINTER (IWA)               02416700
JACTS    DS    H                        JACT POINTER (LWA)              02436700
SIOTS    DS    H                        SIOT POINTER (LWA)              02456700
JFCBS    DS    H                        JFCB POINTER (LWA)              02476700
JFCBXS   DS    H                        JFCBX POINTER (LWA)             02496700
DSNAMES  DS    H                        DSNAME POINTER (IWA)            02516700
SREFBS   DS    H                        DICTIONARY 1 PTR (IWA)          02536700
DREFBS   DS    H                        DICTIONARY 2 PTR (IWA)          02556700
POVRRDS  DS    H                        POVRRD POINTER (IWA)            02576700
ACTS     DS    H                        ACT POINTER (IWA)               02596700
JFCBES   DS    H                       POINTER TO JFCBE (DWA)  @Z40MPTH 02616700
JCTXS    DS    H                       JCTX PTR (IWA)          @Z40RPSM 02636700
SIOTXS   DS    H                       SIOTX POINTER (LWA)        @L7A  02646700
*                                                                       02656700
DDINTNO  DS    H                   INTERNAL DD SEQUENCE NUMBER  @Y02668 02671700
IWACATCT DS    CL1                 COUNT OF CONCATENATED                02686700
*                                    PRIVATE CATALOGS           @Y01113 02701700
DJBCLAS  DS    CL1                 MAXIMUM JOBCLASS.                    02716700
DINBPLP1 DS    CL1                      BYPASS LABEL PROCESIONG DEFAULT 02736700
*                                                                       02756700
*  SWITCH BYTES.                                                        02776700
*                                                                       02796700
IWAEXTS  DS    CL1            SPECIAL CALLER EXITS               @I171  02816700
IWAQENTR EQU   1                       BIT-7 SPECIAL QMNGR ENTRY @I171  02836700
SWA      DS    CL1                 SWITCH A                             02856700
GTFACTIV EQU   128                      BIT-0 GTF TRACE ACTIVE    @L4A  02866700
JHS      EQU   64                       BIT-1 JOB HAS STEP              02876700
JCTTQ    EQU   32                       BIT-2 JCT TO  PUT IN Q          02896700
SCTTQ    EQU   16                       BIT-3 SCT TO PUT IN Q           02916700
RESTIME  EQU   8                        BIT-4 REPLACE RESTART TIME @04A 02926700
SWC      DS    CL1                 SWITCH C                             02936700
IWAJCLV  EQU   128                      BIT-0 STATEMENT NUMBER IS  @L4A 02940000
*                                             CONTAINED IN TEXT, JCL    02943300
*                                             VERSION NUMBER IS IN JOB  02946600
*                                             TEXT, AND JDT KEYS RATHER 02949900
*                                             THAN KEYWORDS IN TEXT     02953200
IWADDOBJ EQU   64                       BIT-1 Last-processed labeled   *02964000
                                              DD was the object of a   *02974800
                                              DDNAME reference     @07C 02985600
IWAPREUP EQU   32                       BIT-2 PREVIOUS SIOT/JFCB       *02996700
                                              RESIDENCY INDICATOR  @R3A 03016700
IWASWAUP EQU   16                       BIT-3 SELECTED SWA BLOCK       *03036700
                                              RESIDENCY INDICATOR  @L1A 03056700
WAEASIOT EQU   8                        BIT-4 IEFVEA WRITE AND ASSIGN  *03076700
                                              SIOT INDICATOR       @L1A 03096700
DSNTQ    EQU   4                        BIT-5 DSN TABLE TO PUT IN Q     03116700
VOLREF   EQU   2                        BIT-6 DSN VOL REF SW   @ZA01890 03136700
IWAPERFM EQU   1                        BIT-7 PERFORM SPECIFIED ON      03156700
*                                             JOB STMT         @G743P2E 03176700
SWD      DS    CL1                 SWITCH D                             03196700
JOBADDRF EQU   128                      BIT-0 ADDRSPC ON JOB            03211700
*                                             STATEMENT         @Y01029 03226700
JOBREGNS EQU   64                       BIT-1 REGION ON JOB STMT        03241700
FEXRCV   EQU   32                       BIT-2 1ST EXEC RCVD THIS JOB    03256700
FDDRCV   EQU   16                       BIT-3 FIRST DD RCVD THIS STEP   03276700
DBFST    EQU   8                        BIT-4 FIRST ENTRY TO DSENQ      03296700
LASTINDC EQU   4                        BIT_5 LAST PARM INDICATOR       03316700
DCTFST   EQU   2                        BIT-6 FIRST DICT ENTRY RCVD     03336700
TIMDFPRC EQU   1                       BIT-7 PROCESS TIME DEFAULT       03356700
SWF      DS    CL1                 SWITCH F  PROCEDURE SWITCHES         03376700
ORPARMOR EQU   128                      BIT-0 PARM OVERRIDE.            03396700
ORPARMBL EQU   64                       BIT-1 PARM BLOCK.               03416700
ORCONDOR EQU   32                       BIT-2 COND OVERRIDE.            03436700
ORTIMEOR EQU   16                       BIT-3 TIME OVERRIDE.            03456700
ORTIME0  EQU   8                        BIT-4 TIME ZERO.                03476700
ORACTOR  EQU   4                        BIT-5 ACCT OVERRIDE.            03496700
ORREGOR  EQU   2                        BIT-6 REGION OVERRIDE.          03516700
ORADDROR EQU   1                        BIT-7 ADDRSPC OVERRIDE. @Y01029 03536700
*                                  TABLE PTRS (S-CONS) IN T&S ID ORDER  03556700
SWG      DS    CL1                 ADDITIONAL PROCEDURE SWITCHES. @AAAA 03576700
ORRDOR   EQU   128                      RD O'RIDE.                @AAAA 03596700
ORSDPOR  EQU   64   STEP DISPATCHING PRIORITY OVERRIDE -SET AND   @I241 03616700
*                        TESTED IN IEFVEA                         @I241 03636700
ORFLG2SW EQU   1                       SET BIT IN ORFLAGS2              03656700
IWAINTS8 DS    CL1                 FLAGS FOR CKCKPT/RESTART.      @AAAA 03676700
*                                       BITS 0 AND 1 MUST BE ZERO @AAAA 03696700
JOBRDNR  EQU   32                       BIT-2 RD=NR               @AAAA 03716700
JOBRDNC  EQU   16                       BIT-3 RD=NC OR RD=RNC     @AAAA 03736700
JOBRDR   EQU   8                        BIT-4 RD=R OR RD=RNC      @AAAA 03756700
*                                       BITS 5 - 7 MUST BE ZERO   @AAAA 03776700
JBCONCAT DS    CL1                 NBR OF JOBLIB SIOTS.                 03796700
IWAWRNMS DS    CL1                 WARNING MSG CODE.            @Y02668 03816700
IWAJBADR DS    CL1                 ADDRSPC PARAM ON JOB STMT.   @Y01029 03836700
CRSW1    DS    CL1                CHECKPOINT RESTART SWITCHES     @AACA 03856700
CPDUM    EQU   32   BIT 2         DUMMY SCT REQUIRED-STEP FLUSH   @AACA 03876700
IWANELEN DS    CL1                 LENGTH OF NEL.                       03896700
DDINO    DS    CL1                 DD INTERNAL NO. FOR SIOT             03916700
DDSWX1   DS    CL1                DD SWITCHES                   @Y01113 03936700
SDDNSWA  EQU   DDSWX1              SWITCH FOR SEARCH DDNAME REF TABLE   03956700
SDDNSW   EQU   X'80'                                                    03976700
IWAJCAT  EQU   X'20'              JOB CAT SWITCH                @Y01113 03996700
IWASCAT  EQU   X'10'              STEP CAT SWITCH               @Y01113 04016700
IWASCAT2 EQU   X'08'               STEPCAT FOUND SWITCH.                04036700
IWASNUMB DS    CL1                 NUMBER OF STEPS.             @Y02668 04056700
*                                                               @Y02668 04076700
AOSW2    DS    CL1                                              @Y02668 04096700
AODFLTKW EQU   X'01'               DEFAULT OK THIS KEYWORD.     @Y02668 04116700
AOMAXERR EQU   X'02'               STATIC DD MAX EXCEEDED.      @Y02668 04136700
AONOREAD EQU   X'04'               BYPASS READ OF TEXT STRING.  @Y02668 04156700
IWASJFFG DS    CL1         SCHEDULER JCL FACILITY ASSOCIATED FLAGS @H1C 04176700
JDTEXFLG EQU   X'80'             EXIT FLAG FOR IEFVJDTI            @H1A 04196700
JDTPRC   EQU   X'40'            JDT-DEFINED JCL PROCESSING ENABLED @H1A 04216700
JCLPLIM  EQU   X'20'            'JCL USAGE LIMITED' MESSAGE FLAG   @H1A 04236700
NIBBLE   EQU   X'10'            USED IN HEX CONVERSION             @H1A 04256700
ALPHASW  EQU   X'08'            INDICATE ALPHABETIC CHARACTER      @H1A 04276700
NATIONSW EQU   X'04'            INDICATE NATIONAL CHARACTER        @H1A 04296700
NUMERSW  EQU   X'02'            INDICATE NUMERIC CHARACTER         @H1A 04316700
SPECALSW EQU   X'01'            INDICATE SPECIAL CHARACTER         @H1A 04336700
         DS    0F                       ALIGNMENT.                 @L7C 04356700
SREFB    DS    CL176                    DICTIONARY 1 (INPUT)            04376700
         DS    0F                       ALIGNMENT.                      04396700
DREFB    DS    CL176                    DICTIONARY 2 (SEARCH)           04416700
         DS    0F                       ALIGNMENT.                      04436700
JCT      DS    CL176                     JOB CONTROL TABLE (JCT)        04456700
         DS    0F                                                       04476700
JCTX     DS    CL176     JOB CONTROL TABLE EXTENSION(JCTX).    @Z40RPSM 04496700
DNRT     DS    CL78                DDNAME REFERENCE TABLE               04516700
IWASJFF2 DS    CL1                 SCHEDULER JCL FACILITY ASSOC.   @D1A 04536700
*                                  FLAGS                           @D1A 04556700
BLANKSW  EQU   X'80'               INDICATE A BLANK CHARACTER      @D1A 04576700
         DS    CL1                 RESERVED                        @D1A 04596700
         DS    0F                       ALIGNMENT.                      04616700
SCT      DS    CL176                     STEP CONTROL TABLE (SCT)       04636700
         DS    0F                       ALIGNMENT.                      04656700
DSNAME   DS    CL176                     DATA SET NAME TABLE (DSNAME)   04676700
SPSAV    DS    CL20                SPLIT PROCESSOR WORK AREA.  @YM01325 04696700
IWASJFNP DS    F             PTR TO SJF FIND SWB PARM LIST         @H1A 04716700
*                            Sublist pointer moved to local work area  +04736700
                               (IEFVJDTI)                         1@L5D 04756700
IWAESTAE DS    F             INTERPRETER ESTAE TOKEN FIELD         @L1C 04776700
IWASUBS2 DS    F             REG. 14 SAVE AREA FOR IEFVJDTI        @H1A 04796700
RBLOCK   DS    7F            Block of unnamed reserved words       @06C 04800000
IWAEPAWA DS    CL32          Area used to construct EPAs for SWA       +04803300
                               Manager calls                       @06A 04806600
IWASJVAP DS    F             Pointer to SJF Validate parameter         +04809900
                               list                                @L5A 04829700
IWAJSCBF DS    F             PTR TO FIRST JSCB IN JSCB CHAIN.  @YM04108 04836700
IWAJSCBA DS    F             PTR TO ACTIVE JSCB.               @YM04108 04856700
IWALWLGN DS    F             LENGTH OF LWA FOR IEFVHN TO FREE  @Z40MPTH 04876700
IWAPRFMF DS    CL2           PERFORMANCE GROUP NUMBER          @G743P2E 04896700
UNQSYS   DS    CL2           Unique system identifier              @P6A 04916700
AOQLOCEX DS    CL8           ALT SWA LOC EXIT LIST ENTRY       @G29AN2E 04936700
IWASJEXP DS    F             PTR TO SJF EXTRACT PARM LIST          @H1A 04956700
IWASJWRP DS    F             PTR TO SJF WRITE SWB PARM LIST        @H1A 04976700
*                            ITEXTPTR definition moved to local        +04996700
                               work area (IEFVJDTI)               1@L5D 05016700
IWACRVRB DS    XL1           CURRENT VERB STATEMENT KEY            @H1A 05036700
IWAPOVRB DS    XL1           PREVIOUS OLD VERB KEY                 @H1A 05056700
ERRORCD  DS    XL2           ERROR CODE USED BY JDT-DEFINED JCL    @H1A 05076700
*                            PROCESSING                            @H1A 05096700
*********************************************************************** 05146700
* Definitions of the following fields moved to local work area        * 05196700
* (IEFVJDTI):  ITEXTLEN, COUNT, LEVNUM, CONLEN, LEVLEN, INDX, SCONAR, * 05246700
*              LEVELDC, LEVELUN, IWASJFLR, HEXAREA               12@L5D 05296700
*********************************************************************** 05346700
IWASJFSR DS    F             REG. 13 SAVE AREA WHEN CALLING SJF    @H1A 05416700
IWASUBSR DS    F             REG. 14 SAVE AREA FOR IEFVJDTI        @H1A 05436700
*                             SUBROUTINES                          @H1A 05456700
IWASJFSA DS    18F           REG. SAVE AREA WHEN CALLING SJF       @H1A 05476700
*                            Character string data buffer moved to     +05496700
                               local work area (IEFVJDTI)         1@L5D 05516700
TSIOTA   DS    F             SVA FOR CURRENT ABOVE THE LINE SIOT   @L1A 05536700
TSIOTB   DS    CL3           SVA FOR CURRENT BELOW THE LINE SIOT   @L1A 05550000
         DS    CL1                                                      05563300
SIOTABVE DS    F             SVA FOR NEXT ABOVE THE LINE SIOT      @L1A 05576700
SIOTBELW DS    F             SVA FOR NEXT BELOW THE LINE SIOT      @L1A 05596700
JFCBABVE DS    F             SVA FOR NEXT ABOVE THE LINE JFCB      @L1A 05616700
JFCBELOW DS    F             SVA FOR NEXT BELOW THE LINE JFCB      @L1A 05636700
JFCXABVE DS    F             SVA FOR NEXT ABOVE THE LINE JFCBX     @R2C 05656700
JFCEABVE DS    F             SVA FOR NEXT ABOVE THE LINE JFCBE     @R2A 05676700
JFCXBELW DS    F             SVA FOR NEXT BELOW THE LINE JFCBE     @L1A 05696700
DSNTNEXT DS    F             SVA FOR NEXT DSNT                     @L1A 05716700
SCTNEXT  DS    F             SVA FOR NEXT SCT                      @L1A 05736700
SCTXNEXT DS    F             SVA FOR NEXT SCT EXTENSION            @L1A 05756700
POTNEXT  DS    F             SVA FOR NEXT PROCEDURE OVERRIDE TABLE @L1A 05776700
DSNQNXT  DS    F             SVA FOR NEXT DSENQ TABLE              @L1A 05796700
JACTNEXT DS    F             SVA FOR NEXT JOB ACT                  @L1A 05816700
SACTNEXT DS    F             SVA FOR NEXT STEP ACT                 @L1A 05836700
AMPXNEXT DS    F             SVA FOR NEXT AMPX                     @L1A 05856700
REFRNEXT DS    F             SVA FOR NEXT REFER BACK DICTIONARY    @L1A 05876700
*                                                                  @L1A 05896700
*                            IWAINSVA definition moved to local        +05916700
                               work area (IEFVHE)                  @L5C 05936700
IWASSOB  DS    F                   POINTER TO STORAGE MANAGEMENT   @L3C 05943300
*                                  SUBSYSTEM SSOB                  @L3C 05949900
IWATUXP  DS    A             POINTER TO TRACE BUFFER USED FOR      @L4A 05950600
*                            TRACING IEFUJV EXIT                   @L4A 05951300
IWACRECP DS    A             PTR TO CURRENT TRACE RECORD           @L4A 05952000
IWAGTRCP DS    A             POINTER TO GTRACE PARM LIST           @L4A 05952700
IWAIFTOS DS    H             INDEX TO IF STMT AT TOP OF STACK      @L4A 05953400
IWAIFSTK DS    0CL47         STACK OF SVAS FOR UP TO 15 IF STMTS   @L4A 05954100
IWAIFMSK DS    2C            MASK CORRESPONDING TO EACH IF STMT    @L4A 05954800
IWAIFSVA DS    15CL3         SVA ENTRIES FOR 15 IF STMTS           @L4A 05955500
IWAIFRES DS    CL3           Reserved for future use               @03A 05956400
*                                                                       05957300
IWASAVAL DS    0CL64         INTERPRETER WORK AREA FOR SAVING          +05958200
                                MISCELLANEOUS VALUES               @01A 05959100
AOWSAV   DS    F             SAVE THE VALUE OF AOWSTMT IN IEFVHH       +05960000
                                BEFORE SWAPPING OCCURS             @01A 05960900
BKPROCS  DS    15CL4         ARRAY OF PROC OFFSETS FOR NESTED          +05964000
                                PROCEDURES (BACK LEVEL PROCS)      @03A 05965500
IWASAMIS DS    0CL64         INTERPRETER WORK AREA FOR SAVING          +05967000
                                MISCELLANEOUS VALUES               @04A 05968500
EATEMP4  DS    F             TEMP VAR TO SAVE OVERRIDE TIME        @04A 05970000
IWAGTKP  DS    F             POINTER TO IEFCISCN PARAMETER LIST    @03A 05970200
         DS    CL1           RESERVED FOR FUTURE USE               @L7A 05970300
TSIOXA   DS    CL3           SVA FOR CURRENT ABOVE THE LINE SIOTX  @L7C 05970400
         DS    CL1           RESERVED FOR FUTURE USE               @L7A 05970500
SIOXABVE DS    CL3           SVA FOR NEXT ABOVE THE LINE SIOTX     @L7A 05970600
LPRPROC  DS    0F            TEMP VAR TO HOLD RELPROC              @03A 05970700
LPROFF   DS    C             OFFSET OF PROC ENTRY IN DICTIONARY    @03A 05970800
LPRDTSVA DS    CL3           SVA OF DICTIONARY CONTAINING PROC     @03A 05971000
SAVECALL DS    F             TEMP VAR TO SAVE R14 IN IEFVEA        @05A 05971500
CILEVEL  DS    CL1           THE LEVEL FOR EACH C/I TEXT           @03A 05972200
SAVLEVEL DS    CL1           THE LEVEL FOR PROC ENTRY              @03A 05972900
IWAFLGS  DS    CL1           Internal work Flags.                  @08A 05973000
QMPACWA  EQU   X'80'         QMPA has been copied to CWA.          @08A 05973100
         DS    CL1           Reserved for future use               @08C 05973200
IWAUJV6  DS    F             Calling Subsystem's environmental     @P4A 05973300
*                            information                           @P4A 05973700
IWADXWA@ DS    A             Address of dynamic exit work area     @L6A 05973900
         DS    CL1           RESERVED FOR FUTURE USE               @L7A 05974000
TSIOXB   DS    CL3           SVA FOR CURRENT BELOW THE LINE SIOTX  @L7A 05974100
TBLKSZLM DS    CL8           Blocksize Limit Value                 @09A 05974350
*                            Deleted IWASVAS and IWASVAJ          2@0BD 05974429
IWAMRES  DS    CL16          Reserved for future use               @0BC 05974449
IWAWORK  DS    CL372         Work area for Interpreter modules.        +05974500
                               This area cannot be used for data       +05974600
                               that must be communicated between       +05974700
                               modules or retained between             +05974800
                               invocations of a module.            @L5A 05974900
*                                                                       05975300
*          ********************************************************     05976700
*          *                                                      *     05996700
*          *             END OF INTERPRETER WORK AREA             *     06020000
*          *                                                      *     06040000
*          ********************************************************     06060000
*                                                                       06080000
INTWAEND DS    0D                                               @Y02668 06090000
INTWALTH EQU   INTWAEND-INTWA      LTH OF INT WORK AREA.        @Y02668 06100000
WALTH    EQU   INTWAEND-COMWA      LTH OF INT+COMMON WORK AREAS @Y02668 06110000
         MEND                                                           06120000
**/                                                                     06170000
*%INTWAPLS:;                                                            06220000
*DCL                                                                    06270000
* 1 INTWA BASED(ADDR(COMWA)+LENGTH(COMWA)) BDY(WORD),     /*  @Y02668*/ 06320000
*   2 IWAINTS5 PTR(31),      /* PTR TO JOB MNGMT RECORD       @Y02668*/ 06370000
*   2 TSIOT    PTR(31),      /* NEXT AVAILABLE SIOT SVA       @Y02668*/ 06420000
*                                                                       06470000
*/*  SVA'S OF TABLES IN THE QUEUE                             @Y02668*/ 06520000
*                                                                       06570000
*   2 TJOBLIB  PTR(31),      /* SVA OF JOBLIB SIOT            @Y02668*/ 06620000
*   2 TSREFB   PTR(31),      /* SVA OF FIRST DICTIONARY       @Y02668*/ 06670000
*     3 TSREFSVA CHAR(3),    /* CONTAIN THE SVA                  @03A*/ 06686600
*     3 *        CHAR(1),    /* UNUSED                           @03A*/ 06703200
*   2 TACT     PTR(31),      /* SVA OF OVERRIDE ACT           @Y02668*/ 06742900
*   2 TPROC    PTR(31),      /* NEXT PROC OVERRIDE TABLE      @Y02668*/ 06782600
*   2 RELPROC  PTR(31),      /* OFFSET LAST PROC/ SVA DICT    @Y02668*/ 06822300
*   2 RELPGM   PTR(31),      /* OFFSET LAST PGM/ SVA DICT     @Y02668*/ 06862000
*   2 DSENQTP  PTR(31),      /* POINTER TO DSENQ TABLE        @Y02668*/ 06901700
*   2 IWAJOBS1 CHAR(8),      /* CHKPT/RESTART - CALLING                 06941400
*                               STEPNAME                      @Y02668*/ 06981100
*   2 IWAJOBS3 CHAR(8),      /* CHKPT/RESTART - STEPNAME OR             07020800
*                               PROCSTEPNAME                  @Y02668*/ 07060500
*   2 IWAJOBS6 FIXED(31),    /* REGION SIZE ON JOB STMT       @Y02668*/ 07100200
*   2 IWASTAPL PTR(31),      /* PTR TO C/I STAE PARM LIST     @Y02668*/ 07139900
*   2 IWAEXPNO FIXED(32),    /* EXEC PROC STMT NUMBER        @YM02714*/ 07179600
*   2 CRNTDATE CHAR(4),      /* FULLY QUALIFIED CURRENT DATE            07220000
*                               - CCYYDDDF                       @L2C*/ 07270000
*   2 IWAJMRPT PTR(31),      /* POINTER TO JMR                @Y02668*/ 07311400
*   2 TSAVEP   CHAR(8),      /* WORK AND REG SAVE AREA        @Y02668*/ 07352800
*   2 IWAJSIOT PTR(31),      /* SVA OF JOB CAT SIOT           @Y02668*/ 07394200
*   2 IWASCTAD PTR(31),      /* ADDRESS OF SCT                @Y02668*/ 07435600
*   2 IWASIOTP PTR(31),      /* ADDRESS OF SIOT               @Y02668*/ 07477000
*   2 IWAJFCBP PTR(31),      /* ADDRESS OF JFCB               @Y02668*/ 07518400
*   2 DSNTPSA  PTR(31),      /* DSNT PROCESSING RTNE REG SA.  @Y02668*/ 07559800
*   2 IWASAVPT PTR(31),      /* SAVE AREA OF INT. CALLER      @Y02668*/ 07601200
*   2 AOJRNLEX CHAR(8),      /* JRNL/MERGE EXIT LIST ENTRY    @Y02668*/ 07642600
*   2 ORIDSNM  CHAR(8),      /* NAME OF NEXT PROC STEP                  07684000
*                               OVERRIDDEN                    @Y02668*/ 07725400
*   2 UNQNAME  CHAR(23),     /* UNIQUE NAME QUALIFIER            @02A*/ 07766800
*     4 UNQSDATE,            /* SYSYYDDD - Date portion of generated    07808200
*                               name                             @02A*/ 07827300
*       6 UNQSYSD   CHAR(3), /* SYS      - CONSTANT "SYS"        @02C*/ 07846400
*       6 UNQDATE,           /* YYDDD    - DATE                  @02C*/ 07865500
*         8 UNQYEAR  CHAR(2),/* YY       - YEAR                  @02C*/ 07884600
*         8 UNQDAY   CHAR(3),/* DDD      - DAY                   @02C*/ 07903700
*     4 UNQDATEP  CHAR(1),   /* "."      - Date delimiter        @02C*/ 07922800
*     4 UNQTTIME,            /* Tnnnnnn  - TIME                  @02C*/ 07941900
*       6 UNQTIMET  CHAR(1), /* T        - CONSTANT "T"          @02C*/ 07961000
*       6 UNQTSTMP  CHAR(6), /* nnnnnn   - TIME STAMP            @02C*/ 07980100
*     4 UNQTIMEP  CHAR(1),   /* "."      - Time delimiter        @02C*/ 07999200
*     4 UNQSVRID,            /* XYZZZ    - Unique Identifier     @02C*/ 08018300
*       6 UNQSVRDT CHAR(1),  /* X        - ALPHA CHARACTER       AADA   08037400
*                                          DENOTING DATASET TYPE        08056500
*                                          - CURRENTLY SPECIFIED        08075600
*                                          AS 'R' (SYSIN)        @02C*/ 08094700
*       6 UNQSVRSN CHAR(1),  /* Y        - ALPHA CHARACTER       AADA   08113800
*                                          DENOTING SYSTEM VERSION.     08132900
*                                          CURRENTLY SPECIFIED AS "A"   08152000
*                                          A = VS2/RELEASE 2     @02C*/ 08171100
*       6 UNQSVRCT CHAR(3),  /* ZZZ      - 3 NUMERIC CHARACTERS  AADA   08190200
*                                          FOR UNIQUENESS - currently   08209300
*                                          set to "000"          @02C*/ 08228400
*     4 UNQSVRP   CHAR(1),   /* "."      - Unique Identifier            08247500
*                                          delimiter             @02C*/ 08266600
*/********************************************************************/ 08285700
*/*                                                            16@02A*/ 08304800
*/* SYSYYDDD.TTTTTTT.XYZZZ.JOBNAME.&NAME OR .UNIQUE NO.              */ 08323900
*/*                                                                  */ 08343000
*/* SYSYYDDD - CONSTANT "SYS" FOLLOWED BY FIVE NUMERIC CHARACTERS    */ 08362100
*/*            DENOTING DATE                                         */ 08381200
*/* TTTTTTT  - CONSTANT "T" FOLLOWED BY A SIX CHARACTER NUMERIC      */ 08400300
*/*            TIME STAMP                                            */ 08419400
*/* XYZZZ    - X= ONE ALPHA CHARACTER DENOTING DATASET TYPE          */ 08438500
*/*               "R" - R= SYSIN/TEMPORARY                           */ 08457600
*/*            Y= ONE ALPHA CHARACTER DENOTING SYSTEM VERSION AS     */ 08476700
*/*               "A" - A= VS2/RELEASE 2                             */ 08495800
*/*            ZZZ= THREE NUMERIC CHARACTERS FOR UNIQUENESS          */ 08514900
*/* JOBNAME  - NAME OF JOB FOR WHICH THE DATA SET WAS GENERATED      */ 08534000
*/*        JOBNAME is followed by one of these two fields:           */ 08553100
*/* &NAME    - AN ALPHANUMERIC FIELD CONTAINING THE "NAME"           */ 08572200
*/*            PORTION OF AN &NAME                                   */ 08591300
*/* UNIQUE # - A UNIQUE CHARACTER STRING BEGINNING WITH "R" AND      */ 08610400
*/*            ENDING WITH A NUMERIC VALUE                    @Y02668*/ 08629500
*/********************************************************************/ 08648600
*   2 IWARVBYT CHAR(1),      /* Reserved - HEXNIBBL definition moved    08672400
*                               to local work area (IEFVJDTI)    @L5C*/ 08696200
*   2 UNNU     FIXED(16),    /* UNIQUE NAME SERIAL IN BINARY  @Y02668*/ 08741100
*   2 JEDSWS   FIXED(16),    /* JOB,EXEC, OR DD SWITCHES                08786000
*                               (LWA)                         @Y02668*/ 08830900
*   2 JCTS     FIXED(16),    /* JCT POINTER (IWA)             @Y02668*/ 08875800
*   2 SCTS     FIXED(16),    /* SCT POINTER (IWA)             @Y02668*/ 08920700
*   2 JACTS    FIXED(16),    /* JACT POINTER (LWA)            @Y02668*/ 08965600
*   2 SIOTS    FIXED(16),    /* SIOT POINTER (LWA)            @Y02668*/ 09010500
*   2 JFCBS    FIXED(16),    /* JFCB POINTER (LWA)            @Y02668*/ 09055400
*   2 JFCBXS   FIXED(16),    /* JFCBX POINTER (LWA)           @Y02668*/ 09100300
*   2 DSNAMES  FIXED(16),    /* DSNAME POINTER (IWA)          @Y02668*/ 09145200
*   2 SREFBS   FIXED(16),    /* DICTIONARY 1 PTR (IWA)        @Y02668*/ 09190100
*   2 DREFBS   FIXED(16),    /* DICTIONARY 2 PTR (IWA)        @Y02668*/ 09235000
*   2 POVRRDS  FIXED(16),    /* POVRRD POINTER (IWA)          @Y02668*/ 09279900
*   2 ACTS     FIXED(16),    /* ACT POINTER (IWA)             @Y02668*/ 09324800
*   2 JFCBES   FIXED(16),    /* JFCBE POINTER (LWA)          @Z40MPTH*/ 09370000
*   2 JCTXS    FIXED(16),    /* JCTX PTR (IWA).              @Z40RPSM*/ 09420000
*   2 SIOTXS   FIXED(16),    /* SIOTX POINTER (LWA)              @L7A*/ 09440800
*   2 DDINTNO  FIXED(15),    /* INTERNAL DD SEQUENCE NBR.     @Y02668*/ 09461600
*   2 IWACATCT FIXED(8),     /* COUNT OF CONCATENATED                   09503200
*                               PRIVATE CATALOGS              @Y02668*/ 09544800
*   2 DJBCLAS  FIXED(8),     /* MAXIMUM JOBCLASS              @Y02668*/ 09586400
*   2 DINBPLP1 FIXED(8),     /* BYPASS LABEL PROCESSING DEFLT @Y02668*/ 09628000
*                                                                       09670000
*/*  SWITCH BYTES                                             @Y02668*/ 09720000
*                                                                       09770000
*   2 IWAEXTS,               /* SPECIAL CALLER EXIT           @Y02668*/ 09820000
*     3 *        BIT(7),     /* UNUSED                        @Y02668*/ 09870000
*     3 IWAQENTR BIT(1),     /* SPECIAL QMNGR ENTRY           @Y02668*/ 09920000
*                                                                       09970000
*   2 SWA,                   /* SWITCH A                      @Y02668*/ 10020000
*     3 GTFACTIV BIT(1),     /* GTF ACTIVE                       @L4A*/ 10070000
*     3 JHS      BIT(1),     /* JOB HAS STEP                  @Y02668*/ 10120000
*     3 JCTTQ    BIT(1),     /* JCT TO PUT IN QUEUE           @Y02668*/ 10170000
*     3 SCTTQ    BIT(1),     /* SCT TO PUT IN QUEUE           @Y02668*/ 10220000
*     3 RESTIME  BIT(1),     /* REPLACE RESTART TIME             @04A*/ 10253300
*     3 *        BIT(3),     /* UNUSED                           @04C*/ 10286600
*   2 SWC,                   /* SWITCH C                      @Y02668*/ 10320000
*     3 IWAJCLV  BIT(1),     /* BIT-0 STMT NUM IN TEXT, JCL VERSION     10345000
*                               IN TEXT, AND JDT KEYS RATHER THAN       10370000
*                               KEYWORDS IN TEXT STRING          @L4A*/ 10395000
*     3 IWADDOBJ BIT(1),     /* BIT-1 Last-processed labeled DD         10426200
*                               was the object of a DDNAME              10457400
*                               reference                        @07C*/ 10488600
*     3 IWAPREUP BIT(1),     /* BIT-2 PREVIOUS SIOT/JFCB                10520000
*                               RESIDENCY INDICATOR              @R3A*/ 10570000
*     3 IWASWAUP BIT(1),     /* BIT-3 SELECTED SWA BLOCK                10620000
*                               RESIDENCY INDICATOR              @L1A*/ 10670000
*     3 WAEASIOT BIT(1),     /* BIT-4 IEFVEA WRITE AND ASSIGN           10720000
*                               SIOT INDICATOR                   @L1A*/ 10770000
*     3 DSNTQ    BIT(1),     /* BIT-5 DSN TABLE TO PUT IN QUEUE         10820000
*                                                             @Y02668*/ 10870000
*     3 VOLREF   BIT(1),     /* BIT-6 DSN VOL REF SW ON      @ZA01890*/ 10920000
*     3 IWAPERFM BIT(1),     /* BIT-7 PERFORM SPECIFIED ON JOB STMT     10970000
*                                                            @G743P2E*/ 11020000
*   2 SWD,                   /* SWITCH D                      @Y02668*/ 11070000
*     3 JOBADDRF BIT(1),     /* ADDRSPC ON JOB STMT           @Y02668*/ 11120000
*     3 JOBREGNS BIT(1),     /* REGION ON JOB STMT            @Y02668*/ 11170000
*     3 FEXRCV   BIT(1),     /* FIRST EXEC STMT RECEIVED      @Y02668*/ 11220000
*     3 FDDRCV   BIT(1),     /* FIRST DD STMT RCVD THIS STEP  @Y02668*/ 11270000
*     3 DBFST    BIT(1),     /* FIRST ENTRY TO DSENQ          @Y02668*/ 11320000
*     3 LASTINDC BIT(1),     /* LAST PARM INDICATOR          @ZA01890*/ 11370000
*     3 DCTFST   BIT(1),     /* FIRST DICT ENTRY RCVD         @Y02668*/ 11417900
*     3 TIMDFPRC BIT(1),     /* PROCESS TIME DEFAULT          @Y02668*/ 11465800
*   2 SWF,                   /* SWITCH F                      @Y02668*/ 11513700
*     3 ORPARMOR BIT(1),     /* PARM OVERRIDE                 @Y02668*/ 11561600
*     3 ORPARMBL BIT(1),     /* PARM BLOCK                    @Y02668*/ 11609500
*     3 ORCONDOR BIT(1),     /* COND OVERRIDE                 @Y02668*/ 11657400
*     3 ORTIMEOR BIT(1),     /* TIME OVERRIDE                 @Y02668*/ 11705300
*     3 ORTIME0  BIT(1),     /* TIME ZERO                     @Y02668*/ 11753200
*     3 ORACTOR  BIT(1),     /* ACT OVERRIDE                  @Y02668*/ 11801100
*     3 ORREGOR  BIT(1),     /* REGION OVERRIDE               @Y02668*/ 11849000
*     3 ORADDROR BIT(1),     /* ADDRSPC OVERRIDE              @Y02668*/ 11896900
*   2 SWG,                   /* ADDITIONAL PROCEEDURE                   11944800
*                               SWITCHES                      @Y02668*/ 11992700
*     3 ORRDOR   BIT(1),     /* RD OVERRIDE                   @Y02668*/ 12040600
*     3 ORSDPOR  BIT(1),     /* STEP DISP. PRIORITY OVERRIDE  @Y02668*/ 12088500
*     3 *        BIT(5),     /* UNUSED                        @Y02668*/ 12136400
*     3 ORFLG2SW BIT(1),     /* SET BIT IN ORFLAGS2           @Y02668*/ 12184300
*   2 IWAINTS8,              /* FLAGS FOR CHCKPT/RESTART      @Y02668*/ 12232200
*     3 *        BIT(2),     /* UNUSED - MUST BE ZERO         @Y02668*/ 12280100
*     3 JOBRDNR  BIT(1),     /* RD=NR                         @Y02668*/ 12328000
*     3 JOBRDNC  BIT(1),     /* RD=NC OR RD=RNC               @Y02668*/ 12375900
*     3 JOBRDR   BIT(1),     /* RD=R OR RD=RNC                @Y02668*/ 12423800
*     3 *        BIT(3),     /* UNUSED - MUST BE ZERO         @Y02668*/ 12471700
*   2 JBCONCAT CHAR(1),      /* NBR OF JOBLIB SIOTS           @Y02668*/ 12519600
*   2 IWAWRNMS CHAR(1),      /* WARNING MSG CODE              @Y02668*/ 12567500
*   2 IWAJBADR CHAR(1),      /* ADDRSPC PARM ON JOB STMT      @Y02668*/ 12615400
*   2 CRSW1,                 /* CHECKPOINT/RESTART SWITCHES   @Y02668*/ 12663300
*     3 *        BIT(2),     /* UNUSED                        @Y02668*/ 12711200
*     3 CPDUM    BIT(1),     /* DUMMY SCT REQUIRED-STEP FLUSH @Y02668*/ 12759100
*     3 *        BIT(5),     /* UNUSED                        @Y02668*/ 12807000
*   2 IWANELEN CHAR(1),      /* LENGTH OF NEL                 @Y02668*/ 12854900
*   2 DDINO    CHAR(1),      /* DD INTERNAL NO. FOR SIOT      @Y02668*/ 12902800
*   2 DDSWX1,                /* DD SWITCHES                   @Y02668*/ 12950700
*     3 SDDNSWA,             /* SWITCH FOR SEARCH DDNAME                12998600
*                               REFERENCE TABLE               @Y02668*/ 13046500
*       4 SDDNSW   BIT(1),   /*                               @Y02668*/ 13094400
*       4 *        BIT(1),   /* UNUSED                        @Y02668*/ 13142300
*       4 IWAJCAT  BIT(1),   /* JOB CAT SWITCH                @Y02668*/ 13190200
*       4 IWASCAT  BIT(1),   /* STEP CAT SWITCH               @Y02668*/ 13238100
*       4 IWASCAT2 BIT(1),   /* STEP CAT FOUND SWITCH         @Y02668*/ 13286000
*       4 *        BIT(3),   /* UNUSED                        @Y02668*/ 13333900
*   2 IWASNUMB FIXED(8),     /* NUMBER OF STEPS               @Y02668*/ 13381800
*   2 AOSW2,                 /*                               @Y02668*/ 13429700
*     3 *        BIT(5),     /* UNUSED                        @Y02668*/ 13477600
*     3 AONOREAD BIT(1),     /* BYPASS READ OF TEXT STRING    @Y02668*/ 13525500
*     3 AOMAXERR BIT(1),     /* STATIC DD MAX EXCEEDED        @Y02668*/ 13573400
*     3 AODFLTKW BIT(1),     /* DEFAULT OK THIS KEY WORD      @Y02668*/ 13621300
*   2 IWASJFFG,           /* SCHEDULER JCL FACILITY ASSOC. FLAGS @H1C*/ 13670000
*     3 JDTEXFLG BIT(1),     /* EXIT FLAG FOR IEFVJDTI           @H1A*/ 13720000
*     3 JDTPRC   BIT(1),   /* JDT-DEFINED JCL PROCESSING ENABLED @H1A*/ 13770000
*     3 JCLPLIM  BIT(1),  /* JCL PROCESSING LIMITED MESSAGE FLAG @H1A*/ 13820000
*     3 NIBBLE   BIT(1),  /* USED IN HEX CONVERSION              @H1A*/ 13870000
*     3 ALPHASW  BIT(1),  /* INDICATE ALPHABETIC CHARACTER       @H1A*/ 13920000
*     3 NATIONSW BIT(1),  /* INDICATE NATIONAL CHARACTER         @H1A*/ 13970000
*     3 NUMERSW  BIT(1),  /* INDICATE NUMERIC CHARACTER          @H1A*/ 14020000
*     3 SPECALSW BIT(1),  /* INDICATE SPECIAL CHARACTER          @H1C*/ 14070000
*   2 *        CHAR(2),   /* RESERVED                            @L7A*/ 14088700
*   2 SREF     CHAR(176) BDY(WORD),  /* DICTIONARY 1 (INPUT)  @Y02668*/ 14107500
*   2 DREFB    CHAR(176) BDY(WORD),  /* DICTIONARY 2 (SEARCH) @Y02668*/ 14145000
*   2 JCT      CHAR(176) BDY(WORD),  /* JOB CONTROL TABLE               14182500
*                                      (JCT)                  @Y02668*/ 14220000
*   2 JCTX     CHAR(176) BDY(WORD),  /*JOB CONTROL TABLE                14257500
*                                       EXTENSION (JCTX)     @Z40RPSM*/ 14295000
*   2 DNRT     CHAR(78),             /* DD REFERENCE TABLE    @Y02668*/ 14332500
*   2 IWASJFF2,           /* SCHEDULER JCL FACILITY ASSOC. FLAGS @D1A*/ 14370000
*     3 BLANKSW  BIT(1),     /* TO INDICATE A BLANK CHARACTER    @D1A*/ 14420000
*     3 *        BIT(7),     /* RESERVED                         @D1A*/ 14470000
*   2 *        CHAR(1),      /* RESERVED                         @D1A*/ 14520000
*   2 SCT      CHAR(176) BDY(WORD),  /* STEP CTL TABLE (SCT)  @Y02668*/ 14553300
*   2 DSNAME   CHAR(176) BDY(WORD),  /* DATA SET NAME TABLE             14586600
*                                       (DSNAME)             @YM01325*/ 14619900
*   2 SPSAV    CHAR(20)  BDY(WORD),  /* SPLIT PROCESSOR WORK AREA       14653200
*                                                            @YM01325*/ 14686500
*   2 IWASJFNP PTR(31),              /* PTR TO SJF FIND SWB PARM LIST   14720000
*                                                                @H1A*/ 14770000
*                           /* Sublist pointer moved to local work      14820000
*                              area (IEFVJDTI)                  1@L5D*/ 14870000
*   2 IWAESTAE PTR(31),     /* INTERPRETER ESTAE TOKEN FIELD     @L1C*/ 14920000
*   2 IWASUBS2 PTR(31),     /* REG. 14 SAVE AREA FOR IEFVJDTI    @H1A*/ 14970000
*   2 RBLOCK   CHAR(28)  BDY(WORD),  /* Block of reserved words  @06C*/ 14978300
*   2 IWAEPAWA CHAR(32),     /* Area used to construct EPAs for         14986600
*                               SWA Manager calls                @06A*/ 14994900
*   2 IWASJVAP PTR(31),      /* Pointer to SJF Validate parameter       15003200
*                               list                             @L5A*/ 15053000
*   2 IWAJSCBF   PTR(31),    /* PTR TO FIRST JSCB IN CHAIN   @YM04108*/ 15070000
*   2 IWAJSCBA   PTR(31),    /* PTR TO ACTIVE JSCB           @YM04108*/ 15120000
*   2 IWALWLGN FIXED(32),    /* LENGTH OF LWA FOR IEFVHN     @Z40MPTH*/ 15170000
*   2 IWAPRFMF CHAR(2),      /* PERFORMANCE GROUP NUMBER     @G743P2E*/ 15220000
*   2 UNQSYS   CHAR(2),      /* Unique system identifier         @P6A*/ 15270000
*   2 AOQLOCEX CHAR(8),      /* ALT SWA LOC EXIT LIST ENTRY  @G29AN2E*/ 15320000
*   2 IWASJEXP PTR(31),      /* PTR TO SJF EXTRACT PARM LIST     @H1A*/ 15370000
*   2 IWASJWRP PTR(31),      /* PTR TO SJF WRITE SWB PARM LIST   @H1A*/ 15420000
*                            /* ITEXTPTR definition moved to local      15470000
*                                 work area (IEFVJDTI)          1@L5D*/ 15520000
*   2 IWACRVRB FIXED(8),     /* CURRENT VERT STATEMENT KEY       @H1A*/ 15570000
*   2 IWAPOVRB FIXED(8),     /* PREVIOUS OLD VERB STATEMENT KEY  @H1A*/ 15620000
*   2 ERRORCD FIXED(16),    /* ERROR CODE WHEN PROCESSING JDT-DEFINED   15670000
*                               JCL                              @H1A*/ 15720000
*/********************************************************************/ 15770000
*/* Definitions of the following fields moved to local work area     */ 15820000
*/* (IEFVJDTI):  ITEXTLEN, COUNT, LEVNUM, CONLEN, LEVLEN, INDX,      */ 15870000
*/*              SCONAR, LEVELDC, LEVELUN, IWASJFLR, HEXAREA   12@L5D*/ 15920000
*/********************************************************************/ 15970000
*   2 IWASJFSR PTR(31),    /* REG. 13 SAVE AREA WHEN CALLING SJF @H1A*/ 16470000
*   2 IWASUBSR FIXED(31),   /* REG. 14 SAVE AREA FOR IEFVJDTI           16520000
*                                      SUBROUTINES               @H1A*/ 16570000
*   2 IWASJFSA(18) FIXED(31), /* REG SAVE AREA WHEN CALLING SJF  @H1A*/ 16620000
*                            /* Character string data buffer moved to   16670000
*                                 local work area (IEFVJDTI)    1@L5D*/ 16720000
*   2 TSIOTA FIXED(31),      /* SVA FOR CURRENT ABOVE THE               16770000
*                               LINE SIOT                        @L1A*/ 16820000
*   2 TSIOTB FIXED(31),      /* SVA FOR CURRENT BELOW THE               16870000
*                               LINE SIOT                        @L1A*/ 16920000
*   2 SIOTABVE FIXED(31),    /* SVA FOR NEXT ABOVE THE LINE SIOT @L1A*/ 16970000
*   2 SIOTBELW FIXED(31),    /* SVA FOR NEXT BELOW THE LINE SIOT @L1A*/ 17020000
*   2 JFCBABVE FIXED(31),    /* SVA FOR NEXT ABOVE THE LINE JFCB @L1A*/ 17070000
*   2 JFCBELOW FIXED(31),    /* SVA FOR NEXT BELOW THE LINE JFCB @L1A*/ 17120000
*   2 JFCXABVE FIXED(31),    /* SVA FOR NEXT ABOVE THE LINE JFCBX       17170000
*                                                                @R2C*/ 17220000
*   2 JFCEABVE FIXED(31),    /* SVA FOR NEXT ABOVE THE LINE JFCBE       17270000
*                                                                @R2A*/ 17320000
*   2 JFCXBELW FIXED(31),    /* SVA FOR NEXT BELOW THE                  17370000
*                                LINE JFCBE                      @L1A*/ 17420000
*   2 DSNTNEXT FIXED(31),    /* SVA FOR NEXT DSNT                @L1A*/ 17470000
*   2 SCTNEXT FIXED(31),     /* SVA FOR NEXT SCT                 @L1A*/ 17520000
*   2 SCTXNEXT FIXED(31),    /* SVA FOR NEXT SCT EXTENSION       @L1A*/ 17570000
*   2 POTNEXT FIXED(31),     /* SVA FOR NEXT PROCEDURE OVERRIDE         17620000
*                               TABLE                            @L1A*/ 17670000
*   2 DSNQNXT FIXED(31),     /* SVA FOR NEXT DSENQ TABLE         @L1A*/ 17720000
*   2 JACTNEXT FIXED(31),    /* SVA FOR NEXT JOB ACT             @L1A*/ 17770000
*   2 SACTNEXT FIXED(31),    /* SVA FOR NEXT STEP ACT            @L1A*/ 17820000
*   2 AMPXNEXT FIXED(31),    /* SVA FOR NEXT AMPX                @L1A*/ 17870000
*   2 REFRNEXT FIXED(31),    /* SVA FOR NEXT REFER BACK                 17920000
*                               DICTIONARY                       @L1A*/ 17970000
*                            /* IWAINSVA definition moved to local      18020000
*                               work area (IEFVHE)               @L5C*/ 18070000
*   2 IWASSOB  PTR(31),      /* POINTER TO STORAGE MANAGEMENT           18086600
*                               SUBSYSTEM SSOB                   @L3C*/ 18103200
*   2 IWATUXP  PTR(31),      /* POINTER TO TRACE BUFFER FOR TRACING     18104600
*                               IEFUJV EXIT                      @L4A*/ 18106000
*   2 IWACRECP PTR(31),      /* PTR TO CURRENT TRACE RECORD FOR         18107400
*                               IEFUJV EXIT                      @L4A*/ 18108800
*   2 IWAGTRCP PTR(31),      /* POINTER TO GTRACE PARM LIST      @L4A*/ 18110200
*   2 IWAIFTOS FIXED(16),    /* INDEX TO IF STMT AT TOP OF STACK @L4A*/ 18111600
*   2 IWAIFSTK,              /* STACK OF SVAS FOR UP TO 15 IF           18113000
*                               STATEMENTS                       @L4A*/ 18114400
*     3 IWAIFMSK CHAR(2),    /* MASK CORRESPONDING TO EACH IF           18115800
*                               STATEMENTS                       @L4A*/ 18117200
*     3 IWAIFSVA(15)CHAR(3), /* SVA ENTRIES FOR 15 IF STMTS      @L4A*/ 18117300
*   2 IWAIFRES CHAR(3),      /* Reserved for future use          @03A*/ 18117400
*   2 IWASAVAL  CHAR(64) BDY(WORD), /* INTERPRETER WORK AREA FOR        18117700
*                                      SAVING MISCELLANEOUS             18117800
*                                      VALUES                    @01A*/ 18117900
*    3 AOWSAV   PTR(31),     /* SAVE THE VALUE OF AOWSTMT IN IEFVHH     18118000
*                               BEFORE SWAPPING OCCURS           @01A*/ 18118100
*    3 BKPROCS(15) CHAR(4),  /* ARRAY OF PROC OFFSETS FOR NESTED        18119300
*                               PROCS                            @03A*/ 18120500
*   2 IWASAMIS  CHAR(64) BDY(WORD), /* INTERPRETER WORK AREA FOR        18121800
*                                      SAVING MISCELLANEOUS             18125400
*                                      VALUES                    @04A*/ 18129000
*    3 EATEMP4  FIXED(31),   /* TEMP VAR TO SAVE OVERRIDE TIME   @04A*/ 18130100
*    3 IWAGTKP  PTR(31),     /* PTR TO IEFCISCN PARAMETER LIST   @03A*/ 18131200
*    3 TSIOXAPT PTR(31),            /*                           @L7A*/ 18131400
*      4 *        PTR(8),    /* RESERVED                         @L7A*/ 18131600
*      4 TSIOXA   PTR(24),          /* SVA FOR CURR ABOVE THE LINE      18131800
*                                      SIOTX                     @L7A*/ 18132000
*    3 SIOXABPT PTR(31),            /*                           @L7A*/ 18132200
*      4 *        PTR(8),    /*                                  @L7A*/ 18132400
*      4 SIOXABVE PTR(24),          /* SVA FOR NEXT ABOVE THE LINE      18132600
*                                      SIOTX                     @L7A*/ 18132800
*    3 LPRPROC  PTR(31),     /* TEMP VAR TO HOLD RELPROC         @03A*/ 18133400
*     4 LPROFF FIXED(8),     /* OFFSET OF PROC ENTRY IN DICTIONARY      18134500
*                                                                @03A*/ 18135600
*     4 LPRDTSVA CHAR(3),    /* SVA OF DICTIONARY CONTAINING PROC       18136700
*                                                                @03A*/ 18137800
*    3 SAVECALL PTR(31),     /* TEMP VAR TO SAVE R14 IN IEFVEA   @05A*/ 18138900
*    3 CILEVEL  FIXED(8),    /* THE LEVEL FOR EACH C/I TEXT      @03A*/ 18140000
*    3 SAVLEVEL FIXED(8),    /* THE LEVEL FOR PROC ENTRY         @03A*/ 18141100
*    3 IWAFLGS  CHAR(1),     /* Internal work Flags.             @08A*/ 18141200
*     4 QMPACWA  BIT(1),     /* QMPA has been copied to CWA.     @08A*/ 18141300
*     4 *        BIT(7),     /* RESERVED                         @08A*/ 18141400
*    3 *        CHAR(1),     /* Reserved for future use          @08C*/ 18141500
*    3 IWAUJV6  FIXED(31),   /* Calling Subsystem's environmental       18141600
*                               information                      @P4A*/ 18142100
*    3 IWADXWA@ PTR(31),     /* Dynamic exit work area address   @L6A*/ 18142500
*    3 TSIOXBPT PTR(31),            /*                           @L7C*/ 18142600
*      4 *        PTR(8),    /* RESERVED                         @L7A*/ 18142700
*      4 TSIOXB   PTR(24),          /* SVA FOR CURR BELOW THE LINE      18142800
*                                      SIOTX                     @L7C*/ 18142900
*    3 TBLKSZLM CHAR(8),     /* Blocksize Limit Value            @09A*/ 18143190
*                            /* Deleted IWASVAS and IWASVAJ     2@0BD*/ 18143310
*    3 IWAMRES  CHAR(16),    /* Reserved for future use          @0BC*/ 18143330
*   2 IWAWORK CHAR(372) BDY(WORD); /* Work area for Interpreter         18143400
*                                     modules. This area cannot be      18147000
*                                     used for data that must be        18150600
*                                     communicated between modules      18154200
*                                     or retained between               18157800
*                                     invocations of a module.   @L5A*/ 18161400
*/********************************************************************/ 18165300
*/*                                                                  */ 18170000
*/*  END OF INTERPRETER WORK AREA -                           @Y02668*/ 18220000
*/*  TO GET THE LENGTH OF THE INTERPRETER WORK AREA USE THE   @Y02668*/ 18270000
*/*  LENGTH FUNCTION OF THE NAME INTWA                        @Y02668*/ 18320000
*/*                                                                  */ 18370000
*/********************************************************************/ 18420000
