* % GOTO EREPLPRO;   /*                                      @G860P2R   00050000
         MACRO                                                          00100000
         IEFZB9RD                                                       00150000
.*/ %EREPLPRO: ;     /*                                      @G860P2R*/ 00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME = IEFZB9RD                                   @G860P2R*/ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = CONVERTER/INTERPRETER ESTAE RECOVERY  @G86OP2R*/ 00450000
*/*                    PARAMETER LIST                        @G860P2R*/ 00500000
*/*                                                                  */ 00550000
*/* COPYRIGHT = 5740-XC6 COPYRIGHT IBM CORP., 1981           @G860P2R*/ 00600000
*/*             LICENSED MATERIAL - PROGRAM, PROPERTY        @G860P2R*/ 00650000
*/*             OF IBM, REFER TO COPYRIGHT INSTRUCTIONS      @G860P2R*/ 00700000
*/*             FORM NUMBER G120-2083                        @G860P2R*/ 00750000
*/*                                                                  */ 00800000
*/* STATUS = OS/VS2 HBB2102                                  @G860P2R*/ 00850000
*/*                                                                  */ 00900000
*/* MODULE TYPE = MACRO                                      @G860P2R*/ 00950000
*/*                                                                  */ 01000000
*/* INVOCATION =                                             @G860P2R*/ 01050000
*/*                                                                  */ 01100000
*/*           PL/S - DCL EREPLPTR PTR(31)                    @G860P2R*/ 01150000
*/*                  %INCLUDE SYSLIB(IEFZB9RD)               @G860P2R*/ 01200000
*/*                                                                  */ 01250000
*/*           BAL  - DSECT IS GENERATED                      @G860P2R*/ 01300000
*/*                                                                  */ 01350000
*/* NOTES =                                                  @G860P2R*/ 01400000
*/*                                                                  */ 01450000
*/*  THIS MACRO CONTAINS INFORMATION REQUIRED BY THE CONVERTER       */ 01500000
*/*  AND INTERPRETER ESTAE RECOVERY ROUTINES.                        */ 01550000
*/*                                                                  */ 01600000
*/* CHANGE ACTIVITY = G860P2R,G860P2N                        @G860P2N*/ 01650000
*/*                                                                  */ 01700000
*/********************************************************************/ 01750000
*/* A - FIELDS ADDED TO SUPPORT DUMP TITLE                   @G860P2R*/ 01800000
*/* A - FIELDS ADDED TO SUPPORT REASON CODE IN MESSAGE       @G860P2N*/ 01850000
*/*                                                                  */ 01900000
*        %GOTO EREPLBSL; /*                                             01950000
EREPL    DSECT                                                          02000000
*                                                                       02050000
EREPLCWA DS    F     POINTER TO CWA FOR CONVERTER ESTAE EXIT.           02100000
EREPLIWA DS    F     POINTER TO IWA FOR INTERPRETER ESTAE EXIT.         02150000
EREPLRSV DS    F     ADDRESS OF CALLER'S SAVEAREA                       02200000
EREPFLGS EQU   *     BEGINNING OF INDICATOR FLAGS.                      02250000
EREPFLG1 DS    B     FLAGS                                              02300000
EREPRCUR EQU   X'80' RECURSION BIT.IF ENTRY TO EXIT ROUTINE IS MADE     02350000
*                    WITH THIS BIT ON,THEN AN ABEND DURING RECOVERY     02400000
*                    ATTEMPT OCCURRED.                                  02450000
EREPRES1 DS    XL3   RESERVED                                 @G860P2R  02500000
EREPRES2 DS    F     RESERVED                                 @G860P2R  02550000
EREPCMPC DS    CL3   ABEND CODE PASSED BY RTM                 @G860P2R  02600000
EREPUNCC DS    CL5   UNPACKED ABEND CODE                      @G860P2R  02650000
         ORG   EREPUNCC                                       @G860P2R  02700000
EREPTRCC DS    CL3   TRANSLATED ABEND CODE                    @G860P2R  02750000
         ORG   EREPUNCC+5                                     @G860P2R  02800000
EREPDTLE DS    CL58  DYNAMIC DUMP TITLE                       @G860P2R  02850000
         ORG   EREPDTLE+7                                     @G860P2R  02900000
EREPABCD DS    CL3   ABEND CODE                               @G860P2R  02950000
         ORG   EREPDTLE+58                                    @G860P2R  03000000
EREPREAS DS    CL5   REASON CODE FROM RTM                     @G860P2N  03050000
EREPUNRC DS    CL9   UNPACKED REASON CODE                     @G860P2N  03100000
EREPRES3 DS    F     RESERVED                                 @G860P2R  03150000
EREPLEN  EQU   *-EREPL  LENGTH OF PARAMETER LIST.                       03200000
         MEND  */                                                       03250000
*%EREPLBSL: ;                                                           03300000
*        DECLARE                                                        03350000
*        1 EREPL BASED(EREPLPTR),                                       03400000
*          2 EREPLCWA PTR(31),    /*POINTER TO CWA-CONVERTER*/          03450000
*          2 EREPLIWA PTR(31),    /*POINTER TO IWA-INTERPRETER*/        03500000
*          2 EREPLRSV PTR(31),    /*ADDRESS OF CALLER'S SAVEAREA*/      03550000
*          2 EREPFLGS,            /*BEGINNING OF FLAG FIELD  */         03600000
*            3 EREPFLG1 BIT(8),   /*FIRST FLAG FIELD */                 03650000
*              4 EREPRCUR BIT(1), /*RECURSION BIT-IF ENTRY IS           03700000
*                                   MADE TO EXIT ROUTINE WITH           03750000
*                                   THIS BIT ON,THEN ABEND OCCURRED     03800000
*                                   DURING RECOVERY PROCESSING. */      03850000
*              4 *        BIT(7), /*RESERVED*/                          03900000
*            3 EREPRES1  BIT(24), /*RESERVED*/                          03950000
*          2 EREPRES2 FIXED(31),  /*RESERVED*/                          04000000
*          2 EREPCMPC CHAR(3),    /*ABEND CODE FROM RTM  @G860P2R*/     04050000
*          2 EREPUNCC CHAR(5),    /*UNPACKED ABEND CODE  @G860P2R*/     04100000
*           3 EREPTRCC CHAR(3),   /*TRANSLATED CODE      @G860P2R*/     04150000
*           3 *        CHAR(2),   /*                     @G860P2R*/     04200000
*          2 EREPDTLE CHAR(58),   /*DYNAMIC DUMP TITLE   @G860P2R*/     04250000
*            3 * CHAR(7),         /*                     @G860P2R*/     04300000
*            3 EREPABCD CHAR(3),  /*ABEND CODE           @G860P2R*/     04350000
*            3 * CHAR(48),        /*                     @G860P2R*/     04400000
*          2 EREPREAS CHAR(5),    /*REASON CODE FROM RTM @G860P2N*/     04450000
*          2 EREPUNRC CHAR(9),    /*UNPACKED REASON CODE @G860P2R*/     04500000
*          2 EREPRES3 CHAR(4);    /*RESERVED             @G860P2R*/     04550000
