*   %GOTO PARAMPRO;   /*                                                00050000
         MACRO                                                          00100000
         IEFZB630                                                       00150000
         SPACE 1      */                                                00200000
*%PARAMPRO: ;                                                           00250000
*/* START OF SPECIFICATIONS ******************************************/ 00253500
*/*                                                                  */ 00253900
*/* MODULE NAME:  IEFZB630                                           */ 00254300
*/*                                                                  */ 00254700
*/* MODULE TYPE:  Bilingual macro                                    */ 00255100
*/*                                                                  */ 00255500
*/* DESCRIPTIVE NAME:  Internal Initiator Parameter List             */ 00255900
*/*                                                                  */ 00256300
*/*01* PROPRIETARY STATEMENT=                                        */ 00257000
*/***PROPRIETARY_STATEMENT********************************************/ 00260500
*/*                                                                  */ 00264000
*/*                                                                  */ 00267500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00271000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00274500
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1979, 1993                      */ 00278000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00281500
*/*                                                                  */ 00285000
*/* STATUS= HBB5510                                                  */ 00288500
*/*                                                                  */ 00292000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00295500
*/*                                                                  */ 00850000
*/* ACRONYM:  IEFPARAM                                               */ 00900000
*/*                                                                  */ 00950000
*/* MACRO NAME:  IEFPARAM                                            */ 01000000
*/*                                                                  */ 01150000
*/* FUNCTION:                                                        */ 01200000
*/*    This macro maps a parameter list passed between several       */ 01250000
*/*    Initiator modules.                                            */ 01300000
*/*                                                                  */ 01400000
*/* DSECT NAME:  IEFPARAM                                            */ 01450000
*/*                                                                  */ 01550000
*/* COMPONENT:  Initiator (SC1B6)                                    */ 01600000
*/*                                                                  */ 01650000
*/* EYE-CATCHER:  None                                               */ 01652700
*/*                                                                  */ 01655400
*/* STORAGE ATTRIBUTES:                                              */ 01658100
*/*                                                                  */ 01660800
*/*   ALLOCATION METHOD:  GETMAIN in module IEFSD162                 */ 01663500
*/*   SUBPOOL:            253                                        */ 01666200
*/*   KEY:                1                                          */ 01668900
*/*   RESIDENCY:          Any                                        */ 01671600
*/*                                                                  */ 01674300
*/* SIZE:                                                            */ 01677000
*/*                                                                  */ 01679700
*/* CREATED BY:  IEFSD162                                            */ 01682400
*/*                                                                  */ 01685100
*/* POINTED TO BY:  STEPARAM (in mapping IEFZB622)                   */ 01687800
*/*                                                                  */ 01690500
*/* DELETED BY:  IEFSD164                                            */ 01693200
*/*                                                                  */ 01695900
*/* SERIALIZATION:  None                                             */ 01698600
*/*                                                                  */ 01701300
*/* FREQUENCY:  One per Initiator                                    */ 01704000
*/*                                                                  */ 01706700
*/* METHOD OF ACCESS:                                                */ 01709400
*/*          ASM  - IEFZB630                                         */ 01712100
*/*          PL/X - %INCLUDE SYSLIB(IEFZB630)                        */ 01714800
*/*                                                                  */ 01717500
*/* PARAMETER DESCRIPTION:  none                                     */ 01720200
*/*                                                                  */ 01722900
*/* DISTRIBUTION LIBRARY:  APVTMACS                                  */ 01725600
*/*                                                                  */ 01728300
*/*01* CHANGE ACTIVITY:                                              */ 01731000
*/*                                                                  */ 01733700
*/* $D1= DCR0083  HBB5510 930517 PDBG: WLM support.              @D1A*/ 01739100
*/*                                                                  */ 01744500
*/**** END OF SPECIFICATIONS *****************************************/ 01747200
*/*                                                                  */ 01747600
*/* D - Delete obsolete fields PARNMEMP & PAROMEMP. They were    @D1A*/ 01748000
*/*     used to pass info to SRM via SYSEVENTS, but as of        @D1A*/ 01748400
*/*     HBBB4440, SRM no longer needs priority information.      @D1A*/ 01748800
*/*                                                                  */ 01749200
*/********************************************************************/ 01749600
* %GOTO PARBSL;                                                         01750000
         SPACE 1                                                        01800000
IEFPARAM DSECT                                                          01850000
IEFUSADD DS    0F                 ADDRESS OF USER PARMETERS             01900000
LCTADDR  DS    0F                 ADDR OF LCT FOR IEFSD164        M0138 01950000
JOBSTCB  DS    1F                 ADDRESS OF JOB STEP TCB               02000000
IEFDCBAD DS    0F                 ADDRESS OF FETCHLIB DCB               02050000
COMPCODE DS    1F                 COMPLETION CODE FOR SVC 34            02100000
IEFREMLS DS    F                  ADDRESS OF ATTACH LIST                02150000
IEFLCTAD DS    F                  ADDRESS OF LCT                        02200000
IEFTCBAD DS    0A                 INITIATOR TCB ADDRESS                 02250000
         DS    B                  RESERVED                       Y02652 02300000
INITTCB  DS    AL3                ADDRESS OF INIT TCB                   02350000
IEFTIOTA DS    F                  ADDRESS OF WORD WHICH POINTS   Y02669 02400000
*                                 TO JOB STEP'S TIOT             Y02669 02450000
IEFECBLT DS    0F                 ECB LIST                              02500000
ATTECBAD DS    F                  ADDRESS OF ATTACH ECB                 02550000
CANECBAD DS    F                  ADDRESS OF CANCEL ECB                 02600000
         DS    C                  Unused                           @D1C 02650000
         DS    C                  Unused                           @D1C 02700000
PARPRFMF DS    CL2                PERFORMANCE GROUP (FROM SCT) @G743P2E 02750000
IEFAECB  DS    F                  ATTACH ECB                            02800000
PARTIOTB DS    F                  ADDRESS OF INIT'S TIOT         Y02653 02850000
PARSRMEC DS    F                  ECB TO COMMUNICATE WITH SRM   YM03531 02900000
IEFPLEND EQU   *                                                   I270 02950000
IEFPSIZE EQU   IEFPLEND-IEFPARAM                                   I270 03000000
         MEND  , */                                                     03050000
*%PARBSL: ;                                                             03100000
*   DECLARE                                                             03150000
*         1 IEFPARAM BASED(PARPTR),                                     03200000
*           2 IEFUSADD PTR(31),    /*ADDR OF USER PARMS              */ 03250000
*           2 IEFDCBAD PTR(31),    /*ADDR OF FETCHLIB DCB            */ 03300000
*           2 IEFREMLS PTR(31),    /*ADDR OF ATTACH LIST             */ 03350000
*           2 IEFLCTAD PTR(31),    /*ADDR OF LCT                     */ 03400000
*           2 IEFTCBAD PTR(31),    /*INITIATOR TCB ADDR              */ 03450000
*             3 *        BIT(8),   /*RESERVED                  Y02652*/ 03500000
*             3 INITTCB PTR(24),   /*ADDR OF INITIATOR TCB           */ 03550000
*           2 IEFTIOTA PTR(31),    /*ADDR OF WORD WHICH POINTS          03600000
                                     TO JOB STEP'S TIOT        Y02669*/ 03650000
*           2 IEFECBLT CHAR(8) BDY(WORD),  /*ECB LIST                */ 03700000
*             3 ATTECBAD PTR(31),  /*ADDR OF ATTACH ECB              */ 03750000
*             3 CANECBAD PTR(31),  /*ADDR OF CANCEL ECB              */ 03800000
*                                                                       03850000
*           2 * PTR(31),                                                03900000
*             3 *        PTR(8),   /* Unused                     @D1C*/ 03950000
*             3 *        PTR(8),   /* Unused                     @D1C*/ 04000000
*             3 PARPRFMF PTR(16),  /*PERFORMANCE GROUP (FROM SCT)       04050000
*                                                            @G743P2E*/ 04100000
*           2 IEFAECB PTR(31),     /*ATTACH ECB                      */ 04150000
*           2 PARTIOTB PTR(31),    /*ADDR OF INITIATOR TIOT    Y02653*/ 04200000
*           2 PARSRMEC PTR(31);    /*ECB TO COMMUNICATE WITH SRM        04250000
                                                              YM03531*/ 04300000
*   DECLARE                        /*OVERLAY FIELDS IN IEFPARAM      */ 04350000
*         JOBSTCB  DEFINED(IEFUSADD), /*ADDR OF JOB STEP TCB         */ 04400000
*         LCTADDR DEFINED(IEFUSADD), /*ADDR OF LCT FOR IEFSD164      */ 04450000
*         COMPCODE DEFINED(IEFDCBAD); /*COMP CODE FOR SVC 34         */ 04500000
