*                                                                       02000000
*        %GOTO ATTCHL1 ;     /* BILINGUAL MAPPING                       02050000
         MACRO                                                          02100000
         IEZATTCH &LIST=NO                                         @L1C 02150000
**/ %ATTCHL1 : ;                                                        02200000
*                                                                       02250000
* /* *************************************************************** */ 02300000
* /*                                                                 */ 02350000
* /*01* MACRO NAME = IEZATTCH                                        */ 02400000
* /*                                                                 */ 02450000
* /*01* DESCRIPTIVE NAME = ATTACH PARAMETER LIST                     */ 02475000
* /*                                                                 */ 02500000
* /*                                                                 */ 02534600
* /*01* COPYRIGHT =                                              @L1C*/ 02569200
* /*        5685-001                                                 */ 02603800
* /*        THIS MACRO IS "RESTRICTED MATERIALS OF IBM"              */ 02638400
* /*        (C) COPYRIGHT IBM CORP 1981,1992                         */ 02673000
* /*        LICENSED MATERIALS - PROPERTY OF IBM                     */ 02707600
* /*                                                                 */ 02811400
* /*01* STATUS = HBB4430                                         @L1C*/ 02846000
* /*                                                                 */ 02880600
* /*01* FUNCTION =                                                   */ 02915200
* /*     THE FOLLOWING MACRO PROVIDES A MAPPING OF THE PARAMETER     */ 02950000
* /*     LIST WHICH SERVES AS THE INPUT TO THE ATTACH SERVICE        */ 03000000
* /*     ROUTINE(SVC 42). THIS MACRO IS TO BE USED WHEN THE          */ 03050000
* /*     ATTACH PARAMETER LIST IS BUILT DYNAMICALLY. IT MAY ALSO     */ 03100000
* /*     BE USED TO DOCUMENT THE CONTENTS OF THE PARAMETER LIST      */ 03150000
* /*     WHICH IS EXPANDED BY THE ATTACH MACRO.                      */ 03200000
* /*                                                                 */ 03250000
* /*01* COMPONENT = SC1CL (TASK MANAGEMENT)                          */ 03300000
* /*                                                                 */ 03350000
* /*01* DISTRIBUTION LIBRARY = AMODGEN                               */ 03400000
* /*                                                                 */ 03450000
* /* *************************************************************** */ 03500000
*%GOTO ATTCHL2;  /*                                                     03550000
.*******************************************************************    03600000
.*       CHANGE ACTIVITY=                                               03650000
.*                                                                      03700000
.*    $D1=DCR0120  JBB2110  821027  PD16FH: ADD APF LIBRARY ONLY BIT    03750000
.*    $L1=AR       HBB3310  860106  PD16Q9: ACCESS REGISTERS            03800000
.*    $L2=DBFMC    HBB4430  910807  PD16FH: STATUS REWRITE              03825000
.*    $P2=PKB0146  HBB4430  911106  PD16FH: ATFORMNM FOR DISP=RESET     03837500
.*                                                                      03850000
.*******************************************************************    03900000
         SPACE 1                                                        08000002
         PUSH  PRINT                                               @L1A 08050000
         AIF   ('&LIST' EQ 'YES').LSTATT                           @L1A 08100000
         PRINT OFF                                                 @L1A 08150000
.LSTATT  ANOP                                                      @L1A 08200000
         SPACE 1                                                   @L1A 08250000
ATTCHLST DSECT , -            ATTCHPTR                                  08400002
*                                                                       08800000
         IEZBITS                                                        09200000
*                                                                       09600000
ATPGNADA DS    A -            ENTRY ADDRESS                    @G860PXB 09650000
ATDCBADA DS    A -            DCB ADDRESS                      @G860PXB 09700000
ATECBADR DS    A -            ECB ADDRESS                      @G860PXB 09750000
ATNFORM  EQU   BIT0           IF ON, INDICATES PLIST FORMAT    @G860PXB 09800000
*                             NUMBER IN FIELD ATFORMNM         @G860PXB 09850000
ATGSFLDA DS    A -            SUBPOOL VALUE OR ADDRESS         @G860PXB 09900000
ATSHFLDA DS    A -            SHARE SUBPOOL VALUE OR ADDRESS   @G860PXB 09950000
ATETXRA  DS    A -            ETXR ADDRESS                     @G860PXB 10000000
ATDPMOD  DS    H -            DISPATCHING PRIORITY             @G860PXB 10050000
ATLPMOD  DS    FL1 -          LIMIT PRIORITY                   @G860PXB 10100000
ATLMPRI  EQU   X'FF' -        REDUCE LIMIT PRTY BY PARM VALUE  @G860PXB 10150000
ATINDS   DS    B -            OPTION FLAGS                     @G860PXB 10200000
* OPTION FLAGS *** BIT ON = KEYWORD PROVIDED                            25600000
ATDISP   EQU   BIT0 -         'DISP=NO' KEYWORD PROVIDED       @G860PXB 25650000
ATJSCB   EQU   BIT1 -         'JSCB' ADDRESS PROVIDED          @G860PXB 25700000
ATJPQ    EQU   BIT2 -         'GIVEJPQ=YES' KEYWORD PROVIDED   @G860PXB 25750000
ATKEY    EQU   BIT3 -         'KEY=ZERO' KEYWORD PROVIDED      @G860PXB 25800000
ATSZERO  EQU   BIT4 -         'SZERO=NO' KEYWORD PROVIDED      @G860PXB 25850000
ATSVAREA EQU   BIT5 -         'SVAREA=NO' KEYWORD PROVIDED     @G860PXB 25900000
ATJSTCB  EQU   BIT6 -         'JSTCB=YES' KEYWORD PROVIDED     @G860PXB 25950000
ATMODE   EQU   BIT7 -         'SM=SUPV' KEYWORD PROVIDED       @G860PXB 26000000
ATPRGNM  DS    CL8 -          PROGRAM NAME                     @G860PXB 26050000
ATJSCBAD DS    A -            JSCB ADDRESS                     @G860PXB 26100000
ATSTAIAD DS    A -            ADDR OF STAI/ESTAI PARM LIST     @G860PXB 26150000
ATSTAIEX DS    A -            ADDR OF STAI/ESTAI EXIT RTN      @G860PXB 26200000
ATTASKLB DS    A -            ADDR OF TASK LIBRARY DCB         @G860PXB 26250000
ATFLAGS1 DS    B -            OS/VS2 EXTENSION FLAGS           @G860PXB 26300000
ATNSHRSP EQU   BIT0 -         0-FIELD ATTNSHLV IS SP NUMBER    @G860PXB 26350000
*                             1-FIELD ATTNSHLV IS LIST ADDRESS @G860PXB 26400000
ATRSAPF  EQU   BIT1 -         IF ON, ATTACHOR REQUESTED APF    @G860PXB 26450000
*                             AUTHORIZATION RESET  (MDC300)    @Z40RP9A 26500000
ATALCOPY EQU   BIT2 -         COPY THE ATTACHING TASK'S ACCESS     @L1C 26533300
*                             LIST AND EAX TO THE NEW TASK.             26566600
ATNTERM  EQU   BIT3 -         1 - TERM=YES                     @G860PXB 26600000
*                             0 - TERM=NO                      @G860PXB 26650000
ATNESTAI EQU   BIT4 -         1 - ESTAI SPECIFIED              @G860PXB 26700000
*                             0 - ESTAI NOT SPECIFIED          @G860PXB 26750000
ATNSYNCH EQU   BIT5 -         1 - ASYNCH=YES                   @G860PXB 26800000
*                             0 - ASYNCH=NO                    @G860PXB 26850000
ATNPURGE EQU   BIT6+BIT7 -    BITS 6 AND 7 DEFINE PURGE PARM   @G860PXB 26900000
ATPURGEQ EQU   X'00' -        00 - PURGE=QUIESCE               @G860PXB 26950000
ATPURGEH EQU   X'01' -        01 - PURGE=HALT                  @G860PXB 27000000
ATPURGEN EQU   X'02' -        10 - PURGE=NONE                  @G860PXB 27050000
ATNTID   DS    FL1 -          TASK ID                          @G860PXB 27100000
ATTPLNG  DS    H -            LENGTH OF THIS PLIST, IN BYTES   @G860PXB 27150000
ATTNSHLV DS    A -            NSHSPV OR NSHSPL PARAMETER       @G860PXB 27200000
ATFLAGS2 DS    C -            FLAGS                            @G860PXB 27250000
ATNDENT  EQU   BIT0 -         DIRECTORY ENTRY EXISTS           @G860PXB 27300000
ATNGIVSP EQU   BIT1 -         SUBPOOLS TO BE GIVEN ARE IN LIST @G860PXB 27350000
ATNSHSP  EQU   BIT2 -         SPS TO BE SHARED ARE IN LIST     @G860PXB 27400000
ATAPFLIB EQU   BIT3 -         1 - MODULE MUST COME FROM            @D1A 27450000
*                                 APF LIBRARY                      @D1A 27500000
ATRSV042 EQU   BIT4 -         RESERVED                         @G860PXB 27550000
ATRSV043 EQU   BIT5 -         RESERVED                         @G860PXB 27600000
ATNTSKLB EQU   BIT6 -         TASK LIBRARY DCB ADDRESS PRESENT @G860PXB 27650000
ATNTSTAI EQU   BIT7 -         STAI OR ESTAI EXIT ADDR PRESENT  @G860PXB 27700000
ATFORMNM DS    C -            FORMAT NUMBER, AFTER OSVS2R2     @G860PXB 27750000
*                             1 = SP2.1 -- 31-BIT SUPPORT      @G860PXB 27800000
*                             2 = SP3.1 -- AR SUPPORT              @P2C 27816600
*                             3 = SP4.3 -- DISP=RESET WITH TCB     @P2C 27833200
ATRSV040 DS    10C            RESERVED                         @G860PXB 27850000
ATLSTSIZ EQU   *-ATTCHLST -   LENGTH OF ATTACH PARAMETER LIST           33200002
*                                                                       33600000
*********************************************************************** 34000000
*                                                                       34400000
         POP   PRINT                                               @L1A 34450000
         MEND  , */                                                     34800000
* %ATTCHL2 :  ;                                                         35200000
*                                                                       36800000
* @LISTPUSH;                                           /*        @L1A*/ 36806200
* %IF IHALIST = 'YES' %THEN                                             36812400
*    %GOTO PLSATTCH;                                   /*        @L1A*/ 36818600
* %ELSE                                                                 36824800
*    @LISTOFF;                                         /*        @L1A*/ 36831000
* %PLSATTCH:;                                          /*        @L1A*/ 36837200
*                                                                       36843400
* DECLARE                                                               36850000
*   1 ATTCHLST BASED(ATTCHPTR),                           /* @G860PXB*/ 36900000
*    2 ATPGNADA PTR(31),             /* ENTRY ADDRESS        @G860PXB*/ 36950000
*    2 ATDCBADA PTR(31),             /* DCB ADDRESS          @G860PXB*/ 37000000
*    2 ATECBADR PTR(31),             /* ECB ADDRESS          @G860PXB*/ 37050000
*      3 ATNFORM BIT(1),             /* INDICATES PLIST FORMAT NUMBER   37100000
*                                       IN FIELD ATFORMNM    @G860PXB*/ 37150000
*    2 ATGSFLDA PTR(31),             /* SUBPOOL VAL OR ADDR  @G860PXB*/ 37200000
*    2 ATSHFLDA PTR(31),             /* SHARE SUBPOOL VALUE OR          37250000
*                                       ADDRESS              @G860PXB*/ 37300000
*    2 ATETXRA  PTR(31),             /* ETXR ADDRESS         @G860PXB*/ 37350000
*    2 ATDPMOD  FIXED(15),           /* DISPATCHING PRIORITY @G860PXB*/ 37400000
*    2 ATLPMOD  PTR(8),              /* LIMIT PRIORITY       @G860PXB*/ 37450000
* %DCL ATLMPRI  CHAR;                                                   37500000
* %ATLMPRI ='''FF''X';               /* REDUCE LIMIT PRIORITY BY        37550000
*                                       PARM VALUE           @G860PXB*/ 37600000
*    2 ATINDS   CHAR(1),             /* OPTION FLAGS         @G860PXB*/ 37650000
* /* OPTION FLAGS *** BIT ON = KEYWORD PROVIDED                      */ 37700000
*     3 ATDISP   BIT(1),             /* 'DISP=NO' KEYWORD               37750000
*                                        PROVIDED            @G860PXB*/ 37800000
*     3 ATJSCB   BIT(1),             /* 'JSCB' ADDRESS GIVEN @G860PXB*/ 37850000
*     3 ATJPQ    BIT(1),             /* 'GIVEJPQ=YES' GIVEN  @G860PXB*/ 37900000
*     3 ATKEY    BIT(1),             /* 'KEY=ZERO' KEYWORD   @G860PXB*/ 37950000
*     3 ATSZERO  BIT(1),             /* 'SZERO=NO' KEYWORD   @G860PXB*/ 38000000
*     3 ATSVAREA BIT(1),             /* 'SVAREA=NO' KEYWORD  @G860PXB*/ 38050000
*     3 ATJSTCB  BIT(1),             /* 'JSTCB=YES' KEYWORD  @G860PXB*/ 38100000
*     3 ATMODE   BIT(1),             /* 'SM=SUPV' KEYWORD    @G860PXB*/ 38150000
*    2 ATPRGNM  CHAR(8),             /* PROGRAM NAME         @G860PXB*/ 38200000
*    2 ATJSCBAD PTR(31),             /* JSCB ADDRESS         @G860PXB*/ 38250000
*    2 ATSTAIAD PTR(31),             /* ADDR OF E/STAI PLIST @G860PXB*/ 38300000
*    2 ATSTAIEX PTR(31),             /* ADDR OF E/STAI EXIT  @G860PXB*/ 38350000
*    2 ATTASKLB PTR(31),             /* ADDR OF TASK LIB DCB @G860PXB*/ 38400000
*    2 ATFLAGS1 PTR(8),              /* FLAGS                @G860PXB*/ 38450000
*     3 ATNSHRSP BIT(1),             /* 0-FIELD ATTNSHLV CONTAINS A     38500000
*                                       SUBPOOL NUMBER, 1-FIELD         38550000
*                                       ATTNSHLV CONTAINS THE ADDRESS   38600000
*                                       OF A LIST            @G860PXB*/ 38650000
*     3 ATRSAPF  BIT(1),             /* IF ON, ATTACHOR REQUESTED APF   38700000
*                                       AUTHORIZATION RESET             38750000
*                                       (MDC300)             @G860PXB*/ 38800000
*     3 ATALCOPY  BIT(1),            /* COPY THE ATTACHING TASK'S       38825000
*                                       ACCESS LIST AND EAX TO THE      38850000
*                                       NEW TASK.                @L1C*/ 38875000
*     3 ATNTERM   BIT(1),            /* 1-TERM=YES,0-TERM=NO @G860PXB*/ 38900000
*     3 ATNESTAI  BIT(1),            /* 1-ESTAI SPECIFIED               38950000
*                                       0-NOT SPECIFIED      @G860PXB*/ 39000000
*     3 ATNSYNCH  BIT(1),            /* 1-ASYNCH=YES                    39050000
*                                       0-ASYNCH=NO          @G860PXB*/ 39100000
*     3 ATNPURGE  BIT(2),            /* PURGE PARM VALUES    @G860PXB*/ 39150000
* %DCL ATPURGEQ CHAR;                /*                      @G860PXB*/ 39200000
* %ATPURGEQ = '''00''B';             /* 00 - PURGE=QUIESCE   @G860PXB*/ 39250000
* %DCL ATPURGEH CHAR;                /*                      @G860PXB*/ 39300000
* %ATPURGEH = '''01''B';             /* 01 - PURGE=HALT      @G860PXB*/ 39350000
* %DCL ATPURGEN CHAR;                /*                      @G860PXB*/ 39400000
* %ATPURGEN = '''10''B';             /* 10 - PURGE=NONE      @G860PXB*/ 39450000
*    2 ATNTID    PTR(8),             /* TASK ID              @G860PXB*/ 39500000
*    2 ATTPLNG  FIXED(15),           /* LENGTH OF THIS PARM LIST,       39550000
*                                       IN BYTES             @G860PXB*/ 39600000
*    2 ATTNSHLV PTR(31),             /* NSHSPV OR NSHSPL     @G860PXB*/ 39650000
*    2 ATFLAGS2 PTR(8),              /* FLAGS                @G860PXB*/ 39700000
*     3 ATNDENT BIT(1),              /* DIRECTORY ENTRY      @G860PXB*/ 39750000
*     3 ATNGIVSP BIT(1),             /* SUBPOOLS TO BE GIVEN ARE IN     39800000
*                                       LIST                 @G860PXB*/ 39850000
*     3 ATNSHSP  BIT(1),             /* SUBPOOLS TO BE SHARED ARE IN    39900000
*                                       LIST                 @G860PXB*/ 39950000
*     3 ATAPFLIB  BIT(1),            /* 1 - MODULE MUST COME            40000000
*                                           FROM APF LIBRARY     @D1A*/ 40050000
*     3 ATRSV042  BIT(1),            /* RESERVED             @G860PXB*/ 40100000
*     3 ATRSV043  BIT(1),            /* RESERVED             @G860PXB*/ 40150000
*     3 ATNTSKLB  BIT(1),            /* TASKLIB DCB PRESENT  @G860PXB*/ 40200000
*     3 ATNTSTAI  BIT(1),            /* STAI OR ESTAI EXIT ADDR         40250000
*                                       PRESENT              @G860PXB*/ 40300000
*    2 ATFORMNM CHAR(1),             /* FORMAT NUMBER        @G860PXB*/ 40350000
*                                    /* 1 = SP2.1-31-BIT SUPPORT @P2C*/ 40370000
*                                    /* 2 = SP3.1-AR SUPPORT     @P2C*/ 40390000
*                                    /* 3 = SP4.3-DISP(RESET)           40410000
*                                                 WITH TCB       @P2C*/ 40430000
*    2 ATRSV040 CHAR(10);            /* RESERVED             @G860PXB*/ 40450000
*                                                                       40500000
*%ATLSTSIZ='LENGTH(ATTCHLST)';       /* LENGTH OF ATTACH PARAMETER      40550000
*                                       LIST                         */ 40600000
* /* *************************************************************** */ 42400000
*                                                                       43600000
* @LISTPOP;                                            /*        @L1A*/ 43650000
