* %GOTO CTGVLP01;                   /*                                  00050000
         MACRO                                                          00100000
         IEZCTGVL ,                                                     00150000
         DSECT ,                    */                                  00200000
* %CTGVLP01:;                                                           00250000
*/********************************************************************/ 00300000
*/*                                                                  */ 00350000
*/*   $MAC(IEZCTGVL):                                            @M0C*/ 00400000
*/*                                                                  */ 00450000
*/*   DESCRIPTIVE NAME = VSAM CATALOG VOLUME LIST AND EXTENSION      */ 00500000
*/*                                                                  */ 00564100
*/*PROPRIETARY V3 STATEMENT                                          */ 00568000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00571900
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00575800
*/*5695-DF1                                                          */ 00579700
*/*(C) COPYRIGHT 1989,1995  IBM CORP.                                */ 00583600
*/*END PROPRIETARY V3 STATEMENT                                      */ 00587500
*/*                                                              @M0A*/ 00591500
*/*   FUNCTION = MAPPING MACRO FOR THE CATALOG VOLUME LIST           */ 00600000
*/*              AND THE VOLUME LIST EXTENSION.                      */ 00650000
*/*                                                                  */ 00700000
*/*   CONTROL BLOCK STRUCTURE = THE CTGVL IS POINTED TO BY THE       */ 00750000
*/*                             CTGWA (CTGWAVL).                     */ 00800000
*/*                                                                  */ 00850000
*/*   INCLUDED MACROS = NONE                                         */ 00900000
*/*                                                                  */ 00950000
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 01000000
*/*                                                                  */ 01050000
*/*   STATUS = SEE CHANGE ACTIVITY                               @M0C*/ 01100000
*/*                                                                  */ 01150000
*/*   DATE OF LAST CHANGE = NOVEMBER 27, 1985                    @M0C*/ 01200000
*/*                                                                  */ 01250000
*/*   CHANGE ACTIVITY =                                          @M0A*/ 01300000
*/*   $M0=STAGE2,HDP3310,861031,STLHVY: MVS/XA DFP VER 3 REL 1   @M0A*/ 01350000
*/*   $N2=DFP,HDP3320,,STLJSC:  PDSE INDICATOR SUPPORT           @N2A*/ 01375000
*/*   $CO=DFP,HDZ11B0,,STLKHN:  SAM COMPRESSION SUPPORT          @COA*/ 01387500
*/*   $VC=DFSMS,HDZ11B0,,STLFLC: VSAM COMPRESSION                @VCA*/ 01393700
*/********************************************************************/ 01400000
*%GOTO CTGVLP03;                                                        01450000
* /*                                                                    01500000
         AGO   .CTGVL01             */                                  01550000
*%/*****************************************************************/;  01553100
*%/*   THE VARIABLES CTGVL999 AND CTGVLLVL ALLOW THE INVOKER TO    */;  01556200
*%/* CUSTOMIZE THE EXPANSION OF THIS MAPPING MACRO.                */;  01559300
*%/*   CTGVLLVL ALLOWS ONE TO APPEND THE CATALOG VOLUME LIST ONTO  */;  01562400
*%/* THE END OF AN EXISTING STRUCTURE.  IF IT IS NON-NULL, THEN    */;  01565500
*%/* THE "DECLARE" KEYWORD IS NOT LISTED OUT, AND CTGVLLVL BECOMES */;  01568600
*%/* THE NEW LEVEL NUMBER FOR THE CATALOG VOLUME LIST.             */;  01571700
*%/*   CTGVL999 IS USED TO EXTEND THE EXTENSION LIST (CTGVLX).     */;  01574800
*%/* IF IT IS A COMMA, THEN A COMMA WILL FOLLOW THE LAST ELEMENT   */;  01577900
*%/* OF CTGVLX (RATHER THAN A SEMI-COLON).                         */;  01581000
*%/*   NOTE: THE ACTUAL USE OF THESE VARIABLES MAY CAUSE DUPLICATE */;  01584100
*%/* DEFINITION WARNING MESSAGES FROM THE MACRO PROCESSOR.  THESE  */;  01587200
*%/* CAN GENERALLY BE DISREGARDED, BUT CAUTION IS ADVISED.         */;  01590300
*%/*                                             F. CORR   9/87    */;  01593400
*%/*****************************************************************/;  01596500
*%CTGVLP03:;                                                            01600000
*%DECLARE (CTGVLLEN, CTGVLXLN, CTGVL999, CTGVLLVL) CHAR;                01650000
*%CTGVLLEN = 'LENGTH(CTGVL)';       /* LENGTH OF CTGVL               */ 05400000
*%CTGVLXLN = 'LENGTH(CTGVLX)';      /* LENGTH OF CTGVLX              */ 05500000
*%IF CTGVL999 ~= ','                /* IF BLOCK NOT CONTINUED,       */ 15000000
*  %THEN %CTGVL999 = ';';           /*   THEN CLOSE DECLARE STMNT    */ 18000000
*%IF CTGVLLVL  = ''                 /* IF BLOCK NOT CONCATENATED,    */ 21000000
*  %THEN %GOTO CTGVL001;            /*   THEN GENERATE DECLARE       */ 24000000
*%CTGVLDUM = CTGVLLVL||' CTGVL(*)'; /* SET MINOR LEVEL NUMBER        */ 27000000
*   CTGVLDUM                        /* CTGVL CONCATENATED LEVEL      */ 30000000
*%GOTO CTGVL002;                    /* SKIP DECLARE                  */ 33000000
*%CTGVL001:;                        /* DECLARE                       */ 36000000
*/********************************************************************/ 36600000
*/*                     CATALOG  VOLUME  LIST                        */ 37200000
*/********************************************************************/ 37800000
*   DECLARE                                                             38400000
*     1 CTGVL(*) BASED(CTGWAVL)     /* DECLARE CTGVL LEVEL ONE       */ 39000000
*%CTGVL002:;                        /* SKIP DECLARE                  */ 42000000
*                   BDY(WORD),      /* WORD BOUNDARY                 */ 45000000
*       5 CTGVLVOL CHAR(6),         /* VOLUME SERIAL NUMBER          */ 48000000
*       5 CTGVLDEV CHAR(4),         /* DEVICE TYPE                   */ 51000000
*       5 CTGVLSEQ FIXED(15);       /* FILE SEQUENCE NUMBER          */ 54000000
*/********************************************************************/ 54700000
*/*                     SMS WORKAREA                             @M0A*/ 54723300
*/********************************************************************/ 54746600
*   DECLARE                         /*                           @M0A*/ 54769900
*     1 CTGVLSWA BASED BDY(BYTE),   /* SMS WORKAREA (OUTPUT)     @M0A*/ 54793200
*       5 CTGVLSHD FIXED(31)        /* SMS WORKAREA HEADER       @M0A*/ 54816500
*             BDY(BYTE),            /*                           @M0A*/ 54839800
*         10 CTGVLSLN FIXED(15)     /* LENGTH OF SMS WORKAREA    @M0A*/ 54863100
*             BDY(BYTE),            /*                           @M0A*/ 54886400
*         10 CTGVLIPD CHAR(1),      /* PDSE INDICATOR            @N2A*/ 54909700
*         10 CTGVLIND BIT(8),       /* MISC INDICATOR            @COC*/ 54917400
*           15 CTGVLEF BIT(1),      /* EXTENDED FORMAT INDICATOR @VCC*/ 54925100
*           15 CTGVLCOM BIT(1),     /* COMPRESSABLE DATASET INDICATOR   54932800
*                                                                @COA*/ 54940500
*           15 * BIT(6),            /* RESERVED                  @COA*/ 54948200
*       5 CTGVLMVL FIXED(31)        /* MAXIMUM NUMBER OF VOLUMES @M0A*/ 54956300
*             BDY(BYTE),            /*                           @M0A*/ 54979600
*       5 CTGVLSMS BDY(BYTE),       /* SMS DATA                  @M0A*/ 55002900
*         10 CTGVLLSC FIXED(15)     /* STORAGE CLASS NAME LENGTH @M0A*/ 55026200
*             BDY(BYTE),            /*                           @M0A*/ 55049500
*         10 CTGVLSSC CHAR(*);      /* STORAGE CLASS NAME        @M0A*/ 55072800
*   DECLARE                         /*                           @M0A*/ 55096100
*     1 CTGVLDAT BASED(ADDR(CTGVLSMS) + CTGVLLSC + LENGTH(CTGVLLSC))    55119400
*             BDY(BYTE),            /* DATA CLASS INFORMATION    @M0A*/ 55142700
*       5 CTGVLLDC FIXED(15)        /* DATA CLASS NAME LENGTH    @M0A*/ 55166000
*             BDY(BYTE),            /*                           @M0A*/ 55189300
*       5 CTGVLSDC CHAR(*);         /* DATA CLASS NAME           @M0A*/ 55212600
*   DECLARE                         /*                           @M0A*/ 55235900
*     1 CTGVLMGT BASED(ADDR(CTGVLDAT) + CTGVLLDC + LENGTH(CTGVLLDC))    55259200
*             BDY(BYTE),            /* MANAGEMENT CLASS INFO     @M0A*/ 55282500
*       5 CTGVLLMC FIXED(15)        /* MGMT CLASS NAME LENGTH    @M0A*/ 55305800
*             BDY(BYTE),            /*                           @M0A*/ 55329100
*       5 CTGVLSMC CHAR(*);         /* MGMT CLASS NAME           @M0A*/ 55352400
*/********************************************************************/ 55375700
*/*                     OAM WORKAREA                             @TMA*/ 55378100
*/********************************************************************/ 55380500
*   DECLARE                         /*                           @TMA*/ 55382900
*     1 CTGVLOAM BASED(ADDR(CTGVLMGT) + CTGVLLMC + LENGTH(CTGVLLMC))    55385300
*             BDY(BYTE),            /* OAM INFORMATION AREA      @TMA*/ 55388300
*       5 CTGVLLOA FIXED(15)        /* OAM INFORMATION LENGTH KET2965*/ 55390300
*             BDY(BYTE),            /*                        KET2965*/ 55392300
*       5 CTGVLSOA CHAR(*);         /* OAM INFORMATION DATA      @TMA*/ 55394300
*/********************************************************************/ 55397300
*/*                     VOLUME  LIST  EXTENSION                      */ 55400000
*/********************************************************************/ 56100000
*   DECLARE                                                             57000000
*     1 CTGVLX BASED(ADDR(CTGVL))   /* VOLUME LIST EXTENSION         */ 60000000
*                BDY(WORD),         /* WORD BOUNDARY                 */ 63000000
*       5 *        CHAR(LENGTH(CTGVL)), /* VOLUME LIST BASE          */ 66000000
*       5 CTGVLTTR CHAR(3) CTGVL999 /* FORMAT 1 DSCB TTR             */ 69000000
* %GOTO CTGVLP02;                   /*                                  70000000
.CTGVL01 ANOP                                                           70050000
*                                                                       70060000
*********************************************************************** 70100000
*                  VOLUME LIST BASE                                   * 70150000
*********************************************************************** 70200000
CTGVL    DS    0CL12                    DECLARE CTGVL LEVEL ONE WORD   X70250000
                                        BOUNDARY                        70300000
CTGVLVOL DS    CL6                      VOLUME SERIAL NUMBER            70350000
CTGVLDEV DS    CL4                      DEVICE TYPE                     70400000
CTGVLSEQ DS    H                        FILE SEQUENCE NUMBER            70450000
*********************************************************************** 70500000
*                  VOLUME LIST EXTENSION                              * 70550000
*********************************************************************** 70600000
CTGVLX   DSECT                          VOLUME LIST EXTENSION WORD     X70650000
                                        BOUNDARY                        70700000
         DS    CL12                     VOLUME LIST BASE                70750000
CTGVLTTR DS    CL3                      FORMAT 1 DSCB TTR               70800000
*********************************************************************** 70850000
*                  SMS WORKAREA                                       * 70900000
*********************************************************************** 70950000
CTGVLSWA DSECT                          SMS WORKAREA (OUTPUT)           71000000
CTGVLSHD DS    0FL4                     SMS WORKAREA HEADER             71016600
CTGVLSLN DS    HL2                      LENGTH OF SMS WORKAREA          71033200
CTGVLIPD DS    C                        PDSE INDICATOR                  71049800
CTGVLIND DS    C                        MISC INDICATOR                  71066400
CTGVLMVL DS    FL4                      MAXIMUM NUMBER OF VOLUMES       71083000
CTGVLSMS DS    0C                       SMS DATA                        71100000
CTGVLLSC DS    HL2                      STORAGE CLASS NAME LENGTH       71150000
CTGVLSSC DS    0C                       STORAGE CLASS NAME              71200000
*********************************************************************** 71250000
*                  DATA CLASS INFORMATION                             * 71300000
*********************************************************************** 71350000
CTGVLDAT DSECT                                                          71400000
CTGVLLDC DS    HL2                      DATA CLASS NAME LENGTH          71450000
CTGVLSDC DS    0C                       DATA CLASS NAME                 71500000
*********************************************************************** 71550000
*                  MANAGEMENT CLASS INFORMATION                       * 71600000
*********************************************************************** 71650000
CTGVLMGT DSECT                                                          71700000
CTGVLLMC DS    HL2                      MGMT CLASS NAME LENGTH          71750000
CTGVLSMC DS    0C                       MGMT CLASS NAME                 71800000
*********************************************************************** 71807100
*                  OAM WORKAREA                                       * 71814200
*********************************************************************** 71821300
CTGVLOAM DSECT                                                          71828400
CTGVLLOA DS    HL2                      OAM DIRECTORY NAME LENGTH       71835500
CTGVLSOA DS    0C                       OAM DIRECTORY NAME              71842600
*                                                                       71850000
         MEND                                                           71900000
*            */                                                         71950000
* %CTGVLP02:;                                                           72000000
