*        %GOTO MTPRMLBL;  /*                                            00030000
         MACRO                                                          00060000
         IEZMTPRM                                                       00090000
         SPACE 1          */                                            00120000
*% MTPRMLBL: ;                                                          00150000
*/********************************************************************/ 00230000
*/*                                                                  */ 00290000
*/*   MODULE NAME = IEZMTPRM                                         */ 00330000
*/*                                                                  */ 00370000
*/*   DESCRIPTIVE NAME = IEETRACE PARAMETER LIST                     */ 00410000
*/*                      MAPPING MACRO                               */ 00450000
*/*                                                                  */ 00490000
*/*   STATUS = 0S/VS2, SYSTEM CONTROL PROGRAM 2                      */ 00530000
*/*                                                                  */ 00560000
*/*    LAST UPDATE - 05/11/78                                        */ 00590000
*/*                                                                  */ 00650000
*/*   FUNCTION = MAPS THE PARAMETER LIST PASSED TO THE               */ 00690000
*/*              MASTER TRACE SERVICE ROUTINE VIA IEETRACE           */ 00730000
*/*              MACRO                                               */ 00770000
*/*                                                                  */ 00810000
*/*   MODULE TYPE = MACRO                                            */ 00850000
*/*                                                                  */ 00890000
*/*    PROCESSOR = BILINGUAL PLS 2 AND ASSEMBLER                     */ 00930000
*/*                                                                  */ 00970000
*/*    CHANGE ACTIVITY = G64MP2D                                     */ 01010000
*/*                                                                  */ 01050000
*/********************************************************************/ 01090000
*         %GOTO IEZMTPRM; /*                                            01350000
MTPRMMAP DSECT                                                          01400000
         IEZBITS                                                        01420000
         DS    0F                         ALIGN IEETRACE PARMLIST       01450000
*                                         MAPPING ON A WORD BOUNDARY    01500000
         SPACE                                                          01600000
MTPMTHDR DS    0C                         WILL BE USED AS THE HEADER    01610000
*                                         FOR THE MASTER TRACE TABLE    01620000
*                                         ENTRY                         01630000
MTPFLG01 DS    0H                         FIRST FLAG FIELD              01640000
MTPDATFM DS    B                          DATA FORMAT DESCRIPTOR BYTE   01680000
MTPDATHX EQU   BIT0                       IF ON  DATA IS NOT PRINTABLE  01720000
MTPCBYTE DS    B                          TABLE CREATE/DELETE BYTE      01760000
MTPINNEW EQU   BIT0                       INITIALIZE A NEW TABLE        01800000
MTPDEACT EQU   BIT1                       DEACTIVATE THE TABLE          01840000
         SPACE                                                          01880000
MTPCTAGS DS    0H                         IDENTIFIES MASTER TRACE       01920000
*                                         CALLER                        01960000
MTPTGFL1 DS    B                          FIRST TAG BYTE                02000000
MTPTGFL2 DS    B                          SECOND TAG BYTE               02040000
MTPRSVD  EQU   X'00'                      RESERVED                      02050000
MTPCMTSK EQU   X'01'                      COMMUNICATIONS TASK HARD COPY 02090000
MTPMASTS EQU   X'02'                      MASTER SCHEDULER INIT.        02130000
MTPTRCMD EQU   X'03'                      TRACE COMMAND                 02170000
         SPACE                                                          02280000
MTPIMDAT DS    F                          CALLERS IMMEDIATE DATA        02320000
         SPACE                                                          02360000
MTPDATLN DS    H                          LENGTH OF CALLERS DATA        02400000
MTPHDRLN EQU   *-MTPMTHDR                 LENGTH OF MASTER TRACE        02410000
*                                         HEADER                        02420000
         SPACE                                                          02440000
MTPFLG02 DS    0H                         SECOND FLAG FIELD             02480000
MTPSPHW1 DS    H                          RESERVED                      02520000
         SPACE                                                          02560000
MTPDATPT DS    F                          CALLERS DATA POINTER          02600000
MTPEND   EQU   *                          END OF IEZMTPRM               02760000
MTPLNGTH EQU   MTPEND-MTPRMMAP            LENGTH OF IEZMTPRM            02800000
         SPACE                                                          03150000
         MEND                                                        */ 03200000
* %IEZMTPRM:   ;                                                        03210000
* DECLARE                                                               03250000
*  1 MTPRMMAP BDY(WORD) BASED,         /* ALIGN IEETRACE PARMLIST       03300000
*                                         MAPPING ON A WORD BOUNDARY */ 03340000
*                                                                       03420000
*   2 MTPMTHDR     BDY(WORD),          /* WILL BE USED AS THE HEADER    03460000
*                                         FOR THE MASTER TRACE TABLE    03500000
*                                         ENTRY                      */ 03540000
*    4 MTPFLG01    BIT(16),            /* FIRST FLAG FIELD           */ 03580000
*     6 MTPDATFM   BIT(8) ,            /* DATA FORMAT BYTE           */ 03620000
*      8 MTPDATHX  BIT(1),             /* DATA IS NOT PRINTABLE IF ON*/ 03660000
*      8 *         BIT(1),             /* RESERVED BIT               */ 03700000
*                                                                       03740000
*      8 *         BIT(6),             /* RESERVED BITS              */ 03780000
*                                                                       03820000
*     6 MTPCBYTE   BIT(8),             /* TABLE CREATE/DELETE        */ 03860000
*      8 MTPINNEW  BIT(1),             /* INITIALIZE A NEW TABLE     */ 03900000
*      8 MTPDEACT  BIT(1),             /* DEACTIVATE THE TABLE       */ 03940000
*      8 *         BIT(6),             /* RESERVED BITS              */ 03980000
*                                                                       04020000
*    4 MTPCTAGS    CHAR(2),            /* IDENTIFIES MASTER TRACE       04060000
*                                         CALLER                     */ 04100000
*     6 MTPTGFL1   CHAR(1),            /* FIRST TAG BYTE             */ 04140000
*     6 MTPTGFL2   CHAR(1),            /* SECOND TAG BYTE            */ 04180000
*                                                                       04220000
*    4 MTPIMDAT    CHAR(4),            /* CALLER IMMEDIATE DATA      */ 04260000
*     6 MTPIDATF   BIT(32),            /* SAME-ARITHMETIC            */ 04300000
*                                                                       04340000
*    4 MTPDATLN    FIXED(16),          /* LENGTH OF CALLERS DATA     */ 04380000
*                                                                       04420000
*   2 MTPFLG02    CHAR(2),             /* SECOND FLAG FIELD          */ 04460000
*    4 MTPSPHW1   CHAR(2),             /* RESERVED                   */ 04500000
*                                                                       04540000
*  2 MTPDATPT    PTR(32);              /* CALLERS DATA POINTER       */ 04580000
*                                                                       04900000
*@EJECT;                                                                04950000
* /*******************************************************************/ 04980000
* /*                                                                 */ 05010000
* /*  IEZMTPRM - TAGS OF CALLERS OF MASTER TRACE FACILITY            */ 05040000
* /*                                                                 */ 05100000
* /*******************************************************************/ 05150000
*                                                                       05200000
*    DCL                                                                05250000
*     MTPRSVD  BIT(16)    CONSTANT('0000'X); /* RESERVED             */ 05260000
*    DCL                                                                05280000
*     MTPCMTSK BIT(16)    CONSTANT('0001'X); /* COMMUNICATIONS TASK  */ 05300000
*    DCL                                                                05350000
*     MTPMASTS BIT(16)    CONSTANT('0002'X); /* MASTER SCHEDULER     */ 05400000
*    DCL                                                                05450000
*     MTPTRCMD BIT(16)    CONSTANT('0003'X); /* TRACE COMMAND        */ 05500000
*                                                                       05550000
