*        %GOTO CTXT1;  /*                                               00050000
         MACRO                                                          00100000
         IEZVX100 &DSECT=YES                                            00150000
*                                                                    */ 00200000
*%CTXT1 : ;                                                             00250000
*/**START OF SPECIFICATIONS*******************************************/ 00300000
*/*01* PROPRIETARY STATEMENT=                                        */ 00303800
*/***PROPRIETARY_STATEMENT********************************************/ 00307600
*/*                                                                  */ 00311400
*/*                                                                  */ 00315200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00319000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00322800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1984, 1993                      */ 00326600
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00330400
*/*                                                                  */ 00334200
*/* STATUS= HBB5510                                                  */ 00338000
*/*                                                                  */ 00341800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00345600
*/*                                                                  */ 00350000
*/* MACRO NAME:  IEZVX100                                        @02C*/ 00400000
*/*                                                                  */ 00450000
*/* DSECT NAME: CTXT                                             @02A*/ 00475000
*/*                                                              @02A*/ 00500000
*/* DESCRIPTIVE NAME:  COMMUNICATIONS TASK INSTALLATION EXIT     @P6C*/ 00525000
*/*                    ROUTINE PARAMETER LIST                    @P6A*/ 00550000
*/* ACRONYM:  CTXT                                               @02C*/ 00600000
*/* EXTERNAL CLASSIFICATION: PSPI                                @P8A*/ 00650000
*/* END OF EXTERNAL CLASSIFICATION:                              @P8A*/ 00700000
*/*                                                                  */ 00850000
*/*                                                                  */ 00860000
*/*                                                                  */ 00950000
*/* FUNCTION:    PROVIDES THE INTERFACE BETWEEN IEAVX600 AND     @02C*/ 00980000
*/*              THE WTO INSTALLATION EXITS.                     @02C*/ 01010000
*/*                                                              @02A*/ 01040000
*/* COMPONENT: COMM TASK (SC1CK)                                 @02A*/ 01070000
*/*                                                                  */ 01100000
*/* EYE-CATCHER: CTXT                                            @02A*/ 01101900
*/*     OFFSET: 0                                                @02A*/ 01103800
*/*     LENGTH: 4 BYTES                                          @02A*/ 01105700
*/*                                                              @02A*/ 01107600
*/* STORAGE ATTRIBUTES:   MAIN STORAGE:  YES                     @02A*/ 01109500
*/*                       VIRTUAL STORAGE:  NO                   @02A*/ 01111400
*/*                       AUXILIARY STORAGE:  NO                 @02A*/ 01113300
*/*                       SUBPOOL:  229                          @02A*/ 01115200
*/*                       KEY:  0                                @02A*/ 01117100
*/*                       DATA SPACE:  NO                        @02A*/ 01119000
*/*                       RESIDENCY: BELOW 16M                   @02A*/ 01120900
*/*                                                              @02A*/ 01122800
*/*                                                              @02A*/ 01124700
*/* SIZE: 140 BYTES                                              @02A*/ 01126600
*/*                                                              @02A*/ 01128500
*/* CREATED BY: IEAVX600 - WTO INSTALLATION EXIT INTERFACE       @P6C*/ 01129700
*/*                        ROUTINE                               @P6A*/ 01130900
*/*                                                              @02A*/ 01132300
*/* POINTED TO BY - REGISTER 1                                   @02A*/ 01134200
*/*                                                              @02A*/ 01136100
*/* METHOD OF ACCESS: PL/S - SPECIFY: %INCLUDE SYSLIB(IEZVX100)  @02C*/ 01138000
*/*                                                                  */ 01140000
*/*                    THE DEFAULT FOR THIS STRUCTURE IS BASED.      */ 01160000
*/*                    IT IS BASED ON THE POINTER CTXTPTR.           */ 01180000
*/*                    IF THE STRUCTURE IS NOT TO BE BASED, DECLARE  */ 01200000
*/*                    A MACRO VARIABLE CALLED %CTXTVAL AND SET IT   */ 01250000
*/*                    EQUAL TO 'NONE' BEFORE THE MACRO IS           */ 01300000
*/*                    INCLUDED.                                     */ 01350000
*/*                                                                  */ 01400000
*/*              BAL - SPECIFY: IEZVX100                             */ 01450000
*/*                    IF A DSECT IS NOT WANTED, SPECIFY DSECT=NO    */ 01500000
*/*                    ON THE MACRO INVOCATION                       */ 01550000
*/*                                                                  */ 01600000
*/*                                                                  */ 01700000
*/* LOCATION:    SUBPOOL 229, BELOW 16M.                         @02C*/ 01750000
*/*                                                                  */ 01800000
*/* POINTED TO BY:  REGISTER 1                                   @02C*/ 01850000
*/*                                                                  */ 01900000
*/* SERIALIZATION:  NONE                                         @02C*/ 01950000
*/*                                                                  */ 02000000
*/* CHANGE ACTIVITY:                                                 */ 02050000
*/* $L0=MRREXITS, JBB2125,  830420, PDE8: COMM TASK INSTALLATION @P6C*/ 02075000
*/*                                       EXITS                  @P6A*/ 02100000
*/* $P1=PAJ0144,  JBB2125,  830708, PDSS: SELECTIVE AMRF             */ 02125000
*/* $L1=COEXWTO2, JBB2220,  840201, PDFE: JES3/MCS COEXISTENCE       */ 02137500
*/* $D1=DCR156,   JBB2220,  851223, PDF9: 4-BYTE CONSOLE ID CHANGE   */ 02143700
*/* $P2=PA21208,  JBB2220,  860910, PDF9: JES3/MCS COEXISTENCE       */ 02146800
*/*              YA02978                                             */ 02148400
*/*              YA04840 - MISSING ASTERISKS CAUSE ASSEM ERRORS      */ 02148900
*/*              YA06920                                             */ 02149100
*/*              YA08767                                             */ 02149300
*/*              YA10057                                             */ 02149500
*/*              YA11509 - NO CODE CHANGE.                           */ 02149700
*/*              YA26891 - DEFINE SUPPRESS FROM JOBLOG BIT   @YA26891*/ 02154700
*/* $L2=CNMG2WTO, HBB4410,  870419, PDR3: CONSOLE MERGE STAGE II     */ 02159700
*/* $L3=KNWTO,    HBB4410,  870622, PDCM: KANJI/WTO                  */ 02169700
*/* $L4=OPSSI,    HBB4410,  880104, PDFI: OPSSI EXIT ANCHOR          */ 02179700
*/* $L5=OPSSI8FB, HBB4410,  880711, PDFB: OPSSI MESSAGE QUEUING      */ 02184700
*/* $L6=CNSL1DHH, HBB4410,  890123, PDHH: CONSOLE ENHANCEMENTS 1     */ 02187200
*/* $L7=CNITGDHD, HBB4410,  890306, PDHD: CONSOLE INTEGRATION        */ 02188000
*/* $L8=CNITGEHD, HBB4410,  890501, PDHD: CONSOLE INTEGRATION        */ 02188800
*/* $P3=PEO2709,  HBB4410,  891023, PDHD: NONBLANKS IN COL 72        */ 02189200
*/* $D2=DEO0253,  HBB4410,  891127, PDBT: OPSSI - DCR 253            */ 02189400
*/* $P4=PEO3576,  HBB4410,  890226, PDHG: COMMENT UPDATES            */ 02189500
*/* $P5=PEO3918,  HBB4410,  900416, PD35: CONTINUATION ERROR         */ 02189600
*/* $D3=DEO0358,  HBB4410,  900626, PDEC: DBCS REMOVAL               */ 02193000
*/* $01=OY37876,  HBB4410,  910125, PDBT: PEO4829 - WTO          @P6C*/ 02193500
*/*                                       INSTALLATION EXIT      @P6A*/ 02194000
*/*                                       12-BYTE COMMON DATA AREA   */ 02194600
*/* $02=OY44088,  HBB4410,  910603, PDCM: RESERVED FIELDS            */ 02195000
*/* $L9=NETSY6HL, JBB4422,  901112, PDHL: NETVIEW AUTOMATION         */ 02195400
*/* $P6=PKB0590,  HBB4430,  920909, PD35: CDPI COMPLIANCE            */ 02195900
*/* $P7=PIG1847,  HBB5510,  930625, PDCI: ADD CTXTCART               */ 02196100
*/* $P8=PIG2265,  HBB5510,  930909, PDED: SHOWHDR COMPLIANCE         */ 02196200
*/* $03=OW37807,  HBB6601,  990531, PDHD: ALLOW "NO WTP" REQUESTS    */ 02196300
*/*                                                                  */ 02196400
*/**END OF SPECIFICATIONS*********************************************/ 02200000
* %GOTO CTXTPLS; /*                                                     02250000
.* A ADD RETAIN REQUEST FLAGS FOR SELECTIVE AMRF                   @P1A 02250500
.* A DEFINE 4-BYTE CONSOLE ID, SYSNAME, KEY, TOKEN, JOBNAME, JOBID,@L1A 02250600
.*     MSG TYPE FLAGS, REQUEST FLAGS, AND 128 ROUTING CODES        @L1A 02250700
.* C CHANGE STRUCTURE OF 4-BYTE CONSOLE ID                         @D1A 02250800
.* A ADD MAPPING OF COPY OF INSTALLATION EXIT REQUEST FLAGS        @P2A 02250900
.* C TAKE OUT JOBID AND MAKE THE FIELD RESERVED                @YA02978 02251200
.* C REPLACE MISSING ASTERISKS FOR COMMENTS                    @YA04840 02251300
.* C ADD THE MPF AUTOMATION STATUS AND REQUEST DATA            @YA06920 02251400
.* C ADD THE WQENMOD CHANGE DATA                               @YA08767 02251500
.* C ADD REISSUED MESSAGE FLAG                                 @YA08767 02251600
.* C DEFINE ROUTING CODE 41                                    @YA10057 02251700
.* NO CODE CHANGE. RESHIP FOR PTF PACKAGING SUPERCEDE.         @YA11509 02251800
.* A DEFINE CONSOLE NAME                                           @L2A 02251900
.* A SUPPORT DBCS CHARACTERS                                       @L3A 02252000
.* A CTXTCCDA, CTXTCIDA                                            @L4A 02252100
.* A CTXTCWKP, CTXTIWKP, CTXTCDAM, CTXTCRTN AND CTXTCUDA           @L4A 02252200
.* D CTXTFRGM                                                      @L5A 02252400
.* A CTXTEMCO,CTXTEMHI,CTXTEMIN,CTXTCOLR,CTXTHILI,CTXTINTN         @L6A 02252500
.*   EXTENDED MESSAGE HIGHLIGHTING REQUESTS                        @L6A 02252600
.* A CTXTDOMD, CTXTNBEW, CTXTHABD: BRANCH-ENTRY/NIP WTO/R FLAGS    @L7A 02252700
.* A CTXTRPYB:  BINARY REPLY ID                                    @D2A 02252800
.* A CTXTRPYL:  LENGTH OF EBCDIC REPRESENTATION OF REPLY ID        @D2A 02252900
.* A CTXTRPYI:  1-8 BYTE EBCDIC REPRESENTATION OF REPLY ID         @D2A 02253000
.* D DELETE THE WORD UNCONDITIONALLY FROM COMMENT FOR CTXTSQUN     @P4D 02253200
.* C CORRECT INVALID CONTINUATION CHARACTER                        @P5A 02253300
.* A DEFINE SUPPRESS FROM JOBLOG BIT                           @YA26891 02253400
.* D DBCS REMOVAL                                                  @D3A 02253500
.* D CTXTCCDA, CTXTCRTN                                            @01A 02253700
.* C RESTORE CTXTRSV3 AND CTXTRSV4 TO ORIGINAL OFFSETS IN MACRO    @02A 02253800
.* C AND CREATED NEW RESERVED FIELDS CTXTRSV5 AND CTXTRSV6         @02A 02253900
.* A DESCRIPTOR CODE 13 SUPPORT FOR PREVIOUSLY AUTOMATED MSGS.     @L9A 02254000
.* C CHANGE 'USER EXIT' TO 'INSTALLATION EXIT' FOR CDPI COMPLIANCE @P6A 02254100
.* A ADD EXTERNAL CLASSIFICATION TO PROLOG                         @P8A 02254200
.* A Add CTXTNWTP and CTXTPWTP, TO SUPPRESS FROM WTP               @03A 02254300
         AIF   ('&DSECT' EQ 'NO').CTXT000                               02254400
CTXT     DSECT                         COMM TASK EXIT PARAMETER        X02254500
                                       LIST                             02254600
         AGO   .CTXT010                                                 02254700
.CTXT000 ANOP                                                           02255000
CTXT     DS    0F                      COMM TASK EXIT PARAMETER        X02256000
                                       LIST                             02257000
.CTXT010 ANOP                                                           02258000
CTXTACRN DS    CL4                     ACRONYM 'CTXT'                   02259000
CTXTVRSN DS    X                       VERSION LEVEL                    02260000
CTXTS212 EQU   1                       LEVEL OF OS/VS2 JBB2125          02261000
CTXTS220 EQU   2                       LEVEL OF OS/VS2 JBB2220     @L1A 02261500
CTXTS410 EQU   3                       MVS/ESA HBB4410             @D2C 02261800
CTXTS422 EQU   4                       MVS/ESA JBB4422             @L9A 02262000
CTXTVERN EQU   CTXTS422                CURRENT VERSION LEVEL       @L9C 02262200
CTXTMCS  EQU   0                       MCS CONSOLE CLASS           @L1A 02262500
         EJECT                                                          02263000
CTXTRSV1 DS    CL3                     RESERVED                         02264000
CTXTTXPJ DS    A                       POINTER TO TEXT OF MAJOR         02265000
CTXTTXPN DS    A                       POINTER TO TEXT OF MINOR         02266000
CTXTSEQN DS    F                       WTO SEQUENCE NUMBER              02267000
CTXTRSV2 DS    CL1                     RESERVED                         02268000
CTXTMLID DS    FL3                     MULTI-LINE WTO ID                02269000
CTXTRPID DS    H                       REPLY ID                         02270000
CTXTMTYP DS    0BL2                    MESSAGE TYPE FLAGS          @L1C 02270100
CTXTMTY1 DS    B                       FIRST BYTE OF MESSAGE TYPE      X02270200
                                       FLAGS                       @L1A 02270300
CTXTMTYA EQU   X'80'                   MONITOR JOBNAMES            @L1A 02270400
CTXTMTYB EQU   X'40'                   MONITOR STATUS              @L1A 02270500
*        EQU   X'20'                   RESERVED                    @L1A 02270600
*        EQU   X'10'                   RESERVED                    @L1A 02270700
*        EQU   X'08'                   RESERVED                    @L1A 02270900
CTXTMTYF EQU   X'04'                   MONITOR SESS                @L1A 02271000
*        EQU   X'02'                   RESERVED                    @L1A 02271100
*        EQU   X'01'                   RESERVED                    @L1A 02271200
CTXTMTY2 DS    B                       SECOND BYTE OF MESSAGE TYPE     X02271300
                                       FLAGS                       @L1A 02271400
CTXTRCLN DS    H                       LENGTH OF ROUTING CODES          02272000
CTXTDCLN DS    H                       LENGTH OF DESCRIPTOR CODES       02273000
CTXTRCP  DS    A                       POINTER TO ROUTING CODES         02274000
CTXTDCP  DS    A                       POINTER TO DESCRIPTOR CODES      02275000
CTXTCIDP DS    A                       POINTER TO 1-BYTE CONSOLE ID    X02275300
                                                                   @L1C 02275600
CTXTSFLG DS    0H                      STATUS FLAGS (INPUT TO THE      X02276100
                                         INSTALLATION EXIT)        @P6C 02276200
CTXTSFB1 DS    B                       STATUS FLAGS BYTE ONE            02276300
CTXTSQPC EQU   X'80'                   QUEUE TO A PARTICULAR           X02276400
                                         ACTIVE CONSOLE                 02276500
CTXTSQUN EQU   X'40'                   QUEUE TO A PARTICULAR           X02276600
                                         CONSOLE                   @P5C 02276700
CTXTSSUP EQU   X'20'                   SUPPRESSED BY MPF                02276800
CTXTSFHC EQU   X'10'                   HARDCOPY                         02276900
CTXTSNHC EQU   X'08'                   NO HARDCOPY                      02277000
CTXTSHCO EQU   X'04'                   HARDCOPY ONLY                    02277100
CTXTSRSP EQU   X'02'                   COMMAND RESPONSE                 02277200
CTXTSBCA EQU   X'01'                   BROADCAST TO ACTIVE CONSOLES     02277300
CTXTSFB2 DS    B                       STATUS FLAGS BYTE TWO       @P1C 02277400
CTXTSRET EQU   X'80'                   MSG TO BE RETAINED BY AMRF  @P1A 02277500
CTXTSAUT EQU   X'40'                   AUTOMATION SPECIFIED    @YA06920 02277600
CTXTSNMD EQU   X'20'                   PRIMARY SUBSYSTEM MODIFICATIONS X02277700
                                       NOT ALLOWED             @YA08767 02277800
CTXTSRIS EQU   X'10'                   REISSUED MESSAGE        @YA08767 02277900
*        EQU   X'0F'                   RESERVED                    @D3C 02278300
CTXTBNPF DS    B                       BRANCH-ENTRY/NIP FLAGS      @L7C 02278700
CTXTDOMD EQU   X'80'                   MESSAGE HAS BEEN DOM'D      @L7A 02278800
CTXTNBEW EQU   X'40'                   BRANCH-ENTRY OR NIP MESSAGE @L7A 02278900
CTXTHABD EQU   X'20'                   HAS ALREADY BEEN DISPLAYED  @L7A 02279000
CTXTSFB4 DS    B                       REQUEST TO EXIT             @L4A 02279100
CTXTCIDA EQU   X'40'                   THIS IS THE TERMINATION CALL    X02279500
                                       AND CLEANUP THE INDIVIDUAL DATA X02279600
                                       AREA                        @L4A 02279700
CTXTRFLG DS    0F                      REQUEST FLAGS (FROM THE USER    X02279800
                                       EXIT TO THE SYSTEM)              02279900
CTXTRF3B DS    0CL3                    REQUEST FLAGS THREE BYTES        02280000
CTXTRFB1 DS    B                       REQUEST FLAGS BYTE ONE           02280100
CTXTRCMT EQU   X'80'                   CHANGE THE MESSAGE TEXT          02280200
CTXTRCRC EQU   X'40'                   CHANGE THE ROUTING CODE(S)       02281000
CTXTRCDC EQU   X'20'                   CHANGE THE DESCRIPTOR CODE(S)    02282000
CTXTRQPC EQU   X'10'                   QUEUE TO A PARTICULAR ACTIVE    X02283000
                                       CONSOLE                          02284000
CTXTRQUN EQU   X'08'                   QUEUE TO A PARTICULAR CONSOLE   X02285000
                                       UNCONDITIONALLY                  02286000
CTXTRQRC EQU   X'04'                   QUEUE BY ROUTING CODES ONLY      02287000
CTXTRCCN EQU   X'02'                   CHANGE THE 1-BYTE CONSOLE ID    X02287600
                                                                   @L1C 02288200
CTXTRPML EQU   X'01'                   PROCESS MINOR LINES              02289000
CTXTRFB2 DS    B                       REQUEST FLAGS BYTE TWO           02290000
CTXTRDTM EQU   X'80'                   DELETE THE MESSAGE              X02291000
                                       (NO HARDCOPY AND NO DISPLAY)     02292000
CTXTROMS EQU   X'40'                   OVERRIDE MPF SUPPRESSION IF     X02293000
                                         BEING SUPPRESSED BY MPF        02294000
CTXTRFHC EQU   X'20'                   FORCE HARDCOPY                   02295000
CTXTRNHC EQU   X'10'                   FORCE NO HARDCOPY                02296000
CTXTRHCO EQU   X'08'                   FORCE HARDCOPY ONLY              02297000
CTXTRBCA EQU   X'04'                   BROADCAST MESSAGE TO ALL        X02298000
                                       ACTIVE CONSOLES                  02299000
CTXTRBCN EQU   X'02'                   DO NOT BROADCAST MESSAGE        X02300000
                                         TO ALL ACTIVE CONSOLES         02301000
CTXTRNRT EQU   X'01'                   AMRF IS NOT TO RETAIN THIS MSG  X02303300
                                                                   @P1C 02305600
CTXTRFB3 DS    B                       REQUEST FLAGS BYTE THREE    @P1C 02307900
CTXTRRET EQU   X'80'                   AMRF IS TO RETAIN THIS MSG  @P1A 02310200
CTXTRCKY EQU   X'40'                   CHANGE THE RETRIEVAL KEY    @L1A 02310700
CTXTRCFC EQU   X'20'                   CHANGE THE 4-BYTE CONSOLE ID    X02311100
                                                                   @L1A 02311500
CTXTRCMF EQU   X'10'                   CHANGE THE MESSAGE TYPE         X02312000
                                       FLAGS                       @L1A 02312200
CTXTRANO EQU   X'08'                   AUTOMATION IS NOT REQUIRED      X02312500
                                       AND ZERO TOKEN VALUE    @YA06920 02312800
CTXTRAYS EQU   X'04'                   AUTOMATION IS REQUIRED AND      X02313100
                                       UPDATE TOKEN VALUE      @YA06920 02313400
CTXTRCNM EQU   X'02'                   CHANGE THE CONSOLE NAME     @L2A 02313500
CTXTRV99 EQU   X'01'                   RESERVED                    @D3C 02313600
         DS    B                       RESERVED FOR COMM TASK USE       02313800
CTXTFCNP DS    A                       POINTER TO 4-BYTE CONSOLE ID    X02314100
                                                                   @L1A 02315700
CTXTPREQ DS    A                       POINTER TO REQUEST FLAGS,       X02317500
                                       REFLECTING CHANGES DONE TO THIS X02318500
                                       MESSAGE PREVIOUSLY          @L1A 02319500
CTXTTOKN DS    A                       TOKEN VALUE                 @L1A 02319900
CTXTKEY  DS    CL8                     RETRIEVAL KEY               @L1A 02320300
CTXTJBNM DS    CL8                     NAME OF JOB THAT ISSUED MESSAGE X02320700
                                                                   @L1A 02321100
CTXTCART DS    CL8                     CART                        @P7C 02321400
CTXTSYSN DS    CL8                     NAME OF SYSTEM ON WHICH WTO     X02321800
                                       ORIGINATED                  @L1A 02322100
CTXTAUTT DS    CL8                     AUTOMATION TOKEN VALUE  @YA06920 02322400
CTXTRSV4 DS    CL4                     RESERVED                    @02A 02322600
CTXTERFS DS    0F                      EXTENDED REQUEST FLAGS  (FROM   X02322800
                                       THE INSTALLATION EXIT TO        X02322900
                                       THE SYSTEM)                 @P6C 02323000
CTXTERF1 DS    B                       REQUEST FLAGS BYTE ONE  @YA08767 02323100
CTXTEMRY EQU   X'80'                   PRIMARY SUBSYSTEM CAN           X02323200
                                       ALTER MSG ROUTING       @YA08767 02323300
CTXTEMRN EQU   X'40'                   PRIMARY SUBSYSTEM CAN NOT       X02323400
                                       ALTER MSG ROUTING       @YA08767 02323500
CTXTEMCO EQU   X'20'                   REQUEST TO CHANGE MESSAGE       X02323600
                                       COLOR                       @L6A 02323700
CTXTEMHI EQU   X'10'                   REQUEST TO CHANGE MESSAGE       X02323800
                                       HIGHLIGHTING                @L6A 02323900
CTXTEMIN EQU   X'08'                   REQUEST TO CHANGE MESSAGE       X02324000
                                       INTENSITY                   @L6A 02324100
CTXTERF2 DS    B                       REQUEST FLAGS BYTE TWO  @YA08767 02324200
CTXTERF3 DS    B                       REQUEST FLAGS BYTE THREE        X02324300
                                                               @YA08767 02324400
CTXTESJL EQU   X'80'                   SUPPRESS MESSAGE FROM THE       X02324500
                                       JOBLOG                  @YA26891 02324600
CTXTNWTP EQU   X'40'                   DO NOT DO WTP PROCESSING (NO    X02324700
                                       SYSMSG OR TPUT)             @03A 02324800
CTXTERF4 DS    B                       REQUEST FLAGS BYTE FOUR @YA08767 02324900
CTXTCNMP DS    A                       POINTER TO CONSOLE NAME     @L2A 02325000
CTXTCWKP DS    A                       POINTER TO 12-BYTE COMMON       X02325100
                                       DATA AREA FOR ALL EXITS     @L4A 02325200
CTXTIWKP DS    A                       POINTER TO 8-BYTE DATA          X02325300
                                       AREA FOR AN INDIVIDUAL EXIT @L4A 02325400
CTXTCOLR DS    B                       REQUEST FLAG TO CHANGE          X02325500
                                       MESSAGE COLOR               @L6A 02325600
CTXTBLUE EQU   X'80'                   REQUEST COLOR BLUE          @L6A 02325700
CTXTRED  EQU   X'40'                   REQUEST COLOR RED           @L6A 02325800
CTXTPINK EQU   X'20'                   REQUEST COLOR PINK          @L6A 02325900
CTXTGREE EQU   X'10'                   REQUEST COLOR GREEN         @L6A 02326000
CTXTTURQ EQU   X'08'                   REQUEST COLOR TURQUOISE     @L6A 02326100
CTXTYELO EQU   X'04'                   REQUEST COLOR YELLOW        @L6A 02326200
CTXTWHIT EQU   X'02'                   REQUEST COLOR WHITE         @L6A 02326300
CTXTHILI DS    B                       REQUEST FLAG TO CHANGE          X02326400
                                       MESSAGE HIGHLIGHTING        @L6A 02326500
CTXTNOHI EQU   X'80'                   REQUEST NO HIGHLIGHTING     @L6A 02326600
CTXTBLNK EQU   X'40'                   REQUEST BLINKING HIGHLIGHT  @L6A 02326700
CTXTREVD EQU   X'20'                   REQUEST REVERSE VIDEO HIGHLIGHT X02326800
                                                                   @L6A 02326900
CTXTUNDR EQU   X'10'                   REQUEST UNDERLINE HIGHLIGHT @L6A 02327000
CTXTINTN DS    B                       REQUEST FLAG TO CHANGE          X02327100
                                       MESSAGE INTENSITY           @L6A 02327200
CTXTINOR EQU   X'80'                   REQUEST NORMAL INTENSITY    @L6A 02327300
CTXTIHIG EQU   X'40'                   REQUEST HIGH INTENSITY      @L6A 02327400
CTXTRSV5 DS    CL1                     RESERVED                    @02C 02327500
CTXTRPYB DS    F                       BINARY REPLY ID             @D2A 02327600
CTXTRPYL DS    H                       LENGTH OF EBCDIC REPLY ID   @D2A 02327700
CTXTRPYI DS    CL8                     EBCDIC REPLY ID             @D2A 02327800
CTXTRSV6 DS    CL10                    RESERVED                    @02C 02327900
         SPACE 3                                                        02328000
*********************************************************************** 02328100
* THE FOLLOWING STRUCTURE (CTXTATTR) IS POINTED                       * 02328200
* TO BY CTXTTXPJ OR CTXTTXPN, DEPENDING ON WHETHER                    * 02328300
* OR NOT THE WQE IS A MAJOR OR A MINOR.  THIS STRUCTURE               * 02328400
* DESCRIBES THE ATTRIBUTES OF THE MESSAGE CURRENTLY BEING             * 02328500
* PROCESSED.                                                          * 02329000
*********************************************************************** 02330000
         SPACE 1                                                        02330500
CTXTATTR DSECT                         COMM TASK EXIT MESSAGE          X02331000
                                       ATTRIBUTES                       02332000
CTXTTLEN DS    H                       TEXT LENGTH                      02333000
CTXTTLMX DS    H                       MAXIMUM LENGTH OF TEXT           02334000
CTXTTFLG DS    0CL2                    MESSAGE TYPE FLAGS               02335000
CTXTTFB1 DS    B                       TYPE FLAGS BYTE ONE              02336000
CTXTTFSL EQU   X'80'                   A SINGLE LINE MESSAGE            02337000
CTXTTFWR EQU   X'40'                   A WTOR                           02338000
CTXTTFMJ EQU   X'20'                   A MULTI-LINE MESSAGE             02339000
CTXTTFMC EQU   X'10'                   A CONTROL LINE                   02340000
CTXTTFML EQU   X'08'                   A LABEL LINE                     02341000
CTXTTFMD EQU   X'04'                   A DATA LINE                      02342000
CTXTTFME EQU   X'02'                   AN END LINE                      02343000
*        EQU   X'01'                   RESERVED                         02344000
CTXTTFB2 DS    B                       RESERVED                         02345000
CTXTTMSG DS    CL126                   TEXT OF MESSAGE                  02346000
         SPACE 3                                                        02347000
*********************************************************************** 02348000
*        ROUTING CODES ASSOCIATED WITH THE MESSAGE.                   * 02349000
*********************************************************************** 02350000
         SPACE 1                                                        02350500
CTXTROUT DSECT                         ROUTING CODES                    02351000
CTXTR001 DS    B                       FIRST BYTE OF ROUTING CODES @L1C 02351900
CTXTR01  EQU   X'80'                   MASTER CONSOLE ACTION       @L1C 02352800
CTXTR02  EQU   X'40'                   MASTER CONSOLE INFORMATION  @L1C 02353700
CTXTR03  EQU   X'20'                   TAPE POOL                   @L1C 02354600
CTXTR04  EQU   X'10'                   DIRECT ACCESS POOL          @L1C 02355500
CTXTR05  EQU   X'08'                   TAPE LIBRARY                @L1C 02356400
CTXTR06  EQU   X'04'                   DISK LIBRARY                @L1C 02357300
CTXTR07  EQU   X'02'                   UNIT RECORD POOL            @L1C 02358200
CTXTR08  EQU   X'01'                   TELEPROCESSING CONTROL      @L1C 02359100
CTXTR002 DS    B                       SECOND BYTE OF ROUTING CODES    X02360000
                                                                   @L1C 02360900
CTXTR09  EQU   X'80'                   SYSTEM SECURITY             @L1C 02361800
CTXTR10  EQU   X'40'                   SYSTEM/ERROR MAINTENANCE    @L1C 02362700
CTXTR11  EQU   X'20'                   PROGRAMMER INFORMATION      @L1C 02363600
CTXTR12  EQU   X'10'                   EMULATOR INFORMATION        @L1C 02364500
CTXTR13  EQU   X'08'                   USER ROUTING CODE           @L1C 02365400
CTXTR14  EQU   X'04'                   USER ROUTING CODE           @L1C 02366300
CTXTR15  EQU   X'02'                   USER ROUTING CODE           @L1C 02367200
CTXTR16  EQU   X'01'                   USER ROUTING CODE           @L1C 02368100
CTXTR003 DS    B                       THIRD BYTE OF ROUTING CODES     X02368200
                                                                   @L1A 02368300
CTXTR17  EQU   X'80'                   USER ROUTING CODE           @L1A 02368400
CTXTR18  EQU   X'40'                   USER ROUTING CODE           @L1A 02368500
CTXTR19  EQU   X'20'                   USER ROUTING CODE           @L1A 02368600
CTXTR20  EQU   X'10'                   USER ROUTING CODE           @L1A 02368700
CTXTR21  EQU   X'08'                   RESERVED FOR JES USAGE      @L1A 02368800
CTXTR22  EQU   X'04'                   RESERVED FOR JES USAGE      @L1A 02368900
CTXTR23  EQU   X'02'                   RESERVED FOR JES USAGE      @L1A 02369000
CTXTR24  EQU   X'01'                   RESERVED FOR JES USAGE      @L1A 02369100
CTXTR004 DS    B                       FOURTH BYTE OF ROUTING CODES    X02369200
                                                                   @L1A 02369300
CTXTR25  EQU   X'80'                   RESERVED FOR JES USAGE      @L1A 02369400
CTXTR26  EQU   X'40'                   RESERVED FOR JES USAGE      @L1A 02369500
CTXTR27  EQU   X'20'                   RESERVED FOR JES USAGE      @L1A 02369600
CTXTR28  EQU   X'10'                   RESERVED FOR JES USAGE      @L1A 02369700
CTXTR29  EQU   X'08'                   RESERVED                    @L1A 02369800
CTXTR30  EQU   X'04'                   RESERVED                    @L1A 02369900
CTXTR31  EQU   X'02'                   RESERVED                    @L1A 02370000
CTXTR32  EQU   X'01'                   RESERVED                    @L1A 02370100
CTXTR005 DS    B                       FIFTH BYTE OF ROUTING CODES     X02370300
                                                                   @L1A 02370400
CTXTR33  EQU   X'80'                   RESERVED                    @L1A 02370500
CTXTR34  EQU   X'40'                   RESERVED                    @L1A 02370600
CTXTR35  EQU   X'20'                   RESERVED                    @L1A 02370700
CTXTR36  EQU   X'10'                   RESERVED                    @L1A 02370800
CTXTR37  EQU   X'08'                   RESERVED                    @L1A 02370900
CTXTR38  EQU   X'04'                   RESERVED                    @L1A 02371000
CTXTR39  EQU   X'02'                   RESERVED                    @L1A 02371100
CTXTR40  EQU   X'01'                   RESERVED                    @L1A 02371200
CTXTR006 DS    B                       SIXTH BYTE OF ROUTING CODES     X02371300
                                                                   @L1A 02371400
CTXTR41  EQU   X'80'                   JOB STATUS MESSAGE      @YA10057 02371500
CTXTR42  EQU   X'40'                   GENERAL INFO ABOUT JES2 OR      X02371600
                                       JES3                        @L1A 02371700
CTXTR43  EQU   X'20'                   RESERVED FOR JES USAGE      @L1A 02371800
CTXTR44  EQU   X'10'                   RESERVED FOR JES USAGE      @L1A 02371900
CTXTR45  EQU   X'08'                   RESERVED FOR JES USAGE      @L1A 02372000
CTXTR46  EQU   X'04'                   RESERVED FOR JES USAGE      @L1A 02372100
CTXTR47  EQU   X'02'                   RESERVED FOR JES USAGE      @L1A 02372200
CTXTR48  EQU   X'01'                   RESERVED FOR JES USAGE      @L1A 02372300
CTXTR007 DS    B                       SEVENTH BYTE OF ROUTING CODES   X02372400
                                                                   @L1A 02372500
CTXTR49  EQU   X'80'                   RESERVED FOR JES USAGE      @L1A 02372600
CTXTR50  EQU   X'40'                   RESERVED FOR JES USAGE      @L1A 02372700
CTXTR51  EQU   X'20'                   RESERVED FOR JES USAGE      @L1A 02372800
CTXTR52  EQU   X'10'                   RESERVED FOR JES USAGE      @L1A 02372900
CTXTR53  EQU   X'08'                   RESERVED FOR JES USAGE      @L1A 02373000
CTXTR54  EQU   X'04'                   RESERVED FOR JES USAGE      @L1A 02373100
CTXTR55  EQU   X'02'                   RESERVED FOR JES USAGE      @L1A 02373200
CTXTR56  EQU   X'01'                   RESERVED FOR JES USAGE      @L1A 02373300
CTXTR008 DS    B                       EIGHTH BYTE OF ROUTING CODES    X02373400
                                                                   @L1A 02373500
CTXTR57  EQU   X'80'                   RESERVED FOR JES USAGE      @L1A 02373600
CTXTR58  EQU   X'40'                   RESERVED FOR JES USAGE      @L1A 02373700
CTXTR59  EQU   X'20'                   RESERVED FOR JES USAGE      @L1A 02373800
CTXTR60  EQU   X'10'                   RESERVED FOR JES USAGE      @L1A 02373900
CTXTR61  EQU   X'08'                   RESERVED FOR JES USAGE      @L1A 02374000
CTXTR62  EQU   X'04'                   RESERVED FOR JES USAGE      @L1A 02374100
CTXTR63  EQU   X'02'                   RESERVED FOR JES USAGE      @L1A 02374200
CTXTR64  EQU   X'01'                   RESERVED FOR JES USAGE      @L1A 02374300
CTXTR009 DS    B                       NINTH BYTE OF ROUTING CODES     X02374400
                                                                   @L1A 02374500
CTXTR65  EQU   X'80'                   PROCESSOR RELATED MESSAGE   @L1A 02374600
CTXTR66  EQU   X'40'                   PROCESSOR RELATED MESSAGE   @L1A 02374700
CTXTR67  EQU   X'20'                   PROCESSOR RELATED MESSAGE   @L1A 02374800
CTXTR68  EQU   X'10'                   PROCESSOR RELATED MESSAGE   @L1A 02374900
CTXTR69  EQU   X'08'                   PROCESSOR RELATED MESSAGE   @L1A 02375000
CTXTR70  EQU   X'04'                   PROCESSOR RELATED MESSAGE   @L1A 02375100
CTXTR71  EQU   X'02'                   PROCESSOR RELATED MESSAGE   @L1A 02375200
CTXTR72  EQU   X'01'                   PROCESSOR RELATED MESSAGE   @L1A 02375300
CTXTR010 DS    B                       TENTH BYTE OF ROUTING CODES     X02375400
                                                                   @L1A 02375500
CTXTR73  EQU   X'80'                   PROCESSOR RELATED MESSAGE   @L1A 02375600
CTXTR74  EQU   X'40'                   PROCESSOR RELATED MESSAGE   @L1A 02375700
CTXTR75  EQU   X'20'                   PROCESSOR RELATED MESSAGE   @L1A 02375800
CTXTR76  EQU   X'10'                   PROCESSOR RELATED MESSAGE   @L1A 02375900
CTXTR77  EQU   X'08'                   PROCESSOR RELATED MESSAGE   @L1A 02376000
CTXTR78  EQU   X'04'                   PROCESSOR RELATED MESSAGE   @L1A 02376100
CTXTR79  EQU   X'02'                   PROCESSOR RELATED MESSAGE   @L1A 02376200
CTXTR80  EQU   X'01'                   PROCESSOR RELATED MESSAGE   @L1A 02376300
CTXTR011 DS    B                       ELEVENTH BYTE OF ROUTING CODES  X02376400
                                                                   @L1A 02376500
CTXTR81  EQU   X'80'                   PROCESSOR RELATED MESSAGE   @L1A 02376600
CTXTR82  EQU   X'40'                   PROCESSOR RELATED MESSAGE   @L1A 02376700
CTXTR83  EQU   X'20'                   PROCESSOR RELATED MESSAGE   @L1A 02376800
CTXTR84  EQU   X'10'                   PROCESSOR RELATED MESSAGE   @L1A 02376900
CTXTR85  EQU   X'08'                   PROCESSOR RELATED MESSAGE   @L1A 02377000
CTXTR86  EQU   X'04'                   PROCESSOR RELATED MESSAGE   @L1A 02377100
CTXTR87  EQU   X'02'                   PROCESSOR RELATED MESSAGE   @L1A 02377200
CTXTR88  EQU   X'01'                   PROCESSOR RELATED MESSAGE   @L1A 02377300
CTXTR012 DS    B                       TWELFTH BYTE OF ROUTING CODES   X02377400
                                                                   @L1A 02377500
CTXTR89  EQU   X'80'                   PROCESSOR RELATED MESSAGE   @L1A 02377600
CTXTR90  EQU   X'40'                   PROCESSOR RELATED MESSAGE   @L1A 02377700
CTXTR91  EQU   X'20'                   PROCESSOR RELATED MESSAGE   @L1A 02377800
CTXTR92  EQU   X'10'                   PROCESSOR RELATED MESSAGE   @L1A 02377900
CTXTR93  EQU   X'08'                   PROCESSOR RELATED MESSAGE   @L1A 02378000
CTXTR94  EQU   X'04'                   PROCESSOR RELATED MESSAGE   @L1A 02378100
CTXTR95  EQU   X'02'                   PROCESSOR RELATED MESSAGE   @L1A 02378200
CTXTR96  EQU   X'01'                   PROCESSOR RELATED MESSAGE   @L1A 02378300
CTXTR013 DS    B                       THIRTEENTH BYTE OF ROUTING      X02378400
                                       CODES                       @L1A 02378500
CTXTR97  EQU   X'80'                   DEVICE RELATED MESSAGE      @L1A 02378600
CTXTR98  EQU   X'40'                   DEVICE RELATED MESSAGE      @L1A 02378700
CTXTR99  EQU   X'20'                   DEVICE RELATED MESSAGE      @L1A 02378800
CTXTR100 EQU   X'10'                   DEVICE RELATED MESSAGE      @L1A 02378900
CTXTR101 EQU   X'08'                   DEVICE RELATED MESSAGE      @L1A 02379000
CTXTR102 EQU   X'04'                   DEVICE RELATED MESSAGE      @L1A 02379100
CTXTR103 EQU   X'02'                   DEVICE RELATED MESSAGE      @L1A 02379200
CTXTR104 EQU   X'01'                   DEVICE RELATED MESSAGE      @L1A 02379300
CTXTR014 DS    B                       FOURTEENTH BYTE OF ROUTING      X02379400
                                       CODES                       @L1A 02379500
CTXTR105 EQU   X'80'                   DEVICE RELATED MESSAGE      @L1A 02379600
CTXTR106 EQU   X'40'                   DEVICE RELATED MESSAGE      @L1A 02379700
CTXTR107 EQU   X'20'                   DEVICE RELATED MESSAGE      @L1A 02379800
CTXTR108 EQU   X'10'                   DEVICE RELATED MESSAGE      @L1A 02379900
CTXTR109 EQU   X'08'                   DEVICE RELATED MESSAGE      @L1A 02380000
CTXTR110 EQU   X'04'                   DEVICE RELATED MESSAGE      @L1A 02380100
CTXTR111 EQU   X'02'                   DEVICE RELATED MESSAGE      @L1A 02380200
CTXTR112 EQU   X'01'                   DEVICE RELATED MESSAGE      @L1A 02380300
CTXTR015 DS    B                       FIFTEENTH BYTE OF ROUTING       X02380400
                                       CODES                       @L1A 02380500
CTXTR113 EQU   X'80'                   DEVICE RELATED MESSAGE      @L1A 02380600
CTXTR114 EQU   X'40'                   DEVICE RELATED MESSAGE      @L1A 02380700
CTXTR115 EQU   X'20'                   DEVICE RELATED MESSAGE      @L1A 02380800
CTXTR116 EQU   X'10'                   DEVICE RELATED MESSAGE      @L1A 02380900
CTXTR117 EQU   X'08'                   DEVICE RELATED MESSAGE      @L1A 02381000
CTXTR118 EQU   X'04'                   DEVICE RELATED MESSAGE      @L1A 02381100
CTXTR119 EQU   X'02'                   DEVICE RELATED MESSAGE      @L1A 02381200
CTXTR120 EQU   X'01'                   DEVICE RELATED MESSAGE      @L1A 02381300
CTXTR016 DS    B                       SIXTEENTH BYTE OF ROUTING       X02381400
                                       CODES                       @L1A 02381500
CTXTR121 EQU   X'80'                   DEVICE RELATED MESSAGE      @L1A 02381600
CTXTR122 EQU   X'40'                   DEVICE RELATED MESSAGE      @L1A 02381700
CTXTR123 EQU   X'20'                   DEVICE RELATED MESSAGE      @L1A 02381800
CTXTR124 EQU   X'10'                   DEVICE RELATED MESSAGE      @L1A 02381900
CTXTR125 EQU   X'08'                   DEVICE RELATED MESSAGE      @L1A 02382000
CTXTR126 EQU   X'04'                   DEVICE RELATED MESSAGE      @L1A 02382100
CTXTR127 EQU   X'02'                   DEVICE RELATED MESSAGE      @L1A 02382200
CTXTR128 EQU   X'01'                   DEVICE RELATED MESSAGE      @L1A 02382300
         SPACE 3                                                        02382400
*********************************************************************** 02382500
*        DESCRIPTOR CODES ASSOCIATED WITH THE MESSAGE.                * 02382600
*********************************************************************** 02382700
         SPACE 1                                                        02382800
CTXTDESC DSECT                         DESCRIPTOR CODES                 02382900
CTXTDC1  DS    B                       FIRST GROUP OF DESCRIPTOR CODES  02383000
CTXTDC01 EQU   X'80'                   CODE 1                           02383100
CTXTDC02 EQU   X'40'                   CODE 2                           02383200
CTXTDC03 EQU   X'20'                   CODE 3                           02383300
CTXTDC04 EQU   X'10'                   CODE 4                           02383400
CTXTDC05 EQU   X'08'                   CODE 5                           02383500
CTXTDC06 EQU   X'04'                   CODE 6                           02383600
CTXTDC07 EQU   X'02'                   CODE 7                           02383700
CTXTDC08 EQU   X'01'                   CODE 8                           02383800
CTXTDC2  DS    B                       SECOND GROUP OF DESCRIPTOR CODES 02384000
CTXTDC09 EQU   X'80'                   CODE 9                           02385000
CTXTDC10 EQU   X'40'                   CODE 10                          02386000
CTXTDC11 EQU   X'20'                   CODE 11                          02387000
CTXTDC12 EQU   X'10'                   CODE 12                    @P3C  02387500
CTXTDC13 EQU   X'08'                   CODE 13                    @L9A  02387800
*        EQU   X'04'-X'01'             RESERVED                   @L9C  02388100
         SPACE 3                                                        02388500
*********************************************************************** 02389000
*     1-BYTE CONSOLE ID TO WHICH THE MESSAGE IS BEING QUEUED      @L1C* 02390000
*********************************************************************** 02391000
         SPACE 1                                                        02391500
CTXTCONS DSECT                         1-BYTE CONSOLE ID                02392000
CTXTCIDR DS    CL1                     RESERVED                         02393000
CTXTCNID DS    X                       CONSOLE ID                       02395000
         DS    CL7                     RESERVED                         02396000
         SPACE 3                                                        02396100
*********************************************************************** 02396200
*     4-BYTE CONSOLE ID TO WHICH THE MESSAGE IS BEING QUEUED      @L1A* 02396300
*********************************************************************** 02396400
         SPACE 1                                                        02396500
CTXTFBCN DSECT                         4-BYTE CONSOLE ID                02396600
CTXTFBCL DS    XL1                     CONSOLE CLASS               @D1C 02396700
CTXTFBRV DS    XL1                     RESERVED - 0                @D1C 02396800
CTXTFBNM DS    0XL2                    CONSOLE NUMBER              @L1A 02396900
         DS    XL1                     FIRST BYTE OF CONSOLE           X02397000
                                       NUMBER                      @L1A 02397100
CTXTFBMI DS    XL1                     MCS PORTION OF CONSOLE ID   @L1A 02397200
         SPACE 3                                                        02398300
*********************************************************************** 02399400
*     REQUEST FLAGS, REFLECTING CHANGES DONE TO THIS MESSAGE       @P2A 02400500
*     PREVIOUSLY                                                   @P2A 02401600
*********************************************************************** 02402700
         SPACE 1                                                   @P2A 02403800
CTXTPRFL DSECT                         REQUEST FLAGS (FROM THE USER    X02404900
                                       EXIT TO THE SYSTEM)         @P2A 02405800
CTXTPF3B DS    0CL3                    REQUEST FLAGS THREE BYTES   @P2A 02406700
CTXTPFB1 DS    B                       REQUEST FLAGS BYTE ONE      @P2A 02407600
CTXTPCMT EQU   X'80'                   CHANGE THE MESSAGE TEXT     @P2A 02408500
CTXTPCRC EQU   X'40'                   CHANGE THE ROUTING CODE(S)  @P2A 02409400
CTXTPCDC EQU   X'20'                   CHANGE THE DESCRIPTOR CODE(S)   X02410300
                                                                   @P2A 02411200
CTXTPQPC EQU   X'10'                   QUEUE TO A PARTICULAR ACTIVE    X02412600
                                       CONSOLE                     @P2A 02413700
CTXTPQUN EQU   X'08'                   QUEUE TO A PARTICULAR CONSOLE   X02414800
                                       UNCONDITIONALLY             @P2A 02415900
CTXTPQRC EQU   X'04'                   QUEUE BY ROUTING CODES ONLY @P2A 02417000
CTXTPCCN EQU   X'02'                   CHANGE THE 1-BYTE CONSOLE ID    X02418100
                                                                   @P2A 02419200
CTXTPPML EQU   X'01'                   PROCESS MINOR LINES         @P2A 02420300
CTXTPFB2 DS    B                       REQUEST FLAGS BYTE TWO      @P2A 02421400
CTXTPDTM EQU   X'80'                   DELETE THE MESSAGE  (NO         X02422500
                                       HARDCOPY AND NO DISPLAY)    @P2A 02423600
CTXTPOMS EQU   X'40'                   OVERRIDE MPF SUPPRESSION IF     X02424700
                                         BEING SUPPRESSED BY MPF   @P2A 02425800
CTXTPFHC EQU   X'20'                   FORCE HARDCOPY              @P2A 02426900
CTXTPNHC EQU   X'10'                   FORCE NO HARDCOPY           @P2A 02428000
CTXTPHCO EQU   X'08'                   FORCE HARDCOPY ONLY         @P2A 02429100
CTXTPBCA EQU   X'04'                   BROADCAST MESSAGE TO ALL        X02430200
                                       ACTIVE CONSOLES             @P2A 02431300
CTXTPBCN EQU   X'02'                   DO NOT BROADCAST MESSAGE        X02432400
                                         TO ALL ACTIVE CONSOLES    @P2A 02433500
CTXTPNRT EQU   X'01'                   AMRF IS NOT TO RETAIN THIS MSG  X02434600
                                                                   @P2A 02435700
CTXTPFB3 DS    B                       REQUEST FLAGS BYTE THREE    @P2A 02436800
CTXTPRET EQU   X'80'                   AMRF IS TO RETAIN THIS MSG  @P2A 02437900
CTXTPCKY EQU   X'40'                   CHANGE THE RETRIEVAL KEY    @P2A 02439000
CTXTPCFC EQU   X'20'                   CHANGE THE 4-BYTE CONSOLE ID    X02440100
                                                                   @P2A 02441200
CTXTPCMF EQU   X'10'                   CHANGE THE MESSAGE TYPE         X02442300
                                       FLAGS                       @P2A 02443400
CTXTPANO EQU   X'08'                   AUTOMATION IS NOT REQUIRED AND  X02443600
                                       ZERO TOKEN VALUE        @YA06920 02443800
CTXTPAYS EQU   X'04'                   AUTOMATION IS REQUIRED AND      X02444000
                                       UPDATE TOKEN VALUE      @YA06920 02444200
         DS    B                       RESERVED FOR COMM TASK USE  @P2A 02444500
CTXTPRFS DS    0F                      EXTENDED REQUEST FLAGS  (FROM   X02444600
                                       THE INSTALLATION EXIT TO        X02444700
                                       THE SYSTEM)                 @P6C 02444800
CTXTPRF1 DS    B                       REQUEST FLAGS BYTE ONE  @YA08767 02444900
CTXTPMRY EQU   X'80'                   PRIMARY SUBSYSTEM CAN           X02445000
                                       ALTER MSG ROUTING       @YA08767 02445100
CTXTPMRN EQU   X'40'                   PRIMARY SUBSYSTEM CAN NOT       X02445200
                                       ALTER MSG ROUTING       @YA08767 02445300
CTXTPRF2 DS    B                       REQUEST FLAGS BYTE TWO  @YA08767 02445400
CTXTPRF3 DS    B                       REQUEST FLAGS BYTE THREE        X02445500
                                                               @YA08767 02445600
CTXTPSJL EQU   X'80'                   SUPPRESS FROM JOBLOG    @YA26891 02445700
CTXTPWTP EQU   X'40'                   NO WTP PROCESSING           @03A 02445800
CTXTPRF4 DS    B                       REQUEST FLAGS BYTE FOUR @YA08767 02445900
         SPACE 3                                                        02446000
*********************************************************************** 02446100
*      CONSOLE NAME TO WHICH THE MESSAGE IS BEING QUEUED          @L2A* 02446200
*********************************************************************** 02446300
         SPACE 1                                                        02446400
CTXTCNME DSECT                                                     @L2A 02446500
         DS    CL8                     CONSOLE NAME                @L2A 02446600
*********************************************************************** 02446700
*                                                                 @L4A* 02446800
*        12-BYTE DATA AREA MAPPING                                    * 02446900
*                                                                     * 02447000
*********************************************************************** 02447100
         SPACE 3                                                        02447200
CTXTCDAM DSECT                         12-BYTE COMMON DATA             X02447300
                                        MAPPING                    @L4A 02447400
         DS    CL4                     4 BYTES USER DATA AREA      @01C 02447500
CTXTCUDA DS    CL8                     8 BYTES USER DATA AREA      @L4A 02447700
         MEND                                                           02447800
*                 */                                                    02447900
* %CTXTPLS : ;                                                          02448000
* %IF CTXTVAL = 'NONE' %THEN %GOTO CTXTPLS1;                            02450000
*DCL 1 CTXT BASED(CTXTPTR) BDY(WORD),/* COMM TASK EXIT PARAMETER        02500000
*                                       LIST                         */ 02550000
* %GOTO CTXTPLS2;                                                       02600000
* %CTXTPLS1 : ;                                                         02650000
*DCL 1 CTXT BDY(WORD),              /* COMM TASK EXIT PARAMETER         02700000
*                                      LIST                          */ 02750000
* %CTXTPLS2 : ;                                                         02800000
*      3 CTXTACRN     CHAR(4),      /* ACRONYM 'CTXT'                */ 02850000
*      3 CTXTVRSN     FIXED(8),     /* VERSION LEVEL                 */ 02900000
*      3 CTXTRSV1     CHAR(3),      /* RESERVED                      */ 02950000
*      3 CTXTTXPJ     PTR(31),      /* POINTER TO TEXT OF MAJOR      */ 03000000
*      3 CTXTTXPN     PTR(31),      /* POINTER TO TEXT OF MINOR      */ 03050000
*      3 CTXTSEQN     FIXED(31),    /* WTO SEQUENCE NUMBER           */ 03100000
*      3 CTXTRSV2     CHAR(1),      /* RESERVED                      */ 03150000
*      3 CTXTMLID     FIXED(24),    /* MULTI-LINE WTO ID             */ 03200000
*      3 CTXTRPID     CHAR(2),      /* REPLY ID                      */ 03250000
*      3 CTXTMTYP     CHAR(2),      /* MESSAGE TYPE FLAGS        @L1C*/ 03257100
*        5 CTXTMTY1   BIT(8),       /* FIRST BYTE OF MESSAGE TYPE       03264200
*                                      FLAGS                     @L1A*/ 03271300
*          7 CTXTMTYA   BIT(1),     /* MONITOR JOBNAMES          @L1A*/ 03278400
*          7 CTXTMTYB   BIT(1),     /* MONITOR STATUS            @L1A*/ 03285500
*          7 *          BIT(1),     /* RESERVED                  @L1A*/ 03292600
*          7 *          BIT(1),     /* RESERVED                  @L1A*/ 03313900
*          7 *          BIT(1),     /* RESERVED                  @L1A*/ 03317400
*          7 CTXTMTYF   BIT(1),     /* MONITOR SESS              @L1A*/ 03321000
*          7 *          BIT(2),     /* RESERVED                  @L1A*/ 03328100
*        5 CTXTMTY2   BIT(8),       /* SECOND BYTE OF MESSAGE TYPE      03335200
*                                      FLAGS                     @L1A*/ 03342300
*      3 CTXTRCLN     FIXED(15),    /* LENGTH OF ROUTING CODES       */ 03350000
*      3 CTXTDCLN     FIXED(15),    /* LENGTH OF DESCRIPTOR CODES    */ 03400000
*      3 CTXTRCP      PTR(31),      /* POINTER TO ROUTING CODES      */ 03450000
*      3 CTXTDCP      PTR(31),      /* POINTER TO DESCRIPTOR CODES   */ 03500000
*      3 CTXTCIDP     PTR(31),      /* POINTER TO 1-BYTE CONSOLE ID     03550000
*                                                            @YA04840*/ 03600000
*      3 CTXTSFLG,                  /* STATUS FLAGS (INPUT TO THE       05050000
*                                      INSTALLATION EXIT)        @P6C*/ 05076000
*        5 CTXTSFB1   BIT(8),       /* STATUS FLAGS BYTE ONE         */ 05102000
*          7 CTXTSQPC   BIT(1),     /* QUEUE TO A PARTICULAR            05128000
*                                      ACTIVE CONSOLE                */ 05154000
*          7 CTXTSQUN   BIT(1),     /* QUEUE TO A PARTICULAR CONSOLE    05193000
*                                                                @P4C*/ 05212500
*          7 CTXTSSUP   BIT(1),     /* SUPPRESSED BY MPF             */ 05232000
*          7 CTXTSFHC   BIT(1),     /* FORCE HARDCOPY                */ 05258000
*          7 CTXTSNHC   BIT(1),     /* FORCE NO HARDCOPY             */ 05284000
*          7 CTXTSHCO   BIT(1),     /* FORCE HARDCOPY ONLY           */ 05310000
*          7 CTXTSRSP   BIT(1),     /* COMMAND RESPONSE              */ 05335300
*          7 CTXTSBCA   BIT(1),     /* BROADCAT TO ACTIVE CONSOLES   */ 05360600
*        5 CTXTSFB2   BIT(8),       /* STATUS FLAGS BYTE TWO     @P1C*/ 05376400
*          7 CTXTSRET   BIT(1),     /* MSG TO BE RETAINED BY AMRF       05392200
*                                                                @P1A*/ 05408000
*          7 CTXTSAUT   BIT(1),     /* AUTOMATION SPECIFIED  @YA06920*/ 05415900
*          7 CTXTSNMD   BIT(1),     /* PRIMARY SUBSYSTEM MODIFICATIONS  05422700
*                                      NOT ALLOWED           @YA08767*/ 05426100
*          7 CTXTSRIS   BIT(1),     /* REISSUED MESSAGE      @YA08767*/ 05429500
*          7 *          BIT(4),     /* RESERVED                  @D3C*/ 05431000
*        5 CTXTBNPF   BIT(8),       /* BRANCH-ENTRY/NIP FLAGS    @L7C*/ 05432500
*          7 CTXTDOMD   BIT(1),     /* MESSAGE HAS BEEN DOM'D    @L7A*/ 05432700
*          7 CTXTNBEW   BIT(1),     /* BRANCH-ENTRY OR NIP MSG   @02C*/ 05432900
*          7 CTXTHABD   BIT(1),     /*HAS ALREADY BEEN DISPLAYED @L7A*/ 05433100
*        5 CTXTSFB4   BIT(8),       /* REQUEST TO EXIT           @L4C*/ 05433700
*          7 *          BIT(1),     /* RESERVED                  @01C*/ 05435300
*          7 CTXTCIDA   BIT(1),     /* THIS IS THE TERMINATION CALL     05436900
*                                      AND CLEANUP THE INDIVIDUAL DATA  05437700
*                                      AREA                      @L4A*/ 05438500
*      3 CTXTRFLG,                  /* REQUEST FLAGS (FROM THE USER     05440000
*                                      EXIT TO THE SYSTEM)           */ 05466000
*        5 CTXTRF3B   CHAR(3),      /* REQUEST FLAGS THREE BYTES     */ 05490900
*          7 CTXTRFB1 BIT(8),       /* REQUEST FLAGS BYTE ONE        */ 05515800
*            9 CTXTRCMT BIT(1),     /* CHANGE THE MESSAGE TEXT       */ 05540700
*            9 CTXTRCRC BIT(1),     /* CHANGE THE ROUTING CODE(S)    */ 05565600
*            9 CTXTRCDC BIT(1),     /* CHANGE THE DESCRIPTOR CODE(S) */ 05590500
*            9 CTXTRQPC BIT(1),     /* QUEUE TO A PARTICULAR ACTIVE     05615400
*                                        CONSOLE                     */ 05640300
*            9 CTXTRQUN BIT(1),     /* QUEUE TO A PARTICULAR CONSOLE    05665200
*                                        UNCONDITIONALLY             */ 05690100
*            9 CTXTRQRC BIT(1),     /* QUEUE BY ROUTING CODE ONLY    */ 05715000
*            9 CTXTRCCN BIT(1),     /* CHANGE THE 1-BYTE  CONSOLE ID    05731600
*                                                            @YA04840*/ 05748200
*            9 CTXTRPML BIT(1),     /* PROCESS MINOR LINES           */ 05764800
*          7 CTXTRFB2 BIT(8),       /* REQUEST FLAGS BYTE TWO        */ 05789700
*            9 CTXTRDTM BIT(1),     /* DELETE THE MESSAGE            */ 05814600
*            9 CTXTROMS BIT(1),     /* OVERRIDE MPF SUPPRESSION      */ 05839500
*            9 CTXTRFHC BIT(1),     /* FORCE HARDCOPY                */ 05864400
*            9 CTXTRNHC BIT(1),     /* FORCE NO HARDCOPY             */ 05889300
*            9 CTXTRHCO BIT(1),     /* FORCE HARDCOPY ONLY           */ 05914200
*            9 CTXTRBCA BIT(1),     /* BROADCAST MESSAGE TO ALL         05939100
*                                        ACTIVE CONSOLES             */ 05964000
*            9 CTXTRBCN BIT(1),     /* DO NOT BROADCAST MESSAGE         05988900
*                                        TO ALL ACTIVE CONSOLES      */ 06013800
*            9 CTXTRNRT BIT(1),     /* AMRF IS NOT TO RETAIN THIS MSG   06026500
*                                                                @P1A*/ 06039200
*          7 CTXTRFB3 BIT(8),       /* REQUEST FLAGS BYTE THREE  @P1C*/ 06051900
*            9 CTXTRRET BIT(1),     /* AMRF IS TO RETAIN THIS MSG       06064600
*                                                                @P1A*/ 06077300
*            9 CTXTRCKY BIT(1),     /* CHANGE THE RETRIEVAL KEY  @L1A*/ 06082300
*            9 CTXTRCFC BIT(1),     /* CHANGE THE 4-BYTE                06084800
*                                      CONSOLE ID                @L1A*/ 06087300
*            9 CTXTRCMF BIT(1),     /* CHANGE THE MESSAGE TYPE          06088200
*                                      FLAGS                     @L1A*/ 06089100
*            9 CTXTRANO BIT(1),     /* AUTOMATION IS NOT REQUIRED       06089200
*                                      AND ZERO TOKEN VALUE  @YA06920*/ 06089300
*            9 CTXTRAYS BIT(1),     /* AUTOMATION IS REQUIRED AND       06089400
*                                      UPDATE TOKEN VALUE    @YA06920*/ 06089500
*            9 CTXTRCNM BIT(1),     /* CHANGE THE CONSOLE NAME   @L2C*/ 06089600
*            9 CTXTRV99 BIT(1),     /* RESERVED                  @D3C*/ 06089800
*        5 *          BIT(8),       /* RESERVED FOR COMM TASK USE    */ 06090000
*      3 CTXTFCNP     PTR(31),      /* POINTER TO 4-BYTE CONSOLE ID     06095200
*                                                                @L1A*/ 06100400
*      3 CTXTPREQ     PTR(31),      /* POINTER TO REQUEST FLAGS,        06116000
*                                      REFLECTING CHANGES DONE TO THIS  06121200
*                                      MESSAGE PREVIOUSLY        @L1A*/ 06126400
*      3 CTXTTOKN     PTR(31),      /* TOKEN VALUE               @L1A*/ 06128100
*      3 CTXTKEY      CHAR(8),      /* RETRIEVAL KEY             @L1A*/ 06129800
*      3 CTXTJBNM     CHAR(8),      /* NAME OF JOB THAT ISSUED THE      06131600
*                                      MESSAGE                   @L1A*/ 06136800
*      3 CTXTCART     CHAR(8),      /* CART                      @P7C*/ 06137400
*      3 CTXTSYSN     CHAR(8),      /* NAME OF SYSTEM ON WHICH WTO      06138100
*                                      ORIGINATED                @L1A*/ 06139400
*      3 CTXTAUTT     CHAR(8),      /* AUTOMATION TOKEN VALUE           06140000
*                                                            @YA06920*/ 06140600
*      3 CTXTRSV4     CHAR(4),      /* RESERVED                  @02A*/ 06142000
*      3 CTXTERFS     CHAR(4),      /* EXTENDED REQUEST FLAGS  (FROM    06143400
*                                      THE INSTALLATION EXIT TO         06144800
*                                      THE SYSTEM)               @P6C*/ 06146200
*        5 CTXTERF1    BIT(8),      /* REQUEST FLAGS BYTE ONE           06147600
*                                                            @YA08767*/ 06149000
*          7 CTXTEMRY  BIT(1),      /* PRIMARY SUBSYSTEM CAN            06150400
*                                      ALTER MSG ROUTING     @YA08767*/ 06151800
*          7 CTXTEMRN  BIT(1),      /* PRIMARY SUBSYSTEM CAN NOT        06153200
*                                      ALTER MSG ROUTING     @YA08767*/ 06154600
*          7 CTXTEMCO  BIT(1),      /* REQUEST TO CHANGE MESSAGE COLOR  06154800
*                                                                @L6A*/ 06155000
*          7 CTXTEMHI  BIT(1),      /* REQUEST TO CHANGE MESSAGE        06155200
*                                      HIGHLIGHTING              @L6A*/ 06155400
*          7 CTXTEMIN  BIT(1),      /* REQUEST TO CHANGE MESSAGE        06155600
*                                      INTENSITY                 @L6A*/ 06155800
*        5 CTXTERF2    BIT(8),      /* REQUEST FLAGS BYTE TWO           06156000
*                                                            @YA08767*/ 06157400
*        5 CTXTERF3    BIT(8),      /* REQUEST FLAGS BYTE THREE         06158800
*                                                            @YA08767*/ 06160200
*          7 CTXTESJL  BIT(1),      /* SUPPRESS MESSAGE FROM THE        06160400
*                                      JOBLOG                @YA26891*/ 06160600
*          7 CTXTNWTP  BIT(1),      /* DO NOT DO WTP PROCESSING (NO     06160800
*                                      SYSMSG OR TPUT)           @03A*/ 06161000
*        5 CTXTERF4    BIT(8),      /* REQUEST FLAGS BYTE FOUR   @L2C*/ 06161200
*      3 CTXTCNMP     PTR(31),      /* POINTER TO CONSOLE NAME ON       06161400
*                                      WHICH WTO IS ISSUED       @L2A*/ 06162000
*      3 CTXTCWKP     PTR(31),      /* POINTER TO 12-BYTE COMMON        06162600
*                                      DATA AREA FOR ALL EXITS   @L4A*/ 06163200
*      3 CTXTIWKP     PTR(31),      /* POINTER TO 8-BYTE DATA AREA      06163800
*                                      FOR AN INDIVIDUAL EXIT    @L4A*/ 06164400
*      3 CTXTCOLR     BIT(8),       /* REQUEST FLAG TO CHANGE           06164600
*                                      MESSAGE COLOR             @L6A*/ 06164700
*       5 CTXTBLUE BIT(1),          /* REQUEST COLOR BLUE        @L6A*/ 06164800
*       5 CTXTRED BIT(1),           /* REQUEST COLOR RED         @L6A*/ 06164900
*       5 CTXTPINK BIT(1),          /* REQUEST COLOR PINK        @L6A*/ 06165000
*       5 CTXTGREE BIT(1),          /* REQUEST COLOR GREEN       @L6A*/ 06165100
*       5 CTXTTURQ BIT(1),          /* REQUEST COLOR TURQUOISE   @L6A*/ 06165200
*       5 CTXTYELO BIT(1),          /* REQUEST COLOR YELLOW      @L6A*/ 06165300
*       5 CTXTWHIT BIT(1),          /* REQUEST COLOR WHITE       @L6A*/ 06165400
*      3 CTXTHILI     BIT(8),       /* REQUEST FLAG TO CHANGE           06165500
*                                      MESSAGE HIGHLIGHTING      @L6A*/ 06165600
*       5 CTXTNOHI BIT(1),          /* REQUEST NO HIGHLIGHTING   @L6A*/ 06165700
*       5 CTXTBLNK BIT(1),          /* REQUEST BLINKING HIGHLIGHT       06165800
*                                                                @L6A*/ 06165900
*       5 CTXTREVD BIT(1),          /* REQUEST REVERSE VIDEO            06166000
*                                      HIGHLIGHT                 @L6A*/ 06166100
*       5 CTXTUNDR BIT(1),          /* REQUEST UNDERLINE HIGHLIGHT      06166200
*                                                                @L6A*/ 06166300
*      3 CTXTINTN     BIT(8),       /* REQUEST FLAG TO CHANGE           06166400
*                                      MESSAGE INTENSITY         @L6A*/ 06166500
*       5 CTXTINOR BIT(1),          /* REQUEST NORMAL INTENSITY  @L6A*/ 06166600
*       5 CTXTIHIG BIT(1),          /* REQUEST HIGH INTENSITY    @L6A*/ 06166700
*      3 CTXTRSV5     CHAR(1),      /* RESERVED                  @02C*/ 06166800
*      3 CTXTRPYB     FIXED(31),    /* BINARY REPLY ID           @D2A*/ 06166900
*      3 CTXTRPYL     FIXED(15),    /* LENGTH OF EBCDIC REPLY ID @D2A*/ 06167000
*      3 CTXTRPYI     CHAR(8),      /* EBCDIC REPLY ID           @D2A*/ 06167100
*      3 CTXTRSV6     CHAR(10);     /* RESERVED                  @02C*/ 06167200
*@EJECT;                                                                06167300
*       /* THE FOLLOWING STRUCTURE (CTXTATTR) IS POINTED                06168000
*          TO BY CTXTTXPJ OR CTXTTXPN, DEPENDING ON WHETHER             06194000
*          OR NOT THE WQE IS A MAJOR OR A MINOR.  THIS STRUCTURE        06220000
*          DESCRIBES THE ATTRIBUTES OF THE MESSAGE CURRENTLY BEING      06246000
*          PROCESSED.                                                */ 06272000
*DCL 1 CTXTATTR BASED BDY(WORD),    /*COMM TASK EXIT MESSAGE            06300000
*                                         ATTRIBUTES                 */ 06350000
*      3 CTXTTLEN    FIXED(15),     /* TEXT LENGTH                   */ 06700000
*      3 CTXTTLMX    FIXED(15),     /* MAXIMUM LENGTH OF TEXT        */ 06750000
*      3 CTXTTFLG,                  /* MESSAGE TYPE FLAGS            */ 06800000
*        5 CTXTTFB1   BIT(8),       /* TYPE FLAGS BYTE ONE           */ 06850000
*          7 CTXTTFSL BIT(1),       /* A SINGLE LINE MESSAGE         */ 06900000
*          7 CTXTTFWR BIT(1),       /* A WTOR                        */ 06950000
*          7 CTXTTFMJ BIT(1),       /* A MULTI-LINE MESSAGE          */ 07000000
*          7 CTXTTFMC BIT(1),       /* A CONTROL LINE                */ 07050000
*          7 CTXTTFML BIT(1),       /* A LABEL LINE                  */ 07100000
*          7 CTXTTFMD BIT(1),       /* A DATA LINE                   */ 07150000
*          7 CTXTTFME BIT(1),       /* AN END LINE                   */ 07200000
*          7 CTXTTFR1 BIT(1),       /* RESERVED                      */ 07250000
*        5 CTXTTFB2   BIT(8),       /* RESERVED                      */ 07300000
*      3 CTXTTMSG   CHAR(126);      /* TEXT OF MESSAGE               */ 07350000
*     /* ROUTING CODES ASSOCIATED WITH THE MESSAGE                   */ 07400000
*DCL 1 CTXTROUT    BASED(CTXTRCP) BDY(WORD),  /* ROUTING CODES       */ 07450000
*      3 CTXTR001   BIT(8),         /* FIRST BYTE OF ROUTING CODES      07457500
*                                                                @L1C*/ 07465000
*        5 CTXTR01 BIT(1),          /* MASTER CONSOLE ACTION     @L1C*/ 07472500
*        5 CTXTR02 BIT(1),          /* MASTER CONSOLE INFORMATION       07480000
*                                                                @L1C*/ 07487500
*        5 CTXTR03 BIT(1),          /* TAPE POOL                 @L1C*/ 07495000
*        5 CTXTR04 BIT(1),          /* DIRECT ACCESS POOL        @L1C*/ 07502500
*        5 CTXTR05 BIT(1),          /* TAPE LIBRARY              @L1C*/ 07510000
*        5 CTXTR06 BIT(1),          /* DISK LIBRARY              @L1C*/ 07517500
*        5 CTXTR07 BIT(1),          /* UNIT RECORD POOL          @L1C*/ 07525000
*        5 CTXTR08 BIT(1),          /* TELEPROCESSING CONTROL    @L1C*/ 07532500
*      3 CTXTR002   BIT(8),         /* SECOND BYTE OF ROUTING CODES     07540000
*                                                                @L1C*/ 07547500
*        5 CTXTR09 BIT(1),          /* SYSTEM SECURITY           @L1C*/ 07555000
*        5 CTXTR10 BIT(1),          /* SYSTEM/ERROR MAINTENANCE  @L1C*/ 07562500
*        5 CTXTR11 BIT(1),          /* PROGRAMMER INFORMATION    @L1C*/ 07570000
*        5 CTXTR12 BIT(1),          /* EMULATOR INFORMATION      @L1C*/ 07577500
*        5 CTXTR13 BIT(1),          /* USER ROUTING CODE         @L1C*/ 07585000
*        5 CTXTR14 BIT(1),          /* USER ROUTING CODE         @L1C*/ 07592500
*        5 CTXTR15 BIT(1),          /* USER ROUTING CODE         @L1C*/ 07600000
*        5 CTXTR16 BIT(1),          /* USER ROUTING CODE         @L1C*/ 07607500
*      3 CTXTR003   BIT(8),         /* THIRD BYTE OF ROUTING CODES      07615000
*                                                                @L1A*/ 07622500
*        5 CTXTR17 BIT(1),          /* USER ROUTING CODE         @L1A*/ 07630000
*        5 CTXTR18 BIT(1),          /* USER ROUTING CODE         @L1A*/ 07637500
*        5 CTXTR19 BIT(1),          /* USER ROUTING CODE         @L1A*/ 07645000
*        5 CTXTR20 BIT(1),          /* USER ROUTING CODE         @L1A*/ 07652500
*        5 CTXTR21 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07660000
*        5 CTXTR22 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07667500
*        5 CTXTR23 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07675000
*        5 CTXTR24 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07682500
*      3 CTXTR004   BIT(8),         /* FOURTH BYTE OF ROUTING CODES     07690000
*                                                                @L1A*/ 07697500
*        5 CTXTR25 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07705000
*        5 CTXTR26 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07712500
*        5 CTXTR27 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07720000
*        5 CTXTR28 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07727500
*        5 CTXTR29 BIT(1),          /* RESERVED                  @L1A*/ 07735000
*        5 CTXTR30 BIT(1),          /* RESERVED                  @L1A*/ 07742500
*        5 CTXTR31 BIT(1),          /* RESERVED                  @L1A*/ 07750000
*        5 CTXTR32 BIT(1),          /* RESERVED                  @L1A*/ 07757500
*      3 CTXTR005   BIT(8),         /* FIFTH BYTE OF ROUTING CODES      07765000
*                                                                @L1A*/ 07772500
*        5 CTXTR33 BIT(1),          /* RESERVED                  @L1A*/ 07780000
*        5 CTXTR34 BIT(1),          /* RESERVED                  @L1A*/ 07787500
*        5 CTXTR35 BIT(1),          /* RESERVED                  @L1A*/ 07795000
*        5 CTXTR36 BIT(1),          /* RESERVED                  @L1A*/ 07802500
*        5 CTXTR37 BIT(1),          /* RESERVED                  @L1A*/ 07810000
*        5 CTXTR38 BIT(1),          /* RESERVED                  @L1A*/ 07817500
*        5 CTXTR39 BIT(1),          /* RESERVED                  @L1A*/ 07825000
*        5 CTXTR40 BIT(1),          /* RESERVED                  @L1A*/ 07832500
*      3 CTXTR006   BIT(8),         /* SIXTH BYTE OF ROUTING CODES      07840000
*                                                                @L1A*/ 07847500
*        5 CTXTR41 BIT(1),          /* JOB STATUS MESSAGE    @YA10057*/ 07855000
*        5 CTXTR42 BIT(1),          /* GENERAL INFO ABOUT JES2 OR       07862500
*                                      JES3                      @L1A*/ 07870000
*        5 CTXTR43 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07877500
*        5 CTXTR44 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07885000
*        5 CTXTR45 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07892500
*        5 CTXTR46 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07900000
*        5 CTXTR47 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07907500
*        5 CTXTR48 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07915000
*      3 CTXTR007   BIT(8),         /* SEVENTH BYTE OF ROUTING CODES    07922500
*                                                                @L1A*/ 07930000
*        5 CTXTR49 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07937500
*        5 CTXTR50 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07945000
*        5 CTXTR51 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07952500
*        5 CTXTR52 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07960000
*        5 CTXTR53 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07967500
*        5 CTXTR54 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07975000
*        5 CTXTR55 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07982500
*        5 CTXTR56 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 07990000
*      3 CTXTR008   BIT(8),         /* EIGHTH BYTE OF ROUTING CODES     07997500
*                                                                @L1A*/ 08005000
*        5 CTXTR57 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08012500
*        5 CTXTR58 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08020000
*        5 CTXTR59 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08027500
*        5 CTXTR60 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08035000
*        5 CTXTR61 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08042500
*        5 CTXTR62 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08050000
*        5 CTXTR63 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08057500
*        5 CTXTR64 BIT(1),          /* RESERVED FOR JES USAGE    @L1A*/ 08065000
*      3 CTXTR009   BIT(8),         /* NINTH BYTE OF ROUTING CODES      08072500
*                                                                @L1A*/ 08080000
*        5 CTXTR65 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08087500
*        5 CTXTR66 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08095000
*        5 CTXTR67 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08102500
*        5 CTXTR68 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08110000
*        5 CTXTR69 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08117500
*        5 CTXTR70 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08125000
*        5 CTXTR71 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08132500
*        5 CTXTR72 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08140000
*      3 CTXTR010   BIT(8),         /* TENTH BYTE OF ROUTING CODES      08147500
*                                                                @L1A*/ 08155000
*        5 CTXTR73 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08162500
*        5 CTXTR74 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08170000
*        5 CTXTR75 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08177500
*        5 CTXTR76 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08185000
*        5 CTXTR77 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08192500
*        5 CTXTR78 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08200000
*        5 CTXTR79 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08207500
*        5 CTXTR80 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08215000
*      3 CTXTR011   BIT(8),         /* ELEVENTH BYTE OF ROUTING CODES   08222500
*                                                                @L1A*/ 08230000
*        5 CTXTR81 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08237500
*        5 CTXTR82 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08245000
*        5 CTXTR83 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08252500
*        5 CTXTR84 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08260000
*        5 CTXTR85 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08267500
*        5 CTXTR86 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08275000
*        5 CTXTR87 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08282500
*        5 CTXTR88 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08290000
*      3 CTXTR012   BIT(8),         /* TWELFTH BYTE OF ROUTING CODES    08297500
*                                                                @L1A*/ 08305000
*        5 CTXTR89 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08312500
*        5 CTXTR90 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08320000
*        5 CTXTR91 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08327500
*        5 CTXTR92 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08335000
*        5 CTXTR93 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08342500
*        5 CTXTR94 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08350000
*        5 CTXTR95 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08357500
*        5 CTXTR96 BIT(1),          /* PROCESSOR RELATED MESSAGE @L1A*/ 08365000
*      3 CTXTR013   BIT(8),         /* THIRTEENTH BYTE OF ROUTING       08372500
*                                      CODES                     @L1A*/ 08380000
*        5 CTXTR97  BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08387500
*        5 CTXTR98  BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08395000
*        5 CTXTR99  BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08402500
*        5 CTXTR100 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08410000
*        5 CTXTR101 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08417500
*        5 CTXTR102 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08425000
*        5 CTXTR103 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08432500
*        5 CTXTR104 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08440000
*      3 CTXTR014   BIT(8),         /* FOURTEENTH BYTE OF ROUTING       08447500
*                                      CODES                     @L1A*/ 08455000
*        5 CTXTR105 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08462500
*        5 CTXTR106 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08470000
*        5 CTXTR107 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08477500
*        5 CTXTR108 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08485000
*        5 CTXTR109 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08492500
*        5 CTXTR110 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08500000
*        5 CTXTR111 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08507500
*        5 CTXTR112 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08515000
*      3 CTXTR015   BIT(8),         /* FIFTEENTH BYTE OF ROUTING        08522500
*                                      CODES                     @L1A*/ 08530000
*        5 CTXTR113 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08537500
*        5 CTXTR114 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08545000
*        5 CTXTR115 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08552500
*        5 CTXTR116 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08560000
*        5 CTXTR117 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08567500
*        5 CTXTR118 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08575000
*        5 CTXTR119 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08582500
*        5 CTXTR120 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08590000
*      3 CTXTR016   BIT(8),         /* SIXTEENTH BYTE OF ROUTING        08597500
*                                      CODES                     @L1A*/ 08605000
*        5 CTXTR121 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08612500
*        5 CTXTR122 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08620000
*        5 CTXTR123 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08627500
*        5 CTXTR124 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08635000
*        5 CTXTR125 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08642500
*        5 CTXTR126 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08650000
*        5 CTXTR127 BIT(1),         /* DEVICE RELATED MESSAGE    @L1A*/ 08657500
*        5 CTXTR128 BIT(1);         /* DEVICE RELATED MESSAGE    @L1A*/ 08665000
*   @EJECT;                                                             08675000
*     /* DESCRIPTOR CODES ASSOCIATED WITH THE MESSAGE                */ 08700000
*DCL 1 CTXTDESC    BASED(CTXTDCP) BDY(WORD),  /* DESCRIPTOR CODES    */ 08850000
*      3 CTXTDC1    BIT(8),        /* FIRST GROUP OF DESCRIPTOR CODES*/ 09100000
*        5 CTXTDC01 BIT(1),         /* CODE 1                        */ 09150000
*        5 CTXTDC02 BIT(1),         /* CODE 2                        */ 09200000
*        5 CTXTDC03 BIT(1),         /* CODE 3                        */ 09250000
*        5 CTXTDC04 BIT(1),         /* CODE 4                        */ 09300000
*        5 CTXTDC05 BIT(1),         /* CODE 5                        */ 09350000
*        5 CTXTDC06 BIT(1),         /* CODE 6                        */ 09400000
*        5 CTXTDC07 BIT(1),         /* CODE 7                        */ 09450000
*        5 CTXTDC08 BIT(1),         /* CODE 8                        */ 09500000
*      3 CTXTDC2    BIT(8),       /* SECOND GROUP OF DESCRIPTOR CODES*/ 09550000
*        5 CTXTDC09 BIT(1),         /* CODE 9                        */ 09600000
*        5 CTXTDC10 BIT(1),         /* CODE 10                       */ 09650000
*        5 CTXTDC11 BIT(1),         /* CODE 11                       */ 09700000
*        5 CTXTDC12 BIT(1),         /* CODE 12                   @L8A*/ 09733300
*        5 CTXTDC13 BIT(1),         /* CODE 13                   @L9A*/ 09755500
*        5 *        BIT(3);         /* RESERVED                  @L9C*/ 09777700
*     /* 1-BYTE CONSOLE ID TO WHICH THE MESSAGE IS BEING QUEUED  @L1C*/ 09800000
*DCL 1 CTXTCONS BASED(CTXTCIDP) BDY(WORD), /* 1-BYTE CONSOLE ID  @L1C*/ 09900000
*      3 CTXTCIDR CHAR(1),          /* RESERVED                      */ 10150000
*      3 *        CHAR(8),          /*                               */ 10200000
*        5 CTXTCNID FIXED(8),       /* CONSOLE ID                    */ 10216600
*        5 *        CHAR(7);        /*                               */ 10233200
*     /* 4-BYTE CONSOLE ID TO WHICH THE MESSAGE IS BEING QUEUED  @L1A*/ 10244800
*DCL   1 CTXTFBCN BASED(CTXTFCNP) BDY(WORD) FIXED(32),                  10256400
*                                   /* 4-BYTE CONSOLE ID         @L1A*/ 10268000
*        3 CTXTFBCL FIXED(8),       /* CONSOLE CLASS             @D1C*/ 10279600
*        3 CTXTFBRV FIXED(8),       /* RESERVED - 0              @D1C*/ 10291200
*        3 CTXTFBNM FIXED(16),      /* CONSOLE NUMBER            @L1A*/ 10302800
*          5 *        FIXED(8),     /* 1ST BYTE OF CONSOLE              10314400
*                                      NUMBER                    @L1A*/ 10326000
*          5 CTXTFBMI FIXED(8);     /* MCS PORTION OF CONSOLE ID @L1A*/ 10337600
*     /* REQUEST FLAGS, REQUESTING CHANGES DONE TO THIS MESSAGE         10337900
*        PREVIOUSLY                                              @P2A*/ 10338100
*DCL   1 CTXTPRFL BASED(CTXTPREQ),  /* REQUEST FLAGS (FROM THE USER     10338300
*                                      EXIT TO THE SYSTEM)       @P2A*/ 10338500
*        3 CTXTPF3B   CHAR(3),      /* REQUEST FLAGS THREE BYTES @P2A*/ 10338700
*          5 CTXTPFB1 BIT(8),       /* REQUEST FLAGS BYTE ONE    @P2A*/ 10338900
*            7 CTXTPCMT BIT(1),     /* CHANGE THE MESSAGE TEXT   @P2A*/ 10339100
*            7 CTXTPCRC BIT(1),     /* CHANGE THE ROUTING CODE(S)       10339300
*                                                                @P2A*/ 10339500
*            7 CTXTPCDC BIT(1),     /* CHANGE THE DESCRIPTOR CODE(S)    10339700
*                                                                @P2A*/ 10339900
*            7 CTXTPQPC BIT(1),     /* QUEUE TO A PARTICULAR ACTIVE     10340600
*                                        CONSOLE                 @P2A*/ 10340900
*            7 CTXTPQUN BIT(1),     /* QUEUE TO A PARTICULAR CONSOLE    10341200
*                                        UNCONDITIONALLY         @P2A*/ 10341400
*            7 CTXTPQRC BIT(1),     /* QUEUE BY ROUTING CODE ONLY       10341600
*                                                                @P2A*/ 10341800
*            7 CTXTPCCN BIT(1),     /* CHANGE THE 1-BYTE  CONSOLE ID    10342100
*                                                                @P2A*/ 10342400
*            7 CTXTPPML BIT(1),     /* PROCESS MINOR LINES       @P2A*/ 10342700
*          5 CTXTPFB2 BIT(8),       /* REQUEST FLAGS BYTE TWO    @P2A*/ 10343000
*            7 CTXTPDTM BIT(1),     /* DELETE THE MESSAGE        @P2A*/ 10343300
*            7 CTXTPOMS BIT(1),     /* OVERRIDE MPF SUPPRESSION  @P2A*/ 10343600
*            7 CTXTPFHC BIT(1),     /* FORCE HARDCOPY            @P2A*/ 10343900
*            7 CTXTPNHC BIT(1),     /* FORCE NO HARDCOPY         @P2A*/ 10344200
*            7 CTXTPHCO BIT(1),     /* FORCE HARDCOPY ONLY       @P2A*/ 10344500
*            7 CTXTPBCA BIT(1),     /* BROADCAST MESSAGE TO ALL         10344800
*                                        ACTIVE CONSOLES         @P2A*/ 10345100
*            7 CTXTPBCN BIT(1),     /* DO NOT BROADCAST MESSAGE         10345400
*                                        TO ALL ACTIVE CONSOLES  @P2A*/ 10345700
*            7 CTXTPNRT BIT(1),     /* AMRF IS NOT TO RETAIN THIS MSG   10346000
*                                                                @P2A*/ 10346300
*          5 CTXTPFB3 BIT(8),       /* REQUEST FLAGS BYTE THREE  @P2A*/ 10346600
*            7 CTXTPRET BIT(1),     /* AMRF IS TO RETAIN THIS MSG       10346900
*                                                                @P2A*/ 10347200
*            7 CTXTPCKY BIT(1),     /* CHANGE THE RETRIEVAL KEY  @P2A*/ 10347500
*            7 CTXTPCFC BIT(1),     /* CHANGE THE 4-BYTE                10347800
*                                      CONSOLE ID                @P2A*/ 10348100
*            7 CTXTPCMF BIT(1),     /* CHANGE THE MESSAGE TYPE          10348400
*                                      FLAGS                     @P2A*/ 10348800
*            7 CTXTPANO BIT(1),     /* AUTOMATION IS NOT REQUIRED       10348900
*                                      AND ZERO TOKEN VALUE  @YA06920*/ 10349000
*            7 CTXTPAYS BIT(1),     /* AUTOMATION IS REQUIRED AND       10349100
*                                      UPDATE TOKEN VALUE    @YA06920*/ 10349200
*        3 *          BIT(8),       /* RESERVED FOR COMM TASK USE       10360200
*                                                                @P2A*/ 10362400
*      3 CTXTPRFS     CHAR(4),      /* EXTENDED REQUEST FLAGS  (FROM    10364600
*                                      THE INSTALLATION EXIT TO         10366800
*                                      THE SYSTEM)               @P6C*/ 10369000
*        5 CTXTPRF1    BIT(8),      /* REQUEST FLAGS BYTE ONE           10371200
*                                                            @YA08767*/ 10373400
*          7 CTXTPMRY  BIT(1),      /* PRIMARY SUBSYSTEM CAN            10375600
*                                      ALTER MSG ROUTING     @YA08767*/ 10377800
*          7 CTXTPMRN  BIT(1),      /* PRIMARY SUBSYSTEM CAN NOT        10380000
*                                      ALTER MSG ROUTING     @YA08767*/ 10382200
*        5 CTXTPRF2    BIT(8),      /* REQUEST FLAGS BYTE TWO           10384400
*                                                            @YA08767*/ 10386600
*        5 CTXTPRF3    BIT(8),      /* REQUEST FLAGS BYTE THREE         10388800
*                                                            @YA08767*/ 10391000
*          7 CTXTPSJL  BIT(1),      /* SUPPRESS FROM JOBLOG  @YA26891*/ 10392100
*          7 CTXTPWTP  BIT(1),      /* NO WTP PROCESSING         @03A*/ 10392600
*        5 CTXTPRF4    BIT(8);      /* REQUEST FLAGS BYTE FOUR          10393200
*                                                            @YA08767*/ 10395400
*     /* CONSOLE NAME TO WHICH THE MESSAGE IS BEING QUEUED       @L2A*/ 10395600
*DCL     CTXTCNME BASED(CTXTCNMP) BDY(WORD) CHAR(8); /*          @L2A*/ 10395800
*  @SPACE;                                                              10396000
*        /* 12-BYTE DATA AREA MAPPING         @L4A*/                    10396200
* DCL 1 CTXTCDAM BASED(CTXTCWKP),  /* 12-BYTE DATA AREA MAPPING  @L4A*/ 10396400
*      3 *        CHAR(4),         /* 4 BYTES USER DATA AREA     @01C*/ 10396800
*      3 CTXTCUDA CHAR(8);         /* 8 BYTES USER DATA AREA     @L4A*/ 10397200
*     /* THE ACRONYM AND THE VERSION NUMBER TO BE PLACED IN THE         10397600
*        COMM TASK EXIT PARAMETER LIST.                              */ 10400000
*DCL CTXTNAME CHAR(4)  CONSTANT('CTXT'),/* ACRONYM                   */ 10450000
*    CTXTS212 FIXED(8) CONSTANT(1), /* LEVEL OS/VS2 JBB2125          */ 10500000
*    CTXTS220 FIXED(8) CONSTANT(2), /* LEVEL OS/VS2 JBB2220      @L1A*/ 10550000
*    CTXTS410 FIXED(8) CONSTANT(3), /* MVS/ESA HBB4410           @D2C*/ 10587500
*    CTXTS422 FIXED(8) CONSTANT(4), /* MVS/ESA JBB4422           @L9A*/ 10615600
*    CTXTVERN FIXED(8) CONSTANT(CTXTS422),/* CURRENT VERSION LEVEL      10643700
*                                                                @L9C*/ 10671800
*    CTXTMCS  FIXED(8) CONSTANT(0); /* MCS CONSOLE CLASS         @L1A*/ 10700000
