*        %GOTO SCS1;  /*                                                00036600
         MACRO                                                          00073200
         IEZVG100 &DSECT=YES                                            00109800
*                                                                    */ 00146400
*%SCS1 : ;                                                              00183000
*/* START OF SPECIFICATIONS ******************************************/ 00183900
*/*                                                                  */ 00184800
*/*01* PROPRIETARY STATEMENT=                                        */ 00185800
*/***PROPRIETARY_STATEMENT********************************************/ 00188600
*/*                                                                  */ 00191400
*/*                                                                  */ 00194200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00197000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00199800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1977, 1993                      */ 00202600
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00205400
*/*                                                                  */ 00208200
*/* STATUS= HBB5510                                                  */ 00211000
*/*                                                                  */ 00213800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00216600
*/********************************************************************/ 00219600
*/*                                                                  */ 00256200
*/* DESCRIPTIVE NAME:  Subsystem Console Service Routine         @01C*/ 00274500
*/*                    Parameter List                            @01C*/ 00292800
*/*   ACRONYM:  SCSR                                             @01A*/ 00311100
*/*                                                                  */ 00329400
*/* MACRO NAME:  IEZVG100                                        @01C*/ 00379400
*/*                                                                  */ 00622200
*/* DSECT NAME:  SCSRPLST, SCSRTCD                               @P1C*/ 00658800
*/*                                                                  */ 00695400
*/* COMPONENT:  Communications Task (SC1CK)                      @P1C*/ 00745400
*/*                                                                  */ 00915000
*/* EYE CATCHER:  SCSR                                           @01A*/ 00951600
*/*   OFFSET:  0                                                 @01A*/ 00988200
*/*   LENGTH:  4                                                 @01A*/ 01024800
*/*                                                                  */ 01061400
*/* STORAGE ATTRIBUTES:                                          @01A*/ 01083300
*/*     SUBPOOL:  ANY                                            @01A*/ 01105200
*/*     KEY:  ANY                                                @01A*/ 01127100
*/*     RESIDENCY:  ANY                                          @01A*/ 01149000
*/*                                                                  */ 01171200
*/* SIZE:  80 bytes (SCSRPLST) + 16 bytes (SCSRTCD)              @01A*/ 01175400
*/*                                                                  */ 01179600
*/* CREATED BY:  CALLER OF IEAVG700                              @01C*/ 01183800
*/*                                                                  */ 01188000
*/* POINTED TO BY:  N/A                                          @01C*/ 01192200
*/*                                                                  */ 01196400
*/* SERIALIZATION:  None                                         @01C*/ 01196500
*/*                                                                  */ 01196600
*/* FUNCTION:  Maps the Subsystem Console Service Routine        @01C*/ 01196700
*/*            (IEAVG700) Parameter List                         @01A*/ 01196800
*/*                                                                  */ 01196900
*/*01* EXTERNAL CLASSIFICATION:                                  @01A*/ 01197000
*/*02* DMTI:  BASE                                               @01A*/ 01197100
*/*02* PSPI:  FIELDS                                             @01A*/ 01197200
*/*           SCSACRO SCSVER SCSBRDON SCSBRDOF                   @P2C*/ 01197300
*/*           SCSPLEN SCSVERSN                                   @P1A*/ 01197400
*/*01* END OF EXTERNAL CLASSIFICATION                            @01A*/ 01197500
*/*                                                                  */ 01197600
*/* METHOD OF ACCESS:                                            @01C*/ 01197700
*/*   ASM:  Specify: IEZVG100                                    @01C*/ 01197800
*/*         If a DSECT is not wanted, specify DSECT=NO           @01C*/ 01197900
*/*         on the macro invocation                              @01C*/ 01198000
*/*   PL/AS:  Specify: %INCLUDE SYSLIB(IEZVG100)                 @01C*/ 01198100
*/*           If the structure is not to be based, declare       @01C*/ 01198200
*/*           a macro variable called %SCSRVAL and set it        @01C*/ 01198300
*/*           equal to 'NONE' before the macro is included.      @01C*/ 01198400
*/*                                                                  */ 01198500
*/* STATUS:  HBB4410                                             @01C*/ 01198600
*/*                                                                  */ 01198700
*/* DELETED BY:  Caller of IEAVG700                              @01A*/ 01198800
*/*                                                                  */ 01198900
*/* FREQUENCY:  N/A                                              @01A*/ 01199000
*/*                                                                  */ 01199100
*/* DEPENDENCIES:  None                                          @01A*/ 01199200
*/*                                                                  */ 01199300
*/* DISTRIBUTION LIBRARY:  AMODGEN                               @01A*/ 01199400
*/*                                                                  */ 01199500
*/* CHANGE ACTIVITY:                                             @01C*/ 01199600
*/* $MAC(IEZVG100),COMP(SC1CK):  Subsystem Console Service Routine   */ 01200700
*/* $L0=OCCF,      JBB2110,  820531, PD2I: NEW FOR OCCF              */ 01202000
*/* $L1=COEXINPT,  JBB2220,  840801, PDFB: JES3/MCS COEXISTENCE      */ 01203400
*/* $L2=COEXINPT,  JBB2220,  841130, PDR2: JES3/MCS COEXISTENCE      */ 01204100
*/* $L3=COEXINPT,  JBB2220,  850130, PDR2: JES3/MCS COEXISTENCE      */ 01204400
*/*                 YA10057                                          */ 01204600
*/*                 YA11509 NO CODE CHANGES                          */ 01204700
*/* $L4=OPSSI6S9,  HBB4410,  880111, PDS9: SUBSYSTEM CONSOLE SUPPORT */ 01205700
*/* $L5=4DGIT3J,   HBB5510,  930415, PD3J: FOUR DIGIT DEVICE SUPPORT */ 01206200
*/* $01=OY58329,   HBB4420,  921130, PDBD: Broadcast WTO/R on SSI    */ 01206400
*/* $P1=PIG3615,   HBB5510,  931109, PDSC: Prolog Update             */ 01206500
*/* $P2=PN70210,   HBB5520,  940310, PD3J: Prolog Update             */ 01206600
*/*                                                                  */ 01206700
*/* END OF SPECIFICATIONS ********************************************/ 01207800
*/* A 000000-999999                                                  */ 01244400
*/* A NEW BIT SCSRLCSY TO SCSFUNC2 AND SCSRLSYC TO SCSCOMP2,     @L4A*/ 01253500
*/*   ALSO A NEW FIELD FOR SYSTEM NAME (SCSRSYNM)                @L4A*/ 01262600
*/* C SCSUNIT4 FOR 4-DIGIT DEVICE SUPPORT                        @L5A*/ 01265600
*/* A SCSSP440 FOR LEVEL MVS/SP510                               @L5A*/ 01268600
*/* A Add fields to CDPI section of prolog                       @P1A*/ 01270100
*/* C Deleted SCSFUNC1 from the list of PSPI fields              @P2A*/ 01270900
*/********************************************************************/ 01271700
* %GOTO SCSPLS; /*                                                      01281000
         AIF   ('&DSECT' EQ 'NO').SCS000                                01317600
SCSRPLST DSECT                         PARAMETER LIST FOR              X01354200
                                       SUBSYSTEM CONSOLE SERVICE       X01390800
                                       ROUTINE                          01427400
         AGO   .SCS020                                                  01464000
.SCS000  ANOP                                                           01500600
SCSRPLST DS    0F                      PARAMETER LIST FOR              X01550600
                                       SUBSYSTEM CONSOLE SERVICE       X01610400
                                       ROUTINE                          01647000
.SCS020  ANOP                                                           01683600
SCSACRO  DS    CL4                     ACRONYM 'SCSR'                   01720200
SCSVER   DS    X                       VERSION LEVEL                    01756800
SCSSP211 EQU   1                       LEVEL OS/VS2 JBB2110             01765900
SCSSP220 EQU   2                       LEVEL OS/VS2 JBB2220        @L1A 01770400
SCSSP440 EQU   3                       LEVEL MVS/SP510             @L5A 01774900
SCSVERSN EQU   SCSSP440                CURRENT VERSION LEVEL       @L5C 01779400
         EJECT                                                          01784100
SCSFUNC1 DS    B                       FIRST FUNCTION BYTE              01793400
SCSOBTAN EQU   X'80'                   OBTAIN A CONSOLE FOR USE BY A   X01830000
                                       SYSTEM COMPONENT                 01866600
SCSDEMSL EQU   X'40'                   DEMAND SELECT REQUEST. SELECT   X01903200
                                       THE CONSOLE WHOSE ID IS IN      X01939800
                                       SCSCNID                          01976400
SCSRELSE EQU   X'20'                   RELEASE A CONSOLE WHICH WAS     X02013000
                                       DEDICATED TO A SYSTEM COMPONENT  02050000
SCSBRDON EQU   X'10'                   CAUSE ALL MESSAGES ISSUED TO BE X02100000
                                       BROADCASTED TO ALL SUBSYSTEMS    02150000
SCSBRDOF EQU   X'08'                   CAUSE ALL MESSAGES ISSUED NOT   X02200000
                                       TO BE BROADCASTED TO ALL        X02250000
                                       SUBSYSTEMS                       02300000
SCSRTCDF EQU   X'04'                   CHANGE THE ROUTING CODES OF A   X02350000
                                       CONSOLE DEDICATED TO A SYSTEM   X02400000
                                       COMPONENT                        02450000
SCSDSTAT EQU   X'02'                   DETERMINE STATUS OF             X02500000
                                       SPECIFIED CONSOLE           @L2C 02550000
SCSPROTO EQU   X'01'                   DETERMINE THE TYPE OF PROTOCOL  X02650000
                                       TO BE USED TO ISSUE COMMANDS    X02700000
                                       AND MONITOR MESSAGES. ALSO       02750000
*                                      DETERMINE THE PRIMARY            02800000
*                                      SUBSYSTEM                        02850000
SCSFUNC2 DS    B                       SECOND FUNCTION BYTE             02900000
SCSRLGRP EQU   X'80'                   RELEASE ONE OR MORE CONSOLES    X02950000
                                       BY ASID                     @L3A 03000000
SCSPMSTR EQU   X'40'                   MAKE THE CONSOLE BE CONSIDERED  X03050000
                                       A PSEUDO MASTER CONSOLE          03100000
SCSNMSTR EQU   X'20'                   MAKE THE CONSOLE TO NO LONGER   X03150000
                                       BE CONSIDERED A PSEUDO MASTER   X03200000
                                       CONSOLE                          03250000
SCSAUTH  EQU   X'10'                   INDICATE AUTHORITY OF CONSOLE    03300000
SCSRLCSY EQU   X'08'                   RELEASE ONE OR MORE CONSOLES    X03325000
                                       BY SYSTEM NAME              @L4A 03350000
*        EQU   X'04'-X'01'             RESERVED                    @L4C 03375000
SCSFUNC3 DS    B                       THIRD FUNCTION BYTE - RESERVED   03400000
SCSFUNC4 DS    B                       FOURTH FUNCTION BYTE - RESERVED  03450000
SCSCOMP  DS    0B                      FUNCTION COMPLETION BYTES        03475000
SCSCOMP1 DS    B                       FIRST FUNCTION COMPLETION BYTE   03500000
SCSOBTNC EQU   X'80'                   OBTAIN A CONSOLE REQUEST        X03550000
                                       COMPLETED                        03600000
SCSDEMSC EQU   X'40'                   DEMAND SELECT REQUEST COMPLETED  03650000
SCSRELSC EQU   X'20'                   RELEASE A CONSOLE REQUEST       X03700000
                                       COMPLETED                        03750000
SCSBRDNC EQU   X'10'                   REQUEST TO BROADCAST WTOS       X03800000
                                       COMPLETED                        03850000
SCSBRDFC EQU   X'08'                   REQUEST TO TURN OFF BROADCAST   X03900000
                                       OF WTOS COMPLETED                03950000
SCSRTCDC EQU   X'04'                   CHANGE THE ROUTING CODES        X04000000
                                       REQUEST COMPLETED                04050000
SCSSTATC EQU   X'02'                   STATUS REQUEST COMPLETE     @L2C 04100000
SCSPROTC EQU   X'01'                   DETERMINE THE TYPE OF PROTOCOL  X04200000
                                       REQUEST COMPLETED                04250000
         EJECT                                                          04275000
SCSCOMP2 DS    B                       SECOND FUNCTION COMPLETION BYTE  04300000
SCSRGRPC EQU   X'80'                   REQUEST TO RELEASE ONE OR MORE  X04333300
                                       CONSOLES BY ASID COMPLETED  @L3A 04366600
SCSPMSTC EQU   X'40'                   PSEUDO MASTER CONSOLE           X04400000
                                       REQUEST COMPLETED                04450000
SCSNMSTC EQU   X'20'                   WITHDRAW PSEUDO MASTER          X04500000
                                       ATTRIBUTE REQUEST COMPLETED      04550000
SCSAUTHC EQU   X'10'                   OBTAIN AUTHORITY OF CONSOLE     X04600000
                                       REQUEST COMPLETED                04650000
SCSRLSYC EQU   X'08'                   REQUEST TO RELEASE ONE OR MORE  X04675000
                                       BY SYSTEM NAME COMPLETED    @L4A 04700000
*        EQU   X'04'-X'01'             RESERVED                    @L4C 04725000
SCSCOMP3 DS    B                       THIRD FUNCTION COMPLETION       X04750000
                                       BYTE - RESERVED                  04800000
SCSCOMP4 DS    B                       FOURTH FUNCTION COMPLETION      X04850000
                                       BYTE - RESERVED                  04900000
SCSRSV1  DS    CL3                     RESERVED                         05350000
SCSNAME  DS    CL8                     NAME OF SYSTEM COMPONENT. FOR   X05400000
                                       USE BY THE DISPLAY CONSOLES     X05450000
                                       COMMAND                          05500000
SCSRSYNM DS    CL8                     SYSTEM NAME FOR REQUEST TO      X05550000
                                       RELEASE A GROUP OF CONSOLES @L4C 05600000
SCSCNID  DS    H                       CONSOLE ID ASSIGNED TO OR       X05650000
                                       REQUESTED BY A SYSTEM COMPONENT  05700000
SCSATI   DS    B                       SUBSYSTEM CONSOLE ATTENTION     X05750000
                                       INDEX                            05800000
SCSCNSTF DS    B                       CONSOLE STATUS FLAGS        @L2C 05850000
SCSNTDEF EQU   X'80'                   CONSOLE NOT DEFINED TO MCS  @L2A 05900000
SCSCNDEF EQU   X'40'                   CONSOLE IS DEFINED TO MCS BUT   X05950000
                                       IS NOT CURRENTLY IN USE     @L2A 06000000
SCSINUSE EQU   X'20'                   CONSOLE IS IN USE BY MCS OR     X06033300
                                       ALLOCATED TO ANOTHER JOB         06066600
SCSFLGS  DS    0B                      FLAGS BYTES                      06100000
SCSFLGS1 DS    B                       FLAGS                            06200000
SCSNTKWN EQU   X'80'                   PROTOCOL TYPE IS NOT KNOWN AT   X06250000
                                       THIS TIME                        06300000
*********************************************************************** 06310000
***  NOTE:  TYPE 1 PROTOCOL MAY BE USED REGARDLESS OF WHETHER     @L1A* 06320000
***         JES2 OR JES3 PRIMARY SUBSYSTEM IS ACTIVE.             @L1A* 06330000
*********************************************************************** 06340000
SCSTYPE1 EQU   X'40'                   TYPE 1 PROTOCOL: USE SVC 34 TO  X06350000
                                       ISSUE COMMANDS - LISTEN TO      X06400000
                                       THE SUBSYSTEM INTERFACE CALLS    06450000
*                                      OF 10(SVC 34) FOR COMMANDS       06500000
*                                      AND 9(SVC 35) FOR MESSAGES       06550000
*        EQU   X'20'                   RESERVED                    @L1C 06600000
SCSPNTKN EQU   X'10'                   PRIMARY SUBSYSTEM NOT KNOWN AT  X06900000
                                       THIS TIME                        06950000
SCSMVSC  EQU   X'08'                   MVS CONSOLE ALTERING COMMANDS   X06980000
                                       MAY BE USED                      07010000
SCSJES3C EQU   X'04'                   JES3 CONSOLE ALTERING COMMANDS  X07040000
                                       MAY BE USED                      07070000
*        EQU   X'02'-X'01'             RESERVED                         07100000
         EJECT                                                          07125000
SCSFLGS2 DS    B                       RESERVED                         07150000
SCSASID  DS    H                       ASID FOR REQUEST TO RELEASE A   X07183300
                                       GROUP OF CONSOLES           @L3A 07216600
SCSAUTHF DS    B                       AUTHORITY FLAGS OBTAINED VIA    X07250000
                                       SCSAUTH                          07275000
SCSAUTHM EQU   X'80'                   MASTER CONSOLE AUTHORITY         07300000
SCSAUTHP EQU   X'40'                   PSEUDO MASTER AUTHORITY          07341600
SCSAUTH1 EQU   X'20'                   COMMAND GROUP 1 (SYS) AUTHORITY  07383200
SCSAUTH2 EQU   X'10'                   COMMAND GROUP 2 (I/O) AUTHORITY  07424800
SCSAUTH3 EQU   X'08'                   COMMAND GROUP 3 (CONS) AUTHORITY 07466400
*        EQU   X'04'-X'01              RESERVED FOR CONSOLE             07508000
*                                      AUTHORITY INFORMATION            07550000
SCSRSV5  DS    CL3                     RESERVED                         07600000
SCSPJESN DS    CL4                     NAME OF THE PRIMARY JOB ENTRY   X07650000
                                       SUBSYSTEM                        07700000
SCSRTCDP DS    A                       ADDRESS OF FIELD CONTAINING     X07750000
                                       THE ROUTING CODES TO BE         X07800000
                                       ASSIGNED TO THE CONSOLE          07850000
SCSUNIT4 DS    0BL4                    4-DIGIT UNIT NAME           @L5C 07858300
         DS    BL1                     RESERVED                    @L5C 07866600
SCSUNIT  DS    BL3                     EBCDIC UNIT NAME OF REQUESTED   X07875000
                                       CONSOLE (3-DIGIT)           @L5C 07887500
SCSXMCSP DS    A                       POINTER TO STORAGE FOR XSUL @L4A 07937500
SCSRSV6  DS    5F                      RESERVED                    @L4C 07987500
SCSPLEN  EQU   *-SCSRPLST              LENGTH OF PARAMETER LIST DSECT   08075000
*********************************************************************** 08100000
*** THE ROUTING CODES TO BE ASSIGNED TO A CONSOLE WHICH IS           ** 08150000
*** DEDICATED TO A SYSTEM COMPONENT                                  ** 08200000
*********************************************************************** 08250000
         AIF   ('&DSECT' EQ 'NO').SCS040                                08300000
SCSRTCD  DSECT                         THE ROUTING CODES                08350000
         AGO   .SCS060                                                  08400000
.SCS040  ANOP                                                           08450000
SCSRTCD  DS    0F                      THE ROUTING CODES                08500000
.SCS060  ANOP                                                           08600000
SCSRTD01 DS    BL1            FIRST BYTE OF ROUTING CODES          @L1C 08625600
SCSRD001 EQU   X'80'          MASTER CONSOLE ACTION                @L1C 08651200
SCSRD002 EQU   X'40'          MASTER CONSOLE INFORMATION           @L1C 08676800
SCSRD003 EQU   X'20'          TAPE POOL                            @L1C 08702400
SCSRD004 EQU   X'10'          DIRECT ACCESS POOL                   @L1C 08728000
SCSRD005 EQU   X'08'          TAPE LIBRARY                         @L1C 08753600
SCSRD006 EQU   X'04'          DISK LIBRARY                         @L1C 08779200
SCSRD007 EQU   X'02'          UNIT RECORD POOL                     @L1C 08804800
SCSRD008 EQU   X'01'          TELEPROCESSING CONTROL               @L1C 08830400
SCSRTD02 DS    BL1            SECOND BYTE OF ROUTING CODES         @L1C 08856000
SCSRD009 EQU   X'80'          SYSTEM SECURITY                      @L1C 08881600
SCSRD010 EQU   X'40'          SYSTEM/ERROR MAINTENANCE             @L1C 08907200
SCSRD011 EQU   X'20'          PROGRAMMER INFORMATION               @L1C 08932800
SCSRD012 EQU   X'10'          EMULATOR INFORMATION                 @L1C 08958400
SCSRD013 EQU   X'08'          USER ROUTING CODE                    @L1C 08984000
SCSRD014 EQU   X'04'          USER ROUTING CODE                    @L1C 09009600
SCSRD015 EQU   X'02'          USER ROUTING CODE                    @L1C 09035200
SCSRD016 EQU   X'01'          USER ROUTING CODE                    @L1A 09060800
SCSRTD03 DS    BL1            THIRD BYTE OF ROUTING  CODES         @L1A 09086400
SCSRD017 EQU   X'80'          USER ROUTING CODE                    @L1A 09112000
SCSRD018 EQU   X'40'          USER ROUTING CODE                    @L1A 09137600
SCSRD019 EQU   X'20'          USER ROUTING CODE                    @L1A 09163200
SCSRD020 EQU   X'10'          USER ROUTING CODE                    @L1A 09188800
SCSRD021 EQU   X'08'          USER ROUTING CODE                    @L1A 09214400
SCSRD022 EQU   X'04'          USER ROUTING CODE                    @L1A 09240000
SCSRD023 EQU   X'02'          USER ROUTING CODE                    @L1A 09265600
SCSRD024 EQU   X'01'          USER ROUTING CODE                    @L1A 09291200
SCSRTD04 DS    BL1            FOURTH BYTE OF ROUTING CODES         @L1A 09316800
SCSRD025 EQU   X'80'          USER ROUTING CODE                    @L1A 09342400
SCSRD026 EQU   X'40'          USER ROUTING CODE                    @L1A 09368000
SCSRD027 EQU   X'20'          USER ROUTING CODE                    @L1A 09393600
SCSRD028 EQU   X'10'          USER ROUTING CODE                    @L1A 09419200
SCSRD029 EQU   X'08'          RESERVED                             @L1A 09444800
SCSRD030 EQU   X'04'          RESERVED                             @L1A 09470400
SCSRD031 EQU   X'02'          RESERVED                             @L1A 09496000
SCSRD032 EQU   X'01'          RESERVED                             @L1A 09521600
SCSRTD05 DS    BL1            FIFTH BYTE OF ROUTING CODES          @L1A 09547200
SCSRD033 EQU   X'80'          RESERVED                             @L1A 09572800
SCSRD034 EQU   X'40'          RESERVED                             @L1A 09598400
SCSRD035 EQU   X'20'          RESERVED                             @L1A 09624000
SCSRD036 EQU   X'10'          RESERVED                             @L1A 09649600
SCSRD037 EQU   X'08'          RESERVED                             @L1A 09675200
SCSRD038 EQU   X'04'          RESERVED                             @L1A 09700800
SCSRD039 EQU   X'02'          RESERVED                             @L1A 09726400
SCSRD040 EQU   X'01'          RESERVED                             @L1A 09752000
SCSRTD06 DS    BL1            SIXTH BYTE OF ROUTING CODES          @L1A 09777600
SCSRD041 EQU   X'80'          JOB STATUS MESSAGE               @YA10057 09803200
SCSRD042 EQU   X'40'          GENERAL INFO. ABOUT JES2 OR JES3     @L1A 09828800
SCSRD043 EQU   X'20'          RESERVED FOR JES USAGE               @L1A 09854400
SCSRD044 EQU   X'10'          RESERVED FOR JES USAGE               @L1A 09880000
SCSRD045 EQU   X'08'          RESERVED FOR JES USAGE               @L1A 09905600
SCSRD046 EQU   X'04'          RESERVED FOR JES USAGE               @L1A 09931200
SCSRD047 EQU   X'02'          RESERVED FOR JES USAGE               @L1A 09956800
SCSRD048 EQU   X'01'          RESERVED FOR JES USAGE               @L1A 09982400
SCSRTD07 DS    BL1            SEVENTH BYTE OF ROUTING CODES        @L1A 10008000
SCSRD049 EQU   X'80'          RESERVED FOR JES USAGE               @L1A 10033600
SCSRD050 EQU   X'40'          RESERVED FOR JES USAGE               @L1A 10059200
SCSRD051 EQU   X'20'          RESERVED FOR JES USAGE               @L1A 10084800
SCSRD052 EQU   X'10'          RESERVED FOR JES USAGE               @L1A 10110400
SCSRD053 EQU   X'08'          RESERVED FOR JES USAGE               @L1A 10136000
SCSRD054 EQU   X'04'          RESERVED FOR JES USAGE               @L1A 10161600
SCSRD055 EQU   X'02'          RESERVED FOR JES USAGE               @L1A 10187200
SCSRD056 EQU   X'01'          RESERVED FOR JES USAGE               @L1A 10212800
SCSRTD08 DS    BL1            EIGHTH BYTE OF ROUTING CODES         @L1A 10238400
SCSRD057 EQU   X'80'          RESERVED FOR JES USAGE               @L1A 10264000
SCSRD058 EQU   X'40'          RESERVED FOR JES USAGE               @L1A 10289600
SCSRD059 EQU   X'20'          RESERVED FOR JES USAGE               @L1A 10315200
SCSRD060 EQU   X'10'          RESERVED FOR JES USAGE               @L1A 10340800
SCSRD061 EQU   X'08'          RESERVED FOR JES USAGE               @L1A 10366400
SCSRD062 EQU   X'04'          RESERVED FOR JES USAGE               @L1A 10392000
SCSRD063 EQU   X'02'          RESERVED FOR JES USAGE               @L1A 10417600
SCSRD064 EQU   X'01'          RESERVED FOR JES USAGE               @L1A 10443200
SCSRTD09 DS    BL1            NINTH BYTE OF ROUTING CODES          @L1A 10468800
SCSRD065 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L1A 10494400
SCSRD066 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L1A 10520000
SCSRD067 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L1A 10545600
SCSRD068 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L1A 10571200
SCSRD069 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L1A 10596800
SCSRD070 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L1A 10622400
SCSRD071 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L1A 10648000
SCSRD072 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L1A 10673600
SCSRTD10 DS    BL1            TENTH BYTE OF ROUTING CODES          @L1A 10699200
SCSRD073 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L1A 10724800
SCSRD074 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L1A 10750400
SCSRD075 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L1A 10776000
SCSRD076 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L1A 10801600
SCSRD077 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L1A 10827200
SCSRD078 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L1A 10852800
SCSRD079 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L1A 10878400
SCSRD080 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L1A 10904000
SCSRTD11 DS    BL1            ELEVENTH BYTE OF ROUTING CODES       @L1A 10929600
SCSRD081 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L1A 10955200
SCSRD082 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L1A 10980800
SCSRD083 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L1A 11006400
SCSRD084 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L1A 11032000
SCSRD085 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L1A 11057600
SCSRD086 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L1A 11083200
SCSRD087 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L1A 11108800
SCSRD088 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L1A 11134400
SCSRTD12 DS    BL1            TWELFTH BYTE OF ROUTING CODES        @L1A 11160000
SCSRD089 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L1A 11185600
SCSRD090 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L1A 11211200
SCSRD091 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L1A 11236800
SCSRD092 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L1A 11262400
SCSRD093 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L1A 11288000
SCSRD094 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L1A 11313600
SCSRD095 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L1A 11339200
SCSRD096 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L1A 11364800
SCSRTD13 DS    BL1            THIRTEENTH BYTE OF ROUTING CODES     @L1A 11390400
SCSRD097 EQU   X'80'          DEVICE RELATED MESSAGE               @L1A 11416000
SCSRD098 EQU   X'40'          DEVICE RELATED MESSAGE               @L1A 11441600
SCSRD099 EQU   X'20'          DEVICE RELATED MESSAGE               @L1A 11467200
SCSRD100 EQU   X'10'          DEVICE RELATED MESSAGE               @L1A 11492800
SCSRD101 EQU   X'08'          DEVICE RELATED MESSAGE               @L1A 11518400
SCSRD102 EQU   X'04'          DEVICE RELATED MESSAGE               @L1A 11544000
SCSRD103 EQU   X'02'          DEVICE RELATED MESSAGE               @L1A 11569600
SCSRD104 EQU   X'01'          DEVICE RELATED MESSAGE               @L1A 11595200
SCSRTD14 DS    BL1            FOURTEENTH BYTE OF ROUTING CODES     @L1A 11620800
SCSRD105 EQU   X'80'          DEVICE RELATED MESSAGE               @L1A 11646400
SCSRD106 EQU   X'40'          DEVICE RELATED MESSAGE               @L1A 11672000
SCSRD107 EQU   X'20'          DEVICE RELATED MESSAGE               @L1A 11697600
SCSRD108 EQU   X'10'          DEVICE RELATED MESSAGE               @L1A 11723200
SCSRD109 EQU   X'08'          DEVICE RELATED MESSAGE               @L1A 11748800
SCSRD110 EQU   X'04'          DEVICE RELATED MESSAGE               @L1A 11774400
SCSRD111 EQU   X'02'          DEVICE RELATED MESSAGE               @L1A 11800000
SCSRD112 EQU   X'01'          DEVICE RELATED MESSAGE               @L1A 11825600
SCSRTD15 DS    BL1            FIFTEENTH BYTE OF ROUTING CODES      @L1A 11851200
SCSRD113 EQU   X'80'          DEVICE RELATED MESSAGE               @L1A 11876800
SCSRD114 EQU   X'40'          DEVICE RELATED MESSAGE               @L1A 11902400
SCSRD115 EQU   X'20'          DEVICE RELATED MESSAGE               @L1A 11928000
SCSRD116 EQU   X'10'          DEVICE RELATED MESSAGE               @L1A 11953600
SCSRD117 EQU   X'08'          DEVICE RELATED MESSAGE               @L1A 11979200
SCSRD118 EQU   X'04'          DEVICE RELATED MESSAGE               @L1A 12004800
SCSRD119 EQU   X'02'          DEVICE RELATED MESSAGE               @L1A 12030400
SCSRD120 EQU   X'01'          DEVICE RELATED MESSAGE               @L1A 12056000
SCSRTD16 DS    BL1            SIXTEENTH BYTE OF ROUTING CODES      @L1A 12081600
SCSRD121 EQU   X'80'          DEVICE RELATED MESSAGE               @L1A 12107200
SCSRD122 EQU   X'40'          DEVICE RELATED MESSAGE               @L1A 12132800
SCSRD123 EQU   X'20'          DEVICE RELATED MESSAGE               @L1A 12158400
SCSRD124 EQU   X'10'          DEVICE RELATED MESSAGE               @L1A 12184000
SCSRD125 EQU   X'08'          DEVICE RELATED MESSAGE               @L1A 12209600
SCSRD126 EQU   X'04'          DEVICE RELATED MESSAGE               @L1A 12235200
SCSRD127 EQU   X'02'          DEVICE RELATED MESSAGE               @L1A 12260800
SCSRD128 EQU   X'01'          DEVICE RELATED MESSAGE               @L1A 12286400
SCSRLEN  EQU   *-SCSRTCD      LENGTH OF ROUTING CODES DSECT             12312000
SCSLEN   EQU   SCSPLEN+SCSRLEN LENGTH OF ALL IEZVG100 DSECTS       @L1C 12337600
         EJECT                                                          12375000
*********************************************************************** 15502200
***          SUBSYSTEM CONSOLE SERVICE ROUTINE RETURN CODES          ** 15502400
***                    RETURNED IN REGISTER 15                       ** 15502600
*********************************************************************** 15502800
SCSROK   EQU    0                      THE REQUESTED FUNCTIONS HAVE    X15503000
                                       BEEN PERFORMED                   15503200
SCSRNTFD EQU    4                      A CONSOLE COULD NOT BE ASSIGNED X15503400
                                       TO THE SYSTEM COMPONENT BECAUSE X15503600
                                       AN AVAILABLE CONSOLE COULD NOT   15503800
*                                      BE FOUND                         15504000
SCSRNAVL EQU    8                      THE REQUESTED CONSOLE WAS NOT   X15504200
                                       AVAILABLE TO BE DEDICATED TO A  X15504400
                                       SYSTEM COMPONENT.                15504600
SCSRNCMP EQU    12                     ONE OR MORE REQUESTED FUNCTIONS X15504800
                                       COULD NOT BE COMPLETED.     @L1C 15543900
*                                      CHECK SCSCOMP1, SCSCOMP2,        15583000
*                                      AND SCSCOMP3 TO DETERMINE WHAT   15622100
*                                      FUNCTIONS HAVE BEEN COMPLETED    15661200
*                                      BY IEAVG700.                     15700300
         MEND                                                           15974000
*            */                                                         16013100
* %SCSPLS : ;                                                           16052200
* %IF SCSRVAL = 'NONE' %THEN %GOTO SCSPLS1;                             16091300
*DCL 1 SCSRPLST BASED(SCSRPTR) BDY(WORD),/* PARAMETER LIST FOR          16130400
*                                      SUBSYSTEM CONSOLE SERVICE        16169500
*                                      ROUTINE                       */ 16208600
* %GOTO SCSPLS2;                                                        16247700
* %SCSPLS1 : ;                                                          16286800
*DCL 1 SCSRPLST BDY(WORD),          /* PARAMETER LIST FOR SUBSYSTEM     16325900
*                                      CONSOLE SERVICE ROUTINE       */ 16365000
* %SCSPLS2 : ;                                                          16404100
*      2 SCSACRO      CHAR(4),      /* ACRONYM 'SCSR'                */ 16443200
*      2 SCSVER       FIXED(8),     /* VERSION LEVEL                 */ 16482300
* @EJECT ASM;                                                           16521400
*      2 SCSFUNC1     BIT(8),       /* FIRST FUNCTION BYTE           */ 16560500
*        3 SCSOBTAN   BIT(1),       /* OBTAIN A CONSOLE FOR USE BY A    16599600
*                                      SYSTEM COMPONENT              */ 16638700
*        3 SCSDEMSL   BIT(1),       /* DEMAND SELECT REQUEST. SELECT    16677800
*                                      THE CONSOLE WHOSE ID IS IN       16716900
*                                      SCSCNID                       */ 16756000
*        3 SCSRELSE   BIT(1),       /* RELEASE A CONSOLE WHICH WAS      16795100
*                                      DEDICATED TO A SYSTEM COMPONENT  16834200
*                                                                    */ 16873300
*        3 SCSBRDON   BIT(1),       /* CAUSE ALL MESSAGES ISSUED TO BE  16912400
*                                      BROADCASTED TO ALL SUBSYSTEMS */ 16951500
*        3 SCSBRDOF   BIT(1),       /* CAUSE ALL MESSAGES ISSUED NOT    16990600
*                                      TO BE BROADCASTED TO ALL         17029700
*                                      SUBSYSTEMS                    */ 17068800
*        3 SCSRTCDF   BIT(1),       /* CHANGE THE ROUTING CODES OF A    17107900
*                                      CONSOLE DEDICATED TO A SYSTEM    17147000
*                                      COMPONENT                     */ 17186100
*        3 SCSDSTAT   BIT(1),       /* DETERMINE STATUS OF              17212100
*                                      SPECIFIED CONSOLE         @L2C*/ 17238100
*        3 SCSPROTO   BIT(1),       /* DETERMINE THE TYPE OF PROTOCOL   17264300
*                                      TO BE USED TO ISSUE COMMANDS     17303400
*                                      AND MONITOR MESSAGES. ALSO       17342500
*                                      DETERMINE THE PRIMARY            17381600
*                                      SUBSYSTEM                     */ 17420700
*      2 SCSFUNC2     BIT(8),       /* SECOND FUNCTION BYTE          */ 17459800
*        3 SCSRLGRP   BIT(1),       /* RELEASE ONE OR MORE CONSOLES     17498900
*                                      BY ASID                   @L3A*/ 17538000
*        3 SCSPMSTR   BIT(1),       /* MAKE THE CONSOLE BE CONSIDERED   17577100
*                                      A PSEUDO MASTER CONSOLE       */ 17616200
*        3 SCSNMSTR   BIT(1),       /* MAKE THE CONSOLE TO NO LONGER    17655300
*                                      BE CONSIDERED A PSEUDO MASTER    17694400
*                                      CONSOLE                       */ 17733500
*        3 SCSAUTH    BIT(1),       /* INDICATE AUTHORITY OF CONSOLE */ 17772600
*        3 SCSRLCSY   BIT(1),       /* RELEASE ONE OR MORE CONSOLES     17792100
*                                      BY SYSTEM NAME            @L4A*/ 17811600
*        3 *          BIT(3),       /* RESERVED                  @L4C*/ 17831100
*      2 SCSFUNC3     BIT(8),       /* THIRD FUNCTION BYTE -RESERVED */ 17850800
*      2 SCSFUNC4     BIT(8),       /* FOURTH FUNCTION BYTE-RESERVED */ 17889900
*      2 SCSCOMP      CHAR(4),      /* FUNCTION COMPLETION BYTES     */ 17929000
*        3 SCSCOMP1     BIT(8),     /* FIRST FUNCTION COMPLETION BYTE*/ 17968100
*          4 SCSOBTNC   BIT(1),     /* OBTAIN A CONSOLE REQUEST         18007200
*                                      COMPLETED                     */ 18046300
*          4 SCSDEMSC   BIT(1),     /* DEMAND SELECT REQUEST COMPLETED  18085400
*                                                                    */ 18124500
*          4 SCSRELSC   BIT(1),     /* RELEASE A CONSOLE REQUEST        18163600
*                                      COMPLETED                     */ 18202700
*          4 SCSBRDNC   BIT(1),     /* REQUEST TO BROADCAST WTOS        18241800
*                                      COMPLETED                     */ 18280900
*          4 SCSBRDFC   BIT(1),     /* REQUEST TO TURN OFF BROADCAST    18320000
*                                      OF WTOS COMPLETED             */ 18359100
*          4 SCSRTCDC   BIT(1),     /* CHANGE THE ROUTING CODES         18398200
*                                      REQUEST COMPLETED             */ 18437300
*          4 SCSSTATC   BIT(1),     /* STATUS REQUEST COMPLETE   @L2C*/ 18476400
*          4 SCSPROTC   BIT(1),     /* DETERMINE THE TYPE OF PROTOCOL   18515500
*                                      REQUEST COMPLETED             */ 18554600
* @EJECT ASM;                                                           18593700
*        3 SCSCOMP2     BIT(8),     /* SECOND FUNCTION COMPLETION       18632800
*                                      BYTE                          */ 18671900
*          4 SCSRGRPC   BIT(1),     /* REQUEST TO RELEASE ONE OR MORE   18697900
*                                      CONSOLES BY ASID COMPLETED       18715300
*                                                                @L3A*/ 18732700
*          4 SCSPMSTC   BIT(1),     /* PSEUDO MASTER CONSOLE            18750100
*                                      REQUEST COMPLETED             */ 18789200
*          4 SCSNMSTC   BIT(1),     /* WITHDRAW PSEUDO MASTER           18828300
*                                      ATTRIBUTE REQUEST COMPLETED   */ 18867400
*          4 SCSAUTHC   BIT(1),     /* OBTAIN AUTHORITY OF CONSOLE      18906500
*                                      REQUEST COMPLETED             */ 18945600
*          4 SCSRLSYC   BIT(1),     /* REQUEST TO RELEASE ONE OR MORE   18961200
*                                      CONSOLES BY SYSTEM NAME          18976800
*                                      COMPLETED                 @L4A*/ 18992400
*          4 *          BIT(3),     /* RESERVED                  @L4C*/ 19008000
*        3 SCSCOMP3     BIT(8),     /* THIRD FUNCTION COMPLETION        19023800
*                                      BYTE - RESERVED               */ 19062900
*        3 SCSCOMP4     BIT(8),     /* FOURTH FUNCTION COMPLETION       19112900
*                                      BYTE - RESERVED               */ 19162900
*      2 SCSRSV1      CHAR(3),      /* RESERVED                      */ 19375700
*      2 SCSNAME      CHAR(8),      /* NAME OF SYSTEM COMPONENT. FOR    19414800
*                                      USE BY THE DISPLAY CONSOLES      19453900
*                                      COMMAND                       */ 19493000
*      2 SCSRSYNM     CHAR(8),      /* SYSTEM NAME FOR REQUEST TO       19512500
*                                      RELEASE A GROUP OF CONSOLES      19532000
*                                                                @L4C*/ 19551500
*      2 SCSCNID      FIXED(15),    /* CONSOLE ID ASSIGNED TO OR        19571200
*                                      REQUESTED BY A SYSTEM COMPONENT  19610300
*                                                                    */ 19649400
*      2 SCSATI       FIXED(8),     /* SUBSYSTEM CONSOLE ATTENTION      19688500
*                                      INDEX                         */ 19727600
*      2 SCSCNSTF     BIT(8),       /* CONSOLE STATUS FLAGS      @L2C*/ 19736200
*        3 SCSNTDEF    BIT(1),      /* CONSOLE NOT DEFINED TO MCS       19749100
*                                                                @L2A*/ 19762000
*        3 SCSCNDEF    BIT(1),      /* CONSOLE IS DEFINED TO MCS BUT    19770600
*                                      NOT CURRENTLY IN USE BY MCS      19776400
*                                                                @L2A*/ 19782200
*        3 SCSINUSE    BIT(1),      /* CONSOLE IS IN USE BY MCS OR      19788000
*                                      ALLOCATED TO ANOTHER JOB  @L2A*/ 19796800
*      2 SCSFLGS      CHAR(2),      /* FLAGS BYTES                   */ 19805800
*        3 SCSFLGS1   BIT(8),       /* FLAGS                         */ 19844900
*          4 SCSNTKWN   BIT(1),     /* PROTOCOL TYPE IS NOT KNOWN AT    19884000
*                                      THIS TIME                     */ 19923100
*/********************************************************************/ 19930900
*/*  NOTE:  TYPE 1 PROTOCOL MAY BE USED REGARDLESS OF WHETHER    @L1A*/ 19938700
*/*         JES2 OR JES3 PRIMARY SUBSYSTEM IS ACTIVE.            @L1A*/ 19946500
*/********************************************************************/ 19954300
*          4 SCSTYPE1   BIT(1),     /* TYPE 1 PROTOCOL: USE SVC 34 TO   19962200
*                                      ISSUE COMMANDS - LISTEN TO       20001300
*                                      THE SUBSYSTEM INTERFACE CALLS    20040400
*                                      OF 10(SVC 34) FOR COMMANDS       20079500
*                                      AND 9(SVC 35) FOR MESSAGES    */ 20118600
*          4 *          BIT(1),     /* RESERVED                  @L1A*/ 20157700
*          4 SCSPNTKN   BIT(1),     /* PRIMARY SUBSYSTEM NOT KNOWN AT   20196800
*                                      THIS TIME                     */ 20235900
*          4 SCSMVSC    BIT(1),     /* MVS CONSOLE ALTERING COMMANDS    20275000
*                                      MAY BE USED                   */ 20314100
*          4 SCSJES3C   BIT(1),     /* JES3 CONSOLE ALTERING COMMANDS   20353200
*                                      MAY BE USED                   */ 20392300
*          4 *          BIT(2),     /* RESERVED                      */ 20431400
* @EJECT ASM;                                                           20470500
*        3 SCSFLGS2   BIT(8),       /* RESERVED                      */ 20509600
*      2 SCSASID      FIXED(15),    /* ASID FOR REQUEST TO RELEASE A    20535600
*                                      GROUP OF CONSOLES         @L3A*/ 20561600
*      2 SCSAUTHF     BIT(8),       /* AUTHORITY FLAGS OBTAINED VIA     20587800
*                                      SCSAUTH                       */ 20626900
*        3 SCSAUTHM   BIT(1),       /* MASTER CONSOLE AUTHORITY      */ 20666000
*        3 SCSAUTHP   BIT(1),       /* PSEUDO MASTER AUTHORITY       */ 20705100
*        3 SCSAUTH1   BIT(1),       /* COMMAND GROUP 1 (SYS)            20744200
*                                      AUTHORITY                     */ 20783300
*        3 SCSAUTH2   BIT(1),       /* COMMAND GROUP 2 (I/O)            20822400
*                                      AUTHORITY                     */ 20861500
*        3 SCSAUTH3   BIT(1),       /* COMMAND GROUP 3 (CONS)           20900600
*                                      AUTHORITY                     */ 20939700
*        3 *          BIT(3),       /* RESERVED FOR CONSOLE             20978800
*                                      AUTHORITY INFORMATION         */ 21017900
*      2 SCSRSV5      CHAR(3),      /* RESERVED                      */ 21057000
*      2 SCSPJESN     CHAR(4),      /* NAME OF THE PRIMARY JOB ENTRY    21096100
*                                      SUBSYSTEM                     */ 21135200
*      2 SCSRTCDP     PTR(31),      /* ADDRESS OF FIELD CONTAINING      21174300
*                                      THE ROUTING CODES TO BE          21213400
*                                      ASSIGNED TO THE CONSOLE       */ 21252500
*      2 SCSUNIT4      CHAR(4),     /* 4-DIGIT UNIT NAME         @L5C*/ 21262700
*        3 *           CHAR(1),     /* IGNORED FOR 3-DIGIT       @L5C*/ 21272900
*        3 SCSUNIT     CHAR(3),     /* EBCDIC UNIT NAME OF REQUESTED    21283100
*                                      CONSOLE (3-DIGIT)         @L5C*/ 21293300
*      2 SCSXMCSP     PTR(31),      /* POINTER TO STORAGE FOR XSUL      21303600
*                                                                @L4A*/ 21325600
*      2 SCSRSV6 (5)  PTR(31);      /* RESERVED                  @L4C*/ 21347600
*/********************************************************************/ 21369800
*/* THE ROUTING CODES TO BE ASSIGNED TO A CONSOLE WHICH IS           */ 21408900
*/* DEDICATED TO A SYSTEM COMPONENT                                  */ 21448000
*/********************************************************************/ 21487100
* %IF SCSRVAL = 'NONE' %THEN %GOTO SCSPLS3;                             21526200
*DCL 1 SCSRTCD      BASED(SCSRTCDP) BDY(WORD), /* THE ROUTING CODES  */ 21565300
* %GOTO SCSPLS4;                                                        21604400
* %SCSPLS3 : ;                                                          21643500
*DCL 1 SCSRTCD BDY(WORD),           /* THE ROUTING CODES             */ 21682600
* %SCSPLS4 : ;                                                          21721700
*     3 SCSRTD01  CHAR(1),               /* FIRST BYTE OF ROUTING CODES 21760800
*                                                                @L1C*/ 21799900
*       4 SCSRD001  BIT(1),              /* MASTER CONSOLE ACTION       21839000
*                                                                @L1C*/ 21878100
*       4 SCSRD002  BIT(1),              /* MASTER CONSOLE              21917200
*                                           INFORMATION          @L1C*/ 21956300
*       4 SCSRD003  BIT(1),              /* TAPE POOL                   21995400
*                                                                @L1C*/ 22034500
*       4 SCSRD004  BIT(1),              /* DIRECT ACCESS POOL          22073600
*                                                                @L1C*/ 22112700
*       4 SCSRD005  BIT(1),              /* TAPE LIBRARY                22151800
*                                                                @L1C*/ 22190900
*       4 SCSRD006  BIT(1),              /* DISK LIBRARY                22230000
*                                                                @L1C*/ 22269100
*       4 SCSRD007  BIT(1),              /* UNIT RECORD POOL            22308200
*                                                                @L1C*/ 22347300
*       4 SCSRD008  BIT(1),              /* TELEPROCESSING CONTROL      22386400
*                                                                @L1C*/ 22425500
*     3 SCSRTD02   BIT(8),               /* SECOND BYTE OF ROUTING      22464600
*                                           CODES                @L1C*/ 22503700
*       4 SCSRD009  BIT(1),              /* SYSTEM SECURITY             22542800
*                                                                @L1C*/ 22581900
*       4 SCSRD010  BIT(1),              /* SYSTEM/ERROR MAINTENANCE    22621000
*                                                                @L1C*/ 22660100
*       4 SCSRD011  BIT(1),              /* PROGRAMMER INFORMATION      22699200
*                                                                @L1C*/ 22738300
*       4 SCSRD012  BIT(1),              /* EMULATOR INFORMATION        22777400
*                                                                @L1C*/ 22816500
*       4 SCSRD013  BIT(1),              /* USER ROUTING CODE           22855600
*                                                                @L1C*/ 22894700
*       4 SCSRD014  BIT(1),              /* USER ROUTING CODE           22933800
*                                                                @L1C*/ 22972900
*       4 SCSRD015  BIT(1),              /* USER ROUTING CODE           23012000
*                                                                @L1C*/ 23051100
*       4 SCSRD016  BIT(1),              /* USER ROUTING CODE           23090200
*                                                                @L1A*/ 23129300
*     3 SCSRTD03   BIT(8),               /* THIRD BYTE OF ROUTING       23168400
*                                           CODES                @L1A*/ 23207500
*       4 SCSRD017  BIT(1),              /* USER ROUTING CODE           23246600
*                                                                @L1A*/ 23285700
*       4 SCSRD018  BIT(1),              /* USER ROUTING CODE           23324800
*                                                                @L1A*/ 23363900
*       4 SCSRD019  BIT(1),              /* USER ROUTING CODE           23403000
*                                                                @L1A*/ 23442100
*       4 SCSRD020  BIT(1),              /* USER ROUTING CODE           23481200
*                                                                @L1A*/ 23520300
*       4 SCSRD021  BIT(1),              /* USER ROUTING CODE           23559400
*                                                                @L1A*/ 23598500
*       4 SCSRD022  BIT(1),              /* USER ROUTING CODE           23637600
*                                                                @L1A*/ 23676700
*       4 SCSRD023  BIT(1),              /* USER ROUTING CODE           23715800
*                                                                @L1A*/ 23754900
*       4 SCSRD024  BIT(1),              /* USER ROUTING CODE           23794000
*                                                                @L1A*/ 23833100
*     3 SCSRTD04   BIT(8),               /* FOURTH BYTE OF ROUTING      23872200
*                                           CODES                @L1A*/ 23911300
*       4 SCSRD025  BIT(1),              /* USER ROUTING CODE           23950400
*                                                                @L1A*/ 23989500
*       4 SCSRD026  BIT(1),              /* USER ROUTING CODE           24028600
*                                                                @L1A*/ 24067700
*       4 SCSRD027  BIT(1),              /* USER ROUTING CODE           24106800
*                                                                @L1A*/ 24145900
*       4 SCSRD028  BIT(1),              /* USER ROUTING CODE           24185000
*                                                                @L1A*/ 24224100
*       4 SCSRD029  BIT(1),              /* RESERVED                    24263200
*                                                                @L1A*/ 24302300
*       4 SCSRD030  BIT(1),              /* RESERVED                    24341400
*                                                                @L1A*/ 24380500
*       4 SCSRD031  BIT(1),              /* RESERVED                    24419600
*                                                                @L1A*/ 24458700
*       4 SCSRD032  BIT(1),              /* RESERVED                    24497800
*                                                                @L1A*/ 24536900
*     3 SCSRTD05   BIT(8),               /* FIFTH BYTE OF ROUTING       24576000
*                                           CODES                @L1A*/ 24615100
*       4 SCSRD033  BIT(1),              /* RESERVED                    24654200
*                                                                @L1A*/ 24693300
*       4 SCSRD034  BIT(1),              /* RESERVED                    24732400
*                                                                @L1A*/ 24771500
*       4 SCSRD035  BIT(1),              /* RESERVED                    24810600
*                                                                @L1A*/ 24849700
*       4 SCSRD036  BIT(1),              /* RESERVED                    24888800
*                                                                @L1A*/ 24927900
*       4 SCSRD037  BIT(1),              /* RESERVED                    24967000
*                                                                @L1A*/ 25006100
*       4 SCSRD038  BIT(1),              /* RESERVED                    25045200
*                                                                @L1A*/ 25084300
*       4 SCSRD039  BIT(1),              /* RESERVED                    25123400
*                                                                @L1A*/ 25162500
*       4 SCSRD040  BIT(1),              /* RESERVED                    25201600
*                                                                @L1A*/ 25240700
*     3 SCSRTD06   BIT(8),               /* SIXTH BYTE OF ROUTING       25279800
*                                           CODES                @L1A*/ 25318900
*       4 SCSRD041  BIT(1),              /* JOB STATUS MESSAGE          25358000
*                                                            @YA10057*/ 25397100
*       4 SCSRD042  BIT(1),              /* GENERAL INFO. ABOUT JES2    25436200
*                                           OR JES3              @L1A*/ 25475300
*       4 SCSRD043  BIT(1),              /* RESERVED FOR JES USAGE      25514400
*                                                                @L1A*/ 25553500
*       4 SCSRD044  BIT(1),              /* RESERVED FOR JES USAGE      25592600
*                                                                @L1A*/ 25631700
*       4 SCSRD045  BIT(1),              /* RESERVED FOR JES USAGE      25670800
*                                                                @L1A*/ 25709900
*       4 SCSRD046  BIT(1),              /* RESERVED FOR JES USAGE      25749000
*                                                                @L1A*/ 25788100
*       4 SCSRD047  BIT(1),              /* RESERVED FOR JES USAGE      25827200
*                                                                @L1A*/ 25866300
*       4 SCSRD048  BIT(1),              /* RESERVED FOR JES USAGE      25905400
*                                                                @L1A*/ 25944500
*     3 SCSRTD07   BIT(8),               /* SEVENTH BYTE OF ROUTING     25983600
*                                           CODES                @L1A*/ 26022700
*       4 SCSRD049  BIT(1),              /* RESERVED FOR JES USAGE      26061800
*                                                                @L1A*/ 26100900
*       4 SCSRD050  BIT(1),              /* RESERVED FOR JES USAGE      26140000
*                                                                @L1A*/ 26179100
*       4 SCSRD051  BIT(1),              /* RESERVED FOR JES USAGE      26218200
*                                                                @L1A*/ 26257300
*       4 SCSRD052  BIT(1),              /* RESERVED FOR JES USAGE      26296400
*                                                                @L1A*/ 26335500
*       4 SCSRD053  BIT(1),              /* RESERVED FOR JES USAGE      26374600
*                                                                @L1A*/ 26413700
*       4 SCSRD054  BIT(1),              /* RESERVED FOR JES USAGE      26452800
*                                                                @L1A*/ 26491900
*       4 SCSRD055  BIT(1),              /* RESERVED FOR JES USAGE      26531000
*                                                                @L1A*/ 26570100
*       4 SCSRD056  BIT(1),              /* RESERVED FOR JES USAGE      26609200
*                                                                @L1A*/ 26648300
*     3 SCSRTD08   BIT(8),               /* EIGHTH BYTE OF ROUTING      26687400
*                                           CODES                @L1A*/ 26726500
*       4 SCSRD057  BIT(1),              /* RESERVED FOR JES USAGE      26765600
*                                                                @L1A*/ 26804700
*       4 SCSRD058  BIT(1),              /* RESERVED FOR JES USAGE      26843800
*                                                                @L1A*/ 26882900
*       4 SCSRD059  BIT(1),              /* RESERVED FOR JES USAGE      26922000
*                                                                @L1A*/ 26961100
*       4 SCSRD060  BIT(1),              /* RESERVED FOR JES USAGE      27000200
*                                                                @L1A*/ 27039300
*       4 SCSRD061  BIT(1),              /* RESERVED FOR JES USAGE      27078400
*                                                                @L1A*/ 27117500
*       4 SCSRD062  BIT(1),              /* RESERVED FOR JES USAGE      27156600
*                                                                @L1A*/ 27195700
*       4 SCSRD063  BIT(1),              /* RESERVED FOR JES USAGE      27234800
*                                                                @L1A*/ 27273900
*       4 SCSRD064  BIT(1),              /* RESERVED FOR JES USAGE      27313000
*                                                                @L1A*/ 27352100
*     3 SCSRTD09   BIT(8),               /* NINTH BYTE OF ROUTING       27391200
*                                           CODES                @L1A*/ 27430300
*       4 SCSRD065  BIT(1),              /* PROCESSOR RELATED MESSAGE   27469400
*                                                                @L1A*/ 27508500
*       4 SCSRD066  BIT(1),              /* PROCESSOR RELATED MESSAGE   27547600
*                                                                @L1A*/ 27586700
*       4 SCSRD067  BIT(1),              /* PROCESSOR RELATED MESSAGE   27625800
*                                                                @L1A*/ 27664900
*       4 SCSRD068  BIT(1),              /* PROCESSOR RELATED MESSAGE   27704000
*                                                                @L1A*/ 27743100
*       4 SCSRD069  BIT(1),              /* PROCESSOR RELATED MESSAGE   27782200
*                                                                @L1A*/ 27821300
*       4 SCSRD070  BIT(1),              /* PROCESSOR RELATED MESSAGE   27860400
*                                                                @L1A*/ 27899500
*       4 SCSRD071  BIT(1),              /* PROCESSOR RELATED MESSAGE   27938600
*                                                                @L1A*/ 27977700
*       4 SCSRD072  BIT(1),              /* PROCESSOR RELATED MESSAGE   28016800
*                                                                @L1A*/ 28055900
*     3 SCSRTD10   BIT(8),               /* TENTH BYTE OF ROUTING       28095000
*                                           CODES                @L1A*/ 28134100
*       4 SCSRD073  BIT(1),              /* PROCESSOR RELATED MESSAGE   28173200
*                                                                @L1A*/ 28212300
*       4 SCSRD074  BIT(1),              /* PROCESSOR RELATED MESSAGE   28251400
*                                                                @L1A*/ 28290500
*       4 SCSRD075  BIT(1),              /* PROCESSOR RELATED MESSAGE   28329600
*                                                                @L1A*/ 28368700
*       4 SCSRD076  BIT(1),              /* PROCESSOR RELATED MESSAGE   28407800
*                                                                @L1A*/ 28446900
*       4 SCSRD077  BIT(1),              /* PROCESSOR RELATED MESSAGE   28486000
*                                                                @L1A*/ 28525100
*       4 SCSRD078  BIT(1),              /* PROCESSOR RELATED MESSAGE   28564200
*                                                                @L1A*/ 28603300
*       4 SCSRD079  BIT(1),              /* PROCESSOR RELATED MESSAGE   28642400
*                                                                @L1A*/ 28681500
*       4 SCSRD080  BIT(1),              /* PROCESSOR RELATED MESSAGE   28720600
*                                                                @L1A*/ 28759700
*     3 SCSRTD11   BIT(8),               /* ELEVENTH BYTE OF ROUTING    28798800
*                                           CODES                @L1A*/ 28837900
*       4 SCSRD081  BIT(1),              /* PROCESSOR RELATED MESSAGE   28877000
*                                                                @L1A*/ 28916100
*       4 SCSRD082  BIT(1),              /* PROCESSOR RELATED MESSAGE   28955200
*                                                                @L1A*/ 28994300
*       4 SCSRD083  BIT(1),              /* PROCESSOR RELATED MESSAGE   29033400
*                                                                @L1A*/ 29072500
*       4 SCSRD084  BIT(1),              /* PROCESSOR RELATED MESSAGE   29111600
*                                                                @L1A*/ 29150700
*       4 SCSRD085  BIT(1),              /* PROCESSOR RELATED MESSAGE   29189800
*                                                                @L1A*/ 29228900
*       4 SCSRD086  BIT(1),              /* PROCESSOR RELATED MESSAGE   29268000
*                                                                @L1A*/ 29307100
*       4 SCSRD087  BIT(1),              /* PROCESSOR RELATED MESSAGE   29346200
*                                                                @L1A*/ 29385300
*       4 SCSRD088  BIT(1),              /* PROCESSOR RELATED MESSAGE   29424400
*                                                                @L1A*/ 29463500
*     3 SCSRTD12   BIT(8),               /* TWELFTH BYTE OF ROUTING     29502600
*                                           CODES                @L1A*/ 29541700
*       4 SCSRD089  BIT(1),              /* PROCESSOR RELATED MESSAGE   29580800
*                                                                @L1A*/ 29619900
*       4 SCSRD090  BIT(1),              /* PROCESSOR RELATED MESSAGE   29659000
*                                                                @L1A*/ 29698100
*       4 SCSRD091  BIT(1),              /* PROCESSOR RELATED MESSAGE   29737200
*                                                                @L1A*/ 29776300
*       4 SCSRD092  BIT(1),              /* PROCESSOR RELATED MESSAGE   29815400
*                                                                @L1A*/ 29854500
*       4 SCSRD093  BIT(1),              /* PROCESSOR RELATED MESSAGE   29893600
*                                                                @L1A*/ 29932700
*       4 SCSRD094  BIT(1),              /* PROCESSOR RELATED MESSAGE   29971800
*                                                                @L1A*/ 30010900
*       4 SCSRD095  BIT(1),              /* PROCESSOR RELATED MESSAGE   30050000
*                                                                @L1A*/ 30089100
*       4 SCSRD096  BIT(1),              /* PROCESSOR RELATED MESSAGE   30128200
*                                                                @L1A*/ 30167300
*     3 SCSRTD13   BIT(8),               /* THIRTEENTH BYTE OF ROUTING  30206400
*                                           CODES                @L1A*/ 30245500
*       4 SCSRD097  BIT(1),              /* DEVICE RELATED MESSAGE      30284600
*                                                                @L1A*/ 30323700
*       4 SCSRD098  BIT(1),              /* DEVICE RELATED MESSAGE      30362800
*                                                                @L1A*/ 30401900
*       4 SCSRD099  BIT(1),              /* DEVICE RELATED MESSAGE      30441000
*                                                                @L1A*/ 30480100
*       4 SCSRD100  BIT(1),              /* DEVICE RELATED MESSAGE      30519200
*                                                                @L1A*/ 30558300
*       4 SCSRD101  BIT(1),              /* DEVICE RELATED MESSAGE      30597400
*                                                                @L1A*/ 30636500
*       4 SCSRD102  BIT(1),              /* DEVICE RELATED MESSAGE      30675600
*                                                                @L1A*/ 30714700
*       4 SCSRD103  BIT(1),              /* DEVICE RELATED MESSAGE      30753800
*                                                                @L1A*/ 30792900
*       4 SCSRD104  BIT(1),              /* DEVICE RELATED MESSAGE      30832000
*                                                                @L1A*/ 30871100
*     3 SCSRTD14   BIT(8),               /* FOURTEENTH BYTE OF ROUTING  30910200
*                                           CODES                @L1A*/ 30949300
*       4 SCSRD105  BIT(1),              /* DEVICE RELATED MESSAGE      30988400
*                                                                @L1A*/ 31027500
*       4 SCSRD106  BIT(1),              /* DEVICE RELATED MESSAGE      31066600
*                                                                @L1A*/ 31105700
*       4 SCSRD107  BIT(1),              /* DEVICE RELATED MESSAGE      31144800
*                                                                @L1A*/ 31183900
*       4 SCSRD108  BIT(1),              /* DEVICE RELATED MESSAGE      31223000
*                                                                @L1A*/ 31262100
*       4 SCSRD109  BIT(1),              /* DEVICE RELATED MESSAGE      31301200
*                                                                @L1A*/ 31340300
*       4 SCSRD110  BIT(1),              /* DEVICE RELATED MESSAGE      31379400
*                                                                @L1A*/ 31418500
*       4 SCSRD111  BIT(1),              /* DEVICE RELATED MESSAGE      31457600
*                                                                @L1A*/ 31496700
*       4 SCSRD112  BIT(1),              /* DEVICE RELATED MESSAGE      31535800
*                                                                @L1A*/ 31574900
*     3 SCSRTD15   BIT(8),               /* FIFTEENTH BYTE OF ROUTING   31614000
*                                           CODES                @L1A*/ 31653100
*       4 SCSRD113  BIT(1),              /* DEVICE RELATED MESSAGE      31692200
*                                                                @L1A*/ 31731300
*       4 SCSRD114  BIT(1),              /* DEVICE RELATED MESSAGE      31770400
*                                                                @L1A*/ 31809500
*       4 SCSRD115  BIT(1),              /* DEVICE RELATED MESSAGE      31848600
*                                                                @L1A*/ 31887700
*       4 SCSRD116  BIT(1),              /* DEVICE RELATED MESSAGE      31926800
*                                                                @L1A*/ 31965900
*       4 SCSRD117  BIT(1),              /* DEVICE RELATED MESSAGE      32005000
*                                                                @L1A*/ 32044100
*       4 SCSRD118  BIT(1),              /* DEVICE RELATED MESSAGE      32083200
*                                                                @L1A*/ 32122300
*       4 SCSRD119  BIT(1),              /* DEVICE RELATED MESSAGE      32161400
*                                                                @L1A*/ 32200500
*       4 SCSRD120  BIT(1),              /* DEVICE RELATED MESSAGE      32239600
*                                                                @L1A*/ 32278700
*     3 SCSRTD16   BIT(8),               /* SIXTEENTH BYTE OF ROUTING   32317800
*                                           CODES                @L1A*/ 32356900
*       4 SCSRD121  BIT(1),              /* DEVICE RELATED MESSAGE      32396000
*                                                                @L1A*/ 32435100
*       4 SCSRD122  BIT(1),              /* DEVICE RELATED MESSAGE      32474200
*                                                                @L1A*/ 32513300
*       4 SCSRD123  BIT(1),              /* DEVICE RELATED MESSAGE      32552400
*                                                                @L1A*/ 32591500
*       4 SCSRD124  BIT(1),              /* DEVICE RELATED MESSAGE      32630600
*                                                                @L1A*/ 32669700
*       4 SCSRD125  BIT(1),              /* DEVICE RELATED MESSAGE      32708800
*                                                                @L1A*/ 32747900
*       4 SCSRD126  BIT(1),              /* DEVICE RELATED MESSAGE      32787000
*                                                                @L1A*/ 32826100
*       4 SCSRD127  BIT(1),              /* DEVICE RELATED MESSAGE      32865200
*                                                                @L1A*/ 32904300
*       4 SCSRD128  BIT(1);              /* DEVICE RELATED MESSAGE      32943400
*                                                                @L1A*/ 32982500
*/********************************************************************/ 33021600
*/* THE ACRONYM AND VERSION LEVEL TO BE PLACED IN THE SUBSYSTEM      */ 33060700
*/* CONSOLE SERVICE ROUTINE PARAMETER LIST                           */ 33099800
*/********************************************************************/ 33138900
*                                                                       33178000
*DCL SCSR     CHAR(4)  CONSTANT('SCSR'),/* ACRONYM                   */ 33217100
*    SCSSP211 FIXED(8) CONSTANT(1), /* LEVEL OS/VS2 JBB2110          */ 33256200
*    SCSSP220 FIXED(8) CONSTANT(2), /* LEVEL OS/VS2 JBB2220      @L1A*/ 33295300
*    SCSSP440 FIXED(8) CONSTANT(3), /* LEVEL MVS/SP510           @L5A*/ 33324600
*    SCSVERSN FIXED(8) CONSTANT(SCSSP440);/* CURRENT VERSION LEVEL      33353900
*                                                                @L5C*/ 33383200
*                                                                       33412600
* @EJECT ASM;                                                           33451700
*/********************************************************************/ 33490800
*/*          SUBSYSTEM CONSOLE SERVICE ROUTINE RETURN CODES          */ 33529900
*/*                    RETURNED IN REGISTER 15                       */ 33569000
*/********************************************************************/ 33608100
*DCL SCSROK   FIXED(31) CONSTANT(0),/* THE REQUESTED FUNCTIONS HAVE     33647200
*                                      BEEN PERFORMED                */ 33686300
*    SCSRNTFD FIXED(31) CONSTANT(4),/* A CONSOLE COULD NOT BE ASSIGNED  33725400
*                                      TO THE SYSTEM COMPONENT BECAUSE  33764500
*                                      AN AVAILABLE CONSOLE COULD NOT   33803600
*                                      BE FOUND                      */ 33842700
*    SCSRNAVL FIXED(31) CONSTANT(8),/* THE REQUESTED CONSOLE WAS NOT    33881800
*                                      AVAILABLE TO BE DEDICATED TO A   33920900
*                                      SYSTEM COMPONENT.             */ 33960000
*    SCSRNCMP FIXED(31) CONSTANT(12);/* ONE OR MORE REQUESTED FUNCTIONS 33999100
*                                      COULD NOT BE COMPLETED.          34049100
*                                      CHECK SCSCOMP1, SCSCOMP2,        34099100
*                                      AND SCSCOMP3 TO DETERMINE WHAT   34194600
*                                      FUNCTIONS HAVE BEEN COMPLETED    34233700
*                                      BY IEAVG700.                  */ 34289200
