*        %GOTO WPLL1;        /* BILINGUAL MAPPING                       00060001
         MACRO                                                          00100001
         IEZWPL &DSECT=YES   */                                         00150001
*%WPLL1 : ;                                                             00160001
*/***START OF SPECIFICATIONS******************************************/ 00204700
*/*                                                                  */ 00556000
*/* MACRO NAME: IEZWPL                                       @G860PSS*/ 00558400
*/*                                                                  */ 00560800
*/* DESCRIPTIVE NAME:  WTO/WTOR/MLWTO/WTP PARAMETER LIST         @L2C*/ 00563200
*/*   ACRONYM: WPL                                               @P9A*/ 00565600
*/*   EXTERNAL CLASSIFICATION: PSPI                              @PAA*/ 00566400
*/*   END OF EXTERNAL CLASSIFICATION:                            @PAA*/ 00567200
*/*                                                                  */ 00568000
*/* DSECT NAME: WPLRF (DSECT CARD PRECEDES PREFIX). 'WPL' SHOULD @P9C*/ 00570400
*/*             BE THE LABEL FOR A USING STATEMENT FOR THE       @P9A*/ 00572800
*/*             COMMON SECTION OF THE PARAMETER LIST.            @P9A*/ 00575200
*/*02*          WPLFLGS. IF A WPX IS NOT USED, THIS AREA WILL    @PCA*/ 00588300
*/*             FOLLOW THE MESSAGE TEXT.                         @PCA*/ 00601400
*/*                                                                  */ 00614500
*/*01* PROPRIETARY STATEMENT=                                        */ 00627600
*/***PROPRIETARY_STATEMENT********************************************/ 00677600
*/*                                                                  */ 00785800
*/*                                                                  */ 00794700
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00803600
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00812500
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1981, 1997                      */ 00825800
*/*                                                                  */ 00839200
*/* STATUS= HBB6603                                                  */ 00848100
*/*                                                                  */ 00857000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00865900
*/*                                                                  */ 00875200
*/* COMPONENT: COMMUNICATIONS TASK (SC1CK)                       @P9A*/ 00875600
*/*                                                              @P9A*/ 00876000
*/* EYE CATCHER: NONE                                            @P9A*/ 00876400
*/*     OFFSET: N/A                                              @P9A*/ 00876800
*/*     LENGTH: N/A                                              @P9A*/ 00877200
*/*                                                              @P9A*/ 00877600
*/* STORAGE ATTRIBUTES:                                          @P9A*/ 00878000
*/*     SUBPOOL: USER DEFINED SUBPOOL                            @P9A*/ 00878400
*/*     KEY: USER KEY                                            @P9A*/ 00878800
*/*     RESIDENCY: ABOVE OR BELOW THE 16M LINE                   @P9A*/ 00879200
*/*                                                              @P9A*/ 00879600
*/* SIZE: VARIABLE                                               @P9A*/ 00880000
*/*                                                              @P9A*/ 00880400
*/* CREATED BY: ISSUER OF WTO OR WTOR MACRO                      @P9A*/ 00880800
*/*                                                              @P9A*/ 00881200
*/* POINTED TO BY: REGISTER 1, WHEN WTO OR WTOR IS ISSUED        @P9A*/ 00881600
*/*                                                              @P9A*/ 00882000
*/* SERIALIZATION: NONE                                          @P9A*/ 00882400
*/*                                                              @P9A*/ 00882800
*/* FUNCTION: PROVIDES A MAPPING OF THE WTO/R MACRO PARAMETER    @P9A*/ 00883200
*/*           LIST.                                              @P9A*/ 00883600
*/*                                                              @P9A*/ 00884000
*/* METHOD OF ACCESS:                                            @P9C*/ 00884400
*/*      BAL  - CODE THE FOLLOWING:                              @L2C*/ 00885200
*/*           - IEZWPL                                           @L2A*/ 00890200
*/*               OR                                             @L2A*/ 00895200
*/*           - IEZWPL DSECT=NO    WILL NOT CREATE A DSECT       @L2A*/ 00900200
*/*                                                              @L2A*/ 00905200
*/*      PL/X - CODE THE FOLLOWING:                              @P9C*/ 00910200
*/*           - DCL WPLPTR PTR(31)                               @L2C*/ 00915200
*/*           - %INCLUDE SYSLIB(IEZWPL)                          @L2A*/ 00920200
*/*                                                              @L2A*/ 00925200
*/*           - VIA ATTRIBUTE - SPECIFY %WPLVIA = 'YES'          @L6A*/ 00925800
*/*                      PRIOR TO %INCLUDE STATEMENT.            @L6A*/ 00926400
*/*                      DECLARE WPLALET.                        @L6A*/ 00927000
*/*                      FOR VIA(0) SPECIFY %GLOBALARMODE='YES'  @L6A*/ 00927600
*/*                                                                  */ 00928200
*/* PL/X  LISTING - SPECIFY %IHALIST = 'NO' BEFORE %INCLUDE      @P9C*/ 00928600
*/*                 IF THE LISTING IS TO BE SUPPRESSED           @P4A*/ 00929000
*/*                                                                  */ 00929400
*/*                                                              @L2A*/ 00935200
*/* DELETED BY: USER                                             @P9A*/ 00935300
*/*                                                              @P9A*/ 00935400
*/* FREQUENCY: ONE PER INSTANCE OF STANDARD OR LIST FORM OF      @P9A*/ 00935500
*/*    WTO OR WTOR MACRO.                                        @P9A*/ 00935600
*/*                                                              @P9A*/ 00935700
*/* DEPENDENCIES:                                                @P9A*/ 00935800
*/*  - THE SIZE AND ORGANIZATION OF THE WPL DEPEND ON THE        @P9A*/ 00935900
*/*    PARAMETERS SPECIFIED ON THE WTO OR WTOR MACRO.            @P9A*/ 00936000
*/*  - A WPL EXTENSION (WPX) MAY ALSO BE GENERATED,              @P9A*/ 00936100
*/*    DEPENDING ON THE PARAMETERS SPECIFIED ON THE WTO OR WTOR. @P9A*/ 00936200
*/*  - FOR A WTOR MACRO, A WTOR PREFIX IS GENERATED AT THE       @P9A*/ 00936300
*/*    BEGINNING OF THE WPL IF A WPX IS NOT GENERATED.           @P9A*/ 00936400
*/*                                                              @P9A*/ 00936500
*/* NOTES:                                                       @P9A*/ 00936600
*/*    A WPL CAN BE OF VARIABLE LENGTH AND SEGMENTS.             @P9A*/ 00936700
*/*                                                              @P9A*/ 00936800
*/*    THE WPL FOR A WTO WILL ALWAYS BEGIN WITH 3 FIELDS         @P9A*/ 00936900
*/*    - 2 BYTE LENGTH FIELD. THIS VALUE CONTAINS THE            @P9A*/ 00937000
*/*      LENGTH OF DATA THROUGH THE LAST BYTE OF MESSAGE TEXT    @P9A*/ 00937100
*/*    - 2 BYTES OF MCS FLAGS                                    @P9A*/ 00937200
*/*    - VARIABLE LENGTH MESSAGE TEXT. IF THE TEXT PARAMETER     @P9A*/ 00937300
*/*      IS USED ON THE WTO/R MACRO, THEN THE LENGTH OF THIS     @P9A*/ 00937400
*/*      FIELD IS 4, AND THE VALUE IS THE ADDRESS OF THE         @P9A*/ 00937500
*/*      MESSAGE TEXT. (THE VALUE OF THE MESSAGE TEXT FIELD      @P9A*/ 00937600
*/*      IS A 2 BYTE FIELD CONTAINING THE LENGTH OF THE TEXT,    @P9A*/ 00937700
*/*      FOLLOWED BY THE TEXT ITSELF)                            @P9A*/ 00937800
*/*    - THE DATA FOLLOWING THIS PORTION OF THE WPL VARIES,      @P9A*/ 00937900
*/*      DEPENDING ON THE MACRO PARAMETERS.                      @P9A*/ 00938000
*/*      - IF ANY PARAMETER IS INCLUDED WHICH WAS INTRODUCED     @P9A*/ 00938100
*/*        ON THE WTO OR WTOR MACRO FROM SP 2.2.0 AND ON, THEN   @P9A*/ 00938200
*/*        A WPX WILL BE GENERATED. THE PARAMETERS WHICH COULD   @P9A*/ 00938300
*/*        BE SPECIFIED WHICH WOULD NOT GENERATE A WPX ARE:      @P9A*/ 00938400
*/*        - DESCRIPTOR CODE(S)                                  @P9A*/ 00938500
*/*        - ROUTING CODES 1 THROUGH 16                          @P9A*/ 00938600
*/*        - MESSAGE TYPE INFORMATION                            @P9A*/ 00938700
*/*        - INLINE MESSAGE TEXT                                 @P9A*/ 00938800
*/*      - IF A WPX IS NOT GENERATED, THE FIELDS INCLUDED AFTER  @P9A*/ 00938900
*/*        THE MESSAGE TEXT ARE                                  @P9A*/ 00939000
*/*        - 2 BYTES OF DESCRIPTOR CODES                         @P9A*/ 00939100
*/*        - 2 BYTES OF ROUTING CODES (1-16 ONLY)                @P9A*/ 00939200
*/*        - 2 BYTES OF MESSAGE TYPE INFORMATION                 @P9A*/ 00939300
*/*        BOTH THE DESCRIPTOR CODE AND 2 BYTE ROUTING CODE      @P9A*/ 00939400
*/*        FIELDS WILL BE GENERATED IF EITHER DESCRIPTOR CODE    @P9A*/ 00939500
*/*        OR ROUTING CODE (1-16) VALUES ARE SPECIFIED). THE     @P9A*/ 00939600
*/*        MESSAGE TYPE INFORMATION WILL ONLY BE SPECIFIED IF    @P9A*/ 00939700
*/*        THE MSGTYP PARAMETER IS SPECIFIED ON THE WTO/R        @P9A*/ 00939800
*/*        MACRO. WHEN SPECIFIED, YOU GET ALL 3 FIELDS,          @P9A*/ 00939900
*/*        REGARDLESS OF WHETHER ROUTING CODES OR DESCRIPTOR     @P9A*/ 00940000
*/*        CODES WERE SPECIFIED (IN OTHER WORDS, YOU WILL        @P9A*/ 00940100
*/*        GET EITHER 0 BYTES, 4 BYTES OR 6 BYTES OF DATA).      @P9A*/ 00940200
*/*                                                              @P9A*/ 00940300
*/*        OTHERWISE, YOU GET A WPX WHICH WOULD CONTAIN FIELDS   @P9A*/ 00940400
*/*        FOR DESCRIPTOR AND ROUTING CODES AND MESSAGE TYPE.    @P9A*/ 00940500
*/*                                                              @P9A*/ 00940600
*/*      - IF THE MESSAGE IS A MULTILINE, THE FOLLOWING          @P9A*/ 00940700
*/*        INFORMATION IS INCLUDED AFTER THE ABOVE (WPX OR       @P9A*/ 00940800
*/*        ROUTING/DESCRIPTOR/MESSAGE TYPE FIELDS)               @P9A*/ 00940900
*/*        - 2 BYTES LINE TYPE FIELDS                            @P9A*/ 00941000
*/*        - 1 BYTE OUT OF LINE AREA ID VALUE                    @P9A*/ 00941100
*/*        - 1 BYTE FIELD CONTAINING TOTAL NUMBER OF LINES       @P9A*/ 00941200
*/*      - FOR EACH SUBSEQUENT LINE (MINOR LINE), THE FOLLOWING  @P9A*/ 00941300
*/*        IS CONTAINED                                          @P9A*/ 00941400
*/*        - 2 BYTES MESSAGE LENGTH                              @P9A*/ 00941500
*/*        - 2 BYTES LINE TYPE FLAGS                             @P9A*/ 00941600
*/*        - VARIABLE LENGTH MESSAGE TEXT, OR, IF THE TEXT       @P9A*/ 00941700
*/*          PARAMETER IS USED, A 4 BYTE POINTER TO THE ACTUAL   @P9A*/ 00941800
*/*          MESSAGE TEXT.                                       @P9A*/ 00941900
*/*      - THE WPX COULD BE ONE OF SEVERAL FORMATS, DEPENDING    @P9A*/ 00942000
*/*        ON THE PARAMETERS USED ON THE WTOR/R MACRO. EACH      @P9A*/ 00942100
*/*        VERSION OF THE WPX IS RELATED TO A LEVEL OF MVS.      @P9A*/ 00942200
*/*        THIS IS DETAILED BELOW. FIELD WPXVRSN IN THE          @P9A*/ 00942300
*/*        WPX INDICATES THE VERSION OF THE WPX BEING USED.      @P9A*/ 00942400
*/*                                                              @P9A*/ 00942500
*/*    - THE WPL FOR A WTOR CONTAINS AN 8 BYTE PREFIX, UNLESS    @P9A*/ 00942600
*/*      A WPX IS GENERATED. IN THAT CASE THE EQUIVALENT         @P9A*/ 00942700
*/*      INFORMATION IS CONTAINED IN THE WPX. THE LAYOUT OF THE  @P9A*/ 00942800
*/*      PREFIX IS DEPENDANT ON THE ISSUER'S AMODE. THE PREFIX,  @P9A*/ 00942900
*/*      AND DATA PRECEDING THE MESSAGE TEXT WILL APPEAR AS ONE  @P9A*/ 00943000
*/*      OF THE FOLLOWING, DEPENDING ON THE ISSUER'S AMODE.      @P9A*/ 00943100
*/*      - 4 BYTES REPLY ADDRESS                                 @P9A*/ 00943200
*/*      - 4 BYTE ECB ADDRESS                                    @P9A*/ 00943300
*/*      - 1 BYTE REPLY LENGTH VALUE                             @P9A*/ 00943400
*/*      - 1 BYTE MESSAGE LENGTH FIELD                           @P9A*/ 00943500
*/*      - 2 BYTES OF MCS FLAGS                                  @P9A*/ 00943600
*/*                                                              @P9A*/ 00943700
*/* DIAGRAMS OF MUCH OF THE ABOVE INFORMATION                    @P9A*/ 00943800
*/*                                                              @P9A*/ 00943900
*/*      SINGLE LINE WTO PARAMETER LIST WITH NO WPX              @P9A*/ 00944000
*/*      ------------------------------------------              @P9A*/ 00944100
*/*    0 | 2 BYTE LENGTH      |  2 BYTES MCS FLAGS|              @P9A*/ 00944200
*/*      ------------------------------------------              @P9A*/ 00944300
*/*    4 | MESSAGE TEXT, VARIABLE LENGTH.         |              @P9A*/ 00944400
*/*      ------------------------------------------              @P9A*/ 00944500
*/*      | DESCRIPTOR CODES, FIRST 16 ROUTING     |              @P9A*/ 00944600
*/*      | CODES (ROUTING CODES HIGHER THAN 16    |              @P9A*/ 00944700
*/*      | WILL CAUSE A WPX TO BE GENERATED) AND  |              @P9A*/ 00944800
*/*      | MESSAGE TYPE FLAGS, IF THE APPROPRIATE |              @P9A*/ 00944900
*/*      | PARAMETERS WERE SPECIFIED ON WTO/R.    |              @P9A*/ 00945000
*/*      ------------------------------------------              @P9A*/ 00945100
*/*                                                              @P9A*/ 00945200
*/*      SINGLE LINE WTO PARAMETER LIST WITH WPX                 @P9A*/ 00945300
*/*      ------------------------------------------              @P9A*/ 00945400
*/*    0 | 2 BYTE LENGTH      |  2 BYTES MCS FLAGS|              @P9A*/ 00945500
*/*      ------------------------------------------              @P9A*/ 00945600
*/*    4 | MESSAGE TEXT, VARIABLE LENGTH.         |              @P9A*/ 00945700
*/*      ------------------------------------------              @P9A*/ 00945800
*/*      | WPX                                    |              @P9A*/ 00945900
*/*      |                                        |              @P9A*/ 00946000
*/*      ------------------------------------------              @P9A*/ 00946100
*/*                                                              @P9A*/ 00946200
*/*      SINGLE LINE WTO PARAMETER LIST WITH TEXT PARAMETER      @P9A*/ 00946300
*/*      ------------------------------------------              @P9A*/ 00946400
*/*    0 | 2 BYTE LENGTH      |  2 BYTES MCS FLAGS|              @P9A*/ 00946500
*/*      ------------------------------------------              @P9A*/ 00946600
*/*    4 | 4 BYTE MESSAGE TEXT POINTER            |              @P9A*/ 00946700
*/*      ------------------------------------------              @P9A*/ 00946800
*/*    8 | WPX                                    |              @P9A*/ 00946900
*/*      |                                        |              @P9A*/ 00947000
*/*      ------------------------------------------              @P9A*/ 00947100
*/*                                                              @P9A*/ 00947200
*/*      MULTILINE WTO EXTENSION                                 @P9A*/ 00947300
*/*      ------------------------------------------              @P9A*/ 00947400
*/*    0 | AREA ID | # LINES  | LENGTH | LINE TYPE|              @P9A*/ 00947500
*/*      ------------------------------------------              @P9A*/ 00947600
*/*    4 | 4 BYTE TEXT ADDRESS OR VARIABLE LENGTH |              @P9A*/ 00947700
*/*      | MESSAGE TEXT (FORMAT WILL BE CONSISTENT|              @P9A*/ 00947800
*/*      | FOR EACH LINE OF THE MULTILINE).       |              @P9A*/ 00947900
*/*      ------------------------------------------              @P9A*/ 00948000
*/*      | REPEATED FOR EACH SUCCESSIVE LINE      |              @P9A*/ 00948100
*/*      ------------------------------------------              @P9A*/ 00948200
*/*                                                              @P9A*/ 00948300
*/*      WTOR PREFIX                                             @P9A*/ 00948400
*/*      ------------------------------------------              @P9A*/ 00948500
*/*    0 | -> REPLY BUFFER    | LENGTH | ECB ADDR.|              @P9A*/ 00948600
*/*      ------------------------------------------              @P9A*/ 00948700
*/*                                                              @P9A*/ 00948800
*/*                                                              @P9A*/ 00948900
*/*                                                              @P9A*/ 00949000
*/*   --------------------------------------------               @P9A*/ 00949100
*/*   | PARAMETER| POST-TEXT| GENERATE | WPX     |               @P9A*/ 00949200
*/*   |          | FIELD?   | A WPX?   | VERSION |               @P9A*/ 00949300
*/*   --------------------------------------------               @P9A*/ 00949400
*/*   | INLINE   | N/A      | NO       | N/A     |               @P9A*/ 00949500
*/*   | TEXT     |          |          |         |               @P9A*/ 00949600
*/*   --------------------------------------------               @P9A*/ 00949700
*/*   | TEXT     | NO       | YES      |         |               @P9A*/ 00949800
*/*   --------------------------------------------               @P9A*/ 00949900
*/*   | MF       | NO       | NO       | N/A     |               @P9A*/ 00950000
*/*   --------------------------------------------               @P9A*/ 00950100
*/*   | ROUTCDE  | YES      | NO       | N/A     |               @P9A*/ 00950200
*/*   | 1-16     |          |          |         |               @P9A*/ 00950300
*/*   --------------------------------------------               @P9A*/ 00950400
*/*   | ROUTCDE  | NO       | YES      | 1       |               @P9A*/ 00950500
*/*   | 17-128   |          |          |         |               @P9A*/ 00950600
*/*   --------------------------------------------               @P9A*/ 00950700
*/*   | DESC     | YES      | NO       | N/A     |               @P9A*/ 00950800
*/*   --------------------------------------------               @P9A*/ 00950900
*/*   | MSGTYP   | YES      | NO       | N/A     |               @P9A*/ 00951000
*/*   --------------------------------------------               @P9A*/ 00951100
*/*   | MCSFLAG  | NO       | NO       | NO      |               @P9A*/ 00951200
*/*   --------------------------------------------               @P9A*/ 00951300
*/*   | AREAID   | NO       | NO       | N/A     |               @P9A*/ 00951400
*/*   --------------------------------------------               @P9A*/ 00951500
*/*   | SUBSMOD  | NO       | YES      | 1       |               @P9A*/ 00951600
*/*   --------------------------------------------               @P9A*/ 00951700
*/*   | CONNECT  | NO       | YES      | 1       |               @P9A*/ 00951800
*/*   --------------------------------------------               @P9A*/ 00951900
*/*   | CONSID   | NO       | YES      | 1       |               @P9A*/ 00952000
*/*   --------------------------------------------               @P9A*/ 00952100
*/*   | JOBID    | NO       | YES      | 1       |               @P9A*/ 00952200
*/*   --------------------------------------------               @P9A*/ 00952300
*/*   | JOBNAME  | NO       | YES      | 1       |               @P9A*/ 00952400
*/*   --------------------------------------------               @P9A*/ 00952500
*/*   | KEY      | NO       | YES      | 1       |               @P9A*/ 00952600
*/*   --------------------------------------------               @P9A*/ 00952700
*/*   | TOKEN    | NO       | YES      | 1       |               @P9A*/ 00952800
*/*   --------------------------------------------               @P9A*/ 00952900
*/*   | PRTY     | NO       | YES      | 1       |               @P9A*/ 00953000
*/*   --------------------------------------------               @P9A*/ 00953100
*/*   | SYSNAME  | NO       | YES      | 1       |               @P9A*/ 00953200
*/*   --------------------------------------------               @P9A*/ 00953300
*/*   | WQEBLK   | NO       | NO       | N/A     |               @P9A*/ 00953400
*/*   --------------------------------------------               @P9A*/ 00953500
*/*   | CONSNAME | NO       | YES      | 2       |               @P9A*/ 00953600
*/*   --------------------------------------------               @P9A*/ 00953700
*/*   | CART     | NO       | YES      | 2       |               @P9A*/ 00953800
*/*   --------------------------------------------               @P9A*/ 00953900
*/*   | LINKAGE  | N/A      | N/A      | N/A     |               @P9A*/ 00954000
*/*   --------------------------------------------               @P9A*/ 00954100
*/*   | SYNCH    | NO       | YES      | 2       |               @P9A*/ 00954200
*/*   --------------------------------------------               @P9A*/ 00954300
*/*   | WSPARM   | NO       | YES      | 2       |               @P9A*/ 00954400
*/*   --------------------------------------------               @PBA*/ 00954500
*/*   | ASCB     | NO       | YES      | 4       |               @PBA*/ 00954600
*/*   --------------------------------------------               @PBA*/ 00954700
*/* Note - When the ASCB parameter was added, 16 bytes of        @PDA*/ 00956200
*/*        reserved space was added to the WPX.  If the size     @PDA*/ 00957700
*/*        of the WPX is expanded further, it will require       @PDA*/ 00959200
*/*        users who code their own WTO parm lists instead of    @PDA*/ 00960700
*/*        using the list form of WTO to make changes to their   @PDA*/ 00962200
*/*        code.                                                 @PDA*/ 00963700
*/*                                                              @P9A*/ 00965200
*/*                                                              @P9A*/ 00966700
*/* DISTRIBUTION LIBRARY: AMODGEN                                @P9A*/ 00968200
*/*                                                              @L2A*/ 00970200
*/* CHANGE ACTIVITY = G64DP9A, G860PSS                       @G860PSS*/ 00975600
*/* $L1=MRRHCLOG, JBB2125, 830608, PDF8: HARDCOPY LOG FORMAT         */ 00981300
*/* $L2=COEXWTO2, JBB2220, 840131, PDFE: JES3/MCS COEXISTENCE        */ 00984100
*/* $P1=PA20389,  JBB2220, 850731, PD2L: JES3/MCS COEXISTENCE        */ 00985500
*/* $P2=PA20509,  JBB2220, 850831, PD2L: JES3/MCS COEXISTENCE        */ 00986200
*/* $L3=CNMG2WTO, HBB4410, 870419, PDR3: CONSOLE MERGE STAGE II      */ 00986600
*/* $L4=TSOOP,    HBB4410, 870622, PDBU: TSO OPERATOR                */ 00986800
*/* $L5=KNWTO,    HBB4410, 870622, PDCM: KANJI/WTO                   */ 00986900
*/* $P3=PEO1463,  HBB4410, 890206, PDF9: KANJI/WTO                   */ 00990700
*/* $L6=CNITGDHE, HBB4410, 890313, PDHE: CONSOLE INTEGRATION         */ 00991300
*/* $L7=CNITGECR, HBB4410, 890508, PDCR: CNITG  UD MSG PROCESSING    */ 00991900
*/* $P4=PH25041,  HBB4410, 890612, PDHE: LISTING CONTROL DEFAULT     */ 00992500
*/* $D1=DCR184,   HBB4410, 890612, PDHE: CONTROL PROGRAM BITS        */ 00993100
*/* $D2=DCR124,   HBB4410, 890918, PDHE: DCR 124                     */ 00993700
*/* $P5=PEO3576,  HBB4410, 890226, PDHG: COMMENT CORRECTIONS         */ 00994100
*/* $P6=PEO3650,  HBB4410, 900330, PDBT: COMMENT UPDATES             */ 00994300
*/* $P7=PEO3923,  HBB4410, 900330, PDHE: CPFLG(ACLW) SUPPORT         */ 00994400
*/* $D3=DEO0358,  HBB4410, 900626, PDEC: DBCS REMOVAL                */ 00995700
*/* $L8=NETSY6HL, JBB4422, 901112, PDHL: NETVIEW AUTOMATION          */ 00996300
*/* $P8=PKB1085,  HBB4430, 920318, PDHE: VERSION COMMENT INCORRECT   */ 00996600
*/* $P9=PKB3097,  HBB4410, 920715, PDCM: WPL DOCUMENTATION           */ 00996800
*/* $PA=PIG2222,  HBB5510, 930909, PDED: ADD LEN OF MLWTO EXTENTION  */ 00996900
*/* $01=OW07896,  HBB5510, 941031, PDSH: AVOID OUT OF STORAGE ABENDS */ 00997400
*/* $02=OW18874,  HBB5510, 960315, PDHD: Add QNLY bit                */ 00997600
*/* $PB=PQC1061,  HBB6603, 960831, PDCI: Add ASCB                    */ 00997700
*/* $PC=PQC2126,  HBB6603, 960822, PDZH: Clarify DSECT description in*/ 00997800
*/*                                      prolog                      */ 00997900
*/* $PD=PQC2456,  HBB6603, 960916, PDCI: Change length of reserved   */ 00998000
*/*                                      space in HBB6603 parmlist   */ 00998100
*/**END OF SPECIFICATIONS*********************************************/ 00998400
*%GOTO WPLL2;  /*                                                       01010001
         SPACE                                                          01050001
         IEZBITS  ,           SYMBOLIC BIT DEFINITIONS             @L2C 01100000
         EJECT                                                          01150000
*********************************************************************** 01200001
*                                                                     * 01300001
*        WTOR PREFIX (24-BIT PARAMETER LIST)                   @G860PSS 01350000
*                                                                     * 01400001
*********************************************************************** 01450001
         SPACE                                                          01450401
         AIF   ('&DSECT' EQ 'NO').WPL0000                               01452001
WPLRF    DSECT ,              START OF WTOR PREFIX (24-BIT PARM LIST)  X01453300
                                                                   @L2C 01454600
         AGO   .WPL0020                                                 01456001
.WPL0000 ANOP                                                           01458001
         DS    0D                                                       01460001
WPLRF    EQU   *              START OF WTOR PREFIX (24-BIT PARM LIST)  X01461300
                                                                   @L2C 01462600
.WPL0020 ANOP                                                           01464001
         SPACE                                                          01500001
WPLRPTR  DS    0A             POINTER TO REPLY BUFFER              @L2C 01550000
WPLRLN   DS    FL1            MAXIMUM LENGTH OF REPLY              @L2C 01600000
WPLRPTRA DS    AL3            ADDRESS OF REPLY BUFFER              @L2C 01650000
WPLRECB  DS    A              ADDRESS OF REPLY ECB                 @L2C 01700000
         SPACE                                                          01750001
*********************************************************************** 01800001
*                                                              @G860PSS 01803500
*        WTOR PREFIX (31-BIT PARAMETER LIST)                   @G860PSS 01807000
*                                                              @G860PSS 01810500
*********************************************************************** 01814000
         SPACE                                                          01817500
         ORG   WPLRF                                                    01821000
WPL31RF  EQU   *              START OF WTOR PREFIX (31-BIT PARM LIST)  X01824500
                                                               @G860PSS 01828000
WPL31RRP DS    A              ADDRESS OF REPLY BUFFER          @G860PSS 01831500
WPL31RFG EQU   X'80'          INDICATES A WTOR                 @G860PSS 01835000
WPL31REP DS    A              ADDRESS OF REPLY ECB             @G860PSS 01838500
         EJECT                                                          01842000
*********************************************************************** 01845500
*                                                                     * 01850001
*                        COMMON SECTION                               * 01900001
*        IF THE TEXT PARAMETER IS SPECIFIED INSTEAD OF INLINE     @P9A* 01912500
*        MESSAGE TEXT, THE VALUE OF WPLLPTXT WILL ONLY REFLECT    @P9A* 01925000
*        THE 4 BYTE LENGTH OF THE POINTER.                        @P9A* 01937500
*                                                                     * 01950001
*********************************************************************** 02000001
         SPACE                                                          02002001
         ORG   WPLRF                                                    02010001
         SPACE                                                          02050001
WPL      EQU   *              START OF COMMON SECTION              @L2C 02060000
WPLLGH   DS    0H             FOR A 24-BIT WTOR PARMLIST, THIS IS THE  X02075800
                              MESSAGE LENGTH (COMBINED LENGTH OF MSG   X02091600
                              TEXT, MSG LENGTH FIELD AND MCS FLAGS     X02107400
                              FIELD)                           @G860PSS 02123200
WPL31RLN DS    FL1            IF WPL IS FOR A 31-BIT WTOR PARMLIST,    X02139000
                              THIS IS THE LENGTH OF THE REPLY BUFFER.  X02154800
                              OTHERWISE, THIS FIELD MUST BE ZERO       X02170600
                                                               @G860PSS 02186400
WPLLPTXT DS    FL1            MESSAGE LENGTH (COMBINED LENGTH OF MSG   X02202200
                              TEXT, MSG LENGTH FIELD AND MCS FLAGS     X02218000
                              FIELD                            @G860PSS 02233800
*******************************************************************@L2A 02242200
*        MCS FLAGS                                                 @L2A 02250600
*  CHANGES TO THE MCS FLAGS WILL ALSO IMPACT THE                   @L6A 02253400
*  MCS FLAGS IN IHAWQE AND IHACTM                                  @L6A 02256200
*******************************************************************@L2A 02259000
WPLMCSF  DS    0BL2           MCS FLAGS                            @L2C 02267500
WPLMCSF1 DS    B              FIRST BYTE OF MCS FLAGS              @L2C 02301200
WPLMCSFA EQU   BIT0           ROUTE/DESCRIPTOR CODE FIELDS PRESENT @L2C 02334900
WPLMCSFB EQU   BIT1           QUEUE TO CONSOLE IF ACTIVE (ID IN REG 0) X02368600
                                                                   @L2C 02402300
WPLMCSFC EQU   BIT2           COMMAND RESPONSE                     @L2C 02436000
WPLMCSFD EQU   BIT3           MESSAGE TYPE FIELD EXISTS            @L2C 02469700
WPLMCSFE EQU   BIT4           THIS WPL IS A REPLY TO A WTOR        @L2C 02503400
WPLMCSFF EQU   BIT5           BROADCAST THIS MSG TO ALL ACTIVE         X02537100
                              CONSOLES                             @L2C 02570800
WPLMCSFG EQU   BIT6           QUEUE TO HARD COPY ONLY              @L2C 02604500
WPLMCSFH EQU   BIT7           QUEUE TO CONSOLE (ID IN REG 0)       @P5C 02654500
WPLMCSF2 DS    B              SECOND BYTE OF MCS FLAGS             @L2C 02705600
WPLMCSFI EQU   BIT0           DO NOT TIME STAMP THIS MESSAGE       @L2C 02739300
WPLMCSFJ EQU   BIT1           MLWTO INDICATOR                      @L2C 02773000
WPLMCSFK EQU   BIT2           PRIMARY SUBSYSTEM USE ONLY               X02786400
                              JES3: DO NOT LOG MINOR WQE'S IF THE      X02799800
                                    MAJOR IS NOT HARDCOPIED.           X02813200
                              JES2: NOT USED                       @L2C 02826600
WPLMCSFL EQU   BIT3           EXTENDED WPL FORMAT (WPX) EXISTS     @L2C 02840400
WPLMCSFM EQU   BIT4           THE MESSAGE IS AN OPERATOR COMMAND   @L2C 02874100
WPLMCSFN EQU   BIT5           BYPASS QUEUING MESSAGE TO HARD COPY  @L2C 02907800
WPLMCSFO EQU   BIT6           WQEBLK KEYWORD SPECIFIED             @L2C 02941500
WPLRSV01 EQU   BIT7           RESERVED                             @P9C 02975200
         SPACE                                                          03010001
*******************************************************************@L2A 03013000
*        MESSAGE TEXT                                              @L2A 03016000
*******************************************************************@L2A 03019000
WPLTXT   DS    0CL126         MESSAGE TEXT (MAXIMUM 126 CHARACTERS)    X03022000
                                                                   @L2C 03034000
WPLADTXT DS    0CL4           MESSAGE TEXT ADDRESS (IF TEXT            X03036400
                              KEYWORD IS SPECIFIED, THIS FIELD         X03038800
                              WILL BE GENERATED, EVEN IF THE           X03041200
                              LINE TYPE IS '10'X)                  @P6C 03043600
         DS    CL125          MESSAGE TEXT                         @L2C 03046000
WPLTXTL  DS    C              LAST BYTE OF MESSAGE TEXT            @L2C 03058000
         EJECT                                                          03112400
*********************************************************************** 03115000
*                                                                     * 03133700
*        THE FOLLOWING FIELDS BEGIN IMMEDIATELY FOLLOWING THE LAST    * 03152400
*        BYTE OF MESSAGE TEXT IF NO WPX WAS CREATED.  IF A WPX    @L2C* 03171100
*        WAS CREATED, WPLFLGS IS NOT USED.                        @L2A* 03189800
*                                                                 @L2A* 03208500
*********************************************************************** 03227500
         SPACE                                                          03250001
         ORG   WPLRF                                                    03252001
         SPACE                                                          03254001
WPLFLGS  EQU   *              START OF WPL FLAGS FIELDS            @L2C 03270500
*******************************************************************@L2A 03274600
*        DESCRIPTOR CODES                                          @L2A 03278700
*******************************************************************@L2A 03282800
WPLDESC  DS    0BL2           DESCRIPTOR CODES                     @L2C 03287000
WPLDESC1 DS    B              FIRST BYTE OF DESCRIPTOR CODES       @L2C 03303500
WPLDESCA EQU   BIT0           SYSTEM FAILURE MESSAGE               @L2C 03320000
WPLDESCB EQU   BIT1           IMMEDIATE ACTION REQUIRED MESSAGE    @L2C 03336500
WPLDESCC EQU   BIT2           IMPORTANT INFORMATION MESSAGE        @P5C 03353000
WPLDESCD EQU   BIT3           SYSTEM STATUS MESSAGE                @L2C 03369500
WPLDESCE EQU   BIT4           IMMEDIATE COMMAND RESPONSE MESSAGE   @L2C 03386000
WPLDESCF EQU   BIT5           JOB STATUS MESSAGE                   @L2C 03402500
WPLDESCG EQU   BIT6           APPLICATION PROGRAM/PROCESSOR MESSAGE    X03419000
                              OR DELETE AT TASK TERMINATION        @L2C 03435500
WPLDESCH EQU   BIT7           OUT-OF-LINE MESSAGE                  @L2C 03452000
WPLDESC2 DS    B              SECOND BYTE OF DESCRIPTOR CODES      @L2C 03468500
WPLDESCI EQU   BIT0           OPERATOR'S REQUEST                   @L2C 03493200
WPLDESCJ EQU   BIT1           TRACK COMMAND RESPONSE               @L2C 03517900
WPLDESCK EQU   BIT2           CRITICAL EVENTUAL ACTION REQUIRED    @L2C 03542600
WPLDESCL EQU   BIT3           IMPORTANT INFORMATION MESSAGE        @L7C 03567500
WPLDESCM EQU   BIT4           PREVIOUSLY AUTOMATED                 @L8C 03584000
WPLRSV10 EQU   BIT5,,C'X'     RESERVED                             @L2C 03600500
WPLRSV11 EQU   BIT6,,C'X'     RESERVED                             @L2C 03617000
WPLRSV12 EQU   BIT7,,C'X'     RESERVED                             @L2C 03633500
         SPACE                                                          03650001
*******************************************************************@L2A 03652500
*        ROUTING CODES                                             @L2A 03655000
*******************************************************************@L2A 03657500
WPLROUT  DS    0BL2           ROUTING CODES                            X03660000
                              THESE CODES INDICATE THE FUNCTIONAL      X03662000
                              AREA OR AREAS TO WHICH A MESSAGE IS TO   X03664000
                              BE SENT.                             @L2C 03666000
WPLROUT1 DS    B              1ST BYTE OF ROUTING CODES            @L2C 03670000
WPLROUTA EQU   BIT0           MASTER CONSOLE                       @L2C 03680000
WPLROUTB EQU   BIT1           MASTER CONSOLE INFORMATIONAL         @L2C 03690000
WPLROUTC EQU   BIT2           TAPE POOL                            @L2C 03692000
WPLROUTD EQU   BIT3           DIRECT ACCESS POOL                   @L2C 03694000
WPLROUTE EQU   BIT4           TAPE LIBRARY                         @L2C 03696000
WPLROUTF EQU   BIT5           DISK LIBRARY                         @L2C 03698000
WPLROUTG EQU   BIT6           UNIT RECORD POOL                     @L2C 03698400
WPLROUTH EQU   BIT7           TELEPROCESSING CONTROL               @L2C 03698800
WPLROUT2 DS    B              2ND BYTE OF ROUTING CODES            @L2C 03699200
WPLROUTI EQU   BIT0           SYSTEM SECURITY                      @L2C 03699600
WPLROUTJ EQU   BIT1           SYSTEM/ERROR MAINTENANCE             @L2C 03699700
WPLROUTK EQU   BIT2           PROGRAMMER INFORMATION               @L2C 03699800
WPLROUTL EQU   BIT3           EMULATOR INFORMATION                 @L2C 03699900
WPLROUTM EQU   BIT4           USER ROUTING CODE                    @L2C 03716600
WPLROUTN EQU   BIT5           USER ROUTING CODE                    @L2C 03726600
WPLROUTO EQU   BIT6           USER ROUTING CODE                    @L2C 03728600
WPLROUTP EQU   BIT7           USER ROUTING CODE                    @L2C 03729000
         SPACE                                                          03730601
*******************************************************************@L2A 03731200
*        MESSAGE TYPE FLAGS                                        @L2A 03731800
*******************************************************************@L2A 03732400
WPLMSGTY DS    0BL2           MESSAGE TYPE FLAGS                   @L2C 03733300
WPLMSGT1 DS    B              FIRST BYTE OF MESSAGE TYPE FLAGS     @L2C 03743300
WPLMSGTA EQU   BIT0           MONITOR JOBNAMES                     @L2C 03745300
WPLMSGTB EQU   BIT1           MONITOR STATUS                       @L2C 03747300
WPLMSGTC EQU   BIT2           RESERVED                             @L2C 03749300
WPLMSGTD EQU   BIT3           INDICATES EXISTENCE OF QID FIELD IN      X03749400
                              WPL                                  @L2C 03757800
WPLRSV14 EQU   BIT4,,C'X'     RESERVED                             @L2C 03766400
WPLMSGTF EQU   BIT5           MONITOR SESS                         @L2C 03774800
WPLRSV15 EQU   BIT6,,C'X'     RESERVED                             @L2C 03776800
WPLRSV16 EQU   BIT7,,C'X'     RESERVED                             @L2C 03778800
WPLMSGT2 DS    B              SECOND BYTE OF MESSAGE TYPE FLAGS    @L2C 03783200
WPLRSV25 EQU   BIT0,,C'X'     RESERVED                             @L2C 03783600
WPLRSV26 EQU   BIT1,,C'X'     RESERVED                             @L2C 03784000
WPLRSV27 EQU   BIT2,,C'X'     RESERVED                             @L2C 03784400
WPLRSV28 EQU   BIT3,,C'X'     RESERVED                             @L2C 03784800
WPLRSV29 EQU   BIT4,,C'X'     RESERVED                             @L2C 03784900
WPLRSV30 EQU   BIT5,,C'X'     RESERVED                             @L2C 03785000
WPLRSV31 EQU   BIT6,,C'X'     RESERVED                             @L2C 03785100
WPLRSV32 EQU   BIT7,,C'X'     RESERVED                             @L2C 03786700
WPLQID   DS    H              RESERVED                             @L2C 03789100
         SPACE 1                                                        03791600
*********************************************************************** 03800001
*                                                                     * 03850001
*                        MLWTO EXTENSION                              * 03900001
*                                                                     * 03950001
*        THE FOLLOWING FIELDS ARE ALWAYS PRESENT WHEN MLWTO           * 03962500
*        IS SPECIFIED                                                 * 03975000
*        IF A WPX IS GENERATED, THESE FIELDS WILL FOLLOW THE WPX  @P9A* 03981200
*                                                                     * 03987500
*********************************************************************** 04000001
         SPACE                                                          04050001
         ORG   WPLRF                                                    04120001
         SPACE                                                          04130001
*******************************************************************@L2A 04135000
*        LINE TYPE FLAGS                                           @L2A 04140000
*******************************************************************@L2A 04145000
WPLLTF   DS    0BL2           LINE TYPE FLAGS FOR WPLTXT           @L2C 04150000
WPLLTF1  DS    B              1ST BYTE OF WPLTXT LINE TYPE FLAGS   @L2C 04200000
WPLLTFA  EQU   BIT0           CONTROL LINE                         @L2C 04250000
WPLLTFB  EQU   BIT1           LABEL LINE                           @L2C 04300000
WPLLTFC  EQU   BIT2           DATA LINE                            @L2C 04350000
WPLLTFD  EQU   BIT3           END LINE                             @L2C 04400000
WPLRSV17 EQU   BIT4,,C'X'     RESERVED                             @L2C 04410000
WPLRSV18 EQU   BIT5,,C'X'     RESERVED                             @L2C 04420000
WPLRSV19 EQU   BIT6,,C'X'     RESERVED                             @L2C 04430000
WPLRSV20 EQU   BIT7,,C'X'     RESERVED                             @L2C 04440000
WPLLTF2  DS    B              2ND BYTE OF WPLTXT LINE TYPE FLAGS   @L2C 04450000
WPLAREA  DS    C              AREA IDENTIFICATION                  @L2C 04500000
WPLLINES DS    FL1            NUMBER OF LINES (1 + NUMBER OF WPLMLTXT  X04550000
                              LINES)                               @L2C 04560000
WPLMLEXL EQU   *-WPLLTF       LENGTH OF MLWTO EXTENTION            @PAA 04580000
         EJECT                                                          04600000
*********************************************************************** 04605000
*                                                                     * 04610000
*        THE FOLLOWING FIELDS ARE OPTIONAL FOR MLWTO.  THEY REPRESENT * 04615000
*        A MAPPING OF THE ENTRIES DESCRIBING MESSAGE TEXT LINES       * 04620000
*        CREATED IN ADDITION TO THE WPLTXT MESSAGE TEXT LINE          * 04625000
*                                                                     * 04630000
*********************************************************************** 04635000
         SPACE                                                          04640001
         ORG   WPLRF                                                    04640401
         SPACE                                                          04640801
WPLML    EQU   *              START OF ADDITIONAL MLWTO LINE ENTRY @L2C 04642000
WPLML0   DS    FL1            ALWAYS ZERO                          @L2C 04650000
WPLMLLEN DS    FL1            MESSAGE LENGTH FOR THIS LINE (LENGTH OF  X04700000
                              MESSAGE TEXT + 4)                    @L2C 04750000
*******************************************************************@L2A 04762500
*        LINE TYPE FLAGS FOR WPLMLTXT                              @L2A 04775000
*******************************************************************@L2A 04787500
WPLMLLTF DS    0BL2           TYPE FLAGS FOR THIS LINE (WPLMLTXT)  @L2C 04800000
WPLMLLT1 DS    B              1ST BYTE OF LINE TYPE FLAGS FOR          X04900000
                              WPLMLTXT                             @L2C 04910000
WPLMLLTA EQU   BIT0           CONTROL LINE                         @L2C 04950000
WPLMLLTB EQU   BIT1           LABEL LINE                           @L2C 05000000
WPLMLLTC EQU   BIT2           DATA LINE                            @L2C 05050000
WPLMLLTD EQU   BIT3           END LINE                             @L2C 05100000
WPLRSV21 EQU   BIT4,,C'X'     RESERVED                             @L2C 05102000
WPLRSV22 EQU   BIT5,,C'X'     RESERVED                             @L2C 05104000
WPLRSV23 EQU   BIT6,,C'X'     RESERVED                             @L2C 05106000
WPLRSV24 EQU   BIT7,,C'X'     RESERVED                             @L2C 05108000
WPLMLLT2 DS    B              2ND BYTE OF LINE TYPE FLAGS FOR          X05110000
                              WPLMLTXT                             @L2C 05120000
         SPACE                                                          05130001
WPLMLTXT DS    0CL126         MESSAGE TEXT FOR THIS LINE (MAXIMUM 126  X05141700
                              CHARACTERS)                          @P3C 05153400
WPLMLADT DS    0CL4           MESSAGE TEXT ADDRESS (IF TEXT            X05160400
                              KEYWORD IS SPECIFIED, THIS FIELD         X05167400
                              WILL BE GENERATED, EVEN IF THE           X05174400
                              LINE TYPE IS '10'X)                  @P6C 05181400
         DS    CL126          INLINE MESSAGE TEXT                  @P3A 05188500
         EJECT                                                     @L2A 05200300
*******************************************************************@L2A 05200600
*                                                                  @L2A 05200900
*        THE FOLLOWING IS THE DECLARATION OF THE WPX WHICH IS      @L2A 05201200
*        BUILT FOLLOWING THE TEXT WHEN MCS FLAG WPLMCSFL IS ON.    @L2A 05201500
*                                                                  @L2A 05201800
*******************************************************************@L2A 05202100
         SPACE  1                                                  @L2A 05202400
         ORG   WPLRF                                               @P2A 05202500
         SPACE  1                                                  @P2A 05202600
WPX      EQU   *              START OF WPL EXTENSION               @P1C 05202700
WPXVRSN  DS    AL1            VERSION LEVEL                        @L2A 05203000
WPXS220  EQU   1              LEVEL OS/VS2 JBB2220                 @L2A 05203300
WPXS410  EQU   2              LEVEL HBB4410                        @L6C 05203500
WPXS422  EQU   3              LEVEL JBB4422                        @L8A 05203600
WPXS603  EQU   4              LEVEL HBB6603                        @PBA 05203700
WPXVERN  EQU   WPXS603        CURRENT VERSION LEVEL                @PBC 05203800
*******************************************************************@L2A 05203900
*        MPF/SUBSMOD FLAGS                                         @L2A 05204200
*******************************************************************@L2A 05204500
WPXFLAGS DS    B              MPF/SUBSMOD FLAGS                    @L2A 05205400
WPXMPFSP EQU   BIT0           MESSAGE IS TO BE SUPPRESSED DUE TO       X05205500
                              MPF                                  @L2A 05205600
WPXMPFPR EQU   BIT1           MESSAGE WAS PROCESSED BY MPF AND IS NOT  X05205700
                              TO BE SUPPRESSED                     @L2A 05205800
WPXNMOD  EQU   BIT2           THE CHARACTERISTICS OF THE MESSAGE       X05206300
                              MAY NOT BE MODIFIED BY THE PRIMARY       X05206600
                              SUBSYSTEM                            @L2A 05206900
WPXRPYLN DS    AL1            LENGTH OF REPLY BUFFER               @L2A 05207200
WPXLNGTH DS    AL1            LENGTH OF WPX                        @L5C 05207500
*******************************************************************@L2A 05207800
*        EXTENDED MCS FLAGS                                        @L2A 05208100
*   CHANGES TO THE EXTENDED MCS FLAGS WILL ALSO IMPACT THE         @L6A 05208200
*   EXTENDED MCS FLAGS IN IHAWQE AND IHACTM                        @L6A 05208300
*******************************************************************@L2A 05208400
WPXMCSF1 DS    0BL2           EXTENDED MCS FLAGS                   @L2A 05208700
WPXMCS1  DS    B              FIRST BYTE OF EXTENDED MCS FLAGS     @L2A 05209000
WPXBUSY  EQU   BIT0           RETURN WITH BUSY RETURN CODE IF BUFFER   X05209300
                              LIMITS EXCEEDED                      @L2A 05209600
WPXCONS  EQU   BIT1           FOUR BYTE CONSOLE ID WAS SPECIFIED   @L2A 05209900
WPXDOMI  EQU   BIT2           DOM ID WAS SPECIFIED                 @L2A 05210200
WPXCONN  EQU   BIT3           CONNECT ID WAS SPECIFIED             @L2A 05210500
WPXWTOR  EQU   BIT4           WTOR WITH EXTENDED PARM LIST         @L2A 05210800
WPXPRIO  EQU   BIT5           PRIORITY WAS SPECIFIED               @L2A 05211100
WPXCNM   EQU   BIT6           CONSOLE NAME WAS SPECIFIED           @L3A 05211200
WPXMCS2  DS    B              2ND BYTE OF EXTENDED MCS FLAGS       @L2A 05211400
WPXTXTAD EQU   BIT0           TEXT ADDRESS WAS SPECIFIED           @L5A 05211500
WPXRSV1A EQU   BIT1           RESERVED                             @D2C 05211600
WPXRSV48 EQU   BIT2           RESERVED                             @D3C 05211700
WPXRSV49 EQU   BIT3           RESERVED                             @D3C 05211800
WPXRSV50 EQU   BIT4           RESERVED                             @D1C 05211900
WPXSYNC  EQU   BIT5           PROCESS SYNCHRONOUS WITH RESPECT TO THE  +05212000
                              CALLER                               @L6A 05212100
WPXRSV51 EQU   BIT6           RESERVED                             @D1A 05212200
WPXRSV52 EQU   BIT7           RESERVED                             @D1A 05212300
WPXCPFLG DS    0BL2           FLAGS FOR CONTROL PROGRAM USE ONLY   @D1A 05212400
WPXCPFL1 DS    B              FLAGS FOR CONTROL PROGRAM USE BYTE1  @D1A 05212500
WPXRROK  EQU   BIT0           RESTART RESOURCE IS NOT TO BE OBTAINED   +05212600
                                                                   @D1M 05212700
WPXNOHO  EQU   BIT1           DON'T HOLD THE MESSAGE FOR TEN SECONDS   +05212800
                                                                   @D1A 05212900
WPXNLCK  EQU   BIT2           DO NOT ATTEMPT TO OBTAIN ANY LOCKS   @D1A 05213000
WPXACLW  EQU   BIT3           USE ALTERNATE CPU LOADWAIT PATH      @P7C 05213100
WPXSPVD  EQU   BIT4           SUPER PRIVILEDGED                    @01A 05213200
WPXQNLY  EQU   BIT5           MESSAGE GOES ONLY TO CONSOLE         @02A 05213300
WPXRSV56 EQU   BIT6           RESERVED                             @D1A 05213400
WPXRSV57 EQU   BIT7           RESERVED                             @D1A 05213500
WPXCPFL2 DS    B              FLAGS FOR CONTROL PROGRAM USE BYTE2  @D1A 05213600
WPXRSV60 EQU   BIT0           RESERVED                             @D1A 05213700
WPXRSV61 EQU   BIT1           RESERVED                             @D1A 05213800
WPXRSV62 EQU   BIT2           RESERVED                             @D1A 05213900
WPXRSV63 EQU   BIT3           RESERVED                             @D1A 05214000
WPXRSV64 EQU   BIT4           RESERVED                             @D1A 05214100
WPXRSV65 EQU   BIT5           RESERVED                             @D1A 05214200
WPXRSV66 EQU   BIT6           RESERVED                             @D1A 05214300
WPXRSV67 EQU   BIT7           RESERVED                             @D1A 05214400
WPXRPBUF DS    AL4            REPLY BUFFER ADDRESS                 @L2A 05214500
WPXECBP  DS    AL4            REPLY ECB ADDRESS                    @L2A 05214600
WPXSEQN  DS    0F             DOM/CONNECT ID                       @L2A 05214700
WPXSYSID DS    AL1            SYSTEM ID                            @L2A 05214800
WPXSQID  DS    AL3            DOM SEQUENCE NUMBER                  @L2A 05214900
*******************************************************************@L2A 05215000
*        DESCRIPTOR CODES                                          @L2A 05215100
*******************************************************************@L2A 05215200
WPXDESC  DS    0BL2           DESCRIPTOR CODES                     @L2A 05215300
WPXDESC1 DS    B              FIRST BYTE OF DESCRIPTOR CODES       @L2A 05215400
WPXDESCA EQU   BIT0           SYSTEM FAILURE MESSAGE               @L2A 05215500
WPXDESCB EQU   BIT1           IMMEDIATE ACTION REQUIRED MESSAGE    @L2A 05215600
WPXDESCC EQU   BIT2           EVENTUAL ACTION REQUIRED MESSAGE     @L2A 05215700
WPXDESCD EQU   BIT3           SYSTEM STATUS MESSAGE                @L2A 05215900
WPXDESCE EQU   BIT4           IMMEDIATE COMMAND RESPONSE MESSAGE   @L2A 05216200
WPXDESCF EQU   BIT5           JOB STATUS MESSAGE                   @L2A 05216500
WPXDESCG EQU   BIT6           APPLICATION PROGRAM/PROCESSOR MESSAGE    X05216800
                              OR DELETE AT TASK TERMINATION        @L2A 05217100
WPXDESCH EQU   BIT7           OUT-OF-LINE MESSAGE                  @L2A 05217400
WPXDESC2 DS    B              SECOND BYTE OF DESCRIPTOR CODES      @L2A 05217700
WPXDESCI EQU   BIT0           OPERATOR'S REQUEST                   @L2A 05218000
WPXDESCJ EQU   BIT1           TRACK COMMAND RESPONSE               @L2A 05218300
WPXDESCK EQU   BIT2           CRITICAL EVENTUAL ACTION REQUIRED    @L2A 05218600
WPXDESCL EQU   BIT3           DELIVERED BUT NOT HELD               @L7C 05218900
WPXRSV4  EQU   BIT4,,C'X'     RESERVED                             @L2A 05219200
WPXRSV5  EQU   BIT5,,C'X'     RESERVED                             @L2A 05219500
WPXRSV6  EQU   BIT6,,C'X'     RESERVED                             @L2A 05219800
WPXRSV7  EQU   BIT7,,C'X'     RESERVED                             @L2A 05220100
WPXRSV8  DS    AL2            RESERVED                             @L2A 05220400
*******************************************************************@L2A 05220700
*        128 ROUTING CODES                                         @L2A 05221000
*******************************************************************@L2A 05221300
WPXROUT  DS    0BL16          ROUTING CODES                            X05221600
                              THESE CODES INDICATE THE FUNCTIONAL      X05221900
                              AREA OR AREAS TO WHICH A MESSAGE IS TO   X05222200
                              BE SENT.                             @L2A 05222500
WPXR001  DS    B              1ST BYTE OF ROUTING CODES            @L2A 05222800
WPXR01   EQU   BIT0           MASTER CONSOLE                       @L2A 05223100
WPXR02   EQU   BIT1           MASTER CONSOLE INFORMATIONAL         @L2A 05223400
WPXR03   EQU   BIT2           TAPE POOL                            @L2A 05223700
WPXR04   EQU   BIT3           DIRECT ACCESS POOL                   @L2A 05224000
WPXR05   EQU   BIT4           TAPE LIBRARY                         @L2A 05224300
WPXR06   EQU   BIT5           DISK LIBRARY                         @L2A 05224600
WPXR07   EQU   BIT6           UNIT RECORD POOL                     @L2A 05224900
WPXR08   EQU   BIT7           TELEPROCESSING CONTROL               @L2A 05225200
WPXR002  DS    B              2ND BYTE OF ROUTING CODES            @L2A 05225500
WPXR09   EQU   BIT0           SYSTEM SECURITY                      @L2A 05225800
WPXR10   EQU   BIT1           SYSTEM/ERROR MAINTENANCE             @L2A 05226100
WPXR11   EQU   BIT2           PROGRAMMER INFORMATION               @L2A 05226400
WPXR12   EQU   BIT3           EMULATOR INFORMATION                 @L2A 05226700
WPXR13   EQU   BIT4           USER ROUTING CODE                    @L2A 05227000
WPXR14   EQU   BIT5           USER ROUTING CODE                    @L2A 05227300
WPXR15   EQU   BIT6           USER ROUTING CODE                    @L2A 05227600
WPXR16   EQU   BIT7           USER ROUTING CODE                    @L2A 05227900
WPXR003  DS    B              3RD BYTE OF ROUTING CODES            @L2A 05228200
WPXR004  DS    B              4TH BYTE OF ROUTING CODES            @L2A 05228500
WPXR005  DS    B              5TH BYTE OF ROUTING CODES            @L2A 05228800
WPXR006  DS    B              6TH BYTE OF ROUTING CODES            @L2A 05229100
WPXR007  DS    B              7TH BYTE OF ROUTING CODES            @L2A 05229400
WPXR008  DS    B              8TH BYTE OF ROUTING CODES            @L2A 05229700
WPXR009  DS    B              9TH BYTE OF ROUTING CODES            @L2A 05230000
WPXR010  DS    B              10TH BYTE OF ROUTING CODES           @L2A 05230300
WPXR011  DS    B              11TH BYTE OF ROUTING CODES           @L2A 05230600
WPXR012  DS    B              12TH BYTE OF ROUTING CODES           @L2A 05230900
WPXR013  DS    B              13TH BYTE OF ROUTING CODES           @L2A 05231200
WPXR014  DS    B              14TH BYTE OF ROUTING CODES           @L2A 05231500
WPXR015  DS    B              15TH BYTE OF ROUTING CODES           @L2A 05231800
WPXR016  DS    B              16TH BYTE OF ROUTING CODES           @L2A 05232100
         SPACE                                                          05232400
*******************************************************************@L2A 05232700
*        MESSAGE TYPE FLAGS                                        @L2A 05233000
*******************************************************************@L2A 05233300
WPXMSGTY DS    0BL2           MESSAGE TYPE FLAGS                   @L2A 05233600
WPXMSGT1 DS    B              FIRST BYTE OF MESSAGE TYPE FLAGS     @L2A 05233900
WPXMSGTA EQU   BIT0           MONITOR JOBNAMES                     @L2A 05234200
WPXMSGTB EQU   BIT1           MONITOR STATUS                       @L2A 05234500
WPXRSV9  EQU   BIT2,,C'X'     RESERVED                             @L2A 05234800
WPXRSV10 EQU   BIT3,,C'X'     RESERVED                             @L2A 05235100
WPXRSV11 EQU   BIT4,,C'X'     RESERVED                             @L2A 05235400
WPXMSGTF EQU   BIT5           MONITOR SESS                         @L2A 05235700
WPXRSV12 EQU   BIT6,,C'X'     RESERVED                             @L2A 05236000
WPXRSV13 EQU   BIT7,,C'X'     RESERVED                             @L2A 05236300
WPXMSGT2 DS    B              SECOND BYTE OF MESSAGE TYPE FLAGS    @L2A 05236600
WPXRSV14 EQU   BIT0,,C'X'     RESERVED                             @L2A 05236900
WPXRSV15 EQU   BIT1,,C'X'     RESERVED                             @L2A 05237200
WPXRSV16 EQU   BIT2,,C'X'     RESERVED                             @L2A 05237500
WPXRSV17 EQU   BIT3,,C'X'     RESERVED                             @L2A 05237800
WPXRSV18 EQU   BIT4,,C'X'     RESERVED                             @L2A 05238100
WPXRSV19 EQU   BIT5,,C'X'     RESERVED                             @L2A 05238400
WPXRSV20 EQU   BIT6,,C'X'     RESERVED                             @L2A 05238700
WPXRSV21 EQU   BIT7,,C'X'     RESERVED                             @L2A 05239000
WPXPRTY  DS    AL2            MESSAGE'S PRIORITY                   @L2A 05239300
WPXJOBID DS    CL8            JOB ID                               @L2A 05239600
WPXJOBNM DS    CL8            JOBNAME                              @L2A 05239900
WPXKEY   DS    CL8            RETRIEVAL KEY                        @L2A 05240200
WPXTOKN  DS    AL4            TOKEN FOR DOM                        @L2A 05240500
WPXCNID  DS    AL4            CONSOLE ID                           @L2A 05240800
WPXSYSNA DS    CL8            SYSTEM NAME                          @L2A 05241100
WPXCNNME DS    CL8            CONSOLE NAME                         @L3A 05241200
WPXRCNA  DS    AL4            ADDRESS OF 12 BYTE FIELD FOR REPLYING    X05241300
                              CONSOLE NAME/ID                      @L3A 05241400
WPXCART  DS    AL4            ADDRESS OF CART                      @L4C 05241500
WPXWSPRM DS    AL4            ADDRESS OF WAIT STATE PARM LIST      @L6C 05241700
WPXASCB  DS    AL4            ASCB ADDRESS                         @PBA 05241800
WPXRSV30 DS    CL16           RESERVED                             @PDC 05241900
WPXLEN   EQU   *-WPX          LENGTH OF THE WPX                    @L2A 05242000
WPX2LEN  EQU   104            LENGTH OF VERSION 2 WPX              @PBA 05244600
WPX4LEN  EQU   124            LENGTH OF VERSION 4 WPX              @PDC 05247300
         MEND  ,              */                                        05250001
*%WPLL2: ;                                                              05300001
*  @SPACE(1);                                                           05350000
* %WPLLPUSH = '@LISTPUSH';          /*MACRO ASSIGNMENT OF PUSH   @L6A*/ 05377700
* %WPLLPOP = '@LISTPOP';            /*MACRO ASSIGNMENT OF POP    @L6A*/ 05405400
* %WPLLOFF = '@LISTOFF';            /*MACRO ASSIGNMENT OF OFF    @L6A*/ 05433100
* WPLLPUSH;                         /*LISTPUSH                   @L6A*/ 05460800
* %IF WPLVIA = 'YES' %THEN          /*CHECK IF WPL ALET IS SPECIFIED    05488500
*                                                                @L6A*/ 05516200
*   %WPLVIA = 'VIA(WPLALET)';       /*SET VIA TO SPECIFIED VALUE @L6A*/ 05543900
* %ELSE                             /*NO ALET SPECIFIED          @L6A*/ 05571600
*   %IF GLOBALARMODE = 'YES' %THEN  /*WPL ALET NOT SPECIFIED-CHECK IF   05599300
*                                   GLOBAL DEFAULT SPECIFIED     @L6A*/ 05627000
*     %WPLVIA = 'VIA(0)';           /*IF YES THEN SET GLOBAL     @L6A*/ 05654700
*   %ELSE                           /*NO GLOBAL SPECIFIED        @L6A*/ 05682400
*     %WPLVIA = '';                 /*SET VIA TO NULLS           @L6A*/ 05710100
* %IF IHALIST ~= 'NO' %THEN         /*WANT LISTING DEFAULT       @P4C*/ 05737800
*   %GOTO WPLZ1;                    /*YES, BRANCH AROUND LISTOFF @L6A*/ 05765500
* WPLLOFF;                          /*LISTOFF                    @L6A*/ 05793200
* %WPLZ1 : ;                                                  /* @L6A*/ 05820900
*/********************************************************************/ 05850001
*/*                                                                  */ 05900001
*/*         WTOR PREFIX (24-BIT PARAMETER LIST)              @G860PSS*/ 05950000
*/*                                                                  */ 06100001
*/********************************************************************/ 06150001
*DECLARE                                                                06250001
*  1 WPLRF  BASED(WPLPTR) WPLVIA BDY(WORD),                             06283300
*                                        /* START OF WTOR PREFIX        06305500
*                                           (24-BIT PARM LIST)   @L6C*/ 06327700
*   2 WPLRPTR     PTR(31),               /* POINTER TO REPLY BUFFER  */ 06350001
*    3 WPLRLN      PTR(8),               /* MAXIMUM LENGTH OF REPLY  */ 06400001
*    3 WPLRPTRA    PTR(24),              /* ADDRESS OF REPLY BUFFER  */ 06450001
*   2 WPLRECB     PTR(31);               /* ADDRESS OF REPLY ECB     */ 06500001
*  @SPACE(1);                                                           06550000
*/********************************************************************/ 06600001
*/*                                                                  */ 06650001
*/*         WTOR PREFIX (31-BIT PARAMETER LIST)              @G860PSS*/ 06653300
*/*                                                                  */ 06656600
*/********************************************************************/ 06659900
* DECLARE                                                               06663200
*  1 WPL31RF   BASED(WPLPTR) WPLVIA BDY(WORD),                          06665600
*                                        /* START OF WTOR PREFIX        06668000
*                                         (31-BIT PARM LIST)     @L6C*/ 06670400
*   2 WPL31RRP    PTR(31),               /* ADDRESS OF REPLY BUFFER     06673100
*                                                            @G860PSS*/ 06676400
*    3 WPL31RFG   BIT(1),                /* INDICATES A WTOR @G860PSS*/ 06679700
*   2 WPL31REP    PTR(31);               /* ADDRESS OF REPLY ECB        06683000
*                                                            @G860PSS*/ 06686300
* @EJECT;                                /*                  @G64DP9A*/ 06689600
*/********************************************************************/ 06692900
*/*                                                                  */ 06696200
*/*                      COMMON SECTION                              */ 06700001
*/*      IF THE TEXT PARAMETER IS SPECIFIED INSTEAD OF INLINE    @P9A*/ 06712500
*/*      MESSAGE TEXT, THE VALUE OF WPLLPTXT WILL ONLY REFLECT   @P9A*/ 06725000
*/*      THE 4 BYTE LENGTH OF THE POINTER.                       @P9A*/ 06737500
*/*                                                                  */ 06750001
*/********************************************************************/ 06800001
*DECLARE                                                                06900001
*  1 WPL  BASED(WPLPTR) WPLVIA BDY(WORD),/* START OF COMMON SECTION     06920000
*                                                                @L6C*/ 06940000
*   2 WPLLGH      FIXED(15),             /* FOR 24-BIT WTOR PARM LIST,  06960000
*                                           THIS IS THE MSG LENGTH      06970000
*                                           (COMBINED LENGTH OF MSG     06980000
*                                           TEXT, MSG LENGTH FIELD AND  06990000
*                                           MCS FLAGS FIELD) @G860PSS*/ 07000000
*    3 WPL31RLN   FIXED(8),              /* IF WPL IS FOR A 31-BIT WTOR,07010000
*                                           THIS IS THE LENGTH OF THE   07020000
*                                           REPLY BUFFER. OTHERWISE,    07030000
*                                           THIS FIELD MUST BE ZERO     07040000
*                                                            @G860PSS*/ 07050000
*    3 WPLLPTXT   FIXED(8),              /* MSG LENGTH                  07060000
*                                           (COMBINED LENGTH OF MSG     07070000
*                                           TEXT, MSG LENGTH FIELD AND  07080000
*                                           MCS FLAGS FIELD) @G860PSS*/ 07090000
*/***************************************************************@L2A*/ 07092500
*/*         MCS FLAGS                                            @L2A*/ 07095000
*/*  CHANGES TO THE MCS FLAGS WILL ALSO IMPACT THE               @L6A*/ 07095800
*/*  MCS FLAGS IN IHAWQE AND IHACTM                              @L6A*/ 07096600
*/***************************************************************@L2A*/ 07097500
*   2 WPLMCSF     CHAR(2),               /* MCS FLAGS                */ 07100001
*    3 WPLMCSF1    BIT(8),               /* 1ST BYTE OF MCS FLAGS    */ 07150001
*     4 WPLMCSFA BIT(1),                 /* ROUTE/DESCRIPTOR CODE       07200001
*                                           FIELDS PRESENT           */ 07250001
*     4 WPLMCSFB BIT(1),                 /* QUEUE TO CONSOLE IF ACTIVE  07300001
*                                           (ID IN REG 0)            */ 07350001
*     4 WPLMCSFC BIT(1),                 /* COMMAND RESPONSE         */ 07400001
*     4 WPLMCSFD BIT(1),                 /* MESSAGE TYPE FIELD EXISTS*/ 07450001
*     4 WPLMCSFE BIT(1),                 /* THIS WPL IS A REPLY TO A    07500001
*                                           WTOR                     */ 07550001
*     4 WPLMCSFF BIT(1),                 /* BROADCAST THIS MESSAGE      07600001
*                                           TO ALL ACTIVE CONSOLES   */ 07650001
*     4 WPLMCSFG BIT(1),                 /* QUEUE TO HARD COPY ONLY  */ 07700001
*     4 WPLMCSFH BIT(1),                 /* QUEUE TO CONSOLE            07750000
*                                           (ID IN REG 0)        @P5C*/ 07800000
*    3 WPLMCSF2    BIT(8),               /* 2ND BYTE OF MCS FLAGS    */ 07850001
*     4 WPLMCSFI BIT(1),                 /* DO NOT TIME STAMP THIS      07900001
*                                           MESSAGE                  */ 07950001
*     4 WPLMCSFJ BIT(1),                 /* MLWTO INDICATOR          */ 08000001
*     4 WPLMCSFK BIT(1),                 /* PRIMARY SUBSYSTEM USE       08021000
*                                           ONLY.                       08028000
*                                           JES3: DO NOT LOG MINOR      08035000
*                                                 WQE'S IF THE MAJOR    08042000
*                                                 IS NOT HARDCOPIED.    08049000
*                                           JES2: NOT USED.      @L2C*/ 08056000
*     4 WPLMCSFL BIT(1),                 /* EXTENDED WPL FORMAT (WPX)   08063100
*                                           EXISTS               @L2C*/ 08070200
*     4 WPLMCSFM BIT(1),                 /* THE MESSAGE IS AN OPERATOR  08077300
*                                           COMMAND              @L1C*/ 08088600
*     4 WPLMCSFN BIT(1),                 /* BYPASS QUEUING MESSAGE      08100001
*                                           TO HARD COPY             */ 08150001
*     4 WPLMCSFO BIT(1),                 /* WQEBLK KEYWORD SPECIFIED    08190000
*                                                                @L2C*/ 08230000
*     4 WPLRSV01 BIT(1),                 /* RESERVED             @P9C*/ 08240000
*   2 WPLTXT      CHAR(126) BDY(WORD),   /* MESSAGE TEXT (MAXIMUM       08250001
*                                           126 CHARACTERS           */ 08300001
*      4 *         CHAR(125) BDY(WORD),  /* MESSAGE TEXT             */ 08303300
*        6 WPLADTXT  PTR(31),            /* MESSAGE TEXT ADDRESS        08306400
*                                           (IF TEXT KEYWORD IS         08309500
*                                           SPECIFIED, THIS FIELD       08312600
*                                           WILL BE GENERATED,          08315700
*                                           EVEN IF THE LINE            08318800
*                                           TYPE IS '10'X)       @P6C*/ 08321900
*      4 WPLTXTL   CHAR(1);              /* LAST BYTE OF MESSAGE        08325000
*                                           TEXT                     */ 08330001
*  @EJECT;                                                              08347500
*/***************************************************************@L2A*/ 08347800
*/*                                                              @L2A*/ 08348100
*/*      THE FOLLOWING IS THE DECLARATION OF THE WPX WHICH IS    @L2A*/ 08348400
*/*      BUILT FOLLOWING THE TEXT WHEN BIT WPLMCSFL IS ON.       @L2A*/ 08348700
*/*                                                              @L2A*/ 08349000
*/***************************************************************@L2A*/ 08349300
*DECLARE                                                                08349600
*  1 WPX BASED(WPLPTR) WPLVIA BDY(BYTE), /* START OF WPL EXTENSION      08349900
*                                                                @L6C*/ 08350200
*    3 WPXVRSN  FIXED(8),                /* VERSION LEVEL        @L2A*/ 08350500
*/***************************************************************@L2A*/ 08350600
*/*         MPF/SUBSMOD FLAGS                                    @L2A*/ 08350700
*/***************************************************************@L2A*/ 08350800
*    3 WPXFLAGS BIT(8),                  /* MPF/SUBSMOD FLAGS    @L2A*/ 08351200
*      5 WPXMPFSP BIT(1),                /* MESSAGE IS TO BE SUPPRESSED 08351700
*                                           DUE TO MPF           @L2A*/ 08351800
*      5 WPXMPFPR BIT(1),                /* MESSAGE WAS PROCESSED BY    08351900
*                                           MPF AND IS NOT TO BE        08352000
*                                           SUPPRESSED           @L2A*/ 08352100
*      5 WPXNMOD  BIT(1),                /* THE CHARACTERISTICS OF THE  08352700
*                                           MESSAGE MAY NOT BE          08352800
*                                           MODIFIED BY THE PRIMARY     08352900
*                                           SUBSYSTEM            @L2A*/ 08353000
*    3 WPXRPYLN  FIXED(8),               /* LENGTH OF REPLY BUFFER      08353100
*                                                                @L2A*/ 08353200
*    3 WPXLNGTH  FIXED(8),               /* LENGTH OF WPX        @L5C*/ 08353300
*/***************************************************************@L2A*/ 08353400
*/*         EXTENDED MCS FLAGS                                   @L2A*/ 08353500
*/*   CHANGES TO THE EXTENDED MCS FLAGS WILL ALSO IMPACT THE     @L6A*/ 08353600
*/*   EXTENDED MCS FLAGS IN IHAWQE AND IHACTM                    @L6A*/ 08353700
*/***************************************************************@L2A*/ 08353800
*    3 WPXMCSF1  CHAR(2),                /* EXTENDED MCS FLAGS   @L2A*/ 08353900
*      5 WPXMCS1  BIT(8),                /* FIRST BYTE OF EXTENDED MCS  08354000
*                                           FLAGS                @L2A*/ 08354100
*        7 WPXBUSY  BIT(1),              /* RETURN WITH BUSY RETURN     08354400
*                                           CODE IF BUFFER LIMITS       08354700
*                                           EXCEEDED             @L2A*/ 08355000
*        7 WPXCONS  BIT(1),              /* FOUR BYTE CONSOLE ID        08355700
*                                           WAS SPECIFIED        @L2A*/ 08356500
*        7 WPXDOMI  BIT(1),              /* DOM ID WAS SPECIFIED @L2A*/ 08356600
*        7 WPXCONN  BIT(1),              /* CONNECT ID WAS              08356700
*                                           SPECIFIED            @L2A*/ 08356800
*        7 WPXWTOR  BIT(1),              /* WTOR WITH EXTENDED          08356900
*                                           PARAMETER LIST       @L2A*/ 08357200
*        7 WPXPRIO  BIT(1),              /* PRIORITY WAS SPECIFIED      08357300
*                                                                @L2A*/ 08357400
*        7 WPXCNM BIT(1),              /* CONSOLE NAME WAS SPECIFIED    08357500
*                                                                @L3A*/ 08357600
*      5 WPXMCS2 BIT(8),                 /* 2ND BYTE OF EXTENDED MCS    08357900
*                                           FLAGS                @L2A*/ 08358000
*        7 WPXTXTAD BIT(1),              /* TEXT ADDRESS WAS            08358200
*                                           SPECIFIED            @L5A*/ 08358400
*        7 WPXRSV1A BIT(1),              /* RESERVED             @D2C*/ 08358500
*        7 WPXRSV48 BIT(1),              /* RESERVED             @D3C*/ 08358600
*        7 WPXRSV49 BIT(1),              /* RESERVED             @D3C*/ 08358700
*        7 WPXRSV50 BIT(1),              /* RESERVED             @D1C*/ 08359000
*        7 WPXSYNC  BIT(1),              /* PROCESS SYNCHRONOUS WITH    08359100
*                                           RESPECT TO CALLER    @L6A*/ 08359200
*        7 WPXRSV51 BIT(1),              /* RESERVED             @D1A*/ 08359300
*        7 WPXRSV52 BIT(1),              /* RESERVED             @D1A*/ 08359400
*    3 WPXCPFLG   FIXED(16) BDY(BYTE),   /* FLAGS FOR CONTROL PROGRAM   08359500
*                                           USE ONLY             @D1A*/ 08359600
*      5 WPXCPFL1 BIT(8),                /* FLAGS FOR CONTROL PROGRAM   08359700
*                                           USE BYTE1            @D1A*/ 08359800
*        7 WPXRROK  BIT(1),              /* RESTART RESOURCE IS NOT TO  08359900
*                                           BE OBTAINED          @D1M*/ 08360000
*        7 WPXNOHO  BIT(1),              /* DON'T HOLD THE MESSAGE FOR  08360100
*                                           TEN SECONDS          @D1A*/ 08360200
*        7 WPXNLCK  BIT(1),              /* DO NOT ATTEMPT TO OBTAIN    08360300
*                                           ANY LOCKS            @D1A*/ 08360400
*        7 WPXACLW  BIT(1),              /* USE ALTERNATE CPU LOADWAIT  08360500
*                                           PATH                 @P7C*/ 08360600
*        7 WPXSPVD  BIT(1),              /* SUPER PRIVILEDGED    @01A*/ 08360700
*        7 WPXQNLY  BIT(1),              /* MESSAGE GOES ONLY TO        08360800
*                                           CONSOLE              @02A*/ 08360900
*        7 WPXRSV56 BIT(1),              /* RESERVED             @D1A*/ 08361000
*        7 WPXRSV57 BIT(1),              /* RESERVED             @D1A*/ 08361100
*      5 WPXCPFL2 BIT(8),                /* FLAGS FOR CONTROL PROGRAM   08361200
*                                           USE BYTE2            @D1A*/ 08361300
*        7 WPXRSV60 BIT(1),              /* RESERVED             @D1A*/ 08361400
*        7 WPXRSV61 BIT(1),              /* RESERVED             @D1A*/ 08361500
*        7 WPXRSV62 BIT(1),              /* RESERVED             @D1A*/ 08361600
*        7 WPXRSV63 BIT(1),              /* RESERVED             @D1A*/ 08361700
*        7 WPXRSV64 BIT(1),              /* RESERVED             @D1A*/ 08361800
*        7 WPXRSV65 BIT(1),              /* RESERVED             @D1A*/ 08361900
*        7 WPXRSV66 BIT(1),              /* RESERVED             @D1A*/ 08362000
*        7 WPXRSV67 BIT(1),              /* RESERVED             @D1A*/ 08362100
*    3 WPXRPBUF   PTR(31) BDY(BYTE),     /* REPLY BUFFER ADDRESS @L2A*/ 08362200
*    3 WPXECBP    PTR(31) BDY(BYTE),     /* REPLY ECB ADDRESS    @L2A*/ 08362300
*    3 WPXSEQN    FIXED(31) BDY(BYTE),   /* DOM/CONNECT ID       @L2A*/ 08362400
*      5 WPXSYSID FIXED(8),              /* SYSTEM ID            @L2A*/ 08362500
*      5 WPXSQID  FIXED(24) BDY(BYTE),   /* DOM SEQUENCE NUMBER  @L2A*/ 08362600
*/***************************************************************@L2A*/ 08362700
*/*         DESCRIPTOR CODES                                     @L2A*/ 08362800
*/***************************************************************@L2A*/ 08362900
*    3 WPXDESC   CHAR(2),                /* DESCRIPTOR CODES     @L2A*/ 08363000
*      5 WPXDESC1    BIT(8),             /* 1ST BYTE OF DESCRIPTOR      08363100
*                                           CODES                @L2A*/ 08363200
*        7 WPXDESCA BIT(1),              /* SYSTEM FAILURE MESSAGE      08363300
*                                                                @L2A*/ 08363400
*        7 WPXDESCB BIT(1),              /* IMMEDIATE ACTION            08363500
*                                           REQUIRED MESSAGE     @L2A*/ 08363600
*        7 WPXDESCC BIT(1),              /* EVENTUAL ACTION             08363700
*                                           REQUIRED MESSAGE     @L2A*/ 08363800
*        7 WPXDESCD BIT(1),              /* SYSTEM STATUS MESSAGE       08363900
*                                                                @L2A*/ 08364000
*        7 WPXDESCE BIT(1),              /* IMMEDIATE COMMAND           08364100
*                                           RESPONSE MESSAGE     @L2A*/ 08364200
*        7 WPXDESCF BIT(1),              /* JOB STATUS MESSAGE   @L2A*/ 08364300
*        7 WPXDESCG BIT(1),              /* APPLICATION PROGRAM/        08364400
*                                           PROCESSOR MESSAGE OR        08364500
*                                           DELETE AT TASK TERMINATION  08364600
*                                                                @L2A*/ 08364700
*        7 WPXDESCH BIT(1),              /* OUT-OF-LINE MESSAGE  @L2A*/ 08364800
*      5 WPXDESC2    BIT(8),             /* 2ND BYTE OF DESCRIPTOR      08364900
*                                           CODES                @L2A*/ 08365000
*        7 WPXDESCI BIT(1),              /* OPERATOR'S REQUEST   @L2A*/ 08365100
*        7 WPXDESCJ BIT(1),              /* TRACK COMMAND RESPONSE      08365200
*                                                                @L2A*/ 08365300
*        7 WPXDESCK BIT(1),              /* CRITICAL EVENTUAL ACTION    08365400
*                                           REQUIRED             @L2A*/ 08365500
*        7 WPXDESCL BIT(1),              /* DELIVERED BUT NOT HELD      08365600
*                                                                @L7C*/ 08365700
*        7 WPXRSV4  BIT(1),              /* RESERVED             @L2A*/ 08365800
*        7 WPXRSV5  BIT(1),              /* RESERVED             @L2A*/ 08365900
*        7 WPXRSV6  BIT(1),              /* RESERVED             @L2A*/ 08366000
*        7 WPXRSV7  BIT(1),              /* RESERVED             @L2A*/ 08366100
*    3 WPXRSV8    FIXED(16) BDY(BYTE),   /* RESERVED             @L2A*/ 08366200
*/***************************************************************@L2A*/ 08366300
*/*         128 ROUTING CODES                                    @L2A*/ 08366400
*/***************************************************************@L2A*/ 08366500
*    3 WPXROUT   CHAR(16),               /* ROUTING CODES        @L2A*/ 08366600
*      5 WPXR001     BIT(8),             /* 1ST BYTE OF ROUTING CODES   08366700
*                                                                @L2A*/ 08366800
*        7 WPXR01   BIT(1),              /* MASTER CONSOLE       @L2A*/ 08366900
*        7 WPXR02   BIT(1),              /* MASTER CONSOLE INFO  @L2A*/ 08367000
*        7 WPXR03   BIT(1),              /* TAPE POOL            @L2A*/ 08367100
*        7 WPXR04   BIT(1),              /* DIRECT ACCESS POOL   @L2A*/ 08367200
*        7 WPXR05   BIT(1),              /* TAPE LIBRARY         @L2A*/ 08367300
*        7 WPXR06   BIT(1),              /* DISK LIBRARY         @L2A*/ 08367400
*        7 WPXR07   BIT(1),              /* UNIT RECORD POOL     @L2A*/ 08367500
*        7 WPXR08   BIT(1),              /* TELEPROCESSING CONTROL      08367600
*        7 WPXR08   BIT(1),                                      @L2A*/ 08367700
*      5 WPXR002     BIT(8),             /* 2ND BYTE OF ROUTING CODES   08367800
*                                                                @L2A*/ 08367900
*        7 WPXR09   BIT(1),              /* SYSTEM SECURITY      @L2A*/ 08368000
*        7 WPXR10   BIT(1),              /* SYSTEM/ERROR MAINTENANCE    08368100
*                                                                @L2A*/ 08368200
*        7 WPXR11   BIT(1),              /* PROGRAMMER INFORMATION      08368300
*                                                                @L2A*/ 08368400
*        7 WPXR12   BIT(1),              /* EMULATOR INFORMATION @L2A*/ 08368500
*        7 WPXR13   BIT(1),              /* USER ROUTING CODE    @L2A*/ 08368600
*        7 WPXR14   BIT(1),              /* USER ROUTING CODE    @L2A*/ 08368700
*        7 WPXR15   BIT(1),              /* USER ROUTING CODE    @L2A*/ 08368800
*        7 WPXR16   BIT(1),              /* USER ROUTING CODE    @L2A*/ 08368900
*      5 WPXR003     BIT(8),             /* 3RD BYTE OF ROUTING CODES   08369000
*                                                                @L2A*/ 08369100
*      5 WPXR004     BIT(8),             /* 4TH BYTE OF ROUTING CODES   08369200
*                                                                @L2A*/ 08369300
*      5 WPXR005     BIT(8),             /* 5TH BYTE OF ROUTING CODES   08369400
*                                                                @L2A*/ 08369500
*      5 WPXR006     BIT(8),             /* 6TH BYTE OF ROUTING CODES   08369600
*                                                                @L2A*/ 08369700
*      5 WPXR007     BIT(8),             /* 7TH BYTE OF ROUTING CODES   08369900
*                                                                @L2A*/ 08370000
*      5 WPXR008     BIT(8),             /* 8TH BYTE OF ROUTING CODES   08370900
*                                                                @L2A*/ 08371000
*      5 WPXR009     BIT(8),             /* 9TH BYTE OF ROUTING CODES   08371900
*                                                                @L2A*/ 08372000
*      5 WPXR010     BIT(8),             /* 10TH BYTE OF ROUTING CODES  08372900
*                                                                @L2A*/ 08373000
*      5 WPXR011     BIT(8),             /* 11TH BYTE OF ROUTING CODES  08373900
*                                                                @L2A*/ 08374000
*      5 WPXR012     BIT(8),             /* 12TH BYTE OF ROUTING CODES  08374900
*                                                                @L2A*/ 08375000
*      5 WPXR013     BIT(8),             /* 13TH BYTE OF ROUTING CODES  08375900
*                                                                @L2A*/ 08376000
*      5 WPXR014     BIT(8),             /* 14TH BYTE OF ROUTING CODES  08376900
*                                                                @L2A*/ 08377000
*      5 WPXR015     BIT(8),             /* 15TH BYTE OF ROUTING CODES  08377900
*                                                                @L2A*/ 08378000
*      5 WPXR016     BIT(8),             /* 16TH BYTE OF ROUTING CODES  08378900
*                                                                @L2A*/ 08379000
*/***************************************************************@L2A*/ 08379200
*/*         MESSAGE TYPE FLAGS                                   @L2A*/ 08379400
*/***************************************************************@L2A*/ 08379600
*    3 WPXMSGTY  CHAR(2),                /* MESSAGE TYPE FLAGS   @L2A*/ 08379900
*      5 WPXMSGT1    BIT(8),             /* 1ST BYTE OF MESSAGE         08380000
*                                           TYPE FLAGS           @L2A*/ 08380100
*        7 WPXMSGTA BIT(1),              /* MONITOR JOBNAMES     @L2A*/ 08380200
*        7 WPXMSGTB BIT(1),              /* MONITOR STATUS       @L2A*/ 08380300
*        7 WPXRSV9  BIT(1),              /* RESERVED             @L2A*/ 08380500
*        7 WPXRSV10 BIT(1),              /* RESERVED             @L2A*/ 08380700
*        7 WPXRSV11 BIT(1),              /* RESERVED             @L2A*/ 08380900
*        7 WPXMSGTF BIT(1),              /* MONITOR SESS         @L2A*/ 08381100
*        7 WPXRSV12 BIT(1),              /* RESERVED             @L2A*/ 08381300
*        7 WPXRSV13 BIT(1),              /* RESERVED             @L2A*/ 08381500
*      5 WPXMSGT2    BIT(8),             /* 2ND BYTE OF MESSAGE         08381700
*                                           TYPE FLAGS           @L2A*/ 08381900
*        7 WPXRSV14 BIT(1),              /* RESERVED             @L2A*/ 08382100
*        7 WPXRSV15 BIT(1),              /* RESERVED             @L2A*/ 08382300
*        7 WPXRSV16 BIT(1),              /* RESERVED             @L2A*/ 08382500
*        7 WPXRSV17 BIT(1),              /* RESERVED             @L2A*/ 08383200
*        7 WPXRSV18 BIT(1),              /* RESERVED             @L2A*/ 08385300
*        7 WPXRSV19 BIT(1),              /* RESERVED             @L2A*/ 08386000
*        7 WPXRSV20 BIT(1),              /* RESERVED             @L2A*/ 08386700
*        7 WPXRSV21 BIT(1),              /* RESERVED             @L2A*/ 08387400
*    3 WPXPRTY   FIXED(15) BDY(BYTE),    /* MESSAGE'S PRIORITY   @L2A*/ 08389500
*    3 WPXJOBID  CHAR(8),                /* JOB ID               @L2A*/ 08391600
*    3 WPXJOBNM  CHAR(8),                /* JOBNAME              @L2A*/ 08391900
*    3 WPXKEY    CHAR(8),                /* RETRIEVAL KEY        @L2A*/ 08392300
*    3 WPXTOKN   FIXED(31) BDY(BYTE),    /* TOKEN FOR DOM        @L2A*/ 08393000
*    3 WPXCNID   FIXED(31) BDY(BYTE),    /* CONSOLE ID           @L2A*/ 08393700
*    3 WPXSYSNA  CHAR(8),                /* SYSTEM NAME          @L2A*/ 08394000
*    3 WPXCNNME  CHAR(8),                /* CONSOLE NAME         @L3A*/ 08394100
*    3 WPXRCNA   PTR(31) BDY(BYTE),      /* ADDRESS OF 12 BYTE FIELD    08394200
*                                           FOR REPLYING CONSOLE'S      08394300
*                                           NAME/ID              @L3A*/ 08394400
*    3 WPXCART  PTR(31) BDY(BYTE),       /* ADDRESS OF CART      @L4C*/ 08394500
*    3 WPXWSPRM PTR(31) BDY(BYTE),       /* ADDRESS OF WAIT STATE       08394600
*                                           PARM LIST            @PBC*/ 08394700
*    3 WPXASCB  PTR(31) BDY(BYTE),       /* ADDRESS OF ASCB      @PBA*/ 08394800
*    3 WPXRSV30 CHAR(16);                /* RESERVED             @PDC*/ 08394900
*  @SPACE;                                                              08395100
*DCL WPXS220  FIXED(8) CONSTANT(1);      /* LEVEL OS/VS2 JBB2220 @L2A*/ 08395800
*DCL WPXS410  FIXED(8) CONSTANT(2);      /* LEVEL HBB4410        @L6C*/ 08396100
*DCL WPXS422  FIXED(8) CONSTANT(3);      /* LEVEL JBB4422        @P8C*/ 08396200
*DCL WPXS603  FIXED(8) CONSTANT(4);      /* LEVEL HBB6603        @PBA*/ 08396300
*DCL WPXVERN  FIXED(8) CONSTANT(WPXS603);/*CURRENT VERSION LEVEL @PBC*/ 08396400
*DCL WPXLEN   FIXED(8) CONSTANT(LENGTH(WPX)); /* WPX LENGTH      @L2A*/ 08396800
*DCL WPX2LEN  FIXED(8) CONSTANT(104);         /* WPX LENGTH      @PBA*/ 08396900
*DCL WPX4LEN  FIXED(8) CONSTANT(124);         /* WPX LENGTH      @PDC*/ 08397000
*  @EJECT;                                                              08397200
*/********************************************************************/ 08397900
*/*                                                                  */ 08398600
*/*      THE FOLLOWING FIELDS BEGIN IMMEDIATELY FOLLOWING THE LAST   */ 08400001
*/*      CHARACTER (BYTE) OF MESSAGE TEXT IN WPLTXT IF NO WPX    @L2C*/ 08420800
*/*      WAS CREATED.  IF A WPX WAS CREATED THEN WPLFLGS IS NOT  @L2A*/ 08441600
*/*      USED.                                                   @L2A*/ 08462400
*/*                                                                  */ 08483300
*/********************************************************************/ 08516600
*DECLARE                                                                08550001
*  1 WPLFLGS  BASED(WPLPTR) WPLVIA BDY(BYTE), /*START OF WPL FLGS       08570800
*                                               FIELDS           @L6C*/ 08591600
*/***************************************************************@L2A*/ 08612500
*/*         DESCRIPTOR CODES                                     @L2A*/ 08625000
*/***************************************************************@L2A*/ 08637500
*   2 WPLDESC     CHAR(2),               /* DESCRIPTOR CODES            08650000
*                         ARE USED TO FUNCTIONALLY CLASSIFY WTO AND     08700000
*        WTOR MESSAGES.                                              */ 08750000
*    3 WPLDESC1    BIT(8),               /* 1ST BYTE OF DESCRIPTOR      08900001
*                                           CODES                    */ 08950001
*     4 WPLDESCA BIT(1),                 /* SYSTEM FAILURE MESSAGE   */ 09000001
*     4 WPLDESCB BIT(1),                 /* IMMEDIATE ACTION            09050001
*                                           REQUIRED MESSAGE         */ 09100001
*     4 WPLDESCC BIT(1),                 /* IMPORTANT INFORMATION       09150000
*                                           MESSAGE              @P5C*/ 09200000
*     4 WPLDESCD BIT(1),                 /* SYSTEM STATUS MESSAGE    */ 09250001
*     4 WPLDESCE BIT(1),                 /* IMMEDIATE COMMAND           09300001
*                                           RESPONSE MESSAGE         */ 09350001
*     4 WPLDESCF BIT(1),                 /* JOB STATUS MESSAGE       */ 09400001
*     4 WPLDESCG BIT(1),                 /* APPLICATION PROGRAM/        09450001
*                                           PROCESSOR MESSAGE OR        09475000
*                                           DELETE AT TASK TERMINATION  09500000
*                                                                @L2C*/ 09525000
*     4 WPLDESCH BIT(1),                 /* OUT-OF-LINE MESSAGE      */ 09550001
*    3 WPLDESC2    BIT(8),               /* 2ND BYTE OF DESCRIPTOR      09600001
*                                           CODES                    */ 09650001
*     4 WPLDESCI BIT(1),                 /* OPERATOR'S REQUEST   @L2C*/ 09700000
*     4 WPLDESCJ BIT(1),                 /* TRACK COMMAND RESPONSE      09750000
*                                                                @L2C*/ 09752000
*     4 WPLDESCK BIT(1),                 /* CRITICAL EVENTUAL ACTION    09760064
*                                           REQUIRED             @L2C*/ 09765000
*     4 WPLDESCL BIT(1),                 /* IMPORTANT INFORMATION       09770000
*                                           MESSAGE              @L7C*/ 09775000
*     4 WPLDESCM BIT(1),                 /* PREVIOUSLY AUTOMATED @L8C*/ 09780000
*     4 WPLRSV10 BIT(1),                 /* RESERVED                 */ 09790001
*     4 WPLRSV11 BIT(1),                 /* RESERVED                 */ 09792001
*     4 WPLRSV12 BIT(1),                 /* RESERVED                 */ 09794001
*/***************************************************************@L2A*/ 09806500
*/*         16 ROUTING CODES                                     @L2A*/ 09819000
*/***************************************************************@L2A*/ 09831500
*   2 WPLROUT     CHAR(2),               /* ROUTING CODES               09844000
*                    INDICATE THE FUNCTIONAL AREA OR AREAS TO WHICH     09894000
*        A MESSAGE IS TO BE SENT                                     */ 09944000
*    3 WPLROUT1    BIT(8),               /* 1ST BYTE OF ROUTING CODES*/ 10000001
*     4 WPLROUTA BIT(1),                 /* MASTER CONSOLE           */ 10050001
*     4 WPLROUTB BIT(1),                 /* MASTER CONSOLE INFO      */ 10100001
*     4 WPLROUTC BIT(1),                 /* TAPE POOL                */ 10150001
*     4 WPLROUTD BIT(1),                 /* DIRECT ACCESS POOL       */ 10200001
*     4 WPLROUTE BIT(1),                 /* TAPE LIBRARY             */ 10250001
*     4 WPLROUTF BIT(1),                 /* DISK LIBRARY             */ 10300001
*     4 WPLROUTG BIT(1),                 /* UNIT RECORD POOL         */ 10350001
*     4 WPLROUTH BIT(1),                 /* TELEPROCESSING CONTROL   */ 10400001
*    3 WPLROUT2    BIT(8),               /* 2ND BYTE OF ROUTING CODES*/ 10450001
*     4 WPLROUTI BIT(1),                 /* SYSTEM SECURITY          */ 10500001
*     4 WPLROUTJ BIT(1),                 /* SYSTEM/ERROR MAINTENANCE */ 10550001
*     4 WPLROUTK BIT(1),                 /* PROGRAMMER INFORMATION   */ 10600001
*     4 WPLROUTL BIT(1),                 /* EMULATOR INFORMATION     */ 10650001
*     4 WPLROUTM BIT(1),                 /* USER ROUTING CODE        */ 10700001
*     4 WPLROUTN BIT(1),                 /* USER ROUTING CODE        */ 10710001
*     4 WPLROUTO BIT(1),                 /* USER ROUTING CODE        */ 10720001
*     4 WPLROUTP BIT(1),                 /* USER ROUTING CODE    @L2C*/ 10766000
*/***************************************************************@L2A*/ 10812000
*/*         MESSAGE TYPE FLAGS                                   @L2A*/ 10858000
*/***************************************************************@L2A*/ 10904000
*   2 WPLMSGTY    CHAR(2),               /* MESSAGE TYPE FLAGS       */ 10950001
*    3 WPLMSGT1    BIT(8),               /* 1ST BYTE OF MESSAGE         10970001
*                                           TYPE FLAGS               */ 10980001
*     4 WPLMSGTA BIT(1),                 /* MONITOR JOBNAMES     @L2C*/ 10983600
*     4 WPLMSGTB BIT(1),                 /* MONITOR STATUS       @L2C*/ 10987200
*     4 WPLMSGTC BIT(1),                 /* RESERVED             @L2C*/ 10990800
*     4 WPLMSGTD BIT(1),                 /* INDICATES EXISTENCE OF      10994401
*                                           QID FIELD IN WPL     @L2C*/ 10995200
*     4 WPLRSV14 BIT(1),                 /* RESERVED                 */ 10996001
*     4 WPLMSGTF BIT(1),                 /* MONITOR SESS             */ 10998001
*     4 WPLRSV15 BIT(1),                 /* RESERVED                 */ 10998401
*     4 WPLRSV16 BIT(1),                 /* RESERVED                 */ 10998501
*    3 WPLMSGT2    BIT(8),               /* 2ND BYTE OF MESSAGE         10998801
*                                           TYPE FLAGS               */ 10999201
*     4 WPLRSV25 BIT(1),                 /* RESERVED                 */ 10999301
*     4 WPLRSV26 BIT(1),                 /* RESERVED                 */ 10999401
*     4 WPLRSV27 BIT(1),                 /* RESERVED                 */ 10999501
*     4 WPLRSV28 BIT(1),                 /* RESERVED                 */ 11007901
*     4 WPLRSV29 BIT(1),                 /* RESERVED                 */ 11009901
*     4 WPLRSV30 BIT(1),                 /* RESERVED                 */ 11011901
*     4 WPLRSV31 BIT(1),                 /* RESERVED                 */ 11013901
*     4 WPLRSV32 BIT(1),                 /* RESERVED                 */ 11015901
*   2 WPLQID      FIXED(15) BDY(BYTE);   /* RESERVED             @L2C*/ 11028700
*  @SPACE(1);                                                           11041600
*/********************************************************************/ 11050001
*/*                                                                  */ 11100001
*/*                      MLWTO EXTENSION                             */ 11150001
*/*                                                                  */ 11200001
*/*     THE FOLLOWING FIELDS ARE ALWAYS PRESENT WHEN MLWTO IS        */ 11212500
*/*     SPECIFIED.                                                   */ 11225000
*/*     IF A WPX IS GENERATED, THESE FIELDS WILL FOLLOW THE WPX. @P9A*/ 11231200
*/*                                                                  */ 11237500
*/********************************************************************/ 11250001
*DECLARE                                                                11410001
*  1 WPLLS01  BASED(WPLPTR) WPLVIA BDY(BYTE),                /*  @L6C*/ 11420000
*/***************************************************************@L2A*/ 11427500
*/*         LINE TYPE FLAGS FOR WPLTXT                           @L2A*/ 11435000
*/***************************************************************@L2A*/ 11442500
*   2 WPLLTF      CHAR(2),               /* LINE TYPE FLAGS FOR MSG     11450001
*                                           TEXT IN WPLTXT           */ 11500001
*    3 WPLLTF1     BIT(8),               /* 1ST BYTE OF LINE TYPE       11550001
*                                           FLAGS FOR WPLTXT         */ 11600001
*     4 WPLLTFA  BIT(1),                 /* CONTROL LINE             */ 11650001
*     4 WPLLTFB  BIT(1),                 /* LABEL LINE               */ 11700001
*     4 WPLLTFC  BIT(1),                 /* DATA LINE                */ 11800001
*     4 WPLLTFD  BIT(1),                 /* END LINE                 */ 11850001
*     4 WPLRSV17 BIT(1),                 /* RESERVED                 */ 11900001
*     4 WPLRSV18 BIT(1),                 /* RESERVED                 */ 11910001
*     4 WPLRSV19 BIT(1),                 /* RESERVED                 */ 11920001
*     4 WPLRSV20 BIT(1),                 /* RESERVED                 */ 11930001
*    3 WPLLTF2     BIT(8),               /* 2ND BYTE OF LINE TYPE       11950001
*                                           FLAGS FOR WPLTXT         */ 12000001
*   2 WPLAREA     CHAR(1),               /* AREA IDENTIFICATION      */ 12100001
*   2 WPLLINES    PTR(8);                /* NUMBER OF LINES (1 +        12150001
*                                           NUMBER OF WPLMLTXT LINES)*/ 12200001
*DCL WPLMLEXL FIXED(8) CONSTANT(LENGTH(WPLLS01)); /* LENGTH OF MLWTO    12211100
*                                           EXTENTION            @PAA*/ 12222200
* @EJECT;                                                               12233300
*/********************************************************************/ 12266600
*/*                                                                  */ 12299900
*/*     THE FOLLOWING FIELDS ARE OPTIONAL FOR MLWTO.  THEY REPRE-    */ 12333200
*/*     SENT A MAPPING OF THE ENTRIES DESCRIBING MESSAGE TEXT LINES  */ 12366500
*/*     CREATED IN ADDITION TO THE WPLTXT MESSAGE TEXT LINE.         */ 12399800
*/*                                                                  */ 12433100
*/********************************************************************/ 12466400
*DECLARE                                                                12500001
*  1 WPLML  BASED(WPLPTR) WPLVIA BDY(WORD), /*START OF ADDITIONAL MSG   12550000
*                                           TEXT LINE ENTRY      @L6C*/ 12600000
*   2 WPLML0      PTR(8),                /* HIGH-ORDER BYTE OF LENGTH   12650001
*                                           FIELD FOR WPLMLTXT (ALWAYS  12700001
*                                           ZERO)                    */ 12750001
*   2 WPLMLLEN    PTR(8),                /* LENGTH OF ADDITIONAL MSG    12800001
*                                           TEXT LINE ENTRY (4 +        12850001
*                                           LENGTH OF WPLMLTXT TEXT) */ 12900001
*/***************************************************************@L2A*/ 12912500
*/*         LINE TYPE FLAGS FOR WPLMLTXT                         @L2A*/ 12925000
*/***************************************************************@L2A*/ 12937500
*   2 WPLMLLTF    CHAR(2),               /* LINE TYPE FLAGS FOR         12950001
*                                           WPLMLTXT TEXT            */ 13000001
*    3 WPLMLLT1    BIT(8),               /* 1ST BYTE OF LINE TYPE       13050001
*                                           FLAGS FOR WPLMLTXT       */ 13100001
*     4 WPLMLLTA BIT(1),                 /* CONTROL LINE             */ 13150001
*     4 WPLMLLTB BIT(1),                 /* LABEL LINE               */ 13200001
*     4 WPLMLLTC BIT(1),                 /* DATA LINE                */ 13250001
*     4 WPLMLLTD BIT(1),                 /* END LINE                 */ 13300001
*     4 WPLRSV21 BIT(1),                 /* RESERVED                 */ 13350001
*     4 WPLRSV22 BIT(1),                 /* RESERVED                 */ 13352001
*     4 WPLRSV23 BIT(1),                 /* RESERVED                 */ 13354001
*     4 WPLRSV24 BIT(1),                 /* RESERVED                 */ 13356001
*    3 WPLMLLT2    BIT(8),               /* 2ND BYTE OF LINE TYPE       13360001
*                                           FLAGS FOR WPLMLTXT       */ 13370001
*   2 WPLMLTXT    CHAR(126) BDY(WORD),   /* ADDITIONAL LINE MESSAGE     13420000
*                                           TEXT (MAX 126 CHARS) @P3C*/ 13470000
*     4 WPLMLADT  PTR(31);               /* MESSAGE TEXT ADDRESS        13498500
*                                           (IF TEXT KEYWORD IS         13527000
*                                           SPECIFIED, THIS FIELD       13555500
*                                           WILL BE GENERATED,          13584000
*                                           EVEN IF THE LINE            13612500
*                                           TYPE IS '10'X)       @P6C*/ 13641000
*WPLLPOP;                                /*LISTPOP               @L6A*/ 13670000
