* %      GOTO DIEPLS;                 /* GO TO THE PLS VERSION          00050000
         MACRO                                                          00100000
         IFDIEDAT                                                       00150000
**** START OF SPECIFICATIONS ****************************************** 00200000
*                                                                       00250000
*01*  MODULE NAME = IFDIEDAT                                            00300000
*                                                                       00350000
*01*  DESCRIPTIVE NAME = DIE DATA AREA                                  00400000
*                                                                       00450000
*01*  STATUS = OS/VS2 JBB2220                                           00600000
*                                                                       00650000
*01*  FUNCTION = THIS MACRO DESCRIBES THE DATA AREA AT THE              00700000
*                BEGINNING OF THE DIE MODULE (IFDOLT57)                 00750000
*                                                                       00800000
*01*  MODULE TYPE= MACRO                                                00850000
*                                                                       00900000
*02*    PROCESSOR= ASSEMBLER AND PLS                                    00950000
*                                                                       01000000
*01*  CHANGE ACTIVITY = AS FOLLOWS:                                     01050000
*             NEW MACRO FOR HBB2102                            @G860PLW 01100000
*          ** DISPLACEMENTS FOR DIEMAP AND DIEASID INCORRECT.  @PTMMMMM 01150000
*             THOSE FIELDS MUST BE REVERSED.                   @PTMMMMM 01200000
*          OY03819 - CORRECT ERRORS IN ABNORMAL TERMINATION    @YA03819 01225000
*                                                                       01250000
**** END OF SPECIFICATIONS ******************************************** 01300000
         SPACE 1                                                        01350000
DIEDATA  DSECT                                                          01400000
         DS    0F                                                       01450000
         DS    F                        UNUSED                          01500000
DIECOMON DS    A                        ADDRESS OF OLTEP COMMON AREA    01550000
DIETCB   DS    A                        ADDRESS OF OLTEP'S TCB          01600000
DIESIZE  DS    F                        SIZE OF DIE MODULE (IFDOLT57)   01650000
DIEIOCBS DS    0FL3                     I/O CONTROL BLOCKS              01700000
DIEIOCB1 DS    F                        FIRST SET OF I/O CONTROL BLOCKS 01750000
DIEIOCB2 DS    F                        SECND SET OF I/O CONTROL BLOCKS 01800000
DIEIOCB3 DS    F                        THIRD SET OF I/O CONTROL BLOCKS 01850000
DIEMASK  DS    A                        ADDRESS OF UCB BIT MASK TABLE   01900000
DIEMAP   DS    A                        ADDR OF PATH MAP TABLE @PTMMMMM 01950000
DIEASID  DS    F                        MEMORY ID OF OLTEP     @PTMMMMM 02000000
DIESAVE  DS    18F                      ADDRESS OF SVC-59 SAVE AREA     02050000
DIEABLKS DS    A                        ADDRESS OF ALLOC PARM LIST      02100000
DIEASSGN DS    16F                      ADDR OF ASSIGNED UCBS  @YA03819 02108300
*                                         DEVICES              @YA03819 02116600
DIEGPMSK DS    16X                      GUARANTEED PATH MASKS  @YA03819 02124900
DIEATIOS DS    F                        ATTENTION IOSB         @YA03819 02133200
DIEATTIN DS    X                        ATTENTION INDEX        @YA03819 02141500
         MEND                                                           02150000
             */                                                         02200000
*%DIEPLS: ;                                                             02250000
* /* START OF SPECIFICATIONS ****                                       02300000
*                                                                       02350000
*01*  MODULE NAME = IFDIEDAT                                            02400000
*                                                                       02450000
*01*  DESCRIPTIVE NAME = DIE DATA AREA                                  02500000
*                                                                       02550000
*01*  STATUS = OS/VS2 JBB2220                                           02700000
*                                                                       02750000
*01*  FUNCTION = THIS MACRO DESCRIBES THE DATA AREA AT THE              02800000
*                BEGINNING OF THE DIE MODULE (IFDOLT57)                 02850000
*                                                                       02900000
*01*  MODULE TYPE= MACRO                                                02950000
*                                                                       03000000
*02*    PROCESSOR= ASSEMBLER AND PLS                                    03050000
*                                                                       03100000
*01*  CHANGE ACTIVITY = NONE                                            03150000
*             NEW MACRO FOR HBB2102                            @G860PLW 03200000
*          OY03819 - CORRECT ERRORS IN ABNORMAL TERMINATION    @YA03819 03225000
*                                                                       03250000
**** END OF SPECIFICATIONS ***/                                         03300000
   DCL 1 DIEDATA BDY(WORD) BASED(DIEPTR),                               03350000
         3 UNUSED   FIXED(32),          /* UNUSED                    */ 03400000
         3 DIECOMON PTR(31),            /* ADDRESS OF OLTEP COMMON   */ 03450000
         3 DIETCB   PTR(31),            /* ADDRESS OF OLTEP'S TCB    */ 03500000
         3 DIESIZE  FIXED(31),          /* SIZE OF IFDOLT57 (DIE)    */ 03550000
         3 DIEIOCBS,                    /* I/O CONTROL BLOCKS        */ 03600000
           5 DIEIOCB1 FIXED(31),        /* OFFSET TO FIRST SET OF I/O   03650000
                                           CONTROL BLOCKS            */ 03700000
           5 DIEIOCB2 FIXED(31),        /* OFFSET TO SECOND SET OF I/O  03750000
                                           CONTROL BLOCKS            */ 03800000
           5 DIEIOCB3 FIXED(31),        /* OFFSET TO THIRD SET OF I/O   03850000
                                           CONTROL BLOCKS            */ 03900000
         3 DIEMASK  PTR(31),            /* UCB BIT MASK TABLE ADDRESS*/ 03950000
         3 DIEMAP   PTR(31),            /* ADDRESS OF PATH MAP TABLE */ 04000000
         3 DIEASID  FIXED(32),          /* MEMORY ASID FOR THIS OLTEP*/ 04050000
         3 DIESAVE  CHAR(72),           /* SVC-59 SAVE AREA          */ 04100000
         3 DIEABLKS PTR(31),            /* ALLOC SERV RTN PARM LIST  */ 04150000
         3 DIEASSGN (16) PTR(31),       /* ADDR OF ASSIGNED UCBS        04200000
                                                             @YA03819*/ 04250000
         3 DIEGPMSK (16) CHAR(1),       /* GUARANTEED PATH   @YA03819*/ 04300000
         3 DIEATIOS PTR(31),            /* ATTENTION IOSB    @YA03819*/ 04350000
         3 DIEATTIN CHAR(1);            /* ATTENTION INDEX   @YA03819*/ 04400000
