* %      GOTO OECBPLS1;               /* GO TO THE PLS VERSION       */ 00050000
         MACRO                                                          00100000
         IFDOECB                                                        00150000
*%OECBPLS1: ;                                                           00200000
* /* START OF SPECIFICATIONS ****                                       00250000
*                                                                       00300000
*01*  MODULE NAME = IFDOECB                                             00350000
*                                                                       00400000
*01*  DESCRIPTIVE NAME = OLTEP EVENT CONTROL BLOCK                      00450000
*                                                                       00500000
*01*  STATUS = OS/VS2 HBB2102                                           00650000
*                                                                       00700000
*01*  FUNCTION = THIS MACRO MAPS THE OLTEP EVENT CONTROL                00750000
*                BLOCK WHICH CONTAINS STATUS INFORMATION ABOUT          00800000
*                THE OLT'S I/O OPERATION.                               00850000
*                                                                       00900000
*02*    METHOD OF ACCESS = AS FOLLOWS:                                  00950000
*                 PLS - DCL OECBPTR PTR                                 01000000
*                 BAL - USING REGXX,OECB                                01050000
*                                                                       01100000
*01*  MODULE TYPE= MACRO                                                01150000
*                                                                       01200000
*02*    PROCESSOR= ASSEMBLER AND PLS                                    01250000
*                                                                       01300000
*01*  CHANGE ACTIVITY=                                                  01350000
*             NEW MACRO FOR HBB2102                            @G860PLW 01400000
*            **   MAPPING FOR THE SENSE WAS DEFINED            @ZMC3494 01407100
*             INCORRECTLY CAUSING IFDOLT57 TO OVERLAY THE      @ZMC3494 01414200
*             CSW WITH THE SENSE DATA.  THE MACRO IS CHANGED   @ZMC3494 01421300
*             TO MAP THE SENSE AT THE END OF ALL THREE OF THE  @ZMC3494 01428400
*             CSW'S.                                           @ZMC3494 01435500
*            **   FIX TO PCC3494 DID NOT FIX THE PROBLEM       @ZMC3803 01442600
*                                                                       01450000
*  9/10/82 - 3811 OLT CSW OVERLAID                             @OZ63672 01462500
*            PTM PCC3803                                       @OZ63672 01475000
*                                                                       01487500
**** END OF SPECIFICATIONS ***/                                         01500000
* %      GOTO OECBPLS2;                /*                               01550000
         SPACE 1                                                        01600000
OECB     DSECT                                                          01650000
         DS    0CL64                    START OF OLTEP EVENT CNTL BLOCK 01700000
OSNSCNT  DS    CL1                      CNT OF SNS BYTES REQ'D BY OLT   01750000
OINCNT   DS    CL1                      NUMBER OF INTERRUPTS IN OECB    01800000
ORSVD0   DS    CL2                      RESERVED                        01850000
OCSW     DS    3CL8                     3 CSW'S FOR THE 3 EVENTS IN     01900000
*                                       THIS OECB                       01950000
         ORG   OCSW                     MAPPING OF EACH CSW             02000000
OCSWCC   DS    CL1                      CONDITION CODE                  02050000
OCSWCMD1 DS    CL3                      COMMAND ADDRESS                 02100000
OCSWSTS  DS    0CL2                     STATUS BYTES                    02150000
OCSWSTA  DS    CL1                      DEVICE STATUS                   02200000
OCSWSTB  DS    CL1                      SUBCHANNEL STATUS               02250000
OCSWBYT  DS    CL2                      RESIDUAL BYTE COUNT             02300000
OCSWEND  DS    0C                       END OF CSW ENTRY                02350000
         ORG                                                            02366600
*                                                              @ZMC3494 02383200
OSNS     DS    XL36                     SENSE SAVE AREA FOR UNIT CHECK  02400000
*                                       ON THIS REQUEST                 02450000
         MEND                                                           02500000
  */                                                                    02550000
*%OECBPLS2: ;                                                           02600000
   DCL 1 OECB BDY(WORD) BASED(OECBPTR),                                 02650000
         3 OSNSCNT  CHAR(1),            /* SNS CNT REQ'D BY OLT      */ 02700000
         3 OINCNT   CHAR(1),            /* NUM INTS IN THIS OECB     */ 02750000
         3 ORSVD0   CHAR(2),            /* RESERVED                  */ 02800000
         3 OCSW(0:2) CHAR(8),           /* 3 CCW'S FOR EVENTS IN OECB*/ 02850000
           5 OCSWCC   CHAR(1),          /* CONDITION CODE            */ 02900000
           5 OCSW1,                     /* REST OF CSW       @OZ63672*/ 02942800
              7 OCSWCMD  CHAR(3),       /* COMMAND ADDRESS           */ 02985600
              7 OCSWSTS  CHAR(2),       /* CSW STATUS BYTES          */ 03028400
                9 OCSWSTA  CHAR(1),     /* DEVICE STATUS             */ 03071200
                9 OCSWSTB  CHAR(1),     /* SUBCHANNEL STATUS         */ 03114000
              7 OCSWBYT    CHAR(2),     /* RESIDUAL BYTE COUNT       */ 03156800
         3 OSNS       CHAR(36);         /* SENSE SAVE AREA FOR UNIT     03200000
                                           CHECK ON THIS REQUEST      */03250000
