*                                                                       00050000
*        %GOTO LABEL1;                  /*                              00100000
         MACRO                                                          00500020
         IFDPF1 &V,&X,&Z,&S                                     X01906  00515800
.* /* START OF SPECIFICATIONS ****************************************  00531600
.*                                                                      00547400
.*01*  MODULE NAME = IFDPF1                                             00563200
.*                                                                      00579000
.*                                                                      00594800
.*01*  PROPRIETARY STATEMENT =                                          00610600
.*                                                                      00626400
.*      LICENSED MATERIALS - PROPERTY OF IBM                            00642200
.*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     00658000
.*      5695-047 (C) COPYRIGHT IBM CORP. 1990                           00673800
.*      SEE COPYRIGHT INSTRUCTIONS                                      00689600
.*                                                                      00705400
.*02*    STATUS = HBB4420                                         @L1C  00721200
.*                                                                      00737000
.*01*  FUNCTION = THIS MACRO DEFINES AND MAPS ALL CONSTANTS AND         00752800
.*                DATA AREAS THAT MAKE UP THE OLTEP COMMON AREA.        00768600
.*                                                                      00784400
.*01*  MODULE TYPE= MACRO                                               00800200
.*                                                                      00816000
.*02*    PROCESSOR= ASSEMBLER AND PLS                                   00831800
.*                                                                      00847600
.*01*  CHANGE ACTIVITY = AS FOLLOWS:                                    00863400
.*           CHANGES TO SUPPORT HBB2102                        @G860PLW 00879200
.*         ** MCT VALUES AND V-CONS FOR DELETED MODULES HAS    @ZMC2457 00895000
.*           HAVE NOT BEEN DELETED.                            @ZMC2457 00910800
.*         ** WHEN MCT VALUES AND V-CONS FOR DELETED MODULES   @ZMC3363 00926600
.*           WERE DELETED, THE V-CON FOR THE LOADER WAS ALSO   @ZMC3363 00942400
.*           DELETED.                                          @ZMC3363 00958200
.*            THE V-CON FOR IFDOLT12 IS REPLACED.              @ZMC3363 00974000
.*         ** MUST SET FLAG IN SCT SO THAT OLTS WILL KNOW THAT @ZMC3283 00989800
.*           WE ARE EXECUTING IN 370XA MODE.                   @ZMC3283 01005600
.*         ** POINTER MUST BE DEFINED TO SAVE THE IOSB ADDRESS @ZMC3832 01021400
.*           FOR THE OPERATION THAT REQUESTED AN ATTENTION     @ZMC3832 01037200
.*           INTERRUPT.  THE DIE (IFDOLT57) WILL SAVE THE      @ZMC3832 01053000
.*           ADDRESS HERE TO BE USED LATER BY THE ATTENTION    @ZMC3832 01068800
.*           ROUTINE.                                          @ZMC3832 01084600
.*                                                                      01100400
.* 9/10/82 - ATTENTION INTERRUPT NOT BEING DETECTED            @OZ63698 01116200
.*           PTM PCC3832                                       @OZ63698 01132000
.*                                                                      01147800
.*                                                                      01163600
.*  $R1=PROD310  HBB3310 870320 PD88AB: CLEANUP FOR BCP ROLL-UP         01179400
.*  $P1=PC41055  HBB3310 870519 PD88AB: REMOVE UNRESOLVED REFERENCES    01195200
.*                                      TO OBSOLETE LABELS              01211000
.*                                                                      01226800
.*  $D1=DCRR1017 HBB4410 890206 PD88EK: WHEN INCLUDED BY ASM ROUTINES,  01242600
.*                              DEFINES STORAGE LIKE A CSECT, ADDING    01258400
.*                              SIZE, WHEN IT SHOULD ACT LIKE DSECT.    01274200
.*                              WE INSERT A DSECT TO FORCE THIS.        01290000
.*                              -DONE ABOUT 890130                @D1A  01305800
.*                                                                      01321600
.*  $L1=DYNAM    HBB4420 900122 PD88EK: DYNAMIC I/O PLATFORM - reflect  01337400
.*                                      DEVTAB changes, add DEVBUF for  01353200
.*                                      OLT30 processing, add ERRORDEV  01369000
.*                                      for OLT31 message         @L1A  01384800
.*                                                                      01400600
.*  $P2=PH31558  HBB4420 901022 PD88EK: Dynam - add UNDONE bit to       01416400
.*                                      avoid repeated calls to A05I's  01432200
.*                                      Procedure UNDO            @P2A  01448000
.*                                                                      01463800
.**** END OF SPECIFICATIONS ******************************************/ 01479600
         AIF   ('&V' EQ 'DS').SKP1                                      01500020
CHASCT   &V    F&Z .                    SECTION CONTROL TABLE           01538400
         DC    H'00' .                  ROUTINE MASKS                   01576800
         AIF   ('&S' NE 'AOS12').SK0                            X01906  01615200
.SK01    ANOP                                                           01653600
         DC    X'8601' .                OS DRIVER AND SCT LEVEL X01906  01692000
         &V    7F&Z .                   SCT WORD 2 THRU 8       X01906  01730400
         DC    X'08080000' .            SCT WORD 9 - BYTE-1,BIT-4 ,     01768800
.*                                      OLTEP IS IN XA MODE    @ZMC3283 01807200
         &V    7F&Z .                   SCT WORD 10 THRU 16    @ZA15468 01845600
         &V    3&X&Z .                  SCT WORD 17 - 1 BYTE   @ZA15468 01884000
MSSSTAT  &V    &X&Z .                   MSS STATUS BYTE        @ZA15468 01922400
         &V    &X&Z .                   SCT WORD 18 - 1 BYTE   @ZA15468 01960800
CPUID    &V    5&X&Z .                  SPACE FOR CPU ID       @ZA15468 01999200
         &V    2&X&Z .                                         @ZA15468 02037600
         AGO   .SK0A                                            X01906  02076000
.SK0     ANOP                                                   X01906  02114400
         AIF   ('&S' EQ 'MVM22').SK01                                   02152800
         DC    X'8600' .                OS DRIVER               X01906  02191200
         &V    15F&Z .                                         @ZA15468 02229600
         &V    3&X&Z .                                         @ZA15468 02268000
MSSSTAT  &V    &X&Z .                   MSS STATUS BYTE        @ZA15468 02306400
         &V    &X&Z .                                          @ZA15468 02344800
CPUID    &V    5&X&Z .                  SPACE FOR CPU ID       @ZA15468 02383200
         &V    2&X&Z .                                         @ZA15468 02421600
.SK0A    ANOP                                                   X01906  02460000
         DC    A(OLTTAB) .              LINK TABLE ADDRESS              02500020
         DC    A(UTCOM) .               UNIT TEST PASSON AREA POINTER   03000020
         DC    A(EXTBUF) .              EXT BUFFER POINTER              03500020
         AIF   ('&S' NE 'AOS12').SKP2                                   03550000
.SK0B    ANOP                                                           03600000
         DC    V(IFDOLT00) .            INITIALIZATION MODULE  X02008   03650000
LGWRTCT  DC    10F'00' .                LAST SCT WORDS         X02008   03700000
         AGO   .SK1                                                     03750000
.SKP1    ANOP                                                           04500020
COMMAP   DSECT                                                     @D1A 04550000
         DS    0F                                                  @D1C 04600000
CHASCT   &V    17F&Z .                  SECTION CONTROL TABLE  @ZA15468 04650000
         &V    3&X&Z .                                         @ZA15468 04700000
MSSSTAT  &V    1&X&Z .                  MSS STATUS BYTE        @ZA15468 04750000
         &V    &X&Z .                                          @ZA15468 04800000
CPUID    &V    5&X&Z .                  SPACE FOR CPU ID       @ZA15468 04850000
         &V    2&X&Z .                                         @ZA15468 04900000
         &V    3F&Z .                                          @ZA15468 04950000
         DS    A                        INITIALIZATION MODULE      @R1A 05000000
LGWRTCT  DS    10F                      LAST SCT WORDS             @R1A 05050000
         AGO   .SK1                                                @R1A 05100000
.SKP2    ANOP                                                           05500020
         AIF   ('&S' EQ 'MVM22').SK0B                                   05550000
         &V    F&Z .                    POINTER FOR FUTURE EXPANSION    06000020
         AIF   ('&S' NE 'AOS12').SK1                            X01906  06050000
LGWRTCT  &V    10F&Z .                  LAST SCT WORDS         X02008   06100000
.SK1     ANOP                                                   X01906  06150000
INBUFPTR &V    F&Z .                    ADDRESS OF ITEM IN BUFFER       06500020
INBUFR   &V    72&X&Z .                 INPUT BUFFER                    07000020
PRTBUFR  &V    124&X&Z .                PRINTING BUFFER                 07500020
SECPTR   &V    F&Z .                    ACTIVE SECTION ENTRY POINT      08000020
UTENT    &V    F&Z .                    FIRST UTS INSTRUCTION           08500020
         AIF   ('&V' EQ 'DS').SKP6                                      09000020
DATPTR   DC    V(IFDOLT52) .            PTR TO DP ROOT MODULE           09050000
DATIND   DC    X'A404' .                OLTEP DATA INDICATOR            10000020
         AGO   .SKP7                                                    10500020
.SKP6    ANOP                                                           11000020
DATPTR   DS    F .                      PTR TO DP ROOT MODULE           11050000
DATIND   DS    2C .                     OLTEP DATA INDICATOR            12000020
.SKP7    ANOP                                                           12500020
PGMTAB   &V    8&X&Z .                  ACTIVE PROGRAM ID               13000020
SECLST   &V    138&X&Z .                SECTION LIST                    13500020
APPTRS   DS    0CL12 .                  APPENDAGE POINTERS       Y02008 13550000
PCIEXIT  &V    F&Z .                    PTR TO PCI EXIT          Y02008 13600000
NORMEXIT &V    F&Z .                    PTR TO NORMAL EXIT RTN   Y02008 13650000
ABNMEXIT &V    F&Z .                    PTR TO ABNORMAL EXIT RTN Y02008 13700000
DIEPTR   &V    F&Z .                    PTR TO DIS INT EXIT      Y02008 13750000
IOSCB    DS    0CL136 .                 IOS CONTROL BLOCK        Y02008 13800000
MODIOSB  DS    0CL108 .                 MODEL OF IOSB            Y02008 13850000
         &V    108&X&Z .                                         Y02008 13900000
MODUSECB DS    0CL24 .                  MODEL OF USE CONTROL BLK Y02008 13950000
         &V    24&X&Z .                                          Y02008 14000000
OECBWRD1 DS    0F .                     OECB WORD 1              Y02008 14050000
OECBSNSC &V    &X&Z .                   OECB SENSE COUNT         Y02008 14100000
OECBINCT &V    &X&Z .                   OECB INTERRUPT COUNT     Y02008 14150000
OECBX    &V    2&X&Z .                                           Y02008 14200000
EFCTRCB  DS    0CL20 .                  IO EFFECTOR CONTROL BLK  Y02008 14250000
CCWPTR   &V    F&Z .                    CCW PTR                  Y02008 14300000
DVTPTR   &V    F&Z .                    DEVICE TABLE PTR         Y02008 14350000
FLGA     &V    &X&Z .                   FLAG BYTE A              Y02008 14400000
BYPASPFX EQU   X'80' .                  BYPASS FUNCTION          Y02008 14450000
CEDEPOST EQU   X'40' .                  CE-DE SEPARATION         Y02008 14500000
GDP      EQU   X'20' .                  GUARANTEED DEVICE PATH   Y02008 14550000
SPEXPOS  EQU   X'10' .                  SPECIFIC EXPOSURE        Y02008 14600000
FLGB     &V    &X&Z .                   FLAG BYTE B              Y02008 14650000
INTERNL  EQU   X'80' .                  INTERNAL CALL FOR IO       @R1C 14700000
ATTNIN   EQU   X'40' .                  ATTENTION FUNCTION       Y02008 14750000
MODEREQ  EQU   X'40' .                  MODSET REQUESTED           @R1C 14800000
VIRTCCWS EQU   X'20' .                  VIRTUAL CCW CHAIN        Y02008 14850000
OLDTECBX EQU   X'10' .                  OLD TECB IS IN USE       Y02008 14900000
FILEMSK  &V    &X&Z .                   FILE M ASK               Y02008 14950000
SNSCNT   &V    &X&Z .                   SENSE COUNT              Y02008 15000000
TECBPTRX &V    F&Z .                    TECB POINTER             Y02008 15050000
SEEKPTR  &V    F&Z .                    PTR TO OLD OLT SEEK ADDR Y02008 15100000
         AIF   ('&V' EQ 'DS').SKP7A                                     15150000
IORTNADR DC    V(IOEFFCTR) .            PTR TO IO EFFECTOR       Y02008 15200000
         AGO   .SKP7B                                                   15250000
.SKP7A   ANOP                                                           15300000
IORTNADR &V    F&Z .                    PTR TO IO EFFECTOR       Y02008 15350000
.SKP7B   ANOP                                                           15400000
IODEVTAB DS    0CL36 .                  IO DEVICE TABLE          Y02008 15450000
IOENTRY1 DS    0CL12 .                  FIRST IO ENTRY           Y02008 15500000
IODEV1   &V    F&Z .                    PTR TO 1ST DEVICE        Y02008 15550000
IOSBPTR1 &V    F&Z .                    PTR TO IOSB FOR DEVICE 1 Y02008 15600000
IOECB1   &V    F&Z .                    ECB FOR DEVICE 1         Y02008 15650000
IOENTRY2 DS    0CL12 .                  SECOND IO ENTRY          Y02008 15700000
IODEV2   &V    F&Z .                    PTR TO 2ND DEVICE        Y02008 15750000
IOSBPTR2 &V    F&Z .                    PTR TO IOSB FOR DEVICE 2 Y02008 15800000
IOECB2   &V    F&Z .                    ECB FOR DEVICE 2         Y02008 15850000
IOENTRY3 DS    0CL12 .                  THIRD IO ENTRY           Y02008 15900000
IODEV3   &V    F&Z .                    PTR TO 3RD DEVICE        Y02008 15950000
IOSBPTR3 &V    F&Z .                    PTR TO IOSB FOR DEVICE 3 Y02008 16000000
IOECB3   &V    F&Z .                    ECB FOR DEVICE 3         Y02008 16050000
SELAFFN  &V    2&X&Z .                  SELECTED AFFN            Y02008 16100000
CHARAFFN &V    2&X&Z .                  CHAR REP OF SEL AFFN     Y02008 16150000
NSTBUFF  &V    F&Z  .                   4K NST BUFFER ADDR     @Z38NFAA 16200000
ATTNADDR &V    F&Z                      ADDRESS OF IFDOLT85    @G860PLW 16250000
ATNINDEX &V    X'3C'                    OLTEPS ATTENTION INDEX @G860PLW 16300000
         &V    3X&Z                     RESERVED               @G860PLW 16350000
ATTNIOSB &V    F&Z                      ADDR OF ATTN IOSB      @OZ63698 16400000
XXXXXXXX &V    14F&Z .                  NOT USED AT PRESENT        @L1C 16450000
         AIF   ('&V' EQ 'DS').SKP3                                      19000020
DEVBUF   DC    CL72' '                  Use if Dev is Slash        @L1A 19046800
DEVTBPTR DC    A(DEVTAB)                POINTER TO DEVICE TABLES 21050  19093600
TABLNGTH DC    AL2(96)                  LENGTH OF DEVTAB ENTRY     @L1C 19140400
CESWT9   DC    X'00'                    OLTEP SWITCHES                  19187200
CDSEQU   EQU   X'80'                    CDS EQUATE REQ             @R1A 19234000
RESTBENT EQU   X'40'                    RESIDENT TABLE ENTRY       @R1A 19280800
VRCAP    EQU   X'20'                    VIRTUAL OR REAL OLT        @R1A 19327600
*        EQU   X'10'                    UNUSED                     @R1A 19374400
*        EQU   X'08'                    UNUSED                     @R1A 19421200
MIXDEV   EQU   X'04'                    CHECK DEV. ENTRY SYM.      @R1A 19468000
*        EQU   X'02'                    UNUSED                     @R1A 19514800
OLTTERM  EQU   X'01'                    TERM. TEST SECTION         @R1A 19561600
CESWT10  DC    X'00' .                  OLTEP SWITCHES           Y02008 19608400
MPSYS    EQU   X'80'                    MP SYSTEM                  @R1A 19655200
AFFNSET  EQU   X'40'                    AFFN SET                   @R1A 19702000
VERBCALL EQU   X'20'                    VERB SELECTION             @R1A 19748800
CHPIDRQD EQU   X'10'                    GPD CALL                   @R1A 19795600
*        EQU   X'08'                    UNUSED                     @R1A 19842400
*        EQU   X'04'                    UNUSED                     @R1A 19889200
*        EQU   X'02'                    UNUSED                     @R1A 19936000
*        EQU   X'01'                    UNUSED                     @R1A 19982800
         AIF   ('&S' NE 'AOS12').SK2                            X01906  20029600
.SK1A    ANOP                                                           20076400
OPEN2    DC    F'0' .                   WAS PTR TO IOS MOD              20123200
OPEN3    DC    F'0' .                   WAS PTR TO APP. VECTOR TABLE    20170000
         AGO   .SK2A                                            X01906  20216800
.SK2     ANOP                                                   X01906  20263600
         AIF   ('&S' EQ 'MVM22').SK1A                                   20310400
OPEN2    DC    F'0' .                   WAS PTR TO IOS MOD              20357200
OPEN3    DC    F'0' .                   WAS PTR TO APP. VECTOR TABLE    20404000
.SK2A    ANOP                                                   X01906  20450800
PSCT     DC    A(CHASCT) .              ADDRESS OF CHASCT               20500020
DEVDEPAD &V    A(CHASCT+12) .           ACTIVE CHASCT ENTRY POINTER     21000020
TABAD    DC    A(OLTTAB) .              UNIT TEST LINK TABLE POINTER    21500020
#TABLE   EQU   TABAD .                  LABEL IN OLTEP MACROS           22000020
UTCOMAD  DC    A(UTCOM) .               UNIT TEST PASSON AREA POINTER   22500020
MCT      &V    C'1MCT' .                MODULE CONTROL TABLE            23000020
         AIF   ('&S' EQ 'MVM22').SK2A1                                  23050000
         DC    F'00' .                  PTR TO NEXT MCT                 23100000
         AGO   .SK2A2                                                   23150000
.SK2A1   ANOP                                                           23200000
         DC    A(NEXTMCT) .             PTR TO NEXT MCT          X03008 23250000
.SK2A2   ANOP                                                           23300000
         DC    X'8000' .                ROOT MODULE INDICATOR           24000020
         DC    C'00' .                  OLTEP ROOT                      24500020
         DC    XL2'00' .                MODULE LENGTH                   25000020
         AIF   ('&S' EQ 'AOS12').SK3A                                   25050000
         AIF   ('&S' EQ 'MVM22').SK3A                                   25100000
         DC    X'8000' .                ROOT MODULE INDICATOR           25500020
         DC    C'01' .                  TRANSIENT MANAGER ID            26000020
         DC    XL2'00' .                MODULE LENGTH                   26500020
.SK3A    ANOP                                                           26521700
         AIF   ('&S' NE 'MVM22').SK3C                                   26543400
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26565100
         DC    C'00' .                  OLD EXIO ID            @ZMC2457 26586800
         DC    XL2'00' .                MODULE LENGTH            X03008 26608500
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26630200
         DC    C'00' .                  OLD WAITIO ID          @ZMC2457 26651900
         DC    XL2'00' .                MODULE LENGTH            X03008 26673600
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26695300
         DC    C'00' .                  OLD DPRINT ID          @ZMC2457 26717000
         DC    XL2'00' .                MODULE LENGTH            X03008 26738700
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26760400
         DC    C'00' .                  COMPARE ID             @ZMC2457 26782100
         DC    XL2'00' .                MODULE LENGTH            X03008 26803800
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26825500
         DC    C'00' .                  OLD CONVERT ID         @ZMC2457 26847200
         DC    XL2'00' .                MODULE LENGTH            X03008 26868900
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 26890600
         DC    C'00' .                  RANDOM DATA ID         @ZMC2457 26912300
         DC    XL2'00' .                MODULE LENGTH            X03008 26934000
         AGO   .SK3E                                                    26955700
.SK3C    ANOP                                                           26977400
         DC    X'0100' .                OLD MODULE INDICATOR            27000020
         DC    C'05' .                  OLD EXIO ID                     27500020
         DC    XL2'00' .                MODULE LENGTH                   28000020
         DC    X'0100' .                OLD MODULE INDICATOR            28500020
         DC    C'06' .                  OLD WAITIO ID                   29000020
         DC    XL2'00' .                MODULE LENGTH                   29500020
         DC    X'0100' .                OLD MODULE INDICATOR            30000020
         DC    C'08' .                  OLD DPRINT ID                   30500020
         DC    XL2'00' .                MODULE LENGTH                   31000020
         DC    X'0100' .                OLD MODULE INDICATOR            31500020
         DC    C'09' .                  OLD COMPARE ID                  32000020
         DC    XL2'00' .                MODULE LENGTH                   32500020
         DC    X'0100' .                OLD MODULE INDICATOR            33000020
         DC    C'10' .                  OLD CONVERT ID                  33500020
         DC    XL2'00' .                MODULE LENGTH                   34000020
         DC    X'0100' .                OLD MODULE INDICATOR            34500020
         DC    C'11' .                  OLD RDATA ID                    35000020
         DC    XL2'00' .                MODULE LENGTH                   35500020
         AIF   ('&S' NE 'AOS12').SK3G                                   35510800
.SK3E    ANOP                                                           35521600
         DC    X'8000' .                ROOT MODULE INDICATOR  X02008   35532400
         DC    C'12' .                  UTS LOADER ID          X02008   35543200
         DC    XL2'00' .                MODULE LENGTH          X02008   35554000
         AGO   .SK3H                                                    35564800
.SK3G    ANOP                                                           35575600
         AIF   ('&S' EQ 'MVM22').SK3E                                   35586400
.SK3H    ANOP                                                           35597200
         AIF   ('&S' NE 'MVM22').SK3J                                   35608000
         DC    X'0000' .                ROOT MODULE INDICATOR  @ZMC2457 35618800
         DC    C'00' .                  OLD CECOM ID           @ZMC2457 35629600
         DC    XL2'00' .                MODULE LENGTH            X03008 35640400
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35651200
         DC    C'39' .                  NEW DPRINT ID            X03008 35662000
         DC    XL2'00' .                MODULE LENGTH            X03008 35672800
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35683600
         DC    C'16' .                  GETCONFG ID              X03008 35694400
         DC    XL2'00' .                MODULE LENGTH            X03008 35705200
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35716000
         DC    C'21' .                  GRAB ID                  X03008 35726800
         DC    XL2'00' .                MODULE LENGTH            X03008 35737600
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35748400
         DC    C'22' .                  ALLOCATE ID              X03008 35759200
         DC    XL2'00' .                MODULE LENGTH            X03008 35770000
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35780800
         DC    C'24' .                  READD ID                 X03008 35791600
         DC    XL2'00' .                MODULE LENGTH            X03008 35802400
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35813200
         DC    C'26' .                  LOGSCAN ID               X03008 35824000
         DC    XL2'00' .                MODULE LENGTH            X03008 35834800
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35845600
         DC    C'28' .                  PLINK ID                 X03008 35856400
         DC    XL2'00' .                MODULE LENGTH            X03008 35867200
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35878000
         DC    C'35' .                  NEW EXIO ID              X03008 35888800
         DC    XL2'00' .                MODULE LENGTH            X03008 35899600
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35910400
         DC    C'36' .                  NEW WAITIO ID            X03008 35921200
         DC    XL2'00' .                MODULE LENGTH            X03008 35932000
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 35942800
         DC    C'37' .                  NEW CECOM ID             X03008 35953600
         DC    XL2'00' .                MODULE LENGTH            X03008 35964400
         AGO   .SK3K                                                    35975200
.SK3J    ANOP                                                           35986000
         DC    X'0100' .                OLD MODULE INDICATOR            36000020
         DC    C'13' .                  OLD CECOM ID                    36500020
         DC    XL2'00' .                MODULE LENGTH                   37000020
         DC    X'8000' .                ROOT MODULE INDICATOR           37500020
         DC    C'39' .                  DPRINT MODULE ID                38000020
         DC    XL2'00' .                MODULE LENGTH                   38500020
.SK3K    ANOP                                                           38517200
         AIF   ('&S' NE 'MVM22').SK3M                                   38534400
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 38551600
         DC    C'41' .                  NEW CONVERT ID           X03008 38568800
         DC    XL2'00' .                MODULE LENGTH            X03008 38586000
         DC    V(IFDOLT00) .            OLTEP ADDRESS            X03008 38603200
         DC    F'0'                     OLD EXIO ADDRESS       @ZMC2457 38620400
         DC    F'0'                     OLD WAITIO ADDRESS     @ZMC2457 38637600
         DC    F'0'                     OLD DPRINT ADDRESS     @ZMC2457 38654800
         DC    F'0'                     COMPARE ADDRESS        @ZMC2457 38672000
         DC    F'0'                     OLD CONVERT ADDRESS    @ZMC2457 38689200
         DC    F'0'                     RANDOM DATA ADDRESS    @ZMC2457 38706400
         DC    V(IFDOLT12) .            LOADER ADDRESS         @ZMC3363 38723600
         DC    F'0'        .            OLD CECOM ADDRESS      @ZMC2457 38740800
PARPRADR DC    V(IFDOLT39) .            NEW DPRINT ADDRESS       X03008 38758000
         DC    V(IFDOLT16) .            GETCONFG ADDRESS         X03008 38775200
         DC    V(IFDOLT21) .            GRAB ADDRESS             X03008 38792400
         DC    V(IFDOLT22) .            ALLOCATE ADDRESS         X03008 38809600
         DC    V(IFDOLT24) .            READD ADDRESS            X03008 38826800
         DC    V(IFDOLT26) .            LOGSCAN ADDRESS          X03008 38844000
         DC    V(IFDOLT28) .            PLINK ADDRESS            X03008 38861200
         DC    V(IFDOLT35) .            NEW EXIO ADDRESS         X03008 38878400
         DC    V(IFDOLT36) .            NEW WAITIO ADDRESS       X03008 38895600
         DC    V(IFDOLT37) .            NEW CECOM ADDRESS        X03008 38912800
         DC    V(IFDOLT41) .            NEW CONVERT ADDRESS      X03008 38930000
MCT1ADR  DC    A(MCT) .                 MCT ADDRESS              X03008 38947200
         AGO   .SKP4                                                    38964400
.SK3M    ANOP                                                           38981600
         DC    10XL6'00' .              REST OF MCT                     39000020
         DC    V(IFDOLT00) .            OLTEP ADDRESS                   39500020
         AIF   ('&S' NE 'AOS12').SK4                            X01906  39550000
         DC    6F'00' .                 MODULE ADDRESSES       X02008   39600000
         DC    V(IFDOLT12) .            UTS LOADER              X01906  39650000
         DC    F'00' .                  MODULE ADDRESS         X02008   39700000
         AGO   .SK4A                                            X01906  39750000
.SK4     ANOP                                                   X01906  39800000
         DC    8F'00' .                 MODULE ADDRESSES                40000020
.SK4A    ANOP                                                   X01906  40050000
PARPRADR DC    V(IFDOLT39) .            DPRINT MODULE ADDRESS           40500020
         DC    10F'00' .                MODULE ADDRESSES                41000020
MCT1ADR  DC    A(MCT) .                 MCT ADDRESS                     41500020
         AGO   .SKP4                                                    42000020
.SKP3    ANOP                                                           42500020
DEVBUF   DS    72C                      Use if Dev is Slash        @L1A 42550000
DEVTBPTR DS    F .                      POINTER TO DEVICE TABLES 21050  42600000
TABLNGTH DS    2C .                     LENGTH OF DEVTAB ENTRY   21050  42650000
CESWT9   DS    C .                      OLTEP SWITCHES                  42700000
CDSEQU   EQU   X'80'                    CDS EQUATE REQ             @R1A 42750000
RESTBENT EQU   X'40'                    RESIDENT TABLE ENTRY       @R1A 42800000
VRCAP    EQU   X'20'                    VIRTUAL OR REAL OLT        @R1A 42850000
*        EQU   X'10'                    UNUSED                     @R1A 42900000
*        EQU   X'08'                    UNUSED                     @R1A 42950000
MIXDEV   EQU   X'04'                    CHECK DEV. ENTRY SYM.      @R1A 43000000
*        EQU   X'02'                    UNUSED                     @R1A 43050000
OLTTERM  EQU   X'01'                    TERM. TEST SECTION         @R1A 43100000
CESWT10  DS    X'00' .                  OLTEP SWITCHES           Y02008 43150000
MPSYS    EQU   X'80'                    MP SYSTEM                  @R1A 43200000
AFFNSET  EQU   X'40'                    AFFN SET                   @R1A 43250000
VERBCALL EQU   X'20'                    VERB SELECTION             @R1A 43300000
CHPIDRQD EQU   X'10'                    GPD CALL                   @R1A 43350000
*        EQU   X'08'                    UNUSED                     @R1A 43400000
*        EQU   X'04'                    UNUSED                     @R1A 43450000
*        EQU   X'02'                    UNUSED                     @R1A 43500000
*        EQU   X'01'                    UNUSED                     @R1A 43550000
OPEN2    DS    F .                      WAS PTR TO IOS MOD       Y02008 43600000
OPEN3    DS    F .                      WAS PTR TO APP. VECTOR TABLE    43650000
PSCT     DS    F .                      ADDRESS OF CHASCT               44000020
DEVDEPAD DS    F .                      ACTIVE CHASCT ENTRY POINTER     44500020
TABAD    DS    F .                      UNIT TEST LINK TABLE POINTER    45000020
#TABLE   EQU   TABAD .                  LABEL IN OLTEP MACROS           45500020
UTCOMAD  DS    F .                      UNIT TEST PASSON AREA POINTER   46000020
MCT      DS    208C .                   MODULE CONTROL TABLE            46500020
PARPRADR EQU   MCT+164 .                DPRINT MODULE ADDRESS           47000020
MCT1ADR  DS    F .                      MCT ADDRESS                     47500020
.SKP4    ANOP                                                           48000020
WKSVC    &V    4F&Z .                   SVC WORK AREA                   48500020
ROPTM4   EQU   MCT1ADR+4 .              SVC PARAMETER LIST MINUS 4 @R1A 48550000
ROPT     EQU   MCT1ADR+8 .              SVC PARAMETER LIST         @R1C 48600000
ROPTP4   EQU   MCT1ADR+12 .             SVC PARAMETER LIST PLUS 4  @R1A 48650000
ROPTP8   EQU   MCT1ADR+16 .             SVC PARAMETER LIST PLUS 8  @R1A 48700000
OLTTAB   &V    10F&Z .                  LINK TABLE                      49500020
TAB28    EQU   OLTTAB+28 .              NEW MACRO ENTRY POINT           50000020
LOGADR   &V    F&Z .                    POINTER TO LOGSCAN MODULE       50500020
SCHEDSA  &V    F&Z .                    SAVE AREA IN SCHEDULER          51000020
SATAB    &V    3F&Z .                   SYSTEM ASSIGNMENT TABLE         51500020
PLKMOR   &V    4F&Z .                   PLINK AND MORECORE MANAGEMENT   52000020
REGX     &V    F&Z .                    ACTIVE UCB ADDRESS POINTER      53500020
TUCBAD1  &V    F&Z .                    FIRST ACTIVE UCB ADDRESS        54000020
TUCBAD2  &V    F&Z .                    SECOND ACTIVE UCB ADDRESS       54500020
TSTDEBAD &V    F&Z .                    TEST DEB ADDRESS                55000020
ECB3     &V    F&Z .                    ECB FOR DYN COMMUNICATIONS      55500020
UTCOM    &V    16F&Z .                  UNIT TEST PASSON AREA           56000020
EXTBUF   &V    14F&Z .                  EXT BUFFER                      56500020
DPRDEBAD &V    F&Z .                    DPRINT MODULE DEB ADDRESS       57000020
PRIDVPTR &V    F&Z .                    ACTIVE PRIME DEVTAB             57500020
SECDVPTR &V    F&Z .                    LAST GRAB DEVICE                58000020
         AIF   ('&V' EQ 'DS').SKP9                                      58500020
REDEFINE DC    V(CECINP03) .            CE COMM ENTRY IN IFDOLT30Y02906 58550000
COMMINT  DC    V(FISTERR) .             DYN COMM ENTRY - IFDOLT30Y02906 58600000
NEXTREC  DC    V(CECINP02) .            NEXT INPUT REC-IFDOLT30  Y02906 58650000
         AGO   .SK10                                                    60500020
.SKP9    ANOP                                                           61000020
REDEFINE &V    F&Z .                    CE COMM ENTRY IN IFDOLT30Y02906 61050000
COMMINT  &V    F&Z .                    DYN COMM ENTRY - IFDOLT30Y02906 61100000
NEXTREC  &V    F&Z .                    NEXT INPUT REC-IFDOLT30  Y02906 61150000
.SK10    ANOP                                                           63000020
ADSVAREA &V    F&Z .                 IFDOLT30 1ST SAVE ADDRESS          63500020
ECB37    &V    F&Z .                    CECOM ECB                       64000020
REPLY37  &V    18F&Z .                  CECOM INPUT BUFFER              64500020
MSGAD37  &V    F&Z .                    OLTS BUFFER ADDRESS             65000020
TPSAVE   &V    4&X&Z .                  TEST ID                         65500020
TLCOUNT  &V    H&Z .                    TEST LOOP COUNT                 66000020
HRTSEL   &V    2&X&Z .                  HIGHEST ROUTINE SELECTED        66500020
SAVECNT &V     H&Z .                    COUNTER FOR DEVICE DECODERS     66547000
         &V    H&Z .                    TEST LOOP RUN           X01906  66594000
SAVENT   &V    F&Z .                    LAST INCLUSIVE SERIES ENTRY     66641000
CESWT    &V    9&X&Z .                  OLTEP SWITCHES GROUPED          66688000
LEGALTST EQU   X'80'               LEGAL TEST ENTRY               @R1A  66735000
PROTECT  EQU   X'40'               DO DP FOR SEC DEV              @R1A  66782000
OUTS     EQU   X'20'               OLD OLT LOADED                 @R1A  66829000
NUTS     EQU   X'10'               NEW OLT LOADEDRY               @R1A  66876000
LEGALDEV EQU   X'08'               LEGAL DEVICE ENTRY             @R1A  66923000
REINT    EQU   X'04'               NEW D/T/O ENTRY                @R1A  66970000
FERINT   EQU   X'02'               COMMUNICATION INTERVAL         @R1A  67017000
*        EQU   X'01'               UNUSED                         @R1A  67064000
CESWT1   EQU   CESWT+1 .           OLTEP SWITCHES                       67111000
RTNFLD   EQU   X'80'               ROUTINES SELECTED              @R1A  67158000
SKTST    EQU   X'40'                                              @R1A  67205000
*        EQU   X'20'               UNUSED                         @R1A  67252000
WAITFG   EQU   X'10'               WAITIO NEEDED                  @R1A  67299000
FILMSK   EQU   X'08'               ALLOW MODESET CHANGE           @R1A  67346000
NSTDK    EQU   X'04'               NST DISK IN USE                @R1A  67393000
ONLINEOK EQU   X'02'               ONLINE TESTING OKAY            @R1A  67440000
TPFLAG   EQU   X'01'               UNITS CTR > 1                  @R1A  67487000
CESWT2   EQU   CESWT+2 .           OLTEP SWITCHES                       67534000
NDCFO    EQU   X'80'               NO DYN COMM FOR OLTEP          @R1A  67581000
*        EQU   X'40'               UNUSED                         @R1A  67628000
FECOND   EQU   X'20'               FIRST ERROR CONDITION          @R1A  67675000
*        EQU   X'10'               UNUSED                         @R1A  67722000
INITENT  EQU   X'08'               OPTION ENTRY DECODED           @R1A  67769000
NDR      EQU   X'04'               NDR ENTRY                      @R1A  67816000
TAPEHDR  EQU   X'02'               TABLE LABEL TO RSTORE          @R1A  67863000
*        EQU   X'01'               UNUSED                         @R1A  67910000
CESWT3   EQU   CESWT+3 .           OLTEP SWITCHES                       67957000
TALKVERB EQU   X'80'               TALK REQUESTED                 @R1A  68004000
BYPALDEV EQU   X'40'               STOP SCHEDULING DEVS           @R1A  68051000
BYPDEV   EQU   X'20'               STOP TSTNG CURRENT DEV         @R1A  68098000
GRBCNTL  EQU   X'10'               GRAB MACRO ISSUED              @R1A  68145000
SUSDEL   EQU   X'08'               MODULE CAN BE DELETED          @R1A  68192000
TP1419   EQU   X'04'               TP DEVICES IN SYSTEM           @R1A  68239000
CDEXIST  EQU   X'02'               CDS LIBRARY EXISTS             @R1A  68286000
NODP     EQU   X'01'               CANT DO DATA PROTECT           @R1A  68333000
CESWT4   EQU   CESWT+4 .           OLTEP SWITCHES                       68380000
RSTRFLG  EQU   X'80'               PAGE RESTOR-BYPASS WTO         @R1A  68427000
DPRFLG   EQU   X'40'               USE DPRINT 2ND SVREA           @R1A  68474000
WAITFLG  EQU   X'20'               BYPASS DPRINT INT WAIT         @R1A  68521000
WRTFLG   EQU   X'10'               DPRINT WRITE REQUEST           @R1A  68568000
*        EQU   X'08'               UNUSED                         @R1A  68615000
WTORFLG  EQU   X'04'               DPRINT WTOR REQUEST            @R1A  68662000
RPLYFLG  EQU   X'02'               REPLY EXPECTED                 @R1A  68709000
WTOFLG   EQU   X'01'               DPRINT WTO REQUEST             @R1A  68756000
CESWT5   EQU   CESWT+5 .           OLTEP SWITCHES                       68803000
HDRFLG   EQU   X'80'                PRINT HEADER LINE             @R1A  68850000
RSLTFLG  EQU   X'40'               PRINT RESULTS                  @R1A  68897000
FFEFLG   EQU   X'20'               1ST ERROR HAS OCCURRED         @R1A  68944000
FCEFLG   EQU   X'10'               1ST CAT ERROR OCCURRED         @R1A  68991000
PFEMSG   EQU   X'08'               PRINT 1ST ERROR MSG            @R1A  69038000
PCEMSG   EQU   X'04'               PRINT CAT ERROR MSG            @R1A  69085000
SYMBFLG  EQU   X'02'               SYMBOLIC NAME IN HDR           @R1A  69132000
PRNTOPTN EQU   X'01'               PRT PRIOR OPTIONS MSG          @R1A  69179000
CESWT6   EQU   CESWT+6 .           OLTEP SWITCHES                       69226000
UTSCAL   EQU   X'80'               UNIT TEST MACRO CALL           @R1A  69273000
ATM      EQU   X'40'               PRINT * ON TERM MSG            @R1A  69320000
EOFBIT   EQU   X'20'               RESET INTERNAL SWITCHS         @R1A  69367000
PFPMSG   EQU   X'10'               PRT FP MSG-CANCEL OLT          @R1A  69414000
CODE5    EQU   X'08'               REPEAT TESTS                   @R1A  69461000
NORUN    EQU   X'04'               DONT RUN SCHEDULED TST         @R1A  69508000
SECRUN   EQU   X'02'               SCHEDULED TEST DONE            @R1A  69555000
RTSTAE   EQU   X'01'               ENTRY TO STAE                  @R1A  69602000
CESWT7   EQU   CESWT+7 .           OLTEP SWITCHES                       69649000
INCLST   EQU   X'80'               INCLUSIVE DEVICE ENTRY         @R1A  69696000
RETTO31  EQU   X'40'               NOT ALL DEVICES VALID          @R1A  69743000
REMOTE   EQU   X'20'               REMOTE TRM IN DEV NTRY         @R1A  69790000
*        EQU   X'10'               UNUSED                         @R1A  69837000
*        EQU   X'08'               UNUSED                         @R1A  69884000
*        EQU   X'04'               UNUSED                         @R1A  69931000
VIRTUAL  EQU   X'02'               RUNNING IN VIRTUAL             @R1A  69978000
GOTINPUT EQU   X'01'               ENTRY TO D/T/O                 @R1A  70025000
CESWT8   EQU   CESWT+8 .           OLTEP SWITCHES                       70072000
LISTFIX  EQU   X'80'               INCLUSIVE DEVICE ENTRY         @R1A  70119000
UNDONE   EQU   X'40'               Proc UNDO was already invoked  @P2C  70166000
*        EQU   X'20'               UNUSED                         @R1A  70213000
READDCHK EQU   X'10'               READD ENTERED                  @R1A  70260000
OLTINVV  EQU   X'08'               OLT IN VERTUAL                 @R1A  70307000
SUTMSG   EQU   X'04'               MSG 158I ISSUED                @R1A  70354000
SNEWRUN  EQU   X'02'               NEW TEST RUN                   @R1A  70401000
TALKHERE EQU   X'01'               TALK VERB ENTERED              @R1A  70448000
DYNCOM   &V    &X&Z .                   RESPONSE BUFFER DYN MSG         70500020
SECTUSE  &V    &X&Z .                   NUMBER OF SECTIONS RUN          71000020
UNICTR   &V    &X&Z .                   NUMBER OF UNITS TO RUN          71500020
UNITUSE  &V    &X&Z .                   NUMBER OF UNITS RUN             72000020
DPLEVEL  &V    &X&Z .                   MESSAGE PRINTING LEVEL          72500020
CNT37    &V    &X&Z .                   LENGTH OF CECOM REPLY           73000020
READDSV  &V    6&X&Z .                  READD SAVE AREA                 73500020
         &V    3&X&Z .                  NA                      X01906  73550000
         AIF   ('&V' EQ 'DS').SKP5                                      74000020
READDMOD &V    V(IFDOLT51) .            READD MODULE ADDRESS            74500020
RDCBPTR  &V    V(READDCB) .             READD DCB IN IFDOLT51    Y02906 74550000
MSGMOD   &V    V(IFDMSG00) .            RESIDENT MESSAGE MODULE         75500020
ENDJOB   &V    F&Z .                    INITIALIZATION SAVE AREA        76000020
MHRPTR   DC    F'0'                 REMOVED REFERENCE TO IFDOLT55  @P1C 76050000
RTALKBUF DC    F'0'                 REMOVED REFERENCE TO DEDBUF    @P1C 76100000
RINBUF   DC    F'0'                 REMOVED REFERENCE TO REMINBUF  @P1C 76150000
REIDCBPT DC    F'0'                 REMOVED REFERENCE TO REIDCB    @P1C 76200000
REIOBPTR DC    F'0'                 REMOVED REFERENCE TO REIOB     @P1C 76250000
         AGO   .SKP8                                                    79000020
.SKP5    ANOP                                                           79500020
READDMOD &V    F .                      READD MODULE ADDRESS            80000020
RDCBPTR  &V    F .                      READD DCB IN IFDOLT51    Y02906 80050000
MSGMOD   &V    F .                      RESIDENT MESSAGE MODULE         81000020
ENDJOB   &V    F&Z .                    INITIALIZATION SAVE AREA        81050000
MHRPTR   DS    F .                      POINTER TO MESSAGE HANDLER @R1C 81100000
RTALKBUF DS    F .                      PTR TO DED BUFR-IFDOLT55   @R1C 81150000
RINBUF   DS    F .                      PTR REMOTE INBUFR-IFDOLT55 @R1C 81200000
REIDCBPT DS    F .                      PTR TO REI DCB-IFDOLT55    @R1C 81250000
REIOBPTR DS    F .                      PTR TO REI IOB-IFDOLT55    @R1C 81300000
.SKP8    ANOP                                                           84500020
REIECB   &V    F&Z .                    ECB FOR REMOTE COMMUNICTN  @R1C 84529400
TALKECB  &V    F&Z .                    ECB FOR ONSITE COMMUNICATIONS   84558800
RESPBUF  &V    F&Z .                    POINTER TO REPLY BUFFER         84588200
REIUCB   &V    F&Z .                    UCB ADDRESS FOR 2955       @R1C 84617600
CESWTR   &V    &X&Z .                   RETAIN 370 SWITCHES        @R1C 84647000
CESWTR1  &V    &X&Z .                                              @R1C 84676400
CESWTR2  &V    &X&Z .                                              @R1C 84705800
CESWTR3  &V    &X&Z .                                              @R1C 84735200
ZUESUCB  &V    F&Z .                    ACTIVE SPECIFIC EXPOSURE        84764600
*                                       BASE UCB ADDRESS      @G860PLW  84794000
EXPAND1  &V    F&Z .                    EXPANSION BYTES          21050  84823400
         AIF   ('&V' EQ 'DS').SK21                                      84852800
SYMPTR   &V    V(SYMLIB) .              SYMBOLIC LIB DCB-IFDOLT30Y02906 84882200
         AGO   .SK22                                                    84911600
.SK21    ANOP                                                           84941000
SYMPTR   &V    F .                      SYMBOLIC LIB DCB-IFDOLT30Y02906 84970400
.SK22    ANOP                                                           84999800
PGFXLIST &V   4F&Z .               PAGE FIX LIST                 X01019 85029200
         AIF   ('&S' NE 'AOS12').SK5                            X01906  85058600
.SK5A    ANOP                                                           85088000
PARTITEM &V    3F&Z .                   PARTITION ITEMS         X01906  85117400
PGFXOLT  &V    2F&Z .                   OLT PAGE FIX LIST        X03008 85146800
CORERSLT &V    2F&Z .                   GETMAIN CORE RESULTS     X03008 85176200
VRSIZE   &V    F&Z .                    REAL CORE AREA SIZE      X03008 85205600
         &V    F&Z                      NA                         @L1C 85235000
ERRORDEV &V    F&Z                      Save Dev for OLT31 Err Msg @L1A 85264400
         AGO   .SK5B                                                    85293800
.SK5     ANOP                                                   X01906  85323200
         AIF   ('&S' EQ 'MVM22').SK5A                                   85352600
.SK5B    ANOP                                                           85382000
         AIF   ('&S' NE 'MVM22').SK5D                                   85411400
         AIF   ('&V' EQ 'DS').SK5C                                      85440800
NEXTMCT  DC    A(MCT) .                 PTR TO PREVIOUS MCT      X03008 85470200
         DC    A(THIRDMCT) .            PTR TO NEXT MCT                 85499600
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85529000
         DC    C'42' .                  MORECORE ID              X03008 85558400
         DC    XL2'00' .                MODULE LENGTH            X03008 85587800
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85617200
         DC    C'43' .                  FREECORE ID              X03008 85646600
         DC    XL2'00' .                MODULE LENGTH            X03008 85676000
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85705400
         DC    C'44' .                  DIO ID                   X03008 85734800
         DC    XL2'00' .                MODULE LENGTH            X03008 85764200
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85793600
         DC    C'46' .                  EXTRACTOR ID             X03008 85823000
         DC    XL2'00' .                MODULE LENGTH            X03008 85852400
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85881800
         DC    C'AA' .                  DDATE ID                 X03008 85911200
         DC    XL2'00' .                MODULE LENGTH            X03008 85940600
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 85970000
         DC    C'AB' .                  DTIME ID                 X03008 85999400
         DC    XL2'00' .                MODULE LENGTH            X03008 86028800
         DC    X'8000' .                ROOT MODULE INDICATOR    X03008 86058200
         DC    C'AJ' .                  CUTEST ID                X03008 86087600
         DC    XL2'00' .                MODULE LENGTH            X03008 86117000
         DC    X'0000' .                TRANSIENT MODULE         X03008 86146400
         DC    X'0000' .                MODULE ID                YM4982 86175800
         DC    XL2'00' .                MODULE LENGTH            X03008 86205200
         DC    X'0000' .                TRANSIENT MODULE         X03008 86234600
         DC    X'0000' .                MODULE ID                YM4982 86264000
         DC    XL2'00' .                MODULE LENGTH            X03008 86293400
         DC    X'0000' .                TRANSIENT MODULE         X03008 86322800
         DC    X'0000' .                MODULE ID                YM4982 86352200
         DC    XL2'00' .                MODULE LENGTH            X03008 86381600
         DC    X'0000' .                TRANSIENT MODULE         X03008 86411000
         DC    X'0000' .                MODULE ID                YM4982 86440400
         DC    XL2'00' .                MODULE LENGTH            X03008 86469800
         DC    X'0000' .                TRANSIENT MODULE         X03008 86499200
         DC    X'0000' .                MODULE ID                YM4982 86528600
         DC    XL2'00' .                MODULE LENGTH            X03008 86558000
         DC    X'0000' .                TRANSIENT MODULE         X03008 86587400
         DC    X'0000' .                MODULE ID                YM4982 86616800
         DC    XL2'00' .                MODULE LENGTH            X03008 86646200
         DC    X'0000' .                TRANSIENT MODULE         X03008 86675600
         DC    X'0000' .                MODULE ID                YM4982 86705000
         DC    XL2'00' .                MODULE LENGTH            X03008 86734400
         DC    X'0000' .                TRANSIENT MODULE         X03008 86763800
         DC    X'0000' .                MODULE ID                YM4982 86793200
         DC    XL2'00' .                MODULE LENGTH            X03008 86822600
         DC    X'0000' .                TRANSIENT MODULE         X03008 86852000
         DC    X'0000' .                MODULE ID                YM4982 86881400
         DC    XL2'00' .                MODULE LENGTH            X03008 86910800
         DC    X'0000' .                TRANSIENT MODULE         X03008 86940200
         DC    X'0000' .                MODULE ID                YM4982 86969600
         DC    XL2'00' .                MODULE LENGTH            X03008 86999000
         DC    X'0000' .                TRANSIENT MODULE         X03008 87028400
         DC    X'0000' .                MODULE ID                YM4982 87057800
         DC    XL2'00' .                MODULE LENGTH            X03008 87087200
         DC    X'0000' .                TRANSIENT MODULE         X03008 87116600
         DC    X'0000' .                MODULE ID                YM4982 87146000
         DC    XL2'00' .                MODULE LENGTH            X03008 87175400
         DC    X'0000' .                TRANSIENT MODULE         X03008 87204800
         DC    X'0000' .                MODULE ID                YM4982 87234200
         DC    XL2'00' .                MODULE LENGTH            X03008 87263600
         DC    V(IFDOLT42) .            MORECORE ADDRESS         X03008 87293000
         DC    V(IFDOLT43) .            FREECORE ADDRESSC        X03008 87322400
         DC    V(IFDOLT44) .            DIO ADDRESS              X03008 87351800
         DC    V(IFDOLT46) .            EXTRACTOR ADDRESS        X03008 87381200
         DC    V(IFDOLTAA) .            DDATE ADDRESS            X03008 87410600
         DC    V(IFDOLTAB) .            DTIME ADDRESS            X03008 87440000
         DC    V(IFDOLTAJ) .            CUTEST ADDRESS           X03008 87469400
         DC    A(0) .                   MODULE ADDRESS           YM4982 87498800
         DC    A(0) .                   MODULE ADDRESS           YM4982 87528200
         DC    A(0) .                   MODULE ADDRESS           YM4982 87557600
         DC    A(0) .                   MODULE ADDRESS           YM4982 87587000
         DC    A(0) .                   MODULE ADDRESS           YM4982 87616400
         DC    A(0) .                   MODULE ADDRESS           YM4982 87645800
         DC    A(0) .                   MODULE ADDRESS           YM4982 87675200
         DC    A(0) .                   MODULE ADDRESS           YM4982 87704600
         DC    A(0) .                   MODULE ADDRESS           YM4982 87734000
         DC    A(0) .                   MODULE ADDRESS           YM4982 87763400
         DC    A(0) .                   MODULE ADDRESS           YM4982 87792800
         DC    A(0) .                   MODULE ADDRESS           YM4982 87822200
         DC    A(0) .                   MODULE ADDRESS           YM4982 87851600
THIRDMCT DC    A(NEXTMCT) .             PTR TO PREVIOUS MCT             87881000
         DC    F'0' .                   PTR TO NEXT MCT          X03008 87910400
         DC    X'0000' .                TRANSIENT MODULE         X03008 87939800
         DC    X'0000' .                MODULE ID                YM4982 87969200
         DC    XL2'00' .                MODULE LENGTH            X03008 87998600
         DC    X'0000' .                TRANSIENT MODULE         X03008 88028000
         DC    X'0000' .                MODULE ID                YM4982 88057400
         DC    XL2'00' .                MODULE LENGTH            X03008 88086800
         DC    X'0000' .                TRANSIENT MODULE         X03008 88116200
         DC    X'0000' .                MODULE ID                YM4982 88145600
         DC    XL2'00' .                MODULE LENGTH            X03008 88175000
         DC    X'0000' .                TRANSIENT MODULE         X03008 88204400
         DC    X'0000' .                MODULE ID                YM4982 88233800
         DC    XL2'00' .                MODULE LENGTH            X03008 88263200
         DC    X'0000' .                TRANSIENT MODULE         X03008 88292600
         DC    X'0000' .                MODULE ID                YM4982 88322000
         DC    XL2'00' .                MODULE LENGTH            X03008 88351400
         DC    X'0000' .                TRANSIENT MODULE         X03008 88380800
         DC    X'0000' .                MODULE ID                YM4982 88410200
         DC    XL2'00' .                MODULE LENGTH            X03008 88439600
         DC    X'0000' .                TRANSIENT MODULE         X03008 88469000
         DC    X'0000' .                MODULE ID                YM4982 88498400
         DC    XL2'00' .                MODULE LENGTH            X03008 88527800
         DC    13XL6'00' .              REST OF MCT              X03008 88557200
         DC    A(0) .                   MODULE ADDRESS           YM4982 88586600
         DC    A(0) .                   MODULE ADDRESS           YM4982 88616000
         DC    A(0) .                   MODULE ADDRESS           YM4982 88645400
         DC    A(0) .                   MODULE ADDRESS           YM4982 88674800
         DC    A(0) .                   MODULE ADDRESS           YM4982 88704200
         DC    A(0) .                   MODULE ADDRESS           YM4982 88733600
         DC    A(0) .                   MODULE ADDRESS           YM4982 88763000
         DC    13F'0' .                 MODULE ADDRESSES         X03008 88792400
         AGO   .SK5D                                                    88821800
.SK5C    ANOP                                                           88851200
NEXTMCT  &V    208C .                   NEXT MCT                 X03008 88880600
THIRDMCT &V    208C .                   THIRD MCT                       88910000
.SK5D    ANOP                                                           88939400
DEVTAB   &V    384F&Z                   DEVICE TABLES              @L1C 88968800
ENDCOM   EQU   * .                      END OF COMMON AREA              89000020
         MEND                                                           89500020
                                        */                              89533800
*%LABEL1:  ;                                                            89567600
*/********************************************************************/ 89601400
*/*      COMMON AREA MAP                                             */ 89635200
*/********************************************************************/ 89669000
* DECLARE                                                               89702800
*  1 COMMAP BASED(COMMAPT) BDY(WORD),                                   89736600
*    3 CHASCT CHAR(92),                 /* SECT CONT TABLE   @ZA15468*/ 89770400
*      5 * CHAR(71),                    /* N/A               @ZA15468*/ 89804200
*      5 MSSSTAT CHAR(1),               /* MSS STATUS BYTE   @ZA15468*/ 89838000
*        7 FINITSW BIT(1),              /* FUNCT INIT SW     @ZA15468*/ 89871800
*        7 DINITSW BIT(1),              /* DIAG INIT SW      @ZA15468*/ 89905600
*        7 INITSW BIT(1),               /* NTRFACE INIT SW   @ZA15468*/ 89939400
*      5 * CHAR(1),                     /* N/A               @ZA15468*/ 89973200
*      5 CPUID CHAR(5),                 /* CPU ID            @ZA15468*/ 90007000
*      5 * CHAR(14),                    /* N/A               @ZA15468*/ 90040800
*    3 DOLT00PT PTR(31),                /* INITIALIZATION MODULE     */ 90074600
*    3 LGWRTCT CHAR(40),                /* LAST SCT WORDS            */ 90108400
*    3 INBUFPTR PTR(31),                /* ADDR OF ITEM IN BUFFER    */ 90142200
*    3 INBUFR CHAR(72),                 /* INPUT BUFFER              */ 90176000
*    3 PRTBUFR CHAR(124),               /* PRINTING BUFFER           */ 90209800
*    3 SECPTR PTR(31),                  /* ACTIVE SECTION ENTRY POINT*/ 90243600
*    3 UTENT PTR(31),                   /* 1ST UT INSTRUCTION        */ 90277400
*    3 DATPTR PTR(31),                  /* PTR TO DP ROOT MODULE     */ 90311200
*    3 DATIND CHAR(2),                  /* OLTEP DATA INDICATOR      */ 90345000
*    3 PGMTAB CHAR(8),                  /* ACTIVE PGM ID             */ 90378800
*    3 SECLST CHAR(138),                /* SECTION LIST              */ 90412600
*    3 APPTRS,                          /* APPENDAGE POINTERS    @R1A*/ 90446400
*      5 PCIEXIT PTR(31),               /* PTR TO PCI EXIT       @R1C*/ 90480200
*      5 NORMEXIT PTR(31),              /* PTR TO NORMAL EXIT    @R1C*/ 90514000
*      5 ABNMEXIT PTR(31),              /* PTR TO ABNORMAL EXIT  @R1C*/ 90547800
*      5 DIEADDR PTR(31),               /* DISABLD INT HNDLR ADR @R1C*/ 90581600
*    3 IOSCB CHAR(136),                 /* CTRL BLK SET FOR IOS      */ 90615400
*      5 MODIOSB CHAR(108),             /* MODEL IOSB                */ 90649200
*      5 MODUSECB CHAR(24),             /* MODEL USE CONTROL BLOCK   */ 90683000
*      5 OECBWRD1 CHAR(4),              /* 1ST WORD OF OECB          */ 90716800
*        7 OECBSNSC CHAR(1),            /* SENSE COUNT FOR THIS REQ  */ 90750600
*        7 OECBINCT CHAR(1),            /* INTERRUPT COUNT FLD       */ 90784400
*        7 OECBX CHAR(2),               /* NOT USED                  */ 90818200
*    3 EFCTRCB CHAR(20) BDY(WORD),      /* IOEFFECTOR CNTRL BLOCK    */ 90852000
*      5 CCWPTR PTR(31),                /* PTR TO CCW LIST           */ 90885800
*      5 DVTPTR PTR(31),                /* PTR TO DEVTBLE ENTRY      */ 90919600
*      5 FLGA CHAR(1),                  /* FLAGS:                    */ 90953400
*        7 BYPASPFX BIT(1),             /*   BYPASS PREFIX           */ 90987200
*        7 CEDEPOST BIT(1),             /*   CE DE SEPERATION        */ 91021000
*        7 GDP BIT(1),                  /*   GUARANTEED DEV PATH     */ 91054800
*        7 SPEXPOS BIT(1),              /*   SPECIFIC EXPOSURE       */ 91088600
*        7 * BIT(1),                    /*   NOT USED                */ 91122400
*        7 * BIT(1),                    /*   NOT USED                */ 91156200
*        7 * BIT(1),                    /*   NOT USED                */ 91190000
*        7 * BIT(1),                    /*   NOT USED                */ 91223800
*      5 FLGB CHAR(1),                  /* FLAGS:                    */ 91257600
*        7 INTIRNAL BIT(1),             /*   INTERNAL CALL BY DP ETC.*/ 91291400
*          9 INTERNL BIT(1),            /*   INTERNAL CALL BY DP @R1A*/ 91325200
*        7 ATTNIN BIT(1),               /*   ATTENTION FUNCTION      */ 91359000
*          9 MODEREQ BIT(1),            /*   ATTENTION FUNCTION  @R1A*/ 91392800
*        7 VIRTCCWS BIT(1),             /*   CCWS ARE VIRTUAL        */ 91426600
*        7 OLDTECBX BIT(1),             /*   P3116 TECB              */ 91460400
*        7 * BIT(1),                    /*   NOT USED                */ 91494200
*        7 * BIT(1),                    /*   NOT USED                */ 91528000
*        7 * BIT(1),                    /*   NOT USED                */ 91561800
*        7 * BIT(1),                    /*   NOT USED                */ 91595600
*      5 FILEMSK CHAR(1),               /*   FILEMASK OR MODE SET    */ 91629400
*      5 SNSCNT CHAR(1),                /*   SENSE BYTE COUNT        */ 91663200
*      5 TECBPTRX PTR(31),              /*   PTR TO TECB             */ 91697000
*      5 SEEKPTR PTR(31),               /*   PTR TO SEEK ADDR        */ 91730800
*    3 IOEFTRAD PTR(31),                /*   PTR TO IO EFFECTOR      */ 91764600
*      5 IORTNADR PTR(31),              /*   PTR TO IO EFFECTOR  @R1A*/ 91798400
*    3 IODEVTAB(3) CHAR(12) BDY(WORD),  /* IO DEVICE TABLES          */ 91832200
*      5 IODEV1 PTR(31),                /*      PTR TO DEV TBLE NTRY */ 91866000
*      5 IOSBPTR1 PTR(31),              /*      PTR TO IOSB          */ 91899800
*      5 IOECB1 CHAR(4),                /*      ECB                  */ 91933600
*        7 CMPLT CHAR(1),               /*                           */ 91967400
*          9 WAITBIT BIT(1),            /* ECB WAITED ON             */ 92001200
*          9 POSTBIT BIT(1),            /* ECB POSTED                */ 92035000
*          9 CMPLCODE BIT(6),           /* SYSTEM COMPLETION CODE    */ 92068800
*        7 * CHAR(1),                   /* NOT USED                  */ 92102600
*        7 * CHAR(2),                   /*                           */ 92136400
*          9 PSUDPOST BIT(1),           /* SET BY NAPA               */ 92170200
*          9 * BIT(3),                  /* NOT USED                  */ 92204000
*          9 WTCMPCD BIT(12),           /* SET BY WAITIO ON TMOUT    */ 92237800
*    3 SELAFFN CHAR(2),                 /* SELECTED AFFN             */ 92271600
*    3 CHARAFFN CHAR(2),                /* CHAR REP OF SEL AFFN      */ 92305400
*    3 NSTBUFF CHAR(4),                 /* 4K NST BUFFER ADR @Z38NFAA*/ 92339200
*    3 ATTNADDR PTR(31),                /* ADDR OF IFDOLT85  @G860PLW*/ 92373000
*    3 ATNINDEX CHAR(1),                /* OLTEP ATTN INDEX  @G860PLW*/ 92406800
*    3 XXXXRSVD CHAR(3),                /* RESERVED          @G860PLW*/ 92440600
*    3 ATTNIOSB PTR(31),                /* ADDR OF ATTN IOSB @OZ63698*/ 92474400
*    3 XXXXXXXX CHAR(56),               /* NOT USED              @L1C*/ 92508200
*    3 DEVBUF   CHAR(72),               /* Use if Dev is Slash   @L1A*/ 92542000
*    3 DEVTBPTR PTR(31),                /* PTR TO DEVICE TABLES      */ 92575800
*    3 TABLNGTH FIXED(15),              /* LEN OF DEVTAB ENTRY       */ 92609600
*    3 CESWT9 CHAR(1),                  /* SWITCHES:                 */ 92643400
*      5 CDSEQU BIT(1),                 /*   CDS EQUATE REQ          */ 92677200
*      5 RESTBENT BIT(1),               /*   RESIDENT TBL ENTRY      */ 92711000
*      5 VRCAP BIT(1),                  /*   VIRTUAL OR REAL OLT     */ 92744800
*      5 *     BIT(2),                  /*   NOT USED            @R1C*/ 92778600
*      5 MIXDEV BIT(1),                 /*   NOT USED            @R1C*/ 92812400
*      5 *     BIT(1),                  /*   NOT USED            @R1C*/ 92846200
*      5 OLTTERM BIT(1),                /*   NOT USED            @R1C*/ 92880000
*    3 CESWT10 CHAR(1),                 /* SWITCHES OR FLAGS         */ 92913800
*      5 MPSYS BIT(1),                  /* MP SYSTEM                 */ 92947600
*      5 AFFNSET BIT(1),                /* AFFN SET                  */ 92981400
*      5 VERBCALL BIT(1),               /* VERB SELECTED             */ 93015200
*      5 CHPIDRQD BIT(1),               /* C.E. CHPID REQ.   @G860PHS*/ 93049000
*      5 *        BIT(4),               /* RESERVED              @R1C*/ 93082800
*    3 OPEN2 PTR(31),                   /* NOT USED                  */ 93116600
*    3 OPEN3 PTR(31),                   /* NOT USED                  */ 93150400
*    3 PSCT PTR(31),                    /* PTR TO SCT                */ 93184200
*    3 DEVDEPAD PTR(31),                /* ACTIVE SCT ENTRY PTR      */ 93218000
*    3 TABAD PTR(31),                   /* UNIT TESTING TBLE PTR     */ 93251800
*    3 UTCOMAD PTR(31),                 /* POINTER TO PASSON AREA    */ 93285600
*    3 MCT CHAR(208) BDY(WORD),         /* MODULE CONTROL TABLE      */ 93319400
*      5 * CHAR(164),                   /*                           */ 93353200
*      5 PARPRADR PTR(31),              /* DPRINT MODULE ADDR        */ 93387000
*      5 * CHAR(40),                    /*                           */ 93420800
*    3 MCT1ADR PTR(31),                 /* PTR TO MCT                */ 93454600
*    3 WKSVC CHAR(16) BDY(WORD),        /* SVC WORK AREA             */ 93488400
*      5 ROPTM4 CHAR(4),                /* SVC PARM LIST -4      @R1C*/ 93522200
*      5 ROPT PTR(31),                  /* SVC PARM LIST         @R1C*/ 93556000
*      5 ROPTP4 CHAR(4),                /* SVC PARM LIST +4      @R1C*/ 93589800
*      5 ROPTP8 CHAR(4),                /* SVC PARM LIST +8      @R1C*/ 93623600
*    3 OLTTAB CHAR(40) BDY(WORD),       /* LINK TABLE                */ 93657400
*      5 * CHAR(28),                    /*                           */ 93691200
*      5 TAB28 PTR(31),                 /* NEW MACRO ENTRY POINT     */ 93725000
*      5 * CHAR(8),                     /*                           */ 93758800
*    3 LOGADR PTR(31),                  /* PTR TO LOGSCAN MODULE     */ 93792600
*    3 SCHEDSA PTR(31),                 /* PTR TO SCHEDULER SVAREA   */ 93826400
*    3 SATAB CHAR(12),                  /* SYSTEM ASSIGNMENT TABLE   */ 93860200
*    3 PLKMOR CHAR(16),                 /* PLINK AND MORECORE MNGMT  */ 93894000
*    3 REGX PTR(31),                    /* ACTIVE UCB ADDR PTR       */ 93927800
*    3 TUCBAD1 PTR(31),                 /* 1ST ACTIVE UCB ADDR       */ 93961600
*    3 TUCBAD2 PTR(31),                 /* 2ND ACTIVE UCB ADDR       */ 93995400
*    3 TSTDEBAD PTR(31),                /* TEST DEB ADDR             */ 94029200
*    3 ECB3 CHAR(4),                    /* DYNAMIC COMMUNICATION ECB */ 94063000
*    3 UTCOM CHAR(64),                  /* PASSON AREA               */ 94096800
*    3 EXTBUF CHAR(56),                 /* EXTERNAL BUFFER           */ 94130600
*    3 DPRDEBAD PTR(31),                /* PTR TO DPRINT DEB         */ 94164400
*    3 PRIDVPTR PTR(31),                /* PTR TO ACTIVE PRIME DEVTAB*/ 94198200
*    3 SECDVPTR PTR(31),                /* PTR TO LAST GRAB DEVICE   */ 94232000
*    3 REDEFINE PTR(31),                /* CE COMM ENTRY IN    Y02906*/ 94265800
*                                       /* IFDOLT30            Y02906*/ 94299600
*    3 COMMINT PTR(31),                 /* DYN COMM ENTRY IN   Y02906*/ 94333400
*                                       /* IFDOLT30            Y02906*/ 94367200
*    3 NEXTREC PTR(31),                 /* NEXT INPUT RECORD   Y02906*/ 94401000
*                                       /* ENTRY IN IFDOLT30   Y02906*/ 94434800
*    3 ADSVAREA PTR(31),                /* IFDOLT30 1ST SVAREA ADDR  */ 94468600
*    3 ECB37 CHAR(4),                   /* CECOM ECB                 */ 94502400
*    3 REPLY37 CHAR(72),                /* CECOM INPUT BUFFER        */ 94536200
*    3 MSGAD37 PTR(31),                 /* OLTS BUFFER ADDR          */ 94570000
*    3 TPSAVE CHAR(4),                  /* TEST ID                   */ 94603800
*    3 TLCOUNT FIXED(15),               /* TEST LOOP COUNT           */ 94637600
*    3 HRTSEL FIXED(15),                /* HIGHEST ROUTINE SELECTED  */ 94671400
*    3 SAVECNT CHAR(2),                 /* COUNTER FOR DEVICE DELODE */ 94705200
*    3 * CHAR(2),                       /* TEST LOOP RUN             */ 94739000
*    3 SAVENT CHAR(4),                  /* LAST INCLUSIVE SERIES     */ 94772800
*    3 CESWITCH CHAR(9),                /* OLTEP SWITCHES            */ 94806600
*      5 CESWT CHAR(1),                 /* CE SWITCH                 */ 94840400
*        7 LEGALTST BIT(1),             /* LEGAL TEST ENTRY          */ 94874200
*        7 SECDEV BIT(1),               /* DO DP FOR SEC DEV         */ 94908000
*          9 PROTECT BIT(1),            /* DO DP FOR SEC DEV     @R1A*/ 94941800
*        7 OUTS BIT(1),                 /* OLD OLT LOADED            */ 94975600
*        7 NUTS BIT(1),                 /* NEW OLT LOADED            */ 95009400
*        7 LEGALDEV BIT(1),             /* LEGAL DEVICE ENTRY        */ 95043200
*        7 REINT BIT(1),                /* NEW D/T/O/ ENTRY          */ 95077000
*        7 FERINT BIT(1),               /* COMMUNICATION INTERVAL    */ 95110800
*        7 * BIT(1),                    /*                           */ 95144600
*      5 CESWT1 CHAR(1),                /* SWITCH 1:                 */ 95178400
*        7 RTNFLD BIT(1),               /* ROUTINES SELECTED         */ 95212200
*        7 SKTST BIT(1),                /*                           */ 95246000
*        7 * BIT(1),                    /*                           */ 95279800
*        7 WAITFG BIT(1),               /* WAITIO NEEDED             */ 95313600
*        7 FILMSK BIT(1),               /* ALLOW MODESET CHANGE      */ 95347400
*        7 NSTDK BIT(1),                /* NST DISK IN USE   @Z38NFAA*/ 95381200
*        7 ONLINEOK BIT(1),             /* ONLINE TESTING OK         */ 95415000
*        7 TPFLAG BIT(1),               /* UNITS COUNTER GTR THEN 1  */ 95448800
*      5 CESWT2 CHAR(1),                /* SWITCH 2:                 */ 95482600
*        7 NDCFO BIT(1),                /* NO DYN COMM FOR OLTEP     */ 95516400
*        7 * BIT(1),                    /*                           */ 95550200
*        7 FECOND BIT(1),               /* FIRST ERROR CONDITION     */ 95584000
*        7 * BIT(1),                    /*                           */ 95617800
*        7 INITENT BIT(1),              /* OPTION ENTRY DECODED      */ 95651600
*        7 NDR BIT(1),                  /* NDR ENTRY                 */ 95685400
*        7 TAPEHDR BIT(1),              /* TAPE LABEL TO RESTORE     */ 95719200
*        7 * BIT(1),                    /*                           */ 95753000
*      5 CESWT3 CHAR(1),                /* SWITCH 3:                 */ 95786800
*        7 TALKVERB BIT(1),             /* TALK REQUESTED            */ 95820600
*        7 BYPALDEV BIT(1),             /* STOP SCHEDULING DEVICES   */ 95854400
*        7 BYPDEV BIT(1),               /* STOP TESTING CURRENT DEV  */ 95888200
*        7 GRBCNTL BIT(1),              /* GRAB MACRO ISSUED         */ 95922000
*        7 SUSDEL BIT(1),               /* MODULE CAN BE DELETED     */ 95955800
*        7 TP1419 BIT(1),               /* TP DEVICES IN SYSTEM      */ 95989600
*        7 CDEXIST BIT(1),              /* CDS LIBRARY EXISTS        */ 96023400
*        7 NODP BIT(1),                 /* CANT DO DATA PROJECT      */ 96057200
*      5 CESWT4 CHAR(1),                /* SWITCH 4:                 */ 96091000
*        7 RSTRFLG BIT(1),              /* PAGE RESTORE -BYPASS WTO  */ 96124800
*        7 DPRFLG BIT(1),               /* USE DPRINT 2ND SVAREA     */ 96158600
*        7 WAITFLG BIT(1),              /* BYPASS DPRINT INTRNL WAIT */ 96192400
*        7 WRTFLG BIT(1),               /* DPRINT WRITE REQUEST      */ 96226200
*        7 * BIT(1),                    /* NOT USED                  */ 96260000
*        7 WTORFLG BIT(1),              /* DPRINT WTOR REQUEST       */ 96293800
*        7 RPLYFLG BIT(1),              /* REPLY EXPECTED            */ 96327600
*        7 WTOFLG BIT(1),               /* DPRINT WTO REQUEST        */ 96361400
*      5 CESWT5 CHAR(1),                /* SWITCH 5:                 */ 96395200
*        7 HDRFLG BIT(1),               /* PRINT HEADER LINE         */ 96429000
*        7 RSLTFLG BIT(1),              /* PRINT RESULTS             */ 96462800
*        7 FFEFLG BIT(1),               /* 1ST ERROR HAS OCCURRED    */ 96496600
*        7 FCEFLG BIT(1),               /* 1ST CAT ERROR HAS OCCURRED*/ 96530400
*        7 PFEMSG BIT(1),               /* PRINT 1ST ERROR MSG       */ 96564200
*        7 PCEMSG BIT(1),               /* PRINT CAT ERROR MSG       */ 96598000
*        7 SYMBFLG BIT(1),              /* SYMBOLIC NAME IN HEADER   */ 96631800
*        7 PRNTOPTN BIT(1),             /* PRINT PRIOR OPTIONS MSG   */ 96665600
*      5 CESWT6 CHAR(1),                /* SWITCH 6:                 */ 96699400
*        7 UTSCAL BIT(1),               /* UNIT TEST MACRO CALL      */ 96733200
*        7 ATM BIT(1),                  /* PRINT * ON TERM MSG       */ 96767000
*        7 EOFBIT BIT(1),               /* RESET INTERNAL SWITCHES   */ 96800800
*        7 PFPMSG BIT(1),               /* PRINT FP MSG-CANCEL OLT   */ 96834600
*        7 CODE5 BIT(1),                /* REPEAT TESTS              */ 96868400
*        7 NORUN BIT(1),                /* DONT RUN SCHEDULED TEST   */ 96902200
*        7 SECRUN BIT(1),               /* SCHEDULED TEST DONE       */ 96936000
*        7 RTSTAE BIT(1),               /* ENTRY TO STAE             */ 96969800
*      5 CESWT7 CHAR(1),                /* SWITCH 7:                 */ 97003600
*        7 INCLST BIT(1),               /* INCLUSIVE DEVICE ENTRY    */ 97037400
*        7 RETTO31 BIT(1),              /* NOT ALL DEVICES VALID     */ 97071200
*       7 REMOTE BIT(1),                /* REMOTE TERM IN DEV ENTRY  */ 97105000
*        7 * BIT(1),                    /* NOT USED                  */ 97138800
*        7 * BIT(1),                    /* NOT USED                  */ 97172600
*        7 * BIT(1),                    /* NOT USED                  */ 97206400
*        7 VIRTUAL BIT(1),              /* RUNNING IN VIRTUAL        */ 97240200
*        7 GOTINPUT BIT(1),             /* ENTRY TO D/T/O            */ 97274000
*      5 CESWT8 CHAR(1),                /* SWITCH 8:                 */ 97307800
*        7 LISTFIX BIT(1),              /* PARMLIST FIXED            */ 97341600
*        7 UNDONE  BIT(1),              /* Proc UNDO was called  @P2C*/ 97375400
*        7 * BIT(1),                    /* NOT USED                  */ 97409200
*        7 READDCHK BIT(1),             /* READD ENTERED             */ 97443000
*        7 OLTINVV BIT(1),              /* OLT IN VIRTUAL            */ 97476800
*        7 SUTMSG BIT(1),               /* MSG 158I ISSUED           */ 97510600
*        7 SNEWRUN BIT(1),              /* NEW TEST RUN              */ 97544400
*        7 TALKHERE BIT(1),             /* TALK VERB ENTERED         */ 97578200
*    3 DYNCOM CHAR(1),                  /* RESPONSE BUFFER DYN MSG   */ 97612000
*    3 SECTUSE  CHAR(1),                /* NO. OF SECTIONS RUNYM03331*/ 97645800
*    3 UNICTR  CHAR(1),                 /* NO. OF UNITS TO RUNYM03331*/ 97679600
*    3 UNITUSE  CHAR(1),                /* NO.   OF UNITS RUN YM03331*/ 97713400
*    3 DPLEVEL CHAR(1),                 /* MSG PRINTING LEVEL        */ 97747200
*    3 CNT37  CHAR(1),                  /* CECOM REPLY LENGTH YM03331*/ 97781000
*    3 READDSV CHAR(6),                 /* READD SVAREA              */ 97814800
*    3 * CHAR(3),                       /* NOT USED                  */ 97848600
*    3 READDMOD PTR(31),                /* PTR TO READD MODULE       */ 97882400
*    3 RDCBPTR PTR(31),                 /* READD DCB PTRPTR -  Y02906*/ 97916200
*                                       /* DCB IN IFDOLT51     Y02906*/ 97950000
*    3 MSGMOD PTR(31),                  /* PTR TO RESIDENT MSG MODULE*/ 97983800
*    3 ENDJOB PTR(31),                  /* PTR TO INIT SVAREA        */ 98017600
*    3 MHRPTR PTR(31),                  /*                       @R1C*/ 98051400
*    3 RTALKBUF PTR(31),                /* PTR TO TALK BUFFER        */ 98085200
*                                       /* BUFFER IN IFDOLT55    @R1C*/ 98119000
*    3 RINBUF PTR(31),                  /* PTR TO REMOTE INBUFFER    */ 98152800
*                                       /* BUFFER IN IFDOLT55    @R1C*/ 98186600
*    3 REIDCBPT PTR(31),                /* PTR TO REI DCB-           */ 98220400
*                                       /* DCB IN IFDOLT55       @R1C*/ 98254200
*    3 REIOBPTR PTR(31),                /* PTR TO REI IOB-           */ 98288000
*                                       /* IOB IN IFDOLT55       @R1C*/ 98321800
*    3 REIECB CHAR(4),                  /* REMOTE COMM ECB       @R1C*/ 98355600
*    3 TALKECB CHAR(4),                 /* ONSITE COMM ECB           */ 98389400
*    3 RESPBUF PTR(31),                 /* PTR TO REPLY BUFR         */ 98423200
*    3 REIUCB PTR(31),                  /* 2955 UCB ADDR         @R1C*/ 98457000
*    3 CESWTR CHAR(1),                  /* RETAIN SWITCHES:      @R1C*/ 98490800
*      5 RETAINAC BIT(1),               /* RETAIN ACTIVE         @R1A*/ 98524600
*      5 REMERR   BIT(1),               /* REMOTE ERROR          @R1A*/ 98558400
*      5 REMONMSG BIT(1),               /* DONT SEND TO REMOTE   @R1A*/ 98592200
*      5 CENOMSG  BIT(1),               /* DONT SEND TO CONSOLE  @R1A*/ 98626000
*      5 TRANSMSG BIT(1),               /* TRANSLATE MSG         @R1A*/ 98659800
*      5 IMRESP   BIT(1),               /* ATTACH 04 REPLY CODE  @R1A*/ 98693600
*      5 EXECOUT  BIT(1),               /* SCCEPT 00 REPLY CODE  @R1A*/ 98727400
*      5 *        BIT(1),               /* NOT USED              @R1A*/ 98761200
*    3 CESWTR1 CHAR(1),                 /* REMOTE SWITCH1:       @R1C*/ 98795000
*      5 ILLRESP  BIT(1),               /* INVALID RESP BY REMOTE@R1A*/ 98828800
*      5 EXECANS  BIT(1),               /* REMOTE REPLIED TO 104E@R1A*/ 98862600
*      5 CECOMANS BIT(1),               /* REMOTE REPL TO OUTMSG @R1A*/ 98896400
*      5 INFOMSG  BIT(1),               /* 3 MSG RCVD FROM REMOTE@R1A*/ 98930200
*      5 RETRIEVE BIT(1),               /* REIECB POSTED         @R1A*/ 98964000
*      5 REMANS   BIT(1),               /* REMOTE CAN REPLY      @R1A*/ 98997800
*      5 EDOTMSG  BIT(1),               /* ATTACH 01 REPLY CODE  @R1A*/ 99031600
*      5 REIENTRY BIT(1),               /* ENTRY FROM REI        @R1A*/ 99065400
*    3 CESWTR2 CHAR(1),                 /* REMOTE SWITCH2:       @R1C*/ 99099200
*      5 REPLY00  BIT(1),               /* ATTACH 00 REPLY CODE  @R1A*/ 99133000
*      5 *        BIT(1),               /* NOT USED              @R1A*/ 99166800
*      5 ONCOMM   BIT(1),               /* ONSITE REPLIED        @R1A*/ 99200600
*      5 COMLOOP  BIT(1),               /* 105D ISSUED - TALK REP@R1A*/ 99234400
*      5 WAIT     BIT(1),               /* ISSUE WTOR            @R1A*/ 99268200
*      5 OPTERR   BIT(1),               /* RE AND MI OPTS SELECT @R1A*/ 99302000
*      5 *        BIT(1),               /* NOT USED              @R1A*/ 99335800
*      5 DPMSGREI BIT(1),               /* REI REPLY NOT ALLOWED @R1A*/ 99369600
*    3 CESWTR3 CHAR(1),                 /* RETAIN SWITCHE3       @R1C*/ 99403400
*    3 ZUESUCB PTR(31),                 /*  SPEC EXP BASE UCB ADDR      99437200
*                                                            @G860PLW*/ 99471000
*    3 EXPAND1 CHAR(4),                 /* EXPANSION BYTES           */ 99504800
*    3 SYMPTR PTR(31),                  /* SYMBOLIC LIB DCB PTRY02906*/ 99538600
*                                       /* DCB IN IFDOLT30     Y02906*/ 99572400
*    3 PGFXLIST CHAR(16),               /* PAGEFIX LIST              */ 99606200
*    3 PARTITEM CHAR(12),               /* PARTITION ITEMS           */ 99640000
*    3 PGFXOLT CHAR(8),                 /* OLT PAGEFIX LIST          */ 99673800
*    3 CORERSLT CHAR(8),                /* GETMAIN CORE RESULTS      */ 99707600
*    3 VRSIZE FIXED(31),                /* REAL CORE AREA SIZE       */ 99741400
*    3 * CHAR(4),                       /* NOT USED              @L1C*/ 99775200
*    3 ERRORDEV CHAR(4),                /* Device for IFDOLT31 Error    99809000
*                                                    Message     @L1A*/ 99842800
*    3 NEXTMCT CHAR(208),               /* NEXT MCT                  */ 99876600
*    3 THIRDMCT CHAR(208),              /* THIRD MCT                 */ 99910400
*    3 DEVTAB CHAR(1536);               /* DEVICE TABLES         @L1C*/ 99944200
