*%GOTO   ACBBSL0 ;                            /*                 @L2A*/ 00000100
* /*                                                                 */ 00000200
         MACRO                                                          00000300
         IFGACB &DSECT=YES,&AM=                                         00000400
*%ACBBSL0: ;                                                            00000500
*/*                                                                  */ 00000600
*/*  $MAC(IFGACB) COMP(DF106):                                       */ 00000700
*/*                                                                  */ 00000800
*/*  COPYRIGHT =                                                     */ 00000900
*/*                                                                  */ 00001000
*/*PROPRIETARY V3 STATEMENT                                          */ 00001100
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00001200
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00001300
*/*5695-DF1                                                          */ 00001400
*/*(C) COPYRIGHT 1992,1995  IBM CORP.                                */ 00001500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00001600
*/*                                                                  */ 00001800
*/*   STATUS = OS/390 DFSMS V3 R10                               @RCA*/ 00001900
*/*                                                                  */ 00002000
*/*   FUNCTION = THE ACB DESCRIBES THE CURRENT USE OF A VSAM DATA    */ 00002100
*/*      SET.  IN MVS, THE ACB DESCRIBES THE CURRENT USE OF A DATA   */ 00002200
*/*      SET WHEN THE JOB ENTRY SUBSYSTEM (JES) IS BEING USED FOR    */ 00002300
*/*      INPUT/OUTPUT CONTROL.  IN VTAM, THE ACB REPRESENTS A        */ 00002400
*/*      PROCESSING APPLICATION.                                     */ 00002500
*/*                                                                  */ 00002600
*/*      THE ACB IS CREATED BY THE USER WITH THE ACB MACRO           */ 00002700
*/*      INSTRUCTION.   OTHER INFORMATION MAY BE ADDED FROM THE      */ 00002800
*/*      DD STATEMENT.  IT IS ACCESSED THROUGH THE RPLDACB FIELD     */ 00002900
*/*      IN THE REQUEST PARAMETER LIST.                              */ 00003000
*/*                                                                  */ 00003100
*/*      THE CONTROL BLOCK CONSISTS OF AN AREA COMMON TO     @ZA34940*/ 00003200
*/*      ALL USERS, A CONTIGUOUS EXTENSION CREATED FOR       @ZA34940*/ 00003300
*/*      VSAM AND A CONTIGUOUS EXTENSION CREATED FOR VTAM.   @ZA34940*/ 00003400
*/*      THE VTAM EXTENSION IS GENERATED IF 'AM=VTAM' IS     @ZA34940*/ 00003500
*/*      CODED IN THE ACB MACRO.                             @ZA34940*/ 00003600
*/*                                                                  */ 00003700
*/*   INCLUDED MACROS = NONE                                         */ 00003800
*/*                                                                  */ 00003900
*/*   METHOD OF ACCESS = PL/S OR ASSEMBLER                           */ 00004000
*/*                                                                  */ 00004100
*%GOTO   ACBBSLXX;                            /*                 @L2A*/ 00004500
         AGO .ACBBSLXX                                            @L2A  00005100
*%ACBBSLXX: ;                                                           00005700
*/********************************************************************/ 00006300
*/*USAGE: USE MACRO VARIABLES TO SET POINTER AND SPACEID BASING:     */ 00006900
*/*                                                                  */ 00007500
*/* POINTER:                                                         */ 00008100
*/*  IF ACBVPTR IS SPECIFIED IT IS THE ONLY BASING VARIABLE          */ 00008700
*/*  ELSE IF ACBBASD IS SPECIFIED IT IS THE PTR BASING VARIABLE      */ 00009300
*/*  ELSE IF ACBBASD='NONE' NO BASING STATEMENT IS GENERATED         */ 00009900
*/*      (NOTE:  ACBBASD = 'NONE' SHOULD NOT BE USED FOR A CB        */ 00010500
*/*              WITH AN EXTENSION CB.)                              */ 00011100
*/*  ELSE THE DEFAULT "BASED" IS GENERATED                           */ 00011700
*/*                                                                  */ 00012300
*/* SPACEID:                                                         */ 00012900
*/*  IF THE POINTER PART OF THE BASING IS NULL THEN                  */ 00013500
*/*     NO VIA( ) BASING EXPRESSION IS GENERATED                     */ 00014100
*/*  ELSE IF ACBVPTR IS SPECIFIED IT IS THE ONLY BASING VARIABLE     */ 00014700
*/*            (I.E. ACBVPTR IMPLICITLY INCLUDES THE SPACEID)        */ 00015300
*/*  ELSE IF ACBALET SPECIFIED IT IS USED AS THE SPACEID VAR         */ 00015900
*/*  ELSE IF IDARLS_ALET IS SPECIFIED IT IS USED AS THE SPACEID      */ 00016500
*/*  ELSE THE DEFAULT IS NO SPACEID BASING                           */ 00017100
*/*                                                                  */ 00017700
*/* CONTROL BLOCK EXTENSION BASING:                                  */ 00018300
*/*  IF ACBVPTR IS SPECIFIED, IT'S SPACEID IS EXTRACTED FOR          */ 00018900
*/*     BASING THE EXTENSION BLOCK.                                  */ 00019500
*/*  ELSE IF ACBALET IS SPECIFIED, IT IS USED AS THE SPACEID         */ 00020100
*/*     FOR THE EXTENSION BLOCK.                                     */ 00020700
*/*                                                                  */ 00021300
*/*BASING EXAMPLES:                                                  */ 00021900
*/* POINTER CONTROL VARIABLE:                                        */ 00022500
*/*   %ACBBASD = ''             SPECIFIES BASED                      */ 00023100
*/*OR %ACBBASD = 'NONE'         SPECIFIES NO BASING STATEMENT        */ 00023700
*/*                             AND IMPLIES NO SPACEID.              */ 00024300
*/*                             NOTE:  THIS SPECIFICATION WOULD      */ 00024900
*/*                               NOT BE APPROPRIATE FOR ANY         */ 00025500
*/*                               CB WITH AN EXTENSION CB.           */ 00026100
*/*OR %ACBBASD = 'ACB_PTR'      WHERE ACB_PTR IS PTR(31)             */ 00026700
*/*OR %ACBVPTR = 'ACB_VPTR'     WHERE ACB_VPTR IS VIAPTR             */ 00027300
*/*                                                                  */ 00027900
*/* SPACEID CONTROL VARIABLE:                                        */ 00028500
*/*   %ACBVPTR = 'ACB_VPTR'     WHERE ACB_VPTR IS VIAPTR             */ 00029100
*/*OR %ACBALET = 'ACB_ALET'     WHERE ACB_ALET IS FIXED(32)          */ 00029700
*/*OR %IDARLS_ALET = 'VMIB_DS_ALET'                                  */ 00030300
*/*                                                                  */ 00030900
*/********************************************************************/ 00031500
*%GOTO   ACBBSLXY;                            /*                 @L2A*/ 00032100
.ACBBSLXX ANOP                                                    @L2A  00032700
*%ACBBSLXY:;                                  /*                 @L2A*/ 00033300
*/*                                                                  */ 00033900
*/*   CREATED BY = ACB MACRO INSTRUCTION OR BY GENCB                 */ 00034500
*/*                                                                  */ 00035100
*/*   CHANGE ACTIVITY =                                              */ 00035700
*/*       C87700,155146                                      @ZM30033*/ 00036300
*/*       CONTROL BLOCKS IN COMMON SUPPORT                   @ZA16012*/ 00036900
*/*       MVS GUSHER SUPPORT                                 @G29ASRL*/ 00037500
*/*       CBMM SPLIT SUPPORT                                 @ZA34940*/ 00038100
*/* $L1=DF/EF,JDM1113,4/1/80,STLASN: DF/EF SUPPORT RELEASE 1.0   @L1A*/ 00038700
*/* $L2=DFP,JDP1110,,STLJRB: MVS/XA DFP RELEASE 1.1 VSAM 31-BIT  @L2A*/ 00039300
*/* $L9=DFP,HDP2230,,STLJRB: MVS/XA DFP RELEASE 2.3 VSAM 31-BIT  @L9A*/ 00042400
*/* $H1=DFP,JDP1111,,STLTMS: MVS/XA DFP RELEASE 1.2                  */ 00079900
*/*                                                          @ZA62372*/ 00086100
*/*                                                          @ZA69600*/ 00092300
*/* $PA=DFP,HDP2102,,STLHES: MVS/XA DFP V2R1M0                   @PAS*/ 00098500
*/* ADD CODE FOR BDT                                         @ZA92383*/ 00101700
*/* CORRECT PLS CODE MISSING FOR OZ34940 FROM JDP1111        @ZA87807*/ 00103300
*/* $LP=DFP,HDP2230,,STLJTP: MVS/XA DFP RELEASE 2.3 31/24 BIT    @LPA*/ 00103800
*/* DEFINE BIT TO IGNORE SHARED DASD                         @YA03157*/ 00104100
*/* APAR TO SHIP 31/24 BIT CODE                              @YA03564*/ 00104300
*/* $LX=DFP,HDP3330,,STLJRB: DFM SUPPORT                         @LXA*/ 00104600
*/* BACKUP WHILE OPEN                                        @YA39674*/ 00104700
*/* OY41855,HPD3320,09/18/91,SJPLTLD: NO EXCL CTL WT SPE     @YA41855*/ 00104800
*/* $LS=DFSMS,HDZ11B0,07/21/93,SJPLTLD: DFSMS/MVS V1 R2.0        @LSA*/ 00108900
*/* $LY=DFSMS,HDZ11C0,930326,SJPLRG: VSAM RLS                    @LYA*/ 00113100
*/*   1. ADDED ACBSUBNM - ADDRESS OF SUBSYSTEM NAME FIELD        @LYA*/ 00121400
*/*   2. ADDED ACBCNTL  - TYPE OF ACB = CONTROL ACB              @LYA*/ 00129700
*/*   3. ADDED ACBRLS   - MACRF = RLS SPECIFIED                  @LYA*/ 00138000
*/*   4. ADDED ACBRECOV - ALLOWED TO OPEN SPHERE THAT IS IN A    @LYA*/ 00146300
*/*                       RECOVERY REQUIRED STATE                @LYA*/ 00154600
*/*   5. ADDED RLS FLAGS (OVERLAYED ACBCCTYP)                    @LYA*/ 00162900
*/*      A. ACBNOJCL : 1=RLS JCL OVERRIDE TO BE IGNORED          @LYA*/ 00171200
*/*                                                                  */ 00175300
*/*      B. ACBRDI   : 1=READ INTEGRITY SPECIFIED ON ACB         @LYA*/ 00179500
*/*      C. ACBCNRD  : 1=CR PROTOCOL, 0=NRI PROTOCOL             @LYA*/ 00187800
*/* ADD REASON CODE TO ACB FOR EMPTY DATA SET                @WA03119*/ 00191900
*/* $LT=DFP,HDZ11B0,,SJPLLL: DFSMS/MVS 1.2 CATALOG OPEN-FOR-OUT  @LTA*/ 00192600
*/*                                                     @WA07856=@LTA*/ 00193300
*/* CORRECT ASSEMBLER CODING FOR ACBRSN                      @WA03969*/ 00194000
*/* $L0=DFSMS,HDZ11C0,11/09/94,SJPLJB: VSAM RLS                  @L0A*/ 00195000
*/* VSAM SNAPSHOT SUPPORT                                    @WA27392*/ 00195500
*/* $L3=K150064,HDZ11E0,10/07/97,TMENENDEZ:  TVS CRE SUPPORT     @L3A*/ 00195800
*/* $RC=DFSMS,HDZ11F0,06/07/99,SJPLVM: CICS VSAM RECOVERY        @RCA*/ 00195900
*/* ADD ACBVRECL                                    @WA36357 @WA35886*/ 00196000
*/*                                                                  */ 00196100
*/********************************************************************/ 00204900
* /*                                                                */  00254900
* /*     ACB DIAGRAM                                                */  00304900
* /*                                                                */  00354900
* /*   0  _______________________________________________           */  00404900
* /*     |           |           |                       |          */  00454900
* /*     |  ACBID    | ACBSTYP   |        ACBLENG        |          */  00504900
* /*   4 |___________|___________|_______________________|          */  00554900
* /*     |                                               |  @X04SVHS*/  00604900
* /*     |   ACBAMBL/ACBJWA/ACBIBCT/ACBAMWAP/ACBSUBNM    |      @LYC*/  00654900
* /*   8 |_______________________________________________|          */  00704900
* /*     |                                               |          */  00754900
* /*     |                     ACBINRTN                  |          */  00804900
* /*  12 |_______________________________________________|          */  00854900
* /*     |       ACBMACRF        |           |           |  @X04SVHS*/  00904900
* /*     | ACBMACR1  | ACBMACR2  | ACBBSTNO  | ACBSTRNO  |  @X04SVHS*/  00954900
* /*  16 |___________|___________|___________|___________|  @X04SVHS*/  01004900
* /*     |                       |                       |          */  01054900
* /*     |       ACBBUFND        |       ACBBUFNI        |          */  01104900
* /*  20 |_______________________|_______________________|          */  01154900
* /*     |                    ACBBUFPL                   |  @X04SVHS*/  01204900
* /*     |                       |       ACBJBUF         |  @WA03119*/  01238200
* /*     | ACBMACR3  | ACBSHRP   | ACBRSN    | ACBMACR4  |      @LYC*/  01271500
* /*  24 |___________|___________|_______________________|  @X04SVHS*/  01304900
* /*     |           |           |                       |          */  01354900
* /*     |           |           |       ACBDSORG        |          */  01404900
* /*     | ACBRECFM  | ACBCCTYP/ | ACBDSOR1  | ACBDSOR2  |      @LYC*/  01438200
* /*     |           | ACBFLGS   |           |           |      @LYA*/  01471500
* /*  28 |___________|___________|___________|___________|          */  01504900
* /*     |                                               |          */  01554900
* /*     |                   ACBMSGAR                    |  @X04SVHS*/  01604900
* /*  32 |_______________________________________________|          */  01654900
* /*     |                                               |          */  01704900
* /*     |                     ACBPASSW                  |          */  01754900
* /*  36 |_______________________________________________|          */  01804900
* /*     |                                               |          */  01854900
* /*     |            ACBEXLST/ACBUEL                    |          */  01904900
* /*  40 |_______________________________________________| __  B    */  01954900
* /*     |             OFFSET 40 BEFORE OPEN             |   | E    */  02004900
* /*     |                                               |   | F    */  02054900
* /*     |_                   ACBDDNM                   _|   | O    */  02104900
* /*     |                  ( 8 BYTES )                  |   | R    */  02154900
* /*     |                                               |   | E    */  02204900
* /*  48 |_______________________________________________|   |      */  02254900
* /*     |           |           |       ACBINFLG        |   | O    */  02304900
* /*     |  ACBOFLGS | ACBERFLG  | ACBINFL1  | ACBINFL2  |   | P    */  02354900
* /*     |___________|___________|___________|___________| __| E    */  02404900
* /*                                                           N    */  02454900
* /*                   OFFSET 40 AFTER OPEN                         */  02504900
* /*                                                                */  02554900
* /*  40  _______________________________________________  __  A    */  02604900
* /*     |                       |           |           |   | F    */  02654900
* /*     |        ACBTIOT        |  ACBINFL  | ACBAMETH  |   | T    */  02704900
* /*  44 |_______________________|___________|___________|   | E    */  02754900
* /*     |           |                                   |   | R    */  02804900
* /*     |  ACBERFL  |             ACBDEB                |   |      */  02854900
* /*  48 |___________|___________________________________|   | O    */  02904900
* /*     |           |           |                       |   | P    */  02954900
* /*     |  ACBOFLGS |  ACBERFLG |                       |   | E    */  03004900
* /*     |___________|___________|_______________________| __| N    */  03054900
* /*                                                                */  03104900
* /*  52  _______________________________________________           */  03154900
* /*     |                                               |          */  03204900
* /*     |                     ACBUJFCB                  |          */  03254900
* /*  56 |_______________________________________________|          */  03304900
* /*     |                                               |          */  03354900
* /*     |                     ACBBUFSP                  |          */  03404900
* /*  60 |_______________________________________________|          */  03454900
* /*     |                     |                         |          */  03504900
* /*     |  ACBBLKSZ/ACBMSGLN  |       ACBLRECL          |  @X04SVHS*/  03554900
* /*  64 |_____________________|_________________________|          */  03604900
* /*     |                                               |          */  03654900
* /*     |                  ACBUAPTR                     |          */  03704900
* /*  68 |_______________________________________________|          */  03754900
* /*     |                                               |          */  03804900
* /*     |                  ACBCBMWA                     |          */  03854900
* /*  72 |_______________________________________________|          */  03904900
* /*     |                                               |          */  03954900
* /*     |              ACBAPID/ACBAMAX                  |  @G29ASRL*/  04004900
* /*     |_______________________________________________|          */  04054900
* /*                                                                */  04104900
* /*           THE VTAM EXTENSION BEGINS AT OFFSET 76.              */  04154900
* /*          IT IS CONTIGUOUS TO THE COMMON AREA ABOVE.            */  04204900
* /*                                                                */  04254900
* /*  76  _______________________________________________           */  04304900
* /*     |                                               |    X03004*/  04354900
* /*     |                  ACBRTN                       |    X03004*/  04404900
* /*  80 |                      _________________________|    X03004*/  04454900
* /*     |                     |                         |    X03004*/  04504900
* /*     |                     |            *            |    X03004*/  04554900
* /*  84 |_____________________|_________________________|    X03004*/  04604900
* /*     |                                               |    X03004*/  04654900
* /*     |                     *                         |    X03004*/  04704900
* /*     |_______________________________________________|    X03004*/  04754900
* /*                                                                */  04804900
* /*     ACB DECLARATION                                            */  04854900
* /*                                                                */  04904900
*%GOTO   ACBBSL1 ;                          /*                  @L1M*/  04954900
         AGO   .ACBBAL                                             @L1M 05004900
*%ACBBSL1: ;                                                            05054900
*%;/******************************************************************/ 05059000
*%;/* FIRST: FIGURE OUT THE BASED PART OF THE BASING EXPRESSION.     */ 05063100
*%;/******************************************************************/ 05067200
* %IF  ACBVPTR ~=''       %THEN %ACBBASD = ACBVPTR;            /*@LYA*/ 05071300
* %IF  ACBBASD   =''      %THEN %ACBBASD ='BASED';             /*@LYA*/ 05075400
* %IF  ACBBASD   ='NONE'  %THEN %ACBBASD ='';                  /*@LYA*/ 05079500
* %IF  ACBBASD ~='BASED' %THEN                                          05083600
*  %IF ACBBASD ~=''       %THEN                                         05087700
*     %ACBBASD   ='BASED(' || ACBBASD || ')';                  /*@LYA*/ 05091800
*                                                                       05095900
*%;/******************************************************************/ 05100000
*%;/* SECOND: FIGURE OUT THE VIA PART OF THE BASING EXPRESSION.      */ 05104100
*%;/******************************************************************/ 05108200
* %ACBVIA = '';                                                /*@LYA*/ 05112300
* %IF ACBALET   = '' %THEN %ACBALET = IDARLS_ALET;             /*@LYA*/ 05116400
* %IF ACBVPTR ~= '' %THEN %ACBALET = '';                       /*@LYA*/ 05120500
* %IF ACBALET ~= '' %THEN %ACBVIA = 'VIA('||ACBALET||')';      /*@LYA*/ 05124600
* %IF ACBBASD   = '' %THEN %ACBVIA = '';                       /*@LYA*/ 05128700
*                                                                       05132800
*%;/******************************************************************/ 05136900
*%;/* GENERATE THE CB BASING STATEMENT                               */ 05141000
*%;/******************************************************************/ 05145100
* DCL 1 IFGACB ACBBASD ACBVIA,                                 /*@LYA*/ 05149200
*          2 ACBCOMN,                       /* ACB COMMON SECTION       05154900
*                                                             X03004*/  05204900
*              4 ACBID       PTR(8),        /* ACB IDENTIFIER       */  05254900
*                % ACBIDVAL = '''A0''X';    /* IDENTIFIER VALUE     */  05304900
*              4 ACBSTYP     PTR(8),        /* ACB SUBTYPE          */  05354900
*                % ACBSVSAM = '''10''X';    /* VSAM SUBTYPE @X04SVHS*/  05404900
*                % ACBSVRP  = '''11''X';    /* VRP SUBTYPE  @X04SVHS*/  05454900
*                % ACBSVTAM = '''20''X';    /* VTAM SUBTYPE @X04SVHS*/  05504900
*                % ACBS3540 = '''40''X';    /* 3540 SUBTYPE @X04SVHS*/  05554900
*              4 ACBLENG     FIXED(15),     /* ACB LENGTH IN BYTES  */  05604900
*                5 ACBLENG2  FIXED(15),     /* ACB LENGTH IN BYTES  */  05654900
*                  6 ACBLEN2 FIXED(15),     /* ACB LENGTH IN BYTES      05704900
*                                                             X03004*/  05754900
*              4 ACBAMBL     PTR(31),       /* AMB LIST ADDRESS     */  05804900
*                5 ACBJWA  PTR(31),         /* JES WORKAREA ADDRESS */  05854900
*                  6 ACBIBCT PTR(31),       /* IBCT ADDRESS         */  05904900
*                    7 ACBAMWAP PTR(31),    /* ACCESS METHOD WORKAREA   05954900
*                                              POINTER      @G29ASRL*/  06004900
*                      8 ACBSUBNM PTR(31),  /* SUBSYSTEM NAME ADDRESS   06021500
*                                                               @LYA*/  06038100
*              4 ACBINRTN    PTR(31),       /* INTERFACE ROUTINE        06054900
*                                              ADDRESS              */  06104900
*              4 ACBMACRF    BIT(16),       /* MACRF FLAGS          */  06154900
*                5 ACBMACR1  BIT(8),        /* MACRF FIRST BYTE     */  06204900
*                  6 ACBKEY  BIT(1),        /* ACCESS DATA VIA INDEX*/  06254900
*                  6 ACBADR  BIT(1),        /* ACCESS WITHOUT INDEX */  06304900
*                    7 ACBADD BIT(1),       /* SAME AS ABOVE        */  06354900
*                  6 ACBCNV  BIT(1),        /* CONTROL INTERVAL         06404900
*                                              PROCESSING           */  06454900
*                    7 ACBBLK BIT(1),       /* SAME AS ABOVE        */  06504900
*                  6 ACBSEQ  BIT(1),        /* SEQUENTIAL PROCESSING*/  06554900
*                  6 ACBDIR  BIT(1),        /* DIRECT PROCESSING    */  06604900
*                  6 ACBIN   BIT(1),        /* GET, READ            */  06654900
*                  6 ACBOUT  BIT(1),        /* PUT, WRITE           */  06704900
*                  6 ACBUBF  BIT(1),        /* USER BUFFERS         */  06754900
*                5 ACBMACR2  BIT(8),        /* MACRF SECOND BYTE    */  06804900
*                  6 ACBNTRUN  BIT(1),      /* DEFINED ONLY WHEN        06810700
*                                              OUTPUT AND ACBRECAF IS   06816500
*                                              ON. THE SYSTEM IS TO     06822300
*                                              ENSURE THAT THE LOGICAL  06828100
*                                              RECORD LENGTH WILL BE    06833900
*                                              THE SAME WHEN THE DATA   06839700
*                                              IS READ (NO BLANK        06845500
*                                              TRUNCATION). BIT NOT     06851300
*                                              DEFINED FOR INPUT.       06857100
*                                                           @ZA92383*/  06862900
*                  6 ACBCCANY  BIT(1),      /* THE CONTROL CHARACTER    06868700
*                                              TYPE IS INDICATED IN     06874500
*                                              RPLOPT4 AFTER EACH GET.  06880300
*                                              NOT DEFINED FOR OUTPUT.  06886100
*                                                           @ZA92383*/  06891900
*                  6 ACBBWO  BIT(1),        /* ELIGIBLE FOR BACKUP      06896200
*                                              WHILE OPEN   @YA39674*/  06900500
*                  6 ACBSKP  BIT(1),        /* SKIP SEQUENTIAL          06904900
*                                              PROCESSING           */  06954900
*                  6 ACBLOGON BIT(1),       /* LOGON INDICATOR(VTAM)    07004900
*                                                             X03004*/  07054900
*                  6 ACBRST  BIT(1),        /* SET DATA SET TO EMPTY    07104900
*                                              STATE        @X04SVHS*/  07154900
*                  6 ACBDSN  BIT(1),        /* BASIC SUBTASK SHARED     07204900
*                                              CONTROL BLOCK CONNECTION 07254900
*                                              ON COMMON DSNAMES        07304900
*                                                           @X04SVHS*/  07354900
*                  6 ACBAIX  BIT(1),        /* ENTITY TO BE PROCESSED   07404900
*                                              IS AIX OF THE PATH       07454900
*                                              SPECIFIED IN THE GIVEN   07504900
*                                              DDNAME       @X04SVHS*/  07554900
*              4 ACBBSTNO    PTR(8),        /* NO OF CONCURRENT STRINGS 07604900
*                                              FOR AIX PATH @X04SVHS*/  07654900
*              4 ACBSTRNO    PTR(8),        /* NUMBER OF STRINGS        07704900
*                                                           @X04SVHS*/  07754900
*              4 ACBBUFND    FIXED(15),     /* NUMBER OF BUFFERS        07804900
*                                              REQUESTED FOR DATA   */  07854900
*              4 ACBBUFNI    FIXED(15),     /* NUMBER OF BUFFERS        07904900
*                                              REQUESTED FOR INDEX  */  07954900
*              4 ACBBUFPL  PTR(31),         /* JES BUFFER POOL ADDR */  08004900
*                5 ACBMACR3 BIT(8),         /* MACRF THIRD BYTE         08054900
*                                                           @X04SVHS*/  08104900
*                  6 ACBNLW   BIT(1),       /* NO LSR EXCL. CONTROL     08138200
*                                              WAIT         @YA41855*/  08171500
*                  6 ACBLSR   BIT(1),       /* LOCAL SHARED RESOURCE    08204900
*                                                           @X04SVHS*/  08254900
*                  6 ACBGSR   BIT(1),       /* GLOBAL SHARED RESOURCE   08304900
*                                                           @X04SVHS*/  08354900
*                  6 ACBICI   BIT(1),       /* IMPROVED CONTROL         08404900
*                                              INTERVAL PROCESSING      08454900
*                                                           @X04SVHS*/  08504900
*                  6 ACBDFR   BIT(1),       /* DEFER WRITES @X04SVHS*/  08554900
*                  6 ACBSIS   BIT(1),       /* SEQUENTIAL INSERT        08604900
*                                              STRATEGY     @X04SVHS*/  08654900
*                  6 ACBNCFX  BIT(1),       /* NFX=0/CFX=1  @X04SVHS*/  08704900
*                  6 ACBMODE  BIT(1),       /* RMODE31 FOR BUFFERS      08738200
*                                              SAME AS ACBR31B  @LPC*/  08771500
*                5 ACBSHRP  FIXED(8),       /* SHARED RESOURCE  @L2C*/  08804900
*                                           /* POOL ID NUMBER   @L2A*/  08854900
*                5 ACBJBUF FIXED(15),       /* NUMBER OF BUFFERS        08904900
*                                              REQUESTED FOR JOURNAL*/  08954900
*                  6 ACBRSN    BIT(8),      /* VSAM REASON CODE         08959900
*                                                           @WA03119*/  08964900
*                  6 ACBMACR4 BIT(8),       /* MACRF BYTE 4     @LYA*/  08974900
*                    7 ACBRLS BIT(1),       /* RLS PROCESSING   @LYA*/  08984900
*                    7 ACBSNP BIT(1),       /* SNP OPTION   @WA27392*/  08991500
*                    7 ACBNOCVR BIT(1),     /* ON: CICSVR NOT   @RCA*/  08994800
*                                           /*  ALLOWED-DEFAULT @RCA*/  08998100
*                    7 *      BIT(5),       /* RESERVED         @RCC*/  09001400
*              4 ACBRECFM    BIT(8),        /* RECORD FORMAT        */  09004900
*                  6 ACBRECAF  BIT(1),      /* JES FORMAT           */  09054900
*                  6 *         BIT(6),      /* RESERVED             */  09104900
*              4 ACBCCTYP    BIT(8),        /* CONTROL CHARACTER    */  09154900
*               5 ACBFLGS   BIT(8),        /* RLS FLAGS         @LYA*/  09188200
*                6 ACBTRCID  BIT(2),        /* 3800 TRANSLATE TABLE     09221500
*                                              (VS1)        @ZA92383*/  09254900
*                 7 ACBNOJCL  BIT(1),     /* IGNORE RLS JCL OVERIDE     09271500
*                                                               @LYA*/  09288100
*                 7 ACBRDI    BIT(1),     /* 1=READ INTEGRITY SPECIFIED 09304700
*                                            ON THE ACB          @LYA*/ 09321300
*                6  *         BIT(2),        /* RESERVED             */ 09337900
*                  7 ACBCNRD   BIT(1),     /* 1(0)=CR(NRI) PROTOCOL     09354500
*                                                               @LYA*/  09371100
*                  7 ACBDLIXI  BIT(1),      /* RESERVED         @LSA*/  09379400
*                6 ACBASA    BIT(4),        /* CONTROL CHARACTER        09387700
*                                              TYPE                 */  09404900
*                  7 ACBFLOAT  BIT(1),      /* FLOAT PROCESSING @L0C*/  09425700
*                  7 ACBCCASA  BIT(1),      /* ASA CHARACTERS   @LYC*/  09446500
*                    9 ACBCRE  BIT(1),      /* RLSREAD=CRE      @L3A*/  09456900
*                  7 ACBCCMCH  BIT(1),      /* MACHINE CHARACTERS       09467300
*                                                               @LYC*/  09488100
*                   8 ACBVRECL BIT(1),     /* ON = THE CORRECT MAX      09491500
*                                             REC LEN IS WANTED FOR     09494900
*                                             RLS SHOWCB ACB LRECL.     09498300
*                                             OFF = OLD VALUE WANTED    09501700
*                                                  @WA36357 @WA35886*/  09505100
*                  7 ACBCCDSI  BIT(1),      /* DATA STREAM. NO          09508900
*                                              CONTROL CHARACTERS.      09529900
*                                                               @LYC*/  09542400
*              4 ACBOPT      BIT(16),       /* NON-USER OPTIONS     */  09554900
*                5 ACBDSORG  BIT(16),       /* MATCH ACBDORGA WITH      09604900
*                                                         DCBDSORG  */  09654900
*                  6 ACBDSOR1  BIT(8),      /* FIRST BYTE       @L1A*/  09704900
*                    7 ACBCROPS BIT(2),     /* CHECKPOINT/RESTART       09754900
*                                              OPTIONS          @L1C*/  09804900
*                      9 ACBCRNCK BIT(1),   /* NO CHK FOR MODIF @L1C*/  09854900
*                      9 ACBCRNRE BIT(1),   /* NO DATA ERASE OR         09904900
*                                              REPOSITION       @L1C*/  09954900
*                    7 ACBDVIND BIT(1),     /* DEVICE INDICATOR         10004900
*                                                               @L1C*/  10054900
*                      8 ACBOPTJ BIT(1),    /* 3800 CONTROL CHARACTER   10104900
*                                              PRESENT          @L1C*/  10154900
*                    7 *       BIT(5),      /* RESERVED             */  10204900
*                  6 ACBDSOR2  BIT(8),      /* RESERVED             */  10254900
*                    7 *       BIT(4),      /* RESERVED             */  10304900
*                    7 ACBDORGA BIT(1),     /* ACB INDICATOR        */  10354900
*                    7 *       BIT(3),      /* RESERVED             */  10404900
*              4 ACBMSGAR    PTR(31),       /* MSG AREA     @X04SVHS*/  10454900
*              4 ACBPASSW    PTR(31),       /* PASSWORD ADDRESS     */  10504900
*              4 ACBEXLST    PTR(31),       /* USER EXIT LIST ADDR  */  10554900
*                5 ACBUEL    PTR(31),       /* SAME AS ABOVE        */  10604900
* /* BEFORE OPEN                                                    */  10654900
* /* (FOR VTAM, ACBDDNM INITIALIZED TO X'FF000000000000')     X03004*/  10704900
*              4 ACBDDNM     CHAR(8) BDY(WORD), /*  DDNAME          */  10754900
* /* AFTER OPEN                                                     */  10804900
*                5 ACBTIOT   FIXED (16),    /* TIOT OFFSET      @L9C*/  10854900
*                5 ACBINFL   PTR (8),       /* INDICATOR FLAGS      */  10904900
*                5 ACBAMETH  PTR (8),       /* ACCESS METHOD TYPE   */  10954900
*                  6 ACBAM   PTR (8),       /* ACCESS METHOD TYPE       11004900
*                                                             X03004*/  11054900
*                     % ACBVSAM = '''11''X';   /* VSAM              */  11104900
*                     % ACBJAM  = '''21''X';   /* JES/JAM           */  11154900
*                     % ACBRTAM = '''22''X';   /* JES/RTAM          */  11204900
*                     % ACBRCI  = '''23''X';   /* JES/RCI           */  11254900
*                     % ACBTCAM = '''31''X';   /* TCAM              */  11304900
*                     % ACBSUBS = '''41''X';   /* SUBSYSTEMS        */  11354900
*                     % ACBVTAM = '''60''X';   /* VTAM        X03004*/  11404900
*                5 ACBERFL   BIT(8),        /* ERROR FLAGS          */  11454900
*                5 ACBDEB    PTR(24),       /* DEB ADDRESS          */  11504900
* /* NOT MOVED BY OPEN                                              */  11554900
*              4 ACBOFLGS    BIT(8),        /* OPEN / CLOSE FLAGS   */  11604900
*                5 ACBR31B   BIT(1),        /* 31 BIT BUFFERS   @LPA*/  11638200
*                5 ACBR31C   BIT(1),        /* 31 BIT CB'S      @LPA*/  11671500
*                5 ACBEOV    BIT(1),        /* EOV CONCATENATION    */  11704900
*                  6 ACBNOCUP BIT(1),       /* ON = DON'T SET THE OPEN  11717400
*                                              INDICATOR IN CATALOG     11729900
*                                              (MEDIA MGR ONLY) @LTA*/  11742400
*                5 ACBOPEN   BIT(1),        /* ACB IS OPEN          */  11754900
*                5 ACBDSERR  BIT(1),        /* NO FURTHER REQUESTS      11804900
*                                              POSSIBLE AGAINST ACB */  11854900
*                5 ACBRECOV  BIT(1),        /* ALLOW OPEN OF SPHERE     11879900
*                                              MARKED AS 'RECOVERY      11904900
*                                              REQUIRED'        @LYC*/  11929900
*                5 ACBEXFG   BIT(1),        /* USER EXIT FLAG       */  11954900
*                  6 ACBLOCK BIT(1),        /* ACB IS LOCKED  X03004*/  12004900
*                5 ACBIOSFG  BIT(1),        /* OPEN/CLOSE IN CONTROL*/  12054900
*                  6 ACBBUSY BIT(1),        /* ACB IS BUSY    X03004*/  12104900
*              4 ACBERFLG    BIT(8),        /* ERROR FLAGS          */  12154900
*%/* THE FOLLOWING CODES ARE COMMON TO ALL ACCESS METHODS.  CODES   */  12204900
* /* FOR A SPECIFIC ACCESS METHOD ARE LOCATED IN THE EXTENSION      */  12254900
* /* FOR THAT ACCESS METHOD                                   X03004*/  12304900
*                  ACBOALR  = '''04''X';    /* ACB ALREADY OPEN     */  12354900
*                % ACBCALR  = '''04''X';    /* ACB NOT OPEN @ZM30033*/  12404900
*              4 ACBINFLG    BIT(16),       /* INDICATOR FLAGS      */  12454900
*                5 ACBINFL1  BIT(8),        /* FIRST BYTE    @ZA16012*/ 12504900
*                  6 *         BIT(1),      /* RESERVED FOR EXCP    */  12554900
*                  6 ACBJEPS   BIT(1),      /* JEPS PROCESSING      */  12604900
*                  6 ACBIJRQE  BIT(1),      /* RQE BEING HELD BY JAM*/  12654900
*                  6 ACBCAT    BIT(1),      /* ACB FOR VSAM CATALOG */  12704900
*                  6 ACBSCRA   BIT(1),      /* CATALOG CONTROL BLOCK    12754900
*                                              SYSTEM AREA  @X04SVHS*/  12804900
*                  6 ACBUCRA   BIT(1),      /* CATALOG CONTROL BLOCK    12854900
*                                              USER AREA    @X04SVHS*/  12904900
*                  6 ACBVVIC   BIT(1),      /* DATA SET BEING OPENED    12954900
*                                              IS SYS1.VVIC @X04SVHS*/  13004900
*                    7 ACBSDS  BIT(1),      /* OPEN AS SYSTEM DATA      13054900
*                                              SET           @Z40SVUC*/ 13104900
*                  6 ACBBYPSS  BIT(1),      /* BYPASS SECURITY ON OPEN  13154900
*                                              IF USER AUTH  @Z40RSUC*/ 13204900
*                5 ACBINFL2  BIT(8),        /* SECOND BYTE       @L1C*/ 13254900
*                  6 ACBSWARN  BIT(1),      /* SUPPRESS OPEN WARNING    13304900
*                                              MSG AND IMPLICIT VERIFY  13354900
*                                              IF DATA SET NOT PROPERLY 13404900
*                                              CLOSED CONDITION IS      13454900
*                                              DETECTED          @L1A*/ 13504900
*                  6 ACBSOPEN  BIT(1),      /* SUPPRESS CLOSE CATALOG   13554900
*                                              UPDATE OF THE OPEN       13604900
*                                              INDICATOR         @L1A*/ 13654900
*                  6 ACBCBIC   BIT(1),      /* OPEN WITH CONTROL BLOCKS 13704900
*                                              IN COMMON STORAGE AREA   13754900
*                                                            @ZA16012*/ 13804900
*                  6 ACBCATX   BIT(1),      /* CATX OPEN         @L1A*/ 13854900
*                  6 ACBCASRS  BIT(1),      /* CAS RESTART       @PAS*/ 13888200
*                  6 ACBISHRD  BIT(1),      /* IGNORE SHARED DASD       13904800
*                                                            @YA03157*/ 13921400
*                  6 ACBSHROP  BIT(2),      /* SHARE OPTIONS     @LXC*/ 13929700
*                    7 ACBSHR02 BIT(1), /* CROSS REGION OPTION 2 @LXA*/ 13938000
*                    7 ACBSHR01 BIT(1), /* CROSS REGION OPTION 1 @LXA*/ 13946300
*              4 ACBUJFCB    PTR(31),       /* USER JFCB ADDRESS    */  13954900
*                5 ACBOPTN BIT(8),          /* JAM UCS INDICATOR    */  14004900
*                5 *       PTR(24),         /* RESERVED             */  14054900
*              4 ACBBUFSP    FIXED(31),     /* SIZE AVAILABLE FOR       14104900
*                                              BUFFERS              */  14154900
*              4 ACBBLKSZ    FIXED(15),     /* BLOCKSIZE            */  14204900
*                5 ACBMSGLN  FIXED(15),     /* LENGTH OF MSG AREA       14254900
*                                                           @X04SVHS*/  14304900
*              4 ACBLRECL    FIXED(15),     /* LOGICAL RECORD LENGTH*/  14354900
*              4 ACBUAPTR    PTR(31),       /* USER WORKAREA ADDR       14404900
*                                              CAXWA ADDRESS FOR        14454900
*                                              CATALOG OPEN         */  14504900
*              4 ACBCBMWA    PTR(31),       /* CBM WORK AREA ADDRESS*/  14554900
   %;                                       /*                  2@L9D*/ 14604900
            %IF ACBRPLXL='3540'             /* IS IT 3540   @X04AAHS*/  14654900
              %THEN  %GOTO ACBE2;           /* GET 3540 EXT @X04AAHS*/  14704900
*              4 ACBAPID     PTR(31),       /* APPLICATION ID           14804900
*                                              ADDRESS        X03004*/  14854900
*                5 ACBAMAX PTR(31),         /* ACCESS METHOD ACB        14904900
*                                              EXTENSION    @ZA62372*/  14954900
*      %INCLUDE SYSLIB(IFGACBVS);  /* GET VSAM EXTENSION    @ZA62372*/  15004900
*                                                                       15054900
*      DCL ACBSCNTL BIT(8) CONSTANT('12'X); /* VSAM CONTROL ACB @LYA*/  15079900
*%GOTO ACBBSL2 ;                                                        15104900
*ACBE2 : ;                                                              15154900
*               4 ACBAPID    PTR(31),       /* APPLICATION ID ADDRESS*/ 15204900
*                 5 ACBAMAX PTR(31),        /* ACCESS METHOD ACB        15254900
*                                              EXTENSION    @G29ASRL*/  15354900
*          %INCLUDE SYSLIB(IFGACB35);       /* GET 3540 EXT  @X04AAHS*/ 15404900
*%GOTO    ACBBSL2 ;                                                     15454900
* /*                                                                */  15804900
* /*                         ASSEMBLER DSECT FOR ACB                    15854900
*                                                                       15904900
.ACBBAL  ANOP                                                           15954900
         AIF   ('&DSECT' EQ 'NO').ACBNODS                               16004900
IFGACB   DSECT                                 ACCESS METHOD CONTROL    16054900
*                                              BLOCK                    16104900
         AGO   .ACBDSCT                                                 16154900
.ACBNODS ANOP                                                           16204900
IFGACB   DS    0D                              ACCESS METHOD CONTROL    16254900
*                                              BLOCK                    16304900
.ACBDSCT ANOP                                                           16354900
ACBID    DS    XL1                             ACB IDENTIFIER           16404900
ACBIDVAL EQU   X'A0'                           IDENTIFIER VALUE - X'A0' 16454900
ACBSTYP  DS    XL1                             ACB SUBTYPE              16504900
ACBSVSAM EQU   X'10'                           VSAM SUBTYPE     X04SVHS 16554900
ACBSVRP  EQU   X'11'                           VRP SUBTYPE      X04SVHS 16604900
ACBSCNTL EQU   X'12'                           VSAM CONTROL ACB    @LYA 16629900
ACBSVTAM EQU   X'20'                           VTAM SUBTYPE     X04SVHS 16654900
ACBS3540 EQU   X'40'                           3540 SUBTYPE     X04SVHS 16704900
ACBLENG  DS    0H                              ACB LENGTH IN BYTES      16754900
ACBLEN2  DS    0H                              ALTERNATE NAME FOR       16804900
*                                              ACBLENG           X03004 16854900
ACBLENG2 DS    H                               ALTERNATE NAME FOR       16904900
*                                              ACBLENG           X03004 16954900
ACBAMBL  DS    0A                              AMB LIST ADDRESS(VSAM)   17004900
ACBJWA   DS    0A                              JES WORK AREA ADDRESS    17054900
ACBIBCT  DS    0A                              INTERFACE BUFFER CONTROL 17104900
*                                              TABLE (RTAM)    @G29ASRL 17154900
ACBSUBNM DS    0A                              SUBSYSTEM NAME ADDR @LYA 17179900
ACBAMWAP DS    A                               ACCESS METHOD WORKAREA   17204900
*                                              POINTER         @G29ASRL 17254900
ACBINRTN DS    A                               DATA MANAGEMENT          17304900
*                                              INTERFACE ROUTINE        17354900
*                                              ADDRESS; VTAM REQUEST    17404900
*                                              PROCESSOR ADDRESS X03004 17454900
ACBMACRF DS    0BL2                            MACRF PROCESSING OPTIONS 17504900
ACBMACR1 DS    BL1                             MACRF FIRST BYTE         17554900
ACBKEY   EQU   X'80'                           KEYED PROCESSING VIA     17604900
*                                              INDEX                    17654900
ACBADR   EQU   X'40'                           ADDRESSED PROCESSING     17704900
*                                              WITHOUT INDEX            17754900
ACBADD   EQU   X'40'                           ALTERNATE NAME FOR       17804900
*                                              ACBADR                   17854900
ACBCNV   EQU   X'20'                           PROCESSING BY            17904900
*                                              CONTROL INTERVAL         17954900
ACBBLK   EQU   X'20'                           ALTERNATE NAME FOR       18004900
*                                              ACBCNV                   18054900
ACBSEQ   EQU   X'10'                           SEQUENTIAL PROCESSING    18104900
ACBDIR   EQU   X'08'                           DIRECT PROCESSING        18154900
ACBIN    EQU   X'04'                           INPUT PROCESSING USING   18204900
*                                              GET OR READ              18254900
ACBOUT   EQU   X'02'                           OUTPUT PROCESSING USING  18304900
*                                              PUT OR WRITE             18354900
ACBUBF   EQU   X'01'                           USER CONTROLS BUFFERS -  18404900
*                                              VALID ONLY WITH CONTROL  18454900
*                                              INTERVAL PROCESSING      18504900
ACBMACR2 DS    BL1                             MACRF SECOND BYTE        18554900
ACBNTRUN EQU   X'80'                           DEFINED ONLY WHEN        18558000
*                                              OUTPUT AND ACBRECAF IS   18561100
*                                              ON. THE SYSTEM IS TO     18564200
*                                              ENSURE THAT THE LOGICAL  18567300
*                                              RECORD LENGTH WILL BE    18570400
*                                              THE SAME WHEN THE DATA   18573500
*                                              IS READ (NO BLANK        18576600
*                                              TRUNCATION). BIT NOT     18579700
*                                              DEFINED FOR INPUT.       18582800
*                                                             @ZA92383  18585900
ACBCCANY EQU   X'40'                           THE CONTROL CHARACTER    18589000
*                                              TYPE IS INDICATED IN     18592100
*                                              RPLOPT4 AFTER EACH GET.  18595200
*                                              NOT DEFINED FOR OUTPUT.  18598300
*                                                             @ZA92383  18601400
ACBBWO   EQU   X'20'                           ELIGIBLE FOR BACKUP      18602500
*                                              WHILE OPEN     @YA39674  18603600
ACBSKP   EQU   X'10'                           SKIP SEQUENTIAL          18604900
*                                              PROCESSING               18654900
ACBLOGON EQU   X'08'                           LOGON REQUESTS TO AN     18704900
*                                              APPLICATION WILL BE      18754900
*                                              REJECTED(VTAM)    X03004 18804900
ACBRST   EQU   X'04'                           SET DATA SET TO  X04SVHS 18854900
*                                              EMPTY STATE      X04SVHS 18904900
ACBDSN   EQU   X'02'                           BASIC SUBTASK SHARED     18954900
*                                              CONTROL BLOCK CONNECTION 19004900
*                                              ON COMMON DSNAMES        19054900
*                                                               X04SVHS 19104900
ACBAIX   EQU   X'01'                           ENTITY TO BE PROCESSED   19154900
*                                              IS AIX PATH SPECIFIED IN 19204900
*                                              IN THE GIVEN DDNAME      19254900
*                                                               X04SVHS 19304900
ACBBSTNO DS    FL1                             NUMBER OF CONCURRENT     19354900
*                                              STRINGS FOR AIX  X04SVHS 19404900
*                                              PATH             X04SVHS 19454900
ACBSTRNO DS    FL1                             NUMBER OF CONCURRENT     19504900
*                                              REQUEST STRINGS  X04SVHS 19554900
ACBBUFND DS    H                               NUMBER OF DATA RECORD    19604900
*                                              BUFFERS                  19654900
ACBBUFNI DS    H                               NUMBER OF INDEX RECORD   19704900
*                                              BUFFERS                  19754900
ACBBUFPL DS    0A                              JES BUFFER POOL          19804900
ACBLFB   DS    0A                              RESERVED NAME            19854900
ACBMACR3 DS    XL1                             MACRF THIRD BYTE X04SVHS 19904900
ACBNLW   EQU   X'80'                           NO EXCL CTL WAIT@YA41855 19921500
*                                                              @YA41855 19938100
ACBLSR   EQU   X'40'                           LOCAL SHARED RESOURCE    19954900
*                                                               X04SVHS 20004900
ACBGSR   EQU   X'20'                           GLOBAL SHARED RESOURCE   20054900
*                                                               X04SVHS 20104900
ACBICI   EQU   X'10'                           IMPROVED CONTROL         20154900
*                                              INTERVAL PROCESSING      20204900
*                                                               X04SVHS 20254900
ACBDFR   EQU   X'08'                           DEFER WRITES     X04SVHS 20304900
ACBSIS   EQU   X'04'                           SEQUENTIAL INSERT        20354900
*                                              STRATEGY         X04SVHS 20404900
ACBNCFX  EQU   X'02'                           NFX=0/CFX=1      X04SVHS 20454900
ACBMODE  EQU   X'01'                           31-BIT BUFFER ADDRESS    20488200
*                                              SEE ACBR31B         @LPC 20521500
ACBSHRP  DS    XL1                             SHARED RESOURCE POOL    X20554900
                                               ID NUMBER           @L2C 20604900
ACBJBUF  DS    H                               NUMBER OF JOURNAL        20654900
*                                              BUFFERS(VSAM)            20704900
ACBRSN   EQU   ACBJBUF,1                       REASON CODE     @WA03969 20717400
ACBMACR4 EQU   ACBJBUF+1,1                     ACB MACRF BYTE 4    @LYA 20729900
ACBRLS   EQU   X'80'                           RLS PROCESSING      @LYA 20742400
ACBSNP   EQU   X'40'                           SNP OPTION      @WA27392 20748600
ACBNOCVR EQU   X'20'                           CICSVR NOT ALLOWED  @RCA 20751700
ACBRECFM DS    BL1                             RECORD FORMAT            20754900
ACBRECAF EQU   X'80'                           JES FORMAT               20804900
ACBCCTYP DS    BL1                             CONTROL CHARACTER TYPE   20854900
ACBTRCID EQU   X'C0'                           3800 TRANSLATE TABLE+8   20904900
*                                              (VS1)           @ZA92383 20954900
ACBDLIXI EQU   X'10'                           CROSS INVALIDATE   @LSA  20979900
ACBCCASA EQU   X'04'                           ASA CONTROL CHARACTERS   21004900
ACBCCMCH EQU   X'02'                           MACHINE CONTROL          21054900
*                                              CHARACTERS               21104900
ACBCCDSI EQU   X'01'                           DATA STREAM. NO CONTROL  21121500
*                                              CHARACTERS.     @ZA92383 21138100
ACBFLGS  EQU   ACBCCTYP,1                      MISC VSAM FLAGS     @LYA 21140500
ACBNOJCL EQU   X'80'                           RLS JCL OVERRIDE TO @LYA 21142900
*                                              BE IGNORED          @LYA 21145300
ACBRDI   EQU   X'40'                           1=READ INTEGRITY    @LYA 21147700
*                                              SPECIFIED ON ACB    @LYA 21150100
ACBCNRD  EQU   X'20'                           1(0)=CR(NRI)        @LYA 21152500
ACBOPT   DS    0BL2                            NON-USER OPTIONS         21154900
ACBDSORG DS    0BL2                            MATCH ACBDORGA WITH      21204900
*                                              DCBDSORG                 21254900
ACBDSOR1 DS    BL1                             DSORG FIRST BYTE         21304900
*        CHECKPOINT/RESTART OPTIONS                                     21354900
ACBCRNCK EQU   X'80'                           NO CHECK BY RESTART      21404900
*                                              FOR MODIFICATIONS SINCE  21454900
*                                              LAST CHECKPOINT          21504900
ACBCRNRE EQU   X'40'                           DATA ADDED SINCE         21554900
*                                              LAST CHECKPOINT NOT      21604900
*                                              ERASED BY RESTART AND    21654900
*                                              NO REPOSITION TO LAST    21704900
*                                              CHECKPOINT TAKES PLACE   21754900
ACBDVIND EQU   X'20'                           DEVICE INDICATR @ZA26638 21804900
ACBOPTJ  EQU   X'20'                           3800 CONTROL    @ZA26638 21854900
*                                              CHAR PRESENT    @ZA26638 21904900
ACBDSOR2 DS    BL1                             DSORG SECOND BYTE        21954900
ACBDORGA EQU   X'08'                           ACB INDICATOR            22004900
ACBMSGAR DS    A                               MSG AREA PTR     X04SVHS 22054900
ACBPASSW DS    A                               PASSWORD ADDRESS         22104900
ACBEXLST DS    0A                              USER EXIT LIST ADDRESS   22154900
ACBUEL   DS    A                               ALTERNATE NAME FOR       22204900
*                                              ACBEXLST                 22254900
*              BEFORE ACB IS OPENED                                     22304900
*              (FOR VTAM, ACBDDNM IS INITIALIZED TO                     22354900
*              X'FF00000000000000')                              X03004 22404900
ACBDDNM  DS    CL8                             DDNAME - MUST BE THE     22454900
*                                              SAME AS THE NAME FIELD   22504900
*                                              ON THE DD STATEMENT      22554900
*                                              DEFINING THE DATA SET    22604900
*                                              ASSOCIATED WITH THIS ACB 22654900
*              AFTER ACB IS OPENED                                      22704900
         ORG   ACBDDNM                                                  22754900
ACBTIOT  DS    H                               OFFSET FROM TIOT ORIGIN  22804900
*                                              TO THE TIOELNGH FIELD IN 22854900
*                                              THE TIOT ENTRY FOR THE   22904900
*                                              DD STATEMENT FOR THIS    22954900
*                                              ACB                      23004900
ACBINFL  DS    BL1                             CONTENTS AND MEANING     23054900
*                                              ARE THE SAME AS          23104900
*                                              ACBINFLG (BEFORE OPEN)   23154900
ACBAM    DS    0B                              ALTERNATE NAME FOR       23204900
*                                              ACBAMETH          X03004 23254900
ACBAMETH DS    BL1                             ACCESS METHOD TYPE       23304900
ACBVTAM  EQU   X'60'                           VTAM              X03004 23354900
ACBSUBS  EQU   X'41'                           SUBSYSTEMS               23404900
ACBTCAM  EQU   X'31'                           TCAM                     23454900
ACBRCI   EQU   X'23'                           JES/RCI                  23504900
ACBRTAM  EQU   X'22'                           JES/RTAM                 23554900
ACBJAM   EQU   X'21'                           JES/JAM                  23604900
ACBVSAM  EQU   X'11'                           VSAM                     23654900
ACBERFL  DS    BL1                             FOR JES, CONTENTS AND    23704900
*                                              MEANING ARE THE SAME     23754900
*                                              AS ACBERFLG (BEFORE      23804900
*                                              OPEN) - NOT USED BY      23854900
*                                              VSAM/VTAM                23904900
ACBDEB   DS    AL3                             DEB ADDRESS              23954900
*              NOT MOVED BY OPEN                                        24004900
ACBOFLGS DS    BL1                             OPEN / CLOSE FLAGS       24054900
ACBR31B  EQU   X'80'                           31-BIT BUFR REQUEST @LPA 24071500
ACBR31C  EQU   X'40'                           31-BIT CB REQUEST   @LPA 24088100
ACBEOV   EQU   X'20'                           EOV CONCATENATION        24104900
ACBOPEN  EQU   X'10'                           THE ACB IS OPEN          24154900
ACBDSERR EQU   X'08'                           NO FURTHER REQUESTS ARE  24204900
*                                              POSSIBLE AGAINST THIS    24254900
*                                              ACB                      24304900
ACBRECOV EQU   X'04'                           ALLOW THE OPEN OF  @LYA  24317400
*                                              SPHERE MARKED AS   @LYA  24329900
*                                             'RECOVERY REQUIRED' @LYA  24342400
ACBEXFG  EQU   X'02'                           USER EXIT FLAG - SET TO  24354900
*                                              0 BY AN I/O SUPPORT      24404900
*                                              WHEN A USER EXIT TAKEN;  24454900
*                                              SET TO 1 ON RETURN       24504900
ACBLOCK  EQU   X'02'                           ALTERNATE NAME FOR       24554900
*                                              ACBEXFG          X03004  24604900
ACBIOSFG EQU   X'01'                           OPEN/CLOSE IN CONTROL -  24654900
*                                              THE ACB IS BEING         24704900
*                                              PROCESSED BY AN I/O      24754900
*                                              SUPPORT FUNCTION         24804900
ACBBUSY  EQU   X'01'                           ALTERNATE NAME FOR       24854900
*                                              ACBIOSFG         X03004  24904900
*              BEFORE ACB IS OPENED                                     24954900
ACBERFLG DS    BL1                             ERROR FLAGS - FOR        25004900
*                                              VSAM/VTAM THIS FIELD IS  25054900
*                                              NOT MOVED BY OPEN AND    25104900
*                                              ERROR FLAGS ARE          25154900
*                                              RETURNED HERE; FOR JES   25204900
*                                              THIS FIELD IS MOVED TO   25254900
*                                              ACBERFL BY OPEN          25304900
*              THE FOLLOWING CODES ARE COMMON TO ALL ACCESS      X03004 25354900
*              METHODS.                                          X03004 25404900
ACBOALR  EQU   X'04'                           THE ACB IS ALREADY OPEN  25454900
ACBCALR  EQU   X'04'                           THE ACB IS NOT OPEN      25504900
*                                                              @ZM30033 25554900
ACBINFLG DS    0BL2                            INDICATOR FLAGS @ZA16012 25604900
ACBINFL1 DS    BL1                             FIRST IND FLAGS @ZA16012 25654900
.*             BIT 0 - X'80' MATCHES WITH BIT 0 OF THE DCBMACR FIELD,   25704900
.*             INDICATING AN EXCP DCB.  THIS BIT IS USED TO             25754900
.*             DIFFERENTIATE BETWEEN AN ACB AND A DCB AND MUST NEVER    25804900
.*             BE ASSIGNED IN THE ACB.                                  25854900
ACBJEPS  EQU   X'40'                           JEPS IS USING THIS ACB   25904900
ACBIJRQE EQU   X'20'                           AN RQE IS HELD BY JAM    25954900
ACBCAT   EQU   X'10'                           ACB FOR VSAM CATALOG     26004900
ACBSCRA  EQU   X'08'                           CATALOG CONTROL BLOCK    26054900
*                                              SYSTEM AREA      X04SVHS 26104900
ACBUCRA  EQU   X'04'                           CATALOG CONTROL BLOCK    26154900
*                                              USER AREA        X04SVHS 26204900
ACBVVIC  EQU   X'02'                           DATA SET BEING OPENED    26254900
*                                              IS SYS1.VVIC     X04SVHS 26304900
ACBSDS   EQU   X'02'                           OPEN AS SYSTEM DATA SET  26354900
*                                                              @Z40SVUC 26404900
ACBBYPSS EQU   X'01'                           BYPASS SECURITY ON OPEN  26454900
*                                              IF CALLER AUTH  @Z40RSUC 26504900
ACBINFL2 DS    BL1                             2ND IND FLAGS   @ZA16012 26554900
ACBSWARN EQU   X'80'                           SUPPRESS OPEN WARNING    26604900
*                                              MSG AND IMPLICIT VERIFY  26654900
*                                              IF DATA SET NOT PROPERLY 26704900
*                                              CLOSED CONDITION IS      26754900
*                                              DETECTED            @L1A 26804900
ACBSOPEN EQU   X'40'                           SUPPRESS CLOSE CATALOG   26854900
*                                              UPDATE OF THE OPEN       26904900
*                                              INDICATOR           @L1A 26954900
ACBCBIC  EQU   X'20'                           OPEN WITH CONTROL BLOCKS 27004900
*                                              IN COMMON STORAGE AREA   27054900
*                                                              @ZA16012 27104900
ACBCATX  EQU   X'10'                           CATX OPEN           @L1A 27154900
ACBCASRS EQU   X'08'                           CAS RESTART         @PAS 27179900
ACBISHRD EQU   X'04'                           IGNORE SHR DASD @YA03157 27192400
ACBSHROP EQU   X'03'                           SHARE OPTIONS       @X1A 27195500
ACBSHR02 EQU   X'02'                           CROSS REG SHARE 2   @X1A 27198600
ACBSHR01 EQU   X'01'                           CROSS REG SHARE 1   @X1A 27201700
*              NOT MOVED BY OPEN                                        27204900
ACBUJFCB DS    0A                              USER JFCB ADDRESS        27254900
ACBOPTN  DS    XL1                             JAM UCS INDICATORX04SVHS 27304900
         DS    XL3                             RESERVED         X04SVHS 27354900
ACBBUFSP DS    F                               VIRTUAL CORE AVAILABLE   27404900
*                                              FOR BUFFERS              27454900
ACBBLKSZ DS    0H                              BLOCKSIZE                27504900
ACBMSGLN DS    H                               LNG OF MSG AREA  X04SVHS 27554900
ACBLRECL DS    H                               LOGICAL RECORD LENGTH    27604900
ACBUAPTR DS    A                               USER WORKAREA ADDRESS;   27654900
*                                              CAXWA ADDRESS FOR        27704900
*                                              CATALOG OPEN             27754900
ACBCBMWA DS    A                               CONTROL BLOCK            27804900
*                                              MANIPULATION WORKAREA    27854900
*                                              ADDRESS                  27904900
ACBAPID  DS    0A                              APPLICATION ID @G29ASRL  27954900
ACBAMAX  DS    A                               ACCESS METHOD ACB        28004900
*                                              EXTENSION      @G29ASRL  28054900
*                                              ADDRESS(VTAM)    X03004  28104900
.*                                                                6@L9D 28154900
         AIF   ('&AM' NE '3540').VSEXT         IS IT 3540     @ZA62372  28254900
         IFGACB35                              GET 3540 EXT    X04AAHS  28304900
         AGO   .ENDACB                                        @ZA62372  28354900
.VSEXT   ANOP                                                 @ZA62372  28404900
         IFGACBVS AM=&AM                   GET VSAM EXTENSION @ZA62372  28454900
         AGO   .ENDACB                                        @ZA62372  28504900
.ENDACB  ANOP                                  END COMMON ACB   X03004  28554900
         MEND                                                           28604900
*                            END OF ACB                             */  28654900
*%ACBBSL2: ;                                                            28704900
