*%GOTO   RPLEXTPL;                                                      00050000
* /*                                                                */  00100000
* /*     CHANGE LEVEL = 03                                          */  00150000
* /*     DATE OF LAST CHANGE = 06 AUG 81   ( 81*218 )               */  00200000
* /*                                                                */  00250000
* /******************************************************************/  00300000
* /*                                                                */  00350000
* /*     RPL VTAM EXTENSION                                         */  00400000
* /*                                                                */  00450000
* /*     THE EXTENSION DESCRIBES CONTROL DATA THAT ONLY VTAM USES.  */  00500000
* /*     THE EXTENSION IS CALLED AS AN INNER MACRO BY IFGRPL UNDER  */  00510000
* /*     THE FOLLOWING CONDITIONS:                                  */  00520000
* /*                                                                */  00530000
* /*        PLS:  THE MODULE CONTAINING AN INCLUDE FOR IFGRPL SETS  */  00540000
* /*              THE MACRO VARIABLE 'ACBRPLXL' TO 'VTAM' PRIOR     */  00542000
* /*              TO ISSUING THE INCLUDE.                           */  00544000
* /*        BAL:  THE AM=VTAM PARAMETER IS CODED ON THE MACRO       */  00546000
* /*              CALL.                                             */  00548000
* /*                                                                */  00550000
* /*     CHANGE ACTIVITY                                            */  00560000
* /*     A87886,87986,104886                                @ZM31226*/  00570000
* /*                                                        @ZA48668*/  00575000
* /*PROPRIETARY V3 STATEMENT                                        */  00576800
* /*LICENSED MATERIALS - PROPERTY OF IBM                            */  00578600
* /*"RESTRICTED MATERIALS OF IBM"                                   */  00580400
* /*5695-DF1                                                        */  00582200
* /*(C) COPYRIGHT 1992  IBM CORP.                                   */  00584000
* /*END PROPRIETARY V3 STATEMENT                                    */  00587000
* /*                                                                */  00590000
* /******************************************************************/  00600000
* /*                                                                */  00650000
*%RPLEXTPL: ;                               /* START OF EXTENSION   */  00700000
*             2 RPLVTEXT,                   /* RPL VTAM EXTENSION       00750000
*                                                             X03004*/  00760000
*              3 RPLAAREA    PTR(31),       /* ALTERNATE AREA ADDR      00800000
*                                                             X03004*/  00850000
*              3 RPLAARLN    PTR(31),       /* ALTERNATE AREA LENGTH    00900000
*                                                             X03004*/  00950000
*              3 RPLARCLN    PTR(31),       /* ALTERNATE RECORD         01000000
*                                              LENGTH         X03004*/  01050000
*              3 RPLFDBK2    BIT(32),       /* FEED BACK WORD 2         01100000
*                                                             X03004*/  01150000
*                  5 RPLSSNSI  BIT(16),     /* SYSTEM SENSE             01160000
*                                              INPUT         X03004JS*/ 01170000
*                    6 RPLDSB  BIT(16),     /* DEVICE STATUS BYTES      01200000
*                                                            X03004JS*/ 01250000
*                      7 RPLDSB1   BIT(8),  /* DEVICE STATUS BYTE 1     01300000
*                                                            X03004JS*/ 01350000
*                        8 RPLSSEI BIT(8),  /* SYSTEM SENSE ERROR       01360000
*                                              CODES         X03004JS*/ 01370000
*                          9 RPLPATHI BIT(1),/* SSENSEI PATH X03004JS*/ 01380000
*                          9 RPLCPMI  BIT(1),/* SSENSEI CPM  X03004JS*/ 01390000
*                          9 RPLSTATI BIT(1),/* SSENSEI STATEX03004JS*/ 01392000
*                          9 RPLFII   BIT(1),/* SSENSEI FI   X03004JS*/ 01394000
*                          9 RPLRRI   BIT(1),/* SSENSEI RR   X03004JS*/ 01394100
*                          9 *        BIT(3),/* RESERVED FOR VTAM       01394200
*                                                            X03004JS*/ 01394300
*                      7 RPLDSB2   BIT(8),  /* DEVICE STATUS BYTE 2     01394400
*                                                            X03004JS*/ 01394800
*                        8 RPLSSMI PTR(8),  /* SYSTEM SENSE MODIFIER    01396000
*                                              INPUT         X03004HS*/ 01446000
*                  5 RPLUSNSI  PTR(16),     /* USER SENSE               01498400
*                                              INPUT         X03004HS*/ 01498800
*                    6 RPLESR1 BIT(8),      /* EXTENDED SYSTEM          01500000
*                                              RESPONSE 1    X03004JS*/ 01550000
*                    6 RPLESR2 BIT(8),      /* EXTENDED SYSTEM          01600000
*                                              RESPONSE 2    X03004JS*/ 01650000
*              3 RPLUSFLD    BIT(32),       /* USER FIELD     X03004*/  01700000
*              3 RPLOPTC3    BIT(32),       /* VTAM OPTIONS   X03004*/  01750000
*                4 RPLOPT9   BIT(8),        /* OPTION BYTE 9  X03004*/  01800000
*                  5 RPLLOGON BIT(1),       /* INQ LOGON MSG  X03004*/  01850000
*                  5 RPLDEVCH BIT(1),       /* INQ DEVICE CHARX03004*/  01900000
*                  5 RPLTERMS BIT(1),       /* INQ TERMS      X03004*/  01950000
*                  5 RPLCOUNT BIT(1),       /* INQ COUNTS     X03004*/  02000000
*                  5 RPLAPPST BIT(1),       /* INQ APPSTAT    X03004*/  02050000
*                  5 RPLRNNM  BIT(1),       /* INQ RNNAME     X03004*/  02100000
*                  5 RPLCIDE  BIT(1),       /* INQ CIDXLATE   X03004*/  02150000
*                  5 RPLTOPL  BIT(1),       /* INQ TOP LOGON  X03004*/  02200000
*                4 RPLOPT10  BIT(8),        /* OPTION BYTE 10 X03004*/  02250000
*                  5 RPLBSCID BIT(1),       /* INQ BSC ID     X03004*/  02300000
*                  5 RPLDSPLY BIT(1),       /* INQ DISPLAY    X03004*/  02350000
*                  5 RPLSPARM BIT(1),       /* INQ SESSPARM  @Z40BHUC*/ 02400000
*                  5 RPLTSKY  BIT(1),       /* INQ SESSKEY   @G40AKSL*/ 02450000
*                  5 RPLRSVI3 BIT(1),       /* RESERVED       X03004*/  02500000
*                  5 RPLRSVI4 BIT(1),       /* RESERVED       X03004*/  02550000
*                  5 RPLRSVI5 BIT(1),       /* RESERVED       X03004*/  02600000
*                  5 RPLRSVI6 BIT(1),       /* RESERVED       X03004*/  02650000
*                4 RPLOPT11  BIT(8),        /* OPTION BYTE 11 X03004*/  02700000
*                  5 RPLQUIES BIT(1),       /* SETLOGON QUIESCE         02750000
*                                                             X03004*/  02800000
*                  5 RPLSTART BIT(1),       /* SETLOGON START X03004*/  02850000
*                  5 RPLSTOP  BIT(1),       /* SETLOGON STOP  X03004*/  02900000
*                  5 RPLRSVE4 BIT(1),       /* RESERVED       X03004*/  02950000
*                  5 RPLRSVE5 BIT(1),       /* RESERVED       X03004*/  03000000
*                  5 RPLRSVE6 BIT(1),       /* RESERVED       X03004*/  03050000
*                  5 RPLRSVE7 BIT(1),       /* RESERVED       X03004*/  03100000
*                  5 RPLRSVE8 BIT(1),       /* RESERVED       X03004*/  03150000
*                4 RPLOPT12  BIT(8),        /* OPTION BYTE 12 X03004*/  03200000
*                  5 *        BIT(1),       /* RESERVED      @Z40BHUC*/ 03210000
*                  5 RPLKEEP  BIT(1),       /* RECEIVE KEEP   X3004BH*/ 03220000
*                  5 RPLTRUNC BIT(1),       /* RECEIVE TRUNC  X3004BH*/ 03230000
*                  5 RPLNIBTK BIT(1),       /* RECEIVE NIBTK  X3004BH*/ 03240000
*                  5 *        BIT(1),       /* RESERVED      @Z40BHUC*/ 03242000
*                  5 *        BIT(1),       /* RESERVED      @Z40BHUC*/ 03244000
*                  5 *        BIT(1),       /* RESERVED      @Z40BHUC*/ 03246000
*                  5 RPLFMHDR BIT(1),       /* 0=NFMHDR/1=FMHDR         03248000
*                                                            X03004JS*/ 03248400
*              3 RPLOSENS    BIT(32),       /* SENSE OUTPUT             03250000
*                                              DATA           X3004BH*/ 03260000
*                4 RPLSSNSO  BIT(16),       /* SYSTEM SENSE             03300000
*                                              OUTPUT         X3004BH*/ 03302000
*                  5 RPLSSEO   BIT(8),      /* SYSTEM SENSE ERROR CODES 03304000
*                                                            X03004JS*/ 03306000
*                    6 *        BIT(1),     /* RESERVED FOR VTAM        03316000
*                                                            X03004JS*/ 03318000
*                    6 RPLCPMO  BIT(1),     /* SSENSEO CPM   X03004JS*/ 03318400
*                    6 RPLSTATO BIT(1),     /* SSENSEO STATE X03004JS*/ 03318800
*                    6 RPLFIO   BIT(1),     /* SSENSEO FI    X03004JS*/ 03318900
*                    6 RPLRRO   BIT(1),     /* SSENSEO RR    X03004JS*/ 03319000
*                    6 *        BIT(3),     /* RESERVED FOR VTAM        03320500
*                                                            X03004JS*/ 03320600
*                  5 RPLSSMO   PTR(8),      /* SYSTEM SENSE MODIFIER    03320900
*                                              OUTPUT        X03004HS*/ 03321300
*                4 RPLUSNSO  PTR(16),       /* USER SENSE               03322300
*                                              OUTPUT        @Y30ASHS*/ 03323800
*              3 RPLSAV13 PTR(31),          /* SAVE AREA FOR VTAM       03324200
*                                              FAST PATH     @Y30ASHS*/ 03324600
*              3 RPLSIGDA  PTR(31);         /* SIGNAL DATA FIELD        03325000
*                                                            @Z40BHUC*/ 03325100
*     DCL  1 RPLOF16 BASED(ADDR(RPLKEYLE)), /* BASE AT OFFSET           03325300
*                                              16             X3004BH*/ 03326800
*            2 RPLRH3        BIT(8),        /* THIRD RH BYTE  X3004BH*/ 03328300
*              3 RPLBB       BIT(1),        /* BRACKET - 0=NBB/1=BB     03329800
*                                                            X03004JS*/ 03331800
*              3 RPLEB       BIT(1),        /* BRACKET - 0=NEB/1=EB     03332200
*                                                            X03004JS*/ 03332600
*              3 RPLCMD      BIT(1),        /* CHNGDIR -                03332800
*                                              0=NCMD/1=CMD   X3004BH*/ 03334300
*              3 RPLCHREQ    BIT(1),        /* CHNGDIR -                03335800
*                                              0=NREQ/1=REQ   X3004BH*/ 03337300
*              3 RPLCSI      BIT(1),        /* 0=STANDARD  -  CODESEL   03338800
*                                              1=ALT         @Z40BHUC*/ 03340300
*              3 *           BIT(3),        /* RESERVED FOR             03341000
*                                              VTAM           X3004BH*/ 03341200
*            2 RPLSRTYP      BIT(8),        /* SEND OR RECEIVE          03341800
*                                              TYPE           X3004BH*/ 03343300
*              3 RPLSTYPE    BIT(4),        /* SEND TYPE      X3004BH*/ 03346600
*                4 RPLSRESP  BIT(1),        /* STYPE -                  03356600
*                                              0=REQ/1=RESP   X3004BH*/ 03357000
*                4 *         BIT(3),        /* RESERVED FOR             03358600
*                                              VTAM           X3004BH*/ 03358700
*              3 RPLRTYPE    BIT(4),        /* RECEIVE TYPE   X3004BH*/ 03359000
*                4 RPLRRESP  BIT(1),        /* RTYPE - 0=NRESP/         03359400
*                                              1=RESP         X3004BH*/ 03359500
*                4 RPLNFSYN  BIT(1),        /* RTYPE - 0=DFSYN/         03359800
*                                              1=NDFSYN       X3004BH*/ 03359900
*                4 RPLDFASY  BIT(1),        /* RTYPE - 0=NDFASY/        03360000
*                                              1=DFASY        X3004BH*/ 03364400
*                4 *         BIT(1),        /* RESERVED      @Z40BHUC*/ 03366400
*            2 RPLCHN        BIT(8),        /* POSITION IN RU           03368400
*                                              CHAIN          X3004BH*/ 03368500
*              3 RPLFIRST    BIT(1),        /* CHAIN FIRST    X3004BH*/ 03368800
*              3 RPLMIDLE    BIT(1),        /* CHAIN MIDDLE   X3004BH*/ 03368900
*              3 RPLLAST     BIT(1),        /* CHAIN LAST     X3004BH*/ 03373300
*              3 RPLONLY     BIT(1),        /* CHAIN ONLY     X3004BH*/ 03375300
*              3 *           BIT(4),        /* RESERVED FOR             03377300
*                                              VTAM           X3004BH*/ 03377400
*            2 RPLVTFL1      BIT(8),        /* VTAM FLAGS     X3004BH*/ 03377700
*              3 *           BIT(1),        /* RESERVED      @Z40BHUC*/ 03382200
*              3 RPLVTUSE    BIT(1),        /* 0=APPL/1=SYSTEMX3004BH*/ 03384200
*              3 RPLAUTUS    BIT(1),        /* VTAM FAST PATH@Y30ASHS*/ 03384600
*              3 RPLTNDSP    BIT(1),        /* 1=DOMAIN REQ  @G40AKCM*/ 03386200
*              3 RPLTLGAC    BIT(1),        /* 1=LOGON ACCOMPLISHED     03387200
*                                                            @G40AKCM*/ 03388200
*              3 *           BIT(3),        /* RESERVED FOR             03389200
*                                              VTAM          @G40AKCM*/ 03390200
*            2 RPLVTFL2      BIT(8),        /* POST/RESPOND             03397200
*                                              FLAGS          X3004BH*/ 03399200
*              3 RPLPOSTV    BIT(4),        /* POST FLAGS     X3004BH*/ 03407200
*                4 RPLSCHED  BIT(1),        /* POST -                   03407600
*                                              0=RESP/1=SCHED X3004BH*/ 03408600
*                4 *         BIT(3),        /* RESERVED FOR             03413000
*                                              VTAM           X3004BH*/ 03413900
*              3 RPLRESP     BIT(4),        /* RESPOND FLAGS  X3004BH*/ 03414000
*                4 RPLQRI    BIT(1),        /* RESPOND -                03415000
*                                             0=NQREQ/1=QREQ @G40AKSL*/ 03415500
*                4 RPLEX     BIT(1),        /* RESPOND -                03416000
*                                              0=NEX/1=EX     X3004BH*/ 03416400
*                4 RPLNFME   BIT(1),        /* RESPOND -                03417000
*                                              0=FME/1=NFME   X3004BH*/ 03417400
*                4 RPLRRN    BIT(1),        /* RESPOND -                03418000
*                                              0=NRRN/1=RRN   X3004BH*/ 03418800
*            2 RPLCNTRL      CHAR(3),       /* RU CONTROL               03419000
*                                              CODES          X3004BH*/ 03419400
*              3 RPLCNTDF    BIT(8),        /* DATA FLOW CONTROL        03420000
*                                              CODES          X3004BH*/ 03420900
*                4 RPLDATA   BIT(1),        /* CONTROL DATA   X3004BH*/ 03421000
*                4 RPLCNCEL  BIT(1),        /* CONTROL CANCEL X3004BH*/ 03422000
*                4 RPLQC     BIT(1),        /* CONTROL QC     X3004BH*/ 03423000
*                4 RPLQEC    BIT(1),        /* CONTROL QEC    X3004BH*/ 03424000
*                4 RPLCHASE  BIT(1),        /* CONTROL CHASE  X3004BH*/ 03425000
*                4 RPLRELQ   BIT(1),        /* CONTROL RELQ   X3004BH*/ 03426000
*                4 RPLQI     BIT(1),        /* RESERVED FOR             03427000
*                                              VTAM          X03004JS*/ 03427400
*                4 *         BIT(1),        /* RESERVED FOR             03428000
*                                              VTAM           X3004BH*/ 03429400
*              3 RPLCNTDC    BIT(8),        /* DATA FLOW CONTROL CTD    03430900
*                                                            X03004JS*/ 03431300
*                4 RPLBID    BIT(1),        /* CONTROL BID   X03004JS*/ 03432300
*                4 RPLRTR    BIT(1),        /* CONTROL RTR   X03004JS*/ 03434300
*                4 RPLLUS    BIT(1),        /* CONTROL LUS   X03004JS*/ 03434700
*                4 RPLSIGNL  BIT(1),        /* CONTROL SIGNALX03004JS*/ 03435100
*                4 RPLTBIND  BIT(1),        /* CONTROL BIND  @G40AKSL*/ 03435200
*                4 RPLTUNBD  BIT(1),        /* CONTROL UNBIND@G40AKSL*/ 03435300
*                4 RPLSBI    BIT(1),        /* CONTROL SBI   @G40AKSL*/ 03435400
*                4 RPLBIS    BIT(1),        /* CONTROL BIS   @G40AKSL*/ 03435500
*              3 RPLCNTSC    BIT(8),        /* SESSION CONTROL          03436000
*                                              CODES          X3004BH*/ 03436300
*                4 RPLSDT    BIT(1),        /* CONTROL SDT    X3004BH*/ 03437300
*                4 RPLCLEAR  BIT(1),        /* CONTROL CLEAR  X3004BH*/ 03438300
*                4 RPLSTSN   BIT(1),        /* CONTROL STSN   X3004BH*/ 03439300
*                4 RPLSHUTD  BIT(1),        /* CONTROL SHUTD  X3004BH*/ 03440300
*                4 RPLSHUTC  BIT(1),        /* CONTROL SHUTC  X3004BH*/ 03441300
*                4 RPLRQR    BIT(1),        /* CONTROL RQR    X3004BH*/ 03442300
*                4 RPLRSHUT  BIT(1),        /* CONTROL RSHUTDX03004JS*/ 03443300
*                4 *         BIT(1);        /* RESERVED FOR             03444300
*                                              VTAM          X03004JS*/ 03445300
*     DCL  1 RPLOF60 BASED(ADDR(RPLRBAR)),  /* BASE AT OFFSET           03446300
*                                              60             X3004BH*/ 03447300
*            2 RPLOBSQV      FIXED(16),     /* STSN OUTBOUND            03448300
*                                              SEQ. NO.       X3004BH*/ 03449300
*            2 RPLIBSQV      FIXED(16),     /* STSN INBOUND             03450300
*                                              SEQ. NO.       X3004BH*/ 03451300
*            2 RPLOBSQ       BIT(8),        /* STSN OUTBOUND ACTION     03452300
*                                              CODES          X3004BH*/ 03453300
*              3 RPLOSET     BIT(1),        /* OBSQAC SET     X3004BH*/ 03454300
*              3 RPLOTST     BIT(1),        /* OBSQAC TESTSET X3004BH*/ 03455300
*              3 RPLORSET    BIT(1),        /* OBSQAC RESET   X3004BH*/ 03456300
*              3 RPLOIGN     BIT(1),        /* OBSQAC IGNORE  X3004BH*/ 03457300
*              3 RPLOPOS     BIT(1),        /* OBSQAC TESTPOS X3004BH*/ 03458300
*              3 RPLONEG     BIT(1),        /* OBSQAC TESTNEG X3004BH*/ 03459300
*              3 RPLOINV     BIT(1),        /* OBSQAC INVALID X3004BH*/ 03460300
*              3 *           BIT(1),        /* RESERVED FOR             03461300
*                                              VTAM           X3004BH*/ 03462300
*            2 RPLIBSQ       BIT(8),        /* STSN INBOUND ACTION      03463300
*                                              CODES          X3004BH*/ 03464300
*              3 RPLISET     BIT(1),        /* IBSQAC SET     X3004BH*/ 03465300
*              3 RPLITST     BIT(1),        /* IBSQAC TESTSET X3004BH*/ 03466300
*              3 RPLIRSET    BIT(1),        /* IBSQAC RESET   X3004BH*/ 03476300
*              3 RPLIIGN     BIT(1),        /* IBSQAC IGNORE  X3004BH*/ 03478300
*              3 RPLIPOS     BIT(1),        /* IBSQAC TESTPOS X3004BH*/ 03478400
*              3 RPLINEG     BIT(1),        /* IBSQAC TESTNEG X3004BH*/ 03478500
*              3 RPLIINV     BIT(1),        /* IBSQAC INVALID X3004BH*/ 03479600
*              3 *           BIT(1),        /* RESERVED FOR             03480000
*                                              VTAM           X3004BH*/ 03480400
*            2 RPLSEQNO      FIXED(16);     /* SEQUENCE NUMBERX3004BH*/ 03481600
*     DCL      ISTRPL BASED (ADDR(IFGRPL))  /* ISTRPL LENGTH   X03004*/ 03481800
*                            CHAR(LENGTH(IFGRPL));                      03490500
*        %INCLUDE SYSLIB(ISTRPLFB);         /* INCLUDE FEEDBACK CODES*/ 03500500
*                                           /* MACRO           X03004*/ 03500900
*%GOTO   RPLEND;                                                        03502400
* /*                                                                    03514300
*                   ASSEMBLER DSECT FOR RPL VTAM EXTENSION          *   03526200
*                                                                   *   03538100
         MACRO                                                          03550000
         IFGRPLVT                                                       03600000
RPLAAREA DS    A                               POINTER TO THE ALTERNATE 03650000
*                                              DATA AREA(VTAM) - INPUT  03700000
*                                              AREA FOR DATA RECEIVED   03750000
*                                              IN CONVERSATIONAL        03800000
*                                              MODE              X03004 03850000
RPLAARLN DS    F                               ALTERNATE AREA           03900000
*                                              LENGTH(VTAM)      X03004 03950000
RPLARCLN DS    F                               ALTERNATE RECORD         04000000
*                                              LENGTH(VTAM)      X03004 04050000
RPLFDBK2 DS    0XL4                            FEEDBACK WORD TWO(VTAM)  04100000
*                                                                X03004 04150000
RPLSSNSI DS    0XL2                            SYSTEM SENSE INPUT       04160000
*                                                               X3004BH 04170000
RPLDSB   DS    0XL2                            DEVICE STATUS BYTE(VTAM) 04200000
*                                                                X03004 04250000
RPLDSB1  DS    0XL1                            DEVICE STATUS BYTE 1     04300000
*                                                              X03004JS 04350000
RPLSSEI  DS    XL1                             SYSTEM SENSE ERROR CODES 04360000
*                                                              X03004JS 04370000
RPLPATHI EQU   X'80'                           PATH ERROR      X03004JS 04380000
RPLCPMI  EQU   X'40'                           CONNECTION POINT         04390000
*                                              MANAGER ERROR   X03004JS 04392000
RPLSTATI EQU   X'20'                           STATE ERROR     X03004JS 04394000
RPLFII   EQU   X'10'                           FUNCTION INTERPRETER     04396000
*                                              ERROR           X03004JS 04398000
RPLRRI   EQU   X'08'                           REQUEST REJECT  X03004JS 04398400
RPLDSB2  DS    0XL1                            DEVICE STATUS BYTE 2     04400000
*                                                              X03004JS 04450000
RPLSSMI  DS    XL1                             SYSTEM SENSE MODIFIER    04460000
*                                              INPUT           X03004JS 04470000
RPLUSNSI DS    0XL2                            USER SENSE INPUT X3004BH 04480000
RPLESR1  DS    XL1                             RESPONSE 1 FROM 3270     04500000
*                                              CONTROL UNIT      X03004 04550000
RPLESR2  DS    XL1                             RESPONSE 2 FROM 3270     04600000
*                                              CONTROL UNIT      X03004 04650000
RPLUSFLD DS    XL4                             USER FIELD(VTAM) - AT    04700000
*                                              OPNDST TIME THE CONTENTS 04750000
*                                              ARE SAVED FOR EACH       04800000
*                                              TERMINAL AND RETURNED    04850000
*                                              TO THE RPL ON COMPLETION 04900000
*                                              OF ANY REQUEST FOR OR BY 04950000
*                                              THAT TERMINAL     X03004 05000000
RPLOPTC3 DS    0XL4                            VTAM OPTIONS      X03004 05050000
RPLOPT9  DS    XL1                             OPTION BYTE 9     X03004 05100000
RPLLOGON EQU   X'80'                           PASS THE LOGON MESSAGE   05150000
*                                              TO THE APPLICATIONX03004 05200000
RPLDEVCH EQU   X'40'                           PASS THE DEVICE          05250000
*                                              CHARACTERISTICS TO THE   05300000
*                                              APPLICATION       X03004 05350000
RPLTERMS EQU   X'20'                           PASS THE SYMBOLIC NAME   05400000
*                                              OF THE TERMINAL AND ITS  05450000
*                                              CHARACTERISTICS TO       05500000
*                                              THE APPLICATION   X03004 05550000
RPLCOUNT EQU   X'10'                           PASS THE NUMBER OF       05600000
*                                              ACTIVE CONNECTIONS AND   05650000
*                                              QUEUED LOGON REQUESTS    05700000
*                                              TO THE APPLICATIONX03004 05750000
RPLAPPST EQU   X'08'                           INDICATE THE APPLICATION 05800000
*                                              STATUS            X03004 05850000
RPLRNNM  EQU   X'04'                           INDICATE THE 3705        05900000
*                                              SYMBOLIC NAME     X03004 05950000
RPLCIDE  EQU   X'02'                           INDICATE THE SYMBOLIC    06000000
*                                              NAME CORRESPONDING TO    06050000
*                                              THE COMMUNICATION        06100000
*                                              IDENTIFIER        X03004 06150000
RPLTOPL  EQU   X'01'                           PASS THE SYMBOLIC NAME   06200000
*                                              OF THE FIRST TERMINAL    06250000
*                                              ON THE LOGON QUEUEX03004 06300000
RPLOPT10 DS    XL1                             OPTION BYTE 10    X03004 06350000
RPLBSCID EQU   X'80'                           PASS THE HARDWARE        06400000
*                                              IDENTIFIER OF A BINARY   06450000
*                                              SYNCHRONOUS TERMINAL     06500000
*                                                                X03004 06550000
RPLDSPLY EQU   X'40'                           DISPLAY INFORMATION FROM 06600000
*                                              THE NETWORK OPERATOR     06650000
*                                              CONTROL           X03004 06700000
RPLSPARM EQU   X'20'                           SESSPARM        @Z40BHUC 06750000
RPLTSKY  EQU   X'10'                           SESSKEY         @G40AKSL 06800000
RPLRSVI3 EQU   X'08'                           RESERVED          X03004 06850000
RPLRSVI4 EQU   X'04'                           RESERVED          X03004 06900000
RPLRSVI5 EQU   X'02'                           RESERVED          X03004 06950000
RPLRSVI6 EQU   X'01'                           RESERVED          X03004 07000000
RPLOPT11 DS    XL1                             OPTION BYTE 11    X03004 07050000
RPLQUIES EQU   X'80'                           STOP ACCEPTING LOGONS    07100000
*                                              AS THE APPLICATION IS    07150000
*                                              PREPARING TO SHUTDOWN    07200000
*                                              (USED WITH SETLOGON)     07250000
*                                                               X03004  07300000
RPLSTART EQU   X'40'                           START ACCEPTING LOGONS   07350000
*                                              WHICH WERE TEMPORARILY   07400000
*                                              STOPPED           X03004 07450000
RPLSTOP  EQU   X'20'                           STOP ACCEPTING LOGONS    07500000
*                                              TEMPORARILY (USED WITH   07550000
*                                              SETLOGON)         X03004 07600000
RPLRSVE4 EQU   X'10'                           RESERVED          X03004 07650000
RPLRSVE5 EQU   X'08'                           RESERVED          X03004 07700000
RPLRSVE6 EQU   X'04'                           RESERVED          X03004 07750000
RPLRSVE7 EQU   X'02'                           RESERVED          X03004 07800000
RPLRSVE8 EQU   X'01'                           RESERVED          X03004 07850000
RPLOPT12 DS    XL1                             OPTION BYTE 12    X03004 07900000
RPLKEEP  EQU   X'40'                           KEEP OVERLENGTH DATA ON  07940000
*                                              INPUT QUEUE      X3004BH 07942000
RPLTRUNC EQU   X'20'                           TRUNCATE OVERLENGTH      07944000
*                                              DATA             X3004BH 07946000
RPLNIBTK EQU   X'10'                           USE KEEP OR TRUNCATE     07948000
*                                              OPTION SET IN NIB AT     07948400
*                                              OPENDST          X3004BH 07948800
RPLFMHDR EQU   X'01'                           1=FUNCTION MANAGEMENT    07988600
*                                              HEADER INCLUDED IN DATA  07998600
*                                              STREAM          X03004JS 08008600
RPLOSENS DS    0XL4                            SENSE OUTPUT DATAX3004BH 08028600
RPLSSNSO DS    0XL2                            SYSTEM SENSE OUTPUT      08078600
*                                                               X3004BH 08128600
RPLSSEO  DS    XL1                             SYSTEM SENSE ERROR       08138600
*                                              CODES           X03004JS 08148600
RPLCPMO  EQU   X'40'                           CONNECTION POINT MANAGER 08198600
*                                              ERROR           X03004JS 08248600
RPLSTATO EQU   X'20'                           STATE ERROR     X03004JS 08298600
RPLFIO   EQU   X'10'                           FUNCTION INTERPRETER     08348600
*                                              ERROR           X03004JS 08398600
RPLRRO   EQU   X'08'                           REQUEST REJECT  X03004JS 08448600
RPLSSMO  DS    XL1                             SYSTEM SENSE MODIFIER    08578600
*                                              CODES           X03004JS 08628600
RPLUSNSO DS    XL2                             USER SENSE OUTPUTX3004BH 08778600
RPLSAV13 DS    XL4                             SAVE AREA FOR VTAM       08788600
*                                              FAST PATH       @ZM31226 08798600
RPLSIGDA DS    XL4                             SIGNAL DATA FLD @Z40BHUC 08800000
*              END OF VTAM EXTENSION                           @Z40BHUC 08810000
         ORG   RPLKEYLE                                         X3004BH 08828600
RPLRH3   DS    XL1                     THIRD REQUEST HEADER BYTEX3004BH 08878600
RPLBB    EQU   X'80'                   BEGIN BRACKET           X03004JS 08888600
RPLEB    EQU   X'40'                   END BRACKET             X03004JS 08898600
RPLCMD   EQU   X'20'                   CHANGE DIRECTION FROM SEND       08928600
*                                      TO RECEIVE IMMEDIATELY   X3004BH 08978600
RPLCHREQ EQU   X'10'                   CHANGE DIRECTION FROM SEND       09028600
*                                      TO RECEIVE IS REQUESTED  X3004BH 09078600
RPLCSI   EQU   X'08'                   0=STANDARD - CODESEL    @Z40BHUC 09088600
*                                      1=ALTERNATE             @Z40BHUC 09098600
RPLSRTYP DS    XL1                     SEND OR RECEIVE TYPE     X3004BH 09128600
RPLSRESP EQU   X'80'                   A RESPONSE IS BEING SENT; IF 0,  09178600
*                                      A NEW REQUEST IS BEING SENT      09228600
*                                                               X3004BH 09278600
RPLRRESP EQU   X'08'                   RECEIVE THE FIRST RESPONSE FROM  09328600
*                                      THE RESPONSE QUEUE       X3004BH 09378600
RPLNFSYN EQU   X'04'                   IF 0, RECEIVE THE FIRST UNIT     09428600
*                                      FROM THE DATA FLOW SYNCHRONOUS   09528600
*                                      QUEUE                    X3004BH 09578600
RPLDFASY EQU   X'02'                   RECEIVE THE FIRST UNIT FROM THE  09628600
*                                      DATA FLOW ASYNCHRONOUS QUEUE     09678600
*                                                               X3004BH 09728600
RPLCHN   DS    XL1                     POSITION IN REQUEST UNIT         09878600
*                                      CHAIN                    X3004BH 09928600
RPLFIRST EQU   X'80'                   FIRST IN RU CHAIN        X3004BH 09978600
RPLMIDLE EQU   X'40'                   AN INTERMEDIATE RU       X3004BH 10028600
RPLLAST  EQU   X'20'                   LAST IN RU CHAIN         X3004BH 10078600
RPLONLY  EQU   X'10'                   ONLY ONE RU IN CHAIN     X3004BH 10128600
RPLVTFL1 DS    XL1                     VTAM FLAGS               X3004BH 10178600
RPLVTUSE EQU   X'40'                   THIS IS A VTAM SYSTEM RPL; IF 0, 10428600
*                                      THIS IS A USER RPL       X3004BH 10478600
RPLAUTUS EQU   X'20'                   VTAM FAST PATH          @ZM31226 10488600
RPLTNDSP EQU   X'10'                   1=DOMAIN REQUEST        @G40AKCM 10498600
RPLTLGAC EQU   X'08'                   1=LOGON ACCOMPLISHED    @G40AKCM 10508600
RPLVTFL2 DS    XL1                     POST/RESPOND FLAGS       X3004BH 10528600
RPLSCHED EQU   X'80'                   POST THE RPL WHEN THE REQUEST    10578600
*                                      HAS BEEN SCHEDULED; IF 0, POST   10628600
*                                      THE RPL WHEN THE RESPONSE        10678600
*                                      HAS ARRIVED              X3004BH 10728600
RPLQRI   EQU   X'08'                   IF ON THEN QUEUE AL RESPONSES    10738600
*                                      IF OFF DONT QUEUE       @G40AKSL 10748600
RPLEX    EQU   X'04'                   RETURN ONLY EXCEPTION RESPONSES  10778600
*                                      (WITH SEND) OR THIS IS AN        10828600
*                                      EXCEPTION RESPONSE (WITH         10878600
*                                      RECEIVE); IF 0, RETURN ALL       10928600
*                                      RESPONSES                X3004BH 10978600
RPLNFME  EQU   X'02'                   IF 0, RETURN A FUNCTIONAL        11028600
*                                      MANAGEMENT END RESPONSE (WITH    11078600
*                                      SEND) OR THIS IS A FUNCTIONAL    11128600
*                                      MANAGEMENT END RESPONSE (WITH    11178600
*                                      RECEIVE)                X3004BH  11228600
RPLRRN   EQU   X'01'                   RETURN A REACHED RECOVERY        11278600
*                                      NODE RESPONSE (WITH SEND)        11328600
*                                      OR THIS IS A REACHED RECOVERY    11378600
*                                      NODE RESPONSE (WITH              11428600
*                                      RECEIVE)                 X3004BH 11478600
RPLCNTRL DS    0XL3                    REQUEST UNIT CONTROL CODES       11528600
*                                                               X3004BH 11578600
RPLCNTDF DS    XL1                     DATA FLOW CONTROL CODES  X3004BH 11628600
RPLDATA  EQU   X'80'                   DATA REQUEST, NOT A CONTROL      11678600
*                                      CODE                     X3004BH 11728600
RPLCNCEL EQU   X'40'                   CANCEL REQUEST UNIT CHAINX3004BH 11778600
RPLQC    EQU   X'20'                   THE QUIESCE IS COMPLETE(FOLLOWS  11828600
*                                      QEC)                     X3004BH 11878600
RPLQEC   EQU   X'10'                   QUIESCE AT THE END OF THE        11928600
*                                      CURRENT REQUEST UNIT CHAIN       11978600
*                                                               X3004BH 12028600
RPLCHASE EQU   X'08'                   SEND ALL OUTSTANDING RESPONSES   12078600
*                                      FOLLOWED BY THE CHASE RESPONSE   12128600
*                                                               X3004BH 12178600
RPLRELQ  EQU   X'04'                   QUIESCE IS RELEASED      X3004BH 12228600
RPLQI    EQU   X'02'                   RESERVED FOR VTAM       X03004JS 12278600
RPLCNTDC DS    XL1                     DATA FLOW CONTROL CODES X03004JS 12328600
RPLBID   EQU   X'80'                   REQUEST PERMISSION TO BEGIN      12338600
*                                      BRACKET                 X03004JS 12348600
RPLRTR   EQU   X'40'                   READY TO RECEIVE        X03004JS 12358600
RPLLUS   EQU   X'20'                   LOGICAL UNIT STATUS     X03004JS 12368600
RPLSIGNL EQU   X'10'                   SIGNAL DATA AVAILABLE   X03004JS 12370600
RPLTBIND EQU   X'08'                   BIND                    G40AKCM  12371600
RPLTUNBD EQU   X'04'                   UNBIND                  G40AKCM  12372600
RPLSBI   EQU   X'02'                   SBI                     G40AKCM  12373600
RPLBIS   EQU   X'01'                   BIS                     G40AKCM  12374600
RPLCNTSC DS    XL1                     SESSION CONTROL CODES    X3004BH 12378600
RPLSDT   EQU   X'80'                   START DATA TRAFFIC       X3004BH 12428600
RPLCLEAR EQU   X'40'                   CLEAR ALL DATA TRAFFIC FOR       12478600
*                                      THIS SESSION             X3004BH 12528600
RPLSTSN  EQU   X'20'                   SET AND TEST SEQUENCE            12578600
*                                      NUMBERS                  X3004BH 12628600
RPLSHUTD EQU   X'10'                   SHUTDOWN IS REQUESTED    X3004BH 12678600
RPLSHUTC EQU   X'08'                   SHUTDOWN IS COMPLETE     X3004BH 12728600
RPLRQR   EQU   X'04'                   REQUEST RECOVERY OF SESSION      12778600
*                                                               X3004BH 12828600
RPLRSHUT EQU   X'02'                   REQUEST SHUTDOWN        X03004JS 12838600
         ORG   RPLRBAR                                          X3004BH 12878600
RPLOBSQV DS    AL2                     STSN OUTBOUND SEQUENCE           12928600
*                                      NUMBER                   X3004BH 12978600
RPLIBSQV DS    AL2                     STSN INBOUND SEQUENCE            13028600
*                                      NUMBER                   X3004BH 13078600
RPLOBSQ  DS    XL1                     STSN OUTBOUND ACTION CODES       13128600
*                                                               X3004BH 13178600
RPLOSET  EQU   X'80'                   SET THE OUTBOUND SEQUENCE        13228600
*                                      NUMBER                   X3004BH 13278600
RPLOTST  EQU   X'40'                   SET THE OUTBOUND SEQUENCE        13328600
*                                      NUMBER UNCONDITIONALLY AND       13378600
*                                      INDICATE IF ACCEPTABLE   X3004BH 13428600
RPLORSET EQU   X'20'                   RESET THE OUTBOUND SEQUENCE      13478600
*                                      TO THE DEFAULT VALUE(0)  X3004BH 13528600
RPLOIGN  EQU   X'10'                   IGNORE THE OUTBOUND SEQUENCE     13578600
*                                      NUMBER                   X3004BH 13628600
RPLOPOS  EQU   X'08'                   THE OUTBOUND SEQUENCE NUMBER     13678600
*                                      IS ACCEPTABLE (FOLLOWS TESTSET)  13728600
*                                                               X3004BH 13778600
RPLONEG  EQU   X'04'                   THE OUTBOUND SEQUENCE NUMBER     13828600
*                                      IS NOT ACCEPTABLE (FOLLOWS       13878600
*                                      TESTSET)                 X3004BH 13928600
RPLOINV  EQU   X'02'                   THE OUTBOUND SEQUENCE NUMBER     13978600
*                                      IS INVALID               X3004BH 14028600
RPLIBSQ  DS    XL1                     STSN INBOUND ACTION CODES        14078600
*                                                               X3004BH 14128600
RPLISET  EQU   X'80'                   SET THE INBOUND SEQUENCE         14178600
*                                      NUMBER                   X3004BH 14228600
RPLITST  EQU   X'40'                   SET THE INBOUND SEQUENCE         14278600
*                                      NUMBER UNCONDITIONALLY AND       14328600
*                                      INDICATE IF ACCEPTABLE   X3004BH 14378600
RPLIRSET EQU   X'20'                   RESET THE INBOUND SEQUENCE       14428600
*                                      TO THE DEFAULT VALUE(0)  X3004BH 14478600
RPLIIGN  EQU   X'10'                   IGNORE THE INBOUND SEQUENCE      14528600
*                                      NUMBER                   X3004BH 14578600
RPLIPOS  EQU   X'08'                   THE INBOUND SEQUENCE NUMBER      14628600
*                                      IS ACCEPTABLE (FOLLOWS TESTSET)  14678600
*                                                               X3004BH 14728600
RPLINEG  EQU   X'04'                   THE INBOUND SEQUENCE NUMBER      14778600
*                                      IS NOT ACCEPTABLE (FOLLOWS       14828600
*                                      TESTSET)                 X3004BH 14878600
RPLIINV  EQU   X'02'                   THE INBOUND SEQUENCE NUMBER      14928600
*                                      IS INVALID               X3004BH 14978600
RPLSEQNO DS    AL2                     RESPONSE SEQUENCE NUMBER         15028600
*                                      IDENTIFIER               X3004BH 15078600
         ORG  ,                                                @ZA48668 15083600
         ISTRPLFB ,                    INCLUDE FEEDBACK CODES    X03004 15088600
         MEND                                                           15128600
*        END OF RPL VTAM EXTENSION                                   */ 15178600
*%RPLEND: ;                                                             15228600
