*/*  INCLUDE SYSLIB(IFGWAX)                                          */ 00050000
*    % GOTO WAXL1;                      /*EXPAND PLS PORTION         */ 00100000
*/*                                                                     00150000
         MACRO                                                          00200000
         IFGWAX                                                         00250000
*                                                                    */ 00300000
*  %WAXL1 : ;                                                  /*    */ 00350000
*/*                                                                  */ 00400000
*/* **************************************************************** */ 00450000
*/*                                                                  */ 00500000
*/*$MAC(IFGWAX):   O/C/E WORK AREA EXTENSION ADDRESSING MACRO        */ 00550000
*/*                                                                  */ 00600000
*/*PROPRIETARY V3 STATEMENT                                          */ 00650000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00700000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00750000
*/*5694-A01                                                          */ 00800000
*/*(C) COPYRIGHT 1984,2000  IBM CORP.                                */ 00850000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00900000
*/*                                                                  */ 00950000
*/* STATUS - OS/390 DFSMS 3.10                                       */ 01000000
*/*                                                                  */ 01050000
*/* FUNCTION = O/C/E MACRO USED TO PROVIDE ADDRESSABILITY TO         */ 01100000
*/*            O/C/E WORK AREA EXTENSION                             */ 01150000
*/*                                                                  */ 01200000
*/* NOTES = NONE.                                                    */ 01250000
*/*                                                                  */ 01300000
*/*     DEPENDENCIES = NONE                                          */ 01350000
*/*                                                                  */ 01400000
*/*     RESTRICTIONS = CHANGES TO THIS MACRO MUST BE COORDINATED     */ 01450000
*/*                    WITH FUNCTIONS WHICH INTERFACE INTERNALLY     */ 01500000
*/*                    WITH O/C/E ROUTINES. THIS MACRO WAS DESIGNED  */ 01550000
*/*                    TO BE USED IN A DSECT.                        */ 01600000
*/*                                                                  */ 01700000
*/*     REGISTER CONVENTIONS = NOT APPLICABLE.                       */ 01750000
*/*                                                                  */ 01800000
*/* PATCH LABEL = NOT APPLICABLE.                                    */ 01850000
*/*                                                                  */ 01900000
*/* MODULE TYPE = MACRO.                                             */ 01950000
*/*                                                                  */ 02000000
*/*     PROCESSOR = ASSEMBLER LANGUAGE.                              */ 02050000
*/*                                                                  */ 02100000
*/*     MODULE SIZE = DESCRIBED BY THE LABEL WAXLEN.                 */ 02150000
*/*                                                                  */ 02200000
*/*     ATTRIBUTES = DSECT FIELDS.                                   */ 02250000
*/*                                                                  */ 02300000
*/* ENTRY POINT = WAXTN IN BAL AND PLS VERSIONS                      */ 02350000
*/*                                                                  */ 02400000
*/*     PURPOSE = THIS MACRO IS TO BE USED IN CONJUNCTION WITH       */ 02450000
*/*               THE IECDSECS MACRO TO DEFINE AND MAP INTERNAL      */ 02500000
*/*               WORK AREAS USED BY O/C/E AND FUNCTIONS WHICH       */ 02550000
*/*               INTERNALLY INTERFACE WITH O/C/E. THIS MACRO IS     */ 02600000
*/*               CALLED BY O/C/E CSECTS AT ASSEMBLY TIME. IT WILL   */ 02650000
*/*               BE AUTOMATICALLY INCLUDED ANY TIME THE O/C/E       */ 02700000
*/*               WORK AREA IS MAPPED. THE EXTENSION WILL BE         */ 02750000
*/*               OBTAINED IN STORAGE ABOVE THE 16M LINE.            */ 02800000
*/*                                                                  */ 02850000
*/*     LINKAGE = IFGWAX FOR BAL CALL                                */ 02900000
*/*               % INCLUDE SYSLIB(IFGWAX) IN PLS CALL               */ 02950000
*/*                                                                  */ 03000000
*/*     INPUT = NONE                                                 */ 03050000
*/*                                                                  */ 03100000
*/*                                                                  */ 03150000
*/*     OUTPUT = MAPPING OF COMMON O/C/E WORK AREA EXTENSION.        */ 03200000
*/*                                                                  */ 03250000
*/* EXIT NORMAL = MEND STATEMENT                                     */ 03300000
*/*                                                                  */ 03350000
*/* EXIT ERROR = NONE                                                */ 03400000
*/*                                                                  */ 03450000
*/* EXTERNAL REFERENCES = NONE.                                      */ 03500000
*/*                                                                  */ 03550000
*/* TABLES = NONE.                                                   */ 03600000
*/*                                                                  */ 03650000
*/* MACROS = NONE                                                    */ 03700000
*/*                                                                  */ 03750000
*/* CHANGE ACTIVITY =                                                */ 03800000
*/*                                                                  */ 03850000
*/*$00=SERVICE,HDZ11D0,960822,SJPLGEC: INITIAL DISTRIBUTION          */ 03900000
*/*$L1=K140587,HDZ11D0,970228,SJPLJAL: DETECT DUPLICATE VOLSERS  @L1A*/ 03925000
*/*$L2=K140652,HDZ11D0,970228,SJPLJAL: MISSING PLX CLOSING CMT   @L2A*/ 03937500
*/*$L3=ANSIV4,HDZ11E0,981231,SJPLJAL: ANSI V4 SUPPORT            @L3A*/ 03940600
*/*$L4=MODIDTR,HDZ11D0,981231,SJPLJAL: SERVICEABILITY: MODID TRC @L4A*/ 03943700
*/*$L5=ANSIV4,HDZ11E0.981231,SJPLJAL: ANSIV V4 CCSID SUPPORT     @L5A*/ 03946800
*/*$L6=GT32K,HDZ11F0.981109,SJPLGEC: LBI LARGE BLKSIZE SUPPORT   @L6A*/ 03948400
*/*$L7=OW38717,HDZ11E0,990630,SJPLJAL: BLYTHE2 support           @L7A*/ 03949600
*/*$L8=KFI0091,HDZ11F0,990930,SJPLJAL: SAVE PSEUDO LBL BLOCKIDS  @L8A*/ 03949800
*/*$01=OW42881,HDZ11E0,000216,SJPLGEC: TASK OWNS ENQ FLAG        @01A*/ 03949900
*/*$P1=K161198,HDZ11F0,000328,SJPLGEC: CORRECT DOUBLY DEFINED FLG@P1A*/ 03966600
*/*$P2=K161213,HDZ11F0,000331,SJPLGEC: DEFINE NEW FLAG           @P2A*/ 03974900
*/*$02=OW44466,HDZ11F0,000306,SJPLGEC: BLKSZLIM SUPPORT          @02A*/ 03978890
*/*$03=OW44532,HDZ11F0,000525,SJPLGEC: DEFINE NEW FLAG FOR BCB   @03A*/ 03979880
*/*$L9=OW45309,HDZ11F0,000730,SJPLJAL: MTL SUPPORT               @L9A*/ 03980270
*/*                                                                  */ 03980870
*/*                                                                  */ 03983300
*/* **************************************************************** */ 04000000
*/*                                                                  */ 04050000
*/*                                                                  */ 04100000
*/*      THIS MACRO IS USED TO DEFINE AND MAP THE EXTENSION TO THE   */ 04150000
*/*      O/C/E WORK AREA. THE EXTENSION RESIDES ABOVE THE 16M LINE.  */ 04200000
*/*                                                                  */ 04250000
*/*      O/C/E = OPEN, OPEN TYPE=J, CLOSE, CLOSE TYPE=T,             */ 04300000
*/*              EOV, FEOV, & RDJFCB.                                */ 04350000
*/*                                                                  */ 04400000
*/* **************************************************************** */ 04450000
*/*                                                                  */ 05150000
*/* **************************************************************** */ 05200000
*/*                                                                  */ 05250000
*%GOTO WAXL2;                                                           05300000
WAXTN    DSECT                                                          05350000
         SPACE 1                                                        05400000
WAXMODID DS    CL8                 ID OF MODULE WHO DETECTED ERROR(TO   05450000
*                                   BE USED IN DETERMINATE ABEND        05500000
*                                   MESSAGES).                          05550000
         SPACE 1                                                        05600000
*********************************************************************** 05650000
*                                                                       05700000
*        O/C/E INTERNAL USE WORK AREA                                   05750000
*                                                                       05800000
*        WAXWORKN CAN BE USED BY ANY O/C/E MODULE TO DEFINE FLAGS       05850000
*        OR FIELDS WHICH IT WANTS TO USE FOR INTERNAL USE ONLY. IF      05900000
*        ANOTHER O/C/E MODULE IS GIVEN CONTROL THEN THOSE FLAGS OR      05950000
*        FIELDS ARE NO LONGER VALID AND COULD BE DEFINED FOR SOME       06000000
*        OTHER USE BY THE CURRENT O/C/E MODULE IN CONTROL. WAXWORKN     06050000
*        SHOULD NOT BE USED TO PASS INFORMATION FROM ONE MODULE TO      06100000
*        ANOTHER.                                                       06150000
*                                                                       06200000
*********************************************************************** 06250000
         SPACE 1                                                        06300000
WAXWORK0 DS    CL4                      WORK AREA 0                     06350000
WAXWORK1 DS    CL4                      WORK AREA 1                     06400000
WAXWORK2 DS    CL4                      WORK AREA 2                     06450000
WAXWORK3 DS    CL4                      WORK AREA 3                     06500000
WAXWORK4 DS    CL4                      WORK AREA 4                     06550000
WAXWORK5 DS    CL4                      WORK AREA 5                     06600000
WAXWORK6 DS    CL4                      WORK AREA 6                     06650000
WAXWORK7 DS    CL4                      WORK AREA 7                     06700000
WAXWORK8 DS    CL4                      WORK AREA 8                     06750000
WAXWORK9 DS    CL4                      WORK AREA 9                     06800000
         SPACE 1                                                        06850000
WAXNXTVL DS    CL6                      NEXT VOLSER DURING EOV     @L1A 06862500
WAXFLG1  DS    BL1                      MISC FLAGS                 @L1A 06875000
WAX1HRTN EQU   X'80'                    RETURN TO IFG0551H AFTER   @L1A 06887500
*                                       IEC708I                    @L1A 06900000
WAXLBIOK EQU   X'40'                    DEVICE(S) SUPPORT LBI      @L6A 06906200
WAXNLMOD EQU   X'20'                    NL TAPE DS OPENED MOD      @L7A 06907400
WAXNINDX EQU   X'10'                    VOLM/FILEV REQUESTS TO     @L7A 06908600
WAXNOFMT EQU   X'08'                    BLYTHE CART NOT FORMATTED  @L7A 06909800
*                                       DISABLE LOADER INDEXING    @L7A 06911000
WAXNQHLD EQU   X'04'                    THIS TASK OWNS VOLSER ENQ  @P1C 06911700
WAXFSLBI EQU   X'02'                    RECFM IS STANDARD WITH     @P2A 06911900
*                                        DIFFERENT BLKSIZES        @P2A 06912100
WAXCBLNF EQU   X'01'                    BCBCBLNF FLAG ON-MUST GET  @03A 06912190
*                                        BCB BELOW LINE AND BUFFERS@03A 06912280
*                                        ABOVE                     @03A 06912370
         DS    CL1                      RESERVED                   @L1A 06912500
WAXREG14 DS    F                        REG14                      @L1A 06925000
WAXDFVER DS    CL1                      ANSI VERSION SYS DEFAULT   @L3A 06928300
WAXALVER DS    CL1                      PREVAILING ANSI VERSION    @L3A 06931600
         DS    H                        RESERVED                   @L3A 06934900
WAXJBCCS DS    F                        CCSID ON JCL JOB STMT      @L5A 06935800
WAXSPCCS DS    F                        CCSID ON JCL STEP STMT     @L5A 06936700
WAXDDCCS DS    F                        CCSID ON JCL DD  STMT      @L5A 06937600
WAXLBCCS DS    F                        CCSID ON LABEL FOR INPUT   @L5A 06938500
*                                       OR MOD                     @L5A 06939200
WAXCSERR DS    F                        INTERNAL PROB DET ERROR    @L5C 06939900
*                                       CODE FOR CCSID FAILURE     @L5A 06940600
WAXMODTR DS    F                        ADDRESS OF MODID TRACE     @L4A 06941600
WAXLBKS8 DS    0XL8                     SIOTX BLOCK SIZE IN 8 BYTES@L6A 06942500
         DS    F                        HI-ORDER HALF OF BLOCKSIZE @L6A 06943400
WAXLBKSZ DS    CL4                      SIOTX BLOCKSIZE VALUE      @L6A 06944300
WAXMXBLK DS    CL8                      MAXIMUM BLKSIZE SUPPORTED  @L6A 06945200
*                                       (RETURNED BY DEVTYPE)      @L6A 06946100
WAXRBLK  DS    CL8                      RECOMMENDED BLKSIZE        @L6A 06947000
*                                       (RETURNED BY DEVTYPE)      @L6A 06947900
WAXBLKID DS    F                        BLOCKID OF TM AFTER DATA   @L8A 06950500
WAXMTLVL DS    CL6                      MTL VOLSER FROM VOL1, OR   @L9A 06955190
*                                       VOLM OR IEC519A OR VOLNSNS @L9A 06957180
*                                       LABEL                      @L7A 06961000
WAXRECTK DS    XL1                      NTA TAPE TRACK RECTECH -   @L7A 06964900
*                                         TRUE/UNDERLYING VALUE    @L7A 06968800
WAXMEDTY DS    XL1                      NTA TAPE MEDIA TYPE -      @L7A 06972700
*                                         TRUE/UNDERLYING VALUE    @L7A 06976600
WAXCAPM  DS    F                        NTA TAPE MEDIA CAPACITY    @L7A 06980500
WAXCAPP  DS    F                        NTA TAPE PARTITION CAPACITY@L7A 06984400
WAXSVLA  DS    AL4                      SERVL ADDRESS              @L7A 06988300
WAXBKLIM DS    CL8                      BLKSZLIM VALUE             @02A 06993190
WAXSTGRP DS    CL8                      SMS STORAGE GRP ASSOCIATED @L9A 06994370
*                                       WITH CURRENT UNIT          @L9A 06994560
WAXMTDIS DS    CL1                      MEDIA TYPE FOR MSGDISP     @L9A 06994750
WAXSTGTY DS    XL1                      SG TYPE (GENERAL/SPECIFIC) @L9A 06994940
         DS    CL2                      RESERVED FOR FUTURE USE    @L9A 06995130
         DS    15F                      RESERVED FOR FUTURE USE    @L9C 06995320
         SPACE 1                                                        06996100
*                                                                       07000000
****************************************************************        07050000
*                                                                       07100000
WAXLEN   EQU   *-WAXTN                  WORKAREA EXTENSION SIZE         07150000
*                                                                       07200000
****************************************************************        07250000
*                                                                       07300000
*             END OF SYMBOLS GENERATED BY IFGWAX                        07350000
*                                                                       07400000
****************************************************************        07450000
         MEND                                                           07500000
*                                                                    */ 07550000
*/*                                                                  */ 07600000
*/* BLOCK COMMENT DESCRIBING THE SIZE OF EACH PORTION OF THE         */ 07650000
*/* WORK AREA HAS BEEN MADE COMMON TO BOTH ASSMBLER AND PL/S         */ 07700000
*/*                                                                  */ 07750000
*%WAXL2 : ;                                                    /*    */ 07800000
*DCL 1 WAXTN BASED(DXOCEWAX) BDY(DWORD),                                07850000
*      2 WAXMODID CHAR(8),              /* ID OF MODULE WHO DETECTED    07900000
*                                          ERROR(TO BE USED IN          07950000
*                                          DETERMINATE ERROR MSG     */ 08000000
*/********************************************************************* 08050000
*                                                                       08100000
*        O/C/E INTERNAL USE WORK AREA                                   08150000
*                                                                       08200000
*        WAXWORKN CAN BE USED BY ANY O/C/E MODULE TO DEFINE FLAGS       08250000
*        OR FIELDS WHICH IT WANTS TO USE FOR INTERNAL USE ONLY. IF      08300000
*        ANOTHER O/C/E MODULE IS GIVEN CONTROL THEN THOSE FLAGS OR      08350000
*        FIELDS ARE NO LONGER VALID AND COULD BE DEFINED FOR SOME       08400000
*        OTHER USE BY THE CURRENT O/C/E MODULE IN CONTROL. WAXWORKN     08450000
*        SHOULD NOT BE USED TO PASS INFORMATION FROM ONE MODULE TO      08500000
*        ANOTHER.                                                       08550000
*                                                                       08600000
**********************************************************************/ 08650000
*      2 WAXWORK0 CHAR(4),              /* WORK AREA 0               */ 08700000
*      2 WAXWORK1 CHAR(4),              /* WORK AREA 1               */ 08750000
*      2 WAXWORK2 CHAR(4),              /* WORK AREA 2               */ 08800000
*      2 WAXWORK3 CHAR(4),              /* WORK AREA 3               */ 08850000
*      2 WAXWORK4 CHAR(4),              /* WORK AREA 4               */ 08900000
*      2 WAXWORK5 CHAR(4),              /* WORK AREA 5               */ 08950000
*      2 WAXWORK6 CHAR(4),              /* WORK AREA 6               */ 09000000
*      2 WAXWORK7 CHAR(4),              /* WORK AREA 7               */ 09050000
*      2 WAXWORK8 CHAR(4),              /* WORK AREA 8               */ 09100000
*      2 WAXWORK9 CHAR(4),              /* WORK AREA 9               */ 09150000
*      2 WAXNXTVL     CHAR(6),          /* NEXT VOLSER DURING EOV@L1A*/ 09161100
*      2 WAXFLG1      CHAR(1),          /*                       @L1A*/ 09172200
*        3 WAX1HRTN   BIT(1),           /* RETURN TO IFG0551H    @L1A   09183300
*                                          AFTER IEC708I         @L1A*/ 09194400
*        3 WAXLBIOK   BIT(1),           /* DEVICE(S) SUPPORT LBI @L6A*/ 09197500
*        3 WAXNLMOD   BIT(1),           /* NL TP DS OPENED MOD   @L7A*/ 09200600
*        3 WAXNINDX   BIT(1),           /* VOLM/FILEV REQUESTS TO@L7A*/ 09203700
*                                       /* DISABLE LOADER INDEX  @L7A*/ 09206800
*        3 WAXNOFMT   BIT(1),           /* BLY CART NOT FORMATTED@L7A*/ 09209900
*        3 WAXNQHLD   BIT(1),           /* THIS TASK OWNS VOLSER        09213900
*                                            ENQ                 @P1C*/ 09214800
*        3 WAXFSLBI   BIT(1),           /* RECFM IS STANDARD WITH       09215200
*                                            DIFFERENT BLKSIZES  @P2A*/ 09215600
*        3 WAXCBLNF   BIT(1),           /* BCBCBLNF FLAG ON-MUST GET    09216090
*                                          BCB BELOW LINE AND BUFFERS   09216180
*                                          ABOVE                 @03C*/ 09216270
*      2 *            CHAR(1),          /* RESERVED              @L1A*/ 09216600
*      2 WAXREG14     CHAR(4),          /* REG14                 @L2C*/ 09227700
*      2 WAXDFVER     CHAR(1),          /* ANSI VER SYS DEFAULT  @L3A*/ 09230600
*      2 WAXALVER     CHAR(1),          /* PREVAILING AL VERSION @L3A*/ 09233500
*      2 *            CHAR(2),          /* RESERVED              @L3A*/ 09236400
*      2 WAXJBCCS     FIXED(32),        /* CCSID ON JCL JOB STMT @L5A*/ 09237700
*      2 WAXSPCCS     FIXED(32),        /* CCSID ON JCL STEP STMT@L5A*/ 09239000
*      2 WAXDDCCS     FIXED(32),        /* CCSID ON JCL DD STMT  @L5A*/ 09240300
*      2 WAXLBCCS     FIXED(32),        /* CCSID ON LBL FOR INPUT       09241600
*                                          OR MODE               @L5A*/ 09242900
*      2 WAXCSERR     FIXED(32),        /* INTERNAL PROB DET ERROR      09244200
*                                          CODE FOR CCSID FAILURE@L5C*/ 09245500
*      2 WAXMODTR     CHAR(4),          /* ADDRESS OF MODID TRACE@L5C*/ 09246800
*      2 WAXLBKS8     CHAR(8),          /* 8 BYTE SIOT BLKSIZE   @L6A*/ 09247100
*        3 *          CHAR(4),          /*                       @L6A*/ 09247400
*        3 WAXLBKSZ   CHAR(4),          /* SIOTX BLKSIZE VALUE   @L6A*/ 09247700
*      2 WAXMXBLK     CHAR(8),          /* MAXIMUM BLKSIZE SUPPORTED    09248000
*                                          (RETURNED BY DEVTYPE) @L6A*/ 09248300
*      2 WAXRBLK      CHAR(8),          /* RECOMMENDED BLKSIZE          09248600
*                                          (RETURNED BY DEVTYPE) @L6A*/ 09248900
*      2 WAXBLKID     FIXED(32),        /* BLOCKID TM AFTER DATA @L8A*/ 09251100
*      2 WAXMTLVL     CHAR(6),          /* MTL VOLSER FROM VOL1, OR     09255290
*                                          VOLM OR IEC519A OR           09257280
*                                          VOLNSNS               @L9A*/ 09259270
*      2 WAXRECTK     FIXED(8),         /* NTA TAPE TRACK RECTECH@L7A   09264700
*                                           TRUE/UNDERLYING VALUE@L7A*/ 09268500
*      2 WAXMEDTY     FIXED(8),         /* NTA TAPE MEDIA TYPE   @L7A   09272300
*                                           TRUE/UNDERLYING VALUE@L7A*/ 09276100
*      2 WAXCAPM      FIXED(31),        /* NTA TP MEDIA CAPACITY @L7A*/ 09279900
*      2 WAXCAPP      FIXED(31),        /* NTA TP PARTITION CAP  @L7A*/ 09283700
*      2 WAXSVLA      PTR(31),          /* SERVL ADDRESS         @L7A*/ 09287500
*      2 WAXBKLIM     CHAR(8),          /* BLKSZLIM VALUE        @02A*/ 09292290
*      2 WAXSTGRP     CHAR(8),          /* SMS STORAGE GRP       @L9A   09293470
*                                           ASSOCIATED WITH      @L9A   09293660
*                                           CURRENT UNIT         @L9A*/ 09293850
*      2 WAXMTDIS     CHAR(1),          /* MEDIATYPE FOR MSGDISP @L9A*/ 09294040
*      2 WAXSTGTY     FIXED(8),         /* SMS SG TYPE (GENERAL  @L9A*/ 09294230
*                                       /* OR SPECIFIC)          @L9A*/ 09294420
*      2 *            CHAR(2),          /* RESERVED              @L9A*/ 09294610
*      2 *            CHAR(60);         /* RESERVED              @L9C*/ 09294800
*/*                                                                  */ 09295100
*/* ************************************************************     */ 09300000
*/*                                                                  */ 09350000
*/*           END OF SYMBOLS GENERATED BY IFGWAX                     */ 09400000
*/*                                                                  */ 09450000
*/* ************************************************************     */ 09500000
