*        %GOTO DCSIE1;                                                  00050000
         MACRO                                                          00100000
         IGBDCSIE                                                       00150000
*********************************************************************** 00173300
*                                                                       00196600
.*  $MAC(IGBDCSIE):                                                     00219900
*     DASD CALCULATION SERVICES INSTALLATION EXIT PARAMETER LIST        00243200
.*                    ASSEMBLER VERSION                                 00266500
*                                                                       00289800
.*PROPRIETARY V3 STATEMENT                                              00304300
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00318800
.*"RESTRICTED MATERIALS OF IBM"                                         00333300
.*5695-DF1                                                              00347800
.*(C) COPYRIGHT 1986  IBM CORP.                                         00362300
.*END PROPRIETARY V3 STATEMENT                                          00384300
.*                                                                      00406300
*   $L0=NEWDCS,JDP2220,,STLPAD:  DCS INITIAL RELEASE                    00429600
*                                                                       00452900
*********************************************************************** 00476200
DCSIEPL  DSECT                    INSTALLATION EXIT PARM LIST           00500000
DCSIEDSN DS    CL44               DATA SET NAME                         00550000
DCSIEDSO DS    BL2                DATA SET ORGANIZATION                 00600000
         DS    H                                                        00650000
DCSIEKP  DS    F                  KEY POSITION                          00700000
DCSIELRL DS    F                  LOGICAL/AVG RECORD LENGTH             00750000
DCSIETC  DS    F                  TRACK CAPACITY                        00800000
DCSIEBUF DS    F                  BUFFERSPACE                           00850000
DCSIESTG DS    F                  PTR TO EXIT WORKSPACE                 00875000
DCSIEKL  DS    H                  KEY LENGTH                            00900000
DCSIEBS  DS    H                  BLOCK/CI SIZE                         00950000
DCSIECOB DS    H                  CALCULATED OPTIMAL BLOCK/CI SIZE      01000000
DCSIEVSN DS    CL6                VOLUME SERIAL NUMBER                  01050000
*                                                                       01052300
*   EQUATES FOR FIRST BYTE OF DCSIEDSO (DATA SET ORGANIZATION)          01054600
*                                                                       01056900
DCSIEIS  EQU   X'80'              INDEX SEQUENTIAL ORGANIZATION         01059200
DCSIEPS  EQU   X'40'              PHYSICAL SEQUENTIAL ORGANIZATION      01061500
DCSIEDA  EQU   X'20'              DIRECT ORGANIZATION                   01063800
DCSIECX  EQU   X'10'              BTAM OR QTAM LINE GROUP               01066100
DCSIEPO  EQU   X'02'              PARTITIONED ORGANIZATION              01068400
DCSIEU   EQU   X'01'              U-UNMOVABLE, THE DATA CONTAINS        01070700
*                                 LOCATION-DEPENDENT INFORMATION        01073000
         EJECT                                                          01075300
*                                                                       01077600
*   EQUATES FOR SECOND BYTE OF DCSIEDSO (DATA SET ORGANIZATION)         01079900
*                                                                       01082200
DCSIEGS  EQU   X'80'              GRAPHICS ORGANIZATION                 01084500
DCSIETX  EQU   X'40'              TCAM LINE GROUP                       01086800
DCSIETQ  EQU   X'20'              TCAM MESSAGE QUEUE                    01089100
DCSIEAM  EQU   X'08'              ACCESS METHOD CONTROL BLOCK (VSAM     01091400
*                                 DATA SET)                             01093700
DCSIETR  EQU   X'04'              TCAM 3705                             01096000
         MEND                                                           01100000
*%DCSIE1 : ;                                                            01150000
*/********************************************************************/ 01200000
*/*                                                                  */ 01250000
*/*   DASD CALCULATION SERVICES INSTALLATION EXIT PARAMETER LIST     */ 01300000
*/*                   PL/AS VERSION                                  */ 01350000
*/*                                                                  */ 01400000
*/********************************************************************/ 01450000
*DCL 1 DCSIEPL BASED,             /* INSTALLATION EXIT PARM LIST     */ 01500000
*      2 DCSIEDSN    CHAR(44),    /* DATA SET NAME                   */ 01550000
*      2 DCSIEDSO    BIT(16),     /* DATA SET ORGANIZATION           */ 01600000
*      2 *           CHAR(2),                                           01650000
*      2 DCSIEKP     FIXED(31),   /* KEY POSITION                    */ 01700000
*      2 DCSIELRL    FIXED(31),   /* LOGICAL RECORD LENGTH           */ 01750000
*      2 DCSIETC     FIXED(31),   /* TRACK CAPACITY                  */ 01800000
*      2 DCSIEBUF    FIXED(31),   /* BUFFERSPACE                     */ 01850000
*      2 DCSIESTG    PTR(31),     /* PTR TO EXIT WORKSPACE           */ 01875000
*      2 DCSIEKL     FIXED(15),   /* KEY LENGTH                      */ 01900000
*      2 DCSIEBS     FIXED(15),   /* BLOCKSIZE                       */ 01950000
*      2 DCSIECOB    FIXED(15),   /* CALCULATED OPTIMAL BLOCKSIZE    */ 02000000
*      2 DCSIEVSN    CHAR(6);     /* VOLUME SERIAL NUMBER            */ 02050000
*@EJECT;                                                                02100000
*/********************************************************************/ 02150000
*/*                                                                  */ 02200000
*/*   EQUATES FOR DCSIEDSO (DATA SET ORGANIZATION)                   */ 02250000
*/*                                                                  */ 02300000
*/********************************************************************/ 02350000
*@SPACE;                                                                02400000
*DCL DCSIEIS BIT(16) CONSTANT('8000'X);                                 02450000
*                                   /* INDEX SEQUENTIAL ORGANIZATION */ 02500000
*DCL DCSIEPS BIT(16) CONSTANT('4000'X); /* PHYSICAL SEQUENTIAL          02550000
*                                       ORGANIZATION                 */ 02600000
*DCL DCSIEDA BIT(16) CONSTANT('2000'X); /* DIRECT ORGANIZATION       */ 02650000
*DCL DCSIECX BIT(16) CONSTANT('1000'X); /* BTAM OR QTAM LINE GROUP   */ 02700000
*DCL DCSIEPO BIT(16) CONSTANT('0200'X); /* PARTITIONED ORGANIZATION  */ 02750000
*DCL DCSIEU  BIT(16) CONSTANT('0100'X); /* U-UNMOVABLE, THE DATA        02800000
*                           CONTAINS LOCATION-DEPENDENT INFORMATION  */ 02850000
*DCL DCSIEGS BIT(16) CONSTANT('0080'X); /* GRAPHICS ORGANIZATION     */ 02900000
*DCL DCSIETX BIT(16) CONSTANT('0040'X); /* TCAM LINE GROUP           */ 02950000
*DCL DCSIETQ BIT(16) CONSTANT('0020'X); /* TCAM MESSAGE QUEUE        */ 03000000
*DCL DCSIEAM BIT(16) CONSTANT('0008'X); /* ACCESS METHOD CONTROL BLOCK  03050000
*                                       (VSAM DATA SET)              */ 03100000
*DCL DCSIETR BIT(16) CONSTANT('0004'X); /* TCAM 3705                 */ 03150000
