*/********************************************************************/ 00050000
*/*  MACRO NAME: IGDENVPL                                            */ 00100000
*/*                                                                  */ 00150000
*/*  DESCRIPTION: ENF parameter list.                                */ 00200000
*/*                                                                  */ 00250000
*/*  PERSON RESPONSIBLE: G.M. Dearing                                */ 00300000
*/*                                                                  */ 00350000
*/*  STATUS: DFP/XA 3.2.0                                    @YA29226*/ 00400000
*/*                                                                  */ 00450000
*/*PROPRIETARY V3 STATEMENT                                          */ 00481200
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00512400
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00543600
*/*5695-DF1                                                          */ 00574800
*/*(C) COPYRIGHT 1988  IBM CORP.                                     */ 00616500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00658200
*/*                                                                  */ 00700000
*/*  FUNCTION: ENF(Event Notification Facility) parameter list for   */ 00750000
*/*    changes to SMS resources.                                     */ 00800000
*/*                                                                  */ 00850000
*/*  NOTES:                                                          */ 00900000
*/*                                                                  */ 00950000
*/*    DEPENDENCIES: None                                            */ 01000000
*/*    RESTRICTIONS: None                                            */ 01050000
*/*                                                                  */ 01100000
*/*  MACRO:                                                          */ 01150000
*/*                                                                  */ 01200000
*/*    PROCESSOR: PLAS                                               */ 01250000
*/*    MACRO SIZE: 25                                                */ 01300000
*/*    DISTRIBUTION LIBRARY: AMACLIB                                 */ 01350000
*/*    ATTRIBUTES: Include                                           */ 01400000
*/*                                                                  */ 01450000
*/*  EXIT NORMAL:                                                    */ 01500000
*/*                                                                  */ 01550000
*/*    RETURN CODE: 0                                                */ 01600000
*/*    No errors detected                                            */ 01650000
*/*                                                                  */ 01700000
*/*  EXIT ERRORS:                                                    */ 01750000
*/*                                                                  */ 01800000
*/*      No errors will be detected by this macro.                   */ 01850000
*/*                                                                  */ 01900000
*/*  EXTERNAL REFERENCES:                                            */ 01950000
*/*                                                                  */ 02000000
*/*    MACROS:                                                       */ 02050000
*/*      None                                                        */ 02100000
*/*                                                                  */ 02150000
*/*  CHANGE ACTIVITY:                                                */ 02200000
*/* $O1=OAM  Add constant ENVPLANC for OAM                      @O1A */ 02225000
*/* 90/03/23   Shipping source                               @YA29226*/ 02235000
*/********************************************************************/ 02250000
* %GOTO ENVF1;                      /*                                  02300000
         MACRO                                                          02350000
         IGDENVPL ,                                                     02400000
IGDENVPL DSECT ,                                                        02450000
*********************************************************************** 02500000
* ASSEMBLER output generated by PLASMAP to Assembler Conversion       * 02550000
*  26 Sep 1988 17:46:51                                               * 02600000
*********************************************************************** 02650000
*********************************************************************** 02700000
*        ENF parameter list                                           * 02750000
*********************************************************************** 02800000
ENVPL    DS    0CL68                                                    02850000
ENVPLHDR DS    CL12                                                     02900000
         ORG   ENVPL+0                                                  02950000
ENVPLID  DS    CL8                      Identifier = 'IGDENVPL'         03000000
ENVPLLEN DS    H                        Length of this control block    03050000
ENVPLLEV DS    H                        Level of this control block     03100000
ENVPLBDY DS    CL56                                                     03150000
         ORG   ENVPL+12                                                 03200000
ENVPLTYP DS    AL1                      Type of SMS resource            03250000
         DS    AL1                      Unused                          03300000
ENVPLOSM DS    AL1                      Old SMS status                  03350000
ENVPLNSM DS    AL1                      New SMS status                  03400000
ENVPLOOS DS    AL1                      Old OS status volumes only      03450000
ENVPLNOS DS    AL1                      New OS status volumes only      03500000
         DS    AL2                      reserved                        03550000
ENVPLSYN DS    CL8                      System name for status          03600000
ENVPLUCB DS    A                        UCB address not required        03650000
         DS    F                        reserved                        03700000
ENVPLNAM DS    CL32                     Name of resource for which     X03750000
                                        availability changed            03800000
         ORG   ENVPL+36                                                 03850000
ENVPLNML DS    H                        Length of STORGRP name          04000000
ENVPLCNM DS    CL30                     Name of STORGRP                 04050000
         ORG   ENVPL+38                                                 04066600
ENVPLVLN DS    CL6                      Volume Name                     04083200
ENVPLTUN EQU   0                        Extent of changes unknown       04100000
ENVPLTSY EQU   1                        System List changed             04150000
ENVPLTVL EQU   2                        Volume                          04200000
ENVPLTSG EQU   3                        Storage Group                   04250000
ENVPLVAD EQU   4                        Volume added                    04300000
ENVPLVDL EQU   5                        Volume deleted                  04350000
ENVPLSAD EQU   6                        Storage Group added             04400000
ENVPLSDL EQU   7                        Storage Group deleted           04450000
ENVPLSGV EQU   8                        Storage Group volume available  04475000
ENVPLANC EQU   9                        A new CDS has been activated    04487500
*********************************************************************** 04500000
*        Reason Codes                                                 * 04550000
*********************************************************************** 04600000
ENVPLITP EQU   8000                     Invalid type specified          04650000
*********************************************************************** 04700000
*        Macro identification                                         * 04750000
*********************************************************************** 04800000
ENVPLCLV EQU   0                        Level of control block          04900000
*                                                                       04950000
*                                                                       04975000
      AGO   .SSXXASM                                                    05000000
*                                                                    */ 05050000
* %ENVF1: ;                                                             05100000
*@EJECT M;                                                              05150000
*/********************************************************************/ 05200000
*/*                                                                  */ 05250000
*/*      ENF Parameter list                                          */ 05300000
*/*                                                                  */ 05350000
*/********************************************************************/ 05400000
* DECLARE                                                               05450000
*   /* ENF parameter list                                            */ 05500000
*   1 ENVPL BASED,                                                      05550000
*     2 ENVPLHDR,                                                       05600000
*       3 ENVPLID CHAR(8),          /* Identifier  = 'IGDENVPL'      */ 05650000
*       3 ENVPLLEN FIXED(15),       /* Length of this control block  */ 05700000
*       3 ENVPLLEV FIXED(15),       /* Level of this control block   */ 05750000
*     2 ENVPLBDY,                                                       05800000
*       3 ENVPLTYP FIXED(8),        /* Type of SMS resource          */ 05850000
*       3 * FIXED(8),               /* Unused                        */ 05900000
*       3 ENVPLOSM FIXED(8),        /* Old SMS status                */ 05950000
*       3 ENVPLNSM FIXED(8),        /* New SMS status                */ 06000000
*       3 ENVPLOOS FIXED(8),        /* Old OS status - volumes only  */ 06050000
*       3 ENVPLNOS FIXED(8),        /* New OS status - volumes only  */ 06100000
*       3 * FIXED(16),              /* reserved                      */ 06150000
*       3 ENVPLSYN CHAR(8),         /* System name for status        */ 06200000
*       3 ENVPLUCB POINTER(31),     /* UCB address - not required    */ 06250000
*       3 * FIXED(31),              /* reserved                      */ 06300000
*       3 ENVPLNAM BDY(WORD),       /* Name of resource for which       06350000
*                                      availability changed          */ 06400000
*         4 ENVPLNML FIXED(15),     /* Length of STORGRP name        */ 06450000
*         4 ENVPLCNM CHAR(30),      /* Name of STORGRP               */ 06500000
*           5 ENVPLVLN CHAR(6),     /* Volume Name                   */ 06550000
*   /* ENVPLTYP - type of SMS resource                               */ 06600000
*   ENVPLTUN FIXED(8) CONSTANT(0),  /* Extent of changes unknown     */ 06650000
*   ENVPLTSY FIXED(8) CONSTANT(1),  /* System List changed           */ 06700000
*   ENVPLTVL FIXED(8) CONSTANT(2),  /* Volume                        */ 06750000
*   ENVPLTSG FIXED(8) CONSTANT(3),  /* Storage Group                 */ 06800000
*   ENVPLVAD FIXED(8) CONSTANT(4),  /* Volume added                  */ 06850000
*   ENVPLVDL FIXED(8) CONSTANT(5),  /* Volume deleted                */ 06900000
*   ENVPLSAD FIXED(8) CONSTANT(6),  /* Storage Group added           */ 06950000
*   ENVPLSDL FIXED(8) CONSTANT(7),  /* Storage Group deleted         */ 07000000
*   ENVPLSGV FIXED(8) CONSTANT(8),  /* Storage Group volume available*/ 07025000
*   ENVPLANC FIXED(8) CONSTANT(9),  /* A new CDS has been activated     07033300
*                                                               @O1A */ 07041600
*   /* Reason Codes                                                  */ 07050000
*   ENVPLITP CONSTANT(8000),        /* Invalid type specified        */ 07100000
*   /* Macro identification                                          */ 07150000
*   ENVPLCID CHAR(8) CONSTANT('IGDENVPL'),/* Identifier              */ 07200000
*   ENVPLCLV FIXED(15) CONSTANT(0); /* Level of control block        */ 07250000
* %GOTO MENVF2;                     /*                                  07300000
.SSXXASM ANOP                                                           07350000
         MEND ,                                                         07400000
*                                     */  %MENVF2: ;                    07450000
