*/********************************************************************/ 00050000
*/*  MACRO NAME: IGDSCHRL                                            */ 00100000
*/*                                                                  */ 00150000
*/*  DESCRIPTION: SCHEDULING SERVICES REQUIRED RESOURCE LIST         */ 00200000
*/*                                                                  */ 00250000
*/*  PERSON RESPONSIBLE: R. M. Swank                                 */ 00300000
*/*                                                                  */ 00350000
*/*  STATUS: DFSMS/MVS 1.3.0                                         */ 00400000
*/*                                                                  */ 00450000
*/*PROPRIETARY V3 STATEMENT                                          */ 00481200
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00512400
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00543600
*/*5695-DF1                                                          */ 00574800
*/*(C) COPYRIGHT 1988  IBM CORP.                                     */ 00616500
*/*END PROPRIETARY V3 STATEMENT                                      */ 00658200
*/*                                                                  */ 00700000
*/*  FUNCTION: Maps Scheduling Services Required Resource List.      */ 00750000
*/*                                                                  */ 00800000
*/*  NOTES:                                                          */ 00850000
*/*                                                                  */ 00900000
*/*    DEPENDENCIES: NONE                                            */ 00950000
*/*    RESTRICTIONS: NONE                                            */ 01000000
*/*                                                                  */ 01050000
*/*  MACRO:                                                          */ 01100000
*/*                                                                  */ 01150000
*/*    PROCESSOR: PL/AS, PLS/3, OR ASSEMBLER H                       */ 01200000
*/*    MACRO SIZE: 30                                                */ 01250000
*/*    DISTRIBUTION LIBRARY: MACLIB                                  */ 01300000
*/*    ATTRIBUTES: NONE                                              */ 01350000
*/*                                                                  */ 01400000
*/*  EXIT NORMAL:                                                    */ 01450000
*/*                                                                  */ 01500000
*/*    RETURN CODE: NONE                                             */ 01550000
*/*                                                                  */ 01600000
*/*  EXIT ERRORS:                                                    */ 01650000
*/*                                                                  */ 01700000
*/*      No errors will be detected by this macro.                   */ 01750000
*/*                                                                  */ 01800000
*/*  EXTERNAL REFERENCES:                                            */ 01850000
*/*                                                                  */ 01900000
*/*    MACROS:                                                       */ 01950000
*/*      NONE                                                        */ 02000000
*/*                                                                  */ 02050000
*/*  CHANGE ACTIVITY:                                                */ 02100000
*/*$01=OY65502,HDZ11C0,08/12/93,SJPLRMS: Add a new field to show @01A*/ 02116600
*/*    that volumes are not online with respect to each system.  @01A*/ 02133200
*/********************************************************************/ 02150000
* %GOTO P01SCHRL;   /*                                                  02200000
         MACRO                                                          02250000
    IGDSCHRL                                                            02300000
         AGO   .A0SCHRL                                                 02350000
*                                                                    */ 02400000
* %P01SCHRL: ;                                                          02450000
*             /* SCHRL CONSTANTS */                                     02500000
* DECLARE                                                               02550000
*  SCHRLIDC CHAR(8)CONSTANT('IGDSCHRL'),/* SCHRL ID                  */ 02600000
*  SCHRLVC  FIXED(15) CONSTANT(0),  /* SCHRL VERSION                 */ 02650000
*             /* CONSTANTS TO SET SCHRLTYP */                           02700000
*  SCHRLVOL BIT(8) CONSTANT('00000001'B),/* RESOURCE IS VOLUME       */ 02750000
*  SCHRLSG  BIT(8) CONSTANT('00000010'B),/* RESOURCE IS STORAGE GROUP*/ 02800000
*             /* SCHEDULING SERVICES RESOURCE LIST */                   02850000
*  1 SCHRL    BASED BDY(WORD),      /* RESOURCE LIST                 */ 02900000
*    3 SCHRLFIX,                    /* RESOURCE LIST FIXED SECTION   */ 02944400
*      5 SCHRLHDR,                  /* RESOURCE LIST HEADER          */ 02988800
*        7 SCHRLID CHAR(8),         /* RESOURCE LIST ID IS 'IGDSCHRL'*/ 03033200
*        7 SCHRLLEN FIXED(15),      /* RESOURCE LIST LENGTH          */ 03077600
*        7 SCHRLVER FIXED(15),      /* RESOURCE LIST VERSION IS '0'  */ 03122000
*      5 SCHRLPLP PTR(31),          /* PTR. TO PROCESSOR RESOURCES   */ 03166400
*      5 SCHRLTLN FIXED(15),        /* LENGTH OF RL + PL(S) + RE(S)  */ 03210800
*      5 SCHRLNUM FIXED(15),        /* NUMBER OF RESOURCES IN ARRAY  */ 03255200
*    3 SCHRLRES(*),                 /* RESOURCE ARRAY                */ 03300000
*      5 SCHRLFLG  BIT(16),         /* RESOURCE FLAG                 */ 03350000
*        7 SCHRLTYP  BIT(8),        /* RESOURCE TYPE                 */ 03400000
*        7 *         BIT(8),        /* RESERVED                      */ 03450000
*      5 SCHRLNML  FIXED(15),       /* RESOURCE NAME LENGTH          */ 03500000
*      5 SCHRLNM   CHAR(30),        /* RESOURCE NAME                 */ 03550000
*@SPACE (1);                                                            03600000
*             /* SCHPL CONSTANTS */                                     03650000
*  SCHPLIDC CHAR(8)CONSTANT('IGDSCHPL'), /* SCHPL ID                 */ 03750000
*  SCHPLVC  FIXED(15) CONSTANT(0),  /* SCHPL VERSION                 */ 03800000
*           /* PROCESSOR RESOURCE LIST */                               03850000
*  1 SCHPL   BASED BDY(WORD),       /* PROCESSOR RESOURCE LIST       */ 03900000
*    3 SCHPLHDR,                    /* HEADER                        */ 03950000
*      5 SCHPLID   CHAR(8),         /* ID IS 'IGDSCHPL'              */ 04000000
*      5 SCHPLLEN  FIXED(15),       /* LENGTH                        */ 04050000
*      5 SCHPLVER  FIXED(15),       /* VERSION IS '0'                */ 04100000
*    3 SCHPLPNM  CHAR(8),           /* PROCESSOR NAME                */ 04150000
*    3 SCHPLNPL  PTR(31),           /* PTR TO NEXT SCHPL             */ 04200000
*    3 SCHPLPRE  PTR(31),           /* PTR TO RESOURCE ELEMENTS      */ 04250000
*    3 *         CHAR(0) BDY(WORD), /* ALIGN END OF SCHPL ON WORD BDY*/ 04275000
*@SPACE (1);                                                            04300000
*             /* SCHRE CONSTANTS */                                     04350000
*  SCHREIDC CHAR(8)CONSTANT('IGDSCHRE'), /* SCHRE ID                 */ 04450000
*  SCHREVC  FIXED(15) CONSTANT(0),  /* SCHRE VERSION                 */ 04500000
*            /* CONSTANTS TO SET SCHRETYP */                            04550000
*  SCHREONE BIT(2) CONSTANT('00'B), /* SINGLE RESOURCE            */    04600000
*  SCHREFST BIT(2) CONSTANT('01'B), /* FIRST RESOURCE IN LIST      */   04650000
*  SCHREMID BIT(2) CONSTANT('10'B), /* MIDDLE RESOURCE IN LIST    */    04700000
*  SCHRELST BIT(2) CONSTANT('11'B), /* LAST RESOURCE IN LIST        */  04750000
*            /* RESOURCE ELEMENT */                                     04800000
*  1 SCHRE    BASED BDY(WORD),      /* REQUIRED RESOURCES ELEMENT    */ 04850000
*    3 SCHREHDR,                    /* HEADER                        */ 04900000
*      5 SCHREID   CHAR(8),         /* ID IS 'IGDSCHRE'              */ 04950000
*      5 SCHRELEN  FIXED(15),       /* LENGTH                        */ 05000000
*      5 SCHREVER  FIXED(15),       /* VERSION IS '0'                */ 05050000
*    3 SCHRENRE  PTR(31),           /* PTR. TO NEXT SCHRE            */ 05100000
*    3 SCHREFLG  BIT(8),            /* RESOURCE FLAG                 */ 05150000
*      5 SCHRETYP  BIT(2),          /* RESOURCE LIST TYPE            */ 05200000
*      5 *         BIT(5),          /* RESERVED                  @01C*/ 05233300
*      5 SCHREOFL  BIT(1),          /* VOLUME(S) NOT MVS ONLINE  @01A*/ 05266600
*    3 SCHREST   FIXED(8),          /* MINIMUM STATUS REQUIRED       */ 05300000
*      5 SCHREENA  BIT(1),          /* ENABLED                       */ 05350000
*      5 SCHREQNW  BIT(1),          /* QUIESCE FOR NEW ALLOCATIONS   */ 05450000
*      5 SCHREDNW  BIT(1),          /* DISABLE FOR NEW ALLOCATIONS   */ 05475000
*      5 SCHREQSC  BIT(1),          /* QUIESCE ALL                   */ 05493700
*      5 SCHREDIS  BIT(1),          /* DISABLE ALL                   */ 05512400
*      5 *         BIT(2),          /* RESERVED                      */ 05526200
*      5 SCHREVOL  BIT(1),          /* ONE VOLUME TO BECOME AVAILABLE*/ 05540000
*    3 SCHREIDX  FIXED(15),         /* INDEX INTO RESOURCE NAME ARRAY*/ 05554000
*    3 *         CHAR(0) BDY(WORD); /* ALIGN END OF SCHRE ON WORD BDY*/ 05576900
* %GOTO P02SCHRL; /*                                                    05600000
.A0SCHRL ANOP                                                           05650000
IGDSCHRL DSECT ,                                                        05700000
*********************************************************************** 05750000
* ASSEMBLER OUTPUT GENERATED BY PLASMAP TO ASSEMBLER CONVERSION       * 05800000
* 02 OCT 1986 11:23:42                                                * 05850000
*********************************************************************** 05900000
SCHRL    DS    0F                       RESOURCE LIST                   05950000
SCHRLFIX DS    CL20                     RESOURCE LIST FIXED SECTION     05966600
         ORG   SCHRL+0                                                  05983200
SCHRLHDR DS    CL12                     RESOURCE LIST HEADER            06000000
         ORG   SCHRL+0                                                  06050000
SCHRLID  DS    CL8                      RESOURCE LIST ID IS 'IGDSCHRL'  06100000
SCHRLLEN DS    H                        RESOURCE LIST LENGTH            06150000
SCHRLVER DS    H                        RESOURCE LIST VERSION IS '0'    06200000
SCHRLPLP DS    A                        PTR. TO PROCESSOR RESOURCES     06250000
SCHRLTLN DS    H                        LENGTH OF RL + PL(S) + RE(S)    06300000
SCHRLNUM DS    H                        NUMBER OF RESOURCES IN ARRAY    06350000
SCHRLRES DS    CL34      DIMENSION=(*)  RESOURCE ARRAY                  06400000
         ORG   SCHRL+20                                                 06450000
SCHRLFLG DS    XL2                      RESOURCE FLAG                   06500000
         ORG   SCHRL+20                                                 06600000
SCHRLTYP DS    XL1                      RESOURCE TYPE                   06625000
         DS    XL1                      RESERVED                        06650000
SCHRLNML DS    H                        RESOURCE NAME LENGTH            06750000
SCHRLNM  DS    CL30                     RESOURCE NAME                   06800000
*                                                                       06850000
         DS    0F                                                       06875000
SCHPL    DS    0CL28                    PROCESSOR RESOURCE LIST         06900000
SCHPLHDR DS    CL12                     HEADER                          06950000
         ORG   SCHPL+0                                                  07000000
SCHPLID  DS    CL8                      ID IS 'IGDSCHPL'                07050000
SCHPLLEN DS    H                        LENGTH                          07100000
SCHPLVER DS    H                        VERSION IS '0'                  07150000
SCHPLPNM DS    CL8                      PROCESSOR NAME                  07200000
SCHPLNPL DS    A                        PTR TO NEXT SCHPL               07250000
SCHPLPRE DS    A                        PTR TO RESOURCE ELEMENTS        07300000
         DS    0F                       ALIGN END OF SCHPL ON WORD BDY  07325000
*                                                                       07350000
         DS    0F                                                       07375000
SCHRE    DS    0CL20                    REQUIRED RESOURCES ELEMENT      07400000
SCHREHDR DS    CL12                     HEADER                          07450000
         ORG   SCHRE+0                                                  07500000
SCHREID  DS    CL8                      ID IS 'IGDSCHRE'                07550000
SCHRELEN DS    H                        LENGTH                          07600000
SCHREVER DS    H                        VERSION IS '0'                  07650000
SCHRENRE DS    A                        PTR. TO NEXT SCHRE              07700000
SCHREFLG DS    XL1                      RESOURCE LIST FLAG              07750000
SCHRETYP EQU   B'11000000'              RESOURCE LIST TYPE              07800000
SCHREOFL EQU   B'00000001'              VOLUME(S) NOT MVS ONLINE  @01A  07825000
SCHREST  DS    XL1                      MINIMUM STATUS REQUIRED         07850000
SCHREENA EQU   B'10000000'              ENABLED                         07900000
SCHREQNW EQU   B'01000000'              QUIESCE FOR NEW ALLOCATIONS     07950000
SCHREDNW EQU   B'00100000'              DISABLE FOR NEW ALLOCATIONS     08000000
SCHREQSC EQU   B'00010000'              QUIESCE ALL               @01A  08008300
SCHREDIS EQU   B'00001000'              DISABLE ALL               @01A  08016600
SCHREVOL EQU   B'00000001'              ONE VOLUME TO BECOME AVAILABLE  08025000
SCHREIDX DS    H                        INDEX INTO RESOURCE NAME ARRAY  08050000
         DS    0F                       ALIGN END OF SCHRE ON WORD BDY  08075000
SCHRLIDC DC    C'IGDSCHRL'              SCHRL ID                        08100000
SCHRLVC  EQU   0                        SCHRL VERSION                   08150000
*********************************************************************** 08200000
*        CONSTANTS TO SET SCHRLTYP                                    * 08250000
*********************************************************************** 08300000
SCHRLVOL EQU   B'00000001'              RESOURCE IS VOLUME              08350000
SCHRLSG  EQU   B'00000010'              RESOURCE IS STORAGE GROUP       08400000
SCHPLIDC DC    C'IGDSCHPL'              SCHPL ID                        08450000
SCHPLVC  EQU   0                        SCHPL VERSION                   08500000
SCHREIDC DC    C'IGDSCHRE'              SCHRE ID                        08550000
SCHREVC  EQU   0                        SCHRE VERSION                   08600000
*********************************************************************** 08650000
*        CONSTANTS TO SET SCHRETYP                                    * 08700000
*********************************************************************** 08750000
SCHREONE EQU   B'00000000'              SINGLE RESOURCE                 08800000
SCHREFST EQU   B'01000000'              FIRST RESOURCE IN LIST          08850000
SCHREMID EQU   B'10000000'              MIDDLE RESOURCE IN LIST         08900000
SCHRELST EQU   B'11000000'              LAST RESOURCE IN LIST           08950000
*                                                                       09000000
          MEND                                                          09033300
*              */                                                       09066600
* %P02SCHRL: ;                                                          09100000
