         MACRO                                                          02000000
&NAME    IGGBISAM &OPTCD=                                               04000000
         GBLB   &CPOPS                                                  06000000
         GBLC  &LIB                                                     06000800
*********************************************************************** 06001402
*                                                                       06002002
* $MAC(IGGBISAM):                                                       06002600
*                                                                       06003202
*    01/05/73          LEVEL=01                                         06003802
*                                                                       06004402
*********************************************************************** 06004500
*                                                                     * 06005000
*PROPRIETARY V3 STATEMENT                                             * 06005100
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 06005200
*"RESTRICTED MATERIALS OF IBM"                                        * 06005300
*5695-DF1                                                             * 06005400
*(C) COPYRIGHT 1982  IBM CORP.                                        * 06005500
*END PROPRIETARY V3 STATEMENT                                         * 06005600
*                                                                     * 06005800
*********************************************************************** 06005900
*                                                                       06006000
*STATUS: MVS/XA DFP RELEASE 1                                           06006100
*                                                                       06006200
*  CHANGE ACTIVITY:                                                     06006300
*                                                                       06006802
* $L1=CKPT21,HDP1102,,STLJAK: SUPPORT FOR MVS/XA                        06007402
*                                                                       06008002
*********************************************************************** 06009202
         AIF    (&CPOPS).NOCPOPS                                        06010000
&CPOPS   SETB   1                                                       06020000
         IGGCPOPS                                                       06030000
.NOCPOPS ANOP                                                           06040000
&NAME    DSECT                                                          06050000
DCWFCP4  DS    A                        ADDRESS FIRST AVAILABLE CP4-5-6 08000000
DCWFCP7  DS    A                        ADDRESS FIRST AVAILABLE CP7     10000000
DCWNUCPS DS    CL1                      NO. UNSCHED IOBS FOR HI LVL IX  12000000
DCWNUCP4 DS    CL1                      NO. UNSCHED IOBS FOR CP4-5-6    14000000
DCWNUCP7 DS    CL1                      NO. UNSCHED IOBS FOR CP7        16000000
DCWNLSD  DS    CL1                      NO.HI LVL INDEXES SRCHED ON DEV 18000000
DCWFIOBU DS    A                        A(FIRST UNSCHED IOB)            20000000
DCWLIOBU DS    A                        A(LAST UNSCHED IOB)             22000000
DCWFUPDI DS    A                        A(FIRST IOB ON UPDATE Q)        24000000
DCWLUPDI DS    A                        A(LAST IOB ON UPDATE Q)         26000000
DCWHIAV  DS    CL1                      B0 ON MEANS HI LVL IND CP AVAIL 28000000
*                                       B1 ON MEANS HI LVL IND IN CORE  30000000
DCWWKNI  DS    CL1                      BO ON MEANS WRITE KN IN PROCESS 32000000
*                                       B1 FIRST TIME SWITCH            34000000
*                                       B2 SAME MODULE SWITCH           36000000
*                                       B3 ADD TO END USE - CP11,13     38000000
*                                       B4 END BECAUSE OF EOF - CP12,13 40000000
*                                       B5 CP11 - 1ST USE BY GIVEN WKN  42000000
*                                                                       44000000
DCWNLEVC DS    CL1                      COUNTER USED BY WRITE KN APP    46000000
DCWNUWKN DS    CL1                      NO. OF IOBS AWAITING W KN CP    48000000
DCWMSHIL DS    A                        LAST ACTIVE ENTRY HI IND W KN   50000000
DCWHIRPS DS    CL1                      DCBHIRPD OR DCBHIRSH            52000000
DCWNACT  DS    CL1                      NO. NON-W KN MACROS BEFORE W KN 54000000
DCWSIZE  DS    CL2                      SIZE OF DCB WA+ CP'S+ WKN WA    56000000
DCWOPCLS DS    CL8                      DATA SAVED BY COMMON OPEN       58000000
DCWFIOBE DS    0CL4                                                     60000000
DCWERRCT DS    1C                       NO. OF SLOTS ON ERROR Q         62000000
         DS    3C                       A(FIRST IOB ON ERRORQ)          64000000
DCWLIOBE DS    A                        A(LAST IOB ON ERROR Q)          66000000
DCWSIOA  DS    A                        SECOND SIO APPENDAGE (RPS ONLY) 68000000
DCWDCBFA DS    F                        DCB FIELD AREA PTR              70000000
DCWDSSHR EQU   X'80'              HIGH BIT OF DCWDCBFA INDICATES       *70050002
                                  THIS IS A SHARED DATA SET        @L1A 70100000
DCWSTARP DS    3F                       TRKCALC PARM LIST      @ZA41357 74000000
DCWSHPTR DS    A                       ADDRESS OF LIST OF      @ZA41357 74050000
*                                      SECTORS FOR SHARED      @ZA41357 74100000
*                                      TRACK.                  @ZA41357 74150000
DCWLEN   EQU   *-&NAME                 LENGTH OF W.A. IN BYTES          74200000
         MEND                                                           74250000
