*********************************************************************** 00050000
*                                                                     * 00200000
*PROPRIETARY V3 STATEMENT                                             * 00250000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00300000
*"RESTRICTED MATERIALS OF IBM"                                        * 00350000
*5695-DF1                                                             * 00400000
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00450000
*END PROPRIETARY V3 STATEMENT                                         * 00500000
*                                                                     * 00600000
*********************************************************************** 00650000
         MACRO                                                          06000000
         IGGCP10B &OPTCD=                                               12000000
.*          RELEASE 23 DELETIONS/CHANGES                                12010000
.*          RELEASE 22 DELETIONS/CHANGES                                12020000
.*          RELEASE 21 DELETIONS/CHANGES                                12030000
* CP10B  WRITES EOF MARK                                                18000000
CB52     CCW   SIDEQ,0,CC,5              SEARCH FOR LAST DATA REC       24000000
CB53     CCW   TIC,CB52-CB1,0,0                                         30000000
         AIF   ('&OPTCD' NE 'W').SWC                                    30010000
CB54     CCW   WCKD,CB55-CB1,CC,8       WRITE EOF MARK                  30020000
         AGO   .TWC                                                     30030000
.SWC     ANOP                                                           30040000
CB54      CCW   WCKD,CB55-CB1,0,8       WRITE EOF MARK                  36000000
.TWC     ANOP                                                           36001000
SZ10B    EQU   (CB54+8-CB52)+8       SIZE OF COMMON                     36010000
         AIF   ('&OPTCD' NE 'W').CCHH                                   42000000
* 10BW   WRITE VALIDITY CHECK                                           48000000
CB540    CCW   NOP,0,CC+SILI,1                                          54000000
CB54A    CCW   SIDEQ,0,CC,5              SEARCH FOR EOF MARK            60000000
CB54B    CCW   TIC,CB54A-CB1,0,0                                        66000000
CB54C    CCW   RCKD,0,SKIP,8            READ IT BACK                    72000000
LCB54C   EQU   CB54C+8-CB540                                            72010000
SZ10BW   EQU   LCB54C+SZ10B                                             72020000
.CCHH    ANOP                                                           78000000
CB55     DC    2F'00'                   C C H R R 0 0 0                 84000000
         MEND                                                           90000000
