*********************************************************************** 00001400
*                                                                     * 00005600
*PROPRIETARY V3 STATEMENT                                             * 00007000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00008400
*"RESTRICTED MATERIALS OF IBM"                                        * 00009800
*5695-DF1                                                             * 00011200
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00012600
*END PROPRIETARY V3 STATEMENT                                         * 00014700
*                                                                     * 00016800
*********************************************************************** 00018200
         MACRO                                                          00020000
         IGGCP24                                                        00030000
.*         RELEASE 22 DELETIONS/CHANGES                                 00040000
.*         RELEASE 21 DELETIONS/CHANGES                                 00050000
.*         RELEASE 20 DELETIONS/CHANGES                                 00060000
*                                  **** CHANNEL PROGRAM 24 ****         00070000
W1CN8    DS    0D                                                       00080000
CN8      CCW   SIDEQ,0,CC,5             FIND NEXT INDEX ENTRY           00090000
W1CN9    DS    0D                                                       00100000
CN9      CCW   TIC,0,0,0                                                00110000
W1CN10   DS    0D                                                       00120000
CN10     CCW   RDATA,0,CC,10            READ CURRENT ENTRY              00130000
W1CN11   DS    0D                                                       00140000
CN11     CCW   RDATA+MT,0,CC,10         READ CURRENT OVERFLOW ENTRY     00150000
W1CN12   DS    0D                                                       00160000
CN12     CCW   RDCNT+MT,0,CC,8          READ NEXT ENTRY                 00170000
W1CN13   DS    0D                                                       00180000
CN13     CCW   RDATA,0,CC,10            READ DATA NEXT ENTRY            00190000
W1CN14   DS    0D                                                       00200000
CN14     CCW   SEEKHH,0,CC,6            SEEK TO NEXT TRACK              00210000
W1CN14A  DS    0D                                                       00220000
CN14A    CCW   NOP,CN14A+5-CN8,CC+SILI,1  SET SECTOR IF RPS             00230000
W1CN15   DS    0D                                                       00240000
CN15     CCW   TIC,0,0,0         TRANSFER TO READ OR WRITE THE RECORD   00250000
CP24LEN  EQU   CN15+8-CN8                                               00260000
         MEND                                                           00270000
