*********************************************************************** 00050000
*                                                                     * 00200000
*PROPRIETARY V3 STATEMENT                                             * 00250000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00300000
*"RESTRICTED MATERIALS OF IBM"                                        * 00350000
*5695-DF1                                                             * 00400000
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00450000
*END PROPRIETARY V3 STATEMENT                                         * 00500000
*                                                                     * 00600000
*********************************************************************** 00650000
         MACRO                                                          05000000
&NAME    IGGDCBFA                                                       10000000
&NAME    DSECT                                                          15000000
*    03/20/73          LEVEL=01                                         15010000
*****************************************************************       15050000
*    ISAM DCB FIELD AREA - CONTROL BLOCK FOR SHARED DATA SETS   *       15100000
*****************************************************************       15150000
DFARORG3 DS    F                        NO. ACCESSES TO OVRFLOW RCDS    15200000
*                                       OTHER THAN FIRST RCD IN CHAIN   15210000
DFANREC  DS    F                        NO. RCDS IN PRIME AREA          15250000
DFAST    DS    BL1                      DCB STATUS INDICATORS           15300000
*                                       B0 SINGLE SCHEDULE MODE         15350000
*                                       B1 KEY SEQ. TO BE CHECKED       15400000
*                                       B2 INITIAL LOAD COMPLETED       15450000
*                                       B3 RESUME LOAD ON NEW CYL       15500000
*                                       B4 RESERVED                     15550000
*                                       B5 FIRST MACRO NOT RCVD         15600000
*                                       B6 LAST BLOCK FULL              15650000
*                                       B7 LAST TRACK FULL              15700000
DFARESER DS    XL1                      RESERVED                        15750000
DFAUSE   DS    H                        NO. DCBS OPENED ON DATA SET,    15800000
*                                       TOTAL OF ASID USE COUNTS        15850000
DFANBOV  DS    H                        VLR, NO. BYTES LEFT ON          15900000
*                                       CURRENT OVRFLOW TRACK           15950000
DFANOREC DS    H                        NO. RCDS IN OVERFLOW AREA       16000000
DFALIOV  DS    XL8                      ADDR LAST IND OVRFLOW RCD       16050000
DFARORG1 DS    H                        NO. FULL CYL OVRFLOW AREAS      16100000
DFARORG2 DS    H                        NO. OF TRKS REMAINING IN        16150000
*                                       IND. OVERFLOW AREAS             16200000
DFALPDA  DS    XL8                      LAST PRIME DATA RCD ADDR        16250000
DFAID    DS    XL8                      IDENTIFIER FOR DATA SET         16300000
DFACHAIN DS    A                        ADDR OF NEXT FA IN CHAIN        16350000
DFAASID1 DS    H                        ASID OF USER                    16400000
DFAUSE1  DS    H                        USE COUNT FOR AISD1             16450000
DFAASID2 DS    H                        ASID OF USER                    16500000
DFAUSE2  DS    H                        USE COUNT FOR AISD2             16550000
DFAASID3 DS    H                        ASID OF USER                    16600000
DFAUSE3  DS    H                        USE COUNT FOR ASID3             16650000
DFAASID4 DS    H                        ASID OF USER                    16700000
DFAUSE4  DS    H                        USE COUNT FOR AISD4             16750000
DFAASIDN DS    A                        ADDR OF NEXT FAEX IN CHAIN      16800000
DFASIZE  EQU   *-DFARORG3               SIZE OF FILED AREA              16850000
         SPACE 4                                                        16900000
DCBFAEX  DSECT                                                          16950000
*****************************************************************       17000000
*    DCB FIELD AREA EXTENSION - CONTAINS USE COUNTS FOR FOUR     *      17050000
*    ADDRESS SPACES AND A POINTER TO NEXT FIELD AREA EXTENSION    *     17100000
*******************************************************************     17150000
DFAXSID1 DS    H                        ASID OF USER                    17200000
DFAUSE1X DS    H                        USE COUNT FOR XSID1             17250000
DFAXSID2 DS    H                        ASID OF USER                    17300000
DFAUSE2X DS    H                        USE COUNT FOR XSID2             17350000
DFAXSID3 DS    H                        ASID OF USER                    17400000
DFAUSE3X DS    H                        USE COUNT FOR XSID3             17450000
DFAXSID4 DS    H                        ASID OF USER                    17500000
DFAUSE4X DS    H                        USE COUNT FOR XSID4             17550000
DFAEXN   DS    A                        ADDR OF NEXT FAEX ON CHAIN      17600000
DFEXSIZE EQU   *-DCBFAEX                SIZE OF EXTENSION               17650000
         SPACE 4                                                        17700000
DFAASID  DSECT                                                          17750000
DFANXPTR EQU   4                        OFFSET TO NEXT ASID FIELD       17760000
DFANOIDS EQU   4                        NO. OF ASID'S AND USE COUNTS    17770000
*                                       IN DCBFA AND EXTENSIONS         17780000
DFAINCR  EQU   1                        INCREMENT USE COUNTS            17790000
         SPACE                                                          17792000
*******************************************************************     17800000
*    DSECT FOR SEARCHING FOR ADDRESS SPACE ID                     *     17850000
*******************************************************************     17900000
         SPACE                                                          17910000
DFAASIDX DS    H                        ADDRESS SPACE ID                17950000
DFAUSEX  DS    H                        ASID USE COUNT                  18000000
DFAPTR   DS    A                        ADDR OF DCBFA EXTENSION         18050000
         MEND                                                           18300000
