* %GOTO PLSDASC1; /*                                                    00050000
         MACRO                                                          00100000
&L       IGGDASCR &MF=D,&DSECT=YES                                      00150000
         AGO   .DASCASM                                                 00200000
*         */                                                            00250000
* %PLSDASC1: ;                                                          00300000
*/********************************************************************/ 00350000
*/*$MAC(IGGDASCR):                                                   */ 00400000
*/*                                                                  */ 00450000
*/*  MACRO NAME: IGGDASCR                                            */ 00500000
*/*                                                                  */ 00550000
*/*  DESCRIPTION: MAPS DADSM SCRATCH BRANCH ENTRY PARAMETER LIST     */ 00600000
*/*                                                                  */ 00650000
*/*  STATUS: DFSMS/MVS 1.5.0                                         */ 00700000
*/*                                                                  */ 00750000
*/*PROPRIETARY V3 STATEMENT                                          */ 00800000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00850000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00900000
*/*5695-DF1                                                          */ 00950000
*/*(C) COPYRIGHT 1989,1993  IBM CORP.                                */ 01000000
*/*END PROPRIETARY V3 STATEMENT                                      */ 01050000
*/*                                                                  */ 01100000
*/*  FUNCTION: THIS MACRO PROVIDES AN INTERFACE TO THE DADSM         */ 01150000
*/*    SCRATCH BRANCH ENTRY. IT PROVIDES AN ASSEMBLER (MF=D) AND     */ 01200000
*/*    PLS (%INCLUDE) MAPPING OF THE BRANCH ENTRY PARAMETER LIST.    */ 01250000
*/*                                                                  */ 01350000
*/*  NOTES:                                                          */ 01400000
*/*                                                                  */ 01450000
*/*    DEPENDENCIES: NONE                                            */ 01500000
*/*    RESTRICTIONS: NONE                                            */ 01550000
*/*                                                                  */ 01600000
*/*  MACRO:                                                          */ 01650000
*/*                                                                  */ 01700000
*/*    PROCESSOR: PL/AS, PLS/3, OR ASSEMBLER H                       */ 01750000
*/*    MACRO SIZE: 500                                               */ 01800000
*/*    DISTRIBUTION LIBRARY: AMODGEN                                 */ 01850000
*/*    ATTRIBUTES: INCLUDE, MF=D                                     */ 01900000
*/*                                                                  */ 01950000
*/*  ENTRY POINT: IGGDASCR                                           */ 02000000
*/*                                                                  */ 02050000
*/*    PURPOSE: MAPS DADSM SCRATCH BRANCH ENTRY PARAMETER LIST       */ 02100000
*/*    LINKAGE: %INCLUDE SYSLIB(IGGDASCR) OR IGGDASCR MF=D           */ 02150000
*/*    INPUT:                                                        */ 02200000
*/*      SYMBOLIC NAME: PL/AS OR PLS/3                               */ 02250000
*/*        DESCRIPTION: PROVIDES A MAPPING FOR MODULES               */ 02300000
*/*        WRITTEN IN PLS.                                           */ 02350000
*/*                                                                  */ 02400000
*/*        IN THE FOLLOWING EXAMPLES, COLONS HAVE BEEN USED IN       */ 02450000
*/*        PLACE OF SEMICOLONS TO AVOID COMPILER MESSAGES.           */ 02500000
*/*                                                                  */ 02550000
*/*        ALL SECTIONS MAY BE INCLUDED BY SPECIFYING:               */ 02600000
*/*                                                                  */ 02650000
*/*           DCL DASCRPTR PTR(31):                                  */ 02700000
*/*           %INCLUDE SYSLIB(IGGDASCR):                             */ 02750000
*/*                OR                                                */ 02758300
*/*           DCL DASCRPTR PTR(31):                                  */ 02766600
*/*           %DCL DAS_PL CHAR:                                      */ 02774900
*/*           %DAS_PL = '':                                          */ 02783200
*/*           %INCLUDE SYSLIB(IGGDASCR):                             */ 02791500
*/*                                                                  */ 02800000
*/*        THE DASCRPTR PLS VARIABLE IS USED AS THE BASE ADDRESS     */ 02850000
*/*        FOR THE DADSM SCRATCH BRANCH ENTRY PARAMETER LIST.        */ 02900000
*/*        IT NEED NOT BE DECLARED IF THE PARAMETER LIST IS NOT      */ 02950000
*/*        TO BE INCLUDED OR BASED.                                  */ 03000000
*/*                                                                  */ 03050000
*/*        THE FOLLOWING FEATURES ARE PROVIDED BY THE MACRO:         */ 03100000
*/*        %DAS_BASE   = 'N' OR 'NO', CAUSES THE MACRO TO GENERATE   */ 03150000
*/*                    THE PARAMETER LIST WITHOUT THE 'BASED'        */ 03200000
*/*                    ATTRIBUTE.                                    */ 03250000
*/*                                                                  */ 03300000
*/*        TO ONLY INCLUDE THE DESIRED INDIVIDUAL SECTIONS THE       */ 03308300
*/*        FOLLOWING COMPILE VARIABLES HAVE TO BE SPECIFIED BEFORE   */ 03316600
*/*        INCLUDING IGGDASCR:                                       */ 03324900
*/*        %DAS_PL     DADSM SCRATCH BRANCH ENTRY PARAMETER LIST.    */ 03333200
*/*                    IF %DAS_PL IS NOT SPECIFIED OR IF IT IS SET   */ 03341500
*/*                    TO '' (NULL), THE PARAMETER LIST WILL BE      */ 03349800
*/*                    INCLUDED (THIS IS THE DEFAULT).  IF THE       */ 03358100
*/*                    PARAMETER LIST AS WELL AS THE RETURN CODES    */ 03366400
*/*                    CODES, THE SUBFUNCTION CODES, AND THE STATUS  */ 03374700
*/*                    CODES ARE DESIRED, SPECIFY:                   */ 03383000
*/*                       %DAS_PL='Y'                                */ 03391300
*/*                       %DAS_RC='Y'                                */ 03399600
*/*                       %DAS_SF='Y'                                */ 03407900
*/*                       %DAS_ST='Y'                                */ 03416200
*/*                    IF ONLY ONE OR ALL OF THE RETURN CODES,       */ 03424500
*/*                    SUBFUNCTION CODES, OR STATUS CODES SECTIONS   */ 03432800
*/*                    ARE DESIRED, SET %DAS_PL TO 'N' OR 'NO'.      */ 03441100
*/*        %DAS_RC     RETURN CODES (HISTORIC RETURN CODES, ERROR    */ 03449400
*/*                    CODES)                                        */ 03457700
*/*        %DAS_SF     SUBFUNCTION CODES (SUBFUNCTION ID'S,          */ 03466000
*/*                    SUBFUNCTION REASON CODES)                     */ 03474300
*/*        %DAS_ST     SCRATCH STATUS CODES AND SCRATCH SECONDARY@01C*/ 03482600
*/*                    CODES SET IN THE VOLUME LIST              @01C*/ 03490900
*/*                                                                  */ 03500000
*/*        TO CONTROL THE APPEARANCE OF THE DESIRED INDIVIDUAL       */ 03508300
*/*        SECTIONS IN THE COMPILE LISTING, THE COMPILE              */ 03516600
*/*        VARIABLE WHICH WILL CAUSE THAT SECTION TO BE INCLUDED     */ 03524900
*/*        MUST HAVE BEEN SPECIFIED.  THEN THE FOLLOWING LIST CONTROL*/ 03533200
*/*        COMPILE VARIABLES HAVE TO BE SPECIFIED BEFORE             */ 03541500
*/*        INCLUDING IGGDASCR:                                       */ 03549800
*/*        %DAS_PLL    DADSM SCRATCH BRANCH ENTRY PARAMETER LIST     */ 03558100
*/*                    LISTING CONTROL VARIABLE.  IF %DAS_PLL IS     */ 03566400
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 03574700
*/*                    THE PARAMETER LIST WILL APPEAR IN THE         */ 03583000
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 03591300
*/*                                                                  */ 03600000
*/*                    SET %DAS_PLL TO 'N' OR 'NO' IF THE PARAMETER  */ 03633300
*/*                    LIST IS NOT TO APPEAR IN THE COMPILE LISTING. */ 03666600
*/*                                                                  */ 03700000
*/*        %DAS_RCL    RETURN CODES (HISTORIC RETURN/ERROR CODES)    */ 03716600
*/*                    LISTING CONTROL VARIABLE.  IF %DAS_RCL IS     */ 03733200
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 03749800
*/*                    THE RETURN CODES WILL APPEAR IN THE           */ 03766400
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 03783000
*/*                                                                  */ 03800000
*/*                    SET %DAS_RCL TO 'N' OR 'NO' IF THE RETURN     */ 03812500
*/*                    CODES ARE NOT TO APPEAR IN THE COMPILE        */ 03825000
*/*                    LISTING.                                      */ 03837500
*/*                                                                  */ 03850000
*/*        %DAS_SFL    SUBFUNCTION ID'S AND SUBFUNCTION REASON CODES */ 03900000
*/*                    LISTING CONTROL VARIABLE.  IF %DAS_SFL IS     */ 03950000
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 04000000
*/*                    THE SUBFUNCTION CODES WILL APPEAR IN THE      */ 04050000
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 04100000
*/*                                                                  */ 04150000
*/*                    SET %DAS_SFL TO 'N' OR 'NO' IF THE SUBFUNCTION*/ 04200000
*/*                    CODES ARE NOT TO APPEAR IN THE COMPILE        */ 04250000
*/*                    LISTING.                                      */ 04300000
*/*                                                                  */ 04400000
*/*        %DAS_STL    SCRATCH STATUS CODES LISTING CONTROL          */ 04400700
*/*                    VARIABLE.  IF %DAS_STL IS NOT SPECIFIED OR    */ 04401400
*/*                    IF IT IS SET TO '' (NULL) THE SCRATCH STATUS  */ 04402100
*/*                    CODES WILL APPEAR IN THE COMPILE LISTING      */ 04402800
*/*                    (THIS IS THE DEFAULT).                        */ 04403500
*/*                                                                  */ 04404200
*/*                    SET %DAS_STL TO 'N' OR 'NO' IF THE SCRATCH    */ 04404900
*/*                    STATUS CODES ARE NOT TO APPEAR IN THE COMPILE */ 04405600
*/*                    LISTING.                                      */ 04406300
*/*                                                                  */ 04407000
*/*        AN EXAMPLE FOLLOWS:                                       */ 04407700
*/*                                                                  */ 04408400
*/*        1.  INCLUDE PARAMETER LIST AND SUBFUNCTION CODES SECTION. */ 04409100
*/*            ONLY THE PARAMETER LIST WILL APPEAR IN THE COMPILE    */ 04409800
*/*            LISTING.                                              */ 04410500
*/*                                                                  */ 04411200
*/*            NOTE:  THE PARAMETER LIST HAS TO BE EXPLICITLY        */ 04411900
*/*            INCLUDED OTHERWISE ALL SECTIONS WILL BE               */ 04412600
*/*            INCLUDED (DEFAULT IS TO INCLUDE ALL SECTIONS IF       */ 04413300
*/*            %DAS_PL IS NOT SPECIFIED OR IS SET TO '' (NULL)).     */ 04414000
*/*                                                                  */ 04414700
*/*                     %DCL DAS_PL CHAR:                            */ 04415400
*/*                     %DAS_PL = 'Y':                               */ 04416100
*/*                     %DCL DAS_SF CHAR:                            */ 04416800
*/*                     %DAS_SF = 'Y':                               */ 04417500
*/*                     %DCL DAS_SFL CHAR:                           */ 04418200
*/*                     %DAS_SFL = 'N':                              */ 04418900
*/*                     %INCLUDE SYSLIB(IGGDASCR):                   */ 04419600
*/*                                                                  */ 04420300
*/*      SYMBOLIC NAME: ASSEMBLER H                                  */ 04421000
*/*        DESCRIPTION: PROVIDES A MAPPING FOR MODULES               */ 04421700
*/*        WRITTEN IN ASSEMBLER H.                                   */ 04422400
*/*                                                                  */ 04423100
*/*        BOTH SECTIONS MAY BE GENERATED BY SPECIFYING:             */ 04423800
*/*                                                                  */ 04424500
*/*           <LABEL> IGGDASCR MF=D                                  */ 04425200
*/*                                                                  */ 04425900
*/*        THE FOLLOWING FEATURES ARE PROVIDED BY THIS MACRO:        */ 04426600
*/*        DSECT   =YES, THE MACRO WILL GENERATE A 'DSECT'           */ 04427300
*/*                STATEMENT AT THE START OF THE SECTION TO BE       */ 04428000
*/*                MAPPED.  (THIS IS THE DEFAULT)                    */ 04428700
*/*                =NO, THE MACRO WILL NOT GENERATE A 'DSECT'        */ 04429400
*/*                STATEMENT.                                        */ 04430100
*/*                                                                  */ 04430800
*/*        TO ONLY GENERATE THE DESIRED INDIVIDUAL SECTIONS, THE     */ 04431500
*/*        MF KEYWORD SHOULD BE SET TO THE FOLLOWING:                */ 04432200
*/*        MF=(D,PL)      DADSM SCRATCH BRANCH ENTRY PARAMETER LIST. */ 04432900
*/*        MF=(D,RC)      DADSM SCRATCH HISTORIC RETURN CODES AND    */ 04433600
*/*                       ERROR CODES                                */ 04434300
*/*        MF=(D,SF)      DADSM SCRATCH SUBFUNCTION ID'S AND         */ 04435000
*/*                       SUBFUNCTION REASON CODES                   */ 04435700
*/*        MF=(D,ST)      DADSM SCRATCH STATUS CODES AND DADSM   @01C*/ 04436200
*/*                       SCRATCH SECONDARY STATUS CODES SET IN  @01C*/ 04436700
*/*                       THE VOLUME LIST ENTRIES                @01C*/ 04437200
*/*                                                                  */ 04437800
*/*        AN EXAMPLE FOLLOWS:                                       */ 04438500
*/*                                                                  */ 04439200
*/*                                                                  */ 04439900
*/*        1.  INCLUDE PARAMETER LIST AND SCRATCH STATUS CODES       */ 04440600
*/*                                                                  */ 04441300
*/*                   <LABEL1> IGGDASCR MF=(D,PL)                    */ 04442000
*/*                   <LABEL2> IGGDASCR MF=(D,ST)                    */ 04442700
*/*                                                                  */ 04443400
*/*    OUTPUT:                                                       */ 04444100
*/*        NONE.                                                     */ 04444800
*/*                                                                  */ 04445500
*/*  EXIT NORMAL:                                                    */ 04450000
*/*                                                                  */ 04500000
*/*    RETURN CODE: NONE                                             */ 04550000
*/*                                                                  */ 04600000
*/*  EXIT ERRORS:                                                    */ 04650000
*/*                                                                  */ 04700000
*/*      NONE                                                        */ 04750000
*/*                                                                  */ 04800000
*/*  EXTERNAL REFERENCES:                                            */ 04850000
*/*                                                                  */ 04900000
*/*                NONE                                              */ 04950000
*/*                                                                  */ 05000000
*/*  NOTES ON DIAGNOSTIC SUBFUNCTION INFORMATION:                    */ 05003400
*/*                                                                  */ 05006800
*/*  1.FOR THE FOLLOWING RACF SUBFUNCTION ID'S, FIELD DASSFRET       */ 05010200
*/*    WILL CONTAIN THE RACF RETURN CODE AND FIELD DASSFREA WILL     */ 05013600
*/*    CONTAIN THE RACF REASON CODE.                                 */ 05017000
*/*                                                                  */ 05020400
*/*      12, 13, 36, 37, 38                                          */ 05023800
*/*                                                                  */ 05027200
*/*  2.FOR THE FOLLOWING CVAF SUBFUNCTION ID'S, FIELD DASSFRET       */ 05030600
*/*    WILL CONTAIN THE CVAF RETURN CODE AND FIELD DASSFREA WILL     */ 05034000
*/*    CONTAIN THE CVAF STATUS CODE (FROM CVSTAT):                   */ 05037400
*/*                                                                  */ 05040800
*/*      0D, 0E, 0F, 10, 15, 16, 19, 1A, 1B, 1C, 1D, 2A,             */ 05044200
*/*      2B, 2C, 2D, 2E, 2F, 30, 31, 32, 33, 34, 35, 3A,             */ 05047600
*/*      3C                                                          */ 05051000
*/*                                                                  */ 05054400
*/*  3.FOR THE FOLLOWING I/O SUBFUNCTION ID'S, IF AN I/O ERROR       */ 05057800
*/*    OCCURS FIELDS DASSFRET AND DASSFREA WILL CONTAIN ONE OF THE   */ 05061200
*/*    FOLLOWING:                                                    */ 05064600
*/*      - THE ECB COMPLETION CODE AND THE CSW CHANNEL STATUS, IF    */ 05068000
*/*        THE ECB COMPLETION CODE DOES NOT INDICATE PERMANENT       */ 05071400
*/*        ERROR (X'41'), OR THE ECB COMPLETION CODE DOES INDICATE   */ 05074800
*/*        PERMANENT ERROR BUT THE CSW CHANNEL STATUS IS NOT         */ 05078200
*/*        ZERO.                                                     */ 05081600
*/*      - THE SENSE BYTES FROM THE IOB, IF THE ECB COMPLETION       */ 05085000
*/*        CODE INDICATES PERMANENT ERROR (X'41') AND THE CSW        */ 05088400
*/*        CHANNEL STATUS IS ZERO.                                   */ 05091800
*/*                                                                  */ 05095200
*/*      14, 17, 1E, 1F, 20, 21, 22, 23, 24, 25, 26, 39              */ 05098600
*/*                                                                  */ 05102000
*/*                                                                  */ 05105400
*/*  CHANGE ACTIVITY:                                                */ 05108800
*/*$P2=KCS0049,HDP2230,T86274,STLKAA: FIX 0C4 USING R0=ADDR(UCB) @P2A*/ 05110500
*/*$L0=MVS/XA,HDP3310,T86251,STLKAA: DADSM SUPPORT FOR THE STORAGE   */ 05112200
*/*                                  MANAGEMENT SUBSYSTEM (SMS)      */ 05116600
*/*$P1=KJA0457,HDP3310,T86273,STLKAA: NEW INSTALLATION REPLACEABLE   */ 05127700
*/*                                   MODULES                    @P1A*/ 05138800
*/*$P3=KJA0805,HDP3310,T86324,STLKAA: GDG ROLLOFF AND EXPIRATION     */ 05142500
*/*                                   DATE PROCESSING            @P3A*/ 05146200
*/*$P4=KJA1269,HDP3310,T87021,STLKAA: ADD SCRARS4A FOR OY03210       */ 05147400
*/*                                   CHANGE FROM 2.3.0          @P4A*/ 05148600
*/*$P5=KJA2624,HDP3310,T87120,STLKAA: CORRECT COMMENTS ON STATUS     */ 05149000
*/*                                   CODES                      @P5A*/ 05149400
*/*$P6=KJB3207,HDP3310,T87194,STLKAA: ADD SCRARS4B TO INDICATE       */ 05149600
*/*                                   UNEXPIRED DATA SET         @P6A*/ 05149800
*/*$P7=KJB3529,HDP3310,T87223,STLKAA: DELETE TEMPORARY VSAM DATA SETS*/ 05153900
*/*                                   AND CLARIFY UNCATALOGED BIT@P7A*/ 05158000
*/*$L1=PDSE,HDP3320,T87266,STLJEB:    ADD NEW FUNCTION CODE AND      */ 05162300
*/*                                   BYPASS CALL TO SMSX BIT    @L1A*/ 05174800
*/*$P8=KJB5091,HDP3310,T88258,STLJEB: CHANGE COMMENT ON SCRARS1C @P8A*/ 05177900
*/*                                   FROM CALLER INDICATES TO   @P8A*/ 05181000
*/*                                   FMT1 INDICATES             @P8A*/ 05184100
*/*$P9=KET2834,HDP3320,T88258,STLKSC: CHANGE TO PDSE             @P9A*/ 05185700
*/*$01=OY18651,HDP3310,T88074,STLJEB: RETURN NEW VOLUME STATUS,  @01A*/ 05186100
*/*                                   IN NEW BYTE, TO INDICATE   @01A*/ 05186500
*/*                                   RACF PROTECTED DATA SET    @01A*/ 05186900
*/*$02=OY24492,HDP3310,T89205,SJPLJEB: BYPASS FMT1 SMS FLAG      @02A*/ 05187000
*/*                                    CHECK FOR CLEAN UP        @02A*/ 05187100
*/*$L2=64KTRACK,JDZ1110,T920625,SJPLNWF: 64K TRACK DEVICE        @L2A*/ 05190300
*/*                                      SUPPORT                 @L2A*/ 05193500
*/*$03=OY60805,JDZ1110,T930113,SJPLNWF: CORRECT LABEL DASSSC08   @03A*/ 05195100
*/*$04=OY65295,JDZ1110,T930719,SJPLJEB: HANDLE IGGDADTS AND      @04A*/ 05195600
*/*                                     IGGDAEDS ERRORS CORRECTLY@04A*/ 05196100
*/*$P10=K120512,JDZ11B0,93SEP23,SJPLRPS: ADD SUBFUNCTION ID 45  @P10A*/ 05196400
*/*$L3=UCBVSCR,HDZ11C0,94Aug18,SJPLRPS: USB VSCR support - rcvy  @L3A*/ 05196500
*/*$05=OW32011,HDZ11D0,98Feb26,SJPLGAP: ERASE I/O DIAG. CODE     @05A*/ 05196600
*/*                                                                  */ 05196700
*/********************************************************************/ 05200000
* %DCL SC_BASE CHAR INTERNAL;                                           05300000
* %IF DAS_PL = 'N' %THEN %GOTO SK_SPL;                                  05316600
* %IF DAS_PL = 'NO' %THEN %GOTO SK_SPL;                                 05333200
* %SC_BASE = 'BASED(DASCRPTR)';                                         05350000
* %IF DAS_BASE = 'N' %THEN                                              05400000
*   %SC_BASE = '';                                                      05450000
* %IF DAS_BASE = 'NO' %THEN                                             05500000
*   %SC_BASE = '';                                                      05550000
* %IF DAS_PLL = 'N' %THEN %GOTO NOLIST_SPL;                             05556200
* %IF DAS_PLL = 'NO' %THEN %GOTO NOLIST_SPL;                            05562400
* %GOTO LIST_SPL;                                                       05568600
* %NOLIST_SPL: ;                                                        05574800
*@LIST PUSH;                                                            05581000
*@LIST OFF;                                                             05587200
* %LIST_SPL: ;                                                          05593400
*DECLARE                                                                05600000
* /*******************************************************************/ 05627100
* /*  COMMON SECTION                                                 */ 05654200
* /*******************************************************************/ 05681300
* 1 DASCR SC_BASE,           /* PARAMETER LIST MAPPING               */ 05708400
*  2 DASPLID  CHAR(8),       /* ID = 'IGGDASCR'                      */ 05735500
*  2 DASPVER FIXED(15),      /* VERSION OF PARAMETER LIST            */ 05762600
*  2 DASPLEN  FIXED(15),     /* LENGTH OF PARAMETER LIST             */ 05789700
*  2 DASPKEY  BIT(8),        /* KEY OF PARAMETER LIST                */ 05816800
*   3 DASPSKEY BIT(4),       /* STORAGE KEY OF PARAMETER LIST        */ 05843900
*   3 DASSKRSV BIT(4),       /* RESERVED                             */ 05871600
*  2 DASRSRV1 FIXED(8),      /* RESERVED                             */ 05919300
*  2 DASHRTCD FIXED(15),     /* HISTORIC SCRATCH RETURN CODE         */ 05967000
*  2 DASDIAGI FIXED(32),     /* DIAGNOSTIC INFORMATION               */ 06014700
*   /* REFER TO DADSM DIAGNOSIS REFERENCE FOR MORE INFORMATION       */ 06062400
*   3 DASERRCD FIXED(8),     /* DADSM SCRATCH RETURN CODE            */ 06110100
*   3 DASSFNID FIXED(8),     /* DADSM SCRATCH SUBFUNCTION ID         */ 06157800
*   3 DASSFRET FIXED(8),     /* SUBFUNCTION RETURN CODE              */ 06205500
*   3 DASSFREA FIXED(8),     /* SUBFUNCTION REASON CODE              */ 06253200
*  2 DASRSRV2 BIT(8),        /* RESERVED                             */ 06300900
*  2 DASFLAG2 BIT(8),        /* SMS INDICATOR FLAG                   */ 06348600
*   3 DASSMSMG BIT(1),       /* SMS MANAGED DATA SET                 */ 06396300
*   3 DASUNCAT BIT(1),       /* UNCATALOGED SMS MANAGED DATA SET     */ 06444000
*   3 DASCATCL BIT(1),       /* CATALOG IS THE CALLER            @P3A*/ 06459900
*   3 DASGDGRO BIT(1),       /* GDG ROLLOFF IN PROGRESS          @P3A*/ 06475800
*   3 DASGDGRN BIT(1),       /* GDG ROLLOFF NOSCRATCH            @P3A*/ 06491700
*   3 DASRSRV3 BIT(3),       /* RESERVED                         @P3C*/ 06507600
*  2 DASFLAG3 BIT(8),        /* FUNCTIONALLY AUTHORIZED REQUEST FLGS    06523500
*                               (PART 1)                             */ 06555300
*   3 DASFAUTH BIT(1),       /* FUNCTIONAL AUTHORIZATION OF REQUEST     06587100
*                               HAS BEEN GUARANTEED BY CALLER        */ 06634800
*   3 DASSAUTH BIT(1),       /* SECURITY AUTHORIZATION OF REQUEST       06682500
*                               HAS BEEN GUARANTEED BY CALLER        */ 06730200
*   3 DASPROFM BIT(1),       /* RACF PROFILE MANAGED BY CALLER       */ 06777900
*   3 DASBTIOT BIT(1),       /* BYPASS SYSZTIOT ENQUEUE              */ 06825600
*   3 DASBDSN  BIT(1),       /* BYPASS SYSDSN ENQUEUE                */ 06873300
*   3 DASBDEB  BIT(1),       /* BYPASS DEB CHECK (DSN NOT OPEN)      */ 06921000
*   3 DASNVALL BIT(1),       /* DO NOT DYNAMICALLY ALLOCATE             06968700
*                               VOLUMES                              */ 07016400
*   3 DASNERAS BIT(1),       /* DO NOT ERASE ANY EXTENTS             */ 07064100
*  2 DASFLAG4 BIT(8),        /* FUNCTIONALLY AUTHORIZED REQUEST FLGS    07080000
*                               (PART 2)                             */ 07095900
*   3 DASVOLMT BIT(1),       /* CALLER GUARANTEES VOLUME IS ALREADY     07111800
*                               MOUNTED                              */ 07127700
*   3 DASBSMS  BIT(1),       /* BYPASS SMS CALL FOR DESTROY PDSE @P9C*/ 07138300
*   3 DASBYSMS BIT(1),       /* BYPASS SMS CHECKING, FOR CLEANUP @02A*/ 07145300
*   3 DASRSRV4 BIT(5),       /* RESERVED                         @02C*/ 07152300
*  2 DASFLAG5 BIT(8),        /* AUTH NOT REQUIRED REQUEST FLAGS      */ 07159500
*   3 DASOVRPD BIT(1),       /* OVERRIDE PURGE DATE                  */ 07207200
*   3 DASVRFRD BIT(1),       /* VERIFY LAST REFERENCE DATE              07254900
*                               UNCHANGED (DFHSM)                    */ 07302600
*   3 DASERASE BIT(1),       /* ERASE ALL EXTENTS                    */ 07350300
*   3 DASRSRV5 BIT(5),       /* RESERVED                             */ 07400000
*  2 DASFLAG6 BIT(8),        /* PARAMETER FLAG BYTE                  */ 07414500
*   3 DASSVCEP BIT(1),       /* 1 = SCRATCH ENTERED AT SVC ENTRY POINT: 07429000
*                               0 = SCRATCH ENTERED AT BRANCH           07438600
*                               ENTRY                            @P1A*/ 07448200
*   3 DASRSRV6 BIT(7),       /* RESERVED                             */ 07458000
*  2 DASRSRV7 CHAR(2),       /* RESERVED                             */ 07472500
*  2 DASUCB PTR(31),         /* ADDRESS OF PRIMARY MOUNTABLE UCB     */ 07487400
*   3 DASVDSCB FIXED(32),    /* ADDRESS OF VIRTUAL DSCB, VIO DATA SET*/ 07531100
*  2 DASAVOLL PTR(31),       /* ADDRESS OF VOLUME LIST (IGGDAVLL)    */ 07574800
*  2 DASADSN  PTR(31),       /* ADDRESS OF DATA SET NAME             */ 07618500
*  2 DASREFDT CHAR(3),       /* REFERENCE DATE TO CHECK (DFHSM)      */ 07662200
*  2 DASRSRV8 CHAR(1);       /* RESERVED                             */ 07705900
*DECLARE                                                                07750000
*  /******************************************************************/ 07762500
*  /*  PARAMETER LIST CONSTANTS                                      */ 07775000
*  /******************************************************************/ 07787500
*  DASCRID CHAR(8) CONSTANT('IGGDASCR'), /*                             07800000
*                               PARAMETER LIST ID CONSTANT           */ 07850000
*  DASVER FIXED(15) CONSTANT(0), /*                                     07900000
*                               PARAMETER LIST VERSION               */ 07910500
*  DASLEN FIXED(15) CONSTANT(44); /*                                    07921000
*                               PARAMETER LIST LENGTH                */ 07931500
* %IF DAS_PLL = 'N' %THEN %GOTO RESETL_SPL;                             07942000
* %IF DAS_PLL = 'NO' %THEN %GOTO RESETL_SPL;                            07952500
* %GOTO SK_SPL;                                                         07963000
* %RESETL_SPL: ;                                                        07973500
*@LIST POP;                                                             07984000
* %SK_SPL: ;                                                            07994500
* %IF DAS_PL = '' %THEN %GOTO IN_SRC;                                   08005000
* %IF DAS_RC = '' %THEN %GOTO SK_SRC;                                   08015500
* %IF DAS_RC = 'N' %THEN %GOTO SK_SRC;                                  08026000
* %IF DAS_RC = 'NO' %THEN %GOTO SK_SRC;                                 08036500
* %IF DAS_RCL = 'N' %THEN %GOTO NOLIST_SRC;                             08047000
* %IF DAS_RCL = 'NO' %THEN %GOTO NOLIST_SRC;                            08057500
* %GOTO IN_SRC;                                                         08068000
* %NOLIST_SRC: ;                                                        08078500
*@LIST PUSH;                                                            08089000
*@LIST OFF;                                                             08099500
* %IN_SRC: ;                                                            08110000
*DECLARE                                                                08120500
*  /******************************************************************/ 08131000
*  /*  HISTORIC RETURN CODES                                         */ 08141500
*  /******************************************************************/ 08152000
*  DASHCD00 CONSTANT(000),          /* SUCCESSFUL DATA SET SCRATCHED */ 08162500
*                                                                       08173000
*  DASHCD04 CONSTANT(004),          /* NO VOLUME CONTAINING ANY PART    08183500
*                                      OF DATA SET WAS MOUNTED, NOR     08194000
*                                      WAS THERE A UNIT AVAILABLE FOR   08204500
*                                      MOUNTING                      */ 08215000
*                                                                       08225500
*  DASHCD08 CONSTANT(008),          /* AN UNUSUAL CONDITION WAS         08236000
*                                      ENCOUNTERED ON ONE OR MORE       08246500
*                                      VOLUMES                       */ 08257000
*                                                                       08267500
*  DASHCD0C CONSTANT(012);          /* THE PARAMETER OR VOLUME LIST     08278000
*                                      PASSED WAS INVALID            */ 08288500
*DECLARE                                                                08299000
*  /******************************************************************/ 08309500
*  /*  ERROR CODES                                                   */ 08320000
*  /******************************************************************/ 08330500
*  DASECD00 CONSTANT(000),          /* SUCCESSFUL COMPLETION         */ 08341000
*                                                                       08351500
*  DASECD04 CONSTANT(004),          /* CATEGORIZED ERROR CONDITION   */ 08362000
*                                                                       08372500
*  DASECD08 CONSTANT(008),          /* UNEXPECTED ERROR CONDITION    */ 08383000
*                                                                       08393500
*  DASECD0C CONSTANT(012),          /* INVALID PARAMETER OR REQUEST  */ 08404000
*                                                                       08414500
*  DASECD10 CONSTANT(016);          /* INVALID PARAMETER LIST        */ 08425000
* %IF DAS_RCL = 'N' %THEN %GOTO RESETL_SRC;                             08435500
* %IF DAS_RCL = 'NO' %THEN %GOTO RESETL_SRC;                            08446000
* %GOTO SK_SRC;                                                         08456500
* %RESETL_SRC: ;                                                        08467000
*@LIST POP;                                                             08477500
* %SK_SRC: ;                                                            08488000
* %IF DAS_PL = '' %THEN %GOTO IN_SSF;                                   08498500
* %IF DAS_SF = '' %THEN %GOTO SK_SSF;                                   08509000
* %IF DAS_SF = 'N' %THEN %GOTO SK_SSF;                                  08519500
* %IF DAS_SF = 'NO' %THEN %GOTO SK_SSF;                                 08530000
* %IF DAS_SFL = 'N' %THEN %GOTO NOLIST_SSF;                             08540500
* %IF DAS_SFL = 'NO' %THEN %GOTO NOLIST_SSF;                            08551000
* %GOTO IN_SSF;                                                         08561500
* %NOLIST_SSF: ;                                                        08572000
*@LIST PUSH;                                                            08582500
*@LIST OFF;                                                             08593000
* %IN_SSF: ;                                                            08603500
*DECLARE                                                                08614000
*  /******************************************************************/ 08624500
*  /*  SUBFUNCTION ID'S                                              */ 08635000
*  /******************************************************************/ 08645500
*  SCRASF01 CONSTANT(001),          /* VALIDATE SVC ENTRY PARMLIST   */ 08656000
*  SCRASF02 CONSTANT(002),          /* GETMAIN STORAGE FOR DAVLL -      08666500
*                                      IF GETMAIN FAILS, THE GETMAIN    08677000
*                                      RETURN CODE WILL BE PASSED BACK  08687500
*                                      IN BYTE 2 OF REGISTER 0       */ 08698000
*  SCRASF03 CONSTANT(003),          /* ISSUE SSI CALL TO SMS         */ 08708500
*  SCRASF04 CONSTANT(004),          /* VALIDATE BRANCH ENTRY            08719000
*                                      PARMLIST (DASCR)              */ 08729500
*  SCRASF05 CONSTANT(005),          /* VALIDATE VOLUME LIST (DAVLL)  */ 08740000
*  SCRASF06 CONSTANT(006),          /* VERIFY THAT SMS INDICATORS       08750500
*                                      PASSED BY THE CALLER MATCH THOSE 08761000
*                                      IN THE FMT4/FMT1 DSCB'S       */ 08771500
*  SCRASF07 CONSTANT(007),          /* INVOKE BRANCH ENTRY PRE-EXIT     08776700
*                                      MODULE (IGGDASU2) - IF PRE-EXIT  08781900
*                                      FAILS REQUEST, FIELD DASSFRET    08787100
*                                      WILL CONTAIN THE PRE-EXIT        08792300
*                                      RETURN CODE               @P1C*/ 08797500
*  SCRASF08 CONSTANT(008),          /* VERIFY LAST REFERENCE DATE       08803000
*                                      IS VALID                      */ 08813500
*  SCRASF09 CONSTANT(009),          /* SMS VTOC/DSS INVOKED - IF ERROR  08824000
*                                      OCCURS, THE VTOC/DSS ERROR       08834500
*                                      REASON CODE WILL BE PASSED BACK  08845000
*                                      IN BYTES 2 AND 3 OF REGISTER 0*/ 08855500
*  SCRASF0A CONSTANT(010),          /* ESTAE ROUTINE INVOKED BY RTM -   08857600
*                                      THE SYSTEM COMPLETION WILL BE    08859700
*                                      PASSED BACK IN BYTES 2 AND 3     08861800
*                                      OF REGISTER 0                 */ 08863900
*  SCRASF0B CONSTANT(011),          /* VALIDATE SCRATCH REQUEST      */ 08864000
*  SCRASF0C CONSTANT(012),          /* UPDATE FMT5 DSCB'S FOR DATA SET  08864100
*                                      WITH MORE THAN 16 EXTENTS     */ 08864200
*  SCRASF0D CONSTANT(013),          /* INVOKE CVAFDIR - READ FMT5       08864300
*                                      DSCB                          */ 08864400
*  SCRASF0E CONSTANT(014),          /* INVOKE CVAFDIR - WRITE FMT5      08864500
*                                      DSCB                          */ 08864600
*  SCRASF0F CONSTANT(015),          /* INVOKE CVAFDIR - WRITE FMT0      08864700
*                                      DSCB                          */ 08864800
*  SCRASF10 CONSTANT(016),          /* INVOKE CVAFDIR - READ FMT0       08864900
*                                      DSCB                          */ 08865000
*  SCRASF11 CONSTANT(017),          /* ERASE TRACKS OCCUPIED BY         08865100
*                                      DATA SET                      */ 08865200
*  SCRASF12 CONSTANT(018),          /* INVOKE RACF TO VERIFY CALLER     08865300
*                                      IS AUTHORIZED TO THE VOLUME      08865400
*                                      FOR SCRATCHING VTOC INDEX        08865500
*                                      DATA SET                      */ 08865600
*  SCRASF13 CONSTANT(019),          /* INVOKE RACF TO VERIFY CALLER     08865700
*                                      IS AUTHORIZED TO THE VOLUME      08865800
*                                      AFTER RACHECK OF DATA SET        08865900
*                                      WITH GENERIC PROFILE FAILED   */ 08866000
*  SCRASF14 CONSTANT(020),          /* READ FMT4 & FMT1 DSCB'S       */ 08866100
*  SCRASF15 CONSTANT(021),          /* INVOKE CVAFDIR - READ INDEX      08866200
*                                      MAPS, HIGH LEVEL VIER AND        08866300
*                                      FMT4 DSCB                     */ 08866400
*  SCRASF16 CONSTANT(022),          /* INVOKE CVAFVRF - CHECK FOR       08866500
*                                      VRF DATA IN THE VIXM          */ 08866600
*  SCRASF17 CONSTANT(023),          /* CHANNEL PROGRAM ISSUED TO READ   08866700
*                                      FMT4 & FMT1 DSCB'S AFTER         08866800
*                                      IGGVRF00 DISABLED THE VTOC       08866900
*                                      INDEX                         */ 08867000
*  SCRASF18 CONSTANT(024),          /* READ DSCB'S AND CHECK CALLER'S   08867100
*                                      AUTHORITY                     */ 08867200
*  SCRASF19 CONSTANT(025),          /* INVOKE CVAFDSM - DELETE DATA     08867300
*                                      SET NAME FROM INDEX           */ 08867400
*  SCRASF1A CONSTANT(026),          /* INVOKE CVAFDIR - READ FMT1       08867500
*                                      DSCB                          */ 08867600
*  SCRASF1B CONSTANT(027),          /* INVOKE CVAFDIR - READ FMT4       08867700
*                                      DSCB                          */ 08867800
*  SCRASF1C CONSTANT(028),          /* INVOKE CVAFDIR - WRITE FMT4      08867900
*                                      DSCB                          */ 08868000
*  SCRASF1D CONSTANT(029),          /* INVOKE CVAFDIR - RELEASE         08868100
*                                      BUFFERS                       */ 08868200
*  SCRASF1E CONSTANT(030),          /* READ FMT6 DSCB                */ 08868300
*  SCRASF1F CONSTANT(031),          /* WRITE FMT6 DSCB               */ 08868400
*  SCRASF20 CONSTANT(032),          /* WRITE FMT0 DSCB               */ 08868500
*  SCRASF21 CONSTANT(033),          /* READ FIRST FMT5 DSCB          */ 08868600
*  SCRASF22 CONSTANT(034),          /* UPDATE FMT6 DSCB              */ 08868700
*  SCRASF23 CONSTANT(035),          /* READ FMT5 DSCB                */ 08868800
*  SCRASF24 CONSTANT(036),          /* WRITE FMT5 DSCB               */ 08868900
*  SCRASF25 CONSTANT(037),          /* READ FMT0 DSCB                */ 08869000
*  SCRASF26 CONSTANT(038),          /* WRITE FMT4 DSCB, SENSE AVAIL  */ 08869100
*  SCRASF27 CONSTANT(039),          /* INVOKE IGG0290F TO DEMOUNT/      08869200
*                                      MOUNT/VERIFY VOLUME           */ 08869300
*  SCRASF28 CONSTANT(040),          /* LOCATE VOLUME TO BE PROCESSED */ 08869400
*  SCRASF29 CONSTANT(041),          /* REMOVE DSCB'S                 */ 08869500
*  SCRASF2A CONSTANT(042),          /* INVOKE CVAFDIR - READ FMT2/FMT3  08869600
*                                      DSCB'S                        */ 08869700
*  SCRASF2B CONSTANT(043),          /* INVOKE CVAFVRF - WRITE VRF DATA  08869800
*                                      TO INDEX MAP                  */ 08869900
*  SCRASF2C CONSTANT(044),          /* INVOKE CVAFDIR - WRITE BUFFER    08870000
*                                      LISTS TO THE VOLUME           */ 08870100
*  SCRASF2D CONSTANT(045),          /* INVOKE CVAFDIR - ZERO OUT ALL    08870200
*                                      FMT1/FMT2/FMT3 DSCB'S         */ 08870300
*  SCRASF2E CONSTANT(046),          /* INVOKE CVAFDSM - RELEASE         08870400
*                                      VOLUME SPACE TO THE VPSM      */ 08870500
*  SCRASF2F CONSTANT(047),          /* INVOKE CVAFVRF - ZERO OUT VRF    08870600
*                                      DATA                          */ 08870700
*  SCRASF30 CONSTANT(048),          /* INVOKE CVAFDIR - WRITE INDEX     08870800
*                                      MAPS AND VIXM TO VOLUME       */ 08870900
*  SCRASF31 CONSTANT(049),          /* INVOKE CVAFDIR - READ            08871000
*                                      FMT5/FMT6 DSCB'S              */ 08871100
*  SCRASF32 CONSTANT(050),          /* INVOKE CVAFDIR - WRITE FMT4      08871200
*                                      DSCB TO DISABLE INDEXED VTOC  */ 08871300
*  SCRASF33 CONSTANT(051),          /* INVOKE CVAFDIR - WRITE FMT4      08871400
*                                      DSCB WITH DS4DOSBT 'ON' FOR      08871500
*                                      OS VTOC                       */ 08871600
*  SCRASF34 CONSTANT(052),          /* INVOKE CVAFDIR - WRITE FMT4      08871700
*                                      DSCB FOR OS VTOC AFTER REQUEST   08871800
*                                      REJECTED BY PREPROCESSING EXIT*/ 08871900
*  SCRASF35 CONSTANT(053),          /* INVOKE CVAFDIR - WRITE FMT4      08872000
*                                      DSCB IF MORE THAN 5 TRACKS ARE   08872100
*                                      BEING ERASED                  */ 08872200
*  SCRASF36 CONSTANT(054),          /* INVOKE RACF TO VERIFY CALLER     08872300
*                                      IS AUTHORIZED TO THE DATA SET */ 08872400
*  SCRASF37 CONSTANT(055),          /* INVOKE RACF TO VERIFY CALLER     08872500
*                                      IS AUTHORIZED TO THE DATA SET    08872600
*                                      & TO RETURN ERASE STATUS      */ 08872700
*  SCRASF38 CONSTANT(056),          /* INVOKE RACF TO VERIFY CALLER     08872800
*                                      IS AUTHORIZED TO THE VOLUME      08872900
*                                      AFTER RACHECK OF DATA SET        08873000
*                                      WITH DISCRETE PROFILE FAILED  */ 08873100
*  SCRASF39 CONSTANT(057),          /* CHANNEL PROGRAM ISSUED TO READ   08873200
*                                      FMT4 & FMT1 DSCB'S AFTER         08873300
*                                      THE VTOC INDEX WAS DISABLED   */ 08873400
*  SCRASF3A CONSTANT(058),          /* INVOKE CVAFDIR - WRITE FMT4      08873500
*                                      DSCB FOR OS VTOC AFTER ERASE     08873600
*                                      FAILURE                       */ 08873700
*  SCRASF3B CONSTANT(059),          /* VALIDATE PARMLIST AT ENTRY TO    08873800
*                                      SCRATCH SVC                   */ 08873900
*  SCRASF3C CONSTANT(060),          /* INVOKE CVAFDIR - REWRITE         08874000
*                                      FMT4 DSCB WITH DS4DOSBT          08874100
*                                      BIT 'ON' - DATA SET WITH         08874200
*                                      INCORRECT NUMBER OF EXTENTS      08874300
*                                      FOUND                         */ 08874400
*  SCRASF3D CONSTANT(061),          /* INVOKE SMSX TO DESTROY PDSE@P9C  08874800
*                                      DIRECTORY                     */ 08875200
*  SCRASF3E CONSTANT(062),          /* ERROR CONVERTING EDT FROM NEW    08875800
*                                      FORMAT TO OLD             @L2A*/ 08876400
*  SCRASF3F CONSTANT(063),          /* ERROR CONVERTING CCHH TO RTA     08877000
*                                      FORMAT                    @L2A*/ 08877600
*  SCRASF40 CONSTANT(064),          /* ERROR SORTING THE EDT     @L2A*/ 08878200
*                                                                       08878800
*  SCRASF41 CONSTANT(065),          /* ERROR CONVERTING EDT TO F5       08879400
*                                      DSCB FORMAT ENTRIES       @L2A*/ 08880000
*  SCRASF42 CONSTANT(066),          /* ERROR CONVERTING EDT TO F7       08880600
*                                      DSCB FORMAT ENTRIES       @L2A*/ 08881200
*  SCRASF43 CONSTANT(067),          /* ERROR CONVERTING F5 DSCB         08881800
*                                      ENTRIES TO EDT FORMAT     @L2A*/ 08882400
*  SCRASF44 CONSTANT(068),          /* ERROR CONVERTING F7 DSCB         08883000
*                                      ENTRIES TO EDT FORMAT     @L2A*/ 08883600
*  SCRASF45 CONSTANT(069),          /* WRITE FMT4 DSCB, ECB/CSW AVAIL   08883800
*                                                               @P10A*/ 08884000
*  SCRASF46 CONSTANT(070),          /* INVOKE Capture_Ucb proc   @L3A*/ 08884200
*  SCRASF47 CONSTANT(071);          /* ERASE I/O ERROR           @05A*/ 08884400
*                                                                       08884600
*DECLARE                                                                08884800
*  /******************************************************************/ 08885400
*  /*  SUBFUNCTION REASON CODES                                      */ 08887000
*  /******************************************************************/ 08897500
*  SCRARS01 CONSTANT(001),          /* ADDRESS OF SVC ENTRY PARMLIST    08908000
*                                      IS ZERO                       */ 08918500
*  SCRARS02 CONSTANT(002),          /* IN THE SVC ENTRY PARMLIST,       08929000
*                                      EITHER THE ADDR OF THE DATA SET  08939500
*                                      NAME OR THE ADDR OF THE VOLUME   08950000
*                                      LIST IS ZERO                  */ 08960500
*  SCRARS03 CONSTANT(003),          /* VALIDATION OF THE RANGE OF       08971000
*                                      ADDRESSES OCCUPIED BY THE        08981500
*                                      VOLUME LIST FAILED            */ 08992000
*  SCRARS04 CONSTANT(004),          /* COUNT OF VOLUME IN THE VOLUME    09002500
*                                      LIST IS <= ZERO               */ 09013000
*  SCRARS05 CONSTANT(005),          /* LOGICAL ERROR ON SSI CALL -      09023500
*                                      BAD SSOB FORMAT, LENGTH, ETC. */ 09034000
*  SCRARS06 CONSTANT(006),          /* INVALID DASPLID FIELD-ID      */ 09044500
*  SCRARS07 CONSTANT(007),          /* INVALID DASPVER FIELD-VERSION */ 09055000
*  SCRARS08 CONSTANT(008),          /* INVALID DASPLEN FIELD-LENGTH  */ 09065500
*  SCRARS09 CONSTANT(009),          /* DASSKRSV MUST BE ZERO         */ 09076000
*  SCRARS0A CONSTANT(010),          /* FLAG DASVRFRD IS 'ON' BUT        09086500
*                                      DASREFDT IS ZERO              */ 09097000
*  SCRARS0B CONSTANT(011),          /* DASAVOLL IS ZERO              */ 09107500
*  SCRARS0C CONSTANT(012),          /* DASADSN IS ZERO               */ 09118000
*  SCRARS0D CONSTANT(013),          /* DASRSRV1 MUST BE ZERO         */ 09128500
*  SCRARS0E CONSTANT(014),          /* DASRSRV2 MUST BE ZERO         */ 09139000
*  SCRARS0F CONSTANT(015),          /* DASRSRV3 MUST BE ZERO         */ 09149500
*  SCRARS10 CONSTANT(016),          /* DASRSRV4 MUST BE ZERO         */ 09160000
*  SCRARS11 CONSTANT(017),          /* DASRSRV5 MUST BE ZERO         */ 09170500
*  SCRARS12 CONSTANT(018),          /* DASRSRV6 MUST BE ZERO         */ 09181000
*  SCRARS13 CONSTANT(019),          /* DASRSRV7 MUST BE ZERO         */ 09191500
*  SCRARS14 CONSTANT(020),          /* DASPKEY VALUE INVALID FOR        09202000
*                                      UPDATING FIELDS IN CALLER'S      09212500
*                                      DASCR                         */ 09223000
*  SCRARS15 CONSTANT(021),          /* INVALID DAVLLID FIELD-ID      */ 09233500
*  SCRARS16 CONSTANT(022),          /* INVALID DAVLVER FIELD-VERSION */ 09244000
*  SCRARS17 CONSTANT(023),          /* INVALID DAVLLEN FIELD-LENGTH  */ 09254500
*  SCRARS18 CONSTANT(024),          /* DAVSKRSV MUST BE ZERO         */ 09265000
*  SCRARS19 CONSTANT(025),          /* DAVRSRV1 MUST BE ZERO         */ 09275500
*  SCRARS1A CONSTANT(026),          /* DAVRSRV2 MUST BE ZERO         */ 09286000
*  SCRARS1B CONSTANT(027),          /* DAVLKEY VALUE INVALID FOR        09296500
*                                      UPDATING FIELDS IN CALLER'S      09307000
*                                      DAVLL                         */ 09317500
*  SCRARS1C CONSTANT(028),          /* SMS VOLUME ERROR - FMT1 DSCB     09328000
*                                      INDICATES SMS MANAGED BUT FMT4   09338500
*                                      DSCB SHOWS NOT SMS        @P8C*/ 09354200
*  SCRARS1D CONSTANT(029),          /* SMS DATA SET ERROR - CALLER      09370000
*                                      INDICATES SMS MANAGED BUT FMT1   09380500
*                                      DSCB DOESN'T                  */ 09391000
*  SCRARS1E CONSTANT(030),          /* CALLER INDICATES NO BCS ENTRY    09404100
*                                      BUT FMT1 DSCB DOESN'T     @P7C*/ 09417200
*  SCRARS1F CONSTANT(031),          /* CALLER                           09430300
*                                      INDICATES CATALOGED BUT FMT1     09443500
*                                      DSCB DOESN'T              @P7C*/ 09454000
*  SCRARS20 CONSTANT(032),          /* SMS VOLUME ERROR - CALLER        09464500
*                                      INDICATES NOT SMS MANAGED BUT    09475000
*                                      FMT4 DSCB INDICATES VOLUME IS    09485500
*                                      SMS MANAGED                   */ 09496000
*  SCRARS21 CONSTANT(033),          /* RESERVED                  @P1C*/ 09522200
*  SCRARS22 CONSTANT(034),          /* LAST REFERENCED DATE PASSED      09548500
*                                      BY CALLER DOES NOT MATCH THE     09559000
*                                      DATE IN FIELD DS1REFD IN         09569500
*                                      THE FMT1 DSCB                 */ 09580000
*  SCRARS23 CONSTANT(035),          /* CALLER                           09590500
*                                      INDICATES NOT SMS MANAGED BUT    09601000
*                                      FMT1 DSCB SHOWS SMS       @P7C*/ 09611500
*  SCRARS24 CONSTANT(036),          /* ENQUEUE ON TIOT FAILED -         09611600
*                                      FIELD DASSFRET CONTAINS THE      09611700
*                                      ENQUEUE RETURN CODE           */ 09611800
*  SCRARS25 CONSTANT(037),          /* ENQUEUE ON SYSDSN FAILED -       09611900
*                                      FIELD DASSFRET CONTAINS THE      09612000
*                                      ENQUEUE RETURN CODE           */ 09612100
*  SCRARS26 CONSTANT(038),          /* ENQUEUE ON CVOL NAME             09612200
*                                      'SYSCTLG.VXXXXXX' FAILED      */ 09612300
*  SCRARS27 CONSTANT(039),          /* DSAB OPEN COUNT (DSABOPCT) FOR   09612400
*                                      VIO DATA SET IS NOT ZERO      */ 09612500
*  SCRARS28 CONSTANT(040),          /* UCB DATA MANAGEMENT COUNT        09612600
*                                      (UCBDMCT) FOR VIO DATA SET IS    09612700
*                                      NOT ZERO                      */ 09612800
*  SCRARS29 CONSTANT(041),          /* VOLUME LIST CONTAINS MORE THAN   09612900
*                                      ONE VOLUME FOR VIO DATA SET   */ 09613000
*  SCRARS2A CONSTANT(042),          /* INPUT UCB ADDRESS IS ZERO     */ 09613100
*  SCRARS2B CONSTANT(043),          /* VSCRATCH FAILED FOR VIO DATA     09613200
*                                      SET                           */ 09613300
*  SCRARS2C CONSTANT(044),          /* PREPROCESSING EXIT REJECTED      09613400
*                                      REQUEST FOR VIO DATA SET -       09613500
*                                      FIELD DASSFRET CONTAINS THE      09613600
*                                      EXIT RETURN CODE              */ 09613700
*  SCRARS2D CONSTANT(045),          /* CCHH OF RECORD TO BE READ/       09613800
*                                      WRITTEN IS < BEGINNING CCHH      09613900
*                                      OF VTOC                       */ 09614000
*  SCRARS2E CONSTANT(046),          /* CCHH OF RECORD TO BE READ/       09614100
*                                      WRITTEN IS > ENDING CCHH         09614200
*                                      OF VTOC                       */ 09614300
*  SCRARS2F CONSTANT(047),          /* COUNT OF NUMBER OF EXTENTS       09614400
*                                      INDICATES NEW FMT5 IS ALREADY    09614500
*                                      FULL                          */ 09614600
*  SCRARS30 CONSTANT(048),          /* PGFIX OF I/O WORKAREA FAILED  */ 09614700
*  SCRARS31 CONSTANT(049),          /* I/O ERROR DURING VRF RECOVERY    09614800
*                                      ROUTINE EXECUTION             */ 09614900
*  SCRARS32 CONSTANT(050),          /* OS VTOC - DATA SET FOUND BUT     09615000
*                                      FMT1 DSCB ID IS INVALID       */ 09615100
*  SCRARS33 CONSTANT(051),          /* INDEXED VTOC - DATA SET IN       09615200
*                                      INDEX BUT NO FMT1 DSCB FOUND  */ 09615300
*  SCRARS34 CONSTANT(052),          /* SECLOADA FAILED REQUEST       */ 09615400
*  SCRARS35 CONSTANT(053),          /* CALLER NOT FUNCTIONALLY          09615500
*                                      AUTHORIZED TO SCRATCH VTOC       09615600
*                                      INDEX DATA SET                */ 09615700
*  SCRARS36 CONSTANT(054),          /* CANNOT SCRATCH VTOC INDEX DATA   09615800
*                                      SET ON AN INDEXED VTOC VOLUME */ 09615900
*  SCRARS37 CONSTANT(055),          /* FIRST SPLIT CYLINDER EXTENT      09616000
*                                      BELONGING TO DATA SET IS <       09616100
*                                      LOWEST CCHH IN FIRST FMT6 DSCB*/ 09616200
*  SCRARS38 CONSTANT(056),          /* VOLSER FROM VOLUME LIST IS       09616300
*                                      ZERO                          */ 09616400
*  SCRARS39 CONSTANT(057),          /* VOLUME NOT MOUNTED ON ANY        09616500
*                                      ONLINE, SHAREABLE DASD UNIT   */ 09616600
*  SCRARS3A CONSTANT(058),          /* DEVICE TYPE OF VOLUME FROM       09616700
*                                      VOLUME LIST DOES NOT MATCH UCB   09616800
*                                      DEVICE TYPE OF UNIT ON WHICH     09616900
*                                      VOLUME RESIDES                */ 09617000
*  SCRARS3B CONSTANT(059),          /* DEVICE ON WHICH CURRENT VOLUME   09617100
*                                      IS MOUNTED IS NOT READY       */ 09617200
*  SCRARS3C CONSTANT(060),          /* FMT1 INDICATES DATA SET HAS      09617300
*                                      MORE THAN 3 EXTENTS BUT FMT3     09617400
*                                      CCHHR ADDRESS IN FMT1 IS ZERO */ 09617500
*  SCRARS3D CONSTANT(061),          /* PREPROCESSING EXIT REJECTED      09617600
*                                      REQUEST - FIELD DASSFRET         09617700
*                                      CONTAINS THE EXIT RETURN CODE */ 09617800
*  SCRARS3E CONSTANT(062),          /* DSCB POINTED TO FROM FMT1 IS     09617900
*                                      NEITHER A FMT2 NOR FMT3 DSCB  */ 09618000
*  SCRARS3F CONSTANT(063),          /* NUMBER OF FMT0 DSCB'S IS <       09618100
*                                      NUMBER NEEDED TO DESCRIBE        09618200
*                                      EXTENTS BEING FREED           */ 09618300
*  SCRARS40 CONSTANT(064),          /* DEB FOUND OPEN TO DATA SET       09618400
*                                      BEING SCRATCHED               */ 09618500
*  SCRARS41 CONSTANT(065),          /* VOLUME COULD NOT BE DEMOUNTED */ 09618600
*  SCRARS42 CONSTANT(066),          /* VOLUME COULD NOT BE MOUNTED   */ 09618700
*  SCRARS43 CONSTANT(067),          /* I/O ERROR OCCURRED WHEN          09618800
*                                      READING THE VOLUME LABEL      */ 09618900
*  SCRARS44 CONSTANT(068),          /* OS VTOC - FMT1 DSCB NOT          09619000
*                                      FOUND ON VOLUME               */ 09619100
*  SCRARS45 CONSTANT(069),          /* STORAGE PROTECTION VALIDATION    09619200
*                                      FAILED FOR PARMLIST           */ 09619300
*  SCRARS46 CONSTANT(070),          /* STORAGE PROTECTION VALIDATION    09619400
*                                      FAILED FOR DATA SET NAME      */ 09619500
*  SCRARS47 CONSTANT(071),          /* DASRSRV8 MUST BE ZERO     @P1A*/ 09619800
*  SCRARS48 CONSTANT(072),          /* STORAGE PROTECTION VALIDATION    09620100
*                                      FAILED FOR PASSED UCB            09620400
*                                      ADDRESS                   @P2A*/ 09620700
*  SCRARS49 CONSTANT(073),          /* UCBID OF PASSED UCB IS           09621000
*                                      INVALID                   @P2A*/ 09621300
*  SCRARS4A CONSTANT(074),          /* DEVICE TYPE IN VOLUME LIST       09621400
*                                      ENTRY OR IN PASSED UCB           09621500
*                                      INDICATES DEVICE IS NOT          09621600
*                                      DASD                      @P4A*/ 09621700
*  SCRARS4B CONSTANT(075),          /* DATA SET UNEXPIRED        @P6A*/ 09623800
*  SCRARS4C CONSTANT(076);          /* DATA SET IS A TEMPORARY, VSAM    09625900
*                                      DATA SET                  @P7A*/ 09628000
*                                                                       09630100
* %IF DAS_SFL = 'N' %THEN %GOTO RESETL_SSF;                             09632500
* %IF DAS_SFL = 'NO' %THEN %GOTO RESETL_SSF;                            09643000
* %GOTO SK_SSF;                                                         09653500
* %RESETL_SSF: ;                                                        09664000
*@LIST POP;                                                             09674500
* %SK_SSF: ;                                                            09685000
* %IF DAS_PL = '' %THEN %GOTO IN_SST;                                   09695500
* %IF DAS_ST = '' %THEN %GOTO SK_SST;                                   09706000
* %IF DAS_ST = 'N' %THEN %GOTO SK_SST;                                  09716500
* %IF DAS_ST = 'NO' %THEN %GOTO SK_SST;                                 09727000
* %IF DAS_STL = 'N' %THEN %GOTO NOLIST_SST;                             09737500
* %IF DAS_STL = 'NO' %THEN %GOTO NOLIST_SST;                            09748000
* %GOTO IN_SST;                                                         09758500
* %NOLIST_SST: ;                                                        09769000
*@LIST PUSH;                                                            09779500
*@LIST OFF;                                                             09790000
* %IN_SST: ;                                                            09800500
*DECLARE                                                                09811000
*  /******************************************************************/ 09821500
*  /*  SCRATCH STATUS CODES                                          */ 09832000
*  /******************************************************************/ 09842500
*  DASSTC00 CONSTANT(000),          /* SUCCESSFUL SCRATCH            */ 09853000
*  DASSTC01 CONSTANT(001),          /* DSCB NOT FOUND IN VTOC        */ 09863500
*  DASSTC02 CONSTANT(002),          /* VERIFICATION FAILURE.     @P5A*/ 09866500
*                                   /* THIS CODE CAN RESULT FROM:@P5A*/ 09869500
*                                   /*  - PASSWORD DIFFICULTY    @P5C*/ 09872500
*                                   /*  - SMS VALIDATION FAILURE @P5M*/ 09875500
*                                   /*  - VERIFY OF LAST REFERENCED  */ 09878500
*                                   /*    DATE FAILED            @P5M*/ 09881500
*  DASSTC03 CONSTANT(003),          /* UNEXPIRED PURGE DATE          */ 09884500
*  DASSTC04 CONSTANT(004),          /* I/O ERROR OR VALIDATION       */ 09895000
*                                   /* FAILURE.  THIS CODE CAN RESULT*/ 09905500
*                                   /* FROM:                         */ 09916000
*                                   /*  - NONZERO RETURN CODE FROM   */ 09926500
*                                   /*    VSCRATCH                   */ 09937000
*                                   /*  - REQUEST REJECTED BY        */ 09947500
*                                   /*    INSTALLATION EXIT          */ 09958000
*                                   /*  - I/O ERROR ACCESSING VTOC   */ 09968500
*                                   /*    OR VTOC INDEX              */ 09979000
*                                   /*  - STRUCTURE ERROR IN VTOC    */ 09989500
*                                   /*    INDEX                      */ 10000000
*                                   /*  - I/O ERROR WHILE ERASING    */ 10010500
*                                   /*    TRACKS                     */ 10021000
*                                   /*  - ERROR DETECTED BY MACRO@04A*/ 10024500
*                                   /*    IGGDAEDS OR IGGDADTS.  @04A*/ 10028000
*                                   /*    SUCH ERRORS COULD      @04A*/ 10031500
*                                   /*    RESULT IN I/O ERROR    @04A*/ 10035000
*                                   /*    IF PROCESSING CONTINUES@04A*/ 10038500
*                                                             /*3@P5D*/ 10042000
*  DASSTC05 CONSTANT(005),          /* APPROPRIATE UCB UNAVAILABLE   */ 10063000
*  DASSTC06 CONSTANT(006),          /* OPERATOR UNABLE TO MOUNT      */ 10073500
*                                   /* VOLUME                        */ 10084000
*  DASSTC07 CONSTANT(007),          /* DATA SET IS OPEN              */ 10094500
*  DASSTC08 CONSTANT(008);          /* INSUFFICIENT RACF AUTHORITY   */ 10105000
*                                                                       10105900
*DECLARE                                                                10106800
*  /******************************************************************/ 10107700
*  /*  SCRATCH SECONDARY STATUS CODE                            @01A */ 10108600
*  /******************************************************************/ 10109500
*  DASSSC80 CONSTANT(128);          /*  AT LEAST ONE ENTRY IN VOLUME */ 10110400
*                                   /*  LIST WAS PROTECTED BY RACF   */ 10111300
*                                   /*  AND CALLER WAS AUTHORIZED.   */ 10112200
*                                   /*  EXCEPTION IS DASDVOL         */ 10113100
*                                   /*  AUTHORIZATION.          @01A */ 10114000
* %IF DAS_STL = 'N' %THEN %GOTO RESETL_SST;                             10115500
* %IF DAS_STL = 'NO' %THEN %GOTO RESETL_SST;                            10126000
* %GOTO SK_SST;                                                         10136500
* %RESETL_SST: ;                                                        10147000
*@LIST POP;                                                             10157500
* %SK_SST: ;                                                            10168000
* %GOTO PLSDASCX; /*                                                    10178500
.DASCASM ANOP                                                           10189000
         LCLA  &I            LABEL INDEX NUMBER                         10199500
         LCLA  &NO           LABEL INDEX NUMBER                         10210000
         LCLC  &LBL          LOCAL LABEL VARIABLE                       10220500
         LCLA  &VER          PARAMETER LIST VERSION                     10231000
         LCLA  &LEN          PARAMETER LIST LENGTH                      10241500
         LCLA  &SNUM         NUMBER OF POSSIBLE SECTIONS                10252000
         LCLB  &SFLG(4)      SECTION FLAGS                              10262500
         LCLC  &SECT(4)      SECTION NAMES                              10273000
         LCLB  &WRNSW        WARNING MESSAGE MNOTE ISSUED               10283500
         LCLB  &ERRSW        ERROR MESSAGE MNOTE ISSUED                 10294000
         LCLB  &GDSECT       GENERATE DSECT                             10304500
         LCLB  &ALLSECT      INCLUDE ALL SECTIONS                       10315000
         LCLB  &NODSECT      NO DSECT STATEMENT                         10325500
.*                                                                      10336000
&NO      SETA  &SYSNDX       SET LABEL INDEX NUMBER                     10346500
&LBL     SETC  '&L'          SET LABEL                                  10357000
&LEN     SETA  44            DEFAULT TO LENGTH 44                       10367500
&VER     SETA  0             DEFAULT TO VERSION 0                       10378000
&SNUM    SETA  4             SET NUMBER OF POSSIBLE SECTIONS            10388500
&GDSECT  SETB  1             ASSUME THAT DSECT SHOULD BE GENERATED      10399000
&SECT(1) SETC  'PL'          COMMON PORTION OF PARAMETER LIST           10409500
&SECT(2) SETC  'RC'          HISTORIC/ERROR CODES                       10420000
&SECT(3) SETC  'SF'          SUBFUNCTION ID'S/REASON CODES              10430500
&SECT(4) SETC  'ST'          SCRATCH STATUS CODES                       10441000
.********************************************************************** 10451500
.* VERIFICATION (1): MF PARAMETER                                       10462000
.********************************************************************** 10472500
.*                                                                      10483000
.V1      AIF   ('&MF(1)' EQ 'D').V1D    IF D FORM, BRANCH               10493500
         AGO   .V1ER1                   ELSE BRANCH (ERROR)             10504000
.*                                                                      10514500
.V1D     AIF   ('&MF' NE 'D').V1D1      IF NOT MF=D, BRANCH             10525000
&ALLSECT SETB  1                        INCLUDE ALL SECTIONS            10535500
         AGO   .V1X                     VERIFICATION COMPLETE           10546000
.*                                                                      10556500
.V1D1    AIF   (N'&MF NE 2).V1ER1       IF MORE THAN TWO PARAMETER,     10567000
.*                                         BRANCH (ERROR)               10577500
&I       SETA  0                        INITIALIZE LOOP INDEX           10588000
.V1LP1   ANOP                           START OF SEARCH LOOP            10598500
&I       SETA  &I+1                     INCREMENT INDEX                 10609000
         AIF   ('&MF(2)' EQ '&SECT(&I)').V1LX1 IF MATCH, EXIT LOOP      10619500
         AIF   (&I GE &SNUM).V1ER1      IF NO MORE SECTIONS TO CHECK,   10630000
.*                                         BRANCH (ERROR)               10640500
         AGO   .V1LP1                   BRANCH TO TOP OF LOOP           10651000
.*                                                                      10661500
.V1LX1   ANOP                           LOOP EXIT                       10672000
&SFLG(&I) SETB 1                        SET SECTION FLAG                10682500
         AGO   .V1X                     VERIFICATION COMPLETE           10693000
.*                                                                      10703500
.V1WR1   ANOP                           WARNING MESSAGE                 10714000
&WRNSW   SETB  1                                                        10750000
         AGO   .V1X                                                     10800000
.*                                                                      10850000
.V1ER1   ANOP                           ERROR MESSAGE                   10900000
         SPACE 1                                                        10950000
         MNOTE 8,'DASCR01E - INVALID OPERAND - MF=&MF'                  11000000
&ERRSW   SETB  1                                                        11050000
.*                                                                      11100000
.V1X     ANOP                                                           11150000
.********************************************************************** 11200000
.* VERIFICATION (2): DSECT PARAMETER                                    11250000
.********************************************************************** 11300000
.*                                                                      11350000
.V2      AIF   ('&DSECT' EQ 'YES').V2X  IF =YES, BRANCH                 11400000
         AIF   ('&DSECT' NE 'NO').V2ER1 IF NOT =NO, ERROR               11450000
&NODSECT SETB  1                        NO DSECT STATEMENT              11500000
         AGO   .V2X                     VERIFICATION COMPLETE           11550000
.*                                                                      11600000
.V2WR1   ANOP                           WARNING MESSAGE                 11650000
&WRNSW   SETB  1                                                        11700000
         AGO   .V2X                                                     11750000
.*                                                                      11800000
.V2ER1   ANOP                           ERROR MESSAGE                   11850000
         SPACE 1                                                        11900000
         MNOTE 8,'DASCR02E - INVALID OPERAND - DSECT=&DSECT'            11950000
&ERRSW   SETB  1                                                        12000000
.*                                                                      12050000
.V2X     ANOP                                                           12100000
.********************************************************************** 12150000
.* CHECK ERRORS                                                         12200000
.********************************************************************** 12250000
.*                                                                      12300000
         AIF   (&ERRSW).FINISH                                          12350000
.********************************************************************** 12400000
.* SECTION (1): COMMON PARAMETER LIST                                   12450000
.********************************************************************** 12500000
.*                                                                      12550000
         AIF   (&ALLSECT).S1A                                           12600000
         AIF   (NOT &SFLG(1)).S1X                                       12650000
.S1A     AIF   (NOT &GDSECT).S1C                                        12700000
&GDSECT  SETB  0                                                        12750000
         AIF   (&NODSECT).S1B                                           12800000
&LBL     DSECT                                                          12850000
         AGO   .S1C                                                     12900000
.S1B     ANOP                                                           12950000
&LBL     DS    0F                                                       13000000
.S1C     ANOP                                                           13050000
.********************************************************************** 13100000
*********************************************************************** 13129000
*     COMMON SECTION                                                  * 13158000
*********************************************************************** 13187000
DASCR    DS    0CL44                    PARAMETER LIST MAPPING          13216000
DASPLID  DS    CL8                      ID = 'IGGDASCR'                 13245000
DASPVER  DS    H                        VERSION OF PARAMETER LIST       13274000
DASPLEN  DS    H                        LENGTH OF PARAMETER LIST        13303000
DASPKEY  DS    XL1                      KEY OF PARAMETER LIST           13332000
DASPSKEY EQU   B'11110000'              STORAGE KEY OF PARAMETER LIST   13361000
DASSKRSV EQU   B'00001111'              RESERVED                        13390000
DASRSRV1 DS    XL1                      RESERVED                        13900000
DASHRTCD DS    H                        HISTORIC SCRATCH RETURN CODE    13939000
DASDIAGI DS    F                        DIAGNOSTIC INFORMATION          13978000
*********************************************************************** 14017000
*        REFER TO DADSM DIAGNOSIS REFERENCE FOR MORE INFORMATION      * 14056000
*********************************************************************** 14095000
         ORG   DASDIAGI                                                 14134000
DASERRCD DS    XL1                      DADSM SCRATCH RETURN CODE       14173000
DASSFNID DS    XL1                      DADSM SCRATCH SUBFUNCTION ID    14212000
DASSFRET DS    XL1                      SUBFUNCTION RETURN CODE         14251000
DASSFREA DS    XL1                      SUBFUNCTION REASON CODE         14290000
DASRSRV2 DS    XL1                      RESERVED                        14329000
DASFLAG2 DS    XL1                      PARAMETER FLAG BYTE             14368000
DASSMSMG EQU   B'10000000'              SMS MANAGED DATA SET            14407000
DASUNCAT EQU   B'01000000'              UNCATALOGED SMS MANAGED DATA   X14446000
                                        SET                             14485000
DASCATCL EQU   B'00100000'              CATALOG IS THE CALLER     @P3A  14498000
DASGDGRO EQU   B'00010000'              GDG ROLLOFF IN PROGRESS   @P3A  14511000
DASGDGRN EQU   B'00001000'              GDG ROLLOFF NOSCRATCH     @P3A  14524000
DASRSRV3 EQU   B'00000111'              RESERVED                  @P3C  14537000
DASFLAG3 DS    XL1                      FUNCTIONALLY AUTH REQUEST FLGS X14550000
                                        (PART 1)                        14576000
DASFAUTH EQU   B'10000000'              FUNCTIONAL AUTHORIZATION OF    X14602000
                                        REQUEST HAS BEEN GUARANTEED BY X14641000
                                        CALLER                          14680000
DASSAUTH EQU   B'01000000'              SECURITY AUTHORIZATION OF      X14719000
                                        REQUEST HAS BEEN GUARANTEED BY X14758000
                                        CALLER                          14797000
DASPROFM EQU   B'00100000'              RACF PROFILE MANAGED BY CALLER  14836000
DASBTIOT EQU   B'00010000'              BYPASS SYSZTIOT ENQUEUE         14875000
DASBDSN  EQU   B'00001000'              BYPASS SYSDSN ENQUEUE           14914000
DASBDEB  EQU   B'00000100'              BYPASS DEB CHECK (DSN NOT      X14953000
                                        OPEN)                           14992000
DASNVALL EQU   B'00000010'              DO NOT DYNAMICALLY ALLOCATE    X15031000
                                        VOLUMES                         15070000
DASNERAS EQU   B'00000001'              DO NOT ERASE ANY EXTENTS        15109000
DASFLAG4 DS    XL1                      FUNCTIONALLY AUTH REQUEST FLGS X15124100
                                        (PART 2)                        15139200
DASVOLMT EQU   B'10000000'              CALLER GUARANTEES VOLUME IS    X15154300
                                        ALREADY MOUNTED                 15169400
DASBSMS  EQU   B'01000000'              BY PASS SMS CALL TO DESTROY@L1AX15177000
                                        DIRECTORY                  @L1A 15184600
DASBYSMS EQU   B'00100000'              BYPASS FMT1 SMS CHECKING - @02AX15188400
                                        FOR CLEANUP                @02A 15192200
DASRSRV4 EQU   B'00011111'              RESERVED                   @02C 15196000
DASFLAG5 DS    XL1                      AUTH NOT REQUIRED REQUEST FLAGS 15200000
DASOVRPD EQU   B'10000000'              OVERRIDE PURGE DATE             15250000
DASVRFRD EQU   B'01000000'              VERIFY LAST REFERENCE DATE     X15300000
                                        UNCHANGED (DFHSM)               15350000
DASERASE EQU   B'00100000'              ERASE ALL EXTENTS               15400000
DASRSRV5 EQU   B'00011111'              RESERVED                        15450000
DASFLAG6 DS    XL1                      PARAMETER FLAG BYTE             15464200
DASSVCEP EQU   B'10000000'              1 =SCRATCH ENTERED AT SVC ENTRYX15478400
                                        POINT: 0 =SCRATCH ENTERED AT   X15492600
                                        BRANCH ENTRY               @P1A 15506800
DASRSRV6 EQU   B'01111111'              RESERVED                        15521000
DASRSRV7 DS    CL2                      RESERVED                        15535200
DASUCB   DS    A                        ADDRESS OF PRIMARY MOUNTABLE   X15550000
                                        UCB                             15600000
         ORG   DASUCB                                                   15650000
DASVDSCB DS    A                        ADDRESS OF VIRTUAL DSCB, VIO   X15700000
                                        DATA SET                        15750000
DASAVOLL DS    A                        ADDRESS OF VOLUME LIST         X15800000
                                        (IGGDAVLL)                      15850000
DASADSN  DS    A                        ADDRESS OF DATA SET NAME        15880000
DASREFDT DS    CL3                      REFERENCE DATE TO CHECK        X15910000
                                        (DFHSM)                         15940000
DASRSRV8 DS    CL1                      RESERVED                        15970000
*                                                                       16000000
DASCRID  DC    CL8'IGGDASCR'            ID = 'IGGDASCR'                 16050000
DASVER   EQU   &VER                     PARAMETER LIST VERSION          16100000
DASLEN   EQU   &LEN                     PARAMETER LIST LENGTH           16150000
.S1X     ANOP                                                           16200000
.*                                                                      16200200
.********************************************************************** 16200400
.* SECTION (2): HISTORIC RETURN CODES AND ERROR CODES                   16200600
.********************************************************************** 16200800
.*                                                                      16201000
.S2      AIF   (&ALLSECT).S2B                                           16201200
         AIF   (NOT &SFLG(2)).S2X                                       16201400
         AIF   (NOT &GDSECT).S2C                                        16201600
&GDSECT  SETB  0                                                        16201800
         AIF   (&NODSECT).S2B                                           16202000
&LBL     DSECT                                                          16202200
         AGO   .S2C                                                     16202400
.S2B     ANOP                                                           16202600
&LBL     DS    0F                                                       16202800
.S2C     ANOP                                                           16203000
*********************************************************************** 16203200
*  HISTORIC RETURN CODES                                              * 16203400
*********************************************************************** 16203600
DASHCD00 EQU   0                        SUCCESSFUL DATA SET SCRATCHED   16203800
DASHCD04 EQU   4                        NO VOLUME CONTAINING ANY PART  X16204000
                                        OF DATA SET WAS MOUNTED, NOR   X16204200
                                        WAS THERE A UNIT AVAILABLE FOR X16204400
                                        MOUNTING                        16204600
DASHCD08 EQU   8                        AN UNUSUAL CONDITION WAS       X16204800
                                        ENCOUNTERED ON ONE OR MORE     X16205000
                                        VOLUMES                         16205200
DASHCD0C EQU   12                       THE PARAMETER OR VOLUME LIST   X16205400
                                        PASSED WAS INVALID              16205600
*********************************************************************** 16205800
*  ERROR CODES                                                        * 16206000
*********************************************************************** 16206200
DASECD00 EQU   0                        SUCCESSFUL COMPLETION           16206400
DASECD04 EQU   4                        CATEGORIZED ERROR CONDITION     16206600
DASECD08 EQU   8                        UNEXPECTED ERROR CONDITION      16206800
DASECD0C EQU   12                       INVALID PARAMETER OR REQUEST    16207000
DASECD10 EQU   16                       INVALID PARAMETER LIST          16207200
.S2X     ANOP                                                           16207400
.*                                                                      16207600
.********************************************************************** 16207800
.* SECTION (3): SUBFUNCTION ID'S AND SUBFUNCTION REASON CODES           16208000
.********************************************************************** 16208200
.*                                                                      16208400
.S3      AIF   (&ALLSECT).S3B                                           16208600
         AIF   (NOT &SFLG(3)).S3X                                       16208800
         AIF   (NOT &GDSECT).S3C                                        16209000
&GDSECT  SETB  0                                                        16209200
         AIF   (&NODSECT).S3B                                           16209400
&LBL     DSECT                                                          16209600
         AGO   .S3C                                                     16209800
.S3B     ANOP                                                           16210000
&LBL     DS    0F                                                       16210200
.S3C     ANOP                                                           16210400
*********************************************************************** 16210600
*  SUBFUNCTION ID'S                                                   * 16210800
*********************************************************************** 16211000
SCRASF01 EQU   1                        VALIDATE SVC ENTRY PARMLIST     16211200
SCRASF02 EQU   2                        GETMAIN STORAGE FOR DAVLL -    X16211400
                                        IF GETMAIN FAILS, THE GETMAIN  X16211600
                                        RETURN CODE WILL BE PASSED BACKX16211800
                                        IN BYTE 2 OF REGISTER 0         16212000
SCRASF03 EQU   3                        ISSUE SSI CALL TO SMS SUBSYSTEM 16212200
SCRASF04 EQU   4                        VALIDATE BRANCH ENTRY          X16212400
                                        PARMLIST (DASCR)                16212600
SCRASF05 EQU   5                        VALIDATE VOLUME LIST (DAVLL)    16212800
SCRASF06 EQU   6                        VERIFY THAT SMS INDICATORS     X16213000
                                        PASSED BY THE CALLER MATCH     X16213200
                                        THOSE IN THE FMT4/FMT1 DSCB'S   16213400
SCRASF07 EQU   7                        INVOKE BRANCH ENTRY PRE-EXIT   X16213500
                                        MODULE (IGGDASU2) - IF PRE-EXITX16213600
                                        FAILS REQUEST, FIELD DASSFRET  X16213700
                                        WILL CONTAIN THE PRE-EXIT      X16213800
                                        RETURN CODE                @P1C 16213900
SCRASF08 EQU   8                        VERIFY LAST REFERENCE DATE     X16214000
                                        IS VALID                        16214200
SCRASF09 EQU   9                        SMS VTOC/DSS INVOKED - IF ERRORX16214400
                                        OCCURS, THE VTOC/DSS ERROR     X16214600
                                        REASON CODE WILL BE PASSED BACKX16214800
                                        IN BYTES 2 AND 3 OF REGISTER 0  16215000
SCRASF0A EQU   10                       ESTAE ROUTINE INVOKED BY RTM - X16215100
                                        THE SYSTEM COMPLETION WILL BE  X16215200
                                        PASSED BACK IN BYTES 2 AND 3   X16215300
                                        OF REGISTER 0                   16215400
SCRASF0B EQU   11                       VALIDATE SCRATCH REQUEST        16215500
SCRASF0C EQU   12                       UPDATE FMT5 DSCB'S FOR DATA SETX16215600
                                        WITH MORE THAN 16 EXTENTS       16215700
SCRASF0D EQU   13                       INVOKE CVAFDIR - READ FMT5     X16215800
                                        DSCB                            16215900
SCRASF0E EQU   14                       INVOKE CVAFDIR - WRITE FMT5    X16216000
                                        DSCB                            16216100
SCRASF0F EQU   15                       INVOKE CVAFDIR - WRITE FMT0    X16216200
                                        DSCB                            16216300
SCRASF10 EQU   16                       INVOKE CVAFDIR - READ FMT0     X16216400
                                        DSCB                            16216500
SCRASF11 EQU   17                       ERASE TRACKS OCCUPIED BY       X16216600
                                        DATA SET                        16216700
SCRASF12 EQU   18                       INVOKE RACF TO VERIFY CALLER   X16216800
                                        IS AUTHORIZED TO THE VOLUME    X16216900
                                        FOR SCRATCHING VTOC INDEX      X16217000
                                        DATA SET                        16217100
SCRASF13 EQU   19                       INVOKE RACF TO VERIFY CALLER   X16217200
                                        IS AUTHORIZED TO THE VOLUME    X16217300
                                        AFTER RACHECK OF DATA SET      X16217400
                                        WITH GENERIC PROFILE FAILED     16217500
SCRASF14 EQU   20                       READ FMT4 & FMT1 DSCB'S         16217600
SCRASF15 EQU   21                       INVOKE CVAFDIR - READ INDEX    X16217700
                                        MAPS, HIGH LEVEL VIER AND      X16217800
                                        FMT4 DSCB                       16217900
SCRASF16 EQU   22                       INVOKE CVAFVRF - CHECK FOR     X16218000
                                        VRF DATA IN THE VIXM            16218100
SCRASF17 EQU   23                       CHANNEL PROGRAM ISSUED TO READ X16218200
                                        FMT4 & FMT1 DSCB'S AFTER       X16218300
                                        IGGVRF00 DISABLED THE VTOC     X16218400
                                        INDEX                           16218500
SCRASF18 EQU   24                       READ DSCB'S AND CHECK CALLER'S X16218600
                                        AUTHORITY                       16218700
SCRASF19 EQU   25                       INVOKE CVAFDSM - DELETE DATA   X16218800
                                        SET NAME FROM INDEX             16218900
SCRASF1A EQU   26                       INVOKE CVAFDIR - READ FMT1     X16219000
                                        DSCB                            16219100
SCRASF1B EQU   27                       INVOKE CVAFDIR - READ FMT4     X16219200
                                        DSCB                            16219300
SCRASF1C EQU   28                       INVOKE CVAFDIR - WRITE FMT4    X16219400
                                        DSCB                            16219500
SCRASF1D EQU   29                       INVOKE CVAFDIR - RELEASE       X16219600
                                        BUFFERS                         16219700
SCRASF1E EQU   30                       READ FMT6 DSCB                  16219800
SCRASF1F EQU   31                       WRITE FMT6 DSCB                 16219900
SCRASF20 EQU   32                       WRITE FMT0 DSCB                 16220000
SCRASF21 EQU   33                       READ FIRST FMT5 DSCB            16220100
SCRASF22 EQU   34                       UPDATE FMT6 DSCB                16220200
SCRASF23 EQU   35                       READ FMT5 DSCB                  16220300
SCRASF24 EQU   36                       WRITE FMT5 DSCB                 16220400
SCRASF25 EQU   37                       READ FMT0 DSCB                  16220500
SCRASF26 EQU   38                       WRITE FMT4 DSCB, SENSE AVAIL    16220600
SCRASF27 EQU   39                       INVOKE IGG0290F TO DEMOUNT/    X16220700
                                        MOUNT/VERIFY VOLUME             16220800
SCRASF28 EQU   40                       LOCATE VOLUME TO BE PROCESSED   16220900
SCRASF29 EQU   41                       REMOVE DSCB'S                   16221000
SCRASF2A EQU   42                       INVOKE CVAFDIR - READ FMT2/FMT3X16221100
                                        DSCB'S                          16221200
SCRASF2B EQU   43                       INVOKE CVAFVRF - WRITE VRF DATAX16221300
                                        TO INDEX MAP                    16221400
SCRASF2C EQU   44                       INVOKE CVAFDIR - WRITE BUFFER  X16221500
                                        LISTS TO THE VOLUME             16221600
SCRASF2D EQU   45                       INVOKE CVAFDIR - ZERO OUT ALL  X16221700
                                        FMT1/FMT2/FMT3 DSCB'S           16221800
SCRASF2E EQU   46                       INVOKE CVAFDSM - RELEASE       X16221900
                                        VOLUME SPACE TO THE VPSM        16222000
SCRASF2F EQU   47                       INVOKE CVAFVRF - ZERO OUT VRF  X16222100
                                        DATA                            16222200
SCRASF30 EQU   48                       INVOKE CVAFDIR - WRITE INDEX   X16222300
                                        MAPS AND VIXM TO VOLUME         16222400
SCRASF31 EQU   49                       INVOKE CVAFDIR - READ          X16222500
                                        FMT5/FMT6 DSCB'S                16222600
SCRASF32 EQU   50                       INVOKE CVAFDIR - WRITE FMT4    X16222700
                                        DSCB TO DISABLE INDEXED VTOC    16222800
SCRASF33 EQU   51                       INVOKE CVAFDIR - WRITE FMT4    X16222900
                                        DSCB WITH DS4DOSBT 'ON' FOR    X16223000
                                        OS VTOC                         16223100
SCRASF34 EQU   52                       INVOKE CVAFDIR - WRITE FMT4    X16223200
                                        DSCB FOR OS VTOC AFTER REQUEST X16223300
                                        REJECTED BY PREPROCESSING EXIT  16223400
SCRASF35 EQU   53                       INVOKE CVAFDIR - WRITE FMT4    X16223500
                                        DSCB IF MORE THAN 5 TRACKS ARE X16223600
                                        BEING ERASED                    16223700
SCRASF36 EQU   54                       INVOKE RACF TO VERIFY CALLER   X16223800
                                        IS AUTHORIZED TO THE DATA SET   16223900
SCRASF37 EQU   55                       INVOKE RACF TO VERIFY CALLER   X16224000
                                        IS AUTHORIZED TO THE DATA SET  X16224100
                                        & TO RETURN ERASE STATUS        16224200
SCRASF38 EQU   56                       INVOKE RACF TO VERIFY CALLER   X16224300
                                        IS AUTHORIZED TO THE VOLUME    X16224400
                                        AFTER RACHECK OF DATA SET      X16224500
                                        WITH DISCRETE PROFILE FAILED    16224600
SCRASF39 EQU   57                       CHANNEL PROGRAM ISSUED TO READ X16224700
                                        FMT4 & FMT1 DSCB'S AFTER       X16224800
                                        THE VTOC INDEX WAS DISABLED     16224900
SCRASF3A EQU   58                       INVOKE CVAFDIR - WRITE FMT4    X16225000
                                        DSCB FOR OS VTOC AFTER ERASE   X16225100
                                        FAILURE                         16225200
SCRASF3B EQU   59                       VALIDATE PARMLIST AT ENTRY TO  X16225300
                                        SCRATCH SVC                     16225400
SCRASF3C EQU   60                       INVOKE CVAFDIR - REWRITE       X16225500
                                        FMT4 DSCB WITH DS4DOSBT        X16225600
                                        BIT 'ON' - DATA SET WITH       X16225700
                                        INCORRECT NUMBER OF EXTENTS    X16225800
                                        FOUND                           16225900
SCRASF3D EQU   61                       INVOKE SMSX TO DESTROY PDSE@P9CX16226000
                                        DIRECTORY                  @L1A 16226100
SCRASF3E EQU   62                       ERROR CONVERTING EDT FROM NEW  X16226200
                                        FORMAT TO OLD              @L2A 16226300
SCRASF3F EQU   63                       ERROR CONVERTING CCHH TO RTA   X16226400
                                        FORMAT                     @L2A 16226500
SCRASF40 EQU   64                       ERROR SORTING THE EDT      @L2A 16226600
SCRASF41 EQU   65                       ERROR CONVERTING EDT TO F5     X16226700
                                        DSCB FORMAT ENTRIES        @L2A 16226800
SCRASF42 EQU   66                       ERROR CONVERTING EDT TO F7     X16226900
                                        DSCB FORMAT ENTRIES        @L2A 16227000
SCRASF43 EQU   67                       ERROR CONVERTING F5 DSCB       X16227100
                                        ENTRIES TO EDT FORMAT      @L2A 16227200
SCRASF44 EQU   68                       ERROR CONVERTING F7 DSCB       X16227300
                                        ENTRIES TO EDT FORMAT      @L2A 16227400
SCRASF45 EQU   69                  WRITE FMT4 DSCB, ECB/CSW AVAIL @P10A 16227500
SCRASF46 EQU   70                       INVOKE Capture_Ucb proc    @L3A 16227600
SCRASF47 EQU   71                       Erase I/O error            @05A 16227700
*********************************************************************** 16227800
*  SUBFUNCTION REASON CODES                                           * 16227900
*********************************************************************** 16228000
SCRARS01 EQU   1                        ADDRESS OF SVC ENTRY PARMLIST  X16228100
                                        IS ZERO                         16228200
SCRARS02 EQU   2                        IN THE SVC ENTRY PARMLIST,     X16228300
                                        EITHER THE ADDR OF THE DATA SETX16228400
                                        NAME OR THE ADDR OF THE VOLUME X16228500
                                        LIST IS ZERO                    16228600
SCRARS03 EQU   3                        VALIDATION OF THE RANGE OF     X16228700
                                        ADDRESSES OCCUPIED BY THE      X16228800
                                        VOLUME LIST FAILED              16228900
SCRARS04 EQU   4                        COUNT OF VOLUME IN THE VOLUME  X16229000
                                        LIST IS <= ZERO                 16229100
SCRARS05 EQU   5                        LOGICAL ERROR ON SSI CALL -    X16229200
                                        BAD SSOB FORMAT, LENGTH, ETC.   16229300
SCRARS06 EQU   6                        INVALID DASPLID FIELD-ID        16229400
SCRARS07 EQU   7                        INVALID DASPVER FIELD-VERSION   16229500
SCRARS08 EQU   8                        INVALID DASPLEN FIELD-LENGTH    16229600
SCRARS09 EQU   9                        DASSKRSV MUST BE ZERO           16229700
SCRARS0A EQU   10                       FLAG DASVRFRD IS 'ON' BUT      X16229800
                                        DASREFDT IS ZERO                16229900
SCRARS0B EQU   11                       DASAVOLL IS ZERO                16230000
SCRARS0C EQU   12                       DASADSN IS ZERO                 16230100
SCRARS0D EQU   13                       DASRSRV1 MUST BE ZERO           16230200
SCRARS0E EQU   14                       DASRSRV2 MUST BE ZERO           16230300
SCRARS0F EQU   15                       DASRSRV3 MUST BE ZERO           16230400
SCRARS10 EQU   16                       DASRSRV4 MUST BE ZERO           16230500
SCRARS11 EQU   17                       DASRSRV5 MUST BE ZERO           16230600
SCRARS12 EQU   18                       DASRSRV6 MUST BE ZERO           16230700
SCRARS13 EQU   19                       DASRSRV7 MUST BE ZERO           16230800
SCRARS14 EQU   20                       DASPKEY VALUE INVALID FOR      X16230900
                                        UPDATING FIELDS IN CALLER'S    X16231000
                                        DASCR                           16231100
SCRARS15 EQU   21                       INVALID DAVLLID FIELD-ID        16231200
SCRARS16 EQU   22                       INVALID DAVLVER FIELD-VERSION   16231300
SCRARS17 EQU   23                       INVALID DAVLLEN FIELD-LENGTH    16231400
SCRARS18 EQU   24                       DAVSKRSV MUST BE ZERO           16231500
SCRARS19 EQU   25                       DAVRSRV1 MUST BE ZERO           16231600
SCRARS1A EQU   26                       DAVRSRV2 MUST BE ZERO           16231700
SCRARS1B EQU   27                       DAVLKEY VALUE INVALID FOR      X16231800
                                        UPDATING FIELDS IN CALLER'S    X16231900
                                        DAVLL                           16232000
SCRARS1C EQU   28                       SMS VOLUME ERROR - FMT1 DSCB   X16232100
                                        INDICATES SMS MANAGED BUT FMT4 X16232200
                                        DSCB SHOWS NOT SMS         @P8C 16232300
SCRARS1D EQU   29                       SMS DATA SET ERROR - CALLER    X16232400
                                        INDICATES SMS MANAGED BUT FMT1 X16232500
                                        DSCB DOESN'T                    16232600
SCRARS1E EQU   30                       CALLER INDICATES NO BCS ENTRY  X16232700
                                        BUT FMT1 DSCB DOESN'T      @P7C 16232800
SCRARS1F EQU   31                       CALLER INDICATES CATALOGED     X16232900
                                        BUT FMT1 DSCB DOESN'T      @P7C 16233000
SCRARS20 EQU   32                       SMS VOLUME ERROR - CALLER      X16233100
                                        INDICATES NOT SMS MANAGED BUT  X16233200
                                        FMT4 DSCB INDICATES VOLUME IS  X16233300
                                        SMS MANAGED                     16233400
SCRARS21 EQU   33                       RESERVED                   @P1C 16233500
SCRARS22 EQU   34                       LAST REFERENCED DATE PASSED    X16233600
                                        BY CALLER DOES NOT MATCH THE   X16233700
                                        DATE IN FIELD DS1REFD IN       X16233800
                                        THE FMT1 DSCB                   16233900
SCRARS23 EQU   35                       CALLER INDICATES NOT SMS       X16234000
                                        MANAGED BUT FMT1 DSCB SHOWS    X16234100
                                        SMS                        @P7C 16234200
SCRARS24 EQU   36                       ENQUEUE ON TIOT FAILED          16234300
SCRARS25 EQU   37                       ENQUEUE ON SYSDSN FAILED        16234400
SCRARS26 EQU   38                       ENQUEUE ON CVOL NAME           X16234500
                                        'SYSCTLG.VXXXXXX' FAILED        16234600
SCRARS27 EQU   39                       DSAB OPEN COUNT (DSABOPCT) FOR X16234700
                                        VIO DATA SET IS NOT ZERO        16234800
SCRARS28 EQU   40                       UCB DATA MANAGEMENT COUNT      X16234900
                                        (UCBDMCT) FOR VIO DATA SET IS  X16235000
                                        NOT ZERO                        16235100
SCRARS29 EQU   41                       VOLUME LIST CONTAINS MORE THAN X16235200
                                        ONE VOLUME FOR VIO DATA SET     16235300
SCRARS2A EQU   42                       INPUT UCB ADDRESS IS ZERO       16235400
SCRARS2B EQU   43                       VSCRATCH FAILED FOR VIO DATA   X16235500
                                        SET                             16235600
SCRARS2C EQU   44                       PREPROCESSING EXIT REJECTED    X16235700
                                        REQUEST FOR VIO DATA SET -     X16235800
                                        FIELD DASSFRET CONTAINS THE    X16235900
                                        EXIT RETURN CODE                16236000
SCRARS2D EQU   45                       CCHH OF RECORD TO BE READ/     X16236100
                                        WRITTEN IS < BEGINNING CCHH    X16236200
                                        OF VTOC                         16236300
SCRARS2E EQU   46                       CCHH OF RECORD TO BE READ/     X16236400
                                        WRITTEN IS > ENDING CCHH       X16236500
                                        OF VTOC                         16236600
SCRARS2F EQU   47                       COUNT OF NUMBER OF EXTENTS     X16236700
                                        INDICATES NEW FMT5 IS ALREADY  X16236800
                                        FULL                            16236900
SCRARS30 EQU   48                       PGFIX OF I/O WORKAREA FAILED    16237000
SCRARS31 EQU   49                       I/O ERROR DURING VRF RECOVERY  X16237100
                                        ROUTINE EXECUTION               16237200
SCRARS32 EQU   50                       OS VTOC - DATA SET FOUND BUT   X16237300
                                        FMT1 DSCB ID IS INVALID         16237400
SCRARS33 EQU   51                       INDEXED VTOC - DATA SET IN     X16237500
                                        INDEX BUT NO FMT1 DSCB FOUND    16237600
SCRARS34 EQU   52                       SECLOADA FAILED REQUEST         16237700
SCRARS35 EQU   53                       CALLER NOT FUNCTIONALLY        X16237800
                                        AUTHORIZED TO SCRATCH VTOC     X16237900
                                        INDEX DATA SET                  16238000
SCRARS36 EQU   54                       CANNOT SCRATCH VTOC INDEX DATA X16238100
                                        SET ON AN INDEXED VTOC VOLUME   16238200
SCRARS37 EQU   55                       FIRST SPLIT CYLINDER EXTENT    X16238300
                                        BELONGING TO DATA SET IS <     X16238400
                                        LOWEST CCHH IN FIRST FMT6 DSCB  16238500
SCRARS38 EQU   56                       VOLSER FROM VOLUME LIST IS     X16238600
                                        ZERO                            16238700
SCRARS39 EQU   57                       VOLUME NOT MOUNTED ON ANY      X16238800
                                        ONLINE, SHAREABLE DASD UNIT     16238900
SCRARS3A EQU   58                       DEVICE TYPE OF VOLUME FROM     X16239000
                                        VOLUME LIST DOES NOT MATCH UCB X16239100
                                        DEVICE TYPE OF UNIT ON WHICH   X16239200
                                        VOLUME RESIDES                  16239300
SCRARS3B EQU   59                       DEVICE ON WHICH CURRENT VOLUME X16239400
                                        IS MOUNTED IS NOT READY         16239500
SCRARS3C EQU   60                       FMT1 INDICATES DATA SET HAS    X16239600
                                        MORE THAN 3 EXTENTS BUT FMT3   X16239700
                                        CCHHR ADDRESS IN FMT1 IS ZERO   16239800
SCRARS3D EQU   61                       PREPROCESSING EXIT REJECTED    X16239900
                                        REQUEST - FIELD DASSFRET       X16240000
                                        CONTAINS THE EXIT RETURN CODE   16240100
SCRARS3E EQU   62                       DSCB POINTED TO FROM FMT1 IS   X16240200
                                        NEITHER A FMT2 NOR FMT3 DSCB    16240300
SCRARS3F EQU   63                       NUMBER OF FMT0 DSCB'S IS <     X16240400
                                        NUMBER NEEDED TO DESCRIBE      X16240500
                                        EXTENTS BEING FREED             16240600
SCRARS40 EQU   64                       DEB FOUND OPEN TO DATA SET     X16240700
                                        BEING SCRATCHED                 16240800
SCRARS41 EQU   65                       VOLUME COULD NOT BE DEMOUNTED   16240900
SCRARS42 EQU   66                       VOLUME COULD NOT BE MOUNTED     16241000
SCRARS43 EQU   67                       I/O ERROR OCCURRED WHEN        X16241100
                                        READING THE VOLUME LABEL        16241200
SCRARS44 EQU   68                       OS VTOC - FMT1 DSCB NOT        X16241300
                                        FOUND ON VOLUME                 16241400
SCRARS45 EQU   69                       STORAGE PROTECTION VALIDATION  X16241500
                                        FAILED FOR PARMLIST             16241600
SCRARS46 EQU   70                       STORAGE PROTECTION VALIDATION  X16241700
                                        FAILED FOR DATA SET NAME        16241800
SCRARS47 EQU   71                       DASRSRV8 MUST BE ZERO      @P1A 16241900
SCRARS48 EQU   72                       STORAGE PROTECTION VALIDATION  X16242000
                                        FAILED FOR PASSED UCB          X16242100
                                        ADDRESS                    @P2A 16242200
SCRARS49 EQU   73                       UCBID OF PASSED UCB IS         X16242300
                                        INVALID                    @P2A 16242400
SCRARS4A EQU   74                       DEVICE TYPE IN VOLUME LIST     X16242500
                                        ENTRY OR IN PASSED UCB         X16242600
                                        INDICATES DEVICE IS NOT        X16242700
                                        DASD                       @P4A 16242800
SCRARS4B EQU   75                       DATA SET UNEXPIRED         @P6A 16242900
SCRARS4C EQU   76                       DATA SET IS A TEMPORARY, VSAM  X16243000
                                        DATA SET                   @P7A 16243100
*                                                                       16243200
.S3X     ANOP                                                           16243300
.*                                                                      16243400
.********************************************************************** 16243500
.* SECTION (4): SCRATCH STATUS CODES                                    16243600
.********************************************************************** 16243700
.*                                                                      16243800
.S4      AIF   (&ALLSECT).S4B                                           16243900
         AIF   (NOT &SFLG(4)).S4X                                       16244000
         AIF   (NOT &GDSECT).S4C                                        16244100
&GDSECT  SETB  0                                                        16244200
         AIF   (&NODSECT).S4B                                           16244300
&LBL     DSECT                                                          16244400
         AGO   .S4C                                                     16244500
.S4B     ANOP                                                           16244600
&LBL     DS    0F                                                       16244700
.S4C     ANOP                                                           16244800
*********************************************************************** 16244900
*  SCRATCH STATUS CODES                                               * 16245000
*********************************************************************** 16245100
DASSTC00 EQU   0                        SUCCESSFUL SCRATCH              16245200
DASSTC01 EQU   1                        DSCB NOT FOUND IN VTOC          16245300
DASSTC02 EQU   2                        VERIFICATION FAILURE.      @P5A 16245400
*                                       THIS CODE CAN RESULT FROM: @P5A 16245500
*                                        - PASSWORD DIFFICULTY     @P5C 16245600
*                                        - SMS VALIDATION FAILURE  @P5M 16245700
*                                        - VERIFY OF LAST REFERENCED    16245800
*                                          DATE FAILED             @P5M 16245900
DASSTC03 EQU   3                        UNEXPIRED PURGE DATE            16246000
DASSTC04 EQU   4                        I/O ERROR OR VALIDATION         16246100
*                                       FAILURE.  THIS CODE CAN RESULT  16246200
*                                       FROM:                           16246300
*                                        - NONZERO RETURN CODE FROM     16246400
*                                          VSCRATCH                     16246500
*                                        - REQUEST REJECTED BY          16246600
*                                          INSTALLATION EXIT            16246700
*                                        - I/O ERROR ACCESSING VTOC     16246900
*                                          OR VTOC INDEX                16247100
*                                        - STRUCTURE ERROR IN VTOC      16247300
*                                          INDEX                        16247500
*                                        - I/O ERROR WHILE ERASING      16247700
*                                          TRACKS                       16247900
*                                        - ERROR DETECTED BY MACRO@04A  16248000
*                                          IGGDAEDS OR IGGDADTS.  @04A  16248100
*                                          SUCH ERRORS COULD      @04A  16248200
*                                          RESULT IN I/O ERROR    @04A  16248300
*                                          IF PROCESSING CONTINUES@04A  16248400
*                                                                 3@P5D 16248500
DASSTC05 EQU   5                        APPROPRIATE UCB UNAVAILABLE     16248600
DASSTC06 EQU   6                        OPERATOR UNABLE TO MOUNT        16248700
*                                       VOLUME                          16248800
DASSTC07 EQU   7                        DATA SET IS OPEN                16248900
DASSTC08 EQU   8                        INSUFFICIENT RACF AUTHORITY     16249100
*                                                                       16249300
*********************************************************************** 16253500
*  SCRATCH SECONDARY STATUS CODE                                  @01A* 16257700
*********************************************************************** 16261900
DASSSC80 EQU   128                      AT LEAST ONE ENTRY IN      @03C 16266100
*                                       VOLUME LIST WAS PROTECTED  @01A 16270300
*                                       BY RACF AND CALLER WAS     @01A 16274500
*                                       AUTHORIZED.  EXCEPTION IS  @01A 16278700
*                                       DASDVOL AUTHORIZATION.     @01A 16282900
*                                                                       16287100
.S4X     ANOP                                                           16291300
.FINISH  ANOP                                                           16295500
         MEND */  %PLSDASCX: ;                                          16300000
