* %GOTO PLSDACR1; /*                                                    00050000
         MACRO                                                          00100000
&L       IGGDACRE &MF=D,&DSECT=YES                                      00150000
         AGO   .DACRASM                                                 00200000
*         */                                                            00250000
* %PLSDACR1: ;                                                          00300000
*/********************************************************************/ 00350000
*/*$MAC(IGGDACRE):                                                   */ 00400000
*/*                                                                  */ 00450000
*/*  MACRO NAME: IGGDACRE                                            */ 00500000
*/*                                                                  */ 00550000
*/*  DESCRIPTION: MAPS DADSM CREATE BRANCH ENTRY PARAMETER LIST      */ 00600000
*/*                                                                  */ 00650000
*/*  STATUS: DFSMS/MVS 1.5.0                                     @L8C*/ 00700000
*/*                                                                  */ 00750000
*/*PROPRIETARY V3 STATEMENT                                          */ 00800000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00850000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00900000
*/*5695-DF1                                                          */ 00950000
*/*(C) COPYRIGHT 1988,1994  IBM CORP.                                */ 01000000
*/*END PROPRIETARY V3 STATEMENT                                      */ 01050000
*/*                                                                  */ 01100000
*/*  FUNCTION: THIS MACRO PROVIDES AN INTERFACE TO THE DADSM         */ 01150000
*/*    CREATE BRANCH ENTRY.  IT PROVIDES AN ASSEMBLER (MF=D) AND     */ 01200000
*/*    PLS (%INCLUDE) MAPPING OF THE BRANCH ENTRY PARAMETER LIST.    */ 01250000
*/*                                                                  */ 01253800
*/*  Meaning of some of the Parameter list indicators:           @15A*/ 01257600
*/*                                                                  */ 01261400
*/*    DACLRGEX : This indicator is set on when the best-fit     @15A*/ 01265200
*/*               interface is to be used.  It is valid only     @15A*/ 01269000
*/*               1) on the MDSCB path and then only for KB/MB   @15A*/ 01272800
*/*                  requests.  Currently, SMS and DFDSS use     @15A*/ 01276600
*/*                  this path for non-VSAM data set requests.   @15A*/ 01280400
*/*               2) on the JFCB path, and then only for TRK     @15A*/ 01284200
*/*                  or CYL requests.  Currently, Catalog uses   @15A*/ 01288000
*/*                  this path for VSAM data set requests.  The  @15A*/ 01291800
*/*                  only VSAM data sets that apply are KSDS.    @15A*/ 01295600
*/*                                                                  */ 01300000
*/*  NOTES:                                                          */ 01350000
*/*                                                                  */ 01400000
*/*    DEPENDENCIES: NONE                                            */ 01450000
*/*    RESTRICTIONS: NONE                                            */ 01500000
*/*                                                                  */ 01550000
*/*  MACRO:                                                          */ 01600000
*/*                                                                  */ 01650000
*/*    PROCESSOR: PL/AS, PLS/3, OR ASSEMBLER H                       */ 01700000
*/*    MACRO SIZE: 500                                               */ 01750000
*/*    DISTRIBUTION LIBRARY: AMODGEN                                 */ 01800000
*/*    ATTRIBUTES: INCLUDE, MF=D                                     */ 01850000
*/*                                                                  */ 01900000
*/*  ENTRY POINT: IGGDACRE                                           */ 01950000
*/*                                                                  */ 02000000
*/*    PURPOSE: MAPS DADSM CREATE BRANCH ENTRY PARAMETER LIST        */ 02050000
*/*    LINKAGE: %INCLUDE SYSLIB(IGGDACRE) OR IGGDACRE MF=D           */ 02100000
*/*    INPUT:                                                        */ 02150000
*/*      SYMBOLIC NAME: PL/AS OR PLS/3                               */ 02200000
*/*        DESCRIPTION: PROVIDES A VARIABLE MAPPING FOR MODULES      */ 02250000
*/*        WRITTEN IN PLS.                                           */ 02300000
*/*                                                                  */ 02350000
*/*        IN THE FOLLOWING EXAMPLES, COLONS HAVE BEEN USED IN       */ 02400000
*/*        PLACE OF SEMICOLONS TO AVOID COMPILER MESSAGES.           */ 02450000
*/*                                                                  */ 02500000
*/*        ALL SECTIONS MAY BE INCLUDED BY SPECIFYING:               */ 02550000
*/*                                                                  */ 02600000
*/*           DCL DACREPTR PTR(31):                                  */ 02650000
*/*           %INCLUDE SYSLIB(IGGDACRE):                             */ 02700000
*/*                OR                                                */ 02750000
*/*           DCL DACREPTR PTR(31):                                  */ 02800000
*/*           %DCL DAC_PL CHAR:                                      */ 02850000
*/*           %DAC_PL = '':                                          */ 02900000
*/*           %INCLUDE SYSLIB(IGGDACRE):                             */ 02950000
*/*                                                                  */ 03000000
*/*        THE DACREPTR PLS VARIABLE IS USED AS THE BASE ADDRESS     */ 03050000
*/*        FOR THE COMMON PORTION OF THE DADSM CREATE BRANCH ENTRY   */ 03100000
*/*        PARAMETER LIST.  IT NEED NOT BE DECLARED IF THE COMMON    */ 03150000
*/*        PORTION OF THE PARAMETER LIST IS NOT TO BE INCLUDED OR    */ 03200000
*/*        BASED.                                                    */ 03250000
*/*                                                                  */ 03300000
*/*        THE FOLLOWING FEATURES ARE PROVIDED BY THE MACRO:         */ 03350000
*/*        %DAC_BASE   = 'N' OR 'NO', CAUSES THE MACRO TO GENERATE   */ 03400000
*/*                    THE COMMON PORTION AND/OR EXTENSION OF THE    */ 03450000
*/*                    PARAMETER LIST WITHOUT THE 'BASED'            */ 03500000
*/*                    ATTRIBUTE.                                    */ 03550000
*/*        %DAC_LIKE   = 'Y', CAUSES THE MACRO TO BE COMPATIBLE      */ 03600000
*/*                    WITH THE PLAS LIKE FEATURE.                   */ 03650000
*/*                                                                  */ 03700000
*/*        TO ONLY INCLUDE THE DESIRED INDIVIDUAL SECTIONS THE       */ 03750000
*/*        FOLLOWING COMPILE VARIABLES HAVE TO BE SPECIFIED BEFORE   */ 03800000
*/*        INCLUDING IGGDACRE:                                       */ 03850000
*/*        %DAC_PL     DADSM CREATE BRANCH ENTRY PARAMETER LIST.     */ 03886600
*/*                    IF %DAC_PL IS NOT SPECIFIED OR IF IT IS SET   */ 03923200
*/*                    TO '' (NULL), THE PARAMETER LIST WILL BE      */ 03959800
*/*                    INCLUDED (THIS IS THE DEFAULT).  IF THE       */ 03996400
*/*                    PARAMETER LIST AS WELL AS THE RETURN CODES    */ 04033000
*/*                    CODES, AND THE SUBFUNCTION CODES ARE          */ 04069600
*/*                    DESIRED, SPECIFY:                             */ 04106200
*/*                       %DAC_PL='Y'                                */ 04142800
*/*                       %DAC_RC='Y'                                */ 04179400
*/*                       %DAC_SF='Y'                                */ 04216000
*/*                    IF ONLY ONE OR ALL OF THE RETURN CODES OR     */ 04289200
*/*                    SUBFUNCTION CODES SECTIONS ARE DESIRED,       */ 04325800
*/*                    SET %DAC_PL TO 'N' OR 'NO'.                   */ 04362400
*/*        %DAC_PLX    THE DACRE PARAMETER LIST EXTENSION        @L8A*/ 04381200
*/*        %DAC_JFCB   THE JFCB INTERFACE PARAMETER LIST             */ 04400000
*/*                    EXTENSION.                                    */ 04450000
*/*        %DAC_MDSC   THE MODEL DSCB INTERFACE PARAMETER LIST       */ 04500000
*/*                    EXTENSION.                                    */ 04550000
*/*        %DAC_ADSC   THE ABSOLUTE DSCB INTERFACE PARAMETER LIST    */ 04600000
*/*                    EXTENSION.                                    */ 04650000
*/*        %DAC_RETA   THE RETURN AREA EXTENSION.                    */ 04700000
*/*        %DAC_RC     RETURN CODES (HISTORIC RETURN CODES, ERROR    */ 04750000
*/*                    CODES)                                        */ 04800000
*/*        %DAC_SF     SUBFUNCTION CODES (SUBFUNCTION ID'S,          */ 04816600
*/*                    SUBFUNCTION REASON CODES)                     */ 04833200
*/*                                                                  */ 04850000
*/*        TO CONTROL THE APPEARANCE OF THE DESIRED INDIVIDUAL       */ 04851300
*/*        SECTIONS IN THE COMPILE LISTING, THE COMPILE              */ 04852600
*/*        VARIABLE WHICH WILL CAUSE THAT SECTION TO BE INCLUDED     */ 04853900
*/*        MUST HAVE BEEN SPECIFIED.  THEN THE FOLLOWING LIST CONTROL*/ 04855200
*/*        COMPILE VARIABLES HAVE TO BE SPECIFIED BEFORE             */ 04856500
*/*        INCLUDING IGGDACRE:                                       */ 04857800
*/*        %DAC_PLL    DADSM CREATE BRANCH ENTRY PARAMETER LIST      */ 04859100
*/*                    LISTING CONTROL VARIABLE.  IF %DAC_PLL IS     */ 04860400
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 04861700
*/*                    THE PARAMETER LIST WILL APPEAR IN THE         */ 04863000
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 04864300
*/*                                                                  */ 04865600
*/*                    SET %DAC_PLL TO 'N' OR 'NO' IF THE PARAMETER  */ 04866900
*/*                    LIST IS NOT TO APPEAR IN THE COMPILE LISTING. */ 04868200
*/*                                                                  */ 04869500
*/*        %DAC_RCL    RETURN CODES (HISTORIC RETURN/ERROR CODES)    */ 04870800
*/*                    LISTING CONTROL VARIABLE.  IF %DAC_RCL IS     */ 04872100
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 04873400
*/*                    THE RETURN CODES WILL APPEAR IN THE           */ 04874700
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 04876000
*/*                                                                  */ 04877300
*/*                    SET %DAC_RCL TO 'N' OR 'NO' IF THE RETURN     */ 04878600
*/*                    CODES ARE NOT TO APPEAR IN THE COMPILE        */ 04879900
*/*                    LISTING.                                      */ 04881200
*/*                                                                  */ 04882500
*/*        %DAC_SFL    SUBFUNCTION ID'S AND SUBFUNCTION REASON CODES */ 04883800
*/*                    LISTING CONTROL VARIABLE.  IF %DAC_SFL IS     */ 04885100
*/*                    NOT SPECIFIED OR IF IT IS SET TO '' (NULL)    */ 04886400
*/*                    THE SUBFUNCTION CODES WILL APPEAR IN THE      */ 04887700
*/*                    COMPILE LISTING (THIS IS THE DEFAULT).        */ 04889000
*/*                                                                  */ 04890300
*/*                    SET %DAC_SFL TO 'N' OR 'NO' IF THE SUBFUNCTION*/ 04891600
*/*                    CODES ARE NOT TO APPEAR IN THE COMPILE        */ 04892900
*/*                    LISTING.                                      */ 04894200
*/*                                                                  */ 04895500
*/*                                                                  */ 04896800
*/*        AN EXAMPLE FOLLOWS:                                       */ 04900000
*/*                                                                  */ 04950000
*/*        1.  INCLUDE PARAMETER LIST (WITH JFCB INTERFACE EXTENSION */ 04980000
*/*            AND THE RETURN AREA) AND SUBFUNCTION CODES SECTION.   */ 05010000
*/*            ONLY THE PARAMETER LIST WILL APPEAR IN THE COMPILE    */ 05040000
*/*            LISTING.                                              */ 05070000
*/*                                                                  */ 05100000
*/*            NOTE:  THE PARAMETER LIST HAS TO BE EXPLICITLY        */ 05150000
*/*            INCLUDED OTHERWISE ALL SECTIONS WILL BE               */ 05200000
*/*            INCLUDED (DEFAULT IS TO INCLUDE ALL SECTIONS IF       */ 05250000
*/*            %DAC_PL IS NOT SPECIFIED OR IS SET TO '' (NULL)).     */ 05300000
*/*                                                                  */ 05350000
*/*                     %DCL DAC_PL CHAR:                            */ 05400000
*/*                     %DAC_PL = 'Y':                               */ 05450000
*/*                     %DCL DAC_JFCB CHAR:                          */ 05500000
*/*                     %DAC_JFCB = 'Y':                             */ 05550000
*/*                     %DCL DAC_RETA CHAR:                          */ 05600000
*/*                     %DAC_RETA = 'Y':                             */ 05650000
*/*                     %DCL DAC_SF CHAR:                            */ 05660000
*/*                     %DAC_SF = 'Y':                               */ 05670000
*/*                     %DCL DAC_SFL CHAR:                           */ 05680000
*/*                     %DAC_SFL = 'N':                              */ 05690000
*/*                     %INCLUDE SYSLIB(IGGDACRE):                   */ 05700000
*/*                                                                  */ 05750000
*/*      SYMBOLIC NAME: ASSEMBLER H                                  */ 05800000
*/*        DESCRIPTION: PROVIDES A VARIABLE MAPPING FOR MODULES      */ 05850000
*/*        WRITTEN IN ASSEMBLER H.                                   */ 05900000
*/*                                                                  */ 05950000
*/*        ALL SECTIONS MAY BE GENERATED BY SPECIFYING:              */ 06000000
*/*                                                                  */ 06050000
*/*           <LABEL> IGGDACRE MF=D                                  */ 06100000
*/*                                                                  */ 06150000
*/*        THE FOLLOWING FEATURES ARE PROVIDED BY THIS MACRO:        */ 06200000
*/*        DSECT   =YES, THE MACRO WILL GENERATE A 'DSECT'           */ 06250000
*/*                STATEMENT AT THE START OF THE SECTION TO BE       */ 06300000
*/*                MAPPED.  (THIS IS THE DEFAULT)                    */ 06350000
*/*                =NO, THE MACRO WILL NOT GENERATE A 'DSECT'        */ 06400000
*/*                STATEMENT.                                        */ 06450000
*/*                                                                  */ 06500000
*/*        TO ONLY GENERATE THE DESIRED INDIVIDUAL SECTIONS, THE     */ 06550000
*/*        MF KEYWORD SHOULD BE SET TO THE FOLLOWING:                */ 06600000
*/*        MF=(D,PL)      COMMON PORTION OF THE DADSM CREATE         */ 06650000
*/*                       BRANCH ENTRY PARAMETER LIST.               */ 06700000
*/*        MF=(D,PLX)     DACRE EXTENSION.                       @L8A*/ 06725000
*/*        MF=(D,JFCB)    JFCB INTERFACE EXTENSION.                  */ 06750000
*/*        MF=(D,MDSCB)   MODEL DSCB INTERFACE EXTENSION.            */ 06800000
*/*        MF=(D,ADSCB)   ABSOLUTE DSCB INTERFACE EXTENSION.         */ 06850000
*/*        MF=(D,RETA)    DADSM CREATE RETURN AREA.                  */ 06900000
*/*        MF=(D,RC)      DADSM CREATE HISTORIC RETURN CODES AND     */ 06920000
*/*                       ERROR CODES                                */ 06940000
*/*        MF=(D,SF)      DADSM CREATE SUBFUNCTION ID'S AND          */ 06960000
*/*                       SUBFUNCTION REASON CODES                   */ 06980000
*/*                                                                  */ 07000000
*/*        AN EXAMPLE FOLLOWS:                                       */ 07050000
*/*                                                                  */ 07100000
*/*        1.  INCLUDE COMMON SECTION, JFCB INTERFACE EXTENSION,     */ 07200000
*/*            RETURN AREA EXTENSION, AND CREATE RETURN CODES.       */ 07250000
*/*                                                                  */ 07300000
*/*                   <LABEL1> IGGDACRE MF=(D,PL)                    */ 07350000
*/*                   <LABEL2> IGGDACRE MF=(D,JFCB)                  */ 07400000
*/*                   <LABEL3> IGGDACRE MF=(D,RETA)                  */ 07450000
*/*                   <LABEL2> IGGDACRE MF=(D,RC)                    */ 07475000
*/*                                                                  */ 07500000
*/*    OUTPUT:                                                       */ 07550000
*/*        NONE.                                                     */ 07600000
*/*                                                                  */ 07650000
*/*  EXIT NORMAL:                                                    */ 07700000
*/*                                                                  */ 07750000
*/*    RETURN CODE: NONE                                             */ 07800000
*/*                                                                  */ 07850000
*/*  EXIT ERRORS:                                                    */ 07900000
*/*                                                                  */ 07950000
*/*      NONE                                                        */ 08000000
*/*                                                                  */ 08050000
*/*  EXTERNAL REFERENCES:                                            */ 08100000
*/*                                                                  */ 08150000
*/*                NONE                                              */ 08200000
*/*                                                                  */ 08250000
*/*  NOTES ON DIAGNOSTIC SUBFUNCTION INFORMATION:                    */ 08300000
*/*                                                                  */ 08400000
*/*  1.FOR THE FOLLOWING RACF SUBFUNCTION ID'S, FIELD DACSFRET       */ 08401500
*/*    WILL CONTAIN THE RACF RETURN CODE AND FIELD DACSFREA WILL     */ 08403000
*/*    CONTAIN THE RACF REASON CODE.                                 */ 08404500
*/*                                                                  */ 08406000
*/*      0D, 0E, 0F, 10, 11                                          */ 08407500
*/*                                                                  */ 08409000
*/*  2.FOR THE FOLLOWING CVAF SUBFUNCTION ID'S, FIELD DACSFRET       */ 08410500
*/*    WILL CONTAIN THE CVAF RETURN CODE AND FIELD DACSFREA WILL     */ 08412000
*/*    CONTAIN THE CVAF STATUS CODE (FROM CVSTAT):                   */ 08413500
*/*                                                                  */ 08415000
*/*      17, 18, 19, 1A, 1B, 1C, 1D, 1E, 1F, 20, 2F, 30,             */ 08416500
*/*      31, 32                                                      */ 08418000
*/*                                                                  */ 08419500
*/*  3.FOR THE FOLLOWING I/O SUBFUNCTION ID'S, IF AN I/O ERROR       */ 08421000
*/*    OCCURS FIELDS DACSFRET AND DACSFREA WILL CONTAIN ONE OF THE   */ 08422500
*/*    FOLLOWING:                                                    */ 08424000
*/*      - THE ECB COMPLETION CODE AND THE CSW CHANNEL STATUS, IF    */ 08425500
*/*        THE ECB COMPLETION CODE DOES NOT INDICATE PERMANENT       */ 08427000
*/*        ERROR (X'41'), OR THE ECB COMPLETION CODE DOES INDICATE   */ 08428500
*/*        PERMANENT ERROR BUT THE CSW CHANNEL STATUS IS NOT         */ 08430000
*/*        ZERO.                                                     */ 08431500
*/*      - THE SENSE BYTES FROM THE IOB, IF THE ECB COMPLETION       */ 08433000
*/*        CODE INDICATES PERMANENT ERROR (X'41') AND THE CSW        */ 08434500
*/*        CHANNEL STATUS IS ZERO.                                   */ 08436000
*/*                                                                  */ 08437500
*/*      21, 24, 26, 27, 28, 29, 2A, 2B, 2E, 34, 35, 36, 37,         */ 08439000
*/*      3C, 3F, 40, 41, 42, 43, 44                                  */ 08440500
*/*                                                                  */ 08442000
*/*  CHANGE ACTIVITY:                                                */ 08443500
*/*$L0=MVS/XA,HDP3310,T86224,STLKAA:  DADSM SUPPORT FOR SMS          */ 08445000
*/*$P1=KJA0755,HDP3310,T86275,STLKAA: ALLOCATE 'N' LARGEST EXTS  @P1A*/ 08445500
*/*$P2=KJA0756,HDP3310,T86294,STLKAA: COMPACT SAVED SECONDARY QTY@P2A*/ 08446000
*/*$P3=KJA0811,HDP3310,T86324,STLKAA: CHECK UNSUPPORTED SMS DATA @P3A*/ 08446100
*/*                                   SET TYPES                  @P3A*/ 08446200
*/*$P4=KJA0770,HDP3310,T86338,STLKAA: ALLOC OF INDEXED SEQ DATA  @P4A*/ 08446300
*/*                                   SET FAILS ON OS VTOC VOLUME@P4A*/ 08446400
*/*$P5=KJA1208,HDP3310,T87008,STLKAA: USE BLKSIZE TO CALCULATE   @P5A*/ 08447300
*/*                                   SPACE                      @P5A*/ 08448200
*/*$P6=KJA2136,HDP3310,T87079,STLKAA: DACMINES PROHIBITED WHEN   @P6A*/ 08448500
*/*                                   MXIG OR ALX SPECIFIED      @P6A*/ 08448800
*/*$P7=KJA2768,HDP3310,T87133,STLKAA: SETUP VOLSER FOR SMS DS    @P7A*/ 08448900
*/*                                   IN MDSCB INTERFACE         @P7A*/ 08449000
*/*$P8=KJA2823,HDP3310,T87154,STLKAA: SETUP BASING FOR MDSCB AND @P8A*/ 08449200
*/*                                   ADSCB INTERFACES           @P8A*/ 08449400
*/*$P9=KJA2737,HDP3310,T87160,STLKAA: SYSTEM DETERMINED BLOCKSIZE@P9A*/ 08449500
*/*$PA=KJB4073,HDP3310,T87274,STLKAA: CALL DASDCALC FOR RECFM=V  @PAA*/ 08449600
*/*                                   DATA SETS                  @PAA*/ 08449700
*/*$PB=KJB4176,HDP3310,T87293,STLKAA: SUPPORT LARGEST EXTENTS FOR@PBA*/ 08459700
*/*                                   MDSCB AND JFCB INTERFACE   @PBA*/ 08469700
*/*$PC=KJB4435,HDP3310,T88004,STLKSC: CORRECT ASSEMBLY ERRORS IN @PCA*/ 08473000
*/*                                   ASSEMBLER SECTION          @PCA*/ 08476300
*/*                                   MDSCB AND JFCB INTERFACE   @PBA*/ 08476700
*/*$L1=MVS/XA,HDP3320,T87300,STLKAA:  DADSM SUPPORT FOR PDSE     @L1A*/ 08477100
*/*$PD=KJB5053,HDP3310,T88217,STLKSC: HSM EXTENT REDUCTION PROB. @PDA*/ 08477500
*/*                                   SUPPORT KB OR MB VALUE     @PDA*/ 08477900
*/*                                   BEING A USABLE DATA QTY.,  @PDA*/ 08478300
*/*                                   RATHER THAN A PHYSICAL     @PDA*/ 08478700
*/*                                   SPACE QTY.                 @PDA*/ 08479100
*/*$PE=KET1792,HDP3320,T89044,STLKSC: CHANGE TO DACPDSE.         @PEA*/ 08479400
*/*$PF=KET1816,HDP3320,T89017,STLKSC: CHECK PDSE DIR SPACE.      @PFA*/ 08483300
*/*$01=OY20175,HDP3310,T89089,NSDRPS:PRE-EXIT FAILS TO GET CALLED@01A*/ 08487200
*/*$02=OY30402,HDP3310,T90117,SJPLKSC:DFDSS RESTORE OF VSAM DATA @02A*/ 08487500
*/*                                   SET FAILED BY DADSM BECAUSE    */ 08487800
*/*                                   DACMINES NOT CONVERTED         */ 08488100
*/*                                   CORRECTLY.                     */ 08488400
*/*$03=OY35166,HDP3320,T90248,SJPLKSC: PDPRIQTY NOT SET BEFORE       */ 08489100
*/*                          IGGPRE00 CALLED WHEN REALLOC ALLOC=MOV  */ 08489200
*/*                          INTERFACE USED.                     @03A*/ 08489300
*/*$04=OY35935,HDP3320,T90316,SJPLKSC: AVGREC NOT AVAILABLE TO   @04A*/ 08490300
*/*                                    DADSM EXITS WITH JFCB.    @04A*/ 08491300
*/*$05=OY33693,HDP3330,T90281,SJPLKSC: PDPRIQTY & PDDIRQTY       @05A*/ 08492300
*/*                                    CONTAIN GARBAGE WHEN      @05A*/ 08493300
*/*                                    IGGPRE00 CALLED.          @05A*/ 08494300
*/*$06=OY37559,HDP3330,T910110,SJPLRPS: DIAG INFO INCOMPLETE     @06A*/ 08494800
*/*$07=OY38128,HDP3330,T910121,SJPLCBS: DIAG INFO INCOMPLETE     @07A*/ 08495000
*/*$08=OY38616,HDP3330,90288,SJPLKSC:   SUPPORT CONDITIONAL      @08A*/ 08495600
*/*                                     ACQUISITION OF VTOC ENQ. @08A*/ 08496200
*/*$09=OY41803,HDP3330,T910314,SJPLKSC: SUPPORT USER LABELS FOR  @09A*/ 08496800
*/*                                     REALLOC ALLOC=MOV.       @09A*/ 08497400
*/*$L2=64KTRACK,JDZ1110,T920312,SJPLKSC: DADSM SUPPORT FOR DASD  @L2A*/ 08497600
*/*                                      WITH MORE THAN 64K TRKS @L2A*/ 08497800
*/*$L3=POSIX   ,JDZ1110,T920116,SJPLRPS: SUPPORT FOR POSIX       @L3A*/ 08498000
*/*$10=OY48632,HDP3330,T911113,SJPLJEB: USE TRKCALC FOR MAXIMUM  @10A*/ 08498100
*/*                                     R1 TRACK CAPACITY        @10A*/ 08498200
*/*$L4=EMPTYDS,JDZ1110,T911220,SJPLJEB: EMPTY DATA SET           @L4A*/ 08498300
*/*                                     RECOGNITION              @L4A*/ 08498400
*/*$L5=STRIPING,JDZ1110,T911125,SJPLRPS: SUPPORT FOR STRIPING    @L5A*/ 08498600
*/*$L6=COMPRESS,HDZ11B0,T930122,SJPLRPS: SUPPORT FOR COMPRESSION @L6A*/ 08498700
*/*$11=OY63910,JDZ1110,T930428,SJPLPLB: CORRECTION FOR AVGREC    @11A*/ 08498800
*/*                                     IMPLEMENTATION. REWRITE  @11A*/ 08498900
*/*                                     OF SPACE CALCULATION     @11A*/ 08499000
*/*                                     SECTIONS. REFIT OF APAR  @11A*/ 08499100
*/*                                     OY56531.                 @11A*/ 08499200
*/*$12=OY65156,JDZ1110,T930701,SJPLPLB: DIRF BIT RECOVERY        @12A*/ 08499300
*/*                                     CORRECTION.              @12A*/ 08499400
*/*$13=OW00756,HDZ11B0,T931210,SJPLPLB: INCORRECT SPACE          @13A*/ 08504400
*/*                                     ALLOCATION FOR PDSEs     @13A*/ 08509400
*/*                                     USING AVERAGE BLOCK.     @13A*/ 08514400
*/*$14=OW02629,HDZ11B0,T940221,SJPLRLC: EXPOSURE WITH MODEL PROF @14A*/ 08516000
*/*                                   FIN APAR OY56678 - K120268 @14A*/ 08517600
*/*$15=OW04158,HDZ11B0,94APR12,SJPLRPS: clarification- no code   @15A*/ 08518500
*/*$L7=SEASTAR,HDZ11C0,94DEC15,SJPLRPS: Support for Seastar      @L7A*/ 08518900
*/*$P10=K131141,HDZ11C0,95Apr02,SJPLRPS: AX-CELL support        @P10A*/ 08519100
*/*$16=OW06230,HDZ11B0,95May12,SJPLRLC: Overallocation of compressed */ 08519200
*/*                                    data set                  @16A*/ 08519300
*/*$17=OW12352,HDZ11B0,95May18,SJPLRPS: AX-CELL support, K131141 @17A*/ 08521000
*/*$18=OW16158,HDZ11C0,951006,SJPLKSC: DUMP BROKEN VTOC          @18A*/ 08521800
*/*$L8=X37ABND,HDZ11D0,960625,SJPLGAP: X37 ABEND REDUCTION -     @L8A*/ 08521900
*/*                                   THE DACMAXEX BIT HAS BEEN  @L8A*/ 08522000
*/*                                   DUPLICATED IN THE JFCB PATH@L8A*/ 08522100
*/*                                   AND IS CALLED DACMAXXT.    @L8A*/ 08522200
*/*                                   ADDED NEW DACRE COMMON     @L8A*/ 08522300
*/*                                   EXTENSION (DACCOMXT). THIS @L8A*/ 08522400
*/*                                   IS POINTED TO BY DACXTPTR  @L8A*/ 08522500
*/*                                   IN THE DACRE AND CONTAINS  @L8A*/ 08522600
*/*                                   DACXTMAX AND DACMNQTY.     @L8A*/ 08522700
*/*                                   DACXTQTY ADDED TO RETURN   @L8A*/ 08522800
*/*                                   AREA, RETURN NUMBER OF     @L8A*/ 08522900
*/*                                   EXTENTS USED TO CALLER.    @L8A*/ 08523000
*/*$P11=K150165,HDZ11E0,97Dec02,SJPLGAP: KB/MB requests will now@P11A*/ 08523200
*/*                                   include additional Byte/KB@P11A*/ 08523400
*/*                                   values as input and output@P11A*/ 08523600
*/*$19=OW28200,HDZ11D0,97Nov20,SJPLRPS: HFS & ~RACF              @19A*/ 08523800
*/*$20=OW38866,HDZ11E0,99Apr22,SJPLRPS: comment change only      @20A*/ 08524000
*/*$L9=SHARK,HDZ11F0,99Jul01,SJPLRPS: SHARK DEVICE SUPPORT       @L9A*/ 08524100
*/*                                                                  */ 08524200
*/*           NOTE: BILINGUAL MACRO                                  */ 08524400
*/*                UPDATE BOTH PARTS                                 */ 08529400
*/*                                                                  */ 08534400
*/********************************************************************/ 08539400
* %DCL CR_BASE CHAR INTERNAL;                                           08544400
* %DCL DAC_XTNA CHAR INTERNAL;                                 /*@L8A*/ 08547200
* %DCL DAC_EXTA CHAR INTERNAL;                                          08550000
* %DCL DAC_RTNA CHAR INTERNAL;                                          08600000
* %IF DAC_LIKE = 'Y' %THEN %GOTO DO_LIKE;                               08650000
*   %DAC_XTNA = 'DACXTPTR';                                    /*@L8A*/ 08675000
*   %DAC_EXTA = 'DACEXPTR';                                             08700000
*   %DAC_RTNA = 'DACRTPTR';                                             08750000
*  %GOTO ST_CRE;                                                        08800000
* %DO_LIKE: ;                                                           08850000
*   %DAC_XTNA = 'DACRE.DACXTPTR';                                       08875000
*   %DAC_EXTA = 'DACRE.DACEXPTR';                                       08900000
*   %DAC_RTNA = 'DACRE.DACRTPTR';                                       08950000
* %ST_CRE: ;                                                            09000000
* %IF DAC_PL = 'N' %THEN %GOTO SK_CPL;                                  09050000
* %IF DAC_PL = 'NO' %THEN %GOTO SK_CPL;                                 09100000
* %CR_BASE = 'BASED(DACREPTR)';                                         09150000
* %IF DAC_BASE = 'N' %THEN                                              09200000
*   %CR_BASE = '';                                                      09250000
* %IF DAC_BASE = 'NO' %THEN                                             09300000
*   %CR_BASE = '';                                                      09350000
*DECLARE                                                                09400000
* /*******************************************************************/ 09450000
* /*  COMMON SECTION                                                 */ 09500000
* /*******************************************************************/ 09550000
* 1 DACRE CR_BASE,           /* PARAMETER LIST MAPPING               */ 09600000
*  2 DACPLID  CHAR(8),       /* ID = 'IGGDACRE'                      */ 09650000
*  2 DACPVER FIXED(15),      /* VERSION OF PARAMETER LIST            */ 09700000
*  2 DACPLEN  FIXED(15),     /* LENGTH OF PARAMETER LIST             */ 09733300
*  2 DACPKEY  BIT(8),        /* KEY OF PARAMETER LIST                */ 09766600
*   3 DACPSKEY BIT(4),       /* STORAGE KEY OF PARAMETER LIST        */ 09799900
*   3 DACSKRSV BIT(4),       /* RESERVED                             */ 09833200
*  2 DACRSVBT FIXED(8),      /* RESERVED                             */ 09866500
*  2 DACHRTCD FIXED(15),     /* HISTORIC CREATE RETURN CODE          */ 09900000
*  2 DACDIAGI FIXED(32),     /* DIAGNOSTIC INFORMATION               */ 09933300
*   /* REFER TO DADSM DIAGNOSIS REFERENCE FOR MORE INFORMATION       */ 09966600
*   3 DACERRCD FIXED(8),     /* DADSM CREATE RETURN CODE             */ 10000000
*   3 DACSFNID FIXED(8),     /* DADSM CREATE SUBFUNCTION ID          */ 10050000
*   3 DACSFRSN FIXED(16),    /* SUBFUNCTION REASON               @01A*/ 10087500
*    4 DACSFRET FIXED(8),    /* SUBFUNCTION RETURN CODE          @01C*/ 10125000
*    4 DACSFREA FIXED(8),    /* SUBFUNCTION REASON CODE          @01C*/ 10162500
*  2 DACFLAG1 BIT(8),        /* EXTENSION TYPE FLAG                  */ 10200000
*   3 DACJFCB  BIT(1),       /* JFCB                                 */ 10250000
*   3 DACMDSCB BIT(1),       /* MODEL DSCB                           */ 10300000
*   3 DACADSCB BIT(1),       /* ABSOLUTE DSCB(S)                     */ 10350000
*   3 DACRSRV1 BIT(5),       /* RESERVED                             */ 10400000
*  2 DACFLAG2 BIT(8),        /* DATA SET INDICATOR FLAG              */ 10450000
*   3 DACSMSMG BIT(1),       /* SMS MANAGED DATA SET                 */ 10500000
*   3 DACUNCAT BIT(1),       /* UNCATALOGED SMS MANAGED DATA SET     */ 10550000
*   3 DACREBLK BIT(1),       /* REBLOCKABLE DATA SET                 */ 10580000
*   3 DACCOMPR BIT(1),       /* DATA SET IS COMPRESSABLE         @L6A*/ 10602500
*   3 DACPDSE  BIT(1),       /* PDSE TYPE DATA SET               @PEC*/ 10625000
*   3 DACSTRP  BIT(1),       /* DATA SET IS A STRIPE             @L5A*/ 10643700
*   3 DACPDSEX BIT(1),       /* HFS TYPE DATA SET                @L3A*/ 10659300
*   3 DACDSAE  BIT(1),       /* DATA SET has extended attributes        10674900
*                                                             @_@P10C*/ 10687400
*  2 DACFLAG3 BIT(8),        /* AUTHORIZED REQUEST FLAGS             */ 10700000
*   3 DACRSV31 BIT(1),       /* RESERVED                             */ 10750000
*   3 DACSAUTH BIT(1),       /* SECURITY AUTHORIZATION OF REQUEST       10800000
*                               HAS BEEN GUARANTEED BY CALLER        */ 10850000
*   3 DACPROFM BIT(1),       /* RACF PROFILE MANAGED BY CALLER       */ 10900000
*   3 DACGENMP BIT(1),       /* GENERIC MODEL PROFILE PROVIDED       */ 10950000
*   3 DACRSRV3 BIT(4),       /* RESERVED                             */ 11000000
*  2 DACFLAG4 BIT(8),        /* PARAMETER FLAG BYTE                  */ 11050000
*   3 DACSECVL BIT(1),       /* CREATE ON SECONDARY VOLUME           */ 11100000
*   3 DACVIO   BIT(1),       /* CREATE A VIO DATA SET                */ 11118700
*   3 DACEXRAC BIT(2),       /* RACF FLAGS SET BY EXTEND             */ 11137400
*    4 DACNDISP BIT(1),      /* DISCRETE PROFILE DOES NOT EXIST FOR     11160700
*                               DATA SET                             */ 11184000
*    4 DACDISP BIT(1),       /* DISCRETE PROFILE EXISTS FOR DATA SET */ 11207300
*   3 DACLRGEX BIT(1),       /* "Best-fit" interface:                   11214100
*                               ALLOCATE 'N' LARGEST EXTENTS EVEN IF    11220900
*                               TOTAL QUANTITY IS LESS THAN             11227700
*                               REQUESTED PRIMARY QUANTITY       @15C*/ 11234500
*   3 DACOPTIC BIT(1),       /* DS IS CATALOGED IN ICF CAT       @L8A*/ 11239900
*   3 DACRSRV4 BIT(2),       /* RESERVED                         @L8C*/ 11250700
*  2 DACXTPTR PTR(31),       /* DACRE COMMON EXTENSION           @L8C*/ 11275300
*  2 DACUCB PTR(31),         /* UCB POINTER                          */ 11300000
*   3 DACDEVCD FIXED(32),    /* DEVICE TYPE, DACVIO = '1'B           */ 11350000
*  2 DACSECMP PTR(31),       /* SECURITY MODEL PROFILE POINTER       */ 11400000
*  2 DACEXPTR PTR(31),       /* PARAMETER LIST EXTENSION POINTER     */ 11450000
*  2 DACRTPTR PTR(31),       /* RETURN INFORMATION AREA POINTER      */ 11460900
*  2 DACVOLSQ FIXED(8),      /* VOLUME SEQUENCE NUMBER           @P1M*/ 11471800
*  2 DACRSRV5 FIXED(8),      /* RESERVED                         @P1A*/ 11482700
*  2 DACDSSNM CHAR(6);       /* DATA SET SERIAL NUMBER           @P1M*/ 11493600
*DECLARE                                                                11504500
*  /******************************************************************/ 11509000
*  /*  PARAMETER LIST CONSTANTS                                      */ 11513500
*  /******************************************************************/ 11518000
*  DACREID CHAR(8) CONSTANT('IGGDACRE'), /*                             11522500
*                               PARAMETER LIST ID CONSTANT           */ 11527000
*  DACVER0 FIXED(15) CONSTANT(0), /*                                    11529700
*                               PARAMETER LIST VERSION 0        @P11C*/ 11532400
*  DACVER  FIXED(15) CONSTANT(1), /*                                    11535100
*                               PARAMETER LIST VERSION 1        @P11A*/ 11537800
*  DACLEN FIXED(15) CONSTANT(52); /*                                    11540500
*                               PARAMETER LIST LENGTH            @L8C*/ 11548200
* /*******************************************************************/ 11550700
* /*  COMMON PARAMETER LIST EXTENSION                            @L8A*/ 11553200
* /*******************************************************************/ 11555700
* %SK_CPL: ;                                                            11558200
* %IF CR_BASE ~= '' %THEN                                      /*@L8A*/ 11560700
*   %CR_BASE = 'BASED(DAC_XTNA)';                              /*@L8A*/ 11563200
* %IF DAC_PL = '' %THEN %GOTO IN_CPLX;                         /*@L8A*/ 11565700
* %IF DAC_PLX = '' %THEN %GOTO SK_CPLX;                        /*@L8A*/ 11568200
* %IF DAC_PLX = 'N' %THEN %GOTO SK_CPLX;                       /*@L8A*/ 11570700
* %IF DAC_PLX = 'NO' %THEN %GOTO SK_CPLX;                      /*@L8A*/ 11573200
* %IN_CPLX: ;                                                  /*@L8A*/ 11575700
*DECLARE                                                       /*@L8A*/ 11578200
* 1 DACCOMXT CR_BASE,        /*                                         11580700
*                               COMMON PARAMETER LIST EXTENSION  @L8A*/ 11583200
*  2 DACXTMAX FIXED(31),     /* MAX NUMBER OF EXTENTS THAT CAN BE       11585700
*                               USED TO SATISFY REQUEST          @L8A*/ 11588200
*  2 DACMNQTY FIXED(31),     /* MIN ALLOCATION QUANTITY          @L8A*/ 11590700
*  2 DACBTALQ FIXED(15),     /* BYTE PRECISION FOR KB/MB REQUEST@P11A*/ 11591900
*  2 DACKBALQ FIXED(15),     /* KB PRECISION FOR MB REQUEST     @P11A*/ 11593100
*  2 DACRSV28 CHAR(28);      /* RESERVED                        @P11C*/ 11594300
*@SPACE;                                                                11595700
* /*******************************************************************/ 11600000
* /*  CREATE PARAMETER LIST EXTENSIONS                               */ 11650000
* /*******************************************************************/ 11700000
* %SK_CPLX: ;                                                           11733300
* %IF CR_BASE ~= '' %THEN                                      /*@P8M*/ 11766600
*   %CR_BASE = 'BASED(DAC_EXTA)';                              /*@P8M*/ 11783200
* %IF DAC_PL = '' %THEN %GOTO IN_CJFC;                                  11800000
* %IF DAC_JFCB = '' %THEN %GOTO SK_CJFC;                                11850000
* %IF DAC_JFCB = 'N' %THEN %GOTO SK_CJFC;                               11900000
* %IF DAC_JFCB = 'NO' %THEN %GOTO SK_CJFC;                              11950000
* %IN_CJFC: ;                                                           12000000
*DECLARE                                                                12150000
*   /*****************************************************************/ 12200000
*   /*  JFCB INTERFACE EXTENSION, DACJFCB = '1'B                     */ 12250000
*   /*****************************************************************/ 12300000
* 1 DACIJFCB CR_BASE,        /*                                         12350000
*                               JFCB INTERFACE EXTENSION             */ 12375000
*  2 DACJFCBP PTR(31),       /* JFCB POINTER                         */ 12400000
*  2 DACDSABP PTR(31),       /* DSAB LIST POINTER (ISAM DATA SETS)   */ 12425000
*  2 DACPRIKB FIXED(31),     /* PRIMARY SPACE IN KILOBYTES,             12450000
*                               DACJFCBD = '1'B                      */ 12475000
*  2 DACSECKB FIXED(31),     /* SECONDARY SPACE IN KILOBYTES,           12500000
*                               DACJFCBD = '1'B                      */ 12525000
*  2 DACIJFL1 BIT(8),        /* FLAG BYTE                            */ 12550000
*   3 DACLASTV BIT(1),       /* LAST VOLUME OF MULTI-VOLUME DATA SET */ 12575000
*   3 DACSECRQ BIT(1),       /* USE SECONDARY REQUEST QUANTITY       */ 12600000
*   3 DACJFCBD BIT(1),       /* JFCB DISABLED FOR SPACE. USE VALUES     12625000
*                               IN DACPRIKB AND DACSECKB FOR PRI/SEC    12650000
*                               SPACE.                               */ 12675000
*   3 DACAVRCP BIT(1),       /* 'AVGREC' VALUE PRESENT               */ 12700000
*   3 DACOSECP BIT(1),       /* ORIGINAL SECONDARY QUANTITY PRESENT  */ 12712500
*   3 DACMNESP BIT(1),       /* MINIMUM EXTENT QUANTITY PRESENT  @PBA*/ 12720800
*   3 DACMAXXT BIT(1),       /* USE AS MANY EXTENTS AS SUPPORTED BY     12724100
*                               DATA SET ORGANIZATION TO SATISFY        12727400
*                               REQUEST                          @L8A*/ 12730700
*   3 DACIJRS1 BIT(1),       /* RESERVED                         @L8C*/ 12734000
*  2 DACIJRS2 CHAR(1),       /* RESERVED                             */ 12737500
*  2 DACIJRS3 BIT(8),        /* RESERVED                         @P1A*/ 12775000
*  2 DACAVGRC BIT(8),        /* FLAG BYTE.                       @04C*/ 12776500
*   3 DACAVGR    BIT(3),     /* AVERAGE RECORD INDICATOR.               12778000
*                               AT MOST ONE OF THESE THREE              12779500
*                               BITS MAY BE ON.  IF ALL ARE             12781000
*                               ZERO, THEN THIS IS NOT AN               12782500
*                               AVERAGE RECORD SPACE REQUEST.           12784000
*                               THE INDIVIDUAL BITS ARE DEFINED         12785500
*                               AS FOLLOWS:                      @04A*/ 12787000
*     4 DACAVGRU   BIT(1),   /* AVERAGE RECORD SPACE REQUEST.           12788500
*                               MULTIPLY JFCBPQTY * JFCBDRLH TO         12790000
*                               GET REQUESTED PRIMARY SPACE             12791500
*                               IN BYTES.                               12793000
*                               MULTIPLY JFCBSQTY * JFCBDRLH TO         12794500
*                               GET REQUESTED SECONDARY SPACE           12796000
*                               IN BYTES.                        @04A*/ 12797500
*     4 DACAVGRK   BIT(1),   /* AVERAGE RECORD SPACE REQUEST.           12799000
*                               MULTIPLY JFCBPQTY * JFCBDRLH *          12800500
*                               1024 TO GET REQUESTED PRIMARY           12802000
*                               SPACE IN BYTES.                         12803500
*                               MULTIPLY JFCBSQTY * JFCBDRLH *          12805000
*                               1024 TO GET REQUESTED SECONDARY         12806500
*                               SPACE IN BYTES.                  @04A*/ 12808000
*     4 DACAVGRM   BIT(1),   /* AVERAGE RECORD SPACE REQUEST.           12809500
*                               MULTIPLY JFCBPQTY * JFCBDRLH *          12811000
*                               1048576 TO GET REQUESTED PRIMARY        12812500
*                               SPACE IN BYTES.                         12814000
*                               MULTIPLY JFCBSQTY * JFCBDRLH *          12815500
*                               1048576 TO GET REQUESTED                12817000
*                               SECONDARY SPACE IN BYTES.        @04A*/ 12818500
*    3 DACIJRS4   BIT(5),    /* RESERVED                         @04A*/ 12820000
*  2 DACOSQTY FIXED(31),     /* ORIGINAL SECONDARY QUANTITY FROM FMT1   12823200
*                               (FIELD DS1SCXTV) FOR KB/MB DATA SET.    12829900
*                               QUANTITY IS IN UNIT SPECIFIED BY        12836600
*                               VALUE IN DACAVGRC                @P2C*/ 12843300
*  2 DACJMNES FIXED(31);     /* MINIMUM EXTENT SIZE              @PBA*/ 12846600
*@SPACE;                                                                12850000
* %SK_CJFC: ;                                                           12900000
* %IF DAC_PL = '' %THEN %GOTO IN_CMDS;                                  12950000
* %IF DAC_MDSC = '' %THEN %GOTO SK_CMDS;                                13000000
* %IF DAC_MDSC = 'N' %THEN %GOTO SK_CMDS;                               13050000
* %IF DAC_MDSC = 'NO' %THEN %GOTO SK_CMDS;                              13100000
* %IN_CMDS: ;                                                           13150000
*DECLARE                                                                13200000
*   /*****************************************************************/ 13250000
*   /* MODEL DSCB INTERFACE EXTENSION, DACMDSCB = '1'B               */ 13300000
*   /*****************************************************************/ 13350000
* 1 DACIMDSC CR_BASE,        /*                                         13400000
*                               MODEL DSCB INTERFACE EXTENSION       */ 13450000
*  2 DACDSCBM PTR(31),       /* FORMAT 1 DSCB MODEL POINTER          */ 13500000
*  2 DACIMFL1 BIT(8),        /* FLAG BYTE                        @05C*/ 13550000
*   3 DACPSPAC BIT(5),       /* PRIMARY SPACE UNITS.                    13560000
*                               ONE AND ONLY ONE OF THESE BITS          13570000
*                               SHOULD BE SET.                   @05A*/ 13580000
*     4 DACCYLRQ BIT(1),     /* DACPRQTY IS IN CYL.              @05C*/ 13590000
*     4 DACTRKRQ BIT(1),     /* DACPRQTY IS IN TRK.              @05C*/ 13600000
*     4 DACAVRRQ BIT(1),     /* DACPRQTY IS IN BLOCKS.           @05C*/ 13610000
*     4 DACMBRQ BIT(1),      /* DACPRQTY IS IN MEGABYTES.        @05C*/ 13620000
*     4 DACKBRQ BIT(1),      /* DACPRQTY IS IN KILOBYTES.        @05C*/ 13630000
*   3 DACIMRS1 BIT(3),       /* RESERVED                             */ 13850000
*  2 DACIMFL2 BIT(8),        /* FLAG BYTE                            */ 13900000
*   3 DACMAXEX BIT(1),       /* USE AS MANY EXTENTS AS SUPPORTED BY     13950000
*                               DATA SET ORGANIZATION TO SATISFY        14000000
*                               REQUEST                              */ 14050000
*   3 DACRNDRQ BIT(1),       /* ROUND TO CYLINDER BOUNDARY              14100000
*                               (DOES NOT APPLY TO TRACK REQUEST)    */ 14150000
*                                                              /*@PBD*/ 14183300
*   3 DACMUDQR BIT(1),       /* USABLE DATA QUANTITY REQUEST. ONLY      14189400
*                               APPLICABLE FOR DACMBRQ OR DACKBRQ,      14195500
*                               AND PD1CYL OR PD1TRK.  UNDER THESE      14201600
*                               CONDITIONS, DACMUDQR ON IMPLIES         14207700
*                               DACPRQTY VALUE REPRESENT USABLE DATA    14213800
*                               QUANTITY REQUIRED, NOT PHYSICAL         14219900
*                               DASD SPACE REQUIRED.  THIS BIT IS       14226000
*                               IGNORED IN ALL OTHER CASES.      @PDA*/ 14232100
*   3 DACVTOCE BIT(1),       /* CALLER HAS VTOC ENQ EXCLUSIVE.   @08A   14238800
*                               DADSM WILL VERIFY VTOC ENQ IS    @08A   14241500
*                               HELD BY CURRENT TASK.            @08A*/ 14244200
*   3 DACIMRS2 BIT(4),       /* RESERVED                         @08C*/ 14246900
*  2 DACIMRSF CHAR(2),       /* RESERVED                             */ 14250000
*  2 DACPRQTY FIXED(31),     /* PRIMARY REQUEST QUANTITY             */ 14300000
*  2 DACAVBLN FIXED(31),     /* AVERAGE DATA BLOCK LENGTH,              14350000
*                               DACAVRRQ = '1'B                      */ 14400000
*  2 DACMINES FIXED(31),     /* MINIMUM EXTENT SIZE                  */ 14450000
*  2 DACDRQTY FIXED(31);     /* DIRECTORY BLOCK QUANTITY             */ 14500000
* %SK_CMDS: ;                                                           14550000
* %IF DAC_PL = '' %THEN %GOTO IN_CADS;                                  14600000
* %IF DAC_ADSC = '' %THEN %GOTO SK_CADS;                                14650000
* %IF DAC_ADSC = 'N' %THEN %GOTO SK_CADS;                               14700000
* %IF DAC_ADSC = 'NO' %THEN %GOTO SK_CADS;                              14750000
* %IN_CADS: ;                                                           14800000
*DECLARE                                                                14850000
*   /*****************************************************************/ 14900000
*   /* ABSOLUTE DSCB INTERFACE EXTENSION, DACADSCB = '1'B            */ 14950000
*   /*****************************************************************/ 15000000
* 1 DACIADSC CR_BASE,        /*                                         15050000
*                               ABSOLUTE DSCB INTERFACE EXTENSION    */ 15100000
*  2 DACDSCB1 PTR(31),       /* FORMAT 1 DSCB POINTER                */ 15150000
*  2 DACDSCB2 PTR(31),       /* FORMAT 2 DSCB POINTER                */ 15200000
*  2 DACDSCB3 PTR(31),       /* FORMAT 3 DSCB POINTER                */ 15250000
*  2 DACDQTYA FIXED(31);     /* DIRECTORY BLOCK QUANTITY             */ 15300000
*@SPACE;                                                                15350000
* %SK_CADS: ;                                                           15400000
* %IF DAC_PL = '' %THEN %GOTO IN_RETA;                                  15450000
* %IF DAC_RETA = '' %THEN %GOTO SK_RETA;                                15500000
* %IF DAC_RETA = 'N' %THEN %GOTO SK_RETA;                               15550000
* %IF DAC_RETA = 'NO' %THEN %GOTO SK_RETA;                              15600000
* %IN_RETA: ;                                                           15650000
* %IF CR_BASE ~= '' %THEN                                               15700000
*   %CR_BASE = 'BASED(DAC_RTNA)';                                       15750000
*DECLARE                                                                15800000
*   /*****************************************************************/ 15850000
*   /* CREATE INFORMATION RETURN AREA                                */ 15900000
*   /*****************************************************************/ 15950000
* 1 DACRETNA CR_BASE,        /*                                         16000000
*                               RETURN AREA MAPPING                  */ 16050000
*  2 DACRTRQ1 BIT(8),        /* RETURN AREA REQUEST FLAGS            */ 16100000
*   3 DACRTTR BIT(1),        /* RETURN TTR0 OF FORMAT 1 DSCB         */ 16150000
*   3 DACRCHR BIT(1),        /* RETURN CCHHR OF FORMAT 1 DSCB        */ 16200000
*   3 DACRTRS1 BIT(6),       /* RESERVED                             */ 16250000
*  2 DACRTRSF CHAR(3),       /* RESERVED                             */ 16300000
*  2 DACTTRAD CHAR(3),       /* TTR0 OF FORMAT 1 DSCB                */ 16350000
*  2 DACCHRAD CHAR(5),       /* CCHHR OF FORMAT 1 DSCB               */ 16400000
*  2 DACVDSCB PTR(31),       /* VIRTUAL DSCB FOR VIO DATA SET        */ 16425000
*  2 DACALQTY FIXED(31),     /* AMOUNT OF SPACE ALLOCATED,              16450000
*                               DACLRGEX = '1'B                  @P1A*/ 16475000
*  2 DACXTQTY FIXED(31),     /* NUMBER OF EXTENTS USED           @L8A   16483300
*                               DACMAXEX = '1'B                  @L8A*/ 16491600
*  2 DACBTQTY FIXED(15),     /* AMOUNT OF BYTES ALLOCATED, BUT          16493200
*                              NOT ACCOUNTED FOR IN DACALQTY    @P11A*/ 16494800
*  2 DACKBQTY FIXED(15);     /* AMOUNT OF KILOBYTES ALLOCATED,          16496400
*                              BUT NOT ACCOUNTED FOR IN DACALQTY@P11A*/ 16498000
* %SK_RETA: ;                                                           16500000
* %IF DAC_PL = '' %THEN %GOTO IN_CRC;                                   16550000
* %IF DAC_RC = '' %THEN %GOTO SK_CRC;                                   16600000
* %IF DAC_RC = 'N' %THEN %GOTO SK_CRC;                                  16650000
* %IF DAC_RC = 'NO' %THEN %GOTO SK_CRC;                                 16700000
* %IN_CRC: ;                                                            16750000
*DECLARE                                                                16800000
*    /****************************************************************/ 16850000
*    /* ERROR CODES                                                  */ 17400000
*    /****************************************************************/ 17450000
*  DACECD00 CONSTANT(000),          /* SUCCESSFUL COMPLETION         */ 17500000
*                                                                       17550000
*  DACECD04 CONSTANT(004),          /* CATAGORIZED ERROR CONDITION   */ 17600000
*                                                                       17650000
*  DACECD08 CONSTANT(008),          /* UNEXPECTED ERROR CONDITION    */ 17700000
*                                                                       17750000
*  DACECD0C CONSTANT(012),          /* INVALID PARAMETER OR REQUEST  */ 17800000
*                                                                       17850000
*  DACECD10 CONSTANT(016),          /* INVALID PARAMETER LIST    @L2C*/ 17875000
*                                                                       17900000
*  DACECD14 CONSTANT(020);          /* PROBABLE DADSM LOGIC ERROR@L2A*/ 17925000
*DECLARE                                                                17950000
*    /****************************************************************/ 18000000
*    /* HISTORIC RETURN CODES                                        */ 18050000
*    /****************************************************************/ 18100000
*  DACHCD00 CONSTANT(000),          /* SUCCESSFUL DATA SET CREATION  */ 18150000
*                                                                       18200000
*  DACHCD04 CONSTANT(004),          /* DUPLICATE DATA SET NAME       */ 18250000
*                                                                       18300000
*  DACHCD08 CONSTANT(008),          /* NO ROOM IN VTOC OR VTOC INDEX */ 18350000
*                                                                       18400000
*  DACHCD0C CONSTANT(012),          /* PERMANENT  I/O  ERROR OR  CVAF   18450000
*                                      ERROR                         */ 18500000
*                                                                       18550000
*  DACHCD10 CONSTANT(016),          /* REQUESTED ABSOLUTE TRACK  NOT    18600000
*                                      AVAILABLE                     */ 18650000
*                                                                       18700000
*  DACHCD14 CONSTANT(020),          /* REQUESTED     QUANTITY     NOT   18750000
*                                      AVAILABLE                     */ 18800000
*                                                                       18850000
*  DACHCD18 CONSTANT(024),          /* AVERAGE RECORD  LENGTH EXCEEDS   18900000
*                                      65,535 BYTES                  */ 18950000
*                                                                       19000000
*  DACHCD1C CONSTANT(028),          /* INVALID  DSORG FOR  ISAM INDEX   19050000
*                                      REQUEST                       */ 19100000
*                                                                       19150000
*  DACHCD20 CONSTANT(032),          /* NO  PRIME  AREA REQUESTED  FOR   19200000
*                                      ISAM                          */ 19250000
*                                                                       19300000
*  DACHCD24 CONSTANT(036),          /* ISAM  OVFLOW   AREA  REQUESTED   19350000
*                                      BEFORE PRIME                  */ 19400000
*                                                                       19450000
*  DACHCD28 CONSTANT(040),          /* ISAM  SPACE  REQUEST DOES  NOT   19500000
*                                      START ON CYLINDER BOUNDARY    */ 19550000
*                                                                       19600000
*  DACHCD2C CONSTANT(044),          /* DUPLICATE   ISAM    DATA   SET   19650000
*                                      ELEMENT                       */ 19700000
*                                                                       19750000
*  DACHCD30 CONSTANT(048),          /* INVALID REALLOC PARAMETER LIST*/ 19800000
*                                                                       19850000
*  DACHCD34 CONSTANT(052),          /* INVALID  JFCB OR  PARTIAL DSCB   19900000
*                                      POINTER                       */ 19950000
*                                                                       20000000
*  DACHCD38 CONSTANT(056),          /* NOT ENOUGH SPACE ON VOLUME FOR   20050000
*                                      DIRECTORY                     */ 20100000
*                                                                       20150000
*  DACHCD3C CONSTANT(060),          /* REALLOC   ALLOC=ABS   IS   NOT   20200000
*                                      SUPPORTED ON OS VTOC'S        */ 20250000
*                                                                       20300000
*  DACHCD40 CONSTANT(064),          /* INVALID USER LABEL REQUEST    */ 20350000
*                                                                       20400000
*  DACHCD44 CONSTANT(068),          /* INVALID UCB POINTER           */ 20450000
*                                                                       20500000
*  DACHCD48 CONSTANT(072),          /* DOS  VTOC CANNOT  BE CONVERTED   20550000
*                                      TO AN OS VTOC                 */ 20600000
*                                                                       20650000
*  DACHCD4C CONSTANT(076),          /* NO SPACE PARAMETER GIVEN FOR A   20700000
*                                      NEW  DATA  SET OR  ZERO  SPACE   20750000
*                                      REQUESTED  AT  ABSOLUTE  TRACK   20800000
*                                      ZERO.                         */ 20850000
*                                                                       20900000
*  DACHCD50 CONSTANT(080),          /* INVALID REQUEST FOR ISAM INDEX*/ 20950000
*                                                                       21000000
*  DACHCD54 CONSTANT(084),          /* ISAM MULTI-VOLUME INDEX IS NOT   21050000
*                                      ALLOWED                       */ 21100000
*                                                                       21150000
*  DACHCD58 CONSTANT(088),          /* INVALID ISAM DATA SET ELEMENT */ 21200000
*                                                                       21250000
*  DACHCD5C CONSTANT(092),          /* ISAM MULTI-VOLUME  OVERFLOW IS   21300000
*                                      NOT ALLOWED                   */ 21350000
*                                                                       21400000
*  DACHCD60 CONSTANT(096),          /* ABSTR    AND   CYL    REQUESTS   21450000
*                                      CONFLICT (ISAM)               */ 21500000
*                                                                       21550000
*  DACHCD64 CONSTANT(100),          /* CYL    AND   CONTIG    REQUEST   21600000
*                                      CONFLICT (ISAM)               */ 21650000
*                                                                       21700000
*  DACHCD68 CONSTANT(104),          /* INVALID SPACE SUBPARAMETER    */ 21750000
*                                                                       21800000
*  DACHCD6C CONSTANT(108),          /* ZERO PRIMARY SPACE REQUEST FOR   21850000
*                                      ISAM DATA SET OR ABSTR REQUEST*/ 21900000
*                                                                       21950000
*  DACHCD70 CONSTANT(112),          /* ISAM INDEX REQUEST DUPLICATION*/ 22000000
*                                                                       22050000
*                                   /*                          1@09D*/ 22060000
*  DACHCD78 CONSTANT(120),          /* INVALID COMBINATION  OF DSSIZE   22200000
*                                      AND MINAU IN REALLOC PARAMETER*/ 22250000
*                                                                       22300000
*  DACHCD7C CONSTANT(124),          /* DSSIZE NOT A MULTIPLE OF MINAU*/ 22350000
*                                                                       22400000
*  DACHCD80 CONSTANT(128),          /* DIRECTORY  SPACE REQUESTED  IS   22450000
*                                      LARGER THAN PRIMARY SPACE     */ 22500000
*                                                                       22550000
*  DACHCD84 CONSTANT(132),          /* SPACE REQUEST MUST BE  ABSTR     22600000
*                                      FOR A DOS VOLUME              */ 22650000
*                                                                       22700000
*  DACHCD88 CONSTANT(136),          /* INVALID F3DSCB POINTER        */ 22750000
*                                                                       22800000
*  DACHCD8C CONSTANT(140),          /* INDEX MUST BE REQUESTED BEFORE   22850000
*                                      PRIME AREA                    */ 22900000
*                                                                       22950000
*  DACHCD90 CONSTANT(144),          /* INVALID THIRD DD CARD FOR ISAM   23000000
*                                      ALLOCATION                    */ 23050000
*                                                                       23100000
*  DACHCD94 CONSTANT(148),          /* OVERLAPPING  EXTENTS   IN  THE   23150000
*                                      VTOC                          */ 23200000
*                                                                       23250000
*  DACHCD98 CONSTANT(152),          /* OVERLAPPING DOS SPLIT CYLINDER   23300000
*                                      EXTENTS IN THE VTOC           */ 23350000
*                                                                       23400000
*  DACHCD9C CONSTANT(156),          /* DADSM CREATE TERMINATED DUE TO   23450000
*                                      POSSIBLE VTOC ERRORS          */ 23500000
*                                                                       23550000
*  DACHCDA0 CONSTANT(160),          /* ISAM CREATE  TERMINATED DUE TO   23600000
*                                      POSSIBLE VTOC ERRORS          */ 23650000
*                                                                       23700000
*  DACHCDA4 CONSTANT(164),          /* ALLOCATION  TERMINATED DUE  TO   23750000
*                                      DOS STACKED PACK FORMAT       */ 23800000
*                                                                       23850000
*  DACHCDA8 CONSTANT(168),          /* RACDEF   FAILED,    DATA   SET   23900000
*                                      ALREADY DEFINED               */ 23950000
*                                                                       24000000
*  DACHCDAC CONSTANT(172),          /* USER NOT  AUTHORIZED TO DEFINE   24050000
*                                      DATA SET                      */ 24100000
*                                                                       24150000
*  DACHCDB0 CONSTANT(176),          /* INSTALLATION   EXIT   REJECTED   24200000
*                                      THIS  REQUEST  WITH  A  RETURN   24250000
*                                      CODE OF 8                     */ 24300000
*                                                                       24350000
*  DACHCDB4 CONSTANT(180),          /* INSTALLATION   EXIT   REJECTED   24400000
*                                      THIS  REQUEST  WITH  A  RETURN   24450000
*                                      CODE OF 4                     */ 24500000
*                                                                       24550000
*  DACHCDB8 CONSTANT(184),          /* RACF   DEFINE  WITH   MODELING   24600000
*                                      SPECIFIED AND MODEL NOT FOUND */ 24650000
*                                                                       24700000
*  DACHCDBC CONSTANT(188),          /* INVALID F2DSCB POINTER        */ 24750000
*                                                                       24800000
*  DACHCDC0 CONSTANT(192),          /* REQUESTED  DATA  SET  CREATION   24850000
*                                      WAS NOT ALLOWED BY SMS        */ 24900000
*                                                                       24950000
*  DACHCDC4 CONSTANT(196),          /* REQUESTED  DATA  SET  CREATION   25000000
*                                      WAS NOT POSSIBLE (REFER TO       25033300
*                                      DIAG INFORMATION IN R0)       */ 25041000
*  DACHCDC8 CONSTANT(200),          /* BUILD OF PDSE OR PDSE/X          25048700
*                                      DIRECTORY FAILED          @L3C*/ 25056400
*  DACHCDCC CONSTANT(204),          /* VTOC ENQ RELATED FAILURE  @08A*/ 25058300
*  DACHCDD0 CONSTANT(208),          /* EOF MARK WRITE FAILED     @L4A*/ 25060200
*                                   /* FOR DATA SET WITH PRIMARY @L4A*/ 25062100
*                                   /* QUANTITY SPECIFIED,       @L4A*/ 25064000
*                                   /* DATA SET                  @L4A*/ 25065900
*                                   /* IS DSORG=PS (NOT STRIPED) @L4A*/ 25067800
*                                   /* OR  DSORG=NULL            @L4A*/ 25069700
*  DACHCDD4 CONSTANT(212),          /* VTOC CONVERSION FAILED DUE TO    25070300
*                                      PRESENCE OF SPLIT CYLINDER DATA  25070900
*                                      SETS.                     @L2A*/ 25071500
*  DACHCDD8 CONSTANT(216);          /* DATA SET COULD NOT BE CREATED,   25071600
*                                      PRIMARY SPACE REQUIRED EXCEEDS   25071700
*                                      65535 TRACKS.             @L2A*/ 25071800
* %SK_CRC: ;                                                            25072200
* %IF DAC_PL = '' %THEN %GOTO IN_CSF;                                   25077800
* %IF DAC_SF = '' %THEN %GOTO SK_CSF;                                   25083400
* %IF DAC_SF = 'N' %THEN %GOTO SK_CSF;                                  25089000
* %IF DAC_SF = 'NO' %THEN %GOTO SK_CSF;                                 25094600
* %IF DAC_SFL = 'N' %THEN %GOTO NOLIST_CSF;                             25100200
* %IF DAC_SFL = 'NO' %THEN %GOTO NOLIST_CSF;                            25105800
* %GOTO IN_CSF;                                                         25111400
* %NOLIST_CSF: ;                                                        25117000
*@LIST PUSH;                                                            25122600
*@LIST OFF;                                                             25128200
* %IN_CSF: ;                                                            25133800
*DECLARE                                                                25139400
*    /****************************************************************/ 25145000
*    /* SUBFUNCTION ID'S                                             */ 25150600
*    /****************************************************************/ 25156200
*  CREASF01 CONSTANT(001),          /* EXTEND - VALIDATE INPUT PARMS */ 25161800
*  CREASF02 CONSTANT(002),          /* ISSUE SSI CALL TO SMS         */ 25167400
*  CREASF03 CONSTANT(003),          /* SMS VTOC/DSS INVOKED - IF ERROR  25173000
*                                      OCCURS, THE VTOC/DSS ERROR       25178600
*                                      REASON CODE WILL BE PASSED BACK  25184200
*                                      IN BYTES 2 AND 3 OF REGISTER 0*/ 25189800
*  CREASF04 CONSTANT(004),          /* EXTEND - BUILD JFCB INTERFACE */ 25190000
*  CREASF05 CONSTANT(005),          /* VALIDATE REALLOC PARMLIST*/      25190200
*  CREASF06 CONSTANT(006),          /* VALIDATE BRANCH ENTRY PARMLIST*/ 25190400
*  CREASF07 CONSTANT(007),          /* CHECK PQTY AND MINAU WHEN        25190600
*                                      ROUNDING TO CYL BOUNDARY */      25190800
*  CREASF08 CONSTANT(008),          /* CHECK PASSED UCB ADDRESS */      25191000
*  CREASF09 CONSTANT(009),          /* VALIDATE JFCB EXTENSION  */      25191200
*  CREASF0A CONSTANT(010),          /* VALIDATE MODEL DSCB EXTENSION*/  25191400
*  CREASF0B CONSTANT(011),          /* VALIDATE ABSOLUTE DSCB           25191600
*                                      EXTENSION */                     25191800
*  CREASF0C CONSTANT(012),          /* VALIDATE RETURN AREA */          25192000
*  CREASF0D CONSTANT(013),          /* INVOKE RACF TO CHECK CALLER'S    25193200
*                                      AUTHORITY.                    */ 25193400
*  CREASF0E CONSTANT(014),          /* INVOKE RACF TO CREATE A PROFILE  25193600
*                                      FOR THE DATA SET              */ 25193800
*  CREASF0F CONSTANT(015),          /* INVOKE RACF TO CREATE A PROFILE  25194000
*                                      FOR THE DATA SET - SECURITY      25194200
*                                      MODEL PROCESSING SPECIFIED    */ 25194400
*  CREASF10 CONSTANT(016),          /* INVOKE RACF TO CREATE A PROFILE  25194600
*                                      FOR THE DATA SET - SECURITY      25194800
*                                      MODEL PROCESSING SPECIFIED       25195000
*                                      AND MODEL PROFILE IS GENERIC  */ 25195200
*  CREASF11 CONSTANT(017),          /* INVOKE RACF TO ADD A VOLUME TO   25195400
*                                      THE PROFILE FOR THE DATA SET  */ 25195600
*/*CREASF12 CONSTANT(018),             **OBSOLETE**                     25196000
*                                                                @11C*/ 25196400
*  CREASF13 CONSTANT(019),          /* ESTAE ROUTINE INVOKED BY RTM -   25196800
*                                      SYSTEM COMPLETION CODE WILL BE   25197000
*                                      PASSED BACK IN BYTES 2 AND 3     25197200
*                                      OF REGISTER 0                 */ 25197400
*  CREASF14 CONSTANT(020),          /* VALIDATE CREATE REQUEST       */ 25197600
*  CREASF15 CONSTANT(021),          /* PREPROCESSING EXIT REJECTED      25197800
*                                      REQ - FIELDS DACSFRET AND        25198000
*                                      DACSFREA CONTAIN THE             25198200
*                                      PREPROCESSING EXIT REASON        25198400
*                                      CODE                          */ 25198600
*  CREASF16 CONSTANT(022),          /* VERIFY THAT SMS FLAGS PASSED     25198800
*                                      BY THE CALLER MATCH THOSE IN     25199000
*                                      THE FMT4 DSCB                 */ 25199200
*  CREASF17 CONSTANT(023),          /* INVOKE CVAFDIR - READ INDEX      25199400
*                                      MAPS, HIGH LEVEL VIER AND        25199600
*                                      FMT4 DSCB                     */ 25199800
*  CREASF18 CONSTANT(024),          /* INVOKE CVAFVRF - CHECK FOR VRF   25200000
*                                      DATA IN VIXM                  */ 25200200
*  CREASF19 CONSTANT(025),          /* INVOKE CVAFDSM FOR AN ABSOLUTE   25200400
*                                      DSCB REQUEST                  */ 25200600
*  CREASF1A CONSTANT(026),          /* INVOKE CVAFDSM TO OBTAIN SPACE   25200800
*                                      FOR DATA SET                  */ 25201000
*  CREASF1B CONSTANT(027),          /* INVOKE CVAFDSM - GET FMT0 DSCB*/ 25201200
*  CREASF1C CONSTANT(028),          /* INVOKE CVAFDSM - ADD DATA SET    25201400
*                                      NAME TO INDEX AND CHECK FOR      25201600
*                                      DUPLICATE                     */ 25201800
*  CREASF1D CONSTANT(029),          /* INVOKE CVAFDIR - RELEASE         25202000
*                                      BUFFERS                       */ 25202200
*  CREASF1E CONSTANT(030),          /* INVOKE CVAFVRF - WRITE VRF       25202400
*                                      DATA TO INDEX MAP             */ 25202600
*  CREASF1F CONSTANT(031),          /* INVOKE CVAFDIR - WRITE BUFFER    25202800
*                                      LISTS TO THE VOLUME           */ 25203000
*  CREASF20 CONSTANT(032),          /* INVOKE CVAFDIR - WRITE FMT1      25203200
*                                      DSCB                          */ 25203400
*  CREASF21 CONSTANT(033),          /* READ FMT4 DSCB AND CHECK FOR     25203600
*                                      DUPLICATE DATA SET NAME       */ 25203800
*  CREASF22 CONSTANT(034),          /* VERIFY ENOUGH SPACE IN VTOC      25204000
*                                      OR VTOC INDEX                 */ 25204200
*  CREASF23 CONSTANT(035),          /* CONVERT EXTENT FROM CYL/TRK      25204400
*                                      FORMAT (CCHH) TO RELATIVE        25204600
*                                      TRACK ADDRESS (RTA)           */ 25204800
*  CREASF24 CONSTANT(036),          /* READ FMT5 DSCB                */ 25205000
*  CREASF25 CONSTANT(037),          /* VERIFY SPACE REQUESTED IS        25205200
*                                      AVAILABLE                     */ 25205400
*  CREASF26 CONSTANT(038),          /* WRITE FMT1 DSCB               */ 25205600
*  CREASF27 CONSTANT(039),          /* WRITE FMT3 DSCB               */ 25205800
*  CREASF28 CONSTANT(040),          /* WRITE FMT5 DSCB               */ 25206000
*  CREASF29 CONSTANT(041),          /* READ FMT0 DSCB                */ 25206200
*  CREASF2A CONSTANT(042),          /* WRITE FMT0 DSCB               */ 25206400
*  CREASF2B CONSTANT(043),          /* WRITE FMT4 DSCB               */ 25206600
*  CREASF2C CONSTANT(044),          /* CREATE VIO DATA SET           */ 25206800
*  CREASF2D CONSTANT(045),          /* VALIDATE ISAM REQUEST         */ 25207000
*  CREASF2E CONSTANT(046),          /* WRITE FMT2 DSCB               */ 25207200
*  CREASF2F CONSTANT(047),          /* INVOKE CVAFDSM - ADD DATA SET    25207400
*                                      NAME TO INDEX                 */ 25207600
*  CREASF30 CONSTANT(048),          /* INVOKE CVAFDIR - WRITE FMT2      25207800
*                                      DSCB                          */ 25208000
*  CREASF31 CONSTANT(049),          /* INVOKE CVAFDIR - WRITE FMT3      25208200
*                                      DSCB                          */ 25208400
*  CREASF32 CONSTANT(050),          /* INVOKE CVAFDIR - CHECK FOR       25208600
*                                      DUPLICATE DATA SET NAME       */ 25208800
*  CREASF33 CONSTANT(051),          /* VALIDATE ISAM MULTI-VOLUME       25209000
*                                      REQUEST                       */ 25209200
*  CREASF34 CONSTANT(052),          /* OS VTOC CHANNEL PROGRAM ISSUED   25209400
*                                      TO READ FMT4, READ FMT5, CHECK   25209600
*                                      FOR DUPLICATE DATA SET NAME,     25209800
*                                      AND READ FMT1                 */ 25210000
*  CREASF35 CONSTANT(053),          /* CONTINUE DUPLICATE NAME SEARCH   25210200
*                                      DOS PACK                      */ 25210400
*  CREASF36 CONSTANT(054),          /* OS VTOC CHANNEL PROGRAM ISSUED   25210600
*                                      TO READ FMT4, READ FMT5, CHECK   25210800
*                                      FOR DUPLICATE DATA SET NAME,     25211000
*                                      AND READ FMT1, AFTER CVAFVRF     25211200
*                                      DISABLED THE VTOC INDEX       */ 25211400
*  CREASF37 CONSTANT(055),          /* OS VTOC CHANNEL PROGRAM ISSUED   25211600
*                                      TO READ FMT4, READ FMT5, CHECK   25211800
*                                      FOR DUPLICATE DATA SET NAME,     25212000
*                                      AND READ FMT1, AFTER IGGVRF00    25212200
*                                      DISABLED THE VTOC INDEX       */ 25212400
*  CREASF38 CONSTANT(056),          /* FIND SPACE FOR USER LABEL     */ 25212600
*/********************************************************************/ 25212700
*/* FOLLOWING CODES, PLUS THOSE AT F0-FF ARE VTOC CONVERSION CODES   */ 25212800
*/* WHICH ARE SHARED WITH EXTEND (X39-X44)                           */ 25212900
*/********************************************************************/ 25213000
*  CREASF39 CONSTANT(057),          /* VTOC CONVERSION - READ DSCBS -   25213100
*                                      IGG0325P                      */ 25213200
*  CREASF3A CONSTANT(058),          /* VTOC CONVERSION - FIND  FMT0     25213300
*                                      DSCB - IGG0325T               */ 25213400
*/*CREASF3B CONSTANT(059),             *OBSOLETE*               1@L2D*/ 25213500
*/*CREASF3C CONSTANT(060),             *OBSOLETE*               1@L2D*/ 25213600
*  CREASF3D CONSTANT(061),          /* VTOC CONVERSION - OVERLAPPING    25213700
*                                      EXTENTS DETECTION - IGG0325R  */ 25213800
*/*CREASF3E CONSTANT(062),             *OBSOLETE*               1@L2D*/ 25213900
*  CREASF3F CONSTANT(063),          /* VTOC CONVERSION - WRITE FMT0     25215200
*                                      DSCB - IGG0325T           @L2C*/ 25215400
*  CREASF40 CONSTANT(064),          /* VTOC CONVERSION - WRITE FMT4     25215600
*                                      DSCB - IGG0325T               */ 25215800
*  CREASF41 CONSTANT(065),          /* VTOC CONVERSION - WRITE FREE     25216000
*                                      SPACE DSCB - IGG0325T         */ 25216200
*/*CREASF42 CONSTANT(066),             *OBSOLETE*               1@L2D*/ 25216400
*/*CREASF43 CONSTANT(067),             *OBSOLETE*               1@L2D*/ 25216600
*  CREASF44 CONSTANT(068),          /* VTOC CONVERSION - READ 2ND       25216800
*                                      DSCB - IGG0325Z               */ 25217000
*  CREASF45 CONSTANT(069),          /* INVOKE DASDCALC FOR OPTIMAL      25217500
*                                      BLOCKSIZE                     */ 25217600
*  CREASF46 CONSTANT(070),          /* INVOKE CDM TO CREATE A PDSE      25217700
*                                      DIRECTORY                 @07C*/ 25217800
*  CREASF47 CONSTANT(071),          /* VTOC ENQ PROCESSING       @06C*/ 25218300
*  CREASF48 CONSTANT(072),          /* PDS DIRECTORY BUILD              25218800
*                                      CONVERT TTR               @06A*/ 25219300
*  CREASF49 CONSTANT(073),          /* PDS DIRECTORY BUILD              25219800
*                                      EXCP WRITE PDS DIRECTORY  @06A*/ 25220300
*  CREASF4A CONSTANT(074),          /* INVOKE TRKCALC FOR MAXIMUM       25220400
*                                      R1 VALUE                  @10A*/ 25220500
*  CREASF4B CONSTANT(075),          /* EOF MARK WRITE                   25220600
*                                      CONVERT TTR               @L4C*/ 25220700
*  CREASF4C CONSTANT(076),          /* EOF MARK WRITE                   25220800
*                                      EXCP WRITE                @L4C*/ 25220900
*  CREASF4D CONSTANT(077),          /* INVOKE CDM TO CREATE A PDSE/X    25221000
*                                      DIRECTORY                 @L3A*/ 25221100
*  CREASF4E CONSTANT(078),          /* VERIFY SPACE REQUESTED IS @L2A   25221200
*                                      AVAILABLE                 @L2A   25221300
*                                      MODULE IGG0325B.          @L2A*/ 25221400
*  CREASF4F CONSTANT(079),          /* IGGDADTS DETECTED ERROR   @L2A   25221500
*                                      DURING FREE SPACE SEARCH  @L2A   25221600
*                                      MODULE IGG0325D.          @L2A*/ 25221700
*  CREASF50 CONSTANT(080),          /* IGGDADTS DETECTED ERROR   @L2A   25221800
*                                      DURING FREE SPACE SEARCH  @L2A   25221900
*                                      MODULE IGG0325K.          @L2A*/ 25222000
*  CREASF51 CONSTANT(081),          /* NOT USED                  @L2A*/ 25222100
*  CREASF52 CONSTANT(082),          /* READ FIRST FMT 7 DSCB     @L2A   25222300
*                                      MODULE IGG0325A.          @L2A*/ 25222400
*  CREASF53 CONSTANT(083),          /* VALIDATE FMT 7 DSCB       @L2A   25222500
*                                      MODULE IGG0325A.          @L2A*/ 25222600
*  CREASF54 CONSTANT(084),          /* IGGDADTS DETECTED ERROR   @L2A   25222700
*                                      DURING FREE-SPACE SEARCH  @L2A   25222800
*                                      MODULE IGG0325C.          @L2A*/ 25222900
*  CREASF55 CONSTANT(085),          /* IGGDADTS DETECTED ERROR   @L2A   25223000
*                                      DURING FREE-SPACE UPDATE  @L2A   25223100
*                                      MODULE IGG0325G.          @L2A*/ 25223200
*  CREASF56 CONSTANT(086),          /* IGGDADTS DETECTED ERROR   @L2A   25223300
*                                      DURING FREE-SPACE UPDATE  @L2A   25223400
*                                      MODULE IGG0325G.          @L2A*/ 25223500
*  CREASF57 CONSTANT(087),          /* IGGDAEDS DETECTED ERROR   @L2A   25223600
*                                      DURING ABSOLUTE DSCB      @L2A   25223700
*                                      CONVERSION.               @L2A   25223800
*                                      MODULE IGG0325B.          @L2A*/ 25223900
*  CREASF58 CONSTANT(088),          /* IGGDADTS DETECTED ERROR   @L2A   25224000
*                                      DURING DT2EDT02 SORT.     @L2A   25224100
*                                      MODULE IGG0325E.          @L2A*/ 25224200
*  CREASF59 CONSTANT(089),          /* IGGDAEDS DETECTED ERROR   @L2A   25224300
*                                      DURING F1/F3 BUILD.       @L2A   25224400
*                                      MODULE IGG0325E.          @L2A*/ 25224500
*  CREASF5A CONSTANT(090),          /* IGGDADTS DETECTED ERROR   @L2A   25224600
*                                      DURING FREE SPACE SEARCH  @L2A   25224700
*                                      MODULE IGG032I2.          @L2A*/ 25224800
*  CREASF5B CONSTANT(091),          /* VERIFY SPACE REQUESTED IS        25224900
*                                      AVAILABLE, ISAM PATH,            25225000
*                                      OSVTOC VOLUME, CYL REQUEST.      25225100
*                                      MODULE IGG032I2.          @L2A*/ 25225200
*  CREASF5C CONSTANT(092),          /* VERIFY SPACE REQUESTED IS        25225300
*                                      AVAILABLE, ISAM PATH,            25225400
*                                      IXVTOC VOLUME, ABSTR             25225500
*                                      REQUEST.                         25225600
*                                      MODULE IGG032I2.          @L2A*/ 25225700
*  CREASF5D CONSTANT(093),          /* IGGDAEDS DETECTED ERROR   @L2A   25225800
*                                      DURING F1/F3 BUILD.       @L2A   25225900
*                                      MODULE IGG032I3.          @L2A*/ 25226000
*  CREASF5E CONSTANT(094),          /* IGGDAEDS DETECTED ERROR   @L2A   25226100
*                                      DURING F1/F3 BUILD.       @L2A   25226200
*                                      MODULE IGG032I4.          @L2A*/ 25226300
*  CREASF5F CONSTANT(095),          /* READ FIRST FMT 7 DSCB     @L2A   25226400
*                                      MODULE IGG032I8.          @L2A*/ 25226500
*  CREASF60 CONSTANT(096),          /* IGGDAC02, SETUP_JFCB_INFO        25226600
*                                      CONVERT PRIMARY KB IN            25226700
*                                      DACRE TO TRACKS           @11A*/ 25226800
*  CREASF61 CONSTANT(097),          /* IGGDAC02, SETUP_JFCB_INFO        25226900
*                                      CONVERT SECONDARY KB IN          25227000
*                                      DACRE TO TRACKS           @11A*/ 25227100
*  CREASF62 CONSTANT(098),          /* IGGDAC02, SETUP_JFCB_INFO        25227200
*                                      CONVERT PRIMARY KB IN DACRE      25227300
*                                      TO BLOCKS FOR AVG BLK     @11A*/ 25227400
*  CREASF63 CONSTANT(099),          /* IGGDAC02, SETUP_JFCB_INFO        25227500
*                                      CONVERT SECONDARY KB IN DACRE    25227600
*                                      TO BLOCKS FOR AVG BLK     @11A*/ 25227700
*  CREASF64 CONSTANT(100),          /* IGGDAC02, SETUP_JFCB_INFO        25227800
*                                      CONVERT PRIMARY KB IN DACRE      25227900
*                                      TO BLOCKS FOR AVG REC     @11A*/ 25228000
*  CREASF65 CONSTANT(101),          /* IGGDAC02, SETUP_JFCB_INFO        25228100
*                                      CONVERT SECONDARY KB IN DACRE    25228200
*                                      TO BLOCKS FOR AVG REC     @11A*/ 25228300
*  CREASF66 CONSTANT(102),          /* IGGDAC02, SETUP_JFCB_INFO        25228400
*                                      CONVERT PRIMARY IN JFCB          25228500
*                                      TO BLOCKS FOR AVG REC     @11A*/ 25228600
*  CREASF67 CONSTANT(103),          /* IGGDAC02, SETUP_JFCB_INFO        25228700
*                                      CONVERT SECONDARY IN JFCB        25228800
*                                      TO BLOCKS FOR AVG REC     @11A*/ 25228900
*  CREASF68 CONSTANT(104),          /* IGGDAC02, SETUP_MDSCB_INFO       25229000
*                                      CONVERT PRIMARY KB OR MB         25229100
*                                      IN DACRE TO BLOCKS        @11A*/ 25229200
*  CREASF69 CONSTANT(105),          /* IGGDAC02, SETUP_MDSCB_INFO       25229300
*                                                                @11A*/ 25229400
*  CREASF6A CONSTANT(106),          /* IGGDAC02, SETUP_MDSCB_INFO       25229500
*                                      CONVERT PRIMARY KB OR MB         25229600
*                                      IN DACRE TO TRACKS        @11A*/ 25229700
*  CREASF6B CONSTANT(107),          /* IGG0325G, PROCESSING             25229800
*                                      SELECTED EXTENTS. ALL FREE       25229900
*                                      EXTENTS PROCESSED BUT NOT        25230000
*                                      ALL SELECTED EXTENTS.     @12A*/ 25230100
*  CREASF6C CONSTANT(108),          /* IGG0325G, MERGING SELECTED       25230200
*                                      EXTENTS WITH FS FOR REAR OR      25230300
*                                      COMPLETE ALLOCATION.      @12A*/ 25230400
*  CREASF6D CONSTANT(109),          /* IGG0325G, MERGING SELECTED       25230500
*                                      EXTENTS WITH FS FOR FRONT        25230600
*                                      OR MIDDLE ALLOCATION.     @12A*/ 25230700
*  CREASF6E CONSTANT(110),          /* IGGDAC02, SETUP_JFCB_INFO        25230800
*                                      CONVERT BLOCKS TO PDSE BLOCKS    25230900
*                                      FOR AVG BLOCK REQUEST     @13A*/ 25231000
*  CREASF6F CONSTANT(111),          /* IGGDAC02, SETUP_MDSCB_INFO       25231100
*                                      CONVERT BLOCKS TO PDSE BLOCKS    25231200
*                                      FOR AVG BLOCK REQUEST     @13A*/ 25231300
*  CREASF70 CONSTANT(112),          /* INVOKE RACF TO CHECK AUTHORITY   25231400
*                                      TO MODEL PROFILE          @14A*/ 25231500
*  CREASF71 CONSTANT(113),          /* INVOKE Capture_Ucb proc   @KCA*/ 25231600
*  CREASF72 CONSTANT(114),          /* Issue DASDCALC to obtain half    25231700
*                                      track blksize for compressed     25231800
*                                      data set allocation       @16A*/ 25231900
*  CREASF73 CONSTANT(115),          /* IGGDADTS DETECTED ERROR   @18A   25232000
*                                      DURING FREE SPACE UPDATE  @18A   25232100
*                                      MODULE IGG032I6.          @18A*/ 25232200
*  CREASF74 CONSTANT(116),          /* IGGDACO2, X37 ABEND       @L8A   25232400
*                                      RELEIF SETUP AND PARM     @L8A   25232600
*                                      CHECK                     @L8A*/ 25232800
*  CREASF75 CONSTANT(117),          /* IGG0325B, X37 ABEND       @L8A   25233000
*                                      RELEIF. MIN ALLOCATION    @L8A   25233200
*                                      CHECK                     @L8A*/ 25233400
*  CREASF76 CONSTANT(118),          /* IGG0325D, X37 ABEND       @L8A   25233600
*                                      RELIEF. MIN ALLOCATION    @L8A   25233800
*                                      CHECK                     @L8A*/ 25234000
*  CREASF77 CONSTANT(119),          /* IGGDAC02, SPACE NOT AVAIL        25234100
*                                      ON LSA DEVICE             @L9A*/ 25234200
*/********************************************************************/ 25234300
*/* FOLLOWING CODES, PLUS THOSE AT 39-44 ARE VTOC CONVERSION CODES   */ 25234400
*/* WHICH ARE SHARED WITH EXTEND                                     */ 25234600
*/********************************************************************/ 25234800
*  CREASFF0 CONSTANT(240),          /* VTOC CONVERSION - DIRF CONVERT   25235000
*                                      PREVENTED BY ZAP TO IGG0325Z -   25235200
*                                      IGG0325Z                  @L2A*/ 25235400
*  CREASFF1 CONSTANT(241);          /* VTOC CONVERSION - ALLOCATED      25235600
*                                      EXTENT VALIDATION - IGG0325P     25235800
*                                                                @L2A*/ 25236000
*                                                                       25236200
*DECLARE                                                                25236400
*    /****************************************************************/ 25236600
*    /* SUBFUNCTION REASON CODES                                     */ 25236800
*    /****************************************************************/ 25237000
*  CREARS01 CONSTANT(001),          /* EXTEND - PASSED DEB ADDRESS      25237200
*                                      IS ZERO                       */ 25237400
*  CREARS02 CONSTANT(002),          /* EXTEND - PASSED UCB ADDRESS      25237600
*                                      IS ZERO                       */ 25240200
*  CREARS03 CONSTANT(003),          /* EXTEND - DATA SET NAME IS        25245800
*                                      VTOC INDEX NAME               */ 25251400
*  CREARS04 CONSTANT(004),          /* ABSOLUTE TRACK DATA SETS NOT     25255600
*                                      SUPPORTED ON SMS MANAGED         25259800
*                                      VOLUMES                   @P3C*/ 25264000
*  CREARS05 CONSTANT(005),          /* EXTEND - DATA SET NAME IS        25268200
*                                      FMT4 DSCB NAME                */ 25273800
*  CREARS06 CONSTANT(006),          /* EXTEND - DATA SET TO BE EXTENDED 25279400
*                                      IS VSAM                       */ 25285000
*  CREARS07 CONSTANT(007),          /* LOGICAL ERROR ON SSI CALL -      25290600
*                                      BAD SSOB FORMAT, LENGTH, ETC. */ 25296200
*  CREARS08 CONSTANT(008),          /* EXTEND - INVALID REQUEST FLAG:   25301800
*                                      ONLY THE FLAG BIT REQUESTING     25307400
*                                      EXTEND TO NEW VOLUME MAY         25313000
*                                      BE 'ON'                       */ 25318600
*  CREARS09 CONSTANT(009),          /* EXTEND - BOTH JFCBDRLH AND       25324200
*                                      JFCBLKSI ARE ZERO FOR A DATA     25329800
*                                      SET ALLOCATED BY AVERAGE BLOCK*/ 25335400
*  CREARS0A CONSTANT(010),          /* EXTEND - DS1SCXTV VALUE EXISTS   25341000
*                                      BUT NO DS1SCXTF FLAG SET */      25346600
*  CREARS0B CONSTANT(011),          /* INVALID RALPLID FIELD         */ 25346700
*  CREARS0C CONSTANT(012),          /* INVALID RALNGTH FIELD         */ 25346800
*  CREARS0D CONSTANT(013),          /* RALPDSCB IS ZERO              */ 25346900
*  CREARS0E CONSTANT(014),          /* RALUCB IS ZERO                */ 25347000
*  CREARS0F CONSTANT(015),          /* RALUCB IS DUMMY SMS UCB       */ 25347100
*  CREARS10 CONSTANT(016),          /* RALFLAG CONTAINS NON-ZERO        25347200
*                                      RESERVED FLAGS                */ 25347300
*  CREARS11 CONSTANT(017),          /* RALABS NOT SUPPORTED FOR THIS    25347400
*                                      VERSION OF PARAMETER LIST     */ 25347500
*  CREARS12 CONSTANT(018),          /* INVALID PQTY OR MINAU FOR        25347600
*                                      REQUEST REQUIRING CYLINDER       25347700
*                                      BOUNDARIES                    */ 25347800
*  CREARS13 CONSTANT(019),          /* R1 DOES NOT CONTAIN POINTER TO   25347900
*                                      FULLWORD CONTAINING UCB ADDR  */ 25348000
*  CREARS14 CONSTANT(020),          /* FULLWORD POINTED TO BY R1        25348100
*                                      CONTAINS A DUMMY SMS UCB      */ 25348200
*  CREARS15 CONSTANT(021),          /* INVALID DACPLID FIELD-ID      */ 25348300
*  CREARS16 CONSTANT(022),          /* INVALID DACPVER FIELD-VERSION */ 25348400
*  CREARS17 CONSTANT(023),          /* INVALID DACPLEN FIELD-LENGTH  */ 25348500
*  CREARS18 CONSTANT(024),          /* DACEXPTR IS ZERO              */ 25348600
*  CREARS19 CONSTANT(025),          /* DACJFCB, DACMDSCB, OR DACADSCB   25348700
*                                      NOT SET (INTERFACE FLAG)      */ 25348800
*  CREARS1A CONSTANT(026),          /* MORE THAN ONE INTERFACE FLAG     25348900
*                                      SPECIFIED                     */ 25349000
*  CREARS1B CONSTANT(027),          /* VIO NOT SUPPORTED FOR MDSCB OR   25349100
*                                      ADSCB INTERFACE               */ 25349200
*  CREARS1C CONSTANT(028),          /* DACRSRBT MUST BE ZERO         */ 25349300
*  CREARS1D CONSTANT(029),          /* DACRSRV1 MUST BE ZERO         */ 25349400
*  CREARS1E CONSTANT(030),          /* DACRSRV2 MUST BE ZERO         */ 25349500
*  CREARS1F CONSTANT(031),          /* DACRSRV3 MUST BE ZERO         */ 25349600
*  CREARS20 CONSTANT(032),          /* DACRSRV4 MUST BE ZERO         */ 25349700
*  CREARS21 CONSTANT(033),          /* DACRSRVF MUST BE ZERO         */ 25349800
*  CREARS22 CONSTANT(034),          /* DACUCB IS ZERO                */ 25349900
*  CREARS23 CONSTANT(035),          /* DACUCB IS A DUMMY SMS UCB     */ 25350000
*  CREARS24 CONSTANT(036),          /* DACGENMP SET BUT DACSECMP        25350100
*                                      IS ZERO                       */ 25350200
*  CREARS25 CONSTANT(037),          /* DACPROFM SET BUT DACSECMP IS     25350300
*                                      NOT ZERO                      */ 25350400
*  CREARS26 CONSTANT(038),          /* DACJFCBP IS ZERO              */ 25350500
*  CREARS27 CONSTANT(039),          /* DACIJRS1 MUST BE ZERO         */ 25350600
*  CREARS28 CONSTANT(040),          /* DACDSABP IS ZERO FOR AN ISAM     25350700
*                                      DATA SET                      */ 25350800
*  CREARS29 CONSTANT(041),          /* DACSECVL SET BUT DACVOLSQ OR     25350900
*                                      DACDSSNM IS ZERO              */ 25351000
*  CREARS2A CONSTANT(042),          /* DACDSCBM IS ZERO              */ 25351100
*  CREARS2B CONSTANT(043),          /* MUST SET SPACE REQUEST FLAG   */ 25351200
*  CREARS2C CONSTANT(044),          /* MORE THAN ONE SPACE REQUEST      25351300
*                                      FLAG SET                      */ 25351400
*  CREARS2D CONSTANT(045),          /* DACIMRS1 MUST BE ZERO         */ 25351500
*  CREARS2E CONSTANT(046),          /* DACIMRS2 MUST BE ZERO         */ 25351600
*  CREARS2F CONSTANT(047),          /* DACDSCB1 IS ZERO              */ 25351700
*  CREARS30 CONSTANT(048),          /* DACRTPTR CANNOT BE ZERO FOR      25351800
*                                      VIO DATA SETS                 */ 25351900
*  CREARS31 CONSTANT(049),          /* DACAVGRC VALUE INVALID        */ 25352000
*                                                                       25352200
*  CREARS32 CONSTANT(050),          /* DACSECVL CANNOT BE SET FOR       25352600
*                                      VIO DATA SETS                 */ 25353000
*  CREARS33 CONSTANT(051),          /* CVOL'S NOT                       25353400
*                                      SUPPORTED ON SMS MANAGED         25353800
*                                      VOLUMES                   @P3C*/ 25354200
*  CREARS34 CONSTANT(052),          /* UNMOVABLE DATA SETS NOT          25354600
*                                      SUPPORTED ON SMS MANAGED         25355000
*                                      VOLUMES                   @P3C*/ 25355400
*  CREARS35 CONSTANT(053),          /* PRIMARY OR SECONDARY QUANTITY    25356200
*                                      IS TOO LARGE TO ALLOCATE DATA    25356600
*                                      SET                           */ 25357000
*  CREARS36 CONSTANT(054),          /* ADSCB REQ - INVALID FMT2 KEY  */ 25357100
*  CREARS37 CONSTANT(055),          /* ADSCB REQ - INVALID FMT2 ID   */ 25357200
*  CREARS38 CONSTANT(056),          /* ADSCB REQ - FMT1 DSORG MUST      25357300
*                                      INDICATE ISAM DATA SET        */ 25357400
*  CREARS39 CONSTANT(057),          /* DATA SET NAME IS VTOC NAME    */ 25357500
*  CREARS3A CONSTANT(058),          /* MDSCB INDICATES                  25357600
*                                      ISAM DATA SET.  ISAM DATA SET    25357700
*                                      INVALID FOR MODEL DSCB REQ    */ 25357800
*  CREARS3B CONSTANT(059),          /* ADSCB REQ - SPACE REQUESTED      25357900
*                                      AT ABSOLUTE TRACK 0           */ 25358000
*  CREARS3C CONSTANT(060),          /* MDSCB REQ - NO DIRECTORY         25358100
*                                      QUANTITY SPECIFIED FOR PDS DATA  25358200
*                                      SET WHEN PRIMARY QUANTITY IS     25358300
*                                      NOT ZERO                      */ 25358400
*  CREARS3D CONSTANT(061),          /* MDSCB REQ - DIRECTORY QUANTITY   25358500
*                                      SPECIFIED BUT NOT PDS DATA SET*/ 25358600
*  CREARS3E CONSTANT(062),          /* ADSCB REQ - DIRECTORY QUANTITY   25358700
*                                      SPECIFIED BUT NOT PDS DATA SET*/ 25358800
*  CREARS3F CONSTANT(063),          /* ADSCB REQ - NO DIRECTORY         25358900
*                                      QUANTITY SPECIFIED FOR PDS DATA  25359000
*                                      SET WHEN PRIMARY QUANTITY IS     25359100
*                                      NOT ZERO                      */ 25359200
*  CREARS40 CONSTANT(064),          /* MDSCB OR ADSCB ADDRESS INVALID*/ 25359300
*  CREARS41 CONSTANT(065),          /* ADSCB REQ - ZERO SPACE           25359400
*                                      REQUESTED AT ABSOLUTE TRACK 0 */ 25359500
*  CREARS42 CONSTANT(066),          /* JFCB REQ - DSORG CAN NOT BE      25359600
*                                      ISAM OR PDS                   */ 25359700
*  CREARS43 CONSTANT(067),          /* JFCB REQ - DSORG CAN NOT BE      25359800
*                                      GRAPHICS                      */ 25359900
*  CREARS44 CONSTANT(068),          /* JFCB REQ - DIRECTORY QUANTITY    25360000
*                                      CAN NOT BE SPECIFIED          */ 25360100
*  CREARS45 CONSTANT(069),          /* ADSCB REQ - DSORG CAN NOT BE     25360200
*                                      ISAM OR PDS                   */ 25360300
*  CREARS46 CONSTANT(070),          /* ADSCB REQ - FMT3 DSCB PRESENT    25360400
*                                      & NUMBER OF EXTENTS > 15      */ 25360500
*  CREARS47 CONSTANT(071),          /* ADSCB REQ - FMT3 DSCB PRESENT    25360600
*                                      & NUMBER OF EXTENTS < 3       */ 25360700
*  CREARS48 CONSTANT(072),          /* ADSCB REQ - NO FMT3 DSCB PRESENT 25360800
*                                      & NUMBER OF EXTENTS > 2       */ 25360900
*  CREARS49 CONSTANT(073),          /* ADSCB REQ - PRIMARY QUANTITY     25361000
*                                      IS ZERO                       */ 25361100
*  CREARS4A CONSTANT(074),          /* PRIMARY QUANTITY IS ZERO BUT     25361200
*                                      MINIMUM ALLOCATION UNIT IS       25361300
*                                      NOT ZERO                      */ 25361400
*  CREARS4B CONSTANT(075),          /* PRIMARY QUANTITY IS < ZERO    */ 25361500
*  CREARS4C CONSTANT(076),          /* MINIMUM ALLOCATION UNIT IS       25361600
*                                      < ZERO                        */ 25361700
*  CREARS4D CONSTANT(077),          /* ADSCB REQ - INVALID FMT3 KEY  */ 25361800
*  CREARS4E CONSTANT(078),          /* ADSCB REQ - INVALID FMT3 ID   */ 25361900
*  CREARS4F CONSTANT(079),          /* ADSCB REQ - NUMBER OF EXTENTS    25362000
*                                      IS > 16                       */ 25362100
*  CREARS50 CONSTANT(080),          /* ADSCB REQ - NUMBER OF EXTENTS    25362200
*                                      IS < 4                        */ 25362300
*  CREARS51 CONSTANT(081),          /* ADSCB REQ - NO FMT3 DSCB PRESENT 25362400
*                                      & NUMBER OF EXTENTS > 3       */ 25362500
*  CREARS52 CONSTANT(082),          /* DATA SET PROTECTED BY DISCRETE   25362600
*                                      PROFILE BUT RACF NOT ACTIVE   */ 25362700
*  CREARS53 CONSTANT(083),          /* VOLUME IN CONVERSION TO SMS   */ 25362800
*  CREARS54 CONSTANT(084),          /* FMT4 DSCB INDICATES VOLUME       25362900
*                                      NOT SMS BUT DATA SET IS       */ 25363000
*  CREARS55 CONSTANT(085),          /* FMT4 DSCB INDICATES VOLUME       25363100
*                                      IS SMS BUT DATA SET IS NOT    */ 25363200
*  CREARS56 CONSTANT(086),          /* I/O ERROR DURING VRF RECOVERY    25363300
*                                      ROUTINE EXECUTION             */ 25363400
*  CREARS57 CONSTANT(087),          /* BEGINNING REQUESTED ABSOLUTE     25363500
*                                      TRACK IS > LAST FREE TRACK    */ 25363600
*  CREARS58 CONSTANT(088),          /* OS VTOC - DATA SET ALREADY       25363700
*                                      EXISTS ON VOLUME BUT FMT1 DSCB   25363800
*                                      ID IS INVALID                 */ 25363900
*  CREARS59 CONSTANT(089),          /* DATA SET NAME IS INDEXED VTOC    25364000
*                                      HIGH WATER MARK KEY (44 BYTES    25364100
*                                      OF X'FF')                     */ 25364200
*  CREARS5A CONSTANT(090),          /* DATA SET NAME IS VTOC INDEX      25364300
*                                      NAME                          */ 25364400
*  CREARS5B CONSTANT(091),          /* MDSCB/ADSCB REQ - DUPLICATE      25364500
*                                      DATA SET NAME                 */ 25364600
*  CREARS5C CONSTANT(092),          /* JFCB REQ - DUPLICATE DATA SET    25364700
*                                      NAME AND NOT ISAM DATA SET    */ 25364800
*  CREARS5D CONSTANT(093),          /* OS VTOC - NO AVAILABLE FMT0      25364900
*                                      DSCB'S IN VTOC                */ 25365000
*  CREARS5E CONSTANT(094),          /* ADSCB REQ - BEGINNING CCHH OF    25365100
*                                      EXTENT IS < ENDING CCHH       */ 25365200
*  CREARS5F CONSTANT(095),          /* ADSCB REQ - CYLINDER VALUE OF    25365300
*                                      CCHH IS > NUMBER OF CYLINDERS    25365400
*                                      ON VOLUME                     */ 25365500
*  CREARS60 CONSTANT(096),          /* ADSCB REQ - TRACK VALUE OF       25365600
*                                      CCHH IS > NUMBER OF TRACKS       25365700
*                                      ON VOLUME                     */ 25365800
*  CREARS61 CONSTANT(097),          /* NUMBER OF TRACKS                 25365900
*                                      NEEDED FOR DIRECTORY IS >        25366000
*                                      MAXIMUM (32767)               */ 25366100
*  CREARS62 CONSTANT(098),          /* ADSCB REQ - USER LABEL EXTENT    25366200
*                                      IS > 1 TRACK                  */ 25366300
*  CREARS63 CONSTANT(099),          /* ADSCB REQ - USER LABEL EXTENT    25366400
*                                      IS NOT THE FIRST EXTENT       */ 25366500
*  CREARS64 CONSTANT(100),          /* ADSCB REQ - TYPE OF EXTENT IS    25366600
*                                      SPLIT CYLINDER                */ 25366700
*  CREARS65 CONSTANT(101),          /* ADSCB REQ - EXTENT SEQUENCE      25366800
*                                      NUMBER IS INVALID             */ 25366900
*                                                                       25367000
*  CREARS66 CONSTANT(102),          /* OS VTOC - LESS THAN 2            25367100
*                                      AVAILABLE FMT0 DSCB'S IN VTOC */ 25367200
*  CREARS67 CONSTANT(103),          /* PART OF REQUESTED ABSOLUTE       25367300
*                                      EXTENT IS NOT FREE SPACE      */ 25367400
*  CREARS68 CONSTANT(104),          /* REQUESTED ABSOLUTE TRACK         25367500
*                                      ADDRESS IS < FIRST FREE TRACK */ 25367600
*  CREARS69 CONSTANT(105),          /* OS VTOC - NUMBER OF AVAILABLE    25367700
*                                      FMT0 DSCB'S IN VTOC IS < 3    */ 25367800
*  CREARS6A CONSTANT(106),          /* OS VTOC - NUMBER OF DSCB'S       25367900
*                                      NEEDED TO CREATE FMT1, FMT3, &   25368000
*                                      FMT5 DSCB'S IS > NUMBER OF       25368100
*                                      AVAILABLE FMT0 DSCB'S IN VTOC */ 25368200
*  CREARS6B CONSTANT(107),          /* NOT ENOUGH SPACE IN FIRST        25368300
*                                      EXTENT FOR DIRECTORY          */ 25368400
*  CREARS6C CONSTANT(108),          /* TOTAL SPACE NEEDED FOR DATA      25368500
*                                      SET = AVAILABLE SPACE BUT        25368600
*                                      EXTRA TRACK NEEDED FOR USER      25368700
*                                      LABEL                         */ 25368800
*  CREARS6D CONSTANT(109),          /* IMBEDDED DIRECTORY SPACE         25368900
*                                      INVALID ON DD STMT FOR INDEX     25369000
*                                      ELEMENT                       */ 25369100
*  CREARS6E CONSTANT(110),          /* EITHER FIRST OR ONLY DD          25369200
*                                      STMT & ISAM                      25369300
*                                      ELEMENT NAME NEITHER BLANK,      25369400
*                                      PRIME, INDEX NOR OVFLOW       */ 25369500
*  CREARS6F CONSTANT(111),          /* MORE THAN ONE DD STMT & ISAM     25369600
*                                      ELEMENT NAME NEITHER BLANK,      25369700
*                                      PRIME, INDEX NOR OVFLOW       */ 25369800
*  CREARS70 CONSTANT(112),          /* TYPE OF SPACE MUST BE CYL OR     25369900
*                                      ABSTR                         */ 25370000
*  CREARS71 CONSTANT(113),          /* FOR IMBEDDED INDEX ONLY ONE      25370100
*                                      VOLUME CAN BE SPECIFIED       */ 25370200
*  CREARS72 CONSTANT(114),          /* IF 3 DD STMTS, ELEMENT NAMES     25370300
*                                      MUST BE SPECIFIED IN THE ORDER   25370400
*                                      OF INDEX, PRIME, OVFLOW       */ 25370500
*  CREARS73 CONSTANT(115),          /* LESS THAN 4 FMT0 DSCB'S          25370600
*                                      AVAILABLE IN VTOC             */ 25370700
*  CREARS74 CONSTANT(116),          /* PROCESSING FIRST DD STMT -       25370800
*                                      DUPLICATE DATA SET NAME       */ 25370900
*  CREARS75 CONSTANT(117),          /* SECOND OR THIRD DD STMT -        25371000
*                                      DUPLICATE DATA SET NAME FOUND    25371100
*                                      ON VOLUME OTHER THAN ONE OF      25371200
*                                      THE VOLUMES ALLOCATED TO         25371300
*                                      FIRST DD STMT                 */ 25371400
*  CREARS76 CONSTANT(118),          /* SPACE ALLOCATED ON MULTIPLE      25371500
*                                      VOLUMES IS < THAN REQUESTED      25371600
*                                      SPACE                         */ 25371700
*  CREARS77 CONSTANT(119),          /* CYL REQUEST - NO FMT5 EXTENT     25371800
*                                      FOUND TO SATISFY USER LABEL      25371900
*                                      SPACE REQUEST                 */ 25372000
*  CREARS78 CONSTANT(120),          /* TRK REQUEST - NO FMT5 EXTENT     25372100
*                                      FOUND TO SATISFY USER LABEL      25372200
*                                      SPACE REQUEST                 */ 25372300
*  CREARS79 CONSTANT(121),          /* DACIJRS2 MUST BE ZERO     @P1A*/ 25372500
*  CREARS7A CONSTANT(122),          /* DACIJRS3 MUST BE ZERO     @P1A*/ 25372700
*  CREARS7B CONSTANT(123),          /* DACAVRCP IS 'ON' BUT DACAVGRC    25372800
*                                      IS ZERO                   @P2A*/ 25372900
*  CREARS7C CONSTANT(124),          /* DACRSRV5 MUST BE ZERO     @P1A*/ 25373100
*  CREARS7D CONSTANT(125),          /* DACLRGEX IS 'ON' BUT EITHER      25373200
*                                      DACJFCBD IS 'ON' FOR JFCB        25373300
*                                      INTERFACE OR, DACMBRQ AND        25373400
*                                      DACKBRQ ARE BOTH 'OFF' FOR       25373500
*                                      MDSCB INTERFACE.  FOR JFCB       25373600
*                                      INTERFACE, DACLRGEX IS ONLY      25373700
*                                      SUPPORTED FOR TRACK OR CYLINDER  25373800
*                                      REQUESTS. FOR MDSCB              25373900
*                                      INTERFACE, DACLRGEX IS ONLY      25374000
*                                      SUPPORTED FOR KB OR MB           25374100
*                                      REQUESTS.                 @PBC*/ 25374200
*  CREARS7E CONSTANT(126),          /* ISAM DATA SETS NOT               25374300
*                                      SUPPORTED ON SMS MANAGED         25374400
*                                      VOLUMES                   @P3C*/ 25374500
*  CREARS7F CONSTANT(127),          /* ABSOLUTE TRACK DATA SETS NOT     25374600
*                                      SUPPORTED ON SMS MANAGED         25374700
*                                      VOLUMES                   @P3C*/ 25374800
*  CREARS80 CONSTANT(128),          /* USER VALUE, DACXTMAX,     @L8C   25375100
*                                      EXCEEDS THE MAX ALLOWABLE @L8C   25375400
*                                      EXTENTS FOR DS.           @L8C*/ 25375700
*  CREARS81 CONSTANT(129),          /* MDSCB REQ - PARTIAL DSCB         25376100
*                                      INDICATES DATA SET ALLOCATED     25376600
*                                      BY ABSOLUTE TRACK         @P5A*/ 25377100
*  CREARS82 CONSTANT(130),          /* DACLRGEX REQ                     25377200
*                                      INVALID WHEN MXIG OR ALX TYPE    25377300
*                                      OF SPACE REQUEST          @PBC*/ 25377500
*  CREARS83 CONSTANT(131),          /* MDSCB OR JFCB REQ - MINIMUM      25377700
*                                      EXTENT QUANTITY (DACMINES OR     25377900
*                                      DACJMNES) INVALID WHEN MXIG      25378100
*                                      OR ALX TYPE OF SPACE REQUEST     25378300
*                                                                @P6A*/ 25378500
*  CREARS84 CONSTANT(132),          /* MDSCB REQ - DACDSSNM CAN NOT     25378700
*                                      BE BLANK FOR SMS MANAGED         25378900
*                                      DATA SET                  @P7A*/ 25379100
*  CREARS85 CONSTANT(133),          /* JFCB REQ - AVGREC INVALID        25379300
*                                      WHEN SPACE REQUESTED IN CYLS     25379500
*                                      OR TRKS                   @PAA*/ 25379700
*  CREARS86 CONSTANT(134),          /* DACLRGEX REQUEST INVALID FOR     25379900
*                                      ADSCB INTERFACE           @PBA*/ 25380100
*  CREARS87 CONSTANT(135),          /* JFCB REQ - AVGREC INVALID        25380300
*                                      IN COMBINATION WITH DACLRGEX     25380500
*                                                                @PBA*/ 25380700
*  CREARS88 CONSTANT(136),          /* PRIMARY QUANTITY IS NOT A        25380800
*                                      MULTIPLE OF MINIMUM EXTENT       25380900
*                                      QUANTITY (DACMINES OR DACJMNES)  25381000
*                                                                @02A*/ 25381100
*  CREARS8A CONSTANT(138),          /* VTOCENQD KEYWORD OF       @08A   25381500
*                                      REALLOC MACRO INVALID FOR @08A   25381600
*                                      ALLOC=ABS.                @08A*/ 25381700
*  CREARS8B CONSTANT(139),          /* CALLER DOES NOT HOLD      @08A   25381800
*                                      VTOC ENQ.                 @08A*/ 25381900
*  CREARS8C CONSTANT(140),          /* UNEXPECTED RC FROM        @08A   25382000
*                                      RESERVE, RET=TEST.        @08A*/ 25382100
*  CREARS8D CONSTANT(141),          /* VTOC ENQ NOT HELD         @08A   25382200
*                                      EXCLUSIVE BY CALLER.      @08A*/ 25382300
*                                                                       25382400
*  CREARS90 CONSTANT(144),          /* PDSE DATA SET CAN NOT BE VIO     25382500
*                                                                @L1A*/ 25382600
*  CREARS91 CONSTANT(145),          /* DACRSRV6 MUST BE ZERO     @L1A*/ 25382700
*  CREARS92 CONSTANT(146),          /* DACSKRSV MUST BE ZERO     @L1A*/ 25382800
*                                                                       25382900
*  CREARS93 CONSTANT(147),          /* KEYLEN MUST BE ZERO FOR          25383000
*                                      PDSE DATA SET             @L1A*/ 25383100
*  CREARS94 CONSTANT(148),          /* USER LABEL NOT ALLOWED FOR       25383200
*                                      PDSE DATA SET             @L1A*/ 25383300
*  CREARS95 CONSTANT(149),          /* DEVICE TRACK CAPACITY TOO SMALL  25383400
*                                      FOR PDSE                  @07C*/ 25383500
*  CREARS96 CONSTANT(150),          /* DIRECTORY SPACE IS LARGER @07A   25383600
*                                      THAN PRIMARY SPACE        @07A*/ 25383700
*  CREARS97 CONSTANT(151),          /* REQUESTED SPACE >=64K TRKS@L2C*/ 25383800
*  CREARS98 CONSTANT(152),          /* NO EXTENTS QUALIFY FOR ALX@07A*/ 25383900
*  CREARS99 CONSTANT(153),          /* NO EXTENT CAN HOLD CONTIG @07A*/ 25384000
*  CREARS9A CONSTANT(154),          /* INSUFFICIENT FREE SPACE ON@07A   25384100
*                                      VOLUME                    @07A*/ 25384200
*  CREARS9B CONSTANT(155),          /* VOLUME TOO FRAGMENTED FOR @07A   25384300
*                                      REQUEST                   @07A*/ 25384400
*  CREARS9C CONSTANT(156),          /* UNEXPECTED TRKCALC RC      @10A  25384500
*                                      FOR FUNCTN=TRKBAL - EITHER @10A  25384600
*                                      0, 4, OR 12 (EXPECT 8)    @10A*/ 25384700
*  CREARS9D CONSTANT(157),          /* DS7KEYID IS INVALID       @L2A*/ 25384800
*  CREARS9E CONSTANT(158),          /* PDSE/X BIT W/O PDSE BIT   @L3A*/ 25385000
*  CREARS9F CONSTANT(159),          /* QUANTITY NOT AVAILABLE    @L2A   25385100
*                                      FOR ISAM DATA SET.        @L2A*/ 25385200
*  CREARSA0 CONSTANT(160),          /* QUANTITY NOT AVAILABLE    @L2A   25385300
*                                      FOR ISAM DATA SET.        @L2A*/ 25385400
*  CREARSA1 CONSTANT(161),          /* QUANTITY NOT AVAILABLE    @L2A   25385500
*                                      FOR ISAM DATA SET.        @L2A*/ 25385600
*  CREARSA2 CONSTANT(162),          /* REQUESTED ABSOLUTE TRACK  @L2A   25385700
*                                      IS NOT AVAILABLE.         @L2A*/ 25385800
*  CREARSA3 CONSTANT(163),          /* THE RTA START OF SELECTED @12A   25385900
*                                      EXTENTS IS LESS THAN RTA  @12A   25386000
*                                      START OF FREE SPACE       @12A   25386100
*                                      EXTENTS.                  @12A*/ 25386200
*  CREARSA4 CONSTANT(164),          /* REQUESTED SPACE NOT              25386300
*                                      AVAILABLE.  LSA DEVICE IN        25386400
*                                      CRITICAL OR EMERGENCY            25386500
*                                      STATUS                    @L9A*/ 25386600
*  CREARSA5 CONSTANT(165),          /* Cannot create HFS data           25386700
*                                      set without security pkg.        25386800
*                                      Ref:  OS/390 Open Edition        25386900
*                                      Planning Guide SC28-1890. @19C*/ 25387000
*  CREARSA6 CONSTANT(166),          /* MAX EXTENT VALUE SUPPLIED @L8A   25387100
*                                      BUT X37 ABEND REDUCTION   @L8A   25387200
*                                      HAS NOT BEEN SPECIFIED.   @L8A*/ 25387300
*  CREARSA7 CONSTANT(167),          /* MIN ALLOCATION QUANTITY   @L8A   25387400
*                                      SUPPLIED BUT 'BEST-FIT'   @L8A   25387500
*                                      HAS NOT BEEN SPECIFIED.   @L8A*/ 25387600
*  CREARSA8 CONSTANT(168),          /* MIN ALLOCATION QUANTITY   @L8A   25387700
*                                      GREATER THEN AVAILABLE    @L8A   25387800
*                                      SPACE.                    @L8A*/ 25387900
*  CREARSA9 CONSTANT(169),          /* MIN ALLOCATION QUANTITY   @L8A   25388000
*                                      GREATER THEN PRIMARY      @L8A   25388100
*                                      SPACE REQUEST             @L8A*/ 25388200
*/********************************************************************/ 25388300
*/* FOLLOWING CODES ARE VTOC CONVERSION CODES WHICH ARE SHARED WITH  */ 25388400
*/* EXTEND                                                           */ 25388500
*/********************************************************************/ 25388600
*  CREARSF0 CONSTANT(240),          /* VTOC CONVERSION SFF1 DETECTED    25388700
                                       SPLIT CYLINDER EXTENT     @L2A*/ 25388800
*  CREARSF1 CONSTANT(241);          /* VTOC CONVERSION SFF1 DETECTED    25388900
                                       CCHH1>CCHH2               @L2A*/ 25389000
*                                                                       25389100
* %IF DAC_SFL = 'N' %THEN %GOTO RESETL_CSF;                             25389200
* %IF DAC_SFL = 'NO' %THEN %GOTO RESETL_CSF;                            25389300
*@LIST POP;                                                             25389400
* %GOTO SK_CSF;                                                         25389500
* %RESETL_CSF: ;                                                        25389600
*@LIST POP;                                                             25389800
* %SK_CSF: ;                                                            25390100
* %GOTO PLSDACRX; /*                                                    25391400
.DACRASM ANOP                                                           25400000
         LCLA  &I            LABEL INDEX NUMBER                         25450000
         LCLA  &NO           LABEL INDEX NUMBER                         25500000
         LCLC  &LBL          LOCAL LABEL VARIABLE                       25550000
         LCLA  &VER          PARAMETER LIST VERSION                     25600000
         LCLA  &LEN          PARAMETER LIST LENGTH                      25650000
         LCLA  &SNUM         NUMBER OF POSSIBLE SECTIONS                25700000
         LCLB  &SFLG(8)      SECTION FLAGS                        @L8C  25750000
         LCLC  &SECT(8)      SECTION NAMES                        @L8C  25800000
         LCLB  &WRNSW        WARNING MESSAGE MNOTE ISSUED               25850000
         LCLB  &ERRSW        ERROR MESSAGE MNOTE ISSUED                 25900000
         LCLB  &GDSECT       GENERATE DSECT                             25950000
         LCLB  &ALLSECT      INCLUDE ALL SECTIONS                       26000000
         LCLB  &NODSECT      NO DSECT STATEMENT                         26050000
.*                                                                      26100000
&NO      SETA  &SYSNDX       SET LABEL INDEX NUMBER                     26150000
&LBL     SETC  '&L'          SET LABEL                                  26200000
&LEN     SETA  52            DEFAULT TO LENGTH 52                 @L8C  26250000
&VER     SETA  1             DEFAULT TO VERSION 1                       26300000
&SNUM    SETA  8             SET NUMBER OF POSSIBLE SECTIONS      @L8C  26350000
&GDSECT  SETB  1             ASSUME THAT DSECT SHOULD BE GENERATED      26400000
&SECT(1) SETC  'PL'          COMMON PORTION OF PARAMETER LIST           26450000
&SECT(2) SETC  'JFCB'        JFCB INTERFACE EXTENSION                   26500000
&SECT(3) SETC  'MDSCB'       MODEL DSCB INTERFACE EXTENSION             26550000
&SECT(4) SETC  'ADSCB'       ABSOLUTE DSCB INTERFACE EXTENSION          26600000
&SECT(5) SETC  'RETA'        RETURN AREA                                26650000
&SECT(6) SETC  'RC'          HISTORIC RETURN CODES AND ERROR CODES      26683300
&SECT(7) SETC  'SF'          SUBFUNCTION ID'S AND REASON CODES          26716600
&SECT(8) SETC  'PLX'         COMMON PARAMETER LIST EXTENSION            26733300
.********************************************************************** 26750000
.* VERIFICATION (1): MF PARAMETER                                       26800000
.********************************************************************** 26850000
.*                                                                      26900000
.V1      AIF   ('&MF(1)' EQ 'D').V1D    IF D FORM, BRANCH               26950000
         AGO   .V1ER1                   ELSE BRANCH (ERROR)             27000000
.*                                                                      27050000
.V1D     AIF   ('&MF' NE 'D').V1D1      IF NOT MF=D, BRANCH             27100000
&ALLSECT SETB  1                        INCLUDE ALL SECTIONS            27150000
         AGO   .V1X                     VERIFICATION COMPLETE           27200000
.*                                                                      27250000
.V1D1    AIF   (N'&MF NE 2).V1ER1       IF MORE THAN TWO PARAMETER,     27300000
.*                                         BRANCH (ERROR)               27350000
&I       SETA  0                        INITIALIZE LOOP INDEX           27400000
.V1LP1   ANOP                           START OF SEARCH LOOP            27450000
&I       SETA  &I+1                     INCREMENT INDEX                 27500000
         AIF   ('&MF(2)' EQ '&SECT(&I)').V1LX1 IF MATCH, EXIT LOOP      27550000
         AIF   (&I GE &SNUM).V1ER1      IF NO MORE SECTIONS TO CHECK,   27600000
.*                                         BRANCH (ERROR)               27650000
         AGO   .V1LP1                   BRANCH TO TOP OF LOOP           27700000
.*                                                                      27750000
.V1LX1   ANOP                           LOOP EXIT                       27800000
&SFLG(&I) SETB 1                        SET SECTION FLAG                27850000
         AGO   .V1X                     VERIFICATION COMPLETE           27900000
.*                                                                      27950000
.V1WR1   ANOP                           WARNING MESSAGE                 28000000
&WRNSW   SETB  1                                                        28050000
         AGO   .V1X                                                     28100000
.*                                                                      28150000
.V1ER1   ANOP                           ERROR MESSAGE                   28200000
         SPACE 1                                                        28250000
         MNOTE 8,'DACRE01E - INVALID OPERAND - MF=&MF'                  28300000
&ERRSW   SETB  1                                                        28350000
.*                                                                      28400000
.V1X     ANOP                                                           28450000
.********************************************************************** 28500000
.* VERIFICATION (2): DSECT PARAMETER                                    28550000
.********************************************************************** 28600000
.*                                                                      28650000
.V2      AIF   ('&DSECT' EQ 'YES').V2X  IF =YES, BRANCH                 28700000
         AIF   ('&DSECT' NE 'NO').V2ER1 IF NOT =NO, ERROR               28750000
&NODSECT SETB  1                        NO DSECT STATEMENT              28800000
         AGO   .V2X                     VERIFICATION COMPLETE           28850000
.*                                                                      28900000
.V2WR1   ANOP                           WARNING MESSAGE                 28950000
&WRNSW   SETB  1                                                        29000000
         AGO   .V2X                                                     29050000
.*                                                                      29100000
.V2ER1   ANOP                           ERROR MESSAGE                   29150000
         SPACE 1                                                        29200000
         MNOTE 8,'DACRE02E - INVALID OPERAND - DSECT=&DSECT'            29250000
&ERRSW   SETB  1                                                        29300000
.*                                                                      29350000
.V2X     ANOP                                                           29400000
.********************************************************************** 29496800
.* CHECK ERRORS                                                         29500000
.********************************************************************** 29550000
.*                                                                      29600000
         AIF   (&ERRSW).FINISH                                          29650000
.********************************************************************** 29700000
.* SECTION (1): COMMON PARAMETER LIST                                   29750000
.********************************************************************** 29800000
.*                                                                      29850000
         AIF   (&ALLSECT).S1A                                           29900000
         AIF   (NOT &SFLG(1)).S1X                                       29950000
.S1A     AIF   (NOT &GDSECT).S1C                                        30000000
&GDSECT  SETB  0                                                        30050000
         AIF   (&NODSECT).S1B                                           30100000
&LBL     DSECT                                                          30150000
         AGO   .S1C                                                     30200000
.S1B     ANOP                                                           30250000
&LBL     DS    0F                                                       30300000
.S1C     ANOP                                                           30350000
.********************************************************************** 30400000
*********************************************************************** 30450000
*    COMMON SECTION                                                   * 30500000
*********************************************************************** 30550000
DACRE    DS    0CL52                    PARAMETER LIST MAPPING     @L8C 30600000
DACPLID  DS    CL8                      ID = 'IGGDACRE'                 30650000
DACPVER  DS    H                        VERSION OF PARAMETER LIST       30700000
DACPLEN  DS    H                        LENGTH OF PARAMETER LIST        30750000
DACPKEY  DS    XL1                      KEY OF PARAMETER LIST           30780000
DACPSKEY EQU   B'11110000'              STORAGE KEY OF PARAMETER LIST   30810000
DACSKRSV EQU   B'00001111'              RESERVED                        30840000
DACRSVBT DS    XL1                      RESERVED                        30870000
DACHRTCD DS    H                        HISTORIC CREATE RETURN CODE     30900000
DACDIAGI DS    F                        DIAGNOSTIC INFORMATION          30950000
* REFER TO DADSM DIAGNOSIS REFERENCE FOR MORE INFORMATION               30975000
         ORG   DACRE+16                                                 31000000
DACERRCD DS    XL1                      DADSM CREATE RETURN CODE        31050000
DACSFNID DS    XL1                      DADSM CREATE SUBFUNCTION ID     31100000
DACSFRSN DS    0XL2                     SUBFUNCTION REASON         @01A 31125000
DACSFRET DS    XL1                      SUBFUNCTION RETURN CODE         31150000
DACSFREA DS    XL1                      SUBFUNCTION REASON CODE         31200000
*                                                                       31225000
DACFLAG1 DS    XL1                      PARAMETER FLAG BYTE             31250000
DACJFCB  EQU   B'10000000'              JFCB                            31300000
DACMDSCB EQU   B'01000000'              MODEL DSCB                      31350000
DACADSCB EQU   B'00100000'              ABSOLUTE DSCB(S)                31400000
DACRSRV1 EQU   B'00011111'              RESERVED                        31450000
DACFLAG2 DS    XL1                      DATA SET INDICATOR FLAG         31500000
DACSMSMG EQU   B'10000000'              SMS MANAGED DATA SET            31550000
DACUNCAT EQU   B'01000000'              UNCATALOGED SMS MANAGED DATA   X31600000
                                        SET                             31650000
DACREBLK EQU   B'00100000'              REBLOCKABLE DATA SET            31683300
DACCOMPR EQU   B'00010000'              DATA SET IS COMPRESSABLE   @L6A 31708200
DACPDSE  EQU   B'00001000'              PDSE TYPE DATA SET         @PEC 31733200
DACSTRP  EQU   B'00000100'              DATA SET IS A STRIPE       @L5A 31762400
DACPDSEX EQU   B'00000010'              HFS TYPE DATA SET          @L3A 31791600
DACDSAE  EQU   B'00000001'              Data set has extended attr@P10C 31820800
DACFLAG3 DS    XL1                      PARAMETER FLAG BYTE             31850000
DACRSV31 EQU   B'10000000'              RESERVED                        31875000
DACSAUTH EQU   B'01000000'              SECURITY AUTHORIZATION OF      X31900000
                                        REQUEST HAS BEEN GUARANTEED BY X31950000
                                        CALLER                          32000000
DACPROFM EQU   B'00100000'              RACF PROFILE MANAGED BY CALLER  32050000
DACGENMP EQU   B'00010000'              GENERIC MODEL PROFILE PROVIDED  32100000
DACRSRV3 EQU   B'00001111'              RESERVED                        32150000
DACFLAG4 DS    XL1                      PARAMETER FLAG BYTE             32200000
DACSECVL EQU   B'10000000'              CREATE ON SECONDARY VOLUME      32250000
DACVIO   EQU   B'01000000'              CREATE A VIO DATA SET           32300000
DACEXRAC EQU   B'00110000'              RACF FLAGS SET BY EXTEND        32314200
DACNDISP EQU   B'00100000'              DISCRETE PROFILE DOES NOT EXISTX32328400
                                        FOR DATA SET                    32342600
DACDISP  EQU   B'00010000'              DISCRETE PROFILE EXISTS FOR    X32356800
                                        DATA SET                        32371000
DACLRGEX EQU   B'00001000'              "Best-fit interface:           X32375800
                                        ALLOCATE 'N' LARGEST EXTENTS   X32380600
                                        EVEN IF TOTAL QUANTITY IS LESS X32385400
                                        THAN RQSTED PRI QUANTITY   @PBC 32390200
DACOPTIC EQU   B'00000100'              DS CATALOGED IN ICF CAT   @L8A  32394800
DACRSRV4 EQU   B'00000011'              RESERVED                   @PBC 32404000
DACXTPTR DS    A                        COMMON PL EXTENTSION PTR   @L8C 32427000
DACUCB   DS    A                        UCB POINTER                     32450000
         ORG   DACRE+28                                                 32500000
DACDEVCD DS    F                        DEVICE TYPE, DACVIO = '1'B      32550000
DACSECMP DS    A                        SECURITY MODEL PROFILE POINTER  32600000
DACEXPTR DS    A                        PARAMETER LIST EXTENSION       X32650000
                                        POINTER                         32700000
DACRTPTR DS    A                        RETURN INFORMATION AREA        X32750000
                                        POINTER                         32800000
DACVOLSQ DS    XL1                      VOLUME SEQUENCE NUMBER     @P1M 32812500
DACRSRV5 DS    XL1                      RESERVED                   @P1A 32825000
DACDSSNM DS    CL6                      DATA SET SERIAL NUMBER     @P1M 32837500
*                                                                       32850000
DACREID  DC    CL8'IGGDACRE'            ID = 'IGGDACRE'                 32875000
DACVER   EQU   &VER                     PARAMETER LIST VERSION   @P11C  32900000
DACVER0  EQU   0                        PARM LIST VERSION 0      @P11A  32925000
DACLEN   EQU   &LEN                     PARAMETER LIST LENGTH           32950000
.S1X     ANOP                                                           33000000
.********************************************************************** 33002100
.* SECTION (8): COMMON PARAMETER LIST EXTENSION                         33004200
.********************************************************************** 33006300
.*                                                                      33008400
.S8      AIF   (&ALLSECT).S8B                                           33010500
         AIF   (NOT &SFLG(8)).S8X                                       33012600
         AIF   (NOT &GDSECT).S8C                                        33014700
&GDSECT  SETB  0                                                        33016800
         AIF   (&NODSECT).S8B                                           33018900
&LBL     DSECT                                                          33021000
         AGO   .S8C                                                     33023100
.S8B     ANOP                                                           33025200
&LBL     DS    0F                                                       33027300
.S8C     ANOP                                                           33029400
.********************************************************************** 33031500
DACCOMXT DS    0CL40                    COMMON PARAMETER LIST      @L8AX33033600
                                        EXTENSION                  @L8A 33035700
DACXTMAX DS    F                        MAX NUMBER OF EXTENTS THAT @L8AX33037800
                                        CAN BE USED TO SATISFY REQ.@L8A 33039900
DACMNQTY DS    F                        MIN ALLOCATION QUANTITY    @L8A 33040800
DACBTALQ DS    H                        ADDITIONAL BYTES TO ALLOC @P11AX33041700
                                        IF BEST FIT AND KB/MB     @P11A 33042600
DACKBALQ DS    H                        ADDITIONAL KILOBYTES TO   @P11AX33043500
                                        ALLOC IF BEST FIT AND MB  @P11A 33044400
DACRSV28 DS    CL28                     RESERVED                  @P11C 33045300
.S8X     ANOP                                                           33046200
.********************************************************************** 33050000
.* SECTION (2): JFCB INTERFACE EXTENSION                                33100000
.********************************************************************** 33150000
.*                                                                      33200000
.S2      AIF   (&ALLSECT).S2B                                           33250000
         AIF   (NOT &SFLG(2)).S2X                                       33300000
         AIF   (NOT &GDSECT).S2C                                        33350000
&GDSECT  SETB  0                                                        33400000
         AIF   (&NODSECT).S2B                                           33450000
&LBL     DSECT                                                          33500000
         AGO   .S2C                                                     33550000
.S2B     ANOP                                                           33600000
&LBL     DS    0F                                                       33650000
.S2C     ANOP                                                           33700000
.********************************************************************** 33750000
*********************************************************************** 33800000
*    JFCB INTERFACE EXTENSION, DACJFCB = '1'B                         * 33850000
*********************************************************************** 33900000
DACIJFCB DS    0CL28                    JFCB INTERFACE EXTENSION        33927200
DACJFCBP DS    A                        JFCB POINTER                    33954400
DACDSABP DS    A                        DSAB LIST POINTER (ISAM DATA   X33981600
                                        SETS)                           34008800
DACPRIKB DS    A                        PRIMARY SPACE IN KILOBYTES,    X34036000
                                        DACJFCBD = '1'B                 34063200
DACSECKB DS    A                        SECONDARY SPACE IN KILOBYTES,  X34090400
                                        DACJFCBD = '1'B                 34117600
DACIJFL1 DS    XL1                      FLAG BYTE                       34144800
DACLASTV EQU   B'10000000'              LAST VOLUME OF MULTI VOLUME    X34172000
                                        DATA SET                        34199200
DACSECRQ EQU   B'01000000'              USE SECONDARY REQUEST QUANTITY  34226400
DACJFCBD EQU   B'00100000'              JFCB DISABLED FOR SPACE. USE   X34253600
                                        VALUES IN DACPRIKB AND         X34280800
                                        DACSECKB FOR PRI/SEC SPACE.     34308000
DACAVRCP EQU   B'00010000'              'AVGREC' VALUE PRESENT          34335200
DACOSECP EQU   B'00001000'              ORIGINAL SECONDARY QUANTITY    X34347200
                                        PRESENT                    @P1A 34359200
DACMNESP EQU   B'00000100'              MINIMUM EXTENT QUANTITY        X34365200
                                        PRESENT                    @PBA 34371200
DACMAXXT EQU   B'00000010'              USE AS MANY EXTENTS AS         X34373200
                                        SUPPORTED BY DATA SET          X34375200
                                        ORGANIZATION TO SATISFY        X34377200
                                        REQUEST                    @L8A 34379200
DACIJRS1 EQU   B'00000001'              RESERVED                   @L8C 34381200
DACIJRS2 DS    CL1                      RESERVED                        34383200
DACIJRS3 DS    XL1                      RESERVED                   @P1A 34431200
DACAVGRC DS    XL1                      FLAG BYTE                       34432000
DACAVGR  EQU   B'11100000'              AVERAGE RECORD INDICATOR.       34432800
*                                       AT MOST ONE OF THESE THREE      34433600
*                                       BITS MAY BE ON.  IF ALL ARE     34434400
*                                       ZERO, THEN THIS IS NOT AN       34435200
*                                       AVERAGE RECORD SPACE REQUEST.   34436000
*                                       THE INDIVIDUAL BITS ARE         34436800
*                                       DEFINED AS FOLLOWS:        @04A 34437600
DACAVGRU EQU   B'10000000'              AVERAGE RECORD SPACE REQUEST.   34438400
*                                       MULTIPLY JFCBPQTY * JFCBDRLH    34439200
*                                       TO GET REQUESTED PRIMARY SPACE  34440000
*                                       IN BYTES.                       34440800
*                                       MULTIPLY JFCBSQTY * JFCBDRLH    34441600
*                                       TO GET REQUESTED SECONDARY      34442400
*                                       SPACE IN BYTES.            @04A 34443200
DACAVGRK EQU   B'01000000'              AVERAGE RECORD SPACE REQUEST.   34444000
*                                       MULTIPLY JFCBPQTY * JFCBDRLH *  34444800
*                                       1024 TO GET REQUESTED PRIMARY   34445600
*                                       SPACE IN BYTES.                 34446400
*                                       MULTIPLY JFCBSQTY * JFCBDRLH *  34447200
*                                       1024 TO GET REQUESTED           34448000
*                                       SECONDARY SPACE IN BYTES.  @04A 34448800
DACAVGRM EQU   B'00100000'              AVERAGE RECORD SPACE REQUEST.   34449600
*                                       MULTIPLY JFCBPQTY * JFCBDRLH *  34450400
*                                       1048576 TO GET REQUESTED        34451200
*                                       PRIMARY SPACE IN BYTES.         34452000
*                                       MULTIPLY JFCBSQTY * JFCBDRLH *  34452800
*                                       1048576 TO GET REQUESTED        34453600
*                                       SECONDARY SPACE IN BYTES.       34454400
DACIJRS4 EQU   B'00011111'              RESERVED.                  @04A 34455200
DACOSQTY DS    F                        ORIGINAL SECONDARY QUANTITY    X34458000
                                        FROM FMT1 (FIELD DS1SCXTV) FOR X34472000
                                        KB/MB DATA SET             @P2C 34486000
DACJMNES DS    F                        MINIMUM EXTENT QUANTITY, IN    X34490600
                                        TRACKS.                    @PBA 34495200
.S2X     ANOP                                                           34500000
.********************************************************************** 34550000
.* SECTION (3): MODEL DSCB INTERFACE EXTENSION                          34600000
.********************************************************************** 34650000
.*                                                                      34700000
.S3      AIF   (&ALLSECT).S3B                                           34750000
         AIF   (NOT &SFLG(3)).S3X                                       34800000
         AIF   (NOT &GDSECT).S3C                                        34850000
&GDSECT  SETB  0                                                        34900000
         AIF   (&NODSECT).S3B                                           34950000
&LBL     DSECT                                                          35000000
         AGO   .S3C                                                     35050000
.S3B     ANOP                                                           35100000
&LBL     DS    0F                                                       35150000
.S3C     ANOP                                                           35200000
.********************************************************************** 35250000
*********************************************************************** 35300000
*    MODEL DSCB INTERFACE EXTENSION, DACMDSCB = '1'B                  * 35350000
*********************************************************************** 35400000
DACIMDSC DS    0CL24                    MODEL DSCB INTERFACE EXTENSION  35450000
DACDSCBM DS    A                        FORMAT 1 DSCB MODEL POINTER     35500000
DACIMFL1 DS    XL1                      FLAG BYTE                  @05C 35550000
DACPSPAC EQU   B'11111000'              PRIMARY SPACE UNITS.       @05A 35560000
*                                       ONE AND ONLY ONE OF THESE       35570000
*                                       BITS SHOULD BE SET.             35580000
DACCYLRQ EQU   B'10000000'              DACPRQTY IS IN CYL.        @05C 35590000
DACTRKRQ EQU   B'01000000'              DACPRQTY IS IN TRK.        @05C 35600000
DACAVRRQ EQU   B'00100000'              DACPRQTY IS IN BLOCKS.     @05C 35610000
DACMBRQ  EQU   B'00010000'              DACPRQTY IS IN MEGABYTES.  @05C 35620000
DACKBRQ  EQU   B'00001000'              DACPRQTY IS IN KILOBYTES.  @05C 35630000
DACIMRS1 EQU   B'00000111'              RESERVED                        35850000
DACIMFL2 DS    XL1                      FLAG BYTE                       35900000
DACMAXEX EQU   B'10000000'              USE AS MANY EXTENTS AS         X35950000
                                        SUPPORTED BY DATA SET          X36000000
                                        ORGANIZATION TO SATISFY        X36050000
                                        REQUEST                         36100000
DACRNDRQ EQU   B'01000000'              ROUND TO CYLINDER BOUNDARY     X36150000
                                        (DOES NOT APPLY TO TRACK       X36200000
                                        REQUEST)                        36250000
DACMUDQR EQU   B'00100000'              USABLE DATA QUANTITY REQUEST.  X36258300
                                        ONLY APPLICABLE FOR DACMBRQ    X36266600
                                        OR DACKBRQ, AND PD1CYL OR      X36274900
                                        OR PD1TRK.  UNDER THESE        X36283200
                                        CONDITIONS, DACMUDQR ON IMPLIESX36291500
                                        DACPRQTY VALUE REPRESENTS      X36299800
                                        USABLE DATA QUANTITY REQUIRED, X36308100
                                        NOT PHYSICAL DASD SPACE        X36316400
                                        REQUIRED.  THIS BIT IS IGNORED X36324700
                                        IN ALL OTHER CASES.        @PDA 36333000
DACVTOCE EQU   B'00010000'              VTOC ENQ IS HELD EXCLUSIVE @08AX36337200
                                        BY CALLER                  @08A 36341400
DACIMRS2 EQU   B'00001111'              RESERVED                   @08C 36345600
DACIMRSF DS    CL2                      RESERVED                        36350000
DACPRQTY DS    F                        PRIMARY REQUEST QUANTITY        36400000
DACAVBLN DS    F                        AVERAGE DATA BLOCK LENGTH,     X36450000
                                        DACAVRRQ = '1'B                 36500000
DACMINES DS    F                        MINIMUM EXTENT SIZE             36550000
DACDRQTY DS    F                        DIRECTORY BLOCK QUANTITY        36600000
.S3X     ANOP                                                           36650000
.********************************************************************** 36700000
.* SECTION (4): ABSOLUTE DSCB INTERFACE EXTENSION                       36750000
.********************************************************************** 36800000
.*                                                                      36850000
.S4      AIF   (&ALLSECT).S4B                                           36900000
         AIF   (NOT &SFLG(4)).S4X                                       36950000
         AIF   (NOT &GDSECT).S4C                                        37000000
&GDSECT  SETB  0                                                        37050000
         AIF   (&NODSECT).S4B                                           37100000
&LBL     DSECT                                                          37150000
         AGO   .S4C                                                     37200000
.S4B     ANOP                                                           37250000
&LBL     DS    0F                                                       37300000
.S4C     ANOP                                                           37350000
.********************************************************************** 37400000
*********************************************************************** 37450000
*    ABSOLUTE DSCB INTERFACE EXTENSION, DACADSCB = '1'B               * 37500000
*********************************************************************** 37550000
DACIADSC DS    0CL12                    ABSOLUTE DSCB INTERFACE        X37600000
                                        EXTENSION                       37650000
DACDSCB1 DS    A                        FORMAT 1 DSCB POINTER           37700000
DACDSCB2 DS    A                        FORMAT 2 DSCB POINTER           37750000
DACDSCB3 DS    A                        FORMAT 3 DSCB POINTER           37800000
DACDQTYA DS    F                        DIRECTORY BLOCK QUANTITY        37850000
.S4X     ANOP                                                           37900000
.********************************************************************** 37950000
.* SECTION (5): RETURN AREA                                             38000000
.********************************************************************** 38050000
.*                                                                      38100000
.S5      AIF   (&ALLSECT).S5B                                           38150000
         AIF   (NOT &SFLG(5)).S5X                                       38200000
         AIF   (NOT &GDSECT).S5C                                        38250000
&GDSECT  SETB  0                                                        38300000
         AIF   (&NODSECT).S5B                                           38350000
&LBL     DSECT                                                          38400000
         AGO   .S5C                                                     38450000
.S5B     ANOP                                                           38500000
&LBL     DS    0F                                                       38550000
.S5C     ANOP                                                           38600000
.********************************************************************** 38650000
*********************************************************************** 38700000
*    CREATE INFORMATION RETURN AREA                                   * 38750000
*********************************************************************** 38800000
DACRETNA DS    0CL24                    RETURN AREA MAPPING        @L8C 38850000
DACRTRQ1 DS    XL1                      RETURN AREA REQUEST FLAGS       38900000
DACRTTR  EQU   B'10000000'              RETURN TTR0 OF FORMAT 1 DSCB    38950000
DACRCHR  EQU   B'01000000'              RETURN CCHHR OF FORMAT 1 DSCB   39000000
DACRTRS1 EQU   B'00111111'              RESERVED                        39050000
DACRTRSF DS    CL3                      RESERVED                        39100000
DACTTRAD DS    CL3                      TTR0 OF FORMAT 1 DSCB           39150000
DACCHRAD DS    CL5                      CCHHR OF FORMAT 1 DSCB          39200000
DACVDSCB DS    A                        VIRTUAL DSCB FOR VIO DATA SET   39250000
DACALQTY DS    F                        AMOUNT OF SPACE ALLOCATED      X39266600
                                        DACLRGEX = '1'B            @P1A 39283200
DACXTQTY DS    F                        NUMBER OF EXTENTS USED     @L8AX39288800
                                        DACMAXEX = '1'B            @L8A 39294400
DACBTQTY DS    H                        AMOUNT OF BTYES ALLOCATED @P11AX39295200
                                        BUT NOT ACCOUNTED FOR IN       X39296000
                                        DACALQTY                        39296800
DACKBQTY DS    H                        AMOUNT OF KILOBYTES ALLOC @P11AX39297600
                                        BUT NOT ACCOUNTED FOR IN       X39298400
                                        DACALQTY                        39299200
*                                                                       39300000
.S5X     ANOP                                                           39350000
.********************************************************************** 39400000
.* SECTION (6): CONSTANTS                                               39450000
.********************************************************************** 39500000
.*                                                                      39550000
.S6      AIF   (&ALLSECT).S6B                                           39600000
         AIF   (NOT &SFLG(6)).S6X                                       39650000
         AIF   (NOT &GDSECT).S6C                                        39700000
&GDSECT  SETB  0                                                        39750000
         AIF   (&NODSECT).S6B                                           39800000
&LBL     DSECT                                                          39850000
         AGO   .S6C                                                     39900000
.S6B     ANOP                                                           39950000
&LBL     DS    0F                                                       40000000
.S6C     ANOP                                                           40050000
.********************************************************************** 40100000
*********************************************************************** 40150000
*    ERROR CODES                                                      * 40200000
*********************************************************************** 40250000
DACECD00 EQU   0                        SUCCESSFUL COMPLETION           40300000
DACECD04 EQU   4                        CATAGORIZED ERROR CONDITION     40350000
DACECD08 EQU   8                        UNEXPECTED ERROR CONDITION      40400000
DACECD0C EQU   12                       INVALID PARAMETER OR REQUEST    40450000
DACECD10 EQU   16                       INVALID PARAMETER LIST          40500000
DACECD14 EQU   20                       PROBABLE DADSM LOGIC ERROR @L2A 40525000
*********************************************************************** 40550000
*    HISTORIC RETURN CODES                                            * 40600000
*********************************************************************** 40650000
DACHCD00 EQU   0                        SUCCESSFUL DATA SET CREATION    40700000
DACHCD04 EQU   4                        DUPLICATE DATA SET NAME         40750000
DACHCD08 EQU   8                        NO ROOM IN VTOC OR VTOC INDEX   40800000
DACHCD0C EQU   12                       PERMANENT I/O ERROR OR CVAF    X40850000
                                        ERROR                           40900000
DACHCD10 EQU   16                       REQUESTED ABSOLUTE TRACK NOT   X40950000
                                        AVAILABLE                       41000000
DACHCD14 EQU   20                       REQUESTED QUANTITY NOT         X41050000
                                        AVAILABLE                       41100000
DACHCD18 EQU   24                       AVERAGE RECORD LENGTH EXCEEDS  X41150000
                                        65,535 BYTES                    41200000
DACHCD1C EQU   28                       INVALID DSORG FOR ISAM INDEX   X41250000
                                        REQUEST                         41300000
DACHCD20 EQU   32                       NO PRIME AREA REQUESTED FOR    X41350000
                                        ISAM                            41400000
DACHCD24 EQU   36                       ISAM OVFLOW AREA REQUESTED     X41450000
                                        BEFORE PRIME                    41500000
DACHCD28 EQU   40                       ISAM SPACE REQUEST DOES NOT    X41550000
                                        START ON CYLINDER BOUNDARY      41600000
DACHCD2C EQU   44                       DUPLICATE ISAM DATA SET        X41650000
                                        ELEMENT                         41700000
DACHCD30 EQU   48                       INVALID REALLOC PARAMETER LIST  41750000
DACHCD34 EQU   52                       INVALID JFCB OR PARTIAL DSCB   X41800000
                                        POINTER                         41850000
DACHCD38 EQU   56                       NOT ENOUGH SPACE ON VOLUME FOR X41900000
                                        DIRECTORY                       41950000
DACHCD3C EQU   60                       REALLOC ALLOC=ABS IS NOT       X42000000
                                        SUPPORTED ON OS VTOC'S          42050000
DACHCD40 EQU   64                       INVALID USER LABEL REQUEST      42100000
DACHCD44 EQU   68                       INVALID UCB POINTER             42150000
DACHCD48 EQU   72                       DOS VTOC CANNOT BE CONVERTED   X42200000
                                        TO AN OS VTOC                   42250000
DACHCD4C EQU   76                       NO SPACE PARAMETER GIVEN FOR A X42300000
                                        NEW DATA SET OR ZERO SPACE     X42350000
                                        REQUESTED AT ABSOLUTE TRACK    X42400000
                                        ZERO.                           42450000
DACHCD50 EQU   80                       INVALID REQUEST FOR ISAM INDEX  42500000
DACHCD54 EQU   84                       ISAM MULTI VOLUME INDEX IS NOT X42550000
                                        ALLOWED                         42600000
DACHCD58 EQU   88                       INVALID ISAM DATA SET ELEMENT   42650000
DACHCD5C EQU   92                       ISAM MULTI VOLUME OVERFLOW IS  X42700000
                                        NOT ALLOWED                     42750000
DACHCD60 EQU   96                       ABSTR AND CYL REQUESTS         X42800000
                                        CONFLICT (ISAM)                 42850000
DACHCD64 EQU   100                      CYL AND CONTIG REQUEST         X42900000
                                        CONFLICT (ISAM)                 42950000
DACHCD68 EQU   104                      INVALID SPACE SUBPARAMETER      43000000
DACHCD6C EQU   108                      ZERO PRIMARY SPACE REQUEST FOR X43050000
                                        ISAM DATA SET OR ABSTR REQUEST  43100000
DACHCD70 EQU   112                      ISAM INDEX REQUEST DUPLICATION  43150000
*                                                                 1@09D 43200000
DACHCD78 EQU   120                      INVALID COMBINATION OF DSSIZE  X43250000
                                        AND MINAU IN REALLOC PARAMETER  43300000
DACHCD7C EQU   124                      DSSIZE NOT A MULTIPLE OF MINAU  43350000
DACHCD80 EQU   128                      DIRECTORY SPACE REQUESTED IS   X43400000
                                        LARGER THAN PRIMARY SPACE       43450000
DACHCD84 EQU   132                      SPACE REQUEST MUST BE ABSTR    X43500000
                                        FOR A DOS VOLUME                43550000
DACHCD88 EQU   136                      INVALID F3DSCB POINTER          43600000
DACHCD8C EQU   140                      INDEX MUST BE REQUESTED BEFORE X43650000
                                        PRIME AREA                      43700000
DACHCD90 EQU   144                      INVALID THIRD DD CARD FOR ISAM X43750000
                                        ALLOCATION                      43800000
DACHCD94 EQU   148                      OVERLAPPING EXTENTS IN THE     X43850000
                                        VTOC                            43900000
DACHCD98 EQU   152                      OVERLAPPING DOS SPLIT CYLINDER X43950000
                                        EXTENTS IN THE VTOC             44000000
DACHCD9C EQU   156                      DADSM CREATE TERMINATED DUE TO X44050000
                                        POSSIBLE VTOC ERRORS            44100000
DACHCDA0 EQU   160                      ISAM CREATE TERMINATED DUE TO  X44150000
                                        POSSIBLE VTOC ERRORS            44200000
DACHCDA4 EQU   164                      ALLOCATION TERMINATED DUE TO   X44250000
                                        DOS STACKED PACK FORMAT         44300000
DACHCDA8 EQU   168                      RACDEF FAILED, DATA SET        X44350000
                                        ALREADY DEFINED                 44400000
DACHCDAC EQU   172                      USER NOT AUTHORIZED TO DEFINE  X44450000
                                        DATA SET                        44500000
DACHCDB0 EQU   176                      INSTALLATION EXIT REJECTED     X44550000
                                        THIS REQUEST WITH A RETURN     X44600000
                                        CODE OF 8                       44650000
DACHCDB4 EQU   180                      INSTALLATION EXIT REJECTED     X44700000
                                        THIS REQUEST WITH A RETURN     X44750000
                                        CODE OF 4                       44800000
DACHCDB8 EQU   184                      RACF DEFINE WITH MODELING      X44850000
                                        SPECIFIED AND MODEL NOT FOUND   44900000
DACHCDBC EQU   188                      INVALID F2DSCB POINTER          44950000
DACHCDC0 EQU   192                      REQUESTED DATA SET CREATION    X45000000
                                        WAS NOT ALLOWED BY SMS          45050000
DACHCDC4 EQU   196                      REQUESTED DATA SET CREATION    X45100000
                                        WAS NOT POSSIBLE (REFER TO     X45133300
                                        DIAGNOSTIC INFORMATION IN R0)   45166600
DACHCDC8 EQU   200                      BUILD OF PDSE OR PDSE/X        X45172100
                                        DIRECTORY FAILED           @L3C 45177600
DACHCDCC EQU   204                      VTOC ENQ RELATED FAILURE   @08A 45180400
DACHCDD0 EQU   208                      EOF MARK WRITE FAILED      @L4AX45180800
                                        FOR DATA SET WITH PRIMARY  @L4AX45181200
                                        QUANTITY SPECIFIED,        @L4AX45181600
                                        DATA SET                   @L4AX45182000
                                        IS DSORG=PS (NOT STRIPED)  @L4AX45182400
                                        OR  DSORG=NULL             @L4A 45182800
DACHCDD4 EQU   212                      VTOC CONVERSION FAILED DUE TO  X45182900
                                        PRESENCE OF SPLIT CYLINDER DATAX45183000
                                        SETS                       @L2A 45183100
DACHCDD8 EQU   216                      DATA SET COULD NOT BE CREATED, X45186400
                                        PRIMARY SPACE REQUIRED EXCEEDS X45189700
                                        65535 TRACKS.              @L2A 45193000
*                                                                       45196300
.S6X     ANOP                                                           45200000
.*                                                                      45200900
.********************************************************************** 45201800
.* SECTION (7): SUBFUNCTION ID'S AND SUBFUNCTION REASON CODES           45202700
.********************************************************************** 45203600
.*                                                                      45204500
.S7      AIF   (&ALLSECT).S7B                                           45205400
         AIF   (NOT &SFLG(7)).S7X                                       45206300
         AIF   (NOT &GDSECT).S7C                                        45207200
&GDSECT  SETB  0                                                        45208100
         AIF   (&NODSECT).S7B                                           45209000
&LBL     DSECT                                                          45209900
         AGO   .S7C                                                     45210800
.S7B     ANOP                                                           45211700
&LBL     DS    0F                                                       45212600
.S7C     ANOP                                                           45213500
*********************************************************************** 45214400
*  SUBFUNCTION ID'S                                                   * 45215300
*********************************************************************** 45216200
CREASF01 EQU   1                        EXTEND - VALIDATE INPUT PARMS   45217100
CREASF02 EQU   2                        ISSUE SSI CALL TO SMS           45218000
CREASF03 EQU   3                        SMS VTOC/DSS INVOKED - IF ERRORX45218900
                                        OCCURS, THE VTOC/DSS ERROR     X45219800
                                        REASON CODE WILL BE PASSED BACKX45220700
                                        IN BYTES 2 AND 3 OF REGISTER 0  45221600
CREASF04 EQU   4                        EXTEND - BUILD JFCB INTERFACE   45222500
CREASF05 EQU   5                        VALIDATE REALLOC PARMLIST       45222600
CREASF06 EQU   6                        VALIDATE BRANCH ENTRY PARMLIST  45222700
CREASF07 EQU   7                        CHECK PQTY AND MINAU WHEN      X45222800
                                        ROUNDING TO CYL BOUNDARY        45222900
CREASF08 EQU   8                        CHECK PASSED UCB ADDRESS        45223000
CREASF09 EQU   9                        VALIDATE JFCB EXTENSION         45223100
CREASF0A EQU   10                       VALIDATE MODEL DSCB EXTENSION   45223200
CREASF0B EQU   11                       VALIDATE ABSOLUTE DSCB         X45223300
                                        EXTENSION                       45223400
CREASF0C EQU   12                       VALIDATE RETURN AREA            45223500
CREASF0D EQU   13                       INVOKE RACF TO CHECK CALLER'S  X45224100
                                        AUTHORITY                       45224200
CREASF0E EQU   14                       INVOKE RACF TO CREATE A PROFILEX45224300
                                        FOR THE DATA SET                45224400
CREASF0F EQU   15                       INVOKE RACF TO CREATE A PROFILEX45224500
                                        FOR THE DATA SET - SECURITY    X45224600
                                        MODEL PROCESSING SPECIFIED      45224700
CREASF10 EQU   16                       INVOKE RACF TO CREATE A PROFILEX45224800
                                        FOR THE DATA SET - SECURITY    X45224900
                                        MODEL PROCESSING SPECIFIED     X45225000
                                        AND MODEL PROFILE IS GENERIC    45225100
CREASF11 EQU   17                       INVOKE RACF TO ADD A VOLUME TO X45225200
                                        THE PROFILE FOR THE DATA SET    45225300
CREASF12 EQU   18                       AVAILABLE                  @11C 45225600
CREASF13 EQU   19                       ESTAE ROUTINE INVOKED BY RTM - X45225900
                                        SYSTEM COMPLETION CODE WILL BE X45226000
                                        PASSED BACK IN BYTES 2 AND 3   X45226100
                                        OF REGISTER 0                   45226200
CREASF14 EQU   20                       VALIDATE CREATE REQUEST         45226300
CREASF15 EQU   21                       PREPROCESSING EXIT REJECTED    X45226400
                                        REQ - FIELDS DACSFRET AND      X45226500
                                        DACSFREA CONTAIN THE           X45226600
                                        PREPROCESSING EXIT REASON      X45226700
                                        CODE                            45226800
CREASF16 EQU   22                       VERIFY THAT SMS FLAGS PASSED   X45226900
                                        BY THE CALLER MATCH THOSE IN   X45227000
                                        THE FMT4 DSCB                   45227100
CREASF17 EQU   23                       INVOKE CVAFDIR - READ INDEX    X45227200
                                        MAPS, HIGH LEVEL VIER AND      X45227300
                                        FMT4 DSCB                       45227400
CREASF18 EQU   24                       INVOKE CVAFVRF - CHECK FOR VRF X45227500
                                        DATA IN VIXM                    45227600
CREASF19 EQU   25                       INVOKE CVAFDSM FOR AN ABSOLUTE X45227700
                                        DSCB REQUEST                    45227800
CREASF1A EQU   26                       INVOKE CVAFDSM TO OBTAIN SPACE X45227900
                                        FOR DATA SET                    45228000
CREASF1B EQU   27                       INVOKE CVAFDSM - GET FMT0 DSCB  45228100
CREASF1C EQU   28                       INVOKE CVAFDSM - ADD DATA SET  X45228200
                                        NAME TO INDEX AND CHECK FOR    X45228300
                                        DUPLICATE                       45228400
CREASF1D EQU   29                       INVOKE CVAFDIR - RELEASE       X45228500
                                        BUFFERS                         45228600
CREASF1E EQU   30                       INVOKE CVAFVRF - WRITE VRF     X45228700
                                        DATA TO INDEX MAP               45228800
CREASF1F EQU   31                       INVOKE CVAFDIR - WRITE BUFFER  X45228900
                                        LISTS TO THE VOLUME             45229000
CREASF20 EQU   32                       INVOKE CVAFDIR - WRITE FMT1    X45229100
                                        DSCB                            45229200
CREASF21 EQU   33                       READ FMT4 DSCB AND CHECK FOR   X45229300
                                        DUPLICATE DATA SET NAME         45229400
CREASF22 EQU   34                       VERIFY ENOUGH SPACE IN VTOC    X45229500
                                        OR VTOC INDEX                   45229600
CREASF23 EQU   35                       CONVERT EXTENT FROM CYL/TRK    X45229700
                                        FORMAT (CCHH) TO RELATIVE      X45229800
                                        TRACK ADDRESS (RTA)             45229900
CREASF24 EQU   36                       READ FMT5 DSCB                  45230000
CREASF25 EQU   37                       VERIFY SPACE REQUESTED IS      X45230100
                                        AVAILABLE                       45230200
CREASF26 EQU   38                       WRITE FMT1 DSCB                 45230300
CREASF27 EQU   39                       WRITE FMT3 DSCB                 45230400
CREASF28 EQU   40                       WRITE FMT5 DSCB                 45230500
CREASF29 EQU   41                       READ FMT0 DSCB                  45230600
CREASF2A EQU   42                       WRITE FMT0 DSCB                 45230700
CREASF2B EQU   43                       WRITE FMT4 DSCB                 45230800
CREASF2C EQU   44                       CREATE VIO DATA SET             45230900
CREASF2D EQU   45                       VALIDATE ISAM REQUEST           45231000
CREASF2E EQU   46                       WRITE FMT2 DSCB                 45231100
CREASF2F EQU   47                       INVOKE CVAFDSM - ADD DATA SET  X45231200
                                        NAME TO INDEX                   45231300
CREASF30 EQU   48                       INVOKE CVAFDIR - WRITE FMT2    X45231400
                                        DSCB                            45231500
CREASF31 EQU   49                       INVOKE CVAFDIR - WRITE FMT3    X45231600
                                        DSCB                            45231700
CREASF32 EQU   50                       INVOKE CVAFDIR - CHECK FOR     X45231800
                                        DUPLICATE DATA SET NAME         45231900
CREASF33 EQU   51                       VALIDATE ISAM MULTI-VOLUME     X45232000
                                        REQUEST                         45232100
CREASF34 EQU   52                       OS VTOC CHANNEL PROGRAM ISSUED X45232200
                                        TO READ FMT4, READ FMT5, CHECK X45232300
                                        FOR DUPLICATE DATA SET NAME,   X45232400
                                        AND READ FMT1                   45232500
CREASF35 EQU   53                       CONTINUE DUPLICATE NAME SEARCH X45232600
                                        DOS PACK                        45232700
CREASF36 EQU   54                       OS VTOC CHANNEL PROGRAM ISSUED X45232800
                                        TO READ FMT4, READ FMT5, CHECK X45232900
                                        FOR DUPLICATE DATA SET NAME,   X45233000
                                        AND READ FMT1, AFTER CVAFVRF   X45233100
                                        DISABLED THE VTOC INDEX         45233200
CREASF37 EQU   55                       OS VTOC CHANNEL PROGRAM ISSUED X45233300
                                        TO READ FMT4, READ FMT5, CHECK X45233400
                                        FOR DUPLICATE DATA SET NAME,   X45233500
                                        AND READ FMT1, AFTER IGGVRF00  X45233600
                                        DISABLED THE VTOC INDEX         45233700
CREASF38 EQU   56                       FIND SPACE FOR USER LABEL       45233800
*/********************************************************************/ 45233900
*/* FOLLOWING CODES, PLUS THOSE AT F0-FF ARE VTOC CONVERSION CODES   */ 45234000
*/* WHICH ARE SHARED WITH EXTEND (39-44)                             */ 45234100
*/********************************************************************/ 45234200
CREASF39 EQU   57                       VTOC CONVERSION - READ DSCBS - X45234300
                                         IGG0325P                       45234400
CREASF3A EQU   58                       VTOC CONVERSION - FIND FMT0    X45234500
                                        DSCB - IGG0325T                 45234600
*              59                       *OBSOLETE*                1@L2D 45234700
*              60                       *OBSOLETE*                1@L2D 45234800
CREASF3D EQU   61                       VTOC CONVERSION - OVERLAPPING  X45234900
                                        EXTENTS DETECTED - IGG0325R     45235000
*              62                       *OBSOLETE*                1@L2D 45235100
CREASF3F EQU   63                       VTOC CONVERSION - WRITE FMT0   X45235200
                                        DSCB - IGG0325T                 45235300
CREASF40 EQU   64                       VTOC CONVERSION - WRITE FMT4   X45235400
                                        DSCB - IGG0325T                 45235500
CREASF41 EQU   65                       VTOC CONVERSION - WRITE FREE   X45235600
                                        SPACE DSCB - IGG0325T           45235700
*              66                       *OBSOLETE*                1@L2D 45235800
*              67                       *OBSOLETE*                1@L2D 45235900
CREASF44 EQU   68                       VTOC CONVERSION - READ 2ND     X45236000
                                        DSCB - IGG0325Z                 45236100
CREASF45 EQU   69                       INVOKE DASDCALC FOR OPTIMAL    X45236300
                                        BLOCKSIZE                  @P9A 45236400
CREASF46 EQU   70                       INVOKE CDM TO CREATE A PDSE    X45236500
                                        DIRECTORY                  @07C 45236600
CREASF47 EQU   71                       VTOC ENQ PROCESSING        @08A 45236700
CREASF48 EQU   72                       PDS DIRECTORY BUILD        @06AX45236800
                                        CONVERT TTR                @06A 45236900
CREASF49 EQU   73                       PDS DIRECTORY BUILD        @06AX45237100
                                        EXCP WRITE PDS DIRECTORY   @06A 45237200
CREASF4A EQU   74                       INVOKE TRKCALC FOR MAXIMUM @10AX45237300
                                        R1 VALUE                   @10A 45237400
CREASF4B EQU   75                       EOF MARK WRITE             @L4AX45237500
                                        CONVERT TTR                @L4A 45237600
CREASF4C EQU   76                       EOF MARK WRITE             @L4AX45237700
                                        EXCP WRITE                 @L4A 45237800
CREASF4D EQU   77                       INVOKE CDM TO CREATE A PDSE/X  X45237900
                                        DIRECTORY                  @L3A 45238000
CREASF4E EQU   78                       VERIFY SPACE REQUESTED IS  @L2AX45238100
                                        AVAILABLE                  @L2AX45238200
                                        MODULE IGG0325B.           @L2A 45238300
CREASF4F EQU   79                       ERROR DETECTED BY IGGDADTS @L2AX45238400
                                        DURING FREE-SPACE SEARCH   @L2AX45238500
                                        MODULE IGG0325D.           @L2A 45238600
CREASF50 EQU   80                       ERROR DETECTED BY IGGDADTS @L2AX45238700
                                        DURING FREE-SPACE SEARCH   @L2AX45238800
                                        MODULE IGG0325K.           @L2A 45238900
CREASF51 EQU   81                       NOT USED.                  @L2A 45239000
CREASF52 EQU   82                       READ FIRST FMT 7 DSCB      @L2AX45239100
                                        MODULE IGG0325A.           @L2A 45239200
CREASF53 EQU   83                       VALIDATE FMT 7 DSCB        @L2AX45239300
                                        MODULE IGG0325A.           @L2A 45239400
CREASF54 EQU   84                       ERROR DETECTED BY IGGDADTS @L2AX45239500
                                        DURING FREE-SPACE SEARCH   @L2AX45239600
                                        MODULE IGG0325C.           @L2A 45239700
CREASF55 EQU   85                       ERROR DETECTED BY IGGDADTS @L2AX45239800
                                        DURING FREE-SPACE SEARCH   @L2AX45239900
                                        MODULE IGG0325G.           @L2A 45240000
CREASF56 EQU   86                       IGGDADTS DETECTED ERROR    @L2AX45240100
                                        DURING FREE-SPACE UPDATE   @L2AX45240200
                                        MODULE IGG0325G.           @L2A 45240300
CREASF57 EQU   87                       IGGDAEDS DETECTED ERROR    @L2AX45240400
                                        DURING ABSOLUTE DSCB       @L2AX45240500
                                        CONVERSION.                @L2AX45240600
                                        MODULE IGG0325B.           @L2A 45240700
CREASF58 EQU   88                       IGGDADTS DETECTED ERROR    @L2AX45240800
                                        DURING DT2EDT02 SORT       @L2AX45240900
                                        MODULE IGG0325E.           @L2A 45241000
CREASF59 EQU   89                       IGGDAEDS DETECTED ERROR    @L2AX45241100
                                        DURING F1/F3 BUILD.        @L2AX45241200
                                        MODULE IGG0325E.           @L2A 45241300
CREASF5A EQU   90                       ERROR DETECTED BY IGGDADTS @L2AX45241400
                                        DURING FREE-SPACE SEARCH   @L2AX45241500
                                        MODULE IGG032I2.           @L2A 45241600
CREASF5B EQU   91                       VERIFY SPACE REQUESTED IS  @L2AX45241700
                                        AVAILABLE, ISAM PATH,      @L2AX45241800
                                        OSVTOC VOLUME, CYL REQUEST.@L2AX45241900
                                        MODULE IGG032I2.           @L2A 45242000
CREASF5C EQU   92                       VERIFY SPACE REQUESTED IS  @L2AX45242100
                                        AVAILABLE, ISAM PATH,      @L2AX45242200
                                        IXVTOC VOLUME, ABSTR       @L2AX45242300
                                        REQUEST.                   @L2AX45242400
                                        MODULE IGG032I2.           @L2A 45242500
CREASF5D EQU   93                       IGGDAEDS DETECTED ERROR    @L2AX45242600
                                        DURING F1/F3 BUILD.        @L2AX45242700
                                        MODULE IGG032I3.           @L2A 45242800
CREASF5E EQU   94                       IGGDAEDS DETECTED ERROR    @L2AX45242900
                                        DURING F1/F3 BUILD.        @L2AX45243000
                                        MODULE IGG032I4.           @L2A 45243100
CREASF5F EQU   95                       READ FIRST FMT 7 DSCB      @L2AX45243200
                                        MODULE IGG032I8.           @L2A 45243300
CREASF60 EQU   96                       IGGDAC02, SETUP_JFCB_INFO  @11AX45243400
                                        CONVERT PRIMARY KB IN      @11AX45243500
                                        DACRE TO TRACKS            @11A 45243600
CREASF61 EQU   97                       IGGDAC02, SETUP_JFCB_INFO  @11AX45243700
                                        CONVERT SECONDARY KB IN    @11AX45243800
                                        DACRE TO TRACKS            @11A 45243900
CREASF62 EQU   98                       IGGDAC02, SETUP_JFCB_INFO  @11AX45244000
                                        CONVERT PRIMARY KB IN DACRE@11AX45244100
                                        TO BLOCKS FOR AVG BLK      @11A 45244200
CREASF63 EQU   99                       IGGDAC02, SETUP_JFCB_INFO  @11AX45244300
                                        CONVERT 2NDARY KB IN DACRE @11AX45244400
                                        TO BLOCKS FOR AVG BLK      @11A 45244500
CREASF64 EQU  100                       IGGDAC02, SETUP_JFCB_INFO  @11AX45244600
                                        CONVERT PRIMARY KB IN DACRE@11AX45244700
                                        TO BLOCKS FOR AVG REC      @11A 45244800
CREASF65 EQU  101                       IGGDAC02, SETUP_JFCB_INFO  @11AX45244900
                                        CONVERT 2NDARY KB IN DACRE @11AX45245000
                                        TO BLOCKS FOR AVG REC      @11A 45245100
CREASF66 EQU  102                       IGGDAC02, SETUP_JFCB_INFO  @11AX45245200
                                        CONVERT PRIMARY IN JFCB    @11AX45245300
                                        TO BLOCKS FOR AVG REC      @11A 45245400
CREASF67 EQU  103                       IGGDAC02, SETUP_JFCB_INFO  @11AX45245500
                                        CONVERT SECONDARY IN JFCB  @11AX45245600
                                        TO BLOCKS FOR AVG REC      @11A 45245700
CREASF68 EQU  104                       IGGDAC02, SETUP_MDSCB_INFO @11AX45245800
                                        CONVERT PRIMARY KB OR MB   @11AX45245900
                                        IN DACRE TO BLOCKS         @11A 45246000
CREASF69 EQU  105                       IGGDAC02, SETUP_MDSCB_INFO @11A 45246100
CREASF6A EQU  106                       IGGDAC02, SETUP_MDSCB_INFO @11AX45246200
                                        CONVERT PRIMARY KB OR MB   @11AX45246300
                                        IN DACRE TO TRACKS         @11A 45246400
CREASF6B EQU  107                       IGG0325G, PROCESSING       @12AX45246500
                                        SELECTED EXTENTS. ALL FREE @12AX45246600
                                        EXTENTS PROCESSED BUT NOT  @12AX45246700
                                        ALL SELECTED EXTENTS.      @12A 45246800
CREASF6C EQU  108                       IGG0325G, MERGING SELECTED @12AX45246900
                                        EXTENTS WITH FS FOR REAR OR@12AX45247000
                                        COMPLETE ALLOCATION.       @12A 45247100
CREASF6D EQU  109                       IGG0325G, MERGING SELECTED @12AX45247200
                                        EXTENTS WITH FS FOR FRONT  @12AX45247300
                                        OR MIDDLE ALLOCATION.      @12A 45247400
CREASF6E EQU  110                       IGGDAC02, SETUP_JFCB_INFO  @13AX45247500
                                        CONVERT BLOCKS TO PDSE BLKS@13AX45247600
                                        FOR AVG BLOCK REQUEST      @13A 45247700
CREASF6F EQU  111                       IGGDAC02, SETUP_MDSCB_INFO @13AX45247800
                                        CONVERT BLOCKS TO PDSE BLKS@13AX45247900
                                        FOR AVG BLOCK REQUEST      @13A 45248000
CREASF70 EQU  112                       INVOKE RACF TO CHECK       @14AX45248100
                                        AUTHORITY TO MODEL PROFILE @14A 45248200
CREASF71 EQU  113                       INVOKE Capture_Ucb proc    @KCA 45248300
CREASF72 EQU  114                       Issue DASDCALC to obtain half  X45248400
                                        track blksize for compressed   X45248500
                                        data set allocation        @16A 45248600
CREASF73 EQU  115                       IGGDADTS DETECTED ERROR    @18AX45248700
                                        DURING FREE SPACE UPDATE   @18AX45248800
                                        MODULE IGG032I6.           @18A 45248900
CREASF74 EQU  116                       IGGDACO2, X37 ABEND        @L8AX45249000
                                        RELEIF SETUP AND PARM      @L8AX45249100
                                        CHECK                      @L8A 45249200
CREASF75 EQU  117                       IGG0325B, X37 ABEND        @L8AX45249300
                                        RELEIF. MIN. ALLOCATION    @L8AX45249400
                                        CHECK                      @L8A 45249500
CREASF76 EQU  118                       IGG0325D, X37 ABEND        @L8AX45249600
                                        RELEIF. MIN. ALLOCATION    @L8AX45249700
                                        CHECK                      @L8A 45249800
*/********************************************************************/ 45249900
*/* FOLLOWING CODES, PLUS THOSE AT 39-44 ARE VTOC CONVERSION CODES   */ 45250000
*/* WHICH ARE SHARED WITH EXTEND (F0-FF)                             */ 45250100
*/********************************************************************/ 45250200
CREASFF0 EQU   240                      VTOC CONVERSION - DIRF CONVERT X45250300
                                        PREVENTED BY ZAP TO IGG0325Z - X45250400
                                        IGG0325Z                   @L2A 45250500
CREASFF1 EQU   241                      VTOC CONVERSION - ALLOCATED    X45250600
                                        EXTENT VALIDATION - IGG0325P   X45250700
                                                                   @L2A 45250800
*********************************************************************** 45250900
*  SUBFUNCTION REASON CODES                                           * 45251000
*********************************************************************** 45251100
CREARS01 EQU   1                        EXTEND - PASSED DEB ADDRESS    X45251200
                                        IS ZERO                         45251300
CREARS02 EQU   2                        EXTEND - PASSED UCB ADDRESS    X45251400
                                        IS ZERO                         45251500
CREARS03 EQU   3                        EXTEND - DATA SET NAME IS      X45251600
                                        VTOC INDEX NAME                 45251700
CREARS04 EQU   4                        ABSOLUTE TRACK DATA SET NOT    X45251800
                                        SUPPORTED ON SMS MANAGED       X45251900
                                        VOLUMES                    @P3C 45252000
CREARS05 EQU   5                        EXTEND - DATA SET NAME IS      X45252100
                                        FMT4 DSCB NAME                  45252200
CREARS06 EQU   6                        EXTEND - DATA SET TO BE        X45252300
                                        EXTENDED IS VSAM                45252400
CREARS07 EQU   7                        LOGICAL ERROR ON SSI CALL -    X45252500
                                        BAD SSOB FORMAT, LENGTH, ETC.   45252600
CREARS08 EQU   8                        EXTEND - INVALID REQUEST FLAG: X45252700
                                        ONLY THE FLAG BIT REQUESTING   X45252800
                                        EXTEND TO NEW VOLUME MAY       X45252900
                                        BE 'ON'                         45253000
CREARS09 EQU   9                        EXTEND - BOTH JFCBDRLH AND     X45253100
                                        JFCBLKSI ARE ZERO FOR A DATA   X45253200
                                        SET ALLOCATED BY AVERAGE BLOCK  45253300
CREARS0A EQU   10                       EXTEND - DS1SCXTV VALUE EXISTS X45253400
                                        BUT NO DS1SCXTF FLAG SET        45253500
CREARS0B EQU   11                       INVALID RALPLID FIELD           45253600
CREARS0C EQU   12                       INVALID RALNGTH FIELD           45253700
CREARS0D EQU   13                       RALPDSCB IS ZERO                45253800
CREARS0E EQU   14                       RALUCB IS ZERO                  45253900
CREARS0F EQU   15                       RALUCB IS DUMMY SMS UCB         45254000
CREARS10 EQU   16                       RALFLAG CONTAINS NON-ZERO      X45254100
                                        RESERVED FLAGS                  45254200
CREARS11 EQU   17                       RALABS NOT SUPPORTED FOR THIS  X45254300
                                        VERSION OF PARAMETER LIST       45254400
CREARS12 EQU   18                       INVALID PQTY OR MINAU FOR      X45254500
                                        REQUEST REQUIRING CYLINDER     X45254600
                                        BOUNDARIES                      45254700
CREARS13 EQU   19                       R1 DOES NOT CONTAIN POINTER TO X45255000
                                        FULLWORD CONTAINING UCB ADDR    45255700
CREARS14 EQU   20                       FULLWORD POINTED TO BY R1      X45256400
                                        CONTAINS A DUMMY SMS UCB        45257100
CREARS15 EQU   21                       INVALID DACPLID FIELD-ID        45257800
CREARS16 EQU   22                       INVALID DACPVER FIELD-VERSION   45258500
CREARS17 EQU   23                       INVALID DACPLEN FIELD-LENGTH    45259200
CREARS18 EQU   24                       DACEXPTR IS ZERO                45259900
CREARS19 EQU   25                       DACJFCB, DACMDSCB, OR DACADSCB X45260600
                                        NOT SET (INTERFACE FLAG)        45261300
CREARS1A EQU   26                       MORE THAN ONE INTERFACE FLAG   X45262000
                                        SPECIFIED                       45262700
CREARS1B EQU   27                       VIO NOT SUPPORTED FOR MDSCB OR X45263400
                                        ADSCB INTERFACE                 45264100
CREARS1C EQU   28                       DACRSRBT MUST BE ZERO           45264800
CREARS1D EQU   29                       DACRSRV1 MUST BE ZERO           45265500
CREARS1E EQU   30                       DACRSRV2 MUST BE ZERO           45266200
CREARS1F EQU   31                       DACRSRV3 MUST BE ZERO           45266900
CREARS20 EQU   32                       DACRSRV4 MUST BE ZERO           45267600
CREARS21 EQU   33                       DACRSRVF MUST BE ZERO           45268300
CREARS22 EQU   34                       DACUCB IS ZERO                  45269000
CREARS23 EQU   35                       DACUCB IS A DUMMY SMS UCB       45269700
CREARS24 EQU   36                       DACGENMP SET BUT DACSECMP      X45270400
                                        IS ZERO                         45271100
CREARS25 EQU   37                       DACPROFM SET BUT DACSECMP IS   X45271800
                                        NOT ZERO                        45272500
CREARS26 EQU   38                       DACJFCBP IS ZERO                45273200
CREARS27 EQU   39                       DACIJRS1 MUST BE ZERO           45273900
CREARS28 EQU   40                       DACDSABP IS ZERO FOR AN ISAM   X45274600
                                        DATA SET                        45275300
CREARS29 EQU   41                       DACSECVL SET BUT DACVOLSQ OR   X45276000
                                        DACDSSNM IS ZERO                45276700
CREARS2A EQU   42                       DACDSCBM IS ZERO                45277400
CREARS2B EQU   43                       MUST SET SPACE REQUEST FLAG     45278100
CREARS2C EQU   44                       MORE THAN ONE SPACE REQUEST    X45278800
                                        FLAG SET                        45279500
CREARS2D EQU   45                       DACIMRS1 MUST BE ZERO           45280200
CREARS2E EQU   46                       DACIMRS2 MUST BE ZERO           45280900
CREARS2F EQU   47                       DACDSCB1 IS ZERO                45281600
CREARS30 EQU   48                       DACRTPTR CANNOT BE ZERO FOR    X45282300
                                        VIO DATA SETS                   45283000
CREARS31 EQU   49                       DACAVGRC VALUE INVALID          45283700
CREARS32 EQU   50                       DACSECVL CANNOT BE SET FOR     X45284400
                                        VIO DATA SETS                   45285100
CREARS33 EQU   51                       CVOL'S NOT                     X45285800
                                        SUPPORTED ON SMS MANAGED       X45286500
                                        VOLUMES                    @P3C 45287200
CREARS34 EQU   52                       UNMOVABLE DATA SETS NOT        X45287900
                                        SUPPORTED ON SMS MANAGED       X45288600
                                        VOLUMES                    @P3C 45289300
*                                                                2 @P4D 45290000
CREARS35 EQU   53                       PRIMARY OR SECONDARY QUANTITY  X45290700
                                        IS TOO LARGE TO ALLOCATE DATA  X45291400
                                        SET                             45292100
CREARS36 EQU   54                       ADSCB REQ - INVALID FMT2 KEY    45342100
CREARS37 EQU   55                       ADSCB REQ - INVALID FMT2 ID     45392100
CREARS38 EQU   56                       ADSCB REQ - FMT1 DSORG MUST    X45442100
                                        INDICATE ISAM DATA SET          45492100
CREARS39 EQU   57                       DATA SET NAME IS VTOC NAME      45542100
CREARS3A EQU   58                       MDSCB INDICATES                X45592100
                                        ISAM DATA SET. ISAM DATA SET   X45642100
                                        INVALID FOR MODEL DSCB REQ      45692100
CREARS3B EQU   59                       ADSCB REQ - SPACE REQUESTED    X45742100
                                        AT ABSOLUTE TRACK 0             45792100
CREARS3C EQU   60                       MDSCB REQ - PDS DATA SET AND   X45842100
                                        PRIMARY QUANTITY IS ZERO        45892100
CREARS3D EQU   61                       MDSCB REQ - DIRECTORY QUANTITY X45942100
                                        SPECIFIED BUT NOT PDS DATA SET  45992100
CREARS3E EQU   62                       ADSCB REQ - DIRECTORY QUANTITY X46042100
                                        SPECIFIED BUT NOT PDS DATA SET  46092100
CREARS3F EQU   63                       ADSCB REQ - PDS DATA SET AND   X46142100
                                        PRIMARY QUANTITY IS ZERO        46192100
CREARS40 EQU   64                       MDSCB OR ADSCB ADDRESS INVALID  46242100
CREARS41 EQU   65                       ADSCB REQ - ZERO SPACE         X46292100
                                        REQUESTED AT ABSOLUTE TRACK 0   46342100
CREARS42 EQU   66                       JFCB REQ - DSORG CAN NOT BE    X46392100
                                        ISAM OR PDS                     46442100
CREARS43 EQU   67                       JFCB REQ - DSORG CAN NOT BE    X46492100
                                        GRAPHICS                        46542100
CREARS44 EQU   68                       JFCB REQ - DIRECTORY QUANTITY  X46592100
                                        CAN NOT BE SPECIFIED            46642100
CREARS45 EQU   69                       ADSCB REQ - DSORG CAN NOT BE   X46692100
                                        ISAM OR PDS                     46742100
CREARS46 EQU   70                       ADSCB REQ - FMT3 DSCB PRESENT  X46792100
                                        & NUMBER OF EXTENTS > 15        46842100
CREARS47 EQU   71                       ADSCB REQ - FMT3 DSCB PRESENT  X46892100
                                        & NUMBER OF EXTENTS < 3         46942100
CREARS48 EQU   72                       ADSCB REQ - NO FMT3 DSCB       X46992100
                                        PRESENT AND NUMBER OF EXTENTS  X47042100
                                        IS > 2                          47092100
CREARS49 EQU   73                       ADSCB REQ - PRIMARY QUANTITY   X47142100
                                        IS ZERO                         47192100
CREARS4A EQU   74                       PRIMARY QUANTITY IS ZERO BUT   X47242100
                                        MINIMUM ALLOCATION UNIT IS     X47292100
                                        NOT ZERO                        47342100
CREARS4B EQU   75                       PRIMARY QUANTITY IS < ZERO      47392100
CREARS4C EQU   76                       MINIMUM ALLOCATION UNIT IS     X47442100
                                        < ZERO                          47492100
CREARS4D EQU   77                       ADSCB REQ - INVALID FMT3 KEY    47542100
CREARS4E EQU   78                       ADSCB REQ - INVALID FMT3 ID     47592100
CREARS4F EQU   79                       ADSCB REQ - NUMBER OF EXTENTS  X47642100
                                        IS > 16                         47692100
CREARS50 EQU   80                       ADSCB REQ - NUMBER OF EXTENTS  X47742100
                                        IS < 4                          47792100
CREARS51 EQU   81                       ADSCB REQ - NO FMT3 DSCB       X47842100
                                        PRESENT AND NUMBER OF EXTENTS  X47892100
                                        IS > 2                          47942100
CREARS52 EQU   82                       DATA SET PROTECTED BY DISCRETE X47992100
                                        PROFILE BUT RACF NOT ACTIVE     48042100
CREARS53 EQU   83                       VOLUME IN CONVERSION TO SMS     48092100
CREARS54 EQU   84                       FMT4 DSCB INDICATES VOLUME     X48142100
                                        NOT SMS BUT DATA SET IS         48192100
CREARS55 EQU   85                       FMT4 DSCB INDICATES VOLUME     X48242100
                                        IS SMS BUT DATA SET IS NOT      48292100
CREARS56 EQU   86                       I/O ERROR DURING VRF RECOVERY  X48342100
                                        ROUTINE EXECUTION               48392100
CREARS57 EQU   87                       BEGINNING REQUESTED ABSOLUTE   X48442100
                                        TRACK IS > LAST FREE TRACK      48492100
CREARS58 EQU   88                       OS VTOC - DATA SET ALREADY     X48542100
                                        EXISTS ON VOLUME BUT FMT1 DSCB X48592100
                                        ID IS INVALID                   48642100
CREARS59 EQU   89                       DATA SET NAME IS INDEXED VTOC  X48692100
                                        HIGH WATER MARK KEY (44 BYTES  X48742100
                                        OF X'FF')                       48792100
CREARS5A EQU   90                       DATA SET NAME IS VTOC INDEX    X48842100
                                        NAME                            48892100
CREARS5B EQU   91                       MDSCB/ADSCB REQ - DUPLICATE    X48942100
                                        DATA SET NAME                   48992100
CREARS5C EQU   92                       JFCB REQ - DUPLICATE DATA SET  X49042100
                                        NAME AND NOT ISAM DATA SET      49092100
CREARS5D EQU   93                       OS VTOC - NO AVAILABLE FMT0    X49142100
                                        DSCB'S IN VTOC                  49192100
CREARS5E EQU   94                       ADSCB REQ - BEGINNING CCHH OF  X49242100
                                        EXTENT IS < ENDING CCHH         49292100
CREARS5F EQU   95                       ADSCB REQ - CYLINDER VALUE OF  X49342100
                                        CCHH IS > NUMBER OF CYLINDERS  X49392100
                                        ON VOLUME                       49442100
CREARS60 EQU   96                       ADSCB REQ - TRACK VALUE OF     X49492100
                                        CCHH IS > NUMBER OF TRACKS     X49542100
                                        ON VOLUME                       49592100
CREARS61 EQU   97                       NUMBER OF TRACKS               X49642100
                                        NEEDED FOR DIRECTORY IS >      X49692100
                                        MAXIMUM (32767)                 49742100
CREARS62 EQU   98                       ADSCB REQ - USER LABEL EXTENT  X49792100
                                        IS > 1 TRACK                    49842100
CREARS63 EQU   99                       ADSCB REQ - USER LABEL EXTENT  X49892100
                                        IS NOT THE FIRST EXTENT         49942100
CREARS64 EQU   100                      ADSCB REQ - TYPE OF EXTENT IS  X49992100
                                        SPLIT CYLINDER                  50042100
CREARS65 EQU   101                      ADSCB REQ - EXTENT SEQUENCE    X50092100
                                        NUMBER IS INVALID               50142100
CREARS66 EQU   102                      OS VTOC - LESS THAN 2          X50192100
                                        AVAILABLE FMT0 DSCB'S IN VTOC   50242100
CREARS67 EQU   103                      PART OF REQUESTED ABSOLUTE     X50292100
                                        EXTENT IS NOT FREE SPACE        50342100
CREARS68 EQU   104                      REQUESTED ABSOLUTE TRACK       X50392100
                                        ADDRESS IS < FIRST FREE TRACK   50442100
CREARS69 EQU   105                      OS VTOC - NUMBER OF AVAILABLE  X50492100
                                        FMT0 DSCB'S IN VTOC IS < 3      50542100
CREARS6A EQU   106                      OS VTOC - NUMBER OF DSCB'S     X50592100
                                        NEEDED TO CREATE FMT1, FMT3, & X50642100
                                        FMT5 DSCB'S IS > NUMBER OF     X50692100
                                        AVAILABLE FMT0 DSCB'S IN VTOC   50742100
CREARS6B EQU   107                      NOT ENOUGH SPACE IN FIRST      X50792100
                                        EXTENT FOR DIRECTORY            50842100
CREARS6C EQU   108                      TOTAL SPACE NEEDED FOR DATA    X50892100
                                        SET = AVAILABLE SPACE BUT      X50942100
                                        EXTRA TRACK NEEDED FOR USER    X50992100
                                        LABEL                           51042100
CREARS6D EQU   109                      IMBEDDED DIRECTORY SPACE       X51092100
                                        INVALID ON DD STMT FOR INDEX   X51142100
                                        ELEMENT                         51192100
CREARS6E EQU   110                      EITHER FIRST OR ONLY DD        X51242100
                                        STMT & ISAM                    X51292100
                                        ELEMENT NAME NEITHER BLANK,    X51342100
                                        PRIME, INDEX NOR OVFLOW         51392100
CREARS6F EQU   111                      MORE THAN ONE DD STMT & ISAM   X51442100
                                        ELEMENT NAME NEITHER BLANK,    X51492100
                                        PRIME, INDEX NOR OVFLOW         51542100
CREARS70 EQU   112                      TYPE OF SPACE MUST BE CYL OR   X51592100
                                        ABSTR                           51642100
CREARS71 EQU   113                      FOR IMBEDDED INDEX ONLY ONE    X51692100
                                        VOLUME CAN BE SPECIFIED         51742100
CREARS72 EQU   114                      IF 3 DD STMTS, ELEMENT NAMES   X51792100
                                        MUST BE SPECIFIED IN THE ORDER X51842100
                                        OF INDEX, PRIME, OVFLOW         51892100
CREARS73 EQU   115                      LESS THAN 4 FMT0 DSCB'S        X51942100
                                        AVAILABLE IN VTOC               51992100
CREARS74 EQU   116                      PROCESSING FIRST DD STMT -     X52042100
                                        DUPLICATE DATA SET NAME         52092100
CREARS75 EQU   117                      SECOND OR THIRD DD STMT -      X52142100
                                        DUPLICATE DATA SET NAME FOUND  X52192100
                                        ON VOLUME OTHER THAN ONE OF    X52242100
                                        THE VOLUMES ALLOCATED TO       X52292100
                                        FIRST DD STMT                   52342100
CREARS76 EQU   118                      SPACE ALLOCATED ON MULTIPLE    X52392100
                                        VOLUMES IS < THAN REQUESTED    X52442100
                                        SPACE                           52492100
CREARS77 EQU   119                      CYL REQUEST - NO FMT5 EXTENT   X52542100
                                        FOUND TO SATISFY USER LABEL    X52592100
                                        SPACE REQUEST                   52642100
CREARS78 EQU   120                      TRK REQUEST - NO FMT5 EXTENT   X52692100
                                        FOUND TO SATISFY USER LABEL    X52742100
                                        SPACE REQUEST                   52792100
CREARS79 EQU   121                      DACIJRS2 MUST BE ZERO      @P1A 52799200
CREARS7A EQU   122                      DACIJRS3 MUST BE ZERO      @P1A 52806300
CREARS7B EQU   123                      DACAVRCP IS 'ON' BUT DACAVGRC  X52811000
                                        IS ZERO                    @P1A 52815700
CREARS7C EQU   124                      DACRSRV5 MUST BE ZERO      @P1A 52820500
CREARS7D EQU   125                      DACLRGEX IS 'ON' BUT EITHER    X52821700
                                        DACJFCBD IS 'ON' FOR JFCB      X52822900
                                        INTERFACE OR, DACMBRQ AND      X52824100
                                        DACKBRQ ARE BOTH 'OFF' FOR     X52825300
                                        MDSCB INTERFACE. FOR JFCB      X52826500
                                        INTERFACE, DACLRGEX IS ONLY    X52827700
                                        SUPPORTED FOR TRACK OR CYL.    X52828900
                                        REQUESTS. FOR MDSCB            X52830100
                                        INTERFACE, DACLRGEX IS ONLY    X52831300
                                        SUPPORTED FOR KB OR MB         X52832500
                                        REQUESTS.                  @PBC 52833700
CREARS7E EQU   126                      ISAM DATA SETS NOT             X52835700
                                        SUPPORTED ON SMS MANAGED       X52836700
                                        VOLUMES                    @P3C 52837700
CREARS7F EQU   127                      ABSOLUTE TRACK DATA SETS NOT   X52838700
                                        SUPPORTED ON SMS MANAGED       X52839700
                                        VOLUMES                    @P3C 52840700
CREARS80 EQU   128                      USER VALUE, DACXTMAX,      @L8CX52840900
                                        EXCEEDS THE MAX ALLOWABLE  @L8CX52841100
                                        EXTENTS FOR DS.            @L8C 52841300
CREARS81 EQU   129                      MDSCB REQ - PARTIAL DSCB       X52841500
                                        INDICATES DATA SET ALLOCATED   X52841700
                                        BY ABSOLUTE TRACK          @P5A 52841900
CREARS82 EQU   130                      DACLRGEX REQ                   X52848100
                                        INVALID WHEN MXIG OR ALX TYPE  X52854300
                                        OF SPACE REQUEST           @PBC 52858600
CREARS83 EQU   131                      MDSCB OR JFCB REQ - MINIMUM    X52862900
                                        EXTENT QUANTITY (DACMINES OR   X52867200
                                        DACJMNES) INVALID WHEN MXIG OR X52871500
                                        ALX TYPE OF SPACE REQUEST  @P6A 52875800
CREARS84 EQU   132                      MDSCB REQ - DACDSSNM CAN NOT   X52880600
                                        BE BLANK FOR SMS MANAGED       X52882100
                                        DATA SET                   @P7A 52883600
CREARS85 EQU   133                      JFCB REQ - AVGREC INVALID      X52883700
                                        WHEN SPACE REQUESTED IN CYLS   X52883800
                                        OR TRKS                    @PAA 52883900
CREARS86 EQU   134                      DACLRGEX REQUEST INVALID FOR   X52884000
                                        ADSCB INTERFACE            @PBA 52884100
CREARS87 EQU   135                      JFCB REQ - DACLRGEX INVALID IN X52884200
                                        COMBINATION WITH AVGREC    @PBA 52884300
CREARS88 EQU   136                      PRIMARY QUANTITY IS NOT A      X52884400
                                        MULTIPLE OF MINIMUM EXTENT     X52884500
                                        QUANTITY (DACMINES OR DACJMNES)X52884600
                                                                   @02A 52884700
CREARS8A EQU   138                      VTOCENQD KEYWORD OF        @08AX52885100
                                        REALLOC MACRO INVALID FOR  @08AX52885200
                                        ALLOC=ABS.                 @08A 52885300
CREARS8B EQU   139                      CALLER DOES NOT HOLD       @08AX52885400
                                        VTOC ENQ.                  @08A 52885500
CREARS8C EQU   140                      UNEXPECTED RC FROM         @08AX52885600
                                        RESERVE, RET=TEST.         @08A 52885700
CREARS8D EQU   141                      VTOC ENQ NOT HELD          @08AX52885800
                                        EXCLUSIVE BY CALLER.       @08A 52885900
CREARS90 EQU   144                      PDSE DATA SET CAN NOT BE VIO   X52886000
                                                                   @L1A 52886100
CREARS91 EQU   145                      DACRSRV6 MUST BE ZERO      @L1A 52886200
CREARS92 EQU   146                      DACSKRSV MUST BE ZERO      @L1A 52886300
CREARS93 EQU   147                      KEYLEN MUST BE ZERO FOR        X52886400
                                        PDSE DATA SET              @L1A 52886500
CREARS94 EQU   148                      USER LABEL NOT ALLOWED FOR     X52886600
                                        PDSE DATA SET              @L1A 52886700
CREARS95 EQU   149                      DEVICE TRACK CAPACITY MUST BE  X52886800
                                        LARGE ENOUGH TO HOLD AT LEAST  X52887900
                                        ONE PDSE DIRECTORY RECORD  @PFA 52889300
CREARS96 EQU   150                      DIRECTORY SPACE IS LARGER  @07AX52889400
                                        THAN PRIMARY SPACE         @07A 52889500
CREARS97 EQU   151                      REQUESTED SPACE >=64K TRKS @L2C 52889600
CREARS98 EQU   152                      NO EXTENTS QUALIFY FOR ALX @07A 52889700
CREARS99 EQU   153                      NO EXTENT CAN HOLD CONTIG  @07A 52889800
CREARS9A EQU   154                      INSUFFICIENT FREE SPACE ON @07AX52889900
                                        VOLUME                     @07A 52890000
CREARS9B EQU   155                      VOLUME TOO FRAGMENTED FOR  @07AX52890100
                                        REQUEST                    @07A 52890200
CREARS9C EQU   156                      UNEXPECTED TRKCALC RC FOR  @10AX52890300
                                        FUNCTN=TRKBAL - EITHER     @10AX52890400
                                        0, 4, OR 12 (EXPECTING 8)  @10A 52890500
CREARS9D EQU   157                      DS7KEYID IS INVALID        @L2A 52890600
CREARS9F EQU   159                      QUANTITY NOT AVAILABLE     @L2AX52893300
                                        FOR ISAM DATA SET.         @L2A 52896000
CREARSA0 EQU   160                      QUANTITY NOT AVAILABLE     @L2AX52898700
                                        FOR ISAM DATA SET.         @L2A 52901400
CREARSA1 EQU   161                      QUANTITY NOT AVAILABLE     @L2AX52904100
                                        FOR ISAM DATA SET.         @L2A 52906800
CREARSA2 EQU   162                      REQUESTED ABSOLUTE TRACK   @L2AX52909500
                                        IS NOT AVAILABLE.          @L2A 52912200
CREARSA3 EQU   163                      THE RTA START OF SELECTED  @12AX52912700
                                        EXTENTS IS LESS THAN RTA   @12AX52913200
                                        START OF FREE SPACE        @12AX52913700
                                        EXTENTS.                   @12A 52914200
CREARSA4 EQU   164                      REQUESTED SPACE NOT        @L9AX52914300
                                        AVAILABLE.  LSA DEVICE IN  @L9AX52914400
                                        CRITICAL OR EMERGENCY      @L9AX52914500
                                        STATUS                     @L9A 52914600
CREARSA5 EQU   165                      Cannot create HFS data         X52914700
                                        set without security pkg.      X52914800
                                        Ref:  OS/390 Open Edition      X52914900
                                        Planning Guide SC28-1890.  @19C 52915000
CREARSA6 EQU   166                      MAX EXTENT VALUE SUPPLIED  @L8AX52915100
                                        BUT X37 ABEND REDUCTION    @L8AX52915200
                                        HAS NOT BEEN SPECIFIED.    @L8A 52915300
CREARSA7 EQU   167                      MIN ALLOCATION QUANTITY    @L8AX52915400
                                        SUPPLIED BUT 'BEST-FIT'    @L8AX52915600
                                        HAS NOT BEEN SPECIFIED.    @L8A 52915800
CREARSA8 EQU   168                      MIN ALLOCATION QUANTITY    @L8AX52916000
                                        GREATER THEN AVAILABLE     @L8AX52916200
                                        SPACE.                     @L8A 52916400
CREARSA9 EQU   169                      MIN ALLOCATION QUANTITY    @L8AX52916600
                                        GREATER THEN PRIMARY       @L8AX52916800
                                        SPACE QUANTITY.            @L8A 52917000
*/********************************************************************/ 52917200
*/* FOLLOWING CODES ARE VTOC CONVERSION CODES WHICH ARE SHARED WITH  */ 52917600
*/* EXTEND                                                           */ 52920300
*/********************************************************************/ 52923000
CREARSF0 EQU   240                      VTOC CONVERSION SFF1 DETECTED  X52925700
                                        SPLIT CYLINDER EXTENT      @L2A 52928400
CREARSF1 EQU   241                      VTOC CONVERSION SFF1 DETECTED  X52931100
                                        CCHH1>CCHH2                @L2A 52933800
.S7X     ANOP                                                           52936500
.FINISH  ANOP                                                           52939200
         MEND */  %PLSDACRX: ;                                          52942100
