*********************************************************************** 00050000
*                                                                     * 00200000
*PROPRIETARY V3 STATEMENT                                             * 00250000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00300000
*"RESTRICTED MATERIALS OF IBM"                                        * 00350000
*5695-DF1                                                             * 00400000
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00450000
*END PROPRIETARY V3 STATEMENT                                         * 00500000
*                                                                     * 00600000
*********************************************************************** 00650000
         MACRO                                                          01000000
&NAME    IGGDEBD                                                        02000000
*    03/20/73          LEVEL=01                                         02010000
DEBAVT   DSECT                                                          02040000
**********************************************************************  02050000
*   APPENDAGE VECTOR TABLE FOR DEB. CONTAINS PTRS TO THE APPENDAGES  *  02060000
*   USED BY IOS.                                                     *  02070000
**********************************************************************  02080000
         SPACE 3                                                        02090000
DEBEOEA  DS    A                        END OF EXTENT APPENDAGE         02100000
DEBSIOA  DS    A                        START I/O APPENDAGE             02110000
DEBPCIA  DS    A                        PROGRAM CONTROLLED INTERRUPT    02120000
DEBCEA   DS    A                        CHANNEL END APPENDAGE           02130000
DEBXCEA  DS    A                        ABNORMAL END APPENDAGE          02140000
         SPACE 5                                                        02150000
*******************************************************                 02160000
DEBEXT   DSECT                                                          02170000
*                                       EXTENTION CONTAINS POINTERS     02180000
*                                       TO BE PROTECTED FROM PROBLEM    02190000
*                                       PROGRAM                         02200000
DEBDCBFA DS    A                        DCB FIELD AREA ADDRESS          02210000
DEBPUT   DS    0A                       ADDR OF PUT MODULE              02240000
DEBGET   DS    0A                       ADDR OF GET MODULE              02250000
DEBDISAD DS    A                        ADDR OF PRIV MACRO MODULE       02260000
DEBRPSL  DS    0A                       ADDRESS OF RPS SIO MODULE       02264000
LOADEXT  EQU   *+4-DEBEXT               LENGTH OF LOAD EXTENSION        02266000
DEBWKPT4 DS    A                        SAME AS DCBWKPT4                02280000
DEBWKPT5 DS    A                        SAME AS DCBWKPT5                02290000
DEBFREED DS    0A                       ADDR OF DYN BUFF MODULE         02300000
DEBCEVEC DS    0BL24                    CHAN END VECT TBL CONSISTING OF 02310000
DEBCREAD DS    A                        READ                            02320000
DEBRPSIO DS    0A                       ADDR OF SECONDARY RPS SIO APP   02330000
DEBCSETL DS    A                        SETL                            02340000
DEBSIOA2 DS    0A                       ADDR OF SECONDARY SIO APP       02344000
BISAMEXT EQU   *+4-DEBEXT               EXTENSION LENGTH OF BISAM       02346000
DEBCWRIT DS    A                        WRITE                           02360000
DEBCCHK  DS    A                        WRITE VAL. CHECK                02370000
DEBCREWT DS    A                        RE-WRITE                        02380000
DEBCRECK DS    A                        RE-CHECK                        02390000
DEBABVEC DS    0BL24                    ABNORMAL END VECT TBL CONSISTS  02400000
*                                       OF THE FOLLOWING-               02410000
DEBAREAD DS    A                        READ                            02420000
DEBASETL DS    A                        SETL                            02430000
DEBAWRIT DS    A                        WRITE                           02440000
DEBACHK  DS    A                        WRITE VAL. CHECK                02450000
DEBAREWT DS    A                        RE-WRITE                        02460000
DEBARECK DS    A                        RE-CHECK                        02470000
DEBRPSS  DS    A                        SECONDARY SCAN SIO APP          02474000
SCANEXT  EQU   *-DEBEXT                                                 02480000
W1CEVECT EQU   DEBCEVEC                                                 02490000
W1CEREAD EQU   DEBCREAD                                                 02500000
W1CESETL EQU   DEBCSETL                                                 02510000
W1CEWRIT EQU   DEBCWRIT                                                 02520000
W1CECHK  EQU   DEBCCHK                                                  02530000
W1CEREWT EQU   DEBCREWT                                                 02540000
W1CERECK EQU   DEBCRECK                                                 02550000
W1ABVECT EQU   DEBABVEC                                                 02560000
W1ABREAD EQU   DEBAREAD                                                 02570000
W1ABSETL EQU   DEBASETL                                                 02580000
W1ABWRIT EQU   DEBAWRIT                                                 02590000
W1ABCHK  EQU   DEBACHK                                                  02600000
W1ABREWT EQU   DEBAREWT                                                 02610000
W1ABRECK EQU   DEBARECK                                                 02620000
&NAME    DSECT                                                          03000000
DEBNMSUB DS    0BL1                    = SUBRTNS LOADED BY OPEN         04000000
DEBTCBAD DS    A                       TCB POINTER                      05000000
DEBAMLNG DS    0BL1                    LENGTH OF ACCESS METHOD SECTION  06000000
DEBDEBAD DS    A                       POINTER TO NEXT DEB IN TASK      07000000
DEBOFLGS DS    0BL1                    DATA SET STATUS FLAGS            08000000
*                                      B0.B1 01=DISP=OLD                09000000
*                                            10=DISP=MOD                10000000
*                                            11=DISP=NEW                11000000
*                                      B2 EOV OR EOF                    12000000
*                                      B3 PARTIAL RELEASE               13000000
*                                      B4 DCB MODIFICATION              14000000
*                                      B5 SPLIT CYLINDER                15000000
*                                      B6 NON STANDARD LABELS           16000000
*                                      B7 MAG TAPE- USE REDUCED ERP     17000000
DEBIRBAD DS    A                       POINTER TO IRB FOR ASYNC EXIT    18000000
DEBOPATB DS    0BL1                    TYPE OF I/O                      19000000
*                                      B0 SYSABEND OR SYSUDUMP DS       20000000
*                                      B1 0 (ALWAYS)                    21000000
*                                      B2.B3 01=REREAD                  22000000
*                                            11=LEAVE                   23000000
*                                      B4.B5.B6.B7 0000=INPUT           24000000
*                                                  1111=OUTPUT          25000000
*                                                  0011=INOUT           26000000
*                                                  0111=OUTIN           27000000
*                                                  0001=RDBACK          28000000
*                                                  0100=UPDATE          29000000
DEBQSCNT DS    BL1                     PURGE QUIESCE COUNT              30000000
         DS    H                       RESERVED                         31000000
DEBNMEXT DS    0BL1                    NUMBER OF EXTENTS CONSTRUCTED    32000000
DEBUSRPG DS    A                       AD OF 1ST IOB IN USR PURGE CHAIN 33000000
DEBPRIOR DS    0BL1                    DISPATCHING PRIORITY             34000000
DEBEDBAD DS    A                       POINTER TO PARMLIST OF PURGE ECB 35000000
DEBPROTG DS    0BL.4                   TASK PROTECTION FLAG             36000000
DEBDEBID DS    0BL.4'1111'             X'F' TO IDENTIFY AS A DEB        37000000
DEBDCBAD DS    A                       POINTER TO CORRESPONDING DCB     38000000
DEBEXSCL DS    0BL1                    SCALE FOR SIZE OF DEV SECTION    39000000
DEBAPPAD DS    A                       POINTER TO APPENDAGE VECTOR TBL  40000000
* ISAM DEPENDENT SECTION   (M=0 EXTENT NUMBER)                          41000000
DEBNIEE  DS    0BL1                    = INDEX EXTENTS                  42000000
DEBFIEAD DS    A                       ADDR OF 1ST INDEX EXTENT         43000000
DEBNPEE  DS    0BL1                    = PRIME DATA EXTENTS             44000000
DEBFPEAD DS    A                       ADDR OF 1ST PRIME DATA EXTENT    45000000
DEBNOEE  DS    0BL1                    = OVERFLOW EXTENTS               46000000
DEBFOEAD DS    A                       ADDR OF 1ST OVERFLOW EXTENT      47000000
DEBRPSID DS    0BL1                    RPS IDENTIFIERS FOR PRI,IX,OVFLO 48000000
*                                      B0 PRIME ON RPS                  49000000
*                                      B1 INDEX ON RPS                  50000000
*                                      B2 OVFLO ON RPS                  51000000
*                                      B3 SIO APPENDAGE LOADED          52000000
*                                      B4-7 RESERVED                    53000000
DEBEXPTR DS    A                        POINTER TO DEB EXTENTION        54000000
         ORG   &NAME+32                                                 55000000
* DIRECT ACCESS DEVICE DEPENDENT SECTION                                56000000
*        ADDRESS BY DEBAD + (M X (4 X EXSCL))                           57000000
DEBDVMOD DS    0BL1                    DEVICE MODIFIER (FILE MASK)      58000000
DEBUCBAD DS    A                       POINTER TO UCB                   59000000
DEBBINUM DS    BL2                     BB OF EXTENT                     60000000
DEBSTRCC DS    BL2                     CYLINDER ADDR FOR START OF EXT   61000000
DEBSTRHH DS    BL2                     HEAD NUMBER FOR START OF EXTENT  62000000
DEBENDCC DS    BL2                     CYLINDER ADDR FOR END OF EXTENT  63000000
DEBENDHH DS    BL2                     HEAD NUMBER FOR END OF EXTENT    64000000
DEBNMTRK DS    BL2                     NUMBER OF TRACKS IN EXTENT       65000000
*                                      ******************************** 66000000
         MEND                                                           67000000
