*        %GOTO SMF18PLS;      /*                                        00050000
         MACRO                                                          00100000
&NAME    IGGSMF18                                                       00150000
.********************************************************************** 00200000
.* $MAC(IGGSMF18) COMP(DF107)                                         * 00250000
.*                                                                    * 00300000
.* MACRO NAME = IGGSMF18                                              * 00350000
.*                                                                    * 00400000
.* DESCRIPTION: Maps SMF record type 18, written when a user's        * 00450000
.*     data set is renamed                                            * 00500000
.*                                                                    * 00550000
.* STATUS: DFSMS 2.10                                                 * 00600000
.*                                                                    * 00650000
.*PROPRIETARY V3 STATEMENT                                            * 00700000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00750000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00800000
.*5647-A01                                                            * 00850000
.*(C) COPYRIGHT 1993, 2000 IBM CORP.                                  * 00900000
.*END PROPRIETARY V3 STATEMENT                                        * 00950000
.*                                                                    * 01050000
.*   FUNCTION: This macro includes the declarations for the SMF       * 01100000
.*     Type 18 record.                                                * 01150000
.*                                                                    * 01200000
.* Method of Access:                                                  * 01250000
.*   ASM - User includes Record Type on IFASMFR macro invocation      * 01300000
.*         Examples:                                                  * 01350000
.*         - IFASMFR  18                                              * 01400000
.*         - IFASMFR (...,18,...)                                     * 01450000
.*                                                                    * 01500000
.*  PL/S - User defines a macro variable IFAR18 where 18=Record type  * 01550000
.*         being requested, INCLUDEs the IFASMFR macro and declares   * 01600000
.*         the basing pointer for the record mapping.                 * 01650000
.*         Example:                                                   * 01700000
.*         - %IFAR18 = 'YES'                                          * 01750000
.*           DCL SMF18PTR PTR(31)                                     * 01800000
.*           %INCLUDE SYSLIB(IFASMFR)                                 * 01850000
.*                                                                    * 01900000
.*   NOTES:                                                           * 01950000
.*                                                                    * 02000000
.*     DEPENDENCIES: None                                             * 02050000
.*     RESTRICTIONS: None                                             * 02100000
.*                                                                    * 02150000
.*   MACRO:                                                           * 02200000
.*                                                                    * 02250000
.*     PROCESSOR: PL/X, PL/AS, PLS/3, OR ASSEMBLER H                  * 02300000
.*     DISTRIBUTION LIBRARY: AMACLIB                                  * 02350000
.*     ATTRIBUTES:                                                    * 02400000
.*                                                                    * 02450000
.*       This macro produces mapping for the SMF record type 18       * 02500000
.*                                                                    * 02550000
.*   EXIT NORMAL:                                                     * 02600000
.*                                                                    * 02650000
.*     RETURN CODE: 0                                                 * 02700000
.*     No errors detected                                             * 02750000
.*                                                                    * 02800000
.*   EXIT ERRORS:                                                     * 02850000
.*                                                                    * 02900000
.*       No errors will be detected by this macro.                    * 02950000
.*                                                                    * 03000000
.*   EXTERNAL REFERENCES:                                             * 03050000
.*                                                                    * 03100000
.*     MACROS:                                                        * 03150000
.*       None                                                         * 03200000
.*                                                                    * 03250000
.* CHANGE ACTIVITY =                                                  * 03300000
.* $L0=MVS/ESA,JDZ1110,T920801,SJPLJH: SMF Record Type 18             * 03333300
.* $L1=RenDup,HDZ11F0,99Oct22,SJPLWER: Allow rename if name in use @L1A 03366600
.*                                                                    * 03400000
.********************************************************************** 03450000
*                                                                       03500000
* THIS RECORD IS WRITTEN WHEN A USER'S DATA SET IS RENAMED.             03550000
* LENGTH IS VARIABLE, MINIMUM OF 140.                                   03600000
*                                                                       03650000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    03700000
SMF18HDR EQU   *         HEADER SEGMENT FOR RECORD TYPE18(RENAME)       03750000
SMF18LEN DS    BL2'0'    RECORD LENGTH                                  03800000
SMF18SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             03850000
SMF18FLG DS    BL1'0'    HEADER FLAG BYTE                               03900000
SMF18RTY DS    BL1'0'    RECORD TYPE 18                                 03950000
SMF18TME DS    BL4'0'    TOD, USING TIME MACRO W/BIN. INTVL.            04000000
SMF18DTE DS    PL4'0000' DATE, PACKED/DEC FORM; 00YYDDDF                04050000
SMF18SID DS    CL4' '    SYSTEM ID                                      04100000
SMF18JBN DS    CL8' '    JOB NAME                                       04150000
SMF18RST DS    BL4'0'    READER START TIME                              04200000
SMF18RSD DS    PL4'0000' READER START DATE, PK/DEC FORM: 00YYDDDF       04250000
SMF18UID DS    CL8' '    USERID                                         04300000
SMF18RIN DS    BL2'0'    RECORD INDICATORS: ALL BITS RESERVED(0)        04350000
SMF18ODS DS    CL44' '   OLD DSNAME                                     04400000
SMF18NDS DS    CL44' '   NEW DSNAME                                     04450000
SMF18FL1 DS    BL1'0'    RENAME FLAGS                              @L1A 04475000
SMF18FAC EQU   B'10000000' SYSDSN ENQ FAILED, RENAME COMPLETED WITH@L1A 04500000
*                        PERMISSION OF STGADMIN.DPDSRN.* FACILITY  @L1A 04525000
SMF18RSV EQU   B'01111111' RESERVED                                @L1A 04550000
SMF18RV1 DS    BL2'0'    RESERVED                                  @L1C 04575000
SMF18NVL DS    BL1'0'    NUMBER OF VOLUME SERIAL ENTRIES THAT FOLLOW    04600000
* VOLUME SERIAL ENTRY (ONE FOR EACH VOLUME)                             04625000
SMF18RV2 DS    BL2'0'    RESERVED                                       04650000
SMF18FVL DS    CL6' '    VOLUME SERIAL NUMBER (FROM UCBVOLI)            04700000
SMF18LNV EQU   *-SMF18RV2  LENGTH OF EACH VOLUME SERIAL ENTRY           04750000
         ORG   SMF18RV2                                                 04800000
         MEND                                                           04850000
         MEXIT            */                                            04900000
 %SMF18PLS:;                                                            04950000
                                                                        05000000
    DCL 1 SMFRCD18 BASED(SMF18PTR) BDY(WORD),                           05050000
                                                                        05100000
 /* RECORD TYPE 18 - DATA SET RENAME                                 */ 05150000
 /* WRITTEN WHENEVER A DATA SET IS RENAMED                           */ 05200000
                                                                        05250000
         3 SMF18LEN FIXED(15),    /* RDW RECORD LENGTH               */ 05300000
         3 SMF18SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 05350000
         3 SMF18FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 05400000
         3 SMF18RTY FIXED(8),     /* RECORD TYPE 18                  */ 05450000
         3 SMF18TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 05500000
         3 SMF18DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 05550000
         3 SMF18SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 05600000
         3 SMF18JBN CHAR(8),      /* JOB NAME                        */ 05650000
         3 SMF18RST FIXED(31) BDY(HWORD), /* READER START TOD(.01 SEC)*/05700000
         3 SMF18RSD CHAR(4),      /* READER START DATE               */ 05750000
         3 SMF18UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 05800000
          5 SMF18UID CHAR(8),                                           05850000
         3 SMF18RIN BIT(16),      /* RESV                            */ 05900000
         3 SMF18ODS CHAR(44),     /* OLD DATA SET NAME               */ 05950000
         3 SMF18NDS CHAR(44),     /* NEW DATA SET NAME               */ 06000000
         3 SMF18FL1 BIT(8),       /* RENAME G                    @L1A*/ 06018700
           5 SMF18FAC BIT(1),     /* SYSDSN ENQ FAILED, RENAME   @L1A   06037400
                                     COMPLETED WITH PERMISSION   @L1A   06056100
                                     OF STGADMIN.DPDSRN.*        @L1A*/ 06074800
           5 SMF18RSV BIT(7),     /* RESERVED                    @L1A*/ 06093500
         3 SMF18RV1 CHAR(2),      /* RESERVED                    @L1C*/ 06112200
         3 SMF18NVL FIXED(8);     /* NUM OF VOLUME SECTIONS FOLLOWING*/ 06130900
                                                                        06150000
    DCL 1 * BASED CHAR(8),        /* VOLUME SECTION, ONE FOR EACH       06200000
                                     VOLUME CONTAINING PART OF THE DS*/ 06250000
         3 SMF18RV2 CHAR(2),      /* RESV                            */ 06300000
         3 SMF18FVL CHAR(6);      /* VOLUME SERIAL NUMBER            */ 06350000
