*        %GOTO EXITPL;                                             /*   00050000
         MACRO                                                 @G860P33 00100000
         IHAABEPL                                                       00150000
*                                                            @G860P33*/ 00200000
*%EXITPL: ;                            /*                    @G860P33*/ 00250000
* /*******************************************************************/ 00300000
* /*                                                                 */ 00318900
* /* MACRO NAME = IHAABEPL                                           */ 00337800
* /*                                                                 */ 00356700
* /* MICROFICHE NAME = IHAABEPL                                      */ 00375600
* /*                                                                 */ 00394500
* /* DESCRIPTIVE NAME = PREDUMP EXIT PARAMETER LIST                  */ 00413400
* /*                                                                 */ 00432300
* /* STATUS = NEW FOR OS/VS2 HBB2102                                 */ 00451200
* /*                                                                 */ 00470100
* /* COPYRIGHT = 5740-XC6 COPYRIGHT IBM CORP 1981                    */ 00489000
* /*             LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,         */ 00507900
* /*             REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER         */ 00526800
* /*             G120-2083.                                          */ 00545700
* /*                                                                 */ 00564600
* /* FUNCTION = THIS MACRO IS THE MAPPING FOR THE PREDUMP EXIT       */ 00583500
* /*            PARAMETER LIST USING BY IEAVTABD AND ANY USER        */ 00602400
* /*            WRITTEN PROGRAM.                                     */ 00621300
* /*                                                                 */ 00640200
* /* METHOD OF ACCESS =                                              */ 00659100
* /*   BAL - DSECT IS ALWAYS PRODUCED.  USING ON IHAABEPL GIVES      */ 00678000
* /*         ADDRESSABILITY TO ALL SYMBOLS.                          */ 00696900
* /*   PLS - INCLUDE IHAABEPL FROM SYSLIB.                           */ 00715800
* /*                                                                 */ 00734700
* /* SIZE = DECIMAL 36, X'24'                                        */ 00753600
* /*                                                                 */ 00772500
* /* CHANGE ACTIVITY = NEW FOR OS/VS2 HBB2102                        */ 00791400
* /*                                                                 */ 00810300
* /**********************************************************@G860P33*/ 00829200
*        %GOTO EXITPLS;                            /*          @G860P33 00850000
IHAABEPL DSECT                                                  G860P33 00900000
ABEPID   DS    CL4                     PARMLIST ID              G860P33 00950000
ABEPJOBN DS    CL8                     JOB NAME                 G860P33 01000000
ABEPABND DS    0CL4                                             G860P33 01050000
ABEPABC  DS    CL3                     ABEND CODE               G860P33 01100000
ABEPRES  DS    C                       RESERVED                 G860P33 01150000
ABEPSDWA DS    F                       ADDRESS OF SDWA          G860P33 01200000
ABEPMODN DS    CL8                     MODULE NAME              G860P33 01250000
ABEPSNAP DS    F                       ADDRESS OF SNAP PARMLIST G860P33 01300000
ABEPLVRC DS    0F                                               G860P33 01350000
ABEPLVL  DS    H                       LEVEL INDICATOR          G860P33 01400000
ABEPRTN  DS    H                       RETURN CODE FROM PREVIOUS        01450000
*                                      INDICATOR                G860P33 01500000
         MEND  ,                                              G860P33*/ 01550000
*%EXITPLS: ;                           /*                    @G860P33*/ 01600000
*DECLARE ABEPPTR PTR(31);              /* BASE PTR FOR       @G860P33*/ 01633300
*DECLARE                               /*           IHAABEPL @G860P33*/ 01666600
*  1 IHAABEPL BASED(ABEPPTR),          /*                    @G860P33*/ 01700000
*   2 ABEPID    CHAR(4),               /* PARMLIST ID        @G860P33*/ 01750000
*   2 ABEPJOBN  CHAR(8),               /* JOB NAME           @G860P33*/ 01800000
*   2 ABEPABND ,                       /*                    @G860P33*/ 01850000
*    3 ABEPABC  CHAR(3),               /* ABEND CODE         @G860P33*/ 01900000
*    3 ABEPRES  CHAR(1),               /* RESERVED           @G860P33*/ 01950000
*   2 ABEPSDWA  PTR(31),               /* ADDRESS OF SDWA    @G860P33*/ 02000000
*   2 ABEPMODN  CHAR(8),               /* MODULE NAME        @G860P33*/ 02050000
*   2 ABEPSNAP  PTR(31),               /* ADDRESS OF SNAP PARMLIST      02100000
*                                                            @G860P33*/ 02150000
*   2 ABEPLVRC ,                       /*                    @G860P33*/ 02200000
*    3 ABEPLVL  FIXED(15),             /* PARMLIST LEVEL INDICATOR      02250000
*                                                            @G860P33*/ 02300000
*    3 ABEPRTN  FIXED(15);             /* RETURN CODE FROM PREVIOUS     02350000
*                                          EXIT              @G860P33*/ 02400000
