*/********************************************************************/ 00050000
*/*                                                                  */ 00100002
*/*      IHACTM                                                      */ 00116200
*/*                                                                  */ 00132500
*/* EXTERNAL CLASSIFICATION:  NONE                                   */ 00155000
*/* END OF EXTERNAL CLASSIFICATION:                              @PQA*/ 00177500
*/*                                                                  */ 00200002
*/*01* PROPRIETARY STATEMENT=                                        */ 00200100
*/***PROPRIETARY_STATEMENT********************************************/ 00200200
*/*                                                                  */ 00200300
*/*                                                                  */ 00200400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00200500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00200600
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1979, 2001                      */ 00200790
*/*                                                                  */ 00200900
*/* STATUS= HBB7703                                                  */ 00201040
*/*                                                                  */ 00201100
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00201200
*/*                                                                  */ 00204000
*/*    BAL - INVOKE IHACTM WITH POSITIONAL PARAMETER INDICATING      */ 00204100
*/*          THE MAPPING DESIRED. CHOICES ARE: XV, CXSA, CQE,        */ 00204200
*/*          DPL, QR0, WWB, FTPT, CQB, AMRQ, UXIR, CMDELEM,      @LDC*/ 00204300
*/*          AND VRBMP                                           @LDA*/ 00204400
*/*                                                                  */ 00204500
*/*   PL/S -                                                         */ 00204600
*/*  THIS MACRO CONTAINS THE PL/S VERSIONS OF THE WWB, DOM PARM      */ 00204700
*/*  LIST, IEAVMQR0 PARM LIST, SVC 35 EXTENDED SAVEAREA, THE     @PRC*/ 00204800
*/*  SVC 87 EXTENDED SAVEAREA, THE SVC 72 EXTENDED SAVEAREA, @G741PSS*/ 00204900
*/*  THE COMMAND QUEUE BUFFER , THE ACTION MESSAGE               @L5C*/ 00205000
*/*  RETENTION QUEUE, THE DISPLAY CONSOLES PARAMETER LIST,       @L6C*/ 00205100
*/*  THE INTERFACE TO IEAVX600 (UXIR),                           @LCC*/ 00205200
*/*  AND THE CONSOLE COMMAND QUEUE ELEMENT.                      @LCA*/ 00205300
*/*                                                                  */ 00205400
*/*  NOTE:   The following mappings have been split into         @PRA*/ 00205500
*/*          other mapping macros, and this macro issues the     @PRA*/ 00205600
*/*          other macro, for compatibility reasons.             @PRA*/ 00205700
*/*          Modules should be changed, when convenient, to      @PRA*/ 00205800
*/*          issue the new macro instead of IHACTM.              @PRA*/ 00205900
*/*          CQE    ->  IEZVD001                                 @PRA*/ 00206000
*/*          CXSA   ->  IEZVD002                                 @PRA*/ 00206100
*/*          DOMPL  ->  IEZVM112                                 @PRA*/ 00206200
*/*          FTPT   ->  IEZVR001                                 @PRA*/ 00206300
*/*          WWB    ->  IHAWWB                                   @PRA*/ 00206400
*/*                                                                  */ 00206500
*/*  TO GET THE SVC 35 EXTENDED SAVEAREA(XV), DEFINE THE MACRO   @L9C*/ 00206600
*/*  VARIABLE CTMXV AND SET IT TO 'YES'.                         @L9C*/ 00206700
*/*                                                                  */ 00206800
*/*  TO GET THE WWB, DEFINE THE MACRO VARIABLE CTMWWB AND SET IT     */ 00206900
*/*  EQUAL TO 'YES'.  It is best that the IHAWWB macro be used   @PPC*/ 00207000
*/*  instead of IHACTM                                           @PPA*/ 00207100
*/*                                                                  */ 00207200
*/*  TO GET THE DOM PARAMETER LIST, DEFINE THE MACRO VARIABLE        */ 00207300
*/*  CTMDOMPL AND SET IT TO 'YES'. It is recommended to invoke   @PRC*/ 00207400
*/*  the DOMPL mapping macro, IEZVM112, instead of IHACTM.       @PRA*/ 00207500
*/*                                                                  */ 00207600
*/*  TO GET THE SVC 87 EXTENDED SAVEREA, DEFINE THE MACRO VARIABLE   */ 00207700
*/*  CTMXD AND SET IT TO 'YES'.                                      */ 00207800
*/*                                                                  */ 00207900
*/*  TO GET THE CQE, DEFINE THE MACRO VARIABLE CTMCQE AND SET IT     */ 00208000
*/*  TO 'YES'. IT IS RECOMMENDED TO INVOKE THE CQE MAPPING MACRO @PRC*/ 00208100
*/*  IEZVD001, INSTEAD OF IHACTM.                                @PRA*/ 00208200
*/*                                                                  */ 00208300
*/*  TO GET THE SVC 72 EXTENDED SAVEAREA, DEFINE THE MACRO VARIABLE  */ 00208400
*/*  CTMCXSA AND SET IT TO 'YES'. IT IS RECOMMENDED TO INVOKE    @PRC*/ 00208500
*/*  THE CXSA MAPPING MACRO, IEZVD002, INSTEAD OF IHACTM.        @PRA*/ 00208600
*/*                                                                  */ 00208700
*/*  TO GET THE QR0, DEFINE THE MACRO VARIABLE CTMQR0 AND SET IT     */ 00208800
*/*  EQUAL TO 'YES'.                                                 */ 00208900
*/*                                                              @PRA*/ 00209000
*/*                                                                  */ 00209100
*/*  TO GET THE FRR USERS PARM LIST MAPPING, DEFINE CTMFTPT AND SET  */ 00209200
*/*  IT TO 'YES'. IT IS RECOMMENDED TO INVOKE THE FTPT           @PRC*/ 00209300
*/*  (PARMLIST) MAPPING MACRO, IEZVR001, INSTEAD OF IHACTM.      @PRA*/ 00209400
*/*                                                                  */ 00209500
*/*  TO GET THE COMMAND QUEUE BUFFER MAPPING, DEFINE CTMCQB  @G741PSS*/ 00209600
*/*  AND SET IT TO 'YES'.                                    @G741PSS*/ 00209700
*/*                                                                  */ 00209800
*/*  TO GET THE ACTION MESSAGE RETENTION QUEUE ENTRY         @G741PSS*/ 00209900
*/*  MAPPING, DEFINE CTMAMRQ AND SET IT TO 'YES'. ALSO       @G741PSS*/ 00210000
*/*  ENSURE THAT THE WQE IS MAPPED VIA MACRO IHAWQE.             @L9C*/ 00210100
*/*                                                                  */ 00210200
*/*  TO GET THE DISPLAY CONSOLES PARAMETER LIST, DEFINE CTMDCPL  @L5A*/ 00210300
*/*  AND SET IT TO 'YES'.                                        @L5A*/ 00210400
*/*                                                                  */ 00210500
*/*  TO GET THE INTERFACE TO IEAVX600, DEFINE THE MACRO          @L6A*/ 00210600
*/*  VARIABLE CTMUXIR AND SET IT TO 'YES'.                       @L6A*/ 00210700
*/*                                                                  */ 00210800
*/*  TO GET THE CONSOLE COMMAND QUEUE MAPPING, DEFINE CTMCMD     @LCA*/ 00210900
*/*  AND SET IT TO 'YES'.                                        @LCA*/ 00211000
*/*                                                                  */ 00211100
*/*  TO SET THE MSCOPE SYSTEM NAMES ARRAY (CONMSCNM) DIMENSION,  @LSA*/ 00211200
*/*  SET THE MACRO VARIABLE CONMSCX TO THE DESIRED VALUE.        @LSA*/ 00211300
*/*                                                                  */ 00211400
*/*  TO GET THE MAPPING OF THE INPUT REGISTER 0 FOR DOM, DEFINE  @LUA*/ 00211500
*/*  CTMDOM0 AND SET IT TO 'YES'.                                @LUA*/ 00211600
*/*                                                                  */ 00211700
*/*  THESE MACRO VARIABLES SHOULD ALL BE SET BEFORE THE INCLUSION    */ 00211800
*/*  OF IHACTM AND IHACTM SHOULD ONLY BE INCLUDED ONCE.              */ 00211900
*/*                                                                  */ 00212000
*/* CHANGE ACTIVITY = G741PSS, ZA19994, G81LPSS, ZA41986,            */ 00212100
*/*                   ZA44318, ZA37220, ZA31868                      */ 00212200
*/* $MAC(IHACTM) COMP(SC1CK): COMM TASK MACRO                    @LKA*/ 00212300
*/* $L1=XMCTASK,  JBB1326,  801031,  PD2I:  INCREASE # CQE ENTRIES   */ 00212400
*/* $L2=XMCTASK,  JBB1326,  801031,  PDSJ:  SVC 35 EXT SAVEAREA CHAN */ 00212500
*/* $L3=XMCTASK,  JBB1326,  801031,  PD2I:  ADD CQEER TO CXSA        */ 00212600
*/* $L4=XMCTASK,  JBB1326,  801107,  PDSJ:  TOKEN SUPPORT            */ 00212700
*/* $P4=PMM0300,  JBB1326,  801107,  PDSJ:  CQB CPYRIGHT UPDATE      */ 00212800
*/*                   G860PSS, G860P2G                               */ 00212900
*/* $D1=DCR7,     JBB2110,  810831,  PDSJ:  MULTILINE WTP SUPPORT    */ 00213000
*/* $L5=MRRDC,    JBB2125,  821217,  PDE8:  SELECTIVE DISPLAY C      */ 00213100
*/* $L6=MRREXITS, JBB2125,  830420,  PDFA:  COMM TASK USER EXITS     */ 00213200
*/* $D2=DCR38,    JBB2125,  830420,  PDFI:  ROUTING BY MESSAGE LEVEL */ 00213300
*/* $L7=MRRHCLOG, JBB2125,  830608,  PDF8:  HARDCOPY LOG FORMAT      */ 00213400
*/* $L8=MRRRECOV, JBB2125,  830608,  PDE9:  USER EXITS RECOVERY      */ 00213500
*/*                   ZA88861                                        */ 00213600
*/* $L9=COEXWTO2, JBB2220,  840201,  PDFE:  JES3/MCS COEXISTENCE     */ 00213700
*/* $LA=COEXDC,   JBB2220,  840731,  PDE9:  JES3/MCS COEXISTENCE     */ 00213800
*/* $LB=COEXDOM,  JBB2220,  840801,  PDFB:  JES3/MCS COEXISTENCE     */ 00213900
*/* $LC=IOGEN,    JBB2220,  841010,  PDFI:  IOGEN RESTRUCTURE        */ 00214000
*/* $P5=PA20122,  JBB2220,  850419,  PD2L:  JES3/MCS COEXISTENCE     */ 00214100
*/* $P6=PA20535,  JBB2220,  851023,  PDFB:  JES3/MCS COEXISTENCE     */ 00214200
*/* $D3=DCR156,   JBB2220,  851223,  PDF9:  4-BYTE CONSOLE ID CHANGE */ 00214300
*/* $P7=PA21029,  JBB2220,  860730,  PDF9:  JES3/MCS COEXISTENCE     */ 00214400
*/*                 YA24954 - COMM TASK STORAGE EXHAUSTION   @YA24954*/ 00214500
*/*                 YA32858 - COMM TASK STORAGE EXHAUSTION   @YA32858*/ 00214600
*/* $01=OY40053,  JBB2220,  910722,  PDBD:  MPF/GENX Table           */ 00214700
*/*                                         Serialization            */ 00214800
*/* $LD=SP3132CS, JBB3313,  880430,  PDCS:  B 1 SECURITY SUPPORT     */ 00214900
*/* $LE=SP3134CR, JBB3313,  880729,  PDCR:  MVS B1 SECURITY SUPPORT  */ 00215000
*/* $LF=CNMG2,    HBB4410,  860419,  PDAU:  CONSOLE MERGE STAGE II   */ 00215100
*/* $LG=TSOOP,    HBB4410,  870622,  PDBU:  TSO OPERATOR             */ 00215200
*/* $LH=KNWTO,    HBB4410,  870622,  PDCM:  KANJI/WTO                */ 00215300
*/* $LI=OPSSI,    HBB4410,  871026,  PDDB:  OPSSI DISPLAY COMMAND    */ 00215400
*/* $LJ=OPSSI,    HBB4410,  871026,  PDR3:  OPSSI VARY COMMAND       */ 00215500
*/* $D4=DEO0030,  HBB4410,  880318,  PDDL:  TSO OPERATOR             */ 00215600
*/* $LK=OPSSI7CY, HBB4410,  880420,  PDCY:  OPSSI VC700 SUPPORT      */ 00215700
*/* $LL=OPSSI8DB, HBB4410,  880706,  PDDB:  OPSSI CONSOLE SWITCH     */ 00215800
*/* $LM=OPSSI8CY, HBB4410,  880706,  PDCY:  OPSSI CQB ALIGNMENT      */ 00215900
*/* $LN=TSOOP8BT, HBB4410,  880706,  PDBT:  TSO OPERATOR             */ 00216000
*/* $LO=TSOOP8F9, HBB4410,  880706,  PDF9:  TSO OPERATOR             */ 00216100
*/* $LP=TSOOP9BT, HBB4410,  880905,  PDBT:  TSO OPERATOR             */ 00216200
*/* $LQ=OPSSICED, HBB4410,  881205,  PDED:  OPSSI RECOVERY           */ 00216300
*/* $P8=PEO1251,  HBB4410,  881205,  PDEF:  MESSAGE LOSS PREVENTION  */ 00216400
*/* $LR=CNSL1DS9, HBB4410,  890123,  PDS9:  CONSOLE ENHANCEMENTS I   */ 00216500
*/* $LS=CNSL1ES9, HBB4410,  890403,  PDS9:  CONSOLE ENHANCEMENTS I   */ 00216600
*/* $D5=DEO0136,  HBB4410,  890403,  PDS9:  CONSOLE ENHANCEMENTS I   */ 00216700
*/* $LT=CNSL1EBU, HBB4410,  890403,  PDBU:  CONSOLE ENHANCEMENTS I   */ 00216800
*/* $D6=DEO0124 , HBB4410,  890403,  PDHE:  DCR124                   */ 00216900
*/* $LU=CNITGEHE, HBB4410,  890510,  PDHE:  CONSOLE INTEGRATION      */ 00217000
*/* $LV=CNITGECR, HBB4410,  890510,  PDCR:  CNITG DESC 12, UD        */ 00217100
*/* $LW=CNITGFCS, HBB4410,  890612,  PDCS:  CNITG CONSOLE SWITCH     */ 00217200
*/* $LX=CNITGFCR, HBB4410,  890612,  PDCR:  CNITG UD MSG PROCESSING  */ 00217300
*/* $P9=PGP0056,  HBB4410,  890621,  PDCM:  PGP0056 REWORK           */ 00217400
*/* $PA=PEO1717,  HBB4410,  890621,  PDHH:  CONSOLE ENHANCEMENTS I   */ 00217500
*/* $D7=DEO0184,  HBB4410,  890724,  PDHE:  DCR 184                  */ 00217600
*/* $PB=PEO2281,  HBB4410,  890814,  PDS9:  UPDATE ODTE ARRAY SIZE   */ 00217700
*/* $PC=PEO2515,  HBB4410,  890918,  PDCM:  TEXT KEYWORD INTEGRITY   */ 00217800
*/* $D8=DEO0210,  HBB4410,  890920,  PD35:  WTO PERFORMANCE          */ 00217900
*/* $D9=DEO0253,  HBB4410,  891023,  PDBT:  OPSSI - DCR 253          */ 00218000
*/* $DA=DEO0254,  HBB4410,  891023,  PDEF:  SYSPLEX MESSAGE SERVICES */ 00218100
*/* $PD=PEO2553,  HBB4410,  891127,  PDED:  ADD CONAHERE BIT         */ 00218200
*/* $PE=PEO2712,  HBB4410,  890105,  PDHD:  CONSOLE INTEGRATION      */ 00218300
*/* $PF=PEO2650,  HBB4410,  900105,  PDR3:  JSAB PTM                 */ 00218400
*/* $PG=PEO3318,  HBB4410,  900226,  PDCR:  QUEUE BY ID ONLY         */ 00218500
*/* $PH=PEO3397,  HBB4410,  900226,  PDCR:  ADD XVWTPR               */ 00218600
*/* $PI=PEO3576,  HBB4410,  900226,  PDHG:  UPDATE COMMENTS          */ 00218700
*/* $DB=DEO0324,  HBB4410,  900330,  PDHE:  ADD LOADWAIT CONSTANTS   */ 00218800
*/* $PJ=PEO4396,  HBB4410,  900604,  PDEF:  ADD XVSTCKTM             */ 00218900
*/* $PK=PEO4314,  HBB4410,  900604,  PDAD:  NEW REASON CODE FOR D23  */ 00219000
*/*                                         ABEND IN IHAXV           */ 00219100
*/* $PL=PEO4480,  HBB4410,  900604,  PDEF:  AMRF RECOVERY            */ 00219200
*/* $DC=DEO0358,  HBB4410,  900626,  PDEC:  DBCS REMOVAL             */ 00219300
*/* $02=OY37247,  HBB4410,  901026,  PD35:  PEO4814 WTO PERFORMANCE  */ 00219400
*/* $03=OY43007,  HBB4410,  910701,  PDHE:  ADD VBNLKID              */ 00219500
*/* $DD=DEO0243,  HBB4420,  890905,  PDDC:  CONSOLE INTEGRATION      */ 00219600
*/* $LY=CNSL2ADQ, HBB4420,  900105,  PDDQ:  CONSOLE ENHANCEMENTS II  */ 00219700
*/* $LZ=CNSL2CS9, HBB4420,  900416,  PDS9:  CONSOLE ENHANCEMENTS II  */ 00219800
*/* $DE=DH30086,  HBB4420,  900416,  PDS9:  CONSOLE ENHANCEMENTS II  */ 00219900
*/* $M1=CNSL2CED, HBB4420,  900416,  PDED:  CONSOLE ENHANCEMENTS II  */ 00220000
*/* $M2=NETSY6HK, JBB4422,  901112,  PDHK:  NETVIEW AUTOMATION       */ 00220100
*/* $PM=PKB1563,  HBB4430,  920729,  PDCF:  UPDATE PARMFRID COMMENT  */ 00220200
*/* $04=OY53650,  HBB4420,  920415,  PDHH:  SYSTEM CONSOLE PROBLEM   */ 00220300
*/*                                         DETERMINATION (PD) MODE  */ 00220400
*/* $MA=OSR4HZ,   HBB5510,  921207,  PDHZ:  Operations Restructure   */ 00220500
*/* $MB=SYSOP6ED, HBB5510,  930304,  PDED:  Sysplex Operations (DCPL)*/ 00220600
*/* $PN=PIG4035,  HBB5510,  930325,  PDHZ:  Byte to save WQEQDSYS    */ 00220700
*/* $MC=4DGIT3J,  HBB5510,  930415,  PD3J: Four Digit Device Support */ 00220800
*/* $PO=PIG1581,  HBB5510,  930520,  PDED:  XV PLAS vs ASM mismatch  */ 00220900
*/* $MD=SYSOPSC,  HBB5510,  930715,  PDSC:  Reply ID Constraint      */ 00221000
*/*                                         Relief                   */ 00221100
*/* $DF=DIG0114,  HBB5510,  930715,  PDSC:  1000 line MLWTO limit    */ 00221200
*/*                                         when WQE shortage exists */ 00221300
*/* $PP=PIG2355,  HBB5510,  930909,  PDSC:  Move WWB to IHAWWB macro */ 00221400
*/* $ME=OPLOG33J, HBB5520,  930923,  PD3J:  OPERLOG Support          */ 00221500
*/* $MF=OPLOG3HL, HBB5520,  930923,  PDHL:  OPERLOG Support          */ 00221600
*/* $PQ=PN70364,  HBB5520,  940410,  PDHD:  Overlay of SCB           */ 00221700
*/* $PR=PN70758,  HBB5520,  940715,  PDHD:  Split out CQE, CXSA,     */ 00221800
*/*                                         DOMPL, and FTPT          */ 00221900
*/* $PQ=PN71752,  HBB5520,  941117,  PDZH:  Add external             */ 00222000
*/*                                         classification           */ 00222100
*/* $05=OW01928,  HBB4420,  940712,  PDEV:  Support cleanup only     */ 00222200
*/*                                         indicator (fix is in     */ 00222300
*/*                                         macro IEZVR001)          */ 00222400
*/* $06=OW02264,  HBB4420,  940603,  PDED:  Message dataspace        */ 00222500
*/*                                         serialization (fix is in */ 00222600
*/*                                         macro IEZVR001)          */ 00222700
*/* $07=OW07698,  HBB5510,  941102,  PDMF:  Removal of Abend D23 for */ 00222800
*/*                                         MLWTO>1000 lines when    */ 00222900
*/*                                         WQE shortage exists.     */ 00223000
*/* $08=OW07896,  HBB5510,  941031,  PDSH:  Avoid out of storage     */ 00223100
*/*                                         abends                   */ 00223200
*/* $09=OW07896,  HBB5510,  941031,  PDHD:  WTO Flooding             */ 00223300
*/* $0A=OW13951,  HBB4430,  950815,  PDHD:  Issue IEA653I in HBB4430 */ 00223400
*/*                                  No code change in this release. */ 00223500
*/* $0B=OW18292,  HBB5510,  960215,  PDHD:  Year 2000 support.       */ 00223600
*/* $0C=OW18874,  HBB5510,  960315,  PDHD:  Add QNLY bit to XV       */ 00223700
*/* $PS=PQC0241,  HBB6603,  960815,  PDHD:  Add modid for IEAVBLWT   */ 00223800
*/*                                         and fix WPX mapping      */ 00223900
*/* $PT=PQC1061,  HBB6603,  960815,  PDHD:  WPX is expanded          */ 00224000
*/* $PU=PQC2456,  HBB6603,  960916,  PDCI:  Change length of WPX     */ 00224100
*/*                                         mapping                  */ 00224200
*/* $0D=OW20270,  HBB5510,  960630,  PDHD:  Add DM0PR220 bit to DM0  */ 00224300
*/* $0E=OW11390,  HBB5510,  961104,  PDED:  Add MSTR keyword to D C  */ 00224400
*/* $MG=CNSRV,    HBB6606,  971215,  PDHD:  New keywords in D C      */ 00224500
*/* $PV=PWA0023,  JBB6607,  980626,  PDTA:  1 byte console id in XV  */ 00224600
*/*                                         FIN of OW30971           */ 00224700
*/* $0F=OW44541,  HBB6601,  000801,  PD2U:  System lockout on        */ 00224730
*/*                                         SYSZMCS.MPFTABLE         */ 00224760
*/* $0G=OW45398,  HBB7703,  010330,  PDHD:  Command Flooding Rollback*/ 00224780
*/********************************************************************/ 00224800
*     %GOTO CTMMAC;  %/*                                                00224900
         MACRO                                                          00225000
         IHACTM  &MAP                                                   00225100
         AIF   ('&MAP' EQ 'XV').IHAXV        SVC 35 EXTENDED SAVE AREA  00225200
         AIF   ('&MAP' EQ 'CXSA').IHACXSA    SVC 72 EXTENDED SAVE AREA  00225300
         AIF   ('&MAP' EQ 'CQE').IHACQE      CONSOLE QUEUE ELEMENT      00225400
         AIF   ('&MAP' EQ 'DPL').IHADPL      DOM PARM LIST              00225500
         AIF   ('&MAP' EQ 'WWB').IHAWWB      WTO WAIT BLOCK MAP         00225600
         AIF   ('&MAP' EQ 'QR0').IHAQR0      IEAVMQR0 PARMLIST          00225700
         AIF   ('&MAP' EQ 'FTPT').IHAFTPT    FRR USERS PARM LIST MAP    00225800
         AIF   ('&MAP' EQ 'CQB').IHACQB      CMD QUEUE BUFFER  @G741PSS 00225900
         AIF   ('&MAP' EQ 'AMRQ').IHAAMRQ    ACTION MSG RET Q  @G741PSS 00226000
         AIF   ('&MAP' EQ 'UXIR').IHAUXIR    USER EXIT INTERFACE   @L6A 00226100
         AIF   ('&MAP' EQ 'CMDELEM').IHACMDE CONSOLE CMD Q ELEM    @LCA 00226200
         AIF   ('&MAP' EQ 'VRBMP').IEE3003 VERB TABLE              @LDA 00226300
         AIF   ('&MAP' EQ 'DOM0').IHADOM0    DOM REG 0 MAPPING     @LUA 00226400
         MNOTE *,'IMPROPER OPERAND'                                     00226500
         MEXIT                                                          00226600
.IHAXV   ANOP                                                           00226700
*********************************************************************** 00226800
*                                                                     * 00226900
*       XVSAV - EXTENDED SAVEAREA MAPPING FOR SVC35           @G860PSS* 00227000
*                                                                     * 00227100
* *01* PROPRIETARY STATEMENT=                                         * 00227200
*  **PROPRIETARY_STATEMENT********************************************* 00227300
*                                                                     * 00227400
*                                                                     * 00227500
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00227600
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00227700
*   5647-A01 (C) COPYRIGHT IBM CORP. 1979, 1999                       * 00227800
*                                                                     * 00227900
*   STATUS= JBB6607                                                   * 00228000
*                                                                     * 00228100
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00228200
*                                                                     * 00228300
*        METHOD OF ACCESS                                         @L2A* 00228400
*          BAL  - CODE THE FOLLOWING:  IHACTM XV              @G860PSS* 00228500
*          PL/S - 1. DECLARE MACRO CHARACTER VARIABLE CTMXV       @L2A* 00228600
*                 2. SET CTMXV EQUAL TO 'YES'                     @L2A* 00228700
*                 3. DCL XVPTR                                    @L2A* 00228800
*                 4. %INCLUDE SYSLIB(IHACTM)                      @L2A* 00228900
*                                                                 @L2A* 00229000
*        FUNCTION                                                 @L2A* 00229100
*          THE XV IS USED AS AN SVC 35 (WTO) WORK AREA.           @L9A* 00229200
*                                                                 @L9A* 00229300
*        CREATED BY                                               @L9A* 00229400
*          IEAVM600                                               @L9A* 00229500
*                                                                 @L9A* 00229600
*        POINTED TO BY                                            @L9A* 00229700
*          N/A                                                    @L9A* 00229800
*                                                                 @L9A* 00229900
*        SERIALIZATION                                            @L9A* 00230000
*          NONE                                                   @L9A* 00230100
*                                                                 @L9A* 00230200
*        LOCATION                                                 @L9A* 00230300
*          THE STORAGE FOR THE XV IS OBTAINED FROM IEAVM600'S     @L9A* 00230400
*          DYNAMIC AREA, KEY 0 FROM SUBPOOL 229.                  @L9A* 00230500
*                                                                     * 00230600
*********************************************************************** 00230700
         SPACE                                                          00230800
XVSAV    DSECT                                                          00230900
XVACRN   DS    CL3           CONTROL BLOCK ACRONYM 'XV '           @L9A 00231000
XVVRSN   DS    AL1           VERSION LEVEL                         @L9A 00231100
XVS220   EQU   1             LEVEL OS/VS2 JBB2220                  @L9A 00231200
XVS410   EQU   2             LEVEL OS/VS2 HBB4410                  @LFA 00231300
XVS422   EQU   3             LEVEL OS/VS2 JBB4422                  @M2A 00231400
XVVERN   EQU   XVS422        CURRENT VERSION LEVEL                 @M2C 00231500
XVA4     DS    0F            REGISTER AND D23 SAVEAREA         @ZA41986 00231600
*******************************************************************@L9A 00231700
*     D23 PROCESS CODES                                            @L9A 00231800
*******************************************************************@L9A 00231900
XVFNCT   DS    C             D23 PROCESS CODE                  @ZA41986 00232000
D23VALID EQU   X'10'         PARMLIST VALIDITY CHECK ERROR     @ZA41986 00232100
D23OREGC EQU   X'20'         ORE GETCELL FAILURE               @ZA41986 00232200
D23OREBC EQU   X'21'         ORE BLDCPOOL FAILURE              @ZA41986 00232300
D23OREGM EQU   X'22'         ORE GETMAIN FAILURE, SP231        @ZA41986 00232400
D23WQEGC EQU   X'30'         WQE GETCELL FAILURE               @ZA41986 00232500
D23WQEBC EQU   X'31'         WQE BLDCPOOL FAILURE              @ZA41986 00232600
D23WQEGM EQU   X'32'         WQE GETMAIN FAILURE, SP231        @ZA41986 00232700
*                                                                  @07D 00232800
D23DYN   EQU   X'42'         DYNAMIC AREA GETMAIN FAILURE      @ZA41986 00232900
D23LWAIT EQU   X'50'         FAILURE IN LOADWAIT                   @LUA 00233000
D23BESTR EQU   X'51'         FAILURE IN OBTAINING BRANCH ENTRY         +00233100
                             DYNAMIC STORAGE                       @LUA 00233200
D23VG715 EQU   X'52'         FAILURE IN IEAVG715                   @LUA 00233300
D23VG720 EQU   X'53'         FAILURE IN IEAVG720                   @LUA 00233400
D23INTER EQU   X'99'         INTERNAL FAILURE IN IEAVVWTO OR IEAVMWTO  X00233500
                                                                   @01A 00233600
*******************************************************************@L9A 00233700
*     MODULE ID DETECTING ABEND CONDITION                          @L9A 00233800
*******************************************************************@L9A 00233900
XVAMOD   DS    C             D23 MODULE ID                     @ZA41986 00234000
VWTOID   EQU   X'01'         IEAVVWTO'S ID FOR D23             @ZA41986 00234100
MWTOID   EQU   X'02'         IEAVMWTO'S ID FOR D23             @ZA41986 00234200
VH600ID  EQU   X'03'         IEAVH600'S ID FOR D23                 @L2A 00234300
VM600ID  EQU   X'04'         IEAVM600'S ID FOR D23                 @L9A 00234400
VBTOID   EQU   X'05'         IEAVBWTO'S ID FOR D23                 @LUA 00234500
D23BLDWI EQU   X'06'         BLWLDWT'S ID FOR D23                  @DBA 00234600
VBNLKID  EQU   X'07'         IEAVBNLK'S ID FOR D23                 @03A 00234700
VBLWTID  EQU   X'08'         IEAVBLWT'S ID FOR D23                 @PSA 00234800
*********************************************************************** 00234900
*     ABEND CODE WHEN THE PROCESS CODE IS D23INTER                 @01A 00235000
*     THIS FIELD MAPS OVER THE RESERVED FIELD AND XVREASON         @01A 00235100
*********************************************************************** 00235200
XVAABCD  DS    0XL2          ABEND CODE THAT CAUSED IEAVVWTO OR        X00235300
                             IEAVMWTO TO FAIL                      @01A 00235400
         DS    C             RESERVED                              @L9C 00235500
*******************************************************************@L9A 00235600
*     D23 REASON CODE                                              @L9A 00235700
*******************************************************************@L9A 00235800
XVREASON DS    C             D23 REASON CODE                   @ZA41986 00235900
D23BNDY  EQU   X'01'         WTOR PARMLIST NOT ON FULLWRD BNDY @ZA41986 00236000
D23MLWTR EQU   X'02'         MULTILINE WTOR                    @ZA41986 00236100
D23PARM  EQU   X'03'         PARMLIST NOT ADDRESSABLE BY USER  @ZA41986 00236200
D23ZERO  EQU   X'04'         ZERO TEXT LENGTH WTOR             @ZA41986 00236300
D23SIZE  EQU   X'05'         CALLER MODIFIED WPL                       X00236400
                             DURING WTO PROCESSING             @ZA37220 00236500
D23AUTH  EQU   X'06'         UNAUTHORIZED USER SPECIFIED               X00236600
                             AUTHORIZED KEYWORD(S)                 @L9A 00236700
D23MUTX  EQU   X'07'         MUTUALLY EXCLUSIVE KEYWORDS SPECIFIED     X00236800
                             ON WTO(R) INVOCATION                  @L9A 00236900
D23BADP  EQU   X'08'         ISSUER USED INVALID PARM LIST             X00237000
                             STRUCTURE                             @L9A 00237100
D23TXT0  EQU   X'09'         ZERO TEXT ADDRESS ON WTOR             @LHA 00237200
D23STEXT EQU   X'0A'         MORE THAN 14 LINES OF TEXT; SYNCH=YES @LUA 00237300
D23WQEBK EQU   X'0B'         WQE SPECIFIED WITH SYNCH=YES OR ON        +00237400
                             NIP SVC 35                            @LUA 00237500
D23SWTOR EQU   X'0C'         WTOR ISSUED WITH SYNCH=NO             @LUA 00237600
D23NWTOR EQU   X'0D'         SVC 35 WTOR WITH MORE THAN 1 LINE     @LUA 00237700
D23DNHRR EQU   X'0E'         DO NOT HOLD RESTART RESOURCE THIS CPU @DBA 00237800
D23ACSNA EQU   X'0F'         ACTION CODE STORAGE NOT ACCESSABLE    @DBA 00237900
D23BADV  EQU   X'10'         BAD VALUE IN WQE FOR WQEBLK       @YA32858 00238000
D23BADCN EQU   X'11'         CONSOLE NAME IS RESERVED OR INCORRECT @PKA 00238100
XVA0     DS    F             WORK AREA FOR SUBROUTINES                 *00238200
                             BYTE 1    - NUMBER OF WQES                *00238300
                             BYTE 2-4  - WPL PARM LENGTH           @L2C 00238400
XVTIME   DS    F             TIME STORED BY IEAVM600               @L9C 00238500
XVMSGLGH DS    H             MESSAGE LENGTH FROM CALLER'S WPL           00238600
XVCHAR1  DS    CL1           1ST CHARACTER OF TEXT                 @P7A 00238700
XVMISC2  DS    CL1           Miscellaneous flags                   @01C 00238800
XVGETENQ EQU   X'80'         INDICATE TO IEAVM604 TO OBTAIN MPF/GENX   X00238900
                             TABLE ENQ                             @POC 00239000
XVFREENQ EQU   X'40'         INDICATE TO IEAVM604 TO RELEASE MPF/GENX  X00239100
                             TABLE ENQ                             @POC 00239200
XVHADENQ EQU   X'20'         INDICATE CALLER HAD OBTAINED THE MPF/GENX X00239230
                             TABLE RESOURCE                        @0FA 00239260
XVPARMAD DS    A             ADDR OF WPL PASSED BY THE USER        @L9C 00239300
XVWQEAD  DS    A             ADDR OF WQE BUILT BY SVC 35           @L9C 00239400
XVCMAJOR DS    A             ADDR OF MAJOR WQE                     @L9C 00239500
XVCMINOR DS    A             ADDR OF MINOR WQE                     @L9C 00239600
XVTSRPTR DS    A             ADDRESS OF TEXT SERVICE PARAMETER         X00239700
                             LIST                                  @LHA 00239800
XVTXTPTR DS    A             ADDRESS OF WORKAREA CONTAINING WTO TEXT   X00239900
                             WHEN TEXT PARAMETER USED ON WTO       @PCA 00240000
XVINTPTR DS    A             INTERMEDIATE WORK POINTER FOR MLWTO'S @PCA 00240100
*******************************************************************@L9A 00240200
*     XV FLAGS                                                     @L9A 00240300
*******************************************************************@L9A 00240400
XVDFLAGS DS    0CL4          FLAGS WORD                            @L9C 00240500
XVD0     DS    XL1           FLAG BYTE                             @L9A 00240600
XVD0S250 EQU   X'80'         IF ON, USER'S EXIT PARM IN SUBPOOL 250    X00240700
                             IF OFF, IT IS IN SUBPOOL 229          @L9A 00240800
XVD0RPFD EQU   X'40'         REPLY ID AVAIL & PUT IN ORE           @L9A 00240900
XVD0NWQE EQU   X'20'         NEED A WQE                            @L9A 00241000
XVD0NORE EQU   X'10'         NEED AN ORE                           @L9A 00241100
XVD0QID  EQU   X'08'         QID IS PRESENT IN THE WPL                  00241200
XVD0WWB  EQU   X'04'         A WWB HAS BEEN OBTAINED               @L9A 00241300
XVD0USER EQU   X'02'         RETURN TO USER IF SET ON BY THE WTP       X00241400
                             ROUTINE                               @L9C 00241500
XVD0HDCY EQU   X'01'         THIS MESSAGE IS A WTP TO BE SENT TO       X00241600
                             HARDCOPY ONLY                         @L9A 00241700
XVD1     DS    C             FLAG BYTE - WTO/WTOR/MLWTO                 00241800
XVD1PRIV EQU   X'80'         PRIVILEGED TASK                            00241900
XVD1ENQW EQU   X'40'         ENQ'D ON A WQE                             00242000
XVD1ENQO EQU   X'20'         ENQ'D ON AN ORE                            00242100
XVD1OEXT EQU   X'10'         ORE EXISTS FOR THIS WQE                    00242200
XVD1BWTP EQU   X'08'         BACK FROM WTP                              00242300
XVD1PP   EQU   X'04'         PROBLEM PROGRAM CALLER                     00242400
XVD1AUTH EQU   X'02'         KEY 0, SUPVR STATE OR APF AUTHORIZED       00242500
XVD1PERR EQU   X'01'         SEVERE ERROR FOUND. ABEND USER.            00242600
XVD2     DS    C             RESERVED FOR MLWTO                         00242700
XVD2CON  EQU   X'80'         CONNECTING                                 00242800
XVD2RDC  EQU   X'40'         ROUT/DESC CODES EXIST                      00242900
XVD2MSGT EQU   X'20'         MSG TYPE FIELD EXISTS                      00243000
XVD2VALD EQU   X'10'         PARAMETER LIST IS VALID                    00243100
XVD2DELW EQU   X'08'         DELETE THIS WTO REQUEST                    00243200
XVD2ZERO EQU   X'04'         RETURN A MESSAGE ID OF ZERO TO THE USER    00243300
XVD2WTOR EQU   X'02'         THIS WPL IS FOR A WTOR.                    00243400
XVD2QFHC EQU   X'01'         QUEUE THIS MESSAGE TO HARD COPY.           00243500
XVD3     DS    C             MLWTO FLAGS                                00243600
XVD3BLDJ EQU   X'80'         BUILD MAJOR WQE                            00243700
XVD3BLD1 EQU   X'40'         BUILD LINE 1                               00243800
XVD3BLD2 EQU   X'20'         BUILD LINE 2                               00243900
XVD3TXT1 EQU   X'10'         TEXT LINE 1 BEING USED                     00244000
XVD3TFX  EQU   X'08'         THE TCBTFX BIT WAS SET ON, TURN IT OFF     00244100
XVD3ENQY EQU   X'04'         THE ENQ WAS OBTAINED BY THIS SVC35    @01A 00244200
XVD3XITR EQU   X'02'         IEECVXIT CHANGED ROUT CODES       @ZA88861 00244300
XVD3XITD EQU   X'01'         IEECVXIT CHANGED DESC CODES       @ZA88861 00244400
XVOREAD  DS    A             ADDR OF THE ORE                       @L9A 00244500
*******************************************************************@L9A 00244600
*     LINE CONTROL FLAGS                                           @L9A 00244700
*******************************************************************@L9A 00244800
XVX0     DS    C             LINE CONTROL FLAGS--MLWTO                  00244900
XVX0FLCL EQU   X'80'         FIRST LINE IS CONTROL LINE                 00245000
XVX0UDCL EQU   X'10'         USE DEFAULT CONTROL LINE                   00245100
XVX0FLJE EQU   X'08'         FIRST LINE JUST 'E'                        00245200
XVX0FEDE EQU   X'04'         FORCE END (LAST LINE TO BE DE)             00245300
*******************************************************************@L9A 00245400
*     MLWTO ERROR FLAGS                                            @L9A 00245500
*******************************************************************@L9A 00245600
XVX1     DS    C             ERROR FLAGS--MLWTO                         00245700
XVX1STOP EQU   X'80'         ERROR IN PARM LIST.  IGNORE MLWTO          00245800
XVX1NOID EQU   X'40'         NO ID FOR CONNECTING MLWTO                 00245900
XVX2     DS    C             NUMBER OF LINES STILL TO DO                00246000
XVMISC   DS    C             MISCELLANEOUS FLAGS                   @P5A 00246100
XVJBIDSP EQU   X'80'         JOBID WAS SPECIFIED ON WTO/WTOR       @P5A 00246200
XVJBNMSP EQU   X'40'         JOBNAME WAS SPECIFIED ON WTO/WTOR     @P5A 00246300
XVSYIDSP EQU   X'20'         SYSTEM ID WAS SPECIFIED ON WTO/WTOR   @P5A 00246400
XVSYNMSP EQU   X'10'         SYSTEM NAME WAS SPECIFIED ON WTO/WTOR @P5A 00246500
XVAUTO   EQU   X'08'         RECEIVE AUTOMATABLE MESSAGES          @M2C 00246600
XVRSV1   EQU   X'04'         RESERVED                              @PSC 00246700
XVLOCKS  EQU   X'02'         HOLDING LOCAL & CMS LOCKS             @LNA 00246800
XVENQ    EQU   X'01'         ENQ HAS BEEN DONE ON WTOR RESOURCE    @LNA 00246900
XVWWB    DS    A             ADDR OF WRITE WAIT BLOCK              @L9C 00247000
XVWQEID  DS    0F            REG0 ON INPUT TO SVC 35               @L9C 00247100
XVWQEIDA DS    CL3           CONNECT ID                            @L9C 00247200
XVCONID  DS    CL1           1 BYTE CONSOLE ID PASSED BY USER      @L9C 00247300
XVRETCOD DS    C             RETURN CODE                           @L9M 00247400
XVSDATE  DS    FL3           DATE STORED BY IEAVM600               @L9M 00247500
XVNUMWTO DS    XL1           REAL NUMBER OF LINES IN MLWTO         @L9A 00247600
XVDIAGFL DS    CL1           DIAGNOSTIC FLAGS                  @YA24954 00247700
XVIEA099 EQU   X'80'         ISSUE MESSAGE IEA099A             @YA24954 00247800
XV099DOM EQU   X'40'         DOM MESSAGE IEA099A               @YA24954 00247900
XVIEA653 EQU   X'20'         ISSUE MESSAGE IEA653I                 @09A 00248000
XVRSV2   EQU   X'10'         RESERVED                              @PSC 00248100
XVQDSYS  DS    B             WQE destinations counter              @PNA 00248200
XVCID    DS    CL1           1 BYTE CONSOLE ID FROM CONVCON        @PVC 00248300
XVEPRMAD DS    A             ADDRESS OF ESTAE PARM LIST            @L9A 00248400
XVLTYP   DS    BL2           LINE TYPE FLAGS                       @L9A 00248500
XVRPYID  DS    XL2           REPLY ID                              @L9A 00248600
XVJSTCB  DS    A             WTO ISSUER'S JSTCB (FOR DOM)          @L9A 00248700
XVTCB    DS    A             WTO ISSUER'S TCB (FOR DOM)            @L9A 00248800
XVTEXT   DS    A             POINTER TO MESSAGE TEXT               @L9A 00248900
XVASID   DS    XL2           ASID OF ISSUER (FOR DOM)              @L9A 00249000
XVSCENT  DS    CL2           Century portion of date               @0BC 00249100
XVRFLGS  DS    BL4           WTO USER EXIT REQUEST FLAGS           @L9A 00249200
XVWQETYP DS    C             WQE TYPE FLAGS                        @L9A 00249300
XVMAJWQE EQU   X'80'         MAJOR WQE PASSED VIA WQEBLK           @L9A 00249400
XVMINWQE EQU   X'40'         MINOR WQE PASSED VIA WQEBLK           @L9A 00249500
XVRETAIN EQU   X'20'         AMRF RETENTION BIT COPIED FROM THE        X00249600
                             ORIGINAL WQE                          @L9A 00249700
XVREISSU EQU   X'10'         MESSAGE IS A REISSUED WTO (EITHER DOMID   X00249800
                             OR WQEBLK WAS SPECIFIED)              @L9A 00249900
XVAREA   DS    CL1           AREA ID                               @L9A 00250000
*******************************************************************@L9A 00250100
*        MCS FLAGS                                                 @L9A 00250200
*******************************************************************@L9A 00250300
XVMCSF   DS    0BL2           MCS FLAGS                            @L9A 00250400
XVMCSF1  DS    B              FIRST BYTE OF MCS FLAGS              @L9A 00250500
XVMCSFA  EQU   BIT0           ROUTE/DESCRIPTOR CODE FIELDS PRESENT @L9A 00250600
XVMCSFB  EQU   BIT1           QUEUE TO CONSOLE IF ACTIVE (ID IN REG 0) X00250700
                                                                   @L9A 00250800
XVMCSFC  EQU   BIT2           COMMAND RESPONSE                     @L9A 00250900
XVMCSFD  EQU   BIT3           MESSAGE TYPE FIELD EXISTS            @L9A 00251000
XVMCSFE  EQU   BIT4           THIS WPL IS A REPLY TO A WTOR        @L9A 00251100
XVMCSFF  EQU   BIT5           BROADCAST THIS MSG TO ALL ACTIVE         X00251200
                              CONSOLES                             @L9A 00251300
XVMCSFG  EQU   BIT6           QUEUE TO HARD COPY ONLY              @L9A 00251400
XVMCSFH  EQU   BIT7           QUEUE TO CONSOLE (ID IN  REG0)       @PIC 00251500
XVMCSF2  DS    B              SECOND BYTE OF MCS FLAGS             @L9A 00251600
XVMCSFI  EQU   BIT0           DO NOT TIME STAMP THIS MESSAGE       @L9A 00251700
XVMCSFJ  EQU   BIT1           MLWTO INDICATOR                      @L9A 00251800
XVMCSFK  EQU   BIT2           PRIMARY SUBSYSTEM USE ONLY               X00251900
                              JES3: DO NOT LOG MINOR WQE'S IF THE      X00252000
                                    MAJOR IS NOT HARDCOPIED.           X00252100
                              JES2: NOT USED                       @L9A 00252200
XVMCSFL  EQU   BIT3           EXTENDED WPL FORMAT (WPX) EXISTS     @L9A 00252300
XVMCSFM  EQU   BIT4           THE MESSAGE IS AN OPERATOR COMMAND   @L9A 00252400
XVMCSFN  EQU   BIT5           BYPASS QUEUING MESSAGE TO HARD COPY  @L9A 00252500
XVMCSFO  EQU   BIT6           WQEBLK KEYWORD SPECIFIED             @L9A 00252600
*        EQU   BIT7           RESERVED                             @L9A 00252700
XVMLEXTP DS    A              ADDRESS OF MULTILINE EXTENSION       @L9A 00252800
XVEXIF   DS    0CL2           MISC AND MINOR ERROR INFORMATION         X00252900
                              FLAGS                                @LHA 00253000
XVEXIF1  DS    B              MISC AND MINOR ERROR FLAG BYTE 1     @LHA 00253100
XVETXTR  EQU   BIT0           MESSAGE TEXT WAS TRUNCATED           @LHA 00253200
XVEXNVT  EQU   BIT1           INVALID USER EXIT MODIFICATION       @LHA 00253300
XVEXMER  EQU   BIT2           MUTUALLY EXCLUSIVE USER EXIT             X00253400
                              REQUESTS MADE                        @LHA 00253500
XVEXIRM  EQU   BIT3           INCOMPATIBLE USER EXIT REQUESTS MADE @LHA 00253600
XVEREV   EQU   BIT4           RESERVED                             @DCC 00253700
XVUCINCR EQU   X'04'          MPF TABLE OR GENX TABLE USE COUNT        X00253800
                              INCREMENTED & NOT DECREMENTED        @LNA 00253900
XVMPFUXT EQU   X'02'          A WTO USER EXIT SPECIFIED BY AN MPF      X00254000
                              TABLE ENTRY WAS CALLED               @LNA 00254100
XVEXWTP  EQU   X'01'          IEEJB840 CALLED                      @LPA 00254200
XVEXIF2  DS    B              RESERVED                             @LHA 00254300
XVQONLY  EQU   X'80'          REISSUED WQE TO BE QUEUED ONLY       @P8A 00254400
XVAMRFO  EQU   X'40'          WQE FOR AMRF PURPOSES ONLY           @DAA 00254500
XVAMRFA  EQU   X'20'          AMRF ACTIVE ON ISSUING SYSTEM        @DAA 00254600
XVQD     EQU   X'10'          WQE FINISHED QUEUEING                @DAA 00254700
XVWTPR   EQU   X'08'          WTP REQUEST                          @PHA 00254800
XVMFR    EQU   X'04'          WQE MODIFIED FOR RE-QUEUEING         @PLA 00254900
XVAMRFR  EQU   X'02'          WQE FOR AMRF REFRESH                 @PLA 00255000
XVSAUT   EQU   X'01'          AUTOMATION SPECIFIED FOR THIS MESSAGE    X00255100
                                                                   @M2A 00255200
         DS    CL2            RESERVED                             @LNC 00255300
XVMPFTP  DS    A              ADDRESS OF MPF TABLE                 @LNA 00255400
XVMPFTEP DS    A              ADDRESS OF MPF TABLE ENTRY MATCHING      X00255500
                              CURRENT MESSAGE ID                   @LNA 00255600
XVGENXTP DS    A              ADDRESS OF WTO GENERAL USER              X00255700
                              EXIT TABLE                           @LNA 00255800
*******************************************************************@L9A 00255900
*                                                                  @L9A 00256000
*     START OF WPX COPY                                            @L9A 00256100
*                                                                  @L9A 00256200
*******************************************************************@L9A 00256300
XVWPX    DS    0CL124        START OF WPX COPY                     @PUC 00256400
XVWPXVRS DS    AL1           VERSION LEVEL OF WPX                  @L9A 00256500
*******************************************************************@L9A 00256600
*     MPF/SUBSMOD FLAGS                                            @L9A 00256700
*******************************************************************@L9A 00256800
XVFLG2   DS    C             MPF/SUBSMOD FLAGS                     @L9A 00256900
XVMPFSP  EQU   X'80'         MESSAGE IS TO BE SUPPRESSED DUE TO MPF    X00257000
                                                                   @L9A 00257100
XVMPFPR  EQU   X'40'         MESSAGE WAS PROCESSED BY MPF AND IS NOT   X00257200
                             TO BE SUPPRESSED                      @L9A 00257300
XVNMOD   EQU   X'20'         THE CHARACTERISTICS OF THE MESSAGE MAY    X00257400
                             NOT BE MODIFIED BY THE PRIMARY            X00257500
                             SUBSYSTEM                             @L9A 00257600
XVRPYLN  DS    AL1           LENGTH OF REPLY BUFFER                @L9A 00257700
XVWPXLN  DS    AL1           LENGTH OF WPX                         @LHC 00257800
*******************************************************************@L9A 00257900
*     EXTENDED MCS FLAGS                                           @L9A 00258000
*    CHANGES IN THE EXTENDED MSC FLAGS WILL ALSO IMPACT THE        @D6A 00258100
*    EXTENDED MCS FLAGS IN IHAWQE AND IEZWPL                       @D6A 00258200
*******************************************************************@L9A 00258300
XVEMCSFL DS    0BL2          EXTENDED MCS FLAGS                    @L9A 00258400
XVEMCSF1 DS    B             1ST BYTE OF EXTENDED MCS FLAGS        @L9A 00258500
XVEMBUSY EQU   X'80'         RETURN WITH BUSY RETURN CODE IF BUFFER    X00258600
                             LIMITS EXCEEDED                       @L9A 00258700
XVEMCONS EQU   X'40'         FOUR BYTE CONSOLE ID WAS SPECIFIED    @L9A 00258800
XVEMDOMI EQU   X'20'         DOM ID WAS SPECIFIED                  @L9A 00258900
XVEMCONN EQU   X'10'         CONNECT ID WAS SPECIFIED              @L9A 00259000
XVEMWTOR EQU   X'08'         WTOR WITH EXTENDED PARAMETER LIST     @L9A 00259100
XVEMPRIO EQU   X'04'         PRIORITY WAS SPECIFIED                @L9A 00259200
XVEMCNM  EQU   X'02'         CONSOLE NAME SPECIFIED                @LFA 00259300
XVEMCSF2 DS    B             2ND BYTE OF EXTENDED MCS FLAGS        @L9A 00259400
XVETXTAD EQU   X'80'         TEXT ADDRESS WAS SPECIFIED            @LHA 00259500
XVERSV1A EQU   X'40'         RESERVED                              @D6A 00259600
XVERSV2  EQU   X'20'         RESERVED                              @DCC 00259700
XVERSV1  EQU   X'10'         RESERVED                              @DCC 00259800
XVERSV1B EQU   X'08'         RESERVED                              @D7C 00259900
XVESYNC  EQU   X'04'         PROCESS SYNCHRONOUS WITH RESPECT TO THE   +00260000
                             CALLER                                @LUA 00260100
XVCPFLG  DS    0BL2          CONTROL PROGRAM ONLY FLAGS            @PSA 00260200
XVCPFL1  DS    B             CONTROL PROGRAM USE BYTE 1            @PSA 00260300
XVRROK   EQU   BIT0          RESTART RESOURCE IS NOT TO BE OBTAINED    X00260400
                                                                   @PSA 00260500
XVNOHO   EQU   BIT1          DON'T HOLD THE MESSAGE FOR TEN SECONDS    X00260600
                                                                   @PSA 00260700
XVNLCK   EQU   BIT2          DO NOT ATTEMPT TO OBTAIN ANY LOCKS    @PSA 00260800
XVACLW   EQU   BIT3          USE ALTERNATE CPU LOADWAIT PATH       @PSA 00260900
XVSPVD   EQU   BIT4          SUPER PRIVILEGED                      @PSA 00261000
XVQNLY   EQU   BIT5          MESSAGE GOES ONLY TO CONSOLE          @PSA 00261100
XVCPFL2  DS    B             CONTROL PROGRAM USE BYTE 2            @PSA 00261200
XVRPBUF  DS    AL4           REPLY BUFFER ADDRESS                  @L9A 00261300
XVECBP   DS    AL4           REPLY ECB ADDRESS                     @L9A 00261400
XVSEQN   DS    0F            DOM ID                                @L9A 00261500
XVSYSID  DS    AL1           SYSTEM ID                             @L9A 00261600
XVSQID   DS    AL3           SEQUENCE NUMBER                       @L9A 00261700
XVRDMSV  DS    0CL22         SAVE AREA FOR DESC CODES, ROUTING CODES   X00261800
                             AND MSGTYPE FIELDS                    @L9A 00261900
*******************************************************************@L9A 00262000
*     DESCRIPTOR CODES                                             @L9A 00262100
*******************************************************************@L9A 00262200
XVDESCD  DS    0BL2          DESCRIPTOR CODES                      @L9A 00262300
XVDCBYT1 DS    B             DESCRIPTOR CODES(1 THRU 8)            @L9A 00262400
XVDC1    EQU   X'80'         DESCRIPTOR CODE 1                     @L9A 00262500
XVDC2    EQU   X'40'         DESCRIPTOR CODE 2                     @L9A 00262600
XVDC3    EQU   X'20'         DESCRIPTOR CODE 3                     @L9A 00262700
XVDC4    EQU   X'10'         DESCRIPTOR CODE 4                     @L9A 00262800
XVDC5    EQU   X'08'         DESCRIPTOR CODE 5                     @L9A 00262900
XVDC6    EQU   X'04'         DESCRIPTOR CODE 6                     @L9A 00263000
XVDC7    EQU   X'02'         DESCRIPTOR CODE 7                     @L9A 00263100
XVDC8    EQU   X'01'         DESCRIPTOR CODE 8                     @L9A 00263200
XVDCBYT2 DS    B             DESCRIPTOR CODES(9 THRU 16)           @L9A 00263300
XVDC9    EQU   X'80'         DESCRIPTOR CODE 9                     @L9A 00263400
XVDC10   EQU   X'40'         DESCRIPTOR CODE 10                    @L9A 00263500
XVDC11   EQU   X'20'         DESCRIPTOR CODE 11                    @L9A 00263600
XVDC12   EQU   X'10'         DESCRIPTOR CODE 12                    @L9A 00263700
XVDC13   EQU   X'08'         DESCRIPTOR CODE 13                    @L9A 00263800
XVDC14   EQU   X'04'         DESCRIPTOR CODE 14                    @L9A 00263900
XVDC15   EQU   X'02'         DESCRIPTOR CODE 15                    @L9A 00264000
XVDC16   EQU   X'01'         DESCRIPTOR CODE 16                    @L9A 00264100
         DS    AL2           RESERVED                              @L9A 00264200
*******************************************************************@L9A 00264300
*     128 ROUTING CODES                                            @L9A 00264400
*******************************************************************@L9A 00264500
XVRCSAVE DS    0BL16         ROUTING CODES(1 THRU 128)             @L9A 00264600
XVRCBYT1 DS    B             ROUTING CODES(1 THRU 8)               @L9A 00264700
XVRC1    EQU   X'80'         ROUTING CODE 1                        @L9A 00264800
XVRC2    EQU   X'40'         ROUTING CODE 2                        @L9A 00264900
XVRC3    EQU   X'20'         ROUTING CODE 3                        @L9A 00265000
XVRC4    EQU   X'10'         ROUTING CODE 4                        @L9A 00265100
XVRC5    EQU   X'08'         ROUTING CODE 5                        @L9A 00265200
XVRC6    EQU   X'04'         ROUTING CODE 6                        @L9A 00265300
XVRC7    EQU   X'02'         ROUTING CODE 7                        @L9A 00265400
XVRC8    EQU   X'01'         ROUTING CODE 8                        @L9A 00265500
XVRCBYT2 DS    B             ROUTING CODES(9 THRU 16)              @L9A 00265600
XVRC9    EQU   X'80'         ROUTING CODE 9                        @L9A 00265700
XVRC10   EQU   X'40'         ROUTING CODE 10                       @L9A 00265800
XVRC11   EQU   X'20'         ROUTING CODE 11                       @L9A 00265900
XVRC12   EQU   X'10'         ROUTING CODE 12                       @L9A 00266000
XVRC13   EQU   X'08'         ROUTING CODE 13                       @L9A 00266100
XVRC14   EQU   X'04'         ROUTING CODE 14                       @L9A 00266200
XVRC15   EQU   X'02'         ROUTING CODE 15                       @L9A 00266300
XVRC16   EQU   X'01'         ROUTING CODE 16                       @L9A 00266400
         DS    BL14          ROUTING CODES(17 THRU 128)            @L9A 00266500
*******************************************************************@L9A 00266600
*     MESSAGE TYPE FLAGS                                           @L9A 00266700
*******************************************************************@L9A 00266800
XVMSGTYP DS    BL2           MESSAGE TYPE FLAGS                    @L9A 00266900
XVPRTY   DS    AL2           MESSAGE'S PRIORITY                    @L9A 00267000
XVJOBID  DS    CL8           JOB ID                                @L9A 00267100
XVJOBNM  DS    CL8           JOBNAME                               @L9A 00267200
XVKEY    DS    CL8           RETRIEVAL KEY                         @L9A 00267300
XVTOKN   DS    AL4           TOKEN FOR DOM                         @L9A 00267400
XVCNID   DS    0FL4          CONSOLE ID                            @L9A 00267500
XVCNCLS  DS    AL1           CONSOLE QUEUING CLASS                 @D5C 00267600
XVCNRSV  DS    AL1           RESERVED (=0)                         @D3C 00267700
XVCNUM   DS    AL2           CONSOLE NUMBER                        @L9A 00267800
XVSYSNAM DS    CL8           SYSTEM NAME                           @L9A 00267900
XVCNNME  DS    CL8           CONSOLE NAME                          @LFA 00268000
XVCNRA   DS    AL4           REPLY CONSOLE NAME/ID ADDRESS         @LFA 00268100
XVCART   DS    AL4           CART ADDRESS                          @LGC 00268200
XVWSPARM DS    AL4           WAIT STATE PARAMETER LIST ADDRESS     @LUC 00268300
XVASCB   DS    AL4           ASCB ADDRESS                          @PTA 00268400
XVRSV30  DS    CL16          RESERVED                              @PUC 00268500
*******************************************************************@L9A 00268600
*     END OF WPX COPY                                              @L9A 00268700
*******************************************************************@L9A 00268800
*******************************************************************@PSA 00268900
*     WQE FIELDS, COPIED IF WQEBLK SPECIFIED                       @PSA 00269000
*******************************************************************@PSA 00269100
*******************************************************************@PSM 00269200
*     BRANCH ENTRY/NIP FLAG                                        @PSM 00269300
*     CHANGES TO THIS FLAG SHOULD BE CARRIED OVER TO THE           @PSM 00269400
*     WQEBENIP FLAG BYTE IN IHAWQE                                 @PSM 00269500
*******************************************************************@PSM 00269600
XVBENIPF DS    B             BRANCH ENTRY/NIP FLAGS                @PSM 00269700
XVDOMD   EQU   X'80'         MESSAGE HAS ALREADY BEEN DOM'D        @PSM 00269800
XVNBEW   EQU   X'40'         BRANCH-ENTRY OR NIP MESSAGE           @PSM 00269900
XVNHABD  EQU   X'20'         HAS ALREADY BEEN DISPLAYED            @PSM 00270000
XVNASCB  EQU   X'10'         ASCB SPECIFIED                        @PTA 00270100
*******************************************************************@PSM 00270200
*     MISCELLANEOUS ROUTING INFORMATION FROM WQE                   @PSM 00270300
*******************************************************************@PSM 00270400
XVMISCRT DS    AL1           MISCELLANEOUS ROUTING INFORMATION     @PSM 00270500
XVUD     EQU   X'80'         DISPLAY UD MESSAGES                   @PSM 00270600
XVFUDO   EQU   X'40'         DISPLAY ONLY UD MESSAGES              @PSM 00270700
XVFIDO   EQU   X'20'         QUEUE BY ID ONLY                      @PSM 00270800
*******************************************************************@PSA 00270900
XVEMFLAG DS    B             EXTENDED MESSAGE HIGHLIGHTING FLAGS   @PAA 00271000
XVEMCO   EQU   X'80'         COLOR CHANGE REQUEST                  @PAA 00271100
XVEMHI   EQU   X'40'         HIGHLIGHTING CHANGE REQUEST           @PAA 00271200
XVEMIN   EQU   X'20'         INTENSITY CHANGE REQUEST              @PAA 00271300
XVCASEL  DS    CL1           COLOR SPECIFICATION                   @PAA 00271400
XVHASEL  DS    CL1           HIGHLIGHTING SPECIFICATION            @PAA 00271500
XVIASEL  DS    CL1           INTENSITY SPECIFICATION               @PAA 00271600
XVRPYIB  DS    F             BINARY REPLY ID                       @D9C 00271700
XVWTOWAA DS    AL4           IEAVVWTO WORK AREA ADDRESS            @02C 00271800
XV604WAA DS    AL4           IEAVM604 WORK AREA ADDRESS            @D8A 00271900
XV714WAA DS    AL4           IEAVG714 WORK AREA ADDRESS            @D8A 00272000
XVSTCKTM DS    BL4           STCK FORM WQE TIME STAMP              @PJC 00272100
XVFTOD   DS    BL4           AMRF FAILURE TIME                     @PLC 00272200
XVDSQN   DS    F             DISPLAY SEQUENCE NUMBER               @DAA 00272300
XVJESJNM DS    CL8           JOB INFORMATION FOR JES               @PFA 00272400
XVKQLST  DS    0CL8          K Q CONSOLE ID LIST                   @PGA 00272500
XVKQL1   DS    F             K Q CONSOLE ID 1                      @PGA 00272600
XVKQL2   DS    F             K Q CONSOLE ID 2                      @PGA 00272700
XVAUTOT  DS    CL8           AUTOMATION TOKEN                      @M2A 00272800
XVRIDL   DS    AL1           Length of reply ID (determined by     @MDA 00272900
*                            value of UCMRMAX at time reply ID is  @MDA 00273000
*                            obtained).                            @MDA 00273100
         DS    CL7           RESERVED                              @MDC 00273200
XVZERO   EQU   *-XVSAV       LENGTH USED TO ZERO SAVE AREA         @L9C 00273300
        MEXIT                                                           00273400
.IHACXSA ANOP                                                           00273500
         IEZVD002                                                  @PRA 00273600
         MEXIT                                                          00273700
.IHACQE  ANOP                                                           00273800
         IEZVD001                                                  @PRA 00274600
         MEXIT                                                          00276500
.IHADPL  ANOP                                                           00276600
         IEZVM112                                                  @PRA 00280700
         MEXIT                                                          00284900
.IHAWWB  ANOP                                                           00285500
         IHAWWB                                                   @PPA  00286100
         MEXIT                                                          00287200
.IHAQR0  ANOP                                                           00287300
*********************************************************************** 00287400
*                                                                     * 00287500
*      QR0                                                            * 00287600
*                                                                     * 00287700
*      IEAVMQR0 PARAMETER LIST                                        * 00287800
*    OS/VS2 MVS RELEASE 3.8                                           * 00287900
*                                                                     * 00288000
*    METHOD OF ACCESS                                                 * 00288100
*      BAL - CODE THE FOLLOWING:  IHACTM  QR0                         * 00288200
*      PL/S - 1. DECLARE THE MACRO CHARACTER VARIABLE CTMQR0.         * 00288300
*             2. SET CTMQR0 EQUAL TO 'YES'                            * 00288400
*             3. %INCLUDE  SYSLIB(IHACTM)                             * 00288500
*             4. DCL QR0PPTR.                                         * 00288600
*    FUNCTION                                                         * 00288700
*      THE QR0 PARAMETER LIST IS INITIALIZED BY IEAVMWSV              * 00288800
*      AND USED AS INPUT TO IEAVMQR0.                                 * 00288900
*                                                                     * 00289000
*********************************************************************** 00289100
QR0      DSECT                                                          00289200
QR0WQE   DS    0A        ADDRESS OF WQE                                 00289300
QR0WQEB  DS    FL1       UNUSED                                         00289400
QR0WQEA  DS    AL3       ADDRESS OF WQE                                 00289500
QR0UCME  DS    F         ADDRESS OF UCME                                00289600
QR0UCM   DS    F         ADDRESS OF UCM                                 00289700
QR0CMQCN DS    F         ADDRESS OF IEECMQCN                            00289800
         MEXIT                                                          00289900
.IHAFTPT ANOP                                                           00290000
         IEZVR001                                                  @PRC 00294200
         MEXIT                                                          00298500
.IHACQB  ANOP                                                  @G741PSS 00298600
*********************************************************************** 00298700
*                                                             @G741PSS* 00298800
*        CQB  - COMMAND QUEUE BUFFER MAPPING                  @G741PSS* 00298900
*                                                             @G741PSS* 00299000
*   COPYRIGHT   =                                                 @LKC* 00299100
*                 5647-A01                                        @0GC* 00299240
*                 RESTRICTED MATERIALS OF IBM                         * 00299300
*                 (C) COPYRIGHT IBM CORPORATION 1979,2001         @0GC* 00299440
*                 LICENSED MATERIALS - PROPERTY OF IBM                * 00299500
*                                                                     * 00299600
*   STATUS      = HBB7703                                         @0GC* 00299740
*                                                             @G741PSS* 00299800
*        METHOD OF ACCESS                                     @G741PSS* 00299900
*          BAL  - CODE THE FOLLOWING:  IHACTM CQB             @G741PSS* 00300000
*          PL/S - 1. DECLARE MACRO CHARACTER VARIABLE CTMCQB  @G741PSS* 00300100
*                 2. SET CTMCQB EQUAL TO 'YES'                @G741PSS* 00300200
*                 3. %INCLUDE SYSLIB(IHACTM)                  @G741PSS* 00300300
*                 4. DECLARE CQBPTR                           @G741PSS* 00300400
*                                                             @G741PSS* 00300500
*          IF THE COMMAND WAS INVOKED VIA THE MGCRE PARAMETER     @LKA* 00300600
*          LIST, THEN A MAPPING OF THE MGCRE NEEDS TO BE          @LKA* 00300700
*          GENERATED AND SHOULD BE BASED ON THE ADDRESS OF        @LKA* 00300800
*          CQBSVCHD.  THE AMOUNT OF STORAGE TO BE OBTAINED WOULD  @LKA* 00300900
*          BE GETMAINED ACCORDING TO THE FOLLOWING ALGORITHMS:    @LKA* 00301000
*                                                                 @LKA* 00301100
*          BAL -                                                  @LKA* 00301200
*             LENGTH = CQBHSIZE + MGCESZE1 + MGCESZE2             @LKA* 00301300
*                                                                 @LKA* 00301400
*          PL/S OR PLAS -                                         @LKA* 00301500
*             LENGTH = OFFSET(CQBSVCHD) +                         @LKA* 00301600
*                      LENGTH(MGCEPL) +                           @LKA* 00301700
*                      LENGTH(MGCETEXT)                           @LKA* 00301800
*                                                                 @LKA* 00301900
*          OTHERWISE, IF THE COMMAND WAS INVOKED VIA THE OLD      @LKA* 00302000
*          MGCR, THEN THE LENGTH TO GETMAIN WOULD BE JUST THE     @LKA* 00302100
*          LENGTH OF THE CQB.                                     @LKA* 00302200
*                                                                 @LKA* 00302300
*        FUNCTION                                             @G741PSS* 00302400
*          THE COMMAND QUEUE BUFFER IS USED TO CONTAIN A      @G741PSS* 00302500
*          COMMAND FOR THE COMM TASK TO ISSUE. THIS IS        @G741PSS* 00302600
*          NECESSARY IF THE COMMAND MUST EXECUTE UNDER COMM   @G741PSS* 00302700
*          TASK'S TCB BUT THE COMMAND WAS ISSUED UNDER A      @G741PSS* 00302800
*          TCB WHICH IS DIFFERENT FROM COMM TASKS. A MODULE   @G741PSS* 00302900
*          WHICH NEEDS THIS FACILITY CALLS MODULE IEAVC700    @G741PSS* 00303000
*          TO BUILD THE CQB AND CHAIN IT TO THE               @G741PSS* 00303100
*          UCM (UCMCMDPT).                                    @G741PSS* 00303200
*                                                             @G741PSS* 00303300
*********************************************************************** 00303400
         SPACE 1                                               @G741PSS 00303500
CQB      DSECT           MAPS A CQB ENTRY                      @G741PSS 00303600
CQBID    DS    CL4       ACRONYM 'CQB '                        @G741PSS 00303700
CQBLINK  DS    A         ADDRESS OF NEXT ENTRY                 @G741PSS 00303800
CQBSRC   DS    F         CONTENTS OF REGISTER 0 WHEN THE CMD IS        X00303900
                         RE-ISSUED (SOURCE CONSOLE ID)         @G741PSS 00304000
         SPACE 1                                               @G741PSS 00304100
CQBINFLG DS    0H        INTERNAL FLAG FIELDS                  @G741PSS 00304200
CQBINFG1 DS    XL1       FIRST INTERNAL FLAG FIELD             @G741PSS 00304300
CQBISSED EQU   X'80'     COMMAND WAS ISSUED BY COMM TASK       @G741PSS 00304400
CQBMGCRE EQU   X'40'     COMMAND WAS PROCESSED BY MGCRE            @LKA 00304500
CQBINFG2 DS    XL1       SECOND INTERNAL FLAG FIELD - RESERVED @G741PSS 00304600
CQBASID  DS    H         ASID of original command issuer           @0GC 00304720
CQBJBNM  DS    CL8       JOBNAME of original command issuer        @0GA 00304740
CQBHSIZE EQU  *-CQB      LENGTH OF CQB HEADER                      @LKA 00304800
         SPACE 1                                               @G741PSS 00304900
CQBSVCHD DS    0CL4      TEXT HEADER FOR SVC 34                @G741PSS 00305000
*********************************************************************** 00305100
*        THE REMAINING PORTION OF THIS CONTROL BLOCK IS            @LKA 00305200
*        REFERENCED ONLY WHEN THE OLD MGCR PARAMETER LIST WAS      @LKA 00305300
*        USED TO ISSUE THE SVC 34.                                 @LKA 00305400
*                                                                  @LKA 00305500
*        IF THE MGCRE PARAMETER LIST WAS USED TO ISSUE THE SVC 34, @LKA 00305600
*        THEN BASE THE MGCRE PARAMETER LIST ON CQBSVCHD AND        @LKA 00305700
*        PROCEED TO FILL IN THE MGCRE CONTROL BLOCK.               @LKA 00305800
*********************************************************************** 00305900
CQBIND   DS    XL1       INDICATORS                            @G741PSS 00306000
CQBFI    EQU   X'80'     FLAG INDICATOR. IF ON, THE FLAG BYTES ARE     X00306100
                         VALID                                 @G741PSS 00306200
CQBRVB2  EQU   X'40'     RESERVED                              @G741PSS 00306300
CQBRVB3  EQU   X'20'     RESERVED                              @G741PSS 00306400
CQBRVB4  EQU   X'10'     RESERVED                              @G741PSS 00306500
CQBRVB5  EQU   X'08'     RESERVED                              @G741PSS 00306600
CQBRVB6  EQU   X'04'     RESERVED                              @G741PSS 00306700
CQBRVB7  EQU   X'02'     RESERVED                              @G741PSS 00306800
CQBRVB8  EQU   X'01'     RESERVED                              @G741PSS 00306900
CQBLEN   DS    XL1       LENGTH OF TEXT PLUS 4 BYTE HEADER     @G741PSS 00307000
         SPACE 1                                               @G741PSS 00307100
CQBFLGS  DS    0H        COMMAND FLAGS                         @G741PSS 00307200
CQBFLG1  DS    XL1       1ST FLAG BYTE                         @G741PSS 00307300
CQBFLG11 EQU   X'80'     RESERVED                              @G741PSS 00307400
CQBFLG12 EQU   X'40'     COMMAND ISSUED BY SUBSYSTEM           @G741PSS 00307500
CQBFLG13 EQU   X'20'     COMMAND ISSUED VIA IEAVC700           @G741PSS 00307600
CQBFLG14 EQU   X'10'     COMMAND SHOULD NOT BE HARDCOPIED      @G741PSS 00307700
CQBFLG15 EQU   X'08'     INPUT TOKEN                               @L4C 00307800
CQBFLG16 EQU   X'04'     RESERVED                              @G741PSS 00307900
CQBFLG17 EQU   X'02'     RESERVED                              @G741PSS 00308000
CQBFLG18 EQU   X'01'     RESERVED                              @G741PSS 00308100
CQBFLG2  DS    XL1       2ND FLAG BYTE                             @LEC 00308200
CQBFLG19 EQU   X'80'     RESERVED                                  @LEA 00308300
CQBFLG20 EQU   X'40'     RESERVED                                  @LEA 00308400
CQBFLG21 EQU   X'20'     RESERVED                                  @LEA 00308500
CQBFLG22 EQU   X'10'     RESERVED                                  @LEA 00308600
CQBFLG23 EQU   X'08'     CQBUTOK CONTAINS A UTOKEN                 @LEA 00308700
CQBFLG24 EQU   X'04'     RESERVED                                  @LEA 00308800
CQBFLG25 EQU   X'02'     RESERVED                                  @LEA 00308900
CQBFLG26 EQU   X'01'     RESERVED                                  @LEA 00309000
         SPACE 1                                               @G741PSS 00309100
CQBCMD   DS    CL126     COMMAND TEXT                          @G741PSS 00309200
CQBTOKEN DS    CL4       INPUT TOKEN                               @L4A 00309300
CQBRSRV1 DS    H         RESERVED                                  @P9C 00309400
CQBSIZE  EQU   *-CQB     LENGTH OF A CQB                       @G741PSS 00309500
*********************************************************************** 00309600
*     THE FOLLOWING FIELD IS TO ADDRESS THE UTOKEN STORAGE THAT    @LEA 00309700
*      IS GETMAINED BY MODULE IEAVC700.                            @LEA 00309800
*********************************************************************** 00309900
CQBUTOK  EQU   *         UTOKEN STORAGE                            @LEA 00310000
         MEXIT                                                 @G741PSS 00310100
.IHAAMRQ ANOP                                                  @G741PSS 00310200
*********************************************************************** 00310300
*                                                             @G741PSS* 00310400
*        AMRQ - ACTION MESSAGE RETENTION QUEUE MAPPING        @G741PSS* 00310500
*                                                             @G741PSS* 00310600
*   COPYRIGHT   =                                             @G741PSS* 00310700
*                 5740-XE1 COPYRIGHT IBM CORP 1979,                   * 00310800
*                 LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,         * 00310900
*                 REFER TO COPYRIGHT INSTRUCTIONS FORM                * 00311000
*                 NUMBER G120-2083.                                   * 00311100
*                                                                     * 00311200
*   STATUS      = MVS/SYSTEM  EXTENSIONS RELEASE 2            @G741PSS* 00311300
*                 04/14/78  LEVEL=01                          @G741PSS* 00311400
*                                                             @G741PSS* 00311500
*        METHOD OF ACCESS                                     @G741PSS* 00311600
*          BAL  - CODE THE FOLLOWING:  IHAWQE                 @G741PSS* 00311700
*                                      IHACTM AMRQ            @G741PSS* 00311800
*          PL/S - 1. DECLARE MACRO CHARACTER VARIABLE         @G741PSS* 00311900
*                    CTMAMRQ                                  @G741PSS* 00312000
*                 2. SET CTMAMRQ EQUAL TO 'YES'               @G741PSS* 00312100
*                 3. %INCLUDE SYSLIB(IHAWQE)                  @G741PSS* 00312200
*                 4. %INCLUDE SYSLIB(IHACTM)                  @G741PSS* 00312300
*                 5. DECLARE AMRQPTR                          @G741PSS* 00312400
*        FUNCTION                                             @G741PSS* 00312500
*          THE ACTION MESSAGE RETENTION QUEUE ENTRY CONTAINS  @G741PSS* 00312600
*          THE RETAINED ACTION MESSAGE WQE.                   @G741PSS* 00312700
*                                                             @G741PSS* 00312800
*        NOTE: THE WQE MUST BE MAPPED VIA MACRO IHAWQE FOR    @G741PSS* 00312900
*          THE AMRQ TO BE DEFINED PROPERLY.                   @G741PSS* 00313000
*                                                             @G741PSS* 00313100
*********************************************************************** 00313200
         SPACE 1                                               @G741PSS 00313300
AMRQENTY DSECT           MAPS ENTRY ON ACTION MSG RETENTION Q  @G741PSS 00313400
AMRQLINK DS    A         ADDRESS OF NEXT ENTRY ON QUEUE        @G741PSS 00313500
AMRQNTYP DS    A         ADDRESS OF NEXT ENTRY THAT IS THE SAME TYPE   X00313600
                         AS THIS ENTRY                         @G741PSS 00313700
AMRQPTYP DS    A         ADDRESS OF PREVIOUS ENTRY THAT IS THE SAME    X00313800
                         TYPE AS THIS ENTRY                    @G741PSS 00313900
AMRQWQE  DS    CL(WQESIZE) THE RETAINED MESSAGE. THIS FIELD IS MAPPED  X00314000
                         BY MACRO IHAWQE                       @G741PSS 00314100
AMRQSIZE EQU   *-AMRQENTY LENGTH OF AMRQ ENTRY                 @G741PSS 00314200
         MEXIT                                                 @G741PSS 00314300
.IHAUXIR ANOP                                                      @L6A 00314400
*********************************************************************** 00314500
*                                                                     * 00314600
*   NAME = USER EXIT INTERFACE PARAMETER LIST                     @L6A* 00314700
*                                                                     * 00314800
* *01* PROPRIETARY STATEMENT=                                         * 00314900
*  **PROPRIETARY_STATEMENT********************************************* 00315000
*                                                                     * 00315100
*                                                                     * 00315200
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00315300
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00315400
*   5655-068 (C) COPYRIGHT IBM CORP. 1979, 1993                       * 00315500
*   SEE COPYRIGHT INSTRUCTIONS                                        * 00315600
*                                                                     * 00315700
*   STATUS= HBB5510                                                   * 00315800
*                                                                     * 00315900
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00316000
*                                                                     * 00316100
*   FUNCTION         = PARAMETER LIST TO BE PASSED TO THE USER    @L6A* 00316200
*                      EXIT INTERFACE ROUTINE (IEAVX600).         @L6A* 00316300
*                      THIS MAPPING SERVES AS AN INTERFACE        @L6A* 00316400
*                      BETWEEN MODULES IEAVVWTO AND IEAVX600,     @L6A* 00316500
*                      AND BETWEEN MODULES IEAVMWTO AND IEAVX600. @L6A* 00316600
*                      THE MAPPING WILL CORRESPOND WITH THE       @L6A* 00316700
*                      PARAMETER LIST PASSED BY IEAVVWTO AND      @L6A* 00316800
*                      IEAVMWTO.                                  @L6A* 00316900
*                                                                     * 00317000
*   METHOD OF ACCESS =                                            @L6A* 00317100
*               BAL  - CODE THE FOLLOWING:  IHACTM UXIR.          @L6A* 00317200
*               PL/S - 1. DECLARE MACRO CHARACTER VARIABLE        @L6A* 00317300
*                         CTMUXIR.                                @L6A* 00317400
*                      2. SET CTMUXIR EQUAL TO 'YES'.             @L6A* 00317500
*                      3. FOR NON-BASED INVOCATION DECLARE        @L6A* 00317600
*                         VARIABLE UXIRVAL AND SET IT TO 'NONE'.  @L6A* 00317700
*                      4. FOR BASED MAPPING SET DSECT=YES.        @L6A* 00317800
*                      5. %INCLUDE SYSLIB(IHACTM).                @L6A* 00317900
*                      6. DECLARE UXIRPTR.                        @L6A* 00318000
*                                                                     * 00318100
*   CREATED BY       = IEAVVWTO,IEAVMWTO                          @L6A* 00318200
*                                                                     * 00318300
*   POINTED TO BY    = REGISTER 1 POINTS TO THE ADDRESS OF THE    @L6A* 00318400
*                      UXIR WHEN IEAVX600 IS CALLED.              @L6A* 00318500
*                                                                     * 00318600
*   SERIALIZATION    = NONE                                       @L6A* 00318700
*                                                                     * 00318800
*   LOCATION         = WTO ISSUER'S ADDRESS SPACE.                @L6A* 00318900
*                                                                     * 00319000
*   NOTE             = THE BAL VERSION IS USED IN IEAVMWTO,       @L6A* 00319100
*                      THE PL/S IN IEAVVWTO.                      @L6A* 00319200
*                                                                     * 00319300
*********************************************************************** 00319400
         SPACE 1                                                   @L6A 00319500
UXIR     DSECT           USER EXIT INTERFACE ROUTINE               @L6A 00319600
UXIRACRN DS    CL4       CONTROL BLOCK ACRONYM 'UXIR'              @L6A 00319700
UXIRVRSN DS    AL1       VERSION LEVEL                             @L6A 00319800
UXIRS212 EQU   1         LEVEL OS/VS2 JBB2125                      @L6A 00319900
UXIRVERN EQU   UXIRS212  CURRENT VERSION LEVEL                     @L6A 00320000
UXIRCFLG DS    C         COMMUNICATION FLAGS                       @L6A 00320100
UXIRMSUP EQU   X'80'     SUPPRESS THE MESSAGE                      @L6A 00320200
UXIRVMXT EQU   X'40'     IEAVMXIT TO BE CALLED                     @L8C 00320300
UXIRSUXT EQU   X'20'     SPECIFIED USER EXIT TO BE CALLED          @L8C 00320400
UXIRRSVD DS    CL2       RESERVED                                  @L6A 00320500
UXIRCWQE DS    A         ADDRESS OF CURRENT WQE - SINGLE OR MAJOR  @L6A 00320600
UXIRMINR DS    A         ADDRESS OF MINOR WQE (one text line)      @MAC 00320700
UXIRMPFE DS    A         ADDRESS OF THE MPF TABLE ENTRY            @L6A 00320800
UXIRMPFT DS    A         ADDRESS OF MPF TABLE                      @L6A 00320900
UXIRGENX DS    A         ADDRESS OF GENERAL WTO USER EXIT TABLE        X00321000
                         (GENX)                                    @L6A 00321100
UXIRWORK DS    A         ADDRESS OF WORK AREA                      @L6A 00321200
UXIREPRM DS    A         ADDRESS OF ESTAE EXIT PARAMETER LIST      @L6A 00321300
UXIRMINW DS    A         Address of minor wqe                      @MAA 00321400
UXIRRSV1 DS    CL12      Reserved                                  @MAA 00321500
UXIRX600 EQU   2000      SIZE OF IEAVX600'S WORKAREA               @LGC 00321600
UXIRSIZE EQU   *-UXIR    LENGTH OF UXIR ENTRY                      @L6A 00321700
         MEXIT                                                     @L6A 00321800
.IHACMDE ANOP                                                      @LCA 00321900
*********************************************************************** 00322000
*                                                                     * 00322100
*   NAME = CONSOLE COMMAND QUEUE ELEMENT MAPPING                  @LCA* 00322200
*                                                                     * 00322300
*   COPYRIGHT        =                                            @LCA* 00322400
*             5740-XC6                                                * 00322500
*             RESTRICTED MATERIALS OF IBM                             * 00322600
*             (C) COPYRIGHT IBM CORP. 1986                            * 00322700
*             LICENSED MATERIALS - PROPERTY OF IBM                    * 00322800
*             REFER TO COPYRIGHT INSTRUCTIONS                         * 00322900
*             FORM NUMBER G120-2083                                   * 00323000
*                                                                     * 00323100
*   STATUS           = OS/VS2 JBB2220                             @LCA* 00323200
*                                                                     * 00323300
*   FUNCTION         = THE CONSOLE COMMAND QUEUE ELEMENT IS USED  @LCA* 00323400
*                      TO CONTAIN A COMMAND IMAGE.                @LCA* 00323500
*                      IEAVN601 AND IEAVN602 BUILD CONSOLE        @LCA* 00323600
*                      COMMAND QUEUE AND CHAIN IT TO CONIMNQ,     @LCA* 00323700
*                      CONMRQ, CONMNQ.                            @LCA* 00323800
*                      IEAVN614 RECHAINS THOSE COMMAND QUEUES TO  @LCA* 00323900
*                      UCMEFCMQ AND SNPCMQ.                       @LCA* 00324000
*                                                                     * 00324100
*   METHOD OF ACCESS =                                            @LCA* 00324200
*               BAL  - CODE THE FOLLOWING:  IHACTM CMDELEM.       @LCA* 00324300
*               PL/S - 1. DECLARE MACRO CHARACTER VARIABLE        @LCA* 00324400
*                         CTMCMD.                                 @LCA* 00324500
*                      2. SET CTMCMD EQUAL TO 'YES'.              @LCA* 00324600
*                      3. %INCLUDE SYSLIB(IHACTM).                @LCA* 00324700
*                                                                     * 00324800
*   CREATED BY       = IEAVN601,IEAVN602                          @LCA* 00324900
*                                                                     * 00325000
*   POINTED TO BY    = CONMRQ, CONMNQ, CONIMNQ, UCMEFCMQ, SNPCMQ  @LCA* 00325100
*                                                                     * 00325200
*   SERIALIZATION    = NONE                                       @LCA* 00325300
*                                                                     * 00325400
*   LOCATION         = SP241                                      @LCA* 00325500
*                                                                     * 00325600
*                                                                     * 00325700
*********************************************************************** 00325800
         SPACE 1                                                   @LCA 00325900
CMDELEM  DSECT           CONSOLE COMMAND QUEUE ELEMENT MAPPING     @LCA 00326000
CMDFWDPT DS    A         FORWARD POINTER                           @LCA 00326100
CMDLGTH  DS    FL2       LENGTH OF THE ELEMENT MINUS LENGTH OF         X00326200
                          THE FORWARD POINTER                      @LCA 00326300
         DS    FL2       RESERVED                                  @LCA 00326400
CMDHRDL  EQU   *-CMDELEM LENGTH OF COMMAND HEADER                  @LCA 00326500
CMDCMD   DS    CL126     COMMAND IMAGE                             @LCA 00326600
         MEXIT                                                     @LCA 00326700
.IEE3003 ANOP                                                      @LCA 00326800
*********************************************************************** 00326900
*                                                                 @LDA* 00327000
*   NAME = IEE3003D VERB TABLE ENTRY DSECT                        @LDA* 00327100
*                                                                 @LDA* 00327200
*   COPYRIGHT        =                                            @LDA* 00327300
*             5685-001                                            @LDA* 00327400
*             RESTRICTED MATERIALS OF IBM                         @LDA* 00327500
*             (C) COPYRIGHT IBM CORP. 1989                        @LDA* 00327600
*             LICENSED MATERIALS - PROPERTY OF IBM                @LDA* 00327700
*                                                                 @LDA* 00327800
*   STATUS           = JBB3313                                    @LDA* 00327900
*                                                                 @LDA* 00328000
*   FUNCTION         = THE IEE3003D VERB TABLE ENTRY DSECT IS     @LDA* 00328100
*                      USED TO MAP EACH ENTRY IN THE VERB TABLE,  @LDA* 00328200
*                      RESIDING IN IEE3003D.                      @LDA* 00328300
*                                                                 @LDA* 00328400
*   METHOD OF ACCESS =                                            @LDA* 00328500
*               BAL  - CODE THE FOLLOWING:  IHACTM VRBMP          @LDA* 00328600
*               PL/S - 1. DECLARE MACRO CHARACTER VARIABLE        @LDA* 00328700
*                         VRBMP.                                  @LDA* 00328800
*                      2. SET VRBMP EQUAL TO 'YES'.               @LDA* 00328900
*                      3. %INCLUDE SYSLIB(IHACTM).                @LDA* 00329000
*                                                                 @LDA* 00329100
*   CREATED BY       = IEE0403D                                   @LDA* 00329200
*                                                                 @LDA* 00329300
*   POINTED TO BY    = NONE                                       @LDA* 00329400
*                                                                 @LDA* 00329500
*   SERIALIZATION    = NONE                                       @LDA* 00329600
*                                                                 @LDA* 00329700
*   LOCATION         = SYS1.LINKLIB                               @LDA* 00329800
*                                                                 @LDA* 00329900
*                                                                 @LDA* 00330000
*********************************************************************** 00330100
         SPACE 1                                                   @LDA 00330200
VERBMAP  DSECT                                                     @LDA 00330300
ENTRYLEN DS    AL1      LENGTH OF VERB TABLE ENTRY                 @LDA 00330400
VERBLEN  DS    XL1                                                 @LDA 00330500
*                       BITS 0-1  BOTH OFF, NO CMND. ABBREV.       @LDA 00330600
*                                 BOTH ON , TWO BYTE ABBREV.       @LDA 00330700
*                                 0=ON, 1=OFF, ONE BYTE ABBREV.    @LDA 00330800
*                       BIT  2    RESERVED                         @LDA 00330900
*                       BIT  3    ON FOR TSO AUTHORIZED CMNDS      @LDA 00331000
*                       BITS 4-7  COMMAND TEXT LENGTH              @LDA 00331100
VERBIND  DS    AL1                                                 @LDA 00331200
VERBAUT  DS    XL1                                                 @LDA 00331300
*                                 COMMAND AUTHORITY                @LDA 00331400
*                                 X'00' INFORMATIONAL              @LDA 00331500
*                                 X'80' SYSTEM                     @LDA 00331600
*                                 X'40' I/O                        @LDA 00331700
*                                 X'20' CONSOLES                   @LDA 00331800
AUTHTYPE DS    XL1                                                 @LDA 00331900
*                                 X'08' CONTROL                    @LDA 00332000
*                                 X'04' UPDATE                     @LDA 00332100
*                                 X'02' READ                       @LDA 00332200
RNAMELEN DS    XL1                LENGTH OF THE RESOURCE NAME      @LDA 00332300
VERB     EQU   *                                                   @LDA 00332400
         MEXIT                                                          00332500
.IHADOM0 ANOP                                                     @LUA  00332600
*********************************************************************** 00332700
*                                                                 @LUA* 00332800
*   NAME             = DOM REGISTER 0 MAPPING                     @LUA* 00332900
*                                                                 @LUA* 00333000
*   COPYRIGHT        =                                            @LUA* 00333100
*             5655-068                                            @LUA* 00333200
*             THIS MODULE IS "RESTRICTED MATERIALS OF IBM"        @LUA* 00333300
*             (C) COPYRIGHT IBM CORP. 1990                        @LUA* 00333400
*             LICENSED MATERIALS - PROPERTY OF IBM                @LUA* 00333500
*                                                                 @LUA* 00333600
*   STATUS           = HBB4410                                    @LUA* 00333700
*                                                                 @LUA* 00333800
*   FUNCTION         =  PROVIDES A MAPPING OF THE CONTENTS OF     @LUA* 00333900
*                       REGISTER 0 UPON ISSUANCE OF DOM/DOMP      @LUA* 00334000
*                                                                 @LUA* 00334100
*                                                                 @LUA* 00334200
*   METHOD OF ACCESS =                                            @LUA* 00334300
*    BAL    - CODE THE FOLLOWING - IHACTM DOM0                    @LUA* 00334400
*    PL/AS  - 1. DECLARE THE MACRO CHARACTER VARIABLE CTMDOM0     @LUA* 00334500
*             2. SET CTMDOM0 EQUAL TO 'YES'                       @LUA* 00334600
*             3. DCL DOM0PTR                                      @LUA* 00334700
*             4. %INCLUDE SYSLIB(IHACTM)                          @LUA* 00334800
*                                                                 @LUA* 00334900
*   CREATED BY       = DOM MACRO                                  @LUA* 00335000
*                                                                 @LUA* 00335100
*   POINTED TO BY    = N/A                                        @LUA* 00335200
*                                                                 @LUA* 00335300
*   SERIALIZATION    = NONE                                       @LUA* 00335400
*                                                                 @LUA* 00335500
*   LOCATION         = N/A                                        @LUA* 00335600
*                                                                 @LUA* 00335700
*********************************************************************** 00335800
         DSECT                                                    @LUA  00335900
DM0TREG0 DS    0F                                                 @LUA  00336000
DM0COUNT DS    X              THE COUNT OF 4-BYTE DOM IDS         @LUA  00336100
DM0PR220 EQU   BIT0           Pre-JBB2220 msglist if on           @0DA  00336200
DM0SYSID DS    X              A SYSID FOR MESSAGES TO BE DELETED  @LUA  00336300
DM0RQTYP DS    0H             DOM REQUEST TYPE                    @LUA  00336400
DM0RTYP1 DS    B              FLAG BYTE 1                         @LUA  00336500
DM0RSV01 EQU   BIT0           RESERVED                            @LUA  00336600
DM0RSV02 EQU   BIT1           RESERVED                            @LUA  00336700
DM0RSV03 EQU   BIT2           RESERVED                            @LUA  00336800
DM0RSV04 EQU   BIT3           RESERVED                            @LUA  00336900
DM0RSV05 EQU   BIT4           RESERVED                            @LUA  00337000
DM0SKIP  EQU   BIT5           SKIP DELAYED ISSUE PROCESSING       @PEC  00337100
DM0RSV06 EQU   BIT6           RESERVED                            @PEC  00337200
DM0LNKB  EQU   BIT7           LINKAGE=BRANCH WAS SPECIFIED        @LUA  00337300
DM0RTYP2 DS    B              FLAG BYTE 2                         @LUA  00337400
DM0SY    EQU   BIT0           SCOPE=SYSTEM WAS SPECIFIED          @LUA  00337500
DM0SYS   EQU   BIT1           SCOPE=SYSTEMS WAS SPECIFIED         @LUA  00337600
DM0TOK   EQU   BIT2           TOKEN VALUE WAS SPECIFIED           @LUA  00337700
DM0SID   EQU   BIT3           SYSTEM ID VALUE WAS SPECIFIED       @LUA  00337800
DM0MLST  EQU   BIT4           MSGLIST VALUE WAS SPECIFIED         @LUA  00337900
DM0RPLY  EQU   BIT5           REPLY=YES WAS SPECIFIED             @LUA  00338000
DM0DMCB  EQU   BIT6           DOMCBLK VALUE WAS SPECIFIED         @LUA  00338100
DM0MSG   EQU   BIT7           MSG VALUE WAS SPECIFIED             @LUA  00338200
         MEXIT                                                    @LUA  00338300
         MEND                   */;                                     00338400
*%CTMMAC:  IF CTMXV ~= 'YES'                                            00338500
*           %THEN %GO TO CTML1;                                         00338600
*           %ELSE %;                                                    00338700
*@EJECT;                                                                00338800
*/********************************************************************/ 00338900
*/*                                                                  */ 00339000
*/*          EXTENDED SAVEAREA MAPPING FOR SVC 35                    */ 00339100
*/*                                                                  */ 00339200
*/*01* PROPRIETARY STATEMENT=                                        */ 00339300
*/***PROPRIETARY_STATEMENT********************************************/ 00339400
*/*                                                                  */ 00339500
*/*                                                                  */ 00339600
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00339700
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00339800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1979, 1993                      */ 00339900
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00340000
*/*                                                                  */ 00340100
*/* STATUS= HBB5510                                                  */ 00340200
*/*                                                                  */ 00340300
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00340400
*/*                                                              @L9A*/ 00340500
*/* METHOD OF ACCESS                                             @L9A*/ 00340600
*/*   1. DECLARE MACRO CHARACTER VARIABLE CTMXV                  @L9A*/ 00340700
*/*   2. SET CTMXV EQUAL TO 'YES'                                @L9A*/ 00340800
*/*   3. DCL XVPTR                                               @L9A*/ 00340900
*/*   4. %INCLUDE SYSLIB(IHACTM)                                 @L9A*/ 00341000
*/*                                                              @L9A*/ 00341100
*/* FUNCTION                                                     @L9A*/ 00341200
*/*   THE XV IS USED AS AN SVC 35 (WTO) WORK AREA.               @L9A*/ 00341300
*/*                                                              @L9A*/ 00341400
*/* CREATED BY                                                   @L9A*/ 00341500
*/*   IEAVM600                                                   @L9A*/ 00341600
*/*                                                              @L9A*/ 00341700
*/* POINTED TO BY                                                @L9A*/ 00341800
*/*   THE XV IS BASED ON XVPTR WHICH MUST BE FILLED IN WITH      @L9A*/ 00341900
*/*   WITH THE ADDRESS OF THE XV IN ORDER TO ESTABLISH           @L9A*/ 00342000
*/*   ADDRESSABILITY CORRECTLY.  MODULES WHICH USE THE XV        @L9A*/ 00342100
*/*   MUST BE PASSED THE ADDRESS OF THE XV AND SET XVPTR         @L9A*/ 00342200
*/*   EQUAL TO THIS ADDRESS.                                     @L9A*/ 00342300
*/*                                                              @L9A*/ 00342400
*/* SERIALIZATION                                                @L9A*/ 00342500
*/*   NONE                                                       @L9A*/ 00342600
*/*                                                              @L9A*/ 00342700
*/* LOCATION                                                     @L9A*/ 00342800
*/*   THE STORAGE FOR THE XV IS OBTAINED FROM IEAVM600'S         @L9A*/ 00342900
*/*   DYNAMIC AREA, KEY 0 FROM SUBPOOL 229.                      @L9A*/ 00343000
*/*                                                              @L9A*/ 00343100
*/********************************************************************/ 00343200
*DECLARE                                                                00343300
* 1 XVSAV BASED(XVPTR) BDY(DWORD),                                      00343400
*                                 /* EXTENDED SAVEAREA           @L9C*/ 00343500
*   2 XVACRN       CHAR(3),       /* CONTROL BLOCK ID 'XV '      @L9A*/ 00343600
*   2 XVVRSN       FIXED(8),      /* VERSION LEVEL               @L9A*/ 00343700
*   2 XVA4         PTR(31),       /* REG AND D23 SAVEAREA    @ZA41986*/ 00343800
*     3 XVFNCT     CHAR(1),       /* D23 PROCESS CODE        @ZA41986*/ 00343900
*     3 XVAMOD     CHAR(1),       /* D23 MODULE ID           @ZA41986*/ 00344000
*     3 XVAABCD    FIXED(16),     /* ABEND CODE THAT CAUSED IEAVVWTO    00344100
*                                    IEAVMWTO TO FAIL            @01A*/ 00344200
*       4 *        CHAR(1),       /* RESERVED                    @01C*/ 00344300
*       4 XVREASON CHAR(1),       /* D23 REASON CODE             @01C*/ 00344400
*   2 XVA0         PTR(31),       /* REGISTER SAVEAREA ,                00344500
*                                    BYTE 1 - NUMBER OF WQES AND        00344600
*                                    BYTE 2-4 WPL PARM LENGTH    @L2C*/ 00344700
*   2 XVTIME       PTR(31),       /* TIME STORED BY IEAVM600     @L9C*/ 00344800
*   2 XVMSGLGH     FIXED(15),     /* MSGLENGTH, 4 + MSGTEXT LENGTH   */ 00344900
*   2 XVCHAR1      CHAR(1),       /* 1ST CHARACTER OF TEXT       @P7A*/ 00345000
*   2 XVMISC2      CHAR(1),       /* Miscellaneous flags         @01C*/ 00345100
*     3 XVGETENQ BIT(1),          /* INDICATE TO IEAVM604 TO OBTAIN     00345200
*                                    MPF/GENX TABLE ENQ          @01A*/ 00345300
*     3 XVFREENQ BIT(1),          /* INDICATE TO IEAVM604 TO RELEASE    00345400
*                                    MPF/GENX TABLE ENQ          @01A*/ 00345500
*     3 XVHADENQ BIT(1),          /* INDICATE CALLER HAD OBTAINED       00345610
*                                    THE MPF/GENX TABLE RESOURCE @0FA*/ 00345620
*     3 * BIT(5),                 /* Reserved                    @0FC*/ 00345630
*   2 XVPARMAD     PTR(31),       /* ADDR OF CALLER'S PARM LIST      */ 00345700
*   2 XVWQEAD      PTR(31),       /* ADDR OF WQE BUILT BY SVC 35     */ 00345800
*   2 XVCMAJOR     PTR(31),       /* ADDR OF MAJOR WQE           @L9A*/ 00345900
*   2 XVCMINOR     PTR(31),       /* ADDR OF MINOR WQE           @L9A*/ 00346000
*   2 XVTSRPTR     PTR(31),       /* ADDR OF TEXT SERVICE               00346100
*                                    PARAMETER LIST              @LHA*/ 00346200
*   2 XVTXTPTR     PTR(31),       /* ADDRESS OF WORKAREA CONTAINING WTO 00346300
*                                    TEXT WHEN TEXT PARAMETER USED ON   00346400
*                                    WTO                         @PCA*/ 00346500
    2 XVINTPTR     PTR(31),       /* INTERMEDIATE WORK POINTER FOR      00346600
                                     MLWTO'S                     @PCA*/ 00346700
*/***************************************************************@L9A*/ 00346800
*/*     XV FLAGS                                                 @L9A*/ 00346900
*/***************************************************************@L9A*/ 00347000
*   2 XVDFLAGS FIXED(32),         /* FLAGS WORD                      */ 00347100
*     3 XVD0    BIT(8),           /* FIRST FLAGS BYTE                */ 00347200
*       4 XVD0S250 BIT(1),        /* IF ON, USER'S EXIT PARM IN SP250   00347300
*                                    IF OFF, PARM LIST IS IN SP229   */ 00347400
*       4 XVD0RPFD BIT(1),        /* REPLY ID AVAIL & PUT IN ORE     */ 00347500
*       4 XVD0NWQE BIT(1),        /* NEED A WQE                      */ 00347600
*       4 XVD0NORE BIT(1),        /* NEED AN ORE                     */ 00347700
*       4 XVD0QID  BIT(1),        /* QID IS PRESENT IN THE WPL       */ 00347800
*       4 XVD0WWB  BIT(1),        /* A WWB HAS BEEN OBTAINED         */ 00347900
*       4 XVD0USER BIT(1),        /* RETURN TO USER IF SET ON BY THE    00348000
*                                    WTP ROUTINE.                @L9C*/ 00348100
*       4 XVD0HDCY BIT(1),        /* THIS MESSAGE IS A WTP TO BE SENT   00348200
*                                    TO HARDCOPY ONLY.               */ 00348300
*     3 XVD1     BIT(8),          /* FLAG BYTE WTO/WTOR/MLWTO        */ 00348400
*       4 XVD1PRIV BIT(1),        /* USER IS A PRIVILEGED TASK       */ 00348500
*       4 XVD1CFPL BIT(1),        /* STORAGE WAS FOUND FOR PARM LIST    00348600
*                                                                @L9C*/ 00348700
*       4 XVD1ALDN BIT(1),        /* ALL DONE GETTING WQE/ORE BLOCKS */ 00348800
*       4 XVD1OEXT BIT(1),        /* AN ORE EXISTS FOR THIS WQE      */ 00348900
*       4 XVRESV01 BIT(1),        /* RESERVED                        */ 00349000
*       4 XVD1PP   BIT(1),        /* USER IS A PROBLEM PROGRAM       */ 00349100
*       4 XVD1AUTH BIT(1),        /* USER IS AN AUTHORIZED PROGRAM   */ 00349200
*       4 XVD1PERR BIT(1),        /* PARM LIST FOUND TO BE IN ERROR  */ 00349300
*     3 XVD2       BIT(8),        /* MLWTO FLAGS BYTE                */ 00349400
*       4 XVD2CON  BIT(1),        /* CONNECTING MLWTO                */ 00349500
*       4 XVD2RDC  BIT(1),        /* ROUTE/DESCRIPTOR CODES EXIST    */ 00349600
*       4 XVD2MSGT BIT(1),        /* MSGTYPE FIELD EXISTS            */ 00349700
*       4 XVD2VALD BIT(1),        /* THE WPL IS VALID                */ 00349800
*       4 XVD2DELW BIT(1),        /* SEND THE WQE TO HARD COPY ONLY  */ 00349900
*       4 XVD2ZERO BIT(1),        /* MESSAGE HAS LENGTH OF ZERO      */ 00350000
*       4 XVD2WTOR BIT(1),        /* THIS IS A WTOR                  */ 00350100
*       4 XVD2QFHC BIT(1),        /* QUEUE THIS WQE FOR HARDCOPY     */ 00350200
*     3 XVD3       BIT(8),        /* FOURTH FLAGS BYTE           @L9C*/ 00350300
*       4 XVD3BLDJ BIT(1),        /* BUILD MAJOR WQE             @L9A*/ 00350400
*       4 XVD3BLD1 BIT(1),        /* BUILD LINE 1                @L9A*/ 00350500
*       4 XVD3BLD2 BIT(1),        /* BUILD LINE 2                @L9A*/ 00350600
*       4 XVD3TXT1 BIT(1),        /* TEXT LINE 1 BEING USED      @L9A*/ 00350700
*       4 XVD3TFXW BIT(1),        /* THE TCBTFX BIT WAS SET ON,         00350800
*                                    TURN IT OFF                 @L9A*/ 00350900
*       4 XVD3ENQY BIT(1),        /* ENQ WAS OBTAINED BY THIS SVC 35    00351000
*                                                                @01A*/ 00351100
*       4 XVD3XITR BIT(1),        /* CVXIT CHANGED ROUT CODE @ZA88861*/ 00351200
*       4 XVD3XITD BIT(1),        /* CVXIT CHANGED DESC CODE @ZA88861*/ 00351300
*   2 XVOREAD    PTR(31),         /* ADDR OF THE ORE                 */ 00351400
*/***************************************************************@L9A*/ 00351500
*/*     LINE TYPE FLAGS                                          @L9A*/ 00351600
*/***************************************************************@L9A*/ 00351700
*   2 XVX0       BIT(8),          /* LINE CONTROL FLAGS--MLWTO   @L9A*/ 00351800
*     3 XVX0FLCL BIT(1),          /* FIRST LINE IS CONTROL LINE  @L9A*/ 00351900
*     3 *        BIT(2),          /* RESERVED                    @L9A*/ 00352000
*     3 XVX0UDCL BIT(1),          /* USE DEFAULT CONTROL LINE    @L9A*/ 00352100
*     3 XVX0FLJE BIT(1),          /* FIRST LINE JUST 'E'         @L9A*/ 00352200
*     3 XVX0FEDE BIT(1),          /* FORCE END (LAST LINE TO BE         00352300
*                                    DE)                         @L9A*/ 00352400
*/***************************************************************@L9A*/ 00352500
*/*     MLWTO ERROR FLAGS                                        @L9A*/ 00352600
*/***************************************************************@L9A*/ 00352700
*   2 XVX1       BIT(8),          /* MLWTO ERROR FLAGS           @L9A*/ 00352800
*     3 XVX1STOP BIT(1),          /* ERROR IN PARM LIST.  IGNORE        00352900
*                                    MLWTO                       @L9A*/ 00353000
*     3 XVX1NOID BIT(1),          /* NO ID FOR CONNECTING MLWTO  @L9A*/ 00353100
*   2 XVX2       CHAR(1),         /* NUMBER OF LINES STILL TO DO @L9A*/ 00353200
*   2 XVMISC     CHAR(1),         /* MISCELLANEOUS FLAGS         @P5A*/ 00353300
*     3 XVJBIDSP BIT(1),          /* JOBID WAS SPECIFIED ON WTO/WTOR    00353400
*                                                                @P5A*/ 00353500
*     3 XVJBNMSP BIT(1),          /* JOBNAME WAS SPECIFIED ON WTO/WTOR  00353600
*                                                                @P5A*/ 00353700
*     3 XVSYIDSP BIT(1),          /* SYSTEM ID WAS SPECIFIED ON         00353800
*                                    WTO/WTOR                    @P5A*/ 00353900
*     3 XVSYNMSP BIT(1),          /* SYSTEM NAME WAS SPECIFIED ON       00354000
*                                    WTO/WTOR                    @P5A*/ 00354100
*     3 XVAUTO   BIT(1),          /* RECEIVE AUTOMATABLE MESSAGES       00354200
*                                                                @M2C*/ 00354300
*     3 XVRSV1   BIT(1),          /* RESERVED                    @PSC*/ 00354400
*     3 XVLOCKS  BIT(1),          /* HOLDING LOCAL & CMS LOCKS   @LNA*/ 00354500
*     3 XVENQ    BIT(1),          /* ENQ HAS BEEN DONE ON WTOR          00354600
*                                    RESOURCE                    @LNA*/ 00354700
*   2 XVWWB      PTR(31),         /* ADDR OF WWB FOR WAIT            */ 00354800
*   2 XVWQEID    CHAR(4),         /* REG0 ON INPUT TO SVC 35     @L9C*/ 00354900
*     3 XVWQEIDA CHAR(3),         /* CONNECT ID                  @L9A*/ 00355000
*     3 XVCONID  CHAR(1),         /* 1 BYTE CONSOLE ID PASSED BY USER   00355100
*                                                                @L9A*/ 00355200
*   2 XVRETCOD   CHAR(1),         /* RETURN CODE TO BE SENT TO CALLER*/ 00355300
*   2 XVSDATE      CHAR(3),       /* DATE STORED BY IEAVM600     @L9C*/ 00355400
*   2 XVNUMWTO     BIT(8),        /* REAL NUMBER OF LINES IN MLWTO      00355500
*                                                                @L9A*/ 00355600
*   2 XVDIAGFL     CHAR(1),       /* DIAGNOSTIC FLAGS        @YA24954*/ 00355700
*   3 XVIEA099     BIT(1),        /* ISSUE MESSAGE IEA099A   @YA24954*/ 00355800
*   3 XV099DOM     BIT(1),        /* DOM MESSAGE IEA099A     @YA24954*/ 00355900
*   3 XVIEA653     BIT(1),        /* ISSUE MESSAGE IEA653I       @09A*/ 00356000
*   3 XVRSV2       BIT(1),        /* RESERVED                    @PSC*/ 00356100
*   3 *            BIT(4),        /* RESERVED                    @0CC*/ 00356300
*   2 XVQDSYS      FIXED(8),      /* WQE destinations counter    @PNA*/ 00356400
*   2 XVCID        CHAR(1),       /* 1 byte console id from CONVCON     00356500
*                                                                @PVC*/ 00356600
*   2 XVEPRMAD     PTR(31),       /* ADDRESS OF ESTAE PARM LIST  @L9A*/ 00356700
*   2 XVLTYP       CHAR(2),       /* LINE TYPE FLAGS             @L9A*/ 00356800
*   2 XVRPYID      CHAR(2),       /* REPLY ID                    @L9A*/ 00356900
*   2 XVJSTCB      PTR(31),       /* WTO ISSUER'S JSTCB(FOR DOM) @L9A*/ 00357000
*   2 XVTCB        PTR(31),       /* WTO ISSUER'S TCB(FOR DOM)   @L9A*/ 00357100
*   2 XVTEXT       PTR(31),       /* POINTER TO MESSAGE TEXT     @L9A*/ 00357200
*   2 XVASID       CHAR(2),       /* ASID OF USER(FOR DOM)       @L9A*/ 00357300
*   2 XVSCENT      CHAR(2),       /* Century portion of date     @0BC*/ 00357400
*   2 XVRFLGS      CHAR(4),       /* WTO USER EXIT REQUEST FLAGS @L9A*/ 00357500
*   2 XVWQETYP     BIT(8),        /* WQE TYPE FLAGS              @L9A*/ 00357600
*     3 XVMAJWQE   BIT(1),        /* MAJOR WQE PASSED VIA WQEBLK @L9A*/ 00357700
*     3 XVMINWQE   BIT(1),        /* MINOR WQE PASSED VIA WQEBLK @L9A*/ 00357800
*     3 XVRETAIN   BIT(1),        /* AMRF RETENTION BIT COPIED FROM     00357900
*                                    THE ORIGINAL WQE            @L9A*/ 00358000
*     3 XVREISSU   BIT(1),        /* MESSAGE IS A REISSUED WTO          00358100
*                                    (EITHER DOMID OR WQEBLK WAS        00358200
*                                    SPECIFIED)                  @L9A*/ 00358300
*     3 *          BIT(4),        /* RESERVED                    @L9A*/ 00358400
*   2 XVAREA       CHAR(1),       /* AREA ID                     @L9A*/ 00358500
*/***************************************************************@L9A*/ 00358600
*/*         MCS FLAGS                                            @L9A*/ 00358700
*/***************************************************************@L9A*/ 00358800
*   2 XVMCSF      CHAR(2),               /* MCS FLAGS            @L9A*/ 00358900
*    3 XVMCSF1     BIT(8),               /* 1ST BYTE OF MCS FLAGS@L9A*/ 00359000
*     4 XVMCSFA BIT(1),                  /* ROUTE/DESCRIPTOR CODE       00359100
*                                           FIELDS PRESENT       @L9A*/ 00359200
*     4 XVMCSFB BIT(1),                  /* QUEUE TO CONSOLE IF ACTIVE  00359300
*                                           (ID IN REG 0)        @L9A*/ 00359400
*     4 XVMCSFC BIT(1),                  /* COMMAND RESPONSE     @L9A*/ 00359500
*     4 XVMCSFD BIT(1),                  /* MESSAGE TYPE FIELD EXISTS   00359600
*                                                                @L9A*/ 00359700
*     4 XVMCSFE BIT(1),                  /* THIS WPL IS A REPLY TO A    00359800
*                                           WTOR                 @L9A*/ 00359900
*     4 XVMCSFF BIT(1),                  /* BROADCAST THIS MESSAGE      00360000
*                                           TO ALL ACTIVE CONSOLES      00360100
*                                                                @L9A*/ 00360200
*     4 XVMCSFG BIT(1),                  /* QUEUE TO HARD COPY ONLY     00360300
*                                                                @L9A*/ 00360400
*     4 XVMCSFH BIT(1),                  /* QUEUE TO CONSOLE            00360500
*                                           ID IN REG 0          @PIC*/ 00360600
*    3 XVMCSF2     BIT(8),               /* 2ND BYTE OF MCS FLAGS@L9A*/ 00360700
*     4 XVMCSFI BIT(1),                  /* DO NOT TIME STAMP THIS      00360800
*                                           MESSAGE              @L9A*/ 00360900
*     4 XVMCSFJ BIT(1),                  /* MLWTO INDICATOR      @L9A*/ 00361000
*     4 XVMCSFK BIT(1),                  /* PRIMARY SUBSYSTEM USE       00361100
*                                           ONLY.                       00361200
*                                           JES3: DO NOT LOG MINOR      00361300
*                                                 WQE'S IF THE MAJOR    00361400
*                                                 IS NOT HARDCOPIED.    00361500
*                                           JES2: NOT USED.      @L9A*/ 00361600
*     4 XVMCSFL BIT(1),                  /* EXTENDED WPL FORMAT (WPX)   00361700
*                                           EXISTS               @L9A*/ 00361800
*     4 XVMCSFM BIT(1),                  /* THE MESSAGE IS AN OPERATOR  00361900
*                                           COMMAND              @L9A*/ 00362000
*     4 XVMCSFN BIT(1),                  /* BYPASS QUEUING MESSAGE      00362100
*                                           TO HARD COPY         @L9A*/ 00362200
*     4 XVMCSFO BIT(1),                  /* WQEBLK KEYWORD SPECIFIED    00362300
*                                                                @L9A*/ 00362400
*     4 *        BIT(1),                 /* RESERVED             @L9A*/ 00362500
*   2 XVMLEXTP   PTR(31),                /* MULTILINE EXTENSION         00362600
*                                           ADDRESS              @L9A*/ 00362700
*   2 XVEXIF     BIT(16),                /* MISCELLANEOUS AND MINOR     00362800
*                                           ERROR INFORMATION           00362900
*                                           FLAGS                @LHA*/ 00363000
*     3 XVEXIF1  BIT(8),                 /* MISC AND MINOR ERROR        00363100
*                                           FLAG BYTE 1          @LHA*/ 00363200
*       4 XVETXTR BIT(1),                /* MESSAGE TEXT WAS            00363300
*                                           TRUNCATED            @LHA*/ 00363400
*       4 XVEXNVT BIT(1),                /* INVALID USER EXIT TEXT      00363500
*                                           MODIFICATION         @LHA*/ 00363600
*       4 XVEXMER BIT(1),                /* MUTUALLY EXCLUSIVE USER     00363700
*                                           EXIT REQUESTS MADE   @LHA*/ 00363800
*       4 XVEXIRM BIT(1),                /* INCOMPATIBLE USER EXIT      00363900
*                                           REQUESTS MADE        @LHA*/ 00364000
*       4 XVEREV  BIT(1),                /* RESERVED             @DCC*/ 00364100
*       4 XVUCINCR BIT(1),               /* MPF TABLE OR GENX           00364200
*                                           TABLE USE COUNT             00364300
*                                           INCREMENTED &               00364400
*                                           NOT DECREMENTED      @LNA*/ 00364500
*       4 XVMPFUXT BIT(1),               /* A WTO USER EXIT             00364600
*                                           SPECIFIED BY AN             00364700
*                                           MPF TABLE ENTRY             00364800
*                                           WAS CALLED           @LNA*/ 00364900
*       4 XVEXWTP  BIT(1),               /* IEEJB840 CALLED      @LPC*/ 00365000
*     3 XVEXIF2   BIT(8),                /* RESERVED             @LHA*/ 00365100
*       4 XVQONLY BIT(1),                /* REISSUED WQE =Q ONLY @P8A*/ 00365200
*       4 XVAMRFO BIT(1),                /* WQE FOR AMRF ONLY    @DAA*/ 00365300
*       4 XVAMRFA BIT(1),                /* AMRF ACTIVE ON ISSUING      00365400
*                                           SYSTEM               @DAA*/ 00365500
*       4 XVQD    BIT(1),                /* WQE FINISHED QUEUING @DAA*/ 00365600
*       4 XVWTPR  BIT(1),                /* WTP REQUEST          @PHA*/ 00365700
*       4 XVMFR   BIT(1),                /* MODIFIED FOR REQUEUE @PLA*/ 00365800
*       4 XVAMRFR BIT(1),                /* WQE FOR AMRF REFRESH @PLA*/ 00365900
*       4 XVSAUT  BIT(1),                /* AUTOMATION SPECIFIED        00366000
*                                           FOR THIS MESSAGE     @M2A*/ 00366100
*   2 *          CHAR(2),                /* RESERVED             @LNC*/ 00366200
*   2 XVMPFTP    PTR(31),                /* ADDRESS OF MPF TABLE @LNA*/ 00366300
*   2 XVMPFTEP   PTR(31),                /* ADDRESS OF MPF TABLE        00366400
*                                           ENTRY MATCHING              00366500
*                                           CURRENT MESSAGE ID   @LNA*/ 00366600
*   2 XVGENXTP   PTR(31),                /* ADDRESS OF WTO              00366700
*                                           GENERAL USER EXIT           00366800
*                                           TABLE                @LNA*/ 00366900
*/***************************************************************@L9A*/ 00367000
*/*                                                              @L9A*/ 00367100
*/*     START OF WPX COPY                                        @L9A*/ 00367200
*/*                                                              @L9A*/ 00367300
*/***************************************************************@L9A*/ 00367400
*   2 XVWPX BDY(WORD),            /* START OF WPX COPY           @L9A*/ 00367500
*     3 XVWPXVRS   BIT(8),        /* VERSION LEVEL OF WPX        @L9A*/ 00367600
*/***************************************************************@L9A*/ 00367700
*/*     MPF/SUBSMOD FLAGS                                        @L9A*/ 00367800
*/***************************************************************@L9A*/ 00367900
*     3 XVFLG2     BIT(8),        /* MPF/SUBSMOD FLAGS           @L9A*/ 00368000
*       4 XVMPFSP  BIT(1),        /* MESSAGE IS TO BE SUPPRESSED        00368100
*                                    DUE TO MPF                  @L9A*/ 00368200
*       4 XVMPFPR  BIT(1),        /* MESSAGE WAS PROCESSED BY MPF       00368300
*                                    AND IS NOT TO BE SUPPRESSED @L9A*/ 00368400
*       4 XVNMOD   BIT(1),        /* THE CHARACTERISTICS OF THE         00368500
*                                    MESSAGE MAY NOT BE MODIFIED        00368600
*                                    BY THE PRIMARY SUBSYSTEM    @L9A*/ 00368700
*     3 XVRPYLN    BIT(8),        /* LENGTH OF REPLY BUFFER      @L9A*/ 00368800
*     3 XVWPXLN    BIT(8),        /* LENGTH OF WPX               @LHC*/ 00368900
*/***************************************************************@L9A*/ 00369000
*/*     EXTENDED MCS FLAGS                                       @L9A*/ 00369100
*/*  CHANGES IN THE EXTENDED MSC FLAGS WILL ALSO IMPACT THE      @D6A*/ 00369200
*/*  EXTENDED MCS FLAGS IN IHAWQE AND IEZWPL                     @D6A*/ 00369300
*/***************************************************************@L9A*/ 00369400
*     3 XVEMCSFL   BIT(16),       /* EXTENDED MCS FLAGS          @L9A*/ 00369500
*       4 XVEMCSF1 BIT(8),        /* FIRST BYTE OF MCS FLAGS     @L9A*/ 00369600
*         5 XVEMBUSY BIT(1),      /* RETURN WITH BUSY RETURN CODE       00369700
*                                    IF BUFFER LIMITATIONS EXCEEDED     00369800
*                                                                @L9A*/ 00369900
*         5 XVEMCONS BIT(1),      /* FOUR BYTE CONSOLE ID               00370000
*                                    SPECIFIED                   @L9A*/ 00370100
*         5 XVEMDOMI BIT(1),      /* DOMID SPECIFIED             @L9A*/ 00370200
*         5 XVEMCONN BIT(1),      /* CONNECT KEYWORD SPECIFIED   @L9A*/ 00370300
*         5 XVEMWTOR BIT(1),      /* WTOR WITH EXTENDED PARM LIST@L9A*/ 00370400
*         5 XVEMPRIO BIT(1),      /* PRIORITY SPECIFIED          @L9A*/ 00370500
*         5 XVEMCNM  BIT(1),      /* CONSOLE NAME SPECIFIED      @LFA*/ 00370600
*       4 XVEMCSF2 BIT(8),        /* SECOND BYTE OF MCS FLAGS    @L9A*/ 00370700
*         5 XVETXTAD BIT(1),      /* MESSAGE TEXT WAS SPECIFIED  @LHA*/ 00370800
*         5 XVERSV1A BIT(1),      /* RESERVED                    @D6A*/ 00370900
*         5 XVERSV2  BIT(1),      /* RESERVED                    @DCC*/ 00371000
*         5 XVERSV1  BIT(1),      /* RESERVED                    @DCC*/ 00371100
*         5 XVERSV1B BIT(1),      /* RESERVED                    @D7C*/ 00371200
*         5 XVESYNC BIT(1),       /* PROCESS SYNCHRONOUS WITH RESPECT   00371300
*                                    TO THE CALLER               @LUA*/ 00371400
*         5 *       BIT(2),       /* RESERVED                    @LUA*/ 00371500
*     3   XVCPFLG  BIT(16),       /* CONTROL PROGRAM ONLY FLAGS  @PSA*/ 00371600
*         5 XVCPFL1  BIT(8),      /* CONTROL PROGRAM USE FLAGS,         00371700
*                                    BYTE 1                      @PSA*/ 00371800
*           7 XVRROK  BIT(1),     /* RESTART RESOURCE IS NOT TO         00371900
*                                    BE OBTAINED                 @PSA*/ 00372000
*           7 XVNOHO  BIT(1),     /* DON'T HOLD THE MESSAGE FOR         00372100
*                                    TEN SECONDS                 @PSA*/ 00372200
*           7 XVNLCK  BIT(1),     /* DO NOT ATTEMPT TO OBTAIN           00372300
*                                    ANY LOCKS                   @PSA*/ 00372400
*           7 XVACLW  BIT(1),     /* USE ALTERNATE CPU LOADWAIT         00372500
*                                    PATH                        @PSA*/ 00372600
*           7 XVSPVD  BIT(1),     /* SUPER PRIVILEGED            @PSA*/ 00372700
*           7 XVQNLY  BIT(1),     /* MESSAGE GOES ONLY TO               00372800
*                                    CONSOLE                     @PSA*/ 00372900
*         5 XVCPFL2  BIT(8),      /* CONTROL PROGRAM USE FLAGS,         00373000
*                                    BYTE 2                      @PSA*/ 00373100
*     3 XVRPBUF    PTR(31),       /* REPLY BUFFER ADDRESS        @L9A*/ 00373400
*     3 XVECBP     PTR(31),       /* REPLY ECB ADDRESS           @L9A*/ 00373500
*     3 XVSEQN     FIXED(31),     /* DOM ID                      @L9A*/ 00373600
*       4 XVSYSID    FIXED(8),    /* SYSTEM ID                   @L9A*/ 00373700
*       4 XVSQID     FIXED(24),   /* SEQUENCE NUMBER             @L9A*/ 00373800
*     3 XVRDMSV    CHAR(22),      /* SAVE AREA FOR DESC CODES,          00373900
*                                    ROUTING CODES, AND MSGTYPE         00374000
*                                    FIELDS                      @L9C*/ 00374100
*/***************************************************************@L9A*/ 00374200
*/*     DESCRIPTOR CODES                                         @L9A*/ 00374300
*/***************************************************************@L9A*/ 00374400
*       4 XVDESCD    BIT(16),     /* DESCRIPTOR CODES            @L9A*/ 00374500
*         5 XVDCBYT1 BIT(8),      /* DESCRIPTOR CODES 1-8        @L9A*/ 00374600
*           6 XVDC1  BIT(1),      /* DESCRIPTOR CODE 1           @L9A*/ 00374700
*           6 XVDC2  BIT(1),      /* DESCRIPTOR CODE 2           @L9A*/ 00374800
*           6 XVDC3  BIT(1),      /* DESCRIPTOR CODE 3           @L9A*/ 00374900
*           6 XVDC4  BIT(1),      /* DESCRIPTOR CODE 4           @L9A*/ 00375000
*           6 XVDC5  BIT(1),      /* DESCRIPTOR CODE 5           @L9A*/ 00375100
*           6 XVDC6  BIT(1),      /* DESCRIPTOR CODE 6           @L9A*/ 00375200
*           6 XVDC7  BIT(1),      /* DESCRIPTOR CODE 7           @L9A*/ 00375300
*           6 XVDC8  BIT(1),      /* DESCRIPTOR CODE 8           @L9A*/ 00375400
*         5 XVDCBYT2 BIT(8),      /* DESCRIPTOR CODES 9-16       @L9A*/ 00375500
*           6 XVDC9  BIT(1),      /* DESCRIPTOR CODE 9           @L9A*/ 00375600
*           6 XVDC10 BIT(1),      /* DESCRIPTOR CODE 10          @L9A*/ 00375700
*           6 XVDC11 BIT(1),      /* DESCRIPTOR CODE 11          @L9A*/ 00375800
*           6 XVDC12 BIT(1),      /* DESCRIPTOR CODE 12          @L9A*/ 00375900
*           6 XVDC13 BIT(1),      /* DESCRIPTOR CODE 13          @L9A*/ 00376000
*           6 XVDC14 BIT(1),      /* DESCRIPTOR CODE 14          @L9A*/ 00376100
*           6 XVDC15 BIT(1),      /* DESCRIPTOR CODE 15          @L9A*/ 00376200
*           6 XVDC16 BIT(1),      /* DESCRIPTOR CODE 16          @L9A*/ 00376300
*       4 *          CHAR(2),     /* RESERVED                    @L9A*/ 00376400
*/***************************************************************@L9A*/ 00376500
*/*     128 ROUTING CODES                                        @L9A*/ 00376600
*/***************************************************************@L9A*/ 00376700
*       4 XVRCSAVE   CHAR(16),    /* ROUTING CODES(1-128)        @L9A*/ 00376800
*         5 XVRCBYT1 BIT(8),      /* ROUTING CODES 1-8           @L9A*/ 00376900
*           6 XVRC1  BIT(1),      /* ROUTING CODE 1              @L9A*/ 00377000
*           6 XVRC2  BIT(1),      /* ROUTING CODE 2              @L9A*/ 00377100
*           6 XVRC3  BIT(1),      /* ROUTING CODE 3              @L9A*/ 00377200
*           6 XVRC4  BIT(1),      /* ROUTING CODE 4              @L9A*/ 00377300
*           6 XVRC5  BIT(1),      /* ROUTING CODE 5              @L9A*/ 00377400
*           6 XVRC6  BIT(1),      /* ROUTING CODE 6              @L9A*/ 00377500
*           6 XVRC7  BIT(1),      /* ROUTING CODE 7              @L9A*/ 00377600
*           6 XVRC8  BIT(1),      /* ROUTING CODE 8              @L9A*/ 00377700
*         5 XVRCBYT2 BIT(8),      /* ROUTING CODES 9-16          @L9A*/ 00377800
*           6 XVRC9  BIT(1),      /* ROUTING CODE 9              @L9A*/ 00377900
*           6 XVRC10 BIT(1),      /* ROUTING CODE 10             @L9A*/ 00378000
*           6 XVRC11 BIT(1),      /* ROUTING CODE 11             @L9A*/ 00378100
*           6 XVRC12 BIT(1),      /* ROUTING CODE 12             @L9A*/ 00378200
*           6 XVRC13 BIT(1),      /* ROUTING CODE 13             @L9A*/ 00378300
*           6 XVRC14 BIT(1),      /* ROUTING CODE 14             @L9A*/ 00378400
*           6 XVRC15 BIT(1),      /* ROUTING CODE 15             @L9A*/ 00378500
*           6 XVRC16 BIT(1),      /* ROUTING CODE 16             @L9A*/ 00378600
*       4 XVMSGTYP   BIT(16),     /* MESSAGE TYPE FLAGS          @L9A*/ 00378700
*     3 XVPRTY     CHAR(2),       /* MESSAGE'S PRIORITY          @L9A*/ 00378800
*     3 XVJOBID    CHAR(8),       /* JOB ID                      @L9A*/ 00378900
*     3 XVJOBNM    CHAR(8),       /* JOBNAME                     @L9A*/ 00379000
*     3 XVKEY      CHAR(8),       /* RETRIEVAL KEY               @L9A*/ 00379100
*     3 XVTOKN     PTR(31),       /* TOKEN FOR DOM               @L9A*/ 00379200
*     3 XVCNID     FIXED(31),     /* CONSOLE ID                  @L9A*/ 00379300
*       4 XVCNCLS    FIXED(8),    /* CONSOLE QUEUING CLASS       @D5C*/ 00379400
*       4 XVCNRSV    FIXED(8),    /* RESERVED (=0)               @D3C*/ 00379500
*       4 XVCNUM     FIXED(15),   /* CONSOLE NUMBER              @L9A*/ 00379600
*     3 XVSYSNAM   CHAR(8),       /* SYSTEM NAME                 @L9A*/ 00379700
*     3 XVCNNME    CHAR(8),       /* CONSOLE NAME                @LFA*/ 00379800
*     3 XVCNRA     PTR(31),       /* REPLY CONSOLE NAME/ID ADDR  @LFA*/ 00379900
*     3 XVCART     PTR(31),       /* CART ADDRESS                @LGC*/ 00380000
*     3 XVWSPARM   PTR(31),       /* WAIT STATE PARAMETER LIST ADDRESS  00380100
*                                                                @LGC*/ 00380200
*     3 XVASCB  PTR(31) BDY(BYTE), /* ADDRESS OF ASCB            @PTA*/ 00380300
*     3 XVRSV30 CHAR(16),          /* RESERVED                   @PUC*/ 00380400
*/***************************************************************@L9A*/ 00380500
*/*     END OF WPX COPY                                          @L9A*/ 00380600
*/***************************************************************@L9A*/ 00380700
*/***************************************************************@PSA*/ 00380800
*/*     WQE FIELDS, COPIED IF WQEBLK SPECIFIED                   @PSA*/ 00380900
*/***************************************************************@PSA*/ 00381000
*/***************************************************************@PSM*/ 00381100
*/*   BRANCH ENTRY/NIP FLAG                                      @PSM*/ 00381200
*/*   CHANGES TO THIS FLAG SHOULD BE CARRIED OVER TO THE         @PSM*/ 00381300
*/*   WQEBENIP FLAG BYTE IN IHAWQE                               @PSM*/ 00381400
*/***************************************************************@PSM*/ 00381500
*     2   XVBENIPF BIT(8),        /* BRANCH ENTRY/NIP FLAG       @PSM*/ 00381600
*         5 XVDOMD   BIT(1),      /* MESSAGE HAS ALREADY BEEN           00381700
*                                    DOMD                        @PSM*/ 00381800
*         5 XVNBEW   BIT(1),      /* BRANCH ENTRY OR NIP MESSAGE @PSM*/ 00381900
*         5 XVNHABD  BIT(1),      /* HAS ALREADY BEEN DISPLAYED  @PSM*/ 00382000
*         5 XVNASCB  BIT(1),      /* ASCB SPECFIED               @PTA*/ 00382100
*         5 *       BIT(4),       /* RESERVED                    @PTC*/ 00382200
*/***************************************************************@PSM*/ 00382300
*/*     MISCELLANEOUS ROUTING INFORMATION                        @PSM*/ 00382400
*/***************************************************************@PSM*/ 00382500
*     2   XVMISCRT BIT(8),        /* MISCELLANEOUS ROUTING INFO  @PSM*/ 00382600
*         5 XVUD   BIT(1),        /* DISPLAY UD MESSAGES         @PSM*/ 00382700
*         5 XVFUDO BIT(1),        /* DISPLAY ONLY UD MESSAGES    @PSM*/ 00382800
*         5 XVFIDO BIT(1),        /* QUEUE BY ID ONLY            @PSM*/ 00382900
*         5 *      BIT(5),        /* RESERVED                    @PSM*/ 00383000
*/***************************************************************@PSA*/ 00383100
*   2 XVEMFLAG BIT(8),            /* EXTENDED MESSAGE HIGHLIGHTING      00383200
*                                    FLAGS                       @PAA*/ 00383300
*    3 XVEMCO  BIT(1),            /* COLOR CHANGE REQUEST        @PAA*/ 00383400
*    3 XVEMHI  BIT(1),            /* HIGHLIGHTING CHANGE REQUEST @PAA*/ 00383500
*    3 XVEMIN  BIT(1),            /* INTENSITY CHANGE REQUEST    @PAA*/ 00383600
*   2 XVCASEL  CHAR(1),           /* COLOR SPECIFICATION         @PAA*/ 00383700
*   2 XVHASEL  CHAR(1),           /* HIGHLIGHTING SPECIFICATION  @PAA*/ 00383800
*   2 XVIASEL  CHAR(1),           /* INTENSITY SPECIFICATION     @PAA*/ 00383900
*   2 XVRPYIB  FIXED(31),         /* BINARY REPLY ID             @D9C*/ 00384000
*   2 XVWTOWAA PTR(31),           /* IEAVVWTO WORK AREA ADDRESS  @02C*/ 00384100
*   2 XV604WAA PTR(31),           /* IEAVM604 WORK AREA ADDRESS  @D8A*/ 00384200
*   2 XV714WAA PTR(31),           /* IEAVG714 WORK AREA ADDRESS  @DAC*/ 00384300
*   2 XVSTCKTM BIT(32),           /* STCK FORM WQE TIME STAMP    @PJC*/ 00384400
*   2 XVFTOD   BIT(32),           /* AMRF FAILURE TIME           @PLC*/ 00384500
*   2 XVDSQN   FIXED(31),         /* DISPLAY SEQUENCE NUMBER     @DAA*/ 00384600
*   2 XVJESJNM CHAR(8),           /* JOB INFORMATION FOR JES     @PFA*/ 00384700
*   2 XVKQLST,                    /* K Q CONSOLE ID LIST         @PGA*/ 00384800
*    3 XVKQL1  FIXED(31),         /* K Q CONSOLE ID 1            @PGA*/ 00384900
*    3 XVKQL2  FIXED(31),         /* K Q CONSOLE ID 2            @PGA*/ 00385000
*   2 XVAUTOT  CHAR(8),           /* AUTOMATION TOKEN VALUE      @M2A*/ 00385100
*   2 XVRIDL   FIXED(8),          /* Length of reply ID (determined by  00385200
*                                    value of UCMRMAX at time reply ID  00385300
*                                    is obtained).               @MDA*/ 00385400
*   2 *        CHAR(7);           /* RESERVED                    @MDC*/ 00385500
*@EJECT;                                /*                   @ZA41986*/ 00385600
*/* THE FOLLOWING CONSTANTS ARE SET BY IEAVVWTO                  @L9C*/ 00385700
*/* IN THE SVC 35 EXTENDED SAVE AREA IN A D23                    @L9C*/ 00385800
*/* SITUATION. IMMEDIATELY BELOW ARE THE PROCESS CODES       @ZA41986*/ 00385900
*/* STORED INTO THE FIELD XVFNCT TO INDICATE THE PROCESS     @ZA41986*/ 00386000
*/* WHICH FAILED.                                            @ZA41986*/ 00386100
*DCL D23VALID  BIT(8) CONSTANT('10'X), /* D23 PARMLIST ERROR @ZA41986*/ 00386200
*    D23OREGC  BIT(8) CONSTANT('20'X), /* ORE GETCELL ERROR  @ZA41986*/ 00386300
*    D23OREBC  BIT(8) CONSTANT('21'X), /* ORE BLDCPOOL ERROR @ZA41986*/ 00386400
*    D23OREGM  BIT(8) CONSTANT('22'X), /* ORE GETMAIN FAILURE, SP231    00386500
*                                                            @ZA41986*/ 00386600
*    D23WQEGC  BIT(8) CONSTANT('30'X), /* WQE GETCELL ERROR  @G860P2G*/ 00386700
*    D23WQEBC  BIT(8) CONSTANT('31'X), /* WQE BLDCPOOL ERROR @G860P2G*/ 00386800
*    D23WQEGM  BIT(8) CONSTANT('32'X), /* WQE GETMAIN FAILURE, SP229    00386900
*                                                            @G860P2G*/ 00387000
*                                      /*                        @07D*/ 00387100
*    D23DYN    BIT(8) CONSTANT('42'X), /* DYNAMIC AREA GETMAIN          00387200
*                                         FAILURE                @LUC*/ 00387300
*    D23LWAIT  BIT(8) CONSTANT('50'X), /* FAILURE IN LOADWAIT    @LUA*/ 00387400
*    D23BESTR  BIT(8) CONSTANT('51'X), /* FAILURE IN OBTAINING BRANCH   00387500
*                                      ENTRY DYNAMIC STORAGE     @LUA*/ 00387600
*    D23VG715  BIT(8) CONSTANT('52'X), /* FAILURE IN IEAVG715    @LUA*/ 00387700
*    D23VG720  BIT(8) CONSTANT('53'X), /* FAILURE IN IEAVG720    @01C*/ 00387800
*    D23INTER  BIT(8) CONSTANT('99'X); /* INTERNAL FAILURE IN IEAVVWTO  00387900
*                                         OR IEAVMWTO            @01A*/ 00388000
*@SPACE;                               /*                    @ZA41986*/ 00388100
*/* THE FOLLOWING ARE THE MODULE ID'S INDICATING THE MODULE  @ZA41986*/ 00388200
*/* IN WHICH THE D23 ERROR OCCURRED. THEY ARE STORED INTO    @ZA41986*/ 00388300
*/* THE FIELD XVAMOD.                                        @ZA41986*/ 00388400
*DCL VWTOID    BIT(8) CONSTANT('01'X), /* IEAVVWTO'S ID      @ZA41986*/ 00388500
*    MWTOID    BIT(8) CONSTANT('02'X), /* IEAVMWTO'S ID          @L2C*/ 00388600
*    VH600ID   BIT(8) CONSTANT('03'X), /* IEAVH600'S ID          @L9C*/ 00388700
*    VM600ID   BIT(8) CONSTANT('04'X), /* IEAVM600'S ID          @LUC*/ 00388800
*    VMTOID    BIT(8) CONSTANT('05'X), /* IEAVBWTO'S ID          @DBC*/ 00388900
*    D23BLDWI  BIT(8) CONSTANT('06'X), /* BLWLDWT'S ID           @03C*/ 00389000
*    VBNLKID   BIT(8) CONSTANT('07'X), /* IEAVBNLK'S ID          @03A*/ 00389100
*    VBLWTID   BIT(8) CONSTANT('08'X); /* IEAVBLWT'S ID          @PSA*/ 00389200
*@SPACE;                               /*                    @ZA41986*/ 00389300
*/* THE FOLLOWING ARE THE REASON CODES STORED INTO XVREASON  @ZA41986*/ 00389400
*/* INDICATING WHY THE PROCESS FAILED.                       @ZA41986*/ 00389500
*DCL D23BNDY   BIT(8) CONSTANT('01'X), /* PARMLIST FOR WTOR NOT ON A    00389600
*                                          FULLWORD BOUNDARY @ZA41986*/ 00389700
*    D23MLWTR  BIT(8) CONSTANT('02'X), /* MULTILINE WTOR     @ZA41986*/ 00389800
*    D23PARM   BIT(8) CONSTANT('03'X), /* PARMLIST NOT ADDRESSABLE      00389900
*                                          BY USER           @ZA41986*/ 00390000
*    D23ZERO   BIT(8) CONSTANT('04'X), /*ZERO TEXT LGTH WTOR @ZA37220*/ 00390100
*    D23SIZE   BIT(8) CONSTANT('05'X), /*CALLER MODIFIED WPL            00390200
*                                      DURING WTO PROCESSING @ZA37220*/ 00390300
*    D23AUTH   BIT(8) CONSTANT('06'X), /*UNAUTHORIZED USER SPECIFIED    00390400
*                                      AUTHORIZED KEYWORD(S)     @L9A*/ 00390500
*    D23MUTX   BIT(8) CONSTANT('07'X), /*MUTUALLY EXCLUSIVE KEYWORDS    00390600
*                                      SPECIFIED ON WTO(R)       @L9A*/ 00390700
*    D23BADP   BIT(8) CONSTANT('08'X), /*INVALID PARM LIST              00390800
*                                      STRUCTURE                 @LHC*/ 00390900
*    D23TXT0   BIT(8) CONSTANT('09'X), /* ZERO TEXT ADDRESS             00391000
*                                         ON WTOR                @LUC*/ 00391100
*    D23STEXT  BIT(8) CONSTANT('0A'X), /* MORE THAN 14 LINES OF TEXT,   00391200
*                                       SYNCH=YES                @LUA*/ 00391300
*    D23WQEBK  BIT(8) CONSTANT('0B'X), /* WQE SPECIFIED WITH            00391400
*                                        SYNCH=YES OR NIP SVC 35 @LUA*/ 00391500
*    D23SWTOR  BIT(8) CONSTANT('0C'X), /* WTOR ISSUED WITH              00391600
*                                         SYNCH=NO               @LUA*/ 00391700
*    D23NWTOR  BIT(8) CONSTANT('0D'X), /* SVC 35 WTOR WITH MORE THAN    00391800
*                                         1 LINE                 @DBC*/ 00391900
*    D23DNHRR  BIT(8) CONSTANT('0E'X), /* DO NOT HOLD RESTART RESOURCE  00392000
*                                         THIS CPU               @DBA*/ 00392100
*    D23ACSNA  BIT(8) CONSTANT('0F'X), /* ACTION CODE STORAGE NOT       00392200
*                                         ACCESSABLE             @DBA*/ 00392300
*    D23BADV   BIT(8) CONSTANT('10'X), /* BAD VALUE FOUND IN WQE FOR    00392400
*                                         WQEBLK INVOKATION      @PKC*/ 00392500
*    D23BADCN  BIT(8) CONSTANT('11'X); /* CONSOLE NAME IS RESERVED OR   00392600
*                                         INCORRECT              @PKA*/ 00392700
*/* CONSTANT DECLARES FOR VERSION LEVELS                         @L9A*/ 00392800
*DCL XVVERN   FIXED(8) CONSTANT(XVS422); /* THE CURRENT LEVEL    @M2C*/ 00392900
*DCL XVS220   FIXED(8) CONSTANT(1);    /* LEVEL OS/VS2 JBB2220   @L9A*/ 00393000
*DCL XVS410   FIXED(8) CONSTANT(2);    /* LEVEL OS/VS2 HBB4410   @LFA*/ 00393100
*DCL XVS422   FIXED(8) CONSTANT(3);    /* LEVEL OS/VS2 JBB4422   @M2A*/ 00393200
*DCL XVNAME   CHAR(3)  CONSTANT('XV '); /* PARM LIST ACRONYM     @L9A*/ 00393300
*%CTML1: IF CTMWWB ~= 'YES' %THEN %GOTO CTML2;                          00393400
*      %ELSE %;                                                         00393500
*%INCLUDE SYSLIB(IHAWWB);               /* Include WWB mapping   @PPA*/ 00393900
*%CTML2: IF CTMDOMPL ~= 'YES' %THEN %GOTO CTML3;                        00397400
*        %ELSE %;                                                       00397500
*@EJECT;                                                                00397600
*%INCLUDE SYSLIB(IEZVM112);             /* Include DOMPL mapping @PPA*/ 00400300
*%CTML3: IF CTMXD ~= 'YES' %THEN %GOTO CTML4;                           00403100
*        %ELSE %;                                                       00403200
*@EJECT;                                                                00403300
*/********************************************************************/ 00403400
*/*                                                                  */ 00403500
*/*  XSDOM - EXTENDED SAVEAREA FOR XDOM (SVC 87)                     */ 00403600
*/*                                                                  */ 00403700
*/* COPYRIGHT  -                                             @G860P2G*/ 00403800
*/*               5740-XC6 COPYRIGHT IBM CORP 1981,                  */ 00403900
*/*               LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,        */ 00404000
*/*               REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER        */ 00404100
*/*               G120-2083.                                         */ 00404200
*/*                                                                  */ 00404300
*/* STATUS     -  OS/VS2 HBB2102                             @G860P2G*/ 00404400
*/*                                                                  */ 00404500
*/*  THE EXTENDED SAVEAREA IS A 48 BYTE AREA PROVIDED FOR SVCS       */ 00404600
*/*  AND IS IN THE SVRB AT RBEXSAVE. XSDOM DEFINES THE USE OF THE    */ 00404800
*/*  AREA FOR SVC 87 OR IEAVXDOM (THE DOM SERVICE ROUTINE).  @G860P2G*/ 00405000
*/*                                                                  */ 00405200
*/********************************************************************/ 00405400
* DECLARE                                                               00405600
*  1 XSDOM CHAR(48) DEFINED(RBEXSAVE) BDY(WORD),                        00405800
*    2 XSREG0      FIXED(31),     /* SAVE REG0 AT ENTRY TO PROGRAM   */ 00406000
*    2 XSREG1      PTR(31),       /* SAVE REG1 AT ENTRY TO PROGRAM   */ 00406200
*    2 XSREG14     PTR(31),       /* SAVE REG 14 AT ENTRY TO PROGRAM */ 00406400
*    2 *           CHAR(36);      /* RESERVED                @G860P2G*/ 00406600
*%CTML4: IF CTMCQE ~= 'YES' %THEN %GOTO CTML5;                          00406800
*        %ELSE %;                                                       00407000
*%INCLUDE SYSLIB(IEZVD001);             /* Include CQE mapping   @PRA*/ 00407100
*@EJECT;                                                                00407200
*%CTML5: IF CTMCXSA ~= 'YES' %THEN %GOTO CTML6;                         00415600
*        %ELSE %;                                                       00415800
*%INCLUDE SYSLIB(IEZVD002);             /* Include CXSA mapping  @PRA*/ 00415900
*@EJECT;                                                                00416000
*%CTML6: IF CTMQR0 ~= 'YES' %THEN %GOTO CTML7;                          02738500
*        %ELSE %;                                                       02788500
*@EJECT;                                                                02838500
*/********************************************************************/ 02888500
*/*                                                                  */ 02938500
*/*    QR0                                                           */ 24200002
*/*                                                                  */ 24250002
*/*    IEAVMQR0 PARAMETER LIST                                       */ 24300074
*/*  OS/VS2 RELEASE 3.8                                      @ZA41986*/ 24350000
*/*                                                                  */ 24400002
*/*  METHOD OF ACCESS                                                */ 24450002
*/*    BAL - CODE THE FOLLOWING:  IHACTM  QR0                        */ 24500002
*/*    PL/S - 1. DECLARE THE MACRO CHARACTER VARIABLE CTMQR0.        */ 24550002
*/*           2. SET CTMQR0 EQUAL TO 'YES'                           */ 24600002
*/*           3. %INCLUDE  SYSLIB(IHACTM)                            */ 24650002
*/*           4. DCL QR0PPTR.                                        */ 24700002
*/*  FUNCTION                                                        */ 24750002
*/*    THE QR0 PARAMETER LIST IS INITIALIZED BY IEAVMWSV             */ 24800074
*/*    AND USED AS INPUT TO IEAVMQR0.                                */ 24850002
*/*                                                                  */ 24900002
*/********************************************************************/ 24950002
*DCL  1 QR0PARMS BASED(QR0PPTR),                                        25000002
*       2 QR0WQE CHAR(4) BDY(WORD),    /* WQE ADDRESS.               */ 25050002
*         3 QR0WQEB BIT(8),            /* UNUSED                     */ 25100002
*         3 QR0WQEA PTR(24),           /* WQE ADDRESS                */ 25150074
*       2 QR0UCME PTR(31),             /* UCME ADDRESS.              */ 25200002
*       2 QR0UCM PTR(31),              /* UCM ADDRESS.               */ 25250002
*       2 QR0CMQCN PTR(31);            /* ADDRESS OF IEECMQCN RTN    */ 25300002
*%CTML7: IF CTMFTPT ~= 'YES' %THEN %GOTO CTML8;                         25350002
*        %ELSE %;                                                       25400002
*%INCLUDE SYSLIB(IEZVR001);            /* Include FTPT mapping   @PRA*/ 25450000
*%CTML8: IF CTMCQB ~= 'YES' %THEN %GOTO CTML9; /*            @G741PSS*/ 27100074
*        %ELSE %;                   /*                       @G741PSS*/ 27110074
*@EJECT;                            /*                       @G741PSS*/ 27120074
*/********************************************************************/ 27130074
*/*                                                          @G741PSS*/ 27140074
*/*      CQB  - COMMAND QUEUE BUFFER MAPPING                 @G741PSS*/ 27150074
*/*                                                          @G741PSS*/ 27160074
*/* COPYRIGHT   =                                                @LEC*/ 27160100
*/*               5647-A01                                       @0GC*/ 27160240
*/*               RESTRICTED MATERIALS OF IBM                    @LKC*/ 27160300
*/*               (C) COPYRIGHT IBM CORPORATION 1979, 2001       @0GC*/ 27160440
*/*               LICENSED MATERIALS - PROPERTY OF IBM           @LKC*/ 27160500
*/*                                                                  */ 27160600
*/* STATUS      = HBB7703                                        @0GC*/ 27160740
*/*                                                              @LKC*/ 27160800
*/*                                                          @G741PSS*/ 27160900
*/*      METHOD OF ACCESS                                    @G741PSS*/ 27161000
*/*        BAL  - CODE THE FOLLOWING:  IHACTM CQB            @G741PSS*/ 27161100
*/*        PL/S - 1. DECLARE MACRO CHARACTER VARIABLE CTMCQB @G741PSS*/ 27161200
*/*               2. SET CTMCQB EQUAL TO 'YES'               @G741PSS*/ 27161300
*/*               3. %INCLUDE SYSLIB(IHACTM)                 @G741PSS*/ 27161400
*/*               4. DECLARE CQBPTR                          @G741PSS*/ 27161500
*/*                                                          @G741PSS*/ 27161600
*/*        IF THE COMMAND WAS INVOKED VIA THE MGCRE PARAMETER    @LKA*/ 27162000
*/*        LIST, THEN A MAPPING OF THE MGCRE NEEDS TO BE         @LKA*/ 27162400
*/*        GENERATED AND SHOULD BE BASED ON THE ADDRESS OF       @LKA*/ 27162800
*/*        CQBSVCHD.  THE AMOUNT OF STORAGE TO BE OBTAINED WOULD @LKA*/ 27163200
*/*        BE GETMAINED ACCORDING TO THE FOLLOWING ALGORITHMS:   @LKA*/ 27163600
*/*                                                              @LKA*/ 27164000
*/*        BAL -                                                 @LKA*/ 27164400
*/*           LENGTH = CQBHSIZE + MGCESZE1 + MGCESZE2            @LKA*/ 27164800
*/*                                                              @LKA*/ 27165200
*/*        PL/S OR PLAS -                                        @LKA*/ 27165600
*/*           LENGTH = OFFSET(CQBSVCHD) +                        @LKA*/ 27166000
*/*                    LENGTH(MGCEPL) +                          @LKA*/ 27166400
*/*                    LENGTH(MGCETEXT)                          @LKA*/ 27166800
*/*                                                              @LKA*/ 27167200
*/*        OTHERWISE, IF THE COMMAND WAS INVOKED VIA THE OLD     @LKA*/ 27167600
*/*        MGCR, THEN THE LENGTH TO GETMAIN WOULD BE JUST THE    @LKA*/ 27168000
*/*        LENGTH OF THE CQB.                                    @LKA*/ 27168400
*/*                                                              @LKA*/ 27168800
*/*      FUNCTION                                            @G741PSS*/ 27169200
*/*        THE COMMAND QUEUE BUFFER IS USED TO CONTAIN A     @G741PSS*/ 27169600
*/*        COMMAND FOR THE COMM TASK TO ISSUE. THIS IS       @G741PSS*/ 27170000
*/*        NECESSARY IF THE COMMAND MUST EXECUTE UNDER COMM  @G741PSS*/ 27170400
*/*        TASK'S TCB BUT THE COMMAND WAS ISSUED UNDER A     @G741PSS*/ 27170800
*/*        TCB WHICH IS DIFFERENT FROM COMM TASKS. A MODULE  @G741PSS*/ 27171200
*/*        WHICH NEEDS THIS FACILITY CALLS MODULE IEAVC700   @G741PSS*/ 27171600
*/*        TO BUILD THE CQB AND CHAIN IT TO THE              @G741PSS*/ 27172000
*/*        UCM (UCMCMDPT).                                   @G741PSS*/ 27172400
*/*                                                          @G741PSS*/ 27172800
*/********************************************************************/ 27173200
* DCL 1 CQB            BASED(CQBPTR) BDY(WORD),/* MAPS A CQB ENTRY      27173600
*                                                            @G741PSS*/ 27174000
*       3 CQBID        CHAR(4),     /* ACRONYM 'CQB '        @G741PSS*/ 27174400
*       3 CQBLINK      PTR(31),     /* ADDRESS OF NEXT ENTRY @G741PSS*/ 27174800
*       3 CQBSRC       FIXED(31),   /* CONTENTS OF REGISTER 0 WHEN THE  27175200
*                                      CMD IS RE-ISSUED (SOURCE CONSOLE 27175600
*                                      ID)                   @G741PSS*/ 27176000
*       3 CQBINFLG     FIXED(16),   /* INTERNAL FLAG FIELDS  @G741PSS*/ 27176400
*         5 CQBINFG1   BIT(8),      /* FIRST INTERNAL FLAG FIELD        27176800
*                                                            @G741PSS*/ 27177200
*           7 CQBISSED BIT(1),      /* COMMAND WAS ISSUED BY COMM TASK  27177600
*                                                            @G741PSS*/ 27178000
*           7 CQBMGCRE BIT(1),      /* COMMAND WAS PROCESSED BY MGCRE   27178400
*                                                                @LKA*/ 27178800
*           7 *        BIT(6),      /* RESERVED                  @LKC*/ 27179200
*         5 CQBINFG2   BIT(8),      /* SECOND INTERNAL FLAG FIELD       27179600
*                                      - RESERVED            @G741PSS*/ 27180000
*       3 CQBASID      FIXED(16),   /* ASID of original issuer   @0GC*/ 27180490
*       3 CQBJBNM      CHAR(8),    /* JOBNAME of original issuer @0GA*/ 27180580
*       3 CQBSVCHD,                 /* TEXT HEADER FOR SVC 34           27180800
*                                                            @G741PSS*/ 27181200
*/********************************************************************/ 27181600
*/*    THE REMAINING PORTION OF THIS CONTROL BLOCK IS            @LKA*/ 27182000
*/*    REFERENCED ONLY WHEN THE OLD MGCR PARAMETER LIST WAS      @LKA*/ 27182400
*/*    USED TO ISSUE THE SVC 34.                                 @LKA*/ 27182800
*/*                                                              @LKA*/ 27183200
*/*    IF THE MGCRE PARAMETER LIST WAS USED TO ISSUE THE SVC 34, @LKA*/ 27183600
*/*    THEN BASE THE MGCRE PARAMETER LIST ON CQBSVCHD AND        @LKA*/ 27184000
*/*    PROCEED TO FILL IN THE MGCRE CONTROL BLOCK.               @LKA*/ 27184400
*/********************************************************************/ 27184800
*         5 CQBIND     BIT(8),      /* INDICATORS            @G741PSS*/ 27185200
*           7 CQBFI    BIT(1),      /* FLAG INDICATOR. IF ON, THE FLAG  27185600
*                                      BYTES ARE VALID       @G741PSS*/ 27186000
*           7 CQBRVB2  BIT(1),      /* RESERVED              @G741PSS*/ 27186400
*           7 CQBRVB3  BIT(1),      /* RESERVED              @G741PSS*/ 27186800
*           7 CQBRVB4  BIT(1),      /* RESERVED              @G741PSS*/ 27187200
*           7 CQBRVB5  BIT(1),      /* RESERVED              @G741PSS*/ 27187600
*           7 CQBRVB6  BIT(1),      /* RESERVED              @G741PSS*/ 27188000
*           7 CQBRVB7  BIT(1),      /* RESERVED              @G741PSS*/ 27188400
*           7 CQBRVB8  BIT(1),      /* RESERVED              @G741PSS*/ 27188800
*         5 CQBLEN       FIXED(8),  /* LENGTH OF TEXT PLUS 4 BYTE       27189200
*                                      HEADER                @G741PSS*/ 27189600
*         5 CQBFLGS      FIXED(16), /* COMMAND FLAGS         @G741PSS*/ 27190000
*           7 CQBFLG1    BIT(8),    /* 1ST FLAG BYTE         @G741PSS*/ 27190400
*             9 CQBFLG11 BIT(1),    /* RESERVED              @G741PSS*/ 27190800
*             9 CQBFLG12 BIT(1),    /* COMMAND ISSUED BY SUBSYSTEM      27191200
*                                                            @G741PSS*/ 27191600
*             9 CQBFLG13 BIT(1),    /* COMMAND ISSUED VIA IEAVC700      27192000
*                                                            @G741PSS*/ 27192400
*             9 CQBFLG14 BIT(1),    /* COMMAND SHOULD NOT BE            27192800
*                                      HARDCOPIED            @G741PSS*/ 27193200
*             9 CQBFLG15 BIT(1),    /* INPUT TOKEN               @L4C*/ 27193600
*             9 CQBFLG16 BIT(1),    /* RESERVED              @G741PSS*/ 27194000
*             9 CQBFLG17 BIT(1),    /* RESERVED              @G741PSS*/ 27194400
*             9 CQBFLG18 BIT(1),    /* RESERVED              @G741PSS*/ 27194800
*           7 CQBFLG2    BIT(8),    /* 2ND FLAG BYTE             @LEC*/ 27195200
*             9 CQBFLG19 BIT(1),    /* RESERVED                  @LEA*/ 27195600
*             9 CQBFLG20 BIT(1),    /* RESERVED                  @LEA*/ 27196000
*             9 CQBFLG21 BIT(1),    /* RESERVED                  @LEA*/ 27196400
*             9 CQBFLG22 BIT(1),    /* RESERVED                  @LEA*/ 27196800
*             9 CQBFLG23 BIT(1),    /* CQBUTOK CONTAINS A UTOKEN @LEA*/ 27197200
*             9 CQBFLG24 BIT(1),    /* RESERVED                  @LEA*/ 27197600
*             9 CQBFLG25 BIT(1),    /* RESERVED                  @LEA*/ 27198000
*             9 CQBFLG26 BIT(1),    /* RESERVED                  @LEA*/ 27198400
*       3 CQBCMD       CHAR(126),   /* COMMAND TEXT              @L4C*/ 27198800
*       3 CQBTOKEN     CHAR(4),     /* INPUT TOKEN               @LEC*/ 27199200
*       3 CQBRSRV1     FIXED(15);   /* RESERVED                  @P9C*/ 27199600
*/********************************************************************/ 27200000
*/*   THE FOLLOWING FIELD IS TO ADDRESS THE UTOKEN STORAGE THAT  @LEA*/ 27200400
*/*    IS GETMAINED BY MODULE IEAVC700.                          @LEA*/ 27200800
*/********************************************************************/ 27201200
* DCL CQBUTOK CHAR(*) BASED(CQBPTR+LENGTH(CQB));  /* UTOKEN      @LEA*/ 27201600
*%CTML9: IF CTMAMRQ ~= 'YES' %THEN %GOTO CTML10; /*          @G741PSS*/ 27202000
*        %ELSE %;                   /*                       @G741PSS*/ 27202400
*@EJECT;                            /*                       @G741PSS*/ 27202800
*/********************************************************************/ 27203200
*/*                                                          @G741PSS*/ 27203600
*/*      AMRQ - ACTION MESSAGE RETENTION QUEUE MAPPING       @G741PSS*/ 27204000
*/*                                                          @G741PSS*/ 27204400
*/* COPYRIGHT   =                                            @G741PSS*/ 27204800
*/*               5740-XE1 COPYRIGHT IBM CORP 1979,                  */ 27210274
*/*               LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,        */ 27210374
*/*               REFER TO COPYRIGHT INSTRUCTIONS FORM               */ 27210674
*/*               NUMBER G120-2083.                                  */ 27210874
*/*                                                                  */ 27211074
*/* STATUS      = MVS/SYSTEM  EXTENSIONS RELEASE 2           @G741PSS*/ 27211274
*/*               04/14/78  LEVEL=01                         @G741PSS*/ 29061274
*/*                                                          @G741PSS*/ 29111274
*/*      METHOD OF ACCESS                                    @G741PSS*/ 29161274
*/*        BAL  - CODE THE FOLLOWING:  IHAWQE                @G741PSS*/ 29211274
*/*                                    IHACTM AMRQ           @G741PSS*/ 29261274
*/*        PL/S - 1. DECLARE MACRO CHARACTER VARIABLE        @G741PSS*/ 29311274
*/*                  CTMAMRQ                                 @G741PSS*/ 29361274
*/*               2. SET CTMAMRQ EQUAL TO 'YES'              @G741PSS*/ 29411274
*/*               3. %INCLUDE SYSLIB(IHAWQE)                 @G741PSS*/ 29461274
*/*               4. %INCLUDE SYSLIB(IHACTM)                 @G741PSS*/ 29511274
*/*               5. DECLARE AMRQPTR                         @G741PSS*/ 29561274
*/*      FUNCTION                                            @G741PSS*/ 29611274
*/*        THE ACTION MESSAGE RETENTION QUEUE ENTRY CONTAINS @G741PSS*/ 29661274
*/*        THE RETAINED ACTION MESSAGE WQE.                  @G741PSS*/ 29711274
*/*                                                          @G741PSS*/ 29761274
*/*      NOTE: THE WQE MUST BE MAPPED VIA MACRO IHAWQE FOR   @G741PSS*/ 29811274
*/*        THE AMRQ TO BE DEFINED PROPERLY.                  @G741PSS*/ 29861274
*/*                                                          @G741PSS*/ 29911274
*/********************************************************************/ 29961274
* DCL 1 AMRQENTY   BASED(AMRQPTR) BDY(WORD),/* MAPS ENTRY ON ACTION     30011274
*                                      MSG RETENTION Q       @G741PSS*/ 30061274
*       3 AMRQLINK PTR(31),         /* ADDRESS OF NEXT ENTRY ON QUEUE   30111274
*                                                            @G741PSS*/ 30161274
*       3 AMRQNTYP PTR(31),         /* ADDRESS OF NEXT ENTRY THAT IS    30211274
*                                      THE SAME TYPE AS THIS ENTRY      30261274
*                                                            @G741PSS*/ 30311274
*       3 AMRQPTYP PTR(31),         /* ADDRESS OF PREVIOUS ENTRY THAT   30361274
*                                      IS THE SAME TYPE AS THIS         30411274
*                                      ENTRY                 @G741PSS*/ 30461274
*       3 AMRQWQE  CHAR(LENGTH(WQE));/* THE RETAINED MESSAGE. THIS      30511274
*                                      FIELD IS MAPPED BY MACRO IHAWQE  30561274
*                                                            @G741PSS*/ 30611274
*%CTML10: IF CTMDCPL ~= 'YES' %THEN %GOTO CTML11; /*             @L5A*/ 30661200
*         %ELSE %;                   /*                          @L5A*/ 30711200
*@EJECT;                                                                30761200
*/********************************************************************/ 30811200
*/*                                                                  */ 30861200
*/*01* NAME = DISPLAY CONSOLES PARAMETER LIST MAPPING            @L5A*/ 30911200
*/*                                                                  */ 30961200
*/*01* PROPRIETARY STATEMENT=                                        */ 30961400
*/***PROPRIETARY_STATEMENT********************************************/ 30961600
*/*                                                                  */ 30961800
*/*                                                                  */ 30961900
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 30962000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 30962100
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1979, 1998                      */ 30962200
*/*                                                                  */ 30962400
*/* STATUS= HBB6606                                                  */ 30962500
*/*                                                                  */ 30962600
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 30962700
*/*                                                                  */ 30962800
*/*01* FUNCTION         = PARAMETER LIST AND CONSENT TABLE FOR   @LAC*/ 30962900
*/*                       THE DISPLAY CONSOLES COMMAND PROCESSOR @L5A*/ 30963000
*/*                       USED TO PASS THE NECESSARY INFORMATION @L5A*/ 30963100
*/*                       BETWEEN IEECB813, IEEXEDNA, IEECB814   @D4C*/ 30963200
*/*                       AND IEECB821.                          @D4C*/ 30963300
*/*                                                                  */ 30963400
*/*01* METHOD OF ACCESS = THIS MAPPING SERVES AS AN INTERFACE    @L5A*/ 30963500
*/*                       BETWEEN MODULES IEECB813, IEEXEDNA,    @D4C*/ 30963600
*/*                       IEECB814 AND IEECB821.                 @D4C*/ 30963700
*/*                       THE ONLY OPTION FOR THE MAPPING IS     @L5A*/ 30963800
*/*                       NON-BASED.                             @L5A*/ 30963900
*/*                       THE MAPPING WILL CORRESPOND WITH THE   @L5A*/ 30964000
*/*                       PARAMETER PASSED BY IEECB813, IEECB814 @D4C*/ 30964100
*/*                       AND IEECB821.                          @D4C*/ 30964200
*/*                                                                  */ 30964300
*/*                PL/S - 1. DECLARE MACRO CHARACTER VARIABLE    @L5A*/ 30964400
*/*                          CTMDCPL                             @L5A*/ 30964500
*/*                       2. SET CTMDCPL EQUAL TO 'YES'          @L5A*/ 30964600
*/*                       3. %INCLUDE SYSLIB(IHACTM)             @L5A*/ 30964700
*/*                                                                  */ 30964800
*/*                                                                  */ 30964900
*/*01* CREATED BY       = IEECB813                               @L5A*/ 30965000
*/*                                                                  */ 30965100
*/*01* POINTED TO BY    = REGISTER 1 POINTS TO THE ADDRESS OF    @L5A*/ 30965200
*/*                       THE DCPL WHEN IEEXEDNA, IEECB814 AND   @D4C*/ 30965300
*/*                       IEECB821 ARE CALLED.                   @D4C*/ 30965400
*/*                                                                  */ 30965500
*/*01* SERIALIZATION    = NONE                                   @L5A*/ 30965600
*/*                                                                  */ 30965700
*/*01* LOCATION         = SUBPOOL 0, ABOVE THE 16M LINE          @L5A*/ 30965800
*/*                                                                  */ 30965900
*/********************************************************************/ 30966000
* DCL 1 DCPL BDY(WORD),             /* D C PARM LIST             @L5A*/ 30966100
*      3 DCPLID CHAR(4),            /* CONTROL BLOCK ID 'DCPL'   @L5A*/ 30966200
*      3 DCPLCMPL PTR(31),          /* POINTER TO THE CMPL       @L5A*/ 30966300
*      3 DCPLVERN FIXED(8),         /* VERSION NUMBER            @L5A*/ 30966400
*      3 DCPLFUNC  BIT(8),          /* INDICATES FUNCTIONS TO           30966500
*                                      PERFORM                   @L5A*/ 30966600
*        5 DCPLLABL BIT(1),         /* INSERT LABEL LINE         @L5A*/ 30966700
*        5 DCPLNCIL BIT(1),         /* INSERT RANGE LABEL LINE   @L5A*/ 30966800
*        5 DCPLERSW BIT(1),         /* INDICATE AN ERROR CONDITION      30966900
*                                      EXISTS                    @L5A*/ 30967000
*        5 DCPLNONE BIT(1),         /* 'RC=NONE'                 @L5A*/ 30967100
*        5 DCPLALL  BIT(1),         /* 'RC=ALL"                  @L5A*/ 30967200
*        5 *        BIT(3),         /* RESERVED                  @L5A*/ 30967300
*/********************************************************************/ 30967400
*/*                                                                  */ 30967500
*/*    PARAMETER-ISSUED BIT STRING (PIBS)                        @L5A*/ 30967600
*/*                                                                  */ 30967700
*/*    THE  BIT STRING SERVES TWO PURPOSES. FIRST                @L5A*/ 30967800
*/*    IT IS USED TO DETERMINE IF THE PARAMETERS IN THE          @L5A*/ 30967900
*/*    COMMAND HAVE BEEN USED IN A VALID COMBINATION.  IT        @L5A*/ 30968000
*/*    IS THEN USED TO INDICATE TO THE PARM PROCESSING           @L5A*/ 30968100
*/*    ROUTINE IN IEEXEDNA, WHICH PARAMETERS WERE SPECIFIED.     @LAC*/ 30968200
*/*                                                                  */ 30968300
*/********************************************************************/ 30968400
*      3 DCPLPIBS BIT(32),          /* PARM ISSUED BIT STRING    @MGC*/ 30968500
*       5 DCPLPOS   BIT(16),        /* BYTES OF POSITIONAL PARMS @LAC*/ 30968600
*        7 DCPLPOS1 BIT(8),         /* FIRST BYTE OF POSITIONALS @LAA*/ 30968700
*         9 DCPLACTV BIT(1),        /* ACTIVE FLAG (A)           @LAC*/ 30968800
*         9 DCPLINAC BIT(1),        /* INACTIVE FLAG (N)         @LAC*/ 30968900
*         9 DCPLSUBS BIT(1),        /* SUBSYSTEM FLAG (S)        @LAC*/ 30969000
*         9 DCPLLST  BIT(1),        /* LIST FLAG (LIST)          @LAC*/ 30969100
*         9 DCPLBKLG BIT(1),        /* BACKLOG FLAG (B)          @LAC*/ 30969200
*         9 DCPLISSU BIT(1),        /* ISSUING CONSOLE (*)       @LAC*/ 30969300
*         9 DCPLMSTR BIT(1),        /* MASTER FLAG (M)           @LAC*/ 30969400
*         9 DCPLHOLY BIT(1),        /* HCONLY FLAG (HCONLY)      @LAC*/ 30969500
*        7 DCPLPOS2 BIT(8),         /* SECOND BYTE OF POS PARMS  @LAA*/ 30969600
*         9 DCPLHCPY BIT(1),        /* HARDCOPY FLAG (HC)        @LAA*/ 30969700
*         9 DCPLMOLY BIT(1),        /* MASTER CONSOLE ONLY       @MGA*/ 30969800
*         9 *        BIT(6),        /* RESERVED POSITIONAL BITS  @MGC*/ 30969900
*       5 DCPLKWDS  BIT(16),        /* KEYWORD PARMS             @MGC*/ 30970000
*        7 DCPLCONS BIT(1),         /* CONSOLE FLAG (CN=)        @L5A*/ 30970100
*        7 DCPLUNIT BIT(1),         /* DEVICE NUMBER FLAG (U=)   @L5A*/ 30970200
*        7 DCPLRTCD BIT(1),         /* ROUTING CODE FLAG (RC=)   @L5A*/ 30970300
*        7 DCPLCAEQ BIT(1),         /* CONSOLE ASSOCIATION FLAG         30970400
                                       (CA=)                     @LIC*/ 30970500
*        7 DCPLCA   BIT(1),         /* CONSOLE ASSOCIATION FLAG         30970600
                                       (CA)                      @LIA*/ 30970700
*        7 DCPLKYEQ BIT(1),         /* CONSOLE KEY FLAG (KEY=)   @D5C*/ 30970800
*        7 DCPLKY   BIT(1),         /* CONSOLE KEY FLAG (KEY)    @D5C*/ 30970900
*        7 DCPLMAKY BIT(1),         /* MASTER AUTHORITY (MSTR)   @0EC*/ 30971000
*        7 DCPLSYN  BIT(1),         /* SYSTEM NAME (SYS=)        @MGA*/ 30971100
*        7 *        BIT(7),         /* RESERVED POSITIONAL BITS  @MGA*/ 30971200
*@EJECT;                            /*                           @LAA*/ 30971300
*/********************************************************************/ 30971400
*/*  SYSTEM CONTROL FLAGS, SDS FLAGS AND MISC BITS               @LAA*/ 30971500
*/********************************************************************/ 30971600
*      3 DCPLSYS BIT(8),            /* SYSTEM CONTROL FLAGS      @LAA*/ 30971700
*       5 *        BIT(1),          /* RESERVED                  @LAA*/ 30971800
*       5 DCPLSYSB BIT(1),          /* HARDCOPY REQUIRED FLAG    @LAA*/ 30971900
*       5 DCPLSYSC BIT(1),          /* COMMANDS TO SYSLOG HARDCPY       30972000
*                                      FLAG                      @LFC*/ 30972100
*       5 *        BIT(1),          /* RESERVED                  @LAA*/ 30972200
*       5 *        BIT(1),          /* RESERVED                  @LAA*/ 30972300
*       5 DCPLSYSF BIT(1),          /* DISPLAY CONSOLE FLAG      @LAA*/ 30972400
*       5 DCPLSYSG BIT(1),          /* SYSLOG INDICATOR          @LAA*/ 30972500
*       5 *        BIT(1),          /* RESERVED                  @LAA*/ 30972600
*      3 DCPLSDS BIT(8),            /* SDS FLAGS                 @LAA*/ 30972700
*       5 DCPLSDSA BIT(1),          /* STCMDS TO SYSLOG HARDCPY         30972800
*                                      FLAG                      @LFC*/ 30972900
*       5 DCPLSDSB BIT(1),          /* INCMDS TO SYSLOG HARDCPY         30973000
*                                      FLAG                      @LFC*/ 30973100
*       5 DCPLSDSC BIT(1),          /* STCMDS TO CONSOLE HARDCPY        30973200
*                                      FLAG                      @LFC*/ 30973300
*       5 DCPLSDSD BIT(1),          /* INCMDS TO CONSOLE HARDCPY        30973400
*                                      FLAG                      @LFC*/ 30973500
*       5 DCPLSDSE BIT(1),          /* CMDS TO CONSOLE HARDCPY          30973600
*                                      FLAG                      @LFC*/ 30973700
*       5 *        BIT(3),          /* RESERVED                  @LFC*/ 30973800
*      3 DCPLMISC BIT(8),           /* MISCELLANEOUS FLAGS       @LAA*/ 30973900
*       5 DCPLDOHC BIT(1),          /* PRINT HARDCOPY LINE FLAG  @LAA*/ 30974000
*       5 DCPLNORC BIT(1),          /* ROUTE CODES NOT ASSIGNED TO      30974100
*                                      ANY CONSOLE FLAG          @LAA*/ 30974200
*       5 DCPLNOBC BIT(1),          /* BROADCAST MESSAGES NOT ASSIGNED  30974300
*                                      TO ANY CONSOLE FLAG       @LAA*/ 30974400
*       5 DCPLSUB BIT(1),           /* SUBSYSTEM CONSOLE EXISTS FLAG    30974500
*                                                                @LAA*/ 30974600
*       5 DCPLHCUD BIT(1),          /* UD TO HARDCOPY FLAG       @DDA*/ 30974700
*       5 DCPLOPSA BIT(1),          /* OPERLOG ACTIVE FLAG       @MEA*/ 30974800
*       5 *        BIT(2),          /* RESERVED                  @MEC*/ 30974900
*/********************************************************************/ 30975000
*/*                                                                  */ 30975100
*/*  COUNTERS AND MISCELLANEOUS INFORMATION                      @LAA*/ 30975200
*/*                                                                  */ 30975300
*/********************************************************************/ 30975400
*      3 DCPLUCNT FIXED(31),        /* COUNT OF NON-CONSOLE DEVICE      30975500
*                                      NUMBERS                   @L5A*/ 30975600
*      3 DCPLCCNT FIXED(31),        /* COUNT OF CONSOLE ID'S     @L5A*/ 30975700
*      3 DCPLXCNT FIXED(31),        /* COUNT OF EXT MCS CONSOLES @D4A*/ 30975800
*      3 DCPLCONP PTR(31),          /* ADDRESS OF CONSENT ARRAY         30975900
*                                      OR CASENT ARRAY           @LIC*/ 30976000
*      3 DCPLMCUR FIXED(15),        /* TOTAL WQE COUNT           @LAA*/ 30976100
*      3 DCPLMLMT FIXED(15),        /* MESSAGE LIMIT             @LAA*/ 30976200
*      3 DCPLRCUR FIXED(15),        /* CURRENT ORE COUNT         @LAA*/ 30976300
*      3 DCPLRLMT FIXED(15),        /* CURRENT ORE LIMIT         @LAA*/ 30976400
*      3 DCPLPFK  CHAR(2),          /* SUFFIX OF PFK TABLE       @LAA*/ 30976500
*      3 DCPLWCNT FIXED(15),        /* HARDCOPY'S TOTAL WQE'S    @LAA*/ 30976600
*      3 DCPLHUCM FIXED(15),        /* HARDCOPY INDEX IN CONSENT TABLE  30976700
*                                                                @LAA*/ 30976800
*      3 DCPLCON  FIXED(15),        /* NUMBER OF ENTRIES EXISTING IN    30976900
*                                      CONSENT OR CASENT ARRAY   @LIC*/ 30977000
*      3 DCPLHCRC BIT(128),         /* CONSOLE HARDCOPY ROUTING CODES   30977100
                                                                 @LFC*/ 30977200
*      3 DCPLMASK BIT(128),         /* DETECTION OF ROUTE CODES LOST    30977300
*                                      STORAGE                   @LAA*/ 30977400
*      3 DCPLFMT  CHAR(7),          /* FORMAT OF HARDCOPY LOG           30977500
*                                      (MACHINE OR PRINTABLE)    @LFA*/ 30977600
*      3 DCPLXWTR CHAR(8),          /* EXTERNAL WRITER NAME      @LFA*/ 30977700
*      3 DCPLHCSL BIT(128),         /* ROUTING CODES FOR SYSLOG  @LFA*/ 30977800
*      3 DCPLSYSN CHAR(8),          /* SYS= value if specified   @MGA*/ 30978000
*@EJECT;                                                                30978100
*/********************************************************************/ 30978200
*/*                                                                  */ 30978300
*/*    NON-CONSOLE DEVICE NUMBER ARRAY (DCPLNCIA)                @L5A*/ 30978400
*/*                                                                  */ 30978500
*/*    THE FOLLOWING ARRAY WILL CONTAIN A LIST OF DEVICE         @L5A*/ 30978600
*/*    NUMBERS THAT WERE SPECIFIED BUT ARE NOT CONSOLES.         @L5A*/ 30978700
*/*    THIS INFORMATION WILL BE USED, TO ENTER                   @L5A*/ 30978800
*/*    INTO THE DISPLAY THOSE DEVICES WHICH ARE NOT              @L5A*/ 30978900
*/*    CONSOLES. THERE ARE 29 ENTRIES IN THE ARRAY BECAUSE THAT  @L5A*/ 30979000
*/*    IS THE MAXIMUM NUMBER OF DEVICE NUMBERS THAT CAN BE       @L5A*/ 30979100
*/*    SPECIFIED IN THE COMMAND TEXT, ASSUMING A MAXIMUM BUFFER  @L5A*/ 30979200
*/*    LENGTH OF 124 CHARACTERS.                                 @L5A*/ 30979300
*/*                                                                  */ 30979400
*/********************************************************************/ 30979500
*      3 DCPLNCIA(29) CHAR(4),      /* ARRAY OF NON CONSOLE DEVICE      30979600
*                                      NUMBERS                   @L5A*/ 30979700
*/********************************************************************/ 30979800
*/*                                                                  */ 30979900
*/*    UCME ADDRESS ARRAY (DCPLUCMA)                             @L5A*/ 30980000
*/*                                                                  */ 30980100
*/*    THE FOLLOWING ARRAY WILL CONTAIN A LIST OF THE            @L5A*/ 30980200
*/*    UCME ADDRESSES WHICH  WILL BE SEARCHED.                   @L5A*/ 30980300
*/*    THIS ARRAY WILL SERVE AS INPUT TO THE GETDATA ROUTINE     @L5A*/ 30980400
*/*    WITHIN IEEXEDNA. ONLY THE STATUS OF THE UCME'S WITHIN     @L5A*/ 30980500
*/*    THIS LIST WILL APPEAR IN THE DISPLAY.                     @L5A*/ 30980600
*/*    DCPLUCMA IS DEPENDENT ON THERE BEING NO MORE THAN 99      @L5A*/ 30980700
*/*    CONSOLES SYSGENED IN THE SYSTEM.  IF THE MAXIMUM          @L5A*/ 30980800
*/*    NUMBER OF CONSOLES IS CHANGED THE SIZE OF THE ARRAY       @L5A*/ 30980900
*/*    (DCPLCNSL) MUST BE UPDATED TO REFLECT THE CHANGE          @L5A*/ 30981000
*/*                                                                  */ 30981100
*/********************************************************************/ 30981200
*      3 DCPLUCMA(DCPLCNSL) PTR(31),     /* UCME ADDRESS ARRAY   @L5A*/ 30981300
*      3 *        CHAR(4),               /* RESERVED             @MBC*/ 30981400
*/********************************************************************/ 30981500
*/*                                                                  */ 30981600
*/*    ODTE ADDRESS ARRAY (DCPLODTE)                             @D4A*/ 30981700
*/*                                                                  */ 30981800
*/*    THIS ARRAY IS ONLY USED FOR MXTENDED MCS CONSOLES.        @D4A*/ 30981900
*/*    THE FOLLOWING ARRAY WILL CONTAIN A LIST OF THE            @D4A*/ 30982000
*/*    ODTE ADDRESSES WHICH  WILL BE SEARCHED.                   @D4A*/ 30982100
*/*    THIS ARRAY WILL SERVE AS INPUT TO THE ODTEDATA ROUTINE    @D4A*/ 30982200
*/*    WITHIN IEEXEDNA. ONLY THE STATUS OF THE ODTE'S WITHIN     @D4A*/ 30982300
*/*    THIS LIST WILL APPEAR IN THE DISPLAY.                     @D4A*/ 30982400
*/*    THIS ARRAY IS USED FOR CN= OPERAND PROCESSING.            @D5C*/ 30982500
*/*    FOR THE CN= OPERAND, DCPLODTE IS LIMITED BY THE NUMBER OF @D4A*/ 30982600
*/*    CONSOLE NAMES THE OPERATOR CAN SPECIFY ON THE COMMAND     @D4A*/ 30982700
*/*    LINE (158 CHARACTERS).                                    @D5C*/ 30982800
*/*                                                                  */ 30982900
*/********************************************************************/ 30983000
*      3 DCPLODTE(DCPLOASZ),            /* ODTE ADDRESSING ARRAY @D4A*/ 30983100
*        4 DCPLOALT FIXED(31),          /* ODTE ACCESS REG ALET  @D4A*/ 30983200
*        4 DCPLOPTR PTR(31),            /* ODTE ADDRESS          @D4A*/ 30983300
*/********************************************************************/ 30983400
*/*                                                                  */ 30983500
*/*    EXT MCS CONSOLE KEY NAME AND NUMBER FOR 'KEY='            @D5C*/ 30983600
*/*    (IEECB813 SETS UP AND PASSES TO IEEXEDNA)                 @D4A*/ 30983700
*/*                                                                  */ 30983800
*/********************************************************************/ 30983900
*      3 DCPLKEY  CHAR(8),              /* EXT MCS CONS KEY NAME @D5C*/ 30984000
*      3 *        CHAR(4),              /* RESERVED              @D5C*/ 30984100
*/********************************************************************/ 30984200
*/*                                                                  */ 30984300
*/*  DISPLAY CONSOLES ROUTING CODE BIT STRING (DCPLRCBS)             */ 30984400
*/*  DCPLRCBS IS A COLLECTIVE BIT STRING WHICH IS USED TO INDICATE   */ 30984500
*/*  TO IEEXEDNA WHAT ROUTING CODES WERE SPECIFIED IN THE COMMAND    */ 30984600
*/*  TEXT. THE STRING IS INITIALLY SET TO ZERO AND EACH BIT IS SET ON*/ 30984700
*/*  AS THE CORRESPONDING ROUTING CODE IS FOUND.                     */ 30984800
*/*                                                                  */ 30984900
*/********************************************************************/ 30985000
*      3 DCPLRCBS BIT(128),                /* ROUTING CODE COLLECTIVE   30985100
*                                             BIT STRING         @09C*/ 30985200
*/********************************************************************/ 30985300
*/*                                                                  */ 30985400
*/*  Pointers and info for the Backlog information.              @09A*/ 30985500
*/*  The entries are generated if D C,B was specified.           @09A*/ 30985600
*/*                                                                  */ 30985700
*/********************************************************************/ 30985800
*     3 DCPLBLA1 PTR(31),                 /* Address of first           30985900
*                                            asid entry         @09A*/  30986000
*     3 DCPLBLO1 PTR(31),                 /* Address of first system    30986100
*                                            outbound entry     @09A*/  30986200
*     3 DCPLBLI1 PTR(31),                 /* Address of first system    30986300
*                                            inbound entry      @09A*/  30986400
*     3 DCPLBLAM CHAR(4);                 /* Threshhold for asid        30986500
*                                            entry (minimum number      30986600
*                                            of WQE buffers to cause    30986700
*                                            an entry to be made) -     30986800
*                                            printable form     @09A*/  30986900
*  DCL DCPLBLSP FIXED(31) CONSTANT(230);  /* Subpool for DCPLBLG        30987000
*                                            entries            @09A*/  30987100
*@EJECT;                                                                30987200
*/********************************************************************/ 30987300
*/*                                                                  */ 30987400
*/*                                                                  */ 30987500
*/*    ROUTING CODE TABLE (DCPLRMSK) - THIS IS AN ARRAY OF 8     @L7A*/ 30987600
*/*       MASKS, EACH 1 BYTE LONG, EACH DEFINING A ROUTING       @L7A*/ 30987700
*/*       CODE VALUE WITHIN A BYTE.                              @L7A*/ 30987800
*/*                                                              @L7A*/ 30987900
*/*    THE  DCPLRCDE IS AN ARRAY OF 16 ONE-BYTE STRINGS.         @L7A*/ 30988000
*/*    THESE FIELDS ARE USED IN CREATING A STRING THAT WILL      @L7A*/ 30988100
*/*    IDENTIFY THE ROUTING CODES FOR THE ROUT= KEYWORD.         @L7A*/ 30988200
*/*                                                                  */ 30988300
*/********************************************************************/ 30988400
*  DCL DCPLRMSK(DCPLTBLN) BIT(8)           /* ROUTING CODE TABLE @LAC*/ 30988500
*      INIT('80'X,'40'X,'20'X,'10'X,            /* OF BIT MASKS  @LAC*/ 30988600
*           '08'X,'04'X,'02'X,'01'X);           /*               @LAC*/ 30988700
*  DCL DCPLRCDE(DCPLSTLN) BIT(8) BASED(ADDR(DCPLRCBS));                 30988800
*                                        /* ARRAY OF ONE BYTE           30988900
*                                           BITSTRINGS           @LAA*/ 30989000
*  DCL DCPLSTLN FIXED(31) CONSTANT(16);  /* NUMBER OF ENTRIES IN THE    30989100
*                                           ARRAY OF ONE-BYTE           30989200
*                                           BITSTRINGS           @LAA*/ 30989300
*  DCL DCPLCNSL FIXED(31) CONSTANT(99);  /* CONSTANT 99 IS THE          30989400
*                                           CONSOLES THAT HAVE BEEN     30989500
*                                           SYSGENED AND COULD APPEAR   30989600
*                                           IN A DISPLAY (99 CONSOLES)  30989700
*                                                                @L5A*/ 30989800
*  DCL DCPLOASZ FIXED(31) CONSTANT(150); /* CONSTANT 150 IS THE LIMIT   30989900
*                                           FOR 'CN=' CONSOLE NAMES -   30990000
*                                                                @PBC*/ 30990100
*  DCL DCPLTBLN FIXED(31) CONSTANT(8);     /* LENGTH OF ROUTING CODE    30990200
*                                             TABLE              @LAC*/ 30990300
*  DCL DCPLVRID FIXED(8) CONSTANT(DCPLSP52); /* CURRENT VERSION LEVEL   30990400
*                                                                @09C*/ 30990500
*  DCL DCPLSP22 FIXED(8) CONSTANT(2);        /* JBB2220 VERSION LEVEL   30990600
*                                                                @LAC*/ 30990700
*  DCL DCPLSP41 FIXED(8) CONSTANT(3);        /* HBB4410 VERSION LEVEL   30990800
*                                                                @LFA*/ 30990900
*  DCL DCPLSP44 FIXED(8) CONSTANT(4);        /* HBB5510 VERSION LEVEL   30991000
*                                                                @MBC*/ 30991100
*  DCL DCPLSP52 FIXED(8) CONSTANT(5);        /* HBB5520 VERSION LEVEL   30991200
*                                               ALSO OW07896 LEVEL      30991300
*                                                                @09A*/ 30991400
* DCL DCPLACRN CHAR(4) CONSTANT('DCPL');    /* PARM LIST ACRONYM        30991500
*                                                               @L5A*/  30991600
*        /************************************************************/ 30991700
*        /*                                                          */ 30991800
*        /*  MSCOPE SYSTEM NAMES ARRAY                               */ 30991900
*        /*                                                          */ 30992000
*        /*  THE FOLLOWING ARRAY IS USED TO SAVE ALL MSCOPE SYSTEM   */ 30992100
*        /*  NAMES FOR UCME OR ODTE.                                 */ 30992200
*        /*                                                      @LUA*/ 30992300
*        /************************************************************/ 30992400
*                                                                       30992500
*  DCL 1 MSCOPEAR BASED BDY(WORD),        /*                     @MBC*/ 30992600
*                                                                       30992700
*       2 CONMSCNM(*) CHAR(8);            /* MSCOPE SYSTEM NAMES @MBC*/ 30992800
*                                                                       30992900
*        /************************************************************/ 30993000
*        /*                                                          */ 30993100
*        /*  CONSOLE-DATA-SAVE-ENTRY (CONSENT)                       */ 30993200
*        /*                                                          */ 30993300
*        /*  THE FOLLOWING ARRAY IS USED TO SAVE ALL RELEVANT DATA   */ 30993400
*        /*  FROM EACH UCME, CONSOLE DEVICE UCB, RDCM AND TDCM,      */ 30993500
*        /*  WHICH HAS BEEN REQUESTED IN THE DISPLAY CONSOLES        */ 30993600
*        /*  COMMAND                                                 */ 30993700
*        /*                                                      @LAA*/ 30993900
*        /************************************************************/ 30994100
*  DCL 1 CONSENT(*) BASED(DCPLCONP) BDY(WORD),      /*           @LAA*/ 30994300
*       2 IDCON FIXED(15),             /* CONSOLE ID FROM UCME          30994500
*                                                                @LAA*/ 30994700
*       2 CNTOFWQE FIXED(15),          /* NUMBER OF WQE'S QUEUED TO     30994900
*                                         THIS CONSOLE.          @LAA*/ 30995100
*       2 ATR BIT(8),                  /* UCMATR - CONSOLE ATTRIBUTES   30995300
*                                                                @LAA*/ 30995500
*        3 MOF BIT(1),                 /* WTO SUPPORT            @LAA*/ 30995700
*        3 MIF BIT(1),                 /* ATTENTION SUPPORT -INPUT DV   30995900
*                                                                @LAA*/ 30996100
*        3 XF BIT(1),                  /* EXTERNAL INTERRUPT SUPPORT    30996300
*                                                                @LAA*/ 30996500
*        3 UF BIT(1),                  /* DEVICE ACTIVE          @LAA*/ 30996700
*        3 * BIT(4),                   /* MISC. BITS NOT USED HERE      30996900
*                                                                @LAA*/ 30997100
*        /************************************************************/ 30997300
*        /*                                                          */ 30997500
*        /*  THE AUTH BITS AND THE DISP BITS ARE MAPPED THE SAME     */ 30997700
*        /*  AS THE UCMAUTH AND UCMDISP BITS IN THE UCM              */ 30997900
*        /*                                                      @LRA*/ 30998100
*        /************************************************************/ 30998300
*       2 AUTHA BIT(8),                /* CONSOLE CMD AUTHORIZATION     30998500
*                                                                @LAA*/ 30998700
*        3 AUTH1 BIT(1),               /* CMD GROUP 1 - SYS      @LAA*/ 30998900
*        3 AUTH2 BIT(1),               /* CMD GROUP 2 - IO       @LAA*/ 30999100
*        3 AUTH3 BIT(1),               /* CMD GROUP 3 - CONS     @LAA*/ 30999300
*        3 * BIT(5),                   /* MISC. BITS NOT USED HERE      30999500
*                                                                @LAA*/ 30999700
*       2 AUTHB BIT(8),                /* CONSOLE AUTHORIZATION  @LAA*/ 30999900
*       2 DISP BIT(16),                /* CONSOLE DISPOSITION FLAGS     31000100
*                                                                @LAA*/ 31000300
*        3 DISP1 BIT(8),               /* FIRST BYTE CONSOLE            31000500
*                                         DISPOSITION FLAGS      @D4A*/ 31000700
*         4 DISPA BIT(1),              /* MASTER CONSOLE         @D4C*/ 31000900
*         4 * BIT(1),                  /* MISC.BIT NOT USED HERE @D4C*/ 31001100
*         4 DISPC BIT(1),              /* DISPLAY DEVICE         @D4C*/ 31001300
*         4 DISPD BIT(1),              /* OUTPUT ONLY CONSOLE    @D4C*/ 31001500
*         4 DISPE BIT(1),              /* CONSOLE IS IN FULL            31001700
*                                         CAPABILITY MODE        @D4C*/ 31001900
*         4 DISPF BIT(1),              /* CONSOLE IS IN MESSAGE         31002100
*                                         STREAM MODE            @D4C*/ 31002300
*         4 DISPG BIT(1),              /* CONSOLE IS IN STATUS          31002500
*                                         DISPLAY MODE           @D4C*/ 31002700
*         4 * BIT(1),                  /* MISCELLANEOUS BITS NOT        31002900
*                                         USED HERE              @D4C*/ 31003100
*        3 DISP2 BIT(8),               /* SECOND BYTE CONSOLE           31003300
*                                         DISPOSITION FLAGS      @D4A*/ 31003500
*         4 DISPI BIT(1),              /* DISPLAY TIMESTAMPS     @D4C*/ 31003700
*         4 DISPJ BIT(1),              /* DISPLAY JOBNAMES       @D4C*/ 31003900
*         4 DISPK BIT(1),              /* SUBSYSTEM ALLOCATABLE         31004100
*                                         CONSOLE                @D4C*/ 31004300
*         4 DISPL BIT(1),              /* CONSOLE DEDICATED TO A        31004500
*                                         SYSTEM COMPONENT       @D4C*/ 31004700
*         4 DISPM BIT(1),              /* PSEUDO MASTER CONSOLE  @D4C*/ 31004900
*         4 DISPN BIT(1),              /* DISPLAY SYSTEM NAME    @D4C*/ 31005100
*         4 DISPX BIT(1),              /* NO SYSTEM NAME AND JOB NAME   31005300
*                                         DISPLAYED              @LRA*/ 31005500
*         4 * BIT(1),                  /* MISC. BIT NOT USED     @LRC*/ 31005700
*       2 CONSWTCH CHAR(1),            /* SWITCHES FOR EACH ENTRY IN    31005900
*                                         CONSENT                @LAA*/ 31006100
*        3 ALTEN BIT(1),               /* ALTERNATE EXISTS       @LAA*/ 31006300
*        3 COMPC BIT(1),               /* COMPOSITE EXISTS       @LAA*/ 31006500
*        3 ALTCOMPC BIT(1),            /* COMPOSITE HAS AN ALTERNATE    31006700
*                                                                @LAA*/ 31006900
*        3 LOGGED_ON BIT(1),           /* ON IF OPERATOR IS LOGGED ON   31007100
*                                                                @LDA*/ 31007300
*        3 CONAHERE  BIT(1),           /* ON IF CONSOLE ACTIVE ON       31007400
                                          THIS SYSTEM            @PDA*/ 31007500
*        3 SYSCPDM BIT(1),             /* SYSTEM CONSOLE PD MODE        31007600
*                                         INDICATOR              @04A*/ 31007700
*        3 * BIT(2),                   /* MISCL. BITS NOT USED   @04C*/ 31007800
*       2 * CHAR(2),                   /* RESERVED               @LAA*/ 31007900
*       2 RTCD BIT(128),               /* CONSOLE ROUTING CODES  @LAA*/ 31008000
*       2 * CHAR(12),                  /* RESERVED               @MCC*/ 31008800
*       2 DEVSTATS BIT(8),             /* STATUS FLAGS FROM UCB  @LAA*/ 31009700
*        3 ONLI BIT(1),                /* DEVICE IS ONLINE       @LAA*/ 31009900
*        3 * BIT(5),                   /* MISC BITS NOT USED     @LAA*/ 31010100
*        3 SYSR BIT(1),                /* DEVICE IS A CONSOLE    @LAA*/ 31010300
*        3 DADI BIT(1),                /* DEV. STAT. PEND TO CHANGE     31010500
*                                                                @LAA*/ 31010700
*       2 TOPAR CHAR(1),               /* TOP AREA ID FROM RDCM  @LAA*/ 31010900
*       2 COMPASID BIT(16),            /* ASID OF SYS COMPONENT  @LAA*/ 31011100
*       2 COMPNAME CHAR(4),            /* NAME OF SYS COMPONENT  @LAA*/ 31011300
*       2 CONLVL CHAR(2),              /* LEVEL OF MESSAGE TO APPEAR    31011500
*                                         ON CONSOLE             @LAA*/ 31011700
*        3 CONLVL1 BIT(8),             /* FIRST BYTE OF THE MESSAGE     31011900
*                                         LEVEL FLAGS            @LAA*/ 31012100
*         4 LVLR BIT(1),               /* DISPLAY WTOR'S MESSAGE @LAA*/ 31012300
*         4 LVLIA BIT(1),              /* DISPLAY IMMEDIATE ACTION      31012500
*                                         MESSAGE                @LAA*/ 31012700
*         4 LVLCE BIT(1),              /* DISPLAY CRITICAL EVENTUAL     31012900
*                                         ACTION MESSAGE         @LAA*/ 31013100
*         4 LVLE BIT(1),               /* DISPLAY EVENTUAL ACTION       31013300
*                                         MESSAGE                @LAA*/ 31013500
*         4 LVLI BIT(1),               /* DISPLAY INFORMATIONAL         31013700
*                                         MESSAGE                @LAA*/ 31013900
*         4 LVLBC BIT(1),              /* DISPLAY BROADCAST             31014100
*                                         MESSAGE                @LAA*/ 31014300
*         4 CONMSALL BIT(1),           /* IF ON MSCOPE=*ALL      @LUA*/ 31014500
*         4 * BIT(1),                  /* RESERVED               @LUC*/ 31014700
*        3 CONLVL2 BIT(8),             /* RESERVED               @LAA*/ 31014900
*       2 CONSTAT BIT(8),              /* UCME STATUS FLAGS      @LAA*/ 31015100
*        3 * BIT(3),                   /* MISC BITS              @LAA*/ 31015300
*        3 CF BIT(1),                  /* CLOSE PENDING (UCMCF)  @LAA*/ 31015500
*        3 TA BIT(1),                  /* OPEN PENDING (UCMTA)   @LAA*/ 31015700
*        3 * BIT(3),                   /* MISC BITS              @LAA*/ 31015900
*       2 * CHAR(1),                   /* RESERVED               @LAA*/ 31016100
*       2 RNUM FIXED(15),              /* NUMBER OF LINES IN A MESSAGE  31016300
*                                         ROLL - TWO BYTES TO ALLOW     31016500
*                                         TRANSLATION TO EBCDIC IN      31016700
*                                         IEECB814               @LAA*/ 31016900
*       2 RTME FIXED(15),              /* INTERVAL BETWEEN MESSAGE      31017100
*                                         ROLLS                  @LAA*/ 31017300
*       2 SEGSIZE FIXED(15),           /* SIZE OF MSG SEGMENT - 2 BYTES 31017500
*                                         TO ALLOW TRANSLATION TO       31017700
*                                         EBCDIC IN IEECB814     @LAA*/ 31017900
*       2 CONVS CHAR(1),               /* CONVERSATIONAL MESSAGE        31018100
*                                         DELETION IN EFFECT     @LAA*/ 31018300
*       2 DELMODE CHAR(2),             /* MESSAGE DELETION MODE  @LAA*/ 31018500
*       2 CONRSVD CHAR(3),             /* RESERVED FOR ALIGNMENT        31018700
*                                         PURPOSES               @LAA*/ 31018900
*       2 PFKTBLE  CHAR(8),            /* NAME OF THE PFK TABLE BEING   31019100
*                                         USED BY THIS CONSOLE   @LDC*/ 31019300
*       2 USERID  CHAR(8),             /* USERID OF THE LOGGED ON       31019500
*                                         USER ASSOCIATED WITH THE      31019700
*                                         CONSOLE                @LDA*/ 31019900
*       2 CONNME   CHAR(8),            /* CONSOLE NAME FROM THE UCME    31020100
*                                                                @LIC*/ 31020300
*       2 ALTCNNME CHAR(8),            /* ALTERNATE CONSOLE NAME @LIA*/ 31020500
*       2 SYSNAME  CHAR(8),            /* SYSTEM NAME            @LIA*/ 31020700
*       2 CNDEVADR CHAR(4),            /* EBCDIC DEVICE NUMBER   @MCC*/ 31021100
*       2 CONKEYNM CHAR(8),            /* KEY NAME               @D5C*/ 31021500
*       2 CONCNID  FIXED(32),          /* 4-BYTE CONSOLE ID             31021700
*                                         FROM THE ODTE          @D4A*/ 31021900
*        3 CONCNCLS FIXED(8),          /* CONSOLE QUEUING CLASS  @D5C*/ 31022100
*        3 CONCNNUM FIXED(24),         /* CONSOLE NUMBER         @D5C*/ 31022300
*       2 CONCMDSY CHAR(8),            /* CMDSYS NAME            @LUA*/ 31022500
*       2 CONMSNUM FIXED(15),          /* NUMBER OF MSCOPE NAMES @LUA*/ 31022700
*       2 CONMISC BIT(8),              /* MISCELLANEOUS ROUTING INFO    31022800
*                                                                @LVA*/ 31022900
*        3 CONMUD BIT(1),              /* DISPLAY UD MESSAGES    @LVA*/ 31023000
*        3 CONJBNM BIT(1),             /* DISPLAY MONITOR JOBNAMES      31023100
*                                                                @DEA*/ 31023200
*        3 CONSTATS BIT(1),            /* DISPLAY MONITOR STATUS @DEA*/ 31023300
*        3 CONSESS BIT(1),             /* DISPLAY MONITOR SESSION       31023400
*                                                                @DEA*/ 31023500
*        3 * BIT(4),                   /* RESERVED               @DEC*/ 31023600
*       2 *        FIXED(8),           /* RESERVED               @LZC*/ 31023700
*       2 ALTGPNME CHAR(8),            /* CONSOLE GROUP NAME     @LZA*/ 31023800
*       2 SWITCHTO CHAR(8),            /* CONSOLE SWITCHED TO    @LZA*/ 31023900
*       2 CNSWITCH FIXED(32),          /* CONSOLE SWITCHED TO THIS      31024000
*                                         CONSOLE                @MBC*/ 31024100
*       2 MSCOPEPT PTR(31);            /* MSCOPE POINTER         @MBA*/ 31024200
*        /************************************************************/ 31024300
*        /*                                                          */ 31024400
*        /*  CONSOLE-ASSOCIATION-SAVE-ENTRY (CASENT)                 */ 31024500
*        /*                                                          */ 31024600
*        /*  THE FOLLOWING ARRAY IS USED TO SAVE ALL RELEVANT DATA   */ 31024700
*        /*  FROM THE UCME AND SYSTEM DEVICE ASSOCATION LIST (SDAL)  */ 31024800
*        /*  WHICH HAS BEEN REQUESTED IN THE DISPLAY CONSOLES        */ 31024900
*        /*  COMMAND WITH THE CA OR CA= OPERAND.                     */ 31025000
*        /*                                                      @LIA*/ 31025100
*        /************************************************************/ 31025200
*  DCL 1 CASENT(*) BASED(DCPLCONP) BDY(WORD), /*                 @LIA*/ 31025300
*       2 CANAME CHAR(8),              /* CONSOLE NAME FROM UCME @LIA*/ 31025400
*       2 CAID FIXED(15),              /* CONSOLE ID FROM UCME   @LIA*/ 31025500
*       2 CASYSNME CHAR(8),            /* SYSTEM NAME FROM UCME         31025700
*                                         OR SDAL                @LIA*/ 31025900
*       2 CADEVADR CHAR(4),            /* EBCDIC DEVICE NUMBER   @MCC*/ 31026300
*       2 CASTATUS BIT(16),            /* CONSOLE STATUS FLAGS   @LIA*/ 31026700
*        3 CACTIVE BIT(1),             /* CONSOLE IS ACTIVE      @LIA*/ 31026900
*        3 CAMASTER BIT(1),            /* MASTER CONSOLE         @LIA*/ 31027100
*        3 * BIT(14);                  /* RESERVED               @LIA*/ 31027300
*/********************************************************************/ 31030000
*/* DCPLBLG Entry - generated if D C,B ("Backlog") was           @09A*/ 31032700
*/*                 specified.                                   @09A*/ 31035400
*/********************************************************************/ 31038100
*  DCL 1 DCPLBLE BASED,                /* WQE usage entry        @09A*/ 31040800
*       3 DCPLBLNX PTR(31),            /* Next entry address     @09A*/ 31043500
*       3 DCPLBLNM CHAR(8),            /* Jobname (asid entry) or       31046200
*                                         Sysname (system entry  @09A*/ 31048900
*       3 DCPLBL#  FIXED(31),          /* Number of WQE buffers  @09A*/ 31051600
*       3 DCPLBLAI FIXED(16);          /* Address space id  (for        31054300
*                                         asid entry)            @09A*/ 31057000
*%CTML11: IF CTMUXIR ~= 'YES' %THEN %GOTO CTML12; /*             @L6C*/ 31059700
*         %ELSE %;                   /*                          @L6A*/ 31062400
*@EJECT;                                                                31065100
*/********************************************************************/ 31067800
*/*                                                                  */ 31070500
*/* NAME = USER EXIT INTERFACE PARAMETER LIST                    @L6A*/ 31073200
*/*                                                                  */ 31075900
*/*01* PROPRIETARY STATEMENT=                                        */ 31078700
*/***PROPRIETARY_STATEMENT********************************************/ 31128700
*/*                                                                  */ 31311200
*/*                                                                  */ 31361200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 31411200
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 31461200
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1979, 1993                      */ 31511200
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 31561200
*/*                                                                  */ 31611200
*/* STATUS= HBB5510                                                  */ 31661200
*/*                                                                  */ 31711200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 31761200
*/*                                                                  */ 39961200
*/* FUNCTION         = PARAMETER LIST TO BE PASSED TO THE USER   @L6A*/ 39972700
*/*                    EXIT INTERFACE ROUTINE (IEAVX600).        @L6A*/ 39984200
*/*                    THIS MAPPING SERVES AS AN INTERFACE       @L6A*/ 39995700
*/*                    BETWEEN MODULES IEAVVWTO AND IEAVX600,    @L6A*/ 40022500
*/*                    AND BETWEEN MODULES IEAVMWTO AND IEAVX600.@L6A*/ 40049300
*/*                    THE MAPPING WILL CORRESPOND WITH THE      @L6A*/ 40076200
*/*                    PARAMETER LIST PASSED BY IEAVVWTO AND     @L6A*/ 40087700
*/*                    IEAVMWTO.                                 @L6A*/ 40099200
*/*                                                                  */ 40111200
*/* METHOD OF ACCESS =                                           @L6A*/ 40161200
*/*             BAL  - CODE THE FOLLOWING:  IHACTM UXIR.         @L6A*/ 40186200
*/*             PL/S - 1. DECLARE MACRO CHARACTER VARIABLE       @L6A*/ 40211200
*/*                       CTMUXIR.                               @L6A*/ 40261200
*/*                    2. SET CTMUXIR EQUAL TO 'YES'.            @L6A*/ 40311200
*/*                    3. FOR NON-BASED INVOCATION DECLARE       @L6A*/ 40361200
*/*                       VARIABLE UXIRVAL AND SET IT TO         @L6A*/ 40411200
*/*                       'NONE'.                                @L6A*/ 40461200
*/*                    4. FOR BASED MAPPING SET DSECT=YES.       @L6A*/ 40511200
*/*                    5. %INCLUDE SYSLIB(IHACTM).               @L6A*/ 40561200
*/*                    6. DECLARE UXIRPTR.                       @L6A*/ 40611200
*/*                                                                  */ 40661200
*/* CREATED BY       = IEAVVWTO,IEAVMWTO                         @L6A*/ 40711200
*/*                                                                  */ 40911200
*/* POINTED TO BY    = REGISTER 1 POINTS TO THE ADDRESS OF       @L6A*/ 40961200
*/*                    THE UXIR WHEN IEAVX600 IS CALLED.         @L6A*/ 41011200
*/*                                                                  */ 41061200
*/* SERIALIZATION    = NONE                                      @L6A*/ 41111200
*/*                                                                  */ 41211200
*/* LOCATION         = USERS ADDRESS SPACE.                      @L6A*/ 41261200
*/*                                                                  */ 41311200
*/* NOTE             = THE PL/S VERSION IS USED IN IEAVVWTO,     @L6A*/ 41344500
*/*                    THE BAL IN IEAVMWTO.                      @L6A*/ 41377800
*/*                                                                  */ 41411200
*/********************************************************************/ 41611200
* %IF UXIRVAL = 'NONE' %THEN %GOTO UXIRPLS1; /* IF NON-BASED     @L6A*/ 41644400
* DCL 1 UXIR BASED(UXIRPTR) BDY(WORD), /* USER EXIT INTERFACE           41661200
*                                         ROUTINE PARAMETER LIST @L6A*/ 41711200
* %GOTO UXIRPLS2;                   /* IF BASED                  @L6A*/ 41719500
* %UXIRPLS1 : ;                     /* NON-BASED UXIR            @L6A*/ 41727800
* DCL 1 UXIR BDY(WORD),             /* USER EXIT INTERFACE ROUTINE      41736100
*                                      PARAMETER LIST            @L6A*/ 41744400
* %UXIRPLS2 : ;                     /* BASED UXIR                @L6A*/ 41752800
*      3 UXIRACRN CHAR(4),          /* CONTROL BLOCK ID 'UXIR'   @L6A*/ 41761200
*      3 UXIRVRSN FIXED(8),         /* VERSION LEVEL             @L6A*/ 41811200
*      3 UXIRCFLG  BIT(8),          /* COMMUNICATION FLAGS       @L6A*/ 41822300
*        5 UXIRMSUP BIT(1),         /* SUPPRESS THE MESSAGE      @L6A*/ 41833400
*        5 UXIRVMXT BIT(1),         /* IEAVMXIT TO BE CALLED     @L6A*/ 41855600
*        5 UXIRSUXT BIT(1),         /* SPECIFIED USER EXIT TO BE        41866700
*                                      CALLED                    @L6A*/ 41877800
*        5 *        BIT(5),         /* RESERVED                  @L8C*/ 41888900
*      3 UXIRRSVD CHAR(2),          /* RESERVED                  @L6A*/ 41900000
*      3 UXIRCWQE PTR(31),          /* ADDRESS OF CURRENT WQE -         41911200
*                                      SINGLE OR MAJOR           @L6A*/ 41961200
*      3 UXIRMINR PTR(31),          /* ADDRESS OF MINOR WQE (one        41994500
*                                      text line)                @MAC*/ 42027800
*      3 UXIRMPFE PTR(31),          /* ADDRESS OF MPF TABLE             42061200
*                                      ENTRY                     @L6A*/ 42111200
*      3 UXIRMPFT PTR(31),          /* ADDRESS OF MPF TABLE      @L6A*/ 42161200
*      3 UXIRGENX PTR(31),          /* ADDRESS OF GENERAL WTO           42211200
*                                      USER EXIT TABLE (GENX)    @L6A*/ 42261200
*      3 UXIRWORK PTR(31),          /* ADDRESS OF WORK AREA      @L6A*/ 42311200
*      3 UXIREPRM PTR(31),          /* ADDRESS OF ESTAE EXIT            42361200
*                                      PARAMETER LIST            @MAC*/ 42411200
*      3 UXIRMINW PTR(31),          /* Address of minor WQE      @MAA*/ 42461200
*      3 UXIRRSV1 CHAR(12);         /* Reserved                  @MAA*/ 42511200
*  DCL UXIRX600 FIXED(31) CONSTANT(2000);/* SIZE OF IEAVX600'S          42861200
*                                           WORK AREA            @LGC*/ 42911200
*  DCL UXIRVERN FIXED(8) CONSTANT(UXIRS212); /* JBB2125 UXIR LEVEL      43111200
*                                                                @L6A*/ 43161200
*  DCL UXIRS212 FIXED(8) CONSTANT(1);        /* VERSION LEVEL    @L6A*/ 43211200
*  DCL UXIRNAME CHAR(4) CONSTANT('UXIR');    /* PARM LIST ACRONYM       43261200
*                                                                @L6A*/ 43311200
*%CTML12: IF CTMCMD ~= 'YES' %THEN %GOTO CTML13;    /*           @LCC*/ 43361200
*         %ELSE %;                                  /*           @LCA*/ 43411200
*@EJECT;                                            /*           @LCA*/ 43461200
*/********************************************************************/ 43511200
*/*                                                                  */ 43561200
*/*  NAME = CONSOLE COMMAND QUEUE ELEMENT MAPPING                @LCA*/ 43611200
*/*                                                                  */ 43661200
*/*  COPYRIGHT        =                                          @LCA*/ 43711200
*/*            5740-XC6                                              */ 43761200
*/*            RESTRICTED MATERIALS OF IBM                           */ 43811200
*/*            (C) COPYRIGHT IBM CORP. 1986                          */ 43861200
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 43911200
*/*            REFER TO COPYRIGHT INSTRUCTIONS                       */ 43961200
*/*            FORM NUMBER G120-2083                                 */ 44011200
*/*                                                                  */ 44061200
*/*  STATUS           = OS/VS2 JBB2220                           @LCA*/ 44111200
*/*                                                                  */ 44161200
*/*  FUNCTION         = THE CONSOLE COMMAND QUEUE ELEMENT IS     @LCA*/ 44211200
*/*                     USED TO CONTAIN A COMMAND IMAGE.         @LCA*/ 44261200
*/*                     IEAVN601 AND IEAVN602 BUILD CONSOLE      @LCA*/ 44311200
*/*                     COMMAND QUEUE AND CHAIN IT TO            @LCA*/ 44361200
*/*                     CONIMNQ, CONMRQ, CONMNQ.                 @LCA*/ 44411200
*/*                     IEAVN614 RECHAINS THOSE COMMAND QUEUES   @LCA*/ 44461200
*/*                     TO UCMEFCMQ AND SNPCMQ.                  @LCA*/ 44511200
*/*                                                                  */ 44561200
*/*  METHOD OF ACCESS =                                          @LCA*/ 44611200
*/*              BAL  - CODE THE FOLLOWING:  IHACTM CMDELEM.     @LCA*/ 44661200
*/*              PL/S - 1. DECLARE MACRO CHARACTER VARIABLE      @LCA*/ 44711200
*/*                        CTMCMD.                               @LCA*/ 44761200
*/*                     2. SET CTMCMD EQUAL TO 'YES'.            @LCA*/ 44811200
*/*                     3. %INCLUDE SYSLIB(IHACTM).              @LCA*/ 44861200
*/*                                                                  */ 44911200
*/*  CREATED BY       = IEAVN601,IEAVN602                        @LCA*/ 44961200
*/*                                                                  */ 45011200
*/*  POINTED TO BY    = CONMRQ, CONMNQ, CONIMNQ, UCMEFCMQ,       @LCA*/ 45061200
*/*                     SNPCMQ                                   @LCA*/ 45111200
*/*                                                                  */ 45161200
*/*  SERIALIZATION    = NONE                                     @LCA*/ 45211200
*/*                                                                  */ 45261200
*/*  LOCATION         = SP241                                    @LCA*/ 45311200
*/*                                                                  */ 45361200
*/*                                                                  */ 45411200
*/********************************************************************/ 45461200
*@SPACE;                      /*                                @LCA*/  45511200
*DCL 1 CMDELEM BASED,         /* CONSOLE COMMAND QUEUE ELEMENT          45561200
*                                 MAPPING                       @LCA*/  45611200
*     3 CMDFWDPT PTR(31),     /* FORWARD POINTER                @LCA*/  45661200
*     3 CMDLGTH  FIXED(15),   /* LENGTH OF THE ELEMENT MINUS            45711200
*                                LENGTH OF THE FORWARD POINTER  @LCA*/  45761200
*     3 * FIXED(15),          /* RESERVED                       @LCA*/  45811200
*     3 CMDCMD CHAR(*);       /* ACTUAL COMMAND                 @LCA*/  45861200
*%CTML13: IF VRBMP~= 'YES' %THEN %GOTO CTML14;      /*           @LCC*/ 45911200
*         %ELSE %;                                  /*           @LCA*/ 45961200
*@EJECT;                                            /*           @LCA*/ 46011200
*/********************************************************************/ 46061200
*/*                                                                  */ 46111200
*/*                                                              @LDA*/ 46161200
*/* NAME = IEE3003D VERB TABLE ENTRY DSECT                       @LDA*/ 46211200
*/*                                                              @LDA*/ 46261200
*/* COPYRIGHT        =                                           @LDA*/ 46311200
*/*           5685-001                                           @LDA*/ 46361200
*/*           RESTRICTED MATERIALS OF IBM                        @LDA*/ 46411200
*/*           (C) COPYRIGHT IBM CORP. 1989                       @LDA*/ 46461200
*/*           LICENSED MATERIALS - PROPERTY OF IBM               @LDA*/ 46511200
*/*                                                              @LDA*/ 46561200
*/* STATUS           = JBB3313                                   @LDA*/ 46611200
*/*                                                              @LDA*/ 46661200
*/* FUNCTION         = THE IEE3003D VERB TABLE ENTRY DSECT IS    @LDA*/ 46711200
*/*                    USED TO MAP EACH ENTRY IN THE VERB TABLE, @LDA*/ 46761200
*/*                    RESIDING IN IEE3003D.                     @LDA*/ 46811200
*/*                                                              @LDA*/ 46861200
*/* METHOD OF ACCESS =                                           @LDA*/ 46911200
*/*             BAL  - CODE THE FOLLOWING:  IHACTM VRBMP         @LDA*/ 46961200
*/*             PLAS - 1. DECLARE MACRO CHARACTER VARIABLE       @LDA*/ 47011200
*/*                       VRBMP.                                 @LDA*/ 47061200
*/*                    2. SET VRBMP EQUAL TO 'YES'.              @LDA*/ 47111200
*/*                    3. %INCLUDE SYSLIB(IHACTM).               @LDA*/ 47161200
*/*                                                              @LDA*/ 47211200
*/* CREATED BY       = IEE0403D                                  @LDA*/ 47261200
*/*                                                              @LDA*/ 47311200
*/* POINTED TO BY    = NONE                                      @LDA*/ 47361200
*/*                                                              @LDA*/ 47411200
*/* SERIALIZATION    = NONE                                      @LDA*/ 47461200
*/*                                                              @LDA*/ 47511200
*/* LOCATION         = SYS1.LINKLIB                              @LDA*/ 47561200
*/*                                                              @LDA*/ 47611200
*/*                                                              @LDA*/ 47661200
*/********************************************************************/ 47711200
*                                                                       47761200
*  DCL 1 VERBMAP BASED,                                                 47811200
*        2 ENTRYLEN FIXED(8),                                           47861200
*        2 VERBLEN FIXED(8),                                            47911200
*        2 VERBIND FIXED(8),                                            47961200
*        2 VERBAUT FIXED(8),                                            48011200
*        2 AUTHTYPE FIXED(8),                                           48061200
*        2 RNAMELEN FIXED(8),                                           48111200
*        2 VERB CHAR(*);                                                48161200
*%CTML14: IF CTMDOM0 ~= 'YES' %THEN %GOTO CTML15;       /*       @LUC*/ 48211200
         %ELSE %;                                       /*       @LUA*/ 48261200
*@EJECT;                                                /*       @LUA*/ 48311200
*/********************************************************************/ 48361200
*/*                                                              @LUA*/ 48411200
*/* NAME             = DOM REGISTER 0 MAPPING                    @LUA*/ 48461200
*/*                                                              @LUA*/ 48511200
*/* COPYRIGHT        =                                           @LUA*/ 48561200
*/*           5655-068                                           @LUA*/ 48611200
*/*           THIS MODULE IS "RESTRICTED MATERIALS OF IBM"       @LUA*/ 48661200
*/*           (C) COPYRIGHT IBM CORP. 1990                       @LUA*/ 48711200
*/*           LICENSED MATERIALS - PROPERTY OF IBM               @LUA*/ 48761200
*/*                                                              @LUA*/ 48811200
*/* STATUS           = HBB4410                                   @LUA*/ 48861200
*/*                                                              @LUA*/ 48911200
*/* FUNCTION         =  PROVIDES A MAPPING OF THE CONTENTS OF    @LUA*/ 48961200
*/*                     REGISTER 0 UPON ISSUANCE OF DOM/DOMP     @LUA*/ 49011200
*/*                                                              @LUA*/ 49061200
*/*                                                              @LUA*/ 49111200
*/* METHOD OF ACCESS =                                           @LUA*/ 49161200
*/*  BAL    - CODE THE FOLLOWING - IHACTM DOM0                   @LUA*/ 49211200
*/*  PL/AS  - 1. DECLARE THE MACRO CHARACTER VARIABLE CTMDOM0    @LUA*/ 49261200
*/*           2. SET CTMDOM0 EQUAL TO 'YES'                      @LUA*/ 49311200
*/*           3. DCL DOM0PTR                                     @LUA*/ 49361200
*/*           4. %INCLUDE SYSLIB(IHACTM)                         @LUA*/ 49411200
*/*                                                              @LUA*/ 49461200
*/* CREATED BY       = DOM MACRO                                 @LUA*/ 49511200
*/*                                                              @LUA*/ 49561200
*/* POINTED TO BY    = N/A                                       @LUA*/ 49611200
*/*                                                              @LUA*/ 49661200
*/* SERIALIZATION    = NONE                                      @LUA*/ 49711200
*/*                                                              @LUA*/ 49761200
*/* LOCATION         = N/A                                       @LUA*/ 49811200
*/*                                                              @LUA*/ 49861200
*/********************************************************************/ 49911200
*DECLARE                               /*                        @LUA*/ 49961200
* 1 DM0TREG0 BASED(DOM0PTR) BDY(WORD), /* MAPPING OF REGISTER 0  @LUA*/ 50011200
*     3 DM0COUNT   FIXED(8),   /*THE COUNT OF 4-BYTE DOM IDS     @LUA*/ 50061200
*       5 DM0PR220 BIT(1),     /* Pre-JBB2220 msglist if on      @0DA*/ 50086200
*     3 DM0SYSID   FIXED(8),   /*A SYSID FOR MESSAGES TO BE             50111200
*                                                     DELETED    @LUA*/ 50161200
*     3 DM0RQTYP     BIT(16),  /*DOM REQUEST TYPE                @LUA*/ 50211200
*        5 DM0RTY1    BIT(8),  /*FLAG BYTE 1                     @LUA*/ 50261200
*          7 DM0RSV01 BIT(1),  /*RESERVED                        @LUA*/ 50311200
*          7 DM0RSV02 BIT(1),  /*RESERVED                        @LUA*/ 50361200
*          7 DM0RSV03 BIT(1),  /*RESERVED                        @LUA*/ 50411200
*          7 DM0RSV04 BIT(1),  /*RESERVED                        @LUA*/ 50461200
*          7 DM0RSV05 BIT(1),  /*RESERVED                        @LUA*/ 50511200
*          7 DM0SKIP  BIT(1),  /*SKIP DELAYED ISSUE PROCESSING   @PEC*/ 50561200
*          7 DM0RSV06 BIT(1),  /*RESERVED                        @PEC*/ 50611200
*          7 DM0LNKB  BIT(1),  /*LINKAGE=BRANCH WAS SPECIFIED    @LUA*/ 50661200
*        5 DM0RTYP2   BIT (8), /*FLAG BYTE 2                     @LUA*/ 50711200
*          7 DM0SY    BIT(1),  /*SCOPE=SYSTEM WAS SPECIFIED      @LUA*/ 50761200
*          7 DM0SYS   BIT(1),  /*SCOPE=SYSTEMS WAS SPECIFIED     @LUA*/ 50811200
*          7 DM0TOK   BIT(1),  /*TOKEN VALUE WAS SPECIFIED       @LUA*/ 50861200
*          7 DM0SID   BIT(1),  /*SYSTEM ID VALUE WAS SPECIFIED   @LUA*/ 50911200
*          7 DM0MLST  BIT(1),  /*MSGLIST VALUE WAS SPECIFIED     @LUA*/ 50961200
*          7 DM0RPLY  BIT(1),  /*REPLY=YES WAS SPECIFIED         @LUA*/ 51011200
*          7 DM0DMCB  BIT(1),  /*DOMCBLK VALUE WAS SPECIFIED     @LUA*/ 51061200
*          7 DM0MSG   BIT(1);  /*MSG VALUE WAS SPECIFIED         @LUA*/ 51111200
*%CTML15:;                     /*                                @LUA*/ 51161200
