*       %GOTO CPABBSL1;   /*BILINGUAL MAPPING                           00050000
         MACRO                                                          00100000
         IHACPAB  &DSECT=YES                                            00150000
         AIF   ('&DSECT' EQ 'NO').NODSCT                                00200000
CPAB     DSECT                                                          00250000
         AGO   .CONT                                                    00300000
.NODSCT  ANOP                                                           00350000
         DS    0F                                                       00400000
CPAB     EQU   *                                                        00450000
.CONT    ANOP                                                           00500000
         SPACE  1                                              @L3C*/   00510900
*%CPABBSL1: ;                                                           00521800
*/********************************************************************/ 00532700
*/*                            CPAB    OS/VS2 -- 8/12/77     @ZA28730*/ 00543600
*/*     THE CELL POOL ANCHOR BLOCK IS USED TO CONTAIN A PRE-ALLOCATED*/ 00554500
*/*      POOL OF CELLS FOR THE GET AND FREE QUICKCELL SERVICES.      */ 00565400
*/*                                                                  */ 00576300
*/* PROPRIETARY STATEMENT =                                          */ 00589000
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */ 00601700
*/*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     */ 00614400
*/*  5695-047 (C) COPYRIGHT IBM CORP. 1982, 1990                     */ 00627100
*/*  SEE COPYRIGHT INSTRUCTIONS                                      */ 00639800
*/*                                                                  */ 00652600
*/* STATUS = HBB4410                                                 */ 00663500
*/*                                                                  */ 00674400
*/* CHANGE ACTIVITY                                                  */ 00685300
*/*                                                                  */ 00696200
*/*           @ZA28730  8/12/77                                      */ 00707100
*/*                                                                  */ 00718000
*/*           $L1=PROD310,HBB3310,860716,PDF5:                       */ 00728900
*/*               Add a copyright notice to the prolog.          @L1A*/ 00739800
*/*                                                                  */ 00750700
*/*           $L2=PROD310,HBB3310,870603,PDF5:                       */ 00761600
*/*               Copyright changes                              @L2A*/ 00772500
*/*                                                                  */ 00783400
*/*           $L3=PR320,HBB3320,880919,PDT6:                         */ 00794300
*/*               Copyright changes, remove double prologs.          */ 00801500
*/*               Shipped in SP320, which became SP410.          @L3A*/ 00808700
*/*                                                                  */ 00816100
*/********************************************************************/ 00827000
*%GOTO CPABBSL2;   /*                                            @L3A   00837900
         SPACE   1                                                      00850000
CPABCPID DS    F   CPID FOR THIS POOL (ADDRESS OF THE ORIGINAL CPAB     00900000
*                  IN AN EXTENSION CPAB)                                00910000
CPABCSZE DS    F   SIZE OF EACH CELL                                    00950000
CPABDEQC DS    F   COUNT OF NUMBER OF CELLS CURRENTLY ALLOCATED         00960000
*                  FROM THIS POOL SEGMENT.                              00970000
CPABFACP DS    F     FIRST AVAILABLE CELL POINTER                       01000000
CPABFLGW DS    0F    FLAG AND COUNT WORD (USED FOR LOCKING A SEGMENT)   01050000
CPABSPID DS    CL1   SUBPOOL NUMBER OF POOL (ZERO IN EXTENSION CPABE)   01100000
CPABFLGS DS    BL1   FLAGS                                              01150000
NIPBLDCP EQU   X'80' ORIGINAL POOL WAS CREATED DURING NIP AND           01200000
*                    CANNOT BE DELETED                                  01250000
BLDDWORD EQU   X'40' CELLS IN THIS POOL MUST BE ALIGNED ON A            01300000
*                    DOUBLE WORD BOUNDARY.                              01320000
ADELCAND EQU   X'20' THIS EXTENT IS A CANDIDATE FOR AUTOMATIC DELETION  01350000
CPABEXTN EQU   X'10' FLAGS AN ORIGINAL CPAB (0) OR AN EXTENSION         01370000
*                    CPAB (1)                                           01380000
DELETELK EQU   X'08' THIS SEGMENT IS IN THE PROCESS OF BEING DELETED    01390000
SERIAL   EQU   X'04' CALLER HAS GUARANTEED SERIALIZATION       @ZA28730 01392000
CPABUSE# DS    H     COUNT OF CONCURRENT OPERATIONS ON THIS SEGMENT     01394000
CPABSTAD DS    F     START ADDRESS OF THIS POOL SEGMENT                 01400000
CPABENAD DS    F     END ADDRESS OF THIS POOL SEGMENT                   01450000
CPABNXTP DS    F     PTR TO NEXT CPABE/0                                01500000
CPABEND  DS    0C    CPAB END                                           01510000
CPABLEN  EQU   CPABEND-CPAB    LENGTH OF THE CPAB                       01530000
         MEND    ,    */                                                01550000
*%CPABBSL2   :   ;                                                      01600000
*DCL  1  CPAB  BASED(CPABPTR),                                          01900000
*        2  CPABCPID  FIXED(31),  /*CPID FOR THIS POOL (ADDRESS OF   */ 01950000
*                                 /*THE ORIGINAL CPAB IN AN*/           01952000
*                                 /*EXTENSION CPAB*/                    01962000
*        2  CPABCSZE  FIXED(31),  /*SIZE OF EACH CELL*/                 02000000
*        2  CPABDEQC  FIXED(31),  /*COUNT OF CELLS CURRENTLY */         02010000
*                                 /*ALLOCATED FROM THIS POOL SEGMENT*/  02020000
*        2  CPABFACP  PTR(31),    /*FIRST AVAILABLE CELL PTR*/          02050000
*        2  CPABFLGW  FIXED(32),  /* LOCKING WORD FIELD -- CONTAINS */  02100000
*                                 /* FLAGS AND COUNT USED TO LOCK */    02110000
*                                 /* THE POOL SEGMENT */                02120000
*          3  CPABSPID  CHAR(1),    /*SUBPOOL NUMBER OF POOL*/          02150000
*                                 /*(ZERO IN EXTENSION CPABE)*/         02160000
*          3  CPABFLGS BIT(8),      /*FLAGS*/                           02200000
*               4  NIPBLDCP  BIT(1),  /*THE ORIGINAL POOL WAS CREATED*/ 02250000
*                                   /*DURING NIP AND CANNOT BE       */ 02300000
*                                   /*DELETED*/                         02350000
*               4  BLDDWORD BIT(1), /* CELLS IN THIS POOL MUST BE */    02400000
*                                   /* ALIGNED ON ANY WORD BOUNDARY. */ 02420000
*               4  ADELCAND  BIT(1), /* THIS EXTENT IS A CANDIDATE */   02500000
*                                   /* FOR AUTOMATIC DELETION*/         02550000
*               4  CPABEXTN  BIT(1), /*FLAGS AN ORIGINAL CPAB (0)*/     02600000
*                                  /*OR AN EXTENSION CPAB (1)*/         02610000
*               4  DELETELK  BIT(1), /*INDICATES THAT THIS SEGMENT*/    02620000
*                                  /*   IS BEING DELETED */             02630000
*               4  SERIAL BIT(1),  /* CALLER HAS GUARANTEED             02633000
*                                     SERIALIZATION   @ZA28730*/        02636000
*          3  CPABUSE#  FIXED(15),  /*NUMBER OF CURRENT OPERATIONS */   02640000
*                                  /* ON THIS SEGMENT AT THIS TIME */   02642000
*        2  CPABSTAD  PTR(31),    /* START ADDRESS OF THIS SEGMENT*/    02650000
*        2  CPABENAD  PTR(31),    /* END ADDRESS OF THIS SEGMENT*/      02700000
*        2  CPABNXTP  PTR(31);    /*PTR TO NEXT CPABE*/                 02750000
