*        %GOTO CBLSL1; /*                                               00050000
         MACRO                                                          00100000
         IHACBLS    &DSECT=YES,&LIST=NO     */                          00150000
*%CBLSL1 : ;                                                            00200000
*/* START OF SPECIFICATIONS ******************************************/ 00225000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00250000
*/*01* PROPRIETARY STATEMENT =                                   @LEC*/ 00275000
*/*                                                                  */ 00300000
*/*      LICENSED MATERIALS  PROPERTY OF IBM                         */ 00350000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00550000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1985, 2000                 */ 00600000
*/*                                                                  */ 00900000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00916600
*/*                                                                  */ 00944400
*/*01* STATUS = HBB7703                                              */ 00960600
*/*                                                                  */ 00976800
*/*01* ACRONYM: CBLS                                                 */ 00981400
*/*                                                                  */ 00986000
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 00990600
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00995200
*/*                                                                  */ 01000000
*/*01* DESCRIPTIVE NAME:  Supervisor Control Block Length Table      */ 01050000
*/*02*  ACRONYM:  CBLS                                               */ 01100000
*/*                                                                  */ 01150000
*/*01* MACRO-NAME = IHACBLS                                          */ 01200000
*/*                                                                  */ 01450000
*/*01* DSECT NAME:                                                   */ 01452700
*/*     CBLS                                                         */ 01455400
*/*                                                                  */ 01458100
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 01460800
*/*                                                                  */ 01463500
*/*01* EYE-CATCHER:  CBLS                                            */ 01466200
*/*02*  OFFSET:  0                                                   */ 01468900
*/*02*  LENGTH:  4                                                   */ 01471600
*/*                                                                  */ 01474300
*/*01* STORAGE ATTRIBUTES:                                           */ 01477000
*/*02*  RESIDENCY:  Nucleus Resident (Read only Section)             */ 01479700
*/*                                                                  */ 01482400
*/*01* SIZE:                                                         */ 01485100
*/*     OFFSET OF CBLEND MINUS THE OFFSET OF CBLS                    */ 01486400
*/*                                                                  */ 01487800
*/*01* CREATED BY:                                                   */ 01490500
*/*     IEAVCBLS                                                     */ 01493200
*/*                                                                  */ 01495900
*/*01* POINTED TO BY:                                                */ 01498600
*/*     SVTCBLS                                                      */ 01501300
*/*     ECVTCBLS                                                     */ 01502600
*/*                                                                  */ 01504000
*/*01* SERIALIZATION:                                                */ 01506700
*/*     None.                                                        */ 01509400
*/*                                                                  */ 01512100
*/*01* FUNCTION:                                                     */ 01514800
*/*02*  Contains the lengths and level numbers of various control    */ 01517500
*/*     blocks.                                                      */ 01520200
*/*                                                                  */ 01522900
*/*01* PURPOSE:  Provide Data Mapping for the CBLS Table             */ 01525600
*/*              created by IEAVCBLS                                 */ 01528300
*/*                                                                  */ 01531000
*/*01* METHOD OF ACCESS:                                             */ 01533700
*/*02*  ASM:                                                         */ 01536400
*/*      DSECT is produced unless DSECT=NO is specified.             */ 01539100
*/*      USING on CBLS gives Addressability for all symbols.         */ 01541800
*/*      Pointed to by SVTCBLS.  IHASVT must be included.            */ 01544500
*/*   or Pointed to by ECVTCBLS. IHAECVT must be included.           */ 01545800
*/*      Specify LIST=YES on Macro call for listing.                 */ 01547200
*/*02*  PL/AS:                                                       */ 01549900
*/*      Is Based on SVTCBLS.                                        */ 01552600
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 01555300
*/*                                                                  */ 01558300
*/*01* ATTRIBUTES =                                                  */ 01566600
*/*      CREATED BY : MODULE IEAVCBLS                                */ 01574900
*/*      DELETED BY : NOT DELETED                                    */ 01583200
*/*      LOCATION   : NUCLEUS                                        */ 01591500
*/*01* DEPENDENCIES:                                                 */ 01594300
*/*      None.                                                       */ 01597100
*/*                                                                  */ 01600000
*/*01* DISTRIBUTION LIBRARY: AMODGEN                                 */ 01650000
*/*                                                                  */ 01700000
*/*01* CHANGE-ACTIVITY:                                              */ 01733300
*/*  $LA=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 01766600
*/*                                                                  */ 01800000
*/* END OF SPECIFICATIONS ********************************************/ 01850000
*%GOTO CBLSL2; /*                                                       01900000
         AIF   ('&DSECT' EQ 'NO').CBLS10                                01950000
.********************************************************************** 02000000
.*                                                                      02050000
.*   CHANGE ACTIVITY =                                                  02100000
.*  $H0=VF       JBB2214  840120  PD16H5:  VECTOR FEATURE               02150000
.*  $D1=DCR0009  JBB2214  841015  PD16G1:  ASSB SUPPORT                 02200000
.*  $L1=IOGEN    JBB2220  840806  PD16Q4:  IOGEN RESTRUCTURE            02250000
.*                                         IEAVBK BREAKUP               02300000
.*  $L2=AR       HBB3310  850903  PD16Q9:  ACCESS REGISTERS             02325000
.*  $D2=DCR0026  HBB3310  860416  PD16H4:  NSSA SUPPORT                 02337500
.*  $L3=ILIBS    JBB3311  880229  PD16LD:  ILIB                         02343700
.*  $L4=LOCKR    HBB4410  870622  PD16BN:  LOCK RESTRUCTURE             02344600
.*  $L5=LOCKR    HBB4410  871030  PD16LD:  LOCK RESTRUCTURE             02345500
.*  $L6=ASCB     HBB4410  871030  PD16LD:  ASCB VSCR                    02346400
.*  $L7=JUP03    HBB4410  880711  PD16CU:  SMS SUPPORT                  02347300
.*  $L8=COUPL    HBB4410  880711  PD16Q4:  XCF SUPPORT                  02348200
.*  $L9=USERV    HBB4410  890626  PD16EI:  UCB SUPPORT(EXTEND ASSB)     02349100
.*  $01=OY27050  JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC        02349200
.*                                         FEATURE SUPPORT              02349300
.*  $D3=DH30019  HBB4420  890710  PD16ES:  APPC SUPPORT                 02349500
.*  $LA=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete      02349600
.*  $LB=POSIX    HBB4430  910528  PD16EI:  POSIX SUPPORT(EXTEND ASSB)   02349700
.*  $LC=POSIX    HBB4430  911128  PD16CU:  IHASXSB added                02349800
.*  $LD=SUBSP    HBB5510  921203  PD16IW:  SUBSPACES                    02351800
.*  $P1=PIG1646  HBB5510  930520  PD16IG:  Extend STCB for first time   02353800
.*                                         in HBB5510, bump level # by  02355800
.*                                         one.  Now 5.  PTM PIG1646    02357800
.*                                         (EXCP integrity) support.    02359800
.*  $LE=DISPR    HBB5510  920501  PD16CU:  DISPATCHER RESTRUCTURE       02363800
.*  $LF=DISPR    HBB5510  920801  PD16XZ:  DISPATCHER RESTRUCTURE       02365800
.*  $P2=PIG1863  HBB5510  930715  PD16EI:  Extend ASSB                  02367800
.*  $LG=LOGGR    HBB5520  930513  PD16EI:  SYSTEM LOGGER SUPPORT        02371600
.*  $LH=ENCLV    HBB5520  940210  PD16EI:  Extend ASSB for ENCLAVE      02375400
.*                                         support.                     02379200
.*  $LI=RRSCTX   HBB6603  950601  PD15H5:  Context Services             02380700
.*  $LJ=PAUSE    HBB7703          B7HGRP:  Extend SXSB                  02381400
.*  $P3=PSY0252  JBB6604  970107  B7VBGD:  Extend STCB                  02382200
.*  $LK=64BITSUP HBB7703  971101  PD00XB:  Context Services             02382700
.*  $LL=DYCHM    HBB7703  000110  U2IAXZ:  Extend ASSB                  02383000
.*                                                                      02383300
.********************************************************************** 02400000
.********************************************************************** 02450000
.*                                                                      02500000
.* WHEN MAKING CHANGES TO THIS MACRO, KEEP IN MIND THAT THE CHANGES     02550000
.*    MUST BE MADE IN THE FOLLOWING THREE SECTIONS:                     02600000
.*           1.  ASSEMBLER (DSECT) VERSION                              02650000
.*           2.  ASSEMBLER (CSECT) VERSION                              02700000
.*           3.  PL/AS (DSECT) VERSION                                  02750000
.*                                                                      02800000
.********************************************************************** 02850000
.*                                                                      02900000
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     02950000
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          03000000
.*                        CBLRXXX  DC    XLNNN'00' - RESERVED.          03050000
.*                            XXX IS THE OFFSET WITHIN THE CBLS         03100000
.*                            NNN IS THE LENGTH OF THE RESERVED FIELD   03150000
.*                                A VALUE FROM 1 TO 256 INCLUSIVE       03200000
.*                                                                      03250000
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT   03300000
.*               MULTIPLES OF EIGHT OR DO NOT START ON A BYTE           03350000
.*               BOUNDARY ARE NOT NAMED.                                03400000
.*                                                                      03450000
.*********************************************************************  03500000
         PUSH  PRINT                                                    03550000
         AIF   ('&LIST' EQ 'YES').CBLLIST                               03600000
         PRINT OFF                                                      03650000
.CBLLIST ANOP                                                           03700000
CBLS     DSECT                                                          03750000
CBLSCBLS DS    CL4                  CBLS ACRONYM                        03800000
CBLR004  DS    XL2                  RESERVED                       @LKC 03833300
CBLCBLSL DS    H                    LENGTH OF THE CBLS             @LKA 03866600
CBLASCB  DS    H                    LENGTH OF THE ASCB                  03900000
CBLASCBL DS    H                    ASCB LEVEL NUMBER                   03950000
CBLTCB   DS    H                    TOTAL LENGTH OF THE TCB             04000000
*                                   (PREFIX + MAIN + EXTENSION)         04050000
CBLTCBP  DS    H                    LENGTH OF THE TCB PREFIX            04100000
CBLTCBM  DS    H                    LENGTH OF MAIN SECTION OF TCB       04150000
CBLTCBL  DS    H                    TCB LEVEL NUMBER                    04200000
CBLIHSA  DS    H                    LENGTH OF THE IHSA                  04250000
CBLIHSAL DS    H                    IHSA LEVEL NUMBER                   04300000
CBLWPRB  DS    H                    LENGTH OF THE WPRB                  04350000
CBLWPRBL DS    H                    WPRB LEVEL NUMBER                   04400000
CBLXSB   DS    H                    LENGTH OF THE XSB                   04450000
CBLXSBL  DS    H                    XSB LEVEL NUMBER                    04500000
CBLSTKH  DS    H                    LENGTH OF THE STACK HEADER          04550000
CBLSTKHL DS    H                    STKH LEVEL NUMBER                   04600000
CBLASXB  DS    H                    LENGTH OF THE ASXB                  04650000
CBLASXBL DS    H                    ASXB LEVEL NUMBER                   04700000
CBLSTCB  DS    H                    LENGTH OF THE STCB                  04750000
CBLSTCBL DS    H                    STCB LEVEL NUMBER                   04800000
CBLVSSA  DS    H                    LENGTH OF STATIC PORTION OF VSSA    04850000
CBLVSSAL DS    H                    VSSA LEVEL NUMBER                   04900000
CBLASSB  DS    H                    LENGTH OF THE ASSB             @D1A 04950000
CBLASSBL DS    H                    ASSB LEVEL NUMBER              @D1A 05000000
CBLNSSA  DS    H                    LENGTH OF THE NSSA             @D2A 05033300
CBLNSSAL DS    H                    NSSA LEVEL NUMBER              @D2A 05066600
CBLSXSB  DS    H                    LENGTH OF THE SXSB             @LCA 05074900
CBLSXSBL DS    H                    SXSB LEVEL NUMBER              @LCA 05083200
CBLWEB   DS    H                    LENGTH OF WEB                  @LEA 05085000
CBLWEBL  DS    H                    WEB LEVEL NUMBER               @LEA 05086800
CBLWEE   DS    H                    LENGTH OF WEE                  @LEA 05088600
CBLWEEL  DS    H                    WEE LEVEL NUMBER               @LEA 05090400
CBLNSQA  DS    H                    LENGTH OF NSQA                 @LFA 05092200
CBLNSQAL DS    H                    NSQA LEVEL NUMBER              @LFA 05094000
CBLR048  DS    XL4                  RESERVED                       @LEA 05095800
CBLR04C  DS    XL2                  RESERVED                       @LEA 05095900
CBLPSAL  DS    H                    Length of PSA being used (this is   05096000
*                                   4K for non-ESAME, 8K for ESAME)     05096100
*                                                                  @LKA 05096200
CBLSLEN  DS    H                    Length(SDWA)                   @LKA 05096300
CBLSPTRS DS    H                    Length(SDWAPTRS)               @LKA 05096400
CBLSRC1  DS    H                    Length(SDWARC1)                @LKA 05096500
CBLSRC2  DS    H                    Length(SDWARC2)                @LKA 05096600
CBLSRC3  DS    H                    Length(SDWARC3)                @LKA 05096700
CBLSRC4  DS    H                    Length(SDWARC4)                @LKA 05096800
CBLSNRC1 DS    H                    Length(SDWANRC1)               @LKA 05096900
CBLSNRC2 DS    H                    Length(SDWANRC2)               @LKA 05097000
CBLSNRC3 DS    H                    Length(SDWANRC3)               @LKA 05097100
CBLSRLNS DS    H                    Length(all recordable)         @LKA 05097200
CBLSNLNS DS    H                    Length(all non-recordable)     @LKA 05097300
*                                                                       05097400
CBLSMLNP DS    H                    SDWA with only recordable but  @LKA 05097500
*                                       no "PTRS"                       05097600
CBLSMLEN DS    H                    SDWA with only recordable      @LKA 05097700
*                                                                       05097800
CBLSTLEN DS    H                    SDWA with all extensions       @LKA 05097900
*                                                                       05098000
CBLSOLEN DS    H                    SDWA with all extensions       @LKA 05098100
*                                       except ESAME (this is for       05098200
*                                       RTM2 below-16M SDWA)            05098300
CBLFWALN DS    H                    FRR workarea length            @LKA 05098400
CBLLCCAL DS    H                    LCCA length                    @LKA 05098500
CBLPCCAL DS    H                    PCCA length                    @LKA 05098600
CBLALEL  DS    H                    ALE  length                    @LKA 05098700
CBLDUCTL DS    H                    DUCT length                    @LKA 05098800
CBLLCCXL DS    H                    LCCX length                    @LKA 05098900
CBLPCCTL DS    H                    PCCAVT length                  @LKA 05099000
CBLRTMC  DS    H                    RTMS length (within RT1W)      @LKA 05099100
CBLSCWA  DS    H                    SCWA                           @LKA 05099200
CBLSCWA1 DS    H                    SCWA1                          @LKA 05099300
CBLSCWA2 DS    H                    SCWA2                          @LKA 05099400
         DS    CL4                  unused                         @LKA 05099500
CBLEND   DS    0D                   END OF THE CBLS                     05100000
         POP PRINT                                                      05150000
         MEXIT                                                          05200000
.*                                                                      05250000
.CBLS10  ANOP                                                           05300000
.*     CSECT VERSION OF THE MACRO (INVOKED BY IEAVCBLS)            @L1C 05350000
.*     GENERATES THE SUPERVISOR CONTROL BLOCK LENGTH TABLE              05400000
.*                                                                      05450000
CBLS     DS    0D                                                       05500000
CBLSCBLS DC    CL4'CBLS'                 CBLS ACRONYM                   05550000
CBLR004  DC    XL2'00'                   RESERVED                  @LKC 05583300
CBLCBLSL DC    AL2(CBLEND-CBLS)          Length of the CBLS        @LKA 05616600
CBLASCB  DC    AL2(ASCBEND-ASCB)         LENGTH OF THE ASCB             05650000
CBLASCBL DC    AL2(ASCBVERS)             ASCB LEVEL NUMBER              05700000
CBLTCB   DC    AL2(TCBLEN)               TOTAL LENGTH OF THE TCB        05750000
*                                        (PREFIX + MAIN + EXTENSION)    05800000
CBLTCBP  DC    AL2(TCBPXLEN)             LENGTH OF THE TCB PREFIX       05850000
CBLTCBM  DC    AL2(TCBMNLEN)             LENGTH OF MAIN SECTION OF TCB  05900000
CBLTCBL  DC    AL2(TCBVERS)              TCB LEVEL NUMBER               05950000
CBLIHSA  DC    AL2(IHSAEND-IHSA)         LENGTH OF THE IHSA             06000000
CBLIHSAL DC    H'2'                      IHSA LEVEL NUMBER         @L4C 06050000
CBLWPRB  DC    AL2(WPRBEND-WPRB)         LENGTH OF THE WPRB             06100000
CBLWPRBL DC    H'0'                      WPRB LEVEL NUMBER              06150000
CBLXSB   DC    AL2(XSBEND-XSB)           LENGTH OF THE XSB              06200000
CBLXSBL  DC    H'2'                      XSB LEVEL NUMBER          @LCC 06250000
CBLSTKH  DC    AL2(STKHEND-STKH)         LENGTH OF THE STACK HEADER     06300000
CBLSTKHL DC    H'0'                      STKH LEVEL NUMBER              06350000
CBLASXB  DC    AL2(ASXBEND-ASXB)         LENGTH OF THE ASXB             06400000
CBLASXBL DC    H'0'                      ASXB LEVEL NUMBER              06450000
CBLSTCB  DC    AL2(STCBEND-STCB)         LENGTH OF THE STCB             06500000
CBLSTCBL DC    H'7'                      STCB LEVEL NUMBER         @P3C 06550000
CBLVSSA  DC    AL2(VSSAFSZE-VSSA)        LENGTH OF STATIC PORTION OF    06600000
*                                        VSSA                           06650000
CBLVSSAL DC    H'0'                      VSSA LEVEL NUMBER              06700000
CBLASSB  DC    AL2(ASSBEND-ASSB)         LENGTH OF THE ASSB        @D1A 06750000
CBLASSBL DC    H'8'                      ASSB LEVEL NUMBER         @LLC 06791600
CBLNSSA  DC    AL2(NSSALEN)              LENGTH OF THE NSSA        @D2A 06833300
CBLNSSAL DC    H'1'                      NSSA LEVEL NUMBER         @L5C 06866600
CBLSXSB  DC    AL2(SXSBEND-SXSB)         LENGTH OF THE SXSB        @LCA 06874900
CBLSXSBL DC    H'2'                      SXSB LEVEL NUMBER         @LJC 06879900
CBLWEB   DC    AL2(WEBEND-WEB)           LENGTH OF WEB             @LEA 06885000
CBLWEBL  DC    H'2'                      WEB LEVEL NUMBER          @LIC 06886800
CBLWEE   DC    AL2(WEEEND-WEE)           LENGTH OF WEE             @LEA 06888600
CBLWEEL  DC    H'1'                      WEE LEVEL NUMBER          @LEA 06890400
CBLNSQA  DC    AL2(NSQALEN)              LENGTH OF THE NSQA        @L2A 06892200
CBLNSQAL DC    H'1'                      NSQA LEVEL NUMBER         @L2A 06894000
CBLR048  DC    XL4'00'                   RESERVED                  @LEA 06895800
CBLR04C  DC    XL2'00'                   RESERVED                  @LEA 06895900
CBLPSAL  DC    AL2(PSAEND-PSA)      Length(PSA) (or + PSAX)        @LKA 06896000
CBLSLEN  DC    AL2(SDWALEN)         Length(SDWA)                   @LKA 06896100
CBLSPTRS DC    AL2(SDWAPLEN)        Length(SDWAPTRS)               @LKA 06896200
CBLSRC1  DC    AL2(SDWACLEN)        Length(SDWARC1)                @LKA 06896300
CBLSRC2  DC    AL2(SDWAILEN)        Length(SDWARC2)                @LKA 06896400
CBLSRC3  DC    AL2(SDWALLEN)        Length(SDWARC3)                @LKA 06896500
CBLSRC4  DC    AL2(SDWAELEN)        Length(SDWARC4)                @LKA 06896600
CBLSNRC1 DC    AL2(SDWARLEN)        Length(SDWANRC1)               @LKA 06896700
CBLSNRC2 DC    AL2(SDWASPL)         Length(SDWANRC2)               @LKA 06896800
CBLSNRC3 DC    AL2(SDWADLEN)        Length(SDWANRC3)               @LKA 06896900
CBLSRLNS DC    AL2(SDWARLNS)        Length(all recordable)         @LKA 06897000
CBLSNLNS DC    AL2(SDWANLNS)        Length(all non-recordable)     @LKA 06897100
*                                                                       06897200
CBLSMLNP DC    AL2(SDWAMLNP)        SDWA with only recordable but  @LKA 06897300
*                                       no "PTRS"                       06897400
CBLSMLEN DC    AL2(SDWAMLEN)        SDWA with only recordable      @LKA 06897500
*                                                                       06897600
CBLSTLEN DC    AL2(SDWATLEN)        SDWA with all extensions       @LKA 06897700
*                                                                       06897800
CBLSOLEN DC    AL2(SDWAOLEN)        SDWA with all extensions       @LKA 06897900
*                                       except ESAME (this is for       06898000
*                                       RTM2 below-16M SDWA)            06898100
CBLFWALN DC    AL2(RT1WFWLN)        FRR workarea length            @LKA 06898200
CBLLCCAL DC    AL2(LCCAEND-LCCA)    LCCA length                    @LKA 06898300
CBLPCCAL DC    AL2(PCCAEND-PCCA)    PCCA length                    @LKA 06898400
CBLALEL  DC    AL2(ALELEN)          ALE length                     @LKA 06898500
CBLDUCTL DC    AL2(DUCTEND-DUCT)    DUCT length                    @LKA 06898600
CBLLCCXL DC    AL2(LCCX_LEN)        LCCX length                    @LKA 06898700
CBLPCCTL DC    AL2(PCCATEND-PCCAVT) PCCAVT length                  @LKA 06898800
CBLRTMC  DC    AL2(RTMC_LEN)        RTMC length                    @LKA 06898900
CBLSCWA  DC    AL2(SCWEND-SCWA)     SCWA length                    @LKA 06899000
CBLSCWA1 DC    AL2(SCW1END-SCWA1)   SCWA1 length                   @LKA 06899100
CBLSCWA2 DC    AL2(SCW2END-SCWA2)   SCWA2 length                   @LKA 06899200
         DC    XL4'00'              unused                         @LKA 06899300
CBLEND   DS    0D                        END OF CBLS                    06900000
         MEND  ,         */                                             06950000
*                                                                       07000000
*%CBLSL2 : ;                                                            07050000
*                                                                       07100000
*  @LISTPUSH;                                                           07150000
*  %IF IHALIST='YES' %THEN                                              07200000
*     %GOTO CBLLIST;                                                    07250000
*  @LISTOFF;                                                            07300000
*  %CBLLIST:;                                                           07350000
*                                                                       07400000
* %IF CBLS_BASE = '' %THEN           /*                         @LKA*/  07416600
* %DO;                               /*                         @LKA*/  07433200
*   %CBLS_BASE = 'SVTCBLS';          /*                         @LKA*/  07449800
* %END;                              /*                         @LKA*/  07466400
* DCL 1 CBLS BASED(CBLS_BASE),       /*                         @LKC*/  07483000
*        2 CBLSCBLS CHAR(4),         /* CBLS ACRONYM                */  07500000
*        2 CBLR004  CHAR(2),         /* RESERVED                @LKC*/  07533300
*        2 CBLCBLSL FIXED(15),       /* Length of the CBLS      @LKC*/  07566600
*        2 CBLASCB  FIXED(15),       /* LENGTH OF THE ASCB          */  07600000
*        2 CBLASCBL FIXED(15),       /* ASCB LEVEL NUMBER           */  07650000
*        2 CBLTCB   FIXED(15),       /* TOTAL LENGTH OF THE TCB         07700000
*                                       (PREFIX + MAIN + EXTENSION) */  07750000
*        2 CBLTCBP  FIXED(15),       /* LENGTH OF THE TCB PREFIX    */  07800000
*        2 CBLTCBM  FIXED(15),       /* LENGTH OF MAIN SECTION OF       07850000
*                                       THE TCB                     */  07900000
*        2 CBLTCBL  FIXED(15),       /* TCB LEVEL NUMBER            */  07950000
*        2 CBLIHSA  FIXED(15),       /* LENGTH OF THE IHSA          */  08000000
*        2 CBLIHSAL FIXED(15),       /* IHSA LEVEL NUMBER           */  08050000
*        2 CBLWPRB  FIXED(15),       /* LENGTH OF THE WPRB          */  08100000
*        2 CBLWPRBL FIXED(15),       /* WPRB LEVEL NUMBER           */  08150000
*        2 CBLXSB   FIXED(15),       /* LENGTH OF THE XSB           */  08200000
*        2 CBLXSBL  FIXED(15),       /* XSB LEVEL NUMBER            */  08250000
*        2 CBLSTKH  FIXED(15),       /* LENGTH OF THE STACK HEADER  */  08300000
*        2 CBLSTKHL FIXED(15),       /* STKH LEVEL NUMBER           */  08350000
*        2 CBLASXB  FIXED(15),       /* LENGTH OF THE ASXB          */  08400000
*        2 CBLASXBL FIXED(15),       /* ASXB LEVEL NUMBER           */  08450000
*        2 CBLSTCB  FIXED(15),       /* LENGTH OF THE STCB          */  08500000
*        2 CBLSTCBL FIXED(15),       /* STCB LEVEL NUMBER           */  08550000
*        2 CBLVSSA  FIXED(15),       /* LENGTH OF STATIC PORTION        08600000
*                                       OF VSSA                     */  08650000
*        2 CBLVSSAL FIXED(15),       /* VSSA LEVEL NUMBER           */  08700000
*        2 CBLASSB  FIXED(15),       /* LENGTH OF THE ASSB      @D1A*/  08750000
*        2 CBLASSBL FIXED(15),       /* ASSB LEVEL NUMBER       @D1A*/  08800000
*        2 CBLNSSA  FIXED(15),       /* LENGTH OF THE NSSA      @D2A*/  08833300
*        2 CBLNSSAL FIXED(15),       /* NSSA LEVEL NUMBER       @D2A*/  08866600
*        2 CBLSXSB  FIXED(15),       /* LENGTH OF THE SXSB      @LCA*/  08875400
*        2 CBLSXSBL FIXED(15),       /* SXSB LEVEL NUMBER       @LCA*/  08884200
*        2 CBLWEB   FIXED(15),       /* LENGTH OF THE WEB       @LEA*/  08885900
*        2 CBLWEBL  FIXED(15),       /* WEB LEVEL NUMBER        @LEA*/  08887600
*        2 CBLWEE   FIXED(15),       /* LENGTH OF THE WEE       @LEA*/  08889300
*        2 CBLWEEL  FIXED(15),       /* WEE LEVEL NUMBER        @LEA*/  08891000
*        2 CBLNSQA  FIXED(15),       /* LENGTH OF THE NSQA      @LFA*/  08892700
*        2 CBLNSQAL FIXED(15),       /* NSQA LEVEL NUMBER       @LFA*/  08894400
*        2 CBLR048  CHAR(4),         /* RESERVED                @LFC*/  08896100
*        2 CBLR04C  CHAR(2),         /* RESERVED                @LKC*/  08896200
*        2 CBLPSAL  FIXED(15),       /* Length of PSA being used        08896300
*                            (this is 4K for non-ESAME, 8K for          08896400
*                             ESAME)                            @LKA*/  08896500
*        2 CBLSLEN  FIXED(15),       /* Length(SDWA)            @LKA*/  08896600
*        2 CBLSPTRS FIXED(15),       /* Length(SDWAPTRS)        @LKA*/  08896700
*        2 CBLSRC1  FIXED(15),       /* Length(SDWARC1)         @LKA*/  08896800
*        2 CBLSRC2  FIXED(15),       /* Length(SDWARC2)         @LKA*/  08896900
*        2 CBLSRC3  FIXED(15),       /* Length(SDWARC3)         @LKA*/  08897000
*        2 CBLSRC4  FIXED(15),       /* Length(SDWARC4)         @LKA*/  08897100
*        2 CBLSNRC1 FIXED(15),       /* Length(SDWANRC1)        @LKA*/  08897200
*        2 CBLSNRC2 FIXED(15),       /* Length(SDWANRC2)        @LKA*/  08897300
*        2 CBLSNRC3 FIXED(15),       /* Length(SDWANRC3)        @LKA*/  08897400
*        2 CBLSRLNS FIXED(15),       /* Length(all recordable)  @LKA*/  08897500
*        2 CBLSNLNS FIXED(15),       /* Length(all non-recordable)      08897600
*                                                               @LKA*/  08897700
*        2 CBLSMLNP FIXED(15),       /* SDWA with only recordable but   08897800
*                                       no "PTRS"               @LKA*/  08897900
*        2 CBLSMLEN FIXED(15),       /* SDWA with only recordable       08898000
*                                                               @LKA*/  08898100
*        2 CBLSTLEN FIXED(15),       /* SDWA with all extensions        08898200
*                                                               @LKA*/  08898300
*        2 CBLSOLEN FIXED(15),       /* SDWA with all extensions        08898400
*                                       except ESAME (this is for       08898500
*                                       RTM2 below-16M SDWA)    @LKA*/  08898600
*        2 CBLFWALN FIXED(15),       /* FRR workarea length     @LKA*/  08898700
*        2 CBLLCCAL FIXED(15),       /* LCCA                    @LKA*/  08898800
*        2 CBLPCCAL FIXED(15),       /* PCCA                    @LKA*/  08898900
*        2 CBLALEL  FIXED(15),       /* ALE                     @LKA*/  08899000
*        2 CBLDUCTL FIXED(15),       /* DUCT                    @LKA*/  08899100
*        2 CBLLCCXL FIXED(15),       /* LCCX                    @LKA*/  08899200
*        2 CBLPCCTL FIXED(15),       /* PCCAVT                  @LKA*/  08899300
*        2 CBLRTMC  FIXED(15),       /* RTMC within IHART1W     @LKA*/  08899400
*        2 CBLSCWA  FIXED(15),       /* SCWA                    @LKA*/  08899500
*        2 CBLSCWA1 FIXED(15),       /* SCWA1                   @LKA*/  08899600
*        2 CBLSCWA2 FIXED(15),       /* SCWA2                   @LKA*/  08899700
*        2 * CHAR(4),                /* Unused                  @LKA*/  08899800
*        2 CBLEND CHAR(0) BDY(DWORD);/* END OF CBLS                 */  08900000
* @LISTPOP;                                                             08950000
