*        %GOTO CSDL1;   /*                                              00100002
         MACRO                                                          00150002
         IHACSD &DSECT=YES    */                                        00200002
*%CSDL1 : ;                                                             00250002
*                                                                       00300002
*/** START OF SPECIFICATIONS ****************************************** 00308400
*                                                                       00316800
*01* DESCRIPTIVE NAME:                                                  00342000
*                                                                       00350400
*      COMMON SYSTEM DATA AREA (CSD).                                   00358800
*                                                                       00367200
*02* ACRONYM:    CSD.                                              @H9A 00368600
*                                                                       00368800
*01* EXTERNAL CLASSIFICATION:                                           00369000
*02*         DMTI:BASE                                                  00369200
*02*         PSPI:FIELDS                                                00369400
*                  CSDCPUVF                                             00369600
*                  CSDCPUAL                                             00369900
*02*         GUPI:FIELDS                                                00370200
*                  CSDCPUOL                                             00370500
*01* END OF EXTERNAL CLASSIFICATION:                                    00370800
*                                                                       00371100
*01* MACRO NAME: IHACSD.                                                00371400
*                                                                       00372800
*01* DSECT NAME: CSD.                                              @H9A 00374200
*                                                                       00375600
*01* COMPONENT: RECONFIGURATION (SC1CZ).                           @H9C 00377000
*                                                                       00378400
*01* EYE-CATCHER: CSD.                                             @H9C 00379800
*02* OFFSET:      0                                                @H9C 00381200
*02* LENGTH:      4                                                @H9C 00382600
*                                                                       00384000
*01* COPYRIGHT:                                                         00392400
*                                                                       00400800
*       5647-A01                                                   @P1C 00409200
*       THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                    00417600
*       (C) COPYRIGHT IBM CORP. 1980, 2000                              00426000
*       LICENSED MATERIALS - PROPERTY OF IBM                            00434400
*                                                                       00442800
*01* STATUS: HBB7703                                                    00451200
*                                                                       00459600
*01* FUNCTION:                                                          00468000
*                                                                       00476400
*      CONTAINS INFORMATION ABOUT THE PROCESSORS IN THE SYSTEM.         00484800
*                                                                       00501600
*01* METHOD OF ACCESS:                                                  00518400
*                                                                       00526800
*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.           00535200
*             USING ON CSD GIVES ADDRESSABILITY FOR ALL SYMBOLS.        00543600
*      PL/S - %INCLUDE SYSLIB(CVT) TO DEFINE CVTCSD AND CVTCSDRL.       00552000
*                                                                       00560400
*01* POINTED TO BY: CVT FIELDS CVTCSD AND CVTCSDRL.                     00568800
*                                                                       00577200
*01* CREATED BY: IEAVNIP0 DURING NIP.                                   00585600
*                                                                       00594000
*01* DELETED BY: NONE.                                                  00602400
*                                                                       00610800
*01* STORAGE ATTRIBUTES:                                                00619200
*                                                                       00627600
*02*   SUBPOOL: 245.                                                    00636000
*                                                                       00644400
*02*   KEY: 0, NOT FETCH PROTECTED.                                     00652800
*                                                                       00661200
*02*   RESIDENCY: BELOW 16M, SQA.                                       00669600
*                                                                       00678000
*02*   FREQUENCY: ONE PER SYSTEM.                                       00686400
*                                                                       00694800
*01* SIZE: 312 BYTES.                                                   00703200
*                                                                       00720000
*01* SERIALIZATION: COMPARE AND SWAP.                                   00736800
*                                                                       00745200
*01* DISTRIBUTION LIBRARY: AMODGEN                                      00753600
*                                                                       00762000
*01* CHANGE ACTIVITY:                                                   00770400
*                                                                       00778800
* @G860PVB - MVS/SP2.1 HBB2102                                          00787200
*                                                                       00795600
* Flag Reason   Release Date   Origin                                   00804000
*                                                                       00812400
* $T1= UZ90279  JBB2110 830824 PD22: OZ72443 4381 SUPPORT.         @T1A 00820800
* $H1= ADVPROC2 JBB2133 820901 PD22: AXP.                          @H1A 00829200
* $H2= VF       JBB2214 840209 PD22: VECTOR FEATURE.               @H2A 00837600
* $D1= DCRR0008 JBB2214 840806 PDXU: VECTOR FEATURE.               @D1A 00846000
* $H3= RG       JBB2217 850827 PD1V: 3090 MODEL 400 SUPPORT.       @H3A 00854400
* $L1= EXSPIN   HBB3310 861029 PD1X: EXCESSIVE SPIN SUPPORT.       @L1A 00862800
* $L2= AR       HBB3310 861215 PD1V: ACCESS REGISTERS.             @L2A 00871200
* $L3= AR       HBB3310 861215 PDR7: ACCESS REGISTERS.             @L3A 00879600
* $D2= DCRR0147 HBB3310 870216 PD1X: REMOVE CSDXSLF.               @D2A 00888000
* $D3= DCRR0221 HBB3310 870406 PD1X: ADD CSDTMPES.                 @D3A 00896400
* $L4= EREPR    JBB3311 880219 PDDN: ADD CSDCPSID AND CSDDYNPT TO  @L4A 00904800
*                                    SUPPORT STATIC/DYNAMIC PART   @L4A 00913200
* $L5= ASYNC    HBB4410 880822 PDR7: ASYNCHRONOUS SERVICE          @L5A 00918800
*                                    PROCESSOR INTERFACE.          @L5A 00924400
* $L6= ASYNC    HBB4410 880501 PDR7: ASYNCHRONOUS SERVICE          @L6A 00926200
*                                    PROCESSOR INTERFACE.          @L6A 00928000
* $H4= CNITG    HBB4410 890501 PDXM: CONSOLE INTEGRATION.          @H4A 00929000
* $H5= CNITG    HBB4410 890605 PDR7: CONSOLE INTEGRATION.          @H5A 00929500
* $H6= CNITG    HBB4410 890716 PDDN: CONSOLE INTEGRATION.          @H6A 00929700
* $P1= PEO4494  HBB4410 900613 PDAA: Change program number.        @P1A 00929800
* $01= OY30030  HBB3310 900601 PD22: GLOBAL SPIN-LOOP EXEMPTION    @01A 00934000
* $H7= OY27049  JBB3313 880313 PDU6: CRYPTO SUPPORT.               @H7A 00934500
* $L7= SYSRE    JBB4422 900928 PDEH: Fast System Restart.          @L7A 00935000
* $P2= PKI0187  JBB4422 910328 PDAA: Delete CSDIOML                @P2A 00935500
* $H8= PRSMM    HBB4430 911204 PDMB: PRSMM support                 @H8A 00935800
* $P3= PKB0269  HBB4430 911230 PDMB: Initialize DC                 @P3A 00935900
* $02= OY52006  HBB4410 920224 PDAA: Change Maclib to AMODGEN      @02A 00936000
* $P4= PKB0004  HBB4430 920731 PDHC: Flag byte for Excessive Spin  @P4A 00936800
* $03= OY56486  JBB4422 920914 PDAA: New bit for CPU init complete @03A 00937000
* $04= OY59237  JBB4422 921119 PDAA: PE OF OY52006 - pckging prob  @04A 00937200
* $P5= PIG2272  HBB5510 931103 PDHC: SHOWHDR compliance and CDPI.  @P5A 00937400
* $P6= PN70927  HBB5520 940908 PDHC: Change CSDCPUOL to GUPI.      @P6A 00937500
* $P7= PN70886  HBB5520 941216 PDHC: Define CSDNDPAR to indicate   @P7A 00939000
*                                    a shared PR/SM partition.     @P7A 00940500
* $P8= PQC1224  HBB6603 960613 PDHC: Change CSDCPUAL to PSPI.      @P8A 00941200
* $L8= LPAR_RCF HBB7703 990930 PDXB: WLM-managed                   @L8A 00941600
*                                                                       00942000
* END OF SPECIFICATIONS                                              */ 00943800
*%GOTO CSDL2;  /*                                                       00950002
         SPACE 1                                                        01000002
         AIF   ('&DSECT' EQ 'NO').CSD0010                               01050002
CSD      DSECT                                                          01100002
         AGO   .CSD0020                                                 01150002
.CSD0010 ANOP                                                           01200002
         DS    0D                                                       01250002
CSD      EQU   *                                                        01300002
.CSD0020 ANOP                                                           01350002
CSDCSD   DC    CL4'CSD ' -    CONTROL BLOCK ACRONYM IN EBCDIC           01400002
CSDCPUJW DS    0F             CPUS AVAILABLE FOR JOB SCHEDULING    @D1A 01414200
*                             INFORMATION WORD.                    @D1A 01428400
*                             SERIALIZATION - SYSZCSD.CSDCPUJS     @D1A 01442600
*                             RESOURCE AND CS.                     @D1A 01456800
*                             ONLY CS DURING ACR.                  @D1A 01471000
CSDCPUJS DC    XL2'00' -      BIT MASK OF CPUS AVAILABLE FOR JOB        01485200
*                             SCHEDULING                                01500002
CSDCHAD  DC    H'0' -         HIGHEST CHANNEL ADDRESS SYSGENED.         01520000
CSDCPUOW DS    0F             CPUS ONLINE INFORMATION WORD.        @D1A 01540000
*                             SERIALIZATION - SYSZVARY.CPU         @D1A 01560000
*                             RESOURCE AND CS.                     @D1A 01580000
*                             ONLY CS DURING ACR.                  @D1A 01600000
CSDSAFF  DS    0XL2 -         BIT MASK OF CPUS AVAILABLE TO PROCESS     01620000
*                             SERVICE REQUESTS (SRB'S)                  01640000
CSDCPUAL DC    XL2'00' -      BIT MASK OF CPUS CURRENTLY ALIVE          01660000
CSDCPUOL DC    H'0' -         NUMBER OF CPUS CURRENTLY ALIVE            01680000
CSDSCWRD DS    0BL4 -         SUPERVISOR CONTROL INFORMATION            01700002
CSDSCFL1 DC    XL1'00' -      FIRST BYTE OF CSDSCWRD                    01750002
CSDRV042 EQU   X'80',,C'X' -  RESERVED                                  01800000
CSDSYSND EQU   X'40' -        SYSTEM-WIDE NON-DISPATCHABILITY BIT.      02000002
*                             INDICATES ALL ADDRESS SPACES (SRB'S AND   02050002
*                             TASKS) ARE NON-DISPATCHABLE EXCEPT THOSE  02100002
*                             WITH EXEMPT STATUS (ASCBXMPT)             02150002
CSDRV001 EQU   X'20',,C'X' -  RESERVED                                  02200002
CSDRV002 EQU   X'10',,C'X' -  RESERVED                                  02250002
CSDRV003 EQU   X'08',,C'X' -  RESERVED                                  02300002
CSDRV004 EQU   X'04',,C'X' -  RESERVED                                  02350002
CSDRV005 EQU   X'02',,C'X' -  RESERVED                                  02400002
CSDRV006 EQU   X'01',,C'X' -  RESERVED                                  02450002
CSDSCFL2 DC    XL1'00' -      SECOND BYTE OF CSDSCWRD                   02500002
CSDRV007 EQU   X'80',,C'X' -  RESERVED                                  02550002
CSDRV008 EQU   X'40',,C'X' -  RESERVED                                  02600002
CSDRV009 EQU   X'20',,C'X' -  RESERVED                                  02650002
CSDRV010 EQU   X'10',,C'X' -  RESERVED                                  02700002
CSDRV011 EQU   X'08',,C'X' -  RESERVED                                  02750002
CSDRV012 EQU   X'04',,C'X' -  RESERVED                                  02800002
CSDRV013 EQU   X'02',,C'X' -  RESERVED                                  02850002
CSDRV014 EQU   X'01',,C'X' -  RESERVED                                  02900002
CSDSCFL3 DC    XL1'00' -      THIRD BYTE OF CSDSCWRD                    02950002
CSDRV015 EQU   X'80',,C'X' -  RESERVED                                  03000002
CSDRV016 EQU   X'40',,C'X' -  RESERVED                                  03050002
CSDRV017 EQU   X'20',,C'X' -  RESERVED                                  03100002
CSDRV018 EQU   X'10',,C'X' -  RESERVED                                  03150002
CSDRV019 EQU   X'08',,C'X' -  RESERVED                                  03200002
CSDRV020 EQU   X'04',,C'X' -  RESERVED                                  03250002
CSDRV021 EQU   X'02',,C'X' -  RESERVED                                  03300002
CSDRV022 EQU   X'01',,C'X' -  RESERVED                                  03350002
CSDSCFL4 DC    XL1'00' -      FOURTH BYTE OF CSDSCWRD                   03400002
CSDRV023 EQU   X'80',,C'X' -  RESERVED                                  03450002
CSDRV024 EQU   X'40',,C'X' -  RESERVED                                  03500002
CSDRV025 EQU   X'20',,C'X' -  RESERVED                                  03550002
CSDRV026 EQU   X'10',,C'X' -  RESERVED                                  03600002
CSDRV027 EQU   X'08',,C'X' -  RESERVED                                  03650002
CSDRV028 EQU   X'04',,C'X' -  RESERVED                                  03700002
CSDRV029 EQU   X'02',,C'X' -  RESERVED                                  03750002
CSDRV030 EQU   X'01',,C'X' -  RESERVED                                  03800002
CSDAXPOW DS    0F             RESERVED -- DO NOT REUSE             @L6C 03847600
CSDAXPAL DC    XL2'00'        RESERVED -- DO NOT REUSE             @L6C 03895200
CSDAXPOL DC    H'0'           RESERVED -- DO NOT REUSE             @L6C 03942800
CSDMF1CP DC    XL2'00' -      BIT MASK OF CPUS VARIED ON OR OFFLINE.    03990400
*                             MF/1 TESTS THESE FLAGS AT REPORTING       04017600
*                             INTERVALS FOR CPU VARY ACTIVITY AND THEN  04044800
*                             RESETS THEM TO ZERO                       04072000
CSDACR   DC    XL1'00' -      VALUE OF X'FF' MEANS ACR IS IN PROGRESS   04100002
CSDFLAGS DC    XL1'00' -      FLAG BYTE                                 04131100
CSDMP    EQU   X'80' -        RESERVED - DO NOT USE                @L7C 04177700
CSDSTCHK EQU   X'40' -        STORAGE CHECK INDICATOR - SET BY RSM      04224400
*                             WHENEVER IT MARKS A FRAME 'BAD' BECAUSE   04255500
*                             OF A STORAGE ERROR MACHINE CHECK. IT IS   04286600
*                             TESTED IN VARY STORAGE ELEMENT OFFLINE    04317700
*                             PROCESSING.                      @G875P9A 04348800
CSDCPUDN EQU   X'20',,C'X' -  GLOBAL BIT INDICATING CPU INITIALIZATION  04359100
*                             IS COMPLETE SO THAT OTHER COMPONENTS      04369400
*                             CAN PERFORM THEIR PROCESSING         @03C 04379700
CSDNDPAR EQU   X'10',,C'X' -  RUNNING IN NON-DEDICATED PARTITION.  @P7A 04385800
CSDRV035 EQU   X'08',,C'X' -  RESERVED                                  04392002
CSDRV036 EQU   X'04',,C'X' -  RESERVED                                  04394002
CSDRV037 EQU   X'02',,C'X' -  RESERVED                                  04396002
CSDRV038 EQU   X'01',,C'X' -  RESERVED                                  04398002
CSDMAFF  DC    XL80'00' -     CPU-AFFINITY FEATURE TABLE                04400002
*                             (TEN 8-BYTE ENTRIES)                      04450002
CSDCPWLM DC    XL2'00' -      Bit mask of CPUs manipulated by WLM. If  *04461400
                              bit x is on, then WLM put the CPU into   *04472800
                              its current state (online/offline)   @L8A 04484200
CSDDDRCT DC    H'0' -         DDR DEVICE ALLOCATION INTERFACE COUNT     04495600
*                             FIELD.  ACCESSED AND MODIFIED UNDER CMS   04518400
*                             LOCK.  INCREMENTED BY DDR TO INDICATE TO  04541200
*                             DYNAMIC ALLOCATION THAT DDR EXCHANGED     04564000
*                             ADDRESSES IN THE IOS LOOKUP TABLE.        04586800
CSDGDCC  DC    F'0' -         COUNT OF USABLE CLOCK COMPARATORS         04610002
*                             CURRENTLY IN THE CONFIGURATION            04620000
CSDGDINT DC    F'0' -         COUNT OF USABLE CPU TIMERS CURRENTLY IN   04630002
*                             THE CONFIGURATION                         04631000
CSDGDTOD DC    F'0' -         COUNT OF CPUS THAT HAVE ACCESS TO A GOOD  04632000
*                             TOD CLOCK                                 04633000
CSDTCNT  DC    F'0' -         COUNT OF TAPE ALLOCATIONS IN PROGRESS     04634000
CSDUCNT  DC    F'0' -         COUNT OF UNIT RECORD ALLOCATIONS IN       04635000
*                             PROGRESS                                  04636000
CSDMASK  DS    0XL32 -        TABLE OF BIT MASKS FOR TESTING BITS IN   X04637000
                              CSDCPUAL, INDEXED FROM 1 TO 16.           04638000
CSDMASK0 DS    0XL32 -        TABLE OF BIT MASKS FOR TESTING BITS IN   X04639000
                              CSDCPUAL, INDEXED FROM 0 TO 15.      @L2A 04640000
         DC    X'8000' -      CPU 0                                     04641000
         DC    X'4000' -      CPU 1                                     04642000
         DC    X'2000' -      CPU 2                                     04643000
         DC    X'1000' -      CPU 3                                     04644000
         DC    X'0800' -      CPU 4                                     04645000
         DC    X'0400' -      CPU 5                                     04646000
         DC    X'0200' -      CPU 6                                     04647000
         DC    X'0100' -      CPU 7                                     04648000
         DC    X'0080' -      CPU 8                                     04649000
         DC    X'0040' -      CPU 9                                     04650000
         DC    X'0020' -      CPU A                                     04651000
         DC    X'0010' -      CPU B                                     04652000
         DC    X'0008' -      CPU C                                     04653000
         DC    X'0004' -      CPU D                                     04654000
         DC    X'0002' -      CPU E                                     04655000
         DC    X'0001' -      CPU F                                     04656000
CSDIOSID DC    XL1'00'        RESERVED -- DO NOT REUSE             @L6C 04658000
CSDRSV1  DC    XL1'00' -      RESERVED.                            @P2C 04660000
CSDCPOPF DC    XL2'00' -      Bit mask of CPUs taken offline by the    *04660500
                              operator. If bit x is on, then the       *04661000
                              operator took the CPU offline        @L8A 04661500
CSDCPUVW DS    0F             VECTORS ONLINE INFORMATION WORD.     @D1A 04662000
*                             SERIALIZATION - SYSZVARY.CPU         @D1A 04663000
*                             RESOURCE, DISPATCHER LOCK AND CS.    @D1A 04664000
*                             ONLY CS DURING ACR AND MCH.          @D1A 04665000
CSDCPUVF DC    XL2'00' -      BIT MASK OF CPUS WITH ONLINE VECTORS @H2A 04666000
         DC    XL2'00' -      TWO BYTES TO MAKE CSDCPUVF A FULL    @D1C 04667000
*                             WORD FOR CS INSTRUCTIONS.            @D1C 04668000
CSDCMT   DS    A -            ADDRESS OF THE CONFIGURATION MANAGEMENT  X04669000
                              TABLE.                               @H3A 04670000
CSDESAT  DS    A -            ADDRESS OF THE EXCESSIVE SPIN        @L1A 04671000
*                             RECOVERY ACTION TABLE USED BY        @L1A 04672000
*                             IEEVEXSN.                            @D3A 04673000
CSDTMPES DS    A -            ADDRESS OF THE EXCESSIVE SPIN        @D3C 04674000
*                             RECOVERY ACTION TABLE SET UP BY      @D3A 04675000
*                             IEEVESAI AS A RESULT OF A SET EXS=   @D3A 04676000
*                             COMMAND. THE ACTIONS DEFINED BY THIS @D3A 04677000
*                             TABLE BECOME EFFECTIVE THE NEXT TIME @D3A 04678000
*                             IEEVEXSN PROCESSES A NEW SPIN LOOP.  @D3A 04679000
CSDRCFV  DS    A -            ADDRESS OF THE RECONFIGURATION VECTOR    X04680000
                              TABLE.                               @L3A 04681000
CSDCPSID DS    CL16           TABLE OF SIDE ID FOR EACH CPU IN     @L4A 04682000
*                             THE SYSTEM                           @L4A 04683000
CSDCPACW DS    0F             WORD CONTAINING THE MASK OF CPUS     @L5A 04684000
*                             BEING TAKEN OFFLINE BY ACR.          @L5A 04685000
CSDCPACR DC    XL2'00' -      BIT MASK OF CPUS BEING TAKEN OFFLINE @L5A 04686000
*                             BY ACR.                              @L5A 04687000
         DC    XL2'00' -      TWO BYTES TO MAKE CSDCPACR A FULL    @L5A 04688000
*                             WORD.                                @L5A 04689000
CSDLWVCT DS    A -            ADDRESS OF THE LOADWAIT VECTOR TABLE @H4A 04691700
*                             AS MAPPED BY BLWMLWVT.               @H4A 04694400
CSDCRWRD DS    0F             CRYPTO INFORMATION WORD.             @H7A 04694600
CSDCRYPT DC    XL2'00'   -    BIT MASK OF ONLINE CRYPTO FACILITIES.@H7A 04694800
CSDCRINS DC    XL2'00'   -    BIT MASK OF INSTALLED CRYPTO FACILITIES. X04695000
                                                                   @H7A 04695200
         DC    XL4'00'   -    RESERVED.                            @H7A 04695400
CSDUMVCL DS    A -            ADDRESS OF THE IEEUMVCL ENTRY POINT  @H5A 04696000
CSDUSTCK DS    A -            ADDRESS OF THE IEEUSTCK ENTRY POINT  @H5A 04696800
CSD$ESTA DS    A -            ADDRESS OF THE ISN$ESTA ENTRY POINT  @H5A 04697600
CSD$FRR  DS    A -            ADDRESS OF THE ISN$FRR  ENTRY POINT  @H5A 04698400
CSDSCPIN DS    A -            ADDRESS OF THE ISN$SCPI ENTRY POINT  @H6A 04698900
         DC    XL4'00'  -     RESERVED.                            @01A 04702300
CSDEXCDS DS    0D             DWORD BDY FOR CDS INSTRUCTION TO UPDATE   04705700
*                             GLOBAL-EXEMPTION COUNT AND END-TIME  @01A 04709100
CSDEXCNT DC    F'0'           COUNT OF ACTIVE USERS OF GLOBAL SPIN-LOOP 04712500
*                             EXEMPTION. THIS FIELD MUST BE ON A DWORD  04715900
*                             BOUNDARY AND ADJACENT TO CSDEXSEC FOR     04719300
*                             THE CDS INSTRUCTION.                 @01A 04722700
CSDEXSEC DC    F'0'           EXPIRATION TIME (DOWN TO SECONDS) FOR     04726100
*                             GLOBAL EXEMPTION FROM SPIN-LOOP RECOVERY  04729500
*                             (TOP HALF OF TOD CLOCK)              @01A 04732900
CSDGLEX  DS    A -            ADDRESS OF THE MACRO PROCESSOR (BLWGLEX)  04736300
*                             FOR GLOBAL SPIN-LOOP EXEMPTION       @01A 04739700
CSDPLPN  DS    XL1            PRSM LOGICAL PARTITION NUMBER        @H8A 04741900
CSDEXSFL DS    CL1            FLAG BYTE FOR EXCESSIVE SPIN         @P4A 04743400
         DC    XL58'00'  -    RESERVED.                            @P4C 04744900
         MEND  , -   */                                                 04746500
*%CSDL2 : ;                                                             04750002
*@EJECT;                                                                04800000
*DECLARE                                                                04850002
*  1 CSD      BASED(CVTCSD)  BDY(DWORD),                                04900002
*   2 CSDCSD      CHAR(4) BDY(WORD),     /* CONTROL BLOCK ACRONYM IN    04950002
*                                           EBCDIC                   */ 05000002
*   2 CSDCPUJW    FIXED(32),             /* CPUS AVAILABLE FOR JOB      05021700
*                                           SCHEDULING INFORMATION      05043400
*                                           WORD. SERIALIZATION -       05065100
*                                           SYSZCSD.CSDCPUJS RESOURCE   05086800
*                                           AND CS.                     05108500
*                                           ONLY CS DURING ACR.  @D1A*/ 05130200
*    3 CSDCPUJS   BIT(16) BDY(WORD),     /* BIT MASK OF CPUS AVAILABLE  05151900
*                                           FOR JOB SCHEDULING.  @D1C*/ 05173600
*    3 CSDCHAD    FIXED(15),             /* HIGHEST CHANNEL ADDRESS     05195300
*                                           SYSGENED.            @D1C*/ 05217000
*   2 CSDCPUOW    FIXED(32),             /* CPUS ONLINE INFORMATION     05238700
*                                           WORD. SERIALIZATION -       05260400
*                                           SYSZVARY.CPU RESOURCE       05282100
*                                           AND CS.                     05303800
*                                           ONLY CS DURING ACR.  @D1A*/ 05325500
*    3 CSDCPUAL   BIT(16) BDY(WORD),     /* BIT MASK OF CPUS CURRENTLY  05347200
*                                           ALIVE.               @D1C*/ 05368900
*     4 CSDSAFF   BIT(16),               /* BIT MASK OF CPUS AVAILABLE  05390600
*                                           TO PROCESS SERVICE          05412300
*                                           REQUESTS (SRB'S).    @D1C*/ 05434000
*    3 CSDCPUOL   FIXED(15),             /* NUMBER OF CPUS CURRENTLY    05455700
*                                           ALIVE.               @D1C*/ 05477400
*   2 CSDSCWRD    CHAR(4) BDY(WORD),     /* SUPERVISOR CONTROL          05500002
*                                           INFORMATION              */ 05550002
*    3 CSDSCFL1    BIT(8),               /* FIRST BYTE OF CSDSCWRD   */ 05600002
*     4 CSDRV042 BIT(1),                 /* RESERVED                 */ 05650000
*     4 CSDSYSND BIT(1),                 /* SYSTEM-WIDE NON-            06000002
*                                           DISPATCHABILITY BIT.        06050002
*                                           INDICATES ALL ADDRESS       06100002
*                                           SPACES (SRB'S AND TASKS)    06150002
*                                           ARE NON-DISPATCHABLE        06200002
*                                           EXCEPT THOSE WITH EXEMPT    06250002
*                                           STATUS (ASCBXMPT)        */ 06300002
*     4 CSDRV001 BIT(1),                 /* RESERVED                 */ 06350002
*     4 CSDRV002 BIT(1),                 /* RESERVED                 */ 06400002
*     4 CSDRV003 BIT(1),                 /* RESERVED                 */ 06450002
*     4 CSDRV004 BIT(1),                 /* RESERVED                 */ 06500002
*     4 CSDRV005 BIT(1),                 /* RESERVED                 */ 06550002
*     4 CSDRV006 BIT(1),                 /* RESERVED                 */ 06600002
*    3 CSDSCFL2    BIT(8),               /* SECOND BYTE OF CSDSCWRD  */ 06650002
*     4 CSDRV007 BIT(1),                 /* RESERVED                 */ 06700002
*     4 CSDRV008 BIT(1),                 /* RESERVED                 */ 06750002
*     4 CSDRV009 BIT(1),                 /* RESERVED                 */ 06800002
*     4 CSDRV010 BIT(1),                 /* RESERVED                 */ 06850002
*     4 CSDRV011 BIT(1),                 /* RESERVED                 */ 06900002
*     4 CSDRV012 BIT(1),                 /* RESERVED                 */ 06950002
*     4 CSDRV013 BIT(1),                 /* RESERVED                 */ 07000002
*     4 CSDRV014 BIT(1),                 /* RESERVED                 */ 07050002
*    3 CSDSCFL3    BIT(8),               /* THIRD BYTE OF CSDSCWRD   */ 07100002
*     4 CSDRV015 BIT(1),                 /* RESERVED                 */ 07150002
*     4 CSDRV016 BIT(1),                 /* RESERVED                 */ 07200002
*     4 CSDRV017 BIT(1),                 /* RESERVED                 */ 07250002
*     4 CSDRV018 BIT(1),                 /* RESERVED                 */ 07300002
*     4 CSDRV019 BIT(1),                 /* RESERVED                 */ 07350002
*     4 CSDRV020 BIT(1),                 /* RESERVED                 */ 07400002
*     4 CSDRV021 BIT(1),                 /* RESERVED                 */ 07450002
*     4 CSDRV022 BIT(1),                 /* RESERVED                 */ 07500002
*    3 CSDSCFL4    BIT(8),               /* FOURTH BYTE OF CSDSCWRD  */ 07550002
*     4 CSDRV023 BIT(1),                 /* RESERVED                 */ 07600002
*     4 CSDRV024 BIT(1),                 /* RESERVED                 */ 07650002
*     4 CSDRV025 BIT(1),                 /* RESERVED                 */ 07700002
*     4 CSDRV026 BIT(1),                 /* RESERVED                 */ 07750002
*     4 CSDRV027 BIT(1),                 /* RESERVED                 */ 07800002
*     4 CSDRV028 BIT(1),                 /* RESERVED                 */ 07850002
*     4 CSDRV029 BIT(1),                 /* RESERVED                 */ 07900002
*     4 CSDRV030 BIT(1),                 /* RESERVED                 */ 07950002
*   2 CSDAXPOW    FIXED(32),             /* RESERVED -- DO NOT REUSE    07977500
*                                                                @L6C*/ 08005000
*    3 CSDAXPAL   BIT(16) BDY(WORD),     /* RESERVED -- DO NOT REUSE    08032500
*                                                                @L6C*/ 08060000
*    3 CSDAXPOL   FIXED(15),             /* RESERVED -- DO NOT REUSE    08087500
*                                                                @L6C*/ 08115000
*   2 CSDMF1CP    BIT(16),               /* BIT MASK OF CPUS VARIED ON  08143000
*                                           OR OFFLINE. MF/1 TESTS      08162300
*                                           THESE FLAGS AT REPORTING    08181600
*                                           INTERVALS FOR CPU VARY      08200900
*                                           ACTIVITY AND THEN RESETS    08220200
*                                           THEM TO ZERO.            */ 08239500
*   2 CSDACR      CHAR(1),               /* VALUE OF X'FF' MEANS ACR    08260002
*                                           IS IN PROGRESS           */ 08290000
*   2 CSDFLAGS    BIT(8),                /* FLAG BYTE                */ 08320000
*    3 CSDMP    BIT(1),                  /* RESERVED - DO NOT USE       08345000
*                                                                @L7C*/ 08370000
*    3 CSDSTCHK BIT(1),                  /* STORAGE CHECK INDICATOR -   08395000
*                                           SET BY RSM WHENEVER IT      08410000
*                                           MARKS A FRAME 'BAD' BECAUSE 08425000
*                                           OF A STORAGE ERROR MACHINE  08440000
*                                           CHECK. IT IS TESTED IN VARY 08455000
*                                           STORAGE ELEMENT OFFLINE     08470000
*                                           PROCESSING.      @G875P9A*/ 08485000
*    3 CSDCPUDN BIT(1),                  /* GLOBAL BIT INDICATING THAT  08495800
*                                           CPU INITIALIZATION IS       08506600
*                                           COMPLETE SO THAT OTHER      08517400
*                                           COMPONENTS CAN PERFORM      08528200
*                                           THEIR PROCESSING     @03C*/ 08539000
*    3 CSDNDPAR BIT(1),                  /* NON-DEDICATED PART.  @P7A*/ 08569500
*    3 CSDRV035 BIT(1),                  /* RESERVED                 */ 08600002
*    3 CSDRV036 BIT(1),                  /* RESERVED                 */ 08650002
*    3 CSDRV037 BIT(1),                  /* RESERVED                 */ 08700002
*    3 CSDRV038 BIT(1),                  /* RESERVED                 */ 08750002
*   2 CSDMAFF   (10) CHAR(8),            /* CPU-AFFINITY FEATURE        08800002
*                                           TABLE                    */ 08850002
*   2 CSDCPWLM    BIT(16),               /* Bit mask of CPUs manipulated08856400
*                                           by WLM. If bit x is on, then08862800
*                                           WLM put the CPU into its    08869200
*                                           current on/offline state    08875600
*                                                                @L8A*/ 08882000
*                                                                       08888400
*   2 CSDDDRCT    FIXED(15),             /* DDR DEVICE ALLOCATION       08895400
*                                           INTERFACE COUNT FIELD.      08918100
*                                           ACCESSED AND MODIFIED       08940800
*                                           UNDER CMS LOCK.             08963500
*                                           INCREMENTED BY DDR TO       08986200
*                                           INDICATE TO DYNAMIC         09008900
*                                           ALLOCATION THAT DDR         09031600
*                                           EXCHANGED ADDRESSES IN      09054300
*                                           THE IOS LOOKUP TABLE.    */ 09077000
*   2 CSDGDCC     FIXED(31),             /* COUNT OF USABLE CLOCK       09100002
*                                           COMPARATORS CURRENTLY IN    09150002
*                                           THE CONFIGURATION        */ 09200000
*   2 CSDGDINT    FIXED(31),             /* COUNT OF USABLE CPU         09250002
*                                           TIMERS CURRENTLY IN THE     09300002
*                                           CONFIGURATION            */ 09350000
*   2 CSDGDTOD    FIXED(31),             /* COUNT OF CPUS THAT HAVE     09400000
*                                           ACCESS TO A GOOD TOD        09450002
*                                           CLOCK                    */ 09500000
*   2 CSDTCNT     FIXED(31),             /* COUNT OF TAPE ALLOCATIONS   09550000
*                                           IN PROGRESS              */ 09600000
*   2 CSDUCNT     FIXED(31),             /* COUNT OF UNIT RECORD        09650000
*                                           ALLOCATIONS IN PROGRESS  */ 09700000
*   2 CSDMASK   (16) CHAR(2),            /* TABLE OF BIT MASKS FOR      09750000
*                                           TESTING BITS IN CSDCPUAL,   09800000
*                                           INDEXED FROM 1 TO 16.    */ 09850000
*   2 CSDIOSID    BIT(8),                /* RESERVED -- DO NOT REUSE    09900000
*                                                                @L6C*/ 09950000
*   2 CSDRSV1     FIXED(8),              /* Reserved.            @P2C*/ 10000000
*   2 CSDCPOPF    BIT(16),               /* Bit mask of CPUs manipulated10035700
*                                           taken offline by the        10071400
*                                           operator. If bit x is on,   10107100
*                                           then the operator took the  10142800
*                                           CPU offline.         @L8A*/ 10178500
*                                                                       10214200
*   2 CSDCPUVW    FIXED(32),             /* VECTORS ONLINE INFORMATION  10250000
*                                           WORD. SERIALIZATION -       10300000
*                                           SYSZVARY.CPU RESOURCE,      10350000
*                                           DISPATCHER LOCK AND CS.     10400000
*                                           ONLY CS DURING ACR AND MCH. 10450000
*                                                                @D1A*/ 10500000
*    3 CSDCPUVF   BIT(16),               /* BIT MASK OF CPUS WITH       10550000
*                                           ONLINE VECTORS.      @D1C*/ 10600000
*    3 *          FIXED(16),             /* TWO BYTES TO MAKE CSDCPUVF  10650000
*                                           A FULL WORD FOR CS          10700000
*                                           INSTRUCTIONS.        @D1C*/ 10750000
*   2 CSDCMT      PTR(31),               /* ADDRESS OF THE              10800000
*                                           CONFIGURATION MANAGEMENT    10850000
*                                           TABLE.               @H3A*/ 10900000
*   2 CSDESAT     PTR(31),               /* ADDRESS OF THE EXCESSIVE    10950000
*                                           SPIN RECOVERY ACTION        11000000
*                                           TABLE USED BY IEEVEXSN.     11050000
*                                                                @L1A*/ 11100000
*   2 CSDTMPES    PTR(31),               /* ADDRESS OF THE EXCESSIVE    11150000
*                                           SPIN RECOVERY ACTION TABLE  11200000
*                                           SET UP BY IEEVESAI AS A     11250000
*                                           RESULT OF A SET EXS=        11300000
*                                           COMMAND. THE ACTIONS        11350000
*                                           DEFINED BY THIS TABLE       11400000
*                                           WILL BECOME EFFECTIVE       11450000
*                                           THE NEXT TIME IEEVEXSN      11500000
*                                           PROCESSES A NEW SPIN LOOP.  11550000
*                                                                @D3C*/ 11600000
*   2 CSDRCFV     PTR(31),               /* ADDRESS OF THE              11650000
*                                           RECONFIGURATION VECTOR      11700000
*                                           TABLE.               @L3A*/ 11750000
*   2 CSDCPSID(0:15) CHAR(1),            /* ARRAY OF SIDE IDS FOR EACH  11800000
*                                           CPU IN THIS SYSTEM   @L4A*/ 11850000
*   2 CSDCPACW FIXED(32),                /* WORD CONTAINING THE         11900000
*                                           MASK OF CPUS BEING          11950000
*                                           TAKEN OFFLINE BY ACR @L5A*/ 12000000
*     3 CSDCPACR BIT(16),                /* BIT MASK OF CPUS BEING      12050000
*                                           TAKEN OFFLINE BY ACR @L5A*/ 12100000
*     3 *        FIXED(16),              /* RESERVED.            @L5A*/ 12150000
*   2 CSDLWVCT PTR(31),                  /* ADDRESS OF THE LOADWAIT     12200000
*                                           VECTOR TABLE MAPPED BY      12250000
*                                           BLWMLWVT.            @H4A*/ 12300000
*   2 CSDCRWRD    FIXED(32),             /* CRYPTO INFORMATION WORD.    12305600
*                                                                @H7A*/ 12311200
*     3 CSDCRYPT BIT(16),                /* BIT MASK OF ONLINE CRYPTO   12316800
*                                           FACILITIES.          @H7A*/ 12322400
*     3 CSDCRINS BIT(16),                /* BIT MASK OF INSTALLED       12328000
*                                           CRYPTO FACILITIES.   @H7A*/ 12333600
*   2 * CHAR(4),                         /* Reserved.            @H7A*/ 12339200
*   2 CSDUMVCL PTR(31),                  /* Address of the IEEUMVCL     12345400
*                                           entry point.         @H5A*/ 12368100
*   2 CSDUSTCK PTR(31),                  /* Address of the IEEUSTCK     12390800
*                                           entry point.         @H5A*/ 12413500
*   2 CSD$ESTA PTR(31),                  /* Address of the ISN$ESTA     12436200
*                                           entry point.         @H5A*/ 12458900
*   2 CSD$FRR  PTR(31),                  /* Address of the ISN$FRR      12481600
*                                           entry point.         @H5A*/ 12504300
*   2 CSDSCPIN PTR(31),                  /* Address of the ISNSCPIN     12515700
*                                           entry point.         @H6A*/ 12527100
*   2 * CHAR(4),                         /* RESERVED             @01C*/ 12528300
*   2 CSDEXCDS CHAR(8) BDY(DWORD),       /* DWORD BDY FOR CDS INST TO   12529500
*                                           UPDATE GLOBAL-EXEMPTION     12530700
*                                           COUNT AND END-TIME   @01A*/ 12531900
*    3 CSDEXCNT FIXED(31),               /* COUNT OF ACTIVE USERS OF    12533100
*                                           GLOBAL SPIN-LOOP EXEMPTION. 12534300
*                                           THIS FIELD MUST BE ON A     12535500
*                                           DWORD BOUNDARY AND ADJACENT 12536700
*                                           TO CSDEXSEC FOR CDS         12537900
*                                           INSTRUCTION          @01A*/ 12539100
*    3 CSDEXSEC FIXED(32),               /* EXPIRATION TIME FOR GLOBAL  12540300
*                                           EXEMPTION FROM SPIN-LOOP    12541500
*                                           RECOVERY (TOP HALF OF TOD   12542700
*                                           CLOCK)               @01A*/ 12543900
*   2 CSDGLEX     PTR(31),               /* ADDRESS OF MACRO PROCESSOR  12545100
*                                           (BLWGLEX) FOR GLOBAL        12546300
*                                           SPIN-LOOP EXEMPTION  @01A*/ 12547500
*   2 CSDPLPN   FIXED(8),                /* PRSM LOGICAL PARTITION      12548100
*                                           NUMBER               @H8A*/ 12548700
*   2 CSDEXSFL  CHAR(1),                 /* FLAG BYTE FOR EXCESSIVE     12560700
*                                           SPIN                 @P4A*/ 12572700
*   2 *           CHAR(58);              /* RESERVED.            @P4C*/ 12584700
*                                                                       12596800
* DCL                                                                   12600000
*   CSDMASK0(0:15) CHAR(2) DEFINED(CSDMASK); /* TABLE OF BIT MASKS FOR  12650000
*                                           TESTING BITS IN CSDCPUAL,   12700000
*                                           INDEXED FROM 0 TO 15.       12750000
*                                                                @L2A*/ 12800000
