*/* START OF SPECIFICATIONS ******************************************* 00050000
*                                                                       00100000
**/                                                                     00150000
*/********************************************************************/ 00200000
*/*01* PROPRIETARY STATEMENT=                                        */ 03085900
*/***PROPRIETARY_STATEMENT********************************************/ 03087000
*/*                                                                  */ 03088100
*/*                                                                  */ 03089200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 03090300
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 03091400
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                      */ 03093000
*/*                                                                  */ 03094700
*/* STATUS= HBB7703                                                  */ 03095800
*/*                                                                  */ 03096900
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 03098000
*/*                                                                     03098300
*01* DESCRIPTIVE NAME:  Contents Directory Entry                        03098600
*02*  ACRONYM:  CDE                                                     03098900
*                                                                       03099200
*01* MACRO NAME:  IHACDE                                                03099500
*                                                                       03099800
*01* DSECT NAME:                                                        03100100
*     CDE                                                               03100400
*                                                                       03100700
*01* COMPONENT:  Contents Supervision (SC1CJ)                           03101000
*                                                                       03101300
*01* EYE-CATCHER:  none                                                 03101600
*                                                                       03101900
*01* STORAGE ATTRIBUTES:                                                03102200
*02*  SUBPOOL: 255                                                      03102500
*02*  KEY:  0                                                           03102800
*                                                                       03103100
*01* SIZE:  32 bytes                                                    03103400
*                                                                       03103700
*01* CREATED BY:                                                        03104000
*     CSVGETMD                                                          03104300
*                                                                       03104600
*01* POINTED TO BY:                                                     03104900
*     RBCDE1                                                            03105500
*                                                                       03105600
*01* POINTED TO BY:                                                     03105700
*     CDXCDE@                                                           03105800
*                                                                       03105900
*01* SERIALIZATION:                                                     03106100
*     Local Lock.                                                       03106400
*                                                                       03106700
*01* FUNCTION:                                                          03107000
*02* The CDE contains information about the location, size and          03107300
*    other attributes of a particular module currently in use.          03107600
*                                                                       03107900
*    The Link Pack Directory Entry (LPDE) and the Contents              03108200
*    Directory Entry (CDE) map identically except for the last          03108500
*    eight bytes of the LPDE.                                           03108800
*    The last eight bytes of a MAJOR LPDE contain extent                03109100
*    information. The corresponding area in a MINOR LPDE contains       03109400
*    the MAJOR NAME. The CDE lacks the last eight bytes.                03109700
*    A MAJOR CDE points to an EXTENT LIST (XTLST). A MINOR CDE          03110000
*    points to the CDE for the MAJOR NAME.                              03110300
*    Fields which are only meaningful in a CDE are set to zero in       03110600
*    an LPDE.                                                           03110900
*    The CDELPDE bit can be used to differentiate between a             03111200
*    CDE and an LPDE.                                         @G860P25  03111500
*                                                                       03111600
*01* EXTERNAL CLASSIFICATION: PSPI                                      03111700
*01* END OF EXTERNAL CLASSIFICATION:                                    03111900
*                                                                       03112100
*01* METHOD OF ACCESS:                                                  03112400
*02*  ASM: Invoke macro IHACDE                                          03112700
*02*  PL/X:                                                             03113000
*      %INCLUDE SYSLIB(IHACDE)                                          03113300
*      DECLARE and set CDENTPTR or Respecify CDE.                       03113600
*                                                                       03113900
*01* DELETED BY: CSVEXIT (end of job clean up)                          03114200
*                CSVFRR (unchained in unusual circumstances)            03114500
*                CSVRFREE (error return cleanup)                        03114800
*                CSVSBRTN (CDE delete subroutine)                       03115100
*                                                                       03115400
*01* FREQUENCY: 1 per module in JPA or LPA                              03115700
*                                                                       03116000
*01* DEPENDENCIES: None                                                 03116300
*                                                                       03116600
*01* DISTRIBUTION LIBRARY: SYS1.MODGEN                                  03116900
*                                                                       03117200
*01* CHANGE ACTIVITY:                                                   03117500
*                                                                       03117800
*   CHANGE-ACTIVITY =                                                   03118100
*  $L1=PVTMOD,JBB2125,821207,PDXB: CDE GLOBAL BIT                       03118400
*  $L2=JUP03 , JBB3320, 870429, PDCA: JUPITER III SUPPORT         @L2A  03118700
*                      OZ84179 - INTEGRITY                    @ZA84179  03119000
*                      OY22541 - RESERVE A NEW BIT FOR RACF   @YA22541  03119300
*                      OY13187 - INTEGRITY                    @YA13187* 03119600
*  $L3=POSIX , HBB4430, 920108, PD34EP: OpenMVS FORK support      @L3A  03119900
*                               New CDPATHN bit (path name)       @L3A  03120200
*                               Added full Macro prolog (not flagged)   03120500
*                               Made comments U/L case. (not flagged)   03120800
*  $P1=POSIX , HBB4430, 920429, PD34EP: Eliminate long dashed lines in  03120900
*                               prolog for SHOWHDR (not flagged)        03121000
*  $L4=PGMSP , HBB4430, 920729, PD34EP: Improve CDRACF comment    @L4C  03121100
*  $P2=PKB4321,HBB4430, 921013, PD34EP: Use "OpenMVS" syntax      @P2A  03121200
*  $01=OY59054,HBB4430,921021,PD34EP: (PKB4102) Improve CDCONTMN        03121300
*                                     comment                      @01A 03121400
*  $02=OY62555,HBB4430,930315,PD00PA: Description of CDIDENTY      @02A 03121500
*  $03=OW01822,HBB4430,940201,PD34DW: Add CDPML bit                @03A 03121600
*  $P3=PN71365,HBB5520,941006,PD00KC: Add second pointed to by in       03121700
*                                     prolog                       @P3A 03121800
*  $L5=RTLS_CSV JBB6604 960808 PD00XB: RTLS                             03121900
*  $L6=DYLPACSV JBB6604 960808 PD00XB: Dynamic LPA                      03122000
*  $L7=SHRLBCSV JBB6609 981212 PD00I6: Shared Library Support           03122100
*  $L8=64BITCSV HBB7703 981204 PD00XB: ESAME                            03122200
*                                                                       03122300
* END OF SPECIFICATIONS                                                 03122400
**********************************************************************/ 03122500
*        %GOTO CDEPLAS;                                              /* 03122600
         MACRO                                                          03122700
         IHACDE                                                         03122800
CDENTRY  DSECT                                                          03122900
         SPACE 1                                                        03123200
CDCHAIN  DS    F -            Address of next CDE in queue (either JPAQ 03123500
*                             or LPAQ)                                  03123800
CDRRBP   DS    F -            If the module is REENTERABLE, this field  03124100
*                             contains the address of the last RB that  03124400
*                             controlled the module.  If the module is  03124700
*                             SERIALLY REUSABLE, this field contains    03125000
*                             the address of the RB at the top of the   03125300
*                             WAITING (RBPGMQ) QUEUE.  If the module    03125600
*                             was requested ONLY through LOAD macro     03125900
*                             instructions, CONTAINS ZERO.              03126200
CDNAME   DS    CL8 -          8-byte name                               03126500
CDENTPT  DS    F -            Module's relocated Entry Point address    03126800
CDEMODE  EQU   X'80'          Routine runs in 31 bit mode      @G860P35 03127100
CDXLMJP  DS    F -            Extent list address or Major CDE address  03127600
*                             If this CDE is a MINOR                    03127700
CDUSE    DS    H -            Value contains the total module use       03128000
*                             count                                     03128300
CDATTRB  DS    B -            Flag byte                        @G860P35 03128600
CDEOM    EQU   X'80' -        ON=Delete module at memory termination    03128900
*                                                              @G860P35 03129200
CDIDENTY EQU   X'40' -        ON = CDE built by IDENTIFY  @02C @ZA47842 03129800
CDRACDTY EQU   X'20' -        ON = MODULE WAS LOADED BY 'DIRTY' TASK    03130400
*                                                              @YA13187 03130700
CDCDEX   EQU   X'10' -        ON = CDE extension exists            @L2A 03131000
CDELPDE  EQU   X'08' -        OFF=CDE, ON=LPDE (Used to distinguish a   03131300
*                             CDE from an LPDE)                @G860P25 03131600
CDGLOBAL EQU   X'04' -        ON = Module LOADED to GLOBAL         @L1A 03131900
CDCONTMN EQU   X'02' -        ON = Module is contaminated. A module is  03132000
*                             considered contaminated if it is from an  03132100
*                             APF authorized library, but was fetched   03132200
*                             into subpool 251 (it is not reentrant) by 03132300
*                             a NON authorized caller.    @ZA84179 @P3C 03132400
CDRACF   EQU   X'01' -        Used by external security manager.        03132500
*                             (For RACF: The user has EXECUTE authority 03132600
*                              rather than READ authority               03132700
*                              to the module.)            @YA22541 @L4C 03132800
CDSP     DS    X              Module SUBPOOL ID                @G381P2A 03132900
CDATTR   DS    B -            Attribute flags                           03133100
CDNIP    EQU   X'80' -        Module loaded by NIP or FLPA/MLPA         03133400
*                             or dynamic LPA                            03133700
CDNIC    EQU   X'40' -        Module is in process of being loaded      03134000
CDREN    EQU   X'20' -        Module is REENTERABLE                     03134300
CDSER    EQU   X'10' -        Module is SERIALLY REUSABLE               03134600
CDNFN    EQU   X'08' -        Module is NOT REUSABLE (NON-FUNCTIONAL)   03134900
CDMIN    EQU   X'04' -        This is a MINOR CDE                       03135200
CDJPA    EQU   X'02' -        Module is in JOB PACK AREA                03135500
CDNLR    EQU   X'01' -        Module is NOT LOADABLE-ONLY               03135800
CDATTR2  DS    B -            Second attribute field                    03136100
CDSPZ    EQU   X'80' -        Module is in SUBPOOL ZERO                 03136400
CDREL    EQU   X'40' -        Module is INACTIVE and MAY BE RELEASED    03136700
CDXLE    EQU   X'20' -        EXTENT LIST has been built for module.    03137000
*                             Main storage occupied by module is        03137300
*                             described therein.                        03137600
CDRLC    EQU   X'10' -        This CDE contains a MINOR ENTRY POINT     03137900
*                             ADDRESS that has been relocated by the    03138200
*                             PROGRAM FETCH routine.                    03138500
CDEANYM  EQU   X'08'          Routine runs in ANY mode         @G860P35 03138800
CDOLY    EQU   X'04' -        Module is in OVERLAY format        A27026 03139100
CDSYSLIB EQU   X'02' -        AUTHORIZED LIBRARY module                 03139400
CDAUTH   EQU   X'01' -        PROGRAM AUTHORIZATION FLAG         ICB360 03139700
CDATTR3  DS    B -            3rd attribute field                  @L3C 03140000
CDPATHN  EQU   X'80' -        ON = The module represented by this CDE   03140300
*                             has an associated OpenMVS path name. The  03140600
*                             CDNAME field contains an EBCDIC value     03140900
*                             that contents supervision hashes to       03141200
*                             locate the CDE extension which contains   03141500
*                             the path name.                       @L3A 03141800
CDPML    EQU   X'40' -        OFF = PML was not complete when module    03141900
*                             was loaded                                03142000
*                             ON = PML was up when the module was       03142100
*                             loaded                                    03142200
*                             Used by the CSV delete process to         03142300
*                             determine which DFP interface CSV should  03142400
*                             use to delete the module(s).         @03A 03142500
CDESPLIT EQU   X'20' -        Split RMODE load module              @L5A 03142900
CDSYSHLB EQU   X'10' -        HFS System Shared Library Module     @L7A 03143100
CDERTLS  EQU   X'08' -        RTLS                                 @L5A 03143300
CDEDYLPA EQU   X'04' -        Dynamic LPA. Only on for CDE on active   *03143700
                              LPA queue                            @L6A 03144100
CDEPROTP EQU   X'01' -        Only whole pages are page-protected, as  *03144500
                              opposed to the entire module. Or module  *03144900
                              added by CSVDYLPA BYADDR=YES so page     *03145300
                              protection state not known.              *03145700
                              Only on for CDE on active LPA queue  @L6A 03146100
CDATTR4  DS    B -            RESERVED                             @L3A 03146500
         MEND  , */                                                     03146900
*%CDEPLAS :  ;                                                          03147300
*DECLARE                                                                03147700
*%IF IHACDE_CLASS ~= 'YES' %THEN %GOTO CDEPLAS1; /*              @L5A*/ 03148100
*  1 InstanceData Public,                                               03148500
*%GOTO CDEPLAS2;                           /*                    @L5A*/ 03148900
*%CDEPLAS1:;                               /*                    @L5A*/ 03149300
*  1 CDENTRY  BASED(CDENTPTR),                                          03150002
*%CDEPLAS2:;                               /*                    @L5A*/ 03175000
*   2 CDCHAIN     PTR(31),               /* Address of next CDE in      03200000
*                                           queue (either JPAQ or       03250000
*                                           LPAQ)                    */ 03300002
*   2 CDRRBP      PTR(31),               /* If the module is            03350000
*                                           reenterable, this field     03400000
*                                           contains the address of     03450000
*                                           the last RB that            03500000
*                                           controlled the module.      03550000
*                                           If the module is serially   03600000
*                                           reusable, this field        03650000
*                                           contains the address of     03700000
*                                           the RB at the top of the    03750000
*                                           Waiting (RBPGMQ) queue.     03800000
*                                           If the module was           03850000
*                                           requested only through      03900000
*                                           LOAD macro instructions,    03950000
*                                           contains ZERO.           */ 04000000
*   2 CDNAME      CHAR(8),               /* 8 byte module name       */ 04050000
*   2 CDENTPT     PTR(31),               /* Module's relocated entry    04100000
*                                           point address            */ 04150000
*     3 CDEMODE  BIT(1),                 /* Routine runs in 31 bit      04166600
*                                           mode             @G860P35*/ 04183200
*   2 CDXLMJP     PTR(31),               /* EXTENT LIST address or      04200000
*                                           MAJOR CDE address if this   04250000
*                                           CDE is a MINOR.          */ 04300000
*   2 CDUSE       PTR(15),               /* Value contains the TOTAL    04350000
*                                           MODULE USE COUNT         */ 04400002
*   2 CDATTRB     CHAR(1),               /* FLAG byte field  @G860P35*/ 04427500
*     3 CDEOM    BIT(1),                 /* ON=Delete module at memory  04455000
*                                           termination      @G860P35*/ 04464100
*     3 CDIDENTY BIT(1),                 /* ON=CDE built by IDENTIFY    04469000
*                                                       @02C @ZA47842*/ 04473900
*     3 CDRACDTY BIT(1),                 /* ON=Module was loaded by     04478800
*                                           'dirty' task     @YA13187*/ 04479900
*     3 CDCDEX   BIT(1),                 /* CDE Extension exists @L2A*/ 04481000
*     3 CDELPDE  BIT(1),                 /* OFF=CDE, ON=LPDE (used to   04482300
*                                           distinguish a CDE from      04488300
*                                           an LPDE)         @G860P25*/ 04494300
*     3 CDGLOBAL BIT(1),      /* ON = Module is loaded to GLOBAL @L1A*/ 04498200
*     3 CDCONTMN BIT(1),      /* ON = Module is contaminated. A module  04502100
*                                is considered contaminated if it is    04504000
*                                from an APF authorized library, but    04505900
*                                was fetched into subpool 251 (it is    04506400
*                                not reentrant) by a NON authorized     04506900
*                                caller.               @ZA84179 @P3C */ 04507400
*     3 CDRACF   BIT(1),      /* Used by external security manager.     04507900
*                                (For RACF: The user has EXECUTE        04508400
*                                 authority rather than READ authority  04508900
*                                 to the module.)      @YA22541 @L4C */ 04510000
*   2 CDSP        CHAR(1),    /* Module subpool ID           @G381P2A*/ 04540000
*   2 CDATTR      CHAR(1),               /* Attribute flags          */ 04600000
*     3 CDNIP    BIT(1),                 /* Module LOAD by NIP or       04650000
*                                           FLPA/LPA or dynamic         04700000
*                                           LPA                      */ 04750000
*     3 CDNIC    BIT(1),                 /* Module is in process of     04800000
*                                           being LOADed             */ 04850000
*     3 CDREN    BIT(1),                 /* Module is REENTRABLE     */ 04900000
*     3 CDSER    BIT(1),                 /* Module is SERIALLY          04950000
*                                           REUSABLE                 */ 05000002
*     3 CDNFN    BIT(1),                 /* Module is NOT REUSABLE      05050000
*                                           (NON-FUNCTIONAL)         */ 05100002
*     3 CDMIN    BIT(1),                 /* This is a MINOR CDE      */ 05150000
*     3 CDJPA    BIT(1),                 /* Module is in JOB PACK       05200000
*                                           AREA                     */ 05250002
*     3 CDNLR    BIT(1),                 /* Module is NOT               05300000
*                                           LOADABLE-ONLY            */ 05350002
*   2 CDATTR2     CHAR(1),               /* Second attribute field   */ 05400000
*     3 CDATTR2B BIT(8),                 /* Bit definition       @L5A*/ 05437500
*     4 CDSPZ    BIT(1),                 /* Module is in SUBPOOL ZERO*/ 05475000
*     4 CDREL    BIT(1),                 /* Module is INACTIVE and      05512500
*                                           may be RELEASED          */ 05550000
*     4 CDXLE    BIT(1),                 /* An Extent list has been     05600000
*                                           built for the module.       05650000
*                                           The main storage occupied   05700000
*                                           by the module is described  05750000
*                                           therein.                 */ 05800000
*     4 CDRLC    BIT(1),                 /* This CDE contains a         05850000
*                                           MINOR entry point address   05900000
*                                           that has been relocated     05950000
*                                           by the PROGRAM FETCH        06000000
*                                           routine.                 */ 06050000
*     4 CDEANYM  BIT(1),                 /* Routine runs in ANY mode    06087500
*                                                            @G860P35*/ 06125000
*     4 CDOLY    BIT(1),                 /* Module is in OVERLAY        06162500
*                                           FORMAT             A27026*/ 06200002
*     4 CDSYSLIB BIT(1),                 /* AUTHORIZED LIBRARY module*/ 06250000
*     4 CDAUTH   BIT(1),                 /* PROGRAM AUTHORIZATION       06300000
*                                           FLAG               ICB360*/ 06350002
*   2 CDATTR3    CHAR(1),                /* 3rd attribute field  @L3C*/ 06400000
*     3 CDATTR3B BIT(8),                 /* Bit definition       @L5A*/ 06433300
*     4 CDPATHN  BIT(1),                 /* The module represented by   06466600
*                                           this CDE has an associated  06500000
*                                           OpenMVS path name. The      06550000
*                                           CDNAME field contains an    06600000
*                                           EBCDIC value that contents  06650000
*                                           supervision hashes to       06700000
*                                           locate the CDE extension    06750000
*                                           which contains the path     06800000
*                                           name.                @L3A*/ 06850000
*     4 CDPML    BIT(1),                 /* OFF = PML was not complete  06855500
*                                           when module was loaded      06861000
*                                           ON = PML was up when the    06866500
*                                           module was loaded           06872000
*                                           Used by the CSV delete      06877500
*                                           process to determine which  06883000
*                                           DFP interface to use to     06888500
*                                           delete the module(s) @03A*/ 06894000
*     4 CDESPLIT BIT(1),                 /* This is a "split" load      06894400
*                                           module (part above, part    06894800
*                                           below 16M)           @L5A*/ 06895200
*     4 CDSYSHLB BIT(1),                 /* HFS System Shared Library   06895400
*                                           Module (SP230)       @L7A*/ 06895600
*     4 CDERTLS  BIT(1),                 /* RTLS                 @L5A*/ 06896000
*     4 CDEDYLPA BIT(1),                 /* Dynamic LPA. Only on for    06896400
*                      CDE on active LPA queue                   @L6A*/ 06896800
*     4 CDEPROTP BIT(1),    /* Only whole pages are page-protected, as  06897200
*                      opposed to the entire module. Or module added    06897600
*                      by CSVDYLPA BYADDR=YES so page protection state  06898000
*                      is not known. Only on for                        06898400
*                      CDE on active LPA queue                   @L6A*/ 06898800
*     4 *        BIT(1),                 /* Reserved             @L5A*/ 06899400
*   2 CDATTR4    CHAR(1);                /* RESERVED             @L3A*/ 06900000
