*                                                                       00050000
*        %GOTO DCQL1;   /*                                              00100000
         MACRO                                                          00150000
         IHADCQ   ,           */                                        00200000
*%DCQL1:;                                                               00250000
*                                                                       00300000
* /*******************************************************************/ 00350000
* /*                                                                 */ 00400000
* /*  MACRO NAME = IHADCQ                                            */ 00450000
* /*                                                                 */ 00500000
* /*  DESCRIPTIVE NAME= DCQ - Device Class Queue                     */ 00550000
* /*                                                                 */ 00600000
* /*                                                                 */ 00650000
* /*                                                                 */ 00700000
* /*  COPYRIGHT =                                                    */ 00750000
* /*   5740-XC6                                                      */ 00800000
* /*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                   */ 00850000
* /*   (C) COPYRIGHT IBM CORP. 1982, 1986                            */ 00900000
* /*   LICENSED MATERIALS - PROPERTY OF IBM                          */ 00950000
* /*                                                                 */ 01000000
* /*  STATUS = JBB2220                                               */ 01050000
* /*                                                                 */ 01100000
* /*  FUNCTION - The DCQ locates UCBs for devices.  They are         */ 01150000
* /*             chained by device class with one DCQ element per    */ 01200000
* /*             device class.  DCQHEAD is pointed to by CVTDCQA     */ 01250000
* /*             with DCQ elements forming a single headed, single   */ 01300000
* /*             threaded queue pointed to by DCQFIRST.              */ 01350000
* /*                                                                 */ 01400000
* /*  METHOD OF ACCESS                                               */ 01450000
* /*      BAL - IHADCQ produces a DSECT.                             */ 01500000
* /*      PL/S - %INCLUDE SYSLIB(IHADCQ)                             */ 01550000
* /*                                                                 */ 01600000
* /*  NOTE - If the MVSCP is used to define the I/O configuration,   */ 01650000
* /*         the DCQ resides in member IOSUCBxx in SYS1.NUCLEUS,     */ 01700000
* /*         where xx is the identifier of the designated I/O        */ 01750000
* /*         configuration.                                      @L3C*/ 01800000
* /*                                                                 */ 01850000
* /*         If the MVS/ISI configuration dialog is used to build    */ 01900000
* /*         an I/O Definition File (IODF) to represent the I/O      */ 01950000
* /*         configuration, then the DCQ is built in SQA during      */ 02000000
* /*         IPL.                                                @L3A*/ 02050000
* /*                                                                 */ 02100000
* /*  CHANGE ACTIVITY -                                              */ 02150000
* /*    @G860PLZ=                         : IOS REWRITE              */ 02200000
* /*                                                                 */ 02250000
* /*    $MAC(IHADCQ),COMP(SC1C3): Locate UCBs                        */ 02300000
* /*    $L1=IOGEN    JBB2220  840611  PDLY: IOGEN Restructure        */ 02350000
* /*    $L2=VERS     HBB3310  860416  PDLE: Versioning macro into    */ 02400000
* /*                                        product              @L2A*/ 02450000
* /*    $L3=EMVS1    HBB4410  881115  PDLC: Comment changes for      */ 02500000
* /*                                        Enterprise/MVS Release 1 */ 02550000
* /*                                        support              @L3A*/ 02600000
* /*                                                                 */ 02650000
* /*******************************************************************/ 02700000
*%GOTO DCQL2;   /*                                                      02750000
         SPACE 1                                                        02800000
         DS    0D -                                                     02850000
DCQ      DSECT                                                          02900000
DCQHEAD  DS    0D -                       DCQ Header                    02950000
DCQNAME  DC    CL4'DCQ ' -                Control block acronym         03000000
DCQLNGTH DC    H'0' -                     Length of each of the DCQ     03050000
*                                         Entries                       03100000
DCQCOUNT DC    H'0' -                     Number of elements            03150000
DCQFIRST DC    A(0) -                     Address of first DCQELMNT     03200000
DCQDSTCT DC    F'0' -                     Count of entries required in  03250000
*                                         the device statistics table   03300000
*                                                                  @L1A 03350000
DCQUCBNO DC    F'0' -                     Total number of UCBs for the  03400000
*                                         I/O configuration        @L1A 03450000
*                                                                       03500000
DCQELMNT DSECT                                                          03550000
DCQCHAIN DC    A(0) -                     Address of next DCQELMNT or   03600000
*                                         zero if end of chain.         03650000
DCQDEVCL DC    XL1'00' -                  Existing device class hex ID. 03700000
*                                         Same contents as UCBTBYT3     03750000
DCQFLG1  DC    BL1'00' -                  Flags                         03800000
DCQUCBCT DC    H'0' -                     Number of UCB's within device 03850000
*                                         class.  If no UCB's exist for 03900000
*                                         this class, then field is 0.  03950000
DCQUCBAD DC    A(0) -                     Address of first UCB for this 04000000
*                                         class.  If no UCB's exist for 04050000
*                                         this class, then field is 0.  04100000
*                                         All UCB addresses point to    04150000
*                                         common segment of UCB.        04200000
DCQDEVNM DC    XL8'00' -                  Device class name in EBCDIC   04250000
         DC    XL8'00' -                  Reserved                      04300000
DCQEND   DS    0C -                       End of IHADCQ                 04350000
         MEND  ,      */                                                04400000
*%DCQL2:;                                                               04450000
*                                                                       04500000
*DCL 1 DCQ BASED BDY(DWORD),                                            04550000
*     3 DCQHEAD,                   /* Header                         */ 04600000
*      5 DCQNAME CHAR(4),          /* Control block acronym          */ 04650000
*      5 DCQLNGTH FIXED(15),       /* Length of each of the DCQ         04700000
*                                     entries                        */ 04750000
*      5 DCQCOUNT FIXED(15),       /* Number of elements             */ 04800000
*      5 DCQFIRST PTR(31),         /* Address of first DCQELMNT  @L1C*/ 04850000
*      5 DCQDSTCT FIXED(31),       /* Count of entries required in      04900000
*                                     the device statistics table       04950000
*                                                                @L1A*/ 05000000
*      5 DCQUCBNO FIXED(31);       /* Total number of UCBs for the      05050000
*                                     I/O configuration          @L1A*/ 05100000
*DCL 1 DCQELMNT BASED,             /* Element of DCQ                 */ 05150000
*     3 DCQCHAIN PTR(31)BDY(WORD), /* Address of next DCQELMNT or zero  05200000
*                                     if end of chain                */ 05250000
*     3 DCQDEVCL BIT(8),           /* Existing device class hex ID.     05300000
*                                     Same contents as UCBTBYT3.     */ 05350000
*     3 DCQFLG1  BIT(8),           /* Flags                          */ 05400000
*     3 DCQUCBCT FIXED(15),        /* Number of UCB's within device     05450000
*                                     class. If no UCB's exist for      05500000
*                                     this class, then field is 0.   */ 05550000
*     3 DCQUCBAD PTR(31),          /* Address of first UCB for this     05600000
*                                     class. If no UCB's exist for      05650000
*                                     this class, then 0. All UCB       05700000
*                                     addresses point to common         05750000
*                                     segment of UCB.                */ 05800000
*     3 DCQDEVNM CHAR(8),          /* Device class name in EBCDIC.   */ 05850000
*     3 *        CHAR(8);          /* Reserved                       */ 05900000
*DCL DCQCBID CHAR(4) CONSTANT('DCQ '); /* Control block ID       @L3A*/ 05950000
