*          %GOTO  DDR0 ;        /* BILINGUAL DDRCOM MACRO               00050000
        MACRO                                                           00100000
        IHADDR   &LIST=YES                                         @L3C 00150000
              PUSH PRINT                                                00200000
*            */                                                         00250000
*%DDR0:  ;                                                              00300000
*/*START OF SPECIFICATIONS *******************************************/ 00324200
*/*                                                                  */ 00348400
*/*01* DESCRIPTIVE NAME:  IOS Dynamic Device Reconfiguration         */ 00372600
*/*   Communication Table                                            */ 00396800
*/*                                                                  */ 00421000
*/*02*  ACRONYM: DDRCOM                                              */ 00445200
*/*                                                                  */ 00469400
*/*01* MACRO NAME:  IHADDR                                           */ 00493600
*/*                                                                  */ 00517800
*/*01* DSECT NAME:  DDRCOM                                           */ 00542000
*/*                                                                  */ 00566200
*/*01* PROPRIETARY STATEMENT:                                        */ 00590400
*/*****PROPRIETARY STATEMENT******************************************/ 00614600
*/*                                                                  */ 00638800
*/*    5695-047                                                      */ 00663000
*/*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                   */ 00687200
*/*    (C) COPYRIGHT IBM CORP. 1981, 1992                            */ 00711400
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00735600
*/*                                                                  */ 00759800
*/*01* STATUS = (HBB4430,HBB5520)                                    */ 00784000
*/*                                                                  */ 00808200
*/*****END OF PROPRIETARY STATEMENT***********************************/ 00832400
*/*                                                                  */ 00856600
*/*01* COMPONENT: Dynamic Device Reconfiguration (BB1CS)             */ 00880800
*/*                                                                  */ 00905000
*/*01* EYE-CATCHER:  DDR                                             */ 00929200
*/*                                                                  */ 00953400
*/*02*   OFFSET:  0                                                  */ 00977600
*/*02*   LENGTH:  4                                                  */ 01001800
*/*                                                                  */ 01026000
*/*01* FUNCTION:  Communicate between DDR modules.  Queuing          */ 01050200
*/*   control block for DDR requests.                                */ 01074400
*/*                                                                  */ 01098600
*/*01* STORAGE ATTRIBUTES:                                           */ 01122800
*/*02*   MAIN STORAGE:      YES                                      */ 01147000
*/*02*   VIRTUAL STORAGE:   N/A                                      */ 01171200
*/*02*   AUXILIARY STORAGE: N/A                                      */ 01195400
*/*02*   DATA SPACE:        N/A                                      */ 01219600
*/*02*   SUBPOOL:           245                                      */ 01243800
*/*02*   KEY:                 0                                      */ 01268000
*/*02*   RESIDENCY:         N/A                                      */ 01292200
*/*                                                                  */ 01316400
*/*01* SIZE: 236 bytes                                           @LAC*/ 01340600
*/*                                                                  */ 01364800
*/*01* CREATED BY:  IGF2503D - operator requested SWAP, IGE0660A     */ 01389000
*/*   - system initiated SWAP.                                       */ 01413200
*/*                                                                  */ 01437400
*/*01* POINTED TO BY:                                                */ 01461600
*/*   CVTTRPOS field of the CVT (points to the queue of DDRCOMs for  */ 01485800
*/*   tapes in the repositioning phase of swap.                      */ 01510000
*/*   CVTTPUR field of the CVT (points to the queue of DDRCOMs for   */ 01534200
*/*   unit record devices, and tapes which are in the first phase    */ 01558400
*/*   of a SWAP (prior to the reposition phase).                     */ 01582600
*/*   CVTDPUR field of the CVT (points to the queue of DDRCOMs       */ 01606800
*/*   for DASD swaps.                                                */ 01631000
*/*   DDRNXT field of the DDRCOM data area.                          */ 01655200
*/*                                                                  */ 01679400
*/*01* SERIALIZATION:  Queued and dequeued while holding local,      */ 01703600
*/*   CMS locks.                                                     */ 01727800
*/*                                                                  */ 01752000
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 01776200
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01800400
*/*                                                                  */ 01824600
*/*01* METHOD OF ACCESS:                                             */ 01848800
*/*                                                                  */ 01873000
*/*      PLAS - DCL  DDRPTR  PTR                                     */ 01897200
*/*             %INCLUDE SYSLIB(IHADDR)                              */ 01913300
*/*                                                                  */ 01929400
*/*      BAL  - IHADDR  (MARCO CALL)                                 */ 01945500
*/*             USING     DDRCOM,REG                                 */ 01961600
*/*             LOAD REG WITH DDR ADDRES                             */ 01977700
*/*  F.E.'S                                                          */ 01994000
*/*      MICROFICHE LISTINGS - IHADDR                                */ 02018200
*/*                                                                  */ 02042400
*/*  DEVELOPERS                                                      */ 02066600
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 02090800
*/*      PLAS LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 02115000
*/*                                                                  */ 02139200
*/*  $MAC(IHADDR),COMP(BB1CS): DDR common control block.             */ 02163400
*/*                                                                  */ 02187600
*/*    NEW COMPONENT 5752-BB1CS                                      */ 02211800
*/*                                                                  */ 02236000
*/*01* CHANGE ACTIVITY                                               */ 02260200
*/*    A090500,A094500-096000,C098000,A180600-18700,C181000  @YM02580*/ 02284400
*/*    A091600-091940,A143600-143900                         @YM04069*/ 02308600
*/*    A034600,047600,052600,091960,118100,143920,151600     @Y02BKCI*/ 02332800
*/*    A155600                                               @Y02BKCI*/ 02357000
*/*    C039000-040000                                        @OZ11029*/ 02381200
*/*    A075200,171200                                        @OZ12139*/ 02405400
*/*    ADD DDR EXIT SUPPORT (SP1.2)                          @G384PLT*/ 02429600
*/*    COMPATIBLE TAPE MESSAGE - IGF501I                     @ZA50500*/ 02453800
*/*                                                                  */ 02478000
*/* PN  REASON   RLSE     DATE   ORG   COMMENTS                      */ 02502200
*/*                                                                  */ 02526400
*/* $L3=RAS      JBB1326  800801 PDLM: DDR DDRCOM CHANGE             */ 02550600
*/* $L4=VERS     HBB3310  860416 PDLB: Versioning module into        */ 02574800
*/*                                    product.                  @L4A*/ 02599000
*/* $L5=XDEVNUM  HBB3310  860416 PDLB: Incorporate SP3 UCB level     */ 02623200
*/*                                    mapping                   @L5A*/ 02647400
*/* $L6=TSOOP    HBB4410  880104 PDLB: Support TSO CONID/CART.   @L6A*/ 02671600
*/* $L7=DYNAM    HBB4420  900122 PDLA: Dynamic I/O configuration @L7A*/ 02695800
*/* $L8=DYNAM    HBB4420  900226 PDLD: Message Buffer Service support*/ 02720000
*/*                                                              @L8A*/ 02744200
*/* $L9=ATLIB    HBB4430  911001 PDMC: Automated Tape Library    @L9A*/ 02768400
*/* $LA=SHRTP    HBB5520  940602 PDHC: Sysplex Shared Tape       @LAA*/ 02771800
*/*                                    DDRRYENG flag             @LAA*/ 02775200
*/*                                    DDRORIGF field            @LAA*/ 02778600
*/*                                    DDRORIGT field            @LAA*/ 02782000
*/*                                    DDRASUCB field            @LAA*/ 02785400
*/*                                    DDREXPAN field            @LAA*/ 02788800
*/*                                                                  */ 02792600
*/* $D1=DCR16    JBB1326  801001 PDLT: DIRECT INVOCATION OF VARY     */ 02816800
*/*                                    (VARY 'FAST PATH')            */ 02841000
*/*                                                                  */ 02865200
*/* $P1=PMM0280  JBB1326  810424 PDLT: INELIBIBLE 'FROM' DEVICE FOR  */ 02889400
*/*                                    A SYSTEM SWAP SHOULD NOT      */ 02913600
*/*                                    RESULT IN OPERATOR MESSAGES   */ 02937800
*/*                                    BEING ISSUED                  */ 02962000
*/* $P2=PH30645  HBB4420  900226 PDLD: Check for dynamic/static      */ 02986200
*/*                                    incompatibility           @P2A*/ 03010400
*/* $P3=PH31185  HBB4420  900712 PDLD: Check if activate in progress */ 03034600
*/*                                                              @P3A*/ 03058800
*/* $P4=PKB0117  HBB4430  911007 PDMC: Fix miscellaneous declares@P4A*/ 03083000
*/* $P5=PKB4203  HBB4430  920901 PDMC: Add library constant, DDRLIB, */ 03107200
*/*                                    for message IGF516I.      @P5A*/ 03131400
*/* $P6=PIG2267  HBB5510  930825 PDKB: Update prolog with SHOWHDR.   */ 03155600
*/*                                                              @P6A*/ 03179800
*/* $P7=PIG2887  HBB5510  930909 PDKB: Update PRODUCT ID to          */ 03187800
*/*                                    5695-047                  @P7A*/ 03195800
*/*                                                                  */ 03204000
*/* $01=OY55910  HBB4420  930226 PDMC: Add flag bit to indicate that */ 03228200
*/*                                    the SRB associated with the   */ 03252400
*/*                                    I/O request has been scheduled*/ 03276600
*/*                                                              @01A*/ 03300800
*/* $02=OW14834  HBB4430  960125 PDMC: Add message IGF508A       @02A*/ 03312900
*/* $03=OW18608  HBB5510  960730 PDLZ: DDR Swap for shared DASD  @03A*/ 03318900
*/* $04=OW20767  HBB4430  961111 PDLB: Delete IGF508A, UCBTLPOS. @04A*/ 03320100
*/* $05=OW33997  HBB4430  981130 PDLB: Fix when a TAPE "TO" is not   */ 03320300
*/*                                    available and JOB canceled.   */ 03320500
*/*                                    ie: Issue IOSINTRP to end the */ 03320700
*/*                                    WAIT of IGFDM1.           @05A*/ 03320900
*/* $06=OW36129  HBB6603  990331 PDFJ: Include a new value to contain*/ 03321400
*/*                                    the PDAS response code    @06A*/ 03321900
*/* $07=OW44220  HBB6603  000915 PDUU: Dynamic PAV Support           */ 03322000
*/*                                    for the UCBXNBND bit      @07A*/ 03322100
*/* $08=OW45683  HBB6603  010131 PDUU: Modify UCBXNBND variable      */ 03322120
*/*                                    definitions for modules       */ 03322140
*/*                                    written in PLS.           @08A*/ 03322160
*/*                                                                  */ 03322200
*/*                                                                  */ 03322500
*/*                                                                  */ 03323700
*/* A P A R S :                                                      */ 03349200
*/*                                                                  */ 03373400
*/* OY10422 - DEFINE DDRINTER FOR INTERCEPT RETRY IN IGFDM1 @YA10422 */ 03397600
*/*                                                                  */ 03421800
*/*                                                                  */ 03446000
*/*END OF SPECIFICATIONS**********************************************/ 03470200
*%GOTO DDR1;   /*                                                       03500000
          AIF ('&LIST' EQ 'YES').DDR1A                                  03550000
          PRINT OFF                                                     03600000
.DDR1A    ANOP                                                          03650000
DDRCOM   DSECT                                                          03700000
*                                                                       03750000
*******************************************************************     03800000
DDRID     DS        F'0'      DDRCOM INDICATOR                     @L3C 03850000
DDRNXT    DS        F'0'      NEXT DDRCOM                               03900000
DDRCNTRL  DS        0XL4      CONTROL DATA                              03950000
DDRSRC    DS        XL1       SOURCE OF DDR REQUEST                     04000000
DDROPER   EQU       X'80'     OPERATOR REQUEST                          04050000
DDRSYS    EQU       X'40'     SYSTEM REQUEST                            04100000
DDRPAGE   EQU       X'20'     PAGE I/O ERROR REQUEST                    04150000
DDRSTAT   DS        XL1       REQUEST STATUS                            04200000
DDRACTV   EQU       X'80'     REQUEST IS EXECUTING                      04250000
DDRQUE    EQU       X'40'     REQUEST IS QUEUED                         04300000
DDRHAMA   EQU       X'20'     PERMANENTLY INACTIVE REQUEST              04350000
DDRRMV    EQU       X'10'     REMOVE INVALID REQUEST                    04400000
DDRPRG    EQU       X'08'     TERMINATE REQUEST                         04450000
DDRSIRB   EQU       X'04'     REQUEST IS EXECUTED BY SIRB IN IGE0660A   04500000
DDRBYPTM  EQU       X'02'     SYSTEM SWAP AND 'FROM' DEVICE INELIBIBLE  04550000
*                             FOR SWAP - BYPASS ISSUING THE IGF512I     04600000
*                             ERROR TERMINATION MESSAGE            @P1A 04650000
DDRDCHAR  DS        0XL2      DEVICE  CHARACTERISTICES                  04700000
DDRMDR    DS        XL1       MDR RECORD ID                             04750000
DDRDSTAT  DS        XL1       DEVICE TYPE AND FLAGS                     04800000
DDRBUFL   EQU       X'80'     BUFFERER LOG                              04850000
DDRDA     EQU       X'40'     DIRECT ACCESS DEVICE                      04900000
DDRMT     EQU       X'20'     MAGNETIC TAPE DEVICE                      04950000
DDRUR     EQU       X'10'     UNIT RECORD DEVICE                        05000000
DDRRCYLE  EQU       X'08'     A MAGNETIC TAPE DEVICE SWAP THAT IS       05050000
*                             BEING RECYCLED BECAUSE OF AN I/O ERROR    05100000
*                             DURING REPOSITIONING                 @L3C 05150000
DDRTRPOS  EQU       X'04'     A MAGNETIC TAPE DEVICE SWAP THAT IS       05200000
*                             IN THE REPOSITIONING PHASE OF THE         05250000
*                             SWAP                                 @L3C 05300000
DDRMTEND  EQU       X'02'     A MAGNETIC TAPE DEVICE SWAP THAT          05350000
*                             HAS COMPLETED THE REPOSITIONING           05400000
*                             PHASE                                @L3C 05450000
DDRUIOSB  DS        XL4       USER IOSB ADDRESS                         05500000
DDRUASID  DS        XL2       USER ADDRESS SPACE                        05550000
          DS        XL2       RESERVED.                            @L5A 05600000
DDRFMNAM  DS       0XL4       "FROM" UCB name in 4 bytes.          @L5A 05650000
          DS        XL1       High order byte UCB nane.        .   @L5A 05700000
DDRFMCUA  DS        XL3       "FROM" UCB name in 3 bytes.               05750000
DDRTONAM  DS       0XL4       "TO" UCB name in 4 bytes.            @L5A 05800000
          DS        XL1       High order byte UCB name.            @L5A 05850000
DDRTOCUA  DS        XL3       "TO" UCB name in 3 bytes.                 05900000
DDRTOUCB  DS        XL4       TO UCB ADDRESS                            05950000
DDRFMUCB  DS        XL4       FROM UCB ADDRESS                          06000000
DDRROWN   DS        XL1       REQUEST RESOURCES                         06050000
DDRRTENQ  EQU       X'80'     TAPE ALLOC RESOURCE HELD                  06100000
DDRRUENQ  EQU       X'40'     UNIT RECORD ALLOC RESOURCE HELD           06150000
DDRRDENQ  EQU       X'20'     DISK ALLOC RESOURCE HELD                  06200000
DDRRYENQ  EQU       X'10'     DYNAMIC RESOURCE HELD                @LAA 06225000
DDRDEN    EQU       X'04'     A MAGNETIC TAPE DEVICE SWAP IN WHICH THE  06250000
*                             TAPES ARE COMPATIBLE BUT NOT IDENTICAL IN 06300000
*                             THE DENSITIES THAT THEY SUPPORT  @ZA50500 06350000
DDRJES3L  EQU       X'02'     IGFDL1 USING JES3 UCB LIST        Y02BKCI 06400000
DDRFIRST  EQU       X'01'     IGFDL1 RECURSIVE BIT/FIRST TIME SWITCH    06450000
DDRLEVEL  DS        XL1       IOS DDR LEVEL FROM IOSLEVEL      @G860PLM 06500000
DDRASID   DS        XL2       DDR ADDRESS SPACE                         06550000
DDRUDCB   DS        XL4       USER DCB ADDRESS                  OZ11029 06600000
DDRUDEB   DS        XL4       USER DEB ADDRESS                  OZ11029 06650000
DDRUIOB   DS        XL4       USER IOB ADDRESS                          06700000
DDRUTCB   DS        XL4       USER TCB ADDRESS                          06750000
DDRUASCB  DS        XL4       USER ASCB ADDRESS                         06800000
DDRTEST   DS        XL4       TESTING FIELD                             06850000
DDRTER    DS        0XL2      TERMINATION PARM FIELD                    06900000
DDRTER1   DS        XL1       TERMINATION REASON CODE                   06950000
DDRTNF    EQU       X'01'     NO USER FOUND                             07000000
DDRTEP    EQU       X'02'     ERP IN PROGRESS                           07050000
DDRTOC    EQU       X'03'     OPEN/CLOSE/EOV IN PROGRESS                07100000
DDRTBR    EQU       X'04'     BLOCKCOUNT UNRELIABLE                     07150000
DDRTCO    EQU       X'05'     OPERATOR CANCELLED                        07200000
DDRTIU    EQU       X'06'     INVALID USER EXIT                         07250000
DDRTCE    EQU       X'07'     CATASTROPHIC ERROR                        07300000
DDRTID    EQU       X'08'     INVALID DEVICE                            07350000
DDRTCU    EQU       X'09'     CANCELLED BY USER                         07400000
DDRTJE    EQU       X'0A'     JES3 ERROR                        Y02BKCI 07450000
DDRTEXC   EQU       X'0B'     EXIT CANCELLED SWAP BUT DID NOT SUPPLY   X07500000
                              MESSAGE                          @G384PLT 07550000
DDRTAIP   EQU       X'0C'     ACTIVATE IN PROGRESS                 @P3A 07600000
DDRTREP   EQU       X'0D'     REPOSITIONING ERROR IN TAPE LIBRARY  @L9A 07618700
DDRTRD    EQU       X'0E'     READ ERROR IN TAPE LIBRARY           @L9A 07637400
DDRTRR    EQU       X'0F'     READ OR REPOSITIONING ERROR IN            07656100
*                             TAPE LIBRARY                         @L9A 07674800
DDRTLF    EQU       X'10'     FAILURE DURING MOUNT, DEMOUNT, OR         07693500
*                             VOLUME VERIFICATION in TAPE LIBRARY       07712200
*                             ENVIRONMENT                          @L9A 07730900
DDRTIOA   EQU       X'11'     IOACTION REQUIRED - DEVICE IS SHARED      07735600
*                             DASD BUT THE DEVICE WAS FOUND NOT TO      07740300
*                             BE QUIESCED BY THE IOACTION COMMAND  @03A 07745000
DDRTMSG   EQU       X'FF'     TEXT FOR THE TERMINATION REASON IS       X07750000
                              SUPPLIED IN DDEMSG (IN IGFDDE)   @G384PLT 07800000
DDRTER2   DS        XL1       TERMINATION FIELD                         07850000
DDRINV    DS        0XL2      INVALID FLAGS                             07900000
DDRINV1   DS        XL1       INVALID REASON CODE                       07950000
DDRIMP    EQU       X'01'     MOUNT PENDING                             08000000
DDRIUF    EQU       X'02'     UNIT REFERENCE INVALID                    08050000
DDRINS    EQU       X'03'     UNSUPPORTED USE                           08100000
DDRIIN    EQU       X'04'     INCOMPATIBLE                              08150000
DDRINO    EQU       X'05'     NOT OPERATIONAL                           08200000
DDRINA    EQU       X'06'     NOT ALLOCATED                             08250000
DDRIDT    EQU       X'07'     INVALID DEVICE TYPE                       08300000
DDRIJ3    EQU       X'08'     JES3 INCOMPATIBLE                 Y02BKCI 08350000
DDRIONL   EQU       X'09'     OFFLINE DEVICE CANNOT BE VARIED ONLINE   F08400000
                                                                   @D1A 08450000
DDRIDYST  EQU       X'0A'     DEVICES DYNAMIC/STATIC INCOMPATIBLE  @P2A 08475000
DDRIVOLI  EQU       X'0B'     DASD TO DEVICE DOES NOT HAVE MATCHING     08477700
*                              VOLSER                              @03A 08480400
DDRIIOA   EQU       X'0C'     DASD FROM DEVICE HAS NOT BEEN QUIESCED    08483100
*                              VIA IOACTION COMMAND                @03A 08485800
DDRIOPD   EQU       X'0D'     CANNOT SWAP TO AN ONLINE PERMANENTLY      08488500
*                              RESIDENT DASD DEVICE                @03A 08491200
DDRIPAG   EQU       X'0E'     CANNOT SWAP A DEVICE WITH AN ACTIVE       08493900
*                              PAGE DATASET                        @03A 08496600
DDRINV2   DS        XL1       VALIDATE'S PARM FIELD                     08500000
DDRVFM    EQU       X'01'     VALIDATE  FROM  DEVICE                    08550000
DDRVCM    EQU       X'02'     VALIDATE TO DEVICE                        08600000
DDRVUS    EQU       X'03'     USER IS AVAILABLE                         08650000
DDRAPP    DS        0XL2      APPENDAGE PARM FIELDS                     08700000
DDRAPP1   DS        XL1       APPENDAGE PARM LIST 1                     08750000
DDRAPP2   DS        XL1       APPENDAGE PARM LIST 2                     08800000
DDRIBUFL  DS        XL2       I/O BUFFER LENGTH                         08850000
DDRIBUF   DS        XL4       I/O BUFFER ADDRESS                        08900000
DDRCOUNT  DS        XL4       I/O OPERATION REPEAT COUNT                08950000
DDRIOF    DS        0XL2      I/O PARM FLAGS                            09000000
DDRIOF1   DS        XL1       I/O PARM FLAGS FIELD 1                    09050000
DDRREAD   EQU       X'02'     ISSUE A READ COMMAND                      09100000
DDRRUN    EQU       X'0F'     ISSUE A REWIND AND RELOAD COMMAND         09150000
DDRRDBK   EQU       X'0C'     ISSUE A READ BACKWARDS COMMAND            09200000
DDRXA4    EQU       X'A4'     ISSUE  A READ AND RESET BUFFERED          09250000
*                            LOG COMMAND                                09300000
DDRBSF    EQU       X'2F'     ISSUE A BACKWARD SPACE FILE COMMAND       09350000
DDRFSF    EQU       X'3F'     ISSUE A FORWARD SPACE FILE COMMAND        09400000
DDRNOP    EQU       X'03'     ISSUE A NOP COMMAND                       09450000
DDRSNS    EQU       X'04'     ISSUE A SENSE COMMAND                     09500000
DDRLOAD   EQU       X'01'     LIBRARY MOUNT SUBCOMMAND OF PERFORM       09516600
*                             LIBRARY FUNCTION                     @L9A 09533200
DDRIOF2   DS        XL1       I/O PARM FLAGS FIELD 2                    09550000
DDRWHICH  EQU       X'80'     I/O TO BE PERFORMED                       09600000
DDRITAKE  EQU       X'40'     GET/RELEASE CONTROL                       09650000
DDRILAB   EQU       X'20'     LABEL PROCESSING                          09700000
DDRIMNT   EQU       X'10'     MOUNT REQUEST                             09750000
DDRICNT   EQU       X'08'     COUNT FIELD INDICATOR                     09800000
DDRTCNTL  EQU       X'04'     NOP BEING USED TO TAKE                    09850000
*                             CONTROL OF DEVICE                @G384PLT 09900000
DDR@WAIT  EQU       X'02'     IGFDM1 at SVC 1 waiting on STARTIO.  @05A 09925000
DDRMSG    DS        0XL2      MESSAGE PARM FLAGS                        09950000
DDRMSGOP  DS        XL1       OPERATOR RESPONSE                         10000000
DDRWTOR   EQU       X'01'     ISSUE WTOR MESSAGE                        10050000
DDRYES    EQU       X'02'     YES REPLY                                 10100000
DDRNO     EQU       X'03'     NO REPLY                                  10150000
DDRCUA    EQU       X'04'     CUA REPLY                                 10200000
DDRMSGCD  DS        XL1       MESSAGE NUMBER CODE                       10250000
DDRM500I  EQU       X'01'     ISSUE IGF500I MESSAGE                     10300000
DDRM500D  EQU       X'02'     ISSUE IGF500D MESSAGE                     10350000
DDRM502E  EQU       X'03'     ISSUE IGF502E MESSAGE                     10400000
DDRM503I  EQU       X'04'     ISSUE IGF503I MESSAGE                     10450000
DDRM505I  EQU       X'05'     ISSUE IGF505I MESSAGE                     10500000
DDRM509I  EQU       X'06'     ISSUE IGF509I MESSAGE                     10550000
DDRM509D  EQU       X'07'     ISSUE IGF509D MESSAGE                     10600000
DDRM511A  EQU       X'08'     ISSUE IGF511A MESSAGE                     10650000
DDRM512I  EQU       X'09'     ISSUE IGF512I MESSAGE                     10700000
DDRM513I  EQU       X'0A'     ISSUE IGF513I MESSAGE                     10750000
DDRM515I  EQU       X'0B'     ISSUE IGF515I MESSAGE                @L9C 10800000
DDRM514I  EQU       X'0C'     ISSUE IGF514I MESSAGE            @OZ12139 10850000
DDRM501I  EQU       X'0D'     ISSUE IGF501I MESSAGE            @ZA50500 10900000
DDRM516I  EQU       X'0E'     ISSUE IGF516I MESSAGE                @L9A 10950000
DDRM517I  EQU       X'0F'     ISSUE IGF517I MESSAGE                @L9A 11000000
DDRM518I  EQU       X'10'     ISSUE IGF518I MESSAGE                @L9A 11050000
DDRM519I  EQU       X'11'     ISSUE IGF519I MESSAGE                @L9A 11100000
DDRMSGP   DS        0XL8      MESSAGE CODES                             11150000
DDRMSGPN  DS        XL1       NUMBER OF MESSAGE CODES                   11200000
DDRMSGPC  DS        XL7       (0-7) MESSAGE CODES                       11250000
DDRPNO    EQU       X'01'     COMPRESS FIELD                            11300000
DDRPFM    EQU       X'02'     FROM CUA                                  11350000
DDRPTO    EQU       X'03'     TO CUA                                    11400000
DDRPVL    EQU       X'04'     VOLUME SERIAL NUMBER                      11450000
DDRPLT    EQU       X'05'     LABEL TYPE                                11500000
DDRPSN    EQU       X'06'     VOLUME SEQUENCE NUMBER                    11550000
DDRPTM    EQU       X'07'     TERMINATION CODE                          11600000
DDRLIB    EQU       X'08'     OBTAIN LIBRARY NAME OF TAPE DRIVE    @P5C 11650000
DDRPIC    EQU       X'09'     INVALID CONDITION CODE                    11700000
DDRPDV    EQU       X'0A'     DEVICE-CHARACTER STRING                   11750000
DDRPRC    EQU       X'0B'     REASON CODE                               11800000
DDRLABEL  DS        XL1       TAPE FROM LABEL TYPE                      11850000
DDRLAL    EQU       X'80'     ANSI LABEL                                11900000
DDRLBLP   EQU       X'40'     BYPASS LABEL PROCESSING                   11950000
DDRLNL    EQU       X'20'     NO LABEL                                  12000000
DDRLNSL   EQU       X'10'     NON-STANDARD LABEL                        12050000
DDRLSD    EQU       X'08'     STANDARD LABEL                            12100000
DDRLNOP   EQU       X'01'     NO POSITIONING AND TAPE READING           12150000
DDRRETRY  DS        XL1       IGFDM0 RETRY COUNT                        12200000
DDRREC    DS        0XL2      RECORDER PARM FIELDS                      12250000
DDRREC1   DS        XL1       RECORDER FLAGS                            12300000
DDRRECON  EQU       X'01'     WRITE DDR RECORD                          12350000
DDRR91    EQU       X'02'     ISSUE SVC 91                              12400000
DDRRBLF   EQU       X'03'     BUFFERED LOG TO BE READ/RESET             12450000
*                         AND RECORDED                                  12500000
DDRREC2   DS        XL1       RECORDER PARM LIST                        12550000
DDRRFMTO  EQU       X'80'     (0=TO,1=FROM) RECORD                      12600000
DDRUSER   DS        0XL4      USER FIELDS                       YM04069 12650000
DDRUMODE  DS         XL1      USER MODE                         YM04069 12700000
DDRURESV  DS         XL3      RESERVED                          YM04069 12750000
DDRUBCNT  DS         XL4      USER BLOCK COUNT                  YM04069 12800000
DDRSSOB   DS         XL4      ADDRESS OF SSOB                   Y02BKCI 12850000
DDREXITI  DS         A        ADDRESS OF DDREXIT INFORMATION CONTROL   X12900000
                              BLOCK                            @G384PLT 12950000
DDRWTOWD  DS         0XL4     WTO ID WORD                      @G384PLT 13000000
DDRWTO1   DS         XL1      FIRST BYTE OF WTO ID WORD, USED BY DDR   X13050000
                              WHEN DOING CS WITH UCBWTOID      @G384PLT 13100000
DDRWTOID  DS         XL3      WTO ID (SAVED FOR MESSAGES WHICH MUST    X13150000
                              BE DOM'D                         @G384PLT 13200000
DDRRSV    DS         XL1      RESERVED                             @L9M 13225000
DDRFLAGS  DS         XL1      MISC FLAGS                       @YA10422 13250000
DDRINTER  EQU        X'80'    INTERCEPT INDICATOR              @YA10422 13300000
DDRIOA    EQU        X'40'    'FROM' DEVICE QUIESCED BY IOACTION   @03A 13325000
DDRPDASV  EQU        X'20'    PDASoption was found on the SWAP     @06A 13333300
*                             command.                             @06A 13341600
DDRFXBND EQU         X'10'    UCBXNBND status for FROM UCB         @08C 13343190
DDRTXBND EQU         X'08'    UCBXNBND status for TO UCB           @08C 13343780
*                    X'04'    (RESERVED)                           @07A 13344600
*                    X'02'    (RESERVED)                           @07A 13345600
*                    X'01'    (RESERVED)                           @07A 13346600
DDRERRCD  DS         XL2      ERROR CODE FOR CURRENTLY MOUNTED          13350000
*                             VOLUME                               @L9A 13375000
DDRMBTKN  DS         XL4      Address of message buffer token for       13400000
*                             Console Services message buffer      @L8A 13450000
DDRFTPTS  DS         0XL4     DDR FOOTPRINTS                       @L3C 13600000
DDRFTPT1  DS         XL1      FIRST FOOTPRINT BYTE                 @L3C 13650000
DDRFTPT2  DS         XL1      SECOND FOOTPRINT BYTE                @L3C 13700000
DDRFTPT3  DS         XL1      THIRD FOOTPRINT BYTE                 @L3C 13750000
DDRDW0IN  EQU        X'80'    DW0 RECEIVED CONTROL                 @L3C 13800000
DDRIOSIN  EQU        X'40'    IOSSWAP ABOUT TO BE ISSUED           @L3C 13850000
DDRIOSOT  EQU        X'20'    RETURN FROM IOSSWAP                  @L3C 13900000
DDRJES3C  EQU        X'10'    THE FINAL SSI CALL TO JES3 SIGNALING      13950000
*                             SWAP COMPLETE HAS BEEN ISSUED        @L3C 14000000
DDRSCHED  EQU        X'08'    THE SRB ASSOCIATED WITH THE I/O REQUEST   14016600
*                             HAS BEEN SCHEDULED.                  @01A 14033200
DDRFTPT4  DS         XL1      FOURTH FOOTPRINT BYTE                @L3C 14050000
DDRSERVE  DS         XL16     FIELD RESERVED FOR SERVICEABILITY         14100000
*                             USE                                  @L3C 14150000
DDRCONID  DS         F        Four byte console ID.                @L6A 14200000
DDRCART   DS         CL8      Command And Response Token.          @L6A 14250000
DDRLTKN   DS         CL4      TOKEN RETURNED BY LACS SERVICE       @L9C 14300000
DDRFMPT   DS         CL8      FROM UCB Pin Token                   @L7A 14350000
DDRTOPT   DS         CL8      TO UCB Pin Token                     @L7A 14400000
DDRORIGF  DS         XL4      ADDR. OF PRE-SWAP 'FROM' UCB         @LAA 14410000
DDRORIGT  DS         XL4      ADDR. OF PRE-SWAP 'TO' UCB           @LAA 14420000
DDRASUCB  DS         XL4      ADDR. OF ALLOCATION-SERIALIZED UCB   @LAA 14430000
DDRASIM   DS         XL4      ADDRESS OF ASIM USED FOR IOACTION         14433300
*                              PROCESSING FOR SHARED DASD          @03A 14436600
DDRASIML  DS         XL2      ASIM LENGTH                          @03A 14439900
DDRPDAS   DS         CL1      Value of PDASoption (when            @06A 14441500
*                             DDRFLAGS.DDRPDASV is on)             @06A 14443100
          DS         XL1      RESERVED                             @06C 14444700
DDREXPAN  DS         XL40     RESERVED FOR EXPANSION               @03C 14446500
DDRCEND   DS         0F       END DDRCOM ON WORD BOUNDARY. SRB          14450000
*                             FOLLOWS IN GETMAIN AREA.             @L3C 14500000
      POP PRINT                                                         14550000
            MEND                                                        14600000
           EJECT                                                        14650000
*            */                                                         14700000
*%DDR1: ;                                                               14750000
*%IHALPUSH='@LISTPUSH';                                                 14800000
*%IHALPOP='@LISTPOP';                                                   14850000
*%IHALOFF='@LISTOFF';                                                   14900000
*IHALPUSH;                                                              14950000
*%IF IHALIST='NO'  %THEN                                  /*     @L3C*/ 15000000
*            %GOTO  DDRCOM2A;                             /*     @L3C*/ 15050000
*            %GOTO  DDRCOM2B;                             /*     @L3C*/ 15100000
*%DDRCOM2A:  ;                                            /*     @L3C*/ 15150000
*IHALOFF;                                                               15200000
*%DDRCOM2B:  ;                                            /*     @L3C*/ 15250000
* DCL 1 DDRCOM BASED (DDRPTR) BDY(WORD),                                15300000
*        3 DDRID CHAR(4),          /* DDRCOM INDICATOR */               15350000
*        3 DDRNXT PTR(31),                                              15400000
*        3 DDRCNTRL CHAR(4),       /* CONTROL DATA*/                    15450000
*          4 DDRSRC CHAR(1),       /* SOURCE OF DDR REQUEST */          15500000
*            5 DDROPER BIT(1),     /* OPERATOR REQUEST */               15550000
*            5 DDRSYS BIT(1),      /* SYSTEM REQUEST  */                15600000
*            5 DDRPAGE BIT(1),      /* I/O ERROR ON A PAGE */           15650000
*            5 *   BIT(5),         /* RESERVED */                       15700000
*          4 DDRSTAT CHAR (1),     /* REQUEST STATUS*/                  15750000
*            5 DDRACTV BIT(1),     /* REQUEST IS EXECUTING */           15800000
*            5 DDRQUE BIT(1),      /* REQUEST IS QUEUED */              15850000
*            5 DDRHAMA BIT (1),    /* PERMANENTLY INACTIVE REQUEST*/    15900000
*            5 DDRRMV BIT(1),      /* REMOVE INVALID REQUEST */         15950000
*            5 DDRPRG BIT(1),      /* TERMINATE REQUEST */              16000000
*            5 DDRSIRB BIT(1),     /*REQUEST IS EXECUTED BY SIRB        16050000
*                                    IN IGE0660A  */                    16100000
*            5 DDRBYPTM BIT(1),    /* SYSTEM SWAP AND 'FROM' DEVICE     16150000
*                                     INELIGIBLE FOR SWAP - BYPASS      16200000
*                                     ISSUING THE IGF512I ERROR         16250000
*                                     TERMINATION MESSAGE        @P1A*/ 16300000
*            5 *     BIT(1),       /* RESERVED                   @P1C*/ 16350000
*          4 DDRDCHAR CHAR(2),       /* DEVICE CHARACTERISTICES */      16400000
*            5 DDRMDR CHAR(1),       /* MDR RECORD ID */                16450000
*            5 DDRDSTAT CHAR(1),     /* DEVICE TYPE AND FLAGS */        16500000
*              6 DDRBUFL BIT(1),     /* BUFFERED LOG */                 16550000
*              6 DDRDA BIT(1) ,      /* DIRECT ACCESS DEVICE */         16600000
*              6 DDRMT BIT(1),       /* MAGNETIC TAPE DEVICE */         16650000
*              6 DDRUR BIT(1),       /* UNIT RECORD DEVICE */           16700000
*              6 DDRRCYLE BIT(1),    /* A MAGNETIC TAPE DEVICE SWAP     16750000
*                                       THAT IS BEING RECYCLED BECAUSE  16800000
*                                       OF AN I/O ERROR DURING          16850000
*                                       REPOSITIONING            @L3C*/ 16900000
*              6 DDRTRPOS BIT(1),    /* A MAGNETIC TAPE DEVICE SWAP     16950000
*                                       THAT IS IN THE REPOSITIONING    17000000
*                                       PHASE OF THE SWAP        @L3C*/ 17050000
*              6 DDRMTEND BIT(1),    /* A MAGNETIC TAPE DEVICE SWAP     17100000
*                                       THAT HAS COMPLETED THE          17150000
*                                       REPOSITIONING PHASE      @L3C*/ 17200000
*              6 *        BIT(1),    /* RESERVED                 @L3C*/ 17250000
*        3 DDRUIOSB PTR(31),         /* USER IOSB ADDRESS            */ 17300000
*        3 DDRUASID FIXED(15),       /* USER ADDRESS SPACE           */ 17350000
*        3 *        CHAR(2),         /* Reserved.                @L5A*/ 17400000
*        3 DDRFMNAM CHAR(4),        /* "FROM" UCB name, 4 bytes. @L5A*/ 17450000
*         4 *        CHAR(1),       /* High order byte, UCB name @L5A*/ 17500000
*         4 DDRFMCUA CHAR(3),        /* "FROM" UCB name, 3 bytes @L5C*/ 17550000
*        3 DDRTONAM CHAR(4),         /* "TO" UCB name, 4 bytes.  @L5A*/ 17600000
*         4 *        CHAR(1),        /* High byte.               @L5A*/ 17650000
*         4 DDRTOCUA CHAR(3),        /* "TO" UCB name, 3 bytes.  @L5C*/ 17700000
*        3 DDRTOUCB PTR(31),         /* TO UCB ADDRESS               */ 17750000
*        3 DDRFMUCB PTR(31),         /* FROM UCB ADDRESS             */ 17800000
*        3 DDRROWN CHAR(1),          /* REQUEST RESOURCES            */ 17850000
*          4 DDRRTENQ BIT(1),        /* TAPE ALLOC RESOURCE HELD     */ 17900000
*          4 DDRRUENQ BIT(1),      /* UNIT RECORD ALLOC RESOURCE HELD*/ 17950000
*          4 DDRRDENQ BIT(1),        /* DISK ALLOC RESOURCE HELD     */ 18000000
*          4 DDRRYENQ BIT(1),        /* DYNAMIC RESOURCE HELD    @LAA*/ 18033300
*          4 *     BIT(1),           /* RESERVED                     */ 18066600
*          4 DDRDEN   BIT(1),        /* A MAGNETIC TAPE DEVICE SWAP IN  18100000
*                                       WHICH THE TAPES ARE COMPATIBLE  18150000
*                                       BUT NOT IDENTICAL IN THE        18200000
*                                       DENSITIES THAT THEY             18250000
*                                       SUPPORT              @ZA50500*/ 18300000
*          4 DDRJES3L BIT(1),  /* IGFDL1 USING JES3 UCB LIST @Y02BKCI*/ 18350000
*          4 DDRFIRST BIT(1),        /* IGFDL1 RECURSIVE BIT/FIRST      18400000
*                                       TIME SWITCH                  */ 18450000
*        3 DDRLEVEL CHAR(1),         /* IOS DDR LEVEL FROM IOSLEVEL     18500000
*                                                            @G860PLM*/ 18550000
*        3 DDRASID FIXED(15),        /* DDR ADDRESS SPACE            */ 18600000
*        3 DDRUDCB PTR(31),          /* USER DCB ADDRESS             */ 18650000
*        3 DDRUDEB PTR(31),          /* USER DEB ADDRESS             */ 18700000
*        3 DDRUIOB PTR(31),          /* USER IOB ADDRESS             */ 18750000
*        3 DDRUTCB PTR(31),          /* USER TCB ADDRESS             */ 18800000
*        3 DDRUASCB PTR(31),          /* USER ASCB ADDRESS           */ 18850000
*        3 DDRTEST CHAR(4),          /* TESTING FIELD                */ 18900000
*        3 DDRTER CHAR(2),           /* TERMINATION PARM FIELD       */ 18950000
*          4 DDRTER1 CHAR(1),        /* TERMINATION REASON CODE      */ 19000000
*          4 DDRTER2 CHAR(1),        /* TERMINATION FIELD            */ 19050000
*        3 DDRINV CHAR(2),           /* INVALID FLAGS                */ 19100000
*          4 DDRINV1 CHAR(1),        /* INVALID REASON CODE          */ 19150000
*          4 DDRINV2 CHAR(1),        /* VALIDATE'S PARM FIELD        */ 19200000
*        3 DDRAPP CHAR(2),           /* APPENDAGE PARM FIELDS        */ 19250000
*          4 DDRAPP1 CHAR(1),        /* APPENDAGE PARM LIST 1        */ 19300000
*          4 DDRAPP2 CHAR(1),        /* APPENDAGE PARM LIST 2        */ 19350000
*        3 DDRIBUFL FIXED(15),       /* I/O BUFFER LENGTH            */ 19400000
*        3 DDRIBUF PTR(31),          /* I/O BUFFER ADDRESS           */ 19450000
*        3 DDRCOUNT FIXED(31),       /* I/O OPERATION REPEAT COUNT   */ 19500000
*        3 DDRIOF CHAR(2),           /* I/O PARM FLAGS               */ 19550000
*          4 DDRIOF1 CHAR(1),        /* I/O PARM FLAGS FIELD 1       */ 19600000
*          4 DDRIOF2 CHAR(1),        /* I/O PARM FLAGS FIELD 2       */ 19650000
*            5 DDRWHICH BIT(1),      /* I/O TO BE PERFORMED          */ 19700000
*            5 DDRITAKE BIT(1),      /* DEVICE GET/REL CONTROL       */ 19750000
*            5 DDRILAB BIT(1),       /* LABEL PROCESSING             */ 19800000
*            5 DDRIMNT BIT(1),       /* MOUNT REQUEST                */ 19850000
*            5 DDRICNT BIT(1),       /* COUNT FIELD INDICATOR        */ 19900000
*            5 DDRTCNTL BIT(1),      /* NOP BEING USED TO TAKE          19950000
*                                       CONTROL OF DEVICE    @G384PLT*/ 20000000
*            5 DDR@WAIT BIT(1),      /* IGFDM1 at SVC 1 waiting on      20025000
*                                       STARTIO.                 @05A*/ 20050000
*            5 *        BIT(1),      /* RESERVED.                @05C*/ 20075000
*        3 DDRMSG CHAR(2),           /* MESSAGE PARM FLAGS           */ 20100000
*          4 DDRMSGOP CHAR(1),       /* OPERATOR RESPONSE            */ 20150000
*          4 DDRMSGCD FIXED(8),      /* MESSAGE NUMBER CODE          */ 20200000
*        3 DDRMSGP CHAR(8),          /* MESSAGE CODES                */ 20250000
*          4 DDRMSGPN FIXED (8),     /* NUMBER OF MESSAGE CODES      */ 20300000
*          4 DDRMSGPC(7) FIXED(8),   /* (0-7) MESSAGE CODES          */ 20350000
*        3 DDRLABEL CHAR(1),         /* TAPE FROM LABEL TYPE         */ 20400000
*          4 DDRLAL BIT(1),          /* ANSI LABEL                   */ 20450000
*          4 DDRLBLP BIT(1),         /* BYPASS LABEL PROCESSING      */ 20500000
*          4 DDRLNL BIT(1),          /* NO LABEL                     */ 20550000
*          4 DDRLNSL BIT(1),         /* NON-STANDARD LABEL           */ 20600000
*          4 DDRLSD BIT(1),          /* STANDARD LABEL               */ 20650000
*          4  *      BIT(2),         /* RESERVED                     */ 20700000
*          4 DDRLNOP BIT(1),       /* NO POSITIONING AND TAPE READING*/ 20750000
*        3 DDRRETRY FIXED(8),        /* IGFDM0 RETRY COUNT           */ 20800000
*        3 DDRREC CHAR(2),           /* RECORDER PARM FIELDS         */ 20850000
*          4 DDRREC1 CHAR(1),        /* RECORDER FLAGS               */ 20900000
*          4 DDRREC2 CHAR(1),        /* RECORDER PARM LIST           */ 20950000
*            5 DDRRFMTO BIT(1),      /* (0=TO,1=FROM) RECORD         */ 21000000
*            5 *     BIT(7),         /* RESERVED                     */ 21050000
*        3 DDRUSER CHAR(4),          /* USER FIELDS           YM04069*/ 21100000
*          4 DDRUMODE CHAR(1),       /* USER MODE             YM04069*/ 21150000
*          4  *      CHAR(3),        /* RESERVED              YM04069*/ 21200000
*        3 DDRUBCNT FIXED(31),       /* USER BLOCK COUNT      YM04069*/ 21250000
*        3 DDRSSOB PTR(31),          /* ADDRESS OF SSOB      @Y02BKCI*/ 21300000
*        3 DDREXITI PTR(31),         /* ADDRESS OF DDR EXIT INFORMATION 21350000
*                                       CONTROL BLOCK        @G384PLT*/ 21400000
*        3 DDRWTOWD FIXED(32),       /* WTO ID WORD          @G384PLT*/ 21450000
*          4 DDRWTO1 CHAR(1),        /* HIGH ORDER BYTE OF WTOID FIELD. 21500000
*                                       SET WHEN CS USED TO UPDATE      21550000
*                                       UCBWTOID             @G384PLT*/ 21600000
*          4 DDRWTOID FIXED(24),     /* WTO ID SAVED FOR MESSAGES       21650000
*                                       WHICH MUST BE DOM'D  @G384PLT*/ 21700000
*        3 DDRRSV CHAR(1),           /* RESERVED                 @L8C*/ 21750000
*        3 DDRFLAGS CHAR(1),         /* MISC FLAGS               @L8C*/ 21800000
*          5 DDRINTER BIT(1),        /* INTERCEPT INDICATOR  @YA10422*/ 21840000
*          5 DDRIOA   BIT(1),        /* 'FROM' DEVICE QUIESCED BY       21860000
*                                       IOACTION COMMAND         @03A*/ 21880000
*          5 DDRPDASV BIT(1),        /* PDASoption was found on the     21890000
*                                       SWAP command             @06A*/ 21900000
*          5 DDRFXBND BIT(1),        /* UCBXNBND status for FROM        21911680
*                                       UCB                      @08C*/ 21912370
*          5 DDRTXBND  BIT(1),       /* UCBXNBND status for TO          21913060
*                                       UCB                      @08C*/ 21913750
*          5 *        BIT(3),        /* RESERVED                 @07C*/ 21914950
*        3 DDRERRCD FIXED(15),       /* ERROR CODE FOR CURRENTLY        21920000
*                                       MOUNTED VOLUME           @L9C*/ 21960000
*        3 DDRMBTKN  PTR(31),        /* Address of message buffer token 22000000
*                                    for Console Services buffer @L8A*/ 22050000
*        3 DDRFTPTS CHAR(4),         /* DDR FOOTPRINTS           @L3C*/ 22200000
*          4 DDRFTPT1 CHAR(1),       /* FIRST FOOTPRINT BYTE     @L3C*/ 22250000
*          4 DDRFTPT2 CHAR(1),       /* SECOND FOOTPRINT BYTE    @L3C*/ 22300000
*          4 DDRFTPT3 CHAR(1),       /* THIRD FOOTPRINT BYTE     @L3C*/ 22350000
*            5 DDRDW0IN BIT(1),      /* DW0 RECEIVED CONTROL     @L3C*/ 22400000
*            5 DDRIOSIN BIT(1),      /* IOSSWAP ABOUT TO BE ISSUED      22450000
*                                                                @L3C*/ 22500000
*            5 DDRIOSOT BIT(1),      /* RETURN FROM IOSSWAP      @L3C*/ 22550000
*            5 DDRJES3C BIT(1),      /* THE FINAL SSI CALL TO JES3      22600000
*                                       SIGNALING SWAP COMPLETE HAS     22650000
*                                       BEEN ISSUED              @L3C*/ 22700000
*            5 DDRSCHED BIT(1),      /* THE SRB ASSOCIATED WITH THE     22720000
*                                       I/O REQUEST HAS BEEN            22740000
*                                       SCHEDULED.               @01A*/ 22760000
*            5 *        BIT(3),      /* RESERVED                 @01C*/ 22780000
*          4 DDRFTPT4 CHAR(1),       /* FOURTH FOOTPRINT BYTE    @L3C*/ 22800000
*        3 DDRSERVE CHAR(16),        /* FIELD RESERVED FOR              22850000
*                                       SERVICEABILITY USE       @L3C*/ 22900000
*        3 DDRCONID FIXED(31),      /* Four byte console ID.     @L6A*/ 22950000
*        3 DDRCART  CHAR(8),        /* Command And Response Token@L6A*/ 23000000
*        3 DDRLTKN  CHAR(4),         /* TOKEN RETURNED BY LACS   @L9C*/ 23050000
*        3 DDRFMPT CHAR(8),          /* FROM UCB Pin Token       @L7A*/ 23100000
*        3 DDRTOPT CHAR(8),          /* TO UCB Pin Token         @L7A*/ 23150000
*        3 DDRORIGF PTR(31),         /* ORIGINAL 'FROM' UCB      @LAA*/ 23160000
*        3 DDRORIGT PTR(31),         /* ORIGINAL 'TO' UCB        @LAA*/ 23170000
*        3 DDRASUCB PTR(31),         /* ALLOC-SERIALIZED UCB     @LAA*/ 23180000
*        3 DDRASIM  PTR(31),         /* ADDRESS OF ASIM USED FOR        23183300
*                                       IOACTION FOR SHARED DASD @03A*/ 23186600
*        3 DDRASIML FIXED(15),       /* ASIM LENGTH              @03A*/ 23189900
*        3 DDRPDAS  CHAR(1),         /* Value of PDASoption (when       23191500
*                                       DDRFLAGS.DDRPDASV is on) @06A*/ 23193100
*        3 *        FIXED(8),        /* RESERVED                 @06C*/ 23194700
*        3 DDREXPAN CHAR(40),        /* RESERVED FOR EXPANSION   @03C*/ 23196500
*        3 DDRCEND CHAR(0) BDY(WORD);/* END DDRCOM ON WORD BOUNDARY.    23200000
*                                       SRB FOLLOWS IN GETMAINED        23250000
*                                       AREA                     @L3C*/ 23300000
*           /*   EQUATES FOR DDRTER1 FIELD                           */ 23350000
*   DCL                             /*                           @L5C*/ 23400000
*    DDRTNF BIT(8) CONSTANT('01'X), /* NO USER FOUND                 */ 23450000
*    DDRTEP BIT(8) CONSTANT('02'X), /* ERP IN PROGRESS               */ 23500000
*    DDRTOC BIT(8) CONSTANT('03'X), /* OPEN/CLOSE/EOV IN PROGRESS.   */ 23550000
*    DDRTBR BIT(8) CONSTANT('04'X), /* BLOCKCOUNT UNRELIABLE.        */ 23600000
*    DDRTCO BIT(8) CONSTANT('05'X), /* OPERATOR CANCELLED            */ 23650000
*    DDRTIU BIT(8) CONSTANT('06'X), /* INVALID USER EXIT             */ 23700000
*    DDRTCE BIT(8) CONSTANT('07'X), /* CATASTROPHIC ERROR            */ 23750000
*    DDRTID BIT(8) CONSTANT('08'X), /* INVALID DEVICE                */ 23800000
*    DDRTCU BIT(8) CONSTANT('09'X), /* CANCELLED BY USER             */ 23850000
*    DDRTJE BIT(8) CONSTANT('0A'X), /* JES3 ERROR @Y02BKCI           */ 23900000
*    DDRTEXC BIT(8) CONSTANT('0B'X),/* EXIT CANCELLED SWAP              23950000
*                                          BUT DID NOT SUPPLY           24000000
*                                          MESSAGE           @G384PLT*/ 24050000
*    DDRTAIP BIT(8) CONSTANT('0C'X),/* ACTIVATE IN PROGRESS      @P3A*/ 24100000
*    DDRTREP BIT(8) CONSTANT('0D'X),  /* REPOSITIONING ERROR IN         24120000
*                                        TAPE LIBRARY            @L9A*/ 24140000
*    DDRTRD  BIT(8) CONSTANT('0E'X),  /* READ ERROR IN TAPE             24160000
*                                        LIBRARY                 @L9A*/ 24180000
*    DDRTRR  BIT(8) CONSTANT('0F'X),  /* READ OR REPOSITIONING ERROR    24200000
*                                        IN TAPE LIBRARY         @L9A*/ 24220000
*    DDRTLF  BIT(8) CONSTANT('10'X),  /* FAILURE DURING MOUNT, DEMOUNT  24240000
*                                       OR VOLUME VERIFICATION IN       24260000
*                                       TAPE LIBRARY ENVIRONMENT @L9A*/ 24280000
*    DDRTIOA BIT(8) CONSTANT('11'X),  /* IOACTION REQUIRED - DEVICE     24284000
*                                       IS SHARED DASD BUT THE DEVICE   24288000
*                                       WAS FOUND NOT TO BE QUIESCED    24292000
*                                       BY IOACTION COMMAND      @03A*/ 24296000
*    DDRTMSG BIT(8) CONSTANT('FF'X);  /* TEXT FOR THE TERMINATION       24300000
*                                          REASON IS SUPPLIED IN        24350000
*                                          DDEMSG (IN IGFDDE)           24400000
*                                                            @G384PLT*/ 24450000
*       /*   EQUATES FOR DDRINV1 FIELD                               */ 24500000
*   DCL                                 /*                       @L5C*/ 24550000
*     DDRIMP BIT(8) CONSTANT('01'X),    /* MOUNT PENDING             */ 24600000
*     DDRIUF BIT(8) CONSTANT('02'X),    /* UNIT REFERENCE INVALID    */ 24650000
*     DDRINS BIT(8) CONSTANT('03'X),    /* UNSUPPORTED USE           */ 24700000
*     DDRIIN BIT(8) CONSTANT('04'X),    /* INCOMPATIBLE              */ 24750000
*     DDRINO BIT(8) CONSTANT('05'X),    /* NOT OPERATIONAL           */ 24800000
*     DDRINA BIT(8) CONSTANT('06'X),    /* NOT ALLOCATED             */ 24850000
*     DDRIDT BIT(8) CONSTANT('07'X),    /* INVALID DEVICE TYPE       */ 24900000
*     DDRIJ3 BIT(8) CONSTANT('08'X),    /* JES3 INCOMPATIBLE @Y02BKCI*/ 24950000
*     DDRIONL BIT(8) CONSTANT('09'X),   /* OFFLINE DEVICE CANNOT BE     25000000
*                                          VARIED ONLINE         @D1A*/ 25050000
*     DDRIDYST BIT(8) CONSTANT('0A'X),  /* Devices are dynamic/static   25053500
*                                          incompatible          @03C*/ 25057000
*     DDRIVOLI BIT(8) CONSTANT('0B'X),  /* DASD 'TO' DEVICE DOES NOT    25060500
*                                          HAVE MATCHING VOLSER  @03A*/ 25064000
*     DDRIIOA  BIT(8) CONSTANT('0C'X),  /* DASD 'FROM' DEVICE HAS NOT   25067500
*                                          BEEN QUIESCED VIA IOACTION   25071000
*                                          COMMAND               @03A*/ 25074500
*     DDRIOPD  BIT(8) CONSTANT('0D'X),  /* CANNOT SWAP TO ONLINE        25078000
*                                          PERMANENTLY RESIDENT DASD    25081500
*                                          DEVICE                @03A*/ 25085000
*     DDRIPAG  BIT(8) CONSTANT('0E'X);  /* CANNOT SWAP A DEVICE WITH    25088500
*                                          AN ACTIVE PAGE DATASET       25092000
*                                                                @03A*/ 25095500
*       /*   EQUATES FOR DDRINV2 FIELD                               */ 25100000
*   DCL                                 /*                       @L5C*/ 25150000
*     DDRVFM BIT(8) CONSTANT('01'X),    /* VALIDATE FROM DEVICE      */ 25200000
*     DDRVCM BIT(8) CONSTANT('02'X),    /* VALIDATE TO DEVICE        */ 25250000
*     DDRVUS BIT(8) CONSTANT('03'X);    /* USER IS AVAILABLE         */ 25300000
*       /*   EQUATES FOR DDRIOF1 FIELD                               */ 25350000
*   DCL                                 /*                       @L5C*/ 25400000
*     DDRREAD BIT(8) CONSTANT('02'X),   /* ISSUE A READ COMMAND      */ 25450000
*     DDRRUN BIT(8) CONSTANT('0F'X),    /* ISSUE A REWIND AND UNLOAD    25500000
*                                          COMMAND                   */ 25550000
*     DDRRDBK BIT(8) CONSTANT('0C'X),  /*ISSUE READ BACKWARDS COMMAND*/ 25600000
*     DDRXA4 BIT(8) CONSTANT('A4'X),   /*ISSUE READ BUF LOG COMMAND  */ 25650000
*     DDRBSF BIT(8) CONSTANT('2F'X),   /* BACKWARD SPACE FILE COMMAND*/ 25700000
*     DDRFSF BIT(8) CONSTANT('3F'X),   /* FORWARD SPACE FILE COMMAND */ 25750000
*     DDRNOP BIT(8) CONSTANT('03'X),   /* ISSUE NOP COMMAND          */ 25800000
*     DDRSNS BIT(8) CONSTANT('04'X),   /* ISSUE SENSE COMMAND    @P4C*/ 25850000
*     DDRLOAD BIT(8) CONSTANT('01'X);  /* LIBRARY MOUNT SUBCOMMAND      25862500
*                                         OF PERFORM LIBRARY            25875000
*                                         FUNCTION               @L9A*/ 25887500
*           /*   EQUATES FOR DDRMSGOP FIELD                          */ 25900000
*   DCL                                 /*                       @L5C*/ 25950000
*     DDRWTOR BIT(8) CONSTANT('01'X),   /* WTOR MESSAGE              */ 26000000
*     DDRYES BIT(8) CONSTANT('02'X),    /* YES REPLY                 */ 26050000
*     DDRNO BIT(8) CONSTANT('03'X),     /* NO REPLY                  */ 26100000
*     DDRCUA BIT(8) CONSTANT('04'X);    /* CUA REPLY                 */ 26150000
*          /*   EQUATES FOR DDRMSGCD FIELD                           */ 26200000
*   DCL                                /*                        @L5C*/ 26250000
*     DDRM500I BIT(8) CONSTANT('01'X), /* ISSUE IGF500I MESSAGE      */ 26300000
*     DDRM500D BIT(8) CONSTANT('02'X), /* ISSUE IGF500D MESSAGE      */ 26350000
*     DDRM502E BIT(8) CONSTANT('03'X), /* ISSUE IGF502E MESSAGE      */ 26400000
*     DDRM503I BIT(8) CONSTANT('04'X), /* ISSUE IGF503I MESSAGE      */ 26450000
*     DDRM505I BIT(8) CONSTANT('05'X), /* ISSUE IGF505I MESSAGE      */ 26500000
*     DDRM509I BIT(8) CONSTANT('06'X), /* ISSUE IGF509I MESSAGE      */ 26550000
*     DDRM509D BIT(8) CONSTANT('07'X), /* ISSUE IGF509D MESSAGE      */ 26600000
*     DDRM511A BIT(8) CONSTANT('08'X), /* ISSUE IGF511A MESSAGE      */ 26650000
*     DDRM512I BIT(8) CONSTANT('09'X), /* ISSUE IGF512I MESSAGE      */ 26700000
*     DDRM513I BIT(8) CONSTANT('0A'X), /* ISSUE IGF513I MESSAGE      */ 26750000
*     DDRM515I BIT(8) CONSTANT('0B'X), /* ISSUE IGF515I MESSAGE  @L9C*/ 26800000
*     DDRM514I BIT(8) CONSTANT('0C'X), /* ISSUE IGF514I MSG  @OZ12139*/ 26850000
*     DDRM501I BIT(8) CONSTANT('0D'X), /* ISSUE IGF501I MSG      @P4C*/ 26900000
*     DDRM516I BIT(8) CONSTANT('0E'X), /* ISSUE IGF516I MESSAGE  @L9A*/ 26950000
*     DDRM517I BIT(8) CONSTANT('0F'X), /* ISSUE IGF517I MESSAGE  @L9A*/ 27000000
*     DDRM518I BIT(8) CONSTANT('10'X), /* ISSUE IGF518I MESSAGE  @L9A*/ 27050000
*     DDRM519I BIT(8) CONSTANT('11'X); /* ISSUE IGF519I MESSAGE  @04C*/ 27100000
*          /*   EQUATES FOR DDRMSGPC FIELD                           */ 27150000
*   DCL                                 /*                       @L5C*/ 27200000
*     DDRPNO BIT(8) CONSTANT('01'X),    /* COMPRESS FIELD            */ 27250000
*     DDRPFM BIT(8) CONSTANT('02'X),    /* FROM CUA                  */ 27300000
*     DDRPTO BIT(8) CONSTANT('03'X),    /* TO CUA                    */ 27350000
*     DDRPVL BIT(8) CONSTANT('04'X),    /* VOLUME SERIAL NUMBER      */ 27400000
*     DDRPLT BIT(8) CONSTANT('05'X),    /* LABEL TYPE                */ 27450000
*     DDRPSN BIT(8) CONSTANT('06'X),    /* VOLUME SEQUENCE NUMBER    */ 27500000
*     DDRPTM BIT(8) CONSTANT('07'X),    /* TERMINATION CODE          */ 27550000
*     DDRLIB BIT(8) CONSTANT('08'X),    /* OBTAIN LIBRARY NAME OF       27583300
*                                          TAPE DRIVE            @P5C*/ 27616600
*     DDRPIC BIT(8) CONSTANT('09'X),    /* INVALID CONDITION CODE    */ 27650000
*     DDRPDV BIT(8) CONSTANT('0A'X),    /* DEVICE, CHARACTER STRING  */ 27700000
*     DDRPRC BIT(8) CONSTANT('0B'X);    /* REASON CODE               */ 27750000
*         /*   EQUATES FOR DDRREC1 FIELD                             */ 27800000
*   DCL                                /*                        @L5C*/ 27850000
*     DDRRECON BIT(8) CONSTANT('01'X), /* WRITE DDR RECORD           */ 27900000
*     DDRR91 BIT(8) CONSTANT('02'X),   /* ISSUE SVC 91               */ 27950000
*     DDRRBLF BIT(8) CONSTANT('03'X);  /* BUFFERED LOG TO BE            28000000
*                                          READ/RESET AND RECORDED   */ 28050000
*IHALPOP;                                                               28100000
