*   %GOTO FETWK1;                   /* BILINGUAL MAPPING MACRO       */ 00050000
         MACRO                                                          00100000
         IHAFETWK                                                       00150000
*%FETWK1:;                                                              00200000
*/* START OF SPECIFICATIONS **************************************** */ 00250000
*/*                                                                  */ 00500000
*/*01* PROPRIETARY_STATEMENT******************************************/ 00550000
*/*                                                                  */ 00600000
*/*                                                                  */ 00650000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00700000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00750000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1982, 2000                      */ 00800000
*/*                                                                  */ 00850000
*/* STATUS= HBB7703                                                  */ 00900000
*/*                                                                  */ 00950000
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 01000000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01050000
*/*                                                                  */ 01100000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01150000
*/*                                                                  */ 01200000
*/*01* MACRO NAME: IHAFETWK                                          */ 01250000
*/*                                                                  */ 01450000
*/*01* DESCRIPTIVE NAME: Fetch work area definition                  */ 01500000
*/*02* ACRONYM: FTWKAREA                                             */ 01550000
*/*                                                                  */ 01750000
*/*01* DSECT NAME:                                                   */ 01800000
*/*     FTWKAREA                                                     */ 01850000
*/*                                                                  */ 02300000
*/*01* COMPONENT: LOADER (SCLDR)                                     */ 02350000
*/*                                                                  */ 02450000
*/*01* EYE-CATCHER: NONE                                             */ 02450900
*/*                                                                  */ 02451800
*/*01* STORAGE ATTRIBUTES:                                           */ 02452700
*/*02* SUBPOOL: Variable                                             */ 02453600
*/*02* KEY:     0                                                    */ 02454500
*/*                                                                  */ 02455400
*/*01* SIZE: Variable                                                */ 02456300
*/*                                                                  */ 02457200
*/*01* CREATED BY: User                                              */ 02458100
*/*                                                                  */ 02459000
*/*01* DELETED BY: User                                              */ 02459900
*/*                                                                  */ 02460800
*/*01* POINTED TO BY: N/A                                            */ 02461700
*/*                                                                  */ 02462600
*/*01* SERIALIZATION: NONE                                           */ 02463500
*/*                                                                  */ 02464400
*/*01* FUNCTION:                                                     */ 02465300
*/*     IHAFETWK (Fetch work area) has two sections:                 */ 02466200
*/*       FETCHWK is addressed only by IEWFETCH (the fetch program)  */ 02467100
*/*       WKCNTNSV is addressed by IEWFETCH and by the calling       */ 02468000
*/*         program (contents manager, overlay supervisor, or other) */ 02468900
*/*                                                                  */ 02469800
*/*     Storage for the fetch work area is always gotten by the      */ 02470700
*/*     calling program, and must be fixed in storage and below      */ 02471600
*/*     the 16m line since IEWFETCH keeps CCWs and IDALs in this     */ 02472500
*/*     area. The number of bytes of storage which must be obtained  */ 02473400
*/*     is the length of 'FTWKAREA'.                                 */ 02474300
*/*                                                                  */ 02475200
*/*                                                                  */ 02476100
*/*01* METHOD OF ACCESS:                                             */ 02477000
*/*02* ASM:                                                          */ 02477900
*/*             The FTWKAREA DSECT is generated.                     */ 02478800
*/*             Only the symbols in the 'WKCNTNSV' area are          */ 02479700
*/*             generated in assembler.                              */ 02480600
*/*02* PL/X:                                                         */ 02481500
*/*             The declaration is based on pointer 'FTWKPTR'.       */ 02482400
*/*             If %ihalist='yes', is specified both 'FETCHWK'       */ 02483300
*/*             and 'WNCNTNSV' will be fully defined, otherwise      */ 02484200
*/*             the fields within 'FETCHWK' will not be defined.     */ 02485100
*/*             (the fields within 'WKCNTNSV' will be defined        */ 02486000
*/*             at the proper offset).                               */ 02486900
*/*                                                                  */ 02487800
*/*      Note that the area defined as 'FTCLEAR' is set to hex       */ 02488700
*/*      zeros upon entry to IEWFETCH.                               */ 02489600
*/*                                                                  */ 02490500
*/*                                                                  */ 02491400
*/*01* DEPENDENCIES: NONE                                            */ 02492300
*/*                                                                  */ 02493200
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 02494100
*/*                                                                  */ 02495000
*/*01* NOTES: NONE                                                   */ 02495900
*/*   CHANGE ACTIVITY FLAG DESCRIPTORS                               */ 02500000
*/*                                                                  */ 02550000
*/* $L1=DFP,JDP1110,,STLPJH: ADD FIELDS FOR MESSAGE MOD AND LLA      */ 02600000
*/* $L2=DFP,JDP1111,,STLPJH: PCI SUPPORT (THIS IS A REWRITE)         */ 02650000
*/* $L3=DFP,HDP2210,,STLPJH: PCI SUPPORT FOR OVERLAY MODULES     @L3A*/ 02700000
*/* $L4=DFP,HDP2210,,STLPJH: ADD POINTER TO LAST CCW EXECUTED    @L4A*/ 02750000
*/* $01=DFP,HDP2210,OY04826,ISGPJK: SAVE M-VALUE NON-CONTIG TXT  @01A*/ 02800000
*/* $02=DFP,HDP3310,OY19743,NSDKAL: ABEND0D2 OR 0C4 AFTER CANCEL @02A*/ 02850000
*/* $L5=PMLOADER,HDP3330,,STLSAM: PMLOADER/PDSE SUPPORT          @L5A*/ 02900000
*/* $P1=K130673,HDZ11C0,941110,SJPLRK: >255 RLDS AFTER TXT RECORD,   */ 02950000
*/*                                    (FIN OW07942)             @P1A*/ 03000000
*/* $L6=PM3,HDZ11D0,961118,SJPLRK: SYSTEMDCB                     @L6A*/ 03050000
*/* $P2=PXD1424 HBB7703 000228 PD00XB: Real>2G                       */ 03075000
*/* END OF SPECIFICATIONS ********************************************/ 03100000
*   %GOTO FETWK2;                                                       03150000
*/*                                                                     03200000
FTWKAREA DSECT                                                          03250000
WKAREA   DS    0CL1540                                                  03300000
FTCLEAR  DS    0CL768             AREA CLEARED TO HEX ZERO BY IEWFETCH  03350000
FETCHWA  DS    CL1424             FETCH WORKAREA                        03400000
         SPACE                                                          03450000
********************* CONTENTS SUPERVISOR WORK AREA                     03500000
WKCNTNSV DS    0CL116                                                   03550000
WKDEBPTR DS    A                  ADDRESS OF THE DEB IF VERIFIED        03600000
*                                 BY CONTENTS MANAGER, IF 'WKDEBOK'     03650000
*                                 IS ZERO, THIS FIELD IS IGNORED        03700000
WKPGMMGR EQU   *                  (SYMBOL KEPT FOR COMPATIBILITY)       03750000
WKCDADDR DS    A                  ADDRESS OF CDE                        03800000
WKIOADDR DS    A                  ADDRESS OF AREA GETMAINED.  FETCH     03850000
*                                 WILL DO I/O INTO THIS AREA            03900000
WKFLAG   DS    C                  TASKLIB SEARCH INDICATOR              03950000
FLAG     EQU   WKFLAG             USED FOR COMPATIBILITY                04000000
WKFLG1   DS    C                  FLAGS FIELDS                          04050000
WKAUTH   EQU   X'80'              IEWFETCH PLACES THE LIBRARY           04100000
*                                 AUTHORIZATION FROM THE DEB HERE       04150000
WKSYSREQ EQU   X'40'              USER IS SYSTEM REQUEST                04200000
WKSYSDCB EQU   X'20'              SYSTEMDCB REQUEST              @L6A   04250000
WKFLG2   DS    1C                 FLAG BYTE TWO                         04300000
WKDEBOK  EQU   X'80'              THE DEB HAS BEEN VERIFIED BY          04350000
*                                 THE CALLING PROGRAM                   04400000
WKUSRLIB EQU   X'08'              THE DCB IS FOR A USER LIBRARY         04450000
WKJOBLIB EQU   X'04'              THE DCB IS FOR THE JOB LIBRARY        04500000
WKSVCLIB EQU   X'02'              THE DCB IS FOR THE SVC LIBRARY        04550000
WKLNKLIB EQU   X'01'              THE DCB IS FOR THE LINK LIBRARY       04600000
*                                                                       04650000
WKFLG3   DS    1C                 FLAG BYTE THREE                       04700000
WKREGIS  DS    4F                 USED TO SAVE REGISTERS ACROSS BLDL    04750000
WKTCBSE  DS    A                  ADDRESS OF TCB CONTAINING LAST DCB    04800000
WKDCBSE  DS    A                  ADDRESS OF LAST DCB SEARCH ARGUMENT   04850000
********************* BLDL ENTRY AND MASK                               04900000
WKBLDE   EQU   *                  BLDL LIST                             04950000
WKPREFX  DS    4C                 MASK FOR BLDL REQUEST                 05000000
WKPDSDE  DS    0CL72              BLDL DIR ENTRY                   @L5A 05050000
WKNAME   DS    8C                 THIS IS THE BASE                      05100000
WKTTRN   DS    4C                 AREA OF A                             05150000
WKZBYTE  DS    1C                 FORMAT 2 PDS                          05200000
WKCBYTE  DS    1C                 DIRECTORY ENTRY WITH                  05250000
WKTTESD  DS    8C                 2 BYTE MODIFIED                       05300000
WKATTR   DS    2C                 BY BLDL                               05350000
WKLNTH   DS    5C                       *                               05400000
WKENTPT  DS    3C                       *                               05450000
WKTXORG  DS    3C                       *                               05500000
WKAPFSSI DS    CL6                APF AND SSI INFO IF PRESENT           05550000
         ORG   WKAPFSSI           OVERLAY FOR ALISA, NO SCATTER         05600000
WKENTBK  DS    3C                 USED IF THE MODULE IS AN ALIAS        05650000
WKNAMBK  DS    8C                 AND HAS RENT OR REUS ATTRIBUTES       05700000
*                                 AND NO SCATTER                        05750000
         DS    CL6                APF AND SSI INFO IF PRESENT           05800000
         ORG   WKAPFSSI           * OVERLAY FOR WKENTBK                 05850000
WKSCATR  DS    8C                 USED FOR MODULES                      05900000
WKSCAPSI DS    CL6                APF AND SSI IF SCATTER ONLY           05950000
         ORG   WKSCAPSI           OVERLAY FOR SCATTER ALIAS             06000000
WKENTSC  DS    3C                 WHICH ARE SCATTER LOADED              06050000
WKNAMSC  DS    8C                 HAVE RENT OR REUS ATTRIBUTES          06100000
         DS    CL6                APF AND SSI INFO IF PRESENT           06150000
WKMAINEP DS    4C                 USED TO MAKE DSECT CONSISTANT         06200000
WKMAINAM DS    8C                 REGARDLESS OF ATTRIBUTES              06250000
         ORG   WKCNTNSV+L'WKCNTNSV                                      06300000
WKEND    EQU   *                  END OF BLDL FETCH WORK AREA           06350000
WKFTSIZE EQU   L'FETCHWA          SIZE OF FETCH'S PART                  06400000
WKCNSIZE EQU   L'WKCNTNSV         SIZE OF CONTENTS SUPV'S PART          06450000
WKSIZE   EQU   WKEND-FTWKAREA     SIZE OF WORK AREA                     06500000
         SPACE 2                                                        06550000
************ IEWFETCH RETURN CODES - RETURNED IN REG 15 **************  06600000
RCNORMAL EQU   0                  X'00' - NORMAL RETURN                 06650000
RCRELERR EQU   10                 X'0A' - RELOCATION ERR                06700000
RCPGMCK  EQU   11                 X'0B' - PROGRAM CHECK                 06750000
RCNOSTOR EQU   12                 X'0C' - NO STORAGE                    06800000
RCBADREC EQU   13                 X'0D' - BAD RECORD READ               06850000
RCBADADR EQU   14                 X'0E' - INVALID ADDRESS               06900000
RCIOERR  EQU   15                 X'0F' - PERMANENT I/O ERROR           06950000
************ IEWFETCH REASON CODES - RETURNED IN REG 0 ***************  07000000
*                            EXPLANATION OF RCNOSTOR:                   07050000
RSNDATD  EQU   4                  X'04' - NO STORAGE FOR DATD           07100000
RSNDEB   EQU   8                  X'08' - NO STORAGE FOR DEB            07150000
RSNIOSB  EQU   12                 X'0C' - NO STORAGE FOR IOSB           07200000
RSNEXTL  EQU   16                 X'10' - NO STORAGE FOR EXTLIST        07250000
RSNMOD   EQU   20                 X'14' - NO STORAGE FOR MODULE         07300000
RSNFIX   EQU   24                 X'18' - UNABLE TO FIX STORAGE         07350000
*                            EXPLANATION OF RCBADADR:                   07400000
RSNTTR   EQU   32                 X'20' - ERROR CONVERTING TTR          07450000
RSNBOM   EQU   36                 X'24' - BLOCK OUTSIDE OF MODULE       07500000
RSNADL   EQU   40                 X'28' - ADCON LOCATION INVALID        07550000
*                            EXPLANATION OF RCIOERR:                    07600000
RSNRDS   EQU   64                 X'40' - I/O ERROR ON A REAL DS        07650000
RSNVDS   EQU   68                 X'44' - I/O ERROR ON A VIRTUAL DS     07700000
RSNEXTV  EQU   72                 X'48' - SEEK ADDR OUTSIDE EXT         07750000
RSNPCI   EQU   76                 X'4C' - POSSIBLE PCI LOGIC ERROR      07800000
RSNPDSE  EQU   80                 X'50' - DATA SET IS A PDSE       @L5A 07850000
         MEND  ,                                                     */ 07900000
*%FETWK2:;                                                              07950000
*   %DEBUG='YES';                                                       08000000
*   %DEBUG='NO';                                                        08050000
*   %GOTO BYNOTE;                                                       08100000
*/********************************************************************/ 08150000
*/*                NOTE TO DEVELOPERS                                */ 08200000
*/* THE DEBUGGING CODE GENERATED WHEN %DEBUG='YES' MAKES COUNTS OF   */ 08250000
*/* THE VARIOUS PATHS THROUGH THE IEWFTDIE, THE DISABLED INTERRUPT   */ 08300000
*/* ROUTINE.  THE FORMAT OF THE STATISTICS CAN BE SEEN BELOW IN      */ 08350000
*/* $BUGAREA.  THE STATISTICS ARE RESET TO ZERO BY EXECUTING ANY     */ 08400000
*/* PROGRAM WITH THE FIRST TWO CHARS OF THE NAME = '$$'              */ 08450000
*/*                                                                  */ 08500000
*/****   WARNING -- DEBUGGING DATA OVERLAYS THE CVT PATCH AREA   *****/ 08550000
*/*                                                                  */ 08600000
*/********************************************************************/ 08650000
*%BYNOTE:;                                                              08700000
*   DCL                                                                 08750000
*     1 FTWKAREA CHAR(1540) BDY(DWORD) BASED(FTWKPTR),                  08800000
*      2 FETCHWA CHAR(1424) BDY(DWORD),                                 08850000
*       3 FTCLEAR CHAR(768) BDY(DWORD),/* AREA CLEARED TO HEX ZEROS  */ 08900000
*   %IF IHALIST~='YES' %THEN                                            08950000
*     %GOTO BYFETWK;                                                    09000000
*     /***************************************************************/ 09050000
*     /*                                                             */ 09100000
*     /* IOB USED FOR EXCP REQUESTS -- MAPPED BY IEZIOB              */ 09150000
*     /*                                                             */ 09200000
*     /***************************************************************/ 09250000
*         5 FTIOB CHAR(40) BDY(WORD),/* X'000'                       */ 09300000
*           7 * CHAR(32),                                               09350000
*           7 FTSEEKA CHAR(8),      /* X'020' SEEK ADDRESS -- NOTE      09400000
*                                      IOBSEEK IS DEFINED OVER THIS     09450000
*                                      FIELD                         */ 09500000
*             9 * CHAR(3),                                              09550000
*             9 IOBCCHHR CHAR(5),                                       09600000
*         5 FTKEY CHAR(4),          /* X'028' FETCH WORK AREA IDENT  */ 09650000
*           7 FTCODE FIXED(8),      /* RETURN CODE IS STORED HERE    */ 09700000
*     /***************************************************************/ 09750000
*     /*                                                             */ 09800000
*     /* FLAGS WHICH TELL WHO CALLED AND WHY                         */ 09850000
*     /*                                                             */ 09900000
*     /***************************************************************/ 09950000
*         5 FFLAGS CHAR(4),         /* CONTROL FLAGS                 */ 10000000
*           7 FFLAGB1 FIXED(8),     /* X'02C'                        */ 10050000
*             9 * BIT(5),                                               10100000
*             9 FFCNTNSV BIT(1),    /* B'.... .1..' CALLED BY THE       10150000
*                                      CONTENTS SUPERVISOR           */ 10200000
*             9 FFOVROOT BIT(1),    /* B'.... ..1.' CALLED BY THE       10250000
*                                      CONTENTS SUPERVISOR - TO LOAD    10300000
*                                      THE ROOT SEGMENT OF A PROGRAM    10350000
*                                      IN OVERLAY FORMAT             */ 10400000
*             9 FFOVLYSV BIT(1),    /* B'.... ...1' CALLED BY THE       10450000
*                                      OVERLAY SUPERVISOR -- TO LOAD    10500000
*                                      A SEGMENT OTHER THAN THE ROOT */ 10550000
*     /***************************************************************/ 10600000
*     /*                                                             */ 10650000
*     /* FLAGS WHICH TELL THE TYPE OF DATA SET BEING READ            */ 10700000
*     /*                                                             */ 10750000
*     /***************************************************************/ 10800000
*           7 FFLAGB2 FIXED(8),     /* X'02D'                        */ 10850000
*             9 FFUSRLIB BIT(1),    /* B'1... ....' DCB FOR USER LIB */ 10900000
*             9 FFJOBLIB BIT(1),    /* B'.1.. ....' DCB FOR JOB LIB  */ 10950000
*             9 FFSVCLIB BIT(1),    /* B'..1. ....' DCB FOR SVC LIB  */ 11000000
*             9 FFLNKLIB BIT(1),    /* B'...1 ....' DCB FOR LINK LIB */ 11050000
*             9 * BIT(2),                                               11100000
*             9 FFVDS BIT(1),       /* B'.... ..1.' VIRTUAL DATA SET */ 11150000
*             9 FFRDS BIT(1),       /* B'.... ...1' REAL DATA SET    */ 11200000
*     /***************************************************************/ 11250000
*     /*                                                             */ 11300000
*     /* FLAGS WHICH TELL WHAT'S GOING ON AT THIS TIME               */ 11350000
*     /*                                                             */ 11400000
*     /***************************************************************/ 11450000
*           7 FFLAGB3 FIXED(8),     /* X'02E'                        */ 11500000
*             9 FFOVBLKS BIT(1),    /* B'1... ....' THE NUMBER OF TEXT  11550000
*                                      BLOCKS IN AN OVERLAY SEGMENT IS  11600000
*                                      KNOWN TO BE GT ONE        @L3A*/ 11650000
*             9 FFRDNOTL BIT(1),    /* B'.1.. ....' READING NOTE LIST*/ 11700000
*             9 FFOVCTL BIT(1),     /* B'..1. ....' READING OVERLAY     11750000
*                                      CONTROL RECORD                */ 11800000
*             9 FFLASTXT BIT(1),    /* B'...1 ....' READING LAST BLOCK  11850000
*                                      OF TEXT (WHICH HAS NO RLDS)   */ 11900000
*             9 FFLSTRLD BIT(1),    /* B'.... 1...' READING LAST BLOCK  11950000
*                                      OF TEXT (WHICH HAS SOME RLDS) */ 12000000
*             9 FFRLD BIT(1),       /* B'.... .1..' THE NUMBER OF RLD   12050000
*                                      RECORDS IS KNOWN              */ 12100000
*             9 FFLOCK BIT(1),      /* B'.... ..1.' LOCAL LOCK HELD  */ 12150000
*             9 FFBLKFIX BIT(1),    /* B'.... ...1' STORAGE IS FIXED    12200000
*                                      FOR READING A BLOCK OF TEXT   */ 12250000
*           7 FFLAGB4 FIXED(8),     /* X'02F'                        */ 12300000
*             9 FFPCI BIT(1),       /* B'1... ....' THE CHANNEL PGM     12350000
*                                      IS UTILIZING PCI              */ 12400000
*             9 FFSILI BIT(1),      /* B'.1.. ....' THE SILI FLAG       12450000
*                                      SHOULD BE SET READ TEXT       */ 12500000
*             9 FFRLD256 BIT(1),    /* B'..1. ....' MODULE CONTAINS >   12550000
                                       255 RLDS AFTER SOME TEXT  @P1A*/ 12600000
              9 * BIT(1),           /*                           @P1C*/ 12650000
*             9 FFREREAD BIT(1),    /* B'.... 1...' IEWFETCH HAS BEEN   12700000
*                                      RESTARTED (THE WHOLE PROCESS     12750000
*                                      HAS STARTED OVER, AND ALL        12800000
*                                      RECORDS, TEXT AND RLDS, ARE      12850000
*                                      BEING READ ONE AT A TIME)     */ 12900000
*             9 FFRECURS BIT(1),    /* B'.... .1..' PROC IEWFTRDB HAS   12950000
*                                      BEEN ENTERED RECURSIVELY FROM    13000000
*                                      THE CHANNEL END APPENDAGE     */ 13050000
*             9 FFEORLD BIT(1),     /* B'.... ..1.' ALL RLDS (IF ANY)   13100000
*                                      FOR THIS BLOCK OF TEXT HAVE      13150000
*                                      BEEN READ AND PROCESSED       */ 13200000
*             9 FFENDED BIT(1),     /* B'.... ...1' ALL TEXT FOR THIS   13250000
*                                      MODULE (OR SEGMENT) HAS BEEN     13300000
*                                      READ AND ALL RLDS PROCESSED   */ 13350000
*     /***************************************************************/ 13400000
*     /*                                                             */ 13450000
*     /* FLAGS WHICH TELL WHAT HAPPENED IN THE DISABLED INTERRUPT    */ 13500000
*     /* EXIT ROUTINE.  ONE AND ONLY ONE OF THE BITS IN FFLAGB5 IS   */ 13550000
*     /* SET ON EACH TIME THE DIE IS EXECUTED.  THE BITS ARE TESTED  */ 13600000
*     /* IN THE CHANNEL END ROUTINE.                                 */ 13650000
*     /* THE BITS IN FFLAGB6 ARE SET AND TESTED IN THE CHANNEL END.  */ 13700000
*     /* BOTH BYTES ARE SET TO ZERO AT ENTRY TO THE DIE AND AT       */ 13750000
*     /* EXIT FROM THE CHANNEL END.                                  */ 13800000
*     /*                                                             */ 13850000
*     /***************************************************************/ 13900000
*         5 FFLAGPCI FIXED(15),     /* X'030' THESE BITS INDICATE WHAT  13950000
*                                      CONDITIONS WERE DETERMINED IN    14000000
*                                      THE DIE.                      */ 14050000
*           7 FFLAGB5 BIT(8),       /* X'030'                        */ 14100000
*             9 FPNONTIG BIT(1),    /* B'1... ....' THE NEXT BLOCK OF   14150000
*                                      TEXT IS NOT CONTIGUOUS IN        14200000
*                                      VIRTUAL STORAGE (IT CONTAINS     14250000
*                                      'DS.SPACE'                    */ 14300000
*             9 FPLASTXT BIT(1),    /* B'.1.. ....' THE LAST BLOCK OF   14350000
*                                      TEXT HAS BEEN READ (IT HAS NO    14400000
*                                      RLD RECORDS)                  */ 14450000
*             9 FPNORLDS BIT(1),    /* B'..1. ....' NO RLDS HAVE BEEN   14500000
*                                      READ FOR THIS TEXT BLOCK      */ 14550000
*             9 FPMORLDS BIT(1),    /* B'...1 ....' SOME RLDS FOR THIS  14600000
*                                      BLOCK HAVE BEEN READ, BUT THERE  14650000
*                                      ARE MORE, AND NO MORE BUFFERS    14700000
*                                      ARE AVAILABLE                 */ 14750000
*             9 FPLSTRLD BIT(1),    /* B'.... 1...' THE LAST BLOCK OF   14800000
*                                      TEXT AND ITS RLD RECORDS HAVE    14850000
*                                      BEEN READ                     */ 14900000
*             9 FPNOFIXD BIT(1),    /* B'.... .1..' NOT ENOUGH STORAGE  14950000
*                                      IS FIXED TO CONTINUE READING     15000000
*                                      TEXT                          */ 15050000
*             9 FPCIGO BIT(1),      /* B'.... ..1.' CONTINUE PCI --     15100000
*                                      READ THE NEXT TEXT BLOCK      */ 15150000
*             9 FPOVBLKS BIT(1),    /* B'.... ...1' THE COUNT OF TEXT   15200000
*                                      BLOCKS IN AN OVERLAY SEGMENT     15250000
*                                      HAS GONE TO ZERO          @L3A*/ 15300000
*           7 FFLAGB6 BIT(8),       /* X'031' PCI FLAG BYTE 2        */ 15350000
*             9 FPCIMISR BIT(1),    /* B'1... ....' THE DIE ROUTINE     15400000
*                                      WAS NOT EXECUTED SOON ENOUGH     15450000
*                                      TO MODIFY THE CHANNEL PROGRAM    15500000
*                                      TO READ THE RLD RECORDS       */ 15550000
*             9 FPCIEOM BIT(1),     /* B'.1.. ....' ALL OF THE TEXT     15600000
*                                      AND RLDS HAVE BEEN READ       */ 15650000
*             9 * BIT(6),           /* RESERVED                      */ 15700000
*         5 * BIT(8),               /* X'032' RESERVED               */ 15750000
*         5 FTSSTAT BIT(8),         /* X'033' SUBCHANNEL STATUS         15800000
*                                      (COPIED FROM IOSD)            */ 15850000
*           7 FTSSPCI BIT(1),       /* B'.... ....' PROGRAM-CONTROLLED  15900000
*                                      INTERRUPT                     */ 15950000
*     /***************************************************************/ 16000000
*     /*                                                             */ 16050000
*     /* ECBS USED BY FETCH                                          */ 16100000
*     /*                                                             */ 16150000
*     /***************************************************************/ 16200000
*         5 FTECB FIXED(31),        /* X'034' ECB FOR READING        */ 16250000
*           7 FTECBYT CHAR(1),                                          16300000
*             9 * BIT(5),                                               16350000
*             9 FTECPOST BIT(1),    /* ECB POSTED COMPLETE           */ 16400000
*             9 * BIT(2),                                               16450000
*         5 FTFXECB FIXED(31),      /* X'038' ECB FOR PGFIX REQUESTS */ 16500000
*           7 * CHAR(3),                                                16550000
*           7 * BIT(4),                                                 16600000
*           7 FTFXERR BIT(1),       /* ERROR IN PGFIX                */ 16650000
*           7 * BIT(3),                                                 16700000
*     /***************************************************************/ 16750000
*     /*                                                             */ 16800000
*     /* POINTERS AND FIXED VARIABLES                                */ 16850000
*     /*                                                             */ 16900000
*     /***************************************************************/ 16950000
*         5 ASCBPTR PTR(31),        /* X'03C' -> ADDR SPACE CTL BLK  */ 17000000
*         5 ASXBPTR PTR(31),        /* X'040' -> ADDR SPACE EXT BLK  */ 17050000
*         5 BLOCKCNT FIXED(31),     /* X'044' COUNT OF BLOCKS READ   */ 17100000
*         5 CDENTPTR PTR(31),       /* X'048' -> CONTENTS DIR ENTRY  */ 17150000
*         5 CONCATEX FIXED(31),     /* X'04C' EXTENT NUMBER OF          17200000
*                                      CONCATENATED DATA SET         */ 17250000
*         5 DCBPTR PTR(31),         /* X'050' -> DCB                 */ 17300000
*           6 DCBHIBYT FIXED(8),    /* HI BYTE IN DCB SHOULD BE 0    */ 17350000
*         5 DCONTIME FIXED(31),     /* X'054' DEVICE CONNECT TIME    */ 17400000
*         5 DEBEXPTR PTR(31),       /* X'058' -> DEB EXTENSION       */ 17450000
*         5 DEBPTR PTR(31),         /* X'05C' -> DATA EXTENT BLOCK   */ 17500000
*           6 DEBHIBYT FIXED(8),    /* HI BYTE IN DEB SHOULD BE 0    */ 17550000
*         5 DEBSBPTR PTR(31),       /* X'060' -> DEB                 */ 17600000
*         5 FTALT FIXED(31),        /* X'064' CONTAINS A VALUE WHICH    17650000
*                                      ALTERNATES BETWEEN 2 AND 1, AND  17700000
*                                      IS ALWAYS THE OPPOSITE OF FTCUR  17750000
*                                      (ACTIVE WITH PCI ONLY)        */ 17800000
*         5 FTBUFPTR PTR(31),       /* X'068' -> RLD BUFFER AREA     */ 17850000
*         5 FTBLKEND PTR(31),       /* X'06C' UPPER LIMIT OF BLOCK   */ 17900000
*         5 FTBLKLEN FIXED(31),     /* X'070' TEXT BLOCK LENGTH      */ 17950000
*         5 FTBLKPTR PTR(31),       /* X'074' LOWER LIMIT OF BLOCK   */ 18000000
*         5 FTCER14 PTR(31),        /* X'078' RET REG FOR SUBR       */ 18050000
*         5 FTCPSTOP PTR(31),       /* X'07C' -> CCW ON WHICH THE       18100000
*                                      CHANNEL PROGRAM IS PREDICTED     18150000
*                                      TO STOP (PCI ONLY)            */ 18200000
*         5 FTCURR FIXED(31),       /* X'080' CONTAINS A VALUE WHICH    18250000
*                                      ALTERNATES BETWEEN 1 AND 2 TO    18300000
*                                      INDICATE WHICH TEXT READ IS      18350000
*                                      ACTIVE (WITH PCI ONLY)        */ 18400000
*         5 * PTR(31),              /* X'084' -> RESERVED        @P2C*/ 18450000
*         5 FTDEBLEN FIXED(31),     /* X'088' LENGTH OF DEB          */ 18500000
*         5 * FIXED(31),            /* X'08C'                        */ 18550000
*         5 FTDTDLEN FIXED(31),     /* X'090' LENGTH OF FETCHS DATA  */ 18600000
*         5 FTDTDPTR PTR(31),       /* X'094' -> FETCHS DATA AREA    */ 18650000
*         5 FTFIXEND PTR(31),       /* X'098' -> END OF PGFIX AREA   */ 18700000
*         5 FTFIXPTR PTR(31),       /* X'09C' -> PGFIXED AREA        */ 18750000
*         5 FTIDANDX FIXED(31),     /* X'0A0' INDEX OF IDAL (FOR SET    18800000
*                                      1 OR SET 2 OF CCWS)           */ 18850000
*         5 FTIOSLEN FIXED(31),     /* X'0A4' LENGTH OF IOSB + SRB   */ 18900000
*         5 FTIOSPTR PTR(31),       /* X'0A8' -> IOSB AND SRB AREA   */ 18950000
*         5 FTLCCWP PTR(31),        /* X'0AC' -> LAST CCW TO BE         19000000
*                                      EXECUTED                      */ 19050000
*         5 FTLKR14 PTR(31),        /* X'0B0' RET REG-GET/FREELOCK   */ 19100000
*         5 FTMAXFIX FIXED(31),     /* X'0B4' MAXIMUM STORAGE WHICH     19150000
*                                      CAN BE FIXED AT ONE TIME      */ 19200000
*         5 FTMODEND PTR(31),       /* X'0B8' UPPER LIMIT OF MODULE  */ 19250000
*         5 FTMODLEN FIXED(31),     /* X'0BC' LENGTH OF MODULE       */ 19300000
*         5 FTNOTLEN FIXED(31),     /* X'0C0' LENGTH OF NOTE LIST    */ 19350000
*         5 FTORGDEB PTR(31),       /* X'0C4' -> ORIGINAL DEB        */ 19400000
*         5 FTPRGR PTR(31),         /* X'0C8' RETURN REG FOR IEWFTPRG*/ 19450000
*         5 FTRLDNXT FIXED(31),     /* X'0CC' NEXT CCW AND RLD BUFFER   19500000
*                                      TO BE UTILIZED BY THE CHANNEL    19550000
*                                      PROGRAM                       */ 19600000
*         5 FTRLDLST FIXED(31),     /* X'0D0' LAST RLD CCW AND RLD      19650000
*                                      BUFFER ASSIGNED               */ 19700000
*         5 FTRLDNOW FIXED(31),     /* X'0D4' NUMBER OF RLD RECORDS TO  19750000
*                                      FOR THIS READ OR RESTART      */ 19800000
*         5 FTRLDREM FIXED(31),     /* X'0D8' NUMBER OF RLD RECORDS     19850000
*                                      TO BE READ AFTER THIS READ    */ 19900000
*         5 FTRLDREL FIXED(31),     /* X'0DC' NUMBER OF RLD RECORDS TO  19950000
*                                      BE RELOCATED AT THIS TIME     */ 20000000
*         5 FTRETCDC FIXED(31),     /* X'0E0' RETURN CODE FOR IEWFTCE*/ 20050000
*         5 FTSDWR13 PTR(31),       /* X'0E4' RTM SAVE AREA FOR         20100000
*                                      IEWFTSTA (ESTAE ROUTINE)      */ 20150000
*         5 FTSRBR PTR(31),         /* X'0E8' RETURN REG FOR IEWFTSRB*/ 20200000
*         5 FTSR13 PTR(31),         /* X'0EC' SAVE REG 13 FOR IEWFTCE*/ 20250000
*         5 FTSR14A PTR(31),        /* X'0F0' RET REG FOR SUBR       */ 20300000
*         5 FTSR14B PTR(31),        /* X'0F4' RET REG FOR SUBR       */ 20350000
*         5 FTSR14C PTR(31),        /* X'0F8' RET REG FOR SUBR       */ 20400000
*         5 FTSUBR PTR(31),         /* X'0FC' RET REG FOR SUBROUTINES*/ 20450000
*         5 FTTCBPTR PTR(31),       /* X'100' -> CURRENT TCB         */ 20500000
*         5 FTRBASES CHAR(8) BDY(WORD),/* FETCH'S BASE ADDRS         */ 20550000
*           7 FTRBASE1 PTR(31),     /* X'104' -> FETCH BASE1 ADR     */ 20600000
*           7 FTRBASE2 PTR(31),     /* X'108' -> FETCH BASE2 ADR     */ 20650000
*         5 FTABASES CHAR(8) BDY(WORD),/* APPENDAGE BASE ADDRS       */ 20700000
*           7 FTABASE1 PTR(31),     /* X'10C' -> FETAP BASE1 ADR     */ 20750000
*           7 FTABASE2 PTR(31),     /* X'110' -> FETAP BASE2 ADR     */ 20800000
*         5 FTXTNLEN FIXED(31),     /* X'114' LG OF EXT/NOTE LIST    */ 20850000
*         5 IOBPRPTR PTR(31),       /* X'118' -> PREFIX OF IOB       */ 20900000
*         5 IOBSTPTR PTR(31),       /* X'11C' -> IOB                 */ 20950000
*         5 IOCOMPTR PTR(31),       /* X'120' -> IOCOM               */ 21000000
*         5 IOSBPTR PTR(31),        /* X'124' -> IOSB                */ 21050000
*         5 IPIBPTR PTR(31),        /* X'128' -> IPIB                */ 21100000
*         5 JSCBPTR PTR(31),        /* X'12C' -> JOB STEP CTL BLOCK  */ 21150000
*         5 LLTAPTR PTR(31),        /* X'130' -> LNKLST TABLE    @L1A*/ 21200000
*         5 NOTELPTR PTR(31),       /* X'134' -> NOTELIST            */ 21250000
*         5 PDSPTRV PTR(31),        /* X'138' -> PDS                 */ 21300000
*         5 PDS2PTR PTR(31),        /* X'13C' -> PDS                 */ 21350000
*         5 PPFIXEND FIXED(31),     /* X'140' TEMP' -> PREVIOUS END OF  21400000
*                                      PGFIXED STORAGE               */ 21450000
*         5 RBPTR PTR(31),          /* X'144' -> REQUEST BLOCK       */ 21500000
*         5 RBSECPTR PTR(31),       /* X'148' -> RB SECTOR           */ 21550000
*         5 RLDEPTR PTR(31),        /* X'14C' -> END OF RLD DATA     */ 21600000
*         5 RLDPTR PTR(31),         /* X'150' -> RLD RECORDS         */ 21650000
*         5 SDWAPTR PTR(31),        /* X'154' -> SYS DIAG WORK AREA  */ 21700000
*         5 SRBPTR PTR(31),         /* X'158' -> SRB                 */ 21750000
*         5 TCBPTR PTR(31),         /* X'15C' -> TCB                 */ 21800000
*         5 TIOTPTR PTR(31),        /* X'160' -> TASK I/O TABLE  @L1A*/ 21850000
*         5 TEMPR1 PTR(31),         /* X'164' SAVE AREA FOR REG 1    */ 21900000
*         5 TTBLKEND FIXED(31),     /* X'168' TEMP -> END OF BLOCK   */ 21950000
*         5 TTBLKLEN FIXED(31),     /* X'16C' TEMP LENGTH OF BLOCK   */ 22000000
*         5 TTBLKPTR PTR(31),       /* X'170' TEMP -> TEXT BLOCK     */ 22050000
*         5 TTFIXEND PTR(31),       /* X'174' TEMP' -> END OF PGFIX     22100000
*                                      AREA                          */ 22150000
*         5 TTFIXPTR PTR(31),       /* X'178' TEMP' -> PGFIX AREA    */ 22200000
*         5 TTNRLD FIXED(31),       /* X'17C' TEMPORARY NUMBER OF RLDS  22250000
*                                      WHICH FOLLOW THE TEXT BLOCK   */ 22300000
*           7 FTNRLD FIXED(31),     /* X'17C' DURING REREAD, NUMBER OF  22350000
*                                      RLDS FOLLOWING CURR TEXT  @P1A*/ 22400000
*         5 UCBPTR PTR(31),         /* X'180' -> UCB                 */ 22450000
*         5 VDSWICB PTR(31),        /* X'184' -> WINDOW INTERCEPT BLK*/ 22500000
*         5 VOIDPTR PTR(31),        /* X'188' -> VECTOR OF I/O DRIVER*/ 22550000
*         5 ESTAELST CHAR(24) BDY(WORD),/* X'18C' ESTAE MACRO WKAREA */ 22600000
*         5 FTDCBDEB PTR(31),       /* X'1A4' --- PSEUDO DCBDEBAD ---*/ 22650000
*         5 TEMPTTRN BDY(WORD),     /* X'1A8' TEMP RELATIVE TRACK NO */ 22700000
*           7 TEMPTTR CHAR(3),      /* RELATIVE TRACK AND RECORD NO. */ 22750000
*           7 TEMPCATN FIXED(8),    /* CONCATENATION NUMBER          */ 22800000
*         5 GFPARMS,                /* X'1AC' PARMS FOR GETFREE      */ 22850000
*           7 FRPTR PTR(31),        /* X'1B0' -> STORAGE TO BE FREED */ 22900000
*           7 GLENG FIXED(31),      /* X'1B4' LENGTH TO GET OR FREE  */ 22950000
*           7 GFOPER CHAR(1),       /* OPERATION G-GET OR F-FREE     */ 23000000
*           7 GFSUBP FIXED(8),      /* SUBPOOL NUMBER                */ 23050000
*           7 GBNDRY CHAR(1),       /* BOUNDRY D-DWORD OR P-PAGE     */ 23100000
*           7 GLOC CHAR(1),         /* LOCATION B-BELOW OR A ANYWHERE*/ 23150000
*         5 FTSECTOR CHAR(1),       /* X'1B8' SECTOR NUMBER          */ 23200000
*         5 FTMSAVE CHAR(1),        /* X'1B9' EXTENT NUMBER      @01A*/ 23250000
*         5 FTSIO CHAR(1),          /* X'1BA' IEWFETCH SIO FLAG  @02C*/ 23300000
*         5 WKCANCEL FIXED(8),      /* X'1BB' CANCEL I/O SET BY         23350000
*                                      CSVARMGR                  @02A*/ 23400000
*         5 FTSR14RL PTR(31),       /* X'1BC' RET REG FOR RELOC      */ 23500000
*         5 FTOVBLKS FIXED(31),     /* X'1C0' NUMBER OF TEXT BLOCKS     23550000
*                                      STILL TO BE READ FOR AN          23600000
*                                      OVERLAY SEGMENT           @L3A*/ 23650000
*         5 FTCSWCA PTR(31),        /* X'1C4' -> LAST CCW EXEC   @L4A*/ 23700000
*         5 FTRESERV CHAR(308),     /* X'1C8' RESERVED           @L4C*/ 23750000
*/* * * * *       X'300' END OF AREA CLEARED TO ZERO       * * * * * */ 23800000
*     /***************************************************************/ 23850000
*     /*                                                             */ 23900000
*     /* REGISTER SAVE AREAS                                         */ 23950000
*     /*                                                             */ 24000000
*     /***************************************************************/ 24050000
*       3 FTDATDGM FIXED(31),       /* X'300' AREA GOTTEN FOR DATD   */ 24100000
*       3 XTLSTPTR PTR(31),         /* X'304' -> EXTENT LIST         */ 24150000
*/*  GENERAL REGISTER SAVE AREA                                      */ 24200000
*       3 FTREGSA CHAR(72) BDY(WORD),/* X'308'                       */ 24250000
*/*                                                             @XXD6*/ 24300000
*/*  APPENDAGE REGISTER SAVE AREA                                    */ 24350000
*       3 FTAPPRS CHAR(72) BDY(WORD),/* X'350'                       */ 24400000
*         5 FTAPPR0 FIXED(31),      /* X'350'                        */ 24450000
*         5 FTAPPR1 FIXED(31),      /* X'354'                        */ 24500000
*         5 *(12) FIXED(31),                                            24550000
*         5 FTAPPR14 FIXED(31),     /* X'388'                        */ 24600000
*         5 FTAPPR15 FIXED(31),     /* X'38C'                        */ 24650000
*/*  SUBROUTINE REGISTER SAVE AREA                                   */ 24700000
*       3 FTSTREG CHAR(72) BDY(WORD),/* X'398'                       */ 24750000
*         5 * FIXED(31),                                                24800000
*         5 FTSTREG1 FIXED(31),     /* X'39C'                        */ 24850000
*         5 FTSTREG2 FIXED(31),     /* X'3A0'                        */ 24900000
*         5 *(12) FIXED(31),                                            24950000
*         5 FTSTR15 FIXED(31),      /* X'3D4'                        */ 25000000
*           7 * CHAR(3),                                                25050000
*           7 FTSTRC FIXED(8),      /* X'3D7' RETURN CODE FOR GETFREE*/ 25100000
*/*  CALLER'S REGISTER SAVE AREA                                     */ 25150000
*       3 FTCALRS CHAR(72) BDY(WORD),/* X'3E0'                       */ 25200000
*         5 FTCALR0 FIXED(31),      /* X'3E0'                        */ 25250000
*           7 * CHAR(3),                                                25300000
*           7 FTRSNCD FIXED(8),     /* X'3E3' REASON CODE (QUALIFIES    25350000
*                                      RETURN CODE (FTRETCD))        */ 25400000
*         5 FTCALR1 FIXED(31),      /* X'3E4'                        */ 25450000
*         5 FTCALR2 FIXED(31),      /* X'3E8'                        */ 25500000
*         5 FTCALR3 FIXED(31),      /* X'3EC'                        */ 25550000
*         5 FTCALR4 FIXED(31),      /* X'3F0'                        */ 25600000
*         5 FTCALR5 FIXED(31),      /* X'3F4'                        */ 25650000
*         5 FTCALR6 FIXED(31),      /* X'3F8'                        */ 25700000
*         5 FTCALR7 FIXED(31),      /* X'3FC'                        */ 25750000
*         5 FTCALR8 FIXED(31),      /* X'400'                        */ 25800000
*           7 * CHAR(1),                                                25850000
*           7 FTNLPTR PTR(24) BDY(BYTE),/* NOTELIST POINTER          */ 25900000
*         5 FTCALR9 FIXED(31),      /* X'404'                        */ 25950000
*         5 FTCALR10 FIXED(31),     /* X'408'                        */ 26000000
*           7 * CHAR(3),                                                26050000
*           7 FTUSERSP FIXED(8),    /* X'40B' USER SUBPOOL ID        */ 26100000
*         5 FTCALR11 FIXED(31),     /* X'40C'                        */ 26150000
*         5 FTCALR12 FIXED(31),     /* X'410'                        */ 26200000
*           7 FTMODPTR PTR(31),     /* X'410' LOWER LIMIT OF MODULE     26250000
*                                      -- ALSO THE RELOCATION FACTOR */ 26300000
*         5 FTCALR13 FIXED(31),     /* X'414'                        */ 26350000
*         5 FTCALR14 FIXED(31),     /* X'418'                        */ 26400000
*         5 FTCALR15 FIXED(31),     /* X'41C'                        */ 26450000
*           7 * CHAR(3),                                                26500000
*           7 FTRETCD FIXED(8),     /* X'41F' RETURN CODE            */ 26550000
*/*                                                             @XXD2*/ 26600000
*       3 FTREGRES CHAR(032),       /* X'428' RESERVED               */ 26650000
*     /***************************************************************/ 26700000
*     /*                                                             */ 26750000
*     /* THE FOLLOWING 'PERMANENT' FLAGS ARE CLEARED TO ZERO WHEN    */ 26800000
*     /* IEWFETCH IS FIRST ENTERED, BUT NOT WHEN A BRANCH TO         */ 26850000
*     /* 'INITFWA' IS TAKEN                                          */ 26900000
*     /*                                                             */ 26950000
*     /***************************************************************/ 27000000
*       3 PPFLAGS FIXED(31),        /* X'448'                        */ 27050000
*         5 PPFLAG1 FIXED(8),       /* X'448'                        */ 27100000
*           7 * BIT(5),             /*                               */ 27150000
*           7 PPREREAD BIT(1),      /* B'.... .1..' THE MODULE IS       27200000
*                                      BEING READ A SECOND TIME      */ 27250000
*         5 PPRETCD FIXED(8),       /* ORIGINAL ERROR CODE, WHEN A      27300000
*                                      REREAD IS ATTEMPTED           */ 27350000
*         5 * CHAR(2),              /* X'44A'                        */ 27400000
*%BYFETWK:;                                                             27450000
*     /***************************************************************/ 27500000
*     /*                                                             */ 27550000
*     /* CONTENTS SUPERVISOR'S WORK AREA                             */ 27600000
*     /*                                                             */ 27650000
*     /***************************************************************/ 27700000
*      2 WKCNTNSV CHAR(116) BDY(WORD),                                  27750000
*       3 WKDEBPTR PTR(31),         /* X'590' ADDRESS OF THE DEB IF     27800000
*                                      VERIFIED BY CONTENTS MANAGER,    27850000
*                                      IF WKDEBOK IS ZERO, THIS FIELD   27900000
*                                      IS IGNORED                    */ 27950000
*       3 WKCDADDR PTR(31),         /* X'594' ADDRESS OF CDE         */ 28000000
*       3 WKIOADDR PTR(31),         /* X'598' ADDRESS OF AREA           28050000
*                                      GETMAINED. FETCH WILL DO I/O     28100000
*                                      IN THIS AREA                  */ 28150000
*       3 WKFLAG BIT(8),            /* X'59C' TASKLIB SEARCH IND     */ 28200000
*       3 WKFLG1 BIT(8),            /* X'59D'                        */ 28250000
*         5 WKAUTH BIT(1),          /* MODULE IN AUTHORIZED LIBRARY  */ 28300000
*         5 WKSYSREQ BIT(1),        /* THIS IS A SYSTEM REQUEST      */ 28350000
*         5 WKSYSDCB BIT(1),        /* SYSTEMDCB REQUEST         @L6A*/ 28400000
*         5 * BIT(5),                                                   28450000
*       3 WKFLG2 BIT(8),            /* X'59E' FLAG BYTE 3            */ 28500000
*         5 WKDEBOK BIT(1),         /* THE DEB HAS BEEN VERIFIED BY     28550000
*                                      THE CALLING PROGRAM           */ 28600000
*         5 * BIT(3),                                                   28650000
*         5 WKUSRLIB BIT(1),        /* DCB IS FOR A USER LIBRARY     */ 28700000
*         5 WKJOBLIB BIT(1),        /* DCB IS FOR THE JOB LIBRARY    */ 28750000
*         5 WKSVCLIB BIT(1),        /* DCB IS FOR THE SVC LIBRARY    */ 28800000
*         5 WKLNKLIB BIT(1),        /* DCB IS FOR THE LINK LIBRARY   */ 28850000
*       3 WKFLG3 BIT(8),            /* X'59F'                        */ 28900000
*       3 WKREGIS(4) FIXED(31),     /* X'5A0' USED TO SAVE REGS         28950000
*                                      ACROSS BLDL                   */ 29000000
*       3 WKTCBSE PTR,              /* X'5B0' ADDRESS OF TCB            29050000
*                                      CONTAINING LAST DCB           */ 29100000
*       3 WKDCBSE PTR,              /* X'5B4' ADDRESS OF LAST DCB       29150000
*                                      SEARCH ARGUMENT               */ 29200000
*     /***************************************************************/ 29250000
*     /*                                                             */ 29300000
*     /* BLDL ENTRY                                                  */ 29350000
*     /*                                                             */ 29400000
*     /***************************************************************/ 29450000
*       3 WKBLDE,                   /* X'5B8'                        */ 29500000
*        4 WKPREFX FIXED(31),       /* X'5B8' BLDL PREFIX        @L5C*/ 29550000
*        4 WKPDSDE CHAR(72),        /* X'5BC' BLDL DIR ENTRY     @L5A*/ 29600000
*     /***************************************************************/ 29650000
*     /*                                                             */ 29700000
*     /* NOTE THAT THE FOLLOWING AREA IS ALSO MAPPED BY IHAPDS (PDS  */ 29750000
*     /* DIRECTORY ENTRY) IN IEWFETCH (THE FETCH PROGRAM), BUT THAT  */ 29800000
*     /* THERE ARE MINOR DIFFERENCES IN BLDL AND PDS DEFINITIONS     */ 29850000
*     /*                                                             */ 29900000
*     /***************************************************************/ 29950000
*         5 WKNAME CHAR(8),         /* X'5BC' MODULE NAME            */ 30000000
*         5 WKTTRK CHAR(4),         /* X'5C4' TRACK AND RECORD NUMBER*/ 30050000
*           7 WKTT FIXED(16) BDY(BYTE),/* X'5C4' /TRACK NUMBER       */ 30100000
*           7 WKR FIXED(8),         /* X'5C6' RECORD NUMBER          */ 30150000
*           7 WKK FIXED(8),         /* NO. OF CONCATENATED DATA SETS */ 30200000
*         5 WKZBYTE BIT(8),         /* X'5C8' 'Z' BYTE               */ 30250000
*         5 WKCBYTE BIT(8),         /* X'5C9' 'C' BYTE               */ 30300000
*         5 WKTTESD CHAR(8),        /* X'5CA'                        */ 30350000
*         5 WKATTR BIT(16),         /* X'5D2' ATTRIBUTE FLAGS        */ 30400000
*         5 WKLNTH,                 /*                               */ 30450000
*           7 WKLNTHM FIXED(24) BDY(BYTE),/* X'5D4' LENG OF MODULE   */ 30500000
*           7 WKLNTHF FIXED(15) BDY(BYTE),/* X'5D7' LENGTH OF FIRST     30550000
*                                      TEXT RECORD                   */ 30600000
*         5 WKENTPT PTR(24) BDY(BYTE),/* X'5D9' ENTRY POINT ADDRESS  */ 30650000
*         5 WKTXTRG PTR(24) BDY(BYTE),/* X'5DC' TEXT ORIGIN ADDRESS  */ 30700000
*         5 WKAPFSSI CHAR(37),      /* X'5DF' APF AND SSI FIELDS     */ 30750000
*      2 WKEND CHAR(0);             /* X'604' END OF FETCH WORK AREA    30800000
                                                                 @L5C*/ 30850000
*/* DEFINE ENTRIES FOR ALIAS, NO SCATTER                             */ 30900000
*   DCL                                                                 30950000
*     1 WKALIAS DEFINED(WKAPFSSI),  /* X'5DF'                        */ 31000000
*       3 WKENTBK CHAR(3),          /* X'5DF'                        */ 31050000
*       3 WKNAMBK CHAR(8);          /* X'5E2'                        */ 31100000
*/* DEFINE ENTRIES FOR SCATTER ONLY                                  */ 31150000
*   DCL                                                                 31200000
*     1 WKSCATER DEFINED(WKAPFSSI) BDY(BYTE),/* X'5DF'               */ 31250000
*       3 WKSCATR CHAR(8),          /* X'5DF'                        */ 31300000
*/* DEFINE ENTRIES FOR SCATTER, ALIAS                                */ 31350000
*       3 WKENTSC PTR(24) BDY(BYTE),/* X'5E7'                        */ 31400000
*       3 WKNAMSC CHAR(8),          /* X'5EA'                        */ 31450000
*       3 * CHAR(6),                                                    31500000
*       3 WKMAINEP PTR(31),         /* X'5F8'                        */ 31550000
*       3 WKMAINAM CHAR(8);         /* X'5FC'                        */ 31600000
*   /*****************************************************************/ 31650000
*   /*                                                               */ 31700000
*   /* RETURN CODES FROM IEWFETCH, PASSED TO CALLER IN REG 15        */ 31750000
*   /*                                                               */ 31800000
*   /*****************************************************************/ 31850000
*     DCL                                                               31900000
*       RCNORMAL FIXED(8) CONSTANT(0),/* X'00' - NORMAL RETURN       */ 31950000
*       RCLRAERR FIXED(8) CONSTANT(10),/* X'0A' - LRA FAILURE    @02C*/ 32000000
*       RCPGMCK FIXED(8) CONSTANT(11),/* X'0B' - PROGRAM CHECK       */ 32050000
*       RCNOSTOR FIXED(8) CONSTANT(12),/* X'0C' - NO STORAGE         */ 32100000
*       RCBADREC FIXED(8) CONSTANT(13),/* X'0D' - BAD RECORD READ    */ 32150000
*       RCBADADR FIXED(8) CONSTANT(14),/* X'0E' - INVALID ADDRESS    */ 32200000
*       RCIOERR FIXED(8) CONSTANT(15),/* X'0F' - PERMANENT I/O ERROR */ 32250000
*     /***************************************************************/ 32300000
*     /*                                                             */ 32350000
*     /* REASON CODES FOR LRA FAILURES                               */ 32400000
*     /*                                                             */ 32450000
*     /***************************************************************/ 32500000
*/*                 EXPLANATION OF RCLRAERR:                         */ 32550000
*       RCLRA01 FIXED(8) CONSTANT(1),   /* X'01'                @02A*/  32600000
*       RCLRA02 FIXED(8) CONSTANT(2),   /* X'02'                @02A*/  32650000
*       RCLRA03 FIXED(8) CONSTANT(3),   /* X'03'                @02A*/  32700000
*       RCLRA04 FIXED(8) CONSTANT(4),   /* X'04'                @02A*/  32750000
*       RCLRA05 FIXED(8) CONSTANT(5),   /* X'05'                @02A*/  32800000
*       RCLRA06 FIXED(8) CONSTANT(6),   /* X'06'                @02A*/  32850000
*       RCLRA07 FIXED(8) CONSTANT(7),   /* X'07'                @02A*/  32900000
*       RCLRA08 FIXED(8) CONSTANT(8),   /* X'08'                @02A*/  32950000
*       RCLRA09 FIXED(8) CONSTANT(9),   /* X'09'                @02A*/  33000000
*       RCLRA10 FIXED(8) CONSTANT(10),  /* X'0A'                @02A*/  33050000
*       RCLRA11 FIXED(8) CONSTANT(11),  /* X'0B'                @02A*/  33100000
*       RCLRA12 FIXED(8) CONSTANT(12),  /* X'0C'                @02A*/  33150000
*       RCLRA13 FIXED(8) CONSTANT(13),  /* X'0D'                @02A*/  33200000
*       RCLRA14 FIXED(8) CONSTANT(14),  /* X'0E'                @02A*/  33250000
*       RCLRA15 FIXED(8) CONSTANT(15),  /* X'0F'                @02A*/  33300000
*       RCLRA16 FIXED(8) CONSTANT(16),  /* X'10'                @02A*/  33350000
*       RCLRA17 FIXED(8) CONSTANT(17),  /* X'11'                @02A*/  33400000
*       RCLRA18 FIXED(8) CONSTANT(18),  /* X'12'                @02A*/  33450000
*       RCLRA19 FIXED(8) CONSTANT(19),  /* X'13'                @02A*/  33500000
*       RCLRA20 FIXED(8) CONSTANT(20),  /* X'14'                @02A*/  33550000
*       RCLRA21 FIXED(8) CONSTANT(21),  /* X'15'                @02A*/  33600000
*     /***************************************************************/ 33650000
*     /*                                                             */ 33700000
*     /* REASON CODES FROM IEWFETCH, PASSED TO CALLER IN REG 0       */ 33750000
*     /*                                                             */ 33800000
*     /***************************************************************/ 33850000
*/*                 EXPLANATION OF RCNOSTOR:                         */ 33900000
*       RSNDATD FIXED(8) CONSTANT(4),/* X'04' - NO STORAGE FOR DATD  */ 33950000
*       RSNDEB FIXED(8) CONSTANT(8),/* X'08' - NO STORAGE FOR DEB    */ 34000000
*       RSNIOSB FIXED(8) CONSTANT(12),/* X'0C' - NO STORAGE FOR IOSB */ 34050000
*       RSNEXTL FIXED(8) CONSTANT(16),/* X'10' - NO STORAGE FOR         34100000
*                                                   EXTLIST          */ 34150000
*       RSNMOD FIXED(8) CONSTANT(20),/* X'14' - NO STORAGE FOR MODULE*/ 34200000
*       RSNFIX FIXED(8) CONSTANT(24),/* X'18' - UNABLE TO FIX STORAGE*/ 34250000
*/*                 EXPLANATION OF RCBADADR:                         */ 34300000
*       RSNTTR FIXED(8) CONSTANT(32),/* X'20' - ERROR CONVERTING TTR */ 34350000
*       RSNBOM FIXED(8) CONSTANT(36),/* X'24' - BLOCK OUTSIDE MODULE */ 34400000
*       RSNADL FIXED(8) CONSTANT(40),/* X'28' - ADCON LOCATION          34450000
*                                      INVALID                       */ 34500000
*/*                 EXPLANATION OF RCIOERR::                         */ 34550000
*       RSNRDS FIXED(8) CONSTANT(64),/* X'40' - I/O ERROR ON A RDS   */ 34600000
*       RSNVDS FIXED(8) CONSTANT(68),/* X'44' - ERROR ON A VIRTUAL DS*/ 34650000
*       RSNEXTV FIXED(8) CONSTANT(72),/* X'48' - SEEK ADDR OUTSIDE      34700000
*                                      EXTENT                        */ 34750000
*       RSNPCI FIXED(8) CONSTANT(76),/* X'4C' - POSSIBLE PCI LOGIC      34800000
*                                      ERROR                         */ 34850000
*       RSNPDSE FIXED(8) CONSTANT(80);/* X'50' - DATA SET IS A PDSE     34900000
                                                                 @L5A*/ 34950000
*   %IF IHALIST~='YES' %THEN                                            35000000
*     %GOTO BYFETCH;                                                    35050000
*@EJECT;                                                                35100000
*   GEN(TITLE 'IEWFETCH - REGISTER AND DATA DEFINITIONS            ');  35150000
*   /*****************************************************************/ 35200000
*   /*                                                               */ 35250000
*   /* DECLARE REGISTERS                                             */ 35300000
*   /*                                                               */ 35350000
*   /*****************************************************************/ 35400000
*   DCL                                                                 35450000
*     R0 REG(0) RSTD,                                                   35500000
*     R1 REG(1) RSTD,                                                   35550000
*     P1 PTR REG(1),                                                    35600000
*     DSABPTR PTR(31) REG(1),       /* -> DSAB POINTER (NOT USED)    */ 35650000
*     R2 REG(2) RSTD,                                                   35700000
*     P2 PTR REG(2),                                                    35750000
*     R3 REG(3),                                                        35800000
*     P3 PTR REG(3),                                                    35850000
*     R4 REG(4),                                                        35900000
*     P4 PTR REG(4),                                                    35950000
*     R5 REG(5),                                                        36000000
*     R6 REG(6),                                                        36050000
*     FTWKPTR PTR REG(6) RSTD,      /* -> FETCH WORK AREA            */ 36100000
*     R7 REG(7),                                                        36150000
*     RDATD REG(7) RSTD,            /* BASE REGISTER FOR DATA        */ 36200000
*     R8 REG(8),                                                        36250000
*     RBASE REG(8) RSTD,            /* BASE REGISTER FOR CODE        */ 36300000
*     R9 REG(9),                                                        36350000
*     RBASE2 REG(9) RSTD,           /* SECOND BASE REG FOR CODE      */ 36400000
*     R10 REG(10),                                                      36450000
*     R11 REG(11),                                                      36500000
*     R12 REG(12),                                                      36550000
*     P12 PTR REG(12),              /*                               */ 36600000
*     RTDATD REG(12),               /* TEMP REGISTER FOR DATA        */ 36650000
*     R13 REG(13) RSTD,                                                 36700000
*     P13 PTR REG(13),                                                  36750000
*     R14 REG(14),                                                      36800000
*     R15 REG(15);                                                      36850000
*@EJECT ASM;                                                            36900000
*   /*****************************************************************/ 36950000
*   /*                                                               */ 37000000
*   /* DECLARE CONSTANTS AND VARIABLES                               */ 37050000
*   /*                                                               */ 37100000
*   /*****************************************************************/ 37150000
*   DCL                                                                 37200000
*     K0 FIXED CONSTANT(0),                                             37250000
*     K1 FIXED CONSTANT(1),                                             37300000
*     K2 FIXED CONSTANT(2),                                             37350000
*     K3 FIXED CONSTANT(3),                                             37400000
*     K4 FIXED CONSTANT(4),                                             37450000
*     K6 FIXED CONSTANT(6),                                             37500000
*     K8 FIXED CONSTANT(8),                                             37550000
*     GOODLRA FIXED CONSTANT(8),    /* CONDITION CODE FOR LRA    @02A*/ 37600000
*     K11 FIXED CONSTANT(11),                                           37650000
*     K12 FIXED CONSTANT(12),                                           37700000
*     K14 FIXED CONSTANT(14),                                           37750000
*     K16 FIXED CONSTANT(16),                                           37800000
*     K255 FIXED CONSTANT(255),                                         37850000
*     DDOFFSET FIXED CONSTANT(44),  /* X'2C' OFFSET OF THE DEB          37900000
*                                      ADDRESS IN THE DCB            */ 37950000
*     EXTSCALE FIXED(8) CONSTANT(4),/* X'04' EXTENT SCALE FOR DASD   */ 38000000
*     FOURK FIXED CONSTANT(4096),                                       38050000
*     K32760 FIXED CONSTANT(32760), /* 32K-8 (MAX BSAM BLK SIZE) @L2C*/ 38100000
*     FOURZB BIT(4) CONSTANT('0000'B),/* FOUR ZERO BITS              */ 38150000
*     KEYZERO FIXED(8) CONSTANT(15),/* X'0F' MASK FOR DEB KEYZERO    */ 38200000
*     KFTWA CHAR(4) CONSTANT('FTWA'),/* STORAGE IDENT KEY            */ 38250000
*     MAXIDAL FIXED CONSTANT(36),   /* MAXIMUM NUMBER OF INDIRECT       38300000
*                                      ADDRESS WORDS             @P2C*/ 38350000
*     IDALTWO FIXED CONSTANT(MAXIDAL/2+1),/* INDEX TO THE THE SECOND    38400000
*                                      HALF OF THE IDAL LIST         */ 38450000
*     RLDPAGES FIXED CONSTANT(3),   /* NUMBER OF PAGES OF STORAGE       38500000
*                                      FOR RLD BUFFERS               */ 38550000
*     RLDPPAGE FIXED CONSTANT(16),  /* NUMBER OF RLD BUFFERS PER PAGE*/ 38600000
*     MAXRRLD FIXED CONSTANT(RLDPAGES*RLDPPAGE), /* MAXIMUM NUMBER      38650000
*                                      OF RLD/CTL RECORDS READ INTO     38700000
*                                      STORAGE AT ONE TIME.          */ 38750000
*     OFF BIT CONSTANT('0'B),       /* TEST OR SET BIT FLAG OFF      */ 38800000
*     ON BIT CONSTANT('1'B),        /* TEST OR SET BIT FLAG ON       */ 38850000
*     BUFBDY FIXED(31) CONSTANT(-256),/* X'FFFFFF00' FOR AND'ING        38900000
*                                      DOWN TO A 256 BYTE BOUNDARY   */ 38950000
*     PAGEBDY FIXED(31) CONSTANT(-4096),/* X'FFFFF000' FOR AND'ING      39000000
*                                      DOWN TO A 4K PAGE BOUNDRY     */ 39050000
*     PAGELIM FIXED(31) CONSTANT(4095),/* X'00000FFF' FOR OR'ING UP     39100000
*                                      TO A 4K PAGE LIMIT            */ 39150000
*     RCRSTRT FIXED(8) CONSTANT(8), /* RETURN (FROM CHANNEL END) TO     39200000
*                                      RESTART THE CHANNEL PROGRAM   */ 39250000
*     RLDLMASK FIXED(8) CONSTANT(12),/* '00001100'B MASK FOR RLD LEN */ 39300000
*     SP230 FIXED(8) CONSTANT(230), /* SUBPOOL 230 - DEB             */ 39350000
*     SP241 FIXED(8) CONSTANT(241), /* SUBPOOL 241 - CSA             */ 39400000
*     SP245 FIXED(8) CONSTANT(245), /* SUBPOOL 245 - IOSB/SRB        */ 39450000
*     SP253 FIXED(8) CONSTANT(253), /* SUBPOOL 253 - FETCH DATA AREA */ 39500000
*     SP255 FIXED(8) CONSTANT(255), /* SUBPOOL 255 - EXTENT/NOTE LIST*/ 39550000
*     STGET CHAR(1) CONSTANT('G'),  /* STORAGE OP - GETMAIN          */ 39600000
*     STFREE CHAR(1) CONSTANT('F'), /* STORAGE OP - FREEMAIN         */ 39650000
*     STBELOW CHAR(1) CONSTANT('B'),/* LOCATION - BELOW 16M          */ 39700000
*     STANY CHAR(1) CONSTANT('A'),  /* LOCATION - ANYWHERE           */ 39750000
*     STDWORD CHAR(1) CONSTANT('D'),/* BOUNDARY - DOUBLE WORD        */ 39800000
*     STPAGE CHAR(1) CONSTANT('P'), /* BOUNDARY - PAGE               */ 39850000
*     TWOBITS BIT(2) CONSTANT('11'B),/* TWO ONE-BITS                 */ 39900000
*     THREEZB BIT(3) CONSTANT('000'B),/* THREE ZERO BITS             */ 39950000
*     TWOK FIXED(31) CONSTANT(2048);/* X'00000800' USED AS A MASK    */ 40000000
*   /*****************************************************************/ 40050000
*   /*                                                               */ 40100000
*   /* DECLARE BASED VARIABLES, INITIALIZED VARIABLES, AND STRUCTURES*/ 40150000
*   /*                                                               */ 40200000
*   /*****************************************************************/ 40250000
*   DCL                                                                 40300000
*     FIXAREA CHAR(1) BASED(FTFIXPTR),/* FIRST BYTE OF MODULE STORAGE   40400000
*                                     WHICH IS FIXED                 */ 40450000
*     FIXEND CHAR(1) BASED(FTFIXEND),/* LAST BYTE OF MODULE STORAGE     40500000
*                                     WHICH IS FIXED                 */ 40550000
*     TFIXAREA CHAR(1) BASED(TTFIXPTR),/* FIRST BYTE OF MODULE STORAGE  40600000
*                                     TO FIX OR FREE                 */ 40650000
*     TFIXEND CHAR(1) BASED(TTFIXEND),/* LAST BYTE OF MODULE STORAGE    40700000
*                                     TO FIX OR FREE                 */ 40750000
*     BYTEBR1 FIXED(8) BASED(P1),   /* ONE-BYTE FIELD BASED ON REG 1 */ 40800000
*     CHARBR1 CHAR(256) BASED(P1),  /* CHAR FIELD BASED ON REG 1     */ 40850000
*     CHARBR2 CHAR(256) BASED(P2),  /* CHAR FIELD BASED ON REG 2     */ 40900000
*     SAVECH60 CHAR(60) BDY(WORD) BASED(R13),/* 60-BYTE SAVE AREA    */ 40950000
*     SAVECH64 CHAR(64) BDY(WORD) BASED(R13),/* 64-BYTE SAVE AREA    */ 41000000
*     WORDBR1 PTR(31) BASED(P1),    /* ONE WORD BASED ON REG 1       */ 41050000
*     WORDBR2 PTR(31) BASED(P2);    /* ONE WORD BASED ON REG 2       */ 41100000
*   DCL CVTPTR PTR LOC(16);         /*                           @P2C*/ 41150000
*   DCL                             /* DEFINE DUMMY SEGMENT TABLE    */ 41350000
*     1 FTSEGTAB BASED(FTMODPTR),                                       41400000
*       3 FSTDCB PTR(31),           /* POINTER TO DCB                */ 41450000
*       3 FSTNOTEL PTR(31);         /* POINTER TO NOTELIST           */ 41500000
*@EJECT ASM;                                                            41550000
*   /*****************************************************************/ 41600000
*   /*                                                               */ 41650000
*   /* DEFINE FORMAT 1 CCWS                                          */ 41700000
*   /*                                                               */ 41750000
*   /*****************************************************************/ 41800000
*   DCL                                                                 41850000
*     1 CCW1#2 BASED(CCWPTR),                                           41900000
*      2 CCW1,                                                          41950000
*       3 CCW1CMD FIXED(8),         /* COMMAND CODE                  */ 42000000
*       3 CCW1FLAG BIT(8),          /* COMMAND FLAGS                 */ 42050000
*         5 CCW1CD BIT(1),          /* ** CHAIN DATA                 */ 42100000
*         5 CCW1CC BIT(1),          /* ** CHAIN COMMAND              */ 42150000
*         5 CCW1SLI BIT(1),         /* ** SUPPRESS LENGTH INDICATION */ 42200000
*         5 CCW1SKIP BIT(1),        /* ** SKIP                       */ 42250000
*         5 CCW1PCI BIT(1),         /* ** PGM CONTROLLED INTERRUPT   */ 42300000
*         5 CCW1IDA BIT(1),         /* ** INDIRECT DATA ADDRESS      */ 42350000
*         5 * BIT(2),               /* ** RESERVED                   */ 42400000
*       3 CCW1CNT FIXED(16),        /* COUNT FIELD                   */ 42450000
*       3 CCW1ADDR PTR(31),         /* DATA ADDRESS                  */ 42500000
*      2 CCW1B,                                                         42550000
*       3 CCW1BCMD FIXED(8),        /* COMMAND CODE                  */ 42600000
*       3 CCW1BFLG BIT(8),          /* COMMAND FLAGS                 */ 42650000
*       3 CCW1BCNT FIXED(16),       /* COUNT FIELD                   */ 42700000
*       3 CCW1BADR PTR(31);         /* DATA ADDRESS                  */ 42750000
*   DCL                                                                 42800000
*     1 CCWCCW BASED(CCWPTR),      /* DEFINE TWO COMPLETE CCWS      */  42850000
*      2 CCWABLE CHAR(8),           /* FIRST CCW                     */ 42900000
*      2 CCWBAKER CHAR(8),          /* SECOND CCW                    */ 42950000
*      2 CCWCHUCK CHAR(0);          /* ADDR OF THIRD CCW             */ 43000000
*   /*****************************************************************/ 43050000
*   /*                                                               */ 43100000
*   /* DEFINE FORMAT 0 CCWS                                          */ 43150000
*   /*                                                               */ 43200000
*   /*****************************************************************/ 43250000
*   DCL                                                                 43300000
*     1 CCW0#2 BASED(CCWPTR),                                           43350000
*      2 CCW0,                                                          43400000
*       3 CCW0CMD FIXED(8),         /* COMMAND CODE                  */ 43450000
*       3 CCW0ADDR PTR(24),         /* DATA ADDRESS                  */ 43500000
*       3 CCW0FLAG BIT(8),          /* COMMAND FLAGS                 */ 43550000
*         5 CCW0CD BIT(1),          /* ** CHAIN DATA                 */ 43600000
*         5 CCW0CC BIT(1),          /* ** CHAIN COMMAND              */ 43650000
*         5 CCW0SLI BIT(1),         /* ** SUPPRESS LENGTH INDICATION */ 43700000
*         5 CCW0SKIP BIT(1),        /* ** SKIP                       */ 43750000
*         5 CCW0PCI BIT(1),         /* ** PGM CONTROLLED INTERRUPT   */ 43800000
*         5 CCW0IDA BIT(1),         /* ** INDIRECT DATA ADDRESS      */ 43850000
*         5 * BIT(2),               /* ** RESERVED                   */ 43900000
*       3 * FIXED(8),               /* ** RESERVED                   */ 43950000
*       3 CCW0CNT FIXED(16),        /* COUNT FIELD                   */ 44000000
*      2 CCW0B,                                                         44050000
*       3 CCW0BCMD FIXED(8),        /* COMMAND CODE                  */ 44100000
*       3 CCW0BADR PTR(24),         /* DATA ADDRESS                  */ 44150000
*       3 CCW0BFLG BIT(8),          /* COMMAND FLAGS                 */ 44200000
*       3 * FIXED(8),               /* ** RESERVED                   */ 44250000
*       3 CCW0BCNT FIXED(16);       /* COUNT FIELD                   */ 44300000
*   /*****************************************************************/ 44350000
*   /*                                                               */ 44400000
*   /* STORAGE FOR THESE BUFFERS IS IN SUBPOOL 255, (FIXED)          */ 44450000
*   /*                                                               */ 44500000
*   /*****************************************************************/ 44550000
*   DCL                                                                 44600000
*     1 FTBUFFER BDY(DWORD) BASED(RDATD),                               44650000
*      2 FTNONBUF CHAR(4096) BDY(DWORD),/* AREA PRECEDING RLD           44700000
*                                      BUFFERS                       */ 44750000
* /*******************************************************************/ 44800000
* /* THE COMPILER IS RESTRICTED TO 256 BYTES OF DYNAMIC AREA FOR     */ 44850000
* /*   EACH MODULE, IEWFETCH AND IEWFETAP, BY SPECIFYING             */ 44900000
* /*   AUTODATA(256) IN THE EXTERNAL PROCEDURE STATEMENT.        @L6A*/ 44950000
* /*******************************************************************/ 45000000
*       3 * CHAR(256),              /* @DATD FOR MODULE IEWFETCH     */ 45050000
*       3 * CHAR(256),              /* @DATD FOR MODULE IEWFETAP     */ 45100000
*     /***************************************************************/ 45150000
*     /*                                                             */ 45200000
*     /* FETCH CHANNEL PROGRAMS                                      */ 45250000
*     /*                                                             */ 45300000
*     /***************************************************************/ 45350000
*       3 FTCPSRCH,                 /* SEARCH FOR RECORD             */ 45400000
*         5 FTCPSSEC CHAR(8),       /* X'200' SET SECTOR             */ 45450000
*         5 FTCPSIDE CHAR(8),       /* X'208' SEARCH ON ID EQUAL     */ 45500000
*         5 FTCPTICS CHAR(8),       /* X'210' TIC TO FTCPSIDE        */ 45550000
*         5 FTCPTICR CHAR(8),       /* X'218' TIC TO FTCPRTXT(1)     */ 45600000
*       3 FTCPSET(2),               /* READ TEXT RECORDS             */ 45650000
*         5 FTCPRCBT CHAR(8),       /* X'220' READ COUNT BEFORE TEXT */ 45700000
*         5 FTCPRTXT CHAR(8),       /* X'228' READ TEXT (OR NOTELIST)*/ 45750000
*         5 FTCPRCAT CHAR(8),       /* X'230' READ COUNT AFTER TEXT  */ 45800000
*         5 FTCPTICK CHAR(8),       /* X'238' ..TIC TO FTCPRSET(N)   */ 45850000
*         5 FTCPRSET CHAR(8),       /* X'240' READ SECTOR AFTER TEXT */ 45900000
*       3 FTCPPAIR(48),             /* READ PAIR (RLD AND COUNT)     */ 45950000
*         5 FTCPRRLD CHAR(8),       /* X'270' READ RLD DATA          */ 46000000
*         5 FTCPTRLD CHAR(8),       /* X'278' TIC TO READ RLD(N+1)   */ 46050000
*       3 FTCPENDR,                 /* END OF READING RLDS           */ 46100000
*         5 FTCPRCAR CHAR(8),       /* X'570' READ COUNT AFTER RLD   */ 46150000
*         5 FTCPRSEC CHAR(8),       /* X'578' READ SECTOR            */ 46200000
*     /***************************************************************/ 46250000
*     /*                                                             */ 46300000
*     /* INDIRECT ADDRESS LIST                                       */ 46350000
*     /*                                                             */ 46400000
*     /***************************************************************/ 46450000
*       3 FTIDAL(MAXIDAL) FIXED(31), /* X'580' IDAL BUILD AREA       */ 46500000
*     /***************************************************************/ 46550000
*     /*                                                             */ 46600000
*     /* COUNT FIELDS (AS IN COUNT/KEY/DATA).                        */ 46650000
*     /*                                                             */ 46700000
*     /***************************************************************/ 46750000
*       3 FTCOUNT CHAR(8),          /* COUNT FOR SEARCH              */ 46800000
*         5 FTCTCHR,                                                    46850000
*           7 FTCTCC CHAR(2),       /* CYLINDER                      */ 46900000
*           7 FTCTHH CHAR(2),       /* HEAD                          */ 46950000
*           7 FTCTR CHAR(1),        /* RECORD                        */ 47000000
*         5 FTCTKL FIXED(8),        /* KEY LENGTH                    */ 47050000
*         5 FTCTDL FIXED(15) BDY(BYTE),/* DATA LENGTH                */ 47100000
*       3 FTCNTAR CHAR(8),          /* COUNT-AFTER-RLD               */ 47150000
*         5 FTCNCHR CHAR(5),        /* CCHHR                         */ 47200000
*         5 FTCNKL FIXED(8),        /* KEY LENGTH                    */ 47250000
*         5 FTCNDL FIXED(15) BDY(BYTE),/* DATA LENGTH                */ 47300000
*     /***************************************************************/ 47350000
*     /*                                                             */ 47400000
*     /* SAVE AREA FOR IOSB AND SRB                                  */ 47450000
*     /*                                                             */ 47500000
*     /***************************************************************/ 47550000
*       3 FTIOSB CHAR(LENGTH(IOSB)),/* SAVE IOSB WHEN ERR OCCURS     */ 47600000
*       3 FTSRB CHAR(LENGTH(SRB)),  /* SAVE SRB WHEN ERR OCCURS      */ 47650000
*     /***************************************************************/ 47700000
*     /*                                                             */ 47750000
*     /* AREA TO SAVE AN INITIALIZED SECTION OF THE CHANNEL PROGRAM  */ 47800000
*     /*                                                             */ 47850000
*     /***************************************************************/ 47900000
*       3 FTCYSRCH CHAR(LENGTH(FTCPSRCH)),                              47950000
*       3 FTCYSET(2) CHAR(LENGTH(FTCPSET)),                             48000000
*         5 FTCYRCBT CHAR(8),       /* READ COUNT BEFORE TEXT        */ 48050000
*         5 FTCYRTXT CHAR(8),       /* READ TEXT (OR NOTELIST)       */ 48100000
*         5 FTCYRCAT CHAR(8),       /* READ COUNT AFTER TEXT         */ 48150000
*         5 FTCYTICK CHAR(8),       /* ..TIC TO FTCPRSET(N)          */ 48200000
*         5 FTCYRSET CHAR(8),       /* READ SECTOR AFTER TEXT        */ 48250000
*       3 FTCYPAIR CHAR(LENGTH(FTCPPAIR)),                              48300000
*         5 FTCYRRLD CHAR(8),       /* READ RLD DATA                 */ 48350000
*         5 FTCYTRLD CHAR(8),       /* TIC TO READ RLD(N+1)          */ 48400000
*     /***************************************************************/ 48450000
*     /*                                                             */ 48500000
*     /* RLD BUFFER AREAS. NOTE THAT THE BUFFER AREAS ARE ON A PAGE  */ 48550000
*     /* BOUNDRY AND OCCUPY FULL PAGES.                              */ 48600000
*     /*                                                             */ 48650000
*     /***************************************************************/ 48700000
*      2 FTRLDBUF(MAXRRLD) CHAR(256),                                   48750000
*     /***************************************************************/ 48800000
*     /*                                                             */ 48850000
*     /* END OF THE @DATD AREA                                       */ 48900000
*     /*                                                             */ 48950000
*     /***************************************************************/ 49000000
*      2 DATDEND CHAR(0);                                               49050000
*     /***************************************************************/ 49100000
*     /*                                                             */ 49150000
*     /* RE-DEFINE IDAL LIST A PAIR OF LISTS FOR PCI                 */ 49200000
*     /*                                                             */ 49250000
*     /***************************************************************/ 49300000
*   DCL                                                                 49350000
*     FTIDALST(2) CHAR(MAXIDAL*2) DEFINED FTIDAL;                       49400000
*DCL FTIDAL64(MAXIDAL/2) CHAR(8)                                        49416600
*      DEF(FTIDAL);                  /*                           @PxA*/49433200
* %IF DEBUG~='YES' %THEN %GOTO BYDCL;                                   49450000
* DCL                                                                   49500000
*   $BUGPTR PTR(31) DEFINED(FTRESERV); /* POINTER TO DEBUGGING DATA  */ 49550000
* DCL                                                                   49600000
*   1 $BUGAREA BDY(WORD) BASED($BUGPTR),/* DEBUGGING                 */ 49650000
*     3 $CALL CHAR(4),                 /* DEBUG 'CALL'               */ 49700000
*     3 $CALLED FIXED,                 /* TIMES IEWFETCH CALLED      */ 49750000
*     3 $REREAD FIXED,                 /* TIMES RE-READ              */ 49800000
*     3 $NOOVLY FIXED,                 /* NON OVERLAY MODULE         */ 49850000
*     3 $OVROOT FIXED,                 /* OVERLAY ROOT               */ 49900000
*     3 $OVSEG FIXED,                  /* OVERLAY SEGMENT            */ 49950000
*     3 $PCIOFF FIXED,                 /* CHANNEL END - PCI OFF      */ 50000000
*     3 $PCION FIXED,                  /* CHANNEL END - PCI ON       */ 50050000
*     3 $MADE CHAR(4),                 /* DEBUG 'MADE'               */ 50100000
*     3 $NONTIG FIXED,                 /* NON-CONTIGUOUS TEXT        */ 50150000
*     3 $LASTXT FIXED,                 /* LAST TEXT WILL BE READ     */ 50200000
*     3 $NORLDS FIXED,                 /* NO BUFFERS AVAILABLE       */ 50250000
*     3 $MORLDS FIXED,                 /* MORE RLDS TO READ          */ 50300000
*     3 $LSTRLD FIXED,                 /* LAST RLD WILL BE READ      */ 50350000
*     3 $NOFIXD FIXED,                 /* NOT ENOUGH STORAGE FIXED   */ 50400000
*     3 $PCIGO FIXED,                  /* READ THE NEXT TEXT BLOCK   */ 50450000
*     3 $MISS CHAR(4),                 /* DEBUG 'MISS'               */ 50500000
*     3 $$NONTIG FIXED,                /* NON-CONTIGUOUS TEXT        */ 50550000
*     3 $$LASTXT FIXED,                /* LAST TEXT WILL BE READ     */ 50600000
*     3 $$NORLDS FIXED,                /* NO BUFFERS AVAILABLE       */ 50650000
*     3 $$MORLDS FIXED,                /* MORE RLDS TO READ          */ 50700000
*     3 $$LSTRLD FIXED,                /* LAST RLD WILL BE READ      */ 50750000
*     3 $$NOFIXD FIXED,                /* NOT ENOUGH STORAGE FIXED   */ 50800000
*     3 $$PCIGO FIXED,                 /* READ THE NEXT TEXT BLOCK   */ 50850000
*     3 $$NAME CHAR(8),                /* MODULE NAME FOR COMPARISON */ 50900000
*     3 $NAME1 CHAR(8),                /* MODULE NAME 1              */ 50950000
*     3 $NAME2 CHAR(8),                /* MODULE NAME 2              */ 51000000
*     3 $NAME3 CHAR(8),                /* MODULE NAME 3              */ 51050000
*     3 $NAME4 CHAR(8),                /* MODULE NAME 4              */ 51100000
*     3 $FETWK FIXED,                  /* ADDRESS OF FETCH WORK AREA */ 51150000
*     3 $@DATD FIXED;                  /* ADDRESS OF FETCH DATA AREA */ 51200000
*%BYDCL:;                                                               51250000
*%BYFETCH:;                                                             51300000
*/* END OF IHAFETWK MACRO                                            */ 51350000
