*        %GOTO PLSIHSA;                                              /* 00050000
         MACRO                                                          00100000
         IHAIHSA &LIST=NO                                          @L1C 00150000
**/                                                                     00200000
*%PLSIHSA : ;                                                           00250000
*/* START OF SPECIFICATIONS ******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* MACRO NAME:  IHAIHSA                                          */ 00400000
*/*                                                                  */ 00450000
*/*01* DESCRIPTIVE NAME:  INTERRUPT HANDLER SAVE AREA                */ 00500000
*/*                                                                  */ 00550000
*/*01* PROPRIETARY STATEMENT:                                    @L4C*/ 00600000
*/*                                                                  */ 00650000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00850000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00887500
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                 */ 00937500
*/*                                                                  */ 01000000
*/*01* STATUS: HBB7703                                           @L4C*/ 01031200
*/*                                                                  */ 01062500
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 01075000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01087500
*/*                                                                  */ 01100000
*/*01* FUNCTION:                                                     */ 01150000
*/*      PROVIDES A SAVE AREA FOR THE STATUS OF AN INTERRUPTED       */ 01200000
*/*      TASK HOLDING THE LOCAL OR CML LOCK.                         */ 01250000
*/*                                                                  */ 01253800
*/*01* DSECT NAME: IHSA                                              */ 01257600
*/*                                                                  */ 01261400
*/*01* EYE CATCHER: NONE                                             */ 01265200
*/*                                                                  */ 01269000
*/*01* STORAGE ATTRIBUTES:                                           */ 01272800
*/*02*  KEY:  0                                                      */ 01276600
*/*02*  Subpool:  255                                                */ 01280400
*/*02*  Residency:  Below 16M                                        */ 01284200
*/*                                                                  */ 01288000
*/*01*  SIZE:                                                        */ 01291800
*/*       Offset of IHSAEND minus the offset of IHSA                 */ 01295600
*/*                                                                  */ 01300000
*/*01* METHOD OF ACCESS:                                             */ 01350000
*/*                                                                  */ 01400000
*/*      BAL:                                                        */ 01450000
*/*      DSECT IS PRODUCED, PERFORM USING ON IHSA.                   */ 01500000
*/*      SPECIFY LIST=YES ON MACRO CALL TO OBTAIN LISTING.           */ 01550000
*/*                                                                  */ 01600000
*/*      PL/AS:                                                      */ 01650000
*/*      BASED STRUCTURE IS PRODUCED.                                */ 01700000
*/*      SPECIFY %IHALIST='YES' BEFORE %INCLUDE TO OBTAIN THE        */ 01750000
*/*      PL/AS LISTING.                                              */ 01800000
*/*                                                                  */ 01850000
*/*      VIA ATTRIBUTE - SPECIFY %IHAVIA='YES' BEFORE %INCLUDE.      */ 01900000
*/*                      DECLARE IHSAALET.                           */ 01950000
*/*                                                                  */ 02000000
*/*01* CREATED BY:  IEAVEMIN                                         */ 02050000
*/*                                                                  */ 02100000
*/*01* DELETED BY:  N/A                                              */ 02150000
*/*                                                                  */ 02200000
*/*01* POINTED TO BY:  ASXBIHSA                                      */ 02250000
*/*                                                                  */ 02300000
*/*01* SERIALIZATION:  THE LOCAL LOCK                                */ 02350000
*/*                                                                  */ 02400000
*/*01* DEPENDENCIES:                                                 */ 02550000
*/*        THE IHACBLS MACRO MUST BE UPDATED TO REFLECT ANY LENGTH   */ 02600000
*/*        CHANGE TO THE IHAIHSA MACRO.                              */ 02650000
*/*                                                                  */ 02700000
*/*01* COMPONENT:  SUPERVISOR CONTROL (SC1C5)                        */ 02750000
*/*                                                                  */ 02800000
*/*01* DISTRIBUTION LIBRARY: AMODGEN                                 */ 02850000
*/*                                                                  */ 02900000
*/* END OF SPECIFICATIONS ********************************************/ 02950000
*%GOTO PLSIHSA1;  /*                                                    03000000
.*                                                                      03050000
.*********************************************************************  03100000
.*                                                                      03150000
.*   CHANGE ACTIVITY =                                                  03200000
.*                                                                      03250000
.*   G860PXX - HBB2102 SUPPORT                                          03300000
.*                                                                      03350000
.*  $L1=RASENH   JBB2220  840618  PD16XK:  RAS ENHANCEMENTS FOR RTM     03400000
.*  $L2=AR       HBB3310  850905  PD16Q4:  ACCESS REGISTERS             03450000
.*  $L3=AR       HBB3310  860416  PD16Q9:  ACCESS REGISTERS             03500000
.*  $L4=LOCKR    HBB4410  870622  PD16Q9:  LOCK RESTRUCTURE             03525000
.*  $L5=IEEESUP  HBB6606  970807  PD00XB:  FP SIMULATION                03537500
.*  $P1=PVT0671  HBB6606  980315  R4GAXZ:  SHOWHDR update               03543700
.*  $L6=64BITSUP HBB7703  971101  PD00XB:  64-BIT GPRS                  03546800
.*                                                                      03550000
.*********************************************************************  03600000
.*                                                                      03650000
.*********************************************************************  03700000
.*                                                                      03750000
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     03800000
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          03850000
.*                        IHSARXXX DS    ???       - RESERVED.          03900000
.*                             XXX IS THE OFFSET WITHIN THE IHSA        03950000
.*                             ??? IS THE FIELD SIZE                    04000000
.*                                                                      04050000
.*     2. PL/AS - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT  04100000
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY      04150000
.*               ARE NOT NAMED.                                         04200000
.*                                                                      04250000
.*********************************************************************  04300000
.*                                                                      04350000
         PUSH  PRINT                                               @L1A 04400000
         AIF   ('&LIST' EQ 'YES').IHSALST                          @L1A 04450000
         PRINT OFF                                                 @L1A 04500000
.IHSALST ANOP                                                      @L1A 04550000
         SPACE 1                                                        04600000
IHSA     DSECT                                                          04650000
IHSACPUT DS    D                       VALUE OF CPU TIMER               04700000
IHSANTCB DS    F                       VALUE OF PSATNEW AT INTERRUPT    04750000
IHSAOTCB DS    F                       VALUE OF PSATOLD AT INTERRUPT    04800000
IHSACPSW DS    D                       VALUE OF CURRENT PSW             04850000
IHSAFPRS DS    0CL32                   FLOATING POINT REG SAVE AREA     04900000
IHSAFPR0 DS    D                       FLOATING POINT REG 0             04950000
IHSAFPR2 DS    D                       FLOATING POINT REG 2             05000000
IHSAFPR4 DS    D                       FLOATING POINT REG 4             05050000
IHSAFPR6 DS    D                       FLOATING POINT REG 6             05100000
IHSAGPRS DS    CL64                    GENERAL REGISTER SAVE AREA       05150000
IHSAR078 DS    D                       RESERVED               @G50DPXE  05200000
IHSAXSB  DS    A                       ADDRESS OF EXTENDED    @G381PXU  05250000
*                                      STATUS BLOCK (XSB)     @G381PXU  05300000
IHSAFLGS DS    B                       IHSA FLAGS             @G38MPXU  05350000
IHSANSS  EQU   X'80'                   ONE OR MORE FRRS       @G38MPXU  05400000
*                                      ESTABLISHED WITH       @G38MPXU  05450000
*                                      EUT=YES                @G38MPXU  05500000
IHSAR085 DS    XL3                     RESERVED               @G38MPXU  05550000
IHSAARS  DS    0XL64                   ACCESS REGISTER SAVE AREA. @L2A  05600000
IHSAAR0  DS    F                       ACCESS REGISTER 0 SAVE     @L2A  05650000
*                                      AREA.                            05700000
IHSAAR1  DS    F                       ACCESS REGISTER 1 SAVE     @L2A  05750000
*                                      AREA.                            05800000
IHSAAR2  DS    F                       ACCESS REGISTER 2 SAVE     @L2A  05850000
*                                      AREA.                            05900000
IHSAAR3  DS    F                       ACCESS REGISTER 3 SAVE     @L2A  05950000
*                                      AREA.                            06000000
IHSAAR4  DS    F                       ACCESS REGISTER 4 SAVE     @L2A  06050000
*                                      AREA.                            06100000
IHSAAR5  DS    F                       ACCESS REGISTER 5 SAVE     @L2A  06150000
*                                      AREA.                            06200000
IHSAAR6  DS    F                       ACCESS REGISTER 6 SAVE     @L2A  06250000
*                                      AREA.                            06300000
IHSAAR7  DS    F                       ACCESS REGISTER 7 SAVE     @L2A  06350000
*                                      AREA.                            06400000
IHSAAR8  DS    F                       ACCESS REGISTER 8 SAVE     @L2A  06450000
*                                      AREA.                            06500000
IHSAAR9  DS    F                       ACCESS REGISTER 9 SAVE     @L2A  06550000
*                                      AREA.                            06600000
IHSAAR10 DS    F                       ACCESS REGISTER 10 SAVE    @L2A  06650000
*                                      AREA.                            06700000
IHSAAR11 DS    F                       ACCESS REGISTER 11 SAVE    @L2A  06750000
*                                      AREA.                            06800000
IHSAAR12 DS    F                       ACCESS REGISTER 12 SAVE    @L2A  06850000
*                                      AREA.                            06900000
IHSAAR13 DS    F                       ACCESS REGISTER 13 SAVE    @L2A  06950000
*                                      AREA.                            07000000
IHSAAR14 DS    F                       ACCESS REGISTER 14 SAVE    @L2A  07050000
*                                      AREA.                            07100000
IHSAAR15 DS    F                       ACCESS REGISTER 15 SAVE    @L2A  07150000
*                                      AREA.                            07200000
IHSALSDP DS    A                       LINKAGE STACK ENTRY DESCRIPTOR   07250000
*                                      (LSED) POINTER.            @L2A  07300000
IHSAFRRS DS    CL984                   FRR STACK SAVEAREA         @L4C  07350000
IHSAR4A4 DS    XL4                     RESERVED                   @L4C  07400000
IHSAAFPR DS    XL100                   FPRS 1,3,5,7-15,FPCR       @L5A  07416600
IHSAR50C DS    XL4                     RESERVED                   @L5A  07433300
IHSAG64H DS    CL64                    HIGH ORDER HALVES OF 64-BIT      07438800
*                                      GPRS                       @L6A  07444400
IHSAEND  DS    0D                      END OF IHSA                @L1C  07450000
IHSALEN  EQU   IHSAEND-IHSA            LENGTH OF IHSA AREA        @L1C  07500000
         POP   PRINT                                              @L1A  07550000
         MEND  , */                                                     07600000
*%PLSIHSA1 : ;                                                          07650000
*                                                                       07700000
*  @LISTPUSH;                                                  /*@L1A*/ 07750000
*  %IF IHALIST='YES' %THEN                                     /*@L1A*/ 07800000
*     %GOTO IHSALST;                                           /*@L1A*/ 07850000
*  @LISTOFF;                                                   /*@L1A*/ 07900000
*  %IHSALST:;                                                  /*@L1A*/ 07950000
*                                                                       08000000
*%IF IHAVIA='YES'  %THEN                                                08050000
*   %IHAALET='VIA(IHSAALET)' ;                                          08100000
* %ELSE                                                                 08150000
*     %IHAALET='';                                                      08200000
*                                                                       08250000
*DECLARE                               /* LOCAL SUPERVISOR SAVE AREA */ 08300000
*  1 IHSA IHAALET BASED,               /*                        @L2C*/ 08350000
*    2 IHSACPUT CHAR(8) BDY(DWORD),    /* VALUE OF CPU TIMER         */ 08400000
*    2 IHSANTCB FIXED(31),             /* VALUE OF PSATNEW           */ 08450000
*    2 IHSAOTCB FIXED(31),             /* VALUE OF PSATOLD           */ 08500000
*    2 IHSACPSW CHAR(8) BDY(DWORD),    /* VALUE OF CURRENT PSW       */ 08550000
*    2 IHSAFPRS CHAR(32) BDY(DWORD),   /* FLOATING POINT REG SAVE       08600000
*                                         AREA                       */ 08650000
*      3 IHSAFPR0 CHAR(8),             /* FLOATING POINT REG 0       */ 08700000
*      3 IHSAFPR2 CHAR(8),             /* FLOATING POINT REG 2       */ 08750000
*      3 IHSAFPR4 CHAR(8),             /* FLOATING POINT REG 4       */ 08800000
*      3 IHSAFPR6 CHAR(8),             /* FLOATING POINT REG 6       */ 08850000
*    2 IHSAGPRS CHAR(64),              /* GENERAL REGISTER SAVE AREA */ 08900000
*    2 IHSAR078 CHAR(8) BDY(DWORD),    /* RESERVED           @G50DPXE*/ 08950000
*    2 IHSAXSB  PTR(31),               /* ADDRESS OF EXTENDED           09000000
*                                         STATUS BLOCK (XSB) @G381PXU*/ 09050000
*    2 IHSAFLGS BIT(8),                /* IHSA FLAGS         @G38MPXU*/ 09100000
*      3 IHSANSS BIT(1),               /* ONE OR MORE FRRS   @G38MPXU   09150000
*                                         ESTABLISHED WITH   @G38MPXU   09200000
*                                         EUT=YES            @G38MPXU*/ 09250000
*    2 IHSAR085 CHAR(3),               /* RESERVED           @G38MPXU*/ 09300000
*    2 IHSAARS  CHAR(64) BDY(WORD),    /* ACCESS REGISTER SAVE          09350000
*                                         AREA.                  @L2A*/ 09400000
*        3 IHSAAR0   FIXED(32),        /* ACCESS REGISTER 0             09450000
*                                         SAVE AREA.             @L2A*/ 09500000
*        3 IHSAAR1   FIXED(32),        /* ACCESS REGISTER 1             09550000
*                                         SAVE AREA.             @L2A*/ 09600000
*        3 IHSAAR2   FIXED(32),        /* ACCESS REGISTER 2             09650000
*                                         SAVE AREA.             @L2A*/ 09700000
*        3 IHSAAR3   FIXED(32),        /* ACCESS REGISTER 3             09750000
*                                         SAVE AREA.             @L2A*/ 09800000
*        3 IHSAAR4   FIXED(32),        /* ACCESS REGISTER 4             09850000
*                                         SAVE AREA.             @L2A*/ 09900000
*        3 IHSAAR5   FIXED(32),        /* ACCESS REGISTER 5             09950000
*                                         SAVE AREA.             @L2A*/ 10000000
*        3 IHSAAR6   FIXED(32),        /* ACCESS REGISTER 6             10050000
*                                         SAVE AREA.             @L2A*/ 10100000
*        3 IHSAAR7   FIXED(32),        /* ACCESS REGISTER 7             10150000
*                                         SAVE AREA.             @L2A*/ 10200000
*        3 IHSAAR8   FIXED(32),        /* ACCESS REGISTER 8             10250000
*                                         SAVE AREA.             @L2A*/ 10300000
*        3 IHSAAR9   FIXED(32),        /* ACCESS REGISTER 9             10350000
*                                         SAVE AREA.             @L2A*/ 10400000
*        3 IHSAAR10  FIXED(32),        /* ACCESS REGISTER 10            10450000
*                                         SAVE AREA.             @L2A*/ 10500000
*        3 IHSAAR11  FIXED(32),        /* ACCESS REGISTER 11            10550000
*                                         SAVE AREA.             @L2A*/ 10600000
*        3 IHSAAR12  FIXED(32),        /* ACCESS REGISTER 12            10650000
*                                         SAVE AREA.             @L2A*/ 10700000
*        3 IHSAAR13  FIXED(32),        /* ACCESS REGISTER 13            10750000
*                                         SAVE AREA.             @L2A*/ 10800000
*        3 IHSAAR14  FIXED(32),        /* ACCESS REGISTER 14            10850000
*                                         SAVE AREA.             @L2A*/ 10900000
*        3 IHSAAR15  FIXED(32),        /* ACCESS REGISTER 15            10950000
*                                         SAVE AREA.             @L2A*/ 11000000
*    2 IHSALSDP PTR(31),               /* LINKAGE STACK ENTRY           11050000
*                                         DESCRIPTOR (LSED) POINTER.    11100000
*                                                                @L2A*/ 11150000
*    2 IHSAFRRS CHAR(984) BDY(WORD),   /* FRR STACK SAVEAREA     @L4C*/ 11200000
*    2 IHSAR4A4 CHAR(4),               /* RESERVED               @L4C*/ 11250000
*    2 IHSAAFPR CHAR(100),             /* FPRS 1,3,5,7-15,FPCR   @L5A*/ 11266600
*    2 IHSAR50C CHAR(4),               /* RESERVED               @L5A*/ 11283300
*    2 IHSAG64H CHAR(64),              /* HIGH ORDER HALVES OF          11288800
*                                         64-BIT GPRS            @L6A*/ 11294400
*    2 IHSAEND CHAR(0) BDY(DWORD);     /* DOUBLE WORD ALIGN      @L1C*/ 11300000
*  @LISTPOP;                                                   /*@L1A*/ 11350000
