* %GOTO IVTPLS1;                                                        00050000
         MACRO                                                          00100000
         IHAIVT                                                         00150000
* %IVTPLS1:;                                                            00200000
*/* START OF SPECIFICATIONS *****************************************   00250000
***** PROPRIETARY_STATEMENT ****************************************    00300000
*01* PROPRIETARY STATEMENT =                                            00350000
*                                                                       02259000
*      LICENSED MATERIALS - PROPERTY OF IBM                             02259300
*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      02259600
*      5647-A01 (C) COPYRIGHT IBM CORP. 1986,2000                       02260200
*                                                                       02260800
**** END_OF_PROPRIETARY_STATEMENT *********************************     02261100
*01* STATUS:  HBB7703                                                   02261200
*01* ACRONYM: IVT                                                       02261400
*01* EXTERNAL CLASSIFICATION: DMTI                                      02261700
*01* END OF EXTERNAL CLASSIFICATION:                                    02262000
*                                                                       02262300
*                                                                       02264400
*01* DESCRIPTIVE NAME:  IPL VECTOR TABLE                                02264500
*02*  ACRONYM:  IVT                                                     02264600
*                                                                       02264700
*01* MACRO-NAME:  IHAIVT                                                02264800
*                                                                       02264900
*01* DSECT NAME:                                                        02265000
*     IVT                                                               02265100
*                                                                       02265200
*01* COMPONENT:  Initial Program Load (SC1C9)                           02265300
*                                                                       02265400
*01* EYE-CATCHER:  IVT                                                  02265500
*02*  OFFSET:  0                                                        02265600
*02*  LENGTH:  4                                                        02265700
*                                                                       02265800
*01* STORAGE ATTRIBUTES:                                                02265900
*02*  SUBPOOL:  245                                                     02266000
*02*  KEY:  0                                                           02266100
*02*  RESIDENCY:  Above 16M line                                        02266200
*                                                                       02266300
*01* SIZE:              Can not exceed 4K                               02266400
*                                                                       02266500
*01* CREATED BY:                                                        02266600
*     IEAIPL00                                                          02266700
*                                                                       02266800
*01* DELETED BY:        IEAVNIP0                                        02267100
*                                                                       02268000
*01* REFERENCED BY:     IPL MODULES                                     02268900
*                       IEAVNIP0                                        02269800
*                                                                       02270700
*01* STORAGE ESTIMATE:  OCCURS ONLY ONCE IN THE SYSTEM                  02273400
*                       X'180' BYTES                           @P1C     02274300
*                                                                       02275200
*01* POINTED TO BY:                                                     02275800
*     Register 1 on entry to each module                                02276400
*                                                                       02277000
*01* SERIALIZATION:                                                     02277100
*     None                                                              02277200
*                                                                       02277300
*01* FUNCTION:                                                          02277400
*02*  Provide communication between modules in the IPL component        02277500
*     and a means of passing data to the NIP component.                 02277600
*                                                                       02277700
**01* METHOD OF ACCESS:                                                 02277800
**02*  ASM:                                                             02277900
**      DSECT is always produced.                                       02278000
**02*  PL/AS:                                                           02278100
**      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing.     02278200
*                                                                       02278300
*                                                                       02278800
*01* CHANGE ACTIVITY:                                                   02279700
*                                                                       02280600
* $MAC(IHAIVT),COMP(SC1C9),PROD(HBB4410):                               02281500
*                                                                       02282400
* FLAG REASON   RELEASE DATE    ORIGIN DESCRIPTION                      02283300
*                                                                       02284200
* $H1=SERVPROC, JBB2133, 830914, PDFM: SERVICE PROCESSOR         @H1A   02285100
*                                      ARCHITECTURE SUPPORT      @H1A   02286000
* $L1=IOGEN   , JBB2220, 840510, PDFM: IOGEN RESTRUCTURE         @L1A   02286900
* $D1=DCR20   , JBB2220, 840510, PD6U: DEFAULT IPL PARAMETERS    @D1A   02287800
* $D2=DCR31   , JBB2220, 850220, PDF5: IPLWTO SUPPORT            @D2A   02288700
* $L2=EMVS1   , HBB4410, 880815, PDCV: IODF SUPPORT              @L2A   02289600
* $L3=EMVS1   , HBB4410, 880815, PDBX: IODF SUPPORT              @L3A   02290500
* $L4=EMVS1   , HBB4410, 880815, PDBX: WALKTHRU COMMENTS         @L4A   02291400
* $L5=EMVS1   , HBB4410, 881024, PDBX: RESET EVENT FOR EXTENDED  @L5A   02292300
*                                      XDAP                      @L5A   02293200
* $D3=DEO0205 , HBB4410, 890918, PD16EJ: LOADXX MEMBER TO        @D3A   02293500
*                                        SYS1.PARMLIB            @D3A   02293800
* $D4=DEO0294 , HBB4410, 900105, PD16EJ: NUCLEUS ID IN LOAD      @D4A   02293900
*                                        PARAMETER               @D4A   02294000
* $H2=DYNAM   , HBB4420, 900122, PD16EI: DYNAMIC I/O             @H2A   02294100
* $P1=PEO3517 , HBB4410, 900226, PD16HA: ADD VSD SUPPORT         @P1A   02294200
*     OY38539 - SUPPORT FOR THIS APAR IS PROVIDED IN CODE FLAGGED UNDER 02294300
*               PEO3517.  THIS PART WAS SHIPPED FOR OY38539 BECAUSE OF  02294400
*               AN SMPE REQUIREMENT.                                    02294500
* $P2=PH31820 , HBB4420, 910104, PD16EJ: LOADXX MEMBER TO SYSN.IPLPARM  02294600
* $L6=ANVALGNL, JBB4422, 910318, PD31BV: NUCLSTXX SUPPORT        @L6A   02294700
* $L7=PR422   , JBB4422  910503  PD16EI: SHOWHDR format complete @L7A   02294800
* $P3=PKB0881 , HBB4430, 920318, PD16ES: Support IPL w/ 2Gb real        02295000
* $P4=PKB1402  HBB4430  920428  PD16EJ:  Detect mismatched IPL Text     02295100
* $01=OY55430 , HBB4430, 920908, PD16EI: SUPPORT FOR OY55397     @01A   02295200
* $P5=PIG4098 , HBB5510, 930315, PD16KR: Allow nucleus dataset to       02295300
*                                        reside off of SYSRES pack.     02295400
* $L8=PR510   , HBB5510, 930614, PD16ST: SHOWHDR update                 02295500
* $L9=CLONE    HBB5520  940401  PD16EJ:  Cloning support.               02295600
* $P6=PQC1116 , HBB6603, 960502, B7HG2M: IPL Statistics support         02296400
* $02=OW38549  HBB6603 990430 PDLE:   FICON Support                     02296600
* $LA=64BITIPL HBB7703 981204 PD00XB: ESAME                             02296800
* $LB=DYCHM    HBB7703 991231 PD00KB: Dynamic Chpid Management   @LBA   02297000
* $03=OW45443  HBB6606 000717 PD00XB: MTLSHARE                          02297100
* $04=OW45011  HBB6606 000630 PDHC:   Limit ESTORE to 64G in            02297390
*                                     ESA/390                    @04A   02297580
** END OF SPECIFICATIONS ********************************************/  02298000
*                                                                       02298800
* %GOTO IVTPLS2;                                                        02300000
*                                                                       02316600
*                                                                       02333200
IVT      DSECT ,                                                        02350000
         DS    0D                                                       02400000
IVTID    DS    CL4                 CONTROL BLOCK ID ('IVT ')            02450000
IVTLEN   DS    F                   LENGTH OF THE IVT                    02500000
IVTIPLD  DS    0XL20               FIELDS FORMERLY IN IPLDATA           02550000
IVTDVSER DS    CL6                 IPL UNIT - VOLUME SERIAL             02600000
IVTDVTOC DS    CL5                          - VTOC CCHHR                02650000
IVTR00E  DS    CL1                 RESERVED                        @D4C 02700000
IVTDNUCS DS    F                   SYS1.NUCLEUS DS - START CCHH         02750000
IVTDNUCE DS    F                                   - END CCHH           02800000
IVTSCHAN DS    0F                  I/O DEVICE SUBCHANNEL ADDRESS   @L5C 02835700
IVTR01C  DS    H                   RESERVED                        @D3A 02871400
IVTSCHN  DS    H                   SUBCHANNEL NUMBER               @L5A 02907100
IVTDEVSZ DS    0F                  I/O DEVICE CHARACTERISTICS      @L3C 02942800
IVTCYLDR DS    H                   I/O DEVICE CYLINDERS PER VOLUME @L3C 02978500
IVTTRACK DS    H                   I/O DEVICE TRACKS PER CYLINDER  @L3C 03014200
IVTWRKSP DS    0F                  BOUNDS OF THE IPL WORK SPACE         03050000
IVTWSHI  DS    A                   ADDR OF END OF IPL WORK SPACE        03100000
IVTWSLOW DS    A                   ADDR OF START OF IPL WORK SPACE      03150000
*                                                                       03156200
* NOTE: ONCE PAGES HAVE BEEN TAKEN FROM THE IPL WORKSPACE AND           03162400
*       BACKED BY REAL, THEY MUST NOT BE RETURNED TO THE IPL            03168600
*       WORKSPACE.  FURTHER, THEY MUST NOT BE RELEASED IN ANY           03174800
*       FASHION UNTIL THEY ARE RELEASED IN NORMAL PROCESSING AT         03181000
*       THE END OF IPL.                                                 03187200
*                                                                  @L2A 03193400
IVTWSBND DS    0F                  BOUNDS OF UNUSED IPL WORK SPACE      03200000
IVTWSAVH DS    A                   ADDR OF HIGH UNUSED WORK SPACE BYTE  03250000
IVTWSTLO EQU   IVTWSAVH,4,C'A'     ALIAS FOR IVTWSAVH                   03300000
IVTWSAVL DS    A                   ADDR OF LOW UNUSED WORK SPACE BYTE   03350000
IVTWSBLO EQU   IVTWSAVL,4,C'A'     ALIAS FOR IVTWSAVL                   03400000
IVTRONS  DS    A                   READ/ONLY NUCLEUS START ADDRESS @L1C 03450000
IVTRONE  DS    A                   READ/ONLY NUCLEUS END ADDRESS   @L1C 03500000
IVTRWNS  DS    A                   READ/WRITE NUCLEUS START ADDR   @L1C 03550000
IVTRWNE  DS    A                   READ/WRITE NUCLEUS END ADDRESS  @L1C 03600000
IVTERWNS DS    A                   EXTENDED READ/WRITE NUCLEUS START    03650000
*                                  ADDRESS                         @L1C 03700000
IVTERWNE DS    A                   EXTENDED READ/WRITE NUCLEUS END      03750000
*                                  ADDRESS                         @L1C 03800000
IVTNP0AD DS    A                   ADDRESS OF IEAVNIP0                  03850000
IVTNP0NO DS    F                   LENGTH OF IEAVNIP0 AND IEAVNIPH      03883300
*                                  COMBINED.                            03916600
IVTRPSA  DS    A                   ADDRESS OF ABSOLUTE PSA              03950000
IVTASQA  DS    A                   ADDRESS OF INITIAL SQA               04000000
IVTSQALN DS    F                   LENGTH OF INITIAL SQA IN BYTES       04050000
IVTAESQA DS    A                   ADDRESS OF EXTENDED SQA              04100000
IVTESQAL DS    F                   LENGTH OF EXTENDED SQA IN BYTES      04150000
IVT245A  DS    A                   ADDRESS OF 245 UNUSED SPACE          04200000
IVT245V  DS    F                   LENGTH OF 245 UNUSED SPACE IN BYTES  04250000
IVTE245A DS    A                   ADDRESS OF E245 UNUSED SPACE         04300000
IVTE245V DS    F                   LENGTH OF 245 UNUSED SPACE IN BYTES  04350000
IVT239A  DS    A                   ADDRESS OF 239 UNUSED SPACE          04400000
IVT239V  DS    F                   LENGTH OF 239 UNUSED SPACE IN BYTES  04450000
IVTE239A DS    A                   ADDRESS OF E239 UNUSED SPACE         04500000
IVTE239V DS    F                   LENGTH OF 239 UNUSED SPACE IN BYTES  04550000
IVTALSQA DS    A                   ADDRESS OF TEMPORARY LSQA            04600000
IVTLSQLN DS    F                   LENGTH OF TEMPORARY LSQA             04650000
IVTELSQA DS    A                   ADDRESS OF EXTENDED LSAQ             04700000
IVTELSLN DS    F                   LENGTH OF EXTENDED LSQA IN BYTES     04750000
IVTSCPIN DS    A                   ADDRESS OF SCPINFO RESPONSE          04800000
IVTTOPQ  DS    A                   ADDRESS OF ORIGINAL AVAILBLE Q  @H1A 04850000
IVTFLAGS DS    0F                  IPL FLAG WORD                   @L9C 04883300
IVTFLGS1 DS    XL1                 Flags Byte 1                    @L9A 04916600
IVTSVPRC EQU   X'80'               SERVICE PROCESSOR SUPPORTED     @H1A 04950000
IVTSUNRF EQU   X'40'               SUPPRESS NO RECORD FOUND WAIT   @L3A 04956200
*                                    STATE                         @L3A 04962400
IVTNRF   EQU   X'20'               NO RECORD FOUND                 @L3A 04968600
IVTSUUE  EQU   X'10'               SUPPRESS UNIT EXCEPTION WAIT        *04974800
                                   STATE                           @L2A 04981000
IVTUE    EQU   X'08'               UNIT EXCEPTION                  @L2A 04987200
IVTIODF  EQU   X'04'               IODF IPL PATH BEING TAKEN       @L3A 04993400
IVTIPLPR EQU   X'02'               SYSN.IPLPARM USED FOR IPL       @P2A 04995600
*                                  PARAMETERS                           04997800
IVTFLGS2 DS    XL1                 Flags Byte 2                    @L9A 04998100
IVTVM    EQU   X'80'               MVS is a Guest under VM.        @L9A 04998400
IVTVMXA  EQU   X'40'               MVS is a Guest under VM/XA.     @L9A 04998700
*                                  NOTE: IVTVM will also be on.         04999000
IVTNORWS EQU   X'20'               If on, indicates that all I/O        04999900
*                                  issued by IPL will set the           05000800
*                                  ORBY bit in the ORB.            @02A 05001700
IVTNOTOK EQU   X'10'               No HW token                     @LBA 05001900
IVTNDCMF EQU   X'08'               No DCM facility                 @LBA 05002100
IVTFLGS3 DS    XL1                 Flags Byte 3                    @L9A 05002300
         ORG   IVTFLGS3                                                 05003900
IVTARCH  DS    XL1                 ARCH info. Mapped like FLCARCH       05008500
IVTEMEMA EQU   X'80'               ESAME on real machine $SCAFFOLD @LAA 05022300
IVTESAME EQU   X'01'               ESAME                           @LAA 05036100
IVTFLGS4 DS    XL1                 Flags Byte 4                    @LAA 05037600
         ORG   IVTFLGS4                                                 05039100
IVTARCHT DS    XL1                 Temporary IVTARCH until the DAT      05040600
*                                  tables are set up properly           05042100
*                                  Mapped the same as IVTARCH.     @LAA 05043600
IVTNLLEF DS    A                   ADDRESS OF FIRST NUCLEUS LOAD LIST   05045300
*                                  ELEMENT (NLLE)                  @L1A 05050000
IVTNLLEL DS    A                   ADDRESS OF LAST NUCLEUS LOAD LIST    05100000
*                                  ELEMENT (NLLE)                  @L1A 05150000
IVTNUCMP DS    A                   ADDRESS OF THE NUCLEUS MAP      @L1A 05200000
IVTNUCMS DS    F                   LENGTH OF THE NUCLEUS MAP       @L1A 05250000
IVTILOAD DS    A                   ENTRY POINT OF MODULE IPXILOAD  @L2C 05300000
IVTIICAP DS    A                   ADDRESS OF THE IOS IRIM              05350000
*                                  COMMUNICATION AREA (IICA)       @L3C 05400000
IVTLPALP DS    A                   ADDRESS OF THE LPA DEVICE SUPPORT    05450000
*                                  MODULE LIST                     @L1A 05500000
IVTLPALL DS    F                   LENGTH OF THE LPA DEVICE SUPPORT     05550000
*                                  MODULE LIST                     @L1A 05600000
IVT35AD  DS    A                   ENTRY POINT OF THE MODULE            05650000
*                                  IEAIPL35                        @D2A 05700000
IVTPARMD DS    CL8                 LOAD FRAME PARAMETER DEFAULTS        05750000
*                                    (MAPPED BY IVTPARMS)          @D1A 05800000
IVTPARML DS    CL8                 LOAD FRAME PARAMETER SPECIFICATIONS  05850000
*                                    (MAPPED BY IVTPARMS)          @D1A 05900000
IVTPARMM DS    CL8                 MERGED LOAD FRAME PARAMETER          05950000
IVTMQHP  DS    A                   ADDRESS OF THE IPL MESSAGE           06000000
*                                  QUEUE HEADER.                   @D2A 06050000
IVTPRFX  DS    CL8                 PREFIX OF SYSN.IPLPARM DATASET  @P2A 06055600
*                                  USED DURING IPL (VALID ONLY IF       06061200
*                                  IVTIPLPR SET)                        06066800
IVTA245  DS    F                   AMOUNT OF ADDITIONAL SQA THAT   @L3A 06072500
*                                    MUST BE ADDED TO INITIAL      @L3A 06080000
*                                    ALLOCATION                    @L3A 06087500
IVTAE245 DS    F                   AMOUNT OF ADDITIONAL ESQA THAT  @L3A 06095000
*                                    MUST BE ADDED TO INITIAL      @L3A 06102500
*                                    ALLOCATION                    @L3A 06110000
IVTAVT   DS    A                   ADDRESS OF ALLOCATION VECTOR    @L3A 06117500
*                                  TABLE (AVT)                     @L3A 06125000
IVTNCRP  DS    A                   ADDRESS OF NIP CONSOLE RECORDS  @L3A 06132500
IVTNCRC  DS    H                   NUMBER OF NIP CONSOLE RECORDS   @L3A 06140000
IVTNCRL  DS    H                   LENGTH OF NIP CONSOLE RECORD    @L3A 06147500
IVTLOAD  DS    A                   ADDRESS OF LOADXX BUFFER        @L3A 06155000
IVTLOADL DS    F                   LENGTH OF LOADXX BUFFER         @L3A 06162500
IVTIOCID DS    CL2                 IO CONFIGURATION ID             @D4A 06167500
IVTIODFD DS    H                   IODF DATASET UNIT ADDRESS       @P2C 06172500
IVTNDIRR DS    A                   REAL ADDR OF INDEX TO NUCLEUS   @L3A 06177500
*                                  DIRECTORY                       @L3A 06185000
IVTI50PS DS    A                   ADDRESS OF IPXI50PS             @D3A 06186000
IVTIOBFA DS    A                   ADDRESS OF IO BUFFER OBTAINED   @D3A 06187000
*                                  BY IEAIPL50                     @D3A 06188000
IVTIOBFL DS    F                   LENGTH OF IO BUFFER OBTAINED    @D3A 06189000
*                                  BY IEAIPL50                     @D3A 06190000
IVTNP0SZ DS    F                   LENGTH OF IEAVNIP0 IN BYTES     @P1C 06190200
IVTEINFO DS    0CL16               INFORMATION FOR VSD ABOUT       @P1A 06190400
*                                  THE MODULE BEING LOADED         @P1A 06190600
IVTENAME DS    CL8                 NAME OF THE MODULE BEING LOADED @P1A 06190800
IVTEMALP DS    0F                  ADDRESS MODE AND LOAD POINT     @P1A 06191000
IVTEMODE EQU   X'80'               ADDRESS MODE OF THE MODULE      @P1A 06191200
IVTELDPT DS    F                   MODULE LOAD POINT               @P1A 06191400
IVTENTLN DS    F                   LENGTH OF THE MODULE            @P1A 06191600
IVTEXNLF DS    A                   ADDRESS OF FIRST EXCLUDE NUCLEUS     06192400
*                                  LOAD LIST ELEMENT (NLLE)        @L6A 06193200
IVTEXNLL DS    A                   ADDRESS OF LAST EXCLUDE NUCLEUS      06194000
*                                  LOAD LIST ELEMENT (NLLE)        @L6A 06194800
IVTNLID  DS    CL2                 NUCLSTXX ID                     @L6A 06195600
IVTNCXID DS    X                   Nucleus extension ID.                06195700
*                          This is initialized to the same value as     06195800
*                          used for the nucleus, but can be changed     06195900
*                          during NUCLSTxx processing.             @LAA 06196100
IVTARCLV DS    X                   Architecture Level via archlvl       06196200
*                                  keyword of LOADXX               @LBA 06196300
IVTESQAB DS    F                   TOTAL ADDITIONAL ESQA BUFFER    @01A 06196600
*                                  FOR EACH SUBCHANNEL INSTALLED        06196800
IVTOMESI DS    F                   When non-zero, orig SCCBMESI    @04A 06196930
IVTONXSB DS    F                   When non-zero, orig SCCBNXSB    @04A 06196960
IVTR148  DS    XL1                 Reserved                        @03C 06197020
IVTMTLSH DS    CL1                 MTLSHARE value                  @03A 06197040
IVTOSAR  DS    XL2                 When non-zero, original SCCBSAR @LxA 06197100
IVTOSAIX DS    F                   When non-zero, orig SCCBSAIX    @LxA 06197200
IVTALTPM DS    CL16                Alternate Parmlib name          @L9A 06197300
IVTIPLDV DS    0F                  IPL DEVICE SUBCHANNEL ADDRESS   @P5A 06197400
IVTRIPL  DS    H                   RESERVED                        @P5A 06197500
IVTSIPL  DS    H                   SUBCHANNEL NUMBER               @P5A 06197600
IVTNCUCB DC    A(0)                UCB ADDRESS FOR NUCLEUS DS      @P5A 06197700
IVTALTNC DS    0CL44               Alternate nucleus diagnose area @L9A 06197800
         DS    F                   nucleus schib area.  gets moved to   06197900
*                                  ivtschan, by IEAIPL00. DO NOT        06198000
*                                  use.                            @L9A 06198100
         DS    CL1                 length of alternate nucleus dataset  06198200
*                                  name... DO NOT USE.             @L9A 06198300
IVTNUCNM DS    CL36                NUCLEUS DATASET NAME            @P5A 06198400
IVTALTPD DS    CL2                 Alternate nucleus device number @L9A 06198500
IVTR193  DS    CL1                 Reserved.                       @L9A 06198600
IVTIPST  DS    A                   Address of IPST                 @P6A 06198700
         DS    CL16                Reserved                        @LAA 06198800
IVTIRIML DS    0CL96               AREA IN WHICH TO LOAD IEAIPL01  @LAC 06198900
IVT01NAM DS    CL8                 'IEAIPL01'                      @P4A 06199000
IVT01DAT DS    CL8                 COMPILE DATE OF IEAIPL01        @P4A 06199200
IVT01FMD DS    CL8                 FMID COMPILE DATE OF IEAIPL01   @P4A 06199400
IVTIRIMD DS    CL72                IRIM SUFFIX DATA AREA           @LAC 06199600
*                                  MUST BE THE LAST DECLARE IN THE IVT  06199800
IVTEND   DS    0D                  END OF THE IPL VECTOR TABLE          06200000
IVTPARMS DSECT ,                   LOAD FRAME PARAMETER MAP        @D1A 06250000
IVTIODFU DS    CL4                 IODF DATASET UNIT ADDRESS IN    @P2C 06283300
*                                  EBCDIC                               06316600
IVTLOADS DS    CL2                 LOADXX MEMBER SUFFIX            @D3C 06349900
IVTPROMT DS    CL1                 PROMPT OPERATOR FLAG            @D3A 06383200
IVTNUCID DS    CL1                 IEANUC0X MEMBER SUFFIX          @D4C 06416500
IVT      DSECT ,                   REESTABLISH IVT DSECT           @D1A 06450000
IVTNUCDF EQU   C'1'                DEFAULT VALUE FOR IEANUC0X      @D3A 06475000
IVTEPRIV EQU   32*1024*1024        Initial size of extended        @P3A 06481200
*                                  private area                         06487400
IVTHIADR EQU   2147483647          Maximum virtual storage         @P4C 06489500
*                                  address (2*1024*1024*1024-1)         06491600
*                                  This value is hardcoded since ASM-H  06493700
*                                  cannot evaluate the above            06495800
*                                  expression.                          06497900
*   SERVICES AVAILABLE DURING IPL-TIME VIA SVC                          06500000
ISVCXDAP EQU   0                   EXECUTE DA CHANNEL PROGRAM           06550000
ISVCWAIT EQU   1                   ENTER A DISABLED WAIT STATE          06600000
ISVCDAT  EQU   2                   SWITCH TRANSLATION MODE              06650000
ISVCEXIT EQU   3                   EXIT TO CALLER                       06700000
ISVCPGFX EQU   4                   BACK VIRTUAL STORAGE WITH REAL       06750000
ISVCFIND EQU   5                   READ A PDS DIRECTORY ENTRY           06800000
ISVCLOAD EQU   6                   LOAD A MODULE INTO REAL STORAGE      06850000
ISVCSTOR EQU   7                   ALLOCATE CONTIGUOUS REAL             06900000
ISVCCNVT EQU   8                   CONVERT TTR TO CCHHR                 06950000
ISVCSSCH EQU   9                   START SUBCHANNEL                     07000000
ISVCSYNC EQU   10                  CALL THRU THE SVC MECHANISM          07050000
ISVCCSEG EQU   11                  CREATE SEGMENT                       07100000
ISVCCPFX EQU   12                  BACK VIRT STOR W/ CONTIG REAL   @L2A 07112500
ISVCXXDP EQU   13                  EXECUTE DA CHANNEL PROGRAM ON        07125000
*                                  SPECIFIED SUBCHANNEL            @L3A 07137500
         MEND                                                           07150000
*%IVTPLS2: ;                                                            07200000
*   DECLARE                                                             07250000
*     1 IVT BASED BDY(DWORD),      /* IPL VECTOR TABLE               */ 07300000
*       3 IVTID CHAR(4),           /* CONTROL BLOCK ID ('IVT ')      */ 07350000
*       3 IVTLEN BIN,              /* LENGTH OF THE IVT              */ 07400000
*       3 IVTIPLD,                 /* FIELDS FORMERLY IN IPLDATA     */ 07450000
*         5 IVTDVSER CHAR(6),      /* IPL UNIT - VOLUME SERIAL       */ 07500000
*         5 IVTDVTOC CHAR(5),      /*          - VTOC CCHHR          */ 07550000
*         5 IVTR00E  CHAR(1),      /* RESERVED                   @D4C*/ 07600000
*         5 IVTDNUCS CHAR(4),      /* SYS1.NUCLEUS DS - START CCHH   */ 07650000
*         5 IVTDNUCE CHAR(4),      /*                 - END CCHH     */ 07700000
*       3 IVTSCHAN BDY(WORD),      /* I/O DEVICE SUBCHANNEL             07725000
*                                     ADDRESS                    @L5C*/ 07750000
*         5 IVTR01C  BIN(15),      /* RESERVED                   @D3C*/ 07775000
*         5 IVTSCHN  BIN(15),      /* SUBCHANNEL NUMBER          @L5A*/ 07800000
*       3 IVTDEVSZ,                /* I/O DEVICE CHARACTERISTICS @L3C*/ 07825000
*         5 IVTCYLDR BIN(15),      /* I/O DEVICE CYLINDERS ON           07850000
*                                     VOLUME                     @L3C*/ 07875000
*         5 IVTTRACK BIN(15),      /* I/O DEVICE TRACKS PER             07900000
*                                     CYLINDER                   @L3C*/ 07925000
*       3 IVTWRKSP,                /* BOUNDS OF THE IPL WORK SPACE   */ 07950000
*         5 IVTWSHI PTR,           /* ADDR OF END OF IPL WORK SPACE  */ 08000000
*         5 IVTWSLOW PTR,          /* ADDR OF START OF IPL WORK SPACE*/ 08050000
*/*                                                                  */ 08056200
*/* NOTE: ONCE PAGES HAVE BEEN TAKEN FROM THE IPL WORKSPACE AND      */ 08062400
*/*       BACKED BY REAL, THEY MUST NOT BE RETURNED TO THE IPL       */ 08068600
*/*       WORKSPACE.  FURTHER, THEY MUST NOT BE RELEASED IN ANY      */ 08074800
*/*       FASHION UNTIL THEY ARE RELEASED IN NORMAL PROCESSING AT    */ 08081000
*/*       THE END OF IPL.                                            */ 08087200
*/*                                                              @L2A*/ 08093400
*       3 IVTWSBND,                /* BOUNDS OF THE IPL WORK SPACE   */ 08100000
*         5 IVTWSAVH PTR,          /* ADDR OF HIGH UNUSED BYTE IN THE   08150000
*                                     IPL WORK SPACE                 */ 08200000
*           7 IVTWSTLO PTR,        /* ALIAS FOR IVTWSAVH             */ 08250000
*         5 IVTWSAVL PTR,          /* ADDR OF LOW UNUSED BYTE IN THE    08300000
*                                     IPL WORK SPACE                 */ 08350000
*           7 IVTWSBLO PTR,        /* ALIAS FOR IVTWSAVL             */ 08400000
*       3 IVTRONS PTR,             /* READ/ONLY NUCLEUS START ADDRESS   08450000
*                                                                @L1C*/ 08500000
*       3 IVTRONE PTR,             /* READ/ONLY NUCLEUS END ADDRESS     08550000
*                                                                @L1C*/ 08600000
*       3 IVTRWNS PTR,             /* READ/WRITE NUCLEUS START          08650000
*                                     ADDRESS                    @L1C*/ 08700000
*       3 IVTRWNE PTR,             /* READ/WRITE NUCLEUS END ADDRESS    08750000
*                                                                @L1C*/ 08800000
*       3 IVTERWNS PTR,            /* EXTENDED READ/WRITE NUCLEUS       08850000
*                                     START ADDRESS              @L1C*/ 08900000
*       3 IVTERWNE PTR,            /* EXTENDED READ/WRITE NUCLEUS       08950000
*                                     END ADDRESS                @L1C*/ 09000000
*       3 IVTNP0AD PTR,            /* ADDRESS OF IEAVNIP0            */ 09050000
*       3 IVTNP0NO BIN,            /* LENGTH OF IEAVNIP0 AND IEAVNIPH   09083300
*                                     COMBINED.                      */ 09116600
*       3 IVTRPSA PTR,             /* ADDRESS OF ABSOLUTE PSA        */ 09150000
*       3 IVTASQA PTR,             /* ADDRESS OF INITIAL SQA         */ 09200000
*       3 IVTSQALN BIN,            /* LENGTH OF INITIAL SQA IN BYTES */ 09250000
*       3 IVTAESQA PTR,            /* ADDRESS OF EXTENDED SQA        */ 09300000
*       3 IVTESQAL BIN,            /* LENGTH OF EXTENDES SQA IN BYTES*/ 09350000
*       3 IVT245A PTR,             /* ADDRESS OF UNUSED 245 SPACE    */ 09400000
*       3 IVT245V BIN,             /* AMOUNT OF UNUSED 245 IN BYTES  */ 09450000
*       3 IVTE245A PTR,            /* ADDRESS OF UNUSED EXTENDED 245    09500000
*                                     SPACE                          */ 09550000
*       3 IVTE245V BIN,            /* AMOUNT OF UNUSED E245 IN BYTES */ 09600000
*       3 IVT239A PTR,             /* ADDRESS OF UNUSED 239 SPACE    */ 09650000
*       3 IVT239V BIN,             /* AMOUNT OF UNUSED 239 IN BYTES  */ 09700000
*       3 IVTE239A PTR,            /* ADDRESS OF UNUSED EXTENDED 239    09750000
*                                     SPACE                          */ 09800000
*       3 IVTE239V BIN,            /* AMOUNT OF UNUSED E239 IN BYTES */ 09850000
*       3 IVTALSQA PTR,            /* ADDRESS OF TEMPORARY LSQA      */ 09900000
*       3 IVTLSQLN BIN,            /* LENGTH OF TEMPORARY LSQA       */ 09950000
*       3 IVTELSQA PTR,            /* ADDRESS OF EXTENDED LSQA       */ 10000000
*       3 IVTELSLN BIN,            /* LENGTH OF EXTENDED LSQA IN        10050000
*                                     BYTES                          */ 10100000
*       3 IVTSCPIN PTR,            /* ADDRESS OF SCPINFO RESPONSE    */ 10150000
*       3 IVTTOPQ  PTR,            /* ADDRESS OF ORIGINAL AVL Q  @H1A*/ 10200000
*       3 IVTFLAGS BIT(32),        /* IPL FLAG WORD              @H1A*/ 10250000
*        4 IVTFLGS1 CHAR(1),       /* IVT Flags byte 1.          @L9A*/ 10275000
*         5 IVTSVPRC BIT(1),       /* SERVICE PROCESSOR SUPPORTED@H1A*/ 10300000
*         5 IVTSUNRF BIT(1),       /* SUPPRESS NO RECORD FOUND          10306200
*                                     WAIT STATE                 @L3A*/ 10312400
*         5 IVTNRF   BIT(1),       /* NO RECORD FOUND            @L3A*/ 10318600
*         5 IVTSUUE BIT(1),        /* SUPPRESS UNIT EXCEPTION           10324800
*                                     WAIT STATE.                @L2A*/ 10331000
*         5 IVTUE BIT(1),          /* UNIT EXCEPTION OCCURRED    @L2A*/ 10337200
*         5 IVTIODF  BIT(1),       /* IODF IPL PATH BEING TAKEN  @L3A*/ 10343400
*         5 IVTIPLPR BIT(1),       /* SYSN.IPLPARM USED FOR IPL         10345600
*                                     PARAMETERS                 @P2A*/ 10347800
*        4 IVTFLGS2 CHAR(1),       /* IVT Flags byte 2.          @L9A*/ 10348100
*         5 IVTVM    BIT(1),       /* MVS is guest under VM.     @L9A*/ 10348400
*         5 IVTVMXA  BIT(1),       /* MVS is guest under VM/XA          10348700
*                                     NOTE: IVTVM is on also.    @L9A*/ 10349000
*         5 IVTNORWS BIT(1),       /* If on, indicates that all I/O     10350400
*                                     issued by IPL will set the        10350600
*                                     ORBY bit in the ORB.       @02A*/ 10350800
*         5 IVTNOTOK BIT(1),       /* No HW token                @LBA*/ 10351200
*         5 IVTNDCMF BIT(1),       /* No DCM Facility            @LBA*/ 10352200
*        4 IVTFLGS3 CHAR(1),       /* IVT Flags byte 3.          @L9A*/ 10352600
*         5 IVTARCH CHAR(1),       /* Mapped like FLCARCH        @L9A*/ 10356000
*          7 IVTEMEMA BIT(1),      /* $SCAFFOLD                  @LAA*/ 10366100
*          7 * BIT(6),             /*                            @LAA*/ 10374500
*          7 IVTESAME BIT(1),      /*                            @LAA*/ 10382900
*        4 IVTFLGS4 CHAR(1),       /* IVT Flags byte 4.          @L9A*/ 10391300
*         5 IVTARCHT CHAR(1),      /* Temporary IVTARCH until the DAT   10392300
*                                     tables are set. It is mapped      10393300
*                                     the same as IVTARCH        @LAA*/ 10394300
*       3 IVTNLLEF PTR,            /* ADDRESS OF FIRST NUCLEUS LOAD     10395500
*                                     LIST ELEMENT (NLLE)        @L1A*/ 10400000
*       3 IVTNLLEL PTR,            /* ADDRESS OF LAST NUCLEUS LOAD      10450000
*                                     LIST ELEMENT (NLLE)        @L1A*/ 10500000
*       3 IVTNUCMP PTR,            /* ADDRESS OF THE NUCLEUS MAP @L1A*/ 10550000
*       3 IVTNUCMS FIXED,          /* LENGTH OF THE NUCLEUS MAP  @L1A*/ 10600000
*       3 IVTILOAD PTR,            /* ENTRY POINT OF MODULE IPXILOAD    10640000
*                                                                @L2C*/ 10680000
*       3 IVTIICAP PTR,            /* ADDRESS OF THE IOS IRIM           10720000
*                                     COMMUNICATION AREA (IICA)  @L3C*/ 10760000
*       3 IVTLPALP PTR,            /* ADDRESS OF THE LPA DEVICE         10800000
*                                     SUPPORT MODULE LIST        @L1A*/ 10850000
*       3 IVTLPALL FIXED,          /* LENGTH OF THE LPA DEVICE          10900000
*                                     SUPPORT MODULE LIST        @L1A*/ 10950000
*       3 IVT35AD  PTR,            /* ENTRY POINT OF THE MODULE         11000000
*                                     IEAIPL35                   @D2A*/ 11050000
*       3 IVTPARMD CHAR(8),        /* LOAD FRAME PARAMETER DEFAULTS     11100000
*                                       (MAPPED BY IVTPARMS)     @D1A*/ 11150000
*       3 IVTPARML CHAR(8),       /* LOAD FRAME PARAMETER               11200000
*                                       SPECIFICATIONS                  11250000
*                                       (MAPPED BY IVTPARMS)     @D1A*/ 11300000
*       3 IVTPARMM CHAR(8),       /* MERGED LOAD FRAME PARAMETER        11350000
*                                       SPECIFICATIONS                  11400000
*                                       (MAPPED BY IVTPARMS)     @D1A*/ 11450000
*       3 IVTMQHP  PTR,            /* ADDRESS OF THE IPL MESSAGE        11500000
*                                     QUEUE HEADER.              @D2A*/ 11550000
*       3 IVTPRFX  CHAR(8),        /* PREFIX OF SYSN.IPLPARM DATASET    11554600
*                                     USED DURING IPL. (VALID ONLY IF   11559200
*                                     IVTIPLPR SET.)             @P2A*/ 11563800
*       3 IVTA245  BIN,            /* AMOUNT OF ADDITIONAL SQA THAT     11568600
*                                     MUST BE ADDED TO INITIAL          11574800
*                                     ALLOCATION                 @L3A*/ 11581000
*       3 IVTAE245 BIN,            /* AMOUNT OF ADDITIONAL ESQA THAT    11587200
*                                     MUST BE ADDED TO INITIAL          11593400
*                                     ALLOCATION                 @L3A*/ 11599600
*       3 IVTAVT   PTR,            /* ADDRESS OF ALLOCATION VECTOR      11605800
*                                     TABLE (AVT)                @L3A*/ 11612000
*       3 IVTNCRP  PTR,            /* ADDRESS OF NIP CONSOLE RECORDS    11618200
*                                                                @L3A*/ 11624400
*       3 IVTNCRC  BIN(15),        /* NUMBER OF NIP CONSOLE RECORDS     11630600
*                                                                @L3A*/ 11636800
*       3 IVTNCRL  BIN(15),        /* LENGTH OF NIP CONSOLE RECORD      11643000
*                                                                @L3A*/ 11649200
*       3 IVTLOAD  PTR,            /* ADDRESS OF LOADXX BUFFER   @L3A*/ 11655400
*       3 IVTLOADL BIN,            /* LENGTH OF LOADXX BUFFER    @L3A*/ 11661600
*       3 IVTIOCID CHAR(2),        /* IO CONFIGURATION ID        @D4C*/ 11665700
*       3 IVTIODFD FIXED(16),      /* IODF DATASET UNIT ADDRESS  @P2C*/ 11669800
*       3 IVTNDIRR PTR,            /* REAL ADDR OF INDEX TO NUCLEUS     11674000
*                                     DIRECTORY                  @L3A*/ 11680200
*       3 IVTI50PS PTR,            /* ADDRESS OF IPXI50PS        @D3A*/ 11681000
*       3 IVTIOBFA PTR,            /* ADDRESS OF IO BUFFER OBTAINED     11681800
*                                     BY IEAIPL50                @D3A*/ 11682600
*       3 IVTIOBFL FIXED(31),      /* LENGTH OF IO BUFFER OBTAINED      11683400
*                                     BY IEAIPL50                @D3A*/ 11684200
*       3 IVTNP0SZ FIXED(31),      /* LENGTH OF IEAVNIP0 IN BYTES       11684400
*                                                                @P1C*/ 11684600
*       3 IVTEINFO CHAR(16) BDY(WORD), /* INFORMATION FOR VSD ABOUT     11684800
*                                        THE MODULE BEING LOADED @P1A*/ 11685000
*         5 IVTENAME CHAR(8),      /* NAME OF THE MODULE BEING LOADED   11685200
*                                                                @P1A*/ 11685400
*         5 IVTEMALP FIXED(31),    /* ADDRESS MODE + LOAD POINT  @P1A*/ 11685600
*           7 IVTELDPT PTR(31),    /* MODULE LOAD POINT          @P1A*/ 11685800
*             9 IVTEMODE BIT(1),   /* ADDRESS MODE OF THE MODULE @P1A*/ 11686000
*         5 IVTENTLN FIXED(31),    /* LENGTH OF THE MODULE       @P1A*/ 11686200
*       3 IVTEXNLF PTR,            /* ADDRESS OF FIRST EXCLUDE NUCLEUS  11687400
*                                     LOAD LIST ELEMENT (NLLE)   @L6A*/ 11688600
*       3 IVTEXNLL PTR,            /* ADDRESS OF LAST EXCLUDE NUCLEUS   11689800
*                                     LOAD LIST ELEMENT (NLLE)   @L6A*/ 11691000
*       3 IVTNLID  CHAR(2),        /* NUCLSTXX ID                @L6A*/ 11692200
*       3 IVTNCXID CHAR(1),        /* Nucleus extension ID.             11692400
*                          This is initialized to the same value as     11692600
*                          used for the nucleus, but can be changed     11692800
*                          during NUCLSTxx processing.           @LAA*/ 11693000
*       3 IVTARCLV CHAR(1),        /* Architecture level                11693200
*                          (via ARCHLVL keyword of LOADxx)       @LAA*/ 11693600
*       3 IVTESQAB FIXED(31),      /* TOTAL ADDITIONAL ESQA BUFFER FOR  11694000
*                                     EACH SUBCHANNEL INSTALLED. @01A*/ 11694600
*       3 IVTOMESI FIXED(32),      /* When non-zero,                    11694710
*                                     original SCCBMESI          @04A*/ 11694720
*       3 IVTONXSB FIXED(32),      /* When non-zero,                    11694730
*                                     original SCCBNXSB          @04A*/ 11694740
*       3 IVTR148 CHAR(1),         /* Reserved                   @03C*/ 11694820
*       3 IVTMTLSH CHAR(1),        /* MTLSHARE value             @03A*/ 11694840
*       3 IVTOSAR FIXED(16),       /* When non-zero,                    11694900
*                                     original SCCBSAR           @LxA*/ 11695000
*       3 IVTOSAIX FIXED(32),      /* When non-zero,                    11695100
*                                     original SCCBSAIX          @LxA*/ 11695200
*       3 IVTALTPM CHAR(16),       /* Alternate Parmlib Name     @L9A*/ 11695300
*       3 IVTIPLDV BDY(WORD),      /* IPL DEVICE SUBCHANNEL             11695400
*                                     ADDRESS                    @P5A*/ 11695600
*         5 IVTRIPL  BIN(15),      /* RESERVED                   @P5A*/ 11695800
*         5 IVTSIPL  BIN(15),      /* SUBCHANNEL NUMBER          @P5A*/ 11696000
*       3 IVTNCUCB PTR(31),        /* UCB ADDRESS FOR NUCLEUS DS @P5A*/ 11696200
*       3 IVTALTNC CHAR(44) BDY(WORD), /* Diagnose area for alternate   11696300
*                                     nucleus support.           @L9A*/ 11696400
*         4 * BIT(32),             /* nucleus schib number.      @L9A*/ 11696500
*         4 * FIXED(8),            /* length of alternate nucleus       11696600
*                                     dataset name.              @L9A*/ 11696700
*         4 IVTNUCNM CHAR(36),     /* NUCLEUS DATASET NAME       @L9C*/ 11696800
*         4 IVTALTPD CHAR(2),      /* Nucleus dataset device no. @L9A*/ 11696900
*         4 IVTR193 CHAR(1),       /* RESERVED                   @L9A*/ 11697000
*       3 IVTIPST  PTR(31),        /* Address of IPST            @P6A*/ 11697100
*       3 * CHAR(16),              /* Reserved                   @LAA*/ 11697300
*       3 IVTIRIML CHAR(96),       /* AREA IN WHICH TO LOAD IEAIPL01 -  11697500
*                                     MUST BE THE LAST DECLARE IN       11697700
*                                     THE IVT                    @LAC*/ 11698100
*         5  IVT01NAM CHAR(8),     /* 'IEAIPL01' MOD ID          @P4A*/ 11698500
*         5  IVT01DAT CHAR(8),     /* COMPILE DATE OF IEAIPL01   @P4A*/ 11698800
*         5  IVT01FMD CHAR(8),     /* FMID OF IEAIPL01           @P4A*/ 11699100
*         5  IVTIRIMD CHAR(72),    /* IRIM SUFFIX DATA AREA      @LAC*/ 11699500
*      2 IVTEND CHAR(0) BDY(DWORD);  /* END OF THE IVT               */ 11700000
*                                                                       11725000
*   DECLARE                                                             11750000
*     1 IVTPARMS BASED,           /* LOAD FRAME PARAMETER MAP    @D1A*/ 11770800
*        4 IVTIODFU  CHAR(4),     /* IODF DATASET UNIT ADDRESS          11791600
*                                    IN EBCDIC                   @P2C*/ 11812400
*        4 IVTLOADS  CHAR(2),     /* LOADXX MEMBER SUFFIX        @D3C*/ 11833200
*        4 IVTPROMT  CHAR(1),     /* PROMPT OPERATOR FLAG        @D3A*/ 11854000
*        4 IVTNUCID  CHAR(1);     /* IEANUC0X MEMBER SUFFIX      @D4C*/ 11874800
*                                                                       11895600
*   DECLARE                                                             11916400
*     IVTNUCDF CHAR(1) CONSTANT('1'); /* DEFAULT FOR IEANUC0X    @D3A*/ 11937200
*                                                                       11958000
*   DECLARE                                                             11961400
*     IVTEPRIV CONSTANT(32*1024*1024),/* Initial size of extended       11964800
*                                        private area            @P3A*/ 11968200
*     IVTHIADR CONSTANT(2*1024*1024*1024-1);/* Maximum virtual storage  11971600
*                                              address           @P3A*/ 11975000
*                                                                       11978800
*                                                                       11989400
* /* SERVICES AVAILABLE DURING IPL-TIME VIA SVC                      */ 12000000
*   DECLARE                                                             12050000
*     ISVCXDAP CONSTANT(0),         /* EXECUTE DA CHANNEL PROGRAM    */ 12100000
*     ISVCWAIT CONSTANT(1),         /* ENTER A DISABLED WAIT STATE   */ 12150000
*     ISVCDAT CONSTANT(2),          /* SWITCH TRANSLATION MODE       */ 12200000
*     ISVCEXIT CONSTANT(3),         /* EXIT TO CALLER                */ 12250000
*     ISVCPGFX CONSTANT(4),         /* BACK VIRTUAL STORAGE WITH REAL*/ 12300000
*     ISVCFIND CONSTANT(5),         /* READ A PDS DIRECTORY ENTRY    */ 12350000
*     ISVCLOAD CONSTANT(6),         /* LOAD A MODULE INTO REAL STORE */ 12400000
*     ISVCSTOR CONSTANT(7),         /* ALLOCATE CONTIGUOUS REAL      */ 12450000
*     ISVCCNVT CONSTANT(8),         /* CONVERT TTR TO CCHHR          */ 12500000
*     ISVCSSCH CONSTANT(9),         /* START SUBCHANNEL              */ 12550000
*     ISVCSYNC CONSTANT(10),        /* CALL THRU THE SVC MECHANISM   */ 12600000
*     ISVCCSEG CONSTANT(11),        /* CREATE SEGMENT                */ 12650000
*     ISVCCPFX CONSTANT(12),        /* BACK VIRTUAL STORAGE WITH        12700000
*                                      CONTIGUOUS REAL.          @L2A*/ 12750000
*     ISVCXXDP CONSTANT(13);        /* EXECUTE DA CHANNEL PROGRAM ON    12800000
*                                      SPECIFIED SUBCHANNEL      @L3A*/ 12850000
