*        %GOTO PLSLTE;   /*                                             00020000
         MACRO                                                          00070000
         IHALTE                                                         00120000
**/                                                                     00170000
*%PLSLTE : ;                                                            00220000
*/********************************************************************/ 00270000
*/*                                                                  */ 00320000
*/*     LINKAGE TABLE ENTRY (LTE) DESCRIPTION                        */ 00370000
*/*                                                                  */ 00395000
*/*  MACRO NAME = IHALTE                                             */ 00420000
*/*                                                                  */ 00445000
*/*  MACDATE = 01/04/80                                              */ 00470000
*/*                                                                  */ 00495000
*/*  COPYRIGHT =                                                     */ 00520000
*/*      5740-XYN COPYRIGHT IBM CORP. 1980,                          */ 00545000
*/*      LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,                 */ 00570000
*/*      REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER                 */ 00620000
*/*      G120-2083.                                                  */ 00670000
*/*                                                                  */ 00720000
*/*  STATUS =                                                        */ 00922000
*/*      OS/VS2 JBB1226                                              */ 00924000
*/*                                                                  */ 00926000
*/*  FUNCTION =                                                      */ 00928000
*/*      DESCRIBES AN ENTRY IN THE LINKAGE TABLE. EACH ADDRESS       */ 00930000
*/*      SPACE WILL BE CONNECTED TO A LINKAGE TABLE IN THE PC/AUTH   */ 00931000
*/*      LSQA.                                                       */ 00932000
*/*                                                                  */ 00934000
*/*  METHOD OF ACCESS                                                */ 00936000
*/*      BAL - A DSECT IS PRODUCED, PERFORM USING ON LTE             */ 00936700
*/*      PL/S - LTE IS DECLARED AS BASED STRUCTURE, LTEPTR           */ 00937400
*/*             MUST BE DECLARED                                     */ 00938100
*/*                                                                  */ 00938800
*/*  CREATED BY =                                                    */ 00939500
*/*      THE SYSTEM LINKAGE TABLE IS CREATED BY IEAVXMAS DURING      */ 00940200
*/*      INITIALIZATION OF THE PC/AUTH ADDRESS SPACE. THE ENTRY      */ 00940500
*/*      TABLE CONNECT SERVICE CREATES LINKAGE TABLES FOR NON-SYSTEM */ 00940800
*/*      CONNECTIONS. ENTRY CONTENTS ARE CHANGED BY THE ENTRY TABLE  */ 00941100
*/*      CONNECT AND DISCONNECT SERVICE ROUTINES (IEAVXECO/IEAVXEDI).*/ 00941400
*/*                                                                  */ 00941700
*/*  DELETED BY =                                                    */ 00942000
*/*      THE LINKAGE TABLE FOR A PARTICULAR MEMORY IS FREED ON       */ 00942300
*/*      TERMINATION OF THE MEMORY IF IT IS NOT THE SYSTEM           */ 00942600
*/*      LINKAGE TABLE.                                              */ 00942900
*/*                                                                  */ 00944400
*/*  POINTED TO BY =                                                 */ 00945100
*/*      THE LINKAGE TABLE IS POINTED TO BY THE ASCB FIELD           */ 00945800
*/*      ASCBLTOV (VIRTUAL ADDRESS) AND THE ASTE FIELD ASTELTD (READ */ 00946500
*/*      ADDRESS). THE ASTELTD FIELD ALSO CONTAINS THE LENGTH OF     */ 00947600
*/*      THE TABLE.                                                  */ 00948700
*/*                                                                  */ 00950000
*/*  SERIALIZATION =                                                 */ 00952000
*/*      LOCAL LOCK OF THE PC /AUTH SERVICES ADDRESS SPACE.          */ 00954000
*/*                                                                  */ 00974000
*/*  CHANGE ACTIVITY = THIS MACRO IS NEW FOR OS/VS2 JBB1226.         */ 00980600
*/*                                                                  */ 00987200
*/********************************************************************/ 00994000
*/*A 000000-999999                                           @G382PXH*/ 01014000
*        %GOTO PLSLTE1; /*                                              01034000
LTE      DSECT                                                          01054000
         DS    0F             LINKAGE TABLE ENTRY DESCRIPTION           01074000
LTEETR   DS    0F             REAL ADDRESS OF ENTRY TABLE.              01170000
*                                LOW ORDER 6 BITS CONTAIN THE LENGTH    01220000
*                                AND MUST BE ZEROED TO USE THIS AS AN   01270000
*                                ENTRY TABLE ADDRESS                    01320000
LTEIBYTE DS    B              BYTE NAME CONTAINING INVALID FLAG         01370000
LTEINV   EQU   X'80'          INVALID ENTRY FLAG                        01420000
         DS    CL2                                                      01450000
LTEETLEN DS    B              THE NUMBER IN THE LAST SIX BITS PLUS      01480000
*                             ONE, MULTIPLIED BY FOUR GIVES THE NUMBER  01500000
*                             OF ENTRIES IN THE TABLE.                  01520000
         MEND  , */                                                     01570000
*%PLSLTE1: ;                                                            01600000
* DCL  1 LTE BASED(LTEPTR) BDY(WORD), /* LINKAGE TABLE ENTRY            01630000
*                                     DESCRIPTION                    */ 01770000
*        3 LTEETR   FIXED(32),     /* REAL ADDRESS OF ENTRY             01820000
*                                     TABLE. LENGTH IN LOW ORDER 6      01870000
*                                     BITS MUST BE ZEROED TO USE THIS   01903300
*                                     AS AN ENTRY TABLE ADDRESS      */ 01936600
*          5 LTEIBYTE BIT(8),      /* FLAG CONTAINS INVALID FLAG     */ 01970000
*            7 LTEINV BIT(1),      /* INVALID ENTRY FLAG             */ 02020000
*          5 *      CHAR(2),       /* PART OF ET ADDRESS - NOT          02070000
*                                     REFERENCABLE ALONE             */ 02120000
*          5 LTEETLEN  BIT(8);     /* THE NUMBER IN THE LAST SIX BITS   02170000
*                                     PLUS ONE MULTIPLIED BY FOUR       02220000
*                                     GIVES THE NUMBER OF ENTRIES IN    02270000
*                                     THE TABLE                      */ 02320013
