*                                                                       00050000
* %DCL IHALCCX_INCLUDED CHAR EXT;                                       00100000
* %DEACTIVATE IHALCCX_INCLUDED;                                         00150000
* %IF IHALCCX_INCLUDED = '' %THEN                                       00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 98328. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHALCCX &DSECT=YES,&LIST=YES,&TITLE=YES,&LCCX=YES              00450000
         GBLC  &IHALCCX_INCLUDED                                        00500000
         GBLC  &ZCBPRINT                                                00550000
&IHALCCX_INCLUDED SETC 'YES'                                            00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'IHALCCX  - Extended Status Saving Work Area               '   00750000
.P5      ANOP                                                           00800000
**/ IHALCCX_1:;                                                         00850000
*/* START OF SPECIFICATIONS ******************************************* 00900000
*                                                                       00950000
*  **PROPRIETARY_STATEMENT********************************************  01000000
***01* PROPRIETARY STATEMENT=                                        *  01050000
*                                                                    *  01100000
*                                                                    *  01150000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01200000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01250000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  01300000
*                                                                    *  01350000
*   STATUS= HBB7703                                                  *  01400000
*                                                                    *  01450000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01500000
*                                                                       01550000
*01* DESCRIPTIVE NAME:  Extended Status Saving Work Area                01600000
*02*  ACRONYM:  LCCX                                                    01650000
*                                                                       01700000
*01* MACRO NAME:  IHALCCX                                               01750000
*                                                                       01800000
*01* EXTERNAL CLASSIFICATION: DMTI                                      01850000
*01* END OF EXTERNAL CLASSIFICATION:                                    01900000
*                                                                       01950000
*01* DSECT NAME:                                                        02000000
*     LCCX                                                              02050000
*                                                                       02100000
*01* COMPONENT:  Supervisor Control (SC1C5)                             02150000
*                                                                       02200000
*01* EYE-CATCHER:  LCCX                                                 02250000
*02*  OFFSET:  X'6C0'                                                   02300000
*02*  LENGTH:  4                                                        02350000
*                                                                       02400000
*01* STORAGE ATTRIBUTES:                                                02450000
*02*  SUBPOOL:  239                                                     02500000
*02*  KEY:      0                                                       02550000
*02*  RESIDENCY:  Above 16M                                             02600000
*                                                                       02650000
*01* SIZE:                                                              02700000
*            LCCX -- X'0720' bytes                                      02750000
*                                                                       03150000
*01* CREATED BY:                                                        03200000
*     IEAVNIP0 (ipl CPU), IEEVCPRA (other CPU)                          03250000
*                                                                       03300000
*01* POINTED TO BY:                                                     03350000
*     LCCALCCX (virtual)                                                03400000
*     LCCALCXR (real)                                                   03450000
*                                                                       03500000
*01* SERIALIZATION:                                                     03550000
*     Disablement                                                       03600000
*                                                                       03650000
*01* FUNCTION:                                                          03700000
*02* Maps the area used for extended status saving things               03750000
*                                                                       03800000
*                                                                       03850000
*01* METHOD OF ACCESS:                                                  03900000
*02*  ASM:                                                              03950000
*      IHALCCX                                                          04000000
*           DSECT=YES|NO  -- Request DSECT definition                   04050000
*           LCCX=YES|NO|COND -- Request Header record mapping           04100000
*                            USING on LCCX                              04150000
*     Default: DSECT=YES,LCCX=YES                                       04200000
*     Notes: name=YES  => expand                                        04250000
*            name=NO   => do not expand                                 04300000
*            name=COND => expand only if DSECT=YES                      04350000
*                                                                       04400000
*02*  PL/X:                                                             04450000
*      %INCLUDE SYSLIB(IHALCCX)                                         04500000
*                                                                       04550000
*01* DELETED BY:  None                                                  04600000
*                                                                       04650000
*01* FREQUENCY:  One per CPU                                            04700000
*                                                                       04750000
*01* DEPENDENCIES:                                                      04800000
*        1. The LCCX may only be touched while disabled.                04850000
*        2. The LCCX must be contained on one page, so that             04900000
*           IEAVEPCO can reference it dat-off when given its real       04950000
*           address (from LCCAESWR).                                    05000000
*        3. The LCCX must be in fetch-protected storage since it        05050000
*           contains residual FP register values.                       05100000
*                                                                       05150000
*01* DISTRIBUTION LIBRARY:  AINTLIB                                     05200000
*                                                                       05250000
*01* CHANGE ACTIVITY:                                                   05300000
*   $L0=64BITCBG HBB7703  971101  PD00XB:  64-bit GPRs                  05350000
*   $L1=64BITSUP HBB7703  971101  PD00XB:  64-bit GPRs                  05400000
*                                                                       05450000
* END OF SPECIFICATIONS *********************************************/  05500000
*% /*                                                                   05550000
.P0      ANOP                                                           05600000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05650000
         AIF   ('&LIST' EQ 'YES').P2                                    05700000
.P1      ANOP                                                           05750000
         PUSH  PRINT                                                    05800000
         PRINT OFF                                                      05850000
.P2      ANOP                                                           05900000
         AIF   ('&LCCX' EQ 'NO').L0002                                  05950000
         AIF   ('&DSECT' EQ 'YES').L0003                                06000000
         AIF   ('&LCCX' NE 'YES').L0002                                 06050000
LCCX     DS    0D                                                       06100000
         AGO   .L0004                                                   06150000
.L0003   ANOP                                                           06200000
LCCX     DSECT                                                          06250000
.L0004   ANOP                                                           06300000
LCCXFPWA DS    1CL0512   The FPWA is mapped here                        06350000
LCCXLCCAP64H1 DS 1CL0064 Program FLIH recursion 64-bit GPR high-order  *06400000
                         half savearea 1                                06450000
LCCXLCCAP64H2 DS 1CL0064 Program FLIH mainline 64-bit GPR high-order   *06500000
                         half savearea 2                                06550000
LCCXLCCAP64H3 DS 1CL0064 Program FLIH recursion MC access 64-bit GPR   *06600000
                         high-order half savearea 3                     06650000
LCCXLCCAP64H4 DS 1CL0064 Program FLIH 64-bit GPR high-order half       *06700000
                         savearea 4                                     06750000
LCCXLCCAP64H5 DS 1CL0064 Program FLIH recursion 64-bit GPR high-order  *06800000
                         half savearea 5                                06850000
LCCXLCCARG64H DS 1CL0064 Restart FLIH 64-bit GPR high-order half       *06900000
                         savearea                                       06950000
LCCXR380 DS    1CL0064   Reserved                                       07000000
LCCXLCCAPCR1 DS 1CL0128  8-byte CRs                                     07050000
LCCXLCCAPCR2 DS 1CL0128  8-byte CRs                                     07100000
LCCXLCCAPCR3 DS 1CL0128  8-byte CRs                                     07150000
LCCXLCCAPCR4 DS 1CL0128  8-byte CRs                                     07200000
LCCXLCCAPCR5 DS 1CL0128  8-byte CRs                                     07250000
LCCXLCCARCRS DS 1CL0128  8-byte CRs                                     07300000
LCCXID   DS    1CL0004                                                  07350000
         DS    1CL0004   Reserved                                       07400000
         DS    1CL0006   Reserved                                       07450000
LCCXLCCAPERC DS 1CL0002  PER code                                       07500000
LCCXLCCAPERA DS 1CL0008  PER address                                    07550000
         ORG   LCCXLCCAPERA                                             07600000
LCCXLCCAPERA03 DS 1CL0004 PER address 0-3                               07650000
LCCXLCCAPERA47 DS 1AL4   PER address 4-7                                07700000
LCCXLCCAPVAD DS 1CL0008  Translation exception address (from 168-175)   07750000
LCCXLCCAPTE1 DS 1CL0008  Translation exception address analogous to    *07800000
                         LCCAPTE1                                       07850000
LCCXLCCAPTE3 DS 1CL0008  Translation exception address analogous to    *07900000
                         LCCAPTE3                                       07950000
LCCXLCCAPTE5 DS 1CL0008  Translation exception address analogous to    *08000000
                         LCCAPTE5                                       08050000
         DS    1CL0040   Reserved                                       08100000
LCCXIDCHARS EQU C'LCCX'                                                 08150000
LCCX_LEN EQU   *-LCCX                                                   08200000
.L0002   ANOP                                                           08250000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08300000
         AIF   ('&LIST' EQ 'YES').P4                                    08350000
.P3      ANOP                                                           08400000
         POP   PRINT                                                    08450000
.P4      ANOP                                                           08500000
.P_EXIT  ANOP                                                           08550000
         MEND                                                           08600000
**/ IHALCCX_2:;                                                         08650000
* %IHALCCX_INCLUDED = 'YES';                                            08700000
* %DCL ZCBPRINT CHAR EXT;                                               08750000
* %DEACTIVATE ZCBPRINT;                                                 08800000
* %DCL IHALCCX_LIST CHAR EXT;                                           08850000
* %DEACTIVATE IHALCCX_LIST;                                             08900000
* %IF IHALCCX_LIST ~= 'NO' &                                            08950000
*    ZCBPRINT ~= 'NO' %THEN                                             09000000
*   %GOTO IHALCCX_3;                                                    09050000
*   @LIST PUSH NOECHO;                                                  09100000
*   @LIST NOASSEMBLE NOECHO;                                            09150000
*   @LIST OFF C NOECHO;                                                 09200000
* %IHALCCX_3:;                                                          09250000
*/* Start of PL/X Source                                             */ 09300000
* %IF LCCX_BASE = '' %THEN                                              09350000
*   %LCCX_BASE = 'BASED(LCCALCCX)';                                     09400000
* DCL                                                                   09450000
*   1 LCCX LCCX_BASE BDY(DWORD),            /*                   @L1A*/ 09500000
*     3 LCCXFPWA CHAR(512),         /* The FPWA is mapped here   @L1A*/ 09550000
*     3 LCCXLCCAP64H1 CHAR(64) Bdy(Word),  /* Program FLIH recursion    09600000
*                                   64-bit GPR high-order half          09650000
*                                   savearea 1                   @L1A*/ 09700000
*     3 LCCXLCCAP64H2 CHAR(64) Bdy(Word),  /* Program FLIH mainline     09750000
*                                   64-bit GPR high-order half          09800000
*                                   savearea 2                   @L1A*/ 09850000
*     3 LCCXLCCAP64H3 CHAR(64) Bdy(Word),  /* Program FLIH recursion    09900000
*                                   MC access                           09950000
*                                   64-bit GPR high-order half          10000000
*                                   savearea 3                   @L1A*/ 10050000
*     3 LCCXLCCAP64H4 CHAR(64) Bdy(Word),  /* Program FLIH              10100000
*                                   64-bit GPR high-order half          10150000
*                                   savearea 4                   @L1A*/ 10200000
*     3 LCCXLCCAP64H5 CHAR(64) Bdy(Word),  /* Program FLIH recursion    10250000
*                                   64-bit GPR high-order half          10300000
*                                   savearea 5                   @L1A*/ 10350000
*     3 LCCXLCCARG64H CHAR(64) Bdy(Word),  /* Restart FLIH              10400000
*                                   64-bit GPR high-order half          10450000
*                                   savearea                     @L1A*/ 10500000
*     3 LCCXR380 CHAR(64) Bdy(Word),  /* Reserved                @L2A*/ 10550000
*     3 LCCXLCCAPCR1 CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10600000
*     3 LCCXLCCAPCR2 CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10650000
*     3 LCCXLCCAPCR3 CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10700000
*     3 LCCXLCCAPCR4 CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10750000
*     3 LCCXLCCAPCR5 CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10800000
*     3 LCCXLCCARCRS CHAR(128) Bdy(DWord), /* 8-byte CRs         @L2A*/ 10850000
*     3 LCCXID CHAR(Length(LCCXIdChars)),  /* Acronym            @L1A*/ 10900000
*     3 * CHAR(8-Length(LCCXID)),   /* Reserved                  @L1A*/ 10950000
*     3 * CHAR(6),                  /* Reserved                  @L1A*/ 11000000
*     3 LCCXLCCAPERC CHAR(2),       /* PER code                  @L1A*/ 11050000
*     3 LCCXLCCAPERA CHAR(8) Bdy(Word),    /* PER address        @L1A*/ 11100000
*       5 LCCXLCCAPERA03 CHAR(4),          /* PER address 0-3    @L1A*/ 11150000
*       5 LCCXLCCAPERA47 PTR,              /* PER address 4-7    @L1A*/ 11200000
*     3 LCCXLCCAPVAD CHAR(8) Bdy(Word),    /* Translation exception     11250000
*                               address (from 168-175)           @L1A*/ 11300000
*     3 LCCXLCCAPTE1 CHAR(8) Bdy(Word),    /* Translation exception     11350000
*                               address analogous to LCCAPTE1    @L1A*/ 11400000
*     3 LCCXLCCAPTE3 CHAR(8) Bdy(Word),    /* Translation exception     11450000
*                               address analogous to LCCAPTE3    @L1A*/ 11500000
*     3 LCCXLCCAPTE5 CHAR(8) Bdy(Word),    /* Translation exception     11550000
*                               address analogous to LCCAPTE5    @L1A*/ 11600000
*     3 * CHAR(40),                 /* Reserved                  @L1A*/ 11650000
*     3 * CHAR(0) Bdy(Dword);       /* End of mapping            @L1A*/ 11700000
* Dcl LCCXIdChars CHAR(*) Constant('LCCX');   /*                 @L1A*/ 11750000
* @LOGIC;                                                               11800000
* #PRAGMA TOOL=CBGEN.                                                   11850000
* #USEORG.                                                              11900000
* #LINE.%LCCX_BASE = 'BASED';                                           11950000
* #LINE.%INCLUDE SYSLIB(IHALCCX);                                       12000000
* #EPRAGMA.                                                             12050000
* @ENDLOGIC;                                                            12100000
*/* End of PL/X Source                                               */ 12150000
* %IF IHALCCX_LIST ~= 'NO' &                                            12200000
*    ZCBPRINT ~= 'NO' %THEN                                             12250000
*   %GOTO IHALCCX_4;                                                    12300000
*   @LIST POP NOECHO;                                                   12350000
* %IHALCCX_4:;                                                          12400000
* %END;                                                                 12450000
