*                                                                       00050000
*        %GOTO LCCAL1;  /*                                              00100000
         MACRO                                                          00150000
         IHALCCA &DSECT=YES,&LIST=NO                               @L3C 00183300
**/                                                                     00216600
*%LCCAL1 : ;                                                            00250000
*                                                                       00300000
*/* START OF SPECIFICATIONS ******************************************/ 00333300
*/*01* PROPRIETARY STATEMENT =                                       */ 00366600
*/*                                                                  */ 00400000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00425000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00450000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                 */ 00475000
*/*                                                                  */ 00500000
*/*01* STATUS:  HBB7703                                              */ 00550000
*/*                                                                  */ 00600000
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 00650000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00700000
*/*                                                                  */ 00850000
*/*01* DESCRIPTIVE NAME: Logical Configuration Communication Area    */ 00851400
*/*02*  ACRONYM:  LCCA                                               */ 00852800
*/*                                                                  */ 00854200
*/*01* MACRO-NAME: IHALCCA                                           */ 00855600
*/*                                                                  */ 00857000
*/*01* DSECT NAME:                                                   */ 00858400
*/*     LCCA                                                         */ 00859800
*/*                                                                  */ 00861200
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 00862600
*/*                                                                  */ 00864000
*/*01* EYE-CATCHER:  LCCA                                            */ 00865400
*/*02*  OFFSET:  0                                                   */ 00866800
*/*02*  LENGTH:  4                                                   */ 00868200
*/*                                                                  */ 00869600
*/*01* STORAGE ATTRIBUTES:                                           */ 00871000
*/*02*  SUBPOOL:  239                                                */ 00872400
*/*02*  KEY:  0                                                      */ 00873800
*/*                                                                  */ 00875200
*/*01* SIZE:                                                         */ 00876600
*/*     OFFSET OF LCCAEND MINUS THE OFFSET OF LCCA                   */ 00878000
*/*                                                                  */ 00879400
*/*01* CREATED BY:                                                   */ 00880800
*/*     IEAVNIP0                                                     */ 00882200
*/*     IEEVCPRA                                                     */ 00883600
*/*                                                                  */ 00885000
*/*01* POINTED TO BY:                                                */ 00886400
*/*     PSALCCAV field of the PSA data area                          */ 00887800
*/*     PSALCCAR field of the PSA data area                          */ 00889200
*/*     LCCATxxP field of the LCCAVT data area                       */ 00890600
*/*     (where xx is the processor number)                           */ 00892000
*/*     LCCADCPU field of the LCCA data area                         */ 00893400
*/*     (failing processor's LCCA)                                   */ 00894800
*/*     LCCARCPU field of the LCCA data area                         */ 00896200
*/*     (recovering processor's LCCA)                                */ 00897600
*/*                                                                  */ 00899000
*/*01* SERIALIZATION:                                                */ 00900400
*/*     Disablement                                                  */ 00901800
*/*                                                                  */ 00903200
*/*01* FUNCTION:                                                     */ 00904600
*/*02*  Contains processor related data.                             */ 00906000
*/*                                                                  */ 00907400
*/*01* PURPOSE: PROVIDE DATA MAPPING OF THE LCCA.                    */ 00908800
*/*                                                                  */ 00910200
*/*01* METHOD OF ACCESS:                                             */ 00911600
*/*02*  ASM:                                                         */ 00913000
*/*      DSECT is produced unless DSECT=NO is specified.             */ 00914400
*/*      USING on LCCA gives Addressability for all symbols.         */ 00915800
*/*      Specify LIST=YES on Macro call for listing.                 */ 00917200
*/*02*  PL/AS:                                                       */ 00918600
*/*      DCL LCCAPTR PTR                                             */ 00920000
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 00921400
*/*                                                                  */ 00922800
*/*01* DEPENDENCIES:                                                 */ 00924200
*/*      None.                                                       */ 00925600
*/*                                                                  */ 00927000
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 00928400
*/*                                                                  */ 00929800
*/*01* NOTES:                                                        */ 00931200
*/*      (SUBPOOL 239 - COMMON SQA/ESQA)                             */ 00932600
*/*                                                                  */ 00934000
*/*01* DELETED BY:                                                   */ 00935400
*/*             IEEVCPRA                                             */ 00936800
*/*                                                                  */ 00938200
*/*01* CHANGE ACTIVITY:                                              */ 00939600
*/*  $L9=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 00941000
*/*                                                                  */ 00942400
*/* END OF SPECIFICATIONS ********************************************/ 00943800
*%GOTO LCCAL2;  /*                                                      00950000
.********************************************************************** 00950500
.*   CHANGE-ACTIVITY=                                                   00951000
.*                                                                      00951500
.*  OZ59054 - FIELDS FOR EXTERNAL FLIH RECOVERY                @ZA59054 00952000
.*                                                                      00952500
.*   G860PXX - HBB2102 SUPPORT                                          00953000
.*  $L1=RAPRAS   JBB2110  820903  PD16XK:  SUP. CNTL. RAS               00953500
.*  $H1=ADVPROC2 JBB2133  830314  PD16XD:  AXP                          00954000
.*  $L2=TRQ      JBB2217  850325  PD16FN:  TRUE READY QUEUE             00954500
.*  $L3=AR       HBB3310  850903  PD16Q9:  ACCESS REGISTERS             00955000
.*  $L4=AR       HBB3310  860106  PD16Q9:  ACCESS REGISTERS             00955500
.*  $L5=DREF     HBB3310  860416  PD16H5:  DISABLED REFERENCE SUPPORT   00956000
.*  $L6=DATASPAC HBB3310  860630  PD16LD:  DATA SPACES                  00956500
.*  $D1=DCR0151  HBB3310  870225  PD16Q9:  SPIN LOOP EXEMPTION BITS     00957000
.*  $D2=DCR0220  HBB3310  870216  PD16FH:  REDUCED PREEMPTION           00957500
.*  $P1=PC41131  HBB3310  870715  PD16BN:  ACCESS PIC FROM LCCAPINT     00958000
.*  OY07494 - ADD SYSTEM MASK AND RETURN ADDRESS SAVE AREA              00958500
.*            FOR MACHINE CHECK HANDLER                        @YA07494 00959000
.*  OY16565 - ADD WORK AREA FOR CONTROL REG 8                  @YA16565 00959500
.*  $L7=CLOCK    HBB4410  871026  PD16BN:  ETR SUPPORT                  00960000
.*  $L8=CNITG    HBB4410  890508  PD16BN:  CONSOLE INTEGRATION SUPPORT  00960500
.*  $D3=DEO0229  HBB4410  890717  PD16Q4:  DEFINE LCCASTCP              00961000
.*  $P2=PEO2420  HBB4410  890918  PD16H5:  SPIN LOOP EXEMPTION FOR      00961500
.*                                         IEATVTOD                     00962000
.*  $L9=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete      00962500
.*  $P3=PEO3184  HBB4410  900105  PD162M:  SPIN LOOP EXEMPTION FOR      00963000
.*                                         IEATESMR                     00963500
.*  $01=OY29197  HBB3310  900201  PD16CV:  HIGH PERFORMANCE PARALLEL    00964000
.*                                         INTERFACE SUPPORT (HSC)      00964500
.*  $02=OY27050  JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC        00965000
.*                                         FEATURE SUPPORT              00965500
.*  $P4=PH32022  HBB4420  910201  PD16EJ:  SRBs Suspended with Token    00966000
.*                                         must not persist across      00966500
.*                                         job step task termination.   00967000
.*  $03=OY45293  HBB4410  910615  PD16H5:  SLEB bit for IEATESC2        00967500
.*  $LA=DBFMC    HBB4430  910327  PD16CU:  STATUS REWRITE               00968000
.*  $P5=PKB0254  HBB4430  920108  PD16CU:  Delete LCCASTAT              00968500
.*  $LB=SYSLKLCN HBB5510  910620  PD16Q4:  Define footprint for         00969000
.*                                         Dispatcher/Dispatcher        00969500
.*                                         Recovery to indicate XES     00970000
.*                                         Schedule List Transition     00970500
.*                                         Notification is invoked      00971000
.*  $D4=DIG0030  HBB5510  921105  PD16IG:  SLEB bit for XES             00971500
.*  $LC=SUBSP    HBB5510  921203  PD16IW:  Subspaces                    00972000
.*  $05=OY58195  HBB4430  920915  PD16IW:  Alternate Wait Management    00972500
.*  $LD=DISPR    HBB5510  93xxxx  PD16EJ:  Dispatcher Restructure       00973000
.*  $LE=DISPR    HBB5510  930715  PD16XZ:  Dispatcher Restructure       00973500
.*  $LF=WLMI     HBB5510  920204  PD44BB:  Workload Manager 1           00974000
.*  $P6=PIG1829  HBB5510  920909  PD16EJ:  Define LCCADS7E.             00974500
.*  $P7=PIG3222  HBB5510  931013  PD16EI:  Define LCCARWEB, remove      00975000
.*                                         LCCAFSSJ                     00975500
.*  $LG=WLMI     HBB5510  931104  PD16EJ:  Define LCCAETP and LCCAETPB  00976000
.*  $P8=PIG3207  HBB5510  931104  PD16H5:  Define LCCABBCT              00976500
.*  $P9=PIG3608  HBB5510  931025  PC89GD:  Update LCCARWLK description  00977000
.*  $LH=ENCLV    HBB5520  931109  PD16EI:  ENCLAVE Support              00977500
.*                                         Add LCCAENID and LCCACLSD.   00978000
.*                                         Replace LCCAOASN with        00978500
.*                                         LCCAOID.                     00979000
.*                                         Add LCCARWQL                 00979500
.*  $LI=CAPT2    HBB5520  940310  PD16IW:  Define LCCASOPI              00980000
.*  $06=OW00482  HBB5510  921120  PD16EI:  In support of OW00311        00980500
.*  $07=OW03250  HBB5510  940314  PD16EI:  In support of OW01489        00981000
.*  $08=OW05328  HBB5510  940629  PD16GD:  XES Performance Support      00981500
.*  $09=OW08244  HBB5510  940919  PD16EI:  In support of OW07931        00982000
.*                                         (deleted LCCAKPSW,LCCAKPS2)  00982500
.*  $0A=OW08463  HBB5510  940925  PD16H5:  BindBreak-RISGNL deadlock    00983000
.*                                         fix                          00983500
.*  $0B=OW12129  HBB5510  950323  PD81XZ:  Add LCCASVC6 and LCCATCT2    00984000
.*  $0C=OW18235  HBB5510  950724  PD81XZ:  Add LCCAAOLD, LCCATOLD,      00984500
.*                                         LCCAAOLS, LCCATOLS.          00985000
.*  $0D=OW14641  HBB5510  960417  R4GAXZ:  Add LCCASXLS.                00985500
.*  $0E=OW19665  HBB5510  960508  R4GAXZ:  Add LCCADIEP.                00986000
.*  $LJ=IEEESUP  HBB6606  970807  PD00XB:  FP simulation                00986300
.*  $LK=PAUSE    HBB6608  980815  B7HGH5:  Pause-Release services       00986600
.*  $PA=PWK0557  HBB6608  981215  B7HGH5:  Name reserved field          00986700
.*  $LL=64BITSUP HBB7703 981204 PD00XB: ESAME                           00986800
.*  $LM=64BITSUP HBB7703 990805 PD00XB: Original ILC                    00986900
.*  $0G=OW42226  HBB5510  991216  U2IAXZ:  Move LCCAFPAC and LCCAFPPE   00987000
.*                                         to PSA.                      00987100
.*                                                                      00987200
.********************************************************************** 00987500
.*                                                                      00988000
.********************************************************************** 00988500
.*                                                                      00989000
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     00989500
.*                                                                      00990000
.*     1. NO RESERVED FIELD IS NAMED THAT IS LESS THAN 4 BYTES IN       00990500
.*        LENGTH. IF THESE FIELDS ARE CHANGED FROM RESERVED STATUS      00991000
.*        THE SERIALIZATION USED TO UPDATE THE FIELD SHOULD BE          00991500
.*        CONSIDERED.                                                   00992000
.*     2. RESERVED FIELDS ARE NAMED AS FOLLOWS                          00992500
.*                        LCCARXXX DC    XLNNN'00' -  RESERVED          00993000
.*                             XXX IS THE OFFSET WITHIN THE LCCA        00993500
.*                             NNN IS THE LENGTH OF THE RESERVED FIELD  00994000
.*                                 A VALUE FROM 4 TO 256 INCLUSIVE      00994500
.*                                                                      00995000
.********************************************************************** 00995500
         PUSH  PRINT                                               @L3A 00996000
         AIF   ('&LIST' EQ 'YES').LCCALST                          @L3A 00996500
         PRINT OFF                                                 @L3A 00997000
.LCCALST ANOP                                                      @L3A 00997500
         SPACE 1                                                        01000000
         AIF   ('&DSECT' EQ 'NO').LCCA010                               01050000
LCCA     DSECT                                                          01100000
         AGO   .LCCA020                                                 01150000
.LCCA010 ANOP                                                           01200000
         DS    0D                                                       01250000
LCCA     EQU   *                                                        01300000
.LCCA020 ANOP                                                           01350000
LCCALCCA DC    CL4'LCCA' -    CONTROL BLOCK ACRONYM IN EBCDIC           01400000
LCCACPUA DC    H'0' -         LOGICAL CPU ADDRESS                       01450000
LCCACAFM DC    H'0' -         BIT MASK CORRESPONDING TO                 01466000
*                             LOGICAL CPU ADDRESS              @G860PXK 01482000
LCCAPGR1 DC    16F'0' -       PROGRAM FLIH RECURSION REGISTER           01498000
*                             SAVE AREA 1                      @G860PXK 01514000
LCCAPGR2 DC    16F'0' -       PROGRAM FLIH MAIN ENTRY REGISTER          01530000
*                             SAVE AREA             (MDC346)   @G383P9A 01546000
LCCAPPSW DC    XL8'00' -      PROGRAM FLIH MAIN ENTRY PSW               01562000
*                             SAVE AREA                        @G860PXK 01578000
LCCAPINT DS    0F   -         PROGRAM FLIH MAIN ENTRY ILC AND           01594000
*                             INTERRUPT CODE SAVE AREA             @02C 01610000
         DC    XL1'0' -       RESERVED - SET TO 0                  @02A 01626000
LCCAPILC DC    XL1'0' -       INSTRUCTION LENGTH CODE              @02A 01642000
LCCAPEEC DC    XL1'0' -       EXCEPTION - EXTENSION CODE           @02A 01658000
LCCAPICD DC    XL1'0' -       PROGRAM INTERRUPT CODE               @02A 01674000
LCCAPPER EQU   X'80'  -       PER BIT IN INTERRUPT CODE            @02A 01690000
LCCAPVAD DS    0F   -         PROGRAM FLIH MAIN ENTRY TRANSLATION  @L4C 01706000
*                             EXCEPTION ADDRESS SAVE AREA      @G860PXK 01722000
         DC    XL3'0' -       FIRST THREE BYTES OF ADDRESS         @L4A 01738000
LCCAPVXM EQU   X'80' -        TEA MODE STATE 0 = PRIMARY                01754000
*                             1 = SECONDARY         (MDC338)   @G383P9A 01770000
LCCAPDXC DC   0XL1'0' -       Data exception code for PI 7         @LJA 01786000
LCCAPSTD DC    XL1'0' -       LAST BYTE OF LCCAPVAD                @L4A 01802000
LCCAPSTP EQU   X'00'  -       THE PRIMARY STD WAS USED             @L4A 01818000
LCCAPSTA EQU   X'01'  -       THE STD WAS AR QUALIFIED             @L4A 01834000
LCCAPSTS EQU   X'02'  -       THE SECONDARY STD WAS USED           @L4A 01850000
LCCAPSTH EQU   X'03'  -       THE HOME STD WAS USED                @L4A 01866000
LCCASOPI EQU   X'04'  -       Suppression-On-Protection indicator  @LIA 01882000
         DC    F'0' -         Reserved                             @LLC 01916000
LCCACR0  DC    F'0' -         WORK AREA FOR TESTING BITS IN CONTROL     01950000
*                             REGISTER 0                                02000000
LCCAPGR3 DC    16F'0' -       PROGRAM FLIH RECURSION REGISTER           02006600
*                             SAVE AREA 3                      @ZM48166 02013200
LCCAPAR2 DS    0XL64  -       PROGRAM FLIH MAINLINE ACCESS         @L3C 02019800
*                             REGISTER SAVEAREA 2                       02026400
LCCAP2A0 DC    F'0'   -       ACCESS REGISTER 0                    @L3A 02033000
LCCAP2A1 DC    F'0'   -       ACCESS REGISTER 1                    @L3A 02039600
LCCAP2A2 DC    F'0'   -       ACCESS REGISTER 2                    @L3A 02046200
LCCAP2A3 DC    F'0'   -       ACCESS REGISTER 3                    @L3A 02052800
LCCAP2A4 DC    F'0'   -       ACCESS REGISTER 4                    @L3A 02059400
LCCAP2A5 DC    F'0'   -       ACCESS REGISTER 5                    @L3A 02066000
LCCAP2A6 DC    F'0'   -       ACCESS REGISTER 6                    @L3A 02072600
LCCAP2A7 DC    F'0'   -       ACCESS REGISTER 7                    @L3A 02079200
LCCAP2A8 DC    F'0'   -       ACCESS REGISTER 8                    @L3A 02085800
LCCAP2A9 DC    F'0'   -       ACCESS REGISTER 9                    @L3A 02092400
LCCAP2AA DC    F'0'   -       ACCESS REGISTER 10                   @L3A 02099000
LCCAP2AB DC    F'0'   -       ACCESS REGISTER 11                   @L3A 02105600
LCCAP2AC DC    F'0'   -       ACCESS REGISTER 12                   @L3A 02112200
LCCAP2AD DC    F'0'   -       ACCESS REGISTER 13                   @L3A 02118800
LCCAP2AE DC    F'0'   -       ACCESS REGISTER 14                   @L3A 02125400
LCCAP2AF DC    F'0'   -       ACCESS REGISTER 15                   @L3A 02132000
LCCARSGR DC    16F'0' -       RESTART FLIH REGISTER SAVE AREA      @L4C 02138600
LCCADSA2 DS    A      -       REAL ADDRESS OF THE DATA SPACE       @L6C 02145200
*                             ASTE CAUSING THE FAULT.                   02151800
LCCAPCR2 DS    0XL64  -       PROGRAM FLIH MAINLINE CONTROL        @L4C 02158400
*                             REGISTER SAVEAREA 2                       02165000
LCCAP2C0 DC    F'0'   -       CONTROL REGISTER 0                   @L3A 02171600
LCCAP2C1 DC    F'0'   -       CONTROL REGISTER 1                   @L3A 02178200
LCCAP2C2 DC    F'0'   -       DUCT ORIGIN ADDRESS (CR2)            @L3A 02184800
LCCAPXM2 DS    0CL8   -       PROGRAM FLIH CROSS MEMORY CONTROL    @L3A 02191400
*                             REGISTER SAVEAREA 2 - MUST BE ON DOUBLE   02198000
*                             WORD BOUNDARY                             02204600
LCCAP2C3 DS    0F     -       CONTROL REGISTER 3                   @L3A 02211200
LCCAPX2K DC    H'0'   -       PROGRAM KEY MASK                     @L3A 02217800
LCCAPX2S DC    H'0'   -       SASN                                 @L3A 02224400
LCCAP2C4 DS    0F     -       CONTROL REGISTER 4                   @L3A 02231000
LCCAPX2A DC    H'0'   -       AX                                   @L3A 02237600
LCCAPX2P DC    H'0'   -       PASN                                 @L3A 02244200
LCCAP2C5 DC    F'0'   -       ASTE REAL ADDRESS (CR5)              @L3A 02250800
LCCAP2C6 DC    F'0'   -       CONTROL REGISTER 6                   @L3A 02257400
LCCAP2C7 DC    F'0'   -       CONTROL REGISTER 7                   @L3A 02264000
LCCAP2C8 DS    0F     -       CONTROL REGISTER 8                   @L3A 02270600
LCCAPEX2 DC    H'0'   -       EAX VALUE (LH CR8)                   @L3A 02277200
         DC    H'0'   -       SECOND HALF OF CR8                   @L3A 02283800
LCCAP2C9 DC    F'0'   -       CONTROL REGISTER 9                   @L3A 02290400
LCCAP2CA DC    F'0'   -       CONTROL REGISTER 10                  @L3A 02297000
LCCAP2CB DC    F'0'   -       CONTROL REGISTER 11                  @L3A 02303600
LCCAP2CC DC    F'0'   -       CONTROL REGISTER 12                  @L3A 02310200
LCCAP2CD DC    F'0'   -       CONTROL REGISTER 13                  @L3A 02316800
LCCAP2CE DC    F'0'   -       CONTROL REGISTER 14                  @L3A 02323400
LCCAP2CF DC    F'0'   -       PROGRAM FLIH MAINLINE LINKAGE STACK  @L3A 02330000
*                             ADDRESS (CR15)                            02336600
LCCAR1A4 DC    XL52'00' -     RESERVED                             @L4C 02343200
LCCAPSW3 DC    XL8'00' -      PROGRAM FLIH PSW SAVE AREA                02349800
*                                                  (MDC346)    @G383P9A 02356400
LCCAINGR DC    8F'0' -        INTERSECT REGISTER SAVE AREA              02363000
*                             (MDC325)                         @ZM48325 02369600
LCCABBCT DC    H'0' -         COUNT OF THE NUMBER OF TIMES BIND    @P8A 02376200
*                             BREAK HAS ENABLED                    @P8A 02382800
LCCAWFCT DC    H'0' -         Bind Break Window Function Count -   @0AA 02389400
*                             Incremented by code which opens an   @0AA 02396000
*                             EMS window after it has completed    @0AA 02402600
*                             its function                         @0AA 02409200
LCCAMCR0 DC    F'0' -         MACHINE CHECK FLIH CR0 SAVE AREA          02415800
*                             (MDC312)                         @G50NP9A 02422400
LCCAMPEN EQU   X'10' -        IF 0, PSA PROTECT DISABLED.  IF 1, PSA    02429000
*                             PROTECT ENABLED.  BIT IS IN HIGH-ORDER    02435600
*                             BYTE OF LCCAMCR0.  (MDC315)      @G50NP9A 02442200
LCCAIHRC DS    0BL4 -         GENERAL FLIH RECURSION FLAGS              02450000
LCCAIHR1 DC    XL1'00' -      FIRST BYTE OF LCCAIHRC                    02500000
LCCAXRC1 EQU   X'80' -        EXTERNAL FLIH RECURSION BIT 1             02550000
LCCAXRC2 EQU   X'40' -        EXTERNAL FLIH RECURSION BIT 2             02600000
LCCAIHR2 DC    XL1'00' -      SECOND BYTE OF LCCAIHRC                   03000000
LCCAIHR3 DC    XL1'00' -      THIRD BYTE OF LCCAIHRC                    03450000
LCCAIHR4 DC    XL1'00' -      FOURTH BYTE OF LCCAIHRC                   03900000
LCCASPIN DS    0BL4 -         PROCESSOR IS SPINNING INDICATORS          04350000
LCCASPN1 DC    XL1'00' -      FIRST BYTE OF LCCASPIN                    04400000
LCCASIGS EQU   X'80' -        IEAVSIGP SPIN BIT                @G860PXK 04450000
LCCAERIS EQU   X'40' -        IEAVERI  SPIN BIT                @G860PXK 04500000
LCCALOCK EQU   X'20' -        LOCK MANAGER SPIN BIT                     04550000
LCCATSPN EQU   X'10' -        SIMULATES SPIN FOR TIMER SUPERVISOR AT    04600000
*                             VARY TIME                                 04650000
LCCARSTR EQU   X'08' -        USED BY A PROGRAM SPINNING FOR THE        04685700
*                             RESTART RESOURCE                   MDC035 04721400
LCCAINT  EQU   X'02' -        INTERSECT FUNCTION SPIN BIT               04757100
*                             (MDC308)                         @G50DP9A 04792800
LCCAEXSN EQU   X'01' -        SPIN BIT FOR EXCESSIVE SPIN NOTIFICATION  04828500
*                             ROUTINE IEEVEXSN  (MDC330)       @G65UP9A 04864200
LCCASPN2 DC    XL1'00' -      SECOND BYTE OF LCCASPIN                   04900000
LCCAMSF  EQU   X'80' -        MSSFCALL SVC SPIN CONDITION.     @G875PXU 04950000
LCCACHAP EQU   X'40' -        ASCBCHAP SPIN BIT                    @L2A 05000000
LCCACPUR EQU   X'20' -        TIMER SPIN BIT                       @L7A 05050000
LCCASTAS EQU   X'10' -        STATUS SPIN BIT                      @LAA 05100000
LCCAESPN EQU   X'08' -        IEAVESPN SPIN BIT                    @LDA 05150000
LCCASTST EQU   X'04' -        CPU/VF STOP/START spin bit IEEVCVSR  @07A 05200000
LCCASXLS EQU   X'02' -        XLS spin bit                         @0DA 05250000
LCCASPN3 DC    XL1'00' -      THIRD BYTE OF LCCASPIN                    05350000
LCCASPN4 DC    XL1'00' -      FOURTH BYTE OF LCCASPIN                   05800000
         DS    0XL8 -         OWNERSHIP: SUPERVISOR                @05C 05850000
*                             SERIALIZATION: NONE                       05900000
LCCATODH DC    F'0' -         STCK WORK AREA - HIGH ORDER WORD     @05A 05950000
LCCATODL DC    F'0' -         STCK WORK AREA - LOW ORDER WORD      @05A 06000000
LCCACPUS DC    A(0) -         POINTER TO CPU WORK/SAVE AREA VECTOR      06350000
*                             TABLE                                     06400000
LCCADSF1 DC    XL1'00' -      DISPATCHER STATUS INDICATOR BYTE 1        06450000
*                             SPECIAL EXIT FLAGS                        06475000
LCCAACR  EQU   X'80' -        ACR IN PROGRESS                           06500000
LCCAVCPU EQU   X'40' -        VARY CPU IN PROGRESS                      06550000
LCCAETSC EQU   X'20' -        TOD SYNC CHECKS SHOULD BE ENABLED    @L7A 06585000
LCCATIMR EQU   X'10' -        CPU'S TOD CLOCK IS TO BE OR IS BEING      06620000
*                             SYNCHRONIZED                       MDC011 06655000
LCCATSMC EQU   X'08' -        TOD SYNC CHECK THRESHOLD HAS BEEN    @L7A 06690000
*                             EXCEEDED                             @L7A 06725000
LCCASVC6 EQU   X'04' -        Dispatcher entry DSSRBRTN was        @0BA 06760000
*                             spinning for the global intersect.        06795000
LCCATCT2 EQU   X'02' -        Dispatcher entry IEAVDSTC was        @0BA 06830000
*                             spinning for the global intersect.        06865000
LCCADSF2 DC    XL1'00' -      DISPATCHER STATUS INDICATOR BYTE 2        06900000
*                             SPECIAL EXIT FLAGS                        06925000
LCCASRBM EQU   X'80' -        SRB MODE INDICATOR                        06950000
LCCASSRB EQU   X'20' -        DISPATCHER SSRB PATH FOOTPRINT   @G387PXH 07000000
LCCAEUTS EQU   X'10' -        EUTSAVE SUBROUTINE FOOTPRINT     @G38EPXH 07050000
LCCAEUTR EQU   X'08' -        EUTREST SUBROUTINE FOOTPRINT     @G38EPXH 07100000
LCCATVS  EQU   X'04' -        Dispatcher footprint for XES         @LBA 07150000
*                             Schedule List Transition Notification     07200000
LCCADS7E EQU   X'02' -        Dispatcher footprint for entry from  @P6A 07250000
*                             external or I/O FLIHs                     07300000
LCCAPSMK DC    XL1'00' -      STORE AREA FOR FLIH'S STOSM INSTRUCTION   07350000
LCCASCFL DC    XL1'00' -      Supervisor Control flag byte.  Current    07355400
*                             processor's field serialized via          07360800
*                             disablement.                         @02A 07366200
LCCACRYP EQU   X'80' -        THE ENCRYPTION FEATURE IS ENABLED ON @02A 07371600
*                             THIS PROCESSOR (SET BY IEAMCPUF SERVICE). 07377000
LCCAHSCS EQU   X'40' -        HPPI external interrupts are enabled      07382400
*                             on this processor (set by IEAMCPUF        07387800
*                             service).                            @01A 07393200
LCCAPASS EQU   X'20' -        Pass ABEND to interrupted unit of    @LAA 07398600
*                             work indicator.                           07404000
LCCATVSE EQU   X'10' -        External FLIH footprint for XES           07409400
*                             processing in progress.              @08A 07414800
LCCAAOLS EQU   X'08'          Set when PSAAOLD was refreshed and   @0CA 07420200
*                             IEAVELCR needs to record the old          07425600
*                             value in the VRA. The old value is        07431000
*                             saved in LCCAAOLD.                        07436400
LCCATOLS EQU   X'04'          Set when PSATOLD was refreshed and   @0CA 07441800
*                             IEAVELCR needs to record the old          07447200
*                             value in the VRA. The old value is        07452600
*                             saved in LCCATOLD.                        07458000
LCCADS0W DS    0XL32 -        DISPATCHER CPU RELATED WORK AREA     @L2A 07463400
LCCAPWEB DC    A(0) -         Dispatcher savearea for previous     @LDC 07468800
*                             WEB on current WUQ.                  @LDC 07474200
*                             SERIALIZATION: Dispatcher Active     @LDC 07479600
*                             OWNERSHIP: Supervisor Control        @LDC 07485000
LCCADBCT DC    F'0' -         DISPATCHER SAVEAREA FOR INTERNAL     @L2A 07490400
*                             ASCB COUNTER.  INITIALIZED TO        @L2A 07495800
*                             SVTDSBCT AND DECREMENTED BY ONE      @L2A 07501200
*                             FOR EACH ASCB SEARCHED.              @L2A 07506600
LCCARSWS EQU   X'80' -        Turned on whenever a the dispatcher  @LKA 07507500
*                             is entered as a result of a successful    07508400
*                             Transfer request.  Turned off by the      07509300
*                             dispatcher when a successful work search  07510200
*                             is completed.                             07511100
LCCADSV1 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07512000
LCCADSV2 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07517400
LCCADSV3 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07522800
LCCADSV4 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07528200
LCCADSV5 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07533600
LCCADSV6 DC    A(0) -         DISPATCHER SAVEAREA                  @L2A 07539000
LCCAEE1R DC    A(0) -         EXTERNAL FLIH MAINLINE           @ZA59054 07544400
*                             RETRY ADDRESS                    @ZA59054 07549800
LCCAEE2R DC    A(0) -         EXTERNAL FLIH 1ST RECURSION      @ZA59054 07555200
*                             RETRY ADDRESS                    @ZA59054 07560600
LCCAEE3R DC    A(0) -         EXTERNAL FLIH 2ND RECURSION      @ZA59054 07566000
*                             RETRY ADDRESS                    @ZA59054 07571400
LCCAPTR1 DC    XL1'00' -      PROGRAM FLIH RECURSION TEA AR NUMBER @L3C 07576800
*                             SAVEAREA 1                                07582200
LCCAPTR2 DC    XL1'00' -      PROGRAM FLIH MAINLINE TEA AR NUMBER  @L3A 07587600
*                             SAVEAREA 2                                07593000
LCCAPTR3 DC    XL1'00' -      PROGRAM FLIH RECURSION TEA MC AR     @L3A 07598400
*                             NUMBER SAVEAREA 3                         07603800
LCCAPPR2 DC    XL1'00' -      MAINLINE PER STORAGE ALTERATION AR   @L3A 07609200
*                             NUMBER                                    07614600
LCCATCR0 DC    F'0' -         SAVE AREA FOR CONTROL REGISTER 0 FOR      07620000
*                             TIMER ROUTINES  (MDC322)         @ZM47873 07625400
LCCAWTD  DC    F'0'     -     AWM wait dispatch count              @05A 07630800
LCCAWSD  DC    F'0' -         Short wait dispatch count            @08A 07636200
LCCAWSU  DC    F'0' -         Unproductive short wait count        @08A 07641600
LCCAWS   DC    F'0' -         Short wait time slice count          @08A 07647000
LCCASTCT DC    XL1'00' -      The count of sequential transfers on @LKC 07650200
*                             this processor.                           07653400
LCCAR265 DC    XL3'00' -      RESERVED                             @PAC 07656700
         DS    0D -           ALIGN LCCAWTIM TO DOUBLE WORD             07660000
LCCAWTIM DC    XL8'00' -      ACCUMULATED CPU WAIT TIME                 07700000
LCCAR270 DS    XL28'00' -     RESERVED                             @LJC 07715700
LCCALCCX DS    0A       -     Virtual address of LCCX              @LKA 07723500
LCCAFPWA DC    A(0)     -     Virtual address of FPWA              @LJA 07731400
LCCALCXR DS    0A       -     Real address of LCCX                 @LKA 07739200
LCCAFPWR DC    A(0)     -     Real address of FPWA                 @LJA 07747100
LCCAESAV DS    A        -     Virtual address of area pointed to   @LJA 07762800
*                             by FLCESAA. Set during IPL and       @LJA 07778500
*                             bringing a processor online. Never   @LJA 07794200
*                             reset. (Pre-ESAME only)              @LJA 07809900
*                             Ownership: Supervisor Control        @LJA 07825600
LCCAAOLD DC    A(0)           If LCCAAOLS = 1, PSAAOLD was         @0CA 07841300
*                             refreshed and the original value of       07857000
*                             PSAAOLD is saved in this field, so it     07872700
*                             can be recorded in the VRA.               07888400
LCCATOLD DC    A(0)           If LCCATOLS = 1, PSAAOLD was         @0CA 07904100
*                             refreshed and the original value of       07919800
*                             PSAAOLD is saved in this field, so it     07935500
*                             can be recorded in the VRA.               07951200
LCCASRBJ DC    F'0' -         SUSPENDED SERVICE REQUEST BLOCK (SRB)     07966900
*                             JOURNAL WORD USED BY SETLOCK       MDC043 07982600
LCCADCPU DC    A(0) -         VIRTUAL ADDRESS OF LCCA OF FAILING CPU    08000000
LCCARCPU DC    A(0) -         VIRTUAL ADDRESS OF LCCA OF RECOVERING CPU 08050000
LCCACRLC DC    F'0' -         ACR SAVE AREA FOR HIGHEST LOCK HELD       08100000
*                             INDICATOR                                 08110000
LCCALCR0 DC    F'0' -         SAVE AREA FOR CONTROL REGISTER 0 WHEN     08156600
*                             OPENING A WINDOW                          08203200
LCCACRFL DC    XL1'00' -      ACR FLAGS                                 08250000
LCCACRTM EQU   X'80' -        RTM ENTRY BIT                             08300000
LCCACLMS EQU   X'40' -        PROCESS SUSPENDED                         08350000
LCCAVARY EQU   X'01' -        TELLS ACR THAT VARY IS IN PROGRESS MDC038 08400000
LCCACREX DC    XL1'00' -      ACR ENTRY AND EXIT FLAGS                  08700000
LCCACREF EQU   X'80' -        EXTERNAL ROUTINE                          08750000
LCCACRRM EQU   X'40' -        FINAL EXIT                                08800000
LCCACRLE EQU   X'20' -        LOCK MANAGER EXIT                         08850000
LCCACRRT EQU   X'10' -        FRR EXIT                                  08900000
LCCACRIN EQU   X'08' -        ENTRY TYPE = ACR                          08950000
LCCACRLM EQU   X'04' -        ENTRY TYPE = ACRLM                        09000000
LCCACRDP EQU   X'02' -        ENTRY TYPE = ACRDISP                      09050000
LCCACRST EQU   X'01' -        SYSTERM TERMINATION EXIT FLAG      MDC037 09080000
LCCALKFG DC    XL1'00' -      LOCK FLAG BYTE                     MDC005 09110000
LCCALKRD EQU   X'10' -        THIS IS A LOCK MANAGER RELEASE DISABLED   09112900
*                             REQUEST                            MDC047 09115800
         DC    XL1'00' -      RESERVED                             @H1C 09118700
LCCASLEB DS    0F      -      SPIN LOOP EXEMPTION BITS             @D1C 09121600
LCCASLE1 DC    XL1'00' -      FLAG BYTE                            @D1A 09124500
*                             OWNERSHIP: RECONFIG                       09127400
*                             SERIALIZATION: CS                         09130300
LCCASTCP EQU   X'80'   -      BLWSPIN IN CONTROL.                  @D3A 09133200
LCCARSTP EQU   X'40'   -      LOADWAIT/RESTART PROCESSING IS       @L8C 09136100
*                             PLACING THIS PROCESSOR INTO A RESTARTABLE 09139000
*                             WAIT STATE.                               09141900
LCCAVTOD EQU   X'20'   -      IEATVTOD IN CONTROL.                 @P2A 09144800
LCCAESMR EQU   X'10'   -      IEATESMR IN CONTROL.                 @P3A 09147700
LCCAXMFA EQU   X'08'   -      IGFPXMFA HAS STOPPED THIS CPU.       @D1A 09150600
LCCACVSR EQU   X'04'   -      IEEVCVSR IN CONTROL.                 @D1A 09153500
LCCABRCH EQU   X'02'   -      ISNBRNCH IN CONTROL.                 @L8C 09156400
LCCABWTO EQU   X'01'   -      IEAVBWTO IN CONTROL.                 @L8A 09159300
LCCASLE2 DC    XL1'00' -      FLAG BYTE 2                          @03A 09162200
LCCAESC2 EQU   X'80'   -      IEATESC2 or IEATTFDH in control.     @03A 09165100
*                             OWNERSHIP: RECONFIG.                      09168000
*                             SERIALIZATION: CS.                        09170900
LCCAXLS  EQU   X'40'   -      XLS is in control.                   @D4A 09173800
*                             Ownership: XES.                           09176700
*                             Serialization: Disablement.               09179600
         DC    XL2'00' -      RESERVED                             @03C 09182500
LCCASLIP DC    A(0) -         POINTER TO SLIP/PER WORK AREA             09185400
*                             (MDC316)                         @G65RP9A 09188300
         DS    0D -           ALIGN LCCALWTM TO DOUBLE WORD      MDC001 09192000
LCCALWTM DC    XL8'00' -      VALUE OF LCCAWTIM AT THE END OF A         09194000
*                             MEASUREMENT INTERVAL               MDC001 09196000
LCCASSA2 DS    A      -       REAL ADDRESS OF THE SUBSPACE         @LCA 09196400
*                             ASTE CAUSING FAULT                        09196800
*                             OWNERSHIP: SUPERVISOR CONTROL             09197200
*                             SERIALIZATION: DISABLEMENT                09197600
LCCASSA5 DS    A      -       REAL ADDRESS OF THE SUBSPACE         @LCA 09198000
*                             ASTE CAUSING RECURSIVE FAULT.             09198400
*                             OWNERSHIP: SUPERVISOR CONTROL             09198800
*                             SERIALIZATION: DISABLEMENT                09199200
         DS    0D -           ALIGN LCCASRBF TO DOUBLE WORD      MDC009 09199600
LCCASRBF DS    0CL8 -         SRB FIELDS                         MDC009 09199700
LCCASAFN DC    H'0' -         CPU AFFINITY IF IN SRB MODE        MDC003 09199800
LCCAPGTA DC    XL6'00' -      ASID/TCB IF IN SRB MODE            MDC004 09199900
LCCAORMT DC    A(0) -         OLD SRB RMTR VALUE                   @P4A 09200000
*                             SERIALIZATION:  DISABLEMENT               09200100
*                             OWNERSHIP:  SUPERVISOR CONTROL            09200200
LCCASSTD EQU   X'80' -        SRB SUSPEND WITH TOKEN DISABLED BIT  @P4A 09200300
LCCASSTA EQU   X'40' -        SRB SUSPEND WITH TOKEN DISABLED      @P4A 09200400
*                             BECAUSE SRB WAS ABENDED BY PURGEDQ        09200500
*                             PROCESSING.                               09200600
LCCASSTE EQU   X'20' -        SRB SUSPEND WITH TOKEN DISABLED      @P4A 09200700
*                             BECAUSE SRB IS REALLY A SUSPEND EXIT.     09200800
LCCAR2DC DC    XL4'00' -      RESERVED                             @P4C 09200900
LCCAIOWA DC    A(0) -         ADDRESS OF IOS WORKAREA (MDCXXX) @G860PVB 09201000
LCCAIOR1 DC    F'0' -         RESERVED FOR IOS        (MDCXXX) @G860PVB 09201100
LCCAIOR2 DC    F'0' -         RESERVED FOR IOS        (MDCXXX) @G860PVB 09201200
LCCAIOR3 DC    F'0' -         RESERVED FOR IOS        (MDCXXX) @G860PVB 09201300
LCCAR2F0 DC    F'0'   -       RESERVED                             @L4A 09201400
LCCAPCR1 DS    0XL64  -       PROGRAM FLIH RECURSION CONTROL       @L4C 09201500
*                             REGISTER SAVEAREA 1                       09201600
LCCAP1C0 DC    F'0'   -       CONTROL REGISTER 0                   @L3A 09201700
LCCAP1C1 DC    F'0'   -       CONTROL REGISTER 1                   @L3A 09201800
LCCAP1C2 DC    F'0'   -       DUCT ORIGIN ADDRESS (CR2)            @L3A 09201900
LCCAPXM1 DS    0XL8   -       PROGRAM FLIH CROSS MEMORY CONTROL    @L3A 09202000
*                             REGISTER SAVEAREA 1 - MUST BE ON A        09202100
*                             DOUBLE WORD BOUNDARY.                @L3A 09202200
LCCAP1C3 DS    0F     -       CONTROL REGISTER 3                   @L3A 09202300
LCCAPX1K DC    H'0'   -       PROGRAM KEY MASK                     @L3A 09202400
LCCAPX1S DC    H'0'   -       SASN                                 @L3A 09202500
LCCAP1C4 DS    0F     -       CONTROL REGISTER 4                   @L3A 09202600
LCCAPX1A DC    H'0'   -       AX                                   @L3A 09202700
LCCAPX1P DC    H'0'   -       PASN                                 @L3A 09202800
LCCAP1C5 DC    F'0'   -       ASTE REAL ADDRESS  (CR5)             @L3A 09202900
LCCAP1C6 DC    F'0'   -       CONTROL REGISTER 6                   @L3A 09203000
LCCAP1C7 DC    F'0'   -       CONTROL REGISTER 7                   @L3A 09203100
LCCAP1C8 DS    0F     -       CONTROL REGISTER 8                   @L3A 09203200
LCCAPEX1 DC    H'0'   -       EAX VALUE   (LH CR8)                 @L3A 09203300
         DC    H'0'   -       SECOND HALF OF CR8                   @L3A 09203400
LCCAP1C9 DC    F'0'   -       CONTROL REGISTER 9                   @L3A 09203500
LCCAP1CA DC    F'0'   -       CONTROL REGISTER 10                  @L3A 09203600
LCCAP1CB DC    F'0'   -       CONTROL REGISTER 11                  @L3A 09203700
LCCAP1CC DC    F'0'   -       CONTROL REGISTER 12                  @L3A 09203800
LCCAP1CD DC    F'0'   -       CONTROL REGISTER 13                  @L3A 09203900
LCCAP1CE DC    F'0'   -       CONTROL REGISTER 14                  @L3A 09204000
LCCAP1CF DC    F'0'   -       PROGRAM FLIH RECURSION LINKAGE STACK @L3A 09204100
*                             ADDRESS SAVEAREA 1  (CR15)                09204200
LCCAWDT  DC    XL16'00'  -    WEB Distribution Table.  16 one-byte @LDC 09204300
*                             elements.                                 09204400
*                             INITIALIZED BY: IEAVINIT                  09204500
*                             SERIALIZATION: Disablement for current    09204600
*                                            processor's LCCAWDT.       09204700
*                             OWNERSHIP: Supervisor Control             09204800
LCCACWEB DC    A(0)  -        Address of the current workunit's    @LDC 09204900
*                             WEB                                       09205000
*                             SERIALIZATION: Disablement.  Global       09205100
*                                            Intersect is required to   09205200
*                                            change another processor's 09205300
*                                            LCCACWEB field.            09205400
*                             OWNERSHIP: Supervisor Control             09205500
LCCANWEB DC    A(0)  -        Address of the next WEB to be        @LDC 09205600
*                             dispatched on the current CPU.            09205700
*                             SERIALIZATION:  CS                        09205800
*                             OWNERSHIP: Supervisor Control             09205900
LCCAWUQI DC    H'0'  -        Dispatcher's current index into the  @08C 09206000
*                             WUQ Array (LCCAWUQA), used during         09206100
*                             Dispatcher Work Search.                   09206200
*                             SERIALIZATION:  Dispatcher Active         09206300
*                             OWNERSHIP: Supervisor Control             09206400
LCCAWUQR DC    H'0'  -        Dispatchers rescan count             @08A 09206500
LCCAWUQM DC    A(0)  -        Address of this processor's PWUQ.    @LDC 09206600
*                             SERIALIZATION: Global Intersect           09206700
*                             OWNERSHIP: Supervisor Control             09206800
LCCAFWP  DS    0CL8           Processor Free WEB Pool and count.   @LDA 09206900
*                             SERIALIZATION: Disablement for current    09207000
*                             processor's LCCAFWP                       09207100
*                             OWNERSHIP: Supervisor Control             09207200
LCCAFWPP DC    F'0'           Processor WEB Free Pool Header       @LDA 09207300
*                             SERIALIZATION: Disablement for current    09207400
*                                            processor's LCCAFWPP.      09207500
*                             OWNERSHIP: Supervisor Control             09207600
LCCAFWPC DC    F'0'           Processor WEB Free Pool element      @LDA 09207700
*                             count.                                    09207800
*                             SERIALIZATION: Disablement for current    09207900
*                                            processor's LCCAFWPC.      09208000
*                             OWNERSHIP: Supervisor Control             09208100
LCCAR35C DC    XL4'00'  -     RESERVED                             @LDC 09208200
LCCASMQJ DC    F'0' -         GLOBAL SERVICE MANAGER QUEUE (GSMQ) AND   09208300
*                             LOCAL SERVICE MANAGER QUEUE (LSMQ)        09208400
*                             JOURNAL WORD USED BY DISPATCHER AND       09208500
*                             SCHEDULE                           MDC044 09208600
LCCASPLJ DC    F'0' -         GLOBAL SYSTEM PRIORITY LIST (GSPL) AND    09208700
*                             LOCAL SYSTEM PRIORITY LIST (LSPL) JOURNAL 09208800
*                             WORD USED BY DISPATCHER            MDC045 09208900
LCCAETP  DC    F'0' -         UNPRODUCTIVE TASK PREEMPTION COUNT - @LGA 09209000
*                             NUMBER OF TASK TIME SLICE EXPIRATIONS     09209100
*                             THAT WERE NOT NEEDED  (External Flih      09209200
*                             Detected)                                 09209300
*                             OWNERSHIP: SRM                            09209400
LCCAETPB DC    F'0' -         UNPRODUCTIVE TASK PREEMPTION COUNT   @LGA 09209500
*                             BASE - PREVIOUS VALUE OF LCCAETP          09209600
*                             OWNERSHIP: SRM                            09209700
LCCAR370 DC    XL12'00' -     RESERVED                             @LHC 09209800
LCCARWQL DC    A(0)     -     Recovery word for WebQLock address   @LHC 09209900
*                             Ownership: Supervisor Control        @LHC 09210000
*                             Serialization: Disablement           @LHC 09210100
LCCASGPR DC    16F'0' -       SVC FLIH GENERAL REGISTER SAVE AREA       09210200
*                             (MDC301)                         @ZA02598 09210300
LCCADS0F DC    XL1'00' -      DISPATCHER DIAGNOSTIC EXIT FLAG BYTE @L4C 09210400
LCCADSE1 EQU   X'80'   -      DISPATCHER UNLOCKED TASK DISPATCH    @L4A 09210500
*                             DIAGNOSTIC EXIT ROUTED CONTROL            09210600
LCCADSE2 EQU   X'40'   -      DISPATCHER LOCKED TASK DISPATCH      @L4A 09210700
*                             DIAGNOSTIC EXIT ROUTED CONTROL            09210800
LCCADSE3 EQU   X'20'   -      DISPATCHER SRB DISPATCH DIAGNOSTIC   @L4A 09210900
*                             EXIT ROUTED CONTROL                       09211000
LCCADSE4 EQU   X'10'   -      DISPATCHER SSRB DISPATCH DIAGNOSTIC  @L4A 09211100
*                             EXIT ROUTED CONTROL                       09211200
LCCADSE5 EQU   X'08'   -      DISPATCHER WAIT TASK DISPATCH        @L4A 09211300
*                             DIAGNOSTIC EXIT ROUTED CONTROL            09211400
LCCAFPFL DC    XL1'00' -      Floating point Flags                 @LJA 09211500
LCCABFP  EQU   X'10'          Extended FP status is being saved    @LJA 09212100
LCCABFPH EQU   X'01'          BFP hardware is present. This bit is a   *09212500
                              duplicate of CVTBFPH so that dat-off     *09212600
                              reference can be made. It is set only at *09212700
                              IPL and when a processor is brought      *09212800
                              online                               @LJA 09212900
LCCAPERC DC    XL2'00' -      PROGRAM EVENT RECORDING CODE              09213000
*                             (MDC326)                         @G65RP9A 09213100
LCCAPERA DC    A(0) -         PER ADDRESS  (MDC327)            @G65RP9A 09213200
LCCASDUV DC    A(0)   -       SRB RELATED DUCT VIRTUAL ADDRESS     @L3C 09213300
LCCASDUR DC    A(0)   -       SRB RELATED DUCT REAL ADDRESS        @L3A 09213400
LCCAIDUV DC    A(0)   -       INTERRUPT HANDLER DUCT VIRTUAL       @L3C 09213500
*                             ADDRESS                                   09213600
LCCAIDUR DC    A(0)   -       INTERRUPT HANDLER DUCT REAL ADDRESS  @L3A 09213700
LCCASCW1 DC    A(0)   -       SUPERVISOR CONTROL WORK AREA 1       @LCA 09213800
*                             USED BY VARIOUS SUPERVISORY ROUTINES      09213900
*                             PRESERVED ACROSS CALLS TO IEAVECMS        09214000
*                             OWNERSHIP: SUPERVISOR CONTROL             09214100
*                             SERIALIZATION: DISABLEMENT                09214200
LCCASCW2 DC    A(0)   -       SUPERVISOR CONTROL WORK AREA 2       @LCA 09214300
*                             USED BY VARIOUS SUPERVISORY ROUTINES      09214400
*                             PRESERVED ACROSS CALLS TO IEAVECMS        09214500
*                             OWNERSHIP: SUPERVISOR CONTROL             09214600
*                             SERIALIZATION: DISABLEMENT                09214700
LCCASXMR DC    XL8'0'         SVC FLIH CROSS MEMORY CONTROL             09214800
*                             REGISTER SAVE AREA      (MDC338) @G383P9A 09214900
LCCALKG1 DC    XL72'00' -     LOCK MANAGER REGISTER SAVE AREA           09215000
*                                                     (MDC342) @G383P9A 09215100
LCCALKG2 DC    XL64'00' -     LOCK MANAGER SUSPENSION REGISTER          09215200
*                             SAVE AREA               (MDC342) @G383P9A 09215300
LCCAELKP DC    XL8'00' -      LOCK MANAGER PSW SAVE AREA                09215400
*                                                     (MDC342) @G383P9A 09215500
LCCASTG1 DC    18F'0' -       STATUS REGISTER SAVE AREA                 09215600
*                                                     (MDC338) @G383P9A 09215700
LCCASCSA DC    5F'0' -        PCLINK SAVE AREA FOR REGISTERS            09215800
*                             8-12 (CALLER'S REGISTERS)                 09215900
*                                                     (MDC341) @G383P9A 09216000
LCCASREG DC    13F'0' -       PCLINK SAVE AREA        (MDC341) @G383P9A 09216100
LCCASMSK DC    XL1'0' -       PCLINK SYSTEM MASK      (MDC341) @G383P9A 09216200
LCCARSMK DC    XL1'0' -       RESUME/TCTL SYSTEM MASK (MDC340) @G383P9A 09216300
LCCAPGMM DC    XL1'0' -       PCLINK PROGRAM MASK     (MDC341) @G383P9A 09216400
LCCATCFB DC    XL1'00' -      RESUME/TCTL RECOVERY FOOTPRINT   @G383P9A 09216500
*                             BYTE                    (MDC346) @G383P9A 09216600
LCCATCTL EQU   X'80' -        TCTL IN CONTROL AT ABEND         @G383P9A 09216700
*                                                     (MDC346) @G383P9A 09216800
LCCATCAC EQU   X'40' -        TCBACTIV AND TCBS3A SET (MDC346) @G383P9A 09216900
LCCARSME DS    0F -           RESUME REGISTER SAVE AREA FOR REGISTERS   09217000
*                             11-4                    (MDC338) @G383P9A 09217100
LCCARES1 DC    7F'0' -        RESUME REGISTER SAVE AREA FOR REG 11 -    09217200
*                             REG 1                   (MDC338) @G383P9A 09217300
LCCARES2 DC    3F'0' -        RESUME REGISTER SAVE AREA FOR REG 2 -     09217400
*                             REG 4                   (MDC338) @G383P9A 09217500
LCCASPSW DC    F'0' -         SYSTEM MASK SAVE AREA, USED BY            09217600
*                             MACHINE CHECK HANDLER            @YA07494 09217700
LCCASRGS DC    F'0' -         RETURN ADDRESS SAVE AREA, USED BY         09217800
*                             MACHINE CHECK HANDLER            @YA07494 09217900
LCCAPRMW DC    A(0) -         Address of the WEB on whose behalf   @LDC 09218000
*                             a priority promotion was initiated.       09218100
*                             SERIALIATION: Dispatcher Active           09218200
*                             OWNERSHIP: Supervisor Control             09218300
LCCAPTCB DC    A(0) -         ADDRESS OF THE TCB ON WHOSE      @G383P9A 09218400
*                             BEHALF A PRIORITY PROMOTION WAS  @G383P9A 09218500
*                             INITIATED.              (MDC347) @G383P9A 09218600
LCCAPRTN DC    A(0) -         DISPATCHER RETURN POINT IF NO    @G383P9A 09218700
*                             DISPATCHABLE WORK IS FOUND IN A  @G383P9A 09218800
*                             PROMOTED ADDRESS SPACE. (MDC347) @G383P9A 09218900
LCCACDXM DC    2F'0' -        CALLDISP XMEM SAVE AREA (MDC338) @G383P9A 09219000
LCCASRXM DS    0CL8  -        CROSS MEMORY SAVE AREA FOR           @L4C 09219100
*                             STOP/RESET AND SRB STATUS                 09219200
*                             SAVE/RESTORE/MODIFY ROUTINES.             09219300
LCCASRSA DC    F'0'  -        STOP/RESET IAC SAVE AREA             @L4A 09219400
LCCASRTK DC    F'0'  -        HOLDS SSARTO TOKEN FOR STOP/RESET    @L4A 09219500
LCCACR8W DC    F'0' -         WORK AREA FOR CONTROL REG 8      @YA16565 09219600
LCCAIOXM DS    0XL12 -        IOS CROSS MEMORY SAVE                     09219700
*                             AREA                    (MDC339) @G383P9A 09219800
LCCAIOSS DC    F'0' -         IOS PSW S-BIT REGISTER SAVE AREA          09219900
*                                                     (MDC339) @G387PXH 09220000
LCCAIOC3 DC    F'0' -         IOS CONTROL REGISTER 3 SAVE AREA          09220100
*                                                     (MDC339) @G383P9A 09220200
LCCAIOC4 DC    F'0' -         IOS CONTROL REGISTER 4 SAVE AREA          09220300
*                                                     (MDC339) @G383P9A 09220400
LCCABBRC DC    F'0' -         BIND BREAK COMMUNICATION BUFFER USED      09220500
*                             BY IEAVEBBR             (MDC344) @G383P9A 09220600
LCCACDSV DS    0CL64 -        CALLDISP SERVICE ROUTINE REGISTER SAVE    09220700
*                             AREA FOR REGISTERS 0-15 (MDC344) @G383P9A 09220800
LCCACDS0 DC    F'0' -         CALLDISP REGISTER 0 SAVE AREA             09220900
*                                                     (MDC344) @G383P9A 09221000
LCCACDS1 DC    F'0' -         CALLDISP REGISTER 1 SAVE AREA             09221100
*                                                     (MDC344) @G383P9A 09221200
LCCACDS2 DC    F'0' -         CALLDISP REGISTER 2 SAVE AREA             09221300
*                                                     (MDC344) @G383P9A 09221400
LCCACDS3 DC    F'0' -         CALLDISP REGISTER 3 SAVE AREA             09221500
*                                                     (MDC344) @G383P9A 09221600
LCCACDS4 DC    F'0' -         CALLDISP REGISTER 4 SAVE AREA             09221700
*                                                     (MDC344) @G383P9A 09221800
LCCACDS5 DC    F'0' -         CALLDISP REGISTER 5 SAVE AREA             09221900
*                                                     (MDC344) @G383P9A 09222000
LCCACDS6 DC    F'0' -         CALLDISP REGISTER 6 SAVE AREA             09222100
*                                                     (MDC344) @G383P9A 09222200
LCCACDS7 DC    F'0' -         CALLDISP REGISTER 7 SAVE AREA             09222300
*                                                     (MDC344) @G383P9A 09222400
LCCACDS8 DC    F'0' -         CALLDISP REGISTER 8 SAVE AREA             09222500
*                                                     (MDC344) @G383P9A 09222600
LCCACDS9 DC    F'0' -         CALLDISP REGISTER 9 SAVE AREA             09222700
*                                                     (MDC344) @G383P9A 09222800
LCCACDSA DC    F'0' -         CALLDISP REGISTER 10 SAVE AREA            09222900
*                                                     (MDC344) @G383P9A 09223000
LCCACDSB DC    F'0' -         CALLDISP REGISTER 11 SAVE AREA            09223100
*                                                     (MDC344) @G383P9A 09223200
LCCACDSC DC    F'0' -         CALLDISP REGISTER 12 SAVE AREA            09223300
*                                                     (MDC344) @G383P9A 09223400
LCCACDSD DC    F'0' -         CALLDISP REGISTER 13 SAVE AREA            09223500
*                                                     (MDC344) @G383P9A 09223600
LCCACDSE DC    F'0' -         CALLDISP REGISTER 14 SAVE AREA            09223700
*                                                     (MDC344) @G383P9A 09223800
LCCACDSF DC    F'0' -         CALLDISP REGISTER 15 SAVE AREA            09223900
*                                                     (MDC344) @G383P9A 09224000
LCCASLSA DC    16F'0' -       LCCA SINGLE LEVEL SAVE AREA USED BY       09224100
*                             MACHINE CHECK HANDLER   (MDC344) @G383P9A 09224200
LCCARWEB DC    A(0)   -       Address of WEB expected to be locked @P7A 09224300
*                             by this CPU on entry to global recovery.  09224400
LCCARWLK EQU   X'80'          Indicator that WEB in LCCARWEB is    @P9C 09224500
*                             not validly locked but the AWQ lock for   09224600
*                             the WEB can be held by this CPU           09224700
LCCAPOST DC    10F'0' -       POST SAVE AREA FOR                        09224800
*                             SRB POOL MANAGER                 @G860PXF 09224900
LCCAALOV DC    A(0)   -       SRB RELATED AL VIRTUAL ADDRESS OR    @L3C 09225000
*                             ZERO (ZERO MEANS THE NULL OR BASIC        09225100
*                             ACCESS LIST)                              09225200
LCCAPSB2 DC    A(0)   -       ASCB ADDRESS WHERE PAGE/SEGMENT      @L3A 09225300
*                             FAULT OCCURRED                            09225400
LCCALSSD DC    A(0)   -       LSSD ADDRESS FOR THE PROCESSOR       @L3C 09225500
*                             RELATED SRB LINKAGE STACK                 09225600
LCCALSDP DC    A(0)   -       ADDRESS OF THE FIRST LSED IN THE     @L3A 09225700
*                             PROCESSOR RELATED SRB LINKAGE STACK       09225800
LCCAXTIM DC    XL8'00' -      EXTERNAL FLIH TIMER                       09225900
*                             SAVE AREA 1                          @LLC 09226000
LCCAPAR3 DS    0XL64  -       PROGRAM FLIH RECURSION MC ACCESS     @L4C 09226100
*                             REGISTER SAVEAREA 3                       09226200
LCCAP3A0 DC    F'0'   -       ACCESS REGISTER 0                    @L3A 09226300
LCCAP3A1 DC    F'0'   -       ACCESS REGISTER 1                    @L3A 09226400
LCCAP3A2 DC    F'0'   -       ACCESS REGISTER 2                    @L3A 09226500
LCCAP3A3 DC    F'0'   -       ACCESS REGISTER 3                    @L3A 09226600
LCCAP3A4 DC    F'0'   -       ACCESS REGISTER 4                    @L3A 09226700
LCCAP3A5 DC    F'0'   -       ACCESS REGISTER 5                    @L3A 09226800
LCCAP3A6 DC    F'0'   -       ACCESS REGISTER 6                    @L3A 09226900
LCCAP3A7 DC    F'0'   -       ACCESS REGISTER 7                    @L3A 09227000
LCCAP3A8 DC    F'0'   -       ACCESS REGISTER 8                    @L3A 09227100
LCCAP3A9 DC    F'0'   -       ACCESS REGISTER 9                    @L3A 09227200
LCCAP3AA DC    F'0'   -       ACCESS REGISTER 10                   @L3A 09227300
LCCAP3AB DC    F'0'   -       ACCESS REGISTER 11                   @L3A 09227400
LCCAP3AC DC    F'0'   -       ACCESS REGISTER 12                   @L3A 09227500
LCCAP3AD DC    F'0'   -       ACCESS REGISTER 13                   @L3A 09227600
LCCAP3AE DC    F'0'   -       ACCESS REGISTER 14                   @L3A 09227700
LCCAP3AF DC    F'0'   -       ACCESS REGISTER 15                   @L3A 09227800
LCCAEMS0 DC    16F'0' -       IEAVWUQA REGISTER SAVE AREA          @LDC 09227900
LCCAPPS1 DC    D'0' -         PROGRAM FLIH RECURSION PSW SAVE AREA 1    09228000
*                                                              @G860PXK 09228100
LCCAPIC1 DC    XL4'0' -       PROGRAM FLIH RECURSION ILC AND            09228200
*                             INTERRUPT CODE SAVE AREA 1       @G860PXK 09228300
LCCAPTE1 DC    XL4'0' -       PROGRAM FLIH RECURSION TRANSLATION        09228400
*                             EXCEPTION ADDRESS SAVE AREA 1             09228500
LCCAPGR4 DC    16F'0' -       PROGRAM FLIH REGISTER SAVE                09228600
*                             AREA 4                           @G860PXK 09228700
LCCAPSLI DC    18F'0' -       PROGRAM FLIH SAVE AREA TO PASS TO         09228800
*                             SLIH ROUTINES                    @G860PXK 09228900
LCCALSHD DC    A(0)   -       LSSD ADDRESS FOR THE INTERRUPT       @L3C 09229000
*                             HANDLER LINKAGE STACK                     09229100
LCCALSHP DC    A(0)   -       ADDRESS OF THE FIRST LSED IN THE     @L3A 09229200
*                             INTERRUPT HANDLER LINKAGE STACK           09229300
LCCAPPS3 DC    D'0'   -       PROGRAM FLIH RECURSION PSW SAVE AREA 3    09229400
*                                                              @G860PXK 09229500
LCCAPIC3 DC    XL4'0' -       PROGRAM FLIH RECURSION ILC AND            09229600
*                             INTERRUPT CODE SAVE AREA 3       @G860PXK 09229700
LCCAPTE3 DC    XL4'0' -       PROGRAM FLIH RECURSION TRANSLATION        09229800
*                             EXCEPTION ADDRESS SAVE AREA 3    @G860PXK 09229900
LCCAPAR1 DS    0XL64  -       PROGRAM FLIH RECURSION ACCESS        @L4C 09230000
*                             REGISTER SAVEAREA 1                       09230100
LCCAP1A0 DC    F'0'   -       ACCESS REGISTER 0                    @L3A 09230200
LCCAP1A1 DC    F'0'   -       ACCESS REGISTER 1                    @L3A 09230300
LCCAP1A2 DC    F'0'   -       ACCESS REGISTER 2                    @L3A 09230400
LCCAP1A3 DC    F'0'   -       ACCESS REGISTER 3                    @L3A 09230500
LCCAP1A4 DC    F'0'   -       ACCESS REGISTER 4                    @L3A 09230600
LCCAP1A5 DC    F'0'   -       ACCESS REGISTER 5                    @L3A 09230700
LCCAP1A6 DC    F'0'   -       ACCESS REGISTER 6                    @L3A 09230800
LCCAP1A7 DC    F'0'   -       ACCESS REGISTER 7                    @L3A 09230900
LCCAP1A8 DC    F'0'   -       ACCESS REGISTER 8                    @L3A 09231000
LCCAP1A9 DC    F'0'   -       ACCESS REGISTER 9                    @L3A 09231100
LCCAP1AA DC    F'0'   -       ACCESS REGISTER 10                   @L3A 09231200
LCCAP1AB DC    F'0'   -       ACCESS REGISTER 11                   @L3A 09231300
LCCAP1AC DC    F'0'   -       ACCESS REGISTER 12                   @L3A 09231400
LCCAP1AD DC    F'0'   -       ACCESS REGISTER 13                   @L3A 09231500
LCCAP1AE DC    F'0'   -       ACCESS REGISTER 14                   @L3A 09231600
LCCAP1AF DC    F'0'   -       ACCESS REGISTER 15                   @L3A 09231700
LCCAPAR4 DS    0XL64  -       PROGRAM FLIH ACCESS REGISTER         @L4C 09231800
*                             SAVEAREA 4                                09231900
LCCAP4A0 DC    F'0'   -       ACCESS REGISTER 0                    @L3A 09232000
LCCAP4A1 DC    F'0'   -       ACCESS REGISTER 1                    @L3A 09232100
LCCAP4A2 DC    F'0'   -       ACCESS REGISTER 2                    @L3A 09232200
LCCAP4A3 DC    F'0'   -       ACCESS REGISTER 3                    @L3A 09232300
LCCAP4A4 DC    F'0'   -       ACCESS REGISTER 4                    @L3A 09232400
LCCAP4A5 DC    F'0'   -       ACCESS REGISTER 5                    @L3A 09232500
LCCAP4A6 DC    F'0'   -       ACCESS REGISTER 6                    @L3A 09232600
LCCAP4A7 DC    F'0'   -       ACCESS REGISTER 7                    @L3A 09232700
LCCAP4A8 DC    F'0'   -       ACCESS REGISTER 8                    @L3A 09232800
LCCAP4A9 DC    F'0'   -       ACCESS REGISTER 9                    @L3A 09232900
LCCAP4AA DC    F'0'   -       ACCESS REGISTER 10                   @L3A 09233000
LCCAP4AB DC    F'0'   -       ACCESS REGISTER 11                   @L3A 09233100
LCCAP4AC DC    F'0'   -       ACCESS REGISTER 12                   @L3A 09233200
LCCAP4AD DC    F'0'   -       ACCESS REGISTER 13                   @L3A 09233300
LCCAP4AE DC    F'0'   -       ACCESS REGISTER 14                   @L3A 09233400
LCCAP4AF DC    F'0'   -       ACCESS REGISTER 15                   @L3A 09233500
LCCARARS DS    0XL64  -       RESTART FLIH ACCESS REGISTER         @L4C 09233600
*                             SAVEAREA                                  09233700
LCCARAR0 DC    F'0'   -       ACCESS REGISTER 0                    @L3A 09233800
LCCARAR1 DC    F'0'   -       ACCESS REGISTER 1                    @L3A 09233900
LCCARAR2 DC    F'0'   -       ACCESS REGISTER 2                    @L3A 09234000
LCCARAR3 DC    F'0'   -       ACCESS REGISTER 3                    @L3A 09234100
LCCARAR4 DC    F'0'   -       ACCESS REGISTER 4                    @L3A 09234200
LCCARAR5 DC    F'0'   -       ACCESS REGISTER 5                    @L3A 09234300
LCCARAR6 DC    F'0'   -       ACCESS REGISTER 6                    @L3A 09234400
LCCARAR7 DC    F'0'   -       ACCESS REGISTER 7                    @L3A 09234500
LCCARAR8 DC    F'0'   -       ACCESS REGISTER 8                    @L3A 09234600
LCCARAR9 DC    F'0'   -       ACCESS REGISTER 9                    @L3A 09234700
LCCARARA DC    F'0'   -       ACCESS REGISTER 10                   @L3A 09234800
LCCARARB DC    F'0'   -       ACCESS REGISTER 11                   @L3A 09234900
LCCARARC DC    F'0'   -       ACCESS REGISTER 12                   @L3A 09235000
LCCARARD DC    F'0'   -       ACCESS REGISTER 13                   @L3A 09235100
LCCARARE DC    F'0'   -       ACCESS REGISTER 14                   @L3A 09235200
LCCARARF DC    F'0'   -       ACCESS REGISTER 15                   @L3A 09235300
LCCAR820 DC    H'0'   -       RESERVED                             @LMC 09235500
LCCAOILC DC    H'0'   -       Original ILC. Only valid when        @LMA 09235700
*                             LCCAFPPE is on.                      @LMA 09235900
LCCAPCR3 DS    0XL64  -       PROGRAM FLIH RECURSION MC CONTROL    @L4C 09236100
*                             REGISTER SAVEAREA 3                       09236300
LCCAP3C0 DC    F'0'   -       CONTROL REGISTER 0                   @L3A 09236500
LCCAP3C1 DC    F'0'   -       CONTROL REGISTER 1                   @L3A 09236700
LCCAP3C2 DC    F'0'   -       DUCT ORIGIN ADDRESS   (CR2)          @L3A 09236900
LCCAPXM3 DS    0XL8   -       PROGRAM FLIH CROSS MEMORY CONTROL    @L3A 09237100
*                             REGISTER SAVEAREA 3 - MUST BE ON A        09237300
*                             DOUBLE WORD BOUNDARY.                @L3A 09237500
LCCAP3C3 DS    0F     -       CONTROL REGISTER 3                   @L3A 09237700
LCCAPX3K DC    H'0'   -       PROGRAM KEY MASK                     @L3A 09237900
LCCAPX3S DC    H'0'   -       SASN                                 @L3A 09238100
LCCAP3C4 DS    0F     -       CONTROL REGISTER 4                   @L3A 09238300
LCCAPX3A DC    H'0'   -       AX                                   @L3A 09238500
LCCAPX3P DC    H'0'   -       PASN                                 @L3A 09238700
LCCAP3C5 DC    F'0'   -       ASTE REAL ADDRESS  (CR5)             @L3A 09238900
LCCAP3C6 DC    F'0'   -       CONTROL REGISTER 6                   @L3A 09239100
LCCAP3C7 DC    F'0'   -       CONTROL REGISTER 7                   @L3A 09239300
LCCAP3C8 DS    0F     -       CONTROL REGISTER 8                   @L3A 09239500
LCCAPEX3 DC    H'0'   -       EAX VALUE   (LH CR8)                 @L3A 09239700
         DC    H'0'   -       SECOND HALF OF CR8                   @L3A 09239900
LCCAP3C9 DC    F'0'   -       CONTROL REGISTER 9                   @L3A 09240100
LCCAP3CA DC    F'0'   -       CONTROL REGISTER 10                  @L3A 09240300
LCCAP3CB DC    F'0'   -       CONTROL REGISTER 11                  @L3A 09240500
LCCAP3CC DC    F'0'   -       CONTROL REGISTER 12                  @L3A 09240700
LCCAP3CD DC    F'0'   -       CONTROL REGISTER 13                  @L3A 09240900
LCCAP3CE DC    F'0'   -       CONTROL REGISTER 14                  @L3A 09241100
LCCAP3CF DC    F'0'   -       PROGRAM FLIH RECURSION LINKAGE STACK @L3A 09241300
*                             ADDRESS SAVEAREA 3  (CR15)                09241500
LCCAPCR4 DS    0XL64  -       PROGRAM FLIH CONTROL REGISTER        @L4C 09241700
*                             SAVEAREA 4                                09241900
LCCAP4C0 DC    F'0'   -       CONTROL REGISTER 0                   @L3A 09242100
LCCAP4C1 DC    F'0'   -       CONTROL REGISTER 1                   @L3A 09242300
LCCAP4C2 DC    F'0'   -       DUCT ORIGIN ADDRESS   (CR2)          @L3A 09242500
LCCAPXM4 DS    0XL8   -       PROGRAM FLIH CROSS MEMORY CONTROL    @L3A 09242700
*                             REGISTER SAVEAREA 4 - MUST BE ON A        09242900
*                             DOUBLE WORD BOUNDARY.                @L3A 09243100
LCCAP4C3 DS    0F     -       CONTROL REGISTER 3                   @L3A 09243300
LCCAPX4K DC    H'0'   -       PROGRAM KEY MASK                     @L3A 09243500
LCCAPX4S DC    H'0'   -       SASN                                 @L3A 09243700
LCCAP4C4 DS    0F     -       CONTROL REGISTER 4                   @L3A 09243900
LCCAPX4A DC    H'0'   -       AX                                   @L3A 09244100
LCCAPX4P DC    H'0'   -       PASN                                 @L3A 09244300
LCCAP4C5 DC    F'0'   -       ASTE REAL ADDRESS  (CR5)             @L3A 09244500
LCCAP4C6 DC    F'0'   -       CONTROL REGISTER 6                   @L3A 09244700
LCCAP4C7 DC    F'0'   -       CONTROL REGISTER 7                   @L3A 09244900
LCCAP4C8 DS    0F     -       CONTROL REGISTER 8                   @L3A 09245100
LCCAPEX4 DC    H'0'   -       EAX VALUE   (LH CR8)                 @L3A 09245300
         DC    H'0'   -       SECOND HALF OF CR8                   @L3A 09245500
LCCAP4C9 DC    F'0'   -       CONTROL REGISTER 9                   @L3A 09245700
LCCAP4CA DC    F'0'   -       CONTROL REGISTER 10                  @L3A 09245900
LCCAP4CB DC    F'0'   -       CONTROL REGISTER 11                  @L3A 09246100
LCCAP4CC DC    F'0'   -       CONTROL REGISTER 12                  @L3A 09246300
LCCAP4CD DC    F'0'   -       CONTROL REGISTER 13                  @L3A 09246500
LCCAP4CE DC    F'0'   -       CONTROL REGISTER 14                  @L3A 09246700
LCCAP4CF DC    F'0'   -       PROGRAM FLIH RECURSION LINKAGE STACK @L3A 09246900
*                             ADDRESS SAVEAREA 4  (CR15)                09247100
LCCARCRS DS    0XL64  -       RESTART FLIH CONTROL REGISTER        @L4C 09247300
*                             SAVEAREA                                  09247500
LCCARCR0 DC    F'0'   -       CONTROL REGISTER 0                   @L3A 09247700
LCCARCR1 DC    F'0'   -       CONTROL REGISTER 1                   @L3A 09247900
LCCARCR2 DC    F'0'   -       DUCT ORIGIN ADDRESS  (CR2)           @L3A 09248100
LCCARXMR DS    0XL8   -       RESTART FLIH CROSS MEMORY CONTROL    @L3A 09248300
*                             REGISTER SAVEAREA - MUST BE ON A          09248500
*                             DOUBLE WORD BOUNDARY.                @L3A 09248700
LCCARCR3 DS    0F     -       CONTROL REGISTER 3                   @L3A 09248900
LCCARXRK DC    H'0'   -       PROGRAM KEY MASK                     @L3A 09249100
LCCARXRS DC    H'0'   -       SASN                                 @L3A 09249300
LCCARCR4 DS    0F     -       CONTROL REGISTER 4                   @L3A 09249500
LCCARXRA DC    H'0'   -       AX                                   @L3A 09249700
LCCARXRP DC    H'0'   -       PASN                                 @L3A 09249900
LCCARCR5 DC    F'0'   -       CONTROL REGISTER 5                   @L3A 09250100
LCCARCR6 DC    F'0'   -       CONTROL REGISTER 6                   @L3A 09250300
LCCARCR7 DC    F'0'   -       CONTROL REGISTER 7                   @L3A 09250500
LCCARCR8 DS    0F     -       CONTROL REGISTER 8                   @L3A 09250700
LCCAREAX DC    H'0'   -       EAX VALUE  (LH CR8)                  @L3A 09250900
         DC    H'0'   -       SECOND HALF OF CR8                   @L3A 09251100
LCCARCR9 DC    F'0'   -       CONTROL REGISTER 9                   @L3A 09251300
LCCARCRA DC    F'0'   -       CONTROL REGISTER 10                  @L3A 09251500
LCCARCRB DC    F'0'   -       CONTROL REGISTER 11                  @L3A 09251700
LCCARCRC DC    F'0'   -       CONTROL REGISTER 12                  @L3A 09251900
LCCARCRD DC    F'0'   -       CONTROL REGISTER 13                  @L3A 09252100
LCCARCRE DC    F'0'   -       CONTROL REGISTER 14                  @L3A 09252300
LCCARCRF DC    F'0'   -       LINKAGE STACK ENTRY ADDRESS  (CR15)  @L3A 09252500
LCCAPGR5 DC    16F'0' -       PROGRAM FLIH RECURSION REGISTER      @L5A 09252700
*                             SAVE AREA 5                               09252900
LCCAPSB5 DC    F'0'   -       ASCB ADDRESS WHERE PAGE/SEGMENT      @L5A 09253100
*                             FAULT OCCURRED                            09253300
LCCAPAR5 DS    0XL64  -       PROGRAM FLIH RECURSION ACCESS        @L5A 09253500
*                             REGISTER SAVEAREA 5                       09253700
LCCAP5A0 DC    F'0'   -       ACCESS REGISTER 0                    @L5A 09253900
LCCAP5A1 DC    F'0'   -       ACCESS REGISTER 1                    @L5A 09254100
LCCAP5A2 DC    F'0'   -       ACCESS REGISTER 2                    @L5A 09254300
LCCAP5A3 DC    F'0'   -       ACCESS REGISTER 3                    @L5A 09254500
LCCAP5A4 DC    F'0'   -       ACCESS REGISTER 4                    @L5A 09254700
LCCAP5A5 DC    F'0'   -       ACCESS REGISTER 5                    @L5A 09254900
LCCAP5A6 DC    F'0'   -       ACCESS REGISTER 6                    @L5A 09255100
LCCAP5A7 DC    F'0'   -       ACCESS REGISTER 7                    @L5A 09255300
LCCAP5A8 DC    F'0'   -       ACCESS REGISTER 8                    @L5A 09255500
LCCAP5A9 DC    F'0'   -       ACCESS REGISTER 9                    @L5A 09255700
LCCAP5AA DC    F'0'   -       ACCESS REGISTER 10                   @L5A 09255900
LCCAP5AB DC    F'0'   -       ACCESS REGISTER 11                   @L5A 09256100
LCCAP5AC DC    F'0'   -       ACCESS REGISTER 12                   @L5A 09256300
LCCAP5AD DC    F'0'   -       ACCESS REGISTER 13                   @L5A 09256500
LCCAP5AE DC    F'0'   -       ACCESS REGISTER 14                   @L5A 09256700
LCCAP5AF DC    F'0'   -       ACCESS REGISTER 15                   @L5A 09256900
LCCAPTR5 DC    XL1'00' -      PROGRAM FLIH RECURSION TEA AR NUMBER @L5A 09257100
*                             SAVEAREA 5                                09257300
LCCAPMFV DC    XL1'00' -      RECURSIVE PAGE FAULT MAINLINE        @L5A 09257500
*                             FUNCTION VALUE SAVEAREA                   09257700
LCCADIEP DC    H'0'   -       PASN value set by previous CMSET     @0EC 09257900
*                             SET,DIE=YES,... Used by program FLIH to   09258100
*                             determine whether a SSE program           09258300
*                             interrupt is valid.                  @0EC 09258500
LCCAPCR5 DS    0XL64  -       PROGRAM FLIH RECURSION CONTROL       @L5A 09258700
*                             REGISTER SAVEAREA 5                       09258900
LCCAP5C0 DC    F'0'   -       CONTROL REGISTER 0                   @L5A 09259100
LCCAP5C1 DC    F'0'   -       CONTROL REGISTER 1                   @L5A 09259300
LCCAP5C2 DC    F'0'   -       DUCT ORIGIN ADDRESS   (CR2)          @L5A 09259500
LCCAPXM5 DS    0XL8   -       PROGRAM FLIH CROSS MEMORY CONTROL    @L5A 09259700
*                             REGISTER SAVEAREA 5 - MUST BE ON A        09259900
*                             DOUBLE WORD BOUNDARY.                     09260100
LCCAP5C3 DS    0F     -       CONTROL REGISTER 3                   @L5A 09260300
LCCAPX5K DC    H'0'   -       PROGRAM KEY MASK                     @L5A 09260500
LCCAPX5S DC    H'0'   -       SASN                                 @L5A 09260700
LCCAP5C4 DS    0F     -       CONTROL REGISTER 4                   @L5A 09260900
LCCAPX5A DC    H'0'   -       AX                                   @L5A 09261100
LCCAPX5P DC    H'0'   -       PASN                                 @L5A 09261300
LCCAP5C5 DC    F'0'   -       ASTE REAL ADDRESS  (CR5)             @L5A 09261500
LCCAP5C6 DC    F'0'   -       CONTROL REGISTER 6                   @L5A 09261700
LCCAP5C7 DC    F'0'   -       CONTROL REGISTER 7                   @L5A 09261900
LCCAP5C8 DS    0F     -       CONTROL REGISTER 8                   @L5A 09262100
LCCAPEX5 DC    H'0'   -       EAX VALUE   (LH CR8)                 @L5A 09262300
         DC    H'0'   -       SECOND HALF OF CR8                   @L5A 09262500
LCCAP5C9 DC    F'0'   -       CONTROL REGISTER 9                   @L5A 09262700
LCCAP5CA DC    F'0'   -       CONTROL REGISTER 10                  @L5A 09262900
LCCAP5CB DC    F'0'   -       CONTROL REGISTER 11                  @L5A 09263100
LCCAP5CC DC    F'0'   -       CONTROL REGISTER 12                  @L5A 09263300
LCCAP5CD DC    F'0'   -       CONTROL REGISTER 13                  @L5A 09263500
LCCAP5CE DC    F'0'   -       CONTROL REGISTER 14                  @L5A 09263700
LCCAP5CF DC    F'0'   -       PROGRAM FLIH RECURSION LINKAGE STACK @L5A 09263900
*                             ADDRESS SAVEAREA 5  (CR15)                09264100
LCCADSA5 DS    A      -       REAL ADDRESS OF THE DATA SPACE       @L6C 09264300
*                             ASTE CAUSING THE RECURSIVE FAULT.         09264500
LCCAPPS5 DC    D'0'   -       PROGRAM FLIH RECURSION PSW SA 5      @L5A 09264700
LCCAPIC5 DC    XL4'0' -       PROGRAM FLIH RECURSION ILC AND       @L5A 09264900
*                             INTERRUPT CODE SAVE AREA 5                09265100
LCCAPTE5 DS    0F             PROGRAM FLIH RECURSION TRANSLATION   @L5A 09265300
*                             EXCEPTION ADDRESS SAVE AREA 5             09265500
         DC    XL3'0' -       FIRST THREE BYTES OF ADDRESS         @L5A 09265700
LCCAPSTL DC    XL1'0' -       LAST BYTE OF LCCAPTE5                @L5A 09265900
*                                    X '00' - PRIMARY STD USED          09266100
*                                    X '01' - STD WAS AR QUALIFIED      09266300
*                                    X '02' - SECONDARY STD USED        09266500
*                                    X '03' - HOME STD USED.            09266700
         DS    0F                                                  @D2A 09266900
LCCATTSC DS    0XL8   -       Workunit Time Slice Interval         @LHC 09267100
*                             Ownership: SRM                            09267300
*                             Serialization: SRM Lock.                  09267500
LCCATTS1 DC    F'0'   -       High Order 32 bits of LCCATTSC       @LHC 09267700
*                             Ownership: SRM                            09267900
*                             Serialization: SRM Lock.                  09268100
LCCATTS2 DC    F'0'   -       Low Order 32 bits of LCCATTSC        @LHC 09268300
*                             Ownership: SRM                            09268500
*                             Serialization: SRM Lock.                  09268700
LCCAWTSC DS    0XL8   -       WAIT TASK TIME SLICE INTERVAL        @D2A 09268900
LCCAWTS1 DC    F'0'   -       HIGH ORDER 32 BITS                   @D2A 09269100
LCCAWTS2 DC    F'0'   -       LOW  ORDER 32 BITS                   @D2A 09269300
LCCATP   DC    F'0'   -       Workunit Preemption Count -          @LHC 09269500
*                             number of workunit time slice             09269700
*                             expirations.                              09269900
*                             Ownership: Supervisor Control.            09270100
*                             Serialization: Disablement on current     09270300
*                             processor.                                09270500
LCCATPU  DC    F'0'   -       Unproductive Workunit Preemption     @LHC 09270700
*                             Count - number of workunit time slice     09270900
*                             expirations that were not needed.         09271100
*                             Ownership: Supervisor Control             09271300
*                             Serialization: Disablement on current     09271500
*                             processor.                                09271700
LCCAWP   DC    F'0'   -       WAIT PREEMPTION COUNT - NUMBER OF    @D2A 09271900
*                             WAIT TASK TIME SLICE EXPIRATIONS          09272100
LCCAWPU  DC    F'0'   -       UNPRODUCTIVE WAIT PREEMPTION COUNT - @D2A 09272300
*                             NUMBER OF WAIT TASK TIME SLICE            09272500
*                             EXPIRATIONS THAT WERE NOT NEEDED          09272700
LCCATPB  DC    F'0'   -       Workunit Preemption Count Base -     @LHC 09272900
*                             previous value of LCCATP                  09273100
*                             Ownership: SRM                            09273300
*                             Serialization: SRM Lock.                  09273500
LCCATPUB DC    F'0'   -       Unproductive Workunit Preemption     @LHC 09273700
*                             Count Base - previous value of LCCATPU    09273900
*                             Ownership: SRM                            09274100
*                             Serialization: SRM Lock.                  09274300
LCCAWPB  DC    F'0'   -       WAIT PREEMPTION COUNT BASE -         @D2A 09274500
*                             PREVIOUS VALUE OF LCCAWP                  09274700
LCCAWPUB DC    F'0'   -       UNPRODUCTIVE WAIT PREEMPTION COUNT   @D2A 09274900
*                             BASE - PREVIOUS VALUE OF LCCAWPU          09275100
LCCAOID  DC    H'0'   -       Active ASID or Enclave ID when the   @LHC 09275300
*                             workunit time slice expired               09275500
LCCAENID EQU   X'80'  -       LCCAOID is an Enclave ID.            @LHA 09275700
LCCAMTSC DC    X'0'           Maximum number of dispatches per task     09275900
*                                                                  @LFA 09276100
LCCACTSC DC    X'0'           Number of consecutive dispatches     @LEA 09276300
*                             remaining for this task              @LEA 09276500
LCCAPPRI DC    A(0)   -       Priority of Active workunit when     @LDC 09276700
*                             time slice expired                        09276900
*                             SERIALIZATION: Disablement                09277100
*                             OWNERSHIP: Supervisor Control             09277300
LCCACPTM DC    F'0'   -       THIS CPU'S COUNT DOWN TIMER          @05C 09277500
*                             OWNERSHIP: SUPERVISOR                     09277700
*                             SERIALIZATION: NONE                       09277900
LCCACLSD DC    A(0)   -       The address of the LSSD for the      @LHA 09278100
*                             currently executing SRB routine. Only     09278300
*                             valid when an SRB is executing.           09278500
LCCAWUQA DC    18A(0) -       Array of Work Unit Queues for this   @LDC 09278700
*                             processor.                                09278900
*                             SERIALIZATION: Disablement                09279100
*                             OWNERSHIP: Supervisor Control             09279300
LCCAEND  DS    0D             END OF LCCA.                     @G383PXU 09279500
         POP   PRINT                                               @L3A 09279700
         MEND  , -   */                                                 09279900
*%LCCAL2 : ;                                                            09300000
*   @LISTPUSH;                                             /*    @L3A*/ 09307100
*%IF IHALIST='YES' %THEN                                                09314200
*   %GOTO PLSLIST;                                         /*    @L3A*/ 09321300
*%ELSE                                                                  09328400
*   @LISTOFF;                                              /*    @L3A*/ 09335500
*%PLSLIST:;                                                /*    @L3A*/ 09342600
*                                                                       09350000
*DECLARE                                                                09400000
*  1 LCCA     BASED(LCCAPTR)  BDY(DWORD),                               09450000
*   2 LCCALCCA    CHAR(4) BDY(WORD),     /* CONTROL BLOCK ACRONYM IN    09500000
*                                           EBCDIC                   */ 09550000
*   2 LCCACPUA    PTR(15),               /* LOGICAL CPU ADDRESS      */ 09600000
*   2 LCCACAFM    BIT(16),               /* BIT MASK CORRESPONDING TO   09610600
*                                           LOGICAL CPU ADDRESS         09621200
*                                                            @G860PXK*/ 09631800
*   2 LCCAPGR1  (16) FIXED(31),          /* PROGRAM FLIH RECURSION      09642400
*                                           REGISTER SAVE AREA 1        09653000
*                                                            @G860PXK*/ 09663600
*   2 LCCAPGR2  (16) FIXED(31),          /* PROGRAM FLIH                09674200
*                                           MAIN ENTRY REGISTER SAVE    09684800
*                                           AREA    (MDC346) @G383P9A*/ 09695400
*   2 LCCAPPSW    CHAR(8) BDY(DWORD),    /* PROGRAM FLIH MAIN ENTRY     09706000
*                                           PSW SAVE AREA    @G860PXK*/ 09716600
*   2 LCCAPINT    FIXED(31),             /* PROGRAM FLIH MAIN ENTRY     09727200
*                                           ILC AND INTERRUPT CODE      09737800
*                                           SAVE AREA            @02C*/ 09748400
*     3 *        CHAR(1),                /* RESERVED - SET TO 0  @02A*/ 09759000
*     3 LCCAPILC BIT(8),                 /* INSTRUCTION LENGTH CODE     09769600
*                                                                @02A*/ 09780200
*     3 LCCAPEEC BIT(8),                 /* EXCEPTION - EXTENSION CODE  09790800
*                                                                @02A*/ 09801400
*     3 LCCAPICD BIT(8),                 /* PROGRAM INTERRUPT CODE      09812000
*                                                                @02A*/ 09822600
*       5 LCCAPPER BIT(1),               /* PER BIT IN INTERRUPT CODE   09833200
*                                                                @02A*/ 09843800
*%LCCAPICM='''0000007F''X';              /* MASK TO ACCESS PIC FROM     09854400
*                                           LCCAPINT            @P1A */ 09865000
*       5 LCCAPICA BIT(7),               /* The interrupt code without  09875600
*                                           the PER bit          @LJA*/ 09886200
*                                                                       09896800
*         7 LCCAPMC BIT(1),              /* Monitor call bit in         09907400
*                                           interrupt code       @LJA*/ 09918000
*                                                                       09928600
*         7 LCCAPICB BIT(6),             /* The "clean"                 09939200
*                                           interrupt code       @LJA*/ 09949800
*                                                                       09960400
*   2 LCCAPVAD    FIXED(31),             /* PROGRAM FLIH MAIN ENTRY     09971000
*                                           TRANSLATION EXCEPTION       09981600
*                                           ADDRESS SAVE AREA           09992200
*                                                            @G860PXK*/ 10002800
*     3 *        CHAR(3),                /* FIRST THREE BYTES OF        10013400
*                                           ADDRESS              @L4A*/ 10024000
*       5 LCCAPVXM BIT(1),               /* TEA MODE STATE. 0=PRIMARY   10034600
*                                           1=SECONDARY          @L4C*/ 10045200
*     3 LCCAPDXC FIXED(8),               /* Data exception code for     10055800
*                                           PI 7                 @LJA*/ 10066400
*      4 LCCAPSTD BIT(8),                /* LAST BYTE OF LCCAPVAD       10077000
*                                                                @L4A*/ 10087600
*       5 *        BIT(5),               /*                      @LIC*/ 10098200
*       5 LCCASOPI BIT(1),               /* Suppression-on-protection   10108800
*                                           indicator            @LIA*/ 10119400
*       5 LCCAPSTF BIT(2),               /* STD FIELD - LAST TWO BITS   10130000
*                                           OF LCCAPVAD ............... 10140600
*                                       ..  '00' - PRIMARY STD USED     10151200
*                                       ..  '01' - STD WAS AR QUALIFIED 10161800
*                                       ..  '10' - SECONDARY STD USED   10172400
*                                       ..  '11' - HOME STD USED.       10183000
*                                                                @L4A*/ 10193600
*%LCCAPSTP='''00''B';                    /* THE PRIMARY STD WAS USED.   10204200
*                                                                @L4A*/ 10214800
*%LCCAPSTA='''01''B';                    /* THE STD WAS AR QUALIFIED.   10225400
*                                                                @L4A*/ 10236000
*%LCCAPSTS='''10''B';                    /* THE SECONDARY STD WAS USED. 10246600
*                                                                @L4A*/ 10257200
*%LCCAPSTH='''11''B';                    /* THE HOME STD WAS USED.      10267800
*                                                                @L4A*/ 10278400
*                                                                       10289000
*   2 *           FIXED(31),             /* Reserved             @LLC*/ 10339000
*   2 LCCACR0     FIXED(31),             /* WORK AREA FOR TESTING BITS  10400000
*                                           IN CONTROL REGISTER 0    */ 10450000
*   2 LCCAPGR3  (16) FIXED(31),          /* PROGRAM CHECK FLIH          10465200
*                                           REGISTER SAVE AREA 3        10480400
*                                           (MDC317)         @ZM48166*/ 10495600
*   2 LCCAPAR2  CHAR(64) BDY(DWORD),     /* PROGRAM FLIH MAINLINE       10510800
*                                           ACCESS REGISTER SAVEAREA 2  10526000
*                                                                @L3C*/ 10541200
*     3 LCCAP2A0 FIXED(32),              /* ACCESS REGISTER 0    @L3A*/ 10556400
*     3 LCCAP2A1 FIXED(32),              /* ACCESS REGISTER 1    @L3A*/ 10571600
*     3 LCCAP2A2 FIXED(32),              /* ACCESS REGISTER 2    @L3A*/ 10586800
*     3 LCCAP2A3 FIXED(32),              /* ACCESS REGISTER 3    @L3A*/ 10602000
*     3 LCCAP2A4 FIXED(32),              /* ACCESS REGISTER 4    @L3A*/ 10617200
*     3 LCCAP2A5 FIXED(32),              /* ACCESS REGISTER 5    @L3A*/ 10632400
*     3 LCCAP2A6 FIXED(32),              /* ACCESS REGISTER 6    @L3A*/ 10647600
*     3 LCCAP2A7 FIXED(32),              /* ACCESS REGISTER 7    @L3A*/ 10662800
*     3 LCCAP2A8 FIXED(32),              /* ACCESS REGISTER 8    @L3A*/ 10678000
*     3 LCCAP2A9 FIXED(32),              /* ACCESS REGISTER 9    @L3A*/ 10693200
*     3 LCCAP2AA FIXED(32),              /* ACCESS REGISTER 10   @L3A*/ 10708400
*     3 LCCAP2AB FIXED(32),              /* ACCESS REGISTER 11   @L3A*/ 10723600
*     3 LCCAP2AC FIXED(32),              /* ACCESS REGISTER 12   @L3A*/ 10738800
*     3 LCCAP2AD FIXED(32),              /* ACCESS REGISTER 13   @L3A*/ 10754000
*     3 LCCAP2AE FIXED(32),              /* ACCESS REGISTER 14   @L3A*/ 10769200
*     3 LCCAP2AF FIXED(32),              /* ACCESS REGISTER 15   @L3A*/ 10784400
*   2 LCCARSGR  (16) FIXED(31),          /* RESTART FLIH REGISTER       10800000
*                                           SAVE AREA            @L4C*/ 10805700
*   2 LCCADSA2  PTR(31),                 /* REAL ADDRESS OF THE DATA    10811400
*                                           SPACE ASTE CAUSING THE      10817100
*                                           FAULT.               @L6C*/ 10822800
*   2 LCCAPCR2  CHAR(64)  BDY(WORD),     /* PROGRAM FLIH MAINLINE       10828500
*                                           CONTROL REGISTER SAVEAREA 2 10834200
*                                                                @L4C*/ 10839900
*    3 LCCAP2C0 FIXED(32),               /* CONTROL REGISTER 0   @L3A*/ 10845600
*    3 LCCAP2C1 FIXED(32),               /* CONTROL REGISTER 1   @L3A*/ 10851300
*    3 LCCAP2C2 FIXED(32),               /* DUCT ORIGIN ADDRESS (CR2)   10857000
*                                                                @L3A*/ 10862700
*    3 LCCAPXM2 CHAR(8) BDY(WORD),       /* PROGRAM FLIH CROSS MEMORY   10868400
*                                           CONTROL REGISTER SAVEAREA 2 10874100
*                                           - MUST BE ON A DOUBLE WORD  10879800
*                                           BOUNDARY.            @L3A*/ 10885500
*     5 LCCAP2C3 FIXED(32),              /* CONTROL REGISTER 3   @L3A*/ 10891200
*       7 LCCAPX2K FIXED(16),            /* PROGRAM KEY MASK     @L3A*/ 10896900
*       7 LCCAPX2S FIXED(16),            /* SASN                 @L3A*/ 10902600
*     5 LCCAP2C4 FIXED(32),              /* CONTROL REGISTER 4   @L3A*/ 10908300
*       7 LCCAPX2A FIXED(16),            /* AX                   @L3A*/ 10914000
*       7 LCCAPX2P FIXED(16),            /* PASN                 @L3A*/ 10919700
*    3 LCCAP2C5 FIXED(32),               /* ASTE REAL ADDRESS (CR5)     10925400
*                                                                @L3A*/ 10931100
*    3 LCCAP2C6 FIXED(32),               /* CONTROL REGISTER 6   @L3A*/ 10936800
*    3 LCCAP2C7 FIXED(32),               /* CONTROL REGISTER 7   @L3A*/ 10942500
*    3 LCCAP2C8 FIXED(32),               /* CONTROL REGISTER 8   @L3A*/ 10948200
*     5 LCCAPEX2 FIXED(16),              /* EAX VALUE  (LH CR8)  @L3A*/ 10953900
*     5 *        FIXED(16),              /* SECOND HALF OF CR8   @L3A*/ 10959600
*    3 LCCAP2C9 FIXED(32),               /* CONTROL REGISTER 9   @L3A*/ 10965300
*    3 LCCAP2CA FIXED(32),               /* CONTROL REGISTER 10  @L3A*/ 10971000
*    3 LCCAP2CB FIXED(32),               /* CONTROL REGISTER 11  @L3A*/ 10976700
*    3 LCCAP2CC FIXED(32),               /* CONTROL REGISTER 12  @L3A*/ 10982400
*    3 LCCAP2CD FIXED(32),               /* CONTROL REGISTER 13  @L3A*/ 10988100
*    3 LCCAP2CE FIXED(32),               /* CONTROL REGISTER 14  @L3A*/ 10993800
*    3 LCCAP2CF FIXED(32),               /* PROGRAM FLIH MAINLINE       10999500
*                                           LINKAGE STACK ADDRESS       11005200
*                                           (CR15)               @L3A*/ 11010900
*   2 LCCAR1A4    CHAR(52),              /* RESERVED             @L4C*/ 11016600
*   2 LCCAPSW3    CHAR(8),               /* PROGRAM FLIH PSW            11022300
*                                           SAVE AREA 3                 11028000
*                                                  (MDC342)  @G383P9A*/ 11033700
*   2 LCCAINGR  (8) FIXED(31),           /* INTERSECT REGISTER SAVE     11039400
*                                           AREA  (MDC325)   @ZM48325*/ 11045100
*   2 LCCABBCT  FIXED(15),               /* COUNT OF THE NUMBER OF      11050800
*                                           TIMES BIND BREAK HAS        11056500
*                                           ENABLED.             @0AC*/ 11062200
*   2 LCCAWFCT  FIXED(15),               /* Bind Break Window Function  11067900
                                            Count - Incremented by code 11073600
*                                           which opens an  EMS window  11079300
*                                           after it has completed its  11085000
*                                           function             @0AA*/ 11090700
*   2 LCCAMCR0    FIXED(31),             /* MACHINE CHECK FLIH CR0      11096400
*                                           SAVE AREA                   11102100
*                                           (MDC312)         @G50NP9A*/ 11107800
*    3 *        BIT(3),                  /* FIRST THREE BITS OF         11113500
*                                           LCCAMCR0         @G50NP9A*/ 11119200
*    3 LCCAMPEN BIT(1),                  /* IF 0, PSA PROTECT           11124900
*                                           DISABLED.  IF 1, PSA        11130600
*                                           PROTECT ENABLED.            11136300
*                                           (MDC315)         @G50NP9A*/ 11142000
*   2 LCCAIHRC    CHAR(4) BDY(WORD),     /* GENERAL FLIH RECURSION      11150000
*                                           FLAGS                    */ 11200000
*    3 LCCAIHR1    BIT(8),               /* FIRST BYTE OF LCCAIHRC   */ 11250000
*     4 LCCAXRC1   BIT(1),               /* EXTERNAL FLIH RECURSION     11300000
*                                           BIT 1                    */ 11350000
*     4 LCCAXRC2   BIT(1),               /* EXTERNAL FLIH RECURSION     11400000
*                                           BIT 2                    */ 11450000
*     4 *          BIT(6),               /* RESERVED             @H1A*/ 11500000
*    3 LCCAIHR2    BIT(8),               /* SECOND BYTE OF LCCAIHRC  */ 11950000
*    3 LCCAIHR3    BIT(8),               /* THIRD BYTE OF LCCAIHRC   */ 12400000
*    3 LCCAIHR4    BIT(8),               /* FOURTH BYTE OF LCCAIHRC  */ 12850000
*   2 LCCASPIN    CHAR(4) BDY(WORD),     /* PROCESSOR IS SPINNING       13300000
*                                           INDICATORS               */ 13350000
*    3 LCCASPN1    BIT(8),               /* FIRST BYTE OF LCCASPIN   */ 13400000
*     4 LCCASIGS BIT(1),                 /* IEAVSIGP SPIN BIT           13437500
*                                                            @G860PXK*/ 13475000
*     4 LCCAERIS BIT(1),                 /* IEAVERI SPIN BIT @G860PXK*/ 13512500
*     4 LCCALOCK BIT(1),                 /* LOCK MANAGER SPIN BIT    */ 13550000
*     4 LCCATSPN BIT(1),                 /* SIMULATES SPIN FOR TIMER    13600000
*                                           SUPERVISOR AT VARY TIME  */ 13650000
*     4 LCCARSTR BIT(1),                 /* USED BY A PROGRAM           13672700
*                                           SPINNING FOR THE RESTART    13695400
*                                           RESOURCE           MDC035*/ 13718100
*     4 *        BIT(1),                 /* RESERVED             @H1C*/ 13740800
*     4 LCCAINT  BIT(1),                 /* INTERSECT FUNCTION SPIN     13763500
*                                           BIT  (MDC308)    @G50DP9A*/ 13786200
*     4 LCCAEXSN BIT(1),                 /* SPIN BIT FOR EXCESSIVE      13808900
*                                           SPIN NOTIFICATION ROUTINE   13831600
*                                           IEEVEXSN                    13854300
*                                           (MDC330)         @G65UP9A*/ 13877000
*    3 LCCASPN2    BIT(8),               /* SECOND BYTE OF LCCASPIN  */ 13900000
*     4 LCCAMSF  BIT(1),                 /* MSSFCALL SVC SPIN CONDITION 13945000
*                                                            @G875PXU*/ 13990000
*     4 LCCACHAP BIT(1),                 /* ASCBCHAP SPIN BIT    @L2A*/ 14035000
*     4 LCCACPUR BIT(1),                 /* TIMER SPIN BIT       @L7A*/ 14080000
*     4 LCCASTAS BIT(1),                 /* STATUS SPIN BIT      @LAA*/ 14125000
*     4 LCCAESPN BIT(1),                 /* IEAVESPN SPIN BIT    @LDA*/ 14170000
*     4 LCCASTST BIT(1),                 /* CPU/VF STOP/START spin      14215000
*                                           bit IEEVCVSR.        @07A*/ 14260000
*     4 LCCASXLS BIT(1),                 /* XLS spin bit         @0DA*/ 14305000
*    3 LCCASPN3    BIT(8),               /* THIRD BYTE OF LCCASPIN   */ 14350000
*    3 LCCASPN4    BIT(8),               /* FOURTH BYTE OF LCCASPIN  */ 14800000
*   2 *        CHAR(8) BDY(WORD),        /* OWNERSHIP: SUPERVISOR       14850000
*                                           SERIALIZATION: NONE  @05C*/ 14900000
*     3 LCCATODH FIXED(32),              /* STCK WORK AREA - HIGH       14950000
*                                           ORDER WORD           @05A*/ 15000000
*     3 LCCATODL FIXED(32),              /* STCK WORK AREA - LOW        15050000
*                                           ORDER WORD           @05A*/ 15100000
*   2 LCCACPUS    PTR(31),               /* POINTER TO CPU WORK/SAVE    15400000
*                                           AREA VECTOR TABLE        */ 15450000
*   2 LCCADSF1    BIT(8) BDY(WORD),      /* DISPATCHER STATUS           15500000
*                                           INDICATOR BYTE 1            15533300
*                                           SPECIAL EXIT FLAGS       */ 15566600
*    3 LCCAACR  BIT(1),                  /* ACR IN PROGRESS          */ 15600000
*    3 LCCAVCPU BIT(1),                  /* VARY CPU IN PROGRESS     */ 15650000
*    3 LCCAETSC BIT(1),                  /* TOD SYNC CHECKS SHOULD BE   15673300
*                                           ENABLED              @L7A*/ 15696600
*    3 LCCATIMR BIT(1),                  /* CPU'S TOD CLOCK IS TO BE    15719900
*                                           OR IS BEING SYNCHRONIZED    15743200
*                                                              MDC011*/ 15766500
*    3 LCCATSMC BIT(1),                  /* TOD SYNC CHECK THRESHOLD    15789800
*                                           HAS BEEN EXCEEDED    @L7A*/ 15813100
*    3 LCCASVC6 BIT(1),                  /* Dispatcher entry DSSRBRTN   15836400
*                                           was spinning for the        15859700
*                                           global intersect.    @0BA*/ 15883000
*    3 LCCATCT2 BIT(1),                  /* Dispatcher entry IEAVDSTC   15906300
*                                           was spinning for the        15929600
*                                           global intersect.    @0BA*/ 15952900
*    3 *        BIT(1),                  /* RESERVED             @0BC*/ 15976200
*   2 LCCADSF2    BIT(8) BDY(WORD,2),    /* DISPATCHER STATUS           16000000
*                                           INDICATOR BYTE 2            16033300
*                                           SPECIAL EXIT FLAGS       */ 16066600
*    3 LCCASRBM BIT(1),                  /* SRB MODE INDICATOR       */ 16100000
*    3 *        BIT(1),                  /*                      @LDC*/ 16125000
*    3 LCCASSRB BIT(1),                  /* DISPATCHER SSRB PATH        16150000
*                                           FOOTPRINT        @G387PXH*/ 16175000
*    3 LCCAEUTS BIT(1),                  /* EUTSAVE SUBROUTINE          16200000
*                                           FOOTPRINT        @G38EPXH*/ 16225000
*    3 LCCAEUTR BIT(1),                  /* EUTREST SUBROUTINE          16250000
*                                           FOOTPRINT        @G38EPXH*/ 16275000
*    3 LCCATVS  BIT(1),                  /* Dispatcher footprint for    16300000
*                                           XES Schedule List           16325000
*                                           Transition Notification     16350000
*                                                                @LBC*/ 16375000
*    3 LCCADS7E BIT(1),                  /* Dispatcher footprint on     16400000
*                                           entry from external or i/o  16425000
*                                           flihs.               @P6C*/ 16450000
*    3 *        BIT(1),                  /* RESERVED             @P6C*/ 16475000
*   2 LCCAPSMK    CHAR(1) BDY(WORD,3),   /* STORE AREA FOR FLIH'S       16500000
*                                           STOSM INSTRUCTION        */ 16550000
*   2 LCCASCFL    BIT(8) BDY(WORD,4),    /* Supervisor Control flag     16556400
*                                           byte.  Current processor's  16562800
*                                           field serialized via        16569200
*                                           disablement.         @02C*/ 16575600
*    3 LCCACRYP BIT(1),                  /* THE ENCRYPTION FEATURE IS   16582000
*                                           ENABLED ON THIS PROCESSOR   16588400
*                                           (SET BY IEAMCPUF SERVICE).  16594800
*                                                                @02A*/ 16601200
*    3 LCCAHSCS BIT(1),                  /* HPPI external interrupts    16607600
*                                           are enabled on this         16614000
*                                           processor (set by           16620400
*                                           IEAMCPUF service).   @01A*/ 16626800
*    3 LCCAPASS BIT(1),                  /* Pass ABEND to interrupted   16633200
*                                           unit of work indicator      16639600
*                                                                @LAA*/ 16646000
*    3 LCCATVSE BIT(1),                  /* External FLIH footprint for 16652400
*                                           XES processing in progress. 16658800
*                                                                @08A*/ 16665200
*    3 LCCAAOLS BIT(1),                  /* Set when PSAAOLD was        16671600
*                                           refreshed and IEAVELCR      16678000
*                                           needs to record the old     16684400
*                                           value in the VRA. The old   16690800
*                                           value is saved in           16697200
*                                           LCCAAOLD.            @0CA*/ 16703600
*    3 LCCATOLS BIT(1),                  /* Set when PSATOLD was        16710000
*                                           refreshed and IEAVELCR      16716400
*                                           needs to record the old     16722800
*                                           value in the VRA. The old   16729200
*                                           value is saved in           16735600
*                                           LCCATOLD.            @0CA*/ 16742000
*    3 *        BIT(2),                  /* RESERVED             @0CC*/ 16748400
*   2 LCCADS0W    CHAR(32) BDY(WORD),    /* DISPATCHER CPU RELATED      16754800
*                                           WORK AREA            @L2A*/ 16761200
*    3 LCCAPWEB   PTR(31),          /* Dispatcher Savearea for previous 16767600
*                                   current WUQ.                        16774000
*                                   SERIALIZATION: Dispatcher Active    16780400
*                                   OWNERSHIP: Supervisor Control       16786800
*                                                                @LDC*/ 16793200
*    3 LCCADBCT   FIXED(31),             /* DISPATCHER SAVEAREA FOR     16799600
*                                           INTERNAL ASCB COUNTER.      16806000
*                                           INITIALIZED TO SVTDSBCT AND 16812400
*                                           DECREMENTED BY ONE FOR      16818800
*                                           EACH ASCB SEARCHED.  @L2A*/ 16825200
*      5 LCCARSWS   BIT(1),              /* Turned on whenever the      16826000
*                                           dispatcher is entered as a  16826800
*                                           result of a successful      16827600
*                                           Transfer request.  Turned   16828400
*                                           off by the dispatcher when  16829200
*                                           a successful work search    16830000
*                                           is completed.        @LKA*/ 16830800
*    3 LCCADSV1    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16831600
*    3 LCCADSV2    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16838000
*    3 LCCADSV3    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16844400
*    3 LCCADSV4    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16850800
*    3 LCCADSV5    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16857200
*    3 LCCADSV6    PTR(31),              /* DISPATCHER SAVEAREA  @L2A*/ 16863600
*   2 LCCAEE1R    PTR(31),               /* EXTERNAL FLIH MAINLINE      16870000
*                                           RETRY ADDRESS    @ZA59054*/ 16876400
*   2 LCCAEE2R    PTR(31),               /* EXTERNAL FLIH 1ST RECURSION 16882800
*                                           RETRY ADDRESS    @ZA59054*/ 16889200
*   2 LCCAEE3R    PTR(31),               /* EXTERNAL FLIH 2ND RECURSION 16895600
*                                           RETRY ADDRESS    @ZA59054*/ 16902000
*   2 LCCAPTR1    FIXED(8),              /* PROGRAM FLIH RECURSION TEA  16908400
*                                           AR NUMBER SAVEAREA 1 @L3C*/ 16914800
*   2 LCCAPTR2    FIXED(8),              /* PROGRAM FLIH MAINLINE TEA   16921200
*                                           AR NUMBER SAVEAREA 2 @L3A*/ 16927600
*   2 LCCAPTR3    FIXED(8),              /* PROGRAM FLIH RECURSION TEA  16934000
*                                           MC AR NUMBER SAVEAREA 3     16940400
*                                                                @L3A*/ 16946800
*   2 LCCAPPR2    FIXED(8),              /* MAINLINE PER STORAGE        16953200
*                                           ALTERATION AR NUMBER @L3A*/ 16959600
*   2 LCCATCR0    FIXED(31),             /* SAVE AREA FOR CONTROL       16966000
*                                           REGISTER 0 FOR TIMER        16972400
*                                           ROUTINES                    16978800
*                                           (MDC322)         @ZM47873*/ 16985200
*   2 LCCAWTD     FIXED(31),             /* AWM wait dispatch count     16991600
*                                                                @05A*/ 16998000
*   2 LCCAWSD     FIXED(31),             /* AWM short wait dispatch     17004400
*                                           count                @08A*/ 17010800
*   2 LCCAWSU     FIXED(31),             /* Unproductive short wait     17017200
*                                           dispatch count       @08A*/ 17023600
*   2 LCCAWS      FIXED(31),             /* Short wait time slice count 17030000
*                                                                @08A*/ 17036400
*   2 *           FIXED(32),             /*                      @LKC*/ 17038600
*     3 LCCASTCT    FIXED(8),            /* The count of sequential     17040800
*                                           transfers on this           17043000
*                                           processor            @LKA*/ 17045200
*     3 LCCAR265    FIXED(24),           /* RESERVED             @PAC*/ 17047600
*   2 LCCAWTIM    CHAR(8) BDY(DWORD),    /* ACCUMULATED CPU WAIT TIME*/ 17050000
*   2 LCCAR270    CHAR(28),              /* RESERVED             @LJC*/ 17061400
*   2 LCCALCCX    PTR(31),               /* Virtual address of LCCX.    17067100
*                                                                @LKA*/ 17072800
*    3 LCCAFPWA   PTR(31),               /* Virtual address of FPWA.    17078500
*                                   Set during                          17084200
*                                   IPL and bringing processor online.  17095600
*                                   Never reset.                        17107000
*                                   OWNERSHIP: Supervisor Control       17118400
*                                                                @LJA*/ 17129800
*   2 LCCALCXR    PTR(31),               /* Real address of LCCX.       17135500
*                                                                @LKA*/ 17141200
*    3 LCCAFPWR   PTR(31),               /* Real address of FPWA.       17146900
*                                   Set during                          17152600
*                                   IPL and bringing processor online.  17164000
*                                   Never reset.                        17175400
*                                   OWNERSHIP: Supervisor Control       17186800
*                                                                @LJA*/ 17198200
*   2 LCCAESAV    PTR(31),               /* Virtual address of area     17209600
*                                   pointed to by FLCESAA. Set during   17221000
*                                   IPL and bringing processor online.  17232400
*                                   Never reset.                        17243800
*                                   OWNERSHIP: Supervisor Control       17255200
*                                                                @LJA*/ 17266600
*   2 LCCAAOLD    PTR(31),               /* If LCCAAOLS = 1,            17278000
*                                           PSAAOLD was refreshed and   17289400
*                                           the original value of       17300800
*                                           PSAAOLD is saved in this    17312200
*                                           field, so it can be         17323600
*                                           recorded in the VRA. @0CA*/ 17335000
*   2 LCCATOLD    PTR(31),               /* If LCCATOLS = 1,            17346400
*                                           PSATOLD was refreshed and   17357800
*                                           the original value of       17369200
*                                           PSATOLD is saved in this    17380600
*                                           field, so it can be         17392000
*                                           recorded in the VRA. @0CA*/ 17403400
*   2 LCCASRBJ    FIXED(31),             /* SUSPENDED SERVICE REQUEST   17414800
*                                           BLOCK (SRB) JOURNAL WORD    17426200
*                                           USED BY SETLOCK    MDC043*/ 17437600
*   2 LCCADCPU    PTR(31),               /* VIRTUAL ADDRESS OF LCCA     17450000
*                                           OF FAILING CPU           */ 17500000
*   2 LCCARCPU    PTR(31),               /* VIRTUAL ADDRESS OF LCCA     17550000
*                                           OF RECOVERING CPU        */ 17600000
*   2 LCCACRLC    FIXED(31),             /* ACR SAVE AREA FOR HIGHEST   17650000
*                                           LOCK HELD INDICATOR      */ 17700000
*   2 LCCALCR0    FIXED(31),             /* SAVE AREA FOR CONTROL       17750000
*                                           REGISTER 0 WHEN OPENING     17783300
*                                           A WINDOW                 */ 17816600
*   2 LCCACRFL    BIT(8),                /* ACR FLAGS                */ 17850000
*    3 LCCACRTM BIT(1),                  /* RTM ENTRY BIT            */ 17900000
*    3 LCCACLMS BIT(1),                  /* PROCESS SUSPENDED        */ 17950000
*    3 *        BIT(5),                  /* RESERVED             @H1C*/ 18000000
*    3 LCCAVARY BIT(1),                  /* TELLS ACR THAT VARY IS IN   18050000
*                                           PROGRESS           MDC038*/ 18100000
*   2 LCCACREX    BIT(8),                /* ACR ENTRY AND EXIT FLAGS */ 18300000
*    3 LCCACREF BIT(1),                  /* EXTERNAL ROUTINE         */ 18350000
*    3 LCCACRRM BIT(1),                  /* FINAL EXIT               */ 18400000
*    3 LCCACRLE BIT(1),                  /* LOCK MANAGER EXIT        */ 18450000
*    3 LCCACRRT BIT(1),                  /* FRR EXIT                 */ 18500000
*    3 LCCACRIN BIT(1),                  /* ENTRY TYPE = ACR         */ 18550000
*    3 LCCACRLM BIT(1),                  /* ENTRY TYPE = ACRLM       */ 18600000
*    3 LCCACRDP BIT(1),                  /* ENTRY TYPE = ACRDISP     */ 18650000
*    3 LCCACRST BIT(1),                  /* SYSTERM TERMINATION EXIT    18670000
*                                           FLAG               MDC037*/ 18690000
*   2 LCCALKFG    BIT(8),                /* LOCK FLAG BYTE     MDC005*/ 18710000
*    3 *        BIT(3),                  /* RESERVED             @L1C*/ 18712200
*    3 LCCALKRD BIT(1),                  /* THIS IS A LOCK MANAGER      18714400
*                                           RELEASE DISABLED REQUEST    18716600
*                                                              MDC047*/ 18718800
*    3 *        BIT(4),                  /* RESERVED             @H1A*/ 18721000
*   2 *           CHAR(1),               /* RESERVED             @H1C*/ 18723200
*   2 LCCASLEB    CHAR(4)  BDY(WORD) ABNORMAL,  /* SPIN LOOP            18725400
*                                           EXEMPTION BITS       @D1C*/ 18727600
*     3 LCCASLE1  BIT(8),                /* FLAG BYTE                   18729800
*                                           OWNERSHIP: RECONFIG         18732000
*                                           SERIALIZATION: CS    @D1A*/ 18734200
*       4 LCCASTCP  BIT(1),              /* BLWSPIN IN CONTROL.  @D3C*/ 18736400
*       4 LCCARSTP  BIT(1),              /* LOADWAIT/RESTART PROCESSING 18738600
*                                           IS PLACING THIS PROCESSOR   18740800
*                                           INTO A RESTARTABLE WAIT     18743000
*                                           STATE.               @L8C*/ 18745200
*       4 LCCAVTOD  BIT(1),              /* IEATVTOD IN CONTROL. @P2A*/ 18747400
*       4 LCCAESMR  BIT(1),              /* IEATESMR IN CONTROL. @P3A*/ 18749600
*       4 LCCAXMFA  BIT(1),              /* IGFPXMFA HAS STOPPED THIS   18751800
*                                           CPU.                 @D1A*/ 18754000
*       4 LCCACVSR  BIT(1),              /* IEEVCVSR IN CONTROL. @D1A*/ 18756200
*       4 LCCABRCH  BIT(1),              /* ISNBRNCH IN CONTROL. @L8C*/ 18758400
*       4 LCCABWTO  BIT(1),              /* IEAVBWTO IN CONTROL. @L8A*/ 18760600
*     3 LCCASLE2  BIT(8),                /* FLAG BYTE 2          @03A*/ 18762800
*       4 LCCAESC2  BIT(1),              /* IEATESCH or IEATTFDH in     18765000
*                                           control.                    18767200
*                                           OWNERSHIP: RECONFIG.        18769400
*                                           SERIALIZATION: CS.   @03A*/ 18771600
*       4 LCCAXLS   BIT(1),              /* XLS is in control.          18773800
*                                           Ownership: XES.             18776000
*                                           Serialization: Disablement. 18778200
*                                                                @D4A*/ 18780400
*       4 *         BIT(6),              /* RESERVED             @D4C*/ 18782600
*     3 *         CHAR(2),               /* RESERVED             @03C*/ 18784800
*   2 LCCASLIP    PTR(31),               /* POINTER TO SLIP/PER WORK    18787000
*                                           AREA  (MDC316)   @G65RP9A*/ 18789200
*   2 LCCALWTM    CHAR(8) BDY(DWORD),    /* VALUE OF LCCAWTIM AT THE    18794000
*                                           END OF A MEASUREMENT        18796000
*                                           INTERVAL           MDC001*/ 18798000
*   2 LCCASSA2  PTR(31),              /* REAL ADDRESS OF SUBSPACE       18821200
*                                        ASTE CAUSING THE               18844400
*                                        FAULT.                         18867600
*                                        OWNERSHIP: SUPERVISOR CONTROL  18890800
*                                        SERIALIZATION: DISABLEMENT     18914000
*                                                                @LCA*/ 18937200
*   2 LCCASSA5  PTR(31),              /* REAL ADDRESS OF SUBSPACE       18960400
*                                        ASTE CAUSING THE RECURSIVE     18983600
*                                        FAULT.                         19006800
*                                        OWNERSHIP: SUPERVISOR CONTROL  19030000
*                                        SERIALIZATION: DISABLEMENT     19053200
*                                                                @LCA*/ 19076400
*   2 LCCASRBF    CHAR(8) BDY(DWORD),    /* SRB FIELDS         MDC009*/ 19100000
*    3 LCCASAFN    FIXED(15),            /* CPU AFFINITY IF IN SRB      19150000
*                                           MODE               MDC003*/ 19200000
*    3 LCCAPGTA    CHAR(6) BDY(DWORD,3), /* ASID/TCB IF IN SRB MODE     19250000
*                                                              MDC004*/ 19300000
*   2 LCCAORMT    PTR(31),               /* OLD SRB RMTR VALUE          19350000
*                                           SERIALIZATION: DISABLEMENT  19400000
*                                           OWNERSHIP:  SUPERVISOR      19450000
*                                           CONTROL              @P4A*/ 19500000
*     3  LCCASSTD  BIT(1),               /* SRB SUSPEND WITH TOKEN      19550000
*                                           DISABLED BIT         @P4A*/ 19600000
*     3  LCCASSTA  BIT(1),               /* SRB SUSPEND WITH TOKEN      19650000
*                                           DISABLED BECAUSE SRB WAS    19700000
*                                           ABENDED BY PURGEDQ          19750000
*                                           PROCESSING.          @P4A*/ 19800000
*     3  LCCASSTE  BIT(1),               /* SRB SUSPEND WITH TOKEN      19850000
*                                           DISABLED BECAUSE SRB IS     19900000
*                                           REALLY A SUSPEND EXIT.      19950000
*                                                                @P4A*/ 20000000
*   2 LCCAR2DC    CHAR(4),               /* RESERVED             @P4C*/ 20050000
*   2 LCCAIOWA    PTR(31)   BDY(WORD),   /* ADDRESS OF IOS WORKAREA     20100000
*                                                    (MDCXXX)@G860PVB*/ 20150000
*   2 LCCAIOR1    FIXED(31),             /* RESERVED FOR IOS            20200000
*                                                   (MDCXXX) @G860PVB*/ 20250000
*   2 LCCAIOR2    FIXED(31),             /* RESERVED FOR IOS            20300000
*                                                   (MDCXXX) @G860PVB*/ 20350000
*   2 LCCAIOR3    FIXED(31),             /* RESERVED FOR IOS            20400000
*                                                   (MDCXXX) @G860PVB*/ 20450000
*   2 LCCAR2F0 FIXED(31) BDY(DWORD),     /* RESERVED             @L4A*/ 20500000
*   2 LCCAPCR1 CHAR(64) BDY(WORD),       /* PROGRAM FLIH RECURSION      20550000
*                                           CONTROL REGISTER SAVEAREA 1 20600000
*                                                                @L4C*/ 20650000
*    3 LCCAP1C0 FIXED(32),               /* CONTROL REGISTER 0   @L3A*/ 20700000
*    3 LCCAP1C1 FIXED(32),               /* CONTROL REGISTER 1   @L3A*/ 20750000
*    3 LCCAP1C2 FIXED(32),               /* DUCT ORIGIN ADDRESS (CR2)   20800000
*                                                                @L3A*/ 20850000
*    3 LCCAPXM1 CHAR(8) BDY(WORD),       /* PROGRAM FLIH CROSS MEMORY   20900000
*                                           CONTROL REGISTER SAVEAREA 1 20950000
*                                           - MUST BE ON A DOUBLE WORD  21000000
*                                           BOUNDARY.            @L3A*/ 21050000
*     5 LCCAP1C3 FIXED(32),              /* CONTROL REGISTER 3   @L3A*/ 21100000
*       7 LCCAPX1K FIXED(16),            /* PROGRAM KEY MASK     @L3A*/ 21150000
*       7 LCCAPX1S FIXED(16),            /* SASN                 @L3A*/ 21200000
*     5 LCCAP1C4 FIXED(32),              /* CONTROL REGISTER 4   @L3A*/ 21250000
*       7 LCCAPX1A FIXED(16),            /* AX                   @L3A*/ 21300000
*       7 LCCAPX1P FIXED(16),            /* PASN                 @L3A*/ 21350000
*    3 LCCAP1C5 FIXED(32),               /* ASTE REAL ADDRESS (CR5)     21400000
*                                                                @L3A*/ 21450000
*    3 LCCAP1C6 FIXED(32),               /* CONTROL REGISTER 6   @L3A*/ 21500000
*    3 LCCAP1C7 FIXED(32),               /* CONTROL REGISTER 7   @L3A*/ 21550000
*    3 LCCAP1C8 FIXED(32),               /* CONTROL REGISTER 8   @L3A*/ 21600000
*     5 LCCAPEX1 FIXED(16),              /* EAX VALUE  (LH CR8)  @L3A*/ 21650000
*     5 *        FIXED(16),              /* SECOND HALF OF CR8   @L3A*/ 21700000
*    3 LCCAP1C9 FIXED(32),               /* CONTROL REGISTER 9   @L3A*/ 21750000
*    3 LCCAP1CA FIXED(32),               /* CONTROL REGISTER 10  @L3A*/ 21800000
*    3 LCCAP1CB FIXED(32),               /* CONTROL REGISTER 11  @L3A*/ 21850000
*    3 LCCAP1CC FIXED(32),               /* CONTROL REGISTER 12  @L3A*/ 21900000
*    3 LCCAP1CD FIXED(32),               /* CONTROL REGISTER 13  @L3A*/ 21950000
*    3 LCCAP1CE FIXED(32),               /* CONTROL REGISTER 14  @L3A*/ 22000000
*    3 LCCAP1CF FIXED(32),               /* PROGRAM FLIH RECURSION      22050000
*                                           LINKAGE STACK ADDRESS       22100000
*                                           SAVEAREA 1  (CR15)   @L3A*/ 22150000
*   2 LCCAWDT     (16) FIXED(8),    /* WEB Distribution table. 16 one-  22200000
*                                   byte elements.                      22250000
*                                   INITIALIZED BY: IEAVINIT            22300000
*                                   SERIALIZATION: Dispatcher Active    22350000
*                                   OWNERSHIP: Supervisor Control       22400000
*                                                                @LDC*/ 22450000
*   2 LCCACWEB    PTR(31),          /* Address of current workunit's    22500000
*                                   WEB Address.                        22550000
*                                   SERIALIZATION: Disablement.  Global 22600000
*                                   Intersect required to change        22650000
*                                   another processor's LCCACWEB field. 22700000
*                                   OWNERSHIP: Supervisor Control       22750000
*                                                                @LDC*/ 22800000
*   2 LCCANWEB   PTR(31),           /* Address of the next WEB to be    22850000
*                                   dispatched on the current CPU.      22900000
*                                   SERIALIZATION: Compare and Swap     22950000
*                                   OWNERSHIP: Supervisor Control       23000000
*                                                                @LDC*/ 23050000
*   2 LCCAWUQI   FIXED(15),         /* Dispatcher's current index into  23100000
*                                   the WUQ Array (LCCAWUQA), used      23150000
*                                   during Dispatcher Work Search.      23200000
*                                   SERIALIZATION: Dispatcher Active    23250000
*                                   OWNERSHIP: Supervisor Control       23300000
*                                                                @08C*/ 23350000
*   2 LCCAWUQR   FIXED(16),         /* Dispatcher work queue rescans    23400000
*                                      remaining count.          @08A*/ 23450000
*   2 LCCAWUQM    PTR(31),          /* Address of this processor's      23500000
*                                   PWUQ.                               23550000
*                                   SERIALIZATION: Global Intersect     23600000
*                                   OWNERSHIP: Supervisor Control       23650000
*                                                                @LDA*/ 23700000
*   2 LCCAFWP CHAR(8) BDY(WORD), /*  Processor Free WEB Pool and count. 23750000
*                               SERIALIZATION: Disablement for current  23800000
*                                              processor's LCCAFWP      23850000
*                               OWNERSHIP: Supervisor Control           23900000
*                                                                @LDA*/ 23950000
*     3 LCCAFWPP PTR(31),    /* Processor WEB Free Pool Header.         24000000
*                               SERIALIZATION: Disablement for current  24050000
*                                              processor's LCCAFWPP.    24100000
*                               OWNERSHIP: Supervisor Control           24150000
*                                                                @LDA*/ 24200000
*     3 LCCAFWPC FIXED(31),  /* Processor WEB Free Pool element count.  24250000
*                               SERIALIZATION: Disablement for current  24300000
*                                              processor's LCCAFWPC.    24350000
*                               OWNERSHIP: Supervisor Control           24400000
*                                                                @LDA*/ 24450000
*   2 LCCAR35C    CHAR(4),          /* Reserved                  @LDC*/ 24500000
*   2 LCCASMQJ    FIXED(31),             /* GLOBAL SERVICE MANAGER      24550000
*                                           QUEUE (GSMQ) AND LOCAL      24600000
*                                           SERVICE MANAGER QUEUE       24650000
*                                           (LSMQ) JOURNAL WORD USED    24700000
*                                           BY DISPATCHER AND           24750000
*                                           SCHEDULE           MDC044*/ 24800000
*   2 LCCASPLJ    FIXED(31),             /* GLOBAL SYSTEM PRIORITY      24850000
*                                           LIST (GSPL) AND LOCAL       24900000
*                                           SYSTEM PRIORITY LIST        24950000
*                                           (LSPL) JOURNAL WORD USED    25000000
*                                           BY DISPATCHER      MDC045*/ 25050000
*   2 LCCAETP     CHAR(4),               /* Unproductive task           25100000
*                                           preemptions count due to    25150000
*                                           timeslices (External Flih   25200000
*                                           Detected).           @LGA*/ 25250000
*   2 LCCAETPB    CHAR(4),               /* Unproductive task           25300000
*                                           preemptions count Base.     25350000
*                                           Previous value of LCCAETP   25400000
*                                                                @LGA*/ 25450000
*   2 LCCAR370    CHAR(12),              /* RESERVED             @LHC*/ 25500000
*   2 LCCARWQL    PTR(31),               /* Recovery word for           25550000
*                                           WebQLock address.           25600000
*                                 Ownership: Supervisor Control         25650000
*                                 Serialization: Disablement     @LHA*/ 25700000
*   2 LCCASGPR  (16) FIXED(31),          /* SVC FLIH GENERAL            25750000
*                                           REGISTER SAVE AREA          25800000
*                                           (MDC301)         @ZA02598*/ 25850000
*   2 LCCADS0F    CHAR(1),               /* DISPATCHER DIAGNOSTIC EXIT  25900000
*                                           FLAG BYTE            @L4C*/ 25950000
*     3 LCCADSE1 BIT(1),                 /* DISPATCHER UNLOCKED TASK    26000000
*                                           DISPATCH DIAGNOSTIC EXIT    26050000
*                                           ROUTED CONTROL       @L4A*/ 26100000
*     3 LCCADSE2 BIT(1),                 /* DISPATCHER LOCKED TASK      26150000
*                                           DISPATCH DIAGNOSTIC EXIT    26200000
*                                           ROUTED CONTROL       @L4A*/ 26250000
*     3 LCCADSE3 BIT(1),                 /* DISPATCHER SRB DISPATCH     26300000
*                                           DIAGNOSTIC EXIT ROUTED      26350000
*                                           CONTROL              @L4A*/ 26400000
*     3 LCCADSE4 BIT(1),                 /* DISPATCHER SSRB DISPATCH    26450000
*                                           DIAGNOSTIC EXIT ROUTED      26500000
*                                           CONTROL              @L4A*/ 26550000
*     3 LCCADSE5 BIT(1),                 /* DISPATCHER WAIT TASK        26600000
*                                           DISPATCH DIAGNOSTIC EXIT    26650000
*                                           ROUTED CONTROL       @L4A*/ 26700000
*   2 LCCAFPFL BIT(8),                   /* FP Flags             @LJC*/ 26750000
*    3 *        BIT(3),                  /*                      @0GC*/ 26800000
*    3 LCCABFP  BIT(1),                  /* Additional FP status is     27100000
*                               being saved.                     @LJA*/ 27140000
*    3 *        BIT(3),                  /* Reserved             @LJA*/ 27190000
*    3 LCCABFPH BIT(1),                  /* BFP hardware is present.    27300000
*                               This bit is a duplicate of CVTBFPH      27350000
*                               so that dat-off reference can be        27400000
*                               made. It is set only at IPL and when    27450000
*                               a processor is brought online    @LJA*/ 27500000
*   2 LCCAPERC    CHAR(2),               /* PROGRAM EVENT RECORDING     27550000
*                                           CODE  (MDC326)   @G65RP9A*/ 27600000
*   2 LCCAPERA    PTR(31),               /* PER ADDRESS                 27650000
*                                           (MDC327)         @G65RP9A*/ 27700000
*   2 LCCASDUV PTR(31),                  /* SRB RELATED DUCT VIRTUAL    27750000
*                                           ADDRESS              @L3C*/ 27800000
*   2 LCCASDUR PTR(31),                  /* SRB RELATED DUCT REAL       27850000
*                                           ADDRESS              @L3A*/ 27900000
*   2 LCCAIDUV PTR(31),                  /* INTERRUPT HANDLER DUCT      27950000
*                                           VIRTUAL ADDRESS      @L3C*/ 28000000
*   2 LCCAIDUR PTR(31),                  /* INTERRUPT HANDLER DUCT REAL 28050000
*                                           ADDRESS              @L3A*/ 28100000
*   2 LCCASCW1 PTR(31),          /* SUPERVISOR CONTROL WORK AREA 1      28150000
*                                   USED BY VARIOUS SUPERVISORY ROUTINES28200000
*                                   PRESERVED ACROSS CALLS TO IEAVECMS  28250000
*                                   OWNERSHIP: SUPERVISOR CONTROL       28300000
*                                   SERIALIZATION: DISABLEMENT   @LCA*/ 28350000
*   2 LCCASCW2 PTR(31),          /* SUPERVISOR CONTROL WORK AREA 2      28400000
*                                   USED BY VARIOUS SUPERVISORY ROUTINES28450000
*                                   PRESERVED ACROSS CALLS TO IEAVECMS  28500000
*                                   OWNERSHIP: SUPERVISOR CONTROL       28550000
*                                   SERIALIZATION: DISABLEMENT   @LCA*/ 28600000
*   2 LCCASXMR CHAR(8),                  /* SVC FLIH CROSS MEMORY       28650000
*                                           CONTROL REGISTER SAVE       28700000
*                                           AREA   (MDC338)  @G383P9A*/ 28750000
*   2 LCCALKG1 CHAR(72),                 /* LOCK MANAGER REGISTER SAVE  28800000
*                                           AREA   (MDC338)  @G383P9A*/ 28850000
*   2 LCCALKG2 CHAR(64),                 /* LOCK MANAGER SUSPENSION     28900000
*                                           REGISTER SAVE AREA          28950000
*                                                  (MDC338)  @G383P9A*/ 29000000
*   2 LCCAELKP CHAR(8),                  /* LOCK MANAGER PSW SAVE       29050000
*                                           AREA   (MDC338)  @G383P9A*/ 29100000
*   2 LCCASTG1 CHAR(72),                 /* STATUS REGISTER SAVE AREA   29150000
*                                                  (MDC338)  @G383P9A*/ 29200000
*   2 LCCASCSA CHAR(20),                 /* PCLINK SAVE AREA            29250000
*                                           FOR REGISTERS 8-12          29300000
*                                           (CALLER'S REGISTERS)        29350000
*                                                  (MDC341)  @G383P9A*/ 29400000
*   2 LCCASREG CHAR(52),                 /* PCLINK REGISTER             29450000
*                                           SAVE AREA                   29500000
*                                                  (MDC341)  @G383P9A*/ 29550000
*   2 LCCASMSK CHAR(1),                  /* PCLINK SYSTEM               29600000
*                                           MASK   (MDC341)  @G383P9A*/ 29650000
*   2 LCCARSMK CHAR(1),                  /* RESUME TCTL SYSTEM MASK     29700000
*                                                  (MDC340)  @G383P9A*/ 29750000
*   2 LCCAPGMM CHAR(1),                  /* PCLINK PROGRAM MASK         29800000
*                                                  (MDC341)  @G383P9A*/ 29850000
*   2 LCCATCFB BIT(8),                   /* RESUME/TCTL RECOVERY        29900000
*                                           FOOTPRINT BYTE              29950000
*                                                  (MDC346)  @G383P9A*/ 30000000
*    3 LCCATCTL BIT(1),                  /* TCTL IN CONTROL AT ABEND    30050000
*                                                  (MDC346)  @G383P9A*/ 30100000
*    3 LCCATCAC BIT(1),                  /* TCBACTIV AND TCBS3A SET     30150000
*                                                  (MDC346)  @G383P9A*/ 30200000
*   2 LCCARSME CHAR(40),                 /* RESUME REGISTER SAVE        30250000
*                                           AREA FOR REGISTERS 11-4     30300000
*                                                  (MDC338)  @G383P9A*/ 30350000
*    3 LCCARES1 CHAR(28),                /* RESUME REGISTER SAVE        30400000
*                                           AREA REG 11-REG 1           30450000
*                                                  (MDC338)  @G383P9A*/ 30500000
*    3 LCCARES2 CHAR(12),                /* RESUME REGISTER SAVE        30550000
*                                           AREA REG 2 - REG 4          30600000
*                                                  (MDC338)  @G383P9A*/ 30650000
*   2 LCCASPSW CHAR(4),                  /* SYSTEM MASK SAVE AREA,      30700000
*                                           USED BY MACHINE CHECK       30750000
*                                           HANDLER          @YA07494*/ 30800000
*   2 LCCASRGS PTR(31),                  /* RETURN ADDRESS SAVE AREA,   30850000
*                                           USED BY MACHINE CHECK       30900000
*                                           HANDLER          @YA07494*/ 30950000
*   2 LCCAPRMW PTR(31),             /* Address of the WEB on whose      31000000
*                                   behalf a priority promotion was     31050000
*                                   initiaed.                           31100000
*                                   SERIALIZATION: Dispatcher Active    31150000
*                                   OWNERSHIP: Supervisor Control       31200000
*                                                                @LDC*/ 31250000
*   2 LCCAPTCB PTR(31),                  /* ADDRESS OF THE TCB ON       31300000
*                                           WHOSE BEHALF A PRIORITY     31350000
*                                           PROMOTION WAS INITIATED.    31400000
*                                                  (MDC347)  @G383P9A*/ 31450000
*   2 LCCAPRTN PTR(31),                  /* DISPATCHER RETURN POINT     31500000
*                                           IF NO DISPATCHABLE WORK     31550000
*                                           IS FOUND IN A PROMOTED      31600000
*                                           ADDRESS SPACE.              31650000
*                                                  (MDC347)  @G383P9A*/ 31700000
*   2 LCCACDXM CHAR(8),                  /* CALLDISP XMEM SAVE          31750000
*                                           AREA   (MDC338)  @G383P9A*/ 31800000
*   2 LCCASRXM CHAR(8) BDY(WORD),        /* CROSS MEMORY SAVE AREA FOR  31850000
*                                           STOP/RESET AND SRB STATUS   31900000
*                                           SAVE/RESTORE/MODIFY         31950000
*                                           ROUTINES.            @L4C*/ 32000000
*    3 LCCASRSA FIXED(31),               /* STOP/RESET IAC SAVE AREA.   32050000
*                                                                @L4A*/ 32100000
*    3 LCCASRTK FIXED(31),               /* HOLDS SSARTO TOKEN FOR      32150000
*                                           STOP/RESET.          @L4A*/ 32200000
*   2 LCCACR8W FIXED(31),                /* WORK AREA FOR CTL REG 8     32250000
*                                                            @YA16565*/ 32300000
*   2 LCCAIOXM CHAR(12) BDY(WORD),       /* IOS CROSS MEMORY SAVE       32350000
*                                           AREA   (MDC339)  @G383P9A*/ 32400000
*    3 LCCAIOSS FIXED(31),               /* IOS PSW S-BIT REGISTER      32450000
*                                           SAVE AREA                   32500000
*                                                  (MDC339)  @G387PXH*/ 32550000
*    3 LCCAIOC3 FIXED(31),               /* IOS CONTROL REGISTER 3      32600000
*                                           SAVE AREA                   32650000
*                                                  (MDC339)  @G383P9A*/ 32700000
*    3 LCCAIOC4 FIXED(31),               /* IOS CONTROL REGISTER 4      32750000
*                                           SAVE AREA                   32800000
*                                                  (MDC339)  @G383P9A*/ 32850000
*   2 LCCABBRC FIXED(31),                /* BIND BREAK COMMUNICATION    32900000
*                                           BUFFER USED BY IEAVEBBR     32950000
*                                                  (MDC344)  @G383P9A*/ 33000000
*   2 LCCACDSV CHAR(64),                 /* CALLDISP SERVICE ROUTINE    33050000
*                                           REGISTER SAVE AREA FOR      33100000
*                                           REGISTERS 0-15              33150000
*                                                  (MDC344)  @G383P9A*/ 33200000
*    3 LCCACDS0 CHAR(4),                 /* CALLDISP REGISTER 0 SAVE    33250000
*                                           AREA   (MDC344)  @G383P9A*/ 33300000
*    3 LCCACDS1 CHAR(4),                 /* CALLDISP REGISTER 1 SAVE    33350000
*                                           AREA   (MDC344)  @G383P9A*/ 33400000
*    3 LCCACDS2 CHAR(4),                 /* CALLDISP REGISTER 2 SAVE    33450000
*                                           AREA   (MDC344)  @G383P9A*/ 33500000
*    3 LCCACDS3 CHAR(4),                 /* CALLDISP REGISTER 3 SAVE    33550000
*                                           AREA   (MDC344)  @G383P9A*/ 33600000
*    3 LCCACDS4 CHAR(4),                 /* CALLDISP REGISTER 4 SAVE    33650000
*                                           AREA   (MDC344)  @G383P9A*/ 33700000
*    3 LCCACDS5 CHAR(4),                 /* CALLDISP REGISTER 5 SAVE    33750000
*                                           AREA   (MDC344)  @G383P9A*/ 33800000
*    3 LCCACDS6 CHAR(4),                 /* CALLDISP REGISTER 6 SAVE    33850000
*                                           AREA   (MDC344)  @G383P9A*/ 33900000
*    3 LCCACDS7 CHAR(4),                 /* CALLDISP REGISTER 7 SAVE    33950000
*                                           AREA   (MDC344)  @G383P9A*/ 34000000
*    3 LCCACDS8 CHAR(4),                 /* CALLDISP REGISTER 8 SAVE    34050000
*                                           AREA   (MDC344)  @G383P9A*/ 34100000
*    3 LCCACDS9 CHAR(4),                 /* CALLDISP REGISTER 9 SAVE    34150000
*                                           AREA   (MDC344)  @G383P9A*/ 34200000
*    3 LCCACDSA CHAR(4),                 /* CALLDISP REGISTER 10 SAVE   34250000
*                                           AREA   (MDC344)  @G383P9A*/ 34300000
*    3 LCCACDSB CHAR(4),                 /* CALLDISP REGISTER 11 SAVE   34350000
*                                           AREA   (MDC344)  @G383P9A*/ 34400000
*    3 LCCACDSC CHAR(4),                 /* CALLDISP REGISTER 12 SAVE   34450000
*                                           AREA   (MDC344)  @G383P9A*/ 34500000
*    3 LCCACDSD CHAR(4),                 /* CALLDISP REGISTER 13 SAVE   34550000
*                                           AREA   (MDC344)  @G383P9A*/ 34600000
*    3 LCCACDSE CHAR(4),                 /* CALLDISP REGISTER 14 SAVE   34650000
*                                           AREA   (MDC344)  @G383P9A*/ 34700000
*    3 LCCACDSF CHAR(4),                 /* CALLDISP REGISTER 15 SAVE   34750000
*                                           AREA   (MDC344)  @G383P9A*/ 34800000
*   2 LCCASLSA CHAR(64),                 /* LCCA SINGLE LEVEL SAVE      34850000
*                                           AREA USED BY MACHINE CHECK  34900000
*                                           HANDLER (MDC344) @G383P9A*/ 34950000
*   2 LCCARWEB PTR(31),                  /* Address of WEB expected     35000000
*                                           to be locked by this CPU on 35050000
*                                           entry to global recovery    35100000
*                                                                @P7A*/ 35150000
*     3 LCCARWLK BIT(1),                 /* Indicator that WEB in       35200000
*                                           LCCARWEB is not validly     35250000
*                                           locked but the AWQ lock for 35300000
*                                           the WEB can be held by      35350000
*                                           this CPU             @P9C*/ 35400000
*   2 LCCAPOST CHAR(40) BDY(WORD),       /* POST SAVE AREA FOR          35450000
*                                           SRB POOL MANAGER @G860PXF*/ 35500000
*   2 LCCAALOV PTR(31),                  /* SRB RELATED AL VIRTUAL      35550000
*                                           ADDRESS OR ZERO (ZERO MEANS 35600000
*                                           THE NULL OR BASIC ACCESS    35650000
*                                           LIST)                @L3A*/ 35700000
*   2 LCCAPSB2 PTR(31),                  /* ASCB ADDRESS WHERE          35750000
*                                           PAGE/SEGMENT FAULT OCCURRED 35800000
*                                                                @L3A*/ 35850000
*   2 LCCALSSD PTR(31),                  /* LSSD ADDRESS FOR THE        35900000
*                                           PROCESSOR RELATED SRB       35950000
*                                           LINKAGE STACK        @L3C*/ 36000000
*   2 LCCALSDP PTR(31),                  /* ADDRESS OF THE FIRST LSED   36050000
*                                           IN THE PROCESSOR RELATED    36100000
*                                           SRB LINKAGE STACK    @L3A*/ 36150000
*   2 LCCAXTIM CHAR(8),                  /* EXTERNAL FLIH TIMER         36200000
*                                           SAVE AREA 1      @G860PXF*/ 36250000
*   2 LCCAPAR3    CHAR(64) BDY(DWORD),   /* PROGRAM FLIH RECURSION MC   36300000
*                                           ACCESS REGISTER SAVEAREA 3  36350000
*                                                                @L4C*/ 36400000
*     3 LCCAP3A0 FIXED(32),              /* ACCESS REGISTER 0    @L3A*/ 36450000
*     3 LCCAP3A1 FIXED(32),              /* ACCESS REGISTER 1    @L3A*/ 36500000
*     3 LCCAP3A2 FIXED(32),              /* ACCESS REGISTER 2    @L3A*/ 36550000
*     3 LCCAP3A3 FIXED(32),              /* ACCESS REGISTER 3    @L3A*/ 36600000
*     3 LCCAP3A4 FIXED(32),              /* ACCESS REGISTER 4    @L3A*/ 36650000
*     3 LCCAP3A5 FIXED(32),              /* ACCESS REGISTER 5    @L3A*/ 36700000
*     3 LCCAP3A6 FIXED(32),              /* ACCESS REGISTER 6    @L3A*/ 36750000
*     3 LCCAP3A7 FIXED(32),              /* ACCESS REGISTER 7    @L3A*/ 36800000
*     3 LCCAP3A8 FIXED(32),              /* ACCESS REGISTER 8    @L3A*/ 36850000
*     3 LCCAP3A9 FIXED(32),              /* ACCESS REGISTER 9    @L3A*/ 36900000
*     3 LCCAP3AA FIXED(32),              /* ACCESS REGISTER 10   @L3A*/ 36950000
*     3 LCCAP3AB FIXED(32),              /* ACCESS REGISTER 11   @L3A*/ 37000000
*     3 LCCAP3AC FIXED(32),              /* ACCESS REGISTER 12   @L3A*/ 37050000
*     3 LCCAP3AD FIXED(32),              /* ACCESS REGISTER 13   @L3A*/ 37100000
*     3 LCCAP3AE FIXED(32),              /* ACCESS REGISTER 14   @L3A*/ 37150000
*     3 LCCAP3AF FIXED(32),              /* ACCESS REGISTER 15   @L3A*/ 37200000
*   2 LCCAEMS0 CHAR(64),                 /* IEAVWUQA REGISTER SAVE      37250000
*                                           AREA                 @LDC*/ 37300000
*   2 LCCAPPS1 CHAR(8) BDY(DWORD),       /* PROGRAM FLIH RECURSION      37350000
*                                           PSW SAVE AREA 1  @G860PXK*/ 37400000
*   2 LCCAPIC1 CHAR(4),                  /* PROGRAM FLIH RECURSION      37450000
*                                           ILC AND INTERRUPT CODE      37500000
*                                           SAVE AREA 1      @G860PXK*/ 37550000
*   2 LCCAPTE1 CHAR(4),                  /* PROGRAM FLIH RECURSION      37600000
*                                           TRANSLATION EXCEPTION       37650000
*                                           ADDRESS SAVE AREA 1         37700000
*                                                            @G860PXK*/ 37750000
*   2 LCCAPGR4 CHAR(64),                 /* PROGRAM FLIH REGISTER       37800000
*                                           SAVE AREA 4      @G860PXK*/ 37850000
*   2 LCCAPSLI CHAR(72),                 /* PROGRAM FLIH SAVE AREA      37900000
*                                           TO PASS TO SLIH ROUTINES    37950000
*                                                            @G860PXK*/ 38000000
*   2 LCCALSHD PTR(31),                  /* LSSD ADDRESS FOR THE        38050000
*                                           INTERRUPT HANDLER LINKAGE   38100000
*                                           STACK                @L3C*/ 38150000
*   2 LCCALSHP PTR(31),                  /* ADDRESS OF THE FIRST LSED   38200000
*                                           IN THE INTERRUPT HANDLER    38250000
*                                           LINKAGE STACK        @L3A*/ 38300000
*   2 LCCAPPS3 CHAR(8) BDY(DWORD),       /* PROGRAM FLIH RECURSION      38350000
*                                           PSW SAVE AREA 3  @G860PXK*/ 38400000
*   2 LCCAPIC3 CHAR(4),                  /* PROGRAM FLIH RECURSION      38450000
*                                           ILC AND INTERRUPT CODE      38500000
*                                           SAVE AREA 3      @G860PXK*/ 38550000
*   2 LCCAPTE3 CHAR(4),                  /* PROGRAM FLIH RECURSION      38600000
*                                           TRANSLATION EXCEPTION       38650000
*                                           ADDRESS SAVE AREA 3         38700000
*                                                            @G860PXK*/ 38750000
*   2 LCCAPAR1 CHAR(64) BDY(DWORD),      /* PROGRAM FLIH RECURSION      38800000
*                                           ACCESS REGISTER SAVEAREA 1  38850000
*                                                                @L4C*/ 38900000
*     3 LCCAP1A0 FIXED(32),              /* ACCESS REGISTER 0    @L3A*/ 38950000
*     3 LCCAP1A1 FIXED(32),              /* ACCESS REGISTER 1    @L3A*/ 39000000
*     3 LCCAP1A2 FIXED(32),              /* ACCESS REGISTER 2    @L3A*/ 39050000
*     3 LCCAP1A3 FIXED(32),              /* ACCESS REGISTER 3    @L3A*/ 39100000
*     3 LCCAP1A4 FIXED(32),              /* ACCESS REGISTER 4    @L3A*/ 39150000
*     3 LCCAP1A5 FIXED(32),              /* ACCESS REGISTER 5    @L3A*/ 39200000
*     3 LCCAP1A6 FIXED(32),              /* ACCESS REGISTER 6    @L3A*/ 39250000
*     3 LCCAP1A7 FIXED(32),              /* ACCESS REGISTER 7    @L3A*/ 39300000
*     3 LCCAP1A8 FIXED(32),              /* ACCESS REGISTER 8    @L3A*/ 39350000
*     3 LCCAP1A9 FIXED(32),              /* ACCESS REGISTER 9    @L3A*/ 39400000
*     3 LCCAP1AA FIXED(32),              /* ACCESS REGISTER 10   @L3A*/ 39450000
*     3 LCCAP1AB FIXED(32),              /* ACCESS REGISTER 11   @L3A*/ 39500000
*     3 LCCAP1AC FIXED(32),              /* ACCESS REGISTER 12   @L3A*/ 39550000
*     3 LCCAP1AD FIXED(32),              /* ACCESS REGISTER 13   @L3A*/ 39600000
*     3 LCCAP1AE FIXED(32),              /* ACCESS REGISTER 14   @L3A*/ 39650000
*     3 LCCAP1AF FIXED(32),              /* ACCESS REGISTER 15   @L3A*/ 39700000
*   2 LCCAPAR4 CHAR(64) BDY(DWORD),      /* PROGRAM FLIH ACCESS         39750000
*                                           REGISTER SAVEAREA 4  @L4C*/ 39800000
*     3 LCCAP4A0 FIXED(32),              /* ACCESS REGISTER 0    @L3A*/ 39850000
*     3 LCCAP4A1 FIXED(32),              /* ACCESS REGISTER 1    @L3A*/ 39900000
*     3 LCCAP4A2 FIXED(32),              /* ACCESS REGISTER 2    @L3A*/ 39950000
*     3 LCCAP4A3 FIXED(32),              /* ACCESS REGISTER 3    @L3A*/ 40000000
*     3 LCCAP4A4 FIXED(32),              /* ACCESS REGISTER 4    @L3A*/ 40050000
*     3 LCCAP4A5 FIXED(32),              /* ACCESS REGISTER 5    @L3A*/ 40100000
*     3 LCCAP4A6 FIXED(32),              /* ACCESS REGISTER 6    @L3A*/ 40150000
*     3 LCCAP4A7 FIXED(32),              /* ACCESS REGISTER 7    @L3A*/ 40200000
*     3 LCCAP4A8 FIXED(32),              /* ACCESS REGISTER 8    @L3A*/ 40250000
*     3 LCCAP4A9 FIXED(32),              /* ACCESS REGISTER 9    @L3A*/ 40300000
*     3 LCCAP4AA FIXED(32),              /* ACCESS REGISTER 10   @L3A*/ 40350000
*     3 LCCAP4AB FIXED(32),              /* ACCESS REGISTER 11   @L3A*/ 40400000
*     3 LCCAP4AC FIXED(32),              /* ACCESS REGISTER 12   @L3A*/ 40450000
*     3 LCCAP4AD FIXED(32),              /* ACCESS REGISTER 13   @L3A*/ 40500000
*     3 LCCAP4AE FIXED(32),              /* ACCESS REGISTER 14   @L3A*/ 40550000
*     3 LCCAP4AF FIXED(32),              /* ACCESS REGISTER 15   @L3A*/ 40600000
*   2 LCCARARS CHAR(64) BDY(DWORD),      /* RESTART FLIH ACCESS         40650000
*                                           REGISTER SAVEAREA    @L4C*/ 40700000
*     3 LCCARAR0 FIXED(32),              /* ACCESS REGISTER 0    @L3A*/ 40750000
*     3 LCCARAR1 FIXED(32),              /* ACCESS REGISTER 1    @L3A*/ 40800000
*     3 LCCARAR2 FIXED(32),              /* ACCESS REGISTER 2    @L3A*/ 40850000
*     3 LCCARAR3 FIXED(32),              /* ACCESS REGISTER 3    @L3A*/ 40900000
*     3 LCCARAR4 FIXED(32),              /* ACCESS REGISTER 4    @L3A*/ 40950000
*     3 LCCARAR5 FIXED(32),              /* ACCESS REGISTER 5    @L3A*/ 41000000
*     3 LCCARAR6 FIXED(32),              /* ACCESS REGISTER 6    @L3A*/ 41050000
*     3 LCCARAR7 FIXED(32),              /* ACCESS REGISTER 7    @L3A*/ 41100000
*     3 LCCARAR8 FIXED(32),              /* ACCESS REGISTER 8    @L3A*/ 41150000
*     3 LCCARAR9 FIXED(32),              /* ACCESS REGISTER 9    @L3A*/ 41200000
*     3 LCCARARA FIXED(32),              /* ACCESS REGISTER 10   @L3A*/ 41250000
*     3 LCCARARB FIXED(32),              /* ACCESS REGISTER 11   @L3A*/ 41300000
*     3 LCCARARC FIXED(32),              /* ACCESS REGISTER 12   @L3A*/ 41350000
*     3 LCCARARD FIXED(32),              /* ACCESS REGISTER 13   @L3A*/ 41400000
*     3 LCCARARE FIXED(32),              /* ACCESS REGISTER 14   @L3A*/ 41450000
*     3 LCCARARF FIXED(32),              /* ACCESS REGISTER 15   @L3A*/ 41500000
*   2 LCCAR820 CHAR(2),                  /* RESERVED             @LMC*/ 41525000
*   2 LCCAOILC FIXED(15),                /* Original ILC. Only valid    41550000
*                                           when LCCAFPPE is on  @LMA*/ 41575000
*   2 LCCAPCR3 CHAR(64) BDY(WORD),       /* PROGRAM FLIH RECURSION MC   41600000
*                                           CONTROL REGISTER SAVEAREA 3 41650000
*                                                                @L4C*/ 41700000
*    3 LCCAP3C0 FIXED(32),               /* CONTROL REGISTER 0   @L3A*/ 41750000
*    3 LCCAP3C1 FIXED(32),               /* CONTROL REGISTER 1   @L3A*/ 41800000
*    3 LCCAP3C2 FIXED(32),               /* DUCT ORIGIN ADDRESS (CR2)   41850000
*                                                                @L3A*/ 41900000
*    3 LCCAPXM3 CHAR(8) BDY(WORD),       /* PROGRAM FLIH CROSS MEMORY   41950000
*                                           CONTROL REGISTER SAVEAREA 3 42000000
*                                           - MUST BE ON A DOUBLE WORD  42050000
*                                           BOUNDARY.            @L3A*/ 42100000
*     5 LCCAP3C3 FIXED(32),              /* CONTROL REGISTER 3   @L3A*/ 42150000
*       7 LCCAPX3K FIXED(16),            /* PROGRAM KEY MASK     @L3A*/ 42200000
*       7 LCCAPX3S FIXED(16),            /* SASN                 @L3A*/ 42250000
*     5 LCCAP3C4 FIXED(32),              /* CONTROL REGISTER 4   @L3A*/ 42300000
*       7 LCCAPX3A FIXED(16),            /* AX                   @L3A*/ 42350000
*       7 LCCAPX3P FIXED(16),            /* PASN                 @L3A*/ 42400000
*    3 LCCAP3C5 FIXED(32),               /* ASTE REAL ADDRESS    @L3A*/ 42450000
*    3 LCCAP3C6 FIXED(32),               /* CONTROL REGISTER 6   @L3A*/ 42500000
*    3 LCCAP3C7 FIXED(32),               /* CONTROL REGISTER 7   @L3A*/ 42550000
*    3 LCCAP3C8 FIXED(32),               /* CONTROL REGISTER 8   @L3A*/ 42600000
*     5 LCCAPEX3 FIXED(16),              /* EAX VALUE  (LH CR8)  @L3A*/ 42650000
*     5 *        FIXED(16),              /* SECOND HALF OF CR8   @L3A*/ 42700000
*    3 LCCAP3C9 FIXED(32),               /* CONTROL REGISTER 9   @L3A*/ 42750000
*    3 LCCAP3CA FIXED(32),               /* CONTROL REGISTER 10  @L3A*/ 42800000
*    3 LCCAP3CB FIXED(32),               /* CONTROL REGISTER 11  @L3A*/ 42850000
*    3 LCCAP3CC FIXED(32),               /* CONTROL REGISTER 12  @L3A*/ 42900000
*    3 LCCAP3CD FIXED(32),               /* CONTROL REGISTER 13  @L3A*/ 42950000
*    3 LCCAP3CE FIXED(32),               /* CONTROL REGISTER 14  @L3A*/ 43000000
*    3 LCCAP3CF FIXED(32),               /* PROGRAM FLIH RECURSION      43050000
*                                           LINKAGE STACK ADDRESS       43100000
*                                           SAVEAREA 3   (CR15)  @L3A*/ 43150000
*   2 LCCAPCR4 CHAR(64) BDY(WORD),       /* PROGRAM FLIH CONTROL        43200000
*                                           REGISTER SAVEAREA 4  @L4C*/ 43250000
*    3 LCCAP4C0 FIXED(32),               /* CONTROL REGISTER 0   @L3A*/ 43300000
*    3 LCCAP4C1 FIXED(32),               /* CONTROL REGISTER 1   @L3A*/ 43350000
*    3 LCCAP4C2 FIXED(32),               /* DUCT ORIGIN ADDRESS (CR2)   43400000
*                                                                @L3A*/ 43450000
*    3 LCCAPXM4 CHAR(8) BDY(WORD),       /* PROGRAM FLIH CROSS MEMORY   43500000
*                                           CONTROL REGISTER SAVEAREA 4 43550000
*                                           - MUST BE ON A DOUBLE WORD  43600000
*                                           BOUNDARY.            @L3A*/ 43650000
*     5 LCCAP4C3 FIXED(32),              /* CONTROL REGISTER 3   @L3A*/ 43700000
*       7 LCCAPX4K FIXED(16),            /* PROGRAM KEY MASK     @L3A*/ 43750000
*       7 LCCAPX4S FIXED(16),            /* SASN                 @L3A*/ 43800000
*     5 LCCAP4C4 FIXED(32),              /* CONTROL REGISTER 4   @L3A*/ 43850000
*       7 LCCAPX4A FIXED(16),            /* AX                   @L3A*/ 43900000
*       7 LCCAPX4P FIXED(16),            /* PASN                 @L3A*/ 43950000
*    3 LCCAP4C5 FIXED(32),               /* ASTE REAL ADDRESS    @L3A*/ 44000000
*    3 LCCAP4C6 FIXED(32),               /* CONTROL REGISTER 6   @L3A*/ 44050000
*    3 LCCAP4C7 FIXED(32),               /* CONTROL REGISTER 7   @L3A*/ 44100000
*    3 LCCAP4C8 FIXED(32),               /* CONTROL REGISTER 8   @L3A*/ 44150000
*     5 LCCAPEX4 FIXED(16),              /* EAX VALUE  (LH CR8)  @L3A*/ 44200000
*     5 *        FIXED(16),              /* SECOND HALF OF CR8   @L3A*/ 44250000
*    3 LCCAP4C9 FIXED(32),               /* CONTROL REGISTER 9   @L3A*/ 44300000
*    3 LCCAP4CA FIXED(32),               /* CONTROL REGISTER 10  @L3A*/ 44350000
*    3 LCCAP4CB FIXED(32),               /* CONTROL REGISTER 11  @L3A*/ 44400000
*    3 LCCAP4CC FIXED(32),               /* CONTROL REGISTER 12  @L3A*/ 44450000
*    3 LCCAP4CD FIXED(32),               /* CONTROL REGISTER 13  @L3A*/ 44500000
*    3 LCCAP4CE FIXED(32),               /* CONTROL REGISTER 14  @L3A*/ 44550000
*    3 LCCAP4CF FIXED(32),               /* PROGRAM FLIH RECURSION      44600000
*                                           LINKAGE STACK ADDRESS       44650000
*                                           SAVEAREA 4   (CR15)  @L3A*/ 44700000
*   2 LCCARCRS CHAR(64) BDY(WORD),       /* RESTART FLIH CONTROL        44750000
*                                           REGISTER SAVEAREA    @L4C*/ 44800000
*    3 LCCARCR0 FIXED(32),               /* CONTROL REGISTER 0   @L3A*/ 44850000
*                                                                       44900000
*    3 LCCARCR1 FIXED(32),               /* CONTROL REGISTER 1   @L3A*/ 44950000
*    3 LCCARCR2 PTR(31),                 /* DUCT ORIGIN ADDRESS (CR2)   45000000
*                                                                @L3A*/ 45050000
*    3 LCCARXMR CHAR(8) BDY(WORD),       /* RESTART FLIH CROSS MEMORY   45100000
*                                           CONTROL REGISTER SAVEAREA   45150000
*                                           - MUST BE ON A DOUBLE WORD  45200000
*                                           BOUNDARY.            @L3A*/ 45250000
*      5 LCCARCR3 FIXED(32),             /* CONTROL REGISTER 3   @L3A*/ 45300000
*        7 LCCARXRK FIXED(16),           /* PROGRAM KEY MASK     @L3A*/ 45350000
*        7 LCCARXRS FIXED(16),           /* SASN                 @L3A*/ 45400000
*      5 LCCARCR4 FIXED(32),             /* CONTROL REGISTER 4   @L3A*/ 45450000
*        7 LCCARXRA FIXED(16),           /* AX                   @L3A*/ 45500000
*        7 LCCARXRP FIXED(16),           /* PASN                 @L3A*/ 45550000
*    3 LCCARCR5 FIXED(32),               /* CONTROL REGISTER 5   @L3A*/ 45600000
*    3 LCCARCR6 FIXED(32),               /* CONTROL REGISTER 6   @L3A*/ 45650000
*    3 LCCARCR7 FIXED(32),               /* CONTROL REGISTER 7   @L3A*/ 45700000
*    3 LCCARCR8 FIXED(32),               /* CONTROL REGISTER 8   @L3A*/ 45750000
*      5 LCCAREAX FIXED(16),             /* EAX VALUE  (LH CR8)  @L3A*/ 45800000
*      5 *        FIXED(16),             /* SECOND HALF OF CR8   @L3A*/ 45850000
*    3 LCCARCR9 FIXED(32),               /* CONTROL REGISTER 9   @L3A*/ 45900000
*    3 LCCARCRA FIXED(32),               /* CONTROL REGISTER 10  @L3A*/ 45950000
*    3 LCCARCRB FIXED(32),               /* CONTROL REGISTER 11  @L3A*/ 46000000
*    3 LCCARCRC FIXED(32),               /* CONTROL REGISTER 12  @L3A*/ 46050000
*    3 LCCARCRD FIXED(32),               /* CONTROL REGISTER 13  @L3A*/ 46100000
*    3 LCCARCRE FIXED(32),               /* CONTROL REGISTER 14  @L3A*/ 46150000
*    3 LCCARCRF PTR(31),                 /* LINKAGE STACK ENTRY         46200000
*                                           ADDRESS  (CR15)      @L3A*/ 46250000
*   2 LCCAPGR5 CHAR(64),                 /* PROGRAM FLIH RECURSION      46300000
*                                           REGISTER SAVE AREA 5 @L5A*/ 46350000
*   2 LCCAPSB5 PTR(31),                  /* ASCB ADDRESS WHERE          46400000
*                                           PAGE/SEGMENT FAULT OCCURRED 46450000
*                                                                @L5A*/ 46500000
*   2 LCCAPAR5    CHAR(64) BDY(DWORD),   /* PROGRAM FLIH RECURSION      46550000
*                                     ACCESS REGISTER SAVEAREA 5 @L5A*/ 46600000
*     3 LCCAP5A0 FIXED(32),              /* ACCESS REGISTER 0    @L5A*/ 46650000
*     3 LCCAP5A1 FIXED(32),              /* ACCESS REGISTER 1    @L5A*/ 46700000
*     3 LCCAP5A2 FIXED(32),              /* ACCESS REGISTER 2    @L5A*/ 46750000
*     3 LCCAP5A3 FIXED(32),              /* ACCESS REGISTER 3    @L5A*/ 46800000
*     3 LCCAP5A4 FIXED(32),              /* ACCESS REGISTER 4    @L5A*/ 46850000
*     3 LCCAP5A5 FIXED(32),              /* ACCESS REGISTER 5    @L5A*/ 46900000
*     3 LCCAP5A6 FIXED(32),              /* ACCESS REGISTER 6    @L5A*/ 46950000
*     3 LCCAP5A7 FIXED(32),              /* ACCESS REGISTER 7    @L5A*/ 47000000
*     3 LCCAP5A8 FIXED(32),              /* ACCESS REGISTER 8    @L5A*/ 47050000
*     3 LCCAP5A9 FIXED(32),              /* ACCESS REGISTER 9    @L5A*/ 47100000
*     3 LCCAP5AA FIXED(32),              /* ACCESS REGISTER 10   @L5A*/ 47150000
*     3 LCCAP5AB FIXED(32),              /* ACCESS REGISTER 11   @L5A*/ 47200000
*     3 LCCAP5AC FIXED(32),              /* ACCESS REGISTER 12   @L5A*/ 47250000
*     3 LCCAP5AD FIXED(32),              /* ACCESS REGISTER 13   @L5A*/ 47300000
*     3 LCCAP5AE FIXED(32),              /* ACCESS REGISTER 14   @L5A*/ 47350000
*     3 LCCAP5AF FIXED(32),              /* ACCESS REGISTER 15   @L5A*/ 47400000
*   2 LCCAPTR5    FIXED(8),              /* PROGRAM FLIH RECURSION TEA  47450000
*                                           AR NUMBER SAVEAREA 5 @L5A*/ 47500000
*   2 LCCAPMFV    FIXED(8),              /* RECURSIVE PAGE FAULT        47550000
*                                           MAINLINE FUNCTION VALUE     47600000
*                                           SAVEAREA             @L5A*/ 47650000
*   2 LCCADIEP    FIXED(16),             /* PASN value set by previous  47700000
*                                           CMSET,SET,DIE=YES,... Used  47750000
*                                           by program FLIH to          47800000
*                                           determine whether a SSE     47850000
*                                           program interrupt is        47900000
*                                           valid.               @0EC*/ 47950000
*   2 LCCAPCR5 CHAR(64) BDY(WORD),       /* PROGRAM FLIH RECURSION      48000000
*                                    CONTROL REGISTER SAVEAREA 5 @L5A*/ 48050000
*    3 LCCAP5C0 FIXED(32),               /* CONTROL REGISTER 0   @L5A*/ 48100000
*                                                                       48150000
*    3 LCCAP5C1 FIXED(32),               /* CONTROL REGISTER 1   @L5A*/ 48200000
*    3 LCCAP5C2 PTR(31),                 /* DUCT ORIGIN ADDRESS (CR2)   48250000
*                                                                @L5A*/ 48300000
*    3 LCCAPXM5 CHAR(8) BDY(WORD),       /* PROGRAM FLIH CROSS MEMORY   48350000
*                                           CONTROL REGISTER SAVEAREA 5 48400000
*                                           - MUST BE ON A DOUBLE WORD  48450000
*                                           BOUNDARY.            @L5A*/ 48500000
*      5 LCCAP5C3 FIXED(32),             /* CONTROL REGISTER 3   @L5A*/ 48550000
*        7 LCCAPX5K FIXED(16),           /* PROGRAM KEY MASK     @L5A*/ 48600000
*        7 LCCAPX5S FIXED(16),           /* SASN                 @L5A*/ 48650000
*      5 LCCAP5C4 FIXED(32),             /* CONTROL REGISTER 4   @L5A*/ 48700000
*        7 LCCAPX5A FIXED(16),           /* AX                   @L5A*/ 48750000
*        7 LCCAPX5P FIXED(16),           /* PASN                 @L5A*/ 48800000
*    3 LCCAP5C5 FIXED(32),               /* CONTROL REGISTER 5   @L5A*/ 48850000
*    3 LCCAP5C6 FIXED(32),               /* CONTROL REGISTER 6   @L5A*/ 48900000
*    3 LCCAP5C7 FIXED(32),               /* CONTROL REGISTER 7   @L5A*/ 48950000
*    3 LCCAP5C8 FIXED(32),               /* CONTROL REGISTER 8   @L5A*/ 49000000
*      5 LCCAPEX5 FIXED(16),             /* EAX VALUE  (LH CR8)  @L5A*/ 49050000
*      5 *        FIXED(16),             /* SECOND HALF OF CR8   @L5A*/ 49100000
*    3 LCCAP5C9 FIXED(32),               /* CONTROL REGISTER 9   @L5A*/ 49150000
*    3 LCCAP5CA FIXED(32),               /* CONTROL REGISTER 10  @L5A*/ 49200000
*    3 LCCAP5CB FIXED(32),               /* CONTROL REGISTER 11  @L5A*/ 49250000
*    3 LCCAP5CC FIXED(32),               /* CONTROL REGISTER 12  @L5A*/ 49300000
*    3 LCCAP5CD FIXED(32),               /* CONTROL REGISTER 13  @L5A*/ 49350000
*    3 LCCAP5CE FIXED(32),               /* CONTROL REGISTER 14  @L5A*/ 49400000
*    3 LCCAP5CF PTR(31),                 /* LINKAGE STACK ENTRY         49450000
*                                           ADDRESS  (CR15)      @L5A*/ 49500000
*   2 LCCADSA5  PTR(31),                 /* REAL ADDRESS OF THE DATA    49550000
*                                           SPACE ASTE CAUSING THE      49600000
*                                           RECURSIVE FAULT.     @L6C*/ 49650000
*   2 LCCAPPS5 CHAR(8) BDY(DWORD),       /* PROGRAM FLIH RECURSION PSW  49700000
*                                           SA 5                 @L5A*/ 49750000
*   2 LCCAPIC5 CHAR(4),                  /* PROGRAM FLIH RECURSION      49800000
*                                           ILC AND INTERRUPT CODE      49850000
*                                           SAVE AREA 5          @L5A*/ 49900000
*   2 LCCAPTE5 CHAR(4),                  /* PROGRAM FLIH RECURSION      49950000
*                                           TRANSLATION EXCEPTION       50000000
*                                           ADDRESS SAVE AREA 5  @L5A*/ 50050000
*     3 *        CHAR(3),                /* FIRST THREE BYTES OF        50100000
*                                           ADDRESS              @L5A*/ 50150000
*     3 LCCAPSTL BIT(8),                 /* LAST BYTE OF LCCAPTE5       50200000
*                                                                @L5A*/ 50250000
*       5 *        BIT(6),               /*                      @L5A*/ 50300000
*       5 LCCAPST5 BIT(2),               /* STD FIELD - LAST TWO BITS   50350000
*                                           OF LCCAPTE5 ............... 50400000
*                                       ..  '00' - PRIMARY STD USED     50450000
*                                       ..  '01' - STD WAS AR QUALIFIED 50500000
*                                       ..  '10' - SECONDARY STD USED   50550000
*                                       ..  '11' - HOME STD USED.       50600000
*                                                                @L5A*/ 50650000
*   2 LCCATTSC CHAR(8) BDY(WORD),        /* Workunit Time Slice         50700000
*                                           Interval.                   50750000
*                                           Ownership: SRM              50800000
*                                           Serialization: SRM Lock.    50850000
*                                                                @LHC*/ 50900000
*     3 LCCATTS1 BIT(32),                /* High Order 32 bits          50950000
*                                           of LCCATTSC.                51000000
*                                           Ownership: SRM              51050000
*                                           Serialization: SRM Lock.    51100000
*                                                                @LHC*/ 51150000
*     3 LCCATTS2 BIT(32),                /* Low Order 32 bits           51200000
*                                           of LCCATTSC.                51250000
*                                           Ownership: SRM              51300000
*                                           Serialization: SRM Lock.    51350000
*                                                                @LHC*/ 51400000
*   2 LCCAWTSC CHAR(8) BDY(WORD),        /* WAIT TASK TIME SLICE        51450000
*                                           INTERVAL             @D2A*/ 51500000
*     3 LCCAWTS1 BIT(32),                /* HIGH ORDER 32 BITS   @D2A*/ 51550000
*     3 LCCAWTS2 BIT(32),                /* LOW  ORDER 32 BITS   @D2A*/ 51600000
*   2 LCCATP   FIXED(32),                /* Workunit Preemption Count-  51650000
*                                           number of workunit time     51700000
*                                           slice expirations.          51750000
*                                           Ownership: Supervisor       51800000
*                                           Control.                    51850000
*                                           Serialization: Disablement  51900000
*                                           on current processor.       51950000
*                                                                @LHC*/ 52000000
*   2 LCCATPU  FIXED(32),                /* Unproductive Workunit       52050000
*                                           Preemption Count - number   52100000
*                                           of workunit time slice      52150000
*                                           expirations that were not   52200000
*                                           needed.                     52250000
*                                           Ownership: Supervisor       52300000
*                                           Control.                    52350000
*                                           Serialization: Disablement  52400000
*                                           on current processor.       52450000
*                                                                @LHC*/ 52500000
*   2 LCCAWP   FIXED(32),                /* WAIT PREEMPTION COUNT -     52550000
*                                           NUMBER OF WAIT TASK TIME    52600000
*                                           SLICE EXPIRATIONS    @D2A*/ 52650000
*   2 LCCAWPU  FIXED(32),                /* UNPRODUCTIVE WAIT           52700000
*                                           PREEMPTION COUNT -          52750000
*                                           NUMBER OF WAIT TASK TIME    52800000
*                                           SLICE EXPIRATIONS THAT      52850000
*                                           WERE NOT NEEDED      @D2A*/ 52900000
*   2 LCCATPB  FIXED(32),                /* Workunit Preemption Count   52950000
*                                           Base - previous value of    53000000
*                                           LCCATP.                     53050000
*                                           Ownership: SRM              53100000
*                                           Serialization: SRM Lock.    53150000
*                                                                @LHC*/ 53200000
*   2 LCCATPUB FIXED(32),                /* Unproductive Workunit       53250000
*                                           Preemption Count Base -     53300000
*                                           previous value of LCCATPU.  53350000
*                                           Ownership: SRM              53400000
*                                           Serialization: SRM Lock.    53450000
*                                                                @LHC*/ 53500000
*   2 LCCAWPB  FIXED(32),                /* WAIT PREEMPTION COUNT       53550000
*                                           BASE - PREVIOUS VALUE OF    53600000
*                                           LCCAWP               @D2A*/ 53650000
*   2 LCCAWPUB FIXED(32),                /* UNPRODUCTIVE WAIT           53700000
*                                           PREEMPTION COUNT BASE -     53750000
*                                           PREVIOUS VALUE OF           53800000
*                                           LCCAWPU              @D2A*/ 53850000
*   2 LCCAOID  FIXED(15),        /* Active ASID or Enclave ID when the  53900000
*                                   workunit time slice expired. @LHC*/ 53950000
*     3 LCCAENID BIT(1),         /* LCCAOID is an Enclave ID.    @LHA*/ 54000000
*   2 LCCAMTSC FIXED(8),         /* Maximum number of dispatchs per     54050000
*                                   task                         @LFA*/ 54100000
*   2 LCCACTSC FIXED(8),         /* Number of consecutive dispatches    54150000
*                                   remaining for this task      @LEA*/ 54200000
*   2 LCCAPPRI FIXED(32),           /* Priority of the active work unit 54250000
*                                   when Time Slice Expired.            54300000
*                                   SERIALIZATION: Disablement          54350000
*                                   OWNERSHIP: Supervisor Control       54400000
*                                                                @LDC*/ 54450000
*   2 LCCACPTM FIXED(32),                /* THIS CPU'S COUNT DOWN       54500000
*                                           TIMER                       54550000
*                                           OWNERSHIP: SUPERVISOR       54600000
*                                           SERIALIZATION: NONE  @05C*/ 54650000
*   2 LCCACLSD PTR(31),             /* The address of the LSSD for      54700000
*                                      the currently executing SRB      54750000
*                                      routine.  Only valid when an     54800000
*                                      SRB is executing.         @LHA*/ 54850000
*   2 LCCAWUQA(0:17) PTR(31),       /* Array of Work Unit Queues for    54900000
*                                   this processor.                     54950000
*                                   SERIALIZATION: Disablement. Global  55000000
*                                   Intersect is required to change     55050000
*                                   an element in another processor's   55100000
*                                   LCCAWUQA.                           55150000
*                                   OWNERSHIP: Supervisor Control       55200000
*                                                                @LDC*/ 55250000
*   2 LCCAEND CHAR(0);                   /* END OF LCCA.     @G383P9A*/ 55300000
*                                                                       55350000
*  @LISTPOP;                                               /*    @L3A*/ 55400000
