*        %GOTO PLSVER;                                               /* 00050000
         MACRO                                                          00100000
         IHAMBCB                                                        00150000
**/                                                                     00200000
*%PLSVER:;                                                              00250000
*/********************************************************************/ 00300000
*/*                                                          @G38MPXU*/ 00350000
*/*            MAIN SVRB POOL CONTROL BLOCK (MBCB)           @G38MPXU*/ 00400000
*/*                                                          @G38MPXU*/ 00450000
*/*   COPYRIGHT =                                            @G38MPXU*/ 00500000
*/*      5740-XYN COPYRIGHT IBM CORP 1977, 1980,             @G38MPXU*/ 00550000
*/*      LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,         @G38MPXU*/ 00600000
*/*      REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER         @G38MPXU*/ 00650000
*/*      G120-2083.                                          @G38MPXU*/ 00700000
*/*                                                          @G38MPXU*/ 00750000
*/*   STATUS = OS/VS2 JBB1226                                @G38MPXU*/ 00800000
*/*                                                                  */ 00812500
*/* DISTRIBUTION LIBRARY:  AMODGEN                                   */ 00825000
*/*                                                                  */ 00837500
*/*                                                          @G38MPXU*/ 00850000
*/********************************************************************/ 00900000
*        %GOTO PLSVER1;           /*                                    00950000
MBCB     DSECT                 MAIN SVRB POOL CONTROL BLOCK             01000000
MBCBMAIN DS    0D              8 BYTE HEADER                   @G38MPXU 01024900
MBCBID   DS    F               ID IS 'SVRB'                             01050000
MBCBLINK DS    F               LINK TO NEXT POOL ELEMENT                01100000
MBCBSVRB DS    CL(SVRBLEN)     SVRB                                     01150000
MBCBBUFF DS    0D              DBLE WORD ALLIGN                @G50DPXO 01200000
MBCBEND  DS    0D              END OF MBCB                     @G38MPXU 01250000
MBCBLEN  EQU   MBCBEND-MBCB    LENGTH OF MBCB                           01300000
MBCBPXLN EQU   MBCBSVRB-MBCB   LENGTH OF PREFIX                         01350000
         MEND                                                        */ 01400000
*%PLSVER1:;                                                             01450000
*DECLARE 1 MBCB BASED BDY(DWORD), /* MAIN SVRB POOL CONTROL BLOCK.      01500000
*                                                            @G38MPXU*/ 01550000
*          3 MBCBMAIN,            /* 8 BYTE HEADER                   */ 01600000
*            5 MBCBID CHAR(4),    /* ID IS 'SVRB'                    */ 01650000
*            5 MBCBLINK PTR(31),  /* LINK TO NEXT POOL ELEMENT       */ 01700000
*          3 MBCBSVRB CHAR(SVRBLGN),   /* SVRB                       */ 01750000
*          3 MBCBBUFF CHAR(0),    /* BUFFER BETWEEN SVRBS.   @G38MPXU*/ 01800000
*          3 MBCBEND  CHAR(0) BDY(DWORD);/* END OF MBCB.     @G38MPXU*/ 01850000
