*                                                                       00050001
*        %GOTO OREL1;       /*                                          00060001
         MACRO                                                          00100001
         IHAORE &DSECT=YES    */                                        00150001
*%OREL1 : ;                                                             00160001
*                                                                       00200001
*/* **START OF SPECIFICATIONS*************************************** */ 00600000
*/*                                                                  */ 00750001
*/* MACRO NAME: IHAORE                                           @L1A*/ 00800000
*/*                                                                  */ 00850001
*/* DESCRIPTIVE NAME:  OPERATOR REPLY ELEMENT DEFINITION         @L1A*/ 00950900
*/*                                                                  */ 00951100
*/* EXTERNAL CLASSIFICATION:  PSPI                               @P3A*/ 00951300
*/* END OF EXTERNAL CLASSIFICATION:                              @P3A*/ 00951500
*/*                                                                  */ 00951800
*/* ACRONYM: ORE                                                 @P2A*/ 00952100
*/*                                                                  */ 00952400
*/* DSECT NAME: OREF                                             @P2A*/ 00952700
*/*                                                                  */ 00953000
*/*01* PROPRIETARY STATEMENT=                                        */ 00954400
*/***PROPRIETARY_STATEMENT********************************************/ 00955800
*/*                                                                  */ 00957200
*/*                                                                  */ 00958200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00958300
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00958400
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1981, 2000                      */ 00958500
*/*                                                                  */ 00958600
*/* STATUS= HBB7703                                                  */ 00958700
*/*                                                                  */ 00958800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00958900
*/* COMPONENT: COMMUNICATIONS TASK (SC1CK)                       @P2A*/ 00959000
*/*                                                                  */ 00959600
*/* EYE-CATCHER: NONE                                                */ 00960300
*/*                                                                  */ 00961000
*/* STORAGE ATTRIBUTES:                                              */ 00961700
*/*     SUBPOOL: 231                                                 */ 00962400
*/*     KEY: 0                                                       */ 00963100
*/*     RESIDENCY: ABOVE 16 MB IN REAL STORAGE                   @P2A*/ 00963800
*/*                                                                  */ 00964500
*/* SIZE: 96 BYTES                                               @P2A*/ 00965200
*/*                                                                  */ 00965900
*/* FUNCTION:   THIS MACRO MAPS THE OPERATOR REPLY ELEMENT       @L2A*/ 00966600
*/*                                                              @L2A*/ 00967300
*/*  METHOD OF ACCESS:                                               */ 00968000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 00970001
*/*             USING ON OREF GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 00980001
*/*      PL/S - DCL OREPTR PTR                                       */ 00990001
*/*                                                                  */ 00991200
*/* CREATED-BY:  IEAVVWTO                                        @L2A*/ 00991300
*/*                                                              @L2A*/ 00991400
*/* POINTED-TO-BY:  UCMRPYQ FIELD OF THE UCM DATA AREA           @L2A*/ 00991500
*/*                 ORELKP FIELD OF THE ORE DATA AREA (NEXT ORE) @L2A*/ 00991600
*/*                 SSWTORE FIELD OF THE SSOB DATA AREA          @L2A*/ 00991700
*/*                                                              @L2A*/ 00991800
*/* DELETED BY: IEAVMDOM or IEAVVWTO                             @01C*/ 00991900
*/*                                                                  */ 00992000
*/* FREQUENCY: ONE PER WTOR                                      @P2A*/ 00992100
*/*                                                                  */ 00992200
*/* SERIALIZATION:  CMS AND LOCAL LOCKS                          @L2A*/ 00992300
*/*                                                              @L2A*/ 00992400
*/* DISTRIBUTION LIBRARY: AMODGEN                                @P2A*/ 00992500
*/*                                                              @L2A*/ 00992600
*/* CHANGE ACTIVITY =                                            @L1A*/ 00992700
*/*                                                                  */ 00993600
*/* $L1=XMCTASK,  JBB1326,  801031,  PD2I:  ADD R AND D CODES        */ 00995000
*/* $L2=COEXDIDO, JBB2220,  840229,  PDE8:  JES3/MCS COEXISTENCE     */ 00996200
*/* $P1=PA20316,  JBB2220,  850814,  PDFB:  JES3/MCS COEXISTENCE     */ 00996800
*/*                YA10057                                           */ 00997100
*/*                YA11509 - NO CODE CHANGES.                        */ 00997300
*/* $L3=SP3133CS, JBB3313,  880729,  PDCS:  B1 SECURITY SUPPORT      */ 00997900
*/* $L4=CNMG2WTO, HBB4410,  870419,  PDR3:  CONSOLE MERGE STAGE II   */ 00998300
*/* $D1=DEO0253,  HBB4410,  891127,  PDBD:  Sysplex Reply            */ 00998700
*/* $P2=PKB3040,  HBB4430,  920618,  PDCM:  Version ID               */ 00998900
*/* $01=OW02271,  HBB4430,  940627,  PDIU:  Add bits to determine    */ 00999100
*/*                                         who frees the ORE        */ 00999300
*/* $P3=PN71689,  HBB5520,  940930,  PDZH:  Update to make SHOWHDR   */ 00999500
*/*                                         compatible               */ 00999700
*/* $02=OW32799,  HBB5510,  981031,  PDHD:  Add OREDOMD              */ 00999800
*/* $03=OW37797,  HBB5510,  990331,  PDCM:  Phantom messages         */ 01000100
*/* $P4=PXD0136,  HBB7703,  990630,  PDHD:  B23 avoidance            */ 01000200
*/*                                                                  */ 01000400
*/* ***END OF SPECIFICATIONS**************************************** */ 01000700
*/* (D) DELETE OLD ROUTING CODES AND CHANGE TO RESERVED SPACE    @L2A*/ 01001100
*/* (A) ADD 128 ROUTING CODES TO END OF ORE                      @L2A*/ 01002200
*/* (C) ROUTING CODE 16 FROM RESERVED TO INSTALLATION USE        @L2A*/ 01004400
*/* (A) ADD SYSID TO FIRST BYTE OF OREDOMID                      @P1A*/ 01005500
*/* (A) OREWTORU - USERID OF WTOR ISSUER                         @L3A*/ 01005600
*/* (A) ADD REPLY CONSOLE NAME/ID                                @L4A*/ 01005700
*/* (C) DEFINE ROUTING CODE 41                               @YA10057*/ 01006000
*/* NO CODE CHANGE. RESHIP FOR PTF PACKAGING PROBLEM.        @YA11509*/ 01006300
*/* (A) Defined ORERPIDB field - binary reply id value field     @D1A*/ 01006500
*/* (C) Correct PL/AS version ID's                               @P2A*/ 01007600
*/* (A) Defined OREDMCMP and OREINUSE to serialize the ORE       @01A*/ 01007900
*/*     between Ieavmdom and Ieavvwto                            @01A*/ 01008200
*/* (A) Update to make SHOWHDR compatible                        @P3A*/ 01008400
*/* (A) OREDOMD bit added                                        @02A*/ 01008500
*/* (-) If OW32799 is only applied to a subset of systems in a   @03A*/ 01008700
*/*     sysplex, and other systems have a service level below    @03A*/ 01008900
*/*     OW29432, phantom non-deletable WTORs can appear.         @03A*/ 01009100
*/*     No code change. Repackage of OW32799 with action hold.   @03A*/ 01009300
*/* (A) ORESAVD bit added                                        @P4A*/ 01009400
*/* **************************************************************** */ 01009500
*%GOTO OREL2;  /*                                                       01010001
         SPACE                                                          01050001
         IEZBITS  , -         SYMBOLIC BIT DEFINITIONS                  01099601
         AIF   ('&DSECT' EQ 'NO').NODSCT                                01112201
OREF     DSECT                                                          01122201
         AGO   .CONT                                                    01124201
.NODSCT  ANOP                                                           01124601
         DS    0D                                                       01124701
OREF     EQU   *                                                        01128901
.CONT    ANOP                                                           01130901
         SPACE                                                          01133201
ORELKP   DS    A -            LINKAGE POINTER                           01137401
OREID    DS    CL2 -          REPLY IDENTIFICATION, X'0000' when       X01158200
                              reply id > 99                        @D1C 01179000
         SPACE                                                          01200001
OREXA    DS    B -            FLAGS                                     01250001
OREFORGN EQU   BIT0 -         WTOR WAS NOT ISSUED ON THIS SYSTEM   @L2C 01260000
OREKEY0  EQU   BIT1 -         WTOR ISSUED BY KEY 0 USER                 01300001
*                             (BYPASS VALIDITY CHECK)                   01350001
ORESWAP  EQU   BIT2 -         TASK SWAPPED OUT                          01400001
ORESUSP  EQU   BIT3 -         PROCESSING TEMPORARILY SUSPENDED          01410002
*                             (OS/VS2)                           MDC001 01412002
OREINUSE EQU   BIT4 -         WTOR NOT COMPLETE                    @01C 01421300
OREDMCMP EQU   BIT5 -         DOM HAS COMPLETED                    @01C 01430600
OREDOMD  EQU   BIT6 -         HAVE PROCESSED A DOMC FOR THIS WTOR  @02C 01436300
ORERSV06 EQU   BIT7,,C'X' -   RESERVED                                  01442001
         SPACE                                                          01450001
OREXC    DS    B -            BUFFER STATUS FLAGS                       01500001
OREBUFA  EQU   BIT0 -         BUFFER IS AVAILABLE                       01550001
OREBUFB  EQU   BIT1 -         BUFFER IN USE                             01600001
OREBUFC  EQU   BIT2 -         ORE IS TO BE DELETED, DO NOT PROCESS      01610002
*                             REPLY (OS/VS2)                     MDC002 01620002
OREBUFD  EQU   BIT3 -         BUFFER OBTAINED DYNAMICALLY               01650001
OREBUFE  EQU   BIT4 -         BUFFER SERVICED                           01700001
ORESAVD  EQU   BIT5 -         ORE/WQE SAVED IN RECOVERY, NO B23    @P4C 01710000
ORERSV09 EQU   BIT6,,C'X' -   RESERVED                                  01720001
ORERSV10 EQU   BIT7,,C'X' -   RESERVED                                  01730001
         SPACE                                                          01750001
ORETCB   DS    0A -           POINTER TO TCB                            01800001
ORETCBA  DS    A              ADDRESS OF TCB                       @L1C 01850000
OREWQE   DS    A -            ADDRESS OF ASSOCIATED DUMMY WQE          X01933300
                              (USED BY THE SUBSYSTEM)              @L1C 01966600
ORERPY   DS    0A -           POINTER TO REPLY BUFFER                   02000001
ORERPYA  DS    A              ADDRESS OF REPLY BUFFER              @L1C 02050000
OREECB   DS    0A -           POINTER TO REQUESTOR'S REPLY ECB          02150001
OREECBA  DS    A              ADDRESS OF REQUESTOR'S REPLY ECB     @L1C 02200000
OREASID  DS    H -            ADDRESS SPACE IDENTIFIER (OS/VS2)  MDC003 02260002
ORERSV11 DS    H -            RESERVED (OS/VS2)                  MDC004 02270002
OREOPBUF DS    A -            POINTER TO OPERATOR REPLY BUFFER          02280002
*                             (OS/VS2)                           MDC005 02290002
ORECBID  DS    CL4            CONTROL BLOCK ID 'ORE '              @L1A 02290300
OREVRSN  DS    FL1            VERSION LEVEL                        @L1A 02290600
ORESP13  EQU   1              ORE IS AT JBB1326 LEVEL              @L1A 02290900
ORESP22  EQU   2              ORE IS AT JBB2220 LEVEL              @L4C 02291800
ORESP313 EQU   3              ORE IS AT JBB3313 LEVEL              @L4A 02292400
ORESP410 EQU   4              ORE IS AT HBB4410 LEVEL              @D1C 02293000
OREVRID  EQU   ORESP410       VERSION LEVEL VALUE                  @D1C 02293600
ORERSV07 DS    CL2            RESERVED -  WAS 16 ROUTING CODES     @L2C 02294500
ORERCID  DS    FL1            REPLY ISSUER CONSOLE ID              @L1A 02297800
ORERWQE  DS    A              ADDRESS OF ASSOCIATED REAL WQE       @L1A 02298500
OREDOMID DS    0F             DOM ID                               @P1C 02298700
ORESYSID DS    FL1            SYSTEM ID                            @P1C 02298900
ORESEQN  DS    FL3            24-BIT OREDOMID                      @P1C 02299100
ORELNTH  DS    FL1 -          MAXIMUM LENGTH OF REPLY              @L1C 02299400
ORERSV12 DS    CL3            RESERVED BYTES                       @L2C 02299700
ORERTCDE DS    0CL16          16 BYTES OF ROUTING CODES            @L2A 02300000
ORERTA   DS    BL1            FIRST BYTE OF ROUTING CODES          @L2A 02300300
ORERT001 EQU   X'80'          MASTER CONSOLE ACTION                @L2A 02300600
ORERT002 EQU   X'40'          MASTER CONSOLE INFORMATION           @L2A 02300900
ORERT003 EQU   X'20'          TAPE POOL                            @L2A 02301200
ORERT004 EQU   X'10'          DIRECT ACCESS POOL                   @L2A 02301500
ORERT005 EQU   X'08'          TAPE LIBRARY                         @L2A 02301800
ORERT006 EQU   X'04'          DISK LIBRARY                         @L2A 02302100
ORERT007 EQU   X'02'          UNIT RECORD POOL                     @L2A 02302400
ORERT008 EQU   X'01'          TELEPROCESSING CONTROL               @L2A 02302700
ORERTB   DS    BL1            SECOND BYTE OF ROUTING CODES         @L2A 02303000
ORERT009 EQU   X'80'          SYSTEM SECURITY                      @L2A 02303300
ORERT010 EQU   X'40'          SYSTEM/ERROR MAINTENANCE             @L2A 02303600
ORERT011 EQU   X'20'          PROGRAMMER INFORMATION               @L2A 02303900
ORERT012 EQU   X'10'          EMULATOR INFORMATION                 @L2A 02304200
ORERT013 EQU   X'08'          USER ROUTING CODE                    @L2A 02304500
ORERT014 EQU   X'04'          USER ROUTING CODE                    @L2A 02304800
ORERT015 EQU   X'02'          USER ROUTING CODE                    @L2A 02305100
ORERT016 EQU   X'01'          USER ROUTING CODE                    @L2A 02305400
ORERTC   DS    BL1            THIRD BYTE OF ROUTING  CODES         @L2A 02305700
ORERT017 EQU   X'80'          USER ROUTING CODE                    @L2A 02306000
ORERT018 EQU   X'40'          USER ROUTING CODE                    @L2A 02306300
ORERT019 EQU   X'20'          USER ROUTING CODE                    @L2A 02306600
ORERT020 EQU   X'10'          USER ROUTING CODE                    @L2A 02306900
ORERT021 EQU   X'08'          RESERVED FOR JES USAGE               @L2A 02307200
ORERT022 EQU   X'04'          RESERVED FOR JES USAGE               @L2A 02307500
ORERT023 EQU   X'02'          RESERVED FOR JES USAGE               @L2A 02307800
ORERT024 EQU   X'01'          RESERVED FOR JES USAGE               @L2A 02308100
ORERTD   DS    BL1            FOURTH BYTE OF ROUTING CODES         @L2A 02308400
ORERT025 EQU   X'80'          RESERVED FOR JES USAGE               @L2A 02308700
ORERT026 EQU   X'40'          RESERVED FOR JES USAGE               @L2A 02309000
ORERT027 EQU   X'20'          RESERVED FOR JES USAGE               @L2A 02309300
ORERT028 EQU   X'10'          RESERVED FOR JES USAGE               @L2A 02309600
ORERT029 EQU   X'08'          RESERVED                             @L2A 02309900
ORERT030 EQU   X'04'          RESERVED                             @L2A 02310200
ORERT031 EQU   X'02'          RESERVED                             @L2A 02310500
ORERT032 EQU   X'01'          RESERVED                             @L2A 02310800
ORERTE   DS    BL1            FIFTH BYTE OF ROUTING CODES          @L2A 02311100
ORERT033 EQU   X'80'          RESERVED                             @L2A 02311400
ORERT034 EQU   X'40'          RESERVED                             @L2A 02311700
ORERT035 EQU   X'20'          RESERVED                             @L2A 02312000
ORERT036 EQU   X'10'          RESERVED                             @L2A 02312300
ORERT037 EQU   X'08'          RESERVED                             @L2A 02312600
ORERT038 EQU   X'04'          RESERVED                             @L2A 02312900
ORERT039 EQU   X'02'          RESERVED                             @L2A 02313200
ORERT040 EQU   X'01'          RESERVED                             @L2A 02313500
ORERTF   DS    BL1            SIXTH BYTE OF ROUTING CODES          @L2A 02313800
ORERT041 EQU   X'80'          JOB STATUS MESSAGE               @YA10057 02314100
ORERT042 EQU   X'40'          GENERAL INFO. ABOUT JES2 OR JES3     @L2A 02314400
ORERT043 EQU   X'20'          RESERVED FOR JES USAGE               @L2A 02314700
ORERT044 EQU   X'10'          RESERVED FOR JES USAGE               @L2A 02315000
ORERT045 EQU   X'08'          RESERVED FOR JES USAGE               @L2A 02315300
ORERT046 EQU   X'04'          RESERVED FOR JES USAGE               @L2A 02315600
ORERT047 EQU   X'02'          RESERVED FOR JES USAGE               @L2A 02315900
ORERT048 EQU   X'01'          RESERVED FOR JES USAGE               @L2A 02316200
ORERTG   DS    BL1            SEVENTH BYTE OF ROUTING CODES        @L2A 02316500
ORERT049 EQU   X'80'          RESERVED FOR JES USAGE               @L2A 02316800
ORERT050 EQU   X'40'          RESERVED FOR JES USAGE               @L2A 02317100
ORERT051 EQU   X'20'          RESERVED FOR JES USAGE               @L2A 02317400
ORERT052 EQU   X'10'          RESERVED FOR JES USAGE               @L2A 02317700
ORERT053 EQU   X'08'          RESERVED FOR JES USAGE               @L2A 02318000
ORERT054 EQU   X'04'          RESERVED FOR JES USAGE               @L2A 02318300
ORERT055 EQU   X'02'          RESERVED FOR JES USAGE               @L2A 02318600
ORERT056 EQU   X'01'          RESERVED FOR JES USAGE               @L2A 02318900
ORERTH   DS    BL1            EIGHTH BYTE OF ROUTING CODES         @L2A 02319200
ORERT057 EQU   X'80'          RESERVED FOR JES USAGE               @L2A 02319500
ORERT058 EQU   X'40'          RESERVED FOR JES USAGE               @L2A 02319800
ORERT059 EQU   X'20'          RESERVED FOR JES USAGE               @L2A 02320100
ORERT060 EQU   X'10'          RESERVED FOR JES USAGE               @L2A 02320400
ORERT061 EQU   X'08'          RESERVED FOR JES USAGE               @L2A 02320700
ORERT062 EQU   X'04'          RESERVED FOR JES USAGE               @L2A 02321000
ORERT063 EQU   X'02'          RESERVED FOR JES USAGE               @L2A 02321300
ORERT064 EQU   X'01'          RESERVED FOR JES USAGE               @L2A 02321600
ORERTI   DS    BL1            NINTH BYTE OF ROUTING CODES          @L2A 02321900
ORERT065 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L2A 02322200
ORERT066 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L2A 02322500
ORERT067 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L2A 02322800
ORERT068 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L2A 02323100
ORERT069 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L2A 02323400
ORERT070 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L2A 02323700
ORERT071 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L2A 02324000
ORERT072 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L2A 02324300
ORERTJ   DS    BL1            TENTH BYTE OF ROUTING CODES          @L2A 02324600
ORERT073 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L2A 02324900
ORERT074 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L2A 02325200
ORERT075 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L2A 02325500
ORERT076 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L2A 02325800
ORERT077 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L2A 02326100
ORERT078 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L2A 02326400
ORERT079 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L2A 02326700
ORERT080 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L2A 02327000
ORERTK   DS    BL1            ELEVENTH BYTE OF ROUTING CODES       @L2A 02327300
ORERT081 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L2A 02327600
ORERT082 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L2A 02327900
ORERT083 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L2A 02328200
ORERT084 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L2A 02328500
ORERT085 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L2A 02328800
ORERT086 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L2A 02329100
ORERT087 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L2A 02329400
ORERT088 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L2A 02329700
ORERTL   DS    BL1            TWELFTH BYTE OF ROUTING CODES        @L2A 02330000
ORERT089 EQU   X'80'          PROCESSOR RELATED MESSAGE            @L2A 02330300
ORERT090 EQU   X'40'          PROCESSOR RELATED MESSAGE            @L2A 02330600
ORERT091 EQU   X'20'          PROCESSOR RELATED MESSAGE            @L2A 02330900
ORERT092 EQU   X'10'          PROCESSOR RELATED MESSAGE            @L2A 02331200
ORERT093 EQU   X'08'          PROCESSOR RELATED MESSAGE            @L2A 02331500
ORERT094 EQU   X'04'          PROCESSOR RELATED MESSAGE            @L2A 02331800
ORERT095 EQU   X'02'          PROCESSOR RELATED MESSAGE            @L2A 02332100
ORERT096 EQU   X'01'          PROCESSOR RELATED MESSAGE            @L2A 02332400
ORERTM   DS    BL1            THIRTEENTH BYTE OF ROUTING CODES     @L2A 02332700
ORERT097 EQU   X'80'          DEVICE RELATED MESSAGE               @L2A 02333000
ORERT098 EQU   X'40'          DEVICE RELATED MESSAGE               @L2A 02333300
ORERT099 EQU   X'20'          DEVICE RELATED MESSAGE               @L2A 02333600
ORERT100 EQU   X'10'          DEVICE RELATED MESSAGE               @L2A 02333900
ORERT101 EQU   X'08'          DEVICE RELATED MESSAGE               @L2A 02334200
ORERT102 EQU   X'04'          DEVICE RELATED MESSAGE               @L2A 02334500
ORERT103 EQU   X'02'          DEVICE RELATED MESSAGE               @L2A 02334800
ORERT104 EQU   X'01'          DEVICE RELATED MESSAGE               @L2A 02335100
ORERTN   DS    BL1            FOURTEENTH BYTE OF ROUTING CODES     @L2A 02335400
ORERT105 EQU   X'80'          DEVICE RELATED MESSAGE               @L2A 02335700
ORERT106 EQU   X'40'          DEVICE RELATED MESSAGE               @L2A 02336000
ORERT107 EQU   X'20'          DEVICE RELATED MESSAGE               @L2A 02336300
ORERT108 EQU   X'10'          DEVICE RELATED MESSAGE               @L2A 02336600
ORERT109 EQU   X'08'          DEVICE RELATED MESSAGE               @L2A 02336900
ORERT110 EQU   X'04'          DEVICE RELATED MESSAGE               @L2A 02337200
ORERT111 EQU   X'02'          DEVICE RELATED MESSAGE               @L2A 02337500
ORERT112 EQU   X'01'          DEVICE RELATED MESSAGE               @L2A 02337800
ORERTO   DS    BL1            FIFTEENTH BYTE OF ROUTING CODES      @L2A 02338100
ORERT113 EQU   X'80'          DEVICE RELATED MESSAGE               @L2A 02338400
ORERT114 EQU   X'40'          DEVICE RELATED MESSAGE               @L2A 02338700
ORERT115 EQU   X'20'          DEVICE RELATED MESSAGE               @L2A 02339000
ORERT116 EQU   X'10'          DEVICE RELATED MESSAGE               @L2A 02339300
ORERT117 EQU   X'08'          DEVICE RELATED MESSAGE               @L2A 02339600
ORERT118 EQU   X'04'          DEVICE RELATED MESSAGE               @L2A 02339900
ORERT119 EQU   X'02'          DEVICE RELATED MESSAGE               @L2A 02340200
ORERT120 EQU   X'01'          DEVICE RELATED MESSAGE               @L2A 02340500
ORERTP   DS    BL1            SIXTEENTH BYTE OF ROUTING CODES      @L2A 02340800
ORERT121 EQU   X'80'          DEVICE RELATED MESSAGE               @L2A 02341100
ORERT122 EQU   X'40'          DEVICE RELATED MESSAGE               @L2A 02341400
ORERT123 EQU   X'20'          DEVICE RELATED MESSAGE               @L2A 02341700
ORERT124 EQU   X'10'          DEVICE RELATED MESSAGE               @L2A 02342000
ORERT125 EQU   X'08'          DEVICE RELATED MESSAGE               @L2A 02342300
ORERT126 EQU   X'04'          DEVICE RELATED MESSAGE               @L2A 02342600
ORERT127 EQU   X'02'          DEVICE RELATED MESSAGE               @L2A 02342900
ORERT128 EQU   X'01'          DEVICE RELATED MESSAGE               @L2A 02343200
OREWTORU DS    CL8            USERID OF WTOR ISSUER                @L3A 02343600
ORECNRA  DS    A              ADDRESS OF 12 BYTE FIELD FOR REPLYING    X02344000
                              CONSOLE'S NAME/ID                    @L4A 02344800
ORECNDAT DS    0CL12          REPLYING CONSOLE NAME AND ID         @L4A 02345600
ORECNNME DS    CL8            REPLY CONSOLE NAME                   @L4A 02346400
ORECNID  DS    CL4            REPLY CONSOLE ID                     @L4A 02347200
ORERPIDB DS    F              Reply ID (binary representation)     @D1A 02347600
OREL     EQU   * -            END OF OPERATOR REPLY ELEMENT (OS/VS2)    02348000
*                                                                MDC006 02348800
ORESIZE  EQU   OREL-OREF -    LENGTH OF OPERATOR REPLY ELEMENT (OS/VS2) 02350002
*                                                                MDC007 02360002
         MEND  ,  */                                                    02400001
*%OREL2 : ;                                                             02450001
*                                                                       02460001
*DECLARE                                                                02500001
*  1 OREF BASED(OREPTR) BDY(WORD),       /* START OF ORE             */ 02550002
*   2 ORELKP      PTR(31),               /* LINKAGE POINTER          */ 02600001
*   2 OREID       CHAR(2),               /* REPLY IDENTIFICATION        02625000
*                                           X'0000' when reply id >     02650000
*                                           99                   @D1C*/ 02675000
*   2 OREXA       CHAR(1),               /* FLAGS                    */ 02700001
*    3 OREFORGN    BIT(1),               /* WTOR WAS NOT ISSUED ON      02733300
*                                           THIS SYSTEM          @L2A*/ 02766600
*    3 OREKEY0     BIT(1),               /* WTOR ISSUED BY KEY 0        02800001
*                                           USER (BYPASS VALIDITY       02850001
*                                           CHECK)                   */ 02900001
*    3 ORESWAP     BIT(1),               /* TASK SWAPPED OUT         */ 02950001
*    3 ORESUSP     BIT(1),               /* PROCESSING TEMPORARILY      03000002
*                                           SUSPENDED (OS/VS2) MDC001*/ 03002002
*    3 OREINUSE    BIT(1),               /* WTOR NOT COMPLETED   @01C*/ 03011300
*    3 OREDMCMP    BIT(1),               /* DOM HAS COMPLETED    @01C*/ 03020600
*    3 OREDOMD     BIT(1),               /* HAVE PROCESSED A DOMC FOR   03027000
*                                           THIS WTOR            @02C*/ 03033400
*    3 ORERSV06    BIT(1),               /* RESERVED                 */ 03040001
*   2 OREXC       CHAR(1),               /* BUFFER STATUS FLAGS      */ 03050001
*    3 OREBUFA     BIT(1),               /* BUFFER IS AVAILABLE      */ 03100001
*    3 OREBUFB     BIT(1),               /* BUFFER IN USE            */ 03150001
*    3 OREBUFC     BIT(1),               /* ORE IS TO BE DELETED,       03200002
*                                           DO NOT PROCESS REPLY        03210002
*                                           (OS/VS2)           MDC002*/ 03220002
*    3 OREBUFD     BIT(1),               /* BUFFER OBTAINED             03250001
*                                           DYNAMICALLY              */ 03300001
*    3 OREBUFE     BIT(1),               /* BUFFER SERVICED          */ 03350001
*    3 ORESAVD     BIT(1),               /* ORE/WQE SAVED               03370000
*                                           IN RECOVERY, NO B23  @P4C*/ 03390000
*    3 ORERSV09    BIT(1),               /* RESERVED                 */ 03410001
*    3 ORERSV10    BIT(1),               /* RESERVED                 */ 03420001
*   2 ORETCB      PTR(31),               /* POINTER TO TCB           */ 03450001
*    3 ORETCBA     PTR(31),              /* ADDRESS OF TCB       @L1C*/ 03500000
*   2 OREWQE      PTR(31),               /* ADDRESS OF ASSOCIATED       03600001
*                                           DUMMY WQE - (USED BY THE    03633300
*                                           SUBSYSTEM)           @L1C*/ 03666600
*   2 ORERPY      PTR(31),               /* POINTER TO REPLY BUFFER  */ 03700001
*    3 ORERPYA     PTR(31),              /* ADDRESS OF REPLY BUFFER     03800000
*                                                                 @L1C*/03850000
*   2 OREECB      PTR(31),               /* POINTER TO REQUESTOR'S      03900001
*                                           REPLY ECB                */ 03950001
*    3 OREECBA     PTR(31),              /* ADDRESS OF REQUESTOR'S      04000000
*                                           REPLY ECB            @L1C*/ 04050000
*   2 OREASID     FIXED(15),             /* ADDRESS SPACE IDENTIFIER    04110002
*                                           (OS/VS2)           MDC003*/ 04120002
*   2 ORERSV11    FIXED(15),             /* RESERVED (OS/VS2)  MDC004*/ 04130002
*   2 OREOPBUF    PTR(31),               /* POINTER TO OPERATOR REPLY   04140000
*                                           BUFFER (OS/VS2)    MDC005*/ 04142002
*   2 ORECBID     CHAR(4),               /* CONTROL BLOCK ID 'ORE '     04142100
*                                                                @L1A*/ 04142200
*   2 OREVRSN     BIT(8),                /* VERSION LEVEL        @L1A*/ 04142300
*   2 ORERSV07    CHAR(2),               /* RESERVED - WAS 16 ROUTING   04143500
*                                           CODES                @L2C*/ 04144700
*   2 ORERCID     FIXED(8),              /* REPLY ISSUER CONSOLE ID     04146100
*                                                                @L1A*/ 04146200
*   2 ORERWQE     PTR(31),               /* ADDRESS OF ASSOCIATED REAL  04146300
*                                           WQE                  @L1A*/ 04146400
*   2 OREDOMID    FIXED(31),             /* DOM ID               @L1A*/ 04146700
*     3 ORESYSID  FIXED(8),              /* SYSTEM ID            @P1A*/ 04146800
*     3 ORESEQN   FIXED(24),             /* 24-BIT OREDOMID      @P1A*/ 04146900
*   2 ORELNTH     PTR(8),                /* MAXIMUM LENGTH OF REPLY     04147000
*                                                                @L1C*/ 04147300
*   2 ORERSV12    CHAR(3),               /* RESERVED BYTES       @L2C*/ 04197300
*   2 ORERTCDE    CHAR(16),              /* 16 BYTES OF ROUTING CODES   04247300
*                                                                @L2A*/ 04297300
*     3 ORERTA    CHAR(1),               /* FIRST BYTE OF ROUTING CODES 04347300
*                                                                @L2A*/ 04397300
*       4 ORERT001  BIT(1),              /* MASTER CONSOLE ACTION       04447300
*                                                                @L2A*/ 04497300
*       4 ORERT002  BIT(1),              /* MASTER CONSOLE              04547300
*                                           INFORMATION          @L2A*/ 04597300
*       4 ORERT003  BIT(1),              /* TAPE POOL                   04647300
*                                                                @L2A*/ 04697300
*       4 ORERT004  BIT(1),              /* DIRECT ACCESS POOL          04747300
*                                                                @L2A*/ 04797300
*       4 ORERT005  BIT(1),              /* TAPE LIBRARY                04847300
*                                                                @L2A*/ 04897300
*       4 ORERT006  BIT(1),              /* DISK LIBRARY                04947300
*                                                                @L2A*/ 04997300
*       4 ORERT007  BIT(1),              /* UNIT RECORD POOL            05047300
*                                                                @L2A*/ 05097300
*       4 ORERT008  BIT(1),              /* TELEPROCESSING CONTROL      05147300
*                                                                @L2A*/ 05197300
*     3 ORERTB     BIT(8),               /* SECOND BYTE OF ROUTING      05247300
*                                           CODES                @L2A*/ 05297300
*       4 ORERT009  BIT(1),              /* SYSTEM SECURITY             05347300
*                                                                @L2A*/ 05397300
*       4 ORERT010  BIT(1),              /* SYSTEM/ERROR MAINTENANCE    05447300
*                                                                @L2A*/ 05497300
*       4 ORERT011  BIT(1),              /* PROGRAMMER INFORMATION      05547300
*                                                                @L2A*/ 05597300
*       4 ORERT012  BIT(1),              /* EMULATOR INFORMATION        05647300
*                                                                @L2A*/ 05697300
*       4 ORERT013  BIT(1),              /* USER ROUTING CODE           05747300
*                                                                @L2A*/ 05797300
*       4 ORERT014  BIT(1),              /* USER ROUTING CODE           05847300
*                                                                @L2A*/ 05897300
*       4 ORERT015  BIT(1),              /* USER ROUTING CODE           05947300
*                                                                @L2A*/ 05997300
*       4 ORERT016  BIT(1),              /* USER ROUTING CODE           06047300
*                                                                @L2A*/ 06097300
*     3 ORERTC     BIT(8),               /* THIRD BYTE OF ROUTING       06147300
*                                           CODES                @L2A*/ 06197300
*       4 ORERT017  BIT(1),              /* USER ROUTING CODE           06247300
*                                                                @L2A*/ 06297300
*       4 ORERT018  BIT(1),              /* USER ROUTING CODE           06347300
*                                                                @L2A*/ 06397300
*       4 ORERT019  BIT(1),              /* USER ROUTING CODE           06447300
*                                                                @L2A*/ 06497300
*       4 ORERT020  BIT(1),              /* USER ROUTING CODE           06547300
*                                                                @L2A*/ 06597300
*       4 ORERT021  BIT(1),              /* RESERVED FOR JES USAGE      06647300
*                                                                @L2A*/ 06697300
*       4 ORERT022  BIT(1),              /* RESERVED FOR JES USAGE      06747300
*                                                                @L2A*/ 06797300
*       4 ORERT023  BIT(1),              /* RESERVED FOR JES USAGE      06847300
*                                                                @L2A*/ 06897300
*       4 ORERT024  BIT(1),              /* RESERVED FOR JES USAGE      06947300
*                                                                @L2A*/ 06997300
*     3 ORERTD     BIT(8),               /* FOURTH BYTE OF ROUTING      07047300
*                                           CODES                @L2A*/ 07097300
*       4 ORERT025  BIT(1),              /* RESERVED FOR JES USAGE      07147300
*                                                                @L2A*/ 07197300
*       4 ORERT026  BIT(1),              /* RESERVED FOR JES USAGE      07247300
*                                                                @L2A*/ 07297300
*       4 ORERT027  BIT(1),              /* RESERVED FOR JES USAGE      07347300
*                                                                @L2A*/ 07397300
*       4 ORERT028  BIT(1),              /* RESERVED FOR JES USAGE      07447300
*                                                                @L2A*/ 07497300
*       4 ORERT029  BIT(1),              /* RESERVED                    07547300
*                                                                @L2A*/ 07597300
*       4 ORERT030  BIT(1),              /* RESERVED                    07647300
*                                                                @L2A*/ 07697300
*       4 ORERT031  BIT(1),              /* RESERVED                    07747300
*                                                                @L2A*/ 07797300
*       4 ORERT032  BIT(1),              /* RESERVED                    07847300
*                                                                @L2A*/ 07897300
*     3 ORERTE     BIT(8),               /* FIFTH BYTE OF ROUTING       07947300
*                                           CODES                @L2A*/ 07997300
*       4 ORERT033  BIT(1),              /* RESERVED                    08047300
*                                                                @L2A*/ 08097300
*       4 ORERT034  BIT(1),              /* RESERVED                    08147300
*                                                                @L2A*/ 08197300
*       4 ORERT035  BIT(1),              /* RESERVED                    08247300
*                                                                @L2A*/ 08297300
*       4 ORERT036  BIT(1),              /* RESERVED                    08347300
*                                                                @L2A*/ 08397300
*       4 ORERT037  BIT(1),              /* RESERVED                    08447300
*                                                                @L2A*/ 08497300
*       4 ORERT038  BIT(1),              /* RESERVED                    08547300
*                                                                @L2A*/ 08597300
*       4 ORERT039  BIT(1),              /* RESERVED                    08647300
*                                                                @L2A*/ 08697300
*       4 ORERT040  BIT(1),              /* RESERVED                    08747300
*                                                                @L2A*/ 08797300
*     3 ORERTF     BIT(8),               /* SIXTH BYTE OF ROUTING       08847300
*                                           CODES                @L2A*/ 08897300
*       4 ORERT041  BIT(1),              /* JOB STATUS MESSAGE          08947300
*                                                            @YA10057*/ 08997300
*       4 ORERT042  BIT(1),              /* GENERAL INFO. ABOUT JES2    09047300
*                                           OR JES3              @L2A*/ 09097300
*       4 ORERT043  BIT(1),              /* RESERVED FOR JES USAGE      09147300
*                                                                @L2A*/ 09197300
*       4 ORERT044  BIT(1),              /* RESERVED FOR JES USAGE      09247300
*                                                                @L2A*/ 09297300
*       4 ORERT045  BIT(1),              /* RESERVED FOR JES USAGE      09347300
*                                                                @L2A*/ 09397300
*       4 ORERT046  BIT(1),              /* RESERVED FOR JES USAGE      09447300
*                                                                @L2A*/ 09497300
*       4 ORERT047  BIT(1),              /* RESERVED FOR JES USAGE      09547300
*                                                                @L2A*/ 09597300
*       4 ORERT048  BIT(1),              /* RESERVED FOR JES USAGE      09647300
*                                                                @L2A*/ 09697300
*     3 ORERTG     BIT(8),               /* SEVENTH BYTE OF ROUTING     09747300
*                                           CODES                @L2A*/ 09797300
*       4 ORERT049  BIT(1),              /* RESERVED FOR JES USAGE      09847300
*                                                                @L2A*/ 09897300
*       4 ORERT050  BIT(1),              /* RESERVED FOR JES USAGE      09947300
*                                                                @L2A*/ 09997300
*       4 ORERT051  BIT(1),              /* RESERVED FOR JES USAGE      10047300
*                                                                @L2A*/ 10097300
*       4 ORERT052  BIT(1),              /* RESERVED FOR JES USAGE      10147300
*                                                                @L2A*/ 10197300
*       4 ORERT053  BIT(1),              /* RESERVED FOR JES USAGE      10247300
*                                                                @L2A*/ 10297300
*       4 ORERT054  BIT(1),              /* RESERVED FOR JES USAGE      10347300
*                                                                @L2A*/ 10397300
*       4 ORERT055  BIT(1),              /* RESERVED FOR JES USAGE      10447300
*                                                                @L2A*/ 10497300
*       4 ORERT056  BIT(1),              /* RESERVED FOR JES USAGE      10547300
*                                                                @L2A*/ 10597300
*     3 ORERTH     BIT(8),               /* EIGHTH BYTE OF ROUTING      10647300
*                                           CODES                @L2A*/ 10697300
*       4 ORERT057  BIT(1),              /* RESERVED FOR JES USAGE      10747300
*                                                                @L2A*/ 10797300
*       4 ORERT058  BIT(1),              /* RESERVED FOR JES USAGE      10847300
*                                                                @L2A*/ 10897300
*       4 ORERT059  BIT(1),              /* RESERVED FOR JES USAGE      10947300
*                                                                @L2A*/ 10997300
*       4 ORERT060  BIT(1),              /* RESERVED FOR JES USAGE      11047300
*                                                                @L2A*/ 11097300
*       4 ORERT061  BIT(1),              /* RESERVED FOR JES USAGE      11147300
*                                                                @L2A*/ 11197300
*       4 ORERT062  BIT(1),              /* RESERVED FOR JES USAGE      11247300
*                                                                @L2A*/ 11297300
*       4 ORERT063  BIT(1),              /* RESERVED FOR JES USAGE      11347300
*                                                                @L2A*/ 11397300
*       4 ORERT064  BIT(1),              /* RESERVED FOR JES USAGE      11447300
*                                                                @L2A*/ 11497300
*     3 ORERTI     BIT(8),               /* NINTH BYTE OF ROUTING       11547300
*                                           CODES                @L2A*/ 11597300
*       4 ORERT065  BIT(1),              /* PROCESSOR RELATED MESSAGE   11647300
*                                                                @L2A*/ 11697300
*       4 ORERT066  BIT(1),              /* PROCESSOR RELATED MESSAGE   11747300
*                                                                @L2A*/ 11797300
*       4 ORERT067  BIT(1),              /* PROCESSOR RELATED MESSAGE   11847300
*                                                                @L2A*/ 11897300
*       4 ORERT068  BIT(1),              /* PROCESSOR RELATED MESSAGE   11947300
*                                                                @L2A*/ 11997300
*       4 ORERT069  BIT(1),              /* PROCESSOR RELATED MESSAGE   12047300
*                                                                @L2A*/ 12097300
*       4 ORERT070  BIT(1),              /* PROCESSOR RELATED MESSAGE   12147300
*                                                                @L2A*/ 12197300
*       4 ORERT071  BIT(1),              /* PROCESSOR RELATED MESSAGE   12247300
*                                                                @L2A*/ 12297300
*       4 ORERT072  BIT(1),              /* PROCESSOR RELATED MESSAGE   12347300
*                                                                @L2A*/ 12397300
*     3 ORERTJ     BIT(8),               /* TENTH BYTE OF ROUTING       12447300
*                                           CODES                @L2A*/ 12497300
*       4 ORERT073  BIT(1),              /* PROCESSOR RELATED MESSAGE   12547300
*                                                                @L2A*/ 12597300
*       4 ORERT074  BIT(1),              /* PROCESSOR RELATED MESSAGE   12647300
*                                                                @L2A*/ 12697300
*       4 ORERT075  BIT(1),              /* PROCESSOR RELATED MESSAGE   12747300
*                                                                @L2A*/ 12797300
*       4 ORERT076  BIT(1),              /* PROCESSOR RELATED MESSAGE   12847300
*                                                                @L2A*/ 12897300
*       4 ORERT077  BIT(1),              /* PROCESSOR RELATED MESSAGE   12947300
*                                                                @L2A*/ 12997300
*       4 ORERT078  BIT(1),              /* PROCESSOR RELATED MESSAGE   13047300
*                                                                @L2A*/ 13097300
*       4 ORERT079  BIT(1),              /* PROCESSOR RELATED MESSAGE   13147300
*                                                                @L2A*/ 13197300
*       4 ORERT080  BIT(1),              /* PROCESSOR RELATED MESSAGE   13247300
*                                                                @L2A*/ 13297300
*     3 ORERTK     BIT(8),               /* ELEVENTH BYTE OF ROUTING    13347300
*                                           CODES                @L2A*/ 13397300
*       4 ORERT081  BIT(1),              /* PROCESSOR RELATED MESSAGE   13447300
*                                                                @L2A*/ 13497300
*       4 ORERT082  BIT(1),              /* PROCESSOR RELATED MESSAGE   13547300
*                                                                @L2A*/ 13597300
*       4 ORERT083  BIT(1),              /* PROCESSOR RELATED MESSAGE   13647300
*                                                                @L2A*/ 13697300
*       4 ORERT084  BIT(1),              /* PROCESSOR RELATED MESSAGE   13747300
*                                                                @L2A*/ 13797300
*       4 ORERT085  BIT(1),              /* PROCESSOR RELATED MESSAGE   13847300
*                                                                @L2A*/ 13897300
*       4 ORERT086  BIT(1),              /* PROCESSOR RELATED MESSAGE   13947300
*                                                                @L2A*/ 13997300
*       4 ORERT087  BIT(1),              /* PROCESSOR RELATED MESSAGE   14047300
*                                                                @L2A*/ 14097300
*       4 ORERT088  BIT(1),              /* PROCESSOR RELATED MESSAGE   14147300
*                                                                @L2A*/ 14197300
*     3 ORERTL     BIT(8),               /* TWELFTH BYTE OF ROUTING     14247300
*                                           CODES                @L2A*/ 14297300
*       4 ORERT089  BIT(1),              /* PROCESSOR RELATED MESSAGE   14347300
*                                                                @L2A*/ 14397300
*       4 ORERT090  BIT(1),              /* PROCESSOR RELATED MESSAGE   14447300
*                                                                @L2A*/ 14497300
*       4 ORERT091  BIT(1),              /* PROCESSOR RELATED MESSAGE   14547300
*                                                                @L2A*/ 14597300
*       4 ORERT092  BIT(1),              /* PROCESSOR RELATED MESSAGE   14647300
*                                                                @L2A*/ 14697300
*       4 ORERT093  BIT(1),              /* PROCESSOR RELATED MESSAGE   14747300
*                                                                @L2A*/ 14797300
*       4 ORERT094  BIT(1),              /* PROCESSOR RELATED MESSAGE   14847300
*                                                                @L2A*/ 14897300
*       4 ORERT095  BIT(1),              /* PROCESSOR RELATED MESSAGE   14947300
*                                                                @L2A*/ 14997300
*       4 ORERT096  BIT(1),              /* PROCESSOR RELATED MESSAGE   15047300
*                                                                @L2A*/ 15097300
*     3 ORERTM     BIT(8),               /* THIRTEENTH BYTE OF ROUTING  15147300
*                                           CODES                @L2A*/ 15197300
*       4 ORERT097  BIT(1),              /* DEVICE RELATED MESSAGE      15247300
*                                                                @L2A*/ 15297300
*       4 ORERT098  BIT(1),              /* DEVICE RELATED MESSAGE      15347300
*                                                                @L2A*/ 15397300
*       4 ORERT099  BIT(1),              /* DEVICE RELATED MESSAGE      15447300
*                                                                @L2A*/ 15497300
*       4 ORERT100  BIT(1),              /* DEVICE RELATED MESSAGE      15547300
*                                                                @L2A*/ 15597300
*       4 ORERT101  BIT(1),              /* DEVICE RELATED MESSAGE      15647300
*                                                                @L2A*/ 15697300
*       4 ORERT102  BIT(1),              /* DEVICE RELATED MESSAGE      15747300
*                                                                @L2A*/ 15797300
*       4 ORERT103  BIT(1),              /* DEVICE RELATED MESSAGE      15847300
*                                                                @L2A*/ 15897300
*       4 ORERT104  BIT(1),              /* DEVICE RELATED MESSAGE      15947300
*                                                                @L2A*/ 15997300
*     3 ORERTN     BIT(8),               /* FOURTEENTH BYTE OF ROUTING  16047300
*                                           CODES                @L2A*/ 16097300
*       4 ORERT105  BIT(1),              /* DEVICE RELATED MESSAGE      16147300
*                                                                @L2A*/ 16197300
*       4 ORERT106  BIT(1),              /* DEVICE RELATED MESSAGE      16247300
*                                                                @L2A*/ 16297300
*       4 ORERT107  BIT(1),              /* DEVICE RELATED MESSAGE      16347300
*                                                                @L2A*/ 16397300
*       4 ORERT108  BIT(1),              /* DEVICE RELATED MESSAGE      16447300
*                                                                @L2A*/ 16497300
*       4 ORERT109  BIT(1),              /* DEVICE RELATED MESSAGE      16547300
*                                                                @L2A*/ 16597300
*       4 ORERT110  BIT(1),              /* DEVICE RELATED MESSAGE      16647300
*                                                                @L2A*/ 16697300
*       4 ORERT111  BIT(1),              /* DEVICE RELATED MESSAGE      16747300
*                                                                @L2A*/ 16797300
*       4 ORERT112  BIT(1),              /* DEVICE RELATED MESSAGE      16847300
*                                                                @L2A*/ 16897300
*     3 ORERTO     BIT(8),               /* FIFTEENTH BYTE OF ROUTING   16947300
*                                           CODES                @L2A*/ 16997300
*       4 ORERT113  BIT(1),              /* DEVICE RELATED MESSAGE      17047300
*                                                                @L2A*/ 17097300
*       4 ORERT114  BIT(1),              /* DEVICE RELATED MESSAGE      17147300
*                                                                @L2A*/ 17197300
*       4 ORERT115  BIT(1),              /* DEVICE RELATED MESSAGE      17247300
*                                                                @L2A*/ 17297300
*       4 ORERT116  BIT(1),              /* DEVICE RELATED MESSAGE      17347300
*                                                                @L2A*/ 17397300
*       4 ORERT117  BIT(1),              /* DEVICE RELATED MESSAGE      17447300
*                                                                @L2A*/ 17497300
*       4 ORERT118  BIT(1),              /* DEVICE RELATED MESSAGE      17547300
*                                                                @L2A*/ 17597300
*       4 ORERT119  BIT(1),              /* DEVICE RELATED MESSAGE      17647300
*                                                                @L2A*/ 17697300
*       4 ORERT120  BIT(1),              /* DEVICE RELATED MESSAGE      17747300
*                                                                @L2A*/ 17797300
*     3 ORERTP     BIT(8),               /* SIXTEENTH BYTE OF ROUTING   17847300
*                                           CODES                @L2A*/ 17897300
*       4 ORERT121  BIT(1),              /* DEVICE RELATED MESSAGE      17947300
*                                                                @L2A*/ 17997300
*       4 ORERT122  BIT(1),              /* DEVICE RELATED MESSAGE      18047300
*                                                                @L2A*/ 18097300
*       4 ORERT123  BIT(1),              /* DEVICE RELATED MESSAGE      18147300
*                                                                @L2A*/ 18197300
*       4 ORERT124  BIT(1),              /* DEVICE RELATED MESSAGE      18247300
*                                                                @L2A*/ 18297300
*       4 ORERT125  BIT(1),              /* DEVICE RELATED MESSAGE      18347300
*                                                                @L2A*/ 18397300
*       4 ORERT126  BIT(1),              /* DEVICE RELATED MESSAGE      18447300
*                                                                @L2A*/ 18497300
*       4 ORERT127  BIT(1),              /* DEVICE RELATED MESSAGE      18547300
*                                                                @L2A*/ 18597300
*       4 ORERT128  BIT(1),              /* DEVICE RELATED MESSAGE      18647300
*                                                                @L2A*/ 18697300
*   2 OREWTORU CHAR(8),                  /* USERID OF WTOR ISSUER       18698900
*                                                                @L3A*/ 18700500
*   2 ORECNRA     PTR(31),               /* ADDRESS OF 12 BYTE FIELD    18702300
*                                           FOR REPLYING CONSOLE        18707300
*                                           NAME/ID              @L4A*/ 18712300
*   2 ORECNDAT   CHAR(12),               /* REPLYING CONSOLE NAME       18717300
*                                           AND ID               @L4A*/ 18722300
*     3 ORECNNME   CHAR(8),              /* REPLYING CONSOLE NAME       18727300
*                                                                @L4A*/ 18732300
*     3 ORECNID    CHAR(4),              /* REPLYING CONSOLE ID  @D1C*/ 18734800
*   2 ORERPIDB FIXED(31);                /* Reply id (binary            18737300
*                                           representation       @D1A*/ 18739800
*                                                                       18742300
* /************************************************************* @L1A*/ 18747300
* /*  CONSTANTS FOR OREVRSN                                      @L1A*/ 18797300
* /************************************************************* @L1A*/ 18847300
* DCL ORESP13 FIXED(8) CONSTANT(1);      /* ORE IS AT JBB1326 LEVEL     18897300
*                                                                @L1A*/ 18947300
* DCL ORESP22 FIXED(8) CONSTANT(2);      /* ORE IS AT JBB2220 LEVEL     18997300
*                                                                @L2A*/ 19047300
* DCL ORESP313 FIXED(8) CONSTANT(3);      /* ORE IS AT JBB3313 LEVEL    19062300
*                                                                @P2C*/ 19077300
* DCL ORESP410 FIXED(8) CONSTANT(4);     /* ORE IS AT HBB4410 LEVEL     19092300
*                                                                @P2C*/ 19107300
* DCL OREVRID FIXED(8) CONSTANT(ORESP410);/* VERSION LEVEL VALUE @D1C*/ 19122300
*                                                                       19147300
*%ORESIZE = 'LENGTH(OREF)';              /* LENGTH OF ORE (OS/VS2)      19197300
*                                                              MDC007*/ 19247300
