*        %GOTO OUXBPLS1; /*                                             00021040
         MACRO                                                          00022030
         IHAOUXB &DSECT=YES,&LABEL=,&PF=OUXB                         */ 00023020
*%OUXBPLS1:  ;                                                          00024010
*/* START OF SPECIFICATIONS ******************************************/ 00025000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00025990
*/*01* PROPRIETARY STATEMENT=                                        */ 00026980
*/*                                                                  */ 00027970
*/*     COPYRIGHT - 5645-001                                         */ 00028960
*/*                 THIS MODULE IS "RESTRICTED MATERIALS OF IBM"     */ 00029950
*/*                 (C) COPYRIGHT IBM CORP. 1977, 1997               */ 00030940
*/*                 LICENSED MATERIALS - PROPERTY OF IBM             */ 00031930
*/*                                                                  */ 00032920
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00033910
*/*                                                                  */ 00034900
*/*01* STATUS: HBB6603                                               */ 00035890
*/*                                                                  */ 00036880
*/*01* EXTERNAL CLASSIFICATION: PSPI                                 */ 00037870
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00038860
*/*                                                                  */ 00039850
*/*01* DESCRIPTIVE NAME:  RESOURCES MANAGER USER EXTENSION BLOCK     */ 00040840
*/*02*  ACRONYM:  OUXB                                               */ 00041830
*/*                                                                  */ 00042820
*/*01* MACRO NAME: IHAOUXB                                           */ 00043810
*/*                                                                  */ 00044800
*/*01* DSECT NAME: OUXB                                              */ 00045790
*/*                                                                  */ 00046780
*/*01* COMPONENT:  System Resources Manager (SC1CX)                  */ 00047770
*/*                                                                  */ 00048760
*/*01* EYE-CATCHER:  OUXB                                            */ 00049750
*/*02*  OFFSET:  0                                                   */ 00050740
*/*02*  LENGTH:  4                                                   */ 00051730
*/*                                                                  */ 00052720
*/*01* STORAGE ATTRIBUTES:                                           */ 00053710
*/*02*  SUBPOOL:  245                                                */ 00054700
*/*02*  KEY:  0                                                      */ 00055690
*/*                                                                  */ 00056680
*/*02*  RESIDENCY:  Above 16M line                                   */ 00057670
*/*02*  MAIN STORAGE:  YES                                           */ 00058660
*/*02*  AUXILIARY STORAGE:  No                                       */ 00059650
*/*02*  VIRTUAL STORAGE:  Common                                     */ 00060640
*/*02*  DATA SPACE: no                                               */ 00061630
*/*                                                                  */ 00062620
*/*01* SIZE:  416 bytes                                              */ 00063610
*/*                                                                  */ 00064600
*/*01* CREATED BY: IRAEVMEM                                          */ 00065590
*/*                                                                  */ 00066580
*/*01* POINTED TO BY: ASCBOUXB field of the ASCB data area           */ 00067570
*/*                                                                  */ 00068560
*/*01* SERIALIZATION: SRM lock                                       */ 00069550
*/*                                                                  */ 00070540
*/*01* FUNCTION:  THE OUXB CONTAINS SUCH SYSTEM RESOURCES MANAGER    */ 00071530
*/*         DATA ABOUT AN ADDRESS SPACE AS IS NOT REQUIRED BY THE    */ 00072520
*/*         SYSTEM RESOURCES MANAGER WHILE THAT ADDRESS SPACE IS     */ 00073510
*/*         SWAPPED OUT. THE STORAGE FOR THE OUXB IS FREED DURING    */ 00074500
*/*         THE SWAPPED-OUT PERIOD.  THE OUXB RESIDES IN SQA, SO     */ 00075490
*/*         IT MAY BE REFERENCED WITHOUT HAVING ADDRESSABILITY TO    */ 00076480
*/*         THE DESCRIBED ADDRESS SPACE.                             */ 00077470
*/*                                                                  */ 00078460
*/*01* METHOD OF ACCESS:  THE OUXB FOR AN ADDRESS SPACE IS LOCATED   */ 00079450
*/*         VIA THE -ASCBOUXB- FIELD OF THE ADDRESS SPACE CONTROL    */ 00080440
*/*         BLOCK.                                                   */ 00081430
*/*                                                                  */ 00082420
*/*                                                                  */ 00083410
*/*01* CHANGE ACTIVITY:  ZA16887, G812PJC, G38APSS, G860P26          */ 00084400
*/*                     ZA10808                                     */  00085390
*/*                     ZA20975                                     */  00086380
*/*                     ZA33468                                     */  00087370
*/*                     G744PGS                                     */  00088360
*/*                     ZA44728                                     */  00089350
*/*      OY03623 - SUPPORT >128 MB REAL STORAGE             @YA03623*/  00090340
*/*                                                                 */  00091330
*/*      OY06561 - RESHIPPED TO SUPERCEDE OY06561           @YA06561*/  00092320
*/*                                                                 */  00093310
*/*      OY62416 - 10/05/93 - Added the OUXBPSTO and OUXBAPIN       */  00094300
*/*                           fields.                       @YA62416*/  00095290
*/*                                                                 */  00096280
*/*   A000000-999999                                          Y02133*/  00097270
*/*                                                                 */  00098260
*/* $P1=PCI0038 JBB2217  850930 PD16R1: Add field: OUXBDSCN         */  00099250
*/* $P2=PCI0043 JBB2217  851002 PD16R1: Correct length of OUXBRSV2  */  00100240
*/*                                     in PLS to match ASM         */  00101230
*/* $L2=IOGEN   JBB2220  840625 PDJK  : IOGEN RESTRUCTURE           */  00102220
*/* $D1=DCR007  JBB2220  840822 PD33G3: VSC AND NVC ARE FIXED( 32 ) */  00103210
*/* $LT=DREF    HBB3310  861001 PD88AA: Disabled Reference Support  */  00104200
*/* $D4=DCR0220 HBB3310  870228 PD88AI: Reduced Preemption Support  */  00105190
*/* $D9=DCR0291 HBB3310  871116 PD88CL: Support >256MB Real Storage */  00106180
*/* $L1=HIPER   JBB3311  880308 PD88AK: SUPPORT FOR HIPERSPACES @L1A*/  00107170
*/* $D2=DCG0029 JBB3311  880623 PD88AK: CACHE READ MISS SHOULD      */  00108160
*/*                                     BE TREATED THE SAME AS A    */  00109150
*/*                                     PAGE-IN FOR TWSS CONTROL    */  00110140
*/*                                                             @D2A*/  00111130
*/* $L3=LJOBM   JBB3313  881107 PD88AI: Large Job Management.       */  00112120
*/*                                     Add new fields for trimming */  00113110
*/*                                                             @L3A*/  00114100
*/* $L4=WSMGT   HBB4420  900716 PD88AK: Working Set Management      */  00115090
*/*                                     Support                 @L4A*/  00116080
*/* $P3=PH31514 HBB4420  900919 PD88AK: ADD RESERVED FIELDS TO      */  00117070
*/*                                     PROPERLY FILL OUXB2BLK  @P3A*/  00118060
*/* $T1=OY41915 HBB4420  910506 PD88AK: Support for TRSQ PH32281:   */  00119050
*/*                                     add field to indicate when  */  00120040
*/*                                     an address space has been   */  00121030
*/*                                     swapped-in but not gone     */  00122020
*/*                                     thru an RM2 interval    @T1A*/  00123010
*/*                                                                 */  00124000
*/* $01=OY58107 HBB4430  920915 PD88AK: Alternate Wait Management   */  00124990
*/*                                     support                 @01A*/  00125980
*/*                                                                 */  00126970
*/* $L5=WLMI    HBB5510  921231 PD004U: Workload Manager I          */  00127960
*/*                                                                 */  00128950
*/* $L6=ENCLV   HBB5520  940224 PD88AK: Enclaves support        @L6A*/  00129940
*/*                                                                 */  00130930
*/* $L7=CAPT2   HBB5520  940415 PD88AK: Captured storage        @L7A*/  00131920
*/*                                                                 */  00132910
*/*   $WLMPIOP  HBB6630  950601 PD00BZ: I/O Priority Management     */  00133900
*/*                                                         @PSY0405*/  00134890
*/*                                                                 */  00135880
*/*   $WLMPIOP  HBB6630  950831 PD00BZ: Add I/O disconnect time     */  00136870
*/*                                     field               @PSY0405*/  00137860
*/*                                                                 */  00138850
*/*   $PQC0701  HBB6603  960124 PD00BZ: Peter Yocom                 */  00139840
*/*                                     OUXBSMPC -> OUXBIOSC        */  00140830
*/*                                                                 */  00141820
*/*   $DQC0023  HBB6603  960427 PDBB:   John Arwe                   */  00142810
*/*                                     Fix prop stmt, undo asm     */  00143800
*/*                                     bug introduced by pqc0701   */  00144790
*/*                                     (Missing * in col 1 of plx) */  00145780
*/*   $PQC1330  HBB6603  960530 PDBZ:   Peter Yocom: Fix comments   */  00146770
*/*                                                                 */  00147760
*/*   $PSY0405  JBB6604  970303 PDB9KP: Kevin Paoloni: Waste time   */  00148750
*/*                                     fixing comment lines for    */  00149740
*/*                                     bean counters               */  00150730
*/*                                                                 */  00151720
*/*   $OW51126  HBB7703  000413 PDB9DA: Tak Chin: FICON Native      */  00152710
*/*                                                                 */  00153700
*/* END OF SPECIFICATIONS ********************************************/ 00154690
* /*   left over from old prolog.......                              */ 00155680
* /*                                                                 */ 00156670
* /*   INVOCATION PARAMETERS AND/OR KEYWORDS =                       */ 00157660
* /*                                                                 */ 00158650
* /*     BAL - DSECT=NO IF DSECT IS NOT TO BE PRODUCED.              */ 00159640
* /*         - LABEL='USERNAME' IF USERNAME EQU OUXB TO BE GEN'D.    */ 00160630
* /*         - PF=XXXX SPECIFIES THAT THE LABELS ARE TO START WITH   */ 00161620
* /*           XXXX INSTEAD OF OUXB.  THE DEFAULT IS OUXB.       @L2C*/ 00162610
* /*                                                                 */ 00163600
* /*                                                                 */ 00164590
* /*         NOTE - THE BAL FORM OF THE MACRO IS CODED WITH          */ 00165580
* /*         'DC' INSTRUCTIONS, SO THAT THE MACRO MAY BE USED        */ 00166570
* /*         TO ASSEMBLE THE INITIAL FIELD VALUES FOR A CSECT        */ 00167560
* /*         CONTAINING A MODEL OUXB.                                */ 00168550
* /*                                                                 */ 00169540
* /*         USING ON OUXB GIVES ADDRESSABILITY TO ALL SYMBOLS.      */ 00170530
* /*                                                                 */ 00171520
* /*         IF THIS MACRO IS TO BE INCLUDED IN A BAL MODULE,        */ 00172510
* /*         ALSO INCLUDE IEZBITS.                           @ZA44728*/ 00173500
* /*                                                                 */ 00174490
* /*     PLS - %OUXBLEVL='USERLEVL' IF THE OUXB MAPPING IS TO BE     */ 00175480
* /*           CONCATENATED WITH A PREVIOUS DECLARATION, WITH THE    */ 00176470
* /*           OUXB BEING ASSIGNED THE INDICATED STRUCTURE LEVEL.    */ 00177460
* /*         - %OUXB9999=',' IF THE STRUCTURE SHOULD NOT BE CLOSED.  */ 00178450
* /*                                                                 */ 00179440
* /*         TO ACCESS AS A STANDALONE STRUCTURE DCL OUXBPTR PTR.    */ 00180430
* /*                                                                 */ 00181420
* /*   END OF SPECIFICATIONS                                         */ 00182410
* /* *************************************************************** */ 00183400
*        %GOTO OUXBPLS2; /*                                             00184390
* /*                                                                    00185380
.OUXBAL1 ANOP                                                           00186370
         SPACE 1                                                        00187360
         AIF   ('&DSECT' EQ 'NO').OUXBAL2                               00188350
&PF.     DSECT                                                          00189340
         AGO   .OUXBAL3                                                 00190330
.OUXBAL2 ANOP                                                           00191320
&PF.     DS    0D                                                  @L2C 00192310
.OUXBAL3 ANOP                                                      @L2C 00193300
         AIF   ('&LABEL' EQ '').OUXBAL4                            @L2A 00194290
&LABEL   DS    0D                                                  @L2C 00195280
.OUXBAL4 ANOP                                                      @L2A 00196270
         SPACE 1                                                        00197260
&PF.1BLK DS    0CL256  -           FIRST 256 BYTES OF OUXB         @D1A 00198250
&PF.NAME DC    C'OUXB' -           BLOCK IDENTIFICATION            @L2C 00199240
&PF.PSET DC    F'0' -              MS6 BASE PREEMPTABLE/CLIENT SRB      00200230
*                                  EXECUTION TIME                  @L6C 00201220
&PF.MET  DC    F'0' -              MSO BASE CPU MEASUREMENT        @L2C 00202210
&PF.RSW  DC    A(0) -              ADDR OF ECB PASSED BY REQSWAP   @L2C 00203200
&PF.PAGE EQU   *                  PAGING INFO REPORTED BY SMF      @L2C 00204190
&PF.PIN  DC    F'0' -              INTERVAL PAGE-IN ACCUMULATOR    @L2C 00205180
&PF.POUT DC    F'0' -              INTERVAL PAGE-OUT ACCUMULATOR   @L2C 00206170
&PF.CRMS DC    F'0' -              CACHE READ MISS ACCUMULATOR     @D2C 00207160
&PF.VAMI DC    F'0' -              INTERVAL VAM PAGE-IN ACCUMULATR @L2C 00208150
&PF.VAMO DC    F'0' -              INTERVAL VAM PAGE-OUT ACCUMULAT @L2C 00209140
&PF.VAMR DC    F'0' -              INTERVAL VAM RECLAIM ACCUMULATR @L2C 00210130
&PF.SWAP EQU   *                  SWAP INFORMATION                 @L2C 00211120
&PF.SPIN DC    F'0'                SWAP PAGE IN COUNT              @L2C 00212110
&PF.SPOT DC    F'0'                SWAP PAGE OUT COUNT             @L2C 00213100
&PF.SWCT DC    F'0'                SWAP COUNT                      @L2C 00214090
&PF.CAPI DC    F'0' -              INTERVAL COMMON AREA PAGINS     @L2C 00215080
&PF.HSPI DC    F'0' -              HIPERSPACE PAGE-IN COUNT        @L1C 00216070
&PF.STCT DC    F'0' -              PAGES STOLEN ACCUMULATOR        @L2C 00217060
&PF.LPAI DC    F'0' -              LPA PAGE IN                     @L2C 00218050
&PF.HSPO DC    F'0' -              HIPERSPACE PAGE-OUT COUNT       @L1C 00219040
&PF.CPDL DC    H'0' -              Delayed sample count - count for     00220030
*                                  reduced preemption of the number of  00221020
*                                  times this address space was delayed 00222010
*                                  during a cycle (20) of samples  @D4C 00223000
&PF.STC  DC    H'0' -              INTERVAL STEAL CALL COUNT       @L2C 00223990
&PF.EJST DC    F'0' -              BASE EXEC TIME FOR 101%         @L2C 00224980
&PF.TSW  DC    A(0) -              TRANSWAP ECB ADDRESS            @L2C 00225970
&PF.FLDS EQU   *                   OUXB information saved in OUSB at    00226960
*                                  QSCEMP (Queisce Complete)       @LTC 00227950
&PF.NQT  DC    F'0' -              ENQ RESIDENCY START TIME        @L2C 00228940
&PF.ACNT EQU   *                   ACCOUNTING INFORMATION          @L2C 00229930
&PF.TRC  DC    F'0' -              SESSION TRANSACTION COUNT       @L2C 00230920
&PF.JBS  DC    F'0' -              SESSION SERVICE ACCUMULATOR     @L2C 00231910
&PF.JBT  DC    F'0' -              SESSION TIME ACCUMULATOR        @L2C 00232900
&PF.RSVD DC    F'0' -              reserved                        @L5C 00233890
&PF.TRT  DC    F'0' -              TRANSACTION TIME ACCUMULATOR    @L2C 00234880
&PF.JBR  DC    F'0' -              SESSION RESIDENCY ACCUMULATOR   @L2C 00235870
&PF.RSVE DC    F'0' -              reserved                        @L5C 00236860
&PF.JCPU DC    F'0' -              SESSION CPU SERVICE ACCUM       @L2C 00237850
&PF.TCPU DC    F'0' -              TRANSACTION CPU SERVICE ACCUM   @L2C 00238840
&PF.JIOC DC    F'0' -              SESSION I/O SERVICE ACCUM       @L2C 00239830
&PF.TIOC DC    F'0' -              TRANSACTION I/O SERVICE ACCUM   @L2C 00240820
&PF.JMSO DC    F'0' -              SESSION STORAGE SERVICE ACCUM   @L2C 00241810
&PF.TMSO DC    F'0' -              TRANSACTION STORAGE SERVICE ACC @L2C 00242800
&PF.JSRB DC    F'0' -              SESSION SRB SERVICE ACCUM       @L2C 00243790
&PF.TSRB DC    F'0' -              TRANSACTION SRB SERVICE ACCUM   @L2C 00244780
&PF.CSET DC    F'0' -              Base preemptable and client SRB      00245770
*                                  time, utilized in AP1.          @L6A 00246760
&PF.IOSM DC    F'0' -              SMF BASE EXCP COUNT             @L2C 00247750
&PF.DCTI DC    F'0' -              DEVIVE CONN TIME BASE           @L2C 00248740
&PF.CPS  DC    D'0' -              WLM CPU MEASRMT - 64BIT NMB     @L2C 00249730
&PF.MSS  DC    D'0' -              WLM MSO BASE SERVICE VALUE      @L2C 00250720
&PF.SBS  DC    D'0'                WLM SRB BASE SERVICE VALUE      @L2C 00251710
&PF.RSVC DC    F'0' -              RESERVED                        @L4C 00252700
&PF.STD  DC    F'0' -              AUX BASE START TIME             @L2C 00253690
&PF.PRS  DC    F'0' -              PERF GRP PERIOD STARTING SERVIC @L2C 00254680
&PF.WCT  DC    H'0' -              APG BASE SHORT WAIT COUNT       @L2C 00255670
&PF.RSV1 DC    FL1'0' -            RESERVED                        @L2C 00256660
&PF.FLGS DC    B'00000000' -       FLAG BYTE                       @L2C 00257650
&PF.WMO  EQU   BIT0 -              TSO COMMAND ENDED               @L2C 00258640
&PF.CLST EQU   BIT1 -              TSO CLIST MODE                  @L2C 00259630
&PF.PRM2 EQU   BIT2 -              Address Space formerly had full      00260620
*                                  preemption                      @D4C 00261610
&PF.ISWI EQU   BIT3 -              Ignore paging data because address   00262600
*                                  space was just swapped in       @T1A 00263590
&PF.GFRR EQU   BIT4 -              Getmained by IRARMERR           @L5A 00264580
&PF.VSC  DC    F'0' -              AUX BASE VAM SLOT COUNT         @D1C 00265570
&PF.NVC  DC    F'0' -              AUX BASE NONVAM SLOT COUNT      @D1C 00266560
&PF.FIXC DC    H'0' -              BASE USER FIXED FRAME COUNT     @L2C 00267550
&PF.UIC  DC    H'0' -              HIGHEST UNREF FRAME COUNT       @L2C 00268540
&PF.SIBP DC    F'0' -              BASE PAGE IN COUNT              @L2C 00269530
&PF.SIBR DC    F'0' -              BASE RESIDENT TIME              @L2C 00270520
&PF.SIBE DC    F'0' -              BASE EXECUTION TIME             @L2C 00271510
&PF.SIPR DC    H'0' -              RECENT PAGE IN RATE             @L2C 00272500
         DC   2Y(0) -              RESERVED                        @D1A 00273490
&PF.BSWC DC    H'0' -              Base short wait count           @01C 00274480
&PF.AET  DC    D'0' -              APG BASE CPU MEASUREMENT        @L2C 00275470
&PF.UICT DC    F'0' -              TIME UIC UPDT LAST DONE         @L2C 00276460
&PF.TSIO DC    F'0' -              TRANSACTION RESIDENT INTERVAL I/O   X00277450
                                   SERVICE                         @L2C 00278440
&PF.CPWS DC    H'0' -              Swapped in sample count - count for  00279430
*                                  reduced preemption of the number of  00280420
*                                  samples during a sample cycle (20)   00281410
*                                  that this address space was swapped  00282400
*                                  in                              @D4A 00283390
&PF.DSCN DC    H'0' -              Dispatchable count: the number of    00284380
*                                  times that this address space has    00285370
*                                  been found in subroutine CPUTLCK to  00286360
*                                  be dispatchable yet no CPU time has  00287350
*                                  accumulated for it.             @P1A 00288340
&PF.EJT2 DC    F'0' -              LOWER HALF OF ASCBEJST AT SWAP IN   X00289330
                                                                   @L2C 00290320
&PF.2BLK DS    0CL160  -           SECOND PART OF OUXB             @L6C 00291310
&PF.EWST DC    D'0' -              ASCBEWST AT SWAP IN             @L2C 00292300
&PF.FMCT DC    F'0' -              Effective Frame Count           @D9A 00293290
&PF.TRIM DC    F'0' -              Count of frames above 512 or the     00294280
*                                  Target Working Set              @L3C 00295270
&PF.PAG2 DS    0CL48               More paging info for reporting       00296260
*                                  purposes                        @L7C 00297250
&PF.BPIN DC    F'0' -              Interval block page-in accumulator   00298240
*                                                                  @L4A 00299230
&PF.BPNE DC    F'0' -              Interval block page-in from ES       00300220
*                                  accumulator                     @L4A 00301210
&PF.PINE DC    F'0' -              Interval page-in from ES accumulator 00302200
*                                                                  @L4A 00303190
&PF.BPOT DC    F'0' -              Interval block page-out accumulator  00304180
*                                                                  @L4A 00305170
&PF.BPTE DC    F'0' -              Interval block page-out to ES        00306160
*                                  accumulator                     @L4A 00307150
&PF.POTE DC    F'0' -              Interval page-out to ES accumulator  00308140
*                                                                  @L4A 00309130
&PF.BKIA DC    F'0' -              Interval blocks in aux accumulator   00310120
*                                                                  @L4A 00311110
&PF.BKIE DC    F'0' -              Interval blocks in ES accumulator    00312100
*                                                                  @L4A 00313090
&PF.BKOA DC    F'0' -              Interval blocks out aux accumulator  00314080
*                                                                  @L4A 00315070
&PF.BKOE DC    F'0' -              Interval blocks out ES accumulator   00316060
*                                                                  @L4A 00317050
&PF.SPPI DC    F'0' -              Interval shared page-ins from aux    00318040
*                                                                  @L7A 00319030
&PF.SPEI DC    F'0' -              Interval shared page-ins from ES     00320020
*                                                                  @L7A 00321010
&PF.IIT  DC    D'0' -              Base I/O Interrupt time         @L4A 00322000
&PF.HST  DC    D'0' -              Base Hiperspace time            @L4A 00322990
&PF.TRA  DC    F'0' -              TCB ready accumulator           @01C 00323980
&PF.MTA  DC    F'0' -              Multi-tasking accumulator       @01C 00324970
&PF.PSTO DC    F'0' -              Processor storage base (RAXFMCT +    00325960
*                                  RAXESCT)                    @YA62416 00326950
&PF.APIN DC    F'0' -              Auxiliary page-in base (OUXBPIN +    00327940
*                                  OUXBBPIN)                   @YA62416 00328930
&PF.SAV2 DS   0CL48                More fields need to be saved         00329920
*                                  across swaps                    @L6A 00330910
&PF.RCT  DC    D'0' -              Base RCT time                   @L6M 00331900
&PF.PRSS DC    D'0' -              Base preemptable and client SRB      00332890
*                                  time for service calculation    @L6A 00333880
&PF.WAIT DC    F'0'                Accumulated I/O wait time for the    00334870
*                                  address space from CMB. Includes     00335860
*                                  pending time and control unit        00336850
*                                  queue time. In 128 microsecond       00337840
*                                  units                       @WLMPIOP 00338830
&PF.CON  DC    F'0'                Accumulated I/O connect time for the 00339820
*                                  address space from CMB. In 128       00340810
*                                  microsecond units           @WLMPIOP 00341800
&PF.IOSC DC    F'0'                Count of samples included in         00342790
*                                  OUXBWAIT, OUXBCON, OUXBDISC @PQC0701 00343780
&PF.DISC DC    F'0'                Accumulated I/O disconnect time for  00344770
*                                  address space from CMB. In 128       00345760
*                                  microsecond units           @WLMPIOP 00346750
&PF.FCON DC    F'0'                Accumulated I/O FICON connect time   00347740
*                                  for the address space from CMB. In   00348730
*                                  128 microsecond units       @OW51126 00349720
&PF.FDIS DC    F'0'                Accumulated I/O FICON disconnect     00350710
*                                  time for address space from CMB. In  00351700
*                                  128 microsecond units       @OW51126 00352690
&PF.FMNO DC    F'0'                FICON magic number - for every I/O   00353680
*                                  interrupt from a device attached to  00354670
*                                  a FICON native CHPID, IOS will add   00355660
*                                  one millisecond to this field        00356650
*                                                              @OW51126 00357640
&PF.FWAIT DC   F'0'                Accumulated I/O FICON wait time for  00358630
*                                  for address space from CMB. Includes 00359620
*                                  pending time and control unit        00360610
*                                  queue time. In 128 microsecond       00361600
*                                  units                       @OW51126 00362590
&PF.SPVB DC    F'0'                Base for RaxSpVlc (shared page       00363580
*                                  validation count) used by aux        00364570
*                                  shortage processing             @L7A 00365560
         DS    3F                  RESERVED                        @L7C 00366550
&PF.END  DS    0D -                END OF OUXB                     @L2C 00367540
&PF.LEN  EQU   &PF.END-&PF. -      LENGTH OF OUXB                       00368530
         MEND                                                           00369520
*                                                                    */ 00370510
*%OUXBPLS2:  ;                                                          00371500
*        %IF OUXBLEVL ~= ''         /* IS STRUCTURE CONCATENATED     */ 00372490
*            %THEN %GOTO OUXBPLS3;  /* YES, OMIT DECLARE STATEMENT   */ 00373480
*   DCL                                                                 00374470
*     1 OUXB BASED(OUXBPTR) BDY(DWORD),                                 00375460
*            %GOTO OUXBPLS4;        /* SKIP USER-GIVEN LEVEL         */ 00376450
*%OUXBPLS3:  OUXBDUM = OUXBLEVL||' OUXB';  /* PICK UP GIVEN LEVEL    */ 00377440
*     OUXBDUM BDY(DWORD),                                               00378430
*%OUXBPLS4:  ;                                                          00379420
*     2 OUXB1BLK  CHAR( 256 )       /* FIRST 256 BYTE BLOCK OUXB     */ 00380410
*                   BDY( DWORD ),   /* OUXB                      @D1A*/ 00381400
*      3   OUXBNAME CHAR(4),        /* BLOCK IDENTIFICATION - 'OUXB' */ 00382390
*      3   OUXBPSET BIT(32),        /* MS6 BASE PREEMPTABLE/CLIENT SRB  00383380
*                                      EXECUTION TIME            @L6C*/ 00384370
*      3   OUXBMET  FIXED UNSIGNED, /* MSO BASE CPU MEASUREMENT      */ 00385360
*      3   OUXBRSW  PTR(31),        /* REQSWAP ECB ADDRESS OR, IF HIGH  00386350
*                                      ORDER BIT IS ON, ADDRESS OF A    00387340
*                                      LIST.                 @ZA20975*/ 00388330
*      3   OUXBPAGE CHAR(56) BDY(DWORD), /* PAGING INFO REPORTED BY     00389320
*                                          SMF               @G50IPJH*/ 00390310
*       5  OUXBPIN  FIXED,          /* INTERVAL PAGE-IN  ACCUMULATOR */ 00391300
*       5  OUXBPOUT FIXED,          /* INTERVAL PAGE-OUT ACCUMULATOR */ 00392290
*       5  OUXBCRMS FIXED,          /* CACHE READ MISS ACCUMULATOR      00393280
*                                                                @D2C*/ 00394270
*       5  OUXBVAMI FIXED,          /* NTVL VAM PAGE-IN  ACCUMULATOR */ 00395260
*       5  OUXBVAMO FIXED,          /* NTVL VAM PAGE-OUT ACCUMULATOR */ 00396250
*       5  OUXBVAMR FIXED,          /* NTVL VAM RECLAIM  ACCUMULATOR */ 00397240
*       5  OUXBSWAP CHAR(12) BDY(WORD), /* SWAP INFORMATION  @G50IPJH*/ 00398230
*        7   OUXBSPIN FIXED,        /* SWAP PAGES IN COUNT   @G50IPJH*/ 00399220
*        7   OUXBSPOT FIXED,        /* SWAP PAGES OUT COUNT  @G50IPJH*/ 00400210
*        7   OUXBSWCT FIXED,        /* SWAP COUNT            @G50IPJH*/ 00401200
*       5  OUXBCAPI FIXED,          /* COMMON PAGE-IN ACCUM  @Z30WIMG*/ 00402190
*       5  OUXBHSPI FIXED,          /* HIPERSPACE PAGE-IN COUNT  @L1C*/ 00403180
*       5  OUXBSTCT FIXED,          /* PAGES STOLEN ACCUM    @Z40BPCH*/ 00404170
*       5  OUXBLPAI FIXED,          /* LPA PAGE IN           @G50IPJH*/ 00405160
*       5  OUXBHSPO FIXED,          /* HIPERSPACE PAGE-OUT COUNT @L1C*/ 00406150
*      3   OUXBCPDL FIXED(16),      /* Delayed sample count - count for 00407140
*                                  reduced preemption of the number of  00408130
*                                  times this address space was delayed 00409120
*                                 during a cycle (20) of samples @D4C*/ 00410110
*      3   OUXBSTC  FIXED(15),      /* INTERVAL STEAL CALL COUNT     */ 00411100
*      3   OUXBEJST BIT(32),        /* BASE EXEC TIME ,101%  @G50IPSS*/ 00412090
*      3   OUXBTSW  PTR(31),        /* TRANSWAP ECB ADDRESS OR, IF HIGH 00413080
*                                      ORDER BIT IS ON, ADDRESS OF A    00414070
*                                      LIST.  (@ZA16887)     @ZA20975*/ 00415060
*      3   OUXBFLDS  CHAR( 146 )    /* OUXB information saved in OUSB*/ 00416050
*                    BDY( DWORD,5), /* QSCECMP(QUIESCE COMPLETE) @LTC*/ 00417040
*       5  OUXBNQT  FIXED UNSIGNED, /* ENQ RESIDENCY START TIME      */ 00418030
*       5  OUXBACNT CHAR(60) BDY(WORD), /* OUXB "ACCOUNTING" @G50IPJH*/ 00419020
*        7   OUXBTRC FIXED(32),     /* SESSION TRANSACTION COUNT     */ 00420010
*        7   OUXBJBS FIXED(32),     /* SESSION SERVIC ACCUMULATOR    */ 00421000
*        7   OUXBJBT FIXED(32),     /* SESSION TIME ACCUMULATOR      */ 00421990
*        7   OUXBRSVD FIXED(32),    /* reserved                  @L5C*/ 00422980
*        7   OUXBTRT FIXED(32),     /* TRANSACTION TIME ACCUMULATOR  */ 00423970
*        7   OUXBJBR FIXED(32),     /* SESSION RESIDENT ACCUMULATOR  */ 00424960
*        7   OUXBRSVE FIXED(32),    /* reserved                  @L5C*/ 00425950
*        7   OUXBJCPU FIXED(32),    /* SESSION CPU SERVICE ACCUM        00426940
*                                                            @G50IPJH*/ 00427930
*        7   OUXBTCPU FIXED(32),    /* TRANSACTION CPU SERVICE ACCUM    00428920
*                                                            @G50IPJH*/ 00429910
*        7   OUXBJIOC FIXED(32),    /* SESSION I/O SERVICE ACCUM        00430900
*                                                            @G50IPJH*/ 00431890
*        7   OUXBTIOC FIXED(32),    /* TRANSACTION I/O SERVICE ACCUM    00432880
*                                                            @G50IPJH*/ 00433870
*        7   OUXBJMSO FIXED(32),    /* SESSION STORAGE SERVICE ACCUM    00434860
*                                                            @G50IPJH*/ 00435850
*        7   OUXBTMSO FIXED(32),    /* TRANSACTION STORAGE SERVICE      00436840
*                                      ACCUM                 @G50IPJH*/ 00437830
*        7   OUXBJSRB FIXED(32),    /* SESSION SRB SERVICE ACCUM        00438820
*                                                            @G50IPJH*/ 00439810
*        7   OUXBTSRB FIXED(32),    /* TRANSACTION SRB SERVICE ACCUM    00440800
*                                                            @G50IPJH*/ 00441790
*       5  OUXBCSET FIXED(32),      /* Base preemptable and client      00442780
*                                      SRB time, utilized in AP1.       00443770
*                                                                @L6A*/ 00444760
*       5  OUXBIOSM FIXED(32),  /* SMF BASE EXCP COUNT       @ZA10808*/ 00445750
*       5  OUXBDCTI FIXED(32),      /* DEVICE CONN TIME BASE @G860P26*/ 00446740
*       5  OUXBCPS  BIT(64) BDY(DWORD), /* WLM BASE CPU MSRM @Z30WIMG*/ 00447730
*       5  OUXBMSS BIT(64) BDY(DWORD), /* WLM BASE MSO SERVICE VALUE    00448720
*                                                            @Z40BPCH*/ 00449710
*       5  OUXBSBS BIT(64) BDY(DWORD), /* WLM SRB BASE SERVICE          00450700
*                                          VALUE             @G50IPJH*/ 00451690
*       5  OUXBRSVC FIXED(31),      /* RESERVED                  @L4C*/ 00452680
*       5  OUXBSTD  FIXED UNSIGNED, /* AUX BASE START TIME           */ 00453670
*       5  OUXBPRS  FIXED,          /* PG PERIOD STARTING SERVICE    */ 00454660
*       5  OUXBWCT  FIXED(15),      /* APG BASE SHORT WAIT COUNT     */ 00455650
*       5  OUXBRSV1 FIXED(8),       /* RESERVED              @G744PGS*/ 00456640
*       5  OUXBFLGS BIT(8),         /* FLAG BYTE             @G744PGS*/ 00457630
*        7  OUXBWMO BIT(1),         /* TSO COMMAND ENDED     @G744PGS*/ 00458620
*        7  OUXBCLST BIT(1),        /* TSO IN CLIST MODE     @G744PGS*/ 00459610
*        7  OUXBPRM2 BIT(1),        /* Address Space formerly had full  00460600
*                                      preemption                @D4C*/ 00461590
*        7  OUXBISWI BIT(1),        /* Ignore paging data because       00462580
*                                      address space was just           00463570
*                                      swapped in                @T1A*/ 00464560
*        7  OUXBGFRR BIT(1),        /* Getmained by IRARMERR     @L5A*/ 00465550
*        7  * BIT(3),               /* RESERVED                  @L5C*/ 00466540
*       5  OUXBVSC  FIXED( 32 ),    /* AUX BASE VAM SLOT         @D1C*/ 00467530
*       5  OUXBNVC  FIXED( 32 ),    /* AUX BASE NONVAM SLOT      @D1C*/ 00468520
*       5  OUXBFIXC FIXED(15),      /* BASE USER FIXED FRAME COUNT      00469510
*                                                            @Z40BPCH*/ 00470500
*       5  OUXBUIC FIXED(15),       /* HIGHEST UNREF FRAME COUNT        00471490
*                                                            @Z40BPCH*/ 00472480
*       5  OUXBSIBP FIXED(31),      /* BASE PAGE IN COUNT    @G741PSS*/ 00473470
*       5  OUXBSIBR FIXED(32),      /* BASE RESIDENCY TIME   @G741PSS*/ 00474460
*       5  OUXBSIBE FIXED(32),      /* BASE EXECUTION TIME       @D1C*/ 00475450
*       5  OUXBSIPR FIXED(15),      /* RECENT PAGE IN RATE   @G741PSS*/ 00476440
*       5  *        CHAR( 4 ),      /* Reserved                  @D4C*/ 00477430
*      3   OUXBBSWC FIXED(15),      /* base short wait count     @01C*/ 00478420
*      3   OUXBAET  BIT(64) BDY(DWORD), /* APG BASE CPU MEASUREMENT     00479410
*                                                            @G812PJC*/ 00480400
*      3   OUXBUICT FIXED(32),      /* TIME OF LAST UIC UPDT @G38APSS*/ 00481390
*      3   OUXBTSIO FIXED(32),      /* TRANSACTION RESIDENT INTERVAL    00482380
*                                      I/O SERVICE           @G860P26*/ 00483370
*      3   OUXBCPWS FIXED(16),      /* Swapped in sample count - count  00484360
*                                  for reduced preemption of the number 00485350
*                                  of samples during a sample cycle     00486340
*                                  (20) that this address space was     00487330
*                                  swapped in                    @D4A*/ 00488320
*      3   OUXBDSCN FIXED(15),      /* Dispatchable count: the number   00489310
*                                      of times that this address space 00490300
*                                      has been found in subroutine     00491290
*                                      CPUTLCK to be dispatchable yet   00492280
*                                      no CPU time has accumulated for  00493270
*                                      it.                       @P2C*/ 00494260
*      3   OUXBEJT2 FIXED(32),     /* LOWER HALF OF ASCBEJST AT         00495250
*                                     SWAP IN                @ZA44728*/ 00496240
*     2 OUXB2BLK CHAR(160)          /* Second block of OUXB      @L6C*/ 00497230
*                   BDY( DWORD ),                                       00498220
*      3   OUXBEWST BIT(64) BDY(DWORD), /* ASCBEWST AT SWAP IN          00499210
*                                                            @ZA44728*/ 00500200
*      3   OUXBFMCT FIXED(31),      /* Effective Frame Count     @D9A*/ 00501190
*      3   OUXBTRIM FIXED(31),      /* Count of frames above 512 or     00502180
*                                      the Target Working Set    @L3C*/ 00503170
*      3   OUXBPAG2 CHAR(48)        /* more paging info for          */ 00504160
*                     BDY(WORD),    /* reporting purposes        @L7C*/ 00505150
*        5   OUXBBPIN FIXED(31),    /* interval block page-in           00506140
*                                      accumulator               @L4A*/ 00507130
*        5   OUXBBPNE FIXED(31),    /* interval block page-in from ES   00508120
*                                      accumulator               @L4A*/ 00509110
*        5   OUXBPINE FIXED(31),    /* interval page-in from ES         00510100
*                                      accumulator               @L4A*/ 00511090
*        5   OUXBBPOT FIXED(31),    /* interval block page-out          00512080
*                                      accumulator               @L4A*/ 00513070
*        5   OUXBBPTE FIXED(31),    /* interval block page-out to ES    00514060
*                                      accumulator               @L4A*/ 00515050
*        5   OUXBPOTE FIXED(31),    /* interval page-out to ES          00516040
*                                      accumulator               @L4A*/ 00517030
*        5   OUXBBKIA FIXED(31),    /* interval blocks in aux           00518020
*                                      accumulator               @L4A*/ 00519010
*        5   OUXBBKIE FIXED(31),    /* interval blocks in ES            00520000
*                                      accumulator               @L4A*/ 00520990
*        5   OUXBBKOA FIXED(31),    /* interval blocks out aux          00521980
*                                      accumulator               @L4A*/ 00522970
*        5   OUXBBKOE FIXED(31),    /* interval blocks out ES           00523960
*                                      accumulator               @L4A*/ 00524950
*        5   OUXBSPPI FIXED(31),    /* interval shared page-ins from    00525940
*                                      aux accumulator           @L7A*/ 00526930
*        5   OUXBSPEI FIXED(31),    /* interval shared page-ins from    00527920
*                                      es accumulator            @L7A*/ 00528910
*      3   OUXBIIT  BIT(64) BDY(DWORD), /* Base I/O Interrupt time      00529900
*                                                                @L4A*/ 00530890
*        5   OUXBIIT1 BIT(32),      /* First word of base I/O interrupt 00531880
*                                      time                      @L4A*/ 00532870
*        5   OUXBIIT2 BIT(32),      /* Second word of base I/O interrupt00533860
*                                      time                      @L4A*/ 00534850
*      3   OUXBHST  BIT(64) BDY(DWORD), /* Base Hiperspace time  @L4A*/ 00535840
*        5   OUXBHST1 BIT(32),      /* First word of base Hiperspace    00536830
*                                      time                      @L4A*/ 00537820
*        5   OUXBHST2 BIT(32),      /* Second word of base Hiperspace   00538810
*                                      time                      @L4A*/ 00539800
*      3   OUXBTRA  FIXED(31),      /* TCB ready accumulator     @01C*/ 00540790
*      3   OUXBMTA  FIXED(31),      /* multi-tasking accumulator @01C*/ 00541780
*      3   OUXBPSTO FIXED(31),      /* Processor storage base           00542770
*                                      (RAXFMCT + RAXESCT)   @YA62416*/ 00543760
*      3   OUXBAPIN FIXED(31),      /* Auxiliary page-in base           00544750
*                                      (OUXBPIN + OUXBBPIN)  @YA62416*/ 00545740
*      3   OUXBSAV2 CHAR(48) BDY(DWORD), /* structure to save more      00546730
*                                      fields across swaps       @L6A*/ 00547720
*        5   OUXBRCT  BIT(64) BDY(DWORD), /* Base RCT time       @L6M*/ 00548710
*          7   OUXBRCT1 BIT(32),    /* First word of base RCT time      00549700
*                                                                @L6M*/ 00550690
*          7   OUXBRCT2 BIT(32),    /* Second word of base RCT time     00551680
*                                                                @L6M*/ 00552670
*        5   OUXBPRSS BIT(64) BDY(DWORD), /* Base preemptable and       00553660
*                                      client SRB time for service      00554650
*                                      calculation               @L6A*/ 00555640
*        5   OUXBWAIT FIXED(32),   /* Accumulated I/O wait time for     00556630
*                                      the adress space from CMB.       00557620
*                                      Includes pending time and        00558610
*                                      control unit queue time. In 128  00559600
*                                      microsecond units     @WLMPIOP*/ 00560590
*        5   OUXBCON  FIXED(32),   /* Accumulated I/O connect time for  00561580
*                                     the adress space from CMB. In 128 00562570
*                                     microsecond units.     @WLMPIOP*/ 00563560
*        5   OUXBIOSC FIXED(32),   /* Count of samples included in      00564550
*                                     OUXBWAIT, OUXBCON, and OUXBDISC.  00565540
*                                                            @PQC0701*/ 00566530
*        5   OUXBDISC FIXED(32),   /* Accumulated I/O disconnect time   00567520
*                                     for the address space from        00568510
*                                     the CMB. In 128 microsecond       00569500
*                                     units                  @WLMPIOP*/ 00570490
*        5   OUXBFCON FIXED(32),   /* Accumulated I/O FICON connect     00571480
*                                     time for the address space from   00572470
*                                     CMB. In 128 microsecond units     00573460
*                                                            @OW51126*/ 00574450
*        5   OUXBFDIS FIXED(32),   /* Accumulated I/O FICON disconnect  00575440
*                                     time for the address space from   00576430
*                                     the CMB. In 128 microsecond       00577420
*                                     units                  @OW51126*/ 00578410
*        5   OUXBFMNO FIXED(32),   /* FICON magic number - for every    00579400
*                                     I/O interrupt from a device       00580390
*                                     attached to a FICON native CHPID, 00581380
*                                     IOS will add one millisecond to   00582370
*                                     this field.            @OW51126*/ 00583360
*        5   OUXBFWAIT FIXED(32),  /* Accumulated I/O FICON wait time   00584350
*                                      for the adress space from CMB.   00585340
*                                      Includes pending time and        00586330
*                                      control unit queue time. In 128  00587320
*                                      microsecond units     @OW51126*/ 00588310
*      3   OUXBSPVB FIXED(32),      /* Base for RaxSpVlc (shared page   00589300
*                                      validation count) used by        00590290
*                                      aux shortage processing   @L7A*/ 00591280
*      3   * CHAR(12),              /* RESERVED                  @L7C*/ 00592270
*     2    OUXBEND  CHAR(0) BDY(DWORD)   /* END OF OUXB              */ 00593260
*                                                              /*@L5A*/ 00594250
* %IF OUXB9999 =',' %THEN %GOTO OUXB999C; /* Continue structure  @L5A*/ 00595240
*                ;                  /* End of this block         @L5A*/ 00596230
*     DCL OUXBLEN FIXED(31) CONSTANT(LENGTH(OUXB));           /* @L5A*/ 00597220
*     %GOTO OUXB999E ;                                         /*@L5A*/ 00598210
* %OUXB999C:;                                                 /* @L5A*/ 00599200
*                ,                  /* Continue structure        @L5A*/ 00600190
* %OUXB999E:;                       /* Endif                     @L5A*/ 00601180
*                                                              /*@L5A*/ 00602170
*/*                                                              @L5D*/ 00603160
