*/********************************************************************/ 00050000
*/*                                                                  */ 03700000
*/*  MACRO NAME: IHAPDS                                              */ 03701600
*/*                                                                  */ 03703200
*/*  DESCRIPTION: MAPS THE PARTITIONED DATA SET (PDS) AND PARTITIONED*/ 03705800
*/*      DATA SET (PDSE) DIRECTORY ENTRY                             */ 03708400
*/*                                                                  */ 03711200
*/*  COPYRIGHT:                                                      */ 03712800
*/*PROPRIETARY V3 STATEMENT                                          */ 03713900
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 03715000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 03716100
*/*5695-DF1                                                          */ 03717200
*/*(C) COPYRIGHT 1982,1993  IBM CORP.                                */ 03718300
*/*END PROPRIETARY V3 STATEMENT                                      */ 03719400
*/*                                                                  */ 03720800
*/*  USAGE:                                                          */ 03722400
*/*                                                                  */ 03724000
*/*      THE PDS(E) DIRECTORY ENTRY MAY HAVE ANY OR ALL OF THE       */ 03725600
*/*      FOLLOWING SIX SECTIONS IN THIS ORDER --                     */ 03727200
*/*      1.    BASIC (OPTIONALLY CONTAINS 2 BLDL BYTES)              */ 03730000
*/*      2.    SCATTER LOAD   - OPTIONAL                             */ 03740000
*/*      3.    ALIAS          - OPTIONAL                             */ 03742000
*/*      4.    SSI            - OPTIONAL (NOTE: THIS SECTION IS      */ 03755000
*/*                                       ALWAYS ON A HALF WORD      */ 03768000
*/*                                       BOUNDARY!!!)               */ 03781000
*/*      5.    APF            - OPTIONAL                             */ 03794000
*/*      6.    LPO            - OPTIONAL                         @L7A*/ 03795000
*/*                                                                  */ 03796000
*/*  METHOD OF ACCESS:                                               */ 03796800
*/*                                                                  */ 03797600
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 03798400
*/*             USING ON PDS2 GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 03798800
*/*             THE MACRO EXPANSION WILL INCLUDE THE TWO BYTES       */ 03799200
*/*             INSERTED BY BLDL UNLESS PDSBLDL=NO IS SPECIFIED.     */ 03799600
*/*      PL/S - DCL (PDS2PTR,PDSPTRV) PTR                            */ 03799700
*/*             THE MACRO EXPANSION WILL INCLUDE THE TWO BYTES       */ 03799800
*/*             INSERTED BY BLDL UNLESS %PDSBLDL='NO' IS SPECIFIED   */ 03799900
*/*             BEFORE INCLUDE FOR MACRO.                            */ 03833200
*/*                                                                  */ 03843200
*/*             THE FOLLOWING 5 PL/S STATEMENTS SHOW HOW THE         */ 03853200
*/*             STARTING ADDRESS OF ANY OF THE SIX OPTIONAL          */ 03863200
*/*             SECTIONS OF USER DATA MAY BE OBTAINED.               */ 03865200
*/*                                                                  */ 03865600
*/*             (1) PDSPTRV=ADDR(PDSBCEND)                           */ 03866000
*/*             (2) IF PDS2SCTR='1'B THEN PDSPTRV=PDSPTRV +          */ 03866400
*/*                 LENGTH(PDSS01)                                   */ 03866500
*/*             (3) IF PDS2ALIS='1'B THEN PDSPTRV=PDSPTRV +          */ 03866600
*/*                 LENGTH(PDSS02)                                   */ 03877700
*/*             (4) IF PDS2SSI='1'B THEN PDSPTRV=(PDSPTRV +          */ 03887700
*/*                 LENGTH(PDSS03) + 1)/2*2                          */ 03888100
*/*             (5) IF PDSAPFLG='1'B THEN PDSPTRV=PDSPTRV +          */ 03888200
*/*                 LENGTH(PDSS04)                               @L7A*/ 03888300
*/*                                                                  */ 03888500
*/*             STATEMENT (1) GETS THE ADDRESS FOR THE START OF THE  */ 03888600
*/*             OPTIONAL SECTIONS.  TO GET THE STARTING ADDRESS OF   */ 03888700
*/*             THE SCATTER LOAD SECTION, USE STATEMENT (1).  FOR    */ 03888800
*/*             THE ALIAS SECTION, USE STATEMENTS (1) AND (2).  FOR  */ 03892500
*/*             THE SSI SECTION, USE STATEMENTS (1), (2) AND (3)     */ 03894500
*/*             AND ADD ONE TO ADDRESS IN PDSPTRV IF ADDRESS IS NOT  */ 03894900
*/*             ON A HALF-WORD BOUNDARY. FOR THE APF SECTION, USE    */ 03895300
*/*             (1), (2), (3) AND (4). FOR THE LPO SECTION, USE ALL  */ 03895700
*/*             5 STATEMENTS.                                    @L7A*/ 03896100
*/*                                                                  */ 03896500
*/*  CHANGE ACTIVITY:                                                */ 03896900
*/*                                                                  */ 03897300
*/* $L6=DFP,HDP1102,,STLPJH: AMODE/RMODE/RSECT, RLD/CTRL RCS     @L6A*/ 03897700
*/* $L7=PM,HDP3330,,STLSAM: PROGRAM OBJECT CHANGES               @L7A*/ 03898100
*/* $L8=PM2,HDZ11C0,950309,SJPLREB: ALTP BIT                     @L8A*/ 03898300
*/********************************************************************/ 03898500
*%GOTO PDSL2;    /*                                                     03899700
         MACRO                                                          03919700
         IHAPDS &PDSBLDL=YES,&DSECT=YES                                 03939700
.*                                                                      03959700
         IEZBITS , -          SYMBOLIC BIT DEFINITIONS                  03979700
         SPACE 1                                                        04000000
         AIF   ('&DSECT' EQ 'NO').NODSCT2                               13400000
PDS2     DSECT ,              PDS2PTR                                   13500000
         AGO   .CONT2                                                   13600000
.NODSCT2 ANOP                                                           13700000
         DS    0F -                                                     13800000
PDS2     EQU   * -            PDS2PTR                                   13900000
.CONT2   ANOP                                                           14000000
PDS2NAME DS    CL8 -          MEMBER NAME OR ALIAS NAME                 14400000
PDS2TTRP DS    CL3 -          TTR OF FIRST BLOCK OF NAMED MEMBER        14500000
         AIF   ('&PDSBLDL' EQ 'NO').PDSX2                               14550000
PDS2CNCT DS    FL1 -          CONCATENATION NUMBER OF THE DATA SET      14600000
PDS2LIBF DS    C -            LIBRARY FLAG FIELD                        14700000
PDS2LNRM EQU   X'00' -        NORMAL CASE                               14800000
PDS2LLNK EQU   X'01' -        IF DCB OPERAND IN BLDL MACRO INTRUCTION   14900000
*                             WAS SPECIFIED AS ZERO, NAME WAS FOUND IN  15000000
*                             LINK LIBRARY                              15100000
PDS2LJOB EQU   X'02' -        IF DCB OPERAND IN BLDL MACRO INTRUCTION   15200000
*                             WAS SPECIFIED AS ZERO, NAME WAS FOUND IN  15300000
*                             JOB LIBRARY                               15400000
DEZBYTE  EQU   PDS2LIBF --- ALIAS                                       15450000
.PDSX2   ANOP                                                           15460000
PDS2INDC DS    B -            INDICATOR BYTE                            15500000
PDS2ALIS EQU   BIT0 -         NAME IN THE FIELD PDS2NAME IS AN ALIAS    15600000
DEALIAS  EQU   BIT0 --- ALIAS FOR PDS2ALIS                              15650000
PDS2NTTR EQU   BIT1+BIT2 -    NUMBER OF TTR'S IN THE USER DATA FIELD    15700000
PDS2LUSR EQU   BIT3+BIT4+BIT5+BIT6+BIT7 - LENGTH OF USER DATA FIELD     15800000
*                             IN HALF WORDS                             15900000
PDS2USRD DS    0C -           START OF VARIABLE LENGTH USER DATA FIELD  16000000
PDS2TTRT DS    CL3 -          TTR OF FIRST BLOCK OF TEXT                16100000
PDS2ZERO DS    C -            ZERO                                      16200000
PDS2TTRN DS    CL3 -          TTR OF NOTE LIST OR SCATTER/TRANSLATION   16300000
*                             TABLE.  USED FOR PROGRAM IN SCATTER LOAD  16400000
*                             FORMAT OR OVERLAY STRUCTURE ONLY.         16500000
PDS2NL   DS    FL1 -          NUMBER OF ENTRIES IN NOTE LIST FOR        16600000
*                             PROGRAM IN OVERLAY STRUCTURE         @L6C 16650000
PDS2ATR  DS    0BL2 -         TWO-BYTE PROGRAM ATTRIBUTE FIELD          16900000
PDS2ATR1 DS    B -            FIRST BYTE OF PROGRAM ATTRIBUTE FIELD     17000000
PDS2RENT EQU   BIT0 -         REENTERABLE                               17100000
DEREEN   EQU   BIT0 --- ALIAS FOR PDS2RENT                              17150000
PDS2REUS EQU   BIT1 -         REUSABLE                                  17200000
PDS2OVLY EQU   BIT2 -         IN OVERLAY STRUCTURE                      17300000
DEOVLY   EQU   BIT2 --- ALIAS FOR PDS2OVLY                              17350000
PDS2TEST EQU   BIT3 -         PROGRAM TO BE TESTED - TESTRAN            17400000
PDS2LOAD EQU   BIT4 -         ONLY LOADABLE                             17500000
DELODY   EQU   BIT4 --- ALIAS FOR PDS2LOAD                              17550000
PDS2SCTR EQU   BIT5 -         SCATTER FORMAT                            17600000
DESCAT   EQU   BIT5 --- ALIAS FOR PDS2SCTR                              17650000
PDS2EXEC EQU   BIT6 -         EXECUTABLE                                17700000
DEXCUT   EQU   BIT6 --- ALIAS FOR PDS2EXEC                              17750000
PDS21BLK EQU   BIT7 -         IF ZERO, PROGRAM CONTAINS MULTIPLE        17800000
*                             RECORDS WITH AT LEAST ONE BLOCK OF TEXT.  17900000
*                             IF ONE, PROGRAM CONTAINS NO RLD ITEMS AND 18000000
*                             ONLY ONE BLOCK OF TEXT.                   18100000
PDS2ATR2 DS    B -            SECOND BYTE OF PROGRAM ATTRIBUTE FIELD    18200000
PDS2FLVL EQU   BIT0 -         IF ONE, THE PROGRAM CANNOT BE PROCESSED   18250000
*                             BY THE E LEVEL OF THE LINKAGE EDITOR.     18300000
*                             IF OFF, THE PROGRAM CAN BE PROCESSED BY   18350000
*                             ANY LEVEL OF THE LINKAGE EDITOR OR THE    18400000
*                             BINDER.                                   18450000
PDS2ORG0 EQU   BIT1 -         ORIGIN OF FIRST BLOCK OF TEXT IS ZERO     18650000
PDS2EP0  EQU   BIT2 -         ENTRY POINT IS ZERO                       18700000
PDS2NRLD EQU   BIT3 -         PROGRAM CONTAINS NO RLD ITEMS             18750000
PDS2NREP EQU   BIT4 -         PROGRAM CANNOT BE REPROCESSED BY LINKAGE  18800000
*                             EDITOR OR BINDER.                         18850000
PDS2TSTN EQU   BIT5 -         PROGRAM CONTAINS TESTRAN SYMBOL CARDS     18900000
PDS2LEF  EQU   BIT6 -         PROGRAM CREATED BY LINKAGE EDITOR F       18950000
PDS2REFR EQU   BIT7 -         REFRESHABLE PROGRAM                       19000000
PDS2STOR DS    FL3 -          TOTAL CONTIGUOUS MAIN STORAGE REQUIREMENT 19700000
*                             OF PROGRAM                                19800000
PDS2FTBL DS    FL2 -          LENGTH OF FIRST BLOCK OF TEXT             19900000
PDS2EPA  DS    AL3 -          ENTRY POINT ADDRESS ASSOCIATED WITH       20000000
*                             MEMBER NAME OR WITH ALIAS NAME IF ALIAS   20100000
*                             INDICATOR IS ONE                          20200000
         DS    0AL3 -         LINKAGE EDITOR ASSIGNED ORIGIN OF FIRST   20250000
*                             BLOCK OF TEXT (OS USE OF FIELD)           20300000
PDS2FTBO DS    0BL3 -         FLAG BYTES (AOS USE OF FIELD)             20350000
PDS2FTB1 DS    B -            BYTE 1 OF PDS2FTBO                        20400000
PDSAOSLE EQU   BIT0 -         PROGRAM HAS BEEN PROCESSED BY AOS LINKAGE 20410000
*                             EDITOR                                    20420000
PDS2BIG  EQU   BIT1           THE LARGE PROGRAM OBJECT EXTENSTION       20430000
*                             EXISTS BECAUSE THIS PROGRAM REQUIRES AT   20440000
*                             LEAST 16M BYTES OF VIRTUAL STORAGE   @L7A 20450000
PDS2PAGA EQU   BIT2 -         PAGE ALIGNMENT REQUIRED FOR PROGRAM       20453900
PDS2SSI  EQU   BIT3 -         SSI INFORMATION PRESENT                   20457800
PDSAPFLG EQU   BIT4 -         INFORMATION IN PDSAPF IS VALID            20461700
PDS2PGMO EQU   BIT5           PROGRAM OBJECT. THE PDS2FTB3              20465600
*                             FIELD IS VALID AND CONTAINS ADDITIONAL    20469500
*                             FLAGS                                @L7A 20473400
PDS2LFMT EQU   PDS2PGMO       ALTERNATE NAME FOR PDS2PGMO          @L7A 20475300
PDS2FTB2 DS    B -            BYTE 2 OF PDS2FTBO                        20477300
PDS2ALTP EQU   BIT0           ALTERNATE PRIMARY FLAG. IF ON (FOR A @L8A 20478000
*                             PRIMARY NAME), INDICATES THE PRIMARY @L8A 20478700
*                             NAME WAS GENERATED BY THE BINDER.    @L8A 20479400
*                             CAN ONLY BE ON FOR PROGRAM OBJECT.   @L8A 20480100
*                             CANNOT BE ON FOR ALIAS NAME          @L8A 20480800
PDSLRMOD EQU   BIT3           PROGRAM RESIDENCE MODE               @L6A 20481700
PDSAAMOD EQU   BIT4+BIT5      ALIAS ENTRY POINT ADDRESSING MODE    @L6A 20483400
PDSMAMOD EQU   BIT6+BIT7      MAIN ENTRY POINT ADDRESSING MODE     @L6A 20485100
PDS2RLDS DS    0XL1           NUMBER OF RLD/CONTROL RECORDS WHICH  @L6A 20485900
*                             FOLLOW THE FIRST BLOCK OF TEXT       @L6A 20486700
PDS2FTB3 DS    B -            BYTE 3 OF PDS2FTBO                   @L7C 20487500
PDS2NMIG EQU   BIT0           THIS PROGRAM OBJECT CANNOT BE CONVERTED   20488300
*                             TO A LOAD MODULE                     @L7A 20489100
PDS2PRIM EQU   BIT1           FETCHOPT PRIME WAS SPECIFIED         @L7A 20489900
PDS2PACK EQU   BIT2           FETCHOPT PACK WAS SPECIFIED          @L7A 20490700
PDSBCEND EQU   * -            END OF BASIC SECTION                      20492000
PDSBCLN  EQU   PDSBCEND-PDS2 - LENGTH OF BASIC SECTION                  20494000
         SPACE 2                                                        20496000
*        THE FOLLOWING SECTION IS FOR PROGRAMS WITH SCATTER LOAD        20498000
         SPACE 1                                                        20498400
PDSS01   EQU   * -            START OF SCATTER LOAD SECTION             20498800
PDS2SLSZ DS    FL2 -          NUMBER OF BYTES IN SCATTER LIST           20499200
PDS2TTSZ DS    FL2 -          NUMBER OF BYTES IN TRANSLATION TABLE      20499600
PDS2ESDT DS    CL2 -          IDENTIFICATION OF ESD ITEM (ESDID) OF     20499700
*                             CONTROL SECTION TO WHICH FIRST BLOCK OF   20499800
*                             TEXT BELONGS                              20499900
PDS2ESDC DS    CL2 -          IDENTIFICATION OF ESD ITEM (ESDID) OF     20533200
*                             CONTROL SECTION CONTAINING ENTRY POINT    20543200
PDSS01ND EQU   * -            END OF SCATTER LOAD SECTION               20553200
PDSS01LN EQU   PDSS01ND-PDSS01 - LENGTH OF SCATTER LOAD SECTION         20563200
         SPACE 2                                                        20566700
*        THE FOLLOWING SECTION IS FOR PROGRAMS WITH ALIAS NAMES         20600000
         SPACE 1                                                        20800000
PDSS02   EQU   * -            START OF ALIAS SECTION                    20850000
PDS2EPM  DS    AL3 -          ENTRY POINT FOR MEMBER NAME               20900000
DEENTBK  EQU   PDS2EPM --- ALIAS                                        20950000
PDS2MNM  DS    CL8 -          MEMBER NAME OF PROGRAM. WHEN THE          21000000
*                             FIRST FIELD (PDS2NAME) IS AN ALIAS NAME,  21010000
*                             THIS FIELD CONTAINS THE ORIGINAL NAME OF  21020000
*                             THE MEMBER EVEN AFTER THE MEMBER HAS      21030000
*                             BEEN RENAMED.                             21040000
PDSS02ND EQU   * -            END OF ALIAS SECTION                      21050000
PDSS02LN EQU   PDSS02ND-PDSS02 - LENGTH OF ALIAS SECTION                21060000
         SPACE 2                                                        21070000
*        THE FOLLOWING SECTION IS FOR SSI INFORMATION AND IS ON         21080000
*        A HALF-WORD BOUNDARY                                           21090000
         SPACE 1                                                        21092000
PDSS03   DS    0H -           FORCE HALF-WORD ALIGNMENT FOR SSI         21094000
*                             SECTION                                   21096000
PDSSSIWD DS    0CL4 -         SSI INFORMATION WORD                      21098000
PDSCHLVL DS    FL1 -          CHANGE LEVEL OF MEMBER                    21098400
PDSSSIFB DS    B -            SSI FLAG BYTE                             21098800
PDSFORCE EQU   BIT1 -         A FORCE CONTROL CARD WAS USED WHEN        21099200
*                             EXECUTING THE IHGUAP PROGRAM              21099600
PDSUSRCH EQU   BIT2 -         A CHANGE WAS MADE TO MEMBER BY THE        21099700
*                             INSTALLATION, AS OPPOSED TO AN            21099800
*                             IBM-DISTRIBUTED CHANGE                    21099900
PDSEMFIX EQU   BIT3 -         SET WHEN AN EMERGENCY IBM-AUTHORIZED      21133200
*                             PROGRAM 'FIX' IS MADE, AS OPPOSED TO      21143200
*                             CHANGES THAT ARE INCLUDED IN AN           21153200
*                             IBM-DISTRIBUTED MAINTENANCE PACKAGE       21163200
PDSDEPCH EQU   BIT4 -         A CHANGE MADE TO THE MEMBER IS DEPENDENT  21165200
*                             UPON A CHANGE MADE TO SOME OTHER MEMBER   21165600
*                             IN THE SYSTEM                             21166000
PDSSYSGN EQU   BIT5+BIT6 -    FLAGS THAT INDICATE WHETHER OR NOT A      21166400
*                             CHANGE TO THE MEMBER WILL NECESSITATE A   21166500
*                             PARTIAL OR COMPLETE REGENERATION OF THE   21166600
*                             SYSTEM                                    21177700
PDSNOSGN EQU   X'00' -        NOT CRITICAL FOR SYSTEM GENERATION        21187700
PDSCMSGN EQU   BIT6 -         MAY REQUIRE COMPLETE REGENERATION         21188100
PDSPTSGN EQU   BIT5 -         MAY REQUIRE PARTIAL REGENERATION          21188500
PDSIBMMB EQU   BIT7 -         MEMBER IS SUPPLIED BY IBM                 21188600
PDSMBRSN DS    CL2 -          MEMBER SERIAL NUMBER                      21188700
PDSS03ND EQU   * -            END OF SSI SECTION                        21188800
PDSS03LN EQU   PDSS03ND-PDSS03 - LENGTH OF SSI SECTION                  21192500
         SPACE 2                                                        21194500
*        THE FOLLOWING SECTION IS FOR APF INFORMATION                 * 21194900
         SPACE 1                                                        21195300
PDSS04   EQU   * -            START OF APF SECTION                      21195700
PDSAPF   DS    0CL2 -         PROGRAM AUTHORIZATION FACILITY (APF)      21196100
*                             FIELD                                     21196200
PDSAPFCT DS    FL1 -          LENGTH OF PROGRAM AUTHORIZATION CODE      21222100
*                             (PDSAPFAC) IN BYTES                       21272100
PDSAPFAC DS    C -            PROGRAM AUTHORIZATION CODE                21322100
PDSS04ND EQU   * -            END OF APF SECTION                        21372100
PDSS04LN EQU   PDSS04ND-PDSS04 - LENGTH OF APF SECTION                  21422100
         SPACE 2                                                   @L7A 21472100
*        THE FOLLOWING SECTION IS FOR LARGE (16M OR LARGER) PROGRAM@L7A 21505400
*                      OBJECTS                                     @L7A 21538700
         SPACE 1                                                   @L7A 21572100
PDSLPO   EQU   *              START OF LARGE PROGRAM OBJECT SECTION@L7A 21605400
PDSLLM   EQU   PDSLPO         ALTERNATE NAME FOR PDSLPO            @L7A 21638700
PDS2LPOL DS    FL1 -          LARGE PROGRAM OBJECT SECTION LENGTH  @L7A 21672000
         ORG   PDS2LPOL                                            @L7A 21705300
PDS2LLML DS    FL1 -          ALTERNATE NAME FOR PDS2LLML          @L7A 21738600
PDS2VSTR DS    FL4 -          VIRTUAL STORAGE REQUIREMENT FOR THIS      21772100
*                             PROGRAM                              @L7A 21822100
PDS2MEPA DS    FL4 -          MAIN ENTRY POINT OFFSET                   21872100
PDS2AEPA DS    FL4 -          ALIAS ENTRY POINT OFFSET. ONLY VALID      21922100
*                             IF THIS IS A DIRECTORY ENTRY FOR AN       21972100
*                             ALIAS                                @L7A 22022100
PDSLPOND EQU   * -            END OF LARGE PROGRAM OBJECT SECTION       22072100
PDSLLMND EQU   PDSLPOND       ALTERNATE NAME FOR PDSLPOND               22122100
PDSLPOLN EQU   PDSLPOND-PDSLPO  LENGTH OF LLM SECTION              @L7A 22172100
PDSLLMLN EQU   PDSLPOLN       ALTERNATE NAME FOR PDSLPOLN          @L7A 22222100
         MEND  , */                                                     22900000
*%PDSL2  :  ;                                                           23000000
*                                                                       26600000
*DECLARE                                                                40600000
*  1 PDS2     BASED(PDS2PTR) BDY(HWORD),                                40700000
*                                                                       40800000
*   2 PDS2NAME    CHAR(8),               /* MEMBER NAME OR ALIAS NAME*/ 40850000
*   2 PDS2TTRP    CHAR(3),               /* TTR OF FIRST BLOCK OF       41100000
*                                           NAMED MEMBER             */ 41200000
*%IF PDSBLDL='NO'  %THEN                                                41250000
*   %GOTO PDSX2;                                                        41260000
*   2 PDS2CNCT    PTR(8),                /* CONCATENATION NUMBER OF     41300000
*                                           THE DATA SET             */ 41400000
*   2 PDS2LIBF    CHAR(1),               /* LIBRARY FLAG FIELD       */ 41500000
*%DCL PDS2LNRM CHAR;                                                    41600000
*%PDS2LNRM='''00''X';                    /* NORMAL CASE              */ 41700000
*%DCL PDS2LLNK CHAR;                                                    41800000
*%PDS2LLNK='''01''X';                    /* IF DCB OPERAND IN BLDL      41900000
*                                           MACRO INTRUCTION  WAS       42000000
*                                           SPECIFIED AS ZERO, NAME     42100000
*                                           WAS FOUND IN  LINK          42200000
*                                           LIBRARY                  */ 42300000
*%DCL PDS2LJOB CHAR;                                                    42400000
*%PDS2LJOB='''02''X';                    /* IF DCB OPERAND IN BLDL      42500000
*                                           MACRO INTRUCTION  WAS       42600000
*                                           SPECIFIED AS ZERO, NAME     42700000
*                                           WAS FOUND IN  JOB           42800000
*                                           LIBRARY                  */ 42900000
*%PDSX2 : ;                                                             42950000
*   2 PDS2INDC    CHAR(1),               /* INDICATOR BYTE           */ 43000000
*    3 PDS2ALIS BIT(1),                  /* NAME IN THE PDS2NAME FIELD  43100000
*                                           IS AN ALIAS              */ 43200000
*    3 PDS2NTTR BIT(2),                  /* NUMBER OF TTR'S IN THE      43300000
*                                           USER DATA FIELD          */ 43400000
*    3 PDS2LUSR BIT(5),                  /* LENGTH OF USER DATA         43500000
*                                           FIELD IN HALF WORDS      */ 43600000
*   2 PDS2TTRT    CHAR(3),               /* TTR OF FIRST BLOCK OF       43700000
*                                           TEXT                     */ 43800000
*    3 PDS2USRD    CHAR(1),              /* START OF VARIABLE LENGTH    43900000
*                                           USER DATA FIELD          */ 44000000
*   2 PDS2ZERO    CHAR(1),               /* ZERO                     */ 44100000
*   2 PDS2TTRN    CHAR(3),               /* TTR OF NOTE LIST OR         44200000
*                                           SCATTER/TRANSLATION         44300000
*                                           TABLE. USED FOR PROGRAMS    44400000
*                                           IN SCATTER LOAD  FORMAT     44500000
*                                           OR OVERLAY STRUCTURE        44600000
*                                           ONLY.                    */ 44700000
*   2 PDS2NL      PTR(8),                /* NUMBER OF ENTRIES IN        44800000
*                                           NOTE LIST FOR  PROGRAMS     44900000
*                                           IN OVERLAY STRUCTURE,       45000000
*                                           OTHERWISE ZERO           */ 45100000
*   2 PDS2ATR     CHAR(2),               /* TWO-BYTE PROGRAM            45200000
*                                           ATTRIBUTE FIELD          */ 45300000
*    3 PDS2ATR1    BIT(8),               /* FIRST BYTE OF PROGRAM       45400000
*                                           ATTRIBUTE FIELD          */ 45500000
*     4 PDS2RENT BIT(1),                 /* REENTERABLE              */ 45600000
*     4 PDS2REUS BIT(1),                 /* REUSABLE                 */ 45700000
*     4 PDS2OVLY BIT(1),                 /* IN OVERLAY STRUCTURE     */ 45800000
*     4 PDS2TEST BIT(1),                 /* PROGRAM TO BE TESTED -      45900000
*                                           TESTRAN                  */ 46000000
*     4 PDS2LOAD BIT(1),                 /* ONLY LOADABLE            */ 46100000
*     4 PDS2SCTR BIT(1),                 /* SCATTER FORMAT           */ 46200000
*     4 PDS2EXEC BIT(1),                 /* EXECUTABLE               */ 46300000
*     4 PDS21BLK BIT(1),                 /* IF ZERO, PROGRAM CONTAINS   46400000
*                                           MULTIPLE RECORDS WITH AT    46500000
*                                           LEAST ONE BLOCK OF TEXT.    46600000
*                                           IF ONE, PROGRAM             46700000
*                                           CONTAINS NO RLD ITEMS       46800000
*                                           AND  ONLY ONE BLOCK OF      46900000
*                                           TEXT.                    */ 47000000
*    3 PDS2ATR2    BIT(8),               /* SECOND BYTE OF PROGRAM      47100000
*                                           ATTRIBUTE FIELD          */ 47200000
*     4 PDS2FLVL BIT(1),                 /* IF ONE, THE PROGRAM CANNOT  47250000
*                                           BE PROCESSED BY THE E-LEVEL 47300000
*                                           OF THE LINKAGE EDITOR.      47350000
*                                           IF OFF, THE PROGRAM CAN BE  47400000
*                                           PROCESSED BY ANY LEVEL OF   47450000
*                                           THE LINKAGE EDITOR OR THE   47500000
*                                           BINDER.                  */ 47550000
*     4 PDS2ORG0 BIT(1),                 /* ORIGIN OF FIRST  BLOCK      47850000
*                                           OF TEXT IS ZERO.         */ 48100000
*     4 PDS2EP0  BIT(1),                 /* ENTRY POINT IS ZERO      */ 48150000
*     4 PDS2NRLD BIT(1),                 /* PROGRAM CONTAINS NO RLD     48200000
*                                           ITEMS                    */ 48500000
*     4 PDS2NREP BIT(1),                 /* PROGRAM CANNOT BE           48600000
*                                           REPROCESSED BY LINKAGE      48700000
*                                           EDITOR OR BINDER         */ 48800000
*     4 PDS2TSTN BIT(1),                 /* PROGRAM CONTAINS TESTRAN    48900000
*                                           SYMBOL CARDS             */ 49000000
*     4 PDS2LEF  BIT(1),                 /* PROGRAM CREATED BY          49100000
*                                           LINKAGE EDITOR F         */ 49200000
*     4 PDS2REFR BIT(1),                 /* REFRESHABLE PROGRAM      */ 49300000
*   2 PDS2STOR    PTR(24)  BDY(HWORD),   /* TOTAL CONTIGUOUS MAIN       49400000
*                                           STORAGE REQUIREMENT OF      49500000
*                                           PROGRAM                  */ 49600000
*   2 PDS2FTBL    FIXED(15) BDY(HWORD,2),/* LENGTH OF FIRST BLOCK OF    49700000
*                                           TEXT                     */ 49800000
*   2 PDS2EPA     PTR(24)  BDY(HWORD,2), /* ENTRY POINT ADDRESS         49900000
*                                           ASSOCIATED WITH  MEMBER     50000000
*                                           NAME OR WITH ALIAS NAME     50100000
*                                           IF ALIAS  INDICATOR IS      50200000
*                                           ONE                      */ 50300000
*   2 *           PTR(24)  BDY(HWORD),   /* LINKAGE EDITOR ASSIGNED     50350000
*                                           ORIGIN OF FIRST BLOCK OF    50400000
*                                           TEXT (OS USE OF FIELD)   */ 50450000
*    3 PDS2FTBO    CHAR(3),              /* FLAG BYTES (AOS USE OF      50500000
*                                           FIELD)                   */ 50550000
*     4 PDS2FTB1    BIT(8),              /* BYTE 1 OF PDS2FTBO       */ 50600000
*      5 PDSAOSLE BIT(1),                /* PROGRAM HAS BEEN PROCESSED  50610000
*                                           BY AOS LINKAGE EDITOR    */ 50616200
*      5 PDS2BIG  BIT(1),                /* THE LARGE PROGRAM OBJECT    50622400
*                                           EXTENSION (LPO) EXISTS      50628600
*                                           BECAUSE THIS MODULE         50634800
*                                           REQUIRES AT LEAST 16M BYTES 50643200
*                                           OF VIRTUAL STORAGE   @L7A*/ 50651600
*      5 PDS2PAGA BIT(1),                /* PAGE ALIGNMENT REQUIRED     50660000
*                                           FOR PROGRAM              */ 50670800
*      5 PDS2SSI  BIT(1),                /* SSI INFORMATION PRESENT  */ 50681600
*      5 PDSAPFLG BIT(1),                /* INFORMATION IN PDSAPF IS    50692400
*                                           VALID                    */ 50692600
*      5 PDS2PGMO BIT(1),                /* PROGRAM OBJECT.             50692800
*                                           THE PDS2FTB3 FIELD IS VALID 50693000
*                                           AND CONTAINS ADDITIONAL     50693200
*                                           FLAGS                @L7A*/ 50693400
*        7 PDS2LFMT BIT(1),              /* ALTERNATE NAME FOR PDSEPGMO 50693500
*                                                                @L7A*/ 50693600
*      5 *        BIT(2),                /* RESERVED             @L7C*/ 50693700
*     4 PDS2FTB2    CHAR(1),             /* BYTE 2 OF PDS2FTBO       */ 50693800
*      5 PDS2ALTP BIT(1),                /* ALTERNATE PRIMARY FLAG. IF  50693900
*                                           ON FOR A PRIMARY NAME,      50694000
*                                           INDICATES THE PRIMARY       50694100
*                                           NAME WAS GENERATED BY THE   50694200
*                                           BINDER. CAN ONLY BE ON FOR  50694300
*                                           A PRIMARY NAME OF A PROGRAM 50694400
*                                           OBJECT.              @L8A*/ 50694500
*      5 *        BIT(2),                /* RESERVED             @L8C*/ 50694600
*      5 PDSLRMOD BIT(1),                /* PROGRAM RESIDENCE MODE      50694700
*                                                                @L6A*/ 50694900
*      5 PDSAAMOD BIT(2),                /* ALIAS ENTRY POINT           50695200
*                                           ADDRESSING MODE      @L6A*/ 50695500
*      5 PDSMAMOD BIT(2),                /* MAIN ENTRY POINT            50695800
*                                           ADDRESSING MODE      @L6A*/ 50696100
*     4 PDS2RLDS FIXED(8),               /* NUMBER OF RLD/CONTROL       50696400
*                                           RECORDS WHICH FOLLOW THE    50696700
*                                           FIRST TEXT BLOCK     @L6C*/ 50696800
*      5 PDS2FTB3 CHAR(1),               /* BYTE 3 OF PDS2FTBO   @L7C*/ 50696900
*       7 PDS2NMIG BIT(1),               /* THIS PROGRAM OBJECT         50697000
*                                           CANNOT BE CONVERTED         50697100
*                                           TO A LOAD MODULE     @L7A*/ 50697200
*       7 PDS2PRIM BIT(1),               /* FETCHOPT PRIME WAS          50697300
*                                           SPECIFIED            @L7A*/ 50697400
*       7 PDS2PACK BIT(1),               /* FETCHOPT PACK WAS           50697500
*                                           SPECIFIED            @L7A*/ 50697600
*   2 PDSBCEND    CHAR(0);               /* END OF BASIC SECTION     */ 50698000
*                                                                       51000000
*                                                                       51500000
* /*     THE FOLLOWING SECTION IS FOR PROGRAMS WITH SCATTER LOAD     */ 51550000
*                                                                       51700000
*DECLARE                                                                51800000
*  1 PDSS01   BASED(PDSPTRV)  BDY(BYTE),                                51900000
*   2 PDS2SLSZ    FIXED(15) BDY(BYTE),   /* NUMBER OF BYTES IN          52000000
*                                           SCATTER LIST             */ 52100000
*   2 PDS2TTSZ    FIXED(15) BDY(BYTE),   /* NUMBER OF BYTES IN          52200000
*                                           TRANSLATION TABLE        */ 52300000
*   2 PDS2ESDT    CHAR(2),               /* IDENTIFICATION OF ESD       52400000
*                                           ITEM (ESDID) OF  CONTROL    52500000
*                                           SECTION TO WHICH FIRST      52600000
*                                           BLOCK OF  TEXT BELONGS   */ 52700000
*   2 PDS2ESDC    CHAR(2),               /* IDENTIFICATION OF ESD       52800000
*                                           ITEM (ESDID) OF  CONTROL    52900000
*                                           SECTION CONTAINING ENTRY    53000000
*                                           POINT                    */ 53100000
*   2 PDSS01ND    CHAR(0);               /* END OF SCATTER LOAD         53150000
*                                           SECTION                  */ 53160000
*                                                                       53170000
*                                                                       53200000
* /*     THE FOLLOWING SECTION IS FOR PROGRAMS WITH ALIAS NAMES      */ 53250000
*                                                                       53500000
*DECLARE                                                                53550000
*  1 PDSS02   BASED(PDSPTRV)  BDY(BYTE),                                53560000
*   2 PDS2EPM     PTR(24)  BDY(BYTE),    /* ENTRY POINT FOR MEMBER      53600000
*                                           NAME                     */ 53700000
*   2 PDS2MNM     CHAR(8),               /* MEMBER NAME OF PROGRAM.     53800000
*                                           WHEN THE FIRST              53900000
*                                           FIELD (PDS2NAME) IS AN      53906000
*                                           ALIAS NAME, THIS FIELD      53912000
*                                           CONTAINS THE ORIGINAL       53918000
*                                           NAME OF THE MEMBER EVEN     53924000
*                                           AFTER THE MEMBER HAS BEEN   53930000
*                                           RENAMED.                 */ 53940000
*   2 PDSS02ND    CHAR(0);               /* END OF ALIAS SECTION     */ 53950000
*                                                                       54000000
*                                                                       54050000
* /*     THE FOLLOWING SECTION IS FOR SSI INFORMATION AND IS ON         54100000
*        A HALF-WORD BOUNDARY                                        */ 54150000
*                                                                       54200000
*DECLARE                                                                54250000
*  1 PDSS03   BASED(PDSPTRV)  BDY(HWORD),                               54300000
*   2 PDSSSIWD    CHAR(4),               /* SSI INFORMATION WORD     */ 54350000
*    3 PDSCHLVL    PTR(8),               /* CHANGE LEVEL OF MEMBER   */ 54400000
*    3 PDSSSIFB    BIT(8),               /* SSI FLAG BYTE            */ 54450000
*     4 *        BIT(1),                 /* RESERVED                 */ 54500000
*     4 PDSFORCE BIT(1),                 /* A FORCE CONTROL CARD WAS    54550000
*                                           USED WHEN EXECUTING THE     54600000
*                                           IHGUAP PROGRAM           */ 54650000
*     4 PDSUSRCH BIT(1),                 /* A CHANGE WAS MADE TO        54700000
*                                           MEMBER BY THE               54750000
*                                           INSTALLATION, AS OPPOSED    54800000
*                                           TO AN IBM-DISTRIBUTED       54850000
*                                           CHANGE                   */ 54900000
*     4 PDSEMFIX BIT(1),                 /* SET WHEN AN EMERGENCY       54950000
*                                           IBM-AUTHORIZED PROGRAM      55000000
*                                           'FIX' IS MADE, AS OPPOSED   55050000
*                                           TO CHANGES THAT ARE         55100000
*                                           INCLUDED IN AN IBM-         55150000
*                                           DISTRIBUTED MAINTENANCE     55200000
*                                           PACKAGE                  */ 55250000
*     4 PDSDEPCH BIT(1),                 /* A CHANGE MADE TO THE        55300000
*                                           MEMBER IS DEPENDENT UPON    55350000
*                                           A CHANGE MADE TO SOME       55400000
*                                           OTHER MEMBER IN SYSTEM   */ 55450000
*     4 PDSSYSGN BIT(2),                 /* FLAGS THAT INDICATE         55500000
*                                           WHETHER OR NOT A CHANGE     55550000
*                                           TO THE MEMBER WILL          55600000
*                                           NECESSITATE A PARTIAL OR    55650000
*                                           COMPLETE REGENERATION OF    55700000
*                                           THE SYSTEM               */ 55750000
*%PDSNOSGN='''00''B';                    /* NOT CRITICAL FOR SYSTEM     55800000
*                                           GENERATION               */ 55850000
*%PDSCMSGN='''01''B';                    /* MAY REQUIRE COMPLETE        55900000
*                                           REGENERATION             */ 55950000
*%PDSPTSGN='''10''B';                    /* MAY REQUIRE PARTIAL         56000000
*                                           REGENERATION             */ 56050000
*     4 PDSIBMMB BIT(1),                 /* MEMBER IS SUPPLIED BY IBM*/ 56100000
*    3 PDSMBRSN    CHAR(2),              /* MEMBER SERIAL NUMBER     */ 56150000
*   2 PDSS03ND    CHAR(0);               /* END OF SSI SECTION       */ 56200000
*                                                                       56250000
*                                                                       56300000
* /*     THE FOLLOWING SECTION IS FOR APF INFORMATION                */ 56350000
*                                                                       56400000
*DECLARE                                                                56450000
*  1 PDSS04   BASED(PDSPTRV)  BDY(BYTE),                                56500000
*   2 PDSAPF      CHAR(2),               /* PROGRAM AUTHORIZATION       56550000
*                                           FACILITY (APF) FIELD        56600000
*                                                                    */ 56650000
*    3 PDSAPFCT    PTR(8),               /* LENGTH OF PROGRAM           56700000
*                                           AUTHORIZATION CODE          56750000
*                                           (PDSAPFAC) IN BYTES         56800000
*                                                                    */ 56850000
*    3 PDSAPFAC    CHAR(1),              /* PROGRAM AUTHORIZATION       56900000
*                                           CODE                     */ 56950000
*   2 PDSS04ND    CHAR(0);               /* END OF APF SECTION       */ 57000000
*                                                                       57050000
* /*    THE FOLLOWING SECTION (LPO) IS FOR LARGE (16M OR LARGER)        57083300
*       PROGRAM OBJECTS                                          @L7A*/ 57116600
*                                                                       57150000
*DECLARE                                                                57200000
*  1 PDSLPO   BASED(PDSPTRV)  BDY(BYTE), /* LARGE PROGRAM OBJECT        57218700
*                                           SECTION              @L7A*/ 57237400
*   2 PDSLLM,                            /* ALTERNATE NAME FOR PDSLPO   57256100
*                                                                @L7A*/ 57274800
*    3 PDS2LPOL    FIXED(8),             /* SECTION LENGTH       @L7A*/ 57293500
*      5 PDS2LLML  FIXED(8),             /* ALTERNATE NAME FOR          57312200
*                                           PDS2LPOL             @L7A*/ 57330900
*    3 PDS2VSTR    FIXED(32) BDY(BYTE),  /* VIRTUAL STORAGE REQUIREMENT 57350000
*                                           FOR THIS PROGRAM     @L7A*/ 57400000
*    3 PDS2MEPA    FIXED(32) BDY(BYTE),  /* MAIN ENTRY POINT OFFSET     57450000
*                                                                @L7A*/ 57500000
*    3 PDS2AEPA    FIXED(32) BDY(BYTE),  /* ALIAS ENTRY POINT OFFSET.   57512500
*                                           ONLY VALID IF THIS IS A     57525000
*                                           DIRECTORY ENTRY FOR AN      57537500
*                                           ALIAS                @L7A*/ 57550000
*   2 PDSLPOND    CHAR(0),               /* END OF LARGE PROGRAM OBJECT 57562500
*                                           SECTION              @L7A*/ 57575000
*     3 PDSLLMND    CHAR(0);             /* ALTERNATE NAME FOR PDSLPOND 57587500
*                                                                @L7A*/ 57600000
