*                                                                       00050002
*        %GOTO PCCAL1;  /*                                              00100002
         MACRO                                                          00150002
         IHAPCCA &DSECT=YES   */                                        00200002
*%PCCAL1 : ;                                                            00250002
*                                                                       00300002
*/* START OF SPECIFICATIONS **************************************** */ 00350000
*/*                                                                  */ 00400002
*/*01* DESCRIPTIVE NAME: PHYSICAL CONFIGURATION COMMUNICATION AREA   */ 00433300
*/*02*  ACRONYM:  PCCA                                               */ 00466600
*/*                                                                  */ 00500002
*/*01* MACRO-NAME:  IHAPCCA                                          */ 00550000
*/*                                                                  */ 00600002
*/*01* DSECT-NAME:  PCCA                                             */ 00601900
*/*                                                                  */ 00603800
*/*01* COMPONENT = RECONFIGURATION (SC1CZ)                           */ 00605700
*/*                                                                  */ 00607600
*/*01* PROPRIETARY STATEMENT =                                       */ 00609500
*/*      5647-A01                                                    */ 00611500
*/*      THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                */ 00613500
*/*      (C) COPYRIGHT IBM CORPORATION. 1980, 2000                   */ 00618000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00622500
*/*                                                                  */ 00636000
*/*01* STATUS = HBB7703                                              */ 00640500
*/*                                                                  */ 00645000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00679100
*/*02* DMTI: BASE                                                    */ 00713200
*/*02* PSPI: FIELDS PCCACAFM PCCACPID PCCACPUA                       */ 00747300
*/*02* GUPI: TOKEN                                                   */ 00781400
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00815500
*/*                                                                  */ 00850002
*/*01* EYE-CATCHER: PCCA                                             */ 00850100
*/*02*  OFFSET:  0                                                   */ 00850200
*/*02*  LENGTH:  4                                                   */ 00850300
*/*                                                                  */ 00850400
*/*01* STORAGE ATTRIBUTES:                                           */ 00850500
*/*02*  SUBPOOL: 245                                                 */ 00850600
*/*02*  KEY: 0                                                       */ 00850700
*/*                                                                  */ 00850800
*/*01* SIZE:  584 BYTES                                          @03C*/ 00850900
*/*                                                                  */ 00851000
*/*01* CREATED BY:                                                   */ 00851100
*/*     IEAVNIP0                                                     */ 00851200
*/*     IEEVCPR                                                      */ 00851300
*/*                                                                  */ 00851400
*/*01* POINTED TO BY:                                                */ 00851500
*/*     PCCAV... field of the PCCAVT data area                       */ 00851600
*/*     PSAPCCAV field of the PSA data area                          */ 00851700
*/*     PSAPCCAR field of the PSA data area                          */ 00851800
*/*     PCCAEMSA field of the PCCA data area (receiving routine)     */ 00851900
*/*                                                                  */ 00852000
*/*01* SERIALIZATION:  DISABLEMENT                                   */ 00852100
*/*                                                                  */ 00852200
*/*01* FUNCTION:                                                     */ 00852300
*/*02*  CONTAINS INFORMATION ABOUT THE PHUSICAL FACILITIES           */ 00852400
*/*     ASSOCIATED WITH EACH PROCESSOR IN THE SYSTEM                 */ 00852500
*/*                                                                  */ 00852600
*/*01* PURPOSE: PROVIDE DATA MAPPING OF THE PCCA                     */ 00852700
*/*                                                                  */ 00852800
*/*01* METHOD OF ACCESS                                              */ 00852900
*/*02*  ASM:                                                         */ 00853000
*/*             DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 00853100
*/*             USING ON PCCA GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 00853200
*/*02*  PL/S:                                                        */ 00853300
*/*             DCL PCCAPTR PTR(31)                          @G860P22*/ 00853400
*/*                                                                  */ 00853500
*/*01* DISTRIBUTION LIBRARY: AMODGEN                                 */ 00853600
*/*                                                                  */ 00853700
*/*01* CHANGE ACTIVITY                                               */ 00853800
*/*      $L1=PFA      JBB1326 801001 PD22: PAGE FAULT ASSIST     @L1A*/ 00857600
*/*      @G860P22 -   MVS/SP 2.1 (HBB2102)                   @G860P22*/ 00861400
*/*      $H1=ADVPROC2 JBB2133 820901 PD22: AXP                   @H1A*/ 00865200
*/*      $P1=PAE0033  JBB2133 830630 PD22: CORRECT ASM PCCAXSLF, @P1A*/ 00869000
*/*                                        PCCARSPR              @P1A*/ 00872800
*/*      $D1=DCRR0045 JBB2133 840201 PD22: MOVE PCCA TO AMODGEN  @D1A*/ 00876600
*/*      $01=OZ79071  HBB2102 840813 PDXU: CHANGE DLIB           @01A*/ 00880400
*/*                                        TO AMODGEN            @01A*/ 00884200
*/*      $02=OZ90320  JBB2133 850815 PD1V: SIMULATED MALFUNCTION @02A*/ 00888000
*/*                                        ALERT                 @02A*/ 00891800
*/*      $L2=CLOCK    HBB4410 870908 PDU6: ETR support.          @L2A*/ 00893700
*/*      $D2=DCRR0021 HBB4410 880404 PDXM: Add PCCAACRN. Support @D2A*/ 00894300
*/*                                        message IEA796E.      @D2A*/ 00894900
*/*      $P2=PEO0203  HBB4410 880411 PDXM: Correct PLS PCCAKSCF. @P2C*/ 00895000
*/*      $D3=DCR0196  HBB4410 890717 PDEH: Console Integration.  @D3A*/ 00895100
*/*                                        RPSGNL STOPCP support @D3A*/ 00895200
*/*      $P3=PEO4494  HBB4410 900613 PDAA: Change program number @P3A*/ 00895400
*/*      $03=OW02630  HBB5510 940228 PDHC: Trap flag and data.   @03A*/ 00895700
*/*                                        (TRSQ for PIG5147).   @03A*/ 00896000
*/*      $L3=64BITRCF HBB7703 981204 PD00XB: ESAME               @L3A*/ 00896100
*/*      $L4=LPAR_RCF HBB7703 991130 PD00XB: PCCACWLM            @L4A*/ 00896200
*/*                                                                  */ 00896300
*/*01* NOTES:                                                        */ 00896600
*/*      THE PCCA CONTROL BLOCK DUMP FORMATTER MODEL SHOULD BE       */ 00897200
*/*      UPDATED WHENEVER THE MAPPING FOR THE PCCA IS CHANGED.       */ 00898000
*/*                                                                  */ 00898800
*/* END OF SPECIFICATIONS ****************************************** */ 00924400
*%GOTO PCCAL2;  /*                                                      00950002
         SPACE 1                                                        01000002
         AIF   ('&DSECT' EQ 'NO').PCCA010                               01050002
PCCA     DSECT                                                          01100002
         AGO   .PCCA020                                                 01150002
.PCCA010 ANOP                                                           01200002
         DS    0D                                                       01250002
PCCA     EQU   *                                                        01300002
.PCCA020 ANOP                                                           01350002
PCCAPCCA DC    CL4'PCCA' -    CONTROL BLOCK ACRONYM IN EBCDIC           01400002
PCCACPID DC    XL12'00' -     CPU ID (CONTAINS SERIAL NUMBER)           01450002
PCCACPUA DC    H'0' -         PHYSICAL CPU ADDRESS                      01500002
PCCACAFM DC    H'0' -         BIT MASK CORRESPONDING TO PHYSICAL CPU    01550002
*                             ADDRESS                                   01600002
PCCATQEP DC    A(0) -         TQE POINTER                               01650002
PCCAPSAV DC    A(0) -         VIRTUAL ADDRESS OF PSA                    01700002
PCCAPSAR DC    A(0) -         ABSOLUTE ADDRESS OF PSA                   01706600
PCCAISCE DC    X'00' -        INTERRUPT SUB-CLASSES TO ENABLE  @G860P22 01713200
PCCAMCHF DS    0BL3 -         MACHINE CHECK FLAGS                  @D2C 01715800
         DC    XL1'00'                                             @L2A 01718400
PCCASMCH EQU   X'80' -        A SOFTWARE-SIMULATED MACHINE CHECK        01721000
*                             OCCURRED                             @L2A 01723600
PCCACRG6 DS    0F -           CONTROL REGISTER 6               @G860P22 01726400
PCCAISCM DC    X'00' -        INTERRUPTION SUBCLASS MASK       @G860P22 01733000
PCCACR6L DC    AL3(0) -       LOW-ORDER THREE BYTES OF CR 6    @G860P22 01739600
PCCASLIH DC    F'0' -         NUMBER OF ENTRIES TO THE I/O SLIH@G860PVB 01746200
PCCASTPI DC    F'0' -         NUMBER OF TPI WITH CC=1          @G860PVB 01752800
PCCAXSLF DC    F'0' -         EXCESSIVE SPIN LENGTH FACTOR.        @P1C 01759400
PCCARSPR DC    F'0' -         RELATIVE SPEED (X4096) OF THIS       @P1C 01766000
*                             PROCESSOR.                           @P1C 01772600
PCCATRW1 DS    0F -           TRAP WORD 1.  FLAG AND DATA,         @03A 01774800
*                             SET BY SCIXL.                        @03A 01777000
PCCATRDA DS    H -            TRAP DATA                            @03A 01779200
PCCATRFL DS    CL1 -          TRAP FLAG                            @03A 01781400
         DS    CL1 -          RESERVED                             @03A 01783600
PCCARV88 DS    A -            RESERVED                                  01785800
PCCARV89 DS    A -            RESERVED                                  01792400
PCCARV90 DS    A -            RESERVED                                  01799000
PCCARV91 DS    A -            RESERVED                                  01805600
PCCARV92 DS    A -            RESERVED                                  01812200
PCCARV93 DS    A -            RESERVED                                  01818800
PCCARV94 DS    A -            RESERVED                                  01825400
PCCARV95 DS    A -            RESERVED                                  01832000
PCCARV96 DS    A -            RESERVED                                  01838600
PCCARV97 DS    A -            RESERVED                                  01845200
PCCARV98 DS    A -            RESERVED                                  01851800
PCCARV99 DS    A -            RESERVED                                  01858400
PCCARV9A DS    A -            RESERVED                                  01865000
PCCARV9B DS    A -            RESERVED                                  01871600
PCCARV9C DS    A -            RESERVED                                  01878200
PCCARV9D DS    A -            RESERVED                                  01884800
PCCARV9E DS    A -            RESERVED                                  01891400
PCCATMST DS    0BL4 -         TIMER STATUS BYTES                        01900002
PCCATMFL DC    XL1'00' -      FIRST BYTE OF PCCATMST                    01950002
PCCAINIT EQU   X'80' -        ENTRY HAS BEEN INITIALIZED                02000002
PCCASYNC EQU   X'40' -        CLOCK OUT OF SYNCHRONIZATION              02050002
PCCAVKIL EQU   X'20' -        CONFIG CPU SHOULD BE CANCELLED            02100000
PCCAMCC  EQU   X'10' -        PROCESSING FOR PERMANENTLY DAMAGED CLOCK  02150002
*                             COMPARATOR MUST BE DONE                   02200002
PCCAMINT EQU   X'08' -        PROCESSING FOR CPU TIMER MUST BE DONE     02250002
PCCARV02 EQU   X'04',,C'X' -  RESERVED                                  02300002
PCCARV03 EQU   X'02',,C'X' -  RESERVED                                  02350002
PCCARV04 EQU   X'01',,C'X' -  RESERVED                                  02400002
PCCATODE DC    XL1'00' -      TOD CLOCK ERROR FLAGS                     02450002
PCCANUTD EQU   X'80' -        CLOCK CANNOT BE USED                      02500002
PCCANFTD EQU   X'40' -        CLOCK SHOULD NOT BE RESET                 02550002
PCCACTTD EQU   X'3F' -        ERROR COUNT (6 BITS)                      02600002
PCCACCE  DC    XL1'00' -      FLAGS FOR CLOCK COMPARATOR                02650002
PCCANUCC EQU   X'80' -        CLOCK COMPARATOR CANNOT BE USED           02700002
PCCANFCC EQU   X'40' -        CLOCK COMPARATOR SHOULD NOT BE RESET      02750002
PCCACTCC EQU   X'3F' -        ERROR COUNT (6 BITS)                      02800002
PCCAINTE DC    XL1'00' -      FLAGS FOR CPU TIMER                       02850002
PCCANUIN EQU   X'80' -        CPU TIMER CANNOT BE USED                  02900002
PCCANFIN EQU   X'40' -        CPU TIMER SHOULD NOT BE RESET             02950002
PCCACTIN EQU   X'3F' -        ERROR COUNT (6 BITS)                      03000002
PCCARPB  DC    F'0' -         EXTERNAL CALL SIGP BUFFER                 03050002
PCCASWTH EQU   X'80'          SWITCH REQUEST                   @G860P22 03055500
PCCARV4A EQU   X'40'          RESERVED                         @G860P22 03061000
PCCARQCK EQU   X'20'          RQCHECK REQUEST                  @G860P22 03066500
PCCAGTFR EQU   X'10'          GTF REQUEST                      @G860P22 03072000
PCCARV4B EQU   X'08'          RESERVED                         @G860P22 03077500
PCCAMODE EQU   X'04'          MODE REQUEST                     @G860P22 03083000
PCCASTCP EQU   X'02'          STOPCP REQUEST                       @D3C 03088500
PCCAMEMS EQU   X'01'          MEMSWT REQUEST                   @G860P22 03094000
PCCAEMSB DS    0CL16 -        EMERGENCY SIGNAL SIGP BUFFER              03100002
PCCAEMSI DS    0BL4 -         FIRST WORD OF EMS BUFFER                  03150002
PCCARISP DC    XL1'00' -      CONTAINS PARALLEL/SERIAL REQUEST          03160002
*                             INDICATOR FOR REMOTE IMMEDIATE SIGNAL     03170002
PCCAPARL EQU   X'80' -        PARALLEL REQUEST                          03171000
PCCASERL EQU   X'40' -        SERIAL REQUEST                            03180000
PCCARV06 EQU   X'20',,C'X' -  RESERVED                                  03192002
PCCARV07 EQU   X'10',,C'X' -  RESERVED                                  03194002
PCCARV08 EQU   X'08',,C'X' -  RESERVED                                  03196002
PCCARV09 EQU   X'04',,C'X' -  RESERVED                                  03198002
PCCARV10 EQU   X'02',,C'X' -  RESERVED                                  03198402
PCCARV11 EQU   X'01',,C'X' -  RESERVED                                  03198802
PCCAEMS2 DC    XL1'00' -      SECOND BYTE OF PCCAEMSI                   03199202
PCCASERP EQU   X'80' -        SERIAL PENDING INDICATOR         @G64UP9A 03199600
PCCARV13 EQU   X'40',,C'X' -  RESERVED                                  03199702
PCCARV14 EQU   X'20',,C'X' -  RESERVED                                  03199802
PCCARV15 EQU   X'10',,C'X' -  RESERVED                                  03204002
PCCARV16 EQU   X'08',,C'X' -  RESERVED                                  03208202
PCCARV17 EQU   X'04',,C'X' -  RESERVED                                  03212402
PCCARV18 EQU   X'02',,C'X' -  RESERVED                                  03216602
PCCARV19 EQU   X'01',,C'X' -  RESERVED                                  03226602
PCCAEMS3 DC    XL1'00' -      THIRD BYTE OF PCCAEMSI                    03228602
PCCASERF EQU   X'80'       -  SERIAL REQUEST FAILED            @G860P22 03230600
PCCARV21 EQU   X'40',,C'X' -  RESERVED                                  03232602
PCCARV22 EQU   X'20',,C'X' -  RESERVED                                  03233002
PCCARV23 EQU   X'10',,C'X' -  RESERVED                                  03233102
PCCARV24 EQU   X'08',,C'X' -  RESERVED                                  03233202
PCCARV25 EQU   X'04',,C'X' -  RESERVED                                  03238802
PCCARV26 EQU   X'02',,C'X' -  RESERVED                                  03240802
PCCARV27 EQU   X'01',,C'X' -  RESERVED                                  03242802
PCCARMSB DC    XL1'00' -      CONTAINS RMS INDICATOR                    03243202
PCCARV28 EQU   X'80',,C'X' -  RESERVED                                  03243602
PCCARV29 EQU   X'40',,C'X' -  RESERVED                                  03244002
PCCARV30 EQU   X'20',,C'X' -  RESERVED                                  03244102
PCCARV31 EQU   X'10',,C'X' -  RESERVED                                  03244202
PCCARV32 EQU   X'08',,C'X' -  RESERVED                                  03244302
PCCARV33 EQU   X'04',,C'X' -  RESERVED                                  03258202
PCCARV34 EQU   X'02',,C'X' -  RESERVED                                  03268202
PCCARMS  EQU   X'01' -        SIGP WAS ISSUED VIA RMS                   03270202
PCCAEMSP DC    A(0) -         REMOTE IMMEDIATE SIGNAL PARAMETER ADDRESS 03272202
PCCAEMSE DC    A(0) -         REMOTE IMMEDIATE SIGNAL RECEIVING ROUTINE 03286102
*                             ENTRY POINT ADDRESS                       03296102
PCCAEMSA DC    A(0) -         PCCA ADDRESS OF THE RECEIVING ROUTINE     03300002
PCCAPWAV DC    A(0) -         VIRTUAL ADDRESS OF MCH PROCESSOR WORK     03350002
*                             AREA                                      03400002
PCCAPWAR DC    A(0) -         REAL ADDRESS OF MCH PROCESSOR WORK AREA   03450002
PCCALRBV DC    A(0) -         VIRTUAL ADDRESS OF MCH LOGREC BUFFER      03500002
PCCALRBR DC    A(0) -         REAL ADDRESS OF MCH LOGREC BUFFER         03550002
PCCARIOS DS    208XL1 -       RESERVED FOR IOS USE             @G860PVB 03600000
PCCAATTR DC    XL1'00' -      PROCESSOR ATTRIBUTES             @G47AN9A 03650000
PCCACPUM EQU   X'80' -        INDICATOR THAT DEAD CPU HAD A MALFUNCTION 03700000
*                                                              @G47AN9A 03750000
PCCAIO   EQU   X'40' -        PROCESSOR HAS I/O CAPABILITY     @G47AN9A 03800000
PCCANPFA EQU   X'20' -        WHEN SET, PAGE FAULT ASSIST SHOULD NOT    03850000
*                             BE USED                              @L1A 03900000
PCCAR101 EQU   X'10',,C'X' -  RESERVED                         @G47AN9A 03950000
PCCAR102 EQU   X'08',,C'X' -  RESERVED                         @G47AN9A 04000000
PCCAR103 EQU   X'04',,C'X' -  RESERVED                         @G47AN9A 04050000
PCCAR104 EQU   X'02',,C'X' -  RESERVED                         @G47AN9A 04100000
PCCAR105 EQU   X'01',,C'X' -  RESERVED                         @G47AN9A 04150000
PCCAMFA  DC    XL1'00' -      MALFUNCTION ALERT FLAGS              @02A 04200000
PCCASMFA EQU   X'80' -        SIMULATED MALFUNCTION ALERT          @02A 04250000
PCCAACRN DC    XL1'00' -      CAUSE OF ACR                         @D2A 04254700
PCCAKUKN EQU   X'00'          UNKNOWN ERROR                        @D2A 04259400
PCCAKMFA EQU   X'01'          MALFUNCTION ALERT, CPU CHECKSTOPPED  @D2A 04264100
PCCAKIPT EQU   X'02'          INSTRUCTION PROCESSING DAMAGE        @D2A 04268800
*                             THRESHOLD                            @D2A 04273500
PCCAKSDT EQU   X'03'          SYSTEM DAMAGE THRESHOLD              @D2A 04278200
PCCAKIVT EQU   X'04'          INVALID REGISTER OR PSW THRESHOLD    @D2A 04282900
PCCAKTCT EQU   X'05'          TIME OF DAY CLOCK DAMAGE THRESHOLD   @D2A 04287600
PCCAKPTT EQU   X'06'          PROCESSOR TIMER DAMAGE THRESHOLD     @D2A 04292300
PCCAKCCT EQU   X'07'          CLOCK COMPARATOR DAMAGE THRESHOLD    @D2A 04297000
PCCAKPST EQU   X'08'          PRIMARY SYNC DAMAGE THRESHOLD        @D2A 04301700
PCCAKADT EQU   X'09'          ETR ATTACHMENT DAMAGE THRESHOLD      @D2A 04306400
PCCAKSLT EQU   X'0A'          SWITCH TO LOCAL THRESHOLD            @D2A 04311100
PCCAKESL EQU   X'0B'          EXCESSIVE SPIN LOOP                  @D2A 04315800
PCCAKTCF EQU   X'0C'          TOD CLOCK SYNCHRONIZATION FAILURE    @D2A 04320500
PCCAKDAT EQU   X'0D'          MALFUNCTION OF DAT HARDWARE          @D2A 04325200
PCCAKSCF EQU   X'0E'          TOD CLOCK COULD NOT BE SYNCHRONIZED  @D2A 04327500
*                             TO ETR                               @D2A 04329800
PCCAKUME EQU   X'0F'          UNRECOVERABLE MACHINE ERROR          @D2A 04332200
PCCARCFF DC    XL1'00'        Reconfig flags. Serialized by @L2A        04334100
*                             reconfig ENQ                         @L2A 04336000
PCCACWLM EQU   X'80'          CPU on/offline initiated by WLM      @L2A 04337900
PCCARV36 DC    F'0' -         RESERVED                                  04340002
         DC    XL200'00' -    RESERVED                             @L3A 04360000
PCCAEND  EQU   *              End of PCCA                               04380000
         MEND  , -   */                                                 04400002
*%PCCAL2 : ;                                                            04450002
*@EJECT;                                                                04500000
*DECLARE                                                                04550002
*  1 PCCA     BASED(PCCAPTR) BDY(DWORD),                                04600002
*   2 PCCAPCCA    CHAR(4) BDY(WORD),     /* CONTROL BLOCK ACRONYM IN    04650002
*                                           EBCDIC                   */ 04700002
*   2 PCCACPID    CHAR(12) BDY(WORD),    /* CPU ID (CONTAINS SERIAL     04750002
*                                           NUMBER)                  */ 04800002
*   2 PCCACPUA    PTR(15),               /* PHYSICAL CPU ADDRESS     */ 04850002
*   2 PCCACAFM    BIT(16) BDY(WORD,3),   /* BIT MASK CORRESPONDING TO   04900002
*                                           PHYSICAL CPU ADDRESS     */ 04950002
*   2 PCCATQEP    PTR(31),               /* TQE POINTER              */ 05050002
*   2 PCCAPSAV    PTR(31),               /* VIRTUAL ADDRESS OF PSA   */ 05100002
*   2 PCCAPSAR    PTR(31),               /* REAL ADDRESS OF PSA      */ 05150002
*   2 PCCAISCE    BIT(8),                /* INTERRUPTION SUBCLASSES TO  05155500
*                                           ENABLE           @G860P22*/ 05161000
*   2 PCCAMCHF    BIT(24),               /* Machine Check Flags. @D2C*/ 05162800
*    3 PCCASMCH   BIT(1),                /* A software-simulated        05164600
*                                           machine check occurred.     05166400
*                                                                 @L2A*/05168200
*    3  *         BIT(23),               /*                       @L2A*/05170000
*   2 PCCACRG6    FIXED(32),           /* CONTROL REGISTER 6 @G860P22*/ 05172000
*    3 PCCAISCM   BIT(8),                /* INTERRUPTION SUBCLASS MASK  05177500
*                                                            @G860P22*/ 05183000
*    3 PCCACR6L   BIT(24),               /* LOW-ORDER 3 BYTES OF CR 6   05188500
*                                                            @G860P22*/ 05194000
*   2 PCCASLIH    FIXED(31),             /* NUMBER OF ENTRIES TO THE    05199500
*                                           I/O SLIH         @G860PVB*/ 05205000
*   2 PCCASTPI    FIXED(31),             /* NUMBER OF TPI WITH CC=1     05210500
*                                                            @G860PVB*/ 05216000
*   2 PCCAXSLF  FIXED(31),               /* EXCESSIVE SPIN LENGTH       05221500
*                                           FACTOR.              @H1A*/ 05227000
*   2 PCCARSPR  FIXED(31),               /* RELATIVE SPEED (X4096) OF   05232500
*                                           THIS PROCESSOR.      @H1A*/ 05238000
*   2 PCCATRW1  FIXED(32),               /* TRAP WRD 1. DATA AND FLAG,  05239800
*                                           SET BY SCIXL.        @03A*/ 05241600
*    3 PCCATRDA  FIXED(16),              /* TRAP DATA.           @03A*/ 05243400
*    3 PCCATRFL  CHAR(1),                /* TRAP FLAG.           @03A*/ 05245200
*    3 *         CHAR(1),                /* RESERVED.            @03A*/ 05247000
*   2 PCCARV88    PTR(31),               /* RESERVED                 */ 05249000
*   2 PCCARV89    PTR(31),               /* RESERVED                 */ 05254500
*   2 PCCARV90    PTR(31),               /* RESERVED                 */ 05260000
*   2 PCCARV91    PTR(31),               /* RESERVED                 */ 05265500
*   2 PCCARV92    PTR(31),               /* RESERVED                 */ 05271000
*   2 PCCARV93    PTR(31),               /* RESERVED                 */ 05276500
*   2 PCCARV94    PTR(31),               /* RESERVED                 */ 05282000
*   2 PCCARV95    PTR(31),               /* RESERVED           */       05287500
*   2 PCCARV96    PTR(31),               /* RESERVED           */       05293000
*   2 PCCARV97    PTR(31),               /* RESERVED           */       05298500
*   2 PCCARV98    PTR(31),               /* RESERVED           */       05304000
*   2 PCCARV99    PTR(31),               /* RESERVED           */       05309500
*   2 PCCARV9A    PTR(31),               /* RESERVED           */       05315000
*   2 PCCARV9B    PTR(31),               /* RESERVED           */       05320500
*   2 PCCARV9C    PTR(31),               /* RESERVED           */       05326000
*   2 PCCARV9D    PTR(31),               /* RESERVED           */       05331500
*   2 PCCARV9E    PTR(31),               /* RESERVED                 */ 05337000
*@EJECT;                                                                05342500
*   2 PCCATMST    CHAR(4) BDY(WORD),     /* TIMER STATUS BYTES       */ 05350002
*    3 PCCATMFL    BIT(8),               /* FIRST BYTE OF PCCATMST   */ 05400002
*     4 PCCAINIT BIT(1),                 /* ENTRY HAS BEEN              05450002
*                                           INITIALIZED              */ 05500002
*     4 PCCASYNC BIT(1),                 /* CLOCK OUT OF                05550002
*                                           SYNCHRONIZATION          */ 05600002
*     4 PCCAVKIL BIT(1),                 /* CONFIG CPU SHOULD BE        05650000
*                                           CANCELLED                */ 05700002
*     4 PCCAMCC  BIT(1),                 /* PROCESSING FOR              05750002
*                                           PERMANENTLY DAMAGED CLOCK   05800002
*                                           COMPARATOR MUST BE DONE  */ 05850002
*     4 PCCAMINT BIT(1),                 /* PROCESSING FOR CPU TIMER    05900002
*                                           MUST BE DONE             */ 05950002
*     4 PCCARV02 BIT(1),                 /* RESERVED                 */ 06000002
*     4 PCCARV03 BIT(1),                 /* RESERVED                 */ 06050002
*     4 PCCARV04 BIT(1),                 /* RESERVED                 */ 06100002
*    3 PCCATODE    PTR(8),               /* TOD CLOCK ERROR FLAGS    */ 06150002
*     4 PCCANUTD BIT(1),                 /* CLOCK CANNOT BE USED     */ 06200002
*     4 PCCANFTD BIT(1),                 /* CLOCK SHOULD NOT BE RESET*/ 06250002
*     4 PCCACTTD BIT(6),                 /* ERROR COUNT              */ 06300002
*    3 PCCACCE     PTR(8),               /* FLAGS FOR CLOCK             06350002
*                                           COMPARATOR               */ 06400002
*     4 PCCANUCC BIT(1),                 /* CLOCK COMPARATOR CANNOT     06450002
*                                           BE USED                  */ 06500002
*     4 PCCANFCC BIT(1),                 /* CLOCK COMPARATOR SHOULD     06550002
*                                           NOT BE RESET             */ 06600002
*     4 PCCACTCC BIT(6),                 /* ERROR COUNT              */ 06650002
*    3 PCCAINTE    PTR(8),               /* FLAGS FOR CPU TIMER      */ 06700002
*     4 PCCANUIN BIT(1),                 /* CPU TIMER CANNOT BE USED */ 06750002
*     4 PCCANFIN BIT(1),                 /* CPU TIMER SHOULD NOT BE     06800002
*                                           RESET                    */ 06850002
*     4 PCCACTIN BIT(6),                 /* ERROR COUNT              */ 06900002
*   2 PCCARPB CHAR(4) BDY(WORD) ABNL,    /* EXTERNAL CALL SIGP BUFFER   06907100
*                                                            @G860P22*/ 06914200
*    3 * BIT(8),                         /* SWITCHES         @G860P22*/ 06921300
*     4 PCCASWTH BIT(1),                 /* SWITCH REQUEST   @G860P22*/ 06928400
*     4 * BIT(1),                        /* RESERVED         @G860P22*/ 06935500
*     4 PCCARQCK BIT(1),                 /* RQCHECK REQUEST  @G860P22*/ 06942600
*     4 PCCAGTFR BIT(1),                 /* GTF REQUEST      @G860P22*/ 06949700
*     4 * BIT(1),                        /* RESERVED         @G860P22*/ 06956800
*     4 PCCAMODE BIT(1),                 /* MODE REQUEST     @G860P22*/ 06963900
*     4 PCCASTCP BIT(1),                 /* STOPCP REQUEST       @D3C*/ 06971000
*     4 PCCAMEMS BIT(1),                 /* MEMSWT REQUEST   @G860P22*/ 06978100
*    3 * BIT(24),                        /*                  @G860P22*/ 06985200
*@EJECT;                                                                06992300
*   2 PCCAEMSB    CHAR(16) BDY(DWORD),   /* EMERGENCY SIGNAL SIGP       07000002
*                                           BUFFER                   */ 07050002
*    3 PCCAEMSI CHAR(4) BDY(WORD) ABNL,  /* FIRST WORD OF EMS BUFFER    07083300
*                                                            @G860P22*/ 07116600
*     4 PCCARISP    BIT(8),              /* CONTAINS PARALLEL/SERIAL    07150002
*                                           REQUEST INDICATOR FOR       07200002
*                                           REMOTE IMMEDIATE SIGNAL  */ 07250002
*      5 PCCAPARL BIT(1),                /* PARALLEL REQUEST         */ 07251000
*      5 PCCASERL BIT(1),                /* SERIAL REQUEST           */ 07300000
*      5 PCCARV06 BIT(1),                /* RESERVED                 */ 07400002
*      5 PCCARV07 BIT(1),                /* RESERVED                 */ 07450002
*      5 PCCARV08 BIT(1),                /* RESERVED                 */ 07500002
*      5 PCCARV09 BIT(1),                /* RESERVED                 */ 07550002
*      5 PCCARV10 BIT(1),                /* RESERVED                 */ 07600002
*      5 PCCARV11 BIT(1),                /* RESERVED                 */ 07650002
*     4 PCCAEMS2    BIT(8),              /* SECOND BYTE OF PCCAEMSI  */ 07700002
*      5 PCCASERP BIT(1),                /* SERIAL PENDING INDICATOR    07733300
*                                                            @G64UP9A*/ 07766600
*      5 PCCARV13 BIT(1),                /* RESERVED                 */ 07800002
*      5 PCCARV14 BIT(1),                /* RESERVED                 */ 07850002
*      5 PCCARV15 BIT(1),                /* RESERVED                 */ 07900002
*      5 PCCARV16 BIT(1),                /* RESERVED                 */ 07950002
*      5 PCCARV17 BIT(1),                /* RESERVED                 */ 08000002
*      5 PCCARV18 BIT(1),                /* RESERVED                 */ 08050002
*      5 PCCARV19 BIT(1),                /* RESERVED                 */ 08100002
*     4 PCCAEMS3  BIT(8),                /* THIRD BYTE OF PCCAEMSI   */ 08150000
*      5 PCCASERF BIT(1),           /* SERIAL REQUEST FAILED @G860P22*/ 08200000
*      5 PCCARV21 BIT(1),                /* RESERVED                 */ 08250002
*      5 PCCARV22 BIT(1),                /* RESERVED                 */ 08300002
*      5 PCCARV23 BIT(1),                /* RESERVED                 */ 08350002
*      5 PCCARV24 BIT(1),                /* RESERVED                 */ 08400002
*      5 PCCARV25 BIT(1),                /* RESERVED                 */ 08450002
*      5 PCCARV26 BIT(1),                /* RESERVED                 */ 08500002
*      5 PCCARV27 BIT(1),                /* RESERVED                 */ 08550002
*     4 PCCARMSB    BIT(8),              /* CONTAINS RMS INDICATOR   */ 08600002
*      5 PCCARV28 BIT(1),                /* RESERVED                 */ 08650002
*      5 PCCARV29 BIT(1),                /* RESERVED                 */ 08700002
*      5 PCCARV30 BIT(1),                /* RESERVED                 */ 08750002
*      5 PCCARV31 BIT(1),                /* RESERVED                 */ 08800002
*      5 PCCARV32 BIT(1),                /* RESERVED                 */ 08850002
*      5 PCCARV33 BIT(1),                /* RESERVED                 */ 08900002
*      5 PCCARV34 BIT(1),                /* RESERVED                 */ 08950002
*      5 PCCARMS  BIT(1),                /* SIGP WAS ISSUED VIA RMS  */ 09000002
*    3 PCCAEMSP    PTR(31),              /* REMOTE IMMEDIATE SIGNAL     09050002
*                                           PARAMETER ADDRESS        */ 09100002
*    3 PCCAEMSE    PTR(31),              /* REMOTE IMMEDIATE SIGNAL     09150002
*                                           RECEIVING ROUTINE ENTRY     09200002
*                                           POINT ADDRESS            */ 09250002
*    3 PCCAEMSA    PTR(31),              /* PCCA ADDRESS OF THE         09300002
*                                           RECEIVING ROUTINE        */ 09350002
*@EJECT;                                                                09375000
*   2 PCCAPWAV    PTR(31),               /* VIRTUAL ADDRESS OF MCH      09400002
*                                           PROCESSOR WORK AREA      */ 09450002
*   2 PCCAPWAR    PTR(31),               /* REAL ADDRESS OF MCH         09500002
*                                           PROCESSOR WORK AREA      */ 09550002
*   2 PCCALRBV    PTR(31),               /* VIRTUAL ADDRESS OF MCH      09600002
*                                           LOGREC BUFFER            */ 09650002
*   2 PCCALRBR    PTR(31),               /* REAL ADDRESS OF MCH         09700002
*                                           LOGREC BUFFER            */ 09750002
*   2 *           CHAR(208),             /* RESERVED FOR IOS @G860PVB*/ 09792300
*   2 PCCAATTR    BIT(8),                /* PROCESSOR ATTRIBUTES        09834600
*                                                            @G47AN9A*/ 09876900
*    3 PCCACPUM BIT(1),                  /* INDICATOR THAT DEAD CPU     09919200
*                                           HAD A MALFUNCTION           09961500
*                                                            @G47AN9A*/ 10003800
*    3 PCCAIO   BIT(1),                 /* PROCESSOR HAS I/O CAPABILITY 10046100
*                                                            @G47AN9A*/ 10088400
*    3 PCCANPFA BIT(1),                  /* WHEN SET, PAGE FAULT ASSIST 10130700
*                                           SHOULD NOT BE USED   @L1A*/ 10173000
*    3 PCCAR101 BIT(1),                  /* RESERVED         @G47AN9A*/ 10215300
*    3 PCCAR102 BIT(1),                  /* RESERVED         @G47AN9A*/ 10257600
*    3 PCCAR103 BIT(1),                  /* RESERVED         @G47AN9A*/ 10299900
*    3 PCCAR104 BIT(1),                  /* RESERVED         @G47AN9A*/ 10342200
*    3 PCCAR105 BIT(1),                  /* RESERVED         @G47AN9A*/ 10384500
*   2 PCCAMFA BIT(8),                    /* MALFUNCTION ALERT FLAGS     10426800
*                                                                @02A*/ 10469100
*    3 PCCASMFA BIT(1),                  /* SIMULATED MALFUNCTION ALERT 10511400
*                                                                @02A*/ 10553700
*    3 * BIT(7),                         /* RESERVED             @02A*/ 10596000
*   2 PCCAACRN    BIT(8),                /* CAUSE OF ACR         @D2A*/ 10611300
*   2 PCCARCFF    FIXED(8),              /* Reconfig flags. Serialized  10617400
*                                           by reconfig ENQ      @L2A*/ 10623500
*     3 PCCACWLM  BIT(1),                /* CPU on/offline initiated    10629600
*                                  by WLM                        @L2A*/ 10635700
*   2 PCCARV36    FIXED(31),             /* RESERVED                 */ 10642002
*   2 *           CHAR(200) BDY(DWORD);  /* RESERVED         @G64AP9A*/ 10692000
*DECLARE                                 /* MESSAGE INSERT NUMBERS FOR  10742000
*                                           CAUSE OF ACR         @D2A*/ 10792000
*  PCCAKUKN BIT(8) CONSTANT('00'X),      /* UNKNOWN ERROR        @D2A*/ 10842000
*  PCCAKMFA BIT(8) CONSTANT('01'X),      /* MALFUNCTION ALERT,          10892000
                                            CPU CHECKSTOPPED     @D2A*/ 10942000
*  PCCAKIPT BIT(8) CONSTANT('02'X),      /* INSTRUCTION PROCESSING      10992000
*                                           DAMAGE THRESHOLD     @D2A*/ 11042000
*  PCCAKSDT BIT(8) CONSTANT('03'X),      /* SYSTEM DAMAGE               11092000
*                                           THRESHOLD            @D2A*/ 11142000
*  PCCAKIVT BIT(8) CONSTANT('04'X),      /* INVALID REGISTER OR PSW     11192000
*                                           THRESHOLD            @D2A*/ 11242000
*  PCCAKTCT BIT(8) CONSTANT('05'X),      /* TIME OF DAY CLOCK DAMAGE    11292000
*                                           THRESHOLD            @D2A*/ 11342000
*  PCCAKPTT BIT(8) CONSTANT('06'X),      /* PROCESSOR TIMER DAMAGE      11392000
*                                           THRESHOLD            @D2A*/ 11442000
*  PCCAKCCT BIT(8) CONSTANT('07'X),      /* CLOCK COMPARATOR DAMAGE     11492000
*                                           THRESHOLD            @D2A*/ 11542000
*  PCCAKPST BIT(8) CONSTANT('08'X),      /* PRIMARY SYNC DAMAGE         11592000
*                                           THRESHOLD            @D2A*/ 11642000
*  PCCAKADT BIT(8) CONSTANT('09'X),      /* ETR ATTACHMENT DAMAGE       11692000
*                                           THRESHOLD            @D2A*/ 11742000
*  PCCAKSLT BIT(8) CONSTANT('0A'X),      /* SWITCH TO LOCAL             11792000
*                                           THRESHOLD            @D2A*/ 11842000
*  PCCAKESL BIT(8) CONSTANT('0B'X),      /* EXCESSIVE SPIN LOOP  @D2A*/ 11892000
*  PCCAKTCF BIT(8) CONSTANT('0C'X),      /* TOD CLOCK SYNCHRONIZATION   11942000
*                                           FAILURE              @D2A*/ 11992000
*  PCCAKDAT BIT(8) CONSTANT('0D'X),      /* MALFUNCTION OF DAT          12042000
*                                           HARDWARE             @D2A*/ 12092000
*  PCCAKSCF BIT(8) CONSTANT('0E'X),      /* TOD CLOCK COULD NOT BE      12142000
*                                           SYNCHRONIZED TO ETR  @P2C*/ 12192000
*  PCCAKUME BIT(8) CONSTANT('0F'X);      /* UNRECOVERABLE MACHINE       12242000
*                                           ERROR                @D2A*/ 12292000
