*                                                                       00050000
*        %GOTO PSWL1;  /*                                               00100000
         MACRO                                                          00150000
         IHAPSW  &DSECT=YES  */                                         00200000
*%PSWL1: ;                                                              00250000
*                                                                       00300000
* /*******************************************************************/ 00350000
* /*                                                                 */ 00400000
* /*           PROGRAM STATUS WORD                                   */ 00450000
* /*                                                                 */ 00500000
* /* COPYRIGHT =                                                     */ 00550000
* /*   5647-A01                                                      */ 00600000
* /*   THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                  */ 00650000
* /*   (C) COPYRIGHT IBM CORP. 1988,2000                             */ 00700000
* /*   LICENSED MATERIALS - PROPERTY OF IBM                          */ 00750000
* /*                                                                 */ 00850000
* /* STATUS =  HBB7703                                               */ 00870000
* /*                                                                 */ 00890000
* /*01* EXTERNAL CLASSIFICATION: NONE                                */ 00910000
* /*01* END OF EXTERNAL CLASSIFICATION:                              */ 00930000
* /*                                                                 */ 00950000
* /*  Method of Access                                               */ 01000000
* /*     BAL  - DSECT is produced unless DSECT=NO is specified.      */ 01050000
* /*            Using on PSW gives addressability for all symbols.   */ 01100000
* /*                                                                 */ 01150000
* /*     PL/AS - %INCLUDE SYSLIB(IHAPSW)                             */ 01200000
* /*            If "BASED" is not wanted, set macro variable         */ 01230000
* /*            PSWBASE to the desired attribute(s).                 */ 01260000
* /*     PL/S   Set macro variable PSWPLS to 'YES' to avoid          */ 01290000
* /*            generating constants with > 8 character names.       */ 01320000
* /*                                                                 */ 01350000
* /*  CHANGE-ACTIVITY=                                               */ 01400000
* /*     $L0=    AR    HBB3310  860129  PDXB: AR support             */ 01450000
* /*     $L1= 64BITRTM HBB7703  971101  PDXB: 64-bit mode            */ 01475000
* /*     $P1= PXD1165  HBB7703  000214  PDXX: Change PSWENotESAME    */ 01483300
* /*                                          to PSWENOTESAME (asm). */ 01491600
* /*                                                                 */ 01500000
* /*******************************************************************/ 01550000
*%GOTO PSWL2;    /*                                                     01600000
         SPACE 1                                                        01650000
         AIF   ('&DSECT' EQ 'NO').PSW10                                 01700000
PSW      DSECT                                                          01750000
         AGO .PSW20                                                     01800000
.PSW10   ANOP                                                           01850000
PSW      DS    0D                                                       01900000
.PSW20   ANOP                                                           02000000
PSWBYT03 DS    0F                    Bytes 0-3 of PSW                   02025000
PSWMASK  DS    BL1                   PSW mask                           02050000
PSWPER   EQU   X'40'                 PER enabled                        02100000
PSWDAT   EQU   X'04'                 DAT mode                           02150000
PSWENABL EQU   X'03'                 Enablement bits                    02175000
PSWIO    EQU   X'02'                 I/O interrupts enabled             02200000
PSWEXT   EQU   X'01'                 External interrupts enabled        02250000
*                                                                       02300000
PSWBYTE1 DS    BL1                                                      02350000
PSWKEY   EQU   X'F0'                 PSW key                            02400000
PSWKEY8  EQU   X'80'                 If on, Key 8-15                    02425000
PSWECMOD EQU   X'08'                 EC mode PSW                        02450000
PSWNOTZARCH EQU X'08'                Not Z/Architecture PSW when on     02482990
PSWNOTESAME EQU X'08'                Not Z/Architecture PSW when on     02490980
PSWMCHK  EQU   X'04'                 Machine check mask                 02500000
PSWWAIT  EQU   X'02'                 Wait state                         02550000
PSWPROB  EQU   X'01'                 Problem state                      02600000
*                                                                       02650000
PSWBYTE2 DS    BL1                                                      02700000
PSWASC   EQU   X'C0'                 ASC mode                           02750000
PSWASC0  EQU   X'80'                 Bit 0 of ASC mode                  02766600
PSWASC1  EQU   X'40'                 Bit 1 of ASC mode                  02783200
PSWASC_PRIM EQU X'00'                Primary ASC mode                   02800000
PSWASC_SEC  EQU X'80'                Secondary ASC mode                 02850000
PSWASC_AR   EQU X'40'                AR ASC mode                        02900000
PSWASC_HOME EQU X'C0'                Home ASC mode                      02950000
PSWCC    EQU   X'30'                 Condition code                     03000000
PSWPROG  EQU   X'0F'                 Program mask                       03050000
PSWPFPO  EQU   X'08'                 Fixed point overflow mask          03100000
PSWPDO   EQU   X'04'                 Decimal overflow mask              03150000
PSWPEU   EQU   X'02'                 Exponent underflow mask            03200000
PSWPSIG  EQU   X'01'                 Significance mask                  03250000
*                                                                       03300000
PSWBYTE3 DS    BL1                                                      03350000
PSWAMODE64 EQU X'01'                 AMODE 64                     @LAA  03362500
PSWBYT47 DS    0F                    Bytes 4-7 of PSW                   03375000
PSWIA    DS    A                     Instruction address                03400000
PSWAMODE EQU   X'80'                 Addressing mode                    03450000
PSWAMODE31 EQU X'80'                 AMODE 31                      @L1A 03451000
         SPACE 1                                                        03452000
         AIF   ('&DSECT' EQ 'NO').PSWE10                                03453000
PSWE     DSECT                                                          03454000
         AGO .PSWE20                                                    03455000
.PSWE10  ANOP                                                           03456000
PSWE     DS    0D                                                       03457000
.PSWE20  ANOP                                                           03458000
PSWEBYT03 DS   0F                    Bytes 0-3 of PSW                   03459000
PSWEMASK DS    BL1                   PSW mask                           03460000
PSWEPER  EQU   X'40'                 PER enabled                        03461000
PSWEDAT  EQU   X'04'                 DAT mode                           03463000
PSWEENABL EQU  X'03'                 Enablement bits                    03464000
PSWEIO   EQU   X'02'                 I/O interrupts enabled             03465000
PSWEEXT  EQU   X'01'                 External interrupts enabled        03466000
*                                                                       03467000
PSWEBYTE1 DS   BL1                                                      03468000
PSWEKEY  EQU   X'F0'                 PSW key                            03469000
PSWEKEY8 EQU   X'80'                 If on, Key 8-15                    03470000
PSWEECMOD EQU  X'08'                 EC mode PSW                        03471000
PSWENOTZARCH EQU X'08'               Not Z/Architecture PSW        @P1C 03472290
PSWENOTESAME EQU X'08'               Not Z/Architecture PSW        @P1C 03472580
PSWEMCHK EQU   X'04'                 Machine check mask                 03473000
PSWEWAIT EQU   X'02'                 Wait state                         03474000
PSWEPROB EQU   X'01'                 Problem state                      03475000
*                                                                       03476000
PSWEBYTE2 DS   BL1                                                      03477000
PSWEASC  EQU   X'C0'                 ASC mode                           03478000
PSWEASC0 EQU   X'80'                 Bit 0 of ASC mode                  03479000
PSWEASC1 EQU   X'40'                 Bit 1 of ASC mode                  03480000
PSWEASC_PRIM EQU X'00'               Primary ASC mode                   03481000
PSWEASC_SEC EQU X'80'                Secondary ASC mode                 03482000
PSWEASC_AR  EQU X'40'                AR ASC mode                        03483000
PSWEASC_HOME EQU X'C0'               Home ASC mode                      03484000
PSWECC   EQU   X'30'                 Condition code                     03485000
PSWEPROG EQU   X'0F'                 Program mask                       03486000
PSWEPFPO EQU   X'08'                 Fixed point overflow mask          03487000
PSWEPDO  EQU   X'04'                 Decimal overflow mask              03488000
PSWEPEU  EQU   X'02'                 Exponent underflow mask            03489000
PSWEPSIG EQU   X'01'                 Significance mask                  03490000
*                                                                       03491000
PSWEBYTE3 DS   BL1                                                      03491300
PSWEAMODE64 EQU X'01'                AMODE 64                     @LAA  03491600
PSWEBYT47 DS   F                     Bytes 4-7 of PSW                   03492000
PSWEAMODE EQU  X'80'                 Addressing mode                    03493000
PSWEAMODE31 EQU X'80'                AMODE 31                      @L1A 03494000
PSWEBYT815 DS  0XL8                  Bytes 8-15 of PSW                  03495000
PSWEIA   DS    0XL8                  Instruction address                03496000
PSWEIABYT03 DS F                     Bytes 0-3 of instruction address   03497000
PSWEIABYT47 DS F                     Bytes 4-7 of instruction address   03498000
         MEND  ,       */                                               03500000
*%PSWL2: ;                                                              03550000
*%IF IhaPSW_Type = 'YES' %THEN         /*                      950801*/ 03558300
*%DO;                                  /*                      950801*/ 03566600
*DCL 1  PSW TYPE BDY(DWORD),      /* PSW                             */ 03574900
*%END;                                 /*                      950801*/ 03583200
*%ELSE %DO;                            /*                      950801*/ 03591500
*%IF PSWBASE='' %THEN                                                   03600000
*  %PSWBASE='BASED';                                                    03650000
*DCL 1  PSW PSWBASE BDY(DWORD),   /* PSW                             */ 03700000
*%END;                                 /*                      950801*/ 03720100
*     2 PSWBYT03 CHAR(4),         /* Bytes 0-3 of PSW                */ 03740300
*      3 PSWMASK BIT(8),          /* PSW mask                        */ 03780600
*        5 * BIT(1),              /*                                 */ 03820900
*        5 PSWPER BIT(1),         /* PER enabled                     */ 03861200
*        5 * BIT(3),              /*                             @L1C*/ 03901500
*        5 PSWDAT BIT(1),         /* DAT mode                        */ 03941800
*        5 PSWENABL BIT(2),       /* PSW is enabled                  */ 03982100
*          7 PSWIO BIT(1),        /* I/O interrupts enabled          */ 04022400
*          7 PSWEXT BIT(1),       /* External interrupts enabled     */ 04062700
*      3 PSWBYTE1 BIT(8),         /*                                 */ 04103000
*        5 PSWKEY BIT(4),         /* PSW key                         */ 04143300
*          7 PSWKEY8 BIT(1),      /* If on, key 8-15                 */ 04183600
*        5 PSWECMOD BIT(1),       /* EC mode PSW                     */ 04223900
* %IF PSWPLS='YES' %THEN                                                04231900
* %GOTO PSWL3A;                                                         04239900
*          7 PSWNotZARCH BIT(1),  /* Not Z/Architecture PSW when on  */ 04249890
*            9 PSWNotEsame BIT(1), /* Not Z/Architecture PSW when on */ 04251880
* %PSWL3A:;                                                             04255900
*        5 PSWMCHK BIT(1),        /* Machine check mask              */ 04264200
*        5 PSWWAIT BIT(1),        /* Wait state                      */ 04304500
*        5 PSWPROB BIT(1),        /* Problem state                   */ 04344800
*      3 PSWBYTE2 BIT(8),         /*                                 */ 04385100
*        5 PSWASC BIT(2),         /* ASC mode                        */ 04425400
*          7 PSWASC0 BIT(1),      /* Bit 0 of ASC-mode               */ 04465700
*          7 PSWASC1 BIT(1),      /* Bit 1 of ASC-mode               */ 04506000
*            9 PSWASCAR BIT(1),   /* AR-mode                         */ 04526100
*        5 PSWCC BIT(2),          /* Condition code                  */ 04546300
*        5 PSWPROG BIT(4),        /* Program mask                    */ 04586600
*          7 PSWPFPO BIT(1),      /* Fixed point overflow mask       */ 04626900
*          7 PSWPDO BIT(1),       /* Decimal overflow mask           */ 04667200
*          7 PSWPEU BIT(1),       /* Exponent underflow mask         */ 04707500
*          7 PSWPSIG BIT(1),      /* Significance mask               */ 04747800
*      3 PSWBYTE3 BIT(8),         /*                                 */ 04788100
*        5 * BIT(7),              /*                             @L1A*/ 04798100
*        5 PSWAMODE64 BIT(1),     /* AMODE 64                    @L1A*/ 04808200
*     2 PSWBYT47 CHAR(4) BDY(WORD), /* Bytes 4-7 of PSW              */ 04828400
*       3 PSWBYT47BITS BIT(32) BDY(WORD), /*                         */ 04845700
*         5 PSWIA PTR(31),        /* Instruction address             */ 04863000
*          6 PSWIAB0 BIT(8),      /* Byte 0 of instruction address   */ 04880300
*           7 PSWAMODE BIT(1),    /* Addressing mode                 */ 04897600
*            8 PSWAMODE31 BIT(1), /* AMODE 31                    @L1A*/ 04914900
*          6 PSWIA24 PTR(24);     /* AMODE 24 instruction address    */ 04932200
*@SPACE (1);                                                            04950000
* %IF PSWPLS='YES' %THEN                                                04966600
* %GOTO PSWL3;                                                          04983200
*%IF IhaPSW_Type = 'YES' %THEN         /*                      950801*/ 04983500
*%DO;                                  /*                      950801*/ 04983800
*DCL 1  PSWE TYPE BDY(DWORD),     /* Z/Architecture PSW              */ 04984190
*%END;                                 /*                      950801*/ 04984400
*%ELSE %DO;                            /*                      950801*/ 04984700
*%IF PSWBASE='' %THEN                                                   04985000
*  %PSWBASE='BASED';                                                    04985300
*DCL 1  PSWE PSWBASE BDY(DWORD),  /* Z/Architecture PSW              */ 04985690
*%END;                                 /*                      950801*/ 04985900
*     2 PsweBYT07 CHAR(8) BDY(WORD),  /* Bytes 0-7 of PSW            */ 04986200
*       3 PsweBYT03 CHAR(4),      /* Bytes 0-3 of PSW                */ 04986500
*         4 PsweMASK BIT(8),      /* PSW mask                        */ 04986800
*           5 * BIT(1),           /*                                 */ 04987100
*           5 PswePER BIT(1),     /* PER enabled                     */ 04987400
*           5 * BIT(3),           /*                             @L1C*/ 04987800
*           5 PsweDAT BIT(1),     /* DAT mode                        */ 04988300
*           5 PsweENABL BIT(2),   /* PSW is enabled                  */ 04988600
*             7 PsweIO BIT(1),    /* I/O interrupts enabled          */ 04988900
*             7 PsweEXT BIT(1),   /* External interrupts enabled     */ 04989200
*         4 PsweBYTE1 BIT(8),     /*                                 */ 04989500
*           5 PsweKEY BIT(4),     /* PSW key                         */ 04989800
*             7 PsweKEY8 BIT(1),  /* If on, key 8-15                 */ 04990100
*           5 PsweECMOD BIT(1),   /* EC mode PSW                     */ 04990400
*             7 PsweNotZARCH BIT(1), /* Not Z/Architecture PSW       */ 04990790
*               9 PsweNotEsame BIT(1), /* Not Z/Architecture PSW     */ 04990880
*           5 PsweMCHK BIT(1),    /* Machine check mask              */ 04991000
*           5 PsweWAIT BIT(1),    /* Wait state                      */ 04991300
*           5 PswePROB BIT(1),    /* Problem state                   */ 04991600
*         4 PsweBYTE2 BIT(8),     /*                                 */ 04991900
*           5 PsweASC BIT(2),     /* ASC mode                        */ 04992200
*             7 PsweASC0 BIT(1),  /* Bit 0 of ASC-mode               */ 04992500
*             7 PsweASC1 BIT(1),  /* Bit 1 of ASC-mode               */ 04992800
*               9 PsweASCAR BIT(1), /* AR-mode                       */ 04993100
*           5 PsweCC BIT(2),      /* Condition code                  */ 04993400
*           5 PswePROG BIT(4),    /* Program mask                    */ 04993700
*             7 PswePFPO BIT(1),  /* Fixed point overflow mask       */ 04994000
*             7 PswePDO BIT(1),   /* Decimal overflow mask           */ 04994300
*             7 PswePEU BIT(1),   /* Exponent underflow mask         */ 04994600
*             7 PswePSIG BIT(1),  /* Significance mask               */ 04994900
*         4 PsweBYTE3 BIT(8),     /*                                 */ 04995200
*           5 * BIT(7),           /*                             @L1A*/ 04995300
*           5 PsweAMODE64 BIT(1), /* AMODE 64                    @L1A*/ 04995400
*       3 PsweBYT47 CHAR(4) BDY(WORD), /* Bytes 4-7 of PSW           */ 04995500
*         5 PsweAMODE BIT(1),     /* Addressing mode                 */ 04995800
*           7 PsweAMODE31 BIT(1), /* AMODE 31                    @L1A*/ 04996100
*     2 PsweBYT815 CHAR(8) BDY(WORD),  /* Bytes 8-15 of PSW          */ 04996400
*       3 PsweBYT815BITS BIT(64) BDY(WORD), /*                       */ 04996700
*        4 PsweIA CHAR(8) BDY(WORD),        /*                       */ 04997000
*         5 PsweIABYT03 CHAR(4),  /* Bytes 0-3 of instruction           04997300
*                                    address                         */ 04997600
*         5 PsweIABYT47 PTR(31),  /* Bytes 4-7 of instruction           04997900
*                                    address                         */ 04998200
*          6 PsweIABYT4 BIT(8),   /* Byte 4 of instruction address   */ 04998500
*            7 PsweIABYT4Bit0 Bit(1), /*                             */ 04998800
*          6 PsweIA24 PTR(24);    /* AMODE 24 instruction address    */ 04999100
* /*                                                                 */ 05000000
* /* ASSOCIATED CONSTANTS                                            */ 05050000
*DCL PSWASC_PRIM BIT(2) CONSTANT('00'B); /* Primary ASC mode         */ 05100000
*DCL PSWASC_SEC  BIT(2) CONSTANT('10'B); /* Secondary ASC mode       */ 05150000
*DCL PSWASC_AR   BIT(2) CONSTANT('01'B); /* AR ASC mode              */ 05200000
*DCL PSWASC_HOME BIT(2) CONSTANT('11'B); /* Home ASC mode            */ 05250000
* %PSWL3: ;                                                             05300000
