*        %GOTO  QIOPLS; /*                                              00700001
         MACRO                                                          01400001
         IHAQIO  &DSECT=YES                                             02100001
         AIF   ('&DSECT' EQ 'NO').DS0D                                  02800001
IHAQIO   DSECT                                                          03500001
         AGO   .BODY                                                    04200001
.DS0D    ANOP                                                           04900001
IHAQIO   DS    0D                                                       05600001
.BODY    ANOP                                                           06300001
*********************************************************************** 07000001
*                                                                     * 07700001
*   MAPPING OF WORKAREA SET UP BY QMNGRIO MACRO REQUEST               * 08400001
*                                                                     * 09100001
*        RELEASE 1 AOS/1       LAST UPDATE  06/04/71                  * 09800001
*                                                                     * 10500001
*        SPACE IS PASSED TO THE QMNGRIO MACRO HANDLER TO BE USED      * 11200001
*        TO SET UP ALL NECESSARY TABLES AND WORK AREAS FOR AN I/O     * 11900001
*        REQUEST TO THE QUEUE MANAGER. THIS MAPPING GIVES THE WAY     * 12600001
*        THAT SPACE IS BROKEN DOWN BY THE MODULE IEFQMMAC.            * 13300001
*                                                                     * 14000001
*********************************************************************** 14700001
QIOQMPA  DS    CL36 -              Q MGR PARAMETER AREA                 15400001
QIOECIOB DS    0CL76                    ECB/IOB SPACE                   16100001
QIOECB   DS    F -                 EVENT CONTROL BLOCK                  16800001
QIOIOB   DS    0D -                INPUT/OUTPUT BLOCK                   17500001
QIOIFLGS DS    CL2 -               IOB FLAG BYTES                       18200001
QIOISNS  DS    CL2 -               IOB SENSE BYTES                      18900001
QIOIECB  DS    0F -                                                     19600001
QIOICC   DS    CL1 -               IOB ECB COMPLETION CODE              20300001
QIOIECBA DS    AL3 -               IOB ECB ADDRESS                      21000001
QIOIFLG3 DS    CL1 -               IOB FLAG BYTE 3                      21700001
QIOICSW  DS    CL7 -               SEVEN LOW ORDER BYTES OF LAST CSW    22400001
QIOIST   DS    0F -                                                     23100001
QIOISIO  DS    CL1 -               SIO CONDITION CODE                   23800001
QIOISTRT DS    AL3 -               CCW CHAIN POINTER                    24500001
QIOIDCB  DS    0F -                                                     25200001
QIOIRSVD DS    CL1 -                                                    25900001
QIOIDCBA DS    AL3 -               IOB DCB ADDRESS                      26600001
QIOIREST DS    CL8 -               SPACE TO IOB END                     27300001
QIOISEEK DS    CL8 -               SEEK/SEARCH MBBCCHHR                 28000001
QIOISET  DS    0D -                SET SECTOR CCW                       28700001
QIOISETO DS    CL1 -               SET SECTOR OP CODE                   29400001
QIOISETA DS    AL3 -               SET SECTOR DATA ADDRESS              30100001
QIOISETF DS    CL1 -               SET SECTOR FLAGS                     30800001
QIOISETR DS    CL1 -               SET SECTOR RESERVED                  31500001
QIOISETL DS    H -                 SET SECTOR LENGTH                    32200001
QIOISCH  DS    0D -                SEARCH CCW                           32900001
QIOISCHO DS    CL1 -               SEARCH OP CODE                       33600001
QIOISCHA DS    AL3 -               SEARCH DATA ADDRESS                  34300001
QIOISCHF DS    CL1 -               SEARCH FLAGS                         35000001
QIOISCHR DS    CL1 -               SEARCH RESERVED                      35700001
QIOISCHL DS    H -                 SEARCH LENGTH                        36400001
QIOITIC  DS    0D -                TIC CCW                              37100001
QIOITICO DS    CL1 -               TIC OP CODE                          37800001
QIOITICA DS    AL3 -               TIC DATA ADDRESS                     38500001
QIOITICF DS    CL1 -               TIC FLAGS                            39200001
QIOITICR DS    CL1 -               TIC RESERVED                         39900001
QIOITICL DS    H -                 TIC LENGTH                           40600001
QIOIO    DS    0D -                I/O CCW                              41300001
QIOIOO   DS    CL1 -               I/O OP CODE                          42000001
QIOIOA   DS    AL3 -               I/O DATA ADDRESS                     42700001
QIOIOF   DS    CL1 -               I/O FLAGS                            43400001
QIOIOR   DS    CL1 -               I/O RESERVED                         44100001
QIOIOL   DS    H -                 I/O LENGTH                           44800001
QIOJOB   DS    0F -                QMPA JOB INFO LIST                   45500001
QIOFILL1 DS    F -                 FULL WORK OF ZEROS                   46200001
QIONAMEA DS    A -                 POINTER TO JOB NAME                  46900001
QIOSWADS DS    A -                 POINTER TO SWADS DCB                 47600001
QIOPREXP DS    0F -                QMPA EXTERNAL PARM AREA PREFIX       48300001
QIOFILL2 DS    H -                                                      49000001
QIORECL  DS    H -                 RECORD LENGTH                        49700001
QIOXPA   DS    0F -                QMPA EXTERNAL PARM AREA              50400001
QIOCOREA DS    A -                 IN-CORE ADDRESS OF RECORD            51100001
QIOTTR0  DS    CL4 -               RELATIVE DISK ADDRESS OF RECORD      51800001
QIOQMWRK DS    CL120               WORK SPACE FOR QUEUE MANAGER         52500001
         MEND    , */                                                   53200001
*%QIOPLS: ;                                                             53900001
*  DECLARE                                                              54600001
*    1 IHAQIO  BASED (QIOPTR) BDY (DWORD),   /* QMNGRIO WORK AREA    */ 55300001
*      4 QIOQMPA  CHAR (36) BDY (DWORD),     /* Q MGR PARAMETER AREA */ 56000001
*      4 QIOECIOB  CHAR (76) BDY (DWORD,5),  /* ECB/IOB/CCW CHAIN    */ 56700001
*        6 QIOECB  FIXED (31),               /* EVENT CONTROL BLOCK  */ 57400001
*        6 QIOIOB  BDY (DWORD),              /* INPUT/OUTPUT BLOCK   */ 58100001
*          8 QIOIFLGS  CHAR (2),             /* IOB FLAG BYTES       */ 58800001
*          8 QIOISNS  CHAR (2),              /* IOB SENSE BYTES      */ 59500001
*          8 QIOIECB  PTR (31),              /*                      */ 60200001
*            10 QIOICC  CHAR (1),            /* ECB COMPLETION CODE  */ 60900001
*            10 QIOIECBA  PTR (24),          /* ECB ADDRESS          */ 61600001
*          8 QIOIFLG3  CHAR (1),             /* IOB FLAG BYTE 3      */ 62300001
*          8 QIOICSW  CHAR (7),              /* CSW LOW ORDER 7 BYTES*/ 63000001
*          8 QIOIST  PTR (31),               /*                      */ 63700001
*            10 QIOISIO  CHAR (1),           /* SIO CONDITION CODE   */ 64400001
*            10 QIOSTRT  PTR (24),           /* CCW CHAIN POINTER    */ 65100001
*          8 QIOIDCB  PTR (31),              /*                      */ 65800001
*            10 *  CHAR (1),                 /*                      */ 66500001
*            10 QIOIDCBA  PTR (24),          /* DCB ADDRESS          */ 67200001
*          8 * CHAR (8),                     /*                      */ 67900001
*          8 QIOISEEK  CHAR (8),             /* SEEK/SEARCH MBBCCHHR */ 68600001
*          8 QIOISET,                        /* SET SECTOR CCW       */ 69300001
*            10 QIOISETO  CHAR (1),          /* SET SECTOR OP CODE   */ 70000001
*            10 QIOISETA  PTR (24),          /* SET SECTOR DATA ADDR */ 70700001
*            10 QIOISETF  CHAR (1),          /* SET SECTOR FLAGS     */ 71400001
*            10 QIOISETR  CHAR (1),          /* SET SECTOR RESERVED  */ 72100001
*            10 QIOISETL  FIXED (15),        /* STE SECTOR LENGTH    */ 72800001
*          8 QIOISCH,                        /* SERACH CCW           */ 73500001
*            10 QIOISCHO  CHAR (1),          /* SEARCH OP CODE       */ 74200001
*            10 QIOISCHA  PTR (24),          /* SEARCH DATA ADDRESS  */ 74900001
*            10 QIOISCHF  CHAR (1),          /* SEARCH FLAGS         */ 75600001
*            10 QIOISCHR  CHAR (1),          /* SEARCH RESERVED      */ 76300001
*            10 QIOISCHL  FIXED (15),        /* SEARCH LENGTH        */ 77000001
*          8 QIOITIC,                        /* TIC CCW              */ 77700001
*            10 QIOITICO  CHAR (1),          /* TIC OP CODE          */ 78400001
*            10 QIOITICA  PTR (24),          /* TIC DATA ADDRESS     */ 79100001
*            10 QIOITICF  CHAR (1),          /* TIC FLAGS            */ 79800001
*            10 QIOITICR  CHAR (1),          /* TIC RESERVED         */ 80500001
*            10 QIOITICL  FIXED (15),        /* TIC LENGTH           */ 81200001
*          8 QIOIO,                          /* I/O CCW              */ 81900001
*            10 QIOIOO  CHAR (1),            /* I/O OP CODE          */ 82600001
*            10 QIOIOA  PTR (24),            /* I/O DATA ADDRESS     */ 83300001
*            10 QIOIOF  CHAR (1),            /* I/O FLAGS            */ 84000001
*            10 QIOIOR CHAR  (1),            /* I/O RESERVED         */ 84700001
*            10 QIOIOL  FIXED (15),          /* I/O LENGTH           */ 85400001
*      4 QIOJOB  CHAR (12) BDY (WORD),       /* JOB INFORMATION LIST */ 86100001
*        6 *  FIXED (31),                    /*                      */ 86800001
*        6 QIONAMEA  PTR (31),               /* POINTER TO JOB NAME  */ 87500001
*        6 QIOSWADS  PTR (31),               /* SWADS DCB PTR OR ZERO*/ 88200001
*      4 QIOPREXP  CHAR (4) BDY (WORD),      /* EXT PARM AREA PREFIX */ 88900001
*        6 *  CHAR (2),                      /*                      */ 89600001
*        6 QIORECL  FIXED (15),              /* REC LENGTH FOR I/O   */ 90300001
*      4 QIOXPA  CHAR (8) BDY (WORD),        /* EXTERNAL PARM AREA   */ 91000001
*        6 QIOCOREA  PTR (31),               /* IN-CORE RECORD ADDR  */ 91700001
*        6 QIOTTR0  CHAR (4),                /* REL DISK ADDR OF REC */ 92400001
*      4 QIOQMWRK  CHAR (120);               /* WORK SPACE FOR Q MGR */ 93100001
