*        %GOTO RCTL1;       /* BILINGUAL MAPPING                        00050000
         MACRO                                                          00100000
&RCTNAME IHARCT  &LIST=NO,&DSECT=YES                                 */ 00150000
*%RCTL1 : ;                                                             00200000
*/*                                                                  */ 00250000
*/*      ----- RECORDING CONTROL TABLE -----                         */ 00300000
*/*                                                                  */ 00350000
*/*  METHOD OF ACCESS                                                */ 00400000
*/*      PL/S - FROM POINTER PASSED IN THE EWA (EWADRCW)             */ 00450000
*/*             DCL RCTPTR PTR(31) DEFINED(EWADRCW)                  */ 00500000
*/*      BAL  - FROM EWADRCW.  EXAMPLE:                              */ 00550000
*/*             L     5,EWADRCW                                      */ 00600000
*/*             USING RCT,5                                          */ 00650000
*/*  F.E.'S                                                          */ 00700000
*/*      MICROFICHE LISTING - RCT                                    */ 00750000
*/*                                                                  */ 00800000
*/*  DEVELOPERS                                                      */ 00850000
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 00900000
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 00950000
*/*                                                                  */ 01000000
*/*  CHANGE ACTIVITY                                                 */ 01005000
*/*                                                                  */ 01010000
*/*    $H2=6872AU JBB2125 830131 PDLT: SAGUARO COMPATABILITY SUPPORT */ 01027500
*/*   OY02231 - DEFINE FLAGS FOR USER SUPPLIED IRB AND CHPID @YA02231*/ 01036200
*/*                                                                  */ 01045000
*                                                                       01050000
*%GOTO RCTL2;   /*                                                      01100000
         PUSH  PRINT                                                    01150000
         AIF   ('&LIST' EQ 'YES').RCT1A                                 01200000
         PRINT OFF                                                      01250000
.RCT1A   ANOP                                                           01300000
*------------- BEGINNING OF RCT -------------------------------------*  01350000
*                                                                       01400000
         AIF   ('&DSECT' EQ 'NO').RCTNODS                               01450000
RCT      DSECT ,                                                        01500000
         AGO   .RCTC1                                                   01550000
.RCTNODS ANOP                                                           01600000
         DS    0F                                                       01650000
.RCTC1   ANOP                                                           01700000
         AIF   ('&RCTNAME' EQ '').RCT01                                 01750000
&RCTNAME EQU   *                                                        01800000
.RCT01   ANOP                                                           01850000
RCTRECWD DS    0XL2                RECORD CONTROL WORD                  01900000
RCTRECF1 DS    XL1                 RCW FLAG BYTE 1                      01950000
RCTRECAB EQU   X'80'               ADDRESS OF BUILD AREA IS AT RCT+4    02000000
RCTRECGO EQU   X'40'               FREE THE BUILD AREA IF SUCCESSFUL    02050000
RCTRECDR EQU   X'20'               INVOKE DDR AT END OF OBR             02100000
RCTRECSH EQU   X'10'               BUILD A SHORT OBR RECORD             02150000
RCTXCTLX EQU   X'08'               EXIT VIA CVT XCTL ROUTINE            02200000
RCTRECHD EQU   X'04'               REC HDR, FAIL CCW, FAIL CSW, DEV DEP 02250000
*                                  DATA INCLUDED IN BUILD AREA          02300000
RCTRECUA EQU   X'02'               PRIMARY CUA/PHYSICAL ADDR INCLUDED   02350000
RCTRECSN EQU   X'01'               SENSE DATA, BYTE COUNT INCLUDED      02400000
RCTRECF2 DS    XL1                 RCW FLAG BYTE 2                      02450000
RCTRECFR EQU   X'80'               FREE THE BUILD AREA IF UNSUCCESSFUL  02500000
RCTRSV00 EQU   X'40'               RESERVED                       @H2A  02512500
RCTDVTYP EQU   X'20'               DEVICE TYPE SUPPLIED BY USER         02525000
*                                                                 AH2A  02537500
RCTRECIR EQU   X'10'               IRB SUPPLIED BY USER       @YA02231  02541600
RCTCHPID EQU   X'08'               CHPID INCLUDED IN ADDRESS  @YA02231  02545700
         SPACE 1                                                        02550000
RCTRECDL DS    HL2                 LENGTH OF DEVICE DEPENDENT DATA      02600000
RCTRECBA DS    AL4                 ADDRESS OF BUILD AREA                02650000
RCTRECNX DS    AL4                 ADDRESS OF NEXT RCT                  02700000
RCTRECSP DS    AL1                 SUBPOOL NUMBER IF BUILD AREA FREED   02750000
RCTBLDLN DS    AL1                 DOUBLEWORDS OF BLD AREA TO BE FREED  02800000
RCTXCTLV DS    AL2                 VALUE FOR EXITING VIA XCTL           02850000
RCTRSRVD DS    XL8                 RESERVED                             02900000
*                                                                       02950000
*------------- END OF RCT --------------------------------------------* 03000000
         POP   PRINT                                                    03050000
         MEND  ,                                                     */ 03100000
* %RCTL2  :  ;                                                          03150000
*%IF IKEPLS=''  %THEN                                                   03200000
*    %GOTO RCTL3;                                                       03250000
*%IHALPUSH='@LISTPUSH';                                                 03300000
*%IHALPOP='@LISTPOP';                                                   03350000
*%IHALOFF='@LISTOFF';                                                   03400000
*IHALPUSH;                                                              03450000
*%IF IHALIST='YES'  %THEN                                               03500000
*    %GOTO RCTL3;                                                       03550000
*IHALOFF;                                                               03600000
*%RCTL3:;                                                               03650000
* /* ---------------------- RCT ------------------------------------ */ 03700000
*                                                                       03750000
* DECLARE                                                               03800000
*   1 RCTMAP   BASED(RCTPTR) BDY(WORD),                                 03850000
*     2 RCTRECWD CHAR(2),          /* RECORD CONTROL WORD             */03900000
*       3 RCTRECF1 CHAR(1),        /* RCW FLAG BYTE 1                 */03950000
*         4 RCTRECAB BIT(1),       /* ADDR OF BUILD AREA IS AT RCT+4  */04000000
*         4 RCTRECGO BIT(1),       /* FREE THE BUILD AREA IF SUCCESS  */04050000
*         4 RCTRECDR BIT(1),       /* INVOKE DDR AT END OF OBR        */04100000
*         4 RCTRECSH BIT(1),       /* BUILD A SHORT OBR RECORD        */04150000
*         4 RCTXCTLX BIT(1),       /* EXIT VIA CVT XCTL ROUTINE       */04200000
*         4 RCTRECHD BIT(1),       /* REC HDR,FAIL CCW,FAIL CSW,DEV DEP 04250000
*                                     DATA INCLUDED IN BUILD AREA     */04300000
*         4 RCTRECUA BIT(1),    /* PRIMARY CUA/PHYSICAL ADDR INCLUDED */04350000
*         4 RCTRECSN BIT(1),       /* SENSE DATA, BYTE COUNT INCLUDED */04400000
*       3 RCTRECF2 CHAR(1),        /* RCW FLAG BYTE 2                 */04450000
*         4 RCTRECFR BIT(1),       /* FREE BUILD AREA IF NO SUCCESS   */04500000
*         4 RCTRSV00 BIT(1),       /* RESERVED                    @H2A*/04512500
*         4 RCTDVTYP BIT(1),       /* DEVICE TYPE SUPPLIED BY USER      04525000
                                                                  @H2A*/04537500
*         4 RCTRECIR BIT(1),       /* IRB SUPPLIED BY USER    @YA02231*/04541600
*         4 RCTCHPID BIT(1),       /* CHPID INCLUDED IN ADDR. @YA02231*/04545700
*     2 RCTRECDL FIXED(15),        /* LENGTH OF DEVICE DEPENDENT DATA */04550000
*     2 RCTRECBA PTR(31),          /* ADDRESS OF BUILD AREA           */04600000
*     2 RCTRECNX PTR(31),          /* ADDRESS OF NEXT RCT             */04650000
*     2 RCTRECSP FIXED(8),      /* SUBPOOL NUMBER IF BUILD AREA FREED */04700000
*     2 RCTBLDLN FIXED(8),     /* DOUBLEWORDS OF BLD AREA TO BE FREED */04750000
*     2 RCTXCTLV FIXED(15),        /* VALUE FOR EXITING VIA XCTL      */04800000
*     2 *        CHAR(8);          /* RESERVED                        */04850000
*                                                                       04900000
* /* ----------------- END OF RCT ----------------------------------- */04950000
*%IF IKEPLS=''  %THEN                                                   05000000
*    %GOTO RCTL4;                                                       05050000
*IHALPOP;                                                               05100000
*%RCTL4 : ;                                                             05150000
