*/********************* START OF SPECIFICATIONS **********************/ 00030500
*/*                                                                  */ 00061000
*/*   MACRO NAME: IHARTSD                                            */ 00062000
*/*                                                                  */ 00063000
*/*   DSECT NAME: RTSD                                               */ 00067100
*/*                                                                  */ 00071200
*/*   DESCRIPTIVE NAME: RTCT SDUMP EXTENSION                         */ 00075300
*/*                                                                  */ 00079400
*/*   COMPONENT: SVC Dump (SCDMP)                                @D2C*/ 00083700
*/*                                                                  */ 00088000
*/*01* PROPRIETARY STATEMENT=                                        */ 00102000
*/***PROPRIETARY_STATEMENT********************************************/ 00116000
*/*  Proprietary Statement =                                         */ 00130000
*/*                                                                  */ 00144000
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 00152000
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 00160000
*/*              5647-A01 (C) COPYRIGHT IBM CORP 1980, 2000          */ 00172000
*/*                                                                  */ 00184000
*/*  Status = HBB7703                                                */ 00188000
*/*                                                              @D2C*/ 00192000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00196000
*/*                                                                  */ 00200000
*/*   External Classification: DMTI                                  */ 00200100
*/*   End of External Classification: DMTI                           */ 00200200
*/*                                                                  */ 00200300
*/*   Eye Catcher: RTSD                                              */ 00200400
*/*   Offset: 0                                                      */ 00200500
*/*   Length: 4                                                      */ 00200600
*/*                                                                  */ 00200700
*/*   Storage Attributes:                                            */ 00200800
*/*   Main Storage: One per system                                   */ 00200900
*/*   Subpool: 239                                                   */ 00201000
*/*   Key: 0                                                         */ 00201100
*/*   Residency: Above 16M                                           */ 00201200
*/*   Size: 2684 bytes                                               */ 00201300
*/*                                                                  */ 00201400
*/*   Created By: IEAVTSDI                                           */ 00201500
*/*   Pointed to by: RTCTRTSD                                        */ 00201600
*/*   Serialization: Same as the RTCT                                */ 00201700
*/*                                                                  */ 00201800
*/*   FUNCTION:  USED TO SAVE THE FOLLOWING SVC DUMP             @08P*/ 00202000
*/*              INFORMATION THAT MUST BE IN FIXED STORAGE:      @08P*/ 00202200
*/*              1. USER PARAMETER LIST                          @08P*/ 00202400
*/*              2. USER HEADER DATA                             @08P*/ 00202600
*/*              3  STORAGE RANGES FROM STORAGE, LIST OR         @08P*/ 00202800
*/*                 LISTA                                        @08P*/ 00203000
*/*              4. SUBPOOL LIST                                 @08P*/ 00203200
*/*              5. KEY LIST                                     @08P*/ 00203400
*/*              6. CROSS MEMORY STATUS INFORMATION              @08P*/ 00203600
*/*              7. REGISTERS AND PSW AT TIME OF SLIP TRAP       @08P*/ 00203800
*/*              8. CALLERS CONTROL REGISTERS                    @L3A*/ 00204200
*/*              9. CALLERS ACCESS REGISTERS                     @L3A*/ 00204400
*/*             10. CALLERS SDWA ON BRANCH ENTRY SDUMPS          @08P*/ 00204900
*/*             11. OTHER INFORMATION DESCRIBING THE CALLERS     @08P*/ 00205400
*/*                 STATE                                        @08P*/ 00205900
*/*              THE RTSD ALSO CONTAINS WORKING STORAGE USED     @08P*/ 00206400
*/*              BY IEAVTSDX, IEAVAD00, AND IEAVTSPR TO          @08P*/ 00206900
*/*              PROCESS THE USER PARAMETER LIST.                @08P*/ 00207400
*/*                                                                  */ 00208400
*/*   METHOD OF ACCESS:                                              */ 00213700
*/*      BAL - DSECT IS CREATED WHEN IHARTSD STATEMENT EXECUTED.     */ 00219000
*/*            USING ON ADDRESS FOUND IN RTCTRTSD IS REQUIRED        */ 00225000
*/*            FOR ADDRESSABLIITY.   MODULES THAT INCLUDE THIS MACRO */ 00228000
*/*            MUST ALSO INCLUDE IHASDUMP AND IHARTCT.       @G860P31*/ 00230200
*/*      PLS - INCLUDE IHARTSD FROM SYSLIB.                          */ 00235000
*/*            MACROS IHASDUMP AND IHARTCT MUST ALSO         @G860P31*/ 00239800
*/*            BE INCLUDED.                                          */ 00244600
*/*                                                                  */ 00249500
*/*   CHANGE ACTIVITY =                                              */ 00250000
*/*              CREATED FOR OS/VS JBB1226                   @G38EP1U*/ 00250500
*/*              - INITIAL SUPPORT ADDED TO PROVIDE AN               */ 00253300
*/*                EXTENSION TO THE RTCT FOR SVC DUMP.               */ 00256100
*/*              - ADD SDUMP EXIT SUPPORT                    @G386P31*/ 00258900
*/*              - ADD SDUMP AND SYSMDUMP EXIT SUPPORT       @G38FP31*/ 00261700
*/*              - ADD SUSPEND SUMMARY DUMP SUPPORT          @G38EP1U*/ 00264500
*/*              - ADD SDWA TO HEADER RECORD SUPPORT         @G38VP1U*/ 00265000
*/*                                                                  */ 00265500
*/*      JBB1326 - ADD SUPPORT FOR THE CONSOLE TRACE FACILITY    @L1A*/ 00266200
*/*                                                                  */ 00266300
*/*      FLAG  REASON  PRODUCT   DATE   ORIGIN:  COMMENTS        @L1A*/ 00266900
*/*      $L1=  RAS     JBB1326  801009  PD1U:  CONSOLE TRACE     @L1A*/ 00267200
*/*      $T1=  UZ90178 JBB1326  810801  PD1X: CONSOLE TR IF MSSF @T1A*/ 00267500
*/*                                                                  */ 00267800
*/*       HBB2102                                            @G860P31*/ 00268300
*/*              - ADD SUPPORT FOR 31 BIT ADDRESSING         @G860P31*/ 00268800
*/*              - ADD AREAS TO CONTAIN USERS PARAMETERS     @G860P31*/ 00269300
*/*                SO USERS DONT HAVE TO SERIALIZE WITH      @G860P31*/ 00269800
*/*                SDUMP.                                    @G860P31*/ 00270300
*/*              - REORGANIZE AREAS SO THEY CAN BE CLEARED   @G860P31*/ 00270800
*/*                USING A MVCL INSTRUCTION.                 @G860P31*/ 00271300
*/*              PTMS FOR HBB2102                            @G860P31*/ 00271400
*/*              - FIX SUBPOOL LIST MAPPING                  @ZMC0992*/ 00271500
*/*              - CHANGE RTSDSRSN TO CHAR(4) FOR VRADATA    @ZMC2294*/ 00271600
*/*                                                                  */ 00271800
*/*    FLAG  REASON  PRODUCT   DATE   ORIGIN:  COMMENTS          @L2A*/ 00272000
*/*    $L2=  DCR01   JBB2220  840615  PDD2:  SVC DUMP CLEANUP    @L2A*/ 00272200
*/*    $L3=  AR      HBB3310  860414  PD2F:  ACCESS REGISTER SUPPORT */ 00272400
*/*    $L4= DATASPAC HBB3310  860707  PD2F:  LARGER PREFIX SUPPORT   */ 00272500
*/*    $L5= DATASPAC HBB3310  861029  PDXB:  CHANGE RTSDPTRT         */ 00272600
*/*    $L6= DATASPAC HBB3310  861029  PDQ6:  LISTD KEYWORD           */ 00272700
*/*    $P1= PC40541  HBB3310  861227  PDXB:  STOP/RESET AREA         */ 00274100
*/*    $D1= DCR205   HBB3310  870225  PDQ6:  POSTPONE LISTD          */ 00274400
*/*                                           PROCESSING             */ 00274700
*/*    $P2= PC40532  HBB3310  870225  PDXB:  DATA SPACE FOR COMMON   */ 00275000
*/*    $P3= PC40774  HBB3310  870225  PDQ6:  MOVE LISTD AREA POINTER */ 00275200
*/*    $P4= PC42092  HBB3310  880217  PDQ6:  DO NOT POSTPONE LISTD   */ 00275300
*/*    $P5= PC42150  HBB3310  880217  PDQ6:  SERIALIZE CLEANUP WITH  */ 00275700
*/*                                           IEAVTSDS               */ 00276100
*/*    $L7= ILIBS    JBB3311  880309  PDQ6:  SMSX LOCAL EXIT         */ 00276300
*/*    $P6= PHB1039  HBB4410  881201  PDEB:  ADD EARLY GLOBAL EXIT   */ 00276400
*/*    OY20575 - DEFINE BIT FOR SYNCHRONOUS DUMP PROCESSING TO TELL  */ 00276500
*/*              IEAVTSDS THAT IEAVAD00 HAS TERMINATED.      @YA20575*/ 00276700
*/*    $01= OY21535  JBB2220  890130  PDCI:  MDUMP                   */ 00276900
*/*    $02= OY21535  HBB3310  890331  PDCI:  MDUMP                   */ 00277100
*/*    $P7= PEO2548  HBB4410  891023  PDQ6:  SAVE CR15 FOR STOP      */ 00277200
*/*    $L8=DATA CAPT HBB4420  900226  PDHS:  RAPID DATA CAPTURE      */ 00277300
*/*    $L9=DATA CAPT HBB4420  900226  PDHP:  RAPID DATA CAPTURE      */ 00277400
*/*    $03= OY36770  JBB3311  901101  PDXB:  HOME ADDRESS SPACE      */ 00277600
*/*                                          DUMP TASK RB            */ 00277800
*/*    $04= OY44452  JBB3311  910805  PDHT: RTSDHTRB NO LONGER       */ 00277900
*/*                                          NECESSARY               */ 00278000
*/*    $05= OY48891  HBB4420  911115  PDKV: Unserialize SVC dump     */ 00278800
*/*                  when SDS will not complete because SD2 has not  */ 00279600
*/*                  been scheduled                              @05A*/ 00280400
*/*    $06= OY43249  HBB4420  910901  PDXB: RTSDDPPF/B           @06A*/ 00280800
*/*    $LA= SYSLKD   HBB5510  920121  PDHT:  Support for dumping     */ 00281000
*/*                                            the STRLIST       @LAA*/ 00281200
*/*    $LB= SYSLKD   HBB5510  920812  PDQ6:  Additional STRLIST      */ 00281400
*/*                                            support               */ 00281600
*/*    $P8= PKB1190  HBB4430  920422  PDSD: Assembler errors     @P8A*/ 00281700
*/*                                                                  */ 00281900
*/*    $LC= SDMPE    HBB5510  921231  PDXB:  Remote                  */ 00282100
*/*    $LD= SUBSP    HBB5510  930414  PDHT:  Add nucleus resident    */ 00282200
*/*                                            exit              @LDA*/ 00282300
*/*    $P9= PIG2275  HBB5510  930812  PDHT:  SHOWHDR prolog updates  */ 00282400
*/*    $07= OY67146  HBB4420  931110  PDHT: Dynamic DEQ parmlist @07A*/ 00282500
*/*    $08= OW01117  HBB5510  931216  PDHT: Update prolog        @08A*/ 00282800
*/*    $D2= DR20001  HBB6601  950907 PD00KV: Split from SC1CM    @D2A*/ 00282900
*/*    $09= OW22390  HBB4430  960122  PDKV: Correct FG1B mapping @09A*/ 00283000
*/*    $LE= IEEESVCD HBB6606  970807  PD00XB:  Additional FP regs    */ 00283100
*/*    $PA= PWA0286  JBB6607  980813  PDHT:  Add two-pass SD2 flag   */ 00283200
*/*                                                              @PAA*/ 00283300
*/*    $0A= OW36979  HBB6606  990107  PDKV: Remove * in comment, and */ 00283400
*/*                   correct ASM section variable information   @0AA*/ 00283500
*/*    $LF= 64BITSDU HBB7703  971101  PD00XB:  64-bit GPRs           */ 00283600
*/*                                                                  */ 00283700
*/********************** END OF SPECIFICATIONS ***********************/ 00283800
*/*A000000-999999                                            @G383P1U*/ 00283900
*        %GOTO RTSDPLS;     /*SET UP BILINGUAL MAPPING                  00284100
         MACRO                                                          00290000
         IHARTSD                                                        00300000
RTSD     DSECT ,                  BILINGUAL MAPPING OF RTSD             00310000
         IEZBITS  ,               GENERATE SYMBOLIC BIT NAMES           00320000
RTSDKEEP DS    0CL56              STATIC PORTION OF RTSD           @LBC 00325000
RTSDID   DS    CL4                EBCDIC IDENTIFIER RTSD                00330000
RTSDEXTB DS    A                  ADDRESS OF SDUMP EXIT TABLE  @G386P31 00380000
RTSDDNUM DS    CL4                DUMP NUMBER FOR PRDSEQ           @L4A 00413300
RTSDDPPF DS    A                  DPL-in-DUMPSRV-private queue fwd @06A 00424300
RTSDDPPB DS    A                  DPL-in-DUMPSRV-private queue bwd @06A 00435300
RTSDSTKN DS    XL8                STOKEN of DUMPSRV address space  @06A 00446300
RTSDSTRB DS    A                  POINTER TO THE BEGINNING OF THE       00496300
*                                 STRLIST STRUCTURE AND RANGE           00546300
*                                 TABLE                            @LAC 00596300
RTSDSTRE DS    A                  POINTER TO THE last byte of the       00646300
*                                 STRLIST STRUCTURE AND RANGE           00696300
*                                 TABLE                            @LAC 00746300
RTSDCRSA DS    A                  Pointer to a CRSA to be passed as     00796300
*                                 input to IXLXLFXR                @LBA 00846300
RTSDDBUF DS    A                  Pointer to data buffer to be passed   00896300
*                                 as input to IXLXLFXR             @LBA 00946300
RTSDXADR DS    A                  Address of SDRTX                 @LCA 00979600
         DS    2F                 RESERVED                         @LCC 01012900
         DS    3F                 RESERVED                         @LBC 01046300
RTSDHAID DS    H                  ASID OF THE CALLERS HOME SPACE        01300000
         DS    H                  RESERVED                              01344100
RTSDXPSW DS    CL8                CROSS MEMORY PSW ON ENTRY TO SDUMP    01388200
RTSDRSAD DS    0CL8               ADDRESSABILITY TO THE CALLERS         01394500
*                                 REGISTER SAVE AREA           @ZMB0483 01400800
         DS    H                  RESERVED                     @ZMB0483 01407100
RTSDRSAS DS    H                  SASID FOR THE SAVE AREA      @ZMB0483 01413400
         DS    H                  RESERVED                     @ZMB0483 01419700
RTSDRPAS DS    H                  PASID FOR THE SAVE AREA      @ZMB0483 01426000
RTSDASCB DS    A                  ASCB OF ADDRESSABLE ADDRESS SPACE     01432300
*                                 OF SDUMP CALLER ON ENTRY     @G38EP1U 01476400
RTSDCMLA DS    A                  ASCB ADDR OF ASID WHOSE CML LOCK IS   01520500
*                                 HELD                                  01564600
RTSDCMSV DS    CL8                SAVE AREA FOR CMSET LOGIC    @G860P31 01565700
         DS    A                  RESERVED                         @04C 01567900
*                                 ANALYSIS ROUTINE IEAVTSPR    @G860P31 01569000
RTSDRTRN DS    A                  COMMON RETURN SAVE AREA      @G386P1U 01570100
RTSDCTCB DS    A                  ADDRESS OF CALLERS TCB           @L4C 01571200
RTSDCSAV DS    A                  ADDRESS OF SDUMP CALLERS              01572300
*                                 SAVE AREA                    @G38EP1U 01573400
RTSDCSDW DS    A                  ADDRESS OF CALLERS SDWA      @G38VP1U 01575600
RTSDASID DS    CL2                ASID OF CALLERS SDWA         @G38VP1U 01576700
RTSDFLG1 DS    0CL2               WORKING FLAGS FOR SVC DUMP       @T1C 01577400
RTSDFG1A DS    CL1                FIRST BYTE OF FLAGS              @T1A 01578100
RTSDASCK EQU   BIT0               USED TO CAUSE THE SDADASID SUBROUTINE 01578900
*                                 TO ONLY CHECK AN ASID AND NOT ADD IT  01580000
*                                 TO THE ASID TABLE            @G860P31 01581100
RTSDSPGF EQU   BIT1               0 - PROCESS LOCAL SUBPOOLS            01582200
*                                 1 - PROCESS GLOBAL SUBPOOLS  @G860P31 01583300
RTSDISPR EQU   BIT2               1 - IEAVTSPR IS IN CONTROL            01584400
*                                 0 - SPR NOT IN CONTROL       @G860P31 01585500
RTSDASTF EQU   BIT3               ADDRESS SPACE TABLE FLAG TELLS        01586600
*                                 SUBROUTINE SDADASID WHETHER TO TURN   01587700
*                                 ON THE RTSDDMPA FLAG FOR AN ASID      01588800
*                                 1 - DO NOT TURN ON THE DMPA FLAG      01589900
*                                 0 - TURN ON THE DMPA FLAG    @G860P31 01591000
RTSDAMOD EQU   BIT4               ADDRESS MODE OF SDUMP CALLER          01592100
*                                 1 - AMODE 31   0 - AMODE 24  @G860P31 01593200
RTSDASDW EQU   BIT5               THE COPIED SDWA IS USABLE    @G38VP1U 01594300
RTSDVCPU EQU   BIT6               ALL CPUS ARE VALID AND NOT VM    @L1A 01595400
RTSDRSCD EQU   BIT7               1 - RSM SERIALIZATION MUST BE         01596500
*                                 OBTAINED IN MODULE IEAVTSDX.          01597600
*                                 0 - RSM SER.  CAN BE OBTAINED IN      01598700
*                                 IEAVTSSD.                    @G860P31 01599800
RTSDFG1B DS    CL1                SECOND BYTE OF FLAGS             @T1A 01600600
RTSDDOTR EQU   BIT0               1 - DO THE SNAPTRC               @09C 01601200
RTSDSKIP EQU   BIT1               1 - SKIP FULL SRB CODE           @09C 01601800
RTSDSDSC EQU   BIT2               1 - SDS IS COMPLETE              @09C 01602400
RTSDTERM EQU   BIT3               1 - AD00 HAS TERMINATED          @09C 01603000
RTSDDYNF EQU   BIT4               Used by IEAVTS3F to indicates if any  01603600
*                                 IEAVTSD3 could not establish a        01604300
*                                 dynamic area                     @09C 01604600
RTSDGDSC EQU   BIT5               1 - SDS is storing information        01604900
*                                 about the Global data space in the    01605200
*                                 DPL                              @09C 01605400
RTSDSD2S EQU   BIT6               SD2 SRB has been scheduled       @09C 01605600
RTSD2SD2 EQU   BIT7               SD2 INVOKED FOR SECOND PHASE     @PAA 01605700
         DS    CL1                RESERVED                         @L2A 01605800
         DS    CL1                RESERVED                     @G860P31 01606400
RTSDFNCD DS    H                  FUNCTION CODE PASSED TO IEAVTSPR      01607500
*                                 1 - COPYPARM  2 - VLDCB  3 - SDSUBPL  01608600
*                                 4 - SDASIDS                  @G860P31 01609700
         DS    CL8                RESERVED                         @P3C 01610200
RTSDDATA DS    0F                 USER DATA FIELD WHICH IS ZEROED AT    01610800
*                                 THE START OF EACH DUMP                01611900
*******************************************************************@0AC 01612900
RTSDSES  DS    0CL16              DATA RELATED TO DUMPING THE STRLIST   01613900
*                                                                  @LBC 01614900
RTSDSTR# DS    H                  NUMBER OF STRUCTURES IN THE STRLIST   01615900
*                                 STRUCTURE AND RANGE                   01616900
*                                 TABLE                            @LAC 01617900
         DS    H                  RESERVED                         @LAC 01618900
RTSDSTRI DS    F                  INDEX FOR SFDPL                  @LBA 01619900
         DS    CL8                Reserved                         @LBA 01620900
RTSDSRR  DS    0CL32              WORK AREA USED BY SDSESTAE       @LBA 01621900
RTSD14S1 DS    A                  SAVE RETURN ADDRESS              @LBA 01622900
RTSDSDWA DS    A                  SAVE POINTER TO SDWA             @LBA 01623900
RTSDABND DS    F                  SAVE ABEND CODE                  @LBA 01624900
RTSD14S2 DS    A                  SAVE 2ND RETURN ADDRESS          @LBA 01625900
RTSDDEQ  DS    0CL20              USED FOR DEQ                     @0AC 01626400
RTSDPOST DS    CL16               USED FOR POST                    @0AC 01626900
         DS    CL4                REMAINING DEQ FIELD              @0AA 01627400
         DS    CL136              RESERVED                         @07C 01628000
RTSDSCNV DS    CL32               IARSSCNV PARAMETER LIST          @LDC 01628900
RTSDDSL1 DS    F                  SIZE OF 1ST AS SECTION IN DSP    @L8A 01630000
RTSDDSPL DS    F                  SIZE OF OTHER A.S. SECTIONS      @L8A 01634100
RTSDSPGL DS    A                  PTR TO GLOBAL SUBPOOL LIST   @G860P31 01638300
RTSDREUS DS    0CL192             REUSABLE WORK AREA               @L2C 01639400
RTSDLSTN DS    0F                 ADDR OF NEXT FREE LISTA TABLE ENTRY   01640500
RTSDSVSD DS    A                  SAVE AREA FOR ADDRESS OF SDWA ACROSS  01641600
*                                 CALL TO SDXFRSUM             @G860P31 01642700
RTSDLEND DS    0F                 ADDRESS OF END OF THE LISTA AREA      01643800
RTSDSVFR DS    A                  SAVE AREA USED BY CHFRR TO SAVE THE   01644900
*                                 RETURN ADDRESS TO RTM        @G860P31 01646000
RTSDIDX1 DS    H                  SVC DUMP WORKING INDEX ONE            01653000
RTSDIDX2 DS    H                  SVC DUMP WORKING INDEX TWO            01655000
RTSDPTR1 DS    0F                 SVC DUMP WORKING POINTER         @0AC 01655800
RTSDFR6W DS    A                  FRR 6 WORK WORK AREA ADDRESS @G860P31 01656600
RTSDPTR2 DS    A                  SVC DUMP WORKING POINTER     @G860P31 01657400
RTSDENDA DS    A                  ADDRESS OF END OF USER SUPPLIED       01658200
*                                 DATA AREA                    @G860P31 01659000
RTSDLPRN DS    A                  TEMP PTR INTO USER DATA AREA @G860P31 01659800
RTSDRTN1 DS    F                  REG 14 SAVE AREA             @G860P31 01661400
RTSDRTN2 DS    F                  REG 14 SAVE AREA             @G860P31 01663000
RTSDSPPT DS    A                  WORK PTR FOR PROCESSING THE USER      01663800
RTSDRSV3 DS    F                  RESERVED                     @G860P31 01664000
RTSDRSV4 DS    F                  RESERVED                     @G860P31 01664200
RTSDSDXS DS    CL72               REGISTER SAVE AREA FOR IEAVTSDX       01664700
*                                 PROCESSING                       @L2A 01664800
RTSDSRBS DS    CL72               REGISTER SAVE AREA FOR IEAVTSRB       01664900
*                                 PROCESSING                       @L2A 01665000
RTSDLTBL DS    CL484              STORAGE RANGE TABLE USED FOR          01665400
*                                 STORAGE, LIST, AND LISTA     @G860P31 01666200
RTSDSUBL DS    CL200              SUBPOOL LIST.  RTSDSPGL AND RTSDSPLC  01667000
*                                 POINT INTO THIS AREA         @G860P31 01667800
RTSDKEYS DS    0CL16              COPY OF USER KEY LIST        @G860P31 01668600
RTSDKEYC DS    CL1                COUNT OF NUMBER OF KEYS      @G860P31 01669400
RTSDKEY  DS    CL15               ARRAY OF KEYS                @G860P31 01670200
RTSDCRGS DS    0CL64              CALLERS CONTROL REGISTERS        @P8C 01670300
         DS    F                  CONTROL REGISTER 0               @L3A 01670400
RTSDXMST DS    0CL28              CROSS MEMORY STATUS SAVE AREA    @P8C 01670500
RTSDXCR1 DS    0F                 CONTROL REGISTER ONE             @L3M 01670600
RTSDPSTO DS    F                  PRIMARY STO                      @L3M 01670700
         DS    F                  RESERVED  -  UNUSED              @L3M 01670800
RTSDXCR3 DS    0F                 CONTROL REGISTER 3               @L3M 01670900
RTSDXAKM DS    H                  AUTHORIZATION KEY MASK           @L3M 01671000
RTSDSAID DS    H                  SECONDARY ASID                   @L3M 01671100
RTSDXCR4 DS    0F                 CONTROL REGISTER 4               @L3M 01671200
RTSDXMAI DS    H                  AUTHORIZATION INDEX              @L3M 01671300
RTSDPAID DS    H                  PRIMARY ASID                     @L3M 01671400
RTSDXCR5 DS    F                  CONTROL REGISTER 5               @L3M 01671500
         DS    F                  RESERVED  -  UNUSED              @L3M 01671600
RTSDXCR7 DS    0F                 CONTROL REGISTER 7               @L3M 01671700
RTSDSSTO DS    F                  SECONDARY STO                    @L3M 01671800
RTSDCRG8 DS    CL4                CONTROL REGISTER 8               @P8C 01671900
         DS    CL24               CONTROL REGISTERS 9 - 14         @P8A 01672000
RTSDCRGF DS    CL4                CONTROL REGISTERS 15             @P8A 01672100
RTSDARGS DS    0CL64              CALLERS ACCESS REGISTERS         @P8C 01672200
RTSDAREG DS    CL64               ACCESS REGISTERS 0 - 15          @P8A 01672300
         DS    CL40               Reserved                         @LFC 01672400
RTSDAFPR DS    0CL100             Additional FP regs               @LEA 01672500
RTSDFPR1 DS    CL8                FPR 1                            @LEA 01672600
RTSDFPR3 DS    CL8                FPR 3                            @LEA 01672700
RTSDFPR5 DS    CL8                FPR 5                            @LEA 01672800
RTSDFPR7 DS    CL8                FPR 7                            @LEA 01672900
RTSDFPR8 DS    CL8                FPR 8                            @LEA 01673000
RTSDFPR9 DS    CL8                FPR 9                            @LEA 01673100
RTSDFP10 DS    CL8                FPR 10                           @LEA 01673200
RTSDFP11 DS    CL8                FPR 11                           @LEA 01673300
RTSDFP12 DS    CL8                FPR 12                           @LEA 01673400
RTSDFP13 DS    CL8                FPR 13                           @LEA 01673500
RTSDFP14 DS    CL8                FPR 14                           @LEA 01673600
RTSDFP15 DS    CL8                FPR 15                           @LEA 01673700
RTSDFPCR DS    CL4                FP Control reg                   @LEA 01673800
         DS    CL4                RESERVED                         @LFA 01673900
RTSDG64H DS    CL64               Bits 0-31 of GPRs                @LFA 01674000
RTSDHDRD DS    0CL101             DUMP HEADER DATA             @G860P31 01675000
RTSDHDRL DS    CL1                LENGTH OF HEADER             @G860P31 01675800
RTSDHDR  DS    CL100              USER SUPPLIED DUMP TITLE     @G860P31 01676600
         DS    CL3                RESERVED                              01677400
RTSDPADR DS    F                  ADDRESS OF SDUMP PARAMETER LIST  @01A 01677800
RTSDCIDD DS    0CL51              CALLER'S ID DATA                 @01A 01678200
RTSDCIDL DS    CL1                LENGTH OF CALLER'S ID            @01A 01678600
RTSDCID  DS    CL50               CALLER'S ID                      @01A 01679000
         DS    CL57               SDUMP PARM LIST MOVED OUT OF MAIN     01679400
*                                 MAPPING                          @02C 01679800
RTSDXATB DS    0CL320             EXTENSION ASID TABLE - CONTAINS      *01680700
                                  BITS AND LISTA, LISTD POINTERS BY    *01680800
                                  ASID                             @L6C 01680900
RTSDPTRT DS    0CL320             TABLE HAS 16 ENTRIES AND IS INDEXED  *01681000
                                  USING THE RTCTINDX FIELD         @L6C 01681100
RTSDTCTL DS    F                  CONTROL AND DATA BITS FOR THIS ASID  *01681200
                                                                   @L6M 01681300
RTSDDMPA EQU   BIT0               INDICATE THIS ADDRESS SPACE IS TO BE  01681400
*                                 DUMPED FOR REQUESTED SDATA OPTIONS    01681500
*                                                                  @L6M 01681600
RTSDTPTR DS    A                 POINTER TO LISTA RANGES THIS ASID @L6M 01681700
RTSDSPLC DS    A                  POINTER TO LOCAL SUBPOOL LIST    @L6M 01681800
RTSDLDAS DS    A                  POINTER TO LISTD ADDRESS SPACE       *01681900
                                  RANGES                           @L6A 01682000
RTSDLDDS DS    A                  POINTER TO LISTD DATA SPACE          *01682100
                                                                   @L6A 01682200
         DS    CL300              DEFINE THE REST OF RTSDPTRT      @L6C 01682300
         DS    CL8                RESERVED                         @L8C 01682400
RTSDLDNX DS    A                  INDEX INTO THE LISTD TABLE       @L6A 01682600
RTSDGRS  DS    CL64               GRS FOR DUMP, FROM AD00 TO SDH   @L5A 01682700
RTSDMODN DS    CL8                MODULE NAME, FROM AD00 TO SDH    @L5A 01682800
RTSDFPRS DS    CL32               FPRS FOR DUMP, FROM AD00 TO SDH  @L5A 01682900
RTSDSRPL DS    CL40               STOP/RESET PARAMETER LIST        @P1A 01683100
RTSDSRRG DS    CL64               AREA TO SAVE REGS FOR S/R        @P1A 01683300
RTSDSPSW DS    CL8                PSW FOR RESET                    @0AC 01683500
RTSDSRSA DS    CL72               SAVE AREA FOR CALLING S/R        @P1A 01683700
RTSDSROA DS    CL12               S/R OUTPUT AREA                  @P1A 01683900
RTSDSRXM DS    CL8                AREA FOR CRS 3-4                 @P1A 01684000
RTSDSRFL DS    XL4                FLAGS FOR STOP/RESET             @P1A 01684100
RTSDSRLS DS    CL4                CR 15 - LINKAGE STACK            @P7A 01684300
         DS    CL4                RESERVED                         @LFC 01684500
         DS    CL20               RESERVED                         @LFC 01684700
         DS    0D                                                       01684900
RTSDSLRP DS    0CL400             SLIP REG/PSW AREA                @LFC 01685100
RTSDSLPW DS    CL8                SLIP TRAP PSW                @G860P31 01685300
RTSDSLC3 DS    F                  SLIP TRAP CR3 (SASID)        @G860P31 01685500
RTSDSLC4 DS    F                  SLIP TRAP CR4 (PASID)        @G860P31 01685700
RTSDSLRG DS    CL64               SLIP TRAP REGS               @G860P31 01685900
RTSDSLAR DS    CL64               SLIP TRAP ACCESS REGS            @L3A 01686100
RTSDSLCR DS    CL64               SLIP TRAP CONTROL REGS           @L3A 01686300
RTSDSLG6 DS    CL64               SLIP G64H                        @LFA 01686500
         DS    0D                                                       01686700
RTSDC64S DS    CL128              ESAME CRs                        @LFA 01687200
RTSDLEN  EQU   *-RTSD             CALCULATE RTSD LENGTH                 01687700
         SPACE 2                                                        01687900
* START OF RTSDEXIT BILINGUAL MAPPING                          @G386P31 01688600
RTSDEXIT DSECT                    SDUMP EXIT TABLE             @G386P31 01692100
RTSDEXFL DS    0CL4               EXIT FLAGS                   @G386P31 01695600
RTSDEXMS DS    CL2                EXIT MASK                    @G386P31 01699100
         DS    CL1                RESERVED                     @G386P31 01702600
RTSDEXAT DS    CL1                EXIT ATTRIBUTES              @G386P31 01706100
RTSDEXLC EQU   BIT0               LOCAL EXIT BIT               @G386P31 01709600
RTSDEXGB EQU   BIT1               GLOBAL EXIT BIT              @G386P31 01713100
RTSDEXSD EQU   BIT2               SDUMP EXIT BIT               @G38FP31 01716600
RTSDEXSM EQU   BIT3               SYSMDUMP EXIT BIT            @G38FP31 01718300
RTSDEXON EQU   BIT4               ONE TIME ONLY EXIT BIT       @ZMB0360 01719100
RTSDXDFP EQU   BIT5               DFP EXIT - CHECK THAT SMSX            01719400
*                                  IS INSTALLED                    @L7A 01719700
RTSDEXEG EQU   BIT6               EARLY GLOBAL EXIT                @P6A 01719900
RTSDEXNC EQU   BIT7               NUCLEUS RESIDENT EXIT            @LDA 01720000
RTSDEXAD DS    A                  EXIT LOAD ADDRESS            @G386P31 01720100
RTSDXLEN EQU   *-RTSDEXIT         CALCULATE RTSDEXIT LENGTH    @G386P31 01723600
         SPACE 2                                                        01727100
* START OF RTSDRANG BILINGUAL MAPPING                          @G386P31 01730600
RTSDRANG DSECT                    LISTA RANGE MAPPING          @G386P31 01734100
RTSDBADR DS    A                  BEGINNING ADDRESS OF RANGE   @G386P31 01737600
RTSDEADR DS    A                  ENDING ADDRESS OF RANGE      @G386P31 01741100
RTSDRLEN EQU   *-RTSDRANG         CALCULATE RTSDRANG LENGTH    @G386P31 01744600
* START OF SUBPOOL BILINGUAL MAPPING                                    01745300
RTSDSPLS DSECT                    SUBPOOL LIST FOR AND ASID OR A        01746000
*                                 GLOBAL LIST                  @G860P31 01746700
RTSDSPCT DS    H                  COUNT OF SUBPOOLS TO FOLLOW           01747400
*                                                              @G860P31 01748100
RTSDSPNM DS    H                  SUBPOOL NUMBERS              @G860P31 01748600
* COPY OF SDUMP PARAMETER LIST MAPPING                                  01749200
RTSDSDPL DSECT                    SDUMP PARAMETER LIST MAPPING     @01A 01749600
         MEND                                                           01750000
*    */                                                                 01800000
*%RTSDPLS:  ;                                                           01850000
*  DCL RTSDID1 CHAR(4) CONSTANT('RTSD');  /* ACRONYM RTSD       @L2A*/  01866600
*                                                                       01883200
*  DCL 1 RTSD BASED(RTCTRTSD),    /* RTCT SDUMP EXTENSION            */ 01900000
*      2  RTSDKEEP,               /* STATIC PORTION OF RTSD      @L2A*/ 01950000
*         3  RTSDID CHAR(4),      /* EBCDIC IDENTIFIER -RTSD-        */ 02000000
*         3  RTSDEXTB  PTR(31),   /* ADDRESS OF SDUMP EXIT TABLE @L2M*/ 02050000
*         3  RTSDDNUM,            /* DUMP NUMBER FOR PRDSEQ      @L4A*/ 02066600
*            4  RTSDSVNM FIXED(16), /* NUMBER OF SVC DUMPS       @L4A*/ 02083200
*            4  RTSDALLD FIXED(16), /* NUMBER OF SVC DUMPS AND          02099800
*                                    SYSMDUMPS                   @L4A*/ 02116400
*        3 RTSDDPPF PTR(31),      /* DPL-in-DUMPSRV-private queue       02120200
*                                    first element (forward)     @06A*/ 02124000
*        3 RTSDDPPB PTR(31),      /* DPL-in-DUMPSRV-private queue       02127800
*                                    last element (backward)     @06A*/ 02131600
*        3 RTSDSTKN CHAR(8),      /* STOKEN of DUMPSRV address space    02135400
*                                                                @06A*/ 02139200
*        3 RTSDSTRB PTR(31),      /* Pointer to the beginning of        02189200
*                                    the STRLIST structure              02239200
*                                    and range table - used by          02289200
*                                    SDUMP only                  @LAC*/ 02339200
*         3 RTSDSTRE PTR(31),     /* Pointer to the last byte of        02389200
*                                    the STRLIST structure              02439200
*                                    and range table             @LAC*/ 02489200
*         3 RTSDCRSA PTR(31),     /* Pointer to the CRSA passed as      02539200
*                                    input to IXLXLFXR           @LBA*/ 02589200
*         3 RTSDDBUF PTR(31),     /* Pointer to data buffer passed as   02639200
*                                    input to IXLXLFXR           @LBA*/ 02689200
*         3 RTSDXADR PTR(31),     /* Address of RTSD extension   @LCA*/ 02722500
*         3 *       CHAR(8),      /* Reserved                    @LCC*/ 02755800
*      2  *       CHAR(12),       /* RESERVED                    @LBC*/ 02789200
*      2  RTSDHAID  FIXED(15),   /*ASID OF THE CALLERS HOME ADDRESS     03100000
*                                  SPACE */                             03144400
*      2  *   FIXED(15),        /*RESERVED                           */ 03188800
*      2  RTSDXPSW  CHAR(8) BDY(DWORD), /*CROSS MEMORY                  03205700
*                                  PSW ON ENTRY TO SDUMP */             03222600
*      2  RTSDRSAD  CHAR(8) BDY(WORD), /* ADDRESSABILITY TO THE CALLERS 03239500
*                                  REGISTER SAVE AREA        @ZMB0483*/ 03245800
*        3 *        FIXED(16),  /* RESERVED                  @ZMB0483*/ 03252100
*        3 RTSDRSAS FIXED(16),  /* SASID FOR THE SAVE AREA   @ZMB0483*/ 03258400
*        3 *        FIXED(16),  /* RESERVED                  @ZMB0483*/ 03264700
*        3 RTSDRPAS FIXED(16),  /* PASID FOR THE SAVE AREA   @ZMB0483*/ 03271000
*      2  RTSDASCB  PTR(31),    /*ASCB ADDR OF ADDRESSABLE ADDRESS      03277600
*                             SPACE OF SDUMP CALLER ON ENTRY @G38EP1U*/ 03322000
*      2  RTSDCMLA  PTR(31),    /*ASCB ADDR OF ASID WHOSE CML LOCK IS   03366400
*                                                           HELD     */ 03410800
*      2  RTSDCMSV  CHAR(8) BDY(WORD),    /*SAVE AREA FOR CMSET LOGIC   03460800
*                                                            @G860P31*/ 03510800
*      2  *         PTR(31),   /* Reserved                       @04C*/ 03560800
*      2  RTSDRTRN  PTR(31),   /*COMMON SDUMP RETURN SAVE    @G386P1U*/ 03620200
*      2  RTSDCTCB  PTR(31),   /* ADDRESS OF CALLERS TCB         @L4C*/ 03647700
*      2  RTSDCSAV  PTR(31),   /*ADDRESS OF THE SDUMP CALLERS SAVE AREA 03675200
*                                                            @G38EP1U*/ 03684500
*      2  RTSDCSDW  PTR(31),   /* ADDRESS OF CALLERS SDWA    @G38VP1U*/ 03685500
*      2  RTSDASID  CHAR(2),   /* ASID OF CALLERS SDWA       @G38VP1U*/ 03686000
*      2  RTSDFLG1 BIT(16),   /* WORKING FLAGS FOR SVC DUMP  @G860P31*/ 03686500
*        3 RTSDASCK BIT(1),   /* USED TO CAUSE THE SDADASID SUBROUTINE  03687000
*                               TO ONLY CHECK AN ASID AND NOT ADD IT    03687500
*                               TO THE ASID TABLE.           @G860P31*/ 03688000
*        3 RTSDSPGF BIT(1),   /* 0 - PROCESS LOCAL SUBPOOLS             03688500
*                                1 - PROCESS GLOBAL SUBPOOLS @G860P31*/ 03689000
*        3 RTSDISPR BIT(1),   /* 1 - IEAVTSPR IS IN CONTROL             03689500
*                                0 - SPR NOT IN CONTROL      @G860P31*/ 03690000
*        3 RTSDASTF BIT(1),   /* ADDRESS SPACE TABLE FLAG TELLS         03690500
*                                SUBROUTINE SDADASID WHETHER TO TURN ON 03691000
*                                THE RTSDDMPA FLAG FOR AN ASID.         03691500
*                                1 - DO NOT TURN ON THE DMPA FLAG       03692000
*                                0 - TURN ON THE DMPA FLAG   @G860P31*/ 03692500
*        3 RTSDAMOD BIT(1),   /* ADDRESS MODE OF SDUMP CALLER           03693000
*                                1 - AMODE 31   0 - AMODE 24 @G860P31*/ 03693500
*        3 RTSDASDW BIT(1),   /* THE COPIED SDWA IS USABLE   @G38VP1U*/ 03694000
*        3 RTSDVCPU BIT(1),   /* ALL CPUS ARE VALID AND NOT VM   @L1A*/ 03694500
*        3 RTSDRSCD BIT(1),   /* 1 - RSM SERIALIZATION MUST BE OBTAINED 03695000
*                                IN MODULE IEAVTSDX.  0 - RSM SER. CAN  03695500
*                                BE OBTAINED IN IEAVTSSD.    @G860P31*/ 03696000
*        3 RTSDDOTR BIT(1),   /* 1 - DO THE SNAPTRC AT THE FIRST        03696500
*                                AVAILABLE MOMENT.  FOR SCHEDULED DUMPS 03697000
*                                ONLY.                       @G860P31*/ 03697500
*        3 RTSDSKIP BIT(1),   /* 1 - SKIP FULL SRB PROCESSING FOR       03698000
*                                SUCCESSFUL TRACE SRB.       @G860P31*/ 03698500
*        3 RTSDSDSC BIT(1),   /* 1 - SDS IS COMPLETE             @P5A*/ 03698800
*        3 RTSDTERM BIT(1),   /* 1 - AD00 HAS TERMINATED     @YA20575*/ 03699000
*        3 RTSDDYNF BIT(1),   /* Used by IEAVTS3F to indicate if any    03699100
*                                IEAVTSD3 was unable to establish a     03699200
*                                dynamic area                    @L8A*/ 03699300
*        3 RTSDGDSC BIT(1),   /* If '1'B then IEAVTSDS is in the        03699400
*                                processes of storing information       03699500
*                                about the Global Data Space in the     03699600
*                                DPL                             @L9A*/ 03699700
*        3 RTSDSD2S BIT(1),   /* SD2 SRB has been scheduled      @05A*/ 03699900
*        3 RTSD2SD2 BIT(1),         /* SD2 invoked second time   @PAA*/ 03700100
*      2 *        FIXED(8),  /* RESERVED @L2A*/                         03700300
*      2 *        FIXED(8),  /* RESERVED                     @G860P31*/ 03700500
*      2  RTSDFNCD FIXED(15), /* FUNCTION CODE PASSED TO IEAVTSPR       03701000
*                                1 - COPYPARM  2 - VALDCB  3 - SDSUBPL  03701500
*                                4 - SDASIDS                 @G860P31*/ 03702000
*      2  RTSDRSV1 CHAR(8),   /* RESERVED                        @P3C*/ 03702300
*      2  RTSDDATA BDY(DWORD,5), /* USER DATA FIELD WHICH IS ZEROED AT  03702600
*                               THE START OF EACH DUMP.          @LFC*/ 03702900
*       3 RTSDSES,              /* Data related to dumping the          03703300
*                                  STRLIST                       @LAC*/ 03703600
*         5 RTSDSTR# FIXED(16), /* Number of structures in the          03703900
*                                  STRLSIT      structure table  @LAC*/ 03704200
*         5 *        FIXED(16), /* Reserved                      @LAC*/ 03704500
*         5 RTSDSTRI FIXED(31), /* Index for looping through SFDPL      03704800
*                                   table when doing conversions.       03705100
*                                   Set by IEAVTSDS, checked by         03705400
*                                   SDSESTAE                     @LBA*/ 03705700
*         5 *        CHAR(8),   /* Reserved                      @LBA*/ 03706000
*       3 RTSDSRR,              /* Work area used by SDESTAEX in        03706300
*                                  SRR                           @LBA*/ 03706600
*         5 RTSD14S1 PTR(31),   /* Save return address           @LBA*/ 03706900
*         5 RTSDSDWA PTR(31),   /* Save pointer to SDWA          @LBA*/ 03707200
*         5 RTSDABND FIXED(31), /* Save Abend code               @LBA*/ 03707500
*         5 RTSD14S2 PTR(31),   /* Save 2nd return address       @LBA*/ 03707800
*         5 RTSDDEQ  CHAR(20),  /* Storage for DEQ macro         @07A*/ 03707900
*           7 RTSDPOST CHAR(16),  /* Storage for POST macro      @07C*/ 03708000
*       3 * CHAR(136),          /* Reserved                      @07A*/ 03708100
*       3 RTSDSCNV CHAR(32),    /* IARSSCNV parameter list       @LDA*/ 03708300
*         5 *      CHAR(LENGTH(SCNVPL)), /* Error if parmlist grows to  03708400
*                                      more than 32 bytes long   @LDA*/ 03708500
*       3 RTSDDSL1 FIXED(31), /* SIZE OF 1ST A.S. IN SUMMARY DUMP       03709000
*                                DATA SPACE                      @L8A*/ 03710000
*       3 RTSDDSPL FIXED(31), /* SIZE OF ALL OTHER A.S. IN SUMMARY DUMP 03711000
*                                DATA SPACE                      @L8A*/ 03712000
*        3 RTSDSPGL PTR(31),   /* PTR TO GLOBAL SUBPOOL LIST @G860P31*/ 03713500
*        3 RTSDREUS,           /* REUSABLE WORK AREA         @G860P31*/ 03714000
*         5 RTSDLSTN PTR(31),  /*ADDR OF NEXT FREE LISTA TABLE ENTRY */ 03714500
*           7 RTSDSVSD PTR(31), /* SAVE AREA FOR ADDRESS OF SDWA ACROSS 03715000
*                                  CALL TO SDXFRSUM.         @G860P31*/ 03715500
*         5 RTSDLEND PTR(31),  /*ADDRESS OF END OF THE LISTA AREA    */ 03716000
*           7 RTSDSVFR PTR(31), /* SAVE AREA USED BY SCHFRR TO SAVE THE 03716500
*                                  RETURN ADDRESS TO RTM.    @G860P31*/ 03717000
*         5 RTSDIDX1 FIXED(15),    /*SVC DUMP WORKING INDEX ONE      */ 03717500
*         5 RTSDIDX2 FIXED(15),    /*SVC DUMP WORKING INDEX TWO      */ 03718000
*         5 RTSDPTR1 PTR(31),     /*SVC DUMP WORKING POINTER @G860P31*/ 03718500
*          6 RTSDFR6W PTR(31),    /*FRR 6 WORD WORK AREA ADDRESS        03719000
*                                                            @G860P31*/ 03719500
*         5 RTSDPTR2 PTR(31),     /*SVC DUMP WORKING POINTER @G860P31*/ 03720000
*         5 RTSDENDA PTR(31),     /*ADDRESS OF END OF A USER SUPPLIED   03720500
*                                    DATA AREA.              @G860P31*/ 03721000
*         5 RTSDLPRN PTR(31),     /* TEMP PTR INTO USER DATA AREA       03721500
*                                                            @G860P31*/ 03722000
*         5 RTSDRTN1 FIXED(31), /* REG 14 SAVE AREA        @G860P31*/   03722800
*         5 RTSDRTN2 FIXED(31), /* REG 14 SAVE AREA        @G860P31*/   03723600
*         5 RTSDSPPT PTR(31),     /* WORK PTR FOR PROCESSING THE USER   03724500
*                                    SUPPLIED SUBPOOL LIST   @G860P31*/ 03725000
*         5 RTSDRSV3 FIXED(31), /* RESERVED                  @G860P31*/ 03725100
*         5 RTSDRSV4 FIXED(31), /* RESERVED                  @G860P31*/ 03725200
*         5 RTSDSDXS CHAR(72),  /* REGISTER SAVE AREA FOR               03725300
*                                  IEAVTSDX PROCESSING           @L2A*/ 03725400
*         5 RTSDSRBS CHAR(72),  /* REGISTER SAVE AREA FOR               03725500
*                                  IEAVTSRB PROCESSING           @L2A*/ 03725600
*        3 RTSDLTBL CHAR(484),    /* STORAGE RANGE TABLE USED FOR       03725700
*                                  STORAGE, LIST, AND LISTA. @G860P31*/ 03726000
*        3 RTSDSUBL CHAR(200),    /* SUBPOOL LISTS. RTSDSPGL AND        03726500
*                             RTSDSPLC POINT INTO THIS AREA.@G860P31*/  03727000
*        3 RTSDKEYS CHAR(16),     /* COPY OF USER KEY LIST   @G860P31*/ 03727500
*          5 RTSDKEYC FIXED(8),   /* COUNT OF NUMBER OF KEYS @G860P31*/ 03728000
*          5 RTSDKEY(15) FIXED(8),/* ARRAY OF KEYS           @G860P31*/ 03728500
*        3 RTSDCRGS BDY(WORD),    /* CALLERS CONTROL REGISTERS   @L3A*/ 03728600
*         4 * FIXED(31),            /*CONTROL REGISTER 0         @L3A*/ 03728700
*         4 RTSDXMST,               /*CROSS MEMORY STATUS        @L3M*/ 03728800
*          5 RTSDXCR1 FIXED(31),    /*CONTROL REGISTER ONE       @L3M*/ 03728900
*             6 RTSDPSTO PTR(31),   /*PRIMARY STO VALUE          @L3M*/ 03729000
*          5 * FIXED(31),           /*CONTROL REGISTER 2         @L3M*/ 03729100
*          5 RTSDXCR3 FIXED(31),    /*CONTROL REGISTER 3         @L3M*/ 03729200
*             6 RTSDXAKM FIXED(16), /*AUTHORIZATION KEY MASK     @L3M*/ 03729300
*             6 RTSDSAID FIXED(16), /*SECONDARY ASID             @L3M*/ 03729400
*          5 RTSDXCR4 FIXED(31),    /*CONTROL REGISTER 4         @L3M*/ 03729500
*             6 RTSDXMAI FIXED(16), /*AUTHORIZATION INDEX        @L3M*/ 03729600
*             6 RTSDPAID FIXED(16), /*PRIMARY ASID               @L3M*/ 03729700
*          5 RTSDXCR5 FIXED(31),    /*CONTROL REGISTER 5         @L3M*/ 03729800
*          5 * FIXED(31),           /*CONTROL REGISTER 6         @L3M*/ 03729900
*          5 RTSDXCR7 FIXED(31),    /*CONTROL REGISTER 7         @L3M*/ 03730000
*             6 RTSDSSTO PTR(31),   /*SECONDARY STO              @L3M*/ 03730100
*         4 RTSDCRG8 CHAR(4),       /* CR 8                      @P1A*/ 03730200
*         4 * CHAR(24),             /* CRS 9-14                  @P1C*/ 03730300
*         4 RTSDCRGF CHAR(4),       /* CONTROL REG 15            @P1A*/ 03730400
*        3 RTSDARGS BDY(WORD),  /* CALLERS ACCESS REGISTERS      @L3A*/ 03730500
*         4 RTSDAREG(0:15) FIXED(32), /* ACCESS REGISTERS 0 - 15 @L3A*/ 03730600
*        3 * CHAR(40),            /* Reserved                    @LFC*/ 03730700
*        3 RTSDAFPR CHAR(100) BDY(WORD),  /* Additional FP regs  @LEA*/ 03730800
*          5 RTSDFPR1 CHAR(8),    /* FPR 1                       @LEA*/ 03730900
*          5 RTSDFPR3 CHAR(8),    /* FPR 3                       @LEA*/ 03731000
*          5 RTSDFPR5 CHAR(8),    /* FPR 5                       @LEA*/ 03731100
*          5 RTSDFPR7 CHAR(8),    /* FPR 7                       @LEA*/ 03731200
*          5 RTSDFPR8 CHAR(8),    /* FPR 8                       @LEA*/ 03731300
*          5 RTSDFPR9 CHAR(8),    /* FPR 9                       @LEA*/ 03731400
*          5 RTSDFP10 CHAR(8),    /* FPR 10                      @LEA*/ 03731500
*          5 RTSDFP11 CHAR(8),    /* FPR 11                      @LEA*/ 03731600
*          5 RTSDFP12 CHAR(8),    /* FPR 12                      @LEA*/ 03731700
*          5 RTSDFP13 CHAR(8),    /* FPR 13                      @LEA*/ 03731800
*          5 RTSDFP14 CHAR(8),    /* FPR 14                      @LEA*/ 03731900
*          5 RTSDFP15 CHAR(8),    /* FPR 15                      @LEA*/ 03732000
*          5 RTSDFPCR CHAR(4),    /* FP Control Reg              @LEA*/ 03732100
*        3 * CHAR(4),             /* RESERVED                    @LFA*/ 03732200
*        3 RTSDG64H CHAR(64) BDY(WORD), /* Bits 0-31 of GPRs     @LFA*/ 03732300
*        3 RTSDHDRD CHAR(101),    /* DUMP HEADER DATA        @G860P31*/ 03732400
*          5 RTSDHDRL FIXED(8),   /* LENGTH OF HEADER        @G860P31*/ 03732500
*          5 RTSDHDR CHAR(100),  /* USER SUPPLIED DUMP TITLE @G860P31*/ 03732600
*        3 * CHAR(3),             /* RESERVED                @G860P31*/ 03733000
*        3 RTSDPADR PTR(31),      /* ADDRESS OF THE SDUMP PARAMETER     03734400
*                                    LIST                        @01A*/ 03735800
*        3 RTSDCIDD CHAR(51),     /* CALLER'S ID DATA            @01A*/ 03737200
*          5 RTSDCIDL FIXED(8),   /* LENGTH OF ID                @01A*/ 03738600
*          5 RTSDCID CHAR(50),    /* CALLER'S ID                 @01A*/ 03740000
*        3 * CHAR(57),            /* RESERVED                    @02C*/ 03741400
*        3 RTSDXATB,   /*EXTENSION ASID TABLE - CONTAINS CONTROL BITS,  03743200
*                          LISTA AND LISTD POINTERS BY ASID      @L6C*/ 03744800
*          5 RTSDPTRT(16), /*TABLE HAS 16 ENTRIES AND IS INDEXED USING  03746400
*                                           THE RTCTINDX FIELD   @L6M*/ 03748000
*           7 RTSDTCTL BIT(32),   /* CONTROL AND DATA BITS FOR ASID     03749600
*                                                                @L6M*/ 03751200
*             8 RTSDDMPA BIT(1),  /*INDICATE THIS ADDRESS SPACE IS TO   03752800
*                                   BE DUMPED FOR REQUESTED SDATA       03754400
*                                   OPTIONS.                     @L6M*/ 03756000
*           7 RTSDTPTR PTR(31),   /* POINTER TO RANGES FOR THIS ASID    03757600
*                                                                @L6M*/ 03759200
*           7 RTSDSPLC PTR(31),   /* POINTER TO LOCAL SUBPOOL LIST      03760800
*                                                                @L6M*/ 03762400
*           7 RTSDLDAS PTR(31),   /* POINTER TO LISTD ADDRESS SPACE     03764000
*                                     RANGES                     @L6A*/ 03765600
*           7 RTSDLDDS PTR(31),   /* POINTER TO LISTD DATA SPACE        03767200
*                                     RANGES                     @L6A*/ 03768800
*        3 *       CHAR(8),       /* RESERVED                    @L8C*/ 03771200
*        3 RTSDLDNX PTR(31),      /* INDEX INTO LISTD TABLE      @L6A*/ 03773600
*        3 RTSDGRS CHAR(64),      /* GRS PASSED FROM AD00 INTO SDH      03775200
*                                    FOR SINGLE AS DUMP          @L5A*/ 03776800
*        3 RTSDMODN CHAR(8),      /* MODULE NAME FROM AD00 INTO SDH     03778400
*                                    FOR SINGLE AS DUMP          @L5A*/ 03780000
*        3 RTSDFPRS CHAR(32),     /* FPRS PASSED FROM AD00 INTO SDH     03781600
*                                    FOR SINGLE AS DUMP          @L5A*/ 03783200
*        3 RTSDSR,                /* AREA FOR STOP/RESET INFO           03783300
*                       THE RESET AREAS ARE SERIALIZED BY THE           03783400
*                       RTSDRSET BIT. ONLY THE SETTER OF THE BIT CAN    03783500
*                       USE THE FIELDS.                          @P1A*/ 03783600
*          5 RTSDSRPL CHAR(40),   /* STOP/RESET PARAMETER LIST   @P1A*/ 03783700
*          5 RTSDSRRG CHAR(64),   /* AREA TO SAVE REGS           @P1A*/ 03783800
*          5 RTSDSPSW CHAR(8),    /* PSW FOR RESET               @P1A*/ 03784000
*          5 RTSDSRSA CHAR(72),   /* SAVE AREA FOR CALLING S/R   @P1A*/ 03784200
*          5 RTSDSROA CHAR(12),   /* STOP/RESET OUTPUT AREA      @P1A*/ 03784400
*          5 RTSDSRXM CHAR(8),    /* XM CONTROL REGS             @P1A*/ 03784600
*          5 RTSDSRFL BIT(32) ABNL, /* FLAGS                     @P1A*/ 03784800
*            7 RTSDSTOC BIT(1),   /* STOP DONE                   @P1A*/ 03785000
*            7 RTSDRSET BIT(1),   /* RESET DONE, C/S SERIALIZED  @P1A*/ 03785200
*            7 RTSDSTOS BIT(1),   /* STOP PROCESS STARTED        @P1A*/ 03785300
*            7 * BIT(29),         /* RESERVED                    @P1A*/ 03785400
*          5 RTSDSRLS CHAR(4),    /* SAVE CR15 - LINKAGE STACK   @P7A*/ 03785500
*          5 * CHAR(4),           /* RESERVED                    @P7C*/ 03785600
*        3 * CHAR(20),            /* RESERVED                    @LFC*/ 03788600
*        3 RTSDSLRP BDY(DWORD),   /* SLIP reg/PSW area. Must map same   03791600
*                                    as SCVADPLS                 @LFA*/ 03794600
*          5 RTSDSLPW CHAR(8),    /* SLIP TRAP PSW           @G860P31*/ 03797600
*          5 RTSDSLC3 FIXED(31),  /* SLIP TRAP CR3 (SASID)   @G860P31*/ 03800600
*          5 RTSDSLC4 FIXED(31),  /* SLIP TRAP CR4 (PASID)   @G860P31*/ 03803600
*          5 RTSDSLRG(16) CHAR(4),/* SLIP TRAP REGS          @G860P31*/ 03806600
*          5 RTSDSLAR(16) CHAR(4),/* SLIP TRAP ACCESS REGS       @L3A*/ 03809600
*          5 RTSDSLCR CHAR(64),   /* SLIP TRAP CONTROL REGS      @L3A*/ 03812600
*          5 RTSDSLG6 CHAR(64) BDY(WORD), /* SLIP G64H           @LFA*/ 03815600
*          5 RTSDC64S CHAR(128) BDY(DWORD); /* ESAME CRs         @LFA*/ 03819000
* DCL RTSDRSON BIT(32) CONSTANT('40000000'X);  /* TURN ON RTSDRSET      03822400
*                                                                @P1A*/ 03824700
* DCL RTSDRSOF BIT(32) CONSTANT('BFFFFFFF'X);  /* TURN OFF RTSDRSET     03827000
*                                                                @P1A*/ 03829300
*      /* SDUMP EXIT TABLE                                   @G386P31*/ 03831600
*  DCL 1  RTSDEXIT(*) BASED(RTSDEXTB), /* SDUMP EXIT TABLE   @G386P31*/ 03834000
*       2 RTSDEXFL CHAR(4),    /* EXIT FLAGS                 @G386P31*/ 03880800
*        3 RTSDEXMS BIT(16),   /* EXIT MASK USED TO IDENTIFY THE EXIT   03927600
*                                 WITH AN SDUMP PARAMETER    @G386P31*/ 03974400
*        3 * CHAR(1),          /* RESERVED                   @G386P31*/ 04021200
*        3 RTSDEXAT BIT(8),    /* EXIT ATTRIBUTES            @G386P31*/ 04068000
*         4 RTSDEXLC BIT(1),   /* ON FOR LOCAL EXIT          @G386P31*/ 04114800
*         4 RTSDEXGB BIT(1),   /* ON FOR GLOBAL EXIT         @G386P31*/ 04161600
*         4 RTSDEXSD BIT(1),   /* ON FOR SDUMP EXIT          @G38FP31*/ 04208400
*         4 RTSDEXSM BIT(1),   /* ON FOR SYSMDUMP EXIT       @G38FP31*/ 04239600
*         4 RTSDEXON BIT(1),   /* ON FOR ONE TIME ONLY EXIT  @ZMB0360*/ 04270800
*         4 RTSDXDFP BIT(1),   /* ON FOR DFP EXIT - CHECK THAT          04278600
*                                 SMSX IS INSTALLED              @L7A*/ 04286400
*         4 RTSDEXEG BIT(1),   /* ON FOR EARLY GLOBAL EXIT       @P6A*/ 04291600
*         4 RTSDEXNC BIT(1),   /* ON FOR NUCLEUS RESIDENT EXIT   @LDA*/ 04296800
*       2 RTSDEXAD PTR(31);    /* EXIT LOAD MODULE ADDRESS   @G386P31*/ 04302000
*      /* ADDRESS RANGE MAPPING FOR LISTA                            */ 04350000
*  DCL 1 RTSDRANG BASED(RTSDLSTN), /* ADDRESS RANGE FOR LISTA        */ 04400000
*      3  RTSDBADR  PTR(31),   /*BEGINNING ADDRESS                   */ 04450000
*      3  RTSDEADR  PTR(31);   /*ENDING ADDRESS                      */ 04500000
*      /* SECONDARY MAPPING OF RTSDSUBL SUBPOOL LISTS        @G860P31*/ 04600000
*  DCL 1 RTSDSPLS BASED(RTSDSPPT), /* SUBPOOL LIST FOR AN ASID          04650000
*                                     OR A GLOBAL LIST       @ZMC0992*/ 04700000
*        3 RTSDSPCT FIXED(15), /*COUNT OF SUBPOOLS TO FOLLOW @G860P31*/ 04750000
*        3 RTSDSPNM(*) FIXED(16); /* SUBPOOL NUMBERS         @G860P31*/ 04800000
*  DCL   RTSDSDPL CHAR(MAX(184,LENGTH(SDUMP))) BASED(RTSDPADR); /*      04850000
*                                      SDUMP PARAMETER LIST      @LCC*/ 04900000
*  ?IARSSCNV MF(L,SCNVPL,BASED(ADDR(RTSDSCNV))); /* Subspace convert    04950000
*                                      service parameter list    @LDA*/ 05000000
