*        %GOTO RTCTPLSH;           /* BILINGUAL MAPPING                 00020043
         MACRO                                                          00100002
         IHARTCT                                                        00120043
.*                                     (INCOMPATIBLE OFFSETS   @G33CPHZ 00132043
.*                                      ON FIELDS ONLY USED    @G33CPHZ 00138043
.*                                      BY RTM DUMP ROUTINES   @G33CPHZ 00144043
.*                                      AND COMMANDS)          @G33CPHZ 00150043
         AGO   .RTCTBAL             ** SKIP PLS MACRO STATEMENT **   */ 00162043
*%RTCTPLSH: ;                       /* BAL/PLS HEADER                   00164043
.RTCTBAL ANOP                                                        */ 00166043
*                                                                       00170043
*/****************** START OF SPECIFICATIONS *************************/ 00171000
*/*                                                                  */ 00172000
*/*  Macro Name: IHARTCT                                             */ 00173000
*/*                                                                  */ 00173300
*/*  DSECT Name: RTCT                                                */ 00173600
*/*                                                                  */ 00174043
*/*  Descriptive Name: Recovery/Termination Control Table            */ 00174300
*/*                                                                  */ 00174643
*/*  Component: SVC Dump (SCDMP)                                 @D2C*/ 00174700
*/*                                                                  */ 00174800
*/*01* PROPRIETARY STATEMENT=                                        */ 00175000
*/***PROPRIETARY_STATEMENT********************************************/ 00175200
*/*  Proprietary Statement =                                         */ 00175400
*/*                                                                  */ 00176043
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 00176100
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 00176200
*/*              5647-A01 (C) COPYRIGHT IBM CORP 1980, 1999          */ 00176300
*/*                                                                  */ 00176500
*/*  Status = JBB6607                                                */ 00176600
*/*                                                              @LRC*/ 00176700
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00176800
*/*                                                                  */ 00176900
*/*  External Classification: DMTI                                   */ 00177000
*/*  End of External Classification: DMTI                            */ 00177100
*/*                                                                  */ 00177200
*/*  Eye Catcher: RTCT                                               */ 00177300
*/*  Offset:      0                                                  */ 00177400
*/*  Length:      4                                                  */ 00177500
*/*                                                                  */ 00177600
*/*  Function:                                                       */ 00177700
*/*     The RTCT provides a communication area between the various   */ 00177800
*/*  functions associated with dumping facilities, for SYSABEND,     */ 00177900
*/*  SYSMDUMP, SYSUDUMP, and SVC dumps.  It is used for coordination */ 00178000
*/*  of the dump related processes of task and system recovery, the  */ 00178100
*/*  memory termination controller, installation and operator        */ 00178200
*/*  defined dump requirements.                                      */ 00178300
*/*                                                                  */ 00178400
*/*  Method of Access:                                               */ 00178600
*/*    BAL  - A DSECT is always produced.                            */ 00179200
*/*           A using on RTCT gives addressability to all symbols.   */ 00179800
*/*    PL/S:                                                         */ 00180400
*/*         %INCLUDE SYSLIB(IHARTCT)                                 */ 00181000
*/*    Publications:                                                 */ 00181600
*/*         DCL CVTRTMCT PTR(31)                                     */ 00182200
*/*         %INCLUDE SYSLIB(IHARTCT)                                 */ 00182800
*/*                                                                  */ 00184043
*/*  Storage Attributes:                                             */ 00184100
*/*                                                                  */ 00184200
*/*  Residency: below 16M line                                       */ 00184300
*/*  Subpool:   245                                                  */ 00184400
*/*  Key:       0                                                    */ 00184500
*/*  Size:      436 bytes                                            */ 00184600
*/*                                                                  */ 00184700
*/*  Main Storage:  One per system                                   */ 00184800
*/*                                                                  */ 00185200
*/*  Pointed to by:                                                  */ 00185300
*/*     The CVTRTMCT field of the CVT data area.                     */ 00185400
*/*                                                                  */ 00185500
*/*  Created by:                                                     */ 00185600
*/*     IEAVNPA6 at NIP time.                                        */ 00185700
*/*                                                                  */ 00185800
*/*  Deleted by:                                                     */ 00185900
*/*     The RTCT is not deleted.                                     */ 00186000
*/*                                                                  */ 00186100
*/*  Serialization:                                                  */ 00186700
*/*     Dump options: Compare & Swap - SVC dump fields: RTCTSDPL     */ 00186800
*/*                                                                  */ 00186900
*/*  Notes:                                                          */ 00187000
*/*  1. Most fields in the RTCT have no serialization other than     */ 00187100
*/*     the use of the compare & swap instructions to update the     */ 00187200
*/*     fields such as the dump options.                             */ 00187300
*/*     The SVC dump fields in the RTCT are serialized through       */ 00187400
*/*     the RTCTSDPL field.  When RTCTSDPL is non-zero SVC dump is   */ 00187500
*/*     serialized.                                                  */ 00187600
*/*     (Note - the CVTSDBUF field is also set non-zero to serialize */ 00187700
*/*     SVC dump whenever RTCTSDPL is set.)                          */ 00187800
*/*                                                                  */ 00187900
*/*  2. The RTCT is formatted using the IPCS model IEAVTSDQ. The     */ 00188000
*/*     appropriate changes should be made to IEAVTSDQ whenever the  */ 00188100
*/*     RTCT changes.                                                */ 00188200
*/*                                                                  */ 00188300
*/*  Change Activity:                                                */ 00188400
*/*       APAR OZ27434 ADD RTCTSDFX FLAG             6/9/78  @ZA27434*/ 00188500
*/*       OS/VS2 JBB1226                            8/28/79  @G38AP1U*/ 00188600
*/*       PAGABLE VOLATILE DATA                    11/30/79  @G38EP31*/ 00188700
*/*       APAR OZ51956 ADD RTCTSDTS TO SAVE                  @ZA51956*/ 00188800
*/*           DTESTAE1 PARM POINTER                 4/06/81  @ZA51956*/ 00188900
*/*       OS/VS2 HBB2102                           10/01/80  @G860P12*/ 00189000
*/*       - SUPPORT FOR NEW HBB2102 KEYWORDS                 @G860P12*/ 00189100
*/*       REMOVE UNUSED FLAG RTCTSDRS AND                    @ZMC1668*/ 00189200
*/*           ADD RTCTTDMP FLAG                              @ZMC1668*/ 00189300
*/* FLAG  REASON  RELEASE   DATE   ORIGIN                        @L1A*/ 00189400
*/* $L1=   DAE    JBB2110  821001   PD31: DUMP ANALYSIS &        @L1A*/ 00190200
*/*                                                 ELIMINATION  @L1A*/ 00191400
*/* $L2=   RAS    JBB2110  820701   PD31: PSACSTK VERIFICATION   @L2A*/ 00192000
*/* $L3= RTM2REC  JBB2125  830126   PDD2: RTM2 RECURSION SUPPORT @L3A*/ 00192300
*/* $L4= DCR065   JBB2125  830310   PDD2: TIMER DIE SUPPORT      @L4A*/ 00192400
*/* $P1= PAJ0013  JBB2125  830310   PDD2: RTM ERROR BIT ADDED    @P1A*/ 00192500
*/* $L5= DCR01    JBB2220  840615   PDD2: SVC DUMP CLEANUP       @L5A*/ 00193400
*/* $L6= RASENH   JBB2220  840615   PD2F: EEDS TO EXTENDED VIRT  @L6A*/ 00193800
*/* $L7= DIV      JBB2220  850206   PDA8: SUPPORT FOR DIV        @L7A*/ 00194000
*/* $L8= SYMREC   JBB2220  850601   PDFP: SUPPORT FOR SYMREC     @L8A*/ 00194100
*/* $L9= AR       HBB3310  850916   PDA8: SUPPORT FOR AR         @L9A*/ 00194200
*/* $LA= RTMRAS   HBB3310  860201   PDFP: Permanent task restart     */ 00194600
*/* $LB= RTMRAS   HBB3310  860211   PDA8: Rapid data capture     @LBA*/ 00194800
*/* $LC= DATASPAC HBB3310  861029   PDQ6: LISTD keyword          @LCA*/ 00194900
*/* $P2= PC40541  HBB3310  861227   PDXB: RTCTOSTP added             */ 00195000
*/* $D1= DCR0171  HBB3310  861227   PDQ6: Scope(all) data spaces     */ 00195100
*/* $LD= ILIBS    JBB3311  880309   PDQ6: SMSX local dump exits      */ 00195200
*/* $LE= GTFHM    HBB4410  881003   PDEB: GTF HIGH MIPS              */ 00195400
*/* $01= OY21535  JBB2220  890130   PDCI: MDUMP                      */ 00195600
*/* $LF= COUPLSDU HBB4410  880118   PDQ6: SDATA COUPLE option        */ 00195800
*/* $LG=DATA CAPT HBB4420  890909   PDHS: Rapid Data Capture         */ 00195900
*/* $LH=DATA CAPT HBB4420  890909   PDHR: Rapid Data Capture         */ 00196000
*/* $LI=RDCCMDS   HBB4420  900406   PDHP: Rapid Data Capture         */ 00196100
*/* $LJ= USERV    HBB4410  891204   PDIF: IOS EXIT MASK BITS         */ 00196200
*/* $P3=PH30789   HBB4420  900716   PDQ6: ASID table must be on word */ 00196300
*/*                                        boundary for CS           */ 00196400
*/* $LK= DYNIO    HBB4420  900815   PDQ6: Remove RTCTCMAX            */ 00196500
*/* $02= OY33407  JBB3311  900830   PDXB: Dump sequence number       */ 00196800
*/* OY39397 - RTCTMTCT to keep a count of Memterm subtasks   @YA39397*/ 00196900
*/* $03= OY42474  HBB4420  910324   PDHT: Don't set SDRDTFAL if SDT  */ 00197000
*/*                                        capture complete      @03A*/ 00197200
*/* $LL= POSIX    HBB4430  920206   PDKV: OpenMVS task processing    */ 00197400
*/* $P4= PKB1434  HBB4430  920320   PDKV: Adapt to OpenMVS BPX1OPEN  */ 00197600
*/*                                       interface change           */ 00197800
*/* $P5= PKB3547  HBB4430  920624   PDKV: Change fullword alignment  */ 00198000
*/*               to character alignment for RTCTBUFV(-ASM)          */ 00198200
*/* $P6= PKB4047  HBB4430  920805   PDKV: Move RTCTBPXC bit          */ 00198400
*/* $LM= SYSLK    HBB5510  920121   PDHT: XES LOCAL AND GLOBAL DUMP  */ 00198600
*/*                                         EXITS                @LMA*/ 00198700
*/* $LN= WLMI     HBB5510  930415   PDHT: WLM dump exit          @LNA*/ 00198800
*/* $LO= SUBSP    HBB5510  930415   PDHT: RSM dump exit          @LOA*/ 00198900
*/* $P7= PIG2275  HBB5510  930812   PDHT: SHOWHDR prolog updates @P7A*/ 00199000
*/* $LP= SERV2S07 HBB5520  940310   PDHT: SLIP dump exit         @LPA*/ 00199100
*/* $LQ= SERV2K08 HBB5520  940414   PDHT: Correct RTCTXBT type   @LQA*/ 00199200
*/* $04= OW06442  HBB4420  940722   PDKV: Add MAXSPACE exceeded bit  */ 00199300
*/* $05= OW07135  HBB4420  940803   PDKV: Change comment from !      */ 00199400
*/* $06= OW09846  HBB5510  950217   PDKV: Add DUMPSRV cancelled  @06A*/ 00199500
*/* $D2= DR20001  HBB6601  950907 PD00KV: Split from SC1CM       @D2A*/ 00206700
*/* $07= OW14392  HBB5510  950731   PDKD: Parallel Detach part III   */ 00210300
*/*    = OW22254  HBB4430  960906   PDKV: Roll OW09846 to 430        */ 00212100
*/* $LR= TSVCD    JBB6607  980413   PDHT: Tailored SVC Dump      @LRA*/ 00213000
*/* $08= OW47171  HBB6608  001121   PDKV: New unserialize bit    @08A*/ 00213400
*/*                                                                  */ 00213900
*/****************** END OF SPECIFICATIONS ***************************/ 00221100
*                                                                       00228300
*%GOTO RTCTPLS;     /*                                                  00235500
RTCT     DSECT , -                BAL MAPPING OF TABLE                  00242700
         IEZBITS , -              SYMBOLIC BIT NAMES                    00250002
RTCTNAME DS    CL4 -              CONTAINS C'RTCT' AS IDENTIFIER.       00300002
*********************************************************************** 00302043
* SNAP/ABEND PARMLIB VALUES                                           * 00304043
*********************************************************************** 00306043
RTCTPLIB DS    0CL12                                           @G33CPHE 00310043
*                                                                       00315043
RTCTSAP  DS    0BL4 -             **SYSABEND INITIAL PARMLIB VALUES**   00320043
RTCTSAP1 DS    B -                (BYTE 1 OF SDATA OPTIONS:)            00330043
RTCTSAB0 EQU   BIT0               1=DISPLAY NUCLEUS                     00410002
RTCTSAB1 EQU   BIT1               1=DISPLAY SQA                         00420002
RTCTSAB2 EQU   BIT2               1=DISPLAY LSQA                        00430002
RTCTSAB3 EQU   BIT3               1=DISPLAY SWA                         00440002
RTCTSAB4 EQU   BIT4               1=DISPLAY GTF OR SUPERVISOR TRACE     00442002
RTCTSAB5 EQU   BIT5               1=DISPLAY CONTROL BLOCKS FOR TASK     00443043
RTCTSAB6 EQU   BIT6               1=DISPLAY ENQUEUE CONTROL BLOCKS      00444043
RTCTSAB7 EQU   BIT7               1=FORMAT DATA MGMT C.B.S     @G33CPHE 00447043
*                                                                       00447243
RTCTSAP2 DS    B                  (BYTE 2 OF SDATA OPTIONS:)            00447343
RTCTSABG EQU   BIT0               1=FORMAT IOS CONTROL BLOCKS  @G33CPHE 00447443
RTCTSABH EQU   BIT1               1=FORMAT ERROR CONTROL BLKS  @G33CPHE 00447543
RTCTSABI EQU   BIT2               1=FORMAT PCDATA INFORMATION  @G382P12 00448000
RTCTABSU EQU   BIT3               1=SUMMARY DUMP REQUEST       @G860P12 00448200
RTCTABAN EQU   BIT4               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 00448400
RTCTABNS EQU   BIT5               1=NO SYMPTOM DUMP REQUESTED  @G860P12 00448600
*        EQU   BIT6               RESERVED                              00448843
*        EQU   BIT7               RESERVED                              00449043
*                                                                       00449143
RTCTSAP3 DS    B -                (BYTE 1 OF PDATA OPTIONS:)            00449243
RTCTSAB8 EQU   BIT0               1=DISPLAY SAVE AREA TRACE(SA KEYWORD) 00452243
RTCTSAB9 EQU   BIT1               0=DISPLAY ENTIRE SAVE AREA            00470002
*                                 1=DISPLAY SAVE AREA HEADINGS(SAH KWD) 00475043
RTCTSABA EQU   BIT2               1=DISPLAY REGISTERS                   00490002
RTCTSABB EQU   BIT3               1=DISPLAY LINK PACK AREA              00492002
RTCTSABC EQU   BIT4               1=DISPLAY JOB PACK AREA               00494002
RTCTSABD EQU   BIT5               1=DISPLAY PSW                         00496002
RTCTSABE EQU   BIT6               1=DISPLAY USER SUBPOOLS: 0-127        00498002
RTCTABST EQU   BIT7               1=DUMP ALL SUBTASKS          @G860P12 00498400
RTCTSAP4 DS    B                  RESERVED                              00540043
*                                                                       00542043
RTCTSUP  DS    0BL4 -             **SYSUDUMP INITIAL PARMLIB VALUES**   00544043
RTCTSUP1 DS    B -                (BYTE 1 OF SDATA OPTIONS:)            00554043
RTCTSUD0 EQU   BIT0               1=DISPLAY NUCLEUS                     00602002
RTCTSUD1 EQU   BIT1               1=DISPLAY SQA                         00610002
RTCTSUD2 EQU   BIT2               1=DISPLAY LSQA                        00620002
RTCTSUD3 EQU   BIT3               1=DISPLAY SWA                         00630002
RTCTSUD4 EQU   BIT4               1=DISPLAY GTF OR SUPERVISOR TRACE     00640002
RTCTSUD5 EQU   BIT5               1=DISPLAY CNTRL BLKS FOR TASK         00642002
RTCTSUD6 EQU   BIT6               1=DISPLAY ENQUEUE CNTRL BLKS          00644002
RTCTSUD7 EQU   BIT7               1=FORMAT DATA MGMT C.B.S     @G33CPHE 00645043
*                                                                       00645343
RTCTSUP2 DS    B                  (BYTE 2 OF SDATA OPTIONS:)            00645443
RTCTSUDG EQU   BIT0               1=FORMAT IOS CONTROL BLOCKS  @G33CPHE 00645743
RTCTSUDH EQU   BIT1               1=FORMAT ERROR CONTROL BLKS  @G33CPHE 00646043
RTCTSUDI EQU   BIT2               1=FORMAT PCDATA INFORMATION  @G382P12 00646600
RTCTSUSU EQU   BIT3               1=SUMMARY DUMP REQUESTED     @G860P12 00647000
RTCTSUAN EQU   BIT4               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 00647400
RTCTSUNS EQU   BIT5               1=NO SYMPTOM DUMP REQUESTED  @G860P12 00647800
*        EQU   BIT6               RESERVED                              00648243
*        EQU   BIT7               RESERVED                              00648643
*                                                                       00648843
RTCTSUP3 DS    B -                (BYTE 1 OF PDATA OPTIONS:)            00649043
RTCTSUD8 EQU   BIT0               1=DISPLAY SAVE AREA TRACE(SA KEYWORD) 00652043
RTCTSUD9 EQU   BIT1               0=DISPLAY ENTIRE SAVE AREA            00670002
*                                 1=DISPLAY SAVE AREA HEADINGS(SAH KWD) 00675043
RTCTSUDA EQU   BIT2               1=DISPLAY REGISTERS                   00690002
RTCTSUDB EQU   BIT3               1=DISPLAY LINK PACK AREA              00692002
RTCTSUDC EQU   BIT4               1=DISPLAY JOB PACK AREA               00694002
RTCTSUDD EQU   BIT5               1=DISPLAY PSW                         00696002
RTCTSUDE EQU   BIT6               1=DISPLAY USER SUBPOOLS: 0-127        00698002
RTCTSUST EQU   BIT7               1=DISPLAY SUBTASK DATA       @G860P12 00698400
RTCTSUP4 DS    B                  RESERVED                              00718443
*                                                                       00719443
RTCTSYD  DS    0BL4               **SYSMDUMP INITIAL PARMLIB VALUES**   00720443
RTCTSY01 DS    B                  (BYTE 1 OF SDATA OPTIONS:)   @G33CPHE 00722443
RTCTSYM0 EQU   BIT0               1=DISPLAY NUCLEUS            @G33CPHE 00724443
RTCTSYM1 EQU   BIT1               1=DISPLAY SQA                @G33CPHE 00726443
RTCTSYM2 EQU   BIT2               1=DISPLAY LSQA               @G33CPHE 00728443
RTCTSYM3 EQU   BIT3               1=DISPLAY SWA                @G33CPHE 00730443
RTCTSYM4 EQU   BIT4               1=DISPLAY GTF OR SUPV TRACE  @G33CPHE 00732443
RTCTSYM5 EQU   BIT5               1=DISPLAY REGION             @G33CPHE 00734443
RTCTSYM6 EQU   BIT6               1=DISPLAY LPA FOR REGION     @G33CPHE 00736443
RTCTSYM7 EQU   BIT7               1=DISPLAY CSA                @G33CPHE 00738443
RTCTSY02 DS    B                  (BYTE 2 OF SDATA OPTIONS)    @G860P12 00739400
RTCTSYMS EQU   BIT0               1=SUMMARY DUMP REQUEST       @G860P12 00740400
RTCTSYMA EQU   BIT1               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 00741400
RTCTSYMN EQU   BIT2               1=NO SYMPTOM DUMP            @G860P12 00742400
*        EQU   BIT3               RESERVED                     @G860P12 00743400
*        EQU   BIT4               RESERVED                     @G860P12 00744400
*        EQU   BIT5               RESERVED                     @G860P12 00745400
*        EQU   BIT6               RESERVED                     @G860P12 00746400
*        EQU   BIT7               RESERVED                     @G860P12 00747400
RTCTSY03 DS    B                  RESERVED                              00749043
RTCTSY04 DS    B                  RESERVED                              00750043
*********************************************************************** 00751043
* RTM INFORMATION                                                     * 00752000
*********************************************************************** 00753043
RTCTYYY1 DS    H                  **RESERVED**                 @G33CPHZ 00756443
RTCTSDLA DS    H               ASID of last address space to be         01348400
*                              processed                           @LGC 01350000
RTCTMECB DS    XL4 -              ECB WAIT'ED ON BY MEMORY              01400002
*                                  TERMINATION CONTROLLER               01450002
RTCTFASB DS    A -                ADDRESS OF FIRST ASCB ON MEMORY       01500002
*                                  TERMINATION QUEUE.                   01550002
RTCTNAS  DS    F               NUM OF ADDR SPACE TO BE CAPTURED    @LGC 01600000
RTCTEEDA DS    A               GLOBAL ANCHOR FOR EED's             @L9A 01650000
RTCTSDDS DS    F               ANCHOR OF THE SDDSQ QUEUE                01891000
*                              0 - IF THE SDDSQ IS EMPTY     @G860P31   01912000
RTCTCOUN DS    0F              Used for Compare and Swap     @YA39397   01922500
RTCTSDDC DS    H               COUNT OF THE NUMBER OF ENTRIES           01933000
*                              IN THE SDDSQ.                            01954000
RTCTMTCT DS    H               Used to keep a count of the subtasks     01964500
*                              belonging to Memory Termination          01975000
*                                                           @YA39397    01985500
RTCTDSV  DS    F               POINTER TO THE DUMPSRV ADDRESS           01996000
*                                 SPACE CONTROL BLOCK.      @G860P31    02017000
RTCTSSTK DS    F               POINTER TO STACK ADDRESS TABLE   @L2A    02067000
RTCTADGL DS    F               SNAP GLUE ROUTINE ADDRESS                02122000
*                              FOR QMNGRIO                  @G860P12    02143000
RTCTADG1 DS    F               SNAP GLUE ROUTINE ADDRESS                02164000
*                              FOR IEAVAD11                 @G860P12    02185000
RTCTADG2 DS    F               SNAP GLUE ROUTINE ADDRESS                02206000
*                              FOR IEAVAD21                 @G860P12    02227000
RTCTADG3 DS    F               SNAP GLUE ROUTINE ADDRESS                02248000
*                              FOR IEAVAD81                 @G860P12    02269000
RTCTADG4 DS    F               SNAP GLUE ROUTINE ADDRESS                02290000
*                              FOR IEAVAD08                 @G860P12    02311000
RTCTADG5 DS    F               SNAP GLUE ROUTINE ADDRESS                02332000
*                              FOR IEAVAD12                 @G860P12    02353000
RTCTTABG DS    F               ABDUMP GLUE FOR EODAD ROUTINE            02374000
*                                                           @G860P12    02395000
RTCTTABQ DS    F               ABDUMP GLUE FOR QMNGRIO      @G860P12    02416000
RTCTTABR DS    F               ABDUMP GLUE FOR READ/CHECK   @G860P12    02437000
RTCTDSCA DS    F               POINTER TO DAE COMMUNICATION AREA  @L1A  02451000
RTCTDIND DS    F               POINTER TO SDDIE CONTROL BLOCK FOR       02453500
*                              SYSTEM NON-DISPATCHABILITY         @L4A  02456000
RTCTDIRS DS    F               POINTER TO SDDIE CONTROL BLOCK FOR       02458500
*                              THE REAL STORAGE BUFFER            @L4A  02461000
RTCTSDAT DS    F               POINTER TO SVC DUMP DATA AREAS           02466700
*                              CONTROL BLOCK - SDDAT              @L5A  02472400
RTCTSMOD DS    F               POINTER TO CONTROL BLOCK CONTAINING      02478100
*                              SVC DUMP MODULE ADDRESSES - SDMOD  @L5A  02483800
RTCTSCON DS    F               POINTER TO CONTROL BLOCK CONTAINING      02489500
*                              CONSTANTS USED IN SVC DUMP               02495200
*                              PROCESSING - SDCON                 @L5A  02500900
RTCTCPID DS    CL4             CELL POOL ID FOR THE EEDS          @L6A  02504900
RTCTRPAR DS    A                  ADDRESS OF RSM PAGE ANALYSIS ROUTINE  02506900
*                                 (IARQD)                         @L7C  02508900
RTCTBPXP DS    A                  OpenMVS Dump Adjunct Address    @LLA  02510300
RTCTRSVS DS    CL32               RESERVED                        @P4C  02511700
RTCTSDPL DS    A                  ADDRESS OF SVC DUMP PARAMETER LIST    02513100
RTCTFMT  DS    A                  USED FOR TESTING RTM MODULES          02650043
RTCTMLCK DS    F                  LOCK FOR MEM TERM POST SRB            02908102
RTCTMSRB DS    F                  PTR TO MEM TERM POST SRB              02908202
RTCTTEST DS    F                  USED FOR TESTING RTM MODULES          02908302
RTCTSEQW DS    0CL4               FULLWORD FIELD CONTAINING THE SEQ #   02912200
*                                 IN SECOND HALFWORD               @L8C 02916100
         DS    BL2                RESERVED                         @L8C 02920000
RTCTSEQ# DS    H                  ERRORID SEQUENCE NUMBER      @G17EP5W 02924141
RTCTSDSW DS    A                  ADDRESS OF SUMMARY SVC DUMP (SUMDUMP) 02926643
*                                  WORK AREA (IHASMWK)         @G33VPHD 02927443
RTCTTDCB DS    CL36               TAPE DCB FOR SVCDUMP             @LHC 02929100
RTCTSDWK DS    A                  ADDRESS OF SVC DUMP WORK AREA         02929202
RTCTERID DS    0CL10              ERRORID FOR THIS FAILURE'S SVC DUMP   02930243
*                                  HEADER                     @G17EP5W  02931243
RTCTESEQ DS    CL2                ERRORID SEQUENCE NUMBER     @G17EP5W  02933241
RTCTECPU DS    CL2                ERRORID LOGICAL CPU ID      @G17EP5W  02937741
RTCTEASD DS    CL2                ERRORID ASID                @G17EP5W  02938041
RTCTETIM DS    CL4                ERRORID TIMESTAMP           @G17EP5W  02938341
RTCTXXX2 DS    CL2                RESERVED                    @G17EP5W  02938641
*********************************************************************** 02938843
* DEFAULT DUMP OPTIONS, WHICH CAN BE CHANGED BY THE CHNGDUMP          * 02939243
* OPERATOR COMMAND                                                    * 02939343
*********************************************************************** 02939843
RTCTOPT  DS    0CL16                                           @G33CPHE 02939943
RTCTSAO  DS    0BL4               **SYSABEND EFFECTIVE OPTIONS**        02940243
RTCTSASD DS    0BL2                                                     02940343
RTCTSAO1 DS    B                  (BYTE 1 OF SDATA OPTIONS:)            02941243
RTCTSAD0 EQU   BIT0               1=DISPLAY NUCLEUS                     02941543
RTCTSAD1 EQU   BIT1               1=DISPLAY SQA                         02942543
RTCTSAD2 EQU   BIT2               1=DISPLAY LSQA                        02943543
RTCTSAD3 EQU   BIT3               1=DISPLAY SWA                         02944543
RTCTSAD4 EQU   BIT4               1=DISPLAY GTF OR SUPERVISOR TRACE     02945543
RTCTSAD5 EQU   BIT5               1=DISPLAY CONTROL BLOCKS FOR TASK     02946543
RTCTSAD6 EQU   BIT6               1=DISPLAY ENQUEUE CONTROL BLOCKS      02947443
RTCTSAD7 EQU   BIT7               1=FORMAT DATA MGMT C.B.S     @G33CPHE 02949443
*                                                                       02949643
RTCTSAO2 DS    B                  (BYTE 2 OF SDATA OPTIONS:)            02949843
RTCTSADG EQU   BIT0               1=FORMAT IOS CONTROL BLOCKS  @G33CPHE 02950243
RTCTSADH EQU   BIT1               1=FORMAT ERROR CONTROL BLKS  @G33CPHE 02950643
RTCTSADI EQU   BIT2               1=FORMAT PC INFORMATION      @G382P12 02950800
RTCTSADJ EQU   BIT3               1=SUMMARY DUMP               @G860P12 02951000
RTCTSADK EQU   BIT4               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 02951400
RTCTSADL EQU   BIT5               1=NO SYMPTOM DUMP            @G860P12 02951800
*              BIT6               RESERVED                              02952243
*              BIT7               RESERVED                              02952643
RTCTSAPD DS    0BL2                                                     02953043
RTCTSAO3 DS    B                  (BYTE 1 OF PDATA OPTIONS:)            02953243
RTCTSAD8 EQU   BIT0               1=DISPLAY SAVE AREA TRACE(SA KEYWORD) 02953843
RTCTSAD9 EQU   BIT1               0=DISPLAY ENTIRE SAVE AREA            02954243
*                                 1=DISPLAY SAVE AREA HEADINGS(SAH KWD) 02954643
RTCTSADA EQU   BIT2               1=DISPLAY REGISTERS                   02955043
RTCTSADB EQU   BIT3               1=DISPLAY LINK PACK AREA              02955443
RTCTSADC EQU   BIT4               1=DISPLAY JOB PACK AREA               02955843
RTCTSADD EQU   BIT5               1=DISPLAY PSW                         02956243
RTCTSADE EQU   BIT6               1=DISPLAY USER SUBPOOLS: 0-127        02956643
RTCTSADF EQU   BIT7               1=DISPLAY SUBTASKS           @G860P12 02957000
*                                                                       02957243
RTCTSAO4 DS    B                  (BYTE 1 OF OTHER OPTIONS:)            02957443
RTCTSAMG EQU   BIT6               SEE RTCTSAOV                 @G33CPHZ 02957843
RTCTSAOV EQU   BIT6               1=OVER MODE  0=ADD MODE      @G33CPHZ 02958143
RTCTISAB EQU   BIT7               IGNORE REQUESTS FOR SYSABEND @G33CPHE 02958243
*                                                                       02958643
RTCTSUO  DS    0BL4               **SYSUDUMP EFFECTIVE OPTIONS**        02959043
RTCTSUSD DS    0BL2                                                     02959443
RTCTSUO1 DS    B                  (BYTE 1 OF SDATA OPTIONS:)            02959643
RTCTSYD0 EQU   BIT0               1=DISPLAY NUCLEUS                     02960243
RTCTSYD1 EQU   BIT1               1=DISPLAY SQA                         02960643
RTCTSYD2 EQU   BIT2               1=DISPLAY LSQA                        02961043
RTCTSYD3 EQU   BIT3               1=DISPLAY SWA                         02961443
RTCTSYD4 EQU   BIT4               1=DISPLAY GTF OR SUPERVISOR TRACE     02961843
RTCTSYD5 EQU   BIT5               1=DISPLAY CNTRL BLKS FOR TASK         02962243
RTCTSYD6 EQU   BIT6               1=DISPLAY ENQUEUE CNTRL BLKS          02962643
RTCTSYD7 EQU   BIT7               1=FORMAT DATA MGMT C.B.S     @G33CPHE 02963043
*                                                                       02963343
RTCTSUO2 DS    B                  (BYTE 2 OF SDATA OPTIONS:)            02963443
RTCTSYDG EQU   BIT0               1=FORMAT IOS CONTROL BLOCKS  @G33CPHE 02963743
RTCTSYDH EQU   BIT1               1=FORMAT ERROR CONTROL BLKS  @G33CPHE 02964043
RTCTSYDI EQU   BIT2               1=FORMAT PC INFORMATION      @G382P12 02964600
RTCTSYDJ EQU   BIT3               1=SUMMARY DUMP               @G860P12 02964900
RTCTSYDK EQU   BIT4               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 02965000
RTCTSYDL EQU   BIT5               1=NO SYMPTOM DUMP            @G860P12 02965400
*        EQU   BIT6               RESERVED                              02965843
*        EQU   BIT7               RESERVED                              02966243
RTCTSUPD DS    0BL2                                                     02966643
RTCTSUO3 DS    B                  (BYTE 1 OF PDATA OPTIONS:)            02966843
RTCTSYD8 EQU   BIT0               1=DISPLAY SAVE AREA TRACE(SA KEYWORD) 02967443
RTCTSYD9 EQU   BIT1               0=DISPLAY ENTIRE SAVE AREA            02967843
*                                 1=DISPLAY SAVE AREA HEADINGS(SAH KWD) 02968243
RTCTSYDA EQU   BIT2               1=DISPLAY REGISTERS                   02968643
RTCTSYDB EQU   BIT3               1=DISPLAY LINK PACK AREA              02969043
RTCTSYDC EQU   BIT4               1=DISPLAY JOB PACK AREA               02969443
RTCTSYDD EQU   BIT5               1=DISPLAY PSW                         02969843
RTCTSYDE EQU   BIT6               1=DISPLAY USER SUBPOOLS: 0-127        02970243
RTCTSYDF EQU   BIT7               1=DISPLAY SUBTASKS           @G860P12 02970600
*                                                                       02970843
RTCTSUO4 DS    B                  (BYTE 1 OF OTHER OPTIONS:)            02971043
RTCTSUMG EQU   BIT6               SEE RTCTSUOV                 @G33CPHZ 02971443
RTCTSUOV EQU   BIT6               1=OVER MODE  0=ADD MODE      @G33CPHZ 02971743
RTCTISYU EQU   BIT7               IGNORE REQUESTS FOR SYSUDUMP @G33CPHE 02971843
*                                                                       02972043
RTCTSYO  DS    0BL4               **SYSMDUMP EFFECTIVE OPTIONS**        02972243
RTCTSD01 DS    B                  (BYTE 1 OF SDATA OPTIONS:)   @G33CPHE 02972643
RTCTSDS0 EQU   BIT0               1=DISPLAY NUCLEUS            @G33CPHE 02973043
RTCTSDS1 EQU   BIT1               1=DISPLAY SQA                @G33CPHE 02973443
RTCTSDS2 EQU   BIT2               1=DISPLAY LSQA               @G33CPHE 02973843
RTCTSDS3 EQU   BIT3               1=DISPLAY SWA                @G33CPHE 02974243
RTCTSDS4 EQU   BIT4               1=DISPLAY GTF OR SPV.TRACE   @G33CPHE 02974643
RTCTSDS5 EQU   BIT5               1=DISPLAY REGION             @G33CPHE 02975043
RTCTSDS6 EQU   BIT6               1=DISPLAY ACTIVE LPA FOR RGN @G33CPHE 02975243
RTCTSDS7 EQU   BIT7               1=DISPLAY CSA                @G33CPHE 02975843
RTCTSD02 DS    B                  DUMP FLAGS TWO               @G860P12 02975900
RTCTSDS8 EQU   BIT0               1=SUMMARY DUMP               @G860P12 02976000
RTCTSDS9 EQU   BIT1               1=DUMP ALL VIRTUAL NUCLEUS   @G860P12 02976100
RTCTSDSA EQU   BIT2               1=NO SYMPTOM DUMP            @G860P12 02976200
*        EQU   BIT3               RESERVED                     @G860P12 02976300
*        EQU   BIT4               RESERVED                     @G860P12 02976400
*        EQU   BIT5               RESERVED                     @G860P12 02976500
*        EQU   BIT6               RESERVED                     @G860P12 02976600
*        EQU   BIT7               RESERVED                     @G860P12 02976700
RTCTSD03 DS    B                  RESERVED                     @G860P12 02976800
*                                                                       02976900
RTCTSD04 DS    B                  (BYTE 1 OF OTHER OPTIONS:)            02977043
RTCTSMMG EQU   BIT6               SEE RTCTSMOV                 @G33CPHZ 02977443
RTCTSMOV EQU   BIT6               1=OVER MODE  0=ADD MODE      @G33CPHZ 02977743
RTCTISYM EQU   BIT7               IGNORE REQUESTS FOR SYSMDUMP @G33CPHE 02977843
*                                                                       02978243
RTCTSDO  DS    0BL4               **SVC DUMP EFFECTIVE OPTIONS**   @L5C 02978300
*                                 **(CHANGEDUMP DEFAULTS)**             02978400
RTCTSDOD DS    0BL2                                            @G33CPHZ 02978743
RTCTSDO1 DS    B                  (BYTE 1 OF SDATA OPTIONS:)            02978843
RTCTSDP0 EQU   BIT0               1=DISPLAY ALL PSA'S IN SYSTEM         02979443
RTCTSDP1 EQU   BIT1               1=DISPLAY CURRENT PSA                 02979843
RTCTSDP2 EQU   BIT2               1=DISPLAY NUCLEUS                     02980243
RTCTSDP3 EQU   BIT3               1=DISPLAY SQA                         02980643
RTCTSDP4 EQU   BIT4               1=DISPLAY LSQA                        02981043
RTCTSDP5 EQU   BIT5               1=DISPLAY REGION (PRIVATE AREA)       02981443
RTCTSDP6 EQU   BIT6               1=DISPLAY ACTIVE LPA MODULES FOR RGN  02981643
RTCTSDP7 EQU   BIT7               1=DISPLAY GTF OR SUPERVISOR TRACE     02982243
RTCTSDO2 DS    B -                                                      02982643
RTCTSDP8 EQU   BIT0               1=DISPLAY CSA                         02983043
RTCTSDP9 EQU   BIT1               1=DISPLAY SWA                         02983443
RTCTSDPA EQU   BIT2               1=DISPLAY SUMMARY SVC DUMP            02983843
*                                  (SUMDUMP)                   @G33CPHE 02984043
RTCTSDPB EQU   BIT3               1=NO SUMMARY DUMP DISPLAY    @G33CPHE 02984643
RTCTSDPC EQU   BIT4               1=NO ALL PSA DISPLAY         @G33CPHE 02985043
RTCTSDPD EQU   BIT5               1=NO SQA DISPLAY             @G33CPHE 02985443
RTCTSDPE EQU   BIT6               1=DUMP ALL NUCLEUS                    02985800
RTCTDEF  EQU   BIT7               1=DEFAULTS                       @01A 02986200
*                                                                       02986443
RTCTSDO3 DS    B                  (BYTE 1 OF OTHER OPTIONS:)            02986643
RTCTSDPG EQU   BIT0               1 MEANS QUIESCE=YES SPECIFIED ON      02987043
*                                  CHNGDUMP COMMAND                     02987443
RTCTSDPH EQU   BIT1               1 MEANS QUIESCE=NO SPECIFIED ON       02987843
*                                  CHNGDUMP COMMAND                     02988243
*        EQU   BIT2               RESERVED                              02988400
*        EQU   BIT3               RESERVED                              02988600
*        EQU   BIT4               RESERVED                              02989043
*        EQU   BIT5               RESERVED                              02989443
*        EQU   BIT6               RESERVED                              02989843
*        EQU   BIT7               RESERVED                              02999643
RTCTSDO4 DS    B                  (BYTE 2 OF OTHER OPTIONS:)            03000643
RTCTSDMG EQU   BIT6               SEE RTCTSDOV                 @G33CPHZ 03001643
RTCTSDOV EQU   BIT6               1=OVER MODE  0=ADD MODE      @G33CPHZ 03001943
RTCTISVC EQU   BIT7               IGNORE REQUESTS FOR SVCDUMP  @G33CPHE 03002643
*                                                                       03003643
*********************************************************************** 03003743
* ADDITIONAL SVC DUMP INFORMATION AND FLAGS                           * 03003843
*********************************************************************** 03004243
         DS    BL2                **OLD RTCTASO FIELD - RESERVED   @L5A 03005700
RTCTSDI  DS    0BL2               **SVC DUMP INFORMATION**              03007343
RTCTSDNA DS    B                  NUMBER ADDR SPACES TO DUMP   @G33VPHD 03007443
RTCTINDX DS    B                  INDEX FOR ASID LIST ENTRY    @G33VPHD 03007543
RTCTSDPR DS    XL1                PERMANENT RETURN CODE        @G33VPHD 03007643
RTCTBUFV DS    CL4                CD SET,SDUMP,BUFFERS=nnnn value  @P5C 03008300
RTCTZZZ2 DS    BL3                RESERVED                     @G33VPHZ 03009100
*                                                                       03009200
RTCTSDF  DS    0BL2               **SVC DUMP FLAGS**                    03009300
RTCTSDF1 DS    B                  (BYTE 1 OF FLAGS:)                    03009400
RTCTSDNS EQU   BIT0               INDICATES ADDRESS SPACE HAS BEEN SET  03009600
*                                 NON-SWAPPABLE                   @L4A  03009800
RTCTSDND EQU   BIT1               SVC DUMP SET SYSTEM NON-DISP          03010143
RTCTSDSH EQU   BIT2               SCHEDULE DUMP (IEAVTSDX) REQUEST      03010643
*                                                              @G33VPHZ 03011943
RTCTSDMA EQU   BIT3               MULTIPLE ADDR SPACE DUMP IN PROGRESS  03012643
*                                                              @G33VPHD 03013143
*        EQU   BIT4               RESERVED                         @LGA 03013600
RTCTSDSD EQU   BIT5               SUMMARY DUMP (IEAVTSSD) RECEIVED      03014643
*                                  CONTROL                     @G33VPHZ 03014943
*        EQU   BIT6               UNUSED                           @LHC 03015700
RTCTSDSC EQU   BIT7               SUMMARY DUMP (IEAVTSSD) COMPLETED     03016643
*                                  PROCESSING                  @G33VPHZ 03016843
*                                                                       03017043
RTCTSDF2 DS    B                  (BYTE 2 OF FLAGS:)           @G33VPHZ 03017643
RTCTSDMR EQU   BIT0               DUMP MASTER ADDR SPACE REQD  @G33VPHD 03018243
RTCTSYSF EQU   BIT1               Indicates SYSEVENT AVQDELTA has been  03019000
*                                 issued by SRB IEAVTSD2.          @LBC 03019800
RTCTDSFX EQU   BIT2               Used by IEAVTSDS to save TCBFX   @LBA 03020600
*        EQU   BIT3               reserved                         @LGA 03021600
RTCTSDWF EQU   BIT4               SUMDUMP WRITER (IEAVTSDW) HAS         03022643
*                                  COMPLETED                   @G33VPHD 03022943
*        EQU   BIT5               reserved                         @LGA 03023600
RTCTSDRW EQU   BIT6               SUMDUMP RECORDS (FROM                 03024643
*                                  IEAVTSSD) TO WRITE          @G33VPHD 03024943
RTCTSDFX EQU   BIT7               SVC DUMP SET TCBFX BIT. THIS          03025200
*                                    PREVENTS ASYNCHRONOUS INTERRUPT    03025500
*                                    EXITS FROM RECEIVING CONTROL       03025800
*                                    UNDER THE CURRENT TASK. THESE      03026100
*                                    EXITS RESULT FROM I/O ERRORS TO    03026400
*                                    NON-DASD DEVICES OR FROM USER      03026700
*                                    REQUESTED TIMER EXITS         @L4C 03027000
* ****** NOTE ******                                           @ZMB0161 03027400
* THE FOLLOWING BITS SHOULD NOT BE REINITIALIZED BETWEEN SDUMPS@ZMB0161 03027500
* ****** NOTE ******                                           @ZMB0161 03027600
RTCTZZZ3 DS    BL2                ADD. SVC DUMP FLAGS              @P6C 03027700
*        EQU   BIT0               RESERVED                         @L4A 03027800
RTCTSDNO EQU   BIT1              NO SYS1.DUMP DATASETS DEFINED @ZMB0161 03027900
RTCTBPXC EQU   BIT2               OpenMVS install checked          @P6C 03028100
RTCTNNEW EQU   BIT3               Do not allow new SVC dumps       @04A 03028200
RTCTZDPL EQU   BIT4               Zero RTCTSDPL to unserialize     @08A 03028350
*        EQU   BL11               RESERVED                         @08C 03028400
RTCTASTB DS    0CL64              SVC DUMP ASID TABLE              @L5A 03028500
RTCTSDF3 DS    0CL64              **ARRAY OF INFO FOR SVC DUMP OF       03028700
*                                   MULTIPLE ADDRESS SPACES**  @G33VPHD 03029043
RTCTSDAS DS    BL2                ASID OF THIS ADDRESS SPACE (A.S.)     03029600
*                                                              @G33VPHZ 03030243
RTCTSDF4 DS    B                  (BYTE 1 OF FLAGS:)           @G33VPHZ 03031643
RTCTSDSS EQU   BIT0               DUMP SRB SCHEDULED           @G33VPHZ 03032400
RTCTSDNC EQU   BIT1               DUMP SRB RECEIVED CONTROL    @G33VPHZ 03033200
RTCTSDAN EQU   BIT2               ADDRESS SPACE SET NON-DISPATCHABLE    03034043
*                                                              @G33VPHZ 03034843
RTCTSDRM EQU   BIT3               DUMP TASK HAS BEEN RESUMED   @G33VPHZ 03035643
RTCTSDTR EQU   BIT4               DUMP TASK RUNNING            @G33VPHZ 03036243
RTCTSDEQ EQU   BIT5               DUMP TASK ENQUEUED ON DUMP RESOURCE   03036843
*                                                              @G33VPHZ 03037443
RTCTSDEN EQU   BIT6               SVC DUMP (IEAVAD00 OR IEAVTSDT) IS    03038643
*                                  PROCESSING THIS A.S.        @G33VPHZ 03038943
RTCTSDDO EQU   BIT7               DUMP ATTEMPTED FOR THIS ASID @G33VPHZ 03039643
RTCTSDF5 DS    B                  0 = NO LISTA SPECIFIED FOR THIS ASID  03040600
RTCTLSTA EQU   BIT0               LISTA STORAGE RANGES REQUESTED FOR    03040800
*                                 THIS ADDRESS SPACE           @G382P12 03040900
RTCTOLST EQU   BIT1               LISTA ONLY SPECIFIED OPTION FOR THIS  03041000
*                                 ADDRESS SPACE                @G382P12 03041100
RTCTTERM EQU   BIT2               IEAVTSRB should terminate        @LBA 03041300
RTCTOCDS EQU   BIT3               THIS ASID IS ONLY THE OWNING ASID     03041400
*                                 OF A SCOPE(ALL) DATA SPACE       @D1C 03041500
RTCTOSTP EQU   BIT4               This ASID is only stopped and should  03041600
*                                 not be dumped                    @P2A 03041700
RTCTCS   EQU   BIT5               IEAVTSDT is in CS logic to            03041800
*                                 decrement field RTCTNAS          @LHA 03041900
RTCTDONE EQU   BIT6               IEAVTSDT capture complete        @03A 03042000
RTCTSDEL EQU   *-RTCTSDF3         LENGTH OF ELEMENT OF ADDR SPACE ARRAY 03042100
*                                                              @G33VPHZ 03042200
         DS    CL60               REMAINING 15 ASID ENTRIES    @G33VPHZ 03042643
*                                                                       03043643
*********************************************************************** 03043743
* RTM INFORMATION                                                     * 03043843
*********************************************************************** 03043943
RTCTMRMQ DS    A                  ADDRESS OF QUEUE OF STORAGE AREAS     03044043
*                                 (USED FOR SYSMDUMPS) TO BE FREED      03044343
*                                 AT MEMTERM                   @G33SPHZ 03044443
RTCTSTE  DS    A                  ADDRESS OF QUEUE OF SLIP TSO          03044564
*                                 ELEMENTS (STE)               @G64RP2F 03044764
RTCTEEDC DS    F                  RTM COUNTER CONTAINS THE NUMBER       03044900
*                                 OF TIMES EEDS WERE NOT OBTAINED,      03045000
*                                 INCREMENTED BY 1 FOR EACH OCCURENCE   03045100
*                                 EEDS NOT OBTAINED            @G38AP1U 03045200
RTCTSD1  DS    0BL4               SDUMP TYPE AND EXIT DEFAULT      @L5C 03045300
*                                 OPTIONS                          @L5C 03045400
RTCTSDTY DS    0BL2               SDUMP TYPE FLAGS             @G383P12 03045500
RTCTTYP1 DS    B                  SDUMP TYPE FLAG 1            @G383P12 03045600
RTCTXMEM EQU   BIT0               1=TYPE=XMEM REQUESTED        @G38AP1U 03045700
RTCTXMEE EQU   BIT1               1=TYPE=XMEME REQUESTED       @G38AP1U 03045800
RTCTNOLC EQU   BIT2               1=TYPE=NOLOCAL REQUESTED     @G860P31 03045900
         DS    B                  RESERVED                     @G383P12 03046000
RTCTSDEX DS    0BL2               SDUMP EXIT FLAGS             @G386P12 03046100
RTCTEX1  DS    B                  SDUMP EXIT FLAG 1            @G386P12 03046200
RTCTGRSQ EQU   BIT0               1=GRSQ EXIT                  @G386P12 03046300
RTCTMSTR EQU   BIT1               1=MASTER TRACE & GTF GLOBAL EXIT @LEC 03046400
RTCTSMSX EQU   BIT2               1=SMSX LOCAL EXIT                @LDA 03046500
RTCTCPL  EQU   BIT3               1=COUPLE EXIT                    @LFA 03046600
RTCTXES  EQU   BIT4               1=XES LOCAL AND GLOBAL EXITS     @LMC 03046700
RTCTIOS  EQU   BIT5               1=IOS GLOBAL EXIT                @LJA 03046800
RTCTWLM  EQU   BIT6               1=WLM EXIT                       @LNA 03046900
RTCTRSM  EQU   BIT7               1=RSM EXIT                       @LOA 03047000
RTCTEX2  DS    B                  SDUMP EXIT FLAG 2            @G386P1U 03047100
RTCTSLIP EQU   BIT0               1=SLIP EXIT                      @LPA 03047200
RTCTOPEN EQU   BIT1               1=OPEN EDITION EXIT              @LRA 03047300
RTCTSVCD EQU   BIT2               1=TAILORED SVC DUMP EXIT         @LRA 03047400
RTCTSM10 DS    0BL4               SYSMDUMP TYPE AND EXIT FLAGS @G38FP31 03047500
RTCTSMTY DS    BL2                SYSMDUMP TYPE OPTIONS        @G38FP31 03047600
RTCTSMEX DS    0BL2               SYSMDUMP EXIT OPTIONS        @G38FP31 03047700
RTCTSMX1 DS    B                  1ST SYSMDUMP EXIT BYTE       @G38FP31 03047800
RTCTMGRS EQU   BIT0               1=GRSQ OPTION SPECIFIED      @G38FP31 03047900
RTCTSMX2 DS    B                  2ND EXIT BYTE                @G38FP31 03048000
RTCTZZZ8 DS    F                  RESV FOR SYSUDUMP TYPE/EXIT  @G38FP31 03048100
RTCTZZZ7 DS    F                  RESV FOR SYSABEND TYPE/EXIT  @G38FP31 03048200
RTCTSMD2 DS    0BL4               SYSMDUMP PARMLIB DEFAULTS FOR TYPE    03048300
*                                 AND EXIT OPTIONS             @G38FP31 03048400
RTCTMTYP DS    BL2                SYSMDUMP TYPE DEFAULTS       @G38FP31 03048500
RTCTMEXT DS    0BL2               SYSMDUMP EXIT DEFAULTS       @G38FP31 03048600
RTCTMEX1 DS    B                  FIRST EXIT BYTE              @G38FP31 03048700
RTCTMXGR EQU   BIT0               1=GRSQ OPTION                @G38FP31 03048800
RTCTMEX2 DS    B                  2ND SYSMDUMP EXIT BYTE       @G38FP31 03048900
RTCTRTSD DS    F                  POINTER TO RTCT SDUMP EXTENSION       03049000
*                                                              @G382P12 03049100
RTCTSMEW DS    F                  POINTER TO SUMMARY DUMP EXTENDED      03049200
*                                 WORKAREA IN THE DUMPSRV ADDRESS       03049300
*                                                        SPACE @G38EP31 03049400
RTCTASCB DS    F                  ADDRESS OF DUMPSRV ASCB      @G38EP31 03049500
RTCTSTIE DS    F                  Parallel Detach init ECB         @07C 03049600
RTCTDMP# DS    F                  SDUMP sequence number            @02C 03049700
RTCTXBT  DS    A                  For use by IPCS                  @LQC 03049800
RTCTPTRD DS    4F                 Data for permanent task restart  @LAA 03049900
RTCTQDDS DS    A                  POINTER TO IARQDSPD              @LCA 03050000
RTCTDPLF DS    A                  POINTER TO FRONT OF DPL Q        @LHA 03050200
RTCTDPLB DS    A                  POINTER TO BACK OF DPL Q         @LHA 03051000
RTCTCIDI DS    F                  DUMP ID COUNTER                  @LHA 03051800
RTCTMMTI DS    F                  MAX MESSAGE WAIT TIME            @LHA 03052600
RTCTCNT  DS    0D                 MAXSPACE COUNT                   @LMC 03053400
RTCTMCNT DS    F                  THE AMOUNT OF DATA SPACE STORAGE      03054200
*                                 IN MEG WHICH SDUMP HAS CAPTURED       03055000
*                                 DATA IN                          @LIA 03055800
RTCTPCNT DS    F                  THE REMAINING AMOUNT OF DATA SPACE    03056600
*                                 STORAGE IN PAGES WHICH SDUMP IS       03057400
*                                 USING THAT DOES NOT ADD UP TO A       03058200
*                                 MEG                              @LIA 03059000
RTCTMXSP DS    F                  SDUMPS MAXSPACE amount. This amount   03059800
*                                 can be exceeded by a small amount,    03060600
*                                 but once SDUMP realizes that it has   03061400
*                                 been exceeded the capturing of the    03062200
*                                 current SDUMP will be stopped and     03063000
*                                 the user will be given a partial      03063800
*                                 dump.                            @LIA 03064600
RTCTLEN  EQU   *-RTCT             TOTAL LENGTH OF RTM CONTROL TABLE.    03065400
         SPACE 2                                                        03066200
         MEND                                                           03067000
*        */                                                             03067800
*%RTCTPLS: ;                                                            03068600
*DECLARE                                                                03070043
*  1 RTCT BASED(CVTRTMCT),        /* CVT HAS THE ADDRESS OF THE RTCT    03150043
*                                                            @G33CPHE*/ 03160043
*    2 RTCTNAME   CHAR(4),        /* EBCDIC NAME IS C'RTCT'          */ 03170043
*   /*****************************************************************/ 03202043
*   /* SNAP/ABEND PARMLIB VALUES                                     */ 03204043
*   /*****************************************************************/ 03206043
*    2 RTCTPLIB CHAR(12),         /*                         @G33CPHE*/ 03210043
*     3 RTCTSAP    BIT(32),       /* *** SYSABEND INITIAL PARMLIB       03220043
*                                    VALUES *********************** */  03223043
*      4 RTCTSAP1   BIT(8),       /* (BYTE 1 OF SDATA OPTIONS:)     */  03230043
*        6 RTCTSAB0 BIT(1),       /* 1=DISPLAY NUCLEUS              */  03300043
*        6 RTCTSAB1 BIT(1),       /* 1=DISPLAY SQA                  */  03310043
*        6 RTCTSAB2 BIT(1),       /* 1=DISPLAY LSQA                 */  03320043
*        6 RTCTSAB3 BIT(1),       /* 1=DISPLAY SWA                  */  03330043
*        6 RTCTSAB4 BIT(1),       /* 1=DISPLAY GTF OR SUPERVISOR        03340043
*                                    TRACE                          */  03344002
*        6 RTCTSAB5 BIT(1),       /* 1=DISPLAY CONTROL BLOCKS FOR       03345043
*                                    TASK                           */  03348002
*        6 RTCTSAB6 BIT(1),       /* 1=DISPLAY ENQUEUE CNTRL BLKS   */  03348243
*        6 RTCTSAB7 BIT(1),      /* 1=FORMAT DATA MGMT C.B.S @G33CPHE*/ 03348843
*                                                                       03349143
*      4 RTCTSAP2 BIT(8),         /* (BYTE 2 OF SDATA OPTIONS:)      */ 03349843
*        6 RTCTSABG BIT(1),       /* 1=FORMAT IOS CNTRL BLKS @G33CPHE*/ 03350343
*        6 RTCTSABH BIT(1),       /* 1=FORMAT ERROR C.B.S    @G33CPHE*/ 03351143
*        6 RTCTSABI BIT(1),       /* 1=FORMAT PC INFORMATION @G382P12*/ 03352800
*        6 RTCTABSU BIT(1),       /* 1=SUMMARY DUMP REQUEST  @G860P12*/ 03352900
*        6 RTCTABAN BIT(1),       /* 1=DUMP ALL VIRTUAL NUC  @G860P12*/ 03353000
*        6 RTCTABNS BIT(1),       /* 1=NO SYMPTOM DUMP       @G860P12*/ 03353100
*        6 *        BIT(2),       /* RESERVED                @G860P12*/ 03353200
*                                                                       03353343
*      4 RTCTSAP3 BIT(8),         /* (BYTE 1 OF PDATA OPTIONS:)     */  03353843
*        6 RTCTSAB8 BIT(1),       /* 1=DISPLAY SAVE AREA TRACE (SA) */  03354843
*        6 RTCTSAB9 BIT(1),       /* 0=DISPLAY ENTIRE SAVE AREA         03360043
*                                    1=DISPLAY SAVE AREA HEADINGS       03366043
*                                      (SAH KEYWORD)                */  03369043
*        6 RTCTSABA BIT(1),       /* 1=DISPLAY REGISTERS            */  03385043
*        6 RTCTSABB BIT(1),       /* 1=DISPLAY LINK PACK AREA       */  03390043
*        6 RTCTSABC BIT(1),       /* 1=DISPLAY JOB PACK AREA        */  03392043
*        6 RTCTSABD BIT(1),       /* 1=DISPLAY PSW                  */  03394043
*        6 RTCTSABE BIT(1),       /* 1=DISPLAY USER SUBPOOLS:           03396043
*                                    0-127                          */  03398402
*        6 RTCTABST BIT(1),       /* 1=DISPLAY SUBTASK DATA @G860P12*/  03398600
*      4 RTCTSAP4   BIT(8),       /* RESERVED                       */  03398943
*                                                                       03401943
*    3 RTCTSUP    BIT(32),        /* *** SYSUDUMP INITIAL PARMLIB       03408943
*                                    VALUES *********************** */  03411943
*      4 RTCTSUP1   BIT(8),       /* (BYTE 1 OF SDATA OPTIONS:)     */  03418943
*        6 RTCTSUD0 BIT(1),       /* 1=DISPLAY NUCLEUS              */  03450043
*        6 RTCTSUD1 BIT(1),       /* 1=DISPLAY SQA                  */  03460043
*        6 RTCTSUD2 BIT(1),       /* 1=DISPLAY LSQA                 */  03470043
*        6 RTCTSUD3 BIT(1),       /* 1=DISPLAY SWA                  */  03480043
*        6 RTCTSUD4 BIT(1),       /* 1=DISPLAY GTF OR SUPERVISOR        03490043
*                                    TRACE                          */  03494002
*        6 RTCTSUD5 BIT(1),       /* 1=DISPLAY CONTROL BLOCKS FOR       03495043
*                                    TASK                           */  03498002
*        6 RTCTSUD6 BIT(1),       /* 1=DISPLAY ENQUEUE CONTROL BLKS */  03498243
*        6 RTCTSUD7 BIT(1),       /* 1=FORMAT DATA MANAGEMENT CONTROL   03498843
*                                    BLOCKS                 @G33CPHE*/  03499043
*                                                                       03499243
*      4 RTCTSUP2 BIT(8),         /* (BYTE 2 OF SDATA OPTIONS:)     */  03499843
*        6 RTCTSUDG BIT(1),       /* 1=FORMAT IOS C.B.S     @G33CPHE*/  03500843
*        6 RTCTSUDH BIT(1),       /* 1=FORMAT ERROR C.B.S   @G33CPHE*/  03501443
*        6 RTCTSUDI BIT(1),       /* 1=FORMAT PC INFORMATION            03502800
*                                                           @G860P12*/  03502900
*        6 RTCTSUSU BIT(1),       /* 1=DUMP SUMMARY DUMP    @G860P12*/  03503000
*        6 RTCTSUAN BIT(1),       /* 1=DUMP ALL VIRTUAL NUC @G860P12*/  03503100
*        6 RTCTSUNS BIT(1),       /* 1=NO SYMPTOM DUMP      @G860P12*/  03503200
*        6 *        BIT(2),       /* RESERVED               @G860P12*/  03503300
*                                                                       03503400
*      4 RTCTSUP3   BIT(8),       /* (BYTE 1 OF PDATA OPTIONS:)     */  03503843
*        6 RTCTSUD8 BIT(1),       /* 1=DISPLAY SAVE AREA TRACE (SA) */  03504843
*        6 RTCTSUD9 BIT(1),       /* 0=DISPLAY ENTIRE SAVE AREA         03510043
*                                    1=DISPLAY SAVE AREA HEADINGS       03516043
*                                      (SAH KEYWORD)                */  03519043
*        6 RTCTSUDA BIT(1),       /* 1=DISPLAY REGISTERS            */  03535043
*        6 RTCTSUDB BIT(1),       /* 1=DISPLAY LINK PACK AREA       */  03540043
*        6 RTCTSUDC BIT(1),       /* 1=DISPLAY JOB PACK AREA        */  03542043
*        6 RTCTSUDD BIT(1),       /* 1=DISPLAY PSW                  */  03544043
*        6 RTCTSUDE BIT(1),       /* 1=DISPLAY USER SUBPOOLS:           03546043
*                                    0-127                          */  03548402
*        6 RTCTSUST BIT(1),       /* 1=DISPLAY SUBTASK DATA @G860P12*/  03548600
*      4 RTCTSUP4 BIT(8),         /* RESERVED                       */  03549843
*                                                                       03550843
*    3 RTCTSYD BIT(32),           /* *** SYSMDUMP INITIAL PARMLIB       03552843
*                                    VALUES *********************** */  03553443
*      4 RTCTSY01 BIT(8),         /* (BYTE 1 OF SDATA OPTIONS:)     */  03554843
*        6 RTCTSYM0  BIT(1),      /* 1=DISPLAY NUCLEUS      @G33CPHE*/  03556843
*        6 RTCTSYM1  BIT(1),      /* 1=DISPLAY SQA          @G33CPHE*/  03558843
*        6 RTCTSYM2  BIT(1),      /* 1=DISPLAY LSQA         @G33CPHE*/  03560843
*        6 RTCTSYM3  BIT(1),      /* 1=DISPLAY SWA          @G33CPHE*/  03562843
*                                                                       03564843
*        6 RTCTSYM4  BIT(1),      /* 1=DISPLAY GTF OR SUPERVISOR        03570843
*                                    TRACE                  @G33CPHE*/  03571843
*        6 RTCTSYM5  BIT(1),      /* 1=DISPLAY REGION       @G33CPHE*/  03573843
*        6 RTCTSYM6  BIT(1),      /* 1=DISPLAY LPA FOR RGN  @G33CPHE*/  03575843
*        6 RTCTSYM7  BIT(1),      /* 1=DISPLAY CSA          @G33CPHE*/  03577843
*      4 RTCTSY02 BIT(8),         /* (BYTE 2 OF SDATA OPTS  @G860P12*/  03578500
*        6 RTCTSYMS  BIT(1),      /* 1=SUMMARY DUMP         @G860P12*/  03579200
*        6 RTCTSYMA  BIT(1),      /* 1=DUMP ALL VIRTUAL NUC @G860P12*/  03579900
*        6 RTCTSYMN  BIT(1),      /* 1=NO SYMPTOM DUMP      @G860P12*/  03580600
*        6 *         BIT(1),      /* RESERVED               @G860P12*/  03581300
*        6 *         BIT(1),      /* RESERVED               @G860P12*/  03582000
*        6 *         BIT(1),      /* RESERVED               @G860P12*/  03582700
*        6 *         BIT(1),      /* RESERVED               @G860P12*/  03583400
*        6 *         BIT(1),      /* RESERVED               @G860P12*/  03584100
*      4 RTCTSY03 BIT(8),         /* RESERVED                       */  03584843
*      4 RTCTSY04 BIT(8),         /* RESERVED                       */  03588843
*   /****************************************************************/  03589843
*   /* RTM INFORMATION                                              */  03590800
*   /****************************************************************/  03591843
*    2 RTCTYYY1   FIXED(15),      /* **RESERVED**           @G33CPHZ*/  03592843
*    2 RTCTSDLA   FIXED(15),      /* ASID of last address space         04048000
*                                    to be processed            @LGC*/  04050000
*    2 RTCTMECB   CHAR(4),        /* ECB WAITED ON BY MEMORY            04100002
*                                    TERMINATION CONTROLLER.        */  04120043
*    2 RTCTFASB   PTR(31),        /* ADDRESS OF FIRST ASCB ON MEMORY    04200002
*                                    TERMINATION QUEUE.             */  04250002
*    2 RTCTNAS  FIXED(31),         /* NUMBER OF ADDRESS SPACES TO BE    04277400
*                                     CAPTURED                  @LGC*/  04304800
*    2 RTCTEEDA PTR(31),          /* Global Anchor for EED's    @L9A*/  04332200
*    2 RTCTSDDS PTR(31),          /* ANCHOR OF THE SDDSQ QUEUE          04373400
*                                 0 - IF THE SDDSQ IS EMPTY @G860P31*/  04396800
*    2 RTCTCOUN FIXED(31),        /* Used for Compare and Swap          04408500
*                                                           @YA39397*/  04420200
*      3 RTCTSDDC FIXED(15),      /* COUNT OF THE NUMBER OF ENTRIES     04431900
*                                 IN THE SDDSQ.             @G860P31*/  04443600
*      3 RTCTMTCT FIXED(16),      /* Used to keep a count of the        04455300
*                                    subtasks belonging to Memory       04467000
*                                    Termination            @YA39397*/  04478700
*    2 RTCTDSV  PTR(31),          /* POINTER TO THE DUMPSRV ADDRESS     04490400
*                                 SPACE CONTROL BLOCK.      @G860P31*/  04513800
*    2 RTCTSSTK PTR(31),          /* POINTER TO STACK ADDRESS TABLE     04552800
*                                                               @L2A*/  04591800
*    2 RTCTADGL PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04630800
*                                    FOR QMNGRIO            @G860P12*/  04654200
*    2 RTCTADG1 PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04677600
*                                    FOR IEAVAD11           @G860P12*/  04701000
*    2 RTCTADG2 PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04724400
*                                    FOR IEAVAD21           @G860P12*/  04747800
*    2 RTCTADG3 PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04771200
*                                    FOR IEAVAD81           @G860P12*/  04794600
*    2 RTCTADG4 PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04818000
*                                    FOR IEAVAD08           @G860P12*/  04841400
*    2 RTCTADG5 PTR(31),          /* SNAP GLUE ROUTINE ADDRESS FOR      04864800
*                                    FOR IEAVAD12           @G860P12*/  04888200
*    2 RTCTTABG PTR(31),          /* ABDUMP GLUE ROUTINE ADDRESS FOR    04911600
*                                    EODAD ROUTINE          @G860P12*/  04935000
*    2 RTCTTABQ PTR(31),          /* ABDUMP GLUE ROUTINE ADDRESS FOR    04958400
*                                    QMNGRIO ROUTINE        @G860P12*/  04981800
*    2 RTCTTABR PTR(31),          /* ABDUMP GLUE ROUTINE ADDRESS FOR    05005200
*                                    READ/CHECK ROUTINE     @G860P12*/  05028600
*    2 RTCTDSCA PTR(31),          /* POINTER TO DAE COMMUNICATION       05042800
*                                    AREA                       @L1A*/  05061800
*    2 RTCTDIND PTR(31),          /* POINTER TO SDDIE CONTROL BLOCK     05062800
*                                    FOR SYSTEM                         05063800
*                                    NON-DISPATCHABILITY @L4A*/         05064800
*    2 RTCTDIRS PTR(31),          /* POINTER TO SDDIE CONTROL BLOCK     05065800
*                                    FOR THE REAL STORAGE BUFFER @L4A*/ 05066800
*    2 RTCTSDAT PTR(31),          /* POINTER TO SVC DUMP DATA AREAS     05070100
*                                    CONTROL BLOCK - SDDAT       @L5A*/ 05073400
*    2 RTCTSMOD PTR(31),          /* POINTER TO CONTROL BLOCK           05076700
*                                    CONTAINING SVC DUMP MODULE         05080000
*                                    ADDRESSES - SDMOD           @L5A*/ 05083300
*    2 RTCTSCON PTR(31),          /* POINTER TO CONTROL BLOCK           05086600
*                                    CONTAINING CONSTANTS USED IN       05089900
*                                    SVC DUMP PROCESSING - SDCON @L5A*/ 05093200
*    2 RTCTCPID CHAR(4),          /* CELL POOL ID FOR THE EEDS   @L6A*/ 05106500
*    2 RTCTRPAR PTR(31),          /* ADDRESS OF RSM PAGE ANALYSIS       05113100
*                                    ROUTINE (IARQD)             @L7A*/ 05119700
*    2 RTCTBPXP PTR(31),          /* OpenMVS Dump Adjunct Addr   @LLA*/ 05124200
*    2 RTCTRSVS CHAR(32),         /* RESERVED                    @P4C*/ 05128700
*    2 RTCTSDPL   PTR(31),        /* ADDRESS OF SVC DUMP PARAMETER  */  05133200
*    2 RTCTFMT PTR(31),           /* USED FOR TESTING RTM MODULES   */  05170043
*    2 RTCTMLCK FIXED(31),        /*  LOCK FOR MEM TERM POST SRB    */  05409602
*    2 RTCTMSRB PTR(31),          /*  PTR TO MEM TERM'S POST SRB    */  05419602
*    2 RTCTTEST PTR(31),          /* USED FOR TESTING RTM MODULES   */  05429602
*    2 RTCTSEQW CHAR(4) BDY(WORD),   /* FULLWORD FIELD CONTAINING THE   05432000
*                                 SEQ # IN THE SECOND HALFWORD  @L8C*/  05434400
*      3 *        CHAR(2),        /* RESERVED                   @L8C*/  05436800
*      3 RTCTSEQ# FIXED(16),      /* ERRORID SEQUENCE NBR       @L3C*/  05439200
*    2 RTCTSDSW PTR(31),          /* ADDR OF SUMMARY SVC DUMP(SUMDUMP)  05440043
*                                    WORK AREA (IHASMWK)    @G33VPHZ*/  05440643
*    2 RTCTTDCB CHAR(36),         /* TAPE DCB FOR SVC DUMP      @LHC*/  05442000
*    2 RTCTSDWK PTR(31),          /* ADDRESS OF SVC DUMP WORK AREA  */  05443041
*    2 RTCTERID CHAR(10),         /*ERRORID FOR THIS FAILURE'S SVC      05443543
*                                   DUMP HEADER             @G17EP5W*/  05443743
*      3 RTCTESEQ CHAR(2),        /*ERRORID SEQUENCE NUMBER @G17EP5W*/  05444243
*      3 RTCTECPU CHAR(2),        /*ERRORID LOGICAL CPU ID  @G17EP5W*/  05444343
*      3 RTCTEASD CHAR(2),        /*ERRORID ASID            @G17EP5W*/  05444643
*      3 RTCTETIM CHAR(4),        /*ERRORID TIME STAMP      @G17EP5W*/  05444743
*    2 RTCTXXX2 CHAR(2),          /*RESERVED                @G17EP5W*/  05444843
*   /****************************************************************/  05444943
*   /* DEFAULT DUMP OPTIONS, WHICH CAN BE CHANGED BY THE CHNGDUMP   */  05445043
*   /* OPERATOR COMMAND                                             */  05445443
*   /****************************************************************/  05445543
*    2 RTCTOPT CHAR(16),          /*                        @G33CPHE*/  05445643
*      3 RTCTSAO    BIT(32),      /* SYSABEND EFFECTIVE OPTIONS     */  05445943
*      3 RTCTSUO    BIT(32),      /* SYSUDUMP EFFECTIVE OPTIONS     */  05446043
*      3 RTCTSYO    BIT(32),      /* SYSMDUMP EFFECTIVE OPTIONS.        05446100
*                                    SYSMDUMP TYPE AND EXIT EFFECTIVE   05446200
*                                    OPTIONS ARE IN RTCTSM1 @G38FP31*/  05446300
*      3 RTCTSDO    BIT(32),      /* SVC DUMP EFFECTIVE (DEFAULT)       05446400
*                                    OPTIONS. SDUMP TYPE AND EXIT       05446500
*                                    EFFECTIVE OPTIONS ARE IN           05446600
*                                    RTCTSD1 @L5C*/                     05446700
*   /****************************************************************/  05446800
*   /* ADDITIONAL SVC DUMP INFORMATION AND FLAGS                    */  05446900
*   /****************************************************************/  05447143
*    2 *      BIT(16),            /* OLD RTCTASO - RESERVED      @L5A*/ 05449400
*    2 RTCTSDI,                   /* *** SVC DUMP INFORMATION ***    */ 05451743
*      3 RTCTSDNA FIXED(8),       /* NUMBER OF ADDRESS SPACES TO        05451900
*                                    DUMP                        @LAC*/ 05452000
*      3 RTCTINDX FIXED(8),       /* INDEX FOR ASID LIST ENTRY          05452200
*                                                                @LAC*/ 05452300
*      3 RTCTSDPR FIXED(8),       /* PERMANENT RETURN CODE   @G33VPHD*/ 05452443
*    2 RTCTBUFV   CHAR(4),        /* CD SET,SDUMP,BUFFERS=nnnn value.   05452900
*                                    Default value is zero.      @LBC*/ 05453400
*    2 RTCTZZZ2   CHAR(3),        /* RESERVED                @G38AP1U*/ 05454000
*                                                                       05454100
*    2 RTCTSDF    BIT(16),        /* *** SVC DUMP FLAGS ***  @G33VPHD*/ 05454200
*      3 RTCTSDF1   BIT(8),       /* (BYTE 1 OF FLAGS:)      @G33VPHD*/ 05454300
*        4 RTCTSDNS   BIT(1),     /* INDICATES ADDRESS SPACE HAS BEEN   05454400
*                                    SET NON-SWAPPABLE           @L4A*/ 05454500
*        4 RTCTSDND   BIT(1),     /* SVC DUMP SET SYSTEM                05454600
*                                    NONDISPATCHABLE         @G33VPHD*/ 05454700
*        4 RTCTSDSH   BIT(1),     /* SCHEDULE DUMP (IEAVTSDX)           05454800
*                                    REQUEST                 @G33VPHD*/ 05454900
*        4 RTCTSDMA BIT(1),       /* MULTIPLE ADDRESS SPACE DUMP IN     05455000
*                                    PROCESS                 @G33VPHD*/ 05455100
*        4 *        BIT(1),       /* RESERVED                    @LGC*/ 05455200
*        4 RTCTSDSD BIT(1),       /* SUMMARY DUMP (IEAVTSSD) RECEIVED   05455300
*                                    CONTROL                 @G33VPHD*/ 05455400
*        4 *        BIT(1),       /* UNUSED                      @LHC*/ 05455500
*        4 RTCTSDSC BIT(1),       /* SUMMARY DUMP (IEAVTSSD) COMPLETED  05455700
*                                    PROCESSING              @G33VPHD*/ 05455800
*                                                                       05456143
*      3 RTCTSDF2 BIT(8),         /* (BYTE 2 OF FLAGS:)      @G33VPHD*/ 05456243
*        4 RTCTSDMR BIT(1),       /* DUMP OF MASTER A.S. REQ @G33VPHD*/ 05456443
*        4 RTCTSYSF BIT(1),       /* Indicates SYSEVENT AVQDELTA has    05458600
*                                    been issued by SRB IEAVTSD2 @LBC*/ 05460800
*        4 RTCTDSFX BIT(1),    /* Used by IEAVTSDS to save TCBFX @LBA*/ 05463000
*        4 *        BIT(1),       /* RESERVED                    @LGC*/ 05465400
*        4 RTCTSDWF BIT(1),       /* SUMDUMP WRITER (IEAVTSDW)          05468443
*                                    COMPLETED               @G33VPHD*/ 05469443
*        4 *        BIT(1),       /* RESERVED                    @LGC*/ 05471400
*        4 RTCTSDRW BIT(1),       /* SUMDUMP RECORDS (FROM              05472443
*                                    IEAVTSSD) TO WRITE      @G33VPHD*/ 05473043
*        4 RTCTSDFX BIT(1),       /* SVC DUMP SET TCBFX BIT. THIS       05474400
*                                    PREVENTS ASYNCHRONOUS INTERRUPT    05475800
*                                    EXITS FROM RECEIVING CONTROL       05477200
*                                    UNDER THE CURRENT TASK. THESE      05478600
*                                    EXITS RESULT FROM I/O ERRORS TO    05480000
*                                    NON-DASD DEVICES OR FROM USER      05481400
*                                    REQUESTED TIMER EXITS      @L4C*/  05482800
*   /* THE FOLLOWING BITS IN RTCTZZZ3 SHOULD NOT BE AND ARE NOT */      05484600
*   /* REINITIALIZED BETWEEN SDUMP REQUESTS                  @ZMB0161*/ 05484700
*    2 RTCTZZZ3     BIT(16),      /* ADD. SCV DUMP FLAGS     @VS49372*/ 05484800
*      3 *          BIT(1),       /* RESERVED                   @L4A*/  05484900
*      3 RTCTSDNO   BIT(1),     /* NO SYS1.DUMP D.S. DEFINED @ZMB0161*/ 05485100
*      3 RTCTBPXC   BIT(1),       /* OpenMVS install checked     @P6C*/ 05485200
*      3 RTCTNNEW   BIT(1),       /* Do not allow new SVC dumps  @05C*/ 05485300
*      3 RTCTZDPL   BIT(1),       /* Zero RTCTSDPL to unserializ @08A*/ 05485420
*      3 *        BIT(11),        /* RESERVED                    @08C*/ 05485440
*    /****************************************************************/ 05485500
*    /* ARRAY OF INFORMATION FOR SVC DUMP OF MULTIPLE ADDRESS SPACES */ 05485600
*    /****************************************************************/ 05485700
*    2 RTCTASTB,                  /* SVC DUMP ASID TABLE         @L5A*/ 05485800
*     3 RTCTSDF3(16) BIT(32) BDY(WORD), /*                       @P3C*/ 05485900
*      4 RTCTSDAS BIT(16),        /* ASID OF THIS ADDRESS               05486000
*                                    SPACE                   @G33VPHZ*/ 05486100
*      4 RTCTSDF4 BIT(8),         /* (BYTE 1 OF FLAGS:)      @G33VPHD*/ 05486200
*        5 RTCTSDSS BIT(1),       /* DUMP SRB SCHEDULED      @G33VPHD*/ 05486300
*        5 RTCTSDNC BIT(1),       /* DUMP SRB RECEIVED CONTROL          05486400
*                                                            @G33VPHD*/ 05486543
*        5 RTCTSDAN BIT(1),       /* ADDR SPACE SET NON-DISPATCHABLE    05487600
*                                                            @G33VPHD*/ 05487743
*        5 RTCTSDRM BIT(1),       /* DUMP TASK HAS BEEN RESUMED         05488100
*                                                            @G33VPHD*/ 05488243
*        5 RTCTSDTR BIT(1),       /* DUMP TASK RUNNING       @G33VPHD*/ 05488600
*        5 RTCTSDEQ BIT(1),       /* DUMP TASK ENQUEUED ON SDUMP        05489000
*                                    RESOURCE                @G33VPHD*/ 05489443
*        5 RTCTSDEN BIT(1),       /* SVC DUMP (IEAVAD00 OR IEAVTSDT)    05490300
*                                    IS PROCESSING THIS ADDRESS SPACE   05490443
*                                    ENTRY                   @G33VPHD*/ 05490543
*        5 RTCTSDDO BIT(1),       /* DUMP ATTEMPTED FOR THIS ASID       05490700
*                                                            @G33VPHD*/ 05491043
*      4 RTCTSDF5   BIT(8),       /* ADDRESS SPACE FLAG BYTE @G382P12*/ 05491700
*        5 RTCTLSTA  BIT(1),      /* LISTA STORAGE RANGES SPECIFIED     05491800
*                                    FOR THIS ADDRESS SPACE  @G382P12*/ 05491900
*        5 RTCTOLST  BIT(1),      /* LISTA IS ONLY REQUESTED OPTION     05492000
*                                    FOR THIS ADDRESS SPACE  @G382P12*/ 05492100
*        5 RTCTTERM  BIT(1),      /* IEAVTSRB should terminate   @LBA*/ 05492200
*        5 RTCTOCDS  BIT(1),      /* This ASID is ONLY the owning ASID  05492300
*                                     of a scope(all) data space @D1C*/ 05492400
*        5 RTCTOSTP  BIT(1),      /* This ASID is ONLY stopped and      05492500
*                                     should not be dumped       @P2A*/ 05492600
*        5 RTCTCS    BIT(1),      /* IEAVTSDT is in CS logic to         05492700
*                                    decrement field RTCTNAS     @LHA*/ 05492800
*        5 RTCTDONE  BIT(1),      /* IEAVTSDT capture complete   @03C*/ 05492900
*        5 *         BIT(1),      /* RESERVED                    @LGC*/ 05493000
*                                                                       05493100
*   /*****************************************************************/ 05493200
*   /* RTM INFORMATION                                               */ 05493300
*   /*****************************************************************/ 05493400
*    2 RTCTMRMQ PTR(31),          /* ADDRESS OF QUEUE OF STORAGE AREAS  05493500
*                                    (FOR SYSMDUMPS) TO BE FREED AT     05493600
*                                    MEMTERM                 @G33SPHZ*/ 05493700
*    2 RTCTSTE  PTR(31),          /* ADDRESS OF QUEUE OF SLIP TSO       05493800
*                                    ELEMENTS (STE)          @G64RP2F*/ 05493900
*    2 RTCTEEDC FIXED(31),        /* RTM COUNTER CONTAINS THE NUMBER    05494000
*                                    OF TIMES EEDS WERE NOT OBTAINED,   05494100
*                                    INCREMENTED BY 1 FOR EACH          05494200
*                                    OCCURENCE EEDS NOT OBTAINED.       05494300
*                                                            @G38AP12*/ 05494400
*      /* TYPE AND EXIT EFFECTIVE (DEFAULT) OPTIONS FOR SDUMP           05494500
*                                                 AND SYSMDUMP   @L5C*/ 05494600
*    2 RTCTOPT2 CHAR(8),          /* TYPE AND EXIT FLAGS     @G38FP31*/ 05494700
*     3 RTCTSD1  BIT(32),         /* SDUMP FLAGS             @G383P12*/ 05494800
*     3 RTCTSM1  BIT(32),         /* SYSMDUMP FLAGS          @G38FP31*/ 05494900
*    2 RTCTZZZ8 PTR(31),          /* RESV SYSUDUMP TYPE/EXIT @G38FP31*/ 05495000
*    2 RTCTZZZ7 PTR(31),          /* RESV SYSABEND TYPE/EXIT @G38FP31*/ 05495100
*    2 RTCTSMD2 CHAR(4),          /* SYSMDUMP PARMLIB DEFAULTS          05495200
*                                  FOR TYPE AND EXIT OPTIONS @G38FP31*/ 05495300
*     3 RTCTMTYP BIT(16),         /* SYSMDUMP TYPE DEFAULTS  @G38FP31*/ 05495400
*     3 RTCTMEXT BIT(16),         /* SYSMDUMP EXIT DEFAULTS  @G38FP31*/ 05495500
*      4 RTCTMEX1 BIT(8),         /* FIRST EXIT BYTE         @G38FP31*/ 05495600
*       5 RTCTMXGR BIT(1),        /* 1=GRSQ OPTION           @G38FP31*/ 05495700
*       5 * BIT(7),               /* RESERVED                    @P6C*/ 05495800
*      4 RTCTMEX2 BIT(8),         /* 2ND SYSMDUMP EXIT BYTE  @G38FP31*/ 05496000
*    2 RTCTRTSD PTR(31),          /* RTCT EXTENSION POINTER FOR SDUMP   05496100
*                                                            @G382P12*/ 05496200
*    2 RTCTSMEW PTR(31),          /* POINTER TO SUMMARY DUMP EXTENDED   05496300
*                                    WORKAREA IN THE DUMPSRV ADDRESS    05496400
*                                                     SPACE  @G38EP31*/ 05496500
*    2 RTCTASCB PTR(31),          /* ADDRESS OF DUMPSRV ASCB @G38EP31*/ 05497000
*    2 RTCTSTIE FIXED(31),        /* Parallel Detach init ECB    @07C*/ 05497400
*    2 RTCTDMP# FIXED(31),        /* Dump sequence number        @02C*/ 05497900
*    2 RTCTXBT  PTR(31),          /* For use by IPCS             @LQC*/ 05498000
*    /****************************************************************/ 05498100
*    /* Data for Permanent Task Restart                              */ 05498200
*    /****************************************************************/ 05498300
*    2 RTCTPTRD BDY(WORD),        /* Permanent task restart      @LAA*/ 05498400
*      3 RTCTPTRF ABNORMAL BDY(WORD), /* Task restart flags      @LAA*/ 05498500
*        4 RTCTTRF1,              /* First flag byte             @LAA*/ 05498600
*          5 RTCTMSIC BIT(1),     /* IEAVTMSI has completed its         05498700
*                                    initialization processing   @LAA*/ 05498800
*          5 *      BIT(7),       /* Reserved                    @LAA*/ 05498900
*        4 RTCTTRF2,              /* Restart active bits         @LAA*/ 05499000
*          5 RTCTMTRA BIT(1),     /* Memterm task restart is active     05499100
*                                                                @LAA*/ 05499200
*          5 RTCTDTRA BIT(1),     /* Dump task restart is active @LAA*/ 05499300
*          5 RTCTRTRA BIT(1),     /* Record task restart is active      05499400
*                                                                @LAA*/ 05499500
*          5 RTCTSTRA BIT(1),     /* Scanner Task restart active @07A*/ 05499600
*          5 *        BIT(3),     /* Reserved                    @07C*/ 05499700
*          5 RTCTCNCL BIT(1),     /* DUMPSRV was cancelled       @06A*/ 05499800
*        4 *     CHAR(2),         /* Reserved                    @LAA*/ 05499900
*      3 RTCTMTIE FIXED(31),      /* Memterm task initialization ECB    05500000
*                                                                @LAA*/ 05500100
*      3 RTCTDTIE FIXED(31),      /* Dump task initialization ECB       05500200
*                                                                @LAA*/ 05500300
*      3 RTCTRTIE FIXED(31),      /* Record task initialization ECB     05500400
*                                                                @LAA*/ 05500500
*    2 RTCTQDDS PTR(31),          /* Entry point for IARQDSPD - used    05500600
*                                     by SDUMP                   @LCA*/ 05500700
*    2 RTCTDPLF PTR(31),          /* POINTER TO FRONT OF DPL Q  @LHA*/  05500800
*    2 RTCTDPLB PTR(31),          /* POINTER TO BACK OF DPL Q   @LHA*/  05500900
*    2 RTCTCIDI FIXED(31),        /* DUMP ID COUNTER            @LHA*/  05501000
*    2 RTCTMMTI FIXED(31),        /* MAX MESSAGE WAIT TIME      @LHA*/  05501100
*    2 RTCTCNT BDY(DWORD),        /* MAXSPACE COUNT             @LMC*/  05501200
*      3 RTCTMCNT FIXED(31),      /* THE AMOUNT OF DATA SPACE           05501300
*                                    STORAGE IN MEG WHICH SDUMP HAS     05501400
*                                    CAPTURED DATA IN           @LIA*/  05501500
*      3 RTCTPCNT FIXED(31),      /* THE REMAINING AMOUNT OF DATA       05501600
*                                    SPACE STORAGE IN PAGES WHICH       05501700
*                                    SDUMP IS USING THAT DOES NOT       05501800
*                                    ADD UP TO A MEG            @LIA*/  05501900
*    2 RTCTMXSP FIXED(32);        /* MAXSPACE, THE MAX AMOUNT OF        05502000
*                                    DATA SPACE STORAGE IN MEG THAT     05502100
*                                    MAY BE USED BY SDUMP AT ANY        05502200
*                                    INSTANT IN TIME.This amount can    05502300
*                                    be exceeded by a small amount,     05502400
*                                    but once SDUMP realizes that it    05502500
*                                    has been exceeded the capturing    05502600
*                                    of the current SDUMP will be       05502700
*                                    stopped and the user will be       05502800
*                                    given a partial dump. The value    05502900
*                                    of MAXSPACE is set by the          05503000
*                                    CHNGDUMP command.          @LIA*/  05503100
*    @EJECT;                                                            05503200
*   /*****************************************************************/ 05503300
*   /* THE FOLLOWING MAPS THE BITS OF THE DEFAULT (EFFECTIVE)        */ 05503400
*   /* DUMP OPTION WORDS (RTCTOPT) FROM IPL AND CHNGDUMP COMMAND     */ 05503500
*   /*****************************************************************/ 05503600
*DECLARE                                                                05503700
*  1 RTCTMOPT BASED(ADDR(RTCTOPT)),                      /*  @G33CPHE*/ 05503800
*    2 RTCTMSAO   BIT(32),        /* *** SYSABEND EFFECTIVE OPTIONS     05503900
*                                    *****************************   */ 05504000
*     3 RTCTSASD BIT(16),         /* SDATA BYTES                     */ 05504100
*      4 RTCTSAO1   BIT(8),       /* (BYTE 1 OF SDATA OPTIONS:)      */ 05504200
*        6 RTCTSAD0 BIT(1),       /* 1=DISPLAY NUCLEUS               */ 05504300
*        6 RTCTSAD1 BIT(1),       /* 1=DISPLAY SQA                   */ 05504500
*        6 RTCTSAD2 BIT(1),       /* 1=DISPLAY LSQA                  */ 05505000
*        6 RTCTSAD3 BIT(1),       /* 1=DISPLAY SWA                   */ 05505500
*        6 RTCTSAD4 BIT(1),       /* 1=DISPLAY GTF OR SUPERVISOR        05506000
*                                    TRACE                           */ 05506500
*        6 RTCTSAD5 BIT(1),       /* 1=DISPLAY CONTROL BLOCKS FOR       05507643
*                                    TASK                            */ 05517643
*        6 RTCTSAD6 BIT(1),       /* 1=DISPLAY ENQUEUE CONTROL BLKS  */ 05527643
*        6 RTCTSAD7 BIT(1),       /* 1=FORMAT DATA MANAGEMENT CONTROL   05547643
*                                    BLOCKS                  @G33CPHE*/ 05567643
*      4 RTCTSAO2 BIT(8),         /* (BYTE 2 OF SDATA OPTIONS:)      */ 05587643
*        6 RTCTSADG BIT(1),       /* 1=FORMAT IOS C.B.S      @G33CPHE*/ 05639643
*        6 RTCTSADH BIT(1),       /* 1=FORMAT ERROR C.B.S    @G33CPHE*/ 05649643
*        6 RTCTSADI BIT(1),       /* 1=FORMAT PC INFORMATION @G33CPHE*/ 05679600
*        6 RTCTSADJ BIT(1),       /* 1=SUMMARY DUMP          @G860P12*/ 05693600
*        6 RTCTSADK BIT(1),       /* 1=DUMP ALL VIRTUAL NUC  @G860P12*/ 05707600
*        6 RTCTSADL BIT(1),       /* 1=NO SYMPTOM DUMP       @G860P12*/ 05721600
*        6 *        BIT(2),       /* RESERVED                @G860P12*/ 05735600
*     3 RTCTSAPD BIT(16),                                               05749643
*      4 RTCTSAO3   BIT(8),       /* (BYTE 1 OF PDATA OPTIONS:)      */ 05779643
*        6 RTCTSAD8 BIT(1),       /* 1=DISPLAY SAVE AREA TRACE (SA)  */ 05829643
*        6 RTCTSAD9 BIT(1),       /* 0=DISPLAY ENTIRE SAVE AREA         05929643
*                                    1=DISPLAY SAVE AREA HEADINGS       05999643
*                                      (SAH KEYWORD)                 */ 06009643
*        6 RTCTSADA BIT(1),       /* 1=DISPLAY REGISTERS             */ 06029643
*        6 RTCTSADB BIT(1),       /* 1=DISPLAY LINK PACK AREA        */ 06059643
*        6 RTCTSADC BIT(1),       /* 1=DISPLAY JOB PACK AREA         */ 06089643
*        6 RTCTSADD BIT(1),       /* 1=DISPLAY PSW                   */ 06119643
*        6 RTCTSADE BIT(1),       /* 1=DISPLAY USER SUBPOOLS:           06209643
*                                    0-127                           */ 06299643
*        6 RTCTSADF BIT(1),       /* 1=DUMP ALL SUBTASKS     @G860P12*/ 06329600
*      4 RTCTSAO4 BIT(8),                                               06389643
*        6 * BIT(6),              /* (BYTE 1 OF OTHER OPTIONS:)      */ 06429643
*        6 RTCTSAMG BIT(1),       /* SEE RTCTSAOV            @G33CPHZ*/ 06449643
*          7 RTCTSAOV BIT(1),     /* 1=OVER MODE  0=ADD MODE @G33CPHZ*/ 06469643
*        6 RTCTISAB BIT(1),  /* IGNORE REQUESTS FOR SYSABEND @G33CPHE*/ 06489643
*                                                                       06549643
*    2 RTCTMSUO   BIT(32),        /* *** SYSUDUMP EFFECTIVE OPTIONS     06599643
*                                    *****************************   */ 06609643
*     3 RTCTSUSD BIT(16),         /* SDATA BYTES             @G33CPHE*/ 06629643
*      4 RTCTSUO1   BIT(8),       /* (BYTE 1 OF SDATA OPTIONS:)      */ 06649643
*        6 RTCTSYD0 BIT(1),       /* 1=DISPLAY NUCLEUS               */ 06689643
*        6 RTCTSYD1 BIT(1),       /* 1=DISPLAY SQA                   */ 06719643
*        6 RTCTSYD2 BIT(1),       /* 1=DISPLAY LSQA                  */ 06749643
*        6 RTCTSYD3 BIT(1),       /* 1=DISPLAY SWA                   */ 06779643
*        6 RTCTSYD4 BIT(1),       /* 1=DISPLAY GTF OR SUPERVISOR        06859643
*                                    TRACE                           */ 06949643
*        6 RTCTSYD5 BIT(1),       /* 1=DISPLAY CONTROL BLOCKS FOR       06999643
*                                    TASK                            */ 07049643
*        6 RTCTSYD6 BIT(1),       /* 1=DISPLAY ENQUEUE CNTRL BLKS    */ 07069643
*        6 RTCTSYD7 BIT(1),       /* 1=FORMAT DATA MANAGEMENT CONTROL   07129643
*                                    BLOCKS                 @G33CPHE */ 07149643
*      4 RTCTSUO2 BIT(8),         /* (BYTE 2 OF SDATA OPTIONS:)      */ 07169643
*        6 RTCTSYDG BIT(1),       /* 1=FORMAT IOS C.B.S     @G33CPHE */ 07209643
*        6 RTCTSYDH BIT(1),       /* 1=FORMAT ERROR C.B.S   @G33CPHE */ 07239643
*        6 RTCTSYDI BIT(1),       /* 1=FORMAT PC INFORMATION @G382P12*/ 07269600
*        6 RTCTSYDJ BIT(1),       /* 1=SUMMARY DUMP          @G860P12*/ 07275600
*        6 RTCTSYDK BIT(1),       /* 1=DUMP ALL VIRTUAL NUC  @G860P12*/ 07281600
*        6 RTCTSYDL BIT(1),       /* 1=NO SYMPTOM DUMP       @G860P12*/ 07287600
*        6 * BIT(2),              /* RESERVED                @G860P12*/ 07293600
*     3 RTCTSUPD BIT(16),         /*                         @G33CPHE*/ 07299643
*      4 RTCTSUO3   BIT(8),       /* (BYTE 1 OF PDATA OPTIONS:)      */ 07329643
*        6 RTCTSYD8 BIT(1),       /* 1=DISPLAY SAVE AREA TRACE (SA)  */ 07359643
*        6 RTCTSYD9 BIT(1),       /* 0=DISPLAY ENTIRE SAVE AREA         07449643
*                                    1=DISPLAY SAVE AREA HEADINGS       07459643
*                                    (SAH KEYWORD)                   */ 07465643
*        6 RTCTSYDA BIT(1),       /* 1=DISPLAY REGISTERS             */ 07479643
*        6 RTCTSYDB BIT(1),       /* 1=DISPLAY LINK PACK AREA        */ 07499643
*        6 RTCTSYDC BIT(1),       /* 1=DISPLAY JOB PACK AREA         */ 07519643
*        6 RTCTSYDD BIT(1),       /* 1=DISPLAY PSW                   */ 07539643
*        6 RTCTSYDE BIT(1),       /* 1=DISPLAY USER SUBPOOLS:           07599643
*                                    0-127                           */ 07649643
*        6 RTCTSYDF BIT(1),       /* 1=DUMP SUBTASK DATA     @G860P12*/ 07679600
*      4 RTCTSUO4 BIT(8),                                               07749643
*        6 * BIT(6),              /* (BYTE 1 OF OTHER DATA:)         */ 07799643
*        6 RTCTSUMG BIT(1),       /* SEE RTCTSUOV            @G33CPHZ*/ 07819643
*          7 RTCTSUOV BIT(1),     /* 1=OVER MODE  0=ADD MODE @G33CPHZ*/ 07849643
*        6 RTCTISYU BIT(1),  /* IGNORE REQUESTS FOR SYSUDUMP @G33CPHE*/ 07879643
*                                                                       07949643
*    2 RTCTMSYO BIT(32),          /* *** SYSMDUMP EFFECTIVE OPTIONS     07999643
*                                    *****************************   */ 08009643
*      3 RTCTSD01 BIT(8),         /* (BYTE 1 OF SDATA OPTIONS:)      */ 08039643
*        4 RTCTSDS0 BIT(1),       /* 1=DISPLAY NUCLEUS       @G33CPHE*/ 08079643
*        4 RTCTSDS1 BIT(1),       /* 1=DISPLAY SQA           @G33CPHE*/ 08119643
*        4 RTCTSDS2 BIT(1),       /* 1=DISPLAY LSQA          @G33CPHE*/ 08159643
*        4 RTCTSDS3 BIT(1),       /* 1=DISPLAY SWA           @G33CPHE*/ 08199643
*        4 RTCTSDS4 BIT(1),       /* 1=DISPLAY GTF OR SUPERVISOR TRACE  08299643
*                                                            @G33CPHE*/ 08349643
*        4 RTCTSDS5 BIT(1),       /* 1=DISPLAY REGION        @G33CPHE*/ 08389643
*        4 RTCTSDS6 BIT(1),       /* 1=DISPLAY LPA FOR RGN   @G33CPHE*/ 08409643
*        4 RTCTSDS7 BIT(1),       /* 1=DISPLAY CSA           @G33CPHE*/ 08469643
*      3 RTCTSD02 BIT(8),         /* SECOND SDATA BYTE       @G860P12*/ 08485600
*        4 RTCTSDS8 BIT(1),       /* 1=SUMMARY DUMP          @G860P12*/ 08501600
*        4 RTCTSDS9 BIT(1),       /* 1=DUMP ALL NUCLEUS      @G860P12*/ 08517600
*        4 RTCTSDSA BIT(1),       /* 1=NO SYMPTOM DUMP       @G860P12*/ 08533600
*      3 RTCTSD03 BIT(8),         /* RESERVED                        */ 08549643
*      3 RTCTSD04 BIT(8),                                               08649643
*        4 * BIT(6),              /* (BYTE 1 OF OTHER DATA:)         */ 08699643
*        4 RTCTSMMG BIT(1),       /* SEE RTCTSMOV            @G33CPHZ*/ 08719643
*          5 RTCTSMOV BIT(1),     /* 1=OVER MODE  0=ADD MODE @G33CPHZ*/ 08749643
*        4 RTCTISYM BIT(1),  /* IGNORE REQUESTS FOR SYSMDUMP @G33CPHE*/ 08779643
*                                                                       08849643
*    2 RTCTMSDO   BIT(32),        /* *** SVC DUMP EFFECTIVE OPTIONS     08899643
*                                   (ONLY SUPPLIED BY CHNGDUMP          08909643
*                                   COMMAND) ************    @G33CPHZ*/ 08919643
*      3 RTCTSDOD BIT(16),        /* SDATA BYTES             @G33CPHZ*/ 08929643
*        4 RTCTSDO1   BIT(8),     /* (BYTE 1 OF SDATA OPTIONS:)      */ 08949643
*          6 RTCTSDP0 BIT(1),     /* 1=DISPLAY ALL PSA'S IN             08979643
*                                    SYSTEM                          */ 09049643
*          6 RTCTSDP1 BIT(1),     /* 1=DISPLAY CURRENT PSA           */ 09089643
*          6 RTCTSDP2 BIT(1),     /* 1=DISPLAY READ/WRITE NUCLEUS       09116200
*                                    ONLY                    @G860P12*/ 09142800
*          6 RTCTSDP3 BIT(1),     /* 1=DISPLAY SQA                   */ 09169643
*          6 RTCTSDP4 BIT(1),     /* 1=DISPLAY LSQA                  */ 09209643
*          6 RTCTSDP5 BIT(1),     /* 1=DISPLAY REGION (PRIVATE          09249643
*                                    AREA)                           */ 09349643
*          6 RTCTSDP6 BIT(1),     /* 1=DISPLAY ACTIVE LPA MODULES       09399643
*                                    FOR REGION                      */ 09429643
*          6 RTCTSDP7 BIT(1),     /* 1=DISPLAY GTF OR SUPERVISOR        09459643
*                                    TRACE                           */ 09549643
*                                                                       09599643
*        4 RTCTSDO2   BIT(8),     /* (BYTE 2 OF SDATA OPTIONS:)      */ 09649643
*          6 RTCTSDP8 BIT(1),     /* 1=DISPLAY CSA                   */ 09669643
*          6 RTCTSDP9 BIT(1),     /* 1=DISPLAY SWA                   */ 09689643
*          6 RTCTSDPA BIT(1),     /* 1=DISPLAY SUMMARY SVC DUMP         09709643
*                                    (SUMDUMP)               @G33CPHE*/ 09769643
*          6 RTCTSDPB BIT(1),     /* 1=NO SUMMARY DUMP DISPLAY          09849643
*                                                            @G33CPHE*/ 09899643
*          6 RTCTSDPC BIT(1),     /* 1=NO ALL PSA DISPLAY    @G33CPHE*/ 09939643
*          6 RTCTSDPD BIT(1),     /* 1=NO SQA DISPLAY        @G33CPHE*/ 09979643
*          6 RTCTSDPE BIT(1),     /* 1=DUMP ALL NUCLEUS      @G860P12*/ 10019600
*          6 RTCTDEF  BIT(1),     /* 1=DEFAULTS                  @01A*/ 10059600
*                                                                       10099643
*      3 RTCTSDO3 BIT(8),         /* (BYTE 1 OF OTHER OPTIONS:)      */ 10149643
*        4 RTCTSDPG BIT(1),       /* 1 MEANS QUIESCE=YES SPECIFIED ON   10199643
*                                    CHNGDUMP COMMAND                */ 10249643
*        4 RTCTSDPH BIT(1),       /* 1 MEANS QUIESCE=NO SPECIFIED ON    10299643
*                                    CHNGDUMP COMMAND                */ 10349643
*        4 *        BIT(6),       /* RESERVED                        */ 10379600
*      3 RTCTSDO4 BIT(8),         /* (BYTE 2 OF OTHER OPTIONS:)      */ 10409643
*        4 * BIT(6),              /* RESERVED                        */ 10449643
*        4 RTCTSDMG BIT(1),       /* SEE RTCTSDOV            @G33CPHZ*/ 10549643
*          5 RTCTSDOV BIT(1),     /* 1=OVER MODE  0=ADD MODE @G33CPHZ*/ 10559643
*        4 RTCTISVC BIT(1); /* IGNORE REQUESTS FOR SVC DUMPS @G33CPHE*/ 10599643
*      /* SDUMP TYPE AND EXIT EFFECTIVE OPTIONS MAPPING      @G38FP31*/ 10616200
*  %RTCTLEN='LENGTH(RTCT)';       /* TOTAL LENGTH OF RTCT            */ 10632800
*     /* SDUMP TYPE AND EXIT EFFECTIVE (DEFAULT) OPTIONS MAPPING @L5A*/ 10641200
*  DCL 1 RTCTSD10 BIT(32) BASED(ADDR(RTCTSD1)), /* FLAGS     @G383P12*/ 10649600
*       2 RTCTSDTY BIT(16),       /* SDUMP TYPE FLAGS        @G383P12*/ 10699600
*         3 RTCTTYP1 BIT(8),      /* TYPE FLAGS 1            @G383P12*/ 10749600
*           4 RTCTXMEM BIT(1),    /* 1=TYPE=XMEM REQUESTED   @G383P12*/ 10799600
*           4 RTCTXMEE BIT(1),    /* 1=TYPE=XMEME REQUESTED  @G38AP1U*/ 10849600
*           4 RTCTNOLC BIT(1),    /* 1=TYPE=NOLOCAL          @G860P31*/ 10882900
*           4 *        BIT(5),    /* RESERVED                @G38AP1U*/ 10916200
*         3 RTCTTYP2   BIT(8),    /* RESERVED                @G38FP31*/ 10949600
*        2 RTCTSDEX    BIT(16),   /* SDUMP EXIT FLAGS        @G386P12*/ 10999600
*         3 RTCTEX1    BIT(8),    /* EXIT FLAGS 1            @G386P12*/ 11049600
*           4 RTCTGRSQ BIT(1),    /* 1=GRSQ EXIT             @G386P12*/ 11099600
*           4 RTCTMSTR BIT(1),    /* 1=MASTER TRACE & GTF GLOBAL @LEC*/ 11116200
*                                 /* EXIT                        @LEA*/ 11132800
*           4 RTCTSMSX BIT(1),    /* 1=SMSX LOCAL EXIT           @LDA*/ 11149600
*           4 RTCTCPL  BIT(1),    /* 1=COUPLE EXIT               @LFC*/ 11166200
*           4 RTCTXES  BIT(1),   /* 1=XES LOCAL AND GLOBAL EXITS @LMC*/ 11174500
*           4 RTCTIOS  BIT(1),    /* 1=IOS GLOBAL EXIT           @LJA*/ 11182800
*           4 RTCTWLM  BIT(1),    /* 1=WLM EXIT                  @LNA*/ 11188400
*           4 RTCTRSM  BIT(1),    /* 1=RSM EXIT                  @LOA*/ 11194000
*         3 RTCTEX2    BIT(8),    /* EXIT FLAGS BYTE 2       @G38FP31*/ 11207900
*           4 RTCTSLIP BIT(1),    /* 1=SLIP EXIT                 @LPA*/ 11221800
*           4 RTCTOPEN BIT(1),    /* 1=OPEN EDITION EXIT         @LRA*/ 11228700
*           4 RTCTSVCD BIT(1),    /* 1=TAILORED SVC DUMP EXIT    @LRA*/ 11235600
*           4 *        BIT(5);    /* Reserved                    @LRC*/ 11242500
*  %RTCTD10L='LENGTH(RTCTSD10)'; /* LENGTH OF RTCTSD10       @G38FP31*/ 11249600
*      /* SYSMDUMP TYPE AND EXIT EFFECTIVE OPTIONS MAPPING   @G38FP31*/ 11299600
*  DCL 1 RTCTSM10 BIT(32) BASED(ADDR(RTCTSM1)), /* FLAGS     @G38FP31*/ 11349600
*       2 RTCTSMTY BIT(16),       /* TYPE OPTIONS            @G38FP31*/ 11399600
*       2 RTCTSMEX BIT(16),       /* EXIT OPTIONS            @G38FP31*/ 11449600
*        3 RTCTSMX1 BIT(8),       /* 1ST EXIT BYTE           @G38FP31*/ 11499600
*         4 RTCTMGRS BIT(1),      /* 1=GRSQ OPTION SPECIFIED @G38FP31*/ 11549600
*         4 *        BIT(7),      /* RESERVED                @G38FP31*/ 11599600
*        3 RTCTSMX2  BIT(8);      /* 2ND EXIT BYTE           @G38FP31*/ 11649600
*  %RTCTM10L='LENGTH(RTCTSM10)'; /* LENGTH OF RTCTSM10       @G38FP31*/ 11699600
