*%GOTO RT1WPLS1;  /*                                                    00060000
         MACRO                                                          00110000
         IHART1W  ,     */                                              00160000
*%RT1WPLS1: ;                                                           00210000
*/** START OF SPECIFICATIONS *****************************************  00260000
*                                                                       00310000
* PROPRIETARY STATEMENT:                                                00360000
*  5647-A01                                                    @P6C     00410000
*  THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                         00460000
*  (C) COPYRIGHT IBM CORP. 1988, 2000                                   00510000
*  LICENSED MATERIALS - PROPERTY OF IBM                                 00560000
*                                                                       00610000
* STATUS = HBB7703                                             @P6C     00660000
*                                                                       00710000
* EXTERNAL CLASSIFICATION: DMTI                                         00760000
* END OF EXTERNAL CLASSIFICATION:                                       00810000
*                                                                       00860000
* MACRO NAME:  IHART1W                                                  00910000
*                                                                       00960000
* DESCRIPTIVE NAME:  RTM1 Work Area                                     01010000
*                                                                       01060000
* DSECT NAME: RT1W, RT1TRACK, RT1TRECC, RTMW                            01110000
*                                                                       01160000
* COMPONENT: RECOVERY TERMINATION MANAGER (SCRTM)              @P6C     01210000
*                                                                       01260000
* EYE CATCHER: none                                                     01310000
*                                                                       01360000
* STORAGE ATTRIBUTES:                                                   01410000
*  SUBPOOL:  239 or in PSA                                              01460000
*  KEY:  0                                                              01510000
*  RESIDENCY:  ABOVE OR BELOW THE 16M LINE                              01560000
*                                                                       01610000
* SIZE:                                                                 01660000
*  152 bytes for RT1W                                                   01710000
*  288 bytes for RT1X                                                   01760000
*                                                                       01810000
* CREATED BY:                                                           01860000
*     IEAVNIP0 or IEEVCPU                                               01910000
*                                                                       01960000
* POINTED TO BY:                                                        02010000
*     FRRSRTMA field of the FRRS data area                              02060000
*                                                                       02110000
* SERIALIZATION:                                                        02160000
*     RTM1 INTERNAL SERIALIZATION                                       02210000
*                                                                       02260000
* FUNCTION:                                                             02310000
* The RT1W is used to describe the current error condition and to       02360000
* provide an internal work area for the RTM1 subfunctions.              02410000
*                                                                       02460000
* METHOD OF ACCESS:                                                     02510000
* ASM:                                                                  02560000
* THE IHART1W MAPPING MACRO MAPS THE RT1W, RT1TRACK            @L8C     02610000
* AND THE RT1TRECC DSECTS.                                     @L8C     02660000
* PL/AS:                                                                02710000
* THE IHART1W MAPPING MACRO MAPS SIX AREAS USED BY THE     @G382P2F     02760000
* VARIOUS COMPONENTS OF THE RTM. COMPILE TIME VARIABLES                 02810000
* HAVE BEEN ASSIGNED TO ALLOW SELECTIVE INCLUSION OF ANY                02860000
* OR ALL OF THE SIX AREAS. THE DEFAULT ACTION FOR EACH OF  @G382P2F     02910000
* THE VARIABLES IS TEXT INCLUSION. THE VARIABLES ARE:                   02960000
* RTM1WA, EEDS, ENPT, RTMB, RTMC , MODE, FRRSTACKMAP, and RTW  @L8A     03010000
* TO SUPPRESS INCLUSION OF ANY OF THE AREAS, SET THE COMPILE            03060000
* TIME VARIABLE TO THE CHARACTER STRING 'NO'.                           03110000
*                                                                       03160000
*                                                                       03210000
* MACMEAN    RT1W MEANS RTM1 WORKAREA                      @G381P2F     03260000
* MACCOMP    SCRTM                                             @P6C     03310000
*                                                                       03360000
* CHANGE ACTIVITY:                                                      03410000
* $L1= DAE    ,JBB2110,820604,PD2F: ADD SLIP A=NOSUP SUPPORT   @L1A     03460000
* $L2= RAPRAS ,JBB2110,820801,PDA8: EXPANDED THE SDWA          @L2A     03510000
* $L3= DAE    ,JBB2110,820801,PDA8: EXPANDED THE SDWA          @L3A     03560000
* $L4= RAPRAS ,JBB2110,820901,PD1C: SUPERVISOR ANALYSIS REFRESH         03610000
*                                   SUPPORT                    @L4A     03660000
* $L5= RTM2REC,JBB2125,821124,PDA8: REMOVE ERRORID EED         @L5A     03710000
* $L6= RTM1REC,JBB2125,821001,PDPY: RTM1 RECURSION             @L6A     03760000
* $L7= MEMREC ,JBB2125,821111,PDFO: MEMTERM WITH DAMAGED ASCB  @L7A     03810000
* $D1= DCR0027,JBB2125,830301,PDXB: SLIP ACTION=RECORD         @D1A     03860000
* $H1= VF     ,JBB2214,840202,PDA8: VECTOR FEATURE SUPPORT     @H1A     03910000
* $L8= RASENH ,JBB2220,840627,PDFO: FRR STACK RESTRUCTURE      @L8A     03960000
* $L9= RASENH ,JBB2220,840801,PDPY: NESTED FRR RETRY           @L9A     04010000
* $P1= PA20763,JBB2220,851206,PDPY: Save more FRR status       @P1A     04060000
* $LA= AR     ,HBB3310,850917,PDT9: Access Register Support    @LAA     04110000
* $LB= AR     ,HBB3310,850917,PDPY: Access Register Support    @LBA     04160000
* $LC= RTMRAS ,HBB3310,860901,PDFP: Recovery Event Tracing              04210000
* $D2= DCR0060,HBB3310,851013,PDT9: Support for SABEND         @D2A     04260000
* $D3= DCR0059,HBB3310,861029,PDU8: SUPPORT FOR DEFERRED CANCEL/        04310000
*                                   DETACH PROCESSING          @D3A     04360000
* $LD= RTMRAS ,HBB3310,861029,PDQ6: RTM1 Entry Mode Validation          04410000
* $LE= DATASPAC HBB3310 861029 PDFP: Propagation of data space          04460000
*                                   storage ranges for ABDUMP           04510000
* $P2= PC40520  HBB3310 861220 PDQ6: Modify use of RT1TBINV             04560000
* $P3= PC41224  HBB3310 870909 PDFP: Ignore SNAPX extensions when       04610000
*                                   not in primary                      04660000
* $LF= LOCKR    HBB4410 870916 PDT9: Lock Restructure                   04710000
* $D4= DCR1027  HBB4410 890726 PDEO: Increase FRR work area             04760000
* $P4= PEO2405  HBB4410 890816 PDEO: Increase RT1S FRR work area        04810000
* $P5= PEO2398  HBB4410 890916 PDCK: Add entry points in RTMBRTAB       04860000
* OY23049 - Add MEMSLIP LPN to be used as a recursion indicator         04910000
*           during MEMTERMs call to SLIP processing        @YA23049     04960000
* OY30219 - Fix Continuation problems in assembler portion of           05010000
*           macro.  Changed continuation to comments       @YA30219     05060000
* $LG= SUBSPRTM HBB5510 930329 PDKD: Increase SDWA size, removing       05093300
*                                    hard-coded constants for it  @LGA  05126600
* $01= OY65862  HBB4420 930927 PDKD: Add EEDEAS bit to allow RTM1       05137700
*                                    to pass SDWAEAS to RTM2      @01A  05148800
* $02= OW04284  HBB4410 940331 PDKD: Add MCHO to hardware EED     @02A  05154400
* $P6= PR20011  HBB6601 950908 PDKD: SC1CM compid split           @P6A  05157200
* $LH=64BITRTM  HBB7703 980223 PDKD: 64-bit regs and things             05158600
* $P7= PXD0195  HBB7703 991210 PDKD: RT1NOAB                            05159300
* $03= OW44619  HBB6601 000718 PDKD: Add flags to RT1I                  05159600
*                                                                       05160000
**** END OF SPECIFICATIONS *******************************************/ 05210000
*%GOTO RT1WPLS;  /*                                                     36245900
RT1W     DSECT ,     FRRSRTMA   MAPPING OF RT1W                    @L8C 36295600
RT1WTRTM DS    0CL104       PART OF RT1W USED FROM IEAVTRTM ON     @LHC 36345300
RT1WNPRS DS    0CL44        DATA NOT PRESERVED ON VALID            @L9C 36395000
*                           ANTICIPATED RECURSION              @G382P2F 36444700
RT1WLPTA DS    6F           TRACKING AREA FOR LOGICAL PHASE    @G382P2F 36494400
*                           RECOVERY PROCESSING (RT1TRACK)     @G382P2F 36544100
RT1WVARI DS    5F           VARIABLE FIELDS IN WA              @G382P2F 36593800
RT1WPRSV DS    0CL60        DATA TO BE PRESERVED ON VALID          @LHC 36643500
*                           ANTICIPATED RECURSION                       36693200
RT1WRTCA DS    A            POINTER TO THE SDWA CURRENTLY IN   @G382P2F 36742900
*                           USE (USED BY RTS)                  @G382P2F 36792600
RT1WEED  DS    A            POINTER TO EEDS ACQUIRED           @G382P2F 36842300
RT1WENTR DS    0CL4         ENTRY POINT DATA                   @G382P2F 36892000
RT1WMODE DS    CL1          SYSTEM MODE AT TIME OF ERROR (SEE  @G382P2F 36941700
*                           MODEBYTE AT THE END OF RT1W FOR A  @G382P2F 36991400
*                           DESCRIPTION OF THIS BYTE)          @G382P2F 37041100
RT1WSRMD DS    CL1          SYSTEM RECOVERY MODE               @G382P2F 37090800
RT1WCOVR DS    CL1          PRESERVED CARRY OVER INFORMATION   @G382P2F 37140500
*                           ON VALID RECURSIONS                @G382P2F 37190200
RT1WRCDR EQU  X'80'         RECURSION OCCURRED IN RECORD           @L9M 37239900
RT1WRTM  EQU   X'40'        IF ON, INDICATES RTM'S FRR WAS IN  @G382P2F 37289600
*                           CONTROL AT THE TIME OF THE ERROR   @G382P2F 37339300
RT1WFAIL EQU   X'20'        IF ON, RTM1 ISSUED A CMSET MACRO   @G382P2F 37389000
*                           WHICH EITHER ISSUED ABEND OR       @G382P2F 37438700
*                           RETURNED A NON ZERO RETURN CODE    @G382P2F 37488400
RT1WRMGR EQU  X'10'         IF ON, RTM1 IS PROCESSING THE FRR      @L9M 37538100
*                           STACK ON  BEHALF OF A                  @L9M 37587800
*                           CALLRTM TYPE=RMGRCML                   @L9M 37637500
RT1WEREX EQU   X'08'        USED IN EEDPROC TO INDICATE AN     @G382P2F 37687200
*                           ERRORID HAS BEEN PLACED IN AN EED. @G382P2F 37736900
*                           IT IS SET OFF BEFORE EXITING FROM  @G382P2F 37786600
*                           EEDPROC                            @G382P2F 37836300
RT1WGFAI EQU  X'04'         IF ON, RTS ATTEMPTED TO ACQUIRE AN     @L9C 37886000
*                           SDWA FROM SQA BUT THE GETMAIN      @G382P2F 37935700
*                           REQUEST WAS UNSUCCESSFUL           @G382P2F 37985400
RT1WRCRD EQU  X'01'         SET BY SLIP FOR ACTION=RECORD.         @L9M 38001900
*                           RTM1 MUST RECORD.                      @L9M 38018400
RT1WLPN  DS   CL1           INITIAL LOGICAL PHASE NUMBER ON    @G382P2F 38035100
*                           ENTRY TO RTM                       @G382P2F 38084800
RT1WASCB DS   A             ASCB ADDR OF CML ADDRESS SPACE     @G382P2F 38134500
RT1WENT2 DS   0CL4          ENTRY POINT DATA                   @G382P2F 38184200
RT1WCOV2 DS   CL1           PRESERVED CARRY OVER INFORMATION   @G382P2F 38233900
*                           ON VALID RECURSIONS                @G382P2F 38283600
RT1NODMP EQU   X'80'        SET BY SLIP TO INFORM DUMPING          @L9M 38333300
*                           PROGRAMS THAT DUMP REQUESTS SHOULD     @L9M 38383000
*                           BE IGNORED FOR THIS INVOCATION OF      @L9M 38432700
*                           RTM                                    @L9M 38482400
RT1WNOSP EQU  X'40'         SET BY SLIP TO INFORM DUPLICATE DUMP   @L9C 38532400
*                           SUPPRESSION THAT DUMP REQUESTS         @L1C 38681200
*                           SHOULD NOT BE SUPPRESSED FOR THIS      @L1C 38730900
*                           INVOCATION OF RTM                      @L1C 38780600
RT1WNOSV EQU  X'20'         SET BY SLIP TO INFORM DUMPING          @L9C 38830300
*                           PROGRAMS THAT SVCDUMP REQUESTS     @G860P2F 38880000
*                           SHOULD BE IGNORED FOR THIS         @G860P2F 38929700
*                           INVOCATION OF RTM                  @G860P2F 38979400
RT1WNOSA EQU  X'10'         SET BY SLIP TO INFORM DUMPING          @L9C 39029100
*                           PROGRAMS THAT SYSABEND DUMP        @G860P2F 39078800
*                           REQUESTS SHOULD BE IGNORED FOR     @G860P2F 39128500
*                           THIS INVOCATION OF RTM             @G860P2F 39178200
RT1WNOSM EQU  X'08'         SET BY SLIP TO INFORM DUMPING          @L9C 39227900
*                           PROGRAMS THAT SYSMDUMP REQUESTS    @G860P2F 39277600
*                           SHOULD BE IGNORED FOR THIS         @G860P2F 39327300
*                           INVOCATION OF RTM                  @G860P2F 39377000
RT1WNOSU EQU  X'04'         SET BY SLIP TO INFORM DUMPING          @L9C 39426700
*                           PROGRAMS THAT SYSUDUMP REQUESTS    @G860P2F 39476400
*                           SHOULD BE IGNORED FOR THIS         @G860P2F 39526100
*                           INVOCATION OF RTM                  @G860P2F 39575800
RT1WCOV3 DS   CL1           FLAGS                                  @D1A 39625500
RT1WSKIP EQU  X'80'         IF ON, AT LEAST ONE FRR IN THE         @L9M 39675200
*                           PERCOLATION PATH HAS BEEN SKIPPED      @L9M 39724900
RT1WSLST EQU   X'40'        IF ON, AT LEAST ONE FRR HAS            @L9M 39774600
*                           SUPPLIED DUMP RANGES TO RTS OR         @L9M 39824300
*                           DUMP RANGES WERE SUPPLIED BY THE       @L9M 39874000
*                           ISSUER OF ABEND                        @L9M 39923700
RT1WCPOB EQU   X'20'        IF ON, CPU LOCK OBTAINED BY RTM1 TO         39951300
*                           SERIALIZE FRR STACK                    @LFA 39978900
RT1WCOV4 DS   CL1           FLAGS                                  @L9A 40006500
RT1WRSTW EQU   X'80'        IF ON, RTM HAS ALREADY CLEARED THE     @L9M 40039600
*                           CVT RESTART WORD (CVTRSTWD)            @L9M 40072800
RT1WNCNL EQU   X'40'        COPY OF STCBNCNL - CANCEL/DETACH            40089300
*                           PROTECTION DURING RECOVERY ROUTINE     @D3A 40105800
RT1WCLUP EQU   X'20'        CLEANUP AND PERCOLATE INDICATION       @D2M 40114100
RT1WNOAB EQU   X'10'        Copy of STCBNOAB                       @P7A 40118300
RT1WRSV  DS   CL1           RESERVED                               @L9C 40122500
RT1WLKMB DS   XL4           MASK OF LOCKS HELD                 @G860P1S 40172200
RT1WLKFR DS   XL4           MASK OF LOCKS TO BE FREED          @G860P1S 40221900
RT1WCPUB DS   F             COUNT OF CPU LOCKS HELD            @G860P1S 40271600
RT1WCPUN DS   F             COUNT OF CPU LOCKS TO BE FREED     @G860P1S 40321300
RT1WCCRC DS   0CL8          STRUCTURE FOR NEXT 2 WORDS             @L2A 40371000
RT1WABCC DS   0CL4          SAVED COPY OF COMPCODE AND FLAGS       @L4A 40420700
RT1WCMPF DS   CL1           FLAG BITS IN COMPLETION CODE.          @L4C 40470400
RT1WREQ  EQU  X'80'         ON, SYSABEND/SYSMDUMP/SYSUDUMP DUMP TO BE   40520100
*                           GIVEN.  SET IF DUMP=YES REQUESTED ON ABEND, 40569800
*                           CALLRTM OR SETRP MACRO.                @L4A 40619500
RT1WSTEP EQU  X'40'         ON, JOBSTEP TO BE TERMINATED.               40669200
*                           SET IF STEP OPTION SPECIFIED                40718900
*                           ON ABEND MACRO.                        @L4A 40768600
RT1WRCF  EQU  X'04'         ON,REASON CODE SUPPLIED                @L4A 40818300
RT1WCPMC DS   CL3           SAVED COPY OF COMPCODE             @G860P1C 40868000
RT1WCRC  DS   CL4           SAVED COPY OF REASON CODE          @G860P1C 40917700
         DS   CL20          NOT RESERVED - SEE PLS             @G860P1C 40967400
RT1WLMB2 DS   CL4           MASK OF LOCKS HELD (SECOND WORD)       @LFA 40975600
RT1WLFR2 DS   CL4           MASK OF LOCKS TO BE FREED (SECOND WORD)     40983800
*                                                                  @LFA 40992000
         DS    A            RESERVED FOR FRR WA EXTENSION PTR      @LFA 41000200
RT1WTRT1 DS   0CL24         PART OF RT1W USED FROM IEAVTRT1 ON     @L9C 41022400
RT1WTRNE DS    A            Checkpointed PTR to 8-byte TEA         @LHA 41044600
RT1WPSW1 DS    A            CHECKPOINTED PTR TO PSW1               @L9M 41066800
RT1WPSW2 DS    A            CHECKPOINTED PTR TO PSW2               @L9M 41116500
RT1WXM   DS   0CL8          CROSS MEMORY INFORMATION AT TIME   @G382P2F 41166200
*                           OF ERROR                           @G382P2F 41215900
RT1WCR3  DS   0CL4          CONTROL REG 3 AT TIME OF ERROR     @G382P2F 41265600
RT1WKM   DS   CL2           KEY MASK                           @G382P2F 41315300
RT1WSAS  DS   CL2           SASID                              @G382P2F 41365000
RT1WCR4  DS   0CL4          CONTROL REG 4 AT TIME OF ERROR     @G382P2F 41414700
RT1WAX   DS   CL2           AUTHORIZATION INDEX                @G382P2F 41464400
RT1WPAS  DS   CL2           PASID                              @G382P2F 41514100
RT1WEAX  DS   A             EAX AT TIME OF ERROR                   @LBC 41539700
RT1WLLSR DS   A             LINKAGE STACK REGISTER VALUE LAST FRR  @LBC 41565300
RT1WLSED DS   A             LINKAGE STACK REGISTER VALUE AT ERROR  @LBA 41590900
RT1X     DS   0CL224                                               @LBA 41616800
RT1XBASE DS    A            Address of first byte of storage stack.     41620100
*                           Used to flush stack allocation when         41623400
*                           enabling or invoking an FRR            @LBA 41626700
         DS    CL4          Reserved                               @LBA 41630000
RT1XEREG DS    CL64         Error registers on entry. Retry registers   41633300
*                           on exit                                @LBA 41636600
RT1XPSWA DS    CL8          First error PSW on entry. Retry PSW on      41639900
*                           exit                                   @LBA 41643200
RT1XPSWB DS    CL8          Second error PSW on entry              @LBA 41646500
RT1XDOPT DS    A            Address Dump Options                   @LBA 41649800
RT1XARS  DS    CL64         Access Registers at time of error      @LBA 41653100
RT1XCRS  DS    CL64         Control Registers at time of error     @LBA 41656400
RT1XFMID DS    CL2          ASID of address space that                  41657500
*                           suffered a DAT error                   @LBA 41658600
RT1XTEAR DS    CL1          TEA access register number             @LBA 41659700
RT1XPOPT DS    CL1          SABEND processing options              @D2A 41709700
RT1XG64H DS    CL64         G64H at time of error                  @LHA 41759700
         DS    0D                                                       41809700
RT1XC64S DS    CL128        ESAME CRs at time of error             @LHA 41859700
RT1XTRNE DS    CL8          8-byte TEA                             @LHA 41909700
*     ****************************************************************  42160200
*     * THE RTM1 TRACKING AREA IS LOCATED IN ONE OF TWO PLACES       *  42209900
*     * DEPENDING ON THE TYPE OF RECOVERY APPROPRIATE FOR ANY SECTION*  42259600
*     * OF THE RTM1'S PROCESSING. WHEN ACTING AS A SECOND LEVEL      *  42309300
*     * INTERRUPT HANDLER, THE RTM1 DOES ITS TRACKING IN THE RTM1WA, *  42359000
*     * (THE TRACKING IS BROKEN UP INTO 2 PARTS, THE RECURSION       *  42408700
*     * CONTROL DATA MAPPED IN THE STACK (FRRSRTMW) AND THE TRACKING *  42458400
*     * AREA MAPPED IN THE RTM1WA.                                   *  42508100
*     * WHEN OPERATING IN A MODE THAT ALLOWS FRR PROTECTION, THE     *  42557800
*     * RTM1 DOES ITS TRACKING IN THE FRRPARMS FIELD ASSIGNED BY     *  42607500
*     * THE SETFRR MACRO. A COMMON MAPPING IS PROVIDED TO ALLOW FOR  *  42657200
*     * INDEPENDENCE IN THE MAINLINE RTM1 AND IN THE RECOVERY ROUTINE*  42706900
*     * WITH RESPECT TO THE TYPE OF RECOVERY SCHEME EMPLOYED.        *  42756600
*     ****************************************************************  42806300
RT1TRECC DSECT ,            RECURSION CONTROL DATA                 @L8C 42856000
         DS    0CL4         RECURSION CONTROL DATA                 @L8C 42905700
RT1TLPN  DS    CL1          LOGICAL PHASE NUMBER               @G382P2F 42955400
RT1TLPID DS    CL1          LOGICAL PHASE  REC RTN ID          @G382P2F 43005100
RT1TENPT DS    CL1          ORIGINAL ENTRY POINT               @G382P2F 43054800
RT1TACQR DS    CL1          RESOURCES ACQUIRED BY RTM1         @G382P2F 43104500
RT1TDISP EQU   X'80'        DISPATCHER LOCK ACQUIRED           @G382P2F 43154200
RT1TLLCK EQU   X'40'        LOCAL LOCK ACQUIRED BY RT1         @G382P2F 43203900
RT1TRETY EQU   X'20'        RT1 ATTEMPTED RETRY                @G382P2F 43253600
RT1TCINV EQU   X'10'        CABTERM ENTRY MODE INVALID             @LDA 43303600
RT1TSERP EQU   X'08'        IF ON, SERIALIZE SRB TO TASK       @G382P2F 43402700
*                           PERCOLATION (USED TO INDICATE      @G382P2F 43452400
*                           SDWASERP WAS SET)                  @G382P2F 43502100
RT1TTRTS EQU   X'04'        IF ON, IEAVTRTM HAS GONE TO IEAVTRTS        43551800
*                                                              @G382P1F 43601500
RT1TNSS  EQU   X'02'        IF ON, RT1 WAS ENTERED WITH THE PSANSS      43651200
*                           BIT ON                             @ZMB0189 43700900
RT1TBINV EQU   X'01'        BTERM ENTRY MODE INVALID OR CABTERM TCB=0   43717400
*                           AND CALLER ENABLED                     @P2C 43733900
RT1TRACK DSECT ,            COMMON TRACKING AREA MAPPING FOR       @L8C 43750600
*                           RTM1 RECOVERY                          @L8C 43800300
         DS    CL4          REMOVED RECURSION DATA, NOW MAPPED BY       43850000
*                           RT1TRECC                               @L8C 43899700
RT1TREGS DS    5F           CHECKPOINTED REGISTERS             @G382P2F 43949400
*     ***************************************************************   43999100
*     * LOGICAL PHASE NUMBERS USED WITH THE RT1TLPN FIELD.          *   44048800
*     * THESE NUMBERS ARE ASSIGNED TO THE VARIOUS UNIQUE PHASES     *   44098500
*     * OF THE RTM1 TO ASSIST IN RECOVERY ACTIONS PERFORMED BY      *   44148200
*     * THE RTM1S FRRS OR LOGICAL PHASE RECOVERY ROUTINES (LPRRS).  *   44197900
*     ***************************************************************   44247600
VALIDREC EQU   X'FF'        ANTICIPATED VALID RECURSION IN RTM @G382P2F 44297300
*                           MGR                                @G382P2F 44347000
FRRRECUR EQU   X'FE'        ANTICIPATED VALID RECURSION IN AN  @G382P2F 44396700
*                           FRR                                @G382P2F 44446400
RMGRCML  EQU   X'FD'        ANTICIPATED VALID RECURSION FOR    @G382P2F 44496100
*                           INITIAL ENTRY OF CALLRTM           @G382P2F 44545800
*                           TYPE=RMGRCML                       @G382P2F 44595500
RCRDREC  EQU   X'FC'        ANTICIPATED RECURSION FOR CALL TO           44645200
*                           RECORD                                 @D1A 44694900
RT1MGRLO EQU   X'00'        BEGINNING OF MANAGEMENT FUNCTIONS  @G382P2F 44744600
*                           RANGE OF LPNS                      @G382P2F 44794300
MGRINIT  EQU   X'01'        LPN FOR MGR INITIALIZE PHASE       @G382P2F 44844000
POSTRTS  EQU   X'02'        COMPLETION OF SYSTEM RECOVERY      @G382P2F 44893700
*                           PROCESSING LPN                     @G382P2F 44943400
NORTS    EQU   X'03'        NO SYSTEM RECOVERY PROCESSING LPN  @G382P2F 44993100
*                           LPN                                @G382P2F 45042800
CPURSTRT EQU   X'04'        ISSUE RESTART ON LOOPING CPU LPN   @G382P2F 45092500
NORSTRT  EQU   X'05'        UNSUCCESSFUL ISSUANCE OF RESTART   @G382P2F 45142200
*                           LPN                                @G382P2F 45191900
RT1MGRHI EQU   X'1D'        ENDING OF MANAGEMENT FUNCTIONS     @G382P2F 45241600
*                           RANGE OF LPNS                      @G382P2F 45291300
RT1MCHLO EQU   X'1E'        BEGINNING OF MACHCK FUNCTIONS      @G382P2F 45341000
*                           RANGE OF LPNS                      @G382P2F 45390700
RTHEEDS  EQU   X'20'        RTHS EED PHASE LPN                 @G382P2F 45440400
RTHTIMER EQU   X'21'        RTHS CLOCK REPAIR PHASE LPN        @G382P2F 45490100
RTHSTRG1 EQU   X'22'        RTHS STORAGE REPAIR PHASE 1 LPN    @G382P2F 45539800
RTHPARMS EQU   X'23'        RTHS RSR PARAMETER LIST PHASE LPN  @G382P2F 45589500
RTHSTRG2 EQU   X'24'        RTHS STORAGE REPAIR PHASE 2 LPN    @G382P2F 45639200
RTHRECRD EQU   X'25'        RTHS ERROR RECORDING PHASE LPN     @G382P2F 45688900
RTHSOFTW EQU   X'26'        RTHS SOFTWARE INFORMATION PHASE    @G382P2F 45738600
*                           LPN                                @G382P2F 45788300
RTHEXIT  EQU   X'27'        RTHS EXIT PHASE LPN                @G382P2F 45838000
RT1MCHHI EQU   X'3B'        ENDING OF MACHINE CHECK FUNCTIONS  @G382P2F 45887700
*                           RANGE OF LPNS                      @G382P2F 45937400
RT1SRMLO EQU   X'3C'        BEGINNING OF RTS FUNCTIONS RANGE   @G382P2F 45987100
*                           OF LPN                             @G382P2F 46036800
RT1SRMHI EQU   X'59'        ENDING OF RTS FUNCTIONS RANGE OF   @G382P2F 46086500
*                           LPN                                @G382P2F 46136200
RT1RESLO EQU   X'5A'        BEGINNING OF RESCHEDULE FUNCTIONS  @G382P2F 46185900
*                           RANGE OF LPNS                      @G382P2F 46235600
RESRTYLO EQU   X'5A'        BEGINNING OF RESCHEDULE LPNS FOR   @G382P2F 46285300
*                           WHICH RETRY IS POSSIBLE            @G382P2F 46335000
SRBEED   EQU   X'5A'        EED PROCESSING TO OBTAIN AN SRB    @G382P2F 46384700
*                           LPN                                @G382P2F 46434400
XMEEDS   EQU   X'5B'        EED PROCESSING FOR XMABTRM LPN     @G382P2F 46484100
RT2EEDS  EQU   X'5C'        EED PROCESSING FOR RTM2 RESCHEDULE @G382P2F 46533800
*                           LPN                                @G382P2F 46583500
RT1EEDS  EQU   X'5D'        EED PROCESSING FOR RTM1 RESCHEDULE @G382P2F 46633200
*                           LPN                                @G382P2F 46682900
RETRYRS1 EQU   X'5E'        MEMTERM WITH DAMAGED ASCB              @L7A 46732600
*                                                                       46782300
RESRTYHI EQU   X'5E'        END OF RESCHEDULE LPNS FOR WHICH       @L7C 46832000
*                           RETRY IS POSSIBLE RESCHEDULE           @L7C 46881700
RESCHED  EQU   X'5F'        FUNCTION LPN                           @L7C 46931400
FREESRB  EQU   X'60'        SRB PROCESSING PRIOR TO SCHEDULE   @G382P2F 46981100
*                           LPN                                @G382P2F 47030800
SRBCOMP  EQU   X'61'        SRB PROCESSING COMPLETE LPN        @G382P2F 47080500
RESRTM2  EQU   X'62'        RESCHEDULE RTM2 LPN                @G382P2F 47130200
TCBTERM  EQU   X'63'        LOGICAL TERMINATION OF TASK LPN    @G382P2F 47179900
RESRTM1  EQU   X'64'        RESCHEDULE RTM1 LPN                @G382P2F 47229600
MEMTERM  EQU   X'65'        ENQUEUE OF ASCB ON MEMTERM QUEUE   @G382P2F 47279300
MEMTCOMP EQU   X'66'        MEMTERM COMPLETION LPN             @G382P2F 47329000
RT1RESHI EQU   X'77'        ENDING OF RESCHEDULE FUNCTIONS     @G382P2F 47378700
*                           RANGES OF LPNS                     @G382P2F 47428400
RT1EXTLO EQU   X'78'        BEGINNING OF EXIT FUNCTIONS RANGE  @G382P2F 47478100
*                           OF LPNS                            @G382P2F 47527800
EEDFREE  EQU   X'78'        EED PROCESSING TO FREE UNNEEDED    @G382P2F 47577500
*                           EEDS LPNS                          @G382P2F 47627200
FREERTCA EQU   X'79'        FREEMAIN ACQUIRED SDWA LPN         @G382P2F 47676900
EEDFREE2 EQU   X'7A'        EED PROCESSING TO FREE UNNEEDED    @G382P2F 47726600
*                           EEDS LPN (FIRST CALL FROM          @G382P2F 47776300
*                           SRBTSKDQ)                          @G382P2F 47826000
EEDFREE3 EQU   X'7B'        EED PROCESSING TO FREE UNNEEDED    @G382P2F 47875700
*                           EEDS LPN (SECOND CALL FROM         @G382P2F 47925400
*                           SRBTSKDQ)                          @G382P2F 47975100
EEDFREE4 EQU   X'7C'        EED PROCESSING TO FREE UNNEEDED    @G382P2F 48024800
*                           EEDS LPN (THIRD CALL FROM          @G382P2F 48074500
*                           SRBTSKDQ)                          @G382P2F 48124200
MEMSLIP  EQU   X'80'        Used while MEMTERM is calling SLIP @YA23049 48149000
RT1EXTHI EQU   X'95'        ENDING OF EXIT FUNCTOPMS RANGE OF  @G382P2F 48173900
*                           LPNS                               @G382P2F 48223600
RT1WFWLN EQU   304          Size of FRR work area                  @LHA 48248400
RTMW     DSECT ,            CPU Work/Save area used by RTM         @L8A 48273300
RTMWTRTM DS    CL72         RTM register save area used by         @L8A 48323000
*                           IEAVTRTM. This area can be used             48372700
*                           only during SLIH mode processing       @L8A 48422400
RTMWTRT1 DS    CL72         DATERR processing register                  48472100
*                           save area. Used by IEAVTRT1            @L8A 48521800
RTMWRTMP DS    CL16         Parameter area used by RTM to               48571500
*                           pass error information to the               48621200
*                           Supervisor Analysis Router             @L8A 48670900
         GBLC  &IHART1WF_INCLUDE                                   @LHA 48680800
         AIF   ('&IHART1WF_INCLUDE' NE 'YES').NORT1WF              @LHA 48690700
         IHART1WF ,                                                @LHA 48700600
.NORT1WF ANOP                                                      @LHA 48710500
         MEND           */                                              48720600
*%RT1WPLS: ;                                                            48770300
*     %IF RTM1WA='NO'                                                   48820000
*       %THEN %GOTO RTMCDCL;                                            48869700
*     /***************************************************************/ 48919400
*     /*  THE RTM1WA IS USED BY THE RTM1 WHENEVER THE RTM1 IS        */ 48969100
*     /*  OPERATING IN SECOND LEVEL INTERRUPT HANDLER MODE.  THE     */ 49018800
*     /*  FIXED ASSIGMENTS SECTION OF THE WORK AREA IS USED FOR      */ 49068500
*     /*  RECOVERY.  THAT IS, SHOULD AN ERROR OCCUR DURING RTM1'S    */ 49118200
*     /*  PROCESSING, THIS PART OF THE RTM1WA WILL CONTAIN           */ 49167900
*     /*  SUFFICIENT DATA TO ALLOW THE RTM1S RECOVERY ROUTINES TO    */ 49217600
*     /*  RESUME NORMAL PROCESSING.  THE VARIABLE SECTION OF THE     */ 49267300
*     /*  WORK AREA IS SPACE AVAILABLE FOR DEFINITION BY THE         */ 49317000
*     /*  PRIVATE SUBFUNCTIONS OF THE RTM1 (I.E. IT IS MAPPED BY     */ 49366700
*     /*  THE VARIOUS SUBFUNCTIONS).                                 */ 49416400
*     /***************************************************************/ 49466100
*     DECLARE                                                           49515800
*        1 RT1W BASED(FRRSRTMA),       /*THE RTM1 WORK AREA      @L8C*/ 49565500
*          2 RT1WTRTM,                 /*PART OF RT1W USED FROM         49615200
*                                        IEAVTRTM ON         @G382P2F*/ 49664900
*           3 RT1WNPRS BDY(WORD),      /*DATA NOT PRESERVED ON VALID    49714600
*                                        ANTICIPATED RECURSION       */ 49764300
*              4 RT1WLPTA(6) FIXED(31),/*TRACKING AREA FOR LOGICAL      49814000
*                                        PHASE RECOVERY PROCESSING      49863700
*                                        MAPPED BY RT1TRACK BELOW    */ 49913400
*              4 RT1WVARI(5) PTR(31),  /*VARIABLE FIELDS IN WA       */ 49963100
*           3 RT1WPRSV BDY(WORD),      /*DATA TO BE PRESERVED ON        50012800
*                                        VALID ANTICIPATED RECURSION */ 50062500
*              4 RT1WRTCA PTR(31),     /*POINTR TO THE SDWA CURNTLY IN  50112200
*                                        USE (USED BY RTS)   @Z40FQXH*/ 50161900
*              4 RT1WEED PTR(31),      /*POINTER TO EEDS ACQUIRED    */ 50211600
*              4 RT1WENTR FIXED(31),   /*ENTRY POINT DATA            */ 50261300
*                 5 RT1WMODE BIT(8),   /*SYSTEM MODE AT TIME OF ERROR   50311000
*                                        (SEE MODEBYTE AT THE END OF    50360700
*                                        RT1W FOR A DESCRIPTION OF      50410400
*                                        THIS BYTE)                  */ 50460100
*                 5 RT1WSRMD BIT(8),   /*SYSTEM RECOVERY MODE        */ 50509800
*                 5 RT1WCOVR BIT(8),   /*PRESERVED CARRY OVER           50559500
*                                        INFORMATION ON VALID           50609200
*                                        RECURSIONS                  */ 50658900
*                   6 RT1WRCDR BIT(1), /* RECURSION OCCURRED IN         50708600
*                                         RECORD                 @L9M*/ 50758300
*                   6 RT1WRTM BIT(1),  /*IF ON, INDICATES RTM'S FRR     50808000
*                                        WAS IN CONTROL AT THE TIME     50857700
*                                        OF THE ERROR                */ 50907400
*                   6 RT1WFAIL BIT(1), /*IF ON, RTM1 ISSUED A CMSET     50957100
*                                        MACRO WHICH EITHER ISSUED      51006800
*                                        ABEND OR RETURNED A NON ZERO   51056500
*                                        RETURN CODE         @G382PPY*/ 51106200
*                   6 RT1WRMGR BIT(1), /* IF ON, RTM1 IS PROCESSING THE 51155900
*                                        FRR STACK ON  BEHALF OF A      51205600
*                                        CALLRTM TYPE=RMGRCML           51255300
*                                                                @L9M*/ 51305000
*                   6 RT1WEREX BIT(1), /*USED IN EEDPROC TO INDICATE    51354700
*                                        AN ERRORID HAS BEEN PLACED     51404400
*                                        IN AN EED. IT IS SET OFF       51454100
*                                        BEFORE EXITING FROM EEDPROC    51503800
*                                                            @G17EP5W*/ 51553500
*                   6 RT1WGFAI BIT(1), /*IF ON, RTS ATTEMPTED TO        51603200
*                                        ACQUIRE AN SDWA FROM SQA BUT   51652900
*                                        THE GETMAIN REQUEST WAS        51702600
*                                        UNSUCCESSFUL        @G382PPY*/ 51752300
*                   6 RT1WGLBL BIT(1), /*IF ON, GLOBAL FRRS ARE BEING   51802000
*                                        PROCESSED FOR A DAT ERROR ON   51851700
*                                        THE NORMAL STACK        @L9A*/ 51901400
*                   6 RT1WRCRD BIT(1), /* SET BY SLIP FOR ACTION=       51913800
*                                         RECORD. RTM1 MUST RECORD      51926200
*                                                                @D1A*/ 51938600
*                 5 RT1WLPN FIXED(8),  /*INITIAL LOGICAL PHASE NUMBER   51969700
*                                        ON ENTRY TO RTM     @ZA20321*/ 52000800
*              4 RT1WASCB PTR(31),     /*ASCB ADDR OF CML ADDRESS       52050500
*                                        SPACE               @G382P1F*/ 52100200
*              4 RT1WENT2 CHAR(4),     /*ENTRY POINT DATA    @G382P2F*/ 52149900
*                 5 RT1WCOV2 BIT(8),   /*PRESERVED CARRY OVER           52199600
*                                        INFORMATION ON VALID           52249300
*                                        RECURSIONS. THIS BYTE IS       52299000
*                                        CHECK POINTED FOR NESTED FRR   52348700
*                                        RETRY               @ZA20321*/ 52398400
*                   6 RT1NODMP BIT(1), /*SET BY SLIP TO INFORM DUMPING  52448100
*                                        PROGRAMS THAT DUMP REQUESTS    52497800
*                                        SHOULD BE IGNORED FOR THIS     52547500
*                                        INVOCATION OF RTM       @L9M*/ 52597200
*                   6 RT1WNOSP BIT(1), /*SET BY SLIP TO INFORM          52796000
*                                        DUPLICATE DUMP SUPPRESSION     52845700
*                                        THAT DUMP REQUESTS SHOULD      52895400
*                                        NOT BE SUPPRESSED FOR THIS     52945100
*                                        INVOCATION OF RTM       @L1C*/ 52994800
*                   6 RT1WNOSV BIT(1), /*SET BY SLIP TO INFORM DUMPING  53044500
*                                        PROGRAMS THAT SVCDUMP REQUESTS 53094200
*                                        SHOULD BE IGNORED FOR THIS     53143900
*                                        INVOCATION OF RTM   @G860P2F*/ 53193600
*                   6 RT1WNOSA BIT(1), /*SET BY SLIP TO INFORM DUMPING  53243300
*                                        PROGRAMS THAT SYSABEND DUMP    53293000
*                                        REQUESTS SHOULD BE IGNORED     53342700
*                                        FOR THIS INVOCATION OF RTM     53392400
*                                                            @G860P2F*/ 53442100
*                   6 RT1WNOSM BIT(1), /*SET BY SLIP TO INFORM DUMPING  53491800
*                                        PROGRAMS THAT SYSMDUMP         53541500
*                                        REQUESTS SHOULD BE IGNORED     53591200
*                                        FOR THIS INVOCATION OF RTM     53640900
*                                                            @G860P2F*/ 53690600
*                   6 RT1WNOSU BIT(1), /*SET BY SLIP TO INFORM DUMPING  53740300
*                                        PROGRAMS THAT SYSUDUMP         53790000
*                                        REQUESTS SHOULD BE IGNORED     53839700
*                                        FOR THIS INVOCATION OF RTM     53889400
*                                                            @G860P2F*/ 53939100
*                 5 RT1WCOV3 BIT(8),   /* FLAGS. THIS BYTE IS CHECK     53988800
*                                         POINTED FOR NESTED FRR RETRY  54038500
*                                                                @D1A*/ 54088200
*                   6 RT1WSKIP BIT(1), /*IF ON, AT LEAST ONE FRR IN     54137900
*                                        THE PERCOLATION PATH HAS BEEN  54187600
*                                        SKIPPED                 @L9M*/ 54237300
*                   6 RT1WSLST BIT(1), /*IF ON, AT LEAST ONE FRR HAS    54287000
*                                        SUPPLIED DUMP RANGES TO RTS    54336700
*                                        OR DUMP RANGES WERE SUPPLIED   54386400
*                                        BY THE ISSUER OF ABEND         54436100
*                                                                @L9M*/ 54485800
*                   6 RT1WCPOB BIT(1), /* IF ON, CPU LOCK OBTAINED BY   54512700
*                                         RTM1 TO SERIALIZE FRR STACK   54539600
*                                                                @LFA*/ 54566500
*                   6 RT1WASC BIT(2),  /* PSW ASC value at time of      54593400
*                                         error                  @LBA*/ 54601600
*                 5 RT1WCOV4 BIT(8),   /* FLAGS.                 @L9A*/ 54610000
*                   6 RT1WRSTW BIT(1), /*IF ON, RTS HAS ALREADY         54634900
*                                        CLEARED THE CVT RESTART WORD   54684600
*                                        (CVTRSTWD)              @L9M*/ 54734300
*                   6 RT1WNCNL BIT(1), /*COPY OF STCBNCNL - CANCEL/     54746700
*                                        DETACH PROTECTION DURING       54759100
*                                        RECOVERY ROUTINE        @D3A*/ 54771500
*                   6 RT1WCLUP BIT(1), /*CLEANUP AND PERCOLATE          54775600
*                                        INDICATION              @D2M*/ 54779700
*                   6 RT1WNOAB BIT(1), /* Copy of STCBNOAB       @P7A*/ 54781800
*                 5 RT1WRSV  CHAR(1),  /*RESERVED                @L9C*/ 54784000
*              4 RT1WLKMB BIT(32),     /*MASK OF LOCKS HELD  @G860P1S*/ 54833700
*              4 RT1WLKFR BIT(32),     /*MASK OF LOCKS TO BE FREED      54883400
*                                                            @G860P1S*/ 54933100
*                5 RT1WFCPU BIT(1),    /*CPU LOCK IS TO BE FREED        54982800
*                                                            @G860P1S*/ 55032500
*                5 * BIT(29),          /*                    @G860P1S*/ 55082200
*                5 RT1WFCMS BIT(1),    /*CMS LOCK IS TO BE FREED        55131900
*                                                            @G860P1S*/ 55181600
*                5 RT1WFLCL BIT(1),    /*LOCAL LOCK IS TO BE FREED      55231300
*                                                            @G860P1S*/ 55281000
*              4 RT1WCPUB FIXED(31),   /*COUNT OF CPU LOCKS HELD        55330700
*                                                            @G860P1S*/ 55380400
*              4 RT1WCPUN FIXED(31),   /*COUNT OF CPU LOCKS TO BE       55430100
*                                        FREED               @G860P1S*/ 55479800
*              4 RT1WCCRC,             /* STRUCTURE FOR NEXT 2 WORDS    55529500
*                                                                @L2A*/ 55579200
*                5 RT1WABCC CHAR(4),   /*SAVED VERSION OF COMPCODE      55628900
*                                        CODE AND FLAGS          @L4A*/ 55678600
*                  6 RT1WCMPF   CHAR(1), /*FLAG BITS IN COMPLETION      55728300
*                                        CODE.                   @L4C*/ 55778000
*                    7 RT1WREQ    BIT(1),/* ON,                         55827700
*                                          SYSABEND/SYSMDUMP/SYSUDUMP   55877400
*                                          DUMP TO BE GIVEN.            55927100
*                                          SET IF DUMP=YES REQUESTED    55976800
*                                          ON ABEND, CALLRTM, OR        56026500
*                                          SETRP MACRO.          @L4A*/ 56076200
*                    7 RT1WSTEP   BIT(1),/* ON, JOBSTEP TO BE           56125900
*                                          TERMINATED.SET IF            56175600
*                                          STEP OPTION SPECIFIED        56225300
*                                          ON ABEND MACRO.       @L4A*/ 56275000
*                    7 *          BIT(3), /*RESERVED             @L4A*/ 56324700
*                    7 RT1WRCF    BIT(1), /* ON, REASON CODE SUPPLIED   56374400
*                                                                @L4A*/ 56424100
*                    7 *          BIT(2), /* RESERVED            @L4A*/ 56473800
*                  6 RT1WCPMC CHAR(3),     /*SAVED VERSION OF COMPCODE  56523500
*                                                            @G860P1C*/ 56573200
*                5 RT1WCRC  CHAR(4),     /*SAVED VERSION OF REASON      56622900
*                                        CODE                @G860P1C*/ 56672600
*              4 RT1WGFRR PTR(31),     /* ADDRESS OF THE LAST FRR ROUTED56722300
*                                         TO BY RTM1             @L9A*/ 56772000
*              4 RT1WSINF CHAR(4),     /* SDWA INFORMATION       @L9A*/ 56821700
*                5 RT1WNGLB FIXED(8),  /* NUMBER OF GLOBAL SDWAS ON     56871400
*                                         RECURSION CHAIN        @L9A*/ 56921100
*                5 RT1WNSQA FIXED(8),  /* NUMBER OF SQA SDWAS ON        56970800
*                                         RECURSION CHAIN        @L9A*/ 57020500
*                5 RT1WRTYP FIXED(8),  /* TYPE OF SDWA POINTED TO BY    57070200
*                                         RT1WRTCA               @L9A*/ 57119900
*              4 RT1WOFRR PTR(31),     /* ADDRESS OF THE FIRST FRR FOR  57169600
*                                         THIS RECOVERY ENVIRONMENT     57219300
*                                                                @L9A*/ 57269000
*              4 RT1WRT1I PTR(31),     /* ADDRESS OF CHECK POINT        57318700
*                                         SDWA ELEMENT           @L9A*/ 57368400
*              4 RT1WRRPI FIXED(8),    /* INDICATOR OF RETRY/RESUME/    57418100
*                                         PERCOLATION            @L9A*/ 57467800
*              4 * CHAR(3),            /* RESERVED               @L9A*/ 57517500
*              4 RT1WLMB2 BIT(32),     /* MASK OF LOCKS HELD (SECOND    57523700
*                                         WORD)                  @LFA*/ 57529900
*              4 RT1WLFR2 BIT(32),     /* MASK OF LOCKS TO BE FREED     57536100
*                                         (SECOND WORD)          @LFA*/ 57542300
*              4 * PTR(31),            /* RESERVED FOR FRR WA EXTENSION 57548500
*                                         PTR                    @LFA*/ 57554700
*          2 RT1WTRT1,                 /*PART OF RT1W USED FROM         57567200
*                                        IEAVTRT1 ON         @G382P2F*/ 57616900
*           3 RT1WTRNE PTR(31),        /* Checkpointed address of       57633400
*                                         8-byte TEA             @LHA*/ 57650000
*           3 RT1WPSW1 PTR(31),        /*CHECKPOINTED PTR TO PSW1       57666600
*                                                                @L9M*/ 57716300
*           3 RT1WPSW2 PTR(31),        /*CHECKPOINTED PTR TO PSW2       57766000
*                                                                @L9M*/ 57815700
*           3 RT1WXM  CHAR(8),         /*CROSS MEMORY INFORMATION AT    57865400
*                                        TIME OF ERROR       @G382P2F*/ 57915100
*              4 RT1WCR3  CHAR(4),     /*CONTROL REGISTER 3 AT TIME     57964800
*                                        OF ERROR            @G382P2F*/ 58014500
*                 5 RT1WKM   CHAR(2),  /*KEY MASK            @G382P2F*/ 58064200
*                 5 RT1WSAS  CHAR(2),  /*SASID               @G382P2F*/ 58113900
*              4 RT1WCR4  CHAR(4),     /*CONTROL REGISTER 4 AT TIME     58163600
*                                        OF ERROR            @G382P2F*/ 58213300
*                 5 RT1WAX   CHAR(2),  /*AUTHORIZATION INDEX @G382P2F*/ 58263000
*                 5 RT1WPAS  CHAR(2),  /*PASID               @G382P2F*/ 58312700
*           3 RT1WEAX  PTR(31),        /* EAX at time of error    @LBC*/58362700
*           3 RT1WLLSR PTR(31),        /* The linkage stack register    58428600
*                                         value obtained from the last  58445100
*                                         FRR entry processed which     58461600
*                                         contained one          @LBA*/ 58478100
*           3 RT1WLSED PTR(31),        /* Linkage stack register value  58498800
*                                         at time of error       @LBC*/ 58519500
*          2 RT1WEND CHAR(0);          /* THE RT1W EXTENSION STARTS     58540200
*                                         HERE. THE EXTENSION DOES NOT  58561200
*                                         GET SAVED BY FRRSCOPY  @LBC*/ 58611200
*     /***************************************************************/ 59505500
*     /*  THE RTM1 TRACKING AREA IS LOCATED IN ONE OF TWO PLACES     */ 59555200
*     /*  DEPENDING ON THE TYPE OF RECOVERY APPROPRIATE FOR ANY      */ 59604900
*     /*  SECTION OF THE RTM1'S PROCESSING. WHEN ACTING AS A         */ 59654600
*     /*  SECOND LEVEL INTERRUPT HANDLER, THE RTM1 DOES ITS          */ 59704300
*     /*  TRACKING IN THE RTM1WA.  (THE TRACKING IS BROKEN UP        */ 59754000
*     /*  INTO 2 PARTS, THE RECURSION CONTROL DATA MAPPED IN THE     */ 59803700
*     /*  STACK (FRRSRTMW) AND THE TRACKING AREA MAPPED IN THE       */ 59853400
*     /*  RTM1WA.  WHEN OPERATING IN A MODE THAT ALLOWS FRR          */ 59903100
*     /*  PROTECTION, THE RTM1 DOES ITS TRACKING IN THE FRRPARMS     */ 59952800
*     /*  FIELD ASSIGNED BY THE SETFRR MACRO. A COMMON MAPPING IS    */ 60002500
*     /*  PROVIDED TO ALLOW FOR INDEPENDENCE IN THE MAINLINE RTM1    */ 60052200
*     /*  AND IN THE RECOVERY ROUTINE WITH RESPECT TO THE TYPE OF    */ 60101900
*     /*  RECOVERY SCHEME EMPLOYED.                                  */ 60151600
*     /***************************************************************/ 60201300
*     DECLARE                                                           60251000
*        1 RT1TRECC FIXED(31) BASED(ADDR(RT1TRACK)), /* RECURSION       60300700
*                                        CONTROL DATA            @L8C*/ 60350400
*           2 RT1TLPN FIXED(8),        /*LOGICAL PHASE NUMBER        */ 60400100
*           2 RT1TLPID FIXED(8),       /*LOGICAL PHASE  REC RTN ID   */ 60449800
*           2 RT1TENPT CHAR(1),        /*ORIGINAL ENTRY POINT        */ 60499500
*           2 RT1TACQR BIT(8),         /*RESOURCES ACQUIRED BY RTM1  */ 60549200
*              3 RT1TDISP BIT(1),      /*DISPATCHER LOCK ACQUIRED    */ 60598900
*              3 RT1TLLCK BIT(1),      /*LOCAL LOCK ACQUIRED BY RT1  */ 60648600
*              3 RT1TRETY BIT(1),      /*RT1 ATTEMPTED RETRY         */ 60698300
*              3 RT1TCINV BIT(1),   /*CABTERM entry mode invalid @LDA*/ 60748300
*              3 RT1TSERP BIT(1),      /*IF ON, SERIALIZE SRB TO TASK   60847400
*                                        PERCOLATION (USED TO INDICATE  60897100
*                                        SDWASERP WAS SET)   @G382P2F*/ 60946800
*              3 RT1TTRTS BIT(1),      /*IF ON, IEAVTRTM HAS GONE TO    60996500
*                                        IEAVTRTS            @G382P1F*/ 61046200
*              3 RT1TNSS BIT(1),       /*IF ON, RT1 WAS ENTERED WITH    61095900
*                                        PSANSS BIT ON       @ZMB0189*/ 61145600
*              3 RT1TBINV BIT(1);    /*BTERM entry mode invalid or      61162100
*                                   CABTERM TCB=0 while enabled  @P2C*/ 61178600
*     /***************************************************************/ 61195300
*     /* CONSTANTS USED WITH THE RT1WRRPI FIELD                      */ 61245000
*     /***************************************************************/ 61294700
*     DCL                                                               61344400
*       RT1WPERC CONSTANT(0),          /* Percolate to next FRR  @L9A*/ 61394100
*       RT1WSRTY CONSTANT(1),          /* Super FRR retry        @L9A*/ 61443800
*       RT1WNRTY CONSTANT(2),          /* Normal FRR retry       @L9A*/ 61493500
*       RT1WRSUM CONSTANT(3),          /* Resume from restart    @L9A*/ 61543200
*       RT1WQUIT CONSTANT(4);          /* Terminate RTM1 FRR            61592900
*                                         processing             @L9A*/ 61642600
*     /***************************************************************/ 61692300
*     /* CONSTANTS USED WITH THE RT1WRTYP FIELD                      */ 61742000
*     /***************************************************************/ 61791700
*     DCL                                                               61841400
*       RT1WCSQA CONSTANT(1),          /* RT1WRTCA POINTS TO A          61891100
*                                         SQA (GETMAINED) SDWA   @L9A*/ 61940800
*       RT1WCGLB CONSTANT(2);          /* RT1WRTCA POINTS TO A          61990500
*                                         GLOBAL (CPU) SDWA      @L9A*/ 62040200
*                                                                       62089900
*     DECLARE                                                           62139600
*        1 RT1TRACK BASED,             /*COMMON TRACKING AREA MAPPING   62189300
*                                        FOR RTM1 RECOVERY       @L8C*/ 62239000
*           2 * FIXED(31),             /*REMOVED RECURSION DATA,        62288700
*                                        NOW MAPPED BY RT1TRECC  @L8C*/ 62338400
*           2 RT1TREGS(5) PTR(31),     /*CHECKPOINTED REGISTERS      */ 62388100
*     /***************************************************************/ 62437800
*     /* LOGICAL PHASE NUMBERS USED WITH THE RT1TLPN FIELD.          */ 62487500
*     /* THESE NUMBERS ARE ASSIGNED TO THE VARIOUS UNIQUE PHASES     */ 62537200
*     /* OF THE RTM1 TO ASSIST IN RECOVERY ACTIONS PERFORMED BY      */ 62586900
*     /* THE RTM1S FRRS OR LOGICAL PHASE RECOVERY ROUTINES (LPRRS).  */ 62636600
*     /***************************************************************/ 62686300
*        VALIDREC FIXED(8) CONSTANT(255),/*ANTICIPATED VALID RECURSION  62736000
*                                        IN RTM MGR          @ZA20321*/ 62785700
*        FRRRECUR FIXED(8) CONSTANT(254),/*ANTICIPATED VALID RECURSION  62835400
*                                        IN AN FRR           @ZA20321*/ 62885100
*        RMGRCML FIXED(8) CONSTANT(253), /*ANTICIPATED VALID RECURSION  62934800
*                                        FOR INITIAL ENTRY OF           62984500
*                                        CALLRTM TYPE=RMGRCML           63034200
*                                                            @G382PPY*/ 63083900
*        RCRDREC  FIXED(8) CONSTANT(252), /* ANTICIPATED RECURSION      63133600
*                                        FOR CALL TO RECORD      @D1A*/ 63183300
*        RT1MGRLO FIXED(8) CONSTANT(0), /*BEGINNING OF MANAGEMENT FUNC- 63233000
*                                        TIONS RANGE OF LPNS         */ 63282700
*        MGRINIT FIXED(8) CONSTANT(1), /*LPN FOR MGR INITIALIZE PHASE*/ 63332400
*        POSTRTS FIXED(8) CONSTANT(2), /*COMPLETION OF SYSTEM RECOVERY  63382100
*                                        PROCESSING LPN              */ 63431800
*        NORTS FIXED(8) CONSTANT(3),   /*NO SYSTEM RECOVERY PROCESSING  63481500
*                                        LPN                         */ 63531200
*        CPURSTRT FIXED(8) CONSTANT(4), /*ISSUE RESTART ON LOOPING CPU  63580900
*                                        LPN                         */ 63630600
*        NORSTRT FIXED(8) CONSTANT(5), /*UNSUCCESSFUL ISSUANCE OF       63680300
*                                        RESTART LPN                 */ 63730000
*        RT1MGRHI FIXED(8) CONSTANT(29), /*ENDING OF MANAGEMENT FUNC-   63779700
*                                        TIONS RANGE OF LPNS         */ 63829400
*        RT1MCHLO FIXED(8) CONSTANT(30), /*BEGINNING OF MACHCK FUNC-    63879100
*                                        TIONS RANGE OF LPNS         */ 63928800
*        RTHEEDS  FIXED(8) CONSTANT(32), /*RTHS EED PHASE LPN        */ 63968500
*        RTHTIMER FIXED(8) CONSTANT(33), /*                             64008200
*                                        RTHS CLOCK REPAIR PHASE LPN */ 64047900
*        RTHSTRG1 FIXED(8) CONSTANT(34), /*RTHS STORAGE REPAIR PHASE 1  64087600
*                                        LPN                         */ 64127600
*        RTHPARMS FIXED(8) CONSTANT(35), /*RTHS RSR PARAMETER LIST      64177300
*                                        PHASE LPN                   */ 64227000
*        RTHSTRG2 FIXED(8) CONSTANT(36), /*RTHS STORAGE REPAIR PHASE 2  64276700
*                                        LPN                         */ 64326400
*        RTHRECRD FIXED(8) CONSTANT(37), /*RTHS ERROR RECORDING PHASE   64376100
*                                        LPN                         */ 64425800
*        RTHSOFTW FIXED(8) CONSTANT(38), /*RTHS SOFTWARE INFORMATION    64475500
*                                        PHASE LPN                   */ 64525200
*        RTHEXIT  FIXED(8) CONSTANT(39), /*RTHS EXIT PHASE LPN       */ 64574900
*        RT1MCHHI FIXED(8) CONSTANT(59), /*ENDING OF MACHINE CHECK FUNC-64624600
*                                        TIONS RANGE OF LPNS         */ 64674300
*        RT1SRMLO FIXED(8) CONSTANT(60), /*BEGINNING OF RTS FUNCTIONS   64724000
*                                        RANGE OF LPNS       @Z40FQXH*/ 64773700
*        RT1SRMHI FIXED(8) CONSTANT(89), /*ENDING OF RTS FUNCTIONS      64823400
*                                        RANGE OF LPNS       @Z40FQXH*/ 64873100
*        RT1RESLO FIXED(8) CONSTANT(90), /*BEGINNING OF RESCHEDULE FUNC-64922800
*                                        TIONS RANGE OF LPNS         */ 64972500
*        RESRTYLO FIXED(8) CONSTANT(90), /*BEGINNING OF RESCHEDULE LPNS 65022200
*                                        FOR WHICH RETRY IS POSSIBLE */ 65071900
*        SRBEED FIXED(8) CONSTANT(90), /*EED PROCESSING TO OBTAIN AN    65121600
*                                        SRB LPN                     */ 65171300
*        XMEEDS FIXED(8) CONSTANT(91), /*EED PROCESSING FOR XMABTRM     65221000
*                                        LPN                         */ 65270700
*        RT2EEDS FIXED(8) CONSTANT(92), /*EED PROCESSING FOR RTM2       65320400
*                                        RESCHEDULE LPN              */ 65370100
*        RT1EEDS FIXED(8) CONSTANT(93), /*EED PROCESSING FOR RTM1       65419800
*                                        RESCHEDULE LPN              */ 65469500
         RETRYRS1 FIXED(8) CONSTANT(94), /* MEMTERM PROCESSING WITH     65519200
                                          DAMAGED ASCB           @L7A*/ 65568900
*        RESRTYHI FIXED(8) CONSTANT(94), /*END OF RESCHEDULE LPNS FOR   65618600
*                                        WHICH RETRY IS POSSIBLE @L7C*/ 65668300
*        RESCHED FIXED(8) CONSTANT(95), /*RESCHEDULE FUNCTION LPN @L7C*/65718000
*        FREESRB FIXED(8) CONSTANT(96), /*SRB PROCESSING PRIOR TO       65767700
*                                        SCHEDULE LPN                */ 65817400
*        SRBCOMP FIXED(8) CONSTANT(97), /*SRB PROCESSING COMPLETE LPN */65867100
*        RESRTM2 FIXED(8) CONSTANT(98), /*RESCHEDULE RTM2 LPN        */ 65916800
*        TCBTERM FIXED(8) CONSTANT(99), /*LOGICAL TERMINATION OF TASK   65966500
*                                        LPN                         */ 66016200
*        RESRTM1 FIXED(8) CONSTANT(100), /*RESCHEDULE RTM1 LPN       */ 66065900
*        MEMTERM FIXED(8) CONSTANT(101), /*ENQUEUE OF ASCB ON MEMTERM   66115600
*                                        QUEUE LPN                   */ 66165300
*        MEMTCOMP FIXED(8) CONSTANT(102), /*MEMTERM COMPLETION LPN   */ 66215000
*        RT1RESHI FIXED(8) CONSTANT(119),/*ENDING OF RESCHEDULE FUNC-   66264700
*                                        TIONS RANGE OF LPNS         */ 66314400
*        RT1EXTLO FIXED(8) CONSTANT(120),/*BEGINNING OF EXIT FUNC-      66364100
*                                        TIONS RANGE OF LPNS         */ 66413800
*        EEDFREE FIXED(8) CONSTANT(120), /*EED PROCESSING TO FREE       66463500
*                                        UNNEEDED EEDS LPN           */ 66513200
*        FREERTCA FIXED(8) CONSTANT(121), /*FREEMAIN ACQUIRED SDWA LPN  66562900
*                                                            @Z40FQXH*/ 66612600
*        EEDFREE2 FIXED(8) CONSTANT(122), /*EED PROCESSING TO FREE      66662300
*                                        UNNEEDED EEDS LPN (FIRST CALL  66712000
*                                        FROM SRBTSKDQ)      @G382P2F*/ 66761700
*        EEDFREE3 FIXED(8) CONSTANT(123), /*EED PROCESSING TO FREE      66811400
*                                        UNNEEDED EEDS LPN (SECOND CALL 66861100
*                                        FROM SRBTSKDQ)      @G382P2F*/ 66910800
*        EEDFREE4 FIXED(8) CONSTANT(124), /*EED PROCESSING TO FREE      66960500
*                                        UNNEEDED EEDS LPN (THIRD CALL  67010200
*                                        FROM SRBTSKDQ)      @G382P2F*/ 67059900
*        EEDFREE5 FIXED(8) CONSTANT(125), /*EED PROCESSING TO FREE      67109600
*                                        UNNEEDED EEDS LPN. Called from 67159300
*                                        FRR retry/resume path   @L9A*/ 67209000
*        MEMSLIP FIXED(8) CONSTANT(128), /* Used while MEMTERM is       67225500
                                          calling SLIP      @YA23049*/  67242000
*        RT1EXTHI FIXED(8) CONSTANT(149),/*ENDING OF EXIT FUNC-         67275200
*                                        TIONS RANGE OF LPNS     @L6C*/ 67308400
*        RT1RTF1 FIXED(8) CONSTANT(190),/*LPN FOR IEAVTRTF PROCESSING   67358100
*                                                                @L6A*/ 67407800
*        RT1ABR1 FIXED(8) CONSTANT(191);/*LPN FOR IEAVTRTR ABORT        67457500
*                                       PROCESSING               @L6A*/ 67507200
    /*****************************************************************/ 67508600
    /*                                                               */ 67510000
    /* This area is used by several of the FRR processing modules to */ 67511400
    /* record information pertinent to the entry state of an FRR     */ 67512800
    /*                                                               */ 67514200
    /*****************************************************************/ 67515600
    DECLARE                                                             67517000
      1    *      CHAR(20) BDY(WORD) BASED(ADDR(RT1TREGS(1))),/* @LBA*/ 67518400
       2    *        CHAR(1),       /* Reserved                  @LBA*/ 67519800
       2    RTSCFLGS BIT(8),        /*                           @LBA*/ 67521200
        3    RTSASC   BIT(2),       /* Value of ASC used to give FRR    67522600
                                       control                   @LBA*/ 67524000
       2    RTSOPASD CHAR(2),       /* Value of PASID at time of        67525400
                                       error prior to first FRR,        67526800
                                       PASID of previous FRR            67528200
                                       thereafter.               @LBA*/ 67529600
       2    RTSCRGS,                /* Value of cross memory control    67531000
                                       registers used to give FRR       67532400
                                       control                   @LBA*/ 67533800
        3    RTSCR3   CHAR(4),      /* Control register 3        @LBA*/ 67535200
          5    RTSKM    CHAR(2),    /* Key mask                  @LBA*/ 67536600
          5    RTSSCND  CHAR(2),    /* ASID of secondary address        67538000
                                       space                     @LBA*/ 67539400
        3    RTSCR4   CHAR(4),      /* Control register 4        @LBA*/ 67540800
          5    RTSAX    CHAR(2),    /* Authorization index       @LBA*/ 67542200
          5    RTSPRIM  CHAR(2),    /* ASID of primary address space    67543600
                                                                 @LBA*/ 67545000
       2    RTSEAX   PTR(31),       /* Value of the EAX control         67546400
                                       register on entry to an FRR      67547800
                                       (CR8)                     @LBA*/ 67549200
       2    RTSLSED  PTR(31);       /* Value of the LSED control        67550600
                                       register on entry to an FRR      67552000
                                       (CR15)                    @LBA*/ 67553400
*%RTMCDCL:;                                                             67556900
*     %IHART1WF_RTMC = '';                                              67573400
*     %IHART1WF_FSTK = '';                                              67589900
*     %IF FRRSTACKMAP='ONLY'                                            67606600
*        %THEN %GOTO STKDCLONLY;                                        67656300
*     %IF RTMC='NO'                                                     67706000
*       %THEN %GOTO ERTMCDCL;                                           67755700
*%DEACTIVATE RTMC;                                                      67805400
*     %IF SYSVERSION = ''                                               67855400
*       %THEN %GOTO ERTMCDCL;                                           67905400
* %IHART1WF_RTMC = 'YES';                                               67955400
* %RT1S = 'YES';                     /*                          @LHA*/ 68005400
*%ERTMCDCL:;                                                            69047900
*%DEACTIVATE RTMC;                                                      69097600
*%RT1SDCL:;                                                             69147300
      %IF RT1S~='YES'                                                   69197000
        %THEN %GOTO ERT1SDCL;                                           69246700
      %DEACTIVATE RT1S;                                                 69296400
                                                                        69346100
  /*******************************************************************/ 69395800
  /*                                                                 */ 69445500
  /*  The following structure maps the storage containing an SDWA    */ 69495200
  /*  and its related parts, the RT1WFWLN byte FRR work area and     */ 69544900
  /*  the 72 byte RT1I. The first part of the structure is common    */ 69594600
  /*  to all SDWAs, regardless of type. The second part of the       */ 69644300
  /*  structure maps SQA SDWAs and the golobal SDWA for the normal   */ 69694000
  /*  stack.                                                         */ 69743700
  /*                                                                 */ 69793400
  /*******************************************************************/ 69843100
  DECLARE                                                               69892800
    1 RT1S CHAR(LENGTH(RT1I)+RT1WFWLN+SDWATLN1)                         69930000
           BASED BDY(WORD),         /* Map of SDWA and related storage  69967200
                                                                 @LHC*/ 70004500
      3 RT1SGLBL,                   /* The following storage is defined 70041900
                                       for global SDWAs          @L9A*/ 70091600
        5 RT1SRT1I CHAR(72),        /* Storage for an RT1I       @L9A*/ 70141300
        5 RT1SFRRW CHAR(RT1WFWLN), /* Storage for a RT1WFWLN byte FRR   70191000
                                       work area                 @P4C*/ 70240700
        5 RT1SSDWA CHAR(LENGTH(SDWA)), /* Main part of SDWA      @L7A*/ 70290400
        5 RT1SRC1 CHAR(LENGTH(SDWARC1)), /* Recordable                  70340100
                                       extension 1               @L7A*/ 70389800
        5 RT1SRC2 CHAR(LENGTH(SDWARC2)), /* Recordable extension 2      70439500
                                                                 @L7A*/ 70489200
        5 RT1SRC3 CHAR(LENGTH(SDWARC3)), /* Recordable extension 3      70538900
                                                                 @L7A*/ 70588600
        5 RT1SRC4 CHAR(LENGTH(SDWARC4)), /* Recordable extension 4      70613400
                                                                 @LHA*/ 70638200
        5 RT1SPTRS CHAR(LENGTH(SDWAPTRS)), /* Pointers section @L7A*/   70663000
      3 RT1SNSQA,                   /* The following storage is present 70688000
                                       only for SQA SDWAs and the       70737700
                                       global SDWA associated with the  70787400
                                       normal stack              @L9A*/ 70837100
        5 RT1SNRC1 CHAR(LENGTH(SDWANRC1)), /* Non-recordable extension 170886800
                                                                 @L7A*/ 70936500
        5 RT1SNRC2 CHAR(LENGTH(SDWANRC2)), /* Non-recordable extension 270986200
                                                                 @L7A*/ 71035900
        5 RT1SNRC3 CHAR(LENGTH(SDWANRC3)); /* Non-recordable extension 371052400
                                                                 @LEA*/ 71068900
 %ERT1SDCL:;                                                            71085600
      %DEACTIVATE RT1S;                                                 71135300
*%RT1XDCL:;                                                             71185000
*     %IF RTX='NO'                                                      71234700
*       %THEN %GOTO ERT1XDCL;                                           71284400
*     %IF RTM1WA='NO'                                                   71334100
*       %THEN %GOTO ERT1XDCL;                                           71383800
*                                                                       71433500
* /*******************************************************************/ 71483200
* /*  THE FOLLOWING MAPS THE PART OF THE RTM1 WORK AREA THAT         */ 71532900
* /*  DOES NOT HAVE TO BE PRESERVED ON AN INTERRUPT. THAT IS,        */ 71582600
* /*  THE FRRSCOPY MACRO DOES NOT HAVE TO COPY THIS EXTENSION.       */ 71632300
* /*******************************************************************/ 71682000
* DCL 1 RT1X BASED(ADDR(RT1WEND)),  /*                           @L9A*/ 71731700
*       3 RT1XBASE PTR(31),         /* Address of first byte of storage 71781400
*                                      stack.  Used to flush stack      71831100
*                                      allocation when enabling or      71880800
*                                      invoking an FRR           @L9A*/ 71930500
*                                                                       71980200
*       3 * CHAR(4),                /* Reserved                  @L9A*/ 72029900
*       3 RT1XERRI,                 /* Error information on entry.      72079600
*                                      Retry information on exit @L9A*/ 72129300
*         5 RT1XEREG CHAR(64),      /* Error registers on entry. Retry  72179000
*                                      registers on exit         @L9A*/ 72228700
*         5 RT1XPSWA CHAR(8),       /* First error PSW on entry. Retry  72278400
*                                      PSW on exit               @L9A*/ 72328100
*         5 RT1XPSWB CHAR(8),       /* Second error PSW on entry @L9A*/ 72377800
*           7 RT1XXM CHAR(8),       /* Cross memory registers on        72427500
*                                      RETRY exit.               @L9A*/ 72477200
*         5 RT1XDOPT PTR(31),       /* Address Dump Options      @LBC*/ 72488200
*         5 RT1XARS CHAR(64),       /* Access Registers at time of      72499200
*                                      error                     @LBA*/ 72510200
*         5 RT1XCRS CHAR(64),       /* Control Registers at time of     72521200
*                                      error                     @LBA*/ 72532200
*         5 RT1XFMID CHAR(2),       /* ASID of address space that       72535800
*                                      suffered a DAT error      @LBA*/ 72539400
*         5 RT1XTEAR CHAR(1),       /* TEA access register number       72543200
*                                                                @LBA*/ 72554200
*         5 RT1XPOPT CHAR(1),       /* SABEND processing options @D2A*/ 72557900
*           7 RT1XNRTY BIT(1),      /* ON,Error is non-retryable @D2A*/ 72561600
*           7 RT1XFCPU BIT(1),      /* ON, Free CPU lock         @D2A*/ 72565300
*           7 RT1XFLCL BIT(1),      /* ON, Free LOCAL lock       @D2A*/ 72569000
*           7 * BIT(5),             /* Reserved                  @D2A*/ 72570000
*         5 RT1XG64H CHAR(64),      /* G64H at time of error     @LHA*/ 72571000
*         5 RT1XC64S CHAR(128) BDY(DWORD), /* ESAME CRs at time of      72572000
*                                      error                     @LHA*/ 72573000
*         5 RT1XTRNE CHAR(8) BDY(DWORD); /* 8-byte TEA at time of       72574000
*                                      error                     @LHA*/ 72575300
*                                                                       72576600
*%ERT1XDCL:;                                                            72626300
*     %IF RTI='YES'                                                     72663500
*       %THEN %GOTO RT1IDCL;                                            72700700
*     %IF RT1S ~= 'YES'                                                 72737900
*       %THEN %GOTO ERT1IDCL;                                           72775400
*%RT1IDCL:;                                                             72825100
* /*******************************************************************/ 72874800
* /*                                                                 */ 72924500
* /*  THE FOLLOWING STRUCTURE IS USED TO PRESERVE RTM1 WORK AREA     */ 72974200
* /*  INFORMATION DURING RECURSION PROCESSING IN RTM1. THIS          */ 73023900
* /*  STRUCTURE IS POINTED TO BY RT1WRT1I OR RT1IRT1I.               */ 73073600
* /*                                                                 */ 73123300
* /*******************************************************************/ 73173000
* DCL 1 RT1I CHAR(72) BDY(WORD) BASED, /*                        @L9A*/ 73222700
        3 RT1IRT1I PTR(31),         /* ADDRESS OF PREVIOUS RTM 1 WORK   73272400
                                       AREA INFORMATION          @L9A*/ 73322100
        3 RT1ISDWA PTR(31),         /* ADDRESS OF THE SDWA CONTAINING   73371800
                                       INFORMATION ABOUT THE ERROR      73421500
                                       REPRESENTED BY THIS RT1W IMAGE   73471200
                                                                 @L9A*/ 73520900
        3 RT1IOFRR PTR(31),         /* STACK ADDRESS OF THE FRR GIVEN   73570600
                                       CONTROL BY RTM AND SUFFERING     73620300
                                       THE RECURSIVE ERROR THAT CAUSED  73670000
                                       THIS RT1W IMAGE TO BE CREATED.   73719700
                                       THIS IS THE ORIGINAL FRR FOR THIS73769400
                                       RECOVERY ENVIRONMENT      @L9A*/ 73819100
        3 RT1IRTYP FIXED(8),        /* TYPE OF SDWA POINTED TO BY       73868800
                                       RT1ISDWA                  @L9A*/ 73918500
        3 RT1ICOV2 BIT(8),          /* USED TO PRESERVE THE INFORMATION 73968200
                                       IN RT1WCOV2               @L9A*/ 74017900
          5 * BIT(1),               /* Spacer                    @L9A*/ 74067600
          5 RT1IRCRD BIT(1),        /* SET BY SLIP FOR ACTION=          74117300
                                       RECORD. RTM1 MUST RECORD  @L9A*/ 74167000
        3 RT1ICOV3 BIT(8),          /* USED TO PRESERVE THE INFORMATION 74216700
                                       IN RT1WCOV3               @L9A*/ 74266400
        3 RT1IENPT CHAR(1),         /* USED TO PRESERVE THE ERROR       74316100
                                       REASON IN RT1TENPT        @L9A*/ 74365800
        3 RT1ICCRC CHAR(8),         /* USED TO CHECKPOINT COMPLETION    74415500
                                       CODE AND REASON CODE FROM        74465200
                                       RT1WCCRC                  @L9A*/ 74514900
        3 RT1IXM CHAR(8),           /* USED TO CHECKPOINT CROSS MEMORY  74564600
                                       INFORMATION FROM RT1WXM   @L9A*/ 74614300
        3 RT1ICRGS CHAR(8),         /* Used to checkpoint the control   74621400
                                       register 3 and 4 values used to  74628500
                                       give the FRR control.     @P1A*/ 74635600
        3 RT1IFLGS CHAR(1),         /* Used to checkpoint the PSW ASC   74642700
                                       used to give the FRR control.    74649800
                                                                 @LBC*/ 74650800
        3 RT1IFLG2 BIT(8),          /* Misc flags for RTM1       @03A*/ 74651890
          5 RT1ISYSE BIT(1),        /* Indicates that RT1IELSE          74651980
                                       contains the processor null      74652070
                                       linkage stack             @03A*/ 74652160
          5 RT1ISYSF BIT(1),        /* Indicates that RT1IFLSE          74652250
                                       contains the processor null      74652340
                                       linkage stack             @03A*/ 74652430
        3 *        CHAR(2),         /* Reserved                  @03C*/ 74652520
        3 RT1IELSE PTR(31),         /* Contents of linkage stack        74652800
                                       control register (15) at time    74653800
                                       of error                  @LBA*/ 74654800
        3 RT1IEEAX PTR(31),         /* Contents of EAX control register 74655800
                                       (8) at time of error      @LBA*/ 74656800
        3 RT1IFLSE PTR(31),         /* Contents of linkage stack        74657800
                                       control register (15) at set     74658800
                                       of FRR                    @LBA*/ 74659800
        3 RT1IFEAX PTR(31);         /* Contents of EAX control register 74660800
                                       (8) at entry to FRR       @LBA*/ 74661800
*%ERT1IDCL:;                                                            74664000
 %RTWDCL:;                                                              74713700
*     %IF RTW~='YES'                                                    74763400
*       %THEN %GOTO ERTWDCL;                                            74813100
*                                                                       74862800
 /*                                                                     74912500
     The following structure maps the RTM work save area located above  74962200
     the 16M line that is used as a work area by SLIH mode functions    75011900
     and is pointed to by WSACRTMW                                      75061600
 */                                                                     75111300
    DECLARE                                                             75161000
      1 RTMW BASED(WSACRTMW),       /* CPU Work/Save area used by RTM*/ 75210700
       3 RTMWTRTM CHAR(72),         /* RTM register save area used by   75260400
                                       IEAVTRTM. This area can be used  75310100
                                       only during SLIH mode processing 75359800
                                                                 @L8A*/ 75409500
       3 RTMWTRT1 CHAR(72),         /* DATERR processing register       75459200
                                       save area. Used by IEAVTRT1      75508900
                                                                 @L8A*/ 75558600
       3 RTMWRTMP CHAR(16),         /* Parameter area used by RTM to    75608300
                                       pass error information to the    75658000
                                       Supervisor Analysis Router@L8A*/ 75707700
       3 RTMWDSAA,                  /* RTM1 Dynamic Storage Allocation  75757400
                                       Area (only used by R1N)   @L9A*/ 75807100
         5 RTMWDSNA PTR(31),        /* Address of the next available    75856800
                                       dynamic area              @L9A*/ 75906500
         5 RTMWDSLB PTR(31),        /* Address of the byte past the     75956200
                                       end of the dynamic storage       76005900
                                                                 @L9A*/ 76055600
         5 RTMWDSTR CHAR(3104);     /* Dynamic area storage. This       76105300
                                       area must be large enough for    76155000
                                       RTM to process concurrently on   76204700
                                       more than one stack at a time.   76254400
                                       The deepest module path          76304100
                                       through RTM1 must be             76353800
                                       considered in defining the       76403500
                                       size of this area. This area is  76453200
                                       currently large enough for 4     76502900
                                       trips through RTM at the deepest 76552600
                                       point on the stack.       @L9A*/ 76602300
*%ERTWDCL:;                                                             76652000
*%ENPTDCL:;                                                             76701700
*     %IF ENPT='NO'                                                     76751400
*       %THEN %GOTO RTMBDCL;                                            76801100
*     /***************************************************************/ 76850800
*     /* THE FOLLOWING CONSTANTS ARE USED WITH THE RT1TENPT FIELD,   */ 76900500
*     /* THE EEDERTYP FIELD, THE TCBERTYP FIELD, RTM1'S FUNCTION     */ 76950200
*     /* REGISTER, AND THE RTITLPID FIELD.                           */ 76999900
*     /***************************************************************/ 77049600
*     DECLARE                                                           77099300
*        SLIHLOW  FIXED(8) CONSTANT(1), /*BEGIN RANGE OF SLIH MODE EP */77139800
*        RT1WPCFL FIXED(8) CONSTANT(1), /*PCFLIH ENTRY PT            */ 77180300
*        RT1WREST FIXED(8) CONSTANT(2), /*RESTART ENTRY PT           */ 77220800
*        RT1WSVC  FIXED(8) CONSTANT(3), /*SVCFLIH ENTRY PT           */ 77261300
*        RT1WDAT  FIXED(8) CONSTANT(4), /*DATERR ENTRY PT            */ 77301800
*        RT1WMCHR FIXED(8) CONSTANT(5), /*MACHINE CHECK REENTRY      */ 77342300
*        RT1WSTM2 FIXED(8) CONSTANT(6), /*STERM REENTRY      @G381P2F*/ 77382800
*        RT1WSABD FIXED(8) CONSTANT(7), /*SABEND ENTRY PT        @D2A*/ 77423300
*        SLIHHI   FIXED(8) CONSTANT(9), /*END  RANGE OF SLIH MODE EP */ 77463800
*        SRVCLOW  FIXED(8) CONSTANT(10), /*                             77504300
*                                        BEGIN RANGE OF SRVCE RTN EP */ 77544800
*        MODELOW  FIXED(8) CONSTANT(10), /*BEGIN RANGE OF RESCH MODE */ 77585300
*        RT1WSTM1 FIXED(8) CONSTANT(10), /*STERM ENTRY PT    @G381P2F*/ 77625800
*        RT1WABT1 FIXED(8) CONSTANT(11), /*ABTERM ENTRY PT           */ 77666300
*        RT1WABT2 FIXED(8) CONSTANT(12), /*CVTBTRM ENTRY PT          */ 77706800
*        RT1WABT3 FIXED(8) CONSTANT(13), /*XMABTRM ENTRY PT          */ 77747300
*        ABTRMCUR FIXED(8) CONSTANT(14), /*ABTERM THE CURRENT TCB    */ 77787800
*        MODEHI   FIXED(8) CONSTANT(14), /*END RANGE OF RESCHD MODE  */ 77828300
*        RT1WMEMT FIXED(8) CONSTANT(15), /*MEMTERM ENTRY PT          */ 77868800
*        RT1WXMAB FIXED(8) CONSTANT(16), /*CROSS MEMORY ABTERM EP    */ 77909300
*        RSCHDCPU FIXED(8) CONSTANT(17), /*                             77949800
*                                        RESCHEDULE RTM1 ON OTHER CPU*/ 77990300
*        SRVCHI   FIXED(8) CONSTANT(19), /*END RANGE OF SRVCE RTN EP */ 78030800
*        RT1WMACH FIXED(8) CONSTANT(20), /*MACHCK ENTRY PT           */ 78071300
*        TAKEEXIT FIXED(8) CONSTANT(30), /*FORCE PREMATURE EXIT      */ 78111800
*        RT1RETRY FIXED(8) CONSTANT(32), /*                             78152300
*                                        A RETRY EXIT IS TO BE TAKEN */ 78192800
*        RT1MCHEX FIXED(8) CONSTANT(33), /*A MCH EXIT IS TO BE TAKEN */ 78233300
*        RT1RESUM FIXED(8) CONSTANT(34), /*RESTART RESUME TO BE TAKEN */78273800
*        RT1DISP  FIXED(8) CONSTANT(35), /*                             78314300
*                                        DISPATCHER EXIT TO BE TAKEN */ 78354800
*        RT1SRBEX FIXED(8) CONSTANT(36), /*AN SRB EXIT IS TO BE TAKEN */78395300
*        RT1EXPRO FIXED(8) CONSTANT(37), /*                             78435800
*                                        EXIT PROLOG EXIT TO BE TAKEN*/ 78476300
*        RT1RET   FIXED(8) CONSTANT(38), /*                             78516800
*                                        RETURN TO CALLER TO BE TAKEN*/ 78557300
*        RECOVRY1 FIXED(8) CONSTANT(1); /*LPID TO INDICATE SIMPLEST     78597800
*                                        LEVEL OF RECOVERY           */ 78640000
*%RTMBDCL:;                                                             78689700
*     %IF RTMB='NO'                                                     78739400
*       %THEN %GOTO MODEDCL;                                            78789100
*     /***************************************************************/ 78838800
*     /* THE RTM BRANCH TABLE RESIDES IN MODULE IEAVTRT1 AND IS USED */ 78888500
*     /* BY THE CALLRTM MACRO TO CALCULATE THE CORRECT ENTRY POINT   */ 78938200
*     /* INTO THE RTM1 BASED ON USER SUPPLIED PARAMETERS TO THE      */ 78987900
*     /* MACRO. THIS MAPPING IS PROVIDED TO ALLOW NIP TO BUILD A     */ 79037600
*     /* DUMMY BRANCH TABLE TO INTERCEPT ALL CALLRTM REQUESTS DURING */ 79087300
*     /* NIP PROCESSING.                                             */ 79137000
*     /***************************************************************/ 79186700
*     DECLARE                                                           79236400
*      1 RTMBRTAB BDY(WORD) BASED(CVTBTERM),/*RTM BRANCH TABLE       */ 79286100
*        2 RTMBTERM CHAR(8) BDY(WORD), /*INITIAL ENTRY POINT INSTRUC-   79335800
*                                        TIONS FOR CVTBTERM BRANCH   */ 79385500
*          3 RTMBBALR CHAR(2),         /* BALR 15,0 INSTRUCTION      */ 79435200
*          3 RTMBBRAN CHAR(4),         /* BRANCH INSTRUCTION         */ 79484900
*          3 RTMBPAD2 CHAR(2),         /*2 BYTES OF PADDING          */ 79534600
*        2 RTMBDAT  PTR(31),           /*ENTRY IF TYPE = DATERR      */ 79584300
*        2 RTMBREST PTR(31),           /*ENTRY IF TYPE = RESTART     */ 79634000
*        2 RTMBMACH PTR(31),           /*ENTRY IF TYPE = MACHCK      */ 79683700
*        2 RTMBSVC  PTR(31),           /*ENTRY IF TYPE = SVCERR      */ 79733400
*        2 RTMBSTRM PTR(31),           /*ENTRY IF TYPE = STERM          79783100
*                                                            @G381P2F*/ 79832800
*        2 RTMBCABT PTR(31),           /*ENTRY IF TYPE = ABTERM AND     79882500
*                                        NO ASID WAS PROVIDED        */ 79932200
*        2 RTMBMEMT PTR(31),           /*ENTRY IF TYPE = MEMTERM     */ 79981900
*        2 RTMBPROG PTR(31),           /*ENTRY IF TYPE = PROGCK      */ 80031600
*        2 RTMBACR  PTR(31),           /*ENTRY IF TYPE = ACR         */ 80081300
*        2 RTMBXABT PTR(31),           /*ENTRY IF TYPE = ABTERM AND     80131000
*                                        AN ASID WAS PROVIDED        */ 80180700
*        2 RTMBRMGR PTR(31),           /*ENTRY IF TYPE = RMGRCML        80230400
*                                                            @G381P2F*/ 80280100
*        2 RTMBITER PTR(31),           /*ENTRY TYPE = ITERM             80285600
*                                                                @P5A*/ 80291100
*        2 RTMBSABE PTR(31),           /*ENTRY TYPE = SABEND            80296600
*                                                                @P5A*/ 80302100
*        2 RTMBABN  PTR(31),           /*ENTRY TYPE= ABTERM RETRY=NO    80307600
*                                                                @P5A*/ 80313100
*        2 RTMBXABN PTR(31);           /*ENTRY TYPE=XMABTERM RETRY=NO   80318600
*                                                                @P5A*/ 80324100
*%MODEDCL:;                                                             80329800
*     %IF MODE='NO'                                                     80379500
*       %THEN %GOTO EEDSDCL;                                            80429200
*     /***************************************************************/ 80478900
*     /* THE FOLLOWING STRUCTURE DEFINES A ONE BYTE FIELD WHICH IS   */ 80528600
*     /* USED TO MAP THE CONTENTS OF THE FOLLOWING FIELDS: RT1WMODE  */ 80578300
*     /* AND EEDERMOD.                                               */ 80628000
*     /***************************************************************/ 80677700
*     DECLARE                                                           80727400
*       1 MODEBYTE FIXED(8) BASED,     /*SYSTEM MODE AT ERROR TIME   */ 80777100
*         2 MODESUPR BIT(1),           /*SUPERVISOR CONTROL MODE     */ 80826800
*         2 MODEDIS BIT(1),            /*PHYSICALLY DISABLED MODE    */ 80876500
*         2 MODEGSPN BIT(1),           /*GLOBAL SPIN LOCK MODE       */ 80926200
*         2 MODEGSUS BIT(1),           /*GLOBAL SUSPEND LOCK MODE    */ 80975900
*         2 MODELOC BIT(1),            /*LOCALLY LOCKED MODE         */ 81025600
*         2 MODETYP1 BIT(1),           /*TYPE 1 SVC MODE             */ 81075300
*         2 MODESRB BIT(1),            /*SRB MODE                    */ 81125000
*         2 MODETCB BIT(1);            /*TASK MODE                   */ 81174700
*%EEDSDCL:;                                                             81224400
*     %IF EEDS='NO'                                                     81274100
*       %THEN %GOTO EEEDSDCL;                                 /* @LCC*/ 81323800
*     /***************************************************************/ 81373500
*     /* EXTENDED ERROR DESCRIPTORS (EEDS) ARE USED TO PASS DATA     */ 81423200
*     /* CONCERNING AN ERROR TO THE VARIOUS COMPONENTS OF THE RTM.   */ 81472900
*     /* EEDS ARE ALLOCATED VIA GETCELL FROM THE RT1 QUICKCELL POOL. */ 81522600
*     /* THE FORMAT OF THE EEDS IS GOVERNED BY THE TYPE OF DATA IT   */ 81572300
*     /* CONTAINS. THERE IS AN EED TYPE FOR REGISTERS, PSW,          */ 81622000
*     /* AND CROSS MEMORY INFORMATION,                       @G381P2F*/ 81671700
*     /* FOR DUMP OPTIONS, FOR MACHINE CHECK REPAIR INFORMATION,     */ 81721400
*     /* AND FOR ORIGINAL ERROR DATA AND ERRORID.                @L5A*/ 81771100
*     /* EACH EED HAS A COMMON HEADER THAT CONTAINS A FORWARD CHAIN  */ 81820800
*     /* POINTER, AN INDICATION OF THE TYPE OF  EED, AND INFORMATION */ 81870500
*     /* CONCERNING THE CHAIN OF EEDS.                               */ 81920200
*     /***************************************************************/ 81969900
*     DECLARE                                                           82019600
*       1 EED BDY(DWORD) BASED, /*Extended error descriptor             82069600
*                                                                @LHC*/ 82119600
*         2 EEDFWRDP PTR(31),          /*Pointer to next EED on chain   82219600
*                                        or zero                     */ 82269600
*         2 EEDDES  CHAR(4) BDY(WORD), /*Description of EED contents */ 82319600
*           3 EEDID   CHAR(1),         /*Type of information in EED  */ 82369600
*           3 EEDFLAGS CHAR(1),        /*Flags describing information   82419600
*                                        in EEDs             @G17EP5W*/ 82469600
*            4 EEDERFL  BIT(1),        /*On means that the errorid      82519600
*                                      is supplied in this EED   @L5C*/ 82569600
*            4 EEDSPI   BIT(1),        /*On means this EED is part      82619600
*                                      of an SPI control block (not     82669600
*                                      from the EED pool)    @G33NPHE*/ 82719600
*            4 EEDSRBTP BIT(1),        /*On means this EED was created  82769600
*                                      for SRB-to-TASK percolation      82819600
*                                      processing            @G388PPY*/ 82869600
*            4 EEDHWDP BIT(1),        /*On means this EED contains      82886200
*                                      hardware data information @LBA*/ 82902800
*            4 EEDSKIP  BIT(1),        /* Skip this EED.  This flag is  82911100
*                                      set only for DUMPXTYP type EEDs. 82919400
*                                      The data space storage ranges    82927700
*                                      were not accessable, and thus    82936000
*                                      the EED is empty and should be   82944300
*                                      skipped.                  @P3C*/ 82952600
*            4 *        BIT(3),        /*Reserved                @P3C*/ 82960900
*           3 EEDFLAG2 CHAR(1),        /*Flags to pass from RTM1 to     82969600
*                                      RTM2 indicators set by SLIP      83019600
*                                                                @L1C*/ 83162700
*            4 EEDNOSUP BIT(1),        /*Used to communicate the        83212700
*                                      SLIP request to dump             83262700
*                                      suppression not to suppress      83312700
*                                      dumps                     @L1C*/ 83362700
*            4 EEDNODMP BIT(1),        /*Used to communicate dump       83412700
*                                      suppression by SLIP from RTM1    83462700
*                                      to RTM2                   @L1C*/ 83512700
*            4 EEDRCRD  BIT(1),        /*Used to communicate SLIP       83562700
*                                       indication of recording from    83612700
*                                       RTM1 to RTM2             @D1A*/ 83662700
*            4 *        BIT(1),        /*Reserved                @D1C*/ 83712700
*            4 EEDNOSVD BIT(1),        /*Used to communicate dump       83762700
*                                      suppression of SVCDUMPs by SLIP  83812700
*                                      from RTM1 to RTM2         @L1C*/ 83862700
*            4 EEDNOSYA BIT(1),        /*Used to communicate dump       83912700
*                                      suppression of SYSABEND dumps    83962700
*                                      by SLIP from RTM1 to RTM2 @L1C*/ 84012700
*            4 EEDNOSYM BIT(1),        /*Used to communicate dump       84062700
*                                      suppression of SYSMDUMPS         84112700
*                                      by SLIP from RTM1 to RTM2 @L1C*/ 84162700
*            4 EEDNOSYU BIT(1),        /*Used to communicate dump       84212700
*                                      suppression of SYSUDUMPs         84262700
*                                      by SLIP from RTM1 to RTM2 @L1C*/ 84312700
*           3 *       CHAR(1),         /*Reserved                @L1C*/ 84362700
*         2 EEDERROR CHAR(4) BDY(WORD),/*Description of the error       84412700
*                                        which necessitated EEDs     */ 84462700
*           3 EEDMODE  FIXED(8),       /*System mode at time of error*/ 84512700
*           3 EEDERTYP  CHAR(1),       /*Entry point used by RTM1    */ 84562700
*           3 EEDASID FIXED(15),       /*ASID of originating memory     84612700
*                                        in cross memory abends      */ 84662700
*         2 EEDVARBL CHAR(596) BDY(WORD),/*Variable part of EED, mapped 84712700
*                                        separately below        @LHC*/ 84762700
*       /*************************************************************/ 85001600
*       /* CONSTANTS USED WITH THE EEDID AND TCBRTM12 FIELDS         */ 85051300
*       /*************************************************************/ 85101000
*       EEDNULL PTR(31) CONSTANT(1),   /*THE TCBRTM12 FIELD IS SET TO   85150700
*                                        THIS VALUE IF AN EED COULD     85200400
*                                        NOT BE OBTAINED             */ 85250100
*       ERRORTYP FIXED(8) CONSTANT(1), /*INDICATES THE EEDVARBL FIELD   85266600
*                                        IS MAPPED BY EEDREGSP   @LBC*/ 85283100
*       REGSPTYP FIXED(8) CONSTANT(1), /*INDICATES THE EEDVARBL FIELD   85316300
*                                        IS MAPPED BY EEDREGSP       */ 85349500
*       DUMPOTYP FIXED(8) CONSTANT(2), /*INDICATES THE EEDVARBL FIELD   85399200
*                                        IS MAPPED BY EEDDUMPO       */ 85448900
*       DUMPXTYP FIXED(8) CONSTANT(3), /*INDICATES THE EEDVARBL FIELD   85465500
*                                        IS MAPPED BY EEDDUMPX   @LEA*/ 85482100
*       HWREPTYP FIXED(8) CONSTANT(1), /*INDICATES THE EEDVARBL FIELD   85515500
*                                        IS MAPPED BY EEDREGSP   @LBC*/ 85548900
*       SDWATYP FIXED(8) CONSTANT(1),  /*INDICATES THE EEDVARBL FIELD   85598900
*                                        IS MAPPED BY EEDREGSP   @LBC*/ 85648900
*       ORIGDTYP FIXED(8) CONSTANT(1), /*INDICATES THE EEDVARBL FIELD   85698900
*                                        IS MAPPED BY EEDREGSP   @LBC*/ 85748900
*       /*************************************************************/ 86095000
*       /*                                                           */ 86144700
*       /*       CONSTANT USED TO DEFINE SIZE OF STANDARD EED AREA   */ 86194400
*       /*                                                           */ 86244100
*       /*************************************************************/ 86293800
*       EEDBASE  FIXED(15) CONSTANT(12),/*DEFINES LENGTH OF THE FIXED   86343500
*                                         PORTION OF THE EED @G17EP5W*/ 86393200
*       /*************************************************************/ 86442900
*       /*                                                           */ 86492600
*       /*   REGSPTYP EED--                                          */ 86542600
*       /*            THIS EED CONTAINS REGISTERS, PSW, AND CROSS    */ 86592600
*       /*            MEMORY INFORMATION AT THE TIME OF ERROR        */ 86642600
*       /*            ORIGINAL ERROR DATA, AND IF EEDERFL IS ON, IT  */ 86692600
*       /*            CONTAINS AN ERRORID AND AN EXIT ROUTINE        */ 86742600
*       /*            COMMUNICATION BUFFER.                          */ 86792600
*       /*                                                           */ 88629700
*       /*************************************************************/ 88630100
*       1 EEDREGSP DEF(EEDVARBL) CHAR(596) BDY(WORD), /*                88630500
*                                        This is the basic RTM1 to RTM2 88630900
*                                        information EED which contains 88631300
*                                        general purpose registers,     88631700
*                                        access registers, control      88632100
*                                        registers PSW, error id and    88632500
*                                        various other error related    88632900
*                                        information             @LHC*/ 88633300
*         2 EEDREGS CHAR(64) BDY(WORD),/*General purpose Registers at   88633700
*                                        time of error               */ 88634100
*           3 EEDREG0  PTR(31),        /*Register 0                  */ 88634500
*           3 EEDREG1  PTR(31),        /*Register 1                  */ 88634900
*           3 EEDREG2  PTR(31),        /*Register 2                  */ 88635300
*           3 EEDREG3  PTR(31),        /*Register 3                  */ 88635700
*           3 EEDREG4  PTR(31),        /*Register 4                  */ 88636100
*           3 EEDREG5  PTR(31),        /*Register 5                  */ 88636500
*           3 EEDREG6  PTR(31),        /*Register 6                  */ 88636900
*           3 EEDREG7  PTR(31),        /*Register 7                  */ 88637300
*           3 EEDREG8  PTR(31),        /*Register 8                  */ 88637700
*           3 EEDREG9  PTR(31),        /*Register 9                  */ 88638100
*           3 EEDREG10 PTR(31),        /*Register 10                 */ 88638500
*           3 EEDREG11 PTR(31),        /*Register 11                 */ 88638900
*           3 EEDREG12 PTR(31),        /*Register 12                 */ 88639300
*           3 EEDREG13 PTR(31),        /*Register 13                 */ 88639700
*           3 EEDREG14 PTR(31),        /*Register 14                 */ 88640100
*           3 EEDREG15 PTR(31),        /*Register 15                 */ 88640500
*         2 EEDAREGS CHAR(64) BDY(WORD),/*Access registers at time of   88640900
*                                        error                   @LBA*/ 88641300
*           3 EEDARE0 PTR(31),         /*Access Register 0       @LBA*/ 88641700
*           3 EEDARE1 PTR(31),         /*Access Register 1       @LBA*/ 88642100
*           3 EEDARE2 PTR(31),         /*Access Register 2       @LBA*/ 88642500
*           3 EEDARE3 PTR(31),         /*Access Register 3       @LBA*/ 88642900
*           3 EEDARE4 PTR(31),         /*Access Register 4       @LBA*/ 88643300
*           3 EEDARE5 PTR(31),         /*Access Register 5       @LBA*/ 88643700
*           3 EEDARE6 PTR(31),         /*Access Register 6       @LBA*/ 88644100
*           3 EEDARE7 PTR(31),         /*Access Register 7       @LBA*/ 88644500
*           3 EEDARE8 PTR(31),         /*Access Register 8       @LBA*/ 88644900
*           3 EEDARE9 PTR(31),         /*Access Register 9       @LBA*/ 88645300
*           3 EEDAREA PTR(31),         /*Access Register 10      @LBA*/ 88645700
*           3 EEDAREB PTR(31),         /*Access Register 11      @LBA*/ 88646100
*           3 EEDAREC PTR(31),         /*Access Register 12      @LBA*/ 88646500
*           3 EEDARED PTR(31),         /*Access Register 13      @LBA*/ 88646900
*           3 EEDAREE PTR(31),         /*Access Register 14      @LBA*/ 88647300
*           3 EEDAREF PTR(31),         /*Access Register 15      @LBA*/ 88647700
*         2 EEDCREGS CHAR(64) BDY(WORD),/*Control registers at time of  88648100
*                                        error                   @LBA*/ 88648500
*           3 EEDCRE0 PTR(31),         /*Control Register 0      @LBA*/ 88648900
*           3 EEDCRE1 PTR(31),         /*Control Register 1      @LBA*/ 88649300
*           3 EEDCRE2 PTR(31),         /*Control Register 2      @LBA*/ 88649700
*           3 EEDXM CHAR(8) BDY(WORD), /*Cross memory registers  @LBM*/ 88650000
*             5 EEDCRE3 PTR(31),       /*Control Register 3      @LBA*/ 88650300
*               7 EEDXMCR3 CHAR(4),    /*Control Register 3      @LBM*/ 88650600
*             5 EEDCRE4 PTR(31),       /*Control Register 4      @LBA*/ 88650900
*               7 EEDXMCR4 CHAR(4),    /*Control Register 4      @LBM*/ 88651200
*           3 EEDCRE5 PTR(31),         /*Control Register 5      @LBA*/ 88651700
*           3 EEDCRE6 PTR(31),         /*Control Register 6      @LBA*/ 88652100
*           3 EEDCRE7 PTR(31),         /*Control Register 7      @LBA*/ 88652500
*           3 EEDCRE8 PTR(31),         /*Control Register 8      @LBA*/ 88652900
*           3 EEDCRE9 PTR(31),         /*Control Register 9      @LBA*/ 88653300
*           3 EEDCREA PTR(31),         /*Control Register 10     @LBA*/ 88653700
*           3 EEDCREB PTR(31),         /*Control Register 11     @LBA*/ 88654100
*           3 EEDCREC PTR(31),         /*Control Register 12     @LBA*/ 88654500
*           3 EEDCRED PTR(31),         /*Control Register 13     @LBA*/ 88654900
*           3 EEDCREE PTR(31),         /*Control Register 14     @LBA*/ 88655300
*           3 EEDCREF PTR(31),         /*Control register 15     @LBA*/ 88655700
*         2 EEDPSW CHAR(16) BDY(WORD), /*EC mode PSW + ILC int code     88656100
*                                        and translation address     */ 88656500
*          3 EEDPSW1 CHAR(8) BDY(WORD),/*First half of PSW           */ 88656900
*           4 EEDPSWMK FIXED(31),      /*System and prog mask        */ 88657300
*           4 EEDPSWIC PTR(31),        /*Instruction counter         */ 88657700
*          3 EEDPSW2 CHAR(8) BDY(WORD),/*Second half of PSW          */ 88658100
*           4 EEDINILC FIXED(31),      /*Interp code and ILC         */ 88658500
*             5 *       CHAR(1),       /*Always set to zero          */ 88658900
*             5 EEDILC  FIXED(8),      /*Instruction len counter -      88659300
*                                        the number of bytes to         88659700
*                                        subtract from the IC to get    88660100
*                                        last instruction executed   */ 88660500
*             5 EEDINTCD FIXED(16),    /*Interrupt code              */ 88660900
*           4 EEDTRANS PTR(31),        /*Translation exception addr  */ 88661300
*             5 * BIT(29),             /*                        @LHA*/ 88661400
*             5 EEDSOPI BIT(1),        /* When on for PIC 4, EEDTRANS   88661500
*                                         contains TEA           @LHA*/ 88661600
*             5 * BIT(2),              /*                        @LHA*/ 88661700
*         2 EEDERRID CHAR(10) BDY(HWORD),/* Errorid              @LBM*/ 88661800
*           3 EEDESEQ# CHAR(2),       /* Sequence number         @LBM*/ 88661900
*           3 EEDECPUI FIXED(16) BDY(HWORD),/* CPU id            @LBM*/ 88662000
*           3 EEDEASID CHAR(2),       /* ASID                    @LBM*/ 88662100
*           3 EEDETIME CHAR(4),       /* Time stamp              @LBM*/ 88662200
*         2 EEDRFLGS CHAR(1),         /* Flags for REGSPTYP EED  @LFC*/ 88662300
*           3 EEDTEAV BIT(1),         /* If on, indicates EEDTRANS      88662400
*                                        contains valid address  @LFA*/ 88662500
*           3 EEDTEIV BIT(1),         /* If on, indicates EEDTRANS      88662600
*                                        contains valid ASID     @LFA*/ 88662700
*           3 EEDTEPC BIT(1),         /* If on, indicates EEDTRANS      88662800
*                                        contains valid PC#      @LHA*/ 88662900
*         2 EEDMISC CHAR(1),          /* Misc RTM1->RTM2 info    @01C*/ 88663000
*           3 EEDEAS  BIT(1),         /* SDWAEAS was on in RTM1  @01A*/ 88663100
*         2 EEDLLSR PTR(31),          /* The linkage stack register     88663200
*                                        value obtained by RTM1 from    88663300
*                                        the last FRR entry processed   88663400
*                                        during RTM1 FRR processing     88663500
*                                                                @LBA*/ 88663600
*         2 EEDDUCT CHAR(64),         /* Contents of the DUCT control   88663700
*                                        area at time of error   @LBA*/ 88663800
*         2 EEDTEAR FIXED(8),         /* Translation exception address  88663900
*                                        access register number  @LBA*/ 88664000
*         2 * CHAR(23),               /* Reserved                @LBA*/ 88664100
*         /* SDWA error information                                  */ 88664200
*         2 EEDSDWA CHAR(28) BDY(WORD),/* These fields are used for     88664300
*                                        SRB-to-TASK percolation and    88664400
*                                        for FRR to ESTAE (RTM1 to RTM2)88664500
*                                        percolation.            @LBM*/ 88664600
*           3 EEDFAIN CHAR(12),       /* Saved copy of SDWAFAIN  @LBM*/ 88664700
*           3 EEDASCB PTR(31),        /* Saved copy of SDWAASCB  @LBM*/ 88664800
*           3 EEDASST PTR(31),        /* Saved copy of SDWAASST  @LBM*/ 88664900
*           3 EEDCCRC,                /* Structure for next 2 words     88665000
*                                                                @LBM*/ 88665300
*             5 EEDSABC,              /* Saved copy of SDWASABC  @LBM*/ 88665700
*               7 EEDOABF,            /* Saved copy of SDWAOABF  @LBM*/ 88666100
*                 9 * BIT(5),         /* Reserved                @LBM*/ 88666500
*                 9 EEDORCF BIT(1),   /* Saved copy of SDWAORCF  @LBM*/ 88666900
*                 9 * BIT(2),         /* Reserved                @LBM*/ 88667300
*               7 EEDOCMP CHAR(3),    /* Saved copy of SDWAOCMP  @LBM*/ 88667700
*             5 EEDOCRC CHAR(4),      /* Saved copy of SDWAOCRC  @LBM*/ 88668100
*         2 EEDCOMU CHAR(8),          /* FRR to ESTAE communication     88670500
*                                        buffer (from SDWACOMU)  @L5M*/ 88670600
*         /* Hardware repair status information                      */ 88670700
*         2 EEDHWREP CHAR(44) BDY(WORD),/* Hardware repair              88670800
*                                        status information      @LBC*/ 88670900
*          3 EEDHWR CHAR(28) BDY(WORD), /* Part 1 of EEDHWREP    @LHC*/ 88671000
*           4 EEDHSCKB PTR(31),        /*Starting vrt adr of stor ck */ 88671100
*           4 EEDHSCKE PTR(31),        /*Ending virt addr of stor ck */ 88671200
*           4 EEDHMCHS FIXED(8),       /*RTM1 software status flags  */ 88671300
*             5 EEDHSRVL BIT(1),       /*Storage ranges and RFSA vald*/ 88671400
*             5 EEDHRCDF BIT(1),       /*MCH rcrd not recorded       */ 88671500
*             5 EEDHTSVL BIT(1),       /*Time stamp is valid         */ 88671600
*             5 EEDINVP BIT(1),        /*Storage reconfigured page      88671700
*                                        invalidated                 */ 88671800
*             5 EEDRSRC BIT(1),        /*Storage reconfiguration        88671900
*                                        status is available         */ 88672000
*             5 EEDHRSRF BIT(1),       /*Storage reconfiguration not    88672100
*                                        not attempted               */ 88672200
*             5 EEDHVRIV BIT(1),       /*On, indicates vector registers 88672300
*                                        are unpredictable       @H1A*/ 88672400
*             5 EEDHARGU BIT(1),       /*On, indicates access registers 88672500
*                                        are unpredictable       @LBC*/ 88672600
*           4 EEDHMCHD FIXED(8),       /*RTM1 machine check data     */ 88672700
*             5 EEDHSKYF BIT(1),       /*Storage key failure         */ 88672800
*             5 EEDHREGU BIT(1),       /*Registers unpredictable     */ 88672900
*             5 EEDHPSWU BIT(1),       /*PSW unpredictable           */ 88673000
*             5 EEDHSCK BIT(1),        /*Storage data chk            */ 88673100
*             5 EEDHACR BIT(1),        /*ACR in progress             */ 88673200
*             5 EEDHINSF BIT(1),       /*Instruction failure         */ 88673300
*             5 EEDHSOFT BIT(1),       /*Soft error                  */ 88673400
*             5 EEDHTERR BIT(1),       /*Timer error                 */ 88673500
*           4 EEDHCPID FIXED(15),      /*CPU addr of dead CPU - ACR  */ 88673600
*           4 EEDHRSRS PTR(16),        /*Storage reconfig status        88673700
*                                        bytes                       */ 88673800
*             5 EEDHRSR1 FIXED(8),     /*Storage reconfig status 1   */ 88673900
*               7 * BIT(2),            /*Reserved            @G860P1F*/ 88674000
*               7 EEDHPREF BIT(1),     /* Preferred frame    @G860P1F*/ 88674100
*               7 EEDHVRCN BIT(1),     /* V = R candidate - can go      88674200
*                                         offline            @G860P1F*/ 88674300
*               7 EEDHNSWP BIT(1),     /* Long-term non-swappable       88674400
*                                         address space      @G860P1F*/ 88674500
*               7 EEDHNSWA BIT(1),     /* Non-swappable address space   88674600
*                                                            @G860P1F*/ 88674700
*               7 EEDHMSER BIT(1),     /*Stor err alredy set in frame*/ 88674800
*               7 EEDHCHNG BIT(1),     /*Frame had chang indicator on*/ 88674900
*             5 EEDHRSR2 FIXED(8),     /*Storage reconfig status 2   */ 88675000
*               7 EEDHOFLN BIT(1),     /*Frame offlin or sched offlin*/ 88675100
*               7 EEDHINTC BIT(1),     /*Intercept-frame is scheduled   88675200
*                                        offline, either storage err    88675300
*                                        or V=R ind also on          */ 88675400
*               7 EEDHSPER BIT(1),     /*Perm err occurs in frame    */ 88675500
*               7 EEDHNUCL BIT(1),     /*Frame  contains permanent      88675600
*                                        resident system storage     */ 88675700
*               7 EEDHFSQA BIT(1),     /*Frame in use for SQA        */ 88675800
*               7 EEDHFLSQ BIT(1),     /*Frame in use for LSQA       */ 88675900
*               7 EEDHPGFX BIT(1),     /*Frame contains PGFIXED data */ 88676000
*               7 EEDHVERQ BIT(1),     /*Frame in use for V = R         88676100
*                                                            @G860P1F*/ 88676200
*           4 EEDHMCHO  FIXED(8),      /* Other MCH flags        @02A*/ 88676300
*             5 EEDHSKPR  BIT(1),      /* Skip recording requested      88676500
*                                         by MCH                 @02A*/ 88676700
*             5 *         BIT(7),      /* Reserved               @02A*/ 88676900
*           4 *      CHAR(1),          /*Reserved                @02C*/ 88677100
*           4 EEDHRFSA PTR(31),        /*Real failing storage addr   */ 88677300
*           4 EEDHTIME CHAR(8),        /*Timestamp of MCH record     */ 88677500
*          3 EEDIOMA CHAR(16) BDY(WORD), /*I/O mach check additional    88677700
*                                        data                @G860P1C*/ 88677900
*            5 EEDHRFSE CHAR(8) BDY(WORD),  /* ESAME FSA         @LHA*/ 88678000
*              7 EEDHRFSH PTR(31),     /* ESAME FSA high         @LHA*/ 88678100
*              7 EEDHRFSL PTR(31),     /* ESAME FSA low          @LHA*/ 88678200
*            5 EEDMCIC CHAR(8),        /*Machine check interrupt        88678500
*                                        code                @G860P1S*/ 88678700
*         2 EEDG64H CHAR(64) BDY(WORD), /* High order halves of GPRs    88680700
*                                        0-15 at time of error   @LHA*/ 88682700
*         2 * CHAR(4),                  /* Reserved              @LHA*/ 88684700
*         2 EEDC64S CHAR(128) BDY(DWORD),  /* ESAME CRs          @LHA*/ 88686700
*           3 EEDC640 CHAR(8) BDY(WORD),   /* ESAME CR0          @LHA*/ 88688700
*           3 EEDC641 CHAR(8) BDY(WORD),   /* ESAME CR1          @LHA*/ 88690700
*           3 EEDC642 CHAR(8) BDY(WORD),   /* ESAME CR2          @LHA*/ 88692700
*           3 EEDC643 CHAR(8) BDY(WORD),   /* ESAME CR3          @LHA*/ 88694700
*           3 EEDC644 CHAR(8) BDY(WORD),   /* ESAME CR4          @LHA*/ 88696700
*           3 EEDC645 CHAR(8) BDY(WORD),   /* ESAME CR5          @LHA*/ 88698700
*           3 EEDC646 CHAR(8) BDY(WORD),   /* ESAME CR6          @LHA*/ 88700700
*           3 EEDC647 CHAR(8) BDY(WORD),   /* ESAME CR7          @LHA*/ 88702700
*           3 EEDC648 CHAR(8) BDY(WORD),   /* ESAME CR8          @LHA*/ 88704700
*           3 EEDC649 CHAR(8) BDY(WORD),   /* ESAME CR9          @LHA*/ 88706700
*           3 EEDC64A CHAR(8) BDY(WORD),   /* ESAME CRA          @LHA*/ 88708700
*           3 EEDC64B CHAR(8) BDY(WORD),   /* ESAME CRB          @LHA*/ 88710700
*           3 EEDC64C CHAR(8) BDY(WORD),   /* ESAME CRC          @LHA*/ 88712700
*           3 EEDC64D CHAR(8) BDY(WORD),   /* ESAME CRD          @LHA*/ 88714700
*           3 EEDC64E CHAR(8) BDY(WORD),   /* ESAME CRE          @LHA*/ 88716700
*           3 EEDC64F CHAR(8) BDY(WORD),   /* ESAME CRF          @LHA*/ 88718700
*         2 EEDTRNE CHAR(8) BDY(WORD),     /* 8-byte TEA         @LHA*/ 88720700
*       /*************************************************************/ 88722700
*       /*                                                           */ 88724700
*       /*                DUMPOTYP EED--DUMP OPTIONS                 */ 88726700
*       /*                                                           */ 88729100
*       /*************************************************************/ 88778800
*       1 EEDDUMPO CHAR(460) DEF(EEDVARBL) BDY(WORD), /*The length of   88819700
*                                        this area is dependent on the  88860600
*                                        format of the SNAP parameter   88901500
*                                        list and the SDWA starting at  88942400
*                                        label SDWADUMP          @LHC*/ 88983300
*         2 EEDSCDMP CHAR(8),          /*Dump parameters common to the  89024200
*                                        SNAP and SDWA mappings      */ 89065100
*           3 EEDSDUMP CHAR(4),        /* Dump characteristics       */ 89106000
*           3 EEDSDDAT  CHAR(4),       /* SDATA/PDATA options        */ 89146900
*             4 EEDSSDAT BIT(16),      /* Dump system data           */ 89187800
*             4 EEDSPDAT BIT(16),      /*Dump prob prog data         */ 89228700
*         2 EEDSDPSL CHAR(240) BDY(WORD),/*Dump storage lists    @LBC*/ 89269600
*           3 EEDRGS(30) CHAR(8),      /* 30 Ranges              @LBC*/ 89310500
*         2 EEDSPLS CHAR(16) BDY(WORD),/*                        @LBM*/ 89351400
*           3 EEDSPLN FIXED(15),       /*Number of subpools      @LBM*/ 89401400
*           3 EEDSPID CHAR(14);        /*Up to 7 subpool ids     @LBM*/ 89451400
*                                                                       89501400
*       /*************************************************************/ 89504000
*       /*                                                           */ 89506600
*       /*         DUMPXTYP EED - Data Space Storage Ranges          */ 89509200
*       /*                                                           */ 89511800
*       /*************************************************************/ 89514400
*                                                                       89517000
*        DECLARE                     /* EED for data space storage      89519600
*                                       ranges (up to 15)        @LEA*/ 89522200
*         1 EEDDUMPX CHAR(LENGTH(EEDVARBL)) DEF(EEDVARBL) BDY(WORD),    89524800
*           3 EEDDXSL BDY(WORD),    /* Data space storage range list    89527400
*                                                                @LEA*/ 89530000
*             5 EEDDXSR (15) BDY(WORD), /* Dump storage range    @LEA*/ 89532600
*               7 EEDDXBEG PTR(31), /* Start address of range    @LEA*/ 89535200
*               7 EEDDXEND PTR(31), /* End address of range      @LEA*/ 89537800
*                 9 EEDDXLE  BIT(1), /* Bit indicating end of list      89540400
*                                                                @LEA*/ 89543000
*               7 EEDDXSTK CHAR(8); /* Stoken for range          @LEA*/ 89545600
*                                                                       89548200
*   /*****************************************************************/ 89551400
*   /*                                                               */ 89601400
*   /*                       ETAB - EED TABLE                        */ 89651400
*   /*                                                               */ 89701400
*   /*  THE ETAB IS USED TO KEEP TRACK OF EEDS AND THEIR CORRESPOND- */ 89751400
*   /*  ING ADDRESS SPACE.  THE ADDRESS OF EACH EED IN THE THE CPOOL */ 89801400
*   /*  OF EEDS IS RECORDED IN ETAB.  IN ADDITION, WHEN A NEW EED IS */ 89851400
*   /*  ALLOCATED, THE CORRESPONDING ENTRY IN ETAB IS UPDATED TO     */ 89901400
*   /*  POINT TO THE ASCB ASSOCIATED WITH THE EED.  UPON TERMINATION */ 89951400
*   /*  OF AN ADDRESS SPACE, THE ETAB IS SEARCHED, AND ANY EEDS      */ 90001400
*   /*  CURRENTLY IN USE WHICH BELONG TO THE TERMINATING ADDRESS     */ 90051400
*   /*  SPACE ARE RETURNED TO THE EED CPOOL.                     @LAA*/ 90101400
*   /*                                                               */ 90151400
*   /*****************************************************************/ 90201400
*   DCL 1 ETAB BDY(DWORD) BASED (RTCTEEDA), /* ETAB based on            90251400
*                                              RTCTEEDA          @LAA*/ 90301400
*         2 ETABID CHAR(4),                /* ETAB identifier    @LAA*/ 90351400
*         2 * CHAR(4),                     /* Reserved field     @LAA*/ 90401400
*         2 ETABENTR(ETAB#ENT) BDY(DWORD), /* Main part of ETAB  @LAA*/ 90451400
*           3 ETABEED PTR(31),   /* Pointer to hold EED address  @LAA*/ 90501400
*           3 ETABASCB PTR(31);  /* Pointer to the EED's address        90551400
*                                   space control block          @LAA*/ 90601400
*                                                                       90651400
*   DCL  ETAB#ENT FIXED(15) CONSTANT(53);   /* Make constant the        90701400
*                           number of entries in ETAB.  This is used    90751400
*                           when allocating the cpool of EEDs.   @LAA*/ 90801400
*                                                                       90851400
*%EEEDSDCL:;                                                  /* @LCC*/ 90904000
*%RETPDCL:;                                                   /* @LCA*/ 90956600
*     %IF RETP~='YES'                                         /* @LCA*/ 91009200
*       %THEN %GOTO ERETPDCL;                                 /* @LCA*/ 91061800
                                                                        91114400
    /*****************************************************************/ 91119100
    /*                                                               */ 91123800
    /*  The RETPL maps the parameter list passed to PTRACE when a    */ 91128500
    /*  RCVY type event is to be traced.  The recovery event traced  */ 91133200
    /*  is indicated by the recovery event subtype, RETPSTYP.  The   */ 91137900
    /*  subtypes for all currently defined recovery events are       */ 91142600
    /*  declared below.                                              */ 91147300
    /*                                                               */ 91152000
    /*****************************************************************/ 91156700
                                                                        91161400
    DECLARE                         /* Ptrace parameter list for        91167000
                                       for recovery event types      */ 91219600
      1 RETPL BDY(DWORD) BASED,                               /* @LCA*/ 91261600
       2 RETPDLEN FIXED(16),        /* Number of words in RETPDATA      91303600
                                                                 @LCA*/ 91345600
       2 RETPSTYP FIXED(16),        /* Recovery event subtype    @LCA*/ 91387600
       2 RETPDATA,                  /* Data to be traced for this       91430000
                                       event                     @LCA*/ 91469400
        3 RETPFDAT(8) FIXED(31),    /* Data to be traced (fixed) @LFA*/ 91508800
          4 RETPCDAT  CHAR(4);      /* Data to be traced (char)  @LCA*/ 91548200
                                                                        91587800
    DECLARE                         /* Recovery Processing Status       91640400
                                       Word                          */ 91693000
      1 RETPRPSW BDY(WORD) BASED,                             /* @LCA*/ 91745600
       2 RETPFLGS,                  /* Status flags              @LCA*/ 91798200
        3 RETPGLRM BIT(1),          /* The FRR will be given control as 91850800
                                       a global or local Resource       91903400
                                       manager                   @LCA*/ 91956000
        3 RETPSKIP BIT(1),          /* The FRR has been skipped  @LCA*/ 92008600
        3 *        BIT(5),          /* Reserved                  @LCA*/ 92061200
        3 RETPSSPR BIT(1),          /* The FRR has requested serialized 92113800
                                       SRB to task percolation   @LCA*/ 92166400
       2 *        CHAR(1),          /* Reserved                  @LCA*/ 92219000
       2 RETPSTKI FIXED(8),         /* FRR stack index           @LCA*/ 92271600
       2 RETPENTI FIXED(8);         /* FRR entry index           @LCA*/ 92324200
                                                                        92376800
    /*****************************************************************/ 92381500
    /*                                                               */ 92386200
    /*  The following constants are used in the recovery event type  */ 92390900
    /*  trace entries to indicate the particular event that has      */ 92395600
    /*  occurred.  They are the recovery event subtype which is      */ 92400300
    /*  passed to the PTRACE macro in the RETPSTYP field of the      */ 92405000
    /*  recovery event PTRACE parmlist.                              */ 92409700
    /*                                                               */ 92414400
    /*****************************************************************/ 92419100
                                                                        92423800
    DECLARE                         /* Recovery event subtypes       */ 92429400
                                                                        92482000
      /***************************************************************/ 92534600
      /*                                                             */ 92587200
      /* SLIH mode entry types                                       */ 92639800
      /*                                                             */ 92692400
      /***************************************************************/ 92745000
                                                                        92797600
      RETSPROG FIXED(16) CONSTANT(01), /* Program check          @LCA*/ 92850200
      RETSRSRT FIXED(16) CONSTANT(02), /* Restart                @LCA*/ 92902800
      RETSMCH  FIXED(16) CONSTANT(03), /* Machine Check          @LCA*/ 92955400
      RETSDAT  FIXED(16) CONSTANT(04), /* DAT error              @LCA*/ 93008000
      RETSSABN FIXED(16) CONSTANT(05), /* SABEND entry           @LCA*/ 93060600
                                                                        93113200
      /***************************************************************/ 93165800
      /*                                                             */ 93218400
      /* Service mode entry types                                    */ 93271000
      /*                                                             */ 93323600
      /***************************************************************/ 93376200
                                                                        93428800
      RETSMEM  FIXED(16) CONSTANT(32), /* Memterm                @LCA*/ 93481400
      RETSABT  FIXED(16) CONSTANT(33), /* Abterm                 @LCA*/ 93534000
      RETSITRM FIXED(16) CONSTANT(34), /* ITERM                  @LCA*/ 93586600
      RETSSTRM FIXED(16) CONSTANT(35), /* STERM                  @LCA*/ 93639200
      RETSRCML FIXED(16) CONSTANT(36), /* RMGRCML                @LCA*/ 93691800
                                                                        93744400
      /***************************************************************/ 93797000
      /*                                                             */ 93849600
      /* Service mode reentry types                                  */ 93902200
      /*                                                             */ 93954800
      /***************************************************************/ 94007400
                                                                        94060000
      RETSMEMR FIXED(16) CONSTANT(64), /* Memterm Reentry        @LCA*/ 94112600
      RETSABTR FIXED(16) CONSTANT(65), /* Abterm Reentry         @LCA*/ 94165200
      RETSITRR FIXED(16) CONSTANT(66), /* ITERM Reentry          @LCA*/ 94217800
      RETSSTRR FIXED(16) CONSTANT(67), /* STERM Reentry          @LCA*/ 94270400
      RETSRCMR FIXED(16) CONSTANT(68), /* RMGRCML Reentry        @LCA*/ 94323000
                                                                        94375600
      /***************************************************************/ 94428200
      /*                                                             */ 94480800
      /* Percolation, Retry, and Resume types                        */ 94533400
      /*                                                             */ 94586000
      /***************************************************************/ 94638600
                                                                        94691200
      RETSSPRC FIXED(16) CONSTANT(96), /* SRB to task Percolation       94735000
                                                                 @LCA*/ 94778800
      RETSPERC FIXED(16) CONSTANT(97), /* Percolation            @LCA*/ 94822600
      RETSRTRY FIXED(16) CONSTANT(98), /* Retry                  @LCA*/ 94866400
      RETSRESM FIXED(16) CONSTANT(99), /* Resume                 @LCA*/ 94910200
                                                                        94954200
      /***************************************************************/ 95006800
      /*                                                             */ 95059400
      /* Miscellaneous types                                         */ 95112000
      /*                                                             */ 95164600
      /***************************************************************/ 95217200
                                                                        95269800
      RETSFRR  FIXED(16) CONSTANT(128), /* FRR                   @LCA*/ 95322400
      RETSABRT FIXED(16) CONSTANT(129); /* ABORT subtype         @LCA*/ 95375000
                                                                        95427600
*%ERETPDCL:;                                                  /* @LCA*/ 95480200
*%STKDCL:;                                                              95538000
*     %IF FRRSTACKMAP~='YES'                                            95587700
*       %THEN %GOTO RT1WCKF;                                            95637400
*%STKDCLONLY:;                                                          95687100
*     %IHART1WF_FSTK = 'YES';                                           95737100
*%RT1WCKF:;                                                             95787100
*     %IF SYSVERSION = ''                                               95837100
*       %THEN %GOTO RT1WEND;                                            95887100
*     %IF IHART1WF_RTMC = '' & IHART1WF_FSTK = '' %THEN                 95937100
*       %GOTO RT1WEND;                                                  95987100
*    %INCLUDE SYSLIB(IHART1WF);                                         96037100
*%RT1WEND:;                                                             99315200
*DCL RT1WFWLN CONSTANT(304);           /* Size of FRR work area  @LHA*/ 99340000
*     %DEACTIVATE RTM1WA;                                               99364900
*     %DEACTIVATE EEDS;                                                 99414600
*     %DEACTIVATE RTMB;                                                 99464300
*     %DEACTIVATE ENPT;                                                 99514000
*     %DEACTIVATE RTMC;                                                 99563700
*     %DEACTIVATE RT1S;                                                 99613400
*     %DEACTIVATE MODE;                                                 99663100
*     %DEACTIVATE RTG;                     /*                    @L9A*/ 99712800
*     %DEACTIVATE RTI;                     /*                    @L9A*/ 99762500
*     %DEACTIVATE RTW;                     /*                    @L9A*/ 99812200
*     %DEACTIVATE RTX;                     /*                    @L9A*/ 99861900
*     %DEACTIVATE RETP;                    /*                    @LEA*/ 99886700
*     %DEACTIVATE FRRSTACKMAP;             /*                    @L8A*/ 99911600
*%RTMTRAN: MACRO KEYS(PREFIX,PIC,SOPI);  /* Set TEAV,TEIV,TEPC   @LFA*/ 99914900
* ANS('DO; /* Begin RTMTRAN macro   */') SKIP NORESCAN; /*       @LFA*/ 99918200
* ANS(PREFIX(1)||'TEIV = OFF; /* Clear flags before select statement    99920400
* */') SKIP NORESCAN;          /*                                @LFA*/ 99924800
* ANS(PREFIX(1)||'TEAV = OFF; /* Clear flags before select statement    99929200
* */')  SKIP NORESCAN;         /*                                @LFA*/ 99933600
* ANS(PREFIX(1)||'TEPC = OFF; /* Clear flags before select statement    99935000
* */')  SKIP NORESCAN;         /*                                @LHA*/ 99936500
* ANS('SELECT(EVAL('||PIC(1)||'&''3F''X)); /* Select interrupt type */')99938000
*  SKIP  NORESCAN;                /*                            @LFA*/  99941500
* ANS('WHEN (''10''X,''11''X,''38'',''39'',''3A''X,''3B''X) '           99945000
*          ||'/* Segment translation or page translation */')           99948500
*       SKIP NORESCAN;         /*                                @LFA*/ 99952000
* ANS(PREFIX(1)||'TEAV = ON; /* SDWATRAN contains a valid address*/')   99955600
*  SKIP NORESCAN;              /*                                @LFA*/ 99960000
* ANS('WHEN (''1C''X,''20''X,''21''X,''24''X,''25''X) /* Space switch   99963500
* exception, AFX translation, ASX translation, primary authorization    99967000
* exception or secondary authorization exception */'                    99970500
*    ) SKIP NORESCAN;          /*                                @LFA*/ 99974000
* ANS(PREFIX(1)||'TEIV = ON; /* SDWATRAN contains a valid ASID */')     99977600
*  SKIP NORESCAN;              /*                                @LFA*/ 99982000
* ANS('WHEN (''22''X,''23''X)  /*  LX translation, EX translation */'   99982400
*    ) SKIP NORESCAN;          /*                                @LHA*/ 99982800
* ANS(PREFIX(1)||'TEPC = ON; /* SDWATRAN contains a valid PC# */')      99983200
*  SKIP NORESCAN;              /*                                @LHA*/ 99983600
* ANS('WHEN (''04''X)          /*  Protection exception           */'   99984000
*    ) SKIP NORESCAN;          /*                                @LHA*/ 99984400
* ANS('IF '||SOPI||' THEN    /* Suppress-on-protect indicated?   */')   99984800
*  SKIP NORESCAN;              /*                                @LHA*/ 99985200
* ANS(PREFIX(1)||'TEAV = ON; /* SDWATRAN contains a valid address*/')   99985600
*  SKIP NORESCAN;              /*                                @LHA*/ 99986000
* ANS('OTHER; /* SDWATRAN has no meaning */') SKIP NORESCAN; /*  @LFA*/ 99986400
* ANS('END; /* Select interrupt type */') SKIP NORESCAN; /*      @LFA*/ 99990800
* ANS('END; /* End RTMTRAN macro     */') SKIP NORESCAN; /*      @LFA*/ 99993000
*RETURN CODE(0);                   /*                            @LFA*/ 99995200
*%END;                             /* End of RTMTRAN Macro       @LFA*/ 99999600
