*         %GOTO PLSSTCB1;            /*                                 00050000
         MACRO                                                          00100000
         IHASTCB &LIST=NO                                               00150000
**/                                                                     00200000
*%PLSSTCB1:;                                                            00250000
*/* START OF SPECIFICATIONS ******************************************/ 00287500
*/**** PROPRIETARY_STATEMENT *****************************************/ 00325000
*/*01* PROPRIETARY STATEMENT =                                   @LNC*/ 00362500
*/*                                                                  */ 00400000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01056800
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01064000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1985, 2000                 */ 01074800
*/*                                                                  */ 01085600
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 01092800
*/*                                                                  */ 01100000
*/*01* STATUS:  HBB7703                                              */ 01150000
*/*                                                                  */ 01400000
*/*01* DESCRIPTIVE NAME:  Secondary Task Control Block (TCB)         */ 01413300
*/*02*  ACRONYM:  STCB                                               */ 01426600
*/*                                                                  */ 01428000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 01429400
*/*02*         NOTPI:BASE                                            */ 01431200
*/*02*         PI:  FIELDS                                           */ 01433000
*/*                  STCBDB2                                         */ 01435300
*/*                  STCBFLG2                                        */ 01435400
*/*                  STCBFLG6                                        */ 01435500
*/*                  STCBFPFL                                    @LSA*/ 01435600
*/*                  STCBIPKF                                    @LVA*/ 01435700
*/*                  STCBIPKM                                    @LVA*/ 01435800
*/*                  STCBOTCB                                        */ 01435900
*/*                  STCBTTCB                                        */ 01436000
*/*                  STCBVREQ                                        */ 01436100
*/*                  STCBVTME                                        */ 01436400
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01437800
*/*                                                                  */ 01440000
*/*01* MACRO-NAME:  IHASTCB                                          */ 01450000
*/*                                                                  */ 01500000
*/*01* DSECT NAME:                                                   */ 01525000
*/*     STCB                                                         */ 01550000
*/*                                                                  */ 01575000
*/*01* COMPONENT:  Task Management (SC1CL)                           */ 01578000
*/*                                                                  */ 01581000
*/*01* EYE-CATCHER:  STCB                                            */ 01584000
*/*02*  OFFSET:  0                                                   */ 01587000
*/*02*  LENGTH:  4                                                   */ 01590000
*/*                                                                  */ 01593000
*/*01* STORAGE ATTRIBUTES:                                           */ 01593600
*/*02*  SUBPOOL:  253 (ELSQA)                                        */ 01594200
*/*02*  KEY:  0                                                      */ 01594800
*/*02*  RESIDENCY:  Above 16 MB line                                 */ 01595400
*/*                                                                  */ 01596000
*/*01* SIZE:  OFFSET OF STCBEND MINUS THE OFFSET OF STCB             */ 01596600
*/*                                                                  */ 01597200
*/*01* CREATED BY:                                                   */ 01597800
*/*     IEAVEMIN                                                     */ 01598400
*/*     IEAVEATO                                                     */ 01599000
*/*     IEAMSWCB                                                     */ 01599600
*/*                                                                  */ 01601000
*/*01* ATTRIBUTES :                                                  */ 01601300
*/*       DELETED BY : IEAVEED0                                      */ 01601600
*/*       CBLS LEVEL : 6                                             */ 01602000
*/*                                                                  */ 01602400
*/*01* POINTED TO BY:                                                */ 01602500
*/*     TCBSTCB field of the TCB data areas                          */ 01602600
*/*                                                                  */ 01602700
*/*01* SERIALIZATION:                                                */ 01602800
*/*     Depends on the field                                         */ 01602900
*/*                                                                  */ 01603000
*/*01* FUNCTION:                                                     */ 01603100
*/*02*  The secondary task control block (STCB) allows task-related  */ 01603200
*/*     information to be kept above 16 megabytes.                   */ 01603300
*/*                                                                  */ 01603400
*/*01* METHOD OF ACCESS:                                             */ 01603500
*/*02*  ASM:                                                         */ 01603600
*/*      DSECT is always produced.                                   */ 01603700
*/*      USING on STCB gives Addressability for all symbols.         */ 01603800
*/*      Specify LIST=YES on Macro call for listing.                 */ 01603900
*/*02*  PL/AS:                                                       */ 01604000
*/*      Is Based on TCBSTCB.                                        */ 01604100
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 01604200
*/*      VIA attribute - Specify %IHAVIA='YES' before %INCLUDE.      */ 01604300
*/*                    - Declare STCBALET.                           */ 01604400
*/*                                                                  */ 01604500
*/*01* DEPENDENCIES:                                                 */ 01604600
*/*                                                                  */ 01604700
*/*      For any length changes to the IHASTCB macro:                */ 01604800
*/*                                                                  */ 01604900
*/*      1) IEAVCBLS, IEAMSWCB, and BLSVSTCB must be recompiled.     */ 01605000
*/*                                                                  */ 01605100
*/*      2) The IHACBLS macro CBLSTCBL field (STCB level number)     */ 01605200
*/*         must be incremented by one the FIRST time the IHASTCB    */ 01605300
*/*         increases in size for a product release (and remains     */ 01605400
*/*         unchanged with any future increases in SAME FMID).       */ 01605500
*/*                                                                  */ 01605600
*/*      3) Length changes must be in multiples of eight to ensure   */ 01605700
*/*         STCBEND ends up on a doubleword boundary (as defined).   */ 01605800
*/*         Otherwise, an informational message will appear stating  */ 01605900
*/*         that bytes have been skipped.                            */ 01606000
*/*                                                                  */ 01606100
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 01607000
*/*                                                                  */ 01609000
*/*01* CHANGE ACTIVITY:                                              */ 01617200
*/*  $L7=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 01625400
*/*                                                                  */ 01633600
*/* END OF SPECIFICATIONS ********************************************/ 01641800
*%GOTO PLSSTCB2;           /*                                           01650000
.*                                                                      01700000
.*********************************************************************  01750000
.*   CHANGE-ACTIVITY =                                                  01800000
.*                                                                      01850000
.*  $01=OY04980  JBB2214  870305  PD16H4:  VECTOR SECURITY SPE          01866600
.*                                                                      01883200
.*  $H0=VF       JBB2214  840409  PD16XK:  VECTOR FEATURE               01900000
.*  $L1=DIV      JBB2220  840905  PD16Q9:  DATA IN VIRTUAL              01925000
.*  $L2=AR       HBB3310  850905  PD16Q4:  ACCESS REGISTERS             01937500
.*  $L3=DATASPAC HBB3310  860630  PD16LD:  DATA SPACES                  01940600
.*  $D1=DCR0011  HBB3310  860630  PD16LD:  NULL LINKAGE STACK SUPPORT   01943700
.*  $D2=DCR0059  HBB3310  860630  PD16LD:  RTMRAS ENHANCEMENTS          01946800
.*  $D3=DCR0217  HBB3310  870225  PD16Q9:  DYNAMIC ALLOCATION           01947800
.*                                         STORAGE POINTER              01948800
.*  $L4=COUPL    HBB4410  870316  PD16Q4:  XCF SUPPORT                  01949100
.*  $L5=ILIBS    JBB3311  880229  PD16LD:  ILIB                         01949400
.*  $D4=DCR0007  JBB3313  880906  PD16CU:  ADD STCBVTIME                01949700
.*  $D5=DEO0095  HBB4410  881215  PD16BN:  OPSSI                        01959700
.*  $P1=PGP0129  JBB3313  881220  PD16CU:  STCBVTIME->STCBVTME          01969700
.*  $02=OY27045  JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC        01973000
.*                                         FEATURE SUPPORT              01976300
.*  $D6=DGP0043  JBB3313  890407  PD16ES:  ADD STCBRACP                 01979700
.*  $D7=DH30019  HBB4420  890710  PD16ES:  ADD STCBSJST                 01982200
.*  $L6=BPAGE    HBB4420  891030  PD16ES:  ADD REFERENCE PATTERN        01984700
.*                                         COUNT FIELDS                 01987200
.*  $L7=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete      01987800
.*  $P2=PH32022  HBB4420  910201  PD16AG:  ADD STCBNSTP                 01988400
.*  $L8=TOKEN    JBB4422  910301  PD16IG:  Add STCBNTTP for Name/Token  01989000
.*  $L9=SYSLK    HBB5510  890821  PD16EI:  ADD STCBCON#                 01989600
.*  $LA=COUPLXLO HBB5510  910311  PD16IG:  Generalize STCBSUSM comment  01990200
.*                                         so any XCF subcomponent may  01990800
.*                                         use this bit                 01991400
.*  $LB=PR422    JBB4422  910503  PD16EI:  SHOWHDR format update        01992000
.*  $03=OY45463  HBB4420  910731  PD16IG:  Add STCBDFP with STCBOAM bit 01992600
.*  $04=OY51779  JBB4422  920303  PD16IW:  SUSPEND/RESUME SEQUENCE #    01993200
.*  $LC=PGMSP    HBB4430  911001  PD16IG:  Add STCBCDXH for CDE         01993800
.*                                         extensions hash table ptr    01994700
.*  $LD=POSIX    HBB4430  910528  PD16IG:  Add STCBOTCB for OpenMVS     01995400
.*  $LE=POSIX    HBB4430  911228  PD16CU:  Add STCBSEQN                 01996100
.*  $P3=PKB2536  HBB4430  920429  PD16EI:  Add STCBRTNC bit for RTM2    01997000
.*  $P4=PKB1349  HBB4430  920617  PD16H5:  Add STCBATAD                 01997100
.*  $LF=ENFEN    HBB5510  921203  PD16IG:  Add bit STCBENFL in new flag 01997200
.*                                         byte STCBFLG4, create        01997300
.*                                         STCBFLG5 and STCBFLG6 for    01997400
.*                                         future task related bits     01997500
.*  $P5=PIG1646  HBB5510  930520  PD16IG:  Extend STCB to '104' hex.    01997600
.*                                         Add STCBXCNT for EXCP PTM.   01997700
.*  $D8=DIG0012  HBB5510  930520  PD16IG:  Change serialization on      01997800
.*                                         STCBMEMC from TCBACTIV to    01997900
.*                                         Compare-and-Swap             01998000
.*  $LG=DISPR    HBB5510  930801  PD16CU:  DISPATCHER RESTRUCTURE       01998100
.*  $LH=DISPR    HBB5510  930801  PDAG:    DISPATCHER RESTRUCTURE       01998200
.*  $LI=WLMI     HBB5510  911104  PD44BB:  Workload Manager 1           01998300
.*  $LJ=PARAD    HBB5510  930909  PD16IG:  Parallel Detach support      01998400
.*                                         - Add STCBPECB ECB field     01998500
.*  $P6=PIG3697  HBB5510  931110  PD16EI:  STCBOTCB GUPI                01998600
.*  $LK=LOGGR    HBB5520  931202  PD16EI:  Add STCBIXGL for System      01998900
.*                                         Logger Support               01999200
.*  $05=OW07164  HBB5510  940811  PD81KD:  Parallel Detach part 2       01999300
.*                                         - Add STCBDETA field         01999400
.*  $LL=UCBVS    HBB5520  941020  PD152M:  Add STCBUNCK, STCKENCK       01999600
.*  $LM=OPEN3    JBB5522  950105  PD152M:  Add STCBOPTC                 01999700
.*  $06=OW13228  HBB4430  950515  PD81XZ:  Add STCBTTCB, make           02009700
.*                                         STCBFLG2 GUPI                02019700
.*  $LN=WLMP     HBB6603  950601  PD152M:  Extend STCB to '120' hex.    02022200
.*  $07=OW14392  HBB5510  950727  PD81KD:  Add STCBPQUE                 02024700
.*                                         Add STCBSTSB, STCBEUTK       02025700
.*  $LO=WLMPESM  HBB6603  950907  B7HGEJ:  Add STCBENCR, STCBENCC.      02026700
.*  $LP=RRSCS    HBB6603  951113  B7HGEJ:  STCBRGSV                     02027700
.*  $P7=PQC1115  HBB6603  960502  R4GAXZ:  STCBDB2                      02028700
.*  $LQ=RTLS_SUP JBB6604  960808  PD00XB:  STCBRTLS,STCBRTLA,STCBINRT   02029200
.*  $LR=T6SVCSUP JBB6604  961101  PD00XB:  Remove STCBSRSN              02029400
.*  $P8=PSY0252  JBB6604  970107  B7VBGD:  Add STCBOFLG                 02029500
.*  $P9=PSY0302  JBB6604  970211  R4GAXZ:  Move STCBRTLS, STCBRTLA      02029600
.*  $PA=PSY0481  JBB6604  970313  R4GAXZ:  STCBBCBA                     02032900
.*  $08=OW22725  JBB3313  960926  R4GAXZ:  Add STCBSATF                 02034500
.*  $LS=IEEESUP  HBB6606  970807  PD00XB:  FP simulation                02035300
.*  $LT=CNSRV    HBB6606  971114  PD00KP:  EOT DOM performance          02035500
.*  $LU=BCOTE    HBB6606  971208  B7HGH5:  CICS OTE support             02035700
.*  $PB=PWA0091  JBB6607  980417  R4GAXZ:  Add STCBVREQ                 02035800
.*  $PC=PWK0318  HBB7703  981014  PDKD:    Add STCBPMOM                 02035900
.*  $LV=CICSO    JBB6609  990312  PD00XB:  Initial PKM, Initial PKF     02036000
.*  $LW=64BITSUP HBB7703 981204 PD00XB: ESAME                           02036100
.*  $PD=PXD0195  HBB7703 991207 PD00KD: Redefine STCBRTNC and add       02037000
.*                                      STCBNOAB                        02037900
.*  $09=OW42882  JBB6609  000127  U2IAXZ:  Add STCBPROP                 02038300
.*                                                                      02038800
.*********************************************************************  02039700
.*                                                                      02050000
.*********************************************************************  02100000
.*                                                                      02150000
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     02200000
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          02250000
.*                        STCBRXXX DS    XLNNN       RESERVED.          02300000
.*                            XXX IS THE OFFSET WITHIN THE STCB         02350000
.*                            NNN IS THE LENGTH OF THE RESERVED FIELD   02400000
.*                                A VALUE FROM 4 TO 256 INCLUSIVE       02450000
.*                                                                      02500000
.*     2. PL/AS - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT  02550000
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY      02600000
.*               ARE NOT NAMED.                                         02650000
.*                                                                      02700000
.*********************************************************************  02750000
.*                                                                      02800000
         PUSH  PRINT                                                    02850000
         AIF   ('&LIST' EQ 'YES').STCBLST                               02900000
         PRINT OFF                                                      02950000
.STCBLST ANOP                                                           03000000
         SPACE 1                                                        03050000
STCB     DSECT                     SECONDARY TCB                        03100000
STCBEGIN DS    0D                  BEGINNING OF STCB                    03150000
STCBSTCB DS    CL4                 ACRONYM IN EBCDIC -STCB-             03200000
STCBRACP DC    A(0)                POINTER TO RACF DATA FOR THIS   @D6A 03204400
*                                  TASK.                                03208800
*                                  OWNERSHIP: RACF.                     03213200
*                                  SERIALIZATION: NONE.                 03217600
STCBDIVF DS    A                   POINTER TO 1ST DOA (DIV OBJECT  @L1A 03222200
*                                  ACCESS CONTROL BLOCK) FOR TCB.       03233300
*                                  OWNERSHIP: DIV.                      03244400
*                                  SERIALIZATION: CML LOCK.             03255500
STCBDIVL DS    A                   POINTER TO LAST DOA FOR TCB.    @L1A 03266600
*                                  OWNERSHIP: DIV.                      03277700
*                                  SERIALIZATION: CML LOCK.             03288800
STCBAFNS DS    BL2                 ORIGINAL CPU AFFINITY SAVE AREA      03300000
*                                  USED TO SAVE TCBAFFN                 03350000
STCBCTSC DS    H                   Number of consecutive dispatches@LIC 03400000
*                                  remaining for this task              03450000
STCBVSSA DS    A                   ADDRESS OF VECTOR STATUS SAVE AREA   03650000
*                                  OWNERSHIP: SUPERVISOR CONTROL        03700000
*                                  SERIALIZATION: LOCAL LOCK TO WRITE   03733300
*                                             AND TCBACTIV TO READ      03766600
STCBVAFN DS    X                   VECTOR AFFINITY AND STATUS SAVED     03800000
*                                  INDICATORS                           03850000
*                                  OWNERSHIP: SUPERVISOR CONTROL        03900000
*                                  SERIALIZATION: TASK MODE IS TCBACTIV 03933300
*                                  SRB MODE IS LOCAL LOCK               03966600
STCBVMCK EQU   X'80'               VECTOR STATUS LOST DUE TO MACHINE    04000000
*                                  CHECK                                04050000
STCBSLID EQU   X'40'               LOGICAL CPU ID MASK                  04083300
STCBVISA EQU   X'20'               VECTOR STATUS SAVED IN VSSA          04116600
STCBSLCI EQU   X'0F'               IF STCBSLID IS ON THEN THIS NIBBLE   04149900
*                                  IS THE PHYSICAL CPU ID               04183200
STCBFLG1 DS    X                   FLAG BYTE                            04216500
*                                  OWNERSHIP: SUPERVISOR CONTROL        04250000
*                                  SERIALIZATION: TASK MODE IS TCBACTIV 04283300
*                                  SRB MODE IS LOCAL LOCK               04316600
STCBPIQ  EQU   X'80'               INDICATES TO STAGE 3 EXIT EFFECTOR   04350000
*                                  THAT IRB QUEUEING IS PROHIBITED.     04363800
*                                  USE ONLY FOR ASYMMETRIC FEATURE      04377600
*                                  PROCESSING.                          04391400
STCBVFRV EQU   X'40'               INDICATES THE USER IS NOT RACF  @01A 04405500
*                                  AUTHORIZED TO THE VECTOR FACILITY    04411000
STCBVFRD EQU   X'20'               INDICATES THE VECTOR SLIH HAS   @01A 04416500
*                                  PERFORMED THE RACF AUTHORIZATION     04422000
*                                  CHECKING                             04427500
STCBSST  EQU   X'10'               Indicates that the task is a    @LUA 04430100
*                                  Subspace task.                       04432700
         DS    XL2                 Reserved                        @LRC 04435500
STCBVFRB DS    A                   ADDRESS OF THE RB STOPPED BY THE     04443600
*                                  VECTOR SLIH PENDING VECTOR           04453900
*                                  ENVIRONMENT CREATION.                04464200
*                                  OWNERSHIP: SUPERVISOR CONTROL        04474800
*                                  SERIALIZATION: DISP LOCK             04483100
STCBALOV DS    A                   WORK UNIT ACCESS LIST VIRTUAL   @L2C 04483300
*                                  ADDRESS.                             04483500
*                                  OWNERSHIP: PC/AUTH.                  04483700
*                                  SERIALIZATION: TCBACTIV.             04483900
STCBALD  DS    A                   WORK UNIT ACCESS LIST           @L2C 04484100
*                                  DESIGNATOR. BITS 1-24 WITH           04484300
*                                  SEVEN ZEROES APPENDED ON THE RIGHT   04484500
*                                  FORM THE 31-BIT REAL ADDRESS OF THE  04484700
*                                  WORKUNIT'S ACCESS LIST. BITS 25-31   04484900
*                                  REPRESENT THE NUMBER OF 128 BYTE     04485100
*                                  ACCESS LISTS, MINUS ONE.             04485300
*                                  OWNERSHIP: PC/AUTH.                  04485500
*                                  SERIALIZATION: TCBACTIV.             04485700
STCBDUCV DS    A                   VIRTUAL ADDRESS OF THE DUCT.    @L2C 04485900
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04486100
*                                  SERIALIZATION: TCBACTIV.             04486300
STCBDUCR DS    A                   REAL ADDRESS OF THE DUCT.       @L2C 04486500
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04486700
*                                  SERIALIZATION: TCBACTIV.             04486900
STCBARS  DS    0XL64               ACCESS REGISTER SAVEAREA.       @L2A 04487100
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04487300
*                                  SERIALIZATION: DISABLEMENT.          04487500
STCBAR0  DS    F                   ACCESS REGISTER 0 SAVE AREA.    @L2A 04487700
STCBAR1  DS    F                   ACCESS REGISTER 1 SAVE AREA.    @L2A 04487900
STCBAR2  DS    F                   ACCESS REGISTER 2 SAVE AREA.    @L2A 04488100
STCBAR3  DS    F                   ACCESS REGISTER 3 SAVE AREA.    @L2A 04488300
STCBAR4  DS    F                   ACCESS REGISTER 4 SAVE AREA.    @L2A 04488500
STCBAR5  DS    F                   ACCESS REGISTER 5 SAVE AREA.    @L2A 04488700
STCBAR6  DS    F                   ACCESS REGISTER 6 SAVE AREA.    @L2A 04488900
STCBAR7  DS    F                   ACCESS REGISTER 7 SAVE AREA.    @L2A 04489100
STCBAR8  DS    F                   ACCESS REGISTER 8 SAVE AREA.    @L2A 04489300
STCBAR9  DS    F                   ACCESS REGISTER 9 SAVE AREA.    @L2A 04489500
STCBAR10 DS    F                   ACCESS REGISTER 10 SAVE AREA.   @L2A 04489700
STCBAR11 DS    F                   ACCESS REGISTER 11 SAVE AREA.   @L2A 04489900
STCBAR12 DS    F                   ACCESS REGISTER 12 SAVE AREA.   @L2A 04490100
STCBAR13 DS    F                   ACCESS REGISTER 13 SAVE AREA.   @L2A 04490300
STCBAR14 DS    F                   ACCESS REGISTER 14 SAVE AREA.   @L2A 04490500
STCBAR15 DS    F                   ACCESS REGISTER 15 SAVE AREA.   @L2A 04490700
STCBLSSD DS    A                   VIRTUAL ADDRESS OF THE LSSD     @L2A 04490900
*                                  FOR THE TASK.                        04491100
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04491300
*                                  SERIALIZATION: LOCAL LOCK.           04491400
STCBLSDP DS    A                   LINKAGE STACK ENTRY DESCRIPTOR  @L2A 04491500
*                                  (LSED) POINTER.                      04491700
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04491900
*                                  SERIALIZATION: DISABLEMENT.          04492100
STCBRME  DS    0D                  TASK RELATED RESOURCE MANAGER   @L2A 04492300
*                                  QUEUE POINTERS.                      04492500
*                                  OWNERSHIP: RTM.                      04492700
*                                  SERIALIZATION: LOCAL LOCK.           04492900
STCBRMEF DS    A                   POINTER TO HEAD OF TASK RELATED @L2A 04493100
*                                  RESOURCE MANAGER QUEUE.              04493300
STCBRMEL DS    A                   POINTER TO TAIL OF TASK RELATED @L2A 04494100
*                                  RESOURCE MANAGER QUEUE.              04494300
STCBESTK DS    A                   VIRTUAL ADDRESS OF THE LINKAGE  @L2A 04494500
*                                  STACK ENTRY DESCRIPTOR (LSED)        04494700
*                                  REPRESENTING AN EMPTY LINKAGE        04494900
*                                  STACK.                               04495100
*                                  OWNERSHIP: SUPERVISOR CONTROL.       04495300
*                                  SERIALIZATION: N/A.                  04495400
STCBFLG2 DS    B                   FLAG BYTE                       @L2A 04495900
*                                  OWNERSHIP: RTM,CSV.                  04496400
*                                  SERIALIZATION: LOCAL LOCK.           04496900
STCBRMET EQU   X'80'               IF ON, INDICATES TASK IS IN     @L2A 04497400
*                                  TERMINATION AND NO FURTHER RESOURCE  04497900
*                                  MANAGER REQUESTS WILL BE HONORED.    04498400
STCBINRT EQU   X'40'               The task is processing within RTLS.  04499100
*                                  An IRB must not issue a CSVRTLS      04499800
*                                  request.                        @P9C 04500500
STCBPROP EQU   X'20'               ATTACH is propagating the PKM.  @09A 04500800
STCBFLG3 DS    X                   FLAG BYTE                       @D2A 04501200
*                                  OWNERSHIP: RTM.                      04504000
*                                  SERIALIZATION: TCBACTIV              04506800
STCBNCNL EQU   X'80'               TASK IS NOT SUBJECT TO CANCEL   @D2A 04509600
*                                  OR DETACH.                           04512400
STCBNOAB EQU   X'40'               NCNL EXTENSION                  @PDA 04512600
STCBRTNC EQU   X'20'               ABTERMS OF THIS TASK            @PDC 04512800
*                                  ARE TO BE DEFERRED WHILE RTM2        04513000
*                                  PROCESSING IS ACTIVE                 04513200
STCBNSTP DS    H                   COUNT OF REQUESTS TO IGNORE SRB @P2C 04513500
*                                  TO TASK PERCOLATIONS                 04514600
*                                  OWNERSHIP: RTM.                      04515700
*                                  SERIALIZATION: TCBACTIV              04516800
STCBTLSD DS    A                   ADDRESS OF TASK RELATED LSSD    @D1A 04518000
*                                  FOR THE LINKAGE STACK FROM DREF      04520800
*                                  STORAGE                              04523600
STCBTLSP DS    A                   ADDRESS OF TASK RELATED INITIAL @D1A 04526400
*                                  LSED FOR THE LINKAGE STACK FROM      04529200
*                                  DREF STORAGE                         04532000
STCBTTKN DS    CL16                TTOKEN FOR THIS TASK            @L3A 04534800
*                                  OWNERSHIP: SUPERVISOR CONTROL        04537600
*                                  SERIALIZATION: LOCAL LOCK            04540400
STCBALOC DS    A                   POINTER TO DYNAMIC STORAGE      @D3A 04541300
*                                  BUFFER                               04542200
*                                  OWNERSHIP: ALLOCATION                04543100
*                                  SERIALIZATION: NONE                  04544000
STCBR0A4 DS    XL2                 RESERVED.                       @LGC 04544100
STCBTAFA DS    XL2                 Transient feature affinity.     @LGA 04544200
*                                  SERIALIZATION: TCBACTIV              04544400
*                                  OWNERSHIP: SUPERVISOR CONTROL        04544500
STCBVTME DS    D                   VECTOR TIME.                    @P1C 04544700
*                                  OWNERSHIP: SUPERVISOR CONTROL        04544800
*                                  SERIALIZATION: TCBACTIV              04544900
STCBMEMC DS    F                   Count of XCF members under this @D8C 04545000
*                                  task.                                04545100
*                                  OWNERSHIP: XCF.                      04545400
*                                  SERIALIZATION: Compare-and-Swap.     04545600
STCBXCFF DS    XL1                 XCF FLAG.                       @L4A 04545800
*                                  OWNERSHIP: XCF.                      04546000
*                                  SERIALIZATION: TCBACTIV.             04546200
STCBSUSM EQU   X'80'               Bit flag for use by XCF.        @LAC 04546300
STCBFLG4 DS    XL1                 Flag byte 4.                    @LFA 04546400
STCBENFL EQU   X'80'               If on, indicates task issued    @LFA 04546500
*                                  ENF listen request.                  04546600
*                                  Ownership: ENF.                      04546700
*                                  Serialization: None.                 04546800
STCBFLG5 DS    XL1                 Flag byte 5.                    @LFA 04546900
STCBUNCK EQU   X'80'               If on, user requests no         @LLA 04547000
*                                  checkpoint.                          04547100
*                                  Ownership: Scheduler/Allocation.     04547200
*                                  Serialization: None.                 04547300
STCBENCK EQU   X'40'               If on, checkpoint not honored   @LLA 04547400
*                                  due to environmental constraints.    04547500
*                                  Ownership: Scheduler/Allocation.     04547600
*                                  Serialization: None.                 04547700
STCBOPTC EQU   X'20'               If on, indicates task is        @LMA 04547800
*                                  running under control of the         04547900
*                                  OpenMVS Ptrace debugger.             04548000
*                                  Ownership: OpenMVS.                  04548100
*                                  Serialization: Compare-and-Swap      04548200
STCBFLG6 DS    XL1                 Flag byte 6.                    @LFA 04548300
*                                  Serialization: None                  04548400
STCBSATF  EQU  X'80'               If on, indicates that RACF      @08A 04548500
*                                  should check TCBNCTL in this TCB     04548600
*                                  rather than finding the jobstep TCB  04548700
*                                  when performing program protection.  04548800
STCBDFTS DS    A                   ADDRESS OF THE DFP-SMSX         @L5A 04548900
*                                  STRUCTURE FOR THE TASK.              04549000
*                                  OWNERSHIP: DFP.                      04549100
*                                  SERIALIZATION: NONE                  04549200
STCBJSAB DS    A                   ADDRESS OF JOB SCHEDULER        @D5A 04549300
*                                  ADDRESS SPACE BLOCK.                 04549400
*                                  OWNERSHIP: CONTROLLING JOB           04549500
*                                  SCHEDULER.                           04549600
*                                  SERIALIZATION: SEE MACRO IAZXJSAB.   04549700
STCBTTCB DS    A                   TCPIP STCB Extension            @06A 04549800
*                                  Ownership: TCPIP                     04549900
*                                  Serialization: Compare and Swap      04550000
*                                  when this task is activated as       04550100
*                                  a TCPIP client                       04550200
STCBRGSV DS    0F                  Registration Services           @LPA 04550300
*                                  Indicators                           04550400
*                                  Ownership: Registration Services     04550500
*                                  Serialization: RegServ Lock.         04550600
STCBRGS1 DS    XL1                 First Byte of Indicators        @LPA 04550700
STCBRGRM EQU   X'80'               Task has registered as one or   @LPA 04550800
*                                  more resource managers.              04550900
STCBRGEM EQU   X'40'               Task has registered as one or   @LPA 04551000
*                                  more exit managers.                  04551100
STCBRGS2 DS    XL3                 Unused but reserved by CRG      @LPA 04551200
STCBNTTP DS    A                   Address of task level           @L8A 04551300
*                                  Name/Token header.                   04551400
*                                  Ownership: Supervisor Control.       04552000
*                                  Serialization: Local lock.           04552800
STCBCON# DS    F                   NUMBER OF IXLCONNS IN EFFECT    @L9A 04553400
*                                  FOR THIS TASK.                       04554000
*                                  OWNERSHIP: SYSTEM LOCK MANAGER.      04554600
*                                  SERIALIZATION: TCBACTIV.             04555200
STCBRCTS DS    0F                  REFERENCE PATTERN COUNTS.       @L6A 04556000
*                                  OWNERSHIP: RSM.                      04558400
*                                  SERIALIZATION: RSMAD LOCK FOR THE    04560800
*                                  ADDRESS SPACE OF THE TASK.           04563200
STCBARCT DS    H                   NUMBER OF REFERENCE PATTERNS    @L6A 04565600
*                                  SPECIFIED FOR ADDRESS SPACE VIRTUAL  04568000
*                                  STORAGE.                             04570400
STCBDRCT DS    H                   NUMBER OF REFERENCE PATTERNS    @L6A 04572800
*                                  SPECIFIED FOR DATA SPACE VIRTUAL     04575200
*                                  STORAGE.                             04577600
STCBDFP  DS    XL4                 RESERVED FOR USE BY DFP.        @03A 04578400
*                                  OWNERSHIP: DFP.                      04579200
*                                  SERIALIZATION: LOCAL LOCK.           04580000
STCBOAM  EQU   X'80'               TASK IS A USER OF OAM RESOURCES.@03A 04580800
STCBOTCB DS    A                   Address of OpenMVS Task         @LDA 04580900
*                                  Control Block.                       04581000
*                                  Ownership: OpenMVS.                  04581100
*                                  Serialization: Local lock.           04581200
STCBCDXH DS    A                   ADDRESS OF THE JOB PACK QUEUE   @LCA 04581300
*                                  CDE EXTENSIONS HASH TABLE.           04581400
*                                  OWNERSHIP: CONTENTS SUPERVISOR (CSV) 04581600
*                                  SERIALIZATION: LOCAL LOCK.           04581800
STCBSJST DS    A                   ADDRESS OF THE LOCAL STORAGE    @D7A 04582400
*                                  OBTAINED BY THE SJF CONTROL MODULE.  04584800
*                                  OWNERSHIP: SCHEDULER JCL FACILITY.   04587200
*                                  SERIALIZATION: NONE.                 04589600
STCBATAD DS    A                   Address of the ATTACH SVC in    @P4A 04590200
*                                  the routine which created this task. 04590800
STCBWEB  DS    A                   Address of task's WEB.          @LHC 04591200
*                                  SERIALIZATION: Disablement.          04591600
*                                  OWNERSHIP: Task Management.          04592000
STCBSEQN DS    F                   RB Sequence Number Counter.     @LEA 04592400
*                                  Ownership: Supervisor Control.       04592800
*                                  Serialization: Compare-and-Swap.     04593600
STCBXCNT DS    H                   EXCP count per TCB.             @P5A 04593800
*                                  Ownership: EXCP.                     04594000
*                                  Serialization: Local lock.           04594200
STCBCONS DS    XL1                 Console Flag.                   @LTC 04594300
*                                  Ownership: Consoles.                 04594400
*                                  Serialization: None.                 04594500
STCBWTO  EQU   X'80'               Jobstep TCB issued a WTO        @LTA 04594600
STCBFLG7 DS    XL1                 Flag byte 7.                    @P9C 04594700
STCBRTLS EQU   X'80'               Internal use only               @P9M 04594800
STCBRTLA EQU   X'40'               Internal use only               @P9M 04594900
STCBPECB DS    F                   ECB used internally by RTM      @LJA 04595000
*                                  processing during task termination.  04595100
*                                  Ownership: RTM.                      04595200
*                                  Serialization: Local lock.           04595300
STCBIXGL DS    A                   Pointer to SLC task related     @LKA 04595400
*                                  information.                         04595600
*                                  Ownership: System Logger.            04595800
*                                  Serialization: Local lock.           04596000
STCBDETA DS    A                   Address of Task being Detached by    04596100
*                                  this Task.                      @04A 04596200
*                                  Ownership: Detach                    04596300
*                                  Serialization: Local Lock            04596400
STCBPQUE DS    A                   Address of the next Task that        04596800
*                                  requires Parallel Detach             04597200
*                                  protection                      @07A 04597600
*                                  Ownership: RTM                       04598000
*                                  Serialization: Local Lock            04598400
STCBR104 DS    CL4                 Reserved.                       @07C 04598800
STCBSTSB DS    A                   Address of the STSB (IWMSTSB).  @LNA 04600600
*                                  Ownership: WLM                       04602400
*                                  Serialization: WLMQ lock.            04604200
STCBEUTK DS    CL8                 Execution unit token for this task   04606000
*                                  Ownership: WLM                       04607800
STCBENCR DS    A                   Address of the root task in the      04609600
*                                  current attach chain.  NOTE:  This   04611400
*                                  field is only valid if this task's   04613200
*                                  WEBTYPE=WEBTETCB.                    04615000
*                                  Ownership: Supervisor                04616800
*                                  Serialization: TCBACTIV (executing   04618600
*                                  under task in module IEAVJOIN.) @LOA 04620400
STCBENCC DS    F                   Count of subtasks that have joined   04622200
*                                  the root task's enclave via          04624000
*                                  attach.  NOTE:  This field is only   04625800
*                                  valid for the root tcb (STCBENCR).   04627600
*                                  Also, it is only valid if the root   04629400
*                                  tcb's WEBTYPE is WEBTETCB.           04631200
*                                  Ownership: Supervisor                04633000
*                                  Serialization:  Enclave queue lock.  04634800
*                                                                  @LOC 04636600
STCBDB2  DS    A                   Token used by DB/2.             @P7A 04638400
*                                  Serialization: TCBACTIV              04640200
STCBR120 DS    CL4                 Reserved.                       @PCC 04640600
STCBPMOM DS    CL4                 Address of purge-only Mother Task    04641000
*                                  Ownership: RTM                       04641400
*                                  Serialization: local lock       @PCA 04641800
STCBOFLG DS    CL4                 Openedition flags               @P8A 04642600
STCBBCBA DS    A                   Address of SOMObjects data structure 04642800
*                                  Ownership: SOMObjects for OS/390     04643000
*                                  Serialization: CS               @PAA 04643200
STCBR130 DS    CL4                 Reserved.                       @PBC 04643300
STCBVREQ DS    XL4                 State of outstanding VTAM       @PBA 04643400
*                                  requests for this task.              04643500
*                                  Ownership: VTAM                      04643600
*                                  Serialization: Modified only         04643700
*                                  by VTAM requests running under       04643800
*                                  this task.                           04643900
STCBAFPR DS    CL100               FP save area: 1,3,5,7-15,FPCR   @LSA 04644000
STCBFPFL DS    XL1                 FP Flags                        @LSA 04644100
STCBBFP  EQU   X'80'               Extended FP saving rqd          @LSA 04644200
STCBVSS  EQU   X'10'               Vector status saving. This bit       04644300
*                                  reflects the STCBVISA value, in      04644400
*                                  the same byte as STCBBFP so that     04644600
*                                  the dispatcher can check both with   04644800
*                                  one test                        @LSA 04645000
STCBIPKF DS    XL1                 Initial PKF. This is used to deal    04645100
*                                  with propagating PKM. If you change  04645200
*                                  TCBPKF, you should change STCBIPKF   04645300
*                                  to match if you want PKM             04645400
*                                  propagation.                    @LVA 04645500
STCBIPKM DS    XL2                 Initial PKM. This is used to deal    04645600
*                                  with propagating PKM. If you change  04645700
*                                  TCBPKF, you should change STCBIPKM   04645800
*                                  to match if you want PKM             04645900
*                                  propagation.                    @LVA 04646000
STCBG64H DS    XL64                High halves of 64-bit GPRs      @LWA 04646100
STCBEND  DS    0D                  END OF STCB.                         04646200
         POP   PRINT                                                    04646300
         MEND                                                           04647400
* */                                                                    04650000
*%PLSSTCB2:;                                                            04700000
*                                                                       04750000
*  @LISTPUSH;                                                           04800000
*  %IF IHALIST='YES' %THEN                                              04850000
*     %GOTO STCBLST;                                                    04900000
*  @LISTOFF;                                                            04950000
*  %STCBLST:;                                                           05000000
*                                                                       05050000
*%IF IHAVIA='YES'  %THEN                                     /* @L2A*/  05058300
*   %IHAALET='VIA(STCBALET)' ;                               /* @L2A*/  05066600
* %ELSE                                                      /* @L2A*/  05074900
*     %IHAALET='';                                                      05083200
*                                                                       05091500
* DECLARE                                                               05100000
*   1 STCB BASED(TCBSTCB) IHAALET BDY(DWORD), /* SECONDARY TCB   @L2C*/ 05150000
*     2 STCBEGIN CHAR(0),           /* BEGINNING OF STCB             */ 05200000
*     2 STCBSTCB CHAR(4),           /* ACRONYM IN EBCDIC -STCB-      */ 05250000
*     2 STCBRACP PTR(31),           /* POINTER TO RACF DATA FOR THIS    05254400
*                                      TASK.                            05258800
*                                      OWNERSHIP: RACF.                 05263200
*                                      SERIALIZATION: NONE.      @D6A*/ 05267600
*     2 STCBDIVF PTR(31),           /* POINTER TO 1ST DOA (DIV OBJECT   05272200
*                                      ACCESS CONTROL BLOCK) FOR TCB.   05283300
*                                      OWNERSHIP: DIV.                  05294400
*                                      SERIALIZATION: CML LOCK.  @L1A*/ 05305500
*     2 STCBDIVL PTR(31),           /* POINTER TO LAST DOA FOR TCB.     05316600
*                                      OWNERSHIP: DIV.                  05327700
*                                      SERIALIZATION: CML LOCK.  @L1A*/ 05338800
*     2 STCBAFNS BIT(16),           /* ORIGINAL CPU AFFINITY SAVE AREA  05350000
*                                      USED TO SAVE TCBAFFN          */ 05400000
*     2 STCBCTSC FIXED(16),         /* Number of consecutive dispatches 05450000
*                                      remaining for this task   @LIC*/ 05500000
*     2 STCBVSSA PTR(31),           /* ADDRESS OF VECTOR STATUS         05650000
*                                      SAVE AREA                        05700000
*                                      OWNERSHIP: SUPERVISOR CONTROL    05750000
*                                      SERIALIZATION: LOCAL LOCK TO     05783300
*                                      WRITE  AND TCBACTIV TO READ   */ 05816600
*     2 STCBVAFN CHAR(1),           /* VECTOR AFFINITY AND              05850000
*                                      STATUS SAVED INDICATORS          05900000
*                                      OWNERSHIP: SUPERVISOR CONTROL    05950000
*                                      SERIALIZATION: TASK MODE IS      05975000
*                                      TCBACTIV.                        06000000
*                                      SRB MODE IS LOCAL LOCK        */ 06025000
*       3 STCBVMCK BIT(1),          /* VECTOR STATUS LOST DUE TO        06050000
*                                      MACHINE CHECK                 */ 06100000
*       3 STCBSLID BIT(1),          /* LOGICAL CPU ID MASK           */ 06150000
*       3 STCBVISA BIT(1),          /* VECTOR STATUS SAVED IN VSSA   */ 06200000
*       3 *        BIT(1),          /* RESERVED.                     */ 06225000
*       3 STCBSLCI BIT(4),          /* IF STCBSLID IS ON THEN THIS      06250000
*                                      NIBBLE IS THE PHYSICAL CPU ID */ 06275000
*     2 STCBFLG1 CHAR(1),           /* FLAG BYTE                        06300000
*                                      OWNERSHIP: SUPERVISOR CONTROL    06350000
*                                      SERIALIZATION: TASK MODE IS      06375000
*                                      TCBACTIV.                        06400000
*                                      SRB MODE IS LOCAL LOCK        */ 06425000
*       3 STCBPIQ  BIT(1),          /* INDICATES TO STAGE 3 EXIT        06450000
*                                      EFFECTOR THAT IRB QUEUEING       06500000
*                                      IS PROHIBITED.  USE ONLY FOR     06520100
*                                      ASYMMETRIC FEATURE PROCESSING.*/ 06540200
*       3 STCBVFRV BIT(1),          /* INDICATES THE USER IS NOT RACF   06560400
*                                      AUTHORIZED TO THE VECTOR         06570800
*                                      FACILITY                  @01A*/ 06581200
*       3 STCBVFRD BIT(1),          /* INDICATES THE VECTOR SLIH HAS    06591600
*                                      PERFORMED THE RACF AUTHORIZATION 06602000
*                                      CHECKING                  @01A*/ 06612400
*       3 STCBSST  BIT(1),          /* Indicates that the task is a     06617500
*                                      Subspace task.            @LUA*/ 06622600
*       3 STCBCLUP BIT(1),          /* Cleanup only            991006*/ 06626000
*       3 *        BIT(3),          /* RESERVED.                 @LUC*/ 06629400
*     2 * FIXED(16),                /* Reserved                  @LRC*/ 06632900
*     2 STCBVFRB PTR(31),           /* ADDRESS OF THE RB STOPPED BY     06643600
*                                      THE VECTOR SLIH PENDING VECTOR   06653900
*                                      ENVIRONMENT CREATION.            06664200
*                                      OWNERSHIP: SUPERVISOR CONTROL    06674800
*                                      SERIALIZATION: DISP LOCK      */ 06683100
*     2 STCBALOV PTR(31),           /* WORK UNIT ACCESS LISTS           06683200
*                                      VIRTUAL ADDRESS.                 06683300
*                                      OWNERSHIP: PC/AUTH.              06683400
*                                      SERIALIZATION: TCBACTIV.  @L2C*/ 06683500
*     2 STCBALD  PTR(31),           /* WORK UNIT ACCESS LIST            06683600
*                                      DESIGNATOR.                      06683700
*                                      BITS 1-24 WITH SEVEN ZEROES      06683800
*                                      APPENDED ON THE RIGHT FORM THE   06683900
*                                      31-BIT REAL ADDRESS OF THE       06684000
*                                      WORKUNIT'S ACCESS LIST.          06684100
*                                      BITS 25-31 REPRESENT THE NUMBER  06684200
*                                      OF 128 BYTE ACCESS LISTS, MINUS  06684300
*                                      ONE.                             06684400
*                                      OWNERSHIP: PC/AUTH.              06684500
*                                      SERIALIZATION: TCBACTIV.  @L2C*/ 06684600
*     2 STCBDUCV PTR(31),           /* VIRTUAL ADDRESS OF THE DUCT.     06684700
*                                      OWNERSHIP: SUPERVISOR CONTROL    06684800
*                                      SERIALIZATION: TCBACTIV.  @L2C*/ 06684900
*     2 STCBDUCR PTR(31),           /* REAL ADDRESS OF THE DUCT.        06685000
*                                      OWNERSHIP: SUPERVISOR CONTROL    06685100
*                                      SERIALIZATION: TCBACTIV.  @L2A*/ 06685200
*     2 STCBARS  CHAR(64) BDY(WORD), /* ACCESS REGISTER SAVEAREA.       06685300
*                                      OWNERSHIP: SUPERVISOR CONTROL    06685400
*                                      SERIALIZATION: DISABLEMENT.      06685500
*                                                                @L2A*/ 06685600
*       3 STCBAR0    FIXED(32),     /* ACCESS REGISTER 0 SAVE AREA      06685700
*                                                                @L2A*/ 06685800
*       3 STCBAR1    FIXED(32),     /* ACCESS REGISTER 1 SAVE AREA      06685900
*                                                                @L2A*/ 06686000
*       3 STCBAR2    FIXED(32),     /* ACCESS REGISTER 2 SAVE AREA      06686100
*                                                                @L2A*/ 06686200
*       3 STCBAR3    FIXED(32),     /* ACCESS REGISTER 3 SAVE AREA      06686300
*                                                                @L2A*/ 06686400
*       3 STCBAR4    FIXED(32),     /* ACCESS REGISTER 4 SAVE AREA      06686500
*                                                                @L2A*/ 06686600
*       3 STCBAR5    FIXED(32),     /* ACCESS REGISTER 5 SAVE AREA      06686700
*                                                                @L2A*/ 06686800
*       3 STCBAR6    FIXED(32),     /* ACCESS REGISTER 6 SAVE AREA      06686900
*                                                                @L2A*/ 06687000
*       3 STCBAR7    FIXED(32),     /* ACCESS REGISTER 7 SAVE AREA      06687100
*                                                                @L2A*/ 06687200
*       3 STCBAR8    FIXED(32),     /* ACCESS REGISTER 8 SAVE AREA      06687300
*                                                                @L2A*/ 06687400
*       3 STCBAR9    FIXED(32),     /* ACCESS REGISTER 9 SAVE AREA      06687500
*                                                                @L2A*/ 06687600
*       3 STCBAR10   FIXED(32),     /* ACCESS REGISTER 10 SAVE AREA     06687700
*                                                                @L2A*/ 06687800
*       3 STCBAR11   FIXED(32),     /* ACCESS REGISTER 11 SAVE AREA     06687900
*                                                                @L2A*/ 06688000
*       3 STCBAR12   FIXED(32),     /* ACCESS REGISTER 12 SAVE AREA     06688100
*                                                                @L2A*/ 06688200
*       3 STCBAR13   FIXED(32),     /* ACCESS REGISTER 13 SAVE AREA     06688300
*                                                                @L2A*/ 06688400
*       3 STCBAR14   FIXED(32),     /* ACCESS REGISTER 14 SAVE AREA     06688500
*                                                                @L2A*/ 06688600
*       3 STCBAR15   FIXED(32),     /* ACCESS REGISTER 15 SAVE AREA     06688700
*                                                                @L2A*/ 06688800
*     2 STCBLSSD PTR(31),           /* VIRTUAL ADDRESS OF THE LSSD FOR  06688900
*                                      THE TASK.                        06689000
*                                      OWNERSHIP: SUPERVISOR CONTROL    06689100
*                                      SERIALIZATION: LOCAL LOCK.       06689200
*                                                                @L2A*/ 06689300
*     2 STCBLSDP PTR(31),           /* LINKAGE STACK ENTRY DESCRIPTOR   06689400
*                                      (LSED) POINTER.                  06689500
*                                      OWNERSHIP: SUPERVISOR CONTROL    06689600
*                                      SERIALIZATION: DISABLEMENT.      06689700
*                                                                @L2A*/ 06689800
*     2 STCBRME  BIT(64) BDY(DWORD), /* TASK RELATED RESOURCE MANAGER   06689900
*                                       QUEUE POINTERS.                 06690000
*                                       OWNERSHIP: RTM.                 06690100
*                                       SERIALIZATION: LOCAL LOCK.      06690200
*                                                                @L2A*/ 06690300
*       3 STCBRMEF PTR(31),         /* POINTER TO HEAD OF TASK RELATED  06690400
*                                      RESOURCE MANAGER QUEUE.   @L2A*/ 06690500
*       3 STCBRMEL PTR(31),         /* POINTER TO TAIL OF TASK RELATED  06690900
*                                      RESOURCE MANAGER QUEUE.   @L2A*/ 06691000
*     2 STCBESTK PTR(31),           /* VIRTUAL ADDRESS OF THE LINKAGE   06691100
*                                      STACK ENTRY DESCRIPTOR (LSED)    06691200
*                                      REPRESENTING AN EMPTY LINKAGE    06691300
*                                      STACK.                           06691400
*                                      OWNERSHIP: SUPERVISOR CONTROL    06691500
*                                      SERIALIZATION: N/A.       @L2A*/ 06691600
*     2 STCBFLG2 CHAR(1),           /* FLAG BYTE                        06692300
*                                      OWNERSHIP: RTM,CSV.              06693000
*                                      SERIALIZATION: LOCAL LOCK.       06693700
*                                                                @L2A*/ 06694400
*         4 STCBRMET  BIT(1),       /* IF ON, INDICATES TASK IS IN      06695100
*                                      TERMINATION AND NO FURTHER       06695800
*                                      RESOURCE MANAGER REQUESTS WILL   06696500
*                                      BE HONORED.               @L2A*/ 06697200
*         4 STCBINRT BIT(1),        /* If on, indicates that this task  06697300
*                                      is processing within RTLS.       06697400
*                                      An IRB must not issue a CSVRTLS  06697500
*                                      request.                         06697600
*                                      Ownership: CSV                   06697700
*                                      Serialization: Local Lock @LQA*/ 06697800
*         4 STCBPROP BIT(1),        /* ATTACH is propagating the PKM.   06697900
*                                                                @09A*/ 06698000
*         4 *         BIT(5),       /* RESERVED.                 @09C*/ 06698100
*     2 STCBFLG3 CHAR(1),           /* FLAG BYTE                        06698200
*                                      OWNERSHIP: RTM.                  06698300
*                                      SERIALIZATION: TCBACTIV   @D2A*/ 06698400
*         4 STCBNCNL  BIT(1),       /* TASK IS NOT SUBJECT TO           06698500
*                                      CANCEL OR DETACH.         @D2A*/ 06698600
*         4 STCBNOAB  BIT(1),       /* NCNL extension            @PDC*/ 06698700
*         4 STCBRTNC  BIT(1),       /* ABTERMS OF THIS TASK             06698800
*                                      ARE TO BE DEFERRED WHILE RTM2    06698900
*                                      PROCESSING IS ACTIVE.     @PDC*/ 06699000
*         4 *         BIT(5),       /* RESERVED.                 @PDC*/ 06699100
*     2 STCBNSTP FIXED(15),         /* COUNT OF REQUESTS TO IGNORE SRB  06699200
*                                      TO TASK PERCOLATIONS             06699300
*                                      OWNERSHIP: RTM.                  06699400
*                                      SERIALIZATION: TCBACTIV   @P2C*/ 06699500
*     2 STCBTLSD PTR(31),           /* ADDRESS OF TASK RELATED LSSD     06699600
*                                      FOR THE LINKAGE STACK FROM       06699700
*                                      DREF STORAGE              @D1A*/ 06699800
*     2 STCBTLSP PTR(31),           /* ADDRESS OF TASK RELATED INITIAL  06699900
*                                      LSED FOR THE LINKAGE STACK FROM  06700000
*                                      DREF STORAGE              @D1A*/ 06700100
*     2 STCBTTKN CHAR(16),          /* TTOKEN FOR THIS TASK             06700200
*                                      OWNERSHIP: SUPERVISOR CONTROL    06700300
*                                      SERIALIZATION: LOCAL LOCK @L3A*/ 06700400
*     2 STCBALOC PTR(31),           /* POINTER TO DYNAMIC STORAGE       06700500
*                                      BUFFER     OWNERSHIP: ALLOCATION 06700600
*                                      SERIALIZATION: NONE       @D3A*/ 06700700
*     2 STCBR0A4 CHAR(2),           /* RESERVED.                 @LGC*/ 06701500
*     2 STCBTAFA CHAR(2),           /* Transient Feature Affinity.      06702600
*                                      SERIALIZATION: TCBACTIV          06703700
*                                      OWNERSHIP: SUPERVISOR CONTROL    06704800
*                                                                @LGA*/ 06705900
*     2 STCBVTME CHAR(8),           /* VECTOR TIME.                     06707200
*                                      OWNERSHIP: SUPERVISOR CONTROL    06710900
*                                      SERIALIZATION: TCBACTIV   @D4A*/ 06712600
*     2 STCBMEMC  FIXED(31),        /* Count of XCF members under this  06714300
*                                      task.                            06716000
*                                      OWNERSHIP: XCF.                  06717700
*                                      SERIALIZATION: Compare-and-Swap. 06718800
*                                                                @D8C*/ 06719900
*     2 STCBXCFF CHAR(1),           /* XCF FLAG.                        06721100
*                                      OWNERSHIP: XCF.                  06722800
*                                      SERIALIZATION: TCBACTIV.  @L4A*/ 06724500
*         4  STCBSUSM BIT(1),       /* Bit flag for use by XCF.  @LAC*/ 06728700
*         4  *        BIT(7),       /* RESERVED FOR XCF.         @L4A*/ 06733000
*     2 STCBFLG4 CHAR(1),           /* Flag byte 4.              @LFA*/ 06733500
*         4  STCBENFL BIT(1),       /* If on, indicates task issued     06734000
*                                      ENF listen request.              06734500
*                                      Ownership: ENF.                  06735000
*                                      Serialization: None.      @LFA*/ 06735500
*     2 STCBFLG5 CHAR(1),           /* Flag byte 5.              @LFA*/ 06736000
*         4  STCBUNCK BIT(1),       /* If on, user requests no          06736100
*                                      checkpoint.                      06736200
*                                      Ownership: Scheduler/Allocation. 06736300
*                                      Serialization: None.      @LLA*/ 06736400
*         4  STCBENCK BIT(1),       /* If on, checkpoint not honored    06736500
*                                      due to environmental             06736600
*                                      constraints.                     06736700
*                                      Ownership: Scheduler/Allocation. 06736800
*                                      Serialization: None.      @LLA*/ 06736900
*         4  STCBOPTC BIT(1) ABNL,  /* If on, indicates task is running 06738800
*                                      under control of the OpenMVS     06740700
*                                      Ptrace debugger.                 06742600
*                                      Ownership: OpenMVS.              06744500
*                                      Serialization: Compare-and-Swap. 06746400
*                                                                @LMA*/ 06748300
*         4  *        BIT(5),       /* Reserved.                 @LMC*/ 06750200
*     2 STCBFLG6 CHAR(1),           /* Flag byte 6.                     06750600
*                                      Serialization: None       @P9C*/ 06751000
*         4  STCBSATF BIT(1),       /* If on, indicates that RACF       06751400
*                                      should check TCBNCTL in this TCB 06751800
*                                      rather than finding the jobstep  06752200
*                                      TCB when performing program      06752600
*                                      protection.               @08A*/ 06753000
*         4  *        BIT(7),       /* Reserved.                 @08A*/ 06753400
*     2 STCBDFTS PTR(31),           /* ADDRESS OF THE DFP-SMSX          06754000
*                                      STRUCTURE FOR THE TASK.          06756000
*                                      OWNERSHIP: DFP.                  06763400
*                                      SERIALIZATION: NONE       @L5A*/ 06770800
*     2 STCBJSAB PTR(31),           /* ADDRESS OF JOB SCHEDULER ADDRESS 06778200
*                                      SPACE BLOCK.                     06785600
*                                      OWNERSHIP: CONTROLLING JOB       06793000
*                                      SCHEDULER.                       06800400
*                                      SERIALIZATION: SEE MACRO         06807800
*                                      IAZXJSAB.                 @D5A*/ 06815200
*     2 STCBTTCB PTR(31),           /* TCPIP STCB Extension             06815300
*                                      Ownership: TCPIP                 06815400
*                                      Serialization: Compare and Swap  06815500
*                                      when this task is activated as   06815600
*                                      a TCPIP client            @06A*/ 06815700
*     2 STCBRGSV CHAR(4),           /*  Registration Services           06815800
*                                      Indicators                       06815900
*                                      Ownership: Registration Services 06816000
*                                      Serialization: RegServ Lock.     06816100
*                                                                @LPA*/ 06816200
*       3  STCBRGS1 BIT(8),         /*  First Byte of Indicators @LPA*/ 06816300
*          4  STCBRGRM  BIT(1),     /*  Task has registered as one or   06816400
*                                       more resource managers   @LPA*/ 06816500
*          4  STCBRGEM  BIT(1),     /*  Task has registered as one or   06816600
*                                       more exit managers       @LPA*/ 06816700
*          4  * BIT(6),             /*                           @LPA*/ 06816800
*       3  STCBRGS2 CHAR(3),        /*                           @LPA*/ 06816900
*     2 STCBNTTP PTR(31),           /* Address of task level Name/Token 06817000
*                                      header.                          06817100
*                                      Ownership: Supervisor Control.   06817200
*                                      Serialization: Local lock @L8A*/ 06817300
*     2 STCBCON#  FIXED(31),        /* NUMBER OF IXLCONNS IN EFFECT     06817400
*                                      FOR THIS TASK.                   06817500
*                                      OWNERSHIP: SYSTEM LOCK MANAGER.  06817600
*                                      SERIALIZATION: TCBACTIV   @L9A*/ 06817700
*     2 STCBRCTS FIXED(32),         /* REFERENCE PATTERN COUNTS.        06817800
*                                      OWNERSHIP: RSM.                  06818000
*                                      SERIALIZATION: RSMAD LOCK FOR    06818700
*                                      THE ADDRESS SPACE OF THE TASK.   06819400
*                                                                @L6A*/ 06820100
*         4  STCBARCT FIXED(16),    /* NUMBER OF REFERENCE PATTERNS     06820800
*                                      SPECIFIED FOR ADDRESS SPACE      06821500
*                                      VIRTUAL STORAGE.          @L6A*/ 06822200
*         4  STCBDRCT FIXED(16),    /* NUMBER OF REFERENCE PATTERNS     06822900
*                                      SPECIFIED FOR DATA SPACE VIRTUAL 06823600
*                                      STORAGE.                  @L6A*/ 06824300
*     2 STCBDFP  BIT(32),           /* RESERVED FOR USE BY DFP.         06824500
*                                      OWNERSHIP: DFP.                  06824700
*                                      SERIALIZATION: LOCAL LOCK.@03A*/ 06824900
*       3 STCBOAM BIT(1) ABNORMAL,  /* TASK IS A USER OF OAM RESOURCES. 06825100
*                                                                @03A*/ 06825300
*     2 STCBOTCB PTR(31),           /* Address of OpenMVS Task Control  06825400
*                                      Block.                           06825500
*                                      Ownership: OpenMVS.              06825600
*                                      Serialization: Local lock @LDA*/ 06825700
*     2 STCBCDXH PTR(31),           /* ADDRESS OF THE JOB PACK QUEUE    06825800
*                                      CDE EXTENSIONS HASH TABLE.       06825900
*                                      OWNERSHIP: CONTENTS SUPERVISOR   06826000
*                                      (CSV).                           06826100
*                                      SERIALIZATION: LOCAL LOCK @LCA*/ 06826200
*     2 STCBSJST PTR(31),           /* ADDRESS OF THE LOCAL STORAGE     06826300
*                                      OBTAINED BY THE SJF CONTROL      06826400
*                                      MODULE.                          06827100
*                                      OWNERSHIP: SCHEDULER JCL         06827800
*                                                 FACILITY.             06828500
*                                      SERIALIZATION: NONE.      @D7A*/ 06829200
*     2 STCBATAD PTR(31),           /* Address of the ATTACH SVC in     06829300
*                                      the routine which created        06829400
*                                      this task.                @P4A*/ 06829500
*     2 STCBWEB  PTR(31),           /* Address of task's WEB.           06829600
*                                      Ownership: Task Management.      06829700
*                                      Serialization: Disablement.      06829800
*                                                                @LHC*/ 06829900
*     2 STCBSEQN FIXED(32),         /* RB Sequence Number Counter.      06830000
*                                      Ownership: Supervisor Control.   06830100
*                                      Serialization: Compare-and-Swap. 06830200
*                                                                @LEA*/ 06831600
*     2 STCBXCNT FIXED(15),         /* EXCP count per TCB.              06833000
*                                      Ownership: EXCP.                 06834400
*                                      Serialization: Local lock.       06835800
*                                                                @P5A*/ 06837200
*     2 STCBCONS CHAR(1),           /* Console Flag.                    06837300
*                                      Ownership: Consoles.             06837400
*                                      Serialization: None.      @LTC*/ 06837500
*         4  STCBWTO BIT(1),        /* Jobstep TCB issued a WTO  @LTA*/ 06837600
*         4  *       BIT(7),        /* Reserved.                 @LTA*/ 06837700
*     2 STCBFLG7 CHAR(1),           /* Flag byte 7.                     06837800
*                                      Ownership: CSV            @P9A*/ 06837900
*         4  STCBRTLS BIT(1),       /* If on, indicates that this task  06838000
*                                      needs RTLS cleanup processing.   06838200
*                                                                @P9M*/ 06838400
*         4  STCBRTLA BIT(1),       /* If on, indicates that this task  06838600
*                                      has created an alias for an      06838800
*                                      RTLS CDE. It therefore needs     06839000
*                                      additional processing on         06839200
*                                      disconnect.               @P9M*/ 06839400
*     2 STCBPECB FIXED(31),         /* ECB used internally by RTM       06840000
*                                      processing during task           06841400
*                                      termination.                     06842800
*                                      Ownership: RTM.                  06844200
*                                      Serialization: Local lock @LJA*/ 06845600
*     2 STCBIXGL PTR(31),           /* Pointer to SLC task related      06846000
*                                      information.                     06846400
*                                      Ownership: System Logger.        06846800
*                                      Serialization: Local lock @LKA*/ 06847200
*     2 STCBDETA PTR(31),           /* Address of Task being Detached   06847400
*                                      by this Task.                    06847600
*                                      Ownership: Detach                06847800
*                                      Serialization: Local Lock @04A*/ 06848000
*     2 STCBPQUE PTR(31),           /* Address of the next Task that    06848200
*                                      requires Parallel Detach         06848400
*                                      protection                       06848600
*                                      Ownership: RTM                   06848800
*                                      Serialization: Local Lock @07A*/ 06849000
*     2 STCBR104 CHAR(4),           /* Reserved.                 @07C*/ 06849200
*     2 STCBSTSB PTR(31),           /* Address of the STSB (IWMSTSB).   06899200
*                                      Ownership: WLM                   06949200
*                                      Serialization: WLMQ Lock  @LNA*/ 06999200
*     2 STCBEUTK CHAR(8),           /* Execution unit token for this    07049200
*                                      task.                            07099200
*                                      Ownership: WLM                   07149200
*                                      Serialization: WLMQ lock. @LNA*/ 07199200
*     2 STCBENCR PTR(31),           /* Address of the root task in the  07249200
*                                      current attach chain.  NOTE:     07299200
*                                      This field is only valid if      07349200
*                                      this task's WEBTYPE=WEBTETCB.    07399200
*                                      Ownership: Supervisor            07449200
*                                      Serialization:  TCBACTIV         07499200
*                                      (executing under task in module  07549200
*                                      IEAVJOIN.)                @LOA*/ 07599200
*     2 STCBENCC FIXED(32),         /* Count of subtasks that have      07649200
*                                      joined the root task's enclave   07699200
*                                      via attach.  NOTE:  This field   07749200
*                                      is only valid for the root tcb   07799200
*                                      (STCBENCR).  Also, it is only    07849200
*                                      valid if the root tcb's WEBTYPE= 07899200
*                                      WEBTETCB.                        07949200
*                                      Ownership:Supervisor             07999200
*                                      Serialization:  Enclave queue    08049200
*                                      lock.                     @LOA*/ 08099200
*     2 STCBDB2  PTR(31),           /* Token used by DB2.               08149200
*                                      Serialization: TCBACTIV   @P7A*/ 08199200
*     2 STCBR120 CHAR(4),           /* Reserved.                 @PCC*/ 08210300
*     2 STCBPMOM PTR(31),           /* Address of purge-only Mother     08221400
*                                      Task                             08232500
*                                      Ownership: RTM                   08243600
*                                      Serialization: local lock @PCA*/ 08254700
*     2 STCBOFLG CHAR(4),           /* Openedition flags         @P8A*/ 08265800
*     2 STCBBCBA PTR(31),           /* Address of SOMObjects data       08271300
*                                      structure                        08276800
*                                      Ownership: SOMObjects for OS/390 08282300
*                                      Serialization: CS         @PAA*/ 08287800
*     2 STCBR130 CHAR(4),           /* Reserved.                 @PBC*/ 08288500
*     2 STCBVREQ BIT(32),           /* State of outstanding VTAM        08289200
*                                      requests for this task.          08289900
*                                      Ownership: VTAM                  08290600
*                                      Serialization: Modified only     08291300
*                                      by VTAM requests running under   08292000
*                                      this task.                @PBA*/ 08292700
*     2 STCBAFPR CHAR(100) BDY(WORD),  /* AFPRS                  @LSA*/ 08293500
*   %IF SYSVERSION='' %THEN %GOTO STCBPLS1;           /*         @LSA*/ 08293700
*   %IF SYSRULESMOD='PL/S-III' %THEN %GOTO STCBPLS1;  /*         @LSA*/ 08293900
*       3 STCBFPR1 CHAR(8),         /* FP save area: 1           @LSA*/ 08294100
*       3 STCBFPR3 CHAR(8),         /* FP save area: 3           @LSA*/ 08294300
*       3 STCBFPR5 CHAR(8),         /* FP save area: 5           @LSA*/ 08294500
*       3 STCBFPR7TO15,             /* FP save area: 7-15        @LSA*/ 08294700
*         5 STCBFPR7 CHAR(8),       /* FP save area: 7           @LSA*/ 08294900
*         5 STCBFPR8 CHAR(8),       /* FP save area: 8           @LSA*/ 08295100
*         5 STCBFPR9 CHAR(8),       /* FP save area: 9           @LSA*/ 08295300
*         5 STCBFPR10 CHAR(8),      /* FP save area: 10          @LSA*/ 08295500
*         5 STCBFPR11 CHAR(8),      /* FP save area: 11          @LSA*/ 08295700
*         5 STCBFPR12 CHAR(8),      /* FP save area: 12          @LSA*/ 08295900
*         5 STCBFPR13 CHAR(8),      /* FP save area: 13          @LSA*/ 08296100
*         5 STCBFPR14 CHAR(8),      /* FP save area: 14          @LSA*/ 08296300
*         5 STCBFPR15 CHAR(8),      /* FP save area: 15          @LSA*/ 08296500
*       3 STCBFPCR CHAR(4) BDY(WORD), /* FPCR save area          @LSA*/ 08296700
*   %STCBPLS1:;                                       /*         @LSA*/ 08296900
*     2 STCBFPFL BIT(8),            /* FP FLags                  @LSA*/ 08297100
*       3 STCBBFP BIT(1),           /* Extended FP saving rqd    @LSA*/ 08297300
*       3 *       BIT(2),           /* Unused                    @LSA*/ 08297400
*       3 STCBVSS BIT(1),           /* Vector status saving. This bit   08297600
*                                  reflects the STCBVISA value, in the  08297700
*                                  same byte as STCBBFP so that the     08297800
*                                  dispatcher can check both with one   08297900
*                                  test.                         @LSA*/ 08298000
*     2 STCBIPKF FIXED(8),          /* Initial PKF. This is used to     08298100
*                                  deal with propagating PKM. If you    08298200
*                                  change TCBPKF, you should change     08298300
*                                  STCBIPKF to match if you want PKM    08298400
*                                  propagation.                  @LVA*/ 08298500
*     2 STCBIPKM CHAR(2),           /* Initial PKM. This is used to     08298600
*                                  deal with propagating PKM. If you    08298700
*                                  change TCBPKF, you should change     08298800
*                                  STCBIPKM to match if you want        08298900
*                                  propagation.                  @LVA*/ 08299000
*     2 STCBG64H CHAR(64),          /* GPR bits 0-31 save area   @LWA*/ 08299100
*     2 STCBEND CHAR(0) BDY(DWORD); /* END OF STCB.                  */ 08299200
*  @LISTPOP;                                                            08349200
