*        %GOTO PLSSSRB;                                              /* 00050000
         MACRO                                                          00100000
         IHASSRB &LIST=NO                                          @L2C 00150000
**/                                                                     00200000
*%PLSSSRB :  ;                                                          00250000
*/* START OF SPECIFICATIONS ******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* PROPRIETARY STATEMENT =                                   @LAC*/ 00400000
*/*                                                                  */ 00800000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00886600
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00887000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                 */ 00887400
*/*                                                                  */ 00887800
*/*01* STATUS:  HBB7703                                              */ 00890600
*/*                                                                  */ 00893400
*/*01* DESCRIPTIVE NAME:  Suspended Service Request Block            */ 00894700
*/*02*  ACRONYM:  SSRB                                               */ 00896000
*/*                                                                  */ 00896300
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 00896600
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00896900
*/*                                                                  */ 00897400
*/*01* MACRO-NAME:  IHASSRB                                          */ 00897700
*/*                                                                  */ 00898000
*/*01* DSECT NAME:                                                   */ 00898900
*/*     SSRBSECT                                                     */ 00899800
*/*                                                                  */ 00900700
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 00901600
*/*                                                                  */ 00902500
*/*01* EYE-CATCHER:  SSRB                                            */ 00903400
*/*02*  OFFSET:  0                                                   */ 00904300
*/*02*  LENGTH:  4                                                   */ 00905200
*/*                                                                  */ 00906100
*/*01* STORAGE ATTRIBUTES:                                           */ 00907000
*/*02*  SUBPOOL:  239                                                */ 00907900
*/*02*  KEY:  0                                                      */ 00908800
*/*02*  RESIDENCY:  Above 16M line                                   */ 00909700
*/*                                                                  */ 00910600
*/*01* SIZE:  1432 bytes                                             */ 00911500
*/*                                                                  */ 00912400
*/*01* CREATED BY:                                                   */ 00913300
*/*     IEAVESPM (SRB/SSRB Pool Management)                          */ 00914200
*/*                                                                  */ 00915100
*/*01* POINTED TO BY:                                                */ 00916000
*/*     SPL or service management queues                             */ 00916900
*/*         ASCBLSMQ field of the ASCB data area                     */ 00917800
*/*         ASCBLSPL field of the ASCB data area                     */ 00918700
*/*         SRBFLNK field of the SRB data area                       */ 00919600
*/*         SVTGSMQ field of the SVT data area                       */ 00920500
*/*         SVTGSPL field of the SVT data area                       */ 00921400
*/*         SVTLSMQ field of the SVT data area                       */ 00922300
*/*         SVTSSRBA field of the SVT data area                      */ 00923200
*/*                                                                  */ 00924100
*/*01* SERIALIZATION:                                                */ 00925000
*/*     Owner-serialized.                                            */ 00925900
*/*                                                                  */ 00926800
*/*01* FUNCTION:                                                     */ 00927700
*/*02*  Used to save PSW, registers, and FRR stack when an SRB has   */ 00928600
*/*     to be suspended for a page fault or locking purposes.        */ 00929500
*/*01* METHOD OF ACCESS:                                             */ 00930400
*/*02*  ASM:                                                         */ 00931300
*/*      DSECT is always produced.                                   */ 00932200
*/*      USING on SSRB gives Addressability for all symbols.         */ 00933100
*/*      Specify LIST=YES on Macro call for listing.                 */ 00934000
*/*02*  PL/AS:                                                       */ 00934900
*/*      Is Based on SRBPTR.                                         */ 00935800
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 00936700
*/*                                                                  */ 00937600
*/*01* DEPENDENCIES:                                                 */ 00938500
*/*      None.                                                       */ 00939400
*/*                                                                  */ 00940300
*/*01* DISTRIBUTION LIBRARY:  APVTMACS                               */ 00941200
*/*                                                                  */ 00942100
*/*01* CHANGE ACTIVITY:                                              */ 00943000
*/*  $L4=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 00943900
*/*                                                                  */ 00944800
*/* END OF SPECIFICATIONS ********************************************/ 00945700
*        %GOTO PLSSSRB1;                       /*                       00950000
.*********************************************************************  00953800
.*    CHANGE ACTIVITY =                                                 00957600
.*    G860PXX - HBB2102 SUPPORT                                         00961400
.*  $L1=RASENH   JBB2220  840618  PD16XK:  RAS ENHANCEMENTS FOR RTM     00965200
.*  $L2=AR       HBB3310  850903  PD16Q9:  ACCESS REGISTERS             00969000
.*  $L3=LOCKR    HBB4410  870622  PD16Q9:  LOCK RESTRUCTURE             00970900
.*  $01=OY27050  JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC        00971200
.*                                         FEATURE SUPPORT              00971500
.*  $L4=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete      00971700
.*  $L5=APPC1    HBB4420  900122  PD16EJ:  SCHEDULE WITH ADDRESSABILITY 00971900
.*  $P1=PH32022  HBB4420  910201  PD16EJ:  SRBs Suspended with Token    00972100
.*                                         must not persistent across   00972300
.*                                         job step task termination.   00972500
.*  $P2=PKB0125  HBB4430  911101  PD16ES:  LSSA Support                 00972600
.*  $L6=DISPR    HBB5510  930601  PD16AG:  Dispatcher Restructure       00972700
.*  $L7=ENCLV    HBB5520  931109  PD16EI:  ENCLAVE Support              00973400
.*                                         Added SSRBTYPE, SSRBNTMR     00974100
.*                                         Removed SSRBLSA2, SSRBLSSA   00974800
.*  $L8=ENCLV    HBB5520  940210  PD16AA:  ENCLAVE Support - comment    00975400
.*                                         change                       00976000
.*  $D1=DQC0009  HBB6603  951211  B7HGEJ:  SYNCH(YES) Support           00976300
.*  $02=OW20060  HBB5520  960329  B7VBXZ:  SRB SUSPEND with token       00977100
.*                                         performance improvement.     00977900
.*                                         Add SSRBFLGS and SSRBTOKN.   00978700
.*  $L9=T6SVCSUP JBB6604  961101  PD00XB:  T6SVC suspend support        00979100
.*  $LA=IEEESUP  HBB6606  970807  PD00XB:  FP simulation                00979300
.*  $03=OW32277  HBB5520  980319  R4GAXZ:  Delete SSRBTOKN.             00979500
.*                                         When rolled up into HBB6606, 00979700
.*                                         SSRBFLGS was also deleted.   00979900
.*  $LB=64BITSUP HBB6607  971101  PD00XB:  64-bit GPRs                  00980000
.*********************************************************************  00980100
         PUSH  PRINT                                                    00980400
         AIF   ('&LIST' EQ 'YES').SSRBLST                               00984200
         PRINT OFF                                                      00988000
.SSRBLST ANOP                                                           00991800
.*                                                                      00995600
         IHASRB                                                         01000000
SSRBSECT EQU   SRBSECT                 SET LABEL TO BEGINNING           01050000
         DS    F                       RESERVED                @G381PXU 01100000
SSRB     DS    0D                      START OF SAVE AREA PORTION       01150000
SSRBFPRS DS    0CL32                   FLOATING POINT REG SAVE @G50DPXE 01200000
SSRBFPR0 DS    D                       FLOATING POINT REG 0    @G50DPXE 01250000
SSRBFPR2 DS    D                       FLOATING POINT REG 2    @G50DPXE 01300000
SSRBFPR4 DS    D                       FLOATING POINT REG 4    @G50DPXE 01350000
SSRBFPR6 DS    D                       FLOATING POINT REG 6    @G50DPXE 01400000
SSRBTRAN DS    F                       PAGE FAULT ADDR(FLIH)   @G50DPXE 01450000
SSRBSAFN DS    BL2                     SAVED AFFINITY              @01A 01468500
SSRBTYPE DS    BL1                     Savearea for WEBTYPE when   @L7A 01473700
*                                      PSRBs, ESRBs or CSRBs are        01478900
*                                      suspended or STOPped.            01484100
*                                      Ownership: Supervisor Control    01489300
*                                      Serialization: WEBLOCK of the    01492700
*                                      WEB associated with this SSRB    01496100
SSRBR057 DS    CL1                     RESERVED.                   @03C 01500800
SSRBGPRS DS    0CL64                   GENERAL REGISTER SAVE       @L5C 01505500
SSRBGPR0 DS    F                       GENERAL REGISTER 0          @L5A 01511000
SSRBGPR1 DS    F                       GENERAL REGISTER 1          @L5A 01516500
SSRBGPR2 DS    F                       GENERAL REGISTER 2          @L5A 01522000
SSRBGPR3 DS    F                       GENERAL REGISTER 3          @L5A 01527500
SSRBGPR4 DS    F                       GENERAL REGISTER 4          @L5A 01533000
SSRBGPR5 DS    F                       GENERAL REGISTER 5          @L5A 01538500
SSRBGPR6 DS    F                       GENERAL REGISTER 6          @L5A 01544000
SSRBGPR7 DS    F                       GENERAL REGISTER 7          @L5A 01549500
SSRBGPR8 DS    F                       GENERAL REGISTER 8          @L5A 01555000
SSRBGPR9 DS    F                       GENERAL REGISTER 9          @L5A 01560500
SSRBGPRA DS    F                       GENERAL REGISTER 10         @L5A 01566000
SSRBGPRB DS    F                       GENERAL REGISTER 11         @L5A 01571500
SSRBGPRC DS    F                       GENERAL REGISTER 12         @L5A 01577000
SSRBGPRD DS    F                       GENERAL REGISTER 13         @L5A 01582500
SSRBGPRE DS    F                       GENERAL REGISTER 14         @L5A 01588000
SSRBGPRF DS    F                       GENERAL REGISTER 15         @L5A 01593500
SSRBCPSW DS    D                       VALUE OF CURRENT PSW    @G381PXU 01600000
SSRBCPUT DS    D                       CPU TIMER SAVEAREA      @G50DPXE 01650000
SSRBNTMR EQU   X'80'                   When set, this SSRB doesn't @L7A 01660000
*                                      have any SRB Timer set.  Only    01670000
*                                      meaningful for preemptable-class 01680000
*                                      SRBs.                            01690000
SSRBTIME DS    D                       SRB TIME LIMIT VALUE IF @G381PXU 01700000
*                                      THIS SRB IS BEING       @G381PXU 01750000
*                                      TIMED, OTHERWISE ZERO.  @G381PXU 01800000
SSRBXSB  DS    A                       ADDRESS OF EXTENDED     @G381PXU 01850000
*                                      STATUS BLOCK (XSB).     @G381PXU 01900000
SSRBORMT DS    A                       OLD SRB RMTR VALUE          @P1C 01907000
SSRBSSTD EQU   X'80'                   SRB SUSPEND WITH TOKEN      @P1A 01914000
*                                      DISABLE BIT                      01921000
SSRBSSTA EQU   X'40'                   SRB SUSPEND WITH TOKEN      @P1A 01928000
*                                      DISABLED BECAUSE SRB WAS ABENDED 01935000
*                                      DURING PURGEDQ PROCESSING.       01942000
SSRBSSTE EQU   X'20'                   SRB SUSPEND WITH TOKEN      @P1A 01949000
*                                      DISABLED BECAUSE THIS SRB IS     01956000
*                                      A SUSPEND EXIT.                  01963000
SSRBLSA1 DS    A                       SAVEAREA FOR LCCACLSD.      @L7C 01968600
SSRBR0BC DS    CL4                     Reserved.                   @L7A 01974200
SSRBLSDP DS    A                       VIRTUAL ADDRESS OF THE      @L7C 01979800
*                                      CURRENT LSED. IF SSRBLSDP IS 0   01985500
*                                      1. THE SRB DID NOT USE THE       01989900
*                                         LINKAGE STACK,                01993200
*                                      2. SSRBLSA1 IS UNPREDICTABLE,    01996500
*                                         AND                           01999800
*                                      3. THE SSRB WILL BE DISPATCHED   02003100
*                                         WITH AN EMPTY LINKAGE STACK.  02006400
SSRBALOV DS    A                       DISPATCHABLE UNIT ACCESS    @L2A 02010000
*                                      LIST VIRTUAL ADDRESS.            02020000
SSRBARS  DS    CL64                    ACCESS REGISTER SAVEAREA    @L2A 02030000
SSRBDUCT DS    CL64                    DUCT SAVEAREA               @L2A 02040000
SSRBFRRS DS    CL984                   FRR STACK SAVEAREA.         @L3C 02045000
SSRBR520 DS    CL4                     Reserved.                   @L7A 02046700
SSRBSSD  DS    F                       Address of this SRB's SSD,  @L6C 02048500
*                                      if the SSRB is queued to an @L6C 02049000
*                                      SSD.                        @L6C 02049500
         DS    0F                                                  @D1A 02050200
SSRBR528 DS    CL2                     Reserved                    @D1A 02050900
SSRBOPASID  DS  CL2                    Original Purge ASID.  Similar    02051600
*                                      in function to SSRBORMT.    @D1A 02052300
SSRBOPTCB  DS  A                       Original Purge TCB.  Similar     02053000
*                                      in function to SSRBORMT.    @D1A 02053700
SSRBSUPFRR  DS  A                      Address of the Supervisor FRR    02054400
*                                      Wrapper routine that is set      02055100
*                                      for SYNCH(YES) SSRBs.       @D1A 02055800
SSRBR534    DS   CL4                   Reserved                    @D1A 02056500
SSRBSUSPINFO    DS  0CL28              This area is used to save   @D1A 02057200
*                                      information about the suspended  02057900
*                                      work unit.                       02058600
*                                                                       02059300
SSRBSUSPWUTYPE  DS  1FL1               Type (same as WEBTYPE) of   @D1A 02060000
*                                      workunit suspended waiting for   02060700
*                                      this SRB to complete.            02061400
SSRBR539        DS  CL3                Reserved.                   @D1A 02062100
SSRBSUSPTTOKEN  DS  0CL16              TTOKEN of the TCB to resume @D1A 02062800
*                                      when this SRB completes.  ONLY   02063500
*                                      valid when SSRBSUSPWUTYPE        02064200
*                                      represents a "TCB".              02064900
SSRBSUSPSTOKEN   DS  CL8               STOKEN portion of the       @D1A 02065600
*                                      TTOKEN of the TCB to resume when 02066300
*                                      this SRB completes.  Valid for   02067000
*                                      all SSRBSUSPWUTYPE types.        02067700
SSRBSUSPSPTOKEN  DS  CL8               SPTOKEN of the SRB to resume@D1A 02068400
*                                      when this SRB completes.  ONLY   02069100
*                                      valid when SSRBSUSPWUTYPE        02069800
*                                      represents an "SSRB".            02070500
SSRBSUSPRBADDR   DS  A                 Address of the RB that was  @D1A 02071200
*                                      suspended when the SYNCH(YES)    02071900
*                                      caller was suspended.  ONLY      02072600
*                                      valid when SSRBSUSPWUTYPE        02073300
*                                      represents an "SSRB".            02074000
SSRBSUSPRBRESUMETOKEN  DS  CL4         RB Token for which to       @D1A 02074700
*                                      suspended task.  ONLY valid when 02075400
*                                      SSRBSUSPWUTYPE represents a      02076100
*                                      "TCB".                           02076800
SSRBSYNCHINFO   DS  0CL24              This area is used to save   @D1A 02077500
*                                      the completion information about 02078200
*                                      this SRB for the workunit that   02078900
*                                      is to be resumed.  This area is  02079600
*                                      only valid if SSRBSUSPWUTYPE is  02080300
*                                      nonzero.  This area is used      02081000
*                                      as the backend processing of     02081700
*                                      IEAMSCHD SYNCH(YES) processing   02082400
*                                      by IEAVSCHD to indicate to its   02083100
*                                      caller the completion info       02083800
*                                      of this SRB.                     02084500
SSRBSYNCHCOMP   DS   F                 Indicates the completion type    02085200
*                                      for this SRB.               @D1A 02085900
SSRBSYNCHCOMPADDR DS A                 Address of the storage to update 02086600
*                                      with the completion type.   @D1A 02087300
SSRBSYNCHCODE   DS   F                 Indicates the code associated    02088000
*                                      with the completion type         02088700
*                                      for this SRB.               @D1A 02089400
SSRBSYNCHCODEADDR DS A                 Address of the storage to update 02090100
*                                      with the associated code.   @D1A 02090800
SSRBSYNCHRSN    DS   F                 Indicates the reason associated  02091500
*                                      with the completion type         02092200
*                                      for this SRB.               @D1A 02092900
SSRBSYNCHRSNADDR  DS A                 Address of the storage to update 02093600
*                                      with the associated code.   @D1A 02094300
SSRBR56C DS 0C                         Old label                   @L9A 02094400
SSRBSUSPT6RBOPSW  DS CL8               RBOPSW from T6 SVC issuer   @L9A 02094500
SSRBSUSPT6FLAGS   DS 0F                Flags                       @L9A 02094700
                  DS CL2               Flags                       @L9A 02094900
SSRBSUSPT6HOMEASID DS H                Home ASID                   @L9A 02095100
SSRBSUSPT6TASKWEB@ DS A                Suspended task's WEB addr   @L9A 02095300
SSRBR57C DS    CL12                    Reserved.                   @LAC 02095800
SSRBAFPR DS    CL100                   FPRs 1,3,5,7-15,FPCR        @LAA 02096300
SSRBESSFL DS   0X                      Extended saving flags       @LBA 02096500
SSRBFPFL DS    X                       FP Flags                    @LAA 02096800
SSRBBFP  EQU   X'80'                   Extended FP saving          @LAA 02097300
SSRBR5ED DS    CL3                     Reserved                    @LAA 02097600
SSRBG64H DS    CL64                    High-order halves of GPRs   @LBA 02097900
SSRBTRNE DS    XL8                     ESAME page fault address    @LBA 02098300
SSRBEND  DS    0D                      END OF SSRB.                @L1C 02098800
SSRBLEN  EQU   SSRBEND-SRBSECT         LENGTH OF SSRB AREA         @L1C 02100000
         POP PRINT                                                 @L2A 02150000
         MEND  , */                                                     02250000
*%PLSSSRB1 : ;                                                          02300000
*%SRBLEVEL='2';                        /* PASS DCL AND LEVEL 1 IN SRB*/ 02350000
*%SRB9999=',';                         /*END SRB WITH COMMA          */ 02400000
*                                                                       02405500
* @LISTPUSH;                                       /*            @L2A*/ 02411000
*%IF IHALIST='YES' %THEN                                                02416500
*  %GOTO LSTSSRB;                                  /*            @L2A*/ 02422000
*%ELSE                                                                  02427500
*    @LISTOFF;                                     /*            @L2A*/ 02433000
*%LSTSSRB:;                                        /*            @L2A*/ 02438500
*                                                                       02444000
*DECLARE                               /* SUSPENDED SRB              */ 02450000
*  1 SSRBSECT BASED(SRBPTR) BDY(DWORD),/* LABEL OF MAPPING.  @G381PXU*/ 02500000
*%INCLUDE SYSLIB(IHASRB);                                               02550000
*    2 * CHAR(4) BDY(WORD),            /* RESERVED.          @G381PXU*/ 02600000
*    2 SSRB BDY(DWORD),                /* START OF SAVE AREA PORTION */ 02650000
*      3 SSRBFPRS CHAR(32) BDY(DWORD), /* FLOATING POINT REG SAVE       02700000
*                                         AREA                       */ 02750000
*        4 SSRBFPR0 CHAR(8),           /* FLOATING POINT REG 0       */ 02800000
*        4 SSRBFPR2 CHAR(8),           /* FLOATING POINT REG 2       */ 02850000
*        4 SSRBFPR4 CHAR(8),           /* FLOATING POINT REG 4       */ 02900000
*        4 SSRBFPR6 CHAR(8),           /* FLOATING POINT REG 6       */ 02950000
*      3 SSRBTRAN PTR(31),             /* PAGE FAULT ADDR(FLIH)         02972800
*                                                            @G50DPXE*/ 02995600
*      3 SSRBSAFN BIT(16),             /* SAVED AFFINITY         @01A*/ 03018500
*      3 SSRBTYPE BIT(8),              /* Savearea for WEBTYPE when     03022400
*                                         PSRBs, ESRBs or CSRBs are     03026300
*                                         suspended or STOPped.         03030200
*                                         Ownership:Supervisor Control  03034100
*                                         Serialization: WEBLOCK of     03038000
*                                         the WEB associated with       03041900
*                                         this SSRB              @L7A*/ 03045800
*      3 SSRBR057 CHAR(1),             /* RESERVED.              @03C*/ 03050600
*      3 SSRBGPRS CHAR(64) BDY(WORD),  /* GENERAL REG SAVE       @L5C*/ 03055500
*        4  SSRBGPR0 FIXED(31),        /* GENERAL REGISTER 0     @L5A*/ 03061000
*        4  SSRBGPR1 FIXED(31),        /* GENERAL REGISTER 1     @L5A*/ 03066500
*        4  SSRBGPR2 FIXED(31),        /* GENERAL REGISTER 2     @L5A*/ 03072000
*        4  SSRBGPR3 FIXED(31),        /* GENERAL REGISTER 3     @L5A*/ 03077500
*        4  SSRBGPR4 FIXED(31),        /* GENERAL REGISTER 4     @L5A*/ 03083000
*        4  SSRBGPR5 FIXED(31),        /* GENERAL REGISTER 5     @L5A*/ 03088500
*        4  SSRBGPR6 FIXED(31),        /* GENERAL REGISTER 6     @L5A*/ 03094000
*        4  SSRBGPR7 FIXED(31),        /* GENERAL REGISTER 7     @L5A*/ 03099500
*        4  SSRBGPR8 FIXED(31),        /* GENERAL REGISTER 8     @L5A*/ 03105000
*        4  SSRBGPR9 FIXED(31),        /* GENERAL REGISTER 9     @L5A*/ 03110500
*        4  SSRBGPRA FIXED(31),        /* GENERAL REGISTER 10    @L5A*/ 03116000
*        4  SSRBGPRB FIXED(31),        /* GENERAL REGISTER 11    @L5A*/ 03121500
*        4  SSRBGPRC FIXED(31),        /* GENERAL REGISTER 12    @L5A*/ 03127000
*        4  SSRBGPRD FIXED(31),        /* GENERAL REGISTER 13    @L5A*/ 03132500
*        4  SSRBGPRE FIXED(31),        /* GENERAL REGISTER 14    @L5A*/ 03138000
*        4  SSRBGPRF FIXED(31),        /* GENERAL REGISTER 15    @L5A*/ 03143500
*      3 SSRBCPSW CHAR(8) BDY(DWORD),  /* CURRENT PSW        @G50DPXE*/ 03150000
*      3 SSRBCPUT CHAR(8),             /* CPUTIMER SAVEAREA  @G50DPXE*/ 03200000
*        4  SSRBNTMR  BIT(1),          /* When set, this SSRB doesn't   03208300
*                                         have any SRB Timer set.       03216600
*                                         Only meaningful for           03224900
*                                         preemptable-class             03233200
*                                         SRBs.                  @L7A*/ 03241500
*      3 SSRBTIME CHAR(8) BDY(DWORD),  /* SRB TIME LIMIT     @G381PXU   03250000
*                                         VALUE IF THIS SRB  @G381PXU   03300000
*                                         IS BEING TIMED,    @G381PXU   03350000
*                                         OTHERWISE ZERO.    @G381PXU*/ 03400000
*      3 SSRBXSB PTR(31),              /* ADDRESS OF EXTENDED           03450000
*                                         STATUS BLOCK (XSB) @G381PXU*/ 03500000
*      3 SSRBORMT PTR(31),             /* OLD SRB RMTR VALUE     @P1C*/ 03506100
*        4  SSRBSSTD  BIT(1),          /* SRB SUSPEND WITH TOKEN        03512200
*                                         DISABLE BIT            @P1A*/ 03518300
*        4  SSRBSSTA  BIT(1),          /* SRB SUSPEND WITH TOKEN        03524400
*                                         DISABLED BECAUSE SRB WAS      03530500
*                                         ABENDED DURING PURGEDQ        03536600
*                                         PROCESSING.            @P1A*/ 03542700
*        4  SSRBSSTE  BIT(1),          /* SRB SUSPEND WITH TOKEN        03548800
*                                         DISABLED BECAUSE THIS SRB IS  03554900
*                                         A SUSPEND EXIT.        @P1A*/ 03561000
*      3 SSRBLSA1 PTR(31),             /* SAVEAREA FOR LCCACLSD. @L7C*/ 03569300
*      3 SSRBR0BC CHAR(4),             /* Reserved.              @L7A*/ 03577600
*      3 SSRBLSDP PTR(31),             /* VIRTUAL ADDRESS OF THE        03586000
*                                         CURRENT LSED. IF SSRBLSDP IS  03587300
*                                         0                             03588600
*                                 . . . . 1. THE SRB DID NOT USE THE  . 03590000
*                                        ..  LINKAGE STACK, . . . . .   03592000
*                                      .  2. SSRBLSA1 IS                03594000
*                                        ..  UNPREDICTABLE, AND . . . . 03596000
*                                         3. THE SSRB WILL BE . . . . . 03598000
*                                         .. DISPATCHED WITH AN EMPTY   03600000
*                                      . ..  LINKAGE STACK.      @L7C*/ 03602000
*      3 SSRBALOV PTR(31),             /* DISPATCHABLE UNIT ACCESS      03604000
*                                         LIST VIRTUAL ADDRESS.  @L2A*/ 03613000
*      3 SSRBARS  CHAR(64),            /* ACCESS REGISTER SAVEAREA.     03622000
*                                                                @L2A*/ 03631000
*      3 SSRBDUCT CHAR(64),            /* DUCT SAVEAREA.         @L2A*/ 03640000
*      3 SSRBFRRS CHAR(984) BDY(WORD), /* FRR STACK SAVEAREA.    @L3C*/ 03645000
*      3 SSRBR520 CHAR(4),             /* Reserved.              @L7A*/ 03646600
*      3 SSRBSSD PTR(31),              /* Address of this SRB's SSD,    03648200
*                                         if the SSRB is queued to an   03648800
*                                         SSD.                   @L6C*/ 03649400
*      3 SSRBR528 CHAR(2),             /* Reserved.              @L9C*/ 03650100
*      3 SSRBoPAsid CHAR(2),           /* Original Purge ASID.  Similar 03650800
*                                      to SSRBORMT.              @D1A*/ 03651500
*      3 SSRBoPTcb PTR(31),            /* Original Purge TCB.  Similar  03652200
*                                      to SSRBORMT.              @D1A*/ 03652900
*      3 SSRBSupFrr PTR(31),           /*  Address of the Supervisor    03653600
*                                      FRR Wrapper routine that is set  03654300
*                                      for SYNCH(YES) SSRBs.     @D1A*/ 03655000
*      3 SSRBR534 CHAR(4),             /*  Reserved.             @D1A*/ 03655700
*      3 SSRBSuspInfo CHAR(28) BDY(WORD), /* This area is used to save  03656400
*                                      information about the suspended  03657100
*                                      workunit.                 @D1A*/ 03657800
*        5 SSRBSuspWuType FIXED(8),    /* Type (same as WEBTYPE) of     03658500
*                                      workunit suspended waiting for   03659200
*                                      this SRB to complete.     @D1A*/ 03659900
*        5 SSRBR539 CHAR(3),           /* Reserved.              @D1A*/ 03660600
*        5 SSRBSuspTToken CHAR(16) BDY(WORD), /* TTOKEN of the TCB to   03661300
*                                      resume when this SRB completes.  03662000
*                                      ONLY valid when SSRBSuspWuType   03662700
*                                      represents a "TCB".       @D1A*/ 03663400
*          7 SSRBSuspSToken CHAR(8),  /* STOKEN portion of the TTOKEN   03664100
*                                      of the TCB to resume when this   03664800
*                                      SRB completes.  Valid for all    03665500
*                                      SSRBSuspWuType types.     @D1A*/ 03666200
*          7 SSRBSuspSPToken CHAR(8) BDY(WORD),  /*                     03666600
*                                      SPTOKEN of the SRB to resume     03667000
*                                      when this SRB completes.  ONLY   03667600
*                                      valid when SSRBSuspWuType        03668300
*                                      represents an "SSRB".     @D1A*/ 03669000
*            9 * CHAR(4),             /* First part of SpTOKEN   @L9A*/ 03669200
*            9 SSRBSuspTTokenTCB@ PTR(31), /* TCB address        @L9A*/ 03669400
*        5 SSRBSuspRbAddr PTR(31),    /* Address of the RB that was     03669700
*                                     suspended when the SYNCH(YES)     03670400
*                                     caller was suspended.  ONLY       03671100
*                                     valid when SSRBSuspWuType         03671800
*                                     represents an "TCB".       @D1A*/ 03672500
*        5 SSRBSuspRBResumeToken CHAR(4), /* RB Token for which to      03673200
*                                      resume the suspended task.  ONLY 03673900
*                                      valid when SSRBSuspWuType        03674600
*                                      represents a "TCB".       @D1A*/ 03675300
*      3 SSRBSynchInfo CHAR(24) BDY(WORD), /* This area is used to save 03676000
*                                      the completion information about 03676700
*                                      this SRB for the workunit that   03677400
*                                      is to be resumed.  This area     03678100
*                                      is used for the backend          03678800
*                                      processing of IEAMSCHD           03679500
*                                      SYNCH(YES) processing by         03680200
*                                      IEAVSCHD to indicate to its      03680900
*                                      caller the completion info       03681600
*                                      of this SRB.              @D1A*/ 03682300
*        5 SSRBSynchComp FIXED(31),    /* Indicates the completion      03683000
*                                      type for this SRB.        @D1A*/ 03683700
*        5 SSRBSynchCompAddr PTR(31),  /* Address of the storage to     03684400
*                                      update with the completion type. 03685100
*                                                                @D1A*/ 03685800
*        5 SSRBSynchCode FIXED(31),    /* Indicates the code associated 03686500
*                                      with the completion type for     03687200
*                                      this SRB.                 @D1A*/ 03687900
*        5 SSRBSynchCodeAddr PTR(31),  /* Address of the storage to     03688600
*                                      update with the associated code. 03689300
*                                                                @D1A*/ 03690000
*        5 SSRBSynchRsn FIXED(31),     /* Indicates the reason          03690700
*                                      associated with the completion   03691400
*                                      type for this SRB.        @D1A*/ 03692100
*        5 SSRBSynchRsnAddr PTR(31),   /* Address of the storage to     03692800
*                                      update with the associated       03693500
*                                      reason.                   @D1A*/ 03694200
*      3 SsrbSuspT6RBOPSW CHAR(8),     /* RBOPSW from T6 SVC so that    03694400
*                      we can resume in IEAVSCHD and then later         03694600
*                      get back to the T6 SVC issuer.            @L9A*/ 03694800
*      3 SsrbSuspT6Flags BIT(32) Bdy(Word) Abnormal,  /* Flags          03695000
*                      serialized by CS. We need to know when it's      03695200
*                      safe to free the SSRB. The "last guy out wins"   03695400
*                      is the rule, from among IEAVSYNR and IEAVSCHD.   03695600
*                      Each sets his bit, and in doing so checks        03695800
*                      the other guy's bit. If both bits are on when    03696000
*                      your bit gets set, it's your responsibility      03696200
*                      to clean up.                              @L9A*/ 03696400
*       4 * Bit(16),                    /*                       @L9A*/ 03696600
*        5 * Bit(1),                    /* Do not use this bit. It      03696800
*                      causes a compiler problem if either of the next  03697000
*                      two bits is bit 0 in this word.           @L9A*/ 03697200
*        5 SsrbSuspT6IeavschdRan Bit(1),              /*         @L9A*/ 03697400
*        5 SsrbSuspT6IeavsynrRan Bit(1),              /*         @L9A*/ 03697600
*        5 SsrbSuspT6InEffect Bit(1),                 /*         @L9A*/ 03697800
*       4 SsrbSuspT6HomeASID Fixed(15), /* Home ASID             @L9A*/ 03698000
*      3 SsrbSuspT6TaskWEB@ PTR(31),   /* Address of suspended          03698100
*                      task's WEB                                @L9A*/ 03698200
*      3 SSRBR57C  CHAR(12),           /* Reserved.              @LAC*/ 03698400
*      3 SSRBAFPR  CHAR(100),          /* FPRs 1,3,5,7-15,FPCR   @LAA*/ 03698600
*      3 SSRBESSFL BIT(8),             /* Extended saving flags  @LBA*/ 03698700
*       5 SSRBFPFL BIT(8),             /* FP Flags               @LAA*/ 03698800
*        7 SSRBBFP BIT(1),             /* Extended FP saving     @LAA*/ 03698900
*        7 *       BIT(1),             /* unused                 @LBA*/ 03699000
*      3 SSRBR5ED CHAR(3),             /* Reserved               @LAA*/ 03699200
*      3 SSRBR5F0  CHAR(8),            /* Reserved.              @L9C*/ 03699400
*      3 SSRBG64H  CHAR(64) BDY(WORD), /* High Halves of GPRs    @LBA*/ 03699500
*      3 SSRBTRNE  CHAR(8)  BDY(WORD), /* ESAME page fault              03699600
*                                      ESAME page fault address  @LBA*/ 03699700
*      3 SSRBEND CHAR(0) BDY(DWORD);   /* END OF SSRB.           @L1C*/ 03699800
*                                                                       03700000
*  @LISTPOP;                                               /*    @L2A*/ 03750000
