*                                                                       00700002
*        %GOTO SCVTL1;  /*                                              00750002
         MACRO                                                          01400002
         IHASCVT &DSECT=YES,&LIST=NO          */                        02100002
*%SCVTL1 : ;                                                            02102002
*/* START OF SPECIFICATIONS ******************************************/ 02104000
*/**** PROPRIETARY_STATEMENT *****************************************/ 02106000
*/*01* PROPRIETARY STATEMENT =                                       */ 02108000
*/*                                                                  */ 02110002
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 02158000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 02161500
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                 */ 02165000
*/*                                                                  */ 02168500
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 02169600
*/*                                                                  */ 02170700
*/*01* STATUS = HBB7703                                              */ 02171600
*/*                                                                  */ 02172500
*/*01*  EXTERNAL CLASSIFICATION:                                     */ 02172800
*/*02*    NOTPI: BASE                                                */ 02173100
*/*02*    PI:    FIELDS                                              */ 02173400
*/*              SCVTCCVT                                            */ 02173700
*/*              SCVTMCA                                             */ 02174000
*/*01*  END OF EXTERNAL CLASSIFICATION:                              */ 02174300
*/*                                                                  */ 02175500
*/*01* DESCRIPTIVE NAME:  Secondary Communication Vector Table       */ 02181300
*/*02*  ACRONYM:  SCVT                                               */ 02187100
*/*                                                                  */ 02193000
*/*01* MACRO-NAME:  IHASCVT                                          */ 02208400
*/*                                                                  */ 02223902
*/*01* DSECT NAME:                                                   */ 02224800
*/*     SCVTSECT                                                     */ 02225700
*/*                                                                  */ 02226700
*/*01* COMPONENT:  Common Macros (SC101)                             */ 02227400
*/*                                                                  */ 02228100
*/*01* EYE-CATCHER:  None                                            */ 02228300
*/*                                                                  */ 02228500
*/*01* STORAGE ATTRIBUTES:                                           */ 02228600
*/*02*  KEY:  key 0                                                  */ 02228700
*/*02*  RESIDENCY:  Nucleus                                          */ 02228800
*/*                                                                  */ 02228900
*/*01* SIZE:  224 bytes                                              */ 02229000
*/*                                                                  */ 02229100
*/*01* CREATED BY:                                                   */ 02229200
*/*     IEASCVT                                                      */ 02229300
*/*                                                                  */ 02229400
*/*01* POINTED TO BY:                                                */ 02229500
*/*     CVTABEND field of the CVT data area                          */ 02229600
*/*                                                                  */ 02229700
*/*01* SERIALIZATION:                                                */ 02229800
*/*     None required                                                */ 02229900
*/*                                                                  */ 02230000
*/*01* FUNCTION:                                                     */ 02230100
*/*02*  Used by non-nucleus-resident routines to refer to routines   */ 02230200
*/*     used by the Supervisor, by ABEND, and other program          */ 02230300
*/*     components.                                                  */ 02230400
*/*                                                                  */ 02230500
*/*01* METHOD OF ACCESS:                                             */ 02230600
*/*02*  ASM:                                                         */ 02230700
*/*      DSECT is produced unless DSECT=NO is specified.             */ 02230800
*/*      USING on SCVTSECT gives Addressability for all symbols.     */ 02230900
*/*      Specify LIST=YES on Macro call for listing.                 */ 02231000
*/*02*  PL/AS:                                                       */ 02231100
*/*      Is Based on SCVTSPTR.                                       */ 02231200
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 02231300
*/*                                                                  */ 02231400
*/*01* DEPENDENCIES:                                                 */ 02231500
*/*      None.                                                       */ 02231600
*/*                                                                  */ 02231700
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 02231800
*/*                                                                  */ 02231900
*/*01* CHANGE ACTIVITY:                                              */ 02232000
*/*  $LE=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 02232100
*/*                                                                  */ 02232200
*/* END OF SPECIFICATIONS ********************************************/ 02232300
*/********************************************************************/ 02232400
*%GOTO SCVTL2;   /*                                                     02232500
.*                                                                      02232700
.*********************************************************************  02235100
.* 01* CHANGE ACTIVITY =                                                02237500
.*                                                                      02239900
.*  OZ78798 - ADD TSO FIELD FOR RESOURCE MANAGER ADDRESS    @ZA78798    02242300
.*  OZ93009 - ADD FIELD FOR SYSTEM AVAILABILITY MANAGER     @ZA93009    02244700
.*            ADDRESS                                                   02247100
.*                                                                      02248100
.*  $L4=XMCTASK  JBB1326  031081  PD46:    XM COMM TASK                 02249200
.*  $D1=DCR0091  JBB2125  092783  PD16H4:  COMM TASK DELETION           02251300
.*  $L5=IOGEN    JBB2220  840806  PD16Q4:  IOGEN RESTRUCTURE            02253400
.*  $L6=DIV      JBB2220  840905  PD16Q9:  DATA IN VIRTUAL              02255500
.*  $L7=RASENH   JBB2220  841128  PD16M6:  RAS ENHANCEMENTS FOR RTM     02257600
.*  $L8=SYMREC   JBB2220  850220  PD161M:  SYMPTOM RECORDS              02259700
.*  $L9=DIV      JBB2220  850720  PD16Q4:  DATA IN VIRTUAL PREFIX       02261800
.*                                         CHANGE                       02263900
.*  $D2=DCR0117  JBB2220  850729  PD16Q4:  SYMREC RESOURCE MANAGER      02266000
.*  $LA=DATASPAC HBB3310  860630  PD16LD:  DATA SPACES                  02268100
.*  $D3=DCR0166  HBB3310  861029  PD16BN:  DEFINE SCVTCPLS              02269600
.*  $D4=DCR0162  HBB3310  861229  PD16Q4:  DEFINE SCVTCTAB              02270300
.*  $D5=DCR1005  HBB3310  870302  PD16Q4:  DEFINE SCVTVLFB              02270700
.*  $LB=ILIBS    JBB3311  880229  PD16BN:  ILIB                         02270900
.*  $01=OY21653  JBB3311  890203  PD16CU:  DEFINE SCVTCHSI              02271200
.*  $LC=CNITG    HBB4410  890313  PD16BN:  CONSOLE INTEGRATION          02271300
.*  $02=OY27052  JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC        02271400
.*                                         FEATURE SUPPORT              02271500
.*  $D6=DGP0041  JBB3313  890407  PD16ES:  DEFINE SCVTDSPA              02271600
.*  $P1=PGP0518  JBB3313  890811  PD16ES:  ADD SCVTDLFB                 02271700
.*  $LD=SDOM     JBB3313  890512  PD16ES:  SDOM                         02271800
.*  $D7=DEO0102  HBB4410  890515  PD16ES:  DEFINE SCVTMCA               02271900
.*  $LE=SDOM     JBB3313  890915  PD16ES:  SDOM                         02272000
.*  $D8=DEO0307  HBB4410  900226  PD16ES:  DEFINE SCVTDIS               02272100
.*  $LF=USERV    HBB4410  900330  PD16IG:  DEFINE SCVTGAMP, SCVTGAMS    02272300
.*  $03=OY26379  JBB3313  900504  PD16IG:  DEFINE SCVTNETV              02272400
.*  $04=OY29198  HBB3310  900201  PD16CV:  HIGH PERFORMANCE PARALLEL    02272600
.*                                         INTERFACE SUPPORT (AKA HSC)  02272800
.*  $05=OY54298  HBB4420  920430  PD16EI:  ADD SCVTVLFC (SUPPORT FOR    02272900
.*                                         OY54297)                     02273000
.*  $P2=PKB3892  HBB4430  920729  PD16IG:  Put conditional logic around 02273400
.*                                         SCVTBR14 so this field can   02273800
.*                                         be picked up when DSECT=YES  02274200
.*                                         is specified, and also       02274600
.*                                         appear in Data Areas book    02275000
.*  $LF=64BITSUP HBB7703  980109  PD00XB:  WXTRN                        02275200
.*********************************************************************  02275400
.*                                                                      02275900
         PUSH  PRINT                                                    02278300
         AIF   ('&LIST' EQ 'YES').SCVT1                                 02281902
         PRINT OFF                                                      02431902
.SCVT1   ANOP                                                           02481902
         AIF   ('&DSECT' EQ 'NO').SCV0000                               02531902
SCVTSECT DSECT                                                          02800002
         AGO   .SCV0020                                                 02850002
.SCV0000 ANOP                                                           02860002
         DS    0D                                                       02900002
SCVTSECT EQU   * -                 START OF SECONDARY CVT               02950002
.SCV0020 ANOP                                                           03000002
         AIF   ('&DSECT' EQ 'YES').SCV811A                     @G860P46 03050000
         EXTRN IEAQPGTM                             @(DCR571)  @G860P46 03100000
SCVTPGTM DC    A(IEAQPGTM+X'80000000') -  ADDR OF EOT TIMER    @G860P46 03150000
*                                  PURGE ROUTINE (POINTER      @G860P46 03200000
*                                  DEFINED ADDRESS).           @G860P46 03250000
         AGO   .SCV811B                                        @G860P46 03300000
.SCV811A ANOP                                        @(DCR571) @G860P46 03350000
SCVTPGTM DC    V(IEAQPGTM) -       ADDR OF EOT TIMER PURGE     @G860P46 03400000
*                                  ROUTINE.                    @G860P46 03450000
.SCV811B ANOP                                        @(DCR571) @G860P46 03500000
SCVTPGWR DC    A(SCVTBR14) -       ADDRESS OF WTO/WTOR RESOURCE         03550000
*                                  MANAGER.  INITIALLY CONTAINS ADDRESS 03600000
*                                  OF BR 14.  CHANGED TO IEECVPRG       03650000
*                                  (MODULE IEAVMED2) BY COMMUNICATIONS  03700000
*                                  TASK INITIALIZATION (IEAVVINT).      03750000
*                                                                MDC013 03800000
SCVTDSPA DC    A(0) -              ANCHOR FOR SYSTEM/370 SNA/DS    @D6A 03850000
*                                  DISTRIBUTION SERVICES PRODUCT.       03900000
         AIF   ('&DSECT' EQ 'YES').SCVTBR1                         @P2A 03925000
SCVTBR14 BR    14 -                RETURN TO CALLER              MDC014 03950000
         AGO   .SCVTBR2                                            @P2A 03953300
.SCVTBR1 ANOP                                                      @P2A 03956600
SCVTBR14 DS    H -                 A BR 14 INSTRUCTION.  RETURN    @P2A 03959900
*                                  TO CALLER                            03963200
.SCVTBR2 ANOP                                                      @P2A 03966500
SCVTVLFC DC    H'0'  -             COUNT OF THE NUMBER OF TIMES    @05C 03970000
*                                  VLF IS STARTED                       03990000
*                                  OWNERSHIP:  VLF.                     04010000
*                                  SERIALIZATION:  NONE                 04030000
         DC    A(0) -              ** SCVTTERAS FIELD UNUSED   @G860P46 04050000
*                                  IN OS/VS2 RELEASE 2 **      @G860P46 04100000
*                                                    @(DCR560) @G860P46 04150000
SCVTBWTO DC    V(IEABRWTO) -       ADDRESS OF BRANCH-ENTRY WTO AND @LCA 04200000
*                                  WTOR.  MUST BE ADDRESSABLE IN        04250000
*                                  24-BIT MODE.                         04300000
SCVTBDOM DC    V(IEABRDOM) -       ADDRESS OF BRANCH-ENTRY DOM.    @LCA 04350000
*                                  MUST BE ADDRESSABLE IN 24-BIT MODE.  04400000
SCVTRMBR DC    V(RMBRANCH) -       ADDR OF REGMAIN BRANCH ENTRY         10500002
SCVTCHSI DC    A(0) -              POINTER TO THE IOS CHANNEL      @01C 10550000
*                                  SUBSYSTEM INFORMATION BLOCK          10600000
SCVTRACE DC    A(20) -             ADDR OF POINTER TO TRACE ROUTINE     11900002
SCVTHSCS DC    A(SCVTBR14) -       ADDRESS OF SLIH FOR HPPI             11950000
*                                  EXTERNAL INTERRUPTS.                 12000000
*                                  OWNERSHIP: HPPI SOFTWARE.       @04C 12050000
SCVTSORM DC    A(0) -              ADDRESS OF SDOM RESOURCE        @LDC 12100000
*                                  MANAGER (COFMSORM).                  12650000
*                                  OWNERSHIP: VLF.                      12700000
*                                  SERIALIZATION: NONE.                 12750000
SCVTLFRM DC    V(FMBRANCH) -       LIST FORMAT FREEMAIN BRANCH ENT PT   12800000
SCVTSDOB DC    A(0) -              ADDRESS OF SHARED DATA OBJECT   @LDC 12850000
*                                  MANAGER BLOCK.                       12900000
*                                  OWNERSHIP:  VLF.                     12950000
*                                  SERIALIZATION:  CS.                  13000000
SCVTMCA  DC    A(0) -              ANCHOR FOR GLOBAL MVS MESSAGE   @D7A 13050000
*                                  SERVICE DATA AREA.                   13100000
*                                  OWNERSHIP: MVS MESSAGE SERVICE.      13150000
*                                  SERIALIZATION: LOCAL AND CMS LOCKS.  13200000
SCVTNETV DC    A(0) -              NETVIEW CONTROL STRUCTURE       @03C 13250000
*                                  ANCHOR.  OWNERSHIP: NETVIEW.         13300000
*                                  SERIALIZATION: NONE.                 13350000
SCVTRPTR DC    A(0) -              ADDR OF TRACE TABLE POINTERS  YM2703 14350000
SCVTGMBR DC    V(GMBRANCH) -       LIST FORMAT GETMAIN BRANCH ENTRY     17500002
*                                  POINT                         ICB445 17550002
SCVTRG2  DC    A(0) -              ENTRY POINT ADDRESS OF IEAVTRG2,     17600000
*                                  RTM2 24 BIT ADDRESSING MODE          17650000
*                                  INTERFACE ROUTINE.                   17700000
*                                                    @(DCR854) @G860P46 17750000
SCVTRG2B DC    A(0) -              ADDRESS OF SECOND ENTRY POINT IN     17800000
*                                  IEAVTRG2, RTM2 24 BIT ADDRESSING     17850000
*                                  MODE INTERFACE ROUTINE.              17900000
*                                                    @(DCR854) @G860P46 17950000
SCVTRTXT DC    V(IEECB867)         ADDRESS OF MODULE IEECB867.  MODULE  18000000
*                                  PROVIDES CALLER WITH THE MESSAGE     18050000
*                                  TEXT ASSOCIATED WITH THE RETURN      18100000
*                                  CODE PROVIDED BY SVC DUMP WHEN IT    18150000
*                                  FAILED TO TAKE A DUMP.               18200000
*                                  OWNERSHIP:  SVC DUMP.           @L7C 18250000
SCVTAMSP DC    F'0' -              ADDRESS OF SYSTEM           @ZA93009 18300000
*                                  AVAILABILITY MANAGER(SAM) WHEN       18350000
*                                  SAM IS ACTIVE                        18400000
*                                  OWNERSHIP: SAM                       18450000
*                                  SERIALIZATION: NONE                  18500000
SCVTASRS DC    V(ASRGLTAB)         POINTER TO SYMPTOM RECORDS      @L8A 18550000
*                                  GLOBAL TABLE                         18600000
         AIF   ('&DSECT' EQ 'YES').SCV820A                         @D2A 18650000
         EXTRN ASRSERVM                                            @D2A 18700000
SCVTSYMR DC    A(ASRSERVM+X'80000000') ADDRESS OF THE SYMREC       @D2A 18750000
*                                  RESOURCE MANAGER                     18800000
         AGO   .SCV820B                                            @D2A 18850000
.SCV820A ANOP                                                      @D2A 18900000
SCVTSYMR DC    V(ASRSERVM)         ADDRESS OF THE SYMREC           @D2A 18950000
*                                  RESOURCE MANAGER                     19000000
.SCV820B ANOP                                                      @D2A 19050000
         AIF   ('&DSECT' EQ 'YES').SCV825A                         @LAA 19060700
         EXTRN IEAVTRDX                                            @LAA 19071400
SCVTDOPX DC    A(IEAVTRDX+X'80000000') ADDRESS OF THE IEAVTRDX     @LAA 19082100
*                                  ROUTINE INVOKED BY SETRP WHEN        19092800
*                                  DUMPOPX IS SPECIFIED                 19103500
*                                  OWNERSHIP: RTM                       19114200
         AGO   .SCV825B                                            @LAA 19124900
.SCV825A ANOP                                                      @LAA 19135600
SCVTDOPX DC    V(IEAVTRDX)         ADDRESS OF IEAVTRDX ROUTINE     @LAC 19146300
*                                  INVOKED BY SETRP WHEN DUMPOPX        19157000
*                                  IS SPECIFIED                         19167700
*                                  OWNERSHIP: RTM                       19178400
.SCV825B ANOP                                                      @LAA 19189100
         AIF   ('&DSECT' EQ 'YES').SCV828A                         @D3A 19191000
         EXTRN IGVCPLST                                            @D3A 19192900
SCVTCPLS DC    A(IGVCPLST+X'80000000') ADDRESS OF VSM CELL POOL    @D3A 19194800
*                                  LIST SERVICE.                        19196700
*                                  OWNERSHIP:  VSM                      19198600
         AGO   .SCV828B                                            @D3A 19200500
.SCV828A ANOP                                                      @D3A 19202400
SCVTCPLS DC    V(IGVCPLST)         ADDRESS OF VSM CELL POOL LIST   @D3C 19204300
*                                  SERVICE.                             19215700
*                                  OWNERSHIP:  VSM                      19227100
.SCV828B ANOP                                                      @D3A 19238500
SCVTDIV  DC    V(ITVDIB)           POINTER TO THE DIV INFORMATION  @L9C 19250000
*                                  BLOCK                                19300000
         AIF   ('&DSECT' EQ 'YES').SCV830A                         @L9A 19350000
         EXTRN ITVGTERM                                            @L9C 19400000
SCVTDIVM DC    A(ITVGTERM+X'80000000') POINTER TO THE DIV RESOURCE @L9C 19450000
*                                  MANAGER                              19500000
         AGO   .SCV830B                                            @L9A 19550000
.SCV830A ANOP                                                      @L9A 19600000
SCVTDIVM DC    V(ITVGTERM)         POINTER TO THE DIV RESOURCE     @L9C 19650000
*                                  MANAGER                              19700000
.SCV830B ANOP                                                      @L9A 19750000
SCVTCTR1 DC    A(0) -              RESERVED                        @L4C 19800000
SCVTCTAB DC    A(0) -              COMPONENT TRACE ANCHOR BLOCK.   @D4C 19850000
*                                  OWNERSHIP: COMPONENT TRACE.          19900000
*                                  SERIALIZATION: ENQ/DEQ.              19950000
SCVTRXLQ DC    A(0) -              ADDR OF RECOVERY EXTENT LIST         26600002
SCVTCGT  DC    A(0) -              POINTER TO IHACGT               @LDC 26622200
*                                  SERIALIZATION:  CS.                  26644400
         AIF   ('&DSECT' EQ 'YES').JAF1A                           @LDA 26655500
         EXTRN IDAVJOPN                                            @LEC 26666600
SCVTJOPN DC    A(IDAVJOPN+X'80000000') ADDR OF THE IDAVJOPN RTN    @LEC 26677700
*                                  SERIALIZATION:  N/A                  26711000
         AGO   .JAF1B                                              @LDA 26722100
.JAF1A   ANOP                                                      @LDA 26733200
SCVTJOPN DC    V(IDAVJOPN)         ADDR OF THE IDAVJOPN RTN        @LEC 26744300
*                                  SERIALIZATION:  N/A                  26777600
.JAF1B   ANOP                                                      @LDA 26788700
SCVTSVCT DC    V(SVCTABLE) -       ORIGIN OF SVC TABLE           MDC005 26800000
SCVTSVCR DC    V(IEAVSVCR) -       ADDRESS OF SVC UPDATE RECORDING @L5A 26850000
*                                  TABLE                                26900000
SCVTTQE  DC    V(IEATSELM) -       ADDR OF TSO SUBSYSTEM'S TQE          30100002
SCVTTTRM DC    A(0) -              TSO TASK TERMINATION RESOUCE         30150000
*                                  MANAGER                     @ZA78798 30200000
SCVTSTAT DC    V(IGC07902) -       ADDR OF SVC STATUS ROUTINE    ICB339 31500002
SCVTQCBR DC    V(QCBRANCH) -       BRANCH ENTRY POINT TO GETMAIN/       32200002
*                                  FREEMAIN QUICKCELL ROUTINE    ICB339 32900002
SCVTVLFB DC    A(0) -              VLF COMMON DATA BLOCK ADDRESS.  @D5C 32921600
*                                  OWNERSHIP: VLF.                      32943200
*                                  SERIALIZATION: CS.                   32964800
SCVTHSCT DC    A(0) -              ADDRESS OF HPPI                      32984700
*                                  SOFTWARE DATA AREA.                  33004600
*                                  OWNERSHIP: HPPI SOFTWARE.       @04C 33024500
         AIF   ('&DSECT' EQ 'YES').SCV811C                     @G860P46 33044500
         WXTRN IARGTERM                                            @LFC 33073400
SCVTPTRM DC    A(IARGTERM+X'80000000') - ADDRESS OF PAGING     @G860P46 33102300
*                                  SUPERVISOR ROUTINE          @G860P46 33131200
*                                  (IARGTERM) TO QUIESCE       @G860P46 33160100
*                                  ASYNCHRONOUS OR SYNCHRONOUS @G860P46 33189000
*                                  PAGING-IN, FIX, OR          @G860P46 33217900
*                                  MIGRATION REQUESTS.         @G860P46 33246800
         AGO   .SCV811D                                        @G860P46 33275700
.SCV811C ANOP                                                  @G860P46 33304600
SCVTPTRM DC    V(IARGTERM) -       ADDRESS OF PAGING           @G860P46 33333500
*                                  SUPERVISOR ROUTINE          @G860P46 33362400
*                                  (IARGTERM) TO QUIESCE       @G860P46 33391300
*                                  ASYNCHRONOUS OR SYNCHRONOUS @G860P46 33420200
*                                  PAGING-IN, FIX, OR          @G860P46 33449100
*                                  MIGRATION REQUESTS.         @G860P46 33478000
.SCV811D ANOP                                       @(DCR732)  @G860P46 33506900
SCVTDFCS DC    A(0) -              ANCHOR FOR SMSX GLOBAL CONTROL  @LBC 33528600
*                                  STRUCTURE. OWNERSHIP: DFP            33550300
*                                  SERIALIZATION: NONE                  33572000
SCVTPIQE DC    V(IEADQIQE) -       ADDR OF RESIDENT SUBROUTINE IN EOT   33594002
*                                  TO REMOVE IQE'S FROM ASYNCHRONOUS    33596002
*                                  EXIT QUEUE                    ICB378 33598002
SCVTGAMP DC    A(0) -              POINTER TO GAM CONTROL BLOCKS.  @LFA 33604600
*                                  OWNERSHIP: GRAPHICS ACCESS METHOD    33611200
*                                  (GAM).                               33617800
*                                  SERIALIZATION: COMPARE AND SWAP.     33624400
SCVTGAMS DC    A(0) -              POINTER TO GAM SQA AREA.        @LFA 33631000
*                                  OWNERSHIP: GRAPHICS ACCESS METHOD    33637600
*                                  (GAM).                               33644200
*                                  SERIALIZATION: COMPARE AND SWAP.     33650800
SCVTCCVT DC    A(0) -              POINTER TO THE CRYPTOGRAPHY     @02A 33653000
*                                  CVT.                                 33655200
*                                  OWNERSHIP: INTEGRATED CRYPTOGRAPHIC  33657400
*                                  SERVICE FACILITY/MVS  (ICSF/MVS)     33659600
*                                  SERIALIZATION: NONE.                 33661800
SCVTDIS  DC    V(IEAVTDIS)         ENTRY POINT OF MEMTERM          @D8A 33664000
*                                  DISABLE/ENABLE SERVICE.              33670600
*                                  OWNERSHIP: RTM.                      33677200
*                                  SERIALIZATION:  N/A                  33684600
SCVTR0C0 DC    XL8'00'             RESERVED.                       @D8A 33699200
         AIF   ('&DSECT' EQ 'YES').JAFQ1A                          @LCA 33713800
         EXTRN IGGQJOPN                                            @LEC 33728400
SCVTQOPN DC    A(IGGQJOPN+X'80000000') ADDR OF THE IGGQJOPN RTN    @LEC 33743000
*                                  SERIALIZATION:  N/A                  33757800
         AGO   .JAFQ1B                                             @LDA 33768100
.JAFQ1A  ANOP                                                      @LDA 33778400
SCVTQOPN DC    V(IGGQJOPN)         ADDR OF THE IGGQJOPN RTN        @LEC 33788700
*                                  SERIALIZATION:  N/A                  33799000
.JAFQ1B  ANOP                                                      @LDA 33809300
SCVTDLFB DC    A(0) -              ANCHOR TO THE DLF CONTROL BLOCK @P1A 33820000
*                                  OWNERSHIP:  DLF.                     33870000
*                                  SERIALIZATION:  CS.                  33920000
SCVTR0D0 DC    XL16'00'            RESERVED.                       @P1C 33970000
         POP   PRINT                                                    34270200
         MEND  , */                                                     34282400
*%SCVTL2 :  ;                                                           34300002
*                                                                       37650002
*  @LISTPUSH;                                                  /*@L5A*/ 37678500
*  %IF IHALIST='YES' %THEN                                     /*@L5A*/ 37707000
*     %GOTO SCVTLST;                                           /*@L5A*/ 37735500
*  @LISTOFF;                                                   /*@L5A*/ 37764000
*  %SCVTLST:;                                                  /*@L5A*/ 37792500
*                                                                       37821000
*DECLARE                                                                37850002
*  1 SCVTSECT BASED(SCVTSPTR)  BDY(WORD),                               37900000
*   2 SCVTPGTM    PTR(31),               /* ADDR OF EOT TIMER PURGE     38500002
*                                           ROUTINE. (POINTER           38550000
*                                           DEFINED ADDRESS).           38600000
*                                                  @(DCR571) @G860P46*/ 38650000
*   2 SCVTPGWR    PTR(31),               /* ADDRESS OF WTO/WTOR         38700000
*                                           RESOURCE MANAGER.           38750000
*                                           INITIALLY CONTAINS          38800000
*                                           ADDRESS OF BR 14.           38850000
*                                           CHANGED TO IEECVPRG         38900000
*                                           (MODULE IEAVMED2) BY        38950000
*                                           COMMUNICATIONS TASK         39000000
*                                           INITIALIZATION              39050000
*                                           (IEAVVINT).        MDC013*/ 39100000
*   2 SCVTDSPA    PTR(31),               /* ANCHOR FOR SYSTEM/370       39150000
*                                           SNA/DS DISTRIBUTION         39200000
*                                           SERVICES PRODUCT.    @D6A*/ 39250000
*   2 SCVTBR14    CHAR(2),               /* A BR 14 INSTRUCTION.        39300000
*                                           RETURN TO CALLER.  MDC014*/ 39350000
*   2 SCVTVLFC    FIXED(16),             /* COUNT OF THE NUMBER OF      39366600
*                                           TIMES VLF IS STARTED        39383200
*                                           OWNERSHIP:  VLF.            39399800
*                                           SERIALIZATION: NONE  @05C*/ 39416400
*   2 *           PTR(31),               /* ** SCVTTERAS FIELD UNUSED   39433300
*                                           IN OS/VS2 REL 2 **          39483300
*                                                  @(DCR560) @G860P46*/ 39566500
*   2 SCVTBWTO    PTR(31),               /* ADDRESS OF BRANCH-ENTRY     39616500
*                                           WTO AND WTOR.  MUST BE      39666500
*                                           ADDRESSABLE IN 24-BIT       39716500
*                                           MODE.                @LCA*/ 39766500
*   2 SCVTBDOM    PTR(31),               /* ADDRESS OF BRANCH-ENTRY     39816500
*                                           DOM.  MUST BE ADDRESSABLE   39866500
*                                           IN 24-BIT MODE.      @LCA*/ 39916500
*   2 SCVTRMBR    PTR(31),               /* ADDR OF REGMAIN BRANCH      46200002
*                                           ENTRY                    */ 46900002
*   2 SCVTCHSI    PTR(31),               /* POINTER TO THE IOS CHANNEL  46950000
*                                           SUBSYSTEM INFORMATION       47000000
*                                           BLOCK                @01C*/ 47050000
*   2 SCVTRACE    PTR(31),               /* ADDR OF POINTER TO TRACE    49000002
*                                           ROUTINE                  */ 49700002
*   2 SCVTHSCS    PTR(31),               /* ADDR OF SLIH FOR HPPI       49750000
*                                           EXTERNAL INTERRUPTS.        49800000
*                                           OWNERSHIP: HPPI SOFTWARE.   49850000
*                                                                @04C*/ 49900000
*   2 SCVTSORM    PTR(31),               /* ADDRESS OF SDOM RESOURCE    50000000
*                                           MANAGER (COFMSORM).         50050000
*                                           OWNERSHIP: VLF.             50100000
*                                           SERIALIZATION: NONE. @LDC*/ 50150000
*   2 SCVTLFRM    PTR(31),               /* LIST FORMAT FREEMAIN        53200002
*                                           BRANCH ENT PT            */ 53900002
*   2 SCVTSDOB    PTR(31),               /* ADDRESS OF SHARED DATA      53940000
*                                           OBJECT MANAGER BLOCK.       53980000
*                                           OWNERSHIP:  VLF.            54020000
*                                           SERIALIZATION:  CS.  @LDC*/ 54070000
*   2 SCVTMCA     PTR(31),               /* ANCHOR FOR MVS MESSAGE      54120000
*                                           SERVICE DATA AREA.          54170000
*                                           OWNERSHIP: MVS MESSAGE      54220000
*                                                      SERVICE.         54270000
*                                           SERIALIZATION: LOCAL AND    54320000
*                                                          CMS LOCKS.   54370000
*                                                                @D7A*/ 54420000
*   2 SCVTNETV    PTR(31),               /* NETVIEW CONTROL STRUCTURE   54470000
*                                           ANCHOR. OWNERSHIP: NETVIEW. 54520000
*                                           SERIALIZATION: NONE. @03C*/ 54570000
*   2 SCVTRPTR    PTR(31),               /* ADDR OF TRACE TABLE         58100002
*                                           POINTERS                 */ 58800002
*   2 SCVTGMBR    PTR(31),               /* LIST FORMAT GETMAIN         59500002
*                                           BRANCH ENT PT            */ 60200002
*   2 SCVTRG2     PTR(31),               /* ENTRY POINT ADDRESS OF      60250000
*                                           IEAVTRG2, RTM2 24 BIT       60300000
*                                           ADDRESSING MODE INTERFACE   60350000
*                                           ROUTINE.                    60400000
*                                                  @(DCR854) @G860P46*/ 60450000
*   2 SCVTRG2B    PTR(31),               /* ADDRESS OF SECOND ENTRY     60500000
*                                           POINT IN IEAVTRG2, RTM2     60550000
*                                           24 BIT ADDRESSING MODE      60600000
*                                           INTERFACE ROUTINE.          60650000
*                                                  @(DCR854) @G860P46*/ 60700000
*   2 SCVTRTXT    PTR(31),               /* ADDRESS OF MODULE IEECB867. 60750000
*                                           MODULE PROVIDES CALLER WITH 60800000
*                                           THE MESSAGE TEXT ASSOCIATED 60850000
*                                           WITH THE RETURN CODE        60900000
*                                           PROVIDED BY SVC SUMP WHEN   60950000
*                                           IT FAILED TO TAKE A DUMP.   61000000
*                                           OWNERSHIP: SVC DUMP. @L7C*/ 61050000
*   2 SCVTAMSP    FIXED(31),             /* ADDRESS OF SYSTEM           61100000
*                                           AVAILABILITY MANAGER(SAM)   61150000
*                                           WHEN SAM IS ACTIVE.         61200000
*                                           OWNERSHIP: SAM.             61250000
*                                           SERIALIZATION: NONE.        61300000
*                                                            @ZA93009*/ 61350000
*   2 SCVTASRS    PTR(31),               /* POINTER TO SYMPTOM RECORDS  61400000
*                                           GLOBAL TABLE         @L8A*/ 61450000
*   2 SCVTSYMR    PTR(31),               /* POINTER TO THE SYMREC       61500000
*                                           RESOURCE MANAGER     @D2C*/ 61550000
*   2 SCVTDOPX    PTR(31),               /* ADDRESS OF IEAVTRDX ROUTINE 61600000
*                                           INVOKED BY SETRP WHEN       61650000
*                                           DUMPOX IS SPECIFIED.        61700000
*                                           OWNERSHIP: RTM       @LAC*/ 61750000
*   2 SCVTCPLS    PTR(31),               /* ADDRESS OF VSM CELL POOL    61800000
*                                           LIST SERVICE.               61850000
*                                           OWNERSHIP: VSM       @D3C*/ 61900000
*   2 SCVTDIV     PTR(31),               /* POINTER TO THE DIV          70800000
*                                           INFORMATION BLOCK    @L6A*/ 70850000
*   2 SCVTDIVM    PTR(31),               /* POINTER TO THE DIV RESOURCE 70900000
*                                           MANAGER              @L6A*/ 70950000
*   2 SCVTCTR1    PTR(31),               /* RESERVED.            @L4C*/ 71000000
*   2 SCVTCTAB    PTR(31),               /* COMPONENT TRACE ANCHOR      71050000
*                                           BLOCK.                      71100000
*                                           OWNERSHIP: COMPONENT TRACE. 71150000
*                                           SERIALIZATION: ENQ/DEQ.     71200000
*                                                                @D4C*/ 71250000
*   2 SCVTRXLQ    PTR(31),               /* ADDR OF RECOVERY EXTENT     75600002
*                                           LIST                     */ 76300002
*   2 SCVTCGT     PTR(31),               /* POINTER TO IHACGT           76350000
*                                           SERIALIZATION:  CS.  @LDC*/ 76550000
*   2 SCVTJOPN    PTR(31),               /* ADDRESS OF THE IDAVJOPN     76600000
*                                           RTN                         76650000
*                                           SERIALIZATION:  N/A  @LDC*/ 76800000
*   2 SCVTSVCT    PTR(31),               /* ORIGIN OF SVC TABLE      */ 79800002
*   2 SCVTSVCR    PTR(31),               /* ADDRESS OF SVC UPDATE       80500000
*                                           RECORDING TABLE      @L5A*/ 81200000
*   2 SCVTTQE     PTR(31),               /* ADDR OF TSO SUBSYSTEM'S     81900002
*                                           TQE                      */ 82600002
*   2 SCVTTTRM    PTR(31),               /* TSO TASK TERMINATION        83300000
*                                           RESOURCE MANAGER @ZA78798*/ 84000000
*   2 SCVTSTAT    PTR(31),               /* ADDR OF SVC STATUS          84700002
*                                           ROUTINE (IGC07902) ICB339*/ 85400002
*   2 SCVTQCBR    PTR(31),               /* BRANCH ENTRY POINT TO       86100002
*                                           GETMAIN/FREEMAIN            86800002
*                                           QUICKCELL ROUTINE  ICB339*/ 87500002
*   2 SCVTVLFB    PTR(31),               /* VLF COMMON DATA BLOCK       87530000
*                                           ADDRESS.                    87560000
*                                           OWNERSHIP: VLF.             87590000
*                                           SERIALIZATION: CS.   @D5C*/ 87620000
*   2 SCVTHSCT    PTR(31),               /* ADDRESS OF HPPI             87656000
*                                           SOFTWARE DATA AREA.         87692000
*                                           OWNERSHIP: HPPI SOFTWARE.   87728000
*                                                                @04C*/ 87764000
*   2 SCVTPTRM    PTR(31),               /* ADDR OF PAGING   @G860P46   87800000
*                                           SUPERVISOR       @G860P46   87850000
*                                           ROUTINE          @G860P46   87900000
*                                           (IARGTERM) TO    @G860P46   87950000
*                                           QUIESCE          @G860P46   88000000
*                                           ASYNCHRONOUS OR  @G860P46   88050000
*                                           SYNCHRONOUS      @G860P46   88100000
*                                           PAGING-IN, FIX   @G860P46   88150000
*                                           OR MIGRATION     @G860P46   88200000
*                                           REQUESTS.        @G860P46   88250000
*                                                 @(DCR732)  @G860P46*/ 88300000
*   2 SCVTDFCS    PTR(31),               /* ANCHOR FOR SMSX GLOBAL      88350000
*                                           STRUCTURE.                  88400000
*                                           OWNERSHIP: DFP              88450000
*                                           SERIALIZATION: NONE  @LBC*/ 88500000
*   2 SCVTPIQE    PTR(31),               /* ADDRESS OF RESIDENT         88900002
*                                           SUBROUTINE (IEADQIQE) IN    88950002
*                                           EOT TO REMOVE IQE'S FROM    89000002
*                                           ASYNCHRONOUS EXIT           89050002
*                                           QUEUE              ICB378*/ 89100002
*   2 SCVTGAMP    PTR(31),               /* POINTER TO GAM CONTROL      89113400
*                                           BLOCKS.                     89126800
*                                           OWNERSHIP: GRAPHICS ACCESS  89140200
*                                           METHOD (GAM).               89153600
*                                           SERIALIZATION: COMPARE AND  89167000
*                                           SWAP.                @LFA*/ 89180400
*   2 SCVTGAMS    PTR(31),               /* POINTER TO GAM SQA AREA.    89193800
*                                           OWNERSHIP: GRAPHICS ACCESS  89207200
*                                           METHOD (GAM).               89220600
*                                           SERIALIZATION: COMPARE AND  89234000
*                                           SWAP.                @LFA*/ 89247400
*   2 SCVTCCVT    PTR(31),               /* POINTER TO THE CRYPTOGRAPHY 89253100
*                                           CVT.                        89258800
*                                           OWNERSHIP: INTEGRATED       89264500
*                                           CRYPTOGRAPHIC SERVICE       89270200
*                                           FACILITY/MVS  (ICSF/MVS).   89275900
*                                           SERIALIZATION: NONE  @02A*/ 89281600
*   2 SCVTDIS     PTR(31),               /* ENTRY POINT OF MEMTERM      89287600
*                                           DISABLE/ENABLE SERVICE.     89301000
*                                           OWNERSHIP: RTM.             89314400
*                                           SERIALIZATION:  N/A. @D8A*/ 89327800
*   2 SCVTR0C0    CHAR(8),               /* RESERVED.            @D8A*/ 89341200
*   2 SCVTQOPN    PTR(31),               /* ADDRESS OF THE IGGQJOPN     89356000
*                                           RTN                         89360000
*                                           SERIALIZATION:  N/A  @LDA*/ 89364000
*   2 SCVTDLFB    PTR(31),               /* ANCHOR TO THE DLF CONTROL   89370000
*                                           BLOCK                       89376000
*                                           OWNERSHIP: DLF.             89382000
*                                           SERIALIZATION: CS.   @P1A*/ 89388000
*   2 SCVTR0D0    CHAR(16);              /* RESERVED.            @P1C*/ 89394000
*  @LISTPOP;                                                    /*L5A*/ 89400000
