*        %GOTO PLSSCFS;    /*                                           00050000
         MACRO                                                          00100000
         IHASCFS &LIST=NO                                               00150000
**/                                                                     00200000
*%PLSSCFS : ;                                                           00250000
*/** START OF SPECIFICATIONS *****************************************/ 00300000
*/*01* PROPRIETARY STATEMENT =                                   @L1C*/ 00302500
*/*                                                                  */ 00305000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00307500
*/*   THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                   */ 00308000
*/*   5647-A01 (C) COPYRIGHT IBM CORP. 1988, 2000                    */ 00308500
*/*                                                                  */ 00309000
*/*01* STATUS: HBB7703                                               */ 00309500
*/*                                                                  */ 00310000
*/*01* ACRONYM: SCFS                                                 */ 00310500
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 00321000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00331500
*/*01* PROPRIETARY STATEMENT:                                        */ 00342000
*/*01* DESCRIPTIVE NAME:  SUPERVISOR CONTROL FLIH SAVEAREA           */ 00352500
*/*01* MACRO NAME:  IHASCFS                                          */ 00363000
*/*01* DSECT NAME:  SCFS                                             */ 00373500
*/*01* COMPONENT: SUPERVISOR CONTROL (SC1C5)                         */ 00384000
*/*01* EYE-CATCHER:  SCFS                                            */ 00394500
*/*02*   OFFSET:         0                                           */ 00405000
*/*02*   LENGTH:         4                                           */ 00415500
*/*01* STORAGE ATTRIBUTES:                                           */ 00426000
*/*02*   MAIN STORAGE:                                               */ 00436500
*/*02*   VIRTUAL STORAGE:                                            */ 00447000
*/*02*   AUXILIARY STORAGE:                                          */ 00457500
*/*02*   DATA SPACE:                                                 */ 00468000
*/*02*   SUBPOOL:         239 (FETCH-PROTECTED)                      */ 00478500
*/*02*   KEY:              0                                         */ 00489000
*/*02*   RESIDENCY:                                                  */ 00499500
*/*01* SIZE: 824 BYTES                                               */ 00510000
*/*                                                                  */ 00521400
*/*01* CREATED BY:                                                   */ 00571400
*/*      NIP AND RECONFIGURATION                                     */ 00621400
*/*                                                                  */ 00850000
*/*01* DELETED BY:                                                   */ 00858300
*/*      RECONFIGURATION IN OFFLINE PROCESSING                       */ 00866600
*/*                                                                  */ 00875000
*/*01* POINTED TO BY:                                                */ 00893700
*/*      PSASCFS                                                     */ 00912400
*/*      WSACSCFS                                                    */ 00931100
*/*                                                                  */ 00950000
*/*01* SERIALIZATION:  DISABLEMENT                                   */ 00975000
*/*                                                                  */ 01000000
*/*01* FUNCTION:                                                     */ 01050000
*/*      CONTAINS STATUS INFORMATION SAVED BY THE EXTERNAL FLIH AND  */ 01100000
*/*      THE I/O FLIH.                                               */ 01150000
*/*                                                                  */ 01200000
*/*01* METHOD OF ACCESS:                                             */ 01250000
*/*      BAL   - DSECT IS PRODUCED, PERFORM USING ON SCFS            */ 01300000
*/*      BAL LISTING   - SPECIFY LIST=YES ON MACRO CALL.             */ 01325000
*/*      PL/AS - BASED STRUCTURE IS PRODUCED.                        */ 01350000
*/*              BASED ON PSASCFS.                                   */ 01400000
*/*      PL/AS LISTING - SPECIFY %IHALIST='YES' PRIOR TO INCLUDE.    */ 01425000
*/*                                                                  */ 01450000
*/*01* DEPENDENCIES:                                                 */ 02255000
*/*     1. THE IHAWSAVT MACRO MUST BE UPDATED TO REFLECT ANY LENGTH  */ 02257500
*/*        CHANGE TO THE IHASCFS.                                    */ 02260000
*/*     2. THE CROSS MEMORY CONTROL REGISTERS (CR3 AND CR4) MUST BE  */ 02262500
*/*        ON A DOUBLE WORD. THIS IS NECESSARY FOR THE LASP          */ 02265000
*/*        INSTRUCTION.                                              */ 02267500
*/*                                                                  */ 02270000
*/*01* DISTRIBUTION LIBRARY: APVTMACS                                */ 02350000
*/*                                                                  */ 02581600
*/*                                                                  */ 02595200
*/* END OF SPECIFICATIONS                                            */ 02636000
*/********************************************************************/ 02650000
*        %GOTO PLSSCFS1;                                             /* 02700000
.*                                                                      02750000
.*********************************************************************  02800000
.*                                                                      02850000
.*   CHANGE ACTIVITY =                                                  02900000
.*                                                                      02950000
.*  $L0=AR       HBB3310  850903  PD16Q9:  ACCESS REGISTERS             03000000
.*  $P1=PC40147  HBB3310  860710  PD16LD:  FIX NAME OF RESERVED FIELD   03025000
.*  $D1=DCR0199  HBB3310  870225  PD16Q9:  ALIGN SCFS ON CACHE BOUNDARY 03037500
.*  $P2=PC40800  HBB3310  870415  PD16Q9:  XM REGS MUST BE ON DWORD BDY 03043700
.*  $L1=SUBSP    HBB5510  921203  PD16IW:  SUBSPACES                    03046800
.*  $L2=SUBSP    HBB5510  930520  PD16IW:  SUBSPACES-REMOVE SCAFFOLDING 03048400
.*  $L3=PR510    HBB5510  930623  PD16ST:  SHOWHDR COMPLIANCE - SAR     03049200
.*  $L4=64BITSUP HBB7703  971101  PD00XB:  LARGER REGS                  03049600
.*                                                                      03050000
.*********************************************************************  03100000
.*                                                                      03150000
         PUSH  PRINT                                                    03158300
         AIF   ('&LIST' EQ 'YES').SCFSLST                               03166600
         PRINT OFF                                                      03174900
.SCFSLST ANOP                                                           03183200
         SPACE                                                          03191500
SCFS     DSECT                                                          03200000
SCFSSCFS DC   CL4'SCFS'    SCFS ACRONYM.                                03250000
*                                                                       03350000
*********************************************************************   03358300
*                                                                   *   03366600
*            I/O FLIH GENERAL REGISTER SAVEAREA 1                   *   03366700
*                                                                   *   03366800
*********************************************************************   03366900
SCFSIGR1 DS   0XL64        I/O FLIH GENERAL REGISTER SAVEAREA 1.   @D1M 03367000
SCFSI1G0 DC   F'0'         GENERAL REGISTER 0                      @D1M 03367100
SCFSI1G1 DC   F'0'         GENERAL REGISTER 1                      @D1M 03367200
SCFSI1G2 DC   F'0'         GENERAL REGISTER 2                      @D1M 03367300
SCFSI1G3 DC   F'0'         GENERAL REGISTER 3                      @D1M 03367400
SCFSI1G4 DC   F'0'         GENERAL REGISTER 4                      @D1M 03367500
SCFSI1G5 DC   F'0'         GENERAL REGISTER 5                      @D1M 03367600
SCFSI1G6 DC   F'0'         GENERAL REGISTER 6                      @D1M 03367700
SCFSI1G7 DC   F'0'         GENERAL REGISTER 7                      @D1M 03367800
SCFSI1G8 DC   F'0'         GENERAL REGISTER 8                      @D1M 03367900
SCFSI1G9 DC   F'0'         GENERAL REGISTER 9                      @D1M 03368000
SCFSI1GA DC   F'0'         GENERAL REGISTER 10                     @D1M 03368100
SCFSI1GB DC   F'0'         GENERAL REGISTER 11                     @D1M 03368200
SCFSI1GC DC   F'0'         GENERAL REGISTER 12                     @D1M 03368300
SCFSI1GD DC   F'0'         GENERAL REGISTER 13                     @D1M 03368400
SCFSI1GE DC   F'0'         GENERAL REGISTER 14                     @D1M 03368500
SCFSI1GF DC   F'0'         GENERAL REGISTER 15                     @D1M 03368600
*********************************************************************   03368700
*                                                                   *   03368800
*            I/O FLIH ACCESS REGISTER SAVEAREA 1                    *   03368900
*                                                                   *   03369000
*********************************************************************   03369100
SCFSIAR1 DS   0XL64        I/O FLIH ACCESS REGISTER SAVEAREA 1.    @D1M 03369200
SCFSI1A0 DC   F'0'         ACCESS REGISTER 0                       @D1M 03369300
SCFSI1A1 DC   F'0'         ACCESS REGISTER 1                       @D1M 03369400
SCFSI1A2 DC   F'0'         ACCESS REGISTER 2                       @D1M 03369500
SCFSI1A3 DC   F'0'         ACCESS REGISTER 3                       @D1M 03369600
SCFSI1A4 DC   F'0'         ACCESS REGISTER 4                       @D1M 03369700
SCFSI1A5 DC   F'0'         ACCESS REGISTER 5                       @D1M 03369800
SCFSI1A6 DC   F'0'         ACCESS REGISTER 6                       @D1M 03369900
SCFSI1A7 DC   F'0'         ACCESS REGISTER 7                       @D1M 03370000
SCFSI1A8 DC   F'0'         ACCESS REGISTER 8                       @D1M 03370100
SCFSI1A9 DC   F'0'         ACCESS REGISTER 9                       @D1M 03370200
SCFSI1AA DC   F'0'         ACCESS REGISTER 10                      @D1M 03370300
SCFSI1AB DC   F'0'         ACCESS REGISTER 11                      @D1M 03370400
SCFSI1AC DC   F'0'         ACCESS REGISTER 12                      @D1M 03370500
SCFSI1AD DC   F'0'         ACCESS REGISTER 13                      @D1M 03370600
SCFSI1AE DC   F'0'         ACCESS REGISTER 14                      @D1M 03370700
SCFSI1AF DC   F'0'         ACCESS REGISTER 15                      @D1M 03370800
*                                                                       03370900
*********************************************************************   03371200
*                                                                   *   03371300
*            I/O FLIH CONTROL REGISTER SAVEAREA 1                   *   03371400
*                                                                   *   03371500
*********************************************************************   03371600
SCFSICR1 DS   0XL64        I/O FLIH CONTROL REGISTER SAVEAREA 1.   @D1M 03371700
SCFSI1C0 DC   F'0'         CONTROL REGISTER 0                      @D1M 03371800
SCFSI1C1 DC   F'0'         CONTROL REGISTER 1                      @D1M 03371900
SCFSI1C2 DC   F'0'         CONTROL REGISTER 2                      @D1M 03372000
SCFSIXM1 DS   0CL8         CROSS MEMORY CONTROL REGISTER SAVEAREA  @D1M 03372100
SCFSI1C3 DS   0F           CONTROL REGISTER 3                      @D1M 03372200
SCFSIO1K DC   H'0'         PROGRAM KEY MASK                        @D1M 03372300
SCFSIO1S DC   H'0'         SASN                                    @D1M 03372400
SCFSI1C4 DS   0F           CONTROL REGISTER 4                      @D1M 03372500
SCFSIO1A DC   H'0'         AX                                      @D1M 03372600
SCFSIO1P DC   H'0'         PASN                                    @D1M 03372700
SCFSI1C5 DC   F'0'         CONTROL REGISTER 5                      @D1M 03372800
SCFSI1C6 DC   F'0'         CONTROL REGISTER 6                      @D1M 03372900
SCFSI1C7 DC   F'0'         CONTROL REGISTER 7                      @D1M 03373000
SCFSI1C8 DS   0F           CONTROL REGISTER 8                      @D1M 03373100
SCFSIEAX DC   H'0'         EAX VALUE                               @D1M 03373200
         DC   H'0'                                                 @D1M 03373300
SCFSI1C9 DC   F'0'         CONTROL REGISTER 9                      @D1M 03373400
SCFSI1CA DC   F'0'         CONTROL REGISTER 10                     @D1M 03373500
SCFSI1CB DC   F'0'         CONTROL REGISTER 11                     @D1M 03373600
SCFSI1CC DC   F'0'         CONTROL REGISTER 12                     @D1M 03373700
SCFSI1CD DC   F'0'         CONTROL REGISTER 13                     @D1M 03373800
SCFSI1CE DC   F'0'         CONTROL REGISTER 14                     @D1M 03373900
SCFSI1CF DC   F'0'         CONTROL REGISTER 15                     @D1M 03374000
*                                                                       03374100
SCFSIOFL DC   XL1'00'      I/O FLIH FLAGS                          @L1A 03374900
SCFSIOSA EQU  X'80'        SUBSPACE ACTIVE AT TIME OF INTERRUPT    @L1A 03375700
SCFSR0C5 DC   XL1'00'      RESERVED                                @L2C 03376500
*                                                                       03377300
SCFSXNTC DC   H'0'         EXTERNAL FLIH INTERRUPT CODE SAVE AREA. @D1A 03378100
SCFSXPS1 DC   XL8'00'      EXTERNAL FLIH PSW SAVEAREA 1.                03378900
*                                                                       03379700
*********************************************************************   03380500
*                                                                   *   03381300
*       EXTERNAL FLIH GENERAL REGISTER SAVEAREA 1                   *   03382100
*                                                                   *   03383200
*********************************************************************   03391500
SCFSXGR1 DS   0XL64        EXTERNAL FLIH GENERAL REGISTER SAVEAREA 1.   03400000
SCFSX1G0 DC   F'0'         GENERAL REGISTER 0                           03438600
SCFSX1G1 DC   F'0'         GENERAL REGISTER 1                           03477200
SCFSX1G2 DC   F'0'         GENERAL REGISTER 2                           03515800
SCFSX1G3 DC   F'0'         GENERAL REGISTER 3                           03554400
SCFSX1G4 DC   F'0'         GENERAL REGISTER 4                           03593000
SCFSX1G5 DC   F'0'         GENERAL REGISTER 5                           03631600
SCFSX1G6 DC   F'0'         GENERAL REGISTER 6                           03670200
SCFSX1G7 DC   F'0'         GENERAL REGISTER 7                           03708800
SCFSX1G8 DC   F'0'         GENERAL REGISTER 8                           03747400
SCFSX1G9 DC   F'0'         GENERAL REGISTER 9                           03786000
SCFSX1GA DC   F'0'         GENERAL REGISTER 10                          03824600
SCFSX1GB DC   F'0'         GENERAL REGISTER 11                          03863200
SCFSX1GC DC   F'0'         GENERAL REGISTER 12                          03901800
SCFSX1GD DC   F'0'         GENERAL REGISTER 13                          03940400
SCFSX1GE DC   F'0'         GENERAL REGISTER 14                          03979000
SCFSX1GF DC   F'0'         GENERAL REGISTER 15                          04017600
*********************************************************************   04056200
*                                                                   *   04094800
*       EXTERNAL FLIH ACCESS REGISTER SAVEAREA 1                    *   04133400
*                                                                   *   04172000
*********************************************************************   04210600
SCFSXAR1 DS   0XL64        EXTERNAL FLIH ACCESS REGISTER SAVEAREA 1.    04250000
SCFSX1A0 DC   F'0'         ACCESS REGISTER 0                            04288600
SCFSX1A1 DC   F'0'         ACCESS REGISTER 1                            04327200
SCFSX1A2 DC   F'0'         ACCESS REGISTER 2                            04365800
SCFSX1A3 DC   F'0'         ACCESS REGISTER 3                            04404400
SCFSX1A4 DC   F'0'         ACCESS REGISTER 4                            04443000
SCFSX1A5 DC   F'0'         ACCESS REGISTER 5                            04481600
SCFSX1A6 DC   F'0'         ACCESS REGISTER 6                            04520200
SCFSX1A7 DC   F'0'         ACCESS REGISTER 7                            04558800
SCFSX1A8 DC   F'0'         ACCESS REGISTER 8                            04597400
SCFSX1A9 DC   F'0'         ACCESS REGISTER 9                            04636000
SCFSX1AA DC   F'0'         ACCESS REGISTER 10                           04674600
SCFSX1AB DC   F'0'         ACCESS REGISTER 11                           04713200
SCFSX1AC DC   F'0'         ACCESS REGISTER 12                           04751800
SCFSX1AD DC   F'0'         ACCESS REGISTER 13                           04790400
SCFSX1AE DC   F'0'         ACCESS REGISTER 14                           04829000
SCFSX1AF DC   F'0'         ACCESS REGISTER 15                           04867600
*                                                                       04877200
SCFSR150 DC   F'0'         RESERVED-XMEM REGS MUST BE ON DWORD BDY @P2A 04886800
*                                                                       04896400
*********************************************************************   04906200
*                                                                   *   04944800
*       EXTERNAL FLIH CONTROL REGISTER SAVEAREA 1                   *   04983400
*                                                                   *   05022000
*********************************************************************   05060600
SCFSXCR1 DS   0XL64        EXTERNAL FLIH CONTROL REGISTER SAVEAREA 1.   05100000
SCFSX1C0 DC   F'0'         CONTROL REGISTER 0                           05150000
SCFSX1C1 DC   F'0'         CONTROL REGISTER 1                           05200000
SCFSX1C2 DC   F'0'         CONTROL REGISTER 2                           05250000
SCFSXXM1 DS   0CL8         CROSS MEMORY CONTROL REGISTER SAVEAREA1      05275000
SCFSX1C3 DS   0F           CONTROL REGISTER 3                           05300000
SCFSX1PK DC   H'0'         PROGRAM KEY MASK                             05350000
SCFSX1SS DC   H'0'         SASN                                         05400000
SCFSX1C4 DS   0F           CONTROL REGISTER 4                           05450000
SCFSX1AX DC   H'0'         AX                                           05500000
SCFSX1PS DC   H'0'         PASN                                         05550000
SCFSX1C5 DC   F'0'         CONTROL REGISTER 5                           05588000
SCFSX1C6 DC   F'0'         CONTROL REGISTER 6                           05626000
SCFSX1C7 DC   F'0'         CONTROL REGISTER 7                           05664000
SCFSX1C8 DS   0F           CONTROL REGISTER 8                           05702000
SCFS1EAX DC   H'0'         EAX VALUE                                    05740000
         DC   H'0'                                                      05778000
SCFSX1C9 DC   F'0'         CONTROL REGISTER 9                           05816000
SCFSX1CA DC   F'0'         CONTROL REGISTER 10                          05854000
SCFSX1CB DC   F'0'         CONTROL REGISTER 11                          05892000
SCFSX1CC DC   F'0'         CONTROL REGISTER 12                          05930000
SCFSX1CD DC   F'0'         CONTROL REGISTER 13                          05968000
SCFSX1CE DC   F'0'         CONTROL REGISTER 14                          06006000
SCFSX1CF DC   F'0'         CONTROL REGISTER 15                          06044000
SCFSR194 DC   F'0'         RESERVED.                               @P2A 06063000
*                                                                       06082000
SCFSXPS2 DC   XL8'00'      EXTERNAL FLIH PSW SAVEAREA 2.                06120000
*                                                                       06158000
*********************************************************************   06196000
*                                                                   *   06234000
*       EXTERNAL FLIH GENERAL REGISTER SAVEAREA 2                   *   06272000
*                                                                   *   06310000
*********************************************************************   06348000
SCFSXGR2 DS   0XL64        EXTERNAL FLIH GENERAL REGISTER SAVEAREA 2.   06386000
SCFSX2G0 DC   F'0'         GENERAL REGISTER 0                           06424000
SCFSX2G1 DC   F'0'         GENERAL REGISTER 1                           06462000
SCFSX2G2 DC   F'0'         GENERAL REGISTER 2                           06500000
SCFSX2G3 DC   F'0'         GENERAL REGISTER 3                           06538000
SCFSX2G4 DC   F'0'         GENERAL REGISTER 4                           06576000
SCFSX2G5 DC   F'0'         GENERAL REGISTER 5                           06614000
SCFSX2G6 DC   F'0'         GENERAL REGISTER 6                           06652000
SCFSX2G7 DC   F'0'         GENERAL REGISTER 7                           06690000
SCFSX2G8 DC   F'0'         GENERAL REGISTER 8                           06728000
SCFSX2G9 DC   F'0'         GENERAL REGISTER 9                           06766000
SCFSX2GA DC   F'0'         GENERAL REGISTER 10                          06804000
SCFSX2GB DC   F'0'         GENERAL REGISTER 11                          06842000
SCFSX2GC DC   F'0'         GENERAL REGISTER 12                          06880000
SCFSX2GD DC   F'0'         GENERAL REGISTER 13                          06918000
SCFSX2GE DC   F'0'         GENERAL REGISTER 14                          06956000
SCFSX2GF DC   F'0'         GENERAL REGISTER 15                          06994000
*********************************************************************   07032000
*                                                                   *   07070000
*       EXTERNAL FLIH ACCESS REGISTER SAVEAREA 2                    *   07108000
*                                                                   *   07146000
*********************************************************************   07184000
SCFSXAR2 DS   0XL64        EXTERNAL FLIH ACCESS REGISTER SAVEAREA 2.    07222000
SCFSX2A0 DC   F'0'         ACCESS REGISTER 0                            07260000
SCFSX2A1 DC   F'0'         ACCESS REGISTER 1                            07298000
SCFSX2A2 DC   F'0'         ACCESS REGISTER 2                            07336000
SCFSX2A3 DC   F'0'         ACCESS REGISTER 3                            07374000
SCFSX2A4 DC   F'0'         ACCESS REGISTER 4                            07412000
SCFSX2A5 DC   F'0'         ACCESS REGISTER 5                            07450000
SCFSX2A6 DC   F'0'         ACCESS REGISTER 6                            07488000
SCFSX2A7 DC   F'0'         ACCESS REGISTER 7                            07526000
SCFSX2A8 DC   F'0'         ACCESS REGISTER 8                            07564000
SCFSX2A9 DC   F'0'         ACCESS REGISTER 9                            07602000
SCFSX2AA DC   F'0'         ACCESS REGISTER 10                           07640000
SCFSX2AB DC   F'0'         ACCESS REGISTER 11                           07678000
SCFSX2AC DC   F'0'         ACCESS REGISTER 12                           07716000
SCFSX2AD DC   F'0'         ACCESS REGISTER 13                           07754000
SCFSX2AE DC   F'0'         ACCESS REGISTER 14                           07792000
SCFSX2AF DC   F'0'         ACCESS REGISTER 15                           07830000
*                                                                       07839500
SCFSR220 DC   F'0'         RESERVED-XMEM REGS MUST BE ON DWORD BDY @D1C 07849000
*                                                                       07858500
*********************************************************************   07868000
*                                                                   *   07906000
*       EXTERNAL FLIH CONTROL REGISTER SAVEAREA 2                   *   07944000
*                                                                   *   07982000
*********************************************************************   08020000
SCFSXCR2 DS   0XL64        EXTERNAL FLIH CONTROL REGISTER SAVEAREA 2.   08058000
SCFSX2C0 DC   F'0'         CONTROL REGISTER 0                           08096000
SCFSX2C1 DC   F'0'         CONTROL REGISTER 1                           08134000
SCFSX2C2 DC   F'0'         CONTROL REGISTER 2                           08172000
SCFSXXM2 DS   0CL8         CROSS MEMORY CONTROL REGISTER SAVEAREA2      08191000
SCFSX2C3 DS   0F           CONTROL REGISTER 3                           08210000
SCFSX2PK DC   H'0'         PROGRAM KEY MASK                             08250000
SCFSX2SS DC   H'0'         SASN                                         08300000
SCFSX2C4 DS   0F           CONTROL REGISTER 4                           08350000
SCFSX2AX DC   H'0'         AX                                           08400000
SCFSX2PS DC   H'0'         PASN                                         08450000
SCFSX2C5 DC   F'0'         CONTROL REGISTER 5                           08500000
SCFSX2C6 DC   F'0'         CONTROL REGISTER 6                           08550000
SCFSX2C7 DC   F'0'         CONTROL REGISTER 7                           08600000
SCFSX2C8 DS   0F           CONTROL REGISTER 8                           08650000
SCFS2EAX DC   H'0'         EAX VALUE                                    08700000
         DC   H'0'                                                      08750000
SCFSX2C9 DC   F'0'         CONTROL REGISTER 9                           08786900
SCFSX2CA DC   F'0'         CONTROL REGISTER 10                          08823800
SCFSX2CB DC   F'0'         CONTROL REGISTER 11                          08860700
SCFSX2CC DC   F'0'         CONTROL REGISTER 12                          08897600
SCFSX2CD DC   F'0'         CONTROL REGISTER 13                          08934500
SCFSX2CE DC   F'0'         CONTROL REGISTER 14                          08971400
SCFSX2CF DC   F'0'         CONTROL REGISTER 15                          09008300
*                                                                       09045200
SCFSR264 DC   F'0'         RESERVED.                               @D1C 09063600
SCFSXPS3 DC   XL8'00'      EXTERNAL FLIH PSW SAVEAREA 3.                09082100
*                                                                       09119000
*********************************************************************   09155900
*                                                                   *   09192800
*       EXTERNAL FLIH GENERAL REGISTER SAVEAREA 3                   *   09229700
*                                                                   *   09266600
*********************************************************************   09303500
SCFSXGR3 DS   0XL64        EXTERNAL FLIH GENERAL REGISTER SAVEAREA 3.   09340400
SCFSX3G0 DC   F'0'         GENERAL REGISTER 0                           09377300
SCFSX3G1 DC   F'0'         GENERAL REGISTER 1                           09414200
SCFSX3G2 DC   F'0'         GENERAL REGISTER 2                           09451100
SCFSX3G3 DC   F'0'         GENERAL REGISTER 3                           09488000
SCFSX3G4 DC   F'0'         GENERAL REGISTER 4                           09524900
SCFSX3G5 DC   F'0'         GENERAL REGISTER 5                           09561800
SCFSX3G6 DC   F'0'         GENERAL REGISTER 6                           09598700
SCFSX3G7 DC   F'0'         GENERAL REGISTER 7                           09635600
SCFSX3G8 DC   F'0'         GENERAL REGISTER 8                           09672500
SCFSX3G9 DC   F'0'         GENERAL REGISTER 9                           09709400
SCFSX3GA DC   F'0'         GENERAL REGISTER 10                          09746300
SCFSX3GB DC   F'0'         GENERAL REGISTER 11                          09783200
SCFSX3GC DC   F'0'         GENERAL REGISTER 12                          09820100
SCFSX3GD DC   F'0'         GENERAL REGISTER 13                          09857000
SCFSX3GE DC   F'0'         GENERAL REGISTER 14                          09893900
SCFSX3GF DC   F'0'         GENERAL REGISTER 15                          09930800
*********************************************************************   09967700
*                                                                   *   10004600
*       EXTERNAL FLIH ACCESS REGISTER SAVEAREA 3                    *   10041500
*                                                                   *   10078400
*********************************************************************   10115300
SCFSXAR3 DS   0XL64        EXTERNAL FLIH ACCESS REGISTER SAVEAREA 3.    10152200
SCFSX3A0 DC   F'0'         ACCESS REGISTER 0                            10189100
SCFSX3A1 DC   F'0'         ACCESS REGISTER 1                            10226000
SCFSX3A2 DC   F'0'         ACCESS REGISTER 2                            10262900
SCFSX3A3 DC   F'0'         ACCESS REGISTER 3                            10299800
SCFSX3A4 DC   F'0'         ACCESS REGISTER 4                            10336700
SCFSX3A5 DC   F'0'         ACCESS REGISTER 5                            10373600
SCFSX3A6 DC   F'0'         ACCESS REGISTER 6                            10410500
SCFSX3A7 DC   F'0'         ACCESS REGISTER 7                            10447400
SCFSX3A8 DC   F'0'         ACCESS REGISTER 8                            10484300
SCFSX3A9 DC   F'0'         ACCESS REGISTER 9                            10521200
SCFSX3AA DC   F'0'         ACCESS REGISTER 10                           10558100
SCFSX3AB DC   F'0'         ACCESS REGISTER 11                           10595000
SCFSX3AC DC   F'0'         ACCESS REGISTER 12                           10631900
SCFSX3AD DC   F'0'         ACCESS REGISTER 13                           10668800
SCFSX3AE DC   F'0'         ACCESS REGISTER 14                           10705700
SCFSX3AF DC   F'0'         ACCESS REGISTER 15                           10742600
*                                                                       10751800
SCFSR2F0 DC   F'0'         RESERVED-XMEM REGS MUST BE ON DWORD BDY @D1C 10761000
*                                                                       10770200
*********************************************************************   10779500
*                                                                   *   10816400
*       EXTERNAL FLIH CONTROL REGISTER SAVEAREA 3                   *   10853300
*                                                                   *   10890200
*********************************************************************   10927100
SCFSXCR3 DS   0XL64        EXTERNAL FLIH CONTROL REGISTER SAVEAREA 3.   10964000
SCFSX3C0 DC   F'0'         CONTROL REGISTER 0                           11000900
SCFSX3C1 DC   F'0'         CONTROL REGISTER 1                           11037800
SCFSX3C2 DC   F'0'         CONTROL REGISTER 2                           11074700
SCFSXXM3 DS   0CL8         CROSS MEMORY CONTROL REGISTER SAVEAREA3      11093100
SCFSX3C3 DS   0F           CONTROL REGISTER 3                           11111600
SCFSX3PK DC   H'0'         PROGRAM KEY MASK                             11150000
SCFSX3SS DC   H'0'         SASN                                         11200000
SCFSX3C4 DS   0F           CONTROL REGISTER 4                           11250000
SCFSX3AX DC   H'0'         AX                                           11300000
SCFSX3PS DC   H'0'         PASN                                         11350000
SCFSX3C5 DC   F'0'         CONTROL REGISTER 5                           11400000
SCFSX3C6 DC   F'0'         CONTROL REGISTER 6                           11450000
SCFSX3C7 DC   F'0'         CONTROL REGISTER 7                           11500000
SCFSX3C8 DS   0F           CONTROL REGISTER 8                           11550000
SCFS3EAX DC   H'0'         EAX VALUE                                    11600000
         DC   H'0'                                                      11650000
SCFSX3C9 DC   F'0'         CONTROL REGISTER 9                           11678500
SCFSX3CA DC   F'0'         CONTROL REGISTER 10                          11707000
SCFSX3CB DC   F'0'         CONTROL REGISTER 11                          11735500
SCFSX3CC DC   F'0'         CONTROL REGISTER 12                          11764000
SCFSX3CD DC   F'0'         CONTROL REGISTER 13                          11792500
SCFSX3CE DC   F'0'         CONTROL REGISTER 14                          11821000
SCFSX3CF DC   F'0'         CONTROL REGISTER 15                          11849500
*                                                                       11878000
SCFSR334 DC   F'0'         RESERVED.                               @D1C 11928000
SCFSI641 DC   64X'00'      I/O FLIH GPR BITS 0-31 SAVEAREA 1       @L4A 11978000
SCFSX641 DC   64X'00'      EXTERNAL FLIH GPR BITS 0-31 SAVEAREA 1  @L4A 12028000
         DS   0D                                                        12078000
SCFSXCRG1 DC  128X'00'     EXTERNAL FLIH CR SAVEAREA 1             @L4A 12128000
SCFSX642 DC   64X'00'      EXTERNAL FLIH GPR BITS 0-31 SAVEAREA 2  @L4A 12178000
SCFSX643 DC   64X'00'      EXTERNAL FLIH GPR BITS 0-31 SAVEAREA 3  @L4A 12228000
SCFSEND  DS   0D           END OF SCFS.                                 14900000
         POP  PRINT                                                     14925000
         MEND ,                                                      */ 14950000
*%PLSSCFS1 : ;                                                          15000000
*  @LISTPUSH;                                                           15007100
*  %IF IHALIST='YES'  %THEN                                             15014200
*     %GOTO PLSSCFS2;                                                   15021300
*  @LISTOFF;                                                            15028400
*  %PLSSCFS2:;                                                          15035500
*                                                                       15042600
*DECLARE                                                                15050000
* 1 SCFS BASED(PSASCFS),            /* SUPERVISOR CONTROL FLIH          15100000
*                                      SAVEAREA.                     */ 15150000
*   2 SCFSSCFS CHAR(4),             /* SCFS ACRONYM.                 */ 15200000
*      /*   I/O FLIH GENERAL REGISTER SAVEAREA 1.   */                  15250400
*   2 SCFSIGR1 CHAR(64) BDY(WORD),  /* I/O FLIH GENERAL REGISTER        15250800
*                                        SAVEAREA 1.             @D1M*/ 15251200
*     3 SCFSI1G0 FIXED(31),         /* GENERAL REGISTER 0.       @D1M*/ 15251600
*     3 SCFSI1G1 FIXED(31),         /* GENERAL REGISTER 1.       @D1M*/ 15252000
*     3 SCFSI1G2 FIXED(31),         /* GENERAL REGISTER 2.       @D1M*/ 15252400
*     3 SCFSI1G3 FIXED(31),         /* GENERAL REGISTER 3.       @D1M*/ 15252800
*     3 SCFSI1G4 FIXED(31),         /* GENERAL REGISTER 4.       @D1M*/ 15253200
*     3 SCFSI1G5 FIXED(31),         /* GENERAL REGISTER 5.       @D1M*/ 15253600
*     3 SCFSI1G6 FIXED(31),         /* GENERAL REGISTER 6.       @D1M*/ 15254000
*     3 SCFSI1G7 FIXED(31),         /* GENERAL REGISTER 7.       @D1M*/ 15254400
*     3 SCFSI1G8 FIXED(31),         /* GENERAL REGISTER 8.       @D1M*/ 15254800
*     3 SCFSI1G9 FIXED(31),         /* GENERAL REGISTER 9.       @D1M*/ 15255200
*     3 SCFSI1GA FIXED(31),         /* GENERAL REGISTER 10.      @D1M*/ 15255600
*     3 SCFSI1GB FIXED(31),         /* GENERAL REGISTER 11.      @D1M*/ 15256000
*     3 SCFSI1GC FIXED(31),         /* GENERAL REGISTER 12.      @D1M*/ 15256400
*     3 SCFSI1GD FIXED(31),         /* GENERAL REGISTER 13.      @D1M*/ 15256800
*     3 SCFSI1GE FIXED(31),         /* GENERAL REGISTER 14.      @D1M*/ 15257200
*     3 SCFSI1GF FIXED(31),         /* GENERAL REGISTER 15.      @D1M*/ 15257600
*      /*   I/O FLIH ACCESS REGISTER SAVEAREA 1.  */                    15258000
*   2 SCFSIAR1 CHAR(64) BDY(WORD),  /* I/O FLIH ACCESS REGISTER         15258400
*                                        SAVEAREA 1.             @D1M*/ 15258800
*     3 SCFSI1A0 FIXED(32),         /* ACCESS REGISTER 0.        @D1M*/ 15259200
*     3 SCFSI1A1 FIXED(32),         /* ACCESS REGISTER 1.        @D1M*/ 15259600
*     3 SCFSI1A2 FIXED(32),         /* ACCESS REGISTER 2.        @D1M*/ 15260000
*     3 SCFSI1A3 FIXED(32),         /* ACCESS REGISTER 3.        @D1M*/ 15260400
*     3 SCFSI1A4 FIXED(32),         /* ACCESS REGISTER 4.        @D1M*/ 15260800
*     3 SCFSI1A5 FIXED(32),         /* ACCESS REGISTER 5.        @D1M*/ 15261200
*     3 SCFSI1A6 FIXED(32),         /* ACCESS REGISTER 6.        @D1M*/ 15261600
*     3 SCFSI1A7 FIXED(32),         /* ACCESS REGISTER 7.        @D1M*/ 15262000
*     3 SCFSI1A8 FIXED(32),         /* ACCESS REGISTER 8.        @D1M*/ 15262400
*     3 SCFSI1A9 FIXED(32),         /* ACCESS REGISTER 9.        @D1M*/ 15262800
*     3 SCFSI1AA FIXED(32),         /* ACCESS REGISTER 10.       @D1M*/ 15263200
*     3 SCFSI1AB FIXED(32),         /* ACCESS REGISTER 11.       @D1M*/ 15263600
*     3 SCFSI1AC FIXED(32),         /* ACCESS REGISTER 12.       @D1M*/ 15264000
*     3 SCFSI1AD FIXED(32),         /* ACCESS REGISTER 13.       @D1M*/ 15264400
*     3 SCFSI1AE FIXED(32),         /* ACCESS REGISTER 14.       @D1M*/ 15264800
*     3 SCFSI1AF FIXED(32),         /* ACCESS REGISTER 15.       @D1M*/ 15265200
*                                                                       15265600
*      /*  I/O FLIH CONTROL REGISTER SAVEAREA 1.  */                    15266800
*   2 SCFSICR1 CHAR(64) BDY(WORD),  /* I/0 FLIH CONTROL REGISTER        15267200
*                                        SAVEAREA 1.             @D1M*/ 15267600
*     3 SCFSI1C0 FIXED(32),         /* CONTROL REGISTER 0.       @D1M*/ 15268000
*     3 SCFSI1C1 FIXED(32),         /* CONTROL REGISTER 1.       @D1M*/ 15268400
*     3 SCFSI1C2 FIXED(32),         /* CONTROL REGISTER 2.       @D1M*/ 15268800
*     3 SCFSIXM1 CHAR(8) BDY(WORD), /* CROSS MEMORY CONTROL REGISTER    15269200
*                                      SAVEAREA.                 @D1M*/ 15269600
*       5 SCFSI1C3 FIXED(32),       /* CONTROL REGISTER 3        @D1M*/ 15270000
*         7 SCFSIO1K FIXED(16),     /* PROGRAM KEY MASK.         @D1M*/ 15270400
*         7 SCFSIO1S FIXED(16),     /* SASN.                     @D1M*/ 15270800
*       5 SCFSI1C4 FIXED(32),       /* CONTROL REGISTER 4        @D1M*/ 15271200
*         7 SCFSIO1A FIXED(16),     /* AX.                       @D1M*/ 15271600
*         7 SCFSIO1P FIXED(16),     /* PASN.                     @D1M*/ 15272000
*     3 SCFSI1C5 FIXED(32),         /* CONTROL REGISTER 5.       @D1M*/ 15272400
*     3 SCFSI1C6 FIXED(32),         /* CONTROL REGISTER 6.       @D1M*/ 15272800
*     3 SCFSI1C7 FIXED(32),         /* CONTROL REGISTER 7.       @D1M*/ 15273200
*     3 SCFSI1C8 CHAR(4) BDY(WORD), /* CONTROL REGISTER 8.       @D1M*/ 15273600
*       5 SCFSIEAX FIXED(16),       /* EAX VALUE.                @D1M*/ 15274000
*       5 *        FIXED(16),                                           15274400
*     3 SCFSI1C9 FIXED(32),         /* CONTROL REGISTER 9.       @D1M*/ 15274800
*     3 SCFSI1CA FIXED(32),         /* CONTROL REGISTER 10.      @D1M*/ 15275200
*     3 SCFSI1CB FIXED(32),         /* CONTROL REGISTER 11.      @D1M*/ 15275600
*     3 SCFSI1CC FIXED(32),         /* CONTROL REGISTER 12.      @D1M*/ 15276000
*     3 SCFSI1CD FIXED(32),         /* CONTROL REGISTER 13.      @D1M*/ 15276400
*     3 SCFSI1CE FIXED(32),         /* CONTROL REGISTER 14.      @D1M*/ 15276800
*     3 SCFSI1CF FIXED(32),         /* CONTROL REGISTER 15.      @D1M*/ 15277200
*   2 SCFSIOFL FIXED(8),            /* I/O FLIH FLAGS            @L1A*/ 15277500
*     3 SCFSIOSA BIT (1),           /* SUBSPACE ACTIVE AT TIME OF       15277800
*                                      INTERRUPT                 @L1A*/ 15278100
*     3 *        BIT (7),           /* RESERVED                  @L1A*/ 15278400
*   2 SCFSR0C5 FIXED(8),            /* RESERVED                  @L2C*/ 15279300
*   2 SCFSXNTC FIXED(15),           /* EXTERNAL FLIH INTERRUPT CODE     15280200
*                                      SAVE AREA.                @D1A*/ 15281700
*   2 SCFSXPS1 CHAR(8) BDY(DWORD),  /* EXTERNAL FLIH PSW SAVEAREA 1. */ 15283300
*      /* EXTERNAL FLIH GENERAL REGISTER SAVEAREA 1. */                 15316600
*   2 SCFSXGR1 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GENERAL REGISTER   15350000
*                                        SAVEAREA 1.                 */ 15400000
*     3 SCFSX1G0 FIXED(31),         /* GENERAL REGISTER 0            */ 15450000
*     3 SCFSX1G1 FIXED(31),         /* GENERAL REGISTER 1            */ 15500000
*     3 SCFSX1G2 FIXED(31),         /* GENERAL REGISTER 2            */ 15550000
*     3 SCFSX1G3 FIXED(31),         /* GENERAL REGISTER 3            */ 15600000
*     3 SCFSX1G4 FIXED(31),         /* GENERAL REGISTER 4            */ 15650000
*     3 SCFSX1G5 FIXED(31),         /* GENERAL REGISTER 5            */ 15700000
*     3 SCFSX1G6 FIXED(31),         /* GENERAL REGISTER 6            */ 15750000
*     3 SCFSX1G7 FIXED(31),         /* GENERAL REGISTER 7            */ 15800000
*     3 SCFSX1G8 FIXED(31),         /* GENERAL REGISTER 8            */ 15850000
*     3 SCFSX1G9 FIXED(31),         /* GENERAL REGISTER 9            */ 15900000
*     3 SCFSX1GA FIXED(31),         /* GENERAL REGISTER 10           */ 15950000
*     3 SCFSX1GB FIXED(31),         /* GENERAL REGISTER 11           */ 16000000
*     3 SCFSX1GC FIXED(31),         /* GENERAL REGISTER 12           */ 16050000
*     3 SCFSX1GD FIXED(31),         /* GENERAL REGISTER 13           */ 16100000
*     3 SCFSX1GE FIXED(31),         /* GENERAL REGISTER 14           */ 16150000
*     3 SCFSX1GF FIXED(31),         /* GENERAL REGISTER 15           */ 16200000
*      /* EXTERNAL FLIH ACCESS REGISTER SAVEAREA 1. */                  16250000
*   2 SCFSXAR1 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH ACCESS REGISTER    17050000
*                                        SAVEAREA 1.                 */ 17100000
*     3 SCFSX1A0 FIXED(32),         /* ACCESS REGISTER 0             */ 17150000
*     3 SCFSX1A1 FIXED(32),         /* ACCESS REGISTER 1             */ 17200000
*     3 SCFSX1A2 FIXED(32),         /* ACCESS REGISTER 2             */ 17250000
*     3 SCFSX1A3 FIXED(32),         /* ACCESS REGISTER 3             */ 17300000
*     3 SCFSX1A4 FIXED(32),         /* ACCESS REGISTER 4             */ 17350000
*     3 SCFSX1A5 FIXED(32),         /* ACCESS REGISTER 5             */ 17400000
*     3 SCFSX1A6 FIXED(32),         /* ACCESS REGISTER 6             */ 17450000
*     3 SCFSX1A7 FIXED(32),         /* ACCESS REGISTER 7             */ 17500000
*     3 SCFSX1A8 FIXED(32),         /* ACCESS REGISTER 8             */ 17550000
*     3 SCFSX1A9 FIXED(32),         /* ACCESS REGISTER 9             */ 17600000
*     3 SCFSX1AA FIXED(32),         /* ACCESS REGISTER 10            */ 17650000
*     3 SCFSX1AB FIXED(32),         /* ACCESS REGISTER 11            */ 17700000
*     3 SCFSX1AC FIXED(32),         /* ACCESS REGISTER 12            */ 17750000
*     3 SCFSX1AD FIXED(32),         /* ACCESS REGISTER 13            */ 17800000
*     3 SCFSX1AE FIXED(32),         /* ACCESS REGISTER 14            */ 17850000
*     3 SCFSX1AF FIXED(32),         /* ACCESS REGISTER 15            */ 17900000
*                                                                       17950000
*   2 SCFSR150 FIXED(31) BDY(DWORD),/* RESERVED - XMEM REGS MUST BE ON  18000000
*                                      ON DWORD BDY.             @P2A*/ 18050000
*      /*  EXTERNAL FLIH CONTROL REGISTER SAVEAREA 1.  */               18100000
*   2 SCFSXCR1 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH CONTROL REGISTER   18150000
*                                        SAVEAREA 1.                 */ 18775000
*     3 SCFSX1C0 FIXED(32),         /* CONTROL REGISTER 0            */ 18800000
*     3 SCFSX1C1 FIXED(32),         /* CONTROL REGISTER 1            */ 18850000
*     3 SCFSX1C2 FIXED(32),         /* CONTROL REGISTER 2            */ 18900000
*     3 SCFSXXM1 CHAR(8) BDY(WORD), /* CROSS MEMORY CONTROL REGISTER    18950000
*                                      SAVEAREA 1.                   */ 19000000
*       5 SCFSX1C3 FIXED(32),       /* CONTROL REGISTER 3            */ 19050000
*         7 SCFSX1PK FIXED(16),     /* PROGRAM KEY MASK.             */ 19100000
*         7 SCFSX1SS FIXED(16),     /* SASN.                         */ 19150000
*       5 SCFSX1C4 FIXED(32),       /* CONTROL REGISTER 4            */ 19200000
*         7 SCFSX1AX FIXED(16),     /* AX.                           */ 19250000
*         7 SCFSX1PS FIXED(16),     /* PASN.                         */ 19300000
*     3 SCFSX1C5 FIXED(32),         /* CONTROL REGISTER 5            */ 19550000
*     3 SCFSX1C6 FIXED(32),         /* CONTROL REGISTER 6            */ 19600000
*     3 SCFSX1C7 FIXED(32),         /* CONTROL REGISTER 7            */ 19650000
*     3 SCFSX1C8 CHAR(4) BDY(WORD), /* CONTROL REGISTER 8            */ 19700000
*       5 SCFS1EAX FIXED(16),       /* EAX VALUE.                    */ 19950000
*       5 *        FIXED(16),                                           20000000
*     3 SCFSX1C9 FIXED(32),         /* CONTROL REGISTER 9            */ 20050000
*     3 SCFSX1CA FIXED(32),         /* CONTROL REGISTER 10           */ 20100000
*     3 SCFSX1CB FIXED(32),         /* CONTROL REGISTER 11           */ 20150000
*     3 SCFSX1CC FIXED(32),         /* CONTROL REGISTER 12           */ 20200000
*     3 SCFSX1CD FIXED(32),         /* CONTROL REGISTER 13           */ 20250000
*     3 SCFSX1CE FIXED(32),         /* CONTROL REGISTER 14           */ 20300000
*     3 SCFSX1CF FIXED(32),         /* CONTROL REGISTER 15           */ 20350000
*                                                                       20400000
*   2 SCFSR194 FIXED(31),           /* RESERVED.                 @P2A*/ 20425000
*   2 SCFSXPS2 CHAR(8) BDY(DWORD),  /* EXTERNAL FLIH PSW SAVEAREA 2. */ 20450000
*      /*  EXTERNAL FLIH GENERAL REGISTER SAVEAREA 2  */                20500000
*   2 SCFSXGR2 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GENERAL REGISTER   20800000
*                                        SAVEAREA 2.                 */ 20850000
*     3 SCFSX2G0 FIXED(31),         /* GENERAL REGISTER 0            */ 20900000
*     3 SCFSX2G1 FIXED(31),         /* GENERAL REGISTER 1            */ 20950000
*     3 SCFSX2G2 FIXED(31),         /* GENERAL REGISTER 2            */ 21000000
*     3 SCFSX2G3 FIXED(31),         /* GENERAL REGISTER 3            */ 21050000
*     3 SCFSX2G4 FIXED(31),         /* GENERAL REGISTER 4            */ 21100000
*     3 SCFSX2G5 FIXED(31),         /* GENERAL REGISTER 5            */ 21150000
*     3 SCFSX2G6 FIXED(31),         /* GENERAL REGISTER 6            */ 21200000
*     3 SCFSX2G7 FIXED(31),         /* GENERAL REGISTER 7            */ 21250000
*     3 SCFSX2G8 FIXED(31),         /* GENERAL REGISTER 8            */ 21300000
*     3 SCFSX2G9 FIXED(31),         /* GENERAL REGISTER 9            */ 21350000
*     3 SCFSX2GA FIXED(31),         /* GENERAL REGISTER 10           */ 21400000
*     3 SCFSX2GB FIXED(31),         /* GENERAL REGISTER 11           */ 21450000
*     3 SCFSX2GC FIXED(31),         /* GENERAL REGISTER 12           */ 21500000
*     3 SCFSX2GD FIXED(31),         /* GENERAL REGISTER 13           */ 21550000
*     3 SCFSX2GE FIXED(31),         /* GENERAL REGISTER 14           */ 21600000
*     3 SCFSX2GF FIXED(31),         /* GENERAL REGISTER 15           */ 21650000
*      /*  EXTERNAL FLIH ACCESS REGISTER SAVEAREA 2  */                 21700000
*   2 SCFSXAR2 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH ACCESS REGISTER    22500000
*                                        SAVEAREA 2.                 */ 22550000
*     3 SCFSX2A0 FIXED(32),         /* ACCESS REGISTER 0             */ 22600000
*     3 SCFSX2A1 FIXED(32),         /* ACCESS REGISTER 1             */ 22650000
*     3 SCFSX2A2 FIXED(32),         /* ACCESS REGISTER 2             */ 22700000
*     3 SCFSX2A3 FIXED(32),         /* ACCESS REGISTER 3             */ 22750000
*     3 SCFSX2A4 FIXED(32),         /* ACCESS REGISTER 4             */ 22800000
*     3 SCFSX2A5 FIXED(32),         /* ACCESS REGISTER 5             */ 22850000
*     3 SCFSX2A6 FIXED(32),         /* ACCESS REGISTER 6             */ 22900000
*     3 SCFSX2A7 FIXED(32),         /* ACCESS REGISTER 7             */ 22950000
*     3 SCFSX2A8 FIXED(32),         /* ACCESS REGISTER 8             */ 23000000
*     3 SCFSX2A9 FIXED(32),         /* ACCESS REGISTER 9             */ 23050000
*     3 SCFSX2AA FIXED(32),         /* ACCESS REGISTER 10            */ 23100000
*     3 SCFSX2AB FIXED(32),         /* ACCESS REGISTER 11            */ 23150000
*     3 SCFSX2AC FIXED(32),         /* ACCESS REGISTER 12            */ 23200000
*     3 SCFSX2AD FIXED(32),         /* ACCESS REGISTER 13            */ 23250000
*     3 SCFSX2AE FIXED(32),         /* ACCESS REGISTER 14            */ 23300000
*     3 SCFSX2AF FIXED(32),         /* ACCESS REGISTER 15            */ 23350000
*                                                                       23400000
*   2 SCFSR220 FIXED(31) BDY(DWORD),/* RESERVED - XMEM REGS MUST BE     23450000
*                                      ON DWORD BDY.             @D1C*/ 23500000
*      /*  EXTERNAL FLIH CONTROL REGISTER SAVEAREA 2  */                23550000
*   2 SCFSXCR2 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH CONTROL REGISTER   23600000
*                                        SAVEAREA 2.                 */ 24250000
*     3 SCFSX2C0 FIXED(32),         /* CONTROL REGISTER 0            */ 24300000
*     3 SCFSX2C1 FIXED(32),         /* CONTROL REGISTER 1            */ 24350000
*     3 SCFSX2C2 FIXED(32),         /* CONTROL REGISTER 2            */ 24400000
*     3 SCFSXXM2 CHAR(8) BDY(WORD), /* CROSS MEMORY CONTROL REGISTER    24450000
*                                      SAVEAREA 2.                   */ 24483300
*       5 SCFSX2C3 FIXED(32),       /* CONTROL REGISTER 3            */ 24550000
*         7 SCFSX2PK FIXED(16),     /* PROGRAM KEY MASK.             */ 24600000
*         7 SCFSX2SS FIXED(16),     /* SASN.                         */ 24650000
*       5 SCFSX2C4 FIXED(32),       /* CONTROL REGISTER 4            */ 24700000
*         7 SCFSX2AX FIXED(16),     /* AX.                           */ 24750000
*         7 SCFSX2PS FIXED(16),     /* PASN.                         */ 24800000
*     3 SCFSX2C5 FIXED(32),         /* CONTROL REGISTER 5            */ 25000000
*     3 SCFSX2C6 FIXED(32),         /* CONTROL REGISTER 6            */ 25050000
*     3 SCFSX2C7 FIXED(32),         /* CONTROL REGISTER 7            */ 25100000
*     3 SCFSX2C8 CHAR(4) BDY(WORD), /* CONTROL REGISTER 8            */ 25150000
*       5 SCFS2EAX FIXED(16),       /* EAX VALUE.                    */ 25400000
*       5 *        FIXED(16),                                           25450000
*     3 SCFSX2C9 FIXED(32),         /* CONTROL REGISTER 9            */ 25500000
*     3 SCFSX2CA FIXED(32),         /* CONTROL REGISTER 10           */ 25550000
*     3 SCFSX2CB FIXED(32),         /* CONTROL REGISTER 11           */ 25600000
*     3 SCFSX2CC FIXED(32),         /* CONTROL REGISTER 12           */ 25650000
*     3 SCFSX2CD FIXED(32),         /* CONTROL REGISTER 13           */ 25700000
*     3 SCFSX2CE FIXED(32),         /* CONTROL REGISTER 14           */ 25750000
*     3 SCFSX2CF FIXED(32),         /* CONTROL REGISTER 15           */ 25800000
*                                                                       26250000
*   2 SCFSR264 FIXED(31),           /* RESERVED.                 @D1C*/ 26262400
*   2 SCFSXPS3 CHAR(8) BDY(DWORD),  /* EXTERNAL FLIH PSW SAVEAREA 3. */ 26274900
*      /*  EXTERNAL FLIH GENERAL REGISTER SAVEAREA 3  */                26283200
*   2 SCFSXGR3 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GENERAL REGISTER   26300000
*                                        SAVEAREA 3.                 */ 26350000
*     3 SCFSX3G0 FIXED(31),         /* GENERAL REGISTER 0            */ 26400000
*     3 SCFSX3G1 FIXED(31),         /* GENERAL REGISTER 1            */ 26450000
*     3 SCFSX3G2 FIXED(31),         /* GENERAL REGISTER 2            */ 26500000
*     3 SCFSX3G3 FIXED(31),         /* GENERAL REGISTER 3            */ 26550000
*     3 SCFSX3G4 FIXED(31),         /* GENERAL REGISTER 4            */ 26600000
*     3 SCFSX3G5 FIXED(31),         /* GENERAL REGISTER 5            */ 26650000
*     3 SCFSX3G6 FIXED(31),         /* GENERAL REGISTER 6            */ 26700000
*     3 SCFSX3G7 FIXED(31),         /* GENERAL REGISTER 7            */ 26750000
*     3 SCFSX3G8 FIXED(31),         /* GENERAL REGISTER 8            */ 26800000
*     3 SCFSX3G9 FIXED(31),         /* GENERAL REGISTER 9            */ 26850000
*     3 SCFSX3GA FIXED(31),         /* GENERAL REGISTER 10           */ 26900000
*     3 SCFSX3GB FIXED(31),         /* GENERAL REGISTER 11           */ 26950000
*     3 SCFSX3GC FIXED(31),         /* GENERAL REGISTER 12           */ 27000000
*     3 SCFSX3GD FIXED(31),         /* GENERAL REGISTER 13           */ 27050000
*     3 SCFSX3GE FIXED(31),         /* GENERAL REGISTER 14           */ 27100000
*     3 SCFSX3GF FIXED(31),         /* GENERAL REGISTER 15           */ 27150000
*      /*  EXTERNAL FLIH ACCESS REGISTER SAVEAREA 3  */                 27200000
*   2 SCFSXAR3 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH ACCESS REGISTER    28000000
*                                        SAVEAREA 3.                 */ 28050000
*     3 SCFSX3A0 FIXED(32),         /* ACCESS REGISTER 0             */ 28100000
*     3 SCFSX3A1 FIXED(32),         /* ACCESS REGISTER 1             */ 28150000
*     3 SCFSX3A2 FIXED(32),         /* ACCESS REGISTER 2             */ 28200000
*     3 SCFSX3A3 FIXED(32),         /* ACCESS REGISTER 3             */ 28250000
*     3 SCFSX3A4 FIXED(32),         /* ACCESS REGISTER 4             */ 28300000
*     3 SCFSX3A5 FIXED(32),         /* ACCESS REGISTER 5             */ 28350000
*     3 SCFSX3A6 FIXED(32),         /* ACCESS REGISTER 6             */ 28400000
*     3 SCFSX3A7 FIXED(32),         /* ACCESS REGISTER 7             */ 28450000
*     3 SCFSX3A8 FIXED(32),         /* ACCESS REGISTER 8             */ 28500000
*     3 SCFSX3A9 FIXED(32),         /* ACCESS REGISTER 9             */ 28550000
*     3 SCFSX3AA FIXED(32),         /* ACCESS REGISTER 10            */ 28600000
*     3 SCFSX3AB FIXED(32),         /* ACCESS REGISTER 11            */ 28650000
*     3 SCFSX3AC FIXED(32),         /* ACCESS REGISTER 12            */ 28700000
*     3 SCFSX3AD FIXED(32),         /* ACCESS REGISTER 13            */ 28750000
*     3 SCFSX3AE FIXED(32),         /* ACCESS REGISTER 14            */ 28800000
*     3 SCFSX3AF FIXED(32),         /* ACCESS REGISTER 15            */ 28850000
*                                                                       28862500
*   2 SCFSR2F0 FIXED(31) BDY(DWORD),/* RESERVED - XMEM REGS MUST BE ON  28875000
*                                      DWORD BDY.                @D1C*/ 28887500
*      /*  EXTERNAL FLIH CONTROL REGISTER SAVEAREA 3.  */               28900000
*   2 SCFSXCR3 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH CONTROL REGISTER   29700000
*                                        SAVEAREA 3.                 */ 29750000
*     3 SCFSX3C0 FIXED(32),         /* CONTROL REGISTER 0            */ 29800000
*     3 SCFSX3C1 FIXED(32),         /* CONTROL REGISTER 1            */ 29850000
*     3 SCFSX3C2 FIXED(32),         /* CONTROL REGISTER 2            */ 29900000
*     3 SCFSXXM3 CHAR(8) BDY(WORD), /* CROSS MEMORY CONTROL REGISTER    29950000
*                                      SAVEAREA 3.                   */ 30000000
*       5 SCFSX3C3 FIXED(32),       /* CONTROL REGISTER 3            */ 30050000
*         7 SCFSX3PK FIXED(16),     /* PROGRAM KEY MASK.             */ 30100000
*         7 SCFSX3SS FIXED(16),     /* SASN.                         */ 30150000
*       5 SCFSX3C4 FIXED(32),       /* CONTROL REGISTER 4            */ 30200000
*         7 SCFSX3AX FIXED(16),     /* AX.                           */ 30250000
*         7 SCFSX3PS FIXED(16),     /* PASN.                         */ 30300000
*     3 SCFSX3C5 FIXED(32),         /* CONTROL REGISTER 5            */ 30500000
*     3 SCFSX3C6 FIXED(32),         /* CONTROL REGISTER 6            */ 30550000
*     3 SCFSX3C7 FIXED(32),         /* CONTROL REGISTER 7            */ 30600000
*     3 SCFSX3C8 CHAR(4) BDY(WORD), /* CONTROL REGISTER 8            */ 30650000
*       5 SCFS3EAX FIXED(16),       /* EAX VALUE.                    */ 30900000
*       5 *        FIXED(16),                                           30950000
*     3 SCFSX3C9 FIXED(32),         /* CONTROL REGISTER 9            */ 31000000
*     3 SCFSX3CA FIXED(32),         /* CONTROL REGISTER 10           */ 31050000
*     3 SCFSX3CB FIXED(32),         /* CONTROL REGISTER 11           */ 31100000
*     3 SCFSX3CC FIXED(32),         /* CONTROL REGISTER 12           */ 31150000
*     3 SCFSX3CD FIXED(32),         /* CONTROL REGISTER 13           */ 31200000
*     3 SCFSX3CE FIXED(32),         /* CONTROL REGISTER 14           */ 31250000
*     3 SCFSX3CF FIXED(32),         /* CONTROL REGISTER 15           */ 31300000
*                                                                       31312500
*   2 SCFSR334 FIXED(31),           /* RESERVED.                 @D1C*/ 31362500
*   2 SCFSI641 CHAR(64) BDY(WORD),  /* I/O FLIH GPR BITS 0-31           31412500
*                                        SAVEAREA 1.             @L4A*/ 31462500
*   2 SCFSX641 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GPR BITS 0-31      31512500
*                                        SAVEAREA 1.             @L4A*/ 31562500
*   2 SCFSXCRG1 CHAR(128) BDY(DWORD), /* EXTERNAL FLIH ESAME CRS        31612500
*                                        SAVEAREA 1.             @L4A*/ 31662500
*   2 SCFSX642 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GPR BITS 0-31      31712500
*                                        SAVEAREA 2.             @L4A*/ 31762500
*   2 SCFSX643 CHAR(64) BDY(WORD),  /* EXTERNAL FLIH GPR BITS 0-31      31812500
*                                        SAVEAREA 3.             @L4A*/ 31862500
*   2 SCFSEND CHAR(0) BDY(DWORD);   /* END OF SCFS.                  */ 34700000
*     @LISTPOP;                                                         34750000
