*         %GOTO PLSSPTR1;          /*                                   00050000
         MACRO                                                          00100000
&SPTRNME IHASPTRC &LIST=NO                                              00150000
**/                                                                     00200000
*%PLSSPTR1:;                                                            00250000
*/* START OF SPECIFICATIONS ******************************************/ 00275000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00300000
*/*01* PROPRIETARY STATEMENT =                                   @P2C*/ 00325000
*/*                                                                  */ 00350000
*/*      5647-A01                                                    */ 00400000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00887500
*/*      (C)COPYRIGHT IBM CORP 1988, 1998                            */ 00925000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00962500
*/*                                                                  */ 01000000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 01016600
*/*                                                                  */ 01033200
*/*01* STATUS = HBB6605                                          @P2C*/ 01066600
*/*                                                                  */ 01100000
*/*01* DESCRIPTIVE NAME:                                             */ 01125000
*/*     Supervisor Control Services System Trace Entry Templates     */ 01150000
*/*                                                                  */ 01162500
*/*02*  ACRONYM:  SPTRC                                              */ 01175000
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 01200000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01225000
*/*01* MACRO-NAME:  IHASPTRC                                         */ 01250000
*/*                                                                  */ 01350000
*/*01* DSECT NAME:                                                   */ 01360000
*/*     SPETCL1                                                      */ 01370000
*/*     SPETCL2                                                      */ 01380000
*/*     SPESC2                                                       */ 01390000
*/*     SPESC4                                                       */ 01400000
*/*     SPESCA                                                       */ 01410000
*/*     SPDSGNL                                                      */ 01420000
*/*     SPDISGNL                                                     */ 01430000
*/*     SPRPSGNL                                                     */ 01440000
*/*     SPSCHF                                                       */ 01445000
*/*     SPPRT                                                        */ 01447500
*/*                                                                  */ 01450000
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 01500000
*/*                                                                  */ 01700000
*/*01* EYE-CATCHER:  None                                            */ 01713100
*/*                                                                  */ 01726200
*/*01* STORAGE ATTRIBUTES:                                           */ 01739300
*/*02*  SUBPOOL:  239                                                */ 01752400
*/*02*  KEY:  0                                                      */ 01765500
*/*02*  RESIDENCY:  Above 16 megabytes in virtual storage            */ 01778600
*/*02*  ALLOCATION-METHOD: GETMAIN                                   */ 01791700
*/*02*  FREQUENCY:  One per processor                                */ 01804800
*/*                                                                  */ 01817900
*/*01* SIZE:  20 BYTES PER TEMPLATE                                  */ 01831000
*/*                                                                  */ 01844100
*/*01* CREATED BY:                                                   */ 01857200
*/*     IEAVERI                                                      */ 01870300
*/*     IEAVESC0                                                     */ 01883400
*/*     IEAVETCL                                                     */ 01896500
*/*     IEAVSCHA                                                     */ 01903000
*/*     IEAVSCHD                                                     */ 01906300
*/*     IEAVSRBP                                                     */ 01909600
*/*     IEAVSRBR                                                     */ 01922700
*/*     IEAVSRBS                                                     */ 01935800
*/*     IEAVSCHF                                                     */ 01942900
*/*     IEAVEGAR                                                     */ 01945200
*/*     IEAVEGUR                                                     */ 01947500
*/*                                                                  */ 01950000
*/*01* POINTED TO BY:                                                */ 02000000
*/*     WSACSTPL field of the CPU-related WSAVT                      */ 02025000
*/*                                                                  */ 02050000
*/*01* SERIALIZATION:                                                */ 02083300
*/*     Disablement serializes system trace parameter list.          */ 02116600
*/*                                                                  */ 02150000
*/*01* FUNCTION:                                                     */ 02175000
*/*02*  Provides a template for building and documenting Supervisor  */ 02200000
*/*     Control services System Trace Table entries.                 */ 02225000
*/*                                                                  */ 02250000
*/*02*  Note: This mapping macro contains multiple mappings of the   */ 02255200
*/*     supervisor control system trace data.  The first word in     */ 02260400
*/*     each entry appears under the heading 'Address-' in the       */ 02265600
*/*     formatted trace tables.  The remaining words appear under:   */ 02270800
*/*        Unique-1, Unique-2, Unique-3, and Unique-4.               */ 02276000
*/*                                                                  */ 02281200
*/*01* METHOD OF ACCESS:                                             */ 02286400
*/*02*  ASM:                                                         */ 02291600
*/*      DSECT is always produced.                                   */ 02296800
*/*      USING on appropriate DSECT specifying WSACSTPL as base      */ 02302000
*/*      register required for correct addressability.               */ 02307200
*/*      Specify LIST=YES on Macro call for listing.                 */ 02312400
*/*02*  PL/AS:                                                       */ 02317600
*/*      Each level-1 declared structure is based upon WSACSTPL.     */ 02322800
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 02328000
*/*                                                                  */ 02333200
*/*01* DEPENDENCIES:                                                 */ 02338400
*/*      None.                                                       */ 02343600
*/*                                                                  */ 02350000
*/*01* DELETED-BY:                                                   */ 02400000
*/*                                                                  */ 02450000
*/*          NEVER DELETED                                           */ 02500000
*/*                                                                  */ 02550000
*/*01* DISTRIBUTION LIBRARY:  APVTMACS                               */ 02600000
*/*                                                                  */ 03300000
*/*01* NOTES =                                                       */ 03308300
*/*            1) THIS MAPPING MACRO CONTAINS MULTIPLE MAPPING       */ 03316600
*/*               OF THE SUPERVISOR CONTROL SYSTEM TRACE PARAMETER   */ 03324900
*/*               LIST.                                              */ 03333200
*/*                                                                  */ 03341500
*/*01* CHANGE ACTIVITY:                                              */ 03353200
*/*  $L2=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 03364900
*/*                                                                  */ 03376600
*/* END OF SPECIFICATIONS ********************************************/ 03388300
*%GOTO PLSSPTR2;          /*                                            03400000
.*                                                                      03450000
.*********************************************************************  03500000
.*   CHANGE ACTIVITY =                                                  03550000
.*                                                                      03600000
.*  $L0=AROCO     HBB3310  851101  PD161M:  SERVICEABILITY              03631200
.*  $L1=LOCKR     HBB4410  870316  PD16Q4:  SUPPORT FOR NEW SCHEDULE    03662500
.*                                          ENTRY POINTS                03675000
.*  $D1=DCR0075   HBB4410  880715  PD16AG:  SRB Suspend/Resume          03687500
.*  $01=OY27050   JBB3313  890403  PD16Q4:  SUPPORT FOR NEW SCHEDULE    03691600
.*                                          ENTRY POINTS                03695700
.*  $P1=PH31564   HBB4420  901126  PD16ES:  ADD IEAVSCHA TO SPESC2      03697100
.*                                          TEMPLATE                    03698500
.*  $L2=PR313     JBB3313  891128  PD16EI:  SHOWHDR format complete     03699000
.*  $L3=PR430     HBB4430  920429  PD16Q4:  Correct violations in text  03699500
.*  $D2=DIG0033   HBB5510  930115  PD16EJ:  Update users of suspend/    03699600
.*                                          resume data areas.          03699700
.*                                          (comment change only)       03699800
.*  $L4=SUBSP     HBB5510  930520  PD16IW:  Schedule w/addr front-end   03712300
.*                                          SPSCHF                      03724800
.*  $L5=PR510     HBB5510  930614  PD16ST:  SHOWHDR update              03731000
.*  $P2=PN70150   HBB5520  940210  PD162M:  SHOWHDR update              03734100
.*  $P3=PUX0217   HBB6605  970809  PD00H6:  IEAVSCHD tracing            03735100
.*  $L6=PAUSE     HBB6608  980925  B7HGH5:  Pause/Release               03736100
.*  $P4=PWK0558   HBB6608  981215  B7HGH5:  Add Release DU address      03736700
.*  $P5=PWK0651   HBB6608  990115  B7HGH5:  Add Release ASCB address    03737000
.*                                                                      03737300
.*********************************************************************  03750000
         PUSH  PRINT                                                    03800000
         AIF   ('&LIST' EQ 'YES').SPTRLST                               03850000
         PRINT OFF                                                      03900000
.SPTRLST ANOP                                                           03950000
         SPACE 3                                                        04000000
SPETCL1  DSECT                     IEAVSPN1 ENTRY POINT OF IEAVETCL     04050000
*                                  SYSTEM TRACE ENTRY TEMPLATE          04100000
*                                  (SRVID=X010E)                        04150000
SPET1RET DS    A                   CALLERS RETURN ADDRESS               04200000
SPET1TAA DS    A                   TARGET ADDRESS SPACE ASCB ADDRESS    04250000
SPET1TAR DS    A                   ADDRESS OF TCB TO BE SUSPENDED       04300000
SPET1RAR DS    A                   ADDRESS OF RB TO BE SUSPENDED        04350000
SPET1FLG DS    XL1                 IEAVETCL OPTION FLAG BYTE            04400000
SPET1FRB EQU   X'04'               RB OPERAND INDICATION FLAG           04450000
*                                  (1-RB=PREVIOUS AND 0-RB=CURRENT)     04500000
SPET1RSV DS    XL3                 RESERVED                             04550000
SPETCL1E DS    0F                  END OF IEAVETCL SYSTEM TRACE         04600000
*                                  ENTRY TEMPLATE                       04650000
         SPACE 3                                                        04675000
SPETCL2  DSECT                     IEAVRSH1, IEAVRSS1, IEAVRSU1,        04700000
*                                  IEAVRSC1, IEAVRSA1, IEAVRSRB,        04750000
*                                  AND IEAVRSMS ENTRY POINTS OF         04800000
*                                  IEAVETCL SYSTEM TRACE ENTRY TEMPLATE 04850000
*                                  (SRVID=X010F)                        04900000
SPET2RET DS    A                   CALLERS RETURN ADDRESS OR            04920000
*                                  0 WHICH INDICATES THE                04940000
*                                  RETURN=N OPTION WAS SPECIFIED ON     04960000
*                                  THE RESUME MACRO                     04980000
SPET2TAA DS    A                   TARGET ADDRESS SPACE ASCB ADDRESS    05000000
SPET2TAR DS    A                   ADDRESS OF TCB TO BE RESUMED         05050000
SPET2FMD EQU   X'80'               MODE OPERAND INDICATION FLAG         05200000
*                                  (1-MODE=COND AND 0-MODE=UNCOND)      05250000
SPET2RAR DS    A                   ADDRESS OF RB TO BE RESUMED          05300000
SPET2FRS EQU   X'80'               RSM RESET REQUEST INDICATION         05350000
*                                  (1-RSM RESET REQUESTED AND           05450000
*                                  0-RSM RESET NOT REQUESTED)           05500000
SPET2FLG DS    XL1                 IEAVETCL OPTION FLAG BYTE            05512500
SPET2FAS EQU   X'80'               ASYNC OPERAND INDICATION FLAG        05525000
*                                  (1-ASYNC=YES AND 0-ASYNC=NO)         05537500
SPET2RSV DS    XL3                 RESERVED                             05550000
SPETCL2E DS    0F                  END OF IEAVETCL SYSTEM TRACE         05600000
*                                  ENTRY TEMPLATE                       05650000
         SPACE 3                                                        05675000
SPESC2   DSECT                     IEAVESC2 AND IEAVESC8 ENTRY POINTS   05700000
*                                  OF IEAVESC0, AND IEAVSCHA,           05725000
*                                  and IEAVSCHD                         05750000
*                                  SYSTEM TRACE ENTRY TEMPLATE          05775000
*                                  (SRVID=X0110, X0112, X011B, X011D).  05812500
SPES2RET DS    A                   CALLERS RETURN ADDRESS               05850000
SPES2SRB DS    A                   ADDRESS OF SRB TO BE SCHEDULED       05900000
SPES2TAA DS    A                   TARGET ADDRESS SPACE ASCB ADDRESS    05950000
SPES2EPA DS    A                   ENTRY POINT ADDRESS OF ROUTINE TO    06000000
*                                  EXECUTE IN THE TARGET ADDRESS SPACE  06050000
SPES2PK  DS    XL1                 PROTECT KEY INDICATOR                06100000
SPES2FL1 DS   0XL1                 IEAMSCHD FLAGS1                 @P3A 06125000
SPES2OPF DS    XL1                 SRB OPTION FLAGS (SEE SRBFLGS)       06150000
SPES2FL2 DS   0XL1                 IEAMSCHD FLAGS2                 @P3A 06175000
SPES2TPF DS    XL1                 SRB TYPE FLAGS (SEE SRBFLGS1)        06200000
SPES2FL3 DS   0XL1                 IEAMSCHD FLAGS3                 @P3A 06225000
SPES2HLH DS    XL1                 SUSPEND LOCKS HELD AT SRB SUSPENSION 06250000
*                                  INDICATOR                            06300000
SPESC2E  DS    0F                  END OF IEAVESC0, IEAVSCHA SYSTEM     06350000
*                                  TRACE ENTRY TEMPLATE                 06400000
         SPACE 3                                                        06425000
SPESC4   DSECT                     IEAVESC4 ENTRY POINT OF IEAVESC0     06450000
*                                  SYSTEM TRACE ENTRY TEMPLATE          06500000
*                                  (SRVID=X0111)                        06550000
SPES4RET DS    A                   IEAVESC4 CALLERS RETURN ADDRESS      06600000
SPES4RSV DS    XL16                RESERVED                             06650000
SPESC4E  DS    0F                  END OF IEAVESC4 SYSTEM TRACE         06700000
*                                  ENTRY TEMPLATE                       06750000
         SPACE 3                                                        06775000
SPESCA   DSECT                     IEAVESCA AND IEAVESCC ENTRY     @L1A 06776700
*                                  POINTS OF IEAVESC0 SYSTEM TRACE      06778400
*                                  ENTRY TEMPLATE                       06780100
*                                  (SRVID=X0116 AND X0117)              06781800
SPESARET DS    A                   CALLERS RETURN ADDRESS          @L1A 06783500
SPESASRB DS    A                   ADDRESS OF SRB TO BE SCHEDULED  @L1A 06785200
SPESATAA DS    A                   TARGET ADDRESS SPACE ASCB       @L1A 06786900
*                                  ADDRESS                              06788600
SPESASTK DS    XL8                 STOKEN REPRESENTING THE TARGET  @L1A 06790300
*                                  ADDRESS SPACE.                       06792000
SPESCAE  DS    0F                  END OF IEAVESC0 SYSTEM TRACE    @L1A 06793700
*                                  ENTRY TEMPLATE                       06795400
         SPACE 3                                                        06797100
SPDSGNL  DSECT                     DSGNL SYSTEM TRACE ENTRY TEMPLATE    06800000
*                                  (SRVID=X0113)                        06850000
SPDSGRET DS    A                   DSGNL CALLERS RETURN ADDRESS         06900000
SPDSGPCR DS    H                   PHYSICAL CPU ID OF PROCESSOR         06950000
*                                  REQUESTING THE DSGNL                 07000000
SPDSGPCT DS    H                   PHYSICAL CPU ID OF PROCESSOR THAT    07050000
*                                  IS THE TARGET OF THE DSGNL           07100000
SPDSGST  DS    F                   STATUS REGISTER CONTENTS (IF         07150000
*                                  SPDSGRC=8) OR ZERO                   07200000
SPDSGSOC DS    XL1                 SIGP ORDER CODE                      07250000
SPDSGRC  DS    XL1                 IEAVESGP RETURN CODE                 07300000
SPDSGRSV DS    XL6                 RESERVED                             07350000
SPDSGNLE DS    0F                  END OF DSGNL SYSTEM TRACE ENTRY      07400000
*                                  TEMPLATE                             07450000
         SPACE 3                                                        07475000
SPRISGNL DSECT                     RISGNL SYSTEM TRACE ENTRY TEMPLATE   07500000
*                                  (SRVID=X0114)                        07550000
SPRISRET DS    A                   RISGNL CALLERS RETURN ADDRESS        07600000
SPRISPCR DS    H                   PHYSICAL CPU ID OF PROCESSOR         07650000
*                                  REQUESTING THE RISGNL                07700000
SPRISPCT DS    H                   PHYSICAL CPU ID OF PROCESSOR THAT    07750000
*                                  IS THE TARGET OF THE DSGNL           07800000
SPRISSOC DS    XL1                 SIGP ORDER CODE                      07850000
SPRISRC  DS    XL1                 IEAVESGP RETURN CODE                 07900000
SPRISRSV DS    XL10                RESERVED                             07950000
SPRISGLE DS    0F                  END OF RISGNL SYSTEM TRACE ENTRY     08000000
*                                  TEMPLATE                             08050000
         SPACE 3                                                        08075000
SPRPSGNL DSECT                     RPSGNL SYSTEM TRACE ENTRY TEMPLATE   08100000
*                                  (SRVID=X0115)                        08150000
SPRPSRET DS    A                   RPSGNL CALLERS RETURN ADDRESS        08200000
SPRPSPCR DS    H                   PHYSICAL CPU ID OF PROCESSOR         08250000
*                                  REQUESTING THE RISGNL                08300000
SPRPSPCT DS    H                   PHYSICAL CPU ID OF PROCESSOR THAT    08350000
*                                  IS THE TARGET OF THE DSGNL           08400000
SPRPSSOC DS    XL1                 SIGP ORDER CODE                      08450000
SPRPSRC  DS    XL1                 IEAVESGP RETURN CODE                 08500000
SPRPSRSV DS    XL10                RESERVED                             08550000
SPRPSGLE DS    0F                  END OF RPSGNL SYSTEM TRACE ENTRY     08600000
*                                  TEMPLATE                             08650000
         SPACE 3                                                   @D1A 08653300
SPSRPSRB DSECT                     SRB Suspend/Resume/Purge        @D1A 08656600
*                                  The suspend entry is also logged     08657700
*                                  by IEAVSCHA.                         08658800
*                                  System Trace entry template     @D1A 08659900
*                                  (SRVID=X0118/X0119/X011A).      @D1A 08663200
SPSRRESA DS    A                   Address at which the SRB will   @D1A 08666500
*                                  be resumed.                     @D1A 08669800
SPSRSSRB DS    A                   Address of the SSRB associated  @D1A 08673100
*                                  with the suspended SRB routine. @D1A 08676400
SPSRTKN  DS    CL8                 Suspend Token which uniquely    @D1A 08679700
*                                  identifies the suspended        @D1A 08683000
*                                  routine.                        @D1A 08686300
SPSRRSV  DS    XL4                 Reserved.                       @D1A 08689600
SPSRPE   DS    0F                  End of SRB Suspend/Resume/Purge @D1A 08692900
*                                  System Trace entry template     @D1A 08696200
         SPACE 3                                                        08696400
SPSCHF   DSECT                     SRB routine dispatch.           @L4A 08696500
*                                  This is the dispatch of an SRB that  08696600
*                                  was Scheduled with MODE=FULLXM which 08696700
*                                  has a dispatchable unit access list  08696800
*                                  of greater than 256 entries.         08696900
*                                  (SRVID=X011C)                        08697200
SPPSW    DS    XL8                 SRB Dispatch PSW                @L4A 08697400
SPSRBAD  DS    A                   User's Register 0               @L4A 08697600
SPSRBPRM DS    A                   User's SRB parameter            @L4A 08697800
SPSRBFRR DS    A                   User's FRR parm addr or value   @L4A 08698000
*                                  in R2 at time of SRB Dispatch        08698200
SPESCHF  DS    0F                  End of IEAVSCHF System Trace    @L4A 08698400
*                                  entry template                       08698600
*        SPACE 3                                                   @L6A 08700900
SPPRT    DSECT                     Pause/Release/Transfer System   @L6A 08703200
*                                  Trace Entry template.  The Pause     08705500
*                                  entry is logged by IEAVEGAR and      08707800
*                                  IEAVEGUR (SSRVID=X011E/X011F).       08710100
SPPRTCRA DS    A                   Return address of the caller of @L6A 08712400
*                                  the Pause/Release/Transfer service   08714700
SPPRTSSD DS    A                   Address of the SSD assciated    @L6A 08717000
*                                  with the Paused DU routine.          08719300
SPPRTSSD2 DS   A                   For a transfer Pause trace:     @L6A 08721600
*                                    Address of the SSD associated      08723900
*                                    with the DU to which the transfer  08726200
*                                    went.                              08728500
*                                  For a transfer Release trace:        08730800
*                                    Address of the SSD associated with 08733100
*                                    the DU from which the transfer     08735400
*                                    came.                              08737700
SPPRTDUA DS    A                   For Release/transfer Release    @P4A 08738400
*                                    Address of the DU being released   08739100
*                                      WEB address for SRBs             08739800
*                                      TCB address for Tasks            08740500
SPPRTASN DS    XL2                 For Release/transfer Release:   @P5A 08740900
*                                    ASN of the DU being released       08741300
SPPRTRSV DS    XL2                 Reserved                        @P5C 08741700
SPPRTE   DS    0F                  End of Pause/Release/Transfer   @L6A 08742300
*                                  System Trace entry template.         08744600
         POP   PRINT                                                    08746900
         MEND                                                           08750000
* */                                                                    08800000
*%PLSSPTR2:;                                                            08850000
*                                                                       08900000
*  @LISTPUSH;                                                           08950000
*  %IF IHALIST='YES' %THEN                                              09000000
*     %GOTO SPTRLST;                                                    09050000
*  @LISTOFF;                                                            09100000
*  %SPTRLST:;                                                           09150000
*                                                                       09200000
*@SPACE(3);                                                             09225000
* DECLARE                                                               09250000
*   1 SPETCL1 BASED(WSACSTPL),         /* IEAVSPN1 ENTRY POINT OF       09300000
*                                         IEAVETCL SYSTEM TRACE ENTRY   09350000
*                                         TEMPLATE (SRVID=X010E)     */ 09400000
*     3 SPET1RET PTR(31),              /* CALLERS RETURN ADDRESS     */ 09450000
*     3 SPET1TAA PTR(31),              /* TARGET ADDRESS SPACE ASCB     09500000
*                                         ADDRESS                    */ 09550000
*     3 SPET1TAR PTR(31),              /* ADDRESS OF TCB TO BE          09600000
*                                         SUSPENDED                  */ 09650000
*     3 SPET1RAR PTR(31),              /* ADDRESS OF RB TO BE           09700000
*                                         SUSPENDED                  */ 09750000
*     3 SPET1FLG BIT(8),               /* IEAVETCL OPTION FLAG BYTE  */ 09783300
*       5 *        BIT(5),             /* RESERVED                   */ 09816600
*       5 SPET1FRB BIT(1),             /* RB OPERAND INDICATION FLAG    09850000
*                                         (0 - RB=CURRENT AND 1 - RB=   09900000
*                                         PREVIOUS)                  */ 09950000
*     3 SPET1RSV CHAR(3),              /* RESERVED                   */ 10000000
*     3 SPETCL1E CHAR(0);              /* END OF IEAVETCL SYSTEM TRACE  10050000
*                                         ENTRY TEMPLATE             */ 10100000
*@SPACE(3);                                                             10125000
* DECLARE                                                               10150000
*   1 SPETCL2 BASED(WSACSTPL),         /* IEAVRSH1, IEAVRSS1, IEAVRSU1, 10200000
*                                         IEAVRSC1, IEAVRSA1, IEAVRSRB, 10250000
*                                         IEAVRSMS ENTRY POINTS OF      10300000
*                                         IEAVETCL SYSTEM TRACE ENTRY   10350000
*                                         TEMPLATE (SRVID=X010F)     */ 10400000
*     3 SPET2RET PTR(31),              /* CALLERS RETURN ADDRESS OR     10416600
*                                         0 WHICH INDICATES             10433200
*                                         THAT THE RETURN=N OPTION WAS  10449800
*                                         SPECIFIED ON THE RESUME MACRO 10466400
*                                                                    */ 10483000
*     3 SPET2TAA PTR(31),              /* TARGET ADDRESS SPACE ASCB     10500000
*                                         ADDRESS                    */ 10550000
*     3 SPET2TAR PTR(31),              /* ADDRESS OF TCB TO BE          10600000
*                                         RESUMED                    */ 10650000
*       5 SPET2FMD BIT(1),             /* MODE OPERAND INDICATION FLAG  10662500
*                                         (1 - MODE=COND AND 0 - MODE=  10675000
*                                         UNCOND)                    */ 10687500
*     3 SPET2RAR PTR(31),              /* ADDRESS OF RB TO BE           10700000
*                                         RESUMED                    */ 10750000
*       5 SPET2FRS BIT(1),             /* RSM RESET REQUEST INDICATION  11150000
*                                         (1 - RSM RESET REQUESTED AND  11200000
*                                         0 - RSM RESET NOT             11250000
*                                         REQUESTED)                 */ 11300000
*     3 SPET2FLG BIT(8),               /* IEAVETCL OPTION FLAG BYTE  */ 11310000
*       5 SPET2FAS BIT(1),             /* ASYNC OPERAND INDICATION FLAG 11320000
*                                         (1 - ASYNC=YES AND 0 - ASYNC= 11330000
*                                         NO)                        */ 11340000
*     3 SPET2RSV CHAR(3),              /* RESERVED                   */ 11350000
*     3 SPETCL2E CHAR(0);              /* END OF IEAVETCL SYSTEM TRACE  11400000
*                                         ENTRY TEMPLATE             */ 11450000
*@SPACE(3);                                                             11475000
* DECLARE                                                               11500000
*   1 SPESC2  BASED(WSACSTPL),         /* IEAVESC2 AND IEAVESC8 ENTRY   11550000
*                                         POINTS OF IEAVESC0, AND       11590000
*                                         IEAVSCHA, and IEAVSCHD        11630000
*                                         SYSTEM TRACE ENTRY TEMPLATE   11670000
*                                         (SRVID=X0110, X0112, X011B,   11696600
*                                         X011D)                     */ 11723200
*     3 SPES2RET PTR(31),              /* CALLERS RETURN ADDRESS     */ 11750000
*     3 SPES2SRB FIXED(31),            /* ADDRESS OF SRB TO BE          11800000
*                                         SCHEDULED                  */ 11850000
*     3 SPES2TAA PTR(31),              /* TARGET ADDRESS SPACE ASCB     11900000
*                                         ADDRESS                    */ 11950000
*     3 SPES2EPA PTR(31),              /* ENTRY POINT ADDRESS OF        12000000
*                                         ROUTINE TO EXECUTE IN THE     12050000
*                                         TARGET ADDRESS SPACE       */ 12100000
*     3 SPES2PK  BIT(8),               /* PROTECT KEY INDICATOR      */ 12150000
*     3 SPES2OPF BIT(8),               /* SRB OPTION FLAGS (SEE         12200000
*                                         SRBFLGS)                   */ 12250000
*       5 SPES2FL1 BIT(8),             /* IEAMSCHD FLAGS1        @P3A*/ 12275000
*     3 SPES2TPF BIT(8),               /* SRB TYPE FLAGS (SEE           12300000
*                                         SRBFLGS1)                  */ 12350000
*       5 SPES2FL2 BIT(8),             /* IEAMSCHD FLAGS2        @P3A*/ 12375000
*     3 SPES2HLH BIT(8),               /* SUSPEND LOCKS HELD AT SRB     12400000
*                                         SUSPENSION INDICATOR       */ 12450000
*       5 SPES2FL3 BIT(8),             /* IEAMSCHD FLAGS3        @P3A*/ 12475000
*     3 SPESC2E  CHAR(0);              /* END OF IEAVESC0, IEAVSCHA     12500000
*                                         SYSTEM TRACE ENTRY TEMPLATE*/ 12550000
*@SPACE(3);                                                             12575000
* DECLARE                                                               12600000
*   1 SPESC4  BASED(WSACSTPL),         /* IEAVESC4 ENTRY POINT OF       12650000
*                                         IEAVESC0 SYSTEM TRACE ENTRY   12700000
*                                         TEMPLATE (SRVID=X0111)     */ 12750000
*     3 SPES4RET PTR(31),              /* IEAVESC4 CALLERS RETURN       12800000
*                                         ADDRESS                    */ 12850000
*     3 SPES4RSV CHAR(16),             /* RESERVED                   */ 12900000
*     3 SPESC4E  CHAR(0);              /* END OF IEAVESC4 SYSTEM TRACE  12950000
*                                         ENTRY TEMPLATE             */ 13000000
*@SPACE(3);                                                             13025000
* DECLARE                                                               13050000
*   1 SPESCA  BASED(WSACSTPL),         /* IEAVESCA AND IEAVESCC ENTRY   13052900
*                                         POINTS OF IEAVESC0 SYSTEM     13055800
*                                         TRACE ENTRY TEMPLATE          13058700
*                                         (SRVID=X0116 AND X0117)       13061600
*                                                                @L1A*/ 13064500
*     3 SPESARET PTR(31),              /* CALLERS RETURN ADDRESS @L1A*/ 13067400
*     3 SPESASRB PTR(31),              /* ADDRESS OF SRB TO BE          13070300
*                                         SCHEDULED              @L1A*/ 13073200
*     3 SPESATAA PTR(31),              /* TARGET ADDRESS SPACE ASCB     13076100
*                                         ADDRESS                @L1A*/ 13079000
*     3 SPESASTK BIT(64),              /* STOKEN REPRESENTING THE       13081900
*                                         TARGET ADDRESS SPACE.  @L1A*/ 13084800
*     3 SPESCAE  CHAR(0);              /* END OF IEAVESC0 SYSTEM TRACE  13087700
*                                         ENTRY TEMPLATE         @L1A*/ 13090600
*@SPACE(3);                                                             13093500
* DECLARE                                                               13096400
*   1 SPDSGNL BASED(WSACSTPL),         /* DSGNL SYSTEM TRACE ENTRY      13100000
*                                         TEMPLATE (SRVID=X0113)     */ 13150000
*     3 SPDSGRET PTR(31),              /* DSGNL CALLERS RETURN          13200000
*                                         ADDRESS                    */ 13250000
*     3 SPDSGPCR FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  13300000
*                                         REQUESTING THE DSGNL       */ 13350000
*     3 SPDSGPCT FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  13400000
*                                         THAT IS THE TARGET OF THE     13450000
*                                         DSGNL                      */ 13500000
*     3 SPDSGST  FIXED(32),            /* STATUS REGISTERS CONTENTS (IF 13550000
*                                         SPDSGRC=8) OR ZERO         */ 13600000
*     3 SPDSGSOC FIXED(8),             /* SIGP ORDER CODE            */ 13650000
*     3 SPDSGRC  FIXED(8),             /* IEAVESGP RETURN CODE       */ 13700000
*     3 SPDSGRSV CHAR(6),              /* RESERVED                   */ 13750000
*     3 SPDSGNLE CHAR(0);              /* END OF DSGNL SYSTEM TRACE     13800000
*                                         ENTRY TEMPLATE             */ 13850000
*@SPACE(3);                                                             13875000
* DECLARE                                                               13900000
*   1 SPRISGNL BASED(WSACSTPL),        /* RISGNL SYSTEM TRACE ENTRY     13950000
*                                         TEMPLATE (SRVID=X0114)     */ 14000000
*     3 SPRISRET PTR(31),              /* RISGNL CALLERS RETURN         14050000
*                                         ADDRESS                    */ 14100000
*     3 SPRISPCR FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  14150000
*                                         REQUESTING THE RISGNL      */ 14200000
*     3 SPRISPCT FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  14250000
*                                         THAT IS THE TARGET OF THE     14300000
*                                         RISGNL                     */ 14350000
*     3 SPRISSOC FIXED(8),             /* SIGP ORDER CODE            */ 14400000
*     3 SPRISRC  FIXED(8),             /* IEAVESGP RETURN CODE       */ 14450000
*     3 SPRISRSV CHAR(10),             /* RESERVED                   */ 14500000
*     3 SPRISGLE CHAR(0);              /* END OF RISGNL SYSTEM TRACE    14550000
*                                         ENTRY TEMPLATE             */ 14600000
*@SPACE(3);                                                             14625000
* DECLARE                                                               14650000
*   1 SPRPSGNL BASED(WSACSTPL),        /* RPSGNL SYSTEM TRACE ENTRY     14700000
*                                         TEMPLATE (SRVID=X0115)     */ 14750000
*     3 SPRPSRET PTR(31),              /* RPSGNL CALLERS RETURN         14800000
*                                         ADDRESS                    */ 14850000
*     3 SPRPSPCR FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  14900000
*                                         REQUESTING THE RPSGNL      */ 14950000
*     3 SPRPSPCT FIXED(16),            /* PHYSICAL CPU ID OF PROCESSOR  15000000
*                                         THAT IS THE TARGET OF THE     15050000
*                                         RPSGNL                     */ 15100000
*     3 SPRPSSOC FIXED(8),             /* SIGP ORDER CODE            */ 15150000
*     3 SPRPSRC  FIXED(8),             /* IEAVESGP RETURN CODE       */ 15200000
*     3 SPRPSRSV CHAR(10),             /* RESERVED                   */ 15250000
*     3 SPRPSGLE CHAR(0);              /* END OF RPSGNL SYSTEM TRACE    15300000
*                                         ENTRY TEMPLATE             */ 15350000
*@SPACE(3);                                                             15352600
* DECLARE                                                               15355200
*   1 SPSRPSRB BASED(WSACSTPL),        /* SRB Suspend/Resume/Purge      15357800
*                                         System Trace Entry template   15360400
*                                         The suspend entry is also     15361200
*                                         logged by IEAVSCHA.           15362000
*                                         (SSRVID=X0118/X0119/X011A).   15363000
*                                                                @D1A*/ 15365600
*     3 SPSRRESA PTR(31),              /* Address at which the SRB      15368200
*                                         will be resumed.       @D1A*/ 15370800
*     3 SPSRSSRB PTR(31),              /* Address of the SRB assciated  15373400
*                                         with the suspended SRB        15376000
*                                         routine.               @D1A*/ 15378600
*     3 SPSRTKN  CHAR(8),              /* Suspend Token which uniquely  15381200
*                                         identifies the suspended      15383800
*                                         routine.               @D1A*/ 15386400
*     3 SPSRRSV  CHAR(4),              /* Reserved.              @D1A*/ 15389000
*     3 SPSRPE   CHAR(0);              /* End of SRB                    15391600
*                                         Suspend/Resume/Purge System   15394200
*                                         Trace entry template.  @D1A*/ 15396800
*@SPACE(3);                                                             15397000
* DECLARE                                                               15397200
*   1 SPSCHF  BASED(WSACSTPL),         /* IEAVSCHF exit to user routine.15397400
*                                         This is an SRB Dispatch out of15397600
*                                         the Sched w/Addr front-end    15397800
*                                         (SRVID=X'011C')        @L4A*/ 15398000
*     3 SPPSW CHAR(8),                 /* SRB Dispatch PSW       @L4A*/ 15398200
*     3 SPSRBAD CHAR(4),               /* User's Register 0      @L4A*/ 15398400
*     3 SPSRBPRM CHAR(4),              /* User's SRB parameter   @L4A*/ 15398600
*     3 SPSRBFRR CHAR(4),              /* User's FRR parm or value in   15398800
*                                         R2 at time of SRB Dispatch.   15399000
*                                                                @L4A*/ 15399200
*     3 SPESCHF CHAR(0);               /* End of IEAVSCHF System Trace  15399400
*                                         entry template.        @L4A*/ 15399600
*@SPACE(3);                                                             15449600
* DECLARE                                                               15499600
*   1 SPPRT    BASED(WSACSTPL),        /* Pause/Release/Transfer        15549600
*                                         System Trace Entry template   15599600
*                                         The Pause entry is logged     15649600
*                                         by IEAVEGAR and IEAVEGUR.     15699600
*                                         (SSRVID=X011E/X011F)   @L6A*/ 15749600
*     3 SPPRTCRA PTR(31),              /* Return address of the caller  15799600
*                                         of the Pause/Release/         15849600
*                                         Transfer service       @L6A*/ 15899600
*     3 SPPRTSSD PTR(31),              /* Address of the SSD assciated  15949600
*                                         with the Paused DU routine.   15999600
*                                                                @L6A*/ 16049600
*     3 SPPRTSSD2 PTR(31),             /* For a transfer Pause trace:   16099600
*                                           Address of the SSD          16149600
*                                           associated with the DU to   16199600
*                                           which the transfer went.    16249600
*                                         For a transfer Release trace: 16299600
*                                           Address of the SSD          16349600
*                                           associated with the DU from 16399600
*                                           which the transfer came.    16449600
*                                                                @L6A*/ 16499600
*     3 SPPRTDUA PTR(31),              /* For Release/transfer Release: 16512100
*                                           Address of the DU being     16524600
*                                           released.                   16537100
*                                             WEB address for SRBs      16549600
*                                             TCB address for Tasks     16562100
*                                                                @P4A*/ 16574600
*     3 SPPRTASN Fixed(16),            /* For Release/transfer Release: 16579600
*                                           ASN of the DU being         16584600
*                                           released             @P5A*/ 16589600
*     3 SPPRTRSV CHAR(2),              /* Reserved               @P5C*/ 16594600
*     3 SPPRTE   CHAR(0);              /* End of Pause/Release/Transfer 16633300
*                                         System Trace entry template.  16672000
*                                                                @L6A*/ 16710700
*  @LISTPOP;                                                            16749600
