*                                                                       00050000
*        %GO TO SHDRL1; /*                                     @G64RP2F 00100000
         MACRO                                                 @G64RP2F 00150000
         IHASHDR &DSECT=YES  */                                         00200000
*%SHDRL1 : ;                                                            00250000
*                                                                       00300000
*/**START OF SPECIFICATIONS*******************************************/ 00323300
*/*                                                                  */ 00346600
*/*01* MACRO NAME:  IHASHDR                                      @P2A*/ 00369900
*/*                                                                  */ 00393200
*/*01* DESCRIPTIVE NAME:  SLIP Header                            @P2A*/ 00416500
*/*01* ACRONYM:  SHDR                                            @P2A*/ 00439800
*/*01* EXTERNAL CLASSIFICATION: DMTI                             @P2A*/ 00463100
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @P2A*/ 00486400
*/*                                                                  */ 00509700
*/*01* PROPRIETARY STATEMENT:                                    @P2A*/ 00533000
*/***PROPRIETARY_STATEMENT********************************************/ 00556300
*/*                                                                  */ 00579600
*/*                                                                  */ 00602900
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00626200
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00649500
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                      */ 00684400
*/*                                                                  */ 00719400
*/* STATUS= HBB7703                                                  */ 00742700
*/*                                                                  */ 00766000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00789300
*/*                                                                  */ 00812600
*/*                                                                  */ 00835900
*/*01* DSECT NAME:  SHDR, SHDRX                                  @P2A*/ 00870800
*/*                                                                  */ 00905800
*/*01* COMPONENT:  SLIP (SCSLP)                                  @D1C*/ 00929100
*/*                                                                  */ 00952400
*/*01* EYE-CATCHER:  SHDR - for SHDR, SHDX - for SHDRX           @P2A*/ 00975700
*/*02*  OFFSET:  0 for both SHDR and SHDRX                       @P2A*/ 00999000
*/*02*  LENGTH:  4 for both SHDR and SHDRX                       @P2A*/ 01022300
*/*                                                                  */ 01045600
*/*                                                                  */ 01068900
*/*01* STORAGE ATTRIBUTES:                                       @P2A*/ 01092200
*/*02*   SUBPOOL:  245 for both SHDR and SHDRX                   @P2A*/ 01115500
*/*02*   KEY:  0 for both SHDR and SHDRX                         @P2A*/ 01138800
*/*02*   RESIDENCY:  BELOW for SHDR, ANY for SHDRX               @P2A*/ 01162100
*/*                                                                  */ 01185400
*/*01* SIZE: SHDR - 200 bytes                                    @P2A*/ 01208700
*/*          SHDRX - 2624 bytes                                  @LDC*/ 01232000
*/*                                                                  */ 01255300
*/*01* CREATED BY:  IEECB905 when the first SLIP trap is set.    @P2A*/ 01278600
*/*                                                                  */ 01301900
*/*01* FUNCTION:                                                 @P2A*/ 01325200
*/*                                                                  */ 01348500
*/*02*  The SHDR is the head of the PER and non-PER SCE          @P2A*/ 01395100
*/*     chains.  It points to the first and last elements in     @P2A*/ 01441700
*/*     the SCE chains.                                          @P2A*/ 01488300
*/*                                                                  */ 01534900
*/*01*  METHOD OF ACCESS:                                        @P2A*/ 01558200
*/*      PL/AS - DCL SCEPTR                                      @P2A*/ 01581500
*/*                                                                  */ 01604800
*/*01* POINTED TO BY:  CVTRTMS field of the CVT data area        @P2A*/ 01628100
*/*                                                                  */ 01651400
*/*01* SERIALIZATION:  Compare & Swap, Compare Double & Swap     @P2A*/ 01674700
*/*                                                                  */ 01698000
*/*01* CHANGE ACTIVITY=                                              */ 01721300
*/*                                                                  */ 01744600
*/*                       SYSTEM CONTROL PROGRAM II          @G64RP2F*/ 01767900
*/*                       PTM 49456,PARM AREA FOR UPDATING THE PER   */ 01791200
*/*                                 CONTROL REGISTERS.               */ 01814500
*/*                       PTM 49430,ECB FOR IEAVTGLB TO ISSUE PGFIX  */ 01837800
*/*                       PTM 49337,ECB FOR IEAVTLCL TO ISSUE PGFIX  */ 01861100
*/*                       PTM 49334,FLAG TO INDICATE THE GETCELL-    */ 01884400
*/*                                 FREECELL PROBLEM HAS OCCURRED,   */ 01907700
*/*                                 (PROBLEM: WHILE FREECELL WAS     */ 01931000
*/*                                 DEQUEUEING THE CELLPOOL,         */ 01954300
*/*                                 GETCELL OBTAINED A CELL).        */ 01977600
*/*                       MVS/SYSTEM PRODUCT RELEASE 2       @G385P2F*/ 02000900
*/*                   MVS/SYSTEM PRODUCT VERSION 2 RELEASE 1 @G860P2F*/ 02024200
*/*                  $L1=PVTMOD,JBB2125,821123,PDXB: PVTMOD PER      */ 02047500
*/*                  $L2=TREVENT,JBB2125,821101,PDFO: ACTION=STRACE  */ 02070800
*/*                  $L3=RASENH ,JBB2220,830801,PDXB: PER/NON-PER    */ 02094100
*/*                  $L4=RASENH  ,JBB2220,830801,PDXB: WAIT STATE    */ 02117400
*/*                  $L5=  AR     HBB3310 850901 PDXB: AR SUPPORT    */ 02140700
*/*                  $L6= RTMRAS  HBB3310 860201 PDXB: SHDRX         */ 02164000
*/*                  $L7= PER02   HBB4410 870505 PDXB: PER 2         */ 02187300
*/*                  $L8= MSLIP   HBB4410 890201 PDXB:               */ 02210600
*/*                  $L9= CNITG   HBB4410 890721 PDDJ: CONSOLE       */ 02233900
*/*                                                    INTEGRATION   */ 02257200
*/*     $LA=SHPCS HBB5510 930304 PDCS: Multisystem slip enhancements */ 02280500
*/*     $P1=PIG4321 HBB5510 930601 PDCS: Incident token corrections  */ 02303800
*/*     $P2=PIG2071 HBB5510 930715 PDCS: Showhdr corrections         */ 02327100
*/*     $LB=SERV2S  HBB5520 940106 PDCS: Serviceability              */ 02334800
*/*     $LC=SERV2S  HBB5520 940210 PDCS: Serviceability              */ 02342500
*/*     $LD=SERV2S  HBB5520 940310 PDCS: Serviceability              */ 02346400
*/*     $P3=PN70565 HBB5520 940602 PDCS: Indefinite rescheduling of  */ 02347700
*/*                                      IEAVTGLB                    */ 02349000
*/*     $P4=PN71356 HBB5520 940908 PDCS: Allow indefinite            */ 02349400
*/*                                      rescheduling of IEAVTGLB    */ 02349800
*/*     $D1=DCRA165 HBB6603 960229 PDCS: Support for POSIX           */ 02357700
*/*                                      executable files            */ 02365600
*/*    $LE=DYLPASLP JBB6604 960808 PDXB: Dynamic LPA                 */ 02369600
*/*    $LF=IEEESLIP HBB6606 970807 PDXB: Remove SHDRPER2             */ 02371600
*/*    $P5=PVT0211 HBB6606 980119 PDCS:  Add SHDRLCL                 */ 02371800
*/*    $P6=PVT0353  HBB6606 980119 PDCS: Add ShdrWaReschedule to     */ 02372000
*/*                                      support an IEAVTSL4         */ 02372200
*/*                                      reschedule option           */ 02372400
*/*    $P7=PVT0511  HBB6606 980119 PDCS: Add ShdrLCL1 to record      */ 02372500
*/*                                      to address of LPERRMTR      */ 02372600
*/*                                      in IEAVTLCL                 */ 02372700
*/*    $LG=64BITSLP HBB7703 981204 PD00XB: ESAME                     */ 02372800
*/*    $P8=PXD0882  HBB7703 991208 PD00XB: Check VTADR plist length  */ 02372900
*/*                                                                  */ 02373000
*/***END OF SPECIFICATIONS********************************************/ 02373700
*%GO TO  SHDRL2;  /*                                           @G64RP2F 02400000
         SPACE 1                                               @G64RP2F 02450000
         AIF   ('&DSECT' EQ 'NO').SHDR10                       @G64RP2F 02500000
SHDR     DSECT                                                 @G64RP2F 02550000
         AGO   .SHDR20                                         @G64RP2F 02600000
.SHDR10  ANOP                                                  @G64RP2F 02650000
         DS    0D                                              @G64RP2F 02700000
SHDR     EQU   *                                               @G64RP2F 02750000
.SHDR20  ANOP                                                  @G64RP2F 02800000
SHDRCBID DS    CL4                 CONTROL BLOCK ID=SHDR       @G64RP2F 02850000
SHDRPFC  DS    A                   IEAVTSLP USE COUNT          @G64RP2F 02900000
SHDRCTFW DS    0D                  TO DELETE ENTRIES, MUST CDS @G64RP2F 02950000
SHDRCTR  DS    A                   PROCESSOR SERIALIZATION CTR @G64RP2F 03000000
SHDRFWD  DS    A                   FORWARD PTR TO SCE CHAIN    @G64RP2F 03050000
SHDRBKWD DS    A                   BACKWARD PTR TO SCE CHAIN   @G64RP2F 03100000
SHDRFLCS DS    0F                  LABEL TO CS FLAGS           @G64RP2F 03150000
SHDRFLGS DS    B                   FLAGS                       @G64RP2F 03200000
SHDRDELP EQU   X'40'             DELETE IS PENDING ON PREV SCE @G64RP2F 03250000
SHDRCRTN EQU   X'20'               COMMUNICATION RTN IS ACTIVE @G64RP2F 03300000
SHDRSRBR EQU   X'10'               RESCHEDULE GLOBAL SRB       @G64RP2F 03350000
SHDRPERI EQU   X'08'               ENABLED PER IGNORE TRAPS WITH THE    03400000
*                                  SAME PER EVENT (IF,SA,SB) AS DEFINED 03450000
*                                  IN THE ENABLED NON-IGNORE PER TRAP   03500000
*                                  EXIST BETWEEN THE ENABLED NON-IGNORE 03550000
*                                  PER TRAP AND THE END OF THE CHAIN    03600000
*                                                              @G64RP2F 03650000
SHDRM415 EQU   X'04'               IEA415I MESSAGE FLAG        @G64RP2F 03700000
SHDRM422 EQU   X'02'               IEA422I MESSAGE FLAG        @G64RP2F 03750000
SHDRFLG2 DS    B                   FLAGS                       @G64RP2F 03800000
SHDRPSTM EQU   X'80'               IND TO POST THE MESSAGE RTN, SET     03850000
*                                  AND TESTED BY IEAVTSLP      @G64RP2F 03900000
SHDRGCFC EQU   X'40'               IND GETCELL-FREECELL PROBLEM HAS     03950000
*                                  OCCURRED                    @ZM49334 04000000
SHDRPVTP EQU   X'20'               PER TRAP IS PVTMOD              @L1A 04050000
SHDRPVTA EQU   X'10'               PVTMOD PER TRAP IS ACTIVE (ADDRESSES 04100000
*                                  DETERMINED). ONLY VALID WHEN         04150000
*                                  SHDRPVTP IS ON                  @L1A 04200000
SHDRPVLP EQU   X'08'               PVTMOD PER TRAP IS WAITING FOR LOAD, 04250000
*                                  OR VIRTUAL FETCH                @L1A 04300000
SHDRSTDP EQU   X'04'               DISABLED PER TRAP FOR STRACE    @L2A 04350000
SHDRCHNE EQU   X'02'               CHAINING ERROR IN SCE CHAIN     @L3A 04400000
SHDRIDCT DS    H                   CTR FOR GENERATING SCE ID   @G64RP2F 04450000
SHDRPROC DS    A                   SLIP PROCESSOR IEAVTSLP     @G64RP2F 04500000
SHDRPER  DS    A                   ENABLED NON-IGNORE PER TRAP @G64RP2F 04550000
SHDRSRTN DS    A                   PER SELECT RTN (IEAVTJBN)   @G64RP2F 04600000
SHDRPERR DS    A                   PER TRAPS SCVA RANGE ENTRY  @G64RP2F 04650000
SHDRPERA DS    A                   PER TRAPS SCVA ASID ENTRY   @G64RP2F 04700000
SHDRPERJ DS    A                   PER TRAPS SCVA JOBNAME NTRY @G64RP2F 04750000
SHDRSEQ  DS    0F                  SEQUENCE WORD               @G64RP2F 04800000
         DS    CL2                 RESERVED                    @G64RP2F 04850000
SHDRSEQA DS    CL2                 ASID WHEN LOCAL RTN OWNS SEQ WORD    04900000
*                                                              @G64RP2F 04950000
SHDRSRB  DS    A                   GLOBAL SRB FOR PER          @G64RP2F 05000000
SHDRSRBA EQU   X'80'               AVAILABILITY FLG (ON=AVAIL) @G64RP2F 05050000
SHDRPOST DS    A                   SRB FOR VTSLP TO POST THE COMMUNICA- 05100000
*                                  TION RTN (RTN IN IEECB905)  @G64RP2F 05150000
SHDRPSTA EQU   X'80'               AVAILABILITY FLG (ON=AVAIL) @G64RP2F 05200000
SHDRCPID DS    CL4                 SRB CELL POOL ID            @G64RP2F 05250000
SHDRECB  DS    CL4                 MESSAGE ECB                 @G64RP2F 05300000
SHDRGECB DS    CL4                 ECB FOR IEAVTGLB TO ISSUE PGFIX      05350000
*                                                              @ZM49430 05400000
SHDRLECB DS    CL4                 ECB FOR IEAVTLCL TO ISSUE PGFIX      05450000
*                                                              @ZM49337 05500000
SHDRCREG DS    0CL12               PARM AREA FOR UPDATING THE PER       05550000
*                                  CONTROL REGISTERS           @ZM49456 05600000
SHDRCR9  DS    0CL4                CONTROL REGISTER 9          @ZM49456 05650000
SHDRC9   DS    CL1                 EVENT MASK BYTE             @ZM49456 05700000
SHDRC9SB EQU   X'80'               SUCCESSFUL BRANCH FLAG      @ZM49456 05750000
SHDRC9IF EQU   X'40'               INSTRUCTION FETCH FLAG      @ZM49456 05800000
SHDRC9SA EQU   X'20'               STORAGE ALTERATION FLAG     @ZM49456 05850000
SHDRC9SS EQU   X'08'               SA STURA                        @L7A 05866600
SHDRC91  DS    CL1                 BYTE 1 OF CR 9                  @L7A 05883200
SHDRC9S2 EQU   X'80'               PER 2 SB                        @L7A 05899800
SHDRC9SE EQU   X'20'               STORAGE ALTERATION SELECTION    @L7A 05916400
         DS    CL2                 LAST 2 BYTES OF CNTRL REG 9     @L7A 05933000
SHDRCRS  DS    0CL8                PER RANGE                   @ZM49456 05950000
SHDRCR10 DS    CL4                 PER STARTING ADDRESS TO BE LOADED    06000000
*                                  INTO CONTROL REGISTER 10    @ZM49456 06050000
SHDRCR11 DS    CL4                 PER ENDING ADDRESS TO BE LOADED INTO 06100000
*                                  CONTROL REGISTER 11         @ZM49456 06150000
SHDRCMS1 DS     A                  ADDRESS OF THE CMSET SET    @G385PPY 06200000
*                                  ENTRY POINT                 @G385PPY 06250000
SHDRCMR1 DS     A                  ADDRESS OF THE CMSET RESET  @G385PPY 06300000
*                                  CMSET WITH AUTH CHECK       @G385PPY 06350000
*                                  ENTRY POINT                 @G385PPY 06400000
SHDRCMR2 DS     A                  ADDRESS OF THE CMSET RESET  @G385PPY 06450000
*                                  WITHOUT AUTH CHECK ENTRY    @G385PPY 06500000
*                                  POINT                       @G385PPY 06550000
SHDRSSHP DS     A                  ADDRESS OF THE SPACE SWITCH @G385PPY 06600000
*                                  HANDLER (IEAVTSSH)          @G385PPY 06650000
SHDRSSTM DS     CL8                AMOUNT OF TIME TO EXECUTE   @G38AP2F 06700000
*                                  THE SPACE SWITCH EVENT      @G38AP2F 06750000
*                                  PROCESSING FOR SLIP         @G38AP2F 06800000
SHDRSS1P DS     A                  ADDRESS OF THE SPACE SWITCH @G860P2F 06850000
*                                  HANDLER ENTRY POINT FOR     @G860P2F 06900000
*                                  CMSET INTERCEPTS (IEAVTSS1) @G860P2F 06950000
SHDRPCDE DS     A                  CDE ADDRESS FOR PVTMOD PER      @L1A 07000000
SHDRPVL1 DS     A                  ADDESS OF EXIT FROM CONTENTS         07050000
*                                  SUPERVISOR WHEN CDE                  07100000
*                                  IS PUT ONTO JOB PACK QUEUE      @L1A 07150000
SHDRPVD1 DS     A                  ADDESS OF EXIT FROM CONTENTS         07200000
*                                  SUPERVISOR WHEN CDE IS TAKEN         07250000
*                                  OFF JOB PACK QUEUE              @L1A 07300000
SHDRPVMN DS     CL8                PVTMOD PER MODULE NAME          @L1A 07350000
SHDRPVAS DS     XL2                PVTMOD PER ASID                 @L1A 07400000
SHDRPVFL DS     X                  FLAGS                           @L1A 07450000
SHDRPVTL EQU    X'80'              IF ON, PRIVATE MODULE IS LOCAL  @L1A 07500000
SHDRPVTG EQU    X'40'              IF ON, PRIVATE MODULE IS GLOBAL @L1A 07550000
SHDRFLAG DS     XL1                FLAGS                           @L2C 07600000
SHDRSTRC EQU    X'80'              IF ON, ACTION = STRACE, PER TRAP@L2A 07650000
SHDRSTFP EQU    X'40'              IF ON, ACTION=STRACE, FAST PATH @L2A 07700000
SHDRSTSB EQU    X'20'              IF ON, ACTION=STRACE, PER SB    @L2A 07750000
*                                                                 1@LFD 07775000
SHDRPASC DS     A                  PVTMOD PER ASCB ADDRESS         @L1A 07800000
SHDRPTCB DS     A                  PVTMOD PER TCB ADDRESS          @L1A 07850000
SHDRPVR1 DS     A                  ADDRESS OF EXIT FROM VIRTUAL FETCH  *07900000
                                   END OF TASK, END OF MEMORY RESOURCE *07950000
                                   MANAGERS                        @L1A 08000000
SHDRSTID DS     CL4                ACTION=STRACE, ID OF TRAP       @L2A 08050000
SHDRMLC  DS     A                  ACTION=STRACE, CURRENT MATCHLIM @L2A 08100000
SHDRMLT  DS     H                  ACTION=STRACE, TOTAL MATCHLIM       *08150000
                                   DEFAULT                         @L2A 08200000
         DS     H                  RESERVED                        @L2A 08250000
         DS    F                   RESERVED                        @L3A 08300000
SHDRCTF2 DS    0D                  TO DELETE ENTRIES, MUST CDS. THIS   *08350000
                                     QUEUE IS FOR NON-PER SCES     @L3A 08400000
SHDRCTR2 DS    A                   PROCESSOR SERIALIZATION CTR     @L3A 08450000
SHDRFWD2 DS    A                   FORWARD PTR TO SCE CHAIN        @L3A 08500000
SHDRBWD2 DS    A                   BACKWARD PTR TO SCE CHAIN       @L3A 08550000
SHDRIDQ  DS    A                   QUEUE OF IDS WITH SCES          @L3A 08600000
SHDRIDQL DS    A                   END OF ID QUEUEU                @L3A 08650000
SHDRWMSG DS    A                   ADDRESS OF DISABLED CONSOLE MESSAGE *08700000
                                   AREA                            @L4A 08750000
SHDRXADR DS    A                   SHDR EXTENSION                  @L5A 08800000
         DS    CL4                 RESERVED                        @L5A 08850000
         AIF   ('&DSECT' EQ 'NO').SHDR11                           @L5A 08900000
SHDRX    DSECT                                                     @L5A 08950000
         AGO   .SHDR21                                             @L5A 09000000
.SHDR11  ANOP                                                      @L5A 09050000
         DS    0D                                                  @L5A 09100000
SHDRX    EQU   *                                                   @L5A 09150000
.SHDR21  ANOP                                                      @L5A 09200000
         DS    CL1316              MAPPED ONLY IN PLS              @L6A 09250000
         MEND  ,    */                                                  09300000
*%SHDRL2 : ;                                                            09350000
*                                                                       09400000
*    DCL 1  SHDR        BASED(CVTRTMS) BDY(DWORD),                      09450000
*          2  SHDRCBID   CHAR(4),      /* CONTROL BLOCK ID = SHDR    */ 09500000
*          2  SHDRPFC    PTR(31),      /* IEAVTSLP USE COUNT         */ 09550000
*          2  SHDRCTFW CHAR(8) BDY(WORD),/*TO DELETE ENTRIES,MUST CDS*/ 09600000
*            3 SHDRCTR   PTR(31),      /* PROCESSOR SERIALIZATION CTR*/ 09650000
*            3 SHDRFWD   PTR(31),      /* FORWARD PTR TO SCE CHAIN   */ 09700000
*          2  SHDRBKWD   PTR(31),      /* BACKWARD PTR TO SCE CHAIN  */ 09750000
*          2  SHDRFLCS CHAR(4) BDY(WORD) ABNORMAL, /* Label to CS flags 09783300
*                                                                @LBC*/ 09816600
*            3 SHDRFLGS  BIT(8),       /* FLAGS                      */ 09850000
*              4 *         BIT(1),     /* RESERVED           @G64RP2F*/ 09900000
*              4 SHDRDELP  BIT(1),     /*DELETE IS PENDNG ON PREV SCE*/ 09950000
*              4 SHDRCRTN  BIT(1),     /* COMMUNICATION RTN IS ACTIVE   10000000
*                                                            @G64RP2F*/ 10050000
*              4 SHDRSRBR  BIT(1),     /* RESCHEDULE GLOBAL SRB         10100000
*                                                            @G64RP2F*/ 10150000
*              4 SHDRPERI  BIT(1),     /* ENABLED PER IGNORE TRAPS      10200000
*                                        WITH THE SAME PER EVENT (IF,   10250000
*                                        SA,SB) AS DEFINED IN THE       10300000
*                                        ENABLED NON-IGNORE PER TRAP    10350000
*                                        EXIST BETWEEN THE ENABLED      10400000
*                                        NON-IGNORE PER TRAP AND THE    10450000
*                                        END OF THE CHAIN    @G64RP2F*/ 10500000
*              4 SHDRM415  BIT(1),     /* IEA415I MSG FLAG   @G64RP2F*/ 10550000
*              4 SHDRM422  BIT(1),     /* IEA422I MSG FLAG   @G64RP2F*/ 10600000
               4 *         BIT (1),    /* RESERVED           @G64RP2F*/ 10650000
*            3 SHDRFLG2  BIT(8),       /* FLAGS              @G64RP2F*/ 10700000
*              4 SHDRPSTM  BIT(1),     /* IND TO POST THE MESSAGE RTN,  10750000
*                                          SET AND TESTED BY IEAVTSLP   10800000
*                                                            @G64RP2F*/ 10850000
*              4 SHDRGCFC  BIT(1),     /* IND GETCELL-FREECELL PROBLEM  10900000
*                                         HAS OCCURRED       @ZM49334*/ 10950000
*              4 SHDRPVTP  BIT(1),     /* PER TRAP IS PVTMOD     @L1A*/ 11000000
*              4 SHDRPVTA  BIT(1),     /* PVTMOD PER TRAP IS ACTIVE     11050000
*                                         (ADDRESSES DETERMINED). ONLY  11100000
*                                         VALID WITH SHDRPVTP    @L1A*/ 11150000
*              4 SHDRPVLP  BIT(1),     /* PVTMOD PER TRAP IS WAITING    11200000
*                                         FOR LOAD OR VIRTUAL           11250000
*                                         FETCH                  @L1A*/ 11300000
*              4 SHDRSTDP  BIT(1),     /* DISABLED PER TRAP, ACTION =   11350000
*                                         STRACE                 @L2A*/ 11400000
*              4 SHDRCHNE  BIT(1),     /* CHAINING ERROR IN SCE CHAIN   11450000
*                                                                @L3A*/ 11500000
*              4 *         BIT(1),  /* Reserved                  @P4A*/ 11533300
*                                                                       11566600
*            3 SHDRIDCT  PTR(15),      /* CTR FOR GENERATING SCE ID  */ 11600000
*          2  SHDRPROC   PTR(31),      /* SLIP PROCESSOR IEAVTSLP    */ 11650000
*          2  SHDRPER    PTR(31),      /* ENABLED NON-IGNORE PER TRAP   11700000
*                                                            @G64RP2F*/ 11750000
*          2  SHDRSRTN   PTR(31),      /* PER SELECT RTN (IEAVTJBN)     11800000
*                                                            @G64RP2F*/ 11850000
*          2  SHDRPERR   PTR(31),      /* PER TRAPS SCVA RANGE ENTRY    11900000
*                                                            @G64RP2F*/ 11950000
*          2  SHDRPERA   PTR(31),      /* PER TRAPS SCVA ASID ENTRY     12000000
*                                                            @G64RP2F*/ 12050000
*          2  SHDRPERJ   PTR(31),      /* PER TRAPS SCVA JOBNAME ENTRY  12100000
*                                                            @G64RP2F*/ 12150000
*          2  SHDRSEQ  CHAR(4) BDY(WORD), /* SEQUENCE WORD   @G64RP2F*/ 12200000
*            3  *        CHAR(2),      /* RESERVED           @G64RP2F*/ 12250000
*            3  SHDRSEQA CHAR(2),      /* ASID WHEN LOCAL RTN OWNS      12300000
*                                         SEQ WORD           @G64RP2F*/ 12350000
*          2  SHDRSRB    PTR(31),      /* GLOBAL SRB FOR PER @G64RP2F*/ 12400000
*            3 SHDRSRBA  BIT(1),       /* AVAILABILITY FLAG (ON=AVAIL)  12450000
*                                                            @G64RP2F*/ 12500000
*          2  SHDRPOST   PTR(31),      /* SRB FOR VTSLP TO POST THE     12550000
*                                        COMMUNICATION RTN   @G64RP2F*/ 12600000
*            3 SHDRPSTA  BIT(1),       /* AVAILABILITY FLAG (ON=AVAIL)  12650000
*                                                            @G64RP2F*/ 12700000
*          2  SHDRCPID   CHAR(4),      /* SRB CELL POOL ID   @G64RP2F*/ 12750000
*          2  SHDRECB    CHAR(4),      /* MESSAGE ECB        @G64RP2F*/ 12800000
*          2  SHDRGECB   CHAR(4),      /* ECB FOR IEAVTGLB TO ISSUE     12850000
*                                         PGFIX              @ZM49430*/ 12900000
*          2  SHDRLECB   CHAR(4),      /* ECB FOR IEAVTLCL TO ISSUE     12950000
*                                         PGFIX              @ZM49337*/ 13000000
*          2  SHDRCREG   CHAR(12),     /* PARM AREA FOR UPDATING THE    13050000
*                                         PER CONTROL REGS   @ZM49456*/ 13100000
*            3 SHDRCR9   CHAR(4),      /* CONTROL REGISTER 9 @ZM49456*/ 13150000
*              4 SHDRC9    CHAR(1),    /* EVENT MASK BYTE    @ZM49456*/ 13200000
*                5 SHDRC9SB  BIT(1),   /* SUCCESSFUL BRANCH  @ZM49456*/ 13250000
*                5 SHDRC9IF  BIT(1),   /* INSTRUCTION FETCH  @ZM49456*/ 13300000
*                5 SHDRC9SA  BIT(1),   /* STORAGE ALTERATION @ZM49456*/ 13350000
*                5 *         BIT(1),   /* RESERVED               @L7C*/ 13362500
*                5 SHDRC9SS  BIT(1),   /* SA STURA               @L7A*/ 13375000
*                5 *         BIT(3),   /* SPACER             @ZM49456*/ 13387500
*              4 SHDRC9B1 CHAR(1),     /*                        @L7A*/ 13400000
*                5 SHDRC9S2  BIT(1),   /* PER 2 SB               @L7A*/ 13412500
*                5 *         BIT(1),   /* RESERVED               @L7A*/ 13425000
*                5 SHDRC9SE  BIT(1),   /* SA SELECTION           @L7A*/ 13437500
*            3 SHDRCRS   CHAR(8),      /* PER RANGE          @ZM49456*/ 13450000
*              4 SHDRCR10  CHAR(4),    /* PER STARTING ADDRESS TO BE    13500000
*                                         LOADED INTO CONTROL REG 10    13550000
*                                                            @ZM49456*/ 13600000
*              4 SHDRCR11  CHAR(4),    /* PER ENDING ADDRESS TO BE      13650000
*                                         LOADED INTO CONTROL REG 11    13700000
*                                                            @ZM49456*/ 13750000
*          2  SHDRCMS1 PTR(31),        /* ADDRESS OF THE CMSET SET      13800000
*                                         ENTRY POINT        @G385PPY*/ 13850000
*          2  SHDRCMR1 PTR(31),        /* ADDRESS OF THE CMSET RESET    13900000
*                                         WITH AUTH CHECK ENTRY POINT   13950000
*                                                            @G385PPY*/ 14000000
*          2  SHDRCMR2 PTR(31),        /* ADDRESS OF THE CMSET RESET    14050000
*                                         WITHOUT AUTH CHECK ENTRY      14100000
*                                         POINT              @G385PPY*/ 14150000
*          2  SHDRSSHP PTR(31),        /* ADDRESS OF THE SPACE SWITCH   14200000
*                                         HANDLER (IEAVTSSH) @G385PPY*/ 14250000
*          2  SHDRSSTM CHAR(8) BDY(DWORD), /* AMOUNT OF TIME TO EXECUTE 14300000
*                                         THE SPACE SWITCH PROCESSING   14350000
*                                         FOR SLIP           @G38AP2F*/ 14400000
*          2  SHDRSS1P PTR(31),        /* ADDRESS OF THE SPACE SWITCH   14450000
*                                         HANDLER ENTRY POINT FOR       14500000
*                                         CMSET INTERCEPTS (IEAVTSS1)   14550000
*                                                            @G860P2F*/ 14600000
*          2  SHDRPCDE PTR(31),        /* ADDRESS OF CDE FOR PVTMOD     14650000
*                                         PER TRAP               @L1A*/ 14700000
*          2  SHDRPVL1 PTR(31),        /* ADDRESS OF EXIT FROM          14750000
*                                         CONTENTS SUPERVISOR           14800000
*                                         WHEN CDE IS PUT ONTO JOB      14850000
*                                         PACK QUEUE             @L1A*/ 14900000
*          2  SHDRPVD1 PTR(31),        /* ADDRESS OF EXIT FROM          14950000
*                                         CONTENTS SUPERVISOR WHEN CDE  15000000
*                                         IS TAKEN OFF JOB PACK         15050000
*                                         QUEUE                  @L1A*/ 15100000
*          2  SHDRPVMN CHAR(8),        /* PVTMOD PER MODULE NAME @L1A*/ 15150000
*          2  SHDRPVAS FIXED(16),      /* PVTMOD PER ASID        @L1A*/ 15200000
*          2  SHDRPVFL BIT(8),         /* PVTMOD PER FLAGS       @L1A*/ 15250000
*             3 SHDRPVTL BIT(1),       /* IF ON, PRIVATE MODULE IS      15300000
*                                         LOCAL                  @L1A*/ 15350000
*             3 SHDRPVTG BIT(1),       /* IF ON, PRIVATE MODULE IS      15400000
*                                         GLOBAL                 @L1A*/ 15450000
*             3 ShdrPosixPathName BIT(1), /* Indicate POSIX pathname    15475000
*                                      is specified              @D1A*/ 15500000
*             3 * BIT(5),              /* RESERVED               @D1C*/ 15525000
*          2  SHDRFLAG BIT(8),         /* MORE FLAGS             @L2C*/ 15550000
*             3 SHDRSTRC BIT(1),       /* IF ON, ACTION = STRACE,       15600000
*                                         PER TRAP               @L2A*/ 15650000
*             3 SHDRSTFP BIT(1),       /* IF ON, ACTION = STRACE,       15700000
*                                         FAST PATH              @L2A*/ 15750000
*             3 SHDRSTSB BIT(1),       /* IF ON, ACTION = STRACE,       15800000
*                                         PER SB                 @L2A*/ 15830000
*             3 * BIT(5),              /* RESERVED               @LFC*/ 15880000
*          2  SHDRPASC PTR(31),        /* PVTMOD PER ASCB ADDR   @L1A*/ 15950000
*          2  SHDRPTCB PTR(31),        /* PVTMOD PER TCB ADDRESS @L1A*/ 16000000
*          2  SHDRPVR1 PTR(31),        /* ADDRESS OF EXIT FROM VIRTUAL  16050000
*                                         FETCH END OF TASK, END OF     16100000
*                                       MEMORY RESOURCE MANAGERS @L1A*/ 16150000
*          2  SHDRSTID CHAR(4),        /* ACTION=STRACE, ID OF TRAP     16200000
*                                                                @L2A*/ 16250000
*          2  SHDRMLC FIXED(31),       /* ACTION=STRACE, CURRENT        16300000
*                                         MATCHLIM               @L2A*/ 16350000
*          2  SHDRMLT FIXED(16),       /* ACTION=STRACE, TOTAL MATCHLIM 16400000
*                                         DEFAULT                @L2A*/ 16450000
*          2  *  CHAR(2),              /* RESERVED               @L3C*/ 16500000
*          2  ShdrPerFirst PTR(31), /* For an active dynamic PER        16516600
*                                      activation chain, this points to 16533200
*                                      the first trap on the chain. For 16549800
*                                      a single active PER trap this is 16566400
*                                      the same as ShdrPer       @LBA*/ 16583000
*          2 SHDRCTF2 CHAR(8) BDY(DWORD),/*TO DELETE ENTRIES,MUST CDS.  16600000
*                                         THIS QUEUE IS OF NON-PER      16650000
*                                         SCE'S                  @L3A*/ 16700000
*            3 SHDRCTR2  PTR(31),      /* SERIALIZATION COUNTER  @L3A*/ 16750000
*            3 SHDRFWD2  PTR(31),      /* FORWARD PTR TO SCE     @L3A*/ 16800000
*          2  SHDRBWD2   PTR(31),      /* BACKWARD PTR TO SCE    @L3A*/ 16850000
*          2  SHDRIDQ    PTR(31),      /* QUEUE OF IDS WITH ASSOCIATED  16900000
*                                         SCE'S                  @L3A*/ 16950000
*          2  SHDRIDQL   PTR(31),      /* END OF ID QUEUE        @L3A*/ 17000000
*          2  SHDRWMSG   PTR(31),      /* ADDRESS OF DISABLED CONSOLE   17050000
*                                         MESSAGE AREA           @L4A*/ 17100000
*            3 SHDRWALK  BIT(1),       /* Lock bit (C/S)         @L8A*/ 17125000
*          2  SHDRXADR   PTR(31),      /* ADDRESS OF SHDR               17150000
*                                         EXTENSION              @L5A*/ 17200000
*          2  *          CHAR(4);      /* RESERVED               @L5C*/ 17250000
*    DCL 1 SHDRX BDY(DWORD) BASED(SHDRXADR), /* SHDR EXTENSION,         17300000
*                                         ABOVE 16M              @P1C*/ 17350000
*          2 SHDRXID CHAR(4),          /* SHDR EXTENSION ID      @L5A*/ 17353300
*          2 SHDRSYNV PTR(31),         /* A=SYNCSVCD VCONS       @L6A*/ 17356600
*            3 SHDRSDIU BIT(1),        /* 1 => SYNCSVCD AREA IN USE     17359900
*                                                                @L6A*/ 17363200
*          2 SHDRRCTX PTR(31),         /* ADDRESS OF IEAVTSLO    @L6A*/ 17366500
*          2 SHDRADR PTR(31),          /* ADDRESS OF IEAVTADR    @L6A*/ 17369800
*          2 SHDRGLB PTR(31),          /* ADDRESS OF IEAVTGLB    @L6A*/ 17373100
*          2 SHDRCECB PTR(31),         /* ECB FOR COMMAND PROCESSOR     17376400
*                                IEECB941 TO USE FOR PGFIX       @L6A*/ 17379700
*          2 ShdrxCsWord,              /* Work for CS            @LBA*/ 17380200
*            3 SHDRXLEN FIXED(15),     /* LENGTH OF SHDRX        @LBC*/ 17380700
*            3 ShdrxFlgs1 CHAR(1) ABNORMAL, /* Flags             @LBA*/ 17381200
*              4 ShdrxPerDeactivationInProgress BIT(1), /* Indicates a  17381700
*                                      PER trap is being deactivated.   17382200
*                                      This bit is turned on by the     17382700
*                                      command processor for disablement17383200
*                                      or deletion of a PER trap and by 17383700
*                                      the action processor for         17384200
*                                      disablement via                  17384700
*                                      matchlim/prcntlim. If it is on   17385200
*                                      control will not enter IEAVTSLD. 17385700
*                                      It remains on until all of the   17386200
*                                      PER workareas are freed by       17386700
*                                      IEAVTGLB                  @LBA*/ 17387200
*            3 ShdrxPosixPathNameLength FIXED(8),/* Length of           17387900
*                                         specified pathname     @D1A*/ 17388600
*          2 SHDRXSSB PTR(31),         /* ADDRESS OF IEAVTSSB    @L7A*/ 17389500
*          2 ShdrxIEAVTPVG@ PTR(31),   /* Address of IEAVTPVG    @D1A*/ 17390600
*          2 SHDRXPLP@ PTR(31),        /* Address of IEAVTPLP    @LEA*/ 17390900
*          2 * CHAR(3),                /* RESERVED               @LEC*/ 17391200
*          2 ShdrxFlags2 BIT(8),       /*                        @LEC*/ 17391500
*            3 ShdrxLpamodOrLpaep BIT(1),  /*                    @LEC*/ 17391800
*          2 * CHAR(8),                /* RESERVED               @LEC*/ 17392100
*          2 SHDRSYND,                 /* A=SYNCSVCD AREA        @L6A*/ 17392900
*            3 SHDRSDSP CHAR(40),      /* STOP PARAMETER LIST    @L6A*/ 17396200
*            3 SHDRSDOA CHAR(12),      /* STOP/RESET OUTPUT AREA @L6A*/ 17399500
*            3 SHDRSDS1 CHAR(44),      /* SRB 1                  @L6A*/ 17402800
*            3 * CHAR(44),             /* Reserved               @L6A*/ 17406100
*            3 SHDRSDP1 CHAR(48),      /* SRB 1 PARAMETER AREA   @L6A*/ 17409400
*              4 SHDRSDSD CHAR(32),    /* RESERVED FOR SDUMP     @L6A*/ 17412700
*              4 SHDRSDAS CHAR(4),     /* TARGET ASCB            @L6A*/ 17416000
*            3 SHDRSDSA CHAR(72),      /* SAVE AREA              @L6A*/ 17419300
*            3 SHDRSDRP CHAR(24),      /* RESET PARAMETER LIST   @L6A*/ 17422600
*            3 SHDRSDWA CHAR(72),      /* WORK AREA              @L6A*/ 17425900
*            3 * CHAR(24),             /* Reserved               @L8C*/ 17429200
*            3 * CHAR(72),             /* RESERVED               @L8C*/ 17432500
*          2 SHDRXWMAOld CHAR(SHDRWMSZ)                                 17433800
*                 BDY(WORD),           /* This area used to be here.    17435100
*                             For ease of expansion, it is now just     17436400
*                             pointed to. This means that these         17437700
*                             1160 bytes can be remapped.        @LGA*/ 17439000
*          2 SHDRXSRB CHAR(44),        /* SRB POINTED TO BY             17440300
*                                         SHDRPOST               @L7C*/ 17441500
*          2 SHDRXAS# FIXED(31),       /* NUMBER ASIDSA ASIDS    @L7A*/ 17442700
*          2 SHDRXASA(16),             /* ASIDSA ASIDS/Jobnames  @LAC*/ 17443000
*            3 ShdrXaFlgs BIT(8),      /*                        @LAA*/ 17443300
*              4 ShdrXaJobnameSpecified BIT(1), /* Jobname specified    17443600
*                                                                @LAA*/ 17443900
*            3 ShdrXaJobname CHAR(8), /* Jobname                 @LAA*/ 17444200
*              4 ShdrXaAsid CHAR(2),   /* ASID                   @LAA*/ 17444500
*          2 SHDRXDS# FIXED(31),       /* NUMBER DSSA SPACES     @L7A*/ 17445100
*          2 SHDRXDSA(16),             /* DSSA SPACES            @LAA*/ 17445400
*                                                                       17445700
*            3 ShdrXdFlgs BIT(8),      /*                        @LAA*/ 17446000
*              4 ShdrXdJobnameSpecified BIT(1), /* Jobname was specified17446300
*                                                                @LAA*/ 17446600
*            3 ShdrXdJobname CHAR(8), /* Jobname                 @LAA*/ 17446900
*              4 ShdrXdAsid CHAR(2),   /* ASID                   @LAA*/ 17447200
*            3 SHDRXDNM CHAR(8),       /* NAME                   @L7A*/ 17447700
*          2 SHDRXWST,                 /* A=WAIT Status area.           17447900
*               This area is serialized by the high order bit           17448100
*               of SHDRWMSG                                      @L8A*/ 17448300
*            3 SHDRXWRK,                 /* X'40C' area          @L8A*/ 17448500
*              4 SHDRXWTY FIXED(8),      /* Trap type            @L8A*/ 17448700
*              4 SHDRXWCP CHAR(2),       /* Logical Cpu          @L8A*/ 17448900
*              4 * CHAR(1),              /* Reserved             @L8A*/ 17449100
*              4 SHDRXWG@ PTR(31),       /* Address of GRs       @L8A*/ 17449300
*              4 SHDRXWP@ PTR(31),       /* Address of ARs       @L8A*/ 17449500
*              4 SHDRXWV@ PTR(31),       /* Address of Variable  @L8A*/ 17449700
*              4 SHDRXWC@ PTR(31),       /* Address of CRs       @L8A*/ 17449900
*              4 SHDRXWA@ PTR(31),       /* Address of ARs       @L8A*/ 17450100
*              4 SHDRXWG64H@ PTR(31),    /* Address of G64H      @LGA*/ 17450200
*            3 SHDRXWID CHAR(4),       /* Trap ID                @L8A*/ 17450300
*            3 SHDRXWGR  CHAR(64),     /* GPRs 0-15              @L8A*/ 17450500
*            3 SHDRXWPS  CHAR(8),      /* PSW                    @L8A*/ 17450700
*            3 * CHAR(52),             /*                        @L8A*/ 17450900
*            3 SHDRXWCR  CHAR(8),      /* Control regs 3,4       @L8A*/ 17451100
*            3 SHDRXWAR  CHAR(64),     /* ARs 0-15               @L8A*/ 17451300
*            3 SHDRXWPE  CHAR(8),      /* PER code when needed   @L8A*/ 17451500
*          2 SHDRWAL4,                 /* Area for SL4           @L8A*/ 17451700
*            3 SHDRWAS1 CHAR(44),      /* SRB to IEAVTSL4        @L8A*/ 17451900
*            3 * CHAR(4),              /* RESERVED               @L8C*/ 17452100
*            3 SHDRWASP CHAR(40),      /* STOP PARAMETER LIST    @L8A*/ 17452300
*            3 SHDRWAOA CHAR(12),      /* STOP/RESET OUTPUT AREA @L8A*/ 17452500
*            3 SHDRWASA CHAR(72),      /* SAVE AREA              @L8A*/ 17452700
*            3 SHDRWARP CHAR(24),      /* RESET PARAMETER LIST   @L8A*/ 17452900
*            3 *        CHAR(4),       /* Reserved               @P1A*/ 17453000
*            3 SHDRWAP1 CHAR(40) BDY(DWORD), /* SL4 parmarea     @P1C*/ 17453100
*              4 SHDRWASC PTR(31),     /* SCE address            @L8A*/ 17453300
*              4 * BIT(8),             /*                        @L8A*/ 17453500
*                5 SHDRWAPE BIT(1),    /* 1 => PER               @L8A*/ 17453700
*                5 SHDRWARS BIT(1),    /* 1 => Reset needed      @L8A*/ 17453900
*                5 ShdrWaReschedule BIT(1), /* 1 => Reschedule of       17454000
*                                         IEAVTSL4               @P6A*/ 17454100
*              4 * CHAR(3),            /* Reserved               @LAA*/ 17454200
*              4 ShdrSdumpToken CHAR(32) BDY(DWORD), /* Token to be     17454300
*                                      passed to SDUMP           @P1C*/ 17454700
*               5 ShdrIXCSSMOTime CHAR(8), /* Time when the             17454800
*                                       IXCSSMO was invoked    @P6A*/   17454900
*          2 ShdrxSLDCount   FIXED(31), /* Counter to serialize the     17455100
*                                      setting of the control regs in   17455500
*                                      IEAVTGLB/IEAVTPVT with IEAVTSLD. 17455900
*                                      When IEAVTSLD is in control, the 17456300
*                                      value is '80000000'X which locks 17456700
*                                      out IEAVTGLB/IEAVTPVT. The       17457100
*                                      dispatcher lock serializes       17457500
*                                      IEAVTGLB with IEAVTPVT    @L6A*/ 17457900
*          2 ShdrxLastPerFirst PTR(31), /* Last value that              17458300
*                                      ShdrPerFirst was set to   @L6A*/ 17458700
*          2 ShdrxLCL PTR(31),         /* Address of IEAVTLCL    @P7A*/ 17458900
*          2 ShdrxLcl1 PTR(31),        /* Address of LPERRMTR in        17459100
*                                         IEAVTLCL               @P7A*/ 17459300
*          2 SHDRXWST2,                /* More A=WAIT Status area.      17459500
*               This area is serialized by the high order bit           17459700
*               of SHDRWMSG                                      @LGA*/ 17459900
*            3 SHDRXWG64H CHAR(64),    /* G64H                   @LGA*/ 17460100
*          2 SHDRXEsameCRs CHAR(3*8),  /* CRs in ESAME           @LGA*/ 17460300
*            3 SHDRXCR9  CHAR(8),      /* CONTROL REGISTER 9     @LGA*/ 17460500
*              4 * CHAR(4),            /* Bits 0-31              @LGA*/ 17460700
*              4 SHDRXC9   CHAR(1),    /* EVENT MASK BYTE        @LGA*/ 17460900
*                5 SHDRXC9SB BIT(1),   /* SUCCESSFUL BRANCH      @LGA*/ 17461100
*                5 SHDRXC9IF BIT(1),   /* INSTRUCTION FETCH      @LGA*/ 17461300
*                5 SHDRXC9SA BIT(1),   /* STORAGE ALTERATION     @LGA*/ 17461500
*                5 *         BIT(1),   /* RESERVED               @LGA*/ 17461700
*                5 SHDRXC9SS BIT(1),   /* SA STURA               @LGA*/ 17461900
*                5 *         BIT(3),   /* SPACER                 @LGA*/ 17462100
*              4 SHDRXC9B1 CHAR(1),    /*                        @LGA*/ 17462300
*                5 SHDRXC9S2 BIT(1),   /* PER 2 SB               @LGA*/ 17462500
*                5 *         BIT(1),   /* RESERVED               @LGA*/ 17462700
*                5 SHDRXC9SE BIT(1),   /* SA SELECTION           @LGA*/ 17462900
*            3 SHDRXCRS,               /* ESAME PER range        @LGA*/ 17463100
*              4 SHDRXCR10 CHAR(8),    /* PER STARTING ADDRESS TO BE    17463300
*                                         LOADED INTO CONTROL REG 10    17463500
*                                                                @LGA*/ 17463700
*              4 SHDRXCR11 CHAR(8),    /* PER ENDING ADDRESS TO BE      17463900
*                                         LOADED INTO CONTROL REG 11    17464100
*                                                                @LGA*/ 17464300
*          2 * CHAR(0) BDY(DWORD);     /* End of SHDR            @LBC*/ 17464500
*                                                                       17464700
*    DCL 1 SHDRSDV BASED(SHDRSYNV),    /* V-CONS FOR SYNCSVCD    @L6A*/ 17464900
*          2 SHDRVS1E PTR(31),         /* POINTER-DEFINED EPA    @L6A*/ 17465100
*          2 SHDRVS1F PTR(31),         /* POINTER-DEFINED FRRA   @L6A*/ 17466500
*          2 SHDRVS1R PTR(31),         /* POINTER-DEFINED RMTRA  @L6A*/ 17472000
*          2 SHDRVS2E PTR(31),         /* POINTER-DEFINED EPA    @L6A*/ 17477500
*          2 SHDRVS2F PTR(31),         /* POINTER-DEFINED FRRA   @L6A*/ 17483000
*          2 SHDRVS2R PTR(31);         /* POINTER-DEFINED RMTRA  @L6A*/ 17488500
*                                                                       17494000
*        /* THE FOLLOWING CONSTANTS IDENTIFY THE OWNER OF THE           17500000
*           SHDRSEQ WORD WHICH IS USED TO SERIALIZE ACCESS TO           17550000
*           THE SCE CHAIN.                             @G64RP2F*/       17600000
*    DCL SHDRSEQC CHAR(4) CONSTANT(' CMD'), /* SHDRSEQ OWNED BY THE     17650000
*                                       CMD PROC IEECB905    @G64RP2F*/ 17700000
*        SHDRSEQD CHAR(4) CONSTANT(' DSP'), /* SHDRSEQ OWNED BY THE     17750000
*                                       DISPLAY RTN IEECB907 @G64RP2F*/ 17800000
*        SHDRSEQG CHAR(4) CONSTANT(' GLB'), /* SHDRSEQ OWNED BY THE     17850000
*                                       SLIP GLOBAL PER ACT/DEACT RTN   17900000
*                                       IEAVTGLB             @G64RP2F*/ 17950000
*        SHDRSEQX CHAR(4) CONSTANT(' SLX'), /* ShdrSeq owned by Slip    17966600
*                                       dump exit                @LDA*/ 17983200
*        SHDRSEQL CHAR(4) CONSTANT(' L  '); /* SHDRSEQ OWNED BY THE     18000000
*                                       SLIP LOCAL PER ACT/DEACT RTN    18050000
*                                       IEAVTLCL (NOTE: LAST 2 CHAR     18100000
*                                       CONTAIN THE ASID OF THE ADDR    18150000
*                                       SPACE IN WHICH IEAVTLCL IS      18200000
*                                       EXECUTING)           @G64RP2F*/ 18250000
*                                                                       18300000
*    DCL SHDRWMSZ CONSTANT(1160);     /* SIZE OF WAIT STATE MESSAGE     18350000
*                           / WORK AREA. SERIALIZED BY RESTART LOCK     18400000
*                           WORD AND HIGH ORDER (USE-) BIT OF           18450000
*                           SHDRWMSG                             @LCC*/ 18500000
*        /* THE FOLLOWING ARE CONSTANTS THAT SHOULD BE USED WHEN        18550000
*           SETTING BITS IN THE SHDR VIA THE CS INSTRUCTION.            18600000
*           THE BIT WHICH EACH OF THE FOLLOWING MASKS SETS IS           18650000
*           GIVEN IN THE COMMENT ON THAT LINE.  THE SHDRX...            18700000
*           FORM IS FOR SETTING THE BIT ON AND THE SHDRY... FORM        18750000
*           IS FOR SETTING THE BIT OFF.                @G64RP2F*/       18800000
*    DCL SHDRXDEL BIT(32) CONSTANT('40000000'X), /* SHDRDELP @G64RP2F*/ 18850000
*        SHDRYDEL BIT(32) CONSTANT('BFFFFFFF'X), /* SHDRDELP @G64RP2F*/ 18900000
*        SHDRXCRN BIT(32) CONSTANT('20000000'X), /* SHDRCRTN @G64RP2F*/ 18950000
*        SHDRYCRN BIT(32) CONSTANT('DFFFFFFF'X), /* SHDRCRTN @G64RP2F*/ 19000000
*        SHDRXRBR BIT(32) CONSTANT('10000000'X), /* SHDRSRBR @G64RP2F*/ 19050000
*        SHDRYRBR BIT(32) CONSTANT('EFFFFFFF'X), /* SHDRSRBR @G64RP2F*/ 19100000
*        SHDRXPRI BIT(32) CONSTANT('08000000'X), /* SHDRPERI @G64RP2F*/ 19150000
*        SHDRYPRI BIT(32) CONSTANT('F7FFFFFF'X), /* SHDRPERI @G64RP2F*/ 19200000
*        SHDRX415 BIT(32) CONSTANT('04000000'X), /* SHDRM415 @G64RP2F*/ 19250000
*        SHDRY415 BIT(32) CONSTANT('FBFFFFFF'X), /* SHDRM415 @G64RP2F*/ 19300000
*        SHDRX422 BIT(32) CONSTANT('02000000'X), /* SHDRM422 @G64RP2F*/ 19350000
*        SHDRY422 BIT(32) CONSTANT('FDFFFFFF'X), /* SHDRM422 @G64RP2F*/ 19400000
*        SHDRXPST BIT(32) CONSTANT('00800000'X), /* SHDRPSTM @G64RP2F*/ 19450000
*        SHDRYPST BIT(32) CONSTANT('FF7FFFFF'X), /* SHDRPSTM @G64RP2F*/ 19500000
*        SHDRXFC  BIT(32) CONSTANT('00400000'X), /* SHDRGCFC @ZM49334*/ 19550000
*        SHDRYFC  BIT(32) CONSTANT('FFBFFFFF'X), /* SHDRGCFC @ZM49334*/ 19600000
*        SHDRXPVP BIT(32) CONSTANT('00200000'X), /* SHDRPVTP     @L1A*/ 19650000
*        SHDRYPVP BIT(32) CONSTANT('FFDFFFFF'X), /* SHDRPVTP     @L1A*/ 19700000
*        SHDRXPVA BIT(32) CONSTANT('00100000'X), /* SHDRPVTA     @L1A*/ 19750000
*        SHDRYPVA BIT(32) CONSTANT('FFEFFFFF'X), /* SHDRPVTA     @L1A*/ 19800000
*        SHDRXPLP BIT(32) CONSTANT('00080000'X), /* SHDRPVLP     @L1A*/ 19850000
*        SHDRYPLP BIT(32) CONSTANT('FFF7FFFF'X), /* SHDRPVLP     @L1A*/ 19900000
*        SHDRXSTD BIT(32) CONSTANT('00040000'X), /* SHDRSTDP     @L2A*/ 19950000
*        SHDRYSTD BIT(32) CONSTANT('FFFBFFFF'X), /* SHDRSTDP     @L2A*/ 20000000
*        SHDRXCHN BIT(32) CONSTANT('00020000'X), /* SHDRCHNE     @L3A*/ 20050000
*        SHDRYCHN BIT(32) CONSTANT('FFFDFFFF'X); /* SHDRCHNE     @L3A*/ 20100000
*                                                                       20150000
*%IF IHASHDR_WMSGA ~= 'YES' %THEN                                       20200000
*%GOTO IHASHDRPLS1;                                                     20250000
* /* Area used within IEAVTSL2 and IEAVTSL4                          */ 20300000
*/* ++ Invoke '?LOADWAIT' to get the parameter list for                 20350000
*   the WSPARM keyword in the WTO macro that was defined in IEAVTSL2 */ 20400000
*/********************************************************************/ 20450000
*/* Define a parameter list for the WSPARM keyword of the WTO macro  */ 20500000
*/* There is no need to update the parameter list, because the       */ 20550000
*/* the record will be defined in IEAVTSL2. The reason why this macro*/ 20600000
*/* is issued is to get addressability to and determine the length   */ 20650000
*/* of WAITparam. Note that no executable code is generated here.    */ 20700000
*/********************************************************************/ 20750000
*  @SPACE(2);                                                           20800000
*  ?LOADWAIT                                                            20850000
*     MF(L,WAITparam,Based(WAITparamPtr));                    /* @L1P*/ 20900000
*                                                                       20950000
*  ?WTO TEXT( (TextArray(1), D), (TextArray(2), D), (TextArray(3), D),  21000000
*       (TextArray(4), D), (TextArray(5), D), (TextArray(6), D),        21050000
*       (TextArray(7), D), (TextArray(8), D), (TextArray(9), D),        21100000
*       (TextArray(10), D), (TextArray(11), D), /*               @PAM*/ 21150000
*       (TextArray(12), D), (TextArray(13), D), /*               @PAM*/ 21200000
*       (TextArray(14), DE))        /*                           @PAM*/ 21250000
*      ROUTCDE(1) DESC(1) SYNCH(YES)                                    21300000
*      CPFLG(RROK                                                       21350000
*          !,NLCK /* This is commented out to avoid a WTO warning    */ 21400000
*           )                                                           21450000
*      MF(L,SlipWaitMsg,Based(SlipWaitMsgPtr));               /* @PAM*/ 21500000
*DCL 1 WMSGA BASED(SHDRWMSG) BDY(DWORD),                      /* @LGC*/ 21550000
*      2 WMUNPA CHAR(36),           /* UNPACK AREA               @LCA*/ 21600000
*      2 WAITparamPtr Ptr(31),       /* Base for WAITparam       @LCA*/ 21650000
*      2 SlipWaitMsgPtr Ptr(31),     /* Base for SlipWaitMsg     @LCA*/ 21700000
*      2 WAITparamArea Char(Length(WAITparam)), /* Storage for          21750000
*                                      the WAITparam mapping     @LCA*/ 21800000
*      2 SlipWaitMsgArea Char(Length(SlipWaitMsg)), /* Storage for      21850000
*                                      the SlipWaitMsg mapping   @LCA*/ 21900000
*      2 TextArrayIndex Fixed(31),   /* Index for TextArray      @LCA*/ 21950000
*      2 TextArray (14),             /* WTO message text         @LEC*/ 22000000
*        4 TextLength  Fixed(16),    /* Length of WTO line       @LCA*/ 22050000
*        4 TextString Char(MessageLength), /* Output for the WTO @LCA*/ 22100000
*        4 * Char(1),                /* Padding for alignment    @LGA*/ 22150000
*      2 * Char(8),                  /* Reserved                 @LGA*/ 22200000
*      2 * Char(0) Bdy(Dword);                               /*  @LCA*/ 22250000
*/********************************************************************/ 22300000
*/*  Constants for WTO line types                                    */ 22350000
*/********************************************************************/ 22400000
* Declare                                                               22450000
*  MessageLength Fixed(16) Constant(71); /* Max length of a WTO         22500000
*                                           message that will fit on    22550000
*                                           one line             @LGC*/ 22600000
*%IHASHDRPLS1:;                                                         22650000
*%IF SYSVERSION = '' %THEN                                              22700000
*%GOTO IHASHDRPLS2;                                                     22750000
*%IF IHASHDR_VTADR = 'NO' %THEN                                         22800000
*%GOTO IHASHDRPLS2;                                                     22850000
*%DCL ASAXMAC_ISITPLX CHAR EXT;                                         22900000
*?ASAXMAC IsItPLX(1,2,0);                                               22950000
*%IF ASAXMAC_ISITPLX ~= 'YES' %THEN                                     23000000
*%GOTO IHASHDRPLS2;                                                     23050000
*DCL 1 Ieavtadr_Plist TYPE,         /* IEAVTADR PARM LIST            */ 23100000
*    3 VTPARPTR PTR(31),            /* PTR TO PAIRS OF DIRECT INDIRECT  23150000
*                                      ADDRESSES                     */ 23200000
*      5 ADRINDPT PTR(31),          /*                           @LGA*/ 23250000
*    3 VTREGS PTR(31),              /* PTR TO REGS USED TO RESOLVE      23300000
*                                      INDIRECT ADDRESS(R0-R15)      */ 23350000
*      5 ADRREGS PTR(31),           /*                           @LGA*/ 23400000
*    3 VTREGS64H PTR(31),           /* Address of G64H           @LGA*/ 23450000
*    3 VTWRKA CHAR(36)  BDY(WORD),  /* WORK AREA FOR IEAVTADR        */ 23500000
*        5 VTADRBAS8 CHAR(8),       /* BASE ADDRESS              @LGC*/ 23550000
*            11 VtadrBadBase Char(8),  /* When "VtadrBadBaseCon", no    23600000
*                                      base established. Otherwise,     23650000
*                                      base established.         @LGC*/ 23700000
*        5 VTRETRY PTR(31),         /* RETRY ADDRESS IN CASE ERROR      23750000
*                                      OCCURS WHILE IEAVTADR IN CNTL */ 23800000
*          7 ADRENIND FIXED(31),    /* Function code                 */ 23850000
*            11 VTDATFCH BIT(1),    /* IF ON, RETRY ADDRESS IS OK AND   23900000
*                                      ERROR OCCURRED WHILE FETCHING    23950000
*                                      DATA                      @P3A*/ 24000000
*              13 VTAINVD BIT(1),   /*                           @LGA*/ 24050000
*        5 VTWRKRST CHAR(24) BDY(WORD), /* Rest of workarea          */ 24100000
*    3 * CHAR(0);                   /*                               */ 24150000
*DCL VtadrBadBaseCon Char(8) Constant('FFFFFFFFFFBADBAD'x);  /* It is   24200000
*                       vital that bit 32 of this constant be "1" so    24250000
*                       that the ESA390 test in IEAVTADR will properly  24300000
*                       identify the "no base" condition             */ 24350000
*DCL VtadrEnabled Constant(1);      /* Function code to tell            24400000
*                                   IEAVTADR that the caller is         24450000
*                                   enabled                             24500000
*                                                                @LGA*/ 24550000
*DCL VtadrScan FIXED(32) CONSTANT(2); /* Function code to tell          24600000
*                                   IEAVTADR just to scan and not       24650000
*                                   convert the indirect address        24700000
*                                                                @LGA*/ 24750000
*DCL VtadrIsItIndirect FIXED(32) CONSTANT(3); /* Function code to tell  24800000
*                                   IEAVTADR just to scan to see if     24850000
*                                   this is an indirect address         24900000
*                                                                @LGA*/ 24950000
*%IHASHDRPLS2:;                                                         25000000
