*                                                                       00050000
* %DCL IHATDUMP_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IHATDUMP_INCLUDED;                                        00150000
* %IF IHATDUMP_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 98176. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHATDUMP &DSECT=YES,&LIST=YES,&TITLE=YES,&TDUMP=YES            00450000
         GBLC  &IHATDUMP_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IHATDUMP_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00616600
         AIF   ('&TITLE' EQ 'NO').P5                                    00633200
 TITLE   'IHATDUMP  - Transaction Dump parameter list              '    00650000
.P5      ANOP                                                           00675000
**/ IHATDUMP_1:;                                                        00700000
*/** START OF SPECIFICATIONS  ****************************************/ 00750000
*/*                                                                  */ 00800000
*/*   MACRO NAME: IHATDUMP                                           */ 00850000
*/*                                                                  */ 00900000
*/*   DSECT NAME: TDUMP                                              */ 00950000
*/*                                                                  */ 01000000
*/*   DESCRIPTIVE NAME: Transaction Dump parameter list              */ 01050000
*/*                                                                  */ 01100000
*/*   COMPONENT: SVC Dump (SCDMP)                                    */ 01150000
*/*                                                                  */ 01200000
*/*   PROPRIETARY STATEMENT:                                         */ 01250000
*/*                                                                  */ 01300000
*/*       LICENSED MATERIALS - PROPERTY OF IBM                       */ 01350000
*/*       THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                */ 01400000
*/*       5647-A01 (C) COPYRIGHT IBM CORP. 1997,1999                 */ 01450000
*/*                                                                  */ 01500000
*/*   STATUS: JBB6607                                                */ 01550000
*/*                                                                  */ 01600000
*/*   EXTERNAL CLASSIFICATION: DMTI                                  */ 01650000
*/*   END OF EXTERNAL CLASSIFICATION:                                */ 01700000
*/*                                                                  */ 01750000
*/*   EYE CATCHER: TDMP                                              */ 01800000
*/*   OFFSET: 0                                                      */ 01850000
*/*   LENGTH: 4                                                      */ 01900000
*/*                                                                  */ 01950000
*/*   STORAGE ATTRIBUTES:                                            */ 02000000
*/*   MAIN STORAGE: One per dump request                             */ 02050000
*/*   SUBPOOL: Any                                                   */ 02100000
*/*   KEY: Any                                                       */ 02150000
*/*   RESIDENCY: Any                                                 */ 02200000
*/*                                                                  */ 02250000
*/*   SIZE: 108 bytes                                                */ 02300000
*/*                                                                  */ 02350000
*/*   CREATED BY: Transaction dump requestor                         */ 02400000
*/*                                                                  */ 02450000
*/*   FUNCTION: This is the mapping macro for the transaction        */ 02500000
*/*             dump parameter list as produced by the IEATDUMP      */ 02550000
*/*             macro.                                               */ 02600000
*/*                                                                  */ 02650000
*/*   METHOD OF ACCESS:                                              */ 02700000
*/*     ASM:                                                         */ 02750000
*/*      TDUMP -- X'007C' bytes                                      */ 02800000
*/*      Specify LIST=YES for listing.                               */ 02850000
*/*     PL/AS:                                                       */ 02900000
*/*      %INCLUDE SYSLIB(IHATDUMP)                                   */ 02950000
*/*      DCL %LIST = 'YES'  for listing.                             */ 03000000
*/*                                                                  */ 03050000
*/*   SERIALIZATION: NONE                                            */ 03100000
*/*                                                                  */ 03150000
*/*   POINTED TO BY: Reg 1 on entry to SVC 33                        */ 03200000
*/*                                                                  */ 03250000
*/*   CHANGE ACTIVITY:                                               */ 03300000
*/* FLAG  REASON   RELEASE  DATE   ORIGIN                            */ 03350000
*/* $L0= TDUMP     JBB6604 961205  PDHT: Transaction Dumping         */ 03375000
*/*      OW27000   JBB6604 970724  PDHT: TDUMP Remote processing     */ 03400000
*/* $01= OW29659   JBB6604 980401  PDHT: Add async dump target flag  */ 03425000
*/* $L1= TSVCD     JBB6607 980413  PDHT: Ref DspRecords indirectly   */ 03437500
*/*                                                                  */ 03450000
*/** END OF SPECIFICATIONS  ******************************************/ 03500000
*% /*                                                                   03550000
.P0      ANOP                                                           03575000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03600000
         AIF   ('&LIST' EQ 'YES').P2                                    03650000
.P1      ANOP                                                           03700000
         PUSH  PRINT                                                    03750000
         PRINT OFF                                                      03800000
.P2      ANOP                                                           03850000
TDUMPID  EQU   C'TDMP'   TDUMP eye-catcher                              03900000
TDMPMINLENGTH EQU 124    Minimum parmlist length                        03906900
TDMPVER1LENGTH EQU 124   Version 1 parmlist length                      03913800
TDMPMAXLENGTH EQU 124    Maximum parmlist length                        03920700
TDMPMINVERSION EQU 1     Minimum parmlist version level                 03927600
TDMPMAXVERSION EQU 1     Maximum parmlist version level                 03933200
         AIF   ('&TDUMP' EQ 'NO').L0002                                 03950000
         AIF   ('&DSECT' EQ 'YES').L0003                                04000000
         AIF   ('&TDUMP' NE 'YES').L0002                                04050000
TDUMP    DS    0F        ?IEATDUMP parameter list                       04100000
         AGO   .L0004                                                   04150000
.L0003   ANOP                                                           04200000
TDUMP    DSECT           ?IEATDUMP parameter list                       04250000
.L0004   ANOP                                                           04300000
TDMPID   DS    1CL0004   Parameter list name                            04350000
TDMPLEN  DS    1FL2      Parameter list length                          04400000
TDMPVERSION DS 1FL1      Parameter list version                         04450000
         DS    1CL0001   Reserved                                       04500000
TDMPSDATA DS   0CL0002   SDATA options                                  04525000
TDMPSDATA1 DS  0BL1      First byte of SDATA options                    04550000
TDMPDEFS EQU   X'80'     SDATA=DEFS specified                           04600000
TDMPALLNUC EQU X'40'     SDATA=ALLNUC                                   04650000
TDMPCSA  EQU   X'20'     SDATA=CSA specified                            04700000
TDMPGRSQ EQU   X'10'     SDATA=GRSQ specified                           04750000
TDMPLPA  EQU   X'08'     SDATA=LPA specified                            04800000
TDMPLSQA EQU   X'04'     SDATA=LSQA specified                           04850000
TDMPNUC  EQU   X'02'     SDATA=NUC specified                            04900000
TDMPRGN  EQU   X'01'     SDATA=RGN specified                            04950000
         ORG   TDMPSDATA1+X'00000001'                                   05000000
TDMPSDATA2 DS  0BL1      Second byte of SDATA options                   05050000
TDMPSQA  EQU   X'80'     SDATA=SQA specified                            05100000
TDMPSUM  EQU   X'40'     SDATA=SUM specified                            05150000
TDMPSWA  EQU   X'20'     SDATA=SWA specified                            05200000
TDMPTRT  EQU   X'10'     SDATA=TRT specified                            05250000
TDMPPSA  EQU   X'08'     SDATA=PSA specified                            05275000
         ORG   TDMPSDATA+X'00000002'                                    05297500
TDMPFLAGS1 DS  0BL1      First byte of flags                            05320000
TDMPASYNC EQU  X'80'     ASYNC=YES specified                            05340000
TDMPASYNCTARGET EQU X'02' Async dump target                             05346600
TDMPREMOTE EQU X'01'     Remote dump                                    05353200
         ORG   TDMPFLAGS1+X'00000001'                                   05360000
         DS    1CL0001   Reserved                                       05380000
TDMPDSPSTOKEN DS 1CL0008 Capture dataspace STOKEN                       05385000
TDMPDSPORIGIN DS 1AL4    Capture dataspace origin                       05390000
TDMPDSPRECORDS@ DS 1AL4  Capture dataspace records address              05395000
TDMPDCB@ DS    1AL4      DCB address                                    05400000
TDMPDCBALET DS 1FL4      DCB alet                                       05450000
TDMPDSN@ DS    1AL4      Data set name address                          05500000
TDMPDSNALET DS 1FL4      Data set name alet                             05550000
TDMPHDR@ DS    1AL4      Header address                                 05600000
TDMPHDRALET DS 1FL4      Header alet                                    05650000
TDMPIDX@ DS    1AL4      Dump index data set address                    05700000
TDMPIDXALET DS 1FL4      Dump index data set alet                       05750000
TDMPSYMREC@ DS 1AL4      Symptom record address                         05800000
TDMPSYMRECALET DS 1FL4   Symptom record alet                            05850000
TDMPINTOKEN@ DS 1AL4     Incident token address                         05900000
TDMPINTOKENALET DS 1FL4  Incident token alet                            05950000
TDMPREMOTE@ DS 1AL4      Remote area address                            06000000
TDMPREMOTEALET DS 1FL4   Remote area alet                               06050000
TDMPPROBDESC@ DS 1AL4    Problem description address                    06100000
TDMPPROBDESCALET DS 1FL4 Problem description alet                       06150000
TDMPLIST@ DS   1AL4      List address                                   06200000
TDMPLISTALET DS 1FL4     List alet                                      06250000
TDMPSUBPLST@ DS 1AL4     Subplst address                                06251700
TDMPSUBPLSTALET DS 1FL4  Subplst alet                                   06253400
TDMPDSPLIST@ DS 1AL4     Dsplist address                                06255100
TDMPDSPLISTALET DS 1FL4  Dsplist alet                                   06256800
TDMPECB@ DS    1AL4      Ecb address                                    06258500
TDMPECBALET DS 1FL4      Ecb alet                                       06260200
*                                                                       06261900
*   ****************************************************************    06263600
*    Transaction dump return codes                                      06265300
*   ******************************************************************  06267000
*                                                                       06268700
*                                                                       06270400
TDMPRC_OK EQU  0         A complete transaction dump was taken          06272100
TDMPRC_PARTIAL_DUMP EQU 4 A partial transaction dump was taken          06273800
TDMPRC_NO_DUMP EQU 8     No transaction dump was taken                  06275500
TDMPRC_INTERNAL_ERROR EQU 12 No transaction dump was was taken due to  *06277200
                         an internal error                              06278900
TDMPRC_BADAD00RETURNCODE EQU 16 IEAVTDMP received an unknown return    *06279400
                         code from IEAVAD00                             06279900
*                                                                       06280600
*   ******************************************************************  06282300
*    Transaction dump reason codes for return code = 0                  06284000
*   ******************************************************************  06285700
*                                                                       06287400
*                                                                       06289100
TDMPRSN_OK EQU 0         A complete transaction dump was taken          06290800
*                                                                       06290900
*   ******************************************************************  06291000
*    Transaction dump reason codes for return code = 4                  06291100
*   ******************************************************************  06291200
*                                                                       06291300
*                                                                       06291400
TDMPRSN_DATASETTOOSMALL EQU 1 The data set was too small to contain    *06291500
                         the complete dump                              06291600
TDMPRSN_CONTENTIONDETECTED EQU 2 Contention was detected                06291700
*                                                                       06291800
*   ******************************************************************  06291900
*    Transaction dump reason codes for return code = 8                  06292000
*   ******************************************************************  06292100
*                                                                       06292200
*                                                                       06292300
TDMPRSN_PARMADDRZERO EQU 1 The address of the transaction dump         *06292600
                         parameter list was zero                        06292900
TDMPRSN_CHNGDUMPNODUMP EQU 2 The dump was suppressed by CHNGDUMP        06293000
TDMPRSN_SUPPRESSEDBYSLIP EQU 3 The dump was suppressed by SLIP          06293100
TDMPRSN_BADPARMALET EQU 4 The transaction dump parmlist ALET was not   *06293200
                         valid                                          06293500
TDMPRSN_BADPARMADDR EQU 5 The transaction dump parmlist was not        *06293800
                         addressable                                    06294200
TDMPRSN_BADPARMVERSION EQU 6 The transaction dump version was not      *06294300
                         valid                                          06294400
TDMPRSN_BADPARMLENGTH EQU 7 The transaction dump length was not valid  *06294500
                         for the version specified                      06294600
TDMPRSN_NODCBORDSN EQU 8 No DCB or DSN was specified in the            *06294700
                         transaction dump parmlist                      06294800
TDMPRSN_DCBANDDSN EQU 9  Both DCB and DSN were specified in the        *06294900
                         transaction dump parmlist                      06295000
TDMPRSN_BADDCBALET EQU 10 The ALET specified for the DCB in the        *06295100
                         transaction dump parmlist was not valid        06295200
TDMPRSN_BADDCBADDR EQU 11 The DCB in the transaction dump parmlist was *06295300
                         not addressable                                06295400
TDMPRSN_BADDSNALET EQU 12 The ALET specified for the DSN in the        *06295500
                         transaction dump parmlist was not valid        06295600
TDMPRSN_BADDSNADDR EQU 13 The DSN in the transaction dump parmlist was *06295700
                         not addressable                                06295800
TDMPRSN_NOHEADER EQU 14  No header was specified in the transaction    *06295900
                         dump parmlist                                  06296000
TDMPRSN_BADHDRALET EQU 15 The ALET specified for the HDR in the        *06296100
                         transaction dump parmlist was not valid        06296200
TDMPRSN_BADHDRADDR EQU 16 The HDR in the transaction dump parmlist was *06296300
                         not addressable                                06296400
TDMPRSN_HDRTOOBIG EQU 17 The specified header was longer than 100      *06296500
                         characters                                     06296600
TDMPRSN_BADIDXALET EQU 18 The ALET specified for the IDX in the        *06296700
                         transaction dump parmlist was not valid        06296800
TDMPRSN_BADIDXADDR EQU 19 The IDX in the transaction dump parmlist was *06296900
                         not addressable                                06297000
TDMPRSN_IDXNOTVALID EQU 20 The specified dump index data set name was  *06297100
                         too long or not valid                          06297200
TDMPRSN_BADSYMRECALET EQU 21 The ALET specified for the SYMREC in the  *06297300
                         transaction dump parmlist was not valid        06297400
TDMPRSN_BADSYMRECADDR EQU 22 The SYMREC in the transaction dump        *06297500
                         parmlist was not addressable                   06297600
TDMPRSN_SYMRECNOTVALID EQU 23 The SYMREC in the transaction dump       *06297700
                         parmlist was not valid                         06297800
TDMPRSN_BADINTOKENALET EQU 24 The ALET specified for the INTOKEN in    *06297900
                         the transaction dump parmlist was not valid    06298000
TDMPRSN_BADINTOKENADDR EQU 25 The INTOKEN in the transaction dump      *06298100
                         parmlist was not addressable                   06298200
TDMPRSN_BADREMOTEALET EQU 26 The ALET specified for the REMOTE in the  *06298300
                         transaction dump parmlist was not valid        06298400
TDMPRSN_BADREMOTEADDR EQU 27 The REMOTE in the transaction dump        *06298500
                         parmlist was not addressable                   06298600
TDMPRSN_REMOTENOTVALID EQU 28 The remote area in the transaction dump  *06298700
                         parmlist was not valid                         06298800
TDMPRSN_BADLISTALET EQU 29 The ALET specified for the storage list in  *06298900
                         the transaction dump parmlist was not valid    06299000
TDMPRSN_BADLISTADDR EQU 30 The storage list in the transaction dump    *06299100
                         parmlist was not addressable                   06299200
TDMPRSN_BADLISTRANGE EQU 31 A range in the storage list was not valid   06299300
TDMPRSN_CALLERNOTAUTH EQU 32 The caller requested functions for which  *06299400
                         he was not authorized                          06299500
TDMPRSN_DSNAMENOTVALID EQU 33 The specified data set name was not      *06299600
                         valid                                          06299700
TDMPRSN_DSNAMETOOLONG EQU 34 The specified data set name was too long   06299800
TDMPRSN_DSNAMEBADSYMBOL EQU 35 The specified data set name contained   *06299900
                         bad symbols                                    06300000
TDMPRSN_DSPSERVFAILED EQU 36 Unable to create the transaction dump     *06300100
                         dataspace                                      06300200
TDMPRSN_ALESERVFAILED EQU 37 Unable to access the transaction dump     *06300300
                         dataspace                                      06300400
TDMPRSN_ALLOCATFAILED EQU 38 Unable to allocate the transaction dump   *06300500
                         data set                                       06300600
TDMPRSN_SUPPRESSEDBYDAE EQU 39 The dump was suppressed by DAE           06300700
TDMPRSN_IOERROR EQU 40   An I/O error occurred writing to the data set  06300800
*                                                                       06300900
*   ******************************************************************  06301000
*    Transaction dump reason codes for return code = 12                 06301100
*   ******************************************************************  06301900
*                                                                       06303100
*                                                                       06304300
TDMPRSN_NOSAVEAREA EQU 1 IEAVAD00 was unable to obtain storage for     *06305500
                         IEAVTDMP's save and dynamic areas              06306700
TDMPRSN_NORECOVERY EQU 2 IEAVTDMP was unable to establish a recovery   *06309700
                         environment                                    06312700
TDMPRSN_NOSDDATSTOR EQU 3 IEAVTDMP was unable to obtain storage for    *06313900
                         the SDDAT, SDDXATBL, and DSPD                  06315100
TDMPRSN_NOVSMTABLE EQU 4 IEAVTDMP was unable to obtain storage for the *06317500
                         VSM table                                      06319900
TDMPRSN_NODSTABLE EQU 5  IEAVTDMP was unable to obtain storage for the *06324700
                         SDUMP data space range table                   06329500
TDMPRSN_NOSMWKSTOR EQU 6 IEAVTDMP was unable to obtain storage for the *06330700
                         SMWK                                           06331900
TDMPRSN_NOESDSTOR EQU 7  IEAVTDMP was unable to obtain storage for the *06333100
                         ESD                                            06334300
TDMPRSN_NOUSERSTOR EQU 8 IEAVTDMP was unable to obtain user storage    *06337300
                         for the CKSTOKEN routine                       06340300
TDMPRSN_RECOVERYRECEIVEDCONTROL EQU 255 IEAVTDMP's recovery received   *06343900
                         control unexpectedly                           06345100
TDUMP_LEN EQU  *-TDUMP                                                  06346300
.L0002   ANOP                                                           06350000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 06400000
         AIF   ('&LIST' EQ 'YES').P4                                    06450000
.P3      ANOP                                                           06500000
         POP   PRINT                                                    06550000
.P4      ANOP                                                           06600000
.P_EXIT  ANOP                                                           06650000
         MEND                                                           06700000
**/ IHATDUMP_2:;                                                        06750000
* %IHATDUMP_INCLUDED = 'YES';                                           06800000
* %DCL ZCBPRINT CHAR EXT;                                               06850000
* %DEACTIVATE ZCBPRINT;                                                 06900000
* %DCL IHATDUMP_LIST CHAR EXT;                                          06950000
* %DEACTIVATE IHATDUMP_LIST;                                            07000000
* %IF IHATDUMP_LIST ~= 'NO' &                                           07050000
*    ZCBPRINT ~= 'NO' %THEN                                             07100000
*   %GOTO IHATDUMP_3;                                                   07150000
*   @LIST PUSH NOECHO;                                                  07200000
*   @LIST NOASSEMBLE NOECHO;                                            07250000
*   @LIST OFF C NOECHO;                                                 07300000
* %IHATDUMP_3:;                                                         07350000
*/* Start of PL/X Source                                             */ 07400000
* DCL TDUMPID CHAR(4) CONSTANT('TDMP'); /* TDUMP eye-catcher         */ 07450000
* Dcl TdmpMinLength      Constant(124); /* Minimum parmlist length   */ 07458700
* Dcl TdmpVer1Length     Constant(124); /* Version 1 parmlist length */ 07467400
* Dcl TdmpMaxLength      Constant(124); /* Maximum parmlist length   */ 07476100
*                                                                       07485000
* Dcl TdmpMinVersion     Constant(1); /* Minimum parmlist version level 07490000
*                                                                    */ 07495000
* Dcl TdmpMaxVersion     Constant(1); /* Maximum parmlist version level 07500000
*                                                                    */ 07550000
* DCL 1 TDUMP            Based,     /* ?IEATDUMP parameter list      */ 07600000
*       2 TdmpId         Char(4),   /* Parameter list name           */ 07650000
*       2 TdmpLen        Fixed(16), /* Parameter list length         */ 07700000
*       2 TdmpVersion    Fixed(8),  /* Parameter list version        */ 07750000
*       2 *              Char(1),   /* Reserved                      */ 07800000
*       2 TdmpSdata,                /* SDATA options                 */ 07842400
*         3 TdmpSdata1     Bit(8),  /* First byte of SDATA options   */ 07884800
*           4 TdmpDEFS     Bit(1),  /* SDATA=DEFS specified          */ 07927200
*           4 TdmpALLNUC   Bit(1),  /* SDATA=ALLNUC                  */ 07969600
*           4 TdmpCSA      Bit(1),  /* SDATA=CSA specified           */ 08012000
*           4 TdmpGRSQ     Bit(1),  /* SDATA=GRSQ specified          */ 08054400
*           4 TdmpLPA      Bit(1),  /* SDATA=LPA specified           */ 08096800
*           4 TdmpLSQA     Bit(1),  /* SDATA=LSQA specified          */ 08139200
*           4 TdmpNUC      Bit(1),  /* SDATA=NUC specified           */ 08181600
*           4 TdmpRGN      Bit(1),  /* SDATA=RGN specified           */ 08224000
*         3 TdmpSdata2     Bit(8),  /* Second byte of SDATA options  */ 08266400
*           4 TdmpSQA      Bit(1),  /* SDATA=SQA specified           */ 08308800
*           4 TdmpSUM      Bit(1),  /* SDATA=SUM specified           */ 08351200
*           4 TdmpSWA      Bit(1),  /* SDATA=SWA specified           */ 08393600
*           4 TdmpTRT      Bit(1),  /* SDATA=TRT specified           */ 08436000
*           4 TdmpPSA      Bit(1),  /* SDATA=PSA specified           */ 08478400
*           4 *            Bit(3),  /* Reserved                      */ 08520800
*       2 TdmpFlags1     Bit(8),    /* First byte of flags           */ 08564200
*         3 TdmpAsync    Bit(1),    /* ASYNC=YES specified           */ 08585600
*         3 *            Bit(5),    /* Reserved                      */ 08595000
*         3 TdmpAsyncTarget Bit(1), /* Async dump target         @01A*/ 08604400
*         3 TdmpRemote   Bit(1),    /* Remote dump                   */ 08614000
*       2 *              Char(1),   /* Reserved                      */ 08628400
*       2 TdmpDspStoken  Char(8),   /* Capture dataspace STOKEN      */ 08633800
*       2 TdmpDspOrigin  Ptr(31),   /* Capture dataspace origin      */ 08639200
*       2 TdmpDspRecords@ Ptr(31),  /* Capture dataspace records        08642800
*                                      address                   @P1C*/ 08646400
*       2 TdmpDcb@       Ptr(31),   /* DCB address                   */ 08650000
*       2 TdmpDcbAlet    Fixed(32), /* DCB alet                      */ 08700000
*       2 TdmpDsn@       Ptr(31),   /* Data set name address         */ 08750000
*       2 TdmpDsnAlet    Fixed(32), /* Data set name alet            */ 08800000
*       2 TdmpHdr@       Ptr(31),   /* Header address                */ 08850000
*       2 TdmpHdrAlet    Fixed(32), /* Header alet                   */ 08900000
*       2 TdmpIdx@       Ptr(31),   /* Dump index data set address   */ 08950000
*       2 TdmpIdxAlet    Fixed(32), /* Dump index data set alet      */ 09000000
*       2 TdmpSymrec@    Ptr(31),   /* Symptom record address        */ 09050000
*       2 TdmpSymrecAlet Fixed(32), /* Symptom record alet           */ 09100000
*       2 TdmpIntoken@   Ptr(31),   /* Incident token address        */ 09150000
*       2 TdmpIntokenAlet Fixed(32), /* Incident token alet          */ 09200000
*       2 TdmpRemote@    Ptr(31),   /* Remote area address           */ 09250000
*       2 TdmpRemoteAlet Fixed(32), /* Remote area alet              */ 09300000
*       2 TdmpProbdesc@  Ptr(31),   /* Problem description address   */ 09350000
*       2 TdmpProbdescAlet Fixed(32), /* Problem description alet    */ 09400000
*       2 TdmpList@      Ptr(31),   /* List address                  */ 09450000
*       2 TdmpListAlet   Fixed(32), /* List alet                     */ 09500000
*       2 TdmpSubplst@   Ptr(31),   /* Subplst address               */ 09507100
*       2 TdmpSubplstAlet Fixed(32), /* Subplst alet                 */ 09514200
*       2 TdmpDsplist@   Ptr(31),   /* Dsplist address               */ 09521300
*       2 TdmpDsplistAlet Fixed(32), /* Dsplist alet                 */ 09528400
*       2 TdmpEcb@       Ptr(31),   /* Ecb address                   */ 09535500
*       2 TdmpEcbAlet    Fixed(32), /* Ecb alet                      */ 09542600
*       2 *              Char(0);   /* End of parameter list         */ 09550000
*                                                                       09600000
* Dcl   TdmpDspRecords Fixed(32) Based(TdmpDspRecords@); /* Capture     09616600
*                                      dataspace records         @P1A*/ 09633200
* /******************************************************************/  09650000
* /* Transaction dump return codes                                   */ 09700000
* /*******************************************************************/ 09750000
*                                                                       09800000
* DCL TdmpRC_OK           Constant(0), /* A complete transaction dump   09850000
*                                      was taken                     */ 09900000
*     TdmpRC_Partial_Dump Constant(4), /* A partial transaction dump    09950000
*                                      was taken                     */ 10000000
*     TdmpRC_No_Dump      Constant(8), ! No transaction dump was taken  10020000
*     TdmpRC_Internal_Error Constant(12), /* No transaction dump was    10040000
*                                      was taken due to an internal     10060000
*                                      error                         */ 10080000
*     TdmpRC_BadAD00ReturnCode Constant(16); /* IEAVTDMP received an    10085000
*                                      unknown return code from         10090000
*                                      IEAVAD00                      */ 10095000
*                                                                       10100000
* /*******************************************************************/ 10150000
* /* Transaction dump reason codes for return code = 0               */ 10200000
* /*******************************************************************/ 10250000
*                                                                       10262500
* Dcl TdmpRsn_OK          Constant(0); /* A complete transaction dump   10275000
*                                      was taken                     */ 10287500
*                                                                       10300000
* /*******************************************************************/ 10313300
* /* Transaction dump reason codes for return code = 4               */ 10326600
* /*******************************************************************/ 10339900
*                                                                       10353200
* Dcl TdmpRsn_DatasetTooSmall Constant(1), /* The data set was too      10364200
*                                      small to contain the complete    10375200
*                                      dump                          */ 10386200
*     TdmpRsn_ContentionDetected Constant(2); /* Contention was         10397200
*                                      detected                      */ 10408200
*                                                                       10419700
* /*******************************************************************/ 10433000
* /* Transaction dump reason codes for return code = 8               */ 10446300
* /*******************************************************************/ 10459600
*                                                                       10472900
* Dcl TdmpRsn_ParmAddrZero     Constant(1), /* The address of the       10474400
*                                      transaction dump parameter list  10475900
*                                      was zero                      */ 10477400
*     TdmpRsn_ChngdumpNodump   Constant(2), /* The dump was suppressed  10477900
*                                      by CHNGDUMP                   */ 10478400
*     TdmpRsn_SuppressedBySlip Constant(3), /* The dump was suppressed  10478900
*                                      by SLIP                       */ 10479400
*     TdmpRsn_BadParmAlet      Constant(4), /* The transaction dump     10479900
*                                      parmlist ALET was not valid   */ 10480400
*     TdmpRsn_BadParmAddr      Constant(5), /* The transaction dump     10481900
*                                      parmlist was not addressable  */ 10483400
*     TdmpRsn_BadParmVersion   Constant(6), /* The transaction dump     10484900
*                                      version was not valid         */ 10486400
*     TdmpRsn_BadParmLength    Constant(7), /* The transaction dump     10488800
*                                      length was not valid for the     10491200
*                                      version specified             */ 10493600
*     TdmpRsn_NoDcbOrDsn       Constant(8), /* No DCB or DSN was        10496000
*                                      specified in the transaction     10498400
*                                      dump parmlist                 */ 10499900
*     TdmpRsn_DcbAndDsn        Constant(9), /* Both DCB and DSN were    10500800
*                                      specified in the transaction     10501700
*                                      dump parmlist                 */ 10502600
*     TdmpRsn_BadDcbAlet       Constant(10), /* The ALET specified for  10503500
*                                      the DCB in the transaction dump  10504400
*                                      parmlist was not valid        */ 10505400
*     TdmpRsn_BadDcbAddr       Constant(11), /* The DCB in the          10506600
*                                      transaction dump parmlist was    10507800
*                                      not addressable               */ 10507900
*     TdmpRsn_BadDsnAlet       Constant(12), /* The ALET specified for  10508000
*                                      the DSN in the transaction dump  10508100
*                                      parmlist was not valid        */ 10508200
*     TdmpRsn_BadDsnAddr       Constant(13), /* The DSN in the          10508300
*                                      transaction dump parmlist was    10508400
*                                      not addressable               */ 10508500
*     TdmpRsn_NoHeader         Constant(14), /* No header was specified 10508600
*                                      in the transaction dump parmlist 10508700
*                                                                    */ 10508800
*     TdmpRsn_BadHdrAlet       Constant(15), /* The ALET specified for  10508900
*                                      the HDR in the transaction dump  10509000
*                                      parmlist was not valid        */ 10509100
*     TdmpRsn_BadHdrAddr       Constant(16), /* The HDR in the          10509200
*                                      transaction dump parmlist was    10509300
*                                      not addressable               */ 10509400
*     TdmpRsn_HdrTooBig        Constant(17), /* The specified header    10509500
*                                      was longer than 100 characters   10509600
*                                                                    */ 10509700
*     TdmpRsn_BadIdxAlet       Constant(18), /* The ALET specified for  10509800
*                                      the IDX in the transaction dump  10509900
*                                      parmlist was not valid        */ 10510000
*     TdmpRsn_BadIdxAddr       Constant(19), /* The IDX in the          10510100
*                                      transaction dump parmlist was    10510200
*                                      not addressable               */ 10510300
*     TdmpRsn_IdxNotValid      Constant(20), /* The specified dump      10510400
*                                      index data set name was too long 10510500
*                                      or not valid                  */ 10510600
*     TdmpRsn_BadSymrecAlet    Constant(21), /* The ALET specified for  10510700
*                                      the SYMREC in the transaction    10510800
*                                      dump parmlist was not valid   */ 10510900
*     TdmpRsn_BadSymrecAddr    Constant(22), /* The SYMREC in the       10511000
*                                      transaction dump parmlist was    10511100
*                                      not addressable               */ 10511200
*     TdmpRsn_SymrecNotValid   Constant(23), /* The SYMREC in the       10511300
*                                      transaction dump parmlist was    10511400
*                                      not valid                     */ 10511500
*     TdmpRsn_BadIntokenAlet   Constant(24), /* The ALET specified for  10511600
*                                      the INTOKEN in the transaction   10511700
*                                      dump parmlist was not valid   */ 10511800
*     TdmpRsn_BadIntokenAddr   Constant(25), /* The INTOKEN in the      10511900
*                                      transaction dump parmlist was    10512000
*                                      not addressable               */ 10512100
*     TdmpRsn_BadRemoteAlet    Constant(26), /* The ALET specified for  10512200
*                                      the REMOTE in the transaction    10512300
*                                      dump parmlist was not valid   */ 10512400
*     TdmpRsn_BadRemoteAddr    Constant(27), /* The REMOTE in the       10512500
*                                      transaction dump parmlist was    10512600
*                                      not addressable               */ 10512700
*     TdmpRsn_RemoteNotValid   Constant(28), /* The remote area in the  10512800
*                                      transaction dump parmlist was    10512900
*                                      not valid                     */ 10513000
*     TdmpRsn_BadListAlet      Constant(29), /* The ALET specified for  10513100
*                                      the storage list in the          10513200
*                                      transaction dump parmlist was    10513300
*                                      not valid                     */ 10513400
*     TdmpRsn_BadListAddr      Constant(30), /* The storage list in the 10513500
*                                      transaction dump parmlist was    10513600
*                                      not addressable               */ 10513700
*     TdmpRsn_BadListRange     Constant(31), /* A range in the storage  10513800
*                                      list was not valid            */ 10513900
*     TdmpRsn_CallerNotAuth    Constant(32), /* The caller requested    10514000
*                                      functions for which he was not   10514100
*                                      authorized                    */ 10514200
*     TdmpRsn_DsnameNotValid   Constant(33), /* The specified data set  10514300
*                                      name was not valid            */ 10514400
*     TdmpRsn_DsnameTooLong    Constant(34), /* The specified data set  10514500
*                                      name was too long             */ 10514600
*     TdmpRsn_DsnameBadSymbol  Constant(35), /* The specified data set  10514700
*                                      name contained bad symbols    */ 10514800
*     TdmpRsn_DspservFailed    Constant(36), /* Unable to create the    10514900
*                                      transaction dump dataspace    */ 10515000
*     TdmpRsn_AleservFailed    Constant(37), /* Unable to access the    10515100
*                                      transaction dump dataspace    */ 10515200
*     TdmpRsn_AllocatFailed    Constant(38), /* Unable to allocate the  10515300
*                                      transaction dump data set     */ 10515400
*     TdmpRsn_SuppressedByDae  Constant(39), /* The dump was suppressed 10515500
*                                      by DAE                        */ 10515600
*     TdmpRsn_IOError          Constant(40); /* An I/O error occurred   10515700
*                                      writing to the data set       */ 10515800
*                                                                       10515900
* /*******************************************************************/ 10516200
* /* Transaction dump reason codes for return code = 12              */ 10518900
* /*******************************************************************/ 10521600
*                                                                       10524300
* Dcl TdmpRsn_NoSaveArea  Constant(1), /* IEAVAD00 was unable to        10527000
*                                      obtain storage for IEAVTDMP's    10529700
*                                      save and dynamic areas        */ 10532400
*     TdmpRsn_NoRecovery  Constant(2), /* IEAVTDMP was unable to        10540500
*                                      establish a recovery environment 10548600
*                                                                    */ 10551300
*     TdmpRsn_NoSddatStor Constant(3), /* IEAVTDMP was unable to obtain 10554000
*                                      storage for the SDDAT, SDDXATBL, 10556700
*                                      and DSPD                      */ 10559400
*     TdmpRsn_NoVsmTable  Constant(4), /* IEAVTDMP was unable to obtain 10564800
*                                      storage for the VSM table     */ 10570200
*     TdmpRsn_NoDsTable   Constant(5), /* IEAVTDMP was unable to        10583700
*                                      obtain storage for the SDUMP     10597200
*                                      data space range table        */ 10599900
*     TdmpRsn_NoSmwkStor  Constant(6), /* IEAVTDMP was unable to        10602600
*                                      obtain storage for the SMWK   */ 10605300
*     TdmpRsn_NoEsdStor   Constant(7), /* IEAVTDMP was unable to        10608000
*                                      obtain storage for the ESD    */ 10610700
*     TdmpRsn_NoUserStor  Constant(8), /* IEAVTDMP was unable to        10618800
*                                      obtain user storage for the      10626900
*                                      CKSTOKEN routine              */ 10629600
*     TdmpRsn_RecoveryReceivedControl Constant(255); /* IEAVTDMP's      10640400
*                                      recovery received control        10643100
*                                      unexpectedly                  */ 10645800
*/* End of PL/X Source                                               */ 10650000
* %IF IHATDUMP_LIST ~= 'NO' &                                           10700000
*    ZCBPRINT ~= 'NO' %THEN                                             10750000
*   %GOTO IHATDUMP_4;                                                   10800000
*   @LIST POP NOECHO;                                                   10850000
* %IHATDUMP_4:;                                                         10900000
* %END;                                                                 10950000
