*        %GOTO PLSVCB1;                                              /* 00050000
         MACRO                                                          00100000
         IHAVCB &DSECT=YES                                           */ 00150000
* %PLSVCB1:;                                                            00200000
*/********************************************************************/ 00250000
*/* * START OF SPECIFICATIONS *                                      */ 00275000
*/*                    VCB  -  VIO CONTROL BLOCK                     */ 00300000
*/*                                04/06/93                          */ 00350000
*/*                                                                  */ 00400000
*/* THE VCB IS A PARAMETER LIST USED BY THE VIRTUAL BLOCK PROCESSOR  */ 00450000
*/* WHEN CALLING THE RSM VIO ASSIGN/MOVEOUT PROCESSOR. EACH VCB      */ 00500000
*/* DEFINES WHAT FUNCTION IS TO BE PERFORMED BY RSM FOR A SINGLE     */ 00550000
*/* VIRTUAL PAGE.                                                    */ 00600000
*/********************************************************************/ 00650000
* %GOTO PLSVCB2;                                                     /* 00700000
  AGO .BALVCB                                                        */ 00750000
*/*                                                                  */ 01250500
*/*01* ACRONYM: VCB                                                  */ 01250600
*/*01*  PROPRIETARY STATEMENT:                                       */ 01250900
*/***PROPRIETARY STATEMENT********************************************/ 01251000
*/*                                                                  */ 01251100
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01251200
*/*      5647-A01  (C) COPYRIGHT IBM CORP. 1983, 2000                */ 01251300
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01251400
*/*                                                                  */ 01251600
*/* STATUS = HBB7703                                                 */ 01251700
*/*                                                                  */ 01251800
*/****END OF PROPRIETARY STATEMENT************************************/ 01251900
*/*                                                                  */ 01252000
*/*01* DESCRIPTIVE NAME:  VIO Control Block                          */ 01252100
*/*01* MACRO NAME:  IHAVCB                                           */ 01252400
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 01252600
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 01252800
*/*01* DSECT NAME:  VCB                                              */ 01253000
*/*01* COMPONENT:  Real Storage Manager (SC1CR)                      */ 01253600
*/*01* EYE-CATCHER: None                                             */ 01254200
*/*01* STORAGE ATTRIBUTES:                                           */ 01254800
*/*02*   VIRTUAL STORAGE: yes                                        */ 01255400
*/*02*   SUBPOOL:         USER SPECIFIED.                            */ 01256000
*/*02*   KEY:             0.                                         */ 01256600
*/*02*   RESIDENCY: below 16 megabytes in real storage               */ 01257200
*/*01* SIZE: 28 bytes                                                */ 01257800
*/*01* CREATED BY:  User                                             */ 01258400
*/*01* POINTED TO BY:  Register 1 (input to VIO processing),         */ 01259000
*/*   VCBLINK                                                        */ 01259600
*/*01* SERIALIZATION:  Local lock                                    */ 01260200
*/*01* FUNCTION:  Describes a VIO function to be performed on a      */ 01260800
*/*    VIO window page.                                              */ 01261400
*/*01* METHOD OF ACCESS:                                             */ 01262000
*/*                                                                  */ 01262600
*/*     NOTE= FOR BAL- A CSECT WILL BE GENERATED UNLESS THE DSECT    */ 01263200
*/*                    KEYWORD IS SPECIFIED WITH OTHER THAN YES.     */ 01263800
*/*                                                                  */ 01264400
*/*           FOR PLS- A STRUCTURE BASED ON VCBPTR IS ALWAYS         */ 01265000
*/*                    GENERATED.                                    */ 01265600
*/*                                                                  */ 01266600
*/*     CHANGE ACTIVITY=                                             */ 01274900
*/*        $L1=PROD310,HBB3310,860219,PD48: Base Support             */ 01283200
*/*                                                                  */ 01291500
*/*        $01=OY08836,JBB3310,871222,PDYB:VIO TO EXPANDED           */ 01293600
*/*        $02=OY19503,JBB3311,890315,PDBV: Include a new flag       */ 01294100
*/*                                         VCBVF to indicate        */ 01294600
*/*                                         reqeustor is vfetch      */ 01295100
*/*        $L2=PR440016,HBB5510,930520,PD00A8: SHOWHDR UPDATES       */ 01295400
*/*        $L3=64BIT   ,HBB7703,980218,PD00LX: Estor Elimination     */ 01295500
*/*        $P1=PXD0443 ,HBB7703,980928,PD00SE: Copyright Errors      */ 01295600
*/*                                                                  */ 01295700
*/* END OF SPECIFICATIONS                                            */ 01345700
*/********************************************************************/ 01600000
*/* A-000000-999999                                          @G860PYB*/ 01650000
*/*                                                                     01700000
.BALVCB  ANOP                                                           01750000
         AIF   ('&DSECT' EQ 'YES').VCB001 DOES USER WANT DSECT          01800000
VCB      DS    0F                                                       01850000
         AGO   .VCB002         BRANCH AROUND DSECT                      01900000
.VCB001  ANOP                  GEN THE DSECT                            01950000
VCB      DSECT , VCBPTR                                                 02000000
.VCB002  ANOP                                                           02050000
VCBLINK  DS    AL4 -           VIRTUAL ADDR. OF NEXT VCB IN A           02100000
*                              CHAINED REQUEST                          02150000
VCBVSA   DS    AL4 -           VIRTUAL ADDR. OF A PAGE IN THE VIO       02200000
*                              WINDOW. THIS PAGE IS THE SOURCE PAGE     02250000
*                              FOR A MOVE-OUT OR THE TARGET ADDRESS     02300000
*                              FOR AN ASSIGN                            02350000
VCBLPID  DS    CL8 -           THE LPID OF THE VIO DATA SET PAGE        02400000
VCBRUARG DS    A               VIO REUSE ARGUMENT.  RSM RETURNS THIS    02436600
*                              ADDRESS TO VBP ON A MOVEOUT IF VBP       02473200
*                              SUPPLIED A RECLAIM IDENTIFIER (DSPID).   02509800
*                              VBP CAN THEM PASS THE ADDRESS BACK TO    02546400
*                              RSM ON A SUBSEQUENT ASSIGN FOR THE SAME  02583000
*                              PAGE TO ATTEMPT RECLAIM (REUSE).    @01A 02619600
         ORG   VCBRUARG                                            @01A 02656200
VCBPFTE  DS    A               VIRTUAL ADDRESS OF THE PFTE FOR THE REAL 02692800
*                              STORAGE FRAME LAST OCCUPIED BY THE VIO   02729400
*                              WINDOW PAGE                         @01C 02766000
         ORG   VCBRUARG                                            @01A 02802600
VCBESTE  DS    A               VIRTUAL ADDRESS OF THE ESTE FOR THE      02839200
*                              EXPANDED STORAGE FRAME LAST OCCUPIED BY  02875800
*                              THE VIO WINDOW PAGE. Reserved- No longer 02900500
*                              used in ESAME environment           @L3C 02925200
VCBDSPID DS    XL4             DATA SET PAGE RECLAIM (REUSE) IDENTIFIER 02950000
VCBOPFLG DS    BL1 -           OPERATION FLAGS                          03000000
VCBMVOUT EQU   X'80' -         DENOTES A MOVE-OUT IS TO BE PERFORMED    03050000
VCBVF    EQU   X'40' -         REQUESTOR IS VIRTUAL FETCH        @02A   03100000
VCBASIGN EQU   X'20' -         DENOTES AN ASSIGN IS TO BE PERFORMED     03150000
VCBRSV5  EQU   X'10' -         RESERVED                                 03200000
VCBNDISC EQU   X'08' -         REQUESTS THAT THE VIO PAGE SHOULD NOT    03250000
*                              BE DISCONNECTED FROM ITS WINDOW          03300000
*                              LOCATION AFTER MOVEOUT OPERATION IS      03350000
*                              COMPLETE.                                03400000
VCBNOLD  EQU   X'04' -         IF 1, A PAGE LOAD WILL NOT BE DONE       03450000
*                              UPON COMPLETION OF THE ASSIGN FUNCTION.  03500000
*                              VALID ONLY IF VCBASIGN=1.                03550000
VCBLOAD  EQU   X'04' -         OLD NAME FOR COMPATIBILITY               03600000
VCBRSV2  EQU   X'02' -         RESERVED                                 03650000
VCBRSV3  EQU   X'01' -         RESERVED                                 03700000
VCBCPFLG DS    BL1 -           COMPLETION FLAGS                         03750000
VCBNOVAC EQU   X'80' -         IF VCBASIGN=1 AND THE PGTE FOR VCBVSA    03800000
*                              IS NOT ZERO, AN ERROR HAS OCCURRED. A    03850000
*                              DISCONNECT MOVEOUT SHOULD HAVE BEEN      03900000
*                              REQUESTED FOR THIS VSA BEFORE ISSUING    03950000
*                              THE ASSIGN REQUEST.                      04000000
VCBINVSA EQU   X'40' -         VCBVSA DOES NOT CONTAIN A VALID VSA      04050000
VCBELPID EQU   X'20' -         ON A MOVEOUT REQUEST, EITHER THE LPID    04100000
*                              SUPPLIED IN THE VCB DOES NOT MATCH THE   04150000
*                              LPID IN THE XPTE, OR ASM COULD NOT       04200000
*                              SUCCESSFULLY START A PAGEOUT OR          04250000
*                              TRANSFER-PAGE OPERATION FOR THIS PAGE.   04300000
VCBNOAUX EQU   X'10' -         FOR A MOVE-OUT, NO AUX. STORAGE          04350000
*                              EXISTED OR WAS CREATED AND NO REAL       04400000
*                              STORAGE EXISTED FROM WHICH TO PAGE-OUT.  04450000
VCBEFIX  EQU   X'08' -         MOVE-OUT REQUESTED FOR A FIXED OR        04500000
*                              BAD PAGE.                                04550000
VCBRSV4  DS    XL2             RESERVED                                 04600000
VCBEND   DS    0C -            END OF VIO CONTROL BLOCK                 04650000
VCBLEN   EQU   VCBEND-VCB -    LENGTH OF VIO CONTROL BLOCK              04700000
         MEND  */                                                       04750000
* %PLSVCB2:;                                                            04800000
*      %IF VCB9999~=','             /* IS BLOCK PART OF STRUCTURE    */ 04850000
*          %THEN %VCB9999=';';      /* NO, END BLOCK NORMALLY        */ 04900000
*      %IF VCBLEVEL~=''             /* INITIAL LEVEL NUMBER GIVEN    */ 04950000
*          %THEN %GOTO PLSVCB3;     /* YES THEN DO NOT GEN 1 LEVEL   */ 05000000
*DECLARE                                                                05050000
*  1 VCB BASED(VCBPTR)                                                  05100000
*      %GOTO PLSVCB4;               /*SKIP USER-GIVEN LEVEL          */ 05150000
*%PLSVCB3: VCBDUM=VCBLEVEL||' VCB';                                     05200000
*  VCBDUM                                                               05250000
*%PLSVCB4:;                                                             05300000
*    BDY (WORD),                                                        05350000
*    4 VCBLINK PTR(31),             /* VIRTUAL ADDR OF NEXT VCB IN A    05400000
*                                      CHAINED REQUEST               */ 05450000
*    4 VCBVSA PTR(31),              /* VIRTUAL ADDR. OF A PAGE IN       05500000
*                                      THE VIO WINDOW. THE PAGE IS      05550000
*                                      THE SOURCE PAGE FOR A MOVE-OUT   05600000
*                                      OR THE TARGET PAGE FOR AN        05650000
*                                      ASSIGN.                       */ 05700000
*    4 VCBLPID CHAR(8),             /* THE LPID OF THE VIO DATA SET     05750000
*                                      PAGE.                         */ 05800000
*    4 VCBRUARG PTR(31),            /* VIO REUSE ARGUMENT. RSM RETURNS  05838200
*                                      THIS ADDRESS TO VBP ON A MOVEOUT 05876400
*                                      IF VBP SUPPLIED A RECLAIM        05914600
*                                      IDENTIFIER (DSPID). VBP CAN THEM 05952800
*                                      PASS THE ADDRESS BACK TO RSM ON  05991000
*                                      A SUBSEQUENT ASSIGN FOR THE SAME 06029200
*                                      PAGE TO ATTEMPT RECLAIM (REUSE). 06067400
*                                                                @01A*/ 06105600
*      6 VCBPFTE PTR(31),           /* VIRTUAL ADDRESS OF THE PFTE FOR  06143800
*                                      THE REAL STORAGE FRAME LAST      06182000
*                                      OCCUPIED BY THE VIO WINDOW PAGE  06220200
*                                                                @01C*/ 06258400
*        8 VCBESTE PTR(31),         /* VIRTUAL ADDRESS OF THE ESTE FOR  06296600
*                                      THE EXPANDED STORAGE FRAME LAST  06334800
*                                      OCCUPIED BY THE VIO WINDOW PAGE  06373000
*                                                                @01A*/ 06411200
*    4 VCBDSPID FIXED(32),          /* DATA SET PAGE RECLAIM (REUSE)    06450000
*                                      IDENTIFIER.                   */ 06500000
*    4 VCBOPFLG BIT(8),             /* OPERATION FLAGS               */ 06550000
*      8 VCBMVOUT BIT(1),           /* WHEN 1, A MOVE-OUT IS            06600000
*                                      REQUESTED.                    */ 06650000
*      8 VCBVF   BIT(1),            /* REQUESTOR IS VIRTUAL FETCH       06683300
*                                                                @02A*/ 06716600
*      8 VCBASIGN BIT(1),           /* WHEN 1, AN ASSIGN IS REQUESTED*/ 06750000
*      8 VCBRSV5  BIT(1),           /* RESERVED                      */ 06800000
*      8 VCBNDISC BIT(1),           /* REQUESTS THAT THE VIO PAGE       06850000
*                                      SHOULD NOT BE DISCONNECTED       06900000
*                                      FROM ITS WINDOW LOCATION AFTER   06950000
*                                      MOVEOUT OPERATION IS COMPLETE.*/ 07000000
*      8 VCBNOLD BIT(1),            /* IF 1, A PAGE LOAD WILL NOT BE    07050000
*                                      DONE UPON COMPLETION OF THE      07100000
*                                      ASSIGN FUNCTION. VALID ONLY IF   07150000
*                                      VCBASIGN=1.                   */ 07200000
*         12 VCBLOAD BIT(1),        /* OLD NAME FOR COMPATIBILITY    */ 07250000
*      8 VCBRSV2 BIT(1),            /* RESERVED                      */ 07300000
*      8 VCBRSV3 BIT(1),            /* RESERVED                      */ 07350000
*    4 VCBCPFLG BIT(8),             /* COMPLETION FLAGS              */ 07400000
*      8 VCBNOVAC BIT(1),           /* IF VCBASIGN=1 AND THE PGTE FOR   07450000
*                                      VCBVSA IS NOT ZERO, AN ERROR     07500000
*                                      HAS OCCURRED. DISCONNECT         07550000
*                                      MOVEOUT SHOULD HAVE BEEN         07600000
*                                      REQUESTED FOR THE VSA BEFORE     07650000
*                                      ISSUING THE ASSIGN REQUEST.   */ 07700000
*      8 VCBINVSA BIT(1),           /* VCBVSA DOES NOT CONTAIN A        07750000
*                                      VALID VSA.                    */ 07800000
*      8 VCBELPID BIT(1),           /* ON A MOVEOUT REQUEST, EITHER     07850000
*                                      THE LPID SUPPLIED IN THE VCB     07900000
*                                      DOES NOT MATCH THE LPID IN THE   07950000
*                                      XPTE, OR ASM COULD NOT           08000000
*                                      SUCCESSFULLY START A PAGEOUT     08050000
*                                      OR TRANSFER-PAGE OPERATION       08100000
*                                      FOR THIS PAGE.                */ 08150000
*      8 VCBNOAUX BIT(1),           /* FOR A MOVE-OUT, NO AUX.          08200000
*                                      STORAGE EXISTED OR WAS CREATED   08250000
*                                      AND NO REAL STORAGE EXISTED      08300000
*                                      FROM WHICH TO PAGE-OUT.       */ 08350000
*      8 VCBEFIX BIT(1),            /* MOVE-OUT REQUESTED FOR A FIXED   08400000
*                                      OR BAD PAGE.                  */ 08450000
*      8 * BIT(1),                  /* RESERVED                      */ 08500000
*      8 * BIT(1),                  /* RESERVED                      */ 08550000
*      8 * BIT(1),                  /* RESERVED                      */ 08600000
*    4 VCBRSV4 FIXED(16),           /* RESERVED                      */ 08650000
*    4 VCBEND  CHAR(0) VCB9999      /* END OF VCB                    */ 08700000
*     %VCBLEN='LENGTH(VCB)';        /* LENGTH OF VCB                 */ 08750000
