*%GOTO WWBPRO; /*                                                       00050000
         MACRO                                                          00100000
         IHAWWB                                                         00150000
**/%WWBPRO:;                                                            00200000
*/**Start of Specifications*******************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME:  IHAWWB                                           */ 00350000
*/*                                                                  */ 00400000
*/*01* DSECT NAME:  WWB                                              */ 00450000
*/*                                                                  */ 00500000
*/*01* DESCRIPTIVE NAME: Write To Operator Wait Block Mapping        */ 00550000
*/*                                                                  */ 00600000
*/*01* PROPRIETARY STATEMENT=                                        */ 00650000
*/***PROPRIETARY_STATEMENT********************************************/ 00700000
*/*                                                                  */ 00750000
*/*                                                                  */ 00800000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00850000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00900000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1986, 1993                      */ 00950000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 01000000
*/*                                                                  */ 01050000
*/* STATUS= HBB5510                                                  */ 01100000
*/*                                                                  */ 01150000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01200000
*/*                                                                  */ 01250000
*/*01* EXTERNAL CLASSIFICATION:DMTI                                  */ 01300000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01350000
*/*                                                                  */ 01400000
*/*01* COMPONENT:  Communications Task (SC1CK)                       */ 01450000
*/*                                                                  */ 01500000
*/*01* EYE CATCHER: 'WWB '                                           */ 01550000
*/*02*   OFFSET:       24                                            */ 01600000
*/*02*   LENGTH:        4 Bytes                                      */ 01650000
*/*                                                                  */ 01700000
*/*01* STORAGE ATTRIBUTES:                                           */ 01750000
*/*02*   SUBPOOL:     231                                            */ 01800000
*/*02*   KEY:           0                                            */ 01850000
*/*                                                                  */ 01900000
*/*01* SIZE:           32 Bytes                                      */ 01950000
*/*                                                                  */ 02000000
*/*01* CREATED BY:     IEAVVWTO, IEAVMWTO                            */ 02050000
*/*                                                                  */ 02100000
*/*01* POINTED TO BY:  UCMWECBH (for WQE WWBs), UCMOECBH (for ORE    */ 02150000
*/*                              WWBs)                               */ 02200000
*/*                                                                  */ 02250000
*/*01* SERIALIZATION:  None                                          */ 02300000
*/*                                                                  */ 02350000
*/*01* FUNCTION:       Used to wait for a WQE or ORE to be freed.    */ 02400000
*/*    If a WQE is needed, a WWB is placed on the doubly linked      */ 02450000
*/*    chain pointed at by UCMWECBH and UCMWECBT. The program needing*/ 02500000
*/*    the WQE then waits on the ECB part of the WWB.  When a WQE is */ 02550000
*/*    freed and the WWB is at the top of the chain, the ECB is      */ 02600000
*/*    posted.  If an ORE is needed then a WWB is placed on the      */ 02650000
*/*    chain pointed at by UCMOECBH and UCMOECBT.                    */ 02700000
*/*                                                                  */ 02750000
*/*01* METHOD OF ACCESS:                                             */ 02800000
*/*         PL/X:      DCL WWBPTR                                    */ 02850000
*/*                    %INCLUDE SYSLIB(IHAWWB)                       */ 02900000
*/*         ASM        IHAWWB                                        */ 02950000
*/*01* CHANGE ACTIVITY:                                              */ 03000000
*/* $MAC(IHAWWB) COMP(SC1CK): COMM TASK MACRO                    @PPA*/ 03050000
*/* $PP=PIG2355, HBB5510, 930909, PDSC: Moved from IHACTM            */ 03100000
*/*End of Specifications**********************************************/ 03150000
*%GOTO WWBPLX; % /*                                                     03200000
WWB      DSECT                                                          03250000
WWBFWDPT DS    F         FORWARD CHAIN POINTER                          03300000
WWBBCKPT DS    F         BACKWARD CHAIN POINTER                         03350000
WWBASCB  DS    F         ADDRESS OF USERS ASCB                          03400000
WWBTCBAD DS    F         ADDRESS OF USERS TCB                           03450000
WWBFLAGS DS    C         FLAGS BYTE                                     03500000
WWBPOSTD EQU   X'80'     IF ON THEN ECB HAS BEEN POSTED                 03550000
WWBUSE0  EQU   X'40'     This WWB represents an *authorized* caller    X03587500
                         and reply ID 0 can be used to satisfy this    X03625000
                         request (for WWBs on UCMOECBH queue only) @PPA 03662500
WWBVRSN  DS    C         VERSION ID                                     03700000
WWBS220  EQU   1         LEVEL OS/VS2 JBB2220                           03750000
WWBVERN  EQU   WWBS220   THE CURRENT VERSION LEVEL                      03800000
WWBRESRV DS    CL2       RESERVED                                       03850000
WWBECB   DS    F         ECB PART OF WTOECB                             03900000
WWBACRN  DS    CL4       ACRONYM 'WWB '                                 03950000
         DS    CL4       RESERVED                                       04000000
WWBLENG  EQU   *         END OF WWB                                     04050000
WWBSIZE  EQU   WWBLENG-WWB                                              04100000
WWBECBOF EQU   WWBECB-WWB ECB OFFSET                                    04150000
         MEXIT                                                          04200000
         MEND                                                           04250000
*                                  */;                                  04300000
*%WWBPLX:;                                                              04350000
*DCL  1 WWB     BASED(WWBPTR),                                          04400000
*       2 WWBFWDPT PTR(31),        /* FORWARD CHAIN PTR              */ 04450000
*       2 WWBBCKPT PTR(31),        /* BACKWARD CHAIN PTR             */ 04500000
*       2 WWBASCB  PTR(31),        /* ADDR OF THE USERS ASCB         */ 04550000
*       2 WWBTCBAD PTR(31),        /* ADDR OF THE USERS TCB          */ 04600000
*       2 WWBFLAGS BIT(8),         /* FLAGS BYTE                     */ 04650000
*         3 WWBPOSTD BIT(1),       /* THIS ECB HAS BEEN POSTED       */ 04700000
*         3 WWBUSE0  BIT(1),       /* This WWB represents an            04733300
*                                     *authorized* caller and reply     04766600
*                                     ID 0 can be used to satisfy       04799900
*                                     this request (for WWBs on         04833200
*                                     UCMOECBH queue only)       @PPA*/ 04866500
*       2 WWBVRSN  CHAR(1),        /* VERSION ID                     */ 04900000
*       2 WWBRESRV CHAR(2),        /* RESERVED                       */ 04950000
*       2 WWBECB   PTR(31),        /* ECB PART OF WTOECB             */ 05000000
*       2 WWBACRN  CHAR(4),        /* CONTROL BLOCK ID 'WWB '        */ 05050000
*       2 *        CHAR(4);        /* RESERVED                       */ 05100000
*@SPACE;                           /*                                */ 05150000
*DCL WWBID    CHAR(4) CONSTANT('WWB ');/* PARM LIST ACRONYM          */ 05200000
*DCL WWBS220  FIXED(8) CONSTANT(1);/* LEVEL OS/VS2 JBB2220           */ 05250000
*DCL WWBVERN  FIXED(8) CONSTANT(WWBS220);/* THE CURRENT LEVEL        */ 05300000
*/**************** END OF WWB ****************************************/ 05350000
*                                                                       05400000
*%DCL WWBSIZE  CHAR;     /* DCL SIZE OF WWB VARIABLE                 */ 05450000
*% WWBSIZE = 'LENGTH(WWB)' ;       /* GET LENGTH OF WWB              */ 05500000
*%DCL WWBECBOF CHAR;     /* DCL SIZE OF WWB ECB OFFSET               */ 05550000
*% WWBECBOF = '(ADDR(WWBECB) - ADDR(WWB))' ; /* WWB ECB OFFSET       */ 05600000
