*                                                                       00050002
*        %GOTO WQEL1;        /* BILINGUAL MAPPING                       00060002
         MACRO                                                          00100002
         IHAWQE &DSECT=YES,&FORMAT=OLD           */                     00110000
*%WQEL1 : ;                                                             00160002
*/* **START OF SPECIFICATIONS*************************************** */ 00170000
*/*                                                                  */ 00750002
*/*01*  MACRO NAME:  IHAWQE                                      @LNC*/ 00760000
*/*                                                                  */ 00850002
*/*01*  DSECT NAME:  WQE, WQEMAJ, WQEMIN                         @LNC*/ 00856000
*/*                                                              @P6A*/ 00862000
*/*01*  DESCRIPTIVE NAME:                                        @LNC*/ 00868000
*/*        WRITE-TO-OPERATOR QUEUE ELEMENT (WQE) DEFINITIONS         */ 00874000
*/*01* ACRONYM:  WQE                                             @LNC*/ 00880000
*/*01* EXTERNAL CLASSIFICATION: PSPI                             @LNA*/ 00886000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @LNA*/ 00892000
*/*                                                              @P6A*/ 00898000
*/*01*  COMPONENT = COMMUNICATIONS TASK (SC1CK)                  @LNC*/ 00904000
*/*                                                                  */ 00910002
*/*01* PROPRIETARY STATEMENT=                                        */ 00910600
*/***PROPRIETARY_STATEMENT********************************************/ 00911200
*/*                                                                  */ 00911800
*/*                                                                  */ 00912400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00913000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00913600
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                      */ 00914200
*/*                                                                  */ 00914800
*/* STATUS= HBB7703                                                  */ 00915400
*/*                                                                  */ 00916000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00916600
*/*                                                                  */ 00917200
*/*01*  EYE-CATCHER:  NONE                                       @LNC*/ 00917800
*/*                                                              @P6A*/ 00918400
*/*01*  STORAGE ATTRIBUTES:                                      @LNC*/ 00919000
*/*02*    MAIN STORAGE:                                          @LNA*/ 00919600
*/*02*    VIRTUAL STORAGE:                                       @LNA*/ 00920200
*/*02*    AUXILIARY STORAGE:                                     @LNA*/ 00920800
*/*02*    DATA SPACE:                                            @LNA*/ 00921400
*/*02*    SUBPOOL: 229(CONSOLE PRIVATE AFTER SVC 35 PROCESSING), @LNC*/ 00922000
*/*       239(WTO BRANCH ENTRY), 0(WTO/R ISSUERS SPACE DURING    @LNC*/ 00922600
*/*       SVC 35 PROCESSING)                                     @LNC*/ 00923200
*/*02*    KEY:  0                                                @LNC*/ 00923800
*/*02*    RESIDENCY:  < 16 M                                     @LNC*/ 00924400
*/*                                                              @P6A*/ 00925000
*/*01*  SIZE:  352 BYTES                                         @LNC*/ 00925600
*/*                                                              @P6A*/ 00926200
*/*01*  METHOD OF ACCESS:                                        @LNC*/ 00926800
*/*      PL/S - DCL (WQEPTR,WMJPTR,WMNPTR) PTR                       */ 00930002
*/*                                                                  */ 00960002
*/*      VIA ATTRIBUTE -                                         @LFA*/ 00960200
*/*       ON BASE WQE STRUCTURE  - SPECIFY %WQEVIA = 'YES'       @LFA*/ 00960400
*/*        AND DECLARE WQEALET PRIOR TO %INCLUDE STATEMENT.      @LFA*/ 00960600
*/*       ON MAJOR WQE STRUCTURE - SPECIFY %WMJMVIA = 'YES'      @LFA*/ 00960800
*/*        AND DECLARE WMJMALET PRIOR TO %INCLUDE STATEMENT.     @LFA*/ 00961000
*/*       ON MINOR WQE STRUCTURE - SPECIFY %WMNMVIA = 'YES'      @LFA*/ 00961200
*/*        AND DECLARE WMNMALET PRIOR TO %INCLUDE STATEMENT.     @LFA*/ 00961400
*/*       ON SYSID ARRAY         - SPECIFY %WQESYVIA = 'YES'     @LFA*/ 00961600
*/*        AND DECLARE WQESYALET PRIOR TO %INCLUDE STATEMENT.    @LFA*/ 00961800
*/*       FOR GLOBAL DEFAULT VIA(0) SPECIFY %GLOBALARMODE='YES'  @LFA*/ 00962000
*/*                                                                  */ 00962200
*/* PL/AS LISTING - SPECIFY %IHALIST = 'NO' BEFORE %INCLUDE      @P8C*/ 00962400
*/*                 IF LISTING IS TO BE SUPPRESSED               @P8A*/ 00962600
*/*                                                                  */ 00962800
*/*      BAL  - DSECT(S) ARE PRODUCED UNLESS DSECT=NO IS SPECIFIED.  */ 00963000
*/*             USING ON DSECT NAME GIVES ADDRESSABILITY FOR ALL     */ 00963200
*/*             SYMBOLS IN THAT DSECT.  IF FORMAT=OLD IS SPECIFIED   */ 00963400
*/*             OR DEFAULTED, 1 DSECT CALLED WQE IS PRODUCED.        */ 00963600
*/*             IF FORMAT=NEW IS SPECIFIED, 3 DSECTS ARE PRODUCED,   */ 00963800
*/*             AND THEY ARE                                         */ 00964000
*/*                 WQE    - NORMAL WQE                              */ 00964200
*/*                 WQEMAJ - MAJOR WQE                               */ 00964400
*/*                 WQEMIN - MINOR WQE                               */ 00964600
*/*                                                                  */ 00964800
*/*01*  FUNCTION:                                                @LNC*/ 00965000
*/*             A WQE IS CREATED FOR EVERY WTO/WTOR REQUEST.     @L1A*/ 00965200
*/*             IT CONTAINS INFORMATION ABOUT THE WTO/WTOR       @L1A*/ 00965400
*/*             ISSUER, ROUTING INSTRUCTIONS AND MESSAGE TEXT.   @LNC*/ 00965600
*/*                                                                  */ 00965800
*/*01*  CREATED BY:                                              @LNC*/ 00966000
*/*             IEAVH600, IEAVM600, IEAVBWTO                     @LNC*/ 00966200
*/*01*  NOTE: IF THE WQE SIZE CHANGES,                           @LNC*/ 00966400
*/*           FIELDS MAJORWQE AND MINORWQE IN                    @LNC*/ 00966600
*/*           IEAVMWTO MUST CHANGE.                              @LNC*/ 00966800
*/*                                                              @PGC*/ 00967000
*/*     NOTE: JES3 DEPENDS ON THE LENGTHS OF THE                 @LNC*/ 00967200
*/*           MAJOR AND MINOR WQES BEING EQUAL.                  @LNC*/ 00967400
*/*                                                                  */ 00967600
*/*01*  POINTED-TO-BY:                                           @LNC*/ 00967800
*/*             ORERWQE - ORE DATA AREA                          @L1A*/ 00968000
*/*             SSWTWQE - SSOB DATA AREA ( MAJOR WQE )           @L1A*/ 00968200
*/*             SSWTMIN - SSOB DATA AREA ( MINOR WQE )           @L1A*/ 00968400
*/*             UCMWTOQ - UCM DATA AREA ( FIRST WQE )            @L1A*/ 00968600
*/*             UCMWQEND - UCM DATA AREA ( LAST WQE )            @L1A*/ 00968800
*/*             CQEWQE - CQE DATA AREA                           @L1A*/ 00969000
*/*             WQELKP - WQE DATA AREA ( NEXT WQE )              @L1A*/ 00969200
*/*             WMNMNX2 - MINOR WQE DATA AREA ( NEXT MINOR WQE ) @L1A*/ 00969400
*/*             WMJMMIN - MAJOR WQE DATA AREA ( FIRST MINOR WQE) @L1A*/ 00969600
*/*                                                                  */ 00969800
*/*01*  SERIALIZATION:                                           @LNC*/ 00970000
*/*             LOCAL AND CMS LOCKS                              @L1A*/ 00970200
*/*                                                                  */ 00970400
*/*                                                                  */ 00970600
*/*  CHANGE ACTIVITY = ZA26741,ZA38566,G64DPSS,G64MP2D               */ 00970800
*/*                    G384P2L,G38OP2L                               */ 00971000
*/* $MAC(IHAWQE) COMP(SC1CK): WTO Queue Element                      */ 00971200
*/* $L1=OCCF,      JBB2110,  820531,  PD2I: OCCF UPDATES             */ 00971400
*/* $L2=MRRRML,    JBB2125,  830216,  PDFI: ROUTING BY MESSAGE LEVEL */ 00971600
*/* $L3=MRREXITS,  JBB2125,  830420,  PDFA: COMM TASK USER EXITS     */ 00971800
*/* $L4=MRRHCLOG,  JBB2125,  830608,  PDF8: HARDCOPY LOG FORMAT      */ 00972000
*/* $P1=PAJ0144,   JBB2125,  830708,  PDSS: SELECTIVE AMRF           */ 00972200
*/* $L5=COEXWTO1,  JBB2220,  840301,  PDF9: JES3/MCS COEXISTENCE     */ 00972400
*/* $L6=COEXWTO1,  JBB2220,  841128,  PDF9: JES3/MCS COEXISTENCE     */ 00972600
*/* $P2=PA20420,   JBB2220,  850814,  PDF9: JES3/MCS COEXISTENCE     */ 00972800
*/* $P3=PA21029,   JBB2220,  860730,  PDF9: JES3/MCS COEXISTENCE     */ 00973000
*/*                    YA02977,YA06025                               */ 00973200
*/*                    YA06920                                       */ 00973400
*/*                    YA07436                                       */ 00973600
*/*                    YA08767                                       */ 00973800
*/*                    YA09374                                       */ 00974000
*/*                    YA10055 - EXPANDED WQE 32 BYTES               */ 00974200
*/*                    YA10057 - DEFINE ROUTING CODE 41              */ 00974400
*/*                    YA11509 - NO CODE CHANGES. REASSEM ONLY       */ 00974600
*/*                    YA15064 - PP NONACTION BIT DEFINED    @YA15064*/ 00974800
*/*                    YA22959 - MESSAGE ISSUED AS HARDCOPY ONLY     */ 00975000
*/*                              BIT DEFINED.                @YA22959*/ 00975200
*/*                    OY28442 - JES3 COEXISTENCE                    */ 00975400
*/* $L7=CNMG2WTO,  HBB4410,  870419,  PDR3: CONSOLE MERGE  STAGE II  */ 00975600
*/* $L8=TSOOP,     HBB4410,  870622,  PDBU: TSO OPERATOR             */ 00975800
*/* $L9=KNWTO,     HBB4410,  870622,  PDCM: KANJI/WTO                */ 00976000
*/* $LA=TSOOP,     HBB4410,  880111,  PDBU: TSO OPERATOR             */ 00976200
*/* $LB=OPSSI6FB,  HBB4410,  880111,  PDFB: OPSSI MESSAGE QUEUING    */ 00976400
*/* $LC=TSOOP8DC,  HBB4410,  880711,  PDDC: TSO OPERATOR             */ 00976600
*/* $LD=CNSL1CS9,  HBB4410,  881222,  PDS9: CONSOLE ENHANCEMENTS 1   */ 00976800
*/* $P4=PEO1251,   HBB4410,  881222,  PDEF: OPSSI INVESTIGATION #2   */ 00977000
*/* $LE=CNSL1DHH,  HBB4410,  890130,  PDHH: CONSOLE ENHANCEMENTS 1   */ 00977200
*/* $P5=PEO1367,   HBB4410,  890130,  PDBT: TSO OPERATOR             */ 00977400
*/* $P6=PEO1290,   HBB4410,  890417,  PDBT: OPSSI                    */ 00977600
*/* $D1=DEO0124,   HBB4410,  890421,  PDCM: DCR 124                  */ 00977800
*/* $LF=CNSL1EHE,  HBB4410,  890403,  PDHE: CONSOLE ENHANCEMENTS 1   */ 00978000
*/* $P7=PEO1173,   HBB4410,  890417,  PDBT: TSO OPERATOR             */ 00978200
*/* $LG=CNITGDHE,  HBB4410,  890510,  PDHE: CONSOLE INTEGRATION      */ 00978400
*/* $LH=CNITGDCR,  HBB4410,  890510,  PDCR: CNITG  DESC 12, UD       */ 00978600
*/* $P8=PH25041,   HBB4410,  890612,  PDHE: LISTING CONTROL DEFAULT  */ 00978800
*/* $D2=DEO0184,   HBB4410,  890612,  PDHE: DCR 184                  */ 00979000
*/* $LI=CNITGHHD,  HBB4410,  890814,  PDHD: JES3 COEXISTENCE SPE     */ 00979200
*/* $D3=DEO0243,   HBB4410,  890905,  PDDC: CONSOLE INTEGRATION      */ 00979400
*/* $D4=DEO0253,   HBB4410,  891127,  PDBT: OPSSI - DCR 253          */ 00979600
*/* $D5=DEO0254,   HBB4410,  891016,  PDEF: SYSPLEX MESSAGE SERVICES */ 00979800
*/* $P9=PEO2558,   HBB4410,  891127,  PDBT: TSO OPERATOR             */ 00980000
*/* $PA=PEO3397,   HBB4410,  900226,  PDCR: PEO2558 IN ERROR         */ 00980200
*/* $PB=PEO3318,   HBB4410,  900226,  PDCR: QUEUE BY ID ONLY         */ 00980400
*/* $PC=PEO3635,   HBB4410,  900402,  PDCR: DUPLICATE MESSAGES       */ 00980600
*/* $PD=PEO4114,   HBB4410,  900507,  PDEF: DELETE STCK TIME STAMP   */ 00980800
*/* $PE=PEO4396,   HBB4410,  900604,  PDEF: ADD STCK TIME STAMP      */ 00981000
*/* $PF=PEO4480,   HBB4410,  900604,  PDEF: AMRF RECOVERY            */ 00981200
*/* $D6=DEO0358,   HBB4410,  900626,  PDEC: DBCS REMOVAL             */ 00981400
*/* $LJ=NETSY6HL,  JBB4422,  901112,  PDHL: NETVIEW AUTOMATION       */ 00981600
*/* $PG=PKB0806,   HBB4430,  920725,  PDCM: PROLOG UPDATES           */ 00981800
*/* $PH=PKB3978,   HBB4430,  920804,  PDCM: PROLOG CORRECTION        */ 00982000
*/* $PI=PKB4150,   HBB4430,  920828,  PDCM: REMOVE BAD COMMENTS FROM */ 00982200
*/*                                          EJECT STATEMENTS        */ 00982400
*/* $LK=SYSOP6CZ,  HBB5510,  930304,  PDCZ: SYSPLEX OPERATIONS       */ 00982600
*/* $LM=OSR4V1,    HBB5510,  921207,  PDV1: HC(Y|N) QUEUING          */ 00982800
*/* $LN=SYSOP16,   HBB5510,  930520,  PD3J: SHOWHDR UPDATES          */ 00983000
*/* $LO=SYSOPSC,   HBB5510,  930715,  PDSC: REPLY ID CONSTRAINT      */ 00983200
*/*                                         RELIEF                   */ 00983400
*/* $PJ=PIG3185,   HBB5510,  931109,  PDSC: REMOVE $LK CHANGES       */ 00983600
*/* $01=OY64648,   HBB4410,  930831,  PDBU: Q ONLY TO THIS SYSTEM    */ 00983800
*/* $02=OW00542,   HBB4420,  940429,  PDEV: Hung MLWTOs not deleted  */ 00984000
*/* $D7=DN70044,   HBB5520,  940615,  PDHD: JES3 FF CONSOLES SUPPORT */ 00984200
*/* $03=OW07896,   HBB5510,  940818,  PDBD: Sysplex wide WQE buffer  */ 00984400
*/*                                         shortage                 */ 00984600
*/* $04=OW18292,   HBB5510,  960215,  PDHD: Year 2000 support        */ 00984800
*/* $05=OW18874,   HBB5510,  960315,  PDHD: Add QNLY bit             */ 00985000
*/* $PK=PQC1061,   HBB6603,  960815,  PDCI: Add ASCB bit             */ 00985200
*/* $06=OW22723,   HBB5510,  961015,  PDHD: Add WQEDMDB, WMJMDMDB    */ 00985400
*/* $07=OW26748,   HBB5510,  970731,  PDCM: WQEs with extended use   */ 00985600
*/*                                         count not going to zero  */ 00985800
*/* $08=OW30759,   HBB5510,  980115,  PDHD: Serialize the WQEAVAIL   */ 00986000
*/*                                         field.                   */ 00986200
*/* $09=OW32605,   HBB5510,  980504,  PDHD: Remove OW26748 code.     */ 00986400
*/*                                         Release 6 is the last    */ 00986600
*/*                                         release with OW26748.    */ 00986800
*/* $0A=OW32623,   HBB5520,  980908,  PDCM: Long multiline not always*/ 00987000
*/*                                         displayed on DIDOCS      */ 00987200
*/*                                         consoles if no OOL and   */ 00987400
*/*                                         also queued to XMCS con. */ 00987600
*/* $PL=PWK0819,   HBB6608,  990415,  PDHD: Add missing user exit    */ 00987800
*/*                                         request bits.            */ 00988000
*/* $PM=PXD0637,   HBB7703,  000115,  PDHD: Change comment on        */ 00988100
*/*                                         STCK stamps.             */ 00988200
*/* ***END OF SPECIFICATIONS**************************************** */ 00988300
*/* (A) Added a bit to queue a message only to consoles on this  @01A*/ 00988400
*/*     system                                                   @01A*/ 00988600
*/* (A) Added word to contain high-order word of stcksync time   @02A*/ 00988800
*/*     when last line added to a multi-line message             @02A*/ 00989000
*/* (A) Added bits WQENSYL, WQEJ3B1, WQEJ3B2.                    @02A*/ 00989200
*/* (A) Added WQECENT/WMJMCENT to hold the century number.       @04A*/ 00989400
*/* (A) Added bit to indicate this message should be sent to     @05A*/ 00989600
*/*     the console and nowhere else.                            @05A*/ 00989800
*/* (A) Added bit to indicate that ASCB was specified on WTO     @PKA*/ 00990000
*/* (A) Added bit to indicate that we have already sent DOM      @06A*/ 00990200
*/*     MDBs to DOM(NORMAL) consoles. If this WQE is still on    @06A*/ 00990400
*/*     the queue in the next pass, don't do it again.           @06A*/ 00990600
*/* (A) Add 3 bytes of diagnostic information. These fields      @07A*/ 00990800
*/*     are reserved for IBM use.                                @07A*/ 00991000
*/* (A) Add 3 bytes of diagnostic information. These fields      @07A*/ 00991200
*/*     are reserved for IBM use. The old field names have       @07A*/ 00991400
*/*     been kept and redefined as 0C fields to prevent other    @07A*/ 00991600
*/*     modules which might reference them from failing future   @07A*/ 00991800
*/*     assemblies.                                              @07A*/ 00992000
*/* (C) Changed the WQEAVAIL (WMJMBUF) byte to be ABNORMAL.      @08A*/ 00992200
*/*     A loss of serialization has caused WQEs to stay on       @08A*/ 00992400
*/*     the queue forever.                                       @08A*/ 00992600
*/* (D) Removedthe diagnostic information added in OW26748.      @09A*/ 00992800
*/*     Note - these fields can never be re-used until there     @09A*/ 00993000
*/*     is no chance that APAR OW26748 is in the sysplex.        @09A*/ 00993200
*/* (C) Add new field to WQE to keep a count of JUST the MCS     @0AA*/ 00993400
*/*     consoles to which a message is queued. Current fields    @0AA*/ 00993600
*/*     are not sufficient in all cases. WQEMCSCT will reflect   @0AA*/ 00993800
*/*     just the MCS consoles to which a message is queued. This @0AA*/ 00994000
*/*     field is increased but never decreased.                  @0AA*/ 00994200
*/* (A) Create a new version level which reflects removal of     @0AA*/ 00994400
*/*     diagnostics flags added in OW26748.                      @0AA*/ 00994600
*/* (A) WQEERFS has copies of the requests from exits that were  @PLA*/ 00994800
*/*     in CTXTERFS. But the bit definitions weren't all defined @PLA*/ 00995000
*/*     in the WQE. Add WQEESJL/WMJESJL and WQENWTP/WMJNWTP      @PLA*/ 00995200
*/*     to correspond to CTXTESJL and CTXTNWTP.                  @PLA*/ 00995400
*/*     (CTXTNWTP was added in OW37807, first rolled into R8).   @PLA*/ 00995600
*/* (C) Comment changes on WQETS3 and WMJMTS3, to indicate that  @PMA*/ 00997000
*/*     this time changes after a WWB wait.                      @PMA*/ 00998400
*/* **************************************************************** */ 01000002
*%GOTO WQEL2;  /*                                                       01020002
         SPACE                                                          01050002
         IEZBITS , -          SYMBOLIC BIT DEFINITIONS                  01100002
*********************************************************************** 01200002
*                                                                     * 01250002
*                   WQE (NORMAL FORMAT)                               * 01300002
*                                                                     * 01350002
*********************************************************************** 01400002
         SPACE                                                          01400402
         AIF   ('&DSECT' EQ 'NO').WQE0000                               01402002
WQE      DSECT                                                          01404002
         AGO   .WQE0020                                                 01406002
.WQE0000 ANOP                                                           01408002
         DS    0D                                                       01410002
WQE      EQU   *                                                        01412002
.WQE0020 ANOP                                                           01414002
         SPACE                                                          01450002
WQELKP   DS    A              LINKAGE POINTER                      @L6C 01460000
WQENBR   DS    0F             MESSAGE LENGTH (CCW COUNT FIELD)     @L5C 01470000
         DS    H              NOT TO BE USED                       @L5C 01480000
WQETXTLN DS    H              ACTUAL TEXT LENGTH                   @L5A 01490000
WQERTCT  DS    H              ROUTED WQE COUNT                     @L5A 01500000
WQEUSE   DS    H              WQE USE COUNT                        @L6C 01510000
WQEPAD   DS    C -            BLANK                              Y02710 01520000
WQETS    DS    CL8 -          TIME STAMP                         Y02710 01530000
WQEPAD1  DS    C -            BLANK                              Y02710 01540000
WQEJOBNM DS    CL8            JOBNAME INSERTED BY SUBSYSTEM      Y02710 01550000
WQEPAD2  DS    CL1            BLANK                              Y02710 01560000
WQETXT   DS    0CL128 -       MESSAGE TEXT (MAX 128 BYTES)              01700002
         DS    CL127                                                    01750002
WQETXTL  DS    C -            LAST BYTE OF MESSAGE TEXT                 01800002
WQEPAD3  DS    C -            EXTRA BYTE SO REMAINING FIELDS ARE   @09C 01810000
*                             ON A WORD BOUNDARY - note, this      @09C 01820000
*                             field was used in OW26748, do not    @09C 01830000
*                             reuse                                @09C 01840000
         SPACE                                                          01850002
WQEXA    DS    B -            DISPOSITION FLAGS                         01900002
WQEPURGE EQU   BIT0 -         PURGE THIS WQE                            01950002
WQEQFHC  EQU   BIT1 -         QUEUE FOR HARD COPY                       02000002
WQEORE   EQU   BIT2 -         ORE EXISTS FOR THIS WQE            Y02710 02010000
WQEQDFHC EQU   BIT3 -         QUEUED FOR HARD COPY                      02100002
WQEWTOR  EQU   BIT4 -         WQE CREATED FOR WTOR                      02150002
WQEDOM   EQU   BIT5 -         MESSAGE TO BE DOM'ED               Y02710 02160000
WQESUSP  EQU   BIT6 -         PROCESSING TEMPORARILY SUSPENDED   Y02710 02170000
WQEAUTH  EQU   BIT7 -         MESSAGE ISSUED BY AUTHORIZED USER  Y02710 02180000
         SPACE                                                          02200002
WQEASID  DS    CL2 -          ASID OF USER                       Y02710 02210000
         SPACE                                                          02400002
WQEAVAIL DS    B -            BUFFER STATUS FLAGS                       02450002
WQEBUFA  EQU   BIT0 -         BUFFER IS FREE                            02500002
WQEBUFB  EQU   BIT1 -         BUFFER IS IN USE                          02550002
WQEBUFC  EQU   BIT2 -         READY FOR HARDCOPY                 Y02710 02560000
WQEBUFD  EQU   BIT3 -         BUFFER OBTAINED DYNAMICALLY               02600002
WQEBUFE  EQU   BIT4 -         BUFFER HAS BEEN SERVICED                  02650002
WQEBUFF  EQU   BIT5 -         TPUT - TO DO                       Y02710 02660000
WQEBUFG  EQU   BIT6 -         WQE SUPPRESSED                   @G384P2L 02670000
WQEMTRCD EQU   BIT7 -         BUFFER HAS BEEN MASTER TRACED    @G64MP2D 02680000
         SPACE                                                          02700002
WQETCB   DS    F -            POINTER TO USER'S TCB              Y02710 02710000
WQESEQ#  DS    0F             WTO SEQUENCE NUMBER (DOM/CONNECT ID)      02720000
*                                                              @YA06025 02730000
WQESYSID DS    FL1            SYSTEM ID                            @L5A 02740000
WQESEQN  DS    FL3            24-BIT SEQUENCE NUMBER           @YA06025 02750000
         SPACE                                                          02950002
WQEMCSF  DS    0BL2 -         MCS FLAGS                                 03000002
WQEMCSF1 DS    B -            FIRST BYTE OF MCS FLAGS                   03050002
WQEMCSA  EQU   BIT0 -         ROUTING AND DESCRIPTOR CODE FIELDS EXIST  03100002
WQEMCSB  EQU   BIT1 -         QUEUE AT LEAST TO UCM ENTRY PASSED        03150002
*                             IN REG 0 (IF THE CONSOLE IS ACTIVE)       03152002
WQEMCSC  EQU   BIT2 -         COMMAND RESPONSE (INCLUDES HARD COPY)     03200002
WQEMCSD  EQU   BIT3 -         MESSAGE TYPE FLAGS FIELD EXISTS           03250002
WQEMCSE  EQU   BIT4 -         THIS WTO IS A REPLY TO A WTOR             03300002
WQEMCSFF EQU   BIT5 -         BROADCAST TO ACTIVE CONSOLES              03310000
WQEMCSG  EQU   BIT6 -         QUEUE FOR HARD COPY ONLY                  03400002
WQEMCSH  EQU   BIT7 -         QUEUE UNCONDITIONALLY TO UCM ENTRY        03450002
*                             PASSED IN REG 0                           03452002
WQEMCSF2 DS    B -            SECOND BYTE OF MCS FLAGS                  03500002
WQEMCSI  EQU   BIT0 -         NO TIME STAMP                             03550002
WQEMCSJ  EQU   BIT1 -         MUST BE ZERO                              03552002
WQEMCSK  EQU   BIT2           PRIMARY SUBSYSTEM USE ONLY:          @L5C 03558800
*                             JES3: DO NOT LOG MINOR WQES IF THE   @L5A 03565600
*                                   MAJOR IS NOT HARDCOPIED        @L5A 03572400
*                             JES2: NOT USED                       @L5A 03579200
WQEMCSL  EQU   BIT3           EXTENDED WPL FORMAT (WPX) EXISTS     @L5C 03586000
WQEMCSM  EQU   BIT4 -         THE MESSAGE IS AN OPERATOR COMMAND   @L4C 03592800
WQEMCSN  EQU   BIT5 -         BYPASS QUEUING TO HARD COPY (FOR          03600002
*                             USERS OPERATING IN PROTECT KEY 0 ONLY)    03602002
WQEMCSO  EQU   BIT6           WQEBLK KEYWORD SPECIFIED             @L5C 03612000
WQEMCSP  EQU   BIT7           RESERVED                             @L5C 03622000
         SPACE                                                          03750002
WQEMSGTP DS    0BL2 -         MESSAGE TYPE FLAGS                        03800002
WQEMSGT1 DS    B -            FIRST BYTE OF MESSAGE TYPE FLAGS          03850002
WQEMSGTA EQU   BIT0 -         DISPLAY JOBNAMES                          03900002
WQEMSGTB EQU   BIT1 -         DISPLAY STATUS                            03950002
WQEMSGTC EQU   BIT2 -         MONITOR ACTIVE                            04000002
WQEMSGTD EQU   BIT3 -         INDICATES EXISTENCE OF QID FIELD IN       04002002
*                             WPL  (AOS/1)                       ICB468 04004002
WQERSV13 EQU   BIT4,,C'X' -   RESERVED                                  04014002
WQEMSGTF EQU   BIT5 -         MONITOR SESS                              04050002
WQERSV14 EQU   BIT6,,C'X' -   RESERVED                                  04060002
WQERSV15 EQU   BIT7,,C'X' -   RESERVED                                  04070002
WQEMSGT2 DS    B -            SECOND BYTE OF MESSAGE TYPE FLAGS         04100002
         SPACE                                                          04150002
WQEROUT  DS    0BL2 -         ROUTING CODES                             04200002
*                             THESE CODES INDICATE THE FUNCTIONAL       04250002
*                             AREA OR AREAS TO WHICH A MESSAGE IS TO    04300002
*                             BE SENT.                                  04350002
WQEROUT1 DS    B -            1ST BYTE OF ROUTING CODES                 04400002
WQEROUTA EQU   BIT0 -         MASTER CONSOLE                            04450002
WQEROUTB EQU   BIT1 -         MASTER CONSOLE INFORMATIONAL              04500002
WQEROUTC EQU   BIT2 -         TAPE POOL                                 04550002
WQEROUTD EQU   BIT3 -         DIRECT ACCESS POOL                        04600002
WQEROUTE EQU   BIT4 -         TAPE LIBRARY                              04650002
WQEROUTF EQU   BIT5 -         DISK LIBRARY                              04700002
WQEROUTG EQU   BIT6 -         UNIT RECORD POOL                          04750002
WQEROUTH EQU   BIT7 -         TELEPROCESSING CONTROL                    04800002
WQEROUT2 DS    B -            2ND BYTE OF ROUTING CODES                 04850002
WQEROUTI EQU   BIT0 -         SYSTEM SECURITY                           04900002
WQEROUTJ EQU   BIT1 -         SYSTEM/ERROR MAINTENANCE                  04950002
WQEROUTK EQU   BIT2 -         PROGRAMMER INFORMATION                    05000002
WQEROUTL EQU   BIT3 -         EMULATOR INFORMATION                      05050002
WQEROUTM EQU   BIT4 -         USER ROUTING CODE                         05100002
WQEROUTN EQU   BIT5 -         USER ROUTING CODE                         05150002
WQEROUTO EQU   BIT6 -         USER ROUTING CODE                         05200002
WQEROUTP EQU   BIT7           USER ROUTING CODE                    @L5C 05201000
         SPACE                                                          05202002
WQECHAR1 DS    CL1            1ST CHARACTER OF TEXT               @P3A  05211800
WQEFLG3  DS    B -            MISCELLANEOUS FLAGS                 @LDA  05221600
WQEDLVRD EQU   BIT0 -         WQE HAS BEEN DELIVERED TO A CONSOLE ON   +05231400
                              THIS SYSTEM                         @LDA  05241200
WQEDNDWQ EQU   BIT1 -         DO NOT DELETE WTOR UNTIL THIS BIT IS OFF +05251000
                                                                  @LDA  05260800
WQENSYL  EQU   BIT2 -         DO NOT SEND THIS MESSAGE TO SYSLOG  @D7A  05270600
WQEJ3B1  EQU   BIT3 -         BIT FOR USE BY JES3 ONLY            @D7A  05280400
WQEJ3B2  EQU   BIT4 -         BIT FOR USE BY JES3 ONLY            @D7A  05290200
WQEUCMID DS    FL1 -          UNIQUE UCM ENTRY ID                       05300002
WQEFLG1  DS    B -            MISCELLANEOUS FLAGS              @G38OP2L 05306300
WQEFLG11 EQU   BIT0 -         THIS MESSAGE WAS PROCESSED WHILE MPF     *05312600
                              WAS ACTIVE AND HARDCOPY WAS AVAILABLE    *05318900
                                                               @G38OP2L 05325200
WQERETAN EQU   BIT1 -         MSG IS TO BE RETAINED BY AMRF        @P1C 05331500
WQENMOD  EQU   BIT2           THE CHARACTERISTICS OF THE MESSAGE MAY   X05337800
                              NOT BE MODIFIED BY THE PRIMARY           X05344100
                              SUBSYSTEM                            @L6C 05350400
WQESQMC  EQU   BIT3           ACTION MESSAGE NOT QUEUED TO ANY         X05356700
                              CONSOLE - DEFAULT TO MASTER CONSOLE  @L6C 05363000
WQENOJLG EQU   BIT4           SUPPRESS FROM JOB LOG                @L6C 05369300
WQEAUTOV EQU   BIT5           INDICATES MPF AUTO SUPPORTED     @YA06920 05375600
WQEPPNA  EQU   BIT6 -         PROBLEM PROGRAM NONACTION MSG    @YA15064 05381900
WQERISS  EQU   BIT7 -         REISSUED MESSAGE                 @YA08767 05388200
WQERPYID DS    CL2 -          REPLY ID                           Y02710 05394500
         SPACE                                                          05402002
WQEDESCD DS    0BL2 -         DESCRIPTOR CODES                          05450002
WQEDC1   DS    B -            FIRST BYTE OF DESCRIPTOR CODES            05500002
WQEDCA   EQU   BIT0 -         SYSTEM FAILURE MESSAGE                    05550002
WQEDCB   EQU   BIT1 -         IMMEDIATE ACTION REQUIRED MESSAGE         05600002
WQEDCC   EQU   BIT2 -         EVENTUAL ACTION REQUIRED MESSAGE          05650002
WQEDCD   EQU   BIT3 -         SYSTEM STATUS MESSAGE                     05700002
WQEDCE   EQU   BIT4 -         IMMEDIATE COMMAND RESPONSE MESSAGE        05750002
WQEDCF   EQU   BIT5 -         JOB STATUS MESSAGE                        05800002
WQEDCG   EQU   BIT6           APPLICATION PROGRAM/PROCESSOR MESSAGE,   *05810000
                              OR DELETE AT TASK TERMINATION        @L5C 05820000
WQEDCH   EQU   BIT7 -         OUT-OF-LINE MESSAGE                       05900002
WQEDC2   DS    B -            SECOND BYTE OF DESCRIPTOR CODES           05950002
WQEDCI   EQU   BIT0           OPERATOR REQUEST                     @L5C 05957300
WQEDCJ   EQU   BIT1           DYNAMIC STATUS DISPLAY               @L5C 05964600
WQEDCK   EQU   BIT2 -         CRITICAL EVENTUAL ACTION MSG -   @G64DPSS 05971900
*                             DESCRIPTOR CODE 11               @G64DPSS 05979200
WQEDCL   EQU   BIT3 -         IMPORTANT INFORMATION MESSAGE        @LHC 05986500
WQEDCM   EQU   BIT4 -         PREVIOUSLY AUTOMATED                 @LJC 05993800
WQERSV23 EQU   BIT5,,C'X' -   RESERVED                                  06001702
WQERSV24 EQU   BIT6,,C'X' -   RESERVED                                  06001802
WQERSV25 EQU   BIT7,,C'X' -   RESERVED                                  06001902
         SPACE                                                          06002002
WQERSV26 DS    XL1 -          RESERVED for 3rd byte of descriptor       06002600
*                             codes                                @0AC 06003200
WQEMCSCT DS    CL1            Count of MCS-only consoles to which       06003800
*                             a message is queued                  @0AA 06004400
         SPACE 1                                                        06005000
WQEJSTCB DS    F -            ADDRESS OF JOB STEP TCB            Y02710 06005600
WQEVRSN  DS    X              VERSION LEVEL                        @L1A 06006200
WQESP211 EQU   1              JBB2110 VERSION LEVEL                @L1A 06006800
WQESP220 EQU   2              JBB2220 VERSION LEVEL                @L5A 06007400
WQESP410 EQU   3              HBB4410 VERSION LEVEL                @LEC 06008000
WQESP422 EQU   4              JBB4422 VERSION LEVEL                @LJA 06008600
WQESP440 EQU   5              HBB5510 VERSION LEVEL                @LMA 06009200
WQE32623 EQU   8              OW32623 version level which means    @0AA 06009800
*                             a) all diagnostics flags from        @0AA 06010400
*                             OW26748 have been removed            @0AA 06011000
*                             b) The byte originally reserved for  @0AA 06011600
*                             the 4th byte of descriptor codes     @0AA 06012200
*                             is ow the routed to only-MCS         @0AA 06012800
*                             consoles count                       @0AA 06013400
WQEVRID  EQU   WQE32623       THE CURRENT VERSION LEVEL            @0AC 06014000
WQEFLG2  DS    B              MISC FLAGS BYTE 2                @YA08767 06014600
WQEHNDL  EQU   BIT0           THIS MSG WILL BE DISPLAYED BY            X06015200
                              ANOTHER CONSOLE HANDLER. DO NOT          X06015800
                              FORCE MSG TO MASTER CONSOLE IF           X06016400
                              NOT ROUTED.                      @YA09374 06017000
WQERSV98 EQU   BIT1           Must be unused in WQE mapping        @03C 06017600
WQEFORN  EQU   BIT2           FOREIGN WQE                          @LBA 06018200
WQETRANS EQU   BIT3           WQE HAS BEEN TRANSPORTED TO ANOTHER      *06018800
                              SYSTEM                               @LBA 06019400
WQESUPSJ EQU   BIT4           ON = DON'T DISPLAY SYSTEM NAME OR        *06020000
                              JOB NAME                             @LDA 06020600
WQEQXSYS EQU   BIT5           ON = QUEUED TO A CONSOLE ON ANOTHER      *06021200
                              SYSTEM IN THE SYSPLEX                @P6A 06021800
WQEQEXT  EQU   BIT6           ON = QUEUED TO AN EXTENDED CLASS     @P7A 06022400
WQEQMCS  EQU   BIT7           ON = QUEUED TO AN MCS CONSOLE        @P7A 06023000
WQEMCSEF DS    0CL2           EXTENDED MCS FLAGS                   @L5A 06023600
WQEMCSE1 DS    B              FIRST BYTE                           @L5A 06024200
WQEEBUSY EQU   BIT0           RETURN WITH BUSY RETURN CODE IF          *06024800
                              BUFFER LIMITATIONS EXCEEDED          @L5A 06025400
WQEECONS EQU   BIT1           FOUR-BYTE CONSOLE ID SPECIFIED       @L5A 06026000
WQEEDOMI EQU   BIT2           DOM ID WAS SPECIFIED             @YA07436 06026600
WQEECONN EQU   BIT3           CONNECT ID WAS SPECIFIED             @L5A 06027200
WQEEWTOR EQU   BIT4           WTOR WITH EXTENDED PARAMETER LIST    @L5A 06027800
WQEEPRIO EQU   BIT5           PRIORITY WAS SPECIFIED               @L5A 06028400
WQECNM   EQU   BIT6           CONSOLE NAME SPECIFIED               @L7C 06029000
WQEMCSE2 DS    B              SECOND BYTE OF EXT MCS FLAGS         @L5A 06029600
WQEETXTA EQU   BIT0           UNUSED IN WQE - TEXT ADDRESS PARM        X06030200
                              SPECIFIED ON WTO MACRO               @L9A 06030800
WQERSV99 EQU   BIT1           RESERVED                             @D1A 06031400
WQEEDBCS EQU   BIT2           RESERVED                             @D6C 06032000
WQEEIDBC EQU   BIT3           RESERVED                             @D6C 06032600
WQERSV1B EQU   BIT4           RESERVED                             @D2C 06033200
WQEESYNC EQU   BIT5           PROCESS SYNCHRONOUS WITH RESPECT TO THE  +06033800
                              CALLER                               @LEA 06034400
WQERSV1C EQU   BIT6           RESERVED                             @LFA 06035000
WQERSV1D EQU   BIT7           RESERVED                             @LFA 06035600
WQESYSNM DS    CL8            THE NAME OF THE SYSTEM ON WHICH          X06036200
                              THIS MESSAGE WAS ISSUED              @L5A 06036800
WQEDATE  DS    CL5            DATE WTO ISSUED                      @L4C 06037400
WQETS2   DS    0CL3           TENTHS AND HUNDREDTHS OF A SECOND    @L4A 06038000
WQEPER3  DS    CL1            DECIMAL POINT IN TIME                @L4A 06038600
WQETS2TH DS    CL2            TENTHS AND HUNDREDTHS OF A SECOND    @L4A 06039200
WQEXMOD  DS    0CL4           COPY OF REQUEST FLAGS (CTXTRFLG) FROM    X06039800
                              THE WTO USER EXIT INTERFACE          @L3A 06040400
WQERFLGS DS    0CL3           COMM TASK USER EXIT REQUESTS         @L3A 06041000
WQERFB1  DS    B              REQUEST FLAGS BYTE ONE               @L3A 06041600
WQERCMT  EQU   BIT0           CHANGE THE MESSAGE TEXT              @L3A 06042200
WQERCRC  EQU   BIT1           CHANGE THE ROUTING CODE(S)           @L3A 06042800
WQERCDC  EQU   BIT2           CHANGE THE DESCRIPTOR CODE(S)        @L3A 06043400
WQERQPC  EQU   BIT3           QUEUE TO A PARTICULAR ACTIVE CONSOLE @L3A 06044000
WQERQUN  EQU   BIT4           QUEUE TO A PARTICULAR CONSOLE            X06044600
                              UNCONDITIONALLY                      @L3A 06045200
WQERQRC  EQU   BIT5           QUEUE BY ROUTING CODES ONLY          @L3A 06045800
WQERCCN  EQU   BIT6           CHANGE THE CONSOLE ID                @L3A 06046400
WQERPML  EQU   BIT7           PROCESS MINOR LINES                  @L3A 06047000
WQERFB2  DS    B              REQUEST FLAGS BYTE TWO               @L3A 06047600
WQERDTM  EQU   BIT0           DELETE THE MESSAGE                   @L3A 06048200
WQEROMS  EQU   BIT1           OVERRIDE MPF SUPPRESSION             @L3A 06048800
WQERFHC  EQU   BIT2           FORCE HARDCOPY                       @L3A 06049400
WQERNHC  EQU   BIT3           FORCE NO HARDCOPY                    @L3A 06050000
WQERHCO  EQU   BIT4           FORCE HARDCOPY ONLY                  @L3A 06050600
WQERBCA  EQU   BIT5           BROADCAST MESSAGE TO ACTIVE CONSOLES @L3A 06051200
WQERBCN  EQU   BIT6           DO NOT BROADCAST MESSAGE TO ACTIVE       X06051800
                              CONSOLES                             @L3A 06052400
WQERNRT  EQU   BIT7           AMRF IS NOT TO RETAIN THIS MSG       @P1A 06053000
WQERFB3  DS    B              REQUEST FLAGS BYTE THREE             @P1C 06053600
WQERRET  EQU   BIT0           AMRF IS TO RETAIN THIS MSG           @P1A 06054200
WQERCKY  EQU   BIT1           CHANGE THE RETRIEVAL KEY             @L5A 06054800
WQERCFC  EQU   BIT2           CHANGE THE 4-BYTE CONSOLE ID         @L5A 06055400
WQERCMF  EQU   BIT3           CHANGE THE MESSAGE TYPE FLAGS        @L5A 06056000
WQERANO  EQU   BIT4           AUTOMATION IS NOT REQUIRED       @YA06920 06056600
WQERAYS  EQU   BIT5           AUTOMATION IS REQUIRED AND/OR            X06057200
                              AUTOMATION TOKEN UPDATED         @YA06920 06057800
WQEQHCO  EQU   BIT6           MESSAGE ISSUED HARDCOPY ONLY     @YA22959 06058400
WQEHUD   EQU   BIT7           UD TO HARDCOPY FLAG                  @D3A 06059000
WQESUPB  DS    B              SUPPRESSION BYTE                     @L3A 06059600
WQESNSV  EQU   BIT0           NOT SERVICED BY ANY WTO USER EXIT        X06060200
                              ROUTINE                              @L3A 06060800
WQESEER  EQU   BIT1           ESTAE ERROR IN IEAVX600              @L3A 06061400
WQESNSI  EQU   BIT2           NOT SERVICED BECAUSE OF AN               X06062000
                              INCOMPATIBLE REQUEST                 @L3A 06062600
WQESAUT  EQU   BIT3           INDICATE AUTOMATION SPECIFIED    @YA06920 06063200
WQESQED  EQU   BIT4           NOT QUEUED TO ANY CONSOLE            @L3A 06063800
WQESSSI  EQU   BIT5           SUPPRESSED BY A SUBSYSTEM            @L3A 06064400
WQESWTO  EQU   BIT6           SUPPRESSED BY A WTO USER EXIT            X06065000
                              ROUTINE                              @L3A 06065600
WQESMPF  EQU   BIT7           SUPPRESSED BY MPF                    @L3A 06066200
WQEMLVL  DS    0H             MESSAGE LEVEL MASK FOR QUEUING       @L2A 06066800
WQEML1   DS    B              FIRST BYTE OF LEVEL INDICATOR        @L2A 06067400
WQEMLR   EQU   BIT0           WTOR                                 @L2A 06068000
WQEMLIA  EQU   BIT1           IMMEDIATE ACTION MESSAGE             @L2A 06068600
WQEMLCE  EQU   BIT2           CRITICAL EVENTUAL ACTION MESSAGE     @L2A 06069200
WQEMLE   EQU   BIT3           EVENTUAL ACTION MESSAGE              @L2A 06069800
WQEMLI   EQU   BIT4           INFORMATIONAL MESSAGE                @L2A 06070400
WQEMLBC  EQU   BIT5           BROADCAST MESSAGE                    @L2A 06071000
WQEML2   DS    B              RESERVED                             @L2A 06071600
WQELENG  DS    H              WQE SIZE                         @YA08767 06072200
WQEDSQN  DS    F              UNIVERSAL DISPLAY SEQUENCE NUMBER    @L5A 06072800
WQEERC   DS    0XL16          EXTENDED ROUTING CODES               @L5A 06073400
WQEERC1  DS    B              BYTE 1  - EXTENDED ROUTING CODES     @L5A 06074000
WQERC1   EQU   BIT0           MASTER CONSOLE                       @L5A 06074600
WQERC2   EQU   BIT1           MASTER CONSOLE INFORMATIONAL         @L5A 06075200
WQERC3   EQU   BIT2           TAPE POOL                            @L5A 06075800
WQERC4   EQU   BIT3           DIRECT ACCESS POOL                   @L5A 06076400
WQERC5   EQU   BIT4           TAPE LIBRARY                         @L5A 06077000
WQERC6   EQU   BIT5           DISK LIBRARY                         @L5A 06077600
WQERC7   EQU   BIT6           UNIT RECORD POOL                     @L5A 06078200
WQERC8   EQU   BIT7           TELEPROCESSING CONTROL               @L5A 06078800
WQEERC2  DS    B              BYTE 2  - EXTENDED ROUTING CODES     @L5A 06079400
WQERC9   EQU   BIT0           SYSTEM SECURITY                      @L5A 06080000
WQERC10  EQU   BIT1           SYSTEM/ERROR MAINTENANCE             @L5A 06080600
WQERC11  EQU   BIT2           PROGRAMMER INFORMATION               @L5A 06081200
WQERC12  EQU   BIT3           EMULATOR INFORMATION                 @L5A 06081800
WQERC13  EQU   BIT4           USER ROUTING CODE                    @L5A 06082400
WQERC14  EQU   BIT5           USER ROUTING CODE                    @L5A 06083000
WQERC15  EQU   BIT6           USER ROUTING CODE                    @L5A 06083600
WQERC16  EQU   BIT7           USER ROUTING CODE                    @L5A 06084200
WQEERC3  DS    B              BYTE 3  - EXTENDED ROUTING CODES     @L5A 06084800
WQERC17  EQU   BIT0           USER ROUTING CODE                    @L5A 06085400
WQERC18  EQU   BIT1           USER ROUTING CODE                    @L5A 06086000
WQERC19  EQU   BIT2           USER ROUTING CODE                    @L5A 06086600
WQERC20  EQU   BIT3           USER ROUTING CODE                    @L5A 06087200
WQERC21  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 06087800
WQERC22  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 06088400
WQERC23  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 06089000
WQERC24  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 06089600
WQEERC4  DS    B              BYTE 4  - EXTENDED ROUTING CODES     @L5A 06090200
WQERC25  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 06090800
WQERC26  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 06091400
WQERC27  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 06092000
WQERC28  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 06092600
WQERC29  EQU   BIT4           RESERVED                             @L5A 06093200
WQERC30  EQU   BIT5           RESERVED                             @L5A 06093800
WQERC31  EQU   BIT6           RESERVED                             @L5A 06094400
WQERC32  EQU   BIT7           RESERVED                             @L5A 06095000
WQEERC5  DS    B              BYTE 5  - EXTENDED ROUTING CODES     @L5A 06095600
WQERC33  EQU   BIT0           RESERVED                             @L5A 06096200
WQERC34  EQU   BIT1           RESERVED                             @L5A 06096800
WQERC35  EQU   BIT2           RESERVED                             @L5A 06097400
WQERC36  EQU   BIT3           RESERVED                             @L5A 06098000
WQERC37  EQU   BIT4           RESERVED                             @L5A 06098600
WQERC38  EQU   BIT5           RESERVED                             @L5A 06099200
WQERC39  EQU   BIT6           RESERVED                             @L5A 06099800
WQERC40  EQU   BIT7           RESERVED                             @L5A 06100400
WQEERC6  DS    B              BYTE 6  - EXTENDED ROUTING CODES     @L5A 06101000
WQERC41  EQU   BIT0           JOB STATUS MESSAGE               @YA10057 06101600
WQERC42  EQU   BIT1           GENERAL INFO ABOUT JES2 OR JES3      @L5A 06102200
WQERC43  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 06102800
WQERC44  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 06103400
WQERC45  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 06104000
WQERC46  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 06104600
WQERC47  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 06105200
WQERC48  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 06105800
WQEERC7  DS    B              BYTE 7  - EXTENDED ROUTING CODES     @L5A 06106400
WQERC49  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 06107000
WQERC50  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 06107600
WQERC51  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 06108200
WQERC52  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 06108800
WQERC53  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 06109400
WQERC54  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 06110000
WQERC55  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 06110600
WQERC56  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 06111200
WQEERC8  DS    B              BYTE 8  - EXTENDED ROUTING CODES     @L5A 06111800
WQERC57  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 06112400
WQERC58  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 06113000
WQERC59  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 06113600
WQERC60  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 06114200
WQERC61  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 06114800
WQERC62  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 06115400
WQERC63  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 06116000
WQERC64  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 06116600
WQEERC9  DS    B              BYTE 9  - EXTENDED ROUTING CODES     @L5A 06117200
WQERC65  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 06117800
WQERC66  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 06118400
WQERC67  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 06119000
WQERC68  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 06119600
WQERC69  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 06120200
WQERC70  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 06120800
WQERC71  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 06121400
WQERC72  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 06122000
WQEERC10 DS    B              BYTE 10 - EXTENDED ROUTING CODES     @L5A 06122600
WQERC73  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 06123200
WQERC74  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 06123800
WQERC75  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 06124400
WQERC76  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 06125000
WQERC77  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 06125600
WQERC78  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 06126200
WQERC79  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 06126800
WQERC80  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 06127400
WQEERC11 DS    B              BYTE 11 - EXTENDED ROUTING CODES     @L5A 06128000
WQERC81  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 06128600
WQERC82  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 06129200
WQERC83  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 06129800
WQERC84  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 06130400
WQERC85  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 06131000
WQERC86  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 06131600
WQERC87  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 06132200
WQERC88  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 06132800
WQEERC12 DS    B              BYTE 12 - EXTENDED ROUTING CODES     @L5A 06133400
WQERC89  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 06134000
WQERC90  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 06134600
WQERC91  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 06135200
WQERC92  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 06135800
WQERC93  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 06136400
WQERC94  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 06137000
WQERC95  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 06137600
WQERC96  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 06138200
WQEERC13 DS    B              BYTE 13 - EXTENDED ROUTING CODES     @L5A 06138800
WQERC97  EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 06139400
WQERC98  EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 06140000
WQERC99  EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 06140600
WQERC100 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 06141200
WQERC101 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 06141800
WQERC102 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 06142400
WQERC103 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 06143000
WQERC104 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 06143600
WQEERC14 DS    B              BYTE 14 - EXTENDED ROUTING CODES     @L5A 06144200
WQERC105 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 06144800
WQERC106 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 06145400
WQERC107 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 06146000
WQERC108 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 06146600
WQERC109 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 06147200
WQERC110 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 06147800
WQERC111 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 06148400
WQERC112 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 06149000
WQEERC15 DS    B              BYTE 15 - EXTENDED ROUTING CODES     @L5A 06149600
WQERC113 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 06150200
WQERC114 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 06150800
WQERC115 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 06151400
WQERC116 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 06152000
WQERC117 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 06152600
WQERC118 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 06153200
WQERC119 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 06153800
WQERC120 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 06154400
WQEERC16 DS    B              BYTE 16 - EXTENDED ROUTING CODES     @L5A 06155000
WQERC121 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 06155600
WQERC122 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 06156200
WQERC123 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 06156800
WQERC124 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 06157400
WQERC125 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 06158000
WQERC126 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 06158600
WQERC127 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 06159200
WQERC128 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 06159800
WQEKEY   DS    CL8            RETRIEVAL KEY                        @L5A 06160400
WQETOKN  DS    F              TOKEN FOR DOM                        @L5A 06161000
WQECNID  DS    CL4            FULLWORD CONSOLE ID                  @L5A 06161600
WQEOJBID DS    CL8            ORIGINATING JOB ID                   @L5A 06162200
WQEOJBNM DS    CL8            ORIGINATING JOB NAME                 @L5A 06162800
WQEPRTY  DS    AL2            MESSAGE'S PRIORITY                   @L6A 06163400
WQEAUTOT DS    CL8            AUTOMATION TOKEN VALUE           @YA06920 06164000
WQEERFS  DS    0CL4           EXTENDED REQUEST FLAGS  (FROM            X06164600
                              THE USER EXIT TO THE SYSTEM)         @D6C 06165200
WQEERF1  DS    B              REQUEST FLAGS BYTE ONE           @YA08767 06165800
WQEEMRY  EQU   X'80'          PRIMARY SUBSYSTEM CAN                    X06166400
                              ALTER MSG ROUTING                @YA08767 06167000
WQEEMRN  EQU   X'40'          PRIMARY SUBSYSTEM CAN NOT                X06167600
                              ALTER MSG ROUTING                @YA08767 06168200
WQEEMCO  EQU   X'20'          REQUEST TO CHANGE MESSAGE COLOR      @LEA 06168800
WQEEMHI  EQU   X'10'          REQUEST TO CHANGE MESSAGE HIGHLIGHTING   +06169400
                                                                   @LEA 06170000
WQEEMIN  EQU   X'08'          REQUEST TO CHANGE MESSAGE INTENSITY  @LEA 06170600
WQEERF2  DS    B              REQUEST FLAGS BYTE TWO           @YA08767 06171200
WQEERF3  DS    B              REQUEST FLAGS BYTE THREE                 X06171800
                                                               @YA08767 06172400
WQEESJL  EQU   X'80'          REQUEST TO SUPPRESS MESSAGE FROM THE     X06173000
                              JOBLOG                               @PLA 06173600
WQENWTP  EQU   X'40'          REQUEST TO NOT DO WTP PROCESSING (NO     X06174200
                              SYSMSG OR TPUT)                      @PLA 06174800
WQEERF4  DS    B              REQUEST FLAGS BYTE FOUR          @YA08767 06175400
WQEJ3RTC DS    B              JES3 GLOBAL ROUTING - FOR USE BY         X06176000
                              JES3 ONLY                        @YA10055 06176600
WQEJ3MRC DS    B              GLOBAL MESSAGE ROUTING CONTROLS -        X06177200
                              FOR USE BY JES3 ONLY             @YA10055 06177800
WQEJ3CON DS    BL2            JES3 CONSOLE ID (FOR MINOR WQE           X06178400
                              PROCESSING) -                            X06179000
                              FOR USE BY JES3 ONLY             @YA10055 06179600
WQECNNME DS    CL8            CONSOLE NAME                         @L7A 06180200
WQECART  DS    CL8            CART TOKEN                           @L8A 06180800
WQEXIF   DS    0CL2           MISCELLANEOUS AND MINOR ERROR            X06181400
                              INFORMATION FLAGS                    @L9A 06182000
WQEXIF1  DS    B              MISC AND MINOR ERROR FLAG BYTE 1     @L9A 06182600
WQEXTTR  EQU   BIT0           MESSAGE TEXT WAS TRUNCATED           @L9A 06183200
WQEXNVT  EQU   BIT1           INVALID USER EXIT TEXT MODIFICATION  @L9A 06183800
WQEXMER  EQU   BIT2           MUTUALLY EXCLUSIVE USER EXIT             X06184400
                              REQUESTS MADE                        @L9A 06185000
WQEXIRM  EQU   BIT3           INCOMPATIBLE USER EXIT REQUESTS MADE @L9A 06185600
WQEDMDB  EQU   BIT4           DOM MDBS HAVE BEEN BUILT             @06C 06186200
WQEXIF2  DS    B              MISC AND MINOR ERROR FLAG BYTE 2     @LFC 06186800
WQEQONLY EQU   BIT0           REISSUED WQE VIA WQEBLK ON SAME SYS  @P4A 06187400
WQEAMRFO EQU   BIT1           WQE IS FOR AMRF PURPOSES ONLY        @D5A 06188000
WQEAMRFA EQU   BIT2           AMRF IS ACTIVE ON ISSUING SYSTEM     @D5A 06188600
WQEQD    EQU   BIT3           WQE WENT THROUGH QUEUEING ALREADY    @D5A 06189200
WQEWTPR  EQU   BIT4           WTP REQUEST - ROUTE CODE 11 WAS ON       X06189800
                              AFTER CALLING WTO USER EXIT          @PAM 06190400
WQEMFR   EQU   BIT5           WQE WAS MODIFIED FOR REISSUE BY QUEUING  X06191000
                                                                   @PCA 06191600
WQEAMRFR EQU   BIT6           ISSUED FOR AMRF REFRESH              @PFA 06192200
WQEQTSYS EQU   BIT7           QUEUE MESSAGE JUST ON THIS SYSTEM    @01A 06192800
WQEXTUSE DS    F              EXTENDED MCS QUEUER USE COUNT        @LAA 06193400
WQESRCPT DS    A              POINTER TO SAVED SYSIDS USED FOR         X06194000
                              CONNECTING WTO MESSAGES IN A SYSPLEX @LBA 06194600
WQEBENIP DS    B              BRANCH ENTRY/NIP FLAGS               @LIM 06195200
WQEDOMD  EQU   BIT0           MESSAGE HAS PREVIOUSLY BEEN DOM'D    @LIM 06195800
WQENBEW  EQU   BIT1           WQE CREATED BY NIP OR BE WTO         @LIM 06196400
WQENHABD EQU   BIT2           HAS ALREADY BEEN DISPLAYED           @LIM 06197000
WQEASCB  EQU   BIT3           ASCB SPECIFIED                       @PKA 06197600
WQEQDSYS DS    B              WQE DESTINATIONS COUNTER             @P4A 06198200
WQECASEL DS    CL1            MESSAGE COLOR                        @LEA 06198800
WQEHASEL DS    CL1            MESSAGE HIGHLIGHTING                 @LEA 06199400
WQEIASEL DS    CL1            MESSAGE INTENSITY                    @LEA 06200000
*******************************************************************@LHA 06200600
*     MISCELLANEOUS ROUTING INFORMATION                            @LHA 06201200
*                                                                  @PAA 06201800
*  NOTE - ANY FIELDS ADDED HERE MUST ALSO BE ADDED IN THE          @PAA 06202400
*         FOLLOWING:                                               @PAA 06203000
*         UCM, ODTE, RCTB, MDB                                     @PAA 06203600
*******************************************************************@LHA 06204200
WQEMISC  DS    B              MISCELLANEOUS ROUTING INFORMATION    @LHA 06204800
WQEUD    EQU   BIT0           DISPLAY UD MESSAGES                  @LHA 06205400
WQEFUDO  EQU   BIT1           DISPLAY ONLY UD MESSAGES             @LHA 06206000
WQEFIDO  EQU   BIT2           QUEUE BY ID ONLY                     @PBA 06206600
WQEAUTO  EQU   BIT3           QUEUE BY AUTOMATION                  @LJA 06207200
WQEHC    EQU   BIT4           QUEUE BY HARDCOPY                    @LMA 06207800
WQETSNT  DS    XL2            TOTAL COUNT OF TDPS SENT OUT FOR THIS    X06208400
                              MESSAGE                              @PCC 06209000
WQERPYIB DS    F              BINARY REPLY ID                      @D4A 06209600
WQETS3   DS    BL4            STCK TIME STAMP                      @PEA 06210200
*                             Note - if task has been in a wait    @PMA 06210300
*                             for resources, this is the time      @PMA 06210400
*                             after returning from the wait        @PMA 06210500
WQEFTOD  DS    BL4            AMRF FAILURE TIME                    @PFC 06210800
WQEKQLST DS    0CL8           K Q CONSOLE ID LIST                  @PBA 06211400
WQEKQL1  DS    F              K Q CONSOLE ID 1                     @PBA 06212000
WQEKQL2  DS    F              K Q CONSOLE ID 2                     @PBA 06212600
WQERIDL  DS    AL1            LENGTH OF REPLY ID IN MESSAGE TEXT   @LOA 06213200
WQEMISCC DS    B              MISCELLANEOUS CONTROL PROGRAM FLAGS  @03A 06213800
WQESPVD  EQU   BIT0           WQE BACKLOG MESSAGE                  @03A 06214400
WQEPRIV  EQU   BIT1           Original issuer was privileged       @03A 06215000
WQEQNLY  EQU   BIT2           Send to the console and nowhere      @05A 06215600
*                             else.                                @05A 06216200
WQECENT  DS    CL2            Century portion of date, in EBCDIC   @04A 06216800
WQELTOD  DS    BL4            Reserved - only used in major WQE    @02A 06217400
WQEL     EQU   *              END OF WQE                                06218000
WQESIZE  EQU   WQEL-WQE       LENGTH OF WQE                             06218600
         EJECT                                                          06250002
*********************************************************************** 06300002
*                                                                     * 06350002
*                        MAJOR WQE                                    * 06400002
*                                                                     * 06450002
*********************************************************************** 06500002
         SPACE                                                          06550002
         AIF   ('&DSECT' EQ 'YES' AND '&FORMAT' EQ 'NEW').WQE0100       06560000
         ORG   WQE                                                      06600002
         SPACE                                                          06650002
         AGO   .WQE0200                                                 06660000
.WQE0100 ANOP                                                           06670000
WQEMAJ   DSECT , -            MAJOR WQE                                 06680000
.WQE0200 ANOP                                                           06690000
WMJM     EQU   * -            START OF MAJOR WQE                        06700002
WMJMEXT  DS    A              POINTER TO NEXT WQE                  @L6C 06710000
         SPACE                                                          06950002
WMJMMLW  DS    B -            MLWTO FLAGS                               07000002
WMJMMLWA EQU   BIT0 -         DO NOT QUEUE MLWTO TO CONSOLES            07050002
WMJMMLWB EQU   BIT1 -         MAJOR WQE                                 07100002
WMJMMLWC EQU   BIT2 -         MINOR WQE                                 07150002
WMJMMLWD EQU   BIT3 -         CHAIN ALTERED                             07200002
WMJMMLWE EQU   BIT4 -         WTL ISSUED                                07250002
WMJMMLWF EQU   BIT5 -         QUEUEING TO START AT TOP OF CHAIN         07300002
WMJMMLWG EQU   BIT6 -         SERVICE THIS CHAIN                        07350002
WMJMMLWH EQU   BIT7 -         MINOR WQE QUEUED HAS NO TEXT              07400002
         SPACE                                                          07450002
WMJMAREA DS    C -            AREA ID                                   07500002
WMJMTXTL DS    H -            LENGTH OF TEXT                            07550002
WMJMRTCT DS    H              ROUTED WQE COUNT                     @L5C 07560000
WMJMUC   DS    H              USE COUNT                            @L6C 07570000
WMJMPAD  DS    C -            BLANK                              Y02710 07580000
WMJMTS   DS    CL8 -          TIME STAMP                         Y02710 07590000
WMJMPAD1 DS    C -            BLANK                              Y02710 07600000
WMJMJBNM DS    CL8 -          JOBNAME INSERTED BY SUBSYSTEM      Y02710 07610000
WMJMPAD2 DS    C -            BLANK                              Y02710 07620000
WMJMTXT  DS    CL72 -         MESSAGE TEXT (MAXIMUM OF 72 BYTES)        07800002
WMJMHCID DS    CL4 -          HARDCOPY ID                               07850002
WMJMPAD3 DS    C -            BLANK INSERTED SO THAT REMAINING     @09C 07855700
*                             FIELDS ARE ON A WORD BOUNDARY        @09C 07861400
*                             Note, this field was used in OW26748 @09C 07867100
*                             do not reuse                         @09C 07872800
WMJMRESA DS    2F -          DUMMY MINOR CREATED BY PURGE OS/VS2 Y02710 07878500
WQERSV29 DS    F -            RESERVED                           Y02710 07884200
WQERSV30 DS    H -            RESERVED                                  07890002
         SPACE                                                          07902002
WMJMSER  DS    0BL2 -         LINE CONTROL FLAGS                        07950002
WMJMSER1 DS    B -            1ST BYTE OF LINE CONTROL FLAGS            08000002
WMJMSERA EQU   BIT0 -         C LINE IN MAJOR WQE                       08050002
WMJMSERB EQU   BIT1 -         ONE LABEL LINE FOUND                      08100002
WMJMSERC EQU   BIT2 -         TWO LABEL LINES FOUND                     08150002
WMJMSERD EQU   BIT3 -         LAST TYPE WAS CONTROL LINE                08200002
WMJMSERE EQU   BIT4 -         LAST TYPE WAS LABEL LINE                  08250002
WQERSV31 EQU   BIT5,,C'X' -   RESERVED                                  08260002
WQERSV32 EQU   BIT6,,C'X' -   RESERVED                                  08270002
WQERSV33 EQU   BIT7,,C'X' -   RESERVED                                  08280002
WMJMSER2 DS    B -            2ND BYTE OF LINE CONTROL FLAGS            08300002
         SPACE                                                          08350002
WQERSVD2 DS    BL8 -          RESERVED                         @ZA38566 08360000
WQERSV34 DS    XL2 -          RESERVED  ***WMJMRESB***                  08450002
         SPACE                                                          08500002
WMJMLTYP DS    0BL2 -         LINE TYPE FLAGS                           08550002
WMJMLTY1 DS    B -            1ST BYTE OF LINE TYPE FLAGS               08600002
WMJMLTYA EQU   BIT0 -         CONTROL LINE                              08650002
WMJMLTYB EQU   BIT1 -         LABEL LINE                                08700002
WMJMLTYC EQU   BIT2 -         DATA LINE                          ICB433 08750002
WMJMLTYD EQU   BIT3 -         END LINE                           ICB433 08752002
WQERSV35 EQU   BIT4,,C'X' -   RESERVED                                  08762002
WQERSV36 EQU   BIT5,,C'X' -   RESERVED                                  08772002
WQERSV37 EQU   BIT6,,C'X' -   RESERVED                                  08782002
WQERSV38 EQU   BIT7,,C'X' -   RESERVED                                  08792002
WMJMLTY2 DS    B -            2ND BYTE OF LINE TYPE FLAGS               08800002
         SPACE                                                          08850002
WMJMMIN  DS    A -            ADDRESS OF FIRST MINOR WQE                08900002
WMJMAECB DS    BL4 -          ECB USED IN MLWTO PROCESSING       Y02710 08907500
WMJMMSGN DS    CL4 -          MLWTO ID                           Y02710 08915000
         SPACE                                                          08922500
WMJMECBF DS    B -            STATUS FLAGS                     @ZA38566 08930000
WMJMWAIT EQU   BIT0 -         USER IS WAITING ON WMJMAECB        Y02710 08937500
WMJMMAJD EQU   BIT1 -         SUBSYSTEM OR USERS EXIT ASKED TO         *08945000
                              DELETE THIS MLWTO                  Y02710 08952500
WMJMCONS EQU   BIT2       -   FRAME FULL CONTROL BIT           @ZA38566 08960000
WMJMPSB1 EQU   BIT3           SAVE AREA FOR COMMUNICATION BIT PASSED   *08967500
                              TO THE PRIMARY SUBSYSTEM             @L1A 08975000
WMJMRV9A EQU   BIT4           RESERVED                             @D6C 08982500
WMJMWTP  EQU   BIT5           MAJOR WQE TEXT HAS BEEN PUT/TPUT         *08990000
                              BY IEEJB840 - DON'T DO IT AGAIN      @P5C 08997500
WQERSVD6 EQU   BIT6,,C'X' -   RESERVED                           Y02710 09005000
WQERSVD7 EQU   BIT7,,C'X' -   RESERVED                           Y02710 09012500
WQERSVD8 DS    XL3 -          RESERVED                           Y02710 09020000
         SPACE                                                          09027500
WQERSVA4 DS    F -            RESERVED                           Y02710 09035000
WQERSVA5 DS    F -            RESERVED                           Y02710 09042500
         SPACE                                                          09050002
WMJMDSP  DS    B -            DISPOSITION FLAGS                         09100002
WMJMDSPA EQU   BIT0 -         PURGE THIS WQE                            09150002
WMJMDSPB EQU   BIT1 -         QUEUE WQE TO HARDCOPY                     09200002
WMJMDSPC EQU   BIT2 -         MUST BE ZERO                              09250002
WMJMDSPD EQU   BIT3 -         QUEUED TO HARDCOPY                        09300002
WMJMDSPE EQU   BIT4 -         MUST BE ZERO                              09350002
WMJMDSPF EQU   BIT5 -         MESSAGE TO BE DOM'ED               Y02710 09360000
WMJMDSPG EQU   BIT6 -         PROCESSING TEMPORARILY SUSPENDED   Y02710 09370000
WMJMDSPH EQU   BIT7 -         MSG ISSUED BY AUTH USER            Y02710 09380000
         SPACE                                                          09400002
WMJMASID DS    CL2 -          ASID OF USER                       Y02710 09410000
         SPACE                                                          09500002
WMJMBUF  DS    B -            BUFFER STATUS FLAGS                       09550002
WMJMBUFA EQU   BIT0 -         WQE AVAILABLE                             09600002
WMJMBUFB EQU   BIT1 -         WQE IN USE                                09650002
WMJMBUFC EQU   BIT2 -         READY FOR HARDCOPY                 Y02710 09660000
WMJMBUFD EQU   BIT3 -         WQE ACQUIRED BY GETMAIN                   09700002
WMJMBUFE EQU   BIT4 -         WQE SERVICED                              09750002
WMJMBUFF EQU   BIT5 -         TPUT TO DO                         Y02710 09760000
WMJMBUFG EQU   BIT6 -         WQE SUPPRESSED                   @G384P2L 09770000
WMJMTRCD EQU   BIT7 -         MAJOR WQE HAS BEEN MASTER TRACED @G64MP2D 09780000
         SPACE                                                          09800002
         DS    0F -                                                     09810002
WMJMTCB  DS    A -            ADDRESS OF ISSUER'S TCB            Y02710 09820000
WMJMSEQ# DS    0FL4           WTO SEQUENCE NUMBER (DOM/CONNECT ID)      09830000
*                                                              @YA06025 09840000
WMJMSID  DS    FL1            SYSTEM ID                            @L5A 09850000
WMJMSEQ  DS    FL3            24-BIT SEQUENCE NUMBER           @YA06025 09860000
         SPACE                                                          10000002
WMJMCS   DS    0BL2 -         MCS FLAGS                                 10050002
WMJMCS1  DS    B -            1ST BYTE OF MCS FLAGS                     10100002
WMJMCS1A EQU   BIT0 -         ROUTING AND DESCRIPTOR CODES EXIST        10110000
WMJMCS1B EQU   BIT1 -         QUEUE BY ID TO ACTIVE CONSOLE             10200002
WMJMCS1C EQU   BIT2 -         COMMAND RESPONSE                          10250002
WMJMCS1D EQU   BIT3 -         MESSAGE TYPE FIELD PRESENT                10300002
WMJMCS1E EQU   BIT4 -         ACCEPTED REPLY TO A WTOR                  10350002
WMJMCS1F EQU   BIT5 -         BROADCAST (ROUTE TO ACTIVE CONSOLES)      10360000
WMJMCS1G EQU   BIT6 -         QUEUE TO HARDCOPY ONLY                    10450002
WMJMCS1H EQU   BIT7 -         QUEUE UNCONDITIONALLY BY ID               10500002
*                             TO CONSOLE                                10550002
WMJMCS2  DS    B -            2ND BYTE OF MCS FLAGS                     10600002
WMJMCS2A EQU   BIT0 -         DO NOT TIME STAMP                         10650002
WMJMCS2B EQU   BIT1 -         MLWTO                                     10700002
WMJMCS2C EQU   BIT2           PRIMARY SUBSYSTEM USE ONLY:          @L5C 10707100
*                             JES3: DO NOT LOG MINOR WQES IF THE   @L5A 10714200
*                                   MAJOR IS NOT HARDCOPIED        @L5A 10721300
*                             JES2: NOT USED                       @L5A 10728400
WMJMCS2D EQU   BIT3           EXTENDED WPL FORMAT (WPX) EXISTS     @L5C 10735500
WMJMCS2E EQU   BIT4 -         THE MESSAGE IS AN OPERATOR COMMAND   @L4C 10742600
WMJMCS2F EQU   BIT5 -         BYPASS HARDCOPY QUEUEING                  10750002
WMJMCS2G EQU   BIT6           WQEBLK KEYWORD SPECIFIED             @L5C 10760000
WMJMCS2H EQU   BIT7           RESERVED                             @L5C 10770000
         SPACE                                                          10800002
WMJMMT   DS    0BL2 -         MESSAGE TYPE FLAGS                        10850002
WMJMMT1  DS    B -            1ST BYTE OF MESSAGE TYPE FLAGS            10900002
WMJMMT1A EQU   BIT0 -         DISPLAY JOBNAMES                          10950002
WMJMMT1B EQU   BIT1 -         DISPLAY STATUS                            11000002
WQERSVA6 EQU   BIT2,,C'X' -   RESERVED   ***WMJMMT1C***          Y02710 11010000
WMJMMT1D EQU   BIT3 -         MUST BE ZERO                              11100002
WQERSV50 EQU   BIT4,,C'X' -   RESERVED                                  11110002
WMJMMT1F EQU   BIT5 -         MONITOR SESS                              11150002
WQERSV51 EQU   BIT6,,C'X' -   RESERVED                                  11160002
WQERSV52 EQU   BIT7,,C'X' -   RESERVED                                  11170002
WMJMMT2  DS    B -            2ND BYTE OF MESSAGE TYPE FLAGS            11200002
         SPACE                                                          11250002
WMJMRTC  DS    0BL2 -         ROUTING CODES                             11260000
WMJMRCT1 DS    B -            1ST BYTE OF ROUTING CODES                 11350002
WMJMRCTA EQU   BIT0 -         MASTER CONSOLE                            11400002
WMJMRCTB EQU   BIT1 -         MASTER CONSOLE INFORMATIONAL              11450002
WMJMRCTC EQU   BIT2 -         TAPE POOL                                 11500002
WMJMRCTD EQU   BIT3 -         DIRECT ACCESS POOL                        11550002
WMJMRCTE EQU   BIT4 -         TAPE LIBRARY                              11600002
WMJMRCTF EQU   BIT5 -         DISK LIBRARY                              11650002
WMJMRCTG EQU   BIT6 -         UNIT RECORD POOL                          11700002
WMJMRCTH EQU   BIT7 -         TELEPROCESSING CONTROL                    11750002
WMJMRCT2 DS    B -            2ND BYTE OF ROUTING CODES                 11800002
WMJMRCTI EQU   BIT0 -         SYSTEM SECURITY                           11850002
WMJMRCTJ EQU   BIT1 -         SYSTEM/ERROR MAINTENANCE                  11900002
WMJMRCTK EQU   BIT2 -         PROGRAMMER INFORMATION                    11950002
WMJMRCTL EQU   BIT3 -         EMULATOR INFORMATION                      12000002
WMJMRCTM EQU   BIT4 -         USER ROUTING CODE                         12050002
WMJMRCTN EQU   BIT5 -         USER ROUTING CODE                         12100002
WMJMRCTO EQU   BIT6 -         USER ROUTING CODE                         12150002
WMJMRCTP EQU   BIT7           USER ROUTING CODE                    @L5C 12160000
WMJCHAR1 DS    CL1            1ST CHARACTER OF TEXT                @P3C 12170000
WMJMFLG3 DS    B              MISCELLANEOUS FLAGS                  @LDC 12180000
WMJDLVRD EQU   BIT0           WQE HAS BEEN DELIVERED TO A CONSOLE ON   +12190000
                              THIS SYSTEM                          @LDA 12200000
WMJDNDWQ EQU   BIT1 -         DO NOT DELETE WTOR UNTIL THIS BIT IS OFF +12210000
                                                                  @LDA  12220000
WMJNSYL  EQU   BIT2 -         DO NOT SEND THIS MESSAGE TO SYSLOG  @D7A  12230000
WMJJ3B1  EQU   BIT3 -         BIT FOR USE BY JES3 ONLY            @D7A  12240000
WMJJ3B2  EQU   BIT4 -         BIT FOR USE BY JES3 ONLY            @D7A  12250000
         SPACE                                                          12300002
WMJMUID  DS    C -            UCM ENTRY ID                              12350002
WMJFLG1  DS    B -            MISCELLANEOUS FLAGS              @G38OP2L 12359300
WMJFLG11 EQU   BIT0 -         THIS MESSAGE WAS PROCESSED WHILE MPF WAS *12368600
                              ACTIVE AND HARDCOPY WAS AVAILABLE        *12377900
                                                               @G38OP2L 12387200
WMJMRETN EQU   BIT1 -         MSG IS TO BE RETAINED BY AMRF        @P1C 12396500
WMJMNMOD EQU   BIT2           THE CHARACTERISTICS OF THE MESSAGE MAY   X12405800
                              NOT BE MODIFIED BY THE PRIMARY           X12415100
                              SUBSYSTEM                            @L6C 12424400
WMJMSQMC EQU   BIT3           ACTION MESSAGE NOT QUEUED TO ANY         X12433700
                              CONSOLE - DEFAULT TO MASTER CONSOLE  @L6C 12443000
WMJNOJLG EQU   BIT4           SUPPRESS FROM JOB LOG                @L6C 12452300
WMJAUTOV EQU   BIT5 -         INDICATES MPF AUTO SUPPORTED     @YA06920 12461600
WMJPPNA  EQU   BIT6 -         PROBLEM PROGRAM NONACTION MAJOR  @YA15064 12470900
WMJMRISS EQU   BIT7 -         REISSUED MESSAGE                 @YA08767 12480200
WQERSV54 DS    XL2 -          RESERVED - MAPS TO WQERPYID          @D4C 12489500
         SPACE                                                          12500002
WMJMDEC  DS    0BL4 -         DESCRIPTOR CODES                          12550002
WMJMDEC1 DS    B -            1ST BYTE OF DESCRIPTOR CODES              12600002
WMJMDECA EQU   BIT0 -         SYSTEM FAILURE MESSAGE                    12650002
WMJMDECB EQU   BIT1 -         IMMEDIATE ACTION REQUIRED MESSAGE         12700002
WMJMDECC EQU   BIT2 -         EVENTUAL ACTION REQUIRED MESSAGE          12750002
WMJMDECD EQU   BIT3 -         SYSTEM STATUS MESSAGE                     12800002
WMJMDECE EQU   BIT4 -         IMMEDIATE COMMAND RESPONSE MESSAGE        12850002
WMJMDECF EQU   BIT5 -         JOB STATUS MESSAGE                        12900002
WMJMDECG EQU   BIT6           APPLICATION PROGRAM/PROCESSOR MESSAGE,   *12910000
                              OR DELETE AT TASK TERMINATION        @L5C 12920000
WMJMDECH EQU   BIT7 -         OUT-OF-LINE MESSAGE                       13000002
WMJMDEC2 DS    B -            2ND BYTE OF DESCRIPTOR CODES              13050002
WMJMDECI EQU   BIT0           OPERATOR REQUEST                     @L5C 13060000
WMJMDECJ EQU   BIT1           DYNAMIC STATUS DISPLAY               @L5C 13070000
WMJMDECK EQU   BIT2 -         CRITICAL EVENTUAL ACTION MSG -   @G64DPSS 13080000
*                             DESCRIPTOR CODE 11               @G64DPSS 13090000
WMJMDECL EQU   BIT3 -         DELIVERED BUT NOT HELD               @LHC 13100000
WMJMDECM EQU   BIT4 -         PREVIOUSLY AUTOMATED                 @LJC 13110000
WQERSV59 EQU   BIT5,,C'X' -   RESERVED                                  13142002
WQERSV60 EQU   BIT6,,C'X' -   RESERVED                                  13144002
WQERSV61 EQU   BIT7,,C'X' -   RESERVED                                  13146002
         SPACE 1                                               @G64DPSS 13146400
WMJMDEC3 DS    B -            Reserved for 3rd byte of descriptor  @0AC 13146800
*                             codes                                @0AC 13147200
         SPACE 1                                                        13147600
WMJMCSCT DS    XL1            Count of MCS-only consoles on the    @0AC 13148000
*                             issuing system to which a message    @0AC 13148400
*                             is queued                            @0AC 13148800
         SPACE 1                                                        13149200
WMJMJTCB DS    F -            ADDRESS OF JOB STEP TCB            Y02710 13149600
WMJMVRSN DS    X              VERSION LEVEL                        @L1A 13150000
WMJMFLG2 DS    B              MISC FLAGS BYTE 2                    @LAC 13150400
WMJMHNDL EQU   BIT0           THIS MSG WILL BE DISPLAYED BY            X13150800
                              ANOTHER CONSOLE HANDLER. DO NOT          X13151200
                              FORCE MSG TO MASTER CONSOLE IF           X13151600
                              NOT ROUTED.                      @YA09374 13152000
WMJMLCPL EQU   BIT1           MULTILINE IS COMPLETE                @LAA 13152400
WMJMFORN EQU   BIT2           FOREIGN WQE                          @LBA 13152800
WMJMTRAN EQU   BIT3           WQE HAS BEEN TRANSPORTED TO ANOTHER      *13153200
                              SYSTEM                               @LBA 13153600
WMJSUPSJ EQU   BIT4           ON = DON'T DISPLAY SYSTEM NAME OR        *13154000
                              JOB NAME                             @LDA 13154400
WMJQXSYS EQU   BIT5           ON = QUEUED TO A CONSOLE ON ANOTHER      *13154800
                              SYSTEM IN THE SYSPLEX                @P6A 13155200
WMJQEXT  EQU   BIT6           ON = QUEUED TO AN EXTENDED CLASS     @P7A 13155600
WMJQMCS  EQU   BIT7           ON = QUEUED TO AN MCS CONSOLE        @P7A 13156000
WMJMCSE  DS    0CL2           EXTENDED MCS FLAGS                   @L5A 13156400
WMJMCE1  DS    B              FIRST BYTE                           @L5A 13156800
WMJEBUSY EQU   BIT0           RETURN WITH BUSY RETURN CODE IF          *13157200
                              BUFFER LIMITATIONS EXCEEDED          @L5A 13157600
WMJECONS EQU   BIT1           FOUR-BYTE CONSOLE ID SPECIFIED       @L5A 13158000
WMJEDOMI EQU   BIT2           DOM ID WAS SPECIFIED             @YA07436 13158400
WMJECONN EQU   BIT3           CONNECT ID WAS SPECIFIED             @L5A 13158800
WMJEWTOR EQU   BIT4           WTOR WITH EXTENDED PARAMETER LIST    @L5A 13159200
WMJEPRIO EQU   BIT5           PRIORITY WAS SPECIFIED               @L5A 13159600
WMJMCNM  EQU   BIT6           CONSOLE NAME SPECIFIED               @L7A 13160000
WMJMCE2  DS    B              SECOND BYTE OF EXT MCS FLAGS         @L5A 13160400
WMJMTXTA EQU   BIT0           UNUSED IN WQE - TEXT ADDRESS             X13160800
                              PARAMETER SPECIFIED ON WTO MACRO     @L9A 13161200
WMJMRV99 EQU   BIT1           RESERVED                             @D1A 13161600
WMJMRV9B EQU   BIT2           RESERVED                             @D6C 13162000
WMJMRV9C EQU   BIT3           RESERVED                             @D6C 13162400
WMJMRV1A EQU   BIT4           RESERVED                             @LFA 13162800
WMJMRV1B EQU   BIT5           RESERVED                             @LFA 13163200
WMJMRV1C EQU   BIT6           RESERVED                             @LFA 13163600
WMJMRV1D EQU   BIT7           RESERVED                             @LFA 13164000
WMJMSNM  DS    CL8            THE NAME OF THE SYSTEM ON WHICH          X13164400
                              THIS MESSAGE WAS ISSUED              @L5C 13164800
WMJMDATE DS    CL5            DATE WTO ISSUED                      @L4C 13165200
WMJMTS2  DS    CL3            TENTHS AND HUNDREDTHS OF A SECOND    @L4A 13165600
WMJMXMOD DS    0CL4           COPY OF REQUEST FLAGS (CTXTRFLG) FROM    X13166000
                              THE WTO USER EXIT INTERFACE          @L3A 13166400
WMJMFLGS DS    0CL3           COMM TASK USER EXIT REQUESTS         @L3A 13166800
WMJMRFB1 DS    B              REQUEST FLAGS BYTE ONE               @L3A 13167200
WMJMRCMT EQU   BIT0           CHANGE THE MESSAGE TEXT              @L3A 13167600
WMJMRCRC EQU   BIT1           CHANGE THE ROUTING CODE(S)           @L3A 13168000
WMJMRCDC EQU   BIT2           CHANGE THE DESCRIPTOR CODE(S)        @L3A 13168400
WMJMRQPC EQU   BIT3           QUEUE TO A PARTICULAR ACTIVE CONSOLE @L3A 13168800
WMJMRQUN EQU   BIT4           QUEUE TO A PARTICULAR CONSOLE            X13169200
                              UNCONDITIONALLY                      @L3A 13169600
WMJMRQRC EQU   BIT5           QUEUE BY ROUTING CODES ONLY          @L3A 13170000
WMJMRCCN EQU   BIT6           CHANGE THE CONSOLE ID                @L3A 13170400
WMJMRPML EQU   BIT7           PROCESS MINOR LINES                  @L3A 13170800
WMJMRFB2 DS    B              REQUEST FLAGS BYTE TWO               @L3A 13171200
WMJMRDTM EQU   BIT0           DELETE THE MESSAGE                   @L3A 13171600
WMJMROMS EQU   BIT1           OVERRIDE MPF SUPPRESSION             @L3A 13172000
WMJMRFHC EQU   BIT2           FORCE HARDCOPY                       @L3A 13172400
WMJMRFNC EQU   BIT3           FORCE NO HARDCOPY                    @L3A 13172800
WMJMRHCO EQU   BIT4           FORCE HARDCOPY ONLY                  @L3A 13173200
WMJMRBCA EQU   BIT5           BROADCAST MESSAGE TO ACTIVE CONSOLES @L3A 13173600
WMJMRBCN EQU   BIT6           DO NOT BROADCAST MESSAGE TO ACTIVE       X13174000
                              CONSOLES                             @L3A 13174400
WMJMRNRT EQU   BIT7           AMRF IS NOT TO RETAIN THIS MSG       @P1A 13174800
WMJMRFB3 DS    B              REQUEST FLAGS BYTE THREE             @P1C 13175200
WMJMRRET EQU   BIT0           AMRF IS TO RETAIN THIS MSG           @P1A 13175600
WMJMRCKY EQU   BIT1           CHANGE THE RETRIEVAL KEY             @L5A 13176000
WMJMRCFC EQU   BIT2           CHANGE THE 4-BYTE CONSOLE ID         @L5A 13176400
WMJMRCMF EQU   BIT3           CHANGE THE MESSAGE TYPE FLAGS        @L5A 13176800
WMJRANO  EQU   BIT4           AUTOMATION IS NOT REQUIRED       @YA06920 13177200
WMJRAYS  EQU   BIT5           AUTOMATION IS REQUIRED AND/OR            X13177600
                              AUTOMATION TOKEN UPDATED         @YA06920 13178000
WMJMQHCO EQU   BIT6           MESSAGE ISSUED HARDCOPY ONLY     @YA22959 13178400
WMJMHUD  EQU   BIT7           UD TO HARDCOPY FLAG                  @D3A 13178800
WMJMSUPB DS    B              SUPPRESSION BYTE                     @L3A 13179200
WMJMSNSV EQU   BIT0           NOT SERVICED BY ANY WTO USER EXIT        X13179600
                              ROUTINE                              @L3A 13180000
WMJMSEER EQU   BIT1           ESTAE ERROR IN IEAVX600              @L3A 13180400
WMJMSNSI EQU   BIT2           NOT SERVICED BECAUSE OF AN               X13180800
                              INCOMPATIBLE REQUEST                 @L3A 13181200
WMJMSAUT EQU   BIT3           INDICATES AUTOMATION SPECIFIED   @YA06920 13181600
WMJMSQED EQU   BIT4           NOT QUEUED TO ANY CONSOLE            @L3A 13182000
WMJMSSSI EQU   BIT5           SUPPRESSED BY A SUBSYSTEM            @L3A 13182400
WMJMSWTO EQU   BIT6           SUPPRESSED BY A WTO USER EXIT            X13182800
                              ROUTINE                              @L3A 13183200
WMJMSMPF EQU   BIT7           SUPPRESSED BY MPF                    @L3A 13183600
WMJMMLVL DS    0H             MESSAGE LEVEL MASK FOR QUEUING       @L2A 13184000
WMJMML1  DS    B              FIRST BYTE OF LEVEL INDICATORS       @L2A 13184400
WMJMMLR  EQU   BIT0           WTOR                                 @L2A 13184800
WMJMMLIA EQU   BIT1           IMMEDIATE ACTION MESSAGE             @L2A 13185200
WMJMMLCE EQU   BIT2           CRITICAL EVENTUAL ACTION MESSAGE     @L2A 13185600
WMJMMLE  EQU   BIT3           EVENTUAL ACTION MESSAGE              @L2A 13186000
WMJMMLI  EQU   BIT4           INFORMATIONAL MESSAGE                @L2A 13186400
WMJMMLBC EQU   BIT5           BROADCAST MESSAGE                    @L2A 13186800
WMJMML2  DS    B              RESERVED                             @L2A 13187200
WMJMLENG DS    H              WQE SIZE                         @YA08767 13187600
WMJDSQN  DS    F              UNIVERSAL DISPLAY SEQUENCE NUMBER    @L5A 13188000
WMJMERC  DS    0XL16          EXTENDED ROUTING CODES               @L5A 13188400
WMJMRC1  DS    B              BYTE 1  - EXTENDED ROUTING CODES     @L5A 13188800
WMJRC1   EQU   BIT0           MASTER CONSOLE                       @L5A 13189200
WMJRC2   EQU   BIT1           MASTER CONSOLE INFORMATIONAL         @L5A 13189600
WMJRC3   EQU   BIT2           TAPE POOL                            @L5A 13190000
WMJRC4   EQU   BIT3           DIRECT ACCESS POOL                   @L5A 13190400
WMJRC5   EQU   BIT4           TAPE LIBRARY                         @L5A 13190800
WMJRC6   EQU   BIT5           DISK LIBRARY                         @L5A 13191200
WMJRC7   EQU   BIT6           UNIT RECORD POOL                     @L5A 13191600
WMJRC8   EQU   BIT7           TELEPROCESSING CONTROL               @L5A 13192000
WMJMRC2  DS    B              BYTE 2  - EXTENDED ROUTING CODES     @L5A 13192400
WMJRC9   EQU   BIT0           SYSTEM SECURITY                      @L5A 13192800
WMJRC10  EQU   BIT1           SYSTEM/ERROR MAINTENANCE             @L5A 13193200
WMJRC11  EQU   BIT2           PROGRAMMER INFORMATION               @L5A 13193600
WMJRC12  EQU   BIT3           EMULATOR INFORMATION                 @L5A 13194000
WMJRC13  EQU   BIT4           USER ROUTING CODE                    @L5A 13194400
WMJRC14  EQU   BIT5           USER ROUTING CODE                    @L5A 13194800
WMJRC15  EQU   BIT6           USER ROUTING CODE                    @L5A 13195200
WMJRC16  EQU   BIT7           USER ROUTING CODE                    @L5A 13195600
WMJMRC3  DS    B              BYTE 3  - EXTENDED ROUTING CODES     @L5A 13196000
WMJRC17  EQU   BIT0           USER ROUTING CODE                    @L5A 13196400
WMJRC18  EQU   BIT1           USER ROUTING CODE                    @L5A 13196800
WMJRC19  EQU   BIT2           USER ROUTING CODE                    @L5A 13197200
WMJRC20  EQU   BIT3           USER ROUTING CODE                    @L5A 13197600
WMJRC21  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 13198000
WMJRC22  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 13198400
WMJRC23  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 13198800
WMJRC24  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 13199200
WMJMRC4  DS    B              BYTE 4  - EXTENDED ROUTING CODES     @L5A 13199600
WMJRC25  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 13200000
WMJRC26  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 13200400
WMJRC27  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 13200800
WMJRC28  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 13201200
WMJRC29  EQU   BIT4           RESERVED                             @L5A 13201600
WMJRC30  EQU   BIT5           RESERVED                             @L5A 13202000
WMJRC31  EQU   BIT6           RESERVED                             @L5A 13202400
WMJRC32  EQU   BIT7           RESERVED                             @L5A 13202800
WMJMRC5  DS    B              BYTE 5  - EXTENDED ROUTING CODES     @L5A 13203200
WMJRC33  EQU   BIT0           RESERVED                             @L5A 13203600
WMJRC34  EQU   BIT1           RESERVED                             @L5A 13204000
WMJRC35  EQU   BIT2           RESERVED                             @L5A 13204400
WMJRC36  EQU   BIT3           RESERVED                             @L5A 13204800
WMJRC37  EQU   BIT4           RESERVED                             @L5A 13205200
WMJRC38  EQU   BIT5           RESERVED                             @L5A 13205600
WMJRC39  EQU   BIT6           RESERVED                             @L5A 13206000
WMJRC40  EQU   BIT7           RESERVED                             @L5A 13206400
WMJMRC6  DS    B              BYTE 6  - EXTENDED ROUTING CODES     @L5A 13206800
WMJRC41  EQU   BIT0           JOB STATUS MESSAGE               @YA10057 13207200
WMJRC42  EQU   BIT1           GENERAL INFO ABOUT JES2 OR JES3      @L5A 13207600
WMJRC43  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 13208000
WMJRC44  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 13208400
WMJRC45  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 13208800
WMJRC46  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 13209200
WMJRC47  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 13209600
WMJRC48  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 13210000
WMJMRC7  DS    B              BYTE 7  - EXTENDED ROUTING CODES     @L5A 13210400
WMJRC49  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 13210800
WMJRC50  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 13211200
WMJRC51  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 13211600
WMJRC52  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 13212000
WMJRC53  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 13212400
WMJRC54  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 13212800
WMJRC55  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 13213200
WMJRC56  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 13213600
WMJMRC8  DS    B              BYTE 8  - EXTENDED ROUTING CODES     @L5A 13214000
WMJRC57  EQU   BIT0           RESERVED FOR JES USAGE               @L5A 13214400
WMJRC58  EQU   BIT1           RESERVED FOR JES USAGE               @L5A 13214800
WMJRC59  EQU   BIT2           RESERVED FOR JES USAGE               @L5A 13215200
WMJRC60  EQU   BIT3           RESERVED FOR JES USAGE               @L5A 13215600
WMJRC61  EQU   BIT4           RESERVED FOR JES USAGE               @L5A 13216000
WMJRC62  EQU   BIT5           RESERVED FOR JES USAGE               @L5A 13216400
WMJRC63  EQU   BIT6           RESERVED FOR JES USAGE               @L5A 13216800
WMJRC64  EQU   BIT7           RESERVED FOR JES USAGE               @L5A 13217200
WMJMRC9  DS    B              BYTE 9  - EXTENDED ROUTING CODES     @L5A 13217600
WMJRC65  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 13218000
WMJRC66  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 13218400
WMJRC67  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 13218800
WMJRC68  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 13219200
WMJRC69  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 13219600
WMJRC70  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 13220000
WMJRC71  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 13220400
WMJRC72  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 13220800
WMJMRC10 DS    B              BYTE 10 - EXTENDED ROUTING CODES     @L5A 13221200
WMJRC73  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 13221600
WMJRC74  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 13222000
WMJRC75  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 13222400
WMJRC76  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 13222800
WMJRC77  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 13223200
WMJRC78  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 13223600
WMJRC79  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 13224000
WMJRC80  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 13224400
WMJMRC11 DS    B              BYTE 11 - EXTENDED ROUTING CODES     @L5A 13224800
WMJRC81  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 13225200
WMJRC82  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 13225600
WMJRC83  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 13226000
WMJRC84  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 13226400
WMJRC85  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 13226800
WMJRC86  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 13227200
WMJRC87  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 13227600
WMJRC88  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 13228000
WMJMRC12 DS    B              BYTE 12 - EXTENDED ROUTING CODES     @L5A 13228400
WMJRC89  EQU   BIT0           PROCESSOR RELATED MESSAGE            @L5A 13228800
WMJRC90  EQU   BIT1           PROCESSOR RELATED MESSAGE            @L5A 13229200
WMJRC91  EQU   BIT2           PROCESSOR RELATED MESSAGE            @L5A 13229600
WMJRC92  EQU   BIT3           PROCESSOR RELATED MESSAGE            @L5A 13230000
WMJRC93  EQU   BIT4           PROCESSOR RELATED MESSAGE            @L5A 13230400
WMJRC94  EQU   BIT5           PROCESSOR RELATED MESSAGE            @L5A 13230800
WMJRC95  EQU   BIT6           PROCESSOR RELATED MESSAGE            @L5A 13231200
WMJRC96  EQU   BIT7           PROCESSOR RELATED MESSAGE            @L5A 13231600
WMJMRC13 DS    B              BYTE 13 - EXTENDED ROUTING CODES     @L5A 13232000
WMJRC97  EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 13232400
WMJRC98  EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 13232800
WMJRC99  EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 13233200
WMJRC100 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 13233600
WMJRC101 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 13234000
WMJRC102 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 13234400
WMJRC103 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 13234800
WMJRC104 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 13235200
WMJMRC14 DS    B              BYTE 14 - EXTENDED ROUTING CODES     @L5A 13235600
WMJRC105 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 13236000
WMJRC106 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 13236400
WMJRC107 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 13236800
WMJRC108 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 13237200
WMJRC109 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 13237600
WMJRC110 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 13238000
WMJRC111 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 13238400
WMJRC112 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 13238800
WMJMRC15 DS    B              BYTE 15 - EXTENDED ROUTING CODES     @L5A 13239200
WMJRC113 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 13239600
WMJRC114 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 13240000
WMJRC115 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 13240400
WMJRC116 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 13240800
WMJRC117 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 13241200
WMJRC118 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 13241600
WMJRC119 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 13242000
WMJRC120 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 13242400
WMJMRC16 DS    B              BYTE 16 - EXTENDED ROUTING CODES     @L5A 13242800
WMJRC121 EQU   BIT0           DEVICE RELATED MESSAGE               @L5A 13243200
WMJRC122 EQU   BIT1           DEVICE RELATED MESSAGE               @L5A 13243600
WMJRC123 EQU   BIT2           DEVICE RELATED MESSAGE               @L5A 13244000
WMJRC124 EQU   BIT3           DEVICE RELATED MESSAGE               @L5A 13244400
WMJRC125 EQU   BIT4           DEVICE RELATED MESSAGE               @L5A 13244800
WMJRC126 EQU   BIT5           DEVICE RELATED MESSAGE               @L5A 13245200
WMJRC127 EQU   BIT6           DEVICE RELATED MESSAGE               @L5A 13245600
WMJRC128 EQU   BIT7           DEVICE RELATED MESSAGE               @L5A 13246000
WMJMKEY  DS    CL8            RETRIEVAL KEY                        @L5A 13246400
WMJMTOKN DS    F              TOKEN FOR DOM                        @L5A 13246800
WMJMCNID DS    CL4            FULLWORD CONSOLE ID                  @L5A 13247200
WMJMOJBI DS    CL8            ORIGINATING JOB ID                   @L5A 13247600
WMJMOJBN DS    CL8            ORIGINATING JOB NAME                 @L5A 13248000
WMJMPRTY DS    AL2            MESSAGE'S PRIORITY                   @L6A 13248400
WMJAUTOT DS    CL8            AUTOMATION TOKEN VALUE           @YA06920 13248800
WMJERFS  DS    0CL4           EXTENDED REQUEST FLAGS  (FROM            X13249200
                              THE USER EXIT TO THE SYSTEM)         @D6C 13249600
WMJMERF1 DS    B              REQUEST FLAGS BYTE ONE           @YA08767 13250000
WMJEMRY  EQU   X'80'          PRIMARY SUBSYSTEM CAN                    X13250400
                              ALTER MSG ROUTING                @YA08767 13250800
WMJEMRN  EQU   X'40'          PRIMARY SUBSYSTEM CAN NOT                X13251200
                              ALTER MSG ROUTING                @YA08767 13251600
WMJEMCO  EQU   X'20'          REQUEST TO CHANGE MESSAGE COLOR      @LEA 13252000
WMJEMHI  EQU   X'10'          REQUEST TO CHANGE MESSAGE HIGHLIGHTING   +13252400
                                                                   @LEA 13252800
WMJEMIN  EQU   X'08'          REQUEST TO CHANGE MESSAGE INTENSITY  @LEA 13253200
WMJERF2  DS    B              REQUEST FLAGS BYTE TWO           @YA08767 13253600
WMJERF3  DS    B              REQUEST FLAGS BYTE THREE                 X13254000
                                                               @YA08767 13254400
WMJESJL  EQU   X'80'          REQUEST TO SUPPRESS MESSAGE FROM THE     X13254800
                              JOBLOG                               @PLA 13255200
WMJNWTP  EQU   X'40'          REQUEST TO NOT DO WTP PROCESSING (NO     X13255600
                              SYSMSG OR TPUT)                      @PLA 13256000
WMJERF4  DS    B              REQUEST FLAGS BYTE FOUR          @YA08767 13256400
WMJJ3RTC DS    B              JES3 GLOBAL ROUTING - FOR USE BY         X13256800
                              JES3 ONLY                        @YA10055 13257200
WMJJ3MRC DS    B              GLOBAL MESSAGE ROUTING CONTROLS -        X13257600
                              FOR USE BY JES3 ONLY             @YA10055 13258000
WMJJ3CON DS    BL2            JES3 CONSOLE ID (FOR MINOR WQE           X13258400
                              PROCESSING) -                            X13258800
                              FOR USE BY JES3 ONLY             @YA10055 13259200
WMJMCNME DS    CL8            CONSOLE NAME                         @L7A 13259600
WMJMCART DS    CL8            CART ADDRESS                         @L8A 13260000
WMJMXIF  DS    0CL2           MISCELLANEOUS AND MINOR ERROR            X13260400
                              INFORMATION FLAGS                    @L9A 13260800
WMJMXIF1 DS    B              MISC AND MINOR ERROR FLAG BYTE 1     @L9A 13261200
WMJMTXTR EQU   BIT0           MESSAGE TEXT WAS TRUNCATED           @L9A 13261600
WMJMXNVT EQU   BIT1           INVALID USER EXIT TEXT MODIFICATION  @L9A 13262000
WMJMXMER EQU   BIT2           MUTUALLY EXCLUSIVE USER EXIT             X13262400
                              REQUESTS MADE                        @L9A 13262800
WMJMXIRM EQU   BIT3           INCOMPATIBLE USER EXIT REQUESTS MADE @L9A 13263200
WMJMDMDB EQU   BIT4           DOM MDBS HAVE BEEN BUILT             @06C 13263600
WMJMXIF2 DS    B              MISC AND MINOR ERROR FLAG BYTE 2     @LFC 13264000
WMJQONLY EQU   BIT0           REISSUED WQE VIA WQEBLK ON SAME SYS  @P4A 13264400
WMJAMRFO EQU   BIT1           WQE IS FOR AMRF PURPOSES ONLY        @D5A 13264800
WMJAMRFA EQU   BIT2           AMRF IS ACTIVE ON ISSUING SYSTEM     @D5A 13265200
WMJMQD   EQU   BIT3           WQE WENT THROUGH QUEUEING ALREADY    @D5A 13265600
WMJMWTPR EQU   BIT4           WTP REQUEST - ROUTE CODE 11 WAS ON       X13266000
                              AFTER CALLING WTO USER EXIT          @PAM 13266400
WMJMMFR  EQU   BIT5           WQE WAS MODIFIED FOR REISSUE BY QUEUING  X13266800
                                                                   @PCA 13267200
WMJAMRFR EQU   BIT6           ISSUED FOR AMRF REFRESH              @PFA 13267600
WMJQTSYS EQU   BIT7           QUEUE MESSAGE JUST ON THIS SYSTEM    @01A 13268000
WMJMXTUC DS    F              EXTENDED MCS QUEUER USE COUNT        @LAA 13268400
WMJMRCPT DS    A              POINTER TO SAVED SYSIDS USED FOR         X13268800
                              CONNECTING MESSAGES IN A SYSPLEX     @LBA 13269200
WMJBENIP DS    B              BRANCH ENTRY/NIP FLAGS               @LIM 13269600
WMJMDOMD EQU   BIT0           MESSAGE HAS PREVIOUSLY BEEN DOM'D    @LIM 13270000
WMJMNBEW EQU   BIT1           WQE CREATED BY NIP OR BE WTO         @LIM 13270400
WMJMHABD EQU   BIT2           HAS ALREADY BEEN DISPLAYED           @LIM 13270800
WMJMASCB EQU   BIT3           ASCB SPECIFIED                       @PKA 13271200
WMJQDSYS DS    B              WQE DESTINATIONS COUNTER             @P4A 13271600
WMJCASEL DS    CL1            MESSAGE COLOR                        @LEA 13272000
WMJHASEL DS    CL1            MESSAGE HIGHLIGHTING                 @LEA 13272400
WMJIASEL DS    CL1            MESSAGE INTENSITY                    @LEA 13272800
*******************************************************************@LHA 13273200
*     MISCELLANEOUS ROUTING INFORMATION                            @LHA 13273600
*******************************************************************@LHA 13274000
WMJMMISC DS    B              MISCELLANEOUS ROUTING INFORMATION    @LHA 13274400
WMJMUD   EQU   BIT0           DISPLAY UD MESSAGES                  @LHA 13274800
WMJMFUDO EQU   BIT1           DISPLAY ONLY UD MESSAGES             @LHA 13275200
WMJMFIDO EQU   BIT2           QUEUE BY ID ONLY                     @PBA 13275600
WMJMAUTO EQU   BIT3           QUEUE BY AUTOMATION                  @LJA 13276000
WMJMHC   EQU   BIT4           QUEUE BY HARDCOPY                    @LMA 13276400
WMJMTSNT DS    XL2            TOTAL COUNT OF TDPS SENT OUT FOR THIS    X13276800
                              MULTI-LINE                           @PCC 13277200
WQERSVDB DS    F              RESERVED - MAPS TO WQERPYIB          @D4A 13277600
WMJMTS3  DS    BL4            STCK FORM OF TIME STAMP              @PEA 13278000
*                             Note - if task has been in a wait    @PMA 13278100
*                             for resources, this is the time      @PMA 13278200
*                             after returning from the wait        @PMA 13278300
WMJMFTOD DS    BL4            AMRF FAILURE TIME                    @PFC 13278400
WMJMQLST DS    0CL8           K Q CONSOLE ID LIST                  @PBA 13278800
WMJMKQL1 DS    F              K Q CONSOLE ID 1                     @PBA 13279200
WMJMKQL2 DS    F              K Q CONSOLE ID 2                     @PBA 13279600
WMJMRIDL DS    AL1            LENGTH OF REPLY ID IN MESSAGE TEXT   @LOA 13280000
WMJMISCC DS    B              MISCELLANEOUS CONTROL PROGRAM FLAGS  @03A 13280400
WMJMSPVD EQU   BIT0           WQE BACKLOG MESSAGE                  @03A 13280800
WMJMPRIV EQU   BIT1           Original issuer was privileged       @03A 13281200
WMJMQNLY EQU   BIT2           Send to console and nowhere else     @05A 13281600
WMJMCENT DS    CL2            Century portion of date, in EBCDIC   @04A 13282000
WMJMLTOD DS    BL4            Stck time last minor added to MLWTO  @02A 13282400
WMJMSIZE EQU   *-WMJM -       SIZE OF MAJOR WQE                  ICB433 13302002
         EJECT                                                          13350002
*********************************************************************** 13400002
*                                                                     * 13450002
*                        MINOR WQE                                    * 13500002
*                                                                     * 13550002
*********************************************************************** 13600002
         SPACE                                                          13650002
         AIF   ('&DSECT' EQ 'YES' AND '&FORMAT' EQ 'NEW').WQE0300       13660000
         ORG   WQE                                                      13700002
         SPACE                                                          13750002
         AGO   .WQE0400                                                 13760000
.WQE0300 ANOP                                                           13770000
WQEMIN   DSECT , -            MINOR WQE                                 13780000
.WQE0400 ANOP                                                           13790000
WMNM     EQU   * -            START OF MINOR WQE                        13800002
WMNMNX1  DS    A              POINTER TO SECOND HALF OF WQE        @L6C 13810000
         SPACE                                                          14000002
WMNMML1  DS    B -            MLWTO FLAGS FOR FIRST MESSAGE             14050002
WQERSV62 EQU   BIT0,,C'X' -   RESERVED                                  14060002
WMNMML1B EQU   BIT1 -         MAJOR WQE                                 14100002
WMNMML1C EQU   BIT2 -         MINOR WQE                                 14150002
WMNMML1D EQU   BIT3 -         CHAIN ALTERED                             14200002
WMNMML1E EQU   BIT4 -         WTL ISSUED                                14250002
WMNMML1F EQU   BIT5 -         MINOR WQE FOR ABEND                ICB433 14252002
WMNMML1G EQU   BIT6 -         SERVICE THIS CHAIN                        14300002
WMNMML1H EQU   BIT7 -         MINOR WQE ACQUIRED BY GETMAIN      ICB461 14350002
         SPACE                                                          14400002
WMNMLT1  DS    B -            LINE TYPE FLAGS FOR FIRST MESSAGE         14450002
WMNMLT1A EQU   BIT0 -         CONTROL LINE                              14500002
WMNMLT1B EQU   BIT1 -         LABEL LINE                                14550002
WMNMLT1C EQU   BIT2 -         DATA LINE                                 14600002
WMNMLT1D EQU   BIT3 -         END INDICATOR                             14650002
WQERSV63 EQU   BIT4,,C'X' -   RESERVED                                  14660002
WQERSV64 EQU   BIT5,,C'X' -   RESERVED                                  14670002
WQERSV65 EQU   BIT6,,C'X' -   RESERVED                                  14680002
WQERSV66 EQU   BIT7,,C'X' -   RESERVED                                  14690002
         SPACE                                                          14700002
WMNMLTH1 DS    FL1            LENGTH OF 1 MINOR WQE                @P2C 14710000
WMNMTL1  DS    FL1 -          LENGTH OF FIRST MESSAGE TEXT              14800002
WMNMHCT1 DS    CL4 -          HARDCOPY ID FOR FIRST MESSAGE             14850002
WMNMTXT1 DS    CL72 -         FIRST MESSAGE TEXT (MAX 72 BYTES)         14900002
WMNMST1  DS    B -            STATUS FLAGS                       Y02710 14903500
WMNMTPD1 EQU   BIT0 -         TPUT DONE                          Y02710 14907000
WMNMTRC1 EQU   BIT1 -         FIRST MINOR WQE HAS BEEN         @G64MP2D 14910500
*                             MASTER TRACED                    @G64MP2D 14914000
WMNMWTP1 EQU   BIT2 -         MINOR 1 TEXT HAS BEEN PUT/TPUT           *14917500
                              BY IEEJB840 - DON'T DO IT AGAIN      @P5C 14921000
WQERSVB1 EQU   BIT3,,C'X' -   RESERVED                           Y02710 14924500
WQERSVB2 EQU   BIT4,,C'X' -   RESERVED                           Y02710 14928000
WQERSVB3 EQU   BIT5,,C'X' -   RESERVED                           Y02710 14931500
WQERSVB4 EQU   BIT6,,C'X' -   RESERVED                           Y02710 14935000
WQERSVB5 EQU   BIT7,,C'X' -   RESERVED                           Y02710 14938500
         SPACE                                                          14942000
WMNMMSF1 DS    B              MISCELLANEOUS FLAGS                  @L9C 14945500
WMNMRV99 EQU   BIT0           RESERVED                             @D6C 14949000
WMNMRV9A EQU   BIT1           RESERVED                             @D6C 14952500
WMNMTRAN EQU   BIT2           WQE HAS BEEN TRANSPORTED TO ANOTHER      *14956000
                              SYSTEM                               @LBA 14959500
WMNMUC1  DS    FL2            USE COUNT 1                          @L6C 14963000
WMNMSEQ1 DS    F              SEQUENCE NUMBER (CONNECT ID)         @L5C 14966500
WMN1XMOD DS    0CL4           COPY OF REQUEST FLAGS (CTXTRFLG) FROM    X14970000
                              THE WTO USER EXIT INTERFACE          @L3A 14973500
WMN1FLGS DS    0CL3           COMM TASK USER EXIT REQUESTS         @L3A 14977000
WMN1RFB1 DS    B              REQUEST FLAGS BYTE ONE               @L3A 14980500
WMN1RCMT EQU   BIT0           CHANGE THE MESSAGE TEXT              @L3A 14984000
WMN1RPML EQU   BIT7           PROCESS THE MINOR LINES              @L3A 14987500
WMN1RFB2 DS    B              REQUEST FLAGS BYTE TWO               @L3A 14991000
WMN1RFB3 DS    B              RESERVED                             @L3A 14994500
WMN1SUPB DS    B              SUPPRESSION BYTE                     @L3A 14998000
WMN1SNSV EQU   BIT0           NOT SERVICED BY ANY WTO USER EXIT        X15001500
                              ROUTINE                              @L3A 15005000
WMN1SEER EQU   BIT1           ESTAE ERROR IN IEAVX600              @L3A 15008500
WMN1SNSI EQU   BIT2           NOT SERVICED BECAUSE OF AN               X15012000
                              INCOMPATIBLE REQUEST                 @L3A 15015500
WMN1SAUT EQU   BIT3           INDICATES AUTOMATION SPECIFIED   @YA06920 15019000
WMN1SQED EQU   BIT4           NOT QUEUED TO ANY CONSOLE            @L3A 15022500
WMN1SSSI EQU   BIT5           SUPPRESSED BY A SUBSYSTEM            @L3A 15026000
WMN1SWTO EQU   BIT6           SUPPRESSED BY A WTO USER EXIT            X15029500
                              ROUTINE                              @L3A 15033000
WMN1SMPF EQU   BIT7           SUPPRESSED BY MPF                    @L3A 15036500
         SPACE                                                          15040000
WMNMNX2  DS    A              ADDRESS OF NEXT MINOR WQE OR ZERO    @L6C 15043500
         SPACE                                                          15050002
WMNMML2  DS    B -            MLWTO FLAGS FOR SECOND MESSAGE            15100002
WQERSV68 EQU   BIT0,,C'X' -   RESERVED                                  15110002
WMNMML2B EQU   BIT1 -         MAJOR WQE                                 15150002
WMNMML2C EQU   BIT2 -         MINOR WQE                                 15200002
WMNMML2D EQU   BIT3 -         CHAIN ALTERED                             15250002
WMNMML2E EQU   BIT4 -         WTL ISSUED                                15300002
WQERSV69 EQU   BIT5,,C'X' -   RESERVED                                  15310002
WMNMML2G EQU   BIT6 -         SERVICE THIS CHAIN                        15350002
WMNMML2H EQU   BIT7 -         LINE 2 AVAILABLE                          15400002
         SPACE                                                          15450002
WMNMLT2  DS    B -            LINE TYPE FLAGS FOR SECOND MESSAGE        15500002
WMNMLT2A EQU   BIT0 -         CONTROL LINE                              15550002
WMNMLT2B EQU   BIT1 -         LABEL LINE                                15600002
WMNMLT2C EQU   BIT2 -         DATA LINE                                 15650002
WMNMLT2D EQU   BIT3 -         END INDICATOR                             15700002
WQERSV70 EQU   BIT4,,C'X' -   RESERVED                                  15710002
WQERSV71 EQU   BIT5,,C'X' -   RESERVED                                  15720002
WQERSV72 EQU   BIT6,,C'X' -   RESERVED                                  15730002
WQERSV73 EQU   BIT7,,C'X' -   RESERVED                                  15740002
         SPACE                                                          15750002
WMNMLTH2 DS    FL1            LENGTH OF 1 MINOR WQE                @P2C 15760000
WMNMTL2  DS    FL1 -          LENGTH OF SECOND MESSAGE TEXT             15850002
WMNMHCT2 DS    CL4 -          HARDCOPY ID FOR SECOND MESSAGE            15900002
WMNMTXT2 DS    CL72 -         SECOND MESSAGE TEXT (MAX 72 BYTES)        15950002
WMNMST2  DS    B -            STATUS FLAGS                       Y02710 15950800
WMNMTPD2 EQU   BIT0 -         TPUT DONE                          Y02710 15951600
WMNMTRC2 EQU   BIT1 -         SECOND MINOR WQE HAS BEEN        @G64MP2D 15952400
*                             MASTER TRACED                    @G64MP2D 15953200
WMNMWTP2 EQU   BIT2 -         MINOR 2 TEXT HAS BEEN PUT/TPUT           *15954000
                              BY IEEJB840 - DON'T DO IT AGAIN      @P5C 15954800
WQERSVC1 EQU   BIT3,,C'X' -   RESERVED                           Y02710 15955600
WQERSVC2 EQU   BIT4,,C'X' -   RESERVED                           Y02710 15956400
WQERSVC3 EQU   BIT5,,C'X' -   RESERVED                           Y02710 15957200
WQERSVC4 EQU   BIT6,,C'X' -   RESERVED                           Y02710 15958000
WQERSVC5 EQU   BIT7,,C'X' -   RESERVED                           Y02710 15958800
          SPACE                                                         15959600
WMN2MSF2 DS    B              RESERVED                             @D6C 15960400
WMNMUC2  DS    FL2            USE COUNT 2                          @L6C 15961200
WMNMSEQ2 DS    F              SEQUENCE NUMBER (CONNECT ID)         @L5C 15962000
WMN2XMOD DS    0CL4           COPY OF REQUEST FLAGS (CTXTRFLG) FROM    X15962800
                              THE WTO USER EXIT INTERFACE          @L3A 15963600
WMN2FLGS DS    0CL3           COMM TASK USER EXIT REQUESTS         @L3A 15964400
WMN2RFB1 DS    B              REQUEST FLAGS BYTE ONE               @L3A 15965200
WMN2RCMT EQU   BIT0           CHANGE THE MESSAGE TEXT              @L3A 15966000
WMN2RPML EQU   BIT7           PROCESS MINOR LINES                  @L3A 15966800
WMN2RFB2 DS    B              REQUEST FLAGS BYTE TWO               @L3A 15967600
WMN2RFB3 DS    B              RESERVED                             @L3A 15968400
WMN2SUPB DS    B              SUPPRESSION BYTE                     @L3A 15969200
WMN2SNSV EQU   BIT0           NOT SERVICED BY ANY WTO USER EXIT        X15970000
                              ROUTINE                              @L3A 15970800
WMN2SEER EQU   BIT1           ESTAE ERROR IN IEAVX600              @L3A 15971600
WMN2SNSI EQU   BIT2           NOT SERVICED BECAUSE OF AN               X15972400
                              INCOMPATIBLE REQUEST                 @L3A 15973200
WMN2SAUT EQU   BIT3           INDICATES AUTOMATION SPECIFIED   @YA06920 15974000
WMN2SQED EQU   BIT4           NOT QUEUED TO ANY CONSOLE            @L3A 15974800
WMN2SSSI EQU   BIT5           SUPPRESSED BY A SUBSYSTEM            @L3A 15975600
WMN2SWTO EQU   BIT6           SUPPRESSED BY A WTO USER EXIT            X15976400
                              ROUTINE                              @L3A 15977200
WMN2SMPF EQU   BIT7           SUPPRESSED BY MPF                    @L3A 15978000
WMNM1R99 DS    4F             RESERVED                             @L1A 15978800
WMNM2R99 DS    4F             RESERVED                             @L1A 15979600
WMNMRSVD DS    CL128          RESERVED                         @YA10055 15980400
          SPACE                                                         15981200
WMNMSIZE EQU   *-WMNM -       SIZE OF MINOR WQE                  ICB433 15982000
          SPACE                                                         15982800
*********************************************************************** 15983600
*                                                                 @LAA* 15984400
*      ARRAY OF 256 BIT SYSIDS. EACH BIT REPRESNTS A SYSTEM IN A  @LAA* 15985200
*      SYSPLEX. THIS ARRAY IS USED WITH CONNECTING WTO MESSAGES   @LAA* 15986000
*      SO THAT THOSE LINES THAT ARE ADDED BY CONNECT WILL BE      @LAA* 15986800
*      SENT TO THE SAME SYSTEMS THAT THE MAJOR LINE AND OTHER     @LAA* 15987600
*      MINOR LINES WERE SENT TO.                                  @LAA* 15988400
*                                                                 @LAA* 15989200
*********************************************************************** 15990000
         SPACE                                                          15990800
         AIF   ('&DSECT' EQ 'YES' AND '&FORMAT' EQ 'NEW').WQE0500       15991600
         ORG   WQE                                                      15992400
         SPACE                                                          15993200
         AGO   .WQE0600                                                 15994000
.WQE0500 ANOP                                                           15994800
WQESYAR  DSECT , -            ARRAY OF SAVED SYSIDS                @L8A 15995600
.WQE0600 ANOP                                                           15996400
WQESYSTA EQU   * -            START OF ARRAY OF SYSIDS                  15997200
WQESYARR DS    32B            ARRAY OF 256 BIT SYSIDS              @L8A 15998000
         MEND  , -               */                                     16000002
*%WQEL2: ;                                                              16050002
*@EJECT;                                                                16050200
* %WQELPUSH = '@LISTPUSH';          /*EQUATE LISTPUSH FOR MACRO  @LFA*/ 16050400
* %WQELPOP = '@LISTPOP';            /*EQUATE LISTPOP FOR MACRO   @LFA*/ 16050600
* %WQELOFF = '@LISTOFF';            /*EQUATE LISTOFF FOR MACRO   @LFA*/ 16050800
* WQELPUSH;                         /* @LISTPUSH                 @LFA*/ 16051000
* %IF WQEVIA = 'YES' %THEN              /* CHECK IF ALET SPECIFIED FOR  16051200
*                                       THE BASE WQE             @LFA*/ 16051400
*   %WQEVIA = 'VIA(WQEALET)';                                           16051600
* %ELSE                                                       /* @LFA*/ 16051800
*   %IF GLOBALARMODE = 'YES' %THEN      /* WQEVIA WAS NOT SPECIFIED     16052000
*                                       CHECK FOR IF GLOBAL DEFAULT     16052200
*                                       WAS SPECIFIED            @LFA*/ 16052400
*     %WQEVIA  = 'VIA(0)';              /* SET GLOBAL DEFAULT    @LFA*/ 16052600
*   %ELSE                               /* NO GLOBAL DESIRED     @LFA*/ 16052800
*     %WQEVIA  = '';                    /* SET TO NULL           @LFA*/ 16053000
* %IF WQESYVIA = 'YES' %THEN            /* CHECK IF ALET SPECIFIED FOR  16053200
*                                       THE SYSID ARRAY          @LFA*/ 16053400
*   %WQESYVIA = 'VIA(WQESYALET)';       /* SET SYSID ARRAY VIA TO ALET  16053600
*                                       SPECIFIED                @LFA*/ 16053800
* %ELSE                                 /* NO ALET SPECIFIED     @LFA*/ 16054000
*   %WQESYVIA = WQEVIA;                 /* VIA FOR SYSID ARRAY DEFAULTS 16054200
*                                       TO VALUE OF THE BASE WQE @LFA*/ 16054400
* %IF WMJMVIA = 'YES' %THEN             /* CHECK IF ALET SPECIFIED FOR  16054600
*                                       THE MAJOR WQE            @LFA*/ 16054800
*   %WMJMVIA = 'VIA(WMJMALET)';         /* SET MAJOR WQE VIA TO ALET    16055000
*                                       SPECIFIED                @LFA*/ 16055200
* %ELSE                                 /* NO ALET SPECIFIED     @LFA*/ 16055400
*   %WMJMVIA = WQEVIA;                  /* WMJMVIA NOT SPECIFIED-       16055600
*                                       MAJOR DEFAULTS TO BASE WQEVIA   16055800
*                                       VALUE                    @LFA*/ 16056000
* %IF WMNMVIA = 'YES' %THEN             /* CHECK IF ALET SPECIFIED FOR  16056200
*                                       THE MINOR WQE            @LFA*/ 16056400
*   %WMNMVIA = 'VIA(WMNMALET)';         /* SET MINOR WQE VIA TO ALET    16056600
*                                       SPECIFIED                @LFA*/ 16056800
* %ELSE                                 /* NO ALET SPECIFIED     @LFA*/ 16057000
*   %WMNMVIA = WMJMVIA;                 /* WMNMVIA NOT SPECIFIED-       16057200
*                                       MINOR DEFAULTS TO MAJOR VIA     16057400
*                                       VALUE                    @LFA*/ 16057600
*                                                                       16060002
* %IF IHALIST ~= 'NO' %THEN             /*WANT LISTING DEFAULT   @P8C*/ 16070000
*   %GOTO WQEZ1;                        /*BRANCH AROUND LISTOFF  @P8C*/ 16080000
*WQELOFF;                               /*@LISTOFF               @P8C*/ 16090000
*%WQEZ1 : ;                                                   /* @LFA*/ 16100000
*/********************************************************************/ 16650002
*/*                                                                  */ 16700002
*/*                 WQE (NORMAL FORMAT)                              */ 16750002
*/*                                                                  */ 16800002
*/********************************************************************/ 16850002
*                                                                       16900002
*DECLARE                                                                16950002
*  1 WQE BASED(WQEPTR) WQEVIA BDY(WORD), /* START OF WQE         @LFC*/ 16960000
*   2 WQELKP      PTR(31),               /* LINKAGE POINTER      @L6C*/ 16970000
*   2 WQENBR      FIXED(31),             /* MESSAGE LENGTH (CCW         17250002
*                                           COUNT FIELD)             */ 17300002
*    3 *           FIXED(15),            /* NOT TO BE USED       @L5A*/ 17305800
*    3 WQETXTLN    FIXED(15),            /* ACTUAL TEXT LENGTH   @L5A*/ 17311600
*   2 WQERTCT     PTR(15) BDY(WORD),     /* ROUTED WQE COUNT     @L5C*/ 17317400
*   2 WQEUSE      PTR(15),               /* WQE USE COUNT        @L6C*/ 17323200
*   2 WQEPAD      CHAR(1),               /* BLANK              Y02710*/ 17329000
*   2 WQETS       CHAR(8) BDY(WORD,2),   /* TIME STAMP         Y02710*/ 17334800
*     3 WQETSHH   CHAR(2),               /* HOURS PART OF TIME Y02710*/ 17340600
*     3 WQEPER1   CHAR(1),               /* DECIMAL POINT      Y02710*/ 17346400
*     3 WQETSMM   CHAR(2),               /* MINUTES PART OF TS Y02710*/ 17352200
*     3 WQEPER2   CHAR(1),               /* DECIMAL POINT      Y02710*/ 17358000
*     3 WQETSSS   CHAR(2),               /* SECONDS PART OF TS Y02710*/ 17363800
*   2 WQEPAD1     CHAR(1),               /* BLANK                    */ 17369600
*   2 WQEJOBNM    CHAR(8),               /* JOBNAME INSERTED BY THE     17375400
*                                           SUBSYSTEM          Y02710*/ 17381200
*   2 WQEPAD2     CHAR(1),               /* BLANK              Y02710*/ 17387000
*   2 WQETXT      CHAR(128) BDY(WORD,4), /* MESSAGE TEXT (MAX 128       17392800
*                                           BYTES)                   */ 17400002
*    3 *           CHAR(127),            /* MESSAGE TEXT             */ 17450002
*    3 WQETXTL     CHAR(1),              /* LAST BYTE OF MESSAGE        17500002
*                                           TEXT                     */ 17550002
*   2 WQEPAD3     CHAR(1),               /* USED TO PUT REMAINING       17558300
*                                           FIELDS ON WORD BDY          17566600
*                                           Note this field was used    17574900
*                                           in OW26748, do not          17583200
*                                           reuse                @09C*/ 17591500
*                                                                       17600002
*   2 WQEXA       BIT(8) BDY(WORD),      /* DISPOSITION FLAGS        */ 17650002
*    3 WQEPURGE  BIT(1),                 /* PURGE THIS WQE           */ 17700002
*    3 WQEQFHC   BIT(1),                 /* QUEUE FOR HARD COPY      */ 17750002
*    3 WQEORE    BIT(1),                 /* AN ORE EXISTS FOR           17760000
*                                           THIS WQE                 */ 17850002
*    3 WQEQDFHC  BIT(1),                 /* QUEUED FOR HARD COPY     */ 17900002
*    3 WQEWTOR   BIT(1),                 /* WQE CREATED FOR WTOR     */ 17950002
*    3 WQEDOM    BIT(1),                 /* MESSAGE TO BE DOM'ED     */ 17960000
*    3 WQESUSP   BIT(1),                 /* PROCESSING TEMPORARILY      17970000
*                                           SUSPENDED                */ 17980000
*    3 WQEAUTH   BIT(1),                 /* MSG ISSUED BY AUTH USER  */ 17990000
*                                                                       18050002
*   2 WQEASID     CHAR(2),               /* ASID OF USER             */ 18060000
*                                                                       18300002
*   2 WQEAVAIL    BIT(8) ABNORMAL,       /* BUFFER STATUS FLAGS  @08C*/ 18310000
*    3 WQEBUFA   BIT(1),                 /* BUFFER IS FREE           */ 18400002
*    3 WQEBUFB   BIT(1),                 /* BUFFER IS IN USE         */ 18450002
*    3 WQEBUFC   BIT(1),                 /* READY FOR HARDCOPY          18460000
*                                                              Y02710*/ 18470000
*    3 WQEBUFD   BIT(1),                 /* BUFFER OBTAINED             18550002
*                                           DYNAMICALLY              */ 18600002
*    3 WQEBUFE   BIT(1),                 /* BUFFER HAS BEEN SERVICED */ 18650002
*    3 WQEBUFF   BIT(1),                 /* TPUT TO DO               */ 18660000
*    3 WQEBUFG   BIT(1),                 /* WQE SUPPRESSED   @G384P2L*/ 18670000
*    3 WQEMTRCD  BIT(1),                 /* BUFFER HAS BEEN MASTER      18680000
*                                           TRACED           @G64MP2D*/ 18690000
*                                                                       18750002
*   2 WQETCB      PTR(31),               /* ADDRESS OF USER'S TCB    */ 18760000
*   2 WQESEQ#     PTR(31),               /* WTO SEQUENCE NUMBER         18770000
*                                           (DOM/CONNECT ID) @YA06025*/ 18780000
*    3 WQESYSID    PTR(8),               /* SYSTEM ID            @L5A*/ 18790000
*    3 WQESEQN     PTR(24),              /* 24-BIT SEQUENCE NUMBER      18800000
*                                                            @YA06025*/ 18810000
*   2 WQEMCSF     CHAR(2) BDY(WORD),     /* MCS FLAGS                */ 19150002
*    3 WQEMCSF1    BIT(8),               /* FIRST BYTE OF MCS FLAGS  */ 19200002
*     4 WQEMCSA  BIT(1),                 /* ROUTING AND DESCRIPTOR      19250002
*                                           CODE FIELDS EXIST        */ 19300002
*     4 WQEMCSB  BIT(1),                 /* QUEUE AT LEAST TO THE UCM   19350002
*                                           ENTRY PASSED IN REG 0 (IF   19400002
*                                           THE CONSOLE IS ACTIVE)   */ 19402002
*     4 WQEMCSC  BIT(1),                 /* COMMAND RESPONSE            19450002
*                                           (INCLUDES HARD COPY)     */ 19500002
*     4 WQEMCSD  BIT(1),                 /* MESSAGE TYPE FLAGS FIELD    19550002
*                                           EXISTS                   */ 19600002
*     4 WQEMCSE  BIT(1),                 /* THIS WTO IS A REPLY TO      19650002
*                                           A WTOR                   */ 19652002
*     4 WQEMCSFF BIT(1),                 /* BROADCAST TO ACTIVE         19662000
*                                           CONSOLES                 */ 19750002
*     4 WQEMCSG  BIT(1),                 /* QUEUE FOR HARD COPY         19800002
*                                           ONLY                     */ 19850002
*     4 WQEMCSH  BIT(1),                 /* QUEUE UNCONDITIONALLY TO    19900002
*                                           UCM ENTRY PASSED IN REG 0*/ 19950002
*    3 WQEMCSF2    BIT(8),               /* SECOND BYTE OF MCS FLAGS */ 20000002
*     4 WQEMCSI  BIT(1),                 /* NO TIME STAMP            */ 20050002
*     4 WQEMCSJ  BIT(1),                 /* MUST BE ZERO             */ 20100002
*     4 WQEMCSK  BIT(1),                 /* PRIMARY SUBSYSTEM USE ONLY: 20110000
*                                           JES3: DO NOT LOG MINOR WQES 20120000
*                                                 IF THE MAJOR IS NOT   20130000
*                                                 HARDCOPIED            20140000
*                                           JES2: NOT USED       @L5C*/ 20150000
*     4 WQEMCSL  BIT(1),                 /* EXTENDED WPL FORMAT (WPX)   20160000
*                                           EXISTS               @L5C*/ 20170000
*     4 WQEMCSM  BIT(1),                 /* THE MESSAGE IS AN OPERATOR  20180000
*                                           COMMAND              @L4C*/ 20190000
*     4 WQEMCSN  BIT(1),                 /* BYPASS QUEUING TO HARD      20200002
*                                           COPY (FOR USERS OPERATING   20250002
*                                           IN PROTECT KEY 0 ONLY)   */ 20252002
*     4 WQEMCSO  BIT(1),                 /* WQEBLK KEYWORD SPECIFIED    20262000
*                                                                @L5C*/ 20272000
*     4 WQEMCSP  BIT(1),                 /* RESERVED             @L5C*/ 20282000
*                                                                       20400002
*   2 WQEMSGTP    CHAR(2),               /* MESSAGE TYPE FLAGS       */ 20450002
*    3 WQEMSGT1  BIT(8),                 /* FIRST BYTE OF MESSAGE       20500002
*                                           TYPE FLAGS               */ 20550002
*     4 WQEMSGTA BIT(1),                 /* DISPLAY JOBNAMES         */ 20600002
*     4 WQEMSGTB BIT(1),                 /* DISPLAY STATUS           */ 20650002
*     4 WQEMSGTC BIT(1),                 /* MONITOR ACTIVE           */ 20700002
*     4 WQEMSGTD BIT(1),                 /* INDICATES EXISTENCE OF      20750002
*                                           QID FIELD IN WPL            20752002
*                                           (AOS/1)            ICB468*/ 20754002
*     4 WQERSV13 BIT(1),                 /* RESERVED                 */ 20756002
*     4 WQEMSGTF BIT(1),                 /* MONITOR SESS             */ 20800002
*     4 WQERSV14 BIT(1),                 /* RESERVED                 */ 20850002
*     4 WQERSV15 BIT(1),                 /* RESERVED                 */ 20860002
*    3 WQEMSGT2 BIT(8),                  /* SECOND BYTE OF MESSAGE      20870000
*                                           TYPE FLAGS           @D6C*/ 20880000
*                                                                       20900002
*   2 WQEROUT CHAR(2) BDY(WORD),         /* ROUTING CODES (2 BYTES)  */ 20910000
*/*      THESE CODES INDICATE THE FUNCTIONAL AREA OR AREAS TO WHICH  */ 21050002
*/*      A MESSAGE IS TO BE SENT                                     */ 21100002
*                                                                       21150002
*    3 WQEROUT1    CHAR(1),              /* 1ST BYTE OF ROUTING CODES*/ 21200002
*     4 WQEROUTA BIT(1),                 /* MASTER CONSOLE           */ 21250002
*     4 WQEROUTB BIT(1),                 /* MASTER CONSOLE INFO      */ 21300002
*     4 WQEROUTC BIT(1),                 /* TAPE POOL                */ 21350002
*     4 WQEROUTD BIT(1),                 /* DIRECT ACCESS POOL       */ 21400002
*     4 WQEROUTE BIT(1),                 /* TAPE LIBRARY             */ 21450002
*     4 WQEROUTF BIT(1),                 /* DISK LIBRARY             */ 21500002
*     4 WQEROUTG BIT(1),                 /* UNIT RECORD POOL         */ 21550002
*     4 WQEROUTH BIT(1),                 /* TELEPROCESSING CONTROL   */ 21600002
*    3 WQEROUT2    CHAR(1),              /* 2ND BYTE OF ROUTING CODES*/ 21650002
*     4 WQEROUTI BIT(1),                 /* SYSTEM SECURITY          */ 21700002
*     4 WQEROUTJ BIT(1),                 /* SYSTEM/ERROR MAINTENANCE */ 21750002
*     4 WQEROUTK BIT(1),                 /* PROGRAMMER INFORMATION   */ 21800002
*     4 WQEROUTL BIT(1),                 /* EMULATOR INFORMATION     */ 21850002
*     4 WQEROUTM BIT(1),                 /* USER ROUTING CODE        */ 21900002
*     4 WQEROUTN BIT(1),                 /* USER ROUTING CODE        */ 21950002
*     4 WQEROUTO BIT(1),                 /* USER ROUTING CODE        */ 22000002
*     4 WQEROUTP BIT(1),                 /* USER ROUTING CODE    @L5C*/ 22009300
*   2 WQECHAR1    CHAR(1),               /* 1ST CHARACTER OF            22018600
*                                           TEXT                 @P3A*/ 22027900
*   2 WQEFLG3     BIT(8),                /* MISCELLANEOUS FLAGS  @LDC*/ 22037200
*    3 WQEDLVRD    BIT(1),               /* WQE HAS BEEN DELIVERED TO   22046500
*                                           A CONSOLE ON THIS SYSTEM    22055800
*                                                                @LDA*/ 22065100
*    3 WQEDNDWQ    BIT(1),               /* DO NOT DELETE WTOR UNTIL    22074400
*                                            THIS BIT IS OFF     @LDA*/ 22083700
*    3 WQENSYL     BIT(1),               /* DO NOT SEND THIS MESSAGE    22093000
*                                            TO SYSLOG           @D7A*/ 22102300
*    3 WQEJ3B1     BIT(1),               /* BIT FOR USE BY JES3 ONLY    22111600
*                                                                @D7A*/ 22120900
*    3 WQEJ3B2     BIT(1),               /* BIT FOR USE BY JES3 ONLY    22130200
*                                                                @D7A*/ 22139500
*   2 WQEUCMID    PTR(8) BDY(WORD),      /* UNIQUE UCM ENTRY ID      */ 22150002
*   2 WQEFLG1     CHAR(1),               /* MISCELLANEOUS FLAGS         22158300
*                                                            @G38OP2L*/ 22166600
*    3 WQEFLG11    BIT(1),               /* THIS MESSAGE WAS PROCESSED  22174900
*                                           WHILE MPF WAS ACTIVE AND    22183200
*                                           HARDCOPY WAS AVAILABLE      22191500
*                                                            @G38XP2L*/ 22199800
*    3 WQERETAN    BIT(1),               /* MSG IS TO BE RETAINED BY    22208100
*                                           AMRF                 @P1C*/ 22216400
*    3 WQENMOD     BIT(1),               /* THE CHARACTERISTICS OF THE  22224700
*                                           MESSAGE MAY NOT BE MODIFIED 22233000
*                                           BY THE PRIMARY SUBSYSTEM    22241300
*                                                                @L6C*/ 22249600
*    3 WQESQMC     BIT(1),               /* ACTION MESSAGE NOT QUEUED   22257900
*                                           TO ANY CONSOLE - DEFAULT    22266200
*                                           TO MASTER CONSOLE    @L6C*/ 22274500
*    3 WQENOJLG    BIT(1),               /* SUPPRESS FROM JOB LOG       22282800
*                                                                @L6C*/ 22291100
*    3 WQEAUTOV    BIT(1),               /* INDICATES MPF AUTO SUPPORTED22299400
*                                                            @YA06920*/ 22307700
*    3 WQEPPNA     BIT(1),               /* PROBLEM PROGRAM NONACTION   22316000
*                                           MESSAGE          @YA15064*/ 22324300
*    3 WQERISS     BIT(1),               /* REISSUED MSG     @YA08767*/ 22332600
*   2 WQERPYID    CHAR(2),               /*  REPLY ID                */ 22340900
*   2 WQEDESCD    CHAR(2) BDY(WORD),     /* DESCRIPTOR CODES            22350002
*                                           (2 BYTES)                */ 22400002
*/*      DESCRIPTOR CODES ARE USED TO FUNCTIONALLY CLASSIFY WTO AND  */ 22450002
*/*      WTOR MESSAGES.                                              */ 22500002
*                                                                       22550002
*    3 WQEDC1      CHAR(1),              /* 1ST BYTE OF DESCRIPTOR      22600002
*                                           CODES                    */ 22650002
*     4 WQEDCA   BIT(1),                 /* SYSTEM FAILURE MESSAGE   */ 22700002
*     4 WQEDCB   BIT(1),                 /* IMMEDIATE ACTION            22750002
*                                           REQUIRED MESSAGE         */ 22800002
*     4 WQEDCC   BIT(1),                 /* EVENTUAL ACTION             22850002
*                                           REQUIRED MESSAGE         */ 22900002
*     4 WQEDCD   BIT(1),                 /* SYSTEM STATUS MESSAGE    */ 22950002
*     4 WQEDCE   BIT(1),                 /* IMMEDIATE COMMAND           23000002
*                                           RESPONSE MESSAGE         */ 23050002
*     4 WQEDCF   BIT(1),                 /* JOB STATUS MESSAGE       */ 23100002
*     4 WQEDCG   BIT(1),                 /* APPLICATION PROGRAM/        23150002
*                                           PROCESSOR MESSAGE, OR       23160000
*                                           DELETE AT TASK TERMINATION  23170000
*                                                                @L5C*/ 23180000
*     4 WQEDCH   BIT(1),                 /* OUT-OF-LINE MESSAGE      */ 23250002
*    3 WQEDC2      CHAR(1),              /* 2ND BYTE OF DESCRIPTOR      23300002
*                                           CODES                    */ 23350002
*     4 WQEDCI   BIT(1),                 /* OPERATOR REQUEST     @L5C*/ 23360000
*     4 WQEDCJ   BIT(1),                 /* DYNAMIC STATUS DISPLAY      23370000
*                                                                @L5C*/ 23380000
*     4 WQEDCK   BIT(1),                 /* CRITICAL EVENTUAL ACTION    23390000
*                                           MSG - DESCRIPTOR CODE 11    23400000
*                                                            @G64DPSS*/ 23410000
*     4 WQEDCL   BIT(1),                 /* IMPORTANT INFORMATION       23420000
*                                           MESSAGE              @LHC*/ 23430000
*     4 WQEDCM   BIT(1),                 /* PREVIOUSLY AUTOMATED @LJC*/ 23440000
*     4 WQERSV23 BIT(1),                 /* RESERVED                 */ 23490002
*     4 WQERSV24 BIT(1),                 /* RESERVED                 */ 23492002
*     4 WQERSV25 BIT(1),                 /* RESERVED                 */ 23494002
*   2 WQERSV26    CHAR(1),               /* RESERVED for 3rd byte of    23494200
*                                           descriptor codes     @0AC*/ 23494400
*   2 WQEMCSCT    CHAR(1),               /* Count of MCS-only consoles  23494600
*                                           to which a message is       23494800
*                                           queued               @0AA*/ 23495000
*   2 WQEJSTCB    PTR(31),               /* ADDR OF JOB STEP TCB        23495200
*                                                              Y02710*/ 23495400
*   2 WQEVRSN  FIXED(8),                 /* VERSION LEVEL        @L1A*/ 23495600
*   2 WQEFLG2  BIT(8),                   /* MISC FLAGS BYTE2 @YA08767*/ 23495800
*    3 WQEMFLG1 BIT(8),                  /* FIRST BYTE           @LBA*/ 23496000
*     4 WQEHNDL  BIT(1),                 /* THIS MSG WILL BE DISPLAYED  23496200
*                                           BY ANOTHER CONSOLE HANDLER. 23496400
*                                           DO NOT FORCE MSG TO MASTER  23496600
*                                           CONSOLE IF NOT ROUTED.      23496800
*                                                            @YA09374*/ 23497000
*     4 WQERSV98 BIT(1),                 /* Must be unused in WQE       23497200
*                                           mapping              @03C*/ 23497400
*     4 WQEFORN  BIT(1),                 /* FOREIGN WQE          @LBA*/ 23497600
*     4 WQETRANS BIT(1),                 /* WQE HAS BEEN TRANSPORTED    23497800
*                                           TO ANOTHER SYSTEM    @LBA*/ 23498000
*     4 WQESUPSJ BIT(1),                 /* ON = DON'T DISPLAY SYSTEM   23498200
*                                           NAME OR JOB NAME     @LDA*/ 23498400
*     4 WQEQXSYS BIT(1),                 /* ON = QUEUED TO A CONSOLE    23498600
*                                           ON ANOTHER SYSTEM           23498800
*                                           IN THE SYSPLEX       @P6A*/ 23499000
*     4 WQEQEXT  BIT(1),                 /* ON = QUEUED TO AN           23499200
*                                           EXTENDED CLASS       @P7A*/ 23499400
*     4 WQEQMCS  BIT(1),                 /* ON = QUEUED TO AN           23499600
*                                           MCS CONSOLE          @P7A*/ 23499800
*   2 WQEMCSEF CHAR(2),                  /* EXTENDED MCS FLAGS   @L5A*/ 23500000
*    3 WQEMCSE1 BIT(8),                  /* FIRST BYTE           @L5A*/ 23500200
*     4 WQEEBUSY BIT(1),                 /* RETURN WITH BUSY RETURN     23500400
*                                           CODE IF BUFFER LIMITATIONS  23500600
*                                           EXCEEDED             @L5A*/ 23500800
*     4 WQEECONS BIT(1),                 /* FOUR-BYTE CONSOLE ID        23501000
*                                           SPECIFIED            @L5A*/ 23501200
*     4 WQEEDOMI BIT(1),                 /* DOM ID SPECIFIED @YA07436*/ 23501400
*     4 WQEECONN BIT(1),                 /* CONNECT ID SPECIFIED @L5A*/ 23501600
*     4 WQEEWTOR BIT(1),                 /* WTOR WITH EXTENDED          23501800
*                                           PARAMETER LIST       @L5A*/ 23502000
*     4 WQEEPRIO BIT(1),                 /* PRIORITY SPECIFIED   @L5A*/ 23502200
*     4 WQECNM   BIT(1),                 /* CONSOLE NAME SPECIFIED      23502400
*                                                                @L7A*/ 23502600
*    3 WQEMCSE2 BIT(8),                  /* SECOND BYTE OF EXT MCS      23502800
*                                           FLAGS                @L5A*/ 23503000
*     4 WQEETXTA BIT(1),                 /* UNUSED IN WQE - TEXT        23503200
*                                           PARM SPECIFIED ON WTO       23503400
*                                           MACRO                @L9A*/ 23503600
*     4 WQERSV99 BIT(1),                 /* RESERVED             @D1A*/ 23503800
*     4 WQEEDBCS BIT(1),                 /* RESERVED             @D6C*/ 23504000
*     4 WQEEIDBC BIT(1),                 /* RESERVED             @D6C*/ 23504200
*     4 WQERSV1B BIT(1),                 /* RESERVED             @D2C*/ 23504400
*     4 WQEESYNC BIT(1),                 /* PROCESS SYNCHRONOUS WITH    23504600
*                                           RESPECT TO THE CALLER       23504800
*                                                                @LEA*/ 23505000
*     4 WQERSV1C BIT(1),                 /* RESERVED             @LFA*/ 23505200
*     4 WQERSV1D BIT(1),                 /* RESERVED             @LFA*/ 23505400
*   2 WQESYSNM CHAR(8),                  /* THE NAME OF THE SYSTEM      23505600
*                                           ON WHICH THIS MESSAGE       23505800
*                                           WAS ISSUED           @L5C*/ 23506000
*   2 WQEDATE  CHAR(5),                  /* DATE WTO ISSUED      @L4C*/ 23506200
*   2 WQETS2,                            /* TENTHS AND HUNDREDTHS OF    23506400
*                                           A SECOND             @L4A*/ 23506600
*    3 WQEPER3  CHAR(1),                 /*DECIMAL POINT IN TIME @L4A*/ 23506800
*    3 WQETS2TH CHAR(2),                 /* TENTHS AND HUNDREDTHS OF    23507000
*                                           A SECOND             @L4A*/ 23507200
*   2 WQEXMOD  CHAR(4),                  /* COPY OF REQUEST FLAGS       23507400
*                                           (CTXTRFLG) FROM THE WTO     23507600
*                                           USER EXIT INTERFACE         23507800
*                                           ROUTINE              @L3A*/ 23508000
*    3 WQERFLGS,                         /* COMM TASK USER EXIT         23508200
*                                           REQUESTS             @L3A*/ 23508400
*     4 WQERFB1  BIT(8),                 /* REQUEST FLAGS BYTE          23508600
*                                           ONE                  @L3A*/ 23508800
*      5 WQERCMT  BIT(1),                /* CHANGE THE MESSAGE          23509000
*                                           TEXT                 @L3A*/ 23509200
*      5 WQERCRC  BIT(1),                /* CHANGE THE ROUTING          23509400
*                                           CODE(S)              @L3A*/ 23509600
*      5 WQERCDC  BIT(1),                /* CHANGE THE DESCRIPTOR       23509800
*                                           CODE(S)              @L3A*/ 23510000
*      5 WQERQPC  BIT(1),                /* QUEUE TO A PARTICULAR       23510200
*                                           ACTIVE CONSOLE       @L3A*/ 23510400
*      5 WQERQUN  BIT(1),                /* QUEUE TO A PARTICULAR       23510600
*                                           CONSOLE UNCONDITIONALLY     23510800
*                                                                @L3A*/ 23511000
*      5 WQERQRC  BIT(1),                /* QUEUE BY ROUTING CODES      23511200
*                                           ONLY                 @L3A*/ 23511400
*      5 WQERCCN  BIT(1),                /* CHANGE THE CONSOLE ID       23511600
*                                                                @L3A*/ 23511800
*      5 WQERPML  BIT(1),                /* PROCESS MINOR LINES         23512000
*                                                                @L3A*/ 23512200
*     4 WQERFB2  BIT(8),                 /* REQUEST FLAGS BYTE          23512400
*                                           TWO                  @L3A*/ 23512600
*      5 WQERDTM  BIT(1),                /* DELETE THE MESSAGE   @L3A*/ 23512800
*      5 WQEROMS  BIT(1),                /* OVERRIDE MPF SUPPRESSION    23513000
*                                                                @L3A*/ 23513200
*      5 WQERFHC  BIT(1),                /* FORCE HARDCOPY       @L3A*/ 23513400
*      5 WQERNHC  BIT(1),                /* FORCE NO HARDCOPY    @L3A*/ 23513600
*      5 WQERHCO  BIT(1),                /* FORCE HARDCOPY ONLY  @L3A*/ 23513800
*      5 WQERBCA  BIT(1),                /* BROADCAST MESSAGE TO        23514000
*                                           ACTIVE CONSOLES      @L3A*/ 23514200
*      5 WQERBCN  BIT(1),                /* DO NOT BROADCAST MESSAGE    23514400
*                                           TO ACTIVE CONSOLES   @L3A*/ 23514600
*      5 WQERNRT  BIT(1),                /* AMRF IS NOT TO RETAIN THIS  23514800
*                                           MSG                  @P1C*/ 23515000
*     4 WQERFB3  BIT(8),                 /* REQUEST FLAGS BYTE THREE    23515200
*                                                                @P1C*/ 23515400
*      5 WQERRET  BIT(1),                /* AMRF IS TO RETAIN THIS      23515600
*                                           MSG                  @P1A*/ 23515800
*      5 WQERCKY  BIT(1),                /* CHANGE THE RETRIEVAL KEY    23516000
*                                                                @L5A*/ 23516200
*      5 WQERCFC  BIT(1),                /* CHANGE THE 4-BYTE CONSOLE   23516400
*                                           ID                   @L5A*/ 23516600
*      5 WQERCMF  BIT(1),                /* CHANGE THE MESSAGE TYPE     23516800
*                                           FLAGS                @L5A*/ 23517000
*      5 WQERANO  BIT(1),                /* AUTOMATION IS NOT REQUIRED  23517200
*                                                            @YA06920*/ 23517400
*      5 WQERAYS  BIT(1),                /* AUTOMATION IS REQUIRED      23517600
*                                           AND/OR AUTOMATION TOKEN     23517800
*                                           UPDATED          @YA06920*/ 23518000
*      5 WQEQHCO  BIT(1),                /* MESSAGE ISSUED AS HARDCOPY  23518200
*                                           ONLY             @YA22959*/ 23518400
*      5 WQEHUD   BIT(1),                /* UD TO HARDCOPY FLAG  @D3A*/ 23518600
*    3 WQESUPB  BIT(8),                  /* SUPPRESSION BYTE     @L3A*/ 23518800
*     4 WQESNSV  BIT(1),                 /* NOT SERVICED BY ANY WTO     23519000
*                                           USER EXIT ROUTINE    @L3A*/ 23519200
*     4 WQESEER  BIT(1),                 /* ESTAE ERROR IN IEAVX600     23519400
*                                                                @L3A*/ 23519600
*     4 WQESNSI  BIT(1),                 /* NOT SERVICED BECAUSE OF     23519800
*                                           AN INCOMPATIBLE REQUEST     23520000
*                                                                @L3A*/ 23520200
*     4 WQESAUT  BIT(1),                 /* INDICATES AUTOMATION        23520400
*                                           SPECIFIED        @YA06920*/ 23520600
*     4 WQESQED  BIT(1),                 /* NOT QUEUED TO ANY CONSOLE   23520800
*                                                                @L3A*/ 23521000
*     4 WQESSSI  BIT(1),                 /* SUPPRESSED BY A SUBSYSTEM   23521200
*                                                                @L3A*/ 23521400
*     4 WQESWTO  BIT(1),                 /* SUPPRESSED BY A WTO USER    23521600
*                                           EXIT ROUTINE         @L3A*/ 23521800
*     4 WQESMPF  BIT(1),                 /* SUPPRESSED BY MPF    @L3A*/ 23522000
*   2 WQEMLVL,                           /* MESSAGE LEVEL MASK FOR      23522200
*                                           QUEUING              @L3C*/ 23522400
*    3 WQEML1   BIT(8),                  /* FIRST BYTE OF LEVEL         23522600
*                                           INDICATOR            @L2A*/ 23522800
*     4 WQEMLR   BIT(1),                 /* WTOR                 @L2A*/ 23523000
*     4 WQEMLIA  BIT(1),                 /* IMMEDIATE                   23523200
*                                           ACTION MESSAGE       @L2A*/ 23523400
*     4 WQEMLCE  BIT(1),                 /* CRITICAL EVENTUAL           23523600
*                                           ACTION MESSAGE       @L2A*/ 23523800
*     4 WQEMLE   BIT(1),                 /* EVENTUAL                    23524000
*                                           ACTION MESSAGE       @L2A*/ 23524200
*     4 WQEMLI   BIT(1),                 /* INFORMATIONAL               23524400
*                                           MESSAGE              @L2A*/ 23524600
*     4 WQEMLBC  BIT(1),                 /* BROADCAST                   23524800
*                                           MESSAGE              @L2A*/ 23525000
*     4 *        BIT(2),                 /* RESERVED             @L3A*/ 23525200
*    3 WQEML2   BIT(8),                  /* RESERVED             @L2A*/ 23525400
*   2 WQELENG  FIXED(15),                /* WQE SIZE         @YA08767*/ 23525600
*   2 WQEDSQN  PTR(31),                  /* UNIVERSAL DISPLAY SEQUENCE  23525800
*                                           NUMBER               @L5A*/ 23526000
*   2 WQEERC   CHAR(16),                 /* EXTENDED ROUTING CODES      23526200
*                                                                @L5A*/ 23526400
*    3 WQEERC1  BIT(8),                  /* BYTE 1  - EXTENDED          23526600
*                                           ROUTING CODES        @L5A*/ 23526800
*     4 WQERC1   BIT(1),                 /* MASTER CONSOLE       @L5A*/ 23527000
*     4 WQERC2   BIT(1),                 /* MASTER CONSOLE INFO  @L5A*/ 23527200
*     4 WQERC3   BIT(1),                 /* TAPE POOL            @L5A*/ 23527400
*     4 WQERC4   BIT(1),                 /* DIRECT ACCESS POOL   @L5A*/ 23527600
*     4 WQERC5   BIT(1),                 /* TAPE LIBRARY         @L5A*/ 23527800
*     4 WQERC6   BIT(1),                 /* DISK LIBRARY         @L5A*/ 23528000
*     4 WQERC7   BIT(1),                 /* UNIT RECORD POOL     @L5A*/ 23528200
*     4 WQERC8   BIT(1),                 /* TELEPROCESSING CONTROL      23528400
*                                                                @L5A*/ 23528600
*    3 WQEERC2  BIT(8),                  /* BYTE 2  - EXTENDED          23528800
*                                           ROUTING CODES        @L5A*/ 23529000
*     4 WQERC9   BIT(1),                 /* SYSTEM SECURITY      @L5A*/ 23529200
*     4 WQERC10  BIT(1),                 /* SYSTEM/ERROR MAINTENANCE    23529400
*                                                                @L5A*/ 23529600
*     4 WQERC11  BIT(1),                 /* PROGRAMMER INFORMATION      23529800
*                                                                @L5A*/ 23530000
*     4 WQERC12  BIT(1),                 /* EMULATOR INFORMATION @L5A*/ 23530200
*     4 WQERC13  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23530400
*     4 WQERC14  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23530600
*     4 WQERC15  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23530800
*     4 WQERC16  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23531000
*    3 WQEERC3  BIT(8),                  /* BYTE 3  - EXTENDED          23531200
*                                           ROUTING CODES        @L5A*/ 23531400
*     4 WQERC17  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23531600
*     4 WQERC18  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23531800
*     4 WQERC19  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23532000
*     4 WQERC20  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 23532200
*     4 WQERC21  BIT(1),                 /* RESERVED FOR JES            23532400
*                                           USAGE                @L5A*/ 23532600
*     4 WQERC22  BIT(1),                 /* RESERVED FOR JES            23532800
*                                           USAGE                @L5A*/ 23533000
*     4 WQERC23  BIT(1),                 /* RESERVED FOR JES            23533200
*                                           USAGE                @L5A*/ 23533400
*     4 WQERC24  BIT(1),                 /* RESERVED FOR JES            23533600
*                                           USAGE                @L5A*/ 23533800
*    3 WQEERC4  BIT(8),                  /* BYTE 4  - EXTENDED          23534000
*                                           ROUTING CODES        @L5A*/ 23534200
*     4 WQERC25  BIT(1),                 /* RESERVED FOR JES            23534400
*                                           USAGE                @L5A*/ 23534600
*     4 WQERC26  BIT(1),                 /* RESERVED FOR JES            23534800
*                                           USAGE                @L5A*/ 23535000
*     4 WQERC27  BIT(1),                 /* RESERVED FOR JES            23535200
*                                           USAGE                @L5A*/ 23535400
*     4 WQERC28  BIT(1),                 /* RESERVED FOR JES            23535600
*                                           USAGE                @L5A*/ 23535800
*     4 WQERC29  BIT(1),                 /* RESERVED             @L5A*/ 23536000
*     4 WQERC30  BIT(1),                 /* RESERVED             @L5A*/ 23536200
*     4 WQERC31  BIT(1),                 /* RESERVED             @L5A*/ 23536400
*     4 WQERC32  BIT(1),                 /* RESERVED             @L5A*/ 23536600
*    3 WQEERC5  BIT(8),                  /* BYTE 5  - EXTENDED          23536800
*                                           ROUTING CODES        @L5A*/ 23537000
*     4 WQERC33  BIT(1),                 /* RESERVED             @L5A*/ 23537200
*     4 WQERC34  BIT(1),                 /* RESERVED             @L5A*/ 23537400
*     4 WQERC35  BIT(1),                 /* RESERVED             @L5A*/ 23537600
*     4 WQERC36  BIT(1),                 /* RESERVED             @L5A*/ 23537800
*     4 WQERC37  BIT(1),                 /* RESERVED             @L5A*/ 23538000
*     4 WQERC38  BIT(1),                 /* RESERVED             @L5A*/ 23538200
*     4 WQERC39  BIT(1),                 /* RESERVED             @L5A*/ 23538400
*     4 WQERC40  BIT(1),                 /* RESERVED             @L5A*/ 23538600
*    3 WQEERC6  BIT(8),                  /* BYTE 6  - EXTENDED          23538800
*                                           ROUTING CODES        @L5A*/ 23539000
*     4 WQERC41  BIT(1),                 /* JOB STATUS MSG   @YA10057*/ 23539200
*     4 WQERC42  BIT(1),                 /* GENERAL INFO ABOUT JES2     23539400
*                                           OR JES3              @L5A*/ 23539600
*     4 WQERC43  BIT(1),                 /* RESERVED FOR JES            23539800
*                                           USAGE                @L5A*/ 23540000
*     4 WQERC44  BIT(1),                 /* RESERVED FOR JES            23540200
*                                           USAGE                @L5A*/ 23540400
*     4 WQERC45  BIT(1),                 /* RESERVED FOR JES            23540600
*                                           USAGE                @L5A*/ 23540800
*     4 WQERC46  BIT(1),                 /* RESERVED FOR JES            23541000
*                                           USAGE                @L5A*/ 23541200
*     4 WQERC47  BIT(1),                 /* RESERVED FOR JES            23541400
*                                           USAGE                @L5A*/ 23541600
*     4 WQERC48  BIT(1),                 /* RESERVED FOR JES            23541800
*                                           USAGE                @L5A*/ 23542000
*    3 WQEERC7  BIT(8),                  /* BYTE 7  - EXTENDED          23542200
*                                           ROUTING CODES        @L5A*/ 23542400
*     4 WQERC49  BIT(1),                 /* RESERVED FOR JES            23542600
*                                           USAGE                @L5A*/ 23542800
*     4 WQERC50  BIT(1),                 /* RESERVED FOR JES            23543000
*                                           USAGE                @L5A*/ 23543200
*     4 WQERC51  BIT(1),                 /* RESERVED FOR JES            23543400
*                                           USAGE                @L5A*/ 23543600
*     4 WQERC52  BIT(1),                 /* RESERVED FOR JES            23543800
*                                           USAGE                @L5A*/ 23544000
*     4 WQERC53  BIT(1),                 /* RESERVED FOR JES            23544200
*                                           USAGE                @L5A*/ 23544400
*     4 WQERC54  BIT(1),                 /* RESERVED FOR JES            23544600
*                                           USAGE                @L5A*/ 23544800
*     4 WQERC55  BIT(1),                 /* RESERVED FOR JES            23545000
*                                           USAGE                @L5A*/ 23545200
*     4 WQERC56  BIT(1),                 /* RESERVED FOR JES            23545400
*                                           USAGE                @L5A*/ 23545600
*    3 WQEERC8  BIT(8),                  /* BYTE 8  - EXTENDED          23545800
*                                           ROUTING CODES        @L5A*/ 23546000
*     4 WQERC57  BIT(1),                 /* RESERVED FOR JES            23546200
*                                           USAGE                @L5A*/ 23546400
*     4 WQERC58  BIT(1),                 /* RESERVED FOR JES            23546600
*                                           USAGE                @L5A*/ 23546800
*     4 WQERC59  BIT(1),                 /* RESERVED FOR JES            23547000
*                                           USAGE                @L5A*/ 23547200
*     4 WQERC60  BIT(1),                 /* RESERVED FOR JES            23547400
*                                           USAGE                @L5A*/ 23547600
*     4 WQERC61  BIT(1),                 /* RESERVED FOR JES            23547800
*                                           USAGE                @L5A*/ 23548000
*     4 WQERC62  BIT(1),                 /* RESERVED FOR JES            23548200
*                                           USAGE                @L5A*/ 23548400
*     4 WQERC63  BIT(1),                 /* RESERVED FOR JES            23548600
*                                           USAGE                @L5A*/ 23548800
*     4 WQERC64  BIT(1),                 /* RESERVED FOR JES            23549000
*                                           USAGE                @L5A*/ 23549200
*    3 WQEERC9  BIT(8),                  /* BYTE 9  - EXTENDED          23549400
*                                           ROUTING CODES        @L5A*/ 23549600
*     4 WQERC65  BIT(1),                 /* PROCESSOR RELATED           23549800
*                                           MESSAGE              @L5A*/ 23550000
*     4 WQERC66  BIT(1),                 /* PROCESSOR RELATED           23550200
*                                           MESSAGE              @L5A*/ 23550400
*     4 WQERC67  BIT(1),                 /* PROCESSOR RELATED           23550600
*                                           MESSAGE              @L5A*/ 23550800
*     4 WQERC68  BIT(1),                 /* PROCESSOR RELATED           23551000
*                                           MESSAGE              @L5A*/ 23551200
*     4 WQERC69  BIT(1),                 /* PROCESSOR RELATED           23551400
*                                           MESSAGE              @L5A*/ 23551600
*     4 WQERC70  BIT(1),                 /* PROCESSOR RELATED           23551800
*                                           MESSAGE              @L5A*/ 23552000
*     4 WQERC71  BIT(1),                 /* PROCESSOR RELATED           23552200
*                                           MESSAGE              @L5A*/ 23552400
*     4 WQERC72  BIT(1),                 /* PROCESSOR RELATED           23552600
*                                           MESSAGE              @L5A*/ 23552800
*    3 WQEERC10 BIT(8),                  /* BYTE 10 - EXTENDED          23553000
*                                           ROUTING CODES        @L5A*/ 23553200
*     4 WQERC73  BIT(1),                 /* PROCESSOR RELATED           23553400
*                                           MESSAGE              @L5A*/ 23553600
*     4 WQERC74  BIT(1),                 /* PROCESSOR RELATED           23553800
*                                           MESSAGE              @L5A*/ 23554000
*     4 WQERC75  BIT(1),                 /* PROCESSOR RELATED           23554200
*                                           MESSAGE              @L5A*/ 23554400
*     4 WQERC76  BIT(1),                 /* PROCESSOR RELATED           23554600
*                                           MESSAGE              @L5A*/ 23554800
*     4 WQERC77  BIT(1),                 /* PROCESSOR RELATED           23555000
*                                           MESSAGE              @L5A*/ 23555200
*     4 WQERC78  BIT(1),                 /* PROCESSOR RELATED           23555400
*                                           MESSAGE              @L5A*/ 23555600
*     4 WQERC79  BIT(1),                 /* PROCESSOR RELATED           23555800
*                                           MESSAGE              @L5A*/ 23556000
*     4 WQERC80  BIT(1),                 /* PROCESSOR RELATED           23556200
*                                           MESSAGE              @L5A*/ 23556400
*    3 WQEERC11 BIT(8),                  /* BYTE 11 - EXTENDED          23556600
*                                           ROUTING CODES        @L5A*/ 23556800
*     4 WQERC81  BIT(1),                 /* PROCESSOR RELATED           23557000
*                                           MESSAGE              @L5A*/ 23557200
*     4 WQERC82  BIT(1),                 /* PROCESSOR RELATED           23557400
*                                           MESSAGE              @L5A*/ 23557600
*     4 WQERC83  BIT(1),                 /* PROCESSOR RELATED           23557800
*                                           MESSAGE              @L5A*/ 23558000
*     4 WQERC84  BIT(1),                 /* PROCESSOR RELATED           23558200
*                                           MESSAGE              @L5A*/ 23558400
*     4 WQERC85  BIT(1),                 /* PROCESSOR RELATED           23558600
*                                           MESSAGE              @L5A*/ 23558800
*     4 WQERC86  BIT(1),                 /* PROCESSOR RELATED           23559000
*                                           MESSAGE              @L5A*/ 23559200
*     4 WQERC87  BIT(1),                 /* PROCESSOR RELATED           23559400
*                                           MESSAGE              @L5A*/ 23559600
*     4 WQERC88  BIT(1),                 /* PROCESSOR RELATED           23559800
*                                           MESSAGE              @L5A*/ 23560000
*    3 WQEERC12 BIT(8),                  /* BYTE 12 - EXTENDED          23560200
*                                           ROUTING CODES        @L5A*/ 23560400
*     4 WQERC89  BIT(1),                 /* PROCESSOR RELATED           23560600
*                                           MESSAGE              @L5A*/ 23560800
*     4 WQERC90  BIT(1),                 /* PROCESSOR RELATED           23561000
*                                           MESSAGE              @L5A*/ 23561200
*     4 WQERC91  BIT(1),                 /* PROCESSOR RELATED           23561400
*                                           MESSAGE              @L5A*/ 23561600
*     4 WQERC92  BIT(1),                 /* PROCESSOR RELATED           23561800
*                                           MESSAGE              @L5A*/ 23562000
*     4 WQERC93  BIT(1),                 /* PROCESSOR RELATED           23562200
*                                           MESSAGE              @L5A*/ 23562400
*     4 WQERC94  BIT(1),                 /* PROCESSOR RELATED           23562600
*                                           MESSAGE              @L5A*/ 23562800
*     4 WQERC95  BIT(1),                 /* PROCESSOR RELATED           23563000
*                                           MESSAGE              @L5A*/ 23563200
*     4 WQERC96  BIT(1),                 /* PROCESSOR RELATED           23563400
*                                           MESSAGE              @L5A*/ 23563600
*    3 WQEERC13 BIT(8),                  /* BYTE 13 - EXTENDED          23563800
*                                           ROUTING CODES        @L5A*/ 23564000
*     4 WQERC97  BIT(1),                 /* DEVICE RELATED              23564200
*                                           MESSAGE              @L5A*/ 23564400
*     4 WQERC98  BIT(1),                 /* DEVICE RELATED              23564600
*                                           MESSAGE              @L5A*/ 23564800
*     4 WQERC99  BIT(1),                 /* DEVICE RELATED              23565000
*                                           MESSAGE              @L5A*/ 23565200
*     4 WQERC100 BIT(1),                 /* DEVICE RELATED              23565400
*                                           MESSAGE              @L5A*/ 23565600
*     4 WQERC101 BIT(1),                 /* DEVICE RELATED              23565800
*                                           MESSAGE              @L5A*/ 23566000
*     4 WQERC102 BIT(1),                 /* DEVICE RELATED              23566200
*                                           MESSAGE              @L5A*/ 23566400
*     4 WQERC103 BIT(1),                 /* DEVICE RELATED              23566600
*                                           MESSAGE              @L5A*/ 23566800
*     4 WQERC104 BIT(1),                 /* DEVICE RELATED              23567000
*                                           MESSAGE              @L5A*/ 23567200
*    3 WQEERC14 BIT(8),                  /* BYTE 14 - EXTENDED          23567400
*                                           ROUTING CODES        @L5A*/ 23567600
*     4 WQERC105 BIT(1),                 /* DEVICE RELATED              23567800
*                                           MESSAGE              @L5A*/ 23568000
*     4 WQERC106 BIT(1),                 /* DEVICE RELATED              23568200
*                                           MESSAGE              @L5A*/ 23568400
*     4 WQERC107 BIT(1),                 /* DEVICE RELATED              23568600
*                                           MESSAGE              @L5A*/ 23568800
*     4 WQERC108 BIT(1),                 /* DEVICE RELATED              23569000
*                                           MESSAGE              @L5A*/ 23569200
*     4 WQERC109 BIT(1),                 /* DEVICE RELATED              23569400
*                                           MESSAGE              @L5A*/ 23569600
*     4 WQERC110 BIT(1),                 /* DEVICE RELATED              23569800
*                                           MESSAGE              @L5A*/ 23570000
*     4 WQERC111 BIT(1),                 /* DEVICE RELATED              23570200
*                                           MESSAGE              @L5A*/ 23570400
*     4 WQERC112 BIT(1),                 /* DEVICE RELATED              23570600
*                                           MESSAGE              @L5A*/ 23570800
*    3 WQEERC15 BIT(8),                  /* BYTE 15 - EXTENDED          23571000
*                                           ROUTING CODES        @L5A*/ 23571200
*     4 WQERC113 BIT(1),                 /* DEVICE RELATED              23571400
*                                           MESSAGE              @L5A*/ 23571600
*     4 WQERC114 BIT(1),                 /* DEVICE RELATED              23571800
*                                           MESSAGE              @L5A*/ 23572000
*     4 WQERC115 BIT(1),                 /* DEVICE RELATED              23572200
*                                           MESSAGE              @L5A*/ 23572400
*     4 WQERC116 BIT(1),                 /* DEVICE RELATED              23572600
*                                           MESSAGE              @L5A*/ 23572800
*     4 WQERC117 BIT(1),                 /* DEVICE RELATED              23573000
*                                           MESSAGE              @L5A*/ 23573200
*     4 WQERC118 BIT(1),                 /* DEVICE RELATED              23573400
*                                           MESSAGE              @L5A*/ 23573600
*     4 WQERC119 BIT(1),                 /* DEVICE RELATED              23573800
*                                           MESSAGE              @L5A*/ 23574000
*     4 WQERC120 BIT(1),                 /* DEVICE RELATED              23574200
*                                           MESSAGE              @L5A*/ 23574400
*    3 WQEERC16 BIT(8),                  /* BYTE 16 - EXTENDED          23574600
*                                           ROUTING CODES        @L5A*/ 23574800
*     4 WQERC121 BIT(1),                 /* DEVICE RELATED              23575000
*                                           MESSAGE              @L5A*/ 23575200
*     4 WQERC122 BIT(1),                 /* DEVICE RELATED              23575400
*                                           MESSAGE              @L5A*/ 23575600
*     4 WQERC123 BIT(1),                 /* DEVICE RELATED              23575800
*                                           MESSAGE              @L5A*/ 23576000
*     4 WQERC124 BIT(1),                 /* DEVICE RELATED              23576200
*                                           MESSAGE              @L5A*/ 23576400
*     4 WQERC125 BIT(1),                 /* DEVICE RELATED              23576600
*                                           MESSAGE              @L5A*/ 23576800
*     4 WQERC126 BIT(1),                 /* DEVICE RELATED              23577000
*                                           MESSAGE              @L5A*/ 23577200
*     4 WQERC127 BIT(1),                 /* DEVICE RELATED              23577400
*                                           MESSAGE              @L5A*/ 23577600
*     4 WQERC128 BIT(1),                 /* DEVICE RELATED              23577800
*                                           MESSAGE              @L5A*/ 23578000
*   2 WQEKEY   CHAR(8),                  /* RETRIEVAL KEY        @L5A*/ 23578200
*   2 WQETOKN  PTR(31),                  /* TOKEN FOR DOM        @L5A*/ 23578400
*   2 WQECNID  CHAR(4),                  /* FULLWORD CONSOLE ID  @L5A*/ 23578600
*   2 WQEOJBID CHAR(8),                  /* ORIGINATING JOB ID   @L5A*/ 23578800
*   2 WQEOJBNM CHAR(8),                  /* ORIGINATING JOB NAME @L5A*/ 23579000
*   2 WQEPRTY  FIXED(15),                /* MESSAGE'S PRIORITY   @L6A*/ 23579200
*   2 WQEAUTOT CHAR(8),                  /* AUTOMATION TOKEN VALUE      23579400
*                                                            @YA06920*/ 23579600
*   2 WQEERFS     CHAR(4),      /* EXTENDED REQUEST FLAGS  (FROM        23579800
*                                  THE USER EXIT TO THE SYSTEM)         23580000
*                                                            @YA08767*/ 23580200
*     4 WQEERF1    BIT(8),      /* REQUEST FLAGS BYTE ONE    @YA08767*/ 23580400
*       6 WQEEMRY  BIT(1),      /* PRIMARY SUBSYSTEM CAN                23580600
*                                  ALTER MSG ROUTING         @YA08767*/ 23580800
*       6 WQEEMRN  BIT(1),      /* PRIMARY SUBSYSTEM CAN NOT            23581000
*                                  ALTER MSG ROUTING         @YA08767*/ 23581200
*       6 WQEEMCO  BIT(1),      /* REQUEST TO CHANGE MESSAGE COLOR      23581400
*                                                                @LEA*/ 23581600
*       6 WQEEMHI  BIT(1),      /* REQUEST TO CHANGE MESSAGE            23581800
*                                  HIGHLIGHTING                  @LEA*/ 23582000
*       6 WQEEMIN  BIT(1),      /* REQUEST TO CHANGE MESSAGE INTENSITY  23582200
*                                                                @LEA*/ 23582400
*     4 WQEERF2    BIT(8),      /* REQUEST FLAGS BYTE TWO    @YA08767*/ 23582600
*     4 WQEERF3    BIT(8),      /* REQUEST FLAGS BYTE THREE  @YA08767*/ 23582800
*       6 WQEESJL  BIT(1),      /* REQUEST TO SUPPRESS MESSAGE FROM     23583000
*                                  THE JOBLOG                    @PLA*/ 23583200
*       6 WQENWTP  BIT(1),      /* REQUEST TO NOT DO WTP PROCESSING     23583400
*                                  (NO SYSMSG OR TPUT)           @PLA*/ 23583600
*     4 WQEERF4    BIT(8),      /* REQUEST FLAGS BYTE FOUR   @YA08767*/ 23583800
*   2 WQEJ3RTC     BIT(8),      /* JES3 GLOBAL ROUTING - FOR USE BY     23584000
*                                  JES3 ONLY                 @YA10055*/ 23584200
*   2 WQEJ3MRC     BIT(8),      /* GLOBAL MESSAGE ROUTING CONTROLS      23584400
*                                  FOR USE BY JES3 ONLY      @YA10055*/ 23584600
*   2 WQEJ3CON     FIXED(15),   /* JES3 CONSOLE ID (FOR MINOR WQE       23584800
*                                  PROCESSING) -                        23585000
*                                  FOR USE BY JES3 ONLY      @YA10055*/ 23585200
*   2 WQECNNME CHAR(8),                  /* CONSOLE NAME         @L7A*/ 23585400
*   2 WQECART  CHAR(8),                  /* CART TOKEN           @L8A*/ 23585600
*   2 WQEXIF   CHAR(2),                  /* MISCELLANEOUS AND MINOR     23585800
*                                           ERROR INFORMATION           23586000
*                                           FLAGS                @L9A*/ 23586200
*    3 WQEXIF1 BIT(8),                   /* MISC AND MINOR ERROR        23586400
*                                           FLAG BYTE 1          @L9A*/ 23586600
*     4 WQEXTTR BIT(1),                  /* MESSAGE TEXT WAS            23586800
*                                           TRUNCATED            @L9A*/ 23587000
*     4 WQEXNVT BIT(1),                  /* INVALID USER EXIT TEXT      23587200
*                                           MODIFICATION         @L9A*/ 23587400
*     4 WQEXMER BIT(1),                  /* MUTUALLY EXCLUSIVE USER     23587600
*                                           EXIT REQUESTS MADE   @L9A*/ 23587800
*     4 WQEXIRM BIT(1),                  /* INCOMPATIBLE USER EXIT      23588000
*                                           REQUESTS MADE        @L9A*/ 23588200
*     4 WQEDMDB BIT(1),                  /* DOM MDBS HAVE BEEN BUILT    23588400
*                                                                @06C*/ 23588600
*     4 WQERSV78 BIT(3),                 /* RESERVED FOR COMPATIBILITY  23588800
*                                                                @PAC*/ 23589000
*    3 WQEXIF2 BIT(8),                   /* MISC AND MINOR ERROR        23589200
*                                           FLAG BYTE 2          @LFC*/ 23589400
*     4 WQEQONLY BIT(1),                 /* REISSUED WQE VIA WQEBLK     23589600
*                                           FROM SAME SYSTEM     @P4A*/ 23589800
*     4 WQEAMRFO BIT(1),                 /* WQE IS FOR AMRF PURPOSES    23590000
*                                           ONLY                 @D5A*/ 23590200
*     4 WQEAMRFA BIT(1),                 /* AMRF IS ACTIVE ON ISSUING   23590400
*                                           SYSTEM               @D5A*/ 23590600
*     4 WQEQD    BIT(1),                 /* WQE WENT THROUGH QUEUING    23590800
*                                           ALREADY              @D5A*/ 23591000
*     4 WQEWTPR  BIT(1),                 /* WTP REQUEST - ROUTE CODE    23591200
*                                           11 WAS ON AFTER CALLING     23591400
*                                           WTO USER EXIT        @PAM*/ 23591600
*     4 WQEMFR   BIT(1),                 /* WQE WAS MODIFIED FOR REISSUE23591800
*                                           BY QUEUING           @PCA*/ 23592000
*     4 WQEAMRFR BIT(1),                 /* WQE FOR AMRF REFRESH @PFA*/ 23592200
*     4 WQEQTSYS BIT(1),                 /* QUEUE MESSAGE JUST ON THIS  23592400
*                                           SYSTEM               @01A*/ 23592600
*   2 WQEXTUSE FIXED(31),                /* EXTENDED MCS QUEUER         23592800
*                                           USE COUNT            @LAA*/ 23593000
*   2 WQESRCPT PTR(31),                  /* POINTER TO SAVED SYSIDS     23593200
*                                           USED FOR CONNECTING MESSAGES23593400
*                                           IN A SYSPLEX         @LBC*/ 23593600
*   2 WQEBENIP BIT(8),                   /* BRANCH ENTRY/NIP FLAGS      23593800
*                                                                @LIM*/ 23594000
*    3 WQEDOMD  BIT(1),                  /* MESSAGE HAS PREVIOUSLY      23594200
*                                           BEEN DOM'D           @LIM*/ 23594400
*    3 WQENBEW  BIT(1),                  /* WQE CREATED BY NIP OR       23594600
*                                           BRANCH ENTRY WTO     @LIM*/ 23594800
*    3 WQENHABD BIT(1),                  /* HAS ALREADY BEEN DISPLAYED  23595000
*                                                                @LIM*/ 23595200
*    3 WQEASCB  BIT(1),                  /* ASCB SPECIFIED              23595400
*                                                                @PKA*/ 23595600
*   2 WQEQDSYS FIXED(8),                 /* WQE DESTINATIONS COUNTER    23595800
*                                                                @P4A*/ 23596000
*   2 WQECASEL CHAR(1),                  /* MESSAGE COLOR        @LEA*/ 23596200
*   2 WQEHASEL CHAR(1),                  /* MESSAGE HIGHLIGHTING @LEA*/ 23596400
*   2 WQEIASEL CHAR(1),                  /* MESSAGE INTENSITY    @LEA*/ 23596600
*/***************************************************************@LHA*/ 23596800
*/*   MISCELLANEOUS ROUTING INFORMATION                          @LHA*/ 23597000
*/*                                                              @PAA*/ 23597200
*/*    NOTE - ANY FIELDS ADDED HERE MUST ALSO BE ADDED IN THE    @PAA*/ 23597400
*/*           FOLLOWING:                                         @PAA*/ 23597600
*/*           UCM, ODTE, RCTB, MDB                               @PAA*/ 23597800
*/*                                                              @PAA*/ 23598000
*/***************************************************************@LHA*/ 23598200
*   2 WQEMISC  BIT(8),                   /* MISCELLANEOUS ROUTING       23598400
*                                           INFORMATION          @LHA*/ 23598600
*    3 WQEUD    BIT(1),                  /* DISPLAY UD MESSAGES  @LHA*/ 23598800
*    3 WQEFUDO  BIT(1),                  /* DISPLAY ONLY UD MESSAGES    23599000
*                                                                @LHA*/ 23599200
*    3 WQEFIDO  BIT(1),                  /* QUEUE BY ID ONLY     @PBA*/ 23599400
*    3 WQEAUTO  BIT(1),                  /* QUEUE BY AUTOMATION  @LJA*/ 23599600
*    3 WQEHC    BIT(1),                  /* QUEUE BY HARDCOPY    @LMA*/ 23599800
*    3 *        BIT(3),                  /* RESERVED             @LMC*/ 23600000
*   2 WQETSNT  FIXED(15),                /* TOTAL COUNT OF TDPS SENT    23600200
*                                           OUT FOR THIS MESSAGE @PCC*/ 23600400
*   2 WQERPYIB FIXED(31),                /* BINARY REPLY ID      @D4A*/ 23600600
*   2 WQETS3   BIT(32),                  /* STCK FORM TIME STAMP        23600700
*                                           Note - if task has been     23600800
*                                           in a wait for resources,    23600900
*                                           this is the time after      23601000
*                                           returning from wait  @PMC*/ 23601100
*   2 WQEFTOD  BIT(32),                  /* AMRF FAILURE TIME    @PFC*/ 23601200
*   2 WQEKQLST CHAR(8) BDY(WORD),        /* K Q CONSOLE ID LIST  @PBA*/ 23601300
*    3 WQEKQL1  FIXED(31),               /* K Q CONSOLE ID 1     @PBA*/ 23601400
*    3 WQEKQL2  FIXED(31),               /* K Q CONSOLE ID 2     @PBA*/ 23601600
*   2 WQERIDL  FIXED(8),                 /* LENGTH OF REPLY ID IN       23601800
*                                           MESSAGE TEXT         @LOA*/ 23602000
*   2 WQEMISCC BIT(8),                   /* MISCELLANEOUS CONTROL       23602200
*                                           PROGRAM FLAGS        @03A*/ 23602400
*    3 WQESPVD  BIT(1),                  /* WQE BACKLOG MESSAGE  @03A*/ 23602600
*    3 WQEPRIV  BIT(1),                  /* Original issuer was         23602800
*                                           privileged           @03A*/ 23603000
*    3 WQEQNLY  BIT(1),                  /* Send this message to the    23603200
*                                           console and nowhere         23603400
*                                           else                 @05A*/ 23603600
*    3 *        BIT(5),                  /* RESERVED             @05C*/ 23603800
*   2 WQECENT CHAR(2),                   /* Century portion of date,    23604000
*                                           in EBCDIC            @04A*/ 23604200
*   2 WQELTOD  FIXED(32);                /* Reserved - only used in     23604400
*                                           major WQE            @02A*/ 23604600
*%WQESIZE = 'LENGTH(WQE)';               /* GET LENGTH OF WQE        */ 23650002
* @SPACE(5);                                                            23653500
*/********************************************************************/ 23657000
*/*                                                                  */ 23660500
*/*               VERSION LEVEL CONSTANTS                        @L1A*/ 23664000
*/*                                                                  */ 23667500
*/********************************************************************/ 23671000
* DCL WQESP211 FIXED(8) CONSTANT(1),     /* JBB2110 VERSION LEVEL       23674500
*                                                                @L1A*/ 23678000
*     WQESP220 FIXED(8) CONSTANT(2),     /* JBB2220 VERSION LEVEL       23681500
*                                                                @L5A*/ 23685000
*     WQESP410 FIXED(8) CONSTANT(3),     /* HBB4410 VERSION LEVEL       23688500
*                                                                @LEC*/ 23692000
*     WQESP422 FIXED(8) CONSTANT(4),     /* JBB4422 VERSION LEVEL       23695500
*                                                                @LJA*/ 23699000
*     WQESP440 FIXED(8) CONSTANT(5),     /* HBB5510 VERSION LEVEL       23702500
*                                                                @LMA*/ 23706000
*     WQE32623 FIXED(8) CONSTANT(8),     /* OW32623 version which means 23709500
*                                        a) all diagnostics from        23713000
*                                        OW26748 have been removed      23716500
*                                        b) the byte originally         23720000
*                                        reserved for the 4th byte      23723500
*                                        of descriptor codes is now     23727000
*                                        the routed to only-MCS         23730500
*                                        consoles count          @0AA*/ 23734000
*     WQEVRID  FIXED(8) CONSTANT(WQE32623); /* THE CURRENT VERSION      23737500
*                                           LEVEL                @0AC*/ 23741000
* @EJECT;                                                               23744500
*/********************************************************************/ 23750002
*/*                                                                  */ 23800002
*/*                      MAJOR WQE                                   */ 23850002
*/*                                                                  */ 23900002
*/********************************************************************/ 23950002
*                                                                       24000002
*DECLARE                                                                24050002
*  1 WMJM  BASED(WMJPTR) WMJMVIA BDY(WORD),                             24060000
*                                        /* START OF MAJOR WQE   @LFC*/ 24070000
*   2 WMJMEXT     PTR(31),               /* POINTER TO NEXT WQE  @L6C*/ 24080000
*   2 WMJMMLW     BIT(8),                /* MLWTO FLAGS              */ 24350002
*    3 WMJMMLWA BIT(1),                  /* DO NOT QUEUE MLWTO TO       24400002
*                                           CONSOLES                 */ 24450002
*    3 WMJMMLWB BIT(1),                  /* MAJOR WQE                */ 24500002
*    3 WMJMMLWC BIT(1),                  /* MINOR WQE                */ 24550002
*    3 WMJMMLWD BIT(1),                  /* CHAIN ALTERED            */ 24600002
*    3 WMJMMLWE BIT(1),                  /* WTL ISSUED               */ 24650002
*    3 WMJMMLWF BIT(1),                  /* QUEUEING TO START AT TOP    24700002
*                                           OF CHAIN                 */ 24750002
*    3 WMJMMLWG BIT(1),                  /* SERVICE THIS CHAIN       */ 24800002
*    3 WMJMMLWH BIT(1),                  /* MINOR WQE QUEUED HAS NO     24850002
*                                           TEXT                     */ 24900002
*   2 WMJMAREA    CHAR(1),               /* AREA ID                  */ 24950002
*   2 WMJMTXTL    FIXED(15),             /* LENGTH OF MESSAGE TEXT   */ 25000002
*   2 WMJMRTCT    PTR(15) BDY(WORD),     /* ROUTED WQE COUNT     @L5C*/ 25010000
*   2 WMJMUC      PTR(15),               /* USE COUNT            @L6C*/ 25020000
*   2 WMJMPAD     CHAR(1),               /* BLANK                    */ 25100002
*   2 WMJMTS      CHAR(8) BDY(WORD,2),   /* TIME STAMP         Y02710*/ 25110000
*     3 WMJMTSHH  CHAR(2),               /* HOURS PART OF TS   Y02710*/ 25120000
*     3 WMJMTSP1  CHAR(1),               /* DECIMAL POINT      Y02710*/ 25130000
*     3 WMJMTSMM  CHAR(2),               /* MINUTES PART OF TS Y02710*/ 25140000
*     3 WMJMTSP2  CHAR(1),               /* DECIMAL POINT      Y02710*/ 25150000
*     3 WMJMTSSS  CHAR(2),               /* SECONDS PART OF TS Y02710*/ 25160000
*   2 WMJMPAD1    CHAR(1),               /* BLANK                    */ 25200002
*   2 WMJMJBNM    CHAR(8),               /* JOBNAME INSERTED BY THE     25210000
*                                           SUBSYSTEM          Y02710*/ 25220000
*   2 WMJMPAD2    CHAR(1),               /* BLANK              Y02710*/ 25230000
*   2 WMJMTXT     CHAR(72) BDY(WORD,4),  /* MESSAGE TEXT (MAXIMUM       25240000
*                                           OF 72 BYTES)       Y02710*/ 25250000
*   2 WMJMHCID    CHAR(4) BDY(WORD,4),   /* HARDCOPY ID        Y02710*/ 25260000
*   2 WMJMPAD3    CHAR(1),               /* BLANK TO LINE UP            25270000
*                                           REMAINING FIELDS            25280000
*                                           Note this field was used    25290000
*                                           in OW26748, do not          25300000
*                                           reuse                @09C*/ 25310000
*   2 WMJMRESA    CHAR(8) BDY(WORD),     /* DUMMY MINOR CREATED BY      25320000
*                                           PURGE OS/VS2 REL1        */ 25330000
*   2 WQERSV29    PTR(31),               /* RESERVED           Y02710*/ 25340000
*   2 WQERSV30    FIXED(15),             /* RESERVED                 */ 25430002
*   2 WMJMSER     CHAR(2),               /* LINE CONTROL FLAGS       */ 25450002
*    3 WMJMSER1    BIT(8),               /* 1ST BYTE OF LINE CONTROL    25500002
*                                           FLAGS                    */ 25550002
*     4 WMJMSERA BIT(1),                 /* C LINE IN MAJOR WQE      */ 25600002
*     4 WMJMSERB BIT(1),                 /* ONE LABEL LINE FOUND     */ 25650002
*     4 WMJMSERC BIT(1),                 /* TWO LABEL LINES FOUND    */ 25700002
*     4 WMJMSERD BIT(1),                 /* LAST TYPE WAS CONTROL       25750002
*                                           LINE                     */ 25800002
*     4 WMJMSERE BIT(1),                 /* LAST TYPE WAS LABEL LINE */ 25850002
*     4 WQERSV31 BIT(1),                 /* RESERVED                 */ 25900002
*     4 WQERSV32 BIT(1),                 /* RESERVED                 */ 25910002
*     4 WQERSV33 BIT(1),                 /* RESERVED                 */ 25920002
*    3 WMJMSER2    BIT(8),               /* 2ND BYTE OF LINE CONTROL    25950002
*                                           FLAGS                    */ 26000002
*   2 WQERSVD2    CHAR(8) BDY(WORD),     /* RESERVED         @ZA38566*/ 26010000
*   2 WQERSV34    FIXED(15),             /* RESERVED **WMJMRESB**    */ 26100002
*   2 WMJMLTYP    CHAR(2),               /* LINE TYPE FLAGS          */ 26150002
*    3 WMJMLTY1    BIT(8),               /* 1ST BYTE OF LINE TYPE       26200002
*                                           FLAGS                    */ 26250002
*     4 WMJMLTYA BIT(1),                 /* CONTROL LINE             */ 26300002
*     4 WMJMLTYB BIT(1),                 /* LABEL LINE               */ 26350002
*     4 WMJMLTYC BIT(1),                 /* DATA LINE                */ 26400002
*     4 WMJMLTYD BIT(1),                 /* END LINE           ICB433*/ 26402002
*     4 WQERSV35 BIT(1),                 /* RESERVED                 */ 26450002
*     4 WQERSV36 BIT(1),                 /* RESERVED                 */ 26460002
*     4 WQERSV37 BIT(1),                 /* RESERVED                 */ 26470002
*     4 WQERSV38 BIT(1),                 /* RESERVED                 */ 26480002
*    3 WMJMLTY2    BIT(8),               /* 2ND BYTE OF LINE TYPE       26500002
*                                           FLAGS                    */ 26550002
*   2 WMJMMIN     PTR(31),               /* ADDR OF FIRST MINOR WQE  */ 26600002
*   2 WMJMAECB    CHAR(4) BDY(WORD),     /* ECB USED IN MLWTO        */ 26606200
*   2 WMJMMSGN    CHAR(4) BDY(WORD),     /* MLWTO ID           Y02710*/ 26612400
*   2 WMJMECBF    BIT(8) BDY(WORD),      /* STATUS FLAGS     @ZA38566*/ 26618600
*    3 WMJMWAIT BIT(1),                  /* USER IS WAITING ON          26624800
*                                           WMJMECB            Y02710*/ 26631000
*    3 WMJMMAJD BIT(1),                  /* SUBSYSTEM OR USERS EXIT HAS 26637200
*                                           ASKED TO DELETE THIS MLWTO  26643400
*                                                              Y02710*/ 26649600
*    3 WMJMCONS BIT(1),                  /* FRAME FULL CONTROL BIT      26655800
*                                                            @ZA38566*/ 26662000
*    3 WMJMPSB1 BIT(1),                  /* SAVE AREA FOR COMMUNICATION 26668200
*                                           BIT PASSED TO THE PRIMARY   26674400
*                                           SUBSYSTEM            @L1A*/ 26680600
*    3 WMJMRV9A BIT(1),                  /* RESERVED             @D6C*/ 26686800
*    3 WMJMWTP  BIT(1),                  /* MAJOR WQE TEXT HAS          26693000
                                            BEEN PUT/TPUT BY            26699200
                                            IEEJB840 - DON'T            26705400
                                            DO IT AGAIN          @P5C*/ 26711600
*    3 WQERSVD6 BIT(1),                  /* RESERVED           Y02710*/ 26717800
*    3 WQERSVD7 BIT(1),                  /* RESERVED           Y02710*/ 26724000
*   2 WQERSVD8    FIXED(24),             /* RESERVED           Y02710*/ 26730200
*   2 WQERSVA4    PTR(31),               /* RESERVED           Y02710*/ 26736400
*   2 WQERSVA5    PTR(31),               /* RESERVED           Y02710*/ 26742600
*   2 WMJMDSP     BIT(8) BDY(WORD),      /* DISPOSITION FLAGS        */ 26750002
*    3 WMJMDSPA BIT(1),                  /* PURGE THIS WQE           */ 26800002
*    3 WMJMDSPB BIT(1),                  /* QUEUE WQE TO HARDCOPY    */ 26850002
*    3 WMJMDSPC BIT(1),                  /* MUST BE ZERO             */ 26900002
*    3 WMJMDSPD BIT(1),                  /* QUEUED TO HARDCOPY       */ 26950002
*    3 WMJMDSPE BIT(1),                  /* MUST BE ZERO             */ 27000002
*    3 WMJMDSPF BIT(1),                  /* MESSAGE TO BE DOM'ED     */ 27010000
*    3 WMJMDSPG BIT(1),                  /* PROCESSING TEMPORARILY      27020000
*                                           SUSPENDED          Y02710*/ 27030000
*    3 WMJMDSPH BIT(1),                  /* MSG ISSUED BY AUTH USER     27040000
*                                                              Y02710*/ 27050000
*   2 WMJMASID    CHAR(2),               /* ASID OF USER       Y02710*/ 27060000
*   2 WMJMBUF     BIT(8) ABNORMAL,       /* BUFFER STATUS FLAGS  @08C*/ 27070000
*    3 WMJMBUFA BIT(1),                  /* WQE AVAILABLE            */ 27200002
*    3 WMJMBUFB BIT(1),                  /* WQE IN USE               */ 27250002
*    3 WMJMBUFC BIT(1),                  /* READY FOR HARDCOPY          27260000
*                                                              Y02710*/ 27270000
*    3 WMJMBUFD BIT(1),                  /* WQE ACQUIRED BY GETMAIN  */ 27350002
*    3 WMJMBUFE BIT(1),                  /* WQE SERVICED             */ 27400002
*    3 WMJMBUFF BIT(1),                  /* TPUT TO DO         Y02710*/ 27410000
*    3 WMJMBUFG BIT(1),                  /* WQE SUPPRESSED   @G384P2L*/ 27420000
*    3 WMJMTRCD BIT(1),                  /* MAJOR WQE HAS BEEN          27430000
*                                           MASTER TRACED    @G64MP2D*/ 27440000
*   2 WMJMTCB     PTR(31),               /* ADDR OF ISSUER'S TCB        27450000
*                                                              Y02710*/ 27460000
*   2 WMJMSEQ#    PTR(31),               /* WTO SEQUENCE NUMBER         27470000
*                                           (DOM/CONNECT ID) @YA06025*/ 27480000
*    3 WMJMSID     PTR(8),               /* SYSTEM ID            @L5A*/ 27490000
*    3 WMJMSEQ     PTR(24),              /* 24-BIT SEQUENCE NUMBER      27500000
*                                                            @YA06025*/ 27510000
*   2 WMJMCS      CHAR(2) BDY(WORD),     /* MCS FLAGS                */ 27650002
*    3 WMJMCS1     BIT(8),               /* 1ST BYTE OF MCS FLAGS    */ 27700002
*     4 WMJMCS1A BIT(1),                 /* ROUTING AND DESCRIPTOR      27710000
*                                           CODES EXIST              */ 27800002
*     4 WMJMCS1B BIT(1),                 /* QUEUE BY ID TO ACTIVE       27850002
*                                           CONSOLE                  */ 27900002
*     4 WMJMCS1C BIT(1),                 /* COMMAND RESPONSE         */ 27950002
*     4 WMJMCS1D BIT(1),                 /* MESSAGE TYPE FIELD          28000002
*                                           PRESENT                  */ 28050002
*     4 WMJMCS1E BIT(1),                 /* ACCEPTED REPLY TO A WTOR */ 28100002
*     4 WMJMCS1F BIT(1),                 /* BROADCAST (ROUTE TO         28110000
*                                           ACTIVE CONSOLES)         */ 28200002
*     4 WMJMCS1G BIT(1),                 /* QUEUE TO HARDCOPY ONLY   */ 28250002
*     4 WMJMCS1H BIT(1),                 /* QUEUE UNCONDITIONALLY BY    28300002
*                                           ID TO CONSOLE            */ 28350002
*    3 WMJMCS2     BIT(8),               /* 2ND BYTE OF MCS FLAGS    */ 28400002
*     4 WMJMCS2A BIT(1),                 /* DO NOT TIME STAMP        */ 28450002
*     4 WMJMCS2B BIT(1),                 /* MLWTO                    */ 28500002
*     4 WMJMCS2C BIT(1),                 /* PRIMARY SUBSYSTEM USE ONLY: 28510000
*                                           JES3: DO NOT LOG MINOR WQES 28520000
*                                                 IF THE MAJOR IS NOT   28530000
*                                                 HARDCOPIED            28540000
*                                           JES2: NOT USED       @L5C*/ 28550000
*     4 WMJMCS2D BIT(1),                 /* EXTENDED WPL FORMAT (WPX)   28560000
*                                           EXISTS               @L5C*/ 28570000
*     4 WMJMCS2E BIT(1),                 /* THE MESSAGE IS AN OPERATOR  28580000
*                                           COMMAND              @L4C*/ 28590000
*     4 WMJMCS2F BIT(1),                 /* BYPASS HARDCOPY QUEUEING */ 28600002
*     4 WMJMCS2G BIT(1),                 /* WQEBLK KEYWORD SPECIFIED    28610000
*                                                                @L5C*/ 28620000
*     4 WMJMCS2H BIT(1),                 /* RESERVED             @L5C*/ 28630000
*   2 WMJMMT      CHAR(2),               /* MESSAGE TYPE FLAGS       */ 28700002
*    3 WMJMMT1     BIT(8),               /* 1ST BYTE OF MESSAGE TYPE    28750002
*                                           FLAGS                    */ 28800002
*     4 WMJMMT1A BIT(1),                 /* DISPLAY JOBNAMES         */ 28850002
*     4 WMJMMT1B BIT(1),                 /* DISPLAY STATUS           */ 28900002
*     4 WQERSVA6 BIT(1),                 /* RESERVED  ***WMJMMT1C***    28910000
*                                                              Y02710*/ 28920000
*     4 WMJMMT1D BIT(1),                 /* MUST BE ZERO             */ 29000002
*     4 WQERSV50 BIT(1),                 /* RESERVED                 */ 29050002
*     4 WMJMMT1F BIT(1),                 /* MONITOR SESS             */ 29100002
*     4 WQERSV51 BIT(1),                 /* RESERVED                 */ 29150002
*     4 WQERSV52 BIT(1),                 /* RESERVED                 */ 29160002
*    3 WMJMMT2     BIT(8),               /* 2ND BYTE OF MESSAGE TYPE    29200002
*                                           FLAGS                    */ 29250002
*   2 WMJMRTC     CHAR(2) BDY(WORD),     /* ROUTING CODES            */ 29260000
*    3 WMJMRCT1    BIT(8),               /* 1ST BYTE OF ROUTING CODES*/ 29350002
*     4 WMJMRCTA BIT(1),                 /* MASTER CONSOLE           */ 29400002
*     4 WMJMRCTB BIT(1),                 /* MASTER CONSOLE INFO      */ 29450002
*     4 WMJMRCTC BIT(1),                 /* TAPE POOL                */ 29500002
*     4 WMJMRCTD BIT(1),                 /* DIRECT ACCESS POOL       */ 29550002
*     4 WMJMRCTE BIT(1),                 /* TAPE LIBRARY             */ 29600002
*     4 WMJMRCTF BIT(1),                 /* DISK LIBRARY             */ 29650002
*     4 WMJMRCTG BIT(1),                 /* UNIT RECORD POOL         */ 29700002
*     4 WMJMRCTH BIT(1),                 /* TELEPROCESSING CONTROL   */ 29750002
*    3 WMJMRCT2    BIT(8),               /* 2ND BYTE OF ROUTING CODES*/ 29800002
*     4 WMJMRCTI BIT(1),                 /* SYSTEM SECURITY          */ 29850002
*     4 WMJMRCTJ BIT(1),                 /* SYSTEM/ERROR MAINTENANCE */ 29900002
*     4 WMJMRCTK BIT(1),                 /* PROGRAMMER INFORMATION   */ 29950002
*     4 WMJMRCTL BIT(1),                 /* EMULATOR INFORMATION     */ 30000002
*     4 WMJMRCTM BIT(1),                 /* USER ROUTING CODE        */ 30050002
*     4 WMJMRCTN BIT(1),                 /* USER ROUTING CODE        */ 30100002
*     4 WMJMRCTO BIT(1),                 /* USER ROUTING CODE        */ 30150002
*     4 WMJMRCTP BIT(1),                 /* USER ROUTING CODE    @L5C*/ 30160000
*   2 WMJCHAR1   CHAR(1),                /* 1ST CHARACTER OF            30170000
*                                           TEXT                 @P3C*/ 30180000
*   2 WMJMFLG3    BIT(8),                /* MISCELLANEOUS FLAGS  @LDC*/ 30190000
*    3 WMJDLVRD BIT(1),                  /* WQE HAS BEEN DELIVERED TO   30200000
*                                           A CONSOLE ON THIS SYSTEM    30210000
*                                                                @LDA*/ 30220000
*    3 WMJDNDWQ    BIT(1),               /* DO NOT DELETE WTOR UNTIL    30230000
*                                            THIS BIT IS OFF     @LDA*/ 30240000
*    3 WMJNSYL     BIT(1),               /* DO NOT SEND THIS MESSAGE    30250000
*                                            TO SYSLOG           @D7A*/ 30260000
*    3 WMJJ3B1     BIT(1),               /* BIT FOR USE BY JES3 ONLY    30270000
*                                                                @D7A*/ 30280000
*    3 WMJJ3B2     BIT(1),               /* BIT FOR USE BY JES3 ONLY    30290000
*                                                                @D7A*/ 30300000
*   2 WMJMUID     CHAR(1) BDY(WORD),     /* UCM ENTRY ID             */ 30350002
*   2 WMJFLG1     CHAR(1),               /* MISCELLANEOUS FLAGS         30356000
*                                                            @G38OP2L*/ 30362000
*    3 WMJFLG11 BIT(1),                  /* THIS MESSAGE WAS PROCESSED  30368000
*                                           WHILE MPF WAS ACTIVE AND    30374000
*                                           HARDCOPY WAS AVAILABLE      30380000
*                                                            @G38OP2L*/ 30386000
*    3 WMJMRETN BIT(1),                  /* MSG IS TO BE RETAINED BY    30392000
*                                           AMRF                 @P1C*/ 30398000
*    3 WMJMNMOD BIT(1),                  /* THE CHARACTERISTICS OF THE  30404000
*                                           MESSAGE MAY NOT BE MODIFIED 30410000
*                                           BY THE PRIMARY SUBSYSTEM    30416000
*                                                                @L6C*/ 30422000
*    3 WMJMSQMC BIT(1),                  /* ACTION MESSAGE NOT QUEUED   30428000
*                                           TO ANY CONSOLE - DEFAULT    30434000
*                                           TO MASTER CONSOLE    @L6C*/ 30440000
*    3 WMJNOJLG BIT(1),                  /* SUPPRESS FROM JOB LOG       30446000
*                                                                @L6C*/ 30452000
*    3 WMJAUTOV BIT(1),                  /* INDICATES MPF AUTO SUPPORTED30458000
*                                                            @YA06920*/ 30464000
*    3 WMJPPNA  BIT(1),                  /* PROBLEM PROGRAM NONACTION   30470000
*                                           MSG MAJOR LINE   @YA15064*/ 30476000
*    3 WMJMRISS BIT(1),                  /* REISSUED MSG     @YA08767*/ 30482000
*   2 WQERSV54    FIXED(16),             /* RESERVED - MAPS TO          30488000
*                                           WQERPYID             @D4C*/ 30494000
*   2 WMJMDEC     CHAR(4) BDY(WORD),     /* DESCRIPTOR CODES         */ 30500002
*    3 WMJMDEC1    BIT(8),               /* 1ST BYTE OF DESCRIPTOR      30550002
*                                           CODES                    */ 30600002
*     4 WMJMDECA BIT(1),                 /* SYSTEM FAILURE MESSAGE   */ 30650002
*     4 WMJMDECB BIT(1),                 /* IMMEDIATE ACTION            30700002
*                                           REQUIRED MESSAGE         */ 30750002
*     4 WMJMDECC BIT(1),                 /* EVENTUAL ACTION             30800002
*                                           REQUIRED MESSAGE         */ 30850002
*     4 WMJMDECD BIT(1),                 /* SYSTEM STATUS MESSAGE    */ 30900002
*     4 WMJMDECE BIT(1),                 /* IMMEDIATE COMMAND           30950002
*                                           RESPONSE MESSAGE         */ 31000002
*     4 WMJMDECF BIT(1),                 /* JOB STATUS MESSAGE       */ 31050002
*     4 WMJMDECG BIT(1),                 /* APPLICATION PROGRAM/        31100002
*                                           PROCESSOR MESSAGE, OR       31110000
*                                           DELETE AT TASK TERMINATION  31120000
*                                                                @L5C*/ 31130000
*     4 WMJMDECH BIT(1),                 /* OUT-OF-LINE MESSAGE      */ 31200002
*    3 WMJMDEC2    BIT(8),               /* 2ND BYTE OF DESCRIPTOR      31250002
*                                           CODES                    */ 31300002
*     4 WMJMDECI BIT(1),                 /* OPERATOR REQUEST     @L5C*/ 31310000
*     4 WMJMDECJ BIT(1),                 /* DYNAMIC STATUS DISPLAY      31320000
*                                                                @L5A*/ 31330000
*     4 WMJMDECK BIT(1),                 /* CRITICAL EVENTUAL ACTION    31340000
*                                           MSG - DESCRIPTOR CODE 11    31350000
*                                                            @G64DPSS*/ 31360000
*     4 WMJMDECL BIT(1),                 /* DELIVERED BUT NOT HELD      31370000
*                                                                @LHC*/ 31380000
*     4 WMJMDECM BIT(1),                 /* PREVIOUSLY AUTOMATED @LJC*/ 31390000
*     4 WQERSV59 BIT(1),                 /* RESERVED                 */ 31440002
*     4 WQERSV60 BIT(1),                 /* RESERVED                 */ 31442002
*     4 WQERSV61 BIT(1),                 /* RESERVED                 */ 31444002
*    3 WMJMDEC3    BIT(8),               /* 3RD BYTE OF DESCRIPTOR      31450002
*                                           CODES - RESERVED            31450400
*                                           Note this field was used    31450800
*                                           in OW26748, do not          31451200
*                                           reuse                @09C*/ 31451600
*    3 WMJMCSCT    FIXED(8),             /* Count of MCS-only consoles  31452000
*                                           on the issuing system to    31452400
*                                           which a message is queued   31452800
*                                                                @0AC*/ 31453200
*   2 WMJMJTCB    PTR(31),               /* ADDR OF JOB STEP TCB        31453600
*                                                              Y02710*/ 31454000
*   2 WMJMVRSN FIXED(8),                 /* VERSION LEVEL        @L1A*/ 31454400
*   2 WMJMFLG2 BIT(8),                   /* MISC FLAGS BYTE 2    @LAC*/ 31454800
*    3 WMJMHNDL BIT(1),                  /* THIS MSG WILL BE DISPLAYED  31455200
*                                           BY ANOTHER CONSOLE HANDLER. 31455600
*                                           DO NOT FORCE MSG TO MASTER  31456000
*                                           CONSOLE IF NOT ROUTED.      31456400
*                                                            @YA09374*/ 31456800
*    3 WMJMLCPL BIT(1),                  /* MULTILINE IS COMPLETE       31457200
*                                                                @LAA*/ 31457600
*    3 WMJMFORN BIT(1),                  /* FOREIGN WQE          @LBA*/ 31458000
*    3 WMJMTRAN BIT(1),                  /* WQE HAS BEEN TRANSPORTED TO 31458400
*                                           ANOTHER SYSTEM       @LBA*/ 31458800
*    3 WMJSUPSJ BIT(1),                  /* ON = DON'T DISPLAY SYSTEM   31459200
*                                           NAME OR JOB NAME     @LDA*/ 31459600
*    3 WMJQXSYS BIT(1),                  /* ON = QUEUED TO A CONSOLE    31460000
*                                           ON ANOTHER SYSTEM           31460400
*                                           IN THE SYSPLEX       @P6A*/ 31460800
*    3 WMJQEXT  BIT(1),                  /* ON = QUEUED TO AN           31461200
*                                           EXTENDED CLASS       @P7A*/ 31461600
*    3 WMJQMCS  BIT(1),                  /* ON = QUEUED TO AN           31462000
*                                           MCS CONSOLE          @P7A*/ 31462400
*   2 WMJMCSE  CHAR(2),                  /* EXTENDED MCS FLAGS   @L5A*/ 31462800
*    3 WMJMCE1  BIT(8),                  /* FIRST BYTE           @L5A*/ 31463200
*     4 WMJEBUSY BIT(1),                 /* RETURN WITH BUSY RETURN     31463600
*                                           CODE IF BUFFER LIMITATIONS  31464000
*                                           EXCEEDED             @L5A*/ 31464400
*     4 WMJECONS BIT(1),                 /* FOUR-BYTE CONSOLE ID        31464800
*                                           SPECIFIED            @L5A*/ 31465200
*     4 WMJEDOMI BIT(1),                 /* DOM ID SPECIFIED @YA07436*/ 31465600
*     4 WMJECONN BIT(1),                 /* CONNECT ID SPECIFIED @L5A*/ 31466000
*     4 WMJEWTOR BIT(1),                 /* WTOR WITH EXTENDED          31466400
*                                           PARAMETER LIST       @L5A*/ 31466800
*     4 WMJEPRIO BIT(1),                 /* PRIORITY SPECIFIED   @L5A*/ 31467200
*     4 WMJMCNM  BIT(1),                 /* CONSOLE NAME SPECIFIED      31467600
*                                                                @L7A*/ 31468000
*   3 WMJMCE2   BIT(8),                  /* SECOND BYTE OF EXT MCS      31468400
*                                           FLAGS                @L5A*/ 31468800
*     4 WMJMTXTA BIT(1),                 /* UNUSED IN WQE - TEXT        31469200
*                                           PARAMETER SPECIFIED ON      31469600
*                                           WTO MACRO            @L9A*/ 31470000
*     4 WMJMRV99 BIT(1),                 /* RESERVED             @D1A*/ 31470400
*     4 WMJMRV9B BIT(1),                 /* RESERVED             @D6C*/ 31470800
*     4 WMJMRV9C BIT(1),                 /* RESERVED             @D6C*/ 31471200
*     4 WMJMRV1A BIT(1),                 /* RESERVED             @LFC*/ 31471600
*     4 WMJMRV1B BIT(1),                 /* RESERVED             @LFA*/ 31472000
*     4 WMJMRV1C BIT(1),                 /* RESERVED             @LFA*/ 31472400
*     4 WMJMRV1D BIT(1),                 /* RESERVED             @LFA*/ 31472800
*   2 WMJMSNM  CHAR(8),                  /* THE NAME OF THE SYSTEM      31473200
*                                           ON WHICH THIS MESSAGE       31473600
*                                           WAS ISSUED           @L5C*/ 31474000
*   2 WMJMDATE CHAR(5),                  /* DATE WTO ISSUED      @L4C*/ 31474400
*   2 WMJMTS2  CHAR(3),                  /* TENTHS AND HUNDREDTHS OF    31474800
*                                           A SECOND             @L4A*/ 31475200
*   2 WMJMXMOD CHAR(4),                  /* COPY OF REQUEST FLAGS       31475600
*                                           (CTXTRFLG) FROM THE WTO     31476000
*                                           USER EXIT INTERFACE         31476400
*                                           ROUTINE              @L3A*/ 31476800
*    3 WMJMFLGS,                         /* COMM TASK USER EXIT         31477200
*                                           REQUESTS             @L3A*/ 31477600
*     4 WMJMRFB1 BIT(8),                 /* REQUEST FLAGS BYTE          31478000
*                                           ONE                  @L3A*/ 31478400
*      5 WMJMRCMT BIT(1),                /* CHANGE THE MESSAGE          31478800
*                                           TEXT                 @L3A*/ 31479200
*      5 WMJMRCRC BIT(1),                /* CHANGE THE ROUTING          31479600
*                                           CODE(S)              @L3A*/ 31480000
*      5 WMJMRCDC BIT(1),                /* CHANGE THE DESCRIPTOR       31480400
*                                           CODE(S)              @L3A*/ 31480800
*      5 WMJMRQPC BIT(1),                /* QUEUE TO A PARTICULAR       31481200
*                                           ACTIVE CONSOLE       @L3A*/ 31481600
*      5 WMJMRQUN BIT(1),                /* QUEUE TO A PARTICULAR       31482000
*                                           CONSOLE UNCONDITIONALLY     31482400
*                                                                @L3A*/ 31482800
*      5 WMJMRQRC BIT(1),                /* QUEUE BY ROUTING CODES      31483200
*                                           ONLY                 @L3A*/ 31483600
*      5 WMJMRCCN BIT(1),                /* CHANGE THE CONSOLE ID       31484000
*                                                                @L3A*/ 31484400
*      5 WMJMRPML BIT(1),                /* PROCESS MINOR LINES  @L3A*/ 31484800
*     4 WMJMRFB2 BIT(8),                 /* REQUEST FLAGS BYTE          31485200
*                                           TWO                  @L3A*/ 31485600
*      5 WMJMRDTM BIT(1),                /* DELETE THE MESSAGE   @L3A*/ 31486000
*      5 WMJMROMS BIT(1),                /* OVERRIDE MPF SUPPRESSION    31486400
*                                                                @L3A*/ 31486800
*      5 WMJMRFHC BIT(1),                /* FORCE HARDCOPY       @L3A*/ 31487200
*      5 WMJMRFNC BIT(1),                /* FORCE NO HARDCOPY    @D6C*/ 31487600
*      5 WMJMRHCO BIT(1),                /* FORCE HARDCOPY ONLY  @L3A*/ 31488000
*      5 WMJMRBCA BIT(1),                /* BROADCAST MESSAGE TO        31488400
*                                           ACTIVE CONSOLES      @L3A*/ 31488800
*      5 WMJMRBCN BIT(1),                /* DO NOT BROADCAST MESSAGE    31489200
*                                           TO ACTIVE CONSOLES   @L3A*/ 31489600
*      5 WMJMRNRT BIT(1),                /* AMRF IS NOT TO RETAIN THIS  31490000
*                                           MSG                  @P1C*/ 31490400
*     4 WMJMRFB3 BIT(8),                 /* REQUEST FLAGS BYTE THREE    31490800
*                                                                @P1C*/ 31491200
*      5 WMJMRRET BIT(1),                /* AMRF IS TO RETAIN THIS      31491600
*                                           MSG                  @P1A*/ 31492000
*      5 WMJMRCKY BIT(1),                /* CHANGE THE RETRIEVAL KEY    31492400
*                                                                @L5A*/ 31492800
*      5 WMJMRCFC BIT(1),                /* CHANGE THE 4-BYTE CONSOLE   31493200
*                                           ID                   @L5A*/ 31493600
*      5 WMJMRCMF BIT(1),                /* CHANGE THE MESSAGE TYPE     31494000
*                                           FLAGS                @L5A*/ 31494400
*      5 WMJRANO  BIT(1),                /* AUTOMATION IS NOT REQUIRED  31494800
*                                                            @YA06920*/ 31495200
*      5 WMJRAYS  BIT(1),                /* AUTOMATION IS REQUIRED      31495600
*                                           AND/OR AUTOMATION TOKEN     31496000
*                                           UPDATED          @YA06920*/ 31496400
*      5 WMJMQHCO BIT(1),                /* MESSAGE ISSUED AS HARDCOPY  31496800
*                                           ONLY             @YA22959*/ 31497200
*      5 WMJMHUD  BIT(1),                /* UD TO HARDCOPY FLAG  @D3A*/ 31497600
*    3 WMJMSUPB BIT(8),                  /* SUPPRESSION BYTE     @L3A*/ 31498000
*     4 WMJMSNSV BIT(1),                 /* NOT SERVICED BY ANY WTO     31498400
*                                           USER EXIT ROUTINE    @L3A*/ 31498800
*     4 WMJMSEER BIT(1),                 /* ESTAE ERROR IN IEAVX600     31499200
*                                                                @L3A*/ 31499600
*     4 WMJMSNSI BIT(1),                 /* NOT SERVICED BECAUSE OF     31500000
*                                           AN INCOMPATIBLE REQUEST     31500400
*                                                                @L3A*/ 31500800
*     4 WMJMSAUT BIT(1),                 /* INDICATE AUTOMATION         31501200
*                                           REQUESTED        @YA06920*/ 31501600
*     4 WMJMSQED BIT(1),                 /* NOT QUEUED TO ANY CONSOLE   31502000
*                                                                @L3A*/ 31502400
*     4 WMJMSSSI BIT(1),                 /* SUPPRESSED BY A SUBSYSTEM   31502800
*                                                                @L3A*/ 31503200
*     4 WMJMSWTO BIT(1),                 /* SUPPRESSED BY A WTO USER    31503600
*                                           EXIT ROUTINE         @L3A*/ 31504000
*     4 WMJMSMPF BIT(1),                 /* SUPPRESSED BY MPF    @L3A*/ 31504400
*   2 WMJMMLVL,                          /* MESSAGE LEVEL MASK FOR      31504800
*                                           QUEUING              @L3C*/ 31505200
*    3 WMJMML1  BIT(8),                  /* FIRST BYTE OF LEVEL         31505600
*                                           INDICATORS           @L2A*/ 31506000
*     4 WMJMMLR  BIT(1),                 /* WTOR                 @L2A*/ 31506400
*     4 WMJMMLIA BIT(1),                 /* IMMEDIATE                   31506800
*                                           ACTION MESSAGE       @L2A*/ 31507200
*     4 WMJMMLCE BIT(1),                 /* CRITICAL EVENTUAL           31507600
*                                           ACTION MESSAGE       @L2A*/ 31508000
*     4 WMJMMLE  BIT(1),                 /* EVENTUAL                    31508400
*                                           ACTION MESSAGE       @L2A*/ 31508800
*     4 WMJMMLI  BIT(1),                 /* INFORMATIONAL               31509200
*                                           MESSAGE              @L2A*/ 31509600
*     4 WMJMMLBC BIT(1),                 /* BROADCAST                   31510000
*                                           MESSAGE              @L2A*/ 31510400
*     4 *        BIT(2),                 /* RESERVED             @L3A*/ 31510800
*    3 WMJMML2  BIT(8),                  /* RESERVED             @L2A*/ 31511200
*   2 WMJMLENG FIXED(15),                /* WQE SIZE         @YA08767*/ 31511600
*   2 WMJDSQN  PTR(31),                  /* UNIVERSAL DISPLAY SEQUENCE  31512000
*                                           NUMBER               @L5A*/ 31512400
*   2 WMJMERC  CHAR(16),                 /* EXTENDED ROUTING CODES      31512800
*                                                                @L5A*/ 31513200
*    3 WMJMRC1  BIT(8),                  /* BYTE 1  - EXTENDED          31513600
*                                           ROUTING CODES        @L5A*/ 31514000
*     4 WMJRC1   BIT(1),                 /* MASTER CONSOLE       @L5A*/ 31514400
*     4 WMJRC2   BIT(1),                 /* MASTER CONSOLE INFO  @L5A*/ 31514800
*     4 WMJRC3   BIT(1),                 /* TAPE POOL            @L5A*/ 31515200
*     4 WMJRC4   BIT(1),                 /* DIRECT ACCESS POOL   @L5A*/ 31515600
*     4 WMJRC5   BIT(1),                 /* TAPE LIBRARY         @L5A*/ 31516000
*     4 WMJRC6   BIT(1),                 /* DISK LIBRARY         @L5A*/ 31516400
*     4 WMJRC7   BIT(1),                 /* UNIT RECORD POOL     @L5A*/ 31516800
*     4 WMJRC8   BIT(1),                 /* TELEPROCESSING CONTROL      31517200
*                                                                @L5A*/ 31517600
*    3 WMJMRC2  BIT(8),                  /* BYTE 2  - EXTENDED          31518000
*                                           ROUTING CODES        @L5A*/ 31518400
*     4 WMJRC9   BIT(1),                 /* SYSTEM SECURITY      @L5A*/ 31518800
*     4 WMJRC10  BIT(1),                 /* SYSTEM/ERROR MAINTENANCE    31519200
*                                                                @L5A*/ 31519600
*     4 WMJRC11  BIT(1),                 /* PROGRAMMER INFORMATION      31520000
*                                                                @L5A*/ 31520400
*     4 WMJRC12  BIT(1),                 /* EMULATOR INFORMATION @L5A*/ 31520800
*     4 WMJRC13  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31521200
*     4 WMJRC14  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31521600
*     4 WMJRC15  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31522000
*     4 WMJRC16  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31522400
*    3 WMJMRC3  BIT(8),                  /* BYTE 3  - EXTENDED          31522800
*                                           ROUTING CODES        @L5A*/ 31523200
*     4 WMJRC17  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31523600
*     4 WMJRC18  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31524000
*     4 WMJRC19  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31524400
*     4 WMJRC20  BIT(1),                 /* USER ROUTING CODE    @L5A*/ 31524800
*     4 WMJRC21  BIT(1),                 /* RESERVED FOR JES            31525200
*                                           USAGE                @L5A*/ 31525600
*     4 WMJRC22  BIT(1),                 /* RESERVED FOR JES            31526000
*                                           USAGE                @L5A*/ 31526400
*     4 WMJRC23  BIT(1),                 /* RESERVED FOR JES            31526800
*                                           USAGE                @L5A*/ 31527200
*     4 WMJRC24  BIT(1),                 /* RESERVED FOR JES            31527600
*                                           USAGE                @L5A*/ 31528000
*    3 WMJMRC4  BIT(8),                  /* BYTE 4  - EXTENDED          31528400
*                                           ROUTING CODES        @L5A*/ 31528800
*     4 WMJRC25  BIT(1),                 /* RESERVED FOR JES            31529200
*                                           USAGE                @L5A*/ 31529600
*     4 WMJRC26  BIT(1),                 /* RESERVED FOR JES            31530000
*                                           USAGE                @L5A*/ 31530400
*     4 WMJRC27  BIT(1),                 /* RESERVED FOR JES            31530800
*                                           USAGE                @L5A*/ 31531200
*     4 WMJRC28  BIT(1),                 /* RESERVED FOR JES            31531600
*                                           USAGE                @L5A*/ 31532000
*     4 WMJRC29  BIT(1),                 /* RESERVED             @L5A*/ 31532400
*     4 WMJRC30  BIT(1),                 /* RESERVED             @L5A*/ 31532800
*     4 WMJRC31  BIT(1),                 /* RESERVED             @L5A*/ 31533200
*     4 WMJRC32  BIT(1),                 /* RESERVED             @L5A*/ 31533600
*    3 WMJMRC5  BIT(8),                  /* BYTE 5  - EXTENDED          31534000
*                                           ROUTING CODES        @L5A*/ 31534400
*     4 WMJRC33  BIT(1),                 /* RESERVED             @L5A*/ 31534800
*     4 WMJRC34  BIT(1),                 /* RESERVED             @L5A*/ 31535200
*     4 WMJRC35  BIT(1),                 /* RESERVED             @L5A*/ 31535600
*     4 WMJRC36  BIT(1),                 /* RESERVED             @L5A*/ 31536000
*     4 WMJRC37  BIT(1),                 /* RESERVED             @L5A*/ 31536400
*     4 WMJRC38  BIT(1),                 /* RESERVED             @L5A*/ 31536800
*     4 WMJRC39  BIT(1),                 /* RESERVED             @L5A*/ 31537200
*     4 WMJRC40  BIT(1),                 /* RESERVED             @L5A*/ 31537600
*    3 WMJMRC6  BIT(8),                  /* BYTE 6  - EXTENDED          31538000
*                                           ROUTING CODES        @L5A*/ 31538400
*     4 WMJRC41  BIT(1),                 /* JOB STATUS MSG   @YA10057*/ 31538800
*     4 WMJRC42  BIT(1),                 /* GENERAL INFO ABOUT JES2     31539200
*                                           OR JES3              @L5A*/ 31539600
*     4 WMJRC43  BIT(1),                 /* RESERVED FOR JES USAGE      31540000
*                                                                @L5A*/ 31540400
*     4 WMJRC44  BIT(1),                 /* RESERVED FOR JES USAGE      31540800
*                                                                @L5A*/ 31541200
*     4 WMJRC45  BIT(1),                 /* RESERVED FOR JES USAGE      31541600
*                                                                @L5A*/ 31542000
*     4 WMJRC46  BIT(1),                 /* RESERVED FOR JES USAGE      31542400
*                                                                @L5A*/ 31542800
*     4 WMJRC47  BIT(1),                 /* RESERVED FOR JES USAGE      31543200
*                                                                @L5A*/ 31543600
*     4 WMJRC48  BIT(1),                 /* RESERVED FOR JES USAGE      31544000
*                                                                @L5A*/ 31544400
*    3 WMJMRC7  BIT(8),                  /* BYTE 7  - EXTENDED          31544800
*                                           ROUTING CODES        @L5A*/ 31545200
*     4 WMJRC49  BIT(1),                 /* RESERVED FOR JES USAGE      31545600
*                                                                @L5A*/ 31546000
*     4 WMJRC50  BIT(1),                 /* RESERVED FOR JES USAGE      31546400
*                                                                @L5A*/ 31546800
*     4 WMJRC51  BIT(1),                 /* RESERVED FOR JES USAGE      31547200
*                                                                @L5A*/ 31547600
*     4 WMJRC52  BIT(1),                 /* RESERVED FOR JES USAGE      31548000
*                                                                @L5A*/ 31548400
*     4 WMJRC53  BIT(1),                 /* RESERVED FOR JES USAGE      31548800
*                                                                @L5A*/ 31549200
*     4 WMJRC54  BIT(1),                 /* RESERVED FOR JES USAGE      31549600
*                                                                @L5A*/ 31550000
*     4 WMJRC55  BIT(1),                 /* RESERVED FOR JES USAGE      31550400
*                                                                @L5A*/ 31550800
*     4 WMJRC56  BIT(1),                 /* RESERVED FOR JES USAGE      31551200
*                                                                @L5A*/ 31551600
*    3 WMJMRC8  BIT(8),                  /* BYTE 8  - EXTENDED          31552000
*                                           ROUTING CODES        @L5A*/ 31552400
*     4 WMJRC57  BIT(1),                 /* RESERVED FOR JES USAGE      31552800
*                                                                @L5A*/ 31553200
*     4 WMJRC58  BIT(1),                 /* RESERVED FOR JES USAGE      31553600
*                                                                @L5A*/ 31554000
*     4 WMJRC59  BIT(1),                 /* RESERVED FOR JES USAGE      31554400
*                                                                @L5A*/ 31554800
*     4 WMJRC60  BIT(1),                 /* RESERVED FOR JES USAGE      31555200
*                                                                @L5A*/ 31555600
*     4 WMJRC61  BIT(1),                 /* RESERVED FOR JES USAGE      31556000
*                                                                @L5A*/ 31556400
*     4 WMJRC62  BIT(1),                 /* RESERVED FOR JES USAGE      31556800
*                                                                @L5A*/ 31557200
*     4 WMJRC63  BIT(1),                 /* RESERVED FOR JES USAGE      31557600
*                                                                @L5A*/ 31558000
*     4 WMJRC64  BIT(1),                 /* RESERVED FOR JES USAGE      31558400
*                                                                @L5A*/ 31558800
*    3 WMJMRC9  BIT(8),                  /* BYTE 9  - EXTENDED          31559200
*                                           ROUTING CODES        @L5A*/ 31559600
*     4 WMJRC65  BIT(1),                 /* PROCESSOR RELATED           31560000
*                                           MESSAGE              @L5A*/ 31560400
*     4 WMJRC66  BIT(1),                 /* PROCESSOR RELATED           31560800
*                                           MESSAGE              @L5A*/ 31561200
*     4 WMJRC67  BIT(1),                 /* PROCESSOR RELATED           31561600
*                                           MESSAGE              @L5A*/ 31562000
*     4 WMJRC68  BIT(1),                 /* PROCESSOR RELATED           31562400
*                                           MESSAGE              @L5A*/ 31562800
*     4 WMJRC69  BIT(1),                 /* PROCESSOR RELATED           31563200
*                                           MESSAGE              @L5A*/ 31563600
*     4 WMJRC70  BIT(1),                 /* PROCESSOR RELATED           31564000
*                                           MESSAGE              @L5A*/ 31564400
*     4 WMJRC71  BIT(1),                 /* PROCESSOR RELATED           31564800
*                                           MESSAGE              @L5A*/ 31565200
*     4 WMJRC72  BIT(1),                 /* PROCESSOR RELATED           31565600
*                                           MESSAGE              @L5A*/ 31566000
*    3 WMJMRC10 BIT(8),                  /* BYTE 10 - EXTENDED          31566400
*                                           ROUTING CODES        @L5A*/ 31566800
*     4 WMJRC73  BIT(1),                 /* PROCESSOR RELATED           31567200
*                                           MESSAGE              @L5A*/ 31567600
*     4 WMJRC74  BIT(1),                 /* PROCESSOR RELATED           31568000
*                                           MESSAGE              @L5A*/ 31568400
*     4 WMJRC75  BIT(1),                 /* PROCESSOR RELATED           31568800
*                                           MESSAGE              @L5A*/ 31569200
*     4 WMJRC76  BIT(1),                 /* PROCESSOR RELATED           31569600
*                                           MESSAGE              @L5A*/ 31570000
*     4 WMJRC77  BIT(1),                 /* PROCESSOR RELATED           31570400
*                                           MESSAGE              @L5A*/ 31570800
*     4 WMJRC78  BIT(1),                 /* PROCESSOR RELATED           31571200
*                                           MESSAGE              @L5A*/ 31571600
*     4 WMJRC79  BIT(1),                 /* PROCESSOR RELATED           31572000
*                                           MESSAGE              @L5A*/ 31572400
*     4 WMJRC80  BIT(1),                 /* PROCESSOR RELATED           31572800
*                                           MESSAGE              @L5A*/ 31573200
*    3 WMJMRC11 BIT(8),                  /* BYTE 11 - EXTENDED          31573600
*                                           ROUTING CODES        @L5A*/ 31574000
*     4 WMJRC81  BIT(1),                 /* PROCESSOR RELATED           31574400
*                                           MESSAGE              @L5A*/ 31574800
*     4 WMJRC82  BIT(1),                 /* PROCESSOR RELATED           31575200
*                                           MESSAGE              @L5A*/ 31575600
*     4 WMJRC83  BIT(1),                 /* PROCESSOR RELATED           31576000
*                                           MESSAGE              @L5A*/ 31576400
*     4 WMJRC84  BIT(1),                 /* PROCESSOR RELATED           31576800
*                                           MESSAGE              @L5A*/ 31577200
*     4 WMJRC85  BIT(1),                 /* PROCESSOR RELATED           31577600
*                                           MESSAGE              @L5A*/ 31578000
*     4 WMJRC86  BIT(1),                 /* PROCESSOR RELATED           31578400
*                                           MESSAGE              @L5A*/ 31578800
*     4 WMJRC87  BIT(1),                 /* PROCESSOR RELATED           31579200
*                                           MESSAGE              @L5A*/ 31579600
*     4 WMJRC88  BIT(1),                 /* PROCESSOR RELATED           31580000
*                                           MESSAGE              @L5A*/ 31580400
*    3 WMJMRC12 BIT(8),                  /* BYTE 12 - EXTENDED          31580800
*                                           ROUTING CODES        @L5A*/ 31581200
*     4 WMJRC89  BIT(1),                 /* PROCESSOR RELATED           31581600
*                                           MESSAGE              @L5A*/ 31582000
*     4 WMJRC90  BIT(1),                 /* PROCESSOR RELATED           31582400
*                                           MESSAGE              @L5A*/ 31582800
*     4 WMJRC91  BIT(1),                 /* PROCESSOR RELATED           31583200
*                                           MESSAGE              @L5A*/ 31583600
*     4 WMJRC92  BIT(1),                 /* PROCESSOR RELATED           31584000
*                                           MESSAGE              @L5A*/ 31584400
*     4 WMJRC93  BIT(1),                 /* PROCESSOR RELATED           31584800
*                                           MESSAGE              @L5A*/ 31585200
*     4 WMJRC94  BIT(1),                 /* PROCESSOR RELATED           31585600
*                                           MESSAGE              @L5A*/ 31586000
*     4 WMJRC95  BIT(1),                 /* PROCESSOR RELATED           31586400
*                                           MESSAGE              @L5A*/ 31586800
*     4 WMJRC96  BIT(1),                 /* PROCESSOR RELATED           31587200
*                                           MESSAGE              @L5A*/ 31587600
*    3 WMJMRC13 BIT(8),                  /* BYTE 13 - EXTENDED          31588000
*                                           ROUTING CODES        @L5A*/ 31588400
*     4 WMJRC97  BIT(1),                 /* DEVICE RELATED              31588800
*                                           MESSAGE              @L5A*/ 31589200
*     4 WMJRC98  BIT(1),                 /* DEVICE RELATED              31589600
*                                           MESSAGE              @L5A*/ 31590000
*     4 WMJRC99  BIT(1),                 /* DEVICE RELATED              31590400
*                                           MESSAGE              @L5A*/ 31590800
*     4 WMJRC100 BIT(1),                 /* DEVICE RELATED              31591200
*                                           MESSAGE              @L5A*/ 31591600
*     4 WMJRC101 BIT(1),                 /* DEVICE RELATED              31592000
*                                           MESSAGE              @L5A*/ 31592400
*     4 WMJRC102 BIT(1),                 /* DEVICE RELATED              31592800
*                                           MESSAGE              @L5A*/ 31593200
*     4 WMJRC103 BIT(1),                 /* DEVICE RELATED              31593600
*                                           MESSAGE              @L5A*/ 31594000
*     4 WMJRC104 BIT(1),                 /* DEVICE RELATED              31594400
*                                           MESSAGE              @L5A*/ 31594800
*    3 WMJMRC14 BIT(8),                  /* BYTE 14 - EXTENDED          31595200
*                                           ROUTING CODES        @L5A*/ 31595600
*     4 WMJRC105 BIT(1),                 /* DEVICE RELATED              31596000
*                                           MESSAGE              @L5A*/ 31596400
*     4 WMJRC106 BIT(1),                 /* DEVICE RELATED              31596800
*                                           MESSAGE              @L5A*/ 31597200
*     4 WMJRC107 BIT(1),                 /* DEVICE RELATED              31597600
*                                           MESSAGE              @L5A*/ 31598000
*     4 WMJRC108 BIT(1),                 /* DEVICE RELATED              31598400
*                                           MESSAGE              @L5A*/ 31598800
*     4 WMJRC109 BIT(1),                 /* DEVICE RELATED              31599200
*                                           MESSAGE              @L5A*/ 31599600
*     4 WMJRC110 BIT(1),                 /* DEVICE RELATED              31600000
*                                           MESSAGE              @L5A*/ 31600400
*     4 WMJRC111 BIT(1),                 /* DEVICE RELATED              31600800
*                                           MESSAGE              @L5A*/ 31601200
*     4 WMJRC112 BIT(1),                 /* DEVICE RELATED              31601600
*                                           MESSAGE              @L5A*/ 31602000
*    3 WMJMRC15 BIT(8),                  /* BYTE 15 - EXTENDED          31602400
*                                           ROUTING CODES        @L5A*/ 31602800
*     4 WMJRC113 BIT(1),                 /* DEVICE RELATED              31603200
*                                           MESSAGE              @L5A*/ 31603600
*     4 WMJRC114 BIT(1),                 /* DEVICE RELATED              31604000
*                                           MESSAGE              @L5A*/ 31604400
*     4 WMJRC115 BIT(1),                 /* DEVICE RELATED              31604800
*                                           MESSAGE              @L5A*/ 31605200
*     4 WMJRC116 BIT(1),                 /* DEVICE RELATED              31605600
*                                           MESSAGE              @L5A*/ 31606000
*     4 WMJRC117 BIT(1),                 /* DEVICE RELATED              31606400
*                                           MESSAGE              @L5A*/ 31606800
*     4 WMJRC118 BIT(1),                 /* DEVICE RELATED              31607200
*                                           MESSAGE              @L5A*/ 31607600
*     4 WMJRC119 BIT(1),                 /* DEVICE RELATED              31608000
*                                           MESSAGE              @L5A*/ 31608400
*     4 WMJRC120 BIT(1),                 /* DEVICE RELATED              31608800
*                                           MESSAGE              @L5A*/ 31609200
*    3 WMJMRC16 BIT(8),                  /* BYTE 16 - EXTENDED          31609600
*                                           ROUTING CODES        @L5A*/ 31610000
*     4 WMJRC121 BIT(1),                 /* DEVICE RELATED              31610400
*                                           MESSAGE              @L5A*/ 31610800
*     4 WMJRC122 BIT(1),                 /* DEVICE RELATED              31611200
*                                           MESSAGE              @L5A*/ 31611600
*     4 WMJRC123 BIT(1),                 /* DEVICE RELATED              31612000
*                                           MESSAGE              @L5A*/ 31612400
*     4 WMJRC124 BIT(1),                 /* DEVICE RELATED              31612800
*                                           MESSAGE              @L5A*/ 31613200
*     4 WMJRC125 BIT(1),                 /* DEVICE RELATED              31613600
*                                           MESSAGE              @L5A*/ 31614000
*     4 WMJRC126 BIT(1),                 /* DEVICE RELATED              31614400
*                                           MESSAGE              @L5A*/ 31614800
*     4 WMJRC127 BIT(1),                 /* DEVICE RELATED              31615200
*                                           MESSAGE              @L5A*/ 31615600
*     4 WMJRC128 BIT(1),                 /* DEVICE RELATED              31616000
*                                           MESSAGE              @L5A*/ 31616400
*   2 WMJMKEY  CHAR(8),                  /* RETRIEVAL KEY        @L5A*/ 31616800
*   2 WMJMTOKN PTR(31),                  /* TOKEN FOR DOM        @L5A*/ 31617200
*   2 WMJMCNID CHAR(4),                  /* FULLWORD CONSOLE ID  @L5A*/ 31617600
*   2 WMJMOJBI CHAR(8),                  /* ORIGINATING JOB ID   @L5A*/ 31618000
*   2 WMJMOJBN CHAR(8),                  /* ORIGINATING JOB NAME @L5A*/ 31618400
*   2 WMJMPRTY FIXED(15),                /* MESSAGE'S PRIORITY   @L6A*/ 31618800
*   2 WMJAUTOT CHAR(8),                  /* AUTOMATION TOKEN VALUE      31619200
*                                                            @YA06920*/ 31619600
*   2 WMJERFS     CHAR(4),      /* EXTENDED REQUEST FLAGS  (FROM        31620000
*                                  THE USER EXIT TO THE SYSTEM)         31620400
*                                                            @YA08767*/ 31620800
*     4 WMJMERF1   BIT(8),      /* REQUEST FLAGS BYTE ONE        @D6C*/ 31621200
*       6 WMJEMRY  BIT(1),      /* PRIMARY SUBSYSTEM CAN                31621600
*                                  ALTER MSG ROUTING         @YA08767*/ 31622000
*       6 WMJEMRN  BIT(1),      /* PRIMARY SUBSYSTEM CAN NOT            31622400
*                                  ALTER MSG ROUTING         @YA08767*/ 31622800
*       6 WMJEMCO  BIT(1),      /* REQUEST TO CHANGE MESSAGE COLOR      31623200
*                                                                @LEA*/ 31623600
*       6 WMJEMHI  BIT(1),      /* REQUEST TO CHANGE MESSAGE            31624000
*                                  HIGHLIGHTING                  @LEA*/ 31624400
*       6 WMJEMIN  BIT(1),      /* REQUEST TO CHANGE MESSAGE INTENSITY  31624800
*                                                                @LEA*/ 31625200
*     4 WMJERF2    BIT(8),      /* REQUEST FLAGS BYTE TWO    @YA08767*/ 31625600
*     4 WMJERF3    BIT(8),      /* REQUEST FLAGS BYTE THREE  @YA08767*/ 31626000
*       6 WMJESJL  BIT(1),      /* REQUEST TO SUPPRESS MESSAGE FROM     31626400
*                                  THE JOBLOG                    @PLA*/ 31626800
*       6 WMJNWTP  BIT(1),      /* REQUEST TO NOT DO WTP PROCESSING     31627200
*                                  (NO SYSMSG OR TPUT)           @PLA*/ 31627600
*     4 WMJERF4    BIT(8),      /* REQUEST FLAGS BYTE FOUR   @YA08767*/ 31628000
*   2 WMJJ3RTC     BIT(8),      /* JES3 GLOBAL ROUTING - FOR USE BY     31628400
*                                  JES3 ONLY                 @YA10055*/ 31628800
*   2 WMJJ3MRC     BIT(8),      /* GLOBAL MESSAGE ROUTING CONTROLS      31629200
*                                  - FOR USE BY JES3 ONLY    @YA10055*/ 31629600
*   2 WMJJ3CON     FIXED(15),   /* JES3 CONSOLE ID (FOR MINOR WQE       31630000
*                                  PROCESSING) -                        31630400
*                                  FOR USE BY JES3 ONLY      @YA10055*/ 31630800
*   2 WMJMCNME CHAR(8),                  /* CONSOLE NAME         @L7A*/ 31631200
*   2 WMJMCART CHAR(8),                  /* CART TOKEN           @L8A*/ 31631600
*   2 WMJMXIF  CHAR(2),                  /* MISCELLANEOUS AND MINOR     31632000
*                                           ERROR INFORMATION           31632400
*                                           FLAGS                @L9A*/ 31632800
*    3 WMJMXIF1 BIT(8),                  /* MISC AND MINOR ERROR        31633200
*                                           FLAG BYTE 1          @L9A*/ 31633600
*     4 WMJMTXTR BIT(1),                 /* MESSAGE TEXT WAS            31634000
*                                           TRUNCATED            @L9A*/ 31634400
*     4 WMJMXNVT BIT(1),                 /* INVALID USER EXIT TEXT      31634800
*                                           MODIFICATION         @L9A*/ 31635200
*     4 WMJMXMER BIT(1),                 /* MUTUALLY EXCLUSIVE USER     31635600
*                                           EXIT REQUESTS MADE   @L9A*/ 31636000
*     4 WMJMXIRM BIT(1),                 /* INCOMPATIBLE USER EXIT      31636400
*                                           REQUESTS MADE        @L9A*/ 31636800
*     4 WMJMDMDB BIT(1),                 /* DOM MDBS HAVE BEEN BUILT    31637200
*                                                                @06C*/ 31637600
*     4 WMJMRV78 BIT(3),                 /* RESERVED FOR COMPATIBILITY  31638000
*                                                                @PAC*/ 31638400
*    3 WMJMXIF2 BIT(8),                  /* MISC AND MINOR ERROR        31638800
*                                           FLAG BYTE 2          @LFC*/ 31639200
*     4 WMJQONLY BIT(1),                 /* REISSUED WQE VIA WQEBLK     31639600
*                                           FROM SAME SYSTEM     @P4A*/ 31640000
*     4 WMJAMRFO BIT(1),                 /* WQE IS FOR AMRF PURPOSES    31640400
*                                           ONLY                 @D5A*/ 31640800
*     4 WMJAMRFA BIT(1),                 /* AMRF IS ACTIVE ON ISSUING   31641200
*                                           SYSTEM               @D5A*/ 31641600
*     4 WMJMQD   BIT(1),                 /* WQE WENT THROUGH QUEUEING   31642000
*                                           ALREADY              @D5A*/ 31642400
*     4 WMJMWTPR BIT(1),                 /* WTP REQUEST - ROUTE CODE    31642800
*                                           11 WAS ON AFTER CALLING     31643200
*                                           WTO USER EXIT        @PAM*/ 31643600
*     4 WMJMMFR  BIT(1),                 /* WQE WAS MODIFIED FOR REISSUE31644000
*                                           BY QUEUING           @PCA*/ 31644400
*     4 WMJAMRFR BIT(1),                 /* WQE FOR AMRF REFRESH @PFA*/ 31644800
*     4 WMJQTSYS BIT(1),                 /* QUEUE MESSAGE JUST ON THIS  31645200
*                                           SYSTEM               @01A*/ 31645600
*   2 WMJMXTUC FIXED(31),                /* EXTENDED MCS QUEUER         31646000
*                                           USE COUNT            @LAA*/ 31646400
*   2 WMJMRCPT PTR(31),                  /* POINTER TO SAVED SYSIDS     31646800
*                                           USE FOR CONNECTING MESSAGES 31647200
*                                           IN A SYSPLEX         @LBA*/ 31647600
*   2 WMJBENIP CHAR(1),                  /* BRANCH ENTRY/NIP FLAGS      31648000
*                                                                @LIM*/ 31648400
*    3 WMJMDOMD BIT(1),                  /* MESSAGE HAS PREVIOUSLY      31648800
*                                           BEEN DOM'D           @LIM*/ 31649200
*    3 WMJMNBEW BIT(1),                  /* WQE CREATED BY NIP OR       31649600
*                                           BRANCH ENTRY WTO     @LIM*/ 31650000
*    3 WMJMHABD BIT(1),                  /* HAS ALREADY BEEN DISPLAYED  31650400
*                                                                @LIM*/ 31650800
*    3 WMJMASCB BIT(1),                  /* ASCB SPECIFIED       @PKA*/ 31651200
*   2 WMJQDSYS FIXED(8),                 /* WQE DESTINATIONS COUNTER    31651600
*                                                                @P4A*/ 31652000
*   2 WMJCASEL CHAR(1),                  /* MESSAGE COLOR        @LEA*/ 31652400
*   2 WMJHASEL CHAR(1),                  /* MESSAGE HIGHLIGHTING @LEA*/ 31652800
*   2 WMJIASEL CHAR(1),                  /* MESSAGE INTENSITY    @LEA*/ 31653200
*/***************************************************************@LHA*/ 31653600
*/*   MISCELLANEOUS ROUTING INFORMATION                          @LHA*/ 31654000
*/***************************************************************@LHA*/ 31654400
*   2 WMJMMISC BIT(8),                   /* MISCELLANEOUS ROUTING       31654800
*                                           INFORMATION          @LHA*/ 31655200
*    3 WMJMUD   BIT(1),                  /* DISPLAY UD MESSAGES  @LHA*/ 31655600
*    3 WMJMFUDO BIT(1),                  /* DISPLAY ONLY UD MESSAGES    31656000
*                                                                @LHA*/ 31656400
*    3 WMJMFIDO BIT(1),                  /* QUEUE BY ID ONLY     @PBA*/ 31656800
*    3 WMJMAUTO BIT(1),                  /* QUEUE BY AUTOMATION  @LJA*/ 31657200
*    3 WMJMHC   BIT(1),                  /* QUEUE BY HARDCOPY    @LMA*/ 31657600
*    3 *        BIT(3),                  /* RESERVED             @LMC*/ 31658000
*   2 WMJMTSNT FIXED(15),                /* TOTAL COUNT OF TDPS SENT OUT31658400
*                                           FOR THIS MESSAGE     @PCC*/ 31658800
*   2 WQERSVDB FIXED(31),                /* RESERVED - MAPS TO          31659200
*                                           WQERPYIB             @D4A*/ 31659600
*   2 WMJMTS3  BIT(32),                  /* STCK FORM TIME STAMP        31659700
*                                           Note - if task has been     31659800
*                                           in a wait for resources,    31659900
*                                           this is the time after      31660000
*                                           returning from wait  @PMC*/ 31660100
*   2 WMJMFTOD BIT(32),                  /* AMRF FAILURE         @PFC*/ 31660400
*   2 WMJMQLST CHAR(8) BDY(WORD),        /* K Q CONSOLE ID LIST  @PBA*/ 31660800
*    3 WMJMKQL1  FIXED(31),              /* K Q CONSOLE ID 1     @PBA*/ 31661200
*    3 WMJMKQL2  FIXED(31),              /* K Q CONSOLE ID 2     @PBA*/ 31661600
*   2 WMJMRIDL FIXED(8),                 /* LENGTH OF REPLY ID IN       31662000
*                                           MESSAGE TEXT         @LOA*/ 31662400
*   2 WMJMISCC BIT(8),                   /* MISCELLANEOUS CONTROL       31662800
*                                           PROGRAM FLAGS        @03A*/ 31663200
*    3 WMJMSPVD BIT(1),                  /* Backlog message      @03A*/ 31663600
*    3 WMJMPRIV BIT(1),                  /* Original issuer was         31664000
*                                           privileged           @03A*/ 31664400
*    3 WMJMQNLY BIT(1),                  /* Send to the console         31664800
*                                           and nowhere else     @05A*/ 31665200
*    3 *        BIT(5),                  /* RESERVED             @05C*/ 31665600
*   2 WMJMCENT CHAR(2),                  /* Century portion of date,    31666000
*                                           in EBCDIC            @04A*/ 31666400
*   2 WMJMLTOD FIXED(32);                /* Time last minor added to    31666800
*                                           MLWTO                @02A*/ 31667200
*%WMJMSIZE = 'LENGTH(WMJM)';             /* GET SIZE OF MAJOR WQE       31702002
*                                                              ICB433*/ 31704002
* @EJECT;                                                               31714000
*/********************************************************************/ 31800002
*/*                                                                  */ 31850002
*/*                      MINOR WQE                                   */ 31900002
*/*                                                                  */ 31950002
*/********************************************************************/ 32000002
*                                                                       32050002
*DECLARE                                                                32100002
*  1 WMNM  BASED(WMNPTR) WMNMVIA BDY(WORD),                             32110000
*                                        /* START OF MINOR WQE   @LFC*/ 32120000
*   2 WMNMNX1     PTR(31),               /* POINTER TO SECOND HALF OF   32130000
*                                           WQE                  @L6C*/ 32140000
*   2 WMNMML1     BIT(8) BDY(WORD),      /* MLWTO FLAGS FOR FIRST       32450002
*                                           MESSAGE                  */ 32500002
*    3 WQERSV62 BIT(1),                  /* RESERVED                 */ 32550002
*    3 WMNMML1B BIT(1),                  /* MAJOR WQE                */ 32600002
*    3 WMNMML1C BIT(1),                  /* MINOR WQE                */ 32650002
*    3 WMNMML1D BIT(1),                  /* CHAIN ALTERED            */ 32700002
*    3 WMNMML1E BIT(1),                  /* WTL ISSUED               */ 32750002
*    3 WMNMML1F BIT(1),                  /* MINOR WQE FOR ABEND         32800002
*                                                              ICB433*/ 32802002
*    3 WMNMML1G BIT(1),                  /* SERVICE THIS CHAIN       */ 32850002
*    3 WMNMML1H BIT(1),                  /* MINOR WQE ACQUIRED VIA      32900002
*                                           GETMAIN            ICB461*/ 32950002
*   2 WMNMLT1     BIT(8),                /* LINE TYPE FLAGS FOR FIRST   33000002
*                                           MESSAGE                  */ 33050002
*    3 WMNMLT1A BIT(1),                  /* CONTROL LINE             */ 33100002
*    3 WMNMLT1B BIT(1),                  /* LABEL LINE               */ 33150002
*    3 WMNMLT1C BIT(1),                  /* DATA LINE                */ 33200002
*    3 WMNMLT1D BIT(1),                  /* END INDICATOR            */ 33250002
*    3 WQERSV63 BIT(1),                  /* RESERVED                 */ 33300002
*    3 WQERSV64 BIT(1),                  /* RESERVED                 */ 33310002
*    3 WQERSV65 BIT(1),                  /* RESERVED                 */ 33320002
*    3 WQERSV66 BIT(1),                  /* RESERVED                 */ 33330002
*   2 WMNMLTH1    FIXED(8),              /* LENGTH OF 1 MINOR WQE       33340000
*                                                                @P2C*/ 33350000
*   2 WMNMTL1     PTR(8),                /* LENGTH OF FIRST MESSAGE     33400002
*                                           TEXT                     */ 33450002
*   2 WMNMHCT1    CHAR(4) BDY(WORD),     /* HARDCOPY ID FOR FIRST       33500002
*                                           MESSAGE                  */ 33550002
*   2 WMNMTXT1    CHAR(72) BDY(WORD),    /* FIRST MESSAGE TEXT          33600002
*                                           (MAXIMUM 72 BYTES)       */ 33650002
*   2 WMNMST1     BIT(8) BDY(WORD),      /* STATUS FLAGS       Y02710*/ 33653500
*    3 WMNMTPD1 BIT(1),                  /* TPUT DONE          Y02710*/ 33657000
*    3 WMNMTRC1 BIT(1),                  /* FIRST MINOR WQE HAS BEEN    33660500
*                                           MASTER TRACED    @G64MP2D*/ 33664000
*    3 WMNMWTP1 BIT(1),                  /* MINOR 1 TEXT HAS            33667500
*                                           BEEN PUT/TPUT BY            33671000
*                                           IEEJB840 - DON'T            33674500
*                                           DO IT AGAIN          @P5C*/ 33678000
*    3 WQERSVB1 BIT(1),                  /* RESERVED           Y02710*/ 33681500
*    3 WQERSVB2 BIT(1),                  /* RESERVED           Y02710*/ 33685000
*    3 WQERSVB3 BIT(1),                  /* RESERVED           Y02710*/ 33688500
*    3 WQERSVB4 BIT(1),                  /* RESERVED           Y02710*/ 33692000
*    3 WQERSVB5 BIT(1),                  /* RESERVED           Y02710*/ 33695500
*                                                                       33700002
*   2 WMNMMSF1    BIT(8),                /* MISCELLANEOUS FLAG          33706200
*                                           BYTE                 @L9C*/ 33712400
*    3 WMNMRV99    BIT(1),               /* RESERVED             @D6C*/ 33718600
*    3 WMNMRV9A    BIT(1),               /* RESERVED             @D6C*/ 33724800
*    3 WMNMTRAN    BIT(1),               /* WQE HAS BEEN TRANSPORTED TO 33731000
*                                           ANOTHER SYSTEM       @LBA*/ 33737200
*   2 WMNMUC1     PTR(15),               /* USE COUNT 1          @L6C*/ 33743400
*                                                                       33750002
*   2 WMNMSEQ1 FIXED(31),                /* SEQUENCE NUMBER (CONNECT    33755200
*                                           ID)                  @L5C*/ 33760400
*   2 WMN1XMOD CHAR(4),                  /* COPY OF REQUEST FLAGS       33765600
*                                           (CTXTRFLG) FROM THE WTO     33770800
*                                           USER EXIT INTERFACE         33776000
*                                           ROUTINE              @L3A*/ 33781200
*    3 WMN1FLGS,                         /* COMM TASK USER EXIT         33786400
*                                           REQUESTS             @L3A*/ 33791600
*     4 WMN1RFB1 BIT(8),                 /* REQUEST FLAGS BYTE          33796800
*                                           ONE                  @L3A*/ 33802000
*      5 WMN1RCMT BIT(1),                /* CHANGE THE MESSAGE          33807200
*                                           TEXT                 @L3A*/ 33812400
*      5 *        BIT(6),                /* RESERVED - EQUIVALENCE      33817600
*                                           IN MAJOR WQE         @L3A*/ 33822800
*      5 WMN1RPML BIT(1),                /* PROCESS MINOR LINES  @L3A*/ 33828000
*     4 WMN1RFB2 BIT(8),                 /* REQUEST FLAGS BYTE          33833200
*                                           TWO                  @L3A*/ 33838400
*     4 WMN1RFB3 BIT(8),                 /* RESERVED             @L3A*/ 33843600
*    3 WMN1SUPB BIT(8),                  /* SUPPRESSION BYTE     @L3A*/ 33848800
*     4 WMN1SNSV BIT(1),                 /* NOT SERVICED BY ANY WTO     33854000
*                                           USER EXIT ROUTINE    @L3A*/ 33859200
*     4 WMN1SEER BIT(1),                 /* ESTAE ERROR IN IEAVX600     33864400
*                                                                @L3A*/ 33869600
*     4 WMN1SNSI BIT(1),                 /* NOT SERVICED BECAUSE OF     33874800
*                                           AN INCOMPATIBLE REQUEST     33880000
*                                                                @L3A*/ 33885200
*     4 WMN1SAUT BIT(1),                 /* INDICATE AUTOMATION         33890400
*                                           REQUESTED        @YA06920*/ 33895600
*     4 WMN1SQED BIT(1),                 /* NOT QUEUED TO ANY CONSOLE   33900800
*                                                                @L3A*/ 33906000
*     4 WMN1SSSI BIT(1),                 /* SUPPRESSED BY A SUBSYSTEM   33911200
*                                                                @L3A*/ 33916400
*     4 WMN1SWTO BIT(1),                 /* SUPPRESSED BY A WTO USER    33921600
*                                           EXIT ROUTINE         @L3A*/ 33926800
*     4 WMN1SMPF BIT(1),                 /* SUPPRESSED BY MPF    @L3A*/ 33932000
*   2 WMNMNX2     PTR(31),               /* ADDRESS OF NEXT MINOR       33937200
*                                           WQE OR ZERO          @L6C*/ 33942400
*   2 WMNMML2     BIT(8) BDY(WORD),      /* MLWTO FLAGS FOR SECOND      33950002
*                                           MESSAGE                  */ 34000002
*    3 WQERSV68 BIT(1),                  /* RESERVED                 */ 34050002
*    3 WMNMML2B BIT(1),                  /* MAJOR WQE                */ 34100002
*    3 WMNMML2C BIT(1),                  /* MINOR WQE                */ 34150002
*    3 WMNMML2D BIT(1),                  /* CHAIN ALTERED            */ 34200002
*    3 WMNMML2E BIT(1),                  /* WTL ISSUED               */ 34250002
*    3 WQERSV69 BIT(1),                  /* RESERVED                 */ 34300002
*    3 WMNMML2G BIT(1),                  /* SERVICE THIS CHAIN       */ 34350002
*    3 WMNMML2H BIT(1),                  /* LINE 2 AVAILABLE         */ 34400002
*   2 WMNMLT2     BIT(8),                /* LINE TYPE FLAGS FOR         34500002
*                                           SECOND MESSAGE           */ 34550002
*    3 WMNMLT2A BIT(1),                  /* CONTROL LINE             */ 34600002
*    3 WMNMLT2B BIT(1),                  /* LABEL LINE               */ 34650002
*    3 WMNMLT2C BIT(1),                  /* DATA LINE                */ 34700002
*    3 WMNMLT2D BIT(1),                  /* END INDICATOR            */ 34750002
*    3 WQERSV70 BIT(1),                  /* RESERVED                 */ 34800002
*    3 WQERSV71 BIT(1),                  /* RESERVED                 */ 34810002
*    3 WQERSV72 BIT(1),                  /* RESERVED                 */ 34820002
*    3 WQERSV73 BIT(1),                  /* RESERVED                 */ 34830002
*   2 WMNMLTH2  FIXED(8),                /* LENGTH OF 1 MINOR WQE       34840000
*                                                                @P2C*/ 34850000
*   2 WMNMTL2   PTR(8),                  /* LENGTH OF SECOND MESSAGE    34900002
*                                           TEXT                     */ 34950002
*   2 WMNMHCT2    CHAR(4) BDY(WORD),     /* HARDCOPY ID FOR SECOND      35000002
*                                           MESSAGE                  */ 35050002
*   2 WMNMTXT2    CHAR(72) BDY(WORD),    /* SECOND MESSAGE TEXT         35060000
*                                           (MAXIMUM 72 BYTES)       */ 35150002
*                                                                       35152002
*   2 WMNMST2     BIT(8) BDY(WORD),      /* STATUS FLAGS 2     Y02710*/ 35162000
*    3 WMNMTPD2 BIT(1),                  /* TPUT DONE MSG 2    Y02710*/ 35172000
*    3 WMNMTRC2 BIT(1),                  /* SECOND MINOR WQE HAS BEEN   35182000
*                                           MASTER TRACED    @G64MP2D*/ 35192000
*    3 WMNMWTP2 BIT(1),                  /* MINOR 2 TEXT HAS            35202000
*                                           BEEN PUT/TPUT BY            35212000
*                                           IEEJB840 - DON'T            35222000
*                                           DO IT AGAIN          @P5C*/ 35232000
*    3 WQERSVC1 BIT(1),                  /* RESERVED           Y02710*/ 35242000
*    3 WQERSVC2 BIT(1),                  /* RESERVED           Y02710*/ 35252000
*    3 WQERSVC3 BIT(1),                  /* RESERVED           Y02710*/ 35262000
*    3 WQERSVC4 BIT(1),                  /* RESERVED           Y02710*/ 35272000
*    3 WQERSVC5 BIT(1),                  /* RESERVED           Y02710*/ 35282000
*                                                                       35292000
*   2 WMN2MSF2    BIT(8),                /* RESERVED             @D6C*/ 35302000
*   2 WMNMUC2     PTR(15),               /* USE COUNT 2          @L6C*/ 35312000
*                                                                       35322000
*   2 WMNMSEQ2 FIXED(31),                /* SEQUENCE NUMBER (CONNECT    35332000
*                                           ID)                  @L5C*/ 35342000
*   2 WMN2XMOD CHAR(4),                  /* COPY OF REQUEST FLAGS       35352000
*                                           (CTXTRFLG) FROM THE WTO     35362000
*                                           USER EXIT INTERFACE         35372000
*                                           ROUTINE              @L3A*/ 35382000
*    3 WMN2FLGS,                         /* COMM TASK USER EXIT         35392000
*                                           REQUESTS             @L3A*/ 35402000
*     4 WMN2RFB1 BIT(8),                 /* REQUEST FLAGS BYTE          35412000
*                                           ONE                  @L3A*/ 35422000
*      5 WMN2RCMT BIT(1),                /* CHANGE THE MESSAGE          35432000
*                                           TEXT                 @L3A*/ 35442000
*      5 *        BIT(6),                /* RESERVED - EQUIVALENCE      35452000
*                                           IN MAJOR WQE         @L3A*/ 35462000
*      5 WMN2RPML BIT(1),                /* PROCESS MINOR LINES  @L3A*/ 35472000
*     4 WMN2RFB2 BIT(8),                 /* REQUEST FLAGS BYTE          35482000
*                                           TWO                  @L3A*/ 35492000
*     4 WMN2RFB3 BIT(8),                 /* RESERVED             @L3A*/ 35502000
*    3 WMN2SUPB BIT(8),                  /* SUPPRESSION BYTE     @L3A*/ 35512000
*     4 WMN2SNSV BIT(1),                 /* NOT SERVICED BY ANY WTO     35522000
*                                           USER EXIT ROUTINE    @L3A*/ 35532000
*     4 WMN2SEER BIT(1),                 /* ESTAE ERROR IN IEAVX600     35542000
*                                                                @L3A*/ 35552000
*     4 WMN2SNSI BIT(1),                 /* NOT SERVICED BECAUSE OF     35562000
*                                           AN INCOMPATIBLE REQUEST     35572000
*                                                                @L3A*/ 35582000
*     4 WMN2SAUT BIT(1),                 /* INDICATES AUTOMATION        35592000
*                                           REQUESTED        @YA06920*/ 35602000
*     4 WMN2SQED BIT(1),                 /* NOT QUEUED TO ANY CONSOLE   35612000
*                                                                @L3A*/ 35622000
*     4 WMN2SSSI BIT(1),                 /* SUPPRESSED BY A SUBSYSTEM   35632000
*                                                                @L3A*/ 35642000
*     4 WMN2SWTO BIT(1),                 /* SUPPRESSED BY A WTO USER    35652000
*                                           EXIT ROUTINE         @L3A*/ 35662000
*     4 WMN2SMPF BIT(1),                 /* SUPPRESSED BY MPF    @L3A*/ 35672000
*   2 WMNM1R99 (4) PTR(31),              /* RESERVED             @L1A*/ 35682000
*   2 WMNM2R99 (4) PTR(31),              /* RESERVED             @L5C*/ 35692000
*   2 WMNMRSVD CHAR(128);                /* RESERVED         @YA10055*/ 35702000
*%WMNMSIZE = 'LENGTH(WMNM)';             /* GET LENGTH OF MINOR WQE     35712000
*                                                              ICB433*/ 35722000
*/********************************************************************/ 35732000
*/*                                                              @LAA*/ 35742000
*/*    ARRAY OF 256 BIT SYSIDS. EACH BIT REPRESNTS A SYSTEM IN A @LAA*/ 35752000
*/*    SYSPLEX. THIS ARRAY IS USED WITH CONNECTING WTO MESSAGES  @LAA*/ 35762000
*/*    SO THAT THOSE LINES THAT ARE ADDED BY CONNECT WILL BE     @LAA*/ 35772000
*/*    SENT TO THE SAME SYSTEMS THAT THE MAJOR LINE AND OTHER    @LAA*/ 35782000
*/*    MINOR LINES WERE SENT TO.                                 @LAA*/ 35792000
*/*                                                              @LAA*/ 35802000
*/********************************************************************/ 35812000
*                                                                       35822000
*DECLARE                                                                35832000
*    WQESYARR(32) BIT(8) BASED (WQESRCPT) WQESYVIA;                     35842000
*                                          /* ARRAY OF 256 BIT SYSIDS   35852000
*                                                                @LFC*/ 35862000
*WQELPOP;                                  /* @LISTPOP           @LFA*/ 35872000
