*                                                                       00050000
*        %GOTO WSAVTL1;   /*                                            00100000
         MACRO                                                          00150000
         IHAWSAVT &CLASS=LOCAL,&DSECT=YES,&FUNC=,&LIST=NO,&ACR=    @P3C 00187500
**/                                                                     00225000
*%WSAVTL1: ;                                                            00262500
*                                                                       00300000
*/* START OF SPECIFICATIONS ******************************************/ 00350000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00400000
*/*01* PROPRIETARY STATEMENT =                                       */ 00615500
*/*                                                                  */ 00623200
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */ 00629800
*/*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     */ 00636400
*/*  5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                     */ 00643000
*/*                                                                  */ 00649600
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00655800
*/*                                                                  */ 00662000
*/*01* STATUS:  HBB7703                                              */ 00674400
*/*                                                                  */ 00686800
*/*01* DESCRIPTIVE NAME:  Work/Save Area Vector Tables               */ 00736800
*/*02*  ACRONYM:  WSAVT                                              */ 00786800
*/*                                                                  */ 00802600
*/*01* EXTERNAL CLASSIFICATION: DMTI                                 */ 00818400
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00834200
*/*                                                                  */ 00850000
*/*01* MACRO-NAME:  IHAWSAVT                                         */ 00900000
*/*                                                                  */ 01150000
*/*01* DSECT NAME:                                                   */ 01158500
*/*02*  WSAC - CPU WSAVT                                             */ 01184000
*/*                                                                  */ 01192600
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 01200000
*/*                                                                  */ 01250000
*/*01* EYE-CATCHER:  None                                            */ 01300000
*/*                                                                  */ 01450000
*/*01* STORAGE ATTRIBUTES:                                           */ 01456000
*/*02*  KEY:  0                                                      */ 01462000
*/*02*  RESIDENCY:  Below 16M line                                   */ 01468000
*/*                                                                  */ 01474000
*/*01* WSAC STORAGE ATTRIBUTES:                                      */ 01480000
*/*02*  Table: Subpool 239 and key 0 (Residence - below 16M line)    */ 01486000
*/*02*  Table entries point to storage in subpool 239 and key 0      */ 01492000
*/*02*  RESIDENCY:  Component specified                              */ 01498000
*/*                                                                  */ 01504000
*/*01* WSAG STORAGE ATTRIBUTES:                                      */ 01510000
*/*02*  Table: Nucleus resident and key 0 (Residence-below 16M line) */ 01516000
*/*02*  Table entries point to storage in subpool 239 and key 0      */ 01522000
*/*02*  RESIDENCY:  Component specified                              */ 01528000
*/*                                                                  */ 01534000
*/*01* WSAL STORAGE ATTRIBUTES:                                      */ 01540000
*/*02*  Table: Subpool 255 and key 0 (Residence - below 16M line)    */ 01546000
*/*02*  Table entries point to storage in subpool 255 and key 0      */ 01552000
*/*02*  RESIDENCY:  Component specified                              */ 01558000
*/*                                                                  */ 01564000
*/*01* SIZE:                                                         */ 01570000
*/*02*  WSAC - 184 bytes                                             */ 01576000
*/*                                                                  */ 01594000
*/*01* CREATED BY:                                                   */ 01604000
*/*02*  WSAC - IEAVNIP0, IEEVCPRA, IEAVWSAT (template only)          */ 01614000
*/*                                                                  */ 01624000
*/*01* POINTED TO BY:                                                */ 01630000
*/*02*  WSAC - LCCACPUS field of the LCCA data area                  */ 01636000
*/*                                                                  */ 01654000
*/*01* SERIALIZATION:                                                */ 01660000
*/*02*  WSAC - Disablement (in order to use save areas)              */ 01666000
*/*                                                                  */ 01684000
*/*01* FUNCTION:                                                     */ 01690000
*/*02*  Provide mapping of CPU work/save area                        */ 01696000
*/*     vector table and the template for this table.                */ 01702000
*/*                                                                  */ 01708000
*/*01* METHOD OF ACCESS:                                             */ 01714000
*/*02*  ASM:                                                         */ 01720000
*/*      There are 3 keyword parameters as follows:                  */ 01726000
*/*                                                                  */ 01732000
*/*             1. CLASS=LOCAL/GLOBAL/CPU with a default of LOCAL.   */ 01738000
*/*                This parameter determines which WSAVT mapping is  */ 01744000
*/*                produced.                                         */ 01750000
*/*                                                                  */ 01756000
*/*             2. FUNC=INIT.  If this parameter is specified, an    */ 01762000
*/*                initialized table of full-word length values      */ 01768000
*/*                describing the number of entries, the length of   */ 01774000
*/*                each entry and the location of the acquired       */ 01780000
*/*                storage (extended or non extended) specified by   */ 01786000
*/*                the class parameter is produced.                  */ 01792000
*/*                                                                  */ 01800000
*/*             THIS MACRO PRODUCES THE FOLLOWING DSECTS:            */ 01850000
*/*                                                                  */ 02100000
*/*             1. WSAL - LOCAL WSAVT                                */ 02116600
*/*             2. WSAG - GLOBAL WSAVT                               */ 02133200
*/*             3. WSAC - CPU WSAVT                                  */ 02149800
*/*      Specify LIST=YES on Macro call for listing.                 */ 02151700
*/*                   For FUNC=INIT a listing will always be printed.*/ 02153600
*/*                                                                  */ 02155500
*/*02*  PL/AS:                                                       */ 02157400
*/*      Include IHAASXB to define ASXBSPSA for LOCAL WSAVT.         */ 02159300
*/*      Include CVT to define CVTSPSA for GLOBAL WSAVT.             */ 02161200
*/*      Include IHALCCA To define LCCACPUS for CPU WSAVT.           */ 02163100
*/*                                                                  */ 02165000
*/*      All 3 WSAVT'S are mapped unless macro variable(s) are set   */ 02166900
*/*      to NO.                                                      */ 02168800
*/*      Coding %WSALOCAL='NO' before INCLUDE means that a mapping   */ 02170700
*/*      of LOCAL WSAVT will not be produced.                        */ 02172600
*/*      %WSAGLOBL='NO' suppresses GLOBAL WSAVT mapping.             */ 02174500
*/*      %WSACPU='NO' suppresses CPU WSAVT mapping.                  */ 02176400
*/*                                                                  */ 02178300
*/*      Coding %WSAMAP='YES' before %INCLUDE means that a           */ 02180200
*/*      generalized mapping of the save area template is to be      */ 02182100
*/*      produced. This mapping is supported only in PL/S.           */ 02184000
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 02185900
*/*      For %WSAMAP a listing will always be printed.               */ 02187800
*/*                                                                  */ 02189700
*/*01* DEPENDENCIES/RESTRICTIONS:                                    */ 02191600
*/*      All save areas must be allocated on doubleword boundaries   */ 02193500
*/*      by the modules that create them. Each save area must also   */ 02195400
*/*      be a multiple of a DOUBLEWORD in length.                    */ 02197300
*/*                                                                  */ 02200000
*/*01* LOCATION =                                                    */ 02222200
*/*       The GLOBAL Work/Save Area Vector Table, the template for   */ 02244400
*/*       this table, and the templates for the CPU and LOCAL tables */ 02266600
*/*       are created by module IEAVWSAT and located in the Nucleus. */ 02288800
*/*       The CPU Work/Save Area Vector Table is created at NIP and  */ 02311000
*/*       at the RECONFIG online of a CPU.                           */ 02333200
*/*       The LOCAL Work Save/Area Vector Table is created at address*/ 02355400
*/*       space creation.                                            */ 02377600
*/*                                                                  */ 02400000
*/*01* DISTRIBUTION LIBRARY:  AMODGEN                                */ 02404100
*/*                                                                  */ 02408300
*/* END OF SPECIFICATIONS ********************************************/ 02454100
*%GOTO WSAVTL2;  /*                                                     02500000
.*                                                                      02500600
.*********************************************************************  02501200
.*   CHANGE-ACTIVITY                                                    02501800
.*                                                                      02502400
.*  $L1=ADDFUNCT JBB1326  091880  D16XD:   ADDED NEW SAVE AREAS FOR     02503000
.*                                         RAS ENHANCEMENTS             02503600
.*  $L2=ADDFUNCT JBB1326  091880  D16XD:   EXPANDED ASM SAVE AREAS      02504200
.*  $D1=DCR34    JBB1326  091880  D16XD:   ADDED MALFUNCTION ALERT      02504800
.*                                         SAVE AREAS                   02505400
.*  $D2=DCR118   JBB1326  011381  D16XD:   INCREASED 'WSACASMD'         02506000
.*                                         SAVEAREA SIZE                02506600
.*  $P1=PMM0155  JBB1326  012281  D16XD:   INCREASED WSACRESF SAVEAREA  02507200
.*                                         LENGTH                       02507800
.*  G860PXD - 31 BIT ADDRESSING SUPPORT                                 02508400
.*  $L3=RAPRAS   JBB2110  820602  PD16FJ:  DAE AND SDWA STATUS.         02509000
.*                                         INCREASE 'WSACACR' SIZE      02509600
.*                                         (+40 DEC).                   02510200
.*  $L4=RAPRAS   JBB2110  820805  PD16FJ:  DYNAMIC REFRESH. ADD         02510800
.*                                         FIELDS CSCPS,CTRTM,CTRT1,    02511400
.*                                         CRTMP. DELETE CRRSA.         02512000
.*                                         CHANGE SCWA SIZE FROM        02512600
.*                                         2448 TO 2520.                02513200
.*  $L5=RAPRAS   JBB2125  821210  PD16XD:  ADD A NEW ASM CPU RELATED    02513800
.*                                         SAVE AREA FOR RECOVERY       02514400
.*                                         (+512 DEC)                   02515000
.*  $H1=ADVPROC2 JBB2133  821013  PD16ZD:  AXP -                        02515600
.*                                         INCREASE 'WSACACR' SIZE      02516200
.*                                         (+64 DEC).                   02516800
.*                                         INCREASE 'WSACRSM' SIZE      02517400
.*                                         (+10K DEC).                  02518000
.*  $P2=PAE0217  JBB2133  840130  PD16XK:  'WSACRSM' SIZE = 32760       02518600
.*  $H2=VF       JBB2214  840529  PD16XK:  VECTOR FEATURE               02519200
.*                                         'WSALSTWA' SIZE = 56         02519800
.*  $D3=DCR0015  JBB2214  841018  PD16H4:  COMMENT CHANGE FOR WSACACR   02520400
.*  $L7=IOGEN    JBB2220  840806  PD16Q4:  IOGEN RESTRUCTURE            02521000
.*  $L8=SRMSTKS  JBB2220  840806  PD16Q4:  SRM STACKS                   02521600
.*  $D4=DCR0022  JBB2220  841119  PD16XK:  DEFINE WSACDIVS              02522200
.*  $D5=DCR0026  JBB2220  850107  PD16R8:  IEEVEXSN INTERFACE CHANGE    02522800
.*  $P3=PA20191  JBB2220  850404  PD16Q4:  ISSUE MNOTE FOR UNSUPPORTED  02523400
.*                                         ACR KEYWORD                  02524000
.*  $L9=RASENH   JBB2220  840618  PD16XK:  RAS ENHANCEMENTS FOR RTM     02524600
.*  $L6=TRQ      JBB2217  850326  PD16FN:  TRUE READY QUEUE.  CHANGE    02525200
.*                                         SCWA FROM 2520 TO TO 2776    02525800
.*  $LA=AR       HBB3310  850903  PD16Q9:  ACCESS REGISTERS             02526400
.*  $D6=DCR0020  HBB3310  860416  PD16Q9:  EXTEND SCWA FOR LINKAGE      02527000
.*                                         STACK ROUTINES - NOW 8192    02527600
.*  $LB=DREF     HBB3310  860416  PD16Q9:  DISABLED REFERENCE           02528200
.*  $D7=DCR0077  HBB3310  860707  PD16Q9:  GET STORAGE FOR TRACE PARM   02528800
.*                                         LIST BELOW THE LINE.         02529400
.*  $D8=DCR0081  HBB3310  860707  PD16Q9:  EXPAND SYMREC AREA.          02530000
.*  $D9=DCR0123  HBB3310  860821  PD16Q9:  EXPAND WAIT AND POST WORK    02530600
.*                                         AREAS.                       02531200
.*  $01=OZ92108  JBB2214  850115  PD16Q4:  INCREASE WSAGDCCR LENGTH     02531800
.*  $P4=PA21036  JBB2220  860819  PD16Q9:  GLOBAL REGISTER SAVE AREA    02532400
.*                                         FOR SRM.                     02533000
.*  $DA=DCR0060  HBB3310  861029  PD16Q9:  INCREASE RESTART FLIH WORK   02533600
.*                                         AREA.                        02534200
.*  $DB=DCR0157  HBB3310  861029  PD16Q9:  INCREASE RTM SDWA AREAS      02534800
.*  $DC=DCR0159  HBB3310  861029  PD16Q9:  INCREASE SVC DUMP WORK AREA  02535400
.*  $DD=DCR0181  HBB3310  870225  PD16Q9:  INCREASE PAWA                02535600
.*  $DE=DCR0199  HBB3310  870225  PD16Q9:  CACHE ALIGN SCFS WORK AREA   02535800
.*  $DF=DCR0228  HBB3310  870225  PD16Q9:  INCREASE ACR WORK AREA       02535900
.*  $P5=PC40762  HBB3310  870415  PD16Q9:  INCREASE ACR WORK AREA       02536100
.*  $LC=LOCKR    HBB4410  870831  PD16Q9:  LOCK RESTRUCTURE             02536200
.*  $LD=CLOCK    HBB4410  870831  PD16Q9:  TIMER SUPPORT                02536300
.*  $DG=DCR0277  HBB3310  870831  PD162M:  INCREASE PAWA                02536400
.*  $P6=PC41357  HBB3310  870831  PD16Q9:  INCREASE CPU RSM WORK AREA - 02536500
.*                                         LENGTH IN PAGES.             02536600
.*  $P7=PC41379  HBB3310  871020  PD16Q9:  ADD TO CPU MFA & RESF AREAS  02536700
.*  $P8=PC41472  HBB3310  871020  PD16Q9:  INCREASE ASMR CPU AREA       02536800
.*  $P9=PC42307  HBB3310  880301  PD16Q4:  INCREASE WSACRESF AREA       02536900
.*  $LE=HIPER    JBB3311  880420  PD16LD:  INCREASE 'WSACRSM' SIZE      02537000
.*                                         BY 4 PAGES                   02537100
.*  OY07612 - INCREASE WSACACR SIZE BY DECIMAL 96 BYTES TO    @YA07612  02537200
.*            PROVIDE MORE SPACE FOR THE 'ACR COMPLETE'       @YA07612  02537300
.*            MESSAGE GENERATION.  SEE ACR APAR OY04076.      @YA07612  02537400
.*  $DH=DCR0021  HBB4410  880404  PD16BN:  ADD WSACACR2                 02537500
.*  $LF=COUPL    HBB4410  880711  PD16Q4:  XCF SUPPORT                  02537600
.*  $LG=GTFHM    HBB4410  880923  PD16LD:  INCREASE WSACGTF, MOVE >16MB 02537700
.*  $DI=DHB1025  HBB4410  890206  PD16EI:  RESTORE SIZE OF WSACGTF      02537800
.*  $LH=CNITG    HBB4410  890508  PD16BN:  CONSOLE INTEGRATION SUPPORT  02537900
.*  $DJ=DEO0171  HBB4410  890508  PD16BN:  CONSOLE INTEGRATION SUPPORT  02538000
.*  $LI=SDOM     JBB3313  890512  PD16BN:  ADD WSALJSIO,WSALJIOC,       02538100
.*                                         WSALJSTL                     02538200
.*  $02=OY18687  JBB3313  880203  PD16Q9:  INCREASE WSAGESXN AREA       02538300
.*  $03=OY27050  JBB3313  890403  PD16Q4:  ENCRYPTION ASYMMETRIC        02538400
.*                                         FEATURE SUPPORT              02538500
.*                                         (INCREASE WSACACR2 SIZE)     02538600
.*  $DK=DEO1027  HBB4410  890814  PD16M6:  INCREASE WSACSTKA AND        02538700
.*                                         WSACSTKB                     02538800
.*  $LJ=CNITG    HBB4410  890717  PD162M:  ADD WSACTCR1 WORK AREA       02538900
.*  $PA=PEO2392  HBB4410  890814  PD16M6:  INCREASE WSACSTKA AND        02539000
.*                                         WSACSTKB                     02539100
.*  $DL=DEO0316  HBB4410  900105  PD16ES:  INCREASE WSACBWTO            02539200
.*  $DM=DEO0324  HBB4410  900330  PD16EI:  DECREASE WSACBWTO            02539300
.*  $LK=WSMGT    HBB4410  900426  PD16EI:  INCREASE SIZE OF WSAGOPTM    02539400
.*  $PB=PEO4077  HBB4410  900504  PD16EI:  INCREASE WSACRESF            02539500
.*  $04=OY29968  JBB3313  900118  PD16EI:  INCREASE WSACOPTM AREA       02539600
.*  OY30612 - ADD FIELD WSACEXSN (280 BYTES) TO CPU WORK/SAVE @YA30612  02539700
.*            AREA TO SUPPORT APAR OY26010. (THIS APAR DOES   @YA30612  02539800
.*            NOT APPLY TO HBB4410.)                          @YA30612  02540000
.*  OY26693 - ADD FIELD WSACSCHD (16 BYTES) TO CPU WORK/SAVE  @YA26693  02540100
.*            AREA.                                           @YA26693  02540200
.*  $LL=SHARED   HBB4420  901022  PD16ES:  ADD WSALXPDA                 02540300
.*  $DN=DH30154  HBB4420  901022  PD16ME:  INCREASE WSACOPTM AREA       02540400
.*                                         CHANGED WSAGOPTM TO          02540500
.*                                         WSAGR018                     02540600
.*  $LM=DBFMC    HBB4430  910327  PD16CU:  INCREASE SIZE OF WSALSTAT    02540700
.*  $PC=PKB0026  HBB4430  910621  PD16EI:  INCREASE SIZE OF WSALCSV     02540800
.*  $PD=PKB0151  HBB4430  911104  PD16EI:  INCREASE SIZE OF WSALCSV     02540900
.*  $PE=PKI0221  JBB4422  910617  PD16EI:  Move WSACLDWT above the line 02541000
.*  $05=OY46138  JBB4422  910731  PD162M:  Extend Timer TWA       @05C  02541100
.*  $LN=SPASY    HBB4430  920108  PD16EI:  INCREASE SIZE OF WSACRSM     02541200
.*  $LO=POSIX    HBB4430  911128  PD16CU:  Add WSACDIRB and WSALEIRB    02541300
.*                                         and WSALEXPM                 02541400
.*  $PF=PKB1583  HBB4430  920429  PD16EI:  EXPAND WSACRESF TO 1536      02541500
.*                                         BYTES.  ADD CPU AREA         02541600
.*                                         WSACMCH (628 BYTES) FOR      02541700
.*                                         MACHINE CHECK.               02541800
.*  $PG=PKB1638  HBB4430  920619  PD16CA:  MOVE WSACVSM ABOVE THE LINE. 02541900
.*  $PH=PKB1703  HBB4430  920619  PD16CA:  MOVE WSAGRESF ABOVE THE LINE 02542000
.*  $PI=PKB1707  HBB4430  920619  PD16CA:  MOVE WSACMFA ABOVE THE LINE  02542100
.*  $PJ=PKB1710  HBB4430  920619  PD16CA:  DELETE FIELDS WSAGSSRS,      02542200
.*                                         WSAGEMS0,WSAGSTAT,WSAGMEMT,  02542300
.*                                         AND WSAGSCHE                 02542400
.*  $PK=PKB1711  HBB4430  920619  PD16CA:  MOVE WSACACR2 ABOVE THE LINE 02542500
.*  $PL=PKB1713  HBB4430  920619  PD16CA:  MOVE WSACEVRR ABOVE THE LINE 02542600
.*                                         AND CHANGE ITS SIZE FROM     02542700
.*                                         32 BYTES TO 8 BYTES.         02542800
.*  $PM=PKB2423  HBB4430  920619  PD16CA:  MOVE WSACDCCR ABOVE THE LINE 02542900
.*                                         AND CHANGE ITS SIZE FROM     02543000
.*                                         304 BYTES TO 100 BYTES.      02543100
.*  $LP=SYSLK    HBB5510  890821  PD16EI:  ADD WSACIXLS AND WSACIXLL    02543200
.*  $LQ=DISPR    HBB5510  930801  PD16CU:  ADD PAGE TO SCWA             02543300
.*  $LR=DISPR    HBB5510  930801  PD00XB:  Area for IEAVEGR             02543400
.*  $LS=SUBSP    HBB5510  930520  PD16IW:  Subspaces. Expand WSACSTKA,  02543500
.*                                         WSACSTKB and recompile for   02543600
.*                                         SDWA change.                 02543700
.*  $LT=WLMI     HBB5510  930415  PD16IG:  Increase size of SRM CPU-    02543800
.*                                         related stack by 448 bytes   02543900
.*  $LU=WLMI     HBB5510  930715  PD16EI:  Increase the size of         02544000
.*                                         WSACOPTM by 300 bytes        02544100
.*  $06=OW02794  HBB5510  940324  PD16EI:  Add WASCXCF2                 02544200
.*  $PN=PN7xxxx  HBB5520  940210  PD16XZ:  SHOWHDR updates              02544300
.*  $LV=ENCLVPJR HBB5520  940120  PD00XB:  Increase WSACEGR             02544400
.*  $LW=ENCLV    HBB5520  940224  PD00XZ:  Increase WSACOPTM            02544500
.*  $LX=CAPT2DS  HBB5520  940410  PD002P:  Increase WSACRSM             02544600
.*  $PO=PN70669  HBB5520  940602  PD00BA:  Increase WSACOPTM-ERR split  02544700
.*  $LY=RRSCS    HBB6603  951113  B7HGEJ:  Add WASCREMD                 02544800
.*  $LZ=WLMPESM  HBB6603  960201  B7HG2M:  Increase size of SRM CPU-    02544900
.*                                         related stack from 5864 to   02545000
.*                                         8864 bytes                   02545100
.*  $PP=PQC1289  HBB6603  960613  B7HG2M:  Delete WSAGEXSN              02545200
.*  $PQ=PQC0981  HBB6603  960801  B7HG2M:  Add WSACJOIN                 02545400
.*  $07=OW26170  HBB5510  970519  R4GAXZ:  Add WSACVAR8, delete         02545500
.*                                         WSAGVAR8.                    02545600
.*  $PP=PUX0217  HBB6605  970809  PD00H6:  Increase VSM cpu related     02545700
.*                                         area from 72 to 528 bytes    02545800
.*  $MA=IEEESUP  HBB6606  970807  PD00XB:  Larger WSACACR2              02545900
.*  $MB=PAUSE    HBB6608          B7HGRP:  Add WSACPR                   02546000
.*  $08=STSISUP  HBB6601  990206  PD00XB:  OW38489 System Info Area     02546100
.*  $MC=64BITSUP HBB7703  980810  PD00XB:  PFT IN CADS                  02546200
.*  $MD=64BITSUP HBB7703  990430  PD00HL:  Large Real                   02546300
.*  $PQ=PXD0090  HBB7703  990511  PD00XB:  Parameterize SCFS length     02546400
.*  $ME=WLMPMES  JBB6609  981005  B7HG2M:  Increase WSACOPTM            02546500
.*  $PR=PXD0486  HBB7703  991008  U2IAXZ:  Increase WSACIXLS length     02546600
.*  $09=OW40988  HBB5520  991005  U2IAXZ:  Larger WsaLExit              02546700
.*********************************************************************  02546800
.*                                                                      02546900
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     02547000
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          02547100
.*                        WSA?RNNN DC    A(0) -   RESERVED (0 BYTES).   02547200
.*                           ?     IS THE LETTER SPECIFYING             02547300
.*                                 LOCAL(L), CPU(C), OR GLOBAL(G)       02547400
.*                             NNN IS THE OFFSET WITHIN THE DSECT       02547500
.*     2. RESERVED FIELDS ARE ALL ONE FULLWORD LONG.                    02547600
.*                                                                      02547700
.* NOTE WHEN CHANGING THE SIZE OF AN AREA, THE CHANGE MUST BE MADE      02547800
.* IN THREE PLACES (IE. IN THE BAL AND PLS MAPPINGS COMMENT FIELD       02547900
.* AND IN THE HALFWORD OF THE SIZE TABLE.                               02548000
.*                                                                      02548200
.*********************************************************************  02548400
.*                                                                      02548600
         SPACE 1                                                        02550000
         AIF   ('&ACR' EQ '').WSAVT03                              @P3A 02561100
         MNOTE 4,'ACR KEYWORD NO LONGER SUPPORTED. IT IS IGNORED.' @P3A 02572200
         SPACE 1                                                        02583300
.WSAVT03 AIF   ('&FUNC' EQ 'INIT').WSAVT60                         @P3C 02594400
         PUSH  PRINT                                               @H2A 02605500
         AIF   ('&LIST' EQ 'YES').WSALIST                          @H2A 02616600
         PRINT OFF                                                 @H2A 02627700
.WSALIST ANOP                                                      @H2A 02638800
         AIF   ('&CLASS' EQ 'GLOBAL' OR '&CLASS' EQ 'CPU').WSAVT20      02650000
         AIF   ('&DSECT' EQ 'NO').WSAVT05                               02700000
WSAL     DSECT , -            LOCAL WORK/SAVE AREA VECTOR TABLE         02750000
*                             ASXBSPSA POINTS TO THIS AREA              02751000
WSALCWSA DC    A(0) -         ADDRESS OF LOW-LEVEL COMMON SAVE AREA     02752000
*                             (104 BYTES)                               02753000
WSALVALC DC    A(0) -         ADDRESS OF VALIDITY CHECK SAVE AREA       02754000
*                             (64 BYTES)                                02755000
WSALRTM2 DC    A(0) -         ADDRESS OF RECOVERY TERMINATION MANAGER   02756000
*                             (RTM) SAVE AREA (80 BYTES)                02757000
WSALSDMP DC    A(0) -         ADDRESS OF SVC DUMP WORK AREA (104 BYTES) 02758000
WSALABTM DC    A(0) -         ADDRESS OF ABTERM SAVE AREA (144 BYTES)   02759000
WSALCIRB DC    A(0) -         ADDRESS OF CIRB SAVE AREA (80 BYTES)      02760000
*                                                                MDC005 02760200
WSALS2EE DC    A(0) -         ADDRESS OF STAGE 2 EXIT EFFECTOR SAVE     02761000
*                             AREA (80 BYTES)                           02762000
WSALEXIT DC    A(0) -         ADDRESS OF EXIT (SVC 3) SAVE AREA         02763000
*                             (160 BYTES)                               02763800
WSALPOST DC    A(0) -         ADDRESS OF POST SAVE AREA (272 BYTES)     02764600
*                             (MDC303)                         @Z40EP9A 02765200
WSALWAIT DC    A(0) -         ADDRESS OF WAIT SAVE AREA (120 BYTES)     02765800
WSALSTAT DC    A(0) -         ADDRESS OF STATUS SAVE AREA      @G381P9A 02766400
*                             (384 BYTES)                          @LMC 02767000
WSALSTAE DC    A(0) -         ADDRESS OF STAE SAVE AREA                 02767600
*                             (112 BYTES)                      @G860PXH 02768200
WSALEVNT DC    A(0) -         ADDRESS OF EVENTS (FAST MULTIPLE WAIT)    02768800
*                             SAVE AREA (72 BYTES)  (MDC300)   @Z30HP9A 02769400
WSALRSM  DC    A(0) -         ADDRESS OF REAL STORAGE MANAGEMENT (RSM)  02770000
*                             SAVE AREA (216 BYTES)                @MDC 02770300
WSALACHP DC    A(0) -         ADDRESS OF ASCB CHAP ROUTINE SAVE    @L6C 02770600
*                             AREA (72 BYTES)                      @L6C 02770900
WSALCSV  DC    A(0) -         ADDRESS OF CONTENTS SUPERVISOR SAVE       02771200
*                             AREA (1152 BYTES)                    @PDC 02771500
WSALISEC DC    A(0) -         ADDRESS OF INTERSECT ROUTINE SAVE AREA    02771800
*                             (64 BYTES)                       @G860PXH 02772100
WSALSTWA DC    A(0) -         ADDRESS OF STATUS WORK/SAVE AREA FOR @H2A 02772400
*                             STOP/RESET INTERFACE (56 BYTES)           02772700
WSALLSM  DC    A(0) -         ADDRESS OF GPR SAVE AREA USED WHEN   @LAA 02773000
*                             CALLING LINKAGE STACK SERVICES (72 BYTES) 02773300
WSALS3EE DC    A(0) -         ADDRESS OF STAGE III EXIT EFFECTOR   @LAA 02773600
*                             WORK AREA  (96 BYTES).                    02773900
WSALJSIO DC    A(0) -         ADDRESS OF IEAVJSIO WORK/SAVE AREA   @LIA 02774000
*                             (1024 BYTES).                             02774100
WSALJIOC DC    A(0) -         ADDRESS OF IEAVJIOC WORK/SAVE AREA   @LIA 02774200
*                             (1024 BYTES).                             02774300
WSALJSTL DC    A(0) -         ADDRESS OF IEAVJSTL WORK/SAVE AREA   @LIA 02774400
*                             (1024 BYTES).                             02774500
WSALXPDA DC    A(0) -         ADDRESS OF IEAVXPDA WORK/SAVE AREA   @LLA 02774600
*                             (40 BYTES).                               02774700
WSALEIRB DC    A(0) -         ADDRESS OF IEAVEIRB WORK/SAVE AREA   @LOA 02785400
*                             (256 BYTES).                              02796100
WSALEXPM DC    A(0) -         ADDRESS OF IEAVEXPM WORK/SAVE AREA   @LOA 02806800
*                             (256 BYTES).                              02817500
         POP   PRINT                                               @H2A 02828200
         MEXIT                                                          02838900
.WSAVT05 ANOP                                                           02850000
         POP   PRINT                                               @H2A 02900000
         MNOTE 8,'CLASS=LOCAL,DSECT=NO NO LONGER SUPPORTED'    @G860PXD 02950000
         MEXIT                                                          03801900
.WSAVT20 AIF   ('&CLASS' EQ 'CPU').WSAVT40                              03850000
         AIF   ('&DSECT' EQ 'NO').WSAVT25                               03900000
WSAG     DSECT , -            GLOBAL WORK/SAVE AREA VECTOR TABLE        03950000
*                             CVTSPSA POINTS TO THIS AREA               04000000
WSAGR000 DC    A(0) -         FIELD CURRENTLY RESERVED (0 BYTES) -      04008100
*                                                              @G860PXD 04016200
WSAGGMFM DC    A(0) -         RESERVED FOR S/370 COMPATIBILITY @G860PXD 04024300
*                             (0 BYTES)          (MDC301)      @G860PXD 04032400
WSAGSTSI DC    A(0) -         Store system info area               @08A 04039200
WSAGR00C DC    A(0) -         RESERVED.                            @PJC 04046100
WSAGR010 DC    A(0) -         RESERVED.                            @PJC 04051700
WSAGR014 DC    A(0) -         RESERVED.                            @PJC 04057300
WSAGR018 DC    A(0) -         RESERVED.                            @DNC 04063200
WSAGR01C DC    A(0) -         RESERVED.                            @PJC 04070900
WSAGR020 DC    A(0) -         RESERVED.           (MDC318)     @G381P9A 04078700
WSAGR024 DC    A(0) -         RESERVED.                            @LHC 04078900
WSAGR028 DC    A(0) -         RESERVED.                            @PJC 04079100
WSAGR02C DC    A(0) -         RESERVED.                            @PPC 04079300
WSAGDCCR DC    A(0) -         ADDRESS OF WORK/SAVE AREA FOR DISABLED    04079600
*                             COMMUNICATION (6136 BYTES)                04079700
*                             (MDC313)                             @01C 04079800
WSAGRESF DC    A(0) -         ADDRESS OF WORK/SAVE AREA FOR RESTART     04079900
*                             FLIH  (456) BYTES)                   @L1A 04080000
*                             (MDC313)                         @ZM49423 04080100
WSAGR038 DC    A(0) -         RESERVED.                            @LHC 04080200
WSAGTIME DC    A(0) -         ADDRESS OF TIMER SAVE AREA       @G860PXD 04080400
*                             (128 BYTES)                      @G860PXD 04080500
WSAGTIM2 DC    A(0) -         ADDRESS OF TIMER SLIH WORK AREA      @LAA 04080600
*                             (24 BYTES).                               04080700
WSAGR044 DC    A(0) -         Reserved.                            @07C 04080900
WSAGSRM1 DC    A(0) -         ADDRESS OF GENERAL REGISTER SAVE     @P4A 04081100
*                             AREA FOR SRM - SERIALIZED BY THE SRM      04081200
*                             LOCK.  (72 BYTES)                         04081300
         POP   PRINT                                               @H2A 04081400
         MEXIT                                                          04081500
.WSAVT25 ANOP                                                           04083300
         POP   PRINT                                               @H2A 04133300
         MNOTE 8,'CLASS=GLOBAL,DSECT=NO NO LONGER SUPPORTED'   @G860PXD 04183300
         MEXIT                                                          05600000
.WSAVT40 AIF   ('&DSECT' EQ 'NO').WSAVT45                               05650000
WSAC     DSECT , -            CPU WORK/SAVE AREA VECTOR TABLE           05700000
*                             LCCACPUS POINTS TO THIS AREA              05701000
WSACCWSA DC    A(0) -         ADDRESS OF LOW-LEVEL COMMON SAVE AREA     05702000
*                             (104 BYTES)                               05703000
WSACGTF  DC    A(0) -         ADDRESS OF GTF SAVEAREA (232 BYTES)  @DIC 05704000
*                             (MDC309)                         @G860PXD 05704200
WSACOPTM DC    A(0) -         ADDRESS OF SYSTEM RESOURCES MANAGER  @LWC 05705100
*                             (SRM) SAVE AREA (9168 BYTES)         @MEC 05706000
WSACTIME DC    A(0) -         ADDRESS OF TIMER SAVE AREA (96 BYTES)     05707000
*                                                                MDC008 05707200
WSACACR  DC    A(0) -         ADDRESS OF ALTERNATE CPU             @DHC 05707800
*                             RECOVERY (ACR) SAVE AREA                  05708400
*                             (3808 BYTES)                              05709000
*                             (SAVE AREA FOR: HARDWARE AND              05709600
*                             SOFTWARE INFORMATION,                     05710200
*                             NORMAL STACK,                             05710800
*                             IEAVTRTH SAVE AREA - WSACRTMK)            05711400
WSACRTMK DC    A(0) -         ADDRESS OF RECOVERY              @G381P9A 05712000
*                             TERMINATION MANAGER MACHINE      @G381P9A 05712600
*                             CHECK HANDLER (RTM/MACHK) SAVE   @G381P9A 05713200
*                             AREA  (360 BYTES)                    @MCC 05713800
WSACIOS  DC    A(0) -         ADDRESS OF IOS SAVE AREA         @G860PXD 05714400
*                             (80 BYTES)                                05715000
WSACEDS0 DS    0A   -         ADDRESS OF SCHEDULE SAVE AREA    @G381P9A 05715600
*                                (OLD NAME)           (MDC316) @G860PXB 05716200
WSACESC0 DC    A(0)           ADDRESS OF SCHEDULE SAVE AREA    @G860PXB 05716800
*                             (80 BYTES)                       @G860PXD 05717400
WSACMF1  DC    A(0) -         ADDRESS OF MEASUREMENT FACILITY 1 SAVE    05718000
*                             AREA (144 BYTES)                   MDC019 05719000
WSACABTM DC    A(0) -         ADDRESS OF ABTERM SAVE AREA (136 BYTES)   05719200
*                                                                MDC006 05719400
WSACDIVS DC    A(0) -         ADDRESS OF DATA IN VIRTUAL (DIV)     @D4A 05720700
*                             WORK/SAVE AREA (8192 BYTES)               05722000
WSACLDWT DC    A(0) -         ADDRESS OF WORK/SAVE AREA FOR STATUS @MAC 05723300
*                             SAVING BY LOADWAIT/RESTART PROCESSING     05724600
*                             (640 BYTES)                               05725900
WSACSCPS DC    A(0) -         ADDRESS OF SUPERVISOR CONTROL PSEUDO @L4C 05727200
*                             SDWA. INITIALIZED BY THE             @L4C 05728500
*                             SUPERVISOR ANALYSIS ROUTER, LOCK     @L4C 05729800
*                             REPAIR AND GLOBAL RECOVERY.          @L4C 05731100
*                             (1384 BYTES).                        @LSC 05732400
WSACVSM  DC    A(0) -         ADDRESS OF VSM GLOBAL BRANCH ENTRY        05733700
*                             SAVE AREA (528 BYTES)                @PPC 05735000
WSACASMD DC    A(0) -         ADDRESS OF AUXILIARY STORAGE MANAGEMENT   05736300
*                             (ASM) DISABLED INTERRUPT EXIT (DIE)       05737600
*                             WORK/SAVE AREA (1024 BYTES)          @D2C 05738900
*                             (MDC304)                         @G860PXH 05740200
WSACASMS DC    A(0) -         ADDRESS OF AUXILIARY STORAGE MANAGEMENT   05741500
*                             (ASM) SRB DRIVEN I/O ROUTINES WORK/SAVE   05742800
*                             AREA (1024 BYTES)  (MDC305)          @L2C 05744100
WSACRSM  DC    A(0) -         ADDRESS OF REAL STORAGE MANAGER (RSM)     05745400
*                             WORK/SAVE AREA (48 PAGES)            @MDC 05746700
WSACDCCR DC    A(0) -         ADDRESS OF DISABLED CONSOLE COMMUNICATION 05748000
*                             WORK/SAVE AREA (100 BYTES)           @PMC 05749300
*                             (MDC310)                         @G65UP9A 05750600
WSACSLIP  DC   A(0) -         ADDRESS OF SLIP/PER WORK/SAVE    @G381P9A 05751900
*                             (136 BYTES).          (MDC317)            05753200
WSACEVRR  DC   A(0) -         ADDRESS OF ASVT AND AFT              @PLC 05754500
*                             RECONSTRUCT WORK/SAVE AREA       @G381P9A 05755800
*                             (8  BYTES).                      @G381P9A 05757100
WSACRESF  DC   A(0) -         ADDRESS OF RESTART FLIH              @PFC 05758400
*                             WORK/SAVE AREA (1536 BYTES).              05759700
WSACMFA   DC   A(0) -         ADDRESS OF MALFUNCTION ALERT         @D1A 05761000
*                             WORK/SAVE AREA (256 BYTES).               05762300
WSACSCWA  DC   A(0) -         ADDRESS OF SUPERVISOR CONTROL        @LVC 05763600
*                             WORK/SAVE AREA (12288 BYTES)              05764900
WSACTRCE  DC   A(0) -         ADDRESS OF SYSTEM TRACE SERVICE ROUTINES  05766200
*                             WORK/SAVE AREA (512 BYTES)       @G860PXD 05767500
WSACTAIM  DC   A(0) -         ADDRESS OF RECURSIVE ACR MESSAGE @G860PXD 05768800
*                             WORK AREA (168 BYTES)                     05770100
WSACRTMW  DC   A(0) -         GENERAL RTM WORK/SAVE AREA           @L9C 05771400
*                             (3272 BYTES).                             05772700
WSACSTKA  DC   A(0) -         ABOVE FRR STACK WORK AREA FOR RTM    @LSC 05774000
*                                                                       05775300
WSACSTKB  DC   A(0) -         BELOW FRR STACK WORK AREA FOR RTM    @LSC 05776600
*                                                                       05777900
WSACASMR  DC   A(0) -         ADDRESS OF SAVEAREA FOR ASM RECOVERY @L5A 05779200
*                             ROUTINES (1024 BYTES)                @L5A 05780500
WSACSCFS  DC   A(0) -         ADDRESS OF SUPERVISOR CONTROL FLIH   @MCC 05781800
*                             SAVEAREA (1080 BYTES)                     05783100
WSACSTPL DC    A(0) -         ADDRESS OF SUPERVISOR CONTROL'S      @LAA 05784400
*                             SYSTEM TRACE PARARMETER LIST FOR          05785700
*                             DISABLED CALLERS (24 BYTES).              05787000
WSACDESA DC    A(0) -         ADDRESS OF DIAGNOSTIC EXIT FACILITY  @LAA 05788300
*                             SAVEAREA FOR DISABLED CALLERS (72 BYTES). 05789600
WSACPAWA DC    A(0) -         ADDRESS OF THE PC/AUTH WORK AREA     @LAA 05790900
*                             (3448 BYTES).                             05792200
WSACSYMR DC    A(0) -         ADDRESS OF THE SYMREC WORK SAVEAREA  @LAA 05793500
*                             (3000 BYTES).                             05794800
WSACXCF  DC    A(0) -         ADDRESS OF XCF WORK AREA             @LFC 05794900
*                             (30000 BYTES).                            05795000
WSACECLT DC    A(0) -         ADDRESS OF THE CURRENT LOCKS HELD    @LCA 05795100
*                             TABLE EXTENSION (128 BYTES).              05795200
WSACTWA  DC    A(0) -         ADDRESS OF ETR/MCH WORK SAVE AREA    @05C 05795300
*                             (8192 BYTES).                             05795400
WSACACR2 DC    A(0) -         ADDRESS OF ALTERNATE CPU RECOVERY    @MAC 05795500
*                             (ACR) WORK/SAVE AREA (1024 BYTES)         05795600
WSACBWTO DC    A(0) -         ADDRESS OF WORK/SAVE AREA FOR        @DMC 05795700
*                             SYNCHRONOUS BRANCH-ENTRY WTO (5008 BYTES) 05795800
WSACTCR1 DC    A(0) -         ADDRESS OF WORK/SAVE AREA FOR        @LJA 05795900
*                             ACR RECOVERY (256 BYTES)                  05796000
WSACIXLS DC    A(0) -         ADDRESS OF CPU-RELATED SAVE AREA     @LPA 05796100
*                             FOR USE BY THE SYSTEM LOCK MANAGER        05796200
*                             (10 pages)                                05796300
WSACIXLL DC    A(0) -         ADDRESS OF CPU-RELATED SAVE AREA     @LPA 05796400
*                             FOR USE BY THE HARDWARE INTERFACE         05796500
*                             FUNCTION OF THE SYSTEM LOCK MANAGER       05796600
*                             (2000 BYTES)                              05796700
WSACEGR  DC    A(0) -         ADDRESS OF CPU-RELATED SAVE AREA     @LVC 05796800
*                             FOR USE BY IEAVEGR                        05796900
*                             (9216 BYTES)                              05797000
WSACSCHD DC    A(0) -         ADDRESS OF CPU WORK/SAVE AREA    @YA26693 05797100
*                             FOR SRB SCHEDULER (16 BYTES).    @YA26693 05797200
WSACDIRB DC    A(0) -         ADDRESS OF CPU WORK/SAVE AREA            -05797300
                              FOR IEAVDIRB (96 BYTES).             @LOA 05797600
WSACMCH  DC    A(0) -         ADDRESS OF CPU WORK/SAVE AREA        @PFA 05797900
*                             FOR MACHINE CHECK HANDLER                 05798200
*                             (628 BYTES)                               05798500
WSACXCF2 DC    A(0) -         ADDRESS OF XCF WORK AREA2            @06A 05798600
*                             (30000 BYTES).                            05798700
WSACREMD DC    A(0) -         Address of Registration Services     @LYA 05798900
*                             Retrieve exit manager data.               05799100
*                             (1024 Bytes)                              05799300
WSACJOIN DC    A(0) -         Address of CPU Work/Save Area for    @PQA 05799400
*                             IEAVJOIN/IEAVLEAV (144 bytes)             05799500
WSACVAR8 DC    A(0) -         ADDRESS OF REAL ADDRESS CONVERSION   @07A 05806700
*                             ROUTINE (IEAVAR08) WORK AREA.             05813900
*                             (32 BYTES).                               05821100
WSACPR   DC    A(0) -         Address of PRDA work/saveare used by      05822900
*                             Pause/Release routines.                   05824700
*                             1024 bytes                           @MBA 05826500
         POP   PRINT                                               @H2A 05828300
         MEXIT                                                          05835500
.WSAVT45 ANOP                                                           05842700
         POP   PRINT                                               @H2A 05850000
         MNOTE 8,'CLASS=CPU,DSECT=NO NO LONGER SUPPORTED'      @G860PXD 05900000
         MEXIT                                                          06550000
.WSAVT60 AIF   ('&CLASS' EQ 'GLOBAL' OR '&CLASS' EQ 'CPU').WSAVT70      06600000
         DS    0D -           LENGTH TABLE FOR LOCAL WSAVT              06650000
         DC    A((WSALEND-WSALFRST)/4)  Number of entries in local     *06700000
                              work/save area vector table          @MCC 06750000
WSALFRST DC    H'104' -       LENGTH OF LOW-LEVEL COMMON WORK/SAVE      06800000
*                             AREA IN BYTES                        @LXC 06850000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 06962500
*                             BIT STORAGE                      @G860PXD 06975000
*                                                              @G860PXD 06987500
         DC    H'64' -        LENGTH OF VALIDITY CHECK WORK/SAVE AREA   07000000
*                             IN BYTES                                  07050000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07062000
*                             BIT STORAGE                      @G860PXD 07074000
*                                                              @G860PXD 07086000
         DC    H'80' -        LENGTH OF RECOVERY TERMINATION MANAGER    07098000
*                             (RTM) WORK/SAVE AREA IN BYTES             07110000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07120000
*                             BIT STORAGE                      @G860PXD 07130000
*                                                              @G860PXD 07140000
         DC    H'104'  -      LENGTH OF SVC DUMP WORK/SAVE AREA    @DCC 07150000
*                             IN BYTES.                                 07160000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 07170000
*                             BIT STORAGE                      @G860PXD 07180000
*                                                              @G860PXD 07190000
         DC    H'144' -       LENGTH OF ABTERM WORK/SAVE AREA IN BYTES  07201200
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07212500
*                             BIT STORAGE                      @G860PXD 07225000
*                                                              @G860PXD 07237500
         DC    H'80' -        LENGTH OF CIRB WORK/SAVE AREA IN BYTES    07250000
*                                                                MDC005 07251000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07263200
*                             BIT STORAGE                      @G860PXD 07275400
*                                                              @G860PXD 07287600
         DC    H'80' -        LENGTH OF STAGE 2 EXIT EFFECTOR WORK/     07300000
*                             SAVE AREA IN BYTES                        07350000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07362500
*                             BIT STORAGE                      @G860PXD 07375000
*                                                              @G860PXD 07387500
         DC    H'160' -       LENGTH OF EXIT (SVC 3) WORK/SAVE     @09C 07411800
*                             area IN BYTES                             07436100
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @ZMC0563 07460500
*                             BIT STORAGE                      @ZMC0563 07471000
*                                                              @G860PXD 07481500
         DC    H'272' -       LENGTH OF POST WORK/SAVE AREA IN     @D9C 07492000
*                             BYTES (MDC303)                            07502500
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07513000
*                             BIT STORAGE                      @G860PXD 07523500
*                                                              @G860PXD 07534000
         DC    H'120'   -     LENGTH OF WAIT WORK/SAVE AREA IN     @D9C 07544500
*                             BYTES                                     07555000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07565500
*                             BIT STORAGE                      @G860PXD 07576000
*                                                              @G860PXD 07586500
         DC    H'384' -       LENGTH OF STATUS WORK/SAVE AREA IN BYTES  07597000
*                                                                  @LMC 07607500
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 07618000
*                             BIT STORAGE                      @G860PXD 07628500
*                                                              @G860PXD 07639000
         DC    H'112' -       LENGTH OF STAE WORK/SAVE AREA IN BYTES    07650000
*                                                                MDC003 07651000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07655800
*                             BIT STORAGE                      @G860PXD 07660600
*                                                              @G860PXD 07665400
         DC    H'72' -        LENGTH OF EVENTS (FAST MULTIPLE WAIT)     07670200
*                             WORK/SAVE AREA IN BYTES (MDC300) @Z30HP9A 07675000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07679800
*                             BIT STORAGE                      @G860PXD 07684600
*                                                              @G860PXD 07689400
         DC    H'216' -       LENGTH OF REAL STORAGE MANAGEMENT (RSM)   07694200
*                             WORK/SAVE AREA IN BYTES              @MDC 07699000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07703800
*                             BIT STORAGE                      @G860PXD 07708600
*                                                              @G860PXD 07713400
         DC    H'72' -        LENGTH OF ASCB CHAP ROUTINE          @L6C 07718200
*                             SAVE AREA IN BYTES                   @L6C 07723000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 07727800
*                             BIT STORAGE                      @G860PXD 07732600
*                                                              @G860PXD 07737400
         DC    H'1152' -      LENGTH OF CONTENTS SUPERVISOR SAVE        07742200
*                             AREA IN BYTES                        @PDC 07747000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 07751800
*                             BIT STORAGE                      @G860PXD 07756600
*                                                              @G860PXD 07761400
         DC    H'64' -        LENGTH OF INTERSECT ROUTINE               07766200
*                             WORK/SAVE AREA IN BYTES          @G860PXH 07771000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 07775800
*                             BIT STORAGE                      @G860PXD 07780600
*                                                              @G860PXD 07785400
         DC    H'56' -        LENGTH IN BYTES OF STATUS WORK/SAVE  @H2A 07790200
*                             AREA FOR STOP/RESET INTERFACE             07795000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @H2A 07799800
*                             BIT STORAGE                               07804600
         DC    H'72' -        LINKAGE STACK SERVICES WORK/SAVEAREA @LAA 07809400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LAA 07814200
*                             STORAGE                                   07819000
         DC    H'96' -        LENGTH IN BYTES OF WORK/SAVE AREA    @LAA 07823800
*                             FOR STAGE III EXIT EFFECTOR.              07828600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LAA 07833400
*                             STORAGE                                   07838200
         DC    H'1024'        LENGTH IN BYTES OF WORK/SAVE AREA    @LIA 07838500
*                             FOR IEAVJSIO                              07838800
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LIA 07839100
*                             STORAGE                                   07839400
         DC    H'1024'        LENGTH IN BYTES OF WORK/SAVE AREA    @LIA 07839700
*                             FOR IEAVJIOC                              07840000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LIA 07840300
*                             STORAGE                                   07840600
         DC    H'1024'        LENGTH IN BYTES OF WORK/SAVE AREA    @LIA 07840900
*                             FOR IEAVJSTL                              07841200
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LIA 07841500
*                             STORAGE                                   07841800
         DC    H'40'          LENGTH IN BYTES OF WORK/SAVE AREA    @LLA 07842000
*                             FOR IEAVXPDA                              07842200
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LLA 07842400
*                             STORAGE                                   07843000
         DC    H'256'         LENGTH IN BYTES OF WORK/SAVE AREA    @LOA 07843600
*                             FOR IEAVEIRB                              07844200
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LOA 07844800
*                             STORAGE                                   07845400
         DC    H'256'         LENGTH IN BYTES OF WORK/SAVE AREA    @LOA 07846000
*                             FOR IEAVEXPM                              07846600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LOA 07847200
*                             STORAGE                                   07847800
WSALEND  DS    0F   -         True end of table                    @MCA 07848500
         DS    0D   -         Round to dword                       @MCC 07849200
         MEXIT                                                          07850000
.WSAVT70 AIF   ('&CLASS' EQ 'CPU').WSAVT80                              07900000
         DS    0D -           LENGTH TABLE FOR GLOBAL WSAVT             07950000
         DC    A((WSAGEND-WSAGFRST)/4)  Number of entries in global    *07993300
                              work/save area vector table          @MCC 08036600
WSAGFRST DC    H'0'  -        FIELD CURRENTLY RESERVED             @MCC 08079900
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 08123200
*                             BIT STORAGE                      @G860PXD 08166500
*                                                              @G860PXD 08209800
         DC    H'0'  -        FIELD CURRENTLY RESERVED         @G860PXD 08253100
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 08296400
*                             BIT STORAGE                      @G860PXD 08339700
*                                                              @G860PXD 08383000
         DC    AL2(SIV1V2V3_LEN) WSAGSTSI area                     @08A 08421500
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @08A 08460000
*                             BIT STORAGE                          @08A 08498500
*                                                                  @08A 08537000
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PJC 08575500
*                             IN BYTES                                  08594800
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PJC 08614200
*                             BIT STORAGE                               08633600
*                                                                       08653000
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PJC 08672400
*                             IN BYTES                                  08691800
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PJC 08711200
*                             BIT STORAGE                               08730600
*                                                                       08750000
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PJC 08769400
*                             IN BYTES                                  08788800
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PJC 08808200
*                             BIT STORAGE                               08827600
*                                                                       08847000
         DC    H'0'   -       LENGTH OF RESERVED WORK/SAVE AREA IN @DNC 08866400
*                             BYTES                                     08883000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 08899600
*                             BIT STORAGE                      @G860PXD 08916200
*                                                              @G860PXD 08932800
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PJC 08950000
*                             IN BYTES                                  09000000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PJC 09001700
*                             BIT STORAGE                               09003400
*                                                                       09005100
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA IN      09006800
*                             BYTES                 (MDC318)   @G381P9A 09008500
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09010200
*                             BIT STORAGE                      @G860PXD 09011900
*                                                              @G860PXD 09013600
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA IN @LHC 09015800
*                             BYTES                                     09018000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09020400
*                             BIT STORAGE                      @G860PXD 09022100
*                                                              @G860PXD 09023800
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PJC 09025700
*                             IN BYTES                                  09027600
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PJC 09029500
*                             BIT STORAGE                               09031400
*                                                                       09033300
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA    @PPC 09035100
*                             IN BYTES                                  09036900
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @PPC 09038700
*                             BIT STORAGE                               09040800
*                                                              @G860PXD 09042500
         DC    H'6136' -      LENGTH OF WORK/SAVE AREA FOR DISABLED     09044200
*                             CONSOLE COMMUNICATION (MDC313)       @01C 09045900
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @01C 09047600
*                             BIT STORAGE                               09049300
*                                                              @G860PXD 09051000
         DC    H'456'         LENGTH OF WORK SAVE AREA FOR THE     @L1A 09052700
*                             RESTART FLIH IN BYTES                @L1A 09054400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PHC 09056100
*                             BIT STORAGE                      @G860PXD 09057800
*                                                              @G860PXD 09059500
         DC    H'0' -         LENGTH OF RESERVED WORK/SAVE AREA IN @LHC 09061200
*                             BYTES                                     09062900
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09064600
*                             BIT STORAGE                      @G860PXD 09066300
*                                                              @G860PXD 09068000
         DC    H'128' -       LENGTH OF TIMER SAVE AREA IN     @G860PXD 09069700
*                             BYTES                            @G860PXH 09071400
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09073100
*                             BIT STORAGE                      @G860PXD 09074800
*                                                              @G860PXD 09076500
         DC    H'24' -        LENGTH OF TIMER SLIH WORK AREA       @LAA 09078200
         DC    X'0000'        ACQUIRE SAVE AREA IN 24 BIT STORAGE  @LAA 09079900
         DC    H'00' -        Reserved.                            @07C 09082400
         DC    X'8000'        ACQUIRE SAVE AREA IN 31 BIT STORAGE  @LAA 09085000
         DC    H'72' -        LENGTH OF SRM GENERAL REGISTER SAVE  @P4A 09086700
*                             AREA IN BYTES.                            09088400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @P4A 09090100
*                             STORAGE                                   09091800
WSAGEND  DS    0F   -         True end of table                    @MCA 09094500
         DS    0D   -         Round to dword                       @MCC 09097200
         MEXIT                                                          09100000
.WSAVT80 ANOP                                                           09150000
         DS    0D -           LENGTH TABLE FOR CPU WSAVT                09200000
         DC   A((WSACEND-WSACFRST)/4) Number of entries in CPU         *09250000
                              work/save area vector table          @MCC 09300000
WSACFRST DS    0H                                                       09333300
WSACCWSA DC    H'104' -       LENGTH OF LOW-LEVEL COMMON WORK/SAVE      09366600
*                             AREA IN BYTES                        @MCC 09400000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09514200
*                             BIT STORAGE                      @G860PXD 09528400
*                                                              @G860PXD 09542600
WSACGTF  DC    H'232' -       LENGTH OF GTF WORK/SAVE AREA IN      @DIC 09556800
*                             BYTES (MDC309)                   @G860PXD 09571000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @LGC 09585200
*                             BIT STORAGE                      @G860PXD 09599400
WSACOPTM DC    H'9168' -      LENGTH OF SYSTEM RESOURCES MANAGER   @MEC 09620700
*                             (SRM) WORK/SAVE AREA IN BYTES             09642000
*                             (5192 + 408) + 264 + 3000 +304       @MEC 09649100
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 09656200
*                             BIT STORAGE                      @G860PXD 09670400
*                                                              @G860PXD 09684600
WSACTIME DC    H'96' -        LENGTH OF TIMER WORK/SAVE AREA IN BYTES   09692800
*                                                                MDC008 09701000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09706500
*                             BIT STORAGE                      @G860PXD 09712000
*                                                              @G860PXD 09717500
WSACACR  DC    H'4000' -      LENGTH OF ALTERNATE CPU              @MCC 09725700
*                             RECOVERY (ACR)                            09734000
*                             WORK/SAVE AREA IN BYTES                   09736700
*                                                              @ZMC1769 09739500
*                             BREAKDOWN IS AS FOLLOWS:         @G860PXD 09745000
*                             ACRSVBSE      =  720 BYTES           @DHC 09750500
*                             ACRESAME      =  192 BYTES           @MCC 09753200
*                             PSA-USEND     = 1224 BYTES       @G860PXD 09756000
*                             US2ST-US2ND   =  472 BYTES           @H1C 09761500
*                             NORMAL STACK  =  856 BYTES           @DFC 09767000
*                             RTH SAVEAREA  =  360 BYTES (SAME AS       09769700
*                                                        WSACRTMK) @MCC 09772400
*                             ADDITIONAL                                09775100
*                              STATUS SAVED =   76 BYTES           @DHC 09777800
*                             EXPANSION PAD =  100 BYTES           @DHC 09780500
*                                             -----                     09783500
*                                             4000                 @MCC 09789000
*                                                                       09794500
         DC    X'4000'        ACQUIRE WORK/SAVE AREA IN 24         @P5C 09800000
*                             BIT STORAGE - CACHE ALIGNED      @G860PXD 09805500
*                                                              @G860PXD 09811000
WSACRTMK DC    H'360' -       LENGTH OF RECOVERY TERMINATION       @MCC 09816500
*                             MANAGER MACHINE CHECK HANDLER (RTM/MACHK) 09822000
*                             SAVE AREA IN BYTES                        09827500
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 09833000
*                             BIT STORAGE                      @G860PXD 09838500
*                                                              @G860PXD 09844000
WSACIOS  DC    H'80' -        LENGTH OF IOS (FLIH) WORK/SAVE AREA IN    09872000
*                             BYTES                                     09900000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09914300
*                             BIT STORAGE                      @G860PXD 09928600
*                                                              @G860PXD 09942900
WSACESC0 DC    H'80' -        LENGTH OF SCHEDULE WORK/SAVE     @G381P9A 09957200
*                             AREA IN BYTES          (MDC316)  @G381P9A 09971500
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 09985800
*                             BIT STORAGE                      @G860PXD 10000100
*                                                              @G860PXD 10014400
WSACMF1  DC    H'144' -       LENGTH OF MEASUREMENT FACILITY 1 WORK/    10028700
*                             SAVE AREA IN BYTES                 MDC019 10043000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 10057300
*                             BIT STORAGE                      @G860PXD 10071600
*                                                              @G860PXD 10085900
WSACABTM DC    H'136' -        LENGTH OF ABTERM WORK/SAVE AREA IN       10091400
*                             BYTES (WSACABTM)                     @MCC 10097000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 10102600
*                             BIT STORAGE                      @G860PXD 10103200
*                                                              @G860PXD 10103800
WSACDIVS DC    H'8192' -      LENGTH OF DATA IN VIRTUAL (DIV)      @D4A 10104400
*                             WORK/SAVE AREA IN BYTES                   10105000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @D4A 10105600
*                             BIT STORAGE                               10106200
*                                                                       10106800
WSACLDWT DC    H'640' -       LENGTH OF WORK/SAVE AREA FOR STATUS  @MAC 10107400
*                             SAVING BY LOADWAIT/RESTART PROCESSING IN  10108000
*                             BYTES                                @LXC 10108600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PEC 10109200
*                             BIT STORAGE                      @G860PXD 10109800
*                                                              @G860PXD 10110400
WSACSCPS DC    AL2(SDWAMLEN)  SUPERVISOR CONTROL PSEUDO            @LAC 10111000
*                             SDWA. INITIALIZED BY THE             @L4C 10111600
*                             SUPERVISOR ANALYSIS ROUTER AND BY    @L4C 10112200
*                             LOCK REPAIR. (ANY CHANGE TO THIS     @L4C 10112800
*                             OF THIS FIELD COULD REQUIRE A RECOMPILE   10113400
*                             OF IEAVESAR AND IEAVELKR.)                10114000
*                             BREAKDOWN:                           @L4C 10114600
*                               SDWA         664                   @L4C 10115200
*                               SDWARC1      456                   @LSC 10115800
*                               SDWARC2       16                   @L4C 10116400
*                               SDWARC3       32                   @L4C 10117000
*                               SDWARC4      192                   @MCC 10117300
*                               SDWAPTRS      24                   @L4C 10117600
*                                          -------                 @L4C 10118200
*                                           1384                   @MCC 10118800
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @L4C 10119400
*                             BIT STORAGE                      @G860PXD 10120000
*                                                              @G860PXD 10120600
WSACVSM  DC    H'528' -       LENGTH OF VSM GLOBAL BRANCH ENTRY SAVE    10121200
*                             AREA IN BYTES                        @PPC 10121800
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PGC 10122400
*                             BIT STORAGE                      @G860PXD 10123000
*                                                              @G860PXD 10123600
WSACASMD DC    H'1024' -      LENGTH OF AUXILIARY STORAGE MANAGEMENT    10124200
*                             (ASM) DISABLED INTERRUPT EXIT (DIE)       10124800
*                             WORK/SAVE AREA IN BYTES (MDC304)     @D2C 10125400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 10126000
*                             BIT STORAGE                      @G860PXD 10126600
*                                                              @G860PXD 10127200
WSACASMS DC    H'1024' -      LENGTH OF AUXILIARY STORAGE MANAGEMENT    10127800
*                             (ASM) SRB DRIVEN I/O ROUTINES WORK/SAVE   10128400
*                             AREA IN BYTES  (MDC305)          @Z40WP9A 10129000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 10129600
*                             BIT STORAGE                      @G860PXD 10130200
*                                                              @G860PXD 10130800
WSACRSM  DC    H'48'      -   LENGTH OF REAL STORAGE MANAGER (RSM) @MDC 10132000
*                             WORK/SAVE AREA (WSACRSM) IN PAGES         10133200
         DC    X'A000'        ACQUIRE WORK/SAVE AREA IN 31         @P6C 10134400
*                             BIT STORAGE - LENGTH IS IN PAGES          10135600
*                                                                       10136800
WSACDCCR DC    H'100' -       LENGTH OF DISABLED CONSOLE COMMUNICATION  10137400
*                             WORK/SAVE AREA IN BYTES (MDC310)     @PMC 10138000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PMC 10138600
*                             BIT STORAGE                      @G860PXD 10139200
*                                                              @G860PXD 10139800
WSACSLIP DC    H'136' -       LENGTH OF SLIP/PER WORK/SAVE     @G381P9A 10140400
*                             AREA IN BYTES.          (MDC317) @G381P9A 10141000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24     @G860PXD 10141600
*                             BIT STORAGE                      @G860PXD 10142200
*                                                              @G860PXD 10142800
WSACEVRR DC    H'8'  -        LENGTH OF ASVT AND AFT               @PLC 10143400
*                             RECONSTRUCT WORK/SAVE AREA       @G381P9A 10144000
*                             IN BYTES.               (MDC317) @G381P9A 10144600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PLC 10145200
*                             BIT STORAGE                      @G860PXD 10145800
*                                                              @G860PXD 10146400
WSACRESF DC    H'1536' -      LENGTH OF RESTART FLIH WORK/SAVE     @PFC 10147000
*                             AREA IN BYTES.                            10147600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @DAC 10148200
*                             BIT STORAGE                               10148800
*                                                                       10149400
WSACMFA  DC    H'256' -       LENGTH OF MALFUNCTION ALERT          @LHC 10150000
*                             WORK/SAVE AREA IN BYTES.                  10150600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PIC 10151200
*                             BIT STORAGE                               10151800
*                                                                       10152400
*        DC    H'12288' -     LENGTH OF SUPERVISOR CONTROL         @LVC 10152800
WSACSCWA DC    AL2(SCW2END-SCWA2+SCW1END-SCWA1+SCWEND-SCWA)        @LVC 10153200
*                             WORK/SAVE AREA IN BYTES.                  10153600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 10154200
*                             BIT STORAGE                      @G860PXD 10154800
*                                                                       10155400
WSACTRCE DC    H'512' -       LENGTH OF SYSTEM TRACE SERVICE ROUTINES   10156000
*                             WORK/SAVE AREA IN BYTES.         @G860PXD 10156600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 10157200
*                             BIT STORAGE                      @G860PXD 10157800
*                                                                       10158400
WSACTAIM DC    H'168'         LENGTH OF RECURSIVE ACR MESSAGE          -10159000
                              WORK AREA IN BYTES                   @LHC 10159600
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31     @G860PXD 10160200
*                             BIT STORAGE                      @G860PXD 10160800
*                                                                       10161400
WSACRTMW DC    H'3272'        GENERAL RTM WORK/SAVE AREA           @L9C 10162300
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @L9C 10163200
*                             BIT STORAGE                               10163800
*                                                                       10164400
WSACSTKA DC    AL2(FSTKABVE_LEN) Above FRR stack work area for RTM @MCC 10165000
*                             (WSACSTKA). (ANY CHANGE TO THE SIZE       10165600
*                             OF THIS FIELD COULD REQUIRE A RECOMPILE   10166200
*                             OF IEAVESAR AND IEAVELKR.)                10166800
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @L9C 10167400
*                             BIT STORAGE                               10168000
*                                                                       10168600
WSACSTKB DC    AL2(FSTKBELW_LEN) Below FRR stack work area for RTM @MCC 10169200
*                             (WSACSTKB). (ANY CHANGE TO THE SIZE       10169800
*                             OF THIS FIELD COULD REQUIRE A RECOMPILE   10170400
*                             OF IEAVESAR AND IEAVELKR.)                10171000
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24         @L9C 10171600
*                             BIT STORAGE                               10172200
*                                                                       10172800
WSACASMR DC    H'1024'        SAVEAREA FOR ASM RECOVERY ROUTINES   @P8C 10173400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @L5A 10174000
*                             BIT STORAGE                          @L5A 10174600
WSACSCFS DC    AL2(SCFSEND-SCFS) LENGTH OF SUP CTL FLIH SAVEAREA   @PQC 10175500
         DC    X'C000'        ACQUIRE SAVEAREA IN 31 BIT STORAGE   @DEC 10176400
*                             AND CACHE ALIGN THE STORAGE.              10176700
WSACSTPL DC    H'24' -        LENGTH IN BYTES OF PARAMETER LIST    @LAA 10177100
*                             FOR SUPERVISOR CONTROL'S SYSTEM TRACE.    10177600
         DC    X'0000'        ACQUIRE PARAMETER LIST STORAGE IN    @D7C 10178200
*                             24 BIT STORAGE                            10178800
WSACDESA DC    H'72' -        LENGTH IN BYTES OF DIAGNOSTIC EXIT   @LAA 10179400
*                             SAVEAREA.                                 10180000
         DC    X'8000'        ACQUIRE SAVEAREA IN 31 BIT STORAGE   @LAA 10180600
WSACPAWA DC    H'3448'        LENGTH OF PC/AUTH WORK/SAVE AREA     @DGC 10181200
*                             IN BYTES                                  10181800
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LAA 10182400
*                             STORAGE                                   10183000
WSACSYMR DC    H'3000'        LENGTH OF SYMREC WORK/SAVE AREA IN   @D8C 10183600
*                             BYTES                                     10184200
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LAA 10184800
*                             STORAGE                                   10185400
WSACXCF  DC    H'30000'       LENGTH OF XCF WORK AREA IN           @LFC 10185700
*                             BYTES                                     10186000
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LFC 10186300
*                             STORAGE                                   10186600
WSACECLT DC    H'128'         LENGTH OF CURRENT LOCKS HELD TABLE   @LCA 10186900
*                             EXTENSION IN BYTES                        10187200
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LCA 10187500
*                             STORAGE                                   10187800
WSACTWA  DC    H'8192'        LENGTH OF ETR/MCH WORK SAVE AREA IN  @05C 10188100
*                             BYTES                                     10188400
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LDA 10188700
*                             STORAGE                                   10189000
WSACACR2 DC    H'1024'        LENGTH OF ACR WORK/SAVE AREA IN      @MAC 10189300
*                             BYTES.  THIS NUMBER SHOULD AGREE WITH     10189600
*                             THAT DECLARED AS SIZDATD IN MODULE        10189900
*                             IEAVTACR                                  10190200
         DC    X'8000'        AQUIRE WORK/SAVE AREA IN 31 BIT      @PKC 10190500
*                             STORAGE                                   10190800
WSACBWTO DC    H'5008'        LENGTH OF WORK/SAVE AREA FOR         @DMC 10191100
*                             SYNCHRONOUS BRANCH-ENTRY WTO              10191400
         DC    X'8000'        AQUIRE WORK/SAVE AREA IN 31 BIT      @DJA 10191700
*                             STORAGE                                   10192000
WSACTCR1 DC    H'256'         LENGTH OF WORK/SAVE AREA FOR         @LJA 10192300
*                             ACR RECOVERY                              10192600
         DC    X'8000'        AQUIRE WORK/SAVE AREA IN 31 BIT      @LJA 10192900
*                             STORAGE                                   10193200
WSACIXLS DC    H'10'          LENGTH OF THE CPU-RELATED SAVE AREA  @PRC 10193300
*                             FOR USE BY THE SYSTEM LOCK MANAGER        10193400
*                             IN pages.                                 10193500
         DC    X'A000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @PRC 10193600
*                             STORAGE - length is in pages              10193700
WSACIXLL DC    H'2000'        LENGTH OF THE CPU-RELATED SAVE AREA  @LPA 10193800
*                             FOR USE BY THE HARDWARE INTERFACE         10193900
*                             FUNCTION OF THE SYSTEM LOCK MANAGER       10194000
*                             IN BYTES.                                 10194100
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LPA 10194200
*                             STORAGE                                   10194300
WSACEGR  DC    H'9216'        LENGTH OF THE CPU-RELATED SAVE AREA  @LVC 10194600
*                             FOR USE BY IEAVEGR IN BYTES (8192+1024)   10194900
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LRA 10195200
*                             STORAGE                                   10195500
WSACSCHD DC    H'16'          LENGTH OF CPU WORK/SAVE AREA FOR @YA26693 10196000
*                             SRB SCHEDULER                    @YA26693 10196500
         DC    X'0000'        ACQUIRE WORK/SAVE AREA IN 24 BIT @YA26693 10196800
*                             STORAGE                          @YA26693 10197100
WSACDIRB DC    H'96'          LENGTH OF CPU WORK/SAVE AREA FOR     @LOA 10197200
*                             IEAVDIRB                             @LOA 10197300
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LOA 10197400
*                             STORAGE                              @LOA 10197500
WSACMCH  DC    H'628'         LENGTH OF CPU-RELATED SAVE AREA      @PFA 10197600
*                             FOR MACHINE CHECK HANDLER                 10197700
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31         @PFA 10197800
*                             BIT STORAGE                               10197900
WSACXCF2 DC    H'30000'       LENGTH OF XCF2 WORK AREA IN          @06A 10198000
*                             BYTES                                     10198100
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @06A 10198200
*                             STORAGE                                   10198300
WSACREMD DC    H'1024'        Length of Registration Services      @LYA 10198400
*                             Retrieve Exit Manager Data Storage        10198500
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @LYA 10198600
*                             STORAGE                                   10198700
WSACJOIN DC    H'0144'        Length of CPU work/save area for     @PQA 10198800
*                             IEAVJOIN/IEAVLEAV                         10198900
         DC    X'8000'        ACQUIRE WORK/SAVE AREA IN 31 BIT     @PQA 10199000
*                             STORAGE                                   10199100
WSACVAR8 DC    H'32' -        LENGTH OF REAL ADDRESS CONVERSION    @07A 10199200
*                             ROUTINE(IEAVAR08) WORK AREA.              10199300
         DC    X'8000'        ACQUIRE SAVE AREA IN 31 BIT STORAGE  @07A 10199400
WSACPR   DC    H'1024' -      Length of PRDA work/saveare used by  @MBA 10203600
*                             Pause/Release routines.                   10207800
         DC    X'8000'        ACQUIRE SAVE AREA IN 31 BIT STORAGE  @MBA 10212000
WSACEND  DS    0F   -         True end of table                    @MCA 10216200
         DS    0D   -         Round to dword                       @MCC 10220400
         PRINT OFF                                                      10224600
         IHASCFS ,                                                 @PQA 10226700
         IHASDWA                                                   @LAA 10228800
         IHASCWA                                                   @LVA 10233000
         CSRSIIDF                                                  @08A 10235100
         IHART1WF                                                  @MCA 10237200
         PRINT ON                                                       10241400
         MEND  , -   */                                                 10245600
*%WSAVTL2 : ;                                                           10250000
*                                                                       10262500
*  @LISTPUSH;                                                  /*@H2A*/ 10275000
*  %IF IHALIST='YES' %THEN                                     /*@H2A*/ 10287500
*     %GOTO WSALIST;                                           /*@H2A*/ 10300000
*  @LISTOFF;                                                   /*@H2A*/ 10312500
*  %WSALIST:;                                                  /*@H2A*/ 10325000
*                                                                       10337500
*%IF WSALOCAL='NO'  % THEN                                              10350000
*    %GOTO WSAVT10;                                                     10400000
*                                                                       10450000
*DECLARE                                                                10500000
*  1 WSAL     BASED(ASXBSPSA) BDY(DWORD), /* LOCAL WORK/SAVE            10550000
*                                           AREA VECTOR TABLE        */ 10600000
*   2 WSALCWSA    PTR(31),               /* ADDRESS OF LOW-LEVEL        10650000
*                                           COMMON SAVE AREA            10700000
*                                           (104 BYTES)              */ 10750000
*   2 WSALVALC    PTR(31),               /* ADDRESS OF VALIDITY CHECK   10800000
*                                           SAVE AREA (64 BYTES)     */ 10850000
*   2 WSALRTM2    PTR(31),               /* ADDRESS OF RECOVERY         10900000
*                                           TERMINATION MANAGER (RTM)   10910000
*                                           SAVE AREA (80 BYTES)     */ 10920000
*   2 WSALSDMP    PTR(31),               /* ADDRESS OF SVC DUMP WORK    11000000
*                                           AREA (104 BYTES)         */ 11050000
*   2 WSALABTM    PTR(31),               /* ADDRESS OF ABTERM SAVE      11100000
*                                           AREA (144 BYTES)         */ 11150000
*   2 WSALCIRB    PTR(31),               /* ADDRESS OF CIRB SAVE AREA   11200000
*                                           (80 BYTES)         MDC005*/ 11250000
*   2 WSALS2EE    PTR(31),               /* ADDRESS OF STAGE 2 EXIT     11300000
*                                           EFFECTOR SAVE AREA          11350000
*                                           (80 BYTES)               */ 11400000
*   2 WSALEXIT    PTR(31),               /* ADDRESS OF EXIT (SVC 3)     11450000
*                                           SAVE AREA (160 BYTES)    */ 11500000
*   2 WSALPOST    PTR(31),               /* ADDRESS OF POST SAVE AREA   11550000
*                                           (160 BYTES)                 11583300
*                                           (MDC303)         @Z40EP9A*/ 11616600
*   2 WSALWAIT    PTR(31),               /* ADDRESS OF WAIT SAVE AREA   11650000
*                                           (72 BYTES)               */ 11700000
*   2 WSALSTAT    PTR(31),               /* ADDRESS OF STATUS SAVE      11750000
*                                           AREA  (384 BYTES).          11783300
*                                                                @LMC*/ 11816600
*   2 WSALSTAE    PTR(31),               /* ADDRESS OF STAE SAVE AREA   11850000
*                                           (112 BYTES)      @G860PXH*/ 11875300
*   2 WSALEVNT    PTR(31),               /* ADDRESS OF EVENTS (FAST     11900600
*                                           MULTIPLE WAIT) SAVE AREA    11925900
*                                           (72 BYTES)                  11951200
*                                           (MDC300)         @Z30HP9A*/ 11976500
*   2 WSALRSM     PTR(31),               /* ADDRESS OF REAL STORAGE     12002000
*                                           MANAGEMENT (RSM) SAVE       12004000
*                                           AREA (216 BYTES)            12005200
*                                                                @MDC*/ 12006400
*   2 WSALACHP    PTR(31),               /* ADDRESS OF ASCB CHAP        12007600
*                                           ROUTINE SAVE AREA           12008800
*                                           (72 BYTES)           @L6C*/ 12010900
*   2 WSALCSV     PTR(31),               /* ADDRESS OF CONTENTS         12013000
*                                           SUPERVISOR SAVE AREA        12015100
*                                           (1152 BYTES).        @PDC*/ 12017200
*   2 WSALISEC    PTR(31),               /* ADDRESS OF INTERSECT        12019300
*                                           ROUTINE SAVE AREA           12021400
*                                           (64 BYTES).      @G860PXH*/ 12023500
*   2 WSALSTWA    PTR(31),               /* ADDRESS OF STATUS WORK/SAVE 12025600
*                                           AREA FOR STOP/RESET         12027700
*                                           INTERFACE (56 BYTES).@H2A*/ 12029800
*   2 WSALLSM     PTR(31),               /* ADDRESS OF GPR SAVE AREA    12031900
*                                           USED WHEN CALLING LINKAGE   12034000
*                                           STACK SERVICES (72 BYTES)   12036100
*                                                                @LAA*/ 12038200
*   2 WSALS3EE    PTR(31),               /* ADDRESS OF STAGE III EXIT   12040300
*                                           EFFECTOR REGISTER           12042400
*                                           SAVEAREA (96 BYTES). @LIC*/ 12042700
*   2 WSALJSIO    PTR(31),               /* ADDRESS OF IEAVJSIO WORK/   12043000
*                                           SAVE AREA (1024 BYTES).     12043300
*                                                                @LIA*/ 12043600
*   2 WSALJIOC    PTR(31),               /* ADDRESS OF IEAVJIOC WORK/   12043900
*                                           SAVE AREA (1024 BYTES).     12044200
*                                                                @LIA*/ 12044500
*   2 WSALJSTL    PTR(31),               /* ADDRESS OF IEAVJSTL WORK/   12044800
*                                           SAVE AREA (1024 BYTES).     12045100
*                                                                @LIA*/ 12045400
*   2 WSALXPDA    PTR(31),               /* ADDRESS OF IEAVXPDA WORK/   12045700
*                                           SAVE AREA (40 BYTES).       12046000
*                                                                @LLA*/ 12046300
*   2 WSALEIRB    PTR(31),               /* ADDRESS OF IEAVEIRB WORK/   12046700
*                                           SAVE AREA (256 BYTES).      12047100
*                                                                @LOA*/ 12047500
*   2 WSALEXPM    PTR(31);               /* ADDRESS OF IEAVEXPM WORK/   12047900
*                                           SAVE AREA (256 BYTES).      12048300
*                                                                @LOA*/ 12048700
*%WSAVT10 : ;                                                           12049100
*%IF WSAGLOBL='NO'  % THEN                                              12050000
*    %GOTO WSAVT30;                                                     12100000
*                                                                       12150000
*DECLARE                                                                12200000
*  1 WSAG     BASED(CVTSPSA) BDY(DWORD), /* GLOBAL WORK/SAVE AREA       12250000
*                                           VECTOR TABLE             */ 12300000
*   2 WSAGR000    PTR(31),               /* RESERVED -                  12350000
*                                           (0 BYTES)        @G860PXD*/ 12400000
*   2 WSAGGMFM    PTR(31),               /* RESERVED FOR S/370          12450000
*                                           COMPATIBILITY  (0 BYTES)    12500000
*                                           (MDC301)         @G860PXD*/ 12550000
*   2 WSAGSTSI    PTR(31),               /* STSI information     @08A*/ 12600000
*   2 WSAGR00C    PTR(31),               /* RESERVED             @PJC*/ 12700000
*   2 WSAGR010    PTR(31),               /* RESERVED             @PJC*/ 12750000
*   2 WSAGR014    PTR(31),               /* RESERVED             @PJC*/ 12800000
*   2 WSAGR018    PTR(31),               /* RESERVED.            @DNC*/ 12850000
*   2 WSAGR01C    PTR(31),               /* RESERVED             @PJC*/ 12900000
*   2 WSAGR020    PTR(31),               /* RESERVED                    13550200
*                                                   (MDC318) @G381P9A*/ 13550400
*   2 WSAGR024    PTR(31),               /* RESERVED.            @LHC*/ 13550900
*   2 WSAGR028    PTR(31),               /* RESERVED             @PJC*/ 13551600
*   2 WSAGR02C    PTR(31),               /* RESERVED             @PPC*/ 13552300
*   2 WSAGDCCR    PTR(31),               /* ADDRESS OF WORK/SAVE AREA   13553000
*                                           FOR DISABLED CONSOLE        13553200
*                                           COMMUNICATION (6136 BYTES)  13553400
*                                           (MDC313)             @01C*/ 13553600
*   2 WSAGRESF    PTR(31),               /* ADDRESS OF WORK/SAVE @L1A   13553800
*                                           AREA FOR THE RESTART @L1A   13554000
*                                           FLIH (456 BYTES)     @L1A*/ 13554200
*   2 WSAGR038    PTR(31),               /* RESERVED.            @LHC*/ 13554500
*   2 WSAGTIME    PTR(31),               /* ADDRESS OF TIMER SAVE AREA  13554800
*                                           (128 BYTES)      @G860PXD*/ 13555000
*   2 WSAGTIM2    PTR(31),               /* ADDRESS OF TIMER SLIH WORK  13555200
*                                           AREA (24 BYTES).     @LAA*/ 13555400
*   2 WSAGR044    PTR(31),               /* Reserved.            @07A*/ 13555900
*   2 WSAGSRM1    PTR(31);               /* ADDRESS OF GENERAL REGISTER 13556400
*                                           SAVE AREA FOR SRM -         13556600
*                                           SERIALIZED BY THE SRM LOCK. 13556800
*                                           (72 BYTES)           @P4A*/ 13557000
*%WSAVT30 : ;                                                           13560000
*%IF WSACPU='NO'  % THEN                                                13600000
*    %GOTO WSAVT50;                                                     13650000
*                                                                       13700000
*DECLARE                                                                13750000
*  1 WSAC     BASED(LCCACPUS) BDY(DWORD),/* CPU WORK/SAVE AREA          13800000
*                                           VECTOR TABLE             */ 13850000
*   2 WSACCWSA    PTR(31),               /* ADDRESS OF LOW-LEVEL        13900000
*                                           COMMON SAVE AREA            13950000
*                                           (104 BYTES)              */ 14000000
*   2 WSACGTF     PTR(31),               /* ADDRESS OF GTF SAVE AREA    14050000
*                                           (232 BYTES)                 14078500
*                                           (MDC309)              @DIC*/14107000
*   2 WSACOPTM    PTR(31),               /* ADDRESS OF SYSTEM           14135500
*                                           RESOURCES MANAGER (SRM)     14164000
*                                           SAVE AREA (9168 BYTES)      14192600
*                                                                @MEC*/ 14221200
*   2 WSACTIME    PTR(31),               /* ADDRESS OF TIMER SAVE       14250000
*                                           AREA (96 BYTES)    MDC008*/ 14300000
*   2 WSACACR     PTR(31),               /* ADDRESS OF ALTERNATE CPU    14350000
*                                           RECOVERY (ACR)              14400000
*                                           SAVE AREA (3808 BYTES)      14422800
*                                           (SAVE AREA FOR: HARDWARE    14445600
*                                           AND SOFTWARE INFORMATION,   14468400
*                                           NORMAL STACK,               14491200
*                                           IEAVTRTH SAVE AREA -        14514000
*                                           WSACRTMK)            @MCC*/ 14537000
*   2 WSACRTMK    PTR(31),               /* ADDRESS OF RECOVERY         14560000
*                                           TERMINATION MANAGER         14570000
*                                           MACHINE CHECK HANDLER       14580000
*                                           (RTM/MACHK) SAVE AREA (360  14602000
*                                           BYTES) (MDC317)      @MCC*/ 14624000
*   2 WSACIOS     PTR(31),               /* ADDRESS OF IOS SAVE AREA    14646000
*                                           (80 BYTES)       @G860PXD*/ 14668000
*   2 WSACEDS0    PTR(31),               /* ADDRESS OF SCHEDULE SAVE    14690000
*                                           AREA (80 BYTES)             14712000
*                                                  (MDC317)  @G381P9A*/ 14734000
*     3 WSACESC0  PTR(31),               /* SCHEDULE SAVE AREA ADDR     14756000
*                                                            @G860PXB*/ 14778000
*   2 WSACMF1     PTR(31),               /* ADDRESS OF MEASUREMENT      14800000
*                                           FACILITY 1 SAVE AREA        14850000
*                                           (144 BYTES)        MDC019*/ 14900000
*   2 WSACABTM    PTR(31),               /* ADDRESS OF ABTERM SAVE      14901000
*                                           AREA (136 BYTES)   MDC006*/ 14901700
*   2 WSACDIVS    PTR(31),               /* ADDRESS OF DATA IN VIRTUAL  14902500
*                                           (DIV) WORK/SAVE AREA        14903000
*                                           (8192 BYTES)         @D4A*/ 14903500
*   2 WSACLDWT    PTR(31),               /* ADDRESS OF WORK/SAVE AREA   14904000
*                                           FOR STATUS SAVING BY        14904500
*                                           LOADWAIT/RESTART PROCESSING 14905000
*                                           (640 BYTES).         @MCC*/ 14905500
*   2 WSACSCPS    PTR(31),               /* ADDRESS OF SUPERVISOR       14906000
*                                           CONTROL PSEUDO SDWA.        14906500
*                                           INITIALIZED BY THE          14907000
*                                           SUPERVISOR ANALYSIS ROUTER  14907500
*                                           LOCK REPAIR, AND GLOBAL     14908000
*                                           RCVY. (1384 BYTES).  @LSC*/ 14908500
*   2 WSACVSM     PTR(31),               /* ADDRESS OF VSM GLOBAL       14909000
*                                           BRANCH ENTRY SAVE AREA      14909500
*                                           (528 BYTES)          @PPC*/ 14910000
*   2 WSACASMD    PTR(31),               /* ADDRESS OF AUXILIARY        14910500
*                                           STORAGE MANAGEMENT (ASM)    14911000
*                                           DISABLED INTERRUPT EXIT     14911500
*                                           (DIE) WORK/SAVE AREA        14912000
*                                           (1024 BYTES)                14912500
*                                           (MDC304)             @D2C*/ 14913000
*   2 WSACASMS    PTR(31),               /* ADDRESS OF AUXILIARY        14913500
*                                           STORAGE MANAGEMENT (ASM)    14914000
*                                           SRB DRIVEN I/O ROUTINES     14914500
*                                           WORK/SAVE AREA (1024        14915000
*                                           BYTES)  (MDC305)     @L2C*/ 14915500
*   2 WSACRSM     PTR(31),               /* ADDRESS OF REAL STORAGE     14916000
*                                           MANAGER (RSM) WORK/SAVE     14916500
*                                           AREA (48 PAGES)      @MDC*/ 14917000
*   2 WSACDCCR    PTR(31),               /* ADDRESS OF DISABLED         14917500
*                                           CONSOLE COMMUNICATION       14918000
*                                           WORK/SAVE AREA (100         14918500
*                                           BYTES)  (MDC310)     @PMC*/ 14919000
*   2 WSACSLIP    PTR(31),               /* ADDRESS OF SLIP/PER         14919500
*                                           WORK/SAVE AREA (136 BYTES)  14920000
*                                                   (MDC317) @G381P9A*/ 14920500
*   2 WSACEVRR    PTR(31),               /* ADDRESS OF ASVT AND AFT     14921000
*                                           RECONSTRUCT WORK/SAVE       14921500
*                                           AREA (8  BYTES).            14922000
*                                                   (MDC317)     @PLC*/ 14922500
*   2 WSACRESF    PTR(31),               /* ADDRESS OF RESTART FLIH     14923000
*                                           WORK/SAVE AREA (1536 BYTES) 14923500
*                                                                @PFC*/ 14924000
*   2 WSACMFA     PTR(31),               /* ADDRESS OF MALFUNCTION      14924500
*                                           ALERT WORK/SAVE AREA        14925000
*                                           (256 BYTES).         @D1A*/ 14925500
*   2 WSACSCWA    PTR(31),               /* ADDRESS OF SUPERVISOR       14926500
*                                           CONTROL WORK/SAVE AREA      14927000
*                                           (12288 BYTES).       @LVC*/ 14927500
*   2 WSACTRCE    PTR(31),               /* ADDRESS OF SYSTEM TRACE     14928000
*                                           SERVICE ROUTINES WORK/SAVE  14928500
*                                           AREA (512 BYTES) @G860PXD*/ 14929000
*   2 WSACTAIM    PTR(31),               /* ADDRESS OF RECURSIVE ACR    14929500
*                                           MESSAGE WORK AREA           14930000
*                                           (168 BYTES)      @G860PXD*/ 14930500
*   2 WSACRTMW    PTR(31),               /* GENERAL RTM WORK/SAVE AREA  14931000
*                                           (3272 BYTES).        @L9C*/ 14931500
*   2 WSACSTKA    PTR(31),               /* ABOVE FRR STACK WORK AREA   14932000
*                                                                @LSC*/ 14932500
*   2 WSACSTKB    PTR(31),               /* BELOW FRR STACK WORK AREA   14933000
*                                                                @LSC*/ 14933500
*   2 WSACASMR    PTR(31),               /* SAVEAREA FOR ASM RECOVERY   14934000
*                                           ROUTINES (1024 BYTES)    */ 14934500
*   2 WSACSCFS    PTR(31),               /* ADDRESS OF SUPERVISOR       14935000
*                                           CONTROL FLIH SAVEAREA       14935500
*                                           (1080 BYTES)         @MCC*/ 14936000
*   2 WSACSTPL    PTR(31),               /* ADDRESS OF SUPERVISOR       14936500
*                                           CONTROL'S SYSTEM TRACE      14937000
*                                           PARAMETER LIST FOR DISABLED 14937500
*                                           CALLERS (24 BYTES).  @LAA*/ 14938000
*   2 WSACDESA    PTR(31),               /* ADDRESS OF DIAGNOSTIC EXIT  14938500
*                                           FACILITY SAVEAREA FOR       14939000
*                                           DISABLED CALLERS            14939500
*                                           (72 BYTES).          @LAA*/ 14940000
*   2 WSACPAWA    PTR(31),               /* ADDRESS OF THE PC/AUTH WORK 14940500
*                                           AREA (3448 BYTES).   @LAA*/ 14941000
*   2 WSACSYMR    PTR(31),               /* ADDRESS OF THE SYMREC WORK  14941500
*                                           SAVEAREA (3000 BYTES).      14942000
*                                                                @LAA*/ 14942500
*   2 WSACXCF     PTR(31),               /* ADDRESS OF THE XCF WORK     14942700
*                                           AREA (30000 BYTES).         14942900
*                                                                @LFC*/ 14943100
*   2 WSACECLT    PTR(31),               /* ADDRESS OF THE CURRENT      14943300
*                                           LOCKS HELD TABLE EXTENSION  14943500
*                                           (128 BYTES).         @LCA*/ 14943700
*   2 WSACTWA     PTR(31),               /* ADDRESS OF THE ETR/MCH WORK 14943900
*                                           SAVE AREA (8192 BYTES).     14944100
*                                                                @05C*/ 14944300
*   2 WSACACR2    PTR(31),               /* ADDRESS OF THE ALTERNATE    14944500
*                                           CPU RECOVERY (ACR) WORK/    14944700
*                                           SAVE AREA (1024 BYTES)      14944900
*                                                                @MAC*/ 14945100
*   2 WSACBWTO    PTR(31),               /* ADDRESS OF WORK/SAVE AREA   14945300
*                                           FOR SYNCHRONOUS BRANCH-     14945500
*                                           ENTRY WTO (5008 BYTES).     14945700
*                                                                @DMC*/ 14945900
*   2 WSACTCR1    PTR(31),               /* ADDRESS OF WORK/SAVE AREA   14946100
*                                           FOR ACR RECOVERY            14946300
*                                           (256 BYTES).         @LJA*/ 14946500
*   2 WSACIXLS    PTR(31),               /* ADDRESS OF THE CPU-RELATED  14946700
*                                           SAVE AREA FOR USE BY THE    14946900
*                                           SYSTEM LOCK MANAGER.        14947100
*                                           (10 pages)           @LPA*/ 14947300
*   2 WSACIXLL    PTR(31),               /* ADDRESS OF THE CPU-RELATED  14947500
*                                           SAVE AREA FOR USE BY THE    14947700
*                                           HARDWARE INTERFACE FUNCTION 14947900
*                                           OF THE SYSTEM LOCK MANAGER. 14948100
*                                           (2000 BYTES)         @LPA*/ 14948300
*   2 WSACEGR     PTR(31),               /* Address of area for         14948400
*                                           IEAVEGR (9216 bytes) @LVC*/ 14948500
*   2 WSACSCHD    PTR(31),               /* ADDRESS OF CPU    @YA26693  14948700
*                                           WORK/SAVE AREA FOR SRB      14948900
*                                           SCHEDULER (16 BYTES)     */ 14949100
*   2 WSACDIRB    PTR(31),               /* ADDRESS OF CPU WORK/SAVE    14949200
*                                            AREA FOR IEAVDIRBR         14949300
*                                            (96 BYTES)           @PFC*/14949400
*   2 WSACMCH     PTR(31),               /* ADDRESS OF CPU WORK/SAVE    14949500
*                                           AREA FOR MACHINE CHECK      14949600
*                                           HANDLER. (628 BYTES) @PFA*/ 14949700
*   2 WSACXCF2    PTR(31),               /* ADDRESS OF THE XCF WORK     14959700
*                                           AREA2 (30000 BYTES).        14969700
*                                                                @06A*/ 14979700
*   2 WSACREMD    PTR(31),               /* Address of Registration     14981700
*                                           Services Retrieve Exit      14983700
*                                           Manager Data Work Area      14985700
*                                           (1024) Bytes         @LYA*/ 14987700
*   2 WSACJOIN   PTR(31),                /* Address of CPU Work/Save    14988200
*                                           Area for IEAVJOIN/IEAVLEAV  14988700
*                                           (144 bytes).         @PQA*/ 14989200
*   2 WSACVAR8    PTR(31),               /* ADDRESS OF REAL ADDRESS     14990700
*                                           CONVERSION ROUTINE          14992200
*                                           (IEAVAR08) ROUTINE WORK     14993700
*                                           AREA.(32 BYTES)      @07A*/ 14995200
*   2 WSACPR      PTR(31)                /* Address of PRDA work/       14995500
*                                           savearea for Pause/Release  14995800
*                                           routines. 1024 bytes.       14996100
*                                                                @MBA*/ 14996400
*     ;                                                                 14996700
*%WSAVT50 : ;                                                           14998200
*  @LISTPOP;                                                   /*@H2A*/ 15000000
*%IF WSAMAP~='YES'  % THEN                                              15050000
*    %GOTO WSAVT60;                                                     15100000
*                                                                       15150000
*DECLARE                                                                15200000
* 1 WSAVTMAP BASED,                      /* MAPPING OF WSAVT TEMPLATE   15250000
*                                                            @G860PXD*/ 15300000
*   3 WSAENTS FIXED(31),                 /* NUMBER OF SAVE AREAS TO     15350000
*                                           BE OBTAINED      @G860PXD*/ 15400000
*   3 WSAINFO(*),                        /* INFORMATION ABOUT SAVE AREA 15450000
*                                           SIZE/LOCATION    @G860PXD*/ 15500000
*     5  WSASIZE FIXED(16),              /* SIZE IN BYTES (OR PAGES) OF 15550000
*                                           EACH SAVE AREA.          */ 15600000
*     5  WSALOC BIT(16),                 /* LOCATION OF REQUIRED        15650000
*                                           SAVE AREA        @G860PXD*/ 15700000
*        7  WSAXTND  BIT(1),             /* SPECIFIES WHERE STORAGE     15750000
*                                           IS TO BE ACQUIRED. IF '1'B, 15800000
*                                           STORAGE IS TO BE ACQUIRED   15850000
*                                           IN THE EXTENDED AREA, ELSE  15900000
*                                           IT IS ACQUIRED IN 24 BIT    15950000
*                                           STORAGE          @G860PXD*/ 16000000
*        7  WSAALIGN BIT(1),             /* SPECIFIES THAT STORAGE IS   16025000
*                                           TO BE CACHE ALIGNED. @DEA*/ 16050000
*        7  WSASTOR  BIT(1),             /* SPECIFIES THAT WSASIZE IS   16057500
*                                           THE NUMBER OF PAGES TO      16065000
*                                           GETMAIN INSTEAD OF BYTES.   16072500
*                                                                @P6A*/ 16080000
*        7  *        BIT(13);            /* RESERVED             @P6C*/ 16087500
*%WSAVT60 : ;                                                           16100000
