*/*A-000000-999999                                           @Z40WPWK*/ 00050000
*/********************************************************************/ 00100000
*/*                                                                  */ 00150000
*/*  NAME: ILRASMHD                                                  */ 00200000
*/*                                                                  */ 00250000
*/*                                                                  */ 00350000
*/* START OF SPECIFICATIONS ******************************************/ 00375000
*/*                                                                  */ 00400000
*/*01* PROPRIETARY_STATEMENT:                                        */ 00425000
*/*                                                                  */ 00450000
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */ 00500000
*/*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     */ 00550000
*/*  5647-A01 (C) COPYRIGHT IBM CORP. 1981, 2000                     */ 00600000
*/*                                                                  */ 00800000
*/*  STATUS = HBB7703                                                */ 00850000
*/*                                                                  */ 00900000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00950000
*/*                                                                  */ 01000000
*/*01* EXTERNAL CLASSIFICATION: NOTPI                                */ 01046300
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01092600
*/*                                                                  */ 01092700
*/*01* DESCRIPTIVE NAME: Auxiliary Storage Management Header         */ 01092800
*/*01*  ACRONYM: ASMHD                                               */ 01092900
*/*                                                                  */ 01093000
*/*01* MACRO NAME: ILRASMHD                                          */ 01093100
*/*01* COMPONENT:  Auxiliary Storage Manager (SC1CW)                 */ 01093200
*/*                                                                  */ 01093300
*/*01* DSECT NAME: ASMHD                                             */ 01093400
*/*                                                                  */ 01093500
*/*01* EYE-CATCHER: None                                             */ 01093600
*/*01*  OFFSET: n/a                                                  */ 01093700
*/*01*  LENGTH: n/a                                                  */ 01093800
*/*                                                                  */ 01093900
*/*01* STORAGE ATTRIBUTES:                                           */ 01094000
*/*02*  VIRTUAL STORAGE: YES                                         */ 01094100
*/*02*  SUBPOOL: 245                                                 */ 01094200
*/*02*  KEY:  0                                                      */ 01094300
*/*02*  RESIDENCY:  Above 16 Megabytes virtual                       */ 01094400
*/*02*  DATA SPACE: NO                                               */ 01094500
*/*                                                                  */ 01094600
*/*01* SIZE: 32 Bytes                                                */ 01094700
*/*                                                                  */ 01094800
*/*01* CREATED BY: ILRASHCD                                          */ 01094900
*/*                                                                  */ 01095000
*/*01* POINTED TO BY: ASCBASM field of ASCB data area                */ 01095100
*/*                                                                  */ 01095200
*/*01* SERIALIZATION:                                                */ 01095300
*/*                                                                  */ 01095400
*/*  The ASMGL lock is used to serialize: I/O control flags, swap    */ 01095500
*/*  and page counters, and the swap queues.  The ASM class lock of  */ 01095600
*/*  the owning address space is used to serialize the VIO control   */ 01095700
*/*  flags and LGE queue base pointer.                               */ 01095800
*/*                                                                  */ 01095900
*/*                                                                  */ 01096000
*/*01* FUNCTION:                                                     */ 01096100
*/*                                                                  */ 01096200
*/*  ASMHD is used by ASM to manage paging I/O and swap              */ 01096300
*/*  operations for each private address space.  ASM also            */ 01096400
*/*  uses ASMHD to control all operations for VIO data               */ 01096500
*/*  sets owned by a private address space.                          */ 01096600
*/*                                                                  */ 01096700
*/*                                                                  */ 01096800
*/*01* METHOD OF ACCESS:                                             */ 01096900
*/*                                                                  */ 01097000
*/*  PL/AS - DECLARE ASMHDPTR PTR                                    */ 01097100
*/*          % INCLUDE SYSLIB(ILRASMHD)                              */ 01097200
*/*                                                                  */ 01097300
*/*          The length of the ASMHD may be obtained by              */ 01097400
*/*          referencing the macro variable ASHLEN.                  */ 01097500
*/*                                                                  */ 01097600
*/* END OF SPECIFICATIONS ********************************************/ 01097700
*/*                                                                  */ 01100000
*/*  NOTES:  The ASMHD is used by I/O control to manage paging I/O   */ 01150000
*/*          and swap operations for each private address space. VIO */ 01200000
*/*          control also uses the ASMHD to control all operations   */ 01250000
*/*          for VIO data sets owned by a private address space. An  */ 01300000
*/*          ASMHD exists for each active address space. It is built */ 01350000
*/*          in SQA and referenced via a pointer in the ASCB         */ 01400000
*/*          (ASCBASM). The field names are prefixed with ASH        */ 01450000
*/*          because the ASM prefix is already used for the ASMVT.   */ 01500000
*/*                                                                  */ 01550000
*/*                                                                  */ 02000000
*/* CHANGE-ACTIVITY:                                                 */ 02050000
*/*                                                                  */ 02100000
*/*    APARs  OZ15320                                                */ 02150000
*/*           OZ17337                                                */ 02200000
*/*    $L2=EXTREAL,JBB1326,801001,PD2T: Support for extended real    */ 02250000
*/*    OS/VS2 HBB2102 - Removal of CSECT                     @G860P2W*/ 02300000
*/*    PTM  PCC0224                                          @ZCC0224*/ 02350000
*/*    $D1=59,JBB2110,821015,PDFQ: Remove ASHIOCNT from the          */ 02400000
*/*                                mainline ASM path                 */ 02450000
*/*    $L3=ASMBKSLT,JBB2220,840806,PDFQ: Backing slots removal       */ 02500000
*/*    $01=OY05989,HBB3310,871104,PDFR: Address space termination    */ 02516600
*/*                                flag ASHTERMR                     */ 02533200
*/*    $P1=PC41538,HBB3310,871207,PDFR: NONVIO slot counts -         */ 02538800
*/*                                supercedes APAR OY05989           */ 02544400
*/*    $P2=PC42320,HBB3310,880309,PDFR: Change ASHSWPCT to FIXED(31) */ 02547200
*/*    $L4=LJOBM,JBB3313,890310,PD2W: Large Job Management -         */ 02548100
*/*                                 SRM performance counts           */ 02549000
*/*    $P3=PXD0796,HBB7703,000124,PD2C: Prolog updates               */ 02549500
*/*                                                                  */ 02550000
*/********************************************************************/ 02600000
*           %GOTO   ASHPLAS;           /* Bilingual header              02650000
            MACRO                                                       02700000
            ILRASMHD    ,                                     @ZCC0224  02750000
*                                                                4@L2D  02800000
ASMHD       DSECT       , ASMHDPTR                                      02850000
*                                                                1@L2D  02900000
            IEZBITS     ,                                               02950000
ASHFLAG1    DS          B             I/O control flags                 03000000
ASHSWPOT    EQU         BIT0          Swap-out flag.                    03050000
*                                     1 = Swap-out operation in         03100000
*                                     progress,                         03150000
*                                     0 = No swap-out in progress       03200000
ASHCAPER    EQU         BIT1          Swap capture queue error.         03250000
*                                     1 = One or more swap-out capture  03300000
*                                     AIAs on swap capture has suffered 03350000
*                                     an I/O error,                     03400000
*                                     0 = All AIAs on swap capture      03450000
*                                     queue have completed successfully 03500000
ASHPERME    EQU         BIT2          Permanent software error flag.    03550000
*                                     1 = One or more swap-out AIAs     03600000
*                                     on the swap capture queue has     03650000
*                                     a non-restartable soft error,     03700000
*                                     0 = All AIAs on the swap          03750000
*                                     capture queue have no logical     03800000
*                                     errors                            03850000
ASHRSV2     EQU         BIT3          Reserved                    @P1C  03900000
ASHRSV3     EQU         BIT4          Reserved                          03950000
ASHRSV4     EQU         BIT5          Reserved                          04000000
ASHRSV5     EQU         BIT6          Reserved                          04050000
ASHRSV6     EQU         BIT7          Reserved                          04100000
ASHFLAG2    DS          B             VIO control flags                 04150000
ASHSCHED    EQU         BIT0          SRB controller scheduled flag.    04200000
*                                     1 = SRB controller has been       04250000
*                                     scheduled, but not dispatched     04300000
*                                     SRB for address space not         04350000
*                                     available,                        04400000
*                                     0 = SRB for address space         04450000
*                                     available                         04500000
ASHRSV13    EQU         BIT1          Reserved                          04550000
ASHRSV7     EQU         BIT2          Reserved                          04600000
ASHRSV8     EQU         BIT3          Reserved                          04650000
ASHRSV9     EQU         BIT4          Reserved                          04700000
ASHRSV10    EQU         BIT5          Reserved                          04750000
ASHRSV11    EQU         BIT6          Reserved                          04800000
ASHRSV12    EQU         BIT7          Reserved                          04850000
ASHRSV15    DS          H             Reserved                   @P2C   04900000
ASHSWPCT    DS          F             Count of started but not complete 04950000
*                                     LSQA swap-out AIAs         @P2C   05000000
ASHRSV14    DS          F             Reserved                   @D1C   05050000
ASHSWAPQ    DS          A             Swap queue for AIAs. This queue   05100000
*                                     is a hold queue for LSQA AIAs     05150000
*                                     during swap-out processing of     05200000
*                                     non-LSQA I/O.                     05250000
ASHCAPQ     DS          A             Swap capture queue used to        05300000
*                                     collect I/O complete AIAs         05350000
*                                     during LSQA swap-out              05400000
*                                     processing                        05450000
ASHLOCK     DS          F             Lock word for ASM class lock,     05500000
*                                     used by VIO control processing    05550000
ASHVSRBP    DS          A             Address of SRB used by VIO        05600000
*                                     control to dispatch the SRB       05650000
*                                     controller. This pointer is zero  05700000
*                                     if no VIO data sets have ever     05750000
*                                     been used by the address space.   05800000
*                                     Once created, the SRB is not      05850000
*                                     freed until address space         05900000
*                                     termination                       05950000
ASHLGEQ     DS          A             Address of first LGE in queue     06000000
*                                     of LGEs for VIO data sets         06050000
ASHNSWRR    DS          F             Count of non-swap write request   06053800
*                                     AIAs received by I/O control      06057600
*                                     for this address space.           06061400
*                                     This does not include swap that   06065200
*                                     spills to paging data sets        06069000
*                                     or migration I/O.           @L4A  06072800
ASHNSWRC    DS          F             Count of non-swap write request   06076600
*                                     AIAs completed and returned to    06080400
*                                     RSM for this address space.       06084200
*                                     This does not include swap that   06088000
*                                     spills to paging data sets        06091800
*                                     or migration I/O.           @L4A  06095600
*           DS          0D                                        @L2C  06100000
ASHLEN      EQU         *-ASMHD                                   @L2C  06150000
            MEND                                                        06200000
*           */                                                          06250000
*/*                                                             4@L2D*/ 06300000
*%ASHPLAS:;                          /* PL/AS compile time target    */ 06350000
*DECLARE                                                                06400000
*  1 ASMHD BASED(ASMHDPTR) BDY(WORD), /* ASM Header                  */ 06450000
*/*                                                             5@L2D*/ 06500000
*    4 ASHFLAG1 BIT(8),               /* I/O control flags           */ 06550000
*      6 ASHSWPOT BIT(1),             /* Swap-out flag.                 06600000
*                                        1 = Swap-out operation in      06650000
*                                        progress,                      06700000
*                                        0 = No swap-out in progress */ 06750000
*      6 ASHCAPER BIT(1),             /* Swap capture queue error.      06800000
*                                        1 = One or more swap-out AIAs  06850000
*                                        on swap capture queue has      06900000
*                                        suffered an I/O error,         06950000
*                                        0 = All AIAs on swap capture   07000000
*                                        queue have completed           07050000
*                                        successfully                */ 07100000
*      6 ASHPERME BIT(1),             /* Permanent software error flag. 07150000
*                                        1 = One or more swap-out AIAs  07200000
*                                        on the swap capture queue has  07250000
*                                        a non-restartable soft error,  07300000
*                                        0 = All AIAs on the swap       07350000
*                                        capture queue have no logical  07400000
*                                        errors                      */ 07450000
*      6 ASHRSV2 BIT(1),              /* Reserved                @P1C*/ 07500000
*      6 ASHRSV3 BIT(1),              /* Reserved                    */ 07550000
*      6 ASHRSV4 BIT(1),              /* Reserved                    */ 07600000
*      6 ASHRSV5 BIT(1),              /* Reserved                    */ 07650000
*      6 ASHRSV6 BIT(1),              /* Reserved                    */ 07700000
*    4 ASHFLAG2 BIT(8),               /* VIO control flags           */ 07750000
*      6 ASHSCHED BIT(1),             /* SRB controller scheduled flag. 07800000
*                                        1 = SRB controller has been    07850000
*                                        scheduled, but not dispatched  07900000
*                                        SRB for address space not      07950000
*                                        available,                     08000000
*                                        0 = SRB for address space      08050000
*                                        available                   */ 08100000
*      6 ASHRSV13 BIT(1),             /* Reserved                    */ 08150000
*      6 ASHRSV7 BIT(1),              /* Reserved                    */ 08200000
*      6 ASHRSV8 BIT(1),              /* Reserved                    */ 08250000
*      6 ASHRSV9 BIT(1),              /* Reserved                    */ 08300000
*      6 ASHRSV10 BIT(1),             /* Reserved                    */ 08350000
*      6 ASHRSV11 BIT(1),             /* Reserved                    */ 08400000
*      6 ASHRSV12 BIT(1),             /* Reserved                    */ 08450000
*    4 ASHRSV15 FIXED(15),            /* Reserved                @P2C*/ 08500000
*    4 ASHSWPCT FIXED(31),            /* Count of started/not complete  08550000
*                                        LSQA swap-out AIAs      @P2C*/ 08600000
*    4 ASHRSV14 FIXED(31),            /* Reserved                @D1C*/ 08650000
*    4 ASHSWAPQ PTR(31),              /* Swap queue for AIAs, this      08700000
*                                        queue is a hold queue for      08750000
*                                        LSQA AIAs during swap-out      08800000
*                                        processing of non-LSQA I/O  */ 08850000
*    4 ASHCAPQ PTR(31),               /* Swap capture queue used to     08900000
*                                        collect I/O complete AIAs      08950000
*                                        during LSQA swap-out           09000000
*                                        processing                  */ 09050000
*    4 ASHLOCK FIXED(31),             /* Lock word for ASM class lock,  09100000
*                                        used by VIO control            09150000
*                                        processing                  */ 09200000
*    4 ASHVSRBP PTR(31),              /* Address of SRB used by VIO     09250000
*                                        control to dispatch the SRB    09300000
*                                        controller. This pointer is    09350000
*                                        zero if no VIO data sets have  09400000
*                                        ever been used by the address  09450000
*                                        space. Once created, the SRB   09500000
*                                        is not freed until address     09550000
*                                        space termination.          */ 09600000
*    4 ASHLGEQ PTR(31),               /* Address of first LGE in queue  09610000
*                                     of LGEs for VIO data sets  @L4C*/ 09620000
*    4 ASHNSWRR FIXED(32),           /* Count of non-swap write request 09630000
*                                     AIAs received by I/O control      09640000
*                                     for this address space.           09650000
*                                     This does not include swap that   09660000
*                                     spills to paging data sets        09670000
*                                     or migration I/O.         @L4A*/  09680000
*    4 ASHNSWRC FIXED(32);           /* Count of non-swap write request 09690000
*                                     AIAs completed and returned to    09700000
*                                     RSM for this address space.       09710000
*                                     This does not include swap that   09720000
*                                     spills to paging data sets        09730000
*                                     or migration I/O.         @L4A*/  09740000
*    %ASHLEN = 'LENGTH(ASMHD)';       /* Obtain length of ASMHD      */ 09750000
