* /* MACMEAN IORB means Input/Output Request Block                   */ 00050000
* /* MACCOMP Y-4SC1CW/PZD81                                          */ 00100000
* /* MACSTAT Y-474240/415301                                         */ 00150000
*/*A-000000-999999                                           @Z40APWA*/ 00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/*  NAME:  ILRIORB                                                  */ 00310000
*/*                                                                  */ 00320000
*/* START OF SPECIFICATIONS ******************************************/ 00330000
*/*                                                                  */ 00340000
*/*01* PROPRIETARY_STATEMENT:                                        */ 00365000
*/*                                                                  */ 00390000
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */ 00440000
*/*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     */ 00490000
*/*  5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                     */ 00540000
*/*                                                                  */ 00600000
*/*  STATUS = HBB7703                                                */ 00650000
*/*                                                                  */ 00860000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00870000
*/*                                                                  */ 00880000
*/*01* EXTERNAL CLASSIFICATION: NOTPI                                */ 00886600
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00893200
*/*                                                                  */ 00900000
*/*01* DESCRIPTIVE NAME: Input/Output Request Block                  */ 00902100
*/*01*  ACRONYM: IORB                                                */ 00904200
*/*                                                                  */ 00906300
*/*01* MACRO NAME: ILRIORB                                           */ 00908400
*/*01* COMPONENT:  Auxiliary Storage Manager (SC1CW)                 */ 00910500
*/*                                                                  */ 00912600
*/*01* DSECT NAME: IORB                                              */ 00914700
*/*                                                                  */ 00916800
*/*01* EYE-CATCHER: None                                             */ 00918900
*/*01*  OFFSET: n/a                                                  */ 00921000
*/*01*  LENGTH: n/a                                                  */ 00923100
*/*                                                                  */ 00925200
*/*01* STORAGE ATTRIBUTES:                                           */ 00927300
*/*02*  VIRTUAL STORAGE: YES                                         */ 00929400
*/*02*  SUBPOOL: 245                                                 */ 00931500
*/*02*  KEY:  0                                                      */ 00933600
*/*02*  RESIDENCY: Above 16 Megabytes virtual                        */ 00935700
*/*02*  DATA SPACE: NO                                               */ 00937800
*/*                                                                  */ 00939900
*/*01* SIZE: 56 Bytes                                                */ 00942000
*/*                                                                  */ 00944100
*/*01* CREATED BY: ILROPS00                                          */ 00946200
*/*                                                                  */ 00948300
*/*01* POINTED TO BY: PAREIORB field of the PARTE data area          */ 00950400
*/*                   SREIORB field of the SARTE data area           */ 00952500
*/*                   IORIORB field of the IORB data area            */ 00954600
*/*                   PCCWIORB field of the PCCW data area           */ 00956700
*/*                                                                  */ 00958800
*/*01* SERIALIZATION: The IORB is serialized via the in-use flag,    */ 00960900
*/*                   IORFUSE, which is "on" when the IORB is in use.*/ 00963000
*/*                                                                  */ 00965100
*/*                                                                  */ 00967200
*/*01* FUNCTION: Used by ASM to track I/O requests. It contains a    */ 00969300
*/*              pointer to a save area for IOS to use, as well as   */ 00971400
*/*              pointers to other control blocks.                   */ 00973500
*/*                                                                  */ 00975600
*/*                                                                  */ 00977700
*/*01* METHOD OF ACCESS:                                             */ 00979800
*/*                                                                  */ 00981900
*/*         BAL   - DSECT=NO  should be specified on the macro call  */ 00984000
*/*                 to avoid creating a DSECT. A using on IORB will  */ 00986100
*/*                 establish addressibility for all symbols.        */ 00988200
*/*         PL/AS - DCL IORBPTR PTR                                  */ 00990300
*/*                                                                  */ 00992400
*/* END OF SPECIFICATIONS ********************************************/ 00994500
*/*                                                                  */ 01000000
*/*  NOTES:  This mapping macro describes the control block passed   */ 01050000
*/*          to the I/O Supervisor by Auxiliary Storage Manager. It  */ 01100000
*/*          contains pointers to other control blocks, a pointer to */ 01150000
*/*          an eighteen word save area, and flags for the I/O       */ 01200000
*/*          Supervisor's use.                                       */ 01250000
*/*                                                                  */ 01300000
*/*          The IORB is used in conjunction with an IOSB and an SRB */ 01350000
*/*          for I/O purposes in place of the IOB used by other IOS  */ 01400000
*/*          drivers. The IORB points to the IOSB, which points to   */ 01450000
*/*          the SRB.                                                */ 01500000
*/*                                                                  */ 01550000
*/*                                                                  */ 01900000
*/*  CHANGE-ACTIVITY:   PTM   VS48518                                */ 01950000
*/*                     APARS OZ15320                                */ 02000000
*/*                           OZ17337                                */ 02050000
*/*    $L1=SECP,JBB1326,801001,PDHP: SECP support                    */ 02100000
*/*    $01=OZ81649,JBB2133,841008,PDC7: Move IORRQSZ to end of IORB  */ 02150000
*/*    $02=OZ91942,JBB2220,860305,PDFR: Reship of OZ81649            */ 02175000
*/*    $P1=PXD0796,HBB7703,000125,PD2C: Prolog updates               */ 02187500
*/*                                                                  */ 02200000
*/********************************************************************/ 02250000
*          %GOTO   IORBPLAS;         /* Bilingual header                02300000
           MACRO                                                        02350000
           ILRIORB    &DUMMY,&DSECT=YES                                 02400000
           AIF        ('&DSECT' EQ 'YES').IORB01                        02450000
IORB       DS         0D             IORB control block                 02500000
           AGO        .IORB02        Call for bit definition            02550000
.IORB01    ANOP                                                         02600000
IORB       DSECT      , IORBPTR                                         02650000
.IORB02    SPACE      2                                                 02700000
           IEZBITS    ,                                                 02750000
IORID      DS         C              IORB identifier X'88'              02800000
IORNUM     DS         X              Number of IORBs for this           02850000
*                                    page data set                      02900000
IORRSVD    DS         X              Reserved                    @01C   02950000
IORFLGS    DS         B              Internal flags                     03000000
IORFUSE    EQU        BIT0           X'80' = IORB in use                03050000
IORFRPS    EQU        BIT1           X'40' = RPS device                 03100000
IORSWAP    EQU        BIT4           Swap data set flag.                03150000
*                                    1 = IORB for swap data set,        03200000
*                                    0 = IORB for page data set         03250000
IORAPND    EQU        BIT5           Appendage flags                    03300000
IORFDI     EQU        BIT5           X'04' = DIE completed              03350000
IORFNE     EQU        BIT6           X'02' = Normal end completed       03400000
IORFAE     EQU        BIT7           X'01' = Abnormal end completed     03450000
IORIORB    DS         A              Pointer to next IORB               03500000
IORPCCW    DS         A              Pointer to first PCCW              03550000
IORSCCW    EQU        IORPCCW        Pointer to first SCCW              03600000
IORIOSB    DS         A              IOSB address                       03650000
IORSAVE    DS         A              Pointer to 18-word save area       03700000
IORERR     DS         A              Address of PCCW in error           03750000
IORTSMP    DS         CL8            TOD clock timestamp           @L1C 03800000
IORPARTE   DS         A              Pointer to PARTE                   03850000
IORTREQ    DS         F              Number of pages transferred        03900000
*                                    using this IORB           @G50FP4U 03950000
IORSION    DS         F              Number of STARTIOs and resumes     04000000
*                                    issued using this IORB        @L1C 04050000
IORNOP     DS         A              Pointer to the last CCW in the     04100000
*                                    channel program               @L1A 04150000
IORSRBP    DS         A              Pointer to the SRB used by the     04200000
*                                    resume service                @L1A 04250000
IORRQSZ    DS         F              Number of AIAs outstanding on      04300000
*                                    this IORB                     @01C 04350000
           MEND                                                         04400000
*          */                                                           04450000
*%IORBPLAS:;                         /* PL/AS compile time target    */ 04500000
*       DCL 1 IORB BASED(IORBPTR) CHAR(56) BDY(DWORD), /* I/O           04550000
*                                       Request Block                */ 04600000
*             2 IORID  CHAR(1),      /* IORB identifier X'88'        */ 04650000
*             2 IORNUM FIXED(8),     /* Number of IORBs for             04700000
*                                       this page data set           */ 04750000
*             2 IORRSVD FIXED(8),    /* Reserved                 @01C*/ 04800000
*             2 IORFLGS BIT(8),      /* Internal flags               */ 04850000
*               3 IORFUSE BIT(1),    /* X'80' = IORB in use          */ 04900000
*               3 IORFRPS BIT(1),    /* X'40' = RPS device           */ 04950000
*               3 * BIT(2),          /* Reserved                     */ 05000000
*               3 IORSWAP BIT(1),    /* Swap data set flag.             05050000
*                                       1 = IORB for swap data set,     05100000
*                                       0 = IORB for page data set   */ 05150000
*               3 IORAPND BIT(3),    /* Appendage flags              */ 05200000
*                 4 IORFDI BIT(1),   /* DIE completed                */ 05250000
*                 4 IORFNE BIT(1),   /* Normal end completed flag    */ 05300000
*                 4 IORFAE BIT(1),   /* Abnormal end completed flag  */ 05350000
*             2 IORIORB PTR(31),     /* Pointer to next IORB         */ 05400000
*             2 IORPCCW PTR(31),     /* Pointer to first PCCW        */ 05450000
*               3 IORSCCW PTR(31),   /* Pointer to first SCCW        */ 05500000
*             2 IORIOSB PTR(31),     /* IOSB address                 */ 05550000
*             2 IORSAVE PTR(31),     /* Pointer to 18-word save area */ 05600000
*             2 IORERR PTR(31),      /* Pointer to PCCW in error     */ 05650000
*             2 IORTSMP CHAR(8),     /* TOD clock timestamp      @L1C*/ 05700000
*             2 IORPARTE PTR(31),    /* Pointer to PARTE             */ 05750000
*             2 IORTREQ FIXED(31),   /* Number of pages transferred     05800000
*                                       using this IORB      @G50FP4U*/ 05850000
*             2 IORSION FIXED(31),   /* Number of STARTIOs and          05900000
*                                       resumes issued using this       05950000
*                                       IORB                     @L1C*/ 06000000
*             2 IORNOP PTR(31),      /* Pointer to the last CCW in      06050000
*                                       the channel program      @L1A*/ 06100000
*             2 IORSRBP PTR(31),     /* Pointer to the SRB used by the  06150000
*                                       resume service           @L1A*/ 06200000
*             2 IORRQSZ FIXED(31),   /* Number of AIAs outstanding on   06250000
*                                       this IORB                @01C*/ 06300000
*             2 * CHAR(0) BDY(DWORD);                                   06350000
