**********************************************************************  00050000
*  COPYRIGHT:                                                        *  00100000
*PROPRIETARY V3 STATEMENT                                            *  00150000
*LICENSED MATERIALS - PROPERTY OF IBM                                *  00200000
*"RESTRICTED MATERIALS OF IBM"                                       *  00250000
*5695-DF1                                                            *  00300000
*(C) COPYRIGHT 1992  IBM CORP.                                       *  00350000
*END PROPRIETARY V3 STATEMENT                                        *  00400000
**********************************************************************  00500000
         MACRO                                                          03000000
&NAME    IMGLIB &OPCL,&DCBAD                                  @ZA28403  06000000
.*                                                                      09000000
.*   THIS MACRO WAS DESIGNED TO CONSTRUCT REQUIRED PARAMETERS NECESSARY 12000000
.*   TO BUILD OR DELETE A DCB AND DEB FOR SYS1.IMAGELIB                 15000000
.*                                                                      18000000
         AIF   ('&OPCL' EQ 'OPEN').OPENLB                               21000000
         AIF   ('&OPCL' EQ 'CLOSE').CLOSELB                             24000000
.ERROR1  ANOP                                                           27000000
         IHBERMAC 192                                                   30000000
         MEXIT                                                          33000000
.OPENLB  AIF   ('&DCBAD' NE '').ERROR1                                  36000000
&NAME    SR    1,1                     *ZERO OUT REGISTER 1   @ZA28403  39000000
         SVC   105                     *ISSUE SVC TO BUILD IMAGELIB DCB 42000000
         MEXIT                                                          45000000
.CLOSELB AIF   ('&DCBAD' EQ '').ERROR1                                  48000000
         AIF   ('&DCBAD'(1,1) EQ '(').CLOSE1                            51000000
&NAME    L     1,&DCBAD                *LOAD DCB INTO REG1    @ZA28403  54000000
         SVC   105                     *DELETE SYS1.IMAGELIB DCB        54050000
         MEXIT                                                          54100000
.CLOSE1  ANOP                                                           54150000
&NAME    LR    1,&DCBAD(1)             *LOAD DCB INTO REG1    @ZA28403  54200000
         SVC   105                     *DELETE SYS1.IMAGELIB DCB        54250000
         MEND                                                           54300000
