* /***START OF SPECIFICATIONS*****************************************/ 00001000
*  **PROPRIETARY_STATEMENT********************************************  00002000
* *01* PROPRIETARY STATEMENT=                                        *  00003000
*                                                                    *  00004000
*                                                                    *  00005000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00006000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  00007000
*   5685-025 (C) COPYRIGHT IBM CORP. 1981, 1989                      *  00008000
*   SEE COPYRIGHT INSTRUCTIONS                                       *  00009000
*                                                                    *  00010000
*   STATUS= JTE21X2                                                  *  00011000
*                                                                    *  00012000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00013000
* /*                                                                 */ 00014000
* /*01*  LOAD-MODULE: TRANSMIT and RECEIVE                   @E1402SC*/ 00015000
* /*                                                                 */ 00016000
* /*01*  MODULE-NAME: INMXPARM                                       */ 00017000
* /*                                                                 */ 00018000
* /*01*  MACRO NAME: INMXP                                           */ 00019000
* /*                                                                 */ 00020000
* /*01*  DESCRIPTIVE-NAME: Installation options macro.               */ 00021000
* /*                                                                 */ 00022000
* /*                                                                 */ 00023000
* /*01*  FUNCTION: The INMXP macro generates local option information*/ 00024000
* /*               which will be used by the TRANSMIT and RECEIVE    */ 00025000
* /*               commands.                                         */ 00026000
* /*                                                                 */ 00027000
* /*02*    DEPENDENCIES: See warning                         @WA33171*/ 00028040
* /*                                                                 */ 00028080
* /*******************************************************************/ 00028120
* /*    WW   WW  AAAAA  RRRRRR  NN   NN IIIII NN   NN  GGGG          */ 00028160
* /*    WW   WW AAAAAAA RRRRRRR NN   NN IIIII NN   NN GGGGGG         */ 00028200
* /*    WW   WW AA   AA RR   RR NNN  NN  III  NNN  NN GG   GG        */ 00028240
* /*    WW   WW AA   AA RR   RR NNNN NN  III  NNNN NN GG   GG        */ 00028280
* /*    WW W WW AAAAAAA RRRRRRR NNNNNNN  III  NNNNNNN GG             */ 00028320
* /*    WW W WW AAAAAAA RRRRRR  NN NNNN  III  NN NNNN GG  GGG        */ 00028360
* /*    WWWWWWW AA   AA RRRRR   NN  NNN  III  NN  NNN GG  GGG        */ 00028400
* /*    WWW WWW AA   AA RR RRR  NN   NN  III  NN   NN GG   GG        */ 00028440
* /*     WW WW  AA   AA RR  RR  NN   NN IIIII NN   NN GGGGGG         */ 00028480
* /*      W W   AA   AA RR   RR NN   NN IIIII NN   NN  GGGG          */ 00028520
* /*                                                                 */ 00028560
* /* Do *NOT* make any changes to this macro unless they are         */ 00028600
* /* mirrored in INMXPRMD                                    @WA33171*/ 00028640
* /*                                                                 */ 00028680
* /*******************************************************************/ 00028720
* /*                                                                 */ 00029000
* /*02*    CHARACTER-CODE-DEPENDENCIES: None                         */ 00030000
* /*                                                                 */ 00031000
* /*02*    RESTRICTIONS: None                                        */ 00032000
* /*                                                                 */ 00033000
* /*01*  MODULE-TYPE: MACRO                                          */ 00034000
* /*                                                                 */ 00035000
* /*02*    PROCESSOR: Assembler                                      */ 00036000
* /*                                                                 */ 00037000
* /*02*    MODULE-SIZE: See Assembler Listing                @E1402SC*/ 00038000
* /*                                                                 */ 00039000
* /*02*    ATTRIBUTES:                                               */ 00040000
* /*                                                                 */ 00041000
* /*         Location: LINKLIB                               @E1402SC*/ 00042000
* /*         State: Problem                                          */ 00043000
* /*         Key:   8                                                */ 00044000
* /*         Mode:  Task                                             */ 00045000
* /*         Serialization: Enabled, Unlocked                        */ 00046000
* /*         Type:  Refreshable                                      */ 00047000
* /*                                                                 */ 00048000
* /*01*  ENTRY-POINT: INMXPARM                                       */ 00049000
* /*                                                                 */ 00050000
* /*                                                                 */ 00051000
* /*01*  EXTERNAL-REFERENCES: None.                                  */ 00052000
* /*                                                                 */ 00053000
* /*                                                                 */ 00054000
* /*01*  MACROS-EXECUTABLE: None.                                    */ 00055000
* /*                                                                 */ 00056000
* /*01*  CHANGE-ACTIVITY:                                            */ 00057000
* /*                                                                 */ 00058000
* /*01*  MESSAGES:                                                   */ 00059000
* /*              THE INMXP MACRO MAY NOT BE ISSUED MULTIPLE TIMES   */ 00060000
* /*              INVALID CIPHER OPTION SPECIFIED                    */ 00061000
* /*              VALUE FOR LOGNAME= PARAMETER IS TOO LONG           */ 00062000
* /*              VALUE FOR LOGSEL= PARAMETER IS TOO LONG            */ 00063000
* /*              VALUE FOR SYSCTL= PARAMETER IS TOO LONG            */ 00064000
* /*              VALUE FOR SYSOUT= PARAMETER IS TOO LONG            */ 00065000
* /*              VALUE FOR USRCTL= PARAMETER IS TOO LONG            */ 00066000
* /*              VALUE FOR VIO= PARAMETER IS TOO LONG               */ 00067000
* /*              VALUE FOR SPOOLCL= PARAMETER IS TOO LONG           */ 00068000
* /*              VALUE FOR SPOOLCL= MUST BE ALPHANUMERIC (A-Z,0-9,*)*/ 00069000
* /*                                                                 */ 00070000
* /*01*  CHANGE-ACTIVITY:                                            */ 00071000
* /*@E1114KJ Interactive Data Transmission Facility          @E1114KJ*/ 00072000
* /*@ZMT1023 Change dsname for default names dataset         @ZMT1023*/ 00073000
* /*@ZMT1026 Indicate INMXPARM contains the default values.  @ZMT1026*/ 00074000
* /*@ZMT1044 Add STATUS informatio                           @ZMT1044*/ 00075000
* /*@ZA62831 DEFAULT FOR VIO UNIT NAME INCORRECT             @ZA62831*/ 00076000
* /*@ZA74246 TO REMOVE CHANGES ADDED BY APAR OZ62831         @ZA74246*/ 00077000
* /*@E1402SC TO ADD SPOOLCL PARAMETER AS INSTALLATION OPTION @E1402SC*/ 00078000
* /* OW33171 Copy new fields added to INMXPRMD into INMXP    @WA33171*/ 00078300
* /*                                                                 */ 00078600
* /*                                                                 */ 00079000
* /***END OF SPECIFICATIONS*******************************************/ 00080000
* /*A00000000-99999999                                       @E1114KJ*/ 00081000
         MACRO                                                          00082000
         INMXP &CIPHER=YES,        ENCRYPTION PARAMETER                X00083000
               &LOGNAME=,          DEFAULT LOGNAME VALUE               X00084000
               &LOGSEL=,           DEFAULT LOGSELECTOR VALUE           X00085000
               &OUTWARN=,          OUTPUT WARNING LIMIT LEVEL          X00086000
               &OUTLIM=,           OUTPUT LIMIT LEVEL                  X00087000
               &SYSCTL=,           SYSTEM CONTROL DATASET              X00088000
               &USRCTL=,           USER CONTROL DATASET                X00089000
               &SYSOUT=,           SYSOUT CLASS FOR UTILITY MESSAGES   X00090000
               &VIO=,              NAME OF VIO UNIT           @ZMT1026 X00091000
               &DUMMY=,            YES=DUMMY INMXPARM CSECT   @ZMT1026 X00092000
               &SPOOLCL=           SPOOL OUTPUT CLASS         @E1402SC  00093000
         LCLA  &I,&J,&OS                                                00094000
         LCLC  &S,&P                                                    00095000
         LCLC  &CIPHOP1,&CIPHOP2,&CIPHOP3                               00096000
         LCLC  &DUMYPRM                                                 00097000
.* PREVIOUS LINE ADDED                                       @ZMT1026   00098000
         GBLC  &INMXP1                                                  00099000
         AIF   ('&INMXP1' EQ '').DUPOK1                                 00100000
         MNOTE 12,'THE INMXP MACRO MAY NOT BE ISSUED MULTIPLE TIMES'    00101000
.DUPOK1  ANOP                                                           00102000
&INMXP1  SETC  'INMXP'                                                  00103000
INMXPARM CSECT                     CSECT NAME FOR MMTRANS PARMS         00104000
         DC    CL8'INMXPARM'       MODULE NAME                          00105000
*********************************************************************** 00106000
*    AN ASSEMBLY ERROR ON THE NEXT STATEMENT INDICATES THAT THE       * 00107000
*    INMEND  MACRO WAS OMITTED.                                       * 00108000
*********************************************************************** 00109000
         DC    AL2(INMPEND-INMXPARM) LENGTH OF MODULE                   00110000
         SPACE                                                          00111000
         DC    AL2((INMPEND-INMNODES)/16) NUMBER OF NODES               00112000
         DC    A(INMNODES)         ADDRESS OF NODE TABLE                00113000
         SPACE                                                          00113200
         DC    XL1'2'              MACRO VERSION              @WA33171  00113400
         DC    XL3'00'             RESERVED                   @WA33171  00113600
         SPACE                                                          00114000
         AIF   ('&OUTWARN(1)' EQ '').W1                                 00115000
         DC    F'&OUTWARN(1).'     OUTPUT WARNING LEVEL                 00116000
         AGO   .W2                                                      00117000
.W1      DC    F'10000'            OUTPUT WARNING LEVEL                 00118000
.W2      ANOP                                                           00119000
         AIF   ('&OUTWARN(2)' EQ '').W3                                 00120000
         DC    F'&OUTWARN(2).'     OUTPUT WARNING INCREMENT             00121000
         AGO   .W4                                                      00122000
.W3      DC    F'5000'             OUTPUT WARNING INCREMENT             00123000
.W4      ANOP                                                           00124000
         SPACE                                                          00125000
         AIF   ('&OUTLIM' EQ '').L1                                     00126000
         DC    F'&OUTLIM.'         OUTPUT CUTOFF LEVEL                  00127000
         AGO   .L2                                                      00128000
.L1      DC    F'30000'            OUTPUT CUTOFF LEVEL                  00129000
.L2      ANOP                                                           00130000
         SPACE                                                          00131000
         DC    XL8'00'             RESERVED                             00132000
         AIF   ('&VIO' EQ '').VIO1                                      00133000
&I       SETA  K'&VIO                                                   00134000
         AIF   (&I GT 8).VIOERR1                                        00135000
         SPACE                                                          00136000
         DC    F'&I.'              LENGTH OF VIO UNIT NAME              00137000
         DC    CL8'&VIO.'          UNIT NAME FOR VIO ALLOCATION         00138000
         AGO   .VIO2                                                    00139000
.VIO1    DC    F'0'                DEFAULT TO NO UNIT NAME (LEN=0)      00140000
         DC    CL8'        '       UNIT NAME FOR VIO ALLOCATION         00141000
         AGO   .VIO2                                                    00142000
.VIOERR1 MNOTE 8,'VALUE FOR VIO= PARAMETER IS TOO LONG'                 00143000
.VIO2    ANOP                                                           00144000
         SPACE                                                          00145000
         DC    A(0)                RESERVED                             00146000
         DC    A(0)                RESERVED                             00147000
         SPACE                                                          00148000
&DUMYPRM SETC  '0'                                                      00149000
.* PREVIOUS LINE ADDED                                       @ZMT1026   00150000
&CIPHOP1 SETC  '0'                                                      00151000
&CIPHOP2 SETC  '0'                                                      00152000
&CIPHOP3 SETC  '0'                                                      00153000
         AIF   ('&CIPHER' EQ 'YES').CIPS1                               00154000
         AIF   ('&CIPHER' EQ 'ALWAYS').CIPS2                            00155000
         AIF   ('&CIPHER' NE 'NO').CIPERR1                              00156000
&CIPHOP3 SETC  '1'                SET NO ENCRYPTION ALLOWED             00157000
         AGO   .CIPDC                                                   00158000
.CIPS1   ANOP                                                           00159000
&CIPHOP1 SETC  '1'                SET ENCRYPTION 'YES'                  00160000
         AGO   .CIPDC                                                   00161000
.CIPS2   ANOP                                                           00162000
&CIPHOP2 SETC  '1'                 SET ENCRYPTION ALWAYS                00163000
.CIPDC   ANOP                                                           00164000
         AIF   ('&DUMMY' NE 'YES').CIPDC1                               00165000
&DUMYPRM SETC  '1'                                                      00166000
.CIPDC1  ANOP                                                           00167000
         DC    B'&DUMYPRM.&CIPHOP1.&CIPHOP2.&CIPHOP3.0000'              00168000
.* PREVIOUS 4 LINES: FIRST THREE ADDED, FOURTH MODIFIED      @ZMT1026   00169000
         AGO   .CIPEND                                                  00170000
.CIPERR1 MNOTE 8,'INVALID CIPHER OPTION SPECIFIED'                      00171000
.CIPEND  ANOP                                                           00172000
         SPACE                                                          00173000
         DC    X'00'               RESERVED                             00174000
         SPACE                                                          00175000
         AIF   (K'&SYSOUT GT 1).SYSERR1                                 00176000
         AIF   ('&SYSOUT' EQ '').SYSOUT1                                00177000
         DC    CL1'&SYSOUT.'       SYSOUT CLASS FOR IEBCOPY MESSAGES    00178000
         AGO   .SYSOUT2                                                 00179000
.SYSOUT1 DC    CL1'*'              SYSOUT CLASS FOR IEBCOPY MESSAGES    00180000
         AGO   .SYSOUT2                                                 00181000
.SYSERR1 MNOTE 8,'VALUE FOR SYSOUT= PARAMETER IS TOO LONG'              00182000
.SYSOUT2 ANOP                                                           00183000
         SPACE                                                          00184000
         DC    X'00'               RESERVED                             00185000
         SPACE                                                          00186000
         AIF   (K'&LOGNAME GT 8).LGNERR1                                00187000
         AIF   ('&LOGNAME' EQ '').LOGN1                                 00188000
         DC    CL8'&LOGNAME.'      SPECIFIED LOGNAME VALUE              00189000
&I       SETA  K'&LOGNAME          LENGTH OF SPECIFIED LOGNAME          00190000
         AGO   .LOGN2                                                   00191000
.LOGN1   ANOP                                                           00192000
&I       SETA  4                                                        00193000
         DC    CL8'MISC'           DEFAULT LOG NAME                     00194000
.LOGN2   ANOP                                                           00195000
         DC    H'&I.'              LOG NAME LENGTH                      00196000
         AGO   .LGNEND                                                  00197000
.LGNERR1 MNOTE 8,'VALUE FOR LOGNAME= PARAMETER IS TOO LONG'             00198000
.LGNEND  ANOP                                                           00199000
         SPACE                                                          00200000
         AIF   (K'&LOGSEL GT 8).LGSERR1                                 00201000
         AIF   ('&LOGSEL' EQ '').LOGS1                                  00202000
         DC    CL10'.&LOGSEL..'    SPECIFIED LOG SELECTOR VALUE         00203000
&I       SETA  K'&LOGSEL           LENGTH OF SPECIFIED LOGSELECTOR      00204000
&I       SETA  &I+2                LENGTH OF SPECIFIED LOGSELECTOR      00205000
         AGO   .LOGS2                                                   00206000
.LOGS1   ANOP                                                           00207000
&I       SETA  5                                                        00208000
         DC    CL10'.LOG.'         DEFAULT LOG SELECTOR                 00209000
.LOGS2   ANOP                                                           00210000
         DC    H'&I.'              LOG SELECTOR LENGTH                  00211000
         AGO   .LGSEND                                                  00212000
.LGSERR1 MNOTE 8,'VALUE FOR LOGSEL= PARAMETER IS TOO LONG'              00213000
.LGSEND  ANOP                                                           00214000
         SPACE                                                          00215000
         AIF   (K'&SYSCTL GT 44).SYSCER1                                00216000
         AIF   ('&SYSCTL' EQ '').SYSC1                                  00217000
         DC    CL44'&SYSCTL.'      SPECIFIED SYSTEM CONTROL DATASET     00218000
&I       SETA  K'&SYSCTL           LENGTH OF SPECIFIED DSNAME           00219000
         AGO   .SYSC2                                                   00220000
.SYSC1   ANOP                                                           00221000
&I       SETA  0                                                        00222000
         DC    CL44' '             NO DEFAULT SYSTEM CONTROL DATASET    00223000
.SYSC2   ANOP                                                           00224000
         DC    H'&I.'              CONTROL DSNAME LENGTH                00225000
         AGO   .SYSCEND                                                 00226000
.SYSCER1 MNOTE 8,'VALUE FOR SYSCTL= PARAMETER IS TOO LONG'              00227000
.SYSCEND ANOP                                                           00228000
         SPACE                                                          00229000
         AIF   (K'&USRCTL GT 42).USRERR1                                00230000
         AIF   ('&USRCTL' EQ '').USRC1                                  00231000
         DC    CL44'.&USRCTL.'     SPECIFIED USER CONTROL DATASET       00232000
&I       SETA  K'&USRCTL           LENGTH OF SPECIFIED DSNAME           00233000
&I       SETA  &I+1                ADD SPACE FOR PERIOD                 00234000
         AGO   .USRC2                                                   00235000
.USRC1   ANOP                                                           00236000
&I       SETA  11                                                       00237000
         DC    CL44'.NAMES.TEXT'   DEFAULT USER CONTROL      @ZMT1023   00238000
*                                  NAMES DATASET             @ZMT1023   00239000
.USRC2   ANOP                                                           00240000
         DC    H'&I.'              CONTROL DSNAME LENGTH                00241000
         AGO   .USREND                                                  00242000
.USRERR1 MNOTE 8,'VALUE FOR USRCTL= PARAMETER IS TOO LONG'              00243000
.USREND  ANOP                                                           00244000
         SPACE 1                                              @E1402SC  00245000
         AIF   (K'&SPOOLCL GT 1).SPLERR1                      @E1402SC  00246000
         AIF   ('&SPOOLCL' EQ '').SPLCL1                      @E1402SC  00247000
         AIF   ('&SPOOLCL' EQ '*').SPLCL2                     @E1402SC  00248000
         AIF   ('&SPOOLCL' GE 'A' AND '&SPOOLCL' LE 'I').SPLCL2         00249000
.*                                                            @E1402SC  00250000
         AIF   ('&SPOOLCL' GE 'J' AND '&SPOOLCL' LE 'R').SPLCL2         00251000
.*                                                            @E1402SC  00252000
         AIF   ('&SPOOLCL' GE 'S' AND '&SPOOLCL' LE 'Z').SPLCL2         00253000
.*                                                            @E1402SC  00254000
         AIF   ('&SPOOLCL' GE '0' AND '&SPOOLCL' LE '9').SPLCL2         00255000
.*                                                            @E1402SC  00256000
         AGO   .SPLERR2                                       @E1402SC  00257000
.SPLCL2  DC    CL1'&SPOOLCL.'      SPOOLED OUTPUT CLASS       @E1402SC  00258000
         AGO   .SPLEND                                        @E1402SC  00259000
.SPLCL1  DC    CL1'B'              SPOOLED OUTPUT DEFAULT     @E1402SC  00260000
         AGO   .SPLEND                                        @E1402SC  00261000
.SPLERR1 MNOTE 8,'VALUE FOR SPOOLCL= PARAMETER IS TOO LONG'   @E1402SC  00262000
         AGO   .SPLEND                                        @E1402SC  00263000
.SPLERR2 MNOTE 8,'VALUE FOR SPOOLCL= MUST BE (A-Z,0-9,*)'               00264000
.*                                                            @E1402SC  00265000
.SPLEND  ANOP                                                 @E1402SC  00266000
         SPACE                                                          00267000
.RSVD1   DC    XL61'00'            Reserved space             @WA33171  00267300
         SPACE                                                          00267600
INMNODES EQU   *                   BEGINNING OF NODE NAME TABLE         00268000
         MEXIT                                                          00269000
         MEND                                                           00270000
