* %GOTO MLBKPLS1;  /*                                                   00050000
         MACRO                                                          00100000
         IOSDMLBK                                                       00150000
*                  */                                                   00200000
* %MLBKPLS1:  ;                                                         00250000
*/******MLBK - IOS Recovery Message Block  ***************************/ 00300000
*/*                                                                  */ 00350000
*/*01*  MACRO  NAME - IOSDMLBK                                       */ 00400000
*/*                                                                  */ 00450000
*/*01*  DESCRIPTIVE NAME - MLBK  Message and logrec block            */ 00500000
*/*                                                                  */ 00550000
*/*01* COPYRIGHT =                                                   */ 00600000
*/*       5695-047                                                   */ 00650000
*/*       This macro is "RESTRICTED MATERIALS OF IBM"                */ 00700000
*/*       (C) Copyright IBM Corporation 1987,1990                    */ 00750000
*/*       Licensed materials - Property of IBM                       */ 00800000
*/*                                                                  */ 00850000
*/*01*  STATUS - HBB4410                                             */ 00900000
*/*                                                                  */ 00950000
*/*01*  FUNCTION - This macro describes the layout of the            */ 01000000
*/*                message block passed to IOSVMSLG to output        */ 01050000
*/*                messages and logrec entries.                      */ 01100000
*/*                                                                  */ 01150000
*/*                                                                  */ 01200000
*/*01*  DEPENDENCIES - The field named 'MLBKWTOP' has a length       */ 01208300
*/*                    value defined as the current length(112bytes) */ 01216600
*/*                    of a WTO/WTOR parameter list using the TEXT() */ 01224900
*/*                    parameter. If this macro increases in size,   */ 01233200
*/*                    this macro must be changed accordingly.       */ 01241500
*/*                    The following modules are dependent on being  */ 01249800
*/*                    compiled with the same size of the MLBK, and, */ 01258100
*/*                    same level of the WTO/WTOR and/or LOADWAIT    */ 01266400
*/*                    macros:                                       */ 01274700
*/*                    - IOSVURDT, IOSVURVL, IOSRSNDV, IOSVMSLG,     */ 01283000
*/*                      IOSVMSGT                                @02C*/ 01291300
*/*                                                                  */ 01300000
*/*                  - Since U/R message processing may be done in   */ 01306200
*/*                    the IOS address space, the MLBK must reside   */ 01312400
*/*                    in common storage.                        @02A*/ 01318600
*/*                                                                  */ 01325000
*/*01*  RESTRICTIONS - None                                          */ 01350000
*/*                                                                  */ 01400000
*/*01*  MODULE TYPE - Control Block                                  */ 01450000
*/*                                                                  */ 01500000
*/*01*  PROCESSOR - PLS3 COMPILER and ASSEMBLER H                    */ 01550000
*/*                                                                  */ 01600000
*/*01*  CHANGE ACTIVITY -                                            */ 01650000
*/*                                                                  */ 01700000
*/* $MAC(IOSDMLBK),COMP(SC1C3): IOS Message Logrec block             */ 01750000
*/*                                                                  */ 01800000
*/* $L0= OY04180 HBB3310 871101  PDLE: U/R enhancements              */ 01850000
*/* $L1= CNITG   HBB4410 890918  PDLQ: Console Integration Support   */ 01853500
*/* $01= OY18228 HBB3310 880501  PDLE: Reset allegiance support  @01A*/ 01857100
*/* $D1= DCR080  HBB4410 881205  PDLQ: Support for handling missing  */ 01864200
*/*                                    interrupt and manual inter-   */ 01871300
*/*                                    vention conditions for couple */ 01878400
*/*                                    data sets for Cross-system    */ 01885500
*/*                                    coupling facility.        @D1A*/ 01892600
*/* $02= OW08029 HBB3310 950531  PDNO: Added support for processing  */ 01894400
*/*                                    U/R messages in the IOS       */ 01896200
*/*                                    address space             @02A*/ 01898000
*/*                                                                  */ 01900000
*/********************************************************************/ 01950000
* %GOTO MLBKPLS;    /*                                                  02000000
         SPACE 1                                                        02050000
         DS    0D                                                       02100000
MLBK     DSECT                                                          02150000
MLBKDATA DS    0CL32                                               @02C 02200000
MLBKUCBC DS    F                   UCB common address                   02250000
MLBKSRBA DS    F                   SRB address                          02300000
MLBKLOGB DS    F                   LOGREC buffer                        02350000
*/********************************************************************/ 02400000
*/*    Channel Path masks                                            */ 02450000
*/********************************************************************/ 02500000
MLBKCHPF DS    CL1                 Failing Channel path                 02550000
MLBKCHPR DS    CL1                 Recovered channel path               02600000
MLBKRSV1 DS    CL2                 Reserved                             02650000
*/********************************************************************/ 02700000
*/*    Flags                                                         */ 02750000
*/********************************************************************/ 02800000
MLBKFLGS DS    0CL3                Flags                           @02C 02850000
MLBKFLG1 DS    XL1                 Interface flags                 @02C 02900000
MLBKWTO  EQU   X'80'               WTO request                          02950000
MLBKWTOR EQU   X'40'               WTOR request                         03000000
MLBKLOGF EQU   X'20'               LOGREC request                       03050000
MLBKMANF EQU   X'10'               UCB manual intervention count        03083300
*                                  footprint                     @D1A   03116600
MLBKMANR EQU   X'08'               Caller requested that the UCB        03137400
*                                  manual intervention count be         03158200
*                                  incremented                     @02A 03179000
*        EQU   X'04'               Reserved                             03200000
*        EQU   X'02'               Reserved                             03250000
MLBKPGDV EQU   X'01'               Paging device                        03300000
MLBKFLG2 DS    XL1                 Interface flags                 @02C 03350000
MLBKDVIF EQU   X'80'               Device Number field invalid          03400000
MLBKCFIF EQU   X'40'               Failing Channel path field invalid   03450000
MLBKCRIF EQU   X'20'               Recovered Channel Path field invalid 03500000
MLBKCROF EQU   X'10'               Message requires recovered CHPID     03537500
*                                                                  @L1C 03575000
MLBKBOXD EQU   X'08'               Message text contains 'BOXED'   @L1A 03612500
MLBKASMO EQU   X'04'               ASIM storage obtained and is         03629600
*                                  required to be freed            @02A 03646700
MLBKCRIT EQU   X'02'               Indicates the WTO message is         03663800
*                                  critical and should be issued        03680900
*                                  synchronously if asynchronous        03698000
*                                  processing fails.  Undefined for     03715100
*                                  WTOR processing.                @02A 03732200
*        EQU   X'01'               Reserved                             03750000
MLBKFLG3 DS    XL1                 Internal module flag byte       @02C 03800000
MLBKTASK EQU   X'80'               Task mode processing                 03850000
MLBKMSGA EQU   X'40'               WTOR message active                  03900000
MLBKNOUR EQU   X'20'               No WTOR UR response             @01A 03925000
MLBKRPLY DS    CL1                 WTOR 1 byte reply field              04300000
         DS    CL4                 Reserved for future use         @02A 04312500
MLBKASIM DS    F                   ASIM for task mode processing   @02A 04325000
         DS    CL4                 Reserved for future use         @02A 04337500
*/********************************************************************/ 04350000
*/*    Module 18 word save area                                      */ 04400000
*/********************************************************************/ 04450000
         DS    0F                                                  @L1A 04475000
MLBKSA   DS    CL72                                                     04500000
*/********************************************************************/ 04550000
*/*    Message Buffer                                                */ 04600000
*/********************************************************************/ 04650000
MLBKMSGB DS    0CL196              Message buffer                  @02C 04655500
MLBKWTOP DS    CL112               Dynamic WTO/R parameter list    @L1A 04661000
MLBKTXBF DS    0CL82               Text buffer used with WTO/R     @L1A 04666500
MLBKTXLN DS    XL2                 Length of message text          @L1A 04672000
MLBKTEXT DS    0CL80               Message text                    @L1A 04677500
MLBKMSID DS    CL8                 Message id                      @L1A 04683000
MLBKDEVC DS    0CL5                Device and comma                @L1A 04688500
MLBKDEVN DS    CL4                 Device name                     @L1A 04694000
MLBKCOM1 DS    CL1                 Comma                           @L1A 04699500
MLBKSUFF DS    0CL67               Variable suffix                 @02C 04705000
MLBKFCPD DS    CL2                 Channel path - failing          @L1A 04710500
MLBKCONS DS    0CL65               Constant message text area      @L1A 04716000
MLBKCOM2 DS    CL2                 Comma & blank                   @L1A 04721500
MLBKC427 DS    CL12                CONTROL UNIT or CHANNEL PATH    @L1A 04727000
MLBKCNS1 DS    CL28                Constant message text           @L1A 04732500
MLBKRCPD DS    CL2                 Channel path recovered placemnt @L1A 04738000
MLBKCNS2 DS    CL21                Constant message text           @L1A 04743500
         DS    CL2                 Reserved for future use         @02A 04743900
*/********************************************************************/ 04744300
*/*  IOSMINTV parameter list area                                    */ 04744700
*/*                                                                  */ 04745100
*/*  Note: If the size of the IOSMINTV parameter list is expaned     */ 04745500
*/*        past 12 bytes, then storage for MLBKMNTV will also be     */ 04745900
*/*        required to change.                                       */ 04746300
*/*                                                                  */ 04746700
*/*        This area is required by IOSVMSLG and IOSVMSGT        @02A*/ 04747100
*/********************************************************************/ 04747500
         DS    0F                                                  @02A 04747900
MLBKMNTV DS    CL12                IOSMINTV parameter list area    @02A 04748300
         DS    CL8                 Reserved for future use         @02A 04748700
*/********************************************************************/ 04750000
*/*    Module Work Area                                              */ 04800000
*/********************************************************************/ 04850000
         DS    0F                                                  @L1A 04883300
MLBKWORK DS    CL100                                               @L1C 04916600
MLBKEND  EQU   *                                                        04950000
*/********************************************************************/ 05000000
*/*  U/R - MLBK length constant                                      */ 05050000
*/********************************************************************/ 05100000
MLBKLTH  EQU    MLBKEND-MLBK       U/R work area length                 05150000
         MEND  ,    */                                                  05200000
* %MLBKPLS: ;                                                           05250000
* DECLARE                                                               05300000
*   1 MLBK    BDY(DWORD) BASED         , /* MLBK block               */ 05350000
*     2 MLBKDATA                       , /* message data area        */ 05400000
*       3 MLBKUCBC     PTR(31)         , /* UCB common address       */ 05450000
*       3 MLBKSRBA     PTR(31)         , /* SRB address              */ 05500000
*       3 MLBKLOGB     PTR(31)         , /* LOGREC buffer address    */ 05550000
*/********************************************************************/ 05600000
*/*  Channel Path Masks                                              */ 05650000
*/********************************************************************/ 05700000
*       3 *                            , /*                          */ 05750000
*         5 MLBKCHPF    BIT(08)        , /* Failing CHPID path mask  */ 05800000
*         5 MLBKCHPR    BIT(08)        , /* Recovered CHPID path mask*/ 05850000
*         5 MLBKRSV1   CHAR(02)        , /* Reserved                 */ 05900000
*/********************************************************************/ 05950000
*/*  Flags                                                           */ 06000000
*/********************************************************************/ 06050000
*       3 *                            , /*                          */ 06100000
*         5 MLBKFLGS   BIT(24)         , /* Flags                @L1C*/ 06150000
*           7 MLBKFLG1 BIT(8)          , /* Interface flags          */ 06200000
*             9 MLBKWTO  BIT(1)        , /* WTO request              */ 06250000
*             9 MLBKWTOR BIT(1)        , /* WTOR request             */ 06300000
*             9 MLBKLOGF BIT(1)        , /* LOGREC request           */ 06350000
*             9 MLBKMANF BIT(1)        , /* UCB manual intervention     06366600
*                                           count footprint      @D1A*/ 06383200
*             9 MLBKMANR BIT(1)        , /* Caller requested that the   06399900
*                                           UCB manual intervention     06416600
*                                           count be incremented @02A*/ 06433300
*             9 *        BIT(1)        , /* Reserved                 */ 06450000
*             9 *        BIT(1)        , /* Reserved                 */ 06500000
*             9 MLBKPGDV BIT(1)        , /* Paging device            */ 06600000
*           7 MLBKFLG2 BIT(8)          , /* Interface flags          */ 06650000
*             9 MLBKDVIF BIT(1)        , /* Device number invalid    */ 06700000
*             9 MLBKCFIF BIT(1)        , /* Failing CHPID invalid       06750000
*                                           or unknown               */ 06800000
*             9 MLBKCRIF BIT(1)        , /* Recovered CHPID invalid     06850000
*                                           or unknown               */ 06900000
*             9 MLBKCROF BIT(1)        , /* Message requires recovered  06916600
*                                           CHPID                @L1C*/ 06933200
*             9 MLBKBOXD BIT(1)        , /* Message text requires       06949800
*                                           'BOXED'              @L1A*/ 06966400
*             9 MLBKASMO BIT(1)        , /* ASIM storage obtained       06969400
*                                           and is required to be       06972400
*                                           freed                @02A*/ 06975400
*             9 MLBKCRIT BIT(1)        , /* Indicates the WTO message   06978400
*                                           is critical and should be   06981400
*                                           issued synchronously if     06984400
*                                           asynchronous processing     06987400
*                                           fails.  Undefined for       06990400
*                                           WTOR processing.     @02A*/ 06993400
*             9 *        BIT(1)        , /* Reserved             @02C*/ 06996400
*           7 MLBKFLG3 BIT(8)          , /* Internal module flags    */ 07000000
*             9 MLBKTASK BIT(1)        , /* Task mode processing     */ 07050000
*             9 MLBKMSGA BIT(1)        , /* WTOR message active      */ 07100000
*             9 MLBKNOUR BIT(1)        , /* No WTOR UR response  @01A*/ 07133300
*             9 *        BIT(5)        , /* Reserved             @01C*/ 07166600
*/********************************************************************/ 07250000
*/*  WTOR reply byte                                                 */ 07300000
*/********************************************************************/ 07350000
*       3 MLBKRPLY   CHAR(01)          , /* WTOR reply byte      @L1C*/ 07400000
*       3 *          CHAR(4)           , /* Reserved for future         07435700
*                                           use                  @02A*/ 07471400
*       3 MLBKASIM   PTR(31)           , /* ASIM for task mode          07507100
*                                           message processing   @02A*/ 07542800
*       3 *          CHAR(4)           , /* Reserved for future         07578500
*                                           use                  @02A*/ 07614200
*/********************************************************************/ 07650000
*/*  Module 18 word save area                                        */ 07700000
*/********************************************************************/ 07750000
*     2 MLBKSA      CHAR(72) BDY(WORD) , /* 18 word save area        */ 07800000
*/********************************************************************/ 07850000
*/*  Message Buffer                                                  */ 07900000
*/********************************************************************/ 07950000
*     2 MLBKMSGB                       , /* Message buffer       @L1C*/ 07953800
*       3 MLBKWTOP  CHAR(112)          , /* Dynamic WTO/R parameter     07957600
*                                           list (TEXT form).    @L1A*/ 07961400
*       3 MLBKTXBF                     , /* Text buffer used with       07965200
*                                           WTO/R TEXT() parameter.     07969000
*                                                                @L1A*/ 07972800
*         4 MLBKTXLN  FIXED(15)        , /* Length of message text.     07976600
*                                                                @L1A*/ 07980400
*         4 MLBKTEXT                   , /* Message text.        @L1A*/ 07984200
*           5 MLBKMSID CHAR(8)         , /* Message id.          @L1A*/ 07988000
*           5 MLBKDEVC                 , /* Device and comma.    @L1A*/ 07991800
*             6 MLBKDEVN CHAR(4)       , /* Device name.         @L1A*/ 07995600
*             6 MLBKCOM1 CHAR(1)       , /* Comma.               @L1A*/ 07999400
*           5 MLBKSUFF                 , /* Variable suffix.     @L1A*/ 08003200
*             6 MLBKFCPD CHAR(2)       , /* Failing channel path @L1A*/ 08007000
*             6 MLBKCONS               , /* Constant msg text.   @L1A*/ 08010800
*               7 MLBKCOM2  CHAR(2)    , /* Comma & blank.       @L1A*/ 08014600
*               7 MLBKC427  CHAR(12)   , /* CONTROL UNIT or CHANNEL     08018400
*                                           PATH in IOS427I.     @L1A*/ 08022200
*               7 MLBKCNS1  CHAR(28)   , /*                      @L1A*/ 08026000
*               7 MLBKRCPD  CHAR(2)    , /* Recovered channel path      08029800
*                                           placement for IOS428I.      08033600
*                                                                @L1A*/ 08037400
*               7 MLBKCNS2  CHAR(21)   , /* Remaining text, if any,     08041200
*                                           for longer msgs.     @L1A*/ 08045000
*       3 *     CHAR(2)                , /* Reserved for future use     08045300
*                                                                @02A*/ 08045600
*/********************************************************************/ 08045900
*/*  IOSMINTV parameter list area                                    */ 08046200
*/*                                                                  */ 08046500
*/*  Note: If the size of the IOSMINTV parameter list is expaned     */ 08046800
*/*        past 12 bytes, then storage for MLBKMNTV will also be     */ 08047100
*/*        required to change.                                       */ 08047400
*/*                                                                  */ 08047700
*/*        This area is required by IOSVMSLG and IOSVMSGT        @02A*/ 08048000
*/********************************************************************/ 08048300
*     2 MLBKMNTV    CHAR(12) BDY(WORD) , /* IOSMINTV parameter list     08048600
*                                           area                 @02A*/ 08048900
*     2 *           CHAR(8)            , /* Reserved for future         08049200
*                                           use                  @02A*/ 08049500
*/********************************************************************/ 08050000
*/*  Module work area                                                */ 08100000
*/********************************************************************/ 08150000
*     2 MLBKWORK    CHAR(100) BDY(WORD); /* Module work area     @L1C*/ 08200000
