*                                                                       00050000
*        %GOTO CCWL1;  /*                                               00100000
         MACRO                                                          00150000
         IOSDCCW  &DSECT=YES  */                                        00200000
*%CCWL1: ;                                                              00250000
*                                                                       00300000
*/********************************************************************/ 00350000
*/*   MACRO NAME = IHACCW                                            */ 00400000
*/*                                                                  */ 00450000
*/*   DESCRIPTIVE NAME = CCW - Channel Command Word                  */ 00500000
*/*                                                                  */ 00550000
*/*   COPYRIGHT =                                                    */ 00600000
*/*        5695-047                                                  */ 00650000
*/*        This macro is "RESTRICTED MATERIALS OF IBM"               */ 00700000
*/*        (C) Copyright IBM Corporation 1982, 1990                  */ 00750000
*/*        Licensed materials - Property of IBM                      */ 00800000
*/*                                                                  */ 00850000
*/*   STATUS = HBB4410                                               */ 00900000
*/*                                                                  */ 00950000
*/*   FUNCTION = Maps the format 0 and format 1 channel command      */ 01000000
*/*              words.                                              */ 01050000
*/*                                                                  */ 01100000
*/*   CHANGE ACTIVITY =                                              */ 01150000
*/*                                                                  */ 01200000
*/*  $MAC(IOSDCCW),COMP(SC1C3):                                      */ 01250000
*/*                                                                  */ 01300000
*/*  $01=OZ88565 HBB2102 850701 PDLE: Define the count field as      */ 01350000
*/*                                   FIXED 16 instead of FIXED 15   */ 01400000
*/*  $L1=VERS    HBB3310 860416 PDLE: Versioning macro into product  */ 01450000
*/*                                                              @L1A*/ 01500000
*/*  $L2=IOSE1   HBB4410 880627 PDLL: New macro variables (Note:     */ 01550000
*/*                                   originally in DCR005)      @L2A*/ 01600000
*/*                                                                  */ 01650000
*/*  OZ85862 - Change Distribution Library from APVTMACS TO          */ 01700000
*/*            AMODGEN.                                      @ZA85862*/ 01750000
*/*                                                                  */ 01800000
*/*  METHOD OF ACCESS                                                */ 01850000
*/*     BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED        */ 01900000
*/*            USING ON CCW0 GIVES ADDRESSABILITY FOR ALL SYMBOLS    */ 01950000
*/*            USING ON CCW1 GIVES ADDRESSABILITY FOR ALL SYMBOLS    */ 02000000
*/*                                                                  */ 02050000
*/*     PL/S - %INCLUDE SYSLIB(IOSDCCW)                              */ 02100000
*/*     The default for the format 0 CCW is BASED.  The default      */ 02150000
*/*     for the format 1 CCW is the storage expression for the       */ 02200000
*/*     format 0 CCW.  The storage expression for the format 0       */ 02250000
*/*     CCW may be overridden via the macro variable IOSDCCW0.       */ 02300000
*/*     The storage expression for the format 1 CCW may be           */ 02350000
*/*     overridden via the macro variable IOSDCCW1.                  */ 02400000
*/*     For example,                                                 */ 02450000
*/*         %IOSDCCW0_STORAGE = 'AUTO'                               */ 02500000
*/*         %IOSDCCW1_STORAGE = 'DEFINED(CCW0)'                      */ 02550000
*/*     This creates a single copy of a CCW in dynamic storage       */ 02600000
*/*     with a mapping for both formats.                             */ 02650000
*/*                                                                  */ 02700000
*/********************************************************************/ 02750000
*%GOTO CCWL2;    /*                                                     02800000
         SPACE 1                                                        02850000
         AIF   ('&DSECT' EQ 'NO').CCW10                                 02900000
CCW0     DSECT                                                          02950000
         AGO .CCW20                                                     03000000
.CCW10   ANOP                                                           03050000
         DS    0D                                                       03100000
CCW0     EQU                     * Format 0 Channel Command Word        03150000
.CCW20   ANOP                                                           03200000
CCW0CMD  DS    CL1                 Channel Command Word                 03250000
CCWNOOP  EQU   X'03'                - NO-OP Command                     03300000
CCWSNS   EQU   X'04'                - Sense command                     03350000
CCWSNSI  EQU   X'E4'                - Sense I/O command                 03400000
CCWTIC   EQU   X'08'                - TIC, Transfer In Channel          03450000
CCW0ADDR DS    AL3                 Data address                         03500000
CCW0FLAG DS    CL1                 Flags                                03550000
CCW0CD   EQU   X'80'                 - Chain data                       03600000
CCW0CC   EQU   X'40'                 - Chain command                    03650000
CCW0SLI  EQU   X'20'                 - Suppress Length Indicator (SLI)  03700000
CCW0SKIP EQU   X'10'                 - Skip                             03750000
CCW0PCI  EQU   X'08'                 - Program Controlled Interrupt     03800000
CCW0IDA  EQU   X'04'                 - Indirect Data Address (IDAW)     03850000
CCW0S    EQU   X'02'                 - Suspend Indicator                03900000
         DS    CL1                 Ignored by channel                   03950000
CCW0CNT  DS    XL2                 Count                                04000000
CCW0END  DS    0C                  END of CW0                           04050000
         ORG   CCW0                                                     04100000
CCW1     DS    0D                Format 1 Channel Command Word          04150000
CCW1CMD  DS    CL1                 Command Code                         04200000
CCW1FLAG DS    CL1                 Flags                                04250000
CCW1CD   EQU   X'80'                - Chain data                        04300000
CCW1CC   EQU   X'40'                - Chain command                     04350000
CCW1SLI  EQU   X'20'                - Suppress Length Indication (SLI)  04400000
CCW1SKIP EQU   X'10'                - SKIP                              04450000
CCW1PCI  EQU   X'08'                - Program Controlled Interrupt      04500000
CCW1IDA  EQU   X'04'                - Indirect Data Address (IDAW)      04550000
CCW1S    EQU   X'02'                - Suspend Indicator                 04600000
CCW1CNT  DS    XL2                 Count                                04650000
CCW1ADDR DS    A                   Data Address                         04700000
CCW1END  DS    0C                  END of CCW1                          04750000
         MEND  ,       */                                               04800000
*%CCWL2: ;                                                              04850000
*%IF IOSDCCW0_STORAGE = '' %THEN  /* If base expression is not   @L2A*/ 04900000
*% IOSDCCW0_STORAGE = 'BASED';    /* set, then sets default.     @L2A*/ 04950000
*DCL 1  CCW0 IOSDCCW0_STORAGE                                           05000000
                 BDY(DWORD),    /* Format 0 Channel Command Word @L2C*/ 05050000
*     3 CCW0CMD BIT(8),           /* - Command Code (see DCLs below) */ 05100000
*     3 CCW0ADDR PTR(24),         /* - Data address                  */ 05150000
*     3 CCW0FLAG BIT(8),          /* - Flags                         */ 05200000
*      5 CCW0CD BIT(1),           /*   o Chain data                  */ 05250000
*      5 CCW0CC BIT(1),           /*   o Chain command               */ 05300000
*      5 CCW0SLI BIT(1),          /*   o Suppress length indication     05350000
*                                         (SLI).                     */ 05400000
*      5 CCW0SKIP BIT(1),         /*   o Skip                        */ 05450000
*      5 CCW0PCI BIT(1),          /*   o Program Controlled Interrupt*/ 05500000
*      5 CCW0IDA BIT(1),          /*   o Indirect Data Address-IDAW  */ 05550000
*      5 CCW0S   BIT(1),          /*   o Suspend indicator           */ 05600000
*     3  *  CHAR(1),              /* - Ignored by channel            */ 05650000
*     3 CCW0CNT FIXED(16);        /* - Count                     @01C*/ 05700000
*@SPACE (1);                                                            05750000
*%IF IOSDCCW1_STORAGE = '' %THEN  /* If base expression is not   @L2A*/ 05800000
*%IOSDCCW1_STORAGE = IOSDCCW0_STORAGE; /*set, then sets default. @L2A*/ 05850000
*DCL 1  CCW1 IOSDCCW1_STORAGE                                           05900000
                 BDY(DWORD),    /* Format 1 Channel Command Word @L2C*/ 05950000
*     3 CCW1CMD  BIT(8),          /* - Command                       */ 06000000
*     3 CCW1FLAG BIT(8),          /* - Flags                         */ 06050000
*      5 CCW1CD  BIT(1),          /*   o Chain data                  */ 06100000
*      5 CCW1CC  BIT(1),          /*   o Chain command               */ 06150000
*      5 CCW1SLI BIT(1),          /*   o Suppress length indication     06200000
*                                        (SLI)                       */ 06250000
*      5 CCW1SKIP BIT(1),         /*   o Skip                        */ 06300000
*      5 CCW1PCI  BIT(1),         /*   o Program controlled Interrupt*/ 06350000
*      5 CCW1IDA  BIT(1),         /*   o Indirect data Address-IDAW  */ 06400000
*      5 CCW1S    BIT(1),         /*   o suspend indicator           */ 06450000
*     3 CCW1CNT FIXED(16),        /*   o Count                   @01C*/ 06500000
*     3 CCW1ADDR PTR(31);         /* - Data address                  */ 06550000
*@SPACE (1);                                                            06600000
*/********************************************************************/ 06650000
*/*  Command Codes associated with  CCW0CMD AND CCW1CMD              */ 06700000
*/********************************************************************/ 06750000
*DCL CCWNOOP BIT(8) CONSTANT('03'X),  /* NO-OP                       */ 06800000
*    CCWSNS  BIT(8) CONSTANT('04'X),  /* Sense                       */ 06850000
*    CCWSNSI BIT(8) CONSTANT('E4'X),  /* Sense I/O                   */ 06900000
*    CCWTIC  BIT(8) CONSTANT('08'X);  /* Transfer In Channel (TIC)   */ 06950000
