*%GOTO HIDPRLG;               /*                                        00050000
         MACRO                                                          00100000
         IOSDHIDT &DVTHRSH=100,&DFLT110=,&DFLT111=,&DFLT112=,&SDFT110=,*00137500
               &SDFT111=,&SDFT112=                               @L2C*/ 00175000
*%HIDPRLG: ;                                                            00212500
*/**** Start of Specifications ***************************************/ 00256200
*/*                                                                  */ 00300000
*/*01* Macro Name: IOSDHIDT                                          */ 00350000
*/*                                                                  */ 00400000
*/*01* Descriptive Name: HOT I/O Detection Table                     */ 00450000
*/*                                                                  */ 00500000
*/*02*  Acronym: HIDT                                                */ 00550000
*/*                                                                  */ 00900000
*/*02*  Dsect Name: HIDT                                             */ 00950000
*/*                                                                  */ 01000000
*/*01* Proprietary Statement:                                        */ 01018700
*/*    5647-A01                                                      */ 01037400
*/*    This Macro is "RESTRICTED MATERIALS OF IBM"                   */ 01056100
*/*    (C) Copyright IBM Corp. 1982, 1998                            */ 01074800
*/*    Licensed Materials - Property of IBM                          */ 01093500
*/*                                                                  */ 01112200
*/*01* Status: HBB6606                                               */ 01130900
*/*                                                                  */ 01149600
*/*01* Component: I/O Supervisor (SC1C3)                             */ 01168300
*/*                                                                  */ 01187000
*/*01* Function: This macro maps the HOT I/O detection table.  It    */ 01205700
*/*              contains the threshold value used to determine      */ 01224400
*/*              if HOT I/O is occuring and contains anchors to      */ 01243100
*/*              control blocks used in determining and processing   */ 01261800
*/*              HOT I/O conditions.                                 */ 01280500
*/*                                                                  */ 01300000
*/*02* Notes: The assembler version of this macro is used to         */ 01320000
*/*           generate the CSECT.  The threshold and default         */ 01340000
*/*           processing flags can be altered by using the           */ 01360000
*/*           following keywords:                                    */ 01380000
*/*                                                                  */ 01400000
*/*            DVTHRSH - Device Threshold Value used to determine    */ 01450000
*/*                      how many consecutive unsolicited interrupts */ 01500000
*/*                      must occur for a given device before the    */ 01550000
*/*                      device is considered "hot".                 */ 01600000
*/*                                                                  */ 01700000
*/*                      Optional.                                   */ 01750000
*/*                                                                  */ 02000000
*/*                      Default = 100                               */ 02050000
*/*                                                                  */ 02200000
*/*            DFLT110, DFLT111 and DFLT112 are the parameters       */ 02210000
*/*            which are used to describe the default recovery       */ 02220000
*/*            actions for non-serial devices.                       */ 02230000
*/*                                                                  */ 02240000
*/*            DFLT110=(Non-recursive Recovery Action, Recursive     */ 02290000
*/*                     Recovery Action)                             */ 02340000
*/*                                                                  */ 03000000
*/*                     - Recovery processing action to be taken     */ 03023000
*/*                       in response to the conditions which        */ 03046000
*/*                       would result in the IOS110D message        */ 03069000
*/*                       being issued (ie: The hot device is not    */ 03092000
*/*                       DASD).  If a recovery action is supplied,  */ 03115000
*/*                       the IOS110D message will not be issued     */ 03138000
*/*                       since the reason for the message is to     */ 03161000
*/*                       obtain the recovery action from the        */ 03184000
*/*                       operator.  However, an informational       */ 03207000
*/*                       message (IOS109I) will be issued to inform */ 03230000
*/*                       the operator that a hot I/O condition has  */ 03253000
*/*                       occurred and the recovery action taken.    */ 03276000
*/*                                                                  */ 03300000
*/*                     - Valid action values are:                   */ 03350000
*/*                        CHPK - Try to recover the channel path    */ 03400000
*/*                               and leave it online if channel     */ 03450000
*/*                               path recovery is successful.       */ 03500000
*/*                                                                  */ 03550000
*/*                        CHPF - Force the channel path offline     */ 03570000
*/*                               (the same processing done for      */ 03590000
*/*                               the operator command 'VARY CHP(xx) */ 03610000
*/*                               FORCE' will be done).              */ 03630000
*/*                                                                  */ 03650000
*/*                        BOX  - Box the device                     */ 03700000
*/*                                                                  */ 03750000
*/*                      - Optional                                  */ 03800000
*/*                                                                  */ 03950000
*/*                      - Default - Issue the IOS110D message and   */ 04000000
*/*                                  obtain recovery action from     */ 04050000
*/*                                  the operator.                   */ 04100000
*/*                                                                  */ 04300000
*/*            DFLT111=(Non-recursive Recovery Action, Recursive     */ 04333300
*/*                     Recovery Action)                             */ 04366600
*/*                                                                  */ 04400000
*/*                     - Same as DFLT110, except that this variable */ 04418100
*/*                       is associated with the IOS111D message     */ 04436200
*/*                       (Ie: The Hot device is a non-reserved      */ 04454300
*/*                       DASD).                                     */ 04472400
*/*                                                                  */ 04490500
*/*                     - Optional                                   */ 04508600
*/*                                                                  */ 04526700
*/*                     - Default - Issue the IOS111D message and    */ 04544800
*/*                                 obtain recovery action from      */ 04562900
*/*                                 operator                         */ 04581000
*/*                                                                  */ 04600000
*/*                                                                  */ 04650000
*/*            DFLT112=(Non-recursive Recovery Action, Recursive     */ 04700000
*/*                     Recovery Action)                             */ 04750000
*/*                                                                  */ 05000000
*/*                     - Same as DFLT110, except that this variable */ 05025000
*/*                       is associated with the IOS112D message     */ 05050000
*/*                       (Ie: The hot device is a reserved DASD).   */ 05075000
*/*                                                                  */ 05100000
*/*                     - Optional                                   */ 05133300
*/*                                                                  */ 05166600
*/*                     - Default - Issue the IOS112D message and    */ 05199900
*/*                                 obtain recovery action from      */ 05233200
*/*                                 operator.                        */ 05266500
*/*                                                                  */ 05300000
*/*            SDFT110, SDFT111 and SDFT112 are the parameters       */ 05300800
*/*            which are used to describe the default recovery       */ 05301600
*/*            actions for serial devices.                           */ 05302400
*/*                                                                  */ 05303200
*/*              - valid actions are:                                */ 05304000
*/*                                                                  */ 05304800
*/*                CHPK - try to recover the channel path and        */ 05305600
*/*                       leave it online if channel path            */ 05306400
*/*                       recovery is successful                     */ 05307200
*/*                                                                  */ 05308000
*/*                CHPF - force the channel path offline,            */ 05308800
*/*                       (the same processing done for              */ 05309600
*/*                       the operator command V CHP(XX),FORCE       */ 05310400
*/*                       will be done)                              */ 05311200
*/*                                                                  */ 05312000
*/*                BOX  - box the device                             */ 05312800
*/*                                                                  */ 05313600
*/*                CUK  - let channel path recovery attempt          */ 05314400
*/*                       control unit recovery                      */ 05315200
*/*                                                                  */ 05316000
*/*                                                                  */ 05316800
*/*            SDFT110=(non-recursive recovery action, recursive     */ 05317600
*/*                     recovery action)                             */ 05318400
*/*                                                                  */ 05319200
*/*                      - specifies the recovery action to be       */ 05320000
*/*                        taken for a non-DASD, non-dynamic         */ 05320800
*/*                        pathing device.                           */ 05321600
*/*                                                                  */ 05322400
*/*                      - OPTIONAL                                  */ 05323200
*/*                                                                  */ 05324000
*/*                      - DEFAULT = Issue IOS110D message and       */ 05324800
*/*                                  obtain recovery action from     */ 05325600
*/*                                  operator.                       */ 05326400
*/*                                                                  */ 05327200
*/*            SDFT111=(non-recursive recovery action, recursive     */ 05328000
*/*                     recovery action)                             */ 05328800
*/*                                                                  */ 05329600
*/*                      - specifies the recovery action to be taken */ 05330400
*/*                        for a DASD or dynamic pathing device      */ 05331200
*/*                        that is not reserved/assigned.            */ 05332000
*/*                                                                  */ 05332800
*/*                      - OPTIONAL                                  */ 05333600
*/*                                                                  */ 05334400
*/*                      - DEFAULT = Issue IOS111D message and       */ 05335200
*/*                                  obtain recovery action from     */ 05336000
*/*                                  operator.                       */ 05336800
*/*                                                                  */ 05337600
*/*                                                                  */ 05338400
*/*            SDFT112=(non-recursive recovery action, recursive     */ 05339200
*/*                     recovery action)                             */ 05340000
*/*                                                                  */ 05340800
*/*                      - specifies the recovery action to be taken */ 05341600
*/*                        for a DASD or a dynamic pathing device    */ 05342400
*/*                        that is reserved/assigned.                */ 05343200
*/*                                                                  */ 05344000
*/*                      - OPTIONAL                                  */ 05344800
*/*                                                                  */ 05345600
*/*                      - DEFAULT = Issue IOS112D message and       */ 05346400
*/*                                  obtain recovery action from     */ 05347200
*/*                                  operator.                       */ 05348000
*/*                                                                  */ 05348800
*/*01* Eye-Catcher: 'IOSRHIDT'                                       */ 05374100
*/*02*  Offset: 0                                                    */ 05399400
*/*02*  Length: 8                                                    */ 05424700
*/*                                                                  */ 05450000
*/*01* Created by: IOSRHIDT                                          */ 05500000
*/*                                                                  */ 05550000
*/*01* Deleted by: N/A                                               */ 05600000
*/*                                                                  */ 05650000
*/*01* Pointed to by: N/A                                            */ 05700000
*/*                                                                  */ 05750000
*/*01* Size: 170-Bytes                                               */ 05800000
*/*                                                                  */ 05900000
*/*01* Module Type: Control Block                                    */ 05902800
*/*                                                                  */ 05905600
*/*01* Method of Access:                                             */ 05908400
*/*                                                                  */ 05911200
*/*     ASM:  IOSDHIDT                                               */ 05914000
*/*                                                                  */ 05916800
*/*     PL/X: %DCL HIDTDEF CHAR                                      */ 05919600
*/*           %HIDTDEF=value                                         */ 05922400
*/*             value = Basing expression to base the HIDT area.     */ 05925200
*/*                     Default= 'BASED'                             */ 05928000
*/*                                                                  */ 05930800
*/*           %INCLUDE SYSLIB(IOSDHIDT)                              */ 05933600
*/*                                                                  */ 05936400
*/*01* Dependencies: None                                            */ 05939200
*/*                                                                  */ 05942000
*/*01* Restrictions: For IOS use only                                */ 05944800
*/*                                                                  */ 05947600
*/*01* Serialization: HIDHOTQ, HIDSCDAN and HIDCPCNT are serialized  */ 05950400
*/*                   via the HOT I/O Synchronization Lock           */ 05953200
*/*                                                                  */ 05956000
*/*01* Storage Attributes:                                           */ 05958800
*/*                                                                  */ 05961600
*/*02*  Subpool: 245                                                 */ 05964400
*/*02*  Key: 0                                                       */ 05967200
*/*02*  Data Space: N/A                                              */ 05970000
*/*02*  Residency: Nucleus                                           */ 05972800
*/*02*  Frequency: 1 per system                                      */ 05975600
*/*                                                                  */ 05978400
*/*01* Distribution Library (DLIB): AMODGEN                          */ 05981200
*/*                                                                  */ 05984000
*/*01* External Classification: DMTI                             @P1C*/ 05986800
*/*01* End of External Classification:                               */ 05989600
*/*                                                                  */ 05992400
*/*01* Change Activity:                                              */ 05995200
*/*                                                                  */ 06000000
*/*  $MAC(IOSDHIDT),COMP(SC1C3):                                     */ 06050000
*/*   A-000000-999999   NEW FOR HBB2102                      @G860PLT*/ 06100000
*/*                                                                  */ 06125000
*/*  $D1=DCR055,JBB2220,850403,PDLC: Change HIDT defaults            */ 06150000
*/*  $L1=VERS  ,HBB3310,860416,PDLE: Versioning macro into product   */ 06200000
*/*                                                              @L1A*/ 06250000
*/*  $L2=SNWY2  HBB4410 890814 PDLS: Sunway II support           @L2A*/ 06275000
*/*  $L3=CPRAI  HBB6606 971208 PDNO: Channel Path Recovery and       */ 06284300
*/*                                  Availability Improvements.      */ 06293600
*/*                                  Also, made prolog SHOWHDR       */ 06302900
*/*                                  compliant (No change flags      */ 06312200
*/*                                  added to prolog)            @L3A*/ 06321500
*/*                                                                  */ 06323300
*/*  $P1=PVT0382 HBB6606 970119 PDNO: External classification should */ 06325100
*/*                                  be changed from NONE to DMTI.   */ 06326900
*/*                                                              @P1A*/ 06328700
*/*                                                                  */ 06330800
*/**** End of Specifications *****************************************/ 06340100
*%GOTO   HIDPC;                    /*                                   06350000
         LCLC  &ACTION                                                  06400000
&ACTION  SETC  '00'                                                     06450000
         SPACE 1                                                        06500000
IOSRHIDT AMODE 31                                                       06550000
IOSRHIDT RMODE ANY                                                      06600000
HIDT     DS    0D             HOT I/O DETECTION TABLE                   06650000
HIDMODID DC    XL24'00'       INITIALIZE MODID FIELD TO 0               06700000
         ORG   HIDMODID                                                 06750000
         MODID BRANCH=NO      FILL IN MODID INFORMATION                 06800000
         ORG   HIDMODID+24    ENSURE THAT MODID HAS NOT GENERATED      X06850000
                              MORE THAN 24 BYTES OF DATA                06900000
HIDDVTHR DC    H'&DVTHRSH'    DEVICE THRESHOLD                          06950000
         DC    XL2'00'        RESERVED                                  07000000
.N110    ANOP          PROCESS NON-RECURSION DEFAULTS FOR 110 MESSAGE   07050000
         AIF   ('&DFLT110(1)' NE 'CHPK').N110F DEFAULT NOT CHANNEL     X07100000
                                             PATH RECOVERY KEEP         07150000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                07200000
         AGO   .N110C  GO CALCULATE NON RECURSION BYTE                  07250000
.N110F   ANOP                                                           07300000
         AIF   ('&DFLT110(1)' NE 'CHPF').N110B DEFAULT NOT CHPF         07350000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                07400000
         AGO   .N110C  GO CALCULATE NON RECURSION BYTE                  07450000
.N110B   ANOP                                                           07500000
         AIF   ('&DFLT110(1)' NE 'BOX').N110ND DEFAULT NOT BOX          07550000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 07600000
         AGO   .N110C  GO CALCULATE NON RECURSION BYTE                  07650000
.N110ND  ANOP          NO VALID DEFAULT SUPPLIED                        07700000
         AIF   ('&DFLT110(1)' EQ '').N110C  DEFAULT NOT SUPPLIED        07750000
.*        INVALID DEFAULT CODED                                         07800000
          MNOTE 4,'*** &DFLT110(1) INVALID NON-RECURSION VALUE FOR DFLTX07850000
               110. VALUE IGNORED.'                                     07900000
.N110C   ANOP                                                           07950000
*         VALID DEFAULT RECOVERY ACTIONS FOR NON-SERIAL DEVICES         08000000
*                     00 - OBTAIN RECOVERY ACTION FROM THE OPERATOR     08050000
*                     02 - BOX THE HOT DEVICE                           08100000
*                     04 - PERFORM CHANNEL PATH RECOVERY                08150000
*                     05 - FORCE THE CHANNEL PATH OFFLINE               08200000
*                                                                       08250000
*        DEFAULT NON-SERIAL DEVICE ACTIONS FOR MESSAGE IOS110D          08300000
HID110DN DC    XL1'&ACTION'   IF NOT RECURSION                          08350000
&ACTION  SETC  '00'                                                     08400000
.R110    ANOP          PROCESS RECURSION DEFAULTS FOR 110 MESSAGE       08450000
         AIF   ('&DFLT110(2)' NE 'CHPK').R110F  DEFAULT NOT CHANNEL    X08500000
                                               PATH RECOVERY KEEP       08550000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                08600000
         AGO   .C110   CALCULATE BYTE CONTENTS                          08650000
.R110F   ANOP                                                           08700000
         AIF   ('&DFLT110(2)' NE 'CHPF').R110B  DEFAULT NOT CHPF        08750000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                08800000
         AGO   .C110   CALCULATE BYTE CONTENTS                          08850000
.R110B   ANOP                                                           08900000
         AIF   ('&DFLT110(2)' NE 'BOX').R110ND  DEFAULT NOT BOX         08950000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 09000000
         AGO   .C110   CALCULATE BYTE CONTENTS                          09050000
.R110ND  ANOP          NO VALID DEFAULT SUPPLIED                        09100000
         AIF   ('&DFLT110(2)' EQ '').R110NS     DEFAULT NOT SUPPLIED    09150000
.*        INVALID DEFAULT CODED                                         09200000
         MNOTE 4,'*** &DFLT110(2) INVALID RECURSION VALUE FOR DFLT110. X09250000
               VALUE IGNORED.'                                          09300000
.R110NS  ANOP                                                           09350000
.**** CALCULATE BYTE CONTENTS FOR 110 MESSAGE DEFAULTS                  09400000
.C110    ANOP                                                           09450000
HID110DR DC    XL1'&ACTION'   ON RECURSION                              09500000
&ACTION  SETC  '00'                                                     09550000
.N111    ANOP          PROCESS NON-RECURSION DEFAULTS FOR 111 MESSAGE   09600000
         AIF   ('&DFLT111(1)' NE 'CHPK').N111F DEFAULT NOT CHANNEL PATHX09650000
                                               RECOVERY KEEP            09700000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                09750000
         AGO   .N111C  GO CALCULATE NON RECURSION BYTE                  09800000
.N111F   ANOP                                                           09850000
         AIF   ('&DFLT111(1)' NE 'CHPF').N111B  DEFAULT NOT CHPF        09900000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                09950000
         AGO   .N111C  GO CALCULATE NON RECURSION BYTE                  10000000
.N111B   ANOP                                                           10050000
         AIF   ('&DFLT111(1)' NE 'BOX').N111ND  DEFAULT NOT BOX         10100000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 10150000
         AGO   .N111C  GO CALCULATE NON RECURSION BYTE                  10200000
.N111ND  ANOP          NO VALID DEFAULT SUPPLIED                        10250000
         AIF   ('&DFLT111(1)' EQ '').N111C      DEFAULT NOT SUPPLIED    10300000
.*        INVALID DEFAULT CODED                                         10350000
         MNOTE 4,'*** &DFLT111(1) INVALID NON-RECURSION VALUE FOR DFLT1X10400000
               11. VALUE IGNORED.'                                      10450000
.N111C   ANOP                                                           10500000
*                                                                       10550000
*        DEFAULT NON-SERIAL DEVICE ACTIONS FOR MESSAGE IOS111D          10600000
HID111DN DC    XL1'&ACTION'   IF NOT RECURSION                          10650000
&ACTION  SETC  '00'                                                     10700000
.R111    ANOP          PROCESS RECURSION DEFAULTS FOR 111 MESSAGE       10750000
         AIF   ('&DFLT111(2)' NE 'CHPK').R111F DEFAULT NOT CHANNEL PATHX10800000
                                               RECOVERY KEEP            10850000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                10900000
         AGO   .C111   CALCULATE BYTE CONTENTS                          10950000
.R111F   ANOP                                                           11000000
         AIF   ('&DFLT111(2)' NE 'CHPF').R111B  DEFAULT NOT CHPF        11050000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                11100000
         AGO   .C111   CALCULATE BYTE CONTENTS                          11150000
.R111B   ANOP                                                           11200000
         AIF   ('&DFLT111(2)' NE 'BOX').R111ND  DEFAULT NOT BOX         11250000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 11300000
         AGO   .C111   CALCULATE BYTE CONTENTS                          11350000
.R111ND  ANOP          NO VALID DEFAULT SUPPLIED                        11400000
         AIF   ('&DFLT111(2)' EQ '').R111NS     DEFAULT NOT SUPPLIED    11450000
.*        INVALID DEFAULT CODED                                         11500000
         MNOTE 4,'*** &DFLT111(2) INVALID RECURSION VALUE FOR DFLT111. X11550000
               VALUE IGNORED.'                                          11600000
.R111NS  ANOP                                                           11650000
.**** CALCULATE BYTE CONTENTS FOR 111 MESSAGE DEFAULTS                  11700000
.C111    ANOP                                                           11750000
HID111DR DC    XL1'&ACTION'   ON RECURSION                              11800000
&ACTION  SETC  '00'                                                     11850000
.N112    ANOP          PROCESS NON-RECURSION DEFAULTS FOR 112 MESSAGE   11900000
         AIF   ('&DFLT112(1)' NE 'CHPK').N112F DEFAULT NOT CHANNEL PATHX11950000
                                               RECOVERY KEEP            12000000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                12050000
         AGO   .N112C  GO CALCULATE NON RECURSION BYTE                  12100000
.N112F   ANOP                                                           12150000
         AIF   ('&DFLT112(1)' NE 'CHPF').N112B  DEFAULT NOT CHPF        12200000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                12250000
         AGO   .N112C  GO CALCULATE NON RECURSION BYTE                  12300000
.N112B   ANOP                                                           12350000
         AIF   ('&DFLT112(1)' NE 'BOX').N112ND  DEFAULT NOT BOX         12400000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 12450000
         AGO   .N112C  GO CALCULATE NON RECURSION BYTE                  12500000
.N112ND  ANOP          NO VALID DEFAULT SUPPLIED                        12550000
         AIF   ('&DFLT112(1)' EQ '').N112C      DEFAULT NOT SUPPLIED    12600000
.*        INVALID DEFAULT CODED                                         12650000
         MNOTE 4,'*** &DFLT112(1) INVALID NON-RECURSION VALUE FOR DFLT1X12700000
               12. VALUE IGNORED.'                                      12750000
.N112C   ANOP                                                           12800000
*                                                                       12850000
*        DEFAULT NON-SERIAL DEVICE ACTIONS FOR MESSAGE IOS112D          12900000
HID112DN DC    XL1'&ACTION'   IF NOT RECURSION                          12950000
&ACTION  SETC  '00'                                                     13000000
.R112    ANOP          PROCESS RECURSION DEFAULTS FOR 112 MESSAGE       13050000
         AIF   ('&DFLT112(2)' NE 'CHPK').R112F DEFAULT NOT CHANNEL PATHX13100000
                                               RECOVERY KEEP            13150000
&ACTION  SETC  '04'      DEFAULT IS CHPK                                13200000
         AGO   .C112   CALCULATE BYTE CONTENTS                          13250000
.R112F   ANOP                                                           13300000
         AIF   ('&DFLT112(2)' NE 'CHPF').R112B  DEFAULT NOT CHPF        13350000
&ACTION  SETC  '05'      DEFAULT IS CHPF                                13400000
         AGO   .C112   CALCULATE BYTE CONTENTS                          13450000
.R112B   ANOP                                                           13500000
         AIF   ('&DFLT112(2)' NE 'BOX').R112O   DEFAULT NOT BOX    @D1C 13550000
&ACTION  SETC  '02'      DEFAULT IS BOX                                 13600000
         AGO   .C112   CALCULATE BYTE CONTENTS                          13650000
.R112O   ANOP                                                      @D1A 13700000
         AIF   ('&DFLT112(2)' NE 'OPER').R112ND  DEFAULT NOT OPER  @D1A 13750000
         AGO   .C112   CALCULATE BYTE CONTENTS                     @D1A 13800000
.R112ND  ANOP          NO VALID DEFAULT SUPPLIED                        13850000
         AIF   ('&DFLT112(2)' EQ '').R112NS     DEFAULT NOT SUPPLIED    13900000
.*        INVALID DEFAULT CODED                                         13950000
         MNOTE 4,'*** &DFLT112(2) INVALID RECURSION VALUE FOR DFLT112. X14000000
               VALUE IGNORED.'                                          14050000
.R112NS  ANOP                                                           14100000
.**** CALCULATE BYTE CONTENTS FOR 112 MESSAGE DEFAULTS                  14150000
.C112    ANOP                                                           14200000
HID112DR DC    XL1'&ACTION'   ON RECURSION                              14250000
         DC    XL1'00'        Reserved                           @L3C   14275000
HIDTBLPM DC    XL1'00'        Box Last Path Mask set by the HOTIO       14300000
*                             BOX_LP option in IECIOSxx.         @L3A   14325000
HIDSCDPT DS    0XL68          SCD POINTERS                              14350000
HIDHOTQ  DC    F'00'          ANCHOR FOR THE QUEUE OF SCD FOR WHICH    X14400000
                              HOTIO HAS BEEN DETECTED. SERIALIZE USING X14450000
                              THE HOTIO SYNC LOCK                       14500000
HIDSCDAN DC    16F'00'        ANCHORS FOR SCD BLOCKS. THE 2ND BYTE OF  X14550000
                              THE DEVICE NUMBER (IE 0X00) DETERMINES   X14600000
                              WHICH SCD QUEUE THE DEVICE WILL BE       X14650000
                              ASSIGNED TO. THIS SEPARATION IS USED     X14700000
                              ONLY TO PROVIDE A FASTER SEARCH FOR A    X14750000
                              PARTICULAR SCD                            14800000
HIDCPCNT DC    256XL1'00'     NUMBER OF CURRENTLY HOT DEVICES PER      X14850000
                              CHANNEL PATH                              14900000
&ACTION  SETC  '00'                                                @L2A 14900200
.N110S   ANOP    PROCESS NON-RECURSION SERIAL 110 MESSAGE DEFAULTS @L2A 14900400
         AIF   ('&SDFT110(1)' NE 'CHPK').N110FS DEFAULT NOT CHANNEL    X14900600
                                             PATH RECOVERY KEEP    @L2A 14900800
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14901000
         AGO   .N110CS GO CALCULATE NON RECURSION BYTE             @L2A 14901200
.N110FS  ANOP                                                      @L2A 14901400
         AIF   ('&SDFT110(1)' NE 'CHPF').N110BS DEFAULT NOT CHPF   @L2A 14901600
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14901800
         AGO   .N110CS GO CALCULATE NON RECURSION BYTE             @L2A 14902000
.N110BS  ANOP                                                      @L2A 14902200
         AIF   ('&SDFT110(1)' NE 'CUK').N110ES  DEFAULT NOT CUK    @L2A 14902400
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14902600
         AGO   .N110CS GO CALCULATE NON RECURSION BYTE             @L2A 14902800
.N110ES  ANOP                                                      @L2A 14903000
         AIF   ('&SDFT110(1)' NE 'BOX').N110NDS DEFAULT NOT BOX    @L2A 14903200
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14903400
         AGO   .N110CS GO CALCULATE NON RECURSION BYTE             @L2A 14903600
.N110NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14903800
         AIF   ('&SDFT110(1)' EQ '').N110CS DEFAULT NOT SUPPLIED   @L2A 14904000
.*        INVALID DEFAULT CODED                                    @L2A 14904200
          MNOTE 4,'*** &SDFT110(1) INVALID NON-RECURSION VALUE FOR SDFTX14904400
               110. VALUE IGNORED.'                                @L2A 14904600
.N110CS  ANOP                                                      @L2A 14904800
*        VALID DEFAULT RECOVERY ACTIONS FOR SERIAL DEVICES         @L2A 14905000
*              00 - OBTAIN RECOVERY ACTION FROM THE OPERATOR       @L2A 14905200
*              02 - BOX THE HOT DEVICE                             @L2A 14905400
*              04 - PERFORM CHANNEL PATH RECOVERY                  @L2A 14905600
*              05 - FORCE THE CHANNEL PATH OFFLINE                 @L2A 14905800
*              06 - PERFORM CONTROL UNIT RECOVERY                  @L2A 14906000
*                                                                  @L2A 14906200
*        DEFAULT SERIAL DEVICE ACTIONS FOR MESSAGE IOS110D         @L2A 14906400
HID110SN DC    XL1'&ACTION'   IF NOT RECURSION                     @L2A 14906600
&ACTION  SETC  '00'                                                @L2A 14906800
.R110S   ANOP    PROCESS SERIAL RECURSION DEFAULTS FOR 110 MESSAGE @L2A 14907000
         AIF   ('&SDFT110(2)' NE 'CHPK').R110FS DEFAULT NOT CHANNEL    X14907200
                                               PATH RECOVERY KEEP  @L2A 14907400
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14907600
         AGO   .C110S  CALCULATE BYTE CONTENTS                     @L2A 14907800
.R110FS  ANOP                                                      @L2A 14908000
         AIF   ('&SDFT110(2)' NE 'CHPF').R110BS DEFAULT NOT CHPF   @L2A 14908200
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14908400
         AGO   .C110S  CALCULATE BYTE CONTENTS                     @L2A 14908600
.R110BS  ANOP                                                      @L2A 14908800
         AIF   ('&SDFT110(2)' NE 'CUK').R110ES  DEFAULT NOT CUK    @L2A 14909000
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14909200
         AGO   .N110CS CALCULATE BYTE CONTENTS                     @L2A 14909400
.R110ES  ANOP                                                      @L2A 14909600
         AIF   ('&SDFT110(2)' NE 'BOX').R110NDS DEFAULT NOT BOX    @L2A 14909800
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14910000
         AGO   .C110S  CALCULATE BYTE CONTENTS                     @L2A 14910200
.R110NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14910400
         AIF   ('&SDFT110(2)' EQ '').R110NSS  DEFAULT NOT SUPPLIED @L2A 14910600
.*        INVALID DEFAULT CODED                                    @L2A 14910800
         MNOTE 4,'*** &SDFT110(2) INVALID RECURSION VALUE FOR SDFT110. X14911000
               VALUE IGNORED.'                                     @L2A 14911200
.R110NSS ANOP                                                      @L2A 14911400
.**** CALCULATE BYTE CONTENTS FOR 110 MESSAGE DEFAULTS             @L2A 14911600
.C110S   ANOP                                                      @L2A 14911800
HID110SR DC    XL1'&ACTION'   ON RECURSION                         @L2A 14912000
&ACTION  SETC  '00'                                                @L2A 14912200
.N111S   ANOP     PROCESS SERIAL NON-RECURSION DEFAULTS FOR 111        X14912400
                  MESSAGE                                          @L2A 14912600
         AIF   ('&SDFT111(1)' NE 'CHPK').N111FS DEFAULT NOT CHANNEL    X14912800
                                                PATH RECOVERY KEEP @L2A 14913000
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14913200
         AGO   .N111CS GO CALCULATE NON RECURSION BYTE             @L2A 14913400
.N111FS  ANOP                                                      @L2A 14913600
         AIF   ('&SDFT111(1)' NE 'CHPF').N111BS DEFAULT NOT CHPF   @L2A 14913800
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14914000
         AGO   .N111CS GO CALCULATE NON RECURSION BYTE             @L2A 14914200
.N111BS  ANOP                                                      @L2A 14914400
         AIF   ('&SDFT111(1)' NE 'CUK').N111ES  DEFAULT NOT CUK    @L2A 14914600
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14914800
         AGO   .N111CS GO CALCULATE NON RECURSION BYTE             @L2A 14915000
.N111ES  ANOP                                                      @L2A 14915200
         AIF   ('&SDFT111(1)' NE 'BOX').N111NDS DEFAULT NOT BOX    @L2A 14915400
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14915600
         AGO   .N111CS GO CALCULATE NON RECURSION BYTE             @L2A 14915800
.N111NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14916000
         AIF   ('&SDFT111(1)' EQ '').N111CS   DEFAULT NOT SUPPLIED @L2A 14916200
.*        INVALID DEFAULT CODED                                    @L2A 14916400
         MNOTE 4,'*** &SDFT111(1) INVALID NON-RECURSION VALUE FOR SDFT1X14916600
               11. VALUE IGNORED.'                                 @L2A 14916800
.N111CS  ANOP                                                      @L2A 14917000
*                                                                  @L2A 14917200
*        DEFAULT SERIAL DEVICE ACTIONS FOR MESSAGE IOS111D         @L2A 14917400
HID111SN DC    XL1'&ACTION'   IF NOT RECURSION                     @L2A 14917600
&ACTION  SETC  '00'                                                @L2A 14917800
.R111S   ANOP    PROCESS SERIAL RECURSION DEFAULTS FOR 111 MESSAGE @L2A 14918000
         AIF   ('&SDFT111(2)' NE 'CHPK').R111FS DEFAULT NOT CHANNEL    X14918200
                                               PATH RECOVERY KEEP  @L2A 14918400
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14918600
         AGO   .C111S  CALCULATE BYTE CONTENTS                     @L2A 14918800
.R111FS  ANOP                                                      @L2A 14919000
         AIF   ('&SDFT111(2)' NE 'CHPF').R111BS DEFAULT NOT CHPF   @L2A 14919200
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14919400
         AGO   .C111S  CALCULATE BYTE CONTENTS                     @L2A 14919600
.R111BS  ANOP                                                      @L2A 14919800
         AIF   ('&SDFT111(2)' NE 'CUK').R111ES  DEFAULT NOT CUK    @L2A 14920000
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14920200
         AGO   .N111CS CALCULATE BYTE CONTENTS                     @L2A 14920400
.R111ES  ANOP                                                      @L2A 14920600
         AIF   ('&SDFT111(2)' NE 'BOX').R111NDS DEFAULT NOT BOX    @L2A 14920800
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14921000
         AGO   .C111S  CALCULATE BYTE CONTENTS                     @L2A 14921200
.R111NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14921400
         AIF   ('&SDFT111(2)' EQ '').R111NSS  DEFAULT NOT SUPPLIED @L2A 14921600
.*        INVALID DEFAULT CODED                                    @L2A 14921800
         MNOTE 4,'*** &SDFT111(2) INVALID RECURSION VALUE FOR SDFT111. X14922000
               VALUE IGNORED.'                                     @L2A 14922200
.R111NSS ANOP                                                      @L2A 14922400
.**** CALCULATE BYTE CONTENTS FOR 111 MESSAGE DEFAULTS             @L2A 14922600
.C111S   ANOP                                                      @L2A 14922800
HID111SR DC    XL1'&ACTION'   ON RECURSION                         @L2A 14923000
&ACTION  SETC  '00'                                                @L2A 14923200
.N112S   ANOP     PROCESS SERIAL NON-RECURSION DEFAULTS FOR 112        X14923400
                  MESSAGE                                          @L2A 14923600
         AIF   ('&SDFT112(1)' NE 'CHPK').N112FS DEFAULT NOT CHANNEL    X14923800
                                                PATH RECOVERY KEEP @L2A 14924000
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14924200
         AGO   .N112CS GO CALCULATE NON RECURSION BYTE             @L2A 14924400
.N112FS  ANOP                                                      @L2A 14924600
         AIF   ('&SDFT112(1)' NE 'CHPF').N112BS DEFAULT NOT CHPF   @L2A 14924800
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14925000
         AGO   .N112CS GO CALCULATE NON RECURSION BYTE             @L2A 14925200
.N112BS  ANOP                                                      @L2A 14925400
         AIF   ('&SDFT112(1)' NE 'CUK').N112ES  DEFAULT NOT CUK    @L2A 14925600
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14925800
         AGO   .N112CS GO CALCULATE NON RECURSION BYTE             @L2A 14926000
.N112ES  ANOP                                                      @L2A 14926200
         AIF   ('&SDFT112(1)' NE 'BOX').N112NDS DEFAULT NOT BOX    @L2A 14926400
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14926600
         AGO   .N112CS GO CALCULATE NON RECURSION BYTE             @L2A 14926800
.N112NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14927000
         AIF   ('&SDFT112(1)' EQ '').N112CS   DEFAULT NOT SUPPLIED @L2A 14927200
.*        INVALID DEFAULT CODED                                    @L2A 14927400
         MNOTE 4,'*** &SDFT112(1) INVALID NON-RECURSION VALUE FOR SDFT1X14927600
               12. VALUE IGNORED.'                                 @L2A 14927800
.N112CS  ANOP                                                      @L2A 14928000
*                                                                  @L2A 14928200
*        DEFAULT SERIAL DEVICE ACTIONS FOR MESSAGE IOS112D         @L2A 14928400
HID112SN DC    XL1'&ACTION'   IF NOT RECURSION                     @L2A 14928600
&ACTION  SETC  '00'                                                @L2A 14928800
.R112S   ANOP    PROCESS SERIAL RECURSION DEFAULTS FOR 112 MESSAGE @L2A 14929000
         AIF   ('&SDFT112(2)' NE 'CHPK').R112FS DEFAULT NOT CHANNEL    X14929200
                                                PATH RECOVERY KEEP @L2A 14929400
&ACTION  SETC  '04'      DEFAULT IS CHPK                           @L2A 14929600
         AGO   .C112S  CALCULATE BYTE CONTENTS                     @L2A 14929800
.R112FS  ANOP                                                      @L2A 14930000
         AIF   ('&SDFT112(2)' NE 'CHPF').R112BS DEFAULT NOT CHPF   @L2A 14930200
&ACTION  SETC  '05'      DEFAULT IS CHPF                           @L2A 14930400
         AGO   .C112S  CALCULATE BYTE CONTENTS                     @L2A 14930600
.R112BS  ANOP                                                      @L2A 14930800
         AIF   ('&SDFT112(2)' NE 'CUK').R112ES  DEFAULT NOT CUK    @L2A 14931000
&ACTION  SETC  '06'      DEFAULT IS CONTORL UNIT RECOVERY          @L2A 14931200
         AGO   .N111CS CALCULATE BYTE CONTENTS                     @L2A 14931400
.R112ES  ANOP                                                      @L2A 14931600
         AIF   ('&SDFT112(2)' NE 'BOX').R112OS  DEFAULT NOT BOX    @L2A 14931800
&ACTION  SETC  '02'      DEFAULT IS BOX                            @L2A 14932000
         AGO   .C112S  CALCULATE BYTE CONTENTS                     @L2A 14932200
.R112OS  ANOP                                                      @L2A 14932400
         AIF   ('&SDFT112(2)' NE 'OPER').R112NDS DEFAULT NOT OPER  @L2A 14932600
         AGO   .C112S  CALCULATE BYTE CONTENTS                     @L2A 14932800
.R112NDS ANOP          NO VALID DEFAULT SUPPLIED                   @L2A 14933000
         AIF   ('&SDFT112(2)' EQ '').R112NSS  DEFAULT NOT SUPPLIED @L2A 14933200
.*        INVALID DEFAULT CODED                                    @L2A 14933400
         MNOTE 4,'*** &SDFT112(2) INVALID RECURSION VALUE FOR SDFT112. X14933600
               VALUE IGNORED.'                                     @L2A 14933800
.R112NSS ANOP                                                      @L2A 14934000
.**** CALCULATE BYTE CONTENTS FOR 112 MESSAGE DEFAULTS             @L2A 14934200
.C112S   ANOP                                                      @L2A 14934400
HID112SR DC    XL1'&ACTION'   ON RECURSION                         @L2A 14934600
         DC    XL2'00'        RESERVED                             @L2A 14934800
         MEND                 */                                        14950000
*%HIDPC: ;                                                              15000000
*%IF HIDTDEF='' %THEN                                                   15050000
*   %GOTO HIDT100;                                                      15100000
*  DCL 1 HIDT HIDTDEF,              /* Hot I/O detection table       */ 15150000
*   %GOTO HIDT200;                                                      15200000
*%HIDT100: ;                                                            15250000
*  DCL 1 HIDT BASED,                /* Hot I/O detection table       */ 15300000
*%HIDT200: ;                                                            15350000
*        3 HIDMODID CHAR(24),      /* MODID information              */ 15400000
*        3 HIDDVTHR  FIXED(16),    /* Device threshold               */ 15450000
*        3 *        FIXED(16),     /* Reserved                       */ 15500000
*        3 HIDRVDFT,              /* Default recovery actions for       15533300
*                                    non-serial devices.             */ 15566600
*           5 HIDMSGDT (3,2) FIXED(8), /*Message defaults.              15600000
*                                     First Index:                      15650000
*                                       01=110D message defaults.       15700000
*                                       02=111D message defaults.       15750000
*                                       03=112D message defaults.       15800000
*                                     Second Index:                     15850000
*                                      01=Non-recursion.                15900000
*                                      02=Recursion.                 */ 15950000
*        3 *        BIT(8),       /*  Reserved                   @L3C*/ 15970000
*        3 HIDTBLPM BIT(8),       /*  Box Last Path Mask set by the     15990000
*                                     HOTIO BOX_LP keyword in           16010000
*                                     IECIOSxx.                  @L3A*/ 16030000
*        3 HIDSCDPT,               /* SCD pointers                   */ 16050000
*          5 HIDHOTQ  PTR(31),     /* Anchor for the Queue of SCD for   16100000
*                                     which HOTIO has been detected. */ 16150000
*          5 HIDSCDAN(0:15) PTR(31),/* Anchors for SCD blocks. The 2nd  16200000
*                                     byte of the device number (ie     16250000
*                                     0X00) determines which SCD queue  16300000
*                                     the device will be assigned to.   16350000
*                                     This separation is used only to   16400000
*                                     provide a faster search for a     16450000
*                                     particular SCD                 */ 16500000
*        3 HIDCPCNT (0:255) FIXED(8), /* Number of currently hot        16550000
*                                     devices per channel path       */ 16600000
*        3 HIDSRECD,              /* Default recovery actions for       16604100
*                                    serial devices.             @L2A*/ 16608200
*           5 HIDSMSGD (3,2) FIXED(8), /* Serial message defaults.      16612300
*                                     First Index:                      16616400
*                                       01=110D message defaults.       16620500
*                                       02=111D message defaults.       16624600
*                                       03=112D message defaults.       16628700
*                                     Second Index:                     16632800
*                                      01=Non-recursion.                16636900
*                                      02=Recursion.             @L2A*/ 16641000
*        3 *        CHAR(2),       /* Reserved                   @L2A*/ 16645100
*        3 HIDEND   CHAR(0);                                            16650000
*@SPACE(3);                                                             16700000
*   /* Constants for HIDMSGDT and HIDSMSGD                           */ 16750000
*   DCL  HIDBOX FIXED(8) CONSTANT(02);/* Box the device              */ 16800000
*   DCL  HIDCHPK FIXED(8) CONSTANT(04);/* Channel path recovery      */ 16850000
*   DCL  HIDCHPF FIXED(8) CONSTANT(05);/* Force channel path offline */ 16900000
*   DCL  HIDCUK  FIXED(8) CONSTANT(06);/* Control unit recovery. This   16920000
*                                         constant is only valid for    16940000
*                                         HIDSMSGD.              @L2A*/ 16960000
*   /* Constants for first index of HIDMSGDT and HIDSMSGD            */ 16980000
*   DCL MSG110   FIXED(8)  CONSTANT(01);                                17000000
*   DCL MSG111   FIXED(8)  CONSTANT(02);                                17050000
*   DCL MSG112   FIXED(8)  CONSTANT(03);                                17100000
*   /* Constants for second index of HIDMSGDT and HIDSMSGD           */ 17150000
*   DCL RECURSN  FIXED(8)  CONSTANT(02);                                17200000
*   DCL NONRECUR FIXED(8)  CONSTANT(01);                                17250000
*%DEACT HIDTDEF;                                                        17300000
