*%GOTO IOPT1;              /*                                           00050000
         MACRO                                                          00100000
         IOSDIOPT                                                       00150000
         SPACE 1            */                                          00200000
*%IOPT1 : ;                                                             00250000
*/********************************************************************/ 00300000
*/*                                                                  */ 00350000
*/*01*   MACRO NAME - IOSDIOPT                                       */ 00400000
*/*                                                                  */ 00450000
*/*01*   DESCRIPTIVE NAME = IOPT - I/O Prevention Table entry        */ 00500000
*/*                                                                  */ 00550000
*/*01*   COPYRIGHT =                                                 */ 00600000
*/*       5740-XC6                                                   */ 00650000
*/*       THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                */ 00700000
*/*       (C) COPYRIGHT IBM CORP. 1985, 1986                         */ 00750000
*/*       LICENSED MATERIALS - PROPERTY OF IBM                       */ 00800000
*/*                                                                  */ 00950000
*/*01*   STATUS = JBB2220                                            */ 01000000
*/*                                                                  */ 01050000
*/*01*   FUNCTION = Maps an I/O prevention table entry.              */ 01100000
*/*                                                                  */ 01150000
*/*01*   DEPENDENCIES = None                                         */ 01200000
*/*                                                                  */ 01250000
*/*01*   RESTRICTIONS = None                                         */ 01300000
*/*                                                                  */ 01350000
*/*01*   SERIALIZATION = None                                        */ 01400000
*/*                                                                  */ 01450000
*/*01*   MODULE TYPE = Control block                                 */ 01500000
*/*                                                                  */ 01550000
*/*01*   PROCESSOR = PLS3 Compiler and assembler H                   */ 01600000
*/*                                                                  */ 01650000
*/*01*   CHANGE ACTIVITY =                                           */ 01700000
*/*A-000000-999999        New for OS/VS2 JBB2216                     */ 01750000
*/*                                                                  */ 01800000
*/* $MAC(IOSDIOPT),COMP(SC1C3): IOPT entry layout                    */ 01850000
*/*                                                                  */ 01900000
*/* $L0=HARP01   JBB2216 831115 PDLE: New macro                      */ 01950000
*/* $L1=VERS     HBB3310 860416 PDLE: Versioning macro into product  */ 02000000
*/*                                                              @L1A*/ 02050000
*/********************************************************************/ 02100000
*%GOTO IOPT2;                     /*                                    02150000
IOPT     DSECT                                                          02200000
         SPACE 1                                                        02250000
IOPTHDR  DS    CL4                 IOPT header area - 'IOPT' ID         02300000
         SPACE 1                                                        02350000
IOPTENTY DS    0XL4                IOPT entry mapping                   02400000
IOPTFLG1 DS    BL1                 IOPT entry flag byte..............   02450000
IOPTINUS EQU   X'80'               .. IOPT entry in-use flag            02500000
IOPTFLD2 DS    0AL3                IOPT entry field two..............   02550000
IOPTSEQN DS    AL3                 IOPT entry sequence number field     02600000
IOPTELEN EQU   *-IOPTENTY          Length of an IOPT entry              02650000
         MEND                      */                                   02700000
*%IOPT2 : ;                                                             02750000
*DECLARE                                                                02800000
* 1 IOPT    BDY(WORD) BASED(IOPTPTR), /* I/O Prevention Table map    */ 02850000
*  3 IOPTHDR                 ,  /* IOPT Header field                 */ 02900000
*    5 IOPTID         CHAR(04), /* .. 'IOPT' block identifier        */ 02950000
*  3 IOPTENTY(*)     BDY(WORD), /* IOPT table entry layout           */ 03000000
*    5 IOPTFLD                , /*                                   */ 03050000
*      7 IOPTFLD1      BIT(08), /* IOPT entry field one              */ 03100000
*        9 IOPTFLG1    BIT(08), /* IOPT entry flag byte              */ 03150000
*          11 IOPTINUS BIT(01), /* .. IOPT entry in-use flag.        */ 03200000
*          11 *        BIT(07), /* .. Reserved                       */ 03250000
*      7 IOPTFLD2     CHAR(03), /* IOPT entry field two              */ 03300000
*        9 IOPTSEQN   CHAR(03), /* IOPT entry sequence number field  */ 03350000
*    5 *              CHAR(0);  /*                                   */ 03400000
