*        %GOTO ICSSPLS1; /*                                             00050012
         MACRO                                                          00100012
         IRAICSS   &DSECT=YES,&PF=ICSS                                  00150012
         IEZBITS                                                     */ 00200012
*%ICSSPLS1:  ;                                                          00250012
* /* *************************************************************** */ 00450012
* /*                                                                 */ 00500012
* /*   MACRO NAME - IRAICSS                                          */ 00550012
* /*                                                                 */ 00575000
* /*   DESCRIPTIVE NAME - SYSTEM RESOURCE MANAGER SUBSYSTEM ENTRY    */ 00600012
* /*                      OF THE INSTALLATION CONTROL SPECIFICATION  */ 00650012
* /*                      TABLE                                      */ 00660012
* /*                                                                 */ 00682500
* /*   COPYRIGHT - LICENSED MATERIALS - PROPERTY OF IBM              */ 00730600
* /*               "RESTRICTED MATERIALS OF IBM"                     */ 00778700
* /*               5647-A01 (C) COPYRIGHT IBM CORP. 1979, 1998       */ 00826800
* /*                                                                 */ 00875000
* /*   STATUS -   JBB6607                                            */ 00890600
* /*                                                                 */ 00906200
* /*   EXTERNAL CLASSIFICATION: NONE                                 */ 00912400
* /*   END OF EXTERNAL CLASSIFICATION                                */ 00918600
* /*                                                                 */ 00925000
* /*   FUNCTION - THE ICSS ENTRY CONTAINS INFORMATION RELATED TO A   */ 00950012
* /*              SUBSYSTEM SPECIFICATION IN THE INSTALLATION        */ 01000012
* /*              CONTROL SPECIFICATION.                             */ 01010012
* /* *************************************************************** */ 01050012
*         %GOTO ICSSPLS2; /*                                            01100012
           AGO  .ICSSAL1                                             */ 01150012
* /* *************************************************************** */ 01200012
* /*    INVOCATION PARAMETERS AND/OR KEYWORDS =                      */ 01250012
* /*      BAL - PF=XXXX SPECIFIES THAT THE LABELS ARE TO START WITH  */ 01300012
* /*            XXXX INSTEAD OF ICSS. THE DEFAULT IS ICSS            */ 01350012
* /*      PLS - TO ACCESS AS STAND ALONE STRUCTURE DCL ICSSPTR PTR.  */ 01400012
* /*            TO CONCATENATE WITH PREVIOUSLY DEFINED STRUCTURE     */ 01450012
* /*              SET %ICSSLEVL TO DESIRED STRUCTURE LEVEL.          */ 01500012
* /*            TO PREVENT STRUCTURE FROM BEING CLOSED,              */ 01550012
* /*              SET %ICSS9999=','.                                 */ 01600012
* /*                                                                 */ 01650012
* /*      CHANGE ACTIVITY - @G743PGS,@G81LPJC                        */ 01700000
* /*                                                                 */ 01750012
* /* $LW=SRMACCT  JBB2220  840822 PD33G3:ASSIGN PGN BY ACCOUNT NUMBER*/ 01766600
* /* $P1=PA20148  JBB2220  850322 PD16R1: Resolve discrepancies      */ 01772100
* /*                                      between ASM and PLS        */ 01777600
* /* $L1=WLMI     HBB5510  930519 PD88AK: Workload Manager I -       */ 01779400
* /*                                      SRM Externals Hits     @L1A*/ 01781200
* /* $PWA0185     JBB6607  980601 PD88KN: PLANFORM 1130 UPDATES      */ 01781800
* /*                                                                 */ 01782400
* /*                                                                 */ 01783200
* /*      A000000-999999                                     @G742PSS*/ 01800012
* /*                                                                 */ 01850012
* /* *************************************************************** */ 01900012
* /*                                                                    01950012
.ICSSAL1 ANOP                                                           02000012
         SPACE 1                                                        02050012
         AIF   ('&DSECT' EQ 'NO').ICSSAL2                               02100012
&PF      DSECT                                                          02150012
         AGO   .ICSSAL3                                                 02200012
.ICSSAL2 ANOP                                                           02250012
         DS    0D                                                       02300012
&PF      EQU   *                                                        02350012
.ICSSAL3 ANOP                                                           02400012
         SPACE 1                                                        02450012
&PF.NAME DC    CL4'    '           SUBSYSTEM NAME                       02500012
&PF.LNG  DC    AL2(&PF.LEN)        LENGTH OF SUBSYSTEM ENTRY       @LWA 02508300
&PF.RSV1 DC    HL1'0'              RESERVED                        @LWM 02516600
&PF.FLAG DC    B'00000000'         STATUS FLAGS                    @LWM 02524900
&PF.RPG  EQU   BIT0                REPORT PGN SPECIFIED (RPGN)     @LWM 02533200
&PF.OPG  EQU   BIT1                OPTIONAL PGNS SPECD (OPGN)      @LWM 02541500
&PF.SUBS DC    F'0'                ADDR OF NEXT SUBSYSTEM ENTRY         02550012
&PF.TRXN DC    F'0'                ADDR OF TRANSACTION NAME TBLS        02600012
&PF.USRD DC    F'0'                ADDR OF USERID TABLES                02650012
&PF.CLS  DC    F'0'                ADDR OF CLASS TABLES                 02700012
&PF.ACTN DC    A(0)                ADDRESS OF ACCOUNT NUMBER TABLE @LWA 02708300
&PF.SRVC DC    A(0)                ADDRESS OF SRVCLASS TABLE       @L1A 02758300
&PF.RPGN DC    H'0'                REPORT PERFORMANCE GROUP    @G743PGS 02920012
&PF.PGN  DC    H'1'                CONTROL PERFORMANCE GROUP            02960012
&PF.END  DS    0F                  END OF ICSS                          03050012
&PF.LEN  EQU   &PF.END-&PF         LENGTH OF ICSS                       03100012
         ORG   &PF.PGN                                             @P1A 03106200
&PF.XPGN DS    H                   AN ARRAY CONTAINING THE PGN FOLLOWED 03112400
*                                  BY ANY OPGNS.  IF OPGNS WERE         03118600
*                                  SPECIFIED, THE LAST ELEMENT IS       03124800
*                                  ZEROS                           @P1A 03131000
         ORG   &PF.SUBS                                            @P1A 03137200
&PF.EPTR DS    F                                                   @P1A 03143400
         ORG   &PF.END             RE - ORG TO END OF ICSS         @P1A 03146700
         MEND                                                           03150012
*                                                                    */ 03200012
*%ICSSPLS2:  ;                                                          03250012
*        %IF ICSS9999 ~= ','        /* DOES STRUCTURE CONTINUE       */ 03300012
*            %THEN %ICSS9999 = ';'; /* NO, END DECLARE STATEMENT     */ 03350012
*        %IF ICSSLEVL ~= ''         /* IS STRUCTURE CONCATENATED     */ 03400012
*            %THEN %GOTO ICSSPLS3;  /* YES, OMIT DECLARE STATEMENT   */ 03450012
*   DCL                                                                 03500012
*     1 ICSS BASED(ICSSPTR) BDY(WORD),                                  03550012
*            %GOTO ICSSPLS4;        /* SKIP USER-GIVEN LEVEL         */ 03600012
*%ICSSPLS3:  ICSSDUM = ICSSLEVL||' ICSS';  /* PICK UP GIVEN LEVEL    */ 03650012
*     ICSSDUM BDY(WORD),                                                03700012
*%ICSSPLS4:  ;                                                          03750012
*       10 ICSSNAME CHAR(4),        /* SUBSYSTEM NAME                */ 03800012
*       10 ICSSLNG  FIXED(15),      /* LENGTH OF SUBSYSTEM ENTRY        03806200
*                                      (ROUNDED UP TO FULLWORD)  @LWM*/ 03812400
*       10 ICSSRSV1 BIT(8),         /* RESERVED                  @LWM*/ 03818600
*       10 ICSSFLAG BIT(8),         /* STATUS FLAGS              @LWM*/ 03824800
*         14 ICSSRPG BIT(1),        /* REPORT PGN SPECIFIED      @LWM*/ 03831000
*         14 ICSSOPG BIT(1),        /* OPTIONAL PGN SPECD        @LWM*/ 03837200
*         14 * BIT(6),              /* RESERVED                  @P1C*/ 03843400
*       10 ICSSSUBS PTR(31),        /* ADDR OF NEXT SUBSYSTEM ENTRY  */ 03850012
*       10 ICSSTRXN PTR(31),        /* ADDR OF TRANSACTION NAME TBLS */ 03900012
*       10 ICSSUSRD PTR(31),        /* ADDR OF USERID TABLES         */ 03950012
*       10 ICSSCLS  PTR(31),        /* ADDR OF CLASS TABLES          */ 04000012
*       10 ICSSACTN PTR(31),        /* ADDR OF ACCT NUMBER TABLE @LWA*/ 04050000
*       10 ICSSSRVC PTR(31),        /* ADDR OF SRVCLASS TABLE    @L1A*/ 04100000
*       10 ICSSRPGN FIXED(15),      /* REPORT PERF GROUP     @G743PGS*/ 04260012
*       10 ICSSPGN FIXED(15),       /* CONTROL PERF GROUP            */ 04290012
*     5 ICSSEND  CHAR(0) BDY(WORD)  /* END OF ICSS                   */ 04400012
*   ICSS9999                                                            04450012
*   %ICSSLEN = 'LENGTH(ICSS)';      /* SYMBOLIC FOR LENGTH OF ICSS   */ 04500012
*        %IF ICSS9999 ~= ';'        /* DOES STRUCTURE CONTINUE       */ 04550012
*            %THEN %GOTO ICSSPLS5;  /* YES, OMIT DECLARE STATEMENT   */ 04600012
*   DCL                                                                 04650012
*%ICSSPLS5: ;                                                           04700012
*   ICSSXPGN (*) FIXED(15) DEFINED(ICSSPGN), /* AN ARRAY CONTAINING     04750012
*        THE PGN FOLLOWED BY ANY OPGNS.  IF OPGNS WERE SPECIFIED,       04800012
*        THE LAST ELEMENT IS ZEROS.                          @G743PGS*/ 04850012
*   ICSSEPTR (6) PTR(31) DEFINED(ICSSSUBS) /*                    @L1C*/ 04900000
*   ICSS9999                                                            04950012
