*        %GOTO  LSCTPLS1;         /*                                    00050050
         MACRO                                                          00100050
         IRALSCT &DSECT=YES                                             00150050
*                                                                    */ 00200050
*%LSCTPLS1 : ;                                                          00250050
*/*                                                                  */ 00300050
*/*  MACCOMP Z-4 SC1CX/PKD09                                         */ 00350012
*/*  MACSTAT Z-4 78213/G742PJC                                       */ 00380012
*/********************************************************************/ 00450050
*/*                                                                  */ 00500050
*/*      MACRO NAME - IRALSCT                                        */ 00550050
*/*                                                                  */ 00600050
*/*      DESCRIPTIVE NAME - SYSTEM RESOURCES MANAGER RESOURCE        */ 00650050
*/*                         LOGICAL SWAP CONTROL TABLE               */ 00700050
*/*                                                          @G50IPSS*/ 00707050
*/*     COPYRIGHT - LICENSED MATERIALS - PROPERTY OF IBM             */ 00718400
*/*                 "RESTRICTED MATERIALS OF IBM"                    */ 00729800
*/*                 5647-A01                                         */ 00741200
*/*                 (C) COPYRIGHT IBM CORP. 1977, 1998               */ 00752600
*/*                                                                  */ 00764012
*/*      STATUS - JBB6607                                            */ 00778500
*/*                                                                  */ 00793000
*/*      EXTERNAL CLASSIFICATION: NONE                               */ 00812000
*/*      END OF EXTERNAL CLASSIFICATION                              */ 00831000
*/*                                                                  */ 00850050
*/*      METHOD OF ACCESS                                            */ 00900050
*/*        BAL - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.     */ 00950050
*/*              USING ON LSCT GIVES ADDRESSIBILITY FOR ALL SYMBOLS. */ 01000050
*/*        PLS - TO ACCESS AS STAND ALONE STRUCTURE DCL LSCT PTR PTR.*/ 01050050
*/*              TO CONCATENATE WITH PREVIOUSLY DEFINED STRUCTURE    */ 01100050
*/*                SET %LSCTLEVL TO DESIRED STRUCTURE LEVEL.         */ 01150050
*/*              TO PREVENT STRUCTURE FROM BEING CLOSED,             */ 01200050
*/*                SET %LSCT9999=','.                                */ 01250050
*/*                                                                  */ 01300050
*/*      CHANGE ACTIVITY = @G81LPJC,@ZMM0064                         */ 01316600
*/*                                                                  */ 01333200
*/* $L3=EXTREAL  JBB1326 800810 PDCL  : EXTENDED REAL SUPPORT SP1.3  */ 01338800
*/* $L6=EXTREAL  JBB1326 801010 PDSS  : EXTENDED REAL SUPPORT SP1.3  */ 01341600
*/* $H6=ES       JBB2133 850130 PD16M6: EXTENDED STORAGE             */ 01343000
*/* $L1=LJOBM    JBB3313 881111 PD88BY: Large Job Management         */ 01343200
*/*                                     Reserve obsolete field   @L1A*/ 01343400
*/* $L2=LJOBM    JBB3313 881201 PD88AB: Large Job Management         */ 01343600
*/*                                     support                  @L2A*/ 01343800
*/* $P1=PGP0592  JBB3313 890915 PD88BY: LJM - remove support for     */ 01344000
*/*                                     OPT parameter LSCTAFQ    @P1A*/ 01344200
*/* $L4=WLMI     HBB5510 921231 PD44BB: WORKLOAD MANAGER I           */ 01344300
*/* $PWA0185     JBB6607 980601 PD88KN: PLANFORM 1130 UPDATES        */ 01346200
*/*                                                                  */ 01348100
*/********************************************************************/ 01350050
*/*                                                                  */ 01400050
*        %GOTO  LSCTPLS2;         /*                                    01450050
         AIF   ('&DSECT' EQ 'YES').LSCT001                              01500050
LSCT     DS    0D -                LOGICAL SWAP CONTROL TABLE           01550050
         AGO   .LSCT002                                                 01600050
.LSCT001 ANOP                                                           01650050
LSCT     DSECT , -                 LOGICAL SWAP CONTROL TABLE           01700050
.LSCT002 ANOP                                                           01750050
LSCTLSCT DC    CL4'LSCT' -        ACRONYM IN EDCDIC -LSCT-     @G50IPJH 01800050
*                                                                       01850050
*        LOGICAL SWAP CONTROL CONSTANTS                                 01900050
*                                                                       01950050
LSCTUCTL DC    H'0'  (OPT PARM)   UIC LOW THRESHOLD            @G741PGM 02000012
LSCTUCTH DC    H'0'  (OPT PARM)   UIC HIGH THRESHOLD           @G741PGM 02010012
LSCTASTL DC    H'1000'            ASM QUEUED REQ LOW THRESHOLD @ZM50083 02020012
LSCTASTH DC    H'1000'            ASM QUEUED REQ HIGH THRSHOLD @ZM50083 02026012
LSCTRSV4 DC    H'0'               Reserved                         @P1C 02040000
LSCTRSV5 DC    H'0'               Reserved                         @P1C 02050000
LSCTMTEL DC    F'0'  (OPT PARM)   THINK TIME LOW THRESHOLD     @G741PGM 02060012
LSCTMTEH DC    F'0'  (OPT PARM)   THINK TIME HIGH THRESHOLD    @G741PGM 02070012
LSCTMTEI DC    F'500'             THINK TIME INCREMENT         @G50IPJH 02210050
LSCTMTED DC    F'1000'            THINK TIME DECREMENT         @G50IPJH 02250050
LSCTMTEP DC    H'25'              Percent decrement for think time @L2C 02300000
LSCTMTEW DC    H'5000'            LSW queue think time wall        @L2A 02350000
*                                                                       02450050
*        LOGICAL SWAP CONTROL VARIABLES                                 02500050
*                                                                       02550050
LSCTMTE  DC    F'0'               MAXIMUM THINK TIME           @G50IPJH 02600050
LSCTCNT  DC    F'0'               NUMBER OF LOGICAL SWAP ADR SP@G50IPJH 02620050
*                                 IN TERMINAL WAIT             @ZMM0064 02621200
*                                                                       02622500
*        EXTENDED REAL CONTROL CONSTANTS                                02625000
*                                                                       02627500
LSCTFTTL DC    H'0'  (OPT PARM)   LOGICAL LOW FIXED FRAME THRESHOLD     02630000
*                                 (BASED ON % OF PVTPOOL)          @L3A 02632500
LSCTFTTH DC    H'0'  (OPT PARM)   LOGICAL HIGH FIXED FRAME THRESHOLD    02635000
*                                 (BASED ON % OF PVTPOOL)          @L3A 02637500
LSCTFETL DC    H'0'  (OPT PARM)   PHYSICAL LOW FIXED FRAME THRESHOLD    02640000
*                                 (BASED ON % OF PVTPOOL-PVTPOOLA) @L3A 02642500
LSCTFETH DC    H'0'  (OPT PARM)   PHYSICAL HIGH FIXED FRAME THRESHOLD   02645000
*                                 (BASED ON % OF PVTPOOL-PVTPOOLA) @L3A 02647500
LSCTFLAG DC    B'00000000'        FLAGS                            @L6A 02649000
LSCTRSV1 DC    B'00000000'        Reserved                         @L1C 02650500
LSCTCNTW DC    H'0'               # LONG + DET. WT. LOG. SWAPPED        02652000
*                                                              @ZMM0064 02652900
LSCTLDTH DC    F'5000'            THINK TIME THRESHOLD FOR LOGICAL      02653800
*                                 SWAP OF LONG OR DETECTED WAITS        02654700
*                                                              @ZMM0064 02655600
LSCTRSV3 DC    F'0'               RESERVED                         @L3A 02656600
LSCTEND  DS    0D -                END OF LSCT                 @G50IPJH 02660050
LSCTLEN  EQU   LSCTEND-LSCT -      LENGTH OF LSCT              @G50IPJH 02700050
         MEND                                                           02800050
*        */                                                             02850050
*%LSCTPLS2 : ;                                                          02900050
*                                  /*                           2@L4D*/ 02950000
*    %IF LSCTLEVL~=''              /* IF MINOR LEVEL IS SPECIFIED,   */ 03050050
*      %THEN %GOTO LSCTPLS3;       /* SKIP MAJOR DECLARE             */ 03100050
*DECLARE                           /*                                */ 03150050
*  1 LSCT BASED(LSCTPTR)           /* LOGICAL SWAP CONTROL TABLE     */ 03200050
*    %GOTO LSCTPLS4;               /* MAJOR STRUCTURE                */ 03250050
*%LSCTPLS3:LSCTDM=LSCTLEVL||' LSCT';/* CONCATENATE AS MINOR STRUCTURE*/ 03300050
*  LSCTDM                         /* LOGICAL SWAP CONTROL TABLE     */  03350050
*%LSCTPLS4:;                                                            03400050
*        BDY(DWORD),                                                    03450050
*      5 LSCTLSCT CHAR(4),         /* ACRONYM IN EBCDIC -LSCT-       */ 03500050
*/*                                                                  */ 03550050
*/*      LOGICAL SWAP CONTROL CONSTANTS                              */ 03600050
*/*                                                                  */ 03650050
*      5 LSCTUCTL FIXED(15),       /* UIC THRESHOLD LOW      @G50IPJH*/ 03700050
*      5 LSCTUCTH FIXED(15),       /* UIC HIGH THRESHOLD     @G50IPJH*/ 03720050
*      5 LSCTASTL FIXED(15),       /* ASM QUEUED REQ LOW     @G50IPJH*/ 03750050
*      5 LSCTASTH FIXED(15),       /* ASM QUEUED REQ HIGH    @G50IPJH*/ 03800050
*      5 LSCTRSV4 FIXED(15),       /* Reserved                   @P1C*/ 03810000
*      5 LSCTRSV5 FIXED(15),       /* Reserved                   @P1C*/ 03820000
*      5 LSCTMTEL FIXED(31),       /* THINK TIME LOW THRESH  @G50IPJH*/ 03850050
*      5 LSCTMTEH FIXED(31),       /* THINK TIME HIGH THRESH @G50IPJH*/ 03900050
*      5 LSCTMTEI FIXED(31),       /* THINK TIME INCREMENT   @G50IPJH*/ 03910050
*      5 LSCTMTED FIXED(31),       /* THINK TIME DECREMENT   @G50IPJH*/ 03950050
*      5 LSCTMTEP FIXED(15),      /* Percent decrement for think time   04000000
*                                                                @L2C*/ 04050000
*      5 LSCTMTEW FIXED(15),      /* LSW queue think time wall   @L2A*/ 04100000
*/*                                                                  */ 04150050
*/*      LOGICAL SWAP CONTROL VARIABLES                              */ 04200050
*/*                                                                  */ 04250050
*      5 LSCTMTE FIXED(32) UNSIGNED, /* MAXIMUM THINK TIME   @G50IPJH*/ 04300050
*        7 LSCTMTES FIXED(31),    /* MAX THINK TIME SIGNED   @G50IPJH*/ 04320050
*      5 LSCTCNT FIXED(31),       /* NUMBER OF LOGICAL SWAP TERM        04330200
*                                    WAITS                   @ZMM0064*/ 04340400
*/*                                                                  */ 04350800
*/*      EXTENDED REAL CONTROL CONSTANTS                             */ 04351600
*/*                                                                  */ 04352400
*      5 LSCTFTTL FIXED(15),       /* LOGICAL LOW FIXED FRAME THRESHOLD 04353200
*                                    (BASED ON % OF PVTPOOL)     @L3A*/ 04354000
*      5 LSCTFTTH FIXED(15),      /* LOGICAL HIGH FIXED FRAME THRESHOLD 04354800
*                                    (BASED ON % OF PVTPOOL)     @L3A*/ 04355600
*      5 LSCTFETL FIXED(15),      /* PHYSICAL LOW FIXED FRAME THRESHOLD 04356400
*                               (BASED ON % OF PVTPOOL-PVTPOOLA) @L3A*/ 04357200
*      5 LSCTFETH FIXED(15),     /* PHYSICAL HIGH FIXED FRAME THRESHOLD 04358000
*                               (BASED ON % OF PVTPOOL-PVTPOOLA) @L3A*/ 04358800
*      5 LSCTFLAG BIT(8),         /* FLAGS                       @L6A*/ 04360800
*                                                              /*@L1D*/ 04363400
*      10 * BIT(8),               /* RESERVED                    @L1C*/ 04366000
*      5 LSCTRSV1 BIT(8),         /* RESERVED                    @L6A*/ 04368800
*      5 LSCTCNTW FIXED(15),      /* # LONG + DET. WT. LOG. SWAPPED     04371700
*                                                            @ZMM0064*/ 04374600
*      5 LSCTLDTH FIXED(31),      /* THINK TIME THRESHOLD FOR LOGICAL   04377500
*                                    SWAP OF LONG OR DETECTED WAITS     04380400
*                                                            @ZMM0064*/ 04383300
*      5 LSCTRSV3 FIXED(31),      /* RESERVED                    @L3A*/ 04386600
*      5 LSCTEND CHAR(0) BDY(DWORD) /* END OF LSCT           @G50IPJH*/ 04400050
*                                                              /*@L4A*/ 04416600
* %IF LSCT9999 =',' %THEN %GOTO LSCT999C; /* Continue structure  @L4A*/ 04433200
*                ;                  /* End of this block         @L4A*/ 04449800
*     %GOTO LSCT999E ;                                         /*@L4A*/ 04466400
* %LSCT999C:;                                                 /* @L4A*/ 04483000
*                ,                  /* Continue structure        @L4A*/ 04499600
* %LSCT999E:;                       /* Endif                     @L4A*/ 04516200
*                                                              /*@L4A*/ 04532800
*%LSCTLEN='LENGTH(LSCT)';          /* OBTAIN LENGTH OF LSCT          */ 04550050
*@EJECT;                                                                04600050
