*        %GOTO  MCTPLS1;          /*                                    00050000
         MACRO                                                          00100000
         IRAMCT &DSECT=YES                                              00150000
*                                                                    */ 00200000
*%MCTPLS1 : ;                                                           00250000
*/* Start of Specifications ******************************************* 00300000
*                                                                     * 00350000
*    EXTERNAL CLASSIFICATION:  DMTI                                   * 00400000
*    END OF EXTERNAL CLASSIFICATION:                                  * 00450000
*                                                                     * 00500000
**** PROPRIETARY_STATEMENT ******************************************** 00550000
*01* PROPRIETARY STATEMENT=                                           * 00600000
*                                                                     * 00650000
*        LICENSED MATERIALS - PROPERTY OF IBM                         * 00700000
*        "RESTRICTED MATERIALS OF IBM"                                * 00750000
*        5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                  * 00800000
*                                                                     * 00850000
**** END_OF_PROPRIETARY_STATEMENT ************************************* 00900000
*                                                                     * 00950000
*01* Status: HBB7703                                                  * 01000000
*                                                                     * 01050000
*01* Descriptive Name: System Resource Manager Storage Management     * 01100000
*                      Control Table                                  * 01150000
*02*  Acronym: MCT                                                    * 01200000
*                                                                     * 01250000
*01* Macro Name: IRAMCT                                               * 01300000
*                                                                     * 01350000
*01* DSECT Name: MCT (unless DSECT=NO is coded)                       * 01400000
*                                                                     * 01450000
*01* Component: System Resource Manager (SC1CX)                       * 01500000
*                                                                     * 01550000
*01* Eye-Catcher: MCT                                                 * 01600000
*02*  Offset: 0                                                       * 01650000
*02*  Length: CHAR(4)                                                 * 01700000
*                                                                     * 01750000
*01* Storage Attributes:                                              * 01800000
*02*  Subpool: Nucleus                                                * 01850000
*02*  Key: 0                                                          * 01900000
*02*  Residency: Nucleus (above 16M line)                             * 01950000
*                                                                     * 02000000
*01* Size: 616 bytes                                                  * 02050000
*                                                                     * 02100000
*01* Created by: Assembled into nucleus module IRARMCNS               * 02150000
*                                                                     * 02200000
*01* Pointed to by: RMCTMCT field of the RMCT data area               * 02250000
*                                                                     * 02300000
*01* Serialization: SRM lock                                          * 02350000
*                                                                     * 02400000
*01* Function: Contains storage management control information        * 02450000
*              for use by SRM storage management modules              * 02500000
*                                                                     * 02550000
*01* Method of Access:                                                * 02600000
*                                                                     * 02650000
*02*  ASM:                                                            * 02700000
*          DSECT=NO if DSECT is not to be produced.                   * 02750000
*          USING on MCT gives addressability to all symbols.          * 02800000
*                                                                     * 02850000
*02*  PL/AS:                                                          * 02900000
*          SET %MCTLEVEL='userlevl' to concatenate with a previously  * 02950000
*                      defined structure with the MCT being assigned  * 03000000
*                      the indicated structure level.                 * 03050000
*          SET %MCT9999=',' to prevent structure from being closed.   * 03100000
*          DCL MCTPTR pointer to access as a stand alone structure.   * 03150000
*                                                                     * 03200000
*01* Change Activity: @ZA42459,@ZMB0657,@ZA58069,@ZA59747               03232700
*                     @ZA64868                                          03265400
*                                                                       03298100
*   OZ94075 -- CHANGE MCCDEFAM MULTIPLIER FROM 4 TO 6                   03330800
*                                                                       03363500
*   OY03623 -- SUPPORT >128 MB REAL STORAGE                             03396200
*                                                                       03428900
*   OY06561 -- RESHIPPED TO SUPERCEDE OY03623                           03461600
*                                                                       03494300
*   OY06825 -- ADD MCVAVQLT - TIME OF LAST LEVEL 1 AVQLOW               03527000
*              ADD MCCTOSEC - TWO SECOND VALUE IN TIMER UNITS           03559700
*              ADD MCTFSTOV - BIT TO FORCE STEAL OVERRIDE               03592400
*                                                                       03625100
*   OY08835 -- 11/10/87 - Support for messsage IRARM204E added as       03657800
*              part of VIO to expanded storage SPE                      03690500
*                                                                       03723200
*   OY14672 -- 06/06/88 - Decrease migrator wait time from 10 sec.      03755900
*              to 1 sec. (MCCMGTEX)                                     03788600
*                                                                       03821300
*   OY62416 -- 10/07/93 - Added the field MCVMIGB                       03854000
*                                                                       03886700
*   $H2=ADVPROC2 JBB2133  821229 PD3419: AXP                            03919400
*                                                                       03952100
*   $H4=ES       JBB2133  830201 PDF6  : EXTENDED STORE                 03984800
*                                                                       04017500
*   $H5=ES       JBB2133  830525 PDJK  : EXTENDED STORE                 04050200
*                                                                       04082900
*   $H6=ES       JBB2133  830614 PD3319: EXTENDED STORE                 04115600
*                                                                       04148300
*   $L2=EXTSWAP  JBB1326  800904 PDCL  : SP1.3 EXTENDED SWAP SUPPORT    04181000
*                                                                       04213700
*   $L3=EXTREAL  JBB1326  800820 PDCL  : SP1.3 EXTENDED REAL SUPPORT    04246400
*                                                                       04279100
*   $P1=PAE0161  JBB2133  840321 PDF6  : ES RECONFIG                    04311800
*                                                                       04344500
*   $P2=PAE0388  JBB2133  841128 PD162M: ES PERFORMANCE                 04377200
*                                                                       04409900
*   $P3=PAE0409  JBB2133  841128 PD16M6: INCREASE ESS LOW AND OK        04442600
*                                        THRESHOLDS                     04475300
*                                                                       04508000
*   $D1=DCR0004  JBB2214  850320 PD162M: VECTOR AVAILABILITY SUPPORT    04540700
*                                                                       04573400
*   $L7=HARP01   JBB2216  831116 PDF6  : HARP RELEASE 1 (FWA)           04606100
*                                                                       04638800
*   $LD=DREF     HBB3310  860212 PD88R1: Disabled Reference             04671500
*                                                                       04704200
*   $LR=RTMRAS   HBB3310  860811 PD88AB: RTMRAS Support                 04736900
*                                                                       04769600
*   $LT=DREF     HBB3310  861001 PD88AA: Disabled Reference Support     04802300
*                                                                       04835000
*   $P6=PC41201  HBB3310  870730 PD88AI: Remove declares in IRAMCT      04867700
*                                        used to calculate medians      04900400
*                                        of real storage and  DREF      04933100
*                                        for ready users in IRARMMS4    04965800
*                                        which is dead code.            04998500
*                                                                       05031200
*   $D9=DCR0291  HBB3310  871116 PD88CL: Support >256MB Real Storage    05063900
*                                                                       05096600
*   $L1=HIPER    JBB3311  880314 PD88AK: Expansion of macro and         05129300
*                                        HIPERSPACE support.            05162000
*                                                                       05194700
*   $L4=B16MB    JBB3311  880318 PD88AK: Support for stealing of        05227400
*                                        fixed frames below 16M         05260100
*                                                                       05292800
*   $L5=LJOBM    JBB3313  881206 PD88AB: Large Job Management.          05325500
*                                                                       05358200
*   $L6=WSMGT    HBB4420  900716 PD88AK: Support for Working Set        05390900
*                                        Management                     05423600
*                                                                       05456300
*   $P4=PH35328  HBB4420  900716 PD88BH: Modify the address space       05489000
*                                        paging cost percentage         05521700
*                                        threshold value                05554400
*                                                                       05587100
*   $D8=DH30154  HBB4420  901022 PD88BP: Reduce UIC update frequency    05619800
*                                                                       05652500
*   $P5=PH32076  HBB4420  910107 PD88AK: Reduce SRM lock contention     05685200
*                                        by reducing the amount of      05717900
*                                        processing done while          05750600
*                                        holding the SRM lock           05783300
*                                                                       05816000
*   $01=OY37800  HBB4420  901130 PD88AI: Add counts for deciding        05848700
*                                        to turn on the flag to tell    05881400
*                                        RSM to try and steal a frame   05914100
*                                        above the line before giving   05946800
*                                        a frame below the 16 meg       05979500
*                                        line                           06012200
*                                                                       06044900
*   $P7=PKB1749  HBB4430  920318 PD88EH: Showhdr compliance.            06077600
*                                                                       06110300
*   $P8=PKB3400  HBB4430  920620 PD88AK: Introduce variable to save     06143000
*                                        the OUCB address of dumpsrv    06175700
*                                                                       06208400
*   $L8=WLMI     HBB5510  921231 PD44BB: Workload Manager I             06241100
*                                                                       06273800
*   $L9=ENCLV    HBB5520  940414 PD88BA: Enclaves                       06306500
*                                                                       06339200
*   $LA=CAPT2    HBB5520  940414 PD88BB: Shared storage                 06371900
*                                                                       06404600
*   $OW12444              950414 PD88DA: Add MCCSIGRS for GRS storage   06437300
*                                        isolation support              06470000
*                                                                       06502700
*   $PWA0185     JBB6607  980601 PD88KN: PLANFORM 1130 UPDATES          06535400
*                                                                       06568100
*   $FIXDIST     JBB6609  990827 PD88KN: Move back to correct distlib   06600800
*                                                                       06633500
*   $64BITSRM    HBB7703  990503 B9HAGB: Georg Bosch                    06666200
*                                        64 BIT Real Support            06698900
*                                                                       06731600
*   $64BITSRM    HBB7703  990705 B9HAGB: Georg Bosch                    06764300
*                                        Quad frame groups              06797000
*                                                                       06829700
*   $WLMPGMY     HBB7703  991129 B9HABB: John Arwe                      06862400
*                                        Add length constants for SRM   06895100
*                                        and SMF use so length changes  06927800
*                                        to parameter lists cause       06960500
*                                        fewer intersects               06993200
*                                                                       07025900
*                                                                       07058600
*** End of Specifications ********************************************/ 07100000
*/*                                                                  */ 07150000
*        %GOTO  MCTPLS2;          /*                                    07200000
         AIF   ('&DSECT' EQ 'YES').MCT001                               07250000
MCT      DS    0D -                STORAGE CONTROL TABLE                07300000
         AGO   .MCT002                                                  07350000
.MCT001  ANOP                                                           07400000
MCT      DSECT , -                 STORAGE CONTROL TABLE                07450000
.MCT002  ANOP                                                           07500000
MCTMCT   DC    CL4'MCT' -         ACRONYM IN EDCDIC -MCT-               07550000
*                                                                       07600000
*        STORAGE CONTROL CONSTANTS                                      07650000
*                                                                       07700000
*        POINTERS TO SHORTAGE MESSAGES                                  07750000
MCCMS100 DC    V(IRARM100) -      SQA SHORTAGE MESSAGE ADDRESS          07800000
MCCMS101 DC    V(IRARM101) -      CRITICAL SQA SHORTAGE MESSAGE ADDRESS 07850000
MCCMS102 DC    V(IRARM102) -      SQA SHORTAGE RELIEVED MESSAGE ADDRESS 07900000
MCCMS200 DC    V(IRARM200) -      AUX SHORTAGE MESSAGE ADDRESS          07950000
MCCMS201 DC    V(IRARM201) -      CRITICAL AUX SHORTAGE MESSAGE ADDRESS 08000000
MCCMS202 DC    V(IRARM202) -      AUX SHORTAGE RELIEVED MESSAGE ADDRESS 08050000
MCCMS203 DC    V(IRARM203) -      AUX SHORTAGE USER MSG ADDR   @ZM43072 08100000
MCCMS400 DC    V(IRARM400) -      FIX PAGE SHORTAGE MSG ADDR   @Z40BPCH 08150000
MCCMS401 DC    V(IRARM401) -      CRITICAL FIX PAGE SHORTAGE MSG ADDR   08200000
*                                                              @Z40BPCH 08250000
MCCMS402 DC    V(IRARM402) -      FIX PAGE SHORTAGE RELIEVED MSG ADDR   08300000
*                                                              @Z40BPCH 08350000
MCCMS403 DC    V(IRARM403) -      FIX PAGE USER MESSAGE ADDR   @ZM43072 08400000
MCCMS500 DC    V(IRARM500) -      SWAP IN FAIL USER MSG ADDR   @ZA31942 08450000
MCCMS501 DC    V(IRARM501) -      SWAP IN MESSAGE              @ZA31942 08500000
*                                                                       08550000
*        STORAGE CONTROL CONSTANTS                             @Z40BPCH 08600000
*                                                                       08650000
MCCPLUS  DC    H'10' -             AVAILABLE FRAME QUEUE DELTA FOR      08700000
*                                  STEALING                    @Z40BPCH 08750000
MCCSTLCT DC    H'4' -              NO OF PAGES TO STEAL FROM EACH ADSPC 08800000
*                                  OR COMMON EACH STEAL PASS WITH LOW   08850000
*                                  UICS                        @G860PAM 08900000
MCCHSTLC DC    H'10' -             NO OF PAGES TO STEAL FROM EACH       08950000
*                                  ADSPC OR COMMON FOR STEAL PASS WITH  09000000
*                                  HIGH UICS                   @G860PAM 09050000
MCCSIPRT DC    H'10000' -          TIME BETWEEN PG-RATE CALC   @G741PSS 09100000
MCCDFRPC DC    H'4' -              DOUBLE FRAME REPLENISH INCREMENT     09150000
*                                                              @G860PSS 09200000
MCCDFREC DC    H'2' -              DOUBLE FRAME RELEASE VALUE  @G860PSS 09250000
MCCSPCPT DC    H'50'               The System Paging Cost Percentage    09300000
*                                  threshold for determining if any     09350000
*                                  address spaces should be monitored   09400000
*                                                                  @L6C 09450000
MCCAPCPT DC    H'50'               Address Space Paging Cost Percentage 09500000
*                                  threshold for determining if this    09550000
*                                  address space should be monitored    09600000
*                                                                  @P4C 09650000
MCCDUMP  DC    F'0'                DUMPSRV OUCB ADDRESS            @P8C 09700000
MCCICSPL DC    H'32767'            Length of IRAICSP.ICSP      @WLMPGMY 09728500
MCCRQSVL DC    H'32767'            Length of IRARQSRV.RQSV     @WLMPGMY 09757000
MCCE39PL DC    H'32767'            Length of IRAE39P.E39P      @WLMPGMY 09785500
MCCRSDL  DC    H'32767'            Length of IRARSD.RSD        @WLMPGMY 09814000
MCCOUCBL DC    H'32767'            Length of IRAOUCB.OUCB      @WLMPGMY 09842500
MCCR5    DC    H'0'                                                @L6C 09871000
MCCFXBPR DC    H'50'               Fixed Below High Percentage          09900000
*                                  Threshold                       @01C 09950000
MCCSIGRS DC    H'32767' -          WORKING SET SIZE TARGET FOR ENQ/DEQ  10000000
*                                  ADDRESS SPACE               @WA12444 10050000
MCCR7    DC    F'0'                                                @L6C 10100000
MCCR8    DC    F'0'                                                @L6C 10150000
MCCR9    DC    F'0'                                                @L6C 10200000
*                                                                       10250000
*        AUX STORAGE MONITORING CONSTANTS                               10300000
*                                                                       10350000
MCCASMT1 DC    H'70' -             FIRST AUX SHORTAGE THRESHOLD         10400000
MCCASMT2 DC    H'85' -             SECOND AUX SHORTAGE THRESHOLD        10450000
MCCEND   DS    0F -                END OF MCT CONSTANTS                 10500000
*                                                                       10550000
*        STORAGE CONTROL VARIABLES                                      10600000
*                                                                       10650000
MCVSIFLG DC    B'0' -              STORAGE ISOLATION FLAGS     @G741PSS 10700000
MCVSIPG  EQU   BIT0 -              ADS STG ISOLATION IN EFFECT @G741PSS 10750000
MCVSICM  EQU   BIT1 -              CMN STG ISOLATION IN EFFECT @G741PSS 10800000
MCVSIWS  EQU   BIT2 -              COMMON STORAGE PROTECTED BY WORKING  10850000
*                                  SET SIZE LIMITS             @G741PSS 10900000
MCVSIPI  EQU   BIT3 -              COMMON STORAGE PROTECTED BY PAGE IN  10950000
*                                  RATE LIMITS                 @G741PSS 11000000
MCCLIPT  DC    FL1'01' -           Large increase percentage thereshold 11050000
*                                  for fixed below pages           @01C 11100000
MCCASPCT DC    FL1'75' -           % OF AUX STORAGE TO RECOMMEND   @L1C 11150000
MCCRSPCT DC    FL1'02' -           % OF REAL STORAGE TO RECOMMEND  @L1C 11200000
MCVSTGPT DC    F'0'                TIME OF PREVIOUS STGTEST CALL   @L1C 11250000
MCVSIPL  DC    H'0' -              CMN LOW PAGE IN RATE SPEC   @G741PSS 11300000
MCVSIPH  DC    H'0' -              CMN HIGH PAGE IN RATE SPEC  @G741PSS 11350000
MCVSIBP  DC    F'0' -              BASE PAGE IN CNT FOR CMN    @G741PSS 11400000
MCVSIBT  DC    F'0' -              Base TOD value for page-in rate      11414200
*                                  calculations. In PR1 we will         11428400
*                                  check, if the CurrentTime-MCVSIBT    11442600
*                                  is less than MCCSIPRT.               11456800
*                                  IF yes, page-in rates will be        11471000
*                                  recalculated               @64BITSRM 11485200
MCVSIPR  DC    H'0' -              CMN RECENT PAGE-IN RATE     @G741PSS 11500000
MCVAMSGI DC    H'0'  -             Count of the number of 204E msgs     11550000
*                                  issued but not deleted from queue    11600000
*                                  of retrievable messages     @YA08835 11650000
MCVSTCRI DC    H'0' -              HIGHEST SYSTEM UIC          @Z40BPCH 11700000
MCVFRCNT DC    H'0' -              SAVED AVAILABLE EXPANDED STORAGE     11750000
*                                  OK THRESHOLD ( RCEAECOK )   @ZA94075 11800000
MCVAVQC  DC    F'0' -              COUNT OF AVQLOWS            @Z40BPCH 11850000
MCVNWSMB DC    F'0'                policy interval base for rcenwsf     11900000
*                                                                  @L8C 11950000
MCVWSMB  DC    F'0'                policy interval base for rcewsdne    12000000
*                                                                  @L8C 12050000
MCCR12   DC    H'0'                                                @L6C 12100000
MCCAMSGT DC    H'10' -             Aux shortage msg threshold  @YA08835 12150000
MCVESWB  DC    F'0'                policy interval base for rceeswrt    12200000
*                                                                  @L8C 12250000
MCCR14   DC    F'0'                                                @L6C 12300000
MCCR15   DC    F'0'                                                @L6C 12350000
MCCR16   DC    F'0'                                                @L6C 12400000
*                                                                       12450000
*        MEMORY CONTROL FLAGS                                           12500000
*                                                                       12550000
MCTSFLGS DC    B'0' -              FLAGS MODIFIED UNDER SALLOC LOCK     12600000
MCTSQA1  EQU   BIT0 -              SQA FIRST LEVEL SHORTAGE             12650000
MCTSQA2  EQU   BIT1 -              SQA SECOND LEVEL SHORTAGE            12700000
MCTAVQ1  EQU   BIT2 -              AVQ BELOW LIMIT                      12750000
MCTOFLGS DC    B'0' -              FLAGS MODIFIED UNDER SRM LOCK        12800000
MCTASM1  EQU   BIT0 -              ASM FIRST LEVEL SHORTAGE             12850000
MCTASM2  EQU   BIT1 -              ASM SECOND LEVEL SHORTAGE            12900000
MCTUICXF EQU   BIT2 -              SRB SCHED FOR UIC UPDATING  @G50IPCH 12950000
MCTAMS2  EQU   BIT3 -              ASM SECOND LEVEL MESSAGE             13000000
MCTSMS1  EQU   BIT4 -              SQA FIRST LEVEL MESSAGE              13050000
MCTSMS2  EQU   BIT5 -              SQA SECOND LEVEL MESSAGE             13100000
MCTFX1   EQU   BIT6 -              FIX PG 1ST LEVEL MSG        @Z40BPCH 13150000
MCTFX2   EQU   BIT7 -              FIX PG 2ND LEVEL MSG        @Z40BPCH 13200000
MCTOFLG1 DC    B'0' -              MORE FLAGS - SRM LOCK       @G742PBP 13250000
*                                                                 2@L6D 13300000
MCTUICCA EQU   BIT2 -              SRB SCHED-COMMON AREA UIC   @ZA42038 13350000
MCTSQAE  EQU   BIT3 -              SQA EXPANDED MESSAGE        @PDD0101 13400000
MCTFXMPL EQU   BIT4 -              REDUCE MPL TO RELIEVE SHORTAGE  @L3A 13450000
*                                                                  @L6D 13500000
MCTLGAVQ EQU   BIT6 -              LOGICAL AVQLOW LEVEL 1          @L3A 13550000
MCTSCBT  EQU   BIT7 -              STOLE COMMON BELOW THRES    @ZA58069 13600000
MCTCFLGS DC    B'0' -              FLAGS TURNED ON UNDER SALLOC LOCK    13650000
*                                  & TURNED OFF UNDER SRM LOCK @ZA42459 13700000
MCTSHORT EQU   BIT0 -              A shortage exists               @LTC 13750000
MCTRLSHT EQU   BIT1 -              All of real pageable storage         13800000
*                                  shortage                        @LTC 13850000
MCTB16SH EQU   BIT2 -              Below the 16 meg line pageable       13900000
*                                  storage shortage                @LTC 13950000
MCTDRSHT EQU   BIT3 -              All of real and DREF pageable        14000000
*                                  storage shortage                @LTA 14050000
MCTPVTI  EQU   BIT4 -              PVT FIELDS INITIALIZED          @LTC 14100000
MCTERCFB EQU   BIT5 -              EXTENDED STORAGE RECONFIGURATION     14150000
*                                  HAS BEGUN                       @LTC 14200000
MCTERCFE EQU   BIT6 -              EXTENDED STORAGE RECONFIGURATION     14250000
*                                  HAS ENDED                       @LTC 14300000
MCTB2GSH EQU   BIT7 -              Between 16M and 2G pageable          14316600
*                                  storage shortage           @64BITSRM 14333200
MCCMS103 DC    V(IRARM103)  -      SQA EXPANDED MSG ADDR       @PDD0101 14350000
*                                                                       14400000
*        TIME INTERVAL VALUES FOR PR1 INVOCATION               @ZM43064 14450000
*                                                                       14500000
MCVTMINQ DC    F'0' -               TIME PR1 LAST RAN IN QUEUE @G860PAM 14550000
MCCFXUIC DC    H'10' -              FIXED FRAME SHORTAGE UIC THRESHOLD  14600000
*                                                              @ZA42459 14650000
MCVCHUIC DC    H'0' -               HIGHEST UIC FOR CURRENTLY ALLOCATED 14700000
*                                   COMMON AREA FRAMES         @G860PGM 14750000
MCVPVTRI DC    H'0' -               HIGHEST PVT AREA UIC       @ZA42038 14800000
MCVHUICE DC    H'0'                 UIC of oldest frame in expanded     14850000
*                                                                  @L8C 14900000
MCCLSWUP DC    H'1' -               TSO LOGICAL SWAP WORKING SET        14950000
*                                   ADJUSTMENT FACTOR          @ZA59747 15000000
MCVDFPGC DC    H'0' -               DEFERRED PAGE REQUEST CT   @ZA64868 15050000
MCVOLDEO DC    F'0' -               Value of RCEAECOK, with amount      15100000
*                                   by which RCEAECOK has been          15150000
*                                   raised for swap-in subtracted       15200000
*                                   out.  Maintained in RM2 so that     15250000
*                                   dynamic adjustment of expanded      15300000
*                                   storage thresholds can be           15350000
*                                   performed correctly.           @LDA 15400000
MCCNCLIM DC    H'3' -               UIC LIMIT FOR NON-SWAPPABLES AND    15450000
*                                   COMMON BEFORE ADJUSTING UPDATE      15500000
*                                   INTERVAL                       @D8C 15550000
MCCNCDEL DC    H'3' -               DELTA IN NON-SWAPPABLE AND COMMON   15600000
*                                   UICS FOR INCREASING UPDATE INTERVAL 15650000
*                                                                  @D8C 15700000
MCCNCMAX DC    H'20' -              MAXIMUM INTERVAL BETWEEN UPDATES    15750000
*                                   FOR NON-SWAPPABLES AND COMMON       15800000
*                                                              @G860PAM 15850000
MCCSWLIM DC    H'5'  -              UIC LIMIT FOR SWAPPABLES BEFORE     15900000
*                                   ADJUSTING UPDATE INTERVAL      @D8C 15950000
MCCSWDEL DC    H'5'  -              DELTA IN SWAPPABLES UIC FOR         16000000
*                                   INCREASING UPDATE INTERVAL     @D8C 16050000
MCCSWMAX DC    H'10' -              MAXIMUM INTERVAL BETWEEN UPDATES    16100000
*                                   FOR SWAPPABLES                 @D8C 16150000
MCVSMXCT DC    F'0'  -              SWAPPABLE MAXIMUM COUNT    @G860PAM 16200000
MCVINC   DC    F'0'                 PR1 INTERVAL COUNT FOR SWAPPABLES   16250000
*                                                              @G860PAM 16300000
MCVCURCT DC    F'0'                 PR1 INTERVAL COUNT FOR COMMON AND   16350000
*                                   NON-SWAPPABLES             @G860PAM 16400000
MCVMAXCT DC    F'0'                 NON-SWAPPABLE AND COMMON MAXIMUM    16450000
*                                   COUNT                      @G860PAM 16500000
MCCSIWDL DC    H'3' -               TWSS DELTA % DECREASE      @ZM49741 16550000
MCCSIWDI DC    H'7' -               TWSS DELTA % INCREASE      @ZM49741 16600000
MCCSIETH DC    F'1000' -            EXEC TIME THRESHOLD FOR PG RATE     16650000
*                                   CALCULATION                @ZM49741 16700000
MCVMIGB  DC    F'0'                BASE MIGRATION COUNT        @YA62416 16750000
MCCR19   DC    F'0'                                                @L6C 16800000
MCCR20   DC    F'0'                                                @L6C 16850000
MCCASCB  DC    V(IEAMASCB)         ASCB PTR FOR PR5 TO UPDATE           16900000
*                                  OUXBFMCT (SYSEVENT EASINIT CHANGES   16950000
*                                  TO GRS ASCB)                @ZMB0389 17000000
MCCMS104 DC    V(IRARM104)  -      SQA NO LONGER EXPANDED MSG  @PDD0101 17050000
*                                                                       17100000
*     THE FOLLOWING TWO FIELDS ARE USED TO INITIALIZE THE RCE           17150000
*     THRESHOLDS THAT CONTROL PAGE REPLACEMENT. THEY ARE ALSO           17200000
*     USED TO CONTROL SWAP IN FAIL PROCESSING                  @G860PGM 17250000
*                                                                       17300000
MCCAVQTH DS    0F -                 AVAIL FRAME QUEUE THRESHOLD     @L3 17350000
MCCAFCLO DC    H'50' -              AVAIL FRAME QUEUE LOW THRESHOLD     17400000
*                                                                  @L6C 17450000
MCCAFCOK DC    H'100' -             AVAIL FRAME QUEUE OK THRESHOLD      17500000
*                                                                  @L6C 17550000
MCCUICTH DC    F'0' -               MIN TIME BEFORE UIC UPDT   @G38APSS 17600000
MCCFXTM1 DC    F'120000' -          FIXED FRAME SHORTAGE TIME THRESHOLD 17650000
*                                                              @ZA42459 17700000
MCCFXTM2 DC    F'360000' -          FIXED FRAME SHORTAGE TIME THRESHOLD 17750000
*                                                              @ZA42459 17800000
MCVCSACV DC    F'0' -               PREVIOUS GDACSACV VALUE    @G860PJC 17850000
MCCDEFFX DC    H'4' -               DEFER FIX THRESHOLD            @L2A 17900000
*                                                                  @L3A 17950000
*        EXTENDED REAL CONSTANTS                                   @L3A 18000000
*                                                                  @L3A 18050000
MCCFXTPR DC    H'0' -  (OPT PARM)  % All of real storage threshold @LTC 18100000
*                                  Note: In ESAME mode, it is also      18110000
*                                  used as                              18120000
*                                  % Between 16M and 2G lines storage   18130000
*                                  threshold                  @64BITSRM 18140000
MCCFXEPR DC    H'0' -  (OPT PARM)  % Below 16M line storage thresold    18150000
*                                                                  @LTC 18200000
MCCR21   DC    H'0'                                                @L6C 18250000
MCCMEDUP DC    H'4' -              MEDIAN FIXED FRAME CNT ADJ UP   @L3A 18300000
MCCMEDDN DC    H'2' -              MEDIAN FIXED FRAME CNT ADJ DOWN @L3A 18350000
MCCSPINT DC    H'100' -            TIME FOR DISABLED SPIN          @L3A 18400000
MCCFFCMP DC    H'3' -              FIXED FRAME COUNT MULTIPLIER FOR     18450000
*                                  AVQ4 PROCESSING                 @L3A 18500000
MCCMAXFX DC    F'0' -              All of real shortage threshold count 18550000
*                                                                  @LTC 18600000
MCCRELCR DC    F'0' -              All of real critical shortage        18650000
*                                  threshold count                 @LTC 18700000
MCCB16CR DC    F'0' -              Below the line critical shortage     18750000
*                                  thresold count                  @LTC 18800000
MCCRELOK DC    F'0' -              All of real OK threshold        @LTC 18850000
MCCB16OK DC    F'0' -              Below the line OK threshold     @LTC 18900000
*                                                                  @L3A 18950000
*        EXTENDED REAL VARIABLES                                   @L3A 19000000
*                                                                  @L3A 19050000
MCVSBFXC DC    F'0' -              FIX CNT ACCUMULATOR             @L3A 19100000
MCVSBFXA DC    H'0' -              AVE FIX % BELOW 16MEG           @L3A 19150000
MCVSBLTF DC    H'0' -              LONG TERM FIX %                 @L3A 19200000
MCVMEDFC DC    H'6' -              MEDIAN FIX FRAME COUNT -             19250000
*                                  READY USERS                     @L3A 19300000
MCVASMCT DC    H'0' -              Samples taken for verification       19350000
*                                  of ASM counts in RM1            @L5C 19400000
MCVCAPWS DC    F'0' -              CAP WORKAREA - WORKING SET SIZE      19450000
*                                  ACCUMULATOR                     @L2A 19500000
MCCMS6L  DC    H'2000'             MS6 INTERVAL LOWER LIMIT        @H2A 19550000
MCVSWUPD DC    H'0' -              SWAP COUNT UPDATE COUNTER       @H4C 19600000
MCVOLDEL DC    F'0' -               Value of RCEAECLO, with amount      19650000
*                                   by which RCEAECLO has been          19700000
*                                   raised for swap-in subtracted       19750000
*                                   out.  Maintained in RM2 so that     19800000
*                                   dynamic adjustment of expanded      19850000
*                                   storage thresholds can be           19900000
*                                   performed correctly.           @LDA 19950000
*                                                                  @H5A 20000000
*        EXTENDED STORAGE VARIABLES                                @H5A 20050000
*                                                                  @H5A 20100000
MCVMGAGE DC    F'20'               EXTENDED STORE MIGRATION AGE    @H5C 20150000
MCVPR9TG DC    F'0'                PR9 TARGET FOR TRIM AND BUILDING     20200000
*                                  SECONDARY WORKING SETS          @H5A 20250000
MCVPR5OU DC    F'0'                OUCBPTR FOR PR5 WHEN REAL THRESHOLDS 20300000
*                                  RAISED                          @H5A 20350000
MCVMGTME DC    F'0'                WAITING-FOR-MIGRATOR TIME STAMP @H5A 20400000
MCVWRAPS DC    F'0'                SAVED VALUE OF RCEWRAPS         @H5A 20450000
MCVMGCNT DC    F'0'                SRM MIGRATION TIME COUNTER      @H5A 20500000
MCVSECWS DC    F'0'                NUMBER OF SECONDARY WORKING SET      20550000
*                                  PAGES FOR WHICH SWAP-INS HAVE BEEN   20600000
*                                  STARTED                         @H6C 20650000
MCVFRSWO DC    F'0'                AVAIL FRAMES SCHEDULED FOR SWAPOUT   20700000
*                                  TO AUX                          @H5A 20750000
MCVSWPES DC    F'0'                AVAIL EFRAMES SCHEDULED FOR SWAPOUT  20800000
*                                  TO EXTENDED                     @H5A 20850000
MCVDEFSE DC    F'0'                DEFER SWAPS TO EXTEND WHEN AVAIL     20900000
*                                  FRAME COUNT EXCEEDS THIS VALUE  @H5A 20950000
MCCDEFAM DC    F'3'                MULTIPLIER OF AFCOK THRESHOLD TO     21000000
*                                  DETERMINE TARGET NUMBER OF FRAMES    21050000
*                                  TO KEEP AVAILABLE               @L6C 21100000
MCCMGTEX DC    F'1000'             MIGRATOR TIME EXCEEDED THRESHOLD     21150000
*                                                              @YA14672 21200000
MCCSWPET DC    F'4'                EFRAMES RESERVED FOR PAGEOUTS BY     21250000
*                                  SWAPS TO EXTENDED               @H5A 21300000
MCCETGHT DC    H'3'                EXTENDED STORE LOW THRESHOLD MULT.   21350000
*                                  TO DETERMINE EXT STORE IS TIGHT @H5A 21400000
MCCAECLO DC    H'150' -            AVAIL EXTENDED FRAME QUEUE LO        21450000
*                                  THRESHOLD                       @P5C 21500000
MCCAECOK DC    H'300' -            AVAIL EXTENDED FRAME QUEUE OK        21550000
*                                  THRESHOLD                       @P5C 21600000
MCCESBMP DC    H'2' -              SWAP TO EXTENDED WORKING SET         21650000
*                                  ADJUSTMENT                      @H5A 21700000
MCCPPSBF DC    H'4'                PAGABLE PAGE PER SEGMENT BUFFER @H5A 21750000
MCCMINTR DC    XL1'64'             MINIMUM AMOUNT OF FRAMES TO TRY      21800000
*                                  FOR PER TRIM ATTEMPT            @P5C 21850000
MCCSIGTR DC    XL1'96'             MIN AMOUNT OF FRAMES AN A.S. CAN     21900000
*                                  HOLD AND BE SIGNIFICANT ENOUGH TO    21950000
*                                  ATTEMPT A TRIM                  @P5A 22000000
MCCSWUPT DC    H'60'               SWAP COUNTER UPDATE THRESHOLD   @H4A 22050000
MCVHICT  DC    FL1'0'              Count of length of high increase     22100000
*                                  interval (for fixed below 16 meg     22150000
*                                  pages) in IRARMRM2              @01C 22200000
MCCFSIDI DC    FL1'14'             TWSS % INCREASE FOR FWA USERS   @L7A 22250000
MCCES0LO DC    FL1'1'              LOW THRESHOLD FOR PERCENT OF TIME    22300000
*                                  RUNNING OUT OF EXTENDED         @H4A 22350000
MCCES0HI DC    FL1'5'              HIGH THRESHOLD FOR PERCENT OF TIME   22400000
*                                  RUNNING OUT OF EXTENDED         @H4A 22450000
MCVES0CT DC    H'0'                MCTESTO0 SAMPLE COUNTER         @H4A 22500000
MCVESSCT DC    H'0'                EXTENDED STORE THRESHOLDS SAMPLE     22550000
*                                  COUNTER                         @H4A 22600000
MCCESSTH DC    H'1000'             EXTENDED STORE THRESHOLDS SAMPLE     22650000
*                                  THRESHOLD                       @H4A 22700000
MCVAECMN DC    F'2147483647'       MINIMUM RCEAEC SAMPLED          @H4A 22750000
MCTEFLGS DC    B'0'                EXTENDED STORE BITS             @H5A 22800000
MCTMIGCN EQU   BIT0                MIGCNSTR SYSEVENT ISSUED        @H5A 22850000
MCTOVRMX EQU   BIT1                AT LEAST ONE STOR ISOL ADDR SP OVER  22900000
*                                  MAX WSS EXISTS                  @H5A 22950000
MCTOVRSI EQU   BIT2                OVERRIDE STOR ISOL IN MIGRATION @H5A 23000000
MCTESNA  EQU   BIT3                EXTENDED STORE NOT AVAILABLE    @H5A 23050000
MCTESTO0 EQU   BIT4                THE AMOUNT OF AVAILABLE EXTENDED     23100000
*                                  STORAGE WENT TO 0               @H6A 23150000
MCTERCFP EQU   BIT5                EXTENDED STORE RECONFIGURATION IN    23200000
*                                  PROGRESS                        @P1A 23250000
MCTEUICS EQU   BIT6                PR1 HAS BEEN SCHEDULED TO BUILD      23300000
*                                  EXPANDED UIC BUCKETS            @L8A 23350000
MCTMIGTU EQU   BIT7                MIGCNSTR tried to unprotect storage  23400000
*                                  but the migrator still could not     23450000
*                                  meet its goal                   @L8A 23500000
MCTEFLG1 DC    B'0'                FLAGS MODIFIED UNDER SRM LOCK   @P2A 23550000
*                                                                  @L6D 23600000
MCTFSTOV EQU   BIT1                FORCE STEAL OVERRIDE        @YA06825 23650000
MCTPEND EQU    BIT2 -              REQSWAP or TRANSWAP pending or fixed 23700000
*                                    storage shortage              @L5A 23750000
MCCMXRIS DC    H'300' -            Maximum amount by which real         23800000
*                                    storage thresholds should be       23850000
*                                    raised on behalf of the DREF       23900000
*                                    pages of an address space that     23950000
*                                    is being considered for swap-in.   24000000
*                                                                  @LDA 24050000
MCCMS700 DC    V(IRARM700) -       VECTOR WAIT MESSAGE ADDRESS     @D1A 24100000
MCVEXPDL DC    F'0'                The amount of increase to the        24150000
*                                    Expanded Storage available frame   24200000
*                                    queue thresholds due to the        24250000
*                                    AVAILPUP SYSEVENT             @LRC 24300000
MCVRELDL DC    F'0'                The amount of increase to the        24350000
*                                    Real Storage available frame       24400000
*                                    queue thresholds due to the        24450000
*                                    AVAILPUP SYSEVENT             @LRC 24500000
MCVMSGPT DC    F'0'                Pointer to message stack        @LTC 24550000
MCVDOMQP DC    F'0'                Pointer to the DOM queue        @LTC 24600000
MCCUICMX DC    F'250'              UIC value to determine if stealing   24650000
*                                  should be attempted instead of       24700000
*                                  trimming                        @L6C 24750000
MCVFPT   DC    F'0'                Fixed and DREF shortage threshold    24800000
*                                  count                           @LTA 24850000
MCCDRFCR DC    F'0'                Fixed and DREF critical shortage     24900000
*                                  threshold count                 @LTA 24950000
MCCDRFOK DC    F'0'                Fixed and DREF OK threshold.    @LTA 25000000
MCVTWSS  DC    F'0'                TARGET WSS FOR COMMON           @D9C 25050000
MCVSIWL  DC    F'0'                CMN LOW WSS SPECIFICATION       @D9C 25100000
MCVSIWH  DC    F'0'                CMN HIGH WSS SPECIFICATION      @D9C 25150000
MCVFMCT  DC    F'0'                CMN EFFECTIVE FRAME COUNT       @D9C 25200000
MCCR23   DC    F'0'                                                @L6C 25250000
MCCMS204 DC    V(IRARM204) -       Aux shortage user msg addr  @YA08835 25300000
MCCMAXSW DC    F'512'              Target maximum number of frames to   25350000
*                                  be swapped for an address space @L5C 25400000
MCVAVQLT DC    F'0'                TIME (RRPATOD) OF LAST LEVEL1        25450000
*                                  AVQLOW SYSEVENT             @YA06825 25500000
MCCTOSEC DC    F'2000'             TWO SECOND VALUE TO FORCE            25550000
*                                  STEAL OVERRIDE              @YA06825 25600000
MCCSTGT  DC    H'977' -            STGTEST TIME INTERVAL (1 SEC)   @L1A 25650000
MCCFXBCO DC    H'10' -             CUT-OFF AMOUNT OF FIXED BELOW        25700000
*                                  FRAMES WHICH ARE STEALABLE      @L4C 25750000
MCVBYTCT DC    F'0'                PREVIOUS BYTE COUNT OF RESERVE       25800000
*                                  STORAGE                         @L1A 25850000
MCVBLKCT DC    F'0'                PREVIOUS BLOCK COUNT OF RESERVE      25900000
*                                  STORAGE                         @L1A 25950000
MCVSWPAS DC    F'0'                Address of user picked for MS2 in    26000000
*                                  QSCECMP                         @L5C 26050000
MCVOLDCL DC    F'0'                The "base" low central storage       26100000
*                                  threshold component             @L6C 26150000
MCVOLDCO DC    F'0'                The "base" OK central storage        26200000
*                                  threshold component             @L6C 26250000
MCVPTLMT DC    F'0'                Processor threshold raising limit    26300000
*                                                                  @L6C 26350000
MCVLSD   DC    F'0'                Number of logical swap discretionary 26400000
*                                  frames in the system            @L6C 26450000
MCVMINDF DC    F'0'                This is the minimum error between    26500000
*                                  ASM system pageouts in progress      26550000
*                                  received count and ASM pageouts in   26600000
*                                  progress completed count.       @L9C 26650000
MCVPGINS DC    F'0'                Page-ins rate count used for         26700000
*                                  calculating the system paging rate   26750000
*                                                                  @L6C 26800000
MCVAVAIL DC    F'0'                The number of Central and Expanded   26850000
*                                  available frames for input to        26900000
*                                  IRARMTSI                        @L6C 26950000
MCVUIC1  DC    F'0'                total number of UIC bucket 1 frames  27000000
*                                  in the system                   @L6A 27050000
MCVUIC2  DC    F'0'                total number of UIC bucket 2 frames  27100000
*                                  in the system                   @L6A 27150000
MCVUIC3  DC    F'0'                total number of UIC bucket 3 frames  27200000
*                                  in the system                   @L6A 27250000
MCVUIC4  DC    F'0'                total number of UIC bucket 4 frames  27300000
*                                  in the system                   @L6A 27350000
MCVUIC1S DC    F'0'                total number of UIC bucket 1 frames  27400000
*                                  in the system adjusted by storage    27450000
*                                  isolation                       @L6A 27500000
MCVUIC2S DC    F'0'                total number of UIC bucket 2 frames  27550000
*                                  in the system adjusted by storage    27600000
*                                  isolation                       @L6A 27650000
MCVUIC3S DC    F'0'                total number of UIC bucket 3 frames  27700000
*                                  in the system adjusted by storage    27750000
*                                  isolation                       @L6A 27800000
MCVUIC4S DC    F'0'                total number of UIC bucket 4 frames  27850000
*                                  in the system adjusted by storage    27900000
*                                  isolation                       @L6A 27950000
MCVUIC1C DC    F'0'                number of UIC bucket 1 frames in the 28000000
*                                  common area adjusted by storage      28050000
*                                  isolation                       @L6A 28100000
MCVUIC2C DC    F'0'                number of UIC bucket 2 frames in the 28150000
*                                  common area adjusted by storage      28200000
*                                  isolation                       @L6A 28250000
MCVUIC3C DC    F'0'                number of UIC bucket 3 frames in the 28300000
*                                  common area adjusted by storage      28350000
*                                  isolation                       @L6A 28400000
MCVUIC4C DC    F'0'                number of UIC bucket 4 frames in the 28450000
*                                  common area adjusted by storage      28500000
*                                  isolation                       @L6A 28550000
MCVMFXA  DC    H'0' -              Average percentage of total frames   28600000
*                                  fixed below on the previous          28650000
*                                  invocation of IRARMRM2          @01C 28700000
MCCCBBT  DC    H'32'               Central/Below 16 meg Balance         28750000
*                                  Threshold                       @01C 28800000
MCVEUIC1 DC    F'0'                expanded storage UIC bucket 1   @L8C 28850000
MCVEUIC2 DC    F'0'                expanded storage UIC bucket 2   @L8C 28900000
MCVEUIC3 DC    F'0'                expanded storage UIC bucket 3   @L8C 28950000
MCVEUIC4 DC    F'0'                expanded storage UIC bucket 4   @L8C 29000000
MCVEXWSD DC    F'0'                Count of discretionary expanded      29050000
*                                  storage frames                  @L8A 29100000
MCVEUICC DC    F'0'                Count of invocations of pr1 to       29150000
*                                  determine when to build the expanded 29200000
*                                  uic buckets                     @L8A 29250000
MCVMXEUC DC    F'60'               Number of pr1 invocations before     29300000
*                                  expanded uic buckets built      @L8A 29350000
MCVCMPIB DC    F'0'                Base value for common pages paged in 29400000
*                                  from aux (base for rcecompi)    @L8A 29450000
MCVCUBD1 DC    H'0'                UIC bucket delimiter            @L8A 29500000
MCVCUBD2 DC    H'0'                UIC bucket delimiter            @L8A 29550000
MCVCUBD3 DC    H'0'                UIC bucket delimiter            @L8A 29600000
MCVCS0CT DC    H'0'                central stor to 0 sample count  @L8A 29650000
MCVCSSCT DC    H'0'                Central  STORE THRESHOLDS SAMPLE     29700000
*                                  COUNTER                         @L8A 29750000
MCVSHUIC DC    H'0'                High UIC for shared frames      @LAC 29800000
MCVAFCMN DC    F'2147483647'       MINIMUM RCEAFC SAMPLED          @L8A 29850000
MCVSTWSS DC    F'0'                Protective processor storage         29900000
*                                  target for shared area          @LAA 29950000
MCVSAUXB DC    F'0'                Base for RceSgAux               @LAA 30000000
MCVSUIC1 DC    F'0'                Shared area central UIC bucket  @LAA 30050000
MCVSUIC2 DC    F'0'                Shared area central UIC bucket  @LAA 30100000
MCVSUIC3 DC    F'0'                Shared area central UIC bucket  @LAA 30150000
MCVSUIC4 DC    F'0'                Shared area central UIC bucket  @LAA 30200000
MCVSEUC1 DC    F'0'                Shared area expanded UIC bucket @LAA 30250000
MCVSEUC2 DC    F'0'                Shared area expanded UIC bucket @LAA 30300000
MCVSEUC3 DC    F'0'                Shared area expanded UIC bucket @LAA 30350000
MCVSEUC4 DC    F'0'                Shared area expanded UIC bucket @LAA 30400000
MCVSGAUX DC    F'0'                Shared pages on aux count, base for  30450000
*                                  aux shortage processing         @LAA 30500000
MCVSAUXT DC    F'0'                Time of last ASM invocation that     30550000
*                                  calculated shared frame usage   @LAA 30600000
*                                                                       30602200
*        ESAME EXTENSIONS                                               30604400
*                                                                       30606600
MCCUICUP DC    H'1'                Interval (in seconds) at which UIC   30608800
*                                  update processing is taking place.   30611000
*                                  In ESA mode this value will be 1,    30613200
*                                  in ESAME mode the value will be 10.  30615400
*                                  Note that in ESAME mode              30617600
*                                  not necessarily all address space    30619800
*                                  UICs are updated in one run. SRM     30622000
*                                  may release the SRM lock inbetween   30624200
*                                  and continue UIC update processing   30626400
*                                  later                      @64BITSRM 30628600
MCCCONBT DC    H'20'               UIC value, below which frames may    30630800
*                                  stolen from CASTOUT(NO) hiperspaces  30633000
*                                  (ESAME mode only)          @64BITSRM 30635200
MCCEMDIT DC    A(500000/1024)      Maximum disabled time for STEAL and  30637400
*                                  and UIC Update processing            30639600
*                                  before SRM opens an enabled window   30641800
*                                  in ESAME mode (srm_time units:       30644000
*                                  01x=1.024 milliseconds). The value   30646200
*                                  is set in IEAVNP10 dependant on the  30648400
*                                  mode, but the value will be used     30650600
*                                  in ESAME mode only         @64BITSRM 30652800
MCCMAXBT DC    F'0'                Between 16M and 2G pageable          30655000
*                                  storage shortage threshold count     30657200
*                                  (ESAME mode only)          @64BITSRM 30659400
MCCB2GCR DC    F'0'                Between 16M and 2G pageable          30661600
*                                  storage critical shortage            30663800
*                                  threshold count                      30666000
*                                  (ESAME mode only)          @64BITSRM 30668200
MCCB2GOK DC    F'0'                Between 16M and 2G pageable          30670400
*                                  storage OK threshold count           30672600
*                                  (ESAME mode only)          @64BITSRM 30674800
MCCQDRSV DC    H'5'                Percentage of quad frame groups to   30677000
*                                  be kept free.  SRM invokes           30679200
*                                  RSM quad frame steal processing      30681400
*                                  if less than 5% (MCCQDRSV) of the    30683600
*                                  number of allocated quad frame       30685800
*                                  groups is available.                 30688000
*                                  (ESAME mode only)          @64BITSRM 30690200
*                                                                       30692400
MCCR02   DC    H'0'                reserved                   @64BITSRM 30694600
MCCR01   DC    2F'0'               reserved                   @64BITSRM 30696800
MCTEND   DS    0F -                END OF MCT                           30700000
MCTLEN   EQU   MCTEND-MCT -        LENGTH OF MCT                        30750000
         MEND                                                           30800000
*        */                                                             30850000
*%MCTPLS2 : ;                                                           30900000
*                                  /*                           2@L8D*/ 30950000
*    %IF MCTLEVEL~=''              /* IF MINOR LEVEL IS SPECIFIED,   */ 31000000
*      %THEN %GOTO MCTPLS3;        /* SKIP MAJOR DECLARE             */ 31050000
*DECLARE                           /*                                */ 31100000
*  1 MCT BASED(MCTPTR)             /* STORAGE CONTROL TABLE          */ 31150000
*    %GOTO MCTPLS4;                /* MAJOR STRUCTURE                */ 31200000
*%MCTPLS3: MCTDUM=MCTLEVEL||' MCT'; /* CONCATENATE AS MINOR STRUCTURE*/ 31250000
*  MCTDUM                          /* STORAGE CONTROL TABLE          */ 31300000
*%MCTPLS4:;                                                             31350000
*        BDY(DWORD),                                                    31400000
*      5 MCTMCT CHAR(4),           /* ACRONYM IN EBCDIC -MCT-        */ 31450000
*/*                                                                  */ 31500000
*/*      STORAGE CONTROL CONSTANTS                                   */ 31550000
*/*                                                                  */ 31600000
*/* POINTERS TO SHORTAGE MESSAGES                                    */ 31650000
*      5 MCCMS100 PTR(31),         /* SQA SHORTAGE MESSAGE ADDRESS   */ 31700000
*      5 MCCMS101 PTR(31),         /* CRITICAL SQA SHORTAGE MSG ADDR */ 31750000
*      5 MCCMS102 PTR(31),         /* SQA SHORTAGE RELIEVED MSG ADDR */ 31800000
*      5 MCCMS200 PTR(31),         /* AUX SHORTAGE MESSAGE ADDRESS   */ 31850000
*      5 MCCMS201 PTR(31),         /* CRITICAL AUX SHORTAGE MSG ADDR */ 31900000
*      5 MCCMS202 PTR(31),         /* AUX SHORTAGE RELIEVED MSG ADDR */ 31950000
*      5 MCCMS203 PTR(31),         /* AUX SHORTAGE USER MESSAGE ADDRESS 32000000
*                                                            @ZM43072*/ 32050000
*      5 MCCMS400 PTR(31),         /* FIX PAGE SHORTAGE MSG ADDR        32100000
*                                                            @Z40BPCH*/ 32150000
*      5 MCCMS401 PTR(31),         /* CRITICAL FIX PAGE SHORTAGE MSG    32200000
*                                     ADDR                   @Z40BPCH*/ 32250000
*      5 MCCMS402 PTR(31),         /* FIX PAGE SHORTAGE RELIEVED        32300000
*                                     MSG ADDR               @Z40PBCH*/ 32350000
*      5 MCCMS403 PTR(31),         /* FIX PAGE USER MESSAGE ADDRESS     32400000
*                                                            @ZM43072*/ 32450000
*      5 MCCMS500 PTR(31),         /* SWAP IN FAIL USER MESSAGE         32500000
*                                     ADDRESS                @ZA31942*/ 32550000
*      5 MCCMS501 PTR(31),          /* PTR TO SWAP IN MSG    @ZA31942*/ 32600000
*/*                                                                  */ 32650000
*/* STORAGE CONTROL CONSTANTS                                @Z40BPCH*/ 32700000
*/*                                                                  */ 32750000
*      5 MCCPLUS FIXED(15),        /* AVAILABLE FRAME QUEUE DELTA FOR   32800000
*                                     STEALING               @Z40BPCH*/ 32850000
*      5 MCCSTLCT FIXED(15),       /* NO OF PAGES TO STEAL FROM EACH    32900000
*                                     ADSPC OR COMMON EACH STEAL        32950000
*                                     PASS WITH LOW UICS     @G860PAM*/ 33000000
*      5 MCCHSTLC FIXED(15),      /* NO OF PAGES TO STEAL FROM EACH     33050000
*                                    ADSPC OR COMMON FOR STEAL PASS     33100000
*                                    WITH HIGH UICS          @G860PAM*/ 33150000
*      5 MCCSIPRT FIXED(15),       /* TIME BETWEEN PAGE-IN RATE         33200000
*                                     CALCULATIONS           @G741PSS*/ 33250000
*      5 MCCDFRPC FIXED(15),      /* DOUBLE FRAME REPLENISH VALUE       33300000
*                                                            @G860PSS*/ 33350000
*      5 MCCDFREC FIXED(15),      /* DOUBLE FRAME RELEASE VALUE         33400000
*                                                            @G860PSS*/ 33450000
*        5 MCCSPCPT FIXED(15),      /* System Paging Cost Percentage    33500000
*                                  threshold for determining if any     33550000
*                                  address spaces should be monitored   33600000
*                                                                @L6C*/ 33650000
*        5 MCCAPCPT FIXED(15),      /* Address Space Page Cost Percent  33700000
*                                     threshold for determining if this 33750000
*                                     address space should be monitored 33800000
*                                                                @L6C*/ 33850000
*      5 MCCDUMP  PTR(31),    /* DUMPSRV OUCB ADDRESS            @P8C*/ 33900000
*/* Lengths used by SMF ---------------------------------    @WLMPGMY*/ 33922200
*      5 MCCICSPL FIXED(16),  /* Length of IRAICSP.ICSP      @WLMPGMY*/ 33944400
*      5 MCCRQSVL FIXED(16),  /* Length of IRARQSRV.RQSV     @WLMPGMY*/ 33966600
*      5 MCCE39PL FIXED(16),  /* Length of IRAE39P.E39P      @WLMPGMY*/ 33988800
*      5 MCCRSDL  FIXED(16),  /* Length of IRARSD.RSD        @WLMPGMY*/ 34011000
*/* -----------------------------------------------------    @WLMPGMY*/ 34033200
*      5 MCCOUCBL FIXED(16),  /* Length of IRAOUCB.OUCB      @WLMPGMY*/ 34055400
*      5 MCCR5    FIXED(15),  /*                                 @L6C*/ 34077600
*      5 MCCFXBPR FIXED(15),  /* Fixed Below High Percentage            34100000
*                                Threshold                       @01C*/ 34150000
*      5 MCCSIGRS FIXED(15),  /* WORKING SET SIZE TARGET FOR ENQ/DEQ    34200000
*                                ADDRESS SPACE               @WA12444*/ 34250000
*      5 MCCR7    FIXED(31),  /*                                 @L6C*/ 34300000
*      5 MCCR8    FIXED(31),  /*                                 @L6C*/ 34350000
*      5 MCCR9    FIXED(31),  /*                                 @L6C*/ 34400000
*/*                                                                  */ 34450000
*/* AUX STORAGE MONITORING CONSTANTS                                 */ 34500000
*/*                                                                  */ 34550000
*      5 MCCASMT1 FIXED(15),       /* FIRST AUX SHORTAGE THRESHOLD   */ 34600000
*      5 MCCASMT2 FIXED(15),       /* SECOND AUX SHORTAGE THRESHOLD  */ 34650000
*      5 MCCEND CHAR(0) BDY(WORD), /* END OF MCT CONSTANTS           */ 34700000
*/*                                                                  */ 34750000
*/*      STORAGE CONTROL VARIABLES                                   */ 34800000
*/*                                                                  */ 34850000
*      5 MCVSIFLG BIT(8),          /* STORAGE ISOLATION FLG  @G741PSS*/ 34900000
*        10 MCVSIPG BIT(1),        /* ADS STG ISOL IN EFFECT @G741PSS*/ 34950000
*        10 MCVSICM BIT(1),        /* CMN STG ISOL IN EFFECT @G741PSS*/ 35000000
*        10 MCVSIWS BIT(1),        /* CMN STORAGE PROTECTED BY WORKING  35050000
*                                     SET SIZE               @G741PSS*/ 35100000
*        10 MCVSIPI BIT(1),        /* CMN STORAGE PROTECTED BY PAGE     35150000
*                                     IN RATE                @G741PSS*/ 35200000
*        10 MCVSIR4 BIT(4),        /* RESERVED               @G741PSS*/ 35250000
*      5 MCCLIPT  FIXED(8),       /*Large increase percentage threshold 35300000
*                                   for fixed below pages        @01C*/ 35350000
*      5 MCCASPCT FIXED(8),        /* % OF AUX STORAGE TO RECOMMEND     35400000
*                                                                @L1A*/ 35450000
*      5 MCCRSPCT FIXED(8),        /* % OF REAL STORAGE TO RECOMMEND    35500000
*                                                                @L1A*/ 35550000
*      5 MCVSTGPT FIXED(31),       /* TIME OF PREVIOUS STGTEST          35600000
*                                     CALL                       @L1A*/ 35650000
*      5 MCVSIPL  FIXED(15),       /* CMN LOW PAGE-IN RATE   @G741PSS*/ 35700000
*      5 MCVSIPH  FIXED(15),       /* CMN HIGH PAGE-IN RATE  @G741PSS*/ 35750000
*      5 MCVSIBP  FIXED(31),       /* CMN BASE PAGE-IN CNT   @G741PSS*/ 35800000
*      5 MCVSIBT  FIXED(32),       /* Base TOD value for page-in rate   35821400
*                                     calculations. In PR1 we will      35842800
*                                     check, if current time-MCVSIBT    35864200
*                                     is less than MCCSIPRT.            35885600
*                                     IF yes, page-in rates will be     35907000
*                                     recalculated          @64BITSRM*/ 35928400
*      5 MCVSIPR  FIXED(15),       /* CMN RECENT PAGEIN RATE @G741PSS*/ 35950000
*      5 MCVAMSGI FIXED(15),       /* Count of the number of 204E msgs  36000000
*                                      that have been issued but not    36050000
*                                      deleted from queue of            36100000
*                                      retrievable messages  @YA08835*/ 36150000
*      5 MCVSTCRI FIXED(15),       /* HIGHEST SYSTEM UIC     @Z40BPCH*/ 36200000
*      5 MCVFRCNT FIXED(15),       /* SAVED AVAILABLE EXPANDED STORAGE  36250000
*                                    OK THRESHOLD (RCEAECOK) @ZA94075*/ 36300000
*      5 MCVAVQC FIXED(31),        /* COUNT OF AVQLOWS       @Z40BPCH*/ 36350000
*      5 MCVNWSMB FIXED(32),  /* policy interval base for rcenwsf       36400000
*                                                                @L8C*/ 36450000
*      5 MCVWSMB  FIXED(32),  /* policy interval base for rcewsdne      36500000
*                                                                @L8C*/ 36550000
*      5 MCCR12   FIXED(15),  /*                                 @L6C*/ 36600000
*      5 MCCAMSGT FIXED(15), /* Aux storage shortage msg threshold      36650000
*                                                            @YA08835*/ 36700000
*      5 MCVESWB  FIXED(32),  /* policy interval base for rceeswrt      36750000
*                                                                @L8C*/ 36800000
*      5 MCCR14   FIXED(31),  /*                                 @L6C*/ 36850000
*      5 MCCR15   FIXED(31),  /*                                 @L6C*/ 36900000
*      5 MCCR16   FIXED(31),  /*                                 @L6C*/ 36950000
*/*                                                                  */ 37000000
*/*      MEMORY CONTROL FLAGS                                        */ 37050000
*/*                                                                  */ 37100000
*      5 MCTSFLGS BIT(8),          /* FLAGS MODIFIED UNDER SALLOC LCK*/ 37150000
*        10 MCTSQA1 BIT(1),        /* SQA FIRST LEVEL SHORTAGE       */ 37200000
*        10 MCTSQA2 BIT(1),        /* SQA SECOND LEVEL SHORTAGE      */ 37250000
*        10 MCTAVQ1 BIT(1),        /* AVQ BELOW LIMIT                */ 37300000
*        10 MCTSF05 BIT(5),        /* RESERVED               @ZA42459*/ 37350000
*      5 MCTOFLGS BIT(8),          /* FLAGS MODIFIED UNDER SRM LOCK  */ 37400000
*        10 MCTASM1 BIT(1),        /* ASM FIRST LEVEL SHORTAGE       */ 37450000
*        10 MCTASM2 BIT(1),        /* ASM SECOND LEVEL SHORTAGE      */ 37500000
*        10 MCTUICXF BIT(1),       /* SRB SCHED FOR UIC UPDT @G50IPCH*/ 37550000
*        10 MCTAMS2 BIT(1),        /* ASM SECOND LEVEL MESSAGE       */ 37600000
*        10 MCTSMS1 BIT(1),        /* SQA FIRST LEVEL MESSAGE        */ 37650000
*        10 MCTSMS2 BIT(1),        /* SQA SECOND LEVEL MESSAGE       */ 37700000
*        10 MCTFX1  BIT(1),        /* FIX PG 1ST LEVEL MSG   @Z40BPCH*/ 37750000
*        10 MCTFX2  BIT(1),        /* FIX PG 2ND LEVEL MSG   @Z40BPCH*/ 37800000
*      5 MCTOFLG1 BIT(8),          /* MORE FLAGS - SRM LOCK  @G742PBP*/ 37850000
*        10 *        BIT(2),       /*                            @L6C*/ 37900000
*        10 MCTUICCA BIT(1),       /* SRB SCHED-COMMON UIC   @ZA42038*/ 37950000
*        10 MCTSQAE BIT(1),        /* SQA EXPANDED MSG       @PDD0101*/ 38000000
*        10 MCTFXMPL BIT(1),   /* REDUCE MPL TO RELIEVE SHORTAGE @L3A*/ 38050000
*        10 *        BIT(1),       /*                            @L6C*/ 38100000
*        10 MCTLGAVQ BIT(1),       /* LOGICAL AVQLOW LEVEL 1     @L3A*/ 38150000
*        10 MCTSCBT  BIT(1),       /* STOLE CMN BELOW THRES  @ZA58069*/ 38200000
*      5 MCTCFLGS BIT(8) ABNL,    /* FLAGS TURNED ON UNDER SALLOC LOCK  38250000
*                                    & OFF UNDER SRM LOCK    @ZA42459*/ 38300000
*        10 MCTSHORT BIT(1),      /* A shortage exists           @LTC*/ 38350000
*        10 MCTRLSHT BIT(1),      /* All of real pageable storage       38400000
*                                    shortage.                   @LTC*/ 38450000
*        10 MCTB16SH BIT(1),      /* Below the line pageable storage    38500000
*                                    shortage.                   @LTC*/ 38550000
*        10 MCTDRSHT BIT(1),      /* All of real and DREF pageable      38600000
*                                    storage shortage            @LTA*/ 38650000
*        10 MCTPVTI  BIT(1),      /* PVT FIELDS INITIALIZED      @L3A*/ 38700000
*        10 MCTERCFB BIT(1),      /* EXTENDED STORAGE RECONFIGURATION   38750000
*                                    HAS BEGUN                   @P1A*/ 38800000
*        10 MCTERCFE BIT(1),      /* EXTENDED STORAGE RECONFIGURATION   38850000
*                                    HAS ENDED                   @P1A*/ 38900000
*        10 MCTB2GSH BIT(1),      /* Between 16M and 2G pageable        38933300
*                                    storage shortage       @64BITSRM*/ 38966600
*      5 MCCMS103 PTR(31),        /* SQA EXPANDED MSG ADDR   @PDD0101*/ 39000000
*/*                                                                  */ 39050000
*/*    TIME INTERVAL VALUES FOR PR1 INVOCATION               @ZM43064*/ 39100000
*/*                                                                  */ 39150000
*        5 MCVTMINQ FIXED(32),      /* TIME PR1 LAST RAN IN QUEUE       39200000
*                                                            @G860PAM*/ 39250000
*        5 MCCFXUIC FIXED(15),     /* FIXED FRAME SHORTAGE  UIC         39300000
*                                     THRESHOLD              @ZA42459*/ 39350000
*        5 MCVCHUIC FIXED(15),     /* HIGHEST UIC FOR CURRENTLY         39400000
*                               ALLOCATED COMMON AREA FRAMES @G860PGM*/ 39450000
*        5 MCVPVTRI FIXED(15),    /* HIGHEST UIC - PVT AREA  @ZA42038*/ 39500000
*        5 MCVHUICE FIXED(15),    /* UIC of oldest frame in expanded    39550000
*                                                                @L8C*/ 39600000
*        5 MCCLSWUP FIXED(15),      /* TSO LOGICAL SWAP WORKING SET     39650000
*                                      ADJUSTMENT FACTOR     @ZA59747*/ 39700000
*        5 MCVDFPGC FIXED(15),      /* DEFERRED PAGE REQ CT  @ZA64868*/ 39750000
*        5 MCVOLDEO FIXED(31),      /* Value of RCEAECOK, with amount   39800000
*                                      by which RCEAECOK has been       39850000
*                                      raised for swap-in subtracted    39900000
*                                      out.  Maintained in RM2 so that  39950000
*                                      dynamic adjustment for expanded  40000000
*                                      storage thresholds can be        40050000
*                                      performed correctly.      @LDC*/ 40100000
*        5 MCCNCLIM FIXED(15),      /* UIC LIMIT FOR NON-SWAPPABLES     40150000
*                                      AND COMMON BEFORE ADJUSTING      40200000
*                                      UPDATE INTERVAL       @G860PAM*/ 40250000
*        5 MCCNCDEL FIXED(15),      /* DELTA IN NON-SWAPPABLES AND      40300000
*                                      COMMON UICS FOR INCREASING       40350000
*                                      UPDATE INTERVAL       @G860PAM*/ 40400000
*        5 MCCNCMAX FIXED(15),      /* MAXIMUM INTERVAL BETWEEN UPDATES 40450000
*                                      FOR NON-SWAPPABLES AND COMMON    40500000
*                                                            @G860PAM*/ 40550000
*        5 MCCSWLIM FIXED(15),      /* UIC LIMIT FOR SWAPPABLES BEFORE  40600000
*                                      ADJUSTING UPDATE INTERVAL        40650000
*                                                            @G860PAM*/ 40700000
*        5 MCCSWDEL FIXED(15),      /* DELTA IN SWAPPABLES UICS FOR     40750000
*                                      INCREASING UPDATE INTERVAL       40800000
*                                                            @G860PAM*/ 40850000
*        5 MCCSWMAX FIXED(15),      /* MAXIMUN INTERVAL BETWEEN UPDATES 40900000
*                                      FOR SWAPPABLES        @G860PAM*/ 40950000
*        5 MCVSMXCT FIXED(31),      /* SWAPPABLE MAXIMUM COUNT          41000000
*                                                            @G860PAM*/ 41050000
*        5 MCVINC FIXED(31),      /* PR1 INTERVAL COUNT FOR SWAPPABLES  41100000
*                                                            @G860PAM*/ 41150000
*        5 MCVCURCT FIXED(31),    /* PR1 INTERVAL COUNT FOR COMMON AND  41200000
*                                    NON-SWAPPABLES          @G860PAM*/ 41250000
*        5 MCVMAXCT FIXED(31),    /* NON-SWAPPABLES AND COMMON          41300000
*                                    MAXIMUM COUNT           @G860PAM*/ 41350000
*        5 MCCSIWDL FIXED(15),     /* % OF WORKING SET SIZE TWSS IS TO  41400000
*                                     BE LOWERED BY          @ZM49741*/ 41450000
*        5 MCCSIWDI FIXED(15),     /* % OF WORKING SET SIZE TWSS IS TO  41500000
*                                     BE INCREASED BY        @ZM49741*/ 41550000
*        5 MCCSIETH FIXED(31),      /* EXEC TIME THRESHOLD FOR PAGING   41600000
*                                      RATE CALCULATE        @ZM49741*/ 41650000
*        5 MCVMIGB  FIXED(31),      /* BASE MIGRATION COUNT  @YA62416*/ 41700000
*        5 MCCR19   FIXED(31),      /*                           @L6C*/ 41750000
*        5 MCCR20   FIXED(31),      /*                           @L6C*/ 41800000
*        5 MCCASCB  PTR(31),        /* ASCB PTR FOR PR5 TO UPDATE       41850000
*                                      OUXBFMCT              @ZMB0219*/ 41900000
*        5 MCCMS104 PTR(31),        /* SQA NO LONGER EXPANDED MESSAGE   41950000
*                                      ADDRESS               @PDD0101*/ 42000000
*/*                                                                  */ 42050000
*/*   THE FOLLOWING TWO FIELDS ARE USED TO INITIALIZE THE RCE        */ 42100000
*/*   THRESHOLDS THAT CONTROL PAGE REPLACEMENT. THEY ARE ALSO        */ 42150000
*/*   USED TO CONTROL SWAP IN FAIL PROCESSING                @G860PGM*/ 42200000
*/*                                                                  */ 42250000
*        5 MCCAVQTH FIXED(32),      /* AVAIL FRAME LOW THRESHOLD @L3A*/ 42300000
*        6 MCCAFCLO FIXED(15),      /* AVAIL FRAME QUEUE LOW THRESHOLD  42350000
*                                                            @ZA31942*/ 42400000
*        6 MCCAFCOK FIXED(15),      /* AVAIL FRAME QUEUE OK THRESHOLD   42450000
*                                                            @ZA31942*/ 42500000
*        5 MCCUICTH FIXED(31),      /* MIN TIME BEFORE UIC UPDATING     42550000
*                                                            @G38APSS*/ 42600000
*        5 MCCFXTM1 FIXED(31),    /* FIXED FRAME SHORTAGE TIME          42650000
*                                    THRESHOLD               @ZA42459*/ 42700000
*        5 MCCFXTM2 FIXED(31),    /* FIXED FRAME SHORTAGE TIME          42750000
*                                    THRESHOLD               @ZA42459*/ 42800000
*        5 MCVCSACV FIXED(31),      /* PREV GDACSACV VALUE   @G860PJC*/ 42850000
*        5 MCCDEFFX FIXED(15),      /* DEFER FIX THRESHOLD       @L2A*/ 42900000
*/*                                                              @L3A*/ 42950000
*/*      EXTENDED REAL CONSTANTS                                 @L3A*/ 43000000
*/*                                                              @L3A*/ 43050000
*        5 MCCFXTPR FIXED(15),      /* % All of real storage threshold  43100000
*                                      Note: In ESAME mode, it is also  43120000
*                                      used as                          43140000
*                                      % Between 16M and 2G lines       43160000
*                                      storage threshold    @64BITSRM*/ 43180000
*        5 MCCFXEPR FIXED(15),      /* % Below 16M line storage         43200000
*                                      threshold                 @LTC*/ 43250000
*        5 MCCR21   FIXED(15),      /*                           @L6C*/ 43300000
*        5 MCCMEDUP FIXED(15),      /* MEDIAN FIXED FRAME COUNT         43350000
*                                      ADJUSTMENT UP             @L3A*/ 43400000
*        5 MCCMEDDN FIXED(15),      /* MEDIAN FIXED FRAME COUNT         43450000
*                                       ADJUSTMENT DOWN          @L3A*/ 43500000
*        5 MCCSPINT FIXED(15),      /* TIME FOR DISABLED SPIN    @L3A*/ 43550000
*        5 MCCFFCMP FIXED(15),      /* FIXED FRAME COUNT MULTIPLIER     43600000
*                                      FOR AVQ4 PROCESSING       @L3A*/ 43650000
*        5 MCCMAXFX FIXED(31),      /* All of real shortage threshold   43700000
*                                      count                     @LTC*/ 43750000
*        5 MCCRELCR FIXED(31),      /* All of real critical shortage    43800000
*                                      threshold count           @LTC*/ 43850000
*        5 MCCB16CR FIXED(31),      /* Below the line critical shortage 43900000
*                                      threshold count           @LTC*/ 43950000
*        5 MCCRELOK FIXED(31),      /* All of real OK threshold  @LTC*/ 44000000
*        5 MCCB16OK FIXED(31),      /* Below the line OK threshold      44050000
*                                                                @LTC*/ 44100000
*/*                                                              @L3A*/ 44150000
*/*      EXTENDED REAL VARIABLES                                 @L3A*/ 44200000
*/*                                                              @L3A*/ 44250000
*        5 MCVSBFXC FIXED(31),      /* FIX CNT ACCUMULATOR       @L3A*/ 44300000
*        5 MCVSBFXA FIXED(15),      /* AVE FIX % BELOW 16MEG     @L3A*/ 44350000
*        5 MCVSBLTF FIXED(15),      /* LONG TERM FIX %           @L3A*/ 44400000
*        5 MCVMEDFC FIXED(15),      /* MEDIAN FIX FRAME COUNT -         44450000
*                                      READY USERS               @L3A*/ 44500000
*        5 MCVASMCT FIXED(15),      /* Samples taken for verification   44550000
*                                      of ASM counts in RM1      @L5C*/ 44600000
*        5 MCVCAPWS FIXED(31),      /* CAP WORKAREA - WORKING SET SIZE  44650000
*                                      ACCUMULATOR               @L2A*/ 44700000
*        5 MCCMS6L FIXED(15),       /* MS6 INTERVAL LOWER LIMIT  @H2A*/ 44750000
*        5 MCVSWUPD FIXED(15),      /* SWAP COUNTER UPDATE CTR   @H4C*/ 44800000
*        5 MCVOLDEL FIXED(31),      /* Value of RCEAECLO, with amount   44850000
*                                      by which RCEAECLO has been       44900000
*                                      raised for swap-in subtracted    44950000
*                                      out.  Maintained in RM2 so that  45000000
*                                      dynamic adjustment for expanded  45050000
*                                      storage thresholds can be        45100000
*                                      performed correctly.      @LDC*/ 45150000
*/*                                                              @H5A*/ 45200000
*/*      EXTENDED STORAGE VARIABLES                              @H5A*/ 45250000
*/*                                                              @H5A*/ 45300000
*        5 MCVMGAGE FIXED(31),      /* EXTENDED STORE MIGRATION AGE     45350000
*                                                                @H4C*/ 45400000
*        5 MCVPR9TG FIXED(31),      /* PR9 TARGET FOR TRIM AND BUILDING 45450000
*                                      SECONDARY WORKING SETS    @H5A*/ 45500000
*        5 MCVPR5OU PTR(31),        /* OUCBPTR FOR PR5 WHEN REAL        45550000
*                                      THRESHOLDS RAISED         @H5A*/ 45600000
*        5 MCVMGTME FIXED(32),      /* WAITING-FOR-MIGRATOR TIME        45650000
*                                      STAMP                     @H5A*/ 45700000
*        5 MCVWRAPS FIXED(32),      /* SAVED VALUE OF RCEWRAPS   @H5A*/ 45750000
*        5 MCVMGCNT FIXED(31),      /* SRM MIGRATE TIME COUNTER  @H5A*/ 45800000
*        5 MCVSECWS FIXED(31),      /* NUMBER OF SECONDARY WORKING SET  45850000
*                                      PAGES FOR WHICH SWAP-INS HAVE    45900000
*                                      BEEN STARTED              @H6C*/ 45950000
*        5 MCVFRSWO FIXED(31),      /* AVAIL FRAMES SCHEDULED FOR       46000000
*                                      SWPAOUT TO AUX            @H5A*/ 46050000
*        5 MCVSWPES FIXED(31),      /* AVAIL EFRAMES SCHEDULED FOR      46100000
*                                      SWAPOUT TO EXTENDED       @H5A*/ 46150000
*        5 MCVDEFSE FIXED(31),      /* DEFER SWAP TO EXT IF AVAIL FRAME 46200000
*                                      COUNT EXCEEDS THIS VALUE  @H5A*/ 46250000
*        5 MCCDEFAM FIXED(31),      /* MULTIPLIER OF AFCOK THRESHOLD    46300000
*                                      TO DETERMINE TARGET NUMBER OF    46350000
*                                      FRAMES TO KEEP AVAILABLE  @L6C*/ 46400000
*        5 MCCMGTEX FIXED(31),      /* MIGRATOR TIME EXCEEDED           46450000
*                                      THRESHOLD                 @H5A*/ 46500000
*        5 MCCSWPET FIXED(31),      /* EFRAMES RESERVED FOR PAGEOUTS    46550000
*                                      BY SWAPS                  @H5A*/ 46600000
*        5 MCCETGHT FIXED(15),      /* EXTENDED STORE LOW THRESHOLD     46650000
*                                      MULTIPLIER TO DETERMINE IF       46700000
*                                      EXTENDED STORE IS TIGHT   @H5A*/ 46750000
*        5 MCCAECLO FIXED(15),      /* AVAIL EXTENDED FRAME QUEUE LOW   46800000
*                                      THRESHOLD                 @P5C*/ 46850000
*        5 MCCAECOK FIXED(15),      /* AVAIL EXTENDED FRAME QUEUE OK    46900000
*                                      THRESHOLD                 @P5C*/ 46950000
*        5 MCCESBMP FIXED(15),      /* SWAP TO EXTENDED WORKING SET     47000000
*                                      ADJUSTMENT                @H5A*/ 47050000
*        5 MCCPPSBF FIXED(15),      /* PAGABLE PAGE/SEGMENT BUFF @H5A*/ 47100000
*        5 MCCMINTR FIXED(8),       /* MINIMUM AMOUNT OF FRAMES TO      47150000
*                                      TRY FOR PER TRIM ATTEMPT  @P5C*/ 47200000
*        5 MCCSIGTR FIXED(8),       /* MIN AMOUNT OF FRAMES AN A.S.     47250000
*                                      CAN HOLD AND BE SIGNIFICANT      47300000
*                                      ENOUGH TO ATTEMPT A TRIM  @P5A*/ 47350000
*        5 MCCSWUPT FIXED(15),      /* SWAP CTR UPDATE THRESHOLD @H4A*/ 47400000
*        5 MCVHICT FIXED(8),        /* Count of length of high increase 47450000
*                                      interval (for fixed below 16 meg 47500000
*                                      pages) in IRARMRM2        @01C*/ 47550000
*        5 MCCFSIDI FIXED(8),       /* % OF WORKING SET SIZE TWSS IS    47600000
*                                      INCREASED FOR FWA USERS   @L7A*/ 47650000
*        5 MCCES0LO FIXED(8),       /* LOW THRESHOLD FOR % OF TIME      47700000
*                                      RUNNING OUT OF EXTENDED   @H4A*/ 47750000
*        5 MCCES0HI FIXED(8),       /* HIGH THRESHOLD FOR % OF TIME     47800000
*                                      RUNNING OUT OF EXTENDED   @H4A*/ 47850000
*        5 MCVES0CT FIXED(15),      /* MCTESTO0 SAMPLE COUNTER   @H4A*/ 47900000
*        5 MCVESSCT FIXED(15),      /* EXTENDED STORE THRESHOLDS        47950000
*                                      SAMPLE COUNTER            @H4A*/ 48000000
*        5 MCCESSTH FIXED(15),      /* EXTENDED STORE THRESHOLDS        48050000
*                                      SAMPLE THRESHOLD          @H4A*/ 48100000
*        5 MCVAECMN FIXED(31),      /* MINIMUM RCEAEC SAMPLED    @H4A*/ 48150000
*        5 MCTEFLGS BIT(8),         /* EXTENDED STORE BITS       @H5A*/ 48200000
*          7 MCTMIGCN BIT(1),       /* MIGCNSTR SYSEVENT ISSUED  @H5A*/ 48250000
*          7 MCTOVRMX BIT(1),       /* AT LEAST ONE STOR ISOL ADDR SP   48300000
*                                      OVER MAX WSS EXISTS       @H5A*/ 48350000
*          7 MCTOVRSI BIT(1),       /* OVERRIDE STOR ISOL IN            48400000
*                                      MIGRATION                 @H5A*/ 48450000
*          7 MCTESNA BIT(1),        /* EXTENDED STORE NOT AVAILABLE     48500000
*                                                                @H5A*/ 48550000
*          7 MCTESTO0 BIT(1),       /* THE AMOUNT OF AVAILABLE EXTENDED 48600000
*                                      STORAGE WENT TO 0         @H6A*/ 48650000
*          7 MCTERCFP BIT(1),       /* EXTENDED STORE RECONFIGURATION   48700000
*                                      IN PROGRESS               @P1A*/ 48750000
*          7 MCTEUICS BIT(1),       /* PR1 HAS BEEN SCHEDULED TO BUILD  48800000
*                                      THE EXPANDED UIC BUCKETS  @L8A*/ 48850000
*          7 MCTMIGTU BIT(1),       /* MIGCNSTR tried to unprotect      48900000
*                                      storage but the migrator still   48950000
*                                      could not meet its goal   @L8A*/ 49000000
*        5 MCTEFLG1 BIT(8),         /* FLAGS MODIFIED UNDER SRM         49050000
*                                      LOCK                      @P2A*/ 49100000
*          7 MCTAFCST BIT(1),       /* Reserved                  @L6C*/ 49150000
*          7 MCTFSTOV BIT(1),       /* FORCE STEAL OVERRIDE  @YA06825*/ 49200000
*          7 MCTPEND BIT(1),        /* REQSWAP or TRANSWAP pending or   49250000
*                                       fixed storage shortage   @L5A*/ 49300000
*          7 MCTRV42D BIT(5),       /* RESERVED                  @L5A*/ 49350000
*        5 MCCMXRIS FIXED(15),      /* Maximum amount by which real     49400000
*                                       storage thresholds should be    49450000
*                                       raised on behalf of the DREF    49500000
*                                       pages of an address space that  49550000
*                                       is being considered for         49600000
*                                       swap-in.                 @LDA*/ 49650000
*        5 MCCMS700 PTR(31),        /* VECTOR WAIT MESSAGE ADDR  @D1A*/ 49700000
*        5 MCVEXPDL FIXED(31),      /* The amount of increase to the    49750000
*                                    Expanded Storage available frame   49800000
*                                    queue thresholds due to the        49850000
*                                    AVAILPUP SYSEVENT           @LRC*/ 49900000
*        5 MCVRELDL FIXED(31),      /* The amount of increase to the    49950000
*                                    Real Storage available frame       50000000
*                                    queue thresholds due to the        50050000
*                                    AVAILPUP SYSEVENT           @LRC*/ 50100000
*        5 MCVMSGPT FIXED(31),      /* Pointer to message stack  @LTC*/ 50150000
*        5 MCVDOMQP FIXED(31),      /* Pointer to the DOM queue  @LTC*/ 50200000
*        5 MCCUICMX FIXED(31),      /* UIC value to determine if        50250000
*                                      stealing should be attempted     50300000
*                                      instead of trimming       @L6C*/ 50350000
*        5 MCVFPT   FIXED(31),      /* Fixed and DREF shortage          50400000
*                                    threshold count             @LTA*/ 50450000
*        5 MCCDRFCR FIXED(31),      /* Fixed and DREF critical shortage 50500000
*                                    threshold count             @LTA*/ 50550000
*        5 MCCDRFOK FIXED(31),      /* Fixed and DREF OK threshold      50600000
*                                                                @LTA*/ 50650000
*        5 MCVTWSS  FIXED(31),      /* TARGET WSS FOR COMMON     @D9C*/ 50700000
*        5 MCVSIWL  FIXED(31),      /* CMN LOW WSS SPECIFICATION @D9C*/ 50750000
*        5 MCVSIWH  FIXED(31),      /* CMN HI WSS SPECIFICATION  @D9C*/ 50800000
*        5 MCVFMCT  FIXED(31),      /* CMN EFFECTIVE FRAME COUNT @D9C*/ 50850000
*        5 MCCR23   FIXED(31),      /*                           @L6C*/ 50900000
*        5 MCCMS204 PTR(31),        /* Aux shortage user message        50950000
*                                      address               @YA08835*/ 51000000
*        5 MCCMAXSW FIXED(31),      /* Target maximum number of frames  51050000
*                                      to be swapped for an address     51100000
*                                      space                     @L5C*/ 51150000
*        5 MCVAVQLT FIXED(31),      /* TIME (RRPATOD) OF LAST LEVEL 1   51200000
*                                      AVQLOW SYSEVENT       @YA06825*/ 51250000
*        5 MCCTOSEC FIXED(31),      /* TWO SECOND VALUE TO FORCE        51300000
*                                      STEAL OVERRIDE        @YA06825*/ 51350000
*        5 MCCSTGT  FIXED(15),      /* STGTEST TIME INTERVAL (1 SEC)    51400000
*                                                                @L1A*/ 51450000
*        5 MCCFXBCO FIXED(15),      /* CUT-OFF AMOUNT OF FIXED BELOW    51500000
*                                     FRAMES WHICH ARE STEALABLE @L1A*/ 51550000
*        5 MCVBYTCT FIXED(31),      /* PREVIOUS BYTE COUNT OF RESERVE   51600000
*                                      STORAGE                   @L1A*/ 51650000
*        5 MCVBLKCT FIXED(31),      /* PREVIOUS BLOCK COUNT OF RESERVE  51700000
*                                      STORAGE                   @L1A*/ 51750000
*        5 MCVSWPAS POINTER(31),    /* Address of user picked for MS2   51800000
*                                      in QSCECMP                @L5C*/ 51850000
*        5 MCVOLDCL FIXED(31),      /* The "base" low central storage   51900000
*                                      threshold component       @L6C*/ 51950000
*        5 MCVOLDCO FIXED(31),      /* The "base" OK central storage    52000000
*                                      threshold component       @L6C*/ 52050000
*        5 MCVPTLMT FIXED(31),      /* Processor threshold raising      52100000
*                                      limit                     @L6C*/ 52150000
*        5 MCVLSD   FIXED(31),      /* Number of logical swap           52200000
*                                      discretionary frames in the      52250000
*                                      system                    @L6C*/ 52300000
*        5 MCVMINDF FIXED(32),      /* This is the minimum error        52350000
*                                      between ASM system pageouts in   52400000
*                                      progress received count and ASM  52450000
*                                      pageouts in progress completed   52500000
*                                      count                     @L9C*/ 52550000
*        5 MCVPGINS FIXED(31),      /* Page-in rate count used for      52600000
*                                      calculating the system paging    52650000
*                                      rate                      @L6C*/ 52700000
*        5 MCVAVAIL FIXED(31),      /* The number of Central and        52750000
*                                      Expanded available frames for    52800000
*                                      input to IRARMTSI         @L6C*/ 52850000
*        5 MCVUIC1  FIXED(31),      /* total number of UIC bucket 1     52900000
*                                      frames in the system      @L6A*/ 52950000
*        5 MCVUIC2  FIXED(31),      /* total number of UIC bucket 2     53000000
*                                      frames in the system      @L6A*/ 53050000
*        5 MCVUIC3  FIXED(31),      /* total number of UIC bucket 3     53100000
*                                      frames in the system      @L6A*/ 53150000
*        5 MCVUIC4  FIXED(31),      /* total number of UIC bucket 4     53200000
*                                      frames in the system      @L6A*/ 53250000
*        5 MCVUIC1S FIXED(31),      /* total number of UIC bucket 1     53300000
*                                      frames in the system adjusted    53350000
*                                      by storage isolation      @L6A*/ 53400000
*        5 MCVUIC2S FIXED(31),      /* total number of UIC bucket 2     53450000
*                                      frames in the system adjusted    53500000
*                                      by storage isolation      @L6A*/ 53550000
*        5 MCVUIC3S FIXED(31),      /* total number of UIC bucket 3     53600000
*                                      frames in the system adjusted    53650000
*                                      by storage isolation      @L6A*/ 53700000
*        5 MCVUIC4S FIXED(31),      /* total number of UIC bucket 4     53750000
*                                      frames in the system adjusted    53800000
*                                      by storage isolation      @L6A*/ 53850000
*        5 MCVUIC1C FIXED(31),      /* number of UIC bucket 1 frames    53900000
*                                      in the common area adjusted      53950000
*                                      by storage isolation      @L6A*/ 54000000
*        5 MCVUIC2C FIXED(31),      /* number of UIC bucket 2 frames    54050000
*                                      in the common area adjusted      54100000
*                                      by storage isolation      @L6A*/ 54150000
*        5 MCVUIC3C FIXED(31),      /* number of UIC bucket 3 frames    54200000
*                                      in the common area adjusted      54250000
*                                      by storage isolation      @L6A*/ 54300000
*        5 MCVUIC4C FIXED(31),      /* number of UIC bucket 4 frames    54350000
*                                      in the common area adjusted      54400000
*                                      by storage isolation      @L6A*/ 54450000
*        5 MCVMFXA  FIXED(15),      /* Average percentage of total      54500000
*                                      frames fixed below on the        54550000
*                                      previous invocation of           54600000
*                                      IRARMRM2                  @01C*/ 54650000
*        5 MCCCBBT  FIXED(15),      /* Central/Fixed Below 16 meg       54700000
*                                      Balance Threshold         @01C*/ 54750000
*      5 MCVEUIC1 FIXED(31),  /* expanded storage uic bucket 1   @L8C*/ 54800000
*      5 MCVEUIC2 FIXED(31),  /* expanded storage uic bucket 2   @L8C*/ 54850000
*      5 MCVEUIC3 FIXED(31),  /* expanded storage uic bucket 3   @L8C*/ 54900000
*      5 MCVEUIC4 FIXED(31),  /* expanded storage uic bucket 4   @L8C*/ 54950000
*      5 MCVEXWSD FIXED(31),        /* Count of discretionary expanded  55000000
*                                      storage frames            @L8A*/ 55050000
*      5 MCVEUICC FIXED(31),        /* Count of invocations of pr1      55100000
*                                      used  to determine when to       55150000
*                                       build expanded uic              55200000
*                                       buckets                  @L8A*/ 55250000
*      5 MCVMXEUC FIXED(31),        /* Number of pr1 invocation         55300000
*                                      before expanded uic buckets      55350000
*                                      are built                 @L8A*/ 55400000
*      5 MCVCMPIB FIXED(32),        /* Base value for common pages      55450000
*                                      paged in from aux (base for      55500000
*                                      RCECOMPI)                 @L8A*/ 55550000
*      5 MCVCUBD1 FIXED(16),        /* UIC bucket delimiter calculated  55600000
*                                      at the last SET OPT/during NIP   55650000
*                                      for central storage UIC buckets. 55700000
*                                      In SRM mode the value is used    55750000
*                                      for RCEFRV1.              @L8A*/ 55800000
*      5 MCVCUBD2 FIXED(16),        /* UIC bucket delimiter calculated  55850000
*                                      at the last SET OPT/during NIP.  55900000
*                                      for central storage UIC buckets. 55950000
*                                      In SRM mode the value is used    56000000
*                                      for RCEFRV2.              @L8A*/ 56050000
*      5 MCVCUBD3 FIXED(16),        /* UIC bucket delimiter calculated  56100000
*                                      at the last SET OPT/during NIP.  56150000
*                                      for central storage UIC buckets. 56200000
*                                      In SRM mode the value is used    56250000
*                                      for RCEFRV3.              @L8A*/ 56300000
*      5 MCVCS0CT FIXED(15),        /* Number of times available        56350000
*                                      frame queue went to 0     @LAC*/ 56400000
*      5 MCVCSSCT FIXED(15),        /* Central storage threshhold       56450000
*                                      sample counter            @LAC*/ 56500000
*      5 MCVSHUIC FIXED(15),        /* High UIC value for shared        56550000
*                                      frames                    @LAC*/ 56600000
*      5 MCVAFCMN FIXED(31),        /* MINIMUM RCEAFC SAMPLED    @L8A*/ 56650000
*      5 MCVSTWSS FIXED(31),        /* Protective processor storage     56700000
*                                      target for shared area    @LAA*/ 56750000
*      5 MCVSAUXB FIXED(31),        /* Base for RceSgAux, count         56800000
*                                      of shared area aux slots  @LAA*/ 56850000
*      5 MCVSUIC1 FIXED(31),        /* Shared area central UIC          56900000
*                                      bucket 1                  @LAA*/ 56950000
*      5 MCVSUIC2 FIXED(31),        /* Shared area central UIC          57000000
*                                      bucket 2                  @LAA*/ 57050000
*      5 MCVSUIC3 FIXED(31),        /* Shared area central UIC          57100000
*                                      bucket 3                  @LAA*/ 57150000
*      5 MCVSUIC4 FIXED(31),        /* Shared area central UIC          57200000
*                                      bucket 4                  @LAA*/ 57250000
*      5 MCVSEUC1 FIXED(31),        /* Shared area expanded UIC         57300000
*                                      bucket 1                  @LAA*/ 57350000
*      5 MCVSEUC2 FIXED(31),        /* Shared area expanded UIC         57400000
*                                      bucket 2                  @LAA*/ 57450000
*      5 MCVSEUC3 FIXED(31),        /* Shared area expanded UIC         57500000
*                                      bucket 3                  @LAA*/ 57550000
*      5 MCVSEUC4 FIXED(31),        /* Shared area expanded UIC         57600000
*                                      bucket 4                  @LAA*/ 57650000
*      5 MCVSGAUX FIXED(31),        /* Shared pages on aux count, base  57700000
*                                      for aux shortage processing      57750000
*                                                                @LAA*/ 57800000
*      5 MCVSAUXT FIXED(32),        /* Time of last ASM invocation      57850000
*                                      that calculated shared frame     57900000
*                                      usage                     @LAA*/ 57950000
*/*                                                                  */ 57953000
*/*      ESAME EXTENSIONS                                   @64BITSRM*/ 57956000
*/*                                                                  */ 57959000
*      5 MCCUICUP FIXED(15),        /* Interval (in seconds) at which   57962000
*                                      UIC update processing is taking  57965000
*                                      place.                           57968000
*                                      In ESA mode the value will be 1, 57971000
*                                      in ESAME mode the value is 10.   57974000
*                                      Note that in ESAME mode not      57977000
*                                      necessarily all address space    57980000
*                                      UICs are updated in one run. SRM 57983000
*                                      may release the SRM lock         57986000
*                                      inbetween and continue UIC update57989000
*                                      processing later     @64BITSRM*/ 57992000
*      5 MCCCONBT FIXED(15),        /* UIC value, below which frames    57995000
*                                      maybe stolen from CASTOUT(NO)    57998000
*                                      hiperspaces                      58001000
*                                      (ESAME mode only)    @64BITSRM*/ 58004000
*      5 MCCEMDIT FIXED(31),        /* Maximum disabled time for STEAL  58007000
*                                      and UIC Update processing        58010000
*                                      before opening an enabled window 58013000
*                                      in ESAME mode (srm_time units:   58016000
*                                      01x=1.024 milliseconds).         58019000
*                                      The value is set in IEAVNP10     58022000
*                                      dependant on the mode, but the   58025000
*                                      value will be used in            58028000
*                                      ESAME mode only    @64BITSRM*/   58031000
*      5 MCCMAXBT FIXED(31),        /* Between 16M and 2G pageable      58034000
*                                      storage shortage threshold       58037000
*                                      count                            58040000
*                                      (ESAME mode only)    @64BITSRM*/ 58043000
*      5 MCCB2GCR FIXED(31),        /* Between 16M and 2G pageable      58046000
*                                      storage critical shortage        58049000
*                                      threshold count                  58052000
*                                      (ESAME mode only)    @64BITSRM*/ 58055000
*      5 MCCB2GOK FIXED(31),        /* Between 16M and 2G pageable      58058000
*                                      storage OK threshold count       58061000
*                                      (ESAME mode only)    @64BITSRM*/ 58064000
*      5 MCCQDRSV FIXED(15),        /* Percentage of quad frame groups  58067000
*                                      to be kept free.                 58070000
*                                      SRM invokes RSM quad frame       58073000
*                                      steal processing if less than    58076000
*                                      5% (MCCQDRSV) of the number      58079000
*                                      of allocated quad frame groups   58082000
*                                      is available.                    58085000
*                                      (ESAME mode only)    @64BITSRM*/ 58088000
*      5 MCCR02 FIXED(15),          /* reserved             @64BITSRM*/ 58091000
*      5 MCCR01(2) FIXED(32),       /* reserved             @64BITSRM*/ 58094000
*      5 MCTEND CHAR(0)             /* END OF MCT                    */ 58097000
*          BDY(DWORD)                                          /*@L8C*/ 58100000
*                                                              /*@L8A*/ 58150000
* %IF MCT9999  =',' %THEN %GOTO MCT999C ; /* Continue structure  @L8A*/ 58200000
*                ;                  /* End of this block         @L8A*/ 58250000
*     %GOTO MCT999E  ;                                         /*@L8A*/ 58300000
* %MCT999C :;                                                 /* @L8A*/ 58350000
*                ,                  /* Continue structure        @L8A*/ 58400000
* %MCT999E :;                       /* Endif                     @L8A*/ 58450000
*                                                              /*@L8A*/ 58500000
*%MCTLEN='LENGTH(MCT)';            /* OBTAIN LENGTH OF MCT           */ 58550000
*@EJECT;                                                                58600000
