*        %GOTO RQSVPLS1; /*                                             00050000
         MACRO                                                          00100000
         IRARQSRV &DSECT=YES                                         */ 00150000
*%RQSVPLS1:  ;                                                          00200000
*                                                                       00250000
*/* START OF SPECIFICATIONS ******************************************  00300000
*                                                                       00350000
*01* EXTERNAL CLASSIFICATION: None                                      00400000
*01* END OF EXTERNAL CLASSIFICATION:                                    00450000
*                                                                       00500000
* *** PROPRIETARY_STATEMENT ******************************************* 00550000
*01* PROPRIETARY STATEMENT=                                             00600000
*                  LICENSED MATERIALS - PROPERTY OF IBM                 00650000
*                  "RESTRICTED MATERIALS OF IBM"                        00700000
*                  5647-A01 (C) COPYRIGHT IBM CORP. 1982, 2000          00750000
*                                                                       00800000
*     STATUS = HBB7703                                                  00850000
*                                                                       00900000
* *** END_OF_PROPRIETARY_STATEMENT ************************************ 00950000
*                                                                       01000000
*    DESCRIPTIVE NAME:  THE PARAMETER LIST FOR THE REQUEST SERVICE      01050000
*                       DATA SYSEVENT                                   01100000
*                                                                       01150000
*    MACRO NAME: IRARQSRV                                               01200000
*                                                                       01250000
*02*   Acronym:  None                                                   01300000
*                                                                       01350000
*01* DSECT Name: RQSV                                                   01400000
*                                                                       01450000
*01* Component:   SYSTEMS RESOURCE MANAGER (SC1CX)                      01500000
*                                                                       01550000
*01* Eye-Catcher:   None                                                01600000
*                                                                       01650000
*01* DISTRIBUTION LIBRARY - AMODGEN                                     01700000
*                                                                       01750000
*01* NOTES:                                                             01800000
*          RESTRICTIONS - The area mapped by this structure must        01850000
*                         reside in fixed/DREF storage.                 01900000
*01* Storage Attributes:                                                01950000
*02*   Subpool:    n/a                                                  02000000
*02*   Key:        sysevent caller's key                                02050000
*02*   Residency:  n/a                                                  02100000
*02*   Main Storage:  n/a                                               02150000
*02*   Auxiliary Storage: n/a                                           02200000
*02*   Virtual Storage: n/a                                             02250000
*                                                                       02300000
*01* Size:   200 bytes                                                  02350000
*                                                                       02400000
*01* Created by:   issuer of the REQSVDAT sysevent                      02450000
*                                                                       02500000
*01* Pointed to by:   Register 1 on sysevent invocation                 02550000
*                                                                       02600000
*01* Serialization:   responsibility of the caller                      02650000
*                                                                       02700000
*01* Function:                                                          02750000
*             Maps the service-related data provided to SMF by SRM      02800000
*             at end of step, end of job, and for interval accounting.  02850000
*                                                                       02900000
*01* Method of Access:                                                  02950000
*02*   PL/AS:                                                           03000000
*             IRARQSRV must be included to use this mapping.            03050000
*                                                                       03100000
*                                                                       03150000
*                                                                       03200000
*   CHANGE ACTIVITY = @G81LPJC                                          03250000
*                     @ZA73419                                          03300000
*                                                                       03350000
*  $L0=WSMGT HBB4420 900716 PD88AK: Mike Bull WORKING SET MANAGEMENT    03400000
*                                        SUPPORT                        03450000
*                                                                       03500000
*  $L1=CAPT2 HBB5520 940415 PD88AK: Mike Bull Captured storage          03550000
*                                                                       03600000
*  $DQC0023  HBB6603 960615 PDBB  : John Arwe                           03650000
*                                   Dependent enclaves                  03700000
*                                   Add estor residency page seconds    03750000
*                                                                       03800000
*  $WLMPBAT  JBB6604 970118 B9HABB: John Arwe                           03850000
*                                   Return batch info                   03900000
*                                                                       03950000
*  $WLMPBAT  JBB6604 970211 B9HAKN: Kin Ng                              04000000
*                                   Add rqsvjobreincarnated             04050000
*                                                                       04100000
*  $PWA0185  JBB6607 980601 PD88KN: PLANFORM 1130 UPDATES               04150000
*                                                                       04200000
*  $WLMPMES  JBB6609 980901 B9HACG: Stephen McGrath                     04250000
*                                   MultiSystem Enclaves      @WLMPMES  04300000
*                                   (Update will only be made to the    04350000
*                                    PL/X)                              04400000
*                                                                       04402300
*  $WLMPGMC  HBB7703 991201 B9HABB: John Arwe                           04404600
*                                   Goal Mode Inhibitors (PLX only)     04406900
*                                   CPU Mgmt                            04409200
*                                                                       04411500
*  $WLMPGMS  HBB7703 991201 B9HABB: John Arwe                           04413800
*                                   Goal Mode Inhibitors (PLX only)     04416100
*                                   Stg Mgmt                            04418400
*                                                                       04420700
*  $WLMPGMT  HBB7703 991201 B9HABB: John Arwe                           04423000
*                                   Goal Mode Inhibitors (PLX only)     04425300
*                                   CICS/IMS Region Mgmt                04427600
*                                                                       04429900
*  $WLMPGMY  HBB7703 991201 B9HABB: John Arwe                           04432200
*                                   Goal Mode Inhibitors (PLX only)     04434500
*                                   Classification                      04436800
*                                                                       04439100
*  WARNING: If this parameter list length changes, recompile            04441400
*           IRARMCNS                                                    04443700
*           (as of OS/390 R10, SMF uses run-time length from MCCRQSVL)  04446000
*                                                                       04450000
**********************************************************************/ 04500000
*        %GOTO RQSVPLS2; /*                                             04550000
         AGO   .RQSVAL1                                              */ 04600000
* /* *************************************************************** */ 04650000
* /*   METHOD OF ACCESS - THE ADDRESS OF THE RQSV IS CONTAINED IN    */ 04700000
* /*         THE -RMCTRQSV- FIELD OF THE SYSTEM RESOURCES MANAGER    */ 04750000
* /*         CONTROL TABLE.                                          */ 04800000
* /*                                                                 */ 04850000
* /* *************************************************************** */ 04900000
* /*                                                                 */ 04950000
* /*   INVOCATION PARAMETERS AND/OR KEYWORDS =                       */ 05000000
* /*                                                                 */ 05050000
* /*     BAL - DSECT=NO IF DSECT IS NOT TO BE PRODUCED.              */ 05100000
* /*                                                                 */ 05150000
* /*         USING ON RQSV GIVES ADDRESSABILITY TO ALL SYMBOLS.      */ 05200000
* /*                                                                 */ 05250000
* /*     PLS - %RQSVLEVL='USERLEVL' IF THE RQSV MAPPING IS TO BE     */ 05300000
* /*           CONCATENATED WITH A PREVIOUS DECLARATION, WITH THE    */ 05350000
* /*           RQSV BEING ASSIGNED THE INDICATED STRUCTURE LEVEL.    */ 05400000
* /*         - %RQSV9999=',' IF THE STRUCTURE SHOULD NOT BE CLOSED.  */ 05450000
* /*                                                                 */ 05500000
* /*         TO ACCESS AS A STANDALONE STRUCTURE DCL RQSVPTR PTR.    */ 05550000
* /*                                                                 */ 05600000
* /* END OF SPECIFICATIONS *******************************************/ 05650000
* /*                                                                    05700000
.RQSVAL1 ANOP                                                           05750000
         SPACE 1                                                        05800000
         AIF   ('&DSECT' EQ 'NO').RQSVAL2                               05850000
RQSV     DSECT                                                          05900000
         AGO   .RQSVAL3                                                 05950000
.RQSVAL2 ANOP                                                           06000000
         DS    0D                                                       06050000
RQSV     EQU   *                                                        06100000
.RQSVAL3 ANOP                                                           06150000
         SPACE 1                                                        06200000
RQSVDATA DS    0F                 STORAGE FOR EVENT 49         @ZM43092 06250000
         ORG   RQSVDATA                                        @ZM43092 06300000
RQSVSRV  DS    F -                 TRANSACTION SERVICE (INCLUDES        06350000
*                                  ENCLAVE SERVICE)                @L2C 06400000
RQSVTIM  DS    F -                 TRANSACTION ACTIVE TIME              06450000
RQSVPGSC DS    0F                  PGN AND RESERVED FIELD      @ZA73419 06500000
RQSVPGN  DS    H -                 PERFORMANCE GROUP NO. (ZERO WHEN IN  06550000
*                                  GOAL MODE)                      @L1A 06600000
RQSVRES  DS    H -                 RESERVED FIELD              @ZA73419 06650000
RQSVSRT  DS    F -                 SESSION RESIDENCY TIME               06700000
RQSVCPU  DS    F -                 SESSION CPU SERVICE (INCLUDES        06750000
*                                  ENCLAVE SERVICE)                @L2C 06800000
RQSVIOC  DS    F -                 SESSION I/O SERVICE         @G50IPJH 06850000
RQSVMSO  DS    F -                 SESSION STORAGE SERVICE     @G50IPJH 06900000
RQSVSRB  DS    F -                 SESSION SRB SERVICE         @G50IPJH 06950000
RQSVTRC  DS    F -                 TRANSACTION COUNT           @ZA73419 07000000
RQSVGOAL DS    0CL32 -             THE FIELDS IN THIS STRUCTURE ARE     07050000
*                                  APPLICABLE TO GOAL MODE ONLY (BLANKS 07100000
*                                  IF THE SYSTEM IS OPERATING IN        07150000
*                                  COMPATIBILITY MODE)             @L1A 07200000
RQSVWKLD DS    CL8 -               WORKLOAD NAME                   @L1A 07250000
RQSVSCL  DS    CL8 -               SERVICE CLASS NAME              @L1A 07300000
RQSVRGRP DS    CL8 -               RESOURCE GROUP NAME (BLANKS IF THIS  07350000
*                                  ADDRESS SPACE DOES NOT BELONG TO A   07400000
*                                  RESOURCE GROUP)                 @L1A 07450000
RQSVRCL  DS    CL8 -               REPORT CLASS NAME (BLANKS IF THIS    07500000
*                                  ADDRESS SPACE DOES NOT BELONG TO A   07550000
*                                  REPORT CLASS)                   @L1A 07600000
RQSVENCL DS    0CL20 -             THE FIELDS IN THIS STRUCTURE         07650000
*                                  REPRESENT SERVICE ACTIVITY OCCURRING 07700000
*                                  IN ENCLAVES OWNED BY THIS ADDRESS    07750000
*                                  SPACE (ENCLAVE FIELDS INCLUDE DATA   07800000
*                                  FOR BOTH COMPLETED ENCLAVE WORK AND  07850000
*                                  INFLIGHT ENCLAVE WORK)          @L2A 07900000
RQSVETIM DS    F -                 ENCLAVE ACTIVE TIME             @L2A 07950000
RQSVECPU DS    F -                 TOTAL ENCLAVE (CPU) SERVICE     @L2A 08000000
RQSVETRC DS    F -                 ENCLAVE TRANSACTION COUNT       @L2A 08050000
RQSVECPT DS    D -                 ENCLAVE TOTAL CPU TIME (IN STCK      08100000
*                                  FORMAT)                         @L2A 08150000
RQSVAIC  DS    F -                 I/O Connect Time for                 08200000
*                                  address space + dependent enclaves   08250000
*                                  in 128-microsecond units             08300000
*                                                              @DQC0023 08350000
RQSVAID  DS    F -                 I/O Disconnect Time for              08400000
*                                  address space + dependent enclaves   08450000
*                                  in 128-microsecond units             08500000
*                                                              @DQC0023 08550000
RQSVAIW  DS    F -                 I/O pending + C.U. queue Time for    08600000
*                                  address space + dependent enclaves   08650000
*                                  in 128-microsecond units             08700000
*                                                              @DQC0023 08750000
RQSVAIS  DS    F -                 I/O start subchannel count for       08800000
*                                  address space + dependent enclaves   08850000
*                                                              @DQC0023 08900000
RQSVEIC  DS    F -                 I/O Connect Time for                 08950000
*                                  independent enclaves                 09000000
*                                  owned by the address space           09050000
*                                  in 128-microsecond units             09100000
*                                                              @DQC0023 09150000
RQSVEID  DS    F -                 I/O Disconnect Time for              09200000
*                                  independent enclaves                 09250000
*                                  owned by the address space           09300000
*                                  in 128-microsecond units             09350000
*                                                              @DQC0023 09400000
RQSVEIW  DS    F -                 I/O pending + C.U. queue Time for    09450000
*                                  independent enclaves                 09500000
*                                  owned by the address space           09550000
*                                  in 128-microsecond units             09600000
*                                                              @DQC0023 09650000
RQSVEIS  DS    F -                 I/O start subchannel count for       09700000
*                                  independent enclaves                 09750000
*                                  owned by the address space           09800000
*                                                              @DQC0023 09850000
* ----- doubleword boundary -------                            @DQC0023 09900000
RQSVDET  DS    D                   Dependent enclave CPU time           09950000
*                                                              @DQC0023 10000000
RQSVSUS  DS    F                   Copy of RmctAdjC                     10050000
*                                                              @DQC0023 10100000
         DS    F                   see plx conversion time     @WLMPBAT 10150000
* ----- doubleword boundary -------                            @DQC0023 10200000
         DS    F                   see plx sysaff/resaff time  @WLMPBAT 10250000
         DS    F                   see plx other hold time     @WLMPBAT 10300000
* ----- doubleword boundary -------                            @WLMPBAT 10350000
         DS    F                   see plx queue time          @WLMPBAT 10400000
         DS    F                   rqsvflags                   @WLMPBAT 10450000
* ----- doubleword boundary -------                            @WLMPBAT 10500000
         DS    XL16                schedenv                    @WLMPBAT 10550000
* ----- doubleword boundary -------                            @WLMPBAT 10600000
         DS    F                   see plx RSD address         @WLMPMES 10650000
         DS    F                   see plx RSD Length          @WLMPMES 10700000
* ----- doubleword boundary -------                            @WLMPGMY 10720000
         DS   CL8                  see plx subsys coll name    @WLMPGMY 10740000
* ----- doubleword boundary -------                            @WLMPGMY 10760000
         DS   4F                   reserved for expansion      @WLMPGMY 10780000
* ----- doubleword boundary -------                            @DQC0023 10800000
RQSVEND  DS    0D                  END OF RQSV                          10850000
RQSVLEN  EQU   RQSVEND-RQSV -      LENGTH OF RQSV                       10900000
         MEND                                                           10950000
*                                                                    */ 11000000
*%RQSVPLS2:  ;                                                          11050000
*        %IF RQSV9999 ~= ','        /* DOES STRUCTURE CONTINUE       */ 11100000
*            %THEN %RQSV9999 = ';'; /* NO, END DECLARE STATEMENT     */ 11150000
*        %IF RQSVLEVL ~= ''         /* IS STRUCTURE CONCATENATED     */ 11200000
*            %THEN %GOTO RQSVPLS3;  /* YES, OMIT DECLARE STATEMENT   */ 11250000
*                                                                       11258300
*   DCL /* Function codes for PLX IRAEVENT macro */                     11266600
*       RqsvStepEndClearBases     Bit(8) Constant("00"x),               11274900
*       RqsvIntervalPreserveBases Bit(8) Constant("80"x); /* @WLMPGMC*/ 11283200
*                                                                       11291500
*   DCL                                                                 11300000
*     1 RQSV BASED(RQSVPTR) BDY(WORD),                                  11350000
*            %GOTO RQSVPLS4;        /* SKIP USER-GIVEN LEVEL         */ 11400000
*%RQSVPLS3:  RQSVDUM = RQSVLEVL||' RQSV';  /* PICK UP GIVEN LEVEL    */ 11450000
*     RQSVDUM BDY(WORD),                                                11500000
*%RQSVPLS4:  ;                                                          11550000
*     5  RQSVDATA CHAR(200) BDY(WORD), /* SMF DATA AREA      @DQC0023*/ 11600000
*      10 RQSVSRV FIXED(31),     /* TOTAL TRANSACTION SERVICE (INCLUDES 11650000
*                                   ENCLAVE SERVICE)             @L2C*/ 11700000
*      10 RQSVTIM FIXED(31),     /* TRANSACTION ACTIVE TIME          */ 11750000
*      10 RQSVPGSC CHAR(4) BDY(WORD), /* PGN AND RESERVED FIELD      */ 11800000
*          15 RQSVPGN FIXED(15),  /* PERFORMANCE GROUP NUMBER (ZERO     11850000
*                                    WHEN IN GOAL MODE)          @L1C*/ 11900000
*          15 RQSVRES FIXED(15),   /* RESERVED FIELD         @ZA73419*/ 11950000
*      10 RQSVSRT FIXED(31),      /* SESSION RESIDENCY TIME          */ 12000000
*      10 RQSVCPU FIXED(31),      /* SESSINON CPU SERVICE (INCLUDES     12050000
*                                    ENCLAVE SERVICE)            @L2C*/ 12100000
*      10 RQSVIOC FIXED(31),      /* SESSION I/O SERVICE     @G50IPJH*/ 12150000
*      10 RQSVMSO FIXED(31),      /* SESSION STORAGE SERVICE @G50IPJH*/ 12200000
*      10 RQSVSRB FIXED(31),      /* SESSION SRB SERVICE     @G50IPJH*/ 12250000
*      10 RQSVTRC FIXED(31),      /* TRANSACTION COUNT       @ZA73419*/ 12300000
*      10 RQSVGOAL CHAR(32),      /* THE FIELDS IN THIS STRUCTURE ARE   12350000
*                                    APPLICABLE TO GOAL MODE ONLY       12400000
*                                    (BLANKS IF THE SYSTEM IS OPERATING 12450000
*                                    IN COMPATIBILITY MODE)      @L1A*/ 12500000
*        12 RQSVWKLD CHAR(8),     /* WORKLOAD NAME               @L1A*/ 12550000
*        12 RQSVSCL  CHAR(8),     /* SERVICE CLASS NAME          @L1A*/ 12600000
*        12 RQSVRGRP CHAR(8),     /* RESOURCE GROUP NAME (BLANKS IF     12650000
*                                    THIS ADDRES SPACE DOES NOT BELONG  12700000
*                                    TO A RESOURCE GROUP)        @L1A*/ 12750000
*        12 RQSVRCL  CHAR(8),     /* REPORT CLASS NAME (BLANKS IF THIS  12800000
*                                    ADDRESS SPACE DOES NOT BELONG TO   12850000
*                                    A REPORT CLASS)             @L1A*/ 12900000
*      10 RQSVENCL,               /* THE FIELDS IN THIS STRUCTURE       12950000
*                                    REPRESENT SERVICE ACTIVITY         13000000
*                                    OCCURRING IN ENCLAVES OWNED BY     13050000
*                                    THIS ADDRESS SPACE (ENCLAVE        13100000
*                                    FIELDS INCLUDE DATA FOR BOTH       13150000
*                                    COMPLETED ENCLAVE WORK AND         13200000
*                                    INFLIGHT ENCLAVE WORK)      @L2A*/ 13250000
*        12 RQSVETIM FIXED(31),   /* ENCLAVE ACTIVE TIME         @L2A*/ 13300000
*        12 RQSVECPU FIXED(31),   /* TOTAL ENCLAVE (CPU) SERVICE @L2A*/ 13350000
*        12 RQSVETRC FIXED(31),   /* ENCLAVE TRANSACTION COUNT   @L2A*/ 13400000
*        12 RQSVECPT BIT(64),     /* ENCLAVE TOTAL CPU TIME (IN STCK    13450000
*                                    FORMAT)                     @L2A*/ 13500000
*                                                                       13550000
*    10 RQSVAIC FIXED(32),         /* I/O connect time                  13600000
*                                     for address space                 13650000
*                                     plus dependent enclaves           13700000
*                                     in 128-microsecond units          13750000
*                                                            @DQC0023*/ 13800000
*    10 RQSVAID FIXED(32),         /* I/O disconnect time               13850000
*                                     for address space                 13900000
*                                     plus dependent enclaves           13950000
*                                     in 128-microsecond units          14000000
*                                                            @DQC0023*/ 14050000
*    10 RQSVAIW FIXED(32),         /* I/O pending plus control unit     14100000
*                                     queue time for address space      14150000
*                                     plus dependent enclaves           14200000
*                                     in 128-microsecond units          14250000
*                                                            @DQC0023*/ 14300000
*    10 RQSVAIS FIXED(32),         /* I/O start subchannel count        14350000
*                                     for address space                 14400000
*                                     plus dependent enclaves           14450000
*                                                            @DQC0023*/ 14500000
*    10 RQSVEIC FIXED(32),         /* I/O connect time                  14550000
*                                     for independent enclaves          14600000
*                                     owned by the address space        14650000
*                                     in 128-microsecond units          14700000
*                                                            @DQC0023*/ 14750000
*    10 RQSVEID FIXED(32),         /* I/O disconnect time               14800000
*                                     for independent enclaves          14850000
*                                     owned by the address space        14900000
*                                     in 128-microsecond units          14950000
*                                                            @DQC0023*/ 15000000
*    10 RQSVEIW FIXED(32),         /* I/O pending plus control unit     15050000
*                                     queue time                        15100000
*                                     for independent enclaves          15150000
*                                     owned by the address space        15200000
*                                     in 128-microsecond units          15250000
*                                                            @DQC0023*/ 15300000
*    10 RQSVEIS FIXED(32),         /* I/O start subchannel count        15350000
*                                     for independent enclaves          15400000
*                                     owned by the address space        15450000
*                                                            @DQC0023*/ 15500000
*    10 RQSVDET Bit(64),           /* Dependent                         15550000
*                                     enclave CPU time for the step     15600000
*                                     (or job) STCK format              15650000
*                                                            @DQC0023*/ 15700000
*    10 RQSVSUS FIXED(32),         /* Copy of RmctAdjC                  15750000
*                                                            @DQC0023*/ 15800000
*                                                                       15850000
*    10 RqsvJclConversionTime Fixed(32) /* JCL conversion               16300000
*                                      time for batch jobs, 0 for       16350000
*                                      other types of work.             16400000
*                                      1.024 millisecond units          16450000
*                                                            @WLMPBAT*/ 16500000
*   ,10 RqsvSysOrResAffTime Fixed(32) /* Resource and/or                16550000
*                                      system affinity hold time        16600000
*                                      for batch jobs, 0 for            16650000
*                                      other types of work.             16700000
*                                      1.024 millisecond units          16750000
*                                                            @WLMPBAT*/ 16800000
*   ,10 RqsvIneligibleTime Fixed(32) /* Hold time not due to            16850000
*                                      system affinity, resource        16900000
*                                      affinity, TYPRUN=HOLD, or        16950000
*                                      TYPRUN=JCLHOLD                   17000000
*                                      for batch jobs, 0 for            17050000
*                                      other types of work.             17100000
*                                      1.024 millisecond units          17150000
*                                                            @WLMPBAT*/ 17200000
*   ,10 RqsvQueueTime Fixed(32)     /* Time that job was eligible for   17250000
*                                      execution: not held, waiting     17300000
*                                      for an initiator                 17350000
*                                      Valid for all work types.        17400000
*                                      1.024 millisecond units          17450000
*                                                            @WLMPBAT*/ 17500000
*   ,10 RqsvFlags Bit(32)           /*                       @WLMPBAT*/ 17550000
*     ,12 RqsvResetBeforeInitiation Bit(1) /* Reset before initiation   17600000
*                                                            @WLMPBAT*/ 17650000
*     ,12 RqsvResetAfterInitiation  Bit(1) /* Reset after  initiation   17700000
*                                                            @WLMPBAT*/ 17750000
*     ,12 RqsvOperatorForcedInitiation Bit(1) /* Operation requested    17800000
*                                      immediate initiation             17850000
*                                                            @WLMPBAT*/ 17900000
*     ,12 RqsvJobReincarnated Bit(1)       /* Job has been restarted    17950000
*                                                            @WLMPBAT*/ 18000000
*     ,12 RqsvJobHasRSD       Bit(1)       /* Job has Remote System     18050000
*                                             Data.          @WLMPMES*/ 18100000
*     ,12 RqsvRSDTooSmall     Bit(1)       /* The area provided to      18150000
*                                             contain the Remote        18200000
*                                             System Data is too        18250000
*                                             small.  Use the size      18300000
*                                             contained in the          18350000
*                                             RqsvRSDLength field to    18400000
*                                             allocate a new area.      18450000
*                                                            @WLMPMES*/ 18500000
*     ,12 RqsvRSDIncomplete   Bit(1)       /* The Remote System Data    18550000
*                                             is incomplete.            18600000
*                                                            @WLMPMES*/ 18650000
*     ,12 RqsvCProtCpu   Bit(1)    /* Same as                           18653800
*                                     RasdCProtCpu           @WLMPGMC*/ 18657600
*     ,12 RqsvCProtStg   Bit(1)    /* Same as                           18661400
*                                     RasdCProtStg           @WLMPGMC*/ 18665200
*     ,12 RqsvASProtStg  Bit(1)    /* Same as                           18669000
*                                     RasdASProtStg          @WLMPGMC*/ 18672800
*     ,12 RqsvTrxnMgmtExempt Bit(1)/* Same as                           18676600
*                                     RasdTrxnMgmtExempt     @WLMPGMC*/ 18680400
*     ,12 RqsvCpuProtected Bit(1)  /* Same as                           18684200
*                                     RasdCpuProtected       @WLMPGMC*/ 18688000
*     ,12 RqsvStgProtected Bit(1)  /* Same as                           18691800
*                                     RasdStgProtected       @WLMPGMC*/ 18695600
*   ,10 RqsvSchedEnv Char(16)      /* JCL SCHEDENV value     @WLMPBAT*/ 18700000
*   ,10 RqsvRSDADDR  Pointer(31)   /* Address of the Remote             18750000
*                                     System Data area.                 18800000
*                                     NOTE: If an address is present,   18850000
*                                     SRM assumes the caller requests   18900000
*                                     the Remote System Data. Specific  18950000
*                                     format for this data area is      19000000
*                                     required               @WLMPMES*/ 19050000
*   ,10 RqsvRSDLength  Fixed(31)   /* Length of the Remote System       19100000
*                                     Data area.                        19150000
*                                     NOTE: If the caller doesn't       19200000
*                                     pass enough storage to hold the   19250000
*                                     Remote System Data area, this     19300000
*                                     field will contain the correct    19350000
*                                     amount of storage that is         19400000
*                                     necessary.             @WLMPMES*/ 19450000
*   ,10 RqsvSubsystemCollectionName Char(8) /* IWMCLSFY SUBCOLN value   19458300
*                                                            @WLMPGMY*/ 19466600
*   ,10 *( 4)   FIXED(32)          /* reserved               @WLMPGMY*/ 19474900
*                                                                       19483200
*!   WARNING: SMF modules instantiate this parameter list in their      19491500
*!            dynamic areas, when expanding the size of the plist       19499800
*!            they must be recompiled.  Having enough reserved space    19508100
*!            to accomodate current-release growth decouples the SRM    19516400
*!            and SMF pieces so that they need not ship at the same     19524700
*!            time.  SRM can ship first without overlaying SMF's        19533000
*!            storage when storing into the larger plist.               19541300
*                                                                       19550000
*    , 10 RQSVEND CHAR(0)         /* END OF STORAGE AREA             */ 19600000
*   RQSV9999                                                            19650000
*   %RQSVLEN = 'LENGTH(RQSV)';      /* SYMBOLIC FOR LENGTH OF RQSV   */ 19700000
