*                                                                       00043000
* %DCL IRASMF99_INCLUDED CHAR EXT;                                      00086000
* %DEACTIVATE IRASMF99_INCLUDED;                                        00129000
* %IF IRASMF99_INCLUDED = '' %THEN                                      00172000
* %DO;                                                                  00215000
*%/* Start of PL/X PreProlog Code */;                                   00258000
*                                                                       00301000
*%/* End of PL/X PreProlog Code */;                                     00344000
*/* Macro made bi-lingual on 01275. CBGEN compile date 01186         */ 00427950
*% /*                                                                   00430000
         MACRO                                                          00473000
         IRASMF99 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF_HDR_MAP=YES,    *00516000
               &SMF99_SDEF_MAP=COND,&SMF99_PRODUCT_MAP=COND,           *00559000
               &SMF99_S1_SDEF_MAP=COND,&SMF99_S1_AAT_MAP=COND,         *00602000
               &SMF99_S1_SS_MAP=COND,&SMF99_S1_PP_MAP=COND,            *00645000
               &SMF99_S1_PT_MAP=COND,&SMF99_S1_RG_MAP=COND,            *00688000
               &SMF99_S1_GR_MAP=COND,&SMF99_S2_SDEF_MAP=COND,          *00718100
               &SMF99_S2_CLS_MAP=COND,&SMF99_S2_PER_MAP=COND,          *00748200
               &SMF99_S3_SDEF_MAP=COND,&SMF99_S3_CLS_MAP=COND,         *00778300
               &SMF99_S3_PER_SDEF_MAP=COND,&SMF99_S3_PPRP_MAP=COND,    *00808400
               &SMF99_S3_MPLP_MAP=COND,&SMF99_S3_RUAP_MAP=COND,        *00838500
               &SMF99_S3_SWPP_MAP=COND,&SMF99_S3_PASP_MAP=COND,        *00868600
               &SMF99_S3_QMPLP_MAP=COND,&SMF99_S3_QRUAP_MAP=COND,      *00898700
               &SMF99_S3_AINS_MAP=COND,&SMF99_S3_ASTR_MAP=COND,        *00909800
               &SMF99_S3_TSTR_MAP=COND,&SMF99_S3_QSTPP_MAP=COND,       *00929890
               &SMF99_S4_SDEF_MAP=COND,&SMF99_S4_IOPDT_MAP=COND,       *00938880
               &SMF99_S4_IO_PLOT_MAP=COND,&SMF99_S5_MON_MAP=COND,      *00947870
               &SMF99_S5_PPLT_MAP=COND,&SMF99_S5_CPLT_MAP=COND,        *00956860
               &SMF99_S6_SDEF_MAP=COND,&SMF99_S6_PER_MAP=COND,         *00965850
               &SMF99_S7_SDEF_MAP=COND,&SMF99_S7_PAV_DEV_MAP=COND,     *00974840
               &SMF99_S8_SDEF_MAP=COND,&SMF99_S8_LD_MAP=COND,          *00983830
               &SMF99_S8_PT_MAP=COND,&SMF99_S8_PC_MAP=COND,            *00992820
               &SMF99_S9_SDEF_MAP=COND,&SMF99_S9_IO_SUBSYSTEM_MAP=COND,*01001810
               &SMF99_S9_IOSUB_MAP=COND,&SMF99_S9_CHANNEL_MAP=COND,    *01020800
               &SMF99_XMEM_MAP=COND,&SMF99_SERVER_MAP=COND,            *01032000
               &SMF99_SDATA_MAP=COND,&SMF99_QDATA_MAP=COND,            *01057000
               &SMF99_RQDATA_MAP=COND,&SMF99_AS_ESP_MAP=COND,          *01091600
               &SMF99_ONE_CURVE_POINT_MAP=COND,                        *01126200
               &SMF99_TWO_CURVE_POINT_MAP=COND,                        *01139100
               &SMF99_THREE_CURVE_POINT_MAP=COND,                      *01152100
               &SMF99_S6_SERVER_MAP=COND,&SMF99_IOSUB_SAMPLES_MAP=COND  01178000
         GBLC  &IRASMF99_INCLUDED                                       01204000
         GBLC  &ZCBPRINT                                                01247000
&IRASMF99_INCLUDED SETC 'YES'                                           01290000
         AIF   ('&LIST' EQ 'NONE').P0                                   01304300
         AIF   ('&TITLE' EQ 'NO').P5                                    01318600
 TITLE   'IRASMF99  - SMF type 99 mappings                        '     01333000
.P5      ANOP                                                           01354500
**/ IRASMF99_1:;                                                        01376000
*/***START OF SPECIFICATIONS******************************************/ 01419000
*/*                                                                  */ 01462000
*/*01* Proprietary statement:                                        */ 01505000
*/*                                                                  */ 01548000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01591000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01634000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000             @L1C*/ 01684000
*/*                                                                  */ 01763000
*/*01* External classification: PSPI                                 */ 01849000
*/*01* End of External classification                                */ 01892000
*/*                                                                  */ 01935000
*/*01* Status: HBB7703                                           @L1C*/ 01978000
*/*                                                                  */ 02021000
*/*01* Descriptive Name: SMF type 99 mappings                        */ 02064000
*/*                                                                  */ 02107000
*/*02*  Acronym: SMF99                                               */ 02150000
*/*                                                                  */ 02193000
*/*01* Macro Name: IRASMF99                                          */ 02236000
*/*                                                                  */ 02279000
*/*01* DSECT Name: SMF_HEADER_MAP                                    */ 02322000
*/*                                                                  */ 02365000
*/*01* Component: Systems Resource Manager (SC1CX)                   */ 02408000
*/*                                                                  */ 02451000
*/*01* Eye-Catcher: None                                             */ 02494000
*/*                                                                  */ 02537000
*/*01* Storage Attributes:                                           */ 02580000
*/*02*  Subpool: Any                                                 */ 02623000
*/*02*  Key: Any                                                     */ 02666000
*/*02*  Residency: Above 16M line                                    */ 02709000
*/*                                                                  */ 02752000
*/*01* Pointed to by: N/A                                            */ 02773500
*/*01* Size: Determined at run time                                  */ 02795000
*/*                                                                  */ 02838000
*/*01* Created by: Caller                                            */ 02881000
*/*                                                                  */ 02924000
*/*01* Serialization: None                                           */ 02967000
*/*                                                                  */ 03010000
*/*01* Function: Contains SRM diagnostic data                        */ 03053000
*/*                                                                  */ 03096000
*/*01* Restrictions: None                                            */ 03099000
*/*                                                                  */ 03102000
*/*------------------------------------------------------------------*/ 03105000
*/*                                                                  */ 03108000
*/*01* Notes:                                                        */ 03111000
*/*                                                                  */ 03114000
*/*    These records contain information about the state of the      */ 03117000
*/*    system and the workload that is executing on it.              */ 03120000
*/*                                                                  */ 03123000
*/*    Subtype 1 records contain information describing the current  */ 03126000
*/*    state of the system. They also contain, at a resource group   */ 03129000
*/*    level, information about work running in the system.          */ 03132000
*/*                                                                  */ 03135000
*/*    Subtype 2 records contain workload information for each       */ 03138000
*/*    service period.  Each subtype 2 record contains information   */ 03141000
*/*    about all the service periods for a single service class.     */ 03144000
*/*                                                                  */ 03147000
*/*    Subtype 3 records contain information from the various plots  */ 03150000
*/*    for each service period.  Each subtype 3 record contains      */ 03153000
*/*    information about all the service periods for a single        */ 03156000
*/*    service class.                                                */ 03159000
*/*                                                                  */ 03162000
*/*    Subtype 4 records contain information about the device        */ 03165000
*/*    clusters in the system.  Each subtype for contains            */ 03168000
*/*    information for a single device cluster.                      */ 03171000
*/*                                                                  */ 03174000
*/*    Subtype 5 records contain storage use information on an       */ 03177000
*/*    address space basis.  Each subtype 5 record contains          */ 03180000
*/*    information for one monitored address space.                  */ 03183000
*/*                                                                  */ 03186000
*/*    Subtype 6 records contain summary information about each      */ 03189000
*/*    service class period including the resource control settings  */ 03192000
*/*    (CPU DP, I/O DP,...)  for the next policy interval.           */ 03195000
*/*                                                                  */ 03198000
*/*    Subtype 7 records contain information concerning PAV devices. */ 03201000
*/*                                                                  */ 03204000
*/*    Subtype 8 records contain information concerning WLM LPAR     */ 03207000
*/*    management.  One subtype 8 record exists for each partition   */ 03210000
*/*    that exists within an LPAR Cluster.                           */ 03213000
*/*                                                                  */ 03216000
*/*------------------------------------------------------------------*/ 03219000
*/*                                                                  */ 03225000
*/*01* Method of Access:                                             */ 03268000
*/*                                                                  */ 03311000
*/*02*  ASM:                                                         */ 03354000
*/*          Specify: IRASMF99                                       */ 03397000
*/*                                                                  */ 03440000
*/*02*  PLX:                                                         */ 03483000
*/*                                                                  */ 03526000
*/*          %INCLUDE SYSLIB(IRASMF99)                               */ 03569000
*/*          Using on SMF_HDR_MAP give addressability to the header. */ 03612000
*/*          Subsequent usings must be done to get addressability    */ 03655000
*/*          to the additional sections (DSECTs) as indicated in     */ 03698000
*/*          the comments above each section.                        */ 03741000
*/*                                                                  */ 03784000
*/*          In cases where there are multiple elements in a         */ 03827000
*/*          section, subsequent elements can be found by adding     */ 03870000
*/*          the size of one element to the basing.                  */ 03913000
*/*                                                                  */ 03956000
*/*     Subtype 9 records contain information concerning IOS         */ 03966700
*/*     subsystems.                                                  */ 03977400
*/*                                                                  */ 03988100
*/*02*  VIA ATTRIBUTE:                                               */ 03999000
*/*                                                                  */ 04042000
*/*          N/A                                                     */ 04085000
*/*                                                                  */ 04128000
*/*------------------------------------------------------------------*/ 04142300
*/*                                                                  */ 04156600
*/*01* Change Activity:                                              */ 04171000
*/*                                                                  */ 04192500
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 04214000
*/* $T1=OW00692 HBB5510 931231 PD00BA:  TRSQ PTM set 1               */ 04257000
*/* $P1=PMW1190 HBB5510 940202 PD00BA:  OW01261: Always fill in      */ 04300000
*/*    SMF99_pesswap, add internal class name to subtype 2       @P1A*/ 04343000
*/* $P2=PMW1180 HBB5510 940202 PD00BA:  OW01261: Fill in optional    */ 04386000
*/*                                  data fields in AAT entries. @P3A*/ 04429000
*/* $P3=PMW1198 HBB5510 940202 PD00BA:  OW02200: remove subtype 4    */ 04472000
*/* $P4=PMW1200 HBB5510 940202 PD00BA:  OW02200: Fill in AS ESPs     */ 04515000
*/* $L1=ARM     HBB5520 940315 PD00CF:  Automatic Restart Manager    */ 04558000
*/* $L2=CAPT2   HBB5520 940414 PD88D0:  Captured Storage Support     */ 04601000
*/* $P5=PMW1208 HBB5510 940202 PD00BA: OW02793: Add common protected */ 04622500
*/*                                    processor storage target to   */ 04644000
*/*                                    subtype 1 system state section*/ 04665500
*/*                                                                  */ 04687000
*/* $P6=PMW1205 HBB5510 940202 PD00BZ: OW02793: Remove largest y     */ 04697700
*/*                                    field                         */ 04708400
*/* $P7=PMW1212 HBB5510 940202 PD00BZ: OW02793: Add SMF99_PRTP       */ 04719100
*/* $P8=PIG5272 HBB5510 940630 PD00BA: OW04143: Remove redundant     */ 04721800
*/*                                             SERVED fields        */ 04724500
*/* $P9=PIG5420 HBB5510 940630 PD00BA: OW04143: Add fields for ASID  */ 04727200
*/* $WLMCIOP    HBB6603 950810 PD00BZ: I/O Priority support          */ 04727400
*/* $WLMCESM    HBB6603 950114 PD00BZ: WLMESM - Peter Yocom          */ 04727600
*/*                                    Support for enclave and queue */ 04727800
*/*                                    servers                       */ 04728000
*/* $WLMCTSO    HBB6603 950128 PD00BZ: WLMESM - Peter Yocom          */ 04728200
*/*                                    Support for TSO GR            */ 04728400
*/*                                    servers                       */ 04728600
*/* $PQC1544    HBB6603 960615 PD00BZ: Peter Yocom: Add longer server*/ 04728800
*/*                                    requests                      */ 04729000
*/* $OW21214    HBB6603 960615 PD00BZ: Peter Yocom: Add total paging */ 04729200
*/*                                    cost                          */ 04729400
*/* $PSY0628    JBB6604 970510 PDBZ:   Peter Yocom: Sysplex batch    */ 04734200
*/*                                    support - OW26823             */ 04739000
*/* $DSY006     JBB6604 970615 PDBZ:   Peter Yocom: Subtype 6        */ 04743800
*/*                                    support - OW26823             */ 04748600
*/* $PSY0690    JBB6604 970725 B9HABB: John Arwe: OW28361               04758200
* *                                    remote queue data changes        04767800
* * $WLMCBSR    HBB6606 971118 PDDA:   Tak Chin: Discretionary goal     04768100
* *                                    management II.  Added            04768200
* *                                    SMF99_RG_IS_DYNAMIC,             04768300
* *                                    SMF99_PGRN, and updated          04768400
* *                                    the SMF 99 version number.       04768500
* * $OW29790    HBB6605 970924 PDBZ:   PETER YOCOM: DEFINE              04768600
* *                                    SMF996_PERCENTILE and subtype 6  04768700
* *                                    server section                   04768800
* * $WLMCTAL    JBB6607 980605 PDDA:   Tak Chin: Dynamic Alias Tuning.  04769000
* *                                    Add subtype 7 record.            04769200
* * $OW37216    JBB6607 990416 PDBZ:   Add sysplex wide fields,         04769600
* *                                    Add SMF99V2_VER1 field.          04770000
* * $OW39854    JBB6607 990520 PDDA:   Add additional fields to subtype 04770100
* *                                    7 record for PAV devices         04770200
* * $WLMCSTT    HBB7703 990922 PDHARV: Robert Vaupel                    04770300
* *                                    Server Task Thread Management    04770400
* * $WLMCLPM    HBB7703 991026 B9HADB: Dave Bostjancic                  04770500
* *                                    WLM LPAR Management              04770600
* *                                    Add subtype 8 record.            04770700
* * $WLMCDCM    HBB7703 991014 PDVA:   Victor Alonzo                    04770800
* *                                    Dynamic CHPID Management         04770900
* *                                    Add new subtype 9 record and     04771000
* *                                    Add new variables to subtype 2.  04771100
* * $PXD1343    HBB7703 990309 PDVA:   Victor Alonzo                    04771200
* *                                    Added 3 new variables for        04771300
* *                                    channel information in Subtype 9 04771400
* * $OW42779    JBB7713 000515 PDRV:   Robert Vaupel: AE Limit support  04771430
* *                                    Peter Yocom: Add queue service   04771440
* *                                    time plot                        04771460
* * $WLMCGMS    HBB7703 000626 PDCO:   Hiren Shah                       04771463
* *                                    Goal Mode Inhbitors              04771466
* *                                    Storage Protection               04771469
* * $WLMCGMC    HBB7703 000626 PDCO:   Hiren Shah              @OW43855 04771472
* *                                    WLM GMI support                  04771475
* *                                    Cpu Management                   04771478
* * $PYD0520    JBB7713 001113 PDCO:   Hiren Shah                       04771481
* *                                    capture short wait count for     04771484
* *                                    SMF99 record                     04771487
* * $PYD0009    JBB7713 000410 B9HADB: Dave Bostjancic                  04771490
* *                                    Recovery fields for SMF 99       04771493
* * $OW47156    HBB7703 010109 3241RV: Robert Vaupel: Correct anchor    04771495
* *                                    of queue service time plot       04771497
* * $OW45238    HBB7703 001107 PDRV:   Robert Vaupel: Temp. Affinity    04771498
* *                                    Add active region work count     04771499
* * $OW50407    HBB6606 010920 B9HAGD: Add counts of ineligible jobs    04771510
* *                                    to smf99 records to help with    04771520
* *                                    debugging batch problems         04771530
* *                                                                     04771540
* ***END OF SPECIFICATIONS********************************************/ 04771600
*% /*                                                                   04773000
.P0      ANOP                                                           04794500
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04816000
         AIF   ('&LIST' EQ 'YES').P2                                    04859000
.P1      ANOP                                                           04902000
         PUSH  PRINT                                                    04945000
         PRINT OFF                                                      04988000
.P2      ANOP                                                           05031000
*                                                                       05074000
*    *****************************************************************  05117000
*    *                                                               *  05160000
*    * IRASMF99.799: SMF Type 99 record - These records contain      *  05203000
*    * information about the state of the system and the workload    *  05246000
*    * that is executing on it.                                      *  05296000
*    *                                                               *  05805000
*    *****************************************************************  05848000
*                                                                       05891000
*                                                                       05934000
         AIF   ('&SMF_HDR_MAP' EQ 'NO').L0002                           05977000
         AIF   ('&DSECT' EQ 'YES').L0003                                06020000
         AIF   ('&SMF_HDR_MAP' NE 'YES').L0002                          06063000
SMF_HDR_MAP DS 0F                                                       06106000
         AGO   .L0004                                                   06149000
.L0003   ANOP                                                           06192000
SMF_HDR_MAP DSECT                                                       06235000
.L0004   ANOP                                                           06278000
SMF99_RDW DS   0CL0004   IRASMF99.3028: Record descriptor word          06340980
SMF99LEN DS    1FL2      IRASMF99.3031: Record Length. This field and  *06364000
                         the next field (total of four bytes) form the *06407000
                         RDW (record descriptor word).                  06450000
SMF99SEG DS    1FL2      IRASMF99.3037: Segment descriptor (see record *06493000
                         length field)                                  06536000
SMF99FLG DS    0BL1      IRASMF99.3043: System indicator: Bit 0        *06608980
                         reserved, Bit 1 subtypes utilized, Bit 2      *06622000
                         reserved, Bits 3 -6 version indicators, Bit 7 *06665000
                         reserved                                       06708000
SMF99STU EQU   X'40'     IRASMF99.3055: Subtypes utilized               06751000
         ORG   SMF99FLG+X'00000001'                                     06794000
SMF99RTY DS    1FL1      IRASMF99.3067: Record type 99                  06837000
SMF99TME DS    1FL4      IRASMF99.2942: Time since midnight, in        *06880000
                         hundreths of a second, that the record was    *06923000
                         moved into the SMF buffer                      06966000
SMF99DTE DS    1CL0004   IRASMF99.293: Date when the record was moved  *07009000
                         into the SMF buffer, in the form 0cyydddF.     07052000
SMF99SID DS    1CL0004   IRASMF99.317: System identification (from the *07095000
                         SID parameter).                                07138000
SMF99SSID DS   1CL0004   IRASMF99.323: Sub System Identification        07181000
SMF99TID DS    1FL2      IRASMF99.416: Record subtype (must be at      *07224000
                         offset '16'X)                                  07267000
SMF99_SDEF_LEN DS 1FL4   IRASMF99.373: Length of self definition       *07310000
                         section                                        07353000
SMF_HDR_MAP_LEN EQU *-SMF_HDR_MAP                                       07396000
.L0002   ANOP                                                           07439000
*                                                                       07482000
*    *****************************************************************  07525000
*    *                                                               *  07568000
*    * IRASMF99.805: SMF self definining section                     *  07611000
*    * BASED(addr(smf_hdr_MAP) + length(smf_hdr_MAP))                *  07654000
*    *                                                               *  07697000
*    *****************************************************************  07740000
*                                                                       07783000
*                                                                       07826000
         AIF   ('&SMF99_SDEF_MAP' EQ 'NO').L0005                        07869000
         AIF   ('&DSECT' EQ 'YES').L0006                                07912000
         AIF   ('&SMF99_SDEF_MAP' NE 'YES').L0005                       07955000
SMF99_SDEF_MAP DS 0F                                                    07998000
         AGO   .L0007                                                   08041000
.L0006   ANOP                                                           08084000
SMF99_SDEF_MAP DSECT                                                    08127000
.L0007   ANOP                                                           08170000
SMF99POF DS    1FL4      IRASMF99.12: Offset to the product section    *08213000
                         from the beginning of the record (including   *08256000
                         RDW)                                           08299000
SMF99PLN DS    1FL2      IRASMF99.18: Length of the product section     08342000
SMF99PON DS    1FL2      IRASMF99.24: Number of product sections        08385000
SMF99DOF DS    1FL4      IRASMF99.2312: Offset to the data section     *08428000
                         from the beginning of the record (including   *08471000
                         RDW).                                          08514000
SMF99DLN DS    1FL2      IRASMF99.2317: Length of the data section      08557000
SMF99DON DS    1FL2      IRASMF99.2329: Number of data sections         08600000
SMF99_SDEF_MAP_LEN EQU *-SMF99_SDEF_MAP                                 08643000
.L0005   ANOP                                                           08686000
*                                                                       08729000
*    *****************************************************************  08772000
*    *                                                               *  08815000
*    * IRASMF99.810: SMF99 product information                       *  08858000
*    * BASED(addr(smf_hdr_MAP) + smf99pof)                           *  08901000
*    *                                                               *  08944000
*    *****************************************************************  08987000
*                                                                       09030000
*                                                                       09073000
         AIF   ('&SMF99_PRODUCT_MAP' EQ 'NO').L0008                     09116000
         AIF   ('&DSECT' EQ 'YES').L0009                                09159000
         AIF   ('&SMF99_PRODUCT_MAP' NE 'YES').L0008                    09202000
SMF99_PRODUCT_MAP DS 0F                                                 09245000
         AGO   .L000A                                                   09288000
.L0009   ANOP                                                           09331000
SMF99_PRODUCT_MAP DSECT                                                 09374000
.L000A   ANOP                                                           09417000
SMF99VN2 DS    1FL2      IRASMF99.51: Record sub version. Use to       *09438500
                         identify changes to the record in the service *09460000
                         stream                                         09481500
SMF99RVN DS    1FL2      IRASMF99.57: Record Version Number             09503000
SMF99PNM DS    1CL0008   IRASMF99.2874: Product Name - SRM              09546000
SMF99SLV DS    1CL0008   IRASMF99.63: System level from which record   *09589000
                         was cut (copied from CVTPRODN)                 09632000
SMF99SNM DS    1CL0008   IRASMF99.2287: System name from which record  *09675000
                         was cut (copied from CVTSNAME)                 09718000
SMF99_PRODUCT_MAP_LEN EQU *-SMF99_PRODUCT_MAP                           09761000
.L0008   ANOP                                                           09804000
*                                                                       09847000
*    *****************************************************************  09890000
*    *                                                               *  09933000
*    * IRASMF99.2959: SMF99 subtype 1 self defining section          *  09976000
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                           *  10019000
*    *                                                               *  10062000
*    *****************************************************************  10105000
*                                                                       10148000
*                                                                       10191000
         AIF   ('&SMF99_S1_SDEF_MAP' EQ 'NO').L000B                     10234000
         AIF   ('&DSECT' EQ 'YES').L000C                                10277000
         AIF   ('&SMF99_S1_SDEF_MAP' NE 'YES').L000B                    10320000
SMF99_S1_SDEF_MAP DS 0F                                                 10363000
         AGO   .L000D                                                   10406000
.L000C   ANOP                                                           10449000
SMF99_S1_SDEF_MAP DSECT                                                 10492000
.L000D   ANOP                                                           10535000
SMF99TOF DS    1FL4      IRASMF99.349: Offset to the trace section     *10578000
                         from the beginning of the record (including   *10621000
                         RDW).                                          10664000
SMF99TLN DS    1FL2      IRASMF99.355: Length of the trace section      10707000
SMF99TON DS    1FL2      IRASMF99.361: Number of trace sections         10750000
SMF99SSOF DS   1FL4      IRASMF99.367: Offset to the System state      *10793000
                         section from the beginning of the record      *10836000
                         (including RDW).                               10879000
SMF99SSLN DS   1FL2      IRASMF99.409: Length of the System state      *10922000
                         section                                        10965000
SMF99SSON DS   1FL2      IRASMF99.394: Number of system state sections  11008000
SMF99PPOF DS   1FL4      IRASMF99.71: Offset to the Paging plot        *11051000
                         section from the beginning of the record      *11094000
                         (including RDW).                               11137000
SMF99PPLN DS   1FL2      IRASMF99.377: Length of the Paging plot       *11180000
                         section                                        11223000
SMF99PPON DS   1FL2      IRASMF99.79: Number of paging plot sections    11266000
SMF99PTOF DS   1FL4      IRASMF99.462: Offset to the Priority table    *11309000
                         section from the beginning of the record      *11352000
                         (including RDW).                               11395000
SMF99PTLN DS   1FL2      IRASMF99.468: Length of the Priority table    *11438000
                         section                                        11481000
SMF99PTON DS   1FL2      IRASMF99.2275: Number of Priority table       *11524000
                         sections                                       11567000
SMF99RGOF DS   1FL4      IRASMF99.2285: Offset to the Resource Group   *11610000
                         section from the beginning of the record      *11653000
                         (including RDW).                               11696000
SMF99RGLN DS   1FL2      IRASMF99.499: Length of the resource group    *11739000
                         section                                        11782000
SMF99RGON DS   1FL2      IRASMF99.505: Number of resource group        *11825000
                         sections                                       11868000
SMF99GROF DS   1FL4      IRASMF99.3268: Offset to the generic resouce  *11873300
                         section from the beginning of the record      *11878600
                         (including RDW).                               11883900
SMF99GRLN DS   1FL2      IRASMF99.3274: Length of the generic resource *11889200
                         section                                        11894500
SMF99GRON DS   1FL2      IRASMF99.3280: Number of generic resource     *11899800
                         sections                                       11905100
SMF99_S1_SDEF_MAP_LEN EQU *-SMF99_S1_SDEF_MAP                           11911000
.L000B   ANOP                                                           11954000
*                                                                       11997000
*    *****************************************************************  12040000
*    *                                                               *  12083000
*    * IRASMF99.2967: SMF99 subtype 1 trace table entry - The trace  *  12126000
*    * table contains information about the policy and resource      *  12169000
*    * adjustment decisions made during the last policy interval.    *  12212000
*    * BASED(addr(smf_hdr_MAP) + smf99tof)                           *  12255000
*    *                                                               *  12298000
*    *****************************************************************  12341000
*                                                                       12384000
*                                                                       12427000
         AIF   ('&SMF99_S1_AAT_MAP' EQ 'NO').L000E                      12470000
         AIF   ('&DSECT' EQ 'YES').L000F                                12513000
         AIF   ('&SMF99_S1_AAT_MAP' NE 'YES').L000E                     12556000
SMF99_S1_AAT_MAP DS 0F                                                  12599000
         AGO   .L0010                                                   12642000
.L000F   ANOP                                                           12685000
SMF99_S1_AAT_MAP DSECT                                                  12728000
.L0010   ANOP                                                           12771000
SMF99_TPID DS  1FL1      IRASMF99.534: Policy adjustment interval      *12814000
                         identifier                                     12857000
SMF99_TRID DS  1FL1      IRASMF99.540: Resource adjustment interval    *12900000
                         identifier                                     12943000
SMF99_TCOD DS  1FL2      IRASMF99.551: Policy adjustment action code    12986000
SMF99_TJOB DS  1CL0008   IRASMF99.484: Job name of address space       *13029000
                         effected by action being traced (blank if not *13072000
                         an address space level action)                 13115000
SMF99_TLPI DS  1FL4      IRASMF99.490: Projected local performance     *13158000
                         index to be acheived as a result of the       *13201000
                         traced action                                  13244000
SMF99_TSPI DS  1FL4      IRASMF99.496: Projected sysplex performance   *13287000
                         index to be acheived as a result of the       *13330000
                         traced action                                  13373000
SMF99_TGSR DS  1FL4      IRASMF99.2335: Projected resource group       *13416000
                         service rate be acheived as a result of the   *13459000
                         traced action                                  13502000
SMF99_TDT1 DS  1FL4      IRASMF99.385: System use                       13545000
SMF99_TDT2 DS  1FL4      IRASMF99.478: System use                       13588000
SMF99_TDT3 DS  1FL4      IRASMF99.89: System use                        13631000
SMF99_TRGN DS  1CL0008   IRASMF99.2548: Resource group Name (blank if  *13674000
                         no resource group)                             13717000
SMF99_TCNM DS  1CL0008   IRASMF99.2608: Service Class Name              13760000
SMF99_TPER DS  1FL2      IRASMF99.2612: Service period number           13803000
SMF99_TASID DS 1BL2      IRASMF99.1503: Address Space ID number         13824500
SMF99_S1_AAT_MAP_LEN EQU *-SMF99_S1_AAT_MAP                             13846000
.L000E   ANOP                                                           13889000
*                                                                       13932000
*    *****************************************************************  13975000
*    *                                                               *  14018000
*    * IRASMF99.2291: SMF99 subtype 1 System State information -     *  14061000
*    * Contains information about the general state of the system.   *  14104000
*    * BASED(addr(smf_hdr_MAP) + smf99ssof)                          *  14147000
*    *                                                               *  14190000
*    *****************************************************************  14233000
*                                                                       14276000
*                                                                       14319000
         AIF   ('&SMF99_S1_SS_MAP' EQ 'NO').L0011                       14362000
         AIF   ('&DSECT' EQ 'YES').L0012                                14405000
         AIF   ('&SMF99_S1_SS_MAP' NE 'YES').L0011                      14448000
SMF99_S1_SS_MAP DS 0F                                                   14491000
         AGO   .L0013                                                   14534000
.L0012   ANOP                                                           14577000
SMF99_S1_SS_MAP DSECT                                                   14620000
.L0013   ANOP                                                           14663000
SMF99_CPUA DS  1FL2      IRASMF99.110: Average Processor Utilization   *14706000
                         scaled by 16                                   14749000
SMF99_UMP DS   1FL2      IRASMF99.116: Recent unmanaged paging and     *14792000
                         swap cost percentage                           14835000
SMF99_UIC1 DS  1FL4      IRASMF99.122: Frames in uic bucket 1 - The    *14878000
                         central and expanded UIC buckets contain a    *14921000
                         count of frames that have not been referenced *14964000
                         for specified periods of time. So, UIC bucket *15007000
                         1 is a count of the frames that have most     *15050000
                         recently been referenced, where bucket 4      *15093000
                         contains a count of the frames that have not  *15136000
                         been referenced in a long time. The UIC       *15179000
                         delimiter values specify the cutoff points    *15222000
                         for each bucket . For example,SMF99_EUIC3      15265000
*                        will contain the count of all the expanded    *15308000
                         storage frames whose time since they were     *15351000
                         last referenced is between SMF99_ESTB2 and    *15394000
                         SMF99_ESTB3.                                   15437000
SMF99_UIC2 DS  1FL4      IRASMF99.531: Frames in uic bucket 2           15480000
SMF99_UIC3 DS  1FL4      IRASMF99.519: Frames in uic bucket 3           15523000
SMF99_UIC4 DS  1FL4      IRASMF99.667: Frames in uic bucket 4           15566000
SMF99_EUIC1 DS 1FL4      IRASMF99.675: Frames in Expanded uic bucket 1  15609000
SMF99_EUIC2 DS 1FL4      IRASMF99.2835: Frames in Expanded uic bucket  *15652000
                         2                                              15695000
SMF99_EUIC3 DS 1FL4      IRASMF99.2635: Frames in Expanded uic bucket  *15738000
                         3                                              15781000
SMF99_EUIC4 DS 1FL4      IRASMF99.759: Frames in Expanded uic bucket 4  15824000
SMF99_FRV1 DS  1FL2      IRASMF99.2872: UIC delimiter value 1           15867000
SMF99_FRV2 DS  1FL2      IRASMF99.2849: UIC delimiter value 2           15910000
SMF99_FRV3 DS  1FL2      IRASMF99.128: UIC delimiter value 3            15953000
SMF99_ESTB1 DS 1FL2      IRASMF99.679: expanded storage UIC delimiter  *15996000
                         value 1                                        16039000
SMF99_ESTB2 DS 1FL2      IRASMF99.660: expanded storage UIC delimiter  *16082000
                         value 2                                        16125000
SMF99_ESTB3 DS 1FL2      IRASMF99.685: expanded storage UIC delimiter  *16168000
                         value 3                                        16211000
SMF99_W2MIG DS 1FL4      IRASMF99.808: Write to migrate percentage      16254000
SMF99_PTAVAIL DS 1FL4    IRASMF99.967: Total processor time available, *16297000
                         including captured time plus wait time         16340000
SMF99_SHORT_FLAGS DS 0CL0001 IRASMF99.2515: shortage flags              16402980
SMF99_SHORT EQU X'80'    IRASMF99.1443: Real storage shortage exists    16426000
SMF99_ASM1 EQU X'40'     IRASMF99.2602: First level Aux shortage       *16469000
                         exists                                         16512000
SMF99_AMS2 EQU X'20'     IRASMF99.2535: Critical Aux shortage exists    16555000
SMF99_SQA1 EQU X'10'     IRASMF99.2538: First level SQA shortage       *16598000
                         exists                                         16641000
SMF99_SQA2 EQU X'08'     IRASMF99.2541: Critical SQA shortage exists    16684000
         ORG   SMF99_SHORT_FLAGS+X'00000001'                            16727000
         DS    1CL0001   IRASMF99.2544: Reserved                        16741300
SMF99_TOTAL_PAG_COST DS 1FL2 IRASMF99.3103: Recent total paging and    *16755600
                         swap cost percentage * 10                      16769900
SMF99_CPPS DS  1FL4      IRASMF99.1631: Common protective processor    *16784300
                         storage target in frames                       16798600
SMF99_ILSU_ARRAY DS 0CL0032 IRASMF99.2566: Array of Importance Level   *16842980
                         Service Units. The first entry contains       *16856000
                         Service Units pertaining to Importance Level  *16899000
                         0, the second entry contains Service Units    *16942000
                         pertaining to Importance Level 1, and so on.  *16985000
                         The last entry contains Service Units         *17028000
                         pertaining to unused Service.                  17071000
SMF99_ILSU_ENTRY DS 1FL4 IRASMF99.2559: A single entry in the array of *17114000
                         Importance Level Service Units, containing    *17157000
                         the number of Service Units consumed by work  *17200000
                         at this Importance Level (or unused) over the *17243000
                         last ten seconds. The entries are indexed     *17286000
                         with an origin of zero so that the index      *17329000
                         matches the Importance Level to which the     *17372000
                         entry pertains.                                17415000
         ORG   SMF99_ILSU_ARRAY+X'00000020'                             17458000
SMF99_SUIC1 DS 1FL4      IRASMF99.1576: Shared central UIC bucket 1,   *17501000
                         measured in frame counts                       17544000
SMF99_SUIC2 DS 1FL4      IRASMF99.1582: Shared central UIC bucket 2,   *17587000
                         measured in frame counts                       17630000
SMF99_SUIC3 DS 1FL4      IRASMF99.1588: Shared central UIC bucket 3,   *17673000
                         measured in frame counts                       17716000
SMF99_SUIC4 DS 1FL4      IRASMF99.1594: Shared central UIC bucket 4,   *17759000
                         measured in frame counts                       17802000
SMF99_SEUC1 DS 1FL4      IRASMF99.1600: Shared expanded UIC bucket 1,  *17845000
                         measured in frame counts                       17888000
SMF99_SEUC2 DS 1FL4      IRASMF99.1606: Shared expanded UIC bucket 2,  *17931000
                         measured in frame counts                       17974000
SMF99_SEUC3 DS 1FL4      IRASMF99.1612: Shared expanded UIC bucket 3,  *18017000
                         measured in frame counts                       18060000
SMF99_SEUC4 DS 1FL4      IRASMF99.1618: Shared expanded UIC bucket 4,  *18103000
                         measured in frame counts                       18146000
SMF99_STWSS DS 1FL4      IRASMF99.1624: Protective processor storage   *18189000
                         target for shared area, measured in frame     *18232000
                         counts                                         18275000
SMF99_NUM_EXT_SC DS 1FL4 IRASMF99.3746: Number of external service     *18289300
                         classes                                        18303600
SMF99_S1_SS_MAP_LEN EQU *-SMF99_S1_SS_MAP                               18318000
.L0011   ANOP                                                           18361000
*                                                                       18404000
*    *****************************************************************  18447000
*    *                                                               *  18490000
*    * IRASMF99.2301: SMF99 subtype 1 Paging plot information -      *  18533000
*    * Contains the information plotted on the system paging         *  18576000
*    * responsivness plot. BASED(addr(smf_hdr_MAP) + smf99ppof)      *  18619000
*    *                                                               *  18662000
*    *****************************************************************  18705000
*                                                                       18748000
*                                                                       18791000
         AIF   ('&SMF99_S1_PP_MAP' EQ 'NO').L0014                       18834000
         AIF   ('&DSECT' EQ 'YES').L0015                                18877000
         AIF   ('&SMF99_S1_PP_MAP' NE 'YES').L0014                      18920000
SMF99_S1_PP_MAP DS 0F                                                   18963000
         AGO   .L0016                                                   19006000
.L0015   ANOP                                                           19049000
SMF99_S1_PP_MAP DSECT                                                   19092000
.L0016   ANOP                                                           19135000
SMF99_PAGP_BW DS 1FL4    SRMPLOT.6805: Bucket width                     19178000
SMF99_PAGP_LSTX DS 1FL4  SRMPLOT.6513: Last plotted x bucket            19221000
         DS    1FL4      SRMPLOT.7167: Reserved                         19264000
SMF99_PAGP_POINTS_OF DS 1FL4 SRMPLOT.6666: Offset of point entries      19307000
SMF99_PAGP_POINTS_ON DS 1FL2 SRMPLOT.6663: Number of point entries      19350000
SMF99_PAGP_POINTS_LN DS 1FL2 SRMPLOT.7503: Length of a point entry      19393000
SMF99_S1_PP_MAP_LEN EQU *-SMF99_S1_PP_MAP                               19436000
.L0014   ANOP                                                           19479000
*                                                                       19522000
*    *****************************************************************  19565000
*    *                                                               *  19608000
*    * IRASMF99.2303: SMF99 subtype 1 Priority table entry - Contains*  19651000
*    * information pertaining to the demand being put on the         *  19694000
*    * processor by work at different dispatch priorities.           *  19737000
*    * BASED(addr(smf_hdr_MAP) + smf99ptof)                          *  19780000
*    *                                                               *  19823000
*    *****************************************************************  19866000
*                                                                       19909000
*                                                                       19952000
         AIF   ('&SMF99_S1_PT_MAP' EQ 'NO').L0017                       19995000
         AIF   ('&DSECT' EQ 'YES').L0018                                20038000
         AIF   ('&SMF99_S1_PT_MAP' NE 'YES').L0017                      20081000
SMF99_S1_PT_MAP DS 0F                                                   20124000
         AGO   .L0019                                                   20167000
.L0018   ANOP                                                           20210000
SMF99_S1_PT_MAP DSECT                                                   20253000
.L0019   ANOP                                                           20296000
SMF99_PTPRTY DS 1FL2     IRASMF99.2586: Dispatch priority               20339000
SMF99_PTNP DS  1FL2      IRASMF99.2587: New dispatch priority (zero if *20382000
                         not changed)                                   20425000
SMF99_PTIMDP DS 1FL4     IRASMF99.2593: initial maximum percentage of  *20468000
                         processor demanded at priority, initial value *20511000
                         before any priority moves or slice changes     20554000
SMF99_PTPMDP DS 1FL4     IRASMF99.2659: projected maximum percentage   *20597000
                         of processor demanded at priority              20640000
SMF99_PTCPUU DS 1FL4     IRASMF99.1445: cpu using samples at priority   20683000
SMF99_PTCPUD DS 1FL4     IRASMF99.1449: cpu delay samples at priority   20726000
SMF99_PTW2UR DS 1FL4     IRASMF99.2503: wait-to-using ratio at         *20769000
                         priority (*16)                                 20812000
SMF99_PTAPU DS 1FL4      IRASMF99.2506: actual measured processor used *20855000
                         at priority                                    20898000
SMF99_PTPPU DS 1FL4      IRASMF99.2509: projected processor time to be *20941000
                         used at priority                               20984000
SMF99_PTACMD DS 1FL4     IRASMF99.2512: achievable cumulative max      *21027000
                         demand for priorities affected by a move       21070000
         DS    1FL4      IRASMF99.1433: reserved                        21113000
SMF99_PTIMAXD DS 1FL4    IRASMF99.694: initial cumulative maximum      *21156000
                         demand                                         21199000
SMF99_PTWMAXD DS 1FL4    IRASMF99.700: Projected cumulative maximum    *21242000
                         demand                                         21285000
SMF99_PTIAMTW DS 1FL4    IRASMF99.706: initial average mean time to    *21328000
                         wait                                           21371000
SMF99_PTWAMTW DS 1FL4    IRASMF99.709: Projected average mean time to  *21414000
                         wait                                           21457000
SMF99_S1_PT_MAP_LEN EQU *-SMF99_S1_PT_MAP                               21500000
.L0017   ANOP                                                           21543000
*                                                                       21586000
*    *****************************************************************  21629000
*    *                                                               *  21672000
*    * IRASMF99.2328: SMF99 subtype 1 Resource Group entry - Contains*  21715000
*    * information about resource groups. BASED(addr(smf_hdr_MAP) +  *  21758000
*    * smf99rgof)                                                    *  21801000
*    *                                                               *  21844000
*    *****************************************************************  21887000
*                                                                       21930000
*                                                                       21973000
         AIF   ('&SMF99_S1_RG_MAP' EQ 'NO').L001A                       22016000
         AIF   ('&DSECT' EQ 'YES').L001B                                22059000
         AIF   ('&SMF99_S1_RG_MAP' NE 'YES').L001A                      22102000
SMF99_S1_RG_MAP DS 0F                                                   22145000
         AGO   .L001C                                                   22188000
.L001B   ANOP                                                           22231000
SMF99_S1_RG_MAP DSECT                                                   22274000
.L001C   ANOP                                                           22317000
SMF99_RGNAME DS 1CL0008  IRASMF99.727: name                             22360000
SMF99_MIN_SR DS 1FL4     IRASMF99.341: Minimum service rate for the    *22403000
                         group                                          22446000
SMF99_MAX_SR DS 1FL4     IRASMF99.134: Maximum service rate for the    *22489000
                         group (FFFFFFFF if not specified in the       *22532000
                         policy)                                        22575000
SMF99_ACT_SR DS 1FL4     IRASMF99.140: Service rate received in last   *22618000
                         interval on the local system                   22661000
SMF99_SPAS DS  1FL4      IRASMF99.146: service per awake slice          22704000
SMF99_SLICES DS 1FL2     IRASMF99.1194: Number of time slices that     *22747000
                         work in this group was capped                  22790000
SMF99_RHELPCNT0 DS 1FL2  IRASMF99.994: a count of the remote systems   *22833000
                         that can help work at importance 0             22876000
SMF99_RHELPCNT1 DS 1FL2  IRASMF99.1150: a count of the remote systems  *22919000
                         that can help work at importance 1             22962000
SMF99_RHELPCNT2 DS 1FL2  IRASMF99.1156: a count of the remote systems  *23005000
                         that can help work at importance 2             23048000
SMF99_RHELPCNT3 DS 1FL2  IRASMF99.2243: a count of the remote systems  *23091000
                         that can help work at importance 3             23134000
SMF99_RHELPCNT4 DS 1FL2  IRASMF99.2249: a count of the remote systems  *23177000
                         that can help work at importance 4             23220000
SMF99_RHELPCNT5 DS 1FL2  IRASMF99.2620: a count of the remote systems  *23263000
                         that can help work at importance 5             23306000
SMF99_RHELPCNT6 DS 1FL2  IRASMF99.2626: a count of the remote systems  *23349000
                         that can help work at importance 6             23392000
SMF99_LHELP_FLGS DS 0CL0001 IRASMF99.2634: Local system can help work  *23464980
                         at each importance. 1 - can help, 0 - cannot  *23478000
                         help                                           23521000
SMF99_LHELP6 EQU X'40'   IRASMF99.2657: Local system can help work at  *23564000
                         importance 0. 1 - can help, 0 - cannot help    23607000
SMF99_LHELP5 EQU X'20'   IRASMF99.2674: Local system can help work at  *23650000
                         importance 1. 1 - can help, 0 - cannot help    23693000
SMF99_LHELP4 EQU X'10'   IRASMF99.2691: Local system can help work at  *23736000
                         importance 2. 1 - can help, 0 - cannot help    23779000
SMF99_LHELP3 EQU X'08'   IRASMF99.2641: Local system can help work at  *23822000
                         importance 3. 1 - can help, 0 - cannot help    23865000
SMF99_LHELP2 EQU X'04'   IRASMF99.2732: Local system can help work at  *23908000
                         importance 4. 1 - can help, 0 - cannot help    23951000
SMF99_LHELP1 EQU X'02'   IRASMF99.2741: Local system can help work at  *23994000
                         importance 5. 1 - can help, 0 - cannot help    24037000
SMF99_LHELP0 EQU X'01'   IRASMF99.2747: Local system can help work at  *24080000
                         importance 6. 1 - can help, 0 - cannot help    24123000
         ORG   SMF99_LHELP_FLGS+X'00000001'                             24135200
SMF99_RG_FLAGS DS 0CL0001 IRASMF99.3875: resource group flags           24155380
SMF99_RG_IS_DYNAMIC EQU X'80' IRASMF99.3878: Indicates that the        *24159600
                         resource group is a dynamic resource group     24171800
         ORG   SMF99_RG_FLAGS+X'00000001'                               24184000
         DS    1CL0002   IRASMF99.3890: reserved                        24196200
SMF99_S1_RG_MAP_LEN EQU *-SMF99_S1_RG_MAP                               24209000
.L001A   ANOP                                                           24252000
*                                                                       24295000
*    *****************************************************************  24338000
*    *                                                               *  24381000
*    * IRASMF99.3302: SMF99 subtype 1 Generic Resource entry -       *  24381800
*    * Contains information about Generic Resource Routing.          *  24382600
*    * BASED(addr(smf_hdr_MAP) + smf99grof)                          *  24383400
*    *                                                               *  24384200
*    *****************************************************************  24385000
*                                                                       24385800
*                                                                       24386600
         AIF   ('&SMF99_S1_GR_MAP' EQ 'NO').L001D                       24387400
         AIF   ('&DSECT' EQ 'YES').L001E                                24388200
         AIF   ('&SMF99_S1_GR_MAP' NE 'YES').L001D                      24389000
SMF99_S1_GR_MAP DS 0F                                                   24389800
         AGO   .L001F                                                   24390600
.L001E   ANOP                                                           24391400
SMF99_S1_GR_MAP DSECT                                                   24392200
.L001F   ANOP                                                           24393000
SMF99_GR_SYSNAME DS 1CL0008 IRASMF99.1310: Name of system sessions     *24393800
                         were routed to                                 24394600
SMF99_GR_TSO_SESSIONS_ROUTED DS 1FL4 IRASMF99.1383: Number of TSO      *24395400
                         sessions routed to system named in            *24396200
                         SMF99_GR_SYSNAME                               24397000
SMF99_GR_NONTSO_SESSIONS_ROUTED DS 1FL4 IRASMF99.3308: Number of       *24397800
                         non-TSO sessions routed to system named in    *24398600
                         SMF99_GR_SYSNAME                               24399400
SMF99_GR_TSO_AVG_COST DS 1FL4 IRASMF99.2417: Average cost of TSO       *24400200
                         session in raw cpu service units on system    *24401000
                         SMF99_GR_SYSNAME                               24401800
SMF99_GR_TSO_PI DS 1FL4  IRASMF99.1389: Weighted average PI of service *24402600
                         class periods running TSO work on system      *24403400
                         SMF99_GR_SYSNAME                               24404200
SMF99_GR_FLAGS DS 0BL4   IRASMF99.1277: flags                           24405480
SMF99_GR_SHORTAGE EQU X'80' IRASMF99.3262: SMF99_GR_SYSNAME had a      *24405800
                         shortage that may have caused sessions not to *24406600
                         be routed to it                                24407400
         ORG   SMF99_GR_FLAGS+X'00000004'                               24408200
SMF99_GR_SERVICE_BY_IMPORTANCE DS 1FL4 IRASMF99.3087: A single entry   *24409000
                         in the array of Importance Level Service      *24409800
                         Units, containing the number of Service Units *24410600
                         consumed by work at this Importance Level (or *24411400
                         unused) over the last ten seconds. The        *24412200
                         entries are indexed with an origin of zero so *24413000
                         that the index matches the Importance Level   *24413800
                         to which the entry pertains. Index of zero    *24414600
                         corresponds to system work and index of 7 to  *24415400
                         unused capacity                                24416200
         ORG   SMF99_S1_GR_MAP+X'0000003C'                              24417000
SMF99_S1_GR_MAP_LEN EQU *-SMF99_S1_GR_MAP                               24417800
.L001D   ANOP                                                           24418600
*                                                                       24419400
*    *****************************************************************  24420200
*    *                                                               *  24421000
*    * IRASMF99.2323: SMF99 subtype 2 self defining section          *  24424000
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                           *  24467000
*    *                                                               *  24510000
*    *****************************************************************  24553000
*                                                                       24596000
*                                                                       24639000
         AIF   ('&SMF99_S2_SDEF_MAP' EQ 'NO').L0020                     24682000
         AIF   ('&DSECT' EQ 'YES').L0021                                24725000
         AIF   ('&SMF99_S2_SDEF_MAP' NE 'YES').L0020                    24768000
SMF99_S2_SDEF_MAP DS 0F                                                 24811000
         AGO   .L0022                                                   24854000
.L0021   ANOP                                                           24897000
SMF99_S2_SDEF_MAP DSECT                                                 24940000
.L0022   ANOP                                                           24983000
SMF992COF DS   1FL4      IRASMF99.2764: Offset to class information    *25026000
                         from beginning of record (including RDW)       25069000
SMF992CLN DS   1FL2      IRASMF99.2666: Length of class information     25112000
SMF992CON DS   1FL2      IRASMF99.2812: Number of class information     25155000
SMF992CPOF DS  1FL4      IRASMF99.2773: Offset to class period section *25198000
                         from beginning of record (including RDW)       25241000
SMF992CPLN DS  1FL2      IRASMF99.2776: Length of class period section  25284000
SMF992CPON DS  1FL2      IRASMF99.2782: Number of class period section  25327000
SMF99_S2_SDEF_MAP_LEN EQU *-SMF99_S2_SDEF_MAP                           25370000
.L0020   ANOP                                                           25413000
*                                                                       25456000
*    *****************************************************************  25499000
*    *                                                               *  25542000
*    * IRASMF99.2071: SMF99 subtype 2 Class data section - Contains  *  25585000
*    * information identifying the Service Class described in this   *  25628000
*    * record. BASED(addr(smf_hdr_MAP) + smf992cof)                  *  25671000
*    *                                                               *  25714000
*    *****************************************************************  25757000
*                                                                       25800000
*                                                                       25843000
         AIF   ('&SMF99_S2_CLS_MAP' EQ 'NO').L0023                      25886000
         AIF   ('&DSECT' EQ 'YES').L0024                                25929000
         AIF   ('&SMF99_S2_CLS_MAP' NE 'YES').L0023                     25972000
SMF99_S2_CLS_MAP DS 0H                                                  26015000
         AGO   .L0025                                                   26058000
.L0024   ANOP                                                           26101000
SMF99_S2_CLS_MAP DSECT                                                  26144000
.L0025   ANOP                                                           26187000
SMF99_CNAM DS  1CL0008   IRASMF99.2797: service class name              26230000
SMF99_CGRN DS  1CL0008   IRASMF99.2803: group name or blank if class   *26273000
                         doesn't belong to a group                      26316000
SMF99_CNUMP DS 1FL2      IRASMF99.753: number of periods in the class   26359000
SMF99_CINDEX DS 1FL2     IRASMF99.765: service class index              26402000
SMF99_S2_CLS_MAP_LEN EQU *-SMF99_S2_CLS_MAP                             26445000
.L0023   ANOP                                                           26488000
*                                                                       26531000
*    *****************************************************************  26574000
*    *                                                               *  26617000
*    * IRASMF99.2077: SMF99 subtype 2 Period data section - Contains *  26660000
*    * information about the Service Periods that are part of the    *  26703000
*    * Service Class described in this record.                       *  26746000
*    * BASED(addr(smf_hdr_MAP) + smf992cpof)                         *  26789000
*    *                                                               *  26832000
*    *****************************************************************  26875000
*                                                                       26918000
*                                                                       26961000
         AIF   ('&SMF99_S2_PER_MAP' EQ 'NO').L0026                      27004000
         AIF   ('&DSECT' EQ 'YES').L0027                                27047000
         AIF   ('&SMF99_S2_PER_MAP' NE 'YES').L0026                     27090000
SMF99_S2_PER_MAP DS 0F                                                  27133000
         AGO   .L0028                                                   27176000
.L0027   ANOP                                                           27219000
SMF99_S2_PER_MAP DSECT                                                  27262000
.L0028   ANOP                                                           27305000
SMF99_PCNM DS  1CL0008   IRASMF99.560: Internal service class name      27348000
SMF99_PNUM DS  1FL2      IRASMF99.566: period number                    27391000
SMF99_PGOALTYP DS 1FL1   IRASMF99.159: goal type: 1 - short response   *27434000
                         time, 2 - long response time, 3 - velocity, 4 *27477000
                         - discretionary                                27520000
         DS    1FL1      IRASMF99.734: reserved                         27563000
SMF99_PGOALVAL DS 1FL4   IRASMF99.738: goal value: response time goal  *27606000
                         - goal in milliseconds, velocity - velocity,  *27649000
                         discretionary - zero                           27692000
SMF99_PIMPOR DS 1FL2     IRASMF99.744: importance                       27735000
SMF99_PBDP DS  1FL1      IRASMF99.163: base dispatching priority        27778000
         DS    1FL1      IRASMF99.169: reserved                         27821000
SMF99_PMPLI DS 1FL2      IRASMF99.175: MPL in-target                    27864000
SMF99_PMPLO DS 1FL2      IRASMF99.181: MPL out-target                   27907000
SMF99_PAMTA DS 1FL4      IRASMF99.187: Average Maximum MPL Target      *27950000
                         achieved                                       27993000
SMF99_PRUA DS  1FL4      IRASMF99.193: Ready user average               28036000
SMF99_PLRUA DS 1FL4      IRASMF99.2698: Long term Ready User Average   *28079000
                         times 16                                       28122000
SMF99_PPSPT DS 1FL4      IRASMF99.199: length of time swapped address  *28165000
                         spaces are protected in processor storage      28208000
SMF99_PPSITAR DS 1FL4    IRASMF99.455: storage isolation target for    *28251000
                         each address space in period, valid only for  *28294000
                         work with short response time goals, zero     *28337000
                         otherwise                                      28380000
SMF99_PESPOL DS 1FL1     IRASMF99.785: expanded storage access policy  *28423000
                         for demand pages - valid for periods with     *28466000
                         short resp time goals only                     28509000
SMF99_PESVIO DS 1FL1     IRASMF99.1031: expanded storage access policy *28552000
                         for VIO pages - valid for periods with short  *28595000
                         resp time goals only                           28638000
SMF99_PESHSP DS 1FL1     IRASMF99.1033: expanded storage access policy *28681000
                         for hiperspace pages - valid for periods with *28724000
                         short resp time goals only                     28767000
SMF99_PESSWAP DS 1FL1    IRASMF99.985: expanded storage access policy  *28810000
                         for swap pages - valid for periods with short *28853000
                         resp time goals only                           28896000
SMF99_PPROT DS 1FL2      IRASMF99.997: number of address spaces with   *28939000
                         demand pages protected in processor storage - *28982000
                         NA for periods with short resp time goals      29025000
SMF99_PLRU DS  1FL2      IRASMF99.1003: number of address spaces with  *29068000
                         demand pages subject to lru expanded storage  *29111000
                         policy - NA for periods with short resp time  *29154000
                         goals                                          29197000
SMF99_PSPAV DS 1FL2      IRASMF99.2675: number of address spaces with  *29240000
                         demand pages subject to space available       *29283000
                         expanded storage policy - NA for periods with *29326000
                         short resp time goals                          29369000
SMF99_PVIOL DS 1FL2      IRASMF99.1182: number of address spaces with  *29412000
                         VIO pages subject to lru expanded storage     *29455000
                         policy - NA for periods with short resp time  *29498000
                         goals                                          29541000
SMF99_PVIOS DS 1FL2      IRASMF99.2681: number of address spaces with  *29584000
                         VIO pages subject to space available expanded *29627000
                         storage policy - NA for periods with short    *29670000
                         resp time goals                                29713000
SMF99_PHSPL DS 1FL2      IRASMF99.1009: number of address spaces with  *29756000
                         hiperspace pages subject to lru expanded      *29799000
                         storage policy - NA for periods with short    *29842000
                         resp time goals                                29885000
SMF99_PHSPS DS 1FL2      IRASMF99.1015: number of address spaces with  *29928000
                         hiperspace pages subject to space available   *29971000
                         expanded storage policy - NA for periods with *30014000
                         short resp time goals                          30057000
SMF99_PESCS DS 1FL2      IRASMF99.5544: number of explicit storage     *30109990
                         critical classified address spaces             30119980
SMF99_PLPI DS  1FL4      IRASMF99.205: local performance index          30143000
SMF99_PSPI DS  1FL4      IRASMF99.211: sysplex performance index        30186000
SMF99_PSERV DS 1FL4      IRASMF99.217: service accumulated during      *30229000
                         interval                                       30272000
SMF99_PMDP DS  1FL4      IRASMF99.772: maximum percentage of processor *30315000
                         time demanded                                  30358000
SMF99_PLCPUU DS 1FL4     IRASMF99.452: CPU using samples during last   *30401000
                         interval                                       30444000
SMF99_PLCPUD DS 1FL4     IRASMF99.311: CPU delay samples during last   *30487000
                         interval                                       30530000
SMF99_PMTTWA DS 1FL4     IRASMF99.399: Mean time to wait adjusted       30573000
SMF99_PADP DS  1FL4      IRASMF99.778: working variable for achievable *30616000
                         demand percentage                              30659000
SMF99_PASERC DS 1FL4     IRASMF99.229: Average service consumed over   *30702000
                         window                                         30745000
SMF99_PPRSER DS 1FL4     IRASMF99.235: Projected service                30788000
SMF99_PIDLE DS 1FL4      IRASMF99.251: idle samples                     30831000
SMF99_POTHR DS 1FL4      IRASMF99.790: all other states                 30874000
SMF99_PCPUU DS 1FL4      IRASMF99.787: processor using samples          30917000
SMF99_PCPUD DS 1FL4      IRASMF99.975: processor delay samples          30960000
SMF99_PAUXP DS 1FL4      IRASMF99.981: primary private area paging     *31003000
                         delay aux                                      31046000
SMF99_PAUXC DS 1FL4      IRASMF99.132: Common area paging delay from   *31089000
                         aux                                            31132000
SMF99_PVIO DS  1FL4      IRASMF99.557: VIO delay from aux               31175000
SMF99_PHSS DS  1FL4      IRASMF99.1040: Scrolling hyperspace delay      31218000
SMF99_PHSC DS  1FL4      IRASMF99.1191: Cache hyperspace delay          31261000
SMF99_PASWP DS 1FL4      IRASMF99.953: Aux swap delay                   31304000
SMF99_PMPLD DS 1FL4      IRASMF99.2720: MPL Delay                       31347000
SMF99_PCAPD DS 1FL4      IRASMF99.420: CPU CAP delay                    31390000
SMF99_PXMO DS  1FL4      IRASMF99.258: Cross memory other delays        31433000
SMF99_PXMEM_OF DS 1FL4   IRASMF99.590: offset to cross memory delay    *31476000
                         samples from beginning of record (including   *31519000
                         RDW)                                           31562000
SMF99_PXMEM_LN DS 1FL2   IRASMF99.596: length of each cross memory     *31605000
                         delay entry                                    31648000
SMF99_PXMEM_ON DS 1FL2   IRASMF99.600: number of cross memory delay    *31691000
                         samples                                        31734000
SMF99_PSERV_OF DS 1FL4   IRASMF99.644: offset to server section from   *31777000
                         beginning of record (including RDW)            31820000
SMF99_PSERV_LN DS 1FL2   IRASMF99.650: length of each server entry      31863000
SMF99_PSERV_ON DS 1FL2   IRASMF99.656: number of server entries         31906000
SMF99_PESP_OF DS 1FL4    IRASMF99.614: offset to address space         *31949000
                         expanded storage access policies section from *31992000
                         beginning of record (including RDW)            32035000
SMF99_PESP_LN DS 1FL2    IRASMF99.620: length of each AS ESP entry      32078000
SMF99_PESP_ON DS 1FL2    IRASMF99.2407: number of AS ESP entries        32121000
SMF99_PCDCLOCK DS 1FL2   IRASMF99.628: policy adjustment count down    *32164000
                         clock, no policy action is taken until clock  *32207000
                         is zero                                        32250000
SMF99_PNH DS   1FL1      IRASMF99.632: period experienced processor    *32293000
                         access or storage delay during last policy    *32336000
                         adjustment interval                            32379000
SMF99_PRTP DS  1FL1      IRASMF99.3070: Response time goal percentile. *32389700
                         Zero if period does not have a percentile     *32400400
                         response time goal.                            32411100
SMF99_PAUXS DS 1FL4      IRASMF99.2216: shared storage paging samples  *32411300
                         from aux                                       32411500
SMF99_PIOU DS  1FL4      IRASMF99.2369: I/O using samples               32411700
SMF99_PIOD DS  1FL4      IRASMF99.1499: I/O delay samples               32411900
SMF99_PIO_MDP DS 1FL4    IRASMF99.3114: maximum percentage of time     *32412100
                         period could demand I/O. Percentage scaled by *32412300
                         10.                                            32412500
SMF99_PIODP DS 1FL1      IRASMF99.3127: I/O priority                    32412700
SMF99_FLAGS DS 0BL1      IRASMF99.5092: Flags                           32412850
SMF99_NEEDS_SYSPLEX_HELP EQU X'80' IRASMF99.5086: Period experienced   *32412900
                         some type of delay within the sysplex during  *32413000
                         last policy adjustment interval                32413100
SMF99_CPU_CRITICAL EQU X'40' IRASMF99.5526: Period is cpu critical      32413110
SMF99_STGCRIT_IMPLICIT EQU X'20' IRASMF99.5622: period belongs to a    *32413120
                         service class that was assigned storage       *32413130
                         protection (stg critical) in the active       *32413140
                         service policy. The service class was used in *32413150
                         subsystem type CICS or IMS and the rule       *32413160
                         specified storage critical = yes. Also on for *32413170
                         transactionserver DISPs serving protected     *32413180
                         service classes.                               32413190
         ORG   SMF99_FLAGS+X'00000001'                                  32413200
         DS    1CL0002   IRASMF99.3133: reserved                        32413300
SMF99_PDEVCL DS 1FL4     IRASMF99.3140: Identifier of device cluster   *32413400
                         period belongs to. This identifier can be     *32413500
                         used to associated the period with device     *32413600
                         cluster data in the subtype 4 record. Zero if *32413700
                         the period is not associated with a device    *32413900
                         cluster                                        32414100
SMF99_PSERVER_TYPE DS 0BL4 IRASMF99.1302: Server type. No bits will be *32414430
                         on if period is not a server                   32414500
SMF99_PTRANS_SERVER EQU X'80' IRASMF99.1298: Server is a transaction   *32414700
                         server                                         32414900
SMF99_PENCLAVE_SERVER EQU X'40' IRASMF99.1315: Server is a enclave     *32415100
                         server                                         32415300
SMF99_PQUEUE_SERVER EQU X'20' IRASMF99.1324: Server is a queue server   32415500
         ORG   SMF99_PSERVER_TYPE+X'00000004'                           32415700
SMF99_PSDATA_OF DS 1FL4  IRASMF99.1233: offset to server samples       *32415900
                         section from beginning of record (including   *32416100
                         RDW)                                           32416300
SMF99_PSDATA_LN DS 1FL2  IRASMF99.2351: length of each server samples  *32416500
                         entry                                          32416700
SMF99_PSDATA_ON DS 1FL2  IRASMF99.1497: number of server samples       *32416900
                         entries                                        32417100
SMF99_PQDATA_OF DS 1FL4  IRASMF99.2208: offset to queue server section *32417300
                         from beginning of record (including RDW)       32417500
SMF99_PQDATA_LN DS 1FL2  IRASMF99.3146: length of each queue server    *32417700
                         entry                                          32417900
SMF99_PQDATA_ON DS 1FL2  IRASMF99.3152: number of queue server entries  32418100
SMF99_PAVG_SIZE DS 1FL4  IRASMF99.1352: Average size in processor      *32418300
                         storage (frame count) of address spaces in    *32418500
                         the period. zero otherwise                     32418700
SMF99_PGRN DS  1CL0008   IRASMF99.3996: group name or blank if period  *32419800
                         doesn't belong to a group                      32420900
SMF99_PSYS_CPUU DS 1FL4  IRASMF99.4517: Sysplex wide CPU using samples  32421000
SMF99_PSYS_NONIDLE DS 1FL4 IRASMF99.4523: Sysplex wide non-idle        *32421100
                         samples                                        32421200
SMF99_PSYS_IDLE DS 1FL4  IRASMF99.4529: Sysplex wide idle samples       32424500
SMF99_PSYS_OTHER DS 1FL4 IRASMF99.4535: Sysplex wide other samples      32427800
SMF99_IOSUBSAMOF DS 1FL4 IRASMF99.5439: Offset to I/O subsystem        *32431100
                         samples data from beginning of record         *32434400
                         (including RDW)                                32437700
SMF99_IOSUBSAMLN DS 1FL2 IRASMF99.5472: Length of a I/O subsystem      *32441000
                         samples data section                           32444300
SMF99_IOSUBSAMON DS 1FL2 IRASMF99.5478: Number of I/O subsystem        *32447600
                         samples data sections                          32450900
SMF99_SPMDP DS 1FL4      IRASMF99.4127: Saved copy of maximum          *32454200
                         percentage of processor time demanded          32457500
         DS    1CL0008   IRASMF99.5818: Reserved for service            32458690
SMF99_SWCT DS  1FL4      IRASMF99.5825: Short wait count accumulator    32459100
         DS    1CL0002   IRASMF99.5831: Reserved                        32460290
SMF99_S2_PER_MAP_LEN EQU *-SMF99_S2_PER_MAP                             32460800
.L0026   ANOP                                                           32465000
*                                                                       32508000
*    *****************************************************************  32551000
*    *                                                               *  32594000
*    * IRASMF99.2093: SMF99 subtype 3 self defining section          *  32637000
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                           *  32680000
*    *                                                               *  32723000
*    *****************************************************************  32766000
*                                                                       32809000
*                                                                       32852000
         AIF   ('&SMF99_S3_SDEF_MAP' EQ 'NO').L0029                     32895000
         AIF   ('&DSECT' EQ 'YES').L002A                                32938000
         AIF   ('&SMF99_S3_SDEF_MAP' NE 'YES').L0029                    32981000
SMF99_S3_SDEF_MAP DS 0F                                                 33024000
         AGO   .L002B                                                   33067000
.L002A   ANOP                                                           33110000
SMF99_S3_SDEF_MAP DSECT                                                 33153000
.L002B   ANOP                                                           33196000
SMF993COF DS   1FL4      IRASMF99.2372: Offset to class information    *33239000
                         from beginning of record (including RDW)       33282000
SMF993CLN DS   1FL2      IRASMF99.2382: Length of class information     33325000
SMF993CON DS   1FL2      IRASMF99.2015: Number of class information     33368000
SMF993CPOF DS  1FL4      IRASMF99.2023: Offset to class period section *33411000
                         from beginning of record (including RDW)       33454000
SMF993CPLN DS  1FL2      IRASMF99.2888: Length of class period section  33497000
SMF993CPON DS  1FL2      IRASMF99.2894: Number of class period section  33540000
SMF99_S3_SDEF_MAP_LEN EQU *-SMF99_S3_SDEF_MAP                           33583000
.L0029   ANOP                                                           33626000
*                                                                       33669000
*    *****************************************************************  33712000
*    *                                                               *  33755000
*    * IRASMF99.2095: SMF99 subtype 3 class data section Contains    *  33798000
*    * information identifying the Service Class described in this   *  33841000
*    * record. BASED(addr(smf_hdr_MAP) + smf993cof)                  *  33884000
*    *                                                               *  33927000
*    *****************************************************************  33970000
*                                                                       34013000
*                                                                       34056000
         AIF   ('&SMF99_S3_CLS_MAP' EQ 'NO').L002C                      34099000
         AIF   ('&DSECT' EQ 'YES').L002D                                34142000
         AIF   ('&SMF99_S3_CLS_MAP' NE 'YES').L002C                     34185000
SMF99_S3_CLS_MAP DS 0X                                                  34228000
         AGO   .L002E                                                   34271000
.L002D   ANOP                                                           34314000
SMF99_S3_CLS_MAP DSECT                                                  34357000
.L002E   ANOP                                                           34400000
SMF99_PNAM DS  1CL0008   IRASMF99.971: service class name               34443000
SMF99_S3_CLS_MAP_LEN EQU *-SMF99_S3_CLS_MAP                             34486000
.L002C   ANOP                                                           34529000
*                                                                       34572000
*    *****************************************************************  34615000
*    *                                                               *  34658000
*    * IRASMF99.2101: SMF99 subtype 3 period self definition section *  34701000
*    * BASED(addr(smf_hdr_MAP) + smf993cpof)                         *  34744000
*    *                                                               *  34787000
*    *****************************************************************  34830000
*                                                                       34873000
*                                                                       34916000
         AIF   ('&SMF99_S3_PER_SDEF_MAP' EQ 'NO').L002F                 34959000
         AIF   ('&DSECT' EQ 'YES').L0030                                35002000
         AIF   ('&SMF99_S3_PER_SDEF_MAP' NE 'YES').L002F                35045000
SMF99_S3_PER_SDEF_MAP DS 0F                                             35088000
         AGO   .L0031                                                   35131000
.L0030   ANOP                                                           35174000
SMF99_S3_PER_SDEF_MAP DSECT                                             35217000
.L0031   ANOP                                                           35260000
SMF993_PRPOF DS 1FL4     IRASMF99.829: Offset to paging rate plot for  *35303000
                         this period from beginning of record          *35346000
                         (including RDW)                                35389000
SMF993_PRPLN DS 1FL2     IRASMF99.835: Length of paging rate plot       35432000
SMF993_PRPON DS 1FL2     IRASMF99.837: Number of paging rate plots      35475000
SMF993_MPLOF DS 1FL4     IRASMF99.843: Offset to MPL delay plots for   *35518000
                         this period from beginning of record          *35561000
                         (including RDW)                                35604000
SMF993_MPLLN DS 1FL2     IRASMF99.851: Length of MPL delay plots        35647000
SMF993_MPLON DS 1FL2     IRASMF99.855: Number of MPL delay plots        35690000
SMF993_RUAOF DS 1FL4     IRASMF99.873: Offset to ready user average    *35733000
                         plots for this period from beginning of       *35776000
                         record (including RDW)                         35819000
SMF993_RUALN DS 1FL2     IRASMF99.876: Length of ready user average    *35862000
                         plot                                           35905000
SMF993_RUAON DS 1FL2     IRASMF99.881: Number of ready user average    *35948000
                         plots                                          35991000
SMF993_SWPOF DS 1FL4     IRASMF99.887: Offset to swap delay plots for  *36034000
                         this period from beginning of record          *36077000
                         (including RDW)                                36120000
SMF993_SWPLN DS 1FL2     IRASMF99.893: Length of swap delay plot        36163000
SMF993_SWPON DS 1FL2     IRASMF99.905: Number of swap delay plots       36206000
SMF993_PASOF DS 1FL4     IRASMF99.911: Offset to proportional          *36249000
                         aggregate speed plots for this period from    *36292000
                         beginning of record (including RDW)            36335000
SMF993_PASLN DS 1FL2     IRASMF99.917: Length of proportional          *36378000
                         aggregate speed plot                           36421000
SMF993_PASON DS 1FL2     IRASMF99.925: Number of proportional          *36464000
                         aggregate speed plots                          36507000
SMF993_QMPLOF DS 1FL4    IRASMF99.3190: Offset to queue delay plots    *36510300
                         for this period from beginning of record      *36513600
                         (including RDW)                                36516900
SMF993_QMPLLN DS 1FL2    IRASMF99.3196: Length of queue delay plot      36520200
SMF993_QMPLON DS 1FL2    IRASMF99.3202: Number of queue delay plots     36523500
SMF993_QRUAOF DS 1FL4    IRASMF99.3208: Offset to queue ready user     *36526800
                         average for this period from beginning of     *36530100
                         record (including RDW)                         36533400
SMF993_QRUALN DS 1FL2    IRASMF99.3214: Length of queue ready user     *36536700
                         average plot                                   36540000
SMF993_QRUAON DS 1FL2    IRASMF99.3220: Number of queue ready user     *36543300
                         average plot                                   36546600
SMF993_INTERNAL_CLASS_NAME DS 1CL0008 IRASMF99.3548: Internal class    *36547000
                         name of the period. For non-discretionary     *36547400
                         periods this will be the same as the external *36547800
                         class name. For discretionary periods this    *36548200
                         will be of the form $SRMDIxx. For dynamic     *36548600
                         periods this will be of the form $SRMSxxx.     36549000
SMF993_QSTPOF DS 1FL4    IRASMF99.5758: offset to queue service time   *36549200
                         for this period from beginning of record      *36549400
                         (including RDW)                                36549600
SMF993_QSTPLN DS 1FL2    IRASMF99.5764: length of queue service time   *36549800
                         plot                                           36550000
SMF993_QSTPON DS 1FL2    IRASMF99.5770: number of queue service time   *36550200
                         plot                                           36550400
SMF993_AINSOF DS 1FL4    IRASMF99.4577: Offset to active server        *36551300
                         instance plot for this period from beginning  *36553600
                         of record (including RDW)                      36555900
SMF993_AINSLN DS 1FL2    IRASMF99.4583: length of active server        *36558200
                         instance plot                                  36560500
SMF993_AINSON DS 1FL2    IRASMF99.4589: Number of active server        *36562800
                         instance plot                                  36565100
SMF993_ASTROF DS 1FL4    IRASMF99.4595: Offset to virtual storage plot *36567400
                         for active server instances for this period   *36569700
                         from beginning of record (including RDW)       36572000
SMF993_ASTRLN DS 1FL2    IRASMF99.4601: Length of virtual storage plot  36574300
SMF993_ASTRON DS 1FL2    IRASMF99.4607: Number of virtual storage plot  36576600
SMF993_TSTROF DS 1FL4    IRASMF99.4613: Offset to virtual storage plot *36578900
                         for total server instances for this period    *36581200
                         from beginning of record (including RDW)       36583500
SMF993_TSTRLN DS 1FL2    IRASMF99.4619: Length of virtual storage plot  36585800
SMF993_TSTRON DS 1FL2    IRASMF99.4625: Number of virtual storage plot  36588100
SMF99_S3_PER_SDEF_MAP_LEN EQU *-SMF99_S3_PER_SDEF_MAP                   36590400
.L002F   ANOP                                                           36593000
*                                                                       36636000
*    *****************************************************************  36679000
*    *                                                               *  36722000
*    * IRASMF99.2107: SMF99 subtype 3 Period Paging Rate Plot section*  36765000
*    * - Contains paging rate information for the service period.    *  36808000
*    * BASED(addr(smf_hdr_MAP) + smf993_pprpof)                      *  36851000
*    *                                                               *  36894000
*    *****************************************************************  36937000
*                                                                       36980000
*                                                                       37023000
         AIF   ('&SMF99_S3_PPRP_MAP' EQ 'NO').L0032                     37066000
         AIF   ('&DSECT' EQ 'YES').L0033                                37109000
         AIF   ('&SMF99_S3_PPRP_MAP' NE 'YES').L0032                    37152000
SMF99_S3_PPRP_MAP DS 0F                                                 37195000
         AGO   .L0034                                                   37238000
.L0033   ANOP                                                           37281000
SMF99_S3_PPRP_MAP DSECT                                                 37324000
.L0034   ANOP                                                           37367000
SMF99_PPRP_PNUM DS 1FL4  SRMPLOT.6884: period number                    37410000
SMF99_PPRP_BW DS 1FL4    SRMPLOT.6769: Bucket width                     37453000
SMF99_PPRP_LSTX DS 1FL4  SRMPLOT.6907: Last plotted x bucket            37496000
         DS    1FL4      SRMPLOT.6913: Reserved                         37539000
SMF99_PPRP_POINTS_OF DS 1FL4 SRMPLOT.6249: Offset of point entries      37582000
SMF99_PPRP_POINTS_ON DS 1FL2 SRMPLOT.6474: Number of point entries      37625000
SMF99_PPRP_POINTS_LN DS 1FL2 SRMPLOT.7221: Length of a point entry      37668000
SMF99_S3_PPRP_MAP_LEN EQU *-SMF99_S3_PPRP_MAP                           37711000
.L0032   ANOP                                                           37754000
*                                                                       37797000
*    *****************************************************************  37840000
*    *                                                               *  37883000
*    * IRASMF99.2113: SMF99 subtype 3 MPL Delay Plot section -       *  37926000
*    * Contains MPL information for the service period.              *  37969000
*    * BASED(addr(smf_hdr_MAP) + smf993_mplof)                       *  38012000
*    *                                                               *  38055000
*    *****************************************************************  38098000
*                                                                       38141000
*                                                                       38184000
         AIF   ('&SMF99_S3_MPLP_MAP' EQ 'NO').L0035                     38227000
         AIF   ('&DSECT' EQ 'YES').L0036                                38270000
         AIF   ('&SMF99_S3_MPLP_MAP' NE 'YES').L0035                    38313000
SMF99_S3_MPLP_MAP DS 0F                                                 38356000
         AGO   .L0037                                                   38399000
.L0036   ANOP                                                           38442000
SMF99_S3_MPLP_MAP DSECT                                                 38485000
.L0037   ANOP                                                           38528000
SMF99_MPLP_PNUM DS 1FL4  SRMPLOT.6952: period number                    38571000
SMF99_MPLP_BW DS 1FL4    SRMPLOT.6958: Bucket width                     38614000
SMF99_MPLP_LSTX DS 1FL4  SRMPLOT.6964: Last plotted x bucket            38657000
         DS    1FL4      SRMPLOT.7495: Reserved                         38700000
SMF99_MPLP_POINTS_OF DS 1FL4 SRMPLOT.6297: Offset of point entries      38743000
SMF99_MPLP_POINTS_ON DS 1FL2 SRMPLOT.6291: Number of point entries      38786000
SMF99_MPLP_POINTS_LN DS 1FL2 SRMPLOT.6755: Length of a point entry      38829000
SMF99_S3_MPLP_MAP_LEN EQU *-SMF99_S3_MPLP_MAP                           38872000
.L0035   ANOP                                                           38915000
*                                                                       38958000
*    *****************************************************************  39001000
*    *                                                               *  39044000
*    * IRASMF99.2119: SMF99 subtype 3 Ready User Average Plot section*  39087000
*    * - Containsready user average information for the service      *  39130000
*    * period. BASED(addr(smf_hdr_MAP) + smf993_ruaof)               *  39173000
*    *                                                               *  39216000
*    *****************************************************************  39259000
*                                                                       39302000
*                                                                       39345000
         AIF   ('&SMF99_S3_RUAP_MAP' EQ 'NO').L0038                     39388000
         AIF   ('&DSECT' EQ 'YES').L0039                                39431000
         AIF   ('&SMF99_S3_RUAP_MAP' NE 'YES').L0038                    39474000
SMF99_S3_RUAP_MAP DS 0F                                                 39517000
         AGO   .L003A                                                   39560000
.L0039   ANOP                                                           39603000
SMF99_S3_RUAP_MAP DSECT                                                 39646000
.L003A   ANOP                                                           39689000
SMF99_RUAP_PNUM DS 1FL4  SRMPLOT.7141: period number                    39732000
SMF99_RUAP_BW DS 1FL4    SRMPLOT.7147: Bucket width                     39775000
SMF99_RUAP_LSTX DS 1FL4  SRMPLOT.7153: Last plotted x bucket            39818000
         DS    1FL4      SRMPLOT.7104: Reserved                         39861000
SMF99_RUAP_POINTS_OF DS 1FL4 SRMPLOT.6945: Offset of point entries      39904000
SMF99_RUAP_POINTS_ON DS 1FL2 SRMPLOT.6951: Number of point entries      39947000
SMF99_RUAP_POINTS_LN DS 1FL2 SRMPLOT.6987: Length of a point entry      39990000
SMF99_S3_RUAP_MAP_LEN EQU *-SMF99_S3_RUAP_MAP                           40033000
.L0038   ANOP                                                           40076000
*                                                                       40119000
*    *****************************************************************  40162000
*    *                                                               *  40205000
*    * IRASMF99.2715: SMF99 subtype 3 Swap Delay Plot section -      *  40248000
*    * Contains information about delays caused by adderess spaces in*  40291000
*    * the service period being swapped out. BASED(addr(smf_hdr_MAP) *  40334000
*    * + smf993_swpof)                                               *  40377000
*    *                                                               *  40420000
*    *****************************************************************  40463000
*                                                                       40506000
*                                                                       40549000
         AIF   ('&SMF99_S3_SWPP_MAP' EQ 'NO').L003B                     40592000
         AIF   ('&DSECT' EQ 'YES').L003C                                40635000
         AIF   ('&SMF99_S3_SWPP_MAP' NE 'YES').L003B                    40678000
SMF99_S3_SWPP_MAP DS 0F                                                 40721000
         AGO   .L003D                                                   40764000
.L003C   ANOP                                                           40807000
SMF99_S3_SWPP_MAP DSECT                                                 40850000
.L003D   ANOP                                                           40893000
SMF99_SWPP_PNUM DS 1FL4  SRMPLOT.7015: period number                    40936000
SMF99_SWPP_BW DS 1FL4    SRMPLOT.7021: Bucket width                     40979000
SMF99_SWPP_LSTX DS 1FL4  SRMPLOT.7027: Last plotted x bucket            41022000
         DS    1FL4      SRMPLOT.6978: Reserved                         41065000
SMF99_SWPP_POINTS_OF DS 1FL4 SRMPLOT.6746: Offset of point entries      41108000
SMF99_SWPP_POINTS_ON DS 1FL2 SRMPLOT.6700: Number of point entries      41151000
SMF99_SWPP_POINTS_LN DS 1FL2 SRMPLOT.6711: Length of a point entry      41194000
SMF99_S3_SWPP_MAP_LEN EQU *-SMF99_S3_SWPP_MAP                           41237000
.L003B   ANOP                                                           41280000
*                                                                       41323000
*    *****************************************************************  41366000
*    *                                                               *  41409000
*    * IRASMF99.2129: SMF99 subtype 3 Proportional Aggregate Speed   *  41452000
*    * Plot section. BASED(addr(smf_hdr_MAP) + smf993_pasof)         *  41495000
*    *                                                               *  41538000
*    *****************************************************************  41581000
*                                                                       41624000
*                                                                       41667000
         AIF   ('&SMF99_S3_PASP_MAP' EQ 'NO').L003E                     41710000
         AIF   ('&DSECT' EQ 'YES').L003F                                41753000
         AIF   ('&SMF99_S3_PASP_MAP' NE 'YES').L003E                    41796000
SMF99_S3_PASP_MAP DS 0F                                                 41839000
         AGO   .L0040                                                   41882000
.L003F   ANOP                                                           41925000
SMF99_S3_PASP_MAP DSECT                                                 41968000
.L0040   ANOP                                                           42011000
SMF99_PASP_PNUM DS 1FL4  SRMPLOT.7078: period number                    42054000
SMF99_PASP_BW DS 1FL4    SRMPLOT.7084: Bucket width                     42097000
SMF99_PASP_LSTX DS 1FL4  SRMPLOT.7090: Last plotted x bucket            42140000
         DS    1FL4      SRMPLOT.7041: Reserved                         42183000
SMF99_PASP_POINTS_OF DS 1FL4 SRMPLOT.6788: Offset of point entries      42226000
SMF99_PASP_POINTS_ON DS 1FL2 SRMPLOT.6924: Number of point entries      42269000
SMF99_PASP_POINTS_LN DS 1FL2 SRMPLOT.6933: Length of a point entry      42312000
SMF99_S3_PASP_MAP_LEN EQU *-SMF99_S3_PASP_MAP                           42355000
.L003E   ANOP                                                           42355500
*                                                                       42356000
*    *****************************************************************  42356500
*    *                                                               *  42357000
*    * IRASMF99.3229: SMF99 subtype 3 Queue Delay Plot section.      *  42357500
*    * BASED(addr(smf_hdr_MAP) + smf993_qmplof)                      *  42358000
*    *                                                               *  42358500
*    *****************************************************************  42359000
*                                                                       42359500
*                                                                       42360000
         AIF   ('&SMF99_S3_QMPLP_MAP' EQ 'NO').L0041                    42360500
         AIF   ('&DSECT' EQ 'YES').L0042                                42361000
         AIF   ('&SMF99_S3_QMPLP_MAP' NE 'YES').L0041                   42361500
SMF99_S3_QMPLP_MAP DS 0F                                                42362000
         AGO   .L0043                                                   42362500
.L0042   ANOP                                                           42363000
SMF99_S3_QMPLP_MAP DSECT                                                42363500
.L0043   ANOP                                                           42364000
SMF99_QMPLP_PNUM DS 1FL4 SRMPLOT.10471: period number                   42364500
SMF99_QMPLP_DISP_CLASS_NAME DS 1CL0008 SRMPLOT.10667: Class name of    *42365000
                         DISP where server address spaces are running   42365500
SMF99_QMPLP_BW DS 1FL4   SRMPLOT.10201: Bucket width                    42366000
SMF99_QMPLP_LSTX DS 1FL4 SRMPLOT.9807: Last plotted x bucket            42366500
         DS    1FL4      SRMPLOT.10134: Reserved                        42367000
SMF99_QMPLP_POINTS_OF DS 1FL4 SRMPLOT.10105: Offset of point entries    42367500
SMF99_QMPLP_POINTS_ON DS 1FL2 SRMPLOT.10573: Number of point entries    42368000
SMF99_QMPLP_POINTS_LN DS 1FL2 SRMPLOT.9835: Length of a point entry     42368500
SMF99_QMPLP_Q_TYPE DS 0BL1 SRMPLOT.11566: Type byte                     42368650
SMF99_QMPLP_QUEUE_MANAGER EQU X'80' SRMPLOT.11572: queue manager type  *42368700
                         work queue                                     42368800
SMF99_QMPLP_BATCH EQU X'40' SRMPLOT.11578: Batch type work queue        42368900
         ORG   SMF99_QMPLP_Q_TYPE+X'00000001'                           42369000
         DS    1CL0003   SRMPLOT.11627: reserved                        42369100
SMF99_QMPLP_SUBSYS_TYPE DS 1CL0004 SRMPLOT.11555: Subsystem type of    *42369200
                         owner of the queue. Only applies to batch     *42369300
                         queue servers.                                 42369400
SMF99_QMPLP_SUBSYS_NAME DS 1CL0008 SRMPLOT.11562: Subsystem name of    *42369500
                         owner of the queue. Only applies to batch     *42369600
                         queue servers.                                 42369700
SMF99_S3_QMPLP_MAP_LEN EQU *-SMF99_S3_QMPLP_MAP                         42369800
.L0041   ANOP                                                           42369900
*                                                                       42370000
*    *****************************************************************  42370500
*    *                                                               *  42371000
*    * IRASMF99.3235: SMF99 subtype 3 Queue Ready User Avg Plot      *  42371500
*    * section. BASED(addr(smf_hdr_MAP) + smf993_qruaof)             *  42372000
*    *                                                               *  42372500
*    *****************************************************************  42373000
*                                                                       42373500
*                                                                       42374000
         AIF   ('&SMF99_S3_QRUAP_MAP' EQ 'NO').L0044                    42374500
         AIF   ('&DSECT' EQ 'YES').L0045                                42375000
         AIF   ('&SMF99_S3_QRUAP_MAP' NE 'YES').L0044                   42375500
SMF99_S3_QRUAP_MAP DS 0F                                                42376000
         AGO   .L0046                                                   42376500
.L0045   ANOP                                                           42377000
SMF99_S3_QRUAP_MAP DSECT                                                42377500
.L0046   ANOP                                                           42378000
SMF99_QRUAP_PNUM DS 1FL4 SRMPLOT.9938: period number                    42378500
SMF99_QRUAP_DISP_CLASS_NAME DS 1CL0008 SRMPLOT.9863: Class name of     *42379000
                         DISP where server address spaces are running   42379500
SMF99_QRUAP_BW DS 1FL4   SRMPLOT.9950: Bucket width                     42380000
SMF99_QRUAP_LSTX DS 1FL4 SRMPLOT.10723: Last plotted x bucket           42380500
         DS    1FL4      SRMPLOT.10727: Reserved                        42381000
SMF99_QRUAP_POINTS_OF DS 1FL4 SRMPLOT.9935: Offset of point entries     42381500
SMF99_QRUAP_POINTS_ON DS 1FL2 SRMPLOT.10626: Number of point entries    42382000
SMF99_QRUAP_POINTS_LN DS 1FL2 SRMPLOT.10621: Length of a point entry    42382500
SMF99_S3_QRUAP_MAP_LEN EQU *-SMF99_S3_QRUAP_MAP                         42383000
.L0044   ANOP                                                           42383500
*                                                                       42384000
*    *****************************************************************  42384500
*    *                                                               *  42385000
*    * IRASMF99.4559: SMF99 subtype 3 Active Server Instances Plot   *  42385500
*    * section. BASED(addr(smf_hdr_MAP) + smf993_ainsof)                42386000
*    *                                                               *  42386500
*    *****************************************************************  42387000
*                                                                       42387500
*                                                                       42388000
         AIF   ('&SMF99_S3_AINS_MAP' EQ 'NO').L0047                     42388500
         AIF   ('&DSECT' EQ 'YES').L0048                                42389000
         AIF   ('&SMF99_S3_AINS_MAP' NE 'YES').L0047                    42389500
SMF99_S3_AINS_MAP DS 0F                                                 42390000
         AGO   .L0049                                                   42390500
.L0048   ANOP                                                           42391000
SMF99_S3_AINS_MAP DSECT                                                 42391500
.L0049   ANOP                                                           42392000
SMF99_AINS_PNUM DS 1FL4  SRMPLOT.8086: period number                    42392100
SMF99_AINS_BW DS 1FL4    SRMPLOT.8088: Bucket width                     42392200
SMF99_AINS_LSTX DS 1FL4  SRMPLOT.8090: Last plotted x bucket            42392300
         DS    1FL4      SRMPLOT.8094: Reserved                         42392400
SMF99_AINS_POINTS_OF DS 1FL4 SRMPLOT.8070: Offset of point entries      42392500
SMF99_AINS_POINTS_ON DS 1FL2 SRMPLOT.8104: Number of point entries      42392600
SMF99_AINS_POINTS_LN DS 1FL2 SRMPLOT.8072: Length of a point entry      42392700
SMF99_S3_AINS_MAP_LEN EQU *-SMF99_S3_AINS_MAP                           42392800
.L0047   ANOP                                                           42392900
*                                                                       42393000
*    *****************************************************************  42393100
*    *                                                               *  42393200
*    * IRASMF99.4565: SMF99 subtype 3 VS Plot for active server      *  42393300
*    * instances. BASED(addr(smf_hdr_MAP) + smf993_astrof)              42393400
*    *                                                               *  42393500
*    *****************************************************************  42393600
*                                                                       42393700
*                                                                       42393800
         AIF   ('&SMF99_S3_ASTR_MAP' EQ 'NO').L004A                     42393900
         AIF   ('&DSECT' EQ 'YES').L004B                                42394000
         AIF   ('&SMF99_S3_ASTR_MAP' NE 'YES').L004A                    42394100
SMF99_S3_ASTR_MAP DS 0F                                                 42394200
         AGO   .L004C                                                   42394300
.L004B   ANOP                                                           42394400
SMF99_S3_ASTR_MAP DSECT                                                 42394500
.L004C   ANOP                                                           42394600
SMF99_ASTR_PNUM DS 1FL4  SRMPLOT.1744: period number                    42394700
SMF99_ASTR_BW DS 1FL4    SRMPLOT.1175: Bucket width                     42394800
SMF99_ASTR_LSTX DS 1FL4  SRMPLOT.1953: Last plotted x bucket            42394900
         DS    1FL4      SRMPLOT.3873: Reserved                         42395000
SMF99_ASTR_POINTS_OF DS 1FL4 SRMPLOT.2189: Offset of point entries      42395100
SMF99_ASTR_POINTS_ON DS 1FL2 SRMPLOT.4036: Number of point entries      42395200
SMF99_ASTR_POINTS_LN DS 1FL2 SRMPLOT.4045: Length of a point entry      42395300
SMF99_ASTR_C_USED DS 0BL1 SRMPLOT.4048: Plot Curve used                 42395450
SMF99_ASTR_C_BEL16MB_USED EQU X'80' SRMPLOT.562: VS curve below 16MB   *42395500
                         was used last time server instances have been *42395600
                         adjusted                                       42395700
SMF99_ASTR_C_ABV16MB_USED EQU X'40' SRMPLOT.2454: VS curve above 16MB  *42395800
                         was used last time server instances have been *42395900
                         adjusted                                       42396000
         ORG   SMF99_ASTR_C_USED+X'00000001'                            42396100
         DS    1CL0003   SRMPLOT.2442: reserved                         42396200
SMF99_S3_ASTR_MAP_LEN EQU *-SMF99_S3_ASTR_MAP                           42396300
.L004A   ANOP                                                           42396400
*                                                                       42396500
*    *****************************************************************  42396600
*    *                                                               *  42396700
*    * IRASMF99.4571: SMF99 subtype 3 VS plot for total server       *  42396800
*    * instances. BASED(addr(smf_hdr_MAP) + smf993_tstrof)              42396900
*    *                                                               *  42397000
*    *****************************************************************  42397100
*                                                                       42397200
*                                                                       42397300
         AIF   ('&SMF99_S3_TSTR_MAP' EQ 'NO').L004D                     42397400
         AIF   ('&DSECT' EQ 'YES').L004E                                42397500
         AIF   ('&SMF99_S3_TSTR_MAP' NE 'YES').L004D                    42397600
SMF99_S3_TSTR_MAP DS 0F                                                 42397700
         AGO   .L004F                                                   42397800
.L004E   ANOP                                                           42397900
SMF99_S3_TSTR_MAP DSECT                                                 42398000
.L004F   ANOP                                                           42398100
SMF99_TSTR_PNUM DS 1FL4  SRMPLOT.1235: period number                    42398200
SMF99_TSTR_BW DS 1FL4    SRMPLOT.1993: Bucket width                     42398300
SMF99_TSTR_LSTX DS 1FL4  SRMPLOT.1956: Last plotted x bucket            42398400
         DS    1FL4      SRMPLOT.841: Reserved                          42398500
SMF99_TSTR_POINTS_OF DS 1FL4 SRMPLOT.774: Offset of point entries       42398600
SMF99_TSTR_POINTS_ON DS 1FL2 SRMPLOT.597: Number of point entries       42398700
SMF99_TSTR_POINTS_LN DS 1FL2 SRMPLOT.675: Length of a point entry       42398800
SMF99_TSTR_C_USED DS 0BL1 SRMPLOT.1714: Plot Curve used                 42398950
SMF99_TSTR_C_BEL16MB_USED EQU X'80' SRMPLOT.1264: VS curve below 16MB  *42399000
                         was used last time server instances have been *42399100
                         adjusted                                       42399200
SMF99_TSTR_C_ABV16MB_USED EQU X'40' SRMPLOT.1196: VS curve above 16MB  *42399300
                         was used last time server instances have been *42399400
                         adjusted                                       42399500
         ORG   SMF99_TSTR_C_USED+X'00000001'                            42399600
         DS    1CL0003   SRMPLOT.554: reserved                          42399700
SMF99_S3_TSTR_MAP_LEN EQU *-SMF99_S3_TSTR_MAP                           42399800
.L004D   ANOP                                                           42399900
*                                                                       42400000
*    *****************************************************************  42400100
*    *                                                               *  42400200
*    * IRASMF99.5812: SMF99 subtype 3 Queue service time Plot        *  42400360
*    * section. BASED(addr(smf_hdr_MAP) + smf993_qstpof)                42400400
*    *                                                               *  42400500
*    *****************************************************************  42400600
*                                                                       42400700
*                                                                       42400800
         AIF   ('&SMF99_S3_QSTPP_MAP' EQ 'NO').L0050                    42400940
         AIF   ('&DSECT' EQ 'YES').L0051                                42401000
         AIF   ('&SMF99_S3_QSTPP_MAP' NE 'YES').L0050                   42401150
SMF99_S3_QSTPP_MAP DS 0F                                                42401200
         AGO   .L0052                                                   42401300
.L0051   ANOP                                                           42401400
SMF99_S3_QSTPP_MAP DSECT                                                42401540
.L0052   ANOP                                                           42401600
SMF99_QSTP_PNUM DS 1FL4  SRMPLOT.5552: period number                    42401603
SMF99_QSTP_DISP_CLASS_NAME DS 1CL0008 SRMPLOT.5551: Class name of DISP *42401606
                         where server address spaces are running        42401609
SMF99_QSTP_BW DS 1FL4    SRMPLOT.2175: Bucket width                     42401612
SMF99_QSTP_LSTX DS 1FL4  SRMPLOT.711: Last plotted x bucket             42401615
         DS    1FL4      SRMPLOT.4275: Reserved                         42401618
SMF99_QSTP_POINTS_OF DS 1FL4 SRMPLOT.4277: Offset of point entries      42401621
SMF99_QSTP_POINTS_ON DS 1FL2 SRMPLOT.1430: Number of point entries      42401624
SMF99_QSTP_POINTS_LN DS 1FL2 SRMPLOT.3890: Length of a point entry      42401627
SMF99_S3_QSTPP_MAP_LEN EQU *-SMF99_S3_QSTPP_MAP                         42401630
.L0050   ANOP                                                           42401633
*                                                                       42401636
*    *****************************************************************  42401639
*    *                                                               *  42401642
*    * IRASMF99.2137: SMF99 subtype 4 self defining section          *  42401645
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                              42401648
*    *                                                               *  42401651
*    *****************************************************************  42401654
*                                                                       42401657
*                                                                       42401660
         AIF   ('&SMF99_S4_SDEF_MAP' EQ 'NO').L0053                     42401663
         AIF   ('&DSECT' EQ 'YES').L0054                                42401666
         AIF   ('&SMF99_S4_SDEF_MAP' NE 'YES').L0053                    42401669
SMF99_S4_SDEF_MAP DS 0F                                                 42401672
         AGO   .L0055                                                   42401675
.L0054   ANOP                                                           42401678
SMF99_S4_SDEF_MAP DSECT                                                 42401681
.L0055   ANOP                                                           42401684
SMF994DEVCLID DS 1FL4    IRASMF99.1195: Identifier of device cluster.  *42401700
                         Used to associate a device cluster with the   *42401800
                         periods in a device cluster through the       *42401900
                         device cluster identifier field in the        *42402000
                         subtype 2 (SMF99_PDEVCL)                       42402100
SMF994IOPTOF DS 1FL4     IRASMF99.934: Offset to I/O priority table    *42402200
                         information from beginning of record          *42402300
                         (including RDW)                                42402400
SMF994IOPTLN DS 1FL2     IRASMF99.940: Length of I/O priority          *42402500
                         information                                    42402600
SMF994IOPTON DS 1FL2     IRASMF99.435: Number of priority table        *42402700
                         sections                                       42402800
SMF994IOPLTOF DS 1FL4    IRASMF99.439: Offset to the I/O plot section  *42402900
                         from beginning of record (including RDW)       42403000
SMF994IOPLTLN DS 1FL2    IRASMF99.445: Length of I/O plot section       42403100
SMF994IOPLTON DS 1FL2    IRASMF99.1055: Number of I/O plot sections     42403200
SMF99_S4_SDEF_MAP_LEN EQU *-SMF99_S4_SDEF_MAP                           42403300
.L0053   ANOP                                                           42403440
*                                                                       42403500
*    *****************************************************************  42403600
*    *                                                               *  42403700
*    * IRASMF99.2143: SMF99 subtype 4device cluster priority table   *  42403800
*    * section - Contains information about priorities being used in *  42403900
*    * the device cluster BASED(addr(smf_hdr_MAP) + smf994ioptof)    *  42404000
*    *                                                                  42404500
*    *                                                               *  42405000
*    *****************************************************************  42405500
*                                                                       42406000
*                                                                       42406500
         AIF   ('&SMF99_S4_IOPDT_MAP' EQ 'NO').L0056                    42407290
         AIF   ('&DSECT' EQ 'YES').L0057                                42407580
         AIF   ('&SMF99_S4_IOPDT_MAP' NE 'YES').L0056                   42407870
SMF99_S4_IOPDT_MAP DS 0F                                                42408500
         AGO   .L0058                                                   42409290
.L0057   ANOP                                                           42409580
SMF99_S4_IOPDT_MAP DSECT                                                42410000
.L0058   ANOP                                                           42410690
SMF99_IPTPRTY DS 1FL2    IRASMF99.1069: I/O priority                    42411000
SMF99_IPTNP DS 1FL2      IRASMF99.1075: New I/O priority (zero if not  *42411500
                         changed)                                       42412000
SMF99_IPTIMDP DS 1FL4    IRASMF99.1081: initial maximum percentage of  *42412500
                         time work at priority demand I/O, initial     *42413000
                         value before any priority moves. Percentage   *42413500
                         scaled by 10                                   42414000
SMF99_IPTPMDP DS 1FL4    IRASMF99.1086: projected maximum percentage   *42414500
                         of I/O time demanded at priority               42415000
SMF99_IPTW2UR DS 1FL4    IRASMF99.1109: wait-to-using ratio at         *42415500
                         priority (*16)                                 42416000
SMF99_IPTIMAXD DS 1FL4   IRASMF99.1135: initial cumulative maximum     *42416500
                         demand/ Percentage scaled by 10.               42417000
SMF99_IPTWMAXD DS 1FL4   IRASMF99.1141: Projected cumulative maximum   *42417500
                         demand Percentage scaled by 10.                42418000
SMF99_S4_IOPDT_MAP_LEN EQU *-SMF99_S4_IOPDT_MAP                         42418500
.L0056   ANOP                                                           42419190
*                                                                       42419500
*    *****************************************************************  42420000
*    *                                                               *  42420500
*    * IRASMF99.1308: SMF99 subtype 4 I/O plot information - Contains*  42421000
*    * the information plotted on the device clusters I/O plot       *  42421500
*    * BASED(addr(smf_hdr_MAP) + smf99iopltof)                          42422000
*    *                                                               *  42422500
*    *****************************************************************  42423000
*                                                                       42423500
*                                                                       42424000
         AIF   ('&SMF99_S4_IO_PLOT_MAP' EQ 'NO').L0059                  42424790
         AIF   ('&DSECT' EQ 'YES').L005A                                42425080
         AIF   ('&SMF99_S4_IO_PLOT_MAP' NE 'YES').L0059                 42425370
SMF99_S4_IO_PLOT_MAP DS 0F                                              42426000
         AGO   .L005B                                                   42426790
.L005A   ANOP                                                           42427080
SMF99_S4_IO_PLOT_MAP DSECT                                              42427500
.L005B   ANOP                                                           42428190
SMF99_IO_PLOT_BW DS 1FL4 SRMPLOT.9572: Bucket width                     42428500
SMF99_IO_PLOT_LSTX DS 1FL4 SRMPLOT.9578: Last plotted x bucket          42429000
         DS    1FL4      SRMPLOT.9589: Reserved                         42429500
SMF99_IO_PLOT_POINTS_OF DS 1FL4 SRMPLOT.9595: Offset of point entries   42430000
SMF99_IO_PLOT_POINTS_ON DS 1FL2 SRMPLOT.9601: Number of point entries   42430500
SMF99_IO_PLOT_POINTS_LN DS 1FL2 SRMPLOT.9607: Length of a point entry   42431000
SMF99_S4_IO_PLOT_MAP_LEN EQU *-SMF99_S4_IO_PLOT_MAP                     42431500
.L0059   ANOP                                                           42438190
*                                                                       42441000
*    *****************************************************************  42484000
*    *                                                               *  42527000
*    * IRASMF99.2161: SMF99 subtype 5 Monitored AS information       *  42570000
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                           *  42613000
*    *                                                               *  42656000
*    *****************************************************************  42699000
*                                                                       42742000
*                                                                       42785000
         AIF   ('&SMF99_S5_MON_MAP' EQ 'NO').L005C                      42857990
         AIF   ('&DSECT' EQ 'YES').L005D                                42887980
         AIF   ('&SMF99_S5_MON_MAP' NE 'YES').L005C                     42917970
SMF99_S5_MON_MAP DS 0F                                                  42957000
         AGO   .L005E                                                   43019990
.L005D   ANOP                                                           43039980
SMF99_S5_MON_MAP DSECT                                                  43086000
.L005E   ANOP                                                           43148990
SMF99ANAM DS   1CL0008   IRASMF99.2021: jobname                         43172000
SMF99ACNM DS   1CL0008   IRASMF99.2034: Class that space is in          43215000
SMF99APNUM DS  1FL4      IRASMF99.2042: Period number that space is in  43258000
SMF99APCS DS   1FL4      IRASMF99.2813: Protective central stor tar     43301000
SMF99ARCS DS   1FL4      IRASMF99.2819: restrictive central stor tar    43344000
SMF99APPS DS   1FL4      IRASMF99.2825: protective proc stor tar        43387000
SMF99ARPS DS   1FL4      IRASMF99.1437: restrictive proc stor tar       43430000
SMF99CPLT DS   1CL0020   IRASMF99.2837: central storage plot            43473000
SMF99PPLT DS   1CL0020   IRASMF99.2843: proc storage plot               43516000
SMF99ASID DS   1BL2      IRASMF99.1509: Address Space ID number         43537500
SMF99A_EXTERNAL_CLASS_NAME DS 1CL0008 IRASMF99.3555: The name of the   *43542800
                         external class the address space is           *43548100
                         associated with                                43553400
SMF99_S5_FLAGS DS 0BL1   IRASMF99.5537: Flags                           43553790
SMF99_S5_STG_PROTECTED_NOW EQU X'80' IRASMF99.5718: Storage is         *43554000
                         protected at this instant                      43554200
SMF99_S5_STGCRIT_EXPLICIT EQU X'40' IRASMF99.5724: Storage protected   *43554400
                         assigned to space by classification rule       43554600
SMF99_CTAR_SET_BY_STCR_HSK EQU X'20' IRASMF99.5650: Indicates, that    *43554800
                         storage critical housekeeping was the last    *43555000
                         who has set the storage target for central    *43555200
                         storage                                        43555400
SMF99_PTAR_SET_BY_STCR_HSK EQU X'10' IRASMF99.5656: Indicates, that    *43555600
                         storage critical housekeeping was the last    *43555800
                         who has set the storage target for processor  *43556000
                         storage                                        43556200
SMF99_CTAR_SET_BY_PA EQU X'08' IRASMF99.5662: Indicates, that policy   *43556400
                         adjustment was the last who has set the       *43556600
                         storage target for central storage             43556800
SMF99_PTAR_SET_BY_PA EQU X'04' IRASMF99.5668: Indicates, that policy   *43557000
                         adjustmnet was the last who has set the       *43557200
                         storage target for processor storage           43557400
         ORG   SMF99_S5_FLAGS+X'00000001'                               43557600
         DS    1CL0003   IRASMF99.5674: reserved                        43557800
SMF99_S5_MON_MAP_LEN EQU *-SMF99_S5_MON_MAP                             43559000
.L005C   ANOP                                                           43621990
*                                                                       43645000
*    *****************************************************************  43688000
*    *                                                               *  43731000
*    * IRASMF99.2167: SMF99 subtype 5 PPLT plot data - Contains      *  43774000
*    * information plotted on the Processor storage paging plot for  *  43817000
*    * the monitored address space in this record.                   *  43860000
*    *                                                               *  43903000
*    *****************************************************************  43946000
*                                                                       43989000
*                                                                       44032000
         AIF   ('&SMF99_S5_PPLT_MAP' EQ 'NO').L005F                     44104990
         AIF   ('&DSECT' EQ 'YES').L0060                                44134980
         AIF   ('&SMF99_S5_PPLT_MAP' NE 'YES').L005F                    44164970
SMF99_S5_PPLT_MAP DS 0F                                                 44204000
         AGO   .L0061                                                   44266990
.L0060   ANOP                                                           44286980
SMF99_S5_PPLT_MAP DSECT                                                 44333000
.L0061   ANOP                                                           44395990
SMF99_PPLT_BW DS 1FL4    SRMPLOT.6657: Bucket width                     44419000
SMF99_PPLT_LSTX DS 1FL4  SRMPLOT.6301: Last plotted x bucket            44462000
         DS    1FL4      SRMPLOT.6248: Reserved                         44505000
SMF99_PPLT_POINTS_OF DS 1FL4 SRMPLOT.6793: Offset of point entries      44548000
SMF99_PPLT_POINTS_ON DS 1FL2 SRMPLOT.6831: Number of point entries      44591000
SMF99_PPLT_POINTS_LN DS 1FL2 SRMPLOT.6840: Length of a point entry      44634000
SMF99_S5_PPLT_MAP_LEN EQU *-SMF99_S5_PPLT_MAP                           44677000
.L005F   ANOP                                                           44739990
*                                                                       44763000
*    *****************************************************************  44806000
*    *                                                               *  44849000
*    * IRASMF99.2173: SMF99 subtype 5 CPLT plot data - Contains      *  44892000
*    * information plotted on the Processor storage paging plot for  *  44935000
*    * the monitored address space in this record.                   *  44978000
*    *                                                               *  45021000
*    *****************************************************************  45064000
*                                                                       45107000
*                                                                       45150000
         AIF   ('&SMF99_S5_CPLT_MAP' EQ 'NO').L0062                     45222990
         AIF   ('&DSECT' EQ 'YES').L0063                                45252980
         AIF   ('&SMF99_S5_CPLT_MAP' NE 'YES').L0062                    45282970
SMF99_S5_CPLT_MAP DS 0F                                                 45322000
         AGO   .L0064                                                   45384990
.L0063   ANOP                                                           45404980
SMF99_S5_CPLT_MAP DSECT                                                 45451000
.L0064   ANOP                                                           45513990
SMF99_CPLT_BW DS 1FL4    SRMPLOT.7288: Bucket width                     45537000
SMF99_CPLT_LSTX DS 1FL4  SRMPLOT.7294: Last plotted x bucket            45580000
         DS    1FL4      SRMPLOT.7300: Reserved                         45623000
SMF99_CPLT_POINTS_OF DS 1FL4 SRMPLOT.6740: Offset of point entries      45666000
SMF99_CPLT_POINTS_ON DS 1FL2 SRMPLOT.6502: Number of point entries      45709000
SMF99_CPLT_POINTS_LN DS 1FL2 SRMPLOT.6499: Length of a point entry      45752000
SMF99_S5_CPLT_MAP_LEN EQU *-SMF99_S5_CPLT_MAP                           45795000
.L0062   ANOP                                                           45857990
*                                                                       45881000
*    *****************************************************************  45924000
*    *                                                               *  45967000
*    * IRASMF99.3782: SMF99 subtype 6 self defining section          *  45967400
*    * BASED(addr(smf_hdr_MAP) + smf99dof)                           *  45967800
*    *                                                               *  45968200
*    *****************************************************************  45968600
*                                                                       45969000
*                                                                       45969400
         AIF   ('&SMF99_S6_SDEF_MAP' EQ 'NO').L0065                     45970090
         AIF   ('&DSECT' EQ 'YES').L0066                                45970380
         AIF   ('&SMF99_S6_SDEF_MAP' NE 'YES').L0065                    45970670
SMF99_S6_SDEF_MAP DS 0F                                                 45971000
         AGO   .L0067                                                   45971590
.L0066   ANOP                                                           45971780
SMF99_S6_SDEF_MAP DSECT                                                 45972200
.L0067   ANOP                                                           45972790
SMF996CPOF DS  1FL4      IRASMF99.3638: Offset to service class period *45973000
                         section from beginning of record (including   *45973400
                         RDW)                                           45973800
SMF996CPLN DS  1FL2      IRASMF99.3644: Length of a service class      *45974200
                         period section                                 45974600
SMF996CPON DS  1FL2      IRASMF99.3650: Number of service class period *45975000
                         sections                                       45975400
SMF99_S6_SDEF_MAP_LEN EQU *-SMF99_S6_SDEF_MAP                           45975800
.L0065   ANOP                                                           45976390
*                                                                       45976600
*    *****************************************************************  45977000
*    *                                                               *  45977400
*    * IRASMF99.3794: SMF99 subtype 6 Period data section -          *  45977800
*    * BASED(addr(smf_hdr_MAP) + smf9926pof). The subtype 6 record   *  45978200
*    * contains one entry for each service class period that had     *  45978600
*    * recent activity.                                              *  45979000
*    *                                                               *  45979400
*    *****************************************************************  45979800
*                                                                       45980200
*                                                                       45980600
         AIF   ('&SMF99_S6_PER_MAP' EQ 'NO').L0068                      45981290
         AIF   ('&DSECT' EQ 'YES').L0069                                45981580
         AIF   ('&SMF99_S6_PER_MAP' NE 'YES').L0068                     45981870
SMF99_S6_PER_MAP DS 0F                                                  45982200
         AGO   .L006A                                                   45982790
.L0069   ANOP                                                           45982980
SMF99_S6_PER_MAP DSECT                                                  45983400
.L006A   ANOP                                                           45983990
SMF996_ECLASS_NAME DS 1CL0008 IRASMF99.3619: External class name. For  *45984200
                         an externally defined service class this is   *45984600
                         the name defined in the service definition.   *45985000
                         For a server period this name will be of the  *45985400
                         form $SRMSxxx. For system service classes     *45985800
                         this name will be $SRMBEST, $SRMDUMP,         *45986200
                         $SRMGOOD, $SRMDISC, or $SRMQSC.                45986600
SMF996_PER_NUM DS 1FL2   IRASMF99.3671: Period number within class      45987000
SMF996_GOALTYPE DS 1FL1  IRASMF99.3677: goal type: 0 - System, SYSSTC, *45987400
                         or server goal, 1 - short response time, 2 -  *45987800
                         long response time, 3 - velocity, 4 -         *45988200
                         discretionary                                  45988600
SMF996_PERCENTILE DS 1FL1 IRASMF99.3683: Response time goal            *45988800
                         percentile. Zero if period does not a         *45989000
                         percentile response time goal.                 45989200
SMF996_ICLASS_NAME DS 1CL0008 IRASMF99.3665: Internal service class    *45989400
                         name. Same as SMF996_ECLASS_NAME except for   *45989800
                         discretionary periods. For discretionary      *45990200
                         periods the name will be of the form          *45990600
                         $SRMDIxx.                                      45991000
SMF996_GOALVAL DS 1FL4   IRASMF99.3689: goal value: response time goal *45991400
                         - goal in milliseconds, velocity - velocity,  *45991800
                         discretionary, system goal or server period - *45992200
                         zero                                           45992600
SMF996_IMPOR DS 1FL2     IRASMF99.3695: Importance of service class    *45993000
                         period                                         45993400
SMF996_DP DS   1FL1      IRASMF99.3707: Dispatching priority of period *45993800
                         for next policy interval                       45994200
SMF996_IODP DS 1FL1      IRASMF99.3626: I/O priority of period for     *45994600
                         next policy interval                           45995000
SMF996_MPLI DS 1FL2      IRASMF99.3719: MPL in-target for next policy  *45995400
                         interval                                       45995800
SMF996_MPLO DS 1FL2      IRASMF99.3725: MPL out-target for next policy *45996200
                         interval                                       45996600
SMF996_RUA DS  1FL4      IRASMF99.3737: Average number of ready        *45997000
                         address spaces over last policy interval.     *45997400
                         Scaled by * 16                                 45997800
SMF996_PSPT DS 1FL4      IRASMF99.3749: Time swapped out address       *45998200
                         spaces in period are protected from being     *45998600
                         swapped to aux for next policy interval. In   *45999000
                         1.024 milliseconds.                            45999400
SMF996_PSITAR DS 1FL4    IRASMF99.3755: storage isolation target for   *45999800
                         next policy interval for each address space   *46000200
                         in period, valid only for work with short     *46000600
                         response time goals, zero otherwise. Frame    *46001000
                         count.                                         46001400
SMF996_LOCAL_PI DS 1FL4  IRASMF99.3845: local performance index * 100   46001800
SMF996_SYSPLEX_PI DS 1FL4 IRASMF99.3851: sysplex performance index *   *46002200
                         100                                            46002600
SMF996_SERVER_DATA_OF DS 1FL4 IRASMF99.3966: Offset to server section  *46002700
                         from beginning of record (including RDW).     *46002800
                         Only valid if period is a server period.      *46002900
                         There will be one server section entry for    *46003000
                         each different external service class that    *46003100
                         server address spaces in this server period   *46003200
                         were originally classified to.                 46003300
SMF996_SERVER_DATA_LN DS 1FL2 IRASMF99.3972: LENGTH OF EACH SERVER     *46003400
                         SECTION ENTRY                                  46003500
SMF996_SERVER_DATA_ON DS 1FL2 IRASMF99.3978: NUMBER OF SERVER SECTION  *46003600
                         ENTRIES                                        46003700
SMF99_S6_PER_MAP_LEN EQU *-SMF99_S6_PER_MAP                             46003800
.L0068   ANOP                                                           46003940
*                                                                       46004000
*    *****************************************************************  46004200
*    *                                                               *  46004600
*    * IRASMF99.4175: SMF99 subtype 7 self defining section          *  46005200
*    * BASED(addr(smf_hdr_MAP) + smf99dof) for Parallel Access Volume*  46005600
*    * (PAV) devices                                                    46006000
*    *                                                               *  46006400
*    *****************************************************************  46007000
*                                                                       46007600
*                                                                       46008200
         AIF   ('&SMF99_S7_SDEF_MAP' EQ 'NO').L006B                     46009190
         AIF   ('&DSECT' EQ 'YES').L006C                                46009580
         AIF   ('&SMF99_S7_SDEF_MAP' NE 'YES').L006B                    46009970
SMF99_S7_SDEF_MAP DS 0F                                                 46010600
         AGO   .L006D                                                   46011590
.L006C   ANOP                                                           46011980
SMF99_S7_SDEF_MAP DSECT                                                 46012400
.L006D   ANOP                                                           46013290
SMF997_PAV_SUBSYS_ID DS 1CL0032 IRASMF99.3867: PAV subsystem ID a.k.a  *46013600
                         NED TOKEN                                      46014200
SMF997_NUM_EXT_SC DS 1FL4 IRASMF99.4180: Number of external service    *46014300
                         class. Need this to determine the index to    *46014400
                         the SYSTEM service class in the device        *46014500
                         service class bitmap. The device service      *46014600
                         class bitmap is in the device data section.   *46014700
                         The number of external service class is put   *46014800
                         in the self defining section to avoid         *46014900
                         repeating this value for each device.          46015000
SMF997_PAV_DATA_DEV_OF DS 1FL4 IRASMF99.3686: Offset to first device   *46015100
                         section from beginning of record (including   *46015400
                         RDW).                                          46016000
SMF997_PAV_DATA_DEV_LEN DS 1FL2 IRASMF99.4031: Length of each device   *46016600
                         section                                        46017200
SMF997_PAV_DATA_DEV_NO DS 1FL2 IRASMF99.4129: number of device section  46017800
SMF99_S7_SDEF_MAP_LEN EQU *-SMF99_S7_SDEF_MAP                           46018400
.L006B   ANOP                                                           46019290
*                                                                       46019600
*    *****************************************************************  46020200
*    *                                                               *  46020800
*    * IRASMF99.4187: SMF99 subtype 7 PAV device section             *  46021300
*    * based(addr(smf_hdr_map) + smf997_pavh_data_dev_of). for       *  46021800
*    * Parallel Access Volume (PAV) devices. There will be one entry *  46022300
*    * for each PAV base device or unbound alias associated with the *  46022800
*    * PAV subsystem                                                    46023300
*    *                                                               *  46023800
*    *****************************************************************  46024400
*                                                                       46025000
*                                                                       46025600
         AIF   ('&SMF99_S7_PAV_DEV_MAP' EQ 'NO').L006E                  46026590
         AIF   ('&DSECT' EQ 'YES').L006F                                46026980
         AIF   ('&SMF99_S7_PAV_DEV_MAP' NE 'YES').L006E                 46027370
SMF99_S7_PAV_DEV_MAP DS 0D                                              46028000
         AGO   .L0070                                                   46028990
.L006F   ANOP                                                           46029380
SMF99_S7_PAV_DEV_MAP DSECT                                              46029800
.L0070   ANOP                                                           46030690
SMF997_PAV_DEV_ID DS 1FL2 IRASMF99.5258: Device ID                      46031000
SMF997_PAV_DEV_FLAGS DS 0BL1 IRASMF99.5264: Device flags                46031980
SMF997_PAV_UNBOUND_ALIAS_DEV EQU X'80' IRASMF99.5270: PAV device is an *46032200
                         unbound alias                                  46032800
SMF997_PAV_DEV_WLM_MANAGED EQU X'40' IRASMF99.5276: PAV device managed *46033400
                         by WLM                                         46034000
SMF997_PAV_DEV_TEMP_UNAVAIL EQU X'20' IRASMF99.5282: PAV device        *46034600
                         temporary unavailable                          46035200
         ORG   SMF997_PAV_DEV_FLAGS+X'00000001'                         46035800
SMF997_PAV_DEV_NUM_OF_ALIASES DS 1FL1 IRASMF99.5288: Number of aliases *46036400
                         assigned. Valid for PAV base device            46037000
SMF997_PAV_DEV_AVG_IOS_QUEUE_LEN DS 1FL4 IRASMF99.5294: Average IOS    *46037600
                         queue length. Valid for PAV base device        46038200
SMF997_PAV_DEV_AVG_SERVICE_TIME DS 1FL4 IRASMF99.5300: Average service *46038700
                         time. Valid for PAV base device in 128 micro  *46039200
                         seconds                                        46039600
SMF997_PAV_DEV_IODELAY_TIME DS 1FL4 IRASMF99.5306: I/O Delay Time.     *46039800
                         Currently CU Queue time                        46040000
SMF997_PAV_DEV_IODELAY_SAMPS DS 1FL2 IRASMF99.5312: I/O Delay samples   46040200
SMF997_PAV_DEV_IOSQSAMPLES DS 1FL2 IRASMF99.5318: IOS Queue samples     46040400
SMF997_PAV_DEV_RSRVD1 DS 1FL4 IRASMF99.5324: reserved                   46040600
SMF997_PAV_DEV_DEVSC_DATA DS 0CL0016 IRASMF99.5330: Device service     *46041080
                         class bitmap data                              46041200
SMF997_PAV_DEV_DEVSC_MAP DS 1BL14 IRASMF99.5336: Device service class  *46041800
                         id bit string                                  46042400
         DS    1BL2      IRASMF99.5342: Reserved so device sclass      *46043000
                         bitmap is on a double word boundary.           46043600
SMF997_PAV_DEV_UTILIZATION DS 1FL4 IRASMF99.5348: Utilization           46043700
SMF997_PAV_DEV_PENDTIME DS 1FL4 IRASMF99.5354: Pend time                46043800
SMF997_PAV_DEV_DISCTIME DS 1FL4 IRASMF99.5360: Disconnect time          46043900
SMF997_PAV_DEV_SSC DS 1FL4 IRASMF99.5366: Start subchannel count        46044000
SMF997_PAV_DEV_RSRVD2 DS 1FL4 IRASMF99.5372: Reserved                   46044100
         ORG   SMF99_S7_PAV_DEV_MAP+X'00000044'                         46044200
SMF99_S7_PAV_DEV_MAP_LEN EQU *-SMF99_S7_PAV_DEV_MAP                     46044300
.L006E   ANOP                                                           46044440
*                                                                       46044500
*    *****************************************************************  46044600
*    *                                                               *  46044700
*    * IRASMF99.4294: SMF99 subtype 8 self defining section          *  46044800
*    * BASED(addr(smf_hdr_MAP) + smf99dof) for LPAR Management Data  *  46044900
*    *                                                                  46045000
*    *                                                               *  46045100
*    *****************************************************************  46045200
*                                                                       46045300
*                                                                       46045400
         AIF   ('&SMF99_S8_SDEF_MAP' EQ 'NO').L0071                     46045560
         AIF   ('&DSECT' EQ 'YES').L0072                                46045620
         AIF   ('&SMF99_S8_SDEF_MAP' NE 'YES').L0071                    46045680
SMF99_S8_SDEF_MAP DS 0F                                                 46045800
         AGO   .L0073                                                   46045950
.L0072   ANOP                                                           46046000
SMF99_S8_SDEF_MAP DSECT                                                 46046100
.L0073   ANOP                                                           46046240
SMF998_LD_DATA_OFFSET DS 1FL4 IRASMF99.4110: Offset to LPAR Data       *46046300
                         section from beginning of record (including   *46046400
                         RDW)                                           46046500
SMF998_LD_DATA_LENGTH DS 1FL2 IRASMF99.4064: Length of a LPAR Data     *46046600
                         section                                        46046700
SMF998_LD_DATA_NUMBER DS 1FL2 IRASMF99.4915: Number of LPAR Data       *46046800
                         sections                                       46046900
SMF998_PT_DATA_OFFSET DS 1FL4 IRASMF99.4422: Offset to Priority Table  *46047000
                         section from beginning of record (including   *46047100
                         RDW)                                           46047200
SMF998_PT_DATA_LENGTH DS 1FL2 IRASMF99.4222: Length of a Priority      *46047300
                         Table section                                  46047400
SMF998_PT_DATA_NUMBER DS 1FL2 IRASMF99.3763: Number of Priority Table  *46047500
                         sections                                       46047600
SMF998_PC_DATA_OFFSET DS 1FL4 IRASMF99.4048: Offset to Period CPU      *46047700
                         section from beginning of record (including   *46047800
                         RDW)                                           46047900
SMF998_PC_DATA_LENGTH DS 1FL2 IRASMF99.3744: Length of a Period CPU    *46048000
                         section                                        46048100
SMF998_PC_DATA_NUMBER DS 1FL2 IRASMF99.4105: Number of Period CPU      *46048200
                         sections                                       46048300
SMF99_S8_SDEF_MAP_LEN EQU *-SMF99_S8_SDEF_MAP                           46048400
.L0071   ANOP                                                           46048540
*                                                                       46048600
*    *****************************************************************  46048700
*    *                                                               *  46048800
*    * IRASMF99.4300: SMF99 subtype 8 LPAR Data entry - Represents   *  46048900
*    * LPAR information for another active partition in the same     *  46049000
*    * LPAR. BASED(addr(smf_hdr_map) + smf998_ld_data_offset).       *  46049100
*    *                                                               *  46049200
*    *****************************************************************  46049300
*                                                                       46049400
*                                                                       46049500
         AIF   ('&SMF99_S8_LD_MAP' EQ 'NO').L0074                       46049660
         AIF   ('&DSECT' EQ 'YES').L0075                                46049720
         AIF   ('&SMF99_S8_LD_MAP' NE 'YES').L0074                      46049780
SMF99_S8_LD_MAP DS 0F                                                   46049900
         AGO   .L0076                                                   46050050
.L0075   ANOP                                                           46050100
SMF99_S8_LD_MAP DSECT                                                   46050200
.L0076   ANOP                                                           46050340
*                                                                       46050400
*      ***************************************************************  46050500
*      *                                                             *  46050600
*      * IRASMF99.4156: PL/X block comment                           *  46050700
*      *                                                             *  46050800
*      ***************************************************************  46050900
*                                                                       46051000
* ********************************************************************  46051100
* *                                                                  *  46051200
* * - The LD entry always exists in a SMF 99 subtype 8 record.       *  46051300
* *                                                                  *  46051400
* * - The LD entry always has the SMF998_ImageSystemName field       *  46051500
* *   set to the system that the SMF 99 subtype 8 record is          *  46051600
* *   associated with.                                               *  46051700
* *                                                                  *  46051800
* * - If any flags are set in SMF998_ControlFlag1 then the data      *  46051900
* *   in the LD entry has not be fill in due to the flag             *  46052000
* *   condition.                                                     *  46052100
* *                                                                  *  46052200
* ********************************************************************  46052300
*                                                                       46052400
*                                                                       46052500
*                                                                       46052600
SMF998_IMAGESYSTEMNAME DS 1CL0008 IRASMF99.4375: Image System name      46052700
SMF998_CONTROLFLAG1 DS 0BL1 IRASMF99.4103: Control flag that indicates *46052860
                         why the rest of the data in the LD entry has  *46052900
                         not been filled in.                            46053000
SMF998_OVERFLOW EQU X'80' IRASMF99.4155: Indicates that this is an     *46053100
                         overflow SMF 99 subtype 8 record for          *46053200
                         specified system. The appropriate LD data for *46053300
                         this system appears in the first SMF 99       *46053400
                         subtype 8 record for this system.              46053500
SMF998_NODIAG304SUPPORT EQU X'40' IRASMF99.4078: Indicates that this   *46053600
                         system does not have DIAG '0304' support       46053700
SMF998_WLMLPARMGMTNOTENABLED EQU X'20' IRASMF99.5132: Indicates that   *46053800
                         WLM LPAR Management not enabled                46053900
SMF998_DIAGFAILED EQU X'10' IRASMF99.5127: Indicates that this system  *46054000
                         issued DIAG '0304' and it failed               46054100
SMF998_DIAGIMAGENOTFOUND EQU X'08' IRASMF99.5138: Indicates that and   *46054200
                         image entry was not returned via the DIAG     *46054300
                         '0304' interface for this system               46054400
         ORG   SMF998_CONTROLFLAG1+X'00000001'                          46054500
SMF998_SYSTEMNUMBER DS 1FL1 IRASMF99.5490: System slot number. The     *46054600
                         source for this value is QUASNUM in IXCYQUAA.  46054700
SMF998_RESERVED1 DS 1CL0002 IRASMF99.4144: Reserved                     46054800
SMF998_LASTSETTIME DS 1BL8 IRASMF99.4080: Timestamp in STCK format      46054900
SMF998_TOTALWEIGHT DS 1FL4 IRASMF99.4084: Total weight of the CEC       46055000
SMF998_NUMBEROFSHAREDPHYSICALCPUS DS 1FL1 IRASMF99.4094: Total number  *46055100
                         of shared (non-dedicated) physical CPU        *46055200
                         configured for the CEC use                     46055300
SMF998_RESERVED2 DS 1CL0003 IRASMF99.4118: Reserved                     46055400
SMF998_IMAGEID DS 1FL1   IRASMF99.4392: Image ID of the partition       46055500
SMF998_IMAGEFLAGS DS 0BL1 IRASMF99.4329: Image Flags WLMCLPM            46055650
SMF998_IMAGEISCAPPED EQU X'80' IRASMF99.4339: Image is a capped image  *46055700
                         by software.                                   46055800
SMF998_WLMLPARWEIGHTMANAGEMENT EQU X'40' IRASMF99.4345: Switch that    *46055900
                         identifies whether WLM should be involved in  *46056000
                         dynamic LPAR weight management                 46056100
SMF998_IMAGEHASSHAREDCPS EQU X'20' IRASMF99.4351: Identifies whether   *46056200
                         partition is using shared-CPs                  46056300
SMF998_IMAGEHASDEDICATEDCPS EQU X'10' IRASMF99.4357: Identifies        *46056400
                         whether partition is using dedicated-CPs       46056500
SMF998_IMAGEINITIALCAPPING EQU X'08' IRASMF99.4363: Identifies whether *46056600
                         partition is capped by installation through   *46056700
                         hardware console                               46056800
         ORG   SMF998_IMAGEFLAGS+X'00000001'                            46056900
SMF998_RESERVED3 DS 1CL0002 IRASMF99.4369: Reserved                     46057000
SMF998_NUMBERCPUSACTIVE DS 1FL2 IRASMF99.5501: Number of CPUS that are *46057100
                         currently alive                                46057200
SMF998_AVERAGECPUUTILIZATION DS 1FL2 IRASMF99.5502: Average CPU        *46057300
                         utilization                                    46057400
SMF998_IMAGEINITIALWEIGHT DS 1FL2 IRASMF99.4381: Image initial weight   46057500
SMF998_IMAGECURRENTWEIGHT DS 1FL2 IRASMF99.4387: Image current weight   46057600
SMF998_IMAGEMINIMUMWEIGHT DS 1FL2 IRASMF99.4399: Image minimum weight   46057700
SMF998_IMAGEMAXIMUMWEIGHT DS 1FL2 IRASMF99.4405: Image maximum weight   46057800
SMF99_S8_LD_MAP_LEN EQU *-SMF99_S8_LD_MAP                               46057900
.L0074   ANOP                                                           46058040
*                                                                       46058100
*    *****************************************************************  46058200
*    *                                                               *  46058300
*    * IRASMF99.4845: SMF99 subtype 8 Priority table entry -         *  46058400
*    * Represents information for another active partition in the    *  46058500
*    * same LPAR. Information pertains to the demand being put on the*  46058600
*    * processor by work at different dispatch priorities.           *  46058700
*    * BASED(addr(smf_hdr_map) + smf998_pd_data_offset).             *  46058800
*    *                                                               *  46058900
*    *****************************************************************  46059000
*                                                                       46059100
*                                                                       46059200
         AIF   ('&SMF99_S8_PT_MAP' EQ 'NO').L0077                       46059360
         AIF   ('&DSECT' EQ 'YES').L0078                                46059420
         AIF   ('&SMF99_S8_PT_MAP' NE 'YES').L0077                      46059480
SMF99_S8_PT_MAP DS 0F                                                   46059600
         AGO   .L0079                                                   46059750
.L0078   ANOP                                                           46059800
SMF99_S8_PT_MAP DSECT                                                   46059900
.L0079   ANOP                                                           46060040
SMF998_PTPRTY DS 1FL2    IRASMF99.4436: Dispatch priority               46060100
SMF998_PTNP DS 1FL2      IRASMF99.4439: New dispatch priority (zero if *46060200
                         not changed)                                   46060300
SMF998_PTIMDP DS 1FL4    IRASMF99.4447: Initial maximum percentage of  *46060400
                         processor demanded at priority, initial value *46060500
                         before any priority moves or slice changes     46060600
SMF998_PTPMDP DS 1FL4    IRASMF99.4453: Projected maximum percentage   *46060700
                         of processor demanded at priority              46060800
SMF998_PTCPUU DS 1FL4    IRASMF99.4457: CPU using samples at priority   46060900
SMF998_PTCPUD DS 1FL4    IRASMF99.4705: CPU delay samples at priority   46061000
SMF998_PTW2UR DS 1FL4    IRASMF99.4707: Wait-to-using ratio at         *46061100
                         priority (*16)                                 46061200
SMF998_PTAPU DS 1FL4     IRASMF99.4481: Actual measured processor used *46061300
                         at priority                                    46061400
SMF998_PTPPU DS 1FL4     IRASMF99.4486: Projected processor time to be *46061500
                         used at priority                               46061600
SMF998_PTACMD DS 1FL4    IRASMF99.4716: Achievable cumulative max      *46061700
                         demand for priorities affected by a move       46061800
         DS    1FL4      IRASMF99.4722: Reserved                        46061900
SMF998_PTIMAXD DS 1FL4   IRASMF99.4728: Initial cumulative maximum     *46062000
                         demand                                         46062100
SMF998_PTWMAXD DS 1FL4   IRASMF99.4734: Projected cumulative maximum   *46062200
                         demand                                         46062300
SMF998_PTIAMTW DS 1FL4   IRASMF99.4740: Initial average mean time to   *46062400
                         wait                                           46062500
SMF998_PTWAMTW DS 1FL4   IRASMF99.4746: Projected average mean time to *46062600
                         wait                                           46062700
SMF99_S8_PT_MAP_LEN EQU *-SMF99_S8_PT_MAP                               46062800
.L0077   ANOP                                                           46062940
*                                                                       46063000
*    *****************************************************************  46063100
*    *                                                               *  46063200
*    * IRASMF99.4306: SMF99 subtype 8 CPU period table entry -       *  46063300
*    * Represents information for another active partition in the    *  46063400
*    * same LPAR. Information pertains to CPU data per service class *  46063500
*    * period. based(addr(smf_hdr_map) + smf998_pc_data_offset).     *  46063600
*    *                                                               *  46063700
*    *****************************************************************  46063800
*                                                                       46063900
*                                                                       46064000
         AIF   ('&SMF99_S8_PC_MAP' EQ 'NO').L007A                       46064160
         AIF   ('&DSECT' EQ 'YES').L007B                                46064220
         AIF   ('&SMF99_S8_PC_MAP' NE 'YES').L007A                      46064280
SMF99_S8_PC_MAP DS 0F                                                   46064400
         AGO   .L007C                                                   46064550
.L007B   ANOP                                                           46064600
SMF99_S8_PC_MAP DSECT                                                   46064700
.L007C   ANOP                                                           46064840
SMF998_SERVICE_CLASS_NAME DS 1CL0008 IRASMF99.5407: Internal service   *46064900
                         class name                                     46065000
SMF998_IMPORTANCE DS 1FL2 IRASMF99.4755: Importance                     46065100
SMF998_PERIOD_NUMBER DS 1FL2 IRASMF99.5402: Period number               46065200
SMF998_RESERVED1 DS 1CL0004 IRASMF99.5401: Reserved                     46065300
SMF998_DASD_IO_DELAY_SAMPLE DS 1FL4 IRASMF99.4958: Copy of IO delay    *46065400
                         sample                                         46065500
SMF998_NON_IDLE_SAMP DS 1FL4 IRASMF99.4804: Number of non-idle samples  46065600
SMF998_CPU_USING_SAMPLE DS 1FL4 IRASMF99.4810: Copy of CPU using       *46065700
                         sample                                         46065800
SMF998_CPU_DELAY_SAMPLE DS 1FL4 IRASMF99.4816: Copy of CPU delay       *46065900
                         sample                                         46066000
SMF998_WLM_QUEUE_DELAY_SAMPLE DS 1FL4 IRASMF99.4822: Copy of WLM queue *46066100
                         delay sample                                   46066200
SMF998_DASD_IO_USING_SAMPLE DS 1FL4 IRASMF99.4828: Copy of DASD IO     *46066300
                         using sample                                   46066400
SMF998_MAX_DEM_PER DS 1FL4 IRASMF99.4850: Maximum percentage of        *46066500
                         processor time demanded (constant across      *46066600
                         policy adjustment) for small consumer          46066700
SMF998_PI_ACHIEVED DS 1FL4 IRASMF99.4880: Performance index achieved,  *46066800
                         adjusted into range, used to select donors    *46066900
                         and receivers                                  46067000
SMF998_SYSPLEX_PI_ACHIEVED DS 1FL4 IRASMF99.4886: Sysplex performance  *46067100
                         index achieved, adjusted into range, used to  *46067200
                         select donors and receivers                    46067300
SMF998_SERVICE_OW DS 1FL4 IRASMF99.4932: Average service over window    46067400
SMF998_MTW_ADJ DS 1FL4   IRASMF99.4938: Mean time to wait adjusted by  *46067500
                         cccmxmtw                                       46067600
SMF998_BASE_PRIORITY DS 1FL2 IRASMF99.4960: Base dispatching priority   46067700
SMF998_CAP_NUM_SLICES DS 1FL2 IRASMF99.4097: Current number of sleep   *46067800
                         slices or 0                                    46067900
SMF998_WORK_PRO_USED DS 1FL4 IRASMF99.5016: Working variable for       *46068000
                         assess for processor used                      46068100
SMF998_CURRENT_ACH_DEM_PER DS 1FL4 IRASMF99.5022: Current achievable   *46068200
                         demand percentage for the period calculated   *46068300
                         from the initial PDT fields.                   46068400
SMF998_ACH_DEM_PER DS 1FL4 IRASMF99.5028: Working variable for         *46068500
                         achievable demand percentage                   46068600
SMF998_OLD_WORK_PRO_USED DS 1FL4 IRASMF99.5034: Work field computed    *46068700
                         during phase 1 move                            46068800
SMF998_PROJ_PI_COM DS 1FL4 IRASMF99.5040: Unadjusted projected PI for  *46068900
                         committed actions only, used as base for      *46069000
                         projections                                    46069100
SMF998_USING_DELTA DS 1FL4 IRASMF99.5046: Computed during assessment    46069200
SMF998_LPARMGMT_DELAY_DELTA DS 1FL4 IRASMF99.5058: Delay delta         *46069300
                         computed by LPAR Mgmt algorithm. This field   *46069400
                         captures the delay delta for SMF99 recording  *46069500
                         before it is cleared out.                      46069600
SMF998_CPU_CAP_DELAY_SAMPLE DS 1FL4 IRASMF99.5052: CPU capping delay   *46069700
                         sample                                         46069800
SMF998_IOSUB_SAMPLES_DATA_OFFSET DS 1FL4 IRASMF99.4772: Offset to I/O  *46069900
                         subsystem samples data from beginning of      *46070000
                         record (including RDW)                         46070100
SMF998_IOSUB_SAMPLES_DATA_LENGTH DS 1FL2 IRASMF99.4766: Length of a    *46070200
                         I/O subsystem samples data section             46070300
SMF998_IOSUB_SAMPLES_DATA_NUMBER DS 1FL2 IRASMF99.4754: Number of I/O  *46070400
                         subsystem samples data sections                46070500
SMF99_S8_PC_MAP_LEN EQU *-SMF99_S8_PC_MAP                               46070600
.L007A   ANOP                                                           46070740
*                                                                       46070800
*    *****************************************************************  46070900
*    *                                                               *  46071000
*    * IRASMF99.5220: SMF99 subtype 9 self defining section          *  46071100
*    * BASED(addr(smf_hdr_MAP) + smf99dof) for Dynamic CHPID         *  46071200
*    * management                                                       46071300
*    *                                                               *  46071400
*    *****************************************************************  46071500
*                                                                       46071600
*                                                                       46071700
         AIF   ('&SMF99_S9_SDEF_MAP' EQ 'NO').L007D                     46071860
         AIF   ('&DSECT' EQ 'YES').L007E                                46071920
         AIF   ('&SMF99_S9_SDEF_MAP' NE 'YES').L007D                    46071980
SMF99_S9_SDEF_MAP DS 0F                                                 46072100
         AGO   .L007F                                                   46072250
.L007E   ANOP                                                           46072300
SMF99_S9_SDEF_MAP DSECT                                                 46072400
.L007F   ANOP                                                           46072540
SMF999_IO_SUBSYSTEM_DATA_OFFSET DS 1FL4 IRASMF99.4788: Offset to IO    *46072600
                         Subsystem data section from beginning of      *46072700
                         record (including RDW)                         46072800
SMF999_IO_SUBSYSTEM_DATA_LENGTH DS 1FL2 IRASMF99.4794: Length of IO    *46072900
                         Subsystem Data section                         46073000
SMF999_IO_SUBSYSTEM_DATA_NUMBER DS 1FL2 IRASMF99.4803: Number of IO    *46073100
                         Subsytem Data sections                         46073200
SMF999_IOSUB_PLOT_OF DS 1FL4 IRASMF99.5074: Offset to IO Subsystem     *46073300
                         plots                                          46073400
SMF999_IOSUB_PLOT_LN DS 1FL2 IRASMF99.5083: Length of IO Subsystem     *46073500
                         plots                                          46073600
SMF999_IOSUB_PLOT_ON DS 1FL2 IRASMF99.4773: Number of IO Subsystem     *46073700
                         plots                                          46073800
SMF999_CHANNEL_DATA_OF DS 1FL4 IRASMF99.5513: Offset to Channel Data   *46073900
                         section                                        46074000
SMF999_CHANNEL_DATA_LN DS 1FL2 IRASMF99.5516: Length of Channel Data   *46074100
                         section                                        46074200
SMF999_CHANNEL_DATA_ON DS 1FL2 IRASMF99.5520: Number of Channel Data   *46074300
                         section                                        46074400
SMF99_S9_SDEF_MAP_LEN EQU *-SMF99_S9_SDEF_MAP                           46074500
.L007D   ANOP                                                           46074640
*                                                                       46074700
*    *****************************************************************  46074800
*    *                                                               *  46074900
*    * IRASMF99.5239: SMF99 subtype 9 Chpid data entry - Represents  *  46075000
*    * I/O subsystem information. BASED(addr(smf_hdr_map) +          *  46075100
*    * smf999_io_subsystem_data_offset)                                 46075200
*    *                                                               *  46075300
*    *****************************************************************  46075400
*                                                                       46075500
*                                                                       46075600
         AIF   ('&SMF99_S9_IO_SUBSYSTEM_MAP' EQ 'NO').L0080             46075760
         AIF   ('&DSECT' EQ 'YES').L0081                                46075820
         AIF   ('&SMF99_S9_IO_SUBSYSTEM_MAP' NE 'YES').L0080            46075880
SMF99_S9_IO_SUBSYSTEM_MAP DS 0F                                         46076000
         AGO   .L0082                                                   46076150
.L0081   ANOP                                                           46076200
SMF99_S9_IO_SUBSYSTEM_MAP DSECT                                         46076300
.L0082   ANOP                                                           46076440
SMF999_FLAG1 DS 0BL1     IRASMF99.4021: IO subsystem flags              46076550
SMF999_FLOAT_CAPABLE EQU X'80' IRASMF99.5409: Indicates that the IO    *46076600
                         subsystem is float capable                     46076700
         ORG   SMF999_FLAG1+X'00000001'                                 46076800
SMF999_RESERVED DS 1CL0007 IRASMF99.5390: Reserved                      46076900
SMF999_TOKEN_NED DS 1CL0032 IRASMF99.4925: Token NED of I/O Subsystem   46077000
SMF999_IOSUB_TARGET_VELOCITY DS 1FL4 IRASMF99.4931: I/O subsystem      *46077100
                         target velocity                                46077200
SMF999_IOSUB_VELOCITY DS 1FL4 IRASMF99.4977: The I/O velocity of the   *46077300
                         subsystem                                      46077400
SMF999_IOSUB_AVG_SVC_TIME DS 1FL4 IRASMF99.4903: Average service time  *46077500
                         over 2 minutes                                 46077600
SMF999_IOSUB_CHECK_POINT_TIME DS 1FL4 IRASMF99.4983: Average service   *46077700
                         time of the subsystem when SRM set a target    46077800
SMF999_IOSUB_INDEX DS 1FL2 IRASMF99.5155: IO Subsystem Index            46077900
SMF999_LCU_SQNUMBER DS 1FL2 IRASMF99.5532: LCU sequence number          46078000
SMF99_S9_IO_SUBSYSTEM_MAP_LEN EQU *-SMF99_S9_IO_SUBSYSTEM_MAP           46078100
.L0080   ANOP                                                           46078240
*                                                                       46078300
*    *****************************************************************  46078400
*    *                                                               *  46078500
*    * IRASMF99.2477: SMF99 subtype 9 I/O subsystem Plot section.    *  46078600
*    * BASED(addr(smf_hdr_map) + smf999_iosub_plot_of)                  46078700
*    *                                                               *  46078800
*    *****************************************************************  46078900
*                                                                       46079000
*                                                                       46079100
         AIF   ('&SMF99_S9_IOSUB_MAP' EQ 'NO').L0083                    46079260
         AIF   ('&DSECT' EQ 'YES').L0084                                46079320
         AIF   ('&SMF99_S9_IOSUB_MAP' NE 'YES').L0083                   46079380
SMF99_S9_IOSUB_MAP DS 0F                                                46079500
         AGO   .L0085                                                   46079650
.L0084   ANOP                                                           46079700
SMF99_S9_IOSUB_MAP DSECT                                                46079800
.L0085   ANOP                                                           46079940
SMF99_IOSUB_BW DS 1FL4   SRMWPLOT.1350: Bucket width                    46080000
SMF99_IOSUB_LSTX DS 1FL4 SRMWPLOT.1356: Last plotted x bucket           46080100
         DS    1FL4      SRMWPLOT.1362: Reserved                        46080200
SMF99_IOSUB_POINTS_OF DS 1FL4 SRMWPLOT.1368: Offset of point entries    46080300
SMF99_IOSUB_POINTS_ON DS 1FL2 SRMWPLOT.1374: Number of point entries    46080400
SMF99_IOSUB_POINTS_LN DS 1FL2 SRMWPLOT.1380: Length of a point entry    46080500
SMF99_S9_IOSUB_MAP_LEN EQU *-SMF99_S9_IOSUB_MAP                         46080600
.L0083   ANOP                                                           46080740
*                                                                       46080800
*    *****************************************************************  46080900
*    *                                                               *  46081000
*    * IRASMF99.5611: SMF99 subtype 9 Chpid data entry - Represents  *  46081100
*    * Channel Data information. BASED(addr(smf_hdr_map) +           *  46081200
*    * smf999_channel_data_of)                                          46081300
*    *                                                               *  46081400
*    *****************************************************************  46081500
*                                                                       46081600
*                                                                       46081700
         AIF   ('&SMF99_S9_CHANNEL_MAP' EQ 'NO').L0086                  46081860
         AIF   ('&DSECT' EQ 'YES').L0087                                46081920
         AIF   ('&SMF99_S9_CHANNEL_MAP' NE 'YES').L0086                 46081980
SMF99_S9_CHANNEL_MAP DS 0F                                              46082100
         AGO   .L0088                                                   46082250
.L0087   ANOP                                                           46082300
SMF99_S9_CHANNEL_MAP DSECT                                              46082400
.L0088   ANOP                                                           46082540
SMF999_CHANNEL_ID DS 1FL1 IRASMF99.5565: IO Subsystem channel ID        46082600
SMF999_CHANNEL_TYPE DS 1FL1 IRASMF99.5571: IO Subsystem channel type    46082700
SMF999_CHANNEL_FLAG DS 0BL1 IRASMF99.5577: IO Subsystem channel flags  *46082860
                         bit indicators if channel is managed or not    46082900
SMF999_MANAGED_BY_WLM EQU X'80' IRASMF99.5540: Indicates that this     *46083000
                         Channel can be managed by WLM                  46083100
         ORG   SMF999_CHANNEL_FLAG+X'00000001'                          46083200
SMF999_CHANNEL_RESERVED DS 1CL0001 IRASMF99.5583: Reserved              46083300
SMF999_CHANNEL_UTILIZATION DS 1FL4 IRASMF99.5589: IO Subsystem Channel *46083400
                         utilization for the current data collection   *46083500
                         interval                                       46083600
SMF99_S9_CHANNEL_MAP_LEN EQU *-SMF99_S9_CHANNEL_MAP                     46083700
.L0086   ANOP                                                           46083840
*                                                                       46083900
*    *****************************************************************  46084000
*    *                                                               *  46084100
*    * IRASMF99.2185: SMF99 subtype 2 xmem delay data                *  46084200
*    * BASED(addr(smf_hdr_MAP) + smf99_pxmem_of) or                  *  46084300
*    * BASED(addr(smf_hdr_MAP) + smf99_sxmem_of)                     *  46096000
*    *                                                               *  46139000
*    *****************************************************************  46182000
*                                                                       46225000
*                                                                       46268000
         AIF   ('&SMF99_XMEM_MAP' EQ 'NO').L0089                        46340990
         AIF   ('&DSECT' EQ 'YES').L008A                                46370980
         AIF   ('&SMF99_XMEM_MAP' NE 'YES').L0089                       46400970
SMF99_XMEM_MAP DS 0F                                                    46440000
         AGO   .L008B                                                   46502990
.L008A   ANOP                                                           46522980
SMF99_XMEM_MAP DSECT                                                    46569000
.L008B   ANOP                                                           46631990
SMF99_XMEM_JOBN DS 1CL0008 IRASMF99.1452: jobname of space we are      *46655000
                         delayed on                                     46698000
SMF99_XMEM_SAMPS DS 1FL4 IRASMF99.1461: number of xmem samples          46741000
SMF99_XMEM_MAP_LEN EQU *-SMF99_XMEM_MAP                                 46784000
.L0089   ANOP                                                           46846990
*                                                                       46870000
*    *****************************************************************  46913000
*    *                                                               *  46956000
*    * IRASMF99.2197: SMF99 subtype 2 server data                    *  46999000
*    * BASED(addr(smf_hdr_MAP) + smf99_pserv_of)                     *  47042000
*    *                                                               *  47085000
*    *****************************************************************  47128000
*                                                                       47171000
*                                                                       47214000
         AIF   ('&SMF99_SERVER_MAP' EQ 'NO').L008C                      47286990
         AIF   ('&DSECT' EQ 'YES').L008D                                47316980
         AIF   ('&SMF99_SERVER_MAP' NE 'YES').L008C                     47346970
SMF99_SERVER_MAP DS 0F                                                  47386000
         AGO   .L008E                                                   47448990
.L008D   ANOP                                                           47468980
SMF99_SERVER_MAP DSECT                                                  47515000
.L008E   ANOP                                                           47577990
SMF99_SERVER_CNM DS 1CL0008 IRASMF99.1478: Class that period belongs   *47601000
                         to                                             47644000
SMF99_SERVER_PNUM DS 1FL4 IRASMF99.1482: Period number                  47687000
SMF99_SERVER_OBS DS 1FL4 IRASMF99.1488: Percentage of time this server *47730000
                         was serving the period                         47773000
SMF99_SERVER_MAP_LEN EQU *-SMF99_SERVER_MAP                             47816000
.L008C   ANOP                                                           47817190
*                                                                       47817600
*    *****************************************************************  47818400
*    *                                                               *  47819200
*    * IRASMF99.1209: SMF99 subtype 2 server sample data             *  47820000
*    * BASED(addr(smf_hdr_MAP) + smf99_server_sdata_of)                 47820800
*    *                                                               *  47821600
*    *****************************************************************  47822400
*                                                                       47823200
*                                                                       47824000
         AIF   ('&SMF99_SDATA_MAP' EQ 'NO').L008F                       47825390
         AIF   ('&DSECT' EQ 'YES').L0090                                47825980
         AIF   ('&SMF99_SDATA_MAP' NE 'YES').L008F                      47826570
SMF99_SDATA_MAP DS 0F                                                   47827200
         AGO   .L0091                                                   47828490
.L0090   ANOP                                                           47828980
SMF99_SDATA_MAP DSECT                                                   47829600
.L0091   ANOP                                                           47830790
SMF99_SDATA_WQDEL DS 1FL4 IRASMF99.1107: Delay samples waiting on      *47831200
                         WLM-managed work queue                         47832000
SMF99_SDATA_ENC_AUXP DS 1FL4 IRASMF99.1125: aux private paging delay   *47832800
                         samples experienced by enclave work units     *47833600
                         known to be associated with an address space   47834400
SMF99_SDATA_ENC_VIO DS 1FL4 IRASMF99.1121: aux VIO paging delay        *47835200
                         samples experienced by enclave work units     *47836000
                         known to be associated with an address space   47836800
SMF99_SDATA_ENC_HSP DS 1FL4 IRASMF99.1127: aux standard hiperspace     *47837600
                         paging delay samples experienced by enclave   *47838400
                         work units known to be associated with an     *47839200
                         address space                                  47840000
SMF99_SDATA_ENC_MPLD DS 1FL4 IRASMF99.1160: MPL delay samples          *47840800
                         experienced by enclave work units known to be *47841600
                         associated with an address space               47842400
SMF99_SDATA_ENC_ASWP DS 1FL4 IRASMF99.1166: aux swap delay samples     *47843200
                         experienced by enclave work units known to be *47844000
                         associated with an address space               47844800
SMF99_SDATA_SERVER_CLASS_NAME DS 1CL0008 IRASMF99.3241: class name of  *47845600
                         disp serving this period or blank for batch    47845700
SMF99_SDATA__SERVER_TYPE DS 0BL1 IRASMF99.3348: Type byte               47845850
SMF99_SDATA_ENC_OR_Q_SERVER EQU X'80' IRASMF99.3569: Server is an      *47845900
                         enclave or queue server                        47846000
SMF99_SDATA_BATCH EQU X'40' IRASMF99.3575: Server is a batch work      *47846100
                         queue                                          47846200
         ORG   SMF99_SDATA__SERVER_TYPE+X'00000001'                     47846300
         DS    1CL0003   IRASMF99.3581: reserved                        47846400
SMF99_SDATA_SUBSYS_TYPE DS 1CL0004 IRASMF99.3562: Subsystem type of    *47846500
                         owner of the queue. Only applies to batch     *47846600
                         queue servers.                                 47846700
SMF99_SDATA_SUBSYS_NAME DS 1CL0008 IRASMF99.3351: Subsystem name of    *47846800
                         owner of the queue. Only applies to batch     *47846900
                         queue servers.                                 47847000
SMF99_SDATA_MAP_LEN EQU *-SMF99_SDATA_MAP                               47847200
.L008F   ANOP                                                           47848390
*                                                                       47848800
*    *****************************************************************  47849600
*    *                                                               *  47850400
*    * IRASMF99.1188: SMF99 subtype 2 queue server data              *  47851200
*    * BASED(addr(smf_hdr_MAP) + smf99_server_qdata_of)                 47852000
*    *                                                               *  47852800
*    *****************************************************************  47853600
*                                                                       47854400
*                                                                       47855200
         AIF   ('&SMF99_QDATA_MAP' EQ 'NO').L0092                       47856590
         AIF   ('&DSECT' EQ 'YES').L0093                                47857180
         AIF   ('&SMF99_QDATA_MAP' NE 'YES').L0092                      47857770
SMF99_QDATA_MAP DS 0F                                                   47858400
         AGO   .L0094                                                   47859690
.L0093   ANOP                                                           47860180
SMF99_QDATA_MAP DSECT                                                   47860800
.L0094   ANOP                                                           47861990
SMF99_QDATA_ENV_NAME DS 1CL0032 IRASMF99.1238: associated environment  *47862400
                         name for the queue                             47863200
SMF99_QDATA_SERVER_CLASS_NAME DS 1CL0008 IRASMF99.3247: class name of  *47864000
                         disp serving the period represented by this   *47864800
                         subtype 2 record. Only applies to queue       *47865300
                         manager type servers.                          47865800
SMF99_QDATA_SERVER_WANT DS 1FL4 IRASMF99.1237: Number of server        *47866400
                         instances needed to address queue delay       *47867200
                         according to policy adjustment. This is a     *47868000
                         queue wide count.                              47868800
SMF99_QDATA_SERVER_HAVE DS 1FL4 IRASMF99.1241: Current actual number   *47869600
                         of server instances bound to the queue. This  *47870400
                         is a queue wide count.                         47871200
SMF99_QDATA_SERVER_ACTIVE DS 1FL4 IRASMF99.1251: Current actual number *47872000
                         of server instances bound to the queue and    *47872800
                         between Begin and End. This is a subset of    *47873600
                         the Have count. Have minus Active equals      *47874400
                         Idle.                                          47875200
SMF99_QDATA_AS_CAPACITY DS 1FL4 IRASMF99.1257: Address space server    *47876000
                         instance capacity                              47876800
SMF99_QDATA_ACHIEVED_QMPL DS 1FL4 IRASMF99.1263: average number (over  *47877600
                         policy interval) of server instances that are *47878400
                         in swapped in spaces in the DISP. Only counts *47879200
                         server instances serving the external service *47880000
                         classs associated with the queue. Scaled by * *47880800
                         16. Not used for batch queue servers.          47881600
SMF99_QDATA_ACTIVE_QMPL DS 1FL4 IRASMF99.1272: average of numer of     *47882400
                         server instance between Begin and End during  *47883200
                         policy interval. Scaled by * 16. For batch    *47883600
                         queue servers this is the number of           *47884000
                         initiators with active jobs sysplex wide.      47884400
SMF99_QDATA_QMPL_IN_TAR DS 1FL4 IRASMF99.1368: Number of address       *47884800
                         spaces suggested to be started in the DISP on *47885600
                         behalf of the period represented by this      *47886400
                         subtype 2. Does not apply to batch queue      *47886900
                         servers.                                       47887400
SMF99_QDATA_AVG_QUEUED_REQUESTS DS 1FL4 IRASMF99.3125: Average number  *47888000
                         of queued requests over a policy interval     *47888800
                         scaled by * 16                                 47889600
SMF99_QDATA_LT_TOTAL_REQUESTS DS 1FL4 IRASMF99.3088: Long term average *47890400
                         total requests (queued + active) scaled by     47891200
SMF99_QDATA_SERVER_IDLE DS 1FL4 IRASMF99.3320: Average idle server     *47892000
                         instances over policy interval                 47892800
SMF99_QDATA_Q_TYPE DS 0BL1 IRASMF99.3098: Type byte                     47893110
SMF99_QDATA_QUEUE_MANAGER EQU X'80' IRASMF99.3326: queue manager type  *47893200
                         work queue                                     47893400
SMF99_QDATA_BATCH EQU X'40' IRASMF99.3330: Batch type work queue        47893600
         ORG   SMF99_QDATA_Q_TYPE+X'00000001'                           47893800
SMF99_QDATA_Q_QUALIFIER DS 0BL1 IRASMF99.3259: Work Queue Qualifier     47893950
SMF99_QDATA_TASKS_MANAGED EQU X'80' IRASMF99.4685: Server instances    *47894000
                         are managed by WLM                             47894100
SMF99_QDATA_SPACES_MOVED_BY_HSK EQU X'40' IRASMF99.5776: Address       *47894110
                         spaces have been moved from this work queue   *47894114
                         to enforce the minimum number of servers of   *47894121
                         another work queue of the same application    *47894128
                         environment                                    47894135
SMF99_QDATA_SPACES_MOVED_BY_PA EQU X'20' IRASMF99.5782: Address spaces *47894145
                         have been moved during policy adjustment      *47894149
                         because the maximum number of servers has     *47894156
                         been already started for the application      *47894163
                         environment                                    47894170
SMF99_QDATA_AE_SPREADMIN EQU X'10' IRASMF99.5788: Minimum number of    *47894180
                         address spaces must be ditributed across all  *47894184
                         work queues of the application environment     47894191
         ORG   SMF99_QDATA_Q_QUALIFIER+X'00000001'                      47894200
SMF99_QDATA_ACTIVE_RGNWORK DS 1FL2 IRASMF99.5841: Current active       *47894370
                         number of server processing work requests     *47894440
                         which have been routed directly to the server *47894510
                         region. This number is neither included in    *47894580
                         the idle nor the active server count.          47894650
SMF99_QDATA_RQDATA_OF DS 1FL4 IRASMF99.3472: Offset to remote queue    *47894800
                         data section from beginning of record         *47895300
                         (including RDW). Only applies to batch queue  *47895800
                         server                                         47896300
SMF99_QDATA_RQDATA_LN DS 1FL2 IRASMF99.3478: Length of remote queue    *47896800
                         data entries                                   47897300
SMF99_QDATA_RQDATA_ON DS 1FL2 IRASMF99.3484: Number of remote queue    *47897800
                         data entries                                   47898300
SMF99_QDATA_SUBSYS_TYPE DS 1CL0004 IRASMF99.3536: Subsystem type of    *47898800
                         owner of the queue. Only applies to batch     *47899300
                         queue servers.                                 47899800
SMF99_QDATA_SUBSYS_NAME DS 1CL0008 IRASMF99.3542: Subsystem name of    *47900300
                         owner of the queue. Only applies to batch     *47900800
                         queue servers.                                 47901300
SMF99_QDATA_INST_PER_SERVER DS 1FL2 IRASMF99.3490: Number of server    *47901440
                         instances per server. Only applies if         *47901500
                         SMF99_QDATA- _TASKS_MANAGED is set             47901600
SMF99_QDATA_SPACES_MOVED DS 1FL2 IRASMF99.5794: Number of server       *47901640
                         address spaces moved away from this queue.     47901660
SMF99_QDATA_AE_MAXLIMIT DS 1FL2 IRASMF99.5800: Maximum number of       *47902140
                         servers for the application environment.       47902160
SMF99_QDATA_AE_MINLIMIT DS 1FL2 IRASMF99.5806: Minimum number of       *47902200
                         servers for the application environment.       47902220
SMF99_QDATA_AVG_INELIGIBLE_REQUESTS DS 1FL4 IRASMF99.4691: Average     *47902268
                         number of ineligible queued requests over a   *47902276
                         policy interval scaled by * 16. Currently     *47902284
                         applies to batch queues only.                  47902292
SMF99_QDATA_MAP_LEN EQU *-SMF99_QDATA_MAP                               47902300
.L0092   ANOP                                                           47902990
*                                                                       47903300
*    *****************************************************************  47903800
*    *                                                               *  47904300
*    * IRASMF99.3530: SMF99 subtype 2 remote queue server data.      *  47904800
*    * Contains information on the state of a batch work queue on a  *  47905300
*    * specific system. There is one RQDATA section for each system a*  47905800
*    * batch work queue is registered on including the local system. *  47906300
*    * BASED(addr(smf_hdr_MAP) + smf99_qdata_rqdata_of)                 47906800
*    *                                                               *  47907300
*    *****************************************************************  47907800
*                                                                       47908300
*                                                                       47908800
         AIF   ('&SMF99_RQDATA_MAP' EQ 'NO').L0095                      47909590
         AIF   ('&DSECT' EQ 'YES').L0096                                47909880
         AIF   ('&SMF99_RQDATA_MAP' NE 'YES').L0095                     47910170
SMF99_RQDATA_MAP DS 0F                                                  47910800
         AGO   .L0097                                                   47911590
.L0096   ANOP                                                           47911880
SMF99_RQDATA_MAP DSECT                                                  47912300
.L0097   ANOP                                                           47912990
SMF99_RQDATA_SYS_NAME DS 1CL0008 IRASMF99.3391: name of system this    *47913300
                         RQDATA section represents                      47913800
SMF99_RQDATA_FLAGS DS 0BL4 IRASMF99.3397: flags                         47914580
SMF99_RQDATA_JUST_STARTED_SERVER EQU X'80' IRASMF99.3403: This system  *47914800
                         started at least one server for this work     *47915300
                         queue in the policy interval that this data   *47915800
                         represents                                     47916300
SMF99_RQDATA_CANNOT_START_SERVER EQU X'40' IRASMF99.3409: This system  *47916800
                         cannot start any servers for this work queue  *47917300
                         due to some constraint                         47917800
SMF99_RQDATA_DEFERRED_STARTING_SERVER EQU X'20' IRASMF99.3415: This    *47918300
                         system wanted to add servers for this work    *47918800
                         queue on the just-completed policy interval,  *47919300
                         but deferred since another system appears to  *47919800
                         be a better candidate.                         47920300
SMF99_RQDATA_MANAGED EQU X'10' IRASMF99.3421: Work queue is managed on *47920800
                         this system                                    47921300
SMF99_RQDATA_ASSESS_DATA_VALID EQU X'08' IRASMF99.3814: Originator     *47921400
                         sent valid assess data                         47921500
         ORG   SMF99_RQDATA_FLAGS+X'00000004'                           47921800
SMF99_RQDATA_ACTIVE_SERVERS DS 1FL4 IRASMF99.3427: 10-second average   *47922300
                         number of active servers scaled by * 16        47922800
SMF99_RQDATA_TOTAL_SERVERS DS 1FL4 IRASMF99.3433: 10-second average    *47923300
                         total servers. Includes active and idle       *47923800
                         servers.                                       47924300
SMF99_RQDATA_AVG_TOTAL_REQ DS 1FL4 IRASMF99.3496: Average total        *47924800
                         requests for the queue eligible to run on the *47925300
                         system respresented by this RQDATA entry.     *47925800
                         This corresponds to the last point plotted on *47926300
                         the queue delay plot. Scaled by * 16.          47926800
SMF99_RQDATA_DEFERRAL_INFORMATION DS 0CL0040 IRASMF99.3439: This info  *47927580
                         valid only if smf99_rqdat-                    *47927800
                         a_assess_data_valid is on                      47928300
SMF99_RQDATA_#_SERVERS DS 1FL4 IRASMF99.3442: Number of servers        *47928800
                         required for receiver value                    47929300
SMF99_RQDATA_PI_DELTA DS 1FL4 IRASMF99.3448: PI delta for donor period *47929800
                         of highest importance if servers are started   47930300
SMF99_RQDATA_HIGHEST_IMP DS 1FL2 IRASMF99.3454: Highest importance of  *47930800
                         donor periods negatively affected if servers  *47931300
                         are started                                    47931800
         DS    1CL0002   IRASMF99.3460: reserved for alignment          47932300
SMF99_RQDATA_WAITING_FOR_SYSNAME DS 1CL0008 IRASMF99.3466: System name *47932800
                         sender is deferring to. Blank if deferring    *47933300
                         only to collect data from other systems.       47933800
SMF99_RQDATA_DONOR_CLASS DS 1CL0008 IRASMF99.3593: Class name for      *47934300
                         donor period most impacted by starting        *47934800
                         servers                                        47935300
SMF99_RQDATA_PER# DS 1FL4 IRASMF99.3599: Period number with in class   *47935800
                         of donor                                       47936300
SMF99_RQDATA_DONOR_RGROUP DS 1CL0008 IRASMF99.3844: resource group     *47936400
                         name for donor period most impacted by        *47936500
                         starting servers                               47936600
SMF99_RQDATA_PA_SKIP DS 1FL2 IRASMF99.3587: policy adjustment skip     *47936700
                         clock                                          47936800
SMF99_RQDATA_Q_SKIP DS 1FL1 IRASMF99.3829: defer processing skip clock  47936900
SMF99_RQDATA_Q_SKIP_REASON DS 1FL1 IRASMF99.3838: reason defer         *47937000
                         processing skip clock was set                  47937100
SMF99_RQDATA_AVG_QUEUED_REQUESTS DS 1FL4 IRASMF99.4683: average number *47937210
                         of queued requests over a policy interval     *47937220
                         scaled by * 16                                 47937230
SMF99_RQDATA_AVG_INELIGIBLE_REQUESTS DS 1FL4 IRASMF99.4843: average    *47937240
                         number of ineligible queued requests over a   *47937250
                         policy interval scaled by * 16                 47937260
         DS    1CL0004   IRASMF99.3820: reserved                        47937270
SMF99_RQDATA_MAP_LEN EQU *-SMF99_RQDATA_MAP                             47937300
.L0095   ANOP                                                           47937990
*                                                                       47938300
*    *****************************************************************  47945000
*    *                                                               *  47988000
*    * IRASMF99.2221: SMF99 subtype 2 address space expanded storage *  48031000
*    * access policy BASED(addr(smf_hdr_MAP) + smf99_pesp_of)        *  48074000
*    *                                                               *  48117000
*    *****************************************************************  48160000
*                                                                       48203000
*                                                                       48246000
         AIF   ('&SMF99_AS_ESP_MAP' EQ 'NO').L0098                      48325990
         AIF   ('&DSECT' EQ 'YES').L0099                                48355980
         AIF   ('&SMF99_AS_ESP_MAP' NE 'YES').L0098                     48385970
SMF99_AS_ESP_MAP DS 0F                                                  48446000
         AGO   .L009A                                                   48795990
.L0099   ANOP                                                           49095980
SMF99_AS_ESP_MAP DSECT                                                  49579000
.L009A   ANOP                                                           49641990
SMF99_AS_ESP_ANAM DS 1CL0008 IRASMF99.1530: Address space name          49665000
SMF99_AS_ESP_AP DS 1FL1  IRASMF99.1536: expanded storage access policy *49708000
                         for demand                                     49751000
SMF99_AS_ESP_VP DS 1FL1  IRASMF99.275: expanded storage access policy  *49794000
                         for VIO                                        49837000
SMF99_AS_ESP_HP DS 1FL1  IRASMF99.279: expanded storage access policy  *49880000
                         for hiperspace                                 49923000
SMF99_AS_ESP_ASID DS 1BL2 IRASMF99.2852: Address Space ID number        49944500
SMF99_AS_ESP_FLAGS DS 0BL1 IRASMF99.5692: Flags                         49946770
SMF99_AS_STG_PROTECTED_NOW EQU X'80' IRASMF99.5698: Storage is         *49946870
                         protected at this instant                      49946960
SMF99_AS_STGCRIT_EXPLICIT EQU X'40' IRASMF99.5704: Storage protected   *49947050
                         assigned to space by classification rule       49947140
SMF99_AS_MANAGED_TO_REGION_GOALS EQU X'20' IRASMF99.5710: Address      *49947230
                         space is currently manged to region's goal    *49947320
                         rather than transaction server's goal          49947410
         ORG   SMF99_AS_ESP_FLAGS+X'00000001'                           49947500
         DS    1BL2      IRASMF99.1328: Reserved                        49947590
SMF99_AS_ESP_CS_FMCT DS 1FL4 IRASMF99.1334: Number of central storage  *49948700
                         frames the address spaces owns                 49950800
SMF99_AS_ESP_ES_FMCT DS 1FL4 IRASMF99.1337: Number of expanded storage *49952900
                         frames the address spaces owns                 49955000
SMF99_AS_ESP_PPS_TAR DS 1FL4 IRASMF99.1343: Address space protective   *49957100
                         process storage target. Note see subtype 5    *49959200
                         for other targets. This is the only target    *49961300
                         non-monitor address spaces can have.           49963400
SMF99_AS_ESP_MAP_LEN EQU *-SMF99_AS_ESP_MAP                             49966000
.L0098   ANOP                                                           50028990
*                                                                       50052000
*    *****************************************************************  50095000
*    *                                                               *  50138000
*    * IRASMF99.2233: SMF99 subtype 1, 3, and 5 - map to format      *  50181000
*    * points on a plot with one curve BASED(addr(smf_hdr_MAP) +     *  50224000
*    * smf99_pprp_points_of or smf99_mplp_points_of or               *  50267000
*    * smf99_swpp_points_of or smf99_pasp_points_of or               *  50310000
*    * smf99_ruap_points_of or smf99_pagp_points_of or               *  50353000
*    *                                                               *  50396000
*    *****************************************************************  50439000
*                                                                       50482000
*                                                                       50525000
         AIF   ('&SMF99_ONE_CURVE_POINT_MAP' EQ 'NO').L009B             50597990
         AIF   ('&DSECT' EQ 'YES').L009C                                50627980
         AIF   ('&SMF99_ONE_CURVE_POINT_MAP' NE 'YES').L009B            50657970
SMF99_ONE_CURVE_POINT_MAP DS 0F                                         50697000
         AGO   .L009D                                                   50759990
.L009C   ANOP                                                           50779980
SMF99_ONE_CURVE_POINT_MAP DSECT                                         50826000
.L009D   ANOP                                                           50888990
SMF99_PLOT_XVAL DS 1FL4  SRMBPLOT.1177: X value of point plotted in a  *50912000
                         bucket                                         50955000
SMF99_PLOT_YVAL DS 1FL4  SRMBPLOT.1186: Y value of point plotted in a  *50998000
                         bucket                                         51041000
SMF99_ONE_CURVE_POINT_MAP_LEN EQU *-SMF99_ONE_CURVE_POINT_MAP           51084000
.L009B   ANOP                                                           51146990
*                                                                       51170000
*    *****************************************************************  51213000
*    *                                                               *  51256000
*    * IRASMF99.2855: SMF99 subtype 3 - map to format points on a    *  51258900
*    * plot with two curves                                             51261800
*    * BASED(addr(smf_hdr_MAP) + smf99_ains_points_of or             *  51264700
*    * smf99_tins_points_of or                                       *  51267600
*    *                                                               *  51270500
*    *****************************************************************  51273400
*                                                                       51276300
*                                                                       51279200
         AIF   ('&SMF99_TWO_CURVE_POINT_MAP' EQ 'NO').L009E             51284090
         AIF   ('&DSECT' EQ 'YES').L009F                                51286080
         AIF   ('&SMF99_TWO_CURVE_POINT_MAP' NE 'YES').L009E            51288070
SMF99_TWO_CURVE_POINT_MAP DS 0F                                         51290800
         AGO   .L00A0                                                   51294690
.L009F   ANOP                                                           51295680
SMF99_TWO_CURVE_POINT_MAP DSECT                                         51299500
.L00A0   ANOP                                                           51303390
SMF99_2PLOT_XVAL DS 1FL4 SRMPLOT.7373: X value of point plotted in a   *51305300
                         bucket                                         51308200
SMF99_2PLOT_Y1VAL DS 1FL4 SRMPLOT.7258: Y value of point plotted on    *51311100
                         first curve                                    51314000
SMF99_2PLOT_Y2VAL DS 1FL4 SRMPLOT.6735: Y value of point plotted on    *51316900
                         second curve                                   51319800
SMF99_TWO_CURVE_POINT_MAP_LEN EQU *-SMF99_TWO_CURVE_POINT_MAP           51322700
.L009E   ANOP                                                           51326590
*                                                                       51328500
*    *****************************************************************  51331400
*    *                                                               *  51334300
*    * IRASMF99.4321: SMF99 subtype 5 - map to format points on a    *  51337200
*    * plot with three curves BASED(addr(smf_hdr_MAP) +              *  51342000
*    * smf99_pplt_points_of or smf99_cplt_points_of or               *  51385000
*    *                                                               *  51428000
*    *****************************************************************  51471000
*                                                                       51514000
*                                                                       51557000
         AIF   ('&SMF99_THREE_CURVE_POINT_MAP' EQ 'NO').L00A1           51629990
         AIF   ('&DSECT' EQ 'YES').L00A2                                51659980
         AIF   ('&SMF99_THREE_CURVE_POINT_MAP' NE 'YES').L00A1          51689970
SMF99_THREE_CURVE_POINT_MAP DS 0F                                       51729000
         AGO   .L00A3                                                   51791990
.L00A2   ANOP                                                           51811980
SMF99_THREE_CURVE_POINT_MAP DSECT                                       51858000
.L00A3   ANOP                                                           51920990
SMF99_3PLOT_XVAL DS 1FL4 SRMPLOT.5692: X value of point plotted in a   *51944000
                         bucket                                         51987000
SMF99_3PLOT_Y1VAL DS 1FL4 SRMPLOT.5698: Y value of point plotted on    *52030000
                         first curve                                    52073000
SMF99_3PLOT_Y2VAL DS 1FL4 SRMPLOT.7753: Y value of point plotted on    *52116000
                         second curve                                   52159000
SMF99_3PLOT_Y3VAL DS 1FL4 SRMPLOT.7759: Y value of point plotted on    *52202000
                         third curve                                    52245000
SMF99_THREE_CURVE_POINT_MAP_LEN EQU *-SMF99_THREE_CURVE_POINT_MAP       52245100
.L00A1   ANOP                                                           52245240
*                                                                       52245300
*    *****************************************************************  52245400
*    *                                                               *  52245500
*    * IRASMF99.3994: SMF99 SUBTYPE 6 SERVER SECTION.                *  52245600
*    * BASED(ADDR(SMF_HDR_MAP) + SMF996_SERVER_DATA_OF). EACH SUBTYPE*  52245700
*    * 6 ENTRY ASSOCIATED WITH A SERVER PERIOD WILL HAVE A SERVER    *  52245800
*    * SECTION. THERE WILL BE ONE SERVER SECTION ENTRY FOR EACH      *  52245900
*    * DIFFERENT EXTERNAL SERVICE CLASSTHAT SERVER ADDRESS SPACES IN *  52246000
*    * THE SERVER PERIOD WERE ORIGINALLY CLASSIFIED TO.                 52246100
*    *                                                               *  52246200
*    *****************************************************************  52246300
*                                                                       52246400
*                                                                       52246500
         AIF   ('&SMF99_S6_SERVER_MAP' EQ 'NO').L00A4                   52246660
         AIF   ('&DSECT' EQ 'YES').L00A5                                52246720
         AIF   ('&SMF99_S6_SERVER_MAP' NE 'YES').L00A4                  52246780
SMF99_S6_SERVER_MAP DS 0F                                               52246900
         AGO   .L00A6                                                   52247050
.L00A5   ANOP                                                           52247100
SMF99_S6_SERVER_MAP DSECT                                               52247200
.L00A6   ANOP                                                           52247340
SMF99_S6_SERVER_CLASS_NAME DS 1CL0008 IRASMF99.3928: NAME OF SERVICE   *52247400
                         CLASS THAT AT LEAST ONE OF THE SERVER ADDRESS *52247500
                         SPACES IN THE SERVER PERIOD REPRESENTED BY    *52247600
                         THE SUBTYPE 6 ENTRY WAS ORIGINAL CLASSIFIED   *52247700
                         TO                                             52247800
SMF99_S6_SERVER_PER_NUM DS 1FL4 IRASMF99.3934: PERIOD NUMBER WITH IN   *52247900
                         CLASS                                          52248000
SMF99_S6_SERVER_MAP_LEN EQU *-SMF99_S6_SERVER_MAP                       52248100
.L00A4   ANOP                                                           52248240
*                                                                       52248300
*    *****************************************************************  52248400
*    *                                                               *  52248500
*    * IRASMF99.5444: SMF99 SUBTYPE 2 AND 8 I/O SUBSYSTEM SAMPLES    *  52248600
*    * DATA. SUBTYPE 2: BASED(ADDR(SMF_HDR_MAP) + SMF99_IOSUBSAMOF). *  52248700
*    * SUBTYPE 8: BASED(ADDR(SMF_HDR_MAP) +                          *  52248800
*    * SMF998_IOSUB_SAMPLES_DATA_OF).                                   52248900
*    *                                                               *  52249000
*    *****************************************************************  52249100
*                                                                       52249200
*                                                                       52249300
         AIF   ('&SMF99_IOSUB_SAMPLES_MAP' EQ 'NO').L00A7               52249460
         AIF   ('&DSECT' EQ 'YES').L00A8                                52249520
         AIF   ('&SMF99_IOSUB_SAMPLES_MAP' NE 'YES').L00A7              52249580
SMF99_IOSUB_SAMPLES_MAP DS 0H                                           52249700
         AGO   .L00A9                                                   52249850
.L00A8   ANOP                                                           52249900
SMF99_IOSUB_SAMPLES_MAP DSECT                                           52250000
.L00A9   ANOP                                                           52250140
SMF99_IOSUB_INDEX DS 1FL2 IRASMF99.5456: Subsystem index. This         *52250200
                         correlates with SMF999_IOSUB_INDEX.            52250300
SMF99_IOSUB_RESERVED DS 1FL2 IRASMF99.5437: Reserved                    52250400
SMF99_IOSUB_CONNECTSAMPLES DS 1FL2 IRASMF99.5431: Connect samples       52250500
SMF99_IOSUB_PENDINGSAMPLES DS 1FL2 IRASMF99.5462: Pending samples       52250600
*                                                                       52250700
*    *****************************************************************  52250800
*    *                                                               *  52250900
*    * IRASMF99.3339: Version 1 = MVS SP5.1.0                           52251000
*    *                                                               *  52251100
*    *****************************************************************  52251600
*                                                                       52252700
*                                                                       52253800
SMF99_VER1 EQU 61681                                                    52254900
*                                                                       52256000
*    *****************************************************************  52257100
*    *                                                               *  52258200
*    * IRASMF99.3357: Version 3 = OS/390 1.3.0                          52259300
*    *                                                               *  52260400
*    *****************************************************************  52261500
*                                                                       52262600
*                                                                       52263700
SMF99_VER3 EQU 61683                                                    52264800
*                                                                       52265900
*    *****************************************************************  52267000
*    *                                                               *  52268100
*    * IRASMF99.3366: Version 4 = OS/390 2.4.0                          52269200
*    *                                                               *  52270300
*    *****************************************************************  52271400
*                                                                       52272500
*                                                                       52273600
SMF99_VER4 EQU 61684                                                    52274700
*                                                                       52275800
*    *****************************************************************  52276900
*    *                                                               *  52278000
*    * IRASMF99.3954: Version 4 = OS/390 2.4.0 + OW29790             *  52278100
*    *                                                               *  52278200
*    *****************************************************************  52278300
*                                                                       52278400
*                                                                       52278500
SMF99_VER4A EQU 61685                                                   52278600
*                                                                       52278700
*    *****************************************************************  52278800
*    *                                                               *  52278900
*    * IRASMF99.3909: Version 6 = OS/390 2.6.0                          52279000
*    *                                                               *  52279100
*    *****************************************************************  52279200
*                                                                       52279300
*                                                                       52279400
SMF99_VER7 EQU 61687                                                    52279500
*                                                                       52279600
*    *****************************************************************  52279700
*    *                                                               *  52279800
*    * IRASMF99.4052: Version 9 = OS/390 2.7.0                          52279900
*    *                                                               *  52280000
*    *****************************************************************  52280100
*                                                                       52280200
*                                                                       52280300
SMF99_VER9 EQU 61689                                                    52280400
*                                                                       52280500
*    *****************************************************************  52280600
*    *                                                               *  52280700
*    * IRASMF99.4312: Version 12 = OS/390 Release 10                    52280800
*    *                                                               *  52280900
*    *****************************************************************  52281000
*                                                                       52281100
*                                                                       52281200
SMF99_VER12 EQU 61938                                                   52281300
*                                                                       52281400
*    *****************************************************************  52281500
*    *                                                               *  52281600
*    * IRASMF99.3375: Current version                                   52281700
*    *                                                               *  52281800
*    *****************************************************************  52281900
*                                                                       52282400
*                                                                       52283500
SMF99_CURRENT_VER EQU 61938                                             52295200
*                                                                       52306900
*    *****************************************************************  52307700
*    *                                                               *  52308500
*    * IRASMF99.4490: original version                               *  52309300
*    *                                                               *  52310100
*    *****************************************************************  52310900
*                                                                       52311700
*                                                                       52312500
SMF99V2_VER0 EQU 0                                                      52313300
*                                                                       52314100
*    *****************************************************************  52314900
*    *                                                               *  52315700
*    * IRASMF99.4499: Records with OW37216                           *  52316500
*    *                                                               *  52317300
*    *****************************************************************  52318100
*                                                                       52318900
*                                                                       52319700
SMF99V2_VER1 EQU 1                                                      52320500
*                                                                       52321300
*    *****************************************************************  52322100
*    *                                                               *  52322900
*    * IRASMF99.4508: Records with queue service time plot              52324280
*    *                                                               *  52324500
*    *****************************************************************  52325300
*                                                                       52326100
*                                                                       52326900
SMF99V2_VER2 EQU 2                                                      52328690
*                                                                       52329680
*    *****************************************************************  52330670
*    *                                                               *  52331660
*    * IRASMF99.5740: GMI support                                       52333040
*    *                                                               *  52333640
*    *****************************************************************  52334630
*                                                                       52335620
*                                                                       52336610
SMF99V3_VER3 EQU 3                                                      52338090
*                                                                       52338580
*    *****************************************************************  52339070
*    *                                                               *  52339560
*    * IRASMF99.5749: Current version 2                                 52340050
*    *                                                               *  52340540
*    *****************************************************************  52341030
*                                                                       52341520
*                                                                       52342010
SMF99V2_CURRENT_VER EQU 3                                               52342500
SMF99_IOSUB_SAMPLES_MAP_LEN EQU *-SMF99_IOSUB_SAMPLES_MAP               52343100
.L00A7   ANOP                                                           52365490
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 52374000
         AIF   ('&LIST' EQ 'YES').P4                                    52417000
.P3      ANOP                                                           52460000
         POP   PRINT                                                    52503000
.P4      ANOP                                                           52546000
.P_EXIT  ANOP                                                           52589000
         MEND                                                           52632000
**/ IRASMF99_2:;                                                        52675000
* %IRASMF99_INCLUDED = 'YES';                                           52718000
* %DCL ZCBPRINT CHAR EXT;                                               52761000
* %DEACTIVATE ZCBPRINT;                                                 52804000
* %DCL IRASMF99_LIST CHAR EXT;                                          52847000
* %DEACTIVATE IRASMF99_LIST;                                            52890000
* %IF IRASMF99_LIST ~= 'NO' &                                           52933000
*    ZCBPRINT ~= 'NO' %THEN                                             52976000
*   %GOTO IRASMF99_3;                                                   53019000
*   @LIST PUSH NOECHO;                                                  53062000
*   @LIST NOASSEMBLE NOECHO;                                            53105000
*   @LIST OFF C NOECHO;                                                 53148000
* %IRASMF99_3:;                                                         53191000
*/* Start of PL/X Source                                             */ 53234000
*                                                                       53277000
*   /*****************************************************************/ 53320000
*   /*                                                               */ 53363000
*   /* IRASMF99.799: SMF Type 99 record - These records contain      */ 53406000
*   /* information about the state of the system and the workload    */ 53449000
*   /* that is executing on it.                                      */ 53499000
*   /*                                                               */ 54008000
*   /*****************************************************************/ 54051000
*                                                                       54094000
*   DECLARE                                                             54137000
*     1    SMF_HDR_MAP BASED(*) BDY(WORD),                              54180000
*      2    SMF99_RDW,              /* IRASMF99.3028: Record            54223000
*                                      descriptor word               */ 54266000
*       3    SMF99LEN FIXED(15),    /* IRASMF99.3031: Record Length.    54309000
*                                      This field and the next field    54352000
*                                      (total of four bytes) form the   54395000
*                                      RDW (record descriptor word). */ 54438000
*       3    SMF99SEG FIXED(15),    /* IRASMF99.3037: Segment           54481000
*                                      descriptor (see record length    54524000
*                                      field)                        */ 54567000
*      2    SMF99FLG BIT(8),        /* IRASMF99.3043: System            54610000
*                                      indicator: Bit 0 reserved, Bit   54653000
*                                      1 subtypes utilized, Bit 2       54696000
*                                      reserved, Bits 3 -6 version      54739000
*                                      indicators, Bit 7 reserved    */ 54782000
*       3    *        BIT(1),       /* IRASMF99.3049: reserved       */ 54825000
*       3    SMF99STU BIT(1),       /* IRASMF99.3055: Subtypes          54868000
*                                      utilized                      */ 54911000
*       3    *        BIT(6),       /* IRASMF99.3061: stuff          */ 54954000
*      2    SMF99RTY FIXED(8),      /* IRASMF99.3067: Record type 99 */ 54997000
*      2    SMF99TME FIXED(31) BDY(HWORD), /* IRASMF99.2942: Time       55040000
*                                      since midnight, in hundreths     55083000
*                                      of a second, that the record     55126000
*                                      was moved into the SMF buffer */ 55169000
*      2    SMF99DTE CHAR(4),       /* IRASMF99.293: Date when the      55212000
*                                      record was moved into the SMF    55255000
*                                      buffer, in the form 0cyydddF. */ 55298000
*      2    SMF99SID CHAR(4),       /* IRASMF99.317: System             55341000
*                                      identification (from the SID     55384000
*                                      parameter).                   */ 55427000
*      2    SMF99SSID CHAR(4),      /* IRASMF99.323: Sub System         55470000
*                                      Identification                */ 55513000
*      2    SMF99TID FIXED(15),     /* IRASMF99.416: Record subtype     55556000
*                                      (must be at offset '16'X)     */ 55599000
*      2    SMF99_SDEF_LEN FIXED(32); /* IRASMF99.373: Length of self   55642000
*                                      definition section            */ 55685000
*                                                                       55728000
*   /*****************************************************************/ 55771000
*   /*                                                               */ 55814000
*   /* IRASMF99.805: SMF self definining section                     */ 55857000
*   /* BASED(addr(smf_hdr_MAP) + length(smf_hdr_MAP))                */ 55900000
*   /*                                                               */ 55943000
*   /*****************************************************************/ 55986000
*                                                                       56029000
*   DECLARE                                                             56072000
*     1    SMF99_SDEF_MAP BASED(*) BDY(WORD),                           56115000
*      2    SMF99POF FIXED(32),     /* IRASMF99.12: Offset to the       56158000
*                                      product section from the         56201000
*                                      beginning of the record          56244000
*                                      (including RDW)               */ 56287000
*      2    SMF99PLN FIXED(16),     /* IRASMF99.18: Length of the       56330000
*                                      product section               */ 56373000
*      2    SMF99PON FIXED(16),     /* IRASMF99.24: Number of product   56416000
*                                      sections                      */ 56459000
*      2    SMF99DOF FIXED(32),     /* IRASMF99.2312: Offset to the     56502000
*                                      data section from the            56545000
*                                      beginning of the record          56588000
*                                      (including RDW).              */ 56631000
*      2    SMF99DLN FIXED(16),     /* IRASMF99.2317: Length of the     56674000
*                                      data section                  */ 56717000
*      2    SMF99DON FIXED(16);     /* IRASMF99.2329: Number of data    56760000
*                                      sections                      */ 56803000
*                                                                       56846000
*   /*****************************************************************/ 56889000
*   /*                                                               */ 56932000
*   /* IRASMF99.810: SMF99 product information                       */ 56975000
*   /* BASED(addr(smf_hdr_MAP) + smf99pof)                           */ 57018000
*   /*                                                               */ 57061000
*   /*****************************************************************/ 57104000
*                                                                       57147000
*   DECLARE                                                             57190000
*     1    SMF99_PRODUCT_MAP BASED(*) BDY(WORD),                        57233000
*      2    SMF99VN2 FIXED(16),     /* IRASMF99.51: Record sub          57250200
*                                      version. Use to identify         57267400
*                                      changes to the record in the     57284600
*                                      service stream        @OW37216*/ 57301800
*      2    SMF99RVN FIXED(16),     /* IRASMF99.57: Record Version      57319000
*                                      Number                        */ 57362000
*      2    SMF99PNM CHAR(8),       /* IRASMF99.2874: Product Name -    57405000
*                                      SRM                           */ 57448000
*      2    SMF99SLV CHAR(8),       /* IRASMF99.63: System level from   57491000
*                                      which record was cut (copied     57534000
*                                      from CVTPRODN)                */ 57577000
*      2    SMF99SNM CHAR(8);       /* IRASMF99.2287: System name       57620000
*                                      from which record was cut        57663000
*                                      (copied from CVTSNAME)        */ 57706000
*                                                                       57749000
*   /*****************************************************************/ 57792000
*   /*                                                               */ 57835000
*   /* IRASMF99.2959: SMF99 subtype 1 self defining section          */ 57878000
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                           */ 57921000
*   /*                                                               */ 57964000
*   /*****************************************************************/ 58007000
*                                                                       58050000
*   DECLARE                                                             58093000
*     1    SMF99_S1_SDEF_MAP BASED(*) BDY(WORD),                        58136000
*      2    SMF99TOF FIXED(32),     /* IRASMF99.349: Offset to the      58179000
*                                      trace section from the           58222000
*                                      beginning of the record          58265000
*                                      (including RDW).              */ 58308000
*      2    SMF99TLN FIXED(16),     /* IRASMF99.355: Length of the      58351000
*                                      trace section                 */ 58394000
*      2    SMF99TON FIXED(16),     /* IRASMF99.361: Number of trace    58437000
*                                      sections                      */ 58480000
*      2    SMF99SSOF FIXED(32),    /* IRASMF99.367: Offset to the      58523000
*                                      System state section from the    58566000
*                                      beginning of the record          58609000
*                                      (including RDW).              */ 58652000
*      2    SMF99SSLN FIXED(16),    /* IRASMF99.409: Length of the      58695000
*                                      System state section          */ 58738000
*      2    SMF99SSON FIXED(16),    /* IRASMF99.394: Number of system   58781000
*                                      state sections                */ 58824000
*      2    SMF99PPOF FIXED(32),    /* IRASMF99.71: Offset to the       58867000
*                                      Paging plot section from the     58910000
*                                      beginning of the record          58953000
*                                      (including RDW).              */ 58996000
*      2    SMF99PPLN FIXED(16),    /* IRASMF99.377: Length of the      59039000
*                                      Paging plot section           */ 59082000
*      2    SMF99PPON FIXED(16),    /* IRASMF99.79: Number of paging    59125000
*                                      plot sections                 */ 59168000
*      2    SMF99PTOF FIXED(32),    /* IRASMF99.462: Offset to the      59211000
*                                      Priority table section from      59254000
*                                      the beginning of the record      59297000
*                                      (including RDW).              */ 59340000
*      2    SMF99PTLN FIXED(16),    /* IRASMF99.468: Length of the      59383000
*                                      Priority table section        */ 59426000
*      2    SMF99PTON FIXED(16),    /* IRASMF99.2275: Number of         59469000
*                                      Priority table sections       */ 59512000
*      2    SMF99RGOF FIXED(32),    /* IRASMF99.2285: Offset to the     59555000
*                                      Resource Group section from      59598000
*                                      the beginning of the record      59641000
*                                      (including RDW).              */ 59684000
*      2    SMF99RGLN FIXED(16),    /* IRASMF99.499: Length of the      59727000
*                                      resource group section        */ 59770000
*      2    SMF99RGON FIXED(16),    /* IRASMF99.505: Number of          59813000
*                                      resource group sections       */ 59856000
*      2    SMF99GROF FIXED(32),    /* IRASMF99.3268: Offset to the     59860700
*                                      generic resouce section from     59865400
*                                      the beginning of the record      59870100
*                                      (including RDW).              */ 59874800
*      2    SMF99GRLN FIXED(16),    /* IRASMF99.3274: Length of the     59879500
*                                      generic resource section      */ 59884200
*      2    SMF99GRON FIXED(16);    /* IRASMF99.3280: Number of         59888900
*                                      generic resource sections     */ 59893600
*                                                                       59899000
*   /*****************************************************************/ 59942000
*   /*                                                               */ 59985000
*   /* IRASMF99.2967: SMF99 subtype 1 trace table entry - The trace  */ 60028000
*   /* table contains information about the policy and resource      */ 60071000
*   /* adjustment decisions made during the last policy interval.    */ 60114000
*   /* BASED(addr(smf_hdr_MAP) + smf99tof)                           */ 60157000
*   /*                                                               */ 60200000
*   /*****************************************************************/ 60243000
*                                                                       60286000
*   DECLARE                                                             60329000
*     1    SMF99_S1_AAT_MAP BASED(*) BDY(WORD),                         60372000
*      2    SMF99_TPID FIXED(8),    /* IRASMF99.534: Policy             60415000
*                                      adjustment interval identifier*/ 60458000
*      2    SMF99_TRID FIXED(8),    /* IRASMF99.540: Resource           60501000
*                                      adjustment interval identifier*/ 60544000
*      2    SMF99_TCOD FIXED(16),   /* IRASMF99.551: Policy             60587000
*                                      adjustment action code        */ 60630000
*      2    SMF99_TJOB CHAR(8),     /* IRASMF99.484: Job name of        60673000
*                                      address space effected by        60716000
*                                      action being traced (blank if    60759000
*                                      not an address space level       60802000
*                                      action)                       */ 60845000
*      2    SMF99_TLPI FIXED(31),   /* IRASMF99.490: Projected local    60888000
*                                      performance index to be          60931000
*                                      acheived as a result of the      60974000
*                                      traced action                 */ 61017000
*      2    SMF99_TSPI FIXED(31),   /* IRASMF99.496: Projected          61060000
*                                      sysplex performance index to     61103000
*                                      be acheived as a result of the   61146000
*                                      traced action                 */ 61189000
*      2    SMF99_TGSR FIXED(31),   /* IRASMF99.2335: Projected         61232000
*                                      resource group service rate be   61275000
*                                      acheived as a result of the      61318000
*                                      traced action                 */ 61361000
*      2    SMF99_TDT1 FIXED(31),   /* IRASMF99.385: System use      */ 61404000
*      2    SMF99_TDT2 FIXED(31),   /* IRASMF99.478: System use      */ 61447000
*      2    SMF99_TDT3 FIXED(31),   /* IRASMF99.89: System use       */ 61490000
*      2    SMF99_TRGN CHAR(8),     /* IRASMF99.2548: Resource group    61533000
*                                      Name (blank if no resource       61576000
*                                      group)                        */ 61619000
*      2    SMF99_TCNM CHAR(8),     /* IRASMF99.2608: Service Class     61662000
*                                      Name                          */ 61705000
*      2    SMF99_TPER FIXED(16),   /* IRASMF99.2612: Service period    61748000
*                                      number                        */ 61791000
*      2    SMF99_TASID BIT(16);    /* IRASMF99.1503: Address Space     61805300
*                                      ID number                 @P9A*/ 61819600
*                                                                       61834000
*   /*****************************************************************/ 61877000
*   /*                                                               */ 61920000
*   /* IRASMF99.2291: SMF99 subtype 1 System State information -     */ 61963000
*   /* Contains information about the general state of the system.   */ 62006000
*   /* BASED(addr(smf_hdr_MAP) + smf99ssof)                          */ 62049000
*   /*                                                               */ 62092000
*   /*****************************************************************/ 62135000
*                                                                       62178000
*   DECLARE                                                             62221000
*     1    SMF99_S1_SS_MAP BASED(*) BDY(WORD),                          62264000
*      2    SMF99_CPUA FIXED(16),   /* IRASMF99.110: Average            62307000
*                                      Processor Utilization scaled     62350000
*                                      by 16                         */ 62393000
*      2    SMF99_UMP FIXED(15),    /* IRASMF99.116: Recent unmanaged   62436000
*                                      paging and swap cost             62479000
*                                      percentage                    */ 62522000
*      2    SMF99_UIC1 FIXED(31),   /* IRASMF99.122: Frames in uic      62565000
*                                      bucket 1 - The central and       62608000
*                                      expanded UIC buckets contain a   62651000
*                                      count of frames that have not    62694000
*                                      been referenced for specified    62737000
*                                      periods of time. So, UIC         62780000
*                                      bucket 1 is a count of the       62823000
*                                      frames that have most recently   62866000
*                                      been referenced, where bucket    62909000
*                                      4 contains a count of the        62952000
*                                      frames that have not been        62995000
*                                      referenced in a long time. The   63038000
*                                      UIC delimiter values specify     63081000
*                                      the cutoff points for each       63124000
*                                      bucket . For                     63167000
*                                      example,SMF99_EUIC3 will         63210000
*                                      contain the count of all the     63253000
*                                      expanded storage frames whose    63296000
*                                      time since they were last        63339000
*                                      referenced is between            63382000
*                                      SMF99_ESTB2 and SMF99_ESTB3.  */ 63425000
*      2    SMF99_UIC2 FIXED(31),   /* IRASMF99.531: Frames in uic      63468000
*                                      bucket 2                      */ 63511000
*      2    SMF99_UIC3 FIXED(31),   /* IRASMF99.519: Frames in uic      63554000
*                                      bucket 3                      */ 63597000
*      2    SMF99_UIC4 FIXED(31),   /* IRASMF99.667: Frames in uic      63640000
*                                      bucket 4                      */ 63683000
*      2    SMF99_EUIC1 FIXED(31),  /* IRASMF99.675: Frames in          63726000
*                                      Expanded uic bucket 1         */ 63769000
*      2    SMF99_EUIC2 FIXED(31),  /* IRASMF99.2835: Frames in         63812000
*                                      Expanded uic bucket 2         */ 63855000
*      2    SMF99_EUIC3 FIXED(31),  /* IRASMF99.2635: Frames in         63898000
*                                      Expanded uic bucket 3         */ 63941000
*      2    SMF99_EUIC4 FIXED(31),  /* IRASMF99.759: Frames in          63984000
*                                      Expanded uic bucket 4         */ 64027000
*      2    SMF99_FRV1 FIXED(15),   /* IRASMF99.2872: UIC delimiter     64070000
*                                      value 1                       */ 64113000
*      2    SMF99_FRV2 FIXED(15),   /* IRASMF99.2849: UIC delimiter     64156000
*                                      value 2                       */ 64199000
*      2    SMF99_FRV3 FIXED(15),   /* IRASMF99.128: UIC delimiter      64242000
*                                      value 3                       */ 64285000
*      2    SMF99_ESTB1 FIXED(15),  /* IRASMF99.679: expanded storage   64328000
*                                      UIC delimiter value 1         */ 64371000
*      2    SMF99_ESTB2 FIXED(15),  /* IRASMF99.660: expanded storage   64414000
*                                      UIC delimiter value 2         */ 64457000
*      2    SMF99_ESTB3 FIXED(15),  /* IRASMF99.685: expanded storage   64500000
*                                      UIC delimiter value 3         */ 64543000
*      2    SMF99_W2MIG FIXED(32),  /* IRASMF99.808: Write to migrate   64586000
*                                      percentage                    */ 64629000
*      2    SMF99_PTAVAIL FIXED(31), /* IRASMF99.967: Total processor   64672000
*                                      time available, including        64715000
*                                      captured time plus wait time  */ 64758000
*      2    SMF99_SHORT_FLAGS,      /* IRASMF99.2515: shortage flags */ 64808000
*       3    SMF99_SHORT BIT(1),    /* IRASMF99.1443: Real storage      64887000
*                                      shortage exists               */ 64930000
*       3    SMF99_ASM1 BIT(1),     /* IRASMF99.2602: First level Aux   64973000
*                                      shortage exists               */ 65016000
*       3    SMF99_AMS2 BIT(1),     /* IRASMF99.2535: Critical Aux      65059000
*                                      shortage exists               */ 65102000
*       3    SMF99_SQA1 BIT(1),     /* IRASMF99.2538: First level SQA   65145000
*                                      shortage exists               */ 65188000
*       3    SMF99_SQA2 BIT(1),     /* IRASMF99.2541: Critical SQA      65231000
*                                      shortage exists               */ 65274000
*       3    *        BIT(3),       /* IRASMF99.2524: reserved       */ 65317000
*      2    *        CHAR(1),       /* IRASMF99.2544: Reserved   @L1A*/ 65327700
*      2    SMF99_TOTAL_PAG_COST FIXED(15), /* IRASMF99.3103: Recent    65338400
*                                      total paging and swap cost       65349100
*                                      percentage * 10       @OW21214*/ 65359800
*      2    SMF99_CPPS FIXED(31),   /* IRASMF99.1631: Common            65370700
*                                      protective processor storage     65381400
*                                      target in frames @P5          */ 65392100
*      2    SMF99_ILSU_ARRAY,       /* IRASMF99.2566: Array of          65403000
*                                      Importance Level Service         65446000
*                                      Units. The first entry           65489000
*                                      contains Service Units           65532000
*                                      pertaining to Importance Level   65575000
*                                      0, the second entry contains     65618000
*                                      Service Units pertaining to      65661000
*                                      Importance Level 1, and so on.   65704000
*                                      The last entry contains          65747000
*                                      Service Units pertaining to      65790000
*                                      unused Service.           @L1A*/ 65833000
*       3    SMF99_ILSU_ENTRY(0:7) FIXED(31), /* IRASMF99.2559: A       65876000
*                                      single entry in the array of     65919000
*                                      Importance Level Service         65962000
*                                      Units, containing the number     66005000
*                                      of Service Units consumed by     66048000
*                                      work at this Importance Level    66091000
*                                      (or unused) over the last ten    66134000
*                                      seconds. The entries are         66177000
*                                      indexed with an origin of zero   66220000
*                                      so that the index matches the    66263000
*                                      Importance Level to which the    66306000
*                                      entry pertains.           @L1A*/ 66349000
*      2    SMF99_SUIC1 FIXED(31),  /* IRASMF99.1576: Shared central    66392000
*                                      UIC bucket 1, measured in        66435000
*                                      frame counts              @L2A*/ 66478000
*      2    SMF99_SUIC2 FIXED(31),  /* IRASMF99.1582: Shared central    66521000
*                                      UIC bucket 2, measured in        66564000
*                                      frame counts              @L2A*/ 66607000
*      2    SMF99_SUIC3 FIXED(31),  /* IRASMF99.1588: Shared central    66650000
*                                      UIC bucket 3, measured in        66693000
*                                      frame counts              @L2A*/ 66736000
*      2    SMF99_SUIC4 FIXED(31),  /* IRASMF99.1594: Shared central    66779000
*                                      UIC bucket 4, measured in        66822000
*                                      frame counts              @L2A*/ 66865000
*      2    SMF99_SEUC1 FIXED(31),  /* IRASMF99.1600: Shared expanded   66908000
*                                      UIC bucket 1, measured in        66951000
*                                      frame counts              @L2A*/ 66994000
*      2    SMF99_SEUC2 FIXED(31),  /* IRASMF99.1606: Shared expanded   67037000
*                                      UIC bucket 2, measured in        67080000
*                                      frame counts              @L2A*/ 67123000
*      2    SMF99_SEUC3 FIXED(31),  /* IRASMF99.1612: Shared expanded   67166000
*                                      UIC bucket 3, measured in        67209000
*                                      frame counts              @L2A*/ 67252000
*      2    SMF99_SEUC4 FIXED(31),  /* IRASMF99.1618: Shared expanded   67295000
*                                      UIC bucket 4, measured in        67338000
*                                      frame counts              @L2A*/ 67381000
*      2    SMF99_STWSS FIXED(31),  /* IRASMF99.1624: Protective        67424000
*                                      processor storage target for     67467000
*                                      shared area, measured in frame   67510000
*                                      counts                    @L2A*/ 67553000
*      2    SMF99_NUM_EXT_SC FIXED(32); /* IRASMF99.3746: Number of     67563700
*                                      external service classes         67574400
*                                                            @WLMCTAL*/ 67585100
*                                                                       67596000
*   /*****************************************************************/ 67639000
*   /*                                                               */ 67682000
*   /* IRASMF99.2301: SMF99 subtype 1 Paging plot information -      */ 67725000
*   /* Contains the information plotted on the system paging         */ 67768000
*   /* responsivness plot. BASED(addr(smf_hdr_MAP) + smf99ppof)      */ 67811000
*   /*                                                               */ 67854000
*   /*****************************************************************/ 67897000
*                                                                       67940000
*   DECLARE                                                             67983000
*     1    SMF99_S1_PP_MAP BASED(*) BDY(WORD),                          68026000
*      2    SMF99_PAGP_BW FIXED(32), /* SRMPLOT.6805: Bucket width   */ 68069000
*      2    SMF99_PAGP_LSTX FIXED(32), /* SRMPLOT.6513: Last plotted    68112000
*                                      x bucket                      */ 68155000
*      2    *        FIXED(32),     /* SRMPLOT.7167: Reserved        */ 68205000
*      2    SMF99_PAGP_POINTS_OF FIXED(32), /* SRMPLOT.6666: Offset     68284000
*                                      of point entries              */ 68327000
*      2    SMF99_PAGP_POINTS_ON FIXED(16), /* SRMPLOT.6663: Number     68370000
*                                      of point entries              */ 68413000
*      2    SMF99_PAGP_POINTS_LN FIXED(16); /* SRMPLOT.7503: Length     68456000
*                                      of a point entry              */ 68499000
*                                                                       68542000
*   /*****************************************************************/ 68585000
*   /*                                                               */ 68628000
*   /* IRASMF99.2303: SMF99 subtype 1 Priority table entry - Contains*/ 68671000
*   /* information pertaining to the demand being put on the         */ 68714000
*   /* processor by work at different dispatch priorities.           */ 68757000
*   /* BASED(addr(smf_hdr_MAP) + smf99ptof)                          */ 68800000
*   /*                                                               */ 68843000
*   /*****************************************************************/ 68886000
*                                                                       68929000
*   DECLARE                                                             68972000
*     1    SMF99_S1_PT_MAP BASED(*) BDY(WORD),                          69015000
*      2    SMF99_PTPRTY FIXED(15), /* IRASMF99.2586: Dispatch          69058000
*                                      priority                      */ 69101000
*      2    SMF99_PTNP FIXED(16),   /* IRASMF99.2587: New dispatch      69144000
*                                      priority (zero if not changed)*/ 69187000
*      2    SMF99_PTIMDP FIXED(31), /* IRASMF99.2593: initial maximum   69230000
*                                      percentage of processor          69273000
*                                      demanded at priority, initial    69316000
*                                      value before any priority        69359000
*                                      moves or slice changes        */ 69402000
*      2    SMF99_PTPMDP FIXED(31), /* IRASMF99.2659: projected         69445000
*                                      maximum percentage of            69488000
*                                      processor demanded at priority*/ 69531000
*      2    SMF99_PTCPUU FIXED(31), /* IRASMF99.1445: cpu using         69574000
*                                      samples at priority           */ 69617000
*      2    SMF99_PTCPUD FIXED(31), /* IRASMF99.1449: cpu delay         69660000
*                                      samples at priority           */ 69703000
*      2    SMF99_PTW2UR FIXED(31), /* IRASMF99.2503: wait-to-using     69746000
*                                      ratio at priority (*16)       */ 69789000
*      2    SMF99_PTAPU FIXED(31),  /* IRASMF99.2506: actual measured   69832000
*                                      processor used at priority    */ 69875000
*      2    SMF99_PTPPU FIXED(31),  /* IRASMF99.2509: projected         69918000
*                                      processor time to be used at     69961000
*                                      priority                      */ 70004000
*      2    SMF99_PTACMD FIXED(31), /* IRASMF99.2512: achievable        70047000
*                                      cumulative max demand for        70090000
*                                      priorities affected by a move */ 70133000
*      2    *        FIXED(31),     /* IRASMF99.1433: reserved       */ 70176000
*      2    SMF99_PTIMAXD FIXED(31), /* IRASMF99.694: initial           70219000
*                                      cumulative maximum demand     */ 70262000
*      2    SMF99_PTWMAXD FIXED(31), /* IRASMF99.700: Projected         70305000
*                                      cumulative maximum demand     */ 70348000
*      2    SMF99_PTIAMTW FIXED(31), /* IRASMF99.706: initial average   70391000
*                                      mean time to wait             */ 70434000
*      2    SMF99_PTWAMTW FIXED(31); /* IRASMF99.709: Projected         70477000
*                                      average mean time to wait     */ 70520000
*                                                                       70563000
*   /*****************************************************************/ 70606000
*   /*                                                               */ 70649000
*   /* IRASMF99.2328: SMF99 subtype 1 Resource Group entry - Contains*/ 70692000
*   /* information about resource groups. BASED(addr(smf_hdr_MAP) +  */ 70735000
*   /* smf99rgof)                                                    */ 70778000
*   /*                                                               */ 70821000
*   /*****************************************************************/ 70864000
*                                                                       70907000
*   DECLARE                                                             70950000
*     1    SMF99_S1_RG_MAP BASED(*) BDY(WORD),                          70993000
*      2    SMF99_RGNAME CHAR(8),   /* IRASMF99.727: name            */ 71036000
*      2    SMF99_MIN_SR FIXED(31), /* IRASMF99.341: Minimum service    71079000
*                                      rate for the group            */ 71122000
*      2    SMF99_MAX_SR FIXED(31), /* IRASMF99.134: Maximum service    71165000
*                                      rate for the group (FFFFFFFF     71208000
*                                      if not specified in the          71251000
*                                      policy)                       */ 71294000
*      2    SMF99_ACT_SR FIXED(31), /* IRASMF99.140: Service rate       71337000
*                                      received in last interval on     71380000
*                                      the local system              */ 71423000
*      2    SMF99_SPAS FIXED(31),   /* IRASMF99.146: service per        71466000
*                                      awake slice                   */ 71509000
*      2    SMF99_SLICES FIXED(15), /* IRASMF99.1194: Number of time    71552000
*                                      slices that work in this group   71595000
*                                      was capped                    */ 71638000
*      2    SMF99_RHELPCNT0 FIXED(15), /* IRASMF99.994: a count of      71681000
*                                      the remote systems that can      71724000
*                                      help work at importance 0     */ 71767000
*      2    SMF99_RHELPCNT1 FIXED(15), /* IRASMF99.1150: a count of     71810000
*                                      the remote systems that can      71853000
*                                      help work at importance 1     */ 71896000
*      2    SMF99_RHELPCNT2 FIXED(15), /* IRASMF99.1156: a count of     71939000
*                                      the remote systems that can      71982000
*                                      help work at importance 2     */ 72025000
*      2    SMF99_RHELPCNT3 FIXED(15), /* IRASMF99.2243: a count of     72068000
*                                      the remote systems that can      72111000
*                                      help work at importance 3     */ 72154000
*      2    SMF99_RHELPCNT4 FIXED(15), /* IRASMF99.2249: a count of     72197000
*                                      the remote systems that can      72240000
*                                      help work at importance 4     */ 72283000
*      2    SMF99_RHELPCNT5 FIXED(15), /* IRASMF99.2620: a count of     72326000
*                                      the remote systems that can      72369000
*                                      help work at importance 5     */ 72412000
*      2    SMF99_RHELPCNT6 FIXED(15), /* IRASMF99.2626: a count of     72455000
*                                      the remote systems that can      72498000
*                                      help work at importance 6     */ 72541000
*      2    SMF99_LHELP_FLGS,       /* IRASMF99.2634: Local system      72584000
*                                      can help work at each            72627000
*                                      importance. 1 - can help, 0 -    72670000
*                                      cannot help                   */ 72713000
*       3    *        BIT(1),       /* IRASMF99.2652: reserved       */ 72756000
*       3    SMF99_LHELP6 BIT(1),   /* IRASMF99.2657: Local system      72799000
*                                      can help work at importance 0.   72842000
*                                      1 - can help, 0 - cannot help */ 72885000
*       3    SMF99_LHELP5 BIT(1),   /* IRASMF99.2674: Local system      72928000
*                                      can help work at importance 1.   72971000
*                                      1 - can help, 0 - cannot help */ 73014000
*       3    SMF99_LHELP4 BIT(1),   /* IRASMF99.2691: Local system      73057000
*                                      can help work at importance 2.   73100000
*                                      1 - can help, 0 - cannot help */ 73143000
*       3    SMF99_LHELP3 BIT(1),   /* IRASMF99.2641: Local system      73186000
*                                      can help work at importance 3.   73229000
*                                      1 - can help, 0 - cannot help */ 73272000
*       3    SMF99_LHELP2 BIT(1),   /* IRASMF99.2732: Local system      73315000
*                                      can help work at importance 4.   73358000
*                                      1 - can help, 0 - cannot help */ 73401000
*       3    SMF99_LHELP1 BIT(1),   /* IRASMF99.2741: Local system      73444000
*                                      can help work at importance 5.   73487000
*                                      1 - can help, 0 - cannot help */ 73530000
*       3    SMF99_LHELP0 BIT(1),   /* IRASMF99.2747: Local system      73573000
*                                      can help work at importance 6.   73616000
*                                      1 - can help, 0 - cannot help */ 73659000
*      2    SMF99_RG_FLAGS,         /* IRASMF99.3875: resource group    73659100
*                                      flags                 @WLMCBSR*/ 73659200
*       3    SMF99_RG_IS_DYNAMIC BIT(1), /* IRASMF99.3878: Indicates    73659300
*                                      that the resource group is a     73659400
*                                      dynamic resource group           73659500
*                                                            @WLMCBSR*/ 73659600
*       3    *        BIT(7),       /* IRASMF99.3884: reserved          73659700
*                                                            @WLMCBSR*/ 73659800
*      2    *        CHAR(2),       /* IRASMF99.3890: reserved          73659900
*                                                            @WLMCBSR*/ 73660000
*      2    *        CHAR(0) BDY(WORD); /* IRASMF99.3896: Forced to     73660100
*                                      WORD boundary         @WLMCBSR*/ 73660200
*                                                                       73660300
*   /*****************************************************************/ 73660400
*   /*                                                               */ 73661100
*   /* IRASMF99.3302: SMF99 subtype 1 Generic Resource entry -       */ 73661800
*   /* Contains information about Generic Resource Routing.          */ 73662500
*   /* BASED(addr(smf_hdr_MAP) + smf99grof)                          */ 73663200
*   /*                                                               */ 73663900
*   /*****************************************************************/ 73664600
*                                                                       73665300
*   DECLARE                                                             73666000
*     1    SMF99_S1_GR_MAP BASED(*) BDY(WORD),                          73666700
*      2    SMF99_GR_SYSNAME CHAR(8), /* IRASMF99.1310: Name of         73667400
*                                      system sessions were routed to   73668100
*                                                            @WLMCTSO*/ 73668800
*      2    SMF99_GR_TSO_SESSIONS_ROUTED FIXED(32), /* IRASMF99.1383:   73669500
*                                      Number of TSO sessions routed    73670200
*                                      to system named in               73670900
*                                      SMF99_GR_SYSNAME      @WLMCTSO*/ 73671600
*      2    SMF99_GR_NONTSO_SESSIONS_ROUTED /* IRASMF99.3308: Number    73672300
*                                      of non-TSO sessions routed to    73673000
*                                      system named in                  73673700
*                                      SMF99_GR_SYSNAME      @WLMCTSO*/ 73674400
*               FIXED(32),                                              73675100
*      2    SMF99_GR_TSO_AVG_COST FIXED(32), /* IRASMF99.2417:          73675800
*                                      Average cost of TSO session in   73676500
*                                      raw cpu service units on         73677200
*                                      system SMF99_GR_SYSNAME          73677900
*                                                            @WLMCTSO*/ 73678600
*      2    SMF99_GR_TSO_PI FIXED(31), /* IRASMF99.1389: Weighted       73679300
*                                      average PI of service class      73680000
*                                      periods running TSO work on      73680700
*                                      system SMF99_GR_SYSNAME          73681400
*                                                            @WLMCTSO*/ 73682100
*      2    SMF99_GR_FLAGS BIT(32) BDY(BYTE), /* IRASMF99.1277: flags   73682800
*                                                            @WLMCTSO*/ 73683500
*       3    SMF99_GR_SHORTAGE BIT(1), /* IRASMF99.3262:                73684200
*                                      SMF99_GR_SYSNAME had a           73684900
*                                      shortage that may have caused    73685600
*                                      sessions not to be routed to     73686300
*                                      it                    @WLMCTSO*/ 73687000
*      2    SMF99_GR_SERVICE_BY_IMPORTANCE(0:7) /* IRASMF99.3087: A     73687700
*                                      single entry in the array of     73688400
*                                      Importance Level Service         73689100
*                                      Units, containing the number     73689800
*                                      of Service Units consumed by     73690500
*                                      work at this Importance Level    73691200
*                                      (or unused) over the last ten    73691900
*                                      seconds. The entries are         73692600
*                                      indexed with an origin of zero   73693300
*                                      so that the index matches the    73694000
*                                      Importance Level to which the    73694700
*                                      entry pertains. Index of zero    73695400
*                                      corresponds to system work and   73696100
*                                      index of 7 to unused capacity    73696800
*                                                            @WLMCTSO*/ 73697500
*               FIXED(31);                                              73698200
*                                                                       73702000
*   /*****************************************************************/ 73745000
*   /*                                                               */ 73788000
*   /* IRASMF99.2323: SMF99 subtype 2 self defining section          */ 73831000
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                           */ 73874000
*   /*                                                               */ 73917000
*   /*****************************************************************/ 73960000
*                                                                       74003000
*   DECLARE                                                             74046000
*     1    SMF99_S2_SDEF_MAP BASED(*) BDY(WORD),                        74089000
*      2    SMF992COF FIXED(32),    /* IRASMF99.2764: Offset to class   74132000
*                                      information from beginning of    74175000
*                                      record (including RDW)        */ 74218000
*      2    SMF992CLN FIXED(16),    /* IRASMF99.2666: Length of class   74261000
*                                      information                   */ 74304000
*      2    SMF992CON FIXED(16),    /* IRASMF99.2812: Number of class   74347000
*                                      information                   */ 74390000
*      2    SMF992CPOF FIXED(32),   /* IRASMF99.2773: Offset to class   74433000
*                                      period section from beginning    74476000
*                                      of record (including RDW)     */ 74519000
*      2    SMF992CPLN FIXED(16),   /* IRASMF99.2776: Length of class   74562000
*                                      period section                */ 74605000
*      2    SMF992CPON FIXED(16);   /* IRASMF99.2782: Number of class   74648000
*                                      period section                */ 74691000
*                                                                       74734000
*   /*****************************************************************/ 74777000
*   /*                                                               */ 74820000
*   /* IRASMF99.2071: SMF99 subtype 2 Class data section - Contains  */ 74863000
*   /* information identifying the Service Class described in this   */ 74906000
*   /* record. BASED(addr(smf_hdr_MAP) + smf992cof)                  */ 74949000
*   /*                                                               */ 74992000
*   /*****************************************************************/ 75035000
*                                                                       75078000
*   DECLARE                                                             75121000
*     1    SMF99_S2_CLS_MAP BASED(*) BDY(HWORD),                        75164000
*      2    SMF99_CNAM CHAR(8),     /* IRASMF99.2797: service class     75207000
*                                      name                          */ 75250000
*      2    SMF99_CGRN CHAR(8),     /* IRASMF99.2803: group name or     75293000
*                                      blank if class doesn't belong    75336000
*                                      to a group                    */ 75379000
*      2    SMF99_CNUMP FIXED(15),  /* IRASMF99.753: number of          75422000
*                                      periods in the class          */ 75465000
*      2    SMF99_CINDEX FIXED(15); /* IRASMF99.765: service class      75493600
*                                      index                         */ 75522200
*                                                                       75551000
*   /*****************************************************************/ 75594000
*   /*                                                               */ 75637000
*   /* IRASMF99.2077: SMF99 subtype 2 Period data section - Contains */ 75680000
*   /* information about the Service Periods that are part of the    */ 75723000
*   /* Service Class described in this record.                       */ 75766000
*   /* BASED(addr(smf_hdr_MAP) + smf992cpof)                         */ 75809000
*   /*                                                               */ 75852000
*   /*****************************************************************/ 75895000
*                                                                       75938000
*   DECLARE                                                             75981000
*     1    SMF99_S2_PER_MAP BASED(*) BDY(WORD),                         76024000
*      2    SMF99_PCNM CHAR(8),     /* IRASMF99.560: Internal service   76067000
*                                      class name                    */ 76110000
*      2    SMF99_PNUM FIXED(16),   /* IRASMF99.566: period number   */ 76153000
*      2    SMF99_PGOALTYP FIXED(8), /* IRASMF99.159: goal type: 1 -    76196000
*                                      short response time, 2 - long    76239000
*                                      response time, 3 - velocity, 4   76282000
*                                      - discretionary               */ 76325000
*      2    *        FIXED(8),      /* IRASMF99.734: reserved        */ 76368000
*      2    SMF99_PGOALVAL FIXED(32), /* IRASMF99.738: goal value:      76411000
*                                      response time goal - goal in     76454000
*                                      milliseconds, velocity -         76497000
*                                      velocity, discretionary - zero*/ 76540000
*      2    SMF99_PIMPOR FIXED(16), /* IRASMF99.744: importance      */ 76583000
*      2    SMF99_PBDP FIXED(8),    /* IRASMF99.163: base dispatching   76626000
*                                      priority                      */ 76669000
*      2    *        FIXED(8),      /* IRASMF99.169: reserved        */ 76712000
*      2    SMF99_PMPLI FIXED(16),  /* IRASMF99.175: MPL in-target   */ 76755000
*      2    SMF99_PMPLO FIXED(16),  /* IRASMF99.181: MPL out-target  */ 76798000
*      2    SMF99_PAMTA FIXED(32),  /* IRASMF99.187: Average Maximum    76841000
*                                      MPL Target achieved           */ 76884000
*      2    SMF99_PRUA FIXED(31),   /* IRASMF99.193: Ready user         76927000
*                                      average                       */ 76970000
*      2    SMF99_PLRUA FIXED(31),  /* IRASMF99.2698: Long term Ready   77013000
*                                      User Average times 16         */ 77056000
*      2    SMF99_PPSPT FIXED(32),  /* IRASMF99.199: length of time     77099000
*                                      swapped address spaces are       77142000
*                                      protected in processor storage*/ 77185000
*      2    SMF99_PPSITAR FIXED(31), /* IRASMF99.455: storage           77228000
*                                      isolation target for each        77271000
*                                      address space in period, valid   77314000
*                                      only for work with short         77357000
*                                      response time goals, zero        77400000
*                                      otherwise                     */ 77443000
*      2    SMF99_PESPOL FIXED(8),  /* IRASMF99.785: expanded storage   77486000
*                                      access policy for demand pages   77529000
*                                      - valid for periods with short   77572000
*                                      resp time goals only          */ 77615000
*      2    SMF99_PESVIO FIXED(8),  /* IRASMF99.1031: expanded          77658000
*                                      storage access policy for VIO    77701000
*                                      pages - valid for periods with   77744000
*                                      short resp time goals only    */ 77787000
*      2    SMF99_PESHSP FIXED(8),  /* IRASMF99.1033: expanded          77830000
*                                      storage access policy for        77873000
*                                      hiperspace pages - valid for     77916000
*                                      periods with short resp time     77959000
*                                      goals only                    */ 78002000
*      2    SMF99_PESSWAP FIXED(8), /* IRASMF99.985: expanded storage   78045000
*                                      access policy for swap pages -   78088000
*                                      valid for periods with short     78131000
*                                      resp time goals only          */ 78174000
*      2    SMF99_PPROT FIXED(16),  /* IRASMF99.997: number of          78217000
*                                      address spaces with demand       78260000
*                                      pages protected in processor     78303000
*                                      storage - NA for periods with    78346000
*                                      short resp time goals         */ 78389000
*      2    SMF99_PLRU FIXED(16),   /* IRASMF99.1003: number of         78432000
*                                      address spaces with demand       78475000
*                                      pages subject to lru expanded    78518000
*                                      storage policy - NA for          78561000
*                                      periods with short resp time     78604000
*                                      goals                         */ 78647000
*      2    SMF99_PSPAV FIXED(16),  /* IRASMF99.2675: number of         78690000
*                                      address spaces with demand       78733000
*                                      pages subject to space           78776000
*                                      available expanded storage       78819000
*                                      policy - NA for periods with     78862000
*                                      short resp time goals         */ 78905000
*      2    SMF99_PVIOL FIXED(16),  /* IRASMF99.1182: number of         78948000
*                                      address spaces with VIO pages    78991000
*                                      subject to lru expanded          79034000
*                                      storage policy - NA for          79077000
*                                      periods with short resp time     79120000
*                                      goals                         */ 79163000
*      2    SMF99_PVIOS FIXED(16),  /* IRASMF99.2681: number of         79206000
*                                      address spaces with VIO pages    79249000
*                                      subject to space available       79292000
*                                      expanded storage policy - NA     79335000
*                                      for periods with short resp      79378000
*                                      time goals                    */ 79421000
*      2    SMF99_PHSPL FIXED(16),  /* IRASMF99.1009: number of         79464000
*                                      address spaces with hiperspace   79507000
*                                      pages subject to lru expanded    79550000
*                                      storage policy - NA for          79593000
*                                      periods with short resp time     79636000
*                                      goals                         */ 79679000
*      2    SMF99_PHSPS FIXED(16),  /* IRASMF99.1015: number of         79722000
*                                      address spaces with hiperspace   79765000
*                                      pages subject to space           79808000
*                                      available expanded storage       79851000
*                                      policy - NA for periods with     79894000
*                                      short resp time goals         */ 79937000
*      2    SMF99_PESCS FIXED(16),  /* IRASMF99.5544: number of         79987990
*                                      explicit storage critical        79995980
*                                      classified address spaces        80003970
*                                                            @WLMCGMS*/ 80011960
*      2    SMF99_PLPI FIXED(32),   /* IRASMF99.205: local              80023000
*                                      performance index             */ 80066000
*      2    SMF99_PSPI FIXED(32),   /* IRASMF99.211: sysplex            80109000
*                                      performance index             */ 80152000
*      2    SMF99_PSERV FIXED(31),  /* IRASMF99.217: service            80195000
*                                      accumulated during interval   */ 80238000
*      2    SMF99_PMDP FIXED(31),   /* IRASMF99.772: maximum            80281000
*                                      percentage of processor time     80324000
*                                      demanded                      */ 80367000
*      2    SMF99_PLCPUU FIXED(31), /* IRASMF99.452: CPU using          80410000
*                                      samples during last interval  */ 80453000
*      2    SMF99_PLCPUD FIXED(31), /* IRASMF99.311: CPU delay          80496000
*                                      samples during last interval  */ 80539000
*      2    SMF99_PMTTWA FIXED(31), /* IRASMF99.399: Mean time to       80582000
*                                      wait adjusted                 */ 80625000
*      2    SMF99_PADP FIXED(31),   /* IRASMF99.778: working variable   80668000
*                                      for achievable demand            80711000
*                                      percentage                    */ 80754000
*      2    SMF99_PASERC FIXED(31), /* IRASMF99.229: Average service    80797000
*                                      consumed over window          */ 80840000
*      2    SMF99_PPRSER FIXED(31), /* IRASMF99.235: Projected          80883000
*                                      service                       */ 80926000
*      2    SMF99_PIDLE FIXED(32),  /* IRASMF99.251: idle samples    */ 80969000
*      2    SMF99_POTHR FIXED(32),  /* IRASMF99.790: all other states*/ 81012000
*      2    SMF99_PCPUU FIXED(32),  /* IRASMF99.787: processor using    81055000
*                                      samples                       */ 81098000
*      2    SMF99_PCPUD FIXED(32),  /* IRASMF99.975: processor delay    81141000
*                                      samples                       */ 81184000
*      2    SMF99_PAUXP FIXED(32),  /* IRASMF99.981: primary private    81227000
*                                      area paging delay aux         */ 81270000
*      2    SMF99_PAUXC FIXED(32),  /* IRASMF99.132: Common area        81313000
*                                      paging delay from aux         */ 81356000
*      2    SMF99_PVIO FIXED(32),   /* IRASMF99.557: VIO delay from     81399000
*                                      aux                           */ 81442000
*      2    SMF99_PHSS FIXED(32),   /* IRASMF99.1040: Scrolling         81485000
*                                      hyperspace delay              */ 81528000
*      2    SMF99_PHSC FIXED(32),   /* IRASMF99.1191: Cache             81571000
*                                      hyperspace delay              */ 81614000
*      2    SMF99_PASWP FIXED(32),  /* IRASMF99.953: Aux swap delay  */ 81657000
*      2    SMF99_PMPLD FIXED(32),  /* IRASMF99.2720: MPL Delay      */ 81700000
*      2    SMF99_PCAPD FIXED(32),  /* IRASMF99.420: CPU CAP delay   */ 81743000
*      2    SMF99_PXMO FIXED(32),   /* IRASMF99.258: Cross memory       81786000
*                                      other delays                  */ 81829000
*      2    SMF99_PXMEM_OF FIXED(32), /* IRASMF99.590: offset to        81872000
*                                      cross memory delay samples       81915000
*                                      from beginning of record         81958000
*                                      (including RDW)               */ 82001000
*      2    SMF99_PXMEM_LN FIXED(16), /* IRASMF99.596: length of each   82044000
*                                      cross memory delay entry      */ 82087000
*      2    SMF99_PXMEM_ON FIXED(16), /* IRASMF99.600: number of        82130000
*                                      cross memory delay samples    */ 82173000
*      2    SMF99_PSERV_OF FIXED(32), /* IRASMF99.644: offset to        82216000
*                                      server section from beginning    82259000
*                                      of record (including RDW)     */ 82302000
*      2    SMF99_PSERV_LN FIXED(16), /* IRASMF99.650: length of each   82345000
*                                      server entry                  */ 82388000
*      2    SMF99_PSERV_ON FIXED(16), /* IRASMF99.656: number of        82431000
*                                      server entries                */ 82474000
*      2    SMF99_PESP_OF FIXED(32), /* IRASMF99.614: offset to         82517000
*                                      address space expanded storage   82560000
*                                      access policies section from     82603000
*                                      beginning of record (including   82646000
*                                      RDW)                          */ 82689000
*      2    SMF99_PESP_LN FIXED(16), /* IRASMF99.620: length of each    82732000
*                                      AS ESP entry                  */ 82775000
*      2    SMF99_PESP_ON FIXED(16), /* IRASMF99.2407: number of AS     82818000
*                                      ESP entries                   */ 82861000
*      2    SMF99_PCDCLOCK FIXED(15), /* IRASMF99.628: policy           82904000
*                                      adjustment count down clock,     82947000
*                                      no policy action is taken        82990000
*                                      until clock is zero           */ 83033000
*      2    SMF99_PNH FIXED(8),     /* IRASMF99.632: period             83076000
*                                      experienced processor access     83119000
*                                      or storage delay during last     83162000
*                                      policy adjustment interval    */ 83205000
*      2    SMF99_PRTP FIXED(8),    /* IRASMF99.3070: Response time     83213600
*                                      goal percentile. Zero if         83222200
*                                      period does not have a           83230800
*                                      percentile response time goal.*/ 83239400
*      2    SMF99_PAUXS FIXED(32),  /* IRASMF99.2216: shared storage    83239500
*                                      paging samples from aux          83239600
*                                                            @WLMCIOP*/ 83239700
*      2    SMF99_PIOU FIXED(32),   /* IRASMF99.2369: I/O using         83239800
*                                      samples               @WLMCIOP*/ 83239900
*      2    SMF99_PIOD FIXED(32),   /* IRASMF99.1499: I/O delay         83240000
*                                      samples               @WLMCIOP*/ 83240100
*      2    SMF99_PIO_MDP FIXED(31), /* IRASMF99.3114: maximum          83240200
*                                      percentage of time period        83240300
*                                      could demand I/O. Percentage     83240400
*                                      scaled by 10.         @WLMCIOP*/ 83240500
*      2    SMF99_PIODP FIXED(8),   /* IRASMF99.3127: I/O priority      83240600
*                                                            @WLMCIOP*/ 83240700
*      2    SMF99_FLAGS BIT(8) BDY(BYTE), /* IRASMF99.5092: Flags       83240800
*                                                            @WLMCDCM*/ 83240900
*       3    SMF99_NEEDS_SYSPLEX_HELP BIT(1), /* IRASMF99.5086:         83241000
*                                      Period experienced some type     83241100
*                                      of delay within the sysplex      83241200
*                                      during last policy adjustment    83241300
*                                      interval              @WLMCDCM*/ 83241400
*       3    SMF99_CPU_CRITICAL BIT(1), /* IRASMF99.5526: Period is     83241406
*                                      cpu critical          @WLMCGMC*/ 83241412
*       3    SMF99_STGCRIT_IMPLICIT BIT(1), /* IRASMF99.5622: period    83241418
*                                      belongs to a service class       83241424
*                                      that was assigned storage        83241430
*                                      protection (stg critical) in     83241436
*                                      the active service policy. The   83241442
*                                      service class was used in        83241448
*                                      subsystem type CICS or IMS and   83241454
*                                      the rule specified storage       83241460
*                                      critical = yes. Also on for      83241466
*                                      transactionserver DISPs          83241472
*                                      serving protected service        83241478
*                                      classes.              @WLMCGMS*/ 83241484
*      2    *        CHAR(2),       /* IRASMF99.3133: reserved          83241500
*                                                            @WLMCIOP*/ 83241600
*      2    SMF99_PDEVCL FIXED(32), /* IRASMF99.3140: Identifier of     83241700
*                                      device cluster period belongs    83241800
*                                      to. This identifier can be       83241900
*                                      used to associated the period    83242000
*                                      with device cluster data in      83242100
*                                      the subtype 4 record. Zero if    83242200
*                                      the period is not associated     83242300
*                                      with a device cluster @WLMCIOP*/ 83242400
*      2    SMF99_PSERVER_TYPE BIT(32) BDY(BYTE), /* IRASMF99.1302:     83242500
*                                      Server type. No bits will be     83242600
*                                      on if period is not a server     83242700
*                                                            @WLMCESM*/ 83242800
*       3    SMF99_PTRANS_SERVER BIT(1), /* IRASMF99.1298: Server is    83242900
*                                      a transaction server  @WLMCESM*/ 83243000
*       3    SMF99_PENCLAVE_SERVER BIT(1), /* IRASMF99.1315: Server     83243100
*                                      is a enclave server   @WLMCESM*/ 83243200
*       3    SMF99_PQUEUE_SERVER BIT(1), /* IRASMF99.1324: Server is    83243300
*                                      a queue server        @WLMCESM*/ 83243400
*      2    SMF99_PSDATA_OF FIXED(32), /* IRASMF99.1233: offset to      83243500
*                                      server samples section from      83243600
*                                      beginning of record (including   83243700
*                                      RDW)                  @WLMCESM*/ 83243800
*      2    SMF99_PSDATA_LN FIXED(16), /* IRASMF99.2351: length of      83243900
*                                      each server samples entry        83244000
*                                                            @WLMCESM*/ 83244100
*      2    SMF99_PSDATA_ON FIXED(16), /* IRASMF99.1497: number of      83244200
*                                      server samples entries           83244300
*                                                            @WLMCESM*/ 83244400
*      2    SMF99_PQDATA_OF FIXED(32), /* IRASMF99.2208: offset to      83244500
*                                      queue server section from        83244600
*                                      beginning of record (including   83244700
*                                      RDW)                  @WLMCESM*/ 83244800
*      2    SMF99_PQDATA_LN FIXED(16), /* IRASMF99.3146: length of      83244900
*                                      each queue server entry          83245000
*                                                            @WLMCESM*/ 83245100
*      2    SMF99_PQDATA_ON FIXED(16), /* IRASMF99.3152: number of      83245200
*                                      queue server entries  @WLMCESM*/ 83245300
*      2    SMF99_PAVG_SIZE FIXED(31), /* IRASMF99.1352: Average size   83245400
*                                      in processor storage (frame      83245500
*                                      count) of address spaces in      83245600
*                                      the period. zero otherwise       83245700
*                                                            @WLMCESM*/ 83245800
*      2    SMF99_PGRN CHAR(8),     /* IRASMF99.3996: group name or     83245900
*                                      blank if period doesn't belong   83246500
*                                      to a group            @WLMCBSR*/ 83247200
*      2    SMF99_PSYS_CPUU FIXED(32), /* IRASMF99.4517: Sysplex wide   83251500
*                                      CPU using samples     @OW37216*/ 83255800
*      2    SMF99_PSYS_NONIDLE FIXED(32), /* IRASMF99.4523: Sysplex     83260100
*                                      wide non-idle samples @OW37216*/ 83264400
*      2    SMF99_PSYS_IDLE FIXED(32), /* IRASMF99.4529: Sysplex wide   83268700
*                                      idle samples          @OW37216*/ 83273000
*      2    SMF99_PSYS_OTHER FIXED(32), /* IRASMF99.4535: Sysplex       83277300
*                                      wide other samples    @OW37216*/ 83281600
*      2    SMF99_IOSUBSAMOF FIXED(32), /* IRASMF99.5439: Offset to     83281800
*                                      I/O subsystem samples data       83282000
*                                      from beginning of record         83282200
*                                      (including RDW)       @WLMCDCM*/ 83282400
*      2    SMF99_IOSUBSAMLN FIXED(16), /* IRASMF99.5472: Length of a   83282600
*                                      I/O subsystem samples data       83282800
*                                      section               @WLMCDCM*/ 83283000
*      2    SMF99_IOSUBSAMON FIXED(16), /* IRASMF99.5478: Number of     83283200
*                                      I/O subsystem samples data       83283400
*                                      sections              @WLMCDCM*/ 83283600
*      2    SMF99_SPMDP FIXED(31),  /* IRASMF99.4127: Saved copy of     83283890
*                                      maximum percentage of            83284000
*                                      processor time demanded          83284200
*                                                            @WLMCLPM*/ 83284400
*      2    *        CHAR(8),       /* IRASMF99.5818: Reserved for      83284890
*                                      service               @PYD0006*/ 83285080
*      2    SMF99_SWCT FIXED(31),   /* IRASMF99.5825: Short wait        83285270
*                                      count accumulator     @PYD0520*/ 83285600
*      2    *        CHAR(2);       /* IRASMF99.5831: Reserved          83285700
*                                                            @PYD0520*/ 83285800
*                                                                       83285900
*   /*****************************************************************/ 83291000
*   /*                                                               */ 83334000
*   /* IRASMF99.2093: SMF99 subtype 3 self defining section          */ 83377000
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                           */ 83420000
*   /*                                                               */ 83463000
*   /*****************************************************************/ 83506000
*                                                                       83549000
*   DECLARE                                                             83592000
*     1    SMF99_S3_SDEF_MAP BASED(*) BDY(WORD),                        83635000
*      2    SMF993COF FIXED(32),    /* IRASMF99.2372: Offset to class   83678000
*                                      information from beginning of    83721000
*                                      record (including RDW)        */ 83764000
*      2    SMF993CLN FIXED(16),    /* IRASMF99.2382: Length of class   83807000
*                                      information                   */ 83850000
*      2    SMF993CON FIXED(16),    /* IRASMF99.2015: Number of class   83893000
*                                      information                   */ 83936000
*      2    SMF993CPOF FIXED(32),   /* IRASMF99.2023: Offset to class   83979000
*                                      period section from beginning    84022000
*                                      of record (including RDW)     */ 84065000
*      2    SMF993CPLN FIXED(16),   /* IRASMF99.2888: Length of class   84108000
*                                      period section                */ 84151000
*      2    SMF993CPON FIXED(16);   /* IRASMF99.2894: Number of class   84194000
*                                      period section                */ 84237000
*                                                                       84280000
*   /*****************************************************************/ 84323000
*   /*                                                               */ 84366000
*   /* IRASMF99.2095: SMF99 subtype 3 class data section Contains    */ 84409000
*   /* information identifying the Service Class described in this   */ 84452000
*   /* record. BASED(addr(smf_hdr_MAP) + smf993cof)                  */ 84495000
*   /*                                                               */ 84538000
*   /*****************************************************************/ 84581000
*                                                                       84624000
*   DECLARE                                                             84667000
*     1    SMF99_S3_CLS_MAP BASED(*) BDY(BYTE),                         84710000
*      2    SMF99_PNAM CHAR(8);     /* IRASMF99.971: service class      84753000
*                                      name                          */ 84796000
*                                                                       84839000
*   /*****************************************************************/ 84882000
*   /*                                                               */ 84925000
*   /* IRASMF99.2101: SMF99 subtype 3 period self definition section */ 84968000
*   /* BASED(addr(smf_hdr_MAP) + smf993cpof)                         */ 85011000
*   /*                                                               */ 85054000
*   /*****************************************************************/ 85097000
*                                                                       85140000
*   DECLARE                                                             85183000
*     1    SMF99_S3_PER_SDEF_MAP BASED(*) BDY(WORD),                    85226000
*      2    SMF993_PRPOF FIXED(32), /* IRASMF99.829: Offset to paging   85269000
*                                      rate plot for this period from   85312000
*                                      beginning of record (including   85355000
*                                      RDW)                          */ 85398000
*      2    SMF993_PRPLN FIXED(16), /* IRASMF99.835: Length of paging   85441000
*                                      rate plot                     */ 85484000
*      2    SMF993_PRPON FIXED(16), /* IRASMF99.837: Number of paging   85527000
*                                      rate plots                    */ 85570000
*      2    SMF993_MPLOF FIXED(32), /* IRASMF99.843: Offset to MPL      85613000
*                                      delay plots for this period      85656000
*                                      from beginning of record         85699000
*                                      (including RDW)               */ 85742000
*      2    SMF993_MPLLN FIXED(16), /* IRASMF99.851: Length of MPL      85785000
*                                      delay plots                   */ 85828000
*      2    SMF993_MPLON FIXED(16), /* IRASMF99.855: Number of MPL      85871000
*                                      delay plots                   */ 85914000
*      2    SMF993_RUAOF FIXED(32), /* IRASMF99.873: Offset to ready    85957000
*                                      user average plots for this      86000000
*                                      period from beginning of         86043000
*                                      record (including RDW)        */ 86086000
*      2    SMF993_RUALN FIXED(16), /* IRASMF99.876: Length of ready    86129000
*                                      user average plot             */ 86172000
*      2    SMF993_RUAON FIXED(16), /* IRASMF99.881: Number of ready    86215000
*                                      user average plots            */ 86258000
*      2    SMF993_SWPOF FIXED(32), /* IRASMF99.887: Offset to swap     86301000
*                                      delay plots for this period      86344000
*                                      from beginning of record         86387000
*                                      (including RDW)               */ 86430000
*      2    SMF993_SWPLN FIXED(16), /* IRASMF99.893: Length of swap     86473000
*                                      delay plot                    */ 86516000
*      2    SMF993_SWPON FIXED(16), /* IRASMF99.905: Number of swap     86559000
*                                      delay plots                   */ 86602000
*      2    SMF993_PASOF FIXED(32), /* IRASMF99.911: Offset to          86645000
*                                      proportional aggregate speed     86688000
*                                      plots for this period from       86731000
*                                      beginning of record (including   86774000
*                                      RDW)                          */ 86817000
*      2    SMF993_PASLN FIXED(16), /* IRASMF99.917: Length of          86860000
*                                      proportional aggregate speed     86903000
*                                      plot                          */ 86946000
*      2    SMF993_PASON FIXED(16), /* IRASMF99.925: Number of          86989000
*                                      proportional aggregate speed     87032000
*                                      plots                         */ 87075000
*      2    SMF993_QMPLOF FIXED(32), /* IRASMF99.3190: Offset to        87077500
*                                      queue delay plots for this       87080000
*                                      period from beginning of         87082500
*                                      record (including RDW)        */ 87085000
*      2    SMF993_QMPLLN FIXED(16), /* IRASMF99.3196: Length of        87087500
*                                      queue delay plot              */ 87090000
*      2    SMF993_QMPLON FIXED(16), /* IRASMF99.3202: Number of        87092500
*                                      queue delay plots             */ 87095000
*      2    SMF993_QRUAOF FIXED(32), /* IRASMF99.3208: Offset to        87097500
*                                      queue ready user average for     87100000
*                                      this period from beginning of    87102500
*                                      record (including RDW)        */ 87105000
*      2    SMF993_QRUALN FIXED(16), /* IRASMF99.3214: Length of        87107500
*                                      queue ready user average plot */ 87110000
*      2    SMF993_QRUAON FIXED(16), /* IRASMF99.3220: Number of        87112500
*                                      queue ready user average plot */ 87115000
*      2    SMF993_INTERNAL_CLASS_NAME CHAR(8), /* IRASMF99.3548:       87115200
*                                      Internal class name of the       87115400
*                                      period. For non-discretionary    87115600
*                                      periods this will be the same    87115800
*                                      as the external class name.      87116000
*                                      For discretionary periods this   87116200
*                                      will be of the form $SRMDIxx.    87116400
*                                      For dynamic periods this will    87116600
*                                      be of the form $SRMSxxx.         87116800
*                                                            @PSY0628*/ 87117000
*      2    SMF993_QSTPOF FIXED(32), /* IRASMF99.5758: offset to        87117100
*                                      queue service time for this      87117200
*                                      period from beginning of         87117300
*                                      record (including RDW)           87117400
*                                                            @OW47156*/ 87117500
*      2    SMF993_QSTPLN FIXED(16), /* IRASMF99.5764: length of        87117600
*                                      queue service time plot          87117700
*                                                            @OW47156*/ 87117800
*      2    SMF993_QSTPON FIXED(16), /* IRASMF99.5770: number of        87117900
*                                      queue service time plot          87118000
*                                                            @OW47156*/ 87118100
*      2    SMF993_AINSOF FIXED(32), /* IRASMF99.4577: Offset to        87118300
*                                      active server instance plot      87119600
*                                      for this period from beginning   87120900
*                                      of record (including RDW)        87122200
*                                                            @WLMCSTT*/ 87123500
*      2    SMF993_AINSLN FIXED(16), /* IRASMF99.4583: length of        87124800
*                                      active server instance plot      87126100
*                                                            @WLMCSTT*/ 87127400
*      2    SMF993_AINSON FIXED(16), /* IRASMF99.4589: Number of        87128700
*                                      active server instance plot      87130000
*                                                            @WLMCSTT*/ 87131300
*      2    SMF993_ASTROF FIXED(32), /* IRASMF99.4595: Offset to        87132600
*                                      virtual storage plot for         87133900
*                                      active server instances for      87135200
*                                      this period from beginning of    87136500
*                                      record (including RDW)           87137800
*                                                            @WLMCSTT*/ 87139100
*      2    SMF993_ASTRLN FIXED(16), /* IRASMF99.4601: Length of        87140400
*                                      virtual storage plot  @WLMCSTT*/ 87141700
*      2    SMF993_ASTRON FIXED(16), /* IRASMF99.4607: Number of        87143000
*                                      virtual storage plot  @WLMCSTT*/ 87144300
*      2    SMF993_TSTROF FIXED(32), /* IRASMF99.4613: Offset to        87145600
*                                      virtual storage plot for total   87146900
*                                      server instances for this        87148200
*                                      period from beginning of         87149500
*                                      record (including RDW)           87150800
*                                                            @WLMCSTT*/ 87152100
*      2    SMF993_TSTRLN FIXED(16), /* IRASMF99.4619: Length of        87153400
*                                      virtual storage plot  @WLMCSTT*/ 87154700
*      2    SMF993_TSTRON FIXED(16); /* IRASMF99.4625: Number of        87156880
*                                      virtual storage plot  @WLMCSTT*/ 87157300
*                                                                       87158600
*   /*****************************************************************/ 87161000
*   /*                                                               */ 87204000
*   /* IRASMF99.2107: SMF99 subtype 3 Period Paging Rate Plot section*/ 87247000
*   /* - Contains paging rate information for the service period.    */ 87290000
*   /* BASED(addr(smf_hdr_MAP) + smf993_pprpof)                      */ 87333000
*   /*                                                               */ 87376000
*   /*****************************************************************/ 87419000
*                                                                       87462000
*   DECLARE                                                             87505000
*     1    SMF99_S3_PPRP_MAP BASED(*) BDY(WORD),                        87548000
*      2    SMF99_PPRP_PNUM FIXED(32), /* SRMPLOT.6884: period number*/ 87591000
*      2    SMF99_PPRP_BW FIXED(32), /* SRMPLOT.6769: Bucket width   */ 87634000
*      2    SMF99_PPRP_LSTX FIXED(32), /* SRMPLOT.6907: Last plotted    87677000
*                                      x bucket                      */ 87720000
*      2    *        FIXED(32),     /* SRMPLOT.6913: Reserved        */ 87770000
*      2    SMF99_PPRP_POINTS_OF FIXED(32), /* SRMPLOT.6249: Offset     87849000
*                                      of point entries              */ 87892000
*      2    SMF99_PPRP_POINTS_ON FIXED(16), /* SRMPLOT.6474: Number     87935000
*                                      of point entries              */ 87978000
*      2    SMF99_PPRP_POINTS_LN FIXED(16); /* SRMPLOT.7221: Length     88021000
*                                      of a point entry              */ 88064000
*                                                                       88107000
*   /*****************************************************************/ 88150000
*   /*                                                               */ 88193000
*   /* IRASMF99.2113: SMF99 subtype 3 MPL Delay Plot section -       */ 88236000
*   /* Contains MPL information for the service period.              */ 88279000
*   /* BASED(addr(smf_hdr_MAP) + smf993_mplof)                       */ 88322000
*   /*                                                               */ 88365000
*   /*****************************************************************/ 88408000
*                                                                       88451000
*   DECLARE                                                             88494000
*     1    SMF99_S3_MPLP_MAP BASED(*) BDY(WORD),                        88537000
*      2    SMF99_MPLP_PNUM FIXED(32), /* SRMPLOT.6952: period number*/ 88580000
*      2    SMF99_MPLP_BW FIXED(32), /* SRMPLOT.6958: Bucket width   */ 88623000
*      2    SMF99_MPLP_LSTX FIXED(32), /* SRMPLOT.6964: Last plotted    88666000
*                                      x bucket                      */ 88709000
*      2    *        FIXED(32),     /* SRMPLOT.7495: Reserved        */ 88759000
*      2    SMF99_MPLP_POINTS_OF FIXED(32), /* SRMPLOT.6297: Offset     88838000
*                                      of point entries              */ 88881000
*      2    SMF99_MPLP_POINTS_ON FIXED(16), /* SRMPLOT.6291: Number     88924000
*                                      of point entries              */ 88967000
*      2    SMF99_MPLP_POINTS_LN FIXED(16); /* SRMPLOT.6755: Length     89010000
*                                      of a point entry              */ 89053000
*                                                                       89096000
*   /*****************************************************************/ 89139000
*   /*                                                               */ 89182000
*   /* IRASMF99.2119: SMF99 subtype 3 Ready User Average Plot section*/ 89225000
*   /* - Containsready user average information for the service      */ 89268000
*   /* period. BASED(addr(smf_hdr_MAP) + smf993_ruaof)               */ 89311000
*   /*                                                               */ 89354000
*   /*****************************************************************/ 89397000
*                                                                       89440000
*   DECLARE                                                             89483000
*     1    SMF99_S3_RUAP_MAP BASED(*) BDY(WORD),                        89526000
*      2    SMF99_RUAP_PNUM FIXED(32), /* SRMPLOT.7141: period number*/ 89569000
*      2    SMF99_RUAP_BW FIXED(32), /* SRMPLOT.7147: Bucket width   */ 89612000
*      2    SMF99_RUAP_LSTX FIXED(32), /* SRMPLOT.7153: Last plotted    89655000
*                                      x bucket                      */ 89698000
*      2    *        FIXED(32),     /* SRMPLOT.7104: Reserved        */ 89748000
*      2    SMF99_RUAP_POINTS_OF FIXED(32), /* SRMPLOT.6945: Offset     89827000
*                                      of point entries              */ 89870000
*      2    SMF99_RUAP_POINTS_ON FIXED(16), /* SRMPLOT.6951: Number     89913000
*                                      of point entries              */ 89956000
*      2    SMF99_RUAP_POINTS_LN FIXED(16); /* SRMPLOT.6987: Length     89999000
*                                      of a point entry              */ 90042000
*                                                                       90085000
*   /*****************************************************************/ 90128000
*   /*                                                               */ 90171000
*   /* IRASMF99.2715: SMF99 subtype 3 Swap Delay Plot section -      */ 90214000
*   /* Contains information about delays caused by adderess spaces in*/ 90257000
*   /* the service period being swapped out. BASED(addr(smf_hdr_MAP) */ 90300000
*   /* + smf993_swpof)                                               */ 90343000
*   /*                                                               */ 90386000
*   /*****************************************************************/ 90429000
*                                                                       90472000
*   DECLARE                                                             90515000
*     1    SMF99_S3_SWPP_MAP BASED(*) BDY(WORD),                        90558000
*      2    SMF99_SWPP_PNUM FIXED(32), /* SRMPLOT.7015: period number*/ 90601000
*      2    SMF99_SWPP_BW FIXED(32), /* SRMPLOT.7021: Bucket width   */ 90644000
*      2    SMF99_SWPP_LSTX FIXED(32), /* SRMPLOT.7027: Last plotted    90687000
*                                      x bucket                      */ 90730000
*      2    *        FIXED(32),     /* SRMPLOT.6978: Reserved        */ 90780000
*      2    SMF99_SWPP_POINTS_OF FIXED(32), /* SRMPLOT.6746: Offset     90859000
*                                      of point entries              */ 90902000
*      2    SMF99_SWPP_POINTS_ON FIXED(16), /* SRMPLOT.6700: Number     90945000
*                                      of point entries              */ 90988000
*      2    SMF99_SWPP_POINTS_LN FIXED(16); /* SRMPLOT.6711: Length     91031000
*                                      of a point entry              */ 91074000
*                                                                       91117000
*   /*****************************************************************/ 91160000
*   /*                                                               */ 91203000
*   /* IRASMF99.2129: SMF99 subtype 3 Proportional Aggregate Speed   */ 91246000
*   /* Plot section. BASED(addr(smf_hdr_MAP) + smf993_pasof)         */ 91289000
*   /*                                                               */ 91332000
*   /*****************************************************************/ 91375000
*                                                                       91418000
*   DECLARE                                                             91461000
*     1    SMF99_S3_PASP_MAP BASED(*) BDY(WORD),                        91504000
*      2    SMF99_PASP_PNUM FIXED(32), /* SRMPLOT.7078: period number*/ 91547000
*      2    SMF99_PASP_BW FIXED(32), /* SRMPLOT.7084: Bucket width   */ 91590000
*      2    SMF99_PASP_LSTX FIXED(32), /* SRMPLOT.7090: Last plotted    91633000
*                                      x bucket                      */ 91676000
*      2    *        FIXED(32),     /* SRMPLOT.7041: Reserved        */ 91726000
*      2    SMF99_PASP_POINTS_OF FIXED(32), /* SRMPLOT.6788: Offset     91805000
*                                      of point entries              */ 91848000
*      2    SMF99_PASP_POINTS_ON FIXED(16), /* SRMPLOT.6924: Number     91891000
*                                      of point entries              */ 91934000
*      2    SMF99_PASP_POINTS_LN FIXED(16); /* SRMPLOT.6933: Length     91977000
*                                      of a point entry              */ 92020000
*                                                                       92063000
*   /*****************************************************************/ 92106000
*   /*                                                               */ 92149000
*   /* IRASMF99.3229: SMF99 subtype 3 Queue Delay Plot section.      */ 92192000
*   /* BASED(addr(smf_hdr_MAP) + smf993_qmplof)                      */ 92235000
*   /*                                                               */ 92278000
*   /*****************************************************************/ 92321000
*                                                                       92364000
*   DECLARE                                                             92407000
*     1    SMF99_S3_QMPLP_MAP BASED(*) BDY(WORD),                       92407200
*      2    SMF99_QMPLP_PNUM FIXED(32), /* SRMPLOT.10471: period        92407400
*                                      number                @WLMCESM*/ 92407600
*      2    SMF99_QMPLP_DISP_CLASS_NAME CHAR(8), /* SRMPLOT.10667:      92407800
*                                      Class name of DISP where         92408000
*                                      server address spaces are        92408200
*                                      running               @WLMCESM*/ 92408400
*      2    SMF99_QMPLP_BW FIXED(32), /* SRMPLOT.10201: Bucket width    92408600
*                                                            @WLMCESM*/ 92408800
*      2    SMF99_QMPLP_LSTX FIXED(32), /* SRMPLOT.9807: Last plotted   92409000
*                                      x bucket              @WLMCESM*/ 92409200
*      2    *        FIXED(32),     /* SRMPLOT.10134: Reserved          92409400
*                                                            @WLMCESM*/ 92409600
*      2    SMF99_QMPLP_POINTS_OF FIXED(32), /* SRMPLOT.10105: Offset   92409800
*                                      of point entries      @WLMCESM*/ 92410000
*      2    SMF99_QMPLP_POINTS_ON FIXED(16), /* SRMPLOT.10573: Number   92410200
*                                      of point entries      @WLMCESM*/ 92410400
*      2    SMF99_QMPLP_POINTS_LN FIXED(16), /* SRMPLOT.9835: Length    92410600
*                                      of a point entry      @WLMCESM*/ 92410800
*      2    SMF99_QMPLP_Q_TYPE BIT(8) BDY(BYTE), /* SRMPLOT.11566:      92410900
*                                      Type byte                     */ 92411000
*       3    SMF99_QMPLP_QUEUE_MANAGER BIT(1), /* SRMPLOT.11572:        92411100
*                                      queue manager type work queue */ 92411200
*       3    SMF99_QMPLP_BATCH BIT(1), /* SRMPLOT.11578: Batch type     92411300
*                                      work queue                    */ 92411400
*      2    *        CHAR(3),       /* SRMPLOT.11627: reserved       */ 92411500
*      2    SMF99_QMPLP_SUBSYS_TYPE CHAR(4), /* SRMPLOT.11555:          92411600
*                                      Subsystem type of owner of the   92411700
*                                      queue. Only applies to batch     92411800
*                                      queue servers.        @PSY0628*/ 92411900
*      2    SMF99_QMPLP_SUBSYS_NAME CHAR(8); /* SRMPLOT.11562:          92412000
*                                      Subsystem name of owner of the   92412100
*                                      queue. Only applies to batch     92412200
*                                      queue servers.        @PSY0628*/ 92412300
*                                                                       92412400
*   /*****************************************************************/ 92412500
*   /*                                                               */ 92412600
*   /* IRASMF99.3235: SMF99 subtype 3 Queue Ready User Avg Plot      */ 92412700
*   /* section. BASED(addr(smf_hdr_MAP) + smf993_qruaof)             */ 92412800
*   /*                                                               */ 92412900
*   /*****************************************************************/ 92413000
*                                                                       92413100
*   DECLARE                                                             92413200
*     1    SMF99_S3_QRUAP_MAP BASED(*) BDY(WORD),                       92413300
*      2    SMF99_QRUAP_PNUM FIXED(32), /* SRMPLOT.9938: period         92413400
*                                      number                @WLMCESM*/ 92413500
*      2    SMF99_QRUAP_DISP_CLASS_NAME CHAR(8), /* SRMPLOT.9863:       92413600
*                                      Class name of DISP where         92413700
*                                      server address spaces are        92413800
*                                      running               @WLMCESM*/ 92414000
*      2    SMF99_QRUAP_BW FIXED(32), /* SRMPLOT.9950: Bucket width     92414200
*                                                            @WLMCESM*/ 92414400
*      2    SMF99_QRUAP_LSTX FIXED(32), /* SRMPLOT.10723: Last          92414600
*                                      plotted x bucket      @WLMCESM*/ 92414800
*      2    *        FIXED(32),     /* SRMPLOT.10727: Reserved          92415000
*                                                            @WLMCESM*/ 92415200
*      2    SMF99_QRUAP_POINTS_OF FIXED(32), /* SRMPLOT.9935: Offset    92415400
*                                      of point entries      @WLMCESM*/ 92415600
*      2    SMF99_QRUAP_POINTS_ON FIXED(16), /* SRMPLOT.10626: Number   92415800
*                                      of point entries      @WLMCESM*/ 92416000
*      2    SMF99_QRUAP_POINTS_LN FIXED(16); /* SRMPLOT.10621: Length   92416200
*                                      of a point entry      @WLMCESM*/ 92416400
*                                                                       92416500
*   /*****************************************************************/ 92416600
*   /*                                                               */ 92416700
*   /* IRASMF99.4559: SMF99 subtype 3 Active Server Instances Plot   */ 92416800
*   /* section. BASED(addr(smf_hdr_MAP) + smf993_ainsof)     @WLMCSTT*/ 92416900
*   /*                                                               */ 92417000
*   /*****************************************************************/ 92417100
*                                                                       92417200
*   DECLARE                                                             92417300
*     1    SMF99_S3_AINS_MAP BASED(*) BDY(WORD),                        92417400
*      2    SMF99_AINS_PNUM FIXED(32), /* SRMPLOT.8086: period number   92417500
*                                                            @WLMCSTT*/ 92417600
*      2    SMF99_AINS_BW FIXED(32), /* SRMPLOT.8088: Bucket width      92417700
*                                                            @WLMCSTT*/ 92417800
*      2    SMF99_AINS_LSTX FIXED(32), /* SRMPLOT.8090: Last plotted    92417900
*                                      x bucket              @WLMCSTT*/ 92418000
*      2    *        FIXED(32),     /* SRMPLOT.8094: Reserved           92418100
*                                                            @WLMCSTT*/ 92418200
*      2    SMF99_AINS_POINTS_OF FIXED(32), /* SRMPLOT.8070: Offset     92418300
*                                      of point entries      @WLMCSTT*/ 92418400
*      2    SMF99_AINS_POINTS_ON FIXED(16), /* SRMPLOT.8104: Number     92418500
*                                      of point entries      @WLMCSTT*/ 92418600
*      2    SMF99_AINS_POINTS_LN FIXED(16); /* SRMPLOT.8072: Length     92418700
*                                      of a point entry      @WLMCSTT*/ 92418800
*                                                                       92418900
*   /*****************************************************************/ 92419000
*   /*                                                               */ 92419100
*   /* IRASMF99.4565: SMF99 subtype 3 VS Plot for active server      */ 92419200
*   /* instances. BASED(addr(smf_hdr_MAP) + smf993_astrof)   @WLMCSTT*/ 92419300
*   /*                                                               */ 92419400
*   /*****************************************************************/ 92419500
*                                                                       92419600
*   DECLARE                                                             92419700
*     1    SMF99_S3_ASTR_MAP BASED(*) BDY(WORD),                        92419800
*      2    SMF99_ASTR_PNUM FIXED(32), /* SRMPLOT.1744: period number   92419900
*                                                            @WLMCSTT*/ 92420000
*      2    SMF99_ASTR_BW FIXED(32), /* SRMPLOT.1175: Bucket width      92420100
*                                                            @WLMCSTT*/ 92420200
*      2    SMF99_ASTR_LSTX FIXED(32), /* SRMPLOT.1953: Last plotted    92420300
*                                      x bucket              @WLMCSTT*/ 92420400
*      2    *        FIXED(32),     /* SRMPLOT.3873: Reserved           92420500
*                                                            @WLMCSTT*/ 92420600
*      2    SMF99_ASTR_POINTS_OF FIXED(32), /* SRMPLOT.2189: Offset     92420700
*                                      of point entries      @WLMCSTT*/ 92420800
*      2    SMF99_ASTR_POINTS_ON FIXED(16), /* SRMPLOT.4036: Number     92420900
*                                      of point entries      @WLMCSTT*/ 92421000
*      2    SMF99_ASTR_POINTS_LN FIXED(16), /* SRMPLOT.4045: Length     92421100
*                                      of a point entry      @WLMCSTT*/ 92421200
*      2    SMF99_ASTR_C_USED BIT(8) BDY(BYTE), /* SRMPLOT.4048: Plot   92421300
*                                      Curve used            @WLMCSTT*/ 92421400
*       3    SMF99_ASTR_C_BEL16MB_USED BIT(1), /* SRMPLOT.562: VS       92421500
*                                      curve below 16MB was used last   92421600
*                                      time server instances have       92421700
*                                      been adjusted         @WLMCSTT*/ 92421800
*       3    SMF99_ASTR_C_ABV16MB_USED BIT(1), /* SRMPLOT.2454: VS      92421900
*                                      curve above 16MB was used last   92422000
*                                      time server instances have       92422100
*                                      been adjusted         @WLMCSTT*/ 92422200
*      2    *        CHAR(3);       /* SRMPLOT.2442: reserved           92422300
*                                                            @WLMCSTT*/ 92422400
*                                                                       92422500
*   /*****************************************************************/ 92422600
*   /*                                                               */ 92422700
*   /* IRASMF99.4571: SMF99 subtype 3 VS plot for total server       */ 92422800
*   /* instances. BASED(addr(smf_hdr_MAP) + smf993_tstrof)   @WLMCSTT*/ 92422900
*   /*                                                               */ 92423000
*   /*****************************************************************/ 92423100
*                                                                       92423200
*   DECLARE                                                             92423300
*     1    SMF99_S3_TSTR_MAP BASED(*) BDY(WORD),                        92423400
*      2    SMF99_TSTR_PNUM FIXED(32), /* SRMPLOT.1235: period number   92423500
*                                                            @WLMCSTT*/ 92423600
*      2    SMF99_TSTR_BW FIXED(32), /* SRMPLOT.1993: Bucket width      92423700
*                                                            @WLMCSTT*/ 92423800
*      2    SMF99_TSTR_LSTX FIXED(32), /* SRMPLOT.1956: Last plotted    92423900
*                                      x bucket              @WLMCSTT*/ 92424000
*      2    *        FIXED(32),     /* SRMPLOT.841: Reserved @WLMCSTT*/ 92424100
*      2    SMF99_TSTR_POINTS_OF FIXED(32), /* SRMPLOT.774: Offset of   92424200
*                                      point entries         @WLMCSTT*/ 92424300
*      2    SMF99_TSTR_POINTS_ON FIXED(16), /* SRMPLOT.597: Number of   92424400
*                                      point entries         @WLMCSTT*/ 92424500
*      2    SMF99_TSTR_POINTS_LN FIXED(16), /* SRMPLOT.675: Length of   92424600
*                                      a point entry         @WLMCSTT*/ 92424700
*      2    SMF99_TSTR_C_USED BIT(8) BDY(BYTE), /* SRMPLOT.1714: Plot   92424800
*                                      Curve used            @WLMCSTT*/ 92424900
*       3    SMF99_TSTR_C_BEL16MB_USED BIT(1), /* SRMPLOT.1264: VS      92425000
*                                      curve below 16MB was used last   92425100
*                                      time server instances have       92425200
*                                      been adjusted         @WLMCSTT*/ 92425300
*       3    SMF99_TSTR_C_ABV16MB_USED BIT(1), /* SRMPLOT.1196: VS      92425400
*                                      curve above 16MB was used last   92425500
*                                      time server instances have       92425600
*                                      been adjusted         @WLMCSTT*/ 92425700
*      2    *        CHAR(3);       /* SRMPLOT.554: reserved @WLMCSTT*/ 92425800
*                                                                       92425803
*   /*****************************************************************/ 92425806
*   /*                                                               */ 92425809
*   /* IRASMF99.5812: SMF99 subtype 3 Queue service time Plot        */ 92425813
*   /* section. BASED(addr(smf_hdr_MAP) + smf993_qstpof)     @OW42779*/ 92425815
*   /*                                                               */ 92425818
*   /*****************************************************************/ 92425821
*                                                                       92425824
*   DECLARE                                                             92425827
*     1    SMF99_S3_QSTPP_MAP BASED(*) BDY(WORD),                       92425830
*      2    SMF99_QSTP_PNUM FIXED(32), /* SRMPLOT.5552: period number   92425833
*                                                            @OW42779*/ 92425836
*      2    SMF99_QSTP_DISP_CLASS_NAME CHAR(8), /* SRMPLOT.5551:        92425839
*                                      Class name of DISP where         92425842
*                                      server address spaces are        92425845
*                                      running               @OW42779*/ 92425848
*      2    SMF99_QSTP_BW FIXED(32), /* SRMPLOT.2175: Bucket width      92425851
*                                                            @OW42779*/ 92425854
*      2    SMF99_QSTP_LSTX FIXED(32), /* SRMPLOT.711: Last plotted x   92425857
*                                      bucket                @OW42779*/ 92425860
*      2    *        FIXED(32),     /* SRMPLOT.4275: Reserved           92425863
*                                                            @OW42779*/ 92425866
*      2    SMF99_QSTP_POINTS_OF FIXED(32), /* SRMPLOT.4277: Offset     92425869
*                                      of point entries      @OW42779*/ 92425872
*      2    SMF99_QSTP_POINTS_ON FIXED(16), /* SRMPLOT.1430: Number     92425875
*                                      of point entries      @OW42779*/ 92425878
*      2    SMF99_QSTP_POINTS_LN FIXED(16); /* SRMPLOT.3890: Length     92425881
*                                      of a point entry      @OW42779*/ 92425884
*                                                                       92425900
*   /*****************************************************************/ 92426000
*   /*                                                               */ 92426100
*   /* IRASMF99.2137: SMF99 subtype 4 self defining section          */ 92426200
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                   @WLMCIOP*/ 92426300
*   /*                                                               */ 92426400
*   /*****************************************************************/ 92426500
*                                                                       92426600
*   DECLARE                                                             92426700
*     1    SMF99_S4_SDEF_MAP BASED(*) BDY(WORD),                        92426800
*      2    SMF994DEVCLID FIXED(32), /* IRASMF99.1195: Identifier of    92426900
*                                      device cluster. Used to          92427000
*                                      associate a device cluster       92427100
*                                      with the periods in a device     92427200
*                                      cluster through the device       92427300
*                                      cluster identifier field in      92427400
*                                      the subtype 2 (SMF99_PDEVCL)     92427500
*                                                            @WLMCIOP*/ 92427600
*      2    SMF994IOPTOF FIXED(32), /* IRASMF99.934: Offset to I/O      92427700
*                                      priority table information       92427800
*                                      from beginning of record         92427900
*                                      (including RDW)       @WLMCIOP*/ 92428000
*      2    SMF994IOPTLN FIXED(16), /* IRASMF99.940: Length of I/O      92428100
*                                      priority information  @WLMCIOP*/ 92428200
*      2    SMF994IOPTON FIXED(16), /* IRASMF99.435: Number of          92428300
*                                      priority table sections          92428400
*                                                            @WLMCIOP*/ 92428500
*      2    SMF994IOPLTOF FIXED(32), /* IRASMF99.439: Offset to the     92428600
*                                      I/O plot section from            92428700
*                                      beginning of record (including   92428800
*                                      RDW)                  @WLMCIOP*/ 92428900
*      2    SMF994IOPLTLN FIXED(16), /* IRASMF99.445: Length of I/O     92429000
*                                      plot section          @WLMCIOP*/ 92429100
*      2    SMF994IOPLTON FIXED(16); /* IRASMF99.1055: Number of I/O    92429200
*                                      plot sections         @WLMCIOP*/ 92429300
*                                                                       92429400
*   /*****************************************************************/ 92429500
*   /*                                                               */ 92429600
*   /* IRASMF99.2143: SMF99 subtype 4device cluster priority table   */ 92429700
*   /* section - Contains information about priorities being used in */ 92429800
*   /* the device cluster BASED(addr(smf_hdr_MAP) + smf994ioptof)    */ 92429900
*   /*                                                       @WLMCIOP*/ 92430000
*   /*                                                               */ 92430100
*   /*****************************************************************/ 92430200
*                                                                       92430300
*   DECLARE                                                             92430400
*     1    SMF99_S4_IOPDT_MAP BASED(*) BDY(WORD),                       92430500
*      2    SMF99_IPTPRTY FIXED(15), /* IRASMF99.1069: I/O priority     92430600
*                                                            @WLMCIOP*/ 92430700
*      2    SMF99_IPTNP FIXED(16),  /* IRASMF99.1075: New I/O           92430800
*                                      priority (zero if not changed)   92430900
*                                                            @WLMCIOP*/ 92431000
*      2    SMF99_IPTIMDP FIXED(31), /* IRASMF99.1081: initial          92431100
*                                      maximum percentage of time       92431200
*                                      work at priority demand I/O,     92431300
*                                      initial value before any         92431400
*                                      priority moves. Percentage       92431500
*                                      scaled by 10          @WLMCIOP*/ 92431600
*      2    SMF99_IPTPMDP FIXED(31), /* IRASMF99.1086: projected        92431700
*                                      maximum percentage of I/O time   92431800
*                                      demanded at priority  @WLMCIOP*/ 92431900
*      2    SMF99_IPTW2UR FIXED(31), /* IRASMF99.1109: wait-to-using    92432000
*                                      ratio at priority (*16)          92432100
*                                                            @WLMCIOP*/ 92432200
*      2    SMF99_IPTIMAXD FIXED(31), /* IRASMF99.1135: initial         92432300
*                                      cumulative maximum demand/       92432400
*                                      Percentage scaled by 10.         92432500
*                                                            @WLMCIOP*/ 92432600
*      2    SMF99_IPTWMAXD FIXED(31); /* IRASMF99.1141: Projected       92432700
*                                      cumulative maximum demand        92432800
*                                      Percentage scaled by 10.         92432900
*                                                            @WLMCIOP*/ 92433000
*                                                                       92433100
*   /*****************************************************************/ 92433200
*   /*                                                               */ 92433300
*   /* IRASMF99.1308: SMF99 subtype 4 I/O plot information - Contains*/ 92433400
*   /* the information plotted on the device clusters I/O plot       */ 92433500
*   /* BASED(addr(smf_hdr_MAP) + smf99iopltof)               @WLMCIOP*/ 92433600
*   /*                                                               */ 92433700
*   /*****************************************************************/ 92433800
*                                                                       92433900
*   DECLARE                                                             92434000
*     1    SMF99_S4_IO_PLOT_MAP BASED(*) BDY(WORD),                     92434100
*      2    SMF99_IO_PLOT_BW FIXED(32), /* SRMPLOT.9572: Bucket width*/ 92434200
*      2    SMF99_IO_PLOT_LSTX FIXED(32), /* SRMPLOT.9578: Last         92434300
*                                      plotted x bucket              */ 92434400
*      2    *        FIXED(32),     /* SRMPLOT.9589: Reserved        */ 92434500
*      2    SMF99_IO_PLOT_POINTS_OF FIXED(32), /* SRMPLOT.9595:         92434600
*                                      Offset of point entries       */ 92434700
*      2    SMF99_IO_PLOT_POINTS_ON FIXED(16), /* SRMPLOT.9601:         92434800
*                                      Number of point entries       */ 92434900
*      2    SMF99_IO_PLOT_POINTS_LN FIXED(16); /* SRMPLOT.9607:         92435000
*                                      Length of a point entry       */ 92435100
*                                                                       92435200
*   /*****************************************************************/ 92435400
*   /*                                                               */ 92435600
*   /* IRASMF99.2161: SMF99 subtype 5 Monitored AS information       */ 92435800
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                           */ 92436000
*   /*                                                               */ 92436200
*   /*****************************************************************/ 92436400
*                                                                       92436600
*   DECLARE                                                             92436800
*     1    SMF99_S5_MON_MAP BASED(*) BDY(WORD),                         92450000
*      2    SMF99ANAM CHAR(8),      /* IRASMF99.2021: jobname        */ 92493000
*      2    SMF99ACNM CHAR(8),      /* IRASMF99.2034: Class that        92536000
*                                      space is in                   */ 92579000
*      2    SMF99APNUM FIXED(31),   /* IRASMF99.2042: Period number     92622000
*                                      that space is in              */ 92665000
*      2    SMF99APCS FIXED(31),    /* IRASMF99.2813: Protective        92708000
*                                      central stor tar              */ 92751000
*      2    SMF99ARCS FIXED(31),    /* IRASMF99.2819: restrictive       92794000
*                                      central stor tar              */ 92837000
*      2    SMF99APPS FIXED(31),    /* IRASMF99.2825: protective proc   92880000
*                                      stor tar                      */ 92923000
*      2    SMF99ARPS FIXED(31),    /* IRASMF99.1437: restrictive       92966000
*                                      proc stor tar                 */ 93009000
*      2    SMF99CPLT CHAR(20),     /* IRASMF99.2837: central storage   93052000
*                                      plot                          */ 93095000
*      2    SMF99PPLT CHAR(20),     /* IRASMF99.2843: proc storage      93138000
*                                      plot                          */ 93181000
*      2    SMF99ASID BIT(16),      /* IRASMF99.1509: Address Space     93195300
*                                      ID number                 @P9A*/ 93209600
*      2    SMF99A_EXTERNAL_CLASS_NAME CHAR(8), /* IRASMF99.3555: The   93213390
*                                      name of the external class the   93215200
*                                      address space is associated      93218000
*                                      with                  @PSY0628*/ 93220800
*      2    SMF99_S5_FLAGS BIT(8) BDY(BYTE), /* IRASMF99.5537: Flags    93220890
*                                                            @WLMCGMS*/ 93220980
*       3    SMF99_S5_STG_PROTECTED_NOW BIT(1), /* IRASMF99.5718:       93221070
*                                      Storage is protected at this     93221160
*                                      instant               @WLMCGMS*/ 93221250
*       3    SMF99_S5_STGCRIT_EXPLICIT BIT(1), /* IRASMF99.5724:        93221340
*                                      Storage protected assigned to    93221430
*                                      space by classification rule     93221520
*                                                            @WLMCGMS*/ 93221610
*       3    SMF99_CTAR_SET_BY_STCR_HSK BIT(1), /* IRASMF99.5650:       93221700
*                                      Indicates, that storage          93221790
*                                      critical housekeeping was the    93221880
*                                      last who has set the storage     93221970
*                                      target for central storage       93222060
*                                                            @WLMCGMS*/ 93222150
*       3    SMF99_PTAR_SET_BY_STCR_HSK BIT(1), /* IRASMF99.5656:       93222240
*                                      Indicates, that storage          93222330
*                                      critical housekeeping was the    93222420
*                                      last who has set the storage     93222510
*                                      target for processor storage     93222600
*                                                            @WLMCGMS*/ 93222690
*       3    SMF99_CTAR_SET_BY_PA BIT(1), /* IRASMF99.5662:             93222780
*                                      Indicates, that policy           93222870
*                                      adjustment was the last who      93222960
*                                      has set the storage target for   93223050
*                                      central storage       @WLMCGMS*/ 93223140
*       3    SMF99_PTAR_SET_BY_PA BIT(1), /* IRASMF99.5668:             93223230
*                                      Indicates, that policy           93223320
*                                      adjustmnet was the last who      93223410
*                                      has set the storage target for   93223500
*                                      processor storage     @WLMCGMS*/ 93223590
*      2    *        CHAR(3);       /* IRASMF99.5674: reserved          93223680
*                                                            @WLMCGMS*/ 93223770
*                                                                       93224000
*   /*****************************************************************/ 93267000
*   /*                                                               */ 93310000
*   /* IRASMF99.2167: SMF99 subtype 5 PPLT plot data - Contains      */ 93353000
*   /* information plotted on the Processor storage paging plot for  */ 93396000
*   /* the monitored address space in this record.                   */ 93439000
*   /*                                                               */ 93482000
*   /*****************************************************************/ 93525000
*                                                                       93568000
*   DECLARE                                                             93611000
*     1    SMF99_S5_PPLT_MAP BASED(*) BDY(WORD),                        93654000
*      2    SMF99_PPLT_BW FIXED(32), /* SRMPLOT.6657: Bucket width   */ 93697000
*      2    SMF99_PPLT_LSTX FIXED(32), /* SRMPLOT.6301: Last plotted    93740000
*                                      x bucket                      */ 93783000
*      2    *        FIXED(32),     /* SRMPLOT.6248: Reserved        */ 93833000
*      2    SMF99_PPLT_POINTS_OF FIXED(32), /* SRMPLOT.6793: Offset     93912000
*                                      of point entries              */ 93955000
*      2    SMF99_PPLT_POINTS_ON FIXED(16), /* SRMPLOT.6831: Number     93998000
*                                      of point entries              */ 94041000
*      2    SMF99_PPLT_POINTS_LN FIXED(16); /* SRMPLOT.6840: Length     94084000
*                                      of a point entry              */ 94127000
*                                                                       94170000
*   /*****************************************************************/ 94213000
*   /*                                                               */ 94256000
*   /* IRASMF99.2173: SMF99 subtype 5 CPLT plot data - Contains      */ 94299000
*   /* information plotted on the Processor storage paging plot for  */ 94342000
*   /* the monitored address space in this record.                   */ 94385000
*   /*                                                               */ 94428000
*   /*****************************************************************/ 94471000
*                                                                       94514000
*   DECLARE                                                             94557000
*     1    SMF99_S5_CPLT_MAP BASED(*) BDY(WORD),                        94600000
*      2    SMF99_CPLT_BW FIXED(32), /* SRMPLOT.7288: Bucket width   */ 94643000
*      2    SMF99_CPLT_LSTX FIXED(32), /* SRMPLOT.7294: Last plotted    94686000
*                                      x bucket                      */ 94729000
*      2    *        FIXED(32),     /* SRMPLOT.7300: Reserved        */ 94779000
*      2    SMF99_CPLT_POINTS_OF FIXED(32), /* SRMPLOT.6740: Offset     94858000
*                                      of point entries              */ 94901000
*      2    SMF99_CPLT_POINTS_ON FIXED(16), /* SRMPLOT.6502: Number     94944000
*                                      of point entries              */ 94987000
*      2    SMF99_CPLT_POINTS_LN FIXED(16); /* SRMPLOT.6499: Length     95030000
*                                      of a point entry              */ 95073000
*                                                                       95073400
*   /*****************************************************************/ 95073800
*   /*                                                               */ 95074200
*   /* IRASMF99.3782: SMF99 subtype 6 self defining section          */ 95074600
*   /* BASED(addr(smf_hdr_MAP) + smf99dof)                           */ 95075000
*   /*                                                               */ 95075400
*   /*****************************************************************/ 95075800
*                                                                       95076200
*   DECLARE                                                             95076600
*     1    SMF99_S6_SDEF_MAP BASED(*) BDY(WORD),                        95077000
*      2    SMF996CPOF FIXED(32),   /* IRASMF99.3638: Offset to         95077400
*                                      service class period section     95077800
*                                      from beginning of record         95078200
*                                      (including RDW)               */ 95078600
*      2    SMF996CPLN FIXED(16),   /* IRASMF99.3644: Length of a       95079000
*                                      service class period section  */ 95079400
*      2    SMF996CPON FIXED(16);   /* IRASMF99.3650: Number of         95079800
*                                      service class period sections */ 95080200
*                                                                       95080600
*   /*****************************************************************/ 95081000
*   /*                                                               */ 95081400
*   /* IRASMF99.3794: SMF99 subtype 6 Period data section -          */ 95081800
*   /* BASED(addr(smf_hdr_MAP) + smf9926pof). The subtype 6 record   */ 95082200
*   /* contains one entry for each service class period that had     */ 95082600
*   /* recent activity.                                              */ 95083000
*   /*                                                               */ 95083400
*   /*****************************************************************/ 95083800
*                                                                       95084200
*   DECLARE                                                             95084600
*     1    SMF99_S6_PER_MAP BASED(*) BDY(WORD),                         95085000
*      2    SMF996_ECLASS_NAME CHAR(8), /* IRASMF99.3619: External      95085400
*                                      class name. For an externally    95085800
*                                      defined service class this is    95086200
*                                      the name defined in the          95086600
*                                      service definition. For a        95087000
*                                      server period this name will     95087400
*                                      be of the form $SRMSxxx. For     95087800
*                                      system service classes this      95088200
*                                      name will be $SRMBEST,           95088600
*                                      $SRMDUMP, $SRMGOOD, $SRMDISC,    95089000
*                                      or $SRMQSC.                   */ 95089400
*      2    SMF996_PER_NUM FIXED(16), /* IRASMF99.3671: Period number   95089800
*                                      within class                  */ 95090200
*      2    SMF996_GOALTYPE FIXED(8), /* IRASMF99.3677: goal type: 0    95090600
*                                      - System, SYSSTC, or server      95091000
*                                      goal, 1 - short response time,   95091400
*                                      2 - long response time, 3 -      95091800
*                                      velocity, 4 - discretionary   */ 95092200
*      2    SMF996_PERCENTILE FIXED(8), /* IRASMF99.3683: Response      95092300
*                                      time goal percentile. Zero if    95092400
*                                      period does not a percentile     95092500
*                                      response time goal.   @OW29790*/ 95092600
*      2    SMF996_ICLASS_NAME CHAR(8), /* IRASMF99.3665: Internal      95093000
*                                      service class name. Same as      95093400
*                                      SMF996_ECLASS_NAME except for    95093800
*                                      discretionary periods. For       95094200
*                                      discretionary periods the name   95094600
*                                      will be of the form $SRMDIxx. */ 95095000
*      2    SMF996_GOALVAL FIXED(32), /* IRASMF99.3689: goal value:     95095400
*                                      response time goal - goal in     95095800
*                                      milliseconds, velocity -         95096200
*                                      velocity, discretionary,         95096600
*                                      system goal or server period -   95097000
*                                      zero                          */ 95097400
*      2    SMF996_IMPOR FIXED(16), /* IRASMF99.3695: Importance of     95097800
*                                      service class period          */ 95098200
*      2    SMF996_DP FIXED(8),     /* IRASMF99.3707: Dispatching       95098600
*                                      priority of period for next      95099000
*                                      policy interval               */ 95099400
*      2    SMF996_IODP FIXED(8),   /* IRASMF99.3626: I/O priority of   95099800
*                                      period for next policy           95100200
*                                      interval                      */ 95100600
*      2    SMF996_MPLI FIXED(16),  /* IRASMF99.3719: MPL in-target     95101000
*                                      for next policy interval      */ 95101400
*      2    SMF996_MPLO FIXED(16),  /* IRASMF99.3725: MPL out-target    95101800
*                                      for next policy interval      */ 95102200
*      2    SMF996_RUA FIXED(31),   /* IRASMF99.3737: Average number    95102600
*                                      of ready address spaces over     95103000
*                                      last policy interval. Scaled     95103400
*                                      by * 16                       */ 95103800
*      2    SMF996_PSPT FIXED(32),  /* IRASMF99.3749: Time swapped      95104200
*                                      out address spaces in period     95104600
*                                      are protected from being         95105000
*                                      swapped to aux for next policy   95105400
*                                      interval. In 1.024               95105800
*                                      milliseconds.                 */ 95106200
*      2    SMF996_PSITAR FIXED(31), /* IRASMF99.3755: storage          95106600
*                                      isolation target for next        95107000
*                                      policy interval for each         95107400
*                                      address space in period, valid   95107800
*                                      only for work with short         95108200
*                                      response time goals, zero        95108600
*                                      otherwise. Frame count.       */ 95109000
*      2    SMF996_LOCAL_PI FIXED(32), /* IRASMF99.3845: local          95109400
*                                      performance index * 100       */ 95109800
*      2    SMF996_SYSPLEX_PI FIXED(32), /* IRASMF99.3851: sysplex      95110200
*                                      performance index * 100       */ 95110600
*      2    SMF996_SERVER_DATA_OF FIXED(32), /* IRASMF99.3966: Offset   95110900
*                                      to server section from           95111200
*                                      beginning of record (including   95111500
*                                      RDW). Only valid if period is    95111800
*                                      a server period. There will be   95112100
*                                      one server section entry for     95112400
*                                      each different external          95112700
*                                      service class that server        95113000
*                                      address spaces in this server    95113300
*                                      period were originally           95113600
*                                      classified to.                */ 95113900
*      2    SMF996_SERVER_DATA_LN FIXED(16), /* IRASMF99.3972: LENGTH   95114200
*                                      OF EACH SERVER SECTION ENTRY     95114500
*                                                            @OW29790*/ 95114800
*      2    SMF996_SERVER_DATA_ON FIXED(16); /* IRASMF99.3978: NUMBER   95115100
*                                      OF SERVER SECTION ENTRIES        95115400
*                                                            @OW29790*/ 95115700
*                                                                       95116000
*   /*****************************************************************/ 95159000
*   /*                                                               */ 95202000
*   /* IRASMF99.4175: SMF99 subtype 7 self defining section          */ 95202600
*   /* BASED(addr(smf_hdr_MAP) + smf99dof) for Parallel Access Volume*/ 95203000
*   /* (PAV) devices                                         @WLMCTAL*/ 95203400
*   /*                                                               */ 95203800
*   /*****************************************************************/ 95204400
*                                                                       95205000
*   DECLARE                                                             95205600
*     1    SMF99_S7_SDEF_MAP BASED(*) BDY(WORD),                        95206200
*      2    SMF997_PAV_SUBSYS_ID CHAR(32), /* IRASMF99.3867: PAV        95206800
*                                      subsystem ID a.k.a NED TOKEN  */ 95207400
*      2    SMF997_NUM_EXT_SC FIXED(32), /* IRASMF99.4180: Number of    95207500
*                                      external service class. Need     95207600
*                                      this to determine the index to   95207700
*                                      the SYSTEM service class in      95207800
*                                      the device service class         95207900
*                                      bitmap. The device service       95208000
*                                      class bitmap is in the device    95208100
*                                      data section. The number of      95208200
*                                      external service class is put    95208300
*                                      in the self defining section     95208400
*                                      to avoid repeating this value    95208500
*                                      for each device.              */ 95208600
*      2    SMF997_PAV_DATA_DEV_OF FIXED(32), /* IRASMF99.3686:         95208700
*                                      Offset to first device section   95208800
*                                      from beginning of record         95209200
*                                      (including RDW).              */ 95209800
*      2    SMF997_PAV_DATA_DEV_LEN FIXED(16), /* IRASMF99.4031:        95210400
*                                      Length of each device section */ 95211000
*      2    SMF997_PAV_DATA_DEV_NO FIXED(16); /* IRASMF99.4129:         95211600
*                                      number of device section      */ 95212200
*                                                                       95212800
*   /*****************************************************************/ 95213400
*   /*                                                               */ 95214000
*   /* IRASMF99.4187: SMF99 subtype 7 PAV device section             */ 95214500
*   /* based(addr(smf_hdr_map) + smf997_pavh_data_dev_of). for       */ 95215000
*   /* Parallel Access Volume (PAV) devices. There will be one entry */ 95215500
*   /* for each PAV base device or unbound alias associated with the */ 95216000
*   /* PAV subsystem                                         @WLMCTAL*/ 95216500
*   /*                                                               */ 95217000
*   /*****************************************************************/ 95217600
*                                                                       95218200
*   DECLARE                                                             95218800
*     1    SMF99_S7_PAV_DEV_MAP BASED(*) BDY(DWORD),                    95219400
*      2    SMF997_PAV_DEV_ID FIXED(16), /* IRASMF99.5258: Device ID */ 95220000
*      2    SMF997_PAV_DEV_FLAGS BIT(8) BDY(BYTE), /* IRASMF99.5264:    95220600
*                                      Device flags                  */ 95221200
*       3    SMF997_PAV_UNBOUND_ALIAS_DEV BIT(1), /* IRASMF99.5270:     95221800
*                                      PAV device is an unbound alias*/ 95222400
*       3    SMF997_PAV_DEV_WLM_MANAGED BIT(1), /* IRASMF99.5276: PAV   95223000
*                                      device managed by WLM         */ 95223600
*       3    SMF997_PAV_DEV_TEMP_UNAVAIL BIT(1), /* IRASMF99.5282:      95224200
*                                      PAV device temporary             95224800
*                                      unavailable                   */ 95225400
*      2    SMF997_PAV_DEV_NUM_OF_ALIASES FIXED(8), /* IRASMF99.5288:   95226000
*                                      Number of aliases assigned.      95226600
*                                      Valid for PAV base device     */ 95227200
*      2    SMF997_PAV_DEV_AVG_IOS_QUEUE_LEN /* IRASMF99.5294:          95227800
*                                      Average IOS queue length.        95228400
*                                      Valid for PAV base device     */ 95229000
*               FIXED(32),                                              95229600
*      2    SMF997_PAV_DEV_AVG_SERVICE_TIME /* IRASMF99.5300: Average   95230200
*                                      service time. Valid for PAV      95230800
*                                      base device in 128 micro         95231200
*                                      seconds                       */ 95231600
*               FIXED(32),                                              95232000
*      2    SMF997_PAV_DEV_IODELAY_TIME FIXED(32), /* IRASMF99.5306:    95232200
*                                      I/O Delay Time. Currently CU     95232400
*                                      Queue time                    */ 95232600
*      2    SMF997_PAV_DEV_IODELAY_SAMPS FIXED(16), /* IRASMF99.5312:   95232800
*                                      I/O Delay samples     @OW39854*/ 95233000
*      2    SMF997_PAV_DEV_IOSQSAMPLES FIXED(16), /* IRASMF99.5318:     95233200
*                                      IOS Queue samples     @OW39854*/ 95233400
*      2    SMF997_PAV_DEV_RSRVD1 FIXED(32), /* IRASMF99.5324:          95233600
*                                      reserved              @OW39854*/ 95233800
*      2    SMF997_PAV_DEV_DEVSC_DATA BDY(DWORD), /* IRASMF99.5330:     95234000
*                                      Device service class bitmap      95234400
*                                      data                          */ 95235000
*       3    SMF997_PAV_DEV_DEVSC_MAP BIT(112), /* IRASMF99.5336:       95235600
*                                      Device service class id bit      95236200
*                                      string                @OW39854*/ 95236800
*       3    *        BIT(16),      /* IRASMF99.5342: Reserved so       95237400
*                                      device sclass bitmap is on a     95238000
*                                      double word boundary. @OW39854*/ 95238100
*      2    SMF997_PAV_DEV_UTILIZATION FIXED(32), /* IRASMF99.5348:     95238200
*                                      Utilization           @OW39854*/ 95238300
*      2    SMF997_PAV_DEV_PENDTIME FIXED(32), /* IRASMF99.5354: Pend   95238400
*                                      time                  @OW39854*/ 95238500
*      2    SMF997_PAV_DEV_DISCTIME FIXED(32), /* IRASMF99.5360:        95238600
*                                      Disconnect time       @OW39854*/ 95238700
*      2    SMF997_PAV_DEV_SSC FIXED(32), /* IRASMF99.5366: Start       95238800
*                                      subchannel count      @OW39854*/ 95238900
*      2    SMF997_PAV_DEV_RSRVD2(3) FIXED(32); /* IRASMF99.5372:       95239000
*                                      Reserved              @OW39854*/ 95239100
*                                                                       95239200
*   /*****************************************************************/ 95239300
*   /*                                                               */ 95239400
*   /* IRASMF99.4294: SMF99 subtype 8 self defining section          */ 95239500
*   /* BASED(addr(smf_hdr_MAP) + smf99dof) for LPAR Management Data  */ 95239600
*   /*                                                       @WLMCLPM*/ 95239700
*   /*                                                               */ 95239800
*   /*****************************************************************/ 95239900
*                                                                       95240000
*   DECLARE                                                             95240100
*     1    SMF99_S8_SDEF_MAP BASED(*) BDY(WORD),                        95240200
*      2    SMF998_LD_DATA_OFFSET FIXED(32), /* IRASMF99.4110: Offset   95240300
*                                      to LPAR Data section from        95240400
*                                      beginning of record (including   95240500
*                                      RDW)                  @WLMCLPM*/ 95240600
*      2    SMF998_LD_DATA_LENGTH FIXED(16), /* IRASMF99.4064: Length   95240700
*                                      of a LPAR Data section           95240800
*                                                            @WLMCLPM*/ 95240900
*      2    SMF998_LD_DATA_NUMBER FIXED(16), /* IRASMF99.4915: Number   95241000
*                                      of LPAR Data sections @WLMCLPM*/ 95241100
*      2    SMF998_PT_DATA_OFFSET FIXED(32), /* IRASMF99.4422: Offset   95241200
*                                      to Priority Table section from   95241300
*                                      beginning of record (including   95241400
*                                      RDW)                  @WLMCLPM*/ 95241500
*      2    SMF998_PT_DATA_LENGTH FIXED(16), /* IRASMF99.4222: Length   95241600
*                                      of a Priority Table section      95241700
*                                                            @WLMCLPM*/ 95241800
*      2    SMF998_PT_DATA_NUMBER FIXED(16), /* IRASMF99.3763: Number   95241900
*                                      of Priority Table sections       95242000
*                                                            @WLMCLPM*/ 95242100
*      2    SMF998_PC_DATA_OFFSET FIXED(32), /* IRASMF99.4048: Offset   95242200
*                                      to Period CPU section from       95242300
*                                      beginning of record (including   95242400
*                                      RDW)                  @WLMCLPM*/ 95242500
*      2    SMF998_PC_DATA_LENGTH FIXED(16), /* IRASMF99.3744: Length   95242600
*                                      of a Period CPU section          95242700
*                                                            @WLMCLPM*/ 95242800
*      2    SMF998_PC_DATA_NUMBER FIXED(16); /* IRASMF99.4105: Number   95242900
*                                      of Period CPU sections           95243000
*                                                            @WLMCLPM*/ 95243100
*                                                                       95243200
*   /*****************************************************************/ 95243300
*   /*                                                               */ 95243400
*   /* IRASMF99.4300: SMF99 subtype 8 LPAR Data entry - Represents   */ 95243500
*   /* LPAR information for another active partition in the same     */ 95243600
*   /* LPAR. BASED(addr(smf_hdr_map) + smf998_ld_data_offset).       */ 95243700
*   /*                                                               */ 95243800
*   /*****************************************************************/ 95243900
*                                                                       95244000
*   DECLARE                                                             95244100
*     1    SMF99_S8_LD_MAP BASED(*) BDY(WORD),                          95244200
*                                                                       95244300
*     /***************************************************************/ 95244400
*     /*                                                             */ 95244500
*     /* IRASMF99.4156: PL/X block comment                           */ 95244600
*     /*                                                             */ 95244700
*     /***************************************************************/ 95244800
*                                                                       95244900
*/********************************************************************/ 95245000
*/*                                                                  */ 95245100
*/* - The LD entry always exists in a SMF 99 subtype 8 record.       */ 95245200
*/*                                                                  */ 95245300
*/* - The LD entry always has the SMF998_ImageSystemName field       */ 95245400
*/*   set to the system that the SMF 99 subtype 8 record is          */ 95245500
*/*   associated with.                                               */ 95245600
*/*                                                                  */ 95245700
*/* - If any flags are set in SMF998_ControlFlag1 then the data      */ 95245800
*/*   in the LD entry has not be fill in due to the flag             */ 95245900
*/*   condition.                                                     */ 95246000
*/*                                                                  */ 95246100
*/********************************************************************/ 95246200
*                                                                       95246300
*@SPACE;                                                                95246400
*      2    SMF998_ImageSystemName CHAR(8), /* IRASMF99.4375: Image     95246500
*                                      System name           @WLMCLPM*/ 95246600
*      2    SMF998_ControlFlag1 BIT(8) BDY(BYTE), /* IRASMF99.4103:     95246700
*                                      Control flag that indicates      95246800
*                                      why the rest of the data in      95246900
*                                      the LD entry has not been        95247000
*                                      filled in.            @WLMCLPM*/ 95247100
*       3    SMF998_OverFlow BIT(1), /* IRASMF99.4155: Indicates that   95247200
*                                      this is an overflow SMF 99       95247300
*                                      subtype 8 record for specified   95247400
*                                      system. The appropriate LD       95247500
*                                      data for this system appears     95247600
*                                      in the first SMF 99 subtype 8    95247700
*                                      record for this system.          95247800
*                                                            @WLMCLPM*/ 95247900
*       3    SMF998_NoDiag304Support BIT(1), /* IRASMF99.4078:          95248000
*                                      Indicates that this system       95248100
*                                      does not have DIAG '0304'        95248200
*                                      support               @WLMCLPM*/ 95248300
*       3    SMF998_WlmLparMgmtNotEnabled BIT(1), /* IRASMF99.5132:     95248400
*                                      Indicates that WLM LPAR          95248500
*                                      Management not enabled           95248600
*                                                            @WLMCLPM*/ 95248700
*       3    SMF998_DiagFailed BIT(1), /* IRASMF99.5127: Indicates      95248800
*                                      that this system issued DIAG     95248900
*                                      '0304' and it failed  @WLMCLPM*/ 95249000
*       3    SMF998_DiagImageNotFound BIT(1), /* IRASMF99.5138:         95249100
*                                      Indicates that and image entry   95249200
*                                      was not returned via the DIAG    95249300
*                                      '0304' interface for this        95249400
*                                      system                @WLMCLPM*/ 95249500
*      2    SMF998_SystemNumber FIXED(8), /* IRASMF99.5490: System      95249600
*                                      slot number. The source for      95249700
*                                      this value is QUASNUM in         95249800
*                                      IXCYQUAA.             @WLMCDCM*/ 95249900
*      2    SMF998_Reserved1 CHAR(2), /* IRASMF99.4144: Reserved        95250000
*                                                            @WLMCLPM*/ 95250100
*      2    SMF998_LastSetTime BIT(64), /* IRASMF99.4080: Timestamp     95250200
*                                      in STCK format        @WLMCLPM*/ 95250300
*      2    SMF998_TotalWeight FIXED(31), /* IRASMF99.4084: Total       95250400
*                                      weight of the CEC     @WLMCLPM*/ 95250500
*      2    SMF998_NumberOfSharedPhysicalCPUs /* IRASMF99.4094: Total   95250600
*                                      number of shared                 95250700
*                                      (non-dedicated) physical CPU     95250800
*                                      configured for the CEC use       95250900
*                                                            @WLMCLPM*/ 95251000
*               FIXED(8),                                               95251100
*      2    SMF998_Reserved2 CHAR(3), /* IRASMF99.4118: Reserved        95251200
*                                                            @WLMCLPM*/ 95251300
*      2    SMF998_ImageID FIXED(8), /* IRASMF99.4392: Image ID of      95251400
*                                      the partition         @WLMCLPM*/ 95251500
*      2    SMF998_ImageFlags BIT(8) BDY(BYTE), /* IRASMF99.4329:       95251600
*                                      Image Flags WLMCLPM   @WLMCLPM*/ 95251700
*       3    SMF998_ImageIsCapped BIT(1), /* IRASMF99.4339: Image is    95251800
*                                      a capped image by software.      95251900
*                                                            @WLMCLPM*/ 95252000
*       3    SMF998_WlmLparWeightManagement BIT(1), /* IRASMF99.4345:   95252100
*                                      Switch that identifies whether   95252200
*                                      WLM should be involved in        95252300
*                                      dynamic LPAR weight management   95252400
*                                                            @WLMCLPM*/ 95252500
*       3    SMF998_ImageHasSharedCPs BIT(1), /* IRASMF99.4351:         95252600
*                                      Identifies whether partition     95252700
*                                      is using shared-CPs   @WLMCLPM*/ 95252800
*       3    SMF998_ImageHasDedicatedCPs BIT(1), /* IRASMF99.4357:      95252900
*                                      Identifies whether partition     95253000
*                                      is using dedicated-CPs           95253100
*                                                            @WLMCLPM*/ 95253200
*       3    SMF998_ImageInitialCapping BIT(1), /* IRASMF99.4363:       95253300
*                                      Identifies whether partition     95253400
*                                      is capped by installation        95253500
*                                      through hardware console         95253600
*                                                            @WLMCLPM*/ 95253700
*      2    SMF998_Reserved3 CHAR(2), /* IRASMF99.4369: Reserved        95253800
*                                                            @WLMCLPM*/ 95253900
*      2    SMF998_NumberCpusActive FIXED(15), /* IRASMF99.5501:        95254000
*                                      Number of CPUS that are          95254100
*                                      currently alive       @WLMCLPM*/ 95254200
*      2    SMF998_AverageCpuUtilization FIXED(15), /* IRASMF99.5502:   95254300
*                                      Average CPU utilization          95254400
*                                                            @WLMCLPM*/ 95254500
*      2    SMF998_ImageInitialWeight FIXED(16), /* IRASMF99.4381:      95254600
*                                      Image initial weight  @WLMCLPM*/ 95254700
*      2    SMF998_ImageCurrentWeight FIXED(16), /* IRASMF99.4387:      95254800
*                                      Image current weight  @WLMCLPM*/ 95254900
*      2    SMF998_ImageMinimumWeight FIXED(16), /* IRASMF99.4399:      95255000
*                                      Image minimum weight  @WLMCLPM*/ 95255100
*      2    SMF998_ImageMaximumWeight FIXED(16); /* IRASMF99.4405:      95255200
*                                      Image maximum weight  @WLMCLPM*/ 95255300
*                                                                       95255400
*   /*****************************************************************/ 95255500
*   /*                                                               */ 95255600
*   /* IRASMF99.4845: SMF99 subtype 8 Priority table entry -         */ 95255700
*   /* Represents information for another active partition in the    */ 95255800
*   /* same LPAR. Information pertains to the demand being put on the*/ 95255900
*   /* processor by work at different dispatch priorities.           */ 95256000
*   /* BASED(addr(smf_hdr_map) + smf998_pd_data_offset).             */ 95256100
*   /*                                                               */ 95256200
*   /*****************************************************************/ 95256300
*                                                                       95256400
*   DECLARE                                                             95256500
*     1    SMF99_S8_PT_MAP BASED(*) BDY(WORD),                          95256600
*      2    SMF998_PTPRTY FIXED(15), /* IRASMF99.4436: Dispatch         95256700
*                                      priority              @WLMCLPM*/ 95256800
*      2    SMF998_PTNP FIXED(15),  /* IRASMF99.4439: New dispatch      95256900
*                                      priority (zero if not changed)   95257000
*                                                            @WLMCLPM*/ 95257100
*      2    SMF998_PTIMDP FIXED(31), /* IRASMF99.4447: Initial          95257200
*                                      maximum percentage of            95257300
*                                      processor demanded at            95257400
*                                      priority, initial value before   95257500
*                                      any priority moves or slice      95257600
*                                      changes               @WLMCLPM*/ 95257700
*      2    SMF998_PTPMDP FIXED(31), /* IRASMF99.4453: Projected        95257800
*                                      maximum percentage of            95257900
*                                      processor demanded at priority   95258000
*                                                            @WLMCLPM*/ 95258100
*      2    SMF998_PTCPUU FIXED(31), /* IRASMF99.4457: CPU using        95258200
*                                      samples at priority   @WLMCLPM*/ 95258300
*      2    SMF998_PTCPUD FIXED(31), /* IRASMF99.4705: CPU delay        95258400
*                                      samples at priority   @WLMCLPM*/ 95258500
*      2    SMF998_PTW2UR FIXED(31), /* IRASMF99.4707: Wait-to-using    95258600
*                                      ratio at priority (*16)          95258700
*                                                            @WLMCLPM*/ 95258800
*      2    SMF998_PTAPU FIXED(31), /* IRASMF99.4481: Actual measured   95258900
*                                      processor used at priority       95259000
*                                                            @WLMCLPM*/ 95259100
*      2    SMF998_PTPPU FIXED(31), /* IRASMF99.4486: Projected         95259200
*                                      processor time to be used at     95259300
*                                      priority              @WLMCLPM*/ 95259400
*      2    SMF998_PTACMD FIXED(31), /* IRASMF99.4716: Achievable       95259500
*                                      cumulative max demand for        95259600
*                                      priorities affected by a move    95259700
*                                                            @WLMCLPM*/ 95259800
*      2    *        FIXED(31),     /* IRASMF99.4722: Reserved          95259900
*                                                            @WLMCLPM*/ 95260000
*      2    SMF998_PTIMAXD FIXED(31), /* IRASMF99.4728: Initial         95260100
*                                      cumulative maximum demand        95260200
*                                                            @WLMCLPM*/ 95260300
*      2    SMF998_PTWMAXD FIXED(31), /* IRASMF99.4734: Projected       95260400
*                                      cumulative maximum demand        95260500
*                                                            @WLMCLPM*/ 95260600
*      2    SMF998_PTIAMTW FIXED(31), /* IRASMF99.4740: Initial         95260700
*                                      average mean time to wait        95260800
*                                                            @WLMCLPM*/ 95260900
*      2    SMF998_PTWAMTW FIXED(31); /* IRASMF99.4746: Projected       95261000
*                                      average mean time to wait        95261100
*                                                            @WLMCLPM*/ 95261200
*                                                                       95261300
*   /*****************************************************************/ 95261400
*   /*                                                               */ 95261500
*   /* IRASMF99.4306: SMF99 subtype 8 CPU period table entry -       */ 95261600
*   /* Represents information for another active partition in the    */ 95261700
*   /* same LPAR. Information pertains to CPU data per service class */ 95261800
*   /* period. based(addr(smf_hdr_map) + smf998_pc_data_offset).     */ 95261900
*   /*                                                               */ 95262000
*   /*****************************************************************/ 95262100
*                                                                       95262200
*   DECLARE                                                             95262300
*     1    SMF99_S8_PC_MAP BASED(*) BDY(WORD),                          95262400
*      2    SMF998_Service_Class_Name CHAR(8), /* IRASMF99.5407:        95262500
*                                      Internal service class name      95262600
*                                                            @WLMCLPM*/ 95262700
*      2    SMF998_Importance FIXED(16), /* IRASMF99.4755: Importance   95262800
*                                                            @WLMCLPM*/ 95262900
*      2    SMF998_Period_Number FIXED(16), /* IRASMF99.5402: Period    95263000
*                                      number                @WLMCLPM*/ 95263100
*      2    SMF998_Reserved1 CHAR(4), /* IRASMF99.5401: Reserved        95263200
*                                                            @WLMCLPM*/ 95263300
*      2    SMF998_Dasd_Io_Delay_Sample FIXED(31), /* IRASMF99.4958:    95263400
*                                      Copy of IO delay sample          95263500
*                                                            @WLMCLPM*/ 95263600
*      2    SMF998_Non_Idle_Samp FIXED(31), /* IRASMF99.4804: Number    95263700
*                                      of non-idle samples   @WLMCLPM*/ 95263800
*      2    SMF998_Cpu_Using_Sample FIXED(31), /* IRASMF99.4810: Copy   95263900
*                                      of CPU using sample   @WLMCLPM*/ 95264000
*      2    SMF998_Cpu_Delay_Sample FIXED(31), /* IRASMF99.4816: Copy   95264100
*                                      of CPU delay sample   @WLMCLPM*/ 95264200
*      2    SMF998_Wlm_Queue_Delay_Sample FIXED(31), /*                 95264300
*                                      IRASMF99.4822: Copy of WLM       95264400
*                                      queue delay sample    @WLMCLPM*/ 95264500
*      2    SMF998_Dasd_Io_Using_Sample FIXED(31), /* IRASMF99.4828:    95264600
*                                      Copy of DASD IO using sample     95264700
*                                                            @WLMCLPM*/ 95264800
*      2    SMF998_Max_Dem_Per FIXED(31), /* IRASMF99.4850: Maximum     95264900
*                                      percentage of processor time     95265000
*                                      demanded (constant across        95265100
*                                      policy adjustment) for small     95265200
*                                      consumer              @WLMCLPM*/ 95265300
*      2    SMF998_Pi_Achieved FIXED(31), /* IRASMF99.4880:             95265400
*                                      Performance index achieved,      95265500
*                                      adjusted into range, used to     95265600
*                                      select donors and receivers      95265700
*                                                            @WLMCLPM*/ 95265800
*      2    SMF998_Sysplex_Pi_Achieved FIXED(31), /* IRASMF99.4886:     95265900
*                                      Sysplex performance index        95266000
*                                      achieved, adjusted into range,   95266100
*                                      used to select donors and        95266200
*                                      receivers             @WLMCLPM*/ 95266300
*      2    SMF998_Service_Ow FIXED(31), /* IRASMF99.4932: Average      95266400
*                                      service over window   @WLMCLPM*/ 95266500
*      2    SMF998_Mtw_Adj FIXED(31), /* IRASMF99.4938: Mean time to    95266600
*                                      wait adjusted by cccmxmtw        95266700
*                                                            @WLMCLPM*/ 95266800
*      2    SMF998_Base_Priority FIXED(15), /* IRASMF99.4960: Base      95266900
*                                      dispatching priority  @WLMCLPM*/ 95267000
*      2    SMF998_Cap_Num_Slices FIXED(15), /* IRASMF99.4097:          95267100
*                                      Current number of sleep slices   95267200
*                                      or 0                  @WLMCLPM*/ 95267300
*      2    SMF998_Work_Pro_Used FIXED(31), /* IRASMF99.5016: Working   95267400
*                                      variable for assess for          95267500
*                                      processor used        @WLMCLPM*/ 95267600
*      2    SMF998_Current_Ach_Dem_Per FIXED(31), /* IRASMF99.5022:     95267700
*                                      Current achievable demand        95267800
*                                      percentage for the period        95267900
*                                      calculated from the initial      95268000
*                                      PDT fields.           @WLMCLPM*/ 95268100
*      2    SMF998_Ach_Dem_Per FIXED(31), /* IRASMF99.5028: Working     95268200
*                                      variable for achievable demand   95268300
*                                      percentage            @WLMCLPM*/ 95268400
*      2    SMF998_Old_Work_Pro_Used FIXED(31), /* IRASMF99.5034:       95268500
*                                      Work field computed during       95268600
*                                      phase 1 move          @WLMCLPM*/ 95268700
*      2    SMF998_Proj_Pi_Com FIXED(31), /* IRASMF99.5040:             95268800
*                                      Unadjusted projected PI for      95268900
*                                      committed actions only, used     95269000
*                                      as base for projections          95269100
*                                                            @WLMCLPM*/ 95269200
*      2    SMF998_Using_Delta FIXED(31), /* IRASMF99.5046: Computed    95269300
*                                      during assessment     @WLMCDCM*/ 95269400
*      2    SMF998_LparMgmt_Delay_Delta FIXED(31), /* IRASMF99.5058:    95269500
*                                      Delay delta computed by LPAR     95269600
*                                      Mgmt algorithm. This field       95269700
*                                      captures the delay delta for     95269800
*                                      SMF99 recording before it is     95269900
*                                      cleared out.          @WLMCLPM*/ 95270000
*      2    SMF998_Cpu_Cap_Delay_Sample FIXED(31), /* IRASMF99.5052:    95270100
*                                      CPU capping delay sample         95270200
*                                                            @WLMCLPM*/ 95270300
*      2    SMF998_Iosub_Samples_Data_Offset /* IRASMF99.4772: Offset   95270400
*                                      to I/O subsystem samples data    95270500
*                                      from beginning of record         95270600
*                                      (including RDW)       @WLMCDCM*/ 95270700
*               FIXED(32),                                              95270800
*      2    SMF998_Iosub_Samples_Data_Length /* IRASMF99.4766: Length   95270900
*                                      of a I/O subsystem samples       95271000
*                                      data section          @WLMCDCM*/ 95271100
*               FIXED(16),                                              95271200
*      2    SMF998_Iosub_Samples_Data_number /* IRASMF99.4754: Number   95271300
*                                      of I/O subsystem samples data    95271400
*                                      sections              @WLMCDCM*/ 95271500
*               FIXED(16);                                              95271600
*                                                                       95271700
*   /*****************************************************************/ 95271800
*   /*                                                               */ 95271900
*   /* IRASMF99.5220: SMF99 subtype 9 self defining section          */ 95272000
*   /* BASED(addr(smf_hdr_MAP) + smf99dof) for Dynamic CHPID         */ 95272100
*   /* management                                            @WLMCDCM*/ 95272200
*   /*                                                               */ 95272300
*   /*****************************************************************/ 95272400
*                                                                       95272500
*   DECLARE                                                             95272600
*     1    SMF99_S9_SDEF_MAP BASED(*) BDY(WORD),                        95272700
*      2    SMF999_IO_SUBSYSTEM_DATA_OFFSET /* IRASMF99.4788: Offset    95272800
*                                      to IO Subsystem data section     95272900
*                                      from beginning of record         95273000
*                                      (including RDW)       @WLMCDCM*/ 95273100
*               FIXED(32),                                              95273200
*      2    SMF999_IO_SUBSYSTEM_DATA_LENGTH /* IRASMF99.4794: Length    95273300
*                                      of IO Subsystem Data section     95273400
*                                                            @WLMCDCM*/ 95273500
*               FIXED(16),                                              95273600
*      2    SMF999_IO_SUBSYSTEM_DATA_NUMBER /* IRASMF99.4803: Number    95273700
*                                      of IO Subsytem Data sections     95273800
*                                                            @WLMCDCM*/ 95273900
*               FIXED(16),                                              95274000
*      2    SMF999_IOSUB_PLOT_OF FIXED(32), /* IRASMF99.5074: Offset    95274100
*                                      to IO Subsystem plots @WLMCDCM*/ 95274200
*      2    SMF999_IOSUB_PLOT_LN FIXED(16), /* IRASMF99.5083: Length    95274300
*                                      of IO Subsystem plots @WLMCDCM*/ 95274400
*      2    SMF999_IOSUB_PLOT_ON FIXED(16), /* IRASMF99.4773: Number    95274500
*                                      of IO Subsystem plots @WLMCDCM*/ 95274600
*      2    SMF999_CHANNEL_DATA_OF FIXED(32), /* IRASMF99.5513:         95274700
*                                      Offset to Channel Data section   95274800
*                                                            @PXD1343*/ 95274900
*      2    SMF999_CHANNEL_DATA_LN FIXED(16), /* IRASMF99.5516:         95275000
*                                      Length of Channel Data section   95275100
*                                                            @PXD1343*/ 95275200
*      2    SMF999_CHANNEL_DATA_ON FIXED(16); /* IRASMF99.5520:         95275300
*                                      Number of Channel Data section   95275400
*                                                            @PXD1343*/ 95275500
*                                                                       95275600
*   /*****************************************************************/ 95275700
*   /*                                                               */ 95275800
*   /* IRASMF99.5239: SMF99 subtype 9 Chpid data entry - Represents  */ 95275900
*   /* I/O subsystem information. BASED(addr(smf_hdr_map) +          */ 95276000
*   /* smf999_io_subsystem_data_offset)                      @WLMCDCM*/ 95276100
*   /*                                                               */ 95276200
*   /*****************************************************************/ 95276300
*                                                                       95276400
*   DECLARE                                                             95276500
*     1    SMF99_S9_IO_SUBSYSTEM_MAP BASED(*) BDY(WORD),                95276600
*      2    SMF999_FLAG1 BIT(8) BDY(BYTE), /* IRASMF99.4021: IO         95276700
*                                      subsystem flags       @WLMCDCM*/ 95276800
*       3    SMF999_FLOAT_CAPABLE BIT(1), /* IRASMF99.5409: Indicates   95276900
*                                      that the IO subsystem is float   95277000
*                                      capable               @WLMCDCM*/ 95277100
*      2    SMF999_RESERVED CHAR(7), /* IRASMF99.5390: Reserved         95277200
*                                                            @WLMCDCM*/ 95277300
*      2    SMF999_TOKEN_NED CHAR(32), /* IRASMF99.4925: Token NED of   95277400
*                                      I/O Subsystem         @WLMCDCM*/ 95277500
*      2    SMF999_IOSUB_TARGET_VELOCITY FIXED(31), /* IRASMF99.4931:   95277600
*                                      I/O subsystem target velocity    95277700
*                                                            @WLMCDCM*/ 95277800
*      2    SMF999_IOSUB_VELOCITY FIXED(31), /* IRASMF99.4977: The      95277900
*                                      I/O velocity of the subsystem    95278000
*                                                            @WLMCDCM*/ 95278100
*      2    SMF999_IOSUB_AVG_SVC_TIME FIXED(31), /* IRASMF99.4903:      95278200
*                                      Average service time over 2      95278300
*                                      minutes               @WLMCDCM*/ 95278400
*      2    SMF999_IOSUB_CHECK_POINT_TIME FIXED(31), /*                 95278500
*                                      IRASMF99.4983: Average service   95278600
*                                      time of the subsystem when SRM   95278700
*                                      set a target          @WLMCDCM*/ 95278800
*      2    SMF999_IOSUB_INDEX FIXED(15), /* IRASMF99.5155: IO          95278900
*                                      Subsystem Index       @WLMCDCM*/ 95279000
*      2    SMF999_LCU_SQNUMBER FIXED(16); /* IRASMF99.5532: LCU        95279100
*                                      sequence number       @PXD1551*/ 95279200
*                                                                       95279300
*   /*****************************************************************/ 95279400
*   /*                                                               */ 95279500
*   /* IRASMF99.2477: SMF99 subtype 9 I/O subsystem Plot section.    */ 95279600
*   /* BASED(addr(smf_hdr_map) + smf999_iosub_plot_of)       @WLMCDCM*/ 95279700
*   /*                                                               */ 95279800
*   /*****************************************************************/ 95279900
*                                                                       95280000
*   DECLARE                                                             95280100
*     1    SMF99_S9_IOSUB_MAP BASED(*) BDY(WORD),                       95280200
*      2    SMF99_IOSUB_BW FIXED(32), /* SRMWPLOT.1350: Bucket width */ 95280300
*      2    SMF99_IOSUB_LSTX FIXED(32), /* SRMWPLOT.1356: Last          95280400
*                                      plotted x bucket              */ 95280500
*      2    *        FIXED(32),     /* SRMWPLOT.1362: Reserved       */ 95280600
*      2    SMF99_IOSUB_POINTS_OF FIXED(32), /* SRMWPLOT.1368: Offset   95280700
*                                      of point entries              */ 95280800
*      2    SMF99_IOSUB_POINTS_ON FIXED(16), /* SRMWPLOT.1374: Number   95280900
*                                      of point entries              */ 95281000
*      2    SMF99_IOSUB_POINTS_LN FIXED(16); /* SRMWPLOT.1380: Length   95281100
*                                      of a point entry              */ 95281200
*                                                                       95281300
*   /*****************************************************************/ 95281400
*   /*                                                               */ 95281500
*   /* IRASMF99.5611: SMF99 subtype 9 Chpid data entry - Represents  */ 95281600
*   /* Channel Data information. BASED(addr(smf_hdr_map) +           */ 95281700
*   /* smf999_channel_data_of)                               @PXD1343*/ 95281800
*   /*                                                               */ 95281900
*   /*****************************************************************/ 95282000
*                                                                       95282100
*   DECLARE                                                             95282200
*     1    SMF99_S9_CHANNEL_MAP BASED(*) BDY(WORD),                     95282300
*      2    SMF999_CHANNEL_ID FIXED(8), /* IRASMF99.5565: IO            95282400
*                                      Subsystem channel ID  @PXD1343*/ 95282500
*      2    SMF999_CHANNEL_TYPE FIXED(8), /* IRASMF99.5571: IO          95282600
*                                      Subsystem channel type           95282700
*                                                            @PXD1343*/ 95282800
*      2    SMF999_CHANNEL_FLAG BIT(8) BDY(BYTE), /* IRASMF99.5577:     95282900
*                                      IO Subsystem channel flags bit   95283000
*                                      indicators if channel is         95283100
*                                      managed or not        @PXD1343*/ 95283200
*       3    SMF999_MANAGED_BY_WLM BIT(1), /* IRASMF99.5540:            95283300
*                                      Indicates that this Channel      95283400
*                                      can be managed by WLM @PXD1343*/ 95283500
*      2    SMF999_CHANNEL_RESERVED CHAR(1), /* IRASMF99.5583:          95283600
*                                      Reserved              @PXD1343*/ 95283700
*      2    SMF999_CHANNEL_UTILIZATION FIXED(31); /* IRASMF99.5589:     95283800
*                                      IO Subsystem Channel             95283900
*                                      utilization for the current      95284000
*                                      data collection interval         95284100
*                                                            @PXD1343*/ 95284200
*                                                                       95284300
*   /*****************************************************************/ 95284400
*   /*                                                               */ 95284500
*   /* IRASMF99.2185: SMF99 subtype 2 xmem delay data                */ 95284600
*   /* BASED(addr(smf_hdr_MAP) + smf99_pxmem_of) or                  */ 95288000
*   /* BASED(addr(smf_hdr_MAP) + smf99_sxmem_of)                     */ 95331000
*   /*                                                               */ 95374000
*   /*****************************************************************/ 95417000
*                                                                       95460000
*   DECLARE                                                             95503000
*     1    SMF99_XMEM_MAP BASED(*) BDY(WORD),                           95546000
*      2    SMF99_XMEM_JOBN CHAR(8), /* IRASMF99.1452: jobname of       95589000
*                                      space we are delayed on       */ 95632000
*      2    SMF99_XMEM_SAMPS FIXED(32); /* IRASMF99.1461: number of     95675000
*                                      xmem samples                  */ 95718000
*                                                                       95761000
*   /*****************************************************************/ 95804000
*   /*                                                               */ 95847000
*   /* IRASMF99.2197: SMF99 subtype 2 server data                    */ 95890000
*   /* BASED(addr(smf_hdr_MAP) + smf99_pserv_of)                     */ 95933000
*   /*                                                               */ 95976000
*   /*****************************************************************/ 96019000
*                                                                       96062000
*   DECLARE                                                             96105000
*     1    SMF99_SERVER_MAP BASED(*) BDY(WORD),                         96148000
*      2    SMF99_SERVER_CNM CHAR(8), /* IRASMF99.1478: Class that      96191000
*                                      period belongs to             */ 96234000
*      2    SMF99_SERVER_PNUM FIXED(32), /* IRASMF99.1482: Period       96277000
*                                      number                        */ 96320000
*      2    SMF99_SERVER_OBS FIXED(32); /* IRASMF99.1488: Percentage    96363000
*                                      of time this server was          96406000
*                                      serving the period            */ 96449000
*                                                                       96492000
*   /*****************************************************************/ 96535000
*   /*                                                               */ 96578000
*   /* IRASMF99.1209: SMF99 subtype 2 server sample data             */ 96578300
*   /* BASED(addr(smf_hdr_MAP) + smf99_server_sdata_of)      @WLMCESM*/ 96578600
*   /*                                                               */ 96578900
*   /*****************************************************************/ 96579200
*                                                                       96579500
*   DECLARE                                                             96579800
*     1    SMF99_SDATA_MAP BASED(*) BDY(WORD),                          96580100
*      2    SMF99_SDATA_WQDEL FIXED(32), /* IRASMF99.1107: Delay        96580400
*                                      samples waiting on WLM-managed   96580700
*                                      work queue            @WLMCESM*/ 96581000
*      2    SMF99_SDATA_ENC_AUXP FIXED(32), /* IRASMF99.1125: aux       96581300
*                                      private paging delay samples     96581600
*                                      experienced by enclave work      96581900
*                                      units known to be associated     96582200
*                                      with an address space @WLMCESM*/ 96582500
*      2    SMF99_SDATA_ENC_VIO FIXED(32), /* IRASMF99.1121: aux VIO    96582800
*                                      paging delay samples             96583100
*                                      experienced by enclave work      96583400
*                                      units known to be associated     96583700
*                                      with an address space @WLMCESM*/ 96584000
*      2    SMF99_SDATA_ENC_HSP FIXED(32), /* IRASMF99.1127: aux        96584300
*                                      standard hiperspace paging       96584600
*                                      delay samples experienced by     96584900
*                                      enclave work units known to be   96585200
*                                      associated with an address       96585500
*                                      space                 @WLMCESM*/ 96585800
*      2    SMF99_SDATA_ENC_MPLD FIXED(32), /* IRASMF99.1160: MPL       96586100
*                                      delay samples experienced by     96586400
*                                      enclave work units known to be   96586700
*                                      associated with an address       96587000
*                                      space                 @WLMCESM*/ 96587300
*      2    SMF99_SDATA_ENC_ASWP FIXED(32), /* IRASMF99.1166: aux       96587600
*                                      swap delay samples experienced   96587900
*                                      by enclave work units known to   96588200
*                                      be associated with an address    96588500
*                                      space                 @WLMCESM*/ 96588800
*      2    SMF99_SDATA_SERVER_CLASS_NAME CHAR(8), /* IRASMF99.3241:    96589100
*                                      class name of disp serving       96589400
*                                      this period or blank for batch   96589500
*                                                            @WLMCESM*/ 96589600
*      2    SMF99_SDATA__SERVER_TYPE BIT(8) /* IRASMF99.3348: Type      96589700
*                                      byte                  @PSY0628*/ 96589800
*               BDY(BYTE),                                              96589900
*       3    SMF99_SDATA_ENC_OR_Q_SERVER BIT(1), /* IRASMF99.3569:      96590000
*                                      Server is an enclave or queue    96590100
*                                      server                @PSY0628*/ 96590200
*       3    SMF99_SDATA_BATCH BIT(1), /* IRASMF99.3575: Server is a    96590300
*                                      batch work queue      @PSY0628*/ 96590400
*      2    *        CHAR(3),       /* IRASMF99.3581: reserved          96590500
*                                                            @PSY0628*/ 96590600
*      2    SMF99_SDATA_SUBSYS_TYPE CHAR(4), /* IRASMF99.3562:          96590700
*                                      Subsystem type of owner of the   96590800
*                                      queue. Only applies to batch     96590900
*                                      queue servers.        @PSY0628*/ 96591000
*      2    SMF99_SDATA_SUBSYS_NAME CHAR(8); /* IRASMF99.3351:          96591100
*                                      Subsystem name of owner of the   96591200
*                                      queue. Only applies to batch     96591300
*                                      queue servers.        @PSY0628*/ 96591400
*                                                                       96591500
*   /*****************************************************************/ 96591600
*   /*                                                               */ 96591700
*   /* IRASMF99.1188: SMF99 subtype 2 queue server data              */ 96591800
*   /* BASED(addr(smf_hdr_MAP) + smf99_server_qdata_of)      @WLMCESM*/ 96591900
*   /*                                                               */ 96592000
*   /*****************************************************************/ 96592100
*                                                                       96592200
*   DECLARE                                                             96592400
*     1    SMF99_QDATA_MAP BASED(*) BDY(WORD),                          96592700
*      2    SMF99_QDATA_ENV_NAME CHAR(32), /* IRASMF99.1238:            96593000
*                                      associated environment name      96593300
*                                      for the queue                 */ 96593600
*      2    SMF99_QDATA_SERVER_CLASS_NAME CHAR(8), /* IRASMF99.3247:    96593900
*                                      class name of disp serving the   96594200
*                                      period represented by this       96594500
*                                      subtype 2 record. Only applies   96594600
*                                      to queue manager type servers.   96594700
*                                                            @WLMCBAT*/ 96594800
*      2    SMF99_QDATA_SERVER_WANT FIXED(32), /* IRASMF99.1237:        96595100
*                                      Number of server instances       96595400
*                                      needed to address queue delay    96595700
*                                      according to policy              96596000
*                                      adjustment. This is a queue      96596300
*                                      wide count.                   */ 96596600
*      2    SMF99_QDATA_SERVER_HAVE FIXED(32), /* IRASMF99.1241:        96596900
*                                      Current actual number of         96597200
*                                      server instances bound to the    96597500
*                                      queue. This is a queue wide      96597800
*                                      count.                        */ 96598100
*      2    SMF99_QDATA_SERVER_ACTIVE FIXED(32), /* IRASMF99.1251:      96598400
*                                      Current actual number of         96598700
*                                      server instances bound to the    96599000
*                                      queue and between Begin and      96599300
*                                      End. This is a subset of the     96599600
*                                      Have count. Have minus Active    96599900
*                                      equals Idle.                  */ 96600200
*      2    SMF99_QDATA_AS_CAPACITY FIXED(32), /* IRASMF99.1257:        96600500
*                                      Address space server instance    96600800
*                                      capacity                      */ 96601100
*      2    SMF99_QDATA_ACHIEVED_QMPL FIXED(32), /* IRASMF99.1263:      96601400
*                                      average number (over policy      96601700
*                                      interval) of server instances    96602000
*                                      that are in swapped in spaces    96602300
*                                      in the DISP. Only counts         96602600
*                                      server instances serving the     96602900
*                                      external service classs          96603200
*                                      associated with the queue.       96603500
*                                      Scaled by * 16. Not used for     96603700
*                                      batch queue servers.          */ 96603900
*      2    SMF99_QDATA_ACTIVE_QMPL FIXED(32), /* IRASMF99.1272:        96604100
*                                      average of numer of server       96604400
*                                      instance between Begin and End   96604700
*                                      during policy interval. Scaled   96605000
*                                      by * 16. For batch queue         96605100
*                                      servers this is the number of    96605200
*                                      initiators with active jobs      96605300
*                                      sysplex wide. @WLMCBAT.       */ 96605400
*      2    SMF99_QDATA_QMPL_IN_TAR FIXED(32), /* IRASMF99.1368:        96605600
*                                      Number of address spaces         96605900
*                                      suggested to be started in the   96606200
*                                      DISP on behalf of the period     96606500
*                                      represented by this subtype 2.   96606700
*                                      Does not apply to batch queue    96606900
*                                      servers.                      */ 96607100
*      2    SMF99_QDATA_AVG_QUEUED_REQUESTS /* IRASMF99.3125: Average   96607400
*                                      number of queued requests over   96607700
*                                      a policy interval scaled by *    96608000
*                                      16                    @WLMCESM*/ 96608300
*               FIXED(32),                                              96608600
*      2    SMF99_QDATA_LT_TOTAL_REQUESTS FIXED(32), /*                 96608900
*                                      IRASMF99.3088: Long term         96609200
*                                      average total requests (queued   96609500
*                                      + active) scaled by   @PQC1544*/ 96609800
*      2    SMF99_QDATA_SERVER_IDLE FIXED(32), /* IRASMF99.3320:        96610100
*                                      Average idle server instances    96610400
*                                      over policy interval          */ 96610700
*      2    SMF99_QDATA_Q_TYPE BIT(8) BDY(BYTE), /* IRASMF99.3098:      96610800
*                                      Type byte                     */ 96610900
*       3    SMF99_QDATA_QUEUE_MANAGER BIT(1), /* IRASMF99.3326:        96611000
*                                      queue manager type work queue */ 96611100
*       3    SMF99_QDATA_BATCH BIT(1), /* IRASMF99.3330: Batch type     96611200
*                                      work queue                    */ 96611300
*      2    SMF99_QDATA_Q_QUALIFIER BIT(8) BDY(BYTE) /*                 96611400
*                                      IRASMF99.3259: Work Queue        96611500
*                                      Qualifier             @WLMCSTT*/ 96611600
*               ,                                                       96611700
*       3    SMF99_QDATA_TASKS_MANAGED BIT(1), /* IRASMF99.4685:        96611800
*                                      Server instances are managed     96611900
*                                      by WLM                @WLMCSTT*/ 96612000
*       3    SMF99_QDATA_SPACES_MOVED_BY_HSK BIT(1), /*                 96612004
*                                      IRASMF99.5776: Address spaces    96612010
*                                      have been moved from this work   96612012
*                                      queue to enforce the minimum     96612016
*                                      number of servers of another     96612020
*                                      work queue of the same           96612024
*                                      application environment          96612028
*                                                            @OW42779*/ 96612032
*       3    SMF99_QDATA_SPACES_MOVED_BY_PA BIT(1), /* IRASMF99.5782:   96612038
*                                      Address spaces have been moved   96612040
*                                      during policy adjustment         96612044
*                                      because the maximum number of    96612048
*                                      servers has been already         96612052
*                                      started for the application      96612056
*                                      environment           @OW42779*/ 96612060
*       3    SMF99_QDATA_AE_SPREADMIN BIT(1), /* IRASMF99.5788:         96612066
*                                      Minimum number of address        96612068
*                                      spaces must be ditributed        96612072
*                                      across all work queues of the    96612076
*                                      application environment          96612080
*                                                            @OW42779*/ 96612084
*      2    SMF99_QDATA_ACTIVE_RGNWORK FIXED(16), /* IRASMF99.5841:     96612110
*                                      Current active number of         96612120
*                                      server processing work           96612130
*                                      requests which have been         96612140
*                                      routed directly to the server    96612150
*                                      region. This number is neither   96612160
*                                      included in the idle nor the     96612170
*                                      active server count.  @OW45238*/ 96612180
*      2    SMF99_QDATA_RQDATA_OF FIXED(32), /* IRASMF99.3472: Offset   96612300
*                                      to remote queue data section     96612500
*                                      from beginning of record         96612900
*                                      (including RDW). Only applies    96613300
*                                      to batch queue server @PSY0628*/ 96613700
*      2    SMF99_QDATA_RQDATA_LN FIXED(16), /* IRASMF99.3478: Length   96614100
*                                      of remote queue data entries     96614500
*                                                            @PSY0628*/ 96614900
*      2    SMF99_QDATA_RQDATA_ON FIXED(16), /* IRASMF99.3484: Number   96615300
*                                      of remote queue data entries     96615700
*                                                            @PSY0628*/ 96616100
*      2    SMF99_QDATA_SUBSYS_TYPE CHAR(4), /* IRASMF99.3536:          96616500
*                                      Subsystem type of owner of the   96616900
*                                      queue. Only applies to batch     96617300
*                                      queue servers.        @PSY0628*/ 96617700
*      2    SMF99_QDATA_SUBSYS_NAME CHAR(8), /* IRASMF99.3542:          96618100
*                                      Subsystem name of owner of the   96618500
*                                      queue. Only applies to batch     96618900
*                                      queue servers.        @PSY0628*/ 96619300
*      2    SMF99_QDATA_INST_PER_SERVER FIXED(16), /* IRASMF99.3490:    96619440
*                                      Number of server instances per   96619500
*                                      server. Only applies if          96619600
*                                      SMF99_QDATA- _TASKS_MANAGED is   96619700
*                                      set                   @WLMCSTT*/ 96619800
*      2    SMF99_QDATA_SPACES_MOVED FIXED(16), /* IRASMF99.5794:       96619830
*                                      Number of server address         96619840
*                                      spaces moved away from this      96619860
*                                      queue.                @OW42779*/ 96619880
*      2    SMF99_QDATA_AE_MAXLIMIT FIXED(16), /* IRASMF99.5800:        96620615
*                                      Maximum number of servers for    96620620
*                                      the application environment.     96620630
*                                                            @OW42779*/ 96620640
*      2    SMF99_QDATA_AE_MINLIMIT FIXED(16), /* IRASMF99.5806:        96620655
*                                      Minimum number of servers for    96620660
*                                      the application environment.     96620670
*                                                            @OW42779*/ 96620680
*      2    SMF99_QDATA_AVG_INELIGIBLE_REQUESTS /* IRASMF99.4691:       96620720
*                                      Average number of ineligible     96620730
*                                      queued requests over a policy    96620740
*                                      interval scaled by * 16.         96620750
*                                      Currently applies to batch       96620760
*                                      queues only.          @OW50407*/ 96620770
*               FIXED(32);                                              96620780
*                                                                       96620800
*   /*****************************************************************/ 96620900
*   /*                                                               */ 96621000
*   /* IRASMF99.3530: SMF99 subtype 2 remote queue server data.      */ 96621300
*   /* Contains information on the state of a batch work queue on a  */ 96621700
*   /* specific system. There is one RQDATA section for each system a*/ 96622100
*   /* batch work queue is registered on including the local system. */ 96622500
*   /* BASED(addr(smf_hdr_MAP) + smf99_qdata_rqdata_of)      @WLMCESM*/ 96622900
*   /*                                                               */ 96623300
*   /*****************************************************************/ 96623700
*                                                                       96624100
*   DECLARE                                                             96624500
*     1    SMF99_RQDATA_MAP BASED(*) BDY(WORD),                         96624900
*      2    SMF99_RQDATA_SYS_NAME CHAR(8), /* IRASMF99.3391: name of    96625300
*                                      system this RQDATA section       96625700
*                                      represents                    */ 96626100
*      2    SMF99_RQDATA_FLAGS BIT(32) BDY(BYTE), /* IRASMF99.3397:     96626500
*                                      flags                 @PSY0628*/ 96626900
*       3    SMF99_RQDATA_JUST_STARTED_SERVER BIT(1), /*                96627300
*                                      IRASMF99.3403: This system       96627700
*                                      started at least one server      96628100
*                                      for this work queue in the       96628500
*                                      policy interval that this data   96628900
*                                      represents            @PSY0628*/ 96629300
*       3    SMF99_RQDATA_CANNOT_START_SERVER BIT(1), /*                96629700
*                                      IRASMF99.3409: This system       96630100
*                                      cannot start any servers for     96630500
*                                      this work queue due to some      96630900
*                                      constraint            @PSY0628*/ 96631300
*       3    SMF99_RQDATA_DEFERRED_STARTING_SERVER /* IRASMF99.3415:    96631700
*                                      This system wanted to add        96632100
*                                      servers for this work queue on   96632500
*                                      the just-completed policy        96632900
*                                      interval, but deferred since     96633300
*                                      another system appears to be a   96633700
*                                      better candidate.     @PSY0628*/ 96634100
*                BIT(1),                                                96634500
*       3    SMF99_RQDATA_MANAGED BIT(1), /* IRASMF99.3421: Work        96634900
*                                      queue is managed on this         96635300
*                                      system                @PSY0628*/ 96635700
*       3    SMF99_RQDATA_ASSESS_DATA_VALID BIT(1), /* IRASMF99.3814:   96635800
*                                      Originator sent valid assess     96635900
*                                      data                  @PSY0690*/ 96636000
*      2    SMF99_RQDATA_ACTIVE_SERVERS FIXED(32), /* IRASMF99.3427:    96636100
*                                      10-second average number of      96636500
*                                      active servers scaled by * 16    96636900
*                                                            @PSY0628*/ 96637300
*      2    SMF99_RQDATA_TOTAL_SERVERS FIXED(32), /* IRASMF99.3433:     96637700
*                                      10-second average total          96638100
*                                      servers. Includes active and     96638500
*                                      idle servers.                 */ 96638900
*      2    SMF99_RQDATA_AVG_TOTAL_REQ FIXED(32), /* IRASMF99.3496:     96639300
*                                      Average total requests for the   96639700
*                                      queue eligible to run on the     96640100
*                                      system respresented by this      96640500
*                                      RQDATA entry. This corresponds   96640900
*                                      to the last point plotted on     96641300
*                                      the queue delay plot. Scaled     96641700
*                                      by * 16.                      */ 96642100
*      2    SMF99_RQDATA_DEFERRAL_INFORMATION, /* IRASMF99.3439: This   96642500
*                                      info valid only if               96642800
*                                      smf99_rqdat-                     96643100
*                                      a_assess_data_valid is on        96643400
*                                                            @PSY0690*/ 96643700
*       3    SMF99_RQDATA_#_SERVERS FIXED(32), /* IRASMF99.3442:        96644100
*                                      Number of servers required for   96644500
*                                      receiver value        @PSY0628*/ 96644900
*       3    SMF99_RQDATA_PI_DELTA FIXED(31), /* IRASMF99.3448: PI      96645300
*                                      delta for donor period of        96645700
*                                      highest importance if servers    96646100
*                                      are started           @PSY0628*/ 96646500
*       3    SMF99_RQDATA_HIGHEST_IMP FIXED(16), /* IRASMF99.3454:      96646900
*                                      Highest importance of donor      96647300
*                                      periods negatively affected if   96647700
*                                      servers are started   @PSY0628*/ 96648100
*       3    *        CHAR(2),      /* IRASMF99.3460: reserved for      96648500
*                                      alignment             @PSY0628*/ 96648900
*       3    SMF99_RQDATA_WAITING_FOR_SYSNAME CHAR(8) /*                96649300
*                                      IRASMF99.3466: System name       96649700
*                                      sender is deferring to. Blank    96650100
*                                      if deferring only to collect     96650500
*                                      data from other systems.         96650900
*                                                            @PSY0628*/ 96651300
*                ,                                                      96651700
*       3    SMF99_RQDATA_DONOR_CLASS CHAR(8), /* IRASMF99.3593:        96652100
*                                      Class name for donor period      96652500
*                                      most impacted by starting        96652900
*                                      servers               @PSY0628*/ 96653300
*       3    SMF99_RQDATA_PER# FIXED(32), /* IRASMF99.3599: Period      96653700
*                                      number with in class of donor    96654100
*                                                            @PSY0628*/ 96654500
*       3    SMF99_RQDATA_DONOR_RGROUP CHAR(8), /* IRASMF99.3844:       96654600
*                                      resource group name for donor    96654700
*                                      period most impacted by          96654800
*                                      starting servers      @PSY0690*/ 96654900
*      2    SMF99_RQDATA_PA_SKIP FIXED(15), /* IRASMF99.3587: policy    96655000
*                                      adjustment skip clock @PSY0690*/ 96655100
*      2    SMF99_RQDATA_Q_SKIP FIXED(8), /* IRASMF99.3829: defer       96655200
*                                      processing skip clock @PSY0690*/ 96655300
*      2    SMF99_RQDATA_Q_SKIP_REASON FIXED(8), /* IRASMF99.3838:      96655400
*                                      reason defer processing skip     96655500
*                                      clock was set         @PSY0690*/ 96655600
*      2    SMF99_RQDATA_AVG_QUEUED_REQUESTS /* IRASMF99.4683:          96655710
*                                      average number of queued         96655720
*                                      requests over a policy           96655730
*                                      interval scaled by * 16          96655740
*                                                            @OW50407*/ 96655750
*               FIXED(32),                                              96655760
*      2    SMF99_RQDATA_AVG_INELIGIBLE_REQUESTS /* IRASMF99.4843:      96655770
*                                      average number of ineligible     96655780
*                                      queued requests over a policy    96655790
*                                      interval scaled by * 16          96655800
*                                                            @OW50407*/ 96655810
*               FIXED(32),                                              96655820
*      2    *        CHAR(4);       /* IRASMF99.3820: reserved          96655830
*                                                            @OW50407*/ 96655840
*                                                                       96655900
*   /*****************************************************************/ 96656000
*   /*                                                               */ 96656100
*   /* IRASMF99.2221: SMF99 subtype 2 address space expanded storage */ 96656500
*   /* access policy BASED(addr(smf_hdr_MAP) + smf99_pesp_of)        */ 96664000
*   /*                                                               */ 96707000
*   /*****************************************************************/ 96750000
*                                                                       96793000
*   DECLARE                                                             96836000
*     1    SMF99_AS_ESP_MAP BASED(*) BDY(WORD),                         96886000
*      2    SMF99_AS_ESP_ANAM CHAR(8), /* IRASMF99.1530: Address        97653000
*                                      space name                    */ 97696000
*      2    SMF99_AS_ESP_AP FIXED(8), /* IRASMF99.1536: expanded        97739000
*                                      storage access policy for        97782000
*                                      demand                        */ 97825000
*      2    SMF99_AS_ESP_VP FIXED(8), /* IRASMF99.275: expanded         97868000
*                                      storage access policy for VIO */ 97911000
*      2    SMF99_AS_ESP_HP FIXED(8), /* IRASMF99.279: expanded         97954000
*                                      storage access policy for        97997000
*                                      hiperspace                    */ 98040000
*      2    SMF99_AS_ESP_ASID BIT(16), /* IRASMF99.2852: Address        98054300
*                                      Space ID number           @P9A*/ 98068600
*      2    SMF99_AS_ESP_FLAGS BIT(8) BDY(BYTE), /* IRASMF99.5692:      98069540
*                                      Flags                 @WLMCGMS*/ 98069580
*       3    SMF99_AS_STG_PROTECTED_NOW BIT(1), /* IRASMF99.5698:       98069620
*                                      Storage is protected at this     98069660
*                                      instant               @WLMCGMS*/ 98069700
*       3    SMF99_AS_STGCRIT_EXPLICIT BIT(1), /* IRASMF99.5704:        98069740
*                                      Storage protected assigned to    98069780
*                                      space by classification rule     98069820
*                                                            @WLMCGMS*/ 98069860
*       3    SMF99_AS_MANAGED_TO_REGION_GOALS BIT(1), /*                98069900
*                                      IRASMF99.5710: Address space     98069940
*                                      is currently manged to           98069980
*                                      region's goal rather than        98070020
*                                      transaction server's goal        98070060
*                                                            @WLMCGMT*/ 98070100
*      2    *        BIT(16),       /* IRASMF99.1328: Reserved          98070140
*                                                            @WLMCGMS*/ 98070180
*      2    SMF99_AS_ESP_CS_FMCT FIXED(31), /* IRASMF99.1334: Number    98070400
*                                      of central storage frames the    98071300
*                                      address spaces owns   @WLMCESM*/ 98072200
*      2    SMF99_AS_ESP_ES_FMCT FIXED(31), /* IRASMF99.1337: Number    98073100
*                                      of expanded storage frames the   98074000
*                                      address spaces owns   @WLMCESM*/ 98074900
*      2    SMF99_AS_ESP_PPS_TAR FIXED(31); /* IRASMF99.1343: Address   98075800
*                                      space protective process         98076700
*                                      storage target. Note see         98077600
*                                      subtype 5 for other targets.     98078500
*                                      This is the only target          98079400
*                                      non-monitor address spaces can   98080300
*                                      have.                 @WLMCESM*/ 98081200
*                                                                       98083000
*   /*****************************************************************/ 98126000
*   /*                                                               */ 98169000
*   /* IRASMF99.2233: SMF99 subtype 1, 3, and 5 - map to format      */ 98212000
*   /* points on a plot with one curve BASED(addr(smf_hdr_MAP) +     */ 98255000
*   /* smf99_pprp_points_of or smf99_mplp_points_of or               */ 98298000
*   /* smf99_swpp_points_of or smf99_pasp_points_of or               */ 98341000
*   /* smf99_ruap_points_of or smf99_pagp_points_of or               */ 98384000
*   /*                                                               */ 98427000
*   /*****************************************************************/ 98470000
*                                                                       98513000
*   DECLARE                                                             98556000
*     1    SMF99_ONE_CURVE_POINT_MAP BASED(*) BDY(WORD),                98599000
*      2    SMF99_PLOT_XVAL FIXED(32), /* SRMBPLOT.1177: X value of     98642000
*                                      point plotted in a bucket     */ 98685000
*      2    SMF99_PLOT_YVAL FIXED(32); /* SRMBPLOT.1186: Y value of     98728000
*                                      point plotted in a bucket     */ 98771000
*                                                                       98814000
*   /*****************************************************************/ 98857000
*   /*                                                               */ 98900000
*   /* IRASMF99.2855: SMF99 subtype 3 - map to format points on a    */ 98903700
*   /* plot with two curves                                  @WLMCSTT*/ 98907400
*   /* BASED(addr(smf_hdr_MAP) + smf99_ains_points_of or             */ 98911100
*   /* smf99_tins_points_of or                                       */ 98914800
*   /*                                                               */ 98918500
*   /*****************************************************************/ 98922200
*                                                                       98925900
*   DECLARE                                                             98929600
*     1    SMF99_TWO_CURVE_POINT_MAP BASED(*) BDY(WORD),                98933300
*      2    SMF99_2PLOT_XVAL FIXED(32), /* SRMPLOT.7373: X value of     98937000
*                                      point plotted in a bucket        98940700
*                                                            @WLMCSTT*/ 98944400
*      2    SMF99_2PLOT_Y1VAL FIXED(32), /* SRMPLOT.7258: Y value of    98948100
*                                      point plotted on first curve     98951800
*                                                            @WLMCSTT*/ 98955500
*      2    SMF99_2PLOT_Y2VAL FIXED(32); /* SRMPLOT.6735: Y value of    98959200
*                                      point plotted on second curve    98962900
*                                                            @WLMCSTT*/ 98966600
*                                                                       98970300
*   /*****************************************************************/ 98974000
*   /*                                                               */ 98977700
*   /* IRASMF99.4321: SMF99 subtype 5 - map to format points on a    */ 98981400
*   /* plot with three curves BASED(addr(smf_hdr_MAP) +              */ 98986000
*   /* smf99_pplt_points_of or smf99_cplt_points_of or               */ 99029000
*   /*                                                               */ 99072000
*   /*****************************************************************/ 99115000
*                                                                       99158000
*   DECLARE                                                             99201000
*     1    SMF99_THREE_CURVE_POINT_MAP BASED(*) BDY(WORD),              99244000
*      2    SMF99_3PLOT_XVAL FIXED(32), /* SRMPLOT.5692: X value of     99287000
*                                      point plotted in a bucket     */ 99330000
*      2    SMF99_3PLOT_Y1VAL FIXED(32), /* SRMPLOT.5698: Y value of    99373000
*                                      point plotted on first curve  */ 99416000
*      2    SMF99_3PLOT_Y2VAL FIXED(32), /* SRMPLOT.7753: Y value of    99459000
*                                      point plotted on second curve */ 99502000
*      2    SMF99_3PLOT_Y3VAL FIXED(32); /* SRMPLOT.7759: Y value of    99545000
*                                      point plotted on third curve  */ 99588000
*                                                                       99589100
*   /*****************************************************************/ 99590200
*   /*                                                               */ 99591300
*   /* IRASMF99.3994: SMF99 SUBTYPE 6 SERVER SECTION.                */ 99591400
*   /* BASED(ADDR(SMF_HDR_MAP) + SMF996_SERVER_DATA_OF). EACH SUBTYPE*/ 99591500
*   /* 6 ENTRY ASSOCIATED WITH A SERVER PERIOD WILL HAVE A SERVER    */ 99591600
*   /* SECTION. THERE WILL BE ONE SERVER SECTION ENTRY FOR EACH      */ 99591700
*   /* DIFFERENT EXTERNAL SERVICE CLASSTHAT SERVER ADDRESS SPACES IN */ 99591800
*   /* THE SERVER PERIOD WERE ORIGINALLY CLASSIFIED TO.      @OW29790*/ 99591900
*   /*                                                               */ 99592000
*   /*****************************************************************/ 99592100
*                                                                       99592200
*   DECLARE                                                             99592300
*     1    SMF99_S6_SERVER_MAP BASED(*) BDY(WORD),                      99592400
*      2    SMF99_S6_SERVER_CLASS_NAME CHAR(8), /* IRASMF99.3928:       99592500
*                                      NAME OF SERVICE CLASS THAT AT    99592600
*                                      LEAST ONE OF THE SERVER          99592700
*                                      ADDRESS SPACES IN THE SERVER     99592800
*                                      PERIOD REPRESENTED BY THE        99592900
*                                      SUBTYPE 6 ENTRY WAS ORIGINAL     99593000
*                                      CLASSIFIED TO         @OW29790*/ 99593100
*      2    SMF99_S6_SERVER_PER_NUM FIXED(32); /* IRASMF99.3934:        99593200
*                                      PERIOD NUMBER WITH IN CLASS      99593300
*                                                            @OW29790*/ 99593400
*                                                                       99593500
*   /*****************************************************************/ 99593600
*   /*                                                               */ 99593700
*   /* IRASMF99.5444: SMF99 SUBTYPE 2 AND 8 I/O SUBSYSTEM SAMPLES    */ 99593800
*   /* DATA. SUBTYPE 2: BASED(ADDR(SMF_HDR_MAP) + SMF99_IOSUBSAMOF). */ 99593900
*   /* SUBTYPE 8: BASED(ADDR(SMF_HDR_MAP) +                          */ 99594000
*   /* SMF998_IOSUB_SAMPLES_DATA_OF).                        @WLMCDCM*/ 99594100
*   /*                                                               */ 99594200
*   /*****************************************************************/ 99594300
*                                                                       99594400
*   DECLARE                                                             99594500
*     1    SMF99_IOSUB_SAMPLES_MAP BASED(*) BDY(HWORD),                 99594600
*      2    SMF99_IOSUB_Index FIXED(15), /* IRASMF99.5456: Subsystem    99594700
*                                      index. This correlates with      99594800
*                                      SMF999_IOSUB_INDEX.   @WLMCDCM*/ 99594900
*      2    SMF99_IOSUB_Reserved FIXED(15), /* IRASMF99.5437:           99595000
*                                      Reserved              @WLMCDCM*/ 99595100
*      2    SMF99_IOSUB_ConnectSamples FIXED(15), /* IRASMF99.5431:     99595200
*                                      Connect samples       @WLMCDCM*/ 99595300
*      2    SMF99_IOSUB_PendingSamples FIXED(15); /* IRASMF99.5462:     99595400
*                                      Pending samples       @WLMCDCM*/ 99595500
*                                                                       99595600
*   /*****************************************************************/ 99595700
*   /*                                                               */ 99595800
*   /* IRASMF99.3339: Version 1 = MVS SP5.1.0                @PSY0628*/ 99595900
*   /*                                                               */ 99596000
*   /*****************************************************************/ 99596100
*                                                                       99596200
*   DECLARE                                                             99596800
*     smf99_ver1 FIXED(16) CONSTANT('01');                              99597900
*                                                                       99599000
*   /*****************************************************************/ 99600100
*   /*                                                               */ 99601200
*   /* IRASMF99.3357: Version 3 = OS/390 1.3.0               @PSY0628*/ 99602300
*   /*                                                               */ 99603400
*   /*****************************************************************/ 99604500
*                                                                       99605600
*   DECLARE                                                             99606700
*     smf99_ver3 FIXED(16) CONSTANT('03');                              99607800
*                                                                       99608900
*   /*****************************************************************/ 99610000
*   /*                                                               */ 99611100
*   /* IRASMF99.3366: Version 4 = OS/390 2.4.0               @PSY0628*/ 99612200
*   /*                                                               */ 99613300
*   /*****************************************************************/ 99614400
*                                                                       99615500
*   DECLARE                                                             99616600
*     smf99_ver4 FIXED(16) CONSTANT('04');                              99617700
*                                                                       99618800
*   /*****************************************************************/ 99619900
*   /*                                                               */ 99621000
*   /* IRASMF99.3954: Version 4 = OS/390 2.4.0 + OW29790             */ 99622100
*   /*                                                               */ 99623200
*   /*****************************************************************/ 99624300
*                                                                       99625400
*   DECLARE                                                             99626500
*     SMF99_VER4A FIXED(16) CONSTANT('05');                             99626700
*                                                                       99626900
*   /*****************************************************************/ 99627100
*   /*                                                               */ 99627300
*   /* IRASMF99.3909: Version 6 = OS/390 2.6.0               @WLMCTAL*/ 99627500
*   /*                                                               */ 99627700
*   /*****************************************************************/ 99627900
*                                                                       99628100
*   DECLARE                                                             99628300
*     smf99_ver7 FIXED(16) CONSTANT('07');                              99628400
*                                                                       99628500
*   /*****************************************************************/ 99628600
*   /*                                                               */ 99628700
*   /* IRASMF99.4052: Version 9 = OS/390 2.7.0               @WLMCTAL*/ 99628800
*   /*                                                               */ 99628900
*   /*****************************************************************/ 99629000
*                                                                       99629100
*   DECLARE                                                             99629200
*     smf99_ver9 FIXED(16) CONSTANT('09');                              99629300
*                                                                       99629400
*   /*****************************************************************/ 99629500
*   /*                                                               */ 99629600
*   /* IRASMF99.4312: Version 12 = OS/390 Release 10         @WLMCLPM*/ 99629700
*   /*                                                               */ 99629800
*   /*****************************************************************/ 99629900
*                                                                       99630000
*   DECLARE                                                             99630100
*     smf99_ver12 FIXED(16) CONSTANT('12');                             99631000
*                                                                       99632000
*   /*****************************************************************/ 99633500
*   /*                                                               */ 99634000
*   /* IRASMF99.3375: Current version                        @WLMCLPM*/ 99634500
*   /*                                                               */ 99635000
*   /*****************************************************************/ 99635300
*                                                                       99635600
*   DECLARE                                                             99635900
*     smf99_current_ver FIXED(16) CONSTANT('12');                       99636200
*                                                                       99636500
*   /*****************************************************************/ 99636800
*   /*                                                               */ 99637100
*   /* IRASMF99.4490: original version                               */ 99637400
*   /*                                                               */ 99638000
*   /*****************************************************************/ 99639500
*                                                                       99641000
*   DECLARE                                                             99642500
*     SMF99V2_VER0 FIXED(16) CONSTANT(0);                               99644000
*                                                                       99645500
*   /*****************************************************************/ 99647000
*   /*                                                               */ 99648500
*   /* IRASMF99.4499: Records with OW37216                           */ 99650000
*   /*                                                               */ 99651500
*   /*****************************************************************/ 99653000
*                                                                       99654500
*   DECLARE                                                             99656000
*     SMF99V2_VER1 FIXED(16) CONSTANT(1);                               99657500
*                                                                       99659000
*   /*****************************************************************/ 99660500
*   /*                                                               */ 99662000
*   /* IRASMF99.4508: Records with queue service time plot   @OW42779*/ 99664580
*   /*                                                               */ 99665000
*   /*****************************************************************/ 99666500
*                                                                       99668000
*   DECLARE                                                             99669500
*     SMF99V2_VER2 FIXED(16) CONSTANT(2);                               99671090
*                                                                       99671180
*   /*****************************************************************/ 99671270
*   /*                                                               */ 99671360
*   /* IRASMF99.5740: GMI support                            @OW43855*/ 99671480
*   /*                                                               */ 99671540
*   /*****************************************************************/ 99671630
*                                                                       99671720
*   DECLARE                                                             99671810
*     SMF99V3_VER3 FIXED(16) CONSTANT(3);                               99671940
*                                                                       99671980
*   /*****************************************************************/ 99672020
*   /*                                                               */ 99672060
*   /* IRASMF99.5749: Current version 2                      @OW43855*/ 99672100
*   /*                                                               */ 99672140
*   /*****************************************************************/ 99672180
*                                                                       99672220
*   DECLARE                                                             99672260
*     SMF99V2_CURRENT_VER FIXED(16) CONSTANT(3);                        99672300
*/* End of PL/X Source                                               */ 99672500
* %IF IRASMF99_LIST ~= 'NO' &                                           99674000
*    ZCBPRINT ~= 'NO' %THEN                                             99717000
*   %GOTO IRASMF99_4;                                                   99760000
*   @LIST POP NOECHO;                                                   99803000
* %IRASMF99_4:;                                                         99846000
* %END;                                                                 99889000
