*        %GOTO PLSDPL;                                               /* 00050000
         MACRO                                                          00100000
         ISGDPL                                                         00150000
**/                                                                     00200000
*%PLSDPL: ;                                                             00250000
*/*  START OF SPECIFICATIONS ****                                       00300000
*                                                                       00350000
*01*  MACRO-NAME = ISGDPL                                               00400000
*                                                                       00450000
*01*  MACDATE = 10/31/81                                                00466600
*                                                                       00516600
*01*  DESCRIPTIVE-NAME = DEQ PURGE LIST                                 00566600
*                                                                       00614700
*01*  COPYRIGHT =                                                       00662800
*                5740-XYN COPYRIGHT IBM CORP 1980,1981,                 00710900
*                LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,            00759000
*                REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083. 00807100
*                                                                       00855200
*01*  STATUS = OS/VS2 JBB1326                                           00903300
*                                                                       00951400
*01*  FUNCTION = DEFINES THE DATA REQUIRED TO COMPLETE A SYSID,         01000000
*                ASID, OR TCB DEQ PURGE REQUEST. THE DEQ PURGE          01050000
*                LIST (DPL) IS USED AS INPUT TO ISGGDEQP AND            01100000
*                ISGGQWB5 (ENTRY  POINT IN ISGGQWB0).                   01150000
*                                                                       01250000
*01*  METHOD-OF-ACCESS = BAL - DSECT IS PRODUCED REQUIRING A            01300000
*                              USING ON THE DPL.                        01350000
*                        PLS - DPL DECLARED AS A BASED STRUCTURE.       01400000
*                              DPLPTR MUST BE DECLARED.                 01450000
*                                                                       01500000
*01*  CREATED-BY = CALLERS OF ISGGDEQP AND ISGGQWB5.                    01550000
*                                                                       01600000
*02*    SUBPOOL = ANY IN THE GRS ADDRESS  SPACE OR COMMON AREA.         01650000
*                                                                       01700000
*02*    KEY     = 0                                                     01750000
*                                                                       01800000
*02*    SIZE    = 20 BYTES                                              01850000
*                                                                       01900000
*01*  DELETED-BY = CALLERS OF ISGGDEQP AND ISGGQWB5.                    01950000
*                                                                       02000000
*01*  POINTED-TO-BY = POINTER IS MAINTAINED BY USER OF THE MACRO.       02050000
*                                                                       02100000
*01*  SERIALIZATION = ANY - PROVIDED BY THE USER OF THE MACRO.          02150000
*                                                                       02200000
*01*   CHANGE-ACTIVITY =                                                02208000
*               THIS MACRO SUPPORTS THE FOLLOWING APARS:                02216000
*                    OZ56189 - ADD FLAG DPLGVQWB REPLACING              02224000
*                              DPLPRSV4                        @ZA56189 02232000
*                                                                       02240000
**** END OF SPECIFICATIONS **                                        */ 02250000
*/*A000000-999999                                            @G387PYC*/ 02300000
*        %GOTO PLSDPL1;                                              /* 02350000
DPL      DSECT                                                          02400000
         DS    0F                 DEQ PURGE LIST                        02450000
DPLTARGT DS    F                  DEQ PURGE TARGET                      02466600
         ORG   DPLTARGT                                                 02483200
DPLSYSID DS    H                  SYSTEM ID TO BE PURGED - VALID ONLY   02500000
*                                 FOR SYSID, ASID OR TCB PURGE REQUESTS 02550000
DPLASID  DS    H                  ASID TO BE PURGED - VALID ONLY FOR    02600000
*                                 ASID OR TCB PURGE REQUESTS.           02650000
DPLTCB   DS    A                  TCB TO BE PURGED - VALID ONLY FOR     02700000
*                                 TCB PURGE REQUESTS.                   02750000
DPLRB    DS    A                  DEFINES THE RB TO BE POSTED WHEN      02766600
*                                 DPLASYNC=0.                           02783200
DPLQELQP DS    A                  POINTER TO FIRST QEL ON QEL QUEUE     02800000
*                                 TO BE PURGED.                         02825000
DPLFLAGS DS    2C                 FLAG BYTES                            02833300
         ORG   DPLFLAGS                                                 02841600
DPLPFLGS DS    B                  PROCESS FLAGS FOR ISGGQWB5 ONLY.      02850000
DPLASYNC EQU   X'80'              WHEN 1, REPRESENTS AN ASYNCHRONOUS    02900000
*                                 REQUEST.                              02950000
*                                 WHEN 0, REPRESENTS A SYNCHRONOUS      03000000
*                                 REQUEST.                              03050000
DPLLOCKH EQU   X'40'              WHEN 1, CMS ENQ/DEQ CLASS LOCK AND    03100000
*                                 GRS LOCAL LOCK HELD ON ENTRY.         03138400
*                                 WHEN 0, LOCKS NOT HELD ON ENTRY.      03176800
DPLLOCAL EQU   X'20'              WHEN 1, LOCAL RESOURCE PURGE.         03215200
*                                 WHEN 0, GLOBAL RESOURCE PURGE.        03253600
DPLSVQWB EQU   X'10'              WHEN 1, THE PURGE QWB IS TO BE        03292000
*                                 RETURNED IN REGISTER 1.               03330400
*                                 WHEN 0, THE CALLED ROUTINE MUST       03361100
*                                 FREE THE QWB.                         03391800
DPLGVQWB EQU   X'08'              GIVE-QWB FLAG.  WHEN 1, THE           03404900
*                                 PURGE QWB IS GIVEN TO THE             03418000
*                                 CALLER AND MUST NOT                   03431100
*                                 BE PLACED ON THE REQUEST-QUEUE.       03444200
*                                 WHEN 0, THE PURGE QWB MUST BE PLACED  03457300
*                                 ON THE REQUEST-QUEUE.        @ZA56189 03470400
DPLPRSV3 EQU   X'04'              RESERVED                              03484000
DPLPRSV2 EQU   X'02'              RESERVED                              03522400
DPLPRSV1 EQU   X'01'              RESERVED                              03560800
DPLRFLGS DS    B                  REQUEST FLAGS FOR ISGGQWB5 AND        03600000
*                                 ISGGDEQP.                             03625000
DPLRSYID EQU   X'80'              SYSID DEQ PURGE REQUEST.              03650000
DPLRASID EQU   X'40'              ASID DEQ PURGE REQUEST.               03700000
DPLRTCB  EQU   X'20'              TCB DEQ PURGE REQUEST.                03750000
DPLRABMC EQU   X'10'              THE TASK OR ADDRESS SPACE HAS         03800000
*                                 TERMINATED IN MUST COMPLETE. NOTE     03816600
*                                 THAT WHEN THE DPL IS INPUT TO         03833200
*                                 ISGGDEQP, PURGE MESSAGES ARE          03849800
*                                 RETURNED IN REGISTER 0. WHEN THE      03856400
*                                 DPL IS INPUT TO ISGGQWB5, PURGE       03863000
*                                 MESSAGES ARE RETURNED IN              03869600
*                                 QWBHMRBQ.                             03876200
DPLRRSV4 EQU   X'08'              RESERVED                              03883200
DPLRRSV3 EQU   X'04'              RESERVED                              03924800
DPLRRSV2 EQU   X'02'              RESERVED                              03966400
DPLRRSV1 EQU   X'01'              RESERVED                              04008000
DPLRSV1  DS    CL2                RESERVED                              04050000
DPLEND   EQU   *                  END OF DPL                            04100000
         MEND                                                           04150000
*                                                                    */ 04200000
*%PLSDPL1: ;                                                            04250000
* DCL 1 DPL BASED(DPLPTR) BDY(WORD),   /* DEQ PURGE LIST             */ 04300000
*       3 DPLTARGT FIXED(32),          /* DEQ PURGE TARGET           */ 04350000
*         5 DPLSYSID FIXED(16),        /* SYSTEM ID TO BE PURGED -      04390000
*                                         VALID ONLY FOR SYSID, ASID    04430000
*                                         OR TCB PURGE REQUESTS      */ 04470000
*         5 DPLASID  FIXED(16),        /* ASID TO BE PURGED - VALID     04510000
*                                         ONLY FOR ASID OR TCB PURGE    04550000
*                                         REQUESTS                   */ 04600000
*       3 DPLTCB   PTR(31),            /* TCB TO BE PURGED - VALID      04650000
*                                         ONLY FOR TCB PURGE REQUESTS*/ 04700000
*       3 DPLRB    PTR(31),            /* DEFINES THE RB TO BE POSTED   04716600
*                                         WHEN DPLASYNC=0            */ 04733200
*       3 DPLQELQP PTR(31),            /* POINTER TO FIRST QEL ON QEL   04750000
*                                         QUEUE TO BE PURGED.       */  04775000
*       3 DPLFLAGS CHAR(2),            /* FLAG BYTES                */  04800000
*         5 DPLPFLGS BIT(8),           /* PROCESS FLAGS FOR ISGGQWB5    04842800
*                                         ONLY.                     */  04864200
*           7 DPLASYNC BIT(1),         /* WHEN 1, REPRESENTS AN         04885600
*                                         ASYNCHRONOUS REQUEST.         04928400
*                                         WHEN 0, REPRESENTS A          04971200
*                                         SYNCHRONOUS REQUEST        */ 05014000
*           7 DPLLOCKH BIT(1),         /* WHEN 1, CMS ENQ/DEQ CLASS     05056800
*                                         LOCK AND GRS LOCAL LOCK HELD  05100000
*                                         ON ENTRY.                     05133300
*                                         WHEN 0, LOCKS NOT HELD ON     05166600
*                                         ENTRY.                     */ 05200000
*           7 DPLLOCAL BIT(1),         /* WHEN 1, LOCAL RESOURCE PURGE. 05250000
*                                         WHEN 0, GLOBAL RESOURCE       05300000
*                                         PURGE.                     */ 05350000
*           7 DPLSVQWB BIT(1),         /* WHEN 1, THE PURGE QWB IS TO   05400000
*                                         BE RETURNED IN REGISTER 1.    05450000
*                                         WHEN 0, THE CALLED ROUTINE    05500000
*                                         MUST FREE THE QWB.         */ 05550000
*           7 DPLGVQWB BIT(1),         /* GIVE-QWB FLAG. WHEN 1,        05561100
*                                         THE PURGE QWB IS              05572200
*                                         GIVEN TO THE CALLER AND       05583300
*                                         MUST NOT BE PLACED ON THE     05594400
*                                         REQUEST-QUEUE.  WHEN 0,       05605500
*                                         THE PURGE QWB MUST            05616600
*                                         BE PLACED ON THE              05627700
*                                         REQUEST-QUEUE      @ZA56189*/ 05638800
*           7 DPLPRSV3 BIT(1),         /* RESERVED                   */ 05650000
*           7 DPLPRSV2 BIT(1),         /* RESERVED                   */ 05700000
*           7 DPLPRSV1 BIT(1),         /* RESERVED                   */ 05750000
*         5 DPLRFLGS BIT(8),           /* REQUEST FLAGS FOR ISGGQWB5    05800000
*                                         AND ISGGDEQP.              */ 05825000
*           7 DPLRSYID BIT(1),         /* SYSID DEQ PURGE REQUEST    */ 05850000
*           7 DPLRASID BIT(1),         /* ASID DEQ PURGE REQUEST     */ 05900000
*           7 DPLRTCB  BIT(1),         /* TCB DEQ PURGE REQUEST      */ 05950000
*           7 DPLRABMC BIT(1),         /* THE TASK OR ADDRESS SPACE     06000000
*                                         HAS TERMINATED IN MUST        06016600
*                                         COMPLETE. NOTE THAT WHEN THE  06033200
*                                         DPL IS INPUT TO ISGGDEQP,     06049800
*                                         PURGE MESSAGES ARE RETURNED   06066400
*                                         IN REGISTER 0. WHEN THE DPL   06073100
*                                         IS INPUT TO ISGGQWB5, PURGE   06079800
*                                         MESSAGES ARE RETURNED IN      06086500
*                                         QWBHMRBQ.                  */ 06093200
*           7 DPLRRSV4 BIT(1),         /* RESERVED                   */ 06100000
*           7 DPLRRSV3 BIT(1),         /* RESERVED                   */ 06150000
*           7 DPLRRSV2 BIT(1),         /* RESERVED                   */ 06200000
*           7 DPLRRSV1 BIT(1),         /* RESERVED                   */ 06250000
*       3 DPLRSV1 CHAR(2),             /* RESERVED                   */ 06300000
*       3 DPLEND  CHAR(0);             /* END OF DPL                 */ 06350000
