*        %GOTO PLSPEL;                                               /* 00050000
         MACRO                                                          00100000
         ISGPEL                                                         00150000
**/                                                                     00200000
*%PLSPEL: ;                                                             00250000
*/* Start of Specifications ******************************************* 00300000
*01* Proprietary Statement =                                            00945100
*                                                                       00945300
*    LICENSED MATERIALS - PROPERTY OF IBM                               00945500
*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        00945700
*    5645-001 (C) COPYRIGHT IBM CORP. 1980, 1996                        00945900
*                                                                       00946100
*01* Status = JBB6602                                                   00946300
*                                                                       00946500
*01* EXTERNAL CLASSIFICATION:                                           00946700
*                                                                       00946900
*02* DMTI: BASE                                                         00947100
*                                                                       00947300
*02* PSPI: FIELDS PELMILEN PELXQNME PELXRNME                            00947500
*                                                                       00947700
*01* END OF EXTERNAL CLASSIFICATION:                                    00947900
*                                                                       00948100
*01* Descriptive Name: Parameter Element List                           00948300
*02*  Acronym:  PEL                                                     00948500
*                                                                       00949200
*01* Macro Name:  ISGPEL                                                00953700
*01* Macro Date:  05/11/00                                         @01C 00960190
*                                                                       00962700
*01* DSECT Name: PEL                                                    00967200
*                                                                       00971700
*01* Component:  Global Resource Serialization (SCSDS)                  00976200
*                                                                       00980700
*01* Eye-Catcher:  None                                                 00985200
*02*  Offset:                                                           00989700
*02*  Length:                                                           00994200
*                                                                       00998700
*01* Storage Attributes:                                                01003200
*02*  Subpool:  Any valid subpool in the private or common area         01007900
*02*  Key:  User's key                                                  01012600
*                                                                       01017300
*01* Deleted by:  The requestor of ENQ/DEQ/RESERVE.                     01067300
*                                                                       01117300
*01* Size:  52 + length of RNAME                                        01167300
*                                                                       01217300
*01* Created by:  ENQ/DEQ/RESERVE macro expansion.                      01267300
*                                                                       01317300
*01* Pointed to by:  The pointer is maintained by the user of           01367300
*                    the macro.                                         01417300
*                                                                       01467300
*01* Serialization:   None                                              01517300
*                                                                       02512500
*01* Function:  Contains the necessary information to process           02517500
*    an ENQ, DEQ, or RESERVE macro request.                             02522500
*                                                                       02527500
*01* Notes:                                                             02535000
*02* The PEL consists of 3 sections defined as follows:                 02542500
*                                                                       02550000
*02* PEL prefix (PELPREFX) - maps the input TCB and/or ECB              02550200
*    address(s), as defined by the ENQ/DEQ/RESERVE macro expansions.    02550400
*                                                                       02550600
*    The new-format PEL-prefix maps the input TCB, ECB,            @L1A 02550800
*    MASID, and MTCB.                                              @L1A 02551000
*                                                                       02551200
*02* PEL basic (PELBASIC) - maps the resource-dependant data,           02551400
*                           as defined by the ENQ, DEQ, and             02551600
*                           RESERVE macro expansions.                   02551800
*                                                                       02552000
*02* PEL extension (PELX) - maps the data in QWB PEL entries            02552200
*                           that the ENQ/DEQ/RESERVE mainline           02552400
*                           requires to process the request.            02552600
*                                                                       02553000
*02* Note that when the PEL maps the input parameter list, the          02553100
*    PELX is not present. The PELX data exists only in the SQA          02553200
*    QWB PEL or in a GRS private area QWB.  The PELX information        02553300
*    is used collectively with the PELPREFX and PELBASIC data           02553400
*    by the ENQ/DEQ/RESERVE mainline to process the request.            02553600
*                                                                       02553700
*02* Note that the new-format PEL-prefix is followed               @L1A 02553800
*    by a format word that gives the length of the                 @L1A 02553900
*    new-format PEL-prefix.                                        @L1A 02554000
*    Refer to subfield QWANWPEL (of mapping macro                  @L1A 02554100
*    ISGQWA) for the exact format of the new-format                @L1A 02554200
*    PEL-prefix.                                                   @L1A 02554300
*                                                                       02554400
*02* Data in the PEL is read by GRS holding the user's local lock.      02554900
*    Data stored in the user PEL is stored in the user's key.           02555400
*                                                                       02556100
*01* Method of Access:                                                  02556200
*02*  BAL:  DSECT is produced, requiring a USING on the PEL.            02556300
*                                                                       02556400
*02*  PLS:   PEL is declared as a based structure.                      02556600
*            PELPTR must be declared.                                   02556800
*                                                                       02557000
*            If macro variable $PELBASE='PELMAP', then separate based   02557200
*            mappings are generated for the PELPREFX and the rest       02557400
*            of the PEL (labeled PELMAP). This is a truer indication    02557600
*            of how the PEL is used by GRS routines, which typically    02557800
*            use pointers that point to PELBASIC.  The only             02558000
*            exceptions are any RNL exit routines, whose input          02558200
*            is a pointer to a 'phantom' PELPREFX.                 @L7A 02558400
*                                                                       02558450
*            If macro variable PELCONST='YES' then the PEL constants    02558500
*            will be generated.                                    @02A 02558550
*                                                                       02558600
*01* Change Activity:                                                   02558800
*                                                                       02560100
*       Products:                                                       02561400
*                                                                       02562700
*        $D1=44      ,JBB2110,820827,PD14: GRS REQUEST LIMIT            02564200
*                     CHANGE PELX1R01 TO PELXREQF.                      02571300
*                     CREATE PELXFLAG BY USING ONE OF THE RESERVED      02578400
*                     BYTES IN PELXRSV1.                           @D1A 02582500
*        $L1=IPLDFRNL,JBB2125,830411,PD1L: IPL WITH DEFAULT RNL         02586600
*                     USE FLAG PELXERSV FOR EARLY-RESERVE.         @L1A 02587700
*        $L2=MASIDENQ,JBB2125,830411,PD1L: ENQ/RESERVE MASID=/MTCB=     02588800
*                     USE FLAG PELSAVE TO INDICATE NEW-FORMAT           02589900
*                     PEL-PREFIX PRECEDES FIRST PEL.               @L2A 02590700
*        $L3=GRSPF   ,JBB3311,880210,PD11: GRS PERFORMANCE              02591500
*                     ENHANCEMENTS FOR PFT COMPRESSION             @L3A 02591800
*        $L4=GRSW1   ,HBB4410,890403,PDDX: ADD SUPPORT FOR RNL          02592200
*                                          KEYWORD                 @L4A 02592300
*        $L5=DRNL    ,HBB4410,891016,PDHJ:                              02592500
*                                          SEPARATE THE PELXRNAME FROM  02592600
*                                          THE REST OF THE PEL.  THERE  02592700
*                                          IS NOW A PEL FIXED SECTION   02592800
*                                          (WHICH HAS EVERYTHING EXCEPT 02592900
*                                          THE RNAME) AND A SECTION FOR 02593000
*                                          THE RNAME.  THIS ALLOWS US   02593100
*                                          TO TAKE THE LENGTH OF PEL    02593200
*                                          WITHOUT THE RNAME.      @L5A 02593300
*        $L6=UCBVP   ,HBB5520,940210,PD00AW: Add support for DEV        02593400
*                                          keyword.                @L6A 02593500
*        $L7=GRS32   ,JBB6602,940505,PDDX: GRS Star                     02593600
*                                          Add option to obtain         02593700
*                                          separate PELMAP and PELPREFX 02593800
*                                          mappings. Move PELFIXED to   02593900
*                                          exclude the prefix, since    02594000
*                                          there is no prefix in a QWB  02594100
*                                          PEL.                    @L7A 02594300
*                                                                       02594500
*       PTMs:                                                           02594700
*                                                                       02594900
*        $P1=PAB0062 ,JBB2110,821008,PD14: THE USE OF PELXFLAG IS       02595100
*                     UNNECESSARY FOR DCR 44 (ABOVE).  BY PASSING       02595600
*                     THE PEL WITH PELXRET=X'18', THE SAME FUNCTION     02596600
*                     IS ACCOMPLISHED.                             @P1A 02597100
*        $P2=PAB0126 ,JBB2110,821015,PD14: RETRANSMIT TO REMOVE CODE    02597700
*                     FOR PAB0062.  WHEN THERE ARE SYSTEMS IN THE GRS   02597800
*                     RING WITHOUT DCR44 SUPPORT, PELXFLAG IS           02597900
*                     REQUIRED.  THE CODE FOR PAB0062 DOES NOT ACCOUNT  02598000
*                     FOR PREVIOUS LEVELS OF GRS.                  @P2A 02598200
*        $P3=PSD0398 ,JBB6602,951013,PDAW: Restore prolog updates  @P3A 02598400
*                                                                       02598600
*       APARs:                                                          02598800
*                                                                       02599000
*  $01=OW11070  HBB4420 950505 PDHB: Add support for LOC keyword with   02599200
*                                    RESERVE and DEQ.  DCR 105.    @01A 02599400
*  $02=OW49779  HBB6608 001127 PDLG: Wildcard Support                   02599500
*                                                                       02599600
*** End of Specifications ********************************************/ 02600000
*/*A000000-999999                                            @G381PYC*/ 02650000
*        %GOTO PLSPEL1;                                              /* 02700000
PEL      DSECT                    PARAMETER ELEMENT LIST                02750000
PELPREFX DS    CL8                PARAMETER ELEMENT PREFIX              02766600
         ORG   PELPREFX                                                 02783200
PELTCB   DS    A                  IF BOTH TCB AND ECB ARE CODED,        02800000
*                                 CONTAINS TCB ADDRESS                  02850000
PELDUAL  DS    A                  PEL PREFIX WORD (TCB ADDR. OR ECB     02900000
*                                 ADDR.)                                02950000
PELBASIC DS    CL12               PARAMETER ELEMENT BASIC SECTION       03000000
         ORG   PELBASIC                                                 03033300
PELLAST  DS    X                  FLAG BYTE 1                           03066600
PELEOL   EQU   X'80'              LAST ELEMENT OF LIST                  03100000
PELIGNOR EQU   X'40'              IGNORE REMAINING BITS OF THIS BYTE    03150000
PELOCANY EQU   X'20'              If 1, LOC=ANY was specified on a      03162500
*                                 RESERVE or DEQ request.               03175000
*                              -  LOC=ANY must be specified when the    03187500
*                                 UCB address provided by the caller    03200000
*                                 is an above-the-line address and is   03212500
*                                 to be treated as such by ISGGQWBI,    03225000
*                                 ISGGSETU, and ISGGNQDQ.          @01C 03237500
PELSHR   EQU   X'10'              SHARED RESOURCE REQUEST               03250000
PELSAVE  EQU   X'08'              NEW-FORMAT PEL PREFIX PRECEDES        03275000
*                                 FIRST PEL OF LIST.  MUST BE ZERO      03300000
*                                 FOR A DEQ PARAMETER-LIST.        @L2A 03325000
PELNORNL EQU   X'04'              IF 1, RNL=NO WAS SPECIFIED       @L4C 03350000
PELGEN2  EQU   X'02'              IF 1, GENERIC=YES WAS SPECIFIED       03400000
PELTCBF  EQU   X'01'              TCB= WAS SPECIFIED.  PELTCBF IS       03414200
*                                 IGNORED IN THE USER PEL IF PELSAVE    03428400
*                                 IS ON.  THE TCB= OPERAND IS           03442600
*                                 CONSIDERED TO BE PRESENT IF THE       03456800
*                                 TCB FIELD OF THE NEW-FORMAT           03471000
*                                 PEL-PREFIX IS NON-ZERO.          @L2A 03485200
*                                                                       03500000
PELMILEN DS    X                  RNAME LENGTH                          03796100
PELFLAG  DS    X                  FLAG BYTE 2                           03838400
PELSHARE EQU   X'80'              0 = EXCLUSIVE, 1 = SHARE              03880700
PELSCPE1 EQU   X'40'              SEE COMMENTS BELOW                    03923000
PELSYSMC EQU   X'20'              OBSOLETE (SET/RESET SYSTEM MUST       03965300
*                                 COMPLETE)                             04007600
PELSTPMC EQU   X'10'              SET/RESET STEP MUST COMPLETE          04050000
*                                 SPECIFIED                             04100000
PELSCPE2 EQU   X'08'              SEE COMMENTS BELOW                    04150000
PELRET1  EQU   X'04'              SEE COMMENTS BELOW                    04200000
PELRET2  EQU   X'02'              SEE COMMENTS BELOW                    04250000
PELRET3  EQU   X'01'              SEE COMMENTS BELOW                    04300000
*                                                                       04350000
*        PELRET1 AND PELRET2 AND PELRET3                                04393700
*                                                                       04415500
*          000-  RET=NONE (NO RET)                                      04437400
*          001-  RET=HAVE                                               04481100
*          010-  RET=CHNG                                               04524800
*          011-  RET=USE                                                04568500
*          100-  ECB=                                                   04612200
*          101-  RESERVED                                               04655900
*          110-  RESERVED                                               04699600
*          111-  RET=TEST                                               04743300
*                                                                       04765100
*        PELSCPE1 AND PELSCPE2                                          04786900
*                                                                       04808700
*          00-   STEP                                                   04830700
*          01-   SYSTEMS AND UCB                                        04874400
*          10-   SYSTEM                                                 04918100
*          11-   SYSTEMS                                                04961800
*                                                                       05005500
PELRET   DS    X                  RETURN CODE AREA IN USER PEL          05050000
PELMAJA  DS    A                  ADDRESS OF QNAME - NOT USED WHEN      05100000
*                                 QNAME HAS BEEN MOVED TO THE PELX      05119200
PELMAJSZ EQU   8                  LENGTH OF QNAME                       05138400
PELMINA  DS    A                  ADDRESS OF RNAME - NOT USED WHEN      05157600
*                                 RNAME HAS BEEN MOVED TO THE PELX      05176800
PELELEM  EQU   *-PELBASIC         LENGTH OF A PEL ENTRY                 05196000
PELUCBAA DS    A                  ADDRESS OF POINTER TO UCB. THIS       05215200
*                                 FIELD ONLY EXISTS FOR RESERVE         05234400
*                                 REQUESTS. WHEN MAPPED TO A QWBPEL,    05253600
*                                 THIS FIELD IS NOT USED. THE UCB       05272800
*                                 ADDRESS, HOWEVER, IS FOUND IN THE     05292000
*                                 PELX.                                 05311200
PELX     DS    CL28               PEL EXTENSION. NOTE THAT THIS SECTION 05330400
*                                 IS VARIABLE IN SIZE. THE SIZE IS      05363000
*                                 THE SMALLEST SIZE OF THE PELX.        05395600
*                                 THE LENGTH OF THE RNAME MUST BE       05428200
*                                 ADDED TO THIS LENGTH TO COMPUTE       05460800
*                                 THE LENGTH OF THE PELX ENTRY          05493400
         ORG   PELX                                                     05526400
PELXRET  DS    X                  RETURN CODE AREA IN QWB               05547200
PELXFLG1 DS    B                  PEL EXTENSION FLAGS                   05568000
PELXSIEX EQU   X'80'              SYSTEM SCOPE INCLUDED IN GLOBAL       05600000
*                                 SHARING                               05650000
PELXRCEX EQU   X'40'              RESERVE CONVERTED TO GLOBAL ENQ       05700000
PELXSEEX EQU   X'20'              SYSTEMS SCOPE EXCLUDED FROM GLOBAL    05750000
*                                 SHARING                               05800000
PELXGLBL EQU   X'10'              WHEN 1, GLOBAL RESOURCE REQUEST       05850000
*                                 WHEN 0, LOCAL RESOURCE REQUEST        05882600
PELXLAST EQU   X'08'              LAST ENTRY IN QWBPEL - NOTE THAT      05915200
*                                 IF PELEOL=0, A QWB EXTENSION EXISTS   05941200
PELXRESV EQU   X'04'              RESERVE REQUEST                       05967200
PELXERR  EQU   X'02'              THIS ENTRY IN ERROR                   05993200
PELXREQF EQU   X'01'              1 => ASCBCREQ HAS BEEN INCREASED FOR  05997400
*                                      THIS REQUEST, BUT NO QEL HAS     06001600
*                                      BEEN INSERTED.  IF A FAILURE     06005800
*                                      OCCURS, ISGGFRR0 MUST REDUCE     06010000
*                                      THE COUNT BY 1.                  06014200
*                                 0 => NO ADJUSTMENT OF ASCBCREQ IS     06018400
*                                      REQUIRED FOR THIS REQUEST.  @D1A 06022600
PELXFLAG DS    X                  COPY OF PELFLAG (ONLY FOR GLOBAL     *06032300
                                  REQUESTS)                        @P2A 06042000
PELXFLG2 DS    CL1                FLAG-BYTE                        @L1C 06043600
PELXERSV EQU   X'80'              EARLY-RESERVE FLAG.  RESOURCE NAME    06044800
*                                 MATCHES THE NAME USED IN AN EARLY     06046000
*                                 GLOBAL RESERVE THAT WAS               06047200
*                                 CONVERTED TO A LOCAL RESERVE.    @L1A 06048400
PELXTOKN EQU   X'40'              TOKEN INDICATOR- WHEN 1, INDICATES    06048900
*                                 THIS PELX WAS GENERATED FORM A QNP    06049400
*                                 WHICH HAD QNPXTOKN=1. CORRESPONDS     06049900
*                                 TO FLAG QNPXTOKN IN THE QNP. ALWAYS   06050400
*                                 0 IN THE ORIGINATING SYSTEM.     @L3C 06050900
PELXCBEX EQU   X'20'              Request changed by ISGNQXIT      @02C 06052390
PELXRS25 EQU   X'10'              RESERVED                         @L1A 06053200
PELXRS24 EQU   X'08'              RESERVED                         @L1A 06054800
PELXRS23 EQU   X'04'              RESERVED                         @L1A 06056400
PELXRS22 EQU   X'02'              RESERVED                         @L1A 06058000
PELXRS21 EQU   X'01'              RESERVED                         @L1A 06059600
PELXPELE DS    A                  IDENTIFIES THE REQUESTOR-S PEL        06061600
*                                 ENTRY IN WHICH THE RETURN CODE        06082800
*                                 SHOULD BE STORED.                     06104000
PELXSIZE DS    H                  SIZE OF THIS PEL ENTRY                06125500
PELXRNMW DS    H                  RNAME SIZE ROUNDED TO A WORD BOUNDARY 06132500
PELXUCBA DS    A                  ADDRESS OF UCB                        06139500
PELXQCBE DS    A                  ADDRESS OF SMPL ENTRY CONTAINING      06146500
*                                 THE QCB FOR THIS RESOURCE.            06153500
*                                 THIS FIELD IS ONLY VALID ON           06160500
*                                 ENQ/RESERVE REQUESTS.                 06167500
PELXQNME DS    CL8                QNAME OF THIS RESOURCE                06175000
PELEND   EQU   *                  END OF PEL (FIXED LEN SECTION)        06191500
PELXRNME DS    0C                 RNAME OF THIS RESOURCE (VARIABLE LEN) 06203900
*                                 - NOTE RNAME IS PADDED TO WORD        06216300
*                                 BOUNDARY WITH ZEROS                   06228700
         MEND                                                           06241200
*                                                                    */ 06273800
*%PLSPEL1: ;                                                            06306400
*%IF PELCONST = '' %then                                      /* @02A*/ 06306700
*  %PELCONST = 'YES';                                         /* @02A*/ 06307000
* %IF PELBASE='PELMAP' %THEN                                            06307400
*   %DO;                                                                06308400
* DCL 1 PELPREFX BDY(WORD) BASED(ADDR(PELMAP)-LENGTH(PELPREFX)), /*     06309400
*                                      Prefix mapping            @L7A*/ 06310400
*           5 PELTCB  PTR(31),      /* IF BOTH TCB AND ECB ARE CODED,   06311400
*                                      CONTAINS THE TCB ADDRESS      */ 06312400
*           5 PELDUAL PTR(31);      /* PEL PREFIX WORK (TCB ADDRESS     06313400
*                                      OR ECB ADDRESS)           @L7C*/ 06314400
* DCL  1 PELMAP BASED(PELPTR),      /* Mapping of PEL            @L7A*/ 06315400
*   %END;                                                               06316400
*%ELSE                              /* Separate prefix mapping   @L7A*/ 06317400
*   %DO;                                                                06318400
* DCL 1 PEL BASED(PELPTR) BDY(WORD), /* PARAMETER ELEMENT LIST, NOTE    06319400
*                                       THAT THE PEL DIVIDED INTO TWO   06331100
*                                       SECTIONS - A FIXED PEL AND THE  06342800
*                                       RNAME WHICH IS VARIABLE IN      06354500
*                                       LENGTH.                  @L5C*/ 06366200
*         3 PELPREFX CHAR(8) BDY(WORD), /* PARAMETER ELEMENT PREFIX  */ 06413000
*           5 PELTCB  PTR(31),      /* IF BOTH TCB AND ECB ARE CODED,   06424700
*                                      CONTAINS THE TCB ADDRESS      */ 06436800
*           5 PELDUAL PTR(31),      /* PEL PREFIX WORK (TCB ADDRESS     06469400
*                                      OR ECB ADDRESS)           @L7C*/ 06480200
*   %END;                                                               06491000
*       2 PELFIXED,                 /* The fixed portion of the         06501800
*                                      PEL built in a QWB - everything  06512600
*                                      except the RNAME          @L7M*/ 06523400
*         3 PELBASIC CHAR(12) BDY(WORD), /* PARAMETER ELEMENT BASIC     06534600
*                                      SECTION                       */ 06567200
*           5 PELLAST    BIT(8),    /* FLAG BYTE 1                   */ 06600000
*             7 PELEOL   BIT(1),    /* LAST ELEMENT OF LIST          */ 06650000
*             7 PELIGNOR BIT(1),    /* IGNORE REMAINING BITS OF THIS    06700000
*                                      BYTE                          */ 06750000
*             7 PELOCANY BIT(1),    /* If 1, LOC=ANY was specified on   06761100
*                                      RESERVE or DEQ request.          06772200
*                                      LOC=ANY must be specified when   06783300
*                                      the UCB address provided by the  06794400
*                                      caller is an above-the-line      06805500
*                                      address and is to be treated as  06816600
*                                      such by ISGGQWBI, ISGGSETU, and  06827700
*                                      ISGGNQDQ.                 @01C*/ 06838800
*             7 PELSHR   BIT(1),    /* SHARED RESOURCE REQUEST       */ 06850000
*             7 PELSAVE  BIT(1),    /* NEW-FORMAT PEL PREFIX PRECEDES   06875000
*                                      FIRST PEL OF LIST.  MUST BE      06900000
*                                      ZERO FOR A DEQ.           @L2A*/ 06925000
*             7 PELNORNL BIT(1),    /* IF 1, RNL=NO              @L4C*/ 06950000
*             7 PELGEN2  BIT(1),    /* IF 1, GENERIC=YES             */ 07000000
*             7 PELTCBF  BIT(1),    /* TCB= WAS SPECIFIED.  PELTCBF     07012500
*                                      IS IGNORED IN THE USER PEL       07025000
*                                      IF PELSAVE IS ON.  THE TCB=      07037500
*                                      OPERAND IS CONSIDERED TO BE      07050000
*                                      PRESENT IF THE TCB FIELD OF      07062500
*                                      THE NEW-FORMAT PEL-PREFIX IS     07075000
*                                      NON-ZERO.                 @L2A*/ 07087500
*           5 PELMILEN FIXED(8),    /* RNAME LENGTH                  */ 07450000
*           5 PELFLAG  BIT(8),      /* FLAG BYTE 2                   */ 07500000
*             7 PELSHARE BIT(1),    /* 0=EXCLUSIVE, 1=SHARE          */ 07550000
*             7 PELSCPE1 BIT(1),    /* SEE COMMENTS BELOW            */ 07600000
*             7 PELSYSMC BIT(1),    /* OBSOLETE (SET/RESET SYSTEM       07650000
*                                      MUST COMPLETE)                */ 07700000
*             7 PELSTPMC BIT(1),    /* SET/RESET STEP MUST COMPLETE     07750000
*                                      SPECIFIED                     */ 07800000
*             7 PELSCPE2 BIT(1),    /* SEE COMMENTS BELOW            */ 07850000
*             7 PELRET1  BIT(1),    /* SEE COMMENTS BELOW            */ 07900000
*             7 PELRET2  BIT(1),    /* SEE COMMENTS BELOW            */ 07950000
*             7 PELRET3  BIT(1),    /* SEE COMMENTS BELOW            */ 08000000
*/*                                                                  */ 08050000
*/*         PELRET1,PELRET2 AND PELRET3                              */ 08100000
*/*                                                                  */ 08124900
*/*           000- RET=NONE (NO RETURN CODE)                         */ 08150000
*/*           001- RET=HAVE                                          */ 08200000
*/*           010- RET=CHNG                                          */ 08250000
*/*           011- RET=USE                                           */ 08300000
*/*           100- ECB=                                              */ 08350000
*/*           101- RESERVED                                          */ 08400000
*/*           110- RESERVED                                          */ 08450000
*/*           111- RET=TEST                                          */ 08500000
*/*                                                                  */ 08550000
*/*         PELSCPE1 AND PELSCPE2                                    */ 08600000
*/*                                                                  */ 08624900
*/*           00- STEP                                               */ 08650000
*/*           01- SYSTEMS AND UCB                                    */ 08700000
*/*           10- SYSTEM                                             */ 08750000
*/*           11- SYSTEMS                                            */ 08800000
*/*                                                                  */ 08850000
*           5 PELRET   FIXED(8),    /* RETURN CODE AREA IN USER-S PEL*/ 08900000
*           5 PELMAJA  PTR(31),     /* ADDRESS OF QNAME - NOT USED      08950000
*                                      WHEN QNAME HAS BEEN MOVED TO     08963200
*                                      THE PELX                      */ 08976400
*           5 PELMINA  PTR(31),     /* ADDRESS OF RNAME - NOT USED      08989600
*                                      WHEN RNAME HAS BEEN MOVED TO     09002800
*                                      THE PELX                      */ 09016000
*         3 PELUCBAA PTR(31),       /* ADDRESS OF POINTER TO UCB. THIS  09029200
*                                      FIELD ONLY EXISTS FOR RESERVE    09042400
*                                      REQUESTS. WHEN MAPPED TO A       09055600
*                                      QWBPEL,  THIS FIELD IS NOT       09068800
*                                      USED. THE UCB ADDRESS,           09082000
*                                      HOWEVER, IS FOUND IN THE PELX.*/ 09095200
*         3 PELX CHAR(28) BDY(WORD), /*  PEL EXTENSION, THE RNAME HAS   09120100
*                                      BEEN MOVED FROM THE PELX INTO    09145000
*                                      THE PEL BECAUSE OF THE VARIABLE  09169900
*                                      SIZE.  THE LENGTH OF THE RNAME   09194800
*                                      MUST BE ADDED TO THIS LENGTH TO  09219700
*                                      COMPUTE THE LENGTH OF THE PELX   09244600
*                                      ENTRY                     @L5C*/ 09269500
*           5 PELXRET FIXED(8),     /* RETURN CODE AREA IN QWB       */ 09294400
*           5 PELXFLG1 BIT(8),      /* PEL EXTENSION FLAGS           */ 09323100
*             7 PELXSIEX BIT(1),    /* SYSTEM SCOPE INCLUDED IN GLOBAL  09351800
*                                      SHARING                       */ 09380500
*             7 PELXRCEX BIT(1),    /* RESERVE CONVERTED TO GLOBAL      09409200
*                                      ENQ                           */ 09437900
*             7 PELXSEEX BIT(1),    /* SYSTEMS SCOPE EXCLUDED FROM      09466600
*                                      GLOBAL SHARING                */ 09495300
*             7 PELXGLBL BIT(1),    /* WHEN 1, INDICATES GLOBAL         09524000
*                                      RESOURCE                         09552700
*                                      WHEN 0, INDICATES LOCAL          09581400
*                                      RESOURCE                      */ 09610100
*             7 PELXLAST BIT(1),    /* LAST ENTRY IN QWBPEL          */ 09638800
*             7 PELXRESV BIT(1),    /* RESERVE REQUEST               */ 09667500
*             7 PELXERR  BIT(1),    /* THIS ENTRY IN ERROR           */ 09696200
*             7 PELXREQF BIT(1),    /* 1 => ASCBCREQ HAS BEEN INCREASED 09700100
*                                      FOR THIS REQUEST, BUT NO QEL HAS 09704000
*                                      BEEN INSERTED.  IF A FAILURE     09707900
*                                      OCCURS, ISGGFRR0 MUST REDUCE     09711800
*                                      THE COUNT BY 1.                  09715700
*                                      0 => NO ADJUSTMENT OF ASCBCREQ   09719600
*                                      IS REQUIRED FOR THIS REQUEST.    09723500
*                                                                @D1A*/ 09727400
*           5 PELXFLAG BIT(8),      /* COPY OF PELFLAG (ONLY FOR        09737500
*                                      GLOBAL REQUESTS)          @P2A*/ 09747600
*           5 PELXFLG2 BIT(8),      /* FLAG-BYTE                 @L1C*/ 09750500
*             7 PELXERSV BIT(1),    /* EARLY-RESERVE FLAG.  RESOURCE    09753400
*                                      NAME MATCHES THE NAME USED IN    09755500
*                                      AN EARLY GLOBAL RESERVE THAT     09757600
*                                      WAS CONVERTED TO A LOCAL         09759700
*                                      RESERVE.                  @L1A*/ 09762100
*             7 PELXTOKN BIT(1),    /* TOKEN INDICATOR- WHEN 1,         09762300
*                                      INDICATES THIS PELX WAS          09762500
*                                      GENERATED FROM A QNP WHICH HAD   09762700
*                                      QNPXTOKN=1. CORRESPONDS TO FLAG  09762900
*                                      QNPXTOKN IN THE QNP. ALWAYS 0    09763100
*                                      IN THE ORIGINATING SYSTEM @L3C*/ 09763300
*             7 PELXCBEX BIT(1),    /* Request changed by ISGNQXIT      09763690
*                                                                @02C*/ 09763880
*             7 PELXRS25 BIT(1),    /* RESERVED.                 @L1A*/ 09764200
*             7 PELXRS24 BIT(1),    /* RESERVED.                 @L1A*/ 09764900
*             7 PELXRS23 BIT(1),    /* RESERVED.                 @L1A*/ 09765600
*             7 PELXRS22 BIT(1),    /* RESERVED.                 @L1A*/ 09766300
*             7 PELXRS21 BIT(1),    /* RESERVED.                 @L1A*/ 09767000
*           5 PELXPELE FIXED(31),   /* IDENTIFIES THE REQUESTOR-S PEL   09768100
*                                      ENTRY IN WHICH THE RETURN CODE   09782600
*                                      SHOULD BE STORED.             */ 09797100
*           5 PELXSIZE FIXED(15),   /* SIZE OF THIS PEL ENTRY        */ 09811800
*           5 PELXRNMW FIXED(15),   /* RNAME SIZE ROUNDED TO WORD       09814900
*                                      BOUNDARY                      */ 09818000
*           5 PELXUCBA PTR(31),     /* ADDRESS OF UCB                */ 09821100
*           5 PELXQCBE PTR(31),     /* ADDRESS OF SMPL QCB ENTRY        09824200
*                                      CONTAINING THE QCB FOR THIS      09827300
*                                      RESOURCE. THIS FIELD IS ONLY     09831400
*                                      VALID ON ENQ/RESERVE REQUESTS */ 09835500
*           5 PELXQNME CHAR(8),     /* QNAME OF THE RESOURCE         */ 09839700
*           5 PELEND CHAR(0),       /* END OF PEL (FIXED LEN SECTION */ 09854000
*       2 PELXRNME CHAR(*);                                             09869300
*                                   /* RNAME OF THE RESOURCE (VARIABLE  09884600
*                                      LENGTH) - NOTE RNAME IS PADDED   09900000
*                                      TO WORD BOUNDARY WITH ZEROS      09916600
*                                                                @L5C*/ 09933200
* %IF PELCONST='YES' %THEN                                    /* @02A*/ 09938200
*   %DO;                                                      /* @02A*/ 09943200
*/*                                                                  */ 09950000
*/*     THE FOLLOWING DECLARES DEFINE THE REQUIRED PEL CONSTANTS     */ 10000000
*/*                                                                  */ 10050000
* DCL PELMAJSZ CONSTANT(8) FIXED(8);              /* LENGTH OF QNAME */ 10100000
* DCL PELELEM CONSTANT(LENGTH(PELBASIC)) FIXED(8); /* LENGTH A PEL      10150000
*                                                     ENTRY (BASIC)  */ 10200000
*   %END;                                                     /* @02A*/ 10201000
