*        %GOTO PLSQEL;                                               /* 00050000
         MACRO                                                          00100000
         ISGQEL                                                         00150000
**/                                                                     00200000
*%PLSQEL: ;                                                             00250000
*/* Start of Specifications ******************************************* 00300000
*                                                                       00961200
*01* Descriptive Name:   QUEUE ELEMENT                                  00966100
*02*  Acronym:  QEL                                                     00971000
*                                                                       00971400
*01* Proprietary Statement =                                            00971800
*                                                                       00972200
*    LICENSED MATERIALS - PROPERTY OF IBM                               00972600
*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        00973000
*    5647-A01 (C) COPYRIGHT IBM CORP. 1980, 1999                        00973400
*                                                                       00973800
*01* Status = JBB6607                                                   00974200
*                                                                       00974600
*01* External Classification:  DMTI                                     00975000
*01* End of External Classification                                     00975400
*                                                                       00975900
*01* Macro Name:  ISGQEL                                                00980800
*01* Macro Date:  01/03/99                                              00985700
*                                                                       00990600
*01* DSECT Name:  QEL                                                   00995500
*                                                                       01000400
*01* Component:  Global Resource Serialization (SCSDS)                  01005300
*                                                                       01010200
*01* Eye-Catcher: None                                                  01015100
*02*  Offset: N/A                                                       01020000
*02*  Length: N/A                                                       01024900
*                                                                       01029800
*01* Storage Attributes:                                                01034700
*02*  Subpool:  127 IN THE GRS PRIVATE AREA ABOVE 16-M LINE.            01039600
*02*  Key:  0                                                           01044500
*                                                                       01050000
*01* Deleted by:  THE DEQ PROCESSING ROUTINES (ISGGNQDQ, ISGGRP00,      01093700
*                 ISGGTRM0) RETURN THE QEL TO THE GRS STORAGE           01137400
*                  MANAGER.                                             01181100
*                                                                       01224800
*01* Size:  56 bytes                                               @L6C 01268500
*                                                                       01312200
*01* Created by:   THE ENQ/RESERVE PROCESSING ROUTINES (ISGGNQDQ,       01355900
*                  ISGGRP00) OBTAIN THE QEL FROM THE GRS STORAGE        01400000
*                  MANAGER.                                             01450000
*                                                                       01500000
*01* Pointed to by:   QCBFQEL, QCBLQEL, QELNQEL, QELPQEL,               01550000
*                     QELNQELQ, QELPQELQ, QELNSYN, QELPSYN,             01600000
*                     ASCBGQEL, ASCBLQEL, ASSBPQEL, AND SAHTEQEL   @P3C 01650000
*                                                                       02050000
*01* Serialization:   LOCAL RESOURCE  - THE CMS ENQ/DEQ CLASS LOCK.     02100000
*                     GLOBAL RESOURCE - THE GRS LOCAL LOCK.             02150000
*                                                                       02162500
*01* Function:                                                          02175000
*02* Describes a request for shared or exclusive control of a      @L5C 02183300
*    named resource.                                               @L5A 02191600
*                                                                       02200000
*01* Method of Access:                                                  02202500
*02*  BAL:  DSECT IS PRODUCED REQUIRING A                               02205000
*           USING ON THE QEL.                                           02207500
*                                                                       02209000
*02*  PLS:  DECLARE QELPTR PTR(31)                                 @L5C 02210500
*           %INCLUDE SYSLIB(ISGQEL)                                @L5C 02212000
*                                                                       02213500
*                                                                       02215000
*01* Change Activity:                                                   02217500
* $L1=IPLDFRNL,JBB2125,830411,PD1L: IPL WITH DEFAULTS RNLS       @L1A   02220000
* $L2=MASIDENQ,JBB2125,830411,PD1L: MASID/MTCB ENQ/RESERVE       @L2A   02230000
* $L3=GRSPF   ,JBB3311,871115,PDAH: GRS PERFORMANCE ENHANCEMENTS.       02233300
*    SUPPORTS FAST DEQ FUNCTION.                                 @L3A   02236600
* $L4=DRNL    ,HBB4410,891016,PDHJ: DYNAMIC RNLS - ADDED AFFECTED       02237700
* $L5=GRS32   ,JBB6602,931103,PDNW: GRS Star                     @L5A   02238100
* $L6=GRS32   ,JBB6602,940426,PDDX: GRS Star                            02238500
*                                   Increase size by 8 bytes.           02238900
*                                   Add QELTOD, QELFLGS3.               02239300
*                                                                       02240000
*  SUPPORTS THE FOLLOWING APARS :                                       02244200
*                                                                       02248400
*    OY08322 - GRS ENHANCEMENTS FOR SERVICE ADDRESS SPACES:             02248500
*               A) GQSCAN OBTAINS REQUESTORS ASID FROM THE SERVICE      02248600
*                  ADDRESS SPACE                                        02248700
*               B) DISPLAY GRS COMMAND DISPLAYS REQUESTORS JOBNAME      02248800
*                  AND ASID                                   @YA08322  02248900
* $01=OW38979 ,HBB6608,990103,PDBD: Enhanced contention analysis        02250000
*                                   Add QELCQE                          02251100
*                                                                       02252200
*                                                                       02253300
*  SUPPORTS THE FOLLOWING PTM(S) :                                      02254400
*                                                                       02255500
* $P1=PCG0004 ,JBB3311,880115,PDAH: LEGAL STATEMENT UPDATED       @P1A  02256600
*                                                                       02257700
* $P2=PCG0034 ,JBB3311,880302,PDDM: REMOVE UNUSED BIT QELFDOK     @P2A  02258800
* $P3=PSD0399 ,JBB6602,951013,PDBD: ShowHdr                             02259900
* $P4=PSD0479 ,JBB6602,951031,PDZU: Fix contention notification   @P4A  02261000
* $P5=PQC1786 ,HBB6603,960802,PDEL: Add QELUCBER                  @P5A  02262300
* $P6=PWA0016 ,JBB6607,980507,PDSL: Add QELWAITR (waiting for reserve   02265400
*                                   to complete) bit for SYNCHRES       02268500
*                                   support                       @P6A  02271600
*                                                                       02274800
*** End of Specifications ********************************************/ 02287300
*/*A000000-999999                                            @G381PYC*/ 02300000
*        %GOTO PLSQEL1;                                              /* 02350000
QEL      DSECT                                                          02400000
         DS    0D                 QUEUE ELEMENT                         02450000
QELNQEL  DS    A                  ADDRESS OF NEXT QEL                   02500000
QELPQEL  DS    A                  ADDRESS OF PREVIOUS QEL               02541600
QELNQELQ DS    A                  NEXT QEL ON ASCB OR SYSID QUEUE       02666400
QELPQELQ DS    A                  PREVIOUS QEL ON ASCB OR SYSID QUEUE   02676800
QELTOD   DS    CL8                STCK time-of-day that ENQ             02679000
*                                 request was made. Valid only          02681200
*                                 in GRS star mode.                @L6A 02683400
         ORG   QELTOD                                                   02685600
QELNSYN  DS    A                  NEXT QEL ON SYSID SYNONYM CHAIN.      02687800
*                                 Valid only in ring mode for requests  02690000
*                                 originating on other systems     @L6C 02692200
QELPSYN  DS    A                  PREVIOUS QEL ON SYSID SYNONYM CHAIN.  02694400
*                                 Valid only in ring mode for requests  02696600
*                                 originating on other systems     @L6C 02698800
QELQXB   DS    A                  ADDRESS OF QXB                        02701000
QELQCB   DS    A                  ADDRESS OF QCB                        02704400
QELSAHTE DS    A                  ADDRESS OF SLOT IN SYSID/ASID HASH    02705100
*                                 TABLE. VALID ONLY WHEN THE REQUEST    02705800
*                                 ORIGINATED FROM A GRS SYSTEM OTHER    02706500
*                                 THAN CURRENT.                         02707200
QELORIGN DS    F                  ORIGIN OF REQUEST                     02708000
         ORG   QELORIGN                                                 02728800
QELSYSID DS    H                  SYSTEM ID OF REQUESTOR                02749600
QELASID  DS    H                  ASID OF REQUESTOR                     02791200
QELMASID DS    H                  MASID VALUE SPECIFIED WITH       @L2C 02812000
*                                 ENQ/RESERVE THAT CREATED THIS    @L2A 02832800
*                                 QEL, OR ZERO.                    @L2A 02853600
QELQFLGS DS    B                  THESE FLAGS PERTAIN TO THE QEL        02874400
QELSHARE EQU   X'80'              WHEN 1, SHARED REQUEST.               02916000
*                                 WHEN 0, EXCLUSIVE REQUEST             02957600
QELMC    EQU   X'40'              MC= REQUEST                           02999200
QELRESV  EQU   X'20'              RESERVE REQUEST                       03040800
QELRESVC EQU   X'10'              RESERVE CONVERTED TO GLOBAL ENQ       03082400
QELAUTH  EQU   X'08'              CALLER IS AUTHORIZED                  03125400
QELTCBFA EQU   X'04'              TCBFA WAS ON WHEN QEL INITIALIZED     03168400
QELQMADQ EQU   X'02'              MASID DAMAGED-QEL FLAG.  IF 1,   @L2C 03178300
*                                 THIS QEL WAS CREATED BY AN       @L2A 03188200
*                                 INVALID MASID-ENQ, OR THIS QEL   @L2A 03198100
*                                 PREVIOUSLY POINTED AT A          @L2A 03208000
*                                 MASID-TARGET QEL THAT WAS        @L2A 03217900
*                                 REMOVED BY AN INVALID DEQ.       @L2A 03227800
QELQMATD EQU   X'01'              MASID/MTCB DEFERRED-STEAL FLAG.  @L2C 03237700
*                                 IF 1, THIS QEL WAS A             @L2A 03247600
*                                 MASID-TARGET WHEN ENQ-STEAL      @L2A 03257500
*                                 WAS NEEDED.  STEAL MUST BE       @L2A 03267400
*                                 PERFORMED WHEN THE CORRESPONDING @L2A 03277300
*                                 MASID-QEL IS REMOVED.            @L2A 03287200
QELLFLGS DS    B                  THESE FLAGS PERTAIN TO LIST REQUESTS  03297400
QELPOST  EQU   X'80'              The requestor has been given access   03318900
*                                 to this resource. QXBWAITC should     03340400
*                                 not be decremented for this QEL  @L6C 03361900
QELECBF  EQU   X'40'              THIS IS AN ECB REQUEST                03383400
QELECBZ  EQU   X'20'              ECB-ADDRESS OF ZERO WAS          @L2C 03397700
*                                 SPECIFIED. QEL CAN BE DEQ-ED     @L2A 03412000
*                                 WHEN IT IS NOT IN FIRST-GROUP,   @L2A 03426300
*                                 BUT RB-POST MUST BE USED.        @L2A 03440600
QELLERSV EQU   X'10'              EARLY-RESERVE FLAG.  QEL         @L1C 03454900
*                                 WAS CREATED BY AN EARLY GLOBAL   @L1A 03469200
*                                 RESERVE THAT WAS CONVERTED TO A  @L1A 03483500
*                                 LOCAL RESERVE.                   @L1A 03497800
QELGQSIR EQU   X'08'              ISGQSCAN INFO ROUTINE FLAG   @YA08322 03509300
*                                 IF 1, AN ISGQSCAN INFORMATION         03520800
*                                 ROUTINE EXISTS FOR THE ADDRESS SPACE  03532300
*                                 SPECIFIED BY QELASID             @L2A 03543800
QELRNLNO EQU   X'04'              NO RNL CHANGE                    @L4C 03555400
QELFDTRY EQU   X'02'              FAST DEQ BEING ATTEMPTED FOR THIS     03581400
*                                 REQUESTS                        @L3A  03607400
QELAFRES EQU   X'01'              AFFECTED RESOURCE               @L4C  03646400
QELUCB   DS    A                  CONTAINS UCB ADDRESS WHEN QELRESV=1   03685500
QELFLGS3 DS    B                  Third flag byte                  @L6A 03687400
QELOWNER EQU   X'80'              The requestor owns the                03689300
*                                 resource                         @L6A 03691200
QELSEHLD EQU   X'40'              SYSEVENT-ENQHOLD has been             03693100
*                                 issued for this QEL              @L6A 03695000
QELMC2E  EQU   X'20'              This QEL is a MASID convert-          03696900
*                                 to-exclusive request             @L6A 03698800
QELMTARG EQU   X'10'              This QEL is the target of             03700700
*                                 a MASID-QEL                      @L6A 03702600
QELNOHLD EQU   X'08'              Do not issue SYSEVENT-ENQHOLD         03703200
*                                 for this QEL                     @P4A 03703800
QELUCBER EQU   X'04'              Do not decrement UCBSQC               03704000
*                                 for this QEL                     @P5A 03704200
QELWAITR EQU   X'02'              Waiting for a reserve to              03704300
*                                 complete (SYNCHRES=YES)          @P6A 03704400
QELRSV01 DS    CL3                Reserved                         @01C 03705000
QELCQE   DS    A                  Pointer to CQE                   @01A 03705600
QELEND   DS    0D                 END OF QEL                            03706400
         MEND                                                           03750000
*                                                                    */ 03800000
*%PLSQEL1: ;                                                            03850000
* DCL 1 QEL BASED(QELPTR) BDY(DWORD), /* QUEUE ELEMENT               */ 03900000
*       3 QELNQEL  PTR(31),          /* ADDRESS OF NEXT QEL          */ 03950000
*       3 QELPQEL  PTR(31),          /* ADDRESS OF PREVIOUS QEL      */ 04000000
*       3 QELNQELQ PTR(31),          /* NEXT QEL ON ASCB OR SYSID       04150000
*                                       QUEUE                        */ 04167800
*       3 QELPQELQ PTR(31),          /* PREVIOUS QEL ON ASCB OR         04185600
*                                       SYSID QUEUE                  */ 04203400
*       3 QELTOD BIT(64) BDY(DWORD), /* STCK time-of-day that ENQ       04209800
*                                       request was made. Valid only    04216200
*                                       in GRS star mode.        @L6A*/ 04222600
*         5 QELNSYN PTR(31),         /* NEXT QEL ON SYSID SYNONYM       04229000
*                                       CHAIN. Valid only in ring mode  04235400
*                                       for requests originating on     04241800
*                                       other systems.           @L6C*/ 04248200
*         5 QELPSYN PTR(31),         /* PREVIOUS QEL ON SYSID SYNONYM   04254600
*                                       CHAIN. Valid only in ring mode  04261000
*                                       for requests originating on     04267400
*                                       other systems.           @L6C*/ 04273800
*       3 QELQXB   PTR(31),          /* ADDRESS OF QXB               */ 04280600
*       3 QELQCB   PTR(31),          /* ADDRESS OF QCB               */ 04286600
*       3 QELSAHTE PTR(31),          /* ADDRESS OF SLOT IN SYSID/ASID   04287600
*                                       HASH TABLE. VALID ONLY WHEN     04288600
*                                       THE REQUEST ORIGINATED FROM A   04289600
*                                       GRS SYSTEM OTHER THAN           04290600
*                                       CURRENT                      */ 04291600
*       3 QELORIGN FIXED(32),        /* ORIGIN OF REQUESTOR          */ 04292800
*         5 QELSYSID FIXED(16),      /* SYSTEM ID OF REQUESTOR       */ 04328500
*         5 QELASID  FIXED(16),      /* ASID OF REQUESTOR            */ 04364200
*       3 QELMASID FIXED(16),        /* MASID VALUE SPECIFIED WITH      04385600
*                                       ENQ/RESERVE THAT CREATED        04407000
*                                       THIS QEL, OR ZERO.       @L2C*/ 04428400
*       3 QELQFLGS BIT(8),           /* THESE FLAGS PERTAIN TO THE      04450000
*                                       QEL                          */ 04700000
*         5 QELSHARE BIT(1),         /* WHEN 1, SHARED REQUEST          04750000
*                                       WHEN 0, EXCLUSIVE REQUEST    */ 04775000
*         5 QELMC    BIT(1),         /* MC REQUEST                   */ 04800000
*         5 QELRESV  BIT(1),         /* RESERVE REQUEST              */ 04850000
*         5 QELRESVC BIT(1),         /* RESERVE CONVERTED TO GLOBAL     04900000
*                                       ENQ                          */ 04941600
*         5 QELAUTH  BIT(1),         /* CALLER IS AUTHORIZED         */ 04983200
*         5 QELTCBFA BIT(1),         /* TCBFA ON WHEN QEL INITIALIZED*/ 05024800
*         5 QELQMADQ BIT(1),         /* MASID DAMAGED-QEL FLAG. IF 1,   05033100
*                                       THIS QEL WAS CREATED BY AN      05041400
*                                       INVALID MASID-ENQ, OR THIS      05049700
*                                       QEL PREVIOUSLY POINTED AT A     05058000
*                                       MASID-TARGET QEL THAT WAS       05066300
*                                       REMOVED BY AN INVALID DEQ.      05074600
*                                                                @L2C*/ 05082900
*         5 QELQMATD BIT(1),         /* MASID/MTCB DEFERRED-STEAL       05091200
*                                       FLAG.  IF 1, THIS QEL WAS A     05099500
*                                       MASID-TARGET WHEN ENQ-STEAL     05107800
*                                       WAS NEEDED.  STEAL MUST BE      05116100
*                                       PERFORMED WHEN THE              05124400
*                                       CORRESPONDING MASID-QEL IS      05132700
*                                       REMOVED.                 @L2C*/ 05141000
*       3 QELLFLGS BIT(8),           /* THESE FLAGS PERTAIN TO LIST     05150000
*                                       REQUESTS                     */ 05200000
*         5 QELPOST  BIT(1),         /* The requestor has been given    05220000
*                                       access to this resource.        05240000
*                                       QXBWAITC should not be          05260000
*                                       decremented for this QEL @L6C*/ 05280000
*         5 QELECBF  BIT(1),         /* THIS IS AN ECB REQUEST       */ 05300000
*         5 QELECBZ  BIT(1),         /* ECB-ADDRESS OF ZERO WAS         05315000
*                                       SPECIFIED. QEL CAN BE DEQ-ED    05330000
*                                       WHEN IT IS NOT IN FIRST-GROUP,  05345000
*                                       BUT RB-POST MUST BE             05360000
*                                       USED.                    @L2A*/ 05375000
*         5 QELLERSV BIT(1),         /* EARLY-RESERVE FLAG.  QEL        05390000
*                                       WAS CREATED BY AN EARLY GLOBAL  05405000
*                                       RESERVE THAT WAS CONVERTED      05420000
*                                       TO A LOCAL RESERVE       @L1A*/ 05435000
*         5 QELGQSIR BIT(1),         /* ISGQSCAN INFORMATION ROUTINE    05445800
*                                       FLAG.  IF 1, AN ISGQSCAN INFO   05456600
*                                       ROUTINE EXISTS FOR THE ADDRESS  05467400
*                                       SPACE SPECIFIED BY QELASID      05478200
*                                                            @YA08322*/ 05489000
*         5 QELRNLNO BIT(1),         /* NO RNL CHANGE            @L4C*/ 05500000
*         5 QELFDTRY BIT(1),         /* 1 - FAST DEQ BEING ATTEMPTED    05530000
*                                                                @L3A*/ 05560000
*         5 QELAFRES BIT(1),         /* AFFECTED RESOURCE        @L4C*/ 05605000
*       3 QELUCB   PTR(31),          /* CONTAINS UCB ADDRESS WHEN       05650000
*                                       QELRESV=1                    */ 05700000
*       3 QELFLGS3 BIT(8),           /* Third flag byte          @L6A*/ 05704100
*         5 QELOWNER BIT(1),         /* The requestor owns the          05708200
*                                       resource                 @L6A*/ 05712300
*         5 QELSEHLD BIT(1),         /* SYSEVENT-ENQHOLD has been       05716400
*                                       issued for this QEL      @L6A*/ 05720500
*         5 QELMC2E  BIT(1),         /* This QEL is a MASID convert-    05724600
*                                       to-exclusive request     @L6A*/ 05728700
*         5 QELMTARG BIT(1),         /* This QEL is the target of       05732800
*                                       a MASID-QEL              @L6A*/ 05736900
*         5 QELNOHLD BIT(1),         /* Do not issue SYSEVENT-ENQHOLD   05738900
*                                       for this QEL             @P4A*/ 05740900
*         5 QELUCBER BIT(1),         /* UCBSQC reaches max       @P5A*/ 05742300
*         5 QELWAITR BIT(1),         /* Waiting for a reserve to        05743000
*                                       complete (SYNCHRES=YES)  @P6A*/ 05743700
*         5 *        BIT(1),         /* Reserved                 @P6C*/ 05744400
*       3 QELRSV01 CHAR(3),          /* Reserved                 @01C*/ 05746200
*       3 QELCQE   ptr(31),          /* Pointer to CQE           @01A*/ 05748000
*       3 QELEND   CHAR(0) BDY(DWORD); /* END OF QEL                 */ 05750000
