*        %GOTO PLSQCB;                                               /* 00050000
         MACRO                                                          00100000
         ISGQCB                                                         00150000
**/                                                                     00200000
*%PLSQCB: ;                                                             00250000
*/* START OF SPECIFICATIONS *****************************************   00259000
*                                                                       00394400
*01* DESCRIPTIVE NAME:  QUEUE CONTROL BLOCK                             00420300
*02*  ACRONYM:  QCB                                                     00446200
*                                                                       00448300
*01* PROPRIETARY STATEMENT =                                            00450400
*                                                                       00452500
*    LICENSED MATERIALS - PROPERTY OF IBM                               00454600
*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        00456700
*    5645-001 (C) COPYRIGHT IBM CORP. 1980, 1996                        00458800
*                                                                       00460900
*01* STATUS = JBB6602                                                   00463000
*                                                                       00465100
*01* EXTERNAL CLASSIFICATION:  DMTI                                     00467200
*01* END OF EXTERNAL CLASSIFICATION                                     00469300
*                                                                       00472200
*01* MACRO NAME: ISGQCB                                                 00522200
*                                                                       00572200
*01* MACRO DATE: 04/26/94                                          @L3C 00622200
*                                                                       00822200
*01* DSECT NAME: QCB                                                    00872200
*                                                                       00922200
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  00972200
*                                                                       01050000
*01* EYE-CATCHER:  None                                                 01058900
*02*  OFFSET:  N/A                                                      01067800
*02*  LENGTH:  N/A                                                      01076700
*                                                                       01085600
*01* STORAGE ATTRIBUTES:                                                01094500
*02*    SUBPOOL:   127 in the GRS private area                          01103400
*02*    KEY:       0                                                    01112300
*02*    Residency: Above 16M line                                       01121200
*                                                                       01130100
*01* SIZE: THE QCB IS DEFINED IN 3 SIZES AS INDICATED BY                01139000
*          QCBSIZE1, 2 AND 3.                                           01147900
*                                                                       01156800
*01* CREATED BY: The ENQ/RESERVE processing routines (ISGGNQDQ,         01165700
*                ISGGRP00, ISGWENQ) obtain the QCB from the             01174600
*                GRS Storage Manager.                                   01183500
*                                                                       01192400
*01* POINTED TO BY: QCBNQCB, QCBPQCB, QHTEFQCB, QHTELQCB, QELQCB        01201300
*                                                                       01210200
*01* SERIALIZATION: LOCAL RESOURCE  - THE CMS ENQ/DEQ CLASS LOCK        01219100
*                   GLOBAL RESOURCE - THE GRS LOCAL LOCK                01228000
*                                                                       01236900
*01* FUNCTION: DESCRIBE A GRS RESOURCE.                                 01245800
*                                                                       01254700
*01* METHOD OF ACCESS: BAL - DSECT IS PRODUCED REQUIRING                01263600
*                            A USING ON THE QCB.                        01272500
*                      PLS - QCB DECLARED AS BASED STRUCTURE.           01281400
*                            QCBPTR MUST BE DECLARED.                   01290300
*                                                                       01300000
*01* DELETED BY: The DEQ processing routines (ISGGNQDQ, ISGGRP00,       01525000
*                ISGGDEQP, ISGWDEQ) return the QCB to the               01550000
*                GRS Storage Manager.                                   01575000
*                                                                       01600000
*01* DEPENDENCIES:                                                      01650000
*                                                                       01700000
*       THE PQCB MAPS THE QCB. THEREFORE, WHENEVER THE QCB              01745800
*       CHANGES IT MAY ALSO BE NECESSARY TO MODIFY THE PQCB.            01791600
*                                                                       01837500
*01* DISTRIBUTION LIBRARY: APVTMACS                                @L2C 01887500
*                                                                       02000000
*01* CHANGE ACTIVITY:                                                   02050000
*        SUPPORTS THE FOLLOWING PRODUCTS:                               02324900
* $L1=MASIDENQ,JBB2125,830411,PD1L: MASID/MTCB ENQ/RESERVE       @L1A   02333200
* $L2=GRS32   ,JBB6602,940426,PDBD: GRS Star                     @L2A   02336000
* $L3=GRS32   ,JBB6602,940426,PDDX: GRS Star                            02338800
*                                   Add star-mode extension pointer,    02341600
*                                   comment change to QCBRNAME,         02344400
*                                   prolog changes for SHOWHDR   @L3A   02347200
*                                                                       02350000
*        SUPPORTS THE FOLLOWING APARS:                                  02355000
*             OZ78340 - GRS PERFORMANCE ENHANCEMENTS:                   02360000
*                       A) CHANGE QCB-2 RNAME CAPACITY FROM 44 TO       02365000
*                          52 BYTES.                                    02370000
*                       B) REQUEUE FULLY ALLOCATED PEXB ON THE END      02375000
*                          OF THE CURRENT ACTIVE PEXB QUEUE.            02380000
*                       C) ENHANCED VERSION OF THE GRS HASHING ROUTINE  02385000
*                          (ISGSHASH).                         @ZA78340 02390000
*                                                                       02395000
**** END OF SPECIFICATIONS *******************************************/ 02422500
*/*A000000-999999                                            @G381PYC*/ 02450000
*        %GOTO PLSQCB1;                                              /* 02500000
QCB      DSECT                                                          02550000
         DS    0D                 QUEUE CONTROL BLOCK                   02600000
QCBBASIC DS    CL40                                                     02650000
         ORG   QCBBASIC                                                 02668700
QCBNQCB  DS    A                  ADDRESS NEXT QCB ON SYNONYM CHAIN     02687400
QCBPQCB  DS    A                  ADDRESS PREVIOUS QCB ON SYNONYM CHAIN 02706100
QCBFQEL  DS    A                  ADDRESS FIRST QEL FOR THIS RESOURCE   02724800
QCBLQEL  DS    A                  ADDRESS LAST QEL FOR THIS RESOURCE    02743500
QCBQHTE  DS    A                  ADDRESS OF QUEUE HASH TABLE ENTRY     02757900
*                                 FOR THIS RESOURCE                     02758500
QCBQCBS@ DS    A                  Address of star-mode QCB              02759400
*                                 extension (QCBS). Valid in            02760300
*                                 star-mode only.                  @L3C 02761200
QCBASID  DS    H                  ASID OF REQUESTOR. VALID ONLY WHEN    02762200
*                                 QCBSTEP=1                             02771500
QCBRFLGS DS    B                  RESOURCE DESCRIPTION FLAGS            02780900
QCBSYS   EQU   X'80'              SCOPE OF SYSTEM                       02800000
QCBSYSS  EQU   X'40'              SCOPE OF SYSTEMS                      02850000
QCBSTEP  EQU   X'20'              SCOPE OF STEP                         02900000
QCBGLOBL EQU   X'10'              GLOBAL RESOURCE INDICATOR             02924900
QCBNOENQ EQU   X'08'              NO ENQS PERMITTED - SET BY FRR        02950000
QCBPHLDR EQU   X'04'              THIS IS A PLACEHOLDER QCB.            03000000
*                                 NOTE THAT THIS QCB DOES NOT DEFINE    03016600
*                                 A RESOURCE REQUEST.                   03033200
QCBQM    EQU   X'02'              QUEUE MERGE - INDICATES RESOURCE      03050000
*                                 HAS BEEN PROCESSED.                   03100000
QCBMASF  EQU   X'01'              MASID-FLAG.  IF 1, THE QEL-CHAIN OF   03112600
*                                 THIS QCB HAS (OR ONCE HAD) A QEL      03125200
*                                 WITH A NON-ZERO QELMASID FIELD.  IF   03137800
*                                 0, QELMASID IS ZERO IN EVERY QEL      03150400
*                                 ON THE QEL-CHAIN OF THIS QCB.    @L1C 03163000
QCBFLGS2 DS    B                  Second flag byte                 @L3C 03172800
QCBSOC   EQU   X'80'              Start-of-contention has been noted    03182600
*                                 for this resource.               @L3A 03192400
QCBRNAML DS    H                  LENGTH OF RNAME                       03202200
QCBRRSV2 DS    2C                 RESERVED                              03228300
         DS    0D                                                       03241300
QCBQNAME DS    CL8                QNAME OF THIS RESOURCE                03254400
QCBEND   DS    0X                 END OF QCB FIXED SECTION              03280500
QCBRNAME DS    0C                 RNAME OF THIS RESOURCE (VARIABLE LEN, 03293500
*                                 padded with zeroes to word boundary). 03306500
*                                                                  @L3C 03319500
*                                                                       03332700
*     THE FOLLOWING DEFINES THE 3 RNAME LENGTHS USED TO COMPUTE         03358800
*     THE 3 QCB SIZES. NOTE THAT THE RNAME, BUT NOT THE RNAME           03384900
*     LENGTH, IS MAINTAINED ON A WORD BOUNDARY WITHIN THE QCB.          03411000
*                                                                       03437100
QCBRNSZ1 EQU   24                 RNAME LENGTH 24                       03463200
QCBRNSZ2 EQU   52                 RNAME LENGTH 52              @ZA78340 03480700
QCBRNS2A EQU   44                 RNAME LENGTH 44              @ZA78340 03498200
QCBRNSZ3 EQU   256                MAX RNAME LENGTH + 1                  03515800
*                                                                       03542100
*     THE FOLLOWING DEFINES THE 3 QCB SIZES.                            03568400
*                                                                       03594700
QCBSIZE1 EQU   QCBEND-QCB+QCBRNSZ1 QCB SIZE 1                           03621000
QCBSIZE2 EQU   QCBEND-QCB+QCBRNSZ2 QCB SIZE 2                           03647300
QCBSIZ2A EQU   QCBEND-QCB+QCBRNS2A QCB SIZE 2A                 @ZA78340 03660400
QCBSIZE3 EQU   QCBEND-QCB+QCBRNSZ3 QCB SIZE 3                           03673600
         MEND                                                           03700000
*                                                                    */ 03750000
*%PLSQCB1: ;                                                            03800000
* DCL 1 QCB BASED(QCBPTR) BDY(WORD), /* QUEUE CONTROL BLOCK      @L2C*/ 03850000
*       3 QCBBASIC CHAR(40) BDY(WORD), /* QCB BASIC SECTION      @L2C*/ 03900000
*         5 QCBNQCB  PTR(31),        /* ADDRESS NEXT QCB ON SYNONYM     03950000
*                                       CHAIN                        */ 04000000
*         5 QCBPQCB  PTR(31),        /* ADDRESS PREVIOUS QCB ON SYNONYM 04050000
*                                       CHAIN                        */ 04100000
*         5 QCBFQEL  PTR(31),        /* ADDRESS FIRST QEL FOR THIS      04150000
*                                       RESOURCE                     */ 04200000
*         5 QCBLQEL  PTR(31),        /* ADDRESS LAST QEL FOR THIS       04250000
*                                       RESOURCE                     */ 04300000
*         5 QCBQHTE  PTR(31),        /* ADDRESS OF QUEUE HASH TABLE     04338700
*                                       ENTRY FOR THIS RESOURCE      */ 04340200
*         5 QCBQCBS@ PTR(31),        /* Address of star-mode QCB        04342600
*                                       extension (QCBS). Valid only    04345000
*                                       in star-mode.            @L3C*/ 04347400
*         5 QCBASID  FIXED(16),      /* ASID OF REQUESTOR. VALID ONLY   04350000
*                                       WHEN QCBSTEP=1               */ 04375000
*         5 QCBRFLGS BIT(8),         /* RESOURCE DESCRIPTION FLAGS   */ 04400000
*           7 QCBSYS   BIT(1),       /* SCOPE OF SYSTEM              */ 04450000
*           7 QCBSYSS  BIT(1),       /* SCOPE OF SYSTEMS             */ 04474900
*           7 QCBSTEP  BIT(1),       /* SCOPE OF STEP                */ 04516600
*           7 QCBGLOBL BIT(1),       /* GLOBAL RESOURCE INDICATOR    */ 04558300
*           7 QCBNOENQ BIT(1),       /* NO ENQS PERMITTED - SET BY      04600000
*                                       FRR                          */ 04650000
*           7 QCBPHLDR BIT(1),       /* THIS IS A PLACEHOLDER QCB.      04687500
*                                       NOTE THAT THIS QCB DOES NOT     04725000
*                                       DEFINE A RESOURCE REQUEST.   */ 04762500
*           7 QCBQM    BIT(1),       /* QUEUE MERGE - INDICATES         04800000
*                                       RESOURCE HAS BEEN PROCESSED  */ 04850000
*           7 QCBMASF  BIT(1),       /* MASID-FLAG.  IF 1, THE          04855400
*                                       QEL-CHAIN OF THIS QCB HAS       04860800
*                                       (OR ONCE HAD) A QEL WITH A      04866200
*                                       NON-ZERO QELMASID FIELD.        04871600
*                                       IF 0, QELMASID IS ZERO IN       04877000
*                                       EVERY QEL ON THE QEL-CHAIN      04882400
*                                       OF THIS QCB.             @L1C*/ 04887800
*         5 QCBFLGS2 BIT(8),         /* Second flag byte         @L3C*/ 04892700
*           7 QCBSOC   BIT(1),       /* Start-of-contention has been    04897600
*                                       noted for this resource  @L3A*/ 04902500
*           7 *        BIT(7),       /* Reserved                 @L2A*/ 04907400
*         5 QCBRNAML FIXED(16),      /* LENGTH OF RNAME              */ 04912300
*         5 QCBRRSV2 CHAR(2),        /* RESERVED                     */ 04931000
*         5 QCBQNAME CHAR(8),        /* QNAME OF RESOURCE        @L2C*/ 04965500
*       3 QCBEND   CHAR(0),          /* END OF FIXED SECTION         */ 05000000
*       3 QCBRNAME CHAR(*);          /* RNAME OF RESOURCE (variable     05025000
*                                       length, padded with zeroes to   05050000
*                                       word boundary)           @L3C*/ 05075000
*/*                                                                  */ 05100000
*/*     THE FOLLOWING DEFINES THE 3 RNAME LENGTHS USED TO COMPUTE    */ 05150000
*/*     THE 3 QCB SIZES. NOTE THAT THE RNAME, BUT NOT THE RNAME      */ 05200000
*/*     LENGTH, IS MAINTAINED ON A WORD BOUNDARY WITHIN THE QCB.     */ 05250000
*/*                                                                  */ 05300000
*  DCL  QCBRNSZ1 CONSTANT(24) FIXED(8);  /* RNAME LENGTH 24          */ 05350000
*  DCL  QCBRNSZ2 CONSTANT(52) FIXED(8);  /* RNAME LENGTH 52  @ZA78340*/ 05383300
*  DCL  QCBRNS2A CONSTANT(44) FIXED(8);  /* RNAME LENGTH 44  @ZA78340*/ 05416600
*  DCL  QCBRNSZ3 CONSTANT(256) FIXED(16); /* RNAME LENGTH 256        */ 05450000
*/*                                                                  */ 05500000
*/*     THE FOLLOWING DEFINES THE 3 QCB SIZES                        */ 05550000
*/*                                                                  */ 05600000
* DCL QCBSIZE1 CONSTANT(QCB_kBasicSize+QCBRNSZ1) FIXED(8); /* Size 1    05650000
*                                                                @L2A*/ 05700000
* DCL QCBSIZE2 CONSTANT(QCB_kBasicSize+QCBRNSZ2) FIXED(8); /* Size 2    05750000
*                                                                @L2A*/ 05800000
* DCL QCBSIZ2A CONSTANT(QCB_kBasicSize+QCBRNS2A) FIXED(8); /* Size 2A   05850000
*                                                                @L2A*/ 05900000
* DCL QCBSIZE3 CONSTANT(QCB_kBasicSize+QCBRNSZ3) FIXED(16); /* Size 3   05950000
*                                                                @L2A*/ 06000000
* DCL QCB_kBasicSize CONSTANT(LENGTH(QCB.QCBBASIC)); /* Length of QCB   06050000
*                                       basic section            @L2A*/ 06100000
*                                                                       06150000
