*        %GOTO PLSQWB;                                               /* 00050000
         MACRO                                                          00100000
         ISGQWB                                                         00150000
**/                                                                     00200000
*%PLSQWB: ;                                                             00250000
*/* START OF SPECIFICATIONS *****************************************   00259000
*                                                                       00450000
*01* DESCRIPTIVE NAME:  QUEUE WORK BLOCK                                00472200
*02*  ACRONYM:  QWB                                                     00494400
*                                                                       00496100
*01* PROPRIETARY STATEMENT =                                            00497800
*                                                                       00499500
*    LICENSED MATERIALS - PROPERTY OF IBM                               00501200
*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        00502900
*    5645-001 (C) COPYRIGHT IBM CORP. 1980, 1996                        00504600
*                                                                       00506300
*01* STATUS = JBB6602                                                   00508000
*                                                                       00509700
*01* EXTERNAL CLASSIFICATION:  DMTI                                     00511400
*01* END OF EXTERNAL CLASSIFICATION                                     00513100
*                                                                       00514800
*                                                                       00516600
*01* MACRO NAME: ISGQWB                                                 00565600
*                                                                       00614700
*01* Macro Date: 06/05/96                                          @P7C 00664700
*                                                                       00855200
*01* DSECT NAME: QWB, QWBX, QWBE                                        00903300
*                                                                       00951400
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  01001400
*                                                                       01218500
*01* EYE-CATCHER:  None                                                 01240300
*02*  OFFSET:  N/A                                                      01262100
*02*  LENGTH:  N/A                                                      01283900
*                                                                       01305900
*01* STORAGE ATTRIBUTES:                                                01355900
*02*    SUBPOOL:   127 (private area QWBs) or 245 (the SQA QWB)         01405900
*02*    KEY:       0                                                    01455900
*02*    Residency: Above 16M line                                       01505900
*                                                                       01729000
*01* SIZE: FIXED LENGTH DEFINED AS FOLLOWS:                             01750500
*          (NOTE THAT THE SIZE OF QWBPEL IS BASED ON                    01772000
*           THE MAXIMUM PEL ENTRY SIZE.)                                01793500
*            GRS PRIVATE AREA QWB-S - 504 BYTES                    @L4C 01815000
*            SQA QWB                - 4K  BYTES                         01836500
*                                                                       01858000
*01* CREATED BY: GRS PRIVATE AREA QWB-S - OBTAINED BY THE ENQ/DEQ       01883800
*                          PROCESSING ROUTINES, ISGGQWBI AND            01909600
*                          ISGGQWB0, FROM THE GRS STORAGE MANAGER.      01935400
*                                                                       01961200
*                SQA QWB - TEMPORARY QWB OBTAINED DURING NIP BY         01987000
*                          ISGNCBIM AND RECREATED (PERMANENTLY)         02012800
*                          DURING NIP BY ISGNASIM.                      02038600
*                                                                       02064400
*01* POINTED TO BY: GRS PRIVATE AREA QWB - QWBHNQWB, QXBQWB             02072100
*                   SQA QWB - GVTSQWB                                   02079800
*                                                                       02087500
*01* SERIALIZATION: GRS PRIVATE AREA QWB-S - CMS ENQ/DEQ CLASS LOCK.    02095200
*                   NOTE THAT FIELD QWBHMFGS CAN BE CHANGED BY     @P5A 02102900
*                   ROUTINES HOLDING ONLY THE GRS LOCAL LOCK.      @P5A 02110600
*                   SQA QWB - CMS ENQ/DEQ CLASS LOCK.                   02118300
*                                                                       02126000
*01* FUNCTION:  USED TO DESCRIBE A GRS RESOURCE REQUEST.           @L4C 02133700
*                                                                       02141900
*01* Internal Description                                               02151300
*            A QWB or Queue Work Block is a cell in the GRS Extended    02160800
*            Resource Queue Area (ERQA). QWBs are chained together by   02179700
*            virtual addresses located at offset zero in the QWBs.      02198600
*            There are two types of QWBs:                               02217500
*                                                                       02236500
*            HEAD-QWB:                                                  02256200
*                A QWB which contains the following:                    02275900
*                      A) A QWB header-section.                         02295600
*                         Contains common information describing the    02315300
*                         request, including the type of request        02335000
*                         and information about the requestor.          02354700
*                                                                       02374700
*                      B) A QWB SMPL-section.                           02375800
*                         Contains the parameter list required          02376900
*                         for the interface to the GRS Storage Manager. 02378000
*                                                                       02379100
*                      C) A QWB basic-section.                          02380200
*                         A basic-section contains pointer QWBEXTA      02381300
*                         and PELX's if one of the following flags      02382400
*                         is on in the QWB header-section:              02383500
*                            QWBHENQ   (ENQ or RESERVE request)         02384600
*                            QWBHDEQ   (DEQ request)                    02385700
*                         Each PELX describes one of the resources      02386800
*                         requested by the ENQ/RESERVE or DEQ. Flag     02387900
*                         PELXLAST is on in the last PELX of the        02389000
*                         basic-section. Further PELXs that cannot fit  02390100
*                         in the basic-section of the head-QWB are      02391200
*                         placed in a QWB-extension (see below).        02392300
*                                                                       02393400
*                         A basic-section contains only pointer         02394500
*                         QWBEXTA (which is always zero) if one of      02395600
*                         the following flags is on in the              02396700
*                         QWB header-section:                           02397800
*                            QWBHDTCB  (DEQ by TCB)                     02398900
*                            QWBHDAS   (DEQ by ASID)                    02400000
*                            QWBHDSYS  (DEQ by SYSID)                   02401100
*                            QWBHSYNC  (synchronization request)        02402200
*                                                                       02403300
*                      D) (optional) a QWB header-extension-section     02404400
*                         (QWBX)                                        02405500
*                         A header-extension-section contains the       02406600
*                         same kind of information as in the header.    02407700
*                         A header-extension-section is present if      02408800
*                         the following flag is on in the QWB header-   02409900
*                         section:                                      02411000
*                            QWBHXTNP  (header-extension-section        02412100
*                                       present flag)                   02413200
*                         If QWBHXTNP is on, then field QWBHNWPS will   02414300
*                         be non-zero and will contain a count of the   02415400
*                         number of 4-byte words occupied by PELX       02416500
*                         control blocks in the basic-section.  The     02417600
*                         header-extension-section occupies the space   02418700
*                         immediately following the last PELX.          02419800
*                                                                       02420900
*                      E) A QWB tail-section.                           02422000
*                         A tail-section contains more information      02423100
*                         describing the request that could not         02424200
*                         be fit into the header-section.          @L4A 02425300
*                                                                       02426400
*                Head-QWBs are chained together by QWBHNQWB, a          02427500
*                fullword pointer in the first word of the Head-QWB.    02428600
*                                                                       02429700
*                A Head-QWB may point at a chain of QWB-extensions      02430800
*                (described below)  in pointer QWBEXTA.  QWBEXTA is the 02431900
*                first word of the basic-section of the Head-QWB.       02433000
*                                                                       02434100
*            QWB EXTENSION:                                             02435200
*                A QWB that contains only a QWB basic-section.          02436300
*                                                                       02437400
*                The Head-QWB and the QWB-extension are both mapped     02438500
*                by mapping macro ISGQWB.  The QWB-extension contains   02439600
*                no header-section and no SMPL-section.  Because of     02440700
*                this, pointer QWBPTR sometimes points at a             02441800
*                "non-existent header-section and SMPL-section" in      02442900
*                front of the QWB-extension when QWBPTR is used to      02444000
*                access a QWB-extension. More modern code uses          02445100
*                the QWBE mapping included in this macro.          @L4C 02446200
*                                                                       02447300
*                QWB-extensions are chained together by the fullword    02448400
*                pointer in the first word of the QWB-extension.  This  02449500
*                pointer is referenced as QWBEXTA when QWBPTR is set    02450600
*                to point at the "non-existent header-section and       02451700
*                SMPL-section" in front of the QWB-extension.           02452800
*                Alternately, the pointer may be referenced as          02453900
*                QWBHNQWB or QWBEEXTA when QWBPTR is set to point       02455000
*                at the first byte of the QWB-extension.                02456100
*                                                                       02457200
*            The SQA-QWB is an area of storage that is referenced       02458300
*            using the ISGQWB mapping macro. It is a head-QWB           02459400
*            with an expanded QWBPEL section, which is used to hold     02460500
*            a copy of an ENQ or DEQ requests PELs while the ENQ        02461600
*            or DEQ is initially processed.                        @L4P 02462700
*                                                                       02463800
*                                                                       02464900
*01* METHOD OF ACCESS: BAL - DSECT IS PRODUCED REQUIRING A              02466000
*                            USING ON THE QWB.                          02467100
*                            QWBX REQUIRES A USING ON QWBX.    @L2A     02468200
*                      PL/X- QWB DECLARED AS A BASED STRUCTURE.         02469300
*                            QWBPTR MUST BE DECLARED.                   02470400
*                            QWBX STRUCTURE IS ALSO DECLARED   @L2A     02471500
*                            TO BE BASED ON QWBPTR.            @L2A     02472600
*                                                                       02473700
*01* DELETED BY: GRS PRIVATE AREA QWB-S - RELEASED BY THE ENQ/DEQ       02477000
*                          PROCESSING ROUTINES (ISGNQDQ, ISGGRP00,      02478100
*                          ISGGTRM0, ISGGQWB0) VIA THE GRS STORAGE      02479200
*                          MANAGER.                                     02480300
*                                                                       02483700
*                SQA QWB - THIS IS A PERMANENT QWB THAT IS NEVER        02505500
*                          DELETED.                                     02527300
*                                                                       02549100
*01* DEPENDENCIES:  The QWBHRSA and QWBHRSA2 sections are copied        02562200
*                   to and from the QWARSA and QWARSA2 sections of      02575300
*                   a QWA (mapping macro ISGQWA). The mappings          02588400
*                   must be kept in synch.                              02601500
*                                                                       02614900
*01* DISTRIBUTION LIBRARY: APVTMACS                                     02664900
*                                                                       02756800
*01* CHANGE ACTIVITY:                                                   02764100
*                                                                       02771500
* Supports the following products:                                      02774400
*                                                                       02777300
* $L1=GRSRAS  ,JBB1326,810424,PD1M: GRS END OF TASK                @L1A 02780400
* $L2=MASIDENQ,JBB2125,830411,PD1L: MASID=/MTCB= ENQ/RESERVE       @L2A 02786300
* $L3=GRSPF   ,JBB3311,871115,PDAH: GRS PERFORMANCE ENHANCEMENTS.       02786700
*       Additional flags for Fast DEQ, QWB compression/reconstruction   02787100
*       level 4 and for ring acceleration.                         @L3A 02787500
* $L4=GRSCS   ,JBB6602,940408,PDDX: GRS Star                            02787700
*                                   Added QWBTAIL section.              02787900
*                                   Changed QWBHFDQS to QWBRSEEN so     02788100
*                                     GRS local lock is unneeded.       02788300
*                                   Changed size of QWBPEL to correctly 02788500
*                                     reflect the way ISGGQWBI uses it. 02788700
*                                   Added separate mapping for QWB      02788900
*                                     extension (QWBE) so System        02789100
*                                     Server does not have to go        02789300
*                                     through the same contortions      02789500
*                                     the ring modules do.              02789700
*                                   Updated macro prolog from superior  02789900
*                                     descriptions in ISGGQWB1 prolog,  02790100
*                                     other changes for SHOWHDR.        02790300
*                                                                       02790500
* Supports the following PTMs:                                          02790700
*                                                                       02790900
* $P1=PAJ0216 ,JBB2125,830804,PD1L: DEFINE QWBHECBZ                @P1A 02791100
*                                                                       02792200
* $P2=PCG0004 ,JBB3311,880122,PDAH: Comment clarifications         @P2A 02792500
*                                                                       02792800
* $P3=PCG0007 ,JBB3311,880203,PDAH: Additional field needed for         02792900
*              PFT-compression indicator                           @P3A 02793000
*                                                                       02793100
* $P4=PCG0028 ,JBB3311,880309,PDDM: Incorrect offset for QWBHMFGS       02793200
*              produced by BAL version.                            @P4A 02793300
*                                                                       02793400
* $P5=PCG0099 ,JBB3311,880425,PDDM: Add serialization of QWBHMFGS       02793700
*              to prolog.                                          @P5A 02794000
* $P6=Pxxxxxx ,JBB6602,940420,PDDX: From PIG3380.                       02794100
*              Combine QWBHSMC and QWBHRMC bits, and use the left over  02794200
*              bit for QWBHMTDQ. This replaces the use of the           02794300
*              high-order bit of QWBHGRES for this information.    @P6C 02794400
* $P7=PSD0207 ,JBB6602,951218,PDZU: Define additional flags in          02794500
*              QWBSTAR for star mode                               @P7A 02794600
*                                                                       02794700
* Supports the following APARs:                                         02794800
*                                                                       02794900
* OY08322 - GRS ENHANCEMENTS FOR SERVICE ADDRESS SPACES:                02795200
*            A) GQSCAN OBTAINS REQUESTORS ASID FROM THE SERVICE         02795600
*               ADDRESS SPACE                                           02797300
*            B) DISPLAY GRS COMMAND DISPLAYS REQUESTORS JOBNAME         02799000
*               AND ASID                                       @YA08322 02800700
*                                                                       02802400
* OY13087 - GRS RAS/OPERATIONS SPE                                      02802500
*                                                                       02802600
*       The QWB's are flagged as damaged if they contain an invalid     02802700
*       sysid.  After the QWB is processed (only ENQ requests are       02802800
*       processed if damaged), it is added to the QWB damaged chain     02802900
*       which is headed by GVTXQWBD and chained by QWBHNQWB.  If the    02803000
*       QWB is on the damaged chain, fields QWBDCLK and QWBDRCDE        02803100
*       contain debugging information.                         @YA13087 02803200
* $01=OW21192 ,JBB6602,960605,PDBD: Define QWB which is a DEQ of a      02808500
*     PSD1136                       specific ENQ request                02813800
*                                                                       02819300
* $02=OW49779 ,HBB6608,000912,PDLG: GRS Wildcard                        02824300
*                                                                       02829300
**** END OF SPECIFICATIONS *******************************************/ 02835300
*/*A000000-999999                                            @G381PYC*/ 02851400
*        %GOTO PLSQWB1;                                              /* 02900000
QWB      DSECT                                                          02950000
         DS    0D                 QUEUE WORK BLOCK                      03000000
*                                                                       03012400
*        HEADER SECTION                                                 03024800
*                                                                       03037200
QWBHDR   DS    CL60               QWB HEADER                            03050000
         ORG   QWBHDR                                                   03065400
QWBHNQWB DS    A                  ADDRESS OF NEXT QWB                   03080800
QWBHRSA  DS    CL28               QWB REQUEST SAVE AREA - MUST MAP      03096200
*                                 TO QWARSA                             03111600
         ORG   QWBHRSA                                                  03127000
QWBHMRBQ DS    A                  POINTER TO FIRST MRB IN MESSAGE       03142400
*                                 QUEUE. USED BY THE GRP TO RETURN      03157800
*                                 PURGE MESSAGES TO REQUESTOR.          03173200
         ORG   QWBHMRBQ                                                 03177100
QWBHNSYN DS    A                  ADDRESS OF NEXT STEAL SYNCHRONIZATION 03181000
*                                 QWB ON THE ASCB SYNC QUEUE            03184900
         ORG   QWBHNSYN                                            @P3A 03186200
QWBI4PCT DS    CL1                PFT-COMPRESSION INDICATOR        @P3A 03187500
         DS    CL3                RESERVED                         @P4A 03188200
QWBHERR  DS    X                  FIRST DIGIT OF ABEND CODE             03188900
QWBHMFGS DS    B                  MISC FLAG BYTE. Serialized with the   03192000
*                                 GRS local lock.                  @L3C 03195100
QWBHFFDM EQU   X'80'              FAST-DEQ-MARK-FLAG.  WHEN 1, QWB WAS  03198300
*                                 USED BY THE FAST-DEQ SRB-ROUTINE      03203000
*                                 WHICH SET QELFDTRY ON            @L3A 03207700
*                                                                  @L3D 03240600
QWBHPFLG DS    H                  SAVED PEL FLAGS (QWAPLAST AND         03245400
*                                 QWAPFLAG) OR COUNT OF GLOBAL          03246600
*                                 RESOURCES REQUESTED                   03247800
         ORG   QWBHPFLG                                                 03249000
QWBHGLBR DS    H                  GLOBAL RESOURCES REQUESTED, VALID     03249100
*                                 ONLY WHEN QWBHSYNC=1.                 03249200
         ORG   QWBHPFLG                                                 03249300
QWBHPFL1 DS    B                  PELLAST FLAG BYTE                     03249700
QWBHPFL2 DS    B                  PELFLAG FLAG BYTE                     03250400
*                                                                       03251300
* THE FOLLOWING FLAGS ARE ACCUMULATED IN THE QWA (QWAFLAG1) BY          03260100
* THE ENQ/DEQ/RESERVE MAINLINE ROUTINE. WHEN A GLOBAL RESOURCE          03268900
* REQUEST IS PROCESSED FROM THE GRP QWAFLAG1 IS MOVED TO QWBHFLG1.      03277700
* THE FLAGS ARE SUBSEQUENTLY MOVED BACK TO THE QWA AFTER THE            03286500
* ENQ/DEQ/RESERVE SVRB IS POST-D BY THE GRP. THEREFORE THE BIT          03295300
* DEFINITIONS OF QWBHFLG1 MUST MATCH THE BIT DEFINITIONS OF             03304100
* QWAFLAG1.                                                             03312900
*                                                                       03321700
QWBHFLG1 DS    B                  QWB PROCESS FLAGS                     03330500
QWBHSTLC EQU   X'80'              STEAL PROCESSING IS NOW COMPLETE,     03339300
*                                 I.E., DEQ QWB(S) HAVE BEEN PLACED     03348100
*                                 ON THE REQUEST QUEUE IF NECESSARY.    03356900
QWBHSMC  EQU   X'40'              INDICATES SET STEP MUST COMPLETE      03365700
*                                 STATUS (on ENQ request only)     @P6C 03369000
QWBHRMC  EQU   X'40'              INDICATES RESET MUST COMPLETE STATUS  03372300
*                                 (on DEQ or purge request only)   @P6C 03375600
QWBHMTDQ EQU   X'20'              MASID-target DEQ.  A QEL was          03378900
*                                 DEQ-ed while it is the target         03382200
*                                 of another QEL that has a             03385500
*                                 non-zero QELMASID.               @P6P 03388800
QWBHSPST EQU   X'10'              INDICATES SPOST IS NECESSARY          03392100
QWBHINT  EQU   X'08'              INDICATES AN INTERNALLY GENERATED     03400900
*                                 ENQ/DEQ/RESERVE REQUEST. THE          03409700
*                                 REQUESTOR WILL NOT BE POSTED.         03414100
QWBHLNGW EQU   X'04'              NOTIFY WAIT THIS IS LONG WAIT         03418500
QWBHPC   EQU   X'02'              PC HAS BEEN ISSUED                    03422900
QWBHPURG EQU   X'01'              INDICATES ISGGDEQP HAS PURGED THIS    03427300
*                                 QWB. THIS IS NOTIFICATION TO ISGGNQDQ 03431700
*                                 THAT THE DIRECTED ENQ/DEQ REQUESTER   03436100
*                                 SHOULD BE ABEND'D.                    03440500
*                                                                       03444900
* THE FOLLOWING FLAGS ARE INITIALIZED IN THE QWA (QWAFLAG2) BY          03453700
* THE ENQ/DEQ/RESERVE MAINLINE ROUTINE. WHEN A GLOBAL RESOURCE          03462500
* IS REQUESTED, THE FLAGS ARE MOVED TO THE QWB HEADER (QWBHFLG2).       03471300
* THEREFORE THE BIT DEFINITION OF QWAFLAG2 MUST MATCH THE BIT           03480100
* DEFINITIONS OF QWBHFLG2.                                              03488900
*                                                                       03497700
QWBHFLG2 DS    B                  QWB STATUS FLAG                       03506500
QWBHMIXR EQU   X'80'              MIXED RESOURCE REQUEST                03515300
QWBHFA   EQU   X'40'              REQUESTING TASK WAS ABENDING WHEN     03524100
*                                 THE REQUEST WAS RECEIVED              03532900
QWBHAUTH EQU   X'20'              REQUESTOR IS AUTHORIZED               03541700
QWBHGLBL EQU   X'10'              GLOBAL RESOURCES DEFINED IN THIS      03550500
*                                 QWB                                   03559300
QWBHECBF EQU   X'08'              ECB SPECIFIED                         03568100
QWAHSV56 EQU   X'04'              ENQ/RESERVE REQUEST                   03575100
QWBHABMC EQU   X'02'              THE TASK OR ADDRESS SPACE HAS         03578600
*                                 TERMINATED IN MC - CHAIN MRB TO       03582100
*                                 QWAMRBQ.                              03585600
QWBHSYCC EQU   X'01'              SYNCHRONIZATION COMPLETE              03589100
QWBHGRES DS    H                  FOR ENQ REQUESTS, THE NUMBER     @L1A 03590100
*                                 OF GLOBAL RESOURCES FOR WHICH         03591100
*                                 NO QEL HAS BEEN PLACED IN QUEUE.      03592100
*                                 FOR DEQ REQUEST, THE NUMBER OF        03593100
*                                 GLOBAL RESOURCES FOR WHICH A QEL HAS  03594100
*                                 BEEN REMOVED FROM QUEUE               03595100
QWBHECB  DS    A                  ADDRESS OF INPUT ECB                  03596100
         ORG   QWBHECB                                             @01A 03596400
QWBHSEQA DS    A                  Address of the specific ENQ request   03596700
*                                 QWB to be DEQed.  Set when QWBHDENQ   03597000
*                                 is '11'b.                        @01A 03597300
QWBHTCB  DS    A                  ADDRESS OF REQUESTOR-S (OR DIRECTED)  03597800
*                                 TCB                                   03599500
QWBHRB   DS    A                  ADDRESS OF WAITING RB                 03601200
QWBHQXB  DS    A                  CONTAINS THE ADDRESS OF               03601800
*                                 A LOCAL QXB WHEN A MIXED RESOURCE     03603300
*                                 REQUEST IS PRESENT (SAVED BY          03604900
*                                 MAINLINE ENQ PRIOR TO SUSPENSION)     03605700
*                                 OR CONTAINS THE ADDRESS OF A          03606500
*                                 GLOBAL QXB WHEN ALL GLOBALS ARE       03607300
*                                 PRESENT (SAVED BY THE GRP). @ZMB0300  03608900
*                                                                       03610500
* THE FOLLOWING FLAGS ARE USED BY THE GRP TO ROUTE CONTROL TO           03612100
* THE APPROPRIATE GLOBAL PROCESSING ROUTINE AND BY ISGGNQDQ TO     @L2C 03617900
* DETERMINE WHETHER A QWBX IS PRESENT.                             @L2A 03623700
*                                                                       03629700
QWBHFLG3 DS    B                  QWB REQUEST FLAGS                     03638500
QWBHENQ  EQU   X'80'              ENQ/RESERVE REQUEST                   03650000
QWBHDEQ  EQU   X'40'              DEQ REQUEST                           03700000
QWBHDENQ EQU   X'C0'              DEQ a specific ENQ request       @01A 03725000
QWBHDTCB EQU   X'20'              DEQ BY TCB                            03750000
QWBHDAS  EQU   X'10'              DEQ BY ASID                           03800000
QWBHDSYS EQU   X'08'              DEQ BY SYSID                          03850000
QWBHSYNC EQU   X'04'              SYNCHRONIZATION REQUEST               03900000
QWBHXTNP EQU   X'02'              EXTENSION-PRESENT FLAG.  IF 1,   @L2C 03910000
*                                 THIS QWB HAS A QWBX THAT         @L2C 03920000
*                                 HAS ADDITIONAL INFORMATION       @L2A 03930000
*                                 THAT DOES NOT FIT IN THE QWBH    @L2A 03945000
*                                 THIS BIT IS CLEARED IF THE QWB IS@P2A 03945800
*                                 PFR-COMPRESSES AND SENT TO       @P2A 03946600
*                                 ANOTHER SYSTEM.  QWBHXTNP MAY BE @P2A 03947400
*                                 1 IN THE ORIGINATING SYSTEM AND  @P2A 03948200
*                                 0 IN THE QWB OF A RECEIVING      @P2A 03949000
*                                 SYSTEM.  NOTE THAT THE QWBX IS   @P2A 03949800
*                                 DROPPED IF QWBHXTNP IS CHANGED   @P2A 03950600
*                                 TO 0.                            @P2A 03951400
QWBHECBZ EQU   X'01'              ECB-ZERO FLAG.  IF 1, FLAG       @P1A 03952200
*                                 QWA6ECBZ WAS ON WHEN THIS QWB    @P1A 03959400
*                                 WAS PLACED ON THE REQUEST QUEUE. @P1A 03966600
QWBHNWPS DS    AL1                NUMBER OF 4-BYTE WORDS IN        @L2A 03973800
*                                 PEL/PELX SECTION THAT BEGINS     @L2A 03987300
*                                 AT QWBPEL.  THIS BYTE MAY BE SET @P2C 03989500
*                                 TO 0 IF THE QWB IS PFT-COMPRESSED@P2A 03991700
*                                 AND SENT TO ANOTHER SYSTEM.      @P2C 03993900
*                                 QWBHNWPS MAY BE NON-0 IN THE     @P2C 03996100
*                                 ORIGINATING SYSTEM AND 0 IN THE  @P2C 03998300
*                                 QWB OF THE RECEIVING SYSTEM.     @P2C 04000500
*                                 NOTE THAT THE QWBX IS DROPPED IF @P2C 04002700
*                                 QWBHXTNP IS CHANGED TO 0.        @P2C 04004900
         ORG   QWBHNWPS                                        @YA13087 04007100
QWBDRCDE DS    CL1                Reason code indicating why the QWB    04009300
*                                 was put on the damaged chain.@YA13087 04011500
QWBHRSV1 DS    CL2                RESERVED                         @L2C 04014300
QWBDCLK  DS    CL8                Clock Value when this QWB was         04017600
*                                 put on the damaged chain.    @YA13087 04020900
         ORG   QWBDCLK                                         @YA13087 04024200
QWBHSTL  DS    A                  ADDRESS OF THE REQUEST QWB(S).        04027800
*                                 VALID ONLY WHEN QWBHSYNC=1 AND/OR     04033200
*                                 QWBHMIXR=1 AND QWBHFA=1               04038600
*                                                                       04044000
         ORG   QWBHSTL                                                  04049400
QWBHTCBA DS    A                  DEQ ARGUMENT TCB - VALID ONLY IF THIS 04054800
*                                 IS A TCB DEQ QWB                      04060200
QWBHTRGT DS    F                  DEQ PURGE TARGET                      04065600
         ORG   QWBHTRGT                                                 04068300
QWBHDASY DS    H                  DEQ ARGUMENT SYSID - VALID ONLY       04071000
*                                 IF THIS IS A SYSID, ASID OR TCB       04075300
*                                 DEQ QWB                               04079600
QWBHDAAS DS    H                  DEQ ARGUMENT ASID - VALID ONLY        04083900
*                                 IF THIS IS AN ASID OR TCB DEQ QWB.    04088200
QWBHRSA2 DS    CL16               SECOND REQUEST SAVE AREA              04089600
         ORG   QWBHRSA2                                                 04091000
QWBHJBNM DS    CL8                JOBNAME/USERID OF REQUESTOR           04092600
QWBHORIG DS    F                                                        04093200
         ORG   QWBHORIG           ORIGIN (SYSID/ASID) OF REQUESTOR      04093800
QWBHSYID DS    H                  SYSID OF REQUESTOR                    04094600
QWBHASID DS    H                  ASID OF REQUESTOR                     04096600
QWBHASCB DS    A                  IF ENQ/DEQ/RESERVE ASCB ADDRESS OF    04096900
*                                 REQUESTOR. NOTE THAT IF THE HIGH-     04097100
*                                 ORDER BIT IS SET, AN ISGQSCAN         04097300
*                                 INFORMATION ROUTINE EXISTS FOR THE    04097500
*                                 ADDRESS SPACE. IF A PURGE REQUEST,    04097700
*                                 ASCB ADDRESS OF TARGET ASCB. VALID    04097900
*                                 ONLY ON ORIGINATING SYSTEM            04098100
*                                                                       04098400
*        SMPL SECTION                                                   04098700
*                                                                       04109300
QWBSMPL  DS    6CL16              DEFINES THE STORAGE TO SUPPORT THE    04120000
*                                 QWB, QXB, QEL AND THE 3 QCB SIZES     04162500
*                                 AS SMPL ENTRIES. NOTE IF QWBHMIXR=1   04205000
*                                 AND QWBHFA=1, THE SMPL CONTAINS       04247500
*                                 ENTRIES FOR LOCAL AND GLOBAL CONTROL  04290000
*                                 BLOCKS (THIS AREA IS EXPANDED BY      04332500
*                                 ISGGNQDQ)                             04375000
         ORG   QWBSMPL                                                  04376300
QWBSQWB  DS    CL16               SMPL QWB ENTRY                        04377600
QWBSQXB  DS    CL16               SMPL QXB ENTRY                        04378900
QWBSQEL  DS    CL16               SMPL QEL ENTRY                        04380200
QWBSQCB1 DS    CL16               SMPL QCB SIZE1 ENTRY                  04381500
QWBSQCB2 DS    CL16               SMPL QCB SIZE2 ENTRY                  04382800
QWBSQCB3 DS    CL16               SMPL QCB SIZE3 ENTRY                  04384100
QWBSMPLN EQU   X'06'              NUMBER OF SMPL ENTRIES IN THE QWB     04384800
*                                                                       04385600
*        BASIC SECTION                                                  04396200
*                                                                       04406800
QWBBASIC DS    CL308              QWB BASIC SECTION - COMMON TO BOTH    04433400
*                                 A QWB AND A QWB EXTENSION. IF         04460000
*                                 DEFINED AS A QWB EXTENSION, THIS      04468500
*                                 AREA MAPS TO THE BEGINNING OF THE     04477000
*                                 QWB (I.E., QWBHDR - THE HEADER        04485500
*                                 AND SMPL DO NOT EXIST IN A QWB        04491100
*                                 EXTENSION).                      @L4C 04496800
         ORG   QWBBASIC                                                 04502500
QWBEXTA  DS    A                  ADDRESS OF QWB EXTENSION (I.E., NEXT  04545000
*                                 BASIC SECTION DESCRIBING THIS         04587500
*                                 REQUEST)                              04630000
QWBPEL   DS    CL304              Area containing PELs for this         04632000
*                                 request. This must be large           04634000
*                                 enough to contain the biggest         04636000
*                                 possible PEL/PELX pair (ie,           04638000
*                                 one with a 255-byte RNAME). Note that 04640000
*                                 the PEL prefix is not included in     04642000
*                                 this field.                      @L4C 04644000
QWBBEND  DS    0D                 END OF QWBBASIC section          @L4C 04646000
*                                                                       04648000
**********************************************************************  04650000
*                                                                       04652000
*       QWB tail mapping. Uses the extra forty bytes available          04654000
*       at the end of the QWB that were previously wasted.              04656000
*       (ie, even with the extra forty bytes, eight QWBs still          04658000
*       fit in one PEXB).                                               04660000
*                                                                       04662000
**********************************************************************  04664000
         ORG   QWBBEND                                                  04666000
QWBTAIL  DS    CL40               Maps the QWB tail section - exists    04668000
*                                 only in a Head-QWB in GRS             04670000
*                                 private storage. Never copied         04672000
*                                 to the QWA or RSA or anywhere         04674000
*                                 else.                            @L4A 04676000
         ORG   QWBTAIL                                                  04678000
QWBRACE  DS    F                  Fullword containing information       04680000
*                                 related to the race that              04682000
*                                 occurs when a requestor can           04684000
*                                 be POSTed before global               04686000
*                                 processing completes             @L4A 04688000
         ORG   QWBRACE                                                  04690000
QWBRFLGS DS    B                  Race flags. All flags in this byte    04692000
*                                 are set via Compare and Swap.    @L4A 04694000
QWBRPOST EQU   X'80'              Requestor POSTed flag. When 1,        04696000
*                                 requestors SVRB has been POSTed, and  04698000
*                                 should not be POSTed again.      @L4A 04700000
QWBRSEEN EQU   X'40'              QWB seen flag. When 1, this QWB has   04702000
*                                 been seen by global processing, and   04704000
*                                 can be freed by the requestor, or has 04706000
*                                 been seen by the requestor and can    04708000
*                                 be freed by global processing.   @L4A 04710000
QWBTRSV1 DS    CL3                Reserved.                        @L4A 04712000
QWBSTAR  DS    CL24               Fields used only in GRS=STAR          04714000
*                                 mode (and for which no assembler      04716000
*                                 equivalents are needed)          @P7C 04718000
QWBTRSV2 DS    CL12               Reserved.                        @P7C 04720000
QWBEND   DS    0D                 END OF QWB                       @L4M 04722000
**********************************************************************  04724000
*                                                                       04726000
*       QWB Extension mapping                                           04728000
*                                                                       04730000
**********************************************************************  04732000
QWBE     DSECT                                                     @L4A 04734000
         DS    0D                 Maps a QWB extension. Pointed to      04736000
*                                 by QWBEXTA in a 'head-QWB' and        04738000
*                                 QWBEEXTA in another QWB-extension     04740000
*                                                                  @L4A 04742000
QWBEBASC DS    CL464              Basic section of QWB-extension   @L4A 04744000
         ORG   QWBEBASC                                                 04746000
QWBEEXTA DS    A                  Address of next QWB-extension    @L4A 04748000
QWBEPEL  DS    CL460              Holds array of PEL and PELX           04750000
*                                 information                      @L4A 04752000
QWBEBEND DS    0D                 End of QWBEBASC section          @L4A 04754000
QWBERSV1 DS    CL40               Reserved.                        @L4A 04756000
*                                                                       04758000
**********************************************************************  04760000
*                                                                       04762000
*       QWB-Header Extension mapping                                    04764000
*                                                                       04766000
**********************************************************************  04768000
QWBX     DSECT                                                     @L2A 04771000
         DS    0D                 QUEUE WORK BLOCK EXTENSION.      @L2A 04773900
*                                 OCCUPIES SPACE MAPPED BY THE     @L2A 04776800
*                                 QWB, IN THE FIRST QWB OF THE     @L2A 04779700
*                                 REQUEST.  IT IS PRESENT ONLY IF  @L2A 04782600
*                                 FLAG QWBHXTNP IS ON.  IT FOLLOWS @L2A 04785500
*                                 THE PELX(S) OF THE FIRST QWB.    @L2A 04788400
*                                 THIS SECTION MAY BE DROPPED IN A @P2A 04788500
*                                 RECEIVING SYSTEM IF THE QWB IS   @P2A 04788600
*                                 PFT-COMPRESSED INTO A QNP ON THE @P2A 04788700
*                                 ORIGINATING SYSTEM AND THEN      @P2A 04788800
*                                 RE-EXPANDED FROM A QNP TO A QWB  @P2A 04788900
*                                 ON A RECEIVING SYSTEM.  PFT-     @P2A 04789000
*                                 COMPRESSION DROPS THE QWBX.      @P2A 04789100
QWBXR3LN DS    AL1                LENGTH OF DATA IN QWBXRSA3.      @L2A 04789300
QWBXRSV3 DS    CL7                RESERVED.                        @L2A 04790200
QWBXRSA3 DS    CL24               SPACE ALLOWED FOR SECTION        @L2A 04791300
*                                 QWANWPEL OF THE QWA.  THIS FIELD @L2A 04791900
*                                 CAN BE EXPANDED IF FIELDS ARE    @L2A 04792500
*                                 ADDED TO QWA FIELD QWANWPEL,     @L2A 04793100
*                                 BECAUSE QWBXR3LN DEFINES THE     @L2A 04793700
*                                 LENGTH OF DATA THAT WAS PLACED   @L2A 04794300
*                                 IN THIS FIELD.  QWBXR3LN IS SET  @L2A 04794900
*                                 BY THE SYSTEM THAT PLACES DATA   @L2A 04795500
*                                 IN THIS FIELD.                   @L2A 04796100
QWBXEND  DS    0D                 END OF QWBX.                     @L2A 04797100
* ********************************************************************  04797300
* *                                                                  *  04797500
* *  REASON CODES FOR QWB'S ON THE DAMAGED CHAIN (QWBDRCDE)  @YA13087*  04797700
* *                                                                  *  04797900
* ********************************************************************  04798100
QWBDSYID EQU    4                 DAMAGED REASON CODE FOR      @YA13087 04798300
*                                 WHEN THE SYSID FOR THE QWB   @YA13087 04798500
*                                 (QWBHSYID) IS NOT DEFINED    @YA13087 04798700
*                                 IN THE COMPLEX               @YA13087 04798900
QWB_kSQALength EQU 4096           Length of SQA QWB                @02A 04799400
         MEND                                                           04800000
*                                                                    */ 04850000
*%PLSQWB1: ;                                                            04900000
* DCL 1 QWB BASED(QWBPTR) BDY(DWORD), /* QUEUE WORK BLOCK            */ 04950000
*       3 QWBHDR CHAR(60) BDY(DWORD), /* QWB HEADER                  */ 05000000
*         5 QWBHNQWB PTR(31),        /* ADDRESS OF NEXT QWB          */ 05013900
*         5 QWBHRSA  CHAR(28) BDY(WORD),  /* QWB REQUEST SAVE AREA -    05027800
*                                            THIS AREA MAPS TO THE      05041700
*                                            QWARSA                  */ 05055600
*           7 QWBHMRBQ PTR(31),      /* POINTER TO FIRST MRB IN         05069500
*                                       MESSAGE QUEUE. USED BY THE      05083400
*                                       GRP TO RETURN PURGE MESSAGES    05097300
*                                       TO REQUESTOR.                */ 05111200
*             9 QWBHNSYN PTR(31),    /* ADDRESS OF NEXT STEAL           05114700
*                                       SYNCHRONIZATION QWB ON THE      05118200
*                                       ASCB SYNC QUEUE              */ 05121700
*               11 QWBI4PCT CHAR(1), /* PFT-COMPRESSION INDICATOR       05122900
*                                                                @P3A*/ 05124100
*               11 *        CHAR(3), /* RESERVED                 @P4A*/ 05124800
*           7 QWBHERR  FIXED(8),     /* FIRST DIGIT OF ABEND CODE    */ 05125500
*           7 QWBHMFGS BIT(8),       /* MISC FLAG BITS. Serialized      05127700
*                                       with the GRS local lock. @L3C*/ 05129900
*             9 QWBHFFDM  BIT(1),    /* FAST-DEQ-MARK-FLAG.  WHEN 1,    05132100
*                                       QWB WAS USED BY THE FAST-DEQ    05135400
*                                       SRB-ROUTINE WHICH SET QELFDTRY  05138700
*                                       ON                       @L3A*/ 05142000
*             9 *         BIT(7),    /* RESERVED                 @L4C*/ 05157000
*           7 QWBHPFLG FIXED(16),    /* SAVED PEL FLAGS (QWAPLAST       05172000
*                                       AND QWAPFLAG) OR COUNT OF       05174100
*                                       GLOBAL RESOURCES REQUESTED.  */ 05176200
*             9 QWBHGLBR FIXED(16),  /* COUNT OF GLOBAL RESOURCES       05178500
*                                       REQUESTED. VALID ONLY WHEN      05179200
*                                       QWBHSYNC=1.                  */ 05179900
*               11 QWBHPFL1 FIXED(8), /* PELLAST FLAG BYTE           */ 05180200
*               11 QWBHPFL2 FIXED(8), /* PELFLAG FLAG BYTE           */ 05180500
*/*                                                                  */ 05180900
*/* THE FOLLOWING FLAGS ARE ACCUMULATED IN THE QWA (QWAFLAG1) BY     */ 05194200
*/* THE ENQ/DEQ/RESERVE MAINLINE ROUTINE. WHEN A GLOBAL RESOURCE     */ 05207500
*/* REQUEST IS PROCESSED FROM THE GRP  QWAFLAG1 IS MOVED TO          */ 05220800
*/* QWBHFLG1. THE FLAGS ARE SUBSEQUENTLY MOVED BACK TO THE QWA       */ 05234100
*/* AFTER THE ENQ/DEQ/RESERVE SVRB IS POST'D BY THE GRP. THEREFORE   */ 05247400
*/* THE BIT DEFINITIONS OF QWBHFLG1 MUST MATCH THE BIT DEFINITIONS   */ 05260700
*/* OF QWAFLAG1                                                      */ 05274000
*/*                                                                  */ 05287300
*           7 QWBHFLG1 BIT(8),       /* QWB PROCESS FLAGS            */ 05300600
*             9 QWBHSTLC BIT(1),     /* STEAL PROCESSING IS NOW         05314600
*                                       COMPLETE, I.E., DEQ QWB(S)      05330900
*                                       HAVE BEEN PLACED ON THE REQUEST 05347200
*                                       QUEUE IF NECESSARY           */ 05363500
*             9 QWBHSMC  BIT(1),     /* INDICATES SET STEP MUST         05379800
*                                       COMPLETE STATUS (on ENQ         05386300
*                                       request only)            @P6C*/ 05392800
*               11 QWBHRMC  BIT(1),  /* INDICATES RESET MUST COMPLETE   05399300
*                                       STATUS (on DEQ or purge request 05405800
*                                       only)                    @P6C*/ 05412300
*             9 QWBHMTDQ BIT(1),     /* MASID-target DEQ.  A QEL was    05418800
*                                       DEQ-ed while it is the target   05425300
*                                       of another QEL that has a       05431800
*                                       non-zero QELMASID.       @P6P*/ 05438300
*             9 QWBHSPST BIT(1),     /* INDICATES SPOST IS NECESSARY */ 05445000
*             9 QWBHINT  BIT(1),     /* INDICATES AN INTERNALLY         05461600
*                                       GENERATED ENQ/DEQ/RESERVE       05476300
*                                       REQUEST. THE REQUESTOR WILL     05481200
*                                       NOT BE POSTED.               */ 05486100
*             9 QWBHLNGW BIT(1),     /* NOTIFY WAIT THIS IS LONG WAIT*/ 05491000
*             9 QWBHPC   BIT(1),     /* PC HAS BEEN ISSUED           */ 05505600
*             9 QWBHPURG BIT(1),     /* INDICATES ISGGDEQP HAS PURGED   05506800
*                                       THIS QWB. THIS IS NOTIFICATION  05508000
*                                       TO ISGGNQDQ THAT THE DIRECTED   05509200
*                                       ENQ/DEQ REQUESTOR SHOULD BE     05510400
*                                       ABEND'D.                     */ 05511600
*/*                                                                  */ 05512900
*/* THE FOLLOWING FLAGS ARE INITIALIZED IN THE QWA (QWAFLAG2) BY     */ 05859600
*/* THE ENQ/DEQ/RESERVE MAINLINE ROUTINE. WHEN A GLOBAL RESOURCE     */ 05862800
*/* IS REQUESTED, THE FLAGS ARE MOVED TO THE QWB HEADER (QWBHFLG2).  */ 05866000
*/* THEREFORE THE BIT DEFINITIONS OF QWAFLAG2 MUST MATCH THE BIT     */ 05869200
*/* DEFINITIONS OF QWBHFLG2.                                         */ 05872400
*/*                                                                  */ 05875600
*           7 QWBHFLG2  BIT(8),      /* QWB STATUS FLAGS             */ 05878800
*             9 QWBHMIXR BIT(1),     /* MIXED RESOURCE REQUEST       */ 05882000
*             9 QWBHFA   BIT(1),     /* REQUESTING TASK WAS ABENDING    05885200
*                                       WHEN THE REQUEST WAS RECEIVED*/ 05888400
*             9 QWBHAUTH BIT(1),     /* REQUESTOR IS AUTHORIZED      */ 05891600
*             9 QWBHGLBL BIT(1),     /* GLOBAL RESOURCES DEFINED IN     05894800
*                                       THIS QWB                     */ 05898000
*             9 QWBHECBF BIT(1),     /* ECB SPECIFIED                */ 05901200
*             9 QWBHSV56 BIT(1),     /* ENQ/RESERVE REQUEST          */ 05902100
*             9 QWBHABMC BIT(1),     /* THE TASK OR ADDRESS SPACE       05902400
*                                       TERMINATED IN MC - CHAIN MRB    05902700
*                                       TO QWAMRBQ.                  */ 05903000
*             9 QWBHSYCC BIT(1),     /* SYNCHRONIZATION COMPLETE     */ 05903300
*          7 QWBHGRES FIXED(16),     /* FOR ENQ REQUESTS, THE           05903400
*                                       NUMBER OF GLOBAL RESOURCES      05903500
*                                       FOR WHICH NO QEL HAS BEEN       05903600
*                                       PLACED IN QUEUE. FOR DEQ        05903700
*                                       REQUEST, THE NUMBER OF GLOBAL   05903800
*                                       RESOURCES FOR WHICH A QEL HAS   05903900
*                                       BEEN REMOVED FROM QUEUE  @L1A*/ 05904000
*           7 QWBHECBA PTR(31),      /* ADDRESS OF INPUT ECB         */ 05904100
*             9 QWBHSEQA ptr(31),    /* Address of the specific ENQ     05904200
*                                       request QWB to be DEQed.  Set   05904300
*                                       when QWBHDENQ is '11'b.  @01A*/ 05904400
*           7 QWBHTCB  PTR(31),      /* ADDRESS OF REQUESTOR-S (OR      05904500
*                                       DIRECTED) TCB                */ 05904600
*           7 QWBHRB   PTR(31),      /* ADDRESS OF WAITING RB        */ 05904700
*           7 QWBHQXB  PTR(31),      /* CONTAINS THE ADDRESS OF         05904800
*                                       A LOCAL QXB WHEN A MIXED        05904900
*                                       RESOURCE REQUEST IS PRESENT     05905000
*                                       (SAVED BY MAINLINE ENQ PRIOR    05905100
*                                       TO SUSPENSION) OR CONTAINS      05905200
*                                       THE ADDRESS OF A GLOBAL QXB     05905300
*                                       WHEN ALL GLOBALS ARE PRESENT    05905400
*                                       (SAVED BY THE GRP).          */ 05905600
*/*                                                                  */ 05905800
*/* THE FOLLOWING FLAGS ARE USED BY THE GRP TO ROUTE CONTROL         */ 05905900
*/* TO THE APPROPRIATE GLOBAL PROCESSING ROUTINE AND BY ISGGNQDQ @L2C*/ 05906400
*/* TO DETERMINE WHETHER A QWBX IS PRESENT.                      @L2A*/ 05906900
*/*                                                                  */ 05907500
*         5 QWBHFLG3 BIT(8),         /* QWB REQUEST FLAGS            */ 05908400
*           7 QWBHDENQ bit(2),       /* When both bits are on, this     05912200
*                                       is a DEQ of a specific ENQ      05916000
*                                       request                  @01A*/ 05919800
*             9 QWBHENQ  BIT(1),     /* ENQ/RESERVE REQUEST      @01C*/ 05923600
*             9 QWBHDEQ  BIT(1),     /* DEQ REQUEST              @01C*/ 05927400
*           7 QWBHDTCB BIT(1),       /* DEQ BY TCB                   */ 05931500
*           7 QWBHDAS  BIT(1),       /* DEQ BY ASID                  */ 05939200
*           7 QWBHDSYS BIT(1),       /* DEQ BY SYSID                 */ 05946900
*           7 QWBHSYNC BIT(1),       /* SYNCHRONIZATION REQUEST      */ 05954600
*           7 QWBHXTNP BIT(1),       /* IF 1, THIS QWB HAS A QWBX       05957600
*                                       THAT HAS ADDITIONAL             05960600
*                                       INFORMATION THAT DOES NOT       05963600
*                                       FIT IN THE QWBH.  THIS BIT MAY  05964000
*                                       BE CLEARED IF THE QWB IS PFT-   05964400
*                                       COMPRESSED AND SENT TO ANOTHER  05964800
*                                       SYSTEM.  QWBHXTNP MAY BE 1 IN   05965200
*                                       THE ORIGINATING SYSTEM AND 0 IN 05965600
*                                       THE QWB OF A RECEIVING SYSTEM.  05966000
*                                       NOTE THAT THE QWBX IS DROPPED   05966400
*                                       IF QWBHXTNP IS CHANGED TO 0.    05966800
*                                                                @P2C*/ 05967200
*           7 QWBHECBZ BIT(1),       /* ECB-ZERO FLAG.  IF 1, FLAG      05968000
*                                       QWA6ECBZ WAS ON WHEN THIS       05969400
*                                       QWB WAS PLACED ON THE           05970800
*                                       REQUEST QUEUE.           @P1A*/ 05972200
*         5 QWBHNWPS PTR(8),         /* NUMBER OF 4-BYTE WORDS IN       05973800
*                                       PEL/PELX SECTION THAT BEGINS    05977600
*                                       AT QWBPEL.  THIS BYTE MAY BE    05978100
*                                       SET TO ZERO IF THE QWB IS PFT-  05978600
*                                       COMPRESSED AND SENT TO ANOTHER  05979100
*                                       SYSTEM.  QWBHNWPS MAY BE NON-   05979600
*                                       ZERO IN THE ORIGINATING         05980100
*                                       SYSTEM AND 0 IN THE QWB OF A    05980600
*                                       RECEIVING SYSTEM.  NOTE THAT    05981100
*                                       THE QWBX IS DROPPED IF          05981600
*                                       QWBHXTNP IS CHANGED TO 0. @P2C*/05982100
*           7 QWBDRCDE FIXED(8),     /* Reason code indicating why this 05982600
*                                       QWB was put on the damaged      05983100
*                                       chain.               @YA13087*/ 05983600
*         5 QWBHRSV1 CHAR(2),        /* RESERVED                 @L2C*/ 05985200
*         5 QWBDCLK CHAR(8) BDY(WORD),/* Clock Value when this QWB was  05987900
*                                       put on the damaged chain.       05990600
*                                                            @YA13087*/ 05993300
*           7 QWBHSTL PTR(31),       /* ADDRESS OF THE REQUEST QWB(S)   05996000
*                                       VALID ONLY WHEN QWBHSYNC=1      05999000
*                                       AND/OR QWBHMIXR=1 AND           06008800
*                                       QWBHFA=1.                    */ 06018600
*             9 QWBHTCBA PTR(31),    /* DEQ ARGUMENT TCB - VALID ONLY   06028400
*                                       IF THIS IS A TCB DEQ QWB.    */ 06038500
*           7 QWBHTRGT FIXED(32),    /* DEQ PURGE TARGET             */ 06046200
*             9 QWBHDASY FIXED(16),  /* DEQ ARGUMENT SYSID - VALID      06053900
*                                       ONLY IF THIS IS A SYSID,        06061600
*                                       ASID OR TCB DEQ QWB          */ 06069300
*             9 QWBHDAAS FIXED(16),  /* DEQ ARGUMENT ASID - VALID ONLY  06077000
*                                       IF THIS IS AN ASID OR TCB DEQ   06084700
*                                       QWB.                         */ 06092400
*         5 QWBHRSA2 CHAR(16) BDY(WORD), /* SECOND REQUEST SAVE AREA */ 06100100
*           7 QWBHJBNM CHAR(8) BDY(WORD), /* JOBNAME/USERID OF          06108600
*                                          REQUESTOR                 */ 06112500
*           7 QWBHORIG FIXED(32),       /* ORIGIN OF REQUESTOR       */ 06116400
*             9 QWBHSYID FIXED(16),     /* SYSID OF REQUESTOR        */ 06120300
*             9 QWBHASID FIXED(16),     /* ASID OF REQUESTOR         */ 06124200
*           7 QWBHASCB PTR(31),         /* IF ENQ/DEQ/RESERVE, ASCB     06126600
*                                          ADDRESS OF REQUESTOR. NOTE   06127100
*                                          THAT IF THE HIGH-ORDER BIT IS06127600
*                                          SET, AN ISGQSCAN INFORMATION 06128100
*                                          ROUTINE EXISTS FOR THE       06128600
*                                          ADDRESS SPACE. IF PURGE      06129100
*                                          REQUEST, ASCB ADDRESS OF     06129600
*                                          TARGET ASCB. VALID ONLY ON   06130100
*                                          ORIGINATING SYSTEM        */ 06130600
*/*                                                                  */ 06131100
*/*     SMPL SECTION                                                 */ 06131700
*/*                                                                  */ 06132300
*       3 QWBSMPL BDY(WORD),         /* DEFINES THE STORAGE             06133200
*                                       REQUIRED TO SUPPORT THE QWB,    06150000
*                                       QXB, QEL AND THE 3 QCB SIZES    06200000
*                                       AS SMPL ENTRIES. NOTE IF        06250000
*                                       QWBHMIXR=1 AND QWBHFA=1, THE    06300000
*                                       SMPL CONTAINS ENTRIES FOR       06350000
*                                       LOCAL AND GLOBAL CONTROL        06400000
*                                       BLOCKS (THIS AREA IS EXPANDED   06450000
*                                       BY ISGGNQDQ).                */ 06500000
*         5 QWBSQWB  CHAR(16) BDY(WORD), /* SMPL QWB ENTRY           */ 06507100
*         5 QWBSQXB  CHAR(16) BDY(WORD), /* SMPL QXB ENTRY           */ 06514200
*         5 QWBSQEL  CHAR(16) BDY(WORD), /* SMPL QEL ENTRY           */ 06521300
*         5 QWBSQCB1 CHAR(16) BDY(WORD), /* SMPL QCB SIZE1 ENTRY     */ 06528400
*         5 QWBSQCB2 CHAR(16) BDY(WORD), /* SMPL QCB SIZE2 ENTRY     */ 06535500
*         5 QWBSQCB3 CHAR(16) BDY(WORD), /* SMPL QCB SIZE3 ENTRY     */ 06542600
*       3 QWBBASIC CHAR(308) BDY(WORD),    /* QWB BASIC SECTION -       06550000
*                                       COMMON TO BOTH A QWB AND A      06600000
*                                       QWB EXTENSION. IF DEFINED AS    06650000
*                                       A QWB EXTENSION, THIS AREA      06700000
*                                       MAPS TO THE BEGINNING OF THE    06750000
*                                       QWB (I.E., QWBHDR - THE         06800000
*                                       HEADER AND SMPL DO NOT          06850000
*                                       EXIST IN A QWB EXTENSION).      06900000
*                                                            @ZMB0308*/ 06940000
*         5 QWBEXTA PTR(31),         /* ADDRESS OF QWB EXTENSION (I.E., 06980000
*                                       NEXT BASIC SECTION DESCRIBING   07020000
*                                       THIS REQUEST)                */ 07060000
*         5 QWBPEL  CHAR(304),       /* Area containing PELs for this   07063700
*                                       request. This must be large     07067400
*                                       enough to contain the biggest   07071100
*                                       possible PEL/PELX pair (ie,     07074800
*                                       one with a 255-byte RNAME).     07078500
*                                       Note that the PEL prefix is     07082200
*                                       not included in this field.     07085900
*                                                                @L4C*/ 07089600
*         5 QWBBEND CHAR(0),         /* END OF QWBBASIC          @L4C*/ 07093300
*                                                                       07097000
*/********************************************************************/ 07100700
*/*                                                                  */ 07104400
*/*     QWB tail mapping. Uses the extra forty bytes available       */ 07108100
*/*     at the end of the QWB that were previously wasted.           */ 07111800
*/*     (ie, even with the extra forty bytes, eight QWBs still       */ 07115500
*/*     fit in one PEXB).                                            */ 07119200
*/*                                                                  */ 07122900
*/*********************************************************************/07126600
*       3 QWBTAIL CHAR(40) BDY(DWORD),  /* Maps the                     07130300
*                                       QWB tail section - exists       07134000
*                                       only in a Head-QWB in GRS       07137700
*                                       private storage. Never copied   07141400
*                                       to the QWA or RSA or            07145100
*                                       anywhere else            @L4A*/ 07148800
*         5 QWBRACE FIXED(32) BDY(WORD), /* Fullword containing         07152500
*                                       data related to the race that   07156200
*                                       occurs when a requestor can     07159900
*                                       be POSTed before global         07163600
*                                       processing completes     @L4A*/ 07167300
*           7 QWBRFLGS BIT(8),       /* Race flags. All flags in this   07171000
*                                       byte are set via Compare and    07174700
*                                       Swap                     @L4A*/ 07178400
*             9 QWBRPOST  BIT(1),    /* Requestor POSTed flag. When 1,  07182100
*                                       requestors SVRB has been        07185800
*                                       POSTed, and should not be       07189500
*                                       POSTed again.            @L4A*/ 07193200
*             9 QWBRSEEN  BIT(1),    /* QWB seen flag. When 1, this     07196900
*                                       QWB has been seen by global     07200600
*                                       processing, and can be freed    07204300
*                                       by the requestor, or has been   07208000
*                                       seen by the requestor and can   07211700
*                                       be freed by global processing   07215400
*                                                                @L4A*/ 07219100
*             9 *         BIT(6),    /* Reserved                 @L4A*/ 07222800
*           7 QWBTRSV1 CHAR(3),      /* Reserved                 @L4A*/ 07226500
*         5 QWBSTAR CHAR(24) BDY(WORD), /* Fields used only in GRS=STAR 07230200
*                                       mode                     @L7C*/ 07233900
*           7 QWB_QCBSAvailQ PTR(31),    /* Queue of QCB star mode      07237600
*                                       extensions, to be used with     07241300
*                                       the cells in QWBSMPL when       07245000
*                                       building a new QCB       @L4A*/ 07248700
*           7 QWB_QORECounts BDY(WORD), /* Counts used to keep track of 07252400
*                                       of QOREs generated for this     07256100
*                                       QWB                      @L4A*/ 07259800
*             9 QWB_Total#QOREs FIXED(32), /* The total number of QOREs 07263500
*                                       built for this QWB       @L4A*/ 07267200
*             9 QWB_QOREEntryCount FIXED(32), /* The number of QOREs    07270900
*                                       that have finished their        07274600
*                                       Entry processing         @L4A*/ 07278300
*             9 QWB_QORELockingCount FIXED(32), /* The number of QOREs  07282000
*                                       that have finished their        07285700
*                                       Locking processing       @L4A*/ 07289400
*             9 QWB_QORECompleteCount FIXED(32), /* The number of QOREs 07293100
*                                       that have finished their        07296800
*                                       Completion processing    @L4A*/ 07300500
*           7 QWB_SFlags BIT(8),     /* Flags used in star mode  @P7A*/ 07301500
*             9 QWB_Abend138 BIT(1), /* Non-zero return code present    07302500
*                                       in unconditional ENQ     @P7A*/ 07303500
*             9 * BIT(7),            /* Reserved                 @P7A*/ 07304500
*           7 * CHAR(3),             /* Reserved                 @P7A*/ 07305500
*         5 QWBTRSV2 CHAR(12),       /* Reserved                 @P7C*/ 07306500
*       3 QWBEND CHAR(0) BDY(DWORD); /* END OF QWB               @L4M*/ 07307900
*/********************************************************************/ 07311600
*/*                                                                  */ 07315300
*/*     QWB Extension mapping                                        */ 07319000
*/*                                                                  */ 07322700
*/********************************************************************/ 07326400
* DCL 1 QWBE BASED(QWBPTR) BDY(WORD),/* Maps a QWB extension. Pointed   07330100
*                                       to by QWBEXTA in a 'head-QWB',  07333800
*                                       and by QWBEEXTA in the          07337500
*                                       previous extension.      @L4A*/ 07341200
*       3 QWBEBASC,                  /* Basic section of QWB extension  07344900
*                                                                @L4A*/ 07348600
*         5 QWBEEXTA PTR(31),        /* Address of next QWB extension   07352300
*                                                                @L4A*/ 07356000
*         5 QWBEPEL  CHAR(460),      /* Holds array of PEL and PELX     07359700
*                                       information              @L4A*/ 07363400
*         5 QWBEBEND CHAR(0),        /* End of QWBEBASC          @L4A*/ 07367100
*       3 QWBERSV1 CHAR(40);         /* Reserved.                @L4A*/ 07370800
*                                                                       07374500
*/********************************************************************/ 07378200
*/*                                                                  */ 07381900
*/*     QWB-Header Extension mapping                                 */ 07385600
*/*                                                                  */ 07389300
*/********************************************************************/ 07393000
* DCL 1 QWBX BASED(QWBPTR) BDY(WORD),/* QUEUE WORK BLOCK EXTENSION.     07404100
*                                         OCCUPIES SPACE MAPPED BY      07408200
*                                         THE QWB, IN THE FIRST QWB     07412300
*                                         OF THE REQUEST.  IT IS        07416400
*                                         PRESENT ONLY IF FLAG          07420500
*                                         QWBHXTNP IS ON.  IT           07424600
*                                         FOLLOWS THE PELX(S) OF        07428700
*                                         THE FIRST QWB.  THIS SECTION  07429100
*                                         MAY BE DROPPED IN A RECEIVING 07429500
*                                         SYSTEM IF THE QWB IS PFT-     07429900
*                                         COMPRESSED INTO A QNP ON THE  07430300
*                                         ORIGINATING SYSTEM AND THEN   07430700
*                                         RE-EXPANDED FROM A QNP TO A   07431100
*                                         QWB ON A RECEIVING SYSTEM.    07431500
*                                         PFT-COMPRESSION DROPS THE     07431900
*                                         QWBX.                  @P2C*/ 07432300
*       3 QWBXR3LN FIXED(8),          /* LENGTH OF DATA IN              07433500
*                                         QWBXRSA3.              @L2A*/ 07434200
*       3 QWBXRSV3 CHAR(7),           /* RESERVED.               @L2A*/ 07434900
*       3 QWBXRSA3 CHAR(24) BDY(WORD),/* SPACE ALLOWED FOR              07435800
*                                         SECTION QWANWPEL OF           07438800
*                                         THE QWA.  THIS FIELD          07439400
*                                         CAN BE EXPANDED IF FIELDS     07440000
*                                         ARE ADDED TO QWA FIELD        07440600
*                                         QWANWPEL, BECAUSE QWBXR3LN    07441200
*                                         DEFINES THE LENGTH OF DATA    07441800
*                                         THAT WAS PLACED IN THIS       07442400
*                                         FIELD.  QWBXR3LN IS SET       07443000
*                                         BY THE SYSTEM THAT PLACES     07443600
*                                         DATA IN THIS FIELD.    @L2A*/ 07444200
*       3 QWBXEND CHAR(0) BDY(WORD); /* END OF QWBX.             @L2A*/ 07445100
*/********************************************************************/ 07447500
*/*                                                                  */ 07450000
*/*  QWB miscellaneous constants                                     */ 07500000
*/*                                                                  */ 07550000
*/********************************************************************/ 07600000
* DCL QWB_kRingSize CONSTANT(LENGTH(QWBHDR)+LENGTH(QWBSMPL)+            07606200
*                           LENGTH(QWBBASIC));   /* Old size of the     07612400
*                                       QWB, as used by the ring        07618600
*                                       processing code          @L4A*/ 07624800
*                                                                       07631000
* DCL QWBSMPLN CONSTANT(6) FIXED(8); /* NUMBER OF SMPL ENTRIES DEFINED  07637200
*                                       BY THIS QWB                  */ 07643400
*  DCL QWBDSYID BIT(8) CONSTANT('04'X); /* DAMAGED REASON CODE FOR      07650000
*                                         WHEN THE SYSID FOR THE QWB    07700000
*                                         (QWBHSYID) IS NOT DEFINED     07750000
*                                         IN THE COMPLEX     @YA13087*/ 07800000
* dcl QWB_kDEQSpecificENQ bit(2) constant('11'b); /* Used to            07810000
*                                       set/determine QWBHDENQ for      07820000
*                                       the DEQ of a specific ENQ       07830000
*                                                                @01A*/ 07840000
* dcl                                                                   07842000
*   QWB_kSQALength constant(4096)    /* Length of SQA QWB        @02A*/ 07844000
* ;                                                                     07846000
*/*                                                                  */ 07850000
