*%GOTO SAHTPLS1;                                                     /* 00009900
         MACRO                                                          00017300
         ISGSAHT                                                        00024700
**/                                                                     00032100
*%SAHTPLS1:;                                                            00039600
*/*  START OF SPECIFICATIONS ****                                       00050000
*                                                                       00100000
*01*  MACRO-NAME = ISGSAHT                                              00150000
*                                                                       00200000
*01*  MACRO-DATE = 05/05/81                                             00250000
*                                                                       00300000
*01*  DESCRIPTIVE-NAME = SYSTEM/ASID HASH TABLE                         00350000
*                                                                       00400000
*01*  COPYRIGHT =                                                       00450000
*                5740-XYN COPYRIGHT IBM CORP 1980,1981,                 00500000
*                LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,            00550000
*                REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083. 00600000
*                                                                       00650000
*01*  STATUS = OS/VS2 JBB1326                                           00700000
*                                                                       00750000
*01*  FUNCTION = EACH SYSTEM/ASID HASH TABLE ENTRY CONTAINS             00850000
*                A POINTER TO A CHAIN OF QEL ANCHORS.                   00885000
*                                                                       00920000
*01*  METHOD-OF-ACCESS = PLS - DECLARE SAHTPTR PTR(31)                  00955000
*                              DECLARE SAHTEPTR PTR(31)                 00990000
*                              %INCLUDE SYSLIB(ISGSAHT)                 01025000
*                        BAL - DSECT IS PRODUCED REQUIRING              01060000
*                              A USING ON THE SAHT AND SAHTENT          01095000
*                                                                       01130000
*01*  CREATED-BY = THE SYSTEM/ASID HASH TABLE IS CREATED BY ISGNASIM.   01165000
*                                                                       01200000
*02*    SUBPOOL = 229                                                   01250000
*                                                                       01300000
*02*    KEY     = 0                                                     01350000
*                                                                       01400000
*02*    SIZE    = 1024 BYTES                                            01450000
*                                                                       01500000
*01*  DELETED-BY = THE SYSTEM/ASID HASH TABLE IS NEVER DELETED.         01550000
*                                                                       01587500
*01*  POINTED-TO-BY = THE SYSTEM/ASID HASH TABLE IS POINTED TO BY       01625000
*                     GVTXSAHT.                                         01662500
*                                                                       01700000
*01*  SERIALIZATION = THE GRS LOCAL LOCK.                               01750000
*                                                                       01800000
*01*  CHANGE ACTIVITY = SUPPORTS PTM PBB0207                            01812400
*                                                                       01837200
**** END OF SPECIFICATIONS **                                        */ 01850000
*/*A000000-999999                                            @G383P13*/ 01900000
*        %GOTO SAHTPLS2;                                             /* 01904500
SAHT     DSECT                          SYSTEM/ASID HASH TABLE          01909300
         DS    0D                                                       01910100
SAHTHDR  DS    0D                       SYSTEM/ASID HASH TABLE HEADER   01911000
SAHTID   DS    CL4                      CONTROL BLOCK ACRONYM (SAHT)    01912700
SAHTNENT DS    H                        NUMBER OF ENTRIES IN TABLE      01914400
         DS    CL2                      RESERVED               @ZMB0207 01916100
SAHTENTS DS    0F                       SYSTEM/ASID HASH TABLE ENTRIES  01917800
SAHTENT  DSECT                          SYSTEM/ASID HASH TABLE ENTRY    01919500
         DS    0F                                                       01920300
SAHTEQEL DS    A                        ADDRESS OF FIRST QEL ANCHOR ON  01921200
*                                       SYNONYM CHAIN                   01922900
         MEND                                                           01925300
**/                                                                     01926900
*%SAHTPLS2:;                                                            01976900
*DECLARE                                                                02086000
*  1 SAHT BASED(SAHTPTR) BDY(DWORD),  /* SYSTEM/ASID HASH TABLE      */ 02136000
*    3 SAHTHDR CHAR(8) BDY(DWORD),    /* SYSTEM/ASID HASH TABLE         02186000
*                                        HEADER                      */ 02228800
*      5 SAHTID CHAR(4),              /* CONTROL BLOCK ACRONYM (SAHT)*/ 02271600
*      5 SAHTNENT FIXED(16),          /* NUMBER OF ENTRIES IN TABLE  */ 02314400
*      5 * CHAR(2),                   /* RESERVED                    */ 02357200
*    3 SAHTENTS (*) CHAR (LENGTH(SAHTENT)) BDY(WORD); /* SYSTEM ASID    02400000
*                                        HASH TABLE ENTRIES          */ 02442800
*@SPACE(3);                                                             02486000
*DECLARE                                                                02536000
*  1 SAHTENT CHAR(4) BASED(SAHTEPTR) BDY(WORD), /* SYSTEM/ASID HASH     02586000
*                                        TABLE ENTRY                 */ 02636000
*    3 SAHTEQEL PTR(31);              /* ADDRESS OF FIRST QEL ANCHOR    02686000
*                                        ON SYNONYM CHAIN            */ 02736000
*@SPACE(5);                                                             02786000
*/********************************************************************/ 02836000
*/*                                                                  */ 02886000
*/*   THE FOLLOWING CONSTANTS ARE TO BE USED ONLY BY GRS             */ 02911000
*/*   INITIALIZATION MODULES.                                        */ 02936000
*/*                                                                  */ 02961000
*/********************************************************************/ 02986000
*DECLARE                                                                03036000
*  SAHTAENT FIXED(16) CONSTANT(254);  /* NUMBER OF ENTRIES IN THE       03086000
*                                        SYSTEM/ASID HASH TABLE      */ 03136000
