         MACRO                                                          00050000
         SGIKJ0EB &DSTYPE=,&BLKSIZE=,&RECFM=,&DLRECLF=,          A45714*00100000
               &MLRECLF=,&DLRECLV=,&MLRECLV=,&TRNSLT=,&CHKR=,    A45714*00150000
               &USREXT=,&PRMTR=,&DSNSRC=,&DATEXIT=               Y02676 00200000
         LCLA  &TEMPA,&I,&J,&ATTR1(26),&ATTR2(26),&CODE(26)      A45714 00250000
         LCLC  &CHKOPT(26)                                              00300000
.*A003500,004500,077500-077960,078460-078960,079460-079992       A45714 00350000
.*A106500,107500,137600,182500                                   A45714 00400000
.*C002000-003000,004000,005000,075000,077000,154000-182000       A45714 00450000
.*C183000-423000,586000,594000,613000,621000,633000,645000       A45714 00500000
.*C661000,669000                                                 A45714 00550000
.*D009000-059000,078000,079000,080000-086000,107000              A45714 00600000
.*D152000-153000,424000-575000                                   A45714 00650000
.*A209500                                                        A50465 00700000
.*C346000-347000                                                 A50479 00750000
.*D359000-362000                                                 A50479 00800000
.*A107600,137800,199500,200500,212500-216600,243500              Y02676 00850000
.*A245500-245700,324500-324940,352500,378500-378800              Y02676 00900000
.*A417500-417940                                                 Y02676 00950000
.*C004000,004500-005000,075000,077600-077700,079100,199000       Y02676 01000000
.*C244000                                                        Y02676 01050000
.*D212000-216000                                                 Y02676 01100000
.*A586500,594500,613500,621500,633500,645500,661500,669500     @ZA02998 01150000
* C 244000                                                      ZA35948 01200000
IKJEBEPD CSECT                                                          06000000
*********************************************************************** 06100000
*                                                                     * 06200000
*STATUS  --  VERSION NO. 01, O/S RELEASE NO. 20.                      * 06250000
*                                                                     * 06400000
*FUNCTION  --  THIS MODULE CONSISTS SOLELY OF A TABLE OF CONSTANTS    * 06500000
*   CORRESPONDING TO THE SUNDRY DATA SET TYPES.                       * 06600000
*                                                                     * 06700000
*   IKJEBEPS & IKJEBEPD ARE THE 1ST & 2ND CSECTS, RESP., OF A TWO-    * 06800000
*   CSECT LOAD MODULE.                                                * 06900000
*                                                                     * 07000000
*ENTRY POINTS, INPUT, OUTPUT, EXTERNAL REFERENCES, EXITS, NORMAL, AND * 07100000
*EXITS,ERROR  --  DO NOT APPLY.                                       * 07200000
*                                                                     * 07300000
*TABLES/WORK AREAS -- IKJEBEPD, THE PROCESSOR DATA TABLE.             * 07400000
*   EACH ENTRY IS 82 BYTES LONG & BEGINS WITH AN 8-BYTE DATA     Y02676 07500000
*   SET TYPE NAME, FOLLOWED BY A DATA SET NAME QUALIFIER, BOTH LEFT-  * 07600000
*   JUSTIFIED AND PADDED TO THE RIGHT WITH BLANKS.  AT SYSTEM    A45714 07650000
*   GENERATION TIME UPTO 10 NEW USER DATA SET TYPES MAY BE ADDED A45714 07700000
*   AND THE FOLLOWING DEFAULT ATTRIBUTES OF BOTH THE USER AND THE     * 07750000
*   IBM SUPPORTED DATA SET TYPES MAY BE MODIFIED: DEFAULT BLOCK       * 07800000
*   SIZE, DEFAULT RECORD FORMAT, DEFAULT AND MAXIMUM LOGICAL RECORD   * 07850000
*   LENGTH, DEFAULT CHARACTER CONVERSION, SYNTAX CHECKER NAME,        * 07900000
*   PROMPTER NAME, USER EXIT NAME(USER DATA SET TYPES ONLY),     Y02676 07950000
*   PROMPTER INPUT SOURCE, AND DATA EXIT ROUTINE NAME (SEQUENCE  Y02676 08000000
*   DEPENDENT DATA SET TYPES). TYPE CODES LESS THAN X'33'        Y02676 08050000
*   (DEC. 51) INDICATE THE DATA SET TYPES WHICH ARE EDITABLE.    A45714 08100000
*   CODES LESS THAN X'15'(DEC.21)INDICATE STANDARD EDIT DATA SET A45714 08150000
*   TYPES.  CODES GREATER THAN X'14'(DEC.20) AND LESS THAN X'1F' A45714 08200000
*   (DEC.31)INDICATE STANDARD EDIT DATA SET TYPES WHOSE PROMPTERSA45714 08250000
*   ARE IBM PROGRAM PRODUCTS.  CODES GREATER THAN X'1D'(DEC. 29) Y02676 08300000
*   AND LESS THAN X'23' (DEC. 35) INDICATE DATA SET TYPES WHOSE  A45714 08350000
*   COMPILERS AND SYNTAX CHECKERS ARE IBM PROGRAM PRODUCTS.      A45714 08400000
*   CODES GREATER THAN X'22'(DEC.34) AND LESS THAN X'33 (DEC.51) A45714 08450000
*   INDICATE USER DATA SET TYPES SUPPLIED AT SYSGEN TIME.        A45714 08500000
*                                                                     * 08700000
*              FIELD                        LENGTH(BYTES)             * 08800000
*                                                                     * 08900000
*              DATA SET TYPE                8                         * 09000000
*              DSNAME QUALIFIER             8                         * 09100000
*              DEFAULT BLOCK SIZE           2                         * 09200000
*              LINE NO. OFFSET              1                         * 09300000
*              LINE NO. LENGTH              1                         * 09400000
*              TABULATION SETTINGS         12                         * 09500000
*              SYNTAX CHECKER NAME          8                         * 09600000
*              DATA SET TYPE CODE           1                         * 09700000
*              DATA SET ATTRIBUTES          1                         * 09800000
*              DATA SET ATTRIBUTES2         1                         * 09900000
*              RECORD FORMAT DEFAULT        1                         * 09950000
*              F FORMAT LENGTH DEFAULT      2                         * 10000000
*              F FORMAT LENGTH MAXIMUM      2                         * 10050000
*              V FORMAT LENGTH DEFAULT      2                         * 10100000
*              V FORMAT LENGTH MAXIMUM      2                         * 10150000
*              U FORMAT LENGTH DEFAULT      2                         * 10200000
*              U FORMAT LENGTH MAXIMUM      2                         * 10250000
*              SYNTAX CHECKER OPT. BYTES    2                    A45714 10300000
*              PROMPTER NAME                8                         * 10700000
*              USER EXIT NAME               8                    A45714 10733300
*              DATA EXIT ROUTINE NAME       8                    Y02676 10766600
*                                                                     * 10800000
*ATTRIBUTES  --  NON-EXECUTABLE.                                      * 10900000
*                                                                     * 11000000
*NOTES  --  THE SYNTAX-CHECKER-NAME FIELD MUST BE ON A DOUBLEWORD     * 11100000
*   BOUNDARY IN EACH TABLE ENTRY.                                     * 11200000
*   THERE IS CHARACTER-CODE INDEPENDENCE.                             * 11300000
*                                                                     * 11400000
*********************************************************************** 11500000
         SPACE                                                          11600000
         SPACE                                                          11700000
*********************************************************************** 11800000
*                                                                     * 11900000
*                               EQUATES                               * 12000000
*                                                                     * 12100000
*********************************************************************** 12200000
         SPACE                                                          12300000
* DATA SET ATTRIBUTES                                                   12400000
         SPACE                                                          12500000
CCMUSTAY EQU   X'08' -   CONTINUATION CHAR MUST REMAIN IN RCD           12600000
LINUMREQ EQU   X'04' -   DATA SET MUST BE LINE-NUMBERED                 12700000
LRLDFREQ EQU   X'02' -   DEFAULT LRECL IS REQUIRED                      12800000
RUNOK    EQU   X'80' -   DATA SET IS EXECUTABLE UNDER EDIT              12900000
SNTXCKOK EQU   X'40' -   SYNTAX CHECKING IS AVAILABLE                   13000000
CAPSREQ  EQU   X'20' -   "CAPS" ATTRIBUTE IS REQUIRED                   13100000
DFALTCAP EQU   X'10' -   "CAPS" IS A DEFAULT ATTRIBUTE                  13200000
         SPACE                                                          13300000
* DATA SET ATTRIBUTES2                                                  13400000
         SPACE                                                          13500000
NUMINTAB EQU   X'80' -   LINE NO. LNG IS INCLUDED IN TAB VALUE          13600000
DFALTYPE EQU   X'40' -   DSTYPE IS DEFAULT FOR THIS DSNAME QUALIFIER    13700000
RUNOBGEN EQU   X'20' -   OBJECT DATA SET GENERATED AT RUN TIME.         13750000
INCOREDS EQU   X'10' -   INCORE INPUT ACCEPTABLE AT RUN TIME.    A45714 13766600
INLISTDS EQU   X'08' -   INLIST INPUT ACCEPTABLE AT RUN TIME     Y02676 13783200
         SPACE                                                          13800000
* RECORD FORMAT DEFAULT                                                 13900000
         SPACE                                                          14000000
FMTDFALF EQU   X'80' -   FIXED FORMAT IS DEFAULT                        14100000
FMTDFALV EQU   X'40' -   VARIABLE FORMAT IS DEFAULT                     14200000
FMTDFALU EQU   X'C0' -   UNDEFINED FORMAT IS DEFAULT                    14300000
         SPACE                                                          14400000
*********************************************************************** 14500000
*                                                                     * 14600000
*                        PROCESSOR DATA TABLE                         * 14700000
*                                                                     * 14800000
*********************************************************************** 14900000
         SPACE                                                          15000000
TABLE    EQU   *                                                        15100000
.* INITIALIZE LOOP CONTROL VALUE 'J' TO NO. OF DSTYPES PASSED    A45714 15150000
&J       SETA  N'&DSTYPE                                         A45714 15200000
.* CHECK IF DSTYPE ENTRY 'J' IS NULL - YES, ADJUST LOOP 'J'      A45714 15250000
.LOOP0   AIF   ('&DSTYPE(&J)' NE '').OUT0                        A45714 15300000
&J       SETA  &J-1                                              A45714 15350000
         AGO   .LOOP0                                            A45714 15400000
.OUT0    ANOP                                                    A45714 15450000
.* INITIALIZE INDEX 'I' TO ONE.                                  A45714 15500000
&I       SETA  1                                                 A45714 15550000
.* CHECK IF ALL DSTYPES PASSED PROCESSED                         A45714 15600000
.LOOP2   AIF   (&I GT &J).OUT2                                   A45714 15650000
.* INITIALIZE DSTYPE ATTRIBUTES1 TO ZERO.                        A45714 15700000
&ATTR1(&I) SETA 0                                                A45714 15750000
.* CHECK IF DSTYPE REQUIRES THAT CONTINUATION CHAR. MUST REMAIN. A45714 15800000
         AIF   ('&DSTYPE(&I)' EQ 'GOFORT').TAG11                 A45714 15850000
         AIF   ('&DSTYPE(&I)' NE 'CLIST').TAG12                  A45714 15900000
.TAG11   ANOP                                                    A45714 15950000
&ATTR1(&I) SETA &ATTR1(&I)+8                                     A45714 16000000
.* CHECK IF DSTYPE REQUIRES LINE NUMBERS.                        A45714 16050000
.TAG12   AIF   ('&DSTYPE(&I)' EQ 'CLIST').TAG13                  A45714 16100000
         AIF   ('&DSTYPE(&I)' EQ 'GOFORT').TAG13                 A45714 16150000
         AIF   ('&DSTYPE(&I)' EQ 'BASIC').TAG13                  A45714 16200000
         AIF   ('&DSTYPE(&I)' NE 'IPLI').TAG14                   A45714 16250000
.TAG13   ANOP                                                    A45714 16300000
&ATTR1(&I) SETA &ATTR1(&I)+4                                     A45714 16350000
.* CHECK IF DSTYPE REQUIRES FIXED RECORD FORMAT.                 A45714 16400000
.TAG14   AIF   ('&RECFM(&I)' EQ 'VAR').TAG15                     A45714 16450000
&TEMPA   SETA  &MLRECLF(&I)                                      A45714 16500000
         AIF   (&DLRECLF(&I) NE &TEMPA).TAG15                    A45714 16550000
         AIF   (&MLRECLV(&I) NE 0).TAG15                         A45714 16600000
&ATTR1(&I) SETA &ATTR1(&I)+2                                     A45714 16650000
.* CHECK IF DSTYPE HAS A PROMPTER.                               A45714 16700000
.TAG15   AIF   ('&PRMTR(&I)' EQ '').TAG16                        A45714 16750000
&ATTR1(&I) SETA &ATTR1(&I)+128                                   A45714 16800000
.* CHECK IF DSTYPE HAS A SYNTAX CHECKER.                         A45714 16850000
.TAG16   AIF   ('&CHKR(&I)' EQ '').TAG17                         A45714 16900000
&ATTR1(&I) SETA &ATTR1(&I)+64                                    A45714 16950000
.TAG17   AIF   ('&TRNSLT(&I)' EQ 'ASIS').TAG18                   A45714 17000000
.* CHECK IF DSTYPE HAS UPPER CASE CONVERSION AS DEFAULT.         A45714 17050000
&ATTR1(&I) SETA &ATTR1(&I)+16                                    A45714 17100000
.* CHECK IF UPPER CASE CONVERSION IS REQUIRED.                   A45714 17150000
         AIF   ('&TRNSLT(&I)' NE 'CAPSONLY').TAG18               A45714 17200000
&ATTR1(&I) SETA &ATTR1(&I)+32                                    A45714 17250000
.TAG18   ANOP                                                    A45714 17300000
.* INITIALIZE DSTYPE ATTRIBUTES2 TO ZERO.                        A45714 17350000
&ATTR2(&I) SETA 0                                                A45714 17400000
.* CHECK IF DSTYPE IS COBOL OR VSBASIC - SPECIAL LINE NO. FIELD. Y02676 17450000
         AIF   ('&DSTYPE(&I)' EQ 'VSBASIC').TAG18A               Y02676 17500000
         AIF   ('&DSTYPE(&I)' NE 'COBOL').TAG19                  A45714 17550000
.TAG18A  ANOP                                                    Y02676 17600000
&ATTR2(&I) SETA &ATTR2(&I)+128                                   A45714 17650000
.TAG19   ANOP                                                    A45714 17700000
.* CHECK IF DSTYPE IS DEFAULT DSNAME QUALIFIER TYPE.             A45714 17750000
         AIF   ('&DSTYPE(&I)'(1,4) EQ 'FORT').TAG20              A45714 17800000
         AIF   ('&DSTYPE(&I)' EQ 'PLIF').TAG20                   A45714 17850000
&ATTR2(&I) SETA &ATTR2(&I)+64                                    A45714 17900000
.* CHECK IF DSTYPE GENERATES AN OBJECT DATA SET.                 A45714 17950000
.TAG20   AIF   ('&DSTYPE(&I)' EQ 'ASM').TAG21                    A45714 18000000
         AIF   ('&DSTYPE(&I)' EQ 'COBOL').TAG21                  A45714 18050000
         AIF   ('&DSTYPE(&I)' EQ 'PLI').TAG21                    A50465 18100000
         AIF   ('&DSTYPE(&I)' NE 'FORTGI').TAG22                 A45714 18150000
.TAG21   ANOP                                                    A45714 18200000
&ATTR2(&I) SETA &ATTR2(&I)+32                                    A45714 18250000
.* ESTABLISH SOURCE DATA ATTRIBUTES FOR RUN SUBCOMMAND.  IF      Y02676 18300000
.* SOURCE FOR RUN IS 'DATASET', BYPASS ATTRIBUTE SETTING.        Y02676 18350000
.TAG22   AIF   ('&DSNSRC(&I)' EQ 'DATASET').TAG23                Y02676 18400000
         AIF   ('&DSNSRC(&I)' EQ 'INLIST').TAG22A                Y02676 18450000
&ATTR2(&I) SETA &ATTR2(&I)+16 SET 'INCORE' INDICATION            Y02676 18500000
         AGO   .TAG23                                            Y02676 18550000
.TAG22A  ANOP                                                    Y02676 18600000
&ATTR2(&I) SETA &ATTR2(&I)+8  SET 'INLIST' INDICATION            Y02676 18650000
.TAG23   ANOP                                                    Y02676 18700000
.* INCREMENT INDEX 'I' BY ONE.                                   A45714 18750000
&I       SETA  &I+1                                              A45714 18800000
.* REPEAT LOOP.                                                  A45714 18850000
         AGO   .LOOP2                                            A45714 18900000
.OUT2    ANOP                                                    A45714 18950000
.* INITIALIZE INDEX 'I' TO ONE.                                  A45714 19000000
&I       SETA  1                                                 A45714 19050000
.* CHECK IF ALL DSTYPES PROCESSED - INDEX 'I' GT NO. OF DSTYPES. A45714 19100000
.LOOP3   AIF   (&I GT &J).OUT3                                   A45714 19150000
.* INITIALIZE SYNTAX CHECKER OPTION BYTES TO ZERO.               A45714 19200000
&CHKOPT(&I) SETC '00'                                            A45714 19250000
.* ASSIGN DSTYPE CODE AND CHECKER OPTION VALUES TO EACH DSTYPE.  A45714 19300000
         AIF   ('&DSTYPE(&I)' EQ 'PLI').TAG29                    A45714 19350000
         AIF   ('&DSTYPE(&I)' EQ 'PLIF').TAG30                   A45714 19400000
         AIF   ('&DSTYPE(&I)' EQ 'BASIC').TAG31                  A45714 19450000
         AIF   ('&DSTYPE(&I)' EQ 'FORTE').TAG32                  A45714 19500000
         AIF   ('&DSTYPE(&I)' EQ 'FORTG').TAG33                  A45714 19550000
         AIF   ('&DSTYPE(&I)' EQ 'FORTH').TAG34                  A45714 19600000
         AIF   ('&DSTYPE(&I)' EQ 'FORTGI').TAG35                 A45714 19650000
         AIF   ('&DSTYPE(&I)' EQ 'GOFORT').TAG36                 A45714 19700000
         AIF   ('&DSTYPE(&I)' EQ 'IPLI').TAG37                   A45714 19750000
         AIF   ('&DSTYPE(&I)' EQ 'TEXT').TAG38                   A45714 19800000
         AIF   ('&DSTYPE(&I)' EQ 'DATA').TAG39                   A45714 19850000
         AIF   ('&DSTYPE(&I)' EQ 'CLIST').TAG40                  A45714 19900000
         AIF   ('&DSTYPE(&I)' EQ 'CNTL').TAG41                   A45714 19950000
         AIF   ('&DSTYPE(&I)' EQ 'ASM').TAG42                    A45714 20000000
         AIF   ('&DSTYPE(&I)' EQ 'COBOL').TAG43                  A45714 20050000
         AIF   ('&DSTYPE(&I)' EQ 'VSBASIC').TAG28                Y02676 20100000
&CODE(&I) SETA  &I+20                                           ZA35948 20150000
         AGO   .TAG44                                            A45714 20200000
.TAG28   ANOP                                                    Y02676 20250000
&CODE(&I) SETA 30                                                Y02676 20300000
         AGO   .TAG44                                            Y02676 20350000
.TAG29   ANOP                                                    A45714 20400000
&CODE(&I) SETA 34                                                A45714 20450000
&CHKOPT(&I) SETC '0248'                                          A45714 20500000
         AGO   .TAG44                                            A45714 20550000
.TAG30   ANOP                                                    A45714 20600000
&CODE(&I) SETA 1                                                 A45714 20650000
&CHKOPT(&I) SETC '0248'                                          A45714 20700000
         AGO   .TAG44                                            A45714 20750000
.TAG31   ANOP                                                    A45714 20800000
&CODE(&I) SETA 32                                                A45714 20850000
&CHKOPT(&I) SETC '0100'                                          A45714 20900000
         AGO   .TAG44                                            A45714 20950000
.TAG32   ANOP                                                    A45714 21000000
&CODE(&I) SETA 2                                                 A45714 21050000
&CHKOPT(&I) SETC '0101'                                          A45714 21100000
         AGO   .TAG44                                            A45714 21150000
.TAG33   ANOP                                                    A45714 21200000
&CODE(&I) SETA 3                                                 A45714 21250000
&CHKOPT(&I) SETC '0202'                                          A45714 21300000
         AGO   .TAG44                                            A45714 21350000
.TAG34   ANOP                                                    A45714 21400000
&CODE(&I) SETA 4                                                 A45714 21450000
&CHKOPT(&I) SETC '0002'                                          A45714 21500000
         AGO   .TAG44                                            A45714 21550000
.TAG35   ANOP                                                    A45714 21600000
&CODE(&I) SETA 23                                                A45714 21650000
&CHKOPT(&I) SETC '0402'                                          A45714 21700000
         AGO   .TAG44                                            A45714 21750000
.TAG36   ANOP                                                    A45714 21800000
&CODE(&I) SETA 31                                                A45714 21850000
&CHKOPT(&I) SETC '0302'                                          A45714 21900000
         AGO   .TAG44                                            A45714 21950000
.TAG37   ANOP                                                    A45714 22000000
&CODE(&I) SETA 33                                                A45714 22050000
         AGO   .TAG44                                            A45714 22100000
.TAG38   ANOP                                                    A45714 22150000
&CODE(&I) SETA 5                                                 A45714 22200000
         AGO   .TAG44                                            A45714 22250000
.TAG39   ANOP                                                    A45714 22300000
&CODE(&I) SETA 6                                                 A45714 22350000
         AGO   .TAG44                                            A45714 22400000
.TAG40   ANOP                                                    A45714 22450000
&CODE(&I) SETA 7                                                 A45714 22500000
         AGO   .TAG44                                            A45714 22550000
.TAG41   ANOP                                                    A45714 22600000
&CODE(&I) SETA 8                                                 A45714 22650000
         AGO   .TAG44                                            A45714 22700000
.TAG42   ANOP                                                    A45714 22750000
&CODE(&I) SETA 21                                                A45714 22800000
         AGO   .TAG44                                            A45714 22850000
.TAG43   ANOP                                                    A45714 22900000
&CODE(&I) SETA 22                                                A45714 22950000
.TAG44   ANOP                                                    A45714 23000000
.* INCREMENT INDEX 'I' BY ONE.                                   A45714 23050000
&I       SETA  &I+1                                              A45714 23100000
.* REPEAT LOOP.                                                  A45714 23150000
         AGO   .LOOP3                                            A45714 23200000
.OUT3    ANOP                                                    A45714 23250000
.* INITIALIZE INDEX 'I' TO ONE.                                  A45714 23300000
&I       SETA  1                                                 A45714 23350000
.* CHECK IF ALL DSTYPES PROCESSED - INDEX 'I' GT NO. OF DSTYPES. A45714 23400000
.MAINLP  AIF   (&I GT &J).MAINEXT                                A45714 23450000
.* BUILD EACH DATA SET TYPE ENTRY TO GENERATE TABLE.             A45714 23500000
         DC    CL8'&DSTYPE(&I)' -            DATA SET TYPE       A45714 23550000
.* CHECK IF DSTYPE IS PLI OR PLIF - DSNAME QUALIFIER IS PLI.     A45714 23600000
         AIF   ('&DSTYPE(&I)'(1,3) NE 'PLI').TAGM10              A45714 23650000
         DC    CL8'PLI' -                    DSNAME QUALIFIER    A45714 23700000
         AGO   .TAGM13                                           A45714 23750000
.* CHECK IF DSTYPE IS ONE OF FORTRANS - DSNAME QUALIFIER IS FORT.A45714 23800000
.TAGM10  AIF   ('&DSTYPE(&I)'(1,4) EQ 'FORT').TAGM11             A45714 23850000
         AIF   ('&DSTYPE(&I)' NE 'GOFORT').TAGM12                A45714 23900000
.TAGM11  ANOP                                                    A45714 23950000
         DC    CL8'FORT' -                   DSNAME QUALIFIER    A45714 24000000
         AGO   .TAGM13                                           A45714 24050000
.TAGM12  ANOP                                                    A45714 24100000
.* DSTYPE IS ALSO DSNAME QUALIFIER.                              A45714 24150000
         DC    CL8'&DSTYPE(&I)' -            DSNAME QUALIFIER    A45714 24200000
.TAGM13  ANOP                                                    A45714 24250000
         DC    HL2'&BLKSIZE(&I)' -           DEFAULT BLOCK SIZE  A45714 24300000
.* CHECK FOR TYPE VSBASIC - SPECIAL CASE SEQUENCE NUMBER IS      Y02676 24350000
.* 5 CHARACTERS LONG BEGINNING IN THE FIRST POSITION OF THE LINE Y02676 24400000
         AIF   ('&DSTYPE(&I)' NE 'VSBASIC').TAG13A               Y02676 24450000
         DC    FL1'1' -                      LINE NO. OFFSET     Y02676 24500000
         DC    FL1'5' -                      LINE NO. LENGTH     Y02676 24550000
         AGO   .TAGM15                                           Y02676 24600000
.TAG13A  ANOP                                                    Y02676 24650000
.* CHECK IF DEFAULT RECORD FORMAT IS VARIABLE - SET LINE NUMBER  A45714 24700000
.*     FIELD DEFAULT TO COLUMNS 1 THRU 8.                        A45714 24750000
         AIF   ('&RECFM(&I)' NE 'VAR').TAGM14                    A45714 24800000
         DC    FL1'1' -                      LINE NO. OFFSET     A45714 24850000
         DC    FL1'8' -                      LINE NO. LENGTH     A45714 24900000
         AGO   .TAGM15                                           A45714 24950000
.TAGM14  ANOP                                                    A45714 25000000
.* COBOL HAS SPECIAL LINE NUMBER FIELD - COLUMN 1 THRU 6.        A45714 25050000
         AIF   ('&DSTYPE(&I)' NE 'COBOL').TAGM14A                A45714 25100000
         DC    FL1'1' -                      LINE NO. OFFSET     A45714 25150000
         DC    FL1'6' -                      LINE NO. LENGTH     A45714 25200000
         AGO   .TAGM15                                           A45714 25250000
.TAGM14A ANOP                                                    A45714 25300000
.* SET LINE NUMBER OFFSET TO LRECL - 7 FOR FIXED FORMAT.         A45714 25350000
&TEMPA   SETA  &DLRECLF(&I)-7                                    A45714 25400000
         DC    AL1(&TEMPA) -                 LINE NO. OFFSET     A45714 25450000
         DC    FL1'8' -                      LINE NO. LENGTH     A45714 25500000
.TAGM15  ANOP                                                    A45714 25550000
         DC    X'FF'                                             A45714 25600000
.* ASSIGN DEFAULT TAB SETTINGS TO EACH DSTYPE.                   A45714 25650000
         AIF   ('&DSTYPE(&I)' EQ 'PLI').TAG1A                    A45714 25700000
         AIF   ('&DSTYPE(&I)' EQ 'PLIF').TAG1A                   A50479 25750000
         AIF   ('&DSTYPE(&I)' EQ 'IPLI').TAG1A                   A50479 25800000
         AIF   ('&DSTYPE(&I)'(1,4) EQ 'FORT').TAG2               A45714 25850000
         AIF   ('&DSTYPE(&I)' EQ 'GOFORT').TAG2                  A45714 25900000
         AIF   ('&DSTYPE(&I)' EQ 'TEXT').TAG3                    A45714 25950000
         AIF   ('&DSTYPE(&I)' EQ 'ASM').TAG4                     A45714 26000000
         AIF   ('&DSTYPE(&I)' EQ 'COBOL').TAG5                   A45714 26050000
         AIF   ('&DSTYPE(&I)' EQ 'VSBASIC').TAG5A                Y02676 26100000
         DC    FL1'10,20,30,40,50,60' -      TABULATION SETTINGS A45714 26150000
         DC    5X'0' -                                           A45714 26200000
         AGO   .TAG6                                             A45714 26250000
.TAG1A   ANOP                                                    A45714 26300000
         DC    FL1'5,10,15,20,25,30,35,40,45,50'                 A45714 26350000
         DC    X'0'                                              A45714 26400000
         AGO   .TAG6                                             A45714 26450000
.TAG2    ANOP                                                    A45714 26500000
         DC    FL1'7,72' -                   TABULATION SETTINGS A45714 26550000
         DC    9X'0'                                             A45714 26600000
         AGO   .TAG6                                             A45714 26650000
.TAG3    ANOP                                                    A45714 26700000
         DC    FL1'5,10,15,20,30,40' -       TABULATION SETTINGS A45714 26750000
         DC    5X'0'                                             A45714 26800000
         AGO   .TAG6                                             A45714 26850000
.TAG4    ANOP                                                    A45714 26900000
         DC    FL1'10,16,31,72' -            TABULATION SETTINGS A45714 26950000
         DC    7X'0'                                             A45714 27000000
         AGO   .TAG6                                             A45714 27050000
.TAG5    ANOP                                                    A45714 27100000
         DC    FL1'8,12,72' -                TABULATION SETTINGS A45714 27150000
         DC    8X'0'                                             A45714 27200000
         AGO   .TAG6                                             Y02676 27250000
.TAG5A   ANOP                                                    Y02676 27300000
         DC    FL1'10,15,20,25,30,35,40,45,50,55' TABULATION     Y02676 27350000
*                                                 SETTINGS       Y02676 27400000
         DC    X'0'                                              Y02676 27450000
.TAG6    ANOP                                                    A45714 27500000
.* CHECK IF SYNTAX CHECKER SPECIFIED FOR DSTYPE.                 A45714 27550000
         AIF   ('&CHKR(&I)' EQ '').TAGM16                        A45714 27600000
         DC    CL8'&CHKR(&I)' -              SYNTAX CHECKER NAME A45714 27650000
         AGO   .TAGM17                                           A45714 27700000
.TAGM16  ANOP                                                    A45714 27750000
         DC    8X'0' -                       SYNTAX CHECKER NAME A45714 27800000
.TAGM17  ANOP                                                    A45714 27850000
         DC    AL1(&CODE(&I)) -              DATA SET TYPE CODE  A45714 27900000
         DC    AL1(&ATTR1(&I)) -             DATA SET ATTRIBUTE1 A45714 27950000
         DC    AL1(&ATTR2(&I)) -             DATA SET ATTRIBUTE2 A45714 28000000
.* ASSIGN DSTYPE RECORD FORMAT DEFAULT.                          A45714 28050000
         AIF   ('&RECFM(&I)' NE 'VAR').TAGM18                    A45714 28100000
         DC    AL1(FMTDFALV) -               RECORD FORMAT DFLT  A45714 28150000
         AGO   .TAGM19                                           A45714 28200000
.TAGM18  ANOP                                                    A45714 28250000
         DC    AL1(FMTDFALF) -               RECORD FORMAT DFLT  A45714 28300000
.TAGM19  ANOP                                                    A45714 28350000
         DC    HL2'&DLRECLF(&I)' -           F FORMAT LRECL DFLT A45714 28400000
         DC    HL2'&MLRECLF(&I)' -           F FORMAT LRECL MAX  A45714 28450000
         DC    HL2'&DLRECLV(&I)' -           V FORMAT LRECL DFLT A45714 28500000
         DC    HL2'&MLRECLV(&I)' -           V FORMAT LRECL MAX  A45714 28550000
         DC    HL2'0' -                      U FORMAT LRECL DFLT A45714 28600000
         DC    HL2'0' -                      U FORMAT LRECL MAX  A45714 28650000
         DC    XL2'&CHKOPT(&I)' -            CHECKER OPT. BYTES  A45714 28700000
.* CHECK IF PROMPTER SPECIFIED FOR DSTYPE.                       A45714 28750000
         AIF   ('&PRMTR(&I)' EQ '').TAGM20                       A45714 28800000
         DC    CL8'&PRMTR(&I)' -             PROMPTER NAME       A45714 28850000
         AGO   .TAGM21                                           A45714 28900000
.TAGM20  ANOP                                                    A45714 28950000
         DC    8X'0' -                       PROMPTER NAME       A45714 29000000
.TAGM21  ANOP                                                    A45714 29050000
.* CHECK IF USER EXIT SPECIFIED FOR DSTYPE.                      A45714 29100000
         AIF   ('&USREXT(&I)' EQ '').TAGM22                      A45714 29150000
         DC    CL8'&USREXT(&I)' -            USER EXIT NAME      A45714 29200000
         AGO   .TAGM23                                           A45714 29250000
.TAGM22  ANOP                                                    A45714 29300000
         DC    8X'0' -                       USER EXIT NAME      A45714 29350000
.TAGM23  ANOP                                                    A45714 29400000
.* CHECK IF DATEXIT ROUTINE SPECIFIED FOR DATA SET TYPE          Y02676 29450000
         AIF   ('&DATEXIT(&I)' EQ '').TAGM24                     Y02676 29500000
         DC    CL8'&DATEXIT(&I)' -      DATA EXIT NAME           Y02676 29550000
         AGO   .TAGM25                                           Y02676 29600000
.TAGM24  ANOP                                                    Y02676 29650000
         DC    8X'0' -                  DATA EXIT NAME           Y02676 29700000
.TAGM25  ANOP                                                    Y02676 29750000
.* INCREMENT INDEX 'I' BY ONE.                                   A45714 29800000
&I       SETA  &I+1                                              A45714 29850000
*--------------------------------------------------------------- A45714 29900000
.* REPEAT LOOP.                                                  A45714 29950000
         AGO   .MAINLP                                           A45714 30000000
.MAINEXT ANOP                                                    A45714 30050000
*                                                                       32500000
* THE FOLLOWING TABLE ENTRIES APPLY TO NON-"EDIT"ABLE DATA SET TYPES.   57700000
*                                                                       57800000
*---------------------------------------------------------------------- 57900000
         DC    CL8'STEX' -                   DATA SET TYPE              58000000
         DC    CL8'STEX' -                   DSNAME QUALIFIER           58100000
         DC    24X'0'                                                   58200000
         DC    X'33' (DECIMAL 51)            DATA SET TYPE CODE         58300000
         DC    X'0' -                        DATA SET ATTRIBUTES        58400000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       58500000
         DC    31X'0' -                                          A45714 58550000
         DC    8X'0'                                           @ZA02998 58600000
*---------------------------------------------------------------------- 58700000
         DC    CL8'OBJ' -                    DATA SET TYPE              58800000
         DC    CL8'OBJ' -                    DSNAME QUALIFIER           58900000
         DC    24X'0'                                                   59000000
         DC    X'34' (DECIMAL 52)            DATA SET TYPE CODE         59100000
         DC    X'0' -                        DATA SET ATTRIBUTES        59200000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       59300000
         DC    31X'0' -                                          A45714 59350000
         DC    8X'0'                                           @ZA02998 59400000
*---------------------------------------------------------------------- 59500000
         DC    CL8'LIST' -                   DATA SET TYPE              59600000
         DC    CL8'LIST' -                   DSNAME QUALIFIER           59700000
         DC    H'3556' -      DEFAULT BLKSIZE                           59800000
         DC    FL1'1'  -      LINE NUMBER OFFSET                        59900000
         DC    FL1'8'  -      LINE NUMBER LENGTH                        60000000
         DC    12X'00' -           TABS                                 60100000
         DC    8X'0' -             SYNTAX CHECKER NAME                  60200000
         DC    X'35' (DECIMAL 53)            DATA SET TYPE CODE         60300000
         DC    X'0' -                        DATA SET ATTRIBUTES        60400000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       60500000
         DC    AL1(FMTDFALV) -     RECORD FORMAT DEFAULT                60600000
         DC    HL2'0' -            F FORMAT LRECL DEFAULT               60700000
         DC    HL2'0' -            F FORMAT LRECL MAX                   60800000
         DC    HL2'148' -          V FORMAT LRECL DEFAULT               60900000
         DC    HL2'148' -          V FORMAT LRECL MAX                   61000000
         DC    HL2'0' -            U FORMAT LRECL DEFAULT               61100000
         DC    HL2'0' -            U FORMAT LRECL MAX                   61200000
         DC    18X'0' -                                          A45714 61250000
         DC    8X'0'                                           @ZA02998 61300000
*---------------------------------------------------------------------- 61400000
         DC    CL8'LOAD' -                   DATA SET TYPE              61500000
         DC    CL8'LOAD' -                   DSNAME QUALIFIER           61600000
         DC    24X'0'                                                   61700000
         DC    X'36' (DECIMAL 54)            DATA SET TYPE CODE         61800000
         DC    X'0' -                        DATA SET ATTRIBUTES        61900000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       62000000
         DC    31X'0' -                                          A45714 62050000
         DC    8X'0'                                           @ZA02998 62100000
*---------------------------------------------------------------------- 62200000
         DC    CL8'LINKLIST' -               DATA SET TYPE              62300000
         DC    CL8'LINKLIST' -               DSNAME QUALIFIER           62400000
         DC    HL2'81' -           DEFAULT BLKSIZE                      62500000
         DC    22X'0'                                                   62600000
         DC    X'37' (DECIMAL 55)            DATA SET TYPE CODE         62700000
         DC    X'0' -                        DATA SET ATTRIBUTES        62800000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       62900000
         DC    AL1(FMTDFALF) -     RECFM DEFAULT                        63000000
         DC    HL2'81' -           F FORMAT LRECL DEFAULT               63100000
         DC    HL2'81' -           F FORMAT LRECL MAX                   63200000
         DC    26X'0'                                            A45714 63250000
         DC    8X'0'                                           @ZA02998 63300000
*---------------------------------------------------------------------- 63400000
         DC    CL8'LOADLIST' -               DATA SET TYPE              63500000
         DC    CL8'LOADLIST' -               DSNAME QUALIFIER           63600000
         DC    HL2'81' -           DEFAULT BLKSIZE                      63700000
         DC    22X'0'                                                   63800000
         DC    X'38' (DECIMAL 56)            DATA SET TYPE CODE         63900000
         DC    X'0' -                        DATA SET ATTRIBUTES        64000000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       64100000
         DC    AL1(FMTDFALF) -     RECFM DEFAULT                        64200000
         DC    HL2'81' -           F FORMAT LRECL DEFAULT               64300000
         DC    HL2'81' -           F FORMAT LRECL MAX                   64400000
         DC    26X'0'                                            A45714 64450000
         DC    8X'0'                                           @ZA02998 64500000
*---------------------------------------------------------------------- 64600000
         DC    CL8'TESTLIST' -               DATA SET TYPE              64700000
         DC    CL8'TESTLIST' -               DSNAME QUALIFIER           64800000
         DC    HL2'1695' -         DEFAULT BLKSIZE                      64900000
         DC    22X'0'                                                   65000000
         DC    X'39' (DECIMAL 57)            DATA SET TYPE CODE         65100000
         DC    X'0' -                        DATA SET ATTRIBUTES        65200000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       65300000
         DC    AL1(FMTDFALV) -     RECFM DEFAULT                        65400000
         DC    HL2'0' -            F FORMAT LRECL DEFAULT               65500000
         DC    HL2'0' -            F FORMAT LRECL MAX                   65600000
         DC    HL2'1695' -         V FORMAT LRECL DEFAULT               65700000
         DC    HL2'1695' -         V FORMAT LRECL MAX                   65800000
         DC    HL2'0' -            U FORMAT LRECL DEFAULT               65900000
         DC    HL2'0' -            U FORMAT LRECL MAX                   66000000
         DC    18X'0' -                                          A45714 66050000
         DC    8X'0'                                           @ZA02998 66100000
*---------------------------------------------------------------------- 66200000
         DC    CL8'OUTLIST' -                DATA SET TYPE              66300000
         DC    CL8'OUTLIST' -                DSNAME QUALIFIER           66400000
         DC    24X'0'                                                   66500000
         DC    X'3A' (DECIMAL 58)            DATA SET TYPE CODE         66600000
         DC    X'0' -                        DATA SET ATTRIBUTES        66700000
         DC    AL1(DFALTYPE) -               DATA SET ATTRIBUTES2       66800000
         DC    31X'0' -                                          A45714 66850000
         DC    8X'0'                                           @ZA02998 66900000
*---------------------------------------------------------------------- 67000000
         DC    X'0' -                        END-OF-TABLE MARKER        67100000
         MEND                                                           67200000
