//COFXDLF1 JOB ,'ASSEMBLE DLF EXIT',CLASS=E
//S1 EXEC ASMCL,
// PARM.LKED='LIST,XREF,LET,RENT,REFR,REUS,AC=1,RMODE=ANY,AMODE=31'
//ASM.SYSIN DD *
COFXDLF1 TITLE 'COFXDLF1 - Sample DLF Installation Exit'                00000100
*/*** START OF SPECIFICATIONS ***************************************** 00000200
*                                                                       00000300
*01* Module-Name: COFXDLF1                                              00000400
*                                                                       00000500
*02*   Csect-Name: COFXDLF1                                             00000600
*                                                                       00000700
*02*   Load-Module-Name: COFXDLF1                                       00000800
*                                                                       00000900
*01* Descriptive-Name: Sample DLF Installation Exit                     00001000
*                                                                       00001100
*01* PROPRIETARY STATEMENT =                                            00001200
*                                                                       00001300
*      LICENSED MATERIALS - PROPERTY OF IBM                             00001400
*      THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                     00001500
*      5685-001 (C) COPYRIGHT IBM CORPORATION  1990                     00001600
*      SEE COPYRIGHT INSTRUCTIONS.                                      00001700
*                                                                       00001800
*01* STATUS = JBB3313                                                   00001900
*                                                                       00002000
*01* Function:                                                          00002100
*                                                                       00002200
*    Allows the installation to select the data set names and jobnames  00002300
*    that are eligible for Hiperbatch.  The information is stored in a  00002400
*    table which is contained within the COFXDLF1 CSECT.                00002500
*                                                                       00002600
*    This exit is intended for MVS/SP systems where RACF is not         00002700
*    installed.  Installations  with RACF 1.9 should consider           00002800
*    equivalent functions provided through RACF.                        00002900
*                                                                       00003000
*02*   Operation:                                                       00003100
*                                                                       00003200
*        o COFXDLF1 exit is called:                                     00003300
*            1.  During DLF address space initialization                00003400
*            2.  At OPEN time for CONNECT or QUERY request              00003500
*            3.  At CLOSE time for DISCONNECT request                   00003600
*                                                                       00003700
*        o  When COFXDLF1 is invoked, Register 1 points to a parameter  00003800
*           list containing a pointer to the exit parameter area, as    00003900
*           mapped by the COFZCXIT DSECT.                               00004000
*                                                                       00004100
*        o  Sets CXTDSMAX to the maximum number of datasets ever        00004200
*           possible for Hiperbatch to process simultaneously.  The     00004300
*           default value that DLF and Hiperbatch set is 50.  This      00004400
*           exit sets the value to 100.                                 00004500
*                                                                       00004600
*        o  Checks the function code in field CXTFUN.  This field       00004700
*           uniquely identifies the reason for invoking the exit.  The  00004800
*           exit performs different functions for each function code:   00004900
*                                                                       00005000
*           - CXTFUNIN (0) for INIT                                     00005100
*                                                                       00005200
*                Checks to see that the move-page facility is           00005300
*                installed on the system.  If it is not, COFXDLF1       00005400
*                issues a message to the system programmer console      00005500
*                stating such.                                          00005600
*                                                                       00005700
*                                                                       00005800
*           - CXTFUNQU (1) for QUERY                                    00005900
*                                                                       00006000
*                 When a QUERY request is received for a data set,      00006100
*                 the data set name is compared to the eligible list    00006200
*                 of data set names.                                    00006300
*                 If the data set name is found in the table, the data  00006400
*                 set is eligible.  Return code zero is returned to     00006500
*                 indicate that the data set is eligible for QUERY      00006600
*                 processing.                                           00006700
*                                                                       00006800
*                 Note: this sample exit does not check VOLSER when     00006900
*                 determining Hiperbatch eligibility.                   00007000
*                                                                       00007100
*                                                                       00007200
*           - CXTFUNCO (2) for CONNECT                                  00007300
*                                                                       00007400
*                 Searches the table of eligible data sets and job      00007500
*                 names looking for a match with the input data set     00007600
*                 name and job name.  When the data set name is found   00007700
*                 in the table AND the requestor's jobname is           00007800
*                 authorized, the request is set eligible.  Then the    00007900
*                 RETAIN indicator is established for the data set.     00008000
*                 The return code is set to zero and control is passed  00008100
*                 back to DLF.                                          00008200
*                                                                       00008300
*                 If either the data set name or the job names does not 00008400
*                 match, the request is denied and COFXDLF1 exits with  00008500
*                 a return code of 8.                                   00008600
*                                                                       00008700
*                 Note: this sample exit does not check VOLSER nor      00008800
*                 USERID when determining Hiperbatch eligibility.       00008900
*                                                                       00009000
*                                                                       00009100
*           - CXTFUNDI (3) for DISCONNECT                               00009200
*                                                                       00009300
*                 COFXDLF1 does nothing but return to the caller.       00009400
*                                                                       00009500
*                                                                       00009600
*02*   Recovery-operation: None.                                        00009700
*                                                                       00009800
*01* Notes:                                                             00009900
*                                                                       00010000
*02*   Dependencies: None                                               00010100
*                                                                       00010200
*02*   Character-Code-Dependencies: None                                00010300
*                                                                       00010400
*02*   Restrictions:                                                    00010500
*                                                                       00010600
*        - COFXDLF1 must be re-entrant.                                 00010700
*                                                                       00010800
*        - COFXDLF1 must reside in an APF authorized library in the     00010900
*          LNKLST.                                                      00011000
*                                                                       00011100
*        - The exit must be named COFXDLF1 so it can be invoked by      00011200
*          Hiperbatch even when DLF is not running.  This is needed to  00011300
*          process QUERY requests for jobs that perform updates of VSAM 00011400
*          or sequential data sets.                                     00011500
*                                                                       00011600
*        - When called for CONNECT, QUERY, and DISCONNECT functions     00011700
*          the exit is already running under OPEN / CLOSE processing    00011800
*          and cannot:                                                  00011900
*          1. issue the OPEN or CLOSE macro-instructions.               00012000
*          2. invoke any service that in turn would result in an OPEN   00012100
*             or CLOSE macro being issued.                              00012200
*                                                                       00012300
*                                                                       00012400
*02*   Register-Conventions:                                            00012500
*03*     Registers-Saved: 0-15 via Register 13                          00012600
*03*     Registers-Restored: 0-14                                       00012700
*03*     Code-Register : Register 12                                    00012800
*03*     Data-Register : None                                           00012900
*                                                                       00013000
*02*   Patch-Label: None.                                               00013100
*                                                                       00013200
*01* Module-Type: Procedure                                             00013300
*                                                                       00013400
*02*   Processor: Assembler-H                                           00013500
*                                                                       00013600
*02*   Module-Size:  See assembler External Symbol Dictionary.          00013700
*                                                                       00013800
*02*   Attributes:                                                      00013900
*03*     Location:      Extended private or extended CSA                00014000
*03*     Key:           0                                               00014100
*03*     State:         Supervisor                                      00014200
*03*     Mode:          Task                                            00014300
*04*     Amode:         31                                              00014400
*04*     Rmode:         Any                                             00014500
*04*     Type:          Reentrant                                       00014600
*03*     Serialization: Enabled / Unlocked                              00014700
*03*     ASC Mode:      Primary                                         00014800
*03*     X-memory mode: HASID=PASID=SASID                               00014900
*                                                                       00015000
*01* Entry-Point: COFXDLF1                                              00015100
*                                                                       00015200
*02*   Purpose: See "Function" topic.                                   00015300
*03*     Operation: See main "Operation" topic.                         00015400
*03*     Attributes: See main "Attributes" topic.                       00015500
*                                                                       00015600
*02*   Linkage: BALR R15                                                00015700
*03*     Callers: DLF                                                   00015800
*                                                                       00015900
*03*     Entry-Registers:                                               00016000
*      Register       0 - Irrelevant                                    00016100
*      Register       1 - Address of a parameter list containing the    00016200
*                         address of the CXT parameter area             00016300
*      Registers   2-12 - Irrelevant                                    00016400
*      Register      13 - Address of standard 72 byte save area         00016500
*      Register      14 - Return address                                00016600
*      Register      15 - Entry address of COFXDLF1                     00016700
*                                                                       00016800
*02*   Input:                                                           00016900
*                                                                       00017000
*      Register 1 points to a parameter list that contains a pointer to 00017100
*      the DLF exit parameter area (CXT).  Field CXTFUN in this CXT     00017200
*      parameter list uniquely identifies the function (INIT, CONNECT,  00017300
*      QUERY, or DISCONNECT) called. Refer to dsect COFZCXIT for a      00017400
*      complete description of the CXT.                                 00017500
*                                                                       00017600
*02*   Output:                                                          00017700
*                                                                       00017800
*    Selected fields are set in the CXT parameter list, depending on    00017900
*    the reason for invoking the exit:                                  00018000
*                                                                       00018100
*    CXTRTAIN  this bit is set when the data set is eligible for        00018200
*              CONNECT and is determined to be retainable, as           00018300
*              determined by the value in the data set eilgible table.  00018400
*                                                                       00018500
*    CXTDSMAX  is used upon return from the first QUERY or CONNECT      00018600
*              call to determine the size of the internal table that    00018700
*              will be used by Hiperbatch to process concurrently       00018800
*              QUERIED and CONNECTED data sets.  The value specified    00018900
*              should be large enough to allow Hiperbatch to handle     00019000
*              all concurrent requests, as determined by the            00019100
*              installation defined data set name list.                 00019200
*              The default value is 50;  this program sets the value    00019300
*              to 100.                                                  00019400
*                                                                       00019500
*    A return code is also returned in register 15 for QUERY and        00019600
*    CONNECT calls:                                                     00019700
*                                                                       00019800
*    RC = 0   when the data set is eligible for CONNECT or QUERY        00019900
*    RC = 8   when the data set is NOT eligible for CONNECT or QUERY    00020000
*                                                                       00020100
*    Refer to MVS/ESA System Programming Library - Installation         00020200
*    Exits, GC28-1836, for a detailed description of input and          00020300
*    output to the DLF CONNECT/DISCONNECT exit.                         00020400
*                                                                       00020500
*                                                                       00020600
*                                                                       00020700
*02*   Exit-Normal: Returns to the caller.                              00020800
*03*     Conditions: Requested function complete.                       00020900
*03*     Exit-Registers:                                                00021000
*         Registers   0-14 - Restored                                   00021200
*         Register      15 - Return code                                00021300
*                                                                       00021400
*03*     Return-Codes:                                                  00021500
*      Reg15=0,  when the data set is eligible for CONNECT or QUERY     00021600
*      Reg15=8,  when the data set is not eligible for CONNECT or QUERY 00021700
*                                                                       00021800
*        Reason-Codes: None.                                            00021900
*                                                                       00022000
*02*   Exit-Error: No exit error conditions.                            00022100
*                                                                       00022200
*                                                                       00022300
*01* External-References:                                               00022400
*                                                                       00022500
*02*   Routines: None.                                                  00022600
*                                                                       00022700
*02*   Data-Areas: None.                                                00022800
*                                                                       00022900
*02*   Control-Blocks:                                                  00023000
*        Common Name/Use    Macro ID   Full Name                        00023100
*        ---------------    --------   ---------                        00023200
*        CVT          R     CVT        Communication Vector Table       00023300
*        CXT        R,W     COFZCXIT   DLF exit parameter list          00023400
*                                                                       00023700
*        (C=Create, R=Read, W=Write, D=Delete)                          00023800
*                                                                       00023900
*                                                                       00024000
*                                                                       00024100
*01* Tables:                                                            00024200
*                                                                       00024300
*  DS_TABLE - internal table which contains the list of data set        00024400
*             names and job names that are eligible for Hiperbatch      00024500
*             processing.                                               00024600
*             The format of this table is:                              00024700
*                                                                       00024800
*    Each table entry is 56 bytes long, subdivided as:                  00024900
*                                                                       00025000
*      cols  1-44 : data set name                                       00025100
*      cols 46-53 : jobname                                             00025200
*      col     55 : 'R' if retain=yes, blank otherwise                  00025300
*                                                                       00025400
*    Data set and job names can end with an asterisk ('*') in which     00025500
*    case the comparison is performed only until the character          00025600
*    preceding the asterisk.  This provides a way to specify            00025700
*    generic dataset names and/or job names.                            00025800
*    Note that a jobname of only asterisk ('*') may be specified to     00025900
*    allow all jobs to use Hiperbatch for the specified data set.       00026000
*    Note, also, that a data set name of '*' is not allowed in this     00026100
*    program.                                                           00026200
*                                                                       00026220
*                                                                       00026230
*                                                                       00026300
*01* Macros-Executable:                                                 00026400
*      WTO                                                              00026600
*                                                                       00026700
*01* Serialization: None.                                               00026800
*                                                                       00026900
*01* Change-Activity:                                                   00027000
*    $00=OY28154, JBB3313, 900302, PDG1: Sample DLF Installation Exit   00027100
*                                                                       00027200
*01* Messages:                                                          00027300
*                                                                       00027400
*   DLFX001I HIPERBATCH INOPERATIVE.  MOVE PAGE FACILITY NOT INSTALLED. 00027500
*                                                                       00027600
*       Explanation:                                                    00027610
*         This is an information message sent to the system programmer  00027620
*         console. It is issued when DLF calls COFXDLF1 for the INIT    00027630
*         function and the exit determines that the hardware move-page  00027640
*         facility is not installed.  Without the move-page facility,   00027650
*         Hiperbatch cannot process.                                    00027660
*                                                                       00027670
*       Operator Action: None.                                          00027680
*                                                                       00027690
*       Possible correction:                                            00027691
*         Ensure that DLF/Hiperbatch is running                         00027692
*         on a processor that has the move-page                         00027693
*         facility installed.                                           00027694
*                                                                       00028900
*                                                                       00029000
*                                                                       00029100
*01* Abend-Codes: None.                                                 00029200
*01* Wait-State-Codes: None.                                            00029300
*                                                                       00029400
*01* SYSGEN-INFORMATION:                                                00029500
*02*   LOAD-MODULE-NAME:     COFXDLF1                                   00029600
*02*   CSECT-NAME:           COFXDLF1                                   00029700
*02*   SYSTEM-LIBRARY:       SYS1.SAMPLIB                               00029800
*02*   DISTRIBUTION-LIBRARY: ASAMPLIB                                   00029900
*                                                                       00030000
*                                                                       00030100
*01* INSTALLATION-PROCEDURE:                                            00030200
*                                                                       00030300
*      In order to install and run this sample DLF installation exit,   00030400
*      perform the following steps:                                     00030500
*                                                                       00030600
*       1. Modify the Hiperbatch eligibility table in COFXDLF1.  This   00030700
*          table is meant to reflect the data set names and job names   00030800
*          which are applicable for a particular installation's         00030900
*          Hiperbatch processing.                                       00031000
*                                                                       00031100
*       2. Assemble and link-edit the updated COFXDLF1 module.          00031200
*                                                                       00031300
*          Notes:                                                       00031400
*           (a) Use assembler-H to assemble the module.                 00031500
*           (b) Link-edit the module into its own load module, with     00031600
*               the module name as the load module name.                00031700
*           (c) The module must be link-edited with AC=1 and RMODE=31.  00031800
*               The link-edit parameters are:                           00031900
*               (LIST,XREF,LET,RENT,REFR,REUS,AC=1,RMODE=ANY,AMODE=31)  00032000
*                                                                       00032100
*                                                                       00032200
*       3. Refer to the following publications for an explanation       00032300
*          of how to use DLF and Hiperbatch:                            00032400
*                                                                       00032500
*          o  "MVS/ESA Operations: System Commands", chapter 4          00032600
*              for an explanation of the following:                     00032610
*             - starting DLF (see page 4-228).                          00032620
*             - modifying the DLF address space Hiperbatch attributes   00032630
*               (see page 4-134).                                       00032640
*             - displaying DLF (see page 4-70).                         00032650
*             - stopping DLF (see page 4-230).                          00032660
*                                                                       00032670
*          o  "MVS/ESA SPL: Installation Exits", section 2 for an       00032680
*             explanation of the DLF installation exit interface        00032690
*             (see pages 33-40).                                        00032691
*                                                                       00032692
*          o  Document GC28-1200 when available.  This new publication  00032693
*             provides an overview of Hiperbatch.                       00032694
*                                                                       00032695
*                                                                       00032700
*                                                                       00032800
****** END OF SPECIFICATIONS *****************************************/ 00032900
         EJECT                                                          00033000
*                                                                       00033100
*********************************************************************** 00033200
*                                                                     * 00033300
*        Housekeeping - standard entry linkage                        * 00033400
*                                                                     * 00033500
*********************************************************************** 00033600
*                                                                       00033700
COFXDLF1 RSECT ,                                                        00033800
COFXDLF1 AMODE 31                                                       00033900
COFXDLF1 RMODE ANY                                                      00034000
         USING *,R15                                                    00034100
         B     SKPNMVER                                                 00034200
         DROP  R15                                                      00034300
         DC    AL1(SKPNMVER-*-1)                                        00034400
         DC    C'COFXDLF1 &SYSDATE &SYSTIME'                            00034500
SKPNMVER EQU   *                                                        00034600
         STM   R14,R12,12(R13)                                          00034700
         LR    R12,R15                                                  00034800
         USING COFXDLF1,R12                                             00034900
*                                                                       00035000
*********************************************************************** 00035010
*                                                                       00035020
*              Set defaults for Hiperbatch:                             00035021
*              - Set the maximum number of data sets which Hiperbatch   00035022
*                can process.                                           00035023
*              - Set the default data set attribute of non-RETAIN.      00035024
*                                                                       00035026
*********************************************************************** 00035030
*                                                                       00035040
         L     CXTPTR,0(R01)                                            00035100
         USING CXT,CXTPTR              Set addressability to CXT        00035200
         MVC   CXTDSMAX,DS_MAX         Set number of data sets which    00035300
*                                      can be processed by Hiperbatch   00035400
*                                      simultaneously to 100.           00035500
*                                                                       00035600
*                                                                       00035620
         L     R09_TABLE_NUM_ENT,TABLE_NUM_ENT  Set # entries in table  00035700
         NI    CXTDSCFD,255-CXTRTAIN   Assume no retain for now         00035800
         EJECT                                                          00035810
*                                                                       00035900
*********************************************************************** 00035910
*                                                                       00035920
*              Determine the function selected (INIT, QUERY, CONNECT,   00036000
*              or DISCONNECT):                                          00036100
*                                                                       00036200
*********************************************************************** 00036210
*                                                                       00036220
         CLI   CXTFUN,CXTFUNIN         INIT function                    00036300
         BE    FUNINIT                                                  00036400
         CLI   CXTFUN,CXTFUNQU         QUERY function                   00036500
         BE    FUNQUER                                                  00036600
         CLI   CXTFUN,CXTFUNCO         CONNECT function                 00036700
         BE    FUNCONN                                                  00036800
         CLI   CXTFUN,CXTFUNDI         DISCONNECT function              00036900
         BE    FUNDISC                                                  00037000
         B     RETURN_RC8              Invalid function                 00037100
*                                                                       00037200
*********************************************************************** 00037300
*                                                                       00037400
*     When CXTFUN=CXTFUNIN, initialization function:                    00037500
*                                                                       00037600
*********************************************************************** 00037700
*                                                                       00037800
FUNINIT  DS    0H                                                       00037900
         L     R03,CVTPTR              Set addressability to CVT        00038000
         USING CVT,R03                 Set addressability to CVT        00038100
         TM    CVTFLAG1,CVTMVPG        Determine if move-page installed 00038200
         BNZ   RETURN_RC0              Yes: ignore msg and return       00038300
         DROP  R03                     Remove addressability            00038400
*                                                                       00038500
*                                      Issue a WTO to indicate that the 00038600
*                                      move-page facility is not        00038700
*                                      available.                       00038800
*                                                                       00038900
         LA    R01,MSG001                                               00039000
         WTO   MF=(E,(R01))                                             00039100
         B     RETURN_RC0              Return to caller                 00039200
         EJECT                                                          00039300
*                                                                       00039400
*********************************************************************** 00039500
*                                                                       00039600
*     When CXTFUN=CXTFUNQU, QUERY function:                             00039700
*                                                                       00039800
*********************************************************************** 00039900
*                                                                       00040000
FUNQUER  DS    0H                                                       00040100
         LA    ENTRY@,DS_TABLE         Set start of table search        00040200
*                                                                       00040300
*              Search table for match with data set name:               00040400
*                                                                       00040500
         LA    INDEX,1                                                  00040600
         CR    INDEX,R09_TABLE_NUM_ENT Are there any elements in table? 00040700
         BH    RETURN_RC8              No: return to caller             00040800
*                                                                       00040900
TAB_CHK1 DS    0H                      Process table for DSNAME match   00041000
         LA    DS_CLEN,1               Init length of compare for DSN   00041100
         LA    R08,VAL_DSN(ENTRY@)     Init start of DSNAME             00041200
         LA    R11,L'VAL_DSN           Save max length of DSNAME        00041300
DS_LOOP1 DS    0H                      Scan for '*' within DSNAME       00041400
         CLI   0(R08),C'*'             Is the current char a generic?   00041500
         BE    DS_LOOP1_END            Yes: end scan                    00041600
*                                                                       00041700
         LA    R08,1(R08)              Next character in name           00041800
         LA    DS_CLEN,1(DS_CLEN)      Increment length of DSNAME       00041900
         CR    DS_CLEN,R11             Have we scanned entire name      00042000
         BNH   DS_LOOP1                No: Continue scan for '*'        00042100
DS_LOOP1_END DS 0H                     End of data set name scan        00042200
         BCTR  DS_CLEN,0               Compare length is 1 less         00042300
*                                                                       00042400
*                                                                       00042500
*              Determine if the data set name matches with input CXT    00042600
*                                                                       00042700
         LTR   DS_CLEN,DS_CLEN         Is '*' the first character?      00042800
         BNP   NEXT_ENTRY1             Yes: DSNAME is not valid         00042900
         BCTR  DS_CLEN,0               Decr compare-length for CLC      00043000
         EX    DS_CLEN,CLC_DSN         Compare data set names           00043100
         BE    RETURN_RC0              If match: data set is eligible   00043200
*                                      for Hiperbatch.  Return with     00043300
*                                      rc = 0.                          00043400
*                                                                       00043500
NEXT_ENTRY1 DS 0H                                                       00043600
         LA    ENTRY@,L'VALID_ENTRY(ENTRY@) Bump ENTRY@ to next entry   00043700
         LA    INDEX,1(INDEX)           Bump INDEX                      00043800
         CR    INDEX,R09_TABLE_NUM_ENT  End of search thru table?       00043900
         BNH   TAB_CHK1                 No: process for next entry      00044000
*                                                                       00044100
*              End of table.  Return to caller indicating that the      00044200
*              data set is not eligible for Hiperbatch processing.      00044300
         B     RETURN_RC8                                               00044400
         EJECT                                                          00044500
*                                                                       00044600
*********************************************************************** 00044700
*                                                                       00044800
*     When CXTFUN=CXTFUNCO, CONNECT function:                           00044900
*                                                                       00045000
*********************************************************************** 00045100
*                                                                       00045200
FUNCONN  DS    0H                                                       00045300
         LA    ENTRY@,DS_TABLE         Set start of table search        00045400
*                                                                       00045500
*              Search table for match with data set and job names:      00045600
*                                                                       00045700
         LA    INDEX,1                                                  00045800
         CR    INDEX,R09_TABLE_NUM_ENT Are there any elements in table? 00045900
         BH    RETURN_RC8              No: return to caller             00046000
*                                                                       00046100
TAB_CHK2 DS    0H                      Process table for NAME match     00046200
         LA    DS_CLEN,1               Init length of compare for DSN   00046300
         LA    R08,VAL_DSN(ENTRY@)     Init start of DSNAME             00046400
         LA    R11,L'VAL_DSN           Save max length of DSNAME        00046500
DS_LOOP2 DS    0H                                                       00046600
         CLI   0(R08),C'*'             Is the current char a generic?   00046700
         BE    DS_LOOP2_END            Yes: end of scan                 00046800
*                                                                       00046900
         LA    R08,1(R08)              Next character in name           00047000
         LA    DS_CLEN,1(DS_CLEN)      Increment length of DSNAME       00047100
         CR    DS_CLEN,R11             Have we scanned entire name      00047200
         BNH   DS_LOOP2                No: Continue scan for '*'        00047300
DS_LOOP2_END DS 0H                     End of data set name scan        00047400
         BCTR  DS_CLEN,0               Compare length is 1 less         00047500
         LTR   DS_CLEN,DS_CLEN         Is '*' the first character?      00047600
         BNP   NEXT_ENTRY2             Yes: DSNAME is not valid         00047700
*                                                                       00047800
         LA    JN_CLEN,1               Init len of compare for jobname  00047900
         LA    R08,VAL_JOBNM(ENTRY@)   Init start of job name           00048000
         LA    R11,L'VAL_JOBNM         Save max length of job name      00048100
JOB_LOOP DS    0H                                                       00048200
         CLI   0(R08),C'*'             Is the current char a generic?   00048300
         BE    JOB_LOOP_END            Yes: end of scan                 00048400
*                                                                       00048500
         LA    R08,1(R08)              Next character in name           00048600
         LA    JN_CLEN,1(JN_CLEN)      Increment length of job name     00048700
         CR    JN_CLEN,R11             Have we scanned entire name      00048800
         BNH   JOB_LOOP                No: Continue scan for '*'        00048900
JOB_LOOP_END DS 0H                     End of job name scan             00049000
         BCTR  JN_CLEN,0               Compare length is 1 less         00049100
*                                                                       00049200
*                                                                       00049300
*              Determine if the data set name and job name both match   00049400
*              with input CXT                                           00049500
*                                                                       00049600
         BCTR  DS_CLEN,0               Decr compare-length for CLC      00049700
         EX    DS_CLEN,CLC_DSN         Compare data set names           00049800
         BNE   NEXT_ENTRY2             No match: process next entry     00049900
         LTR   JN_CLEN,JN_CLEN         '*' as first char for job name?  00050000
         BZ    JOB_OK                  Yes: accept job name             00050100
         BCTR  JN_CLEN,0               Decr compare-length for CLC      00050200
         EX    JN_CLEN,CLC_JOBNM       Compare job names                00050300
         BNE   NEXT_ENTRY2             No match: process next entry     00050400
JOB_OK   DS    0H                                                       00050500
*                                                                       00050600
*              Both data set and job names match, so this entry is      00050700
*              eligible for Hiperbatch processing.                      00050800
*              Now, determine RETAIN status and return to caller.       00050900
*                                                                       00051000
         CLI   FLAG_RETAIN(ENTRY@),C'r'  'r' to indicate retain         00051100
         BE    SET_RTAIN                                                00051200
         CLI   FLAG_RETAIN(ENTRY@),C'R'  'R' to indicate retain         00051300
         BNE   RETURN_RC0                Not retained, just return      00051400
SET_RTAIN DS   0H                                                       00051500
         OI    CXTDSCFD,CXTRTAIN       Indicate data set is RETAINed    00051600
         B     RETURN_RC0              Return to caller                 00051700
*                                                                       00051800
NEXT_ENTRY2 DS 0H                                                       00051900
         LA    ENTRY@,L'VALID_ENTRY(ENTRY@) Bump ENTRY@ to next entry   00052000
         LA    INDEX,1(INDEX)           Bump INDEX                      00052100
         CR    INDEX,R09_TABLE_NUM_ENT  End of search thru table?       00052200
         BNH   TAB_CHK2                 No: process for next entry      00052300
*                                                                       00052400
*              End of table.  Return to caller indicating that the      00052500
*              data set is not eligible for Hiperbatch processing.      00052600
         B     RETURN_RC8                                               00052700
         EJECT                                                          00052800
*                                                                       00052900
*********************************************************************** 00053000
*                                                                       00053100
*     When CXTFUN=CXTFUNDI, disconnect function: return to caller       00053200
*                                                                       00053300
*********************************************************************** 00053400
*                                                                       00053500
FUNDISC  DS    0H                                                       00053600
         B     RETURN_RC0              Return to caller                 00053700
*                                                                       00053800
         EJECT                                                          00053900
*********************************************************************** 00054000
*                                                                     * 00054100
*        Return - standard exit linkage                               * 00054200
*                                                                     * 00054300
*********************************************************************** 00054400
*                                                                       00054500
RETURN_RC8 DS    0H                                                     00054600
         LM    R14,R12,12(R13)                                          00054700
         LA    R15,8                                                    00054800
         BR    R14                                                      00054900
*                                                                       00055000
RETURN_RC0 DS    0H                                                     00055100
         LM    R14,R12,12(R13)                                          00055200
         SLR   R15,R15                                                  00055300
         BR    R14                                                      00055400
         EJECT                                                          00055500
CLC_DSN   CLC  VAL_DSN(0,ENTRY@),CXTDSN                                 00055600
CLC_JOBNM CLC  VAL_JOBNM(0,ENTRY@),CXTJOBNM                             00055700
         DS    0D                                                       00055800
         LTORG                                                          00055900
MSG001   WTO   ('DLFX001I HIPERBATCH INOPERATIVE.  MOVE PAGE FACILITY N*00056000
               OT INSTALLED.'),DESC=(4),ROUTCDE=(10),MF=L               00056100
*                                                                       00056200
*********************************************************************** 00056300
*                                                                     * 00056400
*  Eligible data set name table...each entry is 56 bytes long         * 00056500
*                                                                     * 00056600
*    cols  1-44 : data set name                                       * 00056700
*    cols 46-53 : jobname                                             * 00056800
*    col     55 : 'R' if retain=yes, blank otherwise                  * 00056900
*                                                                     * 00057000
*  Data set and job names can end with an asterisk ('*') in which     * 00057100
*  case the comparison is performed only until the character          * 00057200
*  preceding the asterisk.  This provides a way to specify            * 00057300
*  generic dataset names and/or job names.                            * 00057400
*  Also, a jobname of only asterisk ('*') may be specified to         * 00057500
*  allow all jobs to use Hiperbatch for the specified data set.       * 00057600
*                                                                     * 00057700
*                                                                     * 00057800
*        |--------DATASET NAME----------------------| |--JOB-| R      * 00057900
*        ----+----1----+----2----+----3----+----4----+----5----+----6 * 00058000
*                                                                     * 00058100
*********************************************************************** 00058200
*                                                                       00058300
VALID_ENTRY EQU 0,56,C'C'                                               00058400
VAL_DSN     EQU VALID_ENTRY,44,C'C'                                     00058500
VAL_JOBNM   EQU VALID_ENTRY+45,8,C'C'                                   00058600
FLAG_RETAIN EQU VALID_ENTRY+54,1,C'C'                                   00058700
ENTRY_LEN   EQU L'VALID_ENTRY                                           00058800
*                                                                       00058900
DS_MAX   DC    F'100'                                                   00059000
TABLE_NUM_ENT DC A(TABLE_SIZE/ENTRY_LEN)                                00059100
DS_TABLE DS    0F                                                       00059200
 DC CL56'WYL.GG.AOS.*                                 HYPT*      '      00059300
 DC CL56'WYL.GG.SRS.*                                 HYPRT*   R '      00059400
 DC CL56'VTST.GG.SRS.*                                HYPT*      '      00059500
 DC CL56'VTST.GG.SRS.*                                HYPR*    R '      00059600
 DC CL56'WYL.CX.DEV.SL.*                              EBMSOL*    '      00059600
 DC CL56'WYL.CY.MNT.EBM                               EBMFG*   R '      00059600
TABLE_SIZE    EQU *-DS_TABLE                                            00060100
R00      EQU   0                                                        00060200
R01      EQU   1                                                        00060300
R02      EQU   2                                                        00060400
R03      EQU   3                                                        00060500
R04      EQU   4                                                        00060600
R05      EQU   5                                                        00060700
R06      EQU   6                                                        00060800
R07      EQU   7                                                        00060900
R08      EQU   8                                                        00061000
R09      EQU   9                                                        00061100
R10      EQU   10                                                       00061200
R11      EQU   11                                                       00061300
R12      EQU   12                                                       00061400
R13      EQU   13                                                       00061500
R14      EQU   14                                                       00061600
R15      EQU   15                                                       00061700
CXTPTR   EQU   R02                     Basing for COFZCXIT (CXT)        00061800
INDEX    EQU   R04                     Index to count table entries     00061900
ENTRY@   EQU   R05                     Pointer to VALID_ENTRY           00062000
DS_CLEN  EQU   R06                     Data set name compare-length     00062100
JN_CLEN  EQU   R07                     Job name compare-length          00062200
R09_TABLE_NUM_ENT EQU R09                                               00062300
         DS    0D                                                       00062400
MODLEN   EQU   *-COFXDLF1                                               00062500
         EJECT                                                          00062600
         CVT   DSECT=YES                                                00062700
         EJECT                                                          00062800
         COPY  COFZCXIT                                                 00062900
         END   COFXDLF1                                                 00063000
//LKED.SYSLMOD DD DSN=SYS1.LPALIBD(COFXDLF1),DISP=SHR
