//ESPY522B JOB (GG$JHA),'ISPY 5.2.2 NSTL',                         V510 00010000
//            CLASS=B,REGION=4M,MSGCLASS=A,MSGLEVEL=(1,1)          V510 00020000
/*JOBPARM HOLD=OUTPUT,L=131                                        V510 00030000
//*--------------------------------------------------------------* V510 00040000
//*  job 2 of 2                                                         00050000
//*  1 of 2 jobs:   RECEIVE AND APPLY CHECK.  (esPY522A)                00060000
//*  2 of 2 jobs:   Code dd's for target libs and APPLY. (esPY522B)     00060100
//*                                                                     00060200
//* JCL SOURCE : SYS2.EYESPY.TSTV510.JCLLIB(ES01I008)            * V510 00060300
//* JCL SOURCE : SYS2.EYESPY.TSTV510.JCLLIB(ES01I08A)            * V510 00060400
//* SKELETON   : ESPYIS61                                        * V510 00060500
//* TIMESTAMP  : DATE : 01/11/21   TIME : 14:58                  * V510 00060600
//*--------------------------------------------------------------* V510 00060700
//*        MMMMM                        MMMMM                    * V510 00060800
//*       M        M                   M        MMMMM   M   M    * V510 00060900
//*      MMMMM  MMMMM  MMMM    MM MM   MMMMM   M   M   M   M     * V510 00061000
//*         M    M    M  M     M         M    MMMMM   MMMMM      * V510 00061100
//*    MMMMM    M     MMM M   M     MMMMM    M         M         * V510 00061200
//*   --------------------------------------------------         * V510 00061300
//*    Enterprise Dump Management System - Version V510          * V510 00061400
//*    (C) Copyright 1994 - 2000 by SERENA Software, Inc.        * V510 00061500
//*--------------------------------------------------------------* V510 00061600
//*       StarSpy/390 LE (Language Environment) interface        * V510 00061700
//*       installation job.                                      * V510 00061800
//*--------------------------------------------------------------* V510 00061900
//JCLLIB JCLLIB ORDER=(SYS2.EYESPY.T522.JCLLIB)                    V510 00062000
//*------ S018 ------ LE18 interface installation ---------------- V510 00063000
//S018    EXEC ESPYSMPE,                                           V510 00064000
//        RGN=8M,                                                  V510 00065000
//        CSI=OS390RAU.SMPE.GLOBAL.CSI                             V510 00066000
//S010.SMPPTFIN DD *                                               V510 00067000
++ USERMOD(ESPY001) REWORK(20020305).                                   00068000
++ VER (Z038) FMID(HLE7703) /* FMID MUST MATCH LE'S  */ .               00069000
++ SRC (CEEEXTAN) DISTLIB (ACEESRC1) .                                  00070000
**---------------------------------------------------------------* V510 00080000
**         MMMMM                        MMMMM                    * V510 00090000
**        M        M                   M        MMMMM   M   M    * V510 00100000
**       MMMMM  MMMMM  MMMM    MM MM   MMMMM   M   M   M   M     * V510 00110000
**          M    M    M  M     M         M    MMMMM   MMMMM      * V510 00120000
**     MMMMM    M     MMM M   M     MMMMM    M         M         * V510 00130000
**    --------------------------------------------------         * V510 00140000
**     Enterprise Dump Management System - Version V510          * V510 00150000
**     (C) Copyright 1994 - 2000 by SERENA Software, Inc.        * V510 00160000
**---------------------------------------------------------------* V510 00170000
**       StarSpy/390 LE Abnormal Termination User Exit csect.    * V510 00180000
**---------------------------------------------------------------* V510 00190000
         CEEXAHD                      , User exit header           V510 00200000
         CEEXART  TERMXIT=ESPY9TRM    , Define the StarSpy/390 ATE V510 00210000
         CEEXAST                      , Terminate the list         V510 00220000
         END   ,                                                   V510 00230000
/*                                                                 V510 00240000
//SCEESAMP DD DISP=SHR,DSN=SYS2.EYESPY.T522.MACLIB                      00250000
//SCEERUN  DD DISP=SHR,DSN=SYS1.LINKLIST.SYSD.V2R10                     00260000
//S010.SMPCNTL  DD *                                               V510 00270000
    SET     BDY(MVST100).                                               00280000
    APPLY   S(ESPY001) ASSEM REDO .                                     00290000
/*                                                                 V510 00300000
//*eoj                                                             V510 00310000
