//ESPY522A JOB (GG$JHA),'ISPY 5.1.0 NSTL',                         V510 00010000
//            CLASS=B,REGION=4M,MSGCLASS=A,MSGLEVEL=(1,1)          V510 00020000
/*JOBPARM HOLD=OUTPUT,L=131                                        V510 00030000
//*--------------------------------------------------------------* V510 00040000
//*  1 of 2 jobs:   RECEIVE AND APPLY CHECK.  (esPYT22A)                00050000
//*  2 of 2 jobs:   Code dd's for target libs and APPLY. (esPY522B)     00060000
//*                                                                     00060100
//* COPIED FROM BELOW.                                                  00060200
//* JCL SOURCE : SYS2.EYESPY.TSTV510.JCLLIB(ES01I008)            * V510 00060300
//* SKELETON   : ESPYIS61                                        * V510 00060400
//* TIMESTAMP  : DATE : 01/11/21   TIME : 14:58                  * V510 00060500
//*--------------------------------------------------------------* V510 00060600
//*        MMMMM                        MMMMM                    * V510 00060700
//*       M        M                   M        MMMMM   M   M    * V510 00060800
//*      MMMMM  MMMMM  MMMM    MM MM   MMMMM   M   M   M   M     * V510 00060900
//*         M    M    M  M     M         M    MMMMM   MMMMM      * V510 00061000
//*    MMMMM    M     MMM M   M     MMMMM    M         M         * V510 00061100
//*   --------------------------------------------------         * V510 00061200
//*    Enterprise Dump Management System - Version V510          * V510 00061300
//*    (C) Copyright 1994 - 2000 by SERENA Software, Inc.        * V510 00061400
//*--------------------------------------------------------------* V510 00061500
//*       StarSpy/390 LE (Language Environment) interface        * V510 00061600
//*       installation job.                                      * V510 00061700
//*--------------------------------------------------------------* V510 00061800
//JCLLIB JCLLIB ORDER=(SYS2.EYESPY.T522.JCLLIB)                    V510 00061900
//*------ S018 ------ LE18 interface installation ---------------- V510 00062000
//S018    EXEC ESPYSMPE,                                           V510 00063000
//        RGN=4M,                                                  V510 00064000
//        CSI=OS390RAU.SMPE.GLOBAL.CSI                             V510 00065000
//S010.SMPPTFIN DD *                                               V510 00066000
++ USERMOD(ESPY001) REWORK(20020305).                                   00067000
++ VER (Z038) FMID(HLE7703)  /* FMID MUST MATCH LE'S */ .               00068000
++ SRC (CEEEXTAN) DISTLIB (ACEESRC1) .                                  00069000
**---------------------------------------------------------------* V510 00070000
**         MMMMM                        MMMMM                    * V510 00080000
**        M        M                   M        MMMMM   M   M    * V510 00090000
**       MMMMM  MMMMM  MMMM    MM MM   MMMMM   M   M   M   M     * V510 00100000
**          M    M    M  M     M         M    MMMMM   MMMMM      * V510 00110000
**     MMMMM    M     MMM M   M     MMMMM    M         M         * V510 00120000
**    --------------------------------------------------         * V510 00130000
**     Enterprise Dump Management System - Version V510          * V510 00140000
**     (C) Copyright 1994 - 2000 by SERENA Software, Inc.        * V510 00150000
**---------------------------------------------------------------* V510 00160000
**       StarSpy/390 LE Abnormal Termination User Exit csect.    * V510 00170000
**---------------------------------------------------------------* V510 00180000
         CEEXAHD                      , User exit header           V510 00190000
         CEEXART  TERMXIT=ESPY9TRM    , Define the StarSpy/390 ATE V510 00200000
         CEEXAST                      , Terminate the list         V510 00210000
         END   ,                                                   V510 00220000
/*                                                                 V510 00230000
//S010.SMPCNTL  DD *                                               V510 00240000
    SET     BDY(GLOBAL).                                                00250000
    RECEIVE S(ESPY001) LIST SYSMODS.                                    00260000
    SET     BDY(MVST100).                                               00270000
    APPLY   S(ESPY001) ASSEM REDO CHECK.                                00280000
/*                                                                 V510 00290000
//*eoj                                                             V510 00300000
