//RDSNT    JOB  (GG$JCC),MSGLEVEL=(1,1),USER=GG$JCC,NOTIFY=GG$JCC
//STEP1    EXEC ASMCL
//*ASM.SYSLIB DD DSN=SYS1.MACLIB,DISP=SHR,UNIT=DISK,VOL=SER=SYSXAM
//ASM.SYSIN DD  *
ICHRDSNT CSECT
ICHRDSNT AMODE 31
ICHRDSNT RMODE ANY
         DC    AL1(1)             INDICATES ONE RACF DATA SET
         DC    CL44'SYS1.RACF.SYSG'    PRIMARY RACF DS NAME
         DC    CL44'SYS1.RACFBACK.SYSG'  BACKUP RACF DS NAME
         DC    AL1(255)           # RESIDENT INDEX BLOCKS
         DC    X'81'              Duplex, no stats, rsdnt data blks
         END
//LKED.SYSLMOD  DD DSN=SYS1.LINKLIST.SYSG,DISP=SHR,UNIT=3390,
//             VOL=SER=SYSG01
//LKED.SYSIN    DD *
      NAME ICHRDSNT(R)
/*
