//RDSNTSYD JOB  ,'DATA SET NAME TABLE',MSGLEVEL=(1,1)
//STEP1    EXEC ASMCL
//*ASM.SYSLIB DD DSN=SYS1.MACLIB,DISP=SHR,UNIT=DISK,VOL=SER=SYSXAM
//ASM.SYSIN DD  *
ICHRDSNT CSECT
ICHRDSNT AMODE 31
ICHRDSNT RMODE ANY
         DC    AL1(1)             INDICATES ONE RACF DATA SET
         DC    CL44'SYS1.RACF.SYSD'      PRIMARY RACF DS NAME
         DC    CL44'SYS1.RACFBACK.SYSD'  BACKUP RACF DS NAME
         DC    AL1(255)           # RESIDENT INDEX BLOCKS
         DC    X'81'              Duplex, no stats, rsdnt data blks
         END
//LKED.SYSLMOD  DD DISP=SHR,DSN=SYS1.LINKLIST.SYSD,SPACE=
//LKED.SYSIN    DD *
      NAME ICHRDSNT(R)
