ACSPARM  DS    0F                  ACCESS SVC PARM LIST                         
ACSPFLGS DC    A(0)                PTR TO ACWOPER & ACWMODE BYTES  (2)          
ACSPDSN  DC    A(0)                PTR TO DSNAME  (44)                          
ACSPDSCB DC    A(0)                PTR TO F1 DSCB (96) OR VOL. SER (6)          
ACSPACCT DC    A(0)                PTR TO ACCT AS UUUGGSSIA  (9)                
