*                                                                               
*        OPEN USER ACCOUNT LIST    (UAL)                                        
*              POINTED TO IN JFCB FROM INTERACTIVE SYSTEMS                      
*                                                                               
ACSUAL   DS    0F                                                               
UALLEN   DC    Y(UALSIZE)          LEN OF DEFINED UAL                           
UALAUTH  DC    XL9'00'   USER (LOGON) ACCOUNT, AS UUUGGSSIA                     
UALKEY   DC    XL5'00'   ACCT USED FOR KEYWORD PROMPT OR ZERO                   
UALODSCB DC    A(0)      PTR TO OLD DSCB FOR ACCESS STATUS                      
UALSIZE  EQU   *-ACSUAL                LENGTH OF UAL                            
