*                                                                               
**  ASYNC Channel Commands                                                      
*                                                                               
ACENBL   EQU   X'27'               enable                                       
ACDSBL   EQU   X'2F'               disable                                      
ACNOP    EQU   X'03'               nop                                          
ACPREP   EQU   X'06'               prepare                                      
ACWR     EQU   X'01'               write                                        
ACRD     EQU   X'0A'               read inhibit (no timeout)                    
ACRDT    EQU   X'02'               read                                         
ACBRK    EQU   X'0D'               break (pttc only)                            
         SPACE 2                                                                
*                                                                               
**  ASYNC Trace Format                                                          
*                                                                               
ATRC     RECORD BEGIN                                                           
ATRCCLCK DS    D                   STCK clock                                   
*                                                                               
*  if PIBTRC...                                                                 
ATRCPCMD DS    X                   I/O command                                  
ATRCPCSW DS    XL2                 CSW status bytes                             
ATRCPSNS DS    X                   sense byte                                   
         DS    XL4                 reserved                                     
ATRCP    EQU   ATRCCLCK,*-ATRCCLCK,C'X'                                         
*                                                                               
         ORG   ATRCCLCK+8                                                       
ATRCNAME DS    CL8                 trace name                                   
ATRCUNIT DS    CL3                 unit address                                 
         DS    X                   reserved                                     
ATRCDATA EQU   *                                                                
*                                                                               
*  If ATRCNAME = 'ASYN'...                                                      
         ORG   ATRCDATA                                                         
ATRCSID  DS    F                   session id                                   
ATRCSACC DS    CL5                 session uuugg                                
ATRCCMD  DS    X                   pdbcmd                                       
ATRCCPL  DS    XL2                 pdbcpl (asynpost only)                       
ATRCTLEN DS    H                   pdbleng                                      
ATRCTEXT DS    CL20                pdbtext                                      
*                                                                               
*  If ATRCNAME = 'IO'...                                                        
         ORG   ATRCDATA                                                         
ATRCEIOH DS    X                   IOHALT return code                           
         DS    0F                                                               
ATRCECCW DS    XL(8*2)             CCWs                                         
*                                                                               
*  If TRCNAME = 'APP'...                                                        
         ORG   ATRCDATA                                                         
ATRCATYP DS    X                   appendage type                               
ATRCACOD DS    X                   appendage code                               
         DS    0F                                                               
ATRCAOCC DS    XL8                 old CCW                                      
ATRCANCC DS    XL8                 new CCW                                      
ATRCACSW DS    XL2                 CSW status bytes                             
ATRCASNS DS    X                   sense byte                                   
ATRCACPL DS    H                   completion flags                             
ATRCARC  DS    H                   return code                                  
         END                                                                    
