*box                                                                            
*                                                                               
*  User-ID/Password/Kerb                                                        
*        Function request block for data transmission                           
*                                                                               
         SPACE 2                                                                
CHRFINIT EQU   00,4,C'C'           Christa initialize function                  
CHRFSEND EQU   04,4,C'C'           Christa send/receive transaction             
CHRFCLOS EQU   08,4,C'C'           Christa terminate processing                 
CHRFRSRV EQU   12,4,C'C'           Christa ---reserved---                       
CHRFPPRO EQU   16,4,C'C'           Christa post-processing                      
         SPACE ,                                                                
USRREQ   RECORD BEGIN              User-id request block                        
REQID    DC    CL4'USIO'           Request block identifier                     
REQLEN   DC    A(0)                Total length of transaction                  
REQTYPE  DC    A(0)                Request function                             
RQTREAD        EQU    0              - Request read                             
RQTADD         EQU    4              - Request add                              
RQTUPD         EQU    8              - Request update                           
RQTDEL         EQU   12              - Request delete record                    
RQTSTAT        EQU   16              - Request statistics                       
RQTDUMP        EQU   20              - Request file dump                        
RQTCDEL        EQU   24              - Request cache record delete              
         SPACE ,                                                                
REQFLAGS FLAG  ,                   Option flags (0)                             
         FLAG  REQFID                - Request is for User-ID                   
         FLAG  REQFKWR               - Request is for KWR record                
         FLAG  REQFIMRET             - Request immediate return                 
         FLAG  REQFWRTCH             - Okay to write-cache record               
         FLAG  REQFLUPD              - Read for update                          
         FLAG  REQFRNEXT             - Read "next" record                       
         FLAG  REQFLENRQ             - Release exclusive control                
         FLAG  REQFKerb              - Request is for Kerb ID                   
REQFLAG1 FLAG  ,                   Option flags (1)                             
         FLAG  REQFICACHL            - Inhibit cache loading                    
         DC    AL2(0)              Reserved space (two bytes)                   
         SPACE ,                                                                
REQR15   DC    A(0)                R15 return from VSAM request                 
REQREAS  DC    A(0)                VSAM reason code                             
REQRETRN DC    A(0)                General return code                          
REQRSUC        EQU   0               - Successful operation                     
REQRRNF        EQU   4               - Record not found                         
REQRDUP        EQU   8               - Duplicate key                            
REQRBSY        EQU  12               - Record busy                              
REQRFUL        EQU  16               - File full                                
REQRUNK        EQU  20               - Unknown error condition                  
REQRIOE        EQU  24               - I/O error (Physical)                     
REQRNA         EQU  28               - Insufficient authority                   
REQROUTW       EQU  32               - Outstanding request                      
REQRSERR       EQU  36               - SCOM processing error                    
REQREOF        EQU  40               - End of file, (key high)                  
REQRBADP       EQU  44               - Invalid USIO control block               
REQRERRS EQU   REQR15,12,C'X'      Define error return area                     
         SPACE ,                                                                
REQTIMEO DC    A(0)                Time-out value (.01 seconds)                 
REQELAP  DC    A(0)                Elapsed time for request                     
REQECBPT DC    A(0)                Address of completion ECB                    
         DC    A(0)                                                             
         DC    1A(0)               Reserved                                     
USRHDR   EQU   USRREQ,*-REQID,C'C' Length of transaction header                 
REQDATA  DC    512X'00'            Record key+data block                        
         SPACE ,                                                                
USRREQL  EQU   *-USRREQ            Define length of request block               
         END   ,                                                                
