*box                                                                            
*                                                                               
*  Format of the READ DEVICE CHARACTERISTICS information returned               
*  by the IBM 3990-6 control unit as defined in                                 
*                                                                               
*     IBM documentation:                                                        
*         IBM 3990 Storage Control Reference (Models 1, 2, and 3)               
*         Document Number GA32-0099-06                                          
*                                                                               
*                                                                               
         SPACE 2                                                                
D3990RDC RECORD BEGIN              Read device characteristics                  
RDC_SCTY DC    XL2'3990'    0-1    Storage control type                         
RDC_SCMD DC    XL1'00'        2    Storage control model number                 
RDC_DEVT DC    XL2'3390'    3-4    Device type                                  
RDC_MODL DC    XL1'00'        5    Device model                                 
RDC_SCDF DC    0XL4'00'     6-9    Storage control and device fac.              
RDC_SCD1 FLAG  ,                                                                
RDC_SCD2 FLAG  ,                                                                
RDC_SCD3 FLAG  ,                                                                
RDC_SCD4 FLAG  ,               9                                                
         FLAG  RDC_SSCFW           SUBSYSTEMN CACHE FAST WRITE                  
         FLAG  RDC_SCF4R1          RESERVED                                     
         FLAG  RDC_SCFRR2          RESERVED                                     
         FLAG  RDC_SSC             SUBSYSTEM SUPPORTS CACHING                   
         FLAG  RDC_SSDC            SUBSYSTEM SUPPORTS DUAL COPY                 
         FLAG  RDC_SSDFW           SUBSYSTEM SUPPORTS DASD FAST WRITE           
         FLAG  RDC_SSRA            SUBSYSTEM SUPPORTS RESET ALLEG               
         FLAG  RDC_SS32            SUBSYSTEM TRANSFERS 32 BYTES                 
RDC_DCC  DC    XL1'00'        10   Device class code                            
RDC_DTC  DC    XL1'00'        11   Device type code                             
RDC_NPC  DC    XL1'00'     12-13   Number of primary cylinders                  
RDC_TPC  DC    XL1'00'     14-15   Tracks per cylinder                          
RDC_NS   DC    XL1'00'        16   Number of sectors                            
RDC_TRKL DC    XL3'000000' 17-19   Track length                                 
RDC_HAR0 DC    XL2'0000'   20-21   Length of ha and r0                          
RDC_TCC  DC    XL1'00'        22   Track capactiy calculation factor            
RDC_TCCS DC    XL5'00'     23-27   Track capactiy calc (f1-f5)                  
RDC_FAC  DC    XL2'0000'   28-29   First alternate cylinder address             
RDC_NAT  DC    XL2'0000'   30-31   Number of alternate tracks                   
RDC_FDC  DC    XL2'0000'   32-33   First diagnostic cylinder                    
RDC_NDT  DC    XL2'0000'   34-35   Number of dignostic tracks                   
RDC_NDSC DC    XL2'0000'   36-37   First device support cylinder                
RDC_NDST DC    XL2'0000'   38-39   Number of device support tracks              
RDC_MDR  DC    XL1'00'        40   Mdr record id                                
RDC_OBR  DC    XL1'00'        41   Obr record id                                
RDC_STCT DC    XL1'00'        42   Storage control type code                    
RDC_RTPL DC    XL1'00'        43   Read trackset parameter length               
RDC_MXR0 DC    XL2'0000'   44-45   Maximum record zero length                   
         DC    XL1'00'        46   *** reserved ***                             
RDC_TSSZ DC    XL1'00'        47   Track set size                               
RDC_TCC6 DC    XL1'00'        48   Track capacity calc (F6)                     
RDC_RPSF DC    XL2'0000'   49-50   Rps sector calculation factor                
         DC    XL13'00'    51-63   *** reserved ***                             
         END   ,                                                                
