         MACRO                                                                  
&LBL     DEFINE &SFX,&VAL,&LEN,&DEF                                             
         GBLC  &PRF                                                             
         LCLC  &MNEM,&RESULT                                                    
&PRF     SETC  '&LBL'                                                           
&MNEM    SETC  '&LBL&SFX'                                                       
         AIF   ('&LBL' NE '').DONE                                              
&MNEM    SETC  ''                                                               
.DONE    ANOP                                                                   
&RESULT  SETC  '&DEF'                                                           
         AIF   ('&VAL' EQ '').HEXDEF                                            
&RESULT SETC  '&VAL'                                                            
         AIF   ('&RESULT'(1,1) EQ '#').HEX                                      
         AIF   ('&VAL'(1,1) EQ '@').ADDR                                        
         AIF   (K'&RESULT GT &LEN).MN1                                          
&MNEM    DC    CL&LEN'&RESULT'                                                  
         MEXIT                                                                  
.HEX     ANOP                                                                   
&RESULT  SETC  '&VAL'(2,K'&VAL-1)                                               
.HEXDEF  AIF   (K'&RESULT GT 2*&LEN).MN1                                        
&MNEM    DC    XL&LEN'&RESULT'                                                  
         MEXIT                                                                  
.ADDR    AIF   ('&VAL' NE '@').ADD1                                             
&RESULT  SETC  '&DEF'                                                           
         AGO   .ADD2                                                            
.ADD1    ANOP                                                                   
&RESULT  SETC  '&VAL'(2,K'&VAL-1)                                               
.ADD2    ANOP                                                                   
&MNEM    DC    AL&LEN.(&RESULT)                                                 
         MEXIT                                                                  
.MN1     MNOTE 16,'&MNEM: VALUE SUPPLIED (&VAL) LONGER THAN &LEN BYTES.'        
               '                                                                
         MEND                                                                   
