*box                                                                            
*                                                                               
*    MILTEN/ELF TRACE FORMAT                                                    
*      (for both port and front-end trace entries.)                             
*                                                                               
TTRC     RECORD BEGIN                                                           
TTRCCLCK DS    D                   Stck clock                                   
*-                                                                              
*-       IF PIBTRC:                                                             
*-                                                                              
TTRCPTYP EQU   TTRCCLCK+7,1,C'C'   Trace type (T=to, F=from)                    
TTRCPCMD DS    X                   PDBCMD                                       
         DS    X                   Reserved                                     
TTRCPCPL DS    XL2                 PDBCPL                                       
TTRCPLEN DS    H                   PDBLENG                                      
TTRCP    EQU   TTRCCLCK,*-TTRCCLCK,C'X'                                         
*-                                                                              
*-       IF FEBTRC:                                                             
*-                                                                              
         ORG   TTRCCLCK+8                                                       
TTRCNAME DS    CL8                 Trace name                                   
TTRCPNAM DS    CL8                 Port name                                    
TTRCDATA EQU   *                                                                
*-                                                                              
*-       IF TTRCNAME = 'TERM'                                                   
*-                                                                              
         ORG   TTRCDATA                                                         
TTRCSID  DS    F                   Session id                                   
TTRCSACC DS    CL5                 Session uuugg                                
TTRCCMD  DS    X                   PDBCMD                                       
TTRCCPL  DS    XL2                 PDBCPL  (TNETPOST only)                      
TTRCTLEN DS    H                   PDBLENG                                      
TTRCTEXT DS    CL20                PDBTEXT                                      
*-                                                                              
*-       IF TTRCNAME = 'IO'                                                     
*-                                                                              
         ORG   TTRCDATA                                                         
TTRCILEN DS    H                   Total path data length                       
TTRCIHDR DS    CL16                Header text (e.g. "TCP_WRITE:")              
TTRCIREM DS    CL30                Data beyond header                           
TTRCITOT EQU   TTRCIHDR,*-TTRCIHDR,C'X'                                         
*-                                                                              
*-       IF TTRCNAME = 'MSG'                                                    
*-                                                                              
         ORG   TTRCDATA                                                         
TTRCMSG  DS    CL40                Information message (blank pad)              
         END                                                                    
