***********************************************************************         
**                                                                   **         
**           GENERAL FORMAT OF PDB SENT BY ORVYL TO WYLBUR           **         
**                                                                   **         
***********************************************************************         
         ORG   PDBINCT                                                          
FORVCMD  DS    X                   COMMAND CODE FOR WYLBUR                      
*                                                                               
FORVREDT EQU   X'80'               READ  EDIT                                   
FORVWEDT EQU   X'40'               WRITE EDIT                                   
FORVRTXT EQU   X'20'               READ  TEXT                                   
FORVWTXT EQU   X'10'               WRITE TEXT                                   
FORVCNTL EQU   X'08'               CONTROL                                      
*                                                                               
FORVCMDM DS    X                   COMMAND CODE MODIFIER SENT TO WYLBUR         
*                                                                               
REDTRSEN EQU   X'04'               RESEND LAST COMMAND (FOR LOGON)              
*                                                                               
RTXTFNLP EQU   X'80'               DON'T USE LOCKED PAGE PASS (RTXT)            
*                                                                               
WEDTTYPD EQU   X'00'               COMMAND HAS BEEN TYPED AT TERM.              
WEDTNTYP EQU   X'04'               COMMAND HAS NOT BEEN TYPED AT TERM.          
*                                                                               
CNTLSTMW EQU   X'0C'            12 SET WYLBUR MODE WORD                         
CNTLSNMW EQU   X'0D'            13 SENSE WYLBUR MODE WORD SETTING               
CNTLSNAS EQU   X'0E'            14 SENSE ACTIVE FILE SIZE                       
CNTLSNFL EQU   X'0F'            15 SENSE FIRST LINE# IN ACTIVE FILE             
CNTLSNLL EQU   X'10'            16 SENSE LAST  LINE# IN ACTIVE FILE             
CNTLDELA EQU   X'11'            17 DELETE ALL  LINES IN ACTIVE FILE             
CNTLABRT EQU   X'12'            18 ABORT PENDING READ EDIT CHANGES              
CNTLWTER EQU   X'13'            19 WRITE LINE FROM ACTIVE FILE TO TERM.         
CNTLSNOP EQU   X'21'            33 SENSE USER'S OPTION SETTINGS IN WYL          
CNTLMAX  EQU   CNTLSNOP            MAXIMUM CONTROL COMMAND                      
*                                                                               
FORVHDR  DS    H                   DEFINITION                                   
         DS    H                     DEPENDS ON                                 
         DS    X                       COMMAND CODE -                           
         DS    X                   SEE DEFINITIONS BELOW                        
FORVHDRS EQU   *-FORVHDR           OUTCT FOR CNTL AND REDT                      
*                                                                               
FORVTEXT EQU   PDBTEXT             OPTIONAL TEXT AREA                           
*                                                                               
************************************                                            
*  FORVHDR DEFINITIONS BY COMMAND  *                                            
************************************                                            
*  REDT COMMAND FORVHDR USAGE                                                   
         ORG   FORVHDR                                                          
REDTFL   DS    X                                                                
*                                                                               
REDTFCME EQU   REDTFL,X'80',1      PREVIOUS COMMAND IN ERROR                    
REDTFATT EQU   REDTFL,X'40',1      PREVIOUS COMMAND ATTN ENDED                  
*                                                                               
*  WEDT COMMAND FORVHDR USAGE                                                   
*                                                                               
         ORG   FORVHDR                                                          
WEDTTXTL DS    H                   LENGTH OF TEXT STARTING AT FORVTEXT          
*                                                                               
*  RTXT COMMAND FORVHDR USAGE AND SPECIAL FORVTEXT DEFINITIONS                  
*                                                                               
         ORG   FORVHDR                                                          
         DS    2H                  UNUSED                                       
RTXTRLEN DS    H                   LENGTH OF USERS RECIEVING AREA               
         ORG   FORVTEXT                                                         
RTXTOPT  DS    X                   RTXT OPTION - 0 THRU 6 +NOTEXT+NUM           
*                                                                               
RTXTOPT0 EQU   X'00'             0 RTN LINE GIVEN BY RTXTFLIN                   
RTXTOPT1 EQU   X'01'             1 RTN LINE PRECEDING ONE IN RTXFLIN            
RTXTOPT2 EQU   X'02'             2 RTN LINE FOLLOWING ONE IN RTXTFLIN           
RTXTOPT3 EQU   X'03'             3 RTN LINE(S) IN RANGE FLIN/LLIN               
RTXTOPT4 EQU   X'04'             4 RTN LINE(S) IN FLIN/LLIN WITH STRG           
RTXTOPT5 EQU   X'05'             5 RTN LINE(S) IN FLIN/LLIN WITH STRG           
*                                      STARTING IN FCOL                         
RTXTOPT6 EQU   X'06'             6 RTN LINE(S) IN FLIN/LLIN WITH STRG           
*                                      IN RANGE OF FCOL/LCOL                    
RTXTNOT  EQU   X'80'               NO TEXT MODIFIER-'OR'ED WITH OPT 0/6         
RTXTNUM  EQU   X'40'               NUMBERD MODIFIER-'OR'ED WITH OPT 0/6         
RTXTINT  EQU   X'20'               INTEGER MODIFIER-'OR'ED WITH OPT 0/6         
*                                                                               
RTXTLREC DS    X                   LRECL (OPTIONAL ON ALL OPTS)                 
RTXTMAXL DS    H                   MAX. LINES TO BE RETURNED (OPTS 3/6)         
RTXTFLIN DS    A                   STARTING LINE#*1000 (ALL OPTS)               
RTXTLLIN DS    A                   ENDING LINE#*1000 (ALL OPTS)                 
RTXTFCOL DS    H                   STARTING COL FOR STRG (OPTS 5/6)             
RTXTLCOL DS    H                   ENDING COL FOR STRG (OPT 6)                  
RTXTSLEN DS    H                   STRING LENGTH (OPTS 4/6)                     
RTXTSTRG DS    0X                  STRING TEXT (OPTS 4/6)                       
*                                                                               
*  WTXT COMMAND FORVHDR USAGE                                                   
*                                                                               
         ORG   FORVHDR                                                          
WTXTTXTL DS    H                   LENGTH OF ALL TEXT BEING PASSED              
WTXTNUML DS    H                   NUMBER OF LINES BEING PASSED/DELETED         
WTXTOPT  DS    X                   WTXT OPTION - O THRU 5                       
*                                                                               
WTXTOPT0 EQU   X'00'             0 REPLACE OR INSERT LINE(S)-PREST FLAG         
WTXTOPT1 EQU   X'01'             1 REPLACE LINE(S) ONLY     -PREST FLAG         
WTXTOPT2 EQU   X'02'             2 INSERT LINE(S) ONLY      -PREST FLAG         
WTXTOPT3 EQU   X'03'             3 DELETE LINE(S)                               
WTXTOPT4 EQU   X'04'             4 APPEND LINE(S) ONLY      -LRECL              
WTXTOPT5 EQU   X'05'             5 APPEND OR INSERT LINE(S) -LRECL/NUM          
WTXTOPT6 EQU   X'06'             6 APPEND OR INSERT LINE(S) -LRECL/INT          
*                                                                               
WTXTLREC DS    X                   LRECL FOR OPTS 4 AND 5                       
*                                                                               
*  CNTL COMMAND FORVHDR USAGE                                                   
*                                                                               
         ORG   FORVHDR                                                          
         DS    2H                  UNUSED                                       
CNTLMDWD DS    H                   STMW ONLY - NEW WYLBUR MODE WORD             
         ORG   FORVHDR                                                          
         DS    2H                  UNUSED                                       
CNTLPCNT DS    H                   ABRT ONLY - COUNT OF LINES ALREADY           
         ORG   FORVHDR                                                          
         DS    H                   UNUSED                                       
CNTLWTLN DS    A                   WTER ONLY - LINE#*1000 TO BE WRITTEN         
         ORG   FORVHDR                                                          
         DS    2H                                                               
CNTLEXF1 DC    X'00'               ABORT COMMAND FLAGS                          
*                                                                               
CNTL1NRT EQU   CNTLEXF1,X'80'      NO RETRY ON COMMAND ABORT                    
CNTL1NEB EQU   CNTLEXF1,X'40'      NO EXEC BREAK ON COMMAND ABRT                
*                                                                               
CNTLSNST EQU   FORVHDR             SENSE USER OPTIONS IN WYLBUR                 
