         MACRO                                                                  
&L       KWR   &TYPE,&PFX=KWR                                                   
.*                                                                              
.*  Expanded on 11/84, Niz; modified, 6/16/88, Niz                              
.*  Remove obsolete &TYPE stuff, 9/87, Niz                                      
.*                                                                              
         AIF   ('&TYPE' EQ '').OK                                               
         MNOTE 8,'&TYPE: Expecting null parameter.'                             
         MEXIT                                                                  
.*                                                                              
.OK      ANOP                                                                   
*                                                                               
*       Keyword Record                                                          
*                                                                               
&PFX.START DS  0F                                                               
&PFX.USER  DC  C'UUU'              User                                         
&PFX.GRP   DC  C'GG'               Group                                        
&PFX.ACCT  EQU &PFX.USER,*-&PFX.USER,C'X'                                       
*                                                                               
&PFX.DSTRT EQU *                                                                
           DC  XL3'00'             Reserved                                     
&PFX.RJE   DC  H'0'                No. of jobs run                              
&PFX.SPUSD DC  H'0'                Disk space used                              
&PFX.SPMAX DC  H'-1'               Disk space allowed                           
*                                                                               
&PFX.IFL   DC  X'80'               Initials flags                               
&PFX.IFVAL  EQU  X'80'             - Valid user                                 
&PFX.IFAPR  EQU  X'40'             - ACCT privs                                 
&PFX.IFSPR  EQU  X'20'             - SYS privs                                  
&PFX.IFOPR  EQU  X'10'             - OPR privs                                  
&PFX.IFSBM  EQU  X'08'             - SUBMIT priv                                
&PFX.IFSUB  EQU  X'04'             - SUBADMIN privs                             
&PFX.IFADM  EQU  X'02'             - ADMIN privs                                
&PFX.IFPC   EQU  X'01'             - PC privs                                   
*                                                                               
&PFX.AFL   DC  X'98'               Account flags                                
&PFX.AFVAL  EQU  X'80'             - Valid acct (off when SUSPENDED)            
&PFX.AFTOK  EQU  X'08'             - Terminal usage permitted                   
&PFX.AFZSV  EQU  X'02'             - Test recovery flag (not used)              
&PFX.AFASV  EQU  X'01'             - Recovery done for last session             
*                                                                               
&PFX.BIN   DC  C'???'              Bin                                          
&PFX.WRCT  DC  X'00'               Record rewrite count                         
&PFX.BGT   DC  XL3'00'             Account budget                               
&PFX.BAL   DC  XL3'00'             Account year-to-date balance                 
&PFX.LCP   DC  H'0'                Punch card limit -- in hundreds              
&PFX.LLC   DC  H'0'                Line count limit -- in thousands             
&PFX.LET   DC  H'0'                Execution time limit in seconds              
*                                                                               
&PFX.BFL   DC  X'84'               Batch flags                                  
&PFX.BFVAL EQU X'80'               - Valid for batch                            
&PFX.BFIN  EQU X'40'               - No input setups allowed                    
&PFX.BFOUT EQU X'20'               - No output setups allowed                   
&PFX.BFNON EQU X'10'               - No non-standard priority allowed           
&PFX.BFE   EQU X'08'               - Class E only                               
&PFX.BFP   EQU X'04'               - Class P permitted                          
*                                                                               
&PFX.DEST  DC  CL8'LOCAL'          Destination for output data                  
&PFX.FORM  DC  CL4'????'           Default forms code                           
&PFX.ORV   DC  XL8'00'             Default ORVYL name                           
*                                                                               
&PFX.MACC  DC  X'80'               Machine access flags                         
&PFX.FSYSA EQU X'80'               - SYSA access allowed                        
&PFX.FSYSB EQU X'40'               - SYSB access allowed                        
&PFX.FSYSC EQU X'20'               - SYSC access allowed                        
&PFX.FSYSD EQU X'10'               - SYSD access allowed                        
&PFX.FSYSE EQU X'08'               - SYSE access allowed                        
&PFX.FSYSF EQU X'04'               - SYSF access allowed                        
&PFX.FSYSG EQU X'02'               - SYSG access allowed                        
*                                                                               
&PFX.SFL   DC  X'00'               Status flags                                 
&PFX.SFKEP EQU X'80'               - Kept mail waiting                          
&PFX.SFMAI EQU X'40'               - New mail waiting                           
&PFX.SFMLQ EQU X'20'               - New mail in MAILQnnn files                 
*                                                                               
&PFX.JFL   DC  X'02'               Job flags                                    
&PFX.JFNUM EQU X'80'               - Numbered job submission                    
&PFX.JFFOR EQU X'40'               - Force user id as job prefix                
&PFX.JFHOL EQU X'10'               - Hold printed output                **ISU** 
&PFX.JFNOT EQU X'08'               - Notify user                        **ISU** 
&PFX.JFATH EQU X'07'               - Job auth, as follows...                    
&PFX.JFPUB EQU X'04'                  Auth=public                               
&PFX.JFCOM EQU X'02'                  Auth=community                            
&PFX.JFGRP EQU X'01'                  Auth=group                                
*                                                                               
&PFX.JPFX  DC  CL8' '              Users job prefix                             
&PFX.JNO   DC  H'0'                Users job count                              
*                                                                               
&PFX.HRSAL DC  H'0'                Connect hrs allowed (hrs/10)                 
&PFX.ACCH  DC  H'0'                Connect hrs accounted (hrs/10)               
         DC    H'0'                Reserved                                     
*                                                                               
&PFX.TACF  DC  X'20'               Type/account class flags                     
&PFX.TNST  EQU X'80'               - No logoff statistics                       
&PFX.TNTM  EQU X'40'               - No session timeouts (NOTIME)               
&PFX.TNDAY EQU X'02'               - No daytime access allowed                  
*                                                                               
&PFX.TFL   DC  X'3C'               Timesharing flags                            
*              X'80'               - Reserved                                   
*              X'40'               - Reserved                                   
&PFX.TFAN  EQU X'20'               - Auto news at logon                         
&PFX.TFAM  EQU X'10'               - Auto mail at logon                         
&PFX.TFAR  EQU X'08'               - Auto recovery at logon                     
&PFX.TFAE  EQU X'04'               - Auto exec at logon                         
&PFX.TFAL  EQU X'02'               - Auto ltime at logon                        
&PFX.TFAK  EQU X'01'               - Auto ktime at logon                        
*                                                                               
&PFX.NTDEF DC  H'240'              Default notime minutes (0=nolim)             
&PFX.NTMAX DC  H'0'                Maximum notime minutes (0=nolim)             
&PFX.PFORM DC  XL4'00'             Default PRINT job forms                      
&PFX.R1  DC    H'0'                Reserved                                     
&PFX.R3  DC    H'0'                Reserved                                     
&PFX.R4  DC    X'0'                Reserved                                     
*                                                                               
&PFX.OFL   DC  X'00'               Online flags                                 
&PFX.FMULT EQU X'80'               - Multiple sessions allowed                  
&PFX.FMAIL EQU X'40'               - Mail is allowed                            
&PFX.FSEC  EQU X'20'               - Secure session (EXEC SECURE)               
&PFX.FMNPR EQU X'08'               - XMultiple: multiple w/o prompt             
&PFX.FNPAS EQU X'04'               - No logon password needed                   
*                                                                               
&PFX.LTIM  DC  XL4'00'             Last logoff time(high 32 clck bits)          
&PFX.KTIM  DC  XL4'00'             Last time keyword changed (" ")              
*                                                                               
&PFX.AC    DC  X'00'               Accounting flags                             
*                                                                               
&PFX.SOF   DC  C' '                Source of funds code                         
&PFX.AR    DC  C' '                Accounts receivable code (if SOF=2)          
*                                                                               
&PFX.STAT  DC  C' '                Account status code                          
&PFX.SEXP  EQU C'1'                - Expired                                    
&PFX.SCLS  EQU C'2'                - Closed                                     
&PFX.SOVB  EQU C'3'                - Over-budget                                
&PFX.SUHL  EQU C'4'                - User hold                                  
*                                                                               
&PFX.TFL2  DC  X'10'               Timesharing flags  (second byte)             
&PFX.TFAPE EQU X'80'               - Auto pubexec at logon                      
&PFX.TFML  EQU X'40'               - Ok to receive mail                         
&PFX.TFANE EQU X'10'               - Auto newexec at logon                      
&PFX.TFMNOATTN EQU  X'08'          - Ignore SHOW MAIL attn (NOATTN)             
*                                                                               
&PFX.PFL   DC  X'00'               Privilege flags                              
&PFX.FPCHK EQU X'80'               - PCHECK privs                               
*                                                                               
&PFX.HRSFR DC  H'0'                Free connect hrs to date (hrs/10)            
&PFX.HRSUS DC  H'0'                Hours used to date (hrs/10)                  
&PFX.DSKMX DC  H'-1'               Disk kilobytes allowed                       
&PFX.DSKUS DC  F'0'                Disk bytes used                              
*                                                                               
&PFX.PASS  DC  XL8'00'             Password                                     
&PFX.NAME  DC  XL20'00'            User's name                                  
&PFX.VOL   DC  XL6'00'             User's permanent volume                      
&PFX.SYS   DC  XL8'00'             User's initial subsystem (WYLBUR)            
&PFX.COMM  DC  XL20'00'            Comment for accounting office                
*                                                                               
&PFX.MPRIM DC  X'00'               Primary machine                              
***  Flag definitions are the same as with KWRMACC above.  ***                  
*                                                                               
&PFX.XCNT  DC  X'00'               Unsuccessful logon attempt count             
&PFX.XTIM  DC  XL4'00'             Last unsuccessful logon time                 
*                                                                               
&PFX.NEWDT DC  F'0'                Date news was last read                      
*                                                                               
&PFX.CDATE DC  F'0'                Date of charges update                       
&PFX.MTD   DC  XL3'0'              Account month-to-date balance                
&PFX.PBAL  DC  XL3'0'              Account previous ytd charges                 
*                                                                               
&PFX.MFOR  DC  XL64'00'            Mail forwarding address                      
&PFX.MTXT  DC  XL80'00'            Mail information text                        
*                                                                               
&PFX.CMD   DC  XL80'00'            First command to execute                     
&PFX.LPORT DC  XL20'00'            Last logoff port name                        
*                                                                               
&PFX.CRDT  DC  XL4'00'             Account creation date                **ISU** 
*                                                                       **ISU** 
&PFX.RENCT DC  XL2'00'             No. of ORVYL RENAMEs (not used)              
*                                                                               
&PFX.NETU  DC  CL16'GUEST'         Network user id (zeros=disabled)             
&PFX.NETH  DC  CL32'LINDY'         Network host name                            
*                                                                               
&PFX.LOCAL DC  XL8'00'             For non-Stanford use (ISU!)                  
&PFX.DATA  EQU &PFX.DSTRT,*-&PFX.DSTRT,C'X'                                     
*                                                                               
&PFX.END   EQU *                   End of physical record                       
*                                                                               
&PFX.HFL   DC  X'00'               Status flags                                 
&PFX.HFCK  EQU X'80'               - Keyword checking in effect                 
&PFX.HFUOK EQU X'40'         Update successful--cannot occur with               
*                            kwrhferr or kwrhfful.  if kwrhfuok,                
*                            err, and ful are all 0, the record has             
*                            been changed since it was read.                    
&PFX.HFERR EQU X'20'               - I/O error reading keyword file             
&PFX.HFFUL EQU X'10'               - No room to add user                        
*                                                                               
         DS    0F                                                               
         AIF   ('&L' EQ '').NOLBL                                               
&L       EQU   &PFX.START,*-&PFX.START,C'X'                                     
.NOLBL   ANOP                                                                   
&PFX.SIZE  EQU *-&PFX.START                                                     
*                                                                               
*  Operation codes.                                                             
*                                                                               
&PFX.CWR    EQU  X'80'             Write                                        
&PFX.CRD    EQU  X'40'             Read                                         
&PFX.CDIE   EQU  X'FF'             Shutdown keyword routines                    
         MEND                                                                   
