         MACRO                                                                  
&L       KWR   &TYPE,&PFX=KWR                                                   
.*       Modified 9/84, Niz                                                     
         AIF   ('&TYPE' EQ 'FLAGS').FLAGS                                       
         AIF   ('&TYPE' NE 'FORMAT' AND '&TYPE' NE '').ERROR                    
*                                                                               
*       Keyword Record                                                          
*                                                                               
&PFX.START DS  0F                                                               
&PFX.USER  DC  C'UUU'              User                                         
&PFX.GRP   DC  C'GG'               Group                                        
*                                                                               
&PFX.DATA  EQU *                                                                
           DC  XL3'00'             Reserved                                     
&PFX.RJE   DC  H'0'                No. of jobs run                              
&PFX.SPUSD DC  H'0'                Disk space used                              
&PFX.SPMAX DC  H'-1'               Disk space allowed                           
&PFX.IFL   DC  X'80'               Initials flags                               
&PFX.AFL   DC  X'98'               Account flags                                
&PFX.BIN   DC  C'???'              Bin                                          
&PFX.WRCT  DC  X'00'               Record rewrite count                         
&PFX.BGT   DC  XL3'00'             Account budget                               
&PFX.BAL   DC  XL3'00'             Account year-to-date balance                 
&PFX.LCP   DC  H'0'                Punch card limit -- in hundreds              
&PFX.LLC   DC  H'0'                Line count limit -- in thousands             
&PFX.LET   DC  H'0'                Execution time limit in seconds              
*                                                                               
&PFX.BFL   DC  X'84'               Batch flags                                  
&PFX.BFVAL EQU X'80'               - Valid for batch                            
&PFX.BFIN  EQU X'40'               - No input setups allowed                    
&PFX.BFOUT EQU X'20'               - No output setups allowed                   
&PFX.BFNON EQU X'10'               - No non-standard priority allowed           
&PFX.BFE   EQU X'08'               - Class E only                               
&PFX.BFP   EQU X'04'               - Class P permitted                          
*                                                                               
&PFX.DEST  DC  CL8'LOCAL'          Destination for output data                  
&PFX.FORM  DC  CL4'1181'           Default forms code                           
           DC  XL8'00'             Reserved                                     
*                                                                               
&PFX.MACH  DC  X'80'               Machine access flags                         
&PFX.FALP  EQU X'80'               - ALPHA access allowed                       
&PFX.FRLG  EQU X'01'               - RLG   access allowed                       
*                                                                               
&PFX.SFL   DC  X'00'               Status flags                                 
&PFX.SFKEP EQU X'80'               - Kept mail waiting                          
&PFX.SFMAI EQU X'40'               - New mail waiting                           
*                                                                               
&PFX.JFL   DC  X'02'               Job flags                                    
&PFX.JFNUM EQU X'80'               - Numbered job submission                    
&PFX.JFFOR EQU X'40'               - Force user id as job prefix                
&PFX.JFATH EQU X'07'               - Job auth, as follows...                    
&PFX.JFPUB EQU X'04'                  Auth=public                               
&PFX.JFCOM EQU X'02'                  Auth=community                            
&PFX.JFGRP EQU X'01'                  Auth=group                                
*                                                                               
&PFX.JPFX  DC  CL8' '              Users job prefix                             
&PFX.JNO   DC  H'0'                Users job count                              
*                                                                               
&PFX.HRSAL DC  H'0'                Connect hrs allowed (hrs/10)                 
&PFX.ACCH  DC  H'0'                Connect hrs accounted (hrs/10)               
&PFX.MINWT DC  X'00'               Minimum delay between sessions               
&PFX.MAXSL DC  X'00'               Maximum session length                       
*                                                                               
&PFX.TACF  DC  X'00'               Type/account class flags                     
&PFX.TNST  EQU X'80'               - No logoff statistics                       
&PFX.TNTM  EQU X'40'               - No session timeouts                        
&PFX.TARPA EQU X'20'               - Arpanet access is allowed                  
&PFX.TRLG  EQU X'08'               - Use ORVYLRLG                               
&PFX.TSTUD EQU X'04'               - Student account                            
&PFX.TNDAY EQU X'02'               - No daytime access allowed                  
&PFX.TLCIP EQU X'01'               - LCIP                                       
*                                                                               
&PFX.TFL   DC  X'3C'               Timesharing flags                            
&PFX.TFAC  EQU X'80'               - Automatic call of named program            
&PFX.TFMP  EQU X'40'               - Named program is mandatory                 
&PFX.TFAN  EQU X'20'               - Auto news at logon                         
&PFX.TFAM  EQU X'10'               - Auto mail at logon                         
&PFX.TFAR  EQU X'08'               - Auto recovery at logon                     
&PFX.TFAE  EQU X'04'               - Auto exec at logon                         
&PFX.TFAL  EQU X'02'               - Auto ltime at logon                        
&PFX.TFAK  EQU X'01'               - Auto ktime at logon                        
*                                                                               
&PFX.VLIB  DC  XL5'00'             Program library (gguuu)                      
&PFX.VPGM  DC  XL8'00'             Program name                                 
*                                                                               
&PFX.OFL   DC  X'01'               Online flags                                 
&PFX.FMULT EQU X'80'               - Multiple sessions allowed                  
&PFX.FMAIL EQU X'40'               - Mail is allowed                            
&PFX.FSEC  EQU X'20'               - Secure session (EXEC SECURE)               
*                                                                               
&PFX.LTIM  DC  XL4'00'             Last logoff time(high 32 clck bits)          
&PFX.KTIM  DC  XL4'00'             Last time keyword changed (" ")              
*                                                                               
&PFX.AC    DC  X'00'               Accounting flags                             
*                                                                               
&PFX.SOF   DC  C' '                Source of funds code                         
&PFX.SSUS  EQU C'0'                - Suspense (?)                               
&PFX.SRLN  EQU C'1'                - RLIN                                       
&PFX.SNS   EQU C'2'                - Non-stanford funded (see ar)               
&PFX.SGOV  EQU C'3'                - Government sponsered                       
&PFX.SOTH  EQU C'4'                - Other university                           
&PFX.SUSR  EQU C'5'                - Unsponsered research                       
&PFX.SINS  EQU C'6'                - Instructional comp.                        
&PFX.SHOS  EQU C'7'                - Hospital                                   
&PFX.SSCP  EQU C'8'                - CIT/overhead                               
&PFX.SADM  EQU C'9'                - University admin.                          
&PFX.SINT  EQU C'A'                - Internal systems                           
*                                                                               
&PFX.AR    DC  C' '                Accounts receivable code (if SOF=2)          
&PFX.ASTAN EQU C'0'                - Stanford user                              
&PFX.AOTHC EQU C'1'                - Other college                              
&PFX.AOTHE EQU C'2'                - Other (error)                              
&PFX.ANPRO EQU C'3'                - Non-profit                                 
&PFX.AFED  EQU C'4'                - Federal                                    
&PFX.APRO  EQU C'5'                - For profit                                 
*                                                                               
&PFX.STAT  DC  C' '                Account status code                          
&PFX.SEXP  EQU C'1'                - Expired                                    
&PFX.SCLS  EQU C'2'                - Closed                                     
&PFX.SOVB  EQU C'3'                - Over-budget                                
&PFX.SUHL  EQU C'4'                - User hold                                  
*                                                                               
&PFX.TFL2  DC  X'10'               Timesharing flags  (second byte)             
&PFX.TFAPE EQU X'80'               - Auto pubexec at logon                      
&PFX.TFML  EQU X'40'               - Ok to receive mail                         
&PFX.TFAT  EQU X'20'               - Auto term type prompt at logon             
&PFX.TFANE EQU X'10'               - Auto newexec at logon                      
*                                                                               
           DC  X'00'               Reserved                                     
*                                                                               
&PFX.HRSFR DC  H'0'                Free connect hrs to date (hrs/10)            
&PFX.HRSUS DC  H'0'                Hours used to date (hrs/10)                  
&PFX.DSKMX DC  H'-1'               Disk kilobytes allowed                       
&PFX.DSKUS DC  F'0'                Disk bytes used                              
*                                                                               
&PFX.PASS  DC  XL8'00'             Password                                     
&PFX.NAME  DC  XL20'00'            User's name                                  
&PFX.VOL   DC  XL6'00'             User's permanent volume                      
*                                                                               
&PFX.MTXT  DC  XL20'00'            Mail information text                        
&PFX.MACC  DC  XL6'00'             Mail forwaring account                       
*                                                                               
           DC  XL3'00'             Reserved                                     
*                                                                               
&PFX.XCNT  DC  X'00'               Unsuccessful logon attempt count             
&PFX.XTIM  DC  XL4'00'             Last unsuccessful logon time                 
*                                                                               
&PFX.NEWDT DC  F'0'                Date news was last read                      
*                                                                               
&PFX.CDATE DC  F'0'                Date of charges update                       
&PFX.MTD   DC  XL3'0'              Account month-to-date balance                
&PFX.PBAL  DC  XL3'0'              Account previous ytd charges                 
*                                                                               
         DC    XL8'00'             Reserved                                     
*                                                                               
&PFX.END   EQU *                   End of physical record                       
*                                                                               
&PFX.HFL   DC  X'00'               Status flags                                 
&PFX.HFCK  EQU X'80'               - Keyword checking in effect                 
&PFX.HFUOK EQU X'40'         update successful--cannot occur with               
*                            kwrhferr or kwrhfful.  if kwrhfuok,                
*                            err, and ful are all 0, the record has             
*                            been changed since it was read.                    
&PFX.HFERR EQU X'20'               - I/O error reading keyword file             
&PFX.HFFUL EQU X'10'               - No room to add user                        
*                                                                               
         DS    0F                                                               
         AIF   ('&L' EQ '').NOLBL                                               
&L       EQU   &PFX.START,*-&PFX.START,C'X'                                     
.NOLBL   ANOP                                                                   
&PFX.SIZE  EQU *-&PFX.START                                                     
*                                                                               
*  Operation codes.                                                             
*                                                                               
&PFX.CWR    EQU  X'80'             Write                                        
&PFX.CRD    EQU  X'40'             Read                                         
&PFX.CDIE   EQU  X'FF'             Shutdown keyword routines                    
.FLAGS   AIF   ('&TYPE' EQ 'FORMAT').MEND                                       
*                                                                               
*  Privilege flags.                                                             
*                                                                               
&PFX.IFVAL  EQU  X'80'             - Valid user                                 
&PFX.IFAPR  EQU  X'40'             - ACCT privs                                 
&PFX.IFSPR  EQU  X'20'             - SYS privs                                  
&PFX.IFOPR  EQU  X'10'             - OPR privs                                  
&PFX.IFSBM  EQU  X'08'             - SUBMIT priv                                
&PFX.IFSUB  EQU  X'04'             - SUBADMIN privs                             
&PFX.IFADM  EQU  X'02'             - ADMIN privs                                
&PFX.IFPC   EQU  X'01'             - PC privs                                   
*                                                                               
*  Account flags.                                                               
*                                                                               
&PFX.AFVAL  EQU  X'80'             - Valid account                              
&PFX.AFDOK  EQU  X'10'             - Disk usage permitted                       
&PFX.AFTOK  EQU  X'08'             - Terminal usage permitted                   
&PFX.AFASV  EQU  X'01'             - Active file saved last session             
.MEND    MEXIT                                                                  
.ERROR   MNOTE 8,'&TYPE: Should be FLAGS, FORMAT or null.'                      
         MEND                                                                   
