*                                                                               
**  PDP CHANNEL AND LOCAL COMMANDS                                              
*                                                                               
PCRDHDR  EQU   X'22'               Read header                                  
PCWRHDR  EQU   X'21'               Write header                                 
PCWRTABS EQU   X'31'               Write tabs                                   
PCWRTEXT EQU   X'41'               Write text                                   
*                                                                               
PENBL    EQU   0                   ENABLE                                       
PDSBL    EQU   1                   DISABLE                                      
PBRK     EQU   2                   BREAK                                        
PWR      EQU   3                   WRITE                                        
PRD      EQU   4                   READ                                         
PLOAD    EQU   5                   LOAD                                         
PDUMP    EQU   6                   DUMP                                         
PPOLL    EQU   7                   POLL                                         
PSNS     EQU   X'80'               SENSE TERMINAL INFO                          
         SPACE 2                                                                
*                                                                               
**  PDP TRACE FORMAT                                                            
*                                                                               
PTRC     RECORD BEGIN                                                           
PTRCCLCK DS    D                   STCK CLOCK                                   
*                                                                               
*  IF PIBTRC...                                                                 
PTRCPTYP EQU   PTRCCLCK+7,1,C'C'   TRACE TYPE (T=TO, F=FROM)                    
PTRCPHDR DS    XL8                 PDP HEADER                                   
PTRCP    EQU   PTRCCLCK,*-PTRCCLCK,C'X'                                         
*                                                                               
         ORG   PTRCCLCK+8                                                       
PTRCNAME DS    CL8                 TRACE NAME                                   
PTRCPNAM DS    CL8                 PORT NAME                                    
PTRCDATA EQU   *                                                                
*                                                                               
*  IF PTRCNAME = 'PDP'...                                                       
         ORG   PTRCDATA                                                         
PTRCSID  DS    F                   SESSION ID                                   
PTRCSACC DS    CL5                 SESSION UUUGG                                
PTRCCMD  DS    X                   PDBCMD                                       
PTRCCPL  DS    XL2                 PDBCPL  (PDPPOST ONLY)                       
PTRCTLEN DS    H                   PDBLENG                                      
PTRCTEXT DS    CL20                PDBTEXT                                      
*                                                                               
*  IF PTRCNAME = 'HDR'...                                                       
         ORG   PTRCDATA                                                         
PTRCHSIO DS    X                   SIO CC                                       
         DS    X                   RESERVED                                     
PTRCHCSW DS    XL2                 CSW STATUS                                   
PTRCHDR  DS    XL8                 PDP HEADER                                   
         END                                                                    
