*-                                                                              
*-       QSERV Vector Table                                                     
*-                                                                              
*-         Created, 4/90, Jim Nisbet                                            
*-                                                                              
QSVT     RECORD BEGIN                                                           
QSID     DS    CL4'QSVT'           Self identification                          
*                                                                               
QSVER#   EQU   1,,C'N'             This mapping is version 1                    
QSVER    DS    X                   Control block version number                 
*                                                                               
QSFLAG   FLAG                                                                   
         FLAG  QSFDISABLE          - Reject new QSERV requests                  
*                                                                               
         DS    XL2                 Reserved                                     
*                                                                               
QSMAXCT# EQU   128*1024            Allow 128K of QSENTRYs in ECSA               
QSMAXCT  DS    F                   Maximum byte count before reject             
QSASCBP  DS    F                   QSERV job ASCB ptr (zero=none)               
         DS    2F                  Reserved                                     
         DS    D                   Reserved                                     
*-                                                                              
*-       The QSERV SVC adds new QSENTRYs to the end of the new                  
*-       queue (care must be taken to allow multiple updaters).                 
*-                                                                              
QSCURCT  DS    A                   QSENTRY total byte count                     
         DS    A                   Reserved                                     
*                                                                               
QSCURQH  DS    A           [Order] QSENTRY queue head ptr                       
QSCURQT  DS    A           [Order] QSENTRY queue tail ptr                       
*-                                                                              
*-       The QSERV job takes the current queue and puts the entries             
*-       it on this queue.  Only the QSERV job can update this                  
*-       queue.                                                                 
*-                                                                              
QSOLDQH  DS    A           [Order] Saved QSENTRY queue head ptr                 
QSOLDQT  DS    A           [Order] Saved QSENTRY queue tail ptr                 
*                                                                               
         DS    4F                  Reserved                                     
*                                                                               
QSNTOTAL DS    F                   No. of times SVC was issued                  
QSNFULL  DS    F                   No. of full queue rejects                    
QSNPRIV  DS    F                   No. of non-priv'd caller rejects             
QSNERR   DS    F                   No. of other errors                          
         END                                                                    
         SPACE 2                                                                
*-                                                                              
*-       Queue element                                                          
*-                                                                              
QSENTRY  RECORD BEGIN                                                           
QSEID    DS    CL4'QSRV'           Self identification                          
QSELINK  DS    A                   Next QSENTRY ptr (or zero)                   
*                                                                               
QSEJBNM  DS    CL8                 Jobname of requestor                         
*                                                                               
QSETYPE  DS    CL16                Queue entry type                             
*                                                                               
QSEFLAG  FLAG                                                                   
         FLAG  QSEFAUTH            - Requestor is APF authorized                
         DS    X                   Reserved                                     
*                                                                               
QSELEN   DS    H                   Length of text following                     
QSETMAX# EQU   4000,,C'N'          Maximum queue entry text length              
QSETEXT  EQU   *                   Text starts here                             
         END                                                                    
