*-                                                                              
*-  Counter Record                                                              
*-                                                                              
CTRCNAME DS    CL16                Counter variable name                        
CTRCVAL  DS    F                   Variable value                               
CTRCVAL$ DS    F                   Dollar amount (in .1 cent units)             
CTRCTEXT DS    CL8                 Text associated with the counter             
