*-                                                                              
*-       Component charging record.                                             
*-                                                                              
CCRCPROJ DS    CL8                 Project id                                   
CCRCCOMP DS    CL16                Charging component ("GENERAL")               
CCRCBLK  DS    CL8                 Time block ("DAY")                           
*-                                                                              
*-       CPU time information:                                                  
*-         A "tu" is a "timer unit", which is 1/38400 of a second.              
*-         The CPU numbers below have the CPU multiplier and                    
*-         surcharge percentage already applied to them (i.e., they             
*-         are the same numbers that are displayed to users).                   
*-                                                                              
*-       All dollar amounts below are in .1 cent units (when Wylbur             
*-         displays them to users, it rounds to the nearest cent).              
*-                                                                              
CCRCCON  DS    F                   Connect time (in .01 seconds)                
CCRCCON$ DS    F                                                                
CCRCTIO  DS    F                   Terminal I/O count                           
CCRCTIO$ DS    F                                                                
CCRCWCPU DS    F                   Wylbur CPU time (in tu's)                    
CCRCWCPU$ DS   F                                                                
CCRCWIO  DS    F                   Wylbur disk I/Os                             
CCRCWIO$ DS    F                                                                
CCRCVCPU DS    F                   Orvyl CPU time (in tu's)                     
CCRCVCPU$ DS   F                                                                
CCRCVIO  DS    F                   Orvyl disk I/Os                              
CCRCVIO$ DS    F                                                                
         DS    3F                  Reserved                                     
CCRCFLAG FLAG                                                                   
         FLAG  CCRCFNOCHARGE       - Don't charge user for this                 
         DS    XL3                 Reserved                                     
CCRCNEXT EQU   *                   (Next component entry follows...)            
