*  Type &wsmfkwr KWR accounting record...                                       
SMFKIFL  DS    X                   Copy of kwrifl                               
SMFKAFL  DS    X                   Copy of kwrafl                               
SMFRACCT DS    CL5                 Referenced account                           
*  WYLBUR only...                                                               
SMFWFL   DS    X                   WYLBUR flags                                 
SMFWMAST EQU   X'80'               - Set/show master                            
SMFWKEY  EQU   X'40'               - Set keyword                                
SMFWAUTH EQU   X'20'               - Authority correct                          
*  (If SMFWAUTH is off, the request was not honored because                     
*  the command required privs the issuer did not have.)                         
SMFWOUT  EQU   X'10'               - Set output                                 
SMFWJOB  EQU   X'08'               - Set job                                    
SMFWAUTO EQU   X'08'                 Set auto                                   
SMFWNAME EQU   X'08'                 Set name                                   
SMFWMAIL EQU   X'04'                 Set mail                                   
SMFWSECL EQU   X'02'               - Security violation at logon                
SMFWSEC  EQU   X'01'               - Security violation                         
*                                                                               
SMFWLEN  DS    X                   Command length                               
SMFWCMD  DS    CL235               Command text                                 
