*box                                                                            
*                                                                               
*  User-ID Record Layout                                                        
*                                                                               
         SPACE ,                                                                
UIDREC   RECORD BEGIN              User-ID record                               
UIDKL#   EQU   64,,C'N'            User-ID key length                           
UIDDL#   EQU   8+256+4,,C'N'       User-ID data length                          
*                             (no, I don't know why the odd formula)            
UIDKEY   DS    CL(UIDKL#)          User-ID record key                           
UIDDATA  DS    CL(UIDDL#)          User-ID record data                          
*                                                                               
         ORG   UIDDATA                                                          
UIDCLOCK DS    F                   High word of STCK                            
UIDUC    DS    H                   Record update count                          
UIDULEN  DS    H                   Length of user data                          
UIDUDATA DS    XL(UIDDL#-12)       User data                                    
UIDEND   DS    CL4':END'           Trailing id                                  
         ORG                                                                    
         END   ,                                                                
