*box                                                                            
*                                                                               
*  User-ID Function request block                                               
*                                                                               
         SPACE 2                                                                
USRREQ   RECORD BEGIN              User-id request block                        
REQID    DC    CL4'USIO'           Request block identifier                     
REQTYPE  DC    A(0)                Request function                             
RQTREAD  EQU   0,4,C'C'              - Request read                             
RQTADD   EQU   4,4,C'C'              - Request add                              
RQTUPD   EQU   8,4,C'C'              - Request update                           
RQTDEL   EQU   12,4,C'C'             - Request to delete record                 
RQTINIT  EQU   16,4,C'C'             - Request to initialize                    
RQTTERM  EQU   20,4,C'C'             - Request to terminate                     
         SPACE 2                                                                
REQCNTL  DC    A(0)                Address of control information               
REQCODE  DC    A(0)                Completion codes                             
REQREAS  DC    A(0)                Completion reason codes                      
REQKEY   DC    A(0)                Address of User-ID key                       
REQBUFR  DC    A(0)                Address of record buffer                     
REQBUFL  DC    A(0)                Length of record buffer                      
REQSPEC  DC    0A(0)               Origin for specific requests                 
         END   ,                                                                
