*        VFTRACE                   MILTEN TRACE RECORD FOR VTAM/SNA FEB         
*VFT     IDENT 0296                14:50:17 10/22/80 (RTS)                      
*                                                                               
VFTSTRT  DS    0F                  START OF TRACE RECORD                        
VFTCLCK  DS    D                   STCK CLOCK                                   
VFTNAME  DS    CL8                 NAME OF EVENT                                
VFTTYPE  DS    X                   TYPE OF ENTRY                                
VFTOPCLS EQS   VFTTYPE,4           FOR OPEN ACB | CLOSE ACB                     
VFTLTL   EQS   VFTTYPE,8           FOR LOSTTERM | TPEND | LOGON | ERR           
VFTLMODE EQS   VFTTYPE,12          FOR LOGMODE                                  
*                                                                               
VFTVFLG1 DS    X                   FROM FEB AT ENTRY                            
VFTFVLG2 DS    X                         "                                      
         SPACE 2                                                                
VFTTEXT  DS    0F                  VARIABLE TEXT                                
*                                                                               
*VFTOPCLS                          FOR OPEN ACB | CLOSE ACB                     
         ORG   VFTTEXT                                                          
VFTOFLGS DS    X                   ACBOFLGS                                     
VFTERFLG DS    X                   ACBERFLGS                                    
*                                                                               
*VFTLTL                            FOR LOSTTERM | TPEND | LOGON | ERR           
         ORG   VFTTEXT                                                          
VFTPORTN DS    CL8                 PORT NAME                                    
VFTCODE  DS    X                   REASON CODE                                  
         DS    0F                  ROUND TO FULL WORD                           
*                                                                               
*VFTLMODE                          FOR LOGMODE                                  
         ORG   VFTTEXT                                                          
VFTRTNCD DS    X                   RPLRTNCD                                     
VFTFDBK2 DS    X                   RPLFDB2                                      
VFTOPT11 DS    X                   RPLOPT11                                     
*                                                                               
VFT#     EQU   20                  NUMBER OF TRACE ENTRIES                      
