         MACRO  --  HASP UTILITY SVC SUPPORT                                    
&L       HASPSERV  &FUNC,&AREA,&TCB=0,&ASCB=                                    
         GBLB  &NOHSERV            (See SYSDEFN)                                
         LCLA  &N,&MAX                                                          
         LCLC  &FN,&F(20)                                                       
.*                                                                              
&ASCBP   SETC  '&ASCB'                                                          
         AIF   ('&ASCBP' NE '').NOTCB                                           
&ASCBP   SETC  '&TCB'                                                           
.NOTCB   ANOP                                                                   
.*                                                                              
&FN      SETC  '&FUNC'                                                          
         AIF   ('&FUNC'(1,1) EQ '(').FSET                                       
         AIF   (T'&FUNC EQ 'N').FSET                                            
.*                                                                              
&F(1)    SETC  'JOBACCT'                                                        
&F(2)    SETC  'JOBINFO'                                                        
&F(3)    SETC  'NOEJECT'                                                        
&F(4)    SETC  'USERTYPE'                                                       
&F(5)    SETC  'JOBNAME'                                                        
&F(6)    SETC  'STEPTERM'                                                       
&F(7)    SETC  'JOBCLASS'                                                       
&F(8)    SETC  'TAPEMNT'                                                        
&F(9)    SETC  'ORVYL'                                                          
&F(10)   SETC  'STEPCHRG'                                                       
&F(11)   SETC  'SMFDUMP'                                                        
&F(12)   SETC  'SUBSYS'                                                         
&F(13)   SETC  'QUESMF'            UNUSED                                       
&F(14)   SETC  'WTL'                                                            
&F(15)   SETC  'DISPLAY'           UNUSED                                       
&F(16)   SETC  'TAPETYPE'          UNUSED                                       
&F(17)   SETC  'JQFULL'            UNUSED                                       
&MAX     SETA  17                                                               
.*                                                                              
.LOOP    AIF   ('&F(&N+1)' EQ '&FUNC').FOUND                                    
&N       SETA  &N+1                                                             
         AIF   (&N LT &MAX).LOOP                                                
         MNOTE 8,'&FUNC - INVALID HASPSERV FUNCTION'                            
         MEXIT                                                                  
.*                                                                              
.FOUND   ANOP                                                                   
&FN      SETC  '&N'                                                             
.*                                                                              
.FSET    ANOP                                                                   
&L       SYSLR 0,&FN                                                            
         SYSLR 1,&AREA,NULL=                                                    
         SYSLR 15,&ASCBP,OP=L                                                   
.*                                                                              
         AIF   (&NOHSERV).DUMMY                                                 
         SVC   254                                                              
         MEXIT                                                                  
.*                                                                              
.DUMMY   LA    15,12               Dummy JES NOT ACTIVE return code             
         MEND                                                                   
