         MACRO                                                            20.   
&NAME    IOBD                                                             21.   
         SPACE                                                            22.   
&NAME    DSECT                    IOB  INPUT/OUTPUT BLOCK                 75.   
         SPACE                                                            76.   
IOBFLGS1 DS    1C                *FLAGS1                                  77.   
IOBDCFLG EQU   128                .  BIT 0  DATA CHAINING                 78.   
IOBCCFLG EQU   064                .  BIT 1  COMMAND CHAINING              79.   
IOBURFLG EQU   002                .  BIT 6  UNRELATED REQUEST             80.   
IOBFLGS2 DS    1C                 FLAGS2                                  81.   
IOBSENSE DS    2C                 FIRST TWO SENSE BYTES                   82.   
         SPACE                                                            83.   
IOBCCODE DS    1C                 ECB COMPLETION CODE                     84.   
IOBECB   DS    3C                *ECB ADDRESS                             85.   
         SPACE                                                            86.   
IOBFLGS3 DS    1C                 FLAGS3                                  87.   
IOBCSW   DS    7C                 LOW ORDER 7 BYTES OF CSW                88.   
         SPACE                                                            89.   
IOBSIOCD DS    1C                 SIO CONDITION CODE                      90.   
IOBCP    DS    AL3 *CHANNEL PROGRAM ADDRESS                               91.   
         SPACE                                                            92.   
         DS    1C                 RESERVED                                93.   
IOBDCB   DS    AL3               *DCB ADDRESS                             94.   
         SPACE                                                            95.   
IOBREPOS DS    1C                 REPOSITIONING MODIFIER                  96.   
IOBRSTRT DS    3C                 RESTART ADDRESS                         97.   
         SPACE                                                            98.   
IOBBLKIN DS    2C                 BLOCK COUNT INCREMENT                   99.   
IOBERRCT DS    2C                  ERROR COUNT                           100.   
IOBEXTNT DS    1C                *EXTENT NUMBER                          101.   
         SPACE                                                           102.   
IOBSEEK  EQU   *                 *SEEK ADDRESS                           103.   
         SPACE                                                           104.   
*                            FOR DISK                                    105.   
         SPACE                                                           106.   
IOBBB    DS    2C                 .  'BIN'                               107.   
IOBCC     DS   2C                 .  CYLINDER                            108.   
IOBHH    DS    2C                 .  HEAD                                109.   
IOBR     DS    1C                 .  RECORD                              110.   
         SPACE                                                           111.   
*                            FOR PIE FILE                                112.   
         ORG   IOBSEEK                                                   113.   
         SPACE                                                           114.   
IOBCELL  DS    2C                 .  CELL                                115.   
IOBSUBCL DS    1C                 .  SUBCELL                             116.   
IOBSTRIP DS    1C                 .  STRIP                               117.   
IOBCYL   DS    1C                 .  CYLINDER                            118.   
IOBHEAD  DS    1C                 .  HEAD                                119.   
IOBREC   DS    1C                 .  RECORD                              120.   
         SPACE                                                           121.   
*                                *THESE FIELDS MUST BE SET BY PROGRAM    122.   
         MEND                                                            125.   
