       01  MAS-REC.                                                     ........
           02  DELETE-CODE PICTURE X.                                   1.......
           02  VSN.                                                     ........
               03  VSN-ALPHAS.                                          ........
                   04  VSN-ALPHA1 PIC X.                                2.......
                   04  VSN-ALPHA2 PIC X.                                3.......
               03  VSN-NUMERICS PICTURE X(4).                           4.......
           02  SER     PICTURE X.                                       8.......
           02  SCT     PICTURE X.                                       9.......
           02  HISTORY.                                                 ........
               03  PUR-DATE PICTURE X(5).                               10......
               03  MFG      PICTURE X(2).                               15......
               03  TYP      PICTURE X(2).                               17......
               03  SLOTNO   PICTURE X(5).                               19......
               03  DATE-LAST-ATL-MOVE  PIC X(5).                        24......
               03  SLOTFLAG       PIC X.                                29......
               03  ARCH-CHRGE-FLG PIC X.                                30......
               03  TAPE-IN-ATL    PIC X.                                31......
               03  LNGTH    PICTURE X(4).                               32......
               03  LOC.                                                 ........
                   04  LOCBOX PICTURE XXXX.                             36......
                   04  LOCID  PICTURE XX.                               40......
               03  LOC-DATE  PICTURE X(5).                              42......
               03  NEW-USER    PICTURE  X.                              47......
               03  FILLER      PICTURE  X.                              48......
               03  PRIOR-LOCID PICTURE  XX.                             49......
               03  PRIOR-LOC-DT PICTURE X(5).                           51......
               03  SLOT-CHNGE-DTE-YDDD PIC X(4).                        56......
               03  PRIOR-SLOTNO        PIC X(5).                        60......
               03  MAX-PWE  PICTURE X(3).                               65......
               03  USE-CT   PICTURE 9(5).                               68......
               03  T-USE-CT PICTURE 9(5).                               73......
               03  DSN-UPDATE-FLAG   PICTURE X.                         78......
               03  INPUT-USE-CODE    PICTURE X.                         79......
               03  OUTPUT-USE-CODE   PICTURE X.                         80......
               03  STOR-CHG.                                            ........
                    04  JOB-ACCT-CODE.                                  ........
                        05  USER-ACCT-CODE PICTURE XXX.                 81......
                        05  GROUP-ACCT-CODE PICTURE XX.                 84......
                    04  PROGRAMMER       PICTURE X(10).                 86......
           02  DS-INFO.                                                 ........
               03  DSN      PICTURE X(44).                              96......
               03  DRIVE    PICTURE X(3).                               140.....
               03  GEN-DATE PICTURE X(5).                               143.....
               03  EXP-DATE PICTURE X(5).                               148.....
               03  KEP-DATE PICTURE X(5).                               153.....
               03  JOB-NAME PICTURE X(8).                               158.....
               03  DEN      PICTURE X(4).                               166.....
               03  TRTCH    PICTURE X(2).                               170.....
               03  SIO      PICTURE X(5).                               172.....
               03  PWE      PICTURE X(3).                               177.....
               03  MAX-TRE  PICTURE X(3).                               180.....
               03  VOL-SEQ  PICTURE X(2).                               183.....
               03  VOL-CT   PICTURE X(2).                               185.....
               03  LAB-TYPE PICTURE X.                                  187.....
               03  DATE-LAST-USED   PICTURE X(5).                       188.....
               03  OWNER-ACCT-CODE.                                     ........
                        05  USER-ACCT-CODE PICTURE XXX.                 193.....
                        05  GROUP-ACCT-CODE.                            ........
                            06  GROUP-CODE-BYTE1  PIC X.                196.....
                            06  FILLER            PIC X.                197.....
               03  LAST-FILE-NO     PICTURE 999.                        198-200.
