         MACRO                                                                  
         RDW                                                                    
RDW      DS    0F                  Start of RDW                                 
RDWSZ    DS    H                   Length                                       
RDWUFL   DS    X                   User flags                                   
RDWONLY  EQU   X'00'  [Unused]     - Only segment                               
RDWFRST  EQU   X'01'  [Unused]     - First of >1 segments                       
RDWLAST  EQU   X'02'  [Unused]     - Last of >1 segments                        
RDWMIDL  EQU   X'03'  [Unused]     - Middle of >1 segments                      
*                                                                               
RDWSFL   DS    X                   SVC flags                                    
RDWSFREE EQU   X'80'               - Located, cmdfreex freed it                 
RDWSPAD  EQU   X'40'  [Unused]     - Padded to halfword multiple                
RDWSEOF  EQU   X'20'               - End of file, this controllee               
*                                                                               
RDWSIZE  EQU   *-RDW               Size of RDW                                  
         MEND                                                                   
