         MACRO                     SCIP CVT Definition                          
&NAME    SCIPCVT  &DUMMY,&PFX=USE                                               
.*  Modified, 8/90, Niz                                                         
&P       SETC  '&PFX'                                                           
&NAME    DS    0F                                                               
&P.IDENT DC    C'SCIP'             Identify user CVT                            
&P.HSPFL DC    X'00'               Flags                                        
HSPFMIL  EQU   X'80'               - MILTEN is up and ready                     
HSPFWYL  EQU   X'40'               - WYLBUR is up and ready                     
HSPFORV  EQU   X'20'               - ORVYL  is up and ready                     
HSPFORVR EQU   X'10'               - ORVYL2 is up and ready                     
HSPFINT  EQU   HSPFMIL+HSPFWYL+HSPFORV  - Our interactives are up               
HSPFINTR EQU   HSPFMIL+HSPFWYL+HSPFORVR  -  Their interactives are up           
HSPFJES  EQU   X'02'               - JES2 is up and ready                       
HSPFSYST EQU   X'01'               - Allow sys to bypass word (MILTEN)          
*                                                                               
&P.SYSFL DC    X'00'               System flags                                 
&P.FJES2 EQU   X'80'               - Stanford JES2 mods installed               
*                                                                               
&P.MACH  DC    X'00'               Machine flags                                
&P.FSYSA EQU   X'80'               - SYSA access allowed                        
&P.FSYSB EQU   X'40'               - SYSB access allowed                        
&P.FSYSC EQU   X'20'               - SYSC access allowed                        
&P.FSYSD EQU   X'10'               - SYSD access allowed                        
&P.FSYSE EQU   X'08'               - SYSE access allowed                        
&P.FSYSF EQU   X'04'               - SYSF access allowed                        
*                                                                               
         DC    X'00'               Reserved                                     
*                                                                               
&P.DSPTM DC    A(0)  **NO TOUCH**  SVS dispatcher clock pointer                 
&P.MILCT DC    H'0'                No. of users signed on MILTEN                
&P.INTJB DC    X'0'                Active batch-interactive job count           
&P.BLOCK DC    X'0'                Current time block (set by JES)              
&P.JESDB DC    A(0)                Ptr to JES display buffers                   
&P.MACTQ DC    A(0)                MILSERV active request queue                 
&P.MFREQ DC    A(0)                MILSERV free   request queue                 
&P.IPLTM DC    XL8'00'             STCK clock at ipl  (set by JES)              
&P.SUZCH DC    A(0)                SUZAN PCB chain                              
&P.TAPE  DC    A(0)                Ptr to tape UCB addr list (JES)              
&P.DASD  DC    A(0)                Ptr to DASD UCB addr list (JES)              
&P.SUZCL DC    A(0)                SUZAN lock counter                           
&P.SUZCT DC    A(0)                SUZAN call counter                           
&P.QSVT  DC    A(0)                QSERV SVC vector table                       
&P.NIZH1 DC    H'0'                Orvyl SIE debugging (see GSTSERV)            
&P.NIZH2 DC    H'0'                Orvyl SIE debugging (see GSTSERV)            
&P.GORIL DC    A(0)                Ptr for CUNY DFP DADSM Exit                  
&P.TLMSQ DC    A(0)                Ptr to TLMS Q parm table                     
&P.ACCES DC    A(0)                Ptr to access SVC stat area                  
*                                                                               
&P.MASCB DC    A(0)                MILTEN ASCB ptr                              
&P.MGINP DC    A(0)                MILTEN Global Info ptr                       
&P.MSITP DC    A(0)                MILTEN Sess Info table ptr                   
&P.MNSIN DC    A(0)                MILTEN SIN - max no. of entries              
&P.ACTR  DC    A(0)                Session tag counter                          
&P.ADATE DC    A(0)                Date when counter was last incr'd            
*                                                                               
&P.BLKCK DC    XL8'00'             STCK at time block change                    
&P.MILNM DS    CL8                 MILTEN jobname (zeros=not init'd)            
*                                                                               
&P.WORD  DC    XL8'00'             System word (to limit access)                
&P.MSGCK DC    F'0'                Clock (hi-word) when msg was set             
&P.MSG   DC    XL235'00'           System message (or x'00's)                   
         DC    XL250'00'           Reserved                                     
         DC    XL250'00'           Reserved                                     
         MEND                                                                   
