//WYL#ASM JOB ,CLASS=B
/*JOBPARM ONLINE=NO,HOLD=OUTPUT
// EXEC BATWYL
; This is WYL.GG.WYL.LIB#ASMALL.  Niz--11/83
;
DEF ASMX AS'EXE FRO WYL.GG.JDN.LIB#ASM CLR PAR(NOVER:'APP')'
SET TERSE
;
ASMX ACCT
ASMX ACT
ASMX COMM
ASMX SIGN
ASMX CR
ASMX EXT
ASMX DIR
ASMX DISP
ASMX DSECTS
ASMX EDIT
ASMX SPELL
ASMX DISK
ASMX FAIL
ASMX DEBUG
ASMX FILE
ASMX GLOB
ASMX HELP
ASMX INIT
ASMX IOWA
ASMX JES
ASMX KWWR
ASMX LINE
ASMX MAIL
ASMX MODE
ASMX NEWS
ASMX OPT
ASMX ORV
ASMX PAGE
ASMX PROC
ASMX EXEC
ASMX VARS
ASMX PROT
ASMX RJE
ASMX SAM
ASMX MICRO
ASMX SCAN
ASMX TAPE
ASMX TERM
ASMX TEXT
ASMX TINT
ASMX TOPS
ASMX UTIL
ASMX VIEW
LOGOFF CLR NOW
