* BE CAREFUL,NIZ
//JDN$IOLK JOB ,'IOWA LINK',CLASS=E,REGION=300K
// EXEC PURGEOLD
//CONDENSE EXEC PGM=BILBO,PARM='TRK=50'
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=OLD
//SYSUT2 DD DSN=*.SYSUT1,DISP=OLD
//SYSIN DD DUMMY
//*
//LINK EXEC PGM=HEWL,PARM='NCAL,LIST,SIZE=(300K,100K)',
// REGION=512K,COND=(4,LT,CONDENSE)
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
//OBJECT DD DSN=WYL.GG.JDN.OBJECT,DISP=SHR
//SYSLMOD DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=OLD
//SYSLIN DD *
 INCLUDE OBJECT(WYLIOWA)
 SETCODE AC(1)
 NAME IOWA(R)
