//WYL$PLNK JOB ,'Partial link',TIME=2,CLASS=E,REGION=512K
/*JOBPARM HOLD=OUTPUT,NOTIFY=GG.JDN
// EXEC PURGEOLD
//$COND EXEC PGM=BILBO,PARM='TRK=30'
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=WYL.GG.JDN.LINKLIB,DISP=OLD
//SYSUT2 DD DSN=*.SYSUT1,DISP=OLD
//SYSIN DD DUMMY
//*
//LINK EXEC PGM=HEWL,PARM='NCAL,LIST,SIZE=(300K,100K)',
// REGION=512K,COND=(4,LT,$COND)
//SYSPRINT DD SYSOUT=A
//SYSUT1 DD DSN=&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
//OLDPROD DD DSN=WYL.GS.WYL.ALPHA.LINKLIB,DISP=SHR
//OBJECT DD DSN=WYL.GG.JDN.OBJECT,DISP=SHR
//SYSLMOD DD DSN=WYL.GG.JDN.LINKLIB,DISP=OLD
//SYSLIN DD *
 INCLUDE OBJECT(WYLCOMM)
 INCLUDE OLDPROD(WYLBUR)
 ORDER CVPFX(P),WYLGLOB,CP(P)
 ENTRY WYLBUR
 SETCODE AC(1)
 NAME WYLBUR(R)
//$$QUIET EXEC PGM=HCMD,COND=(0,NE,LINK),PARM='PUR * OUT'
