//NIZWYLX JOB  GG.JDN,'TESTWYL & ORV',CLASS=X,TIME=30,
//             MSGCLASS=C
/*JOBPARM      LINES=20
//FORM   EXEC  PGM=ORVFMT,PARM='PAGE,DDN=PAGE,FDC,FDSIZE=192,VOL=2'
//STEPLIB  DD  DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//SYSUDUMP DD  SYSOUT=$
//PAGE00   DD  SPACE=(CYL,(2),,CONTIG),DISP=(,PASS),UNIT=DA3350
//PAGE01   DD  SPACE=(CYL,(5),,CONTIG),DISP=(,PASS),UNIT=DA3350
//*
//FORM2  EXEC  PGM=ORVFMT
//STEPLIB  DD  DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//SYSUDUMP DD  SYSOUT=$
//FILE00   DD  SPACE=(CYL,(5),,CONTIG),DISP=(,PASS),UNIT=DA3350
//*
//WYLBUR EXEC  PGM=HAWK,REGION=1300K,DPRTY=(9,9),PARM=AUTO
//STEPLIB  DD  DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//TASKLOG  DD  DUMMY
//SYSUDUMP DD  SYSOUT=$
//ABNLIGNR DD  DUMMY
//KWRFILE  DD  DUMMY DSN=SYS2T.TEST.COBOL.V2R3,DCB=LIMCT=10,DISP=SHR
//SYSIN    DD  *,DCB=BLKSIZE=80
DEFINE ORVYL    FROM ORVLIB PRIO 2 AUTO NOREST
DEFINE WYLBUR   FROM WYLLIB PRIO 3 AUTO NOREST
DEFINE WYLBUR   RPARM 'NAME=TESTWYL WORD=FRED FORMAT PAGE=5'
PARMSCAN;  PROCESS OS PARMS NOW
/*
//*
//*  DD CARDS FOR WYLBUR
//*
//WYLLIB   DD  DSN=WYLT.GS.WYL.LINKLIB,DISP=SHR
//SYSLOG   DD  SYSOUT=$
//*
//PAGE0    DD  DSN=&PAGE0,UNIT=SYSDA,SPACE=(CYL,4),DISP=(NEW,DELETE)
//PAGE1    DD  DSN=&PAGE1,UNIT=SYSDA,SPACE=(CYL,4),DISP=(NEW,DELETE)
//PAGE2    DD  DUMMY
//PAGE3    DD  DUMMY
//*
//HASPRDR  DD  UNIT=INTRDR
//*
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//IO       DD  DUMMY,DISP=OLD
//TM       DD  DUMMY,DISP=OLD
//TM       DD  DUMMY,DISP=OLD
//TM       DD  DUMMY,DISP=OLD
//TM       DD  DUMMY,DISP=OLD
//DD       DD  DUMMY,DISP=OLD
//DD       DD  DUMMY,DISP=OLD
//DD       DD  DUMMY,DISP=OLD
//*
//*  DD CARDS FOR ORVYL
//*
//ORVLIB   DD  DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//SYSCLP   DD  DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//SYSKAPUT DD  SYSOUT=A
//ORVINIT  DD  DSN=SYS3T.STREAM(ORVINITX),DISP=SHR
//*
//ORVPAGE0 DD  DSN=*.FORM.PAGE00,DISP=(OLD,DELETE)
//ORVPAGE1 DD  DSN=WYL.GS.ORV.XFILED,DISP=OLD
//ORVPAGE2 DD  DSN=WYL.GS.ORV.XPAGE0,DISP=OLD
//ORVPAGE3 DD  DSN=*.FORM.PAGE01,DISP=(OLD,DELETE)
//*
//DISK0    DD  DSN=WYL.GS.ORV.XFILE0,DISP=OLD
//*
//BLOT0    DD  DSN=*.FORM2.FILE00,DISP=(OLD,DELETE)
//*
//OV       DD  DUMMY,DISP=OLD
//OV       DD  DUMMY,DISP=OLD
//OV       DD  DUMMY,DISP=OLD
//P      EXEC  PGM=HCMD,PARM='PUR * OUT SYS C',COND=(0,NE)
