//WYL$XLNK JOB WYL$GG,'INSTALL XWYLBUR',REGION=150K
//COPY EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=A
//I DD DSN=WYL.GG.JDN.LINKLIB,DISP=SHR
//O DD DSN=WYL.GS.WYL.LINKLIB,DISP=SHR
//SYSIN DD *
 COPY INDD=I,OUTDD=O
 SELECT MEMBER=((WYLBUR,NWYLBUR,R))
//SYSIN DD *
 SCRATCH DSNAME=WYL.GS.WYL.LINKLIB,VOL=DASD=SYSPAK,MEMBER=XWYLBUR
 RENAME DSNAME=WYL.GS.WYL.LINKLIB,VOL=DASD=SYSPAK,                     *
               NEWNAME=XWYLBUR,MEMBER=NWYLBUR
//VERSION EXEC PGM=AMASPZAP,COND=(0,NE,COPY),REGION=64K
//SYSPRINT DD SYSOUT=A
//SYSLIB DD DSN=WYL.GS.WYL.LINKLIB,DISP=SHR
//SYSIN DD *
NAME XWYLBUR VERSION
* 4/17/81 17:06:07 (JDN): This is WYLBUR, TYPE=X.
REP 00 F0F461F1F761F8F140F1F77AF0F67AF0F7404DD1C4D55D7A40E38889A24089A2
REP 20 40E6E8D3C2E4D96B40E3E8D7C57EE74B40404040404040404040404040404040
REP 40 4040404040404040404040404040404040404040404040404040404040404040
REP 60 4040404040404040404040404040404040404040404040404040404040404040
REP 80 4040404040404040404040404040404040404040404040404040404040404040
REP A0 4040404040404040404040404040404040404040404040404040404040404040
REP C0 4040404040404040404040404040404040404040404040404040404040404040
REP E0 4040404040404040404040
//CONDENSE EXEC PGM=IEBCOPY,COND=(0,NE,COPY),PARM=COMPRESS
//SYSPRINT DD SYSOUT=A
//SYSIN DD DUMMY
//SYSUT1 DD DSN=WYL.GS.WYL.LINKLIB,DISP=SHR
//SYSUT2 DD DSN=WYL.GS.WYL.LINKLIB,DISP=SHR
// EXEC NOLIST
