* 10/14/68 INCORPORATES BLOCK TRANSFERS FROM WYLBUR WORKING DATA SET     661.
***********************************************************************  662.
*                                                                     *  663.
*                      CONTROL PROGRAM WORK AREA                      *  664.
* #  INITILIZED IN CONTROL AT START OF SESSION                        *  665.
* ## INITILIZED IN INITIAL AT START OF SESSION AND ON A CLEAR PROGRAM *  666.
* ###INITILIZED IN INITIAL AT START OF SESSION, AND ON COMMAND        *  667.
***********************************************************************  668.
*                                                                        669.
         DS    0D                                                        670.
TWORKADR DS    1F                 STARTING ADDR OF TWORK              #  671.
*      ***NOTE***  TWORKADR MUST BE FIRST WORD OF TWORK DSECT            672.
*                  SO THAT LOAD TEXT VERSION CAN WORK                    673.
*                                                                        674.
*********************MAIN CONTROL WORD*********************************  675.
*                                                                        676.
SW0      DS    X'00'              NO GO SWITCH                       #   677.
SW1      DS    X'00'              USER HIT ATTENTION SWITCH          #   678.
SW2      DS    X'00'              WORK LOAD SWITCH (BLOCKING)            679.
SW3      DS    X'00'              LODER2 CALL INHIBIT SWITCH         #   680.
SW4      DS    X'00'              WHERE AM I LEVEL 1                 #   681.
SW5      DS    X'00'              WHERE AM I LEVEL 2                 #   682.
SW6      DS    X'00'              WHERE AM I LEVEL 3                 #   683.
SW7      DS    X'00'              WHERE AM I LEVEL 4                 #   684.
SW8      DS    X'00'                                                     685.
SW9      DS    X'00'                                                     686.
SW10     DS    X'00'                                                     687.
SW11     DS    X'00'                                                     688.
*                                                                        689.
******************CLOCK************************************************  690.
*                                                                        691.
REALTIME DS    F'0'               ELAPSED TERMINAL TIME                  692.
ELAPTIME DS    F'0'               TOTAL ELAPSED CPU TIME                 693.
BREKTIME DS    F'0'               USERS TIMER INTERUPT INTERVAL          694.
LASTTIME DS    F'0'               LAST RUN TIME ELAPSED                  695.
         DS    F'0'               ELAPSED TIME AT START                  696.
LINESTAK DS    H'0'               SAVE AREA FOR LINE NUMBER ON DO        697.
         DS    H'0'               (UNUSED)                               698.
*                                                                        699.
************************WORK AREA FOR SCAN*****************************  700.
*                                                                        701.
         DS    0D                                                        702.
CLBSCAN  DS    CL8                                                       703.
         DS    F                                                         704.
         DS    F                                                         705.
         DS    F                                                         706.
         DS    F                                                         707.
*                                                                        708.
*****************CORE CONTROL TABLE************************************  709.
*                                                                        710.
TWORKSIZ DS    F'4096'            SIZE OF CONTROL PROGRAM WORK AREA   #  711.
UAREASIZ DS    F'131072'          SIZE OF COMPILER WORK AREA          #  712.
UFILESIZ DS    F'0'               SIZE OF FILE ROUTINE WORK AREA      #  713.
UAREAADR DS    1F                 STARTING ADDR OF AREA               #  714.
UFILEADR DS    1F                 STARTING ADDR OF FWORK              #  715.
*                                                                        716.
****************** USER OPTION SWITCHES AND COUNTERS*******************  717.
*                                                                        718.
         DS    0F                                                        719.
OVERSCNT DS    H'0'               NUMBER OF OVERFLOWS SO FAR        ##   720.
OVERUCNT DS    H'0'               NUMBER OF OVERFLOWS BEFORE NO MSG###   721.
OVERSTOP DS    H'0'               NUMBER OF OVERFLOWS BEFORE BREAK ###   722.
UNDRSCNT DS    H'0'               NUMBER OF UNDERFLS SO FAR         ##   723.
UNDRUCNT DS    H'0'               NUMBER OF UNDERFLS BEFORE NO MSG ###   724.
UNDRSTOP DS    H'0'               NUMBER OF UNDERFLS BEFORE BREAK  ###   725.
DIVDSCNT DS    H'0'               NUMBER OF DIV BY 0 SO FAR         ##   726.
DIVDUCNT DS    H'0'               NUMBER OF DIV BY 0 BEFORE NO MSG ###   727.
DIVDSTOP DS    H'0'               NUMBER OF DIV BY 0 BEFORE BREAK  ###   728.
RETYPESW DS    X'00'              0 = NORETYPE (DEFAULT) 1 = TYPE  ###   729.
*                                                                        730.
*******************FOR CONVERSION OF STATEMENT NUMBER******************  731.
*                                                                        732.
UPAREA   DS    1F'0'              FOR UNPACKED STATEMENT NUMBER          733.
PAREA    DS    1D'0'              FOR PACKED STATEMENT NUMBER            734.
*                                                                        735.
**********TERMINAL READ INPUT BUFFER USED BY 'INPUT'*******************  736.
*                                                                        737.
LINEIN   DS    134C' '            INPUT BUFFER                           738.
*                                                                        739.
********************OUTPUT BUFFER FOR ERROR MESSAGES*******************  740.
*                                                                        741.
ERRMESS  DS    C' '               CARRIAGE CONTROL  (NOT USED)           742.
         DC    C'LINE'                                                   743.
ERRLN    DC    C'  XXXX'          PLACE LINE NUMBER HERE                 744.
         DC    C'  '                                                     745.
ERRNO    DC    C'  YYYY)'         PLACE ERROR NUMBER HERE                746.
         DC    C' '                                                      747.
ERRMS    DS    110C' '            PLACE ERROR MESSAGE HERE               748.
*                                                                        749.
********************OUTPUT BUFFER USED BY PUTIT************************  750.
*                                                                        751.
SYSOUT   DS    130C' '            PLACE THE OUTPUT HERE                  752.
*                                                                        753.
*********************'INPUT' PRESD BUFFER***************************     754.
*                                                                        755.
INPUTP   DS    134C' '            VPRESS PROCESS TO THIS BUFFER          756.
*                                                                        757.
******************LINE FETCH CONTROL FOR READ MODE=EDIT****************  758.
*   STM  R14,R1,PRESTNUM ON RETURN FROM WAIT TI                          759.
PRESTNUM DS    F       REG 14     USUALLY NUMBER OF LINES IN BLOCK       760.
PRESTCOD DS    F       REG 15     RETURN CODE FROM READ EDIT             761.
PRESTTI  DS    F       REG  0     SHOULD BE THE SAME AS TI               762.
PRESTLNG DS    F       REG  1     USUALLY NUMBER OF BYTES IN BLOCK       763.
*                                                                        764.
**********************PREST BUFFER*************************************  765.
*                                                                        766.
         DS    0F                                                        767.
PREST1ST DS    1H                 LEFT HALF OF STATEMENT NUMBER          768.
PREST2ND DS    1H                 RIGHT HALF OF STATEMENT NUMBER         769.
PRESTBUF DS    160C               PRESSED LINE                           770.
*                                                                        771.
**********************PRESD BUFFER*************************************  772.
*                                                                        773.
         DS    0F                                                        774.
PRESD1ST DS    1H                 LEFT HALF OF STATEMENT NUMBER          775.
PRESD2ND DS    1H                 RIGHT HALF OF STATEMENT NUMBER         776.
PRESDBUF DS    133C               PRESSED LINE                           777.
         DS    1C                 FOR FORCED TRAILING BLANK              778.
PRESDLNG DS    H                  LENGTH OF PRESD LINE                   779.
*                                                                        780.
********************EXPANDED BUFFER************************************  781.
*                                                                        782.
         DS    0F                                                        783.
EXPANNUM DS    8C                 FOR LINE NUMBER  XXXX.XXX              784.
         DC    C'  '              BLANK SPACE                            785.
EXPANBUF DS    133C               EXPANDED LINE                          786.
         DS    1C                 FOR FORCED TRAILING BLANK              787.
EXPANLNG DS    H                  LENGTH OF EXPANBUF                     788.
*                                                                        789.
********************'INPUT' PRESSED BUFFER CONTROL BLOCK************     790.
*                                                                        791.
INPUTPTR DC    F'0'               ADDR OF NEXT ITEM IN BUFFER            792.
INPUTCTR DC    F'0'               CHARACTERS REMAINING IN BUFFER         793.
INPUTLNE DC    F'-1'              BASIC SOURCE LINE ASSOCIATED           794.
INPUTREQ DC    F'0'               LINE NUMBER INPUT STATEMENT REQUEST    795.
*                                                                        796.
************WORK AREA FOR INPUT TO PUT STRINGS INTO*****************     797.
*                                                                        798.
WRKSTG   DC    133C' '                                    (2/10/73/RB)   799.
*                                                                        800.
*************ARGURMENT LIST OF VPRESS AND VEXPAN********************     801.
*                                                                        802.
ARGLIST  EQU   *                                                         803.
ARG01    DS    1F           LENGTH OF THING TO BE PRESSED (VPRESS ONLY)  804.
ARG02    DS    1F                 ADDR OF SOURCE                         805.
ARG03    DS    1F                 ADDR OF OUTPUT                         806.
*                                                                        807.
***************************INLINE BUFFER****************************     808.
*                                                                        809.
         CNOP  2,4                ALIGN TO HALFWORD                      810.
INFIXLEN DC    1H'0'              NUMBER OF BYTES IN INFIX AREA          811.
INFIXNO  DC    1H'0'              BINARY BASIC STATEMENT NUMBER          812.
INFIXTP  DC    1H'0'              TYPE OF BASIC STATEMENT                813.
INFIX    DC    132H'0'            HALF WORD FORMAT OF BASIC STATEMENT    814.
INFIXCON DC    155F'0'            CONSTANTS LINKED TO PLACE IN INFIX     815.
*                                                                        816.
******************TERMINAL IDENTIFICATION******************************  817.
*                                                                        818.
TI       DS    F                  TERMINAL IDENTIFICATION             #  819.
*                                                                        820.
*                                                                        821.
*****************LAST LINE EXECUTOR EXECUTED***************************  822.
*                                                                        823.
LASTLINE DS    H                  LAST LINE EXECUTED                     824.
LINEREQS DS    H                  LINE THE USER WANTS TO START AT        825.
*                                                                        826.
****************TABLE OVERFLOW LOOP CONTROL****************************  827.
*                                                                        828.
LNELOOP  DC    H'0'                                                      829.
TYPLOOP  DC    H'0'                                                      830.
*                                                                        831.
*****************INTERRUPT SAVE AREA***********************************  832.
*                                                                        833.
         DS    0D                                                        834.
SAVEIT   EQU   *                                                         835.
TIMERPSW EQU   *                  TIMER INTERRUPT SAVE AREA              836.
CAUSE    DS    X'0000'            INTERRUPTION CODE                      837.
STATUS   DS    X'00'              BITS 0-1  INSTRUCTION LENGTH           838.
*                                      2-3  CONDITION CODE               839.
*                                       4   1= FIXED-POINT OVERFLOW      840.
*                                       5   1= DECIMAL OVERFLOW ENABLED  841.
*                                       6   1= EXPONENT UNDERFLOW        842.
*                                       7   1= EXPONENT UNDERFLOW        843.
SYSTEM   DS    X'00'              BITS  0   1= TIMER EXIT ENABLED        844.
*                                       1   1= ATTENTION EXIT ENABLED    845.
*                                       2   1= WAIT EXIT ENABLED         846.
*                                       3   1= SVC EXIT ENABLED          847.
*                                      4-7  NOT USED                     848.
ADDRESS  DS    F                  INSTRUCTION ADDRESS                    849.
GPR0     DS    F                  GENERAL PURPOSE REGISTER 0             850.
GPR1     DS    F                  GENERAL PURPOSE REGISTER 1             851.
GPR2     DS    F                  GENERAL PURPOSE REGISTER 2             852.
GPR3     DS    F                  GENERAL PURPOSE REGISTER 3             853.
GPR4     DS    F                  GENERAL PURPOSE REGISTER 4             854.
GPR5     DS    F                  GENERAL PURPOSE REGISTER 5             855.
GPR6     DS    F                  GENERAL PURPOSE REGISTER 6             856.
GPR7     DS    F                  GENERAL PURPOSE REGISTER 7             857.
GPR8     DS    F                  GENERAL PURPOSE REGISTER 8             858.
GPR9     DS    F                  GENERAL PURPOSE REGISTER 9             859.
GPR10    DS    F                  GENERAL PURPOSE REGISTER 10            860.
GPR11    DS    F                  GENERAL PURPOSE REGISTER 11            861.
GPR12    DS    F                  GENERAL PURPOSE REGISTER 12            862.
GPR13    DS    F                  GENERAL PURPOSE REGISTER 13            863.
GPR14    DS    F                  GENERAL PURPOSE REGISTER 14            864.
GPR15    DS    F                  GENERAL PURPOSE REGISTER 15            865.
FPR0     DS    D                  FLOATING POINT REGISTER 0              866.
FPR2     DS    D                  FLOATING POINT REGISTER 2              867.
FPR4     DS    D                  FLOATING POINT REGISTER 4              868.
FPR6     DS    D                  FLOATING POINT REGISTER 6              869.
SVCPSW   DS    13D                SVC INTERRUPT SAVE AREA                870.
PANICPSW DS    13D                PANIC INTERRUPT SAVE AREA              871.
ATTNPSW  DS    13D                ATTENTION INTERRUPT SAVE AREA          872.
WAITPSW  DS    13D                WAIT INTERRUPT SAVE AREA               873.
*                                                                        874.
******************"BIGBUF" INPUT BUFFER FOR READ EDIT******************  875.
*                                                                        876.
BIGBUFP  DS    F                  CURRENT BUFFER POINTER                 877.
BIGBUFC  DS    F                  LINE NUMBER CURRENTLY BEING PROCESSED  878.
BIGBUFL  DS    F                  LAST LINE NUMBER PROCESSED             879.
WORKLOAD DS    F                  NUMBER OF LINES TO BE PROCESSED        880.
BIGBUF   DS    1024C              1024 CHARACTER BUFFER                  881.
*                                                                        882.
*******************ARGUMENT POINT FOR CALL TO INLINE*******************  883.
*                                                                        884.
INLINARG DS    0D                                                        885.
INLDIN   DS    1F                 ADDRESS OF INPUT TO INLINE             886.
INLDOUT  DS    1F                 ADDRESS OF INLINE OUTPUT               887.
NUMNUM   EQU   *                  FOR CONTROL PROGRAM                    888.
INLDCN   DC    F'11'              NUMBER OF CONSTANTS                    889.
NUMSTR   EQU   *                  FOR CONTROL PROGRAM                    890.
INLDSCN  DC    F'0'               NUMBER OF STRINGS                      891.
*                                                                        892.
***********************************************************************  893.
*                                                                     *  894.
*                         INLINE WORK AREA                            *  895.
*                                                                     *  896.
***********************************************************************  897.
*                                                                        898.
***********************************************************************  899.
************** NOTE:  THOSE VARIABLES WHICH ARE DEFINED BY A  *********  900.
************** "DC" INSTRUCTION MUST BE INITIALIZED AS INDIC- *********  901.
************** ATED IN THE DEFINITION.  THOSE DEFINED IN "DS" *********  902.
************** INSTRUCTIONS NEED NOT BE INITIALIZED.          *********  903.
***********************************************************************  904.
*                                                                        905.
INLSEQTB DS    0D             SEQUENCE DECISION TABLE EXPRESSION HANDLR  906.
         DC    X'0000000100010101'                                       907.
         DC    X'0000000100010101'                                       908.
         DC    X'0000000100010101'                                       909.
         DC    X'0001010100010101'                                       910.
         DC    X'0100010001000000'                                       911.
         DC    X'0100010001000000'                                       912.
         DC    X'0100010101000001'                                       913.
         DC    20F'0'         REST OF TABLE                              914.
*                                                                        915.
INLSPAC  DC    F'0'           WORK AREA FOR BYTE TRANSLATION             916.
INLTEMP1 DC    F'0'           WORK AREA FOR NUMBER CONVERSION            917.
CONWORKA DS    0D             WORK AREA FOR CONVERT ROUTINE              918.
CONNUMBR DS    F              WORK AREA FOR NUMBER CONVERSION            919.
CONEXPON DS    F              WORK AREA FOR EXPONENT CONVERSION          920.
CONTEMP  DS    D              GENERAL PURPOSE WORK AREA                  921.
CONSWTCH DS    X              GENERAL PURPOSE UTILITY SWITCH             922.
CONSSW   DS    X              USED BY CONVERTM TO INDICATE THE NUMBER    923.
*                             WAS PRECEDED BY A MINUS SIGN               924.
CONUTSW1 DS    X              RESERVED FOR FUTURE USE                    925.
CONUTSW2 DS    X              RESERVED FOR FUTURE USE                    926.
INLFTSW  DS    X              "FIRST TIME" SWITCH FOR INTEGER HANDLER    927.
INLSTRDM DS    X              STRING ARRAY SWITCH: SET TO X'FF' FOR      928.
*                             INTEGER HANDLER BY CALLER IF STRING ARRAY  929.
*                             --OTHERWISE SET TO X'00'                   930.
INLSWTCH DS    X              ACTION SWITCH FOR INTEGER HANDLER          931.
INLSWUT2 DS    X              FIRST 4 BITS USED TO IDENTIFY DATA STMTS   932.
*                             FOR STRING SCANNER                         933.
INLSWCHS DS    0F             NOTE: THE FOLLOWING 4 SWITCHES MUST COME   934.
*                             RIGHT AFTER 'INLSWCHS' FOR INITIALIZATION  935.
*                             PURPOSES                                   936.
INLSWUTL DS    X              GENERAL PURPOSE UTILITY SWITCH             937.
INLSW    DS    X              "STATEMENT TYPE" SWITCH                    938.
INLSTRSW DS    X              SWITCH USED BY STRING CONSTANT SCANNER:    939.
*                             SET TO X'80' IF STRING > 15 CHARS (IN      940.
*                             'PRINT' STMTS ONLY)                        941.
INLXINSW DS    X              ACTION SWITCH FOR EXPRESSION HANDLER       942.
*                                                                        943.
INLEQCNT DS    F              USED BY LET AND STRING LET HANDLERS        944.
INLCNSV  DS    H              USED TO SAVE COUNT OF ITEMS IN CONSTANT    945.
INLSCNSV DS    H              TABLE SO THAT 'INLCNNM' & 'INLSCNNM' CAN   946.
*                             BE RESTORED IF SYNTAX ERROR IS FOUND       947.
*                                                                        948.
INLAINFX DS    A              CONTAINS PTR TO OUTPUT BUFFER              949.
INLCNPTR DS    F              POINTS TO NEXT AVAILABLE SPACE IN INFIX    950.
*                             CONSTANT AREA (INITIALIZED TO POINT TO     951.
*                             ALPHA+INLCNDIS IF INFIX STARTS AT ALPHA)   952.
INLSTSAV DS    9F             REGISTER SAVE AREA FOR STRING SCANNER      953.
INLXSTKB DS    A             STACK BEGINNING                             954.
INLXSTAK DS    40X           PARENS STACK                                955.
INLXPRIC DS    F             PRIMARY COUNT                               956.
INLXLPCT DS    F             LEFT PAREN COUNT (INCLUDES ONLY THOSE LEFT  957.
*                            PARENS NOT ENCLOSED BY OTHER PARENTHESES)   958.
INLXSAVL DS    3F            SAVE AREA USED BY EXPRESSION HANDLER        959.
INLSAVB1 DS    F             USED TO SAVE A(INLHERE)                     960.
INLWORKB DS    F              WORK AREA FOR INTEGER HANDLER              961.
         DS    5F            RESERVED FOR FUTURE USE                     962.
***********************************************************************  963.
