         MACRO                                                           965.
&MACRO02 XAVE  &NAME                                                     966.
&MACRO02 BC    15,14(0,15)                                               967.
         DC    AL1(8)                                                    968.
         DC    CL8'&NAME.'                                               969.
         STM   14,12,12(13)                                              970.
         BALR  12,0                                                      971.
         USING *,12                                                      972.
         LR    3,13                                                      973.
         LA    13,72(0,13)                                               974.
         ST    13,8(0,3)                                                 975.
         ST    3,4(0,13)                                                 976.
         MEND                                                            977.
