         MACRO                                                           985.
&L       XENTER &R,&S,&SZ                                                986.
         AIF   ('&L' EQ '').NEP                                          987.
         ENTRY &L                                                        988.
.NEP     ANOP                                                            989.
&L       ST    14,72(0,13)                                               990.
         STM   &R,&S,76(13)                                              991.
         LA    8,72(0,13)                                                992.
         AIF   ('&SZ' EQ '').NWA                                         993.
         AIF   ('&SZ' EQ '*').MIN                                        994.
         LA    13,((&SZ+3)/4*4)+72(,13)                                  995.
         AGO   .NWA                                                      996.
.MIN     ANOP                                                            997.
         LA    13,((&S+2-(&R))*4)+72(,13)                                998.
.NWA     BALR  7,0                                                       999.
         USING *,7                                                      1000.
         MEND                                                           1001.
