//SLP#COPY JOB ,'COPY FILE'
//*
//COPY    EXEC PGM=ADRDSSU,REGION=1024K
//SYSIN    DD  *
  COPY DATASET(INCLUDE(WYL.GS.WYL.RLG.TEST.CHECK.NEW)) -
    RENAMEU(WYL.GS.WYL.RLG.TEST.CHECK.NEW,WYL.GS.WYL.SYSG.CHECK) -
    OUTDD(MVSG02) -
    ALLDATA(*) ALLEXCP -
    CANCELERROR -
    SHARE -
    TOL(ENQF)
  COPY DATASET(INCLUDE(WYL.GS.WYL.RLG.TEST.PAGE0.NEW)) -
    RENAMEU(WYL.GS.WYL.RLG.TEST.PAGE0.NEW,WYL.GS.WYL.SYSG.PAGE0) -
    OUTDD(MVSG02) -
    ALLDATA(*) ALLEXCP -
    CANCELERROR -
    SHARE -
    TOL(ENQF)
//SYSPRINT DD  SYSOUT=A
//MVSG02   DD  VOL=SER=MVSG02,UNIT=DISK,DISP=OLD
