//TWYLCOPY JOB SLP$GG,'Copy new TESTWYL',TIME=2,CLASS=E,REGION=4096K
//*
//*  Job to re-link WYLBUR.
//*
//$$QUIET EXEC PGM=HCMDX,PARM='PURGE * Q=OUTPUT MULTIPLE'
//SYSUDUMP DD  SYSOUT=C
//*
//COPY    EXEC  PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=A
//IN       DD  DSN=WYL.GS.WYL.TESTWYL.TEST.LINKLIB,DISP=SHR
//OUT      DD  DSN=WYL.GS.WYL.TESTWYL.SYSB.LINKLIB,DISP=SHR
//SYSIN    DD  *
    C I=((IN,R)),O=OUT
    C I=OUT,O=OUT
