//RLG$INST JOB GS.WYL,'Copy test to prod',REGION=900K
/*ROUTE XEQ SYSB
//*
//*  Copy current prod load module to backup library
//*
//BCOPY EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=A
//BACK    DD DSN=WYL.GS.WYL.RLG.BLINKLIB,DISP=SHR
//PROD    DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=SHR
//SYSIN DD *
 COPY INDD=((PROD,R)),OUTDD=BACK
//*
//*  Copy test load module to production library
//*
//COPY EXEC PGM=IEBCOPY,COND=(0,NE)
//SYSPRINT DD SYSOUT=A
//PROD    DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=SHR
//TEST    DD DSN=WYL.GS.WYL.LINKLIB,DISP=SHR
//SYSIN DD *
 COPY INDD=TEST,OUTDD=PROD
 SELECT MEMBER=((WYLBUR,,R))
//*
//*  Condense backup load library
//*
//$BCOND EXEC PGM=IEBCOPY,COND=(0,NE)
//SYSPRINT DD SYSOUT=A
//SYSIN DD DUMMY
//SYSUT1 DD DSN=WYL.GS.WYL.RLG.BLINKLIB,DISP=SHR
//SYSUT2 DD DSN=WYL.GS.WYL.RLG.BLINKLIB,DISP=SHR
//*
//*  Condense production load library
//*
//$COND EXEC PGM=IEBCOPY,COND=(0,NE)
//SYSPRINT DD SYSOUT=A
//SYSIN DD DUMMY
//SYSUT1 DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=SHR
//SYSUT2 DD DSN=WYL.GS.WYL.RLG.LINKLIB,DISP=SHR
