//RLG#TEST JOB ,'SYSA to RLG test',REGION=4M
//*
//*  Copy SYSA production WYLBUR to RLG TESTWYL
//*
//COPY    EXEC PGM=IEBCOPY,REGION=4M
//SYSIN    DD  *
 COPY INDD=SYSAWYL,OUTDD=RLGTEST
 SELECT MEMBER=((WYLBUR,,R))
//SYSPRINT DD  SYSOUT=A
//SYSAWYL  DD  DSN=WYL.GS.WYL.WYLBUR.SYSA.LINKLIB,DISP=SHR
//RLGTEST  DD  DSN=WYL.GS.WYL.LINKLIB,DISP=SHR,
//             VOL=SER=SYSB01,UNIT=SYSALLDA
//*
//*  Condense RLG TESTWYL load library
//*
//$COND   EXEC PGM=IEBCOPY,COND=(0,NE,COPY)
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=WYL.GS.WYL.LINKLIB,DISP=SHR,
//             VOL=SER=SYSB01,UNIT=SYSALLDA
//SYSUT2   DD  DSN=WYL.GS.WYL.LINKLIB,DISP=SHR,
//             VOL=SER=SYSB01,UNIT=SYSALLDA
