//* Submitted using SPIRES SUBMIT, see account GS.WYL.
// EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=$
//SYSUT1 DD DSN=SYS2.TEST.COBOL.V2R3,DISP=SHR
//SYSUT2 DD DSN=SYS2.TEST.COBOL.V2R3BACK,DISP=OLD
//SYSIN DD DUMMY,DCB=BLKSIZE=80
//*
// EXEC NOLIST
