//VISTA  PROC  WYL=WYLBUR,VER=SYSA,TYPE=,CHRIS=SYSA,
//         X=INITVIST,XPARM=,RETRY=NO
//*
//*   VISTA JCL for SYSA machine.
//*
//*   Different versions are:
//*      SYSA production:      WYL.GS.WYL.WYLBUR.SYSA.LINKLIB
//*      SYSA backup prod:     WYL.GS.WYL.WYLBUR.BACK.LINKLIB
//*      SYSA testwyl:         WYL.GS.WYL.TESTWYL.SYSA.LINKLIB
//*      SYSA backup testwyl:  WYL.GS.WYL.TESTWYL.BACK.LINKLIB
//*      SYSA WVOL:            WYL.GS.WYL.SYSA.LINKLIB
//*
//*  06/03/94  slp  Modified to use new DSNs, change LIB to WYL, VER
//*
//VISTA  EXEC  PGM=WYLBUR,REGION=1000M,TIME=1440,
//  PARM=('SYSA,NOTIME,VISTA,NAME=VISTA,TASKS=1,&TYPE',
//        'TRACE,MEMBER=&X/&XPARM')
//STEPLIB  DD  DSN=WYL.GS.WYL.&WYL..&VER..LINKLIB,DISP=SHR
//         DD  DSN=WYL.GS.WYL.CHRISTA.&CHRIS..LINKLIB,DISP=SHR
//         DD  DSN=WYL.GS.WYL.SYSA.LINKLIB,DISP=SHR  (for WVOL)
//KWRFILE  DD  DSN=SYS2.TEST.COBOL.V2R3,DISP=SHR
//*
//CHECK    DD  DSN=WYL.GS.WYL.VISTA.SYSA.CHECK,DISP=OLD
//*
//JESRDR1  DD  SYSOUT=(,INTRDR)
//SYSIN    DD  DUMMY
//*
//RETRY  EXEC  PGM=OSCMD,COND=((8,GT),EVEN),
//             PARM=('S VISTA,VER=''&VER''',
//             'WYL=''&WYL'',CHRIS=''&CHRIS''RETRY=&RETRY+')
