         MACRO                                                                  
&L       LS    &AR,&LR,&AP,&LP,&TYPE=                                           
.*       MODIFIED 1/77, JDN; 2/80, JDN                                          
         LCLA  &X,&N                                                            
         LCLC  &C,&LQ                                                           
         AIF   ('&AP' EQ '').NSTR                                               
         AIF   ('&AP '(1,2) EQ 'X''').HSTR                                      
         AIF   ('&AP'(1,1) EQ '''').STR                                         
.NSTR    ANOP                                                                   
&L      $LA    &AR,&AP,ERR='LOCATION MISSING',TYPE=&TYPE                        
.LL      AIF   ('&LR' EQ '').EXIT                                               
&LQ      SETC  'L'''                                                            
        $LA    &LR,&LP,NULL=&LQ&AP                                              
         MEXIT                                                                  
.HSTR    ANOP                                                                   
&L       LA    &AR,=&AP                                                         
&N       SETA  (K'&AP-2)/2                                                      
         AIF   ('&LP' EQ '').EL                                                 
        $LA    &LR,&LP                                                          
         MEXIT                                                                  
.STR     AIF   ('&LP' NE '').LG                                                 
&L       LA    &AR,=C&AP                                                        
&X       SETA  1                                                                
&C       SETC  '&&'                                                             
.LOOP    ANOP                                                                   
&X       SETA  &X+1                                                             
         AIF   (&X GE K'&AP).EL                                                 
&N       SETA  &N+1                                                             
         AIF   ('&AP'(&X,1) NE '''' AND '&AP'(&X,1) NE '&C'(1,1)).LOOP          
&X       SETA  &X+1                                                             
         AGO   .LOOP                                                            
.EL      LA    &LR,&N                                                           
         MEXIT                                                                  
.LG      ANOP                                                                   
&L       LA    &AR,=CL(&LP)&AP                                                  
         AGO   .LL                                                              
.EXIT    MEND                                                                   
