//WINGS#BK JOB ,'Archive WINGS'
/*SETUP T3480 OUTPUT=SCRTCH
//* Archive old source
// EXEC IEBCOPY
//IN1 DD DSN=WYL.GG.WYL.WINGS.SOURCE.BACKUP,DISP=SHR
//IN2 DD DSN=WYL.GG.WYL.WINGS.MACLIB.BACKUP,DISP=SHR
//OUT1 DD DSN=WYL.GA.MCL.WINGS.SOURCE.ARCHIVE(+1),DCB=GDG,
// DISP=(,CATLG),UNIT=T3480,LABEL=RETPD=1095
//OUT2 DD DSN=WYL.GA.MCL.WINGS.MACLIB.ARCHIVE,DISP=(,KEEP),
// VOL=REF=*.OUT1,LABEL=(2,RETPD=1095)
 COPY INDD=IN1,OUTDD=OUT1
 COPY INDD=IN2,OUTDD=OUT2
