//ASM#UNPR JOB ,'WYL UNPRESS-MCL'
//*
//*  Assemble module: UNPRESS
//*
/*JOBPARM FORMS=3HOL,PFORMAT=LAND,CHARS=BD13,FORMS=GBAR
/*JOBPARM LINES=99,HOLD=OUTPUT,PURGE=NO,JCL=NO
// EXEC PURGEOLD
//ASM EXEC ASMSC,REGION=5M,TCLASS=T,
// PARM=('TERM,NORENT,NOXREF,ESD,NODXREF,LINECOUNT(32767)',
// NODECK,OBJECT,NORLD,
// 'EXIT(INEXIT(WYLSYSIN))')
//SYSLIB   DD  DSN=WYL.GA.MCL.WINGS.MACLIB,DISP=SHR
//         DD  DSN=WYL.GG.SYS.MACLIB,DISP=SHR
//         DD  DSN=SYS3.IS.MACLIB,DISP=SHR
//         DD  DSN=SYS3.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS1.MODGEN,UNIT=DISK,DISP=SHR
//         DD  DSN=SYS4.MACLIB,DISP=SHR
//SYSPRINT DD  DSN=&PRINT,UNIT=SYSDA,SPACE=(CYL,(5,5)),
//             DCB=(RECFM=FB,LRECL=133,BLKSIZE=6251),DISP=(,PASS)
//SYSIN    DD  DSN=WYL.GA.MCL.WPRESS.ASM(UNPRESS),DISP=SHR
//*
//$EDIT  EXEC  PGM=ASMEDIT,REGION=4M,PARM='STMT,DATA'
//STEPLIB  DD  DSN=WYL.GG.SYS.LINKLIB,DISP=SHR
//ASMOUT   DD  DSN=&PRINT,DISP=(OLD,DELETE)
//SYSPRINT DD  SYSOUT=A
//LINK EXEC LKED,COND=(5,LT,ASM.ASM)
//LKED.SYSLMOD DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 ENTRY ENTRY
 ALIAS WUNPRESS,WUNPRES
 NAME UNPRESS(R)
