//BACKWYL JOB
//$CLEAN EXEC CATSCR,DSN='WYL.GA.MCL.WINGS.BACK.LINKLIB'
// EXEC IEBCOPY
//IN DD DSN=WYL.GS.WYL.WINGS.LINKLIB,DISP=SHR
//OUT DD DSN=WYL.GA.MCL.WINGS.BACK.LINKLIB,DISP=(,CATLG),
// UNIT=DISK,SPACE=(TRK,(20,5,5),RLSE)
 COPY INDD=IN,OUTDD=OUT
