//BAKUPWGS JOB ,'GS.WYL.WINGS'
/*SETUP T3480=1 OUTPUT=SCRTCH
/*JOBPARM LINES=50
// EXEC PGM=ADRDSSU,REGION=2M
//SYSPRINT DD SYSOUT=A
//OUT DD UNIT=(T3480,,DEFER),DISP=(,CATLG),VOL=(,RETAIN),
// DSN=WYL.GA.MCL.WINGS.BAKWYLGS.D940426,LABEL=RETPD=730
 DUMP DATASET(INCLUDE(WYL.GS.WYL.WINGS.**)) OUTDD(OUT) +
 TOLERATE(ENQF) SHARE
