//ASMX JOB
// EXEC ASMC
FRED     CSECT
         USING *,15
         LOCATE CAMCATMD
         SPACE
         CATALOG CAMCATCT
         SPACE
         CATALOG CAMCATDL
         SPACE
         OBTAIN  CAMOBT
         SPACE
         SCRATCH CAMSCR
         SPACE
         RENAME  CAMREN
         EJECT
DSN      DC    CL44'datasetname'
VOL      DC    H'1',XL4'00',CL6'VOLSER'
WKA      DC    20F'0'
NEWNAM   DC    CL44'newdatasetname'
CCHHR    DC    X'0001000101'
TTR      DC    X'000101'
         SPACE
CAMCATMD CAMLST NAME,DSN,,WKA
         SPACE ,
CAMCATCT CAMLST CATBX,DSN,,VOL,DSCBTTR=TTR
         SPACE ,
CAMCATDL CAMLST UCATDX,DSN
         SPACE ,
CAMOBT   CAMLST SEARCH,DSN,VOL,WKA
         SPACE ,
CAMOBSK  CAMLST SEEK,CCHHR,VOL,WKA
         SPACE ,
CAMSCR   CAMLST SCRATCH,DSN,,VOL
         SPACE ,
CAMREN   CAMLST RENAME,DSN,NEWNAM,VOL
         END
