//COPYWING JOB ,'SOURCE TEST->PROD',TIME=(,15)
//BACK EXEC IOPROGM,PARM=REPLACE
//IN1 DD  DSN=WYL.GG.WYL.WINGS.SOURCE,DISP=SHR
//IN2 DD  DSN=WYL.GG.WYL.WINGS.MACLIB,DISP=SHR
//OUT1 DD DSN=WYL.GG.WYL.WINGS.SOURCE.BACKUP,DISP=SHR,
// space=(trk,(45,5,10))
//OUT2 DD DSN=WYL.GG.WYL.WINGS.MACLIB.BACKUP,DISP=SHR,
// space=(trk,(15,5,5)),RECFM=FB,LRECL=80,BLKSIZE=27920
//NEW EXEC IOPROGM,COND=(5,LT),PARM=REPLACE
//IN1 DD  DSN=WYL.GG.WYL.WINGS.TEST.ASM,DISP=SHR
//IN2 DD  DSN=WYL.GG.WYL.WINGS.TEST.MACLIB,DISP=SHR
//OUT1 DD DSN=WYL.GG.WYL.WINGS.SOURCE,DISP=SHR,
// space=(trk,(45,5,10),RLSE)
//OUT2 DD DSN=WYL.GG.WYL.WINGS.MACLIB,DISP=SHR,
// space=(trk,(15,5,5),RLSE),RECFM=FB,LRECL=80,BLKSIZE=27920
//CONDM EXEC CONDENSE,DSN='WYL.GG.WYL.WINGS.MACLIB'
//CONDS EXEC CONDENSE,DSN='WYL.GG.WYL.WINGS.SOURCE'
//CONBM EXEC CONDENSE,DSN='WYL.GG.WYL.WINGS.MACLIB.BACKUP'
//CONBS EXEC CONDENSE,DSN='WYL.GG.WYL.WINGS.SOURCE.BACKUP'
