//COPYWING JOB ,'MCL->GS.WYL.TEST',TIME=(,15)
//$CLEAN1 EXEC CATSCR,DSN='WYL.GS.WYL.WINGS.TEST.ASM'
//$CLEAN2 EXEC CATSCR,DSN='WYL.GS.WYL.WINGS.TEST.MACLIB'
//$CLEAN3 EXEC CATSCR,DSN='WYL.GS.WYL.WINGS.TEST.LKED'
//$CLEAN4 EXEC CATSCR,DSN='WYL.GS.WYL.WINGS.TEST.LIB'
//$CLEAN5 EXEC CATSCR,DSN='WYL.GS.WYL.WINGS.TEST.LIST'
// EXEC IOPROGM
//IN1 DD  DSN=WYL.GA.MCL.WINGS.ASM,DISP=SHR
//IN2 DD  DSN=WYL.GA.MCL.WINGS.MACLIB,DISP=SHR
//IN3 DD  DSN=WYL.GA.MCL.WINGS.LKED,DISP=SHR
//IN4 DD  DSN=WYL.GA.MCL.WINGS.LIB,DISP=SHR
//IN5 DD  DSN=WYL.GA.MCL.WINGS.LIST,DISP=SHR
//OUT1 DD DSN=WYL.GS.WYL.WINGS.TEST.ASM,DISP=(,CATLG),
// VOL=SER=SYSA01,
// UNIT=DISK,SPACE=(TRK,(45,10,10),RLSE)
//OUT2 DD DSN=WYL.GS.WYL.WINGS.TEST.MACLIB,DISP=(,CATLG),
// VOL=SER=SYSA01,
// UNIT=DISK,SPACE=(TRK,(15,20,25),RLSE)
//OUT3 DD DSN=WYL.GS.WYL.WINGS.TEST.LKED,DISP=(,CATLG),
// VOL=SER=SYSA01,
// UNIT=DISK,SPACE=(TRK,(1,1),RLSE)
//OUT4 DD DSN=WYL.GS.WYL.WINGS.TEST.LIB,DISP=(,CATLG),
// VOL=SER=SYSA01,
// UNIT=DISK,SPACE=(TRK,(15,5,40),RLSE)
//OUT5 DD DSN=WYL.GS.WYL.WINGS.TEST.LIST,DISP=(,CATLG),
// VOL=SER=SYSA01,
// UNIT=DISK,SPACE=(TRK,(150,15,10),RLSE)
