//WINGDOT JOB
// EXEC IOPROGM
//IN DD DSN=WYL.GA.MCL.WINGS.SOURCE,DISP=SHR
//OUT DD DSN=WYL.GA.MCL.WINGS.JUNK,DISP=(,CATLG),UNIT=DISK,
// SPACE=(TRK,(5,2,10),RLSE)
MEM=(.ASM .ASMJCL .ASMJCL0 .BACKLNK .BACKUP .BUGS .DOALL .DOC )
MEM=(.DOIT .LINK .LINKDB .LINKDBZ .LINKMON .LINKMOZ .LINKSCH )
MEM=(.NIZLINK .PJGLINK .PRODLNK .TAPEBCK .TESTLNK .TOLINDY )
