//WING#UPD JOB ,'SYSD MCL WINGS',TIME=(,5)
/*JOBPARM HOLD=OUTPUT,PURGE=NO
/*JOBPARM PFORMAT=L132,FORMS=3HOL,FLASH=BAR4
//*
//* UPDATE WINGS LIBRARIES FOR SYSD
//*
//* copy MCL.LINKLIB SYSA version to SYSD
//*
//UPPROD EXEC IEBCOPY
//SYSA DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSD DD DSN=SYS2.WINGS.SYSD.LINKLIB,DISP=SHR
  COPY INDD=((SYSA,R)),OUTDD=SYSD
  S M=(TESTAUTH,OSFILE,OSDEBUG,WINGS)
  C I=SYSD,O=SYSD
