//COPYWINB JOB ,'WINGS non-OSFILE',TIME=(,5)
//*
//*  Copy production module to back linklib
//*
//BACKPROD EXEC IEBCOPY
//PROD DD DSN=WYL.GS.WYL.WINGS.LINKLIB,DISP=SHR
//BACK DD DSN=WYL.GS.WYL.WINGS.BLINKLIB,DISP=SHR
 COPY INDD=PROD,OUTDD=BACK
 E M=(OSFILE)
