//WINGCVX JOB
// EXEC PGM=WINGCV,parm='WYL.GA.**'
//STEPLIB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//GO.SYSPRINT DD SYSOUT=*
//GO.SYSUDUMP DD SYSOUT=C
//VOL DD UNIT=SYSALLDA,DISP=SHR,VOL=SER=INT001
