//DEVX JOB
// EXEC ASMCLG
DEVX     CSECT
         ENTER
         DEVTYPE ,(DEVLIST,48),MF=(E,DEVL),UCBLIST=(UCBLIST,2)
         QSNAP (15)
         QSNAP DEVLIST,48
         EXIT  RC=(15)
         SPACE
         DC    0A(0)
UCBLIST  DC    X'00F49078',X'00F31BE8'
         SPACE
DEVLIST  DC    12F'0'
         SPACE
DEVL     DEVTYPE ,UCBLIST=YES,MF=L
         END
