//DUMPDATA JOB ,'DUMP DATASET'
/*JOBPARM LINES=200,HOLD=OUTPUT,PURGE=NO
//DSS      EXEC PGM=ADRDSSU,REGION=2M
//SYSPRINT DD SYSOUT=A
//DISK  DD  DSN=WYL.GA.MCL.Z9.WINGS.SEQXX,DISP=SHR
  PRINT INDDNAME(DISK) DATASET(WYL.GA.MCL.Z9.WINGS.SEQXX) -
  ALLDATA
