//DUMPTRAK JOB ,'DUMP TRACKS'
/*JOBPARM LINES=100
//DSS      EXEC PGM=ADRDSSU
//SYSPRINT DD SYSOUT=A
//A DD UNIT=SYSALLDA,VOL=SER=EMER14,DISP=OLD
//SYSIN    DD *
  PRINT INDDNAME(A) TRACKS (X'0010' X'0000'   X'0010' X'0001')
