[38833] FRI 01/14/94 10:18 FROM Levitt "Rich Levitt": asm jcl you asked for;
        60 LINES



//RAL#OSFI JOB RAL$GG,'Module: OSFILE',TIME=1,MSGCLASS=C
/*JOBPARM HOLD=OUTPUT,LINES=50,CHARS=TN15,NOTIFY=YES
//       EXEC PURGEOLD
//$CND   EXEC PGM=BILBO,REGION=512K,PARM='RECS=100'
//STEPLIB  DD DSN=WYL.GG.ORV.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=$
//SYSUT1   DD DSN=WYL.GG.RAL.OBJECT,DISP=OLD
//SYSUT2   DD DSN=WYL.GG.RAL.OBJECT,DISP=OLD
//SYSIN    DD DUMMY
//$UNP   EXEC PGM=WUNPRESS,PARM='NUM'
//SYSPRINT DD SYSOUT=$
//SYSUT1   DD DSN=WYL.GG.WYL.WINGS.SOURCE(OSFILE),DISP=SHR
//SYSUT2   DD DSN=&&INPUT,DISP=(,PASS),UNIT=SYSDA,
//            SPACE=(TRK,(25,25),RLSE),DCB=CARD
//ASM    EXEC PGM=ASMA90,REGION=8M,COND=(0,NE,$UNP),
//            PARM=('SYSPARM(OSFILE),TERM,LANG(EN),OBJ',
//            'LC(32500),XREF(SHORT),NODECK,NORLD,NODX')
//STEPLIB  DD DSN=SYS1.SASMMOD1,DISP=SHR
//SYSLIB   DD DSN=SYS3.DUMMYMAC,DISP=SHR,DCB=BLKSIZE=27920
//         DD DSN=WYL.GG.WYL.WINGS.MACLIB,DISP=SHR
//         DD DSN=WYL.GG.SYS.MACLIB,DISP=SHR
//         DD DSN=SYS3.IS.MACLIB,DISP=SHR
//         DD DSN=SYS3.MACLIB,DISP=SHR
//         DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=SYS1.MODGEN,DISP=SHR
//SYSUT1   DD DSN=&&SYSUT1,UNIT=VIO,DISP=(,DELETE),
//            SPACE=(4088,(500,250),,CONTIG,ROUND)
//SYSTERM  DD SYSOUT=$
//SYSPRINT DD DSN=&&PRINT,UNIT=SYSDA,DISP=(,PASS),
//            SPACE=(6650,(250,250),RLSE),
//            DCB=(BLKSIZE=6650,LRECL=133,RECFM=FB)
//SYSLIN   DD DSN=WYL.GG.RAL.OBJECT(OSFILE),DISP=OLD
//SYSUDUMP DD SYSOUT=A
//SYSIN    DD DSN=&&INPUT,DISP=(OLD,DELETE)
//$EDIT  EXEC PGM=ASMEDIT,REGION=1M,
//            COND=EVEN,PARM='STMT,DATA'
//STEPLIB  DD DSN=WYL.GG.SYS.LINKLIB,DISP=SHR
//ASMOUT   DD DSN=&&PRINT,DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=A
//SYSUDUMP DD SYSOUT=A
