//HLWINGS JOB ,'HLASM OSFILE'
/*JOBPARM LINES=50
//ASM    EXEC PGM=ASMA90,REGION=8M,
//        PARM=('SYSPARM(OSFILE),TERM,LANG(EN),OBJ,LC(32500)',
//        'XREF(SHORT),NODECK,NORLD,NODX,EXIT(INEXIT(ASMEXIT1))')
//STEPLIB  DD DSN=SYS1.SASMMOD1,DISP=SHR
//         DD DSN=WYL.GA.MCL.HLASM.LOAD,DISP=SHR
//SYSLIB   DD DSN=WYL.GA.MCL.WINGS.MACLIB,DISP=SHR
//         DD DSN=WYL.GG.SYS.MACLIB,DISP=SHR
//         DD DSN=SYS3.IS.MACLIB,DISP=SHR
//         DD DSN=SYS3.MACLIB,DISP=SHR
//         DD DSN=SYS1.MACLIB,DISP=SHR
//         DD DSN=SYS1.MODGEN,DISP=SHR
//         DD  DSN=SYS4.MACLIB,DISP=SHR
//SYSUT1   DD DSN=&&SYSUT1,UNIT=VIO,DISP=(,DELETE),
//            SPACE=(4088,(500,250),,CONTIG,ROUND)
//SYSTERM  DD SYSOUT=$
//SYSPRINT DD SYSOUT=A
//SYSLIN   DD DSN=WYL.GA.MCL.HLASM.OBJECT(OSFILE),DISP=SHR,
//             DCB=BLKSIZE=3200
//SYSUDUMP DD SYSOUT=A
//SYSIN    DD DSN=WYL.GA.MCL.WINGS.ASM(OSFILE),DISP=SHR
