//IGWASYSX JOB ,'SMF tests'
/*JOBPARM SYSAFF=SYSB
//go EXEC PGM=IGWASYSX
//STEPLIB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=* **DCB=(BUFNO=1,RECFM=FA,BLKSIZE=133)
//SYSUDUMP DD SYSOUT=C
//SYSIN DD *
WYL.GA.MCL.LIB

WYL.GA.MCL.SMS.LIB
WYL.GA.MCL.EXEC
SYS4.BETAPROC
WYL.GA.MCL.BADDATASETNAME
