//IGWASYSX JOB ,'SMS tests'
//go EXEC PGM=IGWASYSX
//STEPLIB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=* **DCB=(BUFNO=1,RECFM=FA,BLKSIZE=133)
//SYSUDUMP DD SYSOUT=C
//SYSIN DD *
WYL.GA.MCL.JUNK.NOTSMS
WYL.GA.MCL.LIB
WYL.GA.MCL.FOO.HSM01
WYL.GA.MCL.FOO.HSM02
WYL.GA.MCL.FOO.HSM03
WYL.GA.MCL.FOO.HSM04
WYL.GA.MCL.FOO.HSM05
WYL.GA.MCL.FOO.HSM06
WYL.GA.MCL.FOO.HSM07
WYL.GA.MCL.FOO.HSM08
WYL.GA.MCL.FOO.HSM09
WYL.GA.MCL.FOO.HSM10
WYL.GA.MCL.FOO.BIGCARD
WYL.GA.MCL.FOO.BIGCARD1
WYL.GA.MCL.FOO.BIGEDIT1
WYL.GA.MCL.FOO.BIGEDIT2
WYL.GA.MCL.FOO.BIGEDIT3
