//EXHUME1   JOB  ,'WYL.GA.MCL.WINGS.LIB',TIME=(,15)
// EXEC EXHUME,
// LIB='WYL.GA.MCL.WINGS.LIB',
// DUMPDSN='WYL.GA.MCL.EXHUME.TESTOUT1'
//STEPLIB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//DUMP  DD  UNIT=DISK
