//LINKWING JOB ,CLASS=E,TIME=(,15)
//$CLEAN EXEC PURGEOLD
//LKED   EXEC  PGM=HEWLH096,
//             PARM='MAP,LIST,NCAL,LET,DCBS'
//SYSPRINT DD  UNIT=VIO,SPACE=(121,(1000,100)),AVGREC=U,DISP=(,PASS)
//SYSUT1   DD  UNIT=VIO,SPACE=(1024,(100,100))
//SYSLMOD  DD  UNIT=SYSDA,DISP=(,PASS),SPACE=(1024,(100,100,5)),
//             DCB=SYS2.WINGS.TEST.LINKLIB
//OBJECT   DD  DSN=WYL.GA.MCL.WINGS.OBJECT,DISP=SHR
//SYSLIN DD DSN=WYL.GA.MCL.WINGS.LKED,DISP=SHR
//COPY   EXEC  PGM=IEBCOPY COND=(0,NE,LINK)
//SYSPRINT DD  SYSOUT=A
//IN       DD  DSN=*.LKED.SYSLMOD,DISP=(OLD,DELETE)
//OUT      DD  DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSIN    DD  *
 C I=((IN,R)),O=OUT
 C I=OUT,O=OUT
//PRINT EXEC IOPROGM,PARM=ALTPRINT
//IN DD DSN=*.LKED.SYSPRINT,DISP=(OLD,DELETE)
//ALTPRINT DD DSN=WYL.GA.MCL.WINGS.LIST(LKED),DISP=SHR
