//WINGLRP JOB ,'RACF LISTPR job'
//LISTRP  EXEC PGM=LISTRP,PARM=NOCHECK
//STEPLIB  DD  DSN=WYL.GG.SLP.LINKLIB,DISP=SHR
//SYSTSPRT DD  DSN=&&LISTRP,DISP=(NEW,PASS),
//             UNIT=SYSDA,SPACE=(TRK,(1,1))
//SYSPRINT DD  SYSOUT=A
//PRINTER  DD  SYSOUT=A
//SYSUT1   DD  UNIT=VIO,SPACE=(CYL,(10,05))
//PROFILE  DD  SYSOUT=A
//SYSUDUMP DD  SYSOUT=A
//SYSTSIN  DD  *
SEARCH MASK(GA$MCL.WYL.WINGS)
