// JOB
// EXEC IOPROGM,PARM=NOREBLOCK
//IN  DD DSN=WYL.GA.MCL.DATA.RLL.VBA,DISP=SHR
//OUT2 DD DSN=WYL.GA.MCL.DATA.RLL.VBA1,DISP=(,CATLG),UNIT=DISK,
// SPACE=(TRK,(10,1),RLSE)
