//MCLWINGS JOB ,'Test WINGS',TIME=5,CLASS=C
/*JOBPARM lines=50
//WINGS  PROC  LIB='WYL.GA.MCL.LINKLIB',
//             PATH=MCLWINGS,PARMS=
//*            INIT=MONINIT
//*
//*   WINGS JCL for MCL test WINGS
//*
//*
//MCLWINGS EXEC  PGM=WINGS,REGION=6M,
//             PARM='PATH=&PATH,&PARMS'
//STEPLIB  DD  DSN=&LIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//MONPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=C
//  pend
//MCLWINGS EXEC WINGS
//SYSIN DD *,LRECL=120                                                  UNN
;
;   MCLWINGS test parameter list
;
Define WINGSM1 Module OSFILE Parm='debug path=MCLWINGS SCRVOL=SCR002'
Define WINGSM2 Module OSFILE Parm='debug path=MCLWINGS SCRVOL=SCR002'
Define WINGSX1 Module OSFILE Parm='debug path=MCLWINGX SCRVOL=SMS002 SCRSCLAS=SCRATCH SCRMCLAS=TEMP'
Define DEBUG01  Module OSDEBUG PARM='PATH=MCLDEBUG'
Define DEBUG02  Module OSDEBUG
Start All
