//MCLWINGX JOB ,'Test WINGS',TIME=5,CLASS=C
/*JOBPARM lines=50
//WINGS  PROC  LIB='WYL.GA.MCL.LINKLIB',
//             PATH=MCLWINGX,PARMS=
//*            INIT=MONINIT
//*
//*   WINGS JCL for MCL test WINGS
//*
//*
//MCLWINGX EXEC  PGM=WINGS,REGION=6M,
//             PARM='PATH=&PATH,&PARMS'
//STEPLIB  DD  DSN=&LIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//MONPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=C
//  pend
//MCLWINGX EXEC WINGS
//SYSIN DD *                                                            UNN
;
;   MCLWINGX default parameter list (from MONTEST)
;
Define WINGSM1  Module OSFILE    Parm='debug path=MCLWINGX'
Define WINGSM2  Module OSFILE    Parm='debug path=MCLWINGX'
Define DEBUG01  Module OSDEBUG
Define DEBUG02  Module OSDEBUG
Start All
