//WINGSASM JOB ,'PRINT WINGS LIST',MSGCLASS=T
/*JOBPARM LINES=999,FORMS=GBAR
//LIST EXEC IOPROGM,PARM='ALTPRINT CC DUPLEX'
//ALTPRINT DD SYSOUT=A
//IN DD DSN=WYL.GA.MCL.WINGS.LIST,DISP=SHR
