//WINGS  PROC  VERSION=PROD,
//             RETRY=NO,PATH=WINGSV00,PARMS=,
//             INIT=MONINITD
//*
//*   WINGS JCL for SYSD machine.
//*
//*   For more information, see Mark Lawrence
//*
//WINGS  EXEC  PGM=WINGS,REGION=6M,TIME=1440,
//             PARM='PATH=&PATH,&PARMS'
//STEPLIB  DD  DSN=SYS2.WINGS.&VERSION..LINKLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//MONPRINT DD  SYSOUT=*
//SYSIN    DD  DSN=SYS2.WINGS.PARMS(&INIT),DISP=SHR,FREE=CLOSE
//SYSUDUMP DD  SYSOUT=C
//*
//RETRY  EXEC  PGM=OSCMD,COND=((8,GT),EVEN),
//             PARM=('S WINGS,VERSION=''&VERSION''',
//             'RETRY=&RETRY+')
