//LINKOSFP JOB ,'WINGS prod OSFILE',TIME=(,5)
//*
//*  Job to re-link production WINGS.
//*
//*  Copy production module to back linklib
//*
//BACKPROD EXEC IEBCOPY
//PROD DD DSN=WYL.GS.WYL.WINGS.LINKLIB,DISP=SHR
//BACK DD DSN=WYL.GS.WYL.WINGS.BLINKLIB,DISP=SHR
 COPY INDD=((PROD,R)),OUTDD=BACK
 S M=(OSFILE)
//*
//*  Copy/relink "new" module
//*
//LINK   EXEC  PGM=HEWL,PARM='XREF,LIST,NCAL,LET',COND=(5,LT)
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  UNIT=VIO,SPACE=(1024,(100,100))
//SYSLMOD  DD  UNIT=SYSDA,DISP=(,PASS),SPACE=(1024,(100,100,5)),
//             DCB=WYL.GS.WYL.WINGS.LINKLIB
//NEWOBJ   DD  DSN=WYL.GS.WYL.WINGS.LINKLIB,DISP=SHR
//SYSLIN DD *
 INCLUDE NEWOBJ(NOSFILE)
 ORDER OSFILE(P),UTILS,SCANNER,PATH,DUMPER
 ENTRY STARTUP
 SETCODE AC(1)
 NAME OSFILE(R)
//*
//*  Move new module into prod linklib
//*
//MOVENEW EXEC IEBCOPY,COND=(5,LT)
//IN       DD  DSN=*.LINK.SYSLMOD,DISP=(OLD,DELETE)
//OUT      DD  DSN=WYL.GS.WYL.WINGS.LINKLIB,DISP=SHR
//SYSIN    DD  *
 C I=((IN,R)),O=OUT
 C I=OUT,O=OUT
