//MCLWINGS JOB ,'Test WINGS',TIME=5,CLASS=C
//WINGS  PROC  LIB='WYL.GA.MCL.LINKLIB',
//             PATH=MCLWINGS,PARMS=
//*            INIT=MONINIT
//*
//*   WINGS JCL for MCL test WINGS
//*
//*
//MCLWINGS EXEC  PGM=WINGS,REGION=6M,
//             PARM='PATH=&PATH,&PARMS'
//STEPLIB  DD  DSN=&LIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//MONPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=C
//  pend
//MCLWINGS EXEC WINGS
//SYSIN DD *                                                            UNN
;
;   MCLWINGS default parameter list (from MONTEST)
;
Define WINGS01  Module OSFILE    Parm='debug path=MCLWINGS'
Define DEBUG01  Module OSDEBUG
Start All
