//WINGRX3 JOB
// EXEC ASMCLG
//ASM.SYSLIB DD DSN=WYL.GA.MCL.IOPROGM.MACLIB
WINGRX   CSECT
         REGISTER
         ENTER BASE=12
         SR    R1,R1
         MCALL MSGOPEN             Open SYSPRINT
         MVC   MSDSN0,DSNAME       Copy (original) dsn
         SPACE
         RACROUTE REQUEST=EXTRACT,TYPE=REPLACE,CLASS='DATASET',        *
               FIELDS=RFIELDS,RELEASE=1.9,ENTITY=DSNAME,GENERIC=YES,   *
               SEGDATA=SEGDATA,WORKA=WORKA,MF=S
         LR    R10,R0              Save R0
         LR    R11,R15             RC
         LA    R4,0(R1)            ->returned data (lo 3 bytes)
         L     R5,0(R4)            L'data
         ST    R0,X1
         ST    R15,X2
         MVC   X3(8),IHB0004A         codes from RACF
         LA    R1,X1               ->regs
         ST    R1,DUMPARMS
         LA    R1,DUMPARMS
         MCALL IOPDUMPR
         ST    R4,DUMPARMS         ->dat for dumper
         STA   R5,DUMLEN           L'dat (lo 3 bytes)
         ST    R4,DUMOFF           show actual address
         EDIT  MSRC,(R15),DW
         MVC   MSDSN1,DSNAME       Copy (modified) dsn
         SYSPRINT MSG1
OUT      MCALL MSGCLOSE
         EXIT  RC=(R11)
         EJECT
DW       DC    D'0'
DSNAME   DC    CL44'WYL.GA.MCL.WINGS.RACF.DATA1'
MSG1     MSG   ' DSN='
MSDSN0   DC    CL44' ',C' RC was'
MSRC     DC    CL4' ',C' Profile name ='
MSDSN1   DC    CL44' '
         MSGEND
X1       DC    F'0'
X2       DC    F'0'
X3       DC    2F'0'
         SPACE
*  Field names for RACF
         SPACE
RFIELDS  DC    A(#RF)
RF0      DC    CL8'USERID',CL8'USERACS'
#RF      EQU   (*-RF0)/8
         SPACE
SEGDATA  DC    0F'0'
         DC    F'8',CL8'GG$MPD',AL4(1),AL1(1)
SEGDATA  DC    XL4'01',X'20',X'506070'
         DC    X'31323334'
*  Parms for dumper
         SPACE
DUMPARMS DC    A(0)                ->data
DUMLEN   DC    F'16'               L'data
DUMOFF   DC    A(0)                Offset for dump label
DUMFLG   DC    AL1(2),AL3(132)     flags, line length
DUM@PRT  DC    V(IOPSYSPR)         V(sysprint writer)
DUM@TRN  DC    A(1)                ->translate table
         SPACE
$HEX     EQU   *-240
         DC    C'0123456789ABCDEF'  For hex translate
         SPACE
WORKA    DS    XL512
         END
//LKED.SYSLMOD DD DSN=WYL.GA.MCL.LINKLIB(WINGRX),DISP=SHR,SPACE=
//LKED.OBJECT DD DSN=WYL.GA.MCL.IOPROGM.OBJECT,DISP=SHR
//LKED.SYSIN DD *
 INCLUDE OBJECT(IOPSYSPR)
 INCLUDE OBJECT(IOPDUMPR)
 SETCODE AC(1)
//GO.SYSPRINT DD SYSOUT=*
//GO.SYSUDUMP DD SYSOUT=C
