[47008] THU 10/13/94 11:23 FROM Parker "Parker": Suzan PCB block in CSA;
        45 LINES

*BOX
*
* PCB--PATH CONTROL BLOCK
*
PCB      RECORD BEGIN
*
PCBNEXT  DS    A                       PCB CHAIN
PCBMY    DS    CL8                     MY SYMBOLIC NAME
PCBYOU   DS    CL8                     PARTNERS SYMBOLIC NAME
PCBPASS  DS    CL4                     PATH PASSWORD
PCBPART  DS    A                       PARTNERS PCB
PCBBUF   DS    A                       BUFFER CHAIN
PCBMXBF  DS    A                       MAXIMUM BUFFER SIZE
PCBCRBF  DS    A                       CURRENT BUFFER SIZE
PCBECB   DS    A                       ECB ADDRESS
PCBECBF  DS    A                       ADDRESS OF POST FLAGS
PCBLLOC  DS    A                       ADDRESS OF LAST LOCATED BUFFER
PCBRET15 DS    A                       REGISTER 15 RETURN AREA
PCBRET0  DS    A                       REGISTER 0 RETURN AREA
PCBRET1  DS    A                       REGISTER 1 RETURN AREA
PCBRET   EQU   PCBRET15                RETURN REGISTERS
PCBAMSK  DS    A                       ADDRESS 'AND' MASK
*
PCBXFL   FLAG
         FLAG  PCBFPRIV            - Caller is priv'd
         FLAG  PCBFABANDONED       - Partner went away w/o cleanup
         FLAG  PCBFSRBFREE         - SRB to free PCB/SRB memory
*
         DS    AL1                     AVAILABLE
*
PCBPFL   DS    AL1                     POST FLAGS
*
PCBFL    FLAG
         FLAG  PCBFVER2                VERSION 2 IN USE
         FLAG  PCBFCTL                 ME CONTROLLER (YOU JANE)
         FLAG  PCBFNAM                 SPECIFIC PARTNER REQUESTED
         FLAG  PCBFFQ                  MY FULL Q PREVENTED HIS SEND
         FLAG  PCBFTRM                 PATH TERMINATING
         FLAG  PCBFBSY                 BOTH SIDES ACTIVE
*
PCBSRB   DS    0A,(SRBSIZE)X           ROOM FOR THE SRB
         DS    0D
*
PCBINFO  DS    XL160               User information area
         END   ,
