         END   .
// EXEC LKED
//*LKED.SYSLMOD DD DSN=SYS3.IS.LINKLIB,DISP=SHR,SPACE=
//LKED.SYSLMOD DD DSN=SYS1.LINKLIST,DISP=SHR,SPACE=
//LKED.SYSIN DD *
 ENTRY ENTRY
 ALIAS WUNPRESS,WUNPRES
 NAME UNPRESS(R)
