//UNPR#UPB JOB ,'SYSB UNPRESS'
// EXEC IEBCOPY
//IN DD DSN=SYS1.LINKLIST.SYSA,DISP=SHR
//OUT DD DSN=SYS1.LINKLIST.SYSB,DISP=OLD
  COPY INDD=((IN,R)),OUTDD=OUT
  S M=(UNPRESS,WUNPRES,WUNPRESS)
