//WING#UPP JOB ,'UP SYSB PROD WINGS'
/*ROUTE XEQ SYSB
/*JOBPARM HOLD=OUTPUT,PURGE=NO,FORMS=GBAR
//*
//* Update production WINGS on SYSB
//*
//* Move PROD version to BACK, copy TEST version to PROD
//*
//BACKPROD EXEC IEBCOPY
//PROD DD DSN=SYS2.WINGS.PROD.LINKLIB,DISP=SHR
//BACK DD DSN=SYS2.WINGS.BACK.LINKLIB,DISP=SHR
  COPY INDD=((PROD,R)),OUTDD=BACK
 S M=(OSDEBUG,OSFILE,WINGS)
//UPPROD EXEC IEBCOPY,COND=(5,LT)
//TEST DD DSN=SYS2.WINGS.TEST.LINKLIB,DISP=SHR
//PROD DD DSN=SYS2.WINGS.PROD.LINKLIB,DISP=SHR
  COPY INDD=((TEST,R)),OUTDD=PROD
 S M=(OSDEBUG,OSFILE,WINGS)
