//UNPR#UP JOB ,'UNPRESS'
// EXEC IEBCOPY
//IN DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//OUT DD DSN=SYS1.LINKLIST.SYSA,DISP=SHR
  COPY INDD=((IN,R)),OUTDD=OUT
  S M=(UNPRESS,WUNPRES,WUNPRESS)
