//WING#UPB JOB ,'UP SYSB PROD WINGS'
/*JOBPARM HOLD=OUTPUT,PURGE=NO,FORMS=GBAR,SYSAFF=SYSB
//*
//* Update production WINGS, leave back version alone
//*
//UPPROD EXEC IEBCOPY
//TEST DD DSN=SYS2.WINGS.TEST.LINKLIB,DISP=SHR
//PROD DD DSN=SYS2.WINGS.PROD.LINKLIB,DISP=SHR
  COPY INDD=((TEST,R)),OUTDD=PROD
 S M=(OSDEBUG,OSFILE,WINGS)
