//WINR#UPT JOB ,'RLG TEST WINGS',TIME=(,5)
/*JOBPARM HOLD=OUTPUT,PURGE=NO
/*JOBPARM PFORMAT=L132,FORMS=3HOL,FLASH=BAR4
//*
//* UPDATE WINGS LIBRARIES FOR SYSB (Job runs on SYSA)
//*
//* copy SYSA version to SYSB in TEST.LINKLIB
//*
//UPPROD EXEC IEBCOPY
//SYSA DD DSN=SYS2.WINGS.TEST.LINKLIB,DISP=SHR
//SYSB DD DSN=SYS2.WINGS.TEST.LINKLIB,DISP=SHR,UNIT=SYSALLDA,
//       VOL=SER=SYSB01,DCB=BLKSIZE=32760
  COPY INDD=((SYSA,R)),OUTDD=SYSB
  S M=(OSFILE,OSDEBUG,WINGS)
