//WINR#UPM JOB ,'RLG MCL WINGS',TIME=(,5)
/*JOBPARM HOLD=OUTPUT,PURGE=NO
/*JOBPARM PFORMAT=L132,FORMS=3HOL,FLASH=BAR4
//*
//* UPDATE WINGS LIBRARIES FOR SYSB (Job runs on SYSA)
//*
//* copy SYSA version to SYSB in MCL.LINKLIB
//*
//UPPROD EXEC IEBCOPY
//SYSA DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR,UNIT=SYSALLDA,
//       VOL=SER=SYSB02,DCB=BLKSIZE=32760
  COPY INDD=((SYSA,R)),OUTDD=SYSB
  S M=(OSFILE,OSDEBUG,WINGS)
