//WING#UPT JOB ,'UP SYSB TEST WINGS'
/*ROUTE XEQ SYSB
/*JOBPARM HOLD=OUTPUT,PURGE=NO,FORMS=GBAR
//*
//* Update test WINGS on SYSB
//*
//* Move MCL version to TEST
//*
//UPTEST EXEC IEBCOPY
//MCL  DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//TEST DD DSN=SYS2.WINGS.TEST.LINKLIB,DISP=SHR
  COPY INDD=((MCL,R)),OUTDD=TEST
  S M=(OSDEBUG,OSFILE,WINGS)
