//ZAP#WIND JOB ,'ZAP SYSD WINGS',TIME=(,5)
/*JOBPARM FORMS=3HOL,PFORMAT=L132,FLASH=BAR4,DUPLEX=YES
/*JOBPARM PURGE=NO,HOLD=OUTPUT
//ZAP  EXEC  ZAP
//SYSLIB DD DSN=SYS2.WINGS.SYSD.LINKLIB,DISP=SHR
//SYSIN DD *
* disable QSNAP
NAME OSFILE OSFILE
IDRDATA QSNAPEE0
VER 0EE0 0ADE,0808,0000,8000       QSNAP SVC and data
REP 0EE0 4700,0000,4700,0000       nop...
