//ZAP#WINX JOB ,'ZAP MCL WINGS',TIME=(,5)
/*JOBPARM FORMS=3HOL,PFORMAT=L132,FLASH=BAR4,DUPLEX=YES
/*JOBPARM PURGE=NO,HOLD=OUTPUT
//ZAP  EXEC  ZAP
//SYSLIB DD DSN=WYL.GA.MCL.LINKLIB,DISP=SHR
//SYSIN DD *
NAME OSFILE OSFILE
IDRDATA LIKENAME
VER 8F26 D22B,8064,C0E0            MVC   FSHOLIKE,GVTBLANK
REP 8F2A B5C1                      MVC   FSHOLIKE,TVTPBNAME
