// JOB ,'OS.INTERFAC',CLASS=E,TIME=(,15)
/*JOBPARM CHARS=TN12,F=GBAR,LINES=7
//* OS.INTERFAC must be card-image
//SCR EXEC PGM=IEFBR14
//DD0 DD UNIT=DISK,DISP=(OLD,UNCATLG),DSN=WYL.GQ.PUB.PL.OS.OBJ
//DD1 DD UNIT=DISK,DISP=(OLD,DELETE),DSN=WYL.GQ.PUB.PL.OS.OBJ
//ASM  EXEC  ASMC,REGION=256K
//SYSLIN DD DSN=WYL.GQ.PUB.PL.OS.OBJ,
//          UNIT=DISK,DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB),
//          SPACE=(TRK,(2,2),RLSE),DISP=(NEW,CATLG)
//SYSIN  DD DSN=WYL.GQ.PUB.OS.INTERFAC,DISP=SHR
