// JOB ,'PL360 LOADLIB',CLASS=E,TIME=(,15)
//ASMRLG    PROC  LEVEL=H
//ASM    EXEC  PGM=ASM&LEVEL,ACCT=(ASMCL,SYS4)
//STEPLIB  DD  DSN=SYS2.ASMH.SLACV29.LINKLIB,DISP=SHR
//SYSLIB   DD  DSN=SYS4.DUMMYMAC,DISP=SHR
//         DD  DSN=SYS1.MACLIB,DISP=SHR
//         DD  DSN=SYS3.MACLIB,DISP=SHR
//         DD  DSN=SYS4.MACLIB,DISP=SHR
//SYSLIN   DD  DSN=&&LOADSET,UNIT=SYSDA,SPACE=(3120,(40,10),RLSE),
//             DISP=(MOD,PASS),DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//SYSPRINT DD  SYSOUT=A
//SYSPUNCH DD  SYSOUT=B
//SYSTERM  DD  SYSOUT=A
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,
//             SPACE=(3120,(120,10),,,ROUND),DCB=BLKSIZE=3120
//SYSUT2   DD  DSN=&&SYSUT2,UNIT=SYSDA,
//             SPACE=(3120,(120,10),,,ROUND),DCB=BLKSIZE=3120
//SYSUT3   DD  DSN=&&SYSUT3,UNIT=SYSDA,
//             SPACE=(3120,(120,10),,,ROUND),DCB=BLKSIZE=3120
//LKED   EXEC  PGM=IEWL,PARM=(LET,LIST,MAP,DC),COND=(5,LT,ASM)
//SYSLIB   DD  DSN=SYS4.DUMMYLIB,DISP=SHR
//SYSLIN   DD  DSN=*.ASM.SYSLIN,DISP=(OLD,PASS)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=&&GOSET(MAIN),DISP=(NEW,KEEP)
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
// PEND
//* SYSIN source code should be card-image
//STEP0 EXEC PGM=IEFBR14
//DD0 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LOADLIB,
//       DISP=(OLD,UNCATLG),DSN=SYS2.PL360.TEST.LOADLIB
//DD1 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LOADLIB,
//       DISP=(OLD,DELETE),DSN=SYS2.PL360.TEST.LOADLIB
//STEP1 EXEC ASMRLG
//ASM.SYSIN DD DSN=WYL.GQ.PUB.OS.PL360IO,DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.PL360.TEST.LOADLIB,
//  UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LOADLIB,
//  DISP=(NEW,CATLG),SPACE=(TRK,(1,1,3))
//LKED.SYSIN DD *
 ALIAS READ,WRITE,PAGE,PUNCH,PRINT
 NAME CANCEL
/*
//STEP2 EXEC ASMRLG
//ASM.SYSLIN DD DISP=(OLD,PASS)
//ASM.SYSIN DD DSN=WYL.GQ.PUB.OS.PLTAPEIO,DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.PL360.TEST.LOADLIB,DISP=(OLD,KEEP)
//LKED.SYSIN DD *
 ALIAS GET,PUT,KLOSE
 NAME OPEN
/*
//STEP3 EXEC PGM=PL360
//STEPLIB DD DSN=SYS2.PL360.PROD.LINKLIB,DISP=SHR
//SYSGO    DD  DSN=&&LOADSET,UNIT=SYSDA,SPACE=(3120,(40,10),RLSE),
//             DISP=(OLD,PASS),DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//SYSPRINT DD SYSOUT=A
//SYSIN DD DSN=WYL.GQ.PUB.PL360.RUNLIB(BCDVAL),DISP=SHR
//LKED3  EXEC  PGM=IEWL,PARM=(LET,LIST,MAP,DC),COND=(5,LT,STEP3)
//SYSLIB   DD  DSN=SYS4.DUMMYLIB,DISP=SHR
//SYSLIN   DD  DSN=*.STEP3.SYSGO,DISP=(OLD,PASS)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=SYS2.PL360.TEST.LOADLIB,DISP=(OLD,KEEP)
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
//SYSIN DD *
 ALIAS BCDTOVAL
 NAME VALTOBCD
/*
//STEP4 EXEC PGM=PL360
//STEPLIB DD DSN=SYS2.PL360.PROD.LINKLIB,DISP=SHR
//SYSGO    DD  DSN=&&LOADSET,UNIT=SYSDA,SPACE=(3120,(40,10),RLSE),
//             DISP=(OLD,PASS),DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//SYSPRINT DD SYSOUT=A
//SYSIN DD DSN=WYL.GQ.PUB.PL360.RUNLIB(SHELSORT),DISP=SHR
//LKED4  EXEC  PGM=IEWL,PARM=(LET,LIST,MAP,DC),COND=(5,LT,STEP4)
//SYSLIB   DD  DSN=SYS4.DUMMYLIB,DISP=SHR
//SYSLIN   DD  DSN=*.STEP4.SYSGO,DISP=(OLD,PASS)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=SYS2.PL360.TEST.LOADLIB,DISP=(OLD,KEEP)
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
//SYSIN DD *
 NAME SHELSORT
/*
//STEP5 EXEC PGM=PL360
//STEPLIB DD DSN=SYS2.PL360.PROD.LINKLIB,DISP=SHR
//SYSGO    DD  DSN=&&LOADSET,UNIT=SYSDA,SPACE=(3120,(40,10),RLSE),
//             DISP=(OLD,PASS),DCB=(LRECL=80,BLKSIZE=3120,RECFM=FB)
//SYSPRINT DD SYSOUT=A
//SYSIN DD DSN=WYL.GQ.PUB.PL360.RUNLIB(BISEARCH),DISP=SHR
//LKED5  EXEC  PGM=IEWL,PARM=(LET,LIST,MAP,DC),COND=(5,LT,STEP5)
//SYSLIB   DD  DSN=SYS4.DUMMYLIB,DISP=SHR
//SYSLIN   DD  DSN=*.STEP5.SYSGO,DISP=(OLD,PASS)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD  DSN=SYS2.PL360.TEST.LOADLIB,DISP=(OLD,KEEP)
//SYSPRINT DD  SYSOUT=A
//SYSUT1   DD  DSN=&&SYSUT1,UNIT=SYSDA,SPACE=(3120,(120,10),,,ROUND)
//SYSIN DD *
 NAME BISEARCH
/*
//SCR2 EXEC PGM=IEFBR14,COND=(0,NE)
//DD0 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LOADLIB,
//       DISP=(OLD,UNCATLG),DSN=SYS2.PL360.BACK.LOADLIB
//DD1 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LOADLIB,
//       DISP=(OLD,DELETE),DSN=SYS2.PL360.BACK.LOADLIB
//RENAME EXEC PGM=IDCAMS,COND=(0,NE)
//SYSPRINT DD SYSOUT=A
//SYSIN    DD *
 ALTER  'SYS2.PL360.PROD.LOADLIB' NEWNAME(SYS2.PL360.BACK.LOADLIB)
 ALTER  'SYS2.PL360.TEST.LOADLIB' NEWNAME(SYS2.PL360.PROD.LOADLIB)
/*
//DONE EXEC PGM=HCMD,COND=(0,NE),PARM='PURGE * OUTPUT'
//FAIL EXEC BATWYL,COND=(EVEN,(0,EQ,DONE)),
//     PARM='SEND (GQ.PUB) LOADLIB failed.'
