// JOB ,'PL360 LINKLIB',CLASS=E,TIME=(,15)
/*JOBPARM CHARS=TN12,F=GBAR,LINES=1
//SCR1 EXEC PGM=IEFBR14
//DD0 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LINKLIB,
//       DISP=(OLD,UNCATLG),DSN=SYS2.PL360.TEST.LINKLIB
//DD1 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LINKLIB,
//       DISP=(OLD,DELETE),DSN=SYS2.PL360.TEST.LINKLIB
//LINK EXEC PGM=IEWL,PARM='MAP,DC'
//SYSPRINT DD SYSOUT=A
//SYSLMOD DD DSN=SYS2.PL360.TEST.LINKLIB(PL360),
//  UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LINKLIB,
//  DISP=(NEW,CATLG),SPACE=(TRK,(3,1,1),RLSE)
//SYSLIN DD DSN=WYL.GQ.PUB.PL360.OBJ,DISP=OLD
//       DD DSN=WYL.GQ.PUB.PL.OS.OBJ,DISP=OLD
//SYSUT1 DD UNIT=SYSDA,SPACE=(3120,(40,40),,,ROUND)
//SCR2 EXEC PGM=IEFBR14,COND=(0,NE)
//DD0 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LINKLIB,
//       DISP=(OLD,UNCATLG),DSN=SYS2.PL360.BACK.LINKLIB
//DD1 DD UNIT=DISK,VOL=REF=SYS2.PL360.PROD.LINKLIB,
//       DISP=(OLD,DELETE),DSN=SYS2.PL360.BACK.LINKLIB
//RENAME EXEC PGM=IDCAMS,COND=(0,NE)
//SYSPRINT DD SYSOUT=A
//SYSIN    DD *
 ALTER  'SYS2.PL360.PROD.LINKLIB' NEWNAME(SYS2.PL360.BACK.LINKLIB)
 ALTER  'SYS2.PL360.TEST.LINKLIB' NEWNAME(SYS2.PL360.PROD.LINKLIB)
/*
//DONE EXEC PGM=HCMD,COND=(0,NE),PARM='PURGE * OUTPUT'
//FAIL EXEC BATWYL,COND=(EVEN,(0,EQ,DONE)),
//     PARM='SEND (GQ.PUB) LINKLIB failed.'
