ITEST    TITLE 'Test suite for 370 instructions'                                
*******************************************************************             
*                                                                 *             
*     WYLBUR/370 - Release VI - Class I - Stanford Proprietary    *             
*                                                                 *             
*******************************************************************             
         HIBAL                                                                  
*                                                                               
         EJECT                                                                  
WYLITEST CSECT                                                                  
         REGS  FSR,,,,,,,BR,(WAR,LSR),PAR,PBR,CPR,CVR,SPR,RAR                   
*                                                                               
ITES     IDENT 2010                10:26:03 01/10/02  (SLP)                     
*                                                                               
         SYSDEFN ,                 Define installation values                   
*                                                                               
         PUSH  DSECTS                                                           
         TITLE 'DSECTS'                                                         
         COPY  CONTROL             Copy CV/CP                                   
         TITLE 'DSECTS'                                                         
         POP   DSECTS                                                           
*                                                                               
         MACRO                                                                  
&L       MWRITE &M                                                              
&L       SETMSG &M                                                              
         ACALL MWRITE                                                           
         MEND                                                                   
*                                                                               
* this module contains 370 instructions.  they are tested                       
* for WTOC compatability.  instruction limitations are                          
* listed in lines starting with '* RESTRICTION'.  please                        
* do not use restricted forms of instructions within                            
* WYLBUR.  this module must run on all platforms, all                           
* restrictions should be noted.  please add comments and                        
* instruction tests as needed.                                                  
*                                                                               
* note:                                                                         
* all general purpose instructions are supported with the                       
* exception of CS, CDS, STCK, and TS.  no packed decimal                        
* instructions are supported other than ED and EDMK.  no                        
* floating point instructions are supported.  the general                       
* purpose instructions are restricted as indicated below.                       
* needless to say SVC instruction is not supported.                             
*                                                                               
* restriction on coding style (ie. proc-pend style,                             
* base register must be r7, no V-cons other than                                
* VCALLs, strict use of scan macros) will be commented                          
* on later.  see CH or NIZ.                                                     
*                                                                               
WYLITEST CSECT                                                                  
         DC    C'OH YEAH(tm) !!!!'                                              
         SPACE 1                                                                
         AIF   (&$PCODE).CCODE                                                  
         AGO   .NOCCODE                                                         
.CCODE   ANOP                                                                   
*                                                                               
* MSG WRITE - ROUTINE IN C-CODE                                                 
*                                                                               
MWRITE   PROC                                                                   
         NOOP                                                                   
*C-EXTERN extern void msg_write();                                              
*C-CODE msg_write();                                                            
         PEND                                                                   
         AGO   .IERDONE                                                         
.NOCCODE ANOP                                                                   
*                                                                               
*  MSG-WRITE - STANDARD ROUTINE                                                 
*                                                                               
MWRITE   PROC                                                                   
         TSEG  (R1),(R0),CR                                                     
         TWRITE                                                                 
         PEND                                                                   
         AGO   .IERDONE                                                         
.IERDONE ANOP                                                                   
         EJECT                                                                  
         TITLE 'ITEST ROUTINES'                                                 
*                                                                               
**                                                                              
**  TEST - entry point for 370 instruction test                                 
**                                                                              
**                                                                              
*                                                                               
WITEST   XPROC ,                                                                
         IF    ^CPSFSPR,'VCALL NOTVALID'                                        
*                                                                               
*                                                                               
         ACALL ITEST                                                            
         B     CVNEXT                                                           
         PEND                                                                   
*                                                                               
*                                                                               
*                                                                               
*  TEST IBM 370 INSTRUCTIONS  (FOR WTOC)                                        
*                                                                               
*  NOTE:                                                                        
*  BECAUSE TESTS ARE LONG WINDED, WE MUST DIVIDE INTO                           
*  SEVERAL ROUTINES FOR ADDRESSABILITY.                                         
*                                                                               
*                                                                               
ITESTWA  RECORD BEGIN                                                           
F1       DS    F                                                                
F2       DS    F                                                                
F3       DS    F                                                                
F4       DS    F                                                                
BUF1     DS    CL1024                                                           
BUF2     DS    CL1024                                                           
         END                                                                    
*                                                                               
ITEST    XPROC  ITESTWA                                                         
*                                                                               
* DO PRELIMINARY TESTS L, LH, ST, CLC, C                                        
*                                                                               
         L     R1,=F'400001'                                                    
         IF    (R1,NE,400001),BEGIN                                             
         MWRITE 'L FAILED'                                                      
         EXIT  ITEST                                                            
         END                                                                    
         LH    R1,=H'2001'                                                      
         IF    (R1,NE,2001),BEGIN                                               
         MWRITE 'LH FAILED'                                                     
         EXIT  ITEST                                                            
         END                                                                    
         ST    R1,F1                                                            
         IF    (F1,NE,2001),BEGIN                                               
         MWRITE 'ST FAILED'                                                     
         EXIT  ITEST                                                            
         END                                                                    
         L     R1,=X'F1F2F3F4'                                                  
         L     R2,=X'F1F2F3F4'                                                  
         L     R3,=X'F3F4F5F6'                                                  
         ST    R1,F1                                                            
         ST    R2,F2                                                            
         ST    R3,F3                                                            
         CLC   F1,F2                                                            
         IF    NE,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         EXIT  ITEST                                                            
         END                                                                    
         CLC   F1,F3                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         EXIT  ITEST                                                            
         END                                                                    
*                                                                               
* DO STANDARD TESTS                                                             
*                                                                               
         ACALL DOTEST1                                                          
         ACALL DOTEST2                                                          
         ACALL DOTEST3                                                          
         ACALL DOTEST4                                                          
         ACALL DOTEST6                                                          
         ACALL DOTEST7                                                          
         ACALL DOTEST8                                                          
         ACALL DOTEST9                                                          
         ACALL DOTEST10                                                         
         ACALL DOTEST11                                                         
         ACALL DOTEST12                                                         
*                                                                               
         MWRITE 'All Done.'                                                     
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
         EJECT                                                                  
*                                                                               
*  DO TESTS                                                                     
*                                                                               
DOTEST1  PROC  ITESTWA                                                          
* AR                                                                            
* RESTRICTION AR, A, AH - COND CODE NOT SET PROPERLY FOR OVERFLOW               
* RESTRICTION AR, A, AH - OFERFLOW NOT PROCESSED CORRECTLY                      
         L     R1,=F'1'                                                         
         L     R2,=F'2'                                                         
         AR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'AR FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'-2'                                                        
         AR    R1,R2                                                            
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'AR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'4000000'                                                   
         AR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,8000011)),BEGIN                                    
         MWRITE 'AR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-8000011'                                                  
         AR    R1,R2                                                            
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'AR FAILED'                                                     
         END                                                                    
         L     R1,=F'-8000011'                                                  
         L     R2,=F'4000011'                                                   
         AR    R1,R2                                                            
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'AR FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'-430030'                                                   
         AR    R1,R2                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'AR FAILED'                                                     
         END                                                                    
* A                                                                             
         L     R1,=F'1'                                                         
         A     R1,=F'2'                                                         
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'A FAILED'                                                      
         END                                                                    
         L     R1,=F'-1'                                                        
         A     R1,=F'-2'                                                        
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'A FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         A     R1,=F'4000000'                                                   
         IF    (NP,OR,(R1,NE,8000011)),BEGIN                                    
         MWRITE 'A FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         A     R1,=F'-8000011'                                                  
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'A FAILED'                                                      
         END                                                                    
         L     R1,=F'-8000011'                                                  
         A     R1,=F'4000011'                                                   
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'A FAILED'                                                      
         END                                                                    
         L     R1,=F'430030'                                                    
         A     R1,=F'-430030'                                                   
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'A FAILED'                                                      
         END                                                                    
* AH                                                                            
         LH    R1,=H'1'                                                         
         AH    R1,=H'2'                                                         
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'AH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-1'                                                        
         AH    R1,=H'-2'                                                        
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'AH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         AH    R1,=H'4000'                                                      
         IF    (NP,OR,(R1,NE,8011)),BEGIN                                       
         MWRITE 'AH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         AH    R1,=H'-8011'                                                     
         IF    (NL,OR,(R1,NE,-4000)),BEGIN                                      
         MWRITE 'AH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-8011'                                                     
         AH    R1,=H'4011'                                                      
         IF    (NL,OR,(R1,NE,-4000)),BEGIN                                      
         MWRITE 'AH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4330'                                                      
         AH    R1,=H'-4330'                                                     
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'AH FAILED'                                                     
         END                                                                    
* ALR                                                                           
* RESTRICTION ALR - CONDITION CODE NOT SET                                      
         L     R1,=F'1'                                                         
         L     R2,=F'2'                                                         
         ALR   R1,R2                                                            
         IF    (R1,NE,3),BEGIN                                                  
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'-2'                                                        
         ALR   R1,R2                                                            
         IF    (R1,NE,-3),BEGIN                                                 
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'4000000'                                                   
         ALR   R1,R2                                                            
         IF    (R1,NE,8000011),BEGIN                                            
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-8000011'                                                  
         ALR   R1,R2                                                            
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
         L     R1,=F'-8000011'                                                  
         L     R2,=F'4000011'                                                   
         ALR   R1,R2                                                            
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'-430030'                                                   
         ALR   R1,R2                                                            
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'ALR FAILED'                                                    
         END                                                                    
* AL                                                                            
* RESTRICTION AL - CONDITION CODE NOT SET                                       
         L     R1,=F'1'                                                         
         AL    R1,=F'2'                                                         
         IF    (R1,NE,3),BEGIN                                                  
         MWRITE 'AL FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         AL    R1,=F'-2'                                                        
         IF    (R1,NE,-3),BEGIN                                                 
         MWRITE 'AL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         AL    R1,=F'4000000'                                                   
         IF    (R1,NE,8000011),BEGIN                                            
         MWRITE 'AL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         AL    R1,=F'-8000011'                                                  
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'AL FAILED'                                                     
         END                                                                    
         L     R1,=F'-8000011'                                                  
         AL    R1,=F'4000011'                                                   
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'AL FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         AL    R1,=F'-430030'                                                   
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'AL FAILED'                                                     
         END                                                                    
* NR                                                                            
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         NR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'NR FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         NR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'F0F00000')),BEGIN                                 
         MWRITE 'NR FAILED'                                                     
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'F0F00000'                                                  
         NR    R1,R2                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'NR FAILED'                                                     
         END                                                                    
* N                                                                             
         L     R1,=X'0000FFFF'                                                  
         N     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'N FAILED'                                                      
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         N     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'F0F00000')),BEGIN                                 
         MWRITE 'N FAILED'                                                      
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         N     R1,=X'F0F00000'                                                  
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'N FAILED'                                                      
         END                                                                    
* PRELIMINARY TEST MVI                                                          
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         MVI   F1,X'0F'                                                         
         L     R1,F1                                                            
         IF    (R1,NE,X'0F000000'),BEGIN                                        
         MWRITE 'MVI FAILED'                                                    
         END                                                                    
* NI                                                                            
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         MVI   F1,X'0F'                                                         
         NI    F1,X'55'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'05000000')),BEGIN                                 
         MWRITE 'NI FAILED'                                                     
         END                                                                    
         MVI   F1,X'F0'                                                         
         NI    F1,X'F1'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F0000000')),BEGIN                                 
         MWRITE 'NI FAILED'                                                     
         END                                                                    
         MVI   F1,X'F0'                                                         
         NI    F1,X'0F'                                                         
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,X'00000000')),BEGIN                                
         MWRITE 'NI FAILED'                                                     
         END                                                                    
* NC                                                                            
         L     R1,=X'0000FFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         L     R3,=F'0'                                                         
         ST    R3,F3                                                            
         NC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'NC FAILED'                                                     
         END                                                                    
         L     R2,F2                                                            
         IF    (R2,NE,X'F0F0F0F0'),BEGIN                                        
         MWRITE 'NC FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         NC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F0F00000')),BEGIN                                 
         MWRITE 'NC FAILED'                                                     
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F00000'                                                  
         ST    R2,F2                                                            
         NC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'NC FAILED'                                                     
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST2  PROC  ITESTWA                                                          
*                                                                               
*  BRANCH INSTRUCTIONS                                                          
*                                                                               
* BALR                                                                          
* RESTRICTION BALR - ONLY BALR Rn,0 ALLOWED, TREATED AS NO-OP                   
* RESTRICTION BALR - CALLS MUST BE DONE WITH ACALL/VCALL MACROS                 
         BALR  R0,0                                                             
         BALR  R6,0                                                             
* BAL                                                                           
* RESTRICTION BAL - NOT ALLOWED                                                 
* RESTRICTION BAL - CALLS MUST BE DONE WITH LCALL MACRO                         
* RESTRICTION BAL - BAL FORM OF NO-OP NOT ALLOWED                               
         SPACE 1                                                                
* BASR                                                                          
* RESTRICTION BASR - ONLY BASR Rn,0 ALLOWED, TREATED AS NO-OP                   
* RESTRICTION BASR - CALLS MUST BE DONE WITH ACALL/VCALL MACROS                 
         BASR  R0,0                                                             
         BASR  R6,0                                                             
* BAS                                                                           
* RESTRICTION BAS - NOT ALLOWED                                                 
* RESTRICTION BAS - CALLS MUST BE DONE WITH LCALL MACRO                         
* RESTRICTION BAS - BAS FORM OF NO-OP NOT ALLOWED                               
         SPACE 1                                                                
* BASSM                                                                         
* RESTRICTION BASSM - NOT ALLOWED                                               
         SPACE 1                                                                
* BSM                                                                           
* RESTRICTION BSM - NOT ALLOWED                                                 
         SPACE 1                                                                
* BCR                                                                           
* RESTRICTION BCR - NOT ALLOWED                                                 
* NOTE: BCR R14 WAS TO BE TREATED AS 'RETURN', BUT THIS IS A                    
* POOR CHOICE SINCE THE PROC/PEND MODEL IS TO BE A STANDARD                     
         SPACE 1                                                                
* BC                                                                            
* RESTRICTION BC - R7 MUST BE BASE REGISTER                                     
* RESTRICTION BC - R12 MAY BE USED WITH CV-LABEL EXIT                           
* RESTRICTION BC - BRANCH MUST BE LOCAL WITHIN CURRENT PROC                     
* RESTRICTION -- - ALL CODE MUST FALL WITHIN LOCAL PROCS                        
         L     R1,=F'1'                                                         
         LTR   R1,R1                                                            
         IF    NH,BEGIN                                                         
         MWRITE 'BC FAILED'                                                     
         END                                                                    
         L     R1,=F'0'                                                         
         LTR   R1,R1                                                            
         IF    NZ,BEGIN                                                         
         MWRITE 'BC FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         LTR   R1,R1                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'BC FAILED'                                                     
         END                                                                    
         L     R1,=F'1'                                                         
         LTR   R1,R1                                                            
         IF    H,BEGIN                                                          
         END                                                                    
         ELSE  BEGIN                                                            
         MWRITE 'BC FAILED'                                                     
         END                                                                    
         L     R1,=F'0'                                                         
         LTR   R1,R1                                                            
         IF    Z,BEGIN                                                          
         END                                                                    
         ELSE  BEGIN                                                            
         MWRITE 'BC FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         LTR   R1,R1                                                            
         IF    L,BEGIN                                                          
         END                                                                    
         ELSE  BEGIN                                                            
         MWRITE 'BC FAILED'                                                     
         END                                                                    
* BCTR                                                                          
* RESTRICTION BCTR - ONLY ALLOWED BCTR Rn,0 - TREATED AS DECREMENT              
         L     R1,=F'12'                                                        
         BCTR  R1,0                                                             
         IF    (R1,NE,11),BEGIN                                                 
         MWRITE 'BCTR FAILED'                                                   
         END                                                                    
* BCT                                                                           
* RESTRICTION BCT - LABEL MUST BE R7 BASED AND WITHIN LOCAL PROC                
         L     R1,=F'0'                                                         
         L     R6,=F'6'                                                         
BCTLOOP  LABEL ,                                                                
         LA    R1,1(R1)                                                         
         BCT   R6,BCTLOOP                                                       
         IF    ((R1,NE,6),OR,(R6,NE,0)),BEGIN                                   
         MWRITE 'BCT FAILED'                                                    
         END                                                                    
* BXH                                                                           
* RESTRICTION BXH - LABEL MUST BE R7 BASED AND WITHIN LOCAL PROC                
         L     R2,=F'0'                                                         
         L     R3,=F'12'                                                        
         L     R4,=F'2'                                                         
         L     R5,=F'20'                                                        
BXHLOOP1 LABEL ,                                                                
         LA    R2,1(R2)                                                         
         BXH   R3,R4,BXHDONE1                                                   
         B     BXHLOOP1                                                         
BXHDONE1 LABEL ,                                                                
         IF    ((R2,NE,5),OR,(R3,NE,22)),BEGIN                                  
         MWRITE 'BHX FAILED'                                                    
         END                                                                    
         L     R2,=F'0'                                                         
         L     R3,=F'12'                                                        
         L     R5,=F'-4'                                                        
BXHLOOP2 LABEL ,                                                                
         LA    R2,1(R2)                                                         
         BXH   R3,R5,BXHLOOP2                                                   
         IF    ((R2,NE,4),OR,(R3,NE,-4)),BEGIN                                  
         MWRITE 'BHX FAILED'                                                    
         END                                                                    
* BXLE                                                                          
* RESTRICTION BXLE - LABEL MUST BE R7 BASED AND WITHIN LOCAL PROC               
         L     R2,=F'0'                                                         
         L     R3,=F'12'                                                        
         L     R4,=F'2'                                                         
         L     R5,=F'20'                                                        
BXLELOOP LABEL ,                                                                
         LA    R2,1(R2)                                                         
         BXLE  R3,R4,BXLELOOP                                                   
         IF    ((R2,NE,5),OR,(R3,NE,22)),BEGIN                                  
         MWRITE 'BXLE FAILED'                                                   
         END                                                                    
         L     R2,=F'0'                                                         
         L     R3,=F'-8'                                                        
         L     R5,=F'4'                                                         
BXLELP2  LABEL ,                                                                
         LA    R2,1(R2)                                                         
         BXLE  R3,R5,BXLELP2                                                    
         IF    ((R2,NE,4),OR,(R3,NE,8)),BEGIN                                   
         MWRITE 'BXLE FAILED'                                                   
         END                                                                    
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST3  PROC  ITESTWA                                                          
*                                                                               
* CR                                                                            
         L     R1,=F'1'                                                         
         L     R2,=F'2'                                                         
         CR    R1,R2                                                            
         IF    (NL),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'-2'                                                        
         CR    R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'4000000'                                                   
         CR    R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-8000011'                                                  
         CR    R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'-8000011'                                                  
         L     R2,=F'4000011'                                                   
         CR    R1,R2                                                            
         IF    (NL),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'430030'                                                    
         CR    R1,R2                                                            
         IF    (NE),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
         L     R1,=F'-30030'                                                    
         L     R2,=F'-30030'                                                    
         CR    R1,R2                                                            
         IF    (NE),BEGIN                                                       
         MWRITE 'CR FAILED'                                                     
         END                                                                    
* C                                                                             
         L     R1,=F'1'                                                         
         C     R1,=F'2'                                                         
         IF    (NL),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'-1'                                                        
         C     R1,=F'-2'                                                        
         IF    (NH),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         C     R1,=F'4000000'                                                   
         IF    (NH),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         C     R1,=F'-8000011'                                                  
         IF    (NH),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'-8000011'                                                  
         C     R1,=F'4000011'                                                   
         IF    (NL),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'430030'                                                    
         C     R1,=F'430030'                                                    
         IF    (NE),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
         L     R1,=F'-30030'                                                    
         C     R1,=F'-30030'                                                    
         IF    (NE),BEGIN                                                       
         MWRITE 'C FAILED'                                                      
         END                                                                    
* CS                                                                            
* RESTRICTIONS CS - NOT ALLOWED                                                 
         SPACE 1                                                                
* CDS                                                                           
* RESTRICTIONS CDS - NOT ALLOWED                                                
         SPACE 1                                                                
* CH                                                                            
         LH    R1,=H'1'                                                         
         CH    R1,=H'2'                                                         
         IF    (NL),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-1'                                                        
         CH    R1,=H'-2'                                                        
         IF    (NH),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         CH    R1,=H'4000'                                                      
         IF    (NH),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         CH    R1,=H'-8011'                                                     
         IF    (NH),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-8011'                                                     
         CH    R1,=H'4011'                                                      
         IF    (NL),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4330'                                                      
         CH    R1,=H'4330'                                                      
         IF    (NE),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-3030'                                                     
         CH    R1,=H'-3030'                                                     
         IF    (NE),BEGIN                                                       
         MWRITE 'CH FAILED'                                                     
         END                                                                    
* CLR                                                                           
         L     R1,=F'1'                                                         
         L     R2,=F'2'                                                         
         CLR   R1,R2                                                            
         IF    (NL),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'-2'                                                        
         CLR   R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'4000000'                                                   
         CLR   R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-8000011'                                                  
         CLR   R1,R2                                                            
         IF    (NL),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'-8000011'                                                  
         L     R2,=F'4000011'                                                   
         CLR   R1,R2                                                            
         IF    (NH),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'430030'                                                    
         CLR   R1,R2                                                            
         IF    (NE),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
         L     R1,=F'-30030'                                                    
         L     R2,=F'-30030'                                                    
         CLR   R1,R2                                                            
         IF    (NE),BEGIN                                                       
         MWRITE 'CLR FAILED'                                                    
         END                                                                    
* CL                                                                            
         L     R1,=F'1'                                                         
         CL    R1,=F'2'                                                         
         IF    (NL),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         CL    R1,=F'-2'                                                        
         IF    (NH),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         CL    R1,=F'4000000'                                                   
         IF    (NH),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         CL    R1,=F'-8000011'                                                  
         IF    (NL),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'-8000011'                                                  
         CL    R1,=F'4000011'                                                   
         IF    (NH),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         CL    R1,=F'430030'                                                    
         IF    (NE),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
         L     R1,=F'-30030'                                                    
         CL    R1,=F'-30030'                                                    
         IF    (NE),BEGIN                                                       
         MWRITE 'CL FAILED'                                                     
         END                                                                    
* CLI                                                                           
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         MVI   F1,X'0F'                                                         
         CLI   F1,X'1F'                                                         
         IF    (NL),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
         MVI   F1,X'0F'                                                         
         CLI   F1,X'FF'                                                         
         IF    (NL),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
         MVI   F1,X'F2'                                                         
         CLI   F1,X'F1'                                                         
         IF    (NH),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
         MVI   F1,X'F2'                                                         
         CLI   F1,X'01'                                                         
         IF    (NH),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
         MVI   F1,X'FF'                                                         
         CLI   F1,X'FF'                                                         
         IF    (NE),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
         MVI   F1,X'0F'                                                         
         CLI   F1,X'0F'                                                         
         IF    (NE),BEGIN                                                       
         MWRITE 'CLI FAILED'                                                    
         END                                                                    
* PRELIMINARY TEST OF MVC                                                       
         MVC   BUF1(10),=CL10'1234567890'                                       
         MVC   BUF2(10),=CL10'0000123456'                                       
         L     R1,BUF1                                                          
         L     R2,BUF2+4                                                        
         IF    (R1,NE,R2),BEGIN                                                 
         MWRITE 'MVC FAILED'                                                    
         END                                                                    
* CLC                                                                           
         MVC   BUF1(10),=CL10'0123456789'                                       
         MVC   BUF2(14),=CL14'12340123456789'                                   
         CLC   BUF1(10),BUF2+4                                                  
         IF    NE,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         END                                                                    
         CLC   BUF1(10),BUF2                                                    
         IF    NL,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         END                                                                    
         CLC   BUF2(10),BUF1                                                    
         IF    NH,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         END                                                                    
         CLC   BUF1+1(8),BUF2                                                   
         IF    NH,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         END                                                                    
         CLC   BUF1+1(4),BUF2                                                   
         IF    NE,BEGIN                                                         
         MWRITE 'CLC FAILED'                                                    
         END                                                                    
* CLM                                                                           
         L     R1,=X'FF00FF00'                                                  
         L     R2,=X'00FFFF00'                                                  
         L     R3,=X'FFFFFFFF'                                                  
         ST    R3,F1                                                            
         CLM   R1,B'1010',F1                                                    
         IF    NE,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         CLM   R2,B'0110',F1                                                    
         IF    NE,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         CLM   R1,B'0011',F1                                                    
         IF    NL,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         L     R1,=X'01050102'                                                  
         L     R2,=X'00010203'                                                  
         L     R3,=X'01020304'                                                  
         ST    R3,F1                                                            
         CLM   R1,B'1001',F1                                                    
         IF    NE,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         CLM   R2,B'0110',F1                                                    
         IF    NE,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         CLM   R1,B'0101',F1                                                    
         IF    NH,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
         CLM   R2,B'0011',F1                                                    
         IF    NH,BEGIN                                                         
         MWRITE 'CLM FAILED'                                                    
         END                                                                    
* CLCL                                                                          
         MVC   BUF1(20),=CL20'01234567890000000000'                             
         MVC   BUF2(20),=CL20'01234567890000000000'                             
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         LA    R5,20                                                            
         CLCL  R2,R4                                                            
         IF    (NE,OR,(R3,NE,0),OR,(R5,NE,0)),BEGIN                             
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+20                                                       
         LA    R5,BUF2+20                                                       
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         LA    R5,10                                                            
         O     R5,=X'F0000000'   COMMENT PAD = '0'                              
         CLCL  R2,R4                                                            
         IF    (NE,OR,(R3,NE,0),OR,(R5,NE,X'F0000000')),BEGIN                   
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+20                                                       
         LA    R5,BUF2+10                                                       
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,10                                                            
         LA    R4,BUF2                                                          
         LA    R5,20                                                            
         O     R5,=X'F0000000'   COMMENT PAD = '0'                              
         CLCL  R2,R4                                                            
         IF    (NE,OR,(R3,NE,0),OR,(R5,NE,X'F0000000')),BEGIN                   
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+10                                                       
         LA    R5,BUF2+20                                                       
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         MVC   BUF1(20),=CL20'0123456789000000000'                              
         MVC   BUF2(20),=CL20'0123456789999999999'                              
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         LA    R5,20                                                            
         CLCL  R2,R4                                                            
         IF    (NL,OR,(R3,NE,10),OR,(R5,NE,10)),BEGIN                           
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+10                                                       
         LA    R5,BUF2+10                                                       
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         LA    R5,20                                                            
         CLCL  R4,R2                                                            
         IF    (NH,OR,(R3,NE,10),OR,(R5,NE,10)),BEGIN                           
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+10                                                       
         LA    R5,BUF2+10                                                       
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,5                                                             
         LA    R4,BUF2                                                          
         LA    R5,20                                                            
         O     R5,=X'F5000000'   COMMENT PAD = '6'                              
         CLCL  R2,R4                                                            
         IF    (NL,OR,(R3,NE,0),OR,(R5,NE,X'F500000E')),BEGIN                   
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
         LA    R3,BUF1+5                                                        
         LA    R5,BUF2+6                                                        
         IF    ((R2,NE,R3),OR,(R4,NE,R5)),BEGIN                                 
         MWRITE 'CLCL FAILED'                                                   
         END                                                                    
* CVB                                                                           
         L     R1,=F'0'                                                         
         L     R2,=X'0025594C'                                                  
         ST    R1,F1                                                            
         ST    R2,F2                                                            
         CVB   R1,F1                                                            
         IF    (R1,NE,25594),BEGIN                                              
         MWRITE 'CVB FAILED'                                                    
         END                                                                    
         L     R1,=F'0'                                                         
         L     R2,=X'0025594D'                                                  
         ST    R1,F1                                                            
         ST    R2,F2                                                            
         CVB   R1,F1                                                            
         IF    (R1,NE,-25594),BEGIN                                             
         MWRITE 'CVB FAILED'                                                    
         END                                                                    
* CVD                                                                           
         L     R1,=F'234567890'                                                 
         CVD   R1,F1                                                            
         L     R1,F1                                                            
         L     R2,F2                                                            
         IF    ((R1,NE,X'00000023'),OR,(R2,NE,X'4567890C')),BEGIN               
         MWRITE 'CVD FAILED'                                                    
         END                                                                    
         L     R1,=F'-234567890'                                                
         CVD   R1,F1                                                            
         L     R1,F1                                                            
         L     R2,F2                                                            
         IF    ((R1,NE,X'00000023'),OR,(R2,NE,X'4567890D')),BEGIN               
         MWRITE 'CVD FAILED'                                                    
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST4  PROC  ITESTWA                                                          
*                                                                               
* DR                                                                            
* RESTRICTION DR - NUMBER DIVIDED MUST BE SINGLE FULLWORD MAX                   
* RESTRICTION DR - NEGATIVE NUMBERS NOT PROPERLY HANDLED ON VAX                 
         L     R0,=F'0'                                                         
         L     R1,=F'43567898'                                                  
         L     R2,=F'1000'                                                      
         DR    R0,R2                                                            
         IF    ((R0,NE,898),OR,(R1,NE,43567)),BEGIN                             
         MWRITE 'DR FAILED'                                                     
         END                                                                    
         L     R0,=F'0'                                                         
         L     R1,=F'98'                                                        
         L     R2,=F'10900'                                                     
         DR    R0,R2                                                            
         IF    ((R0,NE,98),OR,(R1,NE,0)),BEGIN                                  
         MWRITE 'DR FAILED'                                                     
         END                                                                    
         L     R0,=F'0'                                                         
         L     R1,=F'435650000'                                                 
         L     R2,=F'10000'                                                     
         DR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,43565)),BEGIN                               
         MWRITE 'DR FAILED'                                                     
         END                                                                    
         L     R0,=F'-1'                                                        
         L     R1,=F'-435650000'                                                
         L     R2,=F'10000'                                                     
         DR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,-43565)),BEGIN                              
         MWRITE 'DR FAILED'                                                     
         END                                                                    
         L     R0,=F'-1'                                                        
         L     R1,=F'-435650000'                                                
         L     R2,=F'-10000'                                                    
         DR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,43565)),BEGIN                               
         MWRITE 'DR FAILED'                                                     
         END                                                                    
* D                                                                             
* RESTRICTION D - NUMBER DIVIDED MUST BE SINGLE FULLWORD MAX                    
* RESTRICTION D - NEGATIVE NUMBERS NOT PROPERLY HANDLED ON VAX                  
         L     R0,=F'0'                                                         
         L     R1,=F'43567898'                                                  
         D     R0,=F'1000'                                                      
         IF    ((R0,NE,898),OR,(R1,NE,43567)),BEGIN                             
         MWRITE 'D FAILED'                                                      
         END                                                                    
         L     R0,=F'0'                                                         
         L     R1,=F'98'                                                        
         D     R0,=F'10900'                                                     
         IF    ((R0,NE,98),OR,(R1,NE,0)),BEGIN                                  
         MWRITE 'D FAILED'                                                      
         END                                                                    
         L     R0,=F'0'                                                         
         L     R1,=F'435650000'                                                 
         D     R0,=F'10000'                                                     
         IF    ((R0,NE,0),OR,(R1,NE,43565)),BEGIN                               
         MWRITE 'D FAILED'                                                      
         END                                                                    
         L     R0,=F'-1'                                                        
         L     R1,=F'-435650000'                                                
         D     R0,=F'10000'                                                     
         IF    ((R0,NE,0),OR,(R1,NE,-43565)),BEGIN                              
         MWRITE 'D FAILED'                                                      
         END                                                                    
         L     R0,=F'-1'                                                        
         L     R1,=F'-435650000'                                                
         D     R0,=F'-10000'                                                    
         IF    ((R0,NE,0),OR,(R1,NE,43565)),BEGIN                               
         MWRITE 'D FAILED'                                                      
         END                                                                    
* ED    (FROM POPS)                                                             
* RESTRICTIONS ED - ED SUPPORTED, BUT MINIMALLY TESTED                          
         MVC   BUF1(15),=XL15'4020206B2021204B202040C3D94040'                   
         MVC   BUF2(4),=XL4'0257426C'                                           
         ED    BUF1(13),BUF2                                                    
         IF    NH,BEGIN                                                         
         MWRITE 'ED FAILED'                                                     
         END                                                                    
         CLC   BUF1(15),=CL15'  2,574.26     '                                  
         IF    NE,BEGIN                                                         
         MWRITE 'ED FAILED'                                                     
         END                                                                    
         MVC   BUF1(15),=XL15'4020206B2021204B202040C3D94040'                   
         MVC   BUF2(4),=XL4'0000026D'                                           
         ED    BUF1(13),BUF2                                                    
         IF    NL,BEGIN                                                         
         MWRITE 'ED FAILED'                                                     
         END                                                                    
         CLC   BUF1(15),=CL15'      0.26 CR  '                                  
         IF    NE,BEGIN                                                         
         MWRITE 'ED FAILED'                                                     
         END                                                                    
* EDMK  (FROM POPS)                                                             
* RESTRICTIONS EDMK - EDMK SUPPORTED, BUT MINIMALLY TESTED                      
         MVC   BUF1(15),=XL15'4020206B2021204B202040C3D94040'                   
         MVC   BUF2(4),=XL4'0257426C'                                           
         LA    R1,BUF1+6                                                        
         EDMK  BUF1(13),BUF2                                                    
         IF    NH,BEGIN                                                         
         MWRITE 'EDMK FAILED'                                                   
         END                                                                    
         BCTR  R1,0                                                             
         MVI   0(R1),C'$'                                                       
         CLC   BUF1(15),=CL15' $2,574.26     '                                  
         IF    NE,BEGIN                                                         
         MWRITE 'EDMK FAILED'                                                   
         END                                                                    
         MVC   BUF1(15),=XL15'4020206B2021204B202040C3D94040'                   
         MVC   BUF2(4),=XL4'0000026D'                                           
         LA    R1,BUF1+6                                                        
         EDMK  BUF1(13),BUF2                                                    
         IF    NL,BEGIN                                                         
         MWRITE 'EDMK FAILED'                                                   
         END                                                                    
         BCTR  R1,0                                                             
         MVI   0(R1),C'$'                                                       
         CLC   BUF1(15),=CL15'     $0.26 CR  '                                  
         IF    NE,BEGIN                                                         
         MWRITE 'EDMK FAILED'                                                   
         END                                                                    
* XR                                                                            
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         XR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'F0F00F0F')),BEGIN                                 
         MWRITE 'XR FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         XR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'XR FAILED'                                                     
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'F0F00000'                                                  
         XR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'F0F0FFFF')),BEGIN                                 
         MWRITE 'XR FAILED'                                                     
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'0000FFFF'                                                  
         XR    R1,R2                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'XR FAILED'                                                     
         END                                                                    
* X                                                                             
         L     R1,=X'0000FFFF'                                                  
         X     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'F0F00F0F')),BEGIN                                 
         MWRITE 'X FAILED'                                                      
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         X     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'X FAILED'                                                      
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         X     R1,=X'F0F00000'                                                  
         IF    (Z,OR,(R1,NE,X'F0F0FFFF')),BEGIN                                 
         MWRITE 'X FAILED'                                                      
         END                                                                    
         L     R1,=X'0000FFFF'                                                  
         X     R1,=X'0000FFFF'                                                  
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'XR FAILED'                                                     
         END                                                                    
* XI                                                                            
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         MVI   F1,X'FF'                                                         
         XI    F1,X'55'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'AA000000')),BEGIN                                 
         MWRITE 'XI FAILED'                                                     
         END                                                                    
         MVI   F1,X'F0'                                                         
         XI    F1,X'F1'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'01000000')),BEGIN                                 
         MWRITE 'XI FAILED'                                                     
         END                                                                    
         MVI   F1,X'F0'                                                         
         XI    F1,X'F0'                                                         
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,X'00000000')),BEGIN                                
         MWRITE 'XI FAILED'                                                     
         END                                                                    
* XC                                                                            
         L     R1,=X'0000FFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         L     R3,=F'0'                                                         
         ST    R3,F3                                                            
         XC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F0F00F0F')),BEGIN                                 
         MWRITE 'XC FAILED'                                                     
         END                                                                    
         L     R2,F2                                                            
         IF    (R2,NE,X'F0F0F0F0'),BEGIN                                        
         MWRITE 'XC FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         XC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'0000F0F0')),BEGIN                                 
         MWRITE 'XC FAILED'                                                     
         END                                                                    
         L     R1,=X'FF0000FF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'FF0000FF'                                                  
         ST    R2,F2                                                            
         XC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'XC FAILED'                                                     
         END                                                                    
* EX                                                                            
* RESTRICTION EX - EX SUPPORTES ONLY MVC, CLC, TR, TRT, OC, NC, XC              
* NOTE: OTHER EX TESTS IN TR, TRT CODE TESTS.                                   
         MVC   BUF1(10),=CL10'0000000000'                                       
         MVC   BUF2(10),=CL10'0123456789'                                       
         L     R1,=X'000FF008'                                                  
         DEX   R1,' MVC BUF1(0),BUF2 '                                          
         CLC   BUF1(10),=CL10'0123456700'                                       
         IF    NE,BEGIN                                                         
         MWRITE 'EX MVC FAILED'                                                 
         END                                                                    
         MVC   BUF2(10),BUF1                                                    
         L     R1,=F'10'                                                        
         LTR   R1,R1                                                            
         DEX   R1,' CLC BUF1(0),BUF2 '                                          
         IF    NE,BEGIN                                                         
         MWRITE 'EX CLC FAILED'                                                 
         END                                                                    
         MVI   BUF1,X'F0'                                                       
         MVI   BUF2,X'0F'                                                       
         LA    R1,1                                                             
         DEX   R1,' OC BUF1(0),BUF2 '                                           
         CLI   BUF1,X'FF'                                                       
         IF    NE,BEGIN                                                         
         MWRITE 'EX OC FAILED'                                                  
         END                                                                    
         L     R1,=X'FF0FF000'                                                  
         ST    R1,BUF1                                                          
         L     R1,=X'0FF0F00F'                                                  
         ST    R1,BUF2                                                          
         LA    R1,4                                                             
         DEX   R1,' NC BUF1(0),BUF2 '                                           
         L     R1,BUF1                                                          
         IF    (R1,NE,X'0F00F000'),BEGIN                                        
         MWRITE 'EX NC FAILED'                                                  
         END                                                                    
         L     R1,=X'FF0FF000'                                                  
         ST    R1,BUF1                                                          
         L     R1,=X'0FF0F00F'                                                  
         ST    R1,BUF2                                                          
         LA    R1,4                                                             
         DEX   R1,' XC BUF1(0),BUF2 '                                           
         L     R1,BUF1                                                          
         IF    (R1,NE,X'F0FF000F'),BEGIN                                        
         MWRITE 'EX XC FAILED'                                                  
         END                                                                    
* IC                                                                            
         L     R1,=F'0'                                                         
         MVI   F1,X'F2'                                                         
         IC    R1,F1                                                            
         IF    (R1,NE,X'F2'),BEGIN                                              
         MWRITE 'IC FAILED'                                                     
         END                                                                    
         L     R1,=F'0'                                                         
         MVI   F1,X'02'                                                         
         IC    R1,F1                                                            
         IF    (R1,NE,X'02'),BEGIN                                              
         MWRITE 'IC FAILED'                                                     
         END                                                                    
         L     R1,=X'0F0F0000'                                                  
         MVI   F1,X'F2'                                                         
         IC    R1,F1                                                            
         IF    (R1,NE,X'0F0F00F2'),BEGIN                                        
         MWRITE 'IC FAILED'                                                     
         END                                                                    
         L     R1,=X'0F0F0000'                                                  
         MVI   F1,X'02'                                                         
         IC    R1,F1                                                            
         IF    (R1,NE,X'0F0F0002'),BEGIN                                        
         MWRITE 'IC FAILED'                                                     
         END                                                                    
* ICM                                                                           
         L     R1,=X'01020304'                                                  
         ST    R1,F1                                                            
         L     R1,=F'0'                                                         
         ICM   R1,B'0011',F1                                                    
         IF    (NH,OR,(R1,NE,X'00000102')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=F'0'                                                         
         ICM   R1,B'1001',F1                                                    
         IF    (NH,OR,(R1,NE,X'01000002')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=X'D0D0D0D0'                                                  
         ICM   R1,B'0011',F1                                                    
         IF    (NH,OR,(R1,NE,X'D0D00102')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=X'D0D0D0D0'                                                  
         ICM   R1,B'1001',F1                                                    
         IF    (NH,OR,(R1,NE,X'01D0D002')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=F'0'                                                         
         ICM   R1,B'0111',F1                                                    
         IF    (NH,OR,(R1,NE,X'00010203')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=X'F0F1F2F3'                                                  
         ST    R1,F1                                                            
         L     R1,=F'0'                                                         
         ICM   R1,B'0011',F1                                                    
         IF    (NL,OR,(R1,NE,X'0000F0F1')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=X'D0D0D0D0'                                                  
         ICM   R1,B'1001',F1                                                    
         IF    (NL,OR,(R1,NE,X'F0D0D0F1')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         L     R1,=X'D0D0D0D0'                                                  
         ICM   R1,B'0011',F1                                                    
         IF    (NZ,OR,(R1,NE,X'D0D00000')),BEGIN                                
         MWRITE 'ICM FAILED'                                                    
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST5  PROC  ITESTWA                                                          
*                                                                               
* LR                                                                            
         L     R1,=F'0'                                                         
         LR    R2,R1                                                            
         IF    (R2,NE,0),BEGIN                                                  
         MWRITE 'LR FAILED'                                                     
         END                                                                    
         L     R1,=F'-123'                                                      
         LR    R2,R1                                                            
         IF    (R2,NE,-123),BEGIN                                               
         MWRITE 'LR FAILED'                                                     
         END                                                                    
         L     R1,=F'400033'                                                    
         LR    R2,R1                                                            
         IF    (R2,NE,400033),BEGIN                                             
         MWRITE 'LR FAILED'                                                     
         END                                                                    
* L                                                                             
         L     R1,=F'0'                                                         
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'L FAILED'                                                      
         END                                                                    
         L     R1,=F'-123'                                                      
         IF    (R1,NE,-123),BEGIN                                               
         MWRITE 'L FAILED'                                                      
         END                                                                    
         L     R1,=F'400033'                                                    
         IF    (R1,NE,400033),BEGIN                                             
         MWRITE 'L FAILED'                                                      
         END                                                                    
* LA                                                                            
         L     R1,=F'0'                                                         
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'LA FAILED'                                                     
         END                                                                    
         LA    R1,1239                                                          
         IF    (R1,NE,1239),BEGIN                                               
         MWRITE 'LA FAILED'                                                     
         END                                                                    
         L     R2,=F'4980000'                                                   
         L     R3,=F'2000'                                                      
         LA    R1,12(R2,R3)                                                     
         IF    (R1,NE,4982012),BEGIN                                            
         MWRITE 'LA FAILED'                                                     
         END                                                                    
         LA    R1,=F'4980000'                                                   
         L     R2,0(R1)                                                         
         IF    (R2,NE,4980000),BEGIN                                            
         MWRITE 'LA FAILED'                                                     
         END                                                                    
* LTR                                                                           
         L     R1,=F'0'                                                         
         LTR   R1,R1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
         LA    R1,4                                                             
         LTR   R1,R1                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
         L     R1,=F'-4'                                                        
         LTR   R1,R1                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
         L     R3,=F'0'                                                         
         LTR   R1,R3                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
         LA    R3,4                                                             
         LTR   R1,R3                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
         L     R3,=F'-4'                                                        
         LTR   R1,R3                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LTR FAILED'                                                    
         END                                                                    
* LCR                                                                           
         L     R1,=F'0'                                                         
         LCR   R1,R1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
         LA    R1,4                                                             
         LCR   R1,R1                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
         L     R1,=F'-4'                                                        
         LCR   R1,R1                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
         L     R3,=F'0'                                                         
         LCR   R1,R3                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
         LA    R3,4                                                             
         LCR   R1,R3                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
         L     R3,=F'-4'                                                        
         LCR   R1,R3                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LCR FAILED'                                                    
         END                                                                    
* LH                                                                            
         L     R1,=X'F0F0F0F0'                                                  
         ST    R1,F1                                                            
         LH    R1,F1+2                                                          
         IF    (R1,NE,X'FFFFF0F0'),BEGIN                                        
         MWRITE 'LH FAILED'                                                     
         END                                                                    
         L     R1,=X'00000F0F'                                                  
         ST    R1,F1                                                            
         LH    R1,F1+2                                                          
         IF    (R1,NE,X'00000F0F'),BEGIN                                        
         MWRITE 'LH FAILED'                                                     
         END                                                                    
* LM                                                                            
         L     R1,=X'F0F0F0F0'                                                  
         L     R2,=X'00000012'                                                  
         L     R3,=X'F2341234'                                                  
         STM   R1,R3,F1                                                         
         LM    R1,R2,F1                                                         
         IF    ((R1,NE,X'F0F0F0F0'),OR,(R2,NE,X'00000012')),BEGIN               
         MWRITE 'LM FAILED'                                                     
         END                                                                    
         LM    R1,R2,F1+4                                                       
         IF    ((R1,NE,X'00000012'),OR,(R2,NE,X'F2341234')),BEGIN               
         MWRITE 'LM FAILED'                                                     
         END                                                                    
* LNR                                                                           
         L     R1,=F'0'                                                         
         LNR   R1,R1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
         LA    R1,4                                                             
         LNR   R1,R1                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
         L     R1,=F'-4'                                                        
         LNR   R1,R1                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
         L     R3,=F'0'                                                         
         LNR   R1,R3                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
         LA    R3,4                                                             
         LNR   R1,R3                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
         L     R3,=F'-4'                                                        
         LNR   R1,R3                                                            
         IF    (NL,OR,(R1,NE,-4)),BEGIN                                         
         MWRITE 'LNR FAILED'                                                    
         END                                                                    
* LPR                                                                           
         L     R1,=F'0'                                                         
         LPR   R1,R1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         LA    R1,4                                                             
         LPR   R1,R1                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         L     R1,=F'-4'                                                        
         LPR   R1,R1                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         L     R3,=F'0'                                                         
         LPR   R1,R3                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         LA    R3,4                                                             
         LPR   R1,R3                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         L     R3,=F'-4'                                                        
         LPR   R1,R3                                                            
         IF    (NH,OR,(R1,NE,4)),BEGIN                                          
         MWRITE 'LPR FAILED'                                                    
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST6  PROC  ITESTWA                                                          
*                                                                               
* MVI                                                                           
         MVI   F1,X'FF'                                                         
         MVI   F1+1,X'00'                                                       
         MVI   F1+2,X'D0'                                                       
         MVI   F1+3,X'12'                                                       
         L     R1,F1                                                            
         IF    (R1,NE,X'FF00D012'),BEGIN                                        
         MWRITE 'MVI FAILED'                                                    
         END                                                                    
         MVI   F1+3,X'FF'                                                       
         MVI   F1+2,X'00'                                                       
         MVI   F1+1,X'D0'                                                       
         MVI   F1+0,X'12'                                                       
         L     R1,F1                                                            
         IF    (R1,NE,X'12D000FF'),BEGIN                                        
         MWRITE 'MVI FAILED'                                                    
         END                                                                    
* MVC                                                                           
         MVC   BUF1(20),=CL20'12345678901234567890'                             
         MVC   BUF2(20),=CL20'01234567890000000000'                             
         CLC   BUF1(10),BUF2+1                                                  
         IF    NE,BEGIN                                                         
         MWRITE 'MVC FAILED'                                                    
         END                                                                    
         CLC   BUF1+9(11),BUF2                                                  
         IF    NE,BEGIN                                                         
         MWRITE 'MVC FAILED'                                                    
         END                                                                    
         MVI   BUF1,X'F0'                                                       
         MVC   BUF1+1(256),BUF1                                                 
         LA    R2,BUF1                                                          
         LA    R3,257                                                           
         L     R5,=X'F0000000'                                                  
         CLCL  R2,R4                                                            
         IF    NE,BEGIN                                                         
         MWRITE 'MVC FAILED'                                                    
         END                                                                    
* MVCIN (FROM POPS)   (MVCIN NOT INSTALLED ON OUR MACHINE)                      
         MVC   BUF1(11),=XL11'C1C2C3C4C5C6C7C8C9CACB'                           
         MVC   BUF2(9),=XL9'F1F2F3F4F5F6F7F8F9'                                 
*        MVCIN BUF1(8),BUF2                                                     
         MVC   BUF1(11),=XL11'F8F7F6F5F4F3F2F1C9CACB' *FAKE IT*                 
         CLC   BUF1(11),=XL11'F8F7F6F5F4F3F2F1C9CACB'                           
         IF    NE,BEGIN                                                         
         MWRITE 'MVCIN FAILED'                                                  
         END                                                                    
* MVCL                                                                          
* RESTRICTION MVCL - NO CC SET                                                  
         MVC   BUF2(20),=CL20'12345678901234567890'                             
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         L     R5,=X'4000000A'                                                  
         MVCL  R2,R4                                                            
         CLC   BUF1(20),=CL20'1234567890          '                             
         IF    NE,BEGIN                                                         
         MWRITE 'MVCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,20                                                            
         LA    R4,BUF2                                                          
         L     R5,=X'40000014'                                                  
         MVCL  R2,R4                                                            
         CLC   BUF1(20),=CL20'12345678901234567890'                             
         IF    NE,BEGIN                                                         
         MWRITE 'MVCL FAILED'                                                   
         END                                                                    
         LA    R2,BUF1                                                          
         LA    R3,10                                                            
         LA    R4,BUF2+1                                                        
         L     R5,=X'40000014'                                                  
         MVCL  R2,R4                                                            
         CLC   BUF1(20),=CL20'23456789011234567890'                             
         IF    NE,BEGIN                                                         
         MWRITE 'MVCL FAILED'                                                   
         END                                                                    
* MVN (FROM POPS)                                                               
         MVC   BUF1(6),=XL6'F0F1F2F3F4F5'                                       
         MVC   BUF2(4),=XL4'C6C7C8C9'                                           
         MVN   BUF1(4),BUF2                                                     
         CLC   BUF1(6),=XL6'F6F7F8F9F4F5'                                       
         IF    NE,BEGIN                                                         
         MWRITE 'MVN FAILED'                                                    
         END                                                                    
* MV0 (FROM POPS)                                                               
         MVC   BUF1(4),=XL4'7788990C'                                           
         MVC   BUF2(4),=XL4'12345600'                                           
         MVO   BUF1(4),BUF2(3)                                                  
         CLC   BUF1(4),=XL4'0123456C'                                           
         IF    NE,BEGIN                                                         
         MWRITE 'MVO FAILED'                                                    
         END                                                                    
* MVZ (FROM POPS)                                                               
         MVC   BUF1(6),=XL6'F1C2F3C4F5C6'                                       
         MVZ   BUF1+1(5),BUF1                                                   
         CLC   BUF1(6),=XL6'F1F2F3F4F5F6'                                       
         IF    NE,BEGIN                                                         
         MWRITE 'MVZ FAILED'                                                    
         END                                                                    
* MR                                                                            
* RESTRICTION M - MULTIPLY RESULT MUST NOT OVERFLOW A FULLWORD                  
         L     R0,=F'0'                                                         
         L     R1,=F'1000'                                                      
         L     R2,=F'100'                                                       
         MR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,100000)),BEGIN                              
         MWRITE 'MR FAILED'                                                     
         END                                                                    
         L     R0,=F'1000'                                                      
         L     R1,=F'100000'                                                    
         L     R2,=F'1000'                                                      
         MR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,100000000)),BEGIN                           
         MWRITE 'MR FAILED'                                                     
         END                                                                    
         L     R0,=F'-1000'                                                     
         L     R1,=F'-100000'                                                   
         L     R2,=F'1000'                                                      
         MR    R0,R2                                                            
         IF    (R1,NE,-100000000),BEGIN                                         
         MWRITE 'MR FAILED'                                                     
         END                                                                    
         L     R0,=F'-1000'                                                     
         L     R1,=F'-100000'                                                   
         L     R2,=F'-1000'                                                     
         MR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,100000000)),BEGIN                           
         MWRITE 'MR FAILED'                                                     
         END                                                                    
         L     R0,=F'1000'                                                      
         L     R1,=F'100000'                                                    
         L     R2,=F'0'                                                         
         MR    R0,R2                                                            
         IF    ((R0,NE,0),OR,(R1,NE,0)),BEGIN                                   
         MWRITE 'MR FAILED'                                                     
         END                                                                    
* M                                                                             
* RESTRICTION M - MULTIPLY RESULT MUST NOT OVERFLOW A FULLWORD                  
         L     R0,=F'0'                                                         
         L     R1,=F'1000'                                                      
         M     R0,=F'100'                                                       
         IF    ((R0,NE,0),OR,(R1,NE,100000)),BEGIN                              
         MWRITE 'M FAILED'                                                      
         END                                                                    
         L     R0,=F'1000'                                                      
         L     R1,=F'100000'                                                    
         M     R0,=F'1000'                                                      
         IF    ((R0,NE,0),OR,(R1,NE,100000000)),BEGIN                           
         MWRITE 'M FAILED'                                                      
         END                                                                    
         L     R0,=F'-1000'                                                     
         L     R1,=F'-100000'                                                   
         M     R0,=F'1000'                                                      
         IF    (R1,NE,-100000000),BEGIN                                         
         MWRITE 'M FAILED'                                                      
         END                                                                    
         L     R0,=F'-1000'                                                     
         L     R1,=F'-100000'                                                   
         M     R0,=F'-1000'                                                     
         IF    ((R0,NE,0),OR,(R1,NE,100000000)),BEGIN                           
         MWRITE 'M FAILED'                                                      
         END                                                                    
         L     R0,=F'1000'                                                      
         L     R1,=F'100000'                                                    
         M     R0,=F'0'                                                         
         IF    ((R0,NE,0),OR,(R1,NE,0)),BEGIN                                   
         MWRITE 'M FAILED'                                                      
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST7  PROC  ITESTWA                                                          
* OR                                                                            
         L     R1,=X'0000FFFF'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         OR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'F0F0FFFF')),BEGIN                                 
         MWRITE 'OR FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         L     R2,=X'F0F0F0F0'                                                  
         OR    R1,R2                                                            
         IF    (Z,OR,(R1,NE,X'F0F0F0F0')),BEGIN                                 
         MWRITE 'OR FAILED'                                                     
         END                                                                    
         L     R1,=X'00000000'                                                  
         L     R2,=X'00000000'                                                  
         OR    R1,R2                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'OR FAILED'                                                     
         END                                                                    
* 0                                                                             
         L     R1,=X'0000FFFF'                                                  
         O     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'F0F0FFFF')),BEGIN                                 
         MWRITE 'O FAILED'                                                      
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         O     R1,=X'F0F0F0F0'                                                  
         IF    (Z,OR,(R1,NE,X'F0F0F0F0')),BEGIN                                 
         MWRITE 'O FAILED'                                                      
         END                                                                    
         L     R1,=X'00000000'                                                  
         O     R1,=X'00000000'                                                  
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'O FAILED'                                                      
         END                                                                    
* OI                                                                            
         L     R1,=F'0'                                                         
         ST    R1,F1                                                            
         MVI   F1,X'0F'                                                         
         OI    F1,X'55'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'5F000000')),BEGIN                                 
         MWRITE 'OI FAILED'                                                     
         END                                                                    
         MVI   F1,X'F0'                                                         
         OI    F1,X'F1'                                                         
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F1000000')),BEGIN                                 
         MWRITE 'OI FAILED'                                                     
         END                                                                    
         MVI   F1,X'00'                                                         
         OI    F1,X'00'                                                         
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,X'00000000')),BEGIN                                
         MWRITE 'OI FAILED'                                                     
         END                                                                    
* OC                                                                            
         L     R1,=X'0000FFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         L     R3,=F'0'                                                         
         ST    R3,F3                                                            
         OC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F0F0FFFF')),BEGIN                                 
         MWRITE 'OC FAILED'                                                     
         END                                                                    
         L     R2,F2                                                            
         IF    (R2,NE,X'F0F0F0F0'),BEGIN                                        
         MWRITE 'OC FAILED'                                                     
         END                                                                    
         L     R1,=X'F0F00000'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0F0F0F0'                                                  
         ST    R2,F2                                                            
         OC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (Z,OR,(R1,NE,X'F0F0F0F0')),BEGIN                                 
         MWRITE 'OC FAILED'                                                     
         END                                                                    
         L     R1,=X'00000000'                                                  
         ST    R1,F1                                                            
         L     R2,=X'00000000'                                                  
         ST    R2,F2                                                            
         OC    F1,F2                                                            
         L     R1,F1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'OC FAILED'                                                     
         END                                                                    
* PACK (FROM POPS)                                                              
         MVC   BUF1(4),=XL4'F1F2F3C4'                                           
         PACK  BUF1(4),BUF1(4)                                                  
         CLC   BUF1(4),=XL4'0001234C'                                           
         IF    NE,BEGIN                                                         
         MWRITE 'PACK FAILED'                                                   
         END                                                                    
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST8  PROC  ITESTWA                                                          
*                                                                               
* SLDA                                                                          
* RESTRICTION SLDA - OVERFLOW CC NEVER SET                                      
         L     R0,=X'FFFFFFFF'                                                  
         L     R1,=X'FFFFE070'                                                  
         SLDA  R0,48                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'E0700000'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'FFFFFFFF'                                                  
         L     R1,=X'C0506070'                                                  
         SLDA  R0,32                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'C0506070'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'FF902030'                                                  
         L     R1,=X'40506070'                                                  
         SLDA  R0,8                                                             
         IF    NL,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'90203040'),OR,(R1,NE,X'50607000')),BEGIN               
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'00000000'                                                  
         L     R1,=X'000076F7'                                                  
         SLDA  R0,48                                                            
         IF    NH,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'76F70000'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'00000000'                                                  
         L     R1,=X'74F5F6F7'                                                  
         SLDA  R0,32                                                            
         IF    NH,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'74F5F6F7'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'0071F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SLDA  R0,8                                                             
         IF    NH,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'71F2F3F4'),OR,(R1,NE,X'F5F6F700')),BEGIN               
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
         L     R0,=X'00000000'                                                  
         L     R1,=X'00000000'                                                  
         SLDA  R0,48                                                            
         IF    NZ,BEGIN                                                         
         MWRITE 'SLDA FAILED'                                                   
         END                                                                    
* SLDL                                                                          
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SLDL  R0,48                                                            
         IF    ((R0,NE,X'60700000'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SLDL  R0,32                                                            
         IF    ((R0,NE,X'40506070'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SLDL  R0,8                                                             
         IF    ((R0,NE,X'10203040'),OR,(R1,NE,X'50607000')),BEGIN               
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SLDL  R0,48                                                            
         IF    ((R0,NE,X'F6F70000'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SLDL  R0,32                                                            
         IF    ((R0,NE,X'F4F5F6F7'),OR,(R1,NE,0)),BEGIN                         
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SLDL  R0,8                                                             
         IF    ((R0,NE,X'F1F2F3F4'),OR,(R1,NE,X'F5F6F700')),BEGIN               
         MWRITE 'SLDL FAILED'                                                   
         END                                                                    
*  SLA                                                                          
         L     R1,=X'FFF90F0F'                                                  
         SLA   R1,12                                                            
         IF    (NL,OR,(R1,NE,X'90F0F000')),BEGIN                                
         MWRITE 'SLA FAILED'                                                    
         END                                                                    
         L     R1,=X'FFFFF800'                                                  
         SLA   R1,20                                                            
         IF    (NL,OR,(R1,NE,X'80000000')),BEGIN                                
         MWRITE 'SLA FAILED'                                                    
         END                                                                    
         L     R1,=X'0007000F'                                                  
         SLA   R1,12                                                            
         IF    (NH,OR,(R1,NE,X'7000F000')),BEGIN                                
         MWRITE 'SLA FAILED'                                                    
         END                                                                    
         L     R1,=X'00000000'                                                  
         SLA   R1,24                                                            
         IF    (NZ,OR,(R1,NE,X'00000000')),BEGIN                                
         MWRITE 'SLA FAILED'                                                    
         END                                                                    
*  SLL                                                                          
         L     R1,=X'80010F0F'                                                  
         SLL   R1,12                                                            
         IF    (R1,NE,X'10F0F000'),BEGIN                                        
         MWRITE 'SLL FAILED'                                                    
         END                                                                    
         L     R1,=X'F0000000'                                                  
         SLL   R1,20                                                            
         IF    (R1,NE,X'00000000'),BEGIN                                        
         MWRITE 'SLL FAILED'                                                    
         END                                                                    
         L     R1,=X'0FFF000F'                                                  
         SLL   R1,12                                                            
         IF    (R1,NE,X'F000F000'),BEGIN                                        
         MWRITE 'SLL FAILED'                                                    
         END                                                                    
         L     R1,=X'0F0F0F00'                                                  
         SLL   R1,24                                                            
         IF    (R1,NE,X'00000000'),BEGIN                                        
         MWRITE 'SLL FAILED'                                                    
         END                                                                    
* SRDA                                                                          
* RESTRICTION SRDA - OVERFLOW CC NEVER SET                                      
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDA  R0,48                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'FFFFFFFF'),OR,(R1,NE,X'FFFFF010')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDA  R0,32                                                            
         IF    NL,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'FFFFFFFF'),OR,(R1,NE,X'F0102030')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDA  R0,8                                                             
         IF    NL,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'FFF01020'),OR,(R1,NE,X'30405060')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDA  R0,48                                                            
         IF    NH,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'000000F1')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'70F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDA  R0,32                                                            
         IF    NH,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'70F1F2F3')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDA  R0,8                                                             
         IF    NH,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         IF    ((R0,NE,X'0000F1F2'),OR,(R1,NE,X'F3F4F5F6')),BEGIN               
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
         L     R0,=X'000000F0'                                                  
         L     R1,=X'000F0000'                                                  
         SRDA  R0,48                                                            
         IF    NZ,BEGIN                                                         
         MWRITE 'SRDA FAILED'                                                   
         END                                                                    
* SRDL                                                                          
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDL  R0,48                                                            
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'0000F010')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDL  R0,32                                                            
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'F0102030')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
         L     R0,=X'F0102030'                                                  
         L     R1,=X'40506070'                                                  
         SRDL  R0,8                                                             
         IF    ((R0,NE,X'00F01020'),OR,(R1,NE,X'30405060')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDL  R0,48                                                            
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'000000F1')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDL  R0,32                                                            
         IF    ((R0,NE,X'00000000'),OR,(R1,NE,X'00F1F2F3')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
         L     R0,=X'00F1F2F3'                                                  
         L     R1,=X'F4F5F6F7'                                                  
         SRDL  R0,8                                                             
         IF    ((R0,NE,X'0000F1F2'),OR,(R1,NE,X'F3F4F5F6')),BEGIN               
         MWRITE 'SRDL FAILED'                                                   
         END                                                                    
*  SRA                                                                          
         L     R1,=X'80010F0F'                                                  
         SRA   R1,12                                                            
         IF    (NL,OR,(R1,NE,X'FFF80010')),BEGIN                                
         MWRITE 'SRA FAILED'                                                    
         END                                                                    
         L     R1,=X'F0000000'                                                  
         SRA   R1,20                                                            
         IF    (NL,OR,(R1,NE,X'FFFFFF00')),BEGIN                                
         MWRITE 'SRA FAILED'                                                    
         END                                                                    
         L     R1,=X'0FFF000F'                                                  
         SRA   R1,12                                                            
         IF    (NH,OR,(R1,NE,X'0000FFF0')),BEGIN                                
         MWRITE 'SRA FAILED'                                                    
         END                                                                    
         L     R1,=X'0F0F0F00'                                                  
         SRA   R1,28                                                            
         IF    (NZ,OR,(R1,NE,X'00000000')),BEGIN                                
         MWRITE 'SRA FAILED'                                                    
         END                                                                    
*  SRL                                                                          
         L     R1,=X'80010F0F'                                                  
         SRL   R1,12                                                            
         IF    (R1,NE,X'00080010'),BEGIN                                        
         MWRITE 'SRL FAILED'                                                    
         END                                                                    
         L     R1,=X'F0000000'                                                  
         SRL   R1,20                                                            
         IF    (R1,NE,X'00000F00'),BEGIN                                        
         MWRITE 'SRL FAILED'                                                    
         END                                                                    
         L     R1,=X'0FFF000F'                                                  
         SRL   R1,12                                                            
         IF    (R1,NE,X'0000FFF0'),BEGIN                                        
         MWRITE 'SRL FAILED'                                                    
         END                                                                    
         L     R1,=X'0F0F0F00'                                                  
         SRL   R1,24                                                            
         IF    (R1,NE,X'0000000F'),BEGIN                                        
         MWRITE 'SRL FAILED'                                                    
         END                                                                    
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
DOTEST9  PROC  ITESTWA                                                          
*                                                                               
* ST                                                                            
         L     R1,=F'-1'                                                        
         ST    R1,F1                                                            
         L     R2,=F'100000000'                                                 
         ST    R2,F2                                                            
         L     R3,=F'0'                                                         
         ST    R3,F3                                                            
         IF    ((F1,NE,-1),OR,(F2,NE,100000000),OR,(F3,NE,0)),BEGIN             
         MWRITE 'ST FAILED'                                                     
         END                                                                    
* STC                                                                           
         L     R1,=F'0'                                                         
         STC   R1,F1                                                            
         L     R1,=F'-1'                                                        
         STC   R1,F1+1                                                          
         L     R1,=X'F0F0F0F0'                                                  
         STC   R1,F1+2                                                          
         L     R1,=X'0000000F'                                                  
         STC   R1,F1+3                                                          
         IF    (F1,NE,X'00FFF00F'),BEGIN                                        
         MWRITE 'STC FAILED'                                                    
         END                                                                    
* STCM                                                                          
         L     R3,=X'F0F1F2F3'                                                  
         ST    R3,F1                                                            
         STCM  R3,B'0011',F1                                                    
         CLC   F1(4),=XL4'F2F3F2F3'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STCM FAILED'                                                   
         END                                                                    
         IF    (R3,NE,X'F0F1F2F3'),BEGIN                                        
         MWRITE 'STCM FAILED'                                                   
         END                                                                    
         L     R1,=X'F0F1F2F3'                                                  
         STCM  R1,B'1001',F1                                                    
         CLC   F1(4),=XL4'F0F3F2F3'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STCM FAILED'                                                   
         END                                                                    
         L     R1,=X'F0F1F2F3'                                                  
         STCM  R1,B'1111',F1                                                    
         CLC   F1(4),=XL4'F0F1F2F3'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STCM FAILED'                                                   
         END                                                                    
         L     R1,=X'01020304'                                                  
         STCM  R1,B'1001',F1                                                    
         CLC   F1(2),=XL2'0104'                                                 
         IF    NE,BEGIN                                                         
         MWRITE 'STCM FAILED'                                                   
         END                                                                    
* STH                                                                           
         L     R1,=X'FF0000FF'                                                  
         ST    R1,F1                                                            
         STH   R1,F1                                                            
         CLC   F1(4),=XL4'00FF00FF'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STH FAILED'                                                    
         END                                                                    
         L     R1,=X'00FFFF00'                                                  
         ST    R1,F1                                                            
         STH   R1,F1                                                            
         CLC   F1(4),=XL4'FF00FF00'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STH FAILED'                                                    
         END                                                                    
         L     R1,=X'00000F00'                                                  
         ST    R1,F1                                                            
         STH   R1,F1                                                            
         CLC   F1(4),=XL4'0F000F00'                                             
         IF    NE,BEGIN                                                         
         MWRITE 'STH FAILED'                                                    
         END                                                                    
* STM                                                                           
         L     R1,=F'-1'                                                        
         L     R2,=F'0'                                                         
         L     R3,=F'100000000'                                                 
         L     R4,=F'-1000'                                                     
         STM   R1,R4,F1                                                         
         IF    ((F1,NE,-1),OR,(F2,NE,0)),BEGIN                                  
         MWRITE 'STM FAILED'                                                    
         END                                                                    
         IF    ((F3,NE,100000000),OR,(F4,NE,-1000)),BEGIN                       
         MWRITE 'STM FAILED'                                                    
         END                                                                    
         STM   R1,R1,F1                                                         
         IF    ((F1,NE,-1),OR,(F2,NE,0)),BEGIN                                  
         MWRITE 'STM FAILED'                                                    
         END                                                                    
         L     R6,=F'-1'                                                        
         LA    R14,123                                                          
         LA    R15,1234                                                         
         LR    R5,R6                                                            
         ST    R2,BUF1+0                                                        
         ST    R3,BUF1+4                                                        
         ST    R4,BUF1+8                                                        
         ST    R5,BUF1+12                                                       
         ST    R6,BUF1+16                                                       
         ST    R7,BUF1+20                                                       
         ST    R8,BUF1+24                                                       
         ST    R9,BUF1+28                                                       
         ST    R10,BUF1+32                                                      
         ST    R11,BUF1+36                                                      
         ST    R12,BUF1+40                                                      
         ST    R13,BUF1+44                                                      
         ST    R14,BUF1+48                                                      
         ST    R15,BUF1+52                                                      
         ST    R0,BUF1+56                                                       
         ST    R1,BUF1+60                                                       
         STM   R2,R1,BUF2                                                       
         CLC   BUF1(64),BUF2                                                    
         IF    NE,BEGIN                                                         
         MWRITE 'STM FAILED'                                                    
         END                                                                    
* SR                                                                            
* RESTRICTION SR, S, SH - COND CODE NOT SET PROPERLY FOR OVERFLOW               
* RESTRICTION SR, S, SH - OFERFLOW NOT PROCESSED CORRECTLY                      
         L     R1,=F'1001000'                                                   
         L     R2,=F'1000'                                                      
         SR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,1000000)),BEGIN                                    
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'1'                                                         
         L     R2,=F'-2'                                                        
         SR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'2'                                                         
         SR    R1,R2                                                            
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-4000000'                                                  
         SR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,8000011)),BEGIN                                    
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'8000011'                                                   
         SR    R1,R2                                                            
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'8000011'                                                   
         L     R2,=F'4000011'                                                   
         SR    R1,R2                                                            
         IF    (NP,OR,(R1,NE,4000000)),BEGIN                                    
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'430030'                                                    
         SR    R1,R2                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         SR    R1,R1                                                            
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'SR FAILED'                                                     
         END                                                                    
* S                                                                             
         L     R1,=F'1001000'                                                   
         S     R1,=F'1000'                                                      
         IF    (NP,OR,(R1,NE,1000000)),BEGIN                                    
         MWRITE 'SR FAILED'                                                     
         END                                                                    
         L     R1,=F'1'                                                         
         S     R1,=F'-2'                                                        
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'S FAILED'                                                      
         END                                                                    
         L     R1,=F'-1'                                                        
         S     R1,=F'2'                                                         
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'S FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         S     R1,=F'-4000000'                                                  
         IF    (NP,OR,(R1,NE,8000011)),BEGIN                                    
         MWRITE 'S FAILED'                                                      
         END                                                                    
         L     R1,=F'4000011'                                                   
         S     R1,=F'8000011'                                                   
         IF    (NL,OR,(R1,NE,-4000000)),BEGIN                                   
         MWRITE 'S FAILED'                                                      
         END                                                                    
         L     R1,=F'8000011'                                                   
         S     R1,=F'4000011'                                                   
         IF    (NP,OR,(R1,NE,4000000)),BEGIN                                    
         MWRITE 'S FAILED'                                                      
         END                                                                    
         L     R1,=F'430030'                                                    
         S     R1,=F'430030'                                                    
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'S FAILED'                                                      
         END                                                                    
* SH                                                                            
         LH    R1,=H'10100'                                                     
         SH    R1,=H'100'                                                       
         IF    (NP,OR,(R1,NE,10000)),BEGIN                                      
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'1'                                                         
         SH    R1,=H'-2'                                                        
         IF    (NP,OR,(R1,NE,3)),BEGIN                                          
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'-1'                                                        
         SH    R1,=H'2'                                                         
         IF    (NL,OR,(R1,NE,-3)),BEGIN                                         
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         SH    R1,=H'-4000'                                                     
         IF    (NP,OR,(R1,NE,8011)),BEGIN                                       
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4011'                                                      
         SH    R1,=H'8011'                                                      
         IF    (NL,OR,(R1,NE,-4000)),BEGIN                                      
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'8011'                                                      
         SH    R1,=H'4011'                                                      
         IF    (NP,OR,(R1,NE,4000)),BEGIN                                       
         MWRITE 'SH FAILED'                                                     
         END                                                                    
         LH    R1,=H'4330'                                                      
         SH    R1,=H'4330'                                                      
         IF    (NZ,OR,(R1,NE,0)),BEGIN                                          
         MWRITE 'SH FAILED'                                                     
         END                                                                    
* SLR                                                                           
* RESTRICTION SLR - CONDITION CODE NOT SET                                      
         L     R1,=F'1001000'                                                   
         L     R2,=F'1000'                                                      
         SLR   R1,R2                                                            
         IF    (R1,NE,1000000),BEGIN                                            
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'1'                                                         
         L     R2,=F'-2'                                                        
         SLR   R1,R2                                                            
         IF    (R1,NE,3),BEGIN                                                  
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'-1'                                                        
         L     R2,=F'2'                                                         
         SLR   R1,R2                                                            
         IF    (R1,NE,-3),BEGIN                                                 
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'-4000000'                                                  
         SLR   R1,R2                                                            
         IF    (R1,NE,8000011),BEGIN                                            
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'4000011'                                                   
         L     R2,=F'8000011'                                                   
         SLR   R1,R2                                                            
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'8000011'                                                   
         L     R2,=F'4000011'                                                   
         SLR   R1,R2                                                            
         IF    (R1,NE,4000000),BEGIN                                            
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'430030'                                                    
         L     R2,=F'430030'                                                    
         SLR   R1,R2                                                            
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
         L     R1,=F'430030'                                                    
         SLR   R1,R1                                                            
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'SLR FAILED'                                                    
         END                                                                    
* SL                                                                            
* RESTRICTION SL - CONDITION CODE NOT SET                                       
         L     R1,=F'1001000'                                                   
         SL    R1,=F'1000'                                                      
         IF    (R1,NE,1000000),BEGIN                                            
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'1'                                                         
         SL    R1,=F'-2'                                                        
         IF    (R1,NE,3),BEGIN                                                  
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'-1'                                                        
         SL    R1,=F'2'                                                         
         IF    (R1,NE,-3),BEGIN                                                 
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         SL    R1,=F'-4000000'                                                  
         IF    (R1,NE,8000011),BEGIN                                            
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'4000011'                                                   
         SL    R1,=F'8000011'                                                   
         IF    (R1,NE,-4000000),BEGIN                                           
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'8000011'                                                   
         SL    R1,=F'4000011'                                                   
         IF    (R1,NE,4000000),BEGIN                                            
         MWRITE 'SL FAILED'                                                     
         END                                                                    
         L     R1,=F'430030'                                                    
         SL    R1,=F'430030'                                                    
         IF    (R1,NE,0),BEGIN                                                  
         MWRITE 'SL FAILED'                                                     
         END                                                                    
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
*                                                                               
DOTEST10 PROC  ITESTWA                                                          
*                                                                               
* TS                                                                            
* RESTRICTIONS TS - NOT ALLOWED                                                 
         SPACE 1                                                                
* TM                                                                            
* RESTRICTION TM - CC FLAG BITS SET DO NOT MATCH IBM. BUT ALL TESTS             
* RESTRICTION TM - AFTER A TM SHOULD WORK.  MIXED LOGIC SHOULD BE OK            
* RESTRICTION TM - NOW BUT WAS ONCE FLAKEY.                                     
*                                                                               
         L     R1,=X'00000000'                                                  
         ST    R1,F1                                                            
         L     R2,=X'0F000000'                                                  
         ST    R2,F2                                                            
         TM    F2,X'0F'                                                         
         IF    NO,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'13'                                                         
         IF    NM,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'F0'                                                         
         IF    NZ,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'00'                                                         
         IF    NZ,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         L     R1,=X'FFFFFFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0FFFFFF'                                                  
         ST    R2,F2                                                            
         TM    F2,X'F0'                                                         
         IF    NO,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'F0'                                                         
         IF    Z,BEGIN                                                          
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'F0'                                                         
         IF    M,BEGIN                                                          
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'0F'                                                         
         IF    M,BEGIN                                                          
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'31'                                                         
         IF    NM,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'0F'                                                         
         IF    NZ,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'00'                                                         
         IF    NZ,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         L     R1,=X'FFFFFFFF'                                                  
         ST    R1,F1                                                            
         L     R2,=X'F0FFFFFF'                                                  
         ST    R2,F2                                                            
         TM    F2,X'C0'                                                         
         IF    O,BEGIN                                                          
         END                                                                    
         ELSE  BEGIN                                                            
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'80'                                                         
         IF    NO,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'11'                                                         
         IF    M,BEGIN                                                          
         END                                                                    
         ELSE  BEGIN                                                            
         MWRITE 'TM FAILED'                                                     
         END                                                                    
         TM    F2,X'01'                                                         
         IF    NZ,BEGIN                                                         
         MWRITE 'TM FAILED'                                                     
         END                                                                    
* TR                                                                            
         MVC   BUF1(16),=CL16'0123456789ABCDEF'                                 
         MVC   BUF1+16(256-16),BUF1                                             
         MVC   BUF2(10),=XL10'00010203040506070809'                             
         MVC   BUF2+10(10),=XL10'0A0B0C0D0E0F10111213'                          
         TR    BUF2(16),BUF1                                                    
         CLC   BUF2(16),=CL16'0123456789ABCDEF'                                 
         IF    NE,BEGIN                                                         
         MWRITE 'TR FAILED'                                                     
         END                                                                    
         CLC   BUF2+16(4),=XL4'10111213'                                        
         IF    NE,BEGIN                                                         
         MWRITE 'TR FAILED'                                                     
         END                                                                    
         MVC   BUF2(10),=XL10'40414243444546474849'                             
         MVC   BUF2+10(10),=XL10'CACBCCCDCECFC0C1C2C3'                          
         TR    BUF2(16),BUF1                                                    
         CLC   BUF2(16),=CL16'0123456789ABCDEF'                                 
         IF    NE,BEGIN                                                         
         MWRITE 'TR FAILED'                                                     
         END                                                                    
         CLC   BUF2+16(4),=XL4'C0C1C2C3'                                        
         IF    NE,BEGIN                                                         
         MWRITE 'TR FAILED'                                                     
         END                                                                    
         MVC   BUF2(10),=XL10'40414243444546474849'                             
         MVC   BUF2+10(10),=XL10'CACBCCCDCECFC0C1C2C3'                          
         LA    R5,X'0210'                                                       
         DEX   R5,' TR    BUF2(0),BUF1  '                                       
         CLC   BUF2(16),=CL16'0123456789ABCDEF'                                 
         IF    NE,BEGIN                                                         
         MWRITE 'EX TR FAILED'                                                  
         END                                                                    
         CLC   BUF2+16(4),=XL4'C0C1C2C3'                                        
         IF    NE,BEGIN                                                         
         MWRITE 'EX TR FAILED'                                                  
         END                                                                    
* TRT                                                                           
         L     R0,=F'1234'                                                      
         L     R1,=F'2345'                                                      
         L     R2,=F'3456'                                                      
         MVI   BUF1,X'00'                                                       
         MVC   BUF1+1(255),BUF1                                                 
         MVC   BUF1+C'0'(10),=CL10'0123456789'                                  
         MVC   BUF1+256(256),BUF1                                               
         MVI   BUF2,X'00'                                                       
         MVC   BUF2+1(255),BUF2                                                 
         MVC   BUF2(16),=CL16'AAABAAABCCCDXXXZ'                                 
         MVC   BUF2+256(256),BUF2                                               
         TRT   BUF2(16),BUF1                                                    
         IF    (NZ,OR,(R0,NE,1234),OR,(R1,NE,2345)),BEGIN                       
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         IF    (R2,NE,3456),BEGIN                                               
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF1(256),BUF1+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF2(256),BUF2+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         L     R0,=F'1234'                                                      
         L     R1,=F'2345'                                                      
         L     R2,=X'0000F00F'                                                  
         LA    R3,BUF2+8                                                        
         MVI   BUF1,X'00'                                                       
         MVC   BUF1+1(255),BUF1                                                 
         MVC   BUF1+C'0'(10),=CL10'0123456789'                                  
         MVC   BUF1+256(256),BUF1                                               
         MVI   BUF2,X'00'                                                       
         MVC   BUF2+1(255),BUF2                                                 
         MVC   BUF2(16),=CL16'AAABAAAB11111111'                                 
         MVC   BUF2+256(256),BUF2                                               
         TRT   BUF2(16),BUF1                                                    
         IF    (NL,OR,(R0,NE,1234),OR,(R1,NE,R3)),BEGIN                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         IF    (R2,NE,X'0000F0F1'),BEGIN                                        
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF1(256),BUF1+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF2(256),BUF2+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         L     R0,=F'1234'                                                      
         L     R1,=F'2345'                                                      
         L     R2,=X'00F0000F'                                                  
         LA    R3,BUF2+15                                                       
         MVI   BUF1,X'00'                                                       
         MVC   BUF1+1(255),BUF1                                                 
         MVC   BUF1+C'0'(10),=CL10'0123456789'                                  
         MVC   BUF1+256(256),BUF1                                               
         MVI   BUF2,X'00'                                                       
         MVC   BUF2+1(255),BUF2                                                 
         MVC   BUF2(16),=CL16'AAABAAAB   XYYY9'                                 
         MVC   BUF2+256(256),BUF2                                               
         TRT   BUF2(16),BUF1                                                    
         IF    (NH,OR,(R0,NE,1234),OR,(R1,NE,R3)),BEGIN                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         IF    (R2,NE,X'00F000F9'),BEGIN                                        
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF1(256),BUF1+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         CLC   BUF2(256),BUF2+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'TRT FAILED'                                                    
         END                                                                    
         L     R0,=F'1234'                                                      
         L     R1,=F'2345'                                                      
         L     R2,=X'0000F00F'                                                  
         LA    R3,BUF2+8                                                        
         MVI   BUF1,X'00'                                                       
         MVC   BUF1+1(255),BUF1                                                 
         MVC   BUF1+C'0'(10),=CL10'0123456789'                                  
         MVC   BUF1+256(256),BUF1                                               
         MVI   BUF2,X'00'                                                       
         MVC   BUF2+1(255),BUF2                                                 
         MVC   BUF2(16),=CL16'AAABAAAB11111111'                                 
         MVC   BUF2+256(256),BUF2                                               
         LA    R5,16                                                            
         LTR   R5,R5                                                            
         DEX   R5,' TRT   BUF2(0),BUF1 '                                        
         IF    (NL,OR,(R0,NE,1234),OR,(R1,NE,R3)),BEGIN                         
         MWRITE 'EX TRT FAILED'                                                 
         END                                                                    
         IF    (R2,NE,X'0000F0F1'),BEGIN                                        
         MWRITE 'EX TRT FAILED'                                                 
         END                                                                    
         CLC   BUF1(256),BUF1+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'EX TRT FAILED'                                                 
         END                                                                    
         CLC   BUF2(256),BUF2+256                                               
         IF    NE,BEGIN                                                         
         MWRITE 'EX TRT FAILED'                                                 
         END                                                                    
* UNPK   (FROM POPS)                                                            
         MVC   BUF1(8),=XL8'0000000000000000'                                   
         MVC   BUF2(2),=XL2'123D'                                               
         UNPK BUF1(5),BUF2(2)                                                   
         CLC   BUF1(8),=XL8'F0F0F1F2D3000000'                                   
         IF    NE,BEGIN                                                         
         MWRITE 'UNPK FAILED'                                                   
         END                                                                    
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
*                                                                               
DOTEST11 PROC  ITESTWA                                                          
*                                                                               
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
*                                                                               
DOTEST12 PROC  ITESTWA                                                          
*                                                                               
*                                                                               
         PEND                                                                   
*                                                                               
         QLTORG                                                                 
*                                                                               
         END   .                                                                
