//BASIC  JOB   ,'BASIC ZAPPER'
/*JOBPARM LINES=99
//SCR EXEC CATSCR,OPTION=IGNORE,DSN='WYL.GG.LNG.XONTZAP'
//ASM     EXEC ASMC,REGION=900K,PARM='SY=(BAS)'
//SYSLIB DD  DSN=WYL.GG.LNG.BASMAC,DISP=SHR
//       DD  DSN=SYS3.ORVYL.UMACLIB,DISP=SHR
//       DD  DSN=SYS1.MACLIB,DISP=SHR
//SYSLIN DD  DSN=WYL.GG.LNG.XONTZAP,DISP=(NEW,CATLG)
//SYSIN     DD *
Follow with source from BASSRC for XONTZAP
Change XONTZAP to other source/objects as needed.
