RUNERR   CSECT
*                  ERROR MESSAGE PROCESSOR                            *
*                                                                     *
***********************************************************************
*
*        RUNERR IS CALLED WITH A ERROR MESSAGE NUMBER IN REGISTER 1   *
*        AND A BASIC LINE NUMBER IN REGISTER 0 (IN BINARY FORM)       *
*                                                                     *
*        AFTER SOME SORTING OUT LINE NUMBER AND ERROR NUMBER          *
*        ARE MOVED INTO AND ERROR MESSAGE BUFFER IN THE CONTROL       *
*        PROGRAM WORK AREA.  THE MESSAGE ITSELF IS THEN MOVED         *
*        INTO THE SAME BUFFER.                                        *
*                                                                     *
*        A CALL TO PUTLINE IS THEN MADE WITH REGISTER 1 NOW           *
*        POINTING AT THE NEWLY PREPARED BUFFER IN THE CONTROL         *
*        PROGRAM WORK AREA.  REGISTER 0 IS NOT USED ON THIS CALL      *
*        BUT IS SET TO ZERO SO PUTLINE WILL NOT GET CONFUSED.         *
*                                                                     *
*        RUNERR DOES NOT EXPECT AN ERROR RETURN FROM PUTLINE NOR      *
*        DOES IT PASS ONE TO ITS CALLER                               *
*                                                                     *
*        RUNERR IS REENTRANT.  ONLY THE STATEMENTS IN THE AREA        *
*        'SET UP AND LINK TO PUTLINE' SHOULD HAVE TO BE CHANGED       *
*        TO MAKE IT WORK WITH THE TIME SHARING MONITOR.  THIS         *
*        CHANGE WILL PROBABLY INVOLVE LEAVING THE LENGTH IN           *
*        REGISTER 0.
*                                                                     *
***************************START OF OS ENTRY LINKAGE*******************
*        SAVE  (14,12),,*
*        BALR  2,0                ESTABLISH ADDRESSABILITY FOR THIS ROU
*        USING *,2                *
*        LR    3,13               COPY CALLERS SAVE AREA ADDRESS
*        LA    13,72(0,13)        LOAD ADDRESS OF THIS ROUTINES SAVE AR
*        ST    13,8(0,3)          PUT THIS PROGRAMS SAVE AREA ADDRESS
*                                 IN CALLERS SAVE AREA
*        ST    3,4(0,13)          PUT CALLING PROGRAMS SAVE AREA ADDRES
BASER    EQU   2
         XAVE  RUNERR
*                                 IN THIS PROGRAMS SAVE AREA
*
**********************GET ADDRESSABILITY TO TWORK**********************
*
*        L     10,ACWORK
         LR    3,0                PUT IN SAFE PLACE
         LR    4,1                DITTO
         SENSE 2                  GET ADDRESS OF TWORK
         L     1,0(1)            DISPL. IF LOAD TEXT
         LR    10,1               PUT IT WHERE IT BELONGS
         LR    0,3                BACK YOU GO
         LR    1,4                DITTO
         USING TWORK,10
**********************SORT OUT ON THE ERROR CODE IN REG 1**************
         LA    15,CONVERT         SET UP ADDRESS OF CONVERT ROUTINE
         LTR   1,1                CHECK LOW BOUNDS
         BL    ERROR
         CL    1,TH10             CHECK HIGH BOUNDS
         BH    ERROR
         CL    1,TH5
         BL    BA04
         CL    1,TH7
         BL    BA56
         CL    1,TH8
         BL    A7
         CL    1,TH9
         BL    A8
         B     A9
BA56     CL    1,TH6
         BL    A5
         B     A6
BA04     CL    1,TH2
         BL    BA01
         CL    1,TH3
         BL    A2
         CL    1,TH4
         BL    A3
         B     A4
BA01     CL    1,TH1
         BL    A0
         B     A1
**************ELIMINATE HIGH DIGIT EFFECT******************************
ERROR    SR    1,1                MAKE A 0000 ERROR CODE
A0       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         LA    3,TAB0             GET ADDRESS OF START OF TRANSFER
*                                 VECTOR FOR THIS CODE
         LA    4,TAB1-2           GET ADDRESS OF END OF TRANSFER
*                                 VECTOR FOR THIS CODE
         B     F
A1       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH1              TAKE HIGH ORDER DIGIT OUT
         LA    3,TAB1             START OF TRANSFER VECTOR THIS CODE
         LA    4,TAB2-2           END OF TRANSFER VECTOR FOR THIS CODE
         B     F
A2       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH2
         LA    3,TAB2
         LA    4,TAB3-2
         B     F
A3       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH3
         LA    3,TAB3
         LA    4,TAB4-2
         B     F
A4       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH4
         LA    3,TAB4
         LA    4,TAB5-2
         B     F
A5       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH5
         LA    3,TAB5
         LA    4,TAB6-2
         B     F
A6       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH6
         LA    3,TAB6
         LA    4,TAB7-2
         B     F
A7       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH7
         LA    3,TAB7
         LA    4,TAB8-2
         B     F
A8       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH8
         LA    3,TAB8
         LA    4,TAB9-2
         B     F
A9       BALR  14,15              BRANCH TO CONVERT ERR AND STM NUMBER
         S     1,TH9
         LA    3,TAB9
         LA    4,TAB10-2
*******************CHECKS RANGE AND GETS ADDRESS OF MESSAGE************
F        SR    4,3                GET TRANSFER VECTOR LENGTH FOR
*                                 THIS CODE
         SLL   1,1(0)             CALLERS CODE TO HALF WORD DISPL
         CR    1,4                IS DISPL WITHIN VECTOR LENGTH
         BNH   FF
         SR    1,1
FF       LH    3,0(1,3)           FETCH DISPL TO MESSAGE
********************SET UP AND LINK TO PUTLINE*************************
*        MVI   ERRMESS,X'40'      STICK IN CARRIAGE CONTROL
*        MVI   ERRMS,X'40'        TO SET UP MVC
*        MVC   ERRMS+1(99),ERRMS  BLANK OUT THE BUFFER
         LA    1,TAB(3)           GET ADDRESS OF LENGTH BYTE OF MESSAGE
         SR    5,5                GET A CLEAN REGISTER
         IC    5,0(0,1)           GET LENGTH OF MESSAGE
         CH    5,=H'64'           TEST IF MSG TOO LONG
         BNH   FFF                SKIP IF IT IS NOT
         LA    5,64(0,0)          FORCE A SHORTER LINE
FFF      BCTR  5,0                TAKE AWAY 1 FOR MVC
         EX    5,DMOVE            XEQ MVC WITH LENGTH IN REG 5
*        LA    1,ERRMESS          PUT ADDRESS OF OUTPUT BUFFER IN REG 1
*        SR    0,0                CLEAR REGISTER 0  (LR  0,5)
*        L     15,APUTLINE        LOAD ADDRESS OF OUTPUT DRIVER
*        BALR  14,15              GO TO OUTPUT DRIVER
         LA    1,ERRMESS+1        GET ADDRESS OF IT
         LA    14,21(0,5)         GET TOTAL LENGTH
FFFF     WRITE TI,(1),(14)        OUT GOES THE MESSAGE
         BZ    FFFFF              TEST FOR STARTED
         PANIC 5
FFFFF    WAIT  TI                 WAIT FOR IT
         BM    FFFF               BACK ON I/O ERROR
*
*********************RETURN TO CALLER**********************************
         L     13,4(0,13)         PUT ADDRESS OF CALLING PROGRAMS
*                                 SAVE AREA BACK IN REGISTER 13
         LM    14,12,12(13)       RESTORE CALLERS REGISTERS
         BCR   15,14              RETURN TO CALLER
         LTORG
*
**************MOVE MESSAGE PORTION TO OUTPUT BUFFER********************
*
DMOVE    MVC   ERRMS(0),1(1)      MOVE MESSAGE TO OUTPUT BUFFER
*
*CONVERT STATEMENT AND ERROR NUMBER INTO THE ERROR BUFFER
*
CONVERT  CVD   1,PAREA            MAKE ERROR NUMBER PACKED DECIMAL
         MVC   ERRNO(6),MASK      PUT EDIT MASK INTO POSITION
         ED    ERRNO(6),PAREA+5   CONVERT BY EDITING
         CVD   0,PAREA            MAKE STMT # A PACKED DECIMAL NUMBER
         MVC   ERRLN(6),MASK      PUT EDIT MASK INTO POSITION
         ED    ERRLN(6),PAREA+5   CONVERT BY EDITING
         MVI   ERRMESS+14,C'('    PUT IN THE )
         BCR   15,14              GO BACK
*******************HIGH DIGIT CONSTANT TABLE***************************
TH1      DC    1F'1000'
TH2      DC    1F'2000'
TH3      DC    1F'3000'
TH4      DC    1F'4000'
TH5      DC    1F'5000'
TH6      DC    1F'6000'
TH7      DC    1F'7000'
TH8      DC    1F'8000'
TH9      DC    1F'9000'
TH10     DC    1F'9999'
*******************MASK TO EDIT OUTPUT BUFFER**************************
MASK     DC    X'402020202120'
******************FOR EXTERNAL CALL FROM THIS ROUTINE******************
*APUTLINE DC    V(PUTLINE)
*ACWORK   DC    V(CWORK)
*******************TRANSFER VECTOR OF DISPLACEMENTS********************
TAB0     DC    AL2(ER0000-1-TAB)
         DC    AL2(ER0001-1-TAB)
         DC    AL2(ER0002-1-TAB)
TAB1     DC    AL2(ER1000-1-TAB)
         DC    AL2(ER1001-1-TAB)
         DC    AL2(ER1002-1-TAB)
         DC    AL2(ER1003-1-TAB)
         DC    AL2(ER1004-1-TAB)
         DC    AL2(ER1005-1-TAB)
         DC    AL2(ER1006-1-TAB)
         DC    AL2(ER1007-1-TAB)
         DC    AL2(ER1008-1-TAB)
         DC    AL2(ER1009-1-TAB)
         DC    AL2(ER1010-1-TAB)
         DC    AL2(ER1011-1-TAB)
         DC    AL2(ER1012-1-TAB)
         DC    AL2(ER1013-1-TAB)
         DC    AL2(ER1014-1-TAB)
         DC    AL2(ER1015-1-TAB)
         DC    AL2(ER1016-1-TAB)
         DC    AL2(ER1017-1-TAB)
         DC    AL2(ER1018-1-TAB)
         DC    AL2(ER1019-1-TAB)
         DC    AL2(ER1020-1-TAB)
         DC    AL2(ER1021-1-TAB)
         DC    AL2(ER1022-1-TAB)
         DC    AL2(ER1023-1-TAB)
         DC    AL2(ER1024-1-TAB)
         DC    AL2(ER1025-1-TAB)
         DC    AL2(ER1026-1-TAB)
         DC    AL2(ER1027-1-TAB)
         DC    AL2(ER1028-1-TAB)
         DC    AL2(ER1029-1-TAB)
         DC    AL2(ER1030-1-TAB)
         DC    AL2(ER1031-1-TAB)
         DC    AL2(ER1032-1-TAB)
         DC    AL2(ER1033-1-TAB)
         DC    AL2(ER1034-1-TAB)
         DC    AL2(ER1035-1-TAB)
         DC    AL2(ER1036-1-TAB)
         DC    AL2(ER1037-1-TAB)
         DC    AL2(ER1038-1-TAB)
         DC    AL2(ER1039-1-TAB)
         DC    AL2(ER1040-1-TAB)
         DC    AL2(ER1041-1-TAB)
TAB2     DC    AL2(ER2000-1-TAB)
         DC    AL2(ER2001-1-TAB)
         DC    AL2(ER2002-1-TAB)
         DC    AL2(ER2003-1-TAB)
         DC    AL2(ER2004-1-TAB)
         DC    AL2(ER2005-1-TAB)
         DC    AL2(ER2006-1-TAB)
         DC    AL2(ER2007-1-TAB)
         DC    AL2(ER2008-1-TAB)
         DC    AL2(ER2009-1-TAB)
TAB3     DC    AL2(ER3000-1-TAB)
         DC    AL2(ER3001-1-TAB)
TAB4     DC    AL2(ER4000-1-TAB)
         DC    AL2(ER4001-1-TAB)
         DC    AL2(ER4002-1-TAB)
         DC    AL2(ER4003-1-TAB)
         DC    AL2(ER4004-1-TAB)
         DC    AL2(ER4005-1-TAB)
         DC    AL2(ER4006-1-TAB)
         DC    AL2(ER4007-1-TAB)
         DC    AL2(ER4008-1-TAB)
         DC    AL2(ER4009-1-TAB)
         DC    AL2(ER4010-1-TAB)
         DC    AL2(ER4011-1-TAB)
         DC    AL2(ER4012-1-TAB)
         DC    AL2(ER4013-1-TAB)
         DC    AL2(ER4014-1-TAB)
         DC    AL2(ER4015-1-TAB)
         DC    AL2(ER4016-1-TAB)
         DC    AL2(ER4017-1-TAB)
         DC    AL2(ER4018-1-TAB)
         DC    AL2(ER4019-1-TAB)
         DC    AL2(ER4020-1-TAB)
         DC    AL2(ER4021-1-TAB)
         DC    AL2(ER4022-1-TAB)
         DC    AL2(ER4023-1-TAB)
         DC    AL2(ER4024-1-TAB)
         DC    AL2(ER4025-1-TAB)
TAB5     DC    AL2(ER5000-1-TAB)
         DC    AL2(ER5001-1-TAB)
         DC    AL2(ER5002-1-TAB)
         DC    AL2(ER5003-1-TAB)
         DC    AL2(ER5004-1-TAB)
         DC    AL2(ER5005-1-TAB)
         DC    AL2(ER5006-1-TAB)
         DC    AL2(ER5007-1-TAB)
         DC    AL2(ER5008-1-TAB)
         DC    AL2(ER5009-1-TAB)
         DC    AL2(ER5010-1-TAB)
         DC    AL2(ER5011-1-TAB)
         DC    AL2(ER5012-1-TAB)
         DC    AL2(ER5013-1-TAB)
         DC    AL2(ER5014-1-TAB)
         DC    AL2(ER5015-1-TAB)
         DC    AL2(ER5016-1-TAB)
         DC    AL2(ER5017-1-TAB)
         DC    AL2(ER5018-1-TAB)
TAB6     DC    AL2(ER6000-1-TAB)
         DC    AL2(ER6001-1-TAB)
         DC    AL2(ER6002-1-TAB)
         DC    AL2(ER6003-1-TAB)
         DC    AL2(ER6004-1-TAB)
         DC    AL2(ER6005-1-TAB)
         DC    AL2(ER6006-1-TAB)
TAB7     DC    AL2(ER7000-1-TAB)
         DC    AL2(ER7001-1-TAB)
         DC    AL2(ER7002-1-TAB)
         DC    AL2(ER7003-1-TAB)
         DC    AL2(ER7004-1-TAB)
         DC    AL2(ER7005-1-TAB)
         DC    AL2(ER7006-1-TAB)
         DC    AL2(ER7007-1-TAB)
         DC    AL2(ER7008-1-TAB)
         DC    AL2(ER7009-1-TAB)
         DC    AL2(ER7010-1-TAB)
         DC    AL2(ER7011-1-TAB)
         DC    AL2(ER7012-1-TAB)
         DC    AL2(ER7013-1-TAB)
         DC    AL2(ER7014-1-TAB)
         DC    AL2(ER7015-1-TAB)
         DC    AL2(ER7016-1-TAB)
         DC    AL2(ER7017-1-TAB)
         DC    AL2(ER7018-1-TAB)
         DC    AL2(ER7019-1-TAB)
         DC    AL2(ER7020-1-TAB)
         DC    AL2(ER7021-1-TAB)
         DC    AL2(ER7022-1-TAB)
         DC    AL2(ER7023-1-TAB)
         DC    AL2(ER7024-1-TAB)
         DC    AL2(ER7025-1-TAB)
         DC    AL2(ER7026-1-TAB)
         DC    AL2(ER7027-1-TAB)
         DC    AL2(ER7028-1-TAB)
         DC    AL2(ER7029-1-TAB)
         DC    AL2(ER7030-1-TAB)
         DC    AL2(ER7031-1-TAB)
         DC    AL2(ER7032-1-TAB)
         DC    AL2(ER7033-1-TAB)
         DC    AL2(ER7034-1-TAB)
         DC    AL2(ER7035-1-TAB)
         DC    AL2(ER7036-1-TAB)
         DC    AL2(ER7037-1-TAB)
         DC    AL2(ER7038-1-TAB)
         DC    AL2(ER7039-1-TAB)
         DC    AL2(ER7040-1-TAB)
         DC    AL2(ER7041-1-TAB)
         DC    AL2(ER7042-1-TAB)
         DC    AL2(ER7043-1-TAB)
         DC    AL2(ER7044-1-TAB)
         DC    AL2(ER7045-1-TAB)
         DC    AL2(ER7046-1-TAB)
         DC    AL2(ER7047-1-TAB)
TAB8     DC    AL2(ER8000-1-TAB)
         DC    AL2(ER8001-1-TAB)
         DC    AL2(ER8002-1-TAB)
         DC    AL2(ER8003-1-TAB)
         DC    AL2(ER8004-1-TAB)
         DC    AL2(ER8005-1-TAB)
         DC    AL2(ER8006-1-TAB)
         DC    AL2(ER8007-1-TAB)
         DC    AL2(ER8008-1-TAB)                         PRS  11/25/75
TAB9     DC    AL2(ER9000-1-TAB)
TAB10    EQU   *
***********************TABLE OF MESSAGES*******************************
TAB      EQU   *
         DC    AL1(L'ER0000)
ER0000   DC    C'CONTROL PROGRAM UNDEFINED ERROR'
         DC    AL1(L'ER0001)
ER0001   DC    C'COMPILATION TERMINATED. TOO MANY CONSTANTS/DATA'
         DC    AL1(L'ER0002)
ER0002   DC    C'INCORRECTLY FORMED QUOTE STRING'
         DC    AL1(L'ER1000)
ER1000   DC    C'SYNTAX PROCESSOR UNDEFINED ERROR'
         DC    AL1(L'ER1001)
ER1001   DC    C'STATEMENT ENDS UNEXPECTEDLY'
         DC    AL1(L'ER1002)
ER1002   DC    C'MISSING OR INCORRECT STATEMENT TYPE'
         DC    AL1(L'ER1003)
ER1003   DC    C' '
         DC    AL1(L'ER1004)
ER1004   DC    C'MISSING OR INCORRECT FUNCTION IDENTIFIER'
         DC    AL1(L'ER1005)
ER1005   DC    C'MISSING OR INCORRECT PARAMETER'
         DC    AL1(L'ER1006)
ER1006   DC    C'MISSING EQUALS SIGN'
         DC    AL1(L'ER1007)
ER1007   DC    C'MISSING "THEN"'
         DC    AL1(L'ER1008)
ER1008   DC    C'MISSING OR INCORRECT "FOR-VARIABLE"'
         DC    AL1(L'ER1009)
ER1009   DC    C'MISSING "TO"'
         DC    AL1(L'ER1010)
ER1010   DC    C'INCORRECT STEP'
         DC    AL1(L'ER1011)
ER1011   DC    C'INCORRECT CONSTANT'
         DC    AL1(L'ER1012)
ER1012   DC    C'MISSING OR INCORRECT QUANTITY'
         DC    AL1(L'ER1013)
ER1013   DC    C'NO CLOSE QUOTE FOR PRINT STRING'
         DC    AL1(L'ER1014)
ER1014   DC    C'MISSING PUNCTUATION OR BAD EXPRESSION'
         DC    AL1(L'ER1015)
ER1015   DC    C'ILLEGAL WORD FOLLOWS "MAT"'
         DC    AL1(L'ER1016)
ER1016   DC    C'NOTHING TO WRITE SPECIFIED IN WRITE STATEMENT'
         DC    AL1(L'ER1017)
ER1017   DC    C'IMPROPER MATRIX FUNCTION'
         DC    AL1(L'ER1018)
ER1018   DC    C'INCORRECT PARAMETER LIST'
         DC    AL1(L'ER1019)
ER1019   DC    C'MAY NOT TRANSPOSE MATRIX INTO SELF'
         DC    AL1(L'ER1020)
ER1020   DC    C' '
         DC    AL1(L'ER1021)
ER1021   DC    C' '
         DC    AL1(L'ER1022)
ER1022   DC    C'MATRIX MAY NOT BE BOTH OPERAND AND RESULT OF MATRIX MUX
               LT.'
         DC    AL1(L'ER1023)
ER1023   DC    C'MISSING LEFT PARENTHESIS'
         DC    AL1(L'ER1024)
ER1024   DC    C'MISSING RIGHT PARENTHESIS'
         DC    AL1(L'ER1025)
ER1025   DC    C'ELEMENT NOT RECOGNIZED'
         DC    AL1(L'ER1026)
ER1026   DC    C'BAD SUBSCRIPT'
         DC    AL1(L'ER1027)
ER1027   DC    C'MISSING ARRAY IDENTIFIER'
         DC    AL1(L'ER1028)
ER1028   DC    C'MISSING OR BAD INTEGER OR LINE NUMBER'
         DC    AL1(L'ER1029)
ER1029   DC    C'NON-BLANK CHARACTER FOLLOWING STATEMENT''S LOGICAL ENDX
               '
         DC    AL1(L'ER1030)
ER1030   DC    C'MISSING RIGHT PREN. IN WRITE STATEMENT'
         DC    AL1(L'ER1031)
ER1031   DC    C'MISSING SIMPLE VARIABLE NAME'
         DC    AL1(L'ER1032)
ER1032   DC    C'OPERATOR CANNOT DIRECTLY FOLLOW OPERATOR'
         DC    AL1(L'ER1033)
ER1033   DC    C'STRING CONSTANT CANNOT EXCEED 15 CHARACTERS'
         DC    AL1(L'ER1034)
ER1034   DC    C'MISPLACED LEFT PARENTHESIS'
         DC    AL1(L'ER1035)
ER1035   DC    C'MISPLACED RIGHT PARENTHESIS'
         DC    AL1(L'ER1036)
ER1036   DC    C'MISSING OR INCORRECT STRING VARIABLE OR STRING CONSTANX
               T'
         DC    AL1(L'ER1037)
ER1037   DC    C'MISPLACED QUOTE'
         DC    AL1(L'ER1038)
ER1038   DC    C'MISPLACED COMMA OR SEMICOLON'
         DC    AL1(L'ER1039)
ER1039   DC    C' '
         DC    AL1(L'ER1040)
ER1040   DC    C'MISSING RELATION OPERATOR'
         DC    AL1(L'ER1041)
ER1041   DC    C'"FOR", "NEXT", && NON-EXECUTABLE STMTS ILLEGAL AFTER "X
               THEN"'
         DC    AL1(L'ER2000)
ER2000   DC    C'COMPILER UNDEFINED ERROR'
         DC    AL1(L'ER2001)
ER2001   DC    C'VARIABLE ALREADY DIMENSIONED. STATEMENT IGNORED'
         DC    AL1(L'ER2002)
ER2002   DC    C'FUNCTION PREVIOUSLY DEFINED. STATEMENT IGNORED'
         DC    AL1(L'ER2003)
ER2003   DC    C'PSEUDO-CODE TABLE FULL. COMPILATION TERMINATED'
         DC    AL1(L'ER2004)
ER2004   DC    C'LINES TABLE FULL. COMPILATION TERMINATED'
         DC    AL1(L'ER2005)
ER2005   DC    C'TOO MANY CONSTANTS/DATA. COMPILATION TERMINATED'
         DC    AL1(L'ER2006)
ER2006   DC    C'"FOR-NEXT" TABLE FULL. COMPILATION TERMINATED'
         DC    AL1(L'ER2007)
ER2007   DC    C' '
         DC    AL1(L'ER2008)
ER2008   DC    C'HAS BEEN DELETED'
         DC    AL1(L'ER2009)
ER2009   DC    C'HAS BEEN REPLACED'
         DC    AL1(L'ER3000)
ER3000   DC    C'LOADER UNDEFINED ERROR'
         DC    AL1(L'ER3001)
ER3001   DC    C'NO MORE CORE TO ALLOCATE ARRAYS'
         DC    AL1(L'ER4000)
ER4000   DC    C'STOP EXECUTED'
         DC    AL1(L'ER4001)
ER4001   DC    C'PAUSE EXECUTED'
         DC    AL1(L'ER4002)
ER4002   DC    C'END OF EXECUTION'
         DC    AL1(L'ER4003)
ER4003   DC    C'TOO MANY NESTED GOSUBS'
         DC    AL1(L'ER4004)
ER4004   DC    C'TOO MANY NESTED DEFINED FUNCTIONS'
         DC    AL1(L'ER4005)
ER4005   DC    C'TOO MANY NESTED FOR LOOPS'
         DC    AL1(L'ER4006)
ER4006   DC    C'NO CORRESPONDING FOR STATEMENT'
         DC    AL1(L'ER4007)
ER4007   DC    C'NO CORRESPONDING NEXT STATEMENT'
         DC    AL1(L'ER4008)
ER4008   DC    C'DEF FN MISSING'
         DC    AL1(L'ER4009)
ER4009   DC    C'MATRIX RE-DEFINITION EXCEEDS ALLOCATED STORAGE'
         DC    AL1(L'ER4010)
ER4010   DC    C'INCONSISTENT USE OF SUBSCRIPTS'
         DC    AL1(L'ER4011)
ER4011   DC    C'STATEMENT MISSING'
         DC    AL1(L'ER4012)
ER4012   DC    C'INCOMPATIBLE DIMENSIONS IN A MATRIX COMPUTATION'
         DC    AL1(L'ER4013)
ER4013   DC    C'SUBSCRIPT OUT OF RANGE'
         DC    AL1(L'ER4014)
ER4014   DC    C'EXECUTING A SYNTACTICALLY INCORRECT STATEMENT'
         DC    AL1(L'ER4015)
ER4015   DC    C'NO MORE DATA'
         DC    AL1(L'ER4016)
ER4016   DC    C'PRINT ERROR'
         DC    AL1(L'ER4017)
ER4017   DC    C'READ ERROR'
         DC    AL1(L'ER4018)
ER4018   DC    C'WRITE ERROR'
         DC    AL1(L'ER4019)
ER4019   DC    C'VARIABLE MAY NOT BE BOTH SIMPLE AND SUBSCRIPTED'
         DC    AL1(L'ER4020)
ER4020   DC    C'NO CORRESPONDING GOSUB STATEMENT '
         DC    AL1(L'ER4021)
ER4021   DC    C'NO MORE CORE TO ALLOCATE ARRAYS'
         DC    AL1(L'ER4022)
ER4022   DC    C'NOTHING TO EXECUTE'
         DC    AL1(L'ER4023)
ER4023   DC    C'ARGUMENT TO RND NOT A SIMPLE VARIABLE'
         DC    AL1(L'ER4024)
ER4024   DC    C'INVALID STRING DATA IN A DATA STATEMENT'
         DC    AL1(L'ER4025)
ER4025   DC    C'INTERRUPT'
         DC    AL1(L'ER5000)
ER5000   DC    C'ARITHMETIC ROUTINE UNDEFINED ERROR'
         DC    AL1(L'ER5001)
ER5001   DC    C'ARITHMETIC OVERFLOW-NUMBER TOO LARGE'
         DC    AL1(L'ER5002)
ER5002   DC    C'ARITHMETIC UNDERFLOW-NUMBER TOO SMALL'
         DC    AL1(L'ER5003)
ER5003   DC    C'DIVIDE CHECK-DO NOT DIVIDE BY ZERO'
         DC    AL1(L'ER5004)
ER5004   DC    C'ATTEMPT TO RAISE NEGATIVE NUMBER OR ZERO TO FLOATING PX
               OINT POWER'
         DC    AL1(L'ER5005)
ER5005   DC    C'ATTEMPT TO TAKE "LOG" OF ZERO OR NEGATIVE NUMBER'
         DC    AL1(L'ER5006)
ER5006   DC    C'"EXP" GIVEN TOO LARGE AN ARGUMENT'
         DC    AL1(L'ER5007)
ER5007   DC    C'ATTEMPT TO TAKE SQUARE ROOT OF A NEGATIVE NUMBER'
         DC    AL1(L'ER5008)
ER5008   DC    C'ARGUMENT OF "SIN" OR "COS" TOO LARGE'
         DC    AL1(L'ER5009)
ER5009   DC    C'ARGUMENT OF TAN TOO LARGE'
         DC    AL1(L'ER5010)
ER5010   DC    C'ATTEMPT TO INVERT A SINGULAR MATRIX'
         DC    AL1(L'ER5011)
ER5011   DC    C'NUMBER OUT OF RANGE IN INVERSION PROCESS'
         DC    AL1(L'ER5012)
ER5012   DC    C'NUMBER OUT OF RANGE IN RAISING NO. TO A POWER'
         DC    AL1(L'ER5013)
ER5013   DC    C'NUMBER OUT OF RANGE IN LOG FUNCTION'
         DC    AL1(L'ER5014)
ER5014   DC    C'NUMBER OUT OF RANGE IN EXP FUNCTION'
         DC    AL1(L'ER5015)
ER5015   DC    C'NUMBER OUT OF RANGE IN SQR FUNCTION'
         DC    AL1(L'ER5016)
ER5016   DC    C'NUMBER OUT OF RANGE IN ATN FUNCTION'
         DC    AL1(L'ER5017)
ER5017   DC    C'NUMBER OUT OF RANGE IN SIN OR COS FUNCTION'
         DC    AL1(L'ER5018)
ER5018   DC    C'NUMBER OUT OF RANGE IN TAN FUNCTION'
         DC    AL1(L'ER6000)
ER6000   DC    C'INPUT ERROR UNDEFINED ERROR'
         DC    AL1(L'ER6001)
ER6001   DC    C'INCORRECTLY SPECIFIED STRING'
         DC    AL1(L'ER6002)
ER6002   DC    C'NO INPUT COULD BE FOUND'
         DC    AL1(L'ER6003)
ER6003   DC    C'STRING INCORRECTLY POSITIONED OR NOT PRESENT'
         DC    AL1(L'ER6004)
ER6004   DC    C'STRING LONGER THAN 15 CHARACTERS'
         DC    AL1(L'ER6005)
ER6005   DC    C'NUMERIC DATA INCORRECTLY POSITIONED'
         DC    AL1(L'ER6006)
ER6006   DC    C'NUMERIC DATA INCORRECTLY SPECIFIED'
         DC    AL1(L'ER7000)
ER7000   DC    C'UNDEFINED PROCESSOR ERROR'
         DC    AL1(L'ER7001)
ER7001   DC    C'NO CORRESPONDING DEF FILE FOR LOGICAL FILE'
         DC    AL1(L'ER7002)
ER7002   DC    C'NEGATIVE RECORD INDEX NOT PERMITTED'
         DC    AL1(L'ER7003)
ER7003   DC    C'SYSTEM ERROR, ATTACH IN PROCESS'
         DC    AL1(L'ER7004)
ER7004   DC    C'SYSTEM ERROR, REDUNDANT ATTACH (-SHARE)'
         DC    AL1(L'ER7005)
ER7005   DC    C'SYSTEM ERROR, REDUNDANT ATTACH (SHARE)'
         DC    AL1(L'ER7006)
ER7006   DC    C'ATTEMPT TO ATTACH MORE THAN 15 FILES AND/OR DEVICES'
         DC    AL1(L'ER7007)
ER7007   DC    C'ILLEGAL FILE NAME AT EXECUTION TIME'
         DC    AL1(L'ER7008)
ER7008   DC    C'ACCESS TO THIS FILE NOT PERMITTED'
         DC    AL1(L'ER7009)
ER7009   DC    C'FILE STORAGE LIMIT EXCEEDED (-OLD)'
         DC    AL1(L'ER7010)
ER7010   DC    C'NO SPACE REMAINS IN FILE DIRECTORY'
         DC    AL1(L'ER7011)
ER7011   DC    C'SYSTEM ERROR, FILE NOT THERE (OLD)'
         DC    AL1(L'ER7012)
ER7012   DC    C'SYSTEM ERROR, FILE ALREADY THERE (-OLD)'
         DC    AL1(L'ER7013)
ER7013   DC    C'SYSTEM TABLES OVERFLOW'
         DC    AL1(L'ER7014)
ER7014   DC    C'FILE SPACE EXHAUSTED (-OLD)'
         DC    AL1(L'ER7015)
ER7015   DC    C'SYSTEM ERROR, FILE NOT IMMEDIATELY AVAILABLE (ATTACH)'
         DC    AL1(L'ER7016)
ER7016   DC    C'ATTEMPT TO REFERENCE RECORD ZERO'
         DC    AL1(L'ER7017)
ER7017   DC    C'SYSTEM ERROR IN STARTING A FILE WRITE'
         DC    AL1(L'ER7018)
ER7018   DC    C'SYSTEM ERROR, FILE NOT IMMEDIATELY AVAILABLE (WRITE)'
         DC    AL1(L'ER7019)
ER7019   DC    C'WRITE ACCESS TO FILE PROHIBITED'
         DC    AL1(L'ER7020)
ER7020   DC    C'REWRITING OF RECORDS IN THIS FILE PROHIBITED'
         DC    AL1(L'ER7021)
ER7021   DC    C'FILE STORAGE LIMIT EXCEEDED (WRITE)'
         DC    AL1(L'ER7022)
ER7022   DC    C'FILE SPACE EXHAUSTED (WRITE)'
         DC    AL1(L'ER7023)
ER7023   DC    C'SYSTEM ERROR, PERMANENT I/O ERROR (WRITE)'
         DC    AL1(L'ER7024)
ER7024   DC    C'SYSTEM ERROR IN STARTING A FILE READ'
         DC    AL1(L'ER7025)
ER7025   DC    C'SYSTEM ERROR, FILE NOT IMMEDIATELY AVAILABLE (READ)'
         DC    AL1(L'ER7026)
ER7026   DC    C'READ ACCESS TO THIS FILE PROHIBITED'
         DC    AL1(L'ER7027)
ER7027   DC    C'SYSTEM ERROR, PERMANENT I/O ERROR (READ)'
         DC    AL1(L'ER7028)
ER7028   DC    C'LRECL FOR THIS FILE DOES NOT PERMIT STRING OPERATIONS'
         DC    AL1(L'ER7029)
ER7029   DC    C'ATTEMPT TO READ MISSING RECORD OR RECORD ELEMENT'
         DC    AL1(L'ER7030)
ER7030   DC    C'"=" DELIMITER MISSING IN DEFINE FILE STATEMENT'
         DC    AL1(L'ER7031)
ER7031   DC    C'FILE NUMBER MISSING IN DEFINE FILE STATEMENT'
         DC    AL1(L'ER7032)
ER7032   DC    C'ATTEMPT TO DEFINE MORE THAN 15 FILES'
         DC    AL1(L'ER7033)
ER7033   DC    C'FILE NUMBER ON THIS DEFINE FILE ALREADY IN USE'
         DC    AL1(L'ER7034)
ER7034   DC    C'FILE NAME MISSING IN DEFINE FILE STATEMENT'
         DC    AL1(L'ER7035)
ER7035   DC    C'DEFINE FILE OPTIONS INCORRECTLY SPECIFIED'
         DC    AL1(L'ER7036)
ER7036   DC    C'UNRECOGNIZED OPTION IN DEFINE FILE STATEMENT'
         DC    AL1(L'ER7037)
ER7037   DC    C'SHARED FILE MAY NOT SPECIFY DELETE'
         DC    AL1(L'ER7038)
ER7038   DC    C'TEMPORARY FILE MAY NOT SPECIFY SHARE'
         DC    AL1(L'ER7039)
ER7039   DC    C'DEFINE FILE COMBINATIONS S/* AND &&/* ILLEGAL'
         DC    AL1(L'ER7040)
ER7040   DC    C'&&ANNN FILE NAME MAY NOT BE TEMPORARY (*)'
         DC    AL1(L'ER7041)
ER7041   DC    C'&&ANNN FILE NAME MAY NOT SPECIFY DELETE'
         DC    AL1(L'ER7042)
ER7042   DC    C'DUPLICATE FILE NAMES NOT PERMITTED'
         DC    AL1(L'ER7043)
ER7043   DC    C'SYSTEM ERROR, CHANGED RECORD WITH NO LENGTH'
         DC    AL1(L'ER7044)
ER7044   DC    C'SYSTEM ERROR, CHANGED RECORD IN UNATTACHED FILE'
         DC    AL1(L'ER7045)
ER7045   DC    C'SYSTEM ERROR, ERROR AT START OF DETACH'
         DC    AL1(L'ER7046)
ER7046   DC    C'SYSTEM ERROR, ERROR RETURNED FROM DETACH'
         DC    AL1(L'ER7047)
ER7047   DC    C'ATTEMPT TO REFERENCE PHYSICAL RECORD NUMBER >434279'
         DC    AL1(L'ER8000)
ER8000   DC    C'UNDEFINED PROCESSOR UNDEFINED ERROR'
         DC    AL1(L'ER8001)
ER8001   DC    C'SCOPE OPERATION ATTEMPTED. NO SCOPE ATTACHED'
         DC    AL1(L'ER8002)
ER8002   DC    C'SCOPE ATTACH ABORTED. NO SPACE FOR INTERUPT ROUTINE.'
         DC    AL1(L'ER8003)
ER8003   DC    C'SCOPE ATTACH ABORTED. ILLEGAL SCOPE NUMBER.'
         DC    AL1(L'ER8004)
ER8004   DC    C'SCOPE ATTACH ABORTED. TOO MANY DEVICES ATTACHED.'
         DC    AL1(L'ER8005)
ER8005   DC    C'SCOPE ATTACH ABORTED. SCOPE NOT AVAILABLE.'
         DC    AL1(L'ER8006)
ER8006   DC    C'SCOPE ATTACH ABORTED. ATTACH ALREADY STARTED.'
         DC    AL1(L'ER8007)
ER8007   DC    C'SCOPE ATTACH ABORTED. SCOPE ALREADY ATTACHED.'
         DC    AL1(L'ER8008)   ERR MSG FOR PLOT ADDED    PRS  11/7/75
ER8008   DC    C'INVALID ARGUMENT PASSED TO SUBROUTINE PLT.'
         DC    AL1(L'ER9000)
ER9000   DC    C'UNDEFINED PROCESSOR UNDEFINED ERROR'
         EJECT
TWORK    DSECT
         COPY  TWORK
         END
