 DCL PRINT EXT ENTRY;
 DCL PROMPT EXT ENTRY(,,FIXED BIN(31));
 DCL OPEN EXT ENTRY(FIXED BIN(31),,FIXED BIN(31));
 DCL CLOSE EXT ENTRY;
 DCL READ EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL WRITE EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL READSEQ EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31),
               FIXED BIN(31));
 DCL READE EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL READVA EXT ENTRY(FIXED BIN(31),(*)FLOAT DEC(6),FIXED BIN(31),
               FIXED BIN(31));
 DCL READVC EXT ENTRY(FIXED BIN(31),(*)FLOAT DEC(6),FIXED BIN(31),
               FIXED BIN(31));
 DCL READVS EXT ENTRY(FIXED BIN(31),CHAR(*)VAR,FIXED BIN(31),
               FIXED BIN(31));
 DCL READVX EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL WRITEVA EXT ENTRY(FIXED BIN(31),(*)FLOAT DEC(6),FIXED BIN(31),
               FIXED BIN(31),FIXED BIN(31));
 DCL WRITEVS EXT ENTRY(FIXED BIN(31),CHAR(*)VAR,FIXED BIN(31),
               FIXED BIN(31),FIXED BIN(31));
 DCL HIGHKEY EXT ENTRY(FIXED BIN(31),FIXED BIN(31),FIXED BIN(31));
 DCL READW EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL WRITEW EXT ENTRY(FIXED BIN(31),,FIXED BIN(31),FIXED BIN(31));
 DCL COMMAND EXT ENTRY(,FIXED BIN(31));
 DCL CONTROL EXT ENTRY;
 DCL LEFTSUB EXT ENTRY RETURNS(CHAR(256)VAR);
 DCL RITESUB EXT ENTRY RETURNS(CHAR(256)VAR);
 DCL REVSUB EXT ENTRY RETURNS(CHAR(256)VAR);
 DCL SCAN EXT ENTRY(,,FIXED BIN(15)) RETURNS(FIXED BIN(15));
 DCL REVSCAN EXT ENTRY(,,FIXED BIN(15)) RETURNS(FIXED BIN(15));
 DCL SCANSUB EXT ENTRY(,,FIXED BIN(15)) RETURNS(CHAR(256)VAR);
 DCL SCOUNT EXT ENTRY RETURNS(FIXED BIN(15));
 DCL BTRIM EXT ENTRY(,FIXED BIN(15)) RETURNS(CHAR(256)VAR);
