DSCSTRT  DS        0F                                                           
DSCANT   DS        A         @ of trt table                                     
DSCANA   DS        A         @ of area to scan                                  
DSCANL   DS        H         len of area                                        
DSCANCB  EQU       DSCSTRT,*-DSCSTRT                                            
