*                                                                               
* device dependant routines- seg control block                                  
*                                                                               
*DSEGCB  IDENT 2167                17:42:30 06/16/82 (RTS)                      
*                                                                               
         DS        0F                                                           
DSEGID   DS        C'DSEG'             identifier                               
DSEGBUFA DS        A                   address of the buffer                    
DSEGSCBA DS        A                   address of the SCB                       
DSEGFLAG FLAG      ,                   FLAGS                                    
         FLAG      DSEGFSC             save screen loc in vbuf workarea         
         FLAG      DSEGFCMD            command is being segged                  
         FLAG      DSEGF72             3272 KLUDGE                              
DSEGMXRU DS        H                   maximum ru size + header                 
DSEGCNT  DS        H                   count of data in buffer + header         
DSEGWAL  DS        H                   length to leave for work area            
         DS        5A                  reserved                                 
