*        FEBVSNA                   MILTEN FEB FOR VSNA MODULES                  
FEBSTRT  DS    0F                                                               
         COPY  FEB                                                              
*                                                                               
****  DEVICE DEPENDENT LINE FOR VSNA MODULES                                    
*                                                                               
*FEBVSNA IDENT 0269                17:01:25 09/26/90 (RTS)                      
*                                                                               
FEBVSTRT DS    0A                  START OF VSNA SECTION                        
FEBACB   DS    A                   PTR TO ACB                                   
FEBRPL   DS    A                   PTR TO RPL CHAIN                             
FEBISTAK DS    A                   REGISTER SAVE STACK FOR IRB ROUTINES         
FEBISTKL EQU   1024-16             LENGTH OF ABOVE STACK                        
FEBPP    DS    A                   PTR TO PIB PARAMETERS Q                      
FEBPSTRT DS    H                   CURRENT NO. OF PORTS STARTED                 
FEBRUSIZ DS    H                   MAX SIZE OF SEND RU                          
FEBRPLCT DS    H                   CURRENT NUMBER OF RPLS                       
FEBRPLMX DS    H                   NUMBER OF RPLS REQUESTED                     
         DS    H                   NOT USED                                     
FEBRMIN  DS    H                   MINIMUM NUMBER RECEIVE RPLS                  
FEBRCNT  DS    H                   COUNT OF RECEIVE RPLS                        
FEBRMAX  DS    H                   MAXIMUM NUMBER OF RECEIVE RPLS               
FEBSCNT  DS    H                   COUNT OF SEND RPLS                           
FEBSMAXS DS    H                   MAXIMUM NUMBER OF SEND RPLS                  
FEBLCNT  DS    H                   COUNT OF LOGON|LOGOFF RPLS                   
FEBLMAX  DS    H                   MAXIMUM NUMBER OF LOGON|LOGOFF RPLS          
*                                                                               
FEBVFLG1 FLAG  ,                   FLAGS                                        
         FLAG  FEBFREZE            -NOT OPERATIONAL - DO NOTHING                
         FLAG  FEBCACB             -CLOSE THE ACB                               
         FLAG  FEBWVTAM            -WAITING FOR VTAM                            
         FLAG  FEBWCLOS            -WAIT CLOSE ON DISCONNECT ALL                
         FLAG  FEBWABND            -WAIT ABEND CLOSE                            
         FLAG  FEBWZN              -WAIT Z NET ON KILL ALL                      
         FLAG  FEBWZNQ             -WAIT Z NET QUICK ON DISCONNECT ALL          
         FLAG  FEBWZNC             -WAIT Z NET CANCEL ON DISCONNECT ALL         
FEBVFLG2 FLAG  ,                   FLAGS                                        
         FLAG  FEBMM1              -NOT USED                                    
         FLAG  FEBLMCHG            -LOGON MODE CHANGING                         
         FLAG  FEBLMRST            -REQUEST LOGON MODE TO BE STARTED            
         FLAG  FEBLMST             -LOGON MODE STARTED (OFF = STOPPED)          
         FLAG  FEBDIAL             -DIAL CONNECTION                             
         FLAG  FEBDIR              -DIRECT CONNECTION LOGIC                     
         FLAG  FEBLOREQ            -A LOGON HAS BEEN REQUESTED                  
         FLAG  FEBNLPA             -NO LOGON PROCESSING ACTIVE                  
         DS    X                   NOT USED                                     
FEBQLOK  DS    X                   LOCK ON VLB QUEUES (TS)                      
*                                    USED TO SERIALIZE MODULE VSRR              
FEBLPIB  DS    A                   PTR TO PIB ACTIVE IN VTAM LOGON              
FEBTQE   DS    A                   PTR TO TQE FOR WAIT FOR VTAM                 
FEBFRPL  DS    A                   PTR TO FREE RPL CHAIN                        
FEBLEAK  DS    2F                  ALLOCATED VBUFS                              
FEBVBALO DS    F                   TOTAL ALLOCATED VBUFS                        
FEBVBALB DS    F                   TOTAL ALLOCATED VBUF (BYTES)                 
FEBVBFRE DS    F                   TOTAL FREED VBUFS                            
*                                  VLB QUEUE POINTERS                           
FEBPIOQ  DS    D                   POST I/O Q                                   
FEBSUDQ  DS    D                   SEND USER DATA Q                             
FEBSNDQ  DS    D                   SEND NON-DATA Q                              
FEBSRQ   DS    D                   SEND RESPONSE Q                              
FEBSEFQ  DS    D                   SEND EXPEDITED FLOW Q                        
FEBLOQ   DS    D                   LOGON PROCESSING Q                           
FEBCLSQ  DS    D                   CLSDST Q                                     
FEBFRZQ  DS    D                   FROZEN PORTS Q                               
FEBEND   EQU   *                   END OF FEB                                   
