         MACRO                                                                  
&L       MILPATH                                                                
.*  Added 3/88, Niz                                                             
*box                                                                            
*                                                                               
*    Milten Path control block.                                                 
*                                                                               
         DS    0F                                                               
         DC    CL4'PATH'                                                        
*                                                                               
&L.FLAG  FLAG                                                                   
         FLAG  &L.FOPENED          - Path has opened                            
         FLAG  &L.FHDR             - Multi-line format                          
         FLAG  &L.FSPR             - Partner is sys priv'd                      
         FLAG  &L.FOPR             - Partner is opr priv'd                      
*                                                                               
         DS    XL3                 Reserved                                     
*                                                                               
         PATH  VERSION=2,PFX=&L,FLAG=&L.SFLG,ECB=*-*,                  *        
               MYTAG=MYTAG,PASS=PROD,BUFSIZE=16384                              
*                                                                               
&L.SFLG  DC    X'00'               Suzan post flag                              
* Suzan needs to be able to access one word at "&L.SFLG", so                    
* just to be safe we always have a word of padding in our UPATH.                
         DC    F'-1'               Padding (must be present)                    
*                                                                               
&L.PASC  DC    F'0'                Partner's ASCB ptr                           
&L.PLNO  DC    H'0'                Partner's line number                        
&L.PJOB  DC    XL8'00'             Partner's jobname                            
&L.PACT  DC    XL8'00'             Partner's account                            
&L.PNAM  DC    XL20'00'            Partner's user name                          
*                                                                               
&L.RCP   DC    2A(0)               Error msg loc, len                           
         MEND                                                                   
