*box                                                                            
*                                                                               
*  Port Information Block                                                       
*                                                                               
         DS    CL4'PIB'                                                         
PIBNO    DS    H                   Port number                                  
         DS    H                   Reserved                                     
PIBFEBP  DS    A                   FEB ptr                                      
PIBSCBP  DS    A                   SCB ptr                                      
PIBDFSYS DS    CL8                 Default subsystem name (or zeros)            
*                                                                               
PIBGFLG  FLAG                                                                   
         FLAG  PIBFFIX             - PIB is in page-fixed core                  
*                                                                               
PIBTID   DS    CL8                 Pre-assigned terminal id                     
*                                                                               
PIBDFACT DS    XL5                 Default logon account (uuugg)                
*                                                                               
PIBTETYP DS    X                   SMF port type                                
         DS    XL3                 Reserved                                     
*                                                                               
         DS    F                   Reserved                                     
*                                                                               
         DS    0F                                                               
PIBUC    DS    H                   Update count                                 
         DS    XL2                 Reserved                                     
*                                                                               
PIBNAME  DS    CL8                 Port name                                    
PIBINFO  DS    CL20                Port information (NCC address)               
PIBLOC   DS    CL20                Port location                                
*                                                                               
PIBFLAG  FLAG                                                                   
         FLAG  PIBFDIAL            - Dial-up                                    
         FLAG  PIBFSUN             - SUNet                                      
         FLAG  PIBFDIR             - Direct                                     
         FLAG  PIBFGAND            - Gandalf                                    
         FLAG  PIBFDUMB            - Dumb front-end (ASYNC, etc.)               
*                                                                               
PIBFLAG2 FLAG                                                                   
         FLAG  PIBFLEAS            - Leased                                     
         FLAG  PIBFTEL             - Telenet                                    
         FLAG  PIBFTYM             - Tymnet                                     
         FLAG  PIBFRLIN            - Rlin                                       
*                                                                               
PIBFLAG3 FLAG                                                                   
         FLAG  PIBFPS              - Pseudo session                             
         FLAG  PIBFPTID            - Terminal id is pre-assigned                
         FLAG  PIBFOP              - Operator                                   
         FLAG  PIBFSEC             - Secure session                             
         FLAG  PIBFSESTRC          - Do session tracing                         
         FLAG  PIBFSESKEEP         - Keep session corpse around                 
*                                                                               
PIBFLAG4 FLAG                                                                   
         FLAG  PIBFSTOP            - Stopped                                    
         FLAG  PIBFDET             - Detached                                   
         FLAG  PIBFDUM             - Dummy                                      
*                                                                               
PIBFLAG5 FLAG                                                                   
         FLAG  PIBFDOWN            - Status: down                               
         FLAG  PIBFHU              - Status: hung-up                            
         FLAG  PIBFERR             - Status: serious error occurred             
*                                                                               
         DS    X                   Reserved                                     
PIBSIB   EQU   PIBNAME,*-PIBNAME,C'X'                                           
*                                                                               
PIBSCUR  DS    H                   Current no. of sessions                      
PIBSMAX  DS    H                   Max no. of sessions                          
PIBSMCLK DS    XL8                 Clock at max                                 
PIBNSES  DS    F                   Total no. of sessions                        
*                                                                               
PIBNIO   DS    F                   Total no. of I/O's                           
PIBNHWE  DS    F                   Total no. of hw errors                       
*                                                                               
PIBDEVD  DS    F                   Device dependent data                        
         DS    2F                  Reserved                                     
PIBBASIC EQU   PIBUC,*-PIBUC,C'X'  ******                                       
*                                                                               
PIBTRCP  DS    4A                  Trace ptrs: len,cur,first,end                
*                                                                               
         DS    0D                                                               
