*        SCBVSNA                   MILTEN SCB FOR VSNA MODULES                  
         COPY  SCB                                                              
*                                                                               
**** DEVICE DEPENDENT LINE FOR VSNA LOGICAL UNITS                               
*                                                                               
*SCBVSNA IDENT 0292                15:19:24 10/19/90 (RTS)                      
*                                                                               
DDRADDR  DS        A         ADDRESS OF DEVICE DEPEDANT MODULE                  
DDCLOC   DS        0F        CURRENT LOCATION OF CURSOR                         
DDCROW   DS        H         ROW OF CURSOR                                      
DDCCOL   DS        H         COLUMN OF CURSOR                                   
DDNROWSP DS        H         NUMBER OF ROWS ON DEVICE PRIMARY                   
DDNCOLSP DS        H         NUMBER OF COLUMNS PRIMARY                          
DDNROWSA DS        H         NUMBER OF ROWS ON DEVICE ALTERNATE SCREEN          
DDNCOLSA DS        H         NUMBER OF COLUMNS ALTERNATE SCREEN                 
DDSCBUC  DS        H         LAST UPDATE COUNT OF SCB                           
DDMXRU   DS        H         MAXIMUM RU SIZE TO DEVICE                          
DDLUF1   FLAG                                                                   
         FLAG      DDCHAIN   CAN CHAIN DATA TO THE SLU                          
         FLAG      DD3270    3270 DSC BEING PROCESSED                           
         FLAG      DD3272    3272 KLUDGE                                        
         FLAG      DDCOL     COLOR AUTHORIZED                                   
         FLAG      DDEA      EXTENDED ATTRIBUTES AUTHORIZED                     
         FLAG      DD14BIT   USE 14-BIT ADDRESSING                              
         FLAG      DDSOS     SHIFT OUT STATE                                    
DDACSID  DS        C         ID OF ALTERNATE CHARACTER SET SELECTED             
DDPSINF  DS        XL12      BYTES 14-25 OF BIND (PRES. SERVICES)               
         DS        0F                                                           
DDWORK   DS        XL(11*4)  WORK AREA FOR DEVICE MODULE                        
