TQE      RECORD BEGIN                                                           
         DS    CL4'TQE'                                                         
TQELINK  DS    A                   next tqe ptr (or zero)                       
TQEBACK  DS    A                   back tqe ptr                                 
TQECLCK  DS    XL8                 expiration tod clock                         
TQERTN   DS    A                   exit routine addr                            
TQEPARM  DS    A                   exit routine parm                            
         END                                                                    
