XLE      RECORD BEGIN                                                           
XLEIN    DS    0XL512              input translation                            
XLEINTR  DS    XL256               .input tr table                              
XLEINTRT DS    XL256               .input trt table                             
*                                                                               
XLEOUT   DS    0XL512              output translation                           
XLEOUTR  DS    XL256               .output tr table                             
XLEOUTRT DS    XL256               .output trt table                            
         END                                                                    
         SPACE 2                                                                
*  definition for bytes in the trt table:                                       
XLEFINV  EQU   1                   - invalid character                          
XLEFIGN  EQU   2                   - ignore character                           
