         MACRO                                                                  
&L       XPUSH &R1,&R2                                                          
         GBLB  &$OK                                                             
.*       Added so common Wylbur/Milten code can both use XPUSH/XPOP             
.*          1/91, Niz                                                           
&L       LABEL                                                                  
         AIF   ('&R2' EQ '').ONEREG                                             
         AIF   (N'&SYSLIST EQ 2).TWOREG                                         
         MNOTE 8,'Wrong number of args for MILTEN XPUSH'                        
         MEXIT                                                                  
.*                                                                              
.ONEREG $RGLKUP &R1                                                             
         AIF   (NOT &$OK).ERRR1                                                 
         PUSH  (&R1,&R1)                                                        
         MEXIT                                                                  
.*                                                                              
.TWOREG $RGLKUP &R1                                                             
         AIF   (NOT &$OK).ERRR1                                                 
        $RGLKUP &R2                                                             
         AIF   (NOT &$OK).ERRR2                                                 
         PUSH  (&R1,&R2)                                                        
         MEXIT                                                                  
.*                                                                              
.ERRR1   MNOTE 8,'&R1 must be a register for MILTEN XPUSH'                      
         MEXIT                                                                  
.*                                                                              
.ERRR2   MNOTE 8,'&R2 must be a register for MILTEN XPUSH'                      
.EXIT    MEND                                                                   
