ASBIOCB  RECORD BEGIN                                                           
AIOWAIT  LELEM PFX=AIOW                Waiting-for-I/O cell link                
AIOWAMT  DS    A                       | amount of resource requested           
AIOASB   DS    A                       ASB pointer                              
AIOLOCK  DS    A                       Lock for I/O ops                         
AIOECB   DS    A                       ECB for cell waits                       
*                                                                               
*  Pending I/Os for address space                                               
*                                                                               
AIOPEND  LHEAD PFX=AIOP                Pending I/Os                             
         END   ,                                                                
