*                                                                               
*  Hiperspace cache                                                             
*                                                                               
*        CABH -- Cache Buffer Entry                                             
*                                                                               
CABH     RECORD BEGIN                                                           
CABHBID  DS    C'CABH'             Self-identification                          
CABHBLKN DS    A                   ESO data block number                        
*                                                                               
CABHQUE  DS    0D                                                               
CABHQFP  DS    A                   Forw CABH ptr in hash queue                  
CABHQBP  DS    A                   Back CABH ptr in hash queue                  
*                                                                               
CABHAGE  DS    0D                                                               
CABHAFP  DS    A                   Forw CABH ptr in aging queue                 
CABHABP  DS    A                   Back CABH ptr in aging queue                 
*                                                                               
CABHKEY  DS    D                   64-bit key for this buffer                   
CABHHDR  DS    XL32                32-byte header                               
CABHTOD  DS    F                   Active since this time                       
CABHCHK  DS    F                   Check sum result                             
CABHNRDS DS    F                   No. cache reads for this buffer              
CABHNWRS DS    F                   No. cache writes for this buffer             
CABHCLR  EQU   CABHKEY,*-CABHKEY                                                
         END   ,                                                                
*                                                                               
*        CITH -- Cache Information Table                                        
*                                                                               
* Cache buffers are chained of a queue in one of 16 hash tables.                
* The hash table is determined by the last 4 bits of the hash key.              
* This helps prevent lock contention because there are 16 locks.                
* The number of queues per hash table is determined by the number               
* of blocks defined for the cache.                                              
*                                                                               
CITH     RECORD BEGIN                                                           
*                                                                               
CITHBID  DS    C'CITH'             Self-identification                          
         DS    F                   Spare                                        
CITHSIZE DS    A                   Length of this block                         
CITHTSIZ DS    A                   Above plus length of CABH area               
CITHASH  DS    H                   Some nice prime number                       
CITHFLAG FLAG  ,                                                                
         FLAG  CITHFCHK            Check sum option                             
         DS    X                   Spare                                        
         DS    F                   Spare                                        
CITHNBUF DS    F                   Number of cache buffers                      
         DS    F                   Spare                                        
*-                                                                              
*-       Statistics.                                                            
*-                                                                              
CITH#RD  DS    F                   Number of CAREAD calls                       
CITH#RDF DS    F                   Number of CAREADs found in cache             
CITH#RDS DS    F                   Number of stollen blocks                     
CITH#WR  DS    F                   Number of CAWRITE calls                      
CITH#RDT DS    D                   Total read IO time (found only)              
CITH#WRT DS    D                   Total write IO time                          
*                                                                               
CITHCTL  DS    0XL48               Control areas                                
CITHCBID DS    C'CIT0'             Eye catcher                                  
CITHGRES DS    A                   Reserve ID                                   
CITHIORB DS    A                   IORB address                                 
CITHAFP  DS    A                   Aging queue forward pointer                  
CITHABP  DS    A                   Aging queue backward pointer                 
CITHTOKN DS    F                   Hiperspace token                             
CITHESO  DS    XL24                ESO parm area                                
         DS    15XL(L'CITHCTL)     16 total                                     
*                                                                               
CITHQUE  DS    0D                  Hash queues                                  
CITHQFP  DS    A                   Forward pointer                              
CITHQBP  DS    A                   Backward pointer                             
         END                                                                    
