         MACRO                                                                  
         CHAIN  &PFX=             DEFINE LINKED LIST OFFSETS                    
         LCLC   &SIZ,&FFWD,&FBAC,&BFWD,&BBAC                                    
&SIZ     SETC   '&PFX.SIZ'                                                      
&FFWD    SETC   '&PFX.FFWD'                                                     
&FBAC    SETC   '&PFX.FBAC'                                                     
&BFWD    SETC   '&PFX.BFWD'                                                     
&BBAC    SETC   '&PFX.BBAC'                                                     
&SIZ     DS     F                 SIZE OF THIS BLOCK                            
&FFWD    DS     F                 FIRST FIT FORWARD POINTER                     
&FBAC    DS     F                 FIRST FIT BACKWARD POINTER                    
&BFWD    DS     F                 BEST FIT FORWARD POINTER                      
&BBAC    DS     F                 BEST FIT BACKWARD POINTER                     
         MEND                                                                   
