         PRINT OFF                     CHKPREC MACRO                            
         MACRO                                                                  
&L       CHKPREC &PTRS=                                                         
*PUSH,NOGEN                                                                     
&LB      SETC  'CHK&SYSNDX'                                                     
&LBP     SETC  'CHK'.'&PTRS'.'P'                                                
&LBA     SETC  'CHK'.'&PTRS'.'A'                                                
&LBB     SETC  'CHK'.'&PTRS'.'B'                                                
&LBN     SETC  'CHK'.'&PTRS'.'N'                                                
&LB      DS    0X                                                               
*PUSH,GEN                                                                       
&LBA     DS    A                       | Buffer address                         
&LBB     DS    AL(BL)                  | Block number                           
&LBN     DS    AL(OL)                  | Offset                                 
*POP                                                                            
         AIF   ('&L' EQ '').NOL                                                 
&L       EQU   &LB,*-&LB,C'R'                                                   
.NOL     ANOP                                                                   
&LBP     EQU   &LB,*-&LB,C'R'                                                   
*POP                                                                            
         MEND                                                                   
         PRINT ON                                                               
         SPACE ,                                                                
CHKDSTK  RECORD BEGIN                  STACK ENTRY DEFINITIONS                  
CHKSTBK  DS    AL(BL)                  BLOCK                                    
CHKSTNO  DS    AL(OL)                  NODE OFFSET                              
CHKSTEO  DS    AL(OL)                  ENTRY OFFSET                             
CHKSTFLG FLAG  ,                       STACK FLAGS                              
         FLAG  CHKSTFOLD               TRUE = This node is old                  
         DS    X                       ** AVAILABLE **                          
         END   ,                       OF STACK ENTRY DEFINITIONS               
         SPACE 2                                                                
CHKPNT   RECORD BEGIN                  CHECKPOINT CONTROL BLOCK                 
CCHKSTK  EQU   7                       STACK DEPTH OF 7                         
**                                                                              
CHKSTART DS    0X                      START OF CHECKPOINT BLOCK                
CHKTIME  DS    D                       TIME OF WRITE ("STCK")                   
CHKDWRT  DS    AL(BL)                  1ST DOUBLE WRITE BLOCK                   
CHKROOTB DS    AL(BL)                  ROOT LOCATION (BLOCK)                    
CHKROOTN DS    AL(OL)                  | (OFFSET)                               
CHKFBNO  DS    AL(BL)                  NUMBER OF FREE BLOCKS                    
CHKFREB  DS    AL(BL)                  FIRST FREE BLOCK ADDRESS                 
CHKNXDB  DS    AL(BL)                  NEXT AVAILABLE DATA BLOCK                
CHKANCH  EQU   CHKFREB,*-CHKFREB,C'R'  CHAIN ANCHORS                            
CHKCHAIN EQU   CHKFBNO,*-CHKFBNO,C'R'  CHAIN DATA                               
         DS    2A                                                               
*                                                                               
* CHECKPOINT SEARCH BLOCK                                                       
*                                                                               
CHKSFLG  DS    0X                      START OF FLAGS                           
CHKFLG   FLAG  ,                       REENTRANT FLAGS. 1/ATOMIC ACTION         
         FLAG  CHKFACC                 TRUE = Acc search; FALSE = File          
         FLAG  CHKFMOD                 TRUE = Intent to modify entry            
         FLAG  CHKFPER                 Search for permits                       
         FLAG  CHKFINS                 Insert in progress                       
         FLAG  CHKFDEL                 Delete in progress                       
         FLAG  CHKFLEAF                Leaf is being operated on                
         FLAG  CHKFLFTU                Left sibling needs updating              
         FLAG  CHKFRHTU                Right sibling needs updating             
CHKFLG2  FLAG  ,                                                                
         FLAG  CHKFBAL                 Need to balance (NODBAL)                 
         FLAG  CHKF3BAL                Min 3 nodes in balance (NODBAL)          
         FLAG  CHKFDSRC                Delete source of move (NODBAL)           
         FLAG  CHKFDLXT                Del extended data area (NTRYCHG)         
         FLAG  CHKFINXT                Ins extended data area (NTRYCHG)         
         FLAG  CHKFXTAV                Ext data block avail (NTRYCHG)           
         FLAG  CHKFNBLK                New block on traverse                    
CHKFLGS  EQU   CHKSFLG,*-CHKSFLG,C'R'                                           
         DS    AL2                     ** AVAILABLE **                          
CHKPT    DS    0X                      SEARCH POINTERS                          
         CHKPREC PTRS=PAR              Parent pointers                          
         CHKPREC PTRS=LFT              Left sibling pointers                    
         CHKPREC PTRS=CUR              Current sibling pointers                 
         CHKPREC PTRS=RHT              Right sibling pointers                   
CHKSPNT  EQU   CHKPT,*-CHKPT,C'R'      LEN OF SEARCH POINTERS                   
         CHKPREC PTRS=NT               Entry pointers                           
         CHKPREC PTRS=WRK              Work pointers                            
         CHKPREC PTRS=2WR              2nd work pointers                        
         CHKPREC PTRS=ACC              Account entry pointers                   
         CHKPREC PTRS=BAL              Balance-Causing pointers                 
         CHKPREC PTRS=SEQ              Sequential Access pointers               
         CHKPREC PTRS=SEQE             Sequential Access Extended ptrs          
CHKAPNT  EQU   CHKPT,*-CHKPT,C'R'      LENGTH OF POINTERS                       
CHKCHKA  DS    A                       POINTER TO RECOVERY CHECKPOINT           
CHKBSAD  DS    A                       BALANCE WORK AREA - SOURCE ADDR          
CHKBDAD  DS    A                       | DESTINATION ADDR                       
CHKBLAD  DS    A                       | LEFT ADDR                              
CHKBCAD  DS    A                       | CURRENT ADDR                           
CHKBRAD  DS    A                       | RIGHT ADDR                             
CHKBLPA  DS    A                       | LEFT PARENT ADDR                       
CHKBRPA  DS    A                       | RIGHT PARENT ADDR                      
CHKBNPA  DS    A                       | NEW PARENT ADDR                        
CHKBSLN  DS    Y                       | SOURCE LEN                             
CHKBSN   DS    Y                       | SOURCE NUMBER OF ENTRYS                
CHKBDLN  DS    Y                       | DESTINATION LEFT LEN                   
CHKBLLN  DS    Y                       | LEFT LEN                               
CHKBCLN  DS    Y                       | CURRENT LEN                            
CHKBRLN  DS    Y                       | RIGHT LEN                              
CHKBLPL  DS    Y                       | LEFT PARENT LEN                        
CHKBRPL  DS    Y                       | RIGHT PARENT LEN                       
CHKBNPL  DS    Y                       | NEW PARENT LEN                         
CHKSPAC  DS    Y                       | SPACE IN BALANCE                       
CHKNODN  DS    Y                       | NUM OF NODES IN BALANCE                
         DS    4A                                                               
CHKFNMSZ DS    X                       NAME LEN                                 
CHKFNAME DS    CL(CFSBNDOT)            ACTUAL NAME (NO DOTS)                    
         DS    0SL2(CHKFNAME-CHKFNMSZ-1,CHKFNMSZ-(CHKFNAME-1))                  
CHKFRNMS DS    X                       RENAME LEN                               
CHKFRNAM DS    CL(CFSBNDOT)            ACTUAL RENAME (NO DOTS)                  
         DS    0SL2(CHKFRNAM-CHKFRNMS-1,CHKFRNMS-(CHKFRNAM-1))                  
CHKFIX   DS    0X                                                               
*                                                                               
* VARIABLE INTENTIONS INDICATORS                                                
*                                                                               
CHKISTRT DS    0H                      START OF INTENTIONS BLOCK                
CHKITYPE DS    X                       Type of transaction taking place         
CHKIFLG  DS    X                       FLAG                                     
CHKIFBNO DS    AL(BL)                  Old_Free_Block_Num                       
CHKIFREB DS    AL(BL)                  Old_Free_Block                           
CHKINXDB DS    AL(BL)                  Old_Next_Leaf_Block                      
CHKICHAN EQU   CHKIFBNO,*-CHKIFBNO,C'R'         Old_Chain_Data                  
CHKIVAR  DS    0X                      START OF VAR INTENTIONS FIELD            
*                                                                               
* Insert Tree Root                                                              
         ORG   CHKIVAR                                                          
CCHKRTIN EQU   4                       TRANSACTION TYPE (Insert root)           
* Entrys are the same as Entry Insert                                           
*                                                                               
* Delete Tree Root                                                              
         ORG   CHKIVAR                                                          
CCHKRTDL EQU   8                       TRANSACTION TYPE (Delete root)           
* Entrys are the same as Entry Delete                                           
*                                                                               
* Split Root Node                                                               
         ORG   CHKIVAR                                                          
CCHKRTSP EQU   12                      TRANSACTION TYPE (Split root)            
CHKIRSPB DS    AL(BL)                  Root_Split-Parent_Block                  
CHKIRSPN DS    AL(OL)                  Root_Split-Parent_Node_Offset            
CHKIRSLB DS    AL(BL)                  Root_Split-Left_Block                    
CHKIRSLN DS    AL(OL)                  Root_Split-Left_Node_Offset              
CHKIRSCB DS    AL(BL)                  Root_Split-Cur_Block                     
CHKIRSCN DS    AL(OL)                  Root_Split-Cur_Node_Offset               
*                                                                               
* Collapse Root Node                                                            
         ORG   CHKIVAR                                                          
CCHKRTCL EQU   16                      TRANSACTION TYPE (Collapse root)         
CHKIRCPB DS    AL(BL)                  Root_Collapse-Parent_Block               
CHKIRCPN DS    AL(OL)                  Root_Collapse-Parent_Node_Offset         
CHKIRCLB DS    AL(BL)                  Root_Collapse-Left_Block                 
CHKIRCLN DS    AL(OL)                  Root_Collapse-Left_Node_Offset           
CHKIRCCB DS    AL(BL)                  Root_Collapse-Cur_Block                  
CHKIRCCN DS    AL(OL)                  Root_Collapse-Cur_Node_Offset            
*                                                                               
* Balance nodes (No Insert or Delete)                                           
         ORG   CHKIVAR                                                          
CCHKNBAL EQU   20                      TRANSACTION TYPE (Balance nodes)         
CHKINBPB DS    AL(BL)                  Node_Balance-Parent_Block                
CHKINBPN DS    AL(OL)                  Node_Balance-Parent_Node_Offset          
CHKINBPC DS    XL(4-BL)                Node_Balance-Parent_Clock_Tag            
CHKINBLB DS    AL(BL)                  Node_Balance-Left_Block                  
CHKINBLN DS    AL(OL)                  Node_Balance-Left_Node_Offset            
CHKINBCB DS    AL(BL)                  Node_Balance-Current_Block               
CHKINBCN DS    AL(OL)                  Node_Balance-Current_Node_Offset         
CHKINBRB DS    AL(BL)                  Node_Balance-Right_Block                 
CHKINBRN DS    AL(OL)                  Node_Balance-Right_Node_Offset           
*                                                                               
* Balance nodes (With Insert)                                                   
         ORG   CHKIVAR                                                          
CCHKBINS EQU   24                      TRANSACTION TYPE (Balance - ins)         
CHKIBIPB DS    AL(BL)                  Balance_Insert-Parent_Block              
CHKIBIPN DS    AL(OL)                  Balance_Ins-Parent_Node_Offset           
CHKIBIPC DS    XL(4-BL)                Balance_Insert-Parent_Clock_Tag          
CHKIBILB DS    AL(BL)                  Balance_Insert-Left_Block                
CHKIBILN DS    AL(OL)                  Balance_Insert-Left_Node_Offset          
CHKIBICB DS    AL(BL)                  Balance_Insert-Current_Block             
CHKIBICN DS    AL(OL)                  Balance_Ins-Current_Node_Offset          
CHKIBIRB DS    AL(BL)                  Balance_Insert-Right_Block               
CHKIBIRN DS    AL(OL)                  Balance_Insert-Right_Node_Offset         
CHKIBIRC DS    XL(4-BL)                Balance_Ins-Right_Clock_Tag              
*                                                                               
* Balance nodes (With Delete)                                                   
         ORG   CHKIVAR                                                          
CCHKBDEL EQU   28                      TRANSACTION TYPE (Balance - del)         
CHKIBDPB DS    AL(BL)                  Balance_Delete-Parent_Block              
CHKIBDPN DS    AL(OL)                  Balance_Del-Parent_Node_Offset           
CHKIBDPC DS    XL(4-BL)                Balance_Delete-Parent_Clock_Tag          
CHKIBDLB DS    AL(BL)                  Balance_Delete-Left_Block                
CHKIBDLN DS    AL(OL)                  Balance_Delete-Left_Node_Offset          
CHKIBDCB DS    AL(BL)                  Balance_Delete-Current_Block             
CHKIBDCN DS    AL(OL)                  Balance_Del-Current_Node_Offset          
CHKIBDOB DS    AL(BL)                  Balance_Delete-Old(Del)_Block            
CHKIBDON DS    AL(OL)                  Balance_Del-Old(Del)_Node_Offset         
CHKIBDOC DS    XL(4-BL)                Balance_Delete-Old_Clock_Tag             
*                                                                               
* Modify Entry                                                                  
*   Current, Old, and New fields should be the same for Mod, Ins, and           
* Del entry                                                                     
         ORG   CHKIVAR                                                          
CCHKNTRY EQU   32                      TRANSACTION TYPE (Entry Mods)            
CHKINTCB DS    AL(BL)                  Entry-Current_Block                      
CHKINTCN DS    AL(OL)                  Entry-Current_Node_Offset                
CHKINTCT DS    AL(OL)                  Entry-Current_enTry_Offset               
CHKINTCL DS    AL(BL)                  Entry-Current_Link                       
CHKINTCC DS    XL(4-BL)                Entry-Current_Clock_Tag                  
CHKINTOB DS    AL(BL)                  Entry-Old_Data_Block                     
CHKINTON DS    AL(OL)                  Entry-Old_Data_Offset                    
CHKINTOL DS    AL(BL)                  Entry-Old_Data_Block_Link                
CHKINTOC DS    XL(4-BL)                Entry-Old_Data_Clock_Tag                 
CHKINTOF DS    X                       Entry-Old_Data_Block_Flags               
         DS    X                                                                
CHKINTNB DS    AL(BL)                  Entry-New_Data_Block                     
CHKINTNN DS    AL(OL)                  Entry-New_Data_Offset                    
CHKINTNL DS    AL(BL)                  Entry-New_Data_Block_Link                
CHKINTNC DS    XL(4-BL)                Entry-New_Data_Clock_Tag                 
CHKINTNF DS    X                       Entry-New_Data_Block_Flags               
*                                                                               
* Insert Entry                                                                  
*   Current, Old, and New fields should be the same for Mod, Ins, and           
* Del entry                                                                     
         ORG   CHKIVAR                                                          
CCHKNTIN EQU   36                      TRANSACTION TYPE (Insert Entry)          
CHKINICB DS    AL(BL)                  Entry_Insert-Current_Block               
CHKINICN DS    AL(OL)                  Entry_Ins-Current_Node_Offset            
CHKINICT DS    AL(OL)                  Entry_Ins-Current_enTry_Offset           
CHKINICL DS    AL(BL)                  Entry_Insert-Current_Link                
CHKINICC DS    XL(4-BL)                Entry_Insert-Cur_Clock_Tag               
CHKINIOB DS    AL(BL)                  Entry_Insert-Old_Data_Block              
CHKINION DS    AL(OL)                  Entry_Insert-Old_Data_Offset             
CHKINIOL DS    AL(BL)                  Entry_Insert-Old_Data_Block_Link         
CHKINIOC DS    XL(4-BL)                Entry_Insert-Old_Data_Clock_Tag          
CHKINIOF DS    X                       Entry_Ins-Old_Data_Block_Flags           
         DS    X                                                                
CHKININB DS    AL(BL)                  Entry_Insert-New_Data_Block              
CHKININN DS    AL(OL)                  Entry_Insert-New_Data_Offset             
CHKININL DS    AL(BL)                  Entry_Insert-New_Data_Block_Link         
CHKININC DS    XL(4-BL)                Entry_Insert-New_Data_Clock_Tag          
CHKININF DS    X                       Entry_Ins-New_Data_Block_Flags           
         DS    X                                                                
CHKINIAB DS    AL(BL)                  Entry_Ins-Acc_Entry_Blk (Files)          
CHKINIAN DS    AL(OL)                  Entry_Ins-Acc_Entry_Node_Offset|         
CHKINIAC DS    XL(4-BL)                Entry_Ins-Acc_Entry_Clock_Tag            
*                                                                               
* Delete Entry                                                                  
*   Current, Old, and New fields should be the same for Mod, Ins, and           
* Del entry                                                                     
         ORG   CHKIVAR                                                          
CCHKNTDL EQU   40                      TRANSACTION TYPE (Delete Entry)          
CHKINDCB DS    AL(BL)                  Entry_Delete-Current_Block               
CHKINDCN DS    AL(OL)                  Entry_Delete-Current_Node_Offset         
CHKINDCT DS    AL(OL)                  Entry_Del-Current_enTry_Offset           
CHKINDCL DS    AL(BL)                  Entry_Delete-Current_Link                
CHKINDCC DS    XL(4-BL)                Entry_Delete-Current_Clock_Tag           
CHKINDOB DS    AL(BL)                  Entry_Delete-Old_Data_Block              
CHKINDON DS    AL(OL)                  Entry_Delete-Old_Data_Offset             
CHKINDOL DS    AL(BL)                  Entry_Del-Old_Data_Block_Link            
CHKINDOC DS    XL(4-BL)                Entry_Delete-Old_Data_Clock_Tag          
CHKINDOF DS    X                       Entry_Del-Old_Data_Block_Flags           
         DS    X                                                                
CHKINDNB DS    AL(BL)                  Entry_Delete-New_Data_Block              
CHKINDNN DS    AL(OL)                  Entry_Delete-New_Data_Offset             
CHKINDNL DS    AL(BL)                  Entry_Del-New_Data_Block_Link            
CHKINDNC DS    XL(4-BL)                Entry_Delete-New_Data_Clock_Tag          
CHKINDNF DS    X                       Entry_Del-New_Data_Block_Flags           
         DS    X                                                                
CHKINDAB DS    AL(BL)                  Entry_Del-Account_Entry_Block            
CHKINDAN DS    AL(OL)                  Entry_Del-Account_Entry__Offset          
CHKINDAC DS    XL(4-BL)                Entry_Delete-Account_Clock_Tag           
CHKIND2B DS    AL(BL)                  Entry_Del-2nd_Entry_Block (Leaf)         
CHKIND2N DS    AL(OL)                  Entry_Del-2nd_Entry_Node_Offset          
CHKIND2C DS    XL(4-BL)                Entry_Del-2nd_Entry_Clock_Tag            
**                                                                              
         ORG   ,                                                                
         DS    4A                                                               
CHKIV1LN EQU   CHKIVAR,*-CHKIVAR,C'N'                                           
CHKIVLV1 EQU   CHKISTRT,*-CHKISTRT,C'R'         1ST VAR INTENTIONS BLK          
         SPACE 2                                                                
CHKI2ST  DS    0X                      START OF 2ND LEVEL OF INTENTIONS         
CHKI2TYP DS    X                       Type of transaction taking place         
CHKI2FLG DS    X                       FLAG                                     
CHKI2VAR DS    0X                                                               
*                                                                               
* Balance leaves after non-leaf delete                                          
CCHKDBAL EQU   4                       TRANSACTION TYPE (Bal after del)         
CHKIDBAB DS    AL(BL)                  Delete_Balance-Account_Block             
CHKIDBAN DS    AL(OL)                  Delete_Balance-Account_Offset            
CHKIDBAS DS    H                       Del_Balance-Acc_Stack_Pointer            
CHKIDBSZ DS    X                       Delete_Balance-Entry_Name_Size           
CHKIDBNM DS    CL(CFSBNDOT)            Delete_Balance-Entry_Name                
         DS    4A                                                               
CHKIV2LN EQU   CHKI2VAR,*-CHKI2VAR,C'N'                                         
CHKIVLV2 EQU   CHKISTRT,*-CHKISTRT,C'R'         2ND VAR INTENTIONS BLK          
         SPACE 2                                                                
CHKI3ST  DS    0X                      START OF 3rd LEVEL OF INTENTIONS         
CHKI3TYP DS    X                       Type of transaction taking place         
CHKI3FLG DS    X                       FLAG                                     
CHKI3VAR DS    0X                                                               
*                                                                               
* Rename entry                                                                  
CCHKREN  EQU   4                       TRANSACTION TYPE (Rename entry)          
CCHKBREN EQU   8                       | (Backup Rename - NMR)                  
CHKIERAB DS    AL(BL)                  Entry_Rename-Account_Block               
CHKIERAN DS    AL(OL)                  Entry_Rename-Account_Offset              
CHKIERAS DS    H                       Entry_Rename-Acc_Stack_Pointer           
CHKIERCB DS    AL(BL)                  Entry_Rename-Cur_Block                   
CHKIERCN DS    AL(OL)                  Entry_Rename-Cur_Node_Offset             
CHKIERCT DS    AL(OL)                  Entry_Rename-Cur_enTry_Offset            
CHKIERFL FLAG  ,                       Entry_Rename-Flag                        
         FLAG  RENLEAF                 Entry_Rename-Flag-Leaf_Rename            
         FLAG  RENRTDL                 Entry_Rename-Flag-Root_Delete            
CHKIEROS DS    X                       Entry_Rename-Old_entry_Name_Size         
CHKIERON DS    CL(CFSBNDOT)            Entry_Rename-Old_entry_Name              
         DS    0SL2(CHKIERON-CHKIEROS-1,CHKIEROS-(CHKIERON-1))                  
CHKIERNS DS    X                       Entry_Rename-New_entry_Name_Size         
CHKIERNN DS    CL(CFSBNDOT)            Entry_Rename-New_entry_Name              
         DS    0SL2(CHKIERNN-CHKIERNS-1,CHKIERNS-(CHKIERNN-1))                  
         DS    4A                                                               
CHKIV3LN EQU   CHKI3VAR,*-CHKI3VAR,C'N'                                         
CHKIVLV3 EQU   CHKISTRT,*-CHKISTRT,C'R'         3rd VAR INTENTIONS BLK          
         DS    0F                                                               
CHKINTRY DS    512X                    Space for largest ntry (fil/acc)         
         DS                            0F                                       
CHKIRNT  DS    512X                    |                                        
         DS    0SL2(512-CFSBMXNT)                                               
*                                                                               
*        Tree traversal stack                                                   
*                                                                               
CHKACSP  DS    H                       CUR ACCOUNT STACK POINTER                
CHKSTKP  DS    H                       STACK POINTER                            
&CHKDST  SETA  L'CHKDSTK               | ROOM FOR 'CCHKSTK' ENTRYS              
CHKSTAK  DS    (CCHKSTK)XL(&CHKDST)    |                                        
         END   ,                       OF CHECKPOINT RECORD                     
