@DTB     RECORD BEGIN                  Decimal to binary conversion             
@DTBLOC  DS    A                       String location                          
@DTBLEN  DS    A                       String length                            
@DTBMXLN EQU   10,10,C'N'              10 digits (not including sign)           
@DTBFLG  FLAG  ,                                                                
         FLAG  @DTBVALID               Is string valid?                         
         DS    0SL2(@DTBLOC+4-@DTBLEN,@DTBLEN-@DTBLOC+4)                        
         END   ,                                                                
         SPACE ,                                                                
@XTB     RECORD BEGIN                  Hex to binary conversion                 
@XTBLOC  DS    A                       Location of string                       
@XTBLEN  DS    A                       Length of string                         
@XTBMXLN EQU   8,8,C'N'                                                         
@XTBFLG  FLAG  ,                                                                
         FLAG  @XTBVALID               Valid string specified                   
         DS    0SL2(@XTBLOC+4-@XTBLEN,@XTBLEN-@XTBLOC+4)                        
         END   ,                                                                
         SPACE ,                                                                
@STB     RECORD BEGIN                  Scaled to binary conversion              
@STBLOC  DS    A                       String location                          
@STBLEN  DS    A                       | and length                             
@STBMXLN EQU   10+1,10+1,C'N'          10 digits, 1 point                       
*                                      (not including sign)                     
@STBSCAL DS    A                       Scale factor                             
@STBFLG  FLAG  ,                                                                
         FLAG  @STBVALID               Is string valid?                         
         DS    0SL2(@STBLOC+4-@STBLEN,@STBLEN-@STBLOC+4)                        
         END   ,                                                                
         SPACE ,                                                                
@BTD     RECORD BEGIN                  Binary to decimal conversion             
@BTDVAL  DS    F                       32 bit integer value                     
@BTDLOC  DS    A                       Result location                          
@BTDLEN  DS    A                       Result length                            
@BTDFLG  FLAG  ,                                                                
         FLAG  @BTDCOMM                Commas?                                  
         FLAG  @BTDUNSI                Unsigned conversion?                     
         DS    0SL2(@BTDLOC+4-@BTDLEN,@BTDLEN-@BTDLOC+4)                        
         END   ,                                                                
         SPACE ,                                                                
@BTX     RECORD BEGIN                  Binary to hex converson                  
@BTXVAL  DS    A                       Value to be converted                    
@BTXLOC  DS    A                       Return area                              
@BTXLEN  DS    A      Maximum length of result    (Positive)                    
*                     Number of leading blanks    (Negative)                    
*                     Return actual string length (Zero)                        
         DS    0SL2(@BTXLOC+4-@BTXLEN,@BTXLEN-@BTXLOC+4)                        
         END   ,                                                                
         SPACE ,                                                                
@BTS     RECORD BEGIN                  Binary to scaled conversion              
@BTSLOC  DS    A                       Output loc                               
@BTSLEN  DS    A                       Output length                            
@BTSVAL  DS    A                       Scaled integer to convert                
@BTSSCAL DS    A                       Scale factor (# of dec digits)           
         DS    0SL2(@BTSLOC+4-@BTSLEN,@BTSLEN-@BTSLOC+4)                        
         END   ,                                                                
