*box                                                                            
*                                                                               
*        Global File System Information                                         
*                                                                               
FILECB   RECORD BEGIN                                                           
FILEID   DC    CL8'FILECB'         Self identification                          
*                                                                               
FILEFFSB DS    A                   First FSB pointer                            
FILEFSBC DS    A                   Number of FSBs                               
FILEFSGT DS    A                   Pointer to file sys group tbl                
*                                                                               
*  Buffer management                                                            
*                                                                               
FILBFLAG FLAG  ,                   Buffer flag                                  
         FLAG  FILBFHCA            Hiperspace cache                             
         FLAG  FILBNOTD            Don't dump cache blocks                      
         DS    XL3                 Spare                                        
FILE2KCH DS    A                   File cache control block (user)              
FILE2KCS DS    A                   File cache control block (system)            
FILE4KCH DS    A                   File cache control block (user)              
FILE4KCS DS    A                   File cache control block (system)            
*                                                                               
FILE2KRB DS    A                   Read buffer control block                    
FILE4KRB DS    A                   Read buffer control block                    
FILEIOP  DS    A                   File IO parm buffers                         
*                                                                               
FILTEMPF DS    A                   Temp files FSB                               
*                                                                               
FILEBW   SHEAD ,                   Free wait blocks for buff mngmt              
FILEATFB SHEAD ,                   Free file attached blocks                    
*                                                                               
*  Statistics                                                                   
*                                                                               
FILMTIME DS    D                   Elapsed time for SMF                         
*                                                                               
* Note: don't modify the following counters in any way unless                   
*       FSB and the routine FDOIODO are also modified.                          
*                                                                               
*  File read counts from disk                                                   
*                                                                               
TTREADCT DS    0D                                                               
TTMASRCT DS    D                   Master - read counts                         
TTCATRCT DS    D                   Catalog - read counts                        
TTBITRCT DS    D                   Bitmap - read counts                         
TTIXRRCT DS    D                   IXR - read counts                            
TTUSERCT DS    D                   User  - read counts                          
TTOTHRCT DS    D                   Other?? - read counts                        
*                                                                               
* Counter indexes - All counters are referenced with the                        
* generic label and using one of the following indexes.                         
*                                                                               
TTMASD   EQU   TTMASRCT-TTREADCT                                                
TTCATD   EQU   TTCATRCT-TTREADCT                                                
TTBITD   EQU   TTBITRCT-TTREADCT                                                
TTIXRD   EQU   TTIXRRCT-TTREADCT                                                
TTUSED   EQU   TTUSERCT-TTREADCT                                                
TTOTHD   EQU   TTOTHRCT-TTREADCT                                                
*                                                                               
*  File write counts                                                            
*                                                                               
TTWRITCT DS    0D                                                               
TTMASWCT DS    D                   Master - writes                              
TTCATWCT DS    D                   Catalog - writes                             
TTBITWCT DS    D                   Bitmap -  writes                             
TTIXRWCT DS    D                   IXR - writes                                 
TTUSEWCT DS    D                   User -  writes                               
TTOTHWCT DS    D                   Other?? - writes                             
*                                                                               
*  File read counts from cache                                                  
*                                                                               
TTCACHCT DS    0D                                                               
TTMASCCT DS    D                   Master - read counts                         
TTCATCCT DS    D                   Catalog - read counts                        
TTBITCCT DS    D                   Bitmap - read counts                         
TTIXRCCT DS    D                   IXR - read counts                            
TTUSECCT DS    D                   User  - read counts                          
TTOTHCCT DS    D                   Other?? - read counts                        
TTFILECT EQU   TTREADCT,*-TTREADCT                                              
TTFILECC EQU   (*-TTREADCT)/L'TTREADCT                                          
*                                                                               
TTFREAD  EQU   TTREADCT-TTFILECT                                                
TTFWRIT  EQU   TTWRITCT-TTFILECT                                                
TTFCACH  EQU   TTCACHCT-TTFILECT                                                
*                                                                               
*  Attach statistics                                                            
*                                                                               
TTFILATT DS    F                   Number of files attached                     
TTFILATM DS    F                   | max number attached                        
TTFILAUS DS    F                   Number of user attaches                      
TTFILAUM DS    F                   | max number of user attaches                
TTFILATP DS    F                   Number of temp files attached                
TTFILAPM DS    F                   | max number of temp files attached          
TTFILTBK DS    F                   Number of temp blocks in use                 
TTFILTBM DS    F                   | max number of temp blocks in use           
*                                                                               
* Delete file processing control area                                           
*                                                                               
FILEDECB DS    D                   Wait for work ECB                            
FILEDB   SHEAD ,                   Free file delete blocks                      
FILEDT   SHEAD ,                   List of temp files to delete                 
FILEDF   SHEAD ,                   List of files to delete                      
FILEDASB DS    A                   Delete file processing ASB                   
FILEDSYR DS    A                   Sys routine id                               
FILEDCNT DS    A                   Count of active tasks                        
FILEDCN2 DS    H                   Count of 'throttle' waits                    
FILEDTS  DS    X                   Test and set lock                            
         DS    X                   Spare                                        
FILECRE  DS    A                   Files created                                
         DS    9A                  Spare                                        
         END                                                                    
