FILEDSD  RECORD BEGIN                  Dataset descriptor                       
DSDNXT   DS    A                       Next dataset descriptor                  
DSDCHID  DS    A                       Channel ID - host                        
DSDSTART DS    A                       Starting block of this DS                
DSDCNT   DS    A                       Number of blocks                         
DSDTIME  DS    D                       Time of file I/Os                        
DSDICNT  DS    A                       Number of file I/Os                      
DSDLEN   DS    H                       Block length                             
DSDHDR   DS    H                       Header length                            
DSDDSN   DS    CL44                    Dataset name                             
         END   ,                                                                
