FILIOP   RECORD BEGIN                                                           
FILPARM  DS    XL(L'#FIODO)        Host parameters                              
FILHDR   DS    XL32                Block header of max len                      
FILIST   DS    0D                  Address/len list                             
FILISTA1 DS    A                                                                
FILISTL1 DS    F                                                                
FILISTA2 DS    A                                                                
FILISTL2 DS    F                                                                
         END   ,                                                                
