FSB      RECORD BEGIN                                                           
CCAT0PCT EQU   10                      % OF FREE BLOCKS FOR WARNING             
CCAT0MIN EQU   60                      MIN FREE BEFORE WARNING                  
CCAT1PCT EQU   5                       % OF MIN LOGICAL FREE BLOCKS             
CCAT1MIN EQU   60                      MIN FREE LOGICAL BLOCK NUM               
CCAT2PCT EQU   1                       % OF MIN FREE BLOCKS                     
CCAT2MIN EQU   10                      MIN FREE BLOCK NUM                       
*                                                                               
CNODA99  EQU   72,72,C'N'              99th percentile                          
CNODF99  EQU   65,65,C'N'              Non permit len, no per, max name         
*                                                                               
CFSBFLSZ EQU   40                      MAX FIL NAME LEN(DOTS, ^"ORV.")          
CFSBNDOT EQU   38                      MAX FIL NAME LEN(^DOTS, ^"ORV.")         
CFSBNMSZ EQU   33                      MAX NAME LEN TO SEARCH                   
CFSBDBLK EQU   3                       3 DOUBLE WRITE BLOCKS                    
CFSBSTK  EQU   7                       STACK DEPTH OF 7                         
CFSBMXNT EQU   256+41                  MAX ENTRY LENGTH                         
OBLKPL   EQU   3,3,C'N'                ORVYL FILE BLOCK POINTER LEN             
BL       EQU   2,2,C'N'                BLOCK POINTER LEN                        
OL       EQU   2,2,C'N'                OFFSET POINTER LEN                       
PL       EQU   BL+OL,BL+OL,C'N'        TOTAL POINTER LEN                        
         GBLA  &BL,&L                                                           
&BL      SETA  L'BL                                                             
&L       SETA  L'PL                    TOTAL POINTER LENGTH                     
*                                                                               
*  FILE SYSTEM BLOCK                                                            
*                                                                               
FSBBID   DC    CL4'FSB'                BLOCK ID                                 
*                                                                               
FSBCHAIN DS    A                       NEXT FSB ON CHAIN                        
*                                                                               
FSBID    DS    X                       FILE-SYSTEM ID NUMBER                    
*                                                                               
FSBAFLGS FLAG  ,                       FILE-SYSTEM AVAILABILITY                 
         FLAG  FSBANAVL                NOT AVAILABLE                            
         FLAG  FSBARO                  READ-ONLY STATUS                         
         FLAG  FSBINIT                 INITIALIZATION PROCESS                   
         FLAG  FSBCLOSE                SHUTDOWN PROCESS                         
         FLAG  FSBCATNIN               CATALOG IN NoInsert MODE                 
         FLAG  FSBCATNLM               CATALOG IN NoLenMod MODE                 
*                                                                               
FSBSFLGS FLAG  ,                       FILE-SYSTEM STATUS                       
         FLAG  FSBSPROD                PRODUCTION FILE SYSTEM                   
         FLAG  FSBSABRO                ALLOW BATCH THOUGH R/O                   
         FLAG  FSBSTEMP                DEDICATED TO TEMP FILES                  
*                                                                               
FSBOFLGS FLAG  ,                       FILE-SYSTEM OPTIONS                      
         FLAG  FSBONIXR                NON-IXR FILES ALLOWED                    
         FLAG  FSBFCACHE               Use file block caching                   
         FLAG  FSBHCACHE               Use hiperspace caching                   
*                                                                               
FSBFRDB  DS    A                       FIRST RDB FOR FILE-SYSTEM                
FSBLRDB  DS    A                       LAST RDB FOR FILE-SYSTEM                 
FSBDDN   DS    CL4                     DDNAME                                   
FSBNAME  DS    CL8                     FILE-SYSTEM NAME                         
FSBOWNER DC    CL6'GG.UUU'             FILE-SYSTEM MASTER ACCOUNT               
*                                                                               
         DS    XL2                     Spare                                    
*                                                                               
FSBCGRI  DS    A                       Catalog general resource id              
FSBRBT   DS    A                       Read Buffer Table Pointer                
FSBCACHE DS    A                       Cache table pointer                      
FSBCACHS DS    A                       System cache table pointer               
         DS    A                       Spare                                    
FSBAHFB  DS    A                       File attached hash table                 
FSBIOP   DS    A                       File IO parm buffers                     
*                                                                               
*  CATALOG MANAGEMENT AREA                                                      
*                                                                               
FSBCATSB DS    A                       CATALOGUE START BLOCK                    
FSBCATBC DS    A                       CATALOGUE BLOCK COUNT                    
*SBBMALO DS    A   ** MOVE TO STATS ** ALLOCATION REQUESTS                      
*SBBMALS DS    A   ** MOVE TO STATS ** ALLOCATION NOT CACHED                    
*SBBMFRE DS    A   ** MOVE TO STATS ** BITMAP RELEASES                          
*SBBMFRS DS    A   ** MOVE TO STATS ** BITMAP RELEASES - TO SYS                 
         DS    4A                      Available                                
CFSBBL   EQU   4                       FSB BLOCK PTR LEN                        
CFSBPL   EQU   8,8,C'N'                FSB POINTER LEN (BLOCK + ADDR)           
CFSBBUF  EQU   8,8,C'N'                8 CAT BLOCK BUFFERS ALLOWED              
FSBBLKTOP DS   A                       POINTS TO LAST BUFFER SLOT               
FSBCHKA  DS    A                       CHECK POINT BUFFER ADDRESS               
FSBROOTB DS    A                       BLOCK NUMBER IN ROOT BUFFER              
FSBROOTA DS    A                       | ADDRESS OF ROOT BUFFER                 
FSBBLK1  DS    A                       BLOCK NUMBER IN 1ST BUFFER               
FSBBUF1  DS    A                       | ADDRESS OF 1ST BUFFER                  
&BUFLEN  SETA  (L'CFSBBUF-1)*L'CFSBPL                                           
         DS    &BUFLEN.X               | LEN OF REMAINING BUF SLOTS             
*                                                                               
*  Catalog Balancing Parameters                                                 
*                                                                               
FSBBALST DS    0X                                                               
FSBDSZ   DS    Y                       Size of disk block                       
FSBDAVA  DS    Y                       Available space per block                
FSBDTAGX DS    Y                       Offset of end tag in block               
FSBNALEN DS    Y                       Account: Length of node                  
FSBNASPA DS    Y                       | Free space in node                     
FSBTAXLN DS    Y                       | Maximum length of entry                
FSBNAMXL DS    Y                       | Max len of entry in node               
FSBNAXSP DS    Y                       | Max free space per node                
FSBNANSP DS    Y                       | Min free space per node                
FSBNFLEN DS    Y                       File: Length of node                     
FSBNFSPA DS    Y                       | Free space in node                     
FSBTFXLN DS    Y                       | Maximum length of entry                
FSBNFMXL DS    Y                       | Max len of entry in node               
FSBNFXSP DS    Y                       | Max free space per node                
FSBNFNSP DS    Y                       | Min free space per node                
FSBTXXLN DS    Y                       Max len of extended data entry           
FSBLOGFR DS    Y                       Minimum logical block count              
FSBMNFRE DS    Y                       Min num of free blks in Cat              
FSBBALLN EQU   *-FSBBALST                                                       
*                                                                               
*  BITMAP MANAGEMENT AREA                                                       
*                                                                               
FSBBMCNO DS    Y                       SPECIFIED CNT BLK# IN AVAIL LIST         
FSBBITSB DS    A                       BIT MAP FIRST BLOCK                      
FSBBITBC DS    A                       BIT MAP BLOCK COUNT                      
FSBABLK  DS    A                       NUMBER OF AVAILABLE BLOCKS               
FSBTBLK  DS    A                       TOTAL NUMBER OF BLOCKS                   
FSBDBLK  DS    A                       DEFAULT BLOCK ALLOCATION                 
FSBABNL  DS    A                       AVAILABLE BLOCK NUMBER LIST              
*                                                                               
FSBSMF   DS    2A                      SMF STATISTICS WORK AREA                 
FSBSTATS DS    0X                                                               
FSBCTRD  DS    F                       CATALOG READ COUNTER                     
FSBCTRRD DS    F                       CATALOG ROOT "READ" COUNTER              
FSBCTCRD DS    F                       CATALOG CASHED READ COUNTER              
FSBCTBRD DS    F                       CATALOG BALANCE READ COUNTER             
FSBCTWR  DS    F                       CATALOG WRITE COUNTER                    
FSBCTIWR DS    F                       CATALOG INTENTIONS WRITE CNT             
FSBCTBWR DS    F                       CATALOG BALANCE WRITE COUNTER            
FSBCTDWR DS    F                       CATALOG DOUBLE WRITE COUNTER             
*                                                                               
*  Total IO's and IO time                                                       
*                                                                               
FSBIOCT  DS    F                   Total I/O count                              
FSBIOTIM DS    D                   Total I/O time                               
*                                                                               
FSBCAT4K DS    F                   Cat io 4K buffer (2K file sys only)          
*                                                                               
CTFILATT DS    F                   Number of files attached                     
CTFILATM DS    F                   | max number attached                        
CTFILAUS DS    F                   Number of user attaches                      
CTFILAUM DS    F                   | max number of user attaches                
CTFILATP DS    F                   Number of temp files attached                
CTFILAPM DS    F                   | max number of temp files attached          
                                                                                
         DS    F                   Spare                                        
*                                                                               
* Note: don't modify the following counters in any way unless                   
*       FILECB and the routine FDOIODO are also modified.                       
*                                                                               
*  File read counts from disk                                                   
*                                                                               
FSBFIOCT DS    0D                  First IO count                               
CTREADCT DS    0D                                                               
CTMASRCT DS    D                   Master - read counts                         
CTCATRCT DS    D                   Catalog - read counts                        
CTBITRCT DS    D                   Bitmap - read counts                         
CTIXRRCT DS    D                   IXR - read counts                            
CTUSERCT DS    D                   User  - read counts                          
CTOTHRCT DS    D                   Other?? - read counts                        
*                                                                               
* Counter indexes - All counters are referenced with the                        
* generic label and using one of the following indexes.                         
*                                                                               
CTMASD   EQU   CTMASRCT-CTREADCT                                                
CTCATD   EQU   CTCATRCT-CTREADCT                                                
CTBITD   EQU   CTBITRCT-CTREADCT                                                
CTIXRD   EQU   CTIXRRCT-CTREADCT                                                
CTUSED   EQU   CTUSERCT-CTREADCT                                                
CTOTHD   EQU   CTOTHRCT-CTREADCT                                                
*                                                                               
*  File write counts                                                            
*                                                                               
CTWRITCT DS    0D                                                               
CTMASWCT DS    D                   Master - writes                              
CTCATWCT DS    D                   Catalog - writes                             
CTBITWCT DS    D                   Bitmap -  writes                             
CTIXRWCT DS    D                   IXR - writes                                 
CTUSEWCT DS    D                   User -  writes                               
CTOTHWCT DS    D                   Other?? - writes                             
FSBFIOCN EQU   (*-FSBFIOCT)/L'FSBFIOCT                                          
*                                                                               
*  File read counts from cache                                                  
*                                                                               
FSBFCACT DS    0D                  First cache count                            
CTCACHCT DS    0D                                                               
CTMASCCT DS    D                   Master - read counts                         
CTCATCCT DS    D                   Catalog - read counts                        
CTBITCCT DS    D                   Bitmap - read counts                         
CTIXRCCT DS    D                   IXR - read counts                            
CTUSECCT DS    D                   User  - read counts                          
CTOTHCCT DS    D                   Other?? - read counts                        
*                                                                               
CTREADD  EQU   CTREADCT-FSBFIOCT                                                
CTWRITD  EQU   CTWRITCT-FSBFIOCT                                                
CTCACHD  EQU   CTCACHCT-FSBFIOCT                                                
*                                                                               
FSBFCACN EQU   (*-FSBFCACT)/L'FSBFCACT                                          
CTFILECT EQU   CTREADCT,*-CTREADCT                                              
CTFILECC EQU   (*-CTREADCT)/L'CTREADCT                                          
                                                                                
         DS    4A                  Spare                                        
                                                                                
         END   ,                                                                
