*                                                                       00050000
*        %GOTO UCBL1;                 /* Bilingual mapping              00100000
         MACRO                                                          00150000
         IEFUCBOB &LIST=YES,&PREFIX=NO,&SSMD=NO,&DEVCLAS=          @L7C 00200000
         GBLC  &SYSUCBD            UCB DSECT name                  @L7A 00250000
         GBLB  &DCUCB(6)           Device classes to be mapped     @L7A 00275000
         LCLC  &DCVAL(6)           Valid device classes on DEVCLAS      00300000
.*                                 keyword                         @L7A 00350000
         LCLA  &DCDIM              Dimension of DCVAL and DCUCB    @L7A 00400000
         LCLA  &I                  Index variable                       00500000
         LCLA  &J                  Index variable                       00550000
         LCLC  &PREOPT             PREFIX value (value specified        00600000
.*                                 on PREFIX keyword or set to          00650000
.*                                 'YES' if SSMD=YES specified)    @L7A 00700000
         AGO   .UCB032             VALIDATE keyword specifications @L7A 00750000
.UCB033  ANOP                      Return from keyword validation  @L7A 00800000
.*                                                                   */ 00850000
*%UCBL1 : ;                                                             00900000
*/********************************************************************/ 00950000
*/*                                                                  */ 01000000
*/*            U N I T   C O N T R O L   B L O C K                   */ 01050000
*/*                                                                  */ 01100000
*/********************************************************************/ 01150000
*/*                                                                  */ 01200000
*/*                                                                  */ 01250000
*/*  MODULE NAME = IEFUCBOB                                          */ 01300000
*/*                                                                  */ 01350000
*/*  DESCRIPTIVE NAME = UCB Mapping Macro                            */ 01400000
*/*                                                                  */ 01450000
*/*  COPYRIGHT =                                                     */ 01500000
*/*   5685-001                                                       */ 01550000
*/*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    */ 01600000
*/*   (C) COPYRIGHT IBM CORP. 1981, 1988                             */ 01650000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 01700000
*/*                                                                  */ 01850000
*/*  STATUS = HBB3310                                                */ 01900000
*/*                                                                  */ 01950000
*/*  FUNCTION                                                        */ 02000000
*/*                                                                  */ 02050000
*/*     This mapping describes the control block required to define  */ 02100000
*/*     an I/O device to the system.                                 */ 02150000
*/*                                                                  */ 02200000
*/*     The UCBs reside in the NUCLEUS and are created and           */ 02250000
*/*     initialized by the MVSCP.                                    */ 02300000
*/*                                                                  */ 02350000
*/*     The UCB contains all the information necessary for the       */ 02400000
*/*     device to be used for performing I/O requests and records    */ 02450000
*/*     the status of a physical I/O device represented by a         */ 02500000
*/*     subchannel.                                                  */ 02550000
*/*                                                                  */ 02600000
*/*     The common segment of the first UCB is pointed to by the     */ 02650000
*/*     CVTUCBA field in the CVT. A chain pointer in the UCB         */ 02700000
*/*     common segment (UCBNXUCB) points to the next UCB in the      */ 02750000
*/*     chain. The Device Class Queue (DCQ) is pointed to by the     */ 02800000
*/*     CVTDCQA field in the CVT. The first UCB within a device      */ 02850000
*/*     class is pointed to by the DCQUCBAD field.                   */ 02900000
*/*                                                                  */ 02950000
*/*     The UCB address located from the UCB chain field points      */ 03000000
*/*     to the UCB common segment. To obtain the pointer to the      */ 03050000
*/*     UCB prefix area, subtract the prefix length from the         */ 03100000
*/*     common segment address (i.e., UCBOB-UCBPFXLN).               */ 03150000
*/*                                                                  */ 03200000
*%GOTO UCBL1A;                                                /* @L7A*/ 03250000
*/*                                                                  */ 03300000
*/*  KEYWORDS ON ASSEMBLER INVOCATION                                */ 03350000
*/*                                                                  */ 03400000
*/*  SSMD is used to control the UCB mapping. The                    */ 03450000
*/*  valid operands and their meanings are:                          */ 03550000
*/*                                                                  */ 03600000
*/*     NO   - Generates the standard UCB mapping. This is the       */ 03650000
*/*            default.                                              */ 03700000
*/*                                                                  */ 03750000
*/*     YES  - Generates the UCB mapping that is used internally     */ 03800000
*/*            by IOS. This mapping is for IOS use only.             */ 03850000
*/*                                                                  */ 03900000
*/*  PREFIX is used to indicate whether to generate the UCB prefix   */ 04800000
*/*  fields in the UCB mapping. This keyword is ignored if SSMD=YES  */ 04850000
*/*  is specified. (The prefix fields are always generated when      */ 04900000
*/*  SSMD=YES is specified.) The valid operands and their meanings   */ 04950000
*/*  are:                                                            */ 05000000
*/*                                                                  */ 05050000
*/*     NO   - The UCB prefix fields are not mapped. This is the     */ 05100000
*/*            default. A DSECT statement should preceed the macro   */ 05150000
*/*            call. Symbols in the common segment and device        */ 05200000
*/*            dependent segments are addressable by a USING on      */ 05250000
*/*            UCBOB. Additional USING statements are necessary      */ 05300000
*/*            to obtain addressability to the UCB extensions.       */ 05350000
*/*                                                                  */ 05400000
*/*     YES  - The UCB prefix fields are mapped. A DSECT statement   */ 05450000
*/*            labeled UCB is generated. A USING statement on the    */ 05500000
*/*            symbol UCB will provide addressability to all         */ 05550000
*/*            portions of the UCB except the extensions. Additional */ 05600000
*/*            USING statements are necessary to obtain address-     */ 05650000
*/*            ability to the extensions.                            */ 05700000
*/*                                                                  */ 05750000
*/*  DEVCLAS is used to specify which device dependent mappings are  */ 05800000
*/*  to be generated. The valid operands and their meanings are:     */ 05850000
*/*                                                                  */ 05900000
*/*     ALL  - Include all device dependent mappings. This is the    */ 05950000
*/*            default                                               */ 06000000
*/*     NONE - Do not include any device dependent mappings          */ 06050000
*/*     CE   - Include the communications equipment device mapping   */ 06100000
*/*     CT   - Include the CTC device mapping                        */ 06150000
*/*     DA   - Include the DASD device mapping                       */ 06200000
*/*     GR   - Include the graphics device mapping                   */ 06250000
*/*     MT   - Include the magnetic tape device mapping              */ 06300000
*/*     UR   - Include the unit record device mapping                */ 06350000
*/*                                                                  */ 06400000
*/*     If an unrecognized operand is specified on the DEVCLAS       */ 06450000
*/*     keyword, the UCB will expand to include all of the device    */ 06500000
*/*     dependent mappings.                                          */ 06550000
*/*                                                                  */ 06600000
*/*     The CE, CT, DA, GR, MT, and UR operands can be specified     */ 06650000
*/*     as sublist entries if more than one category of device       */ 06700000
*/*     dependent mapping is required.                               */ 06750000
*/*                                                                  */ 06800000
         AGO   .UCB000                                             @L7A 06850000
*%UCBL1A : ;                                                  /* @L7A*/ 06900000
*/*                                                                  */ 06950000
*/*  PLS/PLAS MACRO VARIABLES                                        */ 07000000
*/*                                                                  */ 07050000
*/*  %IHAUCBSS is used to control the mapping of the UCB             */ 07100000
*/*  The valid operands and their meanings are:                      */ 07150000
*/*                                                                  */ 07250000
*/*     NO   - Generates the standard UCB mapping. This is the       */ 07300000
*/*            default.                                              */ 07350000
*/*                                                                  */ 07400000
*/*     YES  - Generates the UCB mapping that is used internally     */ 07450000
*/*            by IOS. This mapping is for IOS use only.             */ 07500000
*/*                                                                  */ 07550000
*/*  %IHAUCB is used to indicate whether to base the UCB on the      */ 08300000
*/*  prefix or the common segment. The valid operand and its meaning */ 08350000
*/*  is:                                                             */ 08400000
*/*                                                                  */ 08450000
*/*     PREFIX - The UCB prefix is based on UCBPFPTR and the common  */ 08500000
*/*              segment is defined at the end of the prefix.        */ 08550000
*/*                                                                  */ 08600000
*/*              If %IHAUCB is set to any other value, or is not     */ 08650000
*/*              set, then the UCB common segment is based on        */ 08700000
*/*              UCBPTR and the UCB prefix is based on the address   */ 08750000
*/*              of the common segment (UCBOB) minus 512.            */ 08800000
*/*                                                                  */ 08850000
*/*  %IHAUCBAC is used to indicate if all the device dependent       */ 08900000
*/*  mappings are to be generated. The valid operands and their      */ 08950000
*/*  meanings are as follows:                                        */ 09000000
*/*                                                                  */ 09050000
*/*     YES  - Include all device dependent mappings. This is the    */ 09100000
*/*            default.                                              */ 09150000
*/*                                                                  */ 09200000
*/*     NO   - Do not include any device dependent mapping that is   */ 09250000
*/*            not explicitly requested. The following device        */ 09300000
*/*            dependent mappings can be generated by setting the    */ 09350000
*/*            associated macro symbol to 'YES'.                     */ 09400000
*/*                                                                  */ 09450000
*/*            Symbol     Device dependent mapping                   */ 09500000
*/*            ------     ------------------------                   */ 09550000
*/*                                                                  */ 09600000
*/*            %IHAUCBCE  Communications equipment mapping           */ 09650000
*/*            %IHAUCBCT  CTC mapping                                */ 09700000
*/*            %IHAUCBDA  DASD mapping                               */ 09750000
*/*            %IHAUCBGR  Graphics mapping                           */ 09800000
*/*            %IHAUCBMT  Magnetic tape mapping                      */ 09850000
*/*            %IHAUCBUR  Unit record mapping                        */ 09900000
*/*                                                                  */ 09950000
*%GOTO UCBL1B;                                                /* @L7A*/ 10000000
.UCB000  ANOP                                                      @L7A 10050000
*%UCBL1B : ;                                                  /* @L7A*/ 10100000
*/*                                                                  */ 10150000
*/*  OUTPUT                                                          */ 10200000
*/*                                                                  */ 10250000
*/*      Prefix                                                      */ 10300000
*/*      Common segment                                              */ 10450000
*/*      Common extension                generated by inner macro    */ 10475000
*/*      Device dependent segment        generated by inner macro    */ 10500000
*/*      Device dependent extension      generated by inner macro    */ 10650000
*/*                                                                  */ 10700000
*/*      The device class extensions are generated by independent    */ 10750000
*/*      macros.                                                     */ 10800000
*/*                                                                  */ 10850000
*/*  NOTES                                                           */ 10900000
*/*                                                                  */ 10950000
*/*      The UCBs reside in member IOSUCBxx in SYS1.NUCLEUS, where   */ 11000000
*/*      xx is the identifier of the designated I/O configuration.   */ 11050000
*/*                                                                  */ 11100000
*/*      Field names beginning with the following character          */ 11150000
*/*      strings have been reserved for use by the indicated         */ 11200000
*/*      macros.                                                     */ 11250000
*/*                                                                  */ 11300000
*/*      String    Macro       Description                           */ 11350000
*/*      ------    -----       -----------                           */ 11400000
*/*                                                                  */ 11450000
*/*      UCBCT     IECDUCBC    UCB CTC mapping                       */ 11500000
*/*      UCBCX     IECUCBCX    UCB tape class extension mapping      */ 11550000
*/*      UCBD      IECDUCBD    UCB DASD mapping                      */ 11600000
*/*      UCBE      IECDUCBE    UCB communications mapping            */ 11650000
*/*      UCBG      IECDUCBG    UCB graphics mapping                  */ 11700000
*/*      UCBT      IECDUCBT    UCB magnetic tape mapping             */ 11750000
*/*      UCBU      IECDUCBU    UCB unit record mapping               */ 11800000
*/*                                                                  */ 11850000
*/*  CHANGE ACTIVITY                                                 */ 11900000
*/*                                                                  */ 11950000
*/*  $MAC(IEFUCBOB),COMP(SC1C3): Unit Control Block                  */ 12000000
*/*                                                                  */ 12050000
*/*   PN  REASON    RLSE    DATE    ORG       COMMENTS               */ 12100000
*/*  $L2= SECP    JBB1326  800801  PDLT: Seldom ending channel pgm   */ 12150000
*/*  $L3= RAS     JBB1326  800801  PDLT: MIH RAS enhancements        */ 12200000
*/*  $D1= DCR93   JBB1326  801202  PDLN: Abnormal attribute, UCBSTAT */ 12250000
*/*  $L4= PTR     JBB1326  810331  PDLN: Printer model               */ 12300000
*/*  @G860PLN                          : IOS rewrite                 */ 12350000
*/*  $H1=DREISAM  JBB2110  820526  PDLN: 3263 device                 */ 12400000
*/*  $L5=CHPRECVY JBB2125  830131  PDLY: CHP recovery enhancements   */ 12450000
*/*  $H2=3480AU   JBB2125  830131  PDLT: Assign/unassign support     */ 12500000
*/*  $H3=3430     JBB2125  830131  PDLT: 3430 support                */ 12550000
*/*  $D2=DCR89    JBB2125  830930  PDLR: Device support              */ 12600000
*/*  $01=OZ79979  JBB2125  841001  PDLE: Provide DPS validation      */ 12650000
*/*                                      support and block ID        */ 12700000
*/*  $02=OZ81869  JBB2220  850603  PDLJ: Block ID supported on this  */ 12750000
*/*                                      device                      */ 12800000
*/*  $04=OZ90025  JBB2133  860228  PDLZ: Induced hot I/O recovery    */ 12825000
*/*  $05=OZ98009  JBB2125  860801  PDLG: Add Bit for device state    */ 12833300
*/*                                      transition flushing         */ 12841600
*/*  $06=OY01941  JBB2125  860601  PDLZ: Alternate PGID support      */ 12845800
*/*  $07=OY09623  HBB3310  871101  PDLE: Reset Event Notification    */ 12847900
*/*  $08=OY21399  JBB2220  880201  PDLG: CUIR Support                */ 12848600
*/*  $09=OY28664  HBB3310  880301  PDLH: Overlook support        @09A*/ 12849300
*/*  $L6=IOGEN    JBB2220  840611  PDLY: IOGEN Restructure           */ 12850000
*/*  $L7=XDEVNUM  HBB3310  850925  PDLY: SP3 mapping for IOS use     */ 12900000
*/*  $L8=VERS     HBB3310  860416  PDLE: Versioning macro into       */ 12966600
*/*                                      product                     */ 12983200
*/*  $L9=IOSRAS   HBB3310  861229  PDLE: MIH console support         */ 12986000
*/*  $P1=PC42250  HBB3310  880210  PDLC: Correct potential RFY       */ 12989500
*/*                                      problem with the IOS SP3    */ 12993000
*/*                                      mapping                     */ 12996500
*/*                                                                  */ 13000000
*/********************************************************************/ 13050000
*%GOTO UCBL2;   /*                                                      13100000
         AGO   .UCB031             Branch around keyword validation     13150000
.*                                 logic                           @L7A 13200000
.UCB032  ANOP                                                      @L7A 13250000
         AIF   ('&SSMD' NE 'YES').UCB000A Standard UCB to               13300000
.*                                 be generated                    @L7A 13350000
&PREOPT  SETC  'YES'               Prefix always generated with the     13400000
.*                                 IOS mapping                     @L7A 13450000
         AGO   .UCB000B                                            @L7A 13500000
.UCB000A ANOP                                                      @L7A 13550000
&PREOPT  SETC  '&PREFIX'           Value specified on PREFIX            13600000
.*                                 keyword                         @L7A 13650000
.UCB000B ANOP                                                      @L7A 13700000
&DCDIM   SETA  6                   Dimension of DCVAL and DCUCB    @L7A 13750000
.*                                 Valid DEVCLAS device classes    @L7A 13800000
&DCVAL(1) SETC 'MT'                Magnetic tape device class      @L7A 13850000
&DCVAL(2) SETC 'CT'                CTC device class                @L7A 13900000
&DCVAL(3) SETC 'CE'                Communications Equip. device class   13950000
.*                                                                 @L7A 14000000
&DCVAL(4) SETC 'DA'                DASD device class               @L7A 14050000
&DCVAL(5) SETC 'GR'                Graphics device class           @L7A 14100000
&DCVAL(6) SETC 'UR'                Unit record device class        @L7A 14150000
         AIF   (T'&DEVCLAS EQ 'O').UCB022  DEVCLAS keyword omitted @L7A 14200000
         AIF   (N'&DEVCLAS GT 1).UCB025  More than 1 DEVCLAS            14250000
.*                                       specified                 @L7A 14300000
         AIF   (K'&DEVCLAS(1) NE 3).UCB024  The number of characters    14350000
.*                                          in the DEVCLAS value is     14400000
.*                                          not equal to 3         @L7A 14450000
         AIF   ('&DEVCLAS(1)' EQ 'ALL').UCB022  "ALL" specified as      14500000
.*                                              DEVCLAS value      @L7A 14550000
.UCB021  ANOP                                                      @L7A 14600000
         MNOTE 4,'INVALID DEVCLAS VALUE SPECIFIED - ALL DEVICE CLASS MAX14650000
               PPINGS EXPANDED'                                    @L7A 14700000
.UCB022  ANOP                      Indicate all device classes are      14750000
.*                                 to be mapped                    @L7A 14800000
&I       SETA  1                   Set index to first entry in the      14850000
.*                                 DCUCB array                     @L7A 14900000
.UCB023  ANOP                                                      @L7A 14950000
&DCUCB(&I) SETB 1                  Indicate that the device class       15000000
.*                                 associated with the current          15050000
.*                                 entry in the DCUCB array is to       15100000
.*                                 be mapped                       @L7A 15150000
&I       SETA  &I+1                Add 1 to DCUCB array index      @L7A 15200000
         AIF   (&I LE &DCDIM).UCB023  Set next entry in the DCUCB       15250000
.*                                    array                        @L7A 15300000
         AGO   .UCB030             "NONE" specified as DEVCLAS          15350000
.*                                  value                          @L7A 15400000
.UCB024  ANOP                                                      @L7A 15450000
         AIF   (K'&DEVCLAS(1) NE 4).UCB025  The number of characters    15500000
.*                                          in the DEVCLAS value is     15550000
.*                                          not equal to 4         @L7A 15600000
         AIF   ('&DEVCLAS(1)' NE 'NONE').UCB021  "NONE" not specified   15650000
.*                                                as DEVCLAS value @L7A 15700000
         AGO   .UCB030                                             @L7A 15750000
.UCB025  ANOP                                                      @L7A 15800000
&J       SETA  1                   Set index to point to first entry    15850000
.*                                 in the DEVCLAS sublist          @L7A 15900000
.UCB026  ANOP                                                      @L7A 15950000
&I       SETA  1                   Set index to point to first entry    16000000
.*                                 in the DCVAL array              @L7A 16050000
.UCB027  ANOP                                                      @L7A 16100000
         AIF   ('&DEVCLAS(&J)' NE '&DCVAL(&I)').UCB028  DEVCLAS         16150000
.*                                 sublist entry not equal to current   16200000
.*                                 entry in the DCVAL array        @L7A 16250000
&DCUCB(&I) SETB 1                  Indicate this device class is to     16300000
.*                                 be mapped                       @L7A 16350000
         AGO   .UCB029                                             @L7A 16400000
.UCB028  ANOP                                                      @L7A 16450000
&I       SETA  &I+1                Add 1 to DCVAL array index      @L7A 16500000
         AIF   (&I LE &DCDIM).UCB027  Check next entry in DCVAL         16550000
.*                                 array                           @L7A 16600000
         AGO   .UCB021             Issue error message and indicate     16650000
.*                                 the entire UCB is to be mapped  @L7A 16700000
.UCB029  ANOP                                                      @L7A 16750000
&J       SETA  &J+1                Add 1 to DEVCLAS sublist entry       16800000
.*                                 index                           @L7A 16850000
         AIF  (&J LE N'&DEVCLAS).UCB026  Validate next DEVCLAS sublist  16900000
.*                                 entry                           @L7A 16950000
.UCB030  ANOP                                                      @L7A 17000000
         AGO   .UCB033                                             @L7A 17050000
.UCB031  ANOP                                                      @L7A 17100000
         AIF   ('&PREOPT' NE 'YES').UCB001                         @L7C 17150000
*********************************************************************** 17200000
*                                                                     * 17250000
*        UCB prefix                                                   * 17300000
*                                                                     * 17350000
*********************************************************************** 17400000
UCB      DSECT ,                   UCBPTR-512 (Where UCBPTR points      17450000
*                                  to UCBOB)                            17500000
UCBBGN   EQU   *                                                        17550000
*                                                                       17700000
         AIF   ('&SSMD' NE 'YES').UCB003                           @L7A 17750000
         DS    108F                Reserved                        @L7A 17766600
UCBPXSEG EQU   *                   UCB prefix segment              @L7A 17783200
         IOSDUCBC                  ,                               @L7A 17800000
         AGO   .UCB004                                             @L7A 17850000
.UCB003  ANOP                                                      @L7A 17900000
         DS    116F                Reserved                             17950000
.UCB004  ANOP                                                      @L7A 18000000
UCBPXST  EQU   *                   Start of used fields in PREFIX       18010000
UCBRSTEM DS    BL1                 Reset Event mask                @07C 18050000
UCBMIHKY DS    FL1                 MIH UCB time interval key       @L9C 18100000
*********************************************************************** 18150000
***      IOS MIH control byte                                        ** 18200000
*********************************************************************** 18250000
UCBMIHTI DS    B                   Missing Interrupt Handler byte       18300000
*                                                                       18350000
UCBMIHSS EQU   X'80'               Customer-specified scan interval     18400000
*                                  being used                           18450000
UCBMIHPB EQU   X'40'               With bit set, Missing Interrupt      18500000
*                                  Handler checking of device is        18550000
*                                  bypassed for started I/O requests    18575000
*                                  for which idle with work queued      18600000
*                                  conditions are not detected          18625000
UCBMIHR1 EQU   X'20'               Reserved - set to zero               18650000
UCBMIHR2 EQU   X'10'               Reserved - set to zero               18700000
UCBIOQRP EQU   X'08'               Pending I/O request condition        18750000
UCBMIHMP EQU   X'04'               Message pending, to be DOM'D during  18800000
*                                  the next MIH scan                    18850000
UCBMIHIO EQU   X'02'               Clear subchannel scheduled by        18900000
*                                  MIH                                  18950000
UCBPGDEV EQU   X'01'               Device is being used for paging      19000000
*********************************************************************** 19050000
***      IOS HOT I/O control byte                                    ** 19100000
*********************************************************************** 19150000
UCBHOTIO DS    FL1                 HOT-I/O indicator                    19200000
UCBHSCD  EQU   X'80'               SCD associated with the UCB          19250000
UCBHSOL  EQU   X'40'               A solicited interrupt has completed  19300000
*                                  with other than DCC-3 since the last 19350000
*                                  time HOT-I/O detection was called.   19400000
UCBSUSOL EQU   X'20' -             Indicates that the last         @04A 19418700
*                                  unsolicited interrupt occurred  @04A 19437400
*                                  when a request was outstanding, @04A 19456100
*                                  and could have been induced     @04A 19474800
UCBINDHI EQU   X'10' -             Indicates that an induced       @04A 19493500
*                                  hot I/O condition has been      @04A 19512200
*                                  detected on the device          @04A 19530900
UCBHCHPR EQU   X'08'               Channel path recovery is attempting  19550000
*                                  to clear up a HOT-I/O condition      19600000
*                                  for this device.                     19650000
UCBHCHPI EQU   X'07'               IF UCBHCHPR is on, this is an index  19700000
*                                  into UCBCHPID, specifying the        19750000
*                                  channel path over which the HOT-I/O  19800000
*                                  condition was detected.              19850000
*********************************************************************** 19900000
***   IOS UCB IOQ chains of I/O requests associated with this device ** 19950000
*********************************************************************** 20000000
UCBIOQF  DS    A                   First request for this device        20050000
UCBIOQL  DS    A                   Last request for this device         20100000
*********************************************************************** 20150000
***     Associated subchannel data                                   ** 20200000
*********************************************************************** 20250000
UCBSID   DS    0FL4                Subsystem-identification word in     20300000
*                                  connected subchannel (valid only if  20350000
*                                  UCBNOCON is not set)            @L5C 20400000
UCBSIDA  DS    FL2                 X'0001'                         @L5A 20450000
UCBSCHNO DS    FL2                 Subchannel number               @L5A 20500000
UCBPMCW1 DS    FL2                 Path management control word         20550000
*        EQU   X'8000'             Reserved - set to zero               20600000
*        EQU   X'4000'             Reserved - set to zero               20650000
UCBISC   EQU   X'3800'             Interruption subclass                20700000
*        EQU   X'0400'             Reserved - set to zero               20750000
*        EQU   X'0200'             Reserved - set to zero               20800000
*        EQU   X'0100'             Reserved - set to zero               20850000
UCBENABL EQU   X'0080'             Subchannel enabled for interruptions 20900000
UCBLM    EQU   X'0060'             Limit mode checking state            20950000
UCBLNONE EQU   X'0000'             No limit mode checking               21000000
UCBLGTE  EQU   X'0020'             Data address must be greater than    21050000
*                                  or equal to the limit                21100000
UCBLLT   EQU   X'0040'             Data address must be less than the   21150000
*                                  limit                                21200000
UCBMM    EQU   X'0018'             Measurement mode state               21250000
UCBMCMB  EQU   X'0010'             Store measurements in Channel        21300000
*                                  Measurement Block                    21350000
UCBMDCTI EQU   X'0008'             DCTI is to be stored in Extended     21400000
*                                  Status Word                          21450000
UCBDPMPM EQU   X'0004'             Dynamic pathing multiple path state  21500000
*        EQU   X'0002'             Reserved - set to zero               21550000
*        EQU   X'0001'             Reserved - set to zero               21600000
UCBMBI   DS    FL2                 Measurement Block Index              21650000
UCBLPM   DS    BL1                 Logical path mask (LPM)              21700000
         DS    FL1                 Reserved - set to zero               21750000
UCBLPUM  DS    BL1                 Last path used mask (LPUM)           21800000
UCBPIM   DS    BL1                 The path installed mask for this     21850000
*                                  subchannel                           21900000
UCBCHPS  DS    0XL8                The set of 8 channel paths           21950000
*                                  associated with this subchannel.     22000000
UCBCHPID DS    8FL1                Array reference to each channel path 22050000
*                                  identifier (CHPID) for this          22100000
*                                  subchannel. (The bits in UCBLPM,     22150000
*                                  UCBLPUM and UCBPIM map to the bytes  22200000
*                                  in this array. For example, a X'80'  22250000
*                                  in UCBPIM indicates the first byte   22300000
*                                  in this array contains a CHPID for   22350000
*                                  a path that is installed on the      22400000
*                                  associated device.)             @H3C 22450000
*********************************************************************** 22500000
***     I/O Supervisor general fields                                ** 22550000
*********************************************************************** 22600000
UCBLEVEL DS    FL1                 Highest level set in UCBLVMSK        22650000
UCBIOSF1 DS    B                   IOS flag byte                        22700000
UCBRESVH EQU   X'80'               Device reserved indicator            22750000
UCBVALPH EQU   X'40'               Path validation indicator            22800000
UCBRESVP EQU   X'20'               Reserve channel program pending      22850000
UCBRRP   EQU   X'10'               Reserve/release pending              22900000
UCBDPTH  EQU   X'08'               Dynamic pathing feature has          22950000
*                                  been initialized for this device     23000000
UCBDPVAL EQU   X'04'               Dynamic pathing validation required  23050000
*                                                                  @01C 23100000
UCBDSTF  EQU   X'02'               Restart deivce state transition      23133300
*                                  flushing                        @05A 23166600
UCBAPGID EQU   X'01' -             Alternate PGID established      @06C 23200000
*********************************************************************** 23250000
***     IOS MIH count and IOS level bit mask                         ** 23300000
*********************************************************************** 23350000
UCBMIHCT DS    H                   Count for Missing Interrupt          23400000
UCBLVMSK DS    BL4                 UCB level bit mask                   23450000
*********************************************************************** 23500000
***     UCB lock word and pointer to the active IOQ element          ** 23550000
*********************************************************************** 23600000
UCBLOCK  DS    F                   Device lock word                     23650000
UCBIOQ   DS    A                   Address of last queuing element      23700000
*                                  started, halted, or cleared          23750000
*                                  for this device.  This field         23800000
*                                  contains a valid address only when   23850000
*                                  UCBSTRT, UCBHALT, or UCBCLEAR are    23900000
*                                  set on.                              23950000
UCBCURPX EQU   *-UCBPXST           Actual prefix data length            24000000
UCBPRFX  EQU   *-UCB               Total prefix length for prefix       24050000
*                                  addressability                       24100000
         SPACE 3                                                        24150000
&SYSUCBD SETC  'UCB'               Save DSECT name                 @L7A 24200000
.UCB001  ANOP                                                           24250000
*********************************************************************** 24300000
*                                                                       24350000
*              UCB common segment                                       24400000
*                                                                       24450000
UCBOB    DS    0F                                                       24500000
         AIF   ('&PREOPT' EQ 'YES').UCB002                         @L7C 24550000
&SYSUCBD SETC  '&SYSECT'           Save DSECT name                 @L7A 24600000
UCBBGN   EQU   *                                                        24650000
.UCB002  ANOP                                                           24700000
*                                                                       24750000
*********************************************************************** 24800000
*                                                                       24850000
UCBCMSEG EQU   *                   Start of common segment              24900000
UCBJBNR  DS    B                   Flag byte                            24950000
*********************************************************************** 25000000
***     Fields and flags used by allocation, access methods, etc.    ** 25050000
*********************************************************************** 25100000
UCBVRDEV EQU   X'80'               UCB for VIO device                   25150000
UCBJES3  EQU   X'40'               All volume mounting and device       25200000
*                                  management for this device is        25250000
*                                  controlled by JES3                   25300000
UCBDUC   EQU   X'20'               Display device unit check            25350000
*                                  detected during IPL                  25400000
UCBJ3DV  EQU   X'10'               Device is defined to JES3       @09A 25450000
UCBOLDSM EQU   X'08'               OLTEP communicating directly with    25500000
*                                  the Mass Storage Control (MSC),      25550000
*                                  not through the Mass Storage System  25600000
*                                  Communicator (MSSC)                  25650000
UCBMMSGP EQU   X'04'               Mount message pending.  The device   25700000
*                                  has been selected by device          25750000
*                                  allocation, but no mount message has 25800000
*                                  been issued.                         25850000
UCBDCONS EQU   X'02'               Disabled console support controls    25900000
*                                  this console.                        25950000
UCBMONT  EQU   X'01'               Volume to be mounted is to be        26000000
*                                  retained or contains a passed data   26050000
*                                  set (Set by device allocation or     26100000
*                                  data management)                     26150000
UCBFL5   DS    B                   Flags                                26200000
UCBDCC   EQU   X'80'               Disconnect command chain device      26250000
UCBAF    EQU   X'40'               Attention for this console device    26300000
*                                  is to be processed by the            26350000
*                                  communications task                  26400000
UCBAMV   EQU   X'40'               Successful comparison checking of    26450000
*                                  the access method catalog and the    26500000
*                                  VTOC (VSAM direct access devices     26550000
*                                  only)                                26600000
UCBSMS   EQU   X'20'               Data management flag            @L6C 26650000
UCBVSDR  EQU   X'10'               Device has variable length SDRs      26700000
UCBENVRD EQU   X'08'               Device returns environmental data    26750000
UCBNALOC EQU   X'04'               This offline device is being used by 26800000
*                                  a system component.  The device      26850000
*                                  status must not change to online nor 26900000
*                                  will it be allocated.  The last      26950000
*                                  path to the device must not be       27000000
*                                  VARY'ed offline.  The device is      27050000
*                                  unavailable for usage by another     27100000
*                                  system component which processes     27150000
*                                  offline devices.                     27200000
UCBALTCU EQU   X'02'               Device has an alternate control unit 27250000
*                                  address                              27300000
UCBCUIR  EQU   X'01'               Indicates whether the device is      27333300
*                                  offline due to CUIR             @08A 27366600
*********************************************************************** 27400000
***     UCB identification byte - contains hex FF                    ** 27450000
*********************************************************************** 27500000
UCBID    DS    XL1                 UCB identification (FF)              27550000
UCBSTND  EQU   X'FF'               UCB identifier                       27600000
*********************************************************************** 27650000
*** Device status flags controlled by allocation, access methods, etc** 27700000
*********************************************************************** 27750000
UCBSTAT  DS    B                   Device status                        27800000
UCBONLI  EQU   X'80'               Device is online                     27850000
UCBCHGS  EQU   X'40'               Device status is to be changed from  27900000
*                                  online to offline, and either        27950000
*                                  allocation is enqueued on devices    28000000
*                                  or the device is allocated.  (Bit 0  28050000
*                                  is also on.)                         28100000
UCBRESV  EQU   X'20'               The mount status of the volume on    28150000
*                                  this device is reserved              28200000
UCBUNLD  EQU   X'10'               Unload operator command has been     28250000
*                                  addressed to this device.  The       28300000
*                                  device is not yet unloaded.          28350000
UCBALOC  EQU   X'08'               Device is allocated                  28400000
UCBPRES  EQU   X'04'               The mount status of the volume on    28450000
*                                  this device is permanently resident  28500000
UCBSYSR  EQU   X'02'               System residence device or primary   28550000
*                                  console or active console            28600000
UCBDADI  EQU   X'01'               Standard tape labels have been       28650000
*                                  verified for this tape volume        28700000
*                                  or secondary console or              28750000
*                                  console status changing              28800000
*********************************************************************** 28850000
***      Binary device number                                        ** 28900000
*********************************************************************** 28950000
UCBCHAN  DS    FL2                 Binary device number                 29000000
*********************************************************************** 29050000
***      IOS startability flags                                      ** 29100000
*********************************************************************** 29150000
UCBSFLS  DS    0BL2                Device status flags                  29200000
UCBFLA   DS    BL1                 I/O supervisor flag byte A           29250000
UCBFL1   EQU   UCBFLA              Alias                                29300000
UCBDEFER EQU   X'80'               This device is temporarily unusable. 29350000
*                                  All I/O requests will be queued      29400000
*                                  until UCBDEFER is reset.             29450000
UCBNRY   EQU   X'40'               Device not ready                     29500000
UCBNOTRD EQU   UCBNRY              Alias                                29550000
UCBPERM  EQU   X'20'               The subchannel for this device       29600000
*                                  is unusable.                         29650000
UCBPSNS  EQU   X'10'               Pending sense operation              29700000
UCBSTRT  EQU   X'08'               IOS has issued a start subchannel    29750000
*                                  and received condition code 0.       29800000
*                                  If UCBHALT and UCBCLEAR are both     29850000
*                                  off, then UCBIOQ contains the        29900000
*                                  address of the IOQ for this I/O      29950000
*                                  request. The bit is turned off       30000000
*                                  when the requestor is to be          30050000
*                                  notified that the request is         30100000
*                                  complete.                            30150000
UCBHALT  EQU   X'04'               IOS has issued a halt subchannel     30200000
*                                  and received condition code 0.       30250000
*                                  If UCBCLEAR is off, then UCBIOQ      30300000
*                                  contains the address of the IOQ      30350000
*                                  associated with the halt request.    30400000
*                                  The bit is turned off when the       30450000
*                                  halt interrupt occurs.               30500000
UCBCLEAR EQU   X'02'               IOS has issued a clear subchannel    30550000
*                                  and received condition code 0.       30600000
*                                  UCBIOQ contains the address of the   30650000
*                                  IOQ associated with the clear        30700000
*                                  request. The bit is turned off when  30750000
*                                  the clear interrupt occurs.          30800000
UCBBOX   EQU   X'01'               This device has been forced offline  30850000
*                                  due to an error                      30900000
UCBFLB   DS    BL1                 I/O supervisor flag byte B           30950000
UCBINCPT EQU   X'80'               An intercept condition exists        31000000
*                                  requiring ERP processing and will    31050000
*                                  be given to the next normal I/O      31100000
*                                  request to the device. Intercept     31150000
*                                  conditions are a result of:          31200000
*                                    1) A secondary interruption status 31250000
*                                       with unit check and/or unit     31300000
*                                       exception set,                  31350000
*                                    2) an unsolicited interruption     31400000
*                                       status with unit check and      31450000
*                                       attention or device end set and 31500000
*                                       the attention table entry       31550000
*                                       indicates intercept, or         31600000
*                                    3) an unsolicited interruption     31650000
*                                       status with unit check and      31700000
*                                       the device-dependent EOS exit   31750000
*                                       requests intercept.             31800000
UCBNOPTH EQU   X'40'               Device has no operational paths.     31850000
*                                  The bit is turned off when an        31900000
*                                  unsolicited interrupt occurs or is   31950000
*                                  simulated.                           32000000
UCBNOCON EQU   X'20'               Device is not connected to a         32050000
*                                  subchannel                           32100000
UCBHILVL EQU   X'10'               Non-normal UCBLEVEL value has been   32150000
*                                  set                                  32200000
UCBHDET  EQU   X'08'               HOT-I/O detected, device boxed       32250000
*                                  or not recovered yet                 32300000
*        EQU   X'04'               Reserved - set to zero               32350000
*        EQU   X'02'               Reserved - set to zero               32400000
*        EQU   X'01'               Reserved - set to zero               32450000
*********************************************************************** 32500000
***      Pointer to the next UCB on the UCB chain                    ** 32550000
*********************************************************************** 32600000
UCBNXUCB DS    A                   Address of the next UCB on the UCB   32650000
*                                  chain                                32700000
UCBWGT   DS    B                   Flags                                32750000
UCBIN    EQU   X'80'               SYSIN                                32800000
UCBOUT   EQU   X'40'               SYSOUT                               32850000
UCBPUB   EQU   X'20'               Assumed that this device will be     32900000
*                                  allocated for a public volume        32950000
*                                  request                              33000000
UCBREW   EQU   X'10'               Rewind command has been addressed to 33050000
*                                  this magnetic device by I/O support  33100000
UCBMTPXP EQU   X'08'               Multiple exposure device             33150000
UCBVORSN EQU   X'04'               Vary command operator reason         33200000
*                                  indicator                            33250000
UCBVHRSN EQU   X'02'               Vary command hierarchy reason        33300000
*                                  indicator                            33350000
*        EQU   X'01'               Reserved - set to zero               33400000
         AIF   ('&SSMD' NE 'YES').UCB005                           @L7A 33450000
         DS    CL3                 Reserved                        @L7A 33500000
         AGO   .UCB006                                             @L7A 33550000
.UCB005  ANOP                                                      @L7A 33600000
UCBNAME  DS    CL3                 Device number (EBCDIC)               33650000
.UCB006  ANOP                                                      @L7A 33700000
*********************************************************************** 33750000
***      UCBTYP field - 4 bytes of device unique data                ** 33800000
*********************************************************************** 33850000
UCBTYP   DS    0BL4                Device type                          33900000
UCBTBYT1 DS    B                   Model bits                           33950000
UCB1FEA0 EQU   X'80'               Bit 0                                34000000
UCB1FEA1 EQU   X'40'               Bit 1                                34050000
UCB1FEA2 EQU   X'20'               Bit 2                                34100000
UCB1FEA3 EQU   X'10'               Bit 3                                34150000
UCB1FEA4 EQU   X'08'               Bit 4                                34200000
UCB1FEA5 EQU   X'04'               Bit 5                                34250000
UCB1FEA6 EQU   X'02'               Bit 6                                34300000
UCB1FEA7 EQU   X'01'               Bit 7                                34350000
UCBTBYT2 DS    B                   Option flags                         34400000
UCB2OPT0 EQU   X'80'               Flag 0                               34450000
UCB2OPT1 EQU   X'40'               Flag 1                               34500000
UCB2OPT2 EQU   X'20'               Flag 2                               34550000
UCB2OPT3 EQU   X'10'               Flag 3                               34600000
UCB2OPT4 EQU   X'08'               Flag 4                               34650000
UCB2OPT5 EQU   X'04'               Flag 5                               34700000
UCB2OPT6 EQU   X'02'               Flag 6                               34750000
UCBVLPWR EQU   X'02'               Volume requires alternate power      34800000
*                                  source device                        34850000
UCB2OPT7 EQU   X'01'               Flag 7                               34900000
UCBDVPWR EQU   X'01'               Device has alternate power source    34950000
UCBDVCLS DS    0B                  Same as UCBTBYT3                     35000000
UCBTBYT3 DS    B                   Class bits                           35050000
UCB3TAPE EQU   X'80'               Tape                                 35100000
UCB3COMM EQU   X'40'               Communications                       35150000
UCB3CTC  EQU   X'41'               Channel-to-channel adapter           35200000
UCB3DACC EQU   X'20'               Direct access                        35250000
UCB3DISP EQU   X'10'               Display                              35300000
UCB3UREC EQU   X'08'               Unit record                          35350000
UCB3CHAR EQU   X'04'               Character reader                     35400000
UCBRSV10 EQU   X'02'               Reserved                             35450000
UCBRSV11 EQU   X'01'               Reserved                             35500000
UCBUNTYP DS    0C                  Same as UCBTBYT4                     35550000
UCBTBYT4 DS    C                   Device code                          35600000
         AIF   ('&SSMD' EQ 'YES').UCB007                           @L7A 35650000
UCBEXTPT DS    0A                  Address of UCB common extension      35700000
*                                  (Valid only for AMODE 24)            35725000
.UCB007  ANOP                                                      @L7A 35750000
*********************************************************************** 35800000
***      I/O Supervisor flag byte                                    ** 35850000
*********************************************************************** 35900000
UCBFLC   DS    BL1                 I/O supervisor flag byte C           35950000
UCBATTP  EQU   X'80'               Attention pending                    36000000
UCBITFP  EQU   X'40'               Intercept condition pending          36050000
UCBUDE   EQU   X'20'               Unsolicited device end received      36100000
*        EQU   X'10'               Reserved - set to zero               36150000
UCBIVRS  EQU   X'08'               Intervention required message        36200000
*                                  issued                               36250000
UCBIVRR  EQU   X'04'               Intervention required message        36300000
*                                  is needed                            36350000
*        EQU   X'02'               Reserved - set to zero               36400000
UCBDDRSW EQU   X'01'               DDR switch pending on this device    36450000
         AIF   ('&SSMD' NE 'YES').UCB008                           @L7A 36500000
         DS    CL3                 Reserved                        @L7A 36550000
         AGO   .UCB009                                             @L7A 36600000
.UCB008  ANOP                                                      @L7A 36650000
UCBEXTP  DS    AL3                 Address of UCB common extension      36700000
*                                  (Valid for any AMODE)                36725000
.UCB009  ANOP                                                      @L7A 36750000
*                                                                       36800000
         AIF   ('&SSMD' EQ 'YES').UCB010                           @L7A 36850000
*                                                                       36900000
SRTEJBNR EQU   UCBJBNR             Alias                                36950000
SRTEMNT  EQU   UCBMONT             Alias                                37000000
SRTESTAT EQU   UCBSTAT             Alias                                37050000
SRTEONLI EQU   UCBONLI             Alias                                37100000
SRTECHGS EQU   UCBCHGS             Alias                                37150000
SRTERESV EQU   UCBRESV             Alias                                37200000
SRTEUNLD EQU   UCBUNLD             Alias                                37250000
SRTEALOC EQU   UCBALOC             Alias                                37300000
SRTEPRES EQU   UCBPRES             Alias                                37350000
SRTESYSR EQU   UCBSYSR             Alias                                37400000
SRTEDADI EQU   UCBDADI             Alias                                37450000
UCBFL2   EQU   UCBFL1              Alias                                37500000
*                                                                       37550000
.UCB010  ANOP                                                      @L7A 37600000
*                                                                       37650000
*********************************************************************** 37700000
*                                                                       37750000
*        UCB device-dependent segments start at label UCBDEV            37800000
*                                                                       37850000
UCBDEV   EQU   *                                                        37900000
*                                                                       37950000
*********************************************************************** 38000000
         AIF   ('&SSMD' EQ 'YES').UCB011                           @L7A 38050000
*********************************************************************** 38100000
*                                                                       38150000
*        UCB common extension                                           38200000
*                                                                       38250000
*        This extension is pointed to by the UCBEXTP field in the       38300000
*        common segment.                                           @L7C 38350000
*                                                                       38400000
UCBCMEXT DSECT ,                                                        38450000
*                                                                       38500000
*********************************************************************** 38550000
*                                                                       38600000
         IOSDUCBC                  Map common extension fields     @L7A 38650000
*                                                                       38700000
.UCB011  ANOP                                                      @L7A 38750000
         AIF   (&DCUCB(4) EQ 0).UCB012 Suppress DASD mapping       @L7A 38800000
         IECDUCBD ,                DASD UCB mapping macro          @L7A 38850000
.UCB012  ANOP                                                      @L7A 38900000
         AIF   (&DCUCB(1) EQ 0).UCB013 Suppress tape mapping       @L7A 38950000
         IECDUCBT ,                Tape UCB mapping macro          @L7A 39000000
.UCB013  ANOP                                                      @L7A 39050000
         AIF   (&DCUCB(6) EQ 0).UCB014 Suppress unit record map    @L7A 39100000
         IECDUCBU ,                Unit record UCB mapping macro   @L7A 39150000
.UCB014  ANOP                                                      @L7A 39200000
         AIF   (&DCUCB(5) EQ 0).UCB015 Suppress graphics mapping   @L7A 39250000
         IECDUCBG ,                Graphics UCB mapping macro      @L7A 39300000
.UCB015  ANOP                                                      @L7A 39350000
         AIF   (&DCUCB(3) EQ 0).UCB016 Suppress comm. mapping      @L7A 39400000
         IECDUCBE ,                Communications Equip. UCB map   @L7A 39450000
.UCB016  ANOP                                                      @L7A 39500000
         AIF   (&DCUCB(2) EQ 0).UCB017 Suppress CTC mapping        @L7A 39550000
         IECDUCBC ,                CTC UCB mapping macro           @L7A 39600000
.UCB017  ANOP                                                      @L7A 39650000
         MEND  , */                                                     39700000
*%UCBL2  :  ;                                                           39750000
*                                                                       39800000
*/********************************************************************/ 39850000
*/*                                                                  */ 39900000
*/*      UCB prefix                                                  */ 39950000
*/*                                                                  */ 40000000
*/********************************************************************/ 40050000
*                                                                       40100000
*DECLARE                                                                40150000
*%IF IHAUCB='PREFIX' %THEN                                              40200000
*    %GOTO UCBP1;                      /*                            */ 40250000
*  1 UCB      BASED(ADDR(UCBOB)-512) BDY(WORD), /* UCB prefix    @P1C*/ 40300000
*%GOTO UCBP2;                          /*                            */ 40350000
*%UCBP1: ;                             /*                            */ 40400000
*  1 UCB      BASED(UCBPFPTR) BDY(WORD), /* UCB prefix               */ 40450000
*%UCBP2: ;                             /*                            */ 40500000
*%IF IHAUCBSS^='YES' %THEN         /*                            @L7A*/ 40700000
*    %GOTO UCBP6A;                 /*                            @L7A*/ 40750000
*   2 *           CHAR(432),       /* Reserved                   @L7A*/ 40757100
*   2 UCBPXSEG,                    /* UCB prefix segment         @L7A*/ 40764200
*    3 UCBPXEXP,                   /* UCB prefix expansion area  @L7A*/ 40771300
*     4 UCBPXEST CHAR(0),          /* Start of prefix expansion area    40778400
*                                                                @L7A*/ 40785500
*    3 UCBPXOCE,                   /* UCB common extension area  @L7A*/ 40792600
*%INCLUDE SYSLIB(IOSDUCBC) NOSEG;  /*                            @L7A*/ 40800000
*%GOTO UCBP7;                      /*                            @L7A*/ 40850000
*%UCBP6A: ;                        /*                            @L7A*/ 40900000
*    3 *          CHAR(464),       /* Reserved                   @L7C*/ 40950000
*%UCBP7: ;                         /*                            @L7A*/ 41000000
*    3 UCBPXUSE,                   /* Used section of prefix         */ 41028800
*     4 UCBPXST    CHAR(0),        /* Start of used fields in prefix */ 41057600
*     4 UCBRSTEM   BIT(8),         /* Reset Event mask           @07C*/ 41086600
*     4 UCBMIHKY  FIXED(8),        /* MIH Time interval key      @L9C*/ 41093200
*/********************************************************************/ 41100000
*/*      IOS MIH control byte                                        */ 41150000
*/********************************************************************/ 41200000
*     4 UCBMIHTI   BIT(8) ABNORMAL,/* Missing Interrupt Handler byte */ 41250000
*      5 UCBMIHSS BIT(1),          /* Customer-specified scan interval  41300000
*                                     being used                     */ 41350000
*      5 UCBMIHPB BIT(1),          /* With bit set, Missing Interrupt   41400000
*                                     Handler checking of device is     41450000
*                                     bypassed for started I/O requests 41475000
*                                     for which idle with work queued   41500000
*                                     conditions are not detected    */ 41525000
*      5 UCBMIHR1 BIT(1),          /* Reserved - set to zero         */ 41550000
*      5 UCBMIHR2 BIT(1),          /* Reserved - set to zero         */ 41600000
*      5 UCBIOQRP BIT(1),          /* Pending I/O request condition  */ 41650000
*      5 UCBMIHMP BIT(1),          /* Message pending, to be DOM'D      41700000
*                                     during the next MIH scan       */ 41750000
*      5 UCBMIHIO BIT(1),          /* Clear subchannel scheduled by     41800000
*                                     MIH                            */ 41850000
*      5 UCBPGDEV BIT(1),          /* Device is being used for          41900000
*                                     paging                         */ 41950000
*/********************************************************************/ 42000000
*/*      IOS HOT I/O control byte                                    */ 42050000
*/********************************************************************/ 42100000
*     4 UCBHOTIO     BIT(8),       /* HOT-I/O indicator              */ 42150000
*      5 UCBHSCD BIT(1),           /* SCD associated with the UCB    */ 42200000
*      5 UCBHSOL BIT(1),           /* A solicited interrupt has         42250000
*                                     completed with other than DCC-3   42300000
*                                     since the last time HOT-I/O       42350000
*                                     detection was called           */ 42400000
*      5 UCBSUSOL BIT(1),          /* Indicates that the last           42420000
*                                     unsolicited interrupt occurred    42440000
*                                     when a request was outstanding,   42460000
*                                     and could have been induced       42480000
*                                                                @04A*/ 42500000
*      5 UCBINDHI BIT(1),          /* Indicates that an induced         42520000
*                                     hot I/O condition has been        42540000
*                                     detected on the device     @04A*/ 42560000
*      5 UCBHCHPR BIT(1),          /* Channel path recovery is          42580000
*                                     attempting to clear up a HOT-I/O  42600000
*                                     condition for this device      */ 42650000
*      5 UCBHCHPI BIT(3),          /* If UCBHCHPR is on, this is an     42700000
*                                     index into UCBCHPID, specifying   42750000
*                                     the channel path over which the   42800000
*                                     HOT-I/O condition was detected */ 42850000
*/********************************************************************/ 42900000
*/*   IOS UCB IOQ chains of I/O requests associated with this device */ 42950000
*/********************************************************************/ 43000000
*     4 UCBIOQF      PTR(31),      /* First request for this device  */ 43050000
*     4 UCBIOQL      PTR(31),      /* Last request for this device   */ 43100000
*/********************************************************************/ 43150000
*/*     Associated subchannel data                                   */ 43200000
*/********************************************************************/ 43250000
*     4 UCBSID       FIXED(31),    /* Subsystem-identification word     43300000
*                                     in connected subchannel (valid    43350000
*                                     only if UCBNOCON is not set)   */ 43400000
*      5 UCBSIDA FIXED(16),        /* X'0001'                    @L5A*/ 43450000
*      5 UCBSCHNO FIXED(16),       /* Subchannel number          @L5A*/ 43500000
*     4 UCBPMCW1     BIT(16),      /* Path management control word   */ 43550000
*      5 *         BIT(2),         /* Reserved - set to zero         */ 43600000
*      5 UCBISC    BIT(3),         /* Interruption subclass          */ 43650000
*      5 *         BIT(3),         /* Reserved - set to zero         */ 43700000
*      5 UCBENABL  BIT(1),         /* Subchannel enabled for            43750000
*                                     interruptions                  */ 43800000
*      5 UCBLM     BIT(2),         /* Limit mode checking state      */ 43850000
*      5 UCBMM     BIT(2),         /* Measurement mode state         */ 43900000
*        6 UCBMCMB  BIT(1),        /* Store measurements in Channel     43950000
*                                     Measurement Block              */ 44000000
*        6 UCBMDCTI BIT(1),        /* DCTI is to be stored in           44050000
*                                     Extended Status Word           */ 44100000
*      5 UCBDPMPM  BIT(1),         /* Dynamic pathing multiple          44150000
*                                     path state                     */ 44200000
*      5 *         BIT(2),         /* Reserved - set to zero         */ 44250000
*     4 UCBMBI       FIXED(16),    /* Measurement block index        */ 44300000
*     4 UCBLPM       BIT(8),       /* Logical path mask (LPM)        */ 44350000
*     4 *            PTR(8),       /* Reserved - set to zero         */ 44400000
*     4 UCBLPUM      BIT(8),       /* Last path used mask (LPUM)     */ 44450000
*     4 UCBPIM       BIT(8),       /* The path installed mask for this  44500000
*                                     subchannel                     */ 44550000
*     4 UCBCHPS CHAR(8),           /* The set of 8 channel paths        44600000
*                                     associated with this subchannel   44650000
*                                                                @H3A*/ 44700000
*      5 UCBCHPID(8) FIXED(8),     /* Array reference to each           44750000
*                                     channel path identifier (CHPID)   44800000
*                                     for this subchannel. (The bits    44850000
*                                     in UCBLPM, UCBLPUM and UCBPIM     44900000
*                                     map to the bytes in this array.   44950000
*                                     For example, a X'80' in UCBPIM    45000000
*                                     indicates the first byte in       45050000
*                                     this array contains a CHPID for   45100000
*                                     a path that is installed on the   45150000
*                                     associated device.)        @H3C*/ 45200000
*/********************************************************************/ 45250000
*/*     I/O Supervisor general fields                                */ 45300000
*/********************************************************************/ 45350000
*     4 UCBLEVEL     FIXED(8),     /* Highest level set in UCBLVMSK  */ 45400000
*     4 UCBIOSF1     BIT(8),       /* IOS flag byte                  */ 45450000
*      5 UCBRESVH  BIT(1),         /* Device reserved indicator      */ 45500000
*      5 UCBVALPH  BIT(1),         /* Path validation indicator      */ 45550000
*      5 UCBRESVP  BIT(1),         /* Reserve channel program pending*/ 45600000
*      5 UCBRRP    BIT(1),         /* Reserve/release pending        */ 45650000
*      5 UCBDPTH   BIT(1),         /* Dynamic pathing feature has been  45700000
*                                     initialized for this device    */ 45750000
*      5 UCBDPVAL  BIT(1),         /* Dynamic pathing validation        45800000
*                                     required                   @01C*/ 45850000
*      5 UCBDSTF   BIT(1),         /* Restart device state transition   45866600
*                                     flushing                   @05A*/ 45883200
*      5 UCBAPGID  BIT(1),         /* Alternate PGID established @06C*/ 45900000
*/********************************************************************/ 46000000
*/*     IOS MIH count and IOS level bit mask                         */ 46050000
*/********************************************************************/ 46100000
*     4 UCBMIHCT FIXED(15),        /* Count for Missing Interrupt    */ 46150000
*     4 UCBLVMSK BIT(32) BDY(WORD),/* UCB level bit mask             */ 46200000
*/********************************************************************/ 46250000
*/*     UCB lock word and pointer to the active IOQ element          */ 46300000
*/********************************************************************/ 46350000
*     4 UCBLOCK    FIXED(31),      /* Device lock word               */ 46400000
*     4 UCBIOQ     PTR(31),        /* Address of last queuing element   46450000
*                                     started, halted, or cleared for   46500000
*                                     this device. This field           46550000
*                                     contains a valid address only     46600000
*                                     when UCBSTRT, UCBHALT, or         46650000
*                                     UCBCLEAR are set on.           */ 46700000
*     4 UCBPFXND   CHAR(0);        /* End of prefix                  */ 46750000
*%DCL UCBCURPX CHAR;                                                    46800000
*%UCBCURPX='(ADDR(UCBPFXND)-ADDR(UCBPXST))'; /* Actual prefix data      46850000
*                                     length                         */ 46900000
*%DCL UCBPRFX CHAR;                                                     46950000
*%UCBPRFX='LENGTH(UCB)';           /* Total prefix data length       */ 47000000
*                                                                       47050000
*                                                                       47100000
*/********************************************************************/ 47150000
*/*                                                                  */ 47200000
*/*     UCB common segment                                           */ 47250000
*/*                                                                  */ 47300000
*/********************************************************************/ 47350000
*                                                                       47400000
*DECLARE                                                                47450000
*%IF IHAUCB='PREFIX' %THEN                                              47500000
*    %GOTO UCBP3;                      /*                            */ 47550000
*  1 UCBOB    BASED(UCBPTR) BDY(WORD),                                  47600000
*%GOTO UCBP4;                          /*                            */ 47650000
*%UCBP3: ;                             /*                            */ 47700000
*  1 UCBOB    DEF(UCBPFXND) BDY(WORD), /*                            */ 47750000
*%UCBP4: ;                             /*                            */ 47800000
*   2 UCBCMSEG    CHAR(0),         /* Start of common segment        */ 47850000
*   2 UCBJBNR     BIT(8) BDY(WORD),/* Flag byte                      */ 47900000
*/********************************************************************/ 47950000
*/*     Fields and flags used by allocation, access methods, etc.    */ 48000000
*/********************************************************************/ 48050000
*    3 UCBVRDEV BIT(1),            /* UCB for VIO device             */ 48100000
*    3 UCBJES3  BIT(1),            /* All volume mounting and device    48150000
*                                     management for this device is     48200000
*                                     controlled by JES3             */ 48250000
*    3 UCBDUC   BIT(1),            /* Display device unit check         48300000
*                                     detected during IPL            */ 48350000
*    3 UCBJ3DV  BIT(1),            /* Device is defined to JES3  @09A*/ 48400000
*    3 UCBOLDSM BIT(1),            /* OLTEP communicating directly      48450000
*                                     with the Mass Storage Control     48500000
*                                     (MSC), not through the Mass       48550000
*                                     Storage System Communicator       48600000
*                                     (MSSC)                         */ 48650000
*    3 UCBMMSGP BIT(1),            /* Mount message pending.  The       48700000
*                                     device has been selected by       48750000
*                                     device allocation, but no mount   48800000
*                                     message has been issued.       */ 48850000
*    3 UCBDCONS BIT(1) ABNORMAL,   /* Disabled console support          48900000
*                                     controls this console          */ 48950000
*    3 UCBMONT  BIT(1),            /* Volume to be mounted is to be     49000000
*                                     retained or contain a passed      49050000
*                                     data set.  (Set by device         49100000
*                                     allocation or data management  */ 49150000
*   2 UCBFL5      BIT(8),          /* Flags                          */ 49200000
*    3 UCBDCC   BIT(1),            /* Disconnect command chain device*/ 49250000
*    3 UCBAF    BIT(1),            /* Attention for this console        49300000
*                                     device is to be processed by      49350000
*                                     the communications task        */ 49400000
*     4 UCBAMV   BIT(1),           /* Successful comparison checking    49450000
*                                     of the access method catalog      49500000
*                                     and the VTOC (VSAM direct         49550000
*                                     access devices only)           */ 49600000
*    3 UCBSMS   BIT(1),            /* Data management flag       @L6C*/ 49650000
*    3 UCBVSDR  BIT(1),            /* Device has variable length        49700000
*                                     SDRs                           */ 49750000
*    3 UCBENVRD BIT(1),            /* Device returns environmental      49800000
*                                     data                           */ 49850000
*    3 UCBNALOC BIT(1),            /* This offline device is being      49900000
*                                     used by a system component.       49950000
*                                     The device status must not        50000000
*                                     change to online nor will it be   50050000
*                                     allocated.  The last path to      50100000
*                                     the device must not be VARY'd     50150000
*                                     offline.  The device is           50200000
*                                     unavailable for usage by          50250000
*                                     another system component which    50300000
*                                     processes offline devices.     */ 50350000
*    3 UCBALTCU BIT(1),            /* Device has an alternate control   50400000
*                                     unit address                   */ 50450000
*    3 UCBCUIR  BIT(1),            /* Indicates whether the device      50483300
*                                     is offline due to CUIR     @08A*/ 50516600
*/********************************************************************/ 50550000
*/*     UCB identification byte - contains hex FF                    */ 50600000
*/********************************************************************/ 50650000
*   2 UCBID       CHAR(1),         /* UCB identification (FF)        */ 50700000
*%DCL UCBSTND  CHAR;                                                    50750000
*%UCBSTND='''FF''X';               /* UCB identifier                 */ 50800000
*/********************************************************************/ 50850000
*/* Device status flags controlled by allocation, access methods, etc*/ 50900000
*/********************************************************************/ 50950000
*   2 UCBSTAT     BIT(8) ABNORMAL, /* Device status              @D1C*/ 51000000
*    3 UCBONLI  BIT(1),            /* Device is online               */ 51050000
*    3 UCBCHGS  BIT(1),            /* Device status is to be changed    51100000
*                                     from online to offline, and       51150000
*                                     either allocation is enqueued     51200000
*                                     on devices or the device is       51250000
*                                     allocated. (Bit 0 is also on.) */ 51300000
*    3 UCBRESV  BIT(1),            /* The mount status of the volume    51350000
*                                     on this device is reserved     */ 51400000
*    3 UCBUNLD  BIT(1) ABNORMAL,   /* Unload operator command has       51450000
*                                     been addressed to this device.    51500000
*                                     The device is not yet unloaded.*/ 51550000
*    3 UCBALOC  BIT(1),            /* Device is allocated            */ 51600000
*    3 UCBPRES  BIT(1),            /* The mount status of the volume    51650000
*                                     on this device is permanently     51700000
*                                     resident                       */ 51750000
*    3 UCBSYSR  BIT(1),            /* System residence device or        51800000
*                                     primary console or                51850000
*                                     active console                 */ 51900000
*    3 UCBDADI  BIT(1),            /* Standard tape lavels have been    51950000
*                                     verified for this tape volume     52000000
*                                     or secondary console or           52050000
*                                     console status changing        */ 52100000
*/********************************************************************/ 52150000
*/*      Binary device number                                        */ 52200000
*/********************************************************************/ 52250000
*   2 UCBCHAN     CHAR(2),         /* Binary device number           */ 52300000
*/********************************************************************/ 52350000
*/*      IOS startability flags                                      */ 52400000
*/********************************************************************/ 52450000
*   2 UCBSFLS     CHAR(2),         /* Device status flags            */ 52500000
*    3 UCBFLA      BIT(8),         /* I/O supervisor flag byte A     */ 52550000
*     4 UCBFL1      BIT(8),        /* Alias                          */ 52600000
*      5 UCBDEFER BIT(1),          /* This device is temporarily        52650000
*                                     unuseable. All I/O requests will  52700000
*                                     be queued until UCBDEFER is       52750000
*                                     reset.                         */ 52800000
*      5 UCBNRY   BIT(1),          /* Device not ready               */ 52850000
*       6 UCBNOTRD BIT(1),         /* Alias                          */ 52900000
*      5 UCBPERM  BIT(1),          /* The subchannel for this device    52950000
*                                     is unusable                    */ 53000000
*      5 UCBPSNS  BIT(1),          /* Pending sense operation        */ 53050000
*      5 UCBSTRT  BIT(1),          /* IOS has issued a start subchannel 53100000
*                                     and received condition code 0.    53150000
*                                     If UCBHALT and UCBCLEAR are both  53200000
*                                     off, then UCBIOQ contains the     53250000
*                                     address of the IOQ for this I/O   53300000
*                                     request. The bit is turned off    53350000
*                                     when the requestor is to be       53400000
*                                     notified that the request is      53450000
*                                     complete.                      */ 53500000
*      5 UCBHALT  BIT(1),          /* IOS has issued a halt subchannel  53550000
*                                     and received condition code 0.    53600000
*                                     If UCBCLEAR is off, then UCBIOQ   53650000
*                                     contains the address of the IOQ   53700000
*                                     associated with the halt request. 53750000
*                                     The bit is turned off when the    53800000
*                                     halt interrupt occurs.         */ 53850000
*      5 UCBCLEAR BIT(1),          /* IOS has issued a clear subchannel 53900000
*                                     and received condition code 0.    53950000
*                                     UCBIOQ contains the address of    54000000
*                                     the IOQ associated with the clear 54050000
*                                     request. The bit is turned off    54100000
*                                     when the clear interrupt occurs.  54150000
*                                                                    */ 54200000
*      5 UCBBOX   BIT(1),          /* This device has been forced       54250000
*                                     offline due to an error        */ 54300000
*    3 UCBFLB      BIT(8),         /* I/O supervisor flag byte B     */ 54350000
*     4 UCBINCPT BIT(1),           /* An intercept condition exists     54400000
*                                     requiring ERP processing and will 54450000
*                                     be given to the next normal I/O   54500000
*                                     request to the device. Intercept  54550000
*                                     conditions are a result of:       54600000
*                                      1) A secondary interruption      54650000
*                                         status with unit check and/or 54700000
*                                         unit exception set,           54750000
*                                      2) an unsolicited interruption   54800000
*                                         status with unit check and    54850000
*                                         attention or device end set   54900000
*                                         and the attention table entry 54950000
*                                         indicates intercept, or       55000000
*                                      3) an unsolicited interruption   55050000
*                                         status with unit check and    55100000
*                                         the device-dependent EOS exit 55150000
*                                         requests intercept.        */ 55200000
*     4 UCBNOPTH BIT(1),           /* Device has no operational paths.  55250000
*                                     The bit is turned off when an     55300000
*                                     unsolicited interrupt occurs or   55350000
*                                     is simulated.                  */ 55400000
*     4 UCBNOCON BIT(1),           /* Device is not connected to a      55450000
*                                     subchannel                     */ 55500000
*     4 UCBHILVL BIT(1),           /* Non-normal UCBLEVEL value         55550000
*                                     has been set                   */ 55600000
*     4 UCBHDET  BIT(1),           /* HOT-I/O detected, device boxed    55650000
*                                     or not recovered yet           */ 55700000
*     4 *        BIT(1),           /* Reserved - set to zero         */ 55750000
*     4 *        BIT(1),           /* Reserved - set to zero         */ 55800000
*     4 *        BIT(1),           /* Reserved - set to zero         */ 55850000
*/********************************************************************/ 55900000
*/*      Pointer to the next UCB on the UCB chain                    */ 55950000
*/********************************************************************/ 56000000
*   2 UCBNXUCB    PTR(31),         /* Address of next UCB on the UCB    56050000
*                                     chain                          */ 56100000
*   2 UCBWGT      BIT(8) BDY(WORD),/* Flags                          */ 56150000
*    3 UCBIN    BIT(1),            /* SYSIN                          */ 56200000
*    3 UCBOUT   BIT(1),            /* SYSOUT                         */ 56250000
*    3 UCBPUB   BIT(1),            /* Assumed that this device will     56300000
*                                     be allocated for a public         56350000
*                                     volume request                 */ 56400000
*    3 UCBREW   BIT(1),            /* Rewind command has been           56450000
*                                     addressed to this magmetic tape   56500000
*                                     device by I/O support          */ 56550000
*    3 UCBMTPXP BIT(1),            /* Multiple exposure device       */ 56600000
*    3 UCBVORSN BIT(1),            /* Vary command operator reason      56650000
*                                     indicator                      */ 56700000
*    3 UCBVHRSN BIT(1),            /* Vary command hierarchy reason     56750000
*                                     indicator                      */ 56800000
*    3 *        BIT(1),            /* Reserved - set to zero         */ 56850000
*%IF IHAUCBSS^='YES' %THEN         /*                            @L7A*/ 56900000
*    %GOTO UCBP8;                  /*                            @L7A*/ 56950000
*   2 *           CHAR(3),         /* Reserved                   @L7A*/ 57000000
*%GOTO UCBP9;                      /*                            @L7A*/ 57050000
*%UCBP8: ;                         /*                            @L7A*/ 57100000
*   2 UCBNAME     CHAR(3) BDY(WORD,2), /* Device number (EBCDIC)     */ 57150000
*%UCBP9: ;                         /*                            @L7A*/ 57200000
*/********************************************************************/ 57250000
*/*      UCBTYP field - 4 bytes of device unique data                */ 57300000
*/********************************************************************/ 57350000
*   2 UCBTYP      CHAR(4) BDY(WORD), /* Device type                  */ 57400000
*    3 UCBTBYT1    BIT(8),         /* Model bits                     */ 57450000
*     4 UCB1FEA0 BIT(1),           /* Bit 0                          */ 57500000
*     4 UCB1FEA1 BIT(1),           /* Bit 1                          */ 57550000
*     4 UCB1FEA2 BIT(1),           /* Bit 2                          */ 57600000
*     4 UCB1FEA3 BIT(1),           /* Bit 3                          */ 57650000
*     4 UCB1FEA4 BIT(1),           /* Bit 4                          */ 57700000
*     4 UCB1FEA5 BIT(1),           /* Bit 5                          */ 57750000
*     4 UCB1FEA6 BIT(1),           /* Bit 6                          */ 57800000
*     4 UCB1FEA7 BIT(1),           /* Bit 7                          */ 57850000
*    3 UCBTBYT2    BIT(8),         /* Option flags                   */ 57900000
*     4 UCB2OPT0 BIT(1),           /* Flag 0                         */ 57950000
*     4 UCB2OPT1 BIT(1),           /* Flag 1                         */ 58000000
*     4 UCB2OPT2 BIT(1),           /* Flag 2                         */ 58050000
*     4 UCB2OPT3 BIT(1),           /* Flag 3                         */ 58100000
*     4 UCB2OPT4 BIT(1),           /* Flag 4                         */ 58150000
*     4 UCB2OPT5 BIT(1),           /* Flag 5                         */ 58200000
*     4 UCB2OPT6 BIT(1),           /* Flag 6                         */ 58250000
*      5 UCBVLPWR BIT(1),          /* Volume requires alternate power   58300000
*                                     source device                  */ 58350000
*     4 UCB2OPT7 BIT(1),           /* Flag 7                         */ 58400000
*      5 UCBDVPWR BIT(1),          /* Device has alternate power        58450000
*                                     source                         */ 58500000
*    3 UCBTBYT3    BIT(8),         /* Class bits                     */ 58550000
*     4 UCBDVCLS    BIT(8),        /* Same as UCBTBYT3               */ 58600000
*      5 UCB3TAPE BIT(1),          /* Tape                           */ 58650000
*      5 UCB3COMM BIT(1),          /* Communications                 */ 58700000
* %UCB3CTC='''41''X';              /* Channel-to-channel adapter     */ 58750000
*      5 UCB3DACC BIT(1),          /* Direct access                  */ 58800000
*      5 UCB3DISP BIT(1),          /* Display                        */ 58850000
*      5 UCB3UREC BIT(1),          /* Unit record                    */ 58900000
*      5 UCB3CHAR BIT(1),          /* Character reader               */ 58950000
*      5 UCBRSV10 BIT(1),          /* Reserved                       */ 59000000
*      5 UCBRSV11 BIT(1),          /* Reserved                       */ 59050000
*    3 UCBTBYT4    CHAR(1),        /* Device code                    */ 59100000
*     4 UCBUNTYP    CHAR(1),       /* Same as UCBTBYT4               */ 59150000
*%IF IHAUCBSS^='YES' %THEN         /*                            @L7A*/ 59200000
*    %GOTO UCBP10;                 /*                            @L7A*/ 59250000
*   2 *           CHAR(4),         /*                            @L7A*/ 59300000
*%GOTO UCBP11;                     /*                            @L7A*/ 59350000
*%UCBP10: ;                        /*                            @L7A*/ 59400000
*   2 UCBEXTPT    PTR(31),         /* Address of UCB common extension   59433300
*                                     (Valid only for AMODE 24)      */ 59466600
*%UCBP11: ;                        /*                            @L7A*/ 59500000
*/********************************************************************/ 59550000
*/*      I/O Supervisor flag byte                                    */ 59600000
*/********************************************************************/ 59650000
*    3 UCBFLC      BIT(8),         /* I/O supervisor flag byte C     */ 59700000
*     4 UCBATTP  BIT(1),           /* Attention pending              */ 59750000
*     4 UCBITFP  BIT(1),           /* Intercept condition pending    */ 59800000
*     4 UCBUDE   BIT(1),           /* Unsolicited device end            59850000
*                                     received                       */ 59900000
*     4 *        BIT(1),           /* Reserved - set to zero         */ 59950000
*     4 UCBIVRS  BIT(1),           /* Intervention required message     60000000
*                                     issued                         */ 60050000
*     4 UCBIVRR  BIT(1),           /* Intervention required message     60100000
*                                     is needed                      */ 60150000
*     4 *        BIT(1),           /* Reserved - set to zero         */ 60200000
*     4 UCBDDRSW BIT(1),           /* DDR switch pending on this        60250000
*                                     device                         */ 60300000
*%IF IHAUCBSS^='YES' %THEN         /*                            @L7A*/ 60350000
*    %GOTO UCBP12;                 /*                            @L7A*/ 60400000
*    3 *           CHAR(3),        /* Reserved                   @L7A*/ 60450000
*%GOTO UCBP13;                     /*                            @L7A*/ 60500000
*%UCBP12: ;                        /*                            @L7A*/ 60550000
*    3 UCBEXTP     PTR(24),        /* Address of UCB common extension   60583300
*                                     (Valid for any AMODE)          */ 60616600
*%UCBP13: ;                        /*                            @L7A*/ 60650000
*/*                                                                  */ 60700000
*/********************************************************************/ 60750000
*/*                                                                  */ 60800000
*/*      UCB device dependent segments start at UCBDEV.              */ 60850000
*/*                                                                  */ 60900000
*   2 UCBDEV      CHAR(0) BDY(WORD);                                    60950000
*/*                                                                  */ 61000000
*/********************************************************************/ 61050000
*%IF IHAUCBSS='YES' %THEN          /*                            @L7A*/ 61100000
*    %GOTO UCBP14;                 /*                            @L7A*/ 61150000
*%UCBP14A: ;                       /* If this unreferenced label is     61200000
*                                     removed, then the PLS compiler    61250000
*                                     will not print the next block     61300000
*                                     comment                    @L7A*/ 61350000
*/********************************************************************/ 61400000
*/*                                                                  */ 61450000
*/*      UCB common extension                                        */ 61500000
*/*                                                                  */ 61550000
*/*      This extension is pointed to by the UCBEXTP field in the    */ 61600000
*/*      common segment.                                         @L7C*/ 61650000
*/*                                                                  */ 61700000
*DECLARE                                                                61750000
*  1 UCBCMEXT BASED(UCBEXTP) BDY(WORD), /*                           */ 61800000
*                                                                       61850000
*/********************************************************************/ 61900000
*/*                                                                  */ 61950000
*%INCLUDE SYSLIB(IOSDUCBC) NOSEG;  /* Common extension fields    @L7A*/ 62000000
*    4 *          CHAR(0);         /* End of common extension    @L7A*/ 62050000
*%UCBP14: ;                        /*                            @L7A*/ 62100000
*                                                                       62150000
*/********************************************************************/ 62200000
*/*                                                                  */ 62250000
*/*      Declares for UCB constants                                  */ 62300000
*/*                                                                  */ 62350000
*/********************************************************************/ 62400000
*                                                                       62450000
*   DECLARE               /* Constants describing the device classes    62500000
*                            found in UCBTBYT3                       */ 62550000
*     UCBTAPE  BIT(8)  CONSTANT('80'X), /* Tape devices              */ 62600000
*     UCBCOMM  BIT(8)  CONSTANT('40'X), /* Communications devices    */ 62650000
*     UCBCTC   BIT(8)  CONSTANT('41'X), /* Channel-to-channel devices*/ 62700000
*     UCBDACC  BIT(8)  CONSTANT('20'X), /* Direct access devices     */ 62750000
*     UCBDISP  BIT(8)  CONSTANT('10'X), /* Display devices           */ 62800000
*     UCBUREC  BIT(8)  CONSTANT('08'X), /* Unit record devices       */ 62850000
*     UCBCHAR  BIT(8)  CONSTANT('04'X); /* Character reader devices  */ 62900000
*   DECLARE               /* Constants used to test the limits of the   62950000
*                            UCBLM field                             */ 63000000
*     UCBLNONE BIT(2)  CONSTANT('00'B), /* No limit mode checking    */ 63050000
*     UCBLGTE  BIT(2)  CONSTANT('01'B), /* Data address must be greater 63100000
*                                          than or equal to the limit*/ 63150000
*     UCBLLT   BIT(2)  CONSTANT('10'B); /* Data address must be less    63200000
*                                          than the limit            */ 63250000
*%IF IHAUCB='PREFIX' %THEN                                              63300000
*    %GOTO UCBP5;                      /*                            */ 63350000
*DECLARE UCBBGN   BASED(UCBPTR-512) CHAR(536) BDY(WORD);                63400000
*%GOTO UCBP6;                          /*                            */ 63450000
*%UCBP5: ;                             /*                            */ 63500000
*DECLARE UCBBGN   BASED(UCBPFPTR) CHAR(536) BDY(WORD); /*            */ 63550000
*%UCBP6: ;                             /*                            */ 63600000
*DECLARE UCBPFXLN FIXED(31) CONSTANT(512); /* Length of UCB prefix   */ 63650000
*%IF IHAUCBAC^='NO' %THEN                                               63700000
*    %GOTO UCBL21A;                    /* Generate DASD mapping  @L7A*/ 63750000
*%IF IHAUCBDA^='YES' %THEN                                              63800000
*    %GOTO UCBL21;                     /* Suppress DASD mapping  @L7A*/ 63850000
*%UCBL21A : ;                          /*                        @L7A*/ 63900000
*%INCLUDE SYSLIB(IECDUCBD) NOSEG;      /* DASD UCB mapping macro @L7A*/ 63950000
*%UCBL21 : ;                           /*                        @L7A*/ 64000000
*%IF IHAUCBAC^='NO' %THEN                                               64050000
*    %GOTO UCBL22A;                    /* Generate tape mapping  @L7A*/ 64100000
*%IF IHAUCBMT^='YES' %THEN                                              64150000
*    %GOTO UCBL22;                     /* Suppress tape mapping  @L7A*/ 64200000
*%UCBL22A : ;                          /*                        @L7A*/ 64250000
*%INCLUDE SYSLIB(IECDUCBT) NOSEG;      /* Tape UCB mapping macro @L7A*/ 64300000
*%UCBL22 : ;                           /*                        @L7A*/ 64350000
*%IF IHAUCBAC^='NO' %THEN                                               64400000
*    %GOTO UCBL23A;                    /* Generate UR mapping    @L7A*/ 64450000
*%IF IHAUCBUR^='YES' %THEN                                              64500000
*    %GOTO UCBL23;                     /* Suppress UR mapping    @L7A*/ 64550000
*%UCBL23A : ;                          /*                        @L7A*/ 64600000
*%INCLUDE SYSLIB(IECDUCBU) NOSEG;      /* Unit record mapping    @L7A*/ 64650000
*%UCBL23 : ;                           /*                        @L7A*/ 64700000
*%IF IHAUCBAC^='NO' %THEN                                               64750000
*    %GOTO UCBL24A;                    /* Generate GR mapping    @L7A*/ 64800000
*%IF IHAUCBGR^='YES' %THEN                                              64850000
*    %GOTO UCBL24;                     /* Suppress GR mapping    @L7A*/ 64900000
*%UCBL24A : ;                          /*                        @L7A*/ 64950000
*%INCLUDE SYSLIB(IECDUCBG) NOSEG;      /* Graphics UCB mapping   @L7A*/ 65000000
*%UCBL24 : ;                           /*                        @L7A*/ 65050000
*%IF IHAUCBAC^='NO' %THEN                                               65100000
*    %GOTO UCBL25A;                    /* Generate CE mapping    @L7A*/ 65150000
*%IF IHAUCBCE^='YES' %THEN                                              65200000
*    %GOTO UCBL25;                     /* Suppress CE mapping    @L7A*/ 65250000
*%UCBL25A : ;                          /*                        @L7A*/ 65300000
*%INCLUDE SYSLIB(IECDUCBE) NOSEG;      /* Comm equip mapping     @L7A*/ 65350000
*%UCBL25 : ;                           /*                        @L7A*/ 65400000
*%IF IHAUCBAC^='NO' %THEN                                               65450000
*    %GOTO UCBL26A;                    /* Generate CTC mapping   @L7A*/ 65500000
*%IF IHAUCBCT^='YES' %THEN                                              65550000
*    %GOTO UCBL26;                     /* Suppress CTC mapping   @L7A*/ 65600000
*%UCBL26A : ;                          /*                        @L7A*/ 65650000
*%INCLUDE SYSLIB(IECDUCBC) NOSEG;      /* CTC UCB mapping macro  @L7A*/ 65700000
*%UCBL26 : ;                           /*                        @L7A*/ 65750000
*@SPACE(2);                            /*                        @L7A*/ 65800000
*%DEACT IHAUCB;                        /*                        @L7A*/ 65850000
*%DEACT IHAUCBAC;                      /*                        @L7A*/ 65900000
*%DEACT IHAUCBMT;                      /*                        @L7A*/ 65950000
*%DEACT IHAUCBCT;                      /*                        @L7A*/ 66000000
*%DEACT IHAUCBCE;                      /*                        @L7A*/ 66050000
*%DEACT IHAUCBDA;                      /*                        @L7A*/ 66100000
*%DEACT IHAUCBGR;                      /*                        @L7A*/ 66150000
*%DEACT IHAUCBUR;                      /*                        @L7A*/ 66200000
*%DEACT IHAUCBSS;                      /*                        @L7A*/ 66250000
