*                                                                               
*  @IPLPARM -- This data area is set up by the IPL module and is                
*              passed on a temporary stack to the kernel.  It                   
*              basically tells the kernel about the data that has               
*              been set up by the IPL routine.                                  
*                                                                               
         SPACE 2                                                                
@IPLPARM RECORD BEGIN                                                           
@IPLKLOC DS    A             Starting address of the Kernel                     
@IPLKLEN DS    A             Length of the Kernel                               
@IPLMLOC DS    A             Location of the Kernel map                         
@IPLMLEN DS    A             Length of the Kernel map                           
@IPLSLOC DS    A             Location of the V=R stack (16 pages)               
         END   ,                                                                
