IXRT     RECORD BEGIN                                                           
*                                                                               
*  INDEX RECORD TABLE ENTRY                                                     
*                                                                               
IXRTLINK LELEM PFX=IXRT                Link of IXRTs                            
IXRTIXR  DS    A                       VIRTUAL ADDRESS OF THIS IXR              
IXRTFSID DS    X                       FILE-SYSTEM ID                           
IXRTRCNO DS    XL3                     RECORD NO. IN THIS SLOT                  
IXRTSNO  DS    X                       Slot number of this IXRT                 
IXRTMSTR DS    XL3                     MASTER IXR NO. FOR FILE                  
IXRTFNO  DS    H                       Resource number for this slot            
IXRTNEXT DS    0F                                                               
         END   ,                                                                
