*******************************************************************             
*                                                                 *             
*    @JSDALLO - Parameters for JES dynamic allocation routine     *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
@JSDALLO RECORD BEGIN                                                           
@JSDPARM DS    A                       Pointer to @JSALLO parm area             
         END   ,                                                                
         SPACE 3                                                                
*******************************************************************             
*                                                                 *             
*    JSALPARM - JES device allocation parameters                  *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
@JSALLO  RECORD BEGIN                                                           
@JSDDNM  DS    CL8                     DD name                                  
@JSRTN   DS    H                       Return code from SVC 99                  
@JSERR   DS    H                       Error code from SVC 99                   
@JSRSN   DS    H                       Reason code from SVC 99                  
*                                                                               
@JSFLAG  FLAG  ,                                                                
         FLAG  @JSINTR                 Internal Reader                          
         FLAG  @JSHOLD                 Output hold                              
*                                                                               
*  The following are ignored for Internal Reader requests                       
*                                                                               
         DS    X                       Reserved                                 
@JSCLAS  DS    C                       Sysout class                             
@JSCOPY  DS    X                       Copies                                   
@JSFORM  DS    CL4                     Forms                                    
@JSCHAR  DS    4CL4                    Chars                                    
@JSFLAS  DS    CL4                     Forms flash                              
@JSFCB   DS    CL4                     Fcb                                      
@JSDEST  DS    CL8                     Destination                              
         END   ,                                                                
