         MACRO                                                                  
&L       LKCRE &NAME,&TYPE=NOSPIN,&NAMEA=                                       
         AIF   ('&TYPE' EQ 'NOSPIN').OK,('&TYPE' EQ 'SPIN').OK                  
         MNOTE 8,'TYPE must be either SPIN or NOSPIN'                           
         MEXIT ,                                                                
.OK      ANOP  ,                                                                
&L       PSET  @LOCKCRE                                                         
         AIF   ('&NAMEA' NE '').NAMEA                                           
         PMOV  @LOCKNAM,=CL16'&NAME',SLEN=16                                    
         AGO   .SPIN                                                            
.NAMEA   ANOP  ,                                                                
         PMOV  @LOCKNAM,&NAMEA,SLEN=16                                          
.SPIN    ANOP  ,                                                                
         AIF   ('&TYPE' EQ 'NOSPIN').NOSPIN                                     
         SET   @LFSPIN                                                          
.NOSPIN  ANOP  ,                                                                
         VCALL LKCRE                                                            
         MEND                                                                   
