NTRY     RECORD BEGIN                                                           
CNTAMXL  EQU    264                MAx len of account entry                     
CNTFMXL  EQU    297                Max len of account entry                     
         DS     0S(CFSBMXNT-CNTAMXL),0S(CFSBMXNT-CNTFMXL)                       
CNTAMXSZ EQU    5                  Maximum length of account name               
CNTFMXSZ EQU    CFSBNMSZ           Maximum length of file name                  
**                                                                              
NTRYSTRT DS     0X                                                              
NTRYLEN  DS     AL(OL)             Total length of entry                        
NTRYOFFB DS     AL(BL)             Offspring pointer (block)                    
NTRYOFFN DS     AL(OL)             = (offset)                                   
NTRYDATB DS     AL(BL)             Data pointer (block)                         
NTRYDATN DS     AL(OL)             = (offset)                                   
NTRYVAR  DS     0X                                                              
*                                                                               
* FILE CATALOG ACCOUNT ENTRY                                                    
*                                                                               
NTGNAME  DS    XL(CNTAMXSZ)        Account                                      
NTGMXSP  DS    XL3                 Max space allowed for account                
NTGUSSP  DS    XL3                 Space already used by account                
NTGFLRB  DS     AL(BL)             File root pointer (block)                    
NTGFLRN  DS     AL(OL)             = (offset)                                   
NTGFLG   FLAG  ,                   Permits for public                           
         FLAG  (NTGFRO,FRO)  (PUBLIC)        READ ONLY                          
         FLAG  (NTGFRW,FRW)  (PUBLIC)        READ & WRITE                       
         FLAG  (NTGFRP,FRP)  (PUBLIC)        READ & APPEND                      
         FLAG  (NTGFAO,FAO)  (PUBLIC)        APPEND ONLY                        
NTGMEMBR DS    0X                  Members start here                           
NTRYGR   EQU    NTRYSTRT,*-NTRYSTRT,C'R'                                        
*                                                                               
         ORG    NTRYVAR                                                         
*                                                                               
* FILE CATALOG FILE ENTRY                                                       
*                                                                               
NTFLOC   DS    XL3                 Location of file index                       
NTFCNT   DS    XL3                 Number of blocks (non-ixr)                   
NTFCODE  FLAG  ,                   File flags                                   
         FLAG  NTFCLP              Only clp can attach this file                
         FLAG  NTFSFORM            User info is format data                     
         FLAG  NTFNOCLP            Clp can't change this file                   
         FLAG  NTFNIXR             Non-ixr file                                 
         FLAG  NTFSPI              Only spires can attach file                  
         FLAG  NTFHYBR             IXR/Non-IXR hybrid file type                 
NTFFLGP  FLAG  ,                   Permits for public                           
         FLAG  (NTFPFRO,FRO)  (PUBLIC)       READ ONLY                          
         FLAG  (NTFPFRW,FRW)  (PUBLIC)       READ & WRITE                       
         FLAG  (NTFPFRP,FRP)  (PUBLIC)       READ & APPEND                      
         FLAG  (NTFPFAO,FAO)  (PUBLIC)       APPEND ONLY                        
         FLAG  (NTFPSHR,FSHR) (PUBLIC)       SHARE ONLY                         
NTFFLGO  FLAG  ,                   Permits for owner                            
         FLAG  (NTFOFRO,FRO)  (OWNER)        READ ONLY                          
         FLAG  (NTFOFRW,FRW)  (OWNER)        READ & WRITE                       
         FLAG  (NTFOFAO,FAO)  (OWNER)        APPEND ONLY                        
         FLAG  (NTFOFRP,FRP)  (OWNER)        READ & APPEND                      
NTFCRDT  DS    XL4                 Creation date & time                         
NTFLSDT  DS    XL4                 Last reference date & time                   
NTFUINFO DS    XL4                 User info - set by control 14                
NTFLNMSZ DS    X                   Length of file name                          
NTFLNAME DS    0X                  File name here                               
NTRYFL   EQU    NTRYSTRT,*-NTRYSTRT,C'R'                                        
*        MEMBERS START HERE AFTER FILE NAME                                     
         END   ,                                                                
         SPACE  2                                                               
NTRYXTND RECORD BEGIN                                                           
NTRYXST  DS     0X                 Start of extended_data                       
NTRYXLEN DS     AL(OL)             Len of extended_data entry                   
CNTXFXLN EQU    *-NTRYXST          Fixed overhead length                        
NTRYXPER DS     0X                 Permits start here                           
         END    ,                                                               
                                                                                
NTRYPR   RECORD BEGIN                                                           
*                                                                               
* FILE CATALOG PERMIT ENTRY                                                     
*      APPENDED TO ACCOUNT AND FILE ENTRYS                                      
*                                                                               
NTPNAME  DS    XL6                     PERMIT MEMBER ACCOUNT                    
NTPFLG   FLAG  ,                       PERMIT FLAGS                             
         FLAG  (NTPFRO,FRO)                  READ ONLY                          
         FLAG  (NTPFRW,FRW)                  READ & WRITE                       
         FLAG  (NTPFRP,FRP)                  READ & APPEND                      
         FLAG  (NTPFAO,FAO)                  APPEND ONLY                        
         FLAG  (NTPFAC,FAC)                  PERMIT ACCESS                      
         END   ,                                                                
