*                                                                               
*  This DSECT is copied only for INTERNAL monitor programs.                     
*  Otherwise it is a private area                                               
*                                                                               
PAGCEL   RECORD BEGIN                                                           
PAGCELHD  DS   A                       Head of list of cells                    
PAGCELAMT DS   A                       Number of free cells                     
PAGCELID  DS   CL4                     ID type                                  
*  PCBs waiting for free cells                                                  
PAGCELAS  LHEAD PFX=PAGCEL             ASBs waiting for free cells              
PAGCELXTR DS   A                       Extra cells available                    
PAGCELLEN DS   H                       Length of this cell type                 
PAGCELBIT DS   X                       Wait/post resource bit                   
          DS   X                       - Available -                            
PAGCELNXT DS   0A                      Next cell pool                           
         END   ,                                                                
         EJECT                                                                  
PAGCB    RECORD BEGIN                  Real/External Mem Mgmgt Ctrl             
PAGCBID  DC    CL8'PAGCB'              Self identifying tag                     
PAGSTPTR DS    A                       Pointer to stats block                   
         DS    3A                      - Available -                            
*                                                                               
*  Common memory management                                                     
*                                                                               
PAGCASB  DS    A                       Common memory AS block                   
         DS    4A                      - Available -                            
         SPACE 2                                                                
*                                                                               
*  Routine addresses                                                            
*                                                                               
PAGLKOB  DS    A                       Lock obtain addr                         
PAGLKREL DS    A                       Lock release addr                        
PAGRESLV DS    A                       Address of internal resolve              
         DS    A                       - Available -                            
         EJECT ,                                                                
*                                                                               
* Frame management                                                              
*                                                                               
PAGFRAL  DS    A                       Free frame lock word                     
PAGSWAPL DS    A                       Swap lock word                           
PAGPFTO  DS    A                       Page Frame Table Origin (VA)             
PAGFRAN  DS    A                       Number of frames in machine              
         DS    A                       - Available -                            
PAGFIXCNT DS   A                       Number of frames for paging              
PAGUFHD  LHEAD PFX=PAGUF               NON HOST-FIXED FRAMES                    
*                                                                               
PAGFTCNT DS    A                  (CS) Total free frames (FCNT+FRC)             
PAGFHEAD LHEAD PFX=PAGF                AVAIL FRAME LIST                         
*                                                                               
PAGLASB  LHEAD PFX=PAGL                LOGICALLY SWAPPED ASBS                   
PAGLIP   LHEAD PFX=PAGLI               LOGICALLY OUT - IN PROGRESS              
PAGFLS   DS    A                       | frame count                            
PAGRSCB  LHEAD PFX=PAGR                SWAPPED, NOT-RECLAIMED SWAPS             
PAGFRC   DS    A                       | frame count                            
*                                                                               
PAGFWT   LHEAD PFX=PAGFW               PCBS WAITING FOR FRAMES                  
*  This next field is incremented when a "notified" address space               
*  has its frames taken, or when an address space which has its                 
*  frames taken is "notified".  This field is decremented when                  
*  frames are allocated for an address space as it is being                     
*  prepared for swap in.                                                        
PAGFWSI  DS    A                       Frames waiting swap-in                   
PAGFSOIP DS    A                       Frames w/ swap-out in progress           
PAGASIN  DS    A                  (CS) Number of ASBs swapped in                
PAGFRES  DS    A                  (CS) Number of 'reserved' frames              
*                                                                               
PAGMEG   DS    A                       Number of Meg in address space           
PAGSEGP  DS    H                       Number of pages for segment              
*                                        and shadow-segment tables              
PAGSEGL  DS    H                       Length of hardware seg table             
PAGFWAIT FLAG  ,                                                                
         FLAG  PAGFWFRA                Frame waiters to resume                  
         FLAG  PAGFWXP                 eXternal frame waiters to res            
         FLAG  PAGFWIOP                Page I/O cell waiters to res             
         FLAG  PAGFWIOS                Swap I/O cell waiters to res             
         FLAG  PAGFWASN                ASN waiters to resume                    
PAGSKEY  DS    X                       Storage key for paging reads             
         DS    2X                      - Available -                            
         DS    A                       - Available -                            
*-                                                                              
*-       Long term frame management.                                            
*-                                                                              
PAGMINFR DS    A                   Minimum suggested frame use                  
PAGMAXFR DS    A                   Maximum suggested frame use                  
         DS    A                   Reserved                                     
PAGSRHI  DS    E                       Swap rate high (float)                   
PAGSRLO  DS    E                       Swap rate low  (float)                   
PAGSRAVG DS    E                       Exp avg of swap rate (float)             
PAGSRATE DS    E                       Exponential avg parm (float)             
PAGSRMHI DS    E                       High Swap rate multiplier                
PAGSRMLO DS    E                       Low  Swap rate multiplier                
PAGSRTHR DS    A                       Long term freeing threshold              
PAGLTRT  DS    D                       Real time at last interval               
PAGLTST  DS    D                       Swap time at last interval               
PAGLTCNT DS    A                       Frames swapped at last interval          
PAGLTADJ DS    A                  (CS) Frames to long term get/free             
*                                                                               
*  Reserved frame calculations                                                  
*                                                                               
PAGRESM  DS    E                       Slope                                    
PAGRESX0 DS    E                       X-offset                                 
PAGRESB  DS    E                       Intercept                                
PAGRESMX DS    H                       Max                                      
PAGRESMN DS    H                       Min                                      
PAGRESAMT DS   A                       Actual reserve amount                    
         DS    A                       - Available -                            
*                                                                               
*  Working set management                                                       
*                                                                               
PAGMNHST DS    A                       Minimum history val                      
PAGGMHST DS    A                       Global minimum history val               
         DS    A                       - Available -                            
*                                                                               
*  Swap management                                                              
*                                                                               
PAGSWECB DS    A                       ECB for swap address space               
         DS    2A                      - Available -                            
         SPACE 2                                                                
*                                                                               
*  Paging I/O control-block cell management                                     
*                                                                               
PAGCELLK DS    A                       Lock ID for page/swap cells              
PAGCEL1  EQU   PAGPGCEL                                                         
PAGPGCEL DS    XL(L'PAGCEL)            Paging cell mgmt                         
*                                                                               
*  Swapping I/O control-block cell management                                   
*                                                                               
PAGSWCEL DS    XL(L'PAGCEL)            Swapping cell mgmt                       
PAGSWXL  DS    H                       Length of frame extent                   
PAGSWXTL DS    H                       Total swap extent length                 
PAGSWXN  DS    H                       Number of frames in extent               
PAGSWAVG DS    H                       Average working set size                 
         DS    H                       - Available -                            
*                                                                               
* ASN management                                                                
*                                                                               
PAGASNL  DS    A                       Lock for ASN manipulation                
PAGATO   DS    A                       Authority table origin (RA)              
PAGATL   DS    H                       Authority table length                   
         DS    H                       - Available -                            
PAGASNW  LHEAD PFX=PAGASN              Addr spaces waiting for ASN              
PAGAFTO  DS    A                       ASN First Table Origin (VA)              
PAG1ASN  DS    H                       First available ASN                      
PAGTASN  DS    H                       Total number of ASNs                     
PAGAVASN DS    A                       | number available                       
PAGASNF  FLAG  ,                                                                
         FLAG  PAGFASNL                ASN table being updated -                
         DS    3X                      - Available -                            
         DS    A                       - Available -                            
         SPACE 2                                                                
*                                                                               
*  External paging frame management                                             
*                                                                               
PAGXPDS  DS    A                       Data set group descriptor                
PAGXPL   DS    A                       | lock word                              
PAGXPCUR DS    A                       | current in round robin alloc           
PAGXPN   DS    H                       | number of DSs in set                   
PAGXPFLG FLAG  ,                                                                
         FLAG  PAGXFUREL               Ext frame rel when we do a               
*                                        "free contents"                        
         FLAG  PAGXF1DEF               Page defined in one place                
*                                        only - subset of PAGXFUREL             
         DS    X                       - Available -                            
PAGXPRCNT DS   A                       No. of resource elments avail            
*  PCBs waiting for external page frames                                        
PAGXPWT  LHEAD PFX=PAGXP                                                        
         SPACE 2                                                                
*                                                                               
*  External swapping frame management                                           
*                                                                               
PAGXSDS  DS    A                       Data set group descriptor                
PAGXSL   DS    A                       | lock word                              
PAGXSCUR DS    A                       | current in round robin alloc           
PAGXSN   DS    H                       | number of DSs in set                   
         DS    H                       - Available -                            
PAGXSRCNT DS   A                       No. of resource elments avail            
         SPACE 4                                                                
         DS    4A                      - Available -                            
*                                                                               
*  Measurement & Statistics                                                     
*                                                                               
PAGSTATS DS    0D                      Statistics Start                         
PTRXPN   DS    A                       Pointers - # paging ds                   
PTRXPDS  DS    A                       | 1st page ds descriptor                 
PTRXPRCNT DS   A                       | alloc external page count              
PTRXSN   DS    A                       | # swapping ds                          
PTRXSDS  DS    A                       | 1st swap ds descriptor                 
PTRXSRCNT DS   A                       | alloc external swap count              
PTRFRAN  DS    A                       | real frame count                       
PTRASIN  DS    A                       | address spaces swapped in              
PTRLOUT  DS    A                       | logically swapped ASs                  
PTRFRAME DS    A                       | fame count pointers                    
         DS    3A                      - Available -                            
PAGMTIME DS    D                       Store clock @ last interval              
*                                                                               
PAGMXPMX DS    A                       Max ext frames ever alloc                
PAGMXPG  DS    A                       Total num of external pages              
PAGMXSMX DS    A                       Max ext swap frames ever alloc           
PAGMXSW  DS    A                       Total num of external swap               
PAGMASMX DS    A                       Max logged on                            
         DS    3A                      - Available -                            
*                                                                               
PAGMSORN DS    A                       Number of swap-out requests              
PAGMSOVN DS    A                       Number of virtual swap-outs              
PAGMSON  DS    A                       Number of swap-outs                      
PAGMSOF  DS    A                       Frames swapped out                       
PAGMSOTM DS    D                       Total swap-out time                      
PAGMSIRN DS    A                       Number of swap-in requests               
PAGMSIVN DS    A                       Number of virtual swap-ins               
PAGMSIN  DS    A                       Number of swap-ins                       
PAGMSIF  DS    A                       Frames swapped in                        
PAGMSITM DS    D                       Total swap-in time                       
PAGMSMAX DS    A                       Biggest swap                             
PAGMSOVR DS    A                       Number of swaps over extent              
PAGMPON  DS    A                       Number of page-outs                      
PAGMPIN  DS    A                       Number of page-ins                       
PAGMPOT  DS    D                       Total page-out time                      
PAGMPIT  DS    D                       Total page-in time                       
PAGMFSO  DS    A            ** TEMP ** Failed swap-outs                         
         DS    2A                      - Available -                            
*                                                                               
PAGSTAT  EQU   PAGSTATS,*-PAGSTATS,C'R'                                         
*                                                                               
PAGPAGEL EQU   4096                    Length of a page                         
DISABLE  EQU   X'04'                   Only DAT is left on                      
PAGDAT   EQU   DISABLE                 |                                        
*                                                                               
*  The length of these EQUs is the number of bits to shift to right             
*  align the value                                                              
*                                                                               
PAGPAGM  EQU   X'7FFFF000',12          Page/Frame mask                          
PAGOFFM  EQU   X'00000FFF',0           Page offset mask                         
PAGSGNM  EQU   X'7FF00000',20          Segment number mask                      
PAGPGNM  EQU   X'000FF000',12          Page number mask                         
PAGAFXM  EQU   X'0000FFC0',6           AFX mask for ASN                         
PAGASXM  EQU   X'0000003F',0           ASX mask for ASN                         
PAGSTOM  EQU   X'7FFFF000',12          Segment table origin mask                
PAGSTLM  EQU   X'0000007F',0           Segment table length mask                
PAGKEYM  EQU   X'000000F8'             Clear ref/change bits of key             
*                                                                               
PAGHINIT EQU   X'8000'                 History Initialization                   
PAGKREF  EQU   X'F8'                   Storage key reference mask               
PAGKRB   EQU   X'04'                   | reference bit in key                   
PAGKCHG  EQU   X'02'                   | change bit in key                      
         END   ,                       OF Real/External Mem Mgmt Ctrl           
