PZERO    RECORD BEGIN                                                           
*                                                                               
* Real Page 0.  Each CPU has its own copy of this area.                         
*                                                                               
         SPACE 2                                                                
****************************************************************                
*               Fields Fixed by the Architecture               *                
*               ********************************               *                
*                                                              *                
PZRSNPSW DS    D             Restart new PSW                 *                  
PZRSOPSW DS    D             Restart old PSW                 *                  
         DS    D                                             *                  
PZEXOPSW DS    D             External old PSW                *                  
PZSVOPSW DS    D             Supervisor old PSW              *                  
PZPIOPSW DS    D             Program old PSW                 *                  
PZMCOPSW DS    D             Machine check old PSW           *                  
PZIOOPSW DS    D             I/O old PSW                     *                  
         DS    3D                                            *                  
PZEXNPSW DS    D             External new PSW                *                  
PZSVNPSW DS    D             Supervisor new PSW              *                  
PZPINPSW DS    D             Program new PSW                 *                  
PZMCNPSW DS    D             Machine check new PSW           *                  
PZIONPSW DS    D             I/O new PSW                     *                  
         DS    F                                             *                  
PZEXCPU  DS    H             CPU address for EXT int         *                  
PZEXIC   DS    H             External interrupt code         *                  
PZSVILC  DS    H             Supervisor call ILC             *                  
PZSVIC   DS    H             Supervisor interrupt code       *                  
PZPIILC  DS    H             Program ILC                     *                  
PZPIIC   DS    H             Program interrupt code          *                  
PZTREXA  DS    A             Translation exception address   *                  
PZMONCL  DS    H             Monitor Class number            *                  
PZPERCD  DS    H             PER code                        *                  
PZPERA   DS    A             PER Address                     *                  
PZMONCD  DS    A             Monitor Code                    *                  
         DS    3D                                            *                  
PZIOSID  DS    A             I/O subsystem ID word           *                  
PZIOPRM  DS    A             I/O Parameter                   *                  
PZIOSCS  DS    A             I/O subchannel ending status    *                  
         DS    A                                             *                  
         DS    39D                                           *                  
*                                                              *                
*            ***************************************           *                
*            End of Fields fixed by the architecture           *                
****************************************************************                
         EJECT                                                                  
*                                                                               
* Fields of general interest                                                    
*                                                                               
PZMATP   DS    A             Address of the MAT                                 
         DS    A             ** Reserved **                                     
PZCURPID DS    0D            Unique ID of the current process                   
PZCURASB DS    A             Addr of ASB for current Address space              
PZCURTSK DS    A             ID of current task in the Address space            
PZLCPUA  DS    A             Logical CPU address                                
PZCPUMSK DS    A             CPU address mask bit                               
PZPSWM   DS    X             PSW mask for disabling                             
         DS    X             ** Reserved **                                     
*                                                                               
* Termination/Trace information                                                 
*                                                                               
PZTERMFL FLAG  ,             Termination flags                                  
         FLAG  PZABORT         ABORT macro issued                               
         FLAG  PZATERM         Start termination processing                     
PZABSM   DS    X             Save area for system mask in ABORT                 
PZABR15  DS    A             Save area for R15 in an ABORT                      
PZTZOFF  DS    D             Time zone offset                                   
         DS    22A           ** Reserved **                                     
*         DS    24A           ** Reserved **                                    
         END   ,                                                                
