*******************************************************************             
*                                                                 *             
*    QCT - Enqueue Control Table                                  *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QCT      RECORD BEGIN                                                           
         DS    CL4'QCT'                Id                                       
QCTLOCK  DS    A                       Queue lock                               
QCTQCBS  DS    A                       QCB chain                                
QCTQRBS  DS    D                       QRB Free pool                            
QCTQOES  DS    D                       QOE Free pool                            
         END   ,                                                                
         SPACE 3                                                                
*******************************************************************             
*                                                                 *             
*    QCB - Enqueue Queue Control Block                            *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QCB      RECORD BEGIN                                                           
QCBID    DS    CL4'QCB'                                                         
QCBNAME  DS    CL8                     Queue name                               
QCBLOCK  DS    A                       Queue lock                               
QCBNEXT  DS    A                       QCB chain                                
*                                                                               
QCBNQRB  EQU   211                     Num QRB chains (prime number)            
QCBQRBS  DS    (QCBNQRB)A(0,0)         QRB chains                               
         END   ,                                                                
         SPACE 3                                                                
*******************************************************************             
*                                                                 *             
*    QRB - Enqueue Resource Control Block                         *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QRB      RECORD BEGIN                                                           
QRBFP    DS    A                       Forward chain                            
QRBBP    DS    A                       Backward chain                           
QRBID    DS    CL4'QRB'                Id                                       
QRBQCB   DS    A                       Back pointer to QCB                      
QRBWFP   DS    A                       Forward wait chain                       
QRBWBP   DS    A                       Backward wait chain                      
QRBNAME  DS    CL44                    Resource name                            
QRBOWNF  DS    A                       Forward owner chain                      
QRBOWNB  DS    A                       Backward owner chain                     
         END   ,                                                                
         EJECT                                                                  
*******************************************************************             
*                                                                 *             
*    QOE - Enqueue Ownership Element                              *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QOE      RECORD BEGIN                                                           
QOEFP    DS    A                       Forward chain                            
QOEBP    DS    A                       Backward chain                           
QOEID    DS    CL4'QOE'                Id                                       
QOEQRB   DS    A                       QRB pointer                              
QOEPID   DS    D                       Process id                               
QOEASB   EQU   QOEPID,4,C'A'           Address space id                         
QOEECB   DS    D                       ECB                                      
QOESYR   DS    A                       System routine id                        
*                                                                               
QOEFL    FLAG  ,                                                                
         FLAG  QOESHR                  Wants it shared                          
         FLAG  QOEWAIT                 Element is on wait queue                 
         FLAG  QOERMARK                This Owner has it reserved               
         END   ,                                                                
         SPACE 3                                                                
*******************************************************************             
*                                                                 *             
*    QAS - Enqueue Address Space Control                          *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QAS      RECORD BEGIN                                                           
QASID    DS    CL4'QAS'                Id                                       
QASCHN   DS    A                       Active QAO Chain                         
QASFQAO  DS    D                       Free QAO chain                           
         END   ,                                                                
         SPACE 3                                                                
*******************************************************************             
*                                                                 *             
*    QAO - Enqueue Address Space Ownership Block                  *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
QAO      RECORD BEGIN                                                           
QAOID    DS    CL4'QAO'                Id                                       
QAOCHN   DS    A                       Chain                                    
QAOQOE   DS    A                       QOE pointer                              
QAOQNAME DS    CL8                     Queue name                               
QAORNAME DS    CL44                    Resource name                            
*                                                                               
QAOFL    FLAG  ,                                                                
         FLAG  QAOSHR                  Owns it shared                           
         END   ,                                                                
