*******************************************************************             
*                                                                 *             
*    SDALPARM - System data set allocation parameters             *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
@SDALLO  RECORD BEGIN                                                           
@SDDSN   DS    CL44                    Data set name                            
@SDDDN   DS    CL8                     DD name                                  
@SDVOL   DS    CL6                     Volume id                                
@SDERR   DS    H                       Error code from SVC 99                   
@SDRSN   DS    H                       Reason code from SVC 99                  
*                                                                               
@SDFLAG  FLAG  ,                                                                
         FLAG  @SDSHR                  Data set enqueued share                  
         END   ,                                                                
