*                                                                               
* SIEDATA -- This defines the layout of the information used by the             
*            interpretive execution hardware.  Offsets are fixed by             
*            the architecture.  This area is 256 bytes long and must            
*            be on a 256 byte boundary.                                         
*                                                                               
SIEDATA  DS    0XL256                  Entire area                              
*                                                                               
SIENTVCT FLAG  ,                       SIE Intervention control                 
         FLAG  (SIEIPSTP,4)              SIE Stopping control                   
         FLAG  (SIEIPVIO,2)              I/O interrupt pending                  
         FLAG  (SIEIPEXT,1)              EXT interrupt pending                  
*                                                                               
SIEITMR  FLAG  ,                       Interval timer interrupt stat            
         FLAG  SIEITMRI                  Interrupt pending                      
*                                                                               
         DS    X                       RESERVED                                 
*                                                                               
SIEMODE  FLAG  ,                       Mode of the guest machine                
         FLAG  (SIESA390,X'20')          ESA/390                                
         FLAG  (SIEVR,X'08')             V=R guest                              
*                                                                               
SIEPREFX DS    F                       Guest prefix register                    
SIEMSORG DS    H                       Guest main storage origen                
SIEGMSIZ DS    H                       Guest main storage extent                
*                                                                               
         DS    F                       RESERVED                                 
*                                                                               
SIEREG14 DS    F                       Guest R14 (SIE use only)                 
SIEREG15 DS    F                       Guest R15 (SIE use only)                 
SIEPSW   DS    D                       Guest PSW                                
         DS    D                       Reserved                                 
SIECPUTM DS    D                       Guest CPU timer                          
SIECKC   DS    D                       Guest Clock comparator                   
SIEEPOCH DS    D                       Epoch for the TOD clock                  
*                                                                               
* Interception controls and status                                              
*                                                                               
SIESVCTL FLAG  ,                       SVC interception control                 
         FLAG  SIESVCCN                  intercept all SVC's                    
         FLAG  SIESVC1C                  intercept SVC in SVC1C                 
         FLAG  SIESVC2C                  intercept SVC in SVC2C                 
         FLAG  SIESVC3C                  intercept SVC in SVC3N                 
SIESVC1N DS    X                       intercept SVC number 1                   
SIESVC2N DS    X                       intercept SVC number 2                   
SIESVC3N DS    X                       intercept SVC number 3                   
*                                                                               
SIELCTL  DS    H                       LCTL intercept control bits              
*                                                                               
         DS    H                       RESERVED                                 
*                                                                               
SIEICTL0 FLAG  ,                       Interception control                     
         FLAG  (SIEICPOP,X'80')          OP exception PI's                      
         FLAG  (SIEICPRO,X'40')          PRIV OP PI's                           
         FLAG  (SIEICPRG,X'20')          PI's                                   
         FLAG  (SIEICTS,X'08')           TS when CC=1                           
         FLAG  (SIEICCS,X'04')           CS when CC=1                           
         FLAG  (SIEICCDS,X'02')          CDS when CC=1                          
         FLAG  (SIEICIPT,X'01')          IPTE                                   
SIEICTL1 FLAG  ,                                                                
         FLAG  (SIEICLPS,X'40')          LPSW                                   
         FLAG  (SIEICPTL,X'20')          PTLB                                   
         FLAG  (SIEICSSM,X'10')          SSM                                    
         FLAG  (SIEICSTC,X'04')          STCL                                   
         FLAG  (SIEICSTN,X'02')          STNSM                                  
         FLAG  (SIEICSTO,X'01')          STOSM                                  
SIEICTL2 FLAG  ,                                                                
         FLAG  (SIEICSTK,X'80')          STCK                                   
         FLAG  (SIEICISK,X'40')          ISK,ISKE                               
         FLAG  (SIEICSSK,X'20')          SSK,SSKE                               
         FLAG  (SIEICRRB,X'10')          RRB,RRBE                               
         FLAG  (SIEICPC,X'08')           PC                                     
         FLAG  (SIEICPT,X'04')           PT                                     
         FLAG  (SIEICTPT,X'02')          TPROT                                  
         FLAG  (SIEICLSP,X'01')          LASP                                   
*                                                                               
         DS    5X                      RESERVED                                 
*                                                                               
* SIE Completion                                                                
*                                                                               
SIEICODE DS    X                       Completion code                          
*                                                                               
*              X'00' reserved for software use                                  
*              X'04' Instruction interception                                   
*              X'08' PI interception                                            
*              X'0C' Both instruction and PI interception (PER)                 
*              X'10' Pending external interrupt                                 
*              X'14' External interrupt interception                            
*              X'18' Pending I/O interrupt interception                         
*              X'1C' Wait state interception                                    
*              X'20' Validity interception                                      
*              X'24' Software use only                                          
*              X'28' Stop interception                                          
*              X'2C' Operation exception interception                           
*                                                                               
SIEICFLG FLAG  ,                       Intercept modifier                       
         FLAG  (SIEICIF2,X'80')          Interception fmt 2 installed           
         FLAG  (SIEICEX,X'01')           Inst subject of an EX                  
         FLAG  (SIEICIF,X'02')           PER Event on fetch                     
SIEIHCPU DS    H                       Last Host CPU address                    
*                                                                               
         DS    2X                      RESERVED                                 
*                                                                               
SIEINST  DS    H                       Intercepted inst bits 0-15               
SIEICAD1 DS    A                       1st operand eff addr                     
SIEICAD2 DS    A                       2nd operand eff addr                     
*                                                                               
* Satellite table pointers                                                      
*                                                                               
SIERCP   DS    A                       RCP-area (Host virt addr)                
SIEISCAA DS    A                       System control area addr                 
*                                                                               
         DS    D                       RESERVED                                 
*                                                                               
SIETCHCL DS    H                       TCH interception controls                
*                                                                               
         DS    H                       RESERVED                                 
         DS    F                       RESERVED                                 
         DS    D                       RESERVED                                 
*                                                                               
SIECRS   DS    XL64                    Control registers                        
*                                                                               
* Interrupt interception status area                                            
*                                                                               
         DS    F                       RESERVED                                 
*                                                                               
SIEIEXCA DS    H                       EXT interrupt CPU addr                   
SIEIEXCD DS    0H                      EXT interrupt code                       
SIEIEXCL DS    X                       EXT interrupt class code                 
SIEIEXCT DS    X                       EXT interrupt type code                  
*                                                                               
         DS    F                       RESERVED                                 
*                                                                               
SIEIPRCL DS    H                       PI ILC                                   
SIEIPRCC DS    H                       PI interrupt code                        
SIEITRAD DS    F                       Translation exception addr               
SIEIMNCL DS    H                       Monitor class                            
SIEPERCD DS    X                       PER event code                           
SIEPERZF DS    X                       PER interrupt code (reserved)            
SIEPERAD DS    F                       PER event address                        
SIEIMNCD DS    F                       Monitor code                             
*                                                                               
         DS    D                       RESERVED                                 
         DS    D                       RESERVED                                 
         DS    D                       RESERVED                                 
         DS    D                       RESERVED                                 
****************************************************************                
* End of the SIEDATA area (hardware defined)                   *                
****************************************************************                
