SMFPFX   RECORD BEGIN                                                           
SMFNUM   EQU   183                     SMF number for us                        
*                                                                               
         DS    8X                      - Available -                            
SMFSYSTM DS    CL8                     Subsystem name                           
SMFCAT   DS    CL4                     Record category                          
SMFNSEG  DS    A                       Number of data segments                  
         END   ,                                                                
