*******************************************************************             
*                                                                 *             
*       SPNPARM -- Sub-task creation calling parms                *             
*                                                                 *             
*******************************************************************             
         SPACE                                                                  
@SPAWN   RECORD BEGIN                                                           
@SPNNAME DS    CL8                     Task name                                
@SPNEP   DS    A                       Entry point                              
@SPNPARM DS    A                       Parameter to be passed                   
@SPNTRC  DS    A                       Number of trace table entries            
@SPNSTK  DS    A                       Stack size                               
@SPNDPRI DS    A                       Relative MVS task priority               
         END                                                                    
