*box                                                                            
*                                                                               
*    SSB - Shared Symbol Block                                                  
*                                                                               
SSB      RECORD BEGIN                                                           
SSBID    DS    CL4'SSB'                                                         
SSBNEXT  DS    A                   Next SSB ptr (or zero)                       
SSBWORD  DS    A                   Symbol value (probably an address)           
SSBFLAG  FLAG  ,                   Flags                                        
         DS    XL3                                                              
SSBNAME  DS    CL200               Symbol name                                  
         END                                                                    
