*****************************************************************               
*                                                               *               
*  TIMEPARM -- Parameters for the timer routines.               *               
*                                                               *               
*****************************************************************               
         SPACE 2                                                                
*                                                                               
* Start a Real-time timer                                                       
*                                                                               
         SPACE 1                                                                
@RTSET   RECORD BEGIN                                                           
@RTSCLK  DS    D             Time of day or interval in TOD format              
@RTSFLG  FLAG  ,             Request flags                                      
         FLAG  @RTSFINT       Interval timer                                    
@RTSXIT  DS    A             ID of the Exit request                             
@RTSPARM DS    2A            Parms passed to the exit                           
         END   ,                                                                
         SPACE 2                                                                
*                                                                               
* Cancel (RTCAN) Or Check (RTCHK) a Real-time timer                             
*                                                                               
         SPACE 1                                                                
@RTCNCK  RECORD BEGIN        Cancel or Check                                    
@RTCID   DS    A             ID of the Timer                                    
@RTCCLK  DS    D             Interval until the clock expires                   
@RTCPARM DS    4A            Same as the parm area in exit                      
         END   ,                                                                
         SPACE 2                                                                
*                                                                               
* Layout of parms passed to the Real time timer exit                            
*                                                                               
         SPACE                                                                  
RTEXIT   RECORD BEGIN                                                           
RTXTID   DS    A             ID of the timer                                    
RTXXID   DS    A             ID of the timer Exit                               
RTXPARM  DS    2A            Parms set when the timer was set                   
         END   ,                                                                
         SPACE 2                                                                
*                                                                               
* Start a CPU-time timer                                                        
*                                                                               
         SPACE 1                                                                
@CPSET   RECORD BEGIN                                                           
@CPSCLK  DS    D             Time of day or interval in TOD format              
@CPSXIT  DS    A             ID of the Exit request                             
@CPSPARM DS    2A            Parms passed to the exit                           
         END   ,                                                                
         SPACE 2                                                                
*                                                                               
* Cancel (CPCAN) Or Check (CPCHK) a CPU-time timer                              
*                                                                               
         SPACE 1                                                                
@CPCNCK  RECORD BEGIN        Cancel or Check                                    
@CPCID   DS    A             ID of the Timer                                    
@CPCCLK  DS    D             Interval until the clock expires                   
@CPCPARM DS    4A            Same as the parm area in exit                      
         END   ,                                                                
         SPACE 2                                                                
*                                                                               
* Layout of parms passed to the CPU-time timer exit                             
*                                                                               
         SPACE                                                                  
CPEXIT   RECORD BEGIN                                                           
CPXTID   DS    A             ID of the timer                                    
CPXXID   DS    A             ID of the timer Exit                               
CPXPARM  DS    2A            Parms set when the timer was set                   
         END   ,                                                                
