*******************************************************************             
*                                                                 *             
*    Memory parms for inside the virtual machine.                 *             
*                                                                 *             
*******************************************************************             
         SPACE 2                                                                
@VMGET   RECORD BEGIN        Parm area for getting virtual memory               
@VMGLEN  DS    A             Amount of memory needed                            
@VMGDAT  DS    A             More data. Address or maxlen.                      
@VMGPOOL DS    H             Pool/Subpool to get the memory from                
@VMGFLG  FLAG  ,                                                                
         FLAG  @VMGPAGE      Page Aligned                                       
         FLAG  @VMGONEP      Don't cross page boundary                          
         END   ,                                                                
         SPACE 2                                                                
@VMFREE  RECORD BEGIN        Used for VMFREE and VMCHECK                        
@VMFLOC  DS    A             Location of the storage to free                    
@VMFLEN  DS    A             Amount to free                                     
@VMFPOOL DS    H             Pool/Subpool where the storage lives               
         END   ,                                                                
         SPACE 2                                                                
@VMINFO  RECORD BEGIN        Returns User address limits/hash val               
@VMIUST  DS    A             Start of the user address space                    
@VMIULEN DS    A             Length of the user address space                   
@VMITRSH DS    X             Trash value                                        
         END   ,                                                                
