         MACRO                                                          00001000
.*                                                                      00001100
.*  Macro to define major command vector                                00001200
.*                                                                      00001300
.*  Added  04/08/91  pjg                                                00001400
&L       CMDVECT &ROUT=,&COMMAND=                                       00002000
.*                                                                      00006000
         AIF   (T'&ROUT EQ 'O').NOROUT                                  00006010
         AIF   (T'&COMMAND NE 'O').OKAY1                                00006020
         MNOTE 8,COMMAND OPERAND IS REQUIRED.                           00006030
         MEXIT ,                                                        00006040
.OKAY1   ANOP  ,                                                        00006050
         DC    CL16&COMMAND,A(&ROUT)                                    00006060
         MEXIT ,                                                        00006070
.NOROUT  ANOP  ,                                                        00006080
         AIF   (T'&COMMAND EQ 'O').OKAY2                                00006090
         MNOTE 8,COMMAND MAY NOT BE SPECIFIED WITH NULL ROUT            00006100
         MEXIT ,                                                        00006110
.OKAY2   ANOP  ,                                                        00006120
         DC    CL16' ',A(0)        TERMINATE LIST                       00006130
.*                                                                      00006990
         MEND                                                           00007000
