DEVINFO  RECORD BEGIN                                                   00000100
*  Device type info                                                     00001000
*  from IOPROGM's data area 1995/01/03                                  00002000
         SPACE                                                          00003000
         DS    0F                  Device info for header msg routine   00004000
*  These 4 bytes are the from the UCB and are obtained by DEVTYPE       00005000
*  or from the catalog entry.                                           00006000
DEVIFLGC DS    X                   IOS flags/model code                 00007000
*  Values:                                                              00008000
DEVIF16  EQU   X'04'               1600 bpi mode                        00009000
DEVIF62  EQU   X'02'               6250 bpi mode                        00010000
         SPACE                                                          00011000
DEVOPTFT DS    X                   Optional features                    00012000
*  Values:                                                              00013000
DEVOP7TR EQU   X'80'               7-track (tape)                       00014000
DEVOP816 EQU   X'20'               800/1600 bpi dual density (tape)     00015000
DEVOP166 EQU   X'10'               1600/6250 bpi                        00016000
DEVOPIDR EQU   X'04'               3480/3490 tape:  IDRC installed      00017000
DEVOPSHR EQU   X'20'               Shared disk                          00018000
DEVOPOFL EQU   X'40'               Track overflow                       00019000
         SPACE                                                          00020000
DEVDEVCL DS    X                   Device class                         00021000
*  Values:                                                              00022000
DEVCLUR  EQU   X'08'               Unit-record                          00023000
DEVCLGR  EQU   X'10'               Graphics                             00024000
DEVCLCM  EQU   X'40'               Communication                        00025000
DEVCLTA  EQU   X'80'               Tape                                 00026000
DEVCLDA  EQU   X'20'               Direct access                        00027000
DEVCLSY  EQU   X'01'               JES2 SYSIN/SYSOUT                    00028000
DEVCLTD  EQU   DEVCLTA+DEVCLDA     Tape or disk                         00029000
         SPACE                                                          00030000
DEVUNTYP DS    X                   Unit type                            00031000
DEVUN348 EQU   X'80'               (when TA class:  3480 tape)          00032000
DEVUN349 EQU   X'81'                ...             3490E tape          00033000
         SPACE                                                          00034000
*  The following additional info is obtained from DEVTYPE               00035000
         SPACE                                                          00036000
DEVMAXBK DS    F                   Maximum unkeyed block                00037000
DEVCYLS  DS    H                   Cyls/volume                          00038000
DEVTKCYL DS    H                   Tracks/cylinder                      00039000
DEVTRKL  DS    H                   Track length (unsigned integer)      00040000
DEVBOKA  DS    0H                  If flag DEVHWBOV is on, this is      00041000
*                                  block overhead for any keyed blk     00042000
*                                  If flag DEVMODDV is on, this is      00043000
*                                  the basic overhead.                  00044000
DEVBOKI  DS    X                   Block overhead, keyed, not last      00045000
DEVBOKN  DS    X                   Blk ovhd, keyed, last on track       00046000
DEVBONKD DS    X                   Subtract this if not keyed           00047000
*                                  If flag DEVMODDV is on, this is      00048000
*                                  the modulo factor.                   00049000
DEVFLAGS DS    X                   Flag bits:                           00050000
DEVMODDV EQU   B'00010000'         Modulo device (3380)                 00051000
DEVHWBOV EQU   B'00001000'         DEVBOKA contains halfword block      00052000
*                                  ovhd for any block on trk            00053000
DEVUTOLF EQU   B'00000001'         Use tolerance factor                 00054000
DEVTOLF  DS    H                   Tolerance factor *512                00055000
         SPACE                                                          00056000
         END   ,                   DEVINFO                              00057000
