*  Direct-access device table                                           00001000
*              from IOPROGM's data area 1995/01/03                      00002000
         SPACE                                                          00003000
         DC    0D'0'                                                    00004000
DEVTABLE DC    CL8' ',F'0'        Zeroth entry                          00005000
*               Name    nonWYL  WYL       DEVTYP     Max.blk.(trackl)   00006000
         DC    CL8'2311',F'0'               01        3625              00007000
         DC    CL8'2301',F'6739'            02       20483              00008000
         DC    CL8'2303',F'0'               03        4892              00009000
         DC    CL8'2302',F'0'               04        4984              00010000
         DC    CL8'2321',F'0'               05        2000              00011000
         DC    CL8'2305-1',F'6854'          06       14136 (14568)      00012000
         DC    CL8'2305-2',F'7330'          07       14660 (14858)      00013000
         DC    CL8'2314',F'0'               08        7294              00014000
         DC    CL8'3330',F'6447'            09       13030 (13165)      00015000
         DC    CL8'3340',F'0'               0A        8368 (8535)       00016000
         DC    CL8'3350',F'6233'            0B       19069 (19254)      00017000
         DC    CL8'3375',F'0'               0C       ?quien sabe?       00018000
         DC    CL8'3330-1',F'6447'          0D       13030 (13165)      00019000
         DC    CL8'3380',F'23476'           0E       47476 (47968)      00020000
*   23476 is 1/2 trk, max. of 32760 wastes space on 47968 byte track    00021000
         DC    CL8'3390',F'27998'           0F       56664              00022000
         SPACE                                                          00023000
##LDEVTB EQU   12                  length of one entry                  00024000
##DEVTAB EQU   (*-DEVTABLE)/##LDEVTB-1   Last entry number              00025000
         SPACE                                                          00026000
         DC    CL8' ',F'0'         Dummy zappable entry                 00027000
         DC    CL8' ',F'0'         Dummy zappable entry                 00028000
*  Don't forget to change #DEVTABL below if adding entries w. ZAP       00029000
#DEVTABL DC    A(##DEVTAB)         Last entry number                    00030000
