*box                                                                    00001000
*                                                                       00001010
*  Define format of the error tables                                    00001020
*                                                                       00001030
         SPACE ,                                                        00001040
ERRTABLE RECORD BEGIN                                                   00001100
ERRRETC  DC    AL2(0)              Error return code                    00002000
ERRMSGL  DC    AL2(0)              Error text message length            00003000
ERRFMTR  DC    AL4(0)              Error formatting routine             00004000
ERRMSGA  DC    AL4(0)              Address of error text                00005000
         END   ,                                                        00006000
