*box                                                                    00001000
*                                                                       00002000
*  PDS - Directory entry format                                         00003000
*  revised 1995/02/03 mcl                                               00004000
*                                                                       00005000
         SPACE ,                                                        00006000
PDSDIR   RECORD BEGIN                                                   00007000
PDSFF    DC    AL2(0)              Total number of entries              00008000
PDSLL    DC    AL2(0)              Total length of pds entry list       00009000
PDSNAME  DC    CL8'MEMNAME'        Member name                          00010000
PDSTTR   DC    AL3(0)              TTR address of member start          00011000
PDSK     DC    AL1(0)              Data set concatenation number        00012000
PDSZ     DC    AL1(0)              BLDL directory source                00013000
PDSSTOWL EQU   *-PDSNAME,,C'N'                                          00013100
PDSNEWNM EQU   PDSTTR,8,C'C'       new name for CHANGE, note overlap    00013110
*                                  of fields below                      00013120
         SPACE ,                                                        00013200
PDSC     DC    AL1(0)              Type of member + user data length    00014000
PDSDATA  DC    0CL62' '            Member optional data                 00015000
PDSRSVD  DC    XL4'00'             Reserved field                       00016000
PDSCSTCK EQU   PDSRSVD             create stck stamp, replaces rsvd     00017000
PDSWYLCK DC    CL4'WYL0'           Identify wylbur format               00017100
PDSSTCK  DC    XL4'00'             High four bytes of stck              00018000
PDSACCT  DC    CL8'GG.PJG'         Account modification                 00019000
PDSTITLE DC    CL42' '             User title information               00020000
         END   ,                                                        00021000
