*box                                                                    00001000
*                                                                       00002000
*  Space calculation control block                                      00003000
*  rev. 1995/06/02 mcl                                                  00004000
*                                                                       00004100
SPACALC  RECORD BEGIN              Space allocate calculation           00005000
SPACEYE  DC    C'SPAC'             Dump eye-catcher for block           00005100
SPACBYTE DC    A(0)                Space request in K bytes             00005200
SPACAVGB DC    A(0)                Average block requst size            00006000
SPACPRIM DC    A(0)                Primary number of blocks             00007000
SPACSEC  DC    A(0)                Secondary number of blocks           00008000
SPACDIR  DC    A(0)                Number of directory blocks           00009000
SPACRTDD DC    A(0)                Address of returned ddname           00009100
SPACRTVL DC    A(0)                Address of returned volser           00009200
         END   ,                                                        00010000
