*box                                                                    00001000
*                                                                       00002000
*        Trace table entry format.                                      00003000
*                                                                       00004000
TRCNENT# EQU   200,,C'N'           Default number of trace entries      00005000
*                                                                       00006000
TRCENTRY RECORD BEGIN                                                   00007000
TRCCLOCK DS    D                   Time stamp (STCK format)             00008000
TRCNAME  DS    CL8                 Routine name or trace id             00009000
TRCREGS  DS    16F                 Registers                            00010000
         END                                                            00011000
