*box                                                                    00001000
*                                                                       00002000
*        TVT -- OS file extension                                       00003000
*                                                                       00004000
*      Used by:  OSFILE, MVSUTILS, FILESHOW                             00005000
                                                                        00006000
*-       1998/01/13 mcl   TVTORVSS                                      00007000
*-       1997/01/21 mcl   TVTFNTYP                                      00008000
*-       1996/11/09 mcl   TVTUPMEM                                      00009000
*-       1996/11/07 mcl   TVTRECFM                                      00010000
*-       1996/09/12 mcl   TVTFISXCAT                                    00011000
*-       1996/07/11 mcl   TVTFISCAT                                     00012000
*-       1996/05/14 mcl   TVTEXMSG                                      00013000
*-       1996/05/01 mcl   TVTUIFL                                       00014000
*-       1996/03/04 mcl   NOFWE flag                                    00015000
*-       1996/02/28 mcl   allocation retry flags, EMBUF area            00016000
*-       1996/02/22 mcl   OSFWK1 replaced by specific areas             00017000
*-       1996/02/15 mcl:  SMSUP flag                                    00018000
*-       1996/02/09 mcl:  areas for internal enq, scrvol stuff          00019000
*-       1996/01/03 mcl:  print DCB RECFM, LRECL change                 00020000
*-                                                                      00021000
*-       Define TVT common event control blocks                         00022000
*-                                                                      00023000
*-             The event processing routine addresses are filled        00024000
*-             in by the sub-task initialization code.                  00025000
*-                                                                      00026000
*-                                                                      00027000
TVTEVNTS DC    A(0)                Address of event control table       00028000
                                                                        00029000
         ECBLIST (TVTSTOPE,MONPOST)    ECB for monitor request          00030000
         ECBLIST (TVTTIMRE,SETTIMER)   ECB for periodic timer           00031000
         ECBLIST (TVTPATHE,PROCPATH)   ECB for path activity post       00032000
                                                                        00033000
         ECBLIST TYPE=DUMMY        Generate ECB processing routines     00034000
TVTEVSEC DC    (TVTEVCNT)A(0,0)    SECONDARY COPY OF ECB'S              00035000
         SPACE 2                                                        00036000
TVTBTECB DC    F'0'                ECB for buffer-wait timer ML940223   00037000
TVTBWECL DC    2A(0)               ECB list for buffer fill/timeout     00038000
                                                                        00039000
TVTDFWTM EQU   10                  Default main loop wait time, min.    00040000
*-                                                                      00041000
*-       Conversion work areas                                          00042000
*-                                                                      00043000
TVTSTCK  DC    D'0'                Save area for STCK                   00044000
*-                                                                      00045000
*-       Define anchor cell for path control block                      00046000
*-                                                                      00047000
TVTUPATH DC    A(0)                Address of patch control block       00048000
TVTPATBF DC    A(0)                Address of path buffer               00049000
TVTPATB2 DC    A(0)                Address of moved path buffer         00050000
TVTACEE  DC    A(0)                Address of WINGACEE control block    00051000
TVTOSFWK DC    A(0)                Address of OSFILE g.p. workarea      00052000
L#OSFWK  EQU   4096                length of OSFWK area                 00053000
TVTPATHN DC    CL8'WINGSV00'       Path name                            00054000
TVTPATCM DC    CL16'COMMAND'       Current command                      00055000
TVTPATNX DC    CL16'COMMAND'       Expected next command                00056000
                                                                        00057000
TVTNQDSN DC    CL44' '             DSN of dataset enqueued internally   00058000
TVTNQFLG DC    X'00'               enqueue flags                        00059000
TDNQSHR  EQU   X'80'                - shared                            00060000
TDNQEXC  EQU   X'40'                - exclusive                         00061000
TVTPATFL FLAG  ,                   Define path processing flags         00062000
         FLAG  TPATOPEN             - Path open to client               00063000
         FLAG  TPATCMND             - Command is in progress            00064000
         FLAG  TPATERR              - Cleanup client path               00065000
         FLAG  TERRMSG              - Error message exists in ERRSCB    00066000
         FLAG  TPATSPR              - Client is SYS priv'd              00067000
         FLAG  TPATOPR              - Client is OPR priv'd              00068000
         FLAG  TPATAUTH             - Client is authorized              00069000
         FLAG  TPATPERR             - path errors, do not retry         00070000
                                                                        00071000
TVTGENF  FLAG  ,                   Define general processing flags      00072000
         FLAG  TERRMULT             - Special ERRSCB processing         00073000
         FLAG  TVTORVYL            ORVYL kluge is enabled               00074000
         FLAG  TVTORVSS            Caller is ORVYL                      00075000
         FLAG  TREADEOF            Did READ and awaiting FILE_EOF       00076000
         FLAG  TVTSMSUP            SMS is active                        00077000
         FLAG  TVTNOFWE             - do not enable file-write ESTAE    00078000
         FLAG  TVTEXMSG            Extended info/warning msgs available 00079000
                                                                        00080000
TVTRESF  FLAG  ,                   Define resource held flags           00081000
         FLAG  TVTACEEHELD          - acee resource chain held          00082000
         DC    AL1(0)              Reserved                             00083000
                                                                        00084000
*-                                                                      00085000
*-       Define macro parameter lists                                   00086000
*-                                                                      00087000
TVTOPEN  OPEN  (*-*,INPUT),MF=L                                         00088000
TVTCLOSE CLOSE (*-*),MF=L                                               00089000
MODSETZ  MODESET KEY=ZERO,MF=L     Enter key zero                       00090000
MODSETP  MODESET KEY=NZERO,MF=L    Enter problem key                    00091000
         SPACE 2                                                        00092000
*-                                                                      00093000
*-       Define general TVT scanner control block and                   00094000
*-       secondary scanner control block                                00095000
*-                                                                      00096000
*NOGEN                                                                  00097000
         SCANCB PFX=TVTSCN         Primary scanner control block        00098000
                                                                        00099000
*-                                                                      00100000
*-       Define path support seg buffer control                         00101000
*-                                                                      00102000
TVTSCB   SEGCB ,                   Define segment control buffer        00103000
TVTSBUFL DC    A(16384)            Buffer length                        00104000
OSFSCB   SEGCB ,                   Define segment control buffer        00105000
OSFSCBBL EQU   1024,,C'N'          Define segment buffer length         00106000
ERRSCB   SEGCB ,                   Define segment control for errors    00107000
ERRBUFR  DC    A(0)                Address of error buffer              00108000
ERRBUFL  EQU   1024,,C'N'          Define length of error buffer        00109000
*GEN                                                                    00110000
                                                                        00111000
*        ORVYL interface special options                                00112000
TVTORVAC DC    CL8' '              userid to use when ORVYL kluge       00113000
*                                  is in effect                         00114000
                                                                        00115000
*-                                                                      00116000
*-       General command abort save for stack pointer and               00117000
*-         command exit address.                                        00118000
*-                                                                      00119000
TVTCMDAS DC    A(0)                Stack frame ptr for abort return     00120000
*-                                                                      00121000
*-       Open file information.                                         00122000
*-                                                                      00123000
TVTFILPB FILPB PFX=TVTPB           File open parameters                 00124000
                                                                        00125000
*  Options for temporary dataset definition                             00126000
                                                                        00127000
TVTTMVOL# DC    H'0'               Vol count for SAVE...TEMP            00128000
TVTTMVOL0 DC    5XL12'00'          volume list for SAVE...TEMP          00129000
TVTTMVOL EQU   TVTTMVOL#,*-TVTTMVOL#,C'X'  the whole list               00130000
TVTTMSTC DC    CL8' '              STORCLAS for SAVE...TEMP             00131000
TVTTMMGC DC    CL8' '              MGMTCLAS for SAVE...TEMP             00132000
                                                                        00133000
*-                                                                      00134000
*-       General information.  Cleared at entry to each fresh           00135000
*-       command.                         *v*v*v*v*v*v*v*v*v*v*v*v*v    00136000
*-                                                                      00137000
TVTGEN#  DS    0D                                                       00138000
             DC   0A(0)                                                 00139000
TVTDDNAME    DS   CL8              DDNAME (from dynamic allocation)     00140000
TVTDSORG     DS   AL2              Data set organization from DSCB      00141000
TVTVOLSER    DC   CL6' '           Actual allocated volume serial       00142000
TVTCATVOL    DC   CL6' '           Catalog volume if any                00143000
TVTLIBVOL    DC   CL6' '           WYL.GG.UUU.LIB volume if any         00144000
TVTBYTEGUESS DC A(0)               File size guess                      00145000
TVTLINEGUESS DC A(0)               Count of number of lines             00146000
TVTRECFM DC    X'00'               RECFM from DSCB                      00147000
TVTFFLAG FLAG  ,                   File allocation flags                00148000
         FLAG  TVTFISOLD               - disp=old                       00149000
         FLAG  (TVTFISNEW,TVTFISOLD,Z) - disp=new                       00150000
         FLAG  TVTFISMOD               - disp=mod                       00151000
         FLAG  TVTFISSMS           Do SMS-type alloc, omit unit/vol     00152000
         FLAG  TVTFCHCAT           catalog lookup has been done  960913 00153000
         FLAG  TVTFISCAT           catalog entry exists for file 960912 00154000
         FLAG  TVTFCHSMS           did OBTAIN on catvol, chkd for sms   00155000
         FLAG  TVTFEXSMS           Existing dataset is SMS       960913 00156000
         FLAG  TVTFISXCAT          cataloged on other volume   ml960912 00157000
TVTDSOFLG FLAG  ,                  DSORG flags   ml 960913              00158000
         FLAG  TVTFISPDS               - dsorg=po                       00159000
         FLAG  (TVTFISPS,TVTFISPDS,Z)  - dsorg=ps                       00160000
         FLAG  TVTFISPE            PDS/E         ml 950117              00161000
TVTIOFLG FLAG  ,                   Flags governing I/O operations       00162000
         FLAG  TVTDCBOK             - dcb abend exit enabled            00163000
         FLAG  TVTDCBAB             - DCB ABEND EXIT HAS BEEN ENTERED   00164000
         FLAG  TVTFWEST             - FILE WRITE ESTAE EXIT ACTIVE      00165000
         FLAG  TVTFEOF              - end of file reached (used only    00166000
*                                     by SHO DIR at present)            00167000
         FLAG  TVTDSNOK             - DSN ATTRIBTUES ARE COMPATIBLE     00168000
TVTLSPFL FLAG  ,                   File_lspace: options                 00169000
         FLAG  TVTLSPINDEX          - display vtoc index                00170000
         FLAG  TVTLSPFRAG           - display fragmentation index       00171000
         FLAG  TVTLSPAVAIL          - display available fmt0 count      00172000
         FLAG  TVTLSPFULL           - display complete extent info      00173000
         FLAG  TVTLSPEXT            - display extent information        00174000
         FLAG  TVTLSPSENT           - indicate first data sent          00175000
         ORG   TVTLSPFL            ORIGIN BACK TO LSPACE FLAGS          00176000
TVTUIFL  FLAG  ,                   UNIT INFO OPTS                       00177000
         FLAG  TVTUIRAW            RAW UCB info                         00178000
         FLAG  TVTUIHEX            Hexdump UCB base segment             00179000
         FLAG  TVTUIFMT            Format UCB info                      00180000
         FLAG  TVTUIVOL            Volume given (else unit)             00181000
         SPACE                                                          00182000
TVTFFLG5 FLAG  ,                                                        00183000
         FLAG  TVTUPMEM            scratch/rename of member (not of     00184000
*                                  whole dataset)                       00185000
         FLAG  TVTFRESAVE          File scratch, realloc, and save      00186000
         FLAG  TVTFDYNRT0          retry same request (we've fixed      00187000
*                                  some environment problem)            00188000
         FLAG  TVTFDYNRT1          retry safer request (problem with    00189000
*                                  requested vol/unit)                  00190000
         FLAG  TVTFDYNRTX          we have retried already              00191000
TVTDISPFLAG  FLAG ,                Disposition flag                     00192000
         FLAG  (TVTFKEEP,1,EQ)                                          00193000
         FLAG  (TVTFCATLG,2,EQ)                                         00194000
*                                                                       00195000
TVTFFLG7 FLAG  ,                                                        00196000
TVTUCFLG EQU   TVTFFLG7,1,C'X'     Used by scratch/uncatlg              00197000
TVTFNTYP FLAG  ,                   Copy of NTYPE flag (FILPBDTYPE)      00198000
         ORG   ,                                                        00199000
                                                                        00200000
*  Options for SHOW DIR, SHOW CAT, SHOW DSN                             00201000
                                                                        00202000
TVTOPT#LIK  DC H'0'                L'LIKE option                        00203000
TVTOPTLIKE  DC CL44' '             LIKE option                          00204000
TVTOPTTO    DC CL44' '             TO option                            00205000
TVTOPTFROM  DC CL44' '             FROM option                          00206000
                                                                        00207000
TVTFSFLGS FLAG  ,                   general flags                       00208000
         FLAG  FSHOWVOL            get volume lists                     00209000
         FLAG  FSHOWDSC            obtain DSCBs                         00210000
         FLAG  FSHOEXCL            EXCLUDE rather than FROM             00211000
         FLAG  FSHOTHRU            THROUGH rather than TO               00212000
TVTFSETYP FLAG  ,                   catalog select criterea             00213000
         FLAG  FSHOTYPD            disk only                            00214000
         FLAG  FSHOTYPT            tape only                            00215000
         FLAG  FSHOTYPG            GDG entries                          00216000
         FLAG  FSHOONLY            ONLY given name                      00217000
         FLAG  FSHOONVL            ON volume                            00218000
         FLAG  FSHOTEMP            TEMP files                           00219000
         FLAG  FSHOVTOC            look in VTOC, not catalog            00220000
TVTFSMFLG FLAG  ,                   misc. flags                         00221000
         FLAG  NDFLAG              Non-dataset entry found              00222000
         FLAG  FMT3S1DONE          section 1 of FMT3 DSCB processed     00223000
         FLAG  FMT3S2DONE          section 2 of FMT3 DSCB processed     00224000
         FLAG  FSHOMFLAG1          spare                                00225000
         FLAG  FSHOMFLAG2          spare                                00226000
                                                                        00227000
*  Pointers for FILESHOW dynamic areas                                  00228000
                                                                        00229000
TVTFSWKA1  DC  A(0)                ->work area 1 (dsn from SVC26 or     00230000
*                                    FCL area for CVAFFILT)             00231000
TVTFSWKA2  DC  A(0)                ->work area 2 (catlg entries)        00232000
TVTFSUCB DC    A(0)                ->UCB for VTOCSHOW                   00233000
                                                                        00234000
*  ABEND info                                                           00235000
                                                                        00236000
TVTIOAB  DC    A(0)                ABEND code from O/C/EOV              00237000
                                                                        00238000
*                                                                       00239000
*  END of general area (cleared each cmd)  *^*^*^*^*^*^*^*^*^*^*^*^*^   00240000
*                                                                       00241000
TVTGEN   EQU   TVTGEN#,*-TVTGEN#,C'C'  general area                     00242000
                                                                        00243000
*-                                                                      00244000
*-       Blocking/Deblocking control.  Cleared at entry to each         00245000
*-       fresh commands.                  *v*v*v*v*v*v*v*v*v*v*v*v*v    00246000
*-                                                                      00247000
TVTBLK#  DS    0D                                                       00248000
TVTRBINF DS    A                   Record deblocking area ptr           00249000
TVTBUFP  DC    A(0)                Address of file I/O buffer           00250000
TVTBUFSZ DC    A(0)                Length of file I/O buffer            00251000
TVTBUFPT DC    A(0)                Current pointer into file I/O        00252000
TVTLINBF DC    A(0)                Address of record buffer             00253000
TVTLINSZ DC    A(0)                Length of record buffer              00254000
TVTBLK   EQU   TVTBLK#,*-TVTBLK#,C'C'                                   00255000
                                                                        00256000
*                                                                       00257000
*  END of blocking area (cleared each cmd) *^*^*^*^*^*^*^*^*^*^*^*^*^   00258000
*                                                                       00259000
                                                                        00260000
                                                                        00261000
*-                                                                      00262000
*-       ABEND control                                                  00263000
*-                                                                      00264000
TVTABEND DC    A(0)                Abend system and user code           00265000
TVTABREA DC    A(0)                Abend reason code                    00266000
                                                                        00267000
*  log/report dataset stuff                                             00268000
TVTLOGCK DC    D'0'                timestamp for log open               00269000
TVTLOGDD DC    CL8'OSFNNNNN'       Log ddname for OSFILE                00270000
TVTLOGCT DC    F'0'                logfile line count                   00271000
TVTLOGLL DC    F'100000'           logfile line limit                   00272000
TVTLOGTL DC    H'24'               logfile time limit                   00273000
TVTLOGSY DC    C'A'                SYSOUT class for logfile             00274000
*  DCB for OSFILE log/report datasets                                   00275000
                                                                        00276000
OSFDCBPR DCB   DDNAME=DUMMY,MACRF=PM,DSORG=PS,RECFM=VB,LRECL=136        00277000
         SPACE 2                                                        00278000
*-                                                                      00279000
*-       Operating System Control Blocks.                               00280000
*-                                                                      00281000
*-             Cleared at entry to each command.                        00282000
*-                                                                      00283000
OSFCBST  DC    0D'0'               Start of OS control blocks           00284000
OSFQSAM  DCB   DDNAME=DUMMY,MACRF=GL,DSORG=PS   for directory read      00285000
         ORG   OSFQSAM             Origin back to QSAM DCB address      00286000
OSFBPAM  DCB   DDNAME=DUMMY,MACRF=(R,W),DSORG=PO                        00287000
         ORG   OSFQSAM             Origin back to QSAM DCB address      00288000
OSFBSAM  DCB   DDNAME=DUMMY,MACRF=(RP,WP),DSORG=PS                      00289000
         ORG   ,                   origin back out                      00290000
         SPACE 2                                                        00291000
         READ  OSFDECB,SF,,,'S',,MF=L                                   00292000
         SPACE 2                                                        00293000
         DC    0D'0'               Maintain double word boundary        00294000
OSFFMT1  DC    XL140'00'           Format 1 DSCB area                   00295000
OSFFMT3  DC    XL140'00'           Format 3 DSCB area                   00296000
OSFFMT4  DC    XL140'00'           Format 4 DSCB area                   00297000
OSFDSCWK DC    XL140'00'           work area for OBTAIN                 00298000
         SPACE 2                                                        00299000
         DC    0D'0'                                                    00300000
OSFPDS   DC    XL76'00'            PDS directory entry area             00301000
*-                                                                      00302000
*-       Catalog work area.  Used by various catalog lookup             00303000
*-       routines.                                                      00304000
*-                                                                      00305000
         DC    0D'0'               Maintain double word boundary        00306000
OSFCATWK DC    265X'00'            Catalog work area                    00307000
OSFCATCT EQU   OSFCATWK,2,C'H'     volume list entry count              00308000
OSFCATVL EQU   OSFCATWK+2,12,C'X'  volume list (first entry)            00309000
OSFCATVU EQU   OSFCATWK+2,4,C'X'   UCBTYPE in first entry               00310000
OSFCATVV EQU   OSFCATWK+6,6,C'C'   VOLSER in first entry                00311000
OSFMISCD DC    2D'0'               align, and a nice doubleword         00312000
CATPL    DC    XL32'00'            Catalog parameter list               00313000
CATSMALL DC    XL16'00'            WORK AREA FOR SUPERLOCATE            00314000
         DC    0D'0'               Maintain double word boundary        00315000
                                                                        00316000
OSFCAMCT DC    5A(0)               Reserve space for general camlst     00317000
OSFENQL  DC    XL12'00'            Reserve space for enq/deq list       00318000
         ORG   OSFCAMCT            Origin back to work space            00319000
OSFCAMF2 EQU   OSFCAMCT+2,1,C'X'   byte 2 of flags                      00320000
CAMSCOVR EQU   X'10'               OVRD (override expdt) option         00321000
CAMSCERA EQU   X'04'               erase allocated space option         00322000
                                                                        00323000
         DC    0F'0'               align                                00324000
OSFTRKL  TRKCALC FUNCTN=TRKCAP,UCB=*-*,RKDD=*-*,MF=L                    00325000
         ORG   OSFCAMCT            Origin back for work space           00326000
                                                                        00327000
OSFLSPC  LSPACE MF=L               Generate parameter list              00328000
         ORG   ,                   ORIGIN BACK OUT                      00329000
                                                                        00330000
         DC    0F'0'               align                                00331000
TVTEMBFA DC    XL24'00'            parm list for IEFDB476               00332000
TVTEMBFP DC    A(0)                ->formatted msg area                 00333000
TVTEMBFL DC    H'0'                length of msg area                   00334000
TVTEMBFC DC    H'0'                Number of messages                   00335000
                                                                        00336000
         DC    0D'0'               Origin to double-word boundary       00337000
OSFCBLEN EQU   *-OSFCBST,4,C'N'    Length of OSF control blocks         00338000
*                                                                       00339000
*                                                                       00340000
TVTSIZE  EQU   *-TVTSTART          GENERATE TVT LENGTH                  00341000
