VOLENTRY RECORD BEGIN              DSECT for volume list entry          00001000
VOLUCBTP DS    F                   UCBTYPE field for device             00002000
VOLUCBDV EQU   VOLUCBTP+2,1        Device class: x'20'=disk             00003000
VOLVOLSR DS    CL6                 Volume serial number                 00004000
VOLFILSQ DS    H                   File Sequence (tape)                 00005000
         ORG   VOLFILSQ+1                                               00006000
VOLSCRCD DS    X                   Scratch puts code here               00007000
VOLNEXT  EQU   *                   Next entry                           00008000
         END                                                            00009000
