*box                                                                    00001000
*                                                                       00002000
*  Define format of the line data passed to/from                        00003000
*  WINGS.                                                               00004000
*                                                                       00005000
         SPACE ,                                                        00006000
WGSLINE  RECORD BEGIN              Wings line format                    00007000
WGSLNLEN DS    F                   Length of line data (Binary)         00008000
WGSLNLNO DS    CL8                 EBCDIC line number                   00009000
WGSLNTXT DS    0C                  EBCDIC line text                     00010000
WGSLNHDR EQU   0,WGSLNTXT-WGSLNLEN Define length of line header         00011000
         END                                                            00012000
