         MACRO                                                          03000003
&NAME    ACI   &C,&I                    ADD TO COUNTER                  06000003
         LCLA  &CT,&V                                                   09000000
&V       SETA  &I                                                       09600000
         AIF   (&V LE 65535).AC0                                        10200000
         MNOTE 8,'***  IHB421 IMMEDIATE VALUE EXCEEDS ALLOWED MAXIMUM'  10800000
.AC0     ANOP                                                           11400000
&CT      SETA  16*&C                                                    12000003
         AIF   ('&C' LE '15').AC1                                       12600000
         MNOTE 8,'***  IHB416  COUNTER VALUE MUST BE 0-15'              13200000
&CT      SETA  0                                                        13800000
.AC1     ANOP                                                           14400000
&NAME    DC    0H'0',X'AA',AL1(&CT),AL2(&I)                             15000000
         MEND                                                           18000003
