*%GOTO SKPEID0;                                                         00050000
       MACRO                                                            00100000
       ADREID0                                                          00150000
       EJECT                                                            00200000
*%SKPEID0:;                                                             00250000
*@EJECT;                                                                00300000
* /* *************************************************************** */ 00350000
* /*                                                                 */ 00400000
* /*   MACRO NAME:  ADREID0                                          */ 00450000
* /*                                                                 */ 00500000
* /*   DESCRIPTIVE NAME:  EXIT IDENTIFICATION BLOCK                  */ 00550000
* /*                                                                 */ 00600000
* /*******************************************************************/ 00623400
* /*PROPRIETARY V3 STATEMENT                                         */ 00643400
* /*LICENSED MATERIALS - PROPERTY OF IBM                             */ 00663400
* /*"RESTRICTED MATERIALS OF IBM"                                    */ 00683400
* /*5647-A01                                                         */ 00703400
* /*(C) COPYRIGHT 1992,2000  IBM CORP.                               */ 00723400
* /*END PROPRIETARY V3 STATEMENT                                     */ 00743400
* /*******************************************************************/ 00763800
* /* LICENSED MATERIALS - PROPERTY OF IBM.                           */ 00787200
* /*-----------------------------------------------------------------*/ 00818400
* /*                                                                 */ 00850000
* /*   STATUS:  VERSION  2  RELEASE  10  LEVEL  0                @FSM*/ 00900000
* /*                                                                 */ 00950000
* /*   FUNCTION:                                                     */ 01000000
* /*              THE EXIT IDENTIFICATION BLOCK IS INITIALIZED       */ 01050000
* /*    BY DFDSS PRIOR TO CALLING THE USER INTERACTION MODULE        */ 01100000
* /*    AND ACTS AS THE INTERFACE BETWEEN DFDSS THE USER INTERACTION */ 01150000
* /*    MODULE EXITS.                                                */ 01200000
* /*                                                                 */ 01205500
* /*******************************************************************/ 01211000
* /*   Note:  Because this macro is published in the books and       */ 01216500
* /*   shipped to customers, it is important to not disclose         */ 01222000
* /*   internal information in the comments on the individual field  */ 01227500
* /*   names below.  Also, all comments should be in upper case (to  */ 01233000
* /*   maintain a consistent style for the pubs).                    */ 01238500
* /*******************************************************************/ 01244000
* /*                                                                 */ 01250000
* /*   INVOCATION:  PLS -- INCLUDE ADREID0                           */ 01300000
* /*                BAL -- ADREID0                                   */ 01350000
* /*                                                                 */ 01400000
* /*   CHANGE ACTIVITY:  NEW MACRO                               @V21*/ 01450000
* /*   ADD UIM EXITS 16, 17, 18 AND 19.                         @V22G*/ 01500000
* /*   IMPLEMENT PL02135 FIX                                 @V23N253*/ 01550000
* /*       PL02135      09/03/86   MAPPING PROBLEM           @LA02135*/ 01600000
* /*   ADD NEW FLAG WORD                        3/25/87      @LA09760*/ 01650000
* /*   CORRECT ASSEMBLER EIXERR EQUATE TO MATCH PLS          @V23N298*/ 01700000
* /*   ADD SUPPORT FOR UIM-20                         KUI0280 @V24AEG*/ 01750000
* /*   ADDED SUPPORT FOR UIM-21, 22, AND 23                      @V25*/ 01800000
* /*   CHANGED EI22BCAT FLAG TO EI22BMIG FLAG       07/07/88   @DS007*/ 01850000
* /*   ADD EIXWNGOK TO INFORM UIM THAT ALL WARNINGS 12/28/89 @LA54862*/ 01900000
* /*     WERE NOT FATAL                                              */ 01950000
* /*   ADD EIREC14 TO MAP THE RECORD FOR EXIT 14    07/05/90 @LA65381*/ 02000000
* /*   VRRDS DATASET SUPPORT                         10APR91 @LA82401*/ 02050000
* /*   MAINTENANCE ROLL-UP                           14JUN91 @NA00267*/ 02100000
* /*   EI22LIKE BIT ADDED FOR RESTORE/COPY TO LIKE DEVICE    @LA71949*/ 02150000
* /*                IN AN SMS ENVIRONMENT            18JUN91 @LA71949*/ 02200000
* /*   EI22EXTR BIT ADDED FOR RESTORE TO THE SAME VOLUME     @NA06820*/ 02250000
* /*   ADDED SUPPORT FOR UIM-24                                  @V26*/ 02300000
* /*                THAT IS BEING EXTENT REDUCED     05NOV91 @NA06820*/ 02350000
* /*   VOLSLST, EXITRECL CONSTANTS ADDED             06NOV91 @NA08383*/ 02400000
* /*   ADDED EIREC00 (FWD FIT OF PN05364)            05JAN93 @OY57120*/ 02430000
* /*   MODIFIED TO SUPPORT OY60302 SECURITY APAR     19JAN93 @OY60302*/ 02460000
* /*   MADE EI22SFLG SOURCE DSET FLAGS AVAILABLE     06AUG93 @OY62462*/ 02475000
* /* $L4=BWO,HDZ11B0,20SEP93,TPCDDR: BACKUP WHILE OPEN SUPPORT   @L4A*/ 02482500
* /*   CHANGES FOR PARTIAL/INCOMPLETE RECALL         26JAN94 @OW01655*/ 02486200
* /* $RLS=HDZ11C0,26JUL94,TPCJT: SDSH/RLS support for V1.3.0     @RLS*/ 02488100
* /*   SUPERCEDE OUT OW01655-Phase 1 Partial RECALL  22JUL94 @OW06093*/ 02489000
* /*   Design change to inform UIM when track is bad 16AUG94 @OW07425*/ 02489500
* /* $RLS=HDZ11C0,23FEB95,TPCJT: SDSH/RLS support for V1.3.0     @RLS*/ 02489700
* /* AX cell support for PDSs                        05Apr95 @K131935*/ 02489800
* /*   Pass DS byte count in option 23 for PSE       24FEB95 @OW11555*/ 02489900
* /*   MSGIEV167 during assemble (KJT0057)           05SEP95 @OW15420*/ 02499900
* /*   CHANGES TO SUPPORT DSSXMAPI                   14AUG95 @OW13783*/ 02504900
* /* RECOMPILE FOR AE OW14125/OW13783                18OCT95 @OW16394*/ 02519900
* /* AE FIX FOR OW16394 - RESHIP, NO CODE CHANGE     24OCT95 @OW16551*/ 02524900
* /*   DEFINE NEW EI22IMS AND EI22BWOE FIELDS FOR    14NOV95 @OW15980*/ 02526600
* /*   IMS BWO SUPPORT FOR DFSMS 1.C.0               18MAR96 @OW15980*/ 02528300
* /* Define EI00SENQ to prevent lockout with hsm     04Jun96 @OW20023*/ 02529100
* /* $RLSCDS=HDZ11D0,09Jul96,TPCMAH: RLS hsm CDS     09Jul96  @RLSCDS*/ 02529300
* /* ADD EIDDOF1, EIDDOF2 FOR XMAPI                  12AUG96 @OW21750*/ 02529500
* /* AE FIX FOR OW21750. ADD EIXTWERR FOR XMAPI      26AUG96 @OW22314*/ 02529700
* /* ADD EIXTRERR FOR XMAPI                          18SEP96 @OW22673*/ 02529800
* /* APPLICATION INTERFACE EXTENSIONS.               12MAR97 @OW25343*/ 02529900
* /* ADD EI00NONF TO EIREC00 FOR NO IGWNOTIF CALL    11JUL97 @OW28223*/ 02533200
* /* REMOVE EIDDOF1, EIDDOF2 AND ADD EIXTRC32        31MAY98 @OW33495*/ 02534800
* /* PASS DCB@ & WRITING TRAILER FLAG IN EXIT 6      01AUG98 @OW34887*/ 02535600
* /* PASS WTO PLIST DURING XMAPI EIOP11              16DEC98 @OW36779*/ 02536000
* /* RECOMPILE FOR AE OW36779                        18DEC98 @OW36834*/ 02536200
* /* $FSM=HDZ11F0,22JAN99,TPCGN: Fast Second Migrate 22JAN99     @FSM*/ 02536300
* /* ADD EI00NOLK TO EIREC00 FOR NO ADRLOCK ENQ/DEQ  25JAN00 @OW42942*/ 02536400
* /* ADD EI22DB2 BIT TO EXIT 22 FOR API EXTENSION    16JUN00 @OW45048*/ 02536440
* /*                                                                 */ 02536500
* /* CHANGE DATE:  16JUN00                                   @OW45048*/ 02539800
* /*                                                                 */ 02543200
* /* *************************************************************** */ 02550000
*%GOTO PLSEID0;           /* GO TO THE PLS VERSION */                   02600000
ADREIBID DC    C'EIDB'              /* BLOCK IDENTIFIER              */ 02650000
ADREIB@  DS    F'0'                                                     02700000
EIOP00   DC    X'0000'              /* FUNCTION STARTUP ENTRY        */ 02750000
EIOP01   DC    X'0001'              /* READING SYSIN RECORD          */ 02800000
EIOP02   DC    X'0002'              /* PRINTING SYSPRINT RECORD      */ 02850000
EIOP03   DC    X'0003'              /* READING TAPE BLOCK RECORD     */ 02900000
EIOP04   DC    X'0004'              /* READING TAPE LOGICAL RECORD   */ 02950000
EIOP05   DC    X'0005'              /* WRITING TAPE LOGICAL RECORD   */ 03000000
EIOP06   DC    X'0006'              /* WRITING TAPE BLOCK RECORD     */ 03050000
EIOP07   DC    X'0007'              /* READING DISK TRACK            */ 03100000
EIOP08   DC    X'0008'              /* WRITING DISK TRACK            */ 03150000
EIOP09   DC    X'0009'              /* READING UTILITY SYSPRINT      */ 03200000
EIOP10   DC    X'000A'              /* WRITING UTILITY SYSPRINT      */ 03250000
EIOP11   DC    X'000B'              /* WRITING WTO MESSAGE           */ 03300000
EIOP12   DC    X'000C'              /* WRITING WTOR MESSAGE          */ 03350000
EIOP13   DC    X'000D'              /* PRESENTING ADRUFO RECORD      */ 03400000
EIOP14   DC    X'000E'              /* FUNCTION TERMINATION ENTRY    */ 03450000
EIOP15   DC    X'000F'              /* PRESENTING WTOR RESPONSE      */ 03500000
EIOP16   DC    X'0010'              /* TAPE VOL SEC/VERIFY       @V22*/ 03550000
EIOP17   DC    X'0011'              /* TAPE VOL MOUNT(NON-SPEC)  @V22*/ 03600000
EIOP18   DC    X'0012'              /* INSERT RESTORE RECORD     @V22*/ 03650000
EIOP19   DC    X'0013'              /* OUTPUT TAPE ERROR         @V22*/ 03700000
EIOP20   DC    X'0014'              /* VOLUME NOTIFICATION       @V24*/ 03750000
EIOP21   DC    X'0015'              /* DATA SET VERIFICATION     @V25*/ 03800000
EIOP22   DC    X'0016'              /* BYPASS VERIFICATION       @V25*/ 03850000
EIOP23   DC    X'0017'              /* DS PROCESSED NOTIFICATION @V25*/ 03900000
VOLSLST  DC    X'02C4'              /* MAX SIZE OF VOLSER LIST          03950000
*                                      FOR EIREC23 (118 * 6) @NA08383*/ 04000000
EIOP24   DC    X'0018'          /* CONCURRENT COPY INIT COMPLETE @V26*/ 04050000
EIOP25   DC    X'0019'              /* BACKSPACE INPUT TAPE  @OW13783*/ 04075000
EIOP26   DC    X'001A'              /* VOLUME OPEN FOR O/P   @OW15980*/ 04087500
EXITRECL DC    X'0030'              /* EXIT RECORD LENGTH    @NA08383*/ 04100000
EIRC00   DC    X'0000'              /* CONTINUE NORMAL PROCESSING    */ 04150000
EIRC04   DC    X'0004'              /* RECORD REPLACED               */ 04200000
EIRC08   DC    X'0008'              /* INSERT RECORD                 */ 04250000
EIRC12   DC    X'000C'              /* DELETE RECORD                 */ 04300000
EIRC16   DC    X'0010'              /* RECORD MODIFIED               */ 04350000
EIRC20   DC    X'0014'              /* DISCONNECT EXIT               */ 04400000
EIRC24   DC    X'0018'              /* SELECT USER STATISTICAL RECS  */ 04450000
EIRC28   DC    X'001C'              /* WTOR RESPONSE                 */ 04500000
EIRC32   DC    X'0020'              /* TERMINATE FUNCTION        @V22*/ 04550000
EIRC36   DC    X'0024'              /* TERMINATE DATA SET ONLY   @V25*/ 04600000
ADREIB   DSECT                                                          04650000
EIDLLEN  DS    H                    /* LENGTH OF ADREIB - 2      @V22*/ 04700000
EIID     DS    CL4                  /* BLOCK IDENTIFIER EBCDIC "EID0"*/ 04750000
EITSKID  DS    FL4                  /* TASK ID NUM OF CALLER @LA02135*/ 04800000
EIXALLOW DS    0XL4                 /* USER EXIT ALLOWANCE OPTIONS   */ 04850000
EIXALOW0 DS    X                    /* ALLOWANCE OPTIONS BYTE 1      */ 04900000
EIXREP   EQU   X'80'                /* ALLOW REPLACE OF RECORD       */ 04950000
EIXINS   EQU   X'40'                /* ALLOW INSERT OF RECORD        */ 05000000
EIXDEL   EQU   X'20'                /* ALLOW DELETE OF RECORD        */ 05050000
EIXMOD   EQU   X'10'                /* ALLOW MODIFICATION OF RECORD  */ 05100000
EIXDIS   EQU   X'08'                /* ALLOW DISCONNECT OF EXIT      */ 05150000
EIXWTOR  EQU   X'04'                /* ALLOW WTOR RESPONSE           */ 05200000
EIXSTAT  EQU   X'02'                /* ALLOW SELECTION OF USER STATS */ 05250000
EIXTERM  EQU   X'01'                /* ALLOW TERMINATION OF FUNC @V22*/ 05300000
EIXALOW1 DS    X                    /* ALLOWANCE OPTIONS BYTE 2      */ 05350000
EIXTDSET EQU   X'80'                /* ALLOW DATA SET TERMINATION@V25*/ 05400000
EIXALOW2 DS    X                    /* ALLOWANCE OPTIONS BYTE 3      */ 05450000
EIXALOW3 DS    X                    /* ALLOWANCE OPTIONS BYTE 4      */ 05500000
EIXERR   EQU   X'80'                /* DIS-ALLOWED OPTION    @V23N298*/ 05550000
EIOPTION DS    H                    /* PROCESSING OPTION             */ 05600000
EIRETCOD DS    H                    /* EXIT RETURN CODE              */ 05650000
EIRECALN DS    FL4                  /* RECORD AREA LENGTH    @LA02135*/ 05700000
EIRECLEN DS    FL4                  /* ORIGINAL RECORD LEN   @LA02135*/ 05750000
EIRECPTR DS    FL4                  /* ORIGINAL RECORD ADDR  @LA02135*/ 05800000
EIUSEPTR DS    FL4                  /* USER DATA AREA PTR    @V23N253*/ 05850000
EIDDID   DS    0FL4                 /* EIOP06 DDN/VOLID PTR  @OW36779*/ 05883300
EIXMWPL  DS    FL4                  /* EIOP11 WTO PLIST PTR  @OW36779*/ 05916600
EIXFLAGS DS    0XL4                 /* OTHER FLAGS           @LA09760*/ 05950000
EIXFLAG0 DS    X                    /* FLAG BYTE 0           @LA09760*/ 06000000
EIXABEND EQU   X'80'                /* ABEND MESSAGE FLAG    @LA09760*/ 06050000
EIXNTERR EQU   X'40'                /* NON-TAPE ERR MSG FLAG @LA09760*/ 06100000
EIXWNGOK EQU   X'20'                /* WARNINGS ARE OK  FLAG @LA54862*/ 06150000
EIXTRKER EQU   X'10'                /* track is in error     @OW07425*/ 06175000
EIXFLAG1 DS    X                    /* FLAG BYTE 1           @LA09760*/ 06200000
EIXTRC32 EQU   X'80'                /* UIM SET EIRETCOD 32   @OW33495*/ 06206200
EIXTDUMS EQU   X'20'                /* DUMMY SOURCE TAPE     @OW13783*/ 06212500
EIXTDUMT EQU   X'10'                /* DUMMY TARGET TAPE     @OW13783*/ 06225000
EIXTISXM EQU   X'08'                /* APPL USING XMAPI      @OW13783*/ 06237500
EIXDASYS EQU   X'04'                /* XMAPI ALLOCATION ERR  @OW21750*/ 06243700
EIXTWERR EQU   X'02'                /* XMAPI TAPE WRITE ERR  @OW22314*/ 06246800
EIXTRERR EQU   X'01'                /* XMAPI TAPE READ ERR   @OW22673*/ 06248400
EIXFLAG2 DS    X                    /* FLAG BYTE 2           @LA09760*/ 06250000
EIXFLAG3 DS    X                    /* FLAG BYTE 3           @LA09760*/ 06300000
         DS    0F                   /* FORCE WORD BOUNDARY           */ 06350000
EIDBLEN  EQU   *-ADREIB             /* LENGTH OF THE EIB BLOCK       */ 06400000
*/********************************************************************/ 06410000
*/* RECORD PRESENTED BY EXIT 06 (WRITE PHYSICAL TAPE):       @OW34887*/ 06420000
*/* EIDDINFO IS BASED ON (EIDDID).                           @OW34887*/ 06430000
*/********************************************************************/ 06440000
EIDDINFO DSECT                                                          06450000
EIDDNAME DS    CL8                  /* DDNAME LEFT-JUSTIFIED  @V22AEG*/ 06500000
EIVOLID  DS    CL6                  /* VOLUME SERIAL NO.      @V22AEG*/ 06550000
EIRETC   DS    XL1                  /* RETURN CODE            @V22AEG*/ 06600000
EI06FLGS DS    XL1                  /* EXIT 06 FLAGS         @OW34887*/ 06620000
EI06FTRL EQU   X'80'                /* RESERVED FOR HSM USE  @OW34887*/ 06640000
EI06DCB@ DS    AL4                  /* RESERVED FOR HSM USE  @OW34887*/ 06660000
*        DS    CL4                  /* RESERVED              @OW34887*/ 06680000
*/********************************************************************/ 06700000
*/* RECORD PRESENTED BY EXIT 00 (FUNCTION STARTUP):          @OY57120*/ 06707100
*/********************************************************************/ 06714200
EIREC00  DSECT                      /*                       @OY57120*/ 06721300
EI00SBPL DS    XL1                  /* SHARED SUBPOOL NUMBER @OY57120*/ 06728400
EI00FLGS DS    XL1                  /* startup flags         @OW20023*/ 06731900
EI00SENQ EQU   X'80'                /* short VTOC enqueue    @OW20023*/ 06735400
EI00NONF EQU   X'40'                /* 1 = Don't allow IGWNOTIF call,   06736200
*                                    0 = Allow IGWNOTIF call @OW28223*/ 06737000
EI00NOLK EQU   X'20'                /* 1= NO ADRLOCK ENQ/DEQ @OW42942*/ 06737600
*        EQU   X'1F'                /* RESERVED              @OW42942*/ 06738200
         DS    CL14                 /* reserved              @OW20023*/ 06738900
*/********************************************************************/ 06742600
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 14:      @LA65381*/ 06750000
*/* DSS MESSAGE NUMBER ASSOCIATED WITH NON ZERO RETCODE      @LA65381*/ 06800000
*/********************************************************************/ 06850000
EIREC14  DSECT                                                          06900000
EI14RC   DS    CL4                  /* DSS RETURN CODE       @LA65381*/ 06950000
EI14MESS DS    0CL4                 /* DSS MESSAGE           @LA65381*/ 07000000
EI14MNUM DS    CL3                  /*  MESSAGE NUMBER       @LA65381*/ 07050000
EI14MTYP DS    CL1                  /*  MESSAGE TYPE         @LA65381*/ 07100000
EI14CPUT DS    CL8                  /* DSS CPU TIME          @OW13783*/ 07125000
*/********************************************************************/ 07150000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 20: VOLUME   @V24*/ 07200000
*/* NOTIFICATION EXIT.                                           @V24*/ 07250000
*/********************************************************************/ 07300000
EIREC20  DSECT                                                          07350000
EI20DSN  DS    CL44                 /* DATA SET NAME/CLUSTER NAME       07400000
*                                                                @V24*/ 07450000
EI20FLGS DS    XL1                  /* SOME FLAGS:               @V24*/ 07500000
EI20VSAM EQU   X'80'                /* 1=DATA SET IS VSAM               07550000
*                                      0=DATA SET IS NONVSAM     @V24*/ 07600000
EI20RACF EQU   X'40'                /* 1=DATA SET IS PROTECTED BY A     07650000
*                                      DISCRETE RACF PROFILE     @V24*/ 07700000
*        EQU   X'3F'                /* RESERVED                  @V24*/ 07750000
         DS    CL1                  /* RESERVED                  @V24*/ 07800000
EI20DA#  DS    XL1                  /* NUMBER OF DATA COMPONENTS @V24*/ 07850000
EI20IX#  DS    XL1                  /* NUMBER OF INDEX COMPONENTS       07900000
*                                      (0 IF NONVSAM)            @V24*/ 07950000
EI20DA@  DS    AL4                  /* POINTER TO DATA COMPONENT        08000000
*                                      INFO FOR VSAM/DATA SET           08050000
*                                      INFO FOR NONVSAM          @V24*/ 08100000
EI20IX@  DS    AL4                  /* POINTER TO INDEX COMPONENT       08150000
*                                      INFO FOR VSAM/0 FOR NONVSAM      08200000
*                                                                @V24*/ 08250000
*/********************************************************************/ 08300000
*/* FOR A NONVSAM DATA SET, EI20DA@ WILL POINT TO A SINGLE       @V24*/ 08350000
*/* EI20DSI STRUCTURE.  FOR A VSAM CLUSTER, EI20DA@ POINTS TO AN @V24*/ 08400000
*/* ARRAY OF STRUCTURES (ONE FOR EACH DATA COMPONENT), AND       @V24*/ 08450000
*/* EI20IX@ POINTS TO A SIMILAR ARRAY FOR THE INDEX COMPONENTS   @V24*/ 08500000
*/********************************************************************/ 08550000
EI20DSI  DSECT                      /* DATA SET INFO             @V24*/ 08600000
EI20CON  DS    CL44                 /* COMPONENT NAME (BLANKS FOR       08650000
*                                      NONVSAM)                  @V24*/ 08700000
EI20NVOL DS    XL2                  /* # OF VOLUMES IN DS        @V24*/ 08750000
         DS    CL2                  /* RESERVED                  @V24*/ 08800000
EI20VLI  DS    0CL12                /* VOLUME INFORMATION (REPEAT FOR   08850000
*                                      EACH VOLUME               @V24*/ 08900000
EI20VOL  DS    CL6                  /* VOLSER                    @V24*/ 08950000
         DS    CL2                  /* RESERVED                  @V24*/ 09000000
EI20RBA  DS    FL4                  /* RBA TOKEN                        09050000
*                                                                @V24*/ 09100000
*/********************************************************************/ 09150000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 21:          @V25*/ 09200000
*/*    DATA SET VERIFICATION EXIT                                @V25*/ 09250000
*/********************************************************************/ 09300000
EIREC21  DSECT                                                /* @V25*/ 09350000
EI21DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/ 09400000
*/********************************************************************/ 09450000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 22:          @V25*/ 09500000
*/*    BYPASS VERIFICATION EXIT                                  @V25*/ 09550000
*/********************************************************************/ 09600000
EIREC22  DSECT                                                /* @V25*/ 09650000
EI22DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/ 09700000
EI22FLGS DS    XL1                  /* EXIT 22 FLAGS:            @V25*/ 09750000
EI22BSER EQU   X'80'                /* 1=BYPASS                         09800000
*                                        SERIALIZATION           @V25*/ 09850000
EI22BSEC EQU   X'40'                /* 1=BYPASS DATASET LEVEL, STORCLAS 09871400
*                                        AND MGMTCLAS SECURITY CHECKS.  09892800
*                                        ALSO BYPASS JES3 INTEGRITY     09914200
*                                        CHECKS AND DO NOT CREATE       09935600
*                                        DISCRETE DATASET PROFILES.     09957000
*                                                            @OY60302*/ 09978400
EI22BMIG EQU   X'20'                /* 1=TOLERATE MIGRATED VOLSERS      10000000
*                                        FOR NONVSAM DATA SETS @DS007*/ 10050000
*               /* SWAPPING POSITIONS OF EI22NSYS & EI22SIRS @OW01655*/ 10087500
EI22NSYS EQU   X'10'                /* 1=NO SYSDSN, GET ADRDSN, BWODSN  10125000
*                                       AND SYSVSAM ENQUEUES    @L4A */ 10162500
EI22LIKE EQU   X'08'                /* 1=RESTORE/COPY TO SAME           10200000
*                                        DEVICE              @NA06820*/ 10250000
EI22EXTR EQU   X'04'                /* 1=RESTORE TO SAME VOLUME BEING   10300000
*                                        EXTENT REDUCED      @NA06820*/ 10350000
EI22SIRS EQU   X'02'                /* SET INCMPLT RECALL    @OW01655   10375000
*                                        SWAPPED W/ EI22NSYS @OW01655*/ 10400000
EI22DB2  EQU   X'01'                /* 1 = DB2 RENAME        @OW45048*/ 10425000
*                                                                    */ 10450000
*/********************************************************************/ 10500000
*/* THE FOLLOWING WERE REMOVED FROM THE MAP OF THE RECORD    @OY62462*/ 10550000
*/*   PRESENTED TO EXIT 22 BUT ARE NOW RETURNED TO USE       @OY62462*/ 10600000
*/********************************************************************/ 10650000
EI22SFLG DS    0CL5                 /* SOURCE DATA SET FLAGS @OY62462*/ 10697500
E22SSMSF DS    CL1                  /* SOURCE SMS FLAGS              */ 10745000
*                                   /*                       @OY62462*/ 10792500
E22SDSRG DS    CL2                  /* SOURCE DATA SET ORG           */ 10840000
*                                   /*                       @OY62462*/ 10887500
E22SVFLG DS    XL2                  /* VSAM DATA SET FLAGS:  @OY62462*/ 10935000
E22SESDS EQU   X'80'                /* 1=ESDS DATA SET       @OY62462*/ 10982500
E22SKSDS EQU   X'40'                /* 1=KSDS DATA SET       @OY62462*/ 11030000
E22SKRDS EQU   X'20'                /* 1=KRDS DATA SET       @OY62462*/ 11077500
E22SLDS  EQU   X'10'                /* 1=LINEAR DATA SET     @OY62462*/ 11125000
E22SRRDS EQU   X'08'                /* 1=RRDS DATA SET       @OY62462*/ 11172500
E22SPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.    */ 11220000
*                                   /* UNSUPPORTED DATA SETS @OY62462*/ 11267500
E22SVVDS EQU   X'02'                /* 1=VVDS DATA SET       @OY62462*/ 11315000
E22SBCS  EQU   X'01'                /* 1=BCS DATA SET        @OY62462*/ 11362500
E22SAIX  EQU   X'80'                /* 1=AIX DATA SET        @OY62462*/ 11410000
E22SVRRD EQU   X'40'                /* 1=VRRDS DATASET       @OY62462*/ 11457500
*        EQU   X'3F'                /* RESERVED              @OY62462*/ 11505000
EI22FLG2 DS    XL1                  /* MORE EXIT 22 FLAGS        @RLS*/ 11508700
EI22RSET EQU   X'80'                /* RESET DS CHANGED FLAG     @RLS*/ 11512400
EI22SSYS EQU   X'40'                /* GET SHARED SYSDSN ENQ     @RLS*/ 11516100
EI22RRB  EQU   X'20'                /* MARK TGT RECOVERY REQ'D   @RLS*/ 11519800
EI22LINF EQU   X'10'                /* LOG INFO PASSED, SEE      @RLS*/ 11523500
*                                   /* EI22LPRM AND EI22LSID     @RLS*/ 11527200
EI22BWOP EQU   X'08'                /* BWO_ALLOWED PASSED, SEE   @RLS*/ 11530900
*                                   /* EI22BWOA                  @RLS*/ 11535000
EI22IMS  EQU   X'04'                /* TYPE=TYPEIMS PROCESS  @OW15980*/ 11535500
EI22BWOE EQU   X'02'                /* ENQ ON BWODSN ONLY,   @OW15980*/ 11536000
*                                   /* NO ADR OR SYS ENQ'S   @OW15980*/ 11536500
*        EQU   X'01'                /* UNUSED                @OW45048*/ 11537300
EI22LPRM DS    CL1                  /* LOG PARAMETER FOR TGT     @RLS*/ 11539600
EI22LSID DS    CL26                 /* LOG STREAM ID FOR TGT     @RLS*/ 11541900
EI22FLG3 DS    XL1                  /* MORE EXIT 22 FLAGS        @RLS*/ 11544200
EI22BWOA EQU   X'F0'                /* BWO_ALLOWED               @RLS*/ 11546500
EI22BRLS EQU   X'08'                /* bypass RLS quiesce     @RLSCDS*/ 11547800
EI22SFSM EQU   X'04'                /* Set reconnectable flag    @FSM*/ 11548700
*        EQU   X'03'                /* UNUSED                 @RLSCDS*/ 11549600
         DS    CL23                 /* AVAILABLE                 @RLS*/ 11550500
*                                                                    */ 11552500
*/********************************************************************/ 11600000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 23:          @V25*/ 11650000
*/*    DATA SET PROCESSED NOTIFICATION EXIT                      @V25*/ 11700000
*/********************************************************************/ 11750000
EIREC23  DSECT                                                /* @V25*/ 11800000
EI23DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/ 11850000
EI23NEWN DS    CL44                 /* NEW DATA SET/CLUSTER NAME @V25*/ 11900000
EI23DSRC DS    XL2                  /* RETURN CODE FOR DATA SET         11950000
*                                      PROCESSING                @V25*/ 12000000
EI23SFLG DS    0CL5                 /* SOURCE DATA SET FLAGS     @V25*/ 12050000
E23SSMSF DS    CL1                  /* SOURCE SMS FLAGS                 12100000
*                                                                @V25*/ 12150000
E23SDSRG DS    CL2                  /* SOURCE DATA SET ORG              12200000
*                                                                @V25*/ 12250000
E23SVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @V25*/ 12300000
E23SESDS EQU   X'80'                /* 1=ESDS DATA SET           @V25*/ 12350000
E23SKSDS EQU   X'40'                /* 1=KSDS DATA SET           @V25*/ 12400000
E23SKRDS EQU   X'20'                /* 1=KRDS DATA SET           @V25*/ 12450000
E23SLDS  EQU   X'10'                /* 1=LINEAR DATA SET         @V25*/ 12500000
E23SRRDS EQU   X'08'                /* 1=RRDS DATA SET           @V25*/ 12550000
E23SPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.       12600000
*                                        UNSUPPORTED DATA SETS   @V25*/ 12650000
E23SVVDS EQU   X'02'                /* 1=VVDS DATA SET           @V25*/ 12700000
E23SBCS  EQU   X'01'                /* 1=BCS DATA SET            @V25*/ 12750000
E23BCSEL EQU   X'40'                /* 1=VRRDS DATA SET      @LA82401*/ 12850000
E23SVRRD EQU   X'20'                /* 1=VRRDS DATA SET      @LA82401*/ 12900000
EI23RRB  EQU   X'10'                /* RECOVERY REQUIRED         @RLS*/ 12933300
*        EQU   X'0F'                /* UNUSED                    @RLS*/ 12966600
EI23TFLG DS    0CL5                 /* TARGET DATA SET FLAGS     @V25*/ 13000000
E23TSMSF DS    CL1                  /* TARGET SMS FLAGS                 13050000
*                                                                @V25*/ 13100000
E23TDSRG DS    CL2                  /* TARGET DATA SET ORG              13150000
*                                                                @V25*/ 13200000
E23TVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @V25*/ 13250000
E23TESDS EQU   X'80'                /* 1=ESDS DATA SET           @V25*/ 13300000
E23TKSDS EQU   X'40'                /* 1=KSDS DATA SET           @V25*/ 13350000
E23TKRDS EQU   X'20'                /* 1=KRDS DATA SET           @V25*/ 13400000
E23TLDS  EQU   X'10'                /* 1=LINEAR DATA SET         @V25*/ 13450000
E23TRRDS EQU   X'08'                /* 1=RRDS DATA SET           @V25*/ 13500000
E23TPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.       13550000
*                                        UNSUPPORTED DATA SETS   @V25*/ 13600000
E23TVVDS EQU   X'02'                /* 1=VVDS DATA SET           @V25*/ 13650000
E23TBCS  EQU   X'01'                /* 1=BCS DATA SET            @V25*/ 13700000
E23TAIX  EQU   X'80'                /* 1=AIX DATA SET        @LA82401*/ 13750000
E23TVRRD EQU   X'40'                /* 1=VRRDS DATA SET      @LA82401*/ 13800000
*        EQU   X'3F'                /* RESERVED              @LA82401*/ 13850000
EI23RLST DS    0CL16                /* RLS TIME STAMPS           @RLS*/ 13855000
EI23GMT  DS    CL8                  /* RLS GMT TIME STAMP        @RLS*/ 13860000
EI23LOC  DS    CL8                  /* RLS LOCAL TIME STAMP      @RLS*/ 13865000
E23BYTES DS    CL8                  /* TOTAL TRACK BYTES RESTORED,      13868300
*                                         COPIED, OR DUMPED  @OW25343*/ 13871600
E23FLGS  DS    XL1                  /* MISC FLAGS            @OW11555*/ 13875000
E23BSET  EQU   X'80'                /* 1=E23BYTES SET        @OW11555*/ 13880000
E23BPDS  EQU   X'40'                /* PDS IS BROKEN         @K131935*/ 13885000
E23BPSE  EQU   X'20'                /* E23BYTES IS FOR PSE   @OW25343*/ 13887500
EI23DEVT DS    CL6                  /* REQUIRED DEVICE TYPE  @K131935*/ 13890000
         DS    CL9                  /* AVAILABLE             @K131935*/ 13895000
EI23VOL# DS    XL1                  /* NUMBER OF VOLUMES         @V25*/ 13900000
EI23VSER DS    118XL6               /* VOLSER ARRAY              @V25*/ 13950000
*/********************************************************************/ 14000000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 24:          @V26*/ 14050000
*/*     CONCURRENT COPY INITIALIZATION COMPLETE                  @V26*/ 14100000
*/********************************************************************/ 14150000
EIREC24  DSECT                            /*                     @V26*/ 14200000
EI24RTCD DS    H                          /* RETURN CODE         @V26*/ 14250000
EI24RSCD DS    H                          /* REASON CODE         @V26*/ 14300000
         DS    F                          /* RESERVED            @V26*/ 14350000
EI24VOL  DS    CL6                        /* VOLUME SERIAL       @V26*/ 14400000
EI24DSN  DS    CL44                       /* DATA SET NAME       @V26*/ 14450000
EI24FLGS DS    XL1                        /* FLAGS               @RLS*/ 14460000
EI24RSET EQU   X'80'                     /* DS CHANGE FLAG RESET @RLS*/ 14470000
*        EQU   X'7F'                      /* UNUSED          @KJT0057*/ 14480000
         DS    CL24                       /* AVAILABLE           @RLS*/ 14490000
*/********************************************************************/ 14490500
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 26:      @OW15980*/ 14491000
*/*    DUMP OUTPUT VOLUME MOUNT NOTIFICATION EXIT            @OW15980*/ 14491500
*/********************************************************************/ 14492000
EIREC26  DSECT                            /*                     @V26*/ 14492500
EI26TYPE DS    XL4                     /* EXIT TYPE          @OW15980*/ 14493000
EI26VOL  EQU   X'80'           /* OUTPUT VOLUME NOTIFICATION @OW15980*/ 14493500
EI26TERM EQU   X'40'           /* OUTPUT VOLUME TERMINATED   @OW15980*/ 14494000
EI26R0CE EQU   X'20'           /* BWO R0 COUNT ERROR         @OW15980*/ 14494500
EI26DSN  DS    CL64            /* DSNAME IF EI26R0CE = '1'B  @OW15980*/ 14495000
EI26DSNL DS    AL1             /* LENGTH OF DSNAME           @OW15980*/ 14495500
         DS    AL3             /* RESERVED FOR ALIGNMENT     @OW15980*/ 14496000
EI26DDN  DS    CL8             /* OUTPUT DDNAME IF           @OW15980*/ 14496500
*                              /* EI26VOL OR EI26TERM SET    @OW15980*/ 14497000
EI26VSER DS    CL6             /* VOLSER - PRESENT IF        @OW15980*/ 14497500
*                              /* EI26VOL OR EI26TERM SET    @OW15980*/ 14498000
         DS    CL2             /* RESERVED FOR ALIGNMENT     @OW15980*/ 14498500
EI26VTRC DS    XL4             /* VOLUME TERMINATION RETURN  @OW15980*/ 14499000
         DS    CL96            /* RESERVED FOR EXPANSION     @OW15980*/ 14499500
         MEND                                                           14500000
*%PLSEID0:;            /* PLS VERSION */                                14550000
*DCL ADREIBID  CHAR(4)   CONSTANT('EIDB');/* BLOCK IDENTIFIER        */ 14600000
*DCL ADREIB@   PTR(31);                   /* PTR TO BLOCK            */ 14650000
*DCL EIRC00    FIXED(15) CONSTANT(0);     /* CONTINUE NORMAL PROCESS */ 14700000
*DCL EIRC04    FIXED(15) CONSTANT(4);     /* RECORD REPLACED         */ 14750000
*DCL EIRC08    FIXED(15) CONSTANT(8);     /* INSERT RECORD           */ 14800000
*DCL EIRC12    FIXED(15) CONSTANT(12);    /* DELETE RECORD           */ 14850000
*DCL EIRC16    FIXED(15) CONSTANT(16);    /* RECORD MODIFIED         */ 14900000
*DCL EIRC20    FIXED(15) CONSTANT(20);    /* DISCONNECT EXIT         */ 14950000
*DCL EIRC24    FIXED(15) CONSTANT(24);    /* SELECT USER STATS RECS  */ 15000000
*DCL EIRC28    FIXED(15) CONSTANT(28);    /* WTOR RESPONSE           */ 15050000
*DCL EIRC32    FIXED(15) CONSTANT(32);    /* TERMINATE FUNCTION  @V22*/ 15100000
*DCL EIRC36    FIXED(15) CONSTANT(36);    /* TERMINATE DSET ONLY @V25*/ 15150000
*DCL EIOP00    FIXED(15) CONSTANT(0);     /* FUNCTION STARTUP ENTRY  */ 15200000
*DCL EIOP01    FIXED(15) CONSTANT(1);     /* READING SYSIN RECORD    */ 15250000
*DCL EIOP02    FIXED(15) CONSTANT(2);     /* PRINTING SYSPRINT RECORD*/ 15300000
*DCL EIOP03    FIXED(15) CONSTANT(3);     /* READING PHYSICAL TAPE   */ 15350000
*DCL EIOP04    FIXED(15) CONSTANT(4);     /* READING LOGICAL TAPE    */ 15400000
*DCL EIOP05    FIXED(15) CONSTANT(5);     /* WRITING LOGICAL TAPE    */ 15450000
*DCL EIOP06    FIXED(15) CONSTANT(6);     /* WRITING PHYSICAL TAPE   */ 15500000
*DCL EIOP07    FIXED(15) CONSTANT(7);     /* READING DISK TRACK      */ 15550000
*DCL EIOP08    FIXED(15) CONSTANT(8);     /* WRITING DISK TRACK      */ 15600000
*DCL EIOP09    FIXED(15) CONSTANT(9);     /* READING UTILITY SYSPRINT*/ 15650000
*DCL EIOP10    FIXED(15) CONSTANT(10);    /* WRITING UTILITY SYSPRINT*/ 15700000
*DCL EIOP11    FIXED(15) CONSTANT(11);    /* WRITING WTO MESSAGE     */ 15750000
*DCL EIOP12    FIXED(15) CONSTANT(12);    /* WRITING WTOR MESSAGE    */ 15800000
*DCL EIOP13    FIXED(15) CONSTANT(13);    /* PRESENTING ADRUFO REC   */ 15850000
*DCL EIOP14    FIXED(15) CONSTANT(14);    /* FUNCTION TERMINATION    */ 15900000
*DCL EIOP15    FIXED(15) CONSTANT(15);    /* PRESENTING WTOR RESPONSE*/ 15950000
*DCL EIOP16    FIXED(15) CONSTANT(16);    /* TAPE VOL SECURITY   @V22*/ 16000000
*DCL EIOP17    FIXED(15) CONSTANT(17);    /* TAPE MOUNT(NON-SPEC)@V22*/ 16050000
*DCL EIOP18    FIXED(15) CONSTANT(18);    /* INSERT LOGICAL REC  @V22*/ 16100000
*DCL EIOP19    FIXED(15) CONSTANT(19);    /* TAPE OUTPUT ERROR   @V22*/ 16150000
*DCL EIOP20    FIXED(15) CONSTANT(20);    /* VOLUME NOTIFICATION @V24*/ 16200000
*DCL EIOP21    FIXED(15) CONSTANT(21);    /* DSET VERIFICATION   @V25*/ 16250000
*DCL EIOP22    FIXED(15) CONSTANT(22);    /* BYPASS VERIFICATION @V25*/ 16300000
*DCL EIOP23    FIXED(15) CONSTANT(23);    /* DS PROC NOTIFICATION@V25*/ 16350000
*DCL VOLSLST   FIXED(15) CONSTANT(708);   /* MAX SIZE OF VOLSER LIST    16400000
*                                      FOR EIREC23 (118 * 6) @NA08383*/ 16450000
*DCL EIOP24    FIXED(15) CONSTANT(24);    /* CC INIT DONE        @V26*/ 16500000
*DCL EIOP25    FIXED(15) CONSTANT(25);   /* BACKSPACE TAPEIN @OW13783*/ 16525000
*DCL EIOP26    FIXED(15) CONSTANT(26);/* VOLUME OPEN FOR O/P @OW15980*/ 16537500
*DCL EXITRECL  FIXED(15) CONSTANT(48);    /* EXIT RECORD LEN @NA08383*/ 16550000
*DCL 1 ADREIB  BASED(ADREIB@) BDY(WORD,3),                              16600000
*      2 EIDLLEN        FIXED (15), /* LENGTH OF ADREIB - 2      @V22*/ 16650000
*      2 EIID           CHAR (4),   /* BLOCK IDENTIFIER EBCDIC "EIDB"*/ 16700000
*      2 EITSKID        FIXED (31), /* TASK ID NUMBER                */ 16750000
*      2 EIXALLOW       BIT   (32), /* USER EXIT ALLOWANCE OPTIONS   */ 16800000
*        3 EIXALOW0     BIT   (8),  /* ALLOWANCE OPTION BYTE 1       */ 16850000
*          4 EIXREP     BIT   (1),  /* ALLOW REPLACE OF RECORD       */ 16900000
*          4 EIXINS     BIT   (1),  /* ALLOW INSERTION OF RECORD     */ 16950000
*          4 EIXDEL     BIT   (1),  /* ALLOW DELETION OF RECORD      */ 17000000
*          4 EIXMOD     BIT   (1),  /* ALLOW MODIFICATION OF RECORD  */ 17050000
*          4 EIXDIS     BIT   (1),  /* ALLOW DISCONNECT OF EXIT      */ 17100000
*          4 EIXWTOR    BIT   (1),  /* ALLOW WTOR RESPONSE           */ 17150000
*          4 EIXSTAT    BIT   (1),  /* ALLOW SELECTION OF USER STATS */ 17200000
*          4 EIXTERM    BIT   (1),  /* ALLOW FUNCTION TERMINATION@V22*/ 17250000
*        3 EIXALOW1     BIT   (8),  /* ALLOWANCE OPTION BYTE 2       */ 17300000
*          4 EIXTDSET   BIT   (1),  /* ALLOW DATA SET TERMINATION@V25*/ 17350000
*          4 *          BIT   (7),  /* UNUSED                        */ 17400000
*        3 EIXALOW2     BIT   (8),  /* ALLOWANCE OPTION BYTE 3       */ 17450000
*          4 *          BIT   (8),  /* RESERVED                      */ 17500000
*        3 EIXALOW3     BIT   (8),  /* ALLOWANCE OPTION BYTE 4       */ 17550000
*          4 EIXERR     BIT   (1),  /* DISALLOWED OPTION ATTEMPTED   */ 17600000
*          4 *          BIT   (7),  /* RESERVED                      */ 17650000
*      2 EIOPTION       FIXED (15), /* PROCESSING OPTION             */ 17700000
*      2 EIRETCOD       FIXED (15), /* EXIT RETURN CODE              */ 17750000
*      2 EIRECALN       FIXED (31), /* RECORD AREA LENGTH            */ 17800000
*      2 EIRECLEN       FIXED (31), /* ORIGINAL RECORD LENGTH        */ 17850000
*      2 EIRECPTR       PTR   (31), /* ORIGINAL RECORD ADDRESS       */ 17900000
*      2 EIUSEPTR       PTR   (31), /* USER DATA AREA ADDRESS   @V22G*/ 17950000
*      2 EIDDID         PTR   (31), /* EIOP06 DDNAME/VOLID PTR  @V22G*/ 18000000
         3 EIXMWPL      PTR   (31), /* EIOP11 WTO PLIST PTR  @OW36779*/ 18025000
*      2 EIXFLAGS       BIT  (32),  /* OTHER FLAGS           @LA09760*/ 18050000
*        3 EIXFLAG0     BIT   (8),  /* FLAG BYTE 0           @LA09760*/ 18100000
*          4 EIXABEND   BIT   (1),  /* FOR EIOP02 ONLY, 1=MESSAGE IS    18150000
*                       ADR013 INDICATING AN ABEND CONDITION @LA09760*/ 18200000
*          4 EIXNTERR   BIT   (1),  /* FOR EIOP02 ONLY, 1=MESSAGE IS    18250000
*                       TYPE 'E' AND IS NOT 324 OR 347       @LA09760*/ 18300000
*          4 EIXWNGOK   BIT   (1),  /* FOR EIOP14 ONLY, 1=WARNING MSGS  18350000
*                       WERE ISSUED AND NONE ARE FATAL       @LA54862*/ 18400000
*          4 EIXTRKER   BIT   (1),  /* TRACK IS IN ERROR     @OW07425*/ 18433300
*          4 *          BIT   (4),  /* RESERVED              @OW07425*/ 18466600
*        3 EIXFLAG1     BIT   (8),  /* FLAG BYTE 1           @LA09760*/ 18500000
*          4 EIXTRC32   BIT   (1),  /* UIM SET EIRETCOD 32   @OW33495*/ 18514200
*          4 *          BIT   (1),  /* RESERVED              @OW13783*/ 18528400
*          4 EIXTDUMS   BIT   (1),  /* DUMMY SOURCE TAPE     @OW13783*/ 18542600
*          4 EIXTDUMT   BIT   (1),  /* DUMMY TARGET TAPE     @OW13783*/ 18556800
*          4 EIXTISXM   BIT   (1),  /* APPL USING XMAPI      @OW13783*/ 18571000
*          4 EIXDASYS   BIT   (1),  /* XMAPI ALLOCATION ERR  @OW21750*/ 18580600
*          4 EIXTWERR   BIT   (1),  /* XMAPI TAPE WRITE ERR  @OW22314*/ 18587000
*          4 EIXTRERR   BIT   (1),  /* XMAPI TAPE READ ERR   @OW22673*/ 18593500
*        3 EIXFLAG2     BIT   (8),  /* FLAG BYTE 2           @LA09760*/ 18600000
*          4 *          BIT   (8),  /* RESERVED              @LA09760*/ 18650000
*        3 EIXFLAG3     BIT   (8),  /* FLAG BYTE 3           @LA09760*/ 18700000
*          4 *          BIT   (8),  /* RESERVED              @LA09760*/ 18750000
*      2 *              CHAR  (0)   /* FORCE SIZE OF CONTROL BLOCK TO*/ 18800000
*        BDY(WORD);                 /* WORD BOUDARY                  */ 18850000
*DCL EIDBLEN FIXED (31) CONSTANT(LENGTH(ADREIB)); /* LENGTH OF BLOCK */ 18900000
*/********************************************************************/ 18910000
*/* RECORD PRESENTED BY EXIT 06 (WRITE PHYSICAL TAPE):       @OW34887*/ 18920000
*/* EIDDINFO IS BASED ON (EIDDID).                           @OW34887*/ 18930000
*/********************************************************************/ 18940000
*DCL 1 EIDDINFO BASED(EIDDID),      /* UIM-06 INFO            @V22AEG*/ 18950000
*      2 EIDDNAME       CHAR (8),   /* O/P DEVICE DDNAME      @V22AEG*/ 19000000
*      2 EIVOLID        CHAR (6),   /* O/P VOLSER             @V22AEG*/ 19050000
*      2 EIRETC         FIXED (8),  /* RESERVED FOR RETCODE   @V22AEG*/ 19100000
*      2 EI06FLGS       FIXED (8),  /* EXIT 06 FLAGS          @V22AEG*/ 19116600
*        3 EI06FTLR     BIT   (1),  /* RESERVED FOR HSM USE  @OW34887*/ 19133200
*        3 *            BIT   (7),  /* RESERVED              @OW34887*/ 19149800
*      2 EI06DCB@       PTR   (31), /* RESERVED FOR HSM USE  @OW34887*/ 19166400
*      2 *              CHAR  (4);  /* RESERVED              @OW34887*/ 19183000
*/********************************************************************/ 19200000
*/* RECORD PRESENTED BY EXIT 00 (FUNCTION STARTUP):          @OY57120*/ 19207100
*/********************************************************************/ 19214200
*DCL 1 EIREC00 CHAR(16) BASED(EIRECPTR),           /*        @OY57120*/ 19221300
*      2 EI00SBPL FIXED(8),         /* SHARED SUBPOOL NUMBER @OY57120*/ 19228400
*      2 EI00FLGS BIT(8),           /* startup flags         @OW20023*/ 19231200
*        3 EI00SENQ BIT(1),         /* short VTOC enqueue    @OW20023*/ 19234000
*        3 EI00NONF BIT(1),         /* 1 = Don't allow IGWNOTIF call    19235400
*                                    0 = Allow IGWNOTIF call @OW28223*/ 19236800
*        3 EI00NOLK BIT(1),         /* 1= NO ADRLOCK ENQ/DEQ @OW42942*/ 19237700
*        3 *        BIT(5),         /* UNUSED                @OW42942*/ 19238600
*      2 * CHAR(14);                /* reserved              @OW20023*/ 19239600
*/********************************************************************/ 19242600
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 14:      @LA65381*/ 19250000
*/* DSS MESSAGE NUMBER ASSOCIATED WITH NON ZERO RETCODE      @LA65381*/ 19300000
*/********************************************************************/ 19350000
*DCL                                                                    19400000
*    1 EIREC14 BASED(EIRECPTR),                                         19450000
*      2 EI14RC        CHAR   (4),     /* DSS RETURN CODE    @LA65381*/ 19500000
*      2 EI14MESS      CHAR   (4),     /* DSS MESSAGE        @LA65381*/ 19550000
*        3 EI14MNUM    CHAR   (3),     /*  MESSAGE NUMBER    @LA65381*/ 19600000
*        3 EI14MTYP    CHAR   (1),     /*  MESSAGE TYPE      @OW13783*/ 19633300
*      2 EI14CPUT      CHAR   (8);     /* DSS CPU TIME       @OW13783*/ 19666600
*/********************************************************************/ 19700000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 20: VOLUME   @V24*/ 19750000
*/* NOTIFICATION EXIT.                                           @V24*/ 19800000
*/********************************************************************/ 19850000
*DCL                                                                    19900000
*    1 EIREC20 BASED(EIRECPTR),                                         19950000
*      2 EI20DSN       CHAR   (44),    /* DATA SET NAME/CLUSTER NAME    20000000
*                                                                @V24*/ 20050000
*      2 EI20FLGS      BIT     (8),    /* SOME FLAGS:            @V24*/ 20100000
*        3  EI20VSAM   BIT     (1),    /* 1=DATA SET IS VSAM            20150000
*                                         0=DATA SET IS NONVSAM  @V24*/ 20200000
*        3  EI20RACF   BIT     (1),    /* 1=DATA SET IS PROTECTED BY A  20250000
*                                         DISCRETE RACF PROFILE  @V24*/ 20300000
*        3  *          BIT     (6),    /* RESERVED               @V24*/ 20350000
*      2 *             CHAR    (1),    /* RESERVED               @V24*/ 20400000
*      2 EI20DA#       FIXED   (8),    /* NUMBER OF DATA COMPONENTS     20450000
*                                                                @V24*/ 20500000
*      2 EI20IX#       FIXED   (8),    /* NUMBER OF INDEX COMPONENTS    20550000
*                                         (0 IF NONVSAM)         @V24*/ 20600000
*      2 EI20DA@       PTR    (31),    /* POINTER TO DATA COMPONENT     20650000
*                                         INFO FOR VSAM/DATA SET        20700000
*                                         INFO FOR NONVSAM       @V24*/ 20750000
*      2 EI20IX@       PTR    (31);    /* POINTER TO INDEX COMPONENT    20800000
*                                         INFO FOR VSAM/0 FOR NONVSAM   20850000
*                                                                @V24*/ 20900000
*/********************************************************************/ 20950000
*/* FOR A NONVSAM DATA SET, EI20DA@ WILL POINT TO A SINGLE       @V24*/ 21000000
*/* EI20DSI STRUCTURE.  FOR A VSAM CLUSTER, EI20DA@ POINTS TO AN @V24*/ 21050000
*/* ARRAY OF STRUCTURES (ONE FOR EACH DATA COMPONENT), AND       @V24*/ 21100000
*/* EI20IX@ POINTS TO A SIMILAR ARRAY FOR THE INDEX COMPONENTS   @V24*/ 21150000
*/********************************************************************/ 21200000
*DCL                                                                    21250000
*    1 EI20DSI BASED,                  /* DATA SET INFO          @V24*/ 21300000
*      2 EI20CON       CHAR   (44),    /* COMPONENT NAME (BLANKS FOR    21350000
*                                         NONVSAM)               @V24*/ 21400000
*      2 EI20NVOL      FIXED  (16),    /* # OF VOLUMES IN DS     @V24*/ 21450000
*      2 *             CHAR    (2),    /* RESERVED               @V24*/ 21500000
*      2 EI20VLI,                      /* VOLUME INFORMATION  @KUI406*/ 21550000
*        3  EI20VOL    CHAR    (6),    /* VOLSER                 @V24*/ 21600000
*        3  *          CHAR    (2),    /* RESERVED               @V24*/ 21650000
*        3  EI20RBA    FIXED  (32);    /* RBA TOKEN                     21700000
*                                                                @V24*/ 21750000
*/********************************************************************/ 21800000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 21:          @V25*/ 21850000
*/*    DATA SET VERIFICATION EXIT                                @V25*/ 21900000
*/********************************************************************/ 21950000
*DCL                                                                    22000000
*    1 EIREC21 BASED(EIRECPTR),                               /* @V25*/ 22050000
*      2 EI21DSN       CHAR   (44);    /* DATA SET/CLUSTER NAME  @V25*/ 22100000
*/********************************************************************/ 22150000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 22:          @V25*/ 22200000
*/*    BYPASS VERIFICATION EXIT                                  @V25*/ 22250000
*/********************************************************************/ 22300000
*DCL                                                                    22350000
*    1 EIREC22 BASED(EIRECPTR),                               /* @V25*/ 22400000
*      2 EI22DSN       CHAR   (44),    /* DATA SET/CLUSTER NAME  @V25*/ 22450000
*      2 EI22FLGS      BIT     (8),    /* EXIT 22 FLAGS:         @V25*/ 22500000
*        3  EI22BSER   BIT     (1),    /* 1=BYPASS                      22550000
*                                           SERIALIZATION        @V25*/ 22600000
*        3  EI22BSEC   BIT     (1),    /* 1=BYPASS DATASET LEVEL,       22618700
*                                           STORCLAS & MGMTCLAS         22637400
*                                           SECURITY CHECKS. ALSO       22656100
*                                           BYPASS JES3 INTEGRITY       22674800
*                                           CHECKS AND DO NOT CREATE    22693500
*                                           DISCRETE DATASET PROFILES.  22712200
*                                                            @OY60302*/ 22730900
*        3  EI22BMIG   BIT     (1),    /* 1=TOLERATE MIGRATED VOLSER    22750000
*                                           FOR NONVSAM DSETS           22800000
*                                           (RESTORE ONLY)     @DS007*/ 22850000
*        3  EI22NSYS   BIT     (1),    /* BYPASS SYSDSN ENQ       @L4A  22900000
*                                        SWAPPED W/ EI22SIRS @OW01655*/ 22950000
*        3  EI22LIKE   BIT     (1),    /* RESTORE/COPY DATA SET TO      23000000
*                                         A LIKE DEVICE TYPE @LA71949*/ 23050000
*        3  EI22EXTR   BIT     (1),    /* RESTORE DATA SET TO EXTENT    23100000
*                                         REDUCTION VOLUME   @NA06820*/ 23150000
*        3  EI22SIRS   BIT     (1),    /* SET INCMPLT RECALL @OW01655   23183300
*                                        SWAPPED W/ EI22NSYS @OW01655*/ 23216600
*        3  EI22DB2    BIT     (1),    /* SET DB2 FLAG IN A  @OW45048   23259990
                                         RENAME              @OW45048*/ 23269980
*/********************************************************************/ 23300000
*/* THE FOLLOWING WERE REMOVED FROM THE MAP OF THE RECORD    @OY62462*/ 23350000
*/*   PRESENTED TO EXIT 22 BUT ARE NOW USED                  @OY62462*/ 23400000
*/********************************************************************/ 23450000
*      2 EI22SFLG,                   /* SOURCE DATA SET FLGS @OY62462*/ 23500000
*        3 E22SSMSF    CHAR    (1),  /* SOURCE SMS FLAGS                23550000
*                                                            @OY62462*/ 23600000
*        3 E22SDSRG    CHAR    (2),  /* SOURCE DATA SET ORG             23650000
*                                                            @OY62462*/ 23700000
*        3 E22SVFLG    BIT    (16),  /* SRCE VSAM DSET FLAGS @OY62462*/ 23750000
*          4 E22SESDS  BIT     (1),  /* 1=ESDS DATA SET      @OY62462*/ 23800000
*          4 E22SKSDS  BIT     (1),  /* 1=KSDS DATA SET      @OY62462*/ 23850000
*          4 E22SKRDS  BIT     (1),  /* 1=KRDS DATA SET      @OY62462*/ 23900000
*          4 E22SLDS   BIT     (1),  /* 1=LINEAR DATA SET    @OY62462*/ 23950000
*          4 E22SRRDS  BIT     (1),  /* 1=RRDS DATA SET      @OY62462*/ 24000000
*          4 E22SPSSI  BIT     (1),  /* 1=PAGE/SWAP/STGINDEX, ETC.   */ 24050000
*                                    /* UNSUPPRTED DATA SETS @OY62462*/ 24100000
*          4 E22SVVDS  BIT     (1),  /* 1=VVDS DATA SET      @OY62462*/ 24150000
*          4 E22SBCS   BIT     (1),  /* 1=BCS DATA SET       @OY62462*/ 24200000
*          4 E22SAIX   BIT     (1),  /* 1=AIX DATA SET       @OY62462*/ 24250000
*          4 E22SVRRD  BIT     (1),  /* VRRDS DATASET        @OY62462*/ 24300000
*          4 *         BIT     (6),  /* RESERVED             @OY62462*/ 24308300
*      2 EI22FLG2      BIT     (8),  /* MORE EXIT 22 FLAGS       @RLS*/ 24315500
*        3  EI22RSET   BIT     (1),  /* RESET DS CHANGED FLAG    @RLS*/ 24322700
*        3  EI22SSYS   BIT     (1),  /* GET SHARED SYSDSN ENQ    @RLS*/ 24329900
*        3  EI22RRB    BIT     (1),  /* MARK TGT RECOVRY REQ'D   @RLS*/ 24337100
*        3  EI22LINF   BIT     (1),  /* LOG INFO PASSED, SEE            24344300
*                                       EI22LPRM AND EI22LSID    @RLS*/ 24351500
*        3  EI22BWOP   BIT     (1),  /* BWO_ALLOWED PASSED, SEE         24358700
*                                       EI22BWOA                 @RLS*/ 24366300
*        3  EI22IMS    BIT     (1),  /* TYPE=TYPEIMS PROCESS @OW15980*/ 24368000
*        3  EI22BWOE   BIT     (1),  /* ENQ ON BWODSN ONLY,  @OW15980*/ 24369700
*                                    /* NO ADR OR SYS ENQ'S  @OW15980*/ 24371400
*        3  *          BIT     (1),  /* UNUSED               @OW15980*/ 24373100
*      2 EI22LPRM      CHAR    (1),  /* LOG PARAMETER FOR TGT    @RLS*/ 24375100
*      2 EI22LSID      CHAR   (26),  /* LOG STREAM ID FOR TGT    @RLS*/ 24379500
*      2 EI22FLG3      BIT     (8),  /* MORE EXIT 22 FLAGS       @RLS*/ 24383900
*        3 EI22BWOA    BIT     (4),  /* BWO_ALLOWED              @RLS*/ 24388600
*        3 EI22BRLS    BIT     (1),  /* bypass RLS quiesce    @RLSCDS*/ 24391100
*        3 EI22SFSM    BIT     (1),  /* set reconnectable flag   @FSM*/ 24392800
*        3  *          BIT     (2),  /* UNUSED                @RLSCDS*/ 24394500
*      2 *             CHAR   (23);  /* AVAILABLE                @RLS*/ 24396200
*/********************************************************************/ 24400000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 23:          @V25*/ 24450000
*/*    DATA SET PROCESSED NOTIFICATION EXIT                      @V25*/ 24500000
*/********************************************************************/ 24550000
*DCL                                                                    24600000
*    1 EIREC23 BASED(EIRECPTR),                               /* @V25*/ 24650000
*     2 EI23CNST,                      /* CONSTANT LENGTH               24700000
*                                         PORTION OF CONTROL BLK @V26*/ 24750000
*      3 EI23DSN       CHAR   (44),    /* DATA SET/CLUSTER NAME  @V25*/ 24800000
*      3 EI23NEWN      CHAR   (44),    /* NEW DSET/CLUSTER NAME  @V25*/ 24850000
*      3 EI23DSRC      FIXED  (15),    /* RETURN CODE FOR DATA          24900000
*                                         SET PROCESSING         @V25*/ 24950000
*      3 EI23SFLG,                     /* SOURCE DATA SET FLAGS  @V25*/ 25000000
*        4 E23SSMSF    CHAR    (1),    /* SOURCE SMS FLAGS              25050000
*                                                                @V25*/ 25100000
*        4 E23SDSRG    CHAR    (2),    /* SOURCE DATA SET ORG           25150000
*                                                                @V25*/ 25200000
*        4 E23SVFLG    BIT    (16),    /* SOURCE VSAM DSET FLAGS @V25*/ 25250000
*          5 E23SESDS  BIT     (1),    /* 1=ESDS DATA SET        @V25*/ 25300000
*          5 E23SKSDS  BIT     (1),    /* 1=KSDS DATA SET        @V25*/ 25350000
*          5 E23SKRDS  BIT     (1),    /* 1=KRDS DATA SET        @V25*/ 25400000
*          5 E23SLDS   BIT     (1),    /* 1=LINEAR DATA SET      @V25*/ 25450000
*          5 E23SRRDS  BIT     (1),    /* 1=RRDS DATA SET        @V25*/ 25500000
*          5 E23SPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.    25550000
*                                         UNSUPPORTED DATA SETS  @V25*/ 25600000
*          5 E23SVVDS  BIT     (1),    /* 1=VVDS DATA SET        @V25*/ 25650000
*          5 E23SBCS   BIT     (1),    /* 1=BCS DATA SET         @V25*/ 25700000
*          5 E23SAIX   BIT     (1),    /* 1=AIX DATA SET         @V25*/ 25750000
*          5 E23BCSEL  BIT     (1),    /* 1=BASE CLUSTER SELECTED       25800000
*                                                            @LA82401*/ 25850000
*          5 E23SVRRD  BIT     (1),    /* VRRDS DATASET      @LA82401*/ 25900000
*          5 EI23RRB   BIT     (1),    /* RECOVERY REQUIRED      @RLS*/ 25943700
*          5 *         BIT     (4),    /* UNUSED                 @RLS*/ 25987400
*      3 EI23TFLG,                     /* TARGET DATA SET FLAGS  @V25*/ 26031100
*        4 E23TSMSF    CHAR    (1),    /* TARGET SMS FLAGS              26074800
*                                                                @V25*/ 26118500
*        4 E23TDSRG    CHAR    (2),    /* TARGET DATA SET ORG           26162200
*                                                                @V25*/ 26205900
*        4 E23TVFLG    BIT    (16),    /* TARGET VSAM DSET FLAGS @V25*/ 26250000
*          5 E23TESDS  BIT     (1),    /* 1=ESDS DATA SET        @V25*/ 26300000
*          5 E23TKSDS  BIT     (1),    /* 1=KSDS DATA SET        @V25*/ 26350000
*          5 E23TKRDS  BIT     (1),    /* 1=KRDS DATA SET        @V25*/ 26400000
*          5 E23TLDS   BIT     (1),    /* 1=LINEAR DATA SET      @V25*/ 26450000
*          5 E23TRRDS  BIT     (1),    /* 1=RRDS DATA SET        @V25*/ 26500000
*          5 E23TPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.    26550000
*                                         UNSUPPORTED DATA SETS  @V25*/ 26600000
*          5 E23TVVDS  BIT     (1),    /* 1=VVDS DATA SET        @V25*/ 26650000
*          5 E23TBCS   BIT     (1),    /* 1=BCS DATA SET         @V25*/ 26700000
*          5 E23TAIX   BIT     (1),    /* 1=AIX DATA SET         @V25*/ 26750000
*          5 E23TVRRD  BIT     (1),    /* VRRDS DATASET      @LA82401*/ 26800000
*          5 *         BIT     (6),    /* RESERVED           @LA82401*/ 26850000
*      3 EI23RLST,                     /* RLS TIME STAMPS        @RLS*/ 26853500
*        4 EI23GMT     CHAR    (8),    /* RLS GMT TIME STAMP     @RLS*/ 26857000
*        4 EI23LOC     CHAR    (8),    /* RLS LOCAL TIME STAMP   @RLS*/ 26860500
*      3 E23BYTES      CHAR    (8),    /* TOTAL TRACK BYTES RESTORED,   26862800
*                                         COPIED, OR DUMPED  @OW25343*/ 26865100
*      3 E23FLGS       CHAR    (1),    /* MISC FLAGS         @OW11555*/ 26867500
*          5 E23BSET   BIT     (1),    /* 1=E23BYTES SET     @OW11555*/ 26871000
*          5 E23BPDS   BIT     (1),    /* 1=BROKEN PDS       @K131935*/ 26874500
*          5 E23BPSE   BIT     (1),    /* E23BYTES IS FOR PSE@OW25343*/ 26876800
*          5 *         BIT     (5),    /* AVAILABLE FOR USE  @OW25343*/ 26879100
*      3 EI23DNAM      CHAR    (6),    /* NAME OF DEVICE NEEDED         26881500
*                                         TO DO NOPACKING FOR THE       26885000
*                                         BROKEN PDS (I.E. A LIKE       26888500
*                                         DEVICE)            @K131935*/ 26892000
*      3 *             CHAR    (9),    /* RESERVED           @K131935*/ 26895500
*      3 EI23VOL#      FIXED   (8),    /* NUMBER OF VOLUMES      @V25*/ 26900000
*      2 EI23VSER(*)   CHAR    (6);    /* VOLSER ARRAY           @V25*/ 26950000
*/********************************************************************/ 27000000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 24:          @V26*/ 27050000
*/*    CONCURRENT COPY INITIALIZATION COMPLETE                   @V26*/ 27100000
*/********************************************************************/ 27150000
*DCL                                                                    27200000
*    1 EIREC24 BASED(EIRECPTR),                               /* @V26*/ 27250000
*      2 EI24RTCD      FIXED  (16),    /* RETURN CODE            @V26*/ 27300000
*      2 EI24RSCD      FIXED  (16),    /* REASON CODE            @V26*/ 27350000
*      2 *             FIXED  (32),    /* RESERVED               @V26*/ 27400000
*      2 EI24VOL       CHAR   (6),     /* VOLUME SERIAL          @V26*/ 27450000
*      2 EI24DSN       CHAR   (44),    /* DATA SET NAME          @V26*/ 27500000
*      2 EI24FLGS      BIT     (8),    /* FLAGS                  @RLS*/ 27550000
*        3 EI24RSET    BIT     (1),    /* DS CHANGE FLAG RESET   @RLS*/ 27600000
*        3 *           BIT     (7),    /* UNUSED                 @RLS*/ 27650000
*      2 *             CHAR   (24);    /* AVAILABLE              @RLS*/ 27700000
*/********************************************************************/ 27750000
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 26:      @OW15980*/ 27800000
*/*    DUMP OUTPUT VOLUME MOUNT NOTIFICATION EXIT            @OW15980*/ 27850000
*/********************************************************************/ 27900000
*DCL                                                                    27950000
*    1 EIREC26 BASED(EIRECPTR),        /*                    @OW15980*/ 28000000
*      2 EI26TYPE BIT(32),             /* EXIT TYPE          @OW15980*/ 28050000
*        4 EI26VOL BIT(1),     /* OUTPUT VOLUME NOTIFICATION @OW15980*/ 28100000
*        4 EI26TERM BIT(1),    /* OUTPUT VOLUME TERMINATED   @OW15980*/ 28150000
*        4 EI26R0CE BIT(1),    /* BWO R0 COUNT ERROR         @OW15980*/ 28200000
*        4 *         BIT(29),  /* RESERVED FOR EXPANSION     @OW15980*/ 28250000
*      2 EI26DSN   CHAR(64),   /* DSNAME IF EI26R0CE = '1'B  @OW15980*/ 28300000
*      2 EI26DSNL  FIXED(8),   /* LENGTH OF DSNAME           @OW15980*/ 28350000
*      2 *         FIXED(24),  /* RESERVED FOR ALIGNMENT     @OW15980*/ 28400000
*      2 EI26DDN   CHAR(8),    /* OUTPUT DDNAME IF           @OW15980*/ 28450000
*                              /* EI26VOL OR EI26TERM SET    @OW15980*/ 28500000
*      2 EI26VSER  CHAR(6),    /* VOLSER - PRESENT IF        @OW15980*/ 28550000
*                              /* EI26VOL OR EI26TERM SET    @OW15980*/ 28600000
*      2 *         CHAR(2),    /* RESERVED FOR ALIGNMENT     @OW15980*/ 28650000
*      2 EI26VTRC  FIXED(32),  /* VOLUME TERMINATION RETURN  @OW15980*/ 28700000
*      2 * CHAR(96);           /* RESERVED FOR EXPANSION     @OW15980*/ 28750000
