*        %GOTO GTOPLS1;            /* BILINGUAL MAPPING                 00050000
         MACRO                                                          00100000
         AHLZGTO                                                        00150000
         AGO   .GTOASM                SKIP PL/AS MACRO STATEMENT     */ 00200000
*%GTOPLS1:;                        /* BAL-PL/AS HEADER                  00250000
.GTOASM ANOP                                                         */ 00300000
*/** START OF SPECIFICATIONS ***************************************    00350000
*                                                                       00400000
*01* MACRO NAME:  AHLZGTO.                                              00450000
*                                                                       00500000
*01* DESCRIPTIVE NAME:  GTF TRACE OPTIONS MAPPING.                      00550000
*                                                                       00600000
*01* COMPONENT:  SC111 (GENERALIZED TRACE FACILITY).                    00650000
*                                                                       00700000
*01* COPYRIGHT:                                                         00750000
*                                                                       00800000
*        5695-047                                                       00850000
*        THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    00900000
*        (C) COPYRIGHT IBM CORP. 1990                                   00950000
*        LICENSED MATERIALS - PROPERTY OF IBM                           01000000
*                                                                       01050000
*01* STATUS:  HBB4410.                                                  01100000
*                                                                       01150000
*01* FUNCTION:                                                          01200000
*                                                                       01250000
*      AHLZGTO DESCRIBES THE GTF OPTIONS IN THE CONTROL RECORDS IN      01300000
*      THE GTF TRACE DATA SET.  IT DEFINES THE FOLLOWING STRUCTURE:     01350000
*                                                                       01400000
*          GTO   - THE GTF OPTIONS.                                     01450000
*                                                                       01500000
*01* METHOD OF ACCESS:                                                  01550000
*                                                                       01600000
*02*   ACCESS UNDER ASSEMBLER:                                          01650000
*                                                                       01700000
*          AHLZGTO                                                      01750000
*                                                                       01800000
*        THIS DEFINES A DSECT, GTO, THAT MAPS THE GTF TRACE OPTION      01850000
*        FIELDS.  IEZBITS DEFINES BIT POSITIONS WITHIN BYTES.           01900000
*                                                                       01950000
*02*   ACCESS UNDER PL/AS:                                              02000000
*                                                                       02050000
*        GTO has a macro variable GTO_BASE that defines its basing.     02100000
*                                                                       02150000
*        The default is BASED.  You can get this by not specifying      02200000
*        GTO_BASE, or by setting it equal to 'BASED', a null character  02250000
*        string, or any number of blanks:                               02300000
*                                                                       02350000
*           %INCLUDE SYSLIB(AHLZGTO)                                    02400000
*                                                                       02450000
*        For a mapping of GTO based on GTOPTR:                          02500000
*                                                                       02550000
*           %GTO_BASE = 'BASED(GTOPTR)'                                 02600000
*           %INCLUDE SYSLIB(AHLZGTO)                                    02650000
*           DCL GTOPTR                                                  02700000
*                                                                       02750000
*        To get an unbased structure, set GTO_BASE equal to 'STATIC'    02800000
*        or 'AUTOMATIC'.  For an unbased mapping of GTO in a reentrant  02850000
*        module:                                                        02900000
*                                                                       02950000
*           %GTO_BASE = 'AUTOMATIC'                                     03000000
*           %INCLUDE SYSLIB(AHLZGTO)                                    03050000
*                                                                       03100000
*        To declare GTO as having the same location as the GTF options  03150000
*        in the GTF source descriptor GTS:                              03200000
*                                                                       03250000
*           %GTO_BASE = 'DEFINED(GTSOPTS)'                              03300000
*           %INCLUDE SYSLIB(AHLZGTO)                                    03350000
*                                                                       03400000
*        Note: If a structure like GTO is declared as DEFINED on a      03450000
*        field in a second structure, then explicit pointer notation    03500000
*        for the DEFINED structure refers to the beginning of the       03550000
*        second structure, not the DEFINED one.                         03600000
*                                                                       03650000
*01* POINTED TO BY:  (NOT APPLICABLE)                                   03700000
*                                                                       03750000
*01* CREATED BY:  THE TRACE WRITER AND THE COPYTRC IPCS SUBCOMMAND.     03800000
*                                                                       03850000
*01* DELETED BY:  NONE.                                                 03900000
*                                                                       03950000
*01* STORAGE ATTRIBUTES:  N/A.                                          04000000
*                                                                       04050000
*01* SIZE:  VARIABLE.                                                   04100000
*                                                                       04150000
*01* SERIALIZATION:  NONE.                                              04200000
*                                                                       04250000
*01* NOTES:                                                             04300000
*                                                                       04350000
*        GTOBYTE5 IN THE TRACE DATA SET CONTROL RECORDS CONTAINS        04360000
*        BITS THAT ARE NOT GTF OPTIONS BUT DATA SET CONTROL             04370000
*        INFORMATION.  SEE MAPPING AHLZGTW.                             04380000
*                                                                       04390000
*02*   DEPENDENCIES:  INCLUDES MACRO IEZBITS.                           04400000
*                                                                       04450000
*01* DISTRIBUTION LIBRARY:  AMACLIB.                                    04500000
*                                                                       04550000
*01* CHANGE ACTIVITY:                                                   04600000
*                                                                       04650000
* Flag  Reason  Release  Date Origin Description                        04700000
*                                                                       04750000
* $L0= GTFHM    HBB4410 890206 PD881V: GTF High-MIPS Enhancements. @L0A 04800000
*                                                                       04850000
**** END OF SPECIFICATIONS *******************************************/ 04900000
*        %GOTO GTOPLS2;             /* Bilingual mapping                04950000
         IEZBITS                                                        05000000
         EJECT 1                                                        05050000
*********************************************************************** 05100000
*                                                                     * 05150000
* GTO: GENERALIZED TRACE FACILITY OPTIONS MAPPING. OPTIONS OF THE     * 05200000
* FORM XXX, XXXP AND XXXM ARE MUTUALLY EXCLUSIVE.                     * 05250000
*                                                                     * 05300000
*********************************************************************** 05350000
         SPACE 1                                                        05400000
GTO      DSECT -        THE GTF TRACE OPTIONS.                          05450000
GTOBYTE0 DS    XL1                                                      05500000
GTOSYSM  EQU   BIT0     SYSM - RECORDS MINIMAL DATA FOR SYSTEM EVENTS.  05550000
*                       - RECORDS EVENTS AS IF EACH OF THE FOLLOWING    05600000
*                       OPTIONS IS SPECIFIED, EXCEPT THAT MINIMAL       05650000
*                       TRACE DATA IS RECORDED: EXT, PI, SVC AND RR.    05700000
*                       - RECORDS EVENTS AS IF EACH OF THE FOLLOWING    05750000
*                       OPTIONS IS SPECIFIED: IO, SSCH, CSCH, HSCH AND  05800000
*                       MSCH.                                           05850000
*                       - IF ANY OF THE FOLLOWING OPTIONS ARE SPECIFIED 05900000
*                       CAUSES MINIMAL RECORDING TO BE DONE FOR THEM:   05950000
*                       DSP, RNIO AND SRM.                              06000000
*                       - THE FOLLOWING OPTIONS ARE IGNORED: EXT, PI,   06050000
*                       SVC, RR, IO, SSCH, CSCH, HSCH AND MSCH.         06100000
*                                                                       06150000
GTOSYSP  EQU   BIT1     SYSP - RECORDS COMPREHENSIVE TRACE DATA FOR     06200000
*                       SYSTEM EVENTS, WITH PROMPTING.                  06250000
*                       - GTF PROMPTS THE OPERATOR FOR THE ONLY PI,     06300000
*                       SVC, IO AND SSCH EVENTS THAT WILL HAVE DATA     06350000
*                       RECORDED.                                       06400000
*                       - OTHERWISE, GTF RECORDS THE SAME EVENTS AS     06450000
*                       THOSE RECORDED BY SYS.                          06500000
*                       - GTF IGNORES THE FOLLOWING OPTIONS: EXT, PI,   06550000
*                       SVC, RR, IO, SSCH, CSCH, HSCH AND MSCH.         06600000
*                                                                       06650000
GTOSYS   EQU   BIT2     SYS - RECORDS COMPREHENSIVE TRACE DATA FOR      06700000
*                       SYSTEM EVENTS.                                  06750000
*                       - RECORDS EVENTS AS IF EACH OF THE FOLLOWING    06800000
*                       OPTIONS IS SPECIFIED: EXT, PI, SVC, RR, IO,     06850000
*                       SSCH, CSCH, HSCH AND MSCH.                      06900000
*                       - THE FOLLOWING OPTIONS ARE IGNORED: EXT, PI,   06950000
*                       SVC, RR, IO, SSCH, CSCH, HSCH AND MSCH.         07000000
*                                                                       07050000
GTOUSR   EQU   BIT3     USR - RECORDS ALL USER TRACE DATA PASSED TO GTF 07100000
*                       BY THE GTRACE MACRO.                            07150000
         EJECT 1                                                        07200000
GTOTRC   EQU   BIT4     TRC - RECORDS EVENTS ASSOCIATED WITH GTF        07250000
*                       ITSELF.  THIS CAUSES TRACING ONLY WHEN AT LEAST 07300000
*                       ONE OTHER TYPE OF EVENT IS BEING TRACED.        07350000
*                                                                       07400000
GTODSP   EQU   BIT5     DSP - RECORDS DISPATCHER EVENTS. IF SYSM IS     07450000
*                       ALSO SPECIFIED, GTF RECORDS MINIMAL TRACE DATA. 07500000
*                       OTHERWISE, GTF RECORDS COMPREHENSIVE TRACE      07550000
*                       DATA.                                           07600000
*                                                                       07650000
GTOPCI   EQU   BIT7     PCI - RECORDS I/O INTERRUPTIONS THAT INDICATE   07700000
*                       INTERMEDIATE STATUS. THESE INCLUDE              07750000
*                       PROGRAM-CONTROLLED INTERRUPTIONS (PCIS),        07800000
*                       INITIAL STATUS REQUEST INTERRUPTIONS, AND       07850000
*                       RESUME AND SUSPEND CHANNEL PROGRAM              07900000
*                       INTERRUPTIONS.                                  07950000
*                       - WHEN IOP SPECIFIES PARTICULAR DEVICES, PCI    08000000
*                       APPLIES ONLY TO THEM.                           08050000
*                       - PCI CAUSES TRACING ONLY WHEN ONE OF THE       08100000
*                       FOLLOWING IS ALSO SPECIFIED: IO, IOP, SYS,      08150000
*                       SYSM, SYSP.                                     08200000
         EJECT 1                                                        08250000
GTOBYTE1 DS    XL1                                                      08300000
GTOSVC   EQU   BIT0     SVC - RECORDS SUPERVISOR CALL INTERRUPTIONS. IF 08350000
*                       SYSM IS ALSO SPECIFIED, GTF RECORDS MINIMAL     08400000
*                       TRACE DATA. OTHERWISE, GTF RECORDS              08450000
*                       COMPREHENSIVE TRACE DATA.                       08500000
*                                                                       08550000
GTOSVCP  EQU   BIT1     SVCP - LIKE SVC, BUT GTF PROMPTS THE OPERATOR   08600000
*                       FOR THE ONLY SVC NUMBERS THAT WILL HAVE DATA    08650000
*                       RECORDED.                                       08700000
*                                                                       08750000
GTOSIO   EQU   BIT2     SIO - RECORDS START I/O OPERATIONS - EQUIVALENT 08800000
*                       TO SSCH.                                        08850000
*                                                                       08900000
GTOSIOP  EQU   BIT3     SIOP - SIO WITH PROMPTING - EQUIVALENT TO       08950000
*                       SSCHP.                                          09000000
*                                                                       09050000
GTOPI    EQU   BIT4     PI - RECORDS PROGRAM INTERRUPTIONS. IF SYSM IS  09100000
*                       ALSO SPECIFIED, GTF RECORDS MINIMAL TRACE DATA. 09150000
*                       OTHERWISE, GTF RECORDS COMPREHENSIVE TRACE      09200000
*                       DATA.                                           09250000
*                                                                       09300000
GTOPIP   EQU   BIT5     PIP - LIKE PI, BUT GTF PROMPTS THE OPERATOR FOR 09350000
*                       THE ONLY PROGRAM INTERRUPTION CODES THAT WILL   09400000
*                       HAVE DATA RECORDED.                             09450000
*                                                                       09500000
GTOIO    EQU   BIT6     IO - RECORDS I/O INTERRUPTIONS. GTF DOES NOT    09550000
*                       RECORD INTERMEDIATE-STATUS INTERRUPTIONS UNLESS 09600000
*                       PCI IS ALSO SPECIFIED.                          09650000
*                                                                       09700000
GTOIOP   EQU   BIT7     IOP - LIKE IO, BUT GTF PROMPTS THE OPERATOR FOR 09750000
*                       THE ONLY DEVICES THAT WILL HAVE DATA RECORDED.  09800000
         EJECT 1                                                        09850000
GTOBYTE2 DS    XL1                                                      09900000
GTOEXT   EQU   BIT0     EXT- RECORDS EXTERNAL INTERRUPTIONS. IF SYSM IS 09950000
*                       ALSO SPECIFIED, GTF RECORDS MINIMAL TRACE DATA. 10000000
*                       OTHERWISE, GTF RECORDS COMPREHENSIVE TRACE      10050000
*                       DATA.                                           10100000
*                                                                       10150000
GTORNIO  EQU   BIT1     RNIO - RECORDS VTAM (REMOTE NETWORK) ACTIVITY.  10200000
*                       IF SYSM IS ALSO SPECIFIED, GTF RECORDS MINIMAL  10250000
*                       TRACE DATA. OTHERWISE, GTF RECORDS              10300000
*                       COMPREHENSIVE TRACE DATA. THIS CAUSES TRACING   10350000
*                       ONLY WHEN VTAM TRACING IS ACTIVE.               10400000
*                                                                       10450000
GTOSRM   EQU   BIT2     SRM - RECORDS CALLS TO THE SYSTEM RESOURCE      10500000
*                       MANAGER. IF SYSM IS ALSO SPECIFIED, GTF RECORDS 10550000
*                       MINIMAL TRACE DATA.  OTHERWISE, GTF RECORDS     10600000
*                       COMPREHENSIVE TRACE DATA.                       10650000
*                                                                       10700000
GTORR    EQU   BIT3     RR - RECORDS DATA ASSOCIATED WITH RECOVERY      10750000
*                       ROUTINES, SUCH AS ESTAES AND STAES. IF SYSM IS  10800000
*                       ALSO SPECIFIED, GTF RECORDS MINIMAL TRACE DATA. 10850000
*                       OTHERWISE, GTF RECORDS COMPREHENSIVE TRACE      10900000
*                       DATA.                                           10950000
*                                                                       11000000
GTOSLIP  EQU   BIT4     SLIP - RECORDS SLIP TRAP DATA.                  11050000
*                                                                       11100000
GTOCCW   EQU   BIT5     CCW - RECORDS CHANNEL PROGRAM DATA. THIS CAUSES 11150000
*                       TRACING ONLY WHEN ONE OF THE FOLLOWING OPTIONS  11200000
*                       IS SPECIFIED: SSCH, SSCHP, IO, OR IOP.          11250000
*                                                                       11300000
GTOCCWP  EQU   BIT6     CCWP - LIKE CCW, BUT GTF WILL PROMPT THE        11350000
*                       OPERATOR FOR THE FOLLOWING INFORMATION: WHETHER 11400000
*                       TO TRACE DATA FOR SSCH OPERATIONS OR I/O        11450000
*                       INTERRUPTIONS OR BOTH, THE MAXIMUM NUMBER OF    11500000
*                       CCWS PER EVENT, THE MAXIMUM NUMBER OF DATA      11550000
*                       BYTES PER CCW, WHETHER TO TRACE IOSB AND EWA    11600000
*                       DATA (THESE ARE MVS CONTROL BLOCKS ASSOCIATED   11650000
*                       WITH I/O), AND THE SIZE OF THE PCI TABLE.       11700000
*                                                                       11750000
GTOISIO  EQU   BIT7     THE DEVICES TRACED SELECTIVELY FOR IO AND SIO   11800000
*                       ARE IDENTICAL.                                  11850000
         EJECT 1                                                        11900000
GTOBYTE3 DS    XL1                                                      11950000
GTOCCWI  EQU   BIT0     CCW=I - RECORDS CHANNEL PROGRAM DATA FOR I/O    12000000
*                       INTERRUPTIONS. THIS CAUSES TRACING ONLY WHEN IO 12050000
*                       OR IOP IS SPECIFIED.                            12100000
*                                                                       12150000
GTOCCWS  EQU   BIT1     CCW=S - RECORDS CHANNEL PROGRAM DATA FOR START  12200000
*                       SUBCHANNEL AND RESUME SUBCHANNEL OPERATIONS.    12250000
*                       THIS CAUSES TRACING ONLY WHEN SSCH OR SSCHP IS  12300000
*                       SPECIFIED.                                      12350000
*                                                                       12400000
GTOJOBP  EQU   BIT2     JOBNAMEP - LIMITS ALL TRACING TO THE JOBS       12450000
*                       SPECIFIED. GTF PROMPTS THE OPERATOR FOR THE     12500000
*                       ONLY JOBS THAT WILL HAVE DATA RECORDED.         12550000
*                                                                       12600000
GTOASIDP EQU   BIT3     ASIDP - LIMITS ALL TRACING TO THE ADDRESS SPACE 12650000
*                       IDENTIFIERS (ASIDS) SPECIFIED. GTF PROMPTS THE  12700000
*                       OPERATOR FOR THE ONLY ASIDS THAT WILL HAVE DATA 12750000
*                       RECORDED.                                       12800000
*                                                                       12850000
GTOUSRP  EQU   BIT4     USRP - USR WITH PROMPTING. GTF PROMPTS THE      12900000
*                       OPERATOR FOR THE ONLY USER EVENTS THAT WILL     12950000
*                       HAVE DATA RECORDED.                             13000000
*                                                                       13050000
GTOTIME  EQU   BIT7     TIME STAMPS APPEAR IN GTF TRACE DATA RECORDS.   13100000
*                       THIS IS ALWAYS 1.                               13150000
         EJECT 1                                                        13200000
GTOBYTE4 DS    XL1                                                      13250000
GTOSSCH  EQU   BIT0     SSCH - RECORDS START SUBCHANNEL AND RESUME      13300000
*                       SUBCHANNEL OPERATIONS.                          13350000
*                                                                       13400000
GTOSSCHP EQU   BIT1     SSCHP - SSCH WITH PROMPTING.  GTF PROMPTS THE   13450000
*                       OPERATOR FOR THE ONLY DEVICES THAT WILL HAVE    13500000
*                       DATA RECORDED.                                  13550000
*                                                                       13600000
GTOMSCH  EQU   BIT2     MSCH - RECORDS MODIFY SUBCHANNEL OPERATIONS.    13650000
*                                                                       13700000
GTOHSCH  EQU   BIT3     HSCH - RECORDS HALT SUBCHANNEL OPERATIONS.      13750000
*                                                                       13800000
GTOCSCH  EQU   BIT4     CSCH - RECORDS CLEAR SUBCHANNEL OPERATIONS.     13850000
*                                                                       13900000
GTOISSCH EQU   BIT7     THE DEVICES TRACED SELECTIVELY FOR IO AND SSCH  13950000
*                       ARE IDENTICAL.                                  14000000
*                                                                       14050000
GTOBYTE5 DS    XL1      RESERVED.                                       14100000
GTOBYTE6 DS    XL1      RESERVED.                                       14116600
GTOBYTE7 DS    XL1      RESERVED.                                       14133200
         MEND                                                           14150000
**/                                                                     14200000
 %GTOPLS2:;                                                             14250000
 @EJECT;                                                                14300000
    /*****************************************************************/ 14350000
    /*                                                               */ 14400000
    /* GTO: Generalized Trace Facility options mapping. Options of   */ 14450000
    /* the form xxx, xxxP and xxxM are mutually exclusive.           */ 14500000
    /*                                                               */ 14550000
    /*****************************************************************/ 14600000
                                                                        14650000
    %IF GTO_BASE='' %THEN                                               14700000
      %GTO_BASE='BASED';                                                14750000
    DCL                                                                 14800000
      1 GTO GTO_BASE,               /* The GTF trace options.        */ 14850000
       2 GTOBYTE0 BIT(8),                                               14900000
        3 GTOSYSM BIT(1),           /* SYSM - records minimal data      14950000
                                       for system events.               15000000
                                       ------------------------------   15050000
                                       Records events as if each of     15100000
                                       the following options is         15150000
                                       specified, except that minimal   15200000
                                       trace data is recorded: EXT,     15250000
                                       PI, SVC and RR.                  15300000
                                       ------------------------------   15350000
                                       Records events as if each of     15400000
                                       the following options is         15450000
                                       specified: IO, SSCH, CSCH,       15500000
                                       HSCH and MSCH.                   15550000
                                       ------------------------------   15600000
                                       If any of the following          15650000
                                       options are specified, causes    15700000
                                       minimal recording to be done     15750000
                                       for them: DSP, RNIO and SRM.     15800000
                                       ------------------------------   15850000
                                       The following options are        15900000
                                       ignored: EXT, PI, SVC, RR, IO,   15950000
                                       SSCH, CSCH, HSCH and MSCH.    */ 16000000
        3 GTOSYSP BIT(1),           /* SYSP - records comprehensive     16050000
                                       trace data for system events,    16100000
                                       with prompting.                  16150000
                                       ------------------------------   16200000
                                       GTF prompts the operator for     16250000
                                       the only PI, SVC, IO and SSCH    16300000
                                       events that will have data       16350000
                                       recorded.                        16400000
                                       ------------------------------   16450000
                                       Otherwise, GTF records the       16500000
                                       same events as those recorded    16550000
                                       by SYS.                          16600000
                                       ------------------------------   16650000
                                       GTF ignores the following        16700000
                                       options: EXT, PI, SVC, RR, IO,   16750000
                                       SSCH, CSCH, HSCH and MSCH.    */ 16800000
 @EJECT;                                                                16850000
        3 GTOSYS BIT(1),            /* SYS - records comprehensive      16900000
                                       trace data for system events.    16950000
                                       ------------------------------   17000000
                                       Records events as if each of     17050000
                                       the following options is         17100000
                                       specified: EXT, PI, SVC, RR,     17150000
                                       IO, SSCH, CSCH, HSCH and MSCH.   17200000
                                       ------------------------------   17250000
                                       The following options are        17300000
                                       ignored: EXT, PI, SVC, RR, IO,   17350000
                                       SSCH, CSCH, HSCH and MSCH.    */ 17400000
        3 GTOUSR BIT(1),            /* USR - records all user trace     17450000
                                       data passed to GTF by the        17500000
                                       GTRACE macro.                 */ 17550000
        3 GTOTRC BIT(1),            /* TRC - records events             17600000
                                       associated with GTF itself.      17650000
                                       This causes tracing only when    17700000
                                       at least one other type of       17750000
                                       event is being traced.        */ 17800000
        3 GTODSP BIT(1),            /* DSP - records dispatcher         17850000
                                       events. If SYSM is also          17900000
                                       specified, GTF records minimal   17950000
                                       trace data. Otherwise, GTF       18000000
                                       records comprehensive trace      18050000
                                       data.                         */ 18100000
        3 * BIT(1),                 /* Reserved.                     */ 18150000
        3 GTOPCI BIT(1),            /* PCI - records I/O                18200000
                                       interruptions that indicate      18250000
                                       intermediate status. This        18300000
                                       includes program-controlled      18350000
                                       interruptions (PCIs), initial    18400000
                                       status request interruptions,    18450000
                                       and resume and suspend channel   18500000
                                       program interruptions.           18550000
                                       ------------------------------   18600000
                                       When IOP specifies particular    18650000
                                       devices, PCI applies only to     18700000
                                       them.                            18750000
                                       ------------------------------   18800000
                                       PCI causes tracing only when     18850000
                                       one of the following is also     18900000
                                       specified: IO, IOP, SYS, SYSM,   18950000
                                       SYSP.                         */ 19000000
 @EJECT;                                                                19050000
       2 GTOBYTE1 BIT(8),                                               19100000
        3 GTOSVC BIT(1),            /* SVC - records supervisor call    19150000
                                       interruptions. If SYSM is also   19200000
                                       specified, GTF records minimal   19250000
                                       trace data. Otherwise, GTF       19300000
                                       records comprehensive trace      19350000
                                       data.                         */ 19400000
        3 GTOSVCP BIT(1),           /* SVCP - like SVC, but GTF         19450000
                                       prompts the operator for the     19500000
                                       only SVC numbers that will       19550000
                                       have data recorded.           */ 19600000
        3 GTOSIO BIT(1),            /* SIO - records start I/O          19650000
                                       operations - equivalent to       19700000
                                       SSCH.                         */ 19750000
        3 GTOSIOP BIT(1),           /* SIOP - SIO with prompting -      19800000
                                       equivalent to SSCHP.          */ 19850000
        3 GTOPI BIT(1),             /* PI - records program             19900000
                                       interruptions. If SYSM is also   19950000
                                       specified, GTF records minimal   20000000
                                       trace data. Otherwise, GTF       20050000
                                       records comprehensive trace      20100000
                                       data.                         */ 20150000
        3 GTOPIP BIT(1),            /* PIP - like PI, but GTF prompts   20200000
                                       the operator for the only        20250000
                                       program interruption codes       20300000
                                       that will have data recorded. */ 20350000
        3 GTOIO BIT(1),             /* IO - records I/O                 20400000
                                       interruptions. GTF does not      20450000
                                       record intermediate-status       20500000
                                       interruptions unless PCI is      20550000
                                       also specified.               */ 20600000
        3 GTOIOP BIT(1),            /* IOP - like IO, but GTF prompts   20650000
                                       the operator for the only        20700000
                                       devices that will have data      20750000
                                       recorded.                     */ 20800000
 @EJECT;                                                                20850000
       2 GTOBYTE2 BIT(8),                                               20900000
        3 GTOEXT BIT(1),            /* EXT- records external            20950000
                                       interruptions. If SYSM is also   21000000
                                       specified, GTF records minimal   21050000
                                       trace data. Otherwise, GTF       21100000
                                       records comprehensive trace      21150000
                                       data.                         */ 21200000
        3 GTORNIO BIT(1),           /* RNIO - records VTAM (remote      21250000
                                       network) activity. If SYSM is    21300000
                                       also specified, GTF records      21350000
                                       minimal trace data. Otherwise,   21400000
                                       GTF records comprehensive        21450000
                                       trace data. This causes          21500000
                                       tracing only when VTAM tracing   21550000
                                       is active.                    */ 21600000
        3 GTOSRM BIT(1),            /* SRM - records calls to the       21650000
                                       system resource manager. If      21700000
                                       SYSM is also specified, GTF      21750000
                                       records minimal trace data.      21800000
                                       Otherwise, GTF records           21850000
                                       comprehensive trace data.     */ 21900000
        3 GTORR BIT(1),             /* RR - records data associated     21950000
                                       with recovery routines, such     22000000
                                       as ESTAEs and STAEs. If SYSM     22050000
                                       is also specified, GTF records   22100000
                                       minimal trace data. Otherwise,   22150000
                                       GTF records comprehensive        22200000
                                       trace data.                   */ 22250000
        3 GTOSLIP BIT(1),           /* SLIP - records SLIP trap data.*/ 22300000
        3 GTOCCW BIT(1),            /* CCW - records channel program    22350000
                                       data. This causes tracing only   22400000
                                       when one of the following        22450000
                                       options is specified: SSCH,      22500000
                                       SSCHP, IO, or IOP.            */ 22550000
        3 GTOCCWP BIT(1),           /* CCWP - like CCW, but GTF will    22600000
                                       prompt the operator for the      22650000
                                       following information: whether   22700000
                                       to trace data for SSCH           22750000
                                       operations or I/O                22800000
                                       interruptions or both, the       22850000
                                       maximum number of CCWs per       22900000
                                       event, the maximum number of     22950000
                                       data bytes per CCW, whether to   23000000
                                       trace IOSB and EWA data (these   23050000
                                       are MVS control blocks           23100000
                                       associated with I/O), and the    23150000
                                       size of the PCI table.        */ 23200000
        3 GTOISIO BIT(1),           /* The devices traced selectively   23250000
                                       for IO and SIO are identical. */ 23300000
 @EJECT;                                                                23350000
       2 GTOBYTE3 BIT(8),                                               23400000
        3 GTOCCWI BIT(1),           /* CCW=I - records channel          23450000
                                       program data for I/O             23500000
                                       interruptions. This causes       23550000
                                       tracing only when IO or IOP is   23600000
                                       specified.                    */ 23650000
        3 GTOCCWS BIT(1),           /* CCW=S - records channel          23700000
                                       program data for start           23750000
                                       subchannel and resume            23800000
                                       subchannel operations. This      23850000
                                       causes tracing only when SSCH    23900000
                                       or SSCHP is specified.        */ 23950000
        3 GTOJOBP BIT(1),           /* JOBNAMEP - limits all tracing    24000000
                                       to the jobs specified. GTF       24050000
                                       prompts the operator for the     24100000
                                       only jobs that will have data    24150000
                                       recorded.                     */ 24200000
        3 GTOASIDP BIT(1),          /* ASIDP - limits all tracing to    24250000
                                       the address space identifiers    24300000
                                       (ASIDs) specified. GTF prompts   24350000
                                       the operator for the only        24400000
                                       ASIDs that will have data        24450000
                                       recorded.                     */ 24500000
        3 GTOUSRP BIT(1),           /* USRP - USR with prompting. GTF   24550000
                                       prompts the operator for the     24600000
                                       only user events that will       24650000
                                       have data recorded.           */ 24700000
        3 * BIT(2),                 /* Reserved.                     */ 24750000
        3 GTOTIME BIT(1),           /* Time stamps appear in GTF        24800000
                                       trace data records. This is      24850000
                                       always 1.                     */ 24900000
       2 GTOBYTE4 BIT(8),                                               24950000
        3 GTOSSCH BIT(1),           /* SSCH - records start             25000000
                                       subchannel and resume            25050000
                                       subchannel operations.        */ 25100000
        3 GTOSSCHP BIT(1),          /* SSCHP - SSCH with prompting.     25150000
                                       GTF prompts the operator for     25200000
                                       the only devices that will       25250000
                                       have data recorded.           */ 25300000
        3 GTOMSCH BIT(1),           /* MSCH - records modify            25350000
                                       subchannel operations.        */ 25400000
        3 GTOHSCH BIT(1),           /* HSCH - records halt subchannel   25450000
                                       operations.                   */ 25500000
        3 GTOCSCH BIT(1),           /* CSCH - records clear             25550000
                                       subchannel operations.        */ 25600000
        3 * BIT(2),                 /* Reserved.                     */ 25650000
        3 GTOISSCH BIT(1),          /* The devices traced selectively   25700000
                                       for IO and SSCH are identical.*/ 25750000
       2 GTOBYTE5 BIT(8),           /* Reserved.                     */ 25800000
       2 GTOBYTE6 BIT(8),           /* Reserved.                     */ 25850000
       2 GTOBYTE7 BIT(8);           /* Reserved.                     */ 25900000
