         MACRO                                                          00050000
.********************************************************************** 00100000
.*                                                                    * 00150000
.* $MAC(ARCFMWE) COMP(SERVICE) PROD(DFHSM):                           * 00200000
.* MACRO NAME = ARCFMWE                                               * 00250000
.* FUNC = SERVICE                                                     * 00300000
.* SUBFUNC = MWE                                                      * 00350000
.*                                                                    * 00400000
.* DESCRIPTIVE NAME = FREE DFHSM MANAGEMENT WORK ELEMENT (MWE).       * 00450000
.*                                                                    * 00500000
.********************************************************************** 00537500
.*PROPRIETARY V3 STATEMENT                                            * 00575000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00612500
.*"RESTRICTED MATERIALS OF IBM"                                       * 00650000
.*5695-DF1                                                            * 00678100
.*(C) COPYRIGHT 1989  IBM CORP.                                       * 00706200
.*END PROPRIETARY V3 STATEMENT                                        * 00734300
.********************************************************************** 00762500
.*                                                                    * 00800000
.* STATUS = VERSION 2, RELEASE 5, LEVEL 0                             * 00850000
.*                                                                    * 00900000
.* FUNCTION = FREE MWE CREATED IN COMMON SERVICE AREA FOR AN          * 00950000
.*            ASYNCHRONOUS DFHSM REQUEST.                             * 01000000
.*                                                                    * 01050000
.* NOTES = SEE BELOW                                                  * 01100000
.*                                                                    * 01150000
.*   DEPENDENCIES = NONE                                              * 01200000
.*                                                                    * 01250000
.*   RESTRICTIONS = THE APPLICATION MUST BE APF AUTHORIZED TO         * 01300000
.*            REQUEST ASYNCHRONOUS PROCESSING.                        * 01350000
.*                                                                    * 01400000
.*   REGISTER CONVENTIONS =                                           * 01450000
.*                                                                    * 01500000
.*            REGISTER 13 MUST POINT TO A STANDARD SAVE AREA          * 01550000
.*            WHEN MACRO IS ISSUED.                                   * 01600000
.*                                                                    * 01650000
.*            REGISTERS 0, 1, 14 AND 15 WILL BE DESTROYED.            * 01700000
.*                                                                    * 01750000
.*   PATCH LABEL = NONE                                               * 01800000
.*                                                                    * 01850000
.* MODULE TYPE = MACRO                                                * 01900000
.*                                                                    * 01950000
.*   PROCESSOR = BAL                                                  * 02000000
.*                                                                    * 02050000
.* INPUT =                                                            * 02100000
.*          ECBADDR  (REQUIRED) SPECIFY THE ADDRESS OF THE MWE ECB    * 02150000
.*                   IN CSA AREA WHEN A DFHSM REQUEST SPECIFIED THE   * 02200000
.*                   ASYNC PARAMETER.  THE ECB OF THE MWE MUST HAVE   * 02250000
.*                   BEEN POSTED.                                     * 02300000
.*                                                                    * 02350000
.*          SNAPDCB  (OPTIONAL) SPECIFY THE ADDRESS OF AN OPEN DCB    * 02400000
.*                   USED FOR SNAP PROCESSING OF THE MWE AREA         * 02450000
.*                   PRIOR TO FREEMAIN PROCESSING.                    * 02500000
.*                                                                    * 02550000
.*          WKAREA   (REQUIRED) SPECIFY THE ADDRESS OF A 200 BYTE     * 02600000
.*                   WORK AREA TO CONTAIN INFORMATION SPECIFIED IN    * 02650000
.*                   THIS MACRO.                                      * 02700000
.*                                                                    * 02750000
.* OUTPUT =   REGISTER 15 WILL CONTAIN MWE RETURN CODE                * 02800000
.*            REGISTER 0  WILL CONTAIN MWE REASON CODE                * 02850000
.*                                                                    * 02900000
.*            INVALID REQUESTS NOT SENT TO DFHSM WILL HAVE            * 02950000
.*            THE FOLLOWING RETURN CODES:                             * 03000000
.*                                                                    * 03050000
.*            401 - ATTEMPTED TO FREE MWE THAT HAS NOT BEEN POSTED    * 03100000
.*            806 - LINK FAILURE - UNABLE TO LINK TO ARCGIVER         * 03150000
.*                                                                    * 03200000
.* CHANGE ACTIVITY =                                                  * 03250000
.* $K0=HSMKD,250,090888,THP5: PROGRAMMABLE DFHSM REQUEST          @KDA* 03300000
.*                            PROCESSOR                           @KDA* 03350000
.*                                                                    * 03400000
.********************************************************************** 03450000
&NAME    ARCFMWE &ECBADDR=,                                            X03500000
               &WKAREA=,&SNAPDCB=,&TEST=NO                              03550000
         LCLA  &A                                                       03600000
         LCLB  &ERROR                                                   03650000
         LCLC  &H                                                       03700000
         LCLC  &L1                                                      03750000
         LCLC  &L2                                                      03800000
&L1      SETC  'ARC'.'&SYSNDX'.'A'                                      03850000
&L2      SETC  'ARC'.'&SYSNDX'.'B'                                      03900000
.*                                                                      03950000
.* CHECK THE PARAMETERS SPECIFIED WITH THE FREEMWE FUNCTION             04000000
.*                                                                      04050000
.CHKFREE ANOP                                                           04100000
         AIF   ('&ECBADDR' NE '').FR1                                   04150000
         MNOTE 8,'REQUIRED PARAMETER, ECBADDR, NOT SPECIFIED'           04200000
&ERROR   SETB  1                                                        04250000
.FR1     ANOP                                                           04300000
         AIF   ('&WKAREA' NE '').FR2                                    04350000
         MNOTE 8,'REQUIRED PARAMETER, WKAREA, IS NOT SPECIFIED'         04400000
&ERROR   SETB  1                                                        04450000
.FR2     ANOP                                                           04500000
         AIF   (NOT &ERROR).BUILD                                       04550000
         MEXIT                                                          04600000
.*                                                                      04650000
.* AT THIS POINT ALL THE PARAMETERS HAVE BEEN PROPERLY SPECIFIED.       04700000
.* NOW BUILD THE CONTROL BLOCK AND CALL THE PROCESSING ROUTINE.         04750000
.*                                                                      04800000
.BUILD   ANOP                                                           04850000
         AIF   ('&WKAREA'(1,1) EQ '(').WREG                             04900000
&NAME    LA    15,&WKAREA                                               04950000
         AGO   .CLRWKA                                                  05000000
.WREG    ANOP                                                           05050000
&A       SETA  K'&WKAREA-2                                              05100000
&H       SETC  '&WKAREA'(2,&A)                                          05150000
&NAME    LR    15,&H                                                    05200000
.CLRWKA  ANOP                                                           05250000
         XC    0(200,15),0(15)     CLEAR THE WORK AREA                  05300000
         B     *+12                BRANCH AROUND IDENTIFIER             05350000
         DC    CL8'DFHSMREQ'                                            05400000
         MVC   0(8,15),*-8         SET THE IDENTIFIER                   05450000
         B     *+12                BRANCH AROUND FUNCTION NAME          05500000
         DC    CL8'FREEMWE '       FUNCTION NAME                        05550000
         MVC   8(8,15),*-8         SET THE FUNCTION NAME                05600000
.XSNAP   ANOP                                                           05650000
         AIF   ('&SNAPDCB' EQ '').XADDR                                 05700000
         AIF   ('&SNAPDCB'(1,1) EQ '(').SREG                            05750000
         LA    1,&SNAPDCB          GET ADDRESS OF SNAP DCB              05800000
         ST    1,188(15)           STORE IN PARM LIST                   05850000
         AGO   .XADDR                                                   05900000
.SREG    ANOP                                                           05950000
&A       SETA  K'&SNAPDCB-2                                             06000000
&H       SETC  '&SNAPDCB'(2,&A)                                         06050000
         ST    &H,188(15)          STORE DCB ADDRESS IN PARM LIST       06100000
.XADDR   ANOP                                                           06150000
         AIF   ('&ECBADDR'(1,1) EQ '(').ECBREG                          06200000
         LA    1,&ECBADDR          GET ADDR OF MWE ECB                  06250000
         ST    1,72(15)            STORE IN PARM LIST                   06300000
         AGO   .GIVER                                                   06350000
.ECBREG  ANOP                                                           06400000
&A       SETA  K'&ECBADDR-2                                             06450000
&H       SETC  '&ECBADDR'(2,&A)                                         06500000
         ST    &H,72(15)           STORE ADDR OF MWE ECB                06550000
.GIVER   ANOP                                                           06600000
         LR    1,15                PARAMETER ADDRESS TO REG 1           06650000
         LINK  EP=ARCGIVER,ERRET=&L1                                    06700000
         L     15,192(1)           LOAD RETURN CODE                     06750000
         L     0,196(1)            LOAD REASON CODE                     06800000
         B     &L2                                                      06850000
&L1      LA    15,806              INDICATE LINK FAILED                 06900000
&L2      EQU   *                                                        06950000
         MEXIT                                                          07000000
         MEND                                                           07050000
