         MACRO                                                          00050000
.********************************************************************** 00100000
.*                                                                    * 00150000
.* $MAC(ARCHSEND) COMP(SERVICE) PROD(DFHSM):                          * 00200000
.* MACRO NAME = ARCHSEND                                              * 00250000
.* FUNC = SERVICE                                                     * 00300000
.* SUBFUNC = MWE                                                      * 00350000
.*                                                                    * 00400000
.* DESCRIPTIVE NAME = SEND COMMAND TEXT FOR DFHSM PROCESSING.         * 00450000
.*                                                                    * 00500000
.********************************************************************** 00537500
.*PROPRIETARY V3 STATEMENT                                            * 00575000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00612500
.*"RESTRICTED MATERIALS OF IBM"                                       * 00650000
.*5647-A01                                                            * 00678100
.*(C) COPYRIGHT 1989,2000  IBM CORP.                                  * 00706200
.*END PROPRIETARY V3 STATEMENT                                        * 00734300
.********************************************************************** 00762500
.*                                                                    * 00800000
.* STATUS = VERSION 2, RELEASE 10, LEVEL 0                       @ZKC * 00850000
.*                                                                    * 00900000
.* FUNCTION = PERFORM DFHSM SVC 109 TO SEND COMMAND TEXT FOR          * 00950000
.*            DFHSM PROCESSING.                                       * 01000000
.*                                                                    * 01050000
.* NOTES = SEE BELOW                                                  * 01100000
.*                                                                    * 01150000
.*   DEPENDENCIES = NONE                                              * 01200000
.*                                                                    * 01250000
.*   RESTRICTIONS = THE USER EXECUTING THE APPLICATION THAT INVOKES   * 01300000
.*            THIS MACRO MUST BE DFHSM AUTHORIZED TO ISSUE CERTAIN    * 01350000
.*            DFHSM COMMANDS.                                         * 01400000
.*                                                                    * 01450000
.*   REGISTER CONVENTIONS =                                           * 01500000
.*                                                                    * 01550000
.*            REGISTER 13 MUST POINT TO A STANDARD SAVE AREA          * 01600000
.*            WHEN MACRO IS ISSUED.                                   * 01650000
.*                                                                    * 01700000
.*            REGISTERS 0, 1, 14 AND 15 WILL BE DESTROYED.            * 01750000
.*                                                                    * 01800000
.*   PATCH LABEL = NONE                                               * 01850000
.*                                                                    * 01900000
.* MODULE TYPE = MACRO                                                * 01950000
.*                                                                    * 02000000
.*   PROCESSOR = BAL                                                  * 02050000
.*                                                                    * 02100000
.* INPUT =                                                            * 02150000
.*          TEXT     (REQUIRED) SPECIFY THE ADDRESS OF A HALFWORD     * 02200000
.*                   (2 BYTES) CONTAINING THE LENGTH OF THE COMMAND   * 02250000
.*                   FOLLOWED BY THE COMMAND TEXT TO BE SENT TO       * 02300000
.*                   DFHSM.  THE FIELD SHOULD BE ON A HALFWORD        * 02350000
.*                   BOUNDARY, AND THE LENGTH SHOULD INCLUDE THE      * 02400000
.*                   HALFWORD LENGTH AREA.                            * 02450000
.*                                                                    * 02500000
.*          WAIT     (OPTIONAL) SPECIFY YES|NO WHETHER APPLICATION    * 02550000
.*                   DESIRES TO WAIT UNTIL DFHSM HAS PROCESSED THIS   * 02600000
.*                   REQUEST.  DEFAULT FOR THIS PARAMETER IS NO.      * 02650000
.*                                                                    * 02700000
.*          TEST     (OPTIONAL) SPECIFY YES|NO WHETHER MACRO IN TEST  * 02750000
.*                   MODE.  TEST=YES DENOTES THAT THE MWE SHOULD BE   * 02800000
.*                   BUILT BUT THAT NO DFHSM SVC IS ISSUED.  DEFAULT  * 02850000
.*                   FOR THIS PARAMETER IS NO.                        * 02900000
.*                                                                    * 02950000
.*          SNAPDCB  (OPTIONAL) SPECIFY THE ADDRESS OF AN OPEN DCB    * 03000000
.*                   USED FOR SNAP PROCESSING OF THE MWE AREA UPON    * 03050000
.*                   RETURN FROM DFHSM SVC PROCESSING.                * 03100000
.*                                                                    * 03150000
.*          WKAREA   (REQUIRED) SPECIFY THE ADDRESS OF A 200 BYTE     * 03200000
.*                   WORK AREA TO CONTAIN INFORMATION SPECIFIED IN    * 03250000
.*                   THIS MACRO.                                      * 03300000
.*                                                                    * 03350000
.*          PRIV     (OPTIONAL) SPECIFY YES|NO WHETHER HSEND          * 03360000
.*                   COMMAND IS AN ALTERDS STORAGE CLASS AND OR       * 03370000
.*                   MANAGEMENT CLASS COMMAND FROM CATALOG       @WIA * 03380000
.*                                                                    * 03390000
.* OUTPUT =   REGISTER 15 WILL CONTAIN MWE RETURN CODE                * 03400000
.*            REGISTER 0  WILL CONTAIN MWE REASON CODE                * 03450000
.*                                                                    * 03500000
.*            INVALID REQUESTS NOT SENT TO DFHSM WILL HAVE            * 03550000
.*            THE FOLLOWING RETURN CODES:                             * 03600000
.*                                                                    * 03650000
.*            806 - LINK FAILURE - UNABLE TO LINK TO ARCGIVER         * 03700000
.*                                                                    * 03750000
.* CHANGE ACTIVITY =                                                  * 03800000
.* $K0=HSMKD,250,090888,THP5: PROGRAMMABLE DFHSM REQUEST          @KDA* 03850000
.*                            PROCESSOR                           @KDA* 03900000
.* $WI=140,091096,THB9: ADD KEYWORK PRIV FOR ALTER WITHOUT RECALL @WIA* 03925000
.* $ZK=310,101199,THA4: K160856 SUPPORT RELATIVE BRANCHING        @ZKA* 03937500
.*                                                                    * 03950000
.********************************************************************** 04000000
&NAME ARCHSEND &TEXT=,&WAIT=NO,                                        X04050000
               &WKAREA=,&SNAPDCB=,&TEST=NO,&PRIV=NO          /*  @WIA*/ 04100000
         LCLA  &A                                                       04150000
         LCLB  &ERROR                                                   04200000
         LCLC  &H                                                       04250000
         LCLC  &L1                                                      04300000
         LCLC  &L2                                                      04350000
&L1      SETC  'ARC'.'&SYSNDX'.'A'                                      04400000
&L2      SETC  'ARC'.'&SYSNDX'.'B'                                      04450000
.*                                                                      04500000
.* CHECK THE PARAMETERS SPECIFIED WITH THE HSEND FUNCTION               04550000
.*                                                                      04600000
.CHKSEND ANOP                                                           04650000
         AIF   ('&TEXT' NE '').SE1                                      04700000
         MNOTE 8,'REQUIRED PARAMETER, TEXT, NOT SPECIFIED'              04750000
&ERROR   SETB  1                                                        04800000
.SE1     ANOP                                                           04850000
         AIF   ('&WKAREA' NE '').SE2                                    04900000
         MNOTE 8,'REQUIRED PARAMETER, WKAREA, IS NOT SPECIFIED'         04950000
&ERROR   SETB  1                                                        05000000
.SE2     ANOP                                                           05050000
         AIF   (NOT &ERROR).BUILD                                       05100000
         MEXIT                                                          05150000
.*                                                                      05200000
.* AT THIS POINT ALL THE PARAMETERS HAVE BEEN PROPERLY SPECIFIED.       05250000
.* NOW BUILD THE CONTROL BLOCK AND CALL THE PROCESSING ROUTINE.         05300000
.*                                                                      05350000
.BUILD   ANOP                                                           05400000
         AIF   ('&WKAREA'(1,1) EQ '(').WREG                             05450000
&NAME    LA    15,&WKAREA                                               05500000
         AGO   .CLRWKA                                                  05550000
.WREG    ANOP                                                           05600000
&A       SETA  K'&WKAREA-2                                              05650000
&H       SETC  '&WKAREA'(2,&A)                                          05700000
&NAME    LR    15,&H                                                    05750000
.CLRWKA  ANOP                                                           05800000
         XC    0(200,15),0(15)     CLEAR THE WORK AREA                  05850000
.*                                                                      05885000
.* REGISTER 14 IS USED AS A BASE REGISTER FOR THE FOLLOWING 4           05920000
.* INSTRUCTIONS. NOTE THAT THE SUBSEQUENT LINK ALSO USES REGISTER       05955000
.* 14.                                                        @ZKA      05990000
.*                                                                      06025000
         BAS   14,*+20             BRANCH AROUND ID/FUNCTION  @ZKC      06060000
         DC    CL8'DFHSMREQ'       IDENTIFER                  @ZKM      06095000
         DC    CL8'HSENDCMD'       FUNCTION NAME              @ZKM      06130000
         MVC   0(16,15),0(14)      SET ID/FUNCTION            @ZKC      06165000
.XWAIT   AIF   ('&WAIT' NE 'YES').XTEST                                 06200000
         OI    16(15),X'40'        WAIT WAS SPECIFIED                   06250000
.XTEST   ANOP                                                           06300000
         AIF   ('&TEST' NE 'YES').XPRIV                                 06330000
         OI    16(15),X'02'        TEST WAS SPECIFIED @WIC              06360000
.XPRIV   AIF   ('&PRIV' NE 'YES').XSNAP                                 06390000
         OI    16(15),X'04'        PRIV WAS SPECIFIED @WIA              06420000
.XSNAP   ANOP                                                           06450000
         AIF   ('&SNAPDCB' EQ '').XTEXT                                 06500000
         AIF   ('&SNAPDCB'(1,1) EQ '(').SREG                            06550000
         LA    1,&SNAPDCB          GET ADDRESS OF SNAP DCB              06600000
         ST    1,188(15)           STORE IN PARM LIST                   06650000
         AGO   .XTEXT                                                   06700000
.SREG    ANOP                                                           06750000
&A       SETA  K'&SNAPDCB-2                                             06800000
&H       SETC  '&SNAPDCB'(2,&A)                                         06850000
         ST    &H,188(15)          STORE DCB ADDRESS IN PARM LIST       06900000
.XTEXT   ANOP                                                           06950000
         AIF   ('&TEXT'(1,1) EQ '(').TEXTREG                            07000000
         LA    1,&TEXT             GET ADDR OF TEXT                     07050000
         ST    1,56(15)            STORE IN PARM LIST                   07100000
         AGO   .GIVER                                                   07150000
.TEXTREG ANOP                                                           07200000
&A       SETA  K'&TEXT-2                                                07250000
&H       SETC  '&TEXT'(2,&A)                                            07300000
         ST    &H,56(15)           STORE ADDR OF TEXT PARM              07350000
.GIVER   ANOP                                                           07400000
         LR    1,15                PARAMETER ADDRESS TO REG 1           07450000
         LINK  EP=ARCGIVER,ERRET=&L1                                    07500000
         L     15,192(1)           LOAD RETURN CODE                     07550000
         L     0,196(1)            LOAD REASON CODE                     07600000
         B     &L2                                                      07650000
&L1      LA    15,806              INDICATE LINK FAILED                 07700000
&L2      EQU   *                                                        07750000
         MEXIT                                                          07800000
         MEND                                                           07850000
