*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/* $MAC(ARCUTILP) COMP(DATA) PROD(DFHSM):                           */ 00150000
*/*                                                                  */ 00200000
*/********************************************************************/ 00243700
*/*PROPRIETARY V3 STATEMENT                                          */ 00287400
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00331100
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00374800
*/*5695-DF1                                                          */ 00407500
*/*(C) COPYRIGHT 1989,1997  IBM CORP.                            @SIA*/ 00440200
*/*END PROPRIETARY V3 STATEMENT                                      */ 00472900
*/********************************************************************/ 00505900
*/*                                                                  */ 00550000
*/*                                                                  */ 00650000
*/*                                                                  */ 00700000
*/* FUNCTION    - INPUT PARAMETER LIST FOR ARCUTIL                   */ 00750000
*/*               AND FIELD DEFINITIONS FOR COLLECTION RECORDS.      */ 00800000
*/*               (THE COLLECTION RECORDS MAPPINGS ARE DEFINED ON    */ 00850000
*/*                THE HEADER AREA VARIABLE DCUDATA MAPPED BY        */ 00900000
*/*                THE IDCDOUT MACRO.  IF YOU HAVE IDCDOUT IN    @02C*/ 00950000
*/*                SYS1.MACLIB, YOU CAN INCLUDE THIS AS FOLLOWS: @02C*/ 01000000
*/*                   ARCUTILP IDCDOUT=YES                       @02A*/ 01050000
*/*                IN YOUR ASSEMBLY PROGRAM.  IF YOU DO NOT HAVE @02C*/ 01100000
*/*                IDCDOUT, THIS MACRO WILL DEFINE THE HEADER.   @02C*/ 01150000
*/*                                                                  */ 01200000
*/* METHOD OF ACCESS -                                               */ 01250000
*/*    PL/AS - %INCLUDE SYSLIB(ARCUTILP)                             */ 01300000
*/*                                                                  */ 01350000
*/* INPUT -                                                          */ 01400000
*/*       STANDARD INPUT FOR ALL FUNCTIONS                           */ 01450000
*/*                                                                  */ 01500000
*/*       UTILP   - REQUIRED TO BE INITIALIZED TO BINARY ZEROES      */ 01550000
*/*                                                                  */ 01600000
*/*       UPID - MACRO IDENTIFIER, REQUIRED TO BE SET                */ 01650000
*/*                  TO UPIDNAME                                     */ 01700000
*/*                                                                  */ 01750000
*/*       UPVERS - MACRO VERSION NUMBER, REQUIRED TO BE SET          */ 01800000
*/*                TO UPVERNUM.  THIS IDENTIFIES THE LEVEL           */ 01850000
*/*                OF THIS ARCUTILP DATA AREA TO THE ARCUTIL         */ 01900000
*/*                PROGRAM.                                  @YA29290*/ 01950000
*/*                                                                  */ 02000000
*/*       UPREMIGR - ON IF UTILITY IS TO CREATE                      */ 02050000
*/*                              MIGRATED DATA SET INFORMATION       */ 02100000
*/*                              RECORDS                             */ 02150000
*/*                                                                  */ 02200000
*/*       UPREBACK             - ON IF UTILITY IS TO CREATE          */ 02250000
*/*                              BACKUP VERSION INFORMATION  @YA29290*/ 02300000
*/*                              RECORDS                             */ 02350000
*/*                                                                  */ 02400000
*/*       UPREDASD             - ON IF UTILITY IS TO CREATE          */ 02450000
*/*                              DASD CAPACITY PLANNING RECORDS      */ 02500000
*/*                                                                  */ 02550000
*/*       UPRETAPE             - ON IF UTILITY IS TO CREATE          */ 02600000
*/*                              TAPE CAPACITY PLANNING RECORDS      */ 02650000
*/*                                                                  */ 02700000
*/*       UPOUTDCB             - ADDRESS OF OUTPUT DATA SET DCB      */ 02750000
*/*                                                                  */ 02800000
*/*       UPSPALL              - ON IF SNAP PROCESSING IS REQUESTED. */ 02850000
*/*                              THE MEMORY WILL BE SNAPPED ON       */ 02900000
*/*                              COMPLETION OF ARCUTIL PROCESSING.   */ 02950000
*/*                              CALLER MUST HAVE DD NAME OF ARCSNAP */ 03000000
*/*                                                                  */ 03050000
*/*       UPSPERR              - ON IF SNAP PROCESSING IS REQUESTED. */ 03100000
*/*                              THE MEMORY WILL BE SNAPPED ON       */ 03150000
*/*                              COMPLETION OF ARCUTIL PROCESSING    */ 03200000
*/*                              IF UPRC IS NON-ZERO.                */ 03250000
*/*                              CALLER MUST HAVE DD NAME OF ARCSNAP */ 03300000
*/*                                                                  */ 03350000
*/*       UPHTIME              - TIME STAMP TO BE WRITTEN IN HEADER  */ 03400000
*/*                              FORMAT: HHMMSSTH                    */ 03450000
*/*                                                                  */ 03500000
*/*       UPHDATE              - DATE STAMP TO BE WRITTEN IN HEADER  */ 03550000
*/*                              FORMAT: YYYYDDDF                    */ 03600000
*/*                                                                  */ 03650000
*/*       UPEXITP              - SPECIFY THE ADDRESS OF A USER EXIT  */ 03700000
*/*                              TO BE TAKEN BEFORE WRITING EACH     */ 03750000
*/*                              COLLECTION RECORD.                  */ 03800000
*/*                                                                  */ 03850000
*/*                              ON ENTRY:   R0 = CURRENT LENGTH OF  */ 03900000
*/*                                               COLLECTION RECORD  */ 03950000
*/*                                          R1 = CURRENT ADDRESS OF */ 04000000
*/*                                               COLLECTION RECORD  */ 04050000
*/*                                          R2 = ADDRESS OF CONTROL */ 04100000
*/*                                               AREA (100 BYTES)   */ 04150000
*/*                                          R13= SAVE AREA LOCATION */ 04200000
*/*                                          R14= RETURN ADDRESS     */ 04250000
*/*                                                                  */ 04300000
*/*                              ON RETURN:  R15= RETURN CODE        */ 04350000
*/*                                                                  */ 04400000
*/*                              RETURN CODES FROM THE EXIT ARE      */ 04450000
*/*                              SUPPORTED AS FOLLOWS:           @02A*/ 04500000
*/*                                                                  */ 04550000
*/*                                  0 - WRITE THE RECORD AS IS      */ 04600000
*/*                                  4 - REPLACE THE RECORD WITH A   */ 04650000
*/*                                      NEW RECORD:                 */ 04700000
*/*                                                                  */ 04750000
*/*                                          R0 = NEW RECORD LENGTH  */ 04800000
*/*                                          R1 = NEW RECORD ADDRESS */ 04850000
*/*                                                                  */ 04900000
*/*                                 12 - DO NOT WRITE THIS RECORD.   */ 04950000
*/*                                                                  */ 05000000
*/*                              IF UPEXITP IS ZERO, ALL RECORDS     */ 05050000
*/*                              ARE WRITTEN AS IS.              @02A*/ 05100000
*/*                                                                  */ 05150000
*/*       UPEXAREA             - SPECIFY THE ADDRESS OF A 100 BYTE   */ 05200000
*/*                              AREA THAT WILL BE PASSED TO THE     */ 05250000
*/*                              USER EXIT.  THIS MAY BE USED FOR    */ 05300000
*/*                              CONTROLLING THE EXIT, OR TO STORE   */ 05350000
*/*                              INTERMEDIATE RESULTS.           @02A*/ 05400000
*/*                                                                  */ 05450000
*/* OUTPUT -                                                         */ 05500000
*/*                                                                  */ 05550000
*/*       COLLECTION RECORDS WILL BE WRITTEN TO THE FILE             */ 05600000
*/*       SPECIFIED BY UPOUTDCB.                                     */ 05650000
*/*                                                                  */ 05700000
*/*       EACH RECORD CONSISTS OF A STANDARD HEADER FOLLOWED         */ 05750000
*/*       BY DATA FOR EACH RECORD TYPE.  THE FOLLOWING RECORD        */ 05800000
*/*       TYPES ARE GENERATED:                                       */ 05850000
*/*                                                                  */ 05900000
*/*       M - ONE MIGRATED DATA SET RECORD FOR EACH DATA SET         */ 05950000
*/*           CURRENTLY MIGRATED.                                    */ 06000000
*/*                                                                  */ 06050000
*/*       B - ONE BACKUP VERSION RECORD FOR EACH BACKUP COPY         */ 06100000
*/*           THAT EXISTS.  A DATA SET MAY HAVE SEVERAL BACKUP       */ 06150000
*/*           COPIES.                                        @YA29290*/ 06200000
*/*                                                                  */ 06250000
*/*       C - ONE DASD CAPACITY PLANNING RECORD FOR EACH DAY         */ 06300000
*/*           FOR EACH VOLUME THAT HAD ACTIVITY ON THAT DAY.         */ 06350000
*/*                                                                  */ 06400000
*/*       T - ONE TAPE CAPACITY PLANNING RECORD FOR EACH TYPE        */ 06450000
*/*           OF TAPE VOLUME (BACKUP, DUMP, MIGRATION).              */ 06500000
*/*                                                                  */ 06550000
*/*       UPNUMIGR - NUMBER OF TYPE 'M' RECORDS                      */ 06600000
*/*       UPNUBACK - NUMBER OF TYPE 'B' RECORDS                      */ 06650000
*/*       UPNUDASD - NUMBER OF TYPE 'C' RECORDS                      */ 06700000
*/*       UPNUTAPE - NUMBER OF TYPE 'T' RECORDS                      */ 06750000
*/*                                                                  */ 06800000
*/*       UPRC       - RETURN CODE                                   */ 06850000
*/*                    0 - FUNCTION SUCCESSFULLY COMPLETED           */ 06900000
*/*                    4 - INVALID PARAMETER LIST                    */ 06950000
*/*                    8 - ERROR OPENING DFHSM CONTROL DATA SET      */ 07000000
*/*                   12 - ERROR READING DFHSM CONTROL DATA SET      */ 07050000
*/*                   16 - ERROR WRITING TO OUTPUT DATA SET          */ 07100000
*/*                   20 - ABNORMAL TERMINATION OCCURRED             */ 07150000
*/*                   24 - INTERNAL ERROR OCCURRED                   */ 07200000
*/*                                                                  */ 07206200
*/*       THE FOLLOWING RETURN AND REASON CODES ARE DOCUMENTED WITH  */ 07212400
*/*       THE IDC21804I MESSAGE IF DCOLLECT IS INVOKED WITH          */ 07218600
*/*       PGM=IDCAMS.  IF INVOKED VIA PGM=ARCUTIL THERE IS NO        */ 07224800
*/*       IDC21804I MESSAGE.  THE REASON AND RETURN CODES ARE FOUND  */ 07231000
*/*       IN THE 2.6.0 INSTALLATION AND CUSTOMIZATION GUIDE CHAPTER  */ 07237200
*/*       16.                                                    @04A*/ 07243400
*/*                                                                  */ 07250000
*/*       UPREAS - REASON CODE (ASSOCIATED WITH UPRC)                */ 07300000
*/*            FOR UPRC = 4:                                         */ 07350000
*/*                    1 - UPID NOT EQUAL TO UPIDNAME                */ 07400000
*/*                    2 - UPVERS INCOMPATIBLE WITH CURRENT          */ 07450000
*/*                        VERSION USED BY ARCUTIL                   */ 07500000
*/*                    3 - DCB ADDRESS NOT PROVIDED                  */ 07550000
*/*                         -  UPOUTDCB IS ZERO                  @02C*/ 07600000
*/*                    4 - NO FUNCTION TO PERFORM                    */ 07650000
*/*                    5 - INVALID COMBINATION OF OPTIONS    @YA29290*/ 07700000
*/*                                                                  */ 07750000
*/*            FOR UPRC = 8:                                         */ 07800000
*/*                    1 - DFHSM MCDS COULD NOT BE OPENED            */ 07850000
*/*                    2 - DFHSM BCDS COULD NOT BE OPENED            */ 07900000
*/*                                                                  */ 07950000
*/*            FOR UPRC = 12:                                        */ 08000000
*/*                    1 - READ ERRORS EXCEEDED 1 PERCENT OF         */ 08050000
*/*                        TOTAL FOR THE DFHSM MCDS                  */ 08100000
*/*                    2 - READ ERRORS EXCEEDED 1 PERCENT OF         */ 08150000
*/*                        TOTAL FOR THE DFHSM BCDS                  */ 08200000
*/*                    3 - MCDS OR BCDS DD CARD WAS SPECIFIED    @04A*/ 08216600
*/*                        AS DUMMY.  THIS IS NOT ACCEPTABLE.    @04A*/ 08233200
*/*                   11 - READ ERROR POSITIONING TO MCDS RECORD     */ 08250000
*/*                   12 - READ ERROR POSITIONING TO BCDS RECORD     */ 08300000
*/*                                                                  */ 08350000
*/*            FOR UPRC = 16:                                        */ 08400000
*/*                    UPREAS = CONTENTS OF GENERAL                  */ 08450000
*/*                             PURPOSE REGISTER ONE(1) AS           */ 08500000
*/*                             RECEIVED FROM THE SYNADAF MACRO      */ 08550000
*/*                                                          @YA29290*/ 08600000
*/*            FOR UPRC = 20:                                        */ 08650000
*/*                    UPREAS = ABNORMAL TERMINATION CODE            */ 08700000
*/*                                                                  */ 08750000
*/*            FOR UPRC = 24:                                @YA29290*/ 08800000
*/*                    1 - ERROR OPENING SNAP DATASET (ARCSNAP)      */ 08850000
*/*                    2 - ERROR ESTABLISHING ESTAE PROTECTION       */ 08900000
*/*                                                                  */ 08950000
*/* CHANGE ACTIVITY                                                  */ 09000000
*/*  $U0=HSMNC,240,051589,TH48: NEW UTILITY PARAMETER MACRO          */ 09050000
*/*  $01=OY29290,250,040490,THP5: APAR OY29290 - RETURN CODE/REASON  */ 09100000
*/*                             UPDATES, CLARIFY UB-RECORD   @YA29290*/ 09150000
*/* $02=OY32266,250,051890,THP5: SUPPORT USER EXIT--ADDRESS MUST @02A*/ 09200000
*/*                             BE PASSED IN UPEXITP ADDRESS.    @02A*/ 09250000
*/* $03=OY37378,250,092190,THP5: CORRECT UM/UB DATE FIELDS, ADD  @03A*/ 09300000
*/*                             SOME NEW FIELDS.                 @03A*/ 09350000
*/*                             - DCUDATAT, DCUASSOC, AND DCUVULUT   */ 09400000
*/*                               MOVED INSIDE IDCDOUT=NO OPTION @03A*/ 09450000
*/* $4G=OY57827,250,080392,THP5: MOVED REXX EXAMPLE TO ARCTOOLS  @4GA*/ 09466600
*/*                              AND CORRECTED "PARSE PULL" LINE @4GA*/ 09483200
*/* $04=OW00225,120,111293,THA5: ADDED UMSDSP TO INDICATE SDSP   @04A*/ 09488800
*/*                              MIGRATED DATA.                  @04A*/ 09494400
*/* $CG=HSMCG.120.082393,THB5: SAM Compression Support           @CGA*/ 09497200
*/* $05=OW14397,130,080995,THH9: ROLL-IN OW11701 SUPPORT         @05A*/ 09498100
*/*                              UNSERIALIZED BACKUP.            @05A*/ 09499000
*/* $SI=HSMSI,140,070896,THN4: FIRST SOURCE VOLUME SUPPORT       @SIA*/ 09499500
*/* $06=OW24862,130,012497,THN5: Remove unprintable characters from  */ 09499600
*/*                              comments.                       @06A*/ 09499700
*/********************************************************************/ 09500000
* %GOTO U_HDR;                  /*                                      09550000
         MACRO                                                          09600000
&NAME ARCUTILP &IDCDOUT=NO                                              09650000
         AGO   .U_ASM                                                   09700000
*                               */                                      09750000
* %U_HDR: ;                                                             09800000
*DECLARE 1 UTILP BDY(WORD),        /* PARAMETER LIST FOR ARCUTIL     */ 09850000
*      5 UPID CHAR(8),             /* PARM LIST ID                   */ 09900000
*      5 UPVERS FIXED(8),          /* PARM LIST VERSION              */ 09950000
*      5 UPRECORD BIT(8),          /* REQUESTED RECORDS              */ 10000000
*        10 UPREMIGR BIT(1), /* ON IF UTILITY IS TO                     10050000
*                                           CREATE MIGRATED DATA SET    10100000
*                                           INFORMATION RECORDS      */ 10150000
*        10 UPREBACK BIT(1), /* ON IF UTILITY IS TO                     10200000
*                                           CREATE BACKED UP DATA SET   10250000
*                                           INFORMATION RECORDS      */ 10300000
*        10 UPREDASD BIT(1), /* ON IF UTILITY IS TO                     10350000
*                                           CREATE DASD CAPACITY        10400000
*                                           PLANNING RECORDS         */ 10450000
*        10 UPRETAPE BIT(1), /* ON IF UTILITY IS TO                     10500000
*                                           CREATE TAPE CAPACITY        10550000
*                                           PLANNING RECORDS         */ 10600000
*        10 * BIT(4),                   /* (RESERVED)                */ 10650000
*      5 * CHAR(1),                /* RESERVED                       */ 10700000
*      5 UPOPTION  BIT(8),         /* PROCESSING OPTIONS             */ 10750000
*        10 UPSPALL             BIT(1), /* ON IF SNAP PROCESSING        10800000
*                                           IS ALWAYS REQUESTED.     */ 10850000
*        10 UPSPERR             BIT(1), /* ON IF SNAP PROCESSING        10900000
*                                           IS REQUESTED FOR ERRORS. */ 10950000
*        10 * BIT(6),                   /* (RESERVED)                */ 11000000
*      5 UPOUTDCB PTR(31), /* ADDRESS OF OUTPUT DS DCB               */ 11050000
*      5 UPSTAMP CHAR(8),           /* TIME AND DATE STRUCTURE       */ 11100000
*        7 UPHTIME CHAR(4),         /* TIME STAMP: HHMMSSTH          */ 11150000
*        7 UPHDATE CHAR(4),         /* DATE STAMP: YYYYDDDF          */ 11200000
*      5 UPEXITP PTR(31),          /* ADDRESS OF USER EXIT ENTRY @02A*/ 11250000
*      5 UPEXAREA PTR(31),         /* ADDRESS OF CONTROL AREA    @02A*/ 11300000
*      5 * CHAR(12),               /* (RESERVED)                 @02C*/ 11350000
*      5 UPNUMIGR FIXED(31), /* NUMBER OF TYPE 'M' RECORDS           */ 11400000
*      5 UPNUBACK    FIXED(31), /* NUMBER OF TYPE 'B' RECORDS        */ 11450000
*      5 UPNUDASD    FIXED(31), /* NUMBER OF TYPE 'C' RECORDS        */ 11500000
*      5 UPNUTAPE    FIXED(31), /* NUMBER OF TYPE 'T' RECORDS        */ 11550000
*      5 * CHAR(20),               /* (RESERVED)                     */ 11600000
*      5 UPRC FIXED(31),           /* RETURN CODE                    */ 11650000
*      5 UPREAS FIXED(31);         /* REASON CODE                    */ 11700000
*                                                                       11750000
*/********************************************************************/ 11800000
*/*                                                                  */ 11850000
*/* THE FOLLOWING INCLUDES THE MAPPING FOR THE DCUOUTH HEADER        */ 11900000
*/* THAT IS COMMON TO ALL DATA COLLECTION RECORDS.  THIS MAPPING     */ 11950000
*/* IS CONTAINED IN THE DFP MACRO NAMED IDCDOUT.                 @02C*/ 12000000
*/*                                                                  */ 12050000
*/********************************************************************/ 12100000
*%IF U_OMIT = 'YES' %THEN          /* DON'T INCLUDE IDCDOUT          */ 12150000
*  %GOTO U_BYPS;                                                        12200000
*%DCL DCU_HDR CHAR;                                                     12250000
*%DCU_HDR = 'YES';                 /* GET THE HEADER OF THE IDCDOUT  */ 12300000
*%INCLUDE SYSLIB(IDCDOUT);         /* MACRO FOR RECORD MAPPING       */ 12350000
*%DEACT DCU_HDR;                                                        12400000
*%U_BYPS:;                                                              12450000
*                                                                       12500000
*/********************************************************************/ 12550000
*/*                                                                  */ 12600000
*/* THE FOLLOWING ARE THE MAPPINGS FOR THE DIFFERENT TYPES OF        */ 12650000
*/* RECORDS PRODUCED BY THE DFHSM DCU UTILITY FUNCTION               */ 12700000
*/*                                                                  */ 12750000
*/********************************************************************/ 12800000
*                                                                       12850000
*DECLARE                                                                12900000
*/* MIGRATED DATA SET INFORMATION (RECORD TYPE 'M')                  */ 12950000
* 1 UMMDSI DEFINED(DCUDATA), /* MIGRATED DATA SET INFORMATION           13000000
*                                    (DEFINED ON DCUDATA)            */ 13050000
*   2 UMDSNAM CHAR(44),          /* DATA SET NAME                    */ 13100000
*   2 UMFLAG1 BIT(8),            /* INFORMATION FLAG #1              */ 13150000
*     3 UMLEVEL BIT(2),          /* MIGRATED LEVEL                   */ 13200000
*     3 UMCHIND  BIT(1),         /* CHANGED SINCE LAST BACKUP    @03A*/ 13250000
*     3 UMSDSP   BIT(1),         /* INDICATES SDSP MIGRATED DATA @04A*/ 13283300
*     3 *        BIT(4),         /* RESERVED                     @04C*/ 13316600
*   2 UMDEVCL CHAR(1),           /* DEVICE CLASS OF MIGRATION VOL    */ 13350000
*   2 UMDSORG  CHAR(2),          /* DATA SET ORGANIZATION AT TIME       13400000
*                                   OF MIGRATION.                @03C*/ 13450000
*   2 UMDSIZE FIXED(31),         /* MIGRATION COPY DATA SET SIZE        13500000
*                                   IN KILOBYTES                     */ 13550000
*   2 UMMDATE,                   /* TIMESTAMP FIELD                  */ 13600000
*     3 UMTIME CHAR(4),          /* MIGRATED TIME - HHMMSSTH FORMAT  */ 13650000
*     3 UMDATE CHAR(4),          /* MIGRATED DATE - YYYYDDDF FORMAT  */ 13700000
*   2 UMCLASS,                                                          13750000
*     3 UMDCLAS,                                                        13800000
*       4 UMDCLNG FIXED(15), /* DATA CLASS NAME LENGTH               */ 13850000
*       4 UMDATCL CHAR(30),      /* DATA CLASS NAME                  */ 13900000
*     3 UMSCLAS,                                                        13950000
*       4 UMSCLNG FIXED(15), /* STORAGE CLASS NAME LENGTH            */ 14000000
*       4 UMSTGCL CHAR(30),      /* STORAGE CLASS NAME               */ 14050000
*     3 UMMCLAS,                                                        14100000
*       4 UMMCLNG FIXED(15), /* MANAGEMENT CLASS NAME LENGTH         */ 14150000
*       4 UMMGTCL CHAR(30),      /* MANAGEMENT CLASS NAME            */ 14200000
*   2 UMRECRD BIT(8),            /* RECORD FORMAT BYTE           @03A*/ 14250000
*   2 UMRECOR BIT(8),            /* VSAM RECORD ORGANIZATION     @03A*/ 14300000
*     3 UMESDS   BIT(1),         /* ENTRY-SEQUENCED DATA SET     @03A*/ 14350000
*     3 UMKSDS   BIT(1),         /* KEY-SEQUENCED DATA SET       @03A*/ 14400000
*     3 UMLDS    BIT(1),         /* LINEAR DATA SET              @03A*/ 14450000
*     3 UMRRDS   BIT(1),         /* RELATIVE-RECORD DATA SET     @03A*/ 14500000
*     3 *        BIT(4),         /* RESERVED                     @03A*/ 14550000
*   2 UMBKLNG CHAR(2),           /* BLOCK LENGTH                 @03A*/ 14600000
*   2 UMFLAG2 BIT(8),            /* INFORMATION FLAG #2          @03A*/ 14650000
*     3 UMRACFD  BIT(1),         /* RACF-INDICATED               @03A*/ 14700000
*     3 UMGDS    BIT(1),         /* SET TO 1, GENERATION GROUP DATASET  14750000
*                                  THIS FIELD IS ONLY VALID WHEN THE    14800000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 14850000
*     3 UMREBLK  BIT(1),         /* SET TO 1, DATA SET IS SYSTEM-       14900000
*                                  REBLOCKABLE                          14950000
*                                  THIS FIELD IS ONLY VALID WHEN THE    15000000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 15050000
*     3 UMPDSE   BIT(1),         /* SET TO 1, DATA SET IS PDSE.         15100000
*                                  THIS FIELD IS ONLY VALID WHEN THE    15150000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 15200000
*     3 UMSMSM   BIT(1),         /* SET TO 1, DATA SET IS SMS-MANAGED   15250000
*                                                                @03A*/ 15300000
*     3 UMCOMPR  BIT(1),         /* SET TO 1, DATA SET IS COMPRESSED    15325000
*                                   FORMAT                       @CGA*/ 15350000
*     3 *        BIT(2),         /* RESERVED                     @CGC*/ 15375000
*   2 *       CHAR(1),           /* RESERVED                     @03A*/ 15400000
*   2 UMNMIG  FIXED(15),         /* NUMBER OF TIMES MIGRATED     @03A*/ 15450000
*   2 UMALLSP FIXED(31),         /* ORIGINAL ALLOCATE SPACE (KB) @03A*/ 15500000
*   2 UMUSESP FIXED(31),         /* QUANTITY OF USER DATA (KB)   @03A*/ 15550000
*   2 UMRECSP FIXED(31),         /* RECALL SPACE ESTIMATE (KB)   @03A*/ 15600000
*   2 UMCREDT CHAR(4),           /* CREATION   DATE - YYYYDDDF   @03A*/ 15650000
*   2 UMEXPDT CHAR(4),           /* EXPIRATION DATE - YYYYDDDF   @03A*/ 15700000
*   2 UMLBKDT CHAR(8),           /* LAST BACKUP DATE- STCK FORMAT       15750000
*                                   CONSISTENT WITH DCDLBKDT.           15800000
*                                  THIS FIELD IS ONLY VALID WHEN THE    15850000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 15900000
*   2 UMLRFDT CHAR(4),           /* LAST REFERENCE DATE-YYYYDDDF @03A*/ 15950000
*   2 UM_USER_DATASIZE FIXED(31), /* VALID WHEN UMCOMPR SET, THIS       15955500
*                                 VALUE REPESENTS, IN K-BYTES (1024)    15961000
*                                 WHAT THE DATA SIZE WOULD BE IF IT     15966500
*                                 WERE NOT COMPRESSED            @CGA*/ 15972000
*   2 UM_COMP_DATASIZE FIXED(31), /* VALID WHEN UMCOMPR SET, THIS       15977500
*                                 VALUE REPESENTS, IN K-BYTES (1024)    15983000
*                                 THE ACTUAL (COMPRESSED) DATA          15988500
*                                 SIZE                           @CGA*/ 15994000
*   2 UMFRVOL CHAR(6),           /* THE FIRST SOURCE VOLUME SERIAL      15995500
*                                   OF THE MIGRATED DATA         @SIA*/ 15997000
*   2 *       CHAR(14),          /* RESERVED SPACE               @SIA*/ 15998500
*   2 UMMDSIE CHAR(0);           /* END OF DCUMCDS                   */ 16000000
*                                                                       16050000
*DECLARE                                                                16100000
*/* BACKUP VERSION INFORMATION (RECORD TYPE 'B')             @YA29290*/ 16150000
* 1 UBBDSI DEFINED(DCUDATA), /* BACKUP DATA SET INFORMATION             16200000
*                                    (DEFINED ON DCUDATA)            */ 16250000
*   2 UBDSNAM CHAR(44),          /* DATA SET NAME                    */ 16300000
*   2 UBFLAG1 BIT(8),            /* INFORMATION FLAG #1              */ 16350000
*     3 UBINCAT  BIT(1),         /* CATALOGED WHEN BACKUP MADE   @03A*/ 16400000
*     3 UBNOENQ  BIT(1),         /* NO ENQ SERIALIZATION USED    @03A*/ 16450000
*     3 UBBWO    BIT(1),         /* BACKUP WHILE OPEN            @03A*/ 16500000
*     3 UBNQN1   BIT(1),         /* ENQ attempted, but failed    @05A*/ 16520000
*     3 UBNQN2   BIT(1),         /* ENQ attempted but failed, backup    16540000
                                   retried, and ENQ failed again @05A*/ 16560000
*     3 *        BIT(3),         /* Reserved                     @05C*/ 16580000
*   2 UBDEVCL CHAR(1),           /* DEVICE CLASS OF BACKUP VOL       */ 16600000
*   2 UBDSORG  CHAR(2),          /* DATA SET ORGANIZATION AT TIME       16650000
*                                   OF BACKUP.                   @03C*/ 16700000
*   2 UBDSIZE FIXED(31),         /* BACKUP VERSION SIZE IN KBYTES    */ 16750000
*   2 UBBDATE,                   /* BACKUP DATE/TIME                 */ 16800000
*     3 UBTIME CHAR(4),          /* BACKUP TIME - HHMMSSTH FORMAT    */ 16850000
*     3 UBDATE CHAR(4),          /* BACKUP DATE - YYYYDDDF FORMAT    */ 16900000
*   2 UBCLASS,                   /* SMS CLASS INFORMATION            */ 16950000
*     3 UBDCLAS,                 /* DATA CLASS WHEN BACKUP MADE      */ 17000000
*       4 UBDCLNG FIXED(15), /* DATA CLASS NAME LENGTH               */ 17050000
*       4 UBDATCL CHAR(30),      /* DATA CLASS NAME                  */ 17100000
*     3 UBSCLAS,                 /* STORAGE CLASS WHEN BACKUP MADE   */ 17150000
*       4 UBSCLNG FIXED(15), /* STORAGE CLASS NAME LENGTH            */ 17200000
*       4 UBSTGCL CHAR(30),      /* STORAGE CLASS NAME               */ 17250000
*     3 UBMCLAS,                 /* MANAGEMENT CLASS WHEN BACKUP MADE*/ 17300000
*       4 UBMCLNG FIXED(15), /* MANAGEMENT CLASS NAME LENGTH         */ 17350000
*       4 UBMGTCL CHAR(30),      /* MANAGEMENT CLASS NAME            */ 17400000
*   2 UBRECRD BIT(8),            /* RECORD FORMAT BYTE           @03A*/ 17450000
*   2 UBRECOR BIT(8),            /* VSAM RECORD ORGANIZATION     @03A*/ 17500000
*     3 UBESDS   BIT(1),         /* ENTRY-SEQUENCED DATA SET     @03A*/ 17550000
*     3 UBKSDS   BIT(1),         /* KEY-SEQUENCED DATA SET       @03A*/ 17600000
*     3 UBLDS    BIT(1),         /* LINEAR DATA SET              @03A*/ 17650000
*     3 UBRRDS   BIT(1),         /* RELATIVE-RECORD DATA SET     @03A*/ 17700000
*     3 *        BIT(4),         /* RESERVED                     @03A*/ 17750000
*   2 UBBKLNG CHAR(2),           /* BLOCK LENGTH                 @03A*/ 17800000
*   2 UBFLAG2 BIT(8),            /* INFORMATION FLAG #2          @03A*/ 17850000
*     3 UBRACFD  BIT(1),         /* RACF-INDICATED               @03A*/ 17900000
*     3 UBGDS    BIT(1),         /* SET TO 1, GENERATION GROUP DATASET. 17950000
*                                  THIS FIELD IS ONLY VALID WHEN THE    18000000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 18050000
*     3 UBREBLK  BIT(1),         /* SET TO 1, DATA SET IS SYSTEM-       18100000
*                                  REBLOCKABLE                          18150000
*                                  THIS FIELD IS ONLY VALID WHEN THE    18200000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 18250000
*     3 UBPDSE   BIT(1),         /* SET TO 1, DATA SET IS PDSE.         18300000
*                                  THIS FIELD IS ONLY VALID WHEN THE    18350000
*                                  DATA SET IS SMS-MANAGED.      @03A*/ 18400000
*     3 UBSMSM   BIT(1),         /* SET TO 1, DATA SET WAS SMS-         18450000
*                                   MANAGED AT TIME OF BACKUP    @03A*/ 18500000
*     3 UBCOMPR  BIT(1),         /* SET TO 1, DATA SET IS COMPRESSED    18525000
*                                   FORMAT                       @CGA*/ 18550000
*     3 *        BIT(2),         /* RESERVED                     @CGC*/ 18575000
*   2 *       CHAR(3),           /* RESERVED                     @03A*/ 18600000
*   2 UBALLSP FIXED(31),         /* ORIGINAL ALLOCATE SPACE (KB) @03A*/ 18650000
*   2 UBUSESP FIXED(31),         /* QUANTITY OF USER DATA (KB)   @03A*/ 18700000
*   2 UBRECSP FIXED(31),         /* RECOVER SPACE ESTIMATE (KB)  @03A*/ 18750000
*   2 UB_USER_DATASIZE FIXED(31), /* VALID WHEN UBCOMPR SET, THIS       18756200
*                                 VALUE REPESENTS, IN KILOBYTES, WHAT   18762400
*                                 THE DATA SIZE WOULD BE IF IT WERE     18768600
*                                 NOT COMPRESSED                 @CGA*/ 18774800
*   2 UB_COMP_DATASIZE FIXED(31), /* VALID WHEN UBCOMPR SET, THIS       18781000
*                                 VALUE REPESENTS, IN KILOBYTES, THE    18787200
*                                 ACTUAL (COMPRESSED) DATA SIZE  @CGA*/ 18793400
*   2 UBFRVOL CHAR(6),           /* THE FIRST SOURCE VOLUME SERIAL      18795000
*                                   OF THE BACKUP DATA           @SIA*/ 18796600
*   2 *       CHAR(14),          /* RESERVED SPACE               @SIA*/ 18798300
*   2 UBBDSIE CHAR(0);           /* END OF DCUBCDS                   */ 18800000
*                                                                       18850000
*                                                                       18900000
*DECLARE                                                                18950000
*/* DFHSM DASD CAPACITY PLANNING RECORD (RECORD TYPE 'C')            */ 19000000
* 1 UCCAPD DEFINED(DCUDATA), /* DASD CAPACITY PLANNING RECORD           19050000
*                                    (DEFINED ON DCUDATA)            */ 19100000
*   2 UCVOLSR CHAR(6),           /* VOLUME SERIAL NUMBER             */ 19150000
*   2 UCCOLDT CHAR(4),           /* DATE THE STATISTICAL DATA WAS       19200000
*                                   COLLECTED BY DFHSM FOR              19250000
*                                   THE VOLUME - YYYYDDDF FORMAT     */ 19300000
*   2 UCFLAG1 BIT(8),            /* INFORMATION FLAG #1              */ 19350000
*     3 UCLEVEL BIT(2),          /* LEVEL OF VOLUME (LO, L1)         */ 19400000
*     3 *        BIT(6),         /* RESERVED                         */ 19450000
*   2 *          CHAR(1),        /* RESERVED                         */ 19500000
*   2 UCTOTAL    FIXED(31),      /* TOTAL CAPACITY OF VOLUME IN         19550000
*                                   KILOBYTES                    @03C*/ 19600000
*   2 UCOCCUP,                                                          19650000
*     3 UCTGOCC FIXED(8),        /* SPECIFIED TARGET OCCUPANCY OF       19700000
*                                   VOLUME                           */ 19750000
*     3 UCTROCC FIXED(8),        /* SPECIFIED TRIGGER OCCUPANCY OF      19800000
*                                   VOLUME                           */ 19850000
*     3 UCBFOCC FIXED(8),        /* OCCUPANCY OF VOLUME BEFORE          19900000
*                                   PROCESSING                       */ 19950000
*     3 UCAFOCC FIXED(8),        /* OCCUPANCY OF VOLUME AFTER           20000000
*                                   PROCESSING (0 IF NOT PROCESSED)  */ 20050000
*     3 UCNOMIG FIXED(8),        /* PERCENTAGE OF VOLUME DATA NOT       20100000
*                                   MIGRATED BUT ELIGIBLE TO            20150000
*                                   MIGRATE                          */ 20200000
*     3 UCNINTV FIXED(8),        /* # OF TIMES INTERVAL MIGRATION WAS   20250000
*                                   RUN AGAINST THE VOLUME           */ 20300000
*     3 UCINTVM FIXED(8),        /* # OF TIMES TARGET OCCUPANCY WAS     20350000
*                                   MET FOR THE VOLUME DURING           20400000
*                                   INTERVAL MIGRATION               */ 20450000
*   2 UCCAPDE CHAR(0);           /* END OF DCCCAPD                   */ 20500000
*                                                                       20550000
*DECLARE                                                                20600000
*/* DFHSM TAPE CAPACITY PLANNING RECORD (RECORD TYPE 'T')            */ 20650000
* 1 UTCAPT DEFINED(DCUDATA), /* TAPE CAPACITY PLANNING RECORD           20700000
*                                    (DEFINED ON DCUDATA)            */ 20750000
*   2 UTSTYPE CHAR(1),           /* TYPE OF TAPE CAPACITY PLANNING      20800000
*                                   RECORD                           */ 20850000
*   2 *          CHAR(3),        /* RESERVED                         */ 20900000
*   2 UTFULL FIXED(31),          /* # OF FULL TAPE VOLUMES           */ 20950000
*   2 UTPART FIXED(31),          /* # OF PARTIAL FULL VOLS           */ 21000000
*   2 UTEMPTY FIXED(31),         /* # OF EMPTY TAPE VOLUMES          */ 21050000
*   2 UTCAPTE CHAR(0);           /* END OF DCTCAPT                   */ 21100000
*                                                                       21150000
*/* CONSTANT DECLARE AREA                                            */ 21200000
*                                                                       21250000
*/* VALUES FOR UPID AND UPVERS - PARMLIST ID AND VERSION             */ 21300000
*DECLARE UPIDNAME CHAR(8) CONSTANT('ARCUTILP'); /* ID NAME           */ 21350000
*DECLARE UPVERNUM FIXED(8) CONSTANT(1); /* CURRENT VERSION #         */ 21400000
*                                                                       21450000
*/* VALUES FOR DCURCTYP - RECORD TYPE IN HEADER AREA                 */ 21500000
*DECLARE UKTMIGR CHAR(2) CONSTANT('M ');/* MIGRATE TYPE RECORD       */ 21550000
*DECLARE UKTBACK CHAR(2) CONSTANT('B ');/* BACKUP TYPE RECORD        */ 21600000
*DECLARE UKCDASD CHAR(2) CONSTANT('C ');/* DASD CAPACITY PLANNING       21650000
*                                               RECORD               */ 21700000
*DECLARE UKCTAPE CHAR(2) CONSTANT('T ');/* TAPE CAPACITY PLANNING       21750000
*                                               RECORD               */ 21800000
*                                                                       21850000
*/* VALUES FOR UMLEVEL AND UCVLTYP - MIGRATION VOLUME LEVEL          */ 21900000
*DECLARE UKLEVL0 BIT(2) CONSTANT('00'B); /* LEVEL 0 MIGRATION        */ 21950000
*DECLARE UKLEVL1 BIT(2) CONSTANT('01'B); /* LEVEL 1 MIGRATION        */ 22000000
*DECLARE UKLEVL2 BIT(2) CONSTANT('10'B); /* LEVEL 2 MIGRATION        */ 22050000
*                                                                       22100000
*/* VALUES FOR UMDEVCL - DEVICE CLASS OF MIGRATION VOLUME            */ 22150000
*DECLARE UKDASDV CHAR(1) CONSTANT('D'); /* DASD VOLUME               */ 22200000
*DECLARE UKTAPEV CHAR(1) CONSTANT('T'); /* TAPE VOLUME               */ 22250000
*                                                                       22300000
*/* VALUES FOR UTSTYPE - TYPE OF TAPE CAPACITY PLANNING RECORD       */ 22350000
*DECLARE UKBKTAPE CHAR(1) CONSTANT('B'); /* BACKUP TAPES             */ 22400000
*DECLARE UKDUTAPE CHAR(1) CONSTANT('D'); /* DUMP TAPES               */ 22450000
*DECLARE UKMGTAPE CHAR(1) CONSTANT('M'); /* MIGRATION TAPES          */ 22500000
*                                                                       22550000
* %GOTO U_ENDA;                                                         22600000
*       /***********************************************************/   22650000
*       /* A SAMPLE REXX PROGRAM WHICH PROCESSES DCOLLECT DATA     */   22700000
*       /* HAS BEEN PLACED IN THE TOOL SET EXAMPLES (ARCTOOLS)     */   22750000
*       /* WHICH BUILDS THE HSM.SAMPLE.TOOL(DCOLREXX) MEMBER.  @4GC*/   22800000
*       /***********************************************************/   23250000
.U_ASM    ANOP                                                  @02A    34400000
         AIF   ('&IDCDOUT' EQ 'NO').U_DEF                       @02A    34450000
         IDCDOUT                                                @02A    34500000
         AGO   .U_DFHSM                                         @02A    34550000
.U_DEF    ANOP                                                  @02A    34600000
         DSECT ,                                                @02A    34650000
*********************************************************************** 34700000
*   HEADER PORTION OF DATA COLLECTION UTILITY OUTPUT RECORD. EACH     * 34750000
*   DATA SECTION IS PRECEDED BY THIS HEADER.                      @06C* 34800000
*********************************************************************** 34850000
DCUOUTH  DS    0CL24                    DATA COLLECTION OUTPUT RECORD   34900000
DCURDW   DS    F                        RECORD DESCRIPTOR WORD          34950000
         ORG   DCUOUTH+0                                                35000000
DCULENG  DS    H                        LENGTH OF THIS RECORD           35050000
         DS    CL2                      RESERVED                        35100000
DCURCTYP DS    CL2                      RECORD TYPE FOR THIS RECORD     35150000
DCUVERS  DS    H                        VERSION                         35200000
DCUSYSID DS    CL4                      SYSTEM ID FOR THIS OPERATION    35250000
DCUTMSTP DS    CL8                      TIMESTAMP FIELD                 35300000
         ORG   DCUOUTH+12                                               35350000
DCUTIME  DS    A                        TIME IN SMF HEADER FORMAT       35400000
DCUDATE  DS    CL4                      DATE IN SMF FORMAT (CCYYDDDF)   35450000
         DS    CL4                      RESERVED                        35500000
DCUDATA  DS    0C                       END OF HEADER SECTION           35550000
*********************************************************************** 35600000
*   VALUES FOR DCURCTYP - RECORD TYPE                                 * 35650000
*********************************************************************** 35700000
DCUDATAT EQU   C'D'                     DATA TYPE RECORD                35750000
DCUASSOC EQU   C'A'                     VSAM ASSOCIATION RECORD         35800000
DCUVULUT EQU   C'V'                     VOLUME TYPE RECORD              35850000
.U_DFHSM  ANOP                                                    @02A  35900000
*********************************************************************** 35950000
*   ARCUTILP -                                                        * 36000000
*   PARAMETER LIST TO REQUEST DATA COLLECTION SERVICES            @01A* 36050000
*********************************************************************** 36100000
ARCUTILP DS    0F                                                       36150000
UTILP    DS    0CL216                   ARCUTIL PARAMETER LIST          36200000
UPID     DS    CL8                      PARM LIST ID                    36250000
UPVERS   DS    AL1                      PARM LIST VERSION               36300000
UPRECORD DS    XL1                      REQUESTED RECORDS               36350000
UPREMIGR EQU   B'10000000'              ON IF UTILITY IS TO CREATE     X36400000
                                        MIGRATED DATA SET INFORMATION   36450000
UPREBACK EQU   B'01000000'              ON IF UTILITY IS TO CREATE     X36500000
                                        BACKED UP DATA SET INFORMATION  36550000
UPREDASD EQU   B'00100000'              ON IF UTILITY IS TO CREATE     X36600000
                                        DASD CAPACITY PLANNING RECORDS  36650000
UPRETAPE EQU   B'00010000'              ON IF UTILITY IS TO CREATE     X36700000
                                        TAPE CAPACITY PLANNING RECORDS  36750000
         DS    CL1                      RESERVED                        36800000
UPOPTION DS    XL1                      PROCESSING OPTIONS              36850000
UPSPALL  EQU   B'10000000'              ON IF SNAP PROCESSING          X36900000
                                        IS ALWAYS REQUESTED.            36950000
UPSPERR  EQU   B'01000000'              ON IF SNAP PROCESSING          X37000000
                                        IS REQUESTED FOR ERRORS         37050000
UPOUTDCB DS    AL4                      ADDRESS OF OUTPUT DS DCB        37100000
UPSTAMP  DS    CL8                      TIME AND DATE STRUCTURE         37150000
         ORG   UPSTAMP+0                                                37200000
UPHTIME  DS    CL4                      TIME STAMP: HHMMSSTH            37250000
UPHDATE  DS    CL4                      DATE STAMP: YYYYDDDF            37300000
UPEXITP  DS    AL4                      ADDRESS OF USER EXIT ENTRY @02A 37350000
UPEXAREA DS    AL4                      ADDRESS OF CONTROL AREA    @02A 37400000
         DS    CL12                     RESERVED                        37450000
UPNUMIGR DS    F                        NUMBER OF TYPE 'M' RECORDS      37500000
UPNUBACK DS    F                        NUMBER OF TYPE 'B' RECORDS      37550000
UPNUDASD DS    F                        NUMBER OF TYPE 'C' RECORDS      37600000
UPNUTAPE DS    F                        NUMBER OF TYPE 'T' RECORDS      37650000
         DS    CL20                     RESERVED                        37700000
UPRC     DS    F                        RETURN CODE                     37750000
UPREAS   DS    F                        REASON CODE                     37800000
*********************************************************************** 37850000
* ASSEMBLER output generated by PLASMAP to Assembler Conversion       * 37900000
*  29 Sep 1989 07:31:55                                               * 37950000
*********************************************************************** 38000000
*********************************************************************** 38050000
*   MIGRATED DATA SET INFORMATION (RECORD TYPE 'M')                   * 38100000
*********************************************************************** 38150000
         ORG   DCUOUTH+24                                               38200000
UMMDSI   DS    0CL196                   MIGRATED DATA SET INFORMATION  X38250000
                                        (DEFINED ON DCUDATA)            38300000
UMDSNAM  DS    CL44                     DATA SET NAME                   38350000
UMFLAG1  DS    XL1                      INFORMATION FLAG #1             38400000
UMLEVEL  EQU   B'11000000'              MIGRATED LEVEL                  38450000
UMCHIND  EQU   B'00100000'              CHANGED SINCE LAST BACKUP  @03A 38500000
UMSDSP   EQU   B'00010000'              INDICATES SDSP MIGRATED    @04A 38525000
UMDEVCL  DS    CL1                      DEVICE CLASS OF MIGRATION VOL   38550000
UMDSORG  DS    CL2                      DATA SET ORGANIZATION AT TIME  X38600000
                                        OF MIGRATION               @03C 38650000
UMDSIZE  DS    F                        MIGRATION COPY DATA SET SIZE   X38700000
                                        IN KILOBYTES                    38750000
UMMDATE  DS    CL8                      TIMESTAMP FIELD                 38800000
         ORG   DCUOUTH+76                                               38850000
UMTIME   DS    CL4                      MIGRATED TIME - HHMMSSTH       X38900000
                                        FORMAT                          38950000
UMDATE   DS    CL4                      MIGRATED DATE - YYYYDDDF       X39000000
                                        FORMAT                          39050000
UMCLASS  DS    CL96                                                     39100000
         ORG   DCUOUTH+84                                               39150000
UMDCLAS  DS    CL32                                                     39200000
         ORG   DCUOUTH+84                                               39250000
UMDCLNG  DS    H                        DATA CLASS NAME LENGTH          39300000
UMDATCL  DS    CL30                     DATA CLASS NAME                 39350000
UMSCLAS  DS    CL32                                                     39400000
         ORG   DCUOUTH+116                                              39450000
UMSCLNG  DS    H                        STORAGE CLASS NAME LENGTH       39500000
UMSTGCL  DS    CL30                     STORAGE CLASS NAME              39550000
UMMCLAS  DS    CL32                                                     39600000
         ORG   DCUOUTH+148                                              39650000
UMMCLNG  DS    H                        MANAGEMENT CLASS NAME LENGTH    39700000
UMMGTCL  DS    CL30                     MANAGEMENT CLASS NAME           39750000
UMRECRD  DS    CL1                      RECORD FORMAT BYTE         @03A 39800000
UMRECOR  DS    CL1                      VSAM RECORD ORGANIZATION   @03A 39850000
UMESDS   EQU   B'10000000'              ENTRY-SEQUENCED DATA SET   @03A 39900000
UMKSDS   EQU   B'01000000'              KEY-SEQUENCED   DATA SET   @03A 39950000
UMLDS    EQU   B'00100000'              LINEAR          DATA SET   @03A 40000000
UMRRDS   EQU   B'00010000'              RELATIVE-RECORD DATA SET   @03A 40050000
UMBKLNG  DS    H                        BLOCK LENGTH               @03A 40100000
UMFLAG2  DS    XL1                      INFORMATION FLAG #2        @03A 40150000
UMRACFD  EQU   B'10000000'              RACF-INDICATED             @03A 40200000
UMGDS    EQU   B'01000000'              SET TO 1, GENERATION GROUP     X40250000
                                        DATA SET.  THIS FIELD IS ONLY  X40300000
                                        VALID WHEN SMS-MANAGED.    @03A 40350000
UMREBLK  EQU   B'00100000'              SET TO 1, SYSTEM REBLOCKABLE   X40400000
                                        DATA SET.  THIS FIELD IS ONLY  X40450000
                                        VALID WHEN SMS-MANAGED.    @03A 40500000
UMPDSE   EQU   B'00010000'              SET TO 1, THIS IS A PDSE       X40550000
                                        DATA SET.  THIS FIELD IS ONLY  X40600000
                                        VALID WHEN SMS-MANAGED.    @03A 40650000
UMSMSM   EQU   B'00001000'              SET TO 1, THIS IS AN SMS-      X40700000
                                        MANAGED DATA SET           @03A 40750000
UMCOMPR  EQU   B'00000100'              SET TO 1, THIS IS A COMPRESSED X40766600
                                        DATA SET                   @CGA 40783200
         DS    CL1                      RESERVED                   @03A 40800000
UMNMIG   DS    H                        NUMBER OF TIMES MIGRATED   @03A 40850000
UMALLSP  DS    F                        ORIGINAL ALLOCATE SPACE(KB)    X40900000
                                                                   @03A 40950000
UMUSESP  DS    F                        QUANTITY USER DATA  (KB)   @03A 41000000
UMRECSP  DS    F                        RECALL SPACE ESTIMATE (KB) @03A 41050000
UMCREDT  DS    CL4                      CREATION DATE - YYYYDDDF   @03A 41100000
UMEXPDT  DS    CL4                      EXPIRATION DATE - YYYYDDDF @03A 41150000
UMLBKDT  DS    CL8                      LAST BACKUP DATE- IN STCK      X41200000
                                        FORMAT CONSISTENT WITH FIELD   X41250000
                                        DCDLBKDT.  THIS FIELD IS ONLY  X41300000
                                        VALID WHEN SMS-MANAGED.    @03A 41350000
UMLRFDT  DS    CL4                      LAST REFERENCE DATE-YYYYDDDF   X41400000
                                                                   @03A 41450000
UM_USER_DATASIZE DS  F                  VALID WHEN UMCOMPR SET, THIS   X41455500
                                        VALUE REPRESENTS WHAT THE      X41461000
                                        COMPRESSED DATA SIZE WOULD BE  X41466500
                                        IF IT WERE NOT COMPRESSED      X41472000
                                        IN KILOBYTES              @CGA  41477500
UM_COMP_DATASIZE DS  F                  VALID WHEN UMCOMPR SET, THIS   X41483000
                                        VALUE REPESENTS THE DATA SIZE  X41488500
                                        (COMPRESSED) IN KILOBYTES @CGA  41494000
UMFRVOL  DS    CL6                      THE FIRST SOURCE VOLUME SERIAL X41495500
                                        OF THE MIGRATED DATA      @SIA  41497000
         DS    CL14                     RESERVED                  @SIA  41498500
UMMDSIE  DS    0C                       END OF DCUMCDS                  41500000
*********************************************************************** 41550000
*   BACKED UP DATA SET INFORMATION (RECORD TYPE 'B')                  * 41600000
*********************************************************************** 41650000
         ORG   DCUOUTH+24                                               41700000
UBBDSI   DS    0CL176                   BACKUP DATA SET INFORMATION    X41750000
                                        (DEFINED ON DCUDATA)            41800000
UBDSNAM  DS    CL44                     DATA SET NAME                   41850000
UBFLAG1  DS    XL1                      INFORMATION FLAG #1        @03C 41900000
UBINCAT  EQU   B'10000000'              CATALOGED WHEN BACKUP MADE @03A 41950000
UBNOENQ  EQU   B'01000000'              NO ENQ ATTEMPTED, SINCE        X41983300
                                        DFSMSHSM DIRECTED NOT TO   @05C 42016600
UBBWO    EQU   B'00100000'              BACKUP WHILE OPEN          @03A 42050000
UBNQN1   EQU   B'00010000'              ENQ ATTEMPTED, BUT FAILED  @05A 42060000
UBNQN2   EQU   B'00001000'              ENQ ATTEMPTED BUT FAILED,      X42070000
                                        BACKUP RETRIED, AND ENQ FAILED X42080000
                                        AGAIN                      @05A 42090000
UBDEVCL  DS    CL1                      DEVICE CLASS OF BACKUP VOL      42100000
UBDSORG  DS    CL2                      DATA SET ORGANIZATION AT TIME  X42150000
                                        OF BACKUP                  @03C 42200000
UBDSIZE  DS    F                        BACKUP VERSION SIZE IN KBYTES   42250000
UBBDATE  DS    CL8                      LAST BACKUP DATE                42300000
         ORG   DCUOUTH+76                                               42350000
UBTIME   DS    CL4                      LAST BKUP TIME - HHMMSSTH      X42400000
                                        FORMAT                          42450000
UBDATE   DS    CL4                      LAST BKUP DATE - YYYYDDDF      X42500000
                                        FORMAT                          42550000
UBCLASS  DS    CL96                     SMS CLASS INFORMATION           42600000
         ORG   DCUOUTH+84                                               42650000
UBDCLAS  DS    CL32                     DATA CLASS OF LATEST VERSION    42700000
         ORG   DCUOUTH+84                                               42750000
UBDCLNG  DS    H                        DATA CLASS NAME LENGTH          42800000
UBDATCL  DS    CL30                     DATA CLASS NAME                 42850000
UBSCLAS  DS    CL32                     STORAGE CLASS OF LATEST        X42900000
                                        VERSION                         42950000
         ORG   DCUOUTH+116                                              43000000
UBSCLNG  DS    H                        STORAGE CLASS NAME LENGTH       43050000
UBSTGCL  DS    CL30                     STORAGE CLASS NAME              43100000
UBMCLAS  DS    CL32                     MANAGEMENT CLASS OF LATEST     X43150000
                                        VERS                       @06C 43200000
         ORG   DCUOUTH+148                                              43250000
UBMCLNG  DS    H                        MANAGEMENT CLASS NAME LENGTH    43300000
UBMGTCL  DS    CL30                     MANAGEMENT CLASS NAME           43350000
UBRECRD  DS    CL1                      RECORD FORMAT BYTE         @03A 43400000
UBRECOR  DS    CL1                      VSAM RECORD ORGANIZATION   @03A 43450000
UBESDS   EQU   B'10000000'              ENTRY-SEQUENCED DATA SET   @03A 43500000
UBKSDS   EQU   B'01000000'              KEY-SEQUENCED   DATA SET   @03A 43550000
UBLDS    EQU   B'00100000'              LINEAR          DATA SET   @03A 43600000
UBRRDS   EQU   B'00010000'              RELATIVE-RECORD DATA SET   @03A 43650000
UBBKLNG  DS    CL2                      BLOCK LENGTH               @03A 43700000
UBFLAG2  DS    XL1                      INFORMATION FLAG #2        @03A 43750000
UBRACFD  EQU   B'10000000'              RACF-INDICATED             @03A 43800000
UBGDS    EQU   B'01000000'              SET TO 1, GENERATION GROUP     X43850000
                                        DATA SET.  THIS FIELD IS ONLY  X43900000
                                        VALID WHEN SMS-MANAGED.    @03A 43950000
UBREBLK  EQU   B'00100000'              SET TO 1, SYSTEM REBLOCKABLE   X44000000
                                        DATA SET.  THIS FIELD IS ONLY  X44050000
                                        VALID WHEN SMS-MANAGED.    @03A 44100000
UBPDSE   EQU   B'00010000'              SET TO 1, THIS IS A PDSE       X44150000
                                        DATA SET.  THIS FIELD IS ONLY  X44200000
                                        VALID WHEN SMS-MANAGED.    @03A 44250000
UBSMSM   EQU   B'00001000'              SET TO 1, THIS WAS AN SMS-     X44300000
                                        MANAGED DATA SET           @03A 44350000
UBCOMPR  EQU   B'00000100'              SET TO 1, THIS IS A COMPRESSED X44366600
                                        DATA SET                   @CGA 44383200
         DS    CL3                      RESERVED                   @03A 44400000
UBALLSP  DS    F                        ORIGINAL ALLOCATE SPACE (KB)   X44450000
                                                                   @03A 44500000
UBUSESP  DS    F                        QUANTITY USER DATA  (KB)   @03A 44550000
UBRECSP  DS    F                        RECOVER SPACE ESTIMATE(KB) @03A 44600000
UB_USER_DATASIZE DS  F                  VALID WHEN UMCOMPR SET, THIS   X44605500
                                        VALUE REPRESENTS WHAT THE      X44611000
                                        COMPRESSED DATA SIZE WOULD BE  X44616500
                                        IF IT WERE NOT COMPRESSED      X44622000
                                        IN KILOBYTES              @CGA  44627500
UB_COMP_DATASIZE DS  F                  VALID WHEN UMCOMPR SET, THIS   X44633000
                                        VALUE REPESENTS THE DATA SIZE  X44638500
                                        (COMPRESSED) IN KILOBYTES @CGA  44644000
UBFRVOL  DS    CL6                      THE FIRST SOURCE VOLUME SERIAL X44645500
                                        OF THE BACKUP DATA        @SIA  44647000
         DS    CL14                     RESERVED                  @SIA  44648500
UBBDSIE  DS    0C                       END OF DCUBCDS                  44650000
*********************************************************************** 44700000
*   DFHSM DASD CAPACITY PLANNING RECORD (RECORD TYPE 'C')             * 44750000
*********************************************************************** 44800000
         ORG   DCUOUTH+24                                               44850000
UCCAPD   DS    0CL23                    DASD CAPACITY PLANNING RECORD  X44900000
                                        (DEFINED ON DCUDATA)            44950000
UCVOLSR  DS    CL6                      VOLUME SERIAL NUMBER            45000000
UCCOLDT  DS    CL4                      STATISTICAL DATE THE DATA WAS  X45050000
                                        COLLECTED BY DFHSM FOR THE     X45100000
                                        VOLUME - YYYYDDDF FORMAT        45150000
UCFLAG1  DS    XL1                      INFORMATION FLAG #1             45200000
UCLEVEL  EQU   B'11000000'              LEVEL OF VOLUME (LO, L1)        45250000
         DS    CL1                      RESERVED                        45300000
UCTOTAL  DS    F                        TOTAL CAPACITY OF VOLUME IN    X45350000
                                        KILOBYTES                @03C   45400000
UCOCCUP  DS    CL7                                                      45450000
         ORG   DCUOUTH+40                                               45500000
UCTGOCC  DS    AL1                      SPECIFIED TARGET OCCUPANCY OF  X45550000
                                        VOLUME                          45600000
UCTROCC  DS    AL1                      SPECIFIED TRIGGER OCCUPANCY OF X45650000
                                        VOLUME                          45700000
UCBFOCC  DS    AL1                      OCCUPANCY OF VOLUME BEFORE     X45750000
                                        PROCESSING                      45800000
UCAFOCC  DS    AL1                      OCCUPANCY OF VOLUME AFTER      X45850000
                                        PROCESSING (0 IF NOT           X45900000
                                        PROCESSED)                      45950000
UCNOMIG  DS    AL1                      PERCENTAGE OF VOLUME DATA NOT  X46000000
                                        MIGRATED BUT ELIGIBLE TO       X46050000
                                        MIGRATE                         46100000
UCNINTV  DS    AL1                      # OF TIMES INTERVAL MIGRATION  X46150000
                                        WAS RUN AGAINST THE VOLUME      46200000
UCINTVM  DS    AL1                      # OF TIMES TARGET OCCUPANCY    X46250000
                                        WAS MET FOR THE VOLUME DURING  X46300000
                                        INTERVAL MIGRATION              46350000
UCCAPDE  DS    0C                       END OF DCCCAPD                  46400000
*********************************************************************** 46450000
*   DFHSM TAPE CAPACITY PLANNING RECORD (RECORD TYPE 'T')             * 46500000
*********************************************************************** 46550000
         ORG   DCUOUTH+24                                               46600000
UTCAPT   DS    0CL16                    TAPE CAPACITY PLANNING RECORD  X46650000
                                        (DEFINED ON DCUDATA)            46700000
UTSTYPE  DS    CL1                      TYPE OF TAPE CAPACITY PLANNING X46750000
                                        RECORD                          46800000
         DS    CL3                      RESERVED                        46850000
UTFULL   DS    F                        # OF FULL TAPE VOLUMES          46900000
UTPART   DS    F                        # OF PARTIAL FULL VOLS          46950000
UTEMPTY  DS    F                        # OF EMPTY TAPE VOLUMES         47000000
UTCAPTE  DS    0C                       END OF DCTCAPT                  47050000
*********************************************************************** 47100000
*   CONSTANT DECLARE AREA                                             * 47150000
*********************************************************************** 47200000
UPIDNAME DC    C'ARCUTILP'              PARAMETER IDENTIFIER     @02A   47250000
UPVERNUM EQU   1                        CURRENT VERSION #               47300000
*********************************************************************** 47350000
*   VALUES FOR DCURCTYP - RECORD TYPE IN HEADER AREA                  * 47400000
*********************************************************************** 47450000
UKTMIGR  EQU   C'M'                     MIGRATE TYPE RECORD             47500000
UKTBACK  EQU   C'B'                     BACKUP TYPE RECORD              47550000
UKCDASD  EQU   C'C'                     DASD CAPACITY PLANNING RECORD   47600000
UKCTAPE  EQU   C'T'                     TAPE CAPACITY PLANNING RECORD   47650000
*********************************************************************** 47700000
*   VALUES FOR UMLEVEL AND UCVLTYP - MIGRATION VOLUME LEVEL           * 47750000
*********************************************************************** 47800000
* UKLEVL0        B'00......'            LEVEL 0 MIGRATION               47850000
* UKLEVL1        B'01......'            LEVEL 1 MIGRATION               47900000
* UKLEVL2        B'10......'            LEVEL 2 MIGRATION               47950000
*********************************************************************** 48000000
*   VALUES FOR UMDEVCL - DEVICE CLASS OF MIGRATION VOLUME             * 48050000
*********************************************************************** 48100000
UKDASDV  EQU   C'D'                     DASD VOLUME                     48150000
UKTAPEV  EQU   C'T'                     TAPE VOLUME                     48200000
*********************************************************************** 48250000
*   VALUES FOR UTSTYPE - TYPE OF TAPE CAPACITY PLANNING RECORD        * 48300000
*********************************************************************** 48350000
UKBKTAPE EQU   C'B'                     BACKUP TAPES                    48400000
UKDUTAPE EQU   C'D'                     DUMP TAPES                      48450000
UKMGTAPE EQU   C'M'                     MIGRATION TAPES                 48500000
*                                                                       48550000
         MEND                                                           48600000
*                                                                       48650000
* %U_ENDA: ;                                                            48700000
