*%GOTO TPEPROLOG;                                                       00010000
          MACRO                                                         00020000
          ATBDFTPE                                                      00030000
*%TPEPROLOG: ;                                                          00040000
*/*START OF SPECIFICATIONS ******************************************** 00050000
*                                                                       00100000
*01* MACRO NAME: ATBDFTPE                                               00150000
*                                                                       00200000
*01* DESCRIPTIVE NAME: APPC SDFM TP Profile Conversion Exit             00250000
*01*                   Parameter Control Block                          00300000
*02* ACRONYM: ATBDFTPE                                                  00350000
*                                                                       00400000
*01* DSECT NAME: ATBDFTPE                                               00450000
*                                                                       00500000
*01* COMPONENT: APPC Component (SCACB)                                  00550000
*                                                                       00600000
*01* EYE-CATCHER: ATBDFTPE                                              00650000
*02*   OFFSET: 0                                                        00700000
*02*   LENGTH: 8                                                        00750000
*                                                                       00800000
*/***PROPRIETARY_STATEMENT********************************************/ 00900000
*/*01* PROPRIETARY STATEMENT=                                        */ 00950000
*/***PROPRIETARY_STATEMENT********************************************/ 00975000
*/*                                                                  */ 01000000
*/*                                                                  */ 01050000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01100000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01150000
*/* 5695-047 (C) COPYRIGHT IBM CORP. 1991, 1992                      */ 01200000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 01250000
*/*                                                                  */ 01300000
*/* STATUS= HBB4430                                                  */ 01350000
*/*                                                                  */ 01400000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01450000
*/********************************************************************* 01500000
*                                                                       01550000
*01* FUNCTION:                                                          01600000
*                                                                       01650000
*    Mapping macro for the System Data File Manager TP Profile          01700000
*    Conversion Exit Parameters                                         01750000
*                                                                       01800000
*01* METHOD OF ACCESS:                                                  01850000
*                                                                       01900000
*02*   ASM: ATBDFTPE                                                    01916600
*                                                                       01933200
*      ATBDFTPE is accessed by a macro invocation of ATBDFTPE.          01949800
*      Addressability to the ATBDFTPE can be obtained via a             01966400
*      USING on ATBDFTPE.                                               01983000
*                                                                       02000000
*02*   PLAS: %INCLUDE SYSLIB(ATBDFTPE)                                  02050000
*                                                                       02100000
*      ATBDFTPE is accessed by a %include statement for ATBDFTPE. A     02150000
*      preprocessor variable ATBDFTPESTORAGE may be set before the      02200000
*      %include to override the default storage class.                  02250000
*                                                                       02300000
*01* POINTED TO BY: Dynamically within ATBSD0G                          02350000
*                                                                       02400000
*01* CREATED BY: ATBSD0G                                                02450000
*                                                                       02500000
*01* DELETED BY: ATBSD0G                                                02550000
*                                                                       02600000
*01* STORAGE ATTRIBUTES:                                                02650000
*02*  SUBPOOL  : 230                                                    02700000
*02*  KEY      : 1                                                      02750000
*02*  RESIDENCY: Above or Below the 16M Line                            02800000
*                                                                       02850000
*01* SIZE: Refer to Listing of ATBSD0G module.                          02900000
*                                                                       02950000
*01* FREQUENCY: Once per FMH5 invocation.                               03000000
*                                                                       03050000
*01* SERIALIZATION: None                                                03100000
*                                                                       03150000
*01* DEPENDENCIES: None                                                 03200000
*                                                                       03250000
*01* NOTES: None                                                        03300000
*                                                                       03350000
*01* CHANGE-ACTIVITY:                                                   03400000
*                                                                       03450000
*    Flag LineItem  FMID    DATE   ID   Comment                         03500000
*                                                                       03550000
*     $L0=APPC1DF  JBB4422 900928 PDD8: Advanced Program-to-Program     03600000
*         Communication for MVS/ESA, System Data File Manager           03650000
*         Conversion Exit support.                                      03700000
*                                                                       03712500
*     $P1=APPC1DF  JBB4422 910329 PDD8: Corrected spelling of           03725000
*         ATBDFTPE_FUNCTION_REQUESTED.                                  03737500
*                                                                       03740600
*     $P2=PKB0907  HBB4430 920429 PDI8: Removed * from column 72        03743700
*         of START OF SPECIFICATIONS.                                   03746800
*                                                                       03750000
*     $P3=PKB0148  HBB4430 920617 PDG9: Corrected comment on            03761000
*         reserved storage                                              03772000
*                                                                       03783200
*END OF SPECIFICATIONS ***********************************************/ 03800000
*                                                               @SPACE; 03850000
*%GOTO TPEPLASKEY;                                                      03900000
*                                                               @SPACE; 03950000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 04000000
* /*                                                                 */ 04050000
* /* This is the ATBDFTPE mapping macro.                             */ 04100000
* /* Addressability to the ATBDFTPE can be obtained via a            */ 04150000
* /* USING on ATBDFTPE.                                              */ 04200000
* /*                                                                 */ 04250000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 04300000
*                                                                       04350000
ATBDFTPE                      DSECT       SDFM TP Profile Conversion    04400000
*                                         Exit Parameter List           04450000
                              DS 0D       Align on double word boundary 04500000
DFTPE_ID                      DS CL8      Identifier                    04550000
DFTPE_VERSION                 DS CL2      Version Number                04600000
DFTPE_LENGTH                  DS H        Length of ATBDFTPE            04650000
DFTPE_PARAMETERS              DS CL8      Parameters from IDENTIFY verb 04700000
DFTPE_TP_PROFILE_KEY_POINTER  DS F        Pointer to TP Profile Key     04750000
DFTPE_TP_PROFILE_POINTER      DS F        Pointer to TP Profile         04800000
DFTPE_CONV_DATA_POINTER       DS F        Pointer to Converted Data     04850000
DFTPE_CONV_DATA_LENGTH        DS F        Length of Converted Data      04900000
DFTPE_FUNCTION_REQUESTED      DS F        Function requested of the     04950000
*                                         Conversion Exit          @P1C 05000000
                              DS CL16     Reserved                      05050000
*                                                                       05100000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 05150000
* /*                                                                 */ 05200000
* /* These constants are used with the ATBDFTPE Mapping Macro        */ 05250000
* /*                                                                 */ 05300000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 05350000
*                                                               @SPACE; 05400000
ATBDFTPE_EYE_CATCHER          DC CL8'ATBDFTPE'                          05450000
ATBDFTPE_CURRENT_VERSION      DC CL2'01'                                05500000
DFTPE_CONVERT_TP              DC F'1'                                   05550000
*                                                                       05600000
DFTPE_OKAY                    DC F'0'    Converted and cached           05650000
DFTPE_SYNTAX_ERROR            DC F'20'   Conversion failed, not cached  05700000
DFTPE_SEVERE_ERROR            DC F'36'                                  05750000
DFTPE_NOT_CONVERTED           DC F'54'   Not converted, unconverted     05800000
*                                        TP Profile is cached           05850000
*                                                                       05900000
          MEND                                                          05950000
*                                                                       06000000
*%TPEPLASKEY: ;                                                         06050000
*                                                                       06100000
*  %IF ATBDFTPESTORAGE='' %THEN                                         06150000
*     %ATBDFTPESTORAGE=' ';                                             06200000
*                                                               @SPACE; 06250000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 06300000
* /*                                                                 */ 06350000
* /* This is the ATBDFTPE mapping macro. It can be automatically     */ 06400000
* /* based by seting the ATBDFTPESTORAGE preprocessor variable.      */ 06450000
* /*                                                                 */ 06500000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 06550000
*                                                               @SPACE; 06600000
*  DCL                                                                  06650000
*    1 ATBDFTPE ATBDFTPESTORAGE,       /* SDFM TP Profile Conversion    06700000
*                                         Exit Parameter List        */ 06750000
*      2  Dftpe_ID                 char(8),   /* Identifier=ATBDFTPE */ 06800000
*      2  Dftpe_Version            char(2),    /* Version number     */ 06850000
*      2  Dftpe_Length             fixed(16),  /* Length of ATBDFTPE */ 06900000
*                                                               @SPACE; 06950000
*      2  Dftpe_Parameters         char(8),   /* Parms from IDENTIFY */ 07000000
*      2  Dftpe_TP_Profile_Key_Pointer pointer(31), /* Input key     */ 07050000
*      2  Dftpe_TP_Profile_Pointer pointer(31), /* Pointer to data   */ 07100000
*      2  Dftpe_Conv_Data_Pointer  pointer(31), /* Pointer to converted 07150000
*                                                  TP Profile        */ 07200000
*      2  Dftpe_Conv_Data_Length   fixed(31),   /* Length of converted  07250000
*                                                  TP Profile        */ 07300000
*      2  Dftpe_Function_Requested fixed(31),   /* Function requested   07350000
*                                                  of conv. exit     */ 07400000
*                                                               @SPACE; 07450000
*      2  *                        char(16);    /* Reserved - Unused    07483300
*                                                                @P3C*/ 07516600
*                                                               @SPACE; 07550000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 07600000
* /*                                                                 */ 07650000
* /* These constants are used with the ATBDFTPE Mapping Macro        */ 07700000
* /*                                                                 */ 07750000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 07800000
*                                                               @SPACE; 07850000
*  DCL ATBDFTPE_eye_catcher     char(8)    constant('ATBDFTPE'),        07900000
*      ATBDFTPE_current_version char(2)    constant('01'),              07950000
*      Dftpe_convert_tp         fixed(32)  constant( 1),                08000000
*      Dftpe_okay               fixed(32)  constant( 0),                08050000
*      Dftpe_syntax_error       fixed(32)  constant(20),                08100000
*      Dftpe_severe_error       fixed(32)  constant(36),                08150000
*      Dftpe_not_converted      fixed(32)  constant(54);                08200000
