* %GOTO PLAS_ATBEXCOS;                                                  00050000
         MACRO                                                          00100000
         ATBEXCOS                                                       00150000
*/*START OF SPECIFICATIONS *******************************************  00200000
*                                                                       00250000
*01* MACRO NAME: ATBEXCOS                                               00300000
*01* DESCRIPTIVE NAME: APPC Extract Specific Conversation Information   00350000
*                      Control Block Mapping                            00400000
*                                                                       00450000
*01* DSECT NAME:  ATBEXCOS                                              00500000
*                                                                       00550000
*01* COMPONENT:  APPC Component (SCACB)                                 00600000
*                                                                       00650000
*01* EYE-CATCHER: None                                                  00700000
*                                                                       00750000
**********************************************************************/ 00800000
*/***PROPRIETARY_STATEMENT********************************************/ 00850000
*/*01* PROPRIETARY STATEMENT=                                        */ 00900000
*/*                                                                  */ 00950000
*/*                                                                  */ 01000000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01050000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01100000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1990, 1997                      */ 01150000
*/*                                                                  */ 01250000
*/* STATUS= HBB6603                                                  */ 01266600
*/*                                                                  */ 01283200
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 01299800
*/*                                                                  */ 01316400
*/* END OF EXTERNAL CLASSIFICATION                                   */ 01333200
*/*                                                                  */ 01350000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01400000
*/********************************************************************* 01450000
*                                                                       01500000
*01* FUNCTION:                                                          01550000
*                                                                       01600000
*    ATBEXCOS is used to map the information returned in the            01650000
*    buffer area passed by ATBEXAI when ATBEXAI is called with an       01700000
*    Extract_Code of '0001'X.                                           01750000
*                                                                       01800000
*01* METHOD OF ACCESS:                                                  01850000
*                                                                       01900000
*02*   ASM:                                                             01950000
*                                                                       02000000
*        Addressability to the ATBEXCOS can be established via a        02050000
*        USING on ATBEXCOS.                                             02100000
*                                                                       02150000
*        Invocation syntax:                                             02200000
*          ATBEXCOS                     Include ATBEXCOS mapping        02250000
*           :   :                                                       02300000
*          USING   ATBEXCOS,Rn          Establishes addressability      02350000
*                                                                       02400000
*02*   PLAS:                                                            02450000
*                                                                       02500000
*        %ATBEXCOSBASE is a Macro variable which may be used            02550000
*        to establish the attributes for the ATBEXCOS declaration.      02600000
*        If not specified, 'BASED(excosptr)' default is                 02650000
*        declared by this MACRO.                                        02700000
*                                                                       02750000
*        Invocation syntax:                                             02800000
*          %ATBEXCOSBASE = <optional base, default is BASED(Excosptr)>  02850000
*          %INCLUDE SYSLIB (ATBEXCOS)                                   02900000
*                                                                       02950000
*01* POINTED TO BY:                                                     03000000
*                                                                       03050000
*02*   Local pointer                                                    03100000
*                                                                       03150000
*01* CREATED BY:                                                        03200000
*                                                                       03250000
*02*   Any caller of ATBEXAI                                            03300000
*                                                                       03350000
*01* DELETED BY: Creator                                                03400000
*                                                                       03450000
*01* STORAGE ATTRIBUTES:                                                03500000
*                                                                       03550000
*02*   ALLOCATION-METHOD: Determined by caller                          03600000
*                                                                       03650000
*02*   SUBPOOL/DATASPACE: Determined by caller                          03700000
*                                                                       03750000
*02*   KEY:       Determined by caller                                  03800000
*                                                                       03850000
*02*   RESIDENCY: Determined by caller                                  03900000
*                                                                       03950000
*02*   VIRTUAL:   Determined by caller                                  04000000
*                                                                       04050000
*01* SIZE:  See Assembler listing                                       04066600
*                                                                       04083200
*01* FREQUENCY: 1 per caller                                            04100000
*                                                                       04150000
*01* SERIALIZATION: None                                                04200000
*                                                                       04250000
*01* DEPENDENCIES: None                                                 04300000
*                                                                       04350000
*01* NOTES: None                                                        04400000
*                                                                       04450000
*01* CHANGE-ACTIVITY:                                                   04500000
*                                                                       04550000
*      Flag LineItem  FMID    DATE   ID   Comment                       04600000
*                                                                       04650000
*       $L0=APPCSVS  HBB4430 920108 PDG9: Advanced Program-to_Program   04700000
*         Communication for MVS/ESA, Specfic Conversation Information   04750000
*                                                                       04762500
*       $D1=DKB0049  HBB4430 920318 PDE4: Increase user data field      04775000
*         to 255 bytes                                                  04787500
*                                                                       04800000
*       $D2=DKB0068   HBB4430 920429 PDG9: Advanced Program-to_Program  04810000
*         Communication for MVS/ESA, Server Facilities                  04820000
*         Remove extra field                                            04823300
*                                                                       04826600
*       $D3=DKB0069   HBB4430 920729 PDG9: Advanced Program-to_Program  04829900
*         Communication for MVS/ESA, Server Facilities                  04833200
*         Clarify description of ATBEXCOS_LAST_SERVICE_REASON_CODE      04836500
*                                                                       04837200
*       $P1=PQC1680   HBB6603 960830 PDC9: Add Unit of Recovery Id      04837900
*         which is only valid for conversations with Sync Level of      04838600
*         Syncpt (protected conversations).                             04839300
*                                                                       04840000
*END OF SPECIFICATIONS ***********************************************/ 04850000
         EJECT                                                          04900000
**********************************************************************  04950000
*                                                                    *  05000000
*  ATBEXCOS - Extract Specific Conversation Information Control      *  05050000
*             Block Mapping                                          *  05100000
*                                                                    *  05150000
**********************************************************************  05200000
         SPACE                                                          05250000
ATBEXCOS DSECT                     Extract Specific Conversation        05300000
*                                  Information Control Block            05350000
                         DS  0D    Align on doubleword boundary         05400000
EXCOS_CONV_ID            DS  CL8   Conversation ID                      05450000
EXCOS_INOUT              DS  F     Inbound/Outbound indicator:          05500000
*                                       0 -> outbound, 1 -> inbound     05550000
EXCOS_PLU_LOCATION       DS  F     Partner LU location                  05600000
*                                      1 -> remote, 2 -> local          05650000
EXCOS_CONV_KIND          DS  F     How the conversation was processed   05700000
*                                       0 -> others, 1 -> served TP     05750000
EXCOS_LUWID              DS  CL26  Logical unit of work ID              05800000
EXCOS_CONV_CORRELATOR    DS  CL8   Conversation Correlator              05850000
EXCOS_CONV_USERID        DS  CL10  Conversation userid: sent            05900000
*                                    or received in the attach          05950000
*                                    request (FMH-5) which created      06000000
*                                    this conversation                  06050000
EXCOS_SCHED_NAME         DS  CL8   Scheduler Name                       06100000
EXCOS_TP_NAME_LENGTH     DS  F     Length of TP Name sent               06150000
*                                    or received in the attach          06200000
*                                    request (FMH-5) which created      06250000
*                                    this conversation                  06300000
EXCOS_TP_NAME            DS  CL64  Transaction Program Name sent        06350000
*                                    or received in the attach          06400000
*                                    request (FMH-5) which created      06450000
*                                    this conversation                  06500000
EXCOS_LOCAL_TP_NAME_LENGTH DS F    Local TP Name Length                 06550000
EXCOS_LOCAL_TP_NAME      DS  CL64  Local TP Name                        06600000
EXCOS_LU_NAME            DS  CL8   Logical Unit Name                    06750000
EXCOS_PLU_NAME           DS  CL17  Fully qualified Partner LU name      06800000
                         DS  CL3   Reserved                             06850000
EXCOS_ARRIVAL_TIME       DS  CL8   Date and time this ALLOCATE          06900000
*                                     request was obtained from VTAM    06950000
*                                     or from a local LU                07000000
*                                     by APPC/MVS.  This field          07050000
*                                     contains the date and time in     07100000
*                                     the format provided by the STORE  07150000
*                                     CLOCK (STCK) assembler            07200000
*                                     instruction.  This field is set   07250000
*                                     to zero for outbound requests.    07300000
EXCOS_CONV_AVAILABLE_TIME DS CL8   Date and time this conversation was  07350000
*                                     placed on the allocate queue. The 07400000
*                                     content of this field has meaning 07450000
*                                     only when Excos_Conv_Kind         07500000
*                                     indicates that this is a served   07550000
*                                     TP.                               07600000
EXCOS_CONV_START_TIME    DS CL8    For outbound conversations this is   07650000
*                                     the date and time the allocate    07700000
*                                     was issued.  For inbound          07750000
*                                     conversations, if the TP is not   07800000
*                                     served, this is the time the      07850000
*                                     first verb was issued.            07900000
*                                     For inbound, served TPs, this is  07950000
*                                     the time RECEIVE_ALLOCATE was     08000000
*                                     issued.                           08050000
EXCOS_END_TIME           DS  CL8   Date and time this conversation      08100000
*                                     was deallocated. This field       08150000
*                                     contains the date and time in the 08200000
*                                     format provided by the STORE      08237500
*                                     CLOCK (STCK) assembler            08275000
*                                     instruction.                      08312500
EXCOS_MODE_NAME          DS  CL8   Conversation mode name               08350000
EXCOS_SYNC_LEVEL         DS  F     Conversation synchronization level   08400000
EXCOS_TOTAL_SENDS        DS  F     Total number of Sends issued by      08450000
*                                      the local transaction program    08500000
*                                      on this conversation             08550000
EXCOS_TOTAL_SEND_AMT     DS  CL8   Total amount of data sent, in        08600000
*                                     bytes. Value is returned as       08650000
*                                     a Long Floating Point Number in   08700000
*                                     the form: 'eehhhhhhhhhhhhhh',     08750000
*                                     where ee is the characteristic    08800000
*                                     (00 <= ee <= 7F), and where       08850000
*                                     hhhhhhhhhhhhhh is the 14-digit    08900000
*                                     hexadicimal fraction part.        08950000
EXCOS_TOTAL_RECEIVES     DS  F     Total number of Receives             09000000
EXCOS_TOTAL_RECEIVE_AMT  DS  CL8   Total amount of data received,       09050000
*                                     in bytes. Value is returned as    09100000
*                                     a Long Floating Point Number in   09150000
*                                     the form: 'eehhhhhhhhhhhhhh',     09200000
*                                     where ee is the characteristic    09250000
*                                     (00 <= ee <= 7F), and where       09300000
*                                     hhhhhhhhhhhhhh is the 14-digit    09350000
*                                     hexadicimal fraction part.        09400000
EXCOS_TOTAL_CALLABLE_SERVICE DS F  Total number of                      09450000
*                                     callable service requests         09500000
*                                     issued by the local transaction   09550000
*                                     program for this conversation     09600000
EXCOS_LAST_SERVICE_RETURN_CODE DS F Return code from last requested     09650000
*                                     callable service                  09700000
EXCOS_LAST_SERVICE_REASON_CODE DS F Reason code from last callable      09730000
*                                   service requested on this           09760000
*                                   conversation which returned         09790000
*                                   product_specific_error         @D3C 09820000
EXCOS_CONVERSATION_STATE DS  F      Current State of Conversation       09850000
EXCOS_LAST_SERVICE_START_TIME DS CL8 Date and time of start of last     09900000
*                                     requested service in STCK format  09950000
EXCOS_LAST_SERVICE_END_TIME DS CL8  Date and time of end of last        10000000
*                                     requested service in STCK format  10050000
EXCOS_LENGTH_OF_USER_DATA DS F      Length of Excos_User_Data field     10100000
EXCOS_USER_DATA          DS  CL255  User field - This field is set @D1C 10150000
*                                     from user input provided via      10200000
*                               SET_CONVERSATION_ACCOUNTING_INFORMATION 10250000
EXCOS_URID               DS CL16    Unit of Recovery Identifier for     10266600
*                                   protected conversations        @P1A 10283200
ATBEXCOS_LEN             EQU *-ATBEXCOS  Length of ATBEXCOS control     10300000
*                                   block                               10350000
         MEND                                                           10400000
**********************************************************************  10450000
*                                                                    *  10500000
*    End of Assembler mapping                                        *  10550000
*                                                                    *  10600000
**********************************************************************  10650000
*%PLAS_ATBEXCOS: ;                                                      10700000
*/*START OF SPECIFICATIONS *******************************************  10800000
*                                                                       10850000
*01* MACRO NAME: ATBEXCOS                                               10900000
*01* DESCRIPTIVE NAME: APPC Extract Specific Conversation Information   10950000
*                      Control Block Mapping                            11000000
*                                                                       11050000
*01* DSECT NAME:  ATBEXCOS                                              11100000
*                                                                       11150000
*01* COMPONENT:  APPC Component (SCACB)                                 11200000
*                                                                       11250000
*01* EYE-CATCHER: None                                                  11300000
*                                                                       11350000
**********************************************************************/ 11400000
*/***PROPRIETARY_STATEMENT********************************************/ 11450000
*/*01* PROPRIETARY STATEMENT=                                        */ 11500000
*/*                                                                  */ 11550000
*/*                                                                  */ 11600000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 11650000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 11700000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1990, 1997                      */ 11750000
*/*                                                                  */ 11850000
*/* STATUS= HBB6603                                                  */ 11866600
*/*                                                                  */ 11883200
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 11899800
*/*                                                                  */ 11916400
*/* END EXTERNAL CLASSIFICATION                                      */ 11933000
*/*                                                                  */ 11950000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 12000000
*/********************************************************************* 12050000
*                                                                       12100000
*01* FUNCTION:                                                          12150000
*                                                                       12200000
*    ATBEXCOS is used to map the information returned in the            12250000
*    buffer area passed by ATBEXAI when ATBEXAI is called with an       12300000
*    Extract_Code of '0001'X.                                           12350000
*                                                                       12400000
*01* METHOD OF ACCESS:                                                  12450000
*                                                                       12500000
*02*   ASM:                                                             12550000
*                                                                       12600000
*        Addressability to the ATBEXCOS can be established via a        12650000
*        USING on ATBEXCOS.                                             12700000
*                                                                       12750000
*        Invocation syntax:                                             12800000
*          ATBEXCOS                     Include ATBEXCOS mapping        12850000
*           :   :                                                       12900000
*          USING   ATBEXCOS,Rn          Establishes addressability      12950000
*                                                                       13000000
*02*   PLAS:                                                            13050000
*                                                                       13100000
*        %ATBEXCOSBASE is a Macro variable which may be used            13150000
*        to establish the attributes for the ATBEXCOS declaration.      13200000
*        If not specified, 'BASED(Excosptr)' default is                 13250000
*        declared by this MACRO.                                        13300000
*                                                                       13350000
*        Invocation syntax:                                             13400000
*          %ATBEXCOSBASE = <optional base, default is BASED(Excosptr)>  13450000
*          %INCLUDE SYSLIB (ATBEXCOS)                                   13500000
*                                                                       13550000
*01* POINTED TO BY:                                                     13600000
*                                                                       13650000
*02*   Local pointer                                                    13700000
*                                                                       13750000
*01* CREATED BY:                                                        13800000
*                                                                       13850000
*02*   Any caller of ATBEXAI                                            13900000
*                                                                       13950000
*01* DELETED BY: Creator                                                14000000
*                                                                       14050000
*01* STORAGE ATTRIBUTES:                                                14100000
*                                                                       14150000
*02*   ALLOCATION-METHOD: Determined by caller                          14200000
*                                                                       14250000
*02*   SUBPOOL/DATASPACE: Determined by caller                          14300000
*                                                                       14350000
*02*   KEY:       Determined by caller                                  14400000
*                                                                       14450000
*02*   RESIDENCY: Determined by caller                                  14500000
*                                                                       14550000
*02*   VIRTUAL:   Determined by caller                                  14600000
*                                                                       14650000
*01* FREQUENCY: 1 per caller                                            14700000
*                                                                       14750000
*01* SERIALIZATION: None                                                14800000
*                                                                       14850000
*01* DEPENDENCIES: None                                                 14900000
*                                                                       14950000
*01* NOTES: None                                                        15000000
*                                                                       15050000
*01* CHANGE-ACTIVITY:                                                   15100000
*                                                                       15150000
*      Flag LineItem  FMID    DATE   ID   Comment                       15200000
*                                                                       15250000
*       $L0=APPCSVS  HBB4430 920108 PDG9: Advanced Program-to_Program   15300000
*         Communication for MVS/ESA, Specfic Conversation Information   15350000
*                                                                       15400000
*       $D1=DKB0049  HBB4430 920318 PDE4: Increase user data field      15406200
*         to 255 bytes                                                  15412400
*                                                                       15418600
*       $D2=DKB0068   HBB4430 920429 PDG9: Advanced Program-to_Program  15424800
*         Communication for MVS/ESA, Server Facilities                  15431000
*         Remove extra field                                            15433000
*                                                                       15435000
*       $D3=DKB0069   HBB4430 920729 PDG9: Advanced Program-to_Program  15437000
*         Communication for MVS/ESA, Server Facilities                  15439000
*         Clarify description of ATBEXCOS_LAST_SERVICE_REASON_CODE      15441000
*                                                                       15441400
*       $P1=PQC1680   HBB6603 960830 PDC9: Add Unit of Recovery Id      15441800
*         which is only valid for conversations with Sync Level of      15442200
*         Syncpt (protected conversations).                             15442600
*                                                                       15443400
*END OF SPECIFICATIONS ***********************************************/ 15450000
 %IF ATBEXCOSBASE='' %THEN         /* Any basing expression?         */ 15600000
    %ATBEXCOSBASE='BASED(Excosptr)'; /* No, so use the default       */ 15650000
 %ELSE                                                                  15700000
    %GOTO PLAS_SKIP_EXCOSPTR_DCL;  /* Skip DCL for default ptr       */ 15750000
                                                                        15800000
  DECLARE                                                               15850000
    Excosptr PTR(31);              /* Default basing ptr for Atbexcos*/ 15900000
                                                                        15950000
 %PLAS_SKIP_EXCOSPTR_DCL: ;                                             16000000
                                                                        16050000
 DECLARE                                                                16100000
   1 Atbexcos ATBEXCOSBASE,        /* Extract Specific Conversation     16150000
                                      Information Control Block      */ 16200000
     3 Excos_Conv_ID     CHAR(8),  /* Conversation ID                */ 16250000
     3 Excos_InOut       FIXED(32), /* Inbound/Outbound indicator:      16300000
                                       0 -> outbound, 1 -> inbound   */ 16350000
     3 Excos_PLU_Location FIXED(32), /* Partner LU location             16400000
                                       1 -> remote, 2 -> local       */ 16450000
     3 Excos_Conv_Kind    FIXED(32), /* How the conversation was        16500000
                                       processed                        16550000
                                       0 -> others, 1 -> served TP   */ 16600000
     3 Excos_Luwid       CHAR(26), /* Logical unit of work ID        */ 16650000
     3 Excos_Conv_Correlator CHAR(8), /* Conversation Correlator     */ 16700000
     3 Excos_Conv_Userid CHAR(10), /* Conversation userid: sent         16750000
                                      or received in the attach         16800000
                                      request (FMH-5)                   16850000
                                      which created this                16900000
                                      conversation                   */ 16950000
     3 Excos_Sched_Name  CHAR(8),  /* Scheduler Name                 */ 17000000
     3 Excos_TP_Name_Length FIXED(32), /* Length of TP Name sent        17050000
                                      or received in the attach         17100000
                                      request (FMH-5)                   17150000
                                      which created this                17200000
                                      conversation                   */ 17250000
     3 Excos_TP_Name     CHAR(64), /* Transaction Program Name sent     17300000
                                      or received in the attach         17350000
                                      request (FMH-5)                   17400000
                                      which created this                17450000
                                      conversation                   */ 17500000
     3 Excos_Local_TP_Name_Length FIXED(32), /* Local TP Name Length */ 17650000
     3 Excos_Local_TP_Name     CHAR(64), /* Local TP Name            */ 17700000
     3 Excos_LU_Name     CHAR(8),  /* Logical Unit Name              */ 17750000
     3 Excos_PLU_Name    CHAR(17), /* Fully qualified Partner LU name*/ 17800000
     3 *                 CHAR(3),  /* Reserved                       */ 17850000
     3 Excos_Arrival_Time CHAR(8), /* Date and time this ALLOCATE       17900000
                                      request was obtained from VTAM    17950000
                                      or from a local LU                18000000
                                      by APPC/MVS.  This field          18050000
                                      contains the date and time in     18100000
                                      the format provided by the STORE  18150000
                                      CLOCK (STCK) assembler            18200000
                                      instruction.  This field is set   18250000
                                      to zero for outbound requests  */ 18300000
     3 Excos_Conv_Available_Time CHAR(8), /* Date and time this         18350000
                                      conversation was placed on the    18400000
                                      allocate queue.  The content of   18450000
                                      this field has meaning only when  18500000
                                      Excos_Conv_Kind indicates that    18550000
                                      this is a served conversation. */ 18600000
     3 Excos_Conv_Start_Time CHAR(8), /* For outbound conversations this18650000
                                      is the date and time the allocate 18700000
                                      was issued.  For inbound          18750000
                                      conversations, if the TP is not   18800000
                                      served, this is the time the first18850000
                                      verb was issued.  For inbound,    18900000
                                      served TPs, this is the time      18950000
                                      RECEIVE_ALLOCATE was issued.   */ 19000000
     3 Excos_End_Time CHAR(8),     /* Date and time this conversation   19050000
                                      was deallocated. This field       19100000
                                      contains the date and time in the 19150000
                                      format provided by the STORE CLOCK19200000
                                      (STCK) assembler instruction.  */ 19250000
     3 Excos_Mode_Name   CHAR(8),  /* Conversation mode name         */ 19300000
     3 Excos_Sync_Level FIXED(32), /* Conversation synchronization      19350000
                                      level                          */ 19400000
     3 Excos_Total_Sends FIXED(32), /* Total number of Sends issued by  19450000
                                      the local transaction program     19500000
                                      on this conversation           */ 19550000
     3 Excos_Total_Send_Amt CHAR(8),/* Total amount of data sent, in    19600000
                                      bytes. Value is returned as       19650000
                                      a Long Floating Point Number in   19700000
                                      the form: 'eehhhhhhhhhhhhhh',     19750000
                                      where ee is the characteristic    19800000
                                      (00 <= ee <= 7F), and where       19850000
                                      hhhhhhhhhhhhhh is the 14-digit    19900000
                                      hexadicimal fraction part.     */ 19950000
     3 Excos_Total_Receives FIXED(32), /* Total number of Receives   */ 20000000
     3 Excos_Total_Receive_Amt CHAR(8),/* Total amount of data received 20050000
                                      in bytes. Value is returned as    20100000
                                      a Long Floating Point Number in   20150000
                                      the form: 'eehhhhhhhhhhhhhh',     20200000
                                      where ee is the characteristic    20250000
                                      (00 <= ee <= 7F), and where       20300000
                                      hhhhhhhhhhhhhh is the 14-digit    20350000
                                      hexadicimal fraction part.     */ 20400000
     3 Excos_Total_Callable_Service FIXED(32), /* Total number of       20450000
                                      callable service requests         20500000
                                      issued by the local transaction   20550000
                                      program for this conversation  */ 20600000
     3 Excos_Last_Service_Return_Code FIXED(32), /* Return code from    20650000
                                      last requested callable service*/ 20700000
     3 Excos_Last_Service_Reason_Code FIXED(32), /* Reason code from    20750000
                                      last callable service requested   20770000
                                      on this conversation which        20790000
                                      returned product_specific_error   20810000
                                                                 @D3C*/ 20830000
     3 Excos_Conversation_State  FIXED(31), /* Current                  20850000
                                      State of Conversation          */ 20900000
     3 Excos_Last_Service_Start_Time CHAR(8), /* Date and time of start 20950000
                                      of last requested service in STCK 21000000
                                      format                         */ 21050000
     3 Excos_Last_Service_End_Time CHAR(8), /* Date and time of end of  21100000
                                      last requested service in STCK    21150000
                                      format                         */ 21200000
     3 Excos_Length_Of_User_Data FIXED(32), /* Length of                21250000
                                      Excos_User_Data                */ 21300000
     3 Excos_User_Data CHAR(255),  /* User field - This field is set    21350000
                                      from user input provided via      21400000
                              SET_CONVERSATION_ACCOUNTING_INFORMATION   21433300
                                                                @D1C */ 21466600
     3 Excos_URID CHAR(16);        /* Unit of Recovery Identifier for   21477700
                                      protected conversations    @P1A*/ 21488800
                                                                        21500000
 @SPACE;                                                                21550000
 /********************************************************************/ 21600000
 /*                                                                  */ 21650000
 /*   Length Constants                                               */ 21700000
 /*                                                                  */ 21750000
 /********************************************************************/ 21800000
                                                                        21850000
 DECLARE                                                                21900000
   atbexcos_len FIXED(31) CONSTANT(Length(Atbexcos)); /* Length of the  21950000
                                      ATBEXCOS control block         */ 22000000
                                                                        22050000
