*                                                                       00050000
* %DCL ATRTZRMD_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE ATRTZRMD_INCLUDED;                                        00150000
* %IF ATRTZRMD_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 97069. CBGEN compile date 96059         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         ATRTZRMD &DSECT=YES,&LIST=YES,&TITLE=YES,&ATRTZRMD=YES         00450000
         GBLC  &ATRTZRMD_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&ATRTZRMD_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'ATRTZRMD  - RRS RM Data Log Block                       '     00750000
.P5      ANOP                                                           00800000
**/ ATRTZRMD_1:;                                                        00850000
*/******* START OF SPECIFICATIONS ************************************/ 00900000
*/*                                                                  */ 00950000
*/*01* Macro Name: ATRTZRMD                                          */ 01000000
*/*                                                                  */ 01050000
*/*01* Descriptive Name: RRS RM Data Log Block                       */ 01100000
*/*                                                                  */ 01150000
*/*02*  Acronym: ATRTCRMD                                            */ 01200000
*/*                                                                  */ 01250000
*/*01* PROPRIETARY STATEMENT=                                        */ 01300000
*/*                                                                  */ 01350000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01400000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01450000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1997                            */ 01500000
*/*                                                                  */ 01550000
*/* STATUS= HBB6603                                                  */ 01600000
*/*                                                                  */ 01650000
*/*01* PROPRIETARY STATEMENT=                                        */ 01700000
*/*                                                                  */ 01750000
*/*01* EXTERNAL CLASSIFICATION: PSPI                                 */ 01800000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01850000
*/*                                                                  */ 01900000
*/*01* COMPONENT: Resource Recovery Services (SCRRS)                 */ 01950000
*/*                                                                  */ 02000000
*/*01* DSECT Name: ATRTZRMD                                          */ 02050000
*/*                                                                  */ 02100000
*/*01* Eye-Catcher: ATRTCRMD                                         */ 02150000
*/*02*  Offset: 0                                                    */ 02200000
*/*02*  Length: 8                                                    */ 02250000
*/*                                                                  */ 02300000
*/*01* Storage Attributes:                                           */ 02350000
*/*02*  Subpool: N/A                                                 */ 02400000
*/*02*  Key: N/A                                                     */ 02450000
*/*02*  Residency: N/A                                               */ 02500000
*/*                                                                  */ 02550000
*/*01* Size: 252 bytes                                               */ 02600000
*/*                                                                  */ 02650000
*/*01* Created by: N/A                                               */ 02700000
*/*                                                                  */ 02750000
*/*01* Pointed to by: N/A                                            */ 02800000
*/*                                                                  */ 02850000
*/*01* Serialization: N/A                                            */ 02900000
*/*                                                                  */ 02950000
*/*01* Function: This macro contains constants and declares for      */ 03000000
*/*              the RRS RM Data log block                           */ 03050000
*/*                                                                  */ 03100000
*/*01* Method of Access:                                             */ 03150000
*/*                                                                  */ 03200000
*/*02*  PL/X: %INCLUDE SYSLIB(ATRTZRMD)                              */ 03250000
*/*                                                                  */ 03300000
*/*           To add declaration options:                            */ 03350000
*/*                                                                  */ 03400000
*/*           %DCL ATRTZRMD_BASE CHAR EXT                            */ 03450000
*/*                                                                  */ 03500000
*/*           and set these to the desired options.                  */ 03550000
*/*                                                                  */ 03600000
*/*02*  ASM : ATRTZRMD                                               */ 03650000
*/*                                                                  */ 03700000
*/*           Options:                                               */ 03750000
*/*                                                                  */ 03800000
*/*           DSECT=YES|NO - Whether or not ATRTZRMD is generated    */ 03850000
*/*                          as a DSECT (YES) or a DS (NO)           */ 03900000
*/*                                                                  */ 03950000
*/*           ATRTZRMD=YES|NO - Whether or not the ATRTZRMD mapping  */ 04000000
*/*                             is generated                         */ 04050000
*/*                                                                  */ 04100000
*/*           LIST=YES|NO - Whether or not the macro expansion is    */ 04150000
*/*                         printed                                  */ 04200000
*/*                                                                  */ 04250000
*/*           TITLE=YES|NO - Whether or not the TITLE line is        */ 04300000
*/*                         printed                                  */ 04350000
*/*                                                                  */ 04400000
*/*01* Distribution Library: AMACLIB                                 */ 04450000
*/*                                                                  */ 04500000
*/*01* Change Activity:                                              */ 04550000
*/*                                                                  */ 04600000
*/*   PN  REASON   RLSE    DATE   ORG   COMMENTS                     */ 04650000
*/*   $P0=PQC2934  HBB6603 970310 B7HGEV:  Document the block        */ 04700000
*/*   $P1=PU700xx  HBB6603 970320 B7HGEJ:  RM Instance Number        */ 04750000
*/*                                        (TRSQ - OW26369, OW27324) */ 04800000
*/*   $P2=PUXxxxx  HBB6603 970601 ?DEM:    Align the log data to a   */ 04816600
*/*                                        doubleword boundary       */ 04833200
*/*                                                                  */ 04850000
*/** END OF SPECIFICATIONS *******************************************/ 04900000
*% /*                                                                   04950000
.P0      ANOP                                                           05000000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05050000
         AIF   ('&LIST' EQ 'YES').P2                                    05100000
.P1      ANOP                                                           05150000
         PUSH  PRINT                                                    05200000
         PRINT OFF                                                      05250000
.P2      ANOP                                                           05300000
         AIF   ('&ATRTZRMD' EQ 'NO').L0002                              05350000
         AIF   ('&DSECT' EQ 'YES').L0003                                05400000
         AIF   ('&ATRTZRMD' NE 'YES').L0002                             05450000
ATRTZRMD DS    0F                                                       05500000
         AGO   .L0004                                                   05550000
.L0003   ANOP                                                           05600000
ATRTZRMD DSECT                                                          05650000
.L0004   ANOP                                                           05700000
EYECATCHER DS  1CL0008   Control block eyecatcher                       05750000
VERSIONNUM DS  1FL4      Control block version                          05800000
ENTRYLENGTH DS 1FL4      Control block length                           05850000
EVENTID  DS    1FL2      Last event for this block                      05900000
FLAGS    DS    0BL2                                                     05950000
LOSSOFDATA EQU X'80'     ON means that log data may have been lost     *06000000
                         that could affect this resource manager. When *06050000
                         the resource manager restarts, it will be     *06100000
                         presented with a possible loss of data error.  06150000
DATAINRESTARTLOG EQU X'40' When the RqdRstSystem field is blank, ON    *06200000
                         means that the resource manager has entries   *06250000
                         in the restart log. OFF means that the        *06300000
                         resource manager does not have entries in the *06350000
                         restart log.                                   06400000
         ORG   FLAGS+X'00000002'                                        06450000
RM_NAME  DS    1CL0032   Resource Manager name                          06500000
RMLOGNAMELENGTH DS 1FL4  Resource Manager log name length               06550000
RMLOGNAME DS   1CL0064   Resource Manager log name                      06600000
RQDRSTSYSTEM DS 1CL0008  System where the resource manager is required *06650000
                         to restart with RRS. This field has no        *06700000
                         meaning for the RRS resource manager entry.    06750000
LASTACTSYSTEM DS 1CL0008 System where the resource manager was last    *06800000
                         active with RRS. This field has no meaning    *06850000
                         for the RRS resource manager entry.            06900000
LOGGINGSYSTEM DS 1CL0008 System which wrote the log entry               06950000
*                                                                       07000000
*      ***************************************************************  07050000
*      *                                                             *  07100000
*      * The log stream versions are valid only for the RRS resource *  07150000
*      * manager log entry                                           *  07200000
*      *                                                             *  07250000
*      ***************************************************************  07300000
*                                                                       07350000
*                                                                       07400000
RMD_MAINURLOGSTREAMVERSION DS 1CL0008 Main UR log stream version token  07450000
RMD_DELAYEDURLOGSTREAMVERSION DS 1CL0008 Delayed UR log stream version *07500000
                         token                                          07550000
RMD_RESTARTLOGSTREAMVERSION DS 1CL0008 Restart log stream version      *07600000
                         token                                          07650000
RMD_LOG_INSTANCE_NUMBER DS 1CL0008 RM Instance Number used to          *07700000
                         differentiate log entries in the UR state logs*07750000
                         that completed, logically deleted, but have   *07800000
                         yet to be compressed out of the logs.     @P1A 07850000
         ORG   ATRTZRMD+X'000000FC'                                     07900000
ATRTZRMD_LEN EQU *-ATRTZRMD                                             07950000
.L0002   ANOP                                                           08000000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08050000
         AIF   ('&LIST' EQ 'YES').P4                                    08100000
.P3      ANOP                                                           08150000
         POP   PRINT                                                    08200000
.P4      ANOP                                                           08250000
.P_EXIT  ANOP                                                           08300000
         MEND                                                           08350000
**/ ATRTZRMD_2:;                                                        08400000
* %ATRTZRMD_INCLUDED = 'YES';                                           08450000
* %DCL ZCBPRINT CHAR EXT;                                               08500000
* %DEACTIVATE ZCBPRINT;                                                 08550000
* %DCL ATRTZRMD_LIST CHAR EXT;                                          08600000
* %DEACTIVATE ATRTZRMD_LIST;                                            08650000
* %IF ATRTZRMD_LIST ^= 'NO' &                                           08700000
*    ZCBPRINT ^= 'NO' %THEN                                             08750000
*   %GOTO ATRTZRMD_3;                                                   08800000
*   @LIST PUSH NOECHO;                                                  08850000
*   @LIST NOASSEMBLE NOECHO;                                            08900000
*   @LIST OFF C NOECHO;                                                 08950000
* %ATRTZRMD_3:;                                                         09000000
*/* Start of PL/X Source                                             */ 09050000
*%dcl atrtzrmd_base char ext;                                           09100000
*Dcl 1 ATRTZRMD Bdy(Word) atrtzrmd_base,                         ! @P2C 09150000
*      3 EyeCatcher  Char(8),   /* Control block eyecatcher          */ 09200000
*      3 VersionNum  Fixed(31), /* Control block version             */ 09250000
*      3 EntryLength Fixed(31), /* Control block length              */ 09300000
*      3 EventID     Fixed(16), /* Last event for this block         */ 09350000
*      3 Flags       bit(16),                                           09400000
*        5 LossOfData       bit(1), /* ON means that log data may have  09450000
*                                      been lost that could affect this 09500000
*                                      resource manager.                09550000
*                                      When the resource manager        09600000
*                                      restarts, it will be presented   09650000
*                                      with a possible loss of data     09700000
*                                      error.                        */ 09750000
*        5 DataInRestartLog bit(1), /* When the RqdRstSystem field      09800000
*                                      is blank, ON means that          09850000
*                                      the resource manager has entries 09900000
*                                      in the restart log.              09950000
*                                      OFF means that the resource      10000000
*                                      manager does not have entries    10050000
*                                      in the restart log.           */ 10100000
*      3 RM_name         char(32), /* Resource Manager name          */ 10150000
*      3 RMLognameLength fixed, /* Resource Manager log name length  */ 10200000
*      3 RMLogname       char(64),/* Resource Manager log name       */ 10250000
*                                                                       10300000
*      3 RqdRstSystem  char(8), /* System where the resource manager    10350000
*                                  is required to restart with RRS.     10400000
*                                  This field has no meaning for the    10450000
*                                  RRS resource manager entry.       */ 10500000
*      3 LastActSystem char(8), /* System where the resource manager    10550000
*                                  was last active with RRS.            10600000
*                                  This field has no meaning for the    10650000
*                                  RRS resource manager entry.       */ 10700000
*      3 LoggingSystem char(8), /* System which wrote the log entry  */ 10750000
*                                                                       10800000
*      /* The log stream versions are valid only for the                10850000
*         RRS resource manager log entry                                10900000
*      */                                                               10950000
*      3 Rmd_MainUrLogStreamVersion    char(8),/* Main UR log stream    11000000
*                                                 version token      */ 11050000
*      3 Rmd_DelayedUrLogStreamVersion char(8),/* Delayed UR log stream 11100000
*                                                 version token      */ 11150000
*      3 Rmd_RestartLogStreamVersion   char(8),/* Restart log stream    11200000
*                                                 version token      */ 11250000
*      3 Rmd_LogInstanceNumber         char(8), /* Instance Number used 11300000
*                     to differentiate log entries in the UR state logs 11350000
*                     that completed, logically deleted, but have       11400000
*                     yet to be compressed out of the logs.      @P2C*/ 11412500
*      3 Rmd_EndIt      Char(0),       /* Ensure strcture ends on       11425000
*                                         doubleword boundary    @P2A*/ 11437500
*      3 *              Char(                                           11450000
*                            (((Offset(Atrtzrmd.Rmd_EndIt)+7)/8)*8)-    11462500
*                            Offset(Atrtzrmd.Rmd_EndIt)                 11475000
*                           );         /*                        @P2A*/ 11487500
* Dcl ATRTZRMD_LEN fixed constant(length(atrtzrmd));                    11500000
*/* End of PL/X Source                                               */ 11550000
* %IF ATRTZRMD_LIST ^= 'NO' &                                           11600000
*    ZCBPRINT ^= 'NO' %THEN                                             11650000
*   %GOTO ATRTZRMD_4;                                                   11700000
*   @LIST POP NOECHO;                                                   11750000
* %ATRTZRMD_4:;                                                         11800000
* %END;                                                                 11850000
