*/*** Start of Specifications for BLSQMDEF ***************************/ 00003800
*/*                                                                  */ 00007600
*/* $MAC(BLSQMDEF) COMP(SC132) PROD(HBB6606): FORMAT MODEL HEADER    */ 00011400
*/*                                                                  */ 00015200
*/*    PROPRIETARY STATEMENT =                                       */ 00015800
*/*                                                                  */ 00016500
*/*    LICENSED MATERIALS  PROPERTY OF IBM                           */ 00016800
*/*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                   */ 00017200
*/*    5647-A01 (C) COPYRIGHT IBM CORP. 1984, 1998                   */ 00017900
*/*                                                                  */ 00018700
*/*    STATUS = HBB6606                                              */ 00021600
*/*                                                                  */ 00024600
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 00024700
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00024800
*/*                                                                  */ 00024900
*/* DESCRIPTIVE NAME:     Format model header                        */ 00025000
*/*   ACRONYM:  Not applicable                                       */ 00025100
*/*                                                                  */ 00025200
*/* MACRO NAME: BLSQMDEF                                             */ 00025300
*/* DSECT NAME: Not applicable                                       */ 00025400
*/* COMPONENT:  IPCS (SC132)                                         */ 00025500
*/* EYE-CATCHER: None                                                */ 00025600
*/*     OFFSET:  Not applicable                                      */ 00025700
*/*     LENGTH:  Not applicable                                      */ 00025800
*/*                                                                  */ 00025900
*/* STORAGE ATTRIBUTES:                                              */ 00026000
*/*   SUBPOOL:  Not applicable                                       */ 00026100
*/*   KEY:  0, 8                                                     */ 00026200
*/*   RESIDENCY:  LOC(ANY)                                           */ 00026300
*/*   MAIN STORAGE:  No                                              */ 00026400
*/*   AUXILIARY STORAGE: Yes                                         */ 00026500
*/*   VIRTUAL STORAGE: No                                            */ 00026600
*/*   DATA SPACE: No                                                 */ 00026700
*/*                                                                  */ 00026800
*/* SIZE: Not applicable                                             */ 00026900
*/* CREATED BY: User code for use by the IPCS model processor        */ 00027000
*/* POINTED TO BY: IPCS model processor parameters                   */ 00027100
*/* SERIALIZATION: None                                              */ 00027200
*/* FUNCTION: Begin and end the declaration of a model to be used    */ 00027300
*/* by the IPCS model processor.                                     */ 00027400
*/*                                                                  */ 00027500
*/* METHOD OF ACCESS: See MVS/SP Application Development Reference   */ 00027600
*/* DELETED BY: User code                                            */ 00027700
*/* DEPENDENCIES: None                                               */ 00027800
*/* DISTRIBUTION LIBRARY: AMACLIB                                    */ 00027900
*/*                                                                  */ 00030400
*/* ================================================================ */ 00031800
*/*                                                                  */ 00033200
*/* CHANGE ACTIVITY=                                                 */ 00034600
*/*                                                                  */ 00036000
*/*   Products=                                                      */ 00037400
*/* $L1= IPCSENH,HBB3310,86099,PDE4: Formatting enhancements:        */ 00038000
*/*      View match on value, multiple source formatting             */ 00038600
*/* $L2= VLF,HBB3310,87236,PDE1: Allow EXTERNAL to be specified as   */ 00039200
*/*      a second positional argument on an initial PLAS BLSQMDEF    */ 00039800
*/*      invocation.                                                 */ 00040400
*/*    = IPCSM,HBB4430,910327,PDE4: Withdrawn                        */ 00041000
*/* $L3= IPCSREUS,JBB6602,95172,PDE1: Mixed upper/lower case support */ 00041400
*/*                                                                  */ 00041500
*/* ---------------------------------------------------------------- */ 00041600
*/*                                                                  */ 00041700
*/* $H1=IEEEBLS,HBB6606,97344,PDE1: Additional FP registers          */ 00041800
*/*     Use SIZE built-in rather than LENGTH built-in if compiling   */ 00041900
*/*     with PL/X 1.4.1 or later                                     */ 00042000
*/*                                                                  */ 00042100
*/* ---------------------------------------------------------------- */ 00042200
*/*                                                                  */ 00042400
*/*   Design changes=                                                */ 00042700
*/* $D0= DCR0054,JBB2125,83125,DSDPPY: Process new format models     */ 00042900
*/*    = DKB0014,HBB4430,92008,PDE1: Remove IPCSM                    */ 00043100
*/*                                                                  */ 00043300
*/* ---------------------------------------------------------------- */ 00043500
*/*                                                                  */ 00043700
*/*   PTMs=                                                          */ 00043900
*/* $P1= PN71373,HBB5520,94230,PDE1: Align each new model on a       */ 00044100
*/*      halfword boundary, silencing binder warnings regarding      */ 00044300
*/*      byte-aligned entry points and yielding a very slight        */ 00044500
*/*      performance improvement as a result of the numerous         */ 00044700
*/*      halfword fields in models being aligned                     */ 00044900
*/*    = PN71742,HBB5520,94276,PDE1: Add SHOWHDR data to macro       */ 00045000
*/*      prolog, including classification                            */ 00045100
*/*                                                                  */ 00045200
*/* ---------------------------------------------------------------- */ 00045300
*/*                                                                  */ 00046300
*/*   Maintenance= none                                              */ 00047200
*/*                                                                  */ 00048100
*/***** End of Specifications for BLSQMDEF **************************** 00049000
         MACRO                                                          00050000
&NAME    BLSQMDEF &OPT1,                                               *00100000
               &BASELBL=,&CBLEN=,&MAINTLV=,&ACROFF=,&ACROLEN=,         *00150000
               &ACROLBL=,&ACRONYM=,&PREFIX=3,&OFFSETS=PRINT,           *00200000
               &STRTCOL=0,&LBLSPC=0,&HEADER=,&VIEWMATCH=           @L1C 00250000
*        MACDATE 03/03/87                                               00300000
         LCLA  &TEMP                                                    01150000
         LCLB  &B1,&B2,&B3                                         @L1C 01200000
         LCLC  &ACRLEN                                                  01225000
         LCLC  &DEFLBL                                                  01250000
         LCLC  &SMAINL,&SACRYN                                          01300000
         GBLA  &GPREFIX                                                 01350000
         GBLA  &LLBL                   MAXIMUM LABEL LENGTH        @L1C 01400000
         GBLB  &FIRSTSW                                            @L1C 01450000
         GBLB  &VARYSPC                                                 01500000
         GBLB  &ARAYOPN                                                 01550000
         GBLC  &FIRTFLD                                                 01600000
         GBLC  &OFFLBL                                                  01650000
         GBLC  &LEVEL                                                   01700000
         GBLC  &VARYLBL                                                 01750000
         GBLC  &VARYVAL                                                 01800000
         GBLC  &VALULLN                USED TO SET MAX LBL LEN IN HDR   01850000
         GBLC  &GSRCNDX                SOURCE INDEX                @L1A 01875000
         AIF   ('&OPT1' EQ '').LBL015                                   01900000
         AIF   ('&OPT1' EQ 'END').LBL005                                01950000
         MNOTE 4,'INVALID PARAMETER SPECIFIED - ''&OPT1'''              02000000
         AGO   .LBL015                                                  02050000
.LBL005  ANOP                                                           02100000
         AIF   (&FIRSTSW NE 1).MSG3                                     02150000
&VARYVAL SETC  'X''00'''                                                02200000
         AIF   (&VARYSPC EQ 0).LBL010                                   02250000
&VARYVAL SETC  'X''40'''                                                02300000
.LBL010  ANOP                                                           02350000
&B2      SETB  0                       ARRAY BIT                   @L1A 02366600
&OFFLBL  SETC  ''                      RESET LABEL OFFSET          @L1C 02383200
&VARYLBL EQU   &VARYVAL                                                 02400000
&FIRSTSW SETB  0                                                        02450000
&LEVEL   EQU   1                       MODEL LEVEL                 @L1C 02500000
&VALULLN EQU   &LLBL                   MAXIMUM LABEL LENGTH        @L1C 02550000
         DC    AL1(0)                  END OF MODEL                @L1C 02600000
         AIF   (&ARAYOPN EQ 0).LBL011                                   02650000
         MNOTE 8,'ARRAY DEFINITION NOT CLOSED'                          02700000
         MNOTE *,'ARRAY=END MUST BE SPECIFIED ON BLSQMFLD MACRO'        02750000
.LBL011  ANOP                                                           02800000
&ARAYOPN SETB  0                                                        02825000
         MEXIT                                                          02850000
.LBL015  ANOP                                                           02900000
         AIF   (&FIRSTSW NE 0).MSG4                                     02950000
&FIRTFLD SETC  'FLD1&SYSNDX'                                            03000000
&LEVEL   SETC  'LVL&SYSNDX'                                             03050000
&VARYLBL SETC  'VARY&SYSNDX'                                            03100000
&VARYVAL SETC  'X''00'''                                                03150000
&VALULLN SETC  'LLBL&SYSNDX'                                            03200000
         AIF   ('&CBLEN' NE '').PCK010                                  03250000
         MNOTE 8,'''CBLEN'' MUST BE SPECIFIED'                          03300000
.PCK010  ANOP                                                           03400000
&GSRCNDX SETC  '0'                     SOURCE INDEX DEFAULT        @L1A 03425000
&GPREFIX SETA  3                       DEFAULT PREFIX VALUE             03450000
&LLBL    SETA  5                       DEFAULT MAXIMUM LABEL LENGTH     03500000
         AIF   (T'&PREFIX(1) NE 'N').MSG1 '                        @L1C 03550000
&TEMP    SETA  &PREFIX(1)                                               03583300
         AIF   (&TEMP GT 8).MSG1                                        03616600
&GPREFIX SETA  &PREFIX(1)+1                                             03650000
&LLBL    SETA  8-&PREFIX(1)            MAXIMUM LABEL LENGTH             03700000
.PCK020  ANOP                                                           03750000
&B1      SETB  1                                                        03800000
         AIF   ('&OFFSETS' NE 'PRINT' AND '&OFFSETS' NE 'NOPRINT').MSG2 03850000
         AIF   ('&OFFSETS' EQ 'PRINT').PCK025                           03900000
&B1      SETB  0                                                        03950000
.PCK025  ANOP                                                           04000000
&B3      SETB  1             ASSUME VALUE MATCH                   @L1A  04007100
         AIF   ('&VIEWMATCH' NE '' AND '&VIEWMATCH' NE 'VALUE').MSG5    04014200
.*                                                                      04021300
         AIF   ('&VIEWMATCH' EQ 'VALUE').PCK027                   @L1A  04028400
&B3      SETB  0             BIT MATCH                            @L1A  04035500
.PCK027  ANOP                                                     @L1A  04042600
&OFFLBL  SETC  ''                                                       04050000
         AIF   ('&BASELBL' EQ '').PCK30                                 04100000
&OFFLBL  SETC  '&BASELBL'                                               04150000
.PCK30   ANOP                                                           04200000
         AIF   ('&ACROLEN' EQ '').PCK35                                 04206200
&ACRLEN  SETC  '&ACROLEN'                                               04212400
         AIF   (T'&ACROLEN(1) NE 'N').PCK35 '                      @L1C 04218600
&TEMP    SETA  &ACROLEN(1)                                              04223200
         AIF   (&TEMP LE 8).PCK35                                       04227800
         MNOTE 4,'INVALID VALUE SPECIFIED FOR ACROLEN'                  04232400
&ACRLEN  SETC  '0'                                                      04237200
.PCK35   ANOP                                                           04243400
.*                                                                      04250000
.*       PARAMETER CHECKING COMPLETE                                    04300000
.*                                                                      04350000
&SMAINL  SETC  '        '                                               04400000
         AIF   ('&MAINTLV' EQ '').LBL030                                04450000
&SMAINL  SETC  '&MAINTLV'                                               04500000
         AIF   (K'&MAINTLV LE 8).LBL030 '                          @L1C 04516600
         MNOTE 4,'MAINTLV VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'    04533200
.LBL030  ANOP  ,                                                   @L1C 04550000
&SACRYN  SETC  'CL8'' '''                                          @L1C 04600000
         AIF   ('&ACRONYM' EQ '').LBL040                                04650000
         AIF   ('&ACRONYM'(1,2) NE 'C''').LBL031                   @L1A 04654100
&SACRYN  SETC  'CL8'.'&ACRONYM'(2,K'&ACRONYM-1) '                  @L1A 04658200
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 04662300
&TEMP    SETA  K'&ACRONYM-3 '          Length of acronym           @L1A 04666400
         AGO   .LBL034                 Check length of acronym     @L1A 04670500
.LBL031  AIF   ('&ACRONYM'(1,2) NE 'X''').LBL033                   @L1A 04674600
&TEMP    SETA  (K'&ACRONYM-2)/2 '      Length of acronym           @L1A 04678700
&SACRYN  SETC  '&ACRONYM'(3,K'&ACRONYM-3) '                        @L1A 04682800
&SACRYN  SETC  '&SACRYN'.'0000000000000000'(1,16-(2*&TEMP)) '      @L1A 04686900
&SACRYN  SETC  'XL8''&SACRYN'''                                    @L1A 04691000
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 04695100
         AGO   .LBL034                 Check length of acronym     @L1A 04699200
.LBL033  ANOP  ,                                                   @L1A 04703300
&SACRYN  SETC  'CL8''&ACRONYM'''                                   @L1A 04707400
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 04711500
&TEMP    SETA  K'&ACRONYM '            Length of acronym           @L1A 04715600
.LBL034  AIF   (&TEMP LE 8).LBL035     Check length of acronym     @L1A 04719700
         MNOTE 4,'ACRONYM VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'    04724000
&TEMP    SETA  8                                                        04726000
.LBL035  ANOP                                                           04728000
&ACRLEN  SETC  '&TEMP'                                                  04730000
         AGO   .LBL041                                                  04740000
.LBL040  ANOP                                                           04750000
&ACRLEN  SETC  '0'                                                      04766600
.*                                                                      04772100
.*       BEGIN DEFINING A MODEL                                         04777600
.*                                                                      04783100
.LBL041  ANOP  ,                       Begin defining a model      @P1C 04788600
&NAME    DS    0H                      Align new model             @P1C 04794100
&DEFLBL  SETC  'DEF&SYSNDX'                                             04800000
&DEFLBL  DC    &SACRYN                 EBCDIC CTRL BLK ACRONYM     @L1C 04850000
         AIF   ('&HEADER' EQ '').LBL045                                 04900000
         AIF   (K'&HEADER LE 8).LBL043                           ' @L1C 04912500
         MNOTE 4,'HEADER VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'     04925000
.LBL043  ANOP                                                           04937500
         DC    CL8'&HEADER'            OUTPUT HEADER               @L1C 04950000
         AGO   .LBL046                                                  05000000
.LBL045  ANOP                                                           05050000
         DC    CL8' '                  OUTPUT HEADER (NONE)        @L1C 05100000
.LBL046  ANOP                                                           05150000
         DC    CL8'&SMAINL'            MAINTENANCE LEVEL OF CONTROL    *05175000
                                       BLOCK                       @L1C 05200000
         AIF   ('&CBLEN' EQ '').LBL048                                  05225000
         DC    AL2(&CBLEN)             LENGTH OF CONTROL BLOCK     @L1C 05250000
         AGO   .LBL049                                                  05260000
.LBL048  ANOP                                                           05270000
         DC    AL2(0)                  LENGTH OF CONTROL BLOCK     @L1C 05280000
.LBL049  ANOP                                                           05290000
         AIF   ('&ACROFF' EQ '').LBL050                                 05300000
         DC    AL2(&ACROFF)            OFFSET TO ACRONYM IN CONTROL    *05333300
                                       BLOCK                       @L1C 05366600
         AGO   .LBL053                                                  05400000
.LBL050  ANOP                                                           05450000
         AIF   ('&ACROLBL' EQ '').LBL052                                05483300
         AIF   ('&OFFLBL' NE '').LBL051                                 05516600
         DC    AL2(0)                  OFFSET TO ACRONYM IN CONTROL    *05538800
                                       BLOCK                       @L1C 05561000
         MNOTE 8,'ACROFF PARAMETER REQUIRED BUT NOT SPECIFIED'          05583200
         AGO   .LBL053                                                  05616500
.LBL051  ANOP                                                           05650000
         DC    AL2(&ACROLBL-&OFFLBL)   OFFSET TO ACRONYM IN CONTROL    *05672200
                                       BLOCK                       @L1C 05694400
         AGO   .LBL053                                                  05716600
.LBL052  ANOP                                                           05750000
         DC    AL2(0)                  OFFSET TO ACRONYM           @L1C 05783300
.LBL053  ANOP                                                           05816600
         DC    AL1(&ACRLEN)            LENGTH OF ACRONYM           @L1C 05859900
         DC    AL1(&VALULLN)           LABEL LENGTH                @L1C 05903200
         DC    AL1(&STRTCOL)           START COLUMN OR LEFT MARGIN @L1C 05946500
         DC    AL1(&LBLSPC)            NUMBER OF COLUMNS BETWEEN       *05989800
                                       LABELS                      @L1C 06033100
         DC    AL1(B'&B1&B2&B3.00000'+&VARYLBL)  FLAGS             @L1C 06076400
         DC    AL1(&FIRTFLD-&DEFLBL)   OFFSET TO FIRST FIELD DESC  @L1C 06119700
         DC    AL1(&LEVEL)             MODEL LEVEL                 @L1C 06163000
         DC    X'00'                   RESERVED                    @L1C 06206300
&FIRSTSW SETB  1                                                        06250000
         MEXIT                                                          06300000
.*                                                                      06350000
.MSG1    ANOP                                                           06400000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR PREFIX'                   06450000
         AGO   .PCK020                                                  06500000
.MSG2    ANOP                                                           06550000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR OFFSETS'                  06600000
         AGO   .PCK025                                                  06650000
.MSG5    ANOP                                                      @L1A 06662500
         MNOTE 4,'INVALID VALUE SPECIFIED FOR VIEWMATCH'           @L1A 06675000
         AGO   .PCK027                                             @L1A 06687500
.MSG3    ANOP                                                           06700000
    MNOTE 8,'NO DEFINITION CURRENTLY IN PROGRESS - TERMINATION IGNORED' 06750000
         MEXIT                                                          06800000
.MSG4    ANOP                                                           06850000
    MNOTE 8,'DEFINITION CURRENTLY IN PROGRESS - NEW DEFINITION IGNORED' 06900000
         MEXIT                                                          06950000
         MEND  ,                                                     */ 06983300
*                                                                       07016600
*%BLSQMDEF:                         /* Define model header       @L2C*/ 07050000
*   MACRO KEYS(ACROFF,ACROLBL,ACROLEN,ACRONYM,BASELBL,CBLEN,HEADER,     07100000
*       LBLSPC,MAINTLV,OFFSETS,PREFIX,STRTCOL,VIEWMATCH);               07150000
*                                                                       07200000
*/* ================================================================ */ 07250000
*/* Define Macro-Variables                                           */ 07300000
*/* ================================================================ */ 07350000
*                                                                       07400000
*   DECLARE                         /* Macro variables               */ 07450000
*     ASAXMAC_IsItPLX CHARACTER EXTERNAL, /* ASAXMAC interface   @H1A*/ 07475000
*     ELSQMDEFFLAG CHARACTER EXTERNAL, /* Flag constant base     @L1A*/ 07500000
*     ELSQMDEFNAME CHARACTER EXTERNAL, /* Unique name base       @L1A*/ 07550000
*     ELSQMDEFOFFL CHARACTER EXTERNAL, /* Offset label base      @L1A*/ 07600000
*     ELSQMDEFSRCI CHARACTER EXTERNAL, /* Multiple source index  @L1A*/ 07650000
*     ELSQMDEFLLEN FIXED EXTERNAL,  /* Maximum label length      @L1A*/ 07700000
*     ELSQMDEFPLEN FIXED EXTERNAL,  /* Prefix length + 1         @L1A*/ 07750000
*     CLMETRIC CHARACTER INTERNAL,  /* Length metric             @H1A*/ 07775000
*     F1       FIXED INTERNAL;      /* Utility                   @L1P*/ 07800000
*   DEACTIVATE                      /* Prevent accidents         @L1A*/ 07850000
*       CLMETRIC,                   /*                           @H1C*/ 07875000
*       ELSQMDEFFLAG,ELSQMDEFNAME,ELSQMDEFOFFL,ELSQMDEFSRCI;            07900000
*   ANSWER('?ASAXMAC ISITPLX(1,4,1);'); /*                       @H1A*/ 07908300
*   IF ASAXMAC_IsItPLX = 'YES' THEN /* Use SIZE                  @H1A*/ 07916600
*     CLMETRIC = 'SIZE(';           /*                           @H1A*/ 07924900
*   ELSE                            /* Use LENGTH                    */ 07933200
*     CLMETRIC = 'LENGTH(';         /*                           @H1A*/ 07941500
*                                                                       07950000
*/* ================================================================ */ 08000000
*/* Produce Declaration                                              */ 08050000
*/* ================================================================ */ 08100000
*                                                                       08150000
*   IF TRANSLATE(MACLIST(1)) = 'END' THEN /* Mark end of model   @L3C*/ 08200000
*                                                                       08250000
*     /***************************************************************/ 08300000
*     /*                                                             */ 08350000
*     /* Mark end of model                                           */ 08400000
*     /*                                                             */ 08450000
*     /***************************************************************/ 08500000
*                                                                       08550000
*     DO;                           /* Mark end of model         @L1A*/ 08600000
*       ANSWER('2 END#MODEL BIT(8) INITIAL(''00''X),/*BLSQMDEF'||       08650000
*           MACLIST||' '||MACKEYS||'*/') COLUMN(8); /*           @L1A*/ 08700000
*       ANSWER(ELSQMDEFNAME||'FLAG BIT(8) CONSTANT('''||ELSQMDEFFLAG||  08750000
*           '''B),/*Model header flags*/') COLUMN(7); /*         @L1A*/ 08800000
*       ANSWER(ELSQMDEFNAME||'LLEN CONSTANT('||CHAR(ELSQMDEFLLEN)||     08850000
*           ');/*Maximum label length*/') COLUMN(7); /*          @L1A*/ 08883300
*       ANSWER('?BLRDEFEP;');       /* Process deferred DCLs     @L2P*/ 08916600
*     END;                          /* Mark end of model         @L1A*/ 08950000
*   ELSE                            /* Begin model               @L1A*/ 09000000
*                                                                       09050000
*     /***************************************************************/ 09100000
*     /*                                                             */ 09150000
*     /* Begin a model                                               */ 09200000
*     /*                                                             */ 09250000
*     /***************************************************************/ 09300000
*                                                                       09350000
*     DO;                           /* Begin model               @L1A*/ 09400000
*       ANSWER('?BLRDEFEP;');       /* Process deferred DCLs     @L2P*/ 09425000
*       ELSQMDEFNAME = 'BLSQMDEF' || MACINDEX; /* Unique name    @L1A*/ 09450000
*       ELSQMDEFOFFL = BASELBL(1);  /* Offset label base         @L1A*/ 09500000
*       ELSQMDEFSRCI = '0';         /* Multiple source index     @L1A*/ 09550000
*                                                                       09600000
*       /*************************************************************/ 09650000
*       /*                                                           */ 09700000
*       /* Process prefix length                                     */ 09750000
*       /*                                                           */ 09800000
*       /*************************************************************/ 09850000
*                                                                       09900000
*       ELSQMDEFLLEN = 5;           /* Maximum label length      @L1A*/ 09950000
*       ELSQMDEFPLEN = 4;           /* Prefix length + 1         @L1A*/ 10000000
*       IF LENGTH(PREFIX(1)) > 0 THEN /* Explicit prefix length  @L1A*/ 10050000
*         DO;                       /* Explicit prefix length    @L1A*/ 10100000
*           F1 = FIXED(PREFIX(1));  /* Prefix length             @L1A*/ 10150000
*           ELSQMDEFLLEN = 8 - F1;  /* Maximum label length      @L1A*/ 10200000
*           ELSQMDEFPLEN = F1 + 1;  /* Prefix length + 1         @L1A*/ 10250000
*         END;                      /* Explicit prefix length    @L1A*/ 10300000
*                                                                       10350000
*       /*************************************************************/ 10400000
*       /*                                                           */ 10450000
*       /* Declare prefix length                                     */ 10500000
*       /*                                                           */ 10550000
*       /*************************************************************/ 10600000
*                                                                       10650000
*       ANSWER('DECLARE/*BLSQMDEF #MD97344*/'); /*               @H1C*/ 10685700
*       ANSWER('/*BLSQMDEF'||MACLIST||' '||MACKEYS||'*/') COLUMN(7);    10721400
*                                   /*                           @L2A*/ 10757100
*       ANSWER('1 '||MACLIST(1)||' '||MACLIST(2)||                      10792800
*           ' STATIC LOCAL BOUNDARY(WORD),/*BLSQMDEF #MD97344*/')       10828500
*           COLUMN(7);              /*                           @H1C*/ 10864200
*       ANSWER('2 MODEL#HEADER BOUNDARY(WORD),/*Model header*/') COLUMN 10900000
*           (9);                    /*                           @L1A*/ 10950000
*                                                                       11000000
*       /*************************************************************/ 11050000
*       /*                                                           */ 11100000
*       /* Process acronym                                           */ 11150000
*       /*                                                           */ 11200000
*       /*************************************************************/ 11250000
*                                                                       11300000
*       ANSWER('3 ACRONYM CHARACTER(8) INITIAL(') COLUMN(9); /*  @L1A*/ 11350000
*       IF LENGTH(ACRONYM(1)) > 0 THEN /*                        @L1A*/ 11400000
*         ANSWER(ACRONYM(1));       /*                           @L1A*/ 11450000
*       ELSE                                                            11500000
*         ANSWER(''' ''');          /*                           @L1A*/ 11550000
*       ANSWER('),/*Control block acronym*/'); /*                @L1A*/ 11600000
*                                                                       11650000
*       /*************************************************************/ 11700000
*       /*                                                           */ 11750000
*       /* Process label                                             */ 11800000
*       /*                                                           */ 11850000
*       /*************************************************************/ 11900000
*                                                                       11950000
*       ANSWER('3 OUTPUT#HEADER CHARACTER(8) INITIAL(') COLUMN(9); /*   12000000
*                                                                @L1A*/ 12050000
*       IF LENGTH(HEADER(1)) > 0 THEN /*                         @L1A*/ 12100000
*         ANSWER(HEADER(1));        /*                           @L1A*/ 12150000
*       ELSE                                                            12200000
*         ANSWER(''' ''');          /*                           @L1A*/ 12250000
*       ANSWER('),/*Formatted output header*/'); /*              @L1A*/ 12300000
*                                                                       12350000
*       /*************************************************************/ 12400000
*       /*                                                           */ 12450000
*       /* Process maintenance level                                 */ 12500000
*       /*                                                           */ 12550000
*       /*************************************************************/ 12600000
*                                                                       12650000
*       ANSWER('3 MODEL#MAINTENANCE#LEVEL CHARACTER(8) INITIAL(')       12700000
*           COLUMN(9);              /*                           @L1A*/ 12750000
*       IF LENGTH(MAINTLV(1)) > 0 THEN /*                        @L1A*/ 12800000
*         ANSWER(MAINTLV(1));       /*                           @L1A*/ 12850000
*       ELSE                                                            12900000
*         ANSWER(''' ''');          /*                           @L1A*/ 12950000
*       ANSWER('),/*Maintenance level of this model*/'); /*      @L1A*/ 13000000
*                                                                       13050000
*       /*************************************************************/ 13100000
*       /*                                                           */ 13150000
*       /* Process control block length                              */ 13200000
*       /*                                                           */ 13250000
*       /*************************************************************/ 13300000
*                                                                       13350000
*       ANSWER('3 CONTROL#BLOCK#LENGTH UNSIGNED BINARY(15) INITIAL(')   13400000
*           COLUMN(9);              /*                           @L1A*/ 13450000
*       IF LENGTH(CBLEN(1)) > 0 THEN /* Length specified         @L1A*/ 13500000
*         ANSWER(CBLEN(1));         /*                           @L1A*/ 13550000
*       ELSE                        /* No length                     */ 13600000
*         ANSWER('0');              /*                           @L1A*/ 13650000
*       ANSWER('),/*Control block length*/') COLUMN(33); /*      @L1A*/ 13700000
*                                                                       13750000
*       /*************************************************************/ 13800000
*       /*                                                           */ 13850000
*       /* Process acronym offset                                    */ 13900000
*       /*                                                           */ 13950000
*       /*************************************************************/ 14000000
*                                                                       14050000
*       ANSWER('3 ACRONYM#OFFSET SIGNED BINARY(15) INITIAL(') COLUMN(9) 14100000
*           ;                       /*                           @L1A*/ 14150000
*       IF LENGTH(ACROFF(1)) > 0 THEN /* Length specified        @L1A*/ 14200000
*         ANSWER(ACROFF(1));        /*                           @L1A*/ 14250000
*       ELSE                        /* No length                     */ 14300000
*         IF LENGTH(ACROLBL(1)) > 0 THEN /* Acronym label named  @L1A*/ 14350000
*           IF LENGTH(BASELBL(1)) > 0 THEN /* Base label named   @L1A*/ 14400000
*             ANSWER('OFFSET('||ACROLBL(1)||','||BASELBL(1)||')'); /*   14450000
*                                      Offset from label         @L1A*/ 14500000
*           ELSE                    /* No base label                 */ 14550000
*             ANSWER('OFFSET('||ACROLBL(1)||')'); /*             @L1A*/ 14600000
*         ELSE                      /* No acronym label              */ 14650000
*           ANSWER('0');            /* Default offset            @L1A*/ 14700000
*       ANSWER('),/*Acronym offset*/'); /*                       @L1A*/ 14750000
*                                                                       14800000
*       /*************************************************************/ 14850000
*       /*                                                           */ 14900000
*       /* Process acronym length                                    */ 14950000
*       /*                                                           */ 15000000
*       /*************************************************************/ 15050000
*                                                                       15100000
*       ANSWER('3 ACRONYM#LENGTH UNSIGNED BINARY(8) INITIAL(') COLUMN(9 15150000
*           );                      /*                           @L1A*/ 15200000
*       IF LENGTH(ACROLEN(1)) > 0 THEN /* Length specified       @L1A*/ 15250000
*         ANSWER(ACROLEN(1));       /*                           @L1A*/ 15300000
*       ELSE                        /* No length                     */ 15350000
*         IF LENGTH(ACROLBL(1)) > 0 THEN /* Acronym label named  @L1A*/ 15400000
*           ANSWER(CLMETRIC||ACROLBL(1)||')'); /*                @H1C*/ 15450000
*         ELSE                      /* No acronym label              */ 15500000
*           IF LENGTH(ACRONYM(1)) > 0 THEN /*                    @L1A*/ 15550000
*             ANSWER(CLMETRIC||ACRONYM(1)||')'); /*              @H1C*/ 15600000
*           ELSE                    /* No acronym                    */ 15650000
*             ANSWER('0');          /*                           @L1A*/ 15700000
*       ANSWER('),/*Acronym length*/'); /*                       @L1A*/ 15750000
*                                                                       15800000
*       /*************************************************************/ 15850000
*       /*                                                           */ 15900000
*       /* Process label length                                      */ 15950000
*       /*                                                           */ 16000000
*       /*************************************************************/ 16050000
*                                                                       16100000
*       ANSWER('3 LABEL#LENGTH UNSIGNED BINARY(8) INITIAL('||           16150000
*           ELSQMDEFNAME||'LLEN),/*Maximum length of label*/') COLUMN(9 16200000
*           );                      /*                           @L1A*/ 16250000
*                                                                       16300000
*       /*************************************************************/ 16350000
*       /*                                                           */ 16400000
*       /* Process begin column                                      */ 16450000
*       /*                                                           */ 16500000
*       /*************************************************************/ 16550000
*                                                                       16600000
*       ANSWER('3 BEGIN#COLUMN UNSIGNED BINARY(8) INITIAL(') COLUMN(9); 16650000
*                                   /*                           @L1A*/ 16700000
*       IF LENGTH(STRTCOL(1)) > 0 THEN /* Column specified       @L1A*/ 16750000
*         ANSWER(STRTCOL(1));       /*                           @L1A*/ 16800000
*       ELSE                        /* No column                     */ 16850000
*         ANSWER('0');              /*                           @L1A*/ 16900000
*       ANSWER('),/*Begin column*/'); /*                         @L1A*/ 16950000
*                                                                       17000000
*       /*************************************************************/ 17050000
*       /*                                                           */ 17100000
*       /* Process column distance                                   */ 17150000
*       /*                                                           */ 17200000
*       /*************************************************************/ 17250000
*                                                                       17300000
*       ANSWER('3 COLUMN#WIDTH UNSIGNED BINARY(8) INITIAL(') COLUMN(9); 17350000
*                                   /*                           @L1A*/ 17400000
*       IF LENGTH(LBLSPC(1)) > 0 THEN /* Width specified         @L1A*/ 17450000
*         ANSWER(LBLSPC(1));        /*                           @L1A*/ 17500000
*       ELSE                        /* No width                      */ 17550000
*         ANSWER('0');              /*                           @L1A*/ 17600000
*       ANSWER('),/*The usual interpretation is the number of '||       17650000
*           'columns used for one label and the data associated '||     17700000
*           'with it.  See the published documentation regarding '||    17750000
*           'special, contextual interpretations.*/'); /*        @L1A*/ 17800000
*                                                                       17850000
*       /*************************************************************/ 17900000
*       /*                                                           */ 17950000
*       /* Process model header flags                                */ 18000000
*       /*                                                           */ 18050000
*       /*************************************************************/ 18100000
*                                                                       18150000
*       ELSQMDEFFLAG = '00000000';  /* Flag constant base        @L1A*/ 18200000
*       IF TRANSLATE(OFFSETS(1)) = 'PRINT' THEN /* OFFSETS(PRINT)       18233300
*                                                                @L3C*/ 18266600
*         ELSQMDEFFLAG = '10000000'; /* Flag constant base       @L1A*/ 18300000
*       IF TRANSLATE(VIEWMATCH(1)) = 'VALUE' THEN /* VIEWMATCH(VALUE)   18333300
*                                                                @L3C*/ 18366600
*         ELSQMDEFFLAG = ELSQMDEFFLAG(1:1) || '0100000'; /* Flag        18400000
*                                      constant base             @L1A*/ 18450000
*       ANSWER('3 FLAG BIT(8) INITIAL('||ELSQMDEFNAME||                 18500000
*           'FLAG),/*Model header flags*/') COLUMN(9); /*        @L1A*/ 18550000
*       ANSWER('4 FLAG#PRINT#OFFSETS BIT(1),/*Print data offsets*/')    18600000
*           COLUMN(10);             /*                           @L1A*/ 18650000
*       ANSWER(                                                         18700000
*           '4 FLAG#VARIABLE#ARRAY BIT(1),/*Variable array described*/' 18750000
*           ) COLUMN(10);           /*                           @L1A*/ 18800000
*       ANSWER('4 FLAG#VIEWMATCH#VALUE BIT(1),/*Match on view value*/') 18850000
*           COLUMN(10);             /*                           @L1A*/ 18900000
*       ANSWER('4 * BIT(5),/*Reserved*/') COLUMN(10); /*         @L1A*/ 18950000
*                                                                       19000000
*       /*************************************************************/ 19050000
*       /*                                                           */ 19100000
*       /* Process first entry offset                                */ 19150000
*       /*                                                           */ 19200000
*       /*************************************************************/ 19250000
*                                                                       19300000
*       ANSWER('3 FIRST#BLSQMFLD#OFFSET POINTER(8) INITIAL(OFFSET('||   19350000
*           MACLIST(1)||'.END#HEADER,'||MACLIST(1)||                    19400000
*           ')),/*Offset to first BLSQMFLD macro expansion*/') COLUMN(9 19450000
*           );                      /*                           @L1A*/ 19500000
*                                                                       19550000
*       /*************************************************************/ 19600000
*       /*                                                           */ 19650000
*       /* Process definition level                                  */ 19700000
*       /*                                                           */ 19750000
*       /*************************************************************/ 19800000
*                                                                       19850000
*       ANSWER('3 DEFINITION#LEVEL UNSIGNED BINARY(8) INITIAL(1),'||    19900000
*           '/*Version of BLSQMDEF and BLSQMFLD macro expansions*/')    19950000
*           COLUMN(9);              /*                           @L1A*/ 20000000
*       ANSWER(                                                         20050000
*           '3 * BIT(8) BOUNDARY(WORD,4) INITIAL(''00''X),/*Reserved*/' 20100000
*           ) COLUMN(9);            /*                           @L1A*/ 20150000
*       ANSWER(                                                         20200000
*'3 END#HEADER CHARACTER(0) BOUNDARY(WORD),/*BLSQMDEF #MD97344*/')      20250000
*           COLUMN(9);              /*                           @H1C*/ 20300000
*     END;                          /* Begin model               @L1A*/ 20350000
*   %END BLSQMDEF;                  /* Define model header       @L1A*/ 20400000
