*/* START OF SPECIFICATIONS FOR BLSQFXL ******************************/ 00100000
*/*                                                                  */ 00150000
*/* $MAC(BLSQFXL) COMP(SC132) PROD(HBB4430): FORMAT EXIT LIST        */ 00200000
*/*                                                                  */ 00207100
*/* Acronym:    FXL                                                  */ 00214200
*/* Descriptive Name: Format Exit List                               */ 00221300
*/* Macro Name: BLSQFXL                                              */ 00228400
*/* Dsect Name: FXL                                                  */ 00235500
*/* Component:  (SC132) - IPCS                                       */ 00242600
*/*                                                                  */ 00250000
*/*    PROPRIETARY STATEMENT =                                       */ 00254600
*/*                                                                  */ 00257600
*/*    LICENSED MATERIALS  PROPERTY OF IBM                           */ 00260600
*/*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                   */ 00263800
*/*    5695-047 (C) COPYRIGHT IBM CORP. 1986, 1992                   */ 00268400
*/*    SEE COPYRIGHT INSTRUCTIONS                                    */ 00273000
*/*                                                                  */ 00277600
*/*    STATUS = HBB4430                                              */ 00282200
*/*                                                                  */ 00287500
*/* Function= Map the format exit list of line information that      */ 00300000
*/* is passed by BLSQFORM to routines that gain control during       */ 00350000
*/* the formatting process, either in line mode, or in response      */ 00400000
*/* to the CALLRTN flag in a model entry.                            */ 00450000
*/*                                                                  */ 00500000
*/* ================================================================ */ 00515000
*/* Eye Catcher:                                                     */ 00515600
*/* Offset:                                                          */ 00516200
*/* Length:                                                          */ 00516800
*/*                                                                  */ 00517400
*/* Storage Attributes:                                              */ 00518000
*/*  Main Storage:                                                   */ 00518600
*/*  Virtual Storage:                                                */ 00519200
*/*  Auxiliary Storage:                                              */ 00519800
*/*  Subpool:                                                        */ 00520400
*/*  Key:                                                            */ 00521000
*/*  Data Space:                                                     */ 00521600
*/*  Residency:                                                      */ 00522200
*/*  Size:       204 bytes                                           */ 00522800
*/*                                                                  */ 00523400
*/* Created by:    BLSQFORM                                          */ 00524000
*/* Pointed to by:                                                   */ 00524600
*/* Serialization:                                                   */ 00525200
*/*                                                                  */ 00525800
*/* Method of Access:                                                */ 00526400
*/*  PL/AS                                                           */ 00527000
*/*   %FXLSTORAGES= 'BASED'                                          */ 00527600
*/*   %INCLUDE BLSQFXL                                               */ 00528200
*/*  ASM                                                             */ 00528800
*/*   INCLUDE BLSQFXL DSECT=YES|NO                                   */ 00529400
*/*                                                                  */ 00530000
*/* CHANGE ACTIVITY:                                                 */ 00545000
*/*                                                                  */ 00560000
*/*   Line items=                                                    */ 00575000
*/* $L0= SRVADFXT,JBB2220,84082,PDE4: Enhanced formatting            */ 00590000
*/* $L1= IPCSENH,HBB3310,86158,PDE1: Suppress assembler macro in     */ 00605000
*/*      PLAS source listing                                         */ 00620000
*/*    = IPCSM ,HBB4430,910327,PDE4: Withdrawn                       */ 00635000
*/*                                                                  */ 00650000
*/*   Design changes=                                                */ 00661100
*/* $D1= DKB0014,HBB4430,92008,PDE1: Remove IPCSM                    */ 00672200
*/*                                                             2@D1D*/ 00683300
*/*   PTMs= none                                                     */ 00694400
*/*                                                                  */ 00705500
*/*   Maintenance= none                                              */ 00716600
*/*                                                                  */ 00727700
*/*** END OF SPECIFICATIONS FOR BLSQFXL ******************************/ 00738800
*                                                                       00750000
*   %IF TRUTH ^= TRUTH %THEN        /* Skip assembler macro      @L1P*/ 00800000
*     %DO;                          /* Skip assembler macro      @L1P*/ 00850000
*/* Treat assembler macro as PLAS full-width remark ******************* 00900000
         MACRO                                                          00950000
         BLSQFXL &DSECT=YES                                             01000000
         IEZBITS ,                     Define BIT0-BIT7 symbols         01050000
         AIF   ('&DSECT' EQ 'NO').NODSECT Suppress DSECT statement      01100000
FXL      DSECT ,                       Format exit list map             01150000
         AGO   .COMMON                 Declare common mapping           01200000
.NODSECT ANOP  ,                       Suppress DSECT statement         01250000
FXL      DS    0F                      Format exit list map             01300000
.COMMON  ANOP  ,                       Declare common mapping           01350000
FXLMHDR  DC    A(0)                    Pointer to Model header          01400000
FXLMENT  DC    A(0)                    Pointer to Model entry           01450000
FXLLPOS  DC    FL1'0'                  Exit label position              01500000
FXLDPOS  DC    FL1'0'                  Exit data position               01550000
FXLDLEV  DC    BL2'0000000000000001'   Exit list level = 0001           01600000
FXLDPTR  DC    A(0)                    Data pointer                     01650000
FXLLNO   DC    H'0'                    Line number                      01700000
FXLNLPOS DC    FL1'0'                  Next buffer label position       01750000
FXLNDPOS DC    FL1'0'                  Next buffer data position        01800000
FXLENDX  DC    H'0'                    Model entry index                01850000
FXLITMC  DC    FL1'0'                  Item count                       01900000
FXLCTF   DC    BL1'00000000'           Control flags                    01950000
FXLQUIT  EQU   BIT0                    Quit processing                  02000000
FXLLAST  EQU   BIT1                    Last call for cleanup            02050000
FXLCOLD  DC    H'0'                    Column depth                     02100000
FXLENTNM DC    H'0'                    Array entry number               02150000
FXLLINE  DS    40XL4                   Line information array def       02200000
         ORG   FXLLINE                 Describe individual fields       02250000
FXLILBP  DC    FL1'0'                  Item label position              02300000
FXLIDTP  DC    FL1'0'                  Item data position               02350000
FXLIDTL  DC    H'0'                    Item data length                 02400000
FXLIFLG  DC    BL1'00000000'           Item flags                       02450000
FXLCHAR  EQU   BIT0                    Character field                  02500000
FXLHEX   EQU   BIT1                    Hex field                        02550000
FXLSHDR  EQU   BIT2                    Subheader field                  02600000
FXLBYPS  EQU   BIT4                    Bypass this entry                02650000
         MEND  ,                       End of assembler macro        */ 02700000
*                                                                       02750000
*       %END;                       /* Assembler macro skipped   @L1P*/ 02800000
*   %IF FXLSTORAGE = '' %THEN                                           02850000
*     %FXLSTORAGE = 'BASED';                                            02900000
*   DECLARE                                                             03000000
*     1    FXL      FXLSTORAGE BOUNDARY(WORD),                          03050000
*      2    FXLMHDR  POINTER(32),   /* Pointer to Model header       */ 03100000
*      2    FXLMENT  POINTER(32),   /* Pointer to Model entry        */ 03150000
*      2    FXLLPOS  UNSIGNED BINARY(8), /* Exit label position      */ 03200000
*      2    FXLDPOS  UNSIGNED BINARY(8), /* Exit data position       */ 03250000
*      2    FXLDLEV  BIT(16),       /* Exit list level = 0001        */ 03300000
*      2    FXLDPTR  POINTER(32),   /* Data pointer                  */ 03350000
*      2    FXLLNO   UNSIGNED BINARY(15), /* Line number             */ 03400000
*      2    FXLNLPOS UNSIGNED BINARY(8), /* Next buffer label           03450000
*                                      position                      */ 03500000
*      2    FXLNDPOS UNSIGNED BINARY(8), /* Next buffer data position*/ 03550000
*      2    FXLENDX  UNSIGNED BINARY(15), /* Model entry index       */ 03600000
*      2    FXLITMC  UNSIGNED BINARY(8), /* Item count               */ 03650000
*      2    FXLCTF   BIT(8),        /* Control flags                 */ 03700000
*       3    FXLQUIT  BIT(1),       /* Quit processing               */ 03750000
*       3    FXLLAST  BIT(1),       /* Last call for cleanup         */ 03800000
*       3    *        BIT(6),       /* Reserved                      */ 03850000
*      2    FXLCOLD  UNSIGNED BINARY(15), /* Column depth            */ 03900000
*      2    FXLENTNM SIGNED BINARY(15), /* Array entry number        */ 03950000
*      2    *        CHARACTER(24), /* Reserved                      */ 04000000
*      2    FXLLINES CHARACTER(160), /* Line information block def   */ 04050000
*       3    FXLLINE(40) CHARACTER(4), /* Line information array def */ 04100000
*        4    FXLILBP  UNSIGNED BINARY(8), /* Item label position    */ 04150000
*        4    FXLIDTP  UNSIGNED BINARY(8), /* Item data position     */ 04200000
*        4    FXLIDTL  UNSIGNED BINARY(8), /* Item data length       */ 04250000
*        4    FXLIFLG  BIT(8),      /* Item flags                    */ 04300000
*         5    FXLCHAR  BIT(1),     /* Character field               */ 04350000
*         5    FXLHEX   BIT(1),     /* Hex field                     */ 04400000
*         5    FXLSHDR  BIT(1),     /* Subheader field               */ 04450000
*         5    *        BIT(1),     /* Reserved                      */ 04500000
*         5    FXLBYPS  BIT(1),     /* Bypass this entry             */ 04550000
*         5    *        BIT(3);     /* Reserved                      */ 04600000
