*        %GOTO INHEPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYINHE  &DSECT=YES,&LIST=YES                       8@D1A     00150000
         GBLB  &INHE411                                                 00200000
         AIF   (&INHE411 EQ 1).E411                                     00250000
&INHE411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYINHE: Inheritance Area for Spawn Service      00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%INHEPRO : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYINHE) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYINHE                                               00850000
*                                                                       00900000
*01* DSECT NAME: INHE                                                   00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Mapping of Inheritance structure for the Spawn   01050000
*                      callable service                                 01100000
*                                                                       01150000
*02*   ACRONYM: INHE                                                    01200000
**/                                                                     01250000
*/*01* PROPRIETARY INHEEMENT=                                        */ 01300000
*/***PROPRIETARY_INHEEMENT********************************************/ 01350000
*/*                                                                  */ 01400000
*/*                                                                  */ 01450000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01500000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01550000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1995, 2000                      */ 01600000
*/*                                                                  */ 01650000
*/* STATUS: HBB7703                                                  */ 01700000
*/*                                                                  */ 01750000
*/***END_OF_PROPRIETARY_INHEEMENT*************************************/ 01800000
*/*                                                                     01850000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* FUNCTION:                                                          02050000
*                                                                       02100000
*      The INHE maps the inheritance structure that is supplied to the  02150000
*      Spawn callable service.                                          02200000
*                                                                       02250000
*                                                                       02300000
*01* METHOD OF ACCESS:                                                  02350000
*                                                                       02400000
*02*   PL/X:                                                            02450000
*                                                                       02500000
*        %INCLUDE SYSLIB(BPXYINHE)                                      02550000
*        By default, the INHE is based on INHEPtr. If                   02600000
*        other basing is desired, use %INHEBASE='BASED(XXXXXX)'.        02650000
*        If %INHEBASE='BASED(INHEPtr)' is coded, a Declare for          02700000
*        INHEPtr is also generated.                                     02750000
*                                                                       02800000
*                                                                       02850000
*02*   ASM:                                                             02900000
*        With DSECT=NO, storage is allocated in line                    02950000
*        and addressability is provided thru that DSECT or CSECT.       03000000
*        With DSECT=YES, a DSECT is produced and "USING INHE,reg"       03050000
*        is required for addressability.  Here "reg" contains the       03100000
*        address of INHE#LENGTH bytes of storage.                       03150000
*        The default is DSECT=YES.                                      03200000
*                                                                       03250000
*01* SIZE: INHE#LENGTH                                                  03300000
*                                                                       03350000
*01* POINTED TO BY: INHEPtr                                             03400000
*                                                                       03450000
*01* CREATED BY: Storage obtained by caller of Spawn callable service   03500000
*                                                                       03550000
*01* DELETED BY: Caller of Spawn callable service                       03600000
*                                                                       03650000
*01* STORAGE ATTRIBUTES:                                                03700000
*02*   SUBPOOL/DATASPACE:  N/A                                          03750000
*02*   KEY:                N/A                                          03800000
*02*   RESIDENCY:          N/A                                          03850000
*                                                                       03900000
*01* FREQUENCY: 1 per call to spawn()                                   03950000
*                                                                       04000000
*01* SERIALIZATION: N/A                                                 04050000
*                                                                       04100000
*01* DEPENDENCIES: None                                                 04150000
*                                                                       04200000
*01* NOTES: None                                                        04250000
*                                                                       04300000
*01* COMPONENT:  OpenMVS (SCPX1)                                        04350000
*                                                                       04400000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04450000
*                                                                       04500000
*01* EYE-CATCHER: INHE                                                  04550000
*02*   OFFSET:  0                                                       04600000
*02*   LENGTH:  4                                                       04650000
*                                                                       04700000
*01* CHANGE-ACTIVITY:                                                   04750000
*                                                                       04800000
* $D1=DPFA079  HOM1130 940315 PDI6: Spawn Support (A079.01)             04850000
* $D2=DPFA051  HOM1130 950307 PDI6: (A051.23) updated for bpxb1sm1      04900000
* $D3=DSYA196  HBB6604 960822 PDAE: (A196.02) Add USERID, REGION, TIME  04950000
*                             LIMIT, JOBNAME, ACCOUNT DATA, CWD & UMASK 05000000
* $D4=DVTA237  HBB6606 961211 PDJQ:  Spawn local only                   05050000
* $D5=DWKA315  HBB6608 981015 PDI6:  Spawn DBX Support (DCR A341.01)    05100000
* $01=OW47179  HBB7703 001127 PDAE:  fix masks for flags                05120000
****END OF SPECIFICATIONS*********************************************/ 05150000
*        %GOTO INHEPLS  ;         /* Bilingual header                   05200000
.A411    ANOP  ,                                                        05250000
** BPXYINHE: Inheritance Area                                           05300000
**  Used By: spawn() callable service                                   05350000
         AIF   ('&DSECT' EQ 'NO').B411                                  05400000
INHE                 DSECT ,                                            05450000
         AGO   .C411                                                    05500000
.B411    ANOP  ,                                                        05550000
INHE                 DS    0D                                           05600000
.C411    ANOP  ,                                                        05650000
INHEBEGIN            DS    0D                                           05700000
*                                                                       05750000
INHEEYE              DC    C'INHE'  Eye catcher                         05800000
INHELENGTH           DC    AL2(INHE#LENGTH)                            *05850000
                                  Length of this structure              05900000
INHEVERSION          DC    AL2(INHE#VER)                                05950000
INHE#VER             EQU   2     Version of this structure              06000000
INHEFLAGS            DS    0BL4  Flags indicating contents of structure 06050000
INHEFLAGS0           DS    XL1   1st byte                               06100000
INHESETPGROUP        EQU   X'80' Set Process Group using INHEPGROUP     06150000
INHESETSIGMASK       EQU   X'40' Set Signal Mask using INHESIGMASK      06200000
INHESETSIGDEF        EQU   X'20' Set Signal Defaults using INHESIGDEF   06250000
INHESETTCPGRP        EQU   X'10' Set TTY Pgrp using INHECTLTTYFD  @D3A  06300000
INHESETCWD           EQU   X'08' Set CWD using INHECWDPTR         @D3A  06350000
INHESETUMASK         EQU   X'04' Set UMASK using INHEUMASK        @D3A  06400000
INHESETUSERID        EQU   X'02' Set Userid using INHEUSERID      @D3A  06450000
INHESETREGIONSZ      EQU   X'01' Set Region using INHEREGIONSZ    @D3A  06500000
INHEFLAGS1           DS    XL1   2nd byte                               06550000
INHESETTIMELIMIT     EQU   X'80' Set Timelimit with INHETIMELIMIT @D3A  06600000
INHESETACCTDATA      EQU   X'40' SET ACCTDATA using INHEACCTDATA  @D3A  06650000
INHESETJOBNAME       EQU   X'20' SET JOBNAME using INHEJOBNAME    @D3A  06700000
INHEMUSTBELOCAL      EQU   X'10' Spawn locally or else fail       @D4A  06750000
INHESETDEBUGENV      EQU   X'08' Setup Debug Environment          @D5A  06800000
INHEFLAGS2           DS    XL1   3rd byte                               06850000
INHEFLAGS3           DS    XL1   4th byte                               06900000
INHEPGROUP           DS    F     Process Group for child                06950000
INHE#NEWPGROUP       EQU   0     Put child in a new proc grp of its own 07000000
INHESIGMASK          DS    BL8   Signal Mask for child                  07050000
INHESIGDEF           DS    BL8   Set of default signals for child       07100000
INHECTLTTYFD         DS    F     Cntl TTY FD for tcsetgrp() in child    07150000
INHECWDPTR           DS    F     Pointer to the users CWD         @D3A  07200000
INHECWDLEN           DS    H     Length of the users CWD          @D3A  07250000
INHEACCTDATALEN      DS    H     LENGTH OF THE USERS ACCTDATA     @D3A  07300000
INHEACCTDATAPTR      DS    F     POINTER TO THE USERS ACCTDATA    @D3A  07350000
INHEUMASK            DS    XL4   Users Umask                      @D3A  07400000
INHEUSERID           DS    CL8   New A.S. user identity           @D3A  07450000
INHEJOBNAME          DS    CL8   New A.S. jobname                 @D3A  07500000
INHEREGIONSZ         DS    F     New A.S. region size             @D3A  07550000
INHETIMELIMIT        DS    F     New A.S. Time limit              @D3A  07600000
                     DS    H     reserved                         @D3A  07650000
INHE#LENGTH          EQU   *-INHE                                       07700000
** BPXYINHE End                                                         07750000
         SPACE 3                                                        07800000
         AIF   ('&LIST' EQ 'YES').E411                                  07850000
         POP   PRINT                                                    07900000
.E411    ANOP  ,                                                        07950000
         MEND                                                           08000000
  Terminating PL/X comment                                          */  08050000
*                                                                       08100000
 %INHEPLS : ;                                                           08150000
 %IF INHEBASE='' %THEN                                                  08200000
   %DO;                                                                 08250000
     %INHEBASE='BASED(INHEPtr)';                                        08300000
   %END;                                                                08350000
  %IF INHEBASE='BASED(INHEPtr)' %THEN                                   08400000
    %DO;                                                                08450000
      DCL INHEPtr Ptr(31);         /* Pointer to the INHE            */ 08500000
    %END;                                                               08550000
 DCL                                                                    08600000
  1 Inhe INHEBASE,                /* INHE - Inheritance structure for   08650000
                                     Spawn callable service          */ 08700000
    3 InheEye       Char(4),      /* Eye catcher - 'INHE'            */ 08750000
    3 InheLength    Fixed(16),    /* Length of structure             */ 08800000
    3 InheVersion   Fixed(16),    /* Version number                  */ 08850000
    3 InheFlags     Fixed(32),    /* Flags indicating contents of       08900000
                                     structure                       */ 08950000
     /****************************************************************/ 09000000
     /* When adding flags for new fields be sure to update the mask  */ 09050000
     /* constants for the appropriate version.                       */ 09100000
     /****************************************************************/ 09150000
     5 InheFlags1  Fixed(8),      /* 1st flag byte                   */ 09200000
      7 InheSetPgroup  Bit(1),    /* Set Process Group using InhePgroup 09250000
                                                                     */ 09300000
      7 InheSetSigMask Bit(1),    /* Set Signal Mask using InheSigMask  09350000
                                                                     */ 09400000
      7 InheSetSigDef  Bit(1),    /* Set Signal Defaults using          09450000
                                     InheSigDef                      */ 09500000
      7 InheSetTcPgrp  Bit(1),    /*Set Cntl TTY Pgrp using INHECTLTTYFD09550000
                                                                     */ 09600000
      7 InheSetCwd       Bit(1),  /* CWD was specified           @D3A*/ 09650000
      7 InheSetUmask     Bit(1),  /* Umask was specified         @D3A*/ 09700000
      7 InheSetUserid    Bit(1),  /* Userid was specified        @D3A*/ 09750000
      7 InheSetRegionSz  Bit(1),  /* Region was specified        @D3A*/ 09800000
                                                                        09850000
     5 InheFlags2  Fixed(8),      /* 2nd flag byte                   */ 09900000
      7 InheSetTimeLimit Bit(1),  /* Time limit was specified    @D3A*/ 09950000
      7 InheSetAcctData  Bit(1),  /* AcctData was specified      @D3A*/ 10000000
      7 InheSetJobName   Bit(1),  /* JobName was specified       @D3A*/ 10050000
      7 InheMustBeLocal  Bit(1),  /* Spawn locally or else fail  @D4A*/ 10100000
      7 InheSetDebugEnv  Bit(1),  /* Setup Debug Environment for        10150000
                                     child (Pt_TraceMe)          @D5A*/ 10200000
     5 InheFlags3  Fixed(8),      /* 3rd flag byte                   */ 10250000
     5 InheFlags4  Fixed(8),      /* 4th flag byte                   */ 10300000
    3 InhePgroup   Fixed(32),     /* Process Group for child         */ 10350000
    3 InheSigMask  Bit(64),       /* Signal Mask for child           */ 10400000
    3 InheSigDef   Bit(64),       /* Set of default signals for child*/ 10450000
    3 InheCtlTtyFd Fixed(32),     /* Cntl TTY FD for tcsetpgrp() in     10500000
                                     child                           */ 10550000
    3 InheVer1Len  Char(0),       /* End of Version 1            @D3A*/ 10600000
    3 InheCwdPtr   Ptr(31),       /* Pointer to the users CWD    @D3A*/ 10650000
    3 InheCwdLen   Fixed(16),     /* Length of the users CWD     @D3A*/ 10700000
    3 InheAcctDataLen Fixed(16),  /* Length of Account Data Area @D3A*/ 10750000
    3 InheAcctDataPtr Ptr(31),    /* Ptr to Account Data Area    @D3A*/ 10800000
    3 InheUmask    Fixed(32),     /* Users UMASK                 @D3A*/ 10850000
    3 InheUserid   Char(8),       /* New A.S. user identity      @D3A*/ 10900000
    3 InheJobName  Char(8),       /* New A.S. jobname            @D3A*/ 10950000
    3 InheRegionSz  Fixed(32),    /* New A.S. region size        @D3A*/ 11000000
    3 InheTimelimit Fixed(32),    /* New A.S. Time limit         @D3A*/ 11050000
    3 *             Fixed(16),    /* Reserved                    @D3A*/ 11100000
    3 InheVer2Len  Char(0);       /* End of Version 2            @D3A*/ 11150000
                                                                        11200000
 DCL                                                                    11250000
  Inhe#ID Char(4)  Constant('INHE'),      /* Eye catcher             */ 11300000
  Inhe#Ver Fixed(16) Constant(Inhe#Ver02), /* Current version of control11350000
                                             block               @D3C*/ 11400000
  Inhe#Ver01 Fixed(16) Constant(1),       /* Version 1 of control       11450000
                                             block                   */ 11500000
  Inhe#Ver02 Fixed(16) Constant(2),       /* Version 2 of control       11550000
                                             block               @D3A*/ 11600000
  Inhe#Len01 Fixed(16) Constant(Offset(InheVer1Len)),                   11650000
                          /* Version 1 INHE control block length @D3A*/ 11700000
  Inhe#Len02 Fixed(16) Constant(Offset(InheVer2Len)),                   11750000
                          /* Version 2 INHE control block length @D3A*/ 11800000
  Inhe#Len Fixed(16) Constant(Length(INHE)),/* Length of INHE        */ 11850000
  Inhe#Mask01 Bit(32) Constant('F0180000'X),/* Ver 1 mask for clearing  11939990
                                               extranious bits   @01C*/ 11979980
  Inhe#Mask02 Bit(32) Constant('FFF80000'X),/* Ver 2 mask for clearing  12019970
                                               extranious bits   @01C*/ 12059960
  Inhe#NewPgroup Fixed(32) Constant(0);   /* Indicates to create new    12100000
                                             process group for child */ 12150000
