*        %GOTO NREGPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYNREG  &DSECT=YES,&LIST=YES                                 00150000
         GBLB  &NREG411                                                 00200000
         AIF   (&NREG411 EQ 1).E411                                     00250000
&NREG411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYNREG: OpenMVS BPX2REG (v_reg) parameter list  00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%NREGPRO : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYNREG) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYNREG                                               00850000
*                                                                       00900000
*01* DSECT NAME: N/A                                                    00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Interface Block to VNode Registration            01050000
*                                                                       01100000
*02*   ACRONYM: NREG                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,2000                       */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7703                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01825000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01850000
*01* END OF EXTERNAL CLASSIFICATION:                                    01900000
*                                                                       01950000
*01* FUNCTION:                                                          02000000
*                                                                       02050000
*      The NREG maps the input to the v_register routine, BPXVNREG.     02100000
*                                                                       02150000
*01* METHOD OF ACCESS:                                                  02200000
*                                                                       02250000
*02*   PL/X:                                                            02300000
*                                                                       02350000
*        %INCLUDE SYSLIB(BPXYNREG)                                      02400000
*        By default, the NREG is based on NRegPtr.  If                  02450000
*        other basing is desired, use %NREGBASE='BASED(XXXXXX)'.        02500000
*        If %NREGBASE='BASED(NREGPTR)' is coded, a Declare for          02550000
*        NREGPTR is also generated.                                     02600000
*                                                                       02650000
*02*   ASM:                                                             02700000
*        With DSECT=NO, storage is allocated in line                    02750000
*        and addressability is provided thru that DSECT or CSECT.       02800000
*        With DSECT=YES, a DSECT is produced and "USING NREG,reg"       02850000
*        is required for addressability.  Here "reg" contains the       02900000
*        address of NREG#LEN bytes of storage.                          02950000
*        The default is DSECT=YES.                                      03000000
*                                                                       03050000
*01* SIZE: Release dependent.  Refer to the mapping.                    03100000
*                                                                       03150000
*01* POINTED TO BY: In dynamic storage of routines calling BPXVNREG.    03200000
*                                                                       03250000
*01* CREATED BY: Caller of Syscall Routine                              03300000
*                                                                       03350000
*01* DELETED BY: Caller of Syscall Routine                              03400000
*                                                                       03450000
*01* STORAGE ATTRIBUTES:                                                03500000
*02*   SUBPOOL: n/a                                                     03550000
*02*   KEY: n/a                                                         03600000
*02*   RESIDENCY: Callers storage                                       03650000
*                                                                       03700000
*01* FREQUENCY: 1 per syscall that calls BPXVNREG                       03750000
*                                                                       03800000
*01* SERIALIZATION: N/A                                                 03850000
*                                                                       03900000
*01* DEPENDENCIES: None                                                 03950000
*                                                                       04000000
*01* NOTES:                                                             04050000
*           BPXYVFSI is a C program interface for the BPX1V (v_)        04100000
*           services.  The NREG structure in BPXYVFSI matches           04150000
*           the BPXYNREG structure.                                     04200000
*                                                                       04250000
*01* COMPONENT: OpenMVS (SCPX1)                                         04300000
*                                                                       04350000
*01* DISTRIBUTION LIBRARY:  AMACLIB                              @P1C   04400000
*                                                                       04450000
*01* EYE-CATCHER: NREG                                                  04500000
*02*   OFFSET:  0                                                       04550000
*02*   LENGTH:  4                                                       04600000
*                                                                       04650000
*01* CHANGE-ACTIVITY:                                                   04700000
*                                                                       04750000
*  $D0=DOAA009   HOM1111, 930301, PDAZ: DCR A009.01 NFS                 04800000
*  $D1=DOAA009   HOM1111, 930831, PDAZ: DCR A009.04 NFS                 04850000
*  $D2=DOAA009   HOM1120, 931012, PDAZ: ASM improvements - DCR A009.05  04900000
*  $D3=DOAA009   HOM1120, 940309, PDAZ: Remove MaxBrlmPids (A009.05)    04950000
*  $D3=PPF0011   HOM1130, 940506, PDAZ: Remove MaxBrlmPids (A009.05)    05000000
*  $D4=DPFA089   HOM1130  941017  PDJT: DFS - File Exporters -  A089.01 05050000
*  $D5=DPFA089   HOM1130  950202  PDJT: SNACKETS Dependent PFS  A089.03 05100000
*  $P1=PPF0412   HOM1130, 950502, PDWE: Change Dist Library to AMACLIB  05150000
*  $P2=PRG0143   HOM1140, 960228, PDJV: Change length field to signed   05200000
*  $P3=PUX0480   HBB6605  970828  PDND: Netware STREAMS SFDs            05250000
*                                                                       05300000
****END OF SPECIFICATIONS*********************************************/ 05350000
*        %GOTO NREGPLS  ;         /* Bilingual header                   05400000
.A411    ANOP  ,                                                        05450000
** BPXYNREG: NREG - LFS Registration routine parameter list             05500000
**  Used By:  VRG                                                       05550000
         AIF   ('&DSECT' EQ 'NO').B411                                  05600000
NREG                 DSECT ,                                            05650000
         AGO   .C411                                                    05700000
.B411    ANOP  ,                                                        05750000
                     DS    0D                                           05800000
NREG                 DC    XL(NREG#LENGTH)'00'                          05850000
                     ORG   NREG                                         05900000
.C411    ANOP  ,                                                        05950000
NREGBEGIN            DS    0D                                           06000000
*                                                                       06050000
NREGID               DC    C'NREG'            Eye catcher               06100000
NREGLEN              DC    AL2(NREG#LENGTH)   Length of the structure   06150000
NREGVER              DC    AL2(NREG#VERSION)  NReg version number       06200000
NREGSTYPE            DS    F                  Server Type               06250000
NREGSNAMELEN         DS    F                  Length of Server name     06300000
NREGSNAME            DS    CL32               Server Name               06350000
NREGMAXVNTOKENS      DS    F                  Max # of VNTokens         06400000
NREGFLAGS            DS    CL1                Flags                @D4C 06450000
NREGFXHOTC           EQU   X'80'               Exit uses HOTC      @D4A 06500000
NREGNOWAIT           EQU   X'40'               for Quiesced FS     @D5A 06550000
NREGSECSFD           EQU   X'20'               for SFD severs      @P3A 06600000
NREGRES01            DS    CL3                Reserved field       @D4C 06650000
NREGENDOFVER1        DS    0F                 End of Version 1     @D4A 06700000
NREGFXEXITNAME       DS    CL8                Exit program name    @D4A 06750000
NREGFXINITPARM       DS    CL8                Init parm for Exit   @D4A 06800000
NREGABENDCODE        DS    F                  Abend Code received  @D4A 06850000
NREGABENDRSN         DS    F                  Abend Reason Code    @D4A 06900000
NREGPFSTYPE          DS    CL8                Dependant PFS        @D5A 06950000
*                                                                       07000000
*   Constants                                                           07050000
*                                                                       07100000
NREG#LENGTH          EQU   *-NREGBEGIN        Length of NREG            07150000
NREG#LENGTHVER1      EQU   NREGENDOFVER1-NREGBEGIN  Length of V1 NREG   07200000
NREG#VERSION1        EQU   1                  NReg Version 1            07250000
NREG#VERSION2        EQU   2                  NReg Version 2            07300000
NREG#VERSION         EQU   NREG#VERSION2      NReg Current Version      07350000
*      NRegSType constants                                              07400000
NREGSTYPE#FILE       EQU   1                  File Server type          07450000
NREGSTYPE#LOCK       EQU   2                  Lock Server type          07500000
NREGSTYPE#FEXP       EQU   3                  File Exporter type        07550000
NREGSTYPE#SFDS       EQU   4                  SFD server           @P3A 07600000
NREGSTYPE#MAX        EQU   4                  Max allowed srvr type     07650000
** BPXYNREG End                                                         07700000
         SPACE 3                                                        07750000
         AIF   ('&LIST' EQ 'YES').E411                                  07800000
         POP   PRINT                                                    07850000
.E411    ANOP  ,                                                        07900000
         MEND                                                           07950000
  Terminating PL/X comment  ******************************************/ 08000000
                                                                        08050000
 %NREGPLS : ;                                                           08100000
 %IF NREGBASE='' %THEN                                                  08150000
   %DO;                                                                 08200000
     %NREGBASE='BASED(NREGPTR)';                                        08250000
   %END;                                                                08300000
 %IF TRANSLATE(NREGBASE)='BASED(NREGPTR)' %THEN                         08350000
   %DO;                                                                 08400000
     DCL NRegPtr Ptr(31);         /* Pointer to NReg parameter list  */ 08450000
   %END;                                                                08500000
 DCL                                                                    08550000
  1    NReg       NREGBASE,                                             08600000
   3   NRegID          Char(4),   /* +00 EBCDIC ID                   */ 08650000
   3   NRegLen         Fixed(15), /* +04 Length of NREG structure@P2C*/ 08700000
   3   NRegVer         Fixed(16), /* +06 NReg Version number         */ 08750000
   3   NRegSType       Fixed(32), /* +08 Server type                 */ 08800000
   3   NRegSNameLen    Fixed(31), /* +0C Length of Server name parm  */ 08850000
   3   NRegSName       Char(32),  /* +10 Server Name                 */ 08900000
   3   NRegMaxVNTokens Fixed(32), /* +30 Max # of VNTokens that will    08950000
                                         be created for this server  */ 09000000
   3   NRegFlags       Bit(8),    /* +34 Flags                   @D4C*/ 09050000
     5  NregFxHotc      Bit(1),   /*      Invoke Exit with HOTC  @D4A*/ 09100000
     5  NregNoWait      Bit(1),   /*      for Quiesced File Sys  @D5A*/ 09150000
     5  NregSecSfd      Bit(1),   /*      Secondary SFD srvr     @P3A*/ 09200000
   3   *               Char(3),   /* +35 Reserved                @D4C*/ 09250000
   3   NRegEndOfVer1   Char(0),   /* +38 End of Ver1 ----------  @D4A*/ 09300000
   3   NRegFileExporterArea,      /*                             @D4A*/ 09350000
     5  NregFxExitName Char(8),   /* +38 Exit program name       @D4A*/ 09400000
     5  NregFxInitParm Char(8),   /* +40 Init parm for Exit pgm  @D4A*/ 09450000
   3 NRegAbendCode     Fixed(32), /* +48 Abend Code received     @D4A*/ 09500000
   3 NRegAbendRsn      Fixed(32), /* +4C Abend Reason Code       @D4A*/ 09550000
   3 NRegPfsType       Char(8),   /* +50 Dependant PFS           @D5A*/ 09600000
   3 * Char(0) Bdy(Dword);        /* +58 Ensure NREG ends on            09650000
                                         doubleword boundary         */ 09700000
 DCL                                                                    09750000
   NReg#ID       Char(4)   Constant('NREG'),/* Control Block Acronym */ 09800000
   NReg#LEN      Fixed(15) Constant(Length(NREG)),/* Length of NREG  */ 09850000
   NReg#Version  Fixed(16) Constant(NReg#Version2),/* Current    @D4C*/ 09900000
   NReg#Version1 Fixed(16) Constant(1),     /* Version 1 of NReg     */ 09950000
   NReg#LenVer1  Fixed(16) Constant(Offset(NRegEndOfVer1)),    /*@D4A*/ 10000000
   NReg#Version2 Fixed(16) Constant(2);     /* Version 2 of NReg @D4A*/ 10050000
                                                                        10100000
   /* NRegSType constants                                            */ 10150000
 DCL                                                                    10200000
   NRegSType#FILE Fixed(32) Constant(1),/* File Server           @D1C*/ 10250000
   NRegSType#LOCK Fixed(32) Constant(2),/* Lock Server           @D1A*/ 10300000
   NRegSType#FEXP Fixed(32) Constant(3),/* File Exporter         @D4A*/ 10350000
   NRegSType#SFDS Fixed(32) Constant(4),/* SFD server            @P3A*/ 10400000
   NRegSType#MAX  Fixed(32) Constant(4);/* Max allowed srvr type @P3C*/ 10450000
                                                                        10500000
        /* Note: If new Server types are added, DISPLAY OMVS should     10550000
             be updated as follows:                                     10600000
             (1) In BPXZMDEF, msg BPXO40If, add a type to the array.    10650000
             (2) Recompile BPXMIMST.                                 */ 10700000
                                                                        10750000
