*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYRMON) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYRMON                                               00850000
*                                                                       00900000
*01* DSECT NAME: RMON                                                   00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Resource Monitor Data mapping                    01050000
*                                                                       01100000
*02*   ACRONYM: RMON                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,2000                       */ 01550000
*/*                                                                  */ 01650000
*/* STATUS= HBB7703                                                  */ 01700000
*/*                                                                  */ 01750000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01800000
*/*                                                                     01850000
*                                                                       01875000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* FUNCTION:                                                          02050000
*                                                                       02100000
*      When the Resource Measurement Gatherer service (BPX1RMG) is      02150000
*      called it is passed the address of a storage area in the         02200000
*      callers address space.  The Resource MONitor control block,      02250000
*      BPXYRMON, defines the contents of this storage area on           02300000
*      successful return from BPX1RMG.                                  02350000
*                                                                       02400000
*01* METHOD OF ACCESS:                                                  02450000
*                                                                       02500000
*02*   PL/X:                                                            02550000
*                                                                       02600000
*        %INCLUDE SYSLIB(BPXYRMON)                                      02650000
*        By default, the RMON is based on RmonPtr. If                   02700000
*        other basing is desired, use %RMONBASE='BASED(XXXXXX)'.        02750000
*        If %RMONBASE='BASED(RmonPtr)' is coded, a Declare for          02800000
*        RmonPtr is also generated.                                     02850000
*                                                                       02900000
*02*   ASM:                                                             02950000
*        With DSECT=NO, storage is allocated in line                    03000000
*        and addressability is provided thru that DSECT or CSECT.       03050000
*        With DSECT=YES, a DSECT is produced and "USING RMON,reg"       03100000
*        is required for addressability.  Here "reg" contains the       03150000
*        address of RMON#LENGTH bytes of storage.                       03200000
*        The default is DSECT=YES.                                      03250000
*                                                                       03300000
*01* SIZE: RMON#LENGTH                                                  03350000
*                                                                       03400000
*01* POINTED TO BY: RmonPtr                                             03450000
*                                                                       03500000
*01* CREATED BY: Storage obtained by caller of BPX1RMG                  03550000
*                                                                       03600000
*01* DELETED BY: Caller of BPX1RMG                                      03650000
*                                                                       03700000
*01* STORAGE ATTRIBUTES:                                                03750000
*02*   SUBPOOL/DATASPACE:  N/A                                          03800000
*02*   KEY:                N/A                                          03850000
*02*   RESIDENCY:          N/A                                          03900000
*                                                                       03950000
*01* FREQUENCY: 1 per entry returned by BPX1RMG                         04000000
*                                                                       04050000
*01* SERIALIZATION: N/A                                                 04100000
*                                                                       04150000
*01* DEPENDENCIES: None                                                 04200000
*                                                                       04250000
*01* NOTES: This mapping is only valid if the BPX1RMG callable service  04300000
*           returned successfully.                                      04350000
*                                                                       04400000
*01* COMPONENT: OpenMVS (SCPX1)                                         04450000
*                                                                       04500000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04550000
*                                                                       04600000
*01* EYE-CATCHER: RMON                                                  04650000
*02*   OFFSET:  0                                                       04700000
*02*   LENGTH:  4                                                       04750000
*                                                                       04800000
*01* CHANGE-ACTIVITY:                                                   04850000
*                                                                       04900000
* $L0=POSIXXA  HOM1130 921201 PDP1: OpenMVS Initial Release             04950000
* $D1=DL70019  HOM1130 921201 PDJM: Assembler macro fixup               05000000
* $P1=PL70597  HOM1130 930104 PDJM: Use "OpenMVS"                       05050000
* $D2=DPFA051  HOM1130 940315 PDAX: A051.03 Initial XPG4 IPC PC         05100000
* $D3=DPFA065  HOM1130 940408 PDJI: A065.03 mmap support                05150000
* $D4=DPFA079  HOM1130 950208 PDI6: A079.13 SQA Control Support         05200000
* $D5=DXDA382  HBB7703 990817 PDQR: A382.00 Enhance RMF Support         05216600
*                                                                       05233200
****END OF SPECIFICATIONS*********************************************/ 05250000
*        %GOTO RMONPRO  ;         /* Bilingual header                   05253800
         MACRO                                                          05257600
         BPXYRMON  &DSECT=YES,&LIST=YES                       8@D1A     05261400
         GBLB  &RMON411                                                 05265200
         AIF   (&RMON411 EQ 1).E411                                     05269000
&RMON411 SETB  1                                                        05272800
         AIF   ('&LIST' EQ 'YES').A411                                  05276600
         PUSH  PRINT  BPXYRMON: Resource monitor data mapping           05280400
         PRINT OFF                                                      05284200
         AGO   .A411                                                    05288000
*                                  */                                   05291800
*%RMONPRO : ;                                                           05295600
*        %GOTO RMONPLS  ;         /* Bilingual header                   05300000
.A411    ANOP  ,                                                        05350000
** BPXYRMON: Resource monitor data mapping                              05400000
**  Used By: RMG                                                        05450000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     05500000
RMON                 DSECT ,                                            05550000
         AGO   .C411                                                    05600000
.B411    ANOP  ,                                                        05650000
RMON                 DS    0F                                           05700000
.C411    ANOP  ,                                                        05750000
RMONID               DC    C'RMON'  Eye catcher                         05800000
RMONLENGTH           DC    A(RMON#LENGTH)  Length of this structure     05850000
RMONSYSCALLS         DS    F      Total  Syscalls.         This         05900000
*                                 includes syscalls done internally     05950000
*                                 by the kernel.  It does not include   06000000
*                                 all trivial syscalls.                 06050000
RMONCPUTIME          DS    F      Total CPU time spent in               06100000
*                                 kernel (Hundredths of a second)       06150000
RMONOVERRUN          DS    0CL12                                        06200000
RMONOVRPROC          DS    F      Count of times the maximum number     06250000
*                                 of processes was exceeded.            06300000
RMONOVRUID           DS    F      Count of times the maximum number     06350000
*                                 of active UIDs was exceeded.          06400000
RMONOVRPRUID         DS    F      Count of times the maximum number     06450000
*                                 of processes per UID was exceeded.    06500000
RMONLIMITS           DS    0CL6                                         06550000
RMONMAXPROC          DS    H      Maximum number of processes           06600000
RMONMAXUID           DS    H      Maximum number of active UIDs         06650000
RMONMAXPRUID         DS    H      Maximum number of processes per UID   06700000
RMONCURRENT          DS    0CL6                                    @D2C 06750000
RMONNUMPROC          DS    H      Current number of processes           06800000
RMONNUMUID           DS    H      Current number of active UIDs         06850000
                     DS    H      Reserved                              06900000
RMONOVERRUNIPC       DS    0CL16                                   @D2A 06950000
RMONOVRIPCMSGNIDS    DS    F      Number of attempts to exceed          07000000
*                                 maximum number of message queue       07050000
*                                 IDs                              @D2A 07100000
RMONOVRIPCSEMNIDS    DS    F      Number of attempts to exceed          07150000
*                                 maximum number of semaphore           07200000
*                                 IDs                              @D2A 07250000
RMONOVRIPCSHMNIDS    DS    F      Number of attempts to exceed          07300000
*                                 maximum number of shared memory       07350000
*                                 IDs                              @D2A 07400000
RMONOVRIPCSHMSPGS    DS    F      Number of attempts to exceed          07450000
*                                 maximum number of shared memory       07500000
*                                 pages for all segments           @D2A 07550000
RMONLIMITSIPC        DS    0CL16                                   @D2A 07600000
RMONMAXIPCMSGNIDS    DS    F      Maximum number of message queue       07650000
*                                 IDs                              @D2A 07700000
RMONMAXIPCSEMNIDS    DS    F      Maximum number of semaphore           07750000
*                                 IDs                              @D2A 07800000
RMONMAXIPCSHMNIDS    DS    F      Maximum number of shared memory       07850000
*                                 IDs                              @D2A 07900000
RMONMAXIPCSHMSPGS    DS    F      Maximum number of shared memory       07950000
*                                 pages for all segments           @D2A 08000000
RMONCURRENTIPC       DS    0CL16                                   @D2A 08050000
RMONNUMIPCMSGNIDS    DS    F      Current number of message queue       08100000
*                                 IDs                              @D2A 08150000
RMONNUMIPCSEMNIDS    DS    F      Current number of semaphore           08200000
*                                 IDs                              @D2A 08250000
RMONNUMIPCSHMNIDS    DS    F      Current number of shared memory       08300000
*                                 IDs                              @D2A 08350000
RMONNUMIPCSHMSPGS    DS    F      Current number of shared memory       08400000
*                                 pages for all segments           @D2A 08450000
RMONOVRMMAPAREA      DS    F      Number of attempts to exceed          08500000
*                                 maximum number of mmap storage        08550000
*                                 pages                            @D3A 08600000
RMONMAXMMAPAREA      DS    F      Maximum number of mmap storage        08650000
*                                 pages                            @D3A 08700000
RMONNUMMMAPPAGES     DS    F      Current number of mmap storage        08750000
*                                 pages (in use)                   @D3A 08800000
RMONMAXSHRPAGES      DS    F      Maximum number of shared storage      08850000
*                                 pages as specified by BPXPRMXX        08900000
*                                 parmlib statement MAXSHAREPAGES  @D4A 08950000
RMONNUMSHRPAGES      DS    F      Current number of shared storage      09000000
*                                 pages                            @D4A 09050000
RMONOVRSHRPAGES      DS    F      Number of attempts to exceed          09100000
*                                 maximum number of shared storage      09150000
*                                 pages                            @D4A 09200000
RMONMAXSHRLIBRGN     DS    F      Maximum amount of storage available   09203100
*                                 for shared library region as          09206200
*                                 specified by parmlib statement        09209300
*                                 SHRLIBRGNSIZE in megabytes       @D5A 09212400
RMONCURSHRLIBRGN     DS    F      Current amount of shared library      09215500
*                                 storage allocated in megabytes   @D5A 09218600
RMONOVRSHRLIBRGN     DS    F      Number of attempts to exceed maximum  09221700
*                                 storage amount for shared library     09224800
*                                 region                           @D5A 09227900
RMONMAXQUEUEDSIGS    DS    F      Maximum amount of queued signals      09231000
*                                 allowed per process as specified      09234100
*                                 by parmlib statement                  09237200
*                                 MAXQUEUEDSIGS                    @D5A 09240300
RMONOVRQUEUEDSIGS    DS    F      Number of attempts to exceed maximum  09243400
*                                 number of queued signals         @D5A 09246500
RMON#LENGTH          EQU   *-RMON Length of RMON                        09250000
** BPXYRMON End                                                         09300000
         SPACE 3                                                        09350000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     09400000
         POP   PRINT                                                    09450000
.E411    ANOP  ,                                                        09500000
         MEND                                                           09550000
* Terminating PL/X comment                                          */  09600000
*                                                                       09650000
*%RMONPLS : ;                                                           09700000
*%IF RMONBASE='' %THEN                                                  09750000
*  %DO;                                                                 09800000
*    %RMONBASE='Based(RmonPtr)';                                        09850000
*  %END;                                                                09900000
* %IF RMONBASE='Based(RmonPtr)' %THEN                                   09950000
*   %DO;                                                                10000000
*     DCL RmonPtr Ptr(31);           /* Pointer to the RMON          */ 10050000
*   %END;                                                               10100000
* %IF RMONVIA='VIA(RmonAlet)' %THEN                                     10150000
*    %DO;                                                               10200000
*      Dcl RmonAlet Ptr(31);       /* Alet of the RMON               */ 10250000
*    %END;                                                              10300000
*DCL                                                                    10350000
* 1 Rmon          RMONBASE RMONVIA,                                     10400000
*   3 RmonID          Char(04),   /* EBCDIC ID - RMON                */ 10450000
*   3 RmonLength     Fixed(32),   /* Length of the control block     */ 10500000
*   3 RmonSyscalls   Fixed(32),   /* Total  syscalls.                   10550000
*                                    This includes syscalls done        10600000
*                                    internally by the kernel.  It does 10650000
*                                    not include all trivial syscalls*/ 10700000
*   3 RmonCPUtime    Fixed(32),   /* Total CPU time spent in            10750000
*                                    kernel (hundredths of a second) */ 10800000
*   3 RmonOverrun,                                                      10850000
*     5 RmonOvrProc  Fixed(32),   /* Count of times the maximum number  10900000
*                                    of processes was exceeded.      */ 10950000
*     5 RmonOvrUid   Fixed(32),   /* Count of times the maximum number  11000000
*                                    of active UIDs was exceeded.    */ 11050000
*     5 RmonOvrPrUid Fixed(32),   /* Count of times the maximum number  11100000
*                                    of processes per UID was           11150000
*                                    exceeded.                       */ 11200000
*   3 RmonLimits,                                                       11250000
*     5 RmonMaxProc  Fixed(16),   /* Maximum number of processes     */ 11300000
*     5 RmonMaxUid   Fixed(16),   /* Maximum number of active UIDs   */ 11350000
*     5 RmonMaxPrUid Fixed(16),   /* Maximum number of processes        11400000
*                                    per UID                         */ 11450000
*   3 RmonCurrent,                                                      11500000
*     5 RmonNumProc  Fixed(16),   /* Current number of processes     */ 11550000
*     5 RmonNumUid   Fixed(16),   /* Current number of active UIDs   */ 11600000
*     5 *            Fixed(16),   /* Unused                      @D2A*/ 11650000
*   3 RmonOverrunIpc,             /*                             @D2A*/ 11700000
*     5 RmonOvrIpcMsgNIDs Fixed(32), /* Number of attempts to exceed    11750000
*                                    maximum number of message queue    11800000
*                                    IDs                         @D2A*/ 11850000
*     5 RmonOvrIpcSemNIDs Fixed(32), /* Number of attempts to exceed    11900000
*                                    maximum number of semaphore        11950000
*                                    IDs                         @D2A*/ 12000000
*     5 RmonOvrIpcShmNIDs Fixed(32), /* Number of attempts to exceed    12050000
*                                    maximum number of shared memory    12100000
*                                    IDs                         @D2A*/ 12150000
*     5 RmonOvrIpcShmSPgs Fixed(32), /* Number of attempts to exceed    12200000
*                                    maximum number of shared memory    12250000
*                                    pages for all segments      @D2A*/ 12300000
*   3 RmonLimitsIpc,              /*                             @D2A*/ 12350000
*     5 RmonMaxIpcMsgNIDs Fixed(32), /* Maximum number of message queue 12400000
*                                    IDs                         @D2A*/ 12450000
*     5 RmonMaxIpcSemNIDs Fixed(32), /* Maximum number of semaphore     12500000
*                                    IDs                         @D2A*/ 12550000
*     5 RmonMaxIpcShmNIDs Fixed(32), /* Maximum number of shared memory 12600000
*                                    IDs                         @D2A*/ 12650000
*     5 RmonMaxIpcShmSPgs Fixed(32), /* Maximum number of shared memory 12700000
*                                    pages for all segments      @D2A*/ 12750000
*   3 RmonCurrentIpc,             /*                             @D2A*/ 12800000
*     5 RmonNumIpcMsgNIDs Fixed(32), /* Current number of message queue 12850000
*                                    IDs                         @D2A*/ 12900000
*     5 RmonNumIpcSemNIDs Fixed(32), /* Current number of semaphore     12950000
*                                    IDs                         @D2A*/ 13000000
*     5 RmonNumIpcShmNIDs Fixed(32), /* Current number of shared memory 13050000
*                                    IDs                         @D2A*/ 13100000
*     5 RmonNumIpcShmSPgs Fixed(32), /* Current number of shared memory 13150000
*                                    pages for all segments      @D2A*/ 13200000
*   3 RmonOverrunMmap,            /*                             @D3A*/ 13250000
*     5 RmonOvrMmapArea   Fixed(32), /* Number of attempts to exceed    13300000
*                                    maximum number of mmap storage     13350000
*                                    pages                       @D3A*/ 13400000
*   3 RmonLimitsMmap,             /*                             @D3A*/ 13450000
*     5 RmonMaxMmapArea   Fixed(32), /* Maximum number of mmap storage  13500000
*                                    pages                       @D3A*/ 13550000
*   3 RmonCurrentMmap,            /*                             @D3A*/ 13600000
*     5 RmonNumMmapPages  Fixed(32), /* Current number of mmap storage  13650000
*                                    pages in use                @D3A*/ 13700000
*   3 RmonLimitsShrPages,         /*                             @d3a*/ 13750000
*     5 RmonMaxShrPages   Fixed(32), /*Maximum number of shared storage 13800000
*                                    pages (MAXSHAREPAGES())     @D4A*/ 13850000
*   3 RmonCurrentShrPages,        /*                             @d3a*/ 13900000
*     5 RmonNumShrPages   Fixed(32), /*Current number of shared storage 13950000
*                                    pages                       @D4A*/ 14000000
*   3 RmonOverrunShrPages,        /*                             @D4A*/ 14050000
*     5 RmonOvrShrPages   Fixed(32), /* Number of attempts to exceed    14100000
*                                    maximum amount of shared storage   14150000
*                                    pages (MAXSHAREPAGES())     @D4A*/ 14200000
*   3 RmonMaxShrLibRgn    Fixed(32), /* Maximum amount of storage       14250000
*                                       available for shared library    14300000
*                                       region as specified by parmlib  14350000
*                                       statement SHRLIBRGNSIZE         14400000
*                                       in megabytes             @D5A*/ 14450000
*   3 RmonCurShrLibRgn    Fixed(32), /* Current amount of shared        14500000
*                                       library storage allocated       14550000
*                                       in megabytes             @D5A*/ 14600000
*   3 RmonOvrShrLibRgn    Fixed(32), /* Number of attempts to exceed    14650000
*                                       maximum storage amount for      14700000
*                                       shared library region           14750000
*                                                                @D5A*/ 14800000
*   3 RmonMaxQueuedSigs   Fixed(32), /* Maximum amount of queued        14850000
*                                       signals allowed per process as  14900000
*                                       specified by parmlib statement  14950000
*                                       MAXQUEUEDSIGS            @D5A*/ 15000000
*   3 RmonOvrQueuedSigs   Fixed(32); /* Number of attempts to exceed    15050000
*                                       maximum number of queued        15100000
*                                       signals                  @D5A*/ 15150000
*                                                               @SPACE; 15200000
*DCL Rmon#ID      Char(4)   Constant('RMON'); /* RMON identifier     */ 15250000
*DCL Rmon#Length  Fixed(32) Constant(Length(RMON)); /* Length of RMON*/ 15300000
