*        %GOTO PGTHPRO ;        /* Bilingual header                     00050000
         MACRO                                                          00100000
         BPXYPGTH  &DSECT=YES,&LIST=YES                                 00150000
         LCLA  &VAR                                                     00200000
         GBLB  &PGTH411                                                 00250000
         AIF   (&PGTH411 EQ 1).E411                                     00300000
&PGTH411 SETB  1                                                        00350000
         AIF   ('&LIST' EQ 'YES').A411                                  00400000
         PUSH  PRINT  BPXYPGTH: __getthent input/output structures      00450000
         PRINT OFF                                                      00500000
         AGO   .A411                                                    00550000
*                               */                                      00600000
*%PGTHPRO : ;                                                           00650000
*/****START OF SPECIFICATIONS****************************************** 00700000
*  $MAC (BPXYPGTH) COMP(SCPX1) PROD(BPX):                               00750000
*01* MACRO NAME: BPXYPGTH                                               00800000
*01* DSECT NAME: BPXYPGTH                                               00850000
*              Y     Y    PPPPPP     GGGGG     TTTTTTT   H     H        00900000
*               Y   Y     P     P   G     G       T      H     H        00950000
*                Y Y      P     P   G             T      H     H        01000000
*   B  P  X       Y       PPPPPP    G             T      HHHHHHH        01050000
*                 Y       P         G  GGGG       T      H     H        01100000
*                 Y       P         G     G       T      H     H        01150000
*                 Y       P          GGGGG        T      H     H        01200000
*01* DESCRIPTIVE NAME: __getthent input and output data mapping         01250000
*02*   ACRONYM: PGTH                                                    01300000
**/                                                                     01350000
*/*01* PROPRIETARY STATEMENT=                                        */ 01400000
*/***PROPRIETARY_STATEMENT********************************************/ 01450000
*/*                                                                  */ 01500000
*/*                                                                  */ 01525000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01550000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01600000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1999,2000                       */ 01650000
*/*                                                                  */ 01700000
*/* STATUS= HBB7703                                                  */ 01750000
*/*                                                                  */ 01800000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01850000
*/*                                                                     01900000
*                                                                       01925000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01950000
*01* END OF EXTERNAL CLASSIFICATION:                                    02000000
*                                                                       02050000
*01* FUNCTION:  Provides PL/S and BAL mapping of the output information 02100000
*               returned by the getthent (BPX1GTH) service routine.     02150000
*01* METHOD OF ACCESS:                                                  02200000
*02*   PL/X:  %INCLUDE(BPXYPGTH)                                        02250000
*             To contain the mapping of the OpenMVS getpsent            02300000
*02*   ASM:                                                             02350000
*        With DSECT=NO, storage is allocated in line                    02400000
*        and addressability is provided thru that DSECT or CSECT.       02450000
*        With DSECT=YES, a DSECT is produced and "USING PGTH,reg"       02500000
*        and "USING PGTHPARM,reg" are required for addressability.      02550000
*01* POINTED TO BY: Local to caller                                     02600000
*01* CREATED BY: Caller.                                                02650000
*01* DELETED BY: Caller.                                                02700000
*01* STORAGE ATTRIBUTES:                                                02750000
*02*   SUBPOOL:   As defined by the caller.                             02800000
*02*   KEY:       User's key                                            02850000
*02*   RESIDENCY: Invoker's primary address space                       02900000
*01* FREQUENCY: N/A                                                     02950000
*01* SERIALIZATION: N/A                                                 03000000
*01* NOTES: Length of PGTH and PGTHParm is used to determine when the   03050000
*      invoker and SYSCALL are not using the same level BPXYPGTH.       03100000
*01* COMPONENT: OpenMVS (SCPX1)                                         03150000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     03200000
*01* EYE-CATCHER: None.                                                 03250000
*01* CHANGE-ACTIVITY:                                                   03300000
* $D0=DWAA247 JBB6607 980209 PDJM: A247.01 RAS - Task level debugging   03350000
* $P0=PWA0086 JBB6607 980406 PDJM: Add Pgth#Flag1Mask for JrBadOptions  03400000
* $P1=PWA0132 JBB6607 980506 PDJM: Remove PprtExitStatus                03450000
* $P2=PWA0148 JBB6607 980511 PDJM: ASM PGTHGCOUNT ^= PLX (was FL2)      03500000
* $P3=PWK0748 HBB6608 990216 PDJM: Report zombie processes              03525000
* $P4=PWY0307 JBB6609 990409 PDJM: Switch from MVS to ALIAS LoginName   03537500
****END OF SPECIFICATIONS*********************************************/ 03550000
*        %GOTO PGTHPLS ;        /* Bilingual header                     03600000
.A411    ANOP  ,                                                        03650000
** BPXYPGTH: __getthent input and output structures                     03700000
**  Used By: GTH                                                        03750000
PGTHA                 DSECT ,        I N P U T - - - - - - - - - - -    03800000
PGTHACONTINUE         DS    0CL14                                       03850000
PGTHAPID              DS    F        PROCESS ID (IGNORED IF FIRST)      03900000
PGTHATHID             DS    CL8      THREAD ID (IGNORED IF FIRST/LAST)  03950000
PGTHAACCESSPID        DS    FL1      FIRST, CURRENT, NEXT               04000000
PGTH#NEXT             EQU   2        NEXT AFTER SPECIFIED               04050000
PGTH#CURRENT          EQU   1        AS SPECIFIED                       04100000
PGTH#FIRST            EQU   0        FIRST (EQUIV NEXT WITH PID=0)      04150000
PGTH#LAST             EQU   3        only with PGTHIACCESSTHID          04200000
                      SPACE ,                                           04250000
PGTHAACCESSTHID       DS    FL1      FIRST, CURRENT, NEXT, LAST         04300000
* ONLY FLAG1 BITS THREAD AND PTAG WILL BE CONSIDERED WHEN               04350000
* ACCESSPID=CURRENT AND ACCESSTHID=NEXT                                 04400000
                      SPACE ,                                           04450000
* ASID AND LOGINNAME FILTERS APPLY ONLY WHEN ACCESSPID = FIRST, NEXT    04500000
PGTHAASID             DS    FL2      FILTER - ASID                      04550000
* LOGINNAME COMPARISON WILL LOOK FOR UNIX ALIAS. IF PGHTALOGINNAME      04570000
* IS NOT AN ALIAS, IT WILL BE SHIFTED TO UPPER CASE AND CHECKED         04590000
* AGAINST MVS ID.                                                       04610000
PGTHALOGINNAME        DS    CL8      FILTER - USERID ALIAS OR MVS       04630000
                      SPACE ,                                           04650000
PGTHAFLAG1            DS    FL1      WHAT OUTPUT AREAS TO INCLUDE       04700000
PGTHAPROCESS          EQU   X'80'      PGTHC, PROCESS DATA              04750000
PGTHACONTTY           EQU   X'40'      PGTHD, CONTTY                    04800000
PGTHAPATH             EQU   X'20'      PGTHE, PATH                      04850000
PGTHACOMMAND          EQU   X'10'      PGTHF, CMD & ARGS                04900000
PGTHAFILEDATA         EQU   X'08'      PGTHG, FILE DATA                 04950000
PGTHATHREAD           EQU   X'04'      PGTHJ, THREAD DATA               05000000
PGTHAPTAG             EQU   X'02'      PGTHK, PTAG (NEEDS PGTHJ)        05050000
                      DS    FL1                                         05100000
PGTHA#LEN             EQU   *-PGTHA                                     05150000
                      SPACE ,                                           05200000
PGTHB                 DSECT ,        O U T P U T - - - - - - - - - -    05250000
PGTHBID               DS    CL4      "gthb"                             05300000
PGTHBCONTINUE         DS    0CL14    NEXT VALUE FOR PGTHACONTINUE       05350000
PGTHBPID              DS    F        PROCESS ID                         05400000
PGTHBTHID             DS    CL8      THREAD ID                          05450000
PGTHBACCESSPID        DS    FL1      CURRENT/FIRST/NEXT                 05500000
PGTHBACCESSTHID       DS    FL1      CURRENT/FIRST/NEXT/LAST            05550000
                      DS    FL2                                         05600000
PGTHBLENUSED          DS    F        LENGTH OF OUTPUT BUFFER USED       05650000
PGTHBLIMITC           DS    CL1      N, A                               05700000
PGTHBOFFC             DS    FL3      OFFSET OF PROCESS AREA             05750000
PGTHBLIMITD           DS    CL1      N, A, X                            05800000
PGTHBOFFD             DS    FL3      OFFSET OF CONTTY  AREA             05850000
PGTHBLIMITE           DS    CL1      N, A, X                            05900000
PGTHBOFFE             DS    FL3      OFFSET OF PATH    AREA             05950000
PGTHBLIMITF           DS    CL1      N, A, X                            06000000
PGTHBOFFF             DS    FL3      OFFSET OF COMMAND AREA             06050000
PGTHBLIMITG           DS    CL1      N, A, X                            06100000
PGTHBOFFG             DS    FL3      OFFSET OF FILE DATA AREA           06150000
PGTHBLIMITJ           DS    CL1      N, A, V, X                         06200000
PGTHBOFFJ             DS    FL3      OFFSET OF THREAD AREA              06250000
PGTHB#LEN             EQU   *-PGTHB                                     06300000
                      SPACE ,                                           06350000
* VALUES FOR PGTH.LIMIT. FIELDS                                         06400000
PGTH#NOTREQUESTED     EQU   C'N'     Associated PghtA.. bit off         06450000
PGTH#OK               EQU   C'A'     All data included                  06500000
PGTH#STORAGE          EQU   C'S'     output buffer exhausted            06550000
* EXHAUSTED STORAGE < 1ST PGTHJ RESULTS IN -1 EINVAL JRBUFFTOOSMALL     06600000
PGTH#VAGUE            EQU   C'V'     Changed out from under us          06650000
PGTH#NOTCONNECTED     EQU   C'X'     Need data not connected            06700000
                      SPACE ,                                           06750000
* USING PGTHC,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFC                06800000
PGTHC                 DSECT ,        P R O C E S S - - - - - - - - -    06850000
PGTHCID               DS    CL4      "gthc"                             06900000
PGTHCFLAG1            DS    FL1                                         06950000
PGTHCMULPROCESS       EQU   X'80'    MULTIPLE PROCESSES                 07000000
PGTHCSWAP             EQU   X'40'    TCBOUT                             07050000
PGTHCTRACE            EQU   X'20'    THREAD IS BEING TRACED             07100000
PGTHCSTOPPED          EQU   X'10'    STOPPED                            07150000
PGTHCINCOMPLETE       EQU   X'08'    NOT ALL BLOCKS PRESENT             07200000
PGTHCZOMBIE           EQU   X'04'    PROCESS IS A ZOMBIE                07225000
                      DS    3FL1                                        07250000
PGTHCPID              DS    F        PROCESS ID                         07300000
PGTHCPPID             DS    F        PARENT ID                          07350000
PGTHCPGPID            DS    F        PROCESS GROUP                      07400000
PGTHCSID              DS    F        SESSION ID                         07450000
PGTHCFGPID            DS    F        FOREGROUND PROCESS GROUP           07500000
PGTHCEUID             DS    F        EFFECTIVE USER ID                  07550000
PGTHCRUID             DS    F        REAL USER ID                       07600000
PGTHCSUID             DS    F        SAVED SET USER ID                  07650000
PGTHCEGID             DS    F        EFFECTIVE GROUP ID                 07700000
PGTHCRGID             DS    F        REAL GROUP ID                      07750000
PGTHCSGID             DS    F        SAVED SET GROUP ID                 07800000
PGTHCTSIZE            DS    F        TOTAL SIZE                         07850000
PGTHCSYSCALLCOUNT     DS    F        COUNT OF SLOW-PATH SYSCALLS        07900000
PGTHCUSERTIME         DS    F        TIME SPENT IN USER CODE            07950000
PGTHCSYSTIME          DS    F        TIME SPENT IN SYSTEM CODE          08000000
PGTHCSTARTTIME        DS    F        TIME PROCESS WAS DUBBED            08050000
PGTHCCNTOE            DS    FL2      NO. OE THREADS                     08100000
PGTHCCNTPTCREATED     DS    FL2      NO. PTHREAD CREATED THREADS        08150000
PGTHCCNTTHREADS       DS    FL2      COUNT OF ALL THREADS               08200000
PGTHCASID             DS    FL2      ADDRESS SPACE ID                   08250000
PGTHCJOBNAME          DS    CL8      MVS JOB NAME                       08300000
PGTHCLOGINNAME        DS    CL8      LOGIN NAME - ALIAS OR MVS          08350000
PGTHC#LEN             EQU   *-PGTHC                                     08400000
                      SPACE ,                                           08450000
* USING PGTHD,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFD                08500000
PGTHD                 DSECT ,        C O N T T Y - - - - - - - - - -    08550000
PGTHDID               DS    CL4      "gthd"                             08600000
PGTHDLEN              DS    FL2      Length of ConTty                   08650000
PGTHDCONTTY           DS    CL1024   1024 = max ConTty                  08700000
                      SPACE ,                                           08750000
* USING PGTHE,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFE                08800000
PGTHE                 DSECT ,        P A T H - - - - - - - - - - - -    08850000
PGTHEID               DS    CL4      "gthe"                             08900000
PGTHELEN              DS    FL2      Length of Path                     08950000
PGTHEPATH             DS    CL1024   1024 = max path                    09000000
                      SPACE ,                                           09050000
* USING PGTHF,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFF                09100000
PGTHF                 DSECT ,        C O M M A N D - - - - - - - - -    09150000
PGTHFID               DS    CL4      "gthf"                             09200000
PGTHFLEN              DS    FL2      Length of command and arguments    09250000
PGTHFCOMMAND          DS    CL1024   1024 = max command                 09300000
                      SPACE ,                                           09350000
* USING PGTHG,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFG                09400000
PGTHG                 DSECT ,        F I L E   H E A D E R - - - - -    09450000
PGTHGID               DS    CL4      "gthg"                             09500000
PGTHGLIMITH           DS    CL1      N, A, S, X                         09550000
PGTHGOFFH             DS    FL3      Offset of PgthH                    09600000
PGTHGCOUNT            DS    F        Count of PgthH elements            09650000
PGTHGMAXVNODETOKENS   DS    F        MAX NUMBER VNODE TOKENS            09700000
PGTHGVNODETOKENCOUNT  DS    F        CURRENT NUMBER VNODE TOKENS        09750000
PGTHGSERVERFLAGS      DS    F        SABFLAGS                           09800000
PGTHGSERVERNAME       DS    CL32     SABSERVERNAME SERVER=              09850000
PGTHGACTIVEFILES      DS    F        SABVDECOUNT   AF=                  09900000
PGTHGMAXFILES         DS    F        SABMAXVDES    MF=                  09950000
PGTHGSERVERTYPE       DS    F        SABSERVERTYPE TYPE=                10000000
PGTHG#LEN             EQU   *-PGTHG                                     10050000
                      SPACE ,                                           10100000
PGTHGARRAY            DS    0C       first PGTHH                        10150000
                      SPACE ,                                           10200000
* USING PGTHH,Rx where Rx = ADDRESS of PGTHB + PGHTGOFFH                10250000
* Increment   Rx by PGTHH#LEN until PGTHGCOUNT exhausted                10300000
PGTHH                 DSECT ,        F I L E   D A T A - - - - - - -    10350000
PGTHHID               DS    CL2                                         10400000
PGTHH#IDR             EQU   C'rd'    root directory    (first)          10450000
PGTHH#IDC             EQU   C'cd'    current directory (second)         10500000
PGTHH#IDF             EQU   C'fd'    file directory                     10550000
PGTHH#IDV             EQU   C'vd'    vnode directory                    10600000
PGTHHTYPE             DS    BL1      Mapped in BPXYFTYP see FT_DIR +    10650000
PGTHHOPEN             DS    BL1      Mapped in BPXYOPNF see O_FLAGS4    10700000
PGTHHINODE            DS    F        I-NODE        see stat()           10750000
PGTHHDEVNO            DS    F        DEVICE NUMBER see stat()           10800000
PGTHH#LEN             EQU   *-PGTHH                                     10850000
                      SPACE ,                                           10900000
* USING PGTHJ,Rx where Rx = ADDRESS of PGTHB + PGTHBOFFJ                10950000
* Reset Rx to be PGTHB + PGTHJOFFJ for the next thread                  11000000
PGTHJ                 DSECT ,        T H R E A D - - - - - - - - - -    11050000
PGTHJID               DS    CL4      "gthj"                             11100000
PGTHJLIMITJ           DS    CL1      A, S, X                            11150000
PGTHJOFFJ             DS    FL3      Offset of next PgthJ               11200000
PGTHJLIMITK           DS    CL1      N, A, S, X                         11250000
PGTHJOFFK             DS    FL3      Offset of PgthK, this thread       11300000
PGTHJTHID             DS    CL8      THREAD ID                          11350000
PGTHJSYSCALL          DS    CL4      SYSCALL (eg. "1FRK" for fork)      11400000
PGTHJTCB              DS    A        TCB ADDRESS                        11450000
PGTHJTTIME            DS    F        TIME RUNNING .001 SECS             11500000
PGTHJWTIME            DS    F        OE WAITING TIME .001 SECS          11550000
                      DS    F         space                             11600000
PGTHJSEMNUM           DS    H        SEMAPHORE NUMBER IF STATUS2=D      11650000
PGTHJSEMVAL           DS    H        SEMAPHORE VALUE  IF STATUS2=D      11700000
PGTHJLATCHWAITPID     DS    F        LATCH PROCESS ID WAITED FOR        11750000
PGTHJPENMASK          DS    XL8      SIGNAL PENDING MASK                11800000
PGTHJLOGINNAME        DS    CL8      LOGIN NAME - ALIAS or MVS          11850000
PGTHJPREVSC           DS    5CL4     LAST FIVE SYSCALLS                 11900000
PGTHJSTATUSCHARS      DS    0CL5     STATUS                             11950000
                      SPACE ,                                           12000000
PGTHJSTATUS1          DS    CL1      STATUS 1                           12050000
PGTHJ#PthdCreated     EQU   C'J'       pthread created                  12100000
                      SPACE ,                                           12150000
PGTHJSTATUS2          DS    CL1      STATUS 2                           12200000
PGTHJ#MsgRcv          EQU   C'A'       msgrcv wait                      12250000
PGTHJ#MsgSnd          EQU   C'B'       msgsnd wait                      12300000
PGTHJ#WaitC           EQU   C'C'       communication wait               12350000
PGTHJ#Semop           EQU   C'D'       see PgthJSemVal/SemNum           12400000
PGTHJ#WaitF           EQU   C'F'       file system wait                 12450000
PGTHJ#MVSPause        EQU   C'G'       MVS in pause                     12500000
PGTHJ#WaitO           EQU   C'K'       other kernel wait                12550000
PGTHJ#WaitP           EQU   C'P'       PTwaiting                        12600000
PGTHJ#Run             EQU   C'R'       running / non-kernel wait        12650000
PGTHJ#Sleep           EQU   C'S'       sleep                            12700000
PGTHJ#Child           EQU   C'W'       waiting for child                12750000
PGTHJ#Fork            EQU   C'X'       fork new process                 12800000
PGTHJ#MVSWait         EQU   C'Y'       MVS wait                         12850000
                      SPACE ,                                           12900000
PGTHJSTATUS3          DS    CL1      STATUS 3                           12950000
PGTHJ#MediumWght      EQU   C'N'       medium weight thread             13000000
PGTHJ#Async           EQU   C'O'       asynchronous thread              13050000
PGTHJ#IPT             EQU   C'U'       Initial process thread           13100000
PGTHJ#Zombie          EQU   C'Z'       Process terminated and parent    13150000
*                                           has not completed wait      13200000
                      SPACE ,                                           13250000
PGTHJSTATUS4          DS    CL1      STATUS 4                           13300000
PGTHJ#Detached        EQU   C'V'       thread is detached               13350000
                      SPACE ,                                           13400000
PGTHJSTATUS5          DS    CL1      STATUS 5                           13450000
PGTHJ#Freeze          EQU   C'E'       quiesce freeze                   13500000
                      DS    CL3                                         13550000
                      SPACE ,                                           13600000
PGTHJ#LEN             EQU   *-PGTHJ                                     13650000
* USING PGTHH,Rx where Rx = ADDRESS of PGTHB + PGTHJOFFK                13700000
PGTHK                 DSECT ,        P T A G - - - - - - - - - - - -    13750000
PGTHKDATALEN          DS    F        LENGTH TO TRAILING NULL            13800000
PGTHKDATA             DS    CL68     SEE pthread_tag_np                 13850000
PGTHK#LEN             EQU   *-PGTHH                                     13900000
                      SPACE ,                                           13950000
** BPXYPGTH End                                                         14000000
                      SPACE 3                                           14050000
                      AIF   ('&LIST' EQ 'YES').E411                     14100000
                      POP   PRINT                                       14150000
.E411                 ANOP  ,                                           14200000
                      MEND                                              14250000
     Terminating PL/X comment                                     */    14300000
 %PGTHPLS : ;                                                           14350000
  Declare                                                               14400000
   /* = I N P U T = = = = = = = = = = = = = = = = = = = = = = = = = */  14450000
        PgthAPtr        Ptr(31),   /* 2nd input parameter           */  14500000
    1   PgthA           Bdy(Word)   Based(PgthAPtr),                    14550000
     3  PgthAContinue   Char(14) Bdy(Word),  /* PID/THID location */    14600000
      5 PgthAPID        Fixed(32), /* Process ID                   */   14650000
      5 PgthAThID       Char(8),   /* Thread ID                    */   14700000
      5 PgthAAccessPID  Fixed(8),  /* Current/First/Next           */   14750000
      5 PgthAAccessThID Fixed(8),  /* Current/First/Next/Last      */   14800000
     3  PgthAASID       Fixed(16), /* ASID Filter   (PgthCASID     */   14850000
     3  PgthALoginName  Char(8),   /* UserID Filter (PgthCLoginName*/   14900000
     3  PgthAFlag1      Bit(16),   /* Operational parameters       */   14950000
      5 PgthAProcess    Bit(1),    /*  Set PgthBOffC, include PgthD*/   15000000
      5 PgthAConTty     Bit(1),    /*  Set PgthBOffD, include PgthD*/   15050000
      5 PgthAPath       Bit(1),    /*  Set PgthBOffE, include PgthE*/   15100000
      5 PgthACommand    Bit(1),    /*  Set PgthBOffF, include PgthF*/   15150000
                                                                        15200000
      5 PgthAFileData   Bit(1),    /*  Set PgthBOffG, G & H array  */   15250000
      5 PgthAThread     Bit(1),    /*  Set PgthBOffI, I & J chain  */   15300000
      5 PgthAPTag       Bit(1),    /*  Set PgthIOffK, Part of J    */   15350000
                                                                        15400000
        /* PgthAAccessPID and PgthAAccessThID values               */   15450000
        Pgth#Next      Fixed   Constant(2),                             15500000
        Pgth#Current   Fixed   Constant(1),                             15550000
        Pgth#First     Fixed   Constant(0),                             15600000
        Pgth#Last      Fixed   Constant(3),                             15650000
        Pgth#Flag1Mask Bit(16) Constant('FE00'x), /* allowed bits  */   15700000
                                                                        15750000
   /* = O U T P U T = = = = = = = = = = = = = = = = = = = = = = = = */  15800000
        PgthBPtr        Ptr(31),   /* 4th parameter                 */  15850000
    1   PgthB           Bdy(Word)  Based(PgthBPtr),                     15900000
     3  PgthBID         Char(4)  Bdy(Word),                             15950000
     3  PgthBContinue   Char(14) Bdy(Word),  /* PID/THID continue */    16000000
      5 PgthBPID        Fixed(32), /* Process ID                   */   16050000
      5 PgthBThID       Char(8),   /* Thread ID                    */   16100000
      5 PgthBAccessPID  Fixed(8),  /* Current/First/Next           */   16150000
      5 PgthBAccessThID Fixed(8),  /* Current/First/Next/Last      */   16200000
     3  *               Char(2),   /*                              */   16250000
     3  PgthBLenUsed    Fixed(31), /* Length of output buffer used */   16300000
                                                                        16350000
     3  PgthBLimitC     Char(1),   /* PROCESS:   N, A, S           */   16400000
     3  PgthBOffC       Fixed(24), /*  Offset of Process area      */   16450000
     3  PgthBLimitD     Char(1),   /* CONTTY:    N, A, S, X        */   16500000
     3  PgthBOffD       Fixed(24), /*  Offset of ConTty area       */   16550000
     3  PgthBLimitE     Char(1),   /* PATH:      N, A, S, X        */   16600000
     3  PgthBOffE       Fixed(24), /*  Offset of Path area         */   16650000
     3  PgthBLimitF     Char(1),   /* COMMAND:   N, A, S, X        */   16700000
     3  PgthBOffF       Fixed(24), /*  Offset of Command area      */   16750000
     3  PgthBLimitG     Char(1),   /* FILE DATA: N, A, S, X, V     */   16800000
     3  PgthBOffG       Fixed(24), /*  Offset of File Data area    */   16850000
     3  PgthBLimitJ     Char(1),   /* THREAD:    N, A, S, X, V     */   16900000
     3  PgthBOffJ       Fixed(24), /*  Offset of Thread area       */   16950000
                                                                        17000000
     3  PgthBX          Char(0)  Bdy(Word),                             17050000
                                                                        17100000
    /* PgthBLimit.    values                                       */   17150000
    Pgth#Vague        char(1) constant("V"), /* changes in progress*/   17200000
    Pgth#Storage      char(1) constant("S"), /* Ran out of buffer  */   17250000
    Pgth#OK           char(1) constant("A"), /* Got them all       */   17300000
    Pgth#NotRequested char(1) constant("N"), /* PgthA.. bit not set*/   17350000
    Pgth#NotConnected char(1) constant("X"), /* Ctl block not there*/   17400000
                                                                        17450000
    /* Pgth.ID     values                                          */   17500000
    PgthB#ID       Char(4) Constant("gthb"), /* output header      */   17550000
    PgthC#ID       Char(4) Constant("gthc"), /* process            */   17600000
    PgthD#ID       Char(4) Constant("gthd"), /* contty             */   17650000
    PgthE#ID       Char(4) Constant("gthe"), /* path               */   17700000
    PgthF#ID       Char(4) Constant("gthf"), /* command            */   17750000
    PgthG#ID       Char(4) Constant("gthg"), /* file data          */   17800000
    PgthH#IDr      Char(2) Constant("rd"),   /* root directory     */   17850000
    PgthH#IDc      Char(2) Constant("cd"),   /* current directory  */   17900000
    PgthH#IDf      Char(2) Constant("fd"),   /* file directory     */   17950000
    PgthH#IDv      Char(2) Constant("vd"),   /* vnode directory    */   18000000
    PgthJ#ID       Char(4) Constant("gthj"), /* thread data        */   18050000
                                                                        18100000
   /* = P R O C E S S = = = = = = = = = = = = = = = = = = = = = = = */  18150000
        PgthCPtr        Ptr(31),   /* = PgthBPtr + PgthBOffC        */  18200000
    1   PgthC           Bdy(Word)   Based(PgthCPtr),                    18250000
     3  PgthCID         Char(4)  Bdy(Word),                             18300000
     3  PgthCFlags           Bit(32),   /* Flags                  */    18350000
      5 PgthCMulProcess      Bit(01),   /* OapbMultiProc          */    18400000
      5 PgthCSwap            Bit(01),   /* AscbSwap               */    18450000
      5 PgthCTrace           Bit(01),   /* OapbPtTraceMe          */    18500000
      5 PgthCStopped         Bit(01),   /* PprpStatusStopped      */    18550000
      5 PgthCIncomplete      Bit(01),   /* Not all blocks present */    18600000
      5 PgthCZombie          Bit(01),   /* Zombie process     @P3A*/    18625000
     3  PgthCPid             Fixed(31), /* PprpIdsPid             */    18650000
     3  PgthCPPid            Fixed(31), /* PprpParentPid          */    18700000
     3  PgthCPgPid           Fixed(31), /* PpgpIdsPgid            */    18750000
     3  PgthCSid             Fixed(31), /* PprpIdsSsid            */    18800000
     3  PgthCFgPid           Fixed(31), /* PprpOIdsFgpgl          */    18850000
     3  PgthCEUid            Fixed(31), /* OapbEUid or PprpEndEUid*/    18900000
     3  PgthCRUid            Fixed(31), /* OapbRUid or PprpEndRUid*/    18950000
     3  PgthCSUid            Fixed(31), /* OapbSUid or PprpEndSUid*/    19000000
     3  PgthCEGid            Fixed(31), /* OapbEGid               */    19050000
     3  PgthCRGid            Fixed(31), /* OapbRGid               */    19100000
     3  PgthCSGid            Fixed(31), /* OapbSGid               */    19150000
     3  PgthCTSize           Fixed(31), /* OasbLDAErgtp - LDAEstra*/    19200000
     3  PgthCSysCallCount    Fixed(32), /* OapbSysCallCount       */    19250000
     3  PgthCUserTime        Fixed(32), /* AscbSrbt+math          */    19300000
     3  PgthCSysTime         Fixed(32), /* OapbSavedJobTime+math  */    19350000
     3  PgthCStartTime       Fixed(32), /* PprpTmDubbed           */    19400000
     3  PgthCCntOE           Fixed(16), /* Cnt PprtCalledKernel   */    19450000
     3  PgthCCntPTcreated    Fixed(16), /* Cnt PprtPTcreated      */    19500000
     3  PgthCCntThreads      Fixed(16), /* Cnt Pprt on Pprp chain */    19550000
     3  PgthCASID            Fixed(16), /* AscbASID               */    19600000
     3  PgthCJobName         Char(8) Bdy(Word), /* AscbJbnI/S->C8 */    19650000
     3  PgthCLoginName   Char(8) Bdy(Word), /* OapbAliasNInfo @P4C*/    19683300
                                            /* OapbLoginNInfo @P4C*/    19716600
                                                                        19750000
   /* = C O N T T Y   = = = = = = = = = = = = = = = = = = = = = = = */  19800000
        PgthDPtr        Ptr(31),     /* = PgthBPtr + PgthBOffD      */  19850000
    1   PgthD           Bdy(Word)    Based(PgthDPtr),                   19900000
     3  PgthDID         Char(4)      Bdy(Word),                         19950000
     3  PgthDLen        Fixed(16),   /* Length of PgthDConTty       */  20000000
     3  PgthDConTty     Char(0),     /* string with null            */  20050000
                                                                        20100000
   /* = P A T H = = = = = = = = = = = = = = = = = = = = = = = = = = */  20150000
        PgthEPtr        Ptr(31),     /* = PgthBPtr + PgthBOffE      */  20200000
    1   PgthE           Bdy(Word)    Based(PgthEPtr),                   20250000
     3  PgthEID         Char(4)      Bdy(Word),                         20300000
     3  PgthELen        Fixed(16),   /* Length of PgthEPath         */  20350000
     3  PgthEPath       Char(0),     /* string with null            */  20400000
                                                                        20450000
   /* = C O M M A N D = = = = = = = = = = = = = = = = = = = = = = = */  20500000
        PgthFPtr        Ptr(31),     /* = PgthBPtr + PgthBOffF      */  20550000
    1   PgthF           Bdy(Word)    Based(PgthFPtr),                   20600000
     3  PgthFID         Char(4)      Bdy(Word),                         20650000
     3  PgthFLen        Fixed(16),   /* length of PgthFCommand      */  20700000
     3  PgthFCommand    Char(0),     /* L1,string,.....,Ln,string   */  20750000
                                                                        20800000
   /* = F I L E   D A T A = = = = = = = = = = = = = = = = = = = = = */  20850000
        PgthGPtr        Ptr(31),     /* = PgthBPtr + PgthBOffG      */  20900000
    1   PgthG           Bdy(Word)    Based(PgthGPtr),                   20950000
     3  PgthGID         Char(4)      Bdy(Word),                         21000000
     3  PgthGLimitH     Char(1),     /* Directories: A, S, V        */  21050000
     3  PgthGOffH       Fixed(24),   /*  Offset of 1st PgthH area   */  21100000
     3  PgthGCount      Fixed(32),   /* Count of PgthH areas present*/  21150000
     3  PgthGMaxVNodeTokens  Fixed(32),     /* SabMaxVdes           */  21200000
     3  PgthGVNodeTokenCount Fixed(32),     /* SabVDECount          */  21250000
     3  PgthGSerFlags        Fixed(32),     /* SabFlags             */  21300000
     3  PgthGServerName Char(32) Bdy(Word), /* SabServerName        */  21350000
     3  PgthGActiveFiles     Fixed(32),     /* SabVDECount   AF=    */  21400000
     3  PgthGMaxFiles        Fixed(32),     /* SabMaxVdes    MF=    */  21450000
     3  PgthGServerType      Fixed(32),     /* SabServerType TYPE=  */  21500000
     3  *               Char(0),     /* location of first PgthH     */  21550000
                                                                        21600000
        PgthHPtr        Ptr(31),     /* = PgthBPtr + PgthGOffH      */  21650000
                                     /* increment by Length(PgthH)  */  21700000
    1   PgthH           Bdy(Word)    Based(PgthHPtr),                   21750000
     3  PgthHID         Char(2),     /* "rd", "cd", "fd" or "vd"    */  21800000
     3  PgthHType       Bit(8),      /* BPXYFTYP see FP_DIR etal.   */  21850000
     3  PgthHOpen       Bit(8),      /* BPXYOPNF see O_FLAGS4       */  21900000
     3  PgthHINode      Fixed(32),   /* I-Node                      */  21950000
     3  PgthHDevNo      Fixed(32),   /* Device number               */  22000000
                                                                        22050000
   /* = T H R E A D = = = = = = = = = = = = = = = = = = = = = = = = */  22100000
        PgthJPrevPtr    Ptr(31),     /*                             */  22150000
        PgthJPtr        Ptr(31),     /* = PgthBPtr + PgthBOffJ      */  22200000
                                     /* = PgthBPtr + PgthJOffJ      */  22250000
    1   PgthJ           Bdy(Word)    Based(PgthJPtr),                   22300000
     3  PgthJID         Char(4)      Bdy(Word),                         22350000
     3  PgthJLimitJ     Char(1),     /* THREAD NEXT: N, A, S, X, V  */  22400000
     3  PgthJOffJ       Fixed(24),   /*  Offset of next thread area */  22450000
     3  PgthJLimitK     Char(1),     /* PTAG:        N, A, S, X     */  22500000
     3  PgthJOffK       Fixed(24),   /*  Offset of tag              */  22550000
     3  PgthJThID       Char(8),     /* Thread ID                   */  22600000
     3  PgthJSysCall    Char(4),     /* Current Syscall if InKernel */  22650000
     3  PgthJTCB        Ptr(31),     /* TCB address                 */  22700000
     3  PgthJTTime      Fixed(32),   /* TcbTTime   in .001 sec units*/  22750000
     3  PgthJWTime      Fixed(32),   /* PprtTodAtWait .001 sec units*/  22800000
     3  *               Bit(32),     /*  space                  @P1D*/  22850000
     3  PgthJSemNum     Fixed(16),   /* PprtWaiterSemNum            */  22900000
     3  PgthJSemVal     Fixed(15),   /* PprtWaiterSemVal            */  22950000
     3  PgthJLatchWaitPID Fixed(32), /* PprtLatchWaitPID            */  23000000
     3  PgthJPenMask    Bit(64),     /* PpstPenMask                 */  23050000
     3  PgthJLoginName  Char(8),     /* OtcbAliasNInfo          @P4C*/  23083300
                                     /* OtcbLoginNInfo          @P4C*/  23116600
     3  PgthJPrevSC (5) Char(4),     /* Previous syscalls           */  23150000
     3  PgthJStatusChars  Char(5),   /* "....." until set           */  23200000
      5 PgthJStatus1    Char(1),     /* Pthread created/Dubbed      */  23250000
      5 PgthJStatus2    Char(1),     /* Wait/Running status         */  23300000
      5 PgthJStatus3    Char(1),     /* Creation type               */  23350000
      5 PgthJStatus4    Char(1),     /* Detached/undetached         */  23400000
      5 PgthJStatus5    Char(1),     /* Ptrace held                 */  23450000
     3  *               Char(3),                                        23500000
     3  *               Char(0)   Bdy(Word),                            23550000
                                                                        23600000
    /* Status 1                                                     */  23650000
    PgthJ#PthdCreated char(1) constant('J'), /*Pthread created      */  23700000
                                                                        23750000
    /* Status 2                                                     */  23800000
    PgthJ#Msgrcv   char(1) constant('A'), /*IPC msgrcv wait         */  23850000
    PgthJ#Msgsnd   char(1) constant('B'), /*IPC msgsnd wait         */  23900000
    PgthJ#WaitC    char(1) constant('C'), /*Comm KernelWait         */  23950000
    PgthJ#Semop    char(1) constant('D'), /*IPC semop wait          */  24000000
    PgthJ#WaitF    char(1) constant('F'), /*File System Kernel Wait */  24050000
    PgthJ#MVSPause char(1) constant('G'), /*MVSPause                */  24100000
    PgthJ#WaitO    char(1) constant('K'), /*Other Kernel Wait       */  24150000
    PgthJ#WaitP    char(1) constant('P'), /*KserPTWaiting #PTrace   */  24200000
    PgthJ#Run      char(1) constant('R'), /*Not kernel wait         */  24250000
    PgthJ#Sleep    char(1) constant('S'), /*sleep() issued          */  24300000
    PgthJ#Child    char(1) constant('W'), /*Waiting for child       */  24350000
    PgthJ#Fork     char(1) constant('X'), /*fork new process        */  24400000
    PgthJ#MVSWait  char(1) constant('Y'), /*MVS wait                */  24450000
                                                                        24500000
    /* Status 3                                                     */  24550000
    PgthJ#MediumWght char(1) constant('N'), /*Medium weight thread  */  24600000
    PgthJ#Asynch   char(1) constant('O'), /*Asynchronous thread     */  24650000
    PgthJ#IPT      char(1) constant('U'), /*Initial process thread  */  24700000
    PgthJ#Zombie   char(1) constant('Z'), /*Terminated and waiting  */  24750000
                                                                        24800000
    /* Status 4                                                     */  24850000
    PgthJ#Detached char(1) constant('V'), /*Thread is detached      */  24900000
                                                                        24950000
    /* Status 5                                                     */  25000000
    PgthJ#Freeze   char(1) constant('E'), /*Quiesce Freeze          */  25050000
                                                                        25100000
                                                                        25150000
   /* = T H R E A D   T A G   D A T A = = = = = = = = = = = = = = = */  25200000
        PgthKPtr        Ptr(31),     /* = PgthBPtr + PgthJOffK      */  25250000
    1   PgthK           Bdy(Word)    Based(PgthKPtr),                   25300000
     3  PgthKDataLen    Fixed(31),   /* PtagDataLen                 */  25350000
     3  PgthKData       Char(68);    /* PtagData, see pthread_tag_np*/  25400000
