*%;    /*                                                               00050000
         MACRO                                                          00100000
&TIONAME BPXYTIOS &PREFIX=,&DSECT=YES,&LIST=YES                         00150000
         GBLB  &TIOS411                                                 00200000
         AIF   (&TIOS411 EQ 1).E411                                     00250000
&TIOS411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYTIOS: Termios structure                       00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*/****START OF SPECIFICATIONS****************************************** 00550000
*                                                                       00600000
*    $MAC (BPXYTIOS) COMP(SCPX1) PROD(BPX):                             00650000
*                                                                       00700000
*01* MACRO NAME: BPXYTIOS                                               00750000
*                                                                       00800000
*01* DSECT NAME: BPXYTIOS when DSECT=YES is coded and no label coded    00850000
*                                                                       00900000
*01* DESCRIPTIVE NAME: Termios Structure                                00950000
*                                                                       01000000
*02*   ACRONYM: TIOS                                                    01050000
**/                                                                     01100000
*/*01* PROPRIETARY STATEMENT=                                        */ 01150000
*/***PROPRIETARY_STATEMENT********************************************/ 01200000
*/*                                                                  */ 01250000
*/*                                                                  */ 01300000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01350000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01400000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,1995                       */ 01450000
*/*                                                                  */ 01550000
*/* STATUS= HBB7703                                                  */ 01600000
*/*                                                                  */ 01650000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01700000
*/*                                                                     01750000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01800000
*01* END OF EXTERNAL CLASSIFICATION:                                    01850000
*                                                                       01900000
*01* FUNCTION:                                                          01950000
*                                                                       02000000
*02*  Contains information about the characteristics of terminals.      02050000
*                                                                       02100000
*    This maps the Posix termios structure.  The fields match           02150000
*    the corresponding fields in the termios structure in C's           02200000
*    termios.h except that assembler names are upper case and           02250000
*    PL/X names are case insensitive.                                   02300000
*                                                                       02350000
*01* METHOD OF ACCESS:                                                  02400000
*                                                                       02450000
*02*   PL/X:                                                            02500000
*                                                                       02550000
*        %INCLUDE SYSLIB(BPXYTIOS)                                      02600000
*                                                                       02650000
*        By default, the termios is based on TiosPtr.  If other         02700000
*        basing is desired, use %TIOSBASE='BASED(XXXXXX)'.              02750000
*        If %TIOSBASE='BASED(TiosPtr)' is coded or defaulted,           02800000
*        a declare for TiosPtr is also generated.                       02850000
*                                                                       02900000
*        By default, the field names are the same as those              02950000
*        defined by the Posix standard (ISO/EEC 9945-1 and              03000000
*        IEEE 1003.1).  If a prefix is desired before the               03050000
*        standard names, use %TIOSPFX='xxxx'.                           03100000
*                                                                       03150000
*02*   ASM:                                                             03200000
*        DSECT=YES should be specified on macro call unless             03250000
*        static storage in the module is to be defined.                 03300000
*        If a label is provided, and DSECT=YES is specified,            03350000
*        that label is used as the DSECT name.  Otherwise               03400000
*        (if DSECT=YES is specified), the DSECT name is                 03450000
*        set to BPXYTIOS.                                               03500000
*        The default is DSECT=YES.                                      03550000
*                                                                       03600000
*01* SIZE: Refer to the mapping.                                        03650000
*                                                                       03700000
*01* POINTED TO BY: N/A                                                 03750000
*                                                                       03800000
*01* CREATED BY: User                                                   03850000
*                                                                       03900000
*01* DELETED BY: User                                                   03950000
*                                                                       04000000
*01* STORAGE ATTRIBUTES:                                                04050000
*                                                                       04100000
*02*   ALLOCATION METHOD:  Various                                      04150000
*02*   SUBPOOL:            Various                                      04200000
*02*   KEY:                Any                                          04250000
*02*   RESIDENCY:          Any                                          04300000
*                                                                       04350000
*01* FREQUENCY: As required                                             04400000
*                                                                       04450000
*01* SERIALIZATION: N/A                                                 04500000
*                                                                       04550000
*01* DEPENDENCIES:                                                      04600000
*                                                                       04650000
*    This maps the Posix termios structure, and must match the          04700000
*    the termios structure defined by C's termios.h.                    04750000
*                                                                       04800000
*01* NOTES: None                                                        04850000
*                                                                       04900000
*01* COMPONENT: OpenMVS (SCPX1)                                         04950000
*                                                                       05000000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     05050000
*                                                                       05100000
*                                                                       05150000
*01* EYE-CATCHER:  None                                                 05200000
*                                                                       05250000
*01* CHANGE ACTIVITY:                                                   05300000
* $L0=POSIXXB  HOM1110 921201 PDJP: OpenMVS Initial Release             05350000
* $P1=PL70411  HOM1110 921201 PDJM: Assembler macro fixup               05400000
* $D0=DL70019  HOM1110 920923 PDJM: Keyword rework                      05450000
* $P2=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       05500000
* $P3=POA0040  HOM1120 930805 PDJN: Externalize access of Baud rates    05550000
*                                   (Re-sync of PL70769)                05600000
* $P4=POA0057  HOM1120 930901 PDJN: Change some l_flag values due to    05650000
*                                   to "C" header conflicts             05700000
*                                   (resync of DCR A046.00)             05750000
* $D1=DPFA080  HOM1130 940315 PDJP: XPG/4 (DCR A080.01)                 05800000
* $D2=DPFA054  HOM1130 940503 PDJP: (DCR A054.03) pty packet mode       05850000
* $D3=DPFA066  HOM1130 940621 PDJP: (DCR A066.01) 3270 packet/passthru  05900000
* $D4=DPFA080  HOM1130 941014 PDJP: XPG/4 (DCR A080.02)                 05950000
* $D5=DPFA090  HOM1130 950121 PDJP: (DCR A090.02) code page and         06000000
*                                   extended packet                     06050000
****END OF SPECIFICATIONS ********************************************/ 06100000
*%;   /*                                                                06150000
.A411    ANOP  ,                                                        06200000
** BPXYTIOS: Termios structure                                          06250000
**  Used By: TGA TSA TFH TFW                                            06300000
         LCLC  &DSECTNM            Define DSECT/structure name          06350000
&DSECTNM SETC  'BPXYTIOS'          Set default name                     06400000
         AIF   ('&TIONAME' EQ '').HAVENM  If not spec'ed, use default   06450000
&DSECTNM SETC  '&TIONAME'          Otherwise, set specified name        06500000
.HAVENM  AIF   ('&DSECT' EQ 'NO').BPX2  Skip DSECT if DSECT=NO          06550000
&DSECTNM DSECT ,                   Define DSECT                         06600000
         AGO   .BPX2A              Skip DS if DSECT=YES                 06650000
.BPX2    ANOP                                                           06700000
&DSECTNM DS    0F                  Ensure full word boundary            06750000
.BPX2A   ANOP                                                           06800000
         LCLC  &P                  Define short prefix variable         06850000
&P       SETC  '&PREFIX'                                                06900000
         SPACE ,                                                        06950000
* baud rate values                                                      07000000
&P.B0       EQU    0               0     baud (hang-up)                 07050000
&P.B50      EQU    1               50    baud                           07100000
&P.B75      EQU    2               75    baud                           07150000
&P.B110     EQU    3               110   baud                           07200000
&P.B134     EQU    4               134.5 baud                           07250000
&P.B150     EQU    5               150   baud                           07300000
&P.B200     EQU    6               200   baud                           07350000
&P.B300     EQU    7               300   baud                           07400000
&P.B600     EQU    8               600   baud                           07450000
&P.B1200    EQU    9               1200  baud                           07500000
&P.B1800    EQU   10               1800  baud                           07550000
&P.B2400    EQU   11               2400  baud                           07600000
&P.B4800    EQU   12               4800  baud                           07650000
&P.B9600    EQU   13               9600  baud                           07700000
&P.B19200   EQU   14               19200 baud                           07750000
&P.B38400   EQU   15               38400 baud                           07800000
         SPACE ,                                                        07850000
* c_cflag offsets for baud rate.  These values are                      07900000
* used to refer to the correct byte within c_cflag.  For                07950000
* instance, "MVI   C_CFLAG+ISPEED_O,B50".                               08000000
&P.OSPEED_O EQU   0                Offset to OUTPUT baud rate    @P3A   08050000
&P.ISPEED_O EQU   1                Offset to INPUT baud rate     @P3A   08100000
         SPACE ,                                                        08150000
* Values for c_cflag field are bitwise distinct except for              08200000
* character size bits - which form a number.                            08250000
&P.CLOCAL   EQU   X'01'            Ignore modem status lines            08300000
&P.CREAD    EQU   X'02'            Enable receiver                      08350000
&P.CSIZE    EQU   X'30'            Character size bits                  08400000
&P.CS5      EQU   X'00'              B'00' - 5 bits/character           08450000
&P.CS6      EQU   X'10'              B'01' - 6 bits/character           08500000
&P.CS7      EQU   X'20'              B'10' - 7 bits/character           08550000
&P.CS8      EQU   X'30'              B'11' - 8 bits/character           08600000
&P.CSTOPB   EQU   X'80'            Send two stop bits, else one         08650000
&P.HUPCL    EQU   X'01'            Hang up on last close                08700000
&P.PARENB   EQU   X'02'            Parity enable                        08750000
&P.PARODD   EQU   X'04'            Odd parity, else even                08800000
&P.PACKET   EQU   X'08'            Packet mode enabled           @D2A   08850000
&P.PKT3270  EQU   X'10'            3270 Passthru mode allowed    @D5C   08900000
&P.PTU3270  EQU   X'20'            3270 Passthru mode enabled    @D3A   08950000
&P.PKTXTND  EQU   X'40'            Extended Packet mode enabled  @D5A   09000000
         SPACE ,                                                        09050000
* c_cflag offsets for bits defined above.  These values are             09100000
* used to refer to the correct byte within c_cflag.  For                09150000
* instance, "TM    C_CFLAG+HUPCL_O,HUPCL".                              09200000
&P.CLOCAL_O EQU   3                                                     09250000
&P.CREAD_O  EQU   3                                                     09300000
&P.CSIZE_O  EQU   3                                                     09350000
&P.CS5_O    EQU   3                                                     09400000
&P.CS6_O    EQU   3                                                     09450000
&P.CS7_O    EQU   3                                                     09500000
&P.CS8_O    EQU   3                                                     09550000
&P.CSTOPB_O EQU   3                                                     09600000
&P.HUPCL_O  EQU   2                                                     09650000
&P.PARENB_O EQU   2                                                     09700000
&P.PARODD_O EQU   2                                                     09750000
&P.PACKET_O EQU   2                                               @D2A  09800000
&P.PKT3270_O EQU  2                                               @D3A  09850000
&P.PTU3270_O EQU  2                                               @D3A  09900000
&P.PKTXTND_O EQU  2                                               @D3A  09950000
         SPACE ,                                                        10000000
* Values for c_lflag field are bitwise distinct.                        10050000
&P.ECHO     EQU  X'08'             Enable echo                    @P4C  10100000
&P.ECHOE    EQU  X'02'             Echo ERASE as error correcting      X10150000
                                     backspace                          10200000
&P.ECHOK    EQU  X'04'             Echo KILL                            10250000
&P.ECHONL   EQU  X'01'             Echo new line                  @P4C  10300000
&P.ICANON   EQU  X'10'             Canonical input                      10350000
&P.IEXTEN   EQU  X'20'             Enable extended functions            10400000
&P.ISIG     EQU  X'40'             Enable signals                       10450000
&P.NOFLSH   EQU  X'80'             Disable flush after interrupt,      X10500000
                                     quit, or suspend                   10550000
&P.TOSTOP   EQU  X'40'             Send SIGTTOU for background         X10600000
                                     output                       @P4C  10650000
&P.XCASE    EQU  X'80'             Canonical Upper/Lower               X10700000
                                     presentation                 @D1A  10750000
         SPACE ,                                                        10800000
* c_lflag offsets for bits defined above.  These values are             10850000
* used to refer to the correct byte within c_lflag.  For                10900000
* instance, "TM    C_LFLAG+TOSTOP_O,TOSTOP".                            10950000
&P.ECHO_O   EQU  3                                                      11000000
&P.ECHOE_O  EQU  3                                                      11050000
&P.ECHOK_O  EQU  3                                                      11100000
&P.ECHONL_O EQU  3                                                      11150000
&P.ICANON_O EQU  3                                                      11200000
&P.IEXTEN_O EQU  3                                                      11250000
&P.ISIG_O   EQU  3                                                      11300000
&P.NOFLSH_O EQU  0                                                @P4C  11350000
&P.TOSTOP_O EQU  1                                                @P4C  11400000
&P.XCASE_O  EQU  3                                                @D1A  11450000
         SPACE ,                                                        11500000
* Values for c_iflag field are bitwise distinct.                        11550000
&P.BRKINT   EQU  X'01'             Signal interrupt on break            11600000
&P.ICRNL    EQU  X'02'             Map CR to NL on input                11650000
&P.IGNBRK   EQU  X'04'             Ignore break condition               11700000
&P.IGNCR    EQU  X'08'             Ignore CR                            11750000
&P.IGNPAR   EQU  X'10'             Ignore characters with parity       X11800000
                                     errors                             11850000
&P.INLCR    EQU  X'20'             Map NL to CR in input                11900000
&P.INPCK    EQU  X'40'             Enable input parity check            11950000
&P.ISTRIP   EQU  X'80'             Strip character                      12000000
&P.IXOFF    EQU  X'01'             Enable start/stop input             X12050000
                                     control                            12100000
&P.IXON     EQU  X'02'             Enable start/stop output            X12150000
                                     control                            12200000
&P.PARMRK   EQU  X'04'             Mark parity errors                   12250000
&P.IUCLC    EQU  X'08'             Map UC->LC on input           @D1A   12300000
&P.IXANY    EQU  X'10'             Any char restarts output      @D1A   12350000
         SPACE ,                                                        12400000
* c_iflag offsets for bits defined above.  These values are             12450000
* used to refer to the correct byte within c_iflag.  For                12500000
* instance, "TM    C_IFLAG+BRKINT_O,BRKINT".                            12550000
&P.BRKINT_O EQU  3                                                      12600000
&P.ICRNL_O  EQU  3                                                      12650000
&P.IGNBRK_O EQU  3                                                      12700000
&P.IGNCR_O  EQU  3                                                      12750000
&P.IGNPAR_O EQU  3                                                      12800000
&P.INLCR_O  EQU  3                                                      12850000
&P.INPCK_O  EQU  3                                                      12900000
&P.ISTRIP_O EQU  3                                                      12950000
&P.IXOFF_O  EQU  2                                                      13000000
&P.IXON_O   EQU  2                                                      13050000
&P.PARMRK_O EQU  2                                                      13100000
&P.IUCLC_O  EQU  2                                               @D1A   13150000
&P.IXANY_O  EQU  2                                               @D1A   13200000
         SPACE ,                                                        13250000
* Values for c_oflag are bitwise distinct.                              13300000
&P.OPOST    EQU X'01'              Perform output processing            13350000
&P.OLCUC    EQU X'02'              Map LC->UC on output          @D1A   13400000
&P.ONLCR    EQU X'04'              Map NL->CR on output          @D1A   13450000
&P.OCRNL    EQU X'08'              Map CR->NL on output          @D1A   13500000
&P.ONOCR    EQU X'10'              No CR at column 0             @D1A   13550000
&P.ONLRET   EQU X'20'              NL performs CR function       @D1A   13600000
&P.OFILL    EQU X'40'              Use fill chars for delay      @D1A   13650000
&P.OFDEL    EQU X'80'              Use DEL, not NUL, for fill    @D1A   13700000
&P.NLDLY    EQU X'01'              Newline delay type            @D1A   13750000
&P.NL0      EQU X'00'                NL delay type 0             @D1A   13800000
&P.NL1      EQU X'01'                NL delay type 1             @D1A   13850000
&P.TABDLY   EQU X'0C'              Tab delay type                @D1A   13900000
&P.TAB0     EQU X'00'                Tab delay type 0            @D1A   13950000
&P.TAB1     EQU X'04'                Tab delay type 1            @D1A   14000000
&P.TAB2     EQU X'08'                Tab delay type 2            @D1A   14050000
&P.TAB3     EQU X'0C'                Expand tabs to spaces       @D1A   14100000
&P.CRDLY    EQU X'30'              CR delay type                 @D1A   14150000
&P.CR0      EQU X'00'                CR delay type 0             @D1A   14200000
&P.CR1      EQU X'10'                CR delay type 1             @D1A   14250000
&P.CR2      EQU X'20'                CR delay type 2             @D1A   14300000
&P.CR3      EQU X'30'                CR delay type 3             @D1A   14350000
&P.FFDLY    EQU X'40'              Form-feed delay type          @D1A   14400000
&P.FF0      EQU X'00'                FF delay type 0             @D1A   14450000
&P.FF1      EQU X'40'                FF delay type 1             @D1A   14500000
&P.BSDLY    EQU X'80'              Backspace delay type          @D1A   14550000
&P.BS0      EQU X'00'                BS delay type 0             @D1A   14600000
&P.BS1      EQU X'80'                BS delay type 1             @D1A   14650000
&P.VTDLY    EQU X'01'              Vertical-tab delay type       @D1A   14700000
&P.VT0      EQU X'00'                VT delay type 0             @D1A   14750000
&P.VT1      EQU X'01'                VT delay type 1             @D1A   14800000
*                                                                       14850000
* c_oflag offsets for bits defined above.  These values are             14900000
* used to refer to the correct byte within c_oflag.  For                14950000
* instance, "TM    C_OFLAG+OPOST_O,OPOST".                              15000000
*                                                                       15050000
&P.OPOST_O  EQU 3                                                       15100000
&P.OLCUC_O  EQU 3                                                @D1A   15150000
&P.ONLCR_O  EQU 3                                                @D1A   15200000
&P.OCRNL_O  EQU 3                                                @D1A   15250000
&P.ONOCR_O  EQU 3                                                @D1A   15300000
&P.ONLRET_O EQU 3                                                @D1A   15350000
&P.OFILL_O  EQU 3                                                @D1A   15400000
&P.OFDEL_O  EQU 3                                                @D1A   15450000
&P.NLDLY_O  EQU 2                                                @D1A   15500000
&P.NL0_0    EQU 2                                                @D1A   15550000
&P.NL1_0    EQU 2                                                @D1A   15600000
&P.TABDLY_O EQU 2                                                @D1A   15650000
&P.TAB0_O   EQU 2                                                @D1A   15700000
&P.TAB1_O   EQU 2                                                @D1A   15750000
&P.TAB2_O   EQU 2                                                @D1A   15800000
&P.TAB3_O   EQU 2                                                @D1A   15850000
&P.CRDLY_O  EQU 2                                                @D1A   15900000
&P.CR0_0    EQU 2                                                @D1A   15950000
&P.CR1_0    EQU 2                                                @D1A   16000000
&P.CR2_0    EQU 2                                                @D1A   16050000
&P.CR3_0    EQU 2                                                @D1A   16100000
&P.FFDLY_O  EQU 2                                                @D1A   16150000
&P.FF0_0    EQU 2                                                @D1A   16200000
&P.FF1_0    EQU 2                                                @D1A   16250000
&P.BSDLY_O  EQU 2                                                @D1A   16300000
&P.BS0_0    EQU 2                                                @D1A   16350000
&P.BS1_0    EQU 2                                                @D1A   16400000
&P.VTDLY_O  EQU 1                                                @D1A   16450000
&P.VT0_0    EQU 1                                                @D1A   16500000
&P.VT1_0    EQU 1                                                @D1A   16550000
         SPACE ,                                                        16600000
* Optional actions used by tcsetattr()                                  16650000
&P.TCSANOW    EQU  0               Change occurs immediately            16700000
&P.TCSADRAIN  EQU  1               Change occurs after all output      X16750000
                                     has been written                   16800000
&P.TCSAFLUSH  EQU  2               Change occurs after all output      X16850000
                                     has been written and input        X16900000
                                     has been discarded                 16950000
         SPACE ,                                                        17000000
* queue selector values for tcflush                                     17050000
&P.TCIFLUSH  EQU   0               Flush data received but not read     17100000
&P.TCOFLUSH  EQU   1               Flush data written but not sent      17150000
&P.TCIOFLUSH EQU   2               Flush both data received but not    X17200000
                                     read and data written but not sent 17250000
         SPACE ,                                                        17300000
* action values for tcflow()                                            17350000
&P.TCOOFF   EQU 0                  Suspend output                       17400000
&P.TCOON    EQU 1                  Restart suspended output             17450000
&P.TCIOFF   EQU 2                  Transmit STOP character              17500000
&P.TCION    EQU 3                  Transmit START character             17550000
         SPACE ,                                                        17600000
* Special Control Characters subscripts for cc_c                        17650000
*   field                                                               17700000
&P.VINTR    EQU  0                 INTR  character                      17750000
&P.VQUIT    EQU  1                 QUIT  character                      17800000
&P.VERASE   EQU  2                 ERASE character                      17850000
&P.VKILL    EQU  3                 KILL  character                      17900000
&P.VEOF     EQU  4                 EOF   character                      17950000
&P.VEOL     EQU  5                 EOL   character                      18000000
&P.VMIN     EQU  6                 MIN   value                          18050000
&P.VSTART   EQU  7                 START character                      18100000
&P.VSTOP    EQU  8                 STOP  character                      18150000
&P.VSUSP    EQU  9                 SUSP  character                      18200000
&P.VTIME    EQU 10                 TIME  value                          18250000
         SPACE 5                                                        18300000
&P.NCCS  EQU   11                  Number of special control chars      18350000
&P.C_CFLAG DC  F'0'                Control modes                        18400000
&P.C_IFLAG DC  F'0'                Input modes                          18450000
&P.C_LFLAG DC  F'0'                Local modes                          18500000
&P.C_OFLAG DC  F'0'                Output modes                         18550000
&P.C_CC    DC  (&P.NCCS)X'0'       Control characters and values        18600000
&P.&DSECTNM.#LENGTH  EQU   *-&DSECTNM Length of this structure          18650000
** BPXYTIOS End                                                         18700000
         AIF   ('&LIST' EQ 'YES').E411                        3@P1A     18750000
         POP   PRINT                                                    18800000
.E411    ANOP  ,                                                        18850000
         MEND  ,                   */                                   18900000
* %BPXL1 :  ;                      /* PL/X mapping                   */ 18950000
 %DCL PFX CHAR; /* Short form of prefix           */                    19000000
 %PFX = TIOSPFX;                   /* Set short form value           */ 19050000
 %IF TIOSBASE='' %THEN             /* If base not specified...       */ 19100000
   %DO;                                                                 19150000
     %TIOSBASE='BASED(TiosPtr)';   /*   set default base             */ 19200000
   %END;                                                                19250000
  %IF TIOSBASE='BASED(TiosPtr)' %THEN  /* If default base            */ 19300000
    %DO;                           /* Declare the base pointer       */ 19350000
      DCL TiosPtr Ptr(31);         /* Pointer to the PPRP            */ 19400000
    %END;                                                               19450000
                                                                        19500000
                                                                        19550000
* /*                   termios structure                             */ 19600000
                                                                        19650000
 DCL                                                                    19700000
 1  PFX%%Termios Bdy(Word)                                              19750000
       TIOSBASE,                    /* termios structure             */ 19800000
     5 PFX%%c_cflag bit(32),        /*    Control Flags              */ 19850000
       10 PFX%%c_cRsvdSpd   Bit(16),/* Reserved for baud rates       */ 19900000
          15 PFX%%c_Ospeed  Bit(08),/* Output Baud rate          @P3A*/ 19950000
          15 PFX%%c_Ispeed  Bit(08),/* Input Baud rate           @P3A*/ 20000000
       10 PFX%%c_cRsvd      Bit(01),/* Reserved                  @D5C*/ 20050000
       10 PFX%%PKTXTND      Bit(01),/* Extended Packet mode enabled     20100000
                                                                 @D5A*/ 20150000
       10 PFX%%PTU3270      Bit(01),/* 3270 Passthru mode enabled@D3A*/ 20200000
       10 PFX%%PKT3270      Bit(01),/* 3270 Passthru mode allowed@D5C*/ 20250000
       10 PFX%%PACKET       Bit(01),/* Packet mode enabled       @D2C*/ 20300000
       10 PFX%%PARODD       Bit(01),/* Odd parity, else even         */ 20350000
       10 PFX%%PARENB       Bit(01),/* Parity enable                 */ 20400000
       10 PFX%%HUPCL        Bit(01),/* Hang up on last close         */ 20450000
       10 PFX%%CSTOPB       Bit(01),/* Send two stop bits, else one  */ 20500000
       10 PFX%%c_cRsvd2     Bit(01),/* Reserved                      */ 20550000
       10 PFX%%CSIZE        Bit(02),/* Character size bits           */ 20600000
       10 PFX%%c_cRsvd3     Bit(02),/* Reserved                      */ 20650000
       10 PFX%%CREAD        Bit(01),/* Enable receiver               */ 20700000
       10 PFX%%CLOCAL       Bit(01),/* Ignore modem status lines     */ 20750000
     5 PFX%%c_iflag         Bit(32),/*    Input flags                */ 20800000
       10 PFX%%c_iRsvd      Bit(19),/* Reserved                      */ 20850000
       10 PFX%%IXANY        Bit(01),/* Any char restarts output  @D1A*/ 20900000
       10 PFX%%IUCLC        Bit(01),/* Map UC->LC on input       @D1A*/ 20950000
       10 PFX%%PARMRK       Bit(01),/* Mark parity errors            */ 21000000
       10 PFX%%IXON         Bit(01),/* Enable start/stop output         21050000
                                         control                     */ 21100000
       10 PFX%%IXOFF        Bit(01),/* Enable start/stop input          21150000
                                         control                     */ 21200000
       10 PFX%%ISTRIP       Bit(01),/* Strip character               */ 21250000
       10 PFX%%INPCK        Bit(01),/* Enable input parity check     */ 21300000
       10 PFX%%INLCR        Bit(01),/* Map NL to CR in input         */ 21350000
       10 PFX%%IGNPAR       Bit(01),/* Ignore characters with parity    21400000
                                         errors                      */ 21450000
       10 PFX%%IGNCR        Bit(01),/* Ignore CR                     */ 21500000
       10 PFX%%IGNBRK       Bit(01),/* Ignore break condition        */ 21550000
       10 PFX%%ICRNL        Bit(01),/* Map CR to NL on input         */ 21600000
       10 PFX%%BRKINT       Bit(01),/* Signal interrupt on break     */ 21650000
     5 PFX%%c_lflag         Bit(32),/* Local flags xx xx xx xx          21700000
                                         Byte 0: xx 00 00 00         */ 21750000
       10 PFX%%NOFLSH       Bit(01),/* Disable flush after interrupt,   21800000
                                         quit, or suspend        @P4M*/ 21850000
       10 PFX%%c_lRsvd1     Bit(07),/*                           @D1C*/ 21900000
                                    /*   Byte 1: 00 xx 00 00         */ 21950000
       10 PFX%%c_lRsvd2     Bit(01),/* Reserved                  @P4A*/ 22000000
       10 PFX%%TOSTOP       Bit(01),/* Send SIGTTOU for background      22050000
                                         output                  @P4M*/ 22100000
       10 PFX%%c_lRsvd3     Bit(06),/* Reserved                  @P4A*/ 22150000
                                    /*   Byte 2: 00 00 xx 00         */ 22200000
       10 PFX%%c_lRsvd4     Bit(08),/* Reserved                  @P4A*/ 22250000
                                    /*   Byte 3: 00 00 00 xx         */ 22300000
       10 PFX%%XCASE        Bit(1), /* Canonical Upper/Lower            22350000
                                         presentation            @D4M*/ 22400000
       10 PFX%%ISIG         Bit(01),/* Enable signals                */ 22450000
       10 PFX%%IEXTEN       Bit(01),/* Enable extended functions     */ 22500000
       10 PFX%%ICANON       Bit(01),/* Canonical input               */ 22550000
       10 PFX%%ECHO         Bit(01),/* Enable echo               @P4M*/ 22600000
       10 PFX%%ECHOK        Bit(01),/* Echo KILL                     */ 22650000
       10 PFX%%ECHOE        Bit(01),/* Echo ERASE as error correcting   22700000
                                         backspace                   */ 22750000
       10 PFX%%ECHONL       Bit(01),/* Echo new line             @P4M*/ 22800000
     5 PFX%%c_oflag         Bit(32),/*    Output flags               */ 22850000
       10 PFX%%c_oRsvd      Bit(15),/* Reserved                 @D1C */ 22900000
       10 PFX%%VTDLY        Bit(01),/* Vertical-tab delay type  @D1A */ 22950000
       10 PFX%%BSDLY        Bit(01),/* Backspace delay type     @D1A */ 23000000
       10 PFX%%FFDLY        Bit(01),/* Form-feed delay type     @D1A */ 23050000
       10 PFX%%CRDLY        Bit(02),/* CR delay type            @D1A */ 23100000
       10 PFX%%TABDLY       Bit(02),/* Tab delay type           @D1A */ 23150000
       10 PFX%%c_oRsvd1     Bit(01),/* Reserved                 @D1A */ 23200000
       10 PFX%%NLDLY        Bit(01),/* Newline delay type       @D1A */ 23250000
       10 PFX%%OFDEL        Bit(01),/* Use DEL, not NUL, for            23300000
                                         fill                   @D1C */ 23350000
       10 PFX%%OFILL        Bit(01),/* Use fill chars for delay @D1A */ 23400000
       10 PFX%%ONLRET       Bit(01),/* NL performs CR function  @D1A */ 23450000
       10 PFX%%ONOCR        Bit(01),/* No CR at column 0        @D1A */ 23500000
       10 PFX%%OCRNL        Bit(01),/* Map CR->NL on output     @D1A */ 23550000
       10 PFX%%ONLCR        Bit(01),/* Map NL->CR on output     @D1A */ 23600000
       10 PFX%%OLCUC        Bit(01),/* Map LC->UC on output     @D1A */ 23650000
       10 PFX%%OPOST        Bit(01),/* Perform output processing     */ 23700000
     5 PFX%%c_cc,                   /*    Special Characters         */ 23750000
       10 PFX%%VINTR        Char(1),/*    Interrupt       1          */ 23800000
       10 PFX%%VQUIT        Char(1),/*    Quit            2          */ 23850000
       10 PFX%%VERASE       Char(1),/*    Erase           3          */ 23900000
       10 PFX%%VKILL        Char(1),/*    Line Kill       4          */ 23950000
       10 PFX%%VEOF         Char(1),/*    End Of File     5          */ 24000000
       10 PFX%%VEOL         Char(1),/*    End Of Line     6          */ 24050000
       10 PFX%%VMIN         Char(1),/*    VMIN            7          */ 24100000
       10 PFX%%VSTART       Char(1),/*    Start           8          */ 24150000
       10 PFX%%VSTOP        Char(1),/*    Stop            9          */ 24200000
       10 PFX%%VSUSP        Char(1),/*    Suspend        10          */ 24250000
       10 PFX%%VTIME        Char(1);/*    VTIME          11          */ 24300000
 /********************************************************************/ 24350000
 /* Constants for baud rates                                         */ 24400000
 /********************************************************************/ 24450000
 Dcl                                                                    24500000
    PFX%%B0     Fixed(8) Constant(0),  /* 0  baud (hang-up)          */ 24550000
    PFX%%B50    Fixed(8) Constant(1),  /* 50 baud                    */ 24600000
    PFX%%B75    Fixed(8) Constant(2),  /* 75 baud                    */ 24650000
    PFX%%B110   Fixed(8) Constant(3),  /* 110 baud                   */ 24700000
    PFX%%B134   Fixed(8) Constant(4),  /* 134.5 baud                 */ 24750000
    PFX%%B150   Fixed(8) Constant(5),  /* 150 baud                   */ 24800000
    PFX%%B200   Fixed(8) Constant(6),  /* 200 baud                   */ 24850000
    PFX%%B300   Fixed(8) Constant(7),  /* 300 baud                   */ 24900000
    PFX%%B600   Fixed(8) Constant(8),  /* 600 baud                   */ 24950000
    PFX%%B1200  Fixed(8) Constant(9),  /* 1200 baud                  */ 25000000
    PFX%%B1800  Fixed(8) Constant(10), /* 1800 baud                  */ 25050000
    PFX%%B2400  Fixed(8) Constant(11), /* 2400 baud                  */ 25100000
    PFX%%B4800  Fixed(8) Constant(12), /* 4800 baud                  */ 25150000
    PFX%%B9600  Fixed(8) Constant(13), /* 9600 baud                  */ 25200000
    PFX%%B19200 Fixed(8) Constant(14), /* 19200 baud                 */ 25250000
    PFX%%B38400 Fixed(8) Constant(15); /* 38400 baud                 */ 25300000
 /********************************************************************/ 25350000
 /* Constants for CSIZE                                              */ 25400000
 /********************************************************************/ 25450000
 Dcl                                                                    25500000
   PFX%%CS5   Bit(02) Constant('00'B),/* B'00' - 5 bits/character    */ 25550000
   PFX%%CS6   Bit(02) Constant('01'B),/* B'01' - 6 bits/character    */ 25600000
   PFX%%CS7   Bit(02) Constant('10'B),/* B'10' - 7 bits/character    */ 25650000
   PFX%%CS8   Bit(02) Constant('11'B);/* B'11' - 8 bits/character    */ 25700000
 /********************************************************************/ 25750000
 /* Constants for VTDLY                                              */ 25800000
 /********************************************************************/ 25850000
 Dcl                                                         /* @D1A */ 25900000
   PFX%%VT0   Bit(01) Constant('0'B), /* VT delay type 0        @D1A */ 25950000
   PFX%%VT1   Bit(01) Constant('1'B); /* VT delay type 1        @D1A */ 26000000
 /********************************************************************/ 26050000
 /* Constants for BSDLY                                              */ 26100000
 /********************************************************************/ 26150000
 Dcl                                                         /* @D1A */ 26200000
   PFX%%BS0   Bit(01) Constant('0'B), /* BS delay type 0        @D1A */ 26250000
   PFX%%BS1   Bit(01) Constant('1'B); /* BS delay type 1        @D1A */ 26300000
 /********************************************************************/ 26350000
 /* Constants for FFDLY                                              */ 26400000
 /********************************************************************/ 26450000
 Dcl                                                         /* @D1A */ 26500000
   PFX%%FF0   Bit(01) Constant('0'B), /* FF delay type 0        @D1A */ 26550000
   PFX%%FF1   Bit(01) Constant('1'B); /* FF delay type 1        @D1A */ 26600000
 /********************************************************************/ 26650000
 /* Constants for CRDLY                                              */ 26700000
 /********************************************************************/ 26750000
 Dcl                                                         /* @D1A */ 26800000
   PFX%%CR0   Bit(02) Constant('00'B),/* CR delay type 0        @D1A */ 26850000
   PFX%%CR1   Bit(02) Constant('01'B),/* CR delay type 1        @D1A */ 26900000
   PFX%%CR2   Bit(02) Constant('10'B),/* CR delay type 2        @D1A */ 26950000
   PFX%%CR3   Bit(02) Constant('11'B);/* CR delay type 3        @D1A */ 27000000
 /********************************************************************/ 27050000
 /* Constants for TABDLY                                             */ 27100000
 /********************************************************************/ 27150000
 Dcl                                                         /* @D1A */ 27200000
   PFX%%TAB0  Bit(02) Constant('00'B),/* Tab delay type 0       @D1A */ 27250000
   PFX%%TAB1  Bit(02) Constant('01'B),/* Tab delay type 1       @D1A */ 27300000
   PFX%%TAB2  Bit(02) Constant('10'B),/* Tab delay type 2       @D1A */ 27350000
   PFX%%TAB3  Bit(02) Constant('11'B);/* Expand tabs to spaces  @D1A */ 27400000
 /********************************************************************/ 27450000
 /* Constants for NLDLY                                              */ 27500000
 /********************************************************************/ 27550000
 Dcl                                                         /* @D1A */ 27600000
   PFX%%NL0   Bit(01) Constant('0'B), /* NL delay type 0        @D1A */ 27650000
   PFX%%NL1   Bit(01) Constant('1'B); /* NL delay type 1        @D1A */ 27700000
 /********************************************************************/ 27750000
 /* Constants for tcsetattr() optional actions                       */ 27800000
 /********************************************************************/ 27850000
 Dcl                                                                    27900000
   PFX%%TCSANOW Fixed(32) Constant(0),   /* Change occurs immediately*/ 27950000
   PFX%%TCSADRAIN Fixed(32) Constant(1), /* Change occurs after all     28000000
                                              output has been           28050000
                                              written                */ 28100000
   PFX%%TCSAFLUSH Fixed(32) Constant(2); /* Change occurs after all     28150000
                                              output has been written   28200000
                                              and input has been        28250000
                                              discarded              */ 28300000
 /********************************************************************/ 28350000
 /* Constants for tcflush() queue selectors                          */ 28400000
 /********************************************************************/ 28450000
 Dcl                                                                    28500000
   PFX%%TCIFLUSH Fixed(32) Constant(0),  /* Flush data received but     28550000
                                              not read               */ 28600000
                                                                        28650000
   PFX%%TCOFLUSH Fixed(32) Constant(1),  /* Flush data written but      28700000
                                              not sent               */ 28750000
                                                                        28800000
   PFX%%TCIOFLUSH Fixed(32) Constant(2); /* Flush both data received    28850000
                                              but not read and data     28900000
                                              written but not sent   */ 28950000
 /********************************************************************/ 29000000
 /* Constants for tcflow() action values                             */ 29050000
 /********************************************************************/ 29100000
 Dcl                                                                    29150000
   PFX%%TCOOFF Fixed(32) Constant(0),    /* Suspend output           */ 29200000
   PFX%%TCOON  Fixed(32) Constant(1),    /* Restart suspended output */ 29250000
   PFX%%TCIOFF Fixed(32) Constant(2),    /* Transmit STOP character  */ 29300000
   PFX%%TCION  Fixed(32) Constant(3);    /* Transmit START character */ 29350000
* /*                   End of termios structure                      */ 29400000
