*        %GOTO CCAPRO  ;         /* Bilingual header                    00050000
         MACRO                                                          00100000
         BPXYCCA &DSECT=YES,&LIST=YES                                   00150000
         GBLB  &CCA411                                                  00200000
         AIF   (&CCA411 EQ 1).E411                                      00250000
&CCA411  SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYCCA: Msg Attributes for console_np service    00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%CCAPRO : ;                                                            00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYCCA) COMP(SCPX1) PROD(BPX):                              00750000
*                                                                       00800000
*01* MACRO NAME: BPXYCCA                                                00850000
*                                                                       00900000
*01* DSECT NAME: BPXYCCA                                                00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Msg Attributes for console_np service            01050000
*                                                                       01100000
*02*   ACRONYM: CCA                                                     01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1997,2000                       */ 01550000
*/*                                                                  */ 01650000
*/* STATUS= HBB7703                                                  */ 01700000
*/*                                                                  */ 01750000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01800000
*/*                                                                     01850000
*                                                                       01875000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* FUNCTION:                                                          02050000
*                                                                       02100000
*      The CCA maps a request to the console_np service to send         02150000
*      a msg to the operators console.                                  02200000
*                                                                       02250000
*01* METHOD OF ACCESS:                                                  02300000
*                                                                       02350000
*02*   PL/X:                                                            02400000
*                                                                       02450000
*        %INCLUDE SYSLIB(BPXYCCA)                                       02500000
*        By default, the CCA is based on CCAPtr.  If                    02550000
*        other basing is desired, use %CCABASE='BASED(XXXXXX)'.         02600000
*        If %CCABASE='BASED(CCAPTR)' is coded, a Declare for            02650000
*        CCAPTR is also generated.                                      02700000
*                                                                       02750000
*02*   ASM:                                                             02800000
*                                                                       02850000
*        With DSECT=NO, storage is allocated in line                    02900000
*        and addressability is provided thru that DSECT or CSECT.       02950000
*        With DSECT=YES, a DSECT is produced and "USING STAT,reg"       03000000
*        is required for addressability.  Here "reg" contains the       03050000
*        address of CCA#LENGTH bytes of storage.                        03100000
*        The default is DSECT=YES.                                      03150000
*                                                                       03200000
*01* SIZE: Release dependent.  Refer to the mapping.                    03250000
*                                                                       03300000
*01* POINTED TO BY: Input parameter of console_np system call           03350000
*                                                                       03400000
*01* CREATED BY: Invoker of console_np system call routine              03450000
*                                                                       03500000
*01* DELETED BY: Invoker of console_np system call routine              03550000
*                                                                       03600000
*01* STORAGE CCARIBUTES:                                                03650000
*02*   SUBPOOL: N/A                                                     03700000
*02*   KEY:     N/A                                                     03750000
*02*   RESIDENCY: Caller's Primary address space                        03800000
*                                                                       03850000
*01* FREQUENCY: 1 per console_np system call                            03900000
*                                                                       03950000
*01* SERIALIZATION: N/A                                                 04000000
*                                                                       04050000
*01* DEPENDENCIES: None                                                 04100000
*                                                                       04150000
*01* NOTES:                                                             04200000
*                                                                       04250000
*01* COMPONENT: OpenMVS (SCPX1)                                         04300000
*                                                                       04350000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04400000
*                                                                       04450000
*01* EYE-CATCHER: CCA                                                   04500000
*02*   OFFSET:  0                                                       04550000
*02*   LENGTH:  4                                                       04600000
*                                                                       04650000
*01* CHANGE-ACTIVITY:                                                   04700000
*                                                                       04750000
*    $L0=DSPA164  HOM1150 960223 PDJJ: Console Modify Support A164.01   04800000
*    $P1=PSP????  HOM1150 960328 PDJJ: Remove eye catcher               04850000
*    $01=OW44183  HBB7703 000110 PDJQ: Add desc/router codes A413.00    04919990
****END OF SPECIFICATIONS*********************************************/ 04950000
*        %GOTO CCAPLS   ;         /* Bilingual header                   05000000
.A411    ANOP  ,                                                        05050000
**  BPXYCCA:  Msg Attributes for console_np service                     05100000
**  Used By:  CCS                                                       05150000
         AIF   ('&DSECT' EQ 'NO').B411                                  05200000
CCA                  DSECT ,                                            05250000
         AGO   .C411                                                    05300000
.B411    ANOP  ,                                                        05350000
                     DS    0D                                           05400000
CCA                  DC    XL(CCA#LENGTH)'00'                           05450000
                     ORG   CCA                                          05500000
.C411    ANOP  ,                                                        05550000
CCABEGIN             DS    0D                                           05600000
*                                                                       05650000
CCAVERSION           DC    AL2(CCA#VER)                                 05700000
*                                 Version of this structure             05750000
CCARES01             DS    CL2    Reserved                              05800000
CCAMSGLENGTH         DS    F      Length of msg pointed to by CCAMSGPTR 05850000
CCAMSGPTR            DS    A      Pointer to Msg text                   05900000
CCARES02             DS    CL8    Reserved                              05950000
CCAENDVER1           DS    0C     End of Version 1                      06000990
CCASTARTVER2         DS    0C     Start of Version 2                    06001980
CCARES03             DS    F      Reserved                              06002970
CCAWTOPARMS          DS    0C     Start of WTO message attributes       06003960
CCAROUTCDELIST       DS    A      Pointer to list of message routing   X06004950
                                  codes                                 06005940
CCARES04             DS    F      Reserved                              06006930
CCADESCLIST          DS    A      Pointer to list of message           X06007920
                                  descriptor codes                      06008910
CCARES05             DS    F      Reserved                              06009900
CCAWMCSFLAGS         DS    0C     WTO MCS Flags                         06010890
CCAMCSFLAGB1         DS    XL1    MCS flags byte 1                      06011880
CCAHRDCPY            EQU   X'80'  Send message to hard copy log only    06012870
CCAMCSFLAGB2         DS    XL1    MCS flags byte 2                      06013860
CCAMCSFLAGB3         DS    XL1    MCS flags byte 3                      06014850
CCAMCSFLAGB4         DS    XL1    MCS flags byte 4                      06015840
CCAWTOTOKEN          DS    F      Token for message to be issued        06016830
CCAMSGIDPTR          DS    A      Pointer to location where message    X06017820
                                  is is stored by BPX1CCS               06018810
CCARES06             DS    F      Reserved                              06019800
CCARES07             DS    F      Reserved                              06020790
CCADOMPARMS          DS    0C     Delete message parameters             06021780
CCADOMTOKEN          DS    F      Token of message(s) to be deleted     06022770
CCAMSGIDLIST         DS    A      Pointer to list of message ids to    X06023760
                                  be deleted                            06024750
CCARES08             DS    F      Reserved                              06025740
CCAENDVER2           DS    0D     End of version 2                      06026730
*                                                                       06050000
*   Constants                                                           06100000
*                                                                       06150000
CCA#VER              EQU   CCA#VER01 Current version                    06200000
CCA#VER01            EQU   1         Version 1 of this structure        06250000
CCA#VER02            EQU   2         Version 2 of this structure        06270000
CCA#LENGTH           EQU   *-CCABEGIN                                  X06300000
                                     Length of CCA                      06350000
CCA#VER1LEN          EQU   CCAENDVER1-CCABEGIN                         X06400000
                                     Length of Version 1 CCA            06450000
CCA#VER2LEN          EQU   CCAENDVER2-CCABEGIN                         X06460000
                                     Length of Version 2 CCA            06470000
** BPXYCCA  End                                                         06500000
         SPACE 3                                                        06550000
         AIF   ('&LIST' EQ 'YES').E411                                  06600000
         POP   PRINT                                                    06650000
.E411    ANOP  ,                                                        06700000
         MEND                                                           06750000
  Terminating PL/X comment                                          */  06800000
*                                                                       06850000
 %CCAPLS : ;                                                            06900000
  %IF CCABASE = '' %THEN                                                06950000
    %DO;                                                                07000000
      %CCABASE = 'Based(CCAPtr)';                                       07050000
    %END;                                                               07100000
  %IF TRANSLATE(CCABASE) = 'BASED(CCAPTR)' %THEN                        07150000
    %DO;                                                                07200000
      DCL CCAPtr Ptr(31);           /* Pointer to the CCA            */ 07250000
    %END;                                                               07300000
 Dcl                                                                    07350000
  1  CCA        CCABASE,                                                07400000
   3 CCAVersion   Fixed(16),     /* +00 Version                      */ 07479990
   3 *            Bit(16),       /* +02 Reserved                     */ 07509980
   3 CCAMsgLength Fixed(32),     /* +04 Length of msg pointed to by     07539970
                                        CCAMsgPtr                    */ 07600000
   3 *,                          /*                                  */ 07653990
    5 CCAMsgPtr   Ptr(31),       /* +08 Pointer to Msg text          */ 07657980
    5 *           Char(4),       /*      Reserved                    */ 07661970
   3 *            Char(4),       /* +16  Reserved                    */ 07665960
   3 CCAEndVer1   Char(0),       /*      End of Version 1        @01C*/ 07669950
   3 CCAStartVer2,               /*      Start of version 2      @01A*/ 07673940
    5 *           Char(4),       /* +20  Reserved (dwd bdy)      @01A*/ 07677930
    5 CCAWTOParms,                                            /* @01A*/ 07681920
     7 *,                        /*                           /* @01A*/ 07685910
      9 CCARoutCdeList Ptr(31),  /* +24  Pointer to list of fullword    07689900
                                         routing codes           @01A*/ 07693890
      9 *              Char(4),                               /* @01A*/ 07697880
     7 *,                        /*                              @01A*/ 07701870
      9 CCADescList  Ptr(31),    /* +32  Pointer to list of fullword    07705860
                                         descriptor codes        @01A*/ 07709850
      9 *            Char(4),                                 /* @01A*/ 07713840
     7 CCAWMCSFlags Bit(32),     /* +40  WTO MCS Flags           @01A*/ 07717830
      9 CCAHrdCpy   Bit(1),      /*      Message to hardcopy log only   07721820
                                                                 @01A*/ 07725810
     7 CCAWTOToken    Fixed(32), /* +44  Token used to identify message 07729800
                                         (for later use by DOM)  @01A*/ 07733790
     7 *,                                                     /* @01A*/ 07737780
      9 CCAMsgIDPtr Ptr(31),     /* +48  Pointer to location where      07741770
                                   output message id is returned @01A*/ 07745760
      9 *            Char(4),                                 /* @01A*/ 07749750
     7 *             Char(4),    /* +56 Reserved (dwd bdy)       @01A*/ 07753740
    5 CCADOMParms,                                            /* @01A*/ 07757730
     7 CCADOMToken Fixed(32),    /* +60                          @01A*/ 07761720
     7 *,                        /*                              @01A*/ 07765710
      9 CCAMsgIdList Ptr(31),    /* +64                          @01A*/ 07769700
      9 *            Char(4),                                 /* @01A*/ 07773690
   3 CCAEndVer2   Char(0),       /*      End of Version 2        @01A*/ 07777680
   3 * Char(0) Bdy(Dword);       /*     Ensure CCA ends on doubleword   07800000
                                        boundary                     */ 07850000
                                                                        07900000
 DCL                                                                    07950000
   CCA#Len    Fixed(16) Constant(Length(CCA)), /* Length of CCA      */ 08000000
   CCA#Ver    Fixed(16) Constant(CCA#Ver01), /* Current version      */ 08050000
   CCA#Ver1Len Fixed(16) Constant(Offset(CCAEndVer1)), /* Length of     08100000
                                                Version 1            */ 08150000
   CCA#Ver2Len Fixed(16) Constant(Offset(CCAEndVer2)), /* Length of     08200490
                                                Version 2        @01A*/ 08200980
   CCA#Ver01  Fixed(16) Constant(1),         /* Version 1            */ 08201470
   CCA#Ver02  Fixed(16) Constant(2);         /* Version 2        @01A*/ 08201960
