*        %GOTO SFPRO    ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYSFPL  &DSECT=YES,&LIST=YES                                 00150000
         GBLB  &SF411                                                   00200000
         AIF   (&SF411 EQ 1).E411                                       00250000
&SF411 SETB    1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYSFPL: Send_File system call Parameter List    00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%SFPRO : ;                                                             00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYSFPL) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYSFPL                                               00850000
*                                                                       00900000
*01* DSECT NAME: SF                                                     00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Send_File Parmeter List                          01050000
*                                                                       01100000
*02*   ACRONYM: SFPL                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1998,2000                       */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7703                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01825000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01850000
*01* END OF EXTERNAL CLASSIFICATION:                                    01900000
*                                                                       01950000
*01* FUNCTION:                                                          02000000
*                                                                       02050000
*      The SFPL maps the parameter block for the send_file(BPX1SF)      02100000
*      callable service.                                                02150000
*                                                                       02200000
*01* METHOD OF ACCESS:                                                  02250000
*                                                                       02300000
*02*   PL/X:                                                            02350000
*                                                                       02400000
*        %INCLUDE SYSLIB(BPXYSFPL)                                      02450000
*                                                                       02500000
*02*   ASM:                                                             02550000
*        With DSECT=NO, storage is allocated in line                    02600000
*        and addressability is provided thru that DSECT or CSECT.       02650000
*        With DSECT=YES, a DSECT is produced and "USING SFPL,reg"       02700000
*        is required for addressability.  Here "reg" contains the       02750000
*        address of (SFPL#LENGTH) bytes of storage.                     02800000
*        The default is DSECT=YES.                                      02850000
*                                                                       02900000
*01* SIZE: Length(SFPL)                                                 02950000
*                                                                       03000000
*01* POINTED TO BY: n/a                                                 03050000
*                                                                       03100000
*01* CREATED BY: Storage obtained by caller of system call              03150000
*                                                                       03200000
*01* DELETED BY: Caller of system call                                  03250000
*                                                                       03300000
*01* STORAGE ATTRIBUTES:                                                03350000
*02*   SUBPOOL/DATASPACE:  N/A                                          03400000
*02*   KEY:                N/A                                          03450000
*02*   RESIDENCY:          N/A                                          03500000
*                                                                       03550000
*01* FREQUENCY: 1 per call to Send_file                                 03600000
*                                                                       03650000
*01* SERIALIZATION: N/A                                                 03700000
*                                                                       03750000
*01* DEPENDENCIES: None                                                 03800000
*                                                                       03850000
*01* NOTES:                                                             03900000
*                                                                       03950000
*01* COMPONENT:  OpenMVS (SCPX1)                                        04000000
*                                                                       04050000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04100000
*                                                                       04150000
*01* EYE-CATCHER: None                                                  04200000
*02*   OFFSET:                                                          04250000
*02*   LENGTH:                                                          04300000
*                                                                       04350000
*01* CHANGE-ACTIVITY:                                                   04400000
*                                                                       04450000
* $D0=DVTA217   HBB6606, 971218  PDJT: Initial Release (DCR A217.24)    04500000
* @P1=PWA0410   JBB6607, 980914  PDNU: Add the Assembler declarations   04525000
* @P2=PWK0806   HBB6608, 990309  PDNU: Get Assm declarations in Rel 8   04550000
* @P3=PWY0165   JBB6609, 990309  PDNU: Get Assm declarations in Rel 9   04575000
*                                                                       04600000
****END OF SPECIFICATIONS*********************************************/ 04650000
*        %GOTO SFPLS    ;         /* Bilingual header                   04700000
.A411    ANOP  ,                                                        04750000
** BPXYSFPL: SFPL system call structure                                 04800000
**  Used By: BPX1SF                                                     04850000
         AIF   ('&DSECT' EQ 'NO').B411                                  04900000
SFPL                 DSECT ,                                            04950000
         AGO   .C411                                                    05000000
.B411    ANOP  ,                                                        05050000
SFPL                 DS    0D                                           05100000
.C411    ANOP  ,                                                        05150000
SFSOCKETDES          DS    F         Socket Descriptor                  05200000
SFHEADERLEN          DS    F         Header Length                      05250000
SFHEADERVPTR         DS    0F                                           05300000
SFHEADERALET         DS    F         Header Alet                        05350000
SFHEADERPTR          DS    F         Header Ptr                         05400000
SFFILEDES            DS    F         File Descriptor                    05450000
SFFILEBYTESDW        DS    0F        Bytes to send Double Word (-1=all) 05500000
SFFILEBYTESH         DS    F          High Word                         05550000
SFFILEBYTESL         DS    F          Low  Word                         05600000
SFFILEOFFSETDW       DS    0F        Offset Double Word                 05650000
SFFILEOFFSETH        DS    F          High Word                         05700000
SFFILEOFFSETL        DS    F          Low  Word                         05750000
SFFILESIZEDW         DS    0F        File Size Double Word              05800000
SFFILESIZEH          DS    F          High Word                         05850000
SFFILESIZEL          DS    F          Low  Word                         05900000
SFTRAILERLEN         DS    F         Trailer Length                     05950000
SFTRAILERVPTR        DS    0F                                           06000000
SFTRAILERALET        DS    F          Trailer Alet                      06050000
SFTRAILERPTR         DS    F          Trailer Ptr                       06100000
SFBYTESSENTDW        DS    0F        Bytes Sent Double Word             06150000
SFBYTESSENTH         DS    F          High Word                         06200000
SFBYTESSENTL         DS    F          Low  Word                         06250000
SFFLAGS              DS    0XL4      Control Flags                      06300000
SFPLVERSION          DS    XL1        Version                           06350000
SFFLAGBYTE2          DS    XL1       Reserved                           06400000
SFFLAGBYTE3          DS    XL1       Reserved                           06450000
SFFLAGBYTE4          DS    XL1       Flags                              06500000
SF_CLOSE             EQU   2         Close Socket Descriptor            06550000
SF_REUSE             EQU   1         Reuse Socket Descriptor            06600000
SFRESERVE            DS    CL12      Reserved                           06650000
*                                                                       06700000
SFPLEND              EQU   *                                            06750000
*                                                                       06800000
SFPL#LENGTH          EQU   SFPLEND-SFPL                                 06850000
*                                                                       06900000
*  Constants                                                            06950000
*                                                                       07000000
*                                                                       07050000
** BPXYSFPL End                                                         07100000
         SPACE 3                                                        07150000
         AIF   ('&LIST' EQ 'YES').E411                                  07200000
         POP   PRINT                                                    07250000
.E411    ANOP  ,                                                        07300000
         MEND                                                           07350000
  Terminating PL/X comment                                           */ 07400000
*                                                                       07450000
 %SFPLS : ;                                                             07500000
                                                                        07550000
 /*------------------------------------------------------------------*/ 07600000
 /*  SFPL - Send_File Parameter List                                 */ 07650000
 /*------------------------------------------------------------------*/ 07700000
 Declare                                                                07750000
  1 SFPL Based Bdy(Word),                                               07800000
                                                                        07850000
    3 SFSocketDes      Fixed(31),    /* Socket Descriptor            */ 07900000
                                     /* Header Data:                 */ 07950000
    3 SFHeaderLen      Fixed(31),    /*    Length                    */ 08000000
    3 SFHeaderVptr ,                 /*    ViaPtr                    */ 08050000
      5 SFHeaderAlet   Fixed(32),    /*     Alet                     */ 08100000
      5 SFHeaderPtr    Ptr,          /*     Address                  */ 08150000
                                     /* File Data:                   */ 08200000
    3 SFFileDes        Fixed(31),    /*+10 Descriptor                */ 08250000
    3 SFFileBytesDW,                 /*    Bytes to Send, -1=All     */ 08300000
      5 SFFileBytesH   Fixed(31),    /*      High Word               */ 08350000
      5 SFFileBytesL   Fixed(32),    /*      Low Word                */ 08400000
    3 SFFileOffsetDW ,               /*    Offset Double Word        */ 08450000
      5 SFFileOffsetH  Fixed(31),    /*      High Word               */ 08500000
      5 SFFileOffsetL  Fixed(32),    /*+20   Low Word                */ 08550000
    3 SFFileSizeDW ,                 /*    Size Double Word          */ 08600000
      5 SFFileSizeH    Fixed(31),    /*      High Word               */ 08650000
      5 SFFileSizeL    Fixed(32),    /*      Low Word                */ 08700000
                                     /* Trailer Data:                */ 08750000
    3 SFTrailerLen     Fixed(31),    /*    Length                    */ 08800000
    3 SFTrailerVptr,                 /*    ViaPtr                    */ 08850000
      5 SFTrailerAlet  Fixed(32),    /*+30  Alet                     */ 08900000
      5 SFTrailerPtr   Ptr,          /*     Address                  */ 08950000
                                                                        09000000
    3 SFBytesSentDW,                 /* Bytes Actually Sent DWORD    */ 09050000
      5 SFBytesSentH   Fixed(31),    /*      High Word               */ 09100000
      5 SFBytesSentL   Fixed(32),    /*      Low Word                */ 09150000
                                                                        09200000
    3 SFFlags          Bit(32),      /*+40 Control Flags             */ 09250000
      5 SFPLversion     Fixed(8),    /*     Version                  */ 09300000
      5   *             Bit(16),                                        09350000
      5   *             Bit(8),                                         09400000
        7    *           Bit(6),                                        09450000
        7 SF_CLOSE       Bit(1),     /*     Close Socket Des         */ 09500000
        7 SF_REUSE       Bit(1),     /*     Reuse Socket Des         */ 09550000
    3 *                Char(12),                                        09600000
    3 SFPLEnd          Char(0);      /*+50*/                            09650000
                                                                        09700000
 /*------------------------------------------------------------------*/ 09750000
 /*  Constants                                                       */ 09800000
 /*------------------------------------------------------------------*/ 09850000
 Declare                                                                09900000
     SFPL_Ver0  Fixed(8)  Constant(0),            /* Initial Version */ 09950000
     SFPL#Len   Fixed(31) Constant(Length(SFPL)); /* SFPL length     */ 10000000
                                                                        10050000
