*        %GOTO OCRTPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYOCRT  &DSECT=YES,&LIST=YES                                 00150000
         GBLB  &OCRT411                                                 00200000
         AIF   (&OCRT411 EQ 1).E411                                     00250000
&OCRT411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYOCRT: OE Certificate support structure        00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%OCRTPRO : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXZOCRT) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYOCRT                                               00850000
*                                                                       00900000
*01* DSECT NAME: N/A                                                    00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: OpenMVS  Certificate support structure           01050000
*                                                                       01100000
*02*   ACRONYM: OCRT                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1998,2000                       */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7703                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       02150000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     02200000
*01* END OF EXTERNAL CLASSIFICATION:                                    02250000
*                                                                       02300000
*01* METHOD OF ACCESS:                                                  02350000
*                                                                       02400000
*02*   PL/X:                                                            02450000
*                                                                       02500000
*        %INCLUDE SYSLIB(BPXYOCRT)                                      02550000
*                                                                       02600000
*                                                                       02650000
*02*   ASM:                                                             02700000
*                                                                       02750000
*        BPXYOCRT                                                       02800000
*                                                                       02850000
*01* SIZE: Release dependent.  Refer to the mapping.                    02900000
*                                                                       02950000
*01* POINTED TO BY: There are multiple instances of this structure.     03000000
*                                                                       03050000
*01* CREATED BY:                                                        03100000
*    - Users of the syscall                                             03150000
*                                                                       03200000
*01* DELETED BY:                                                        03250000
*    -                                                                  03300000
*                                                                       03350000
*01* STORAGE ATTRIBUTES:                                                03400000
*02*   SUBPOOL: n/a                                                     03450000
*02*   KEY:  user key                                                   03500000
*02*   RESIDENCY:  n/a                                                  03550000
*                                                                       03600000
*01* FREQUENCY: N/A                                                     03650000
*                                                                       03700000
*01* SERIALIZATION:                                                     03750000
*      None.                                                            03800000
*                                                                       03850000
*01* DEPENDENCIES:                                                      03900000
*     None                                                              03950000
*                                                                       04000000
*01* NOTES:                                                             04050000
*                                                                       04100000
*                                                                       04150000
*01* COMPONENT: OpenMVS (SCPX1)                                         04200000
*                                                                       04250000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04300000
*                                                                       04350000
*01* EYE-CATCHER: n/a                                                   04400000
*02*   OFFSET:  n/a                                                     04450000
*02*   LENGTH:  n/a                                                     04500000
*                                                                       04550000
*01* CHANGE-ACTIVITY:                                                   04600000
*                                                                       04650000
*   $P0=PUX0140, HBB6605, 970528, PDSZ: Initial Creation,               04700000
*                                       Certificate support (OW26857)   04750000
* $P1=PUX0507 HBB6605 970731 PDJM: Rework bilingual assembler portion   04800000
****END OF SPECIFICATIONS*********************************************/ 04850000
*        %GOTO OCRTPLS  ;         /* Bilingual header                   04900000
.A411      ANOP  ,                                                      04950000
** BPXYOCRT: OE Certificate support structure                           05000000
**  Used By: TLS                                                        05050000
           AIF   ('&DSECT' EQ 'NO').B411                                05100000
OCRT       DSECT ,                                                      05150000
           AGO   .C411                                                  05200000
.B411      ANOP  ,                                                      05250000
OCRT       DS    0F                                                     05300000
.C411      ANOP  ,                                                      05350000
OCRTTYPE   DS    F      type of certificate attached                    05400000
OCRTUSERID DS    CL9    MVS userid, null terminated, input/output       05450000
           DS    CL3    reserved                                        05500000
OCRTCLEN   DS    F      length of certificate associated with type      05550000
OCRTCPTR   DS    A      ptr to the actual certifcate                    05600000
OCRT_LEN   EQU   *-OCRT                                                 05650000
OCRT_X509  EQU   1      Certificate type X509                           05700000
** BPXYOCRT End                                                         05750000
           SPACE 3                                                      05800000
           AIF   ('&LIST' EQ 'YES').E411                                05850000
           POP   PRINT                                                  05900000
.E411      ANOP  ,                                                      05950000
           MEND                                                         06000000
  Terminating PL/X comment                                          */  06050000
*                                                                       06100000
 %OCRTPLS : ;                                                           06150000
* %BPXYOCRT_INCLUDED = 'YES';                                           06200000
* %DCL ZCBPRINT CHAR EXT;                                               06250000
* %DEACTIVATE ZCBPRINT;                                                 06300000
* %DCL BPXYOCRT_LIST CHAR EXT;                                          06350000
* %DEACTIVATE BPXYOCRT_LIST;                                            06400000
* %IF BPXYOCRT_LIST ^= 'NO' &                                           06450000
*    ZCBPRINT ^= 'NO' %THEN                                             06500000
*   %GOTO BPXYOCRT_3;                                                   06550000
*   @LIST PUSH NOECHO;                                                  06600000
*   @LIST NOASSEMBLE NOECHO;                                            06650000
*   @LIST OFF C NOECHO;                                                 06700000
* %BPXYOCRT_3:;                                                         06750000
*/* Start of PL/X Source                                             */ 06800000
*                                                               @SPACE; 06850000
*  /**************************************************************/     06900000
*  /* Certificate request structure                              */     06950000
*  /**************************************************************/     07000000
*                                                                       07050000
*  DCl 1 OCRT BASED,                                                    07100000
*    3 OCRTType      FIXED(32),  /* type of certificate attached */     07150000
*    3 OCRTUserid    char(9),    /* userid, null terminated,     */     07200000
*                                /*  input and output field      */     07250000
*    3 *             char(3),    /* reserved                     */     07300000
*    3 OCRTCertLen   FIXED(32),  /* length of certificate */            07350000
*    3 OCRTCertPtr   POINTER;    /* ptr to the actual certifcate*/      07400000
*                                                                       07450000
*  /************************************************************/       07500000
*  /* Define Constants                                         */       07550000
*  /************************************************************/       07600000
*                                                                       07650000
*  /* Certificate types */                                              07700000
*  DCL OCRT_X509 FIXED(32) CONSTANT(1);                                 07750000
*                                                                       07800000
*                                                               @SPACE; 07850000
*/* End of PL/X Source                                               */ 07900000
* %IF BPXYOCRT_LIST ^= 'NO' &                                           07950000
*    ZCBPRINT ^= 'NO' %THEN                                             08000000
*   %GOTO BPXYOCRT_4;                                                   08050000
*   @LIST POP NOECHO;                                                   08100000
* %BPXYOCRT_4:;                                                         08150000
