*        %GOTO OPNFPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYOPNF  &DSECT=YES,&LIST=YES                       8@D1A     00150000
         GBLB  &OPNF411                                                 00200000
         AIF   (&OPNF411 EQ 1).E411                                     00250000
&OPNF411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYOPNF: Oflag constants specified               00400000
         PRINT OFF              on open system call                     00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%OPNFPRO : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYOPNF) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYOPNF                                               00850000
*                                                                       00900000
*01* DSECT NAME: O_FLAGS                                                00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Oflag constants specified                        01050000
*                      on open and fcntl system calls                   01100000
*                                                                       01150000
*02*   ACRONYM: OPNF                                                    01200000
**/                                                                     01250000
*/*01* PROPRIETARY STATEMENT=                                        */ 01300000
*/***PROPRIETARY_STATEMENT********************************************/ 01350000
*/*                                                                  */ 01400000
*/*                                                                  */ 01450000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01500000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01550000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,2000                       */ 01600000
*/*                                                                  */ 01700000
*/* STATUS= HBB7703                                                  */ 01750000
*/*                                                                  */ 01800000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01850000
*/*                                                                     01900000
*                                                                       01925000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01950000
*01* END OF EXTERNAL CLASSIFICATION:                                    02000000
*                                                                       02050000
*01* FUNCTION:                                                          02100000
*                                                                       02150000
*      The OPNF defines the open flags used on the OPEN and FCNTL       02200000
*      system calls.                                                    02250000
*                                                                       02300000
*01* METHOD OF ACCESS:                                                  02350000
*                                                                       02400000
*02*   PL/X:                                                            02450000
*                                                                       02500000
*        %INCLUDE SYSLIB(BPXYOPNF)                                      02550000
*        By default, the OPNF is based on O_FlagsPtr. If                02600000
*        other basing is desired, use %OPNFBASE='BASED(XXXXXX)'.        02650000
*        If %OPNFBASE='BASED(O_FlagsPtr)' is coded, a Declare for       02700000
*        O_FlagsPtr also generated.                                     02750000
*                                                                       02800000
*02*   ASM:                                                             02850000
*        With DSECT=NO, storage is allocated in line                    02900000
*        and addressability is provided thru that DSECT or CSECT.       02950000
*        With DSECT=YES, a DSECT is produced and "USING O_FLAGS,reg"    03000000
*        is required for addressability.  Here "reg" contains the       03050000
*        address of OPNF#LENGTH bytes of storage.                       03100000
*        The default is DSECT=YES.                                      03150000
*                                                                       03200000
*01* SIZE: OPNF#LENGTH = 4 bytes                                        03250000
*                                                                       03300000
*01* POINTED TO BY: O_FlagsPtr                                          03350000
*                                                                       03400000
*01* CREATED BY: Caller of system call                                  03450000
*                                                                       03500000
*01* DELETED BY: Caller of system call                                  03550000
*                                                                       03600000
*01* STORAGE ATTRIBUTES:                                                03650000
*02*   SUBPOOL/DATASPACE:  N/A                                          03700000
*02*   KEY:                N/A                                          03750000
*02*   RESIDENCY:          N/A                                          03800000
*                                                                       03850000
*01* FREQUENCY: Included with compile                                   03900000
*                                                                       03950000
*01* SERIALIZATION: N/A                                                 04000000
*                                                                       04050000
*01* DEPENDENCIES: None                                                 04100000
*                                                                       04150000
*01* NOTES: None                                                        04200000
*                                                                       04250000
*01* COMPONENT: OpenMVS (SCPX1)                                         04300000
*                                                                       04350000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04400000
*                                                                       04450000
*01* EYE-CATCHER: None                                                  04500000
*                                                                       04550000
*01* CHANGE-ACTIVITY:                                                   04600000
*                                                                       04650000
* $L0=POSIXXF  HOM1110 931201 PDSV: OpenMVS Initial Release             04700000
* $R0=PL70249  HOM1110,921201,PDJS: Have GETFL return O_Flags           04750000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               04800000
* $P2=PL70366  HOM1110 920908 PDSV: Macro commentary                    04850000
* $P3=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       04900000
* $D2=DOAA002  HOM1120 930505 PDJV: Integrated Sockets support          04950000
*                                       Dcr A002.01                     05000000
* $P4=PL70770  HOM1110 930615 PDJV: Add O_GETFL field to ASM            05050000
* $D3=DOAA035  HOM1120 930802 PDJV: Add O_SYNC support                  05100000
* $D4=DPFA065  HOM1130 940727 PDJV: Add Async Signal support            05150000
* $D5=DxxA213  HBB7703 990923 PDJT: O_NOLARGEFILE & O_LARGEFILE         05175000
*                                                                       05200000
****END OF SPECIFICATIONS*********************************************/ 05250000
*        %GOTO OPNFPLS  ;         /* Bilingual header                   05300000
.A411    ANOP  ,                                                        05350000
** BPXYOPNF: File status flags                                          05400000
**  Used By: FCT OPN                                                    05450000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     05500000
O_FLAGS              DSECT ,                                            05550000
         AGO   .C411                                                    05600000
.B411    ANOP  ,                                                        05650000
O_FLAGS              DS    0F                                           05700000
.C411    ANOP  ,                                                        05750000
O_FLAGS1             DS    B      Open flags - byte 1                   05800000
OPNFHIGH             EQU   X'80'  DO NOT USE THIS BIT!                  05850000
*                                 O_FLAGS must never be < 0             05900000
                     SPACE ,                                            05950000
O_FLAGS2             DS    B      Open flags - byte 2                   06000000
OPNFEXEC             EQU   X'80'  Execute access requested -            06050000
*                                 authorization required for use        06100000
                     SPACE ,                                            06150000
O_FLAGS3             DS    B      Open flags - byte 3                   06200000
O_NOLARGEFILE        EQU   X'08'  Large Files not allowed          @D5A 06216600
O_LARGEFILE          EQU   X'04'  Ignored                          @D5A 06233200
O_ASYNCSIG           EQU   X'02'  An asynchronous signal may occur @D4A 06250000
O_SYNC               EQU   X'01'  Force synchronous updates    @D3A     06300000
                     SPACE ,                                            06350000
O_FLAGS4             DS    B      Open flags - byte 4                   06400000
O_CREXCL             EQU   X'C0'  Create file only if non-existent      06450000
O_CREAT              EQU   X'80'  Create file                           06500000
O_EXCL               EQU   X'40'  Exclusive flag                        06550000
O_NOCTTY             EQU   X'20'  Not a controlling terminal            06600000
O_TRUNC              EQU   X'10'  Truncate flag                         06650000
O_APPEND             EQU   X'08'  Set offset to EOF on write            06700000
O_NONBLOCK           EQU   X'04'  Don't block this file                 06750000
FNDELAY              EQU   X'04'  Don't block this file        @D2A     06800000
O_RDWR               EQU   X'03'  Open for Read and Write               06850000
O_RDONLY             EQU   X'02'  Open for Read Only                    06900000
O_WRONLY             EQU   X'01'  Open for Write Only                   06950000
O_ACCMODE            EQU   X'03'  Mask for file access modes            07000000
O_GETFL              EQU   X'0F'  Mask for file access modes and        07050000
*                                 file status flags together   @P4A     07100000
                     SPACE ,                                            07150000
OPNF#LENGTH          EQU   *-O_FLAGS Length of this structure           07200000
** BPXYOPNF End                                                         07250000
         SPACE 3                                                        07300000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     07350000
         POP   PRINT                                                    07400000
.E411    ANOP  ,                                                        07450000
         MEND                                                           07500000
  Terminating PL/X comment                                          */  07550000
 %OPNFPLS : ;                                                           07600000
 %IF OPNFBASE='' %THEN                                                  07650000
   %DO;                                                                 07700000
     %OPNFBASE='BASED(O_FlagsPtr)';                                     07750000
   %END;                                                                07800000
  %IF OPNFBASE='BASED(O_FlagsPtr)' %THEN                                07850000
    %DO;                                                                07900000
      DCL O_FlagsPtr Ptr(31);        /* Pointer to the O_Flags        */07950000
    %END;                                                               08000000
 DCL 1 O_Flags Fixed(32) OPNFBASE,                                      08050000
  2 O_FLAGS1      Bit(8),          /*                             @D3A*/08100000
    3 OPNFHIGH      Bit(1),        /*DO NOT USE THIS BIT!               08150000
                                      O_Flags must never be < 0       */08200000
    3 OPNFRES1      Bit(7),        /* Reserved                        */08250000
  2 O_FLAGS2      Bit(8),          /*                             @D3A*/08300000
    3 OPNFEXEC      Bit(1),        /* Execute access requested -        08350000
                                      flag for authorized function    */08400000
    3 OPNFRES2      Bit(7),        /* Reserved                    @D3C*/08450000
  2 O_FLAGS3      Bit(8),          /*                             @D3A*/08500000
    3 OPNFRES3      Bit(4),        /* Reserved               @D3C @D4C*/08525000
    3 O_NOLARGEFILE Bit(1),        /* Large Files not allowed     @D5A*/08550000
    3 O_LARGEFILE   Bit(1),        /* Ignored                     @D5A*/08575000
    3 O_ASYNCSIG    Bit(1),        /* An asynchronous signal may occur  08600000
                                                                  @D4A*/08650000
    3 O_SYNC        Bit(1),        /* Force synchronous updates   @D3A*/08700000
  2 O_FLAGS4      Bit(8),          /*                             @D3A*/08750000
    3 O_CREXCL      Bit(2),        /* Create file only if non-existent*/08800000
      5 O_CREAT      Bit(1),       /* Create file                     */08850000
      5 O_EXCL       Bit(1),       /* Exclusive flag                  */08900000
    3 O_NOCTTY      Bit(1),        /* Not a controlling terminal      */08950000
    3 O_TRUNC       Bit(1),        /* Truncate flag                   */09000000
    3 O_APPEND      Bit(1),        /* Set offset to EOF on write      */09050000
    3 O_NONBLOCK    Bit(1),        /* Don't block this file           */09100000
      5 FNDELAY      Bit(1),       /* Don't block this file       @D2A*/09150000
    3 O_RDWR        Bit(2),        /* Open for Read and Write         */09200000
      5 O_RDONLY     Bit(1),       /* Open for Read Only              */09250000
      5 O_WRONLY     Bit(1);       /* Open for Write Only             */09300000
 /*  Mask for related flags    */                                       09350000
 DCL                                                                    09400000
  O_ACCMODE Bit(32) Constant('00000003'X),  /* Mask for file access     09450000
                                               modes                  */09500000
  O_GETFL   Bit(32) Constant('0000000F'X), /* Mask for file access      09550000
                                 modes and file status flags together */09600000
                                                                        09650000
  O_RDWR_on Bit(2) Constant('11'B),         /* Open for Read & Write  */09700000
  O_CREXCL_on Bit(2) Constant('11'B);       /* Create file only if      09750000
                                               non-existent           */09800000
