*                                                                       00000491
* %DCL BPXYDCOR_INCLUDED CHAR EXT;                                      00000981
* %DEACTIVATE BPXYDCOR_INCLUDED;                                        00001471
* %IF BPXYDCOR_INCLUDED = '' %THEN                                      00001961
* %DO;                                                                  00002451
*%/* Start of PL/X PreProlog Code */;                                   00002941
*                                                                       00003431
*%/* End of PL/X PreProlog Code */;                                     00003921
*/* Macro made bi-lingual on 00151. CBGEN compile date 00013         */ 00004411
*% /*                                                                   00004901
         MACRO                                                          00005391
         BPXYDCOR &DSECT=YES,&LIST=YES,&TITLE=YES,&PARMS=YES,          *00005881
               &ASIDLIST_MAP=COND,&PIDLIST_MAP=COND,&CONDINFO_MAP=COND  00006371
         GBLC  &BPXYDCOR_INCLUDED                                       00006861
         GBLC  &ZCBPRINT                                                00007351
&BPXYDCOR_INCLUDED SETC 'YES'                                           00007841
         AIF   ('&LIST' EQ 'NONE').P0                                   00008331
         AIF   ('&TITLE' EQ 'NO').P5                                    00008821
 TITLE   'BPXYDCOR  - dbx cordump cache information                   '*00009311
                                                                        00009801
.P5      ANOP                                                           00010291
**/ BPXYDCOR_1:;                                                        00010781
*/****START OF SPECIFICATIONS****************************************** 00011271
*                                                                       00011761
*    $MAC (BPXYDCOR) COMP(SCPX1) PROD(BPX):                             00012251
*                                                                       00012741
*01* MACRO NAME: BPXYDCOR                                               00013231
*                                                                       00013721
*01* DSECT NAME: BPXYDCOR                                               00014211
*                                                                       00014701
*01* DESCRIPTIVE NAME: dbx cordump cache information                    00015191
*                                                                       00015681
*02*   ACRONYM: DCOR                                                    00016171
*                                                                    */ 00016661
*/*01* PROPRIETARY STATEMENT=                                        */ 00017151
*/***PROPRIETARY_STATEMENT********************************************/ 00017641
*/*                                                                  */ 00018131
*/*                                                                  */ 00018621
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00019111
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00019601
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 2000                            */ 00020091
*/*                                                                  */ 00020581
*/* STATUS= HBB7703                                                  */ 00021071
*/*                                                                  */ 00021561
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00022051
*/*                                                                     00022541
*                                                                       00023031
*01* EXTERNAL CLASSIFICATION:  NONE                                     00023521
*01* END OF EXTERNAL CLASSIFICATION:                                    00024011
*                                                                       00024501
*01* FUNCTION:                                                          00024991
*                                                                       00025481
*    This file contains the mapping of dump related information use     00025971
*    by dbx when a dump is being formatted.                             00026461
*                                                                       00026951
*                                                                       00027441
*01* METHOD OF ACCESS:                                                  00027931
*                                                                       00028421
*02*   PL/X:                                                            00028911
*                                                                       00029401
*        %INCLUDE SYSLIB(BPXYDCOR)                                      00029891
*                                                                       00030381
*        By default, the DCOR is based on DCORPtr pointer.  If          00030871
*        other basing is desired, use %DCORBASE='BASED(xxxxxx)'.        00031361
*                                                                       00031851
*02*   ASM:                                                             00032341
*                                                                       00032831
*        None                                                           00033321
*                                                                       00033811
*01* SIZE: xxx bytes                                                    00034301
*            PARMS -- X'0020' bytes                                     00034791
*            ASIDLIST_MAP -- X'0028' bytes                              00035281
*            PIDLIST_MAP  -- X'0040' bytes                              00035771
*            CONDINFO_MAP -- X'0010' bytes                              00036261
*                                                                       00036751
*01* POINTED TO BY:                                                     00037241
*                                                                       00037731
*                                                                       00038221
*01* CREATED BY: BPXGMPTR                                               00038711
*                                                                       00039201
*01* DELETED BY: Process Termination (BPXGMCDE)                         00039691
*                                                                       00040181
*01* STORAGE ATTRIBUTES:                                                00040671
*02*   SUBPOOL:                                                         00041161
*02*   KEY: 0                                                           00041651
*02*   RESIDENCY: SYSZBPX1 data space                                   00042141
*                                                                       00042631
*01* FREQUENCY:                                                         00043121
*                                                                       00043611
*01* SERIALIZATION: CS instruction                                      00044101
*                                                                       00044591
*01* DEPENDENCIES: None                                                 00045081
*                                                                       00045571
*01* NOTES: None                                                        00046061
*                                                                       00046551
*01* COMPONENT: (SCPX1)                                                 00047041
*                                                                       00047531
*01* DISTRIBUTION LIBRARY:  AINTLIB                                     00048021
*                                                                       00048511
*01* EYE-CATCHER: DCOR                                                  00049001
*02*   OFFSET:  0                                                       00049491
*02*   LENGTH:  64                                                      00049981
*                                                                       00050471
*                                                                       00050961
*01* CHANGE-ACTIVITY:                                                   00051451
*                                                                       00051941
*  $01=OW44571, HBB7703 200521 PDZJ: dbx post mortem services           00052431
*                                                                       00052921
****END OF SPECIFICATIONS*********************************************/ 00053411
*% /*                                                                   00053901
.P0      ANOP                                                           00054391
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00054881
         AIF   ('&LIST' EQ 'YES').P2                                    00055371
.P1      ANOP                                                           00055861
         PUSH  PRINT                                                    00056351
         PRINT OFF                                                      00056841
.P2      ANOP                                                           00057331
*                                                                       00057821
* ********************************************************************  00058311
* *                                                                  *  00058801
* * Level information                                                *  00059291
* *                                                                  *  00059781
* ********************************************************************  00060271
*                                                                       00060761
*                                                                       00061251
DCOR_LEVEL1 EQU 65536    65536='00010000'x. Version 1 ('0001xxxx'x),   *00061741
                         change level 0 ('xxxx0000'x)                   00062231
*                                                                       00062721
* ********************************************************************  00063211
* *                                                                  *  00063701
* * Function codes for BPXGMCDE routine                              *  00064191
* *                                                                  *  00064681
* ********************************************************************  00065171
*                                                                       00065661
*                                                                       00066151
DCOR_OPEN# EQU 1                                                        00066641
DCOR_CLOSE# EQU 2                                                       00067131
DCOR_STATUS# EQU 3                                                      00067621
*                                                                       00068111
*    *****************************************************************  00068601
*    *                                                               *  00069091
*    * Open return codes                                             *  00069581
*    *                                                               *  00070071
*    *****************************************************************  00070561
*                                                                       00071051
*                                                                       00071541
DCOR_CDERC_OK EQU 0      The specified function completed successfully  00072031
DCOR_CDERC_PARMERR EQU 4 A parmeter error was detected. See return     *00072521
                         value 1 for more detail                        00073011
DCOR_CDERC_PROCERR EQU 8 A DCORE processing error occurred. See return *00073501
                         value 1 for more detail                        00073991
DCOR_CDERC_IKJTSOEVERR EQU 12 An error was encountered trying to       *00074481
                         establish a TSO environment with the IKJTSOEV *00074971
                         service. See return values for more           *00075461
                         information                                    00075951
DCOR_CDERC_IKJEFTSRERR EQU 16 An error was encountered trying to run   *00076441
                         the REXX EXEC with the IKJEFTSR service. See  *00076931
                         return values for more information             00077421
DCOR_CDERC_ALLOCATEERR EQU 20 An error was encountered trying to       *00077911
                         allocate one of the user specified data sets.  00078401
DCOR_CDERC_IRXinitErr  EQU 28 An error was encountered trying to       *00078891
                         establish a REXX environment.                  00079381
*                                                                       00079871
*    *****************************************************************  00080361
*    *                                                               *  00080851
*    * Status return codes                                           *  00081341
*    *                                                               *  00081831
*    *****************************************************************  00082321
*                                                                       00082811
*                                                                       00083301
DCOR_CDERC_STATUS_OPENCOMPLETE EQU 0                                    00083791
DCOR_CDERC_STATUS_OPENCONTINUING EQU 1                                  00084281
DCOR_CDERC_STATUS_OPENTERMINATED EQU 2                                  00084771
DCOR_CDERC_STATUS_INVALIDTOKEN EQU 3                                    00085261
*                                                                       00085751
*    *****************************************************************  00086241
*    *                                                               *  00086731
*    * Status Rc values when Status return code is                   *  00087221
*    * Dcor_CDErc_Status_OpenContinuing                              *  00087711
*    *                                                               *  00088201
*    *****************************************************************  00088691
*                                                                       00089181
*                                                                       00089671
DCOR_STATUS_CONT_STARTTSOENV EQU 0 Starting the TSO environment         00090161
DCOR_STATUS_CONT_EXECSTARTED EQU 1 BPXTIPCS started                     00090651
DCOR_STATUS_CONT_EXECCLIST EQU 2 BPXTIPCS allocating CLIST data set     00091141
DCOR_STATUS_CONT_DUMPDDIR EQU 3 BPXTIPCS allocating/creating dump      *00091631
                         directory via BLSCDDIR                         00092121
DCOR_STATUS_CONT_ALLOCDUMPDS EQU 4 BPXTIPCS allocating the dump data   *00092611
                         set                                            00093101
DCOR_STATUS_CONT_INVOKEIPCS EQU 5 BPXTIPCS invoking IPCS                00093591
DCOR_STATUS_CONT_INVOKEVERBX EQU 6 BPXTIPC2 invoking VERBX routine      00094081
DCOR_STATUS_CONT_ANALYSISSTART EQU 7 Dump analysis started              00094571
DCOR_STATUS_CONT_ANALYSISPROCASIDS EQU 8 Analysis processing Asids      00095061
DCOR_STATUS_CONT_EXECEXITING EQU 9 BPXTIPCS exiting                     00095551
*                                                                       00096041
*    *****************************************************************  00096531
*    *                                                               *  00097021
*    * R1 values when return code is Dcor_CDErc_ParmErr              *  00097511
*    *                                                               *  00098001
*    *****************************************************************  00098491
*                                                                       00098981
*                                                                       00099471
DCOR_R1_PARMERR_DUMPDSNREQ EQU 1 The name of a dump data set is        *00099961
                         required                                       00100451
DCOR_R1_PARMERR_HFSDSNREQ  EQU 2 The name of a dump data set in        *00100941
                         the HFS could not be found                     00101431
*                                                                       00101921
*      ***************************************************************  00102411
*      *                                                             *  00102901
*      * R1 values when return code is Dcor_CDErc_ProcErr            *  00103391
*      *                                                             *  00103881
*      ***************************************************************  00104371
*                                                                       00104861
*                                                                       00105351
DCOR_R1_PROCERR_SYSTEMERRATC EQU 1 An unexpected system error has      *00105841
                         occured while trying to establish the IPCS    *00106331
                         environment. The R2 value contains an ABEND   *00106821
                         reason code                                    00107311
*                                                                       00107801
*      ***************************************************************  00108291
*      *                                                             *  00108781
*      * R1 values when return code is Dcor_CDErc_AllocateErr        *  00109271
*      *                                                             *  00109761
*      ***************************************************************  00110251
*                                                                       00110741
*                                                                       00111231
DCOR_R1_ALLOCATEERR_LOGDSN EQU 1 Error allocating the log data set.    *00111721
                         The R2 field is the return code from          *00112211
                         allocation and the R3 field is the reason     *00112701
                         code.                                          00113191
DCOR_R1_ALLOCATEERR_EXECDSN EQU 2 Error allocating the EXEC data set.  *00113681
                         The R2 field is the return code from          *00114171
                         allocation and the R3 field is the reason     *00114661
                         code.                                          00115151
*                                                                       00115641
* ********************************************************************  00116131
* *                                                                  *  00116621
* * Function codes for BPXGMPTR Ptrace Dump Access Routine           *  00117111
* *                                                                  *  00117601
* ********************************************************************  00118091
*                                                                       00118581
*                                                                       00119071
DCOR_ASID_LIST# EQU 1                                                   00119561
DCOR_SET_ASID# EQU 2                                                    00120051
DCOR_PID_LIST# EQU 3                                                    00120541
DCOR_SET_PID# EQU 4                                                     00121031
DCOR_LDINFO# EQU 5                                                      00121521
DCOR_THREAD_LIST# EQU 6                                                 00122011
DCOR_THREAD_CURRENT# EQU 7                                              00122501
DCOR_SET_THREAD# EQU 8                                                  00122991
DCOR_PSW# EQU  9                                                        00123481
DCOR_GPR_LIST# EQU 10                                                   00123971
DCOR_THREAD_STATUS# EQU 11                                              00124461
DCOR_READ_D# EQU 12                                                     00124951
DCOR_ERROR_PSW# EQU 13                                                  00125441
DCOR_CAPTURE# EQU 14                                                    00125931
DCOR_ERROR_GPR_LIST# EQU 15                                             00126421
DCOR_FLT_LIST# EQU 16                                                   00126911
DCOR_ERROR_FLT_LIST# EQU 17                                             00127401
DCOR_CONDINFO# EQU 18                                                   00127891
DCOR_PTRRC_OKVALUE EQU 0 The specified function completed successfully  00128381
DCOR_PTRRC_ASIDNOTFOUND EQU 1 The requested asid(s) not in dump         00128871
DCOR_PTRRC_ASIDNOTSET EQU 2 An ASID or PID has not been established    *00129361
                         for this session                               00129851
DCOR_PTRRC_REQTYPENOTDEFINED EQU 3 The function type provided on this  *00130341
                         request is not supported by BPXGMPT2           00130831
DCOR_PTRRC_REQINVALIDTOKEN EQU 4 The open token provided on this       *00131321
                         request is not not valid                       00131811
DCOR_PTRRC_REQDCORTERMINATED EQU 5 Dcor dump access services are not   *00132301
                         available                                      00132791
DCOR_PTRRC_THREADNOTFOUND EQU 6 The request thread(s) were not in the  *00133281
                         dump                                           00133771
DCOR_PTRRC_THREADNOTSET EQU 7 The current thread has not been          *00134261
                         established                                    00134751
DCOR_PTRRC_PIDNOTSET EQU 9 The request PID(s) were not in the dump      00135241
DCOR_PTRRC_PIDNOTFOUND EQU 10 The current process has not been         *00135731
                         established                                    00136221
DCOR_PTRRC_STORAGENOTINDUMP EQU 11 The requested storage was not       *00136711
                         dumped                                         00137201
DCOR_PTRRC_NASTANDALONEDUMP EQU 12 Not supported in a standalone dump   00137691
DCOR_PTRRC_ABENDOCCURRED EQU 13 Not supported in a standalone dump      00138181
DCOR_PTRRC_STORAGELENGTHBAD EQU 14 The requested storage length was    *00138671
                         zero                                           00139161
RSNOKVALUE EQU 0                                                        00139651
RSNDCORERROR EQU 1       See Dcor return codes                          00140141
RSNMVSERROR EQU 2        Ususally an out of storage condition or an    *00140631
                         abend                                          00141121
RSNIPCSERROR EQU 3       When An IPCS error occurs use the DCOR log to *00141611
                         view the messages generated by IPCS (normally *00142101
                         suppress)                                      00142591
RSNCSVERROR EQU 4                                                       00143081
RSNCSVMODI12ERR EQU 1                                                   00143571
RSNCSVMODI3ERR EQU 2                                                    00144061
RSNCSVTOOMANYEXTENTS EQU 3                                              00144551
*                                                                       00145041
* ********************************************************************  00145531
* *   parameter definitions for BPXGMPTR Ptrace Dump Access Routine  *  00146021
* *   1. Parm     1   function code                                  *  00146511
* *   2. Parms    2   Token returned from DCOR_OPEN#                 *  00147001
* *   3. Parms    3-5 Function parameters                            *  00147491
* *   3. Parms    6-8 retvalue, retcode, rsncode                     *  00147981
* ********************************************************************  00148471
*                                                                       00148961
*                                                                       00149451
         AIF   ('&PARMS' EQ 'NO').L0002                                 00149941
         AIF   ('&DSECT' EQ 'YES').L0003                                00150431
         AIF   ('&PARMS' NE 'YES').L0002                                00150921
PARMS    DS    0F                                                       00151411
         AGO   .L0004                                                   00151901
.L0003   ANOP                                                           00152391
PARMS    DSECT                                                          00152881
.L0004   ANOP                                                           00153371
PARMS_FUNCTYPEPTR DS 1AL4                                               00153861
PARMS_DCOMTOKENPTR DS 1AL4                                              00154351
PARMS_INTERFACE DS 0CL0012                                              00154841
         ORG   PARMS_INTERFACE                                          00155331
PARMS_CAPTURE DS 0CL0012                                                00155821
PARMS_CAPTURE_PSTORADR DS 1AL4                                          00156311
PARMS_CAPTURE_PSTORLEN DS 1AL4                                          00156801
PARMS_CAPTURE_PDATAADR DS 1AL4 Address output buffer                    00157291
         ORG   PARMS_INTERFACE                                          00157781
PARMS_READD DS 0CL0012                                                  00158271
PARMS_READD_PSTORADR DS 1AL4                                            00158761
PARMS_READD_PSTORLEN DS 1AL4                                            00159251
PARMS_READD_PDATAADR DS 1AL4 user provided buffer                       00159741
         ORG   PARMS_INTERFACE                                          00160231
PARMS_LDINFO DS 0CL0004                                                 00160721
PARMS_LDINFO_OUTBUFPTR DS 1AL4                                          00161211
         ORG   PARMS_INTERFACE                                          00161701
PARMS_THREADLIST DS 0CL0008                                             00162191
PARMS_THREADLIST_OUTBUFPTR DS 1AL4                                      00162681
PARMS_THREADLIST_OUTBUFCNT DS 1AL4                                      00163171
         ORG   PARMS_INTERFACE                                          00163661
PARMS_PIDLIST DS 0CL0008                                                00164151
PARMS_PIDLIST_OUTBUFPTR DS 1AL4                                         00164641
PARMS_PIDLIST_OUTBUFCNT DS 1AL4                                         00165131
         ORG   PARMS_INTERFACE                                          00165621
PARMS_ASIDLIST DS 0CL0008                                               00166111
PARMS_ASIDLIST_OUTBUFPTR DS 1AL4                                        00166601
PARMS_ASIDLIST_OUTBUFCNT DS 1AL4                                        00167091
         ORG   PARMS_INTERFACE                                          00167581
PARMS_THREADCURRENT DS 0CL0004                                          00168071
PARMS_THREADCURRENT_OUTBUFPTR DS 1AL4                                   00168561
         ORG   PARMS_INTERFACE                                          00169051
PARMS_SETASID DS 0CL0004                                                00169541
PARMS_SETASID_INBUFPTR DS 1AL4                                          00170031
         ORG   PARMS_INTERFACE                                          00170521
PARMS_SETPID DS 0CL0004                                                 00171011
PARMS_SETPID_INBUFPTR DS 1AL4                                           00171501
         ORG   PARMS_INTERFACE                                          00171991
PARMS_SETTHREAD DS 0CL0004                                              00172481
PARMS_SETTHREAD_INBUFPTR DS 1AL4                                        00172971
         ORG   PARMS_INTERFACE                                          00173461
PARMS_PSW DS   0CL0004                                                  00173951
PARMS_PSW_OUTBUFPTR DS 1AL4                                             00174441
         ORG   PARMS_INTERFACE                                          00174931
PARMS_ERROR_PSW DS 0CL0004                                              00175421
PARMS_ERROR_PSW_OUTBUFPTR DS 1AL4                                       00175911
         ORG   PARMS_INTERFACE                                          00176401
PARMS_THREADSTATUS DS 0CL0008                                           00176891
PARMS_THREADSTATUS_OUTBUFPTR DS 1AL4                                    00177381
PARMS_THREADSTATUS_OUTBUFLEN DS 1AL4                                    00177871
         ORG   PARMS_INTERFACE                                          00178361
PARMS_GPRLIST DS 0CL0008                                                00178851
PARMS_GPRLIST_OUTBUFPTR DS 1AL4                                         00179341
PARMS_GPRLIST_OUTBUFLEN DS 1AL4                                         00179831
         ORG   PARMS_INTERFACE                                          00180321
PARMS_ERROR_GPRLIST DS 0CL0008                                          00180811
PARMS_ERROR_GPRLIST_OUTBUFPTR DS 1AL4                                   00181301
PARMS_ERROR_GPRLIST_OUTBUFLEN DS 1AL4                                   00181791
         ORG   PARMS_INTERFACE                                          00182281
PARMS_FLTLIST DS 0CL0008                                                00182771
PARMS_FLTLIST_OUTBUFPTR DS 1AL4                                         00183261
PARMS_FLTLIST_OUTBUFLEN DS 1AL4                                         00183751
         ORG   PARMS_INTERFACE                                          00184241
PARMS_ERROR_FLTLIST DS 0CL0008                                          00184731
PARMS_ERROR_FLTLIST_OUTBUFPTR DS 1AL4                                   00185221
PARMS_ERROR_FLTLIST_OUTBUFLEN DS 1AL4                                   00185711
         ORG   PARMS_INTERFACE                                          00186201
PARMS_CONDITIONINFO DS 0CL0008                                          00186691
PARMS_CONDITIONINFO_OUTBUFPTR DS 1AL4                                   00187181
PARMS_CONDITIONINFO_OUTBUFLEN DS 1AL4                                   00187671
         ORG   PARMS_INTERFACE+X'0000000C'                              00188161
PARMS_XRVPTR DS 1AL4     Return Value                                   00188651
PARMS_XRCPTR DS 1AL4     Return Code                                    00189141
PARMS_XRSNPTR DS 1AL4    Reason Code                                    00189631
PARMS_LEN EQU  *-PARMS                                                  00190121
.L0002   ANOP                                                           00190611
         AIF   ('&ASIDLIST_MAP' EQ 'NO').L0005                          00191101
         AIF   ('&DSECT' EQ 'YES').L0006                                00191591
         AIF   ('&ASIDLIST_MAP' NE 'YES').L0005                         00192081
ASIDLIST_MAP DS 0D                                                      00192571
         AGO   .L0007                                                   00193061
.L0006   ANOP                                                           00193551
ASIDLIST_MAP DSECT                                                      00194041
.L0007   ANOP                                                           00194531
ASID_NEXTOFF DS 1FL4     Offset to the next ASID in DcomAsidList        00195021
ASID_NUM DS    1FL2                                                     00195511
ASID_CPU DS    1FL1      CPUID                                          00196001
ASID_FLAGS DS  0BL1      Status flags                                   00196491
ASID_HOME EQU  X'80'     Current HOMEAsid                               00196981
ASID_PRIM EQU  X'40'     Current PRIMARY ASID                           00197471
ASID_SEC EQU   X'20'     Current SECONDARY ASID                         00197961
         ORG   ASID_FLAGS+X'00000001'                                   00198451
ASID_JOBNAME DS 1CL0009                                                 00198941
         DS    1CL0003   Reserved                                       00199431
ASID_PIDCNT DS 1FL4      Number of Pids in this Asid                    00199921
ASID_ASCB DS   1AL4      Pointer to ASCB                                00200411
         DS    1CL0004   Reserved                                       00200901
ASID_PIDLISTPTR DS 1AL4  Pointer to the pidlist for This Asid           00201391
         DS    1CL0004   Reserved                                       00201881
ASID_MAPEND DS 0C        end of block                                   00202371
ASIDLIST_MAP_LEN EQU *-ASIDLIST_MAP                                     00202861
.L0005   ANOP                                                           00203351
         AIF   ('&PIDLIST_MAP' EQ 'NO').L0008                           00203841
         AIF   ('&DSECT' EQ 'YES').L0009                                00204331
         AIF   ('&PIDLIST_MAP' NE 'YES').L0008                          00204821
PIDLIST_MAP DS 0D                                                       00205311
         AGO   .L000A                                                   00205801
.L0009   ANOP                                                           00206291
PIDLIST_MAP DSECT                                                       00206781
.L000A   ANOP                                                           00207271
PID_NEXTOFF DS 1FL4      Offset to the next Pid in DcomPidList          00207761
PID_     DS    1FL4      Process id                                     00208251
PID_ASID DS    1FL2      Asid of this Pid                               00208741
PID_THIDCNT DS 1FL2      Count of thids in this pid                     00209231
PID_FOCUSTHREAD DS 1CL0008 Ptrace focus thread                          00209721
PID_ERRORTHREAD DS 1CL0008 Ptrace error thread                          00210211
PID_LOGINNAME DS 1CL0009 Tso logon                                      00210701
         DS    1CL0003   Reserved                                       00211191
PID_THIDLISTPTR DS 1AL4  list info for each THID                        00211681
         DS    1CL0004   Reserved                                       00212171
PID_PENDINGSIGMASK DS 1BL8 Signals pending at the process that could   *00212661
                         not be delivered to any thread                 00213151
PID_BLOCKEDSIGMASK DS 1BL8 Signals blocked on all thread                00213641
PID_MAPEND DS  0C        end of block                                   00214131
PIDLIST_MAP_LEN EQU *-PIDLIST_MAP                                       00214621
.L0008   ANOP                                                           00215111
         AIF   ('&CONDINFO_MAP' EQ 'NO').L000B                          00215601
         AIF   ('&DSECT' EQ 'YES').L000C                                00216091
         AIF   ('&CONDINFO_MAP' NE 'YES').L000B                         00216581
CONDINFO_MAP DS 0D                                                      00217071
         AGO   .L000D                                                   00217561
.L000C   ANOP                                                           00218051
CONDINFO_MAP DSECT                                                      00218541
.L000D   ANOP                                                           00219031
COND_CURABENDINFO DS 0CL0016 If current task abended                    00219521
COND_CURINTCODE DS 1FL2  Interrupt code                                 00220011
COND_CURSIGNUMBER DS 1FL2 Signal number raised                          00220501
COND_CURABENDCODE DS 0BL4 Abend code                                    00220991
COND_CURABENDFLAGS DS 1BL1 System or user                               00221481
COND_CURABENDCC DS 1BL3  Abend Number                                   00221971
COND_CURABENDREASON DS 1BL4 Abend Reason                                00222461
COND_CURILC DS 1FL2      Instruction length                             00222951
         DS    1CL0002   Reserved                                       00223441
CONDINFO_MAPEND DS 0C    end of block                                   00223931
CONDINFO_MAP_LEN EQU *-CONDINFO_MAP                                     00224421
.L000B   ANOP                                                           00224911
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00225401
         AIF   ('&LIST' EQ 'YES').P4                                    00225891
.P3      ANOP                                                           00226381
         POP   PRINT                                                    00226871
.P4      ANOP                                                           00227361
.P_EXIT  ANOP                                                           00227851
         MEND                                                           00228341
**/ BPXYDCOR_2:;                                                        00228831
* %BPXYDCOR_INCLUDED = 'YES';                                           00229321
* %DCL ZCBPRINT CHAR EXT;                                               00229811
* %DEACTIVATE ZCBPRINT;                                                 00230301
* %DCL BPXYDCOR_LIST CHAR EXT;                                          00230791
* %DEACTIVATE BPXYDCOR_LIST;                                            00231281
* %IF BPXYDCOR_LIST ^= 'NO' &                                           00231771
*    ZCBPRINT ^= 'NO' %THEN                                             00232261
*   %GOTO BPXYDCOR_3;                                                   00232751
*   @LIST PUSH NOECHO;                                                  00233241
*   @LIST NOASSEMBLE NOECHO;                                            00233731
*   @LIST OFF C NOECHO;                                                 00234221
* %BPXYDCOR_3:;                                                         00234711
*/* Start of PL/X Source                                             */ 00235201
*                                                                       00235691
*   @EJECT;                                                             00236181
*                                                                       00236671
*/********************************************************************/ 00237161
*/*                                                                  */ 00237651
*/* Level information                                                */ 00238141
*/*                                                                  */ 00238631
*/********************************************************************/ 00239121
*                                                                       00239611
*   DECLARE                                                             00240101
*     Dcor_Level1  Fixed(32) Constant(65536); /* 65536='00010000'x.     00240591
*                                      Version 1 ('0001xxxx'x), change  00241081
*                                      level 0 ('xxxx0000'x)         */ 00241571
*                                                                       00242061
*/********************************************************************/ 00242551
*/*                                                                  */ 00243041
*/* Function codes for BPXGMCDE routine                              */ 00243531
*/*                                                                  */ 00244021
*/********************************************************************/ 00244511
*                                                                       00245001
*   DECLARE                                                             00245491
*     Dcor_OPEN#   Fixed(31) Constant(1),                               00245981
*     Dcor_CLOSE#  Fixed(31) Constant(2),                               00246471
*     Dcor_STATUS# Fixed(31) Constant(3);                               00246961
*   /* Open return codes                                             */ 00247451
*   DECLARE                                                             00247941
*     Dcor_CDErc_OK Fixed(31) Constant(0), /* The specified function    00248431
*                                         completed successfully */     00248921
*     Dcor_CDErc_ParmErr Fixed(31) Constant(4), /* A parmeter error     00249411
*                                         was detected. See return      00249901
*                                         value 1 for more detail */    00250391
*     Dcor_CDErc_ProcErr Fixed(31) Constant(8), /* A DCORE processing   00250881
*                                         error occurred. See return    00251371
*                                         value 1 for more detail */    00251861
*     Dcor_CDErc_IKJTSOEVErr Fixed(31) Constant(12), /* An error was    00252351
*                                         encountered trying to         00252841
*                                         establish a TSO environment   00253331
*                                         with the IKJTSOEV service.    00253821
*                                         See  return values for more   00254311
*                                         information */                00254801
*     Dcor_CDErc_IKJEFTSRErr Fixed(31) Constant(16), /* An error was    00255291
*                                         encountered trying to run the 00255781
*                                         REXX EXEC with the IKJEFTSR   00256271
*                                         service.  See  return values  00256761
*                                         for more information */       00257251
*     Dcor_CDErc_AllocateErr Fixed(31) Constant(20), /* An error was    00257741
*                                         encountered trying to         00258231
*                                         allocate one of the user      00258721
*                                         specified data sets.       */ 00259211
*     Dcor_CDErc_IRXinitErr  Fixed(31) Constant(28); /* An error was    00259701
*                                         encountered trying to         00260191
*                                         establish a REXX              00260681
*                                         environment                */ 00261171
*   /*****************************************************************/ 00261661
*   /* Status return codes                                           */ 00262151
*   /*****************************************************************/ 00262641
*   DECLARE                                                             00263131
*     Dcor_CDErc_Status_OpenComplete Fixed(31) Constant(0), /* */       00263621
*     Dcor_CDErc_Status_OpenContinuing Fixed(31) Constant(1), /* */     00264111
*     Dcor_CDErc_Status_OpenTerminated Fixed(31) Constant(2), /* */     00264601
*     Dcor_CDErc_Status_InvalidToken Fixed(31) Constant(3); /* */       00265091
*   /*****************************************************************/ 00265581
*   /* Status Rc values when Status return code is                   */ 00266071
*   /* Dcor_CDErc_Status_OpenContinuing                              */ 00266561
*   /*****************************************************************/ 00267051
*   DECLARE                                                             00267541
*     Dcor_Status_Cont_StartTSOENV Fixed Constant(0), /* Starting the   00268031
*                                         TSO environment            */ 00268521
*     Dcor_Status_Cont_ExecStarted Fixed Constant(1), /* BPXTIPCS       00269011
*                                         started                    */ 00269501
*     Dcor_Status_Cont_ExecCLIST   Fixed Constant(2), /* BPXTIPCS       00269991
*                                         allocating CLIST data set  */ 00270481
*     Dcor_Status_Cont_DumpDDIR    Fixed Constant(3), /* BPXTIPCS       00270971
*                                         allocating/creating dump      00271461
*                                         directory via BLSCDDIR     */ 00271951
*     Dcor_Status_Cont_AllocDumpDS Fixed Constant(4), /* BPXTIPCS       00272441
*                                         allocating the dump data set  00272931
*                                                                    */ 00273421
*     Dcor_Status_Cont_InvokeIPCS  Fixed Constant(5), /* BPXTIPCS       00273911
*                                         invoking IPCS              */ 00274401
*     Dcor_Status_Cont_InvokeVERBX Fixed Constant(6), /* BPXTIPC2       00274891
*                                         invoking VERBX routine     */ 00275381
*     Dcor_Status_Cont_AnalysisStart Fixed Constant(7), /* Dump         00275871
*                                         analysis started           */ 00276361
*     Dcor_Status_Cont_AnalysisProcAsids Fixed Constant(8), /* Analysis 00276851
*                                         processing Asids           */ 00277341
*     Dcor_Status_Cont_ExecExiting Fixed Constant(9); /* BPXTIPCS       00277831
*                                         exiting                    */ 00278321
*   /*****************************************************************/ 00278811
*   /* R1 values when return code is Dcor_CDErc_ParmErr              */ 00279301
*   /*****************************************************************/ 00279791
*   DECLARE                                                             00280281
*     Dcor_R1_ParmErr_DumpDsnReq  Fixed(31) Constant(1), /* The name of 00280771
*                                         a dump data set is required   00281261
*                                                                    */ 00281751
*     Dcor_R1_ParmErr_HFSDsnReq   Fixed(31) Constant(2), /* The name of 00282241
*                                         a dump data set in the HFS    00282731
*                                         could not be found         */ 00283221
*     /***************************************************************/ 00283711
*     /* R1 values when return code is Dcor_CDErc_ProcErr            */ 00284201
*     /***************************************************************/ 00284691
*     Dcor_R1_ProcErr_SystemErrATC Fixed(31) Constant(1), /* An         00285181
*                                      unexpected system error has      00285671
*                                      occured while trying to          00286161
*                                      establish the IPCS               00286651
*                                      environment. The R2 value        00287141
*                                      contains an ABEND reason code */ 00287631
*     /***************************************************************/ 00288121
*     /* R1 values when return code is Dcor_CDErc_AllocateErr        */ 00288611
*     /***************************************************************/ 00289101
*     Dcor_R1_AllocateErr_LogDsn Fixed(31) Constant(1), /* Error        00289591
*                                         allocating the log data set.  00290081
*                                         The R2 field is the return    00290571
*                                         code from allocation and      00291061
*                                         the R3 field is the reason    00291551
*                                         code.                      */ 00292041
*     Dcor_R1_AllocateErr_ExecDsn Fixed(31) Constant(2); /* Error       00292531
*                                         allocating the EXEC data set. 00293021
*                                         The R2 field is the return    00293511
*                                         code from allocation and      00294001
*                                         the R3 field is the reason    00294491
*                                         code.                      */ 00294981
*                                                                       00295471
*/********************************************************************/ 00295961
*/*                                                                  */ 00296451
*/* Function codes for BPXGMPTR Ptrace Dump Access Routine           */ 00296941
*/*                                                                  */ 00297431
*/********************************************************************/ 00297921
*                                                                       00298411
*                                                                       00298901
*   DECLARE                                                             00299391
*     Dcor_ASID_LIST#       Fixed(32) Constant(1),                      00299881
*     Dcor_SET_ASID#        Fixed(32) Constant(2),                      00300371
*     Dcor_PID_LIST#        Fixed(32) Constant(3),                      00300861
*     Dcor_SET_PID#         Fixed(32) Constant(4),                      00301351
*     Dcor_LDINFO#          Fixed(32) Constant(5),                      00301841
*     Dcor_THREAD_LIST#     Fixed(32) Constant(6),                      00302331
*     Dcor_THREAD_CURRENT#  Fixed(32) Constant(7),                      00302821
*     Dcor_SET_THREAD#      Fixed(32) Constant(8),                      00303311
*     Dcor_PSW#             Fixed(32) Constant(9),                      00303801
*     Dcor_GPR_LIST#        Fixed(32) Constant(10),                     00304291
*     Dcor_THREAD_STATUS#   Fixed(32) Constant(11),                     00304781
*     Dcor_READ_D#          Fixed(32) Constant(12),                     00305271
*     DCOR_ERROR_PSW#       FIXED(32) Constant(13),                     00305761
*     Dcor_CAPTURE#         Fixed(32) Constant(14),                     00306251
*     Dcor_ERROR_GPR_LIST#  Fixed(32) Constant(15),                     00306741
*     Dcor_FLT_LIST#        Fixed(32) Constant(16),                     00307231
*     Dcor_ERROR_FLT_LIST#  Fixed(32) Constant(17),                     00307721
*     Dcor_CONDINFO#        Fixed(32) Constant(18);                     00308211
*                                                                       00308701
*   DECLARE                                                             00309191
*     Dcor_PTRrc_OkValue               Fixed(32) Constant(0),           00309681
*                                          /* The specified function    00310171
*                                         completed successfully */     00310661
*     Dcor_PTRrc_AsidNotFound          Fixed(32) Constant(1),           00311151
*                                          /* The requested asid(s)     00311641
*                                         not in dump            */     00312131
*     Dcor_PTRrc_AsidNotSet            Fixed(32) Constant(2),           00312621
*                                          /* An ASID or PID has not    00313111
*                                         been established for this     00313601
*                                         session                */     00314091
*     Dcor_PTRrc_ReqTypeNotDefined     Fixed(32) Constant(3),           00314581
*                                          /* The function type         00315071
*                                         provided on this request      00315561
*                                         is not supported by           00316051
*                                         BPXGMPT2                */    00316541
*     Dcor_PTRrc_ReqInvalidToken       Fixed(32) Constant(4),           00317031
*                                          /* The open token            00317521
*                                         provided on this request      00318011
*                                         is not not valid        */    00318501
*     Dcor_PTRrc_ReqDcorTerminated     Fixed(32) Constant(5),           00318991
*                                          /* Dcor dump access          00319481
*                                         services are not              00319971
*                                         available               */    00320461
*     Dcor_PTRrc_ThreadNotFound        Fixed(32) Constant(6),           00320951
*                                          /* The request thread(s)     00321441
*                                         were not in the dump    */    00321931
*     Dcor_PTRrc_ThreadNotSet          Fixed(32) Constant(7),           00322421
*                                          /* The current thread has    00322911
*                                          not been established   */    00323401
*     Dcor_PTRrc_PidNotSet             Fixed(32) Constant(9),           00323891
*                                          /* The request PID(s)        00324381
*                                         were not in the dump    */    00324871
*     Dcor_PTRrc_PidNotFound           Fixed(32) Constant(10),          00325361
*                                          /* The current process has   00325851
*                                          not been established   */    00326341
*     Dcor_PTRrc_StorageNotInDump      Fixed(32) Constant(11),          00326831
*                                          /* The requested storage     00327321
*                                          was not dumped         */    00327811
*     Dcor_PTRrc_NaStandAloneDump      Fixed(32) Constant(12),          00328301
*                                          /* Not supported in a        00328791
*                                          standalone dump        */    00329281
*     Dcor_PTRrc_AbendOccurred         Fixed(32) Constant(13),          00329771
*                                          /* Not supported in a        00330261
*                                          standalone dump        */    00330751
*     Dcor_PTRrc_StorageLengthBad      Fixed(32) Constant(14);          00331241
*                                          /* The requested storage     00331731
*                                          length was zero        */    00332221
*   DECLARE                                                             00332711
*     RsnOkValue            Fixed(32) Constant(0),                      00333201
*     RsnDcorError          Fixed(32) Constant(1),                      00333691
*                                    /*  See Dcor return codes    */    00334181
*     RsnMvsError           Fixed(32) Constant(2),                      00334671
*                                    /* Ususally an out of storage      00335161
*                                       condition or an abend        */ 00335651
*     RsnIpcsError          Fixed(32) Constant(3),                      00336141
*                                    /* When An IPCS error occurs       00336631
*                                       use the DCOR log to view        00337121
*                                       the messages generated by       00337611
*                                       IPCS (normally suppress)     */ 00338101
*     RsnCsvError  Fixed(32) Constant(4);                               00338591
*   DECLARE                                                             00339081
*     RsnCsvModi12Err Fixed(32) Constant(1),                            00339571
*     RsnCsvModi3Err Fixed(32) Constant(2),                             00340061
*     RsnCsvTooManyExtents Fixed(32) Constant(3);                       00340551
*                                                                       00341041
*/********************************************************************/ 00341531
*/*   parameter definitions for BPXGMPTR Ptrace Dump Access Routine  */ 00342021
*/*   1. Parm     1   function code                                  */ 00342511
*/*   2. Parms    2   Token returned from DCOR_OPEN#                 */ 00343001
*/*   3. Parms    3-5 Function parameters                            */ 00343491
*/*   3. Parms    6-8 retvalue, retcode, rsncode                     */ 00343981
*/********************************************************************/ 00344471
*                                                                       00344961
*   DECLARE                                                             00345451
*     1    Parms    Based(DcomReqParmPtr),                              00345941
*       3    Parms_FuncTypePtr ptr,                                     00346431
*       3    Parms_DcomTokenPtr ptr,                                    00346921
*       3    Parms_Interface Char(12) bdy(word) union,                  00347411
*         5    Parms_Capture,                                           00347901
*           7    Parms_Capture_pStorAdr ptr,                            00348391
*           7    Parms_Capture_pStorLen ptr,                            00348881
*           7    Parms_Capture_pDataAdr ptr, /* Address output buffer*/ 00349371
*         5    Parms_ReadD,                                             00349861
*           7    Parms_ReadD_pStorAdr ptr,                              00350351
*           7    Parms_ReadD_pStorLen ptr,                              00350841
*           7    Parms_ReadD_pDataAdr ptr, /* user provided buffer   */ 00351331
*         5    Parms_LdInfo,                                            00351821
*           7    Parms_Ldinfo_OutBufPtr ptr,                            00352311
*         5    Parms_THREADLIST,                                        00352801
*           7    Parms_ThreadList_OutBufPtr ptr,                        00353291
*           7    Parms_ThreadList_OutBufCnt ptr,                        00353781
*         5    Parms_PidList,                                           00354271
*           7    Parms_PidList_OutBufPtr ptr,                           00354761
*           7    Parms_PidList_OutBufCnt ptr,                           00355251
*         5    Parms_AsidList,                                          00355741
*           7    Parms_AsidList_OutBufPtr ptr,                          00356231
*           7    Parms_AsidList_OutBufCnt ptr,                          00356721
*         5    Parms_ThreadCurrent,                                     00357211
*           7    Parms_ThreadCurrent_OutBufPtr ptr,                     00357701
*         5    Parms_SetAsid,                                           00358191
*           7    Parms_SetAsid_InBufPtr ptr,                            00358681
*         5    Parms_SetPid,                                            00359171
*           7    Parms_SetPid_InBufPtr ptr,                             00359661
*         5    Parms_SetThread,                                         00360151
*           7    Parms_SetThread_InBufPtr ptr,                          00360641
*         5    Parms_Psw,                                               00361131
*           7    Parms_Psw_OutBufPtr ptr,                               00361621
*         5    Parms_ERROR_PSW,                                         00362111
*           7    Parms_ERROR_PSW_OutBufPtr ptr,                         00362601
*         5    Parms_ThreadStatus,                                      00363091
*           7    Parms_ThreadStatus_OutBufPtr ptr,                      00363581
*           7    Parms_ThreadStatus_OutBufLen ptr,                      00364071
*         5    Parms_GprList,                                           00364561
*           7    Parms_GprList_OutBufPtr ptr,                           00365051
*           7    Parms_GprList_OutBufLen ptr,                           00365541
*         5    Parms_ERROR_GPRLIST,                                     00366031
*           7    Parms_ERROR_GPRLIST_OutBufPtr ptr,                     00366521
*           7    Parms_ERROR_GPRLIST_OutBufLen ptr,                     00367011
*         5    Parms_FLTList,                                           00367501
*           7    Parms_FLTList_OutBufPtr ptr,                           00367991
*           7    Parms_FLTList_OutBufLen ptr,                           00368481
*         5    Parms_ERROR_FltList,                                     00368971
*           7    Parms_ERROR_FltList_OutBufPtr ptr,                     00369461
*           7    Parms_ERROR_FltList_OutBufLen ptr,                     00369951
*         5    Parms_ConditionInfo,                                     00370441
*           7    Parms_ConditionInfo_OutBufPtr ptr,                     00370931
*           7    Parms_ConditionInfo_OutBufLen ptr,                     00371421
*       3    Parms_xRvPtr Ptr,      /* Return Value                  */ 00371911
*       3    Parms_xRcPtr Ptr,      /* Return Code                   */ 00372401
*       3    Parms_xRsnPtr Ptr,     /* Reason Code                   */ 00372891
*     Parms_FuncType fixed Based(Parms_FuncTypePtr),                    00373381
*     Parms_xRv      fixed Based(Parms_xRvPtr),                         00373871
*     Parms_xRc      fixed Based(Parms_xRcPtr),                         00374361
*     Parms_xRsn     fixed Based(Parms_xRsnPtr),                        00374851
*     Parms_DcomToken ptr Based(Parms_DcomTokenPtr),                    00375341
*     Parms_Capture_StorAdr ptr based(Parms_Capture_pStorAdr),          00375831
*     Parms_Capture_StorLen fixed based(Parms_Capture_pStorLen),        00376321
*     Parms_Capture_DataAdr ptr Based(Parms_Capture_pDataAdr),          00376811
*     Parms_ReadD_StorAdr ptr based(Parms_ReadD_pStorAdr),              00377301
*     Parms_ReadD_StorLen fixed based(Parms_ReadD_pStorLen),            00377791
*     Parms_LdInfo_DataAdr ptr Based(Parms_Ldinfo_OutBufPtr),           00378281
*     Parms_ThreadList_DataAdr ptr Based(Parms_ThreadList_OutBufPtr),   00378771
*     Parms_ThreadList_Count fixed Based(Parms_ThreadList_OutBufCnt),   00379261
*     Parms_PidList_DataAdr ptr Based(Parms_PidList_OutBufPtr),         00379751
*     Parms_PidList_Count Fixed Based(Parms_PidList_OutBufCnt),         00380241
*     Parms_AsidList_DataAdr ptr Based(Parms_AsidList_OutBufPtr),       00380731
*     Parms_AsidList_Count Fixed Based(Parms_AsidList_OutBufCnt),       00381221
*     Parms_ThreadCurrent_Data Char(8)                                  00381711
*                  Based(Parms_ThreadCurrent_OutBufPtr),                00382201
*     Parms_SetAsid_Value Fixed(16)                                     00382691
*                  Based(Parms_SetAsid_InBufPtr),                       00383181
*     Parms_SetPid_Value   Fixed(32)                                    00383671
*                  Based(Parms_SetPid_InBufPtr),                        00384161
*     Parms_SetThread_Value Char(8)                                     00384651
*                  Based(Parms_SetThread_InBufPtr),                     00385141
*     Parms_Psw_Data Char(16)                                           00385631
*                  Based(Parms_Psw_OutBufPtr),                          00386121
*     Parms_ERROR_PSW_Data Char(16)                                     00386611
*                  Based(Parms_ERROR_PSW_OutBufPtr),                    00387101
*     Parms_ThreadStatus_DataAdr ptr                                    00387591
*                       Based(Parms_ThreadStatus_OutBufPtr),            00388081
*     Parms_ThreadStatus_DataLen Fixed                                  00388571
*                       Based(Parms_ThreadStatus_OutBufLen),            00389061
*     Parms_GprList_DataAdr ptr Based(Parms_GprList_OutBufPtr),         00389551
*     Parms_GprList_DataLen Fixed Based(Parms_GprList_OutBufLen),       00390041
*     Parms_ERROR_GPRLIST_DataAdr ptr                                   00390531
*                    Based(Parms_ERROR_GPRLIST_OutBufPtr),              00391021
*     Parms_ERROR_GPRLIST_DataLen                                       00391511
*                        Fixed Based(Parms_ERROR_GPRLIST_OutBufLen),    00392001
*     Parms_FltList_DataAdr ptr Based(Parms_FltList_OutBufPtr),         00392491
*     Parms_FltList_DataLen Fixed Based(Parms_FltList_OutBufLen),       00392981
*     Parms_ERROR_FltList_DataAdr ptr                                   00393471
*               Based(Parms_ERROR_FltList_OutBufPtr),                   00393961
*     Parms_ERROR_FltList_DataLen Fixed                                 00394451
*               Based(Parms_ERROR_FltList_OutBufLen),                   00394941
*     Parms_ConditionInfo_DataAdr ptr                                   00395431
*               Based(Parms_ConditionInfo_OutBufPtr),                   00395921
*     Parms_ConditionInfo_DataLen Fixed                                 00396411
*               Based(Parms_ConditionInfo_OutBufLen);                   00396901
*   DECLARE                                                             00397391
*     1    AsidList_Map BDY(DWORD) Based,                               00397881
*       3   Asid_NextOff Fixed(32), /* Offset to the next ASID in       00398371
*                                      DcomAsidList                  */ 00398861
*       3   Asid_Num  Fixed(16),                                        00399351
*       3   Asid_Cpu  UNSIGNED BINARY(8), /* CPUID                   */ 00399841
*       3   Asid_Flags BIT(8),      /* Status flags                  */ 00400331
*         5   Asid_Home BIT(1),     /* Current HOMEAsid              */ 00400821
*         5   Asid_Prim BIT(1),     /* Current PRIMARY ASID          */ 00401311
*         5   Asid_Sec  BIT(1),     /* Current SECONDARY ASID        */ 00401801
*         5    *        BIT(5),     /* Reserved                      */ 00402291
*       3   Asid_JobName Char(9),                                       00402781
*       3    *           Char(3),   /* Reserved                      */ 00403271
*       3   Asid_PidCnt Fixed(32),  /* Number of Pids in this Asid   */ 00403761
*       3   Asid_Ascb POINTER(31),  /* Pointer to ASCB               */ 00404251
*       3    *        CHAR(4),      /* Reserved                      */ 00404741
*       3   Asid_PidListPtr Ptr,    /* Pointer to the pidlist for       00405231
*                                        This Asid                   */ 00405721
*       3    *        CHAR(4),      /* Reserved                      */ 00406211
*       3   Asid_MapEnd char(0) Bdy(Dword); /* end of block          */ 00406701
*   DECLARE                                                             00407191
*     1    PidList_Map BDY(DWORD) Based,                                00407681
*       3   Pid_NextOff Fixed(32),   /* Offset to the next Pid in       00408171
*                                      DcomPidList                   */ 00408661
*       3   Pid_      Fixed(32),     /* Process id                   */ 00409151
*       3   Pid_Asid  Fixed(16),     /* Asid of this Pid             */ 00409641
*       3   Pid_ThidCnt Fixed(16),   /* Count of thids in this pid   */ 00410131
*       3   Pid_FocusThread Char(8), /* Ptrace focus thread          */ 00410621
*       3   Pid_ErrorThread Char(8), /* Ptrace error thread          */ 00411111
*       3   Pid_LoginName Char(9),   /* Tso logon                    */ 00411601
*       3    *            Char(3),   /* Reserved                     */ 00412091
*       3   Pid_ThidListPtr Ptr(31), /* list info for each THID      */ 00412581
*       3    *            Char(4),   /* Reserved                     */ 00413071
*       3   Pid_PendingSigMask Bit(64),                                 00413561
*                                    /* Signals pending at the process  00414051
*                                      that could not be delivered to   00414541
*                                      any thread                    */ 00415031
*       3   Pid_BlockedSigMask Bit(64),                                 00415521
*                                    /* Signals blocked on all thread   00416011
*                                                                    */ 00416501
*       3   Pid_MapEnd char(0) Bdy(Dword); /* end of block           */ 00416991
*   DECLARE                                                             00417481
*     1    CondInfo_Map BDY(DWORD) Based,                               00417971
*       3   Cond_CurAbendInfo,      /* If current task abended       */ 00418461
*         5  Cond_CurIntCode Fixed(16),                                 00418951
*                                   /* Interrupt code                */ 00419441
*         5  Cond_CurSigNumber Fixed(16),                               00419931
*                                   /* Signal number raised          */ 00420421
*         5  Cond_CurAbendCode Bit(32),                                 00420911
*                                   /* Abend code                    */ 00421401
*           7   Cond_CurAbendFlags Bit(8),                              00421891
*                                   /* System or user                */ 00422381
*           7   Cond_CurAbendCC   Bit(24),                              00422871
*                                   /* Abend Number                  */ 00423361
*         5  Cond_CurAbendReason Bit(32),                               00423851
*                                   /* Abend Reason                  */ 00424341
*         5  Cond_CurIlc   Fixed(15),                                   00424831
*                                   /* Instruction length            */ 00425321
*         5  * Char(2),             /* Reserved                      */ 00425811
*       3   CondInfo_MapEnd char(0) Bdy(Dword); /* end of block      */ 00426301
*/* End of PL/X Source                                               */ 00426791
* %IF BPXYDCOR_LIST ^= 'NO' &                                           00427281
*    ZCBPRINT ^= 'NO' %THEN                                             00427771
*   %GOTO BPXYDCOR_4;                                                   00428261
*   @LIST POP NOECHO;                                                   00428751
* %BPXYDCOR_4:;                                                         00429241
* %END;                                                                 00429731
