*                                                                       00050000
* %DCL BPXYSMFR_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE BPXYSMFR_INCLUDED;                                        00150000
* %IF BPXYSMFR_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99120. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         BPXYSMFR &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD92=YES,       *00450000
               &SMF92SSS=COND,&SMF92ID=COND,&SMF92FSM=COND,            *00500000
               &SMF92FSP=COND,&SMF92FSS=COND,&SMF92FSR=COND,           *00550000
               &SMF92FSU=COND,&SMF92FSV=COND,&SMF92FOP=COND,           *00600000
               &SMF92FCL=COND,&SMF92MMP=COND,&SMF92MUN=COND             00650000
         GBLC  &BPXYSMFR_INCLUDED                                       00700000
         GBLC  &ZCBPRINT                                                00750000
&BPXYSMFR_INCLUDED SETC 'YES'                                           00800000
         AIF   ('&LIST' EQ 'NONE').P0                                   00816600
         AIF   ('&TITLE' EQ 'NO').P5                                    00833200
 TITLE   'BPXYSMFR  - OpenMVS File System SMF Record format           '*00850000
                                                                        00900000
.P5      ANOP                                                           00925000
**/ BPXYSMFR_1:;                                                        00950000
*/****START OF SPECIFICATIONS****************************************** 01000000
*                                                                       01050000
*    $MAC (BPXYSMFR) COMP(SCPX1) PROD(BPX):                             01100000
*                                                                       01150000
*01* MACRO NAME: BPXYSMFR                                               01200000
*                                                                       01250000
*01* DSECT NAME: SMFRCD92                                               01300000
*                                                                       01350000
*01* DESCRIPTIVE NAME: OpenMVS File System SMF Record format            01400000
*                                                                       01450000
*02*   ACRONYM: SMFR                                                    01500000
**/                                                                     01550000
*/*01* PROPRIETARY STATEMENT=                                        */ 01600000
*/***PROPRIETARY_STATEMENT********************************************/ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01800000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01850000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,2000                       */ 01900000
*/*                                                                  */ 02000000
*/* STATUS= HBB7703                                                  */ 02050000
*/*                                                                  */ 02100000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02150000
*/*                                                                     02200000
*                                                                       02225000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     02250000
*01* END OF EXTERNAL CLASSIFICATION:                                    02300000
*                                                                       02350000
*01* FUNCTION:                                                          02400000
*                                                                       02450000
*      The SMFRCD92 maps the structure of SMF record type 92 which      02500000
*      is written at OpenMVS file open or close, file system            02550000
*      mount, remount or unmount, file system suspend or resume,        02600000
*      and file memory map or unmap.                                    02650000
*                                                                       02700000
*01* METHOD OF ACCESS:                                                  02750000
*                                                                       02800000
*02*   PL/X:                                                            02850000
*                                                                       02900000
*        %INCLUDE SYSLIB(BPXYSMFR)                                      02950000
*        By default, the SMFRCD92 is based on SMF92PTR. If              03000000
*        other basing is desired, use %SMFRBASE='BASED(XXXXXX)'.        03050000
*        If %SMFRBASE='BASED(SMF92PTR)' is coded, a declare for         03100000
*        SMF92PTR is also generated.                                    03150000
*                                                                       03200000
*01* SIZE:                                                              03250000
*            SMFRCD92 -- X'0034' bytes                                  03253500
*            SMF92SSS -- X'0014' bytes                                  03257000
*            SMF92ID  -- X'0048' bytes                                  03260500
*            SMF92FSM -- X'006C' bytes                                  03264000
*            SMF92FSP -- X'0002' bytes                                  03267500
*            SMF92FSS -- X'0051' bytes                                  03271000
*            SMF92FSR -- X'0059' bytes                                  03274500
*            SMF92FSU -- X'0094' bytes                                  03278000
*            SMF92FSV -- X'0094' bytes                                  03281500
*            SMF92FOP -- X'0018' bytes                                  03285000
*            SMF92FCL -- X'0084' bytes                                  03288500
*            SMF92MMP -- X'0018' bytes                                  03292000
*            SMF92MUN -- X'0028' bytes                                  03295500
*01*             SMFRCD92 -- X'0034' bytes                              03300000
*01*             SMF92SSS -- X'0014' bytes                              03350000
*01*             SMF92ID  -- X'0048' bytes                              03400000
*01*             SMF92FSM -- X'006C' bytes                              03450000
*01*             SMF92FSP -- X'0002' bytes                              03500000
*01*             SMF92FSS -- X'0050' bytes                              03550000
*01*             SMF92FSR -- X'0058' bytes                              03600000
*01*             SMF92FSU -- X'0094' bytes                              03650000
*01*             SMF92FOP -- X'0018' bytes                              03700000
*01*             SMF92FCL -- X'0044' bytes                              03750000
*01*             SMF92MMP -- X'0018' bytes                              03800000
*01*             SMF92MUN -- X'0028' bytes                              03850000
*                                                                       03900000
*01* POINTED TO BY: SMF92PTR                                            03950000
*                                                                       04000000
*01* CREATED BY:                                                        04050000
*             Open file record            - BPXFSOPN                    04100000
*             Close file record           - BPXFSCLS                    04150000
*             Mount file System record    - BPXFSLIT and BPXFSMNT       04200000
*             Unmount File System record  - BPXFSUMT                    04250000
*             Suspend File System record  - BPXFSQSE                    04300000
*             Resume File System record   - BPXFSUQS                    04350000
*             Mmap record                 - BPXGYVDA                    04400000
*             Munmap record               - BPXGYVDA                    04450000
*                                                                       04500000
*01* DELETED BY: Caller of SMFEWTM                                      04550000
*                                                                       04600000
*01* STORAGE ATTRIBUTES:                                                04650000
*02*   SUBPOOL:            N/A                                          04700000
*02*   KEY:                N/A                                          04750000
*02*   RESIDENCY:          N/A                                          04800000
*                                                                       04850000
*01* FREQUENCY: 1 per call to SMFEWTM                                   04900000
*                                                                       04950000
*01* SERIALIZATION: N/A                                                 05000000
*                                                                       05050000
*01* DEPENDENCIES: None                                                 05100000
*                                                                       05150000
*01* NOTES:  The assembly language portion of this macro is             05200000
*            generated using the CBGEN tool - it is not                 05250000
*            to be edited manually.                                     05300000
*                                                                       05350000
*                                                                       05400000
*01* COMPONENT: OpenMVS (SCPX1)                                         05450000
*                                                                       05500000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     05550000
*                                                                       05600000
*01* EYE-CATCHER: none                                                  05650000
*                                                                       05700000
*01* CHANGE-ACTIVITY:                                                   05750000
*                                                                       05800000
*      $L0=POSIXXF  HOM1110 921201 PDP1: OpenMVS Initial Release        05850000
*      $P1=PL70342  HOM1110 920721 PDJT: Change Line Item Flag to XF    05900000
*      $L1=D0AA006  HOM1120 930419 PDI6: OpenMVS Multi-Process Support  05950000
*      $D1=DOAA009  HOM1120 930812 PDEA: Wellington NFS Server Support  06000000
*                                        for Dcr A009.04                06050000
*      $D2=DOAA002  HOM1120 930816 PDEA: (dcr A002.12) SMF support for  06100000
*                                        socket                         06150000
*      $P2=POA0294  HOM1120 940201 PDEA: Change the version number      06200000
*      $P2=PPF0001  HOM1130 940201 PDEA: Change the version number      06250000
*      $P3=POA0421  HOM1120 940415 PDNU: SMF Accounting                 06300000
*      $P3=PPF0006  HOM1130 940415 PDNU: SMF Accounting                 06350000
*      $D3=DPFA065  HOM1130 940628 PDPB: A065.03 MMAP support           06400000
*      $D4=DPFA052  HOM1130 940630 PDEA: A052.05 NFSC support           06450000
*      $D5=DPFA091  HOM1130 941103 PDSV: DCR A091.02 Automountd/remount 06500000
*      $D6=DUXA217  HBB6605 970411 PDSK: NFS Performance Items A217.12  06550000
*      $D7=DCA0309  JBB6609 990410 PDRD: DCR A309 Support               06575000
****END OF SPECIFICATIONS*********************************************/ 06600000
*% /*                                                                   06650000
.P0      ANOP                                                           06675000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06700000
         AIF   ('&LIST' EQ 'YES').P2                                    06750000
.P1      ANOP                                                           06800000
         PUSH  PRINT                                                    06850000
         PRINT OFF                                                      06900000
.P2      ANOP                                                           06950000
         AIF   ('&SMFRCD92' EQ 'NO').L0002                              07000000
         AIF   ('&DSECT' EQ 'YES').L0003                                07050000
         AIF   ('&SMFRCD92' NE 'YES').L0002                             07100000
SMFRCD92 DS    0D                                                       07150000
         AGO   .L0004                                                   07200000
.L0003   ANOP                                                           07250000
SMFRCD92 DSECT                                                          07300000
.L0004   ANOP                                                           07350000
SMF92RPS DS    0CL0052   Fixed record sections                          07400000
*                                                                       07450000
*                                                                       07500000
*    SMF Record Header Section                                          07550000
*                                                                       07600000
*                                                                       07650000
*                                                                       07700000
SMF92RHD DS    0CL0028   Record header section                          07750000
SMF92LEN DS    1FL2      Record length                                  07800000
SMF92SEG DS    1FL2      Segment descriptor                             07850000
SMF92FLG DS    0BL1      Header flag byte                               07900000
SMF92SSF EQU   X'80'     Bit 0 - Subsys ID after Sys ID                 07950000
SMF92SBT EQU   X'40'     Bit 1 - Subtypes utilized                      08000000
         ORG   SMF92FLG+X'00000001'                                     08050000
SMF92RTY DS    1BL1      Record type - 92 ('5C'x)                       08100000
SMF92TME DS    1FL4      Record written time                            08150000
SMF92DTE DS    1FL4      Record written date                            08200000
SMF92SID DS    1CL0004   System identifier                              08250000
SMF92WID DS    1CL0004   Subsystem identifier                           08300000
SMF92STP DS    1FL2      Record subtype                                 08350000
         DS    1CL0002   Reserved                                       08400000
SMF92SDL DS    1FL2      Length of self-defining section                08450000
*                                                                       08500000
*                                                                       08550000
*    Self Defining Section                                              08600000
*                                                                       08650000
*                                                                       08700000
*                                                                       08750000
SMF92SDS DS    0CL0024                                                  08800000
SMF92SOF DS    1FL4      Offset to subsystem section                    08850000
SMF92SLN DS    1FL2      Length of subsystem section                    08900000
SMF92SON DS    1FL2      Number of subsystem sections                   08950000
SMF92IOF DS    1FL4      Offset of identification section               09000000
SMF92ILN DS    1FL2      Length of identification section               09050000
SMF92ION DS    1FL2      Number of identification section               09100000
SMF92DOF DS    1FL4      Offset of data section                         09150000
SMF92DLN DS    1FL2      Length of data section                         09200000
SMF92DON DS    1FL2      Number of data sections                        09250000
SMFRCD92_LEN EQU *-SMFRCD92                                             09300000
.L0002   ANOP                                                           09350000
*                                                                       09400000
*                                                                       09450000
*    Subsystem Section                                                  09500000
*                                                                       09550000
*                                                                       09600000
*                                                                       09650000
         AIF   ('&SMF92SSS' EQ 'NO').L0005                              09700000
         AIF   ('&DSECT' EQ 'YES').L0006                                09750000
         AIF   ('&SMF92SSS' NE 'YES').L0005                             09800000
SMF92SSS DS    0H                                                       09850000
         AGO   .L0007                                                   09900000
.L0006   ANOP                                                           09950000
SMF92SSS DSECT                                                          10000000
.L0007   ANOP                                                           10050000
SMF92TYP DS    1FL2      Record subtype, 1 = File system mount, 2 =    *10100000
                         File system suspend, 4 = File system resume,  *10150000
                         5 = File system unmount, 6 = File system      *10200000
                         remount, 7 = File system move, 10 = File      *10237500
                         open, 11 = File close. 12 = Memmap. 13 =      *10275000
                         Memunmap.                                      10312500
SMF92RVN DS    1CL0002   Record version number                          10350000
SMF92PNM DS    1CL0008   Product name - OpenMVS                         10400000
SMF92OSL DS    1CL0008   MVS product level                              10450000
SMF92SSS_LEN EQU *-SMF92SSS                                             10500000
.L0005   ANOP                                                           10550000
*                                                                       10600000
*                                                                       10650000
*    Identification Section                                             10700000
*                                                                       10750000
*                                                                       10800000
*                                                                       10850000
         AIF   ('&SMF92ID' EQ 'NO').L0008                               10900000
         AIF   ('&DSECT' EQ 'YES').L0009                                10950000
         AIF   ('&SMF92ID' NE 'YES').L0008                              11000000
SMF92ID  DS    0F                                                       11050000
         AGO   .L000A                                                   11100000
.L0009   ANOP                                                           11150000
SMF92ID  DSECT                                                          11200000
.L000A   ANOP                                                           11250000
SMF92JBN DS    1CL0008   JobName                                        11300000
SMF92RST DS    1FL4      Reader start time                              11350000
SMF92RSD DS    1CL0004   Reader start date                              11400000
SMF92STM DS    1CL0008   Step name                                      11450000
SMF92RGD DS    1CL0008   SAF group ID                                   11500000
SMF92RUD DS    1CL0008   SAF user ID                                    11550000
SMF92UID DS    1FL4      OpenMVS real user ID                           11600000
SMF92GID DS    1FL4      OpenMVS real group ID                          11650000
SMF92PID DS    1FL4      OpenMVS process ID                             11700000
SMF92PGD DS    1FL4      OpenMVS process group ID                       11750000
SMF92SSD DS    1FL4      OpenMVS session ID                             11800000
SMF92API DS    1FL4      OpenMVS anchor process ID                      11850000
SMF92APG DS    1FL4      OpenMVS anchor proc grp ID                     11900000
SMF92ASG DS    1FL4      OpenMVS anchor session ID                      11950000
SMF92ID_LEN EQU *-SMF92ID                                               12000000
.L0008   ANOP                                                           12050000
*                                                                       12100000
*                                                                       12150000
*    Data Section for File System Mount subtype (subtype 1)             12200000
*                                                                       12250000
*                                                                       12300000
*                                                                       12350000
         AIF   ('&SMF92FSM' EQ 'NO').L000B                              12400000
         AIF   ('&DSECT' EQ 'YES').L000C                                12450000
         AIF   ('&SMF92FSM' NE 'YES').L000B                             12500000
SMF92FSM DS    0F                                                       12550000
         AGO   .L000D                                                   12600000
.L000C   ANOP                                                           12650000
SMF92FSM DSECT                                                          12700000
.L000D   ANOP                                                           12750000
SMF92MTM DS    1BL8      Time of mount, STCK format                     12800000
SMF92MPF DS    1FL4      Offset of path section                         12850000
SMF92MFT DS    1FL4      File system type from MntEntFSType field of   *12900000
                         BPXYMNTE                                       12950000
SMF92MFM DS    1FL4      File system mode from MntEntFSMode field of   *13000000
                         BPXYMNTE                                       13050000
SMF92MDN DS    1FL4      File system device number from MntEntFSDev    *13100000
                         field of BPXYMNTE                              13150000
SMF92MDD DS    1CL0008   DDNAME specified on mount from MntEntFSDDName *13200000
                         field of BPXYMNTE                              13250000
SMF92MTN DS    1CL0008   File system type name from MntEntFSTName      *13300000
                         field of BPXYMNTE                              13350000
SMF92MFN DS    1CL0044   File system name from MntEntFSName field of   *13400000
                         BPXYMNTE                                       13450000
SMF92MBL DS    1FL4      File system block size                         13500000
SMF92MST DS    1BL8      Total space in file system in block size      *13550000
                         units                                          13600000
SMF92MSU DS    1BL8      Allocated space in file system in block size  *13650000
                         units                                          13700000
SMF92MFG DS    0BL1      Flag byte                                      13750000
SMF92MAU EQU   X'80'     Mounted by Automounter                         13800000
SMF92MAS EQU   X'40'     Asynchronous mount 1 = Yes, 0 = No             13850000
         ORG   SMF92MFG+X'00000001'                                     13900000
SMF92MF2 DS    0BL1      Second Flag byte                               13912500
SMF92MLU EQU   X'80'     Mounted localy                                 13925000
SMF92MNU EQU   X'40'     Mounted remotely                               13937500
SMF92MDO EQU   X'20'     HFS Sysplex client                             13950000
SMF92MSN EQU   X'10'     Filesystem owner                               13962500
         ORG   SMF92MF2+X'00000001'                                     13975000
         DS    1CL0002   Reserved                                       13987500
SMF92FSM_LEN EQU *-SMF92FSM                                             14000000
.L000B   ANOP                                                           14050000
         AIF   ('&SMF92FSP' EQ 'NO').L000E                              14100000
         AIF   ('&DSECT' EQ 'YES').L000F                                14150000
         AIF   ('&SMF92FSP' NE 'YES').L000E                             14200000
SMF92FSP DS    0H                                                       14250000
         AGO   .L0010                                                   14300000
.L000F   ANOP                                                           14350000
SMF92FSP DSECT                                                          14400000
.L0010   ANOP                                                           14450000
SMF92PPL DS    1FL2      Length of path name                            14500000
SMF92PPN DS    0C        Path name of directory where file system is   *14550000
                         mounted. Maximum length=1024                   14600000
SMF92FSP_LEN EQU *-SMF92FSP                                             14650000
.L000E   ANOP                                                           14700000
*                                                                       14750000
*                                                                       14800000
*    Data Section for File System Suspend subtype (subtype 2)           14850000
*        This subtype is written as a result of a quiesce syscall       14900000
*                                                                       14950000
*                                                                       15000000
*                                                                       15050000
         AIF   ('&SMF92FSS' EQ 'NO').L0011                              15100000
         AIF   ('&DSECT' EQ 'YES').L0012                                15150000
         AIF   ('&SMF92FSS' NE 'YES').L0011                             15200000
SMF92FSS DS    0F                                                       15250000
         AGO   .L0013                                                   15300000
.L0012   ANOP                                                           15350000
SMF92FSS DSECT                                                          15400000
.L0013   ANOP                                                           15450000
SMF92STS DS    1BL8      Time of suspend, STCK format                   15500000
SMF92SFT DS    1FL4      File system type from MntEntFSType field of   *15550000
                         BPXYMNTE                                       15600000
SMF92SFM DS    1FL4      File system mode from MntEntFSMode field of   *15650000
                         BPXYMNTE                                       15700000
SMF92SDN DS    1FL4      File system device number from MntEntFSDev    *15750000
                         field of BPXYMNTE                              15800000
SMF92SDD DS    1CL0008   DDNAME specified on mount from MntEntFSDDName *15850000
                         field of BPXYMNTE                              15900000
SMF92STN DS    1CL0008   File system type name from MntEntFSTName      *15950000
                         field of BPXYMNTE                              16000000
SMF92SFN DS    1CL0044   File system name from MntEntFSName field of   *16050000
                         BPXYMNTE                                       16100000
SMF92SFG DS    0BL1      Flag btye                                      16107100
SMF92SLU EQU   X'80'     Mounted localy                                 16114200
SMF92SNU EQU   X'40'     Mounted remotely                               16121300
SMF92SDO EQU   X'20'     HFS Sysplex client                             16128400
SMF92SSN EQU   X'10'     Filesystem owner                               16135500
         ORG   SMF92FSS+X'00000051'                                     16142600
SMF92FSS_LEN EQU *-SMF92FSS                                             16150000
.L0011   ANOP                                                           16200000
*                                                                       16250000
*                                                                       16300000
*    Data Section for File System Resume subtype (subtype 4)            16350000
*        This subtype is written as a result of an unquiesce syscall    16400000
*                                                                       16450000
*                                                                       16500000
*                                                                       16550000
         AIF   ('&SMF92FSR' EQ 'NO').L0014                              16600000
         AIF   ('&DSECT' EQ 'YES').L0015                                16650000
         AIF   ('&SMF92FSR' NE 'YES').L0014                             16700000
SMF92FSR DS    0F                                                       16750000
         AGO   .L0016                                                   16800000
.L0015   ANOP                                                           16850000
SMF92FSR DSECT                                                          16900000
.L0016   ANOP                                                           16950000
SMF92RTS DS    1BL8      Time of suspend, STCK format                   17000000
SMF92RTR DS    1BL8      Time of resume, STCK format                    17050000
SMF92RFT DS    1FL4      File system type from MntEntFSType field of   *17100000
                         BPXYMNTE                                       17150000
SMF92RFM DS    1FL4      File system mode from MntEntFSMode field of   *17200000
                         BPXYMNTE                                       17250000
SMF92RDN DS    1FL4      File system device number from MntEntFSDev    *17300000
                         field of BPXYMNTE                              17350000
SMF92RDD DS    1CL0008   DDNAME specified on mount from MntEntFSDDName *17400000
                         field of BPXYMNTE                              17450000
SMF92RTN DS    1CL0008   File system type name from MntEntFSTName      *17500000
                         field of BPXYMNTE                              17550000
SMF92RFN DS    1CL0044   File system name from MntEntFSName field of   *17600000
                         BPXYMNTE                                       17650000
SMF92RFG DS    0BL1      Flag btye                                      17657100
SMF92RLU EQU   X'80'     Mounted localy                                 17664200
SMF92RNU EQU   X'40'     Mounted remotely                               17671300
SMF92RDO EQU   X'20'     HFS Sysplex client                             17678400
SMF92RSN EQU   X'10'     Filesystem owner                               17685500
         ORG   SMF92FSR+X'00000059'                                     17692600
SMF92FSR_LEN EQU *-SMF92FSR                                             17700000
.L0014   ANOP                                                           17750000
*                                                                       17800000
*                                                                       17850000
*    Data Section for File System Unmount subtype (subtype 5)           17900000
*    Data Section for File System Remount subtype (subtype 6)           17950000
*    (Subtypes 5 & 6 differ only by the subtype numbers)                18000000
*                                                                       18050000
*                                                                       18100000
*                                                                       18150000
         AIF   ('&SMF92FSU' EQ 'NO').L0017                              18200000
         AIF   ('&DSECT' EQ 'YES').L0018                                18250000
         AIF   ('&SMF92FSU' NE 'YES').L0017                             18300000
SMF92FSU DS    0F                                                       18350000
         AGO   .L0019                                                   18400000
.L0018   ANOP                                                           18450000
SMF92FSU DSECT                                                          18500000
.L0019   ANOP                                                           18550000
SMF92UTM DS    1BL8      Time of mount, STCK format                     18600000
SMF92UTU DS    1BL8      Time of unmount, STCK format                   18650000
SMF92UFT DS    1FL4      File system type from MntEntFSType field of   *18700000
                         BPXYMNTE                                       18750000
SMF92UFM DS    1FL4      File system mode from MntEntFSMode field of   *18800000
                         BPXYMNTE                                       18850000
SMF92UDN DS    1FL4      File system device number from MntEntFSDev    *18900000
                         field of BPXYMNTE                              18950000
SMF92UDD DS    1CL0008   DDNAME specified on mount from MntEntFSDDName *19000000
                         field of BPXYMNTE                              19050000
SMF92UTN DS    1CL0008   File system type name from MntEntFSTName      *19100000
                         field of BPXYMNTE                              19150000
SMF92UFN DS    1CL0044   File system name from MntEntFSName field of   *19200000
                         BPXYMNTE                                       19250000
SMF92UBL DS    1FL4      File system block size                         19300000
SMF92UST DS    1BL8      Total space in file system in block size      *19350000
                         units                                          19400000
SMF92USU DS    1BL8      Allocated space in file system in block size  *19450000
                         units                                          19500000
SMF92USR DS    1FL4      Reads                                          19550000
SMF92USW DS    1FL4      Writes                                         19600000
SMF92UDI DS    1FL4      Directory I/O blocks                           19650000
SMF92UIR DS    1FL4      I/O blocks read                                19700000
SMF92UIW DS    1FL4      I/O blocks written                             19750000
SMF92UBR DS    1BL8      Bytes read                                     19800000
SMF92UBW DS    1BL8      Bytes written                                  19850000
SMF92UFG DS    0BL1      Flag byte                                      19900000
SMF92UAU EQU   X'80'     Unmounted by Automounter                       19950000
         ORG   SMF92UFG+X'00000001'                                     20000000
SMF92UF2 DS    0BL1      Second flag byte                               20012500
SMF92ULU EQU   X'80'     Mounted localy                                 20025000
SMF92UNU EQU   X'40'     Mounted remotely                               20037500
SMF92UDO EQU   X'20'     HFS Sysplex client                             20050000
SMF92USN EQU   X'10'     Filesystem owner                               20062500
         ORG   SMF92UF2+X'00000001'                                     20075000
         DS    1CL0002   Reserved                                       20087500
SMF92FSU_LEN EQU *-SMF92FSU                                             20100000
.L0017   ANOP                                                           20150000
*                                                                       20150800
*                                                                       20151600
*   Data Section for Move File System subtype (subtype 7)               20152400
*                                                                       20153200
*                                                                       20154000
*                                                                       20154800
         AIF   ('&SMF92FSV' EQ 'NO').L001A                              20155600
         AIF   ('&DSECT' EQ 'YES').L001B                                20156400
         AIF   ('&SMF92FSV' NE 'YES').L001A                             20157200
SMF92FSV DS    0F                                                       20158000
         AGO   .L001C                                                   20158800
.L001B   ANOP                                                           20159600
SMF92FSV DSECT                                                          20160400
.L001C   ANOP                                                           20161200
SMF92VTV DS    1BL8      Time of move, STCK format                      20162000
SMF92VTM DS    1BL8      Time of mount, STCK format                     20162800
SMF92VFT DS    1FL4      File system type from MntEntFSType field of   *20163600
                         BPXYMNTE                                       20164400
SMF92VFM DS    1FL4      File system mode from MntEntFSMode field of   *20165200
                         BPXYMNTE                                       20166000
SMF92VDN DS    1FL4      File system device number from MntEntFSDev    *20166800
                         field of BPXYMNTE                              20167600
SMF92VDD DS    1CL0008   DDNAME specified on mount from MntEntFSDDName *20168400
                         field of BPXYMNTE                              20169200
SMF92VTN DS    1CL0008   File system type name from MntEntFSTName      *20170000
                         field of BPXYMNTE                              20170800
SMF92VNM DS    1CL0044   File system name from MntEntFSName field of   *20171600
                         BPXYMNTE                                       20172400
SMF92VBL DS    1FL4      File system block size                         20173200
SMF92VST DS    1BL8      Total space in file system in block size      *20174000
                         units                                          20174800
SMF92VSU DS    1BL8      Allocated space in file system in block size  *20175600
                         units                                          20176400
SMF92VSR DS    1FL4      Reads                                          20177200
SMF92VSW DS    1FL4      Writes                                         20178000
SMF92VDI DS    1FL4      Directory I/O blocks                           20178800
SMF92VIR DS    1FL4      I/O blocks read                                20179600
SMF92VIW DS    1FL4      I/O blocks written                             20180400
SMF92VBR DS    1BL8      Bytes read                                     20181200
SMF92VBW DS    1BL8      Bytes written                                  20182000
SMF92VFG DS    0BL1      Flag byte - reason for move                    20182800
SMF92VUI EQU   X'80'     User-initiated                                 20183600
SMF92VRI EQU   X'40'     Recovery                                       20184400
         ORG   SMF92VFG+X'00000001'                                     20185200
SMF92VOF DS    0BL1      Flag byte - old status                         20186000
SMF92VOL EQU   X'80'     Mounted localy                                 20186800
SMF92VON EQU   X'40'     Mounted remotely                               20187600
SMF92VOD EQU   X'20'     HFS Sysplex client                             20188400
SMF92VOS EQU   X'10'     Filesystem owner                               20189200
         ORG   SMF92VOF+X'00000001'                                     20190000
SMF92VNF DS    0BL1      Flag byte - new status                         20190800
SMF92VNL EQU   X'80'     Mounted localy                                 20191600
SMF92VNN EQU   X'40'     Mounted remotely                               20192400
SMF92VND EQU   X'20'     HFS Sysplex client                             20193200
SMF92VNS EQU   X'10'     Filesystem owner                               20194000
         ORG   SMF92VNF+X'00000001'                                     20194800
         DS    1CL0001   Reserved                                       20195600
SMF92FSV_LEN EQU *-SMF92FSV                                             20196400
.L001A   ANOP                                                           20197200
*                                                                       20200000
*                                                                       20250000
*    Data Section for File Open subtype (subtype 10)                    20300000
*                                                                       20350000
*                                                                       20400000
*                                                                       20450000
         AIF   ('&SMF92FOP' EQ 'NO').L001D                              20500000
         AIF   ('&DSECT' EQ 'YES').L001E                                20550000
         AIF   ('&SMF92FOP' NE 'YES').L001D                             20600000
SMF92FOP DS    0F                                                       20650000
         AGO   .L001F                                                   20700000
.L001E   ANOP                                                           20750000
SMF92FOP DSECT                                                          20800000
.L001F   ANOP                                                           20850000
SMF92OTO DS    1BL8      Open time - STCK format                        20900000
SMF92OTY DS    1FL1      File Type as defined in BPXYFTYP               20950000
SMF92OFG DS    0BL1      record flag                                    21000000
SMF92ONF EQU   X'80'     record generated by VNode interface service    21050000
SMF92ONS EQU   X'40'     Network or local socket, 1 = network           21100000
SMF92OCS EQU   X'20'     Client or server socket 1 = client             21150000
         ORG   SMF92OFG+X'00000001'                                     21200000
         DS    1CL0002   Reserved                                       21250000
SMF92OTK DS    1BL4      Open file token (Matches close)                21300000
SMF92OIN DS    1FL4      Inode number                                   21350000
SMF92ODN DS    1FL4      Unique device number                           21400000
SMF92FOP_LEN EQU *-SMF92FOP                                             21450000
.L001D   ANOP                                                           21500000
*                                                                       21550000
*                                                                       21600000
*    Data Section for File Close subtype (subtype 11)                   21650000
*                                                                       21700000
*                                                                       21750000
*                                                                       21800000
         AIF   ('&SMF92FCL' EQ 'NO').L0020                              21850000
         AIF   ('&DSECT' EQ 'YES').L0021                                21900000
         AIF   ('&SMF92FCL' NE 'YES').L0020                             21950000
SMF92FCL DS    0F                                                       22000000
         AGO   .L0022                                                   22050000
.L0021   ANOP                                                           22100000
SMF92FCL DSECT                                                          22150000
.L0022   ANOP                                                           22200000
SMF92CTO DS    1BL8      Open time - STCK format                        22250000
SMF92CTC DS    1BL8      Close time - STCK format                       22300000
SMF92CTY DS    1FL1      File type as defined in BPXYFTYP               22350000
SMF92CFG DS    0BL1      record flag                                    22400000
SMF92CNF EQU   X'80'     record generated by VNode interface service    22450000
SMF92CNS EQU   X'40'     Network or local socket 1 = network            22500000
SMF92CCS EQU   X'20'     Client or server socket 1 = server             22550000
SMF92CFC EQU   X'10'     File was cached                                22600000
         ORG   SMF92CFG+X'00000001'                                     22650000
         DS    1CL0002   Reserved                                       22700000
SMF92CTK DS    1BL4      Open file token                                22750000
SMF92CIN DS    1FL4      Inode number                                   22800000
SMF92CDN DS    1FL4      Unique device number                           22850000
SMF92CSR DS    1FL4      Reads                                          22900000
SMF92CSW DS    1FL4      Writes                                         22950000
SMF92CDI DS    1FL4      Directory I/O blocks                           23000000
SMF92CIR DS    1FL4      I/O blocks read                                23050000
SMF92CIW DS    1FL4      I/O blocks written                             23100000
SMF92CBR DS    1BL8      Bytes read                                     23150000
SMF92CBW DS    1BL8      Bytes written                                  23200000
SMF92CPN DS    1CL0064   Pathname                                       23250000
SMF92FCL_LEN EQU *-SMF92FCL                                             23300000
.L0020   ANOP                                                           23350000
*                                                                       23400000
*                                                                       23450000
*    Data Section for mmap subtype (subtype 12)                         23500000
*                                                                       23550000
*                                                                       23600000
*                                                                       23650000
         AIF   ('&SMF92MMP' EQ 'NO').L0023                              23700000
         AIF   ('&DSECT' EQ 'YES').L0024                                23750000
         AIF   ('&SMF92MMP' NE 'YES').L0023                             23800000
SMF92MMP DS    0F                                                       23850000
         AGO   .L0025                                                   23900000
.L0024   ANOP                                                           23950000
SMF92MMP DSECT                                                          24000000
.L0025   ANOP                                                           24050000
SMF92MTO DS    1BL8      time of mmap - STCK format                     24100000
SMF92MSZ DS    1FL4      Number of bytes being memory mapped            24150000
SMF92MTK DS    1FL4      mmap file token (matches token in munmap data *24200000
                         section                                        24250000
SMF92MIN DS    1FL4      file serial number                             24300000
SMF92MMDN DS   1FL4      file unique device number                      24350000
SMF92MMP_LEN EQU *-SMF92MMP                                             24400000
.L0023   ANOP                                                           24450000
*                                                                       24500000
*                                                                       24550000
*    Data Section for munmap subtype (subtype 13)                       24600000
*                                                                       24650000
*                                                                       24700000
*                                                                       24750000
         AIF   ('&SMF92MUN' EQ 'NO').L0026                              24800000
         AIF   ('&DSECT' EQ 'YES').L0027                                24850000
         AIF   ('&SMF92MUN' NE 'YES').L0026                             24900000
SMF92MUN DS    0F                                                       24950000
         AGO   .L0028                                                   25000000
.L0027   ANOP                                                           25050000
SMF92MUN DSECT                                                          25100000
.L0028   ANOP                                                           25150000
SMF92MUTO DS   1BL8      time of mmap - STCK format                     25200000
SMF92MUTC DS   1BL8      time of munmap - STCK format                   25250000
SMF92MUSZ DS   1FL4      number of bytes being memory mapped            25300000
SMF92MUTK DS   1FL4      mmap file token (matches token in mmap data   *25350000
                         section                                        25400000
SMF92MUIN DS   1FL4      file serial number                             25450000
SMF92MUDN DS   1FL4      file unique device number                      25500000
SMF92MUIR DS   1FL4      I/O blocks read                                25550000
SMF92MUIW DS   1FL4      I/O blocks written                             25600000
SMF92#VERSION02 EQU C'02' Record version 02                             25650000
SMF92#VERSION01 EQU C'01' Record version 01                             25700000
SMF92#VERSION EQU C'02'  Record version num                             25750000
SMF92#MOUNT EQU 1        Mount subtype                                  25800000
SMF92#SUSPEND EQU 2      Suspend subtype                                25850000
SMF92#RESUME EQU 4       Resume subtype                                 25900000
SMF92#UNMOUNT EQU 5      UnMount subtype                                25950000
SMF92#REMOUNT EQU 6      ReMount subtype                                26000000
SMF92#MOVE EQU 7         Move subtype                                   26025000
SMF92#OPEN EQU 10        Open subtype                                   26050000
SMF92#CLOSE EQU 11       Close subtype                                  26100000
SMF92#MMAP EQU 12        Memmap subtype                                 26150000
SMF92#MUNMAP EQU 13      Memunmap subtype                               26200000
SMF92MUN_LEN EQU *-SMF92MUN                                             26250000
.L0026   ANOP                                                           26300000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 26350000
         AIF   ('&LIST' EQ 'YES').P4                                    26400000
.P3      ANOP                                                           26450000
         POP   PRINT                                                    26500000
.P4      ANOP                                                           26550000
.P_EXIT  ANOP                                                           26600000
         MEND                                                           26650000
**/ BPXYSMFR_2:;                                                        26700000
* %BPXYSMFR_INCLUDED = 'YES';                                           26750000
* %DCL ZCBPRINT CHAR EXT;                                               26800000
* %DEACTIVATE ZCBPRINT;                                                 26850000
* %DCL BPXYSMFR_LIST CHAR EXT;                                          26900000
* %DEACTIVATE BPXYSMFR_LIST;                                            26950000
* %IF BPXYSMFR_LIST ^= 'NO' &                                           27000000
*    ZCBPRINT ^= 'NO' %THEN                                             27050000
*   %GOTO BPXYSMFR_3;                                                   27100000
*   @LIST PUSH NOECHO;                                                  27150000
*   @LIST NOASSEMBLE NOECHO;                                            27200000
*   @LIST OFF C NOECHO;                                                 27250000
* %BPXYSMFR_3:;                                                         27300000
*/* Start of PL/X Source                                             */ 27350000
*%IF SMFRBASE='' %THEN                                                  27400000
*  %DO;                                                                 27450000
*    %SMFRBASE='BASED(SMF92PTR)';                                       27500000
*  %END;                                                                27550000
*%IF SMFRBASE='BASED(SMF92PTR)' %THEN                                   27600000
*  %DO;                                                                 27650000
*    DCL SMF92PTR PTR(31);        /* Pointer to SMFRCD92             */ 27700000
*  %END;                                                                27750000
*DCL                                                                    27800000
*  1 SMFRCD92 SMFRBASE BDY(DWORD),                                      27850000
*    2 SMF92RPS,                  /* Fixed record sections           */ 27900000
*/*                                                                  */ 27950000
*/*  SMF Record Header Section                                       */ 28000000
*/*                                                                  */ 28050000
*      3 SMF92RHD,                /* Record header section           */ 28100000
*        5 SMF92LEN Fixed(15),    /* Record length                   */ 28150000
*        5 SMF92SEG Fixed(15),    /* Segment descriptor              */ 28200000
*        5 SMF92FLG Bit(8),       /* Header flag byte                */ 28250000
*          7 SMF92SSF Bit(1),     /* Bit 0 - Subsys ID after Sys ID  */ 28300000
*          7 SMF92SBT Bit(1),     /* Bit 1 - Subtypes utilized       */ 28350000
*          7 * Bit(1),            /* Bit 2 - reserved                */ 28400000
*          7 * Bit(1),            /* Bit 3 - MVS/4.X                 */ 28450000
*          7 * Bit(1),            /* Bit 4 - MVS/ESA                 */ 28500000
*          7 * Bit(1),            /* Bit 5 - MVS/XA                  */ 28550000
*          7 * Bit(1),            /* Bit 6 - VS2                     */ 28600000
*          7 * Bit(1),            /* Bit 7 - VS1                     */ 28650000
*        5 SMF92RTY Bit(8),       /* Record type - 92  ('5C'x)       */ 28700000
*        5 SMF92TME Fixed(31) Bdy(Hword),/* Record written time      */ 28750000
*        5 SMF92DTE Fixed(31) Bdy(Hword),/* Record written date      */ 28800000
*        5 SMF92SID Char(4),      /* System identifier               */ 28850000
*        5 SMF92WID Char(4),      /* Subsystem identifier            */ 28900000
*        5 SMF92STP Fixed (15),   /* Record subtype                  */ 28950000
*        5 * Char(2),             /* Reserved                        */ 29000000
*        5 SMF92SDL Fixed (15),   /* Length of self-defining section */ 29050000
*/*                                                                  */ 29100000
*/*  Self Defining Section                                           */ 29150000
*/*                                                                  */ 29200000
*      3 SMF92SDS,                                                      29250000
*        5 SMF92SOF Fixed (31),   /* Offset to subsystem section     */ 29300000
*        5 SMF92SLN Fixed (15),   /* Length of subsystem section     */ 29350000
*        5 SMF92SON Fixed (15),   /* Number of subsystem sections    */ 29400000
*        5 SMF92IOF Fixed (31),   /* Offset of identification section*/ 29450000
*        5 SMF92ILN Fixed (15),   /* Length of identification section*/ 29500000
*        5 SMF92ION Fixed (15),   /* Number of identification section*/ 29550000
*        5 SMF92DOF Fixed (31),   /* Offset of data section          */ 29600000
*        5 SMF92DLN Fixed (15),   /* Length of data section          */ 29650000
*        5 SMF92DON Fixed (15),   /* Number of data sections         */ 29700000
*/*                                                                  */ 29750000
*/*  Subsystem Section                                               */ 29800000
*/*                                                                  */ 29850000
*  1 SMF92SSS BASED(ADDR(SMFRCD92)+SMF92SOF),                           29900000
*    3 SMF92TYP Fixed(15),        /* Record subtype,                    29950000
*                                     1 = File system mount,            30000000
*                                     2 = File system suspend,          30050000
*                                     4 = File system resume,           30100000
*                                     5 = File system unmount,          30150000
*                                     6 = File system remount,   @D5A   30200000
*                                     7 = File system move,      @D7A   30225000
*                                    10 = File open,                    30250000
*                                    11 = File close.                   30300000
*                                    12 = Memmap.                       30350000
*                                    13 = Memunmap.                  */ 30400000
*    3 SMF92RVN Char(2),          /* Record version number           */ 30450000
*    3 SMF92PNM Char(8),          /* Product name - OpenMVS          */ 30500000
*    3 SMF92OSL Char(8),          /* MVS product level               */ 30550000
*/*                                                                  */ 30600000
*/*  Identification Section                                          */ 30650000
*/*                                                                  */ 30700000
*  1 SMF92ID  BASED(ADDR(SMFRCD92)+SMF92IOF),                           30750000
*    3 SMF92JBN Char(8),          /* JobName                         */ 30800000
*    3 SMF92RST Fixed(31),        /* Reader start time               */ 30850000
*    3 SMF92RSD Char(4),          /* Reader start date               */ 30900000
*    3 SMF92STM Char(8),          /* Step name                       */ 30950000
*    3 SMF92RGD Char(8),          /* SAF group ID                    */ 31000000
*    3 SMF92RUD Char(8),          /* SAF user ID                     */ 31050000
*    3 SMF92UID Fixed(32),        /* OpenMVS real user ID            */ 31100000
*    3 SMF92GID Fixed(32),        /* OpenMVS real group ID           */ 31150000
*    3 SMF92PID Fixed(32),        /* OpenMVS process ID              */ 31200000
*    3 SMF92PGD Fixed(32),        /* OpenMVS process group ID        */ 31250000
*    3 SMF92SSD Fixed(32),        /* OpenMVS session ID              */ 31300000
*    3 SMF92API Fixed(32),        /* OpenMVS anchor process ID   @L1A*/ 31350000
*    3 SMF92APG Fixed(32),        /* OpenMVS anchor proc grp ID  @L1A*/ 31400000
*    3 SMF92ASG Fixed(32),        /* OpenMVS anchor session ID   @L1A*/ 31450000
*/*                                                                  */ 31500000
*/*  Data Section for File System Mount subtype (subtype 1)          */ 31550000
*/*                                                                  */ 31600000
*  1 SMF92FSM BASED(ADDR(SMFRCD92)+SMF92DOF),                           31650000
*    3 SMF92MTM Bit(64),          /* Time of mount, STCK format      */ 31700000
*    3 SMF92MPF Fixed(31),        /* Offset of path section          */ 31750000
*    3 SMF92MFT Fixed(32),        /* File system type from              31800000
*                                    MntEntFSType field of BPXYMNTE  */ 31850000
*    3 SMF92MFM Fixed(32),        /* File system mode from              31900000
*                                    MntEntFSMode field of BPXYMNTE  */ 31950000
*    3 SMF92MDN Fixed(32),        /* File system device number from     32000000
*                                    MntEntFSDev field of BPXYMNTE   */ 32050000
*    3 SMF92MDD Char(8),          /* DDNAME specified on mount from     32100000
*                                    MntEntFSDDName field of BPXYMNTE*/ 32150000
*    3 SMF92MTN Char(8),          /* File system type name from         32200000
*                                    MntEntFSTName field of BPXYMNTE */ 32250000
*    3 SMF92MFN Char(44),         /* File system name from              32300000
*                                    MntEntFSName field of BPXYMNTE  */ 32350000
*    3 SMF92MBL Fixed(31),        /* File system block size          */ 32400000
*    3 SMF92MST Bit(64),          /* Total space in file system         32450000
*                                    in block size units             */ 32500000
*    3 SMF92MSU Bit(64),          /* Allocated space in file system     32550000
*                                    in block size units             */ 32600000
*    3 SMF92MFG Bit(8),           /* Flag byte                   @D5C*/ 32650000
*      5 SMF92MAU Bit(1),         /* Mounted by Automounter      @D5A*/ 32700000
*      5 SMF92MAS Bit(1),         /* Asynchronous mount                 32750000
*                                    1 = Yes, 0 = No             @D5M*/ 32800000
*      5 *        Bit(6),         /* Reserved                   6@D7A*/ 32812500
*    3 SMF92MF2 Bit(8),           /* Second Flag byte                */ 32825000
*      5 SMF92MLU Bit(1),         /* Mounted localy                  */ 32837500
*      5 SMF92MNU Bit(1),         /* Mounted remotely                */ 32850000
*      5 SMF92MDO Bit(1),         /* HFS Sysplex client              */ 32862500
*      5 SMF92MSN Bit(1),         /* Filesystem owner                */ 32875000
*    3 *        Char(2),          /* Reserved                    @D4A*/ 32887500
*  1 SMF92FSP Based(Addr(SMFRCD92)+SMF92MPF),                           32900000
*    5 SMF92PPL Fixed(15),        /* Length of path name             */ 32950000
*    5 SMF92PPN Char(*),          /* Path name of directory where       33000000
*                                    file system is mounted.            33050000
*                                    Maximum length=1024             */ 33100000
*/*                                                                  */ 33150000
*/*  Data Section for File System Suspend subtype (subtype 2)        */ 33200000
*/*      This subtype is written as a result of a quiesce syscall    */ 33250000
*/*                                                                  */ 33300000
*  1 SMF92FSS BASED(ADDR(SMFRCD92)+SMF92DOF),                           33350000
*    3 SMF92STS Bit(64),          /* Time of suspend, STCK format    */ 33400000
*    3 SMF92SFT Fixed(32),        /* File system type from              33450000
*                                    MntEntFSType field of BPXYMNTE  */ 33500000
*    3 SMF92SFM Fixed(32),        /* File system mode from              33550000
*                                    MntEntFSMode field of BPXYMNTE  */ 33600000
*    3 SMF92SDN Fixed(32),        /* File system device number from     33650000
*                                    MntEntFSDev field of BPXYMNTE   */ 33700000
*    3 SMF92SDD Char(8),          /* DDNAME specified on mount from     33750000
*                                    MntEntFSDDName field of BPXYMNTE*/ 33800000
*    3 SMF92STN Char(8),          /* File system type name from         33850000
*                                    MntEntFSTName field of BPXYMNTE */ 33900000
*    3 SMF92SFN Char(44),         /* File system name from              33950000
*                                    MntEntFSName field of BPXYMNTE  */ 34000000
*    3 SMF92SFG Bit(8),           /* Flag btye                  6@D7A*/ 34007100
*      5 SMF92SLU Bit(1),         /* Mounted localy                  */ 34014200
*      5 SMF92SNU Bit(1),         /* Mounted remotely                */ 34021300
*      5 SMF92SDO Bit(1),         /* HFS Sysplex client              */ 34028400
*      5 SMF92SSN Bit(1),         /* Filesystem owner                */ 34035500
*      5 *        Bit(4),         /* Reserved                        */ 34042600
*/*                                                                  */ 34050000
*/*  Data Section for File System Resume subtype (subtype 4)         */ 34100000
*/*      This subtype is written as a result of an unquiesce syscall */ 34150000
*/*                                                                  */ 34200000
*  1 SMF92FSR BASED(ADDR(SMFRCD92)+SMF92DOF),                           34250000
*    3 SMF92RTS Bit(64),          /* Time of suspend, STCK format    */ 34300000
*    3 SMF92RTR Bit(64),          /* Time of resume, STCK format     */ 34350000
*    3 SMF92RFT Fixed(32),        /* File system type from              34400000
*                                    MntEntFSType field of BPXYMNTE  */ 34450000
*    3 SMF92RFM Fixed(32),        /* File system mode from              34500000
*                                    MntEntFSMode field of BPXYMNTE  */ 34550000
*    3 SMF92RDN Fixed(32),        /* File system device number from     34600000
*                                    MntEntFSDev field of BPXYMNTE   */ 34650000
*    3 SMF92RDD Char(8),          /* DDNAME specified on mount from     34700000
*                                    MntEntFSDDName field of BPXYMNTE*/ 34750000
*    3 SMF92RTN Char(8),          /* File system type name from         34800000
*                                    MntEntFSTName field of BPXYMNTE */ 34850000
*    3 SMF92RFN Char(44),         /* File system name from              34900000
*                                    MntEntFSName field of BPXYMNTE  */ 34950000
*    3 SMF92RFG Bit(8),           /* Flag btye                  6@D7A*/ 34957100
*      5 SMF92RLU Bit(1),         /* Mounted localy                  */ 34964200
*      5 SMF92RNU Bit(1),         /* Mounted remotely                */ 34971300
*      5 SMF92RDO Bit(1),         /* HFS Sysplex client              */ 34978400
*      5 SMF92RSN Bit(1),         /* Filesystem owner                */ 34985500
*      5 *        Bit(4),         /* Reserved                        */ 34992600
*/*                                                                  */ 35000000
*/*  Data Section for File System Unmount subtype (subtype 5)        */ 35050000
*/*  Data Section for File System Remount subtype (subtype 6)    @D5A*/ 35100000
*/*  (Subtypes 5 & 6 differ only by the subtype numbers)         @D5A*/ 35150000
*/*                                                                  */ 35200000
*  1 SMF92FSU BASED(ADDR(SMFRCD92)+SMF92DOF),                           35250000
*    3 SMF92UTM Bit(64),          /* Time of mount, STCK format      */ 35300000
*    3 SMF92UTU Bit(64),          /* Time of unmount, STCK format    */ 35350000
*    3 SMF92UFT Fixed(32),        /* File system type from              35400000
*                                    MntEntFSType field of BPXYMNTE  */ 35450000
*    3 SMF92UFM Fixed(32),        /* File system mode from              35500000
*                                    MntEntFSMode field of BPXYMNTE  */ 35550000
*    3 SMF92UDN Fixed(32),        /* File system device number from     35600000
*                                    MntEntFSDev field of BPXYMNTE   */ 35650000
*    3 SMF92UDD Char(8),          /* DDNAME specified on mount from     35700000
*                                    MntEntFSDDName field of BPXYMNTE*/ 35750000
*    3 SMF92UTN Char(8),          /* File system type name from         35800000
*                                    MntEntFSTName field of BPXYMNTE */ 35850000
*    3 SMF92UFN Char(44),         /* File system name from              35900000
*                                    MntEntFSName field of BPXYMNTE  */ 35950000
*    3 SMF92UBL Fixed(31),        /* File system block size          */ 36000000
*    3 SMF92UST Bit(64),          /* Total space in file system         36050000
*                                    in block size units             */ 36100000
*    3 SMF92USU Bit(64),          /* Allocated space in file system     36150000
*                                    in block size units             */ 36200000
*    3 SMF92USR Fixed(32),        /* Reads                           */ 36250000
*    3 SMF92USW Fixed(32),        /* Writes                          */ 36300000
*    3 SMF92UDI Fixed(32),        /* Directory I/O blocks            */ 36350000
*    3 SMF92UIR Fixed(32),        /* I/O blocks read                 */ 36400000
*    3 SMF92UIW Fixed(32),        /* I/O blocks written              */ 36450000
*    3 SMF92UBR Bit(64),          /* Bytes read                      */ 36500000
*    3 SMF92UBW Bit(64),          /* Bytes written                   */ 36550000
*    3 SMF92UFG Bit(8),           /* Flag byte                   @D5A*/ 36600000
*      5 SMF92UAU Bit(1),         /* Unmounted by Automounter    @D5A*/ 36650000
*      5 *        Bit(7),         /* Reserved                   6@D7A*/ 36651800
*    3 SMF92UF2 Bit(8),           /* Second flag byte                */ 36653600
*      5 SMF92ULU Bit(1),         /* Mounted localy                  */ 36655400
*      5 SMF92UNU Bit(1),         /* Mounted remotely                */ 36657200
*      5 SMF92UDO Bit(1),         /* HFS Sysplex client              */ 36659000
*      5 SMF92USN Bit(1),         /* Filesystem owner                */ 36660800
*    3 *        Char(2),          /* Reserved                    @D5A*/ 36662600
*/*                                                                  */ 36664400
*/* Data Section for Move File System subtype (subtype 7)            */ 36666200
*/*                                                                  */ 36668000
*  1 SMF92FSV BASED(ADDR(SMFRCD92)+SMF92DOF),                           36669800
*    3 SMF92VTV Bit(64),          /* Time of move, STCK format       */ 36671600
*    3 SMF92VTM Bit(64),          /* Time of mount, STCK format      */ 36673400
*    3 SMF92VFT Fixed(32),        /* File system type from              36675200
*                                    MntEntFSType field of BPXYMNTE  */ 36677000
*    3 SMF92VFM Fixed(32),        /* File system mode from              36678800
*                                    MntEntFSMode field of BPXYMNTE  */ 36680600
*    3 SMF92VDN Fixed(32),        /* File system device number from     36682400
*                                    MntEntFSDev field of BPXYMNTE   */ 36684200
*    3 SMF92VDD Char(8),          /* DDNAME specified on mount from     36686000
*                                    MntEntFSDDName field of BPXYMNTE*/ 36687800
*    3 SMF92VTN Char(8),          /* File system type name from         36689600
*                                    MntEntFSTName field of BPXYMNTE */ 36691400
*    3 SMF92VNM Char(44),         /* File system name from              36693200
*                                    MntEntFSName field of BPXYMNTE  */ 36695000
*    3 SMF92VBL Fixed(31),        /* File system block size          */ 36696800
*    3 SMF92VST Bit(64),          /* Total space in file system         36698600
*                                    in block size units             */ 36700400
*    3 SMF92VSU Bit(64),          /* Allocated space in file system     36702200
*                                    in block size units             */ 36704000
*    3 SMF92VSR Fixed(32),        /* Reads                           */ 36705800
*    3 SMF92VSW Fixed(32),        /* Writes                          */ 36707600
*    3 SMF92VDI Fixed(32),        /* Directory I/O blocks            */ 36709400
*    3 SMF92VIR Fixed(32),        /* I/O blocks read                 */ 36711200
*    3 SMF92VIW Fixed(32),        /* I/O blocks written              */ 36713000
*    3 SMF92VBR Bit(64),          /* Bytes read                      */ 36714800
*    3 SMF92VBW Bit(64),          /* Bytes written                   */ 36716600
*    3 SMF92VFG Bit(8),           /* Flag byte - reason for move     */ 36718400
*      5 SMF92VUI Bit(1),         /* User-initiated                  */ 36720200
*      5 SMF92VRI Bit(1),         /* Recovery                        */ 36722000
*      5 *        Bit(6),         /* Reserved                        */ 36723800
*    3 SMF92VOF Bit(8),           /* Flag byte - old status          */ 36725600
*      5 SMF92VOL Bit(1),         /* Mounted localy                  */ 36727400
*      5 SMF92VON Bit(1),         /* Mounted remotely                */ 36729200
*      5 SMF92VOD Bit(1),         /* HFS Sysplex client              */ 36731000
*      5 SMF92VOS Bit(1),         /* Filesystem owner                */ 36732800
*      5 *        Bit(4),         /* Reserved                        */ 36734600
*    3 SMF92VNF Bit(8),           /* Flag byte - new status          */ 36736400
*      5 SMF92VNL Bit(1),         /* Mounted localy                  */ 36738200
*      5 SMF92VNN Bit(1),         /* Mounted remotely                */ 36740000
*      5 SMF92VND Bit(1),         /* HFS Sysplex client              */ 36741800
*      5 SMF92VNS Bit(1),         /* Filesystem owner                */ 36743600
*    3 *        Char(1),          /* Reserved                        */ 36745400
*/*                                                                  */ 36750000
*/*  Data Section for File Open subtype (subtype 10)                 */ 36800000
*/*                                                                  */ 36850000
*  1 SMF92FOP BASED(ADDR(SMFRCD92)+SMF92DOF),                           36900000
*    3 SMF92OTO Bit(64),          /* Open time - STCK format         */ 36950000
*    3 SMF92OTY Fixed(8),         /* File Type as defined in BPXYFTYP*/ 37000000
*    3 SMF92OFG    Bit(8),        /* record flag                 @D1A*/ 37050000
*      5 SMF92ONF  Bit(1),        /* record generated by VNode          37100000
*                                    interface service           @D1A*/ 37150000
*      5 SMF92ONS  Bit(1),        /* Network or local socket,           37200000
*                                    1 = network                 @D2A*/ 37250000
*      5 SMF92OCS  Bit(1),        /* Client or server socket            37300000
*                                    1 = client                  @D2A*/ 37350000
*      5 *         Bit(5),        /* Reserved                    @D2C*/ 37400000
*    3 *   Char(2),               /* Reserved                        */ 37450000
*    3 SMF92OTK Bit(32),          /* Open file token (Matches close) */ 37500000
*    3 SMF92OIN Fixed(32),        /* Inode number                    */ 37550000
*    3 SMF92ODN Fixed(32),        /* Unique device number            */ 37600000
*/*                                                                  */ 37650000
*/*  Data Section for File Close subtype (subtype 11)                */ 37700000
*/*                                                                  */ 37750000
*  1 SMF92FCL BASED(ADDR(SMFRCD92)+SMF92DOF),                           37800000
*    3 SMF92CTO Bit(64),          /* Open time - STCK format         */ 37850000
*    3 SMF92CTC Bit(64),          /* Close time - STCK format        */ 37900000
*    3 SMF92CTY Fixed(8),         /* File type as defined in BPXYFTYP*/ 37950000
*    3 SMF92CFG    Bit(8),        /* record flag                 @D1A*/ 38000000
*      5 SMF92CNF  Bit(1),        /* record generated by VNode          38050000
*                                    interface service           @D1A*/ 38100000
*      5 SMF92CNS  Bit(1),        /* Network or local socket            38150000
*                                    1 = network                 @D2A*/ 38200000
*      5 SMF92CCS  Bit(1),        /* Client or server socket            38250000
*                                    1 = server                  @P3C*/ 38300000
*      5 SMF92CFC  Bit(1),        /* File was cached             @D6A*/ 38350000
*      5 *         Bit(4),        /* Reserved                    @D6C*/ 38400000
*    3 *   Char(2),               /* Reserved                        */ 38450000
*    3 SMF92CTK Bit(32),          /* Open file token                 */ 38500000
*    3 SMF92CIN Fixed(32),        /* Inode number                    */ 38550000
*    3 SMF92CDN Fixed(32),        /* Unique device number            */ 38600000
*    3 SMF92CSR Fixed(32),        /* Reads                           */ 38650000
*    3 SMF92CSW Fixed(32),        /* Writes                          */ 38700000
*    3 SMF92CDI Fixed(32),        /* Directory I/O blocks            */ 38750000
*    3 SMF92CIR Fixed(32),        /* I/O blocks read                 */ 38800000
*    3 SMF92CIW Fixed(32),        /* I/O blocks written              */ 38850000
*    3 SMF92CBR Bit(64),          /* Bytes read                      */ 38900000
*    3 SMF92CBW Bit(64),          /* Bytes written                   */ 38950000
*    3 SMF92CPN Char(64),         /* Pathname                    @D6A*/ 39000000
*/*                                                                  */ 39050000
*/*  Data Section for mmap subtype (subtype 12)                  @D3A*/ 39100000
*/*                                                                  */ 39150000
*  1 SMF92MMP BASED(ADDR(SMFRCD92)+SMF92DOF),                           39200000
*    3 SMF92MTO Bit(64),          /* time of mmap - STCK format  @D3A*/ 39250000
*    3 SMF92MSZ Fixed(32),        /* Number of bytes being memory       39300000
*                                    mapped                      @D3A*/ 39350000
*    3 SMF92MTK Fixed(32),        /* mmap file token (matches token     39400000
*                                    in munmap data section      @D3A*/ 39450000
*    3 SMF92MIN Fixed(32),        /* file serial number          @D3A*/ 39500000
*    3 SMF92MMDN Fixed(32),       /* file unique device number   @D3A*/ 39550000
*/*                                                                  */ 39600000
*/*  Data Section for munmap subtype (subtype 13)                @D3A*/ 39650000
*/*                                                                  */ 39700000
*  1 SMF92MUN BASED(ADDR(SMFRCD92)+SMF92DOF),                           39750000
*    3 SMF92MUTO Bit(64),         /* time of mmap - STCK format  @D3A*/ 39800000
*    3 SMF92MUTC Bit(64),         /* time of munmap - STCK format       39850000
*                                                                @D3A*/ 39900000
*    3 SMF92MUSZ Fixed(32),       /* number of bytes being memory       39950000
*                                    mapped                      @D3A*/ 40000000
*    3 SMF92MUTK Fixed(32),       /* mmap file token (matches token     40050000
*                                    in mmap data section        @D3A*/ 40100000
*    3 SMF92MUIN Fixed(32),       /* file serial number          @D3A*/ 40150000
*    3 SMF92MUDN Fixed(32),       /* file unique device number   @D3A*/ 40200000
*    3 SMF92MUIR Fixed(32),       /* I/O blocks read             @D3A*/ 40250000
*    3 SMF92MUIW Fixed(32);       /* I/O blocks written          @D3A*/ 40300000
*                                                                       40350000
*  DCL SMF92#Version02 Char(2) Constant('02'); /* Record version 02  */ 40400000
*                                              /*                @P2A*/ 40450000
*  DCL SMF92#Version01 Char(2) Constant('01'); /* Record version 01  */ 40500000
*  DCL SMF92#Version   Char(2) Constant('02'); /* Record version num */ 40550000
*                                              /*                @P2C*/ 40600000
*  DCL SMF92#Mount    Fixed(15) Constant(01); /* Mount subtype       */ 40650000
*  DCL SMF92#Suspend  Fixed(15) Constant(02); /* Suspend subtype     */ 40700000
*  DCL SMF92#Resume   Fixed(15) Constant(04); /* Resume subtype      */ 40750000
*  DCL SMF92#UnMount  Fixed(15) Constant(05); /* UnMount subtype     */ 40800000
*  DCL SMF92#ReMount  Fixed(15) Constant(06); /* ReMount subtype @D5A*/ 40850000
*  DCL SMF92#Move     Fixed(15) Constant(07); /* Move subtype    @D7A*/ 40875000
*  DCL SMF92#Open     Fixed(15) Constant(10); /* Open subtype        */ 40900000
*  DCL SMF92#Close    Fixed(15) Constant(11); /* Close subtype       */ 40950000
*  DCL SMF92#Mmap     Fixed(15) Constant(12); /* Memmap subtype      */ 41000000
*  DCL SMF92#Munmap   Fixed(15) Constant(13); /* Memunmap subtype    */ 41050000
*                                                                       41100000
*/* End of PL/X Source                                               */ 41150000
* %IF BPXYSMFR_LIST ^= 'NO' &                                           41200000
*    ZCBPRINT ^= 'NO' %THEN                                             41250000
*   %GOTO BPXYSMFR_4;                                                   41300000
*   @LIST POP NOECHO;                                                   41350000
* %BPXYSMFR_4:;                                                         41400000
* %END;                                                                 41450000
