*                                                                       00002200
* %DCL BPXZODMV_INCLUDED CHAR EXT;                                      00004400
* %DEACTIVATE BPXZODMV_INCLUDED;                                        00006600
* %IF BPXZODMV_INCLUDED = '' %THEN                                      00008800
* %DO;                                                                  00011000
*/* Macro made bi-lingual on 00088. CBGEN compile date 00013         */ 00014190
*% /*                                                                   00015400
         MACRO                                                          00017600
         BPXZODMV &DSECT=YES,&LIST=YES,&TITLE=YES,&ODMV=YES,           *00019800
               &ODMVOUT=COND,&ODMVOUTARRAY=COND,&ODMVTHDARRAY=COND,    *00022000
               &ODMVFILE=COND,&ODMVPROCESS=COND,&ODMVTHREADS=COND,     *00024200
               &ODMVPFS=COND,&ODMVSYSL=COND,&ODMVPRCL=COND,            *00027090
               &ODMVCINET=COND                                          00027780
         GBLC  &BPXZODMV_INCLUDED                                       00028600
         GBLC  &ZCBPRINT                                                00030800
&BPXZODMV_INCLUDED SETC 'YES'                                           00033000
         AIF   ('&LIST' EQ 'NONE').P0                                   00035200
         AIF   ('&TITLE' EQ 'NO').P5                                    00037400
 TITLE   'BPXZODMV  - OpenMVS Display Command Interface               '*00039600
                                                                        00041800
.P5      ANOP                                                           00044000
**/ BPXZODMV_1:;                                                        00046200
*/****START OF SPECIFICATIONS****************************************** 00050000
*                                                                       00100000
*    $MAC (BPXZODMV) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00200000
*01* MACRO NAME: BPXZODMV                                               00250000
*                                                                       00300000
*01* DSECT NAME: BPXZODMV                                               00350000
*                                                                       00400000
*01* DESCRIPTIVE NAME: OpenMVS Display Command Interface                00450000
*                                                                       00500000
*02*   ACRONYM: ODMV                                                    00550000
**/                                                                     00600000
*/*01* PROPRIETARY STATEMENT=                                        */ 00650000
*/***PROPRIETARY_STATEMENT********************************************/ 00700000
*/*                                                                  */ 00750000
*/*                                                                  */ 00800000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00850000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00900000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1993,2000                       */ 00950000
*/*                                                                  */ 01000000
*/* STATUS= HBB7703                                                  */ 01050000
*/*                                                                  */ 01100000
*/**END_OF_PROPRIETARY_STATEMENT**************************************/ 01150000
*/*                                                                     01200000
*                                                                       01250000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01300000
*01* END OF EXTERNAL CLASSIFICATION:                                    01350000
*                                                                       01400000
*01* FUNCTION:                                                          01450000
*                                                                       01500000
*    This file contains the mapping of the DISPLAY OMVS interface       01550000
*    between BPXOMAST, BPXAMRMF and BPXODMVS                            01600000
*                                                                       01650000
*                                                                       01700000
*01* METHOD OF ACCESS:                                                  01750000
*                                                                       01800000
*02*   PL/X:                                                            01850000
*                                                                       01900000
*        %INCLUDE SYSLIB(BPXZODMV)                                      01950000
*                                                                       02000000
*        There is no default for basing the ODMV.                       02109990
*        Obtain a sufficiently large buffer for this structure          02169980
*        and base ODMV on the pointer to this buffer.                   02229970
*                                                                       02300000
*02*   ASM:                                                             02350000
*                                                                       02400000
*        None                                                           02450000
*                                                                       02500000
*01* SIZE: Release dependent.  Refer to the mapping.                    02550000
*            ODMVSYSL     -- X'0074' bytes                              02560000
*            ODMVPRCL     -- X'0078' bytes                              02570000
*            ODMV         -- X'0030' bytes                              02600000
*            ODMVOUT      -- X'04C0' bytes                              02650000
*            ODMVOUTARRAY -- X'0004' bytes                              02700000
*            ODMVTHDARRAY -- X'0004' bytes                              02750000
*            ODMVFILE     -- X'00DC' bytes                              02800000
*            ODMVPROCESS  -- X'009C' bytes                              02869990
*            ODMVTHREADS  -- X'00AC' bytes                              02900000
*            ODMVPFS      -- X'00EC' bytes                              02950000
*            ODMVCINET    -- X'0040' bytes                              03000000
*                                                                       03050000
*01* POINTED TO BY: Pointer passed as input parameter.                  03100000
*                                                                       03150000
*01* CREATED BY: Display OMVS  Command  (BPXOMAST)                      03200000
*                                                                       03250000
*01* DELETED BY: Display OMVS  Command  (BPXOMAST)                      03300000
*                                                                       03350000
*01* STORAGE ATTRIBUTES:                                                03400000
*02*   RESIDENCY: Data Space                                            03450000
*                                                                       03500000
*01* FREQUENCY: 1 per Display OMVS operator command                     03550000
*                                                                       03600000
*01* SERIALIZATION: None                                                03650000
*                                                                       03700000
*01* DEPENDENCIES:                                                      03750000
*      Data space provides enough storage to contain either             03800000
*      all process information or file information to be displayed.     03850000
*                                                                       03900000
*01* NOTES: None                                                        03950000
*                                                                       04000000
*01* COMPONENT: OpenMVS (SCPX1)                                         04050000
*                                                                       04100000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04150000
*                                                                       04200000
*01* EYE-CATCHER: ODMV                                                  04250000
*02*   OFFSET:  0                                                       04300000
*02*   LENGTH:  4                                                       04350000
*                                                                       04400000
*                                                                       04450000
*01* CHANGE-ACTIVITY:                                                   04500000
*                                                                       04550000
*  $L0=POSIXXOD, HOM1110, 921201, PDJD: OpenMVS Initial release         04600000
*  $D1=DL70014 , HOM1110, 921031, PDJD: Pthread Support                 04650000
*  $D2=DOAA009 , HOM1120, 930830, PDJD: Wellington support for NFS      04700000
*                                       (Hit to DISPLAY OMVS)           04750000
*  $D3=DPFA051 , HOM1130, 940231, PDJD: A051.04 Initial XPG4 IPC        04800000
*  $D4=DOAA052 , HOM1130, 940831, PDJD: A052.06 NFS Client Support      04850000
*  $D5=DSPA112 , HOM1150, 951022, PDKF: A112.00 Permanent Kernel        04900000
*  $D6=DSPA166 , HOM1150, 960304, PDJC: A166.03 Display OMVS display    04950000
*                                       threads                         05000000
*  $P0=PSP0076 , HOM1150, 960501, PDJC: Display threads rework          05050000
*  $P1=PSY0227 , JBB6604, 970110, PDJV: Add mount mode for filesystems  05100000
*  $D7=DVTA242 , HBB6606, 970922, PDJM: A242.00 Argument Suppression    05150000
*  $D8=DWKA311 , HBB6608, 980713, PDSZ: A311.00 SETOMVS RESET + cleanup 05200000
*  $P2=PWK0280 , HBB6608, 981005, PDJQ: Fix MaxQueuedSigs               05250000
*  $D9=DWKA309 , HBB6609, 981015, PDSZ: Sysplex file support    A309    05300000
*  $DA=DWKA311 , HBB6609, 981215, PDNU: A311.01 D OMVS,PFS              05350000
*  $DB=DWKA311 , HBB6609, 990301, PDNU: A311.03 D OMVS,CINET            05400000
*  $DC=DWYA315 , JBB6609, 990201, PDAE: A315.00 SHRLIB support          05450000
*  $DD=DWYA309 , JBB6609, 990401, PDSZ: A309.04 VERSION keyword         05500000
*  $P3=PWY0586 , JBB6609, 990602, PDSZ: Sysplex= support                05550000
*  $DE=DXDA382 , HBB7703, 990919, PDQR: A382.00/made bilingual          05600000
*  $P4=PXD0724 , HBB7703, 991116, PDQR: Resolved informational messages 05625000
*  $01=OW41995 , JBB6609, 991122, PDJS: Add BrlmSrv to options (PXD0837 05637500
*  $DF=DXDA405 , HBB7703, 000110, PDRD: (DCR A405.04) Socket highwater  05643700
*  $DG=DXDA405 , HBB7703, 000118, PD2R: (DCR A405.04) BRL wait Display  05646800
*  $DH=DXVA405 , HBB7704, 991026, PDUA: A405 D OMVS,LIMITS              05647800
*  $P5=PXV0116 , HBB7704, 000328, PDUA: Resolved change conflict to R10 05648800
****END OF SPECIFICATIONS*********************************************/ 05650000
*% /*                                                                   06750000
.P0      ANOP                                                           06800000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06850000
         AIF   ('&LIST' EQ 'YES').P2                                    06900000
.P1      ANOP                                                           06950000
         PUSH  PRINT                                                    07000000
         PRINT OFF                                                      07050000
.P2      ANOP                                                           07100000
*                                                                       07150000
*   Mapping of ODMV data area supplied to BPXEKDA                       07200000
*                                                                       07250000
*                                                                       07300000
         AIF   ('&ODMV' EQ 'NO').L0002                                  07350000
         AIF   ('&DSECT' EQ 'YES').L0003                                07400000
         AIF   ('&ODMV' NE 'YES').L0002                                 07450000
ODMV     DS    0D                                                       07500000
         AGO   .L0004                                                   07550000
.L0003   ANOP                                                           07600000
ODMV     DSECT                                                          07650000
.L0004   ANOP                                                           07700000
ODMVID   DS    1CL0004   EBCDIC ID - ODMV                               07750000
ODMVOUTPTR DS  1AL4      Address of Output area ODMVOUT                 07800000
*                                                                       07850000
*   Input parm area supplied to BPXEKDA                                 07900000
*                                                                       07950000
*                                                                       08000000
ODMVINPUTPARMS DS 1CL0040 Input parameters                              08050000
         ORG   ODMVINPUTPARMS                                           08100000
ODMVINFLAGS DS 1BL4      Input Flags (Non-mutually exclusive)           08150000
         ORG   ODMVINFLAGS                                              08200000
ODMVINBYTE1 DS 1BL1                                                     08216600
         ORG   ODMVINBYTE1                                              08233200
ODMVSUMMARY EQU X'80'    Summary specified or defaulted                 08250000
ODMVBRLS EQU   X'40'     Byte Range Lock Wait for                       08275000
*                                                                       08277000
*      ***************************************************************  08279000
*      *                                                             *  08281000
*      * Process. Only processed when OdmvPIDs=On                       08283000
*      *                                                             *  08285000
*      ***************************************************************  08287000
*                                                                       08289000
*                                                                       08291000
ODMVRESETSYSLHW EQU X'20' Reset Highwatermark of System before         *08293000
                         gathering limit data                           08295000
         ORG   ODMVINFLAGS+X'00000004'                                  08300000
ODMVINFLAGSM DS 1BL4     Mutually Exclusive Input Flags                 08350000
         ORG   ODMVINFLAGSM                                             08400000
ODMVINBYTEM1 DS 1BL1                                                    08450000
         ORG   ODMVINBYTEM1                                             08500000
ODMVFILES EQU  X'80'     FILE operand specified                         08550000
ODMVASIDALLS EQU X'40'   ASID=ALL or VSERVER specified                  08600000
ODMVASIDS EQU  X'20'     ASID specified and not ALL                     08650000
ODMVUS   EQU   X'10'     User Name specified                            08700000
ODMVVSERVER EQU X'08'    VSERVER Specified                              08750000
ODMVOPTIONS EQU X'04'    OPTIONS specified                              08800000
ODMVPIDS EQU   X'02'     PID specified                                  08850000
ODMVPFSBIT EQU X'01'     PFS operand specified                          08900000
         ORG   ODMVINBYTEM1+X'00000001'                                 08950000
ODMVINBYTEM2 DS 1BL1                                                    09000000
         ORG   ODMVINBYTEM2                                             09050000
ODMVCINETALL EQU X'80'   CINET=ALL specified                            09100000
ODMVCINETTP EQU X'40'    CINET=tpname specified                         09150000
ODMVLIMITS EQU X'20'     LIMITS specified. Gathers                      09153000
*                                                                       09156000
*      ***************************************************************  09159000
*      *                                                             *  09162000
*      * System or Process Limit Data. PID is set                       09165000
*      * in OdmvPidParm then Process Limits are                         09168000
*      * returned, else Sustem Limits.                                  09171000
*      *                                                             *  09174000
*      ***************************************************************  09177000
*                                                                       09180000
*                                                                       09183000
         ORG   ODMVINBYTEM2+X'00000001'                                 09193700
ODMVINBYTEM3 DS 1BL1                                                    09237400
ODMVINBYTEM4 DS 1BL1                                                    09281100
ODMVPIDPARM DS 1FL4      PID valid when OdmvPIDs=On                     09325000
ODMVASIDPARM DS 1FL2     ASID valid when OdmvASIDs=On                   09350000
ODMVUPARM DS   1CL0008   User name valid when OdmvUd=On                 09400000
ODMVCINETTPNAME DS 1CL0008 When OdmvCinetTP, this field holds tpname    09500000
ODMVRESERVED1 DS 1CL0010 Reserved                                       09550000
ODMVINPUTEND DS 0C       End of Input Block                             09600000
ODMV_LEN EQU   *-ODMV                                                   09700000
.L0002   ANOP                                                           09750000
*                                                                       09800000
*   Output area returned by BPXEKDA                                     09850000
*                                                                       09900000
*                                                                       09950000
         AIF   ('&ODMVOUT' EQ 'NO').L0005                               10000000
         AIF   ('&DSECT' EQ 'YES').L0006                                10050000
         AIF   ('&ODMVOUT' NE 'YES').L0005                              10100000
ODMVOUT  DS    0D                                                       10150000
         AGO   .L0007                                                   10200000
.L0006   ANOP                                                           10250000
ODMVOUT  DSECT                                                          10300000
.L0007   ANOP                                                           10350000
ODMVVERNUM DS  1FL4      Version Number of Output Area                  10400000
ODMVSUMMARYDATA DS 1CL0052 Summary data returned on all invocations     10450000
         ORG   ODMVSUMMARYDATA                                          10500000
ODMVOMVSPROC DS 1CL0008  OMVS Procedure name                            10550000
ODMVGEN01 DS   1FL4                                                     10600000
         ORG   ODMVGEN01                                                10650000
ODMVGEN02 DS   1FL2                                                     10700000
ODMVKERNELASID DS 1FL2   Kernel's address space                         10750000
ODMVPARMMEMLIST DS 1CL0040 List of OMVS Parmlib member suffixes        *10800000
                         (XX,YY,ZZ,..)                                  10850000
ODMVOPTIONSDATA DS 1CL1060 Options data returned for OdmvOptions        10900000
         ORG   ODMVOPTIONSDATA                                          10950000
ODMVMAXPROCSYS DS 1FL4   Max processes on system                        11000000
ODMVCHILDMAX DS 1FL4     Max processes per User ID                      11050000
ODMVMAXFILEPROC DS 1FL4  Max number of allocated files for a single    *11100000
                         process                                        11150000
ODMVMAXFILESIZE DS 1FL4  Max file size                                  11200000
ODMVMAXCPUTIME DS 1FL4   Max CPU time                                   11250000
ODMVMAXUSERS DS 1FL4     Max number of users on system                  11300000
ODMVMAXRTYS DS 1FL4      Max number of remote-terminal sessions         11350000
ODMVMAXPTYS DS 1FL4      Max number of pseudo-terminal sessions         11400000
ODMVMAXMMAPAREA DS 1FL4  Max size of Memory Map Area in PAGES           11450000
ODMVMAXASSIZE DS 1FL4    Max address space size                         11500000
ODMVMAXTHREADS DS 1FL4   Max # of Threads                               11550000
ODMVMAXTHREADTASKS DS 1FL4 Max number of tasks running Pthreads per    *11600000
                         process                                        11650000
ODMVMAXCORESIZE DS 1FL4  Max core size                                  11700000
ODMVMAXSHRPAGES DS 1FL4  Maximum number of pages that can be in a      *11750000
                         shared relationship in the system              11800000
ODMVMAXMSGNIDS DS 1FL4   Max system message queue IDs                   11850000
ODMVMAXMSGQBYTES DS 1FL4 Max bytes per message queue                    11900000
ODMVMAXMSGQMNUM DS 1FL4  Max messages per queue                         11950000
ODMVMAXSHMNIDS DS 1FL4   Max system shared memory IDs                   12000000
ODMVMAXSHMSPAGES DS 1FL4 Max system shared memory pages for all        *12050000
                         segements                                      12100000
ODMVMAXSHMMPAGES DS 1FL4 Max shared memory pages per segment            12150000
ODMVMAXSHMNSEGS DS 1FL4  Max shared memory segments per process         12200000
ODMVMAXSEMNIDS DS 1FL4   Max system semaphore IDs                       12250000
ODMVMAXSEMNSEMS DS 1FL4  Max number of semaphores per semaphore set     12300000
ODMVMAXSEMNOPS DS 1FL4   Max number of operations per BPX1SOP (SEMOP)  *12350000
                         call                                           12400000
ODMVSUPERUSER DS 1CL0008 SuperUser                                      12450000
ODMVSTEPLIBLISTLEN DS 1FL1 Length of STEPLIB name                       12500000
ODMVSTEPLIBLIST DS 1CL0255 Name of STEPLIB dataset                      12550000
ODMVSETPPGCNT DS 1FL1    Priority PG count                              12600000
ODMVSETPGOALCNT DS 1FL1  Priority Goal count                            12650000
ODMVUSERIDTABLELEN DS 1FL1 Length of table name                         12700000
ODMVRESERVED02 DS 1CL0002 Reserved                                      12750000
ODMVUSERIDTABLE DS 1CL0255 Name of Userid table                         12800000
ODMVPRIORITYPG DS 1FL2   performance group numbers for compatibility   *12850000
                         mode 40 possible entries                       12900000
         ORG   ODMVPRIORITYPG+X'00000050'                               12950000
ODMVRESERVED10 DS 1CL0004 Reserved                                      12975000
ODMVGEN04 DS   0C        Ensure array on DWD                            13000000
ODMVPRIORITYGOAL DS 1CL0008 service classes for goal mode 40 possible  *13050000
                         entries                                        13100000
         ORG   ODMVPRIORITYGOAL+X'00000140'                             13150000
RESERVED09 DS  1CL0004   Reserved                                       13200000
ODMVTTYGROUP DS 1CL0008  TTY Group name                                 13250000
ODMVMAXQUEUEDSIGS DS 1FL4 MaxQueuedSigs from Optn                       13300000
ODMVSHRLIBRGNSIZE DS 1FL4 ShrLibRgnSize from Optn                       13350000
ODMVSHRLIBMAXPAGES DS 1FL4 ShrLibMaxPages from Optn                     13400000
ODMVVERSION DS 1CL0008   OS/390 Version String                          13450000
ODMVFLAGWORD01 DS 1FL4   Flag word                                      13500000
         ORG   ODMVFLAGWORD01                                           13550000
ODMVFORKCOPY EQU X'80'   ON = Copy parent data to child at the time of *13600000
                         fork, OFF= Use Copy-on-Write for parent data  *13650000
                         (Default)                                      13700000
ODMVSYSCALL_COUNTS EQU X'40' ON = counts being traced OFF= counts not  *13750000
                         being done                                     13800000
ODMVSYSPLEX EQU X'20'    ON= IPLed sysplex = Y OFF= local system        13850000
ODMVSETPEXIST EQU X'10'  If SETP was created                            13900000
ODMVLIMMSGSYS EQU X'08'  Level of warning messages for                  13910000
ODMVLIMMSGPROC EQU X'04' reached limits. Can be SYS=OFF PROC=OFF is    *13920000
                         NONE SYS=ON PROC=OFF is SYSTEM SYS=ON PROC=ON *13930000
                         is ALL                                         13940000
         ORG   ODMVOPTIONSDATA+X'00000424'                              13950000
ODMVSECONDARYDATA DS 1CL0056 Secondary Output Data                      14019990
         ORG   ODMVSECONDARYDATA                                        14050000
ODMVOUTARRAYSIZE DS 1FL4 Number of entries in secondary output data    *14100000
                         pointer array                                  14150000
ODMVOUTARRAYPTR DS 1AL4  Address of output data pointer array           14200000
ODMVTHDARRAYSIZE DS 1FL4 Number of entries in output thread data       *14250000
                         pointer array                                  14300000
ODMVTHDARRAYPTR DS 1AL4  Address of thread data pointer array           14350000
ODMVPFSCOUNTS DS 1CL0012 Counts of PFS Array entries                    14400000
         ORG   ODMVPFSCOUNTS                                            14450000
ODMVPFSTYPECOUNT DS 1FL4 Number of PFS 'type' entries                   14500000
ODMVPFSNAMECOUNT DS 1FL4 Number of PFS 'name' entries                   14550000
ODMVPFSPARMCOUNT DS 1FL4 Number of Parm entries                         14600000
ODMVCINETCOUNTS DS 1CL0012 Counts of CINET Array entries                14650000
         ORG   ODMVCINETCOUNTS                                          14700000
ODMVCINETHOMECNT DS 1FL4 Number of CINET home entries                   14750000
ODMVCINETHOSTCNT DS 1FL4 Number of CINET host entries                   14800000
ODMVCINETNETWCNT DS 1FL4 Number of CINET netw entries                   14850000
ODMVFLAGWORD02 DS 1FL4   Flag word                                      14900000
         ORG   ODMVFLAGWORD02                                           14950000
ODMVPARTIAL EQU X'80'    Partial thread data                            15000000
ODMVSYSLIMITS EQU X'40'  Sytem Limits returned                          15010000
ODMVPRCLIMITS EQU X'20'  Process Limits returned                        15020000
         ORG   ODMVFLAGWORD02+X'00000004'                               15033300
ODMVBRLMSRV DS 1CL0008   ByterangelockMgr Server                        15066600
ODMVLIMITSPTR DS 1AL4    Address of limits data pointer When           *15107990
                         OdmvSysLimits is on it points to a structure  *15115980
                         OdmvSysL. When OdmvPrcLimits is on it points  *15123970
                         to a structure OdmvPrcL                        15131960
ODMVRESERVEDDATA DS 1CL0044 Reserved Output Area for Operating System  *15139950
                         Usage                                          15150000
         ORG   ODMVRESERVEDDATA                                         15200000
ODMVCBGEN06 DS 1CL0008   Address of output area                         15250000
         ORG   ODMVCBGEN06                                              15300000
ODMVOUTPUTALETADDR DS 1CL0008 Assembler users can use this              15350000
         ORG   ODMVOUTPUTALETADDR                                       15400000
ODMVOUTPUTALET DS 1FL4                                                  15450000
ODMVOUTPUTADDR DS 1AL4                                                  15500000
ODMVSTOKEN DS  1CL0008   Stoken of Data Space                           15550000
ODMVODCA DS    1AL4      Address of Odca                                15600000
ODMVRETCODE DS 1FL4      Return Code from BPXODMVS                      15650000
ODMVCINETMSGNUM DS 1FL4  Error Message Number                           15700000
ODMVFLAGWORD03 DS 1FL4   Flag word                                      15750000
         ORG   ODMVFLAGWORD03                                           15800000
ODMVCAPS EQU   X'80'     CAPS Specified on D OMVS                       15850000
         ORG   ODMVFLAGWORD03+X'00000004'                               15900000
ODMVPROTPGPTR DS 1AL4    Ptr. to begin of prot. Pg.                     15950000
ODMVRESERVED03 DS 1CL0008 reserved                                      16019990
ODMVEND  DS    0C        End of Block                                   16050000
ODMVOUT_LEN EQU *-ODMVOUT                                               16150000
.L0005   ANOP                                                           16200000
*                                                                       16250000
* ********************************************************************  16300000
* * Output area array returned for OdmvFiles, OdmvPIDs, OdmvVserver, *  16350000
* *  OdmvAsidAlls, OdmvAsids, OdmvPFSBit, OdmvCinetTp, OdmvCinetAll  *  16400000
* *  or OdmvUs that contains the list of pointers to the associated  *  16450000
* *  output areas.                                                      16500000
* ********************************************************************  16550000
*                                                                       16600000
*                                                                       16650000
         AIF   ('&ODMVOUTARRAY' EQ 'NO').L0008                          16700000
         AIF   ('&DSECT' EQ 'YES').L0009                                16750000
         AIF   ('&ODMVOUTARRAY' NE 'YES').L0008                         16800000
ODMVOUTARRAY DS 0F                                                      16850000
         AGO   .L000A                                                   16900000
.L0009   ANOP                                                           16950000
ODMVOUTARRAY DSECT                                                      17000000
.L000A   ANOP                                                           17050000
ODMVOUTARRAYELEMPTR DS 1AL4                                             17100000
ODMVOUTARRAY_LEN EQU *-ODMVOUTARRAY                                     17150000
.L0008   ANOP                                                           17200000
*                                                                       17250000
* ********************************************************************  17300000
* * Output area array returned for OdmvPIDs for the list of pointers *  17350000
* *  to the thread data areas for the returned process                  17400000
* ********************************************************************  17450000
*                                                                       17500000
*                                                                       17550000
         AIF   ('&ODMVTHDARRAY' EQ 'NO').L000B                          17600000
         AIF   ('&DSECT' EQ 'YES').L000C                                17650000
         AIF   ('&ODMVTHDARRAY' NE 'YES').L000B                         17700000
ODMVTHDARRAY DS 0F                                                      17750000
         AGO   .L000D                                                   17800000
.L000C   ANOP                                                           17850000
ODMVTHDARRAY DSECT                                                      17900000
.L000D   ANOP                                                           17950000
ODMVTHDARRAYELEMPTR DS 1AL4                                             18000000
ODMVTHDARRAY_LEN EQU *-ODMVTHDARRAY                                     18050000
.L000B   ANOP                                                           18100000
*                                                                       18150000
* ********************************************************************  18200000
* * Mapping of file data returned for OdmvFiles                         18250000
* ********************************************************************  18300000
*                                                                       18350000
*                                                                       18400000
         AIF   ('&ODMVFILE' EQ 'NO').L000E                              18450000
         AIF   ('&DSECT' EQ 'YES').L000F                                18500000
         AIF   ('&ODMVFILE' NE 'YES').L000E                             18550000
ODMVFILE DS    0F                                                       18600000
         AGO   .L0010                                                   18650000
.L000F   ANOP                                                           18700000
ODMVFILE DSECT                                                          18750000
.L0010   ANOP                                                           18800000
ODMVDEVICE DS  1FL4                                                     18850000
ODMVTYPENAME DS 1CL0008                                                 18900000
ODMVSTATUS DS  1FL4      Status matches MSG BPXO45Ie 1= FORCE UNMOUNT  *18950000
                         2= DRAIN UNMOUNT 3= IMMEDIATE UNMOUNT 4=      *19000000
                         NORMAL UNMOUNT 5= RESET UNMOUNT 6= IMMEDIATE  *19050000
                         UNMOUNT ATTEMPTED 7= ACTIVE 8= QUIESCED 9=    *19100000
                         NOT ACTIVE 10= MOUNT IN PROGRESS 11= ASYNCH   *19150000
                         MOUNT IN PROGRESS 12= IN RECOVERY 13= UNOWNED  19200000
ODMVQJOBNAME DS 1CL0008  Quiesce Job Name                               19250000
ODMVQPID DS    1FL4      Quiesce Process ID                             19300000
ODMVMOUNTMODE DS 1FL4    Mount mode for filesystem                      19350000
ODMVFSNAME DS  1CL0044   File System name for PDSE/X                    19400000
ODMVPATH DS    1CL0063   Path or Directory name converted to upper     *19450000
                         case characters                                19500000
ODMVMOUNTPARM DS 1CL0057 Mount parm truncated and optionally converted *19550000
                         to upper case                                  19600000
ODMVFSOWNER DS 1CL0008   FS Owner name                                  19650000
ODMVFSNOAUTOMOVE DS 1FL4 FS is NOT AUTOMOVEalbe                         19700000
ODMVQSYSTEM DS 1CL0008   Quiesce system                                 19750000
ODMVFSCLIENT DS 1FL4     1 = Yes is a client 2 = No is not a client     19800000
ODMVFILE_LEN EQU *-ODMVFILE                                             19850000
.L000E   ANOP                                                           19900000
*                                                                       19950000
* ********************************************************************  20000000
* * Mapping of process data returned for OdmvPids, OdmvAsidAlls,     *  20050000
* *   OdmvAsids                                                         20100000
* ********************************************************************  20150000
*                                                                       20200000
*                                                                       20250000
         AIF   ('&ODMVPROCESS' EQ 'NO').L0011                           20300000
         AIF   ('&DSECT' EQ 'YES').L0012                                20350000
         AIF   ('&ODMVPROCESS' NE 'YES').L0011                          20400000
ODMVPROCESS DS 0F                                                       20450000
         AGO   .L0013                                                   20500000
.L0012   ANOP                                                           20550000
ODMVPROCESS DSECT                                                       20600000
.L0013   ANOP                                                           20650000
ODMVJOBNAME DS 1CL0008   Job name from ASCBJBNI or ASCBJBNS             20700000
ODMVUSER DS    1CL0008   User Name from OasbLoginName                   20750000
ODMVPID  DS    1FL4      Process ID                                     20800000
ODMVPPID DS    1FL4      Parent's Process ID                            20850000
ODMVASID DS    1FL2      Address space ID or zero for zombie state      20900000
ODMVRESERVED04 DS 1CL0005 Reserved                                      20950000
ODMVSTARTYD DS 1CL0007   Local Start Time YYYYDDD                       21000000
         ORG   ODMVSTARTYD                                              21050000
ODMVSTYY DS    1CL0004   Start Time Year                                21100000
ODMVSTDD DS    1CL0003   Start Time Day of year (1-366)                 21150000
ODMVSTART DS   1CL0006   Start Time hhmmss                              21200000
         ORG   ODMVSTART                                                21250000
ODMVSTHH DS    1CL0002   Start Time hours                               21300000
ODMVSTMM DS    1CL0002   Start Time minutes                             21350000
ODMVSTSS DS    1CL0002   Start Time seconds                             21400000
ODMVCT   DS    1CL0008   Process system and user compute time           21450000
ODMVCSTATE DS  1BL4      Process state                                  21500000
         ORG   ODMVCSTATE                                               21550000
ODMVSTATUS1 DS 1BL1      MVS status                                     21600000
         ORG   ODMVSTATUS1                                              21650000
ODMVSWAP EQU   X'80'     Swapped out                                    21700000
ODMVWAITP EQU  X'40'     Ptrace Kernel Wait                             21750000
         ORG   ODMVSTATUS1+X'00000001'                                  21800000
ODMVSTATUS2 DS 1BL1      Process status                                 21850000
         ORG   ODMVSTATUS2                                              21900000
ODMVSTOPPED EQU X'80'    Stopped process                                21950000
ODMVGEN05 EQU  X'40'                                                    22000000
ODMVMULTHREAD EQU X'20'  0=One OpenMVS active task                      22050000
ODMVPTHREAD EQU X'10'    0=No pthread task in process                   22100000
         ORG   ODMVSTATUS2+X'00000001'                                  22150000
ODMVSTATUS3 DS 1CL0001   State of reported task - with PgpsPthread=0   *22200000
                         the most recent created thread, PgpsPthread=1 *22250000
                         the initial pthread task (IPT)                 22300000
ODMVRESERVED05 DS 1BL1   Reserved                                       22350000
ODMVLATCHWAITPID DS 1FL4 Latch Process ID the process is waiting for   *22400000
                         (Zero=not waiting)                             22450000
ODMVGENERALFLAGS DS 1BL4 General flags                                  22500000
         ORG   ODMVGENERALFLAGS                                         22550000
ODMVSERVER EQU X'80'     OdmvServerInfo data is valid                   22600000
         ORG   ODMVGENERALFLAGS+X'00000004'                             22650000
ODMVSERVERINFO DS 1CL0044 Server Information                            22700000
         ORG   ODMVSERVERINFO                                           22750000
ODMVSERVERNAME DS 1CL0032 SabServerName SERVER=                         22800000
ODMVACTIVEFILES DS 1FL4  SabVDECount AF=                                22850000
ODMVMAXFILES DS 1FL4     SabMaxFiles MF=                                22900000
ODMVSERVERTYPE DS 1FL4   SabServerType TYPE= See NRegSType information *22933300
                         in BPXYNREG for definition of Server Types.    22966600
ODMVCMD  DS    1CL0040   Command String buffer                          23000000
ODMVRUID DS    1FL4      Process Real User Id                           23030000
ODMVEUID DS    1FL4      Process Effective User Id                      23060000
ODMVPROCESS_LEN EQU *-ODMVPROCESS                                       23100000
.L0011   ANOP                                                           23150000
*                                                                       23200000
* ********************************************************************  23250000
* * Mapping of threads data returned for OdmvPids                       23300000
* ********************************************************************  23350000
*                                                                       23400000
*                                                                       23450000
         AIF   ('&ODMVTHREADS' EQ 'NO').L0014                           23500000
         AIF   ('&DSECT' EQ 'YES').L0015                                23550000
         AIF   ('&ODMVTHREADS' NE 'YES').L0014                          23600000
ODMVTHREADS DS 0F        Thread info                                    23650000
         AGO   .L0016                                                   23700000
.L0015   ANOP                                                           23750000
ODMVTHREADS DSECT        Thread info                                    23800000
.L0016   ANOP                                                           23850000
ODMVTHDID DS   1CL0008   Thread ID                                      23900000
ODMVTHDTCB DS  1AL4      TCB address                                    23950000
ODMVTHDJOBNAME DS 1CL0008 Primary Address space job name, if primary   *24000000
                         ^= home, otherwise blanks                      24050000
ODMVTHDUSERNAME DS 1CL0008 User name if a task level security          *24100000
                         environment created by pthread_security_np    *24150000
                         exists, otherwise blanks                       24200000
ODMVTHDSYSCALL DS 1FL4   Syscall code                                   24250000
ODMVTHDTTIME DS 1BL8     TCB's accumulated CPU time                     24300000
ODMVTHDTAG DS  1CL0065   Tag data                                       24350000
ODMVTHDSTATUS1 DS 1CL0001 Pthread created/Dubbed                        24400000
ODMVTHDSTATUS2 DS 1CL0001 Wait/Running status                           24450000
ODMVTHDSTATUS3 DS 1CL0001 Creation type                                 24500000
ODMVTHDSTATUS4 DS 1CL0001 Detached/undetached                           24550000
ODMVTHDSTATUS5 DS 1CL0001 Ptrace held                                   24600000
ODMVTHDFLAGS DS 1BL1     Thread flags                                   24650000
         ORG   ODMVTHDFLAGS                                             24700000
ODMVTHDTAGSET EQU X'80'  Thread has tag data                            24750000
         ORG   ODMVTHDFLAGS+X'00000001'                                 24800000
ODMVRESERVED06 DS 1CL0001 Reserved                                      24850000
ODMVTHDBRL DS  1CL0028   Byte Range Lock Waiter Data valid for OdmvBrl *24854790
                         only                                           24857600
         ORG   ODMVTHDBRL                                               24861400
ODMVTHDBRLDEVNO DS 1FL4  Dev # of BRL Wait File                         24865200
ODMVTHDBRLINO DS 1FL4    Inode # of BRL Wait File                       24869000
ODMVTHDBRLOWNERPID DS 1FL4 BRL Wait FileOwner PID                       24872800
ODMVTHDBRLFILE DS 1CL0016 BRL Wait File Name                            24876600
ODMVRESERVEDDATA2 DS 1CL0032 For BRLM usage only                        24883390
         ORG   ODMVRESERVEDDATA2                                        24888990
ODMVTHDBRLOFTE DS 1AL4   For use in frbrl getlk call                    24891800
ODMVTHDBRLVNOD DS 1AL4   For use in frbrl getlk call                    24895600
ODMVTHDBRLPROCESSTOKEN DS 1CL0008                                       24896600
ODMVTHDBRLTHREADID DS 1CL0008                                           24897600
ODMVTHDBRLRESERVEDATA DS 1CL0008 possible size change                   24898600
ODMVTHDEND DS  0C        End of thread info                             24900000
ODMVTHREADS_LEN EQU *-ODMVTHREADS                                       24950000
.L0014   ANOP                                                           25000000
*                                                                       25050000
* ********************************************************************  25100000
* *  Mapping of PFS data returned for OdmvPfsBit.                       25150000
* ********************************************************************  25200000
*                                                                       25250000
*                                                                       25300000
         AIF   ('&ODMVPFS' EQ 'NO').L0017                               25350000
         AIF   ('&DSECT' EQ 'YES').L0018                                25400000
         AIF   ('&ODMVPFS' NE 'YES').L0017                              25450000
ODMVPFS  DS    0F                                                       25500000
         AGO   .L0019                                                   25550000
.L0018   ANOP                                                           25600000
ODMVPFS  DSECT                                                          25650000
.L0019   ANOP                                                           25700000
ODMVPFSCHARS DS 1CL0212  EBCDIC data                                    25750000
         ORG   ODMVPFSCHARS                                             25800000
ODMVPFSNAME DS 1CL0008   PFS name|type from the GFS                     25850000
ODMVPFSDESCRIPTION DS 1CL0020 Brief description of PFS                  25900000
         ORG   ODMVPFSDESCRIPTION                                       25950000
ODMVPFSSOCKET DS 1CL0008 if socket, the word SOCKET                     26000000
ODMVPFSVFS DS  1CL0012   if socket, AF_INET, etc.                       26050000
ODMVPFSENTRY DS 1CL0008  EntryPoint name                                26100000
ODMVPFSSTATUS DS 1CL0005 Status                                         26150000
ODMVPFSFLAGS DS 1CL0003  Flags                                          26200000
ODMVPFSPARMS DS 1CL0165  Parameter data                                 26250000
         ORG   ODMVPFSPARMS                                             26300000
ODMVPFSBLANK DS 1CL0001  a blank - special for HFS                      26350000
ODMVGEN07 DS   1CL0164                                                  26400000
ODMVRESERVED07 DS 1CL0003 Reserved                                      26450000
ODMVPFSNUMS DS 1CL0024   NUMERIC data                                   26500000
         ORG   ODMVPFSNUMS                                              26550000
ODMVPFSMAXSOCK DS 1FL4   MAXSOCKETS                                     26600000
ODMVPFSOPNSOCK DS 1FL4   Open Sockets                                   26650000
ODMVPFSHWMSOCK DS 1FL4   Highwater mark                                 26675000
ODMVPFSPARMLEN DS 1FL4   The length of OdmvPFSparms                     26700000
ODMVPFSCURRENTVALUES DS 1CL0008 Data for CURRENT VALUES                 26750000
         ORG   ODMVPFSCURRENTVALUES                                     26800000
ODMVPFSFIXED DS 1FL4     FIXED                                          26850000
ODMVPFSVIRTUAL DS 1FL4   VIRTUAL                                        26900000
ODMVPFS_LEN EQU *-ODMVPFS                                               26910000
.L0017   ANOP                                                           26920000
*                                                                       26950000
* ********************************************************************  26950300
* *  Mapping of System Limit Data - Highwater and Current Usage         26950600
* ********************************************************************  26950900
*                                                                       26951200
*                                                                       26951500
         AIF   ('&ODMVSYSL' EQ 'NO').L001A                              26951800
         AIF   ('&DSECT' EQ 'YES').L001B                                26952100
         AIF   ('&ODMVSYSL' NE 'YES').L001A                             26952400
ODMVSYSL DS    0F                                                       26952700
         AGO   .L001C                                                   26953000
.L001B   ANOP                                                           26953300
ODMVSYSL DSECT                                                          26953600
.L001C   ANOP                                                           26953900
ODMVSYSLFCHANGED DS 1BL4 Flag field for changed System limits           26954200
         ORG   ODMVSYSLFCHANGED                                         26954500
ODMVSYSLFBYTE1 DS 1BL1                                                  26954800
         ORG   ODMVSYSLFBYTE1                                           26955100
ODMVSYSLFMAXPROCSYS EQU X'80' MaxProcSys changed                        26955400
ODMVSYSLFMAXUIDS EQU X'40' MaxUids changed                              26955700
ODMVSYSLFMAXPTYS EQU X'20' MaxPtys changed                              26956000
ODMVSYSLFMAXMMAPAREA EQU X'10' MaxMmapArea changed                      26956300
ODMVSYSLFMAXSHRPAGES EQU X'08' MaxShrPages changed                      26956600
ODMVSYSLFIPCMSGNIDS EQU X'04' IpcMsgNids changed                        26956900
ODMVSYSLFIPCSEMNIDS EQU X'02' IpcSemNids changed                        26957200
ODMVSYSLFIPCSHMNIDS EQU X'01' IpcShmNids changed                        26957500
         ORG   ODMVSYSLFBYTE1+X'00000001'                               26957800
ODMVSYSLFBYTE2 DS 1BL1                                                  26958100
         ORG   ODMVSYSLFBYTE2                                           26958400
ODMVSYSLFIPCSHMSPAGES EQU X'80' IpcShmSPages changed                    26958700
ODMVSYSLFIPCMSGQBYTES EQU X'40'                                         26959000
ODMVSYSLFIPCMSGQMNUM EQU X'20'                                          26959300
ODMVSYSLFIPCSHMMPAGES EQU X'10'                                         26959600
ODMVSYSLFSHRLIBRGNSIZE EQU X'08' ShrLibRgnSize changed                  26959900
ODMVSYSLFSHRLIBMAXPAGES EQU X'04' ShrLibMaxPages changed                26960200
         ORG   ODMVSYSLFBYTE2+X'00000001'                               26960500
ODMVSYSLFBYTE3 DS 1BL1                                                  26960800
ODMVSYSLFBYTE4 DS 1BL1                                                  26961100
ODMVSYSLMAXPROCSYSC DS 1FL4 Current # of processes                      26961400
ODMVSYSLMAXPROCSYSH DS 1FL4 Highwater # of processes                    26961700
ODMVSYSLMAXUIDSC DS 1FL4 Current # of userids                           26962000
ODMVSYSLMAXUIDSH DS 1FL4 Highwater # of userids                         26962300
ODMVSYSLMAXPTYSC DS 1FL4 Current # of ptys in use                       26962600
ODMVSYSLMAXPTYSH DS 1FL4 Highwater # of ptys in use                     26962900
ODMVSYSLMAXMMAPAREAC DS 1FL4 Current # of mmap pages                    26963200
ODMVSYSLMAXMMAPAREAH DS 1FL4 Highwater # of mmap pages                  26963500
ODMVSYSLMAXSHRPAGESC DS 1FL4 Current # of shared pages                  26963800
ODMVSYSLMAXSHRPAGESH DS 1FL4 Highwater # of shared pages                26964100
ODMVSYSLIPCMSGNIDSC DS 1FL4 Current # of message queue IDs in use       26964400
ODMVSYSLIPCMSGNIDSH DS 1FL4 Highwater # of message queue IDs in use     26964700
ODMVSYSLIPCSEMNIDSC DS 1FL4 Current # of semaphore IDs in use           26965000
ODMVSYSLIPCSEMNIDSH DS 1FL4 Highwater # of semaphore IDs in use         26965300
ODMVSYSLIPCSHMNIDSC DS 1FL4 Current # of shared memory IDs in use       26965600
ODMVSYSLIPCSHMNIDSH DS 1FL4 Highwater # of shared memory IDs in use     26965900
ODMVSYSLIPCSHMSPAGESC DS 1FL4 Current # of shared memory pages in use   26966200
ODMVSYSLIPCSHMSPAGESH DS 1FL4 Highwater # of shared memory pages in    *26966500
                         use                                            26966800
ODMVSYSLIPCMSGQBYTESH DS 1FL4 Highwater # of bytes used in a msg queue *26967100
                         for process                                    26967400
ODMVSYSLIPCMSGQBYTESM DS 1FL4 Maximum # of bytes allowed in a msg      *26967700
                         queue for process                              26968000
ODMVSYSLIPCMSGQMNUMH DS 1FL4 Highwater # of msgs used in a msg queue   *26968300
                         for process                                    26968600
ODMVSYSLIPCMSGQMNUMM DS 1FL4 Maximum # of msgs allowed in a msg queue  *26968900
                         for process                                    26969200
ODMVSYSLIPCSHMMPAGESH DS 1FL4 Highwater # of shr mem pages in a        *26969500
                         segment for process                            26969800
ODMVSYSLIPCSHMMPAGESM DS 1FL4 Maximum # of shr mem pages allowed in    *26970100
                         segment for process                            26970400
ODMVSYSLSHRLIBRGNSIZEC DS 1FL4 Current usage of system shared library  *26970700
                         region                                         26971000
ODMVSYSLSHRLIBRGNSIZEH DS 1FL4 Highwater usage of system shared        *26971300
                         library region                                 26971600
ODMVSYSLSHRLIBMAXPAGESC DS 1FL4 Current # of pages of user shared      *26971900
                         library region                                 26972200
ODMVSYSLSHRLIBMAXPAGESH DS 1FL4 Highwater # of pages of user shared    *26972500
                         library pgms                                   26972800
ODMVSYSL_LEN EQU *-ODMVSYSL                                             26973100
.L001A   ANOP                                                           26973400
*                                                                       26973700
* ********************************************************************  26974000
* *  Mapping of Process Limit Data -                                    26974300
* *           Highwater, Maximum  and Current Usage                     26974600
* *                                                                     26974900
* * RESERVED field will not be filled with valid data!                  26975200
* ********************************************************************  26975500
*                                                                       26975800
*                                                                       26976100
         AIF   ('&ODMVPRCL' EQ 'NO').L001D                              26976400
         AIF   ('&DSECT' EQ 'YES').L001E                                26976700
         AIF   ('&ODMVPRCL' NE 'YES').L001D                             26977000
ODMVPRCL DS    0F                                                       26977300
         AGO   .L001F                                                   26977600
.L001E   ANOP                                                           26977900
ODMVPRCL DSECT                                                          26978200
.L001F   ANOP                                                           26978500
ODMVPRCLFCHANGED DS 1BL4 Flag field for changed process limits          26978800
         ORG   ODMVPRCLFCHANGED                                         26979100
ODMVPRCLFBYTE1 DS 1BL1                                                  26979400
         ORG   ODMVPRCLFBYTE1                                           26979700
ODMVPRCLFMAXASSIZE EQU X'80' RESERVED MaxAsSize changed                 26980000
ODMVPRCLFMAXCPU EQU X'40' RESERVED MaxCpu changed                       26980300
ODMVPRCLFMAXFILEPROC EQU X'20' MaxFileProc changed                      26980600
ODMVPRCLFMAXPROCUSER EQU X'10' MaxProcUser changed                      26980900
ODMVPRCLFMAXQUEUEDSIGS EQU X'08' MaxQueuedSigs changed                  26981200
ODMVPRCLFMAXTHREADS EQU X'04' MaxThreads changed                        26981500
ODMVPRCLFMAXTHREADTASKS EQU X'02' MaxThreadTasks changed                26981800
ODMVPRCLFIPCSHMNSEGS EQU X'01' IpcShmNSegs changed                      26982100
         ORG   ODMVPRCLFBYTE1+X'00000001'                               26982400
ODMVPRCLFBYTE2 DS 1BL1                                                  26982700
         ORG   ODMVPRCLFBYTE2                                           26983000
ODMVPRCLFMAXCORESIZE EQU X'80' MaxCoreSize changed                      26983300
ODMVPRCLFMAXFILESIZE EQU X'40' MaxFileSize changed                      26983600
         ORG   ODMVPRCLFBYTE2+X'00000001'                               26983900
ODMVPRCLFBYTE3 DS 1BL1                                                  26984200
ODMVPRCLFBYTE4 DS 1BL1                                                  26984500
ODMVPRCLMAXASSIZEC DS 1FL4 RESERVED Current user region usage for      *26984800
                         address space                                  26985100
ODMVPRCLMAXASSIZEH DS 1FL4 RESERVED Highw. user region usage for       *26985400
                         address space                                  26985700
ODMVPRCLMAXASSIZEM DS 1FL4 RESERVED Max. user region size for address  *26986000
                         space                                          26986300
ODMVPRCLMAXCPUC DS 1FL4  RESERVED Current CPU usage for address space   26986600
ODMVPRCLMAXCPUH DS 1FL4  RESERVED Highwater CPU usage for address      *26986900
                         space                                          26987200
ODMVPRCLMAXCPUM DS 1FL4  RESERVED Max. CPU usage for address space      26987500
ODMVPRCLMAXFILEPROCC DS 1FL4 Current # of files in use for process      26987800
ODMVPRCLMAXFILEPROCH DS 1FL4 Highwater # of files in use for process    26988100
ODMVPRCLMAXFILEPROCMSL DS 1FL4 Maximum # of files allowed for process   26988400
ODMVPRCLMAXFILEPROCMHL DS 1FL4 Maximum # of files allowed for process   26988700
ODMVPRCLMAXFILESIZEMSL DS 1FL4 Maximum size of files allowed for       *26989000
                         process                                        26989300
ODMVPRCLMAXFILESIZEMHL DS 1FL4 Maximum size of files allowed for       *26989600
                         process                                        26989900
ODMVPRCLMAXPROCUSERC DS 1FL4 Current # of processes for user            26990200
ODMVPRCLMAXPROCUSERH DS 1FL4 Highwater # of processes for user          26990500
ODMVPRCLMAXPROCUSERM DS 1FL4 Maximum # of processes allowed for user    26990800
ODMVPRCLMAXQUEUEDSIGSC DS 1FL4 Current # of queued signals for process  26991100
ODMVPRCLMAXQUEUEDSIGSH DS 1FL4 Highwater # of queued sigs for process   26991400
ODMVPRCLMAXQUEUEDSIGSM DS 1FL4 Current # of queued signals for process  26991700
ODMVPRCLMAXTHREADSC DS 1FL4 Current # of threads for process            26992000
ODMVPRCLMAXTHREADSH DS 1FL4 Highwater # of threads for process          26992300
ODMVPRCLMAXTHREADSM DS 1FL4 Maximum # of threads for process            26992600
ODMVPRCLMAXTHREADTASKSC DS 1FL4 Current # of thd tasks for process      26992900
ODMVPRCLMAXTHREADTASKSH DS 1FL4 Highwater # of thd tasks for process    26993200
ODMVPRCLMAXTHREADTASKSM DS 1FL4 Maximum # of thd tasks for process      26993500
ODMVPRCLIPCSHMNSEGSC DS 1FL4 Current # of shr mem allowed segments in  *26993800
                         a process                                      26994100
ODMVPRCLIPCSHMNSEGSH DS 1FL4 Highwater shr mem allowed segments in a   *26994400
                         process                                        26994700
ODMVPRCLIPCSHMNSEGSM DS 1FL4 Maximum # of shr mem allowed segments in  *26995000
                         a process                                      26995300
ODMVPRCLMAXCORESIZEMSL DS 1FL4 Max Size core dumps SOFT                 26995600
ODMVPRCLMAXCORESIZEMHL DS 1FL4 Max Size core dumps HARD                 26995900
*                                                                       26996200
* ********************************************************************  27000000
* * Declare Constants for the PFS output data:                       *  27050000
* ********************************************************************  27100000
*                                                                       27150000
*                                                                       27200000
ODMVPFS#HFS_0TO3 EQU C'HFS ' This is the first 4-byte segment of an    *27250000
                         8-byte constant.                               27300000
ODMVPFS#HFS_4TO7 EQU C'    ' This is the second 4-byte segment of an   *27350000
                         8-byte constant.                               27400000
ODMVPRCL_LEN EQU *-ODMVPRCL                                             27479990
.L001D   ANOP                                                           27509980
*                                                                       27550000
* ********************************************************************  27600000
* *  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  *  27650000
* ********************************************************************  27700000
*                                                                       27750000
*                                                                       27800000
         AIF   ('&ODMVCINET' EQ 'NO').L0020                             27879990
         AIF   ('&DSECT' EQ 'YES').L0021                                27909980
         AIF   ('&ODMVCINET' NE 'YES').L0020                            27939970
ODMVCINET DS   0F                                                       28000000
         AGO   .L0022                                                   28079990
.L0021   ANOP                                                           28109980
ODMVCINET DSECT                                                         28150000
.L0022   ANOP                                                           28219990
ODMVCINETETPNAME DS 1CL0008 Tp name                                     28250000
ODMVCINETHOME@ DS 1CL0012 Home IP address in EBCDIC                     28300000
ODMVCINETHOST@ DS 1CL0012 Host IP address in EBCDIC                     28350000
ODMVCINETNETW@ DS 1CL0012 Net IP address in EBCDIC                      28400000
ODMVCINETMASK DS 1CL0012 Net Mask in EBCDIC                             28450000
ODMVCINETMETRIC DS 1FL4  Metric                                         28500000
ODMVCINETFLAGS DS 1CL0003 Flags                                         28550000
ODMVRESERVED08 DS 1CL0001 Reserved                                      28600000
*                                                                       28650000
* ********************************************************************  28700000
* *VersionNumber values are defined here                        @DEA *  28750000
* ********************************************************************  28800000
*                                                                       28850000
*                                                                       28900000
ODMVVER#ONE EQU 16       Version 1.0 Constant                           28950000
ODMVVER#ONEONE EQU 17    Version 1.1 Constant                           28975000
ODMVVER#ONETWO EQU 18    Version 1.2 Constant                           28985000
*                                                                       29000000
* ********************************************************************  29050000
* * Return Code values are defined here                         @DEA *  29100000
* ********************************************************************  29150000
*                                                                       29200000
*                                                                       29250000
ODMVSUCCESS EQU 0        Execution successful                           29300000
ODMVNOTFOUND EQU 4       ASID or UID not found                          29350000
ODMVFSGMNERROR EQU 8     Error calling FSGMN                            29400000
ODMVBUFFER EQU 12        Buffer to small                                29450000
ODMVFLAGS EQU  16        Input flags invalid                            29500000
ODMVAUTH EQU   20        Wrong authority                                29550000
ODMVINVPTR EQU 24        Ptr. to ODMVOUT zero                           29600000
*                                                                       29606000
* ********************************************************************  29612000
* * OdmvPrcLimits/OdmvSystemLimits constant defined here                29618000
* ********************************************************************  29624000
*                                                                       29630000
*                                                                       29636000
ODMV#UNLIMITED EQU X'FFFFFFFF'                                          29642000
*                                                                       29650000
* ********************************************************************  29700000
* * OdmvStatus/OdmvThdStatus constants are defined here                 29750000
* ********************************************************************  29800000
*                                                                       29850000
*    *****************************************************************  29900000
*    *                                                               *  29950000
*    * Constants for OdmvStatus3                                     *  30000000
*    *                                                               *  30050000
*    *****************************************************************  30100000
*                                                                       30150000
*                                                                       30200000
ODMVZOMBIE EQU C'Z'      Process terminated and parent has not         *30250000
                         complete wait                                  30300000
ODMVZOMBIE2 EQU C'L'     Process terminated and still session or       *30350000
                         process group leader                           30400000
ODMVQUIESCET EQU C'Q'    Quiese termination wait                        30450000
*                                                                       30500000
*    *****************************************************************  30550000
*    *                                                               *  30600000
*    * Constants for OdmvStatus3 and OdmvThdStatus2                  *  30650000
*    *                                                               *  30700000
*    *****************************************************************  30750000
*                                                                       30800000
*                                                                       30850000
ODMVMSGRCV EQU C'A'      IPC msgrcv wait                                30900000
ODMVMSGSND EQU C'B'      IPC msgsnd wait                                30950000
ODMVWAITC EQU  C'C'      Comm KernelWait                                31000000
ODMVSEMOP EQU  C'D'      IPC semop wait                                 31050000
ODMVWAITF EQU  C'F'      File System Kernel Wait                        31100000
ODMVMVSPAUSE EQU C'G'    MVSPause                                       31150000
ODMVRUN  EQU   C'R'      Not kernel wait                                31200000
ODMVSLEEP EQU  C'S'      sleep() issued                                 31250000
ODMVBRL  EQU   C'T'      Byte Range Lock WaiT                           31275000
ODMVFORK EQU   C'X'      fork new process                               31300000
ODMVCHILD EQU  C'W'      Waiting for child                              31350000
*                                                                       31400000
*    *****************************************************************  31450000
*    *                                                               *  31500000
*    * Constants for OdmvStatus3 and OdmvThdStatus5                  *  31550000
*    *                                                               *  31600000
*    *****************************************************************  31650000
*                                                                       31700000
*                                                                       31750000
ODMVFREEZE EQU C'E'      Quiesce Freeze                                 31800000
*                                                                       31850000
*    *****************************************************************  31900000
*    *                                                               *  31950000
*    * Constants for OdmvThdStatus1                                  *  32000000
*    *                                                               *  32050000
*    *****************************************************************  32100000
*                                                                       32150000
*                                                                       32200000
ODMVPTHDCREATED EQU C'J' Pthread created                                32250000
*                                                                       32300000
*    *****************************************************************  32350000
*    *                                                               *  32400000
*    * Constants for OdmvThdStatus2                                  *  32450000
*    *                                                               *  32500000
*    *****************************************************************  32550000
*                                                                       32600000
*                                                                       32650000
ODMVMVSWAIT EQU C'Y'     MVS wait                                       32700000
*                                                                       32750000
*    *****************************************************************  32800000
*    *                                                               *  32850000
*    * Constants for OdmvThdStatus3                                  *  32900000
*    *                                                               *  32950000
*    *****************************************************************  33000000
*                                                                       33050000
*                                                                       33100000
ODMVMEDIUMWGHT EQU C'N'  Medium weight thread                           33150000
ODMVASYNCH EQU C'O'      Asynchronous thread                            33200000
ODMVIPT  EQU   C'U'      Initial process thread                         33250000
*                                                                       33300000
*    *****************************************************************  33350000
*    *                                                               *  33400000
*    * Constants for OdmvThdStatus4                                  *  33450000
*    *                                                               *  33500000
*    *****************************************************************  33550000
*                                                                       33600000
*                                                                       33650000
ODMVDETACHED EQU C'V'    Thread is detached                             33700000
*                                                                       33750000
*    *****************************************************************  33800000
*    *                                                               *  33850000
*    * Constants for OdmvThdStatus5                                  *  33900000
*    *                                                               *  33950000
*    *****************************************************************  34000000
*                                                                       34050000
*                                                                       34100000
ODMVPTRACE EQU C'P'      Ptrace kernel wait                             34150000
*                                                                       34200000
*    *****************************************************************  34250000
*    *                                                               *  34300000
*    * Following constant are not returned by BPXEKDA. See remarks   *  34350000
*    * how to get those information                                  *  34400000
*    *                                                               *  34450000
*    *****************************************************************  34500000
*                                                                       34550000
*                                                                       34600000
ODMVONETASK EQU C'1'     Only one dubbed task                           34650000
*                                                                       34700000
*      ***************************************************************  34750000
*      *                                                             *  34800000
*      * OdmvMulThread=On                                               34850000
*      *                                                             *  34900000
*      ***************************************************************  34950000
*                                                                       35000000
*                                                                       35050000
ODMVMULTTHDS EQU C'M'    Multiple threads which were NOT               *35100000
                         pthread_create()'ed and has not issued a wait  35150000
*                                                                       35200000
*      ***************************************************************  35250000
*      *                                                             *  35300000
*      * OdmvPthread=On                                                 35350000
*      *                                                             *  35400000
*      ***************************************************************  35450000
*                                                                       35500000
*                                                                       35550000
ODMVPTHREADS EQU C'H'    Multiple threads exist. Some created by       *35600000
                         pthread_create                                 35650000
*                                                                       35700000
*      ***************************************************************  35750000
*      *                                                             *  35800000
*      * OdmvStopped=On                                                 35850000
*      *                                                             *  35900000
*      ***************************************************************  35950000
*                                                                       36000000
*                                                                       36050000
ODMVSTOPST EQU C'T'      stopped                                        36100000
*                                                                       36150000
*      ***************************************************************  36200000
*      *                                                             *  36250000
*      * OdmvSwap=On                                                    36300000
*      *                                                             *  36350000
*      ***************************************************************  36400000
*                                                                       36450000
*                                                                       36500000
ODMVSWAPPED EQU C'I'     Swapped out                                    36550000
*                                                                       36600000
*    *****************************************************************  36650000
*    *                                                               *  36700000
*    * Reserved Constants                                               36750000
*    *                                                               *  36800000
*    *****************************************************************  36850000
*                                                                       36900000
*                                                                       36950000
ODMVWAITO EQU  C'K'      Other Kernel Wait                              37000000
ODMVCINET_LEN EQU *-ODMVCINET                                           37050000
.L0020   ANOP                                                           37119990
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 37150000
         AIF   ('&LIST' EQ 'YES').P4                                    37200000
.P3      ANOP                                                           37250000
         POP   PRINT                                                    37300000
.P4      ANOP                                                           37350000
.P_EXIT  ANOP                                                           37400000
         MEND                                                           37450000
**/ BPXZODMV_2:;                                                        37500000
* %BPXZODMV_INCLUDED = 'YES';                                           37550000
* %DCL ZCBPRINT CHAR EXT;                                               37600000
* %DEACTIVATE ZCBPRINT;                                                 37650000
* %DCL BPXZODMV_LIST CHAR EXT;                                          37700000
* %DEACTIVATE BPXZODMV_LIST;                                            37750000
* %IF BPXZODMV_LIST ^= 'NO' &                                           37800000
*    ZCBPRINT ^= 'NO' %THEN                                             37850000
*   %GOTO BPXZODMV_3;                                                   37900000
*   @LIST PUSH NOECHO;                                                  37950000
*   @LIST NOASSEMBLE NOECHO;                                            38000000
*   @LIST OFF C NOECHO;                                                 38050000
* %BPXZODMV_3:;                                                         38100000
*/* Start of PL/X Source                                             */ 38150000
*                                                                       38200000
* DCL OdmvPtr  Ptr(31) noreg;       /* Pointer to the BPXZODMV   @P4C*/ 38250000
* DCL OdmvALET Ptr(31);             /* Pointer to the ALET           */ 38300000
*/* Mapping of ODMV data area supplied to BPXEKDA                    */ 38350000
*DCL                                                                    38400000
* 1   ODMV             BASED    Bdy(Dword),                             38450000
*  3  OdmvID           Char(4),     /* EBCDIC ID - ODMV              */ 38500000
*  3  OdmvOutPtr       Ptr(31),     /* Address of Output area ODMVOUT*/ 38550000
*/* Input parm area supplied to BPXEKDA                         */      38600000
*  3  OdmvInputParms,               /* Input parameters              */ 38650000
*     5 OdmvInFlags    Bit(32),     /* Input Flags (Non-mutually        38700000
*                                       exclusive)               @DEC*/ 38750000
*      6 OdmvInByte1   Bit(8),                               /* @DFA */ 38775000
*       7 OdmvSummary  Bit(1),      /* Summary specified or defaulted*/ 38800000
*       7 OdmvBrls     Bit(1),      /* Byte Range Lock Wait for      */ 38825000
*                   /* Process. Only processed when OdmvPIDs=On @DFA */ 38831000
*       7 OdmvResetSyslHW Bit(1),   /* Reset Highwatermark of System    38837000
*                                   before gathering limit data @DFA */ 38843000
*     5 OdmvInFlagsM   Bit(32),     /* Mutually Exclusive Input Flags   38850000
*                                                                @DEA*/ 38900000
*      6 OdmvInByteM1  Bit(8),                                 /*@DFC*/ 38950000
*       7 OdmvFILEs    Bit(1),      /* FILE operand specified        */ 39000000
*       7 OdmvASIDALLs Bit(1),      /* ASID=ALL or VSERVER specified */ 39050000
*       7 OdmvASIDs    Bit(1),      /* ASID specified and not ALL    */ 39100000
*       7 OdmvUs       Bit(1),      /* User Name specified           */ 39150000
*       7 OdmvVSERVER  Bit(1),      /* VSERVER Specified             */ 39200000
*       7 OdmvOptions  Bit(1),      /* OPTIONS specified             */ 39250000
*       7 OdmvPIDs     Bit(1),      /* PID specified                 */ 39300000
*       7 OdmvPfsBit   Bit(1),      /* PFS operand specified         */ 39350000
*      6 OdmvInByteM2  Bit(8),                                 /*@DFC*/ 39400000
*       7 OdmvCinetAll Bit(1),      /* CINET=ALL specified           */ 39450000
*       7 OdmvCinetTp  Bit(1),      /* CINET=tpname specified        */ 39500000
*       7 OdmvLimits   Bit(1),      /* LIMITS specified. Gathers @DFA*/ 39507000
*                  /* System or Process Limit Data. PID is set   @DFA*/ 39514000
*                  /* in OdmvPidParm then Process Limits are     @DFA*/ 39521000
*                  /* returned, else Sustem Limits.              @DFA*/ 39528000
*      6 OdmvInByteM3  Bit(8),                                 /*@DFC*/ 39538800
*      6 OdmvInByteM4  Bit(8),                                 /*@DFC*/ 39577600
*     5 OdmvPIDparm   Fixed(32),    /* PID valid when OdmvPIDs=On       39626590
*                                                                @P5M*/ 39636580
*     5 OdmvASIDparm   Fixed(16),   /* ASID valid when OdmvASIDs=On  */ 39650000
*     5 OdmvUparm      Char(8),     /* User name valid when OdmvUd=On*/ 39700000
*     5 OdmvCinetTpName Char(8),    /* When OdmvCinetTP, this field     39850000
*                                       holds tpname             @DEA*/ 39900000
*     5 OdmvReserved1  Char(10),    /* Reserved                  @P5C*/ 39969990
*     5 OdmvInputEnd   Char(0) Bdy(Dword);  /*End of Input Block @DEA*/ 40000000
*                                                               @SPACE; 40050000
*                                                                       40100000
*/* Output area returned by BPXEKDA                         */          40150000
*DCL                                                                    40200000
*1   ODMVOUT          BASED(OdmvOutPtr) Bdy(Dword),         /* @DEA */  40250000
* 3  OdmvVerNum        Fixed(32),   /* Version Number of Output Area    40300000
*                                                               @DEA*/  40350000
* 3  OdmvSummaryData,               /* Summary data returned on all     40400000
*                                      invocations              @DEA*/  40450000
*  5  OdmvOmvsProc     Char(8),     /* OMVS Procedure name           */ 40500000
*  5  OdmvGen01  Fixed(32),                                 /* @DEC */  40550000
*   7    OdmvGen02      Fixed(16),                                      40600000
*   7    OdmvKernelAsid Fixed(16), /* Kernel's address space    @D5A*/  40650000
*  5  OdmvParmMemList  Char(40),    /* List of OMVS Parmlib     @D5A*/  40700000
*                                   /* member suffixes (XX,YY,ZZ,..)*/  40750000
* 3  OdmvOptionsData,               /* Options data returned for        40800000
*                                      OdmvOptions               @DEA*/ 40850000
*  5  OdmvMaxProcSys   Fixed(31),   /* Max processes on system   @D5A*/ 40900000
*  5  OdmvChildMax     Fixed(31),   /* Max processes per User ID @D5A*/ 40950000
*  5  OdmvMaxFileProc  Fixed(31),   /* Max number of allocated files    41000000
*                                      for a single process      @D5A*/ 41050000
*  5  OdmvMaxFileSize  Fixed(31),   /* Max file size             @D5A*/ 41100000
*  5  OdmvMaxCPUTime   Fixed(31),   /* Max CPU time              @D5A*/ 41150000
*  5  OdmvMaxUsers     Fixed(31),   /* Max number of users on system    41200000
*                                                                @D5A*/ 41250000
*  5  OdmvMaxRtys      Fixed(31),   /* Max number of remote-terminal    41300000
*                                      sessions                  @D5A*/ 41350000
*  5  OdmvMaxPtys      Fixed(31),   /* Max number of pseudo-terminal    41400000
*                                      sessions                  @D5A*/ 41450000
*  5  OdmvMaxMMapArea  Fixed(31),   /* Max size of Memory Map Area      41500000
*                                      in PAGES                  @D5A*/ 41550000
*  5  OdmvMaxASSize    Fixed(31),   /* Max address space size    @D5A*/ 41600000
*  5  OdmvMAXThreads   Fixed(32),   /* Max # of Threads          @D5A*/ 41650000
*  5  OdmvMaxThreadTasks Fixed(32), /* Max number of tasks running      41700000
*                                      Pthreads per process      @D5A*/ 41750000
*  5  OdmvMaxCoreSize  Fixed(31),   /* Max core size             @D5A*/ 41800000
*  5  OdmvMaxShrPages  Fixed(32),   /* Maximum number of pages that     41850000
*                                      can be in a shared relationship  41900000
*                                      in the system             @D5A*/ 41950000
*  5  OdmvMaxMsgNIDs   Fixed(31),   /* Max system message queue IDs     42000000
*                                                                @D5A*/ 42050000
*  5  OdmvMaxMsgQBytes Fixed(31),   /* Max bytes per message queue      42100000
*                                                                @D5A*/ 42150000
*  5  OdmvMaxMsgQMNum  Fixed(31),   /* Max messages per queue    @D5A*/ 42200000
*  5  OdmvMaxShmNIDs   Fixed(31),   /* Max system shared memory IDs     42250000
*                                                                @D5A*/ 42300000
*  5  OdmvMaxShmSpages Fixed(31),   /* Max system shared memory         42350000
*                                      pages for all segements   @D5A*/ 42400000
*  5  OdmvMaxShmMpages Fixed(31),   /* Max shared memory pages per      42450000
*                                      segment                   @D5A*/ 42500000
*  5  OdmvMaxShmNSegs  Fixed(31),   /* Max shared memory segments       42550000
*                                      per process               @D5A*/ 42600000
*  5  OdmvMaxSemNIDs   Fixed(31),   /* Max system semaphore IDs  @D5A*/ 42650000
*  5  OdmvMaxSemNSEMS  Fixed(31),   /* Max number of semaphores per     42700000
*                                      semaphore set             @D5A*/ 42750000
*  5  OdmvMaxSemNOPS   Fixed(31),   /* Max number of operations per     42800000
*                                      BPX1SOP (SEMOP) call      @D5A*/ 42850000
*  5  OdmvSuperUser    Char(8),     /* SuperUser                 @D5A*/ 42900000
*  5  OdmvSTEPLIBLISTLen Fixed(8),  /* Length of STEPLIB name    @D5A*/ 42950000
*  5  OdmvSTEPLIBLIST    Char(255), /* Name of STEPLIB dataset   @D5A*/ 43000000
*  5  OdmvSETPPGCnt      Fixed(8),  /* Priority PG count         @D5A*/ 43050000
*  5  OdmvSETPGoalCnt    Fixed(8),  /* Priority Goal count       @D5A*/ 43100000
*  5  OdmvUSERIDTABLELen Fixed(8),  /* Length of table name      @D5A*/ 43150000
*  5  OdmvReserved02     Char(2),   /* Reserved                  @DEA*/ 43200000
*  5  OdmvUSERIDTABLE    Char(255), /* Name of Userid table      @D5A*/ 43250000
*  5  OdmvPriorityPG (40) Fixed(16), /* performance group numbers    */ 43300000
*                                    /* for compatibility mode       */ 43350000
*                                    /* 40 possible entries      @D5A*/ 43400000
*  5  OdmvReserved10     Char(4),    /* Reserved                 @P4A*/ 43425000
*  5  OdmvGen04          Char(0) Bdy(DWord), /* Ensure array on DWD  */ 43450000
*                                                              /*@DEC*/ 43500000
*  5  OdmvPriorityGoal (40) Char(8), /* service classes              */ 43550000
*                                    /* for goal mode                */ 43600000
*                                    /* 40 possible entries      @D5A*/ 43650000
*  5  Reserved09       Char(4),     /* Reserved                  @DEC*/ 43700000
*  5  OdmvTTYGroup     Char(8),     /* TTY Group name            @D8A*/ 43750000
*  5  OdmvMaxQueuedSigs Fixed(32),  /* MaxQueuedSigs from Optn   @P2A*/ 43800000
*  5  OdmvShrLibRgnSize Fixed(32),  /* ShrLibRgnSize from Optn   @DCA*/ 43850000
*  5  OdmvShrLibMaxPages Fixed(32), /* ShrLibMaxPages from Optn  @DCA*/ 43900000
*  5  OdmvVersion       Char(8),    /* OS/390 Version String     @DDA*/ 43950000
*  5  OdmvFlagWord01   Fixed(32),   /* Flag word                 @DEC*/ 44000000
*     7  OdmvForkCopy  Bit(1),      /* ON = Copy parent data to child   44050000
*                                      at the time of fork,             44100000
*                                      OFF= Use Copy-on-Write for       44150000
*                                      parent data (Default)     @D5A*/ 44200000
*     7  OdmvSyscall_counts bit(1), /* ON = counts being traced         44250000
*                                      OFF= counts not being done@D8A*/ 44300000
*     7  OdmvSysplex   Bit(1),      /* ON= IPLed sysplex = Y     @P3A*/ 44350000
*                                   /* OFF= local system         @P3A*/ 44400000
*     7  OdmvSetPExist Bit(1),      /* If SETP was created       @DEA*/ 44450000
*     7  OdmvLimMsgSys  Bit(1),     /* Level of warning messages for */ 44458000
*     7  OdmvLimMsgProc Bit(1),     /* reached limits. Can be           44466000
*                                      SYS=OFF PROC=OFF is NONE         44474000
*                                      SYS=ON  PROC=OFF is SYSTEM       44482000
*                                      SYS=ON  PROC=ON  is ALL   @DFA*/ 44490000
*3  OdmvSecondaryData,              /* Secondary Output Data     @DEA*/ 44500000
*  5  OdmvOutArraySize Fixed(32),   /* Number of entries in secondary   44550000
*                                      output data pointer array     */ 44600000
*  5  OdmvOutArrayPtr  Ptr(31),     /* Address of output data pointer   44650000
*                                      array                     @DEA*/ 44700000
*  5  OdmvThdArraySize Fixed(32),   /* Number of entries in output      44750000
*                                      thread data pointer array @DEA*/ 44800000
*  5  OdmvThdArrayPtr  Ptr(31),     /* Address of thread data pointer   44850000
*                                      array                     @DEA*/ 44900000
*  5  OdmvPFSCounts,                 /* Counts of PFS Array entries  */ 44950000
*     7 OdmvPFStypecount Fixed(31),  /*  Number of PFS 'type' entries*/ 45000000
*     7 OdmvPFSnamecount Fixed(31),  /*  Number of PFS 'name' entries*/ 45050000
*     7 OdmvPFSparmcount Fixed(31),  /*  Number of Parm entries      */ 45100000
*  5  OdmvCinetCounts,               /* Counts of CINET Array entries*/ 45150000
*     7 OdmvCinetHomeCnt Fixed(31),  /*  Number of CINET home entries*/ 45200000
*     7 OdmvCinetHostCnt Fixed(31),  /*  Number of CINET host entries*/ 45250000
*     7 OdmvCinetNetwCnt Fixed(31),  /*  Number of CINET netw entries*/ 45300000
*  5  OdmvFlagWord02   Fixed(32),   /* Flag word                 @DEA*/ 45350000
*     7  OdmvPartial  Bit(1),       /* Partial thread data       @DEA*/ 45400000
*     7  OdmvSysLimits Bit(1),      /* Sytem Limits returned     @DFA*/ 45408000
*     7  OdmvPrcLimits Bit(1),      /* Process Limits returned   @DFA*/ 45416000
*  5  OdmvBrlmSrv     Char(8),      /* ByterangelockMgr Server   @01A*/ 45425000
*  5  OdmvLimitsPtr    Ptr(31),     /* Address of limits data pointer   45428000
*                                      When OdmvSysLimits is on it      45431000
*                                      points to a structure OdmvSysL.  45434000
*                                      When OdmvPrcLimits is on it      45437000
*                                      points to a structure OdmvPrcL   45440000
*                                                                @DFA*/ 45443000
*3  OdmvReservedData,              /* Reserved Output Area for          45450000
*                                      Operating System Usage    @DEA*/ 45500000
*  5 OdmvCbGen06 Union,             /* Address of output area     */    45550000
*    7 OdmvOutputPtr VIAPOINTER,    /* For PLX it's an VIAPOINTER */    45600000
*    7 OdmvOutputALETADDR,          /* Assembler users can use this  */ 45650000
*      9 OdmvOutputALET Fixed(32),                                      45700000
*      9 OdmvOutputADDR Ptr(31),                                        45750000
*  5  OdmvStoken       Char(8),     /* Stoken of Data Space      @DEM*/ 45800000
*  5  OdmvOdca         Ptr(31),     /* Address of Odca           @DEM*/ 45850000
*  5  OdmvRetCode      Fixed(32),   /* Return Code from BPXODMVS @DEM*/ 45900000
*  5  OdmvCinetMsgNum  Fixed(31),   /*  Error Message Number     @DEA*/ 45950000
*  5  OdmvFlagWord03   Fixed(32),   /* Flag word                 @DEA*/ 46000000
*     7  OdmvCaps     Bit(1),       /* CAPS Specified on D OMVS  @DEM*/ 46050000
*  5  OdmvProtPgPtr    Ptr(31),     /* Ptr. to begin of prot. Pg.@DEA*/ 46100000
*  5  OdmvReserved03   Char(8),     /* reserved                  @DEA*/ 46169990
* 3  OdmvEnd  Char(0) Bdy(Dword);  /* End of Block                  */  46200000
*                                                                       46250000
*/********************************************************************/ 46300000
*/* Output area array returned for OdmvFiles, OdmvPIDs, OdmvVserver, */ 46350000
*/*  OdmvAsidAlls, OdmvAsids, OdmvPFSBit, OdmvCinetTp, OdmvCinetAll  */ 46400000
*/*  or OdmvUs that contains the list of pointers to the associated  */ 46450000
*/*  output areas.                                               @DEA*/ 46500000
*/********************************************************************/ 46550000
*Dcl                                                                    46600000
* 1 OdmvOutArray(*)  BASED(OdmvOutArrayPtr) Bdy(word),        /* @DEA*/ 46650000
*   3 OdmvOutArrayElemPtr Ptr(31);                                      46700000
*                                                                       46750000
*/********************************************************************/ 46800000
*/* Output area array returned for OdmvPIDs for the list of pointers */ 46850000
*/*  to the thread data areas for the returned process           @DEA*/ 46900000
*/********************************************************************/ 46950000
*Dcl                                                                    47000000
* 1 OdmvThdArray(*)  BASED(OdmvThdArrayPtr) Bdy(word),        /* @DEA*/ 47050000
*   3 OdmvThdArrayElemPtr Ptr(31);                                      47100000
*                                                                       47150000
*/********************************************************************/ 47200000
*/* Mapping of file data returned for OdmvFiles                  @DEA*/ 47250000
*/********************************************************************/ 47300000
*Dcl                                                                    47350000
*  1 OdmvFILE Based Bdy(Word),                               /*  @DEC*/ 47400000
*    3 OdmvDevice   Fixed(32),                                          47450000
*    3 OdmvTYPENAME CHAR(8),                                            47500000
*    3 OdmvSTATUS   Fixed(32),      /* Status matches MSG BPXO45Ie   */ 47550000
*                                   /* 1= FORCE UNMOUNT              */ 47600000
*                                   /* 2= DRAIN UNMOUNT              */ 47650000
*                                   /* 3= IMMEDIATE UNMOUNT          */ 47700000
*                                   /* 4= NORMAL UNMOUNT             */ 47750000
*                                   /* 5= RESET UNMOUNT              */ 47800000
*                                   /* 6= IMMEDIATE UNMOUNT ATTEMPTED*/ 47850000
*                                   /* 7= ACTIVE                     */ 47900000
*                                   /* 8= QUIESCED                   */ 47950000
*                                   /* 9= NOT ACTIVE                 */ 48000000
*                                   /* 10= MOUNT IN PROGRESS         */ 48050000
*                                   /* 11= ASYNCH MOUNT IN PROGRESS  */ 48100000
*                                   /* 12= IN RECOVERY           @D9A*/ 48150000
*                                   /* 13= UNOWNED               @D9A*/ 48200000
*    3 OdmvQJobName CHAR(8),        /* Quiesce Job Name              */ 48250000
*                                                                       48300000
*    3 OdmvQPID     Fixed(32),      /* Quiesce Process ID            */ 48350000
*    3 OdmvMountMode Fixed(32),     /* Mount mode for filesystem @P1A*/ 48400000
*    3 OdmvFsNAME   Char(44),       /* File System name for PDSE/X   */ 48450000
*    3 OdmvPATH     Char(63),       /* Path or Directory name converted 48500000
*                                      to upper case characters      */ 48550000
*    3 OdmvMountParm Char(57),      /* Mount parm truncated and         48600000
*                                      optionally converted to upper    48650000
*                                      case                      @D4A*/ 48700000
*    3 OdmvFSOwner   Char(8),       /* FS Owner name             @D9A*/ 48750000
*    3 OdmvFSNoAutoMove Fixed(32),  /* FS is NOT AUTOMOVEalbe    @D9A*/ 48800000
*    3 OdmvQSystem Char(8),         /* Quiesce system            @D9A*/ 48850000
*    3 OdmvFSClient  Fixed(32);     /* 1 = Yes is a client       @D9A*/ 48900000
*                                   /* 2 = No is not a client    @D9A*/ 48950000
*                                                                       49000000
*/********************************************************************/ 49050000
*/* Mapping of process data returned for OdmvPids, OdmvAsidAlls,     */ 49100000
*/*   OdmvAsids                                                  @MGS*/ 49150000
*/********************************************************************/ 49200000
*Dcl                                                                    49250000
*  1 OdmvPROCESS Based Bdy(Word),                             /* @DEC*/ 49300000
*    3 OdmvJobName Char(8),         /* Job name from ASCBJBNI or        49350000
*                                      ASCBJBNS                      */ 49400000
*    3 OdmvUser    Char(8),         /* User Name from OasbLoginName  */ 49450000
*    3 OdmvPID     Fixed(32),       /* Process ID                    */ 49500000
*    3 OdmvPPID    Fixed(32),       /* Parent's Process ID           */ 49550000
*    3 OdmvASID    Fixed(16),       /* Address space ID or zero for     49600000
*                                      zombie state                  */ 49650000
*    3 OdmvReserved04 Char(5),      /* Reserved                  @P4C*/ 49700000
*    3 OdmvStartYD   Char(7),       /* Local Start Time YYYYDDD      */ 49750000
*      5 OdmvStYY  Char(4),         /* Start Time Year               */ 49800000
*      5 OdmvStDD  Char(3),         /* Start Time Day of year (1-366)*/ 49850000
*    3 OdmvStart   Char(6),         /* Start Time hhmmss             */ 49900000
*      5 OdmvStHH    Char(2),       /* Start Time hours              */ 49950000
*      5 OdmvStMM    Char(2),       /* Start Time minutes            */ 50000000
*      5 OdmvStSS    Char(2),       /* Start Time seconds            */ 50050000
*    3 OdmvCT      Char(8),         /* Process system and user compute  50100000
*                                      time                          */ 50150000
*    3 OdmvCState  Bit(32),         /* Process state                 */ 50200000
*     4  OdmvStatus1 BIT(8),        /* MVS status                    */ 50250000
*      5 OdmvSwap      BIT(1),      /* Swapped out                   */ 50300000
*      5 OdmvWaitP     BIT(1),      /* Ptrace Kernel Wait            */ 50350000
*     4  OdmvStatus2 BIT(8),        /* Process status                */ 50400000
*      5 OdmvStopped   BIT(1),      /* Stopped process               */ 50450000
*      5 OdmvGen05     BIT(1),      /*                               */ 50500000
*      5 OdmvMulThread BIT(1),      /* 0=One OpenMVS active task     */ 50550000
*      5 OdmvPthread   BIT(1),      /* 0=No pthread task in process  */ 50600000
*     4  OdmvStatus3 CHAR(1),       /* State of reported task - with    50650000
*            PgpsPthread=0 the most recent created thread,              50700000
*            PgpsPthread=1 the initial pthread task (IPT)        @D1C*/ 50750000
*     4  OdmvReserved05 BIT(8),        /* Reserved              */      50800000
*   3 OdmvLatchWaitPID Fixed(32) Bdy(Word),   /* Latch Process ID the   50850000
*                         process is waiting for (Zero=not waiting)*/   50900000
*   3 OdmvGeneralFlags   Bit(32),  /* General flags       @D2A */       50950000
*     5 OdmvServer        Bit(1),   /* OdmvServerInfo data is valid */  51000000
*   3 OdmvServerInfo,              /* Server Information @D2A       */  51050000
*     5 OdmvServerName    Char(32), /* SabServerName   SERVER=       */ 51100000
*     5 OdmvActiveFiles   Fixed(32),/* SabVDECount     AF=           */ 51150000
*     5 OdmvMaxFiles      Fixed(32),/* SabMaxFiles     MF=           */ 51200000
*     5 OdmvServerType    Fixed(32),/* SabServerType   TYPE=         */ 51250000
*                                   /* See NRegSType information     */ 51270000
*                                   /* in BPXYNREG for definition of */ 51290000
*                                   /* Server Types.                 */ 51310000
*   3 OdmvCMD      Char(40),        /* Command String buffer         */ 51334990
*   3 OdmvRUid    Fixed(32),        /* Process Real User Id          */ 51339980
*   3 OdmvEUid    Fixed(32);        /* Process Effective User Id     */ 51344970
*/********************************************************************/ 51350000
*/* Mapping of threads data returned for OdmvPids                @DEC*/ 51400000
*/********************************************************************/ 51450000
*Dcl                                                                    51500000
*  1 OdmvThreads Based Bdy(Word),   /* Thread info               @DEC*/ 51550000
*    3 OdmvThdID Char(8) Bdy(Word), /* Thread ID                 @D6A*/ 51600000
*    3 OdmvThdTcb   Ptr(31),        /* TCB address               @D6A*/ 51650000
*    3 OdmvThdJobName  Char(8),     /* Primary Address space job        51700000
*                                      name, if primary ^= home,        51750000
*                                      otherwise blanks          @D6A*/ 51800000
*    3 OdmvThdUserName Char(8),     /* User name if a task level        51850000
*                                      security environment created by  51900000
*                                      pthread_security_np exists,      51950000
*                                      otherwise blanks          @D6A*/ 52000000
*    3 OdmvThdSysCall Fixed(32),    /* Syscall code              @D6A*/ 52050000
*    3 OdmvThdTTime Bit(64),        /* TCB's accumulated CPU time       52100000
*                                                                @D6A*/ 52150000
*    3 OdmvThdTag   Char(65),       /* Tag data                  @D6A*/ 52200000
*    3 OdmvThdStatus1 Char(1),      /* Pthread created/Dubbed    @D6A*/ 52250000
*    3 OdmvThdStatus2 Char(1),      /* Wait/Running status       @D6A*/ 52300000
*    3 OdmvThdStatus3 Char(1),      /* Creation type             @D6A*/ 52350000
*    3 OdmvThdStatus4 Char(1),      /* Detached/undetached       @D6A*/ 52400000
*    3 OdmvThdStatus5 Char(1),      /* Ptrace held               @D6A*/ 52450000
*    3 OdmvThdFlags   Bit(8),       /* Thread flags              @D6A*/ 52500000
*      5 OdmvThdTagSet Bit(1),      /* Thread has tag data       @D6A*/ 52550000
*    3 OdmvReserved06 Char(1),      /* Reserved                  @D6A*/ 52600000
*    3 OdmvThdBrl,                  /* Byte Range Lock Waiter Data   */ 52603800
*                                   /* valid for OdmvBrl only    @DHA*/ 52610590
*      5 OdmvThdBrlDevNo Fixed(32), /* Dev # of BRL Wait File    @DHA*/ 52613580
*      5 OdmvThdBrlINo   Fixed(32), /* Inode # of BRL Wait File  @DHA*/ 52616570
*      5 OdmvThdBrlOwnerPid Fixed(32), /* BRL Wait FileOwner PID @DHA*/ 52619560
*      5 OdmvThdBrlFile  Char(16),  /* BRL Wait File Name        @DHA*/ 52622550
*                                                              /*@DHA*/ 52625540
*    3 OdmvReservedData2,   /* For BRLM usage only               @DHA*/ 52628530
*                                                                       52638000
*      5 OdmvThdBrlOfte  Ptr(31), /* For use in frbrl getlk call @DHA*/ 52642790
*      5 OdmvThdBrlVnod  Ptr(31), /* For use in frbrl getlk call @DHA*/ 52643780
*      5 OdmvThdBrlProcessToken Char(8),                       /*@DHA*/ 52644770
*      5 OdmvThdBrlThreadID Char(8),                           /*@DHA*/ 52645760
*      5 OdmvThdBrlReserveData char(8),                        /*@DHA*/ 52646750
*                                        /* possible size change @DHA*/ 52647740
*                                                                       52648730
*    3 OdmvThdEnd   Char(0);        /* End of thread info        @D6A*/ 52650000
*                                                                       52700000
*/********************************************************************/ 52750000
*/*  Mapping of PFS data returned for OdmvPfsBit.                @DEC*/ 52800000
*/********************************************************************/ 52850000
*Declare                                                                52900000
*  1 OdmvPFS    Based Bdy(Word),                              /* @DEC*/ 52950000
*    3 OdmvPFSchars,                 /*  EBCDIC data                 */ 53000000
*     5 OdmvPFSName Char(8),         /*   PFS name|type from the GFS */ 53069990
*     5 OdmvPFSdescription Char(20), /*   Brief description of PFS   */ 53100000
*      7 OdmvPFSsocket Char(8),      /*    if socket, the word SOCKET*/ 53150000
*      7 OdmvPFSvfs    Char(12),     /*    if socket, AF_INET, etc.  */ 53200000
*     5 OdmvPFSentry Char(8),        /*   EntryPoint name            */ 53250000
*     5 OdmvPFSstatus Char(5),       /*   Status                     */ 53300000
*     5 OdmvPFSflags  Char(3),       /*   Flags                      */ 53350000
*     5 OdmvPFSParms  Char(165),     /*   Parameter data             */ 53400000
*      7 OdmvPFSBlank Char(1),       /*    a blank - special for HFS */ 53450000
*      7 OdmvGen07    Char(164),     /*                              */ 53500000
*     5 OdmvReserved07 Char(3),       /*  Reserved                   */ 53550000
*    3 OdmvPFSnums,                  /*  NUMERIC data                */ 53600000
*     5 OdmvPFSMaxSock Fixed(32),    /*   MAXSOCKETS                 */ 53650000
*     5 OdmvPFSOpnSock Fixed(32),    /*   Open Sockets               */ 53700000
*     5 OdmvPFSHWMSock Fixed(32),    /*   Highwater mark         @DGA*/ 53725000
*     5 OdmvPFSParmLen Fixed(32),    /*   The length of OdmvPFSparms */ 53750000
*     5 OdmvPFSCurrentValues,        /*   Data for CURRENT VALUES    */ 53800000
*       7 OdmvPFSfixed   Fixed(32),  /*    FIXED                     */ 53850000
*       7 OdmvPFSvirtual Fixed(32);  /*    VIRTUAL                   */ 53900000
*                                                                       53900200
*/********************************************************************/ 53900400
*/*  Mapping of System Limit Data - Highwater and Current Usage  @DFA*/ 53900600
*/********************************************************************/ 53900800
*Declare                                                                53901000
*  1 OdmvSysL Based Bdy(Word),                              /* @DFA  */ 53901200
*     3 OdmvSysLFChanged     Bit(32),   /* Flag field for changed    */ 53901400
*                                       /* System limits             */ 53901600
*      4 OdmvSysLFByte1        Bit(8),                                  53901800
*       5 OdmvSysLFMaxProcSys  Bit(1),  /* MaxProcSys changed        */ 53902000
*       5 OdmvSysLFMaxUids     Bit(1),  /* MaxUids changed           */ 53902200
*       5 OdmvSysLFMaxPtys     Bit(1),  /* MaxPtys changed           */ 53902400
*       5 OdmvSysLFMaxMmapArea Bit(1),  /* MaxMmapArea changed       */ 53902600
*       5 OdmvSysLFMaxShrPages Bit(1),  /* MaxShrPages changed       */ 53902800
*       5 OdmvSysLFIpcMsgNids  Bit(1),  /* IpcMsgNids  changed       */ 53903000
*       5 OdmvSysLFIpcSemNids  Bit(1),  /* IpcSemNids  changed       */ 53903200
*       5 OdmvSysLFIpcShmNids  Bit(1),  /* IpcShmNids  changed       */ 53903400
*      4 OdmvSysLFByte2        Bit(8),                                  53903600
*       5 OdmvSysLFIpcShmSPages Bit(1), /* IpcShmSPages changed      */ 53903800
*       5 OdmvSysLFIpcMsgQBytes Bit(1),                                 53904000
*       5 OdmvSysLFIpcMsgQMNum  Bit(1),                                 53904200
*       5 OdmvSysLFIpcShmMPages Bit(1),                                 53904400
*       5 OdmvSysLFShrLibRgnSize Bit(1),/* ShrLibRgnSize changed     */ 53904600
*       5 OdmvSysLFShrLibMaxPages Bit(1),/* ShrLibMaxPages changed   */ 53904800
*      4 OdmvSysLFByte3        Bit(8),                                  53905000
*      4 OdmvSysLFByte4        Bit(8),                                  53905200
*     3 OdmvSysLMaxProcSysC  Fixed(32), /* Current # of processes    */ 53905400
*     3 OdmvSysLMaxProcSysH  Fixed(32), /* Highwater # of processes  */ 53905600
*     3 OdmvSysLMaxUidsC     Fixed(32), /* Current # of userids      */ 53905800
*     3 OdmvSysLMaxUidsH     Fixed(32), /* Highwater # of userids    */ 53906000
*     3 OdmvSysLMaxPtysC     Fixed(32), /* Current # of ptys in use  */ 53906200
*     3 OdmvSysLMaxPtysH     Fixed(32), /* Highwater # of ptys in use*/ 53906400
*     3 OdmvSysLMaxMmapAreaC Fixed(32), /* Current # of mmap pages   */ 53906600
*     3 OdmvSysLMaxMmapAreaH Fixed(32), /* Highwater # of mmap pages */ 53906800
*     3 OdmvSysLMaxShrPagesC Fixed(32), /* Current # of shared pages */ 53907000
*     3 OdmvSysLMaxShrPagesH Fixed(32), /* Highwater # of shared pages  53907200
*                                                                    */ 53907400
*     3 OdmvSysLIpcMsgNidsC  Fixed(32), /* Current # of message queue   53907600
*                                          IDs in use                */ 53907800
*     3 OdmvSysLIpcMsgNidsH  Fixed(32), /* Highwater # of message queue 53908000
*                                          IDs in use                */ 53908200
*     3 OdmvSysLIpcSemNidsC  Fixed(32), /* Current # of semaphore       53908400
*                                          IDs in use                */ 53908600
*     3 OdmvSysLIpcSemNidsH  Fixed(32), /* Highwater # of semaphore     53908800
*                                          IDs in use                */ 53909000
*     3 OdmvSysLIpcShmNidsC  Fixed(32), /* Current # of shared memory   53909200
*                                          IDs in use                */ 53909400
*     3 OdmvSysLIpcShmNidsH  Fixed(32), /* Highwater # of shared memory 53909600
*                                          IDs in use                */ 53909800
*     3 OdmvSysLIpcShmSPagesC Fixed(32),/* Current # of shared memory   53910000
*                                          pages in use              */ 53910200
*     3 OdmvSysLIpcShmSPagesH Fixed(32),/* Highwater # of shared memory 53910400
*                                          pages in use              */ 53910600
*     3 OdmvSysLIpcMsgQBytesH Fixed(32),/* Highwater # of bytes used in 53910800
*                                          a msg queue for process   */ 53911000
*     3 OdmvSysLIpcMsgQBytesM Fixed(32),/* Maximum # of bytes allowed   53911200
*                                          in a msg queue for process*/ 53911400
*                                                                       53911600
*     3 OdmvSysLIpcMsgQMNumH  Fixed(32),/* Highwater # of msgs used in  53911800
*                                          a msg queue for process   */ 53912000
*     3 OdmvSysLIpcMsgQMNumM  Fixed(32),/* Maximum # of msgs allowed    53912200
*                                          in a msg queue for process*/ 53912400
*     3 OdmvSysLIpcShmMPagesH Fixed(32),/* Highwater # of shr mem pages 53912600
*                                          in a segment for process  */ 53912800
*     3 OdmvSysLIpcShmMPagesM Fixed(32),/* Maximum # of shr mem pages   53913000
*                                     allowed in segment for process */ 53913200
*     3 OdmvSysLShrLibRgnSizeC Fixed(32),/* Current usage of system     53913400
*                                          shared library region     */ 53913600
*     3 OdmvSysLShrLibRgnSizeH Fixed(32),/* Highwater usage of system   53913800
*                                          shared library region     */ 53914000
*     3 OdmvSysLShrLibMaxPagesC Fixed(32),/* Current # of pages of user 53914200
*                                          shared library region     */ 53914400
*     3 OdmvSysLShrLibMaxPagesH Fixed(32);/* Highwater # of pages of    53914600
*                                          user shared library pgms  */ 53914800
*                                                                       53915000
*                                                                       53915200
*/********************************************************************/ 53915400
*/*  Mapping of Process Limit Data -                             @DFA*/ 53915600
*/*           Highwater, Maximum  and Current Usage              @DFA*/ 53915800
*/*                                                              @DFA*/ 53916000
*/* RESERVED field will not be filled with valid data!           @DFA*/ 53916200
*/********************************************************************/ 53916400
*Declare                                                                53916600
*  1 OdmvPrcL Based Bdy(Word),                                 /*@DFA*/ 53916800
*     3 OdmvPrcLFChanged     Bit(32),   /* Flag field for changed    */ 53917000
*                                       /* process limits            */ 53917200
*      4 OdmvPrcLFByte1        Bit(8),                                  53917400
*       5 OdmvPrcLFMaxAsSize   Bit(1),  /* RESERVED MaxAsSize changed*/ 53917600
*       5 OdmvPrcLFMaxCpu      Bit(1),  /* RESERVED MaxCpu    changed*/ 53917800
*       5 OdmvPrcLFMaxFileProc Bit(1),  /* MaxFileProc changed       */ 53918000
*       5 OdmvPrcLFMaxProcUser Bit(1),  /* MaxProcUser changed       */ 53918200
*       5 OdmvPrcLFMaxQueuedSigs Bit(1),/* MaxQueuedSigs changed     */ 53918400
*       5 OdmvPrcLFMaxThreads    Bit(1),/* MaxThreads changed        */ 53918600
*       5 OdmvPrcLFMaxThreadTasks Bit(1),/* MaxThreadTasks changed   */ 53918800
*       5 OdmvPrcLFIpcShmNSegs  Bit(1), /* IpcShmNSegs  changed      */ 53919000
*      4 OdmvPrcLFByte2         Bit(8),                                 53919200
*       5 OdmvPrcLFMaxCoreSize  Bit(1), /* MaxCoreSize changed       */ 53919400
*       5 OdmvPrcLFMaxFileSize  Bit(1), /* MaxFileSize changed       */ 53919600
*      4 OdmvPrcLFByte3         Bit(8),                                 53919800
*      4 OdmvPrcLFByte4         Bit(8),                                 53920000
*                                                                       53920200
*     3 OdmvPrcLMaxAsSizeC   Fixed(32), /* RESERVED Current user region 53920400
*                                          usage for address space   */ 53920600
*     3 OdmvPrcLMaxAsSizeH   Fixed(32), /* RESERVED Highw. user region  53920800
*                                          usage for address space   */ 53921000
*     3 OdmvPrcLMaxAsSizeM   Fixed(32), /* RESERVED Max. user region    53921200
*                                          size for address space    */ 53921400
*                                                                       53921600
*     3 OdmvPrcLMaxCpuC      Fixed(32), /* RESERVED Current CPU usage   53921800
*                                          for address space         */ 53922000
*     3 OdmvPrcLMaxCpuH      Fixed(32), /* RESERVED Highwater CPU usage 53922200
*                                          for address space         */ 53922400
*     3 OdmvPrcLMaxCpuM      Fixed(32), /* RESERVED Max. CPU usage      53922600
*                                          for address space         */ 53922800
*                                                                       53923000
*     3 OdmvPrcLMaxFileProcC Fixed(32), /* Current # of files in use    53923200
*                                          for process               */ 53923400
*     3 OdmvPrcLMaxFileProcH Fixed(32), /* Highwater # of files in use  53923600
*                                          for process               */ 53923800
*     3 OdmvPrcLMaxFileProcMSL Fixed(32), /* Maximum # of files         53924000
*                                          allowed for process       */ 53924200
*     3 OdmvPrcLMaxFileProcMHL Fixed(32), /* Maximum # of files         53924400
*                                          allowed for process       */ 53924600
*                                                                       53924800
*     3 OdmvPrcLMaxFileSizeMSL Fixed(31), /* Maximum size of files      53925000
*                                          allowed for process       */ 53925200
*     3 OdmvPrcLMaxFileSizeMHL Fixed(31), /* Maximum size of files      53925400
*                                          allowed for process       */ 53925600
*                                                                       53925800
*     3 OdmvPrcLMaxProcUserC Fixed(32), /* Current # of processes for   53926000
*                                          user                      */ 53926200
*     3 OdmvPrcLMaxProcUserH Fixed(32), /* Highwater # of processes for 53926400
*                                          user                      */ 53926600
*     3 OdmvPrcLMaxProcUserM Fixed(32), /* Maximum # of processes       53926800
*                                          allowed for user          */ 53927000
*                                                                       53927200
*     3 OdmvPrcLMaxQueuedSigsC Fixed(32),/* Current # of queued signals 53927400
*                                          for process               */ 53927600
*     3 OdmvPrcLMaxQueuedSigsH Fixed(32),/* Highwater # of queued sigs  53927800
*                                          for process               */ 53928000
*     3 OdmvPrcLMaxQueuedSigsM Fixed(32),/* Current # of queued signals 53928200
*                                          for process               */ 53928400
*                                                                       53928600
*     3 OdmvPrcLMaxThreadsC  Fixed(32), /* Current # of threads         53928800
*                                          for process               */ 53929000
*     3 OdmvPrcLMaxThreadsH  Fixed(32), /* Highwater # of threads       53929200
*                                          for process               */ 53929400
*     3 OdmvPrcLMaxThreadsM  Fixed(32), /* Maximum # of threads         53929600
*                                          for process */               53929800
*     3 OdmvPrcLMaxThreadTasksC  Fixed(32), /* Current # of thd tasks   53930000
*                                          for process               */ 53930200
*     3 OdmvPrcLMaxThreadTasksH  Fixed(32), /* Highwater # of thd tasks 53930400
*                                          for process               */ 53930600
*     3 OdmvPrcLMaxThreadTasksM  Fixed(32), /* Maximum # of thd tasks   53930800
*                                          for process               */ 53931000
*     3 OdmvPrcLIpcShmNSegsC  Fixed(32),/* Current # of shr mem allowed 53931200
*                                          segments in a process  */    53931400
*     3 OdmvPrcLIpcShmNSegsH  Fixed(32),/* Highwater shr mem allowed    53931600
*                                          segments in a process */     53931800
*     3 OdmvPrcLIpcShmNSegsM  Fixed(32),/* Maximum # of shr mem allowed 53932000
*                                          segments in a process */     53932200
*                                                                       53932400
*                                                                       53932600
*     3 OdmvPrcLMaxCoreSizeMSL Fixed(31),/* Max Size core dumps SOFT */ 53932800
*     3 OdmvPrcLMaxCoreSizeMHL Fixed(31);/* Max Size core dumps HARD */ 53933000
*                                                                       53933200
*                                                                       53950000
*/********************************************************************/ 54000000
*/* Declare Constants for the PFS output data:                       */ 54050000
*/********************************************************************/ 54100000
*Declare                                                                54150000
*  OdmvPfs#hfs   Constant('HFS     ') Char(8);                /* @DAA*/ 54200000
*                                                                       54250000
*/********************************************************************/ 54300000
*/*  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  */ 54350000
*/********************************************************************/ 54400000
*Declare                                                                54450000
*  1 OdmvCinet  Based Bdy(Word),                            /* 12@DBA*/ 54500000
*     3 OdmvCinetETpName Char(8),    /*  Tp name                     */ 54550000
*     3 OdmvCinetHome@  Char(12),    /*  Home IP address in EBCDIC   */ 54600000
*     3 OdmvCinetHost@  Char(12),    /*  Host IP address in EBCDIC   */ 54650000
*     3 OdmvCinetNetw@  Char(12),    /*  Net  IP address in EBCDIC   */ 54700000
*     3 OdmvCinetMask   Char(12),    /*  Net Mask in EBCDIC          */ 54750000
*     3 OdmvCinetMetric Fixed(32),   /*  Metric                      */ 54800000
*     3 OdmvCinetFlags  Char(3)  ,   /*  Flags                       */ 54850000
*     3 OdmvReserved08  Char(1)  ;   /*  Reserved                    */ 54900000
*                                                                       54950000
*/********************************************************************/ 55000000
*/*  For convenience a Ptr to parse through the OutArrays       @DEA */ 55050000
*/********************************************************************/ 55100000
*Dcl OdmvArrayElement Ptr(31) Based;  /*A based pointer for arrays      55150000
*                                                                @DEA*/ 55200000
*                                                                       55250000
*/********************************************************************/ 55300000
*/*VersionNumber values are defined here                        @DEA */ 55350000
*/********************************************************************/ 55400000
*Dcl                                                                    55450000
*  OdmvVer#One  Fixed(32)           /* Version 1.0 Constant     @DEA */ 55500000
*                   Constant(00000010x),                                55525000
*  OdmvVer#OneOne Fixed(32)         /* Version 1.1 Constant     @DFA */ 55559990
*                   Constant(00000011x),                                55569980
*  OdmvVer#OneTwo Fixed(32)         /* Version 1.2 Constant     @DFA */ 55579970
*                   Constant(00000012x);                                55589960
*                                                                       55600000
*/********************************************************************/ 55650000
*/* Return Code values are defined here                         @DEA */ 55700000
*/********************************************************************/ 55750000
*Dcl                                                                    55800000
*  OdmvSuccess  Fixed(32) Constant(0),   /* Execution successful @DEA*/ 55850000
*  OdmvNOTFOUND Fixed(32) Constant(4),   /* ASID or UID not found@DEA*/ 55900000
*  OdmvFSGMNerror Fixed(32) Constant(8), /* Error calling FSGMN  @DEA*/ 55950000
*  OdmvBuffer   Fixed(32) Constant(12),  /* Buffer to small      @DEA*/ 56000000
*  OdmvFlags    Fixed(32) Constant(16),  /* Input flags invalid  @DEA*/ 56050000
*  OdmvAuth     Fixed(32) Constant(20),  /* Wrong authority      @DEA*/ 56100000
*  OdmvInvPtr   Fixed(32) Constant(24);  /* Ptr. to ODMVOUT zero @DEA*/ 56150000
*                                                                       56157000
*/********************************************************************/ 56164000
*/* OdmvPrcLimits/OdmvSystemLimits constant defined here         @DFA*/ 56171000
*/********************************************************************/ 56178000
*Dcl                                                                    56185000
* Odmv#Unlimited Bit(32)  Constant('FFFFFFFF'X);               /*@DFA*/ 56192000
*                                                                       56200000
*/********************************************************************/ 56250000
*/* OdmvStatus/OdmvThdStatus constants are defined here          @DEA*/ 56300000
*/********************************************************************/ 56350000
*                                                                       56400000
*   /************************************************/                  56450000
*   /* Constants for OdmvStatus3                    */                  56500000
*   /************************************************/                  56550000
*Dcl                                                                    56600000
* OdmvZombie   CHAR(1) CONSTANT('Z'), /*Process terminated and parent   56650000
*                                       has not complete wait        */ 56700000
* OdmvZombie2  CHAR(1) CONSTANT('L'), /* Process terminated and         56750000
*                                        still session or process       56800000
*                                        group leader            @D3A*/ 56850000
* OdmvQuiesceT CHAR(1) CONSTANT('Q'); /* Quiese termination wait @D3A*/ 56900000
*                                                                       56950000
*   /************************************************/                  57000000
*   /* Constants for OdmvStatus3 and OdmvThdStatus2 */                  57050000
*   /************************************************/                  57100000
*Dcl                                                                    57150000
* OdmvMsgrcv   CHAR(1) CONSTANT('A'), /*IPC msgrcv wait          @D3A*/ 57200000
* OdmvMsgsnd   CHAR(1) CONSTANT('B'), /*IPC msgsnd wait          @D3A*/ 57250000
* OdmvWaitC    CHAR(1) CONSTANT('C'), /*Comm KernelWait          @D1A*/ 57300000
* OdmvSemop    CHAR(1) CONSTANT('D'), /*IPC semop wait           @D3A*/ 57350000
* OdmvWaitF    CHAR(1) CONSTANT('F'), /*File System Kernel Wait  @D1A*/ 57400000
* OdmvMVSPause CHAR(1) CONSTANT('G'), /*MVSPause                 @D3A*/ 57450000
* OdmvRun      CHAR(1) CONSTANT('R'), /*Not kernel wait          @D1A*/ 57500000
* OdmvSleep    CHAR(1) CONSTANT('S'), /*sleep() issued           @D1A*/ 57550000
* OdmvBRL      CHAR(1) CONSTANT('T'), /*Byte Range Lock WaiT     @DGA*/ 57575000
* OdmvFork     CHAR(1) CONSTANT('X'), /*fork new process         @D1A*/ 57600000
* OdmvChild    CHAR(1) CONSTANT('W'); /*Waiting for child        @D1A*/ 57650000
*                                                                       57700000
*   /************************************************/                  57750000
*   /* Constants for OdmvStatus3 and OdmvThdStatus5 */                  57800000
*   /************************************************/                  57850000
*Dcl                                                                    57900000
* OdmvFreeze   CHAR(1) CONSTANT('E'); /*Quiesce Freeze           @D3A*/ 57950000
*                                                                       58000000
*   /************************************************/                  58050000
*   /* Constants for OdmvThdStatus1                 */                  58100000
*   /************************************************/                  58150000
*Dcl                                                                    58200000
* OdmvPthdCreated CHAR(1) CONSTANT('J'); /*Pthread created       @D6A*/ 58250000
*                                                                       58300000
*   /************************************************/                  58350000
*   /* Constants for OdmvThdStatus2                 */                  58400000
*   /************************************************/                  58450000
*Dcl                                                                    58500000
* OdmvMVSWait  Char(1) CONSTANT('Y'); /*MVS wait                 @D6A*/ 58550000
*                                                                       58600000
*   /************************************************/                  58650000
*   /* Constants for OdmvThdStatus3                 */                  58700000
*   /************************************************/                  58750000
*Dcl                                                                    58800000
* OdmvMediumWght  CHAR(1) CONSTANT('N'), /*Medium weight thread  @D6A*/ 58850000
* OdmvAsynch   CHAR(1) CONSTANT('O'), /*Asynchronous thread      @D6A*/ 58900000
* OdmvIPT      CHAR(1) CONSTANT('U'); /*Initial process thread   @D6A*/ 58950000
*                                                                       59000000
*   /************************************************/                  59050000
*   /* Constants for OdmvThdStatus4                 */                  59100000
*   /************************************************/                  59150000
*Dcl                                                                    59200000
* OdmvDetached CHAR(1) CONSTANT('V'); /*Thread is detached       @D6A*/ 59250000
*                                                                       59300000
*   /************************************************/                  59350000
*   /* Constants for OdmvThdStatus5                 */                  59400000
*   /************************************************/                  59450000
*Dcl                                                                    59500000
* OdmvPtrace   CHAR(1) CONSTANT('P'); /* Ptrace kernel wait      @D3A*/ 59550000
*                                                                       59600000
*   /*****************************************************/             59650000
*   /* Following constant are not returned by            */             59700000
*   /* BPXEKDA. See remarks how to get those information */             59750000
*   /*****************************************************/             59800000
*Dcl                                                                    59850000
*           /*******************************/                           59900000
*           /* OdmvPthread=Off    AND  @DEA*/                           59950000
*           /* OdmvMulThread=Off       @DEA*/                           60000000
*           /*******************************/                           60050000
* OdmvOneTask  CHAR(1) CONSTANT('1'), /*Only one dubbed task     @D3A*/ 60100000
*           /*******************************/                           60150000
*           /* OdmvMulThread=On        @DEA*/                           60200000
*           /*******************************/                           60250000
* OdmvMultThds CHAR(1) CONSTANT('M'), /* Multiple threads which were    60300000
*                                        NOT pthread_create()'ed and    60350000
*                                        has not issued a wait   @D3C*/ 60400000
*           /*******************************/                           60450000
*           /* OdmvPthread=On          @DEA*/                           60500000
*           /*******************************/                           60550000
* OdmvPthreads CHAR(1) CONSTANT('H'), /* Multiple threads exist.  Some  60600000
*                                      created by pthread_create @D3A*/ 60650000
*           /*******************************/                           60700000
*           /* OdmvStopped=On          @DEA*/                           60750000
*           /*******************************/                           60800000
* OdmvStopSt   CHAR(1) CONSTANT('T'), /*stopped                  @D3A*/ 60850000
*           /*******************************/                           60900000
*           /* OdmvSwap=On             @DEA*/                           60950000
*           /*******************************/                           61000000
* OdmvSwapped  CHAR(1) CONSTANT('I'); /*Swapped out              @D3A*/ 61050000
*                                                                       61100000
*   /*******************************************/                       61150000
*   /* Reserved Constants                 @DEA */                       61200000
*   /*******************************************/                       61250000
*Dcl                                                                    61300000
* OdmvWaitO    CHAR(1) CONSTANT('K'); /*Other Kernel Wait        @D1A*/ 61350000
*                                                                       61400000
*@LOGIC;                                                                61450000
*#PRAGMA TOOL=CBGEN.                                                    61500000
*#USEORG.                                                               61550000
*#DELETE.OdmvOutputPtr                                                  61600000
*#EPRAGMA.                                                              61650000
*@ENDLOGIC;                                                             61700000
*/* End of PL/X Source                                               */ 61750000
* %IF BPXZODMV_LIST ^= 'NO' &                                           61800000
*    ZCBPRINT ^= 'NO' %THEN                                             61850000
*   %GOTO BPXZODMV_4;                                                   61900000
*   @LIST POP NOECHO;                                                   61950000
* %BPXZODMV_4:;                                                         62000000
* %END;                                                                 62050000
