*                                                                       00050000
* %DCL BPXZOTCB_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE BPXZOTCB_INCLUDED;                                        00150000
* %IF BPXZOTCB_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 00333. CBGEN compile date 00290         */ 00319990
*% /*                                                                   00350000
         MACRO                                                          00400000
         BPXZOTCB &DSECT=YES,&LIST=YES,&TITLE=YES,&OTCB=YES,           *00433300
               &OTCBCOPYONFORK=COND,&OTCBRACGIDS=COND                   00466600
         GBLC  &BPXZOTCB_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&BPXZOTCB_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00616600
         AIF   ('&TITLE' EQ 'NO').P5                                    00633200
 TITLE   'BPXZOTCB  - OpenMVS extension of the TCB                    '*00650000
                                                                        00700000
.P5      ANOP                                                           00725000
**/ BPXZOTCB_1:;                                                        00750000
*/****START OF SPECIFICATIONS****************************************** 00800000
*    $MAC (BPXZOTCB) COMP(SCPX1) PROD(BPX):                             00900000
*01* MACRO NAME: BPXZOTCB                                               01000000
*01* DSECT NAME: N/A                                                    01100000
*01* DESCRIPTIVE NAME: OpenMVS extension of the TCB                     01200000
*02*   ACRONYM: OTCB                                                    01300000
**/                                                                     01350000
*/*01* PROPRIETARY STATEMENT=                                        */ 01400000
*/***PROPRIETARY_STATEMENT********************************************/ 01450000
*/*                                                                  */ 01500000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01600000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01650000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1992,2000                       */ 01700000
*/*                                                                  */ 01750000
*/* STATUS= HBB7703                                                  */ 01800000
*/*                                                                  */ 01850000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01900000
*/*                                                                     01950000
*01* EXTERNAL CLASSIFICATION:                                           02000000
*02*         DMTI:BASE                                                  02040000
*02*         GUPI:FIELDS                                                02080000
*                  OtcbThli                                             02120000
*                  OtcbWLMEToken                                        02160000
*01* END OF EXTERNAL CLASSIFICATION:                                    02200000
*                                                                       02250000
*01* FUNCTION:                                                          02300000
*                                                                       02350000
*    This maps the OpenMVS extension to the TCB.                        02400000
*                                                                       02450000
*01* METHOD OF ACCESS:                                                  02500000
*                                                                       02550000
*02*   PL/X:                                                            02600000
*        %INCLUDE SYSLIB(BPXZOTCB)                                      02700000
*        By default, the OTCB is based on STCBOTCB. If                  02750000
*        other basing is desired, use %OTCBBASE='BASED(XXXXXX)'.        02800000
*        If %OTCBBASE='BASED(OTCBPTR)' is coded, a Declare for          02850000
*        OTCBPTR is also generated.                                     02900000
*                                                                       02950000
*02*   ASM:                                                             03000000
*        BPXZOTCB  ...parms...                                          03050000
*                                                                       03150000
*01* SIZE: Release dependent.  Refer to the mapping.                    03200000
*            OTCBRACGIDS    -- X'000C' bytes                            03237500
*            OTCB           -- X'0160' bytes                            03275000
*            OTCBCOPYONFORK -- X'0048' bytes                            03312500
*                                                                       03350000
*01* POINTED TO BY:                                                     03400000
*      1) STCBOTCB                                                      03450000
*                                                                       03500000
*01* CREATED BY: OpenMVS Thread Initialization                          03550000
*                                                                       03600000
*01* DELETED BY: OpenMVS Thread Termination                             03650000
*                                                                       03700000
*01* STORAGE ATTRIBUTES:                                                03750000
*02*   SUBPOOL: 230                                                     03800000
*02*   KEY: 0, non fetch protected                                      03850000
*02*   RESIDENCY: EPA                                                   03900000
*                                                                       03950000
*01* FREQUENCY: 1 per OpenMVS thread                                    04000000
*                                                                       04050000
*01* SERIALIZATION: N/A                                                 04100000
*                                                                       04150000
*01* DEPENDENCIES: None                                                 04200000
*                                                                       04250000
*01* NOTES:     This is a bilingual macro.  use CBGEN to create         04264200
*               the ASSEMBLER version of the PLX mapping.               04278400
*01* HINTS:     1) Stay out of column 72.                               04292600
*               2) Do not place a structure under an unnamed field      04306800
*                  Example of what NOT to do:   2    *            ,     04321000
*                                                3   OtcbFldName  Ptr   04335200
*                                                                       04350000
*01* COMPONENT: OpenMVS (SCPX1)                                         04400000
*                                                                       04450000
*01* DISTRIBUTION LIBRARY:  AINTLIB                                     04500000
*                                                                       04550000
*01* EYE-CATCHER: OTCB                                                  04600000
*02*   OFFSET:  0                                                       04650000
*02*   LENGTH:  4                                                       04700000
*01* CHANGE-ACTIVITY:                                                   04800000
*                                                                       04850000
*    $L0=POSIXXP  HOM1110 921201 PDF4: OpenMVS Initial Release          04900000
*    $P1=PL70352  HOM1110 921201 PDJJ: Bypass RACF check for kill()     04950000
*    $P2=PL70382  HOM1110 921201 PDJD: Continue with stopping signal    05000000
*    $P3=PL70391  HOM1110 921201 PDHA: Don't clear waiting flags        05050000
*    $D4=DL70010  HOM1110,921201,PDJM: Thread Support                   05100000
*    $D5=DL70014  HOM1110,921201,PDJC: Thread Support                   05150000
*    $P4=PL70576  HOM1110,921218,PDJQ: CancelPending changes            05200000
*    $D6=DL70034  HOM1120,930114,PDPB: Change Proprietary statement     05250000
*                                      for IPCS format models           05300000
*    $D7=DL70042  HOM1120,930317,PDI6: Add flags for quiesce support    05350000
*    $L1=DOAA006  HOM1120 930503 PDJM: Multi-Process support.           05400000
*    $D8=DOAA003  HOM1120 930511 PDPE: Ptrace Thread Support            05450000
*    $P4=POA0020  HOM1120 930615 PDJI: Remove OtcbNoReset flags         05500000
*    $D9=DOAA002  HOM1120 930825 PDEA: (Dcr A002.09) KernPost with      05550000
*                                      token support                    05600000
*    $DA=DOAA038  HOM1120 931005 PDLH: MVSpause support                 05650000
*    $P5=PL70822  HOM1120,930924,PDI6: Change OTCB Subpool to 230       05700000
*    $DB=DOAA002  HOM1120 931101 PDLH: (DCR A002.13) Kernel Support     05750000
*                                      for Selectex                     05800000
*    $P6=POA0220  HOM1120,940119,PDJQ: Add PtExitOnly flag              05850000
*    $P7=POA0381  HOM1120,940310,PDI6: Multi-thread abnormal cleanup    05900000
*    $P8=POA0367  HOM1120,940307,PDJI: Add OtcbForkSTIMER flags         05950000
*    $P9=POA0417  HOM1120,940321,PDI6: Add OtcbInProcessTerm flag       06000000
*    $DC=DFPA088  HOM1130 940425 PDJM: (DCR A088.00) Fast Kern Post     06050000
*    $DD=DPFA065  HOM1130 940503 PDAX: A065.05 Rlimits/Rusage           06100000
*    $PA=PPF0017  HOM1130,940531,PDI6: Remove OtcbStackSw               06150000
*    $DE=DPFA065  HOM1130 940614 PDPE: DCR A065.09 User/group database  06200000
*                                      search                           06250000
*    $DF=DPFA051  HOM1130 940624 PDJJ: A051.07 Fork Daemon              06300000
*    $PB=PPF0098  HOM1130,940910,PDPE: CopyOnFork emancipation          06350000
*    $DG=DPFA065  HOM1130 940824 PDJM: A065.01 U U Interval timers      06400000
*    $DH=DPFA094  HOM1130 940921 PDJD: A094.02 Expanded SU function     06450000
*    $PC=PPF0177  HOM1130 950106 PDJI: BPXJCSS performance change       06500000
*    $PD=PPF0183  HOM1130 950116 PDJC: Flag pseudo-dub tasks (OW10835)  06550000
*    $DI=DPFA124  HOM1130 950421 PDJI: querydub support (A124.00)       06600000
*    $DJ=DPFA111  HOM1130 950612 PDJG: Task level security (A111.00)    06650000
*    $PE=PRG0017  HOM1140 950622 PDKG: Rollup Rel3 DCRs A130.00 and     06700000
*                                      A111.00                          06750000
*    $DK=DRGA153  HOM1140 951112 PDPY: A153.03 - Performance            06800000
*    $DL=DRGA153  HOM1140 951212 PDJQ: A153.01 - ACEE Caching           06850000
*    $DM=DRGA153  HOM1150 960218 PDPY: A153.07 - Performance            06900000
*    $DN=DSPA164  HOM1150 960215 PDI6: OE WLM Server Support A164.02    06950000
*    $DM=DSPA164  HOM1150 960315 PDPY: OE WLM Server Support A164.02    07000000
*    $DO=DSPA158  HOM1150 960124 PDJJ: DCR A158.00 ESCON Sockets        07050000
*    $DP=DRGA153  HOM1150 960504 PDKJ: DCR A153.11 Med Weight Processes 07100000
*    $PF=PSP0054  HOM1150 960409 PDJJ: Prop daemoninfo rollup prg0125   07150000
*    $PG=PSP0090  HOM1150 960520 PDPY: Pass APPL data/SDFL on fork      07200000
*    $01=OW22143  HOM1130 960815 PDI6: HSM Task Level ACEE InitUsp Fix  07250000
*    $DQ=DSYA196  JBB6604 960828 PDJC: A196.01 - SMF syscall            07300000
*    $DR=DSYA211  JBB6604 970128 PDI6: A211.01 - Fastpath Syscalls      07350000
*    $DS=DSYA197  JBB6604 961220 PDPY: A197.00 APPC Elimination         07400000
*    $PH=PSY0553  JBB6604 970310 PDJQ: RACF managed ACEEs (OW26085)     07450000
*    $01=OW26661  JBB6604 970507 PDJJ: Avoid multiple CallRTMs          07500000
*    $PI=PUX0201  HBB6605 970529 PDJJ: Support setgid on SU             07550000
*    $DT=DWAA217  JBB6607 971215 PDI6: A217.25 SAF Fastpath Support     07600000
*    $DU=DWAA274  JBB6607 980311 PDJQ: A274.02 FastCGI Support          07650000
*    $02=OW34533  HBB6605 980810 PDI6: ACEE Propagation on Pt_Create    07700000
*    $PJ=PWA0404  JBB6607 980818 PDJJ: Support initgroups after pw      07750000
*    $DV=DWKA320  HBB6608 980715 PDJI: A320.00 Java thread security     07800000
*    $DW=DWYA254  JBB6609 981124 PDJJ: A254.01 - HP Link support        07812500
*    $DX=DWYA315  JBB6609 981015 PDZJ: A315.00 Shared Library           07825000
*    $PK=PWK0799  HBB6608 990303 PDJJ: Avoid IRB during ptatt           07837500
*    $DY=PWYA352  JBB6609 990323 PDJC: (DCR A352.00) JobLog To STDERR   07843700
*    $PL=PWY0221  JBB6609 990714 PDJM: BILINGUAL, ASM part broke (R7)   07845800
*                                      Change  C00 to CL0 (4 times)     07847900
*    $PM=DXDA378  HBB7703 990728 PDJM: PWY0221 missed R10               07848900
*    $PN=PXD0518  HBB7703 991007 PDJM: Add OtcbLukwKey0 (for BPXSRSTQ)  07849400
*    $DZ=DXDA389  HBB7703 990817 PD2S: (DCR A389.00) Surrogate Cache    07849700
*    $PO=PXD0734  HBB7703 991125 PDQR: Closed the kser waiting window   07849800
*    $E1=DXD0765  HBB7703 991209 PDQR: Added some trace info for PRIN2  07849900
*    $PQ=PXD1007  HBB7703 000107 PDJC: No joblogging while running an   07862400
*                                      IPT/thread affinity program      07874900
*    $PR=PXD1559  HBB7703 000329 PDJC: Support POST w/TOKEN from IRB    07879000
*                                      while RB is doing POST w/TOKEN   07883100
*    $03=OW42628  HBB7703 000504 PDI6: Double Syscall Stack Free Fix    07885100
*    $04=OW45005  HBB7703 000504 PDQR: Missing DS in assembler defines  07886100
*    $05=OW45508  HBB7703 001128 PDJI: New Function - Pthread quiesce   07886890
*    $06=OW47578  HBB7703 001218 PDAE: A534 thread level posix identity 07887080
****END OF SPECIFICATIONS*********************************************/ 07887400
*% /*                                                                   07900000
.P0      ANOP                                                           07925000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 07950000
         AIF   ('&LIST' EQ 'YES').P2                                    08000000
.P1      ANOP                                                           08050000
         PUSH  PRINT                                                    08100000
         PRINT OFF                                                      08150000
.P2      ANOP                                                           08200000
         AIF   ('&OTCB' EQ 'NO').L0002                                  08250000
         AIF   ('&DSECT' EQ 'YES').L0003                                08300000
         AIF   ('&OTCB' NE 'YES').L0002                                 08350000
OTCB     DS    0D                                                       08400000
         AGO   .L0004                                                   08450000
.L0003   ANOP                                                           08500000
OTCB     DSECT                                                          08550000
.L0004   ANOP                                                           08600000
OTCBID   DS    1CL0004   EBCDIC ID - OTCB                               08650000
OTCBSP   DS    1FL1      Subpool number of this OTCB                    08700000
OTCBLEN  DS    1FL3      Length of this OTCB                            08750000
OTCBPTXL DS    1AL4      -> pthread parameters                          08800000
OTCBKSER DS    1AL4      -> KSER                                        08850000
OTCBMEDCLEAR DS 1CL0084  Section of Otcb we clear for medium weight    *08874590
                         processes                                      08883200
         ORG   OTCBMEDCLEAR                                             08909990
OTCBFLAGS DS   1BL4      Compare and swap flg                           08919980
         ORG   OTCBFLAGS                                                08929970
OTCBFLAGSB1 DS 1BL1                                                     08939960
         ORG   OTCBFLAGSB1                                              08949950
OTCBINITIALTHREAD EQU X'80' Initial thread of a process                 09000000
OTCBINKERNELCALL EQU X'40' moved to PPRT                                09050000
OTCBSLEEP EQU  X'20'     Signal sleep() flag which is checked by       *09100000
                         pause().                                       09150000
OTCBCALLEDKERNEL EQU X'10' At sometime in its life, this thread has    *09200000
                         made a system call /CS                         09250000
OTCBNOPTLSIR EQU X'08'   Signal is being sent from the ptrace PtlSir   *09300000
                         (Ptrace Signal Interface Routine), so signal  *09350000
                         delivery should not deliver the signal to the *09400000
                         PtlSir if ptrace mode is on (we're already    *09450000
                         there)                                         09500000
OTCBPROCESSCLEANUP EQU X'04' Process being torn down. /CS               09550000
OTCBINTASKTERM EQU X'02' Thread is in the process of task termination. *09600000
                         Set by BPXRRTRM during task term               09650000
OTCBBYPASSRACF EQU X'01' Do not do RACF check in kill() routine         09700000
         ORG   OTCBFLAGSB1+X'00000001'                                  09750000
OTCBFLAGSB2 DS 1BL1                                                     09809990
         ORG   OTCBFLAGSB2                                              09819980
OTCBPTEXITONLY EQU X'80' Thread did XAG exitonly                        09850000
OTCBTHREADPTEXITED EQU X'40' Marked Ptexited                            09900000
OTCBTHREADTERM EQU X'20' Thread in terminated state                     09950000
OTCBIPT  EQU   X'10'     Indicates this thread is or was the Initial   *10000000
                         Pthread Task, used by BPXPRMPC to check for   *10050000
                         IPT cleanup                                    10100000
OTCBPROCESSCREATOR EQU X'08' 1=>Indicates the dubbing of this thread   *10150000
                         caused the creation of the process             10200000
OTCBCANCELINTR EQU X'04' Cancel interrupt point                         10250000
OTCBQUIESCEPOSTED EQU X'02' This task posted by qut                     10300000
OTCBDUBNEWPROCESS EQU X'01' 0=>Dub as thread, 1=>Dub as process         10350000
         ORG   OTCBFLAGSB2+X'00000001'                                  10400000
OTCBFLAGSB3 DS 1BL1                                                     10459990
         ORG   OTCBFLAGSB3                                              10469980
OTCBATTACHEXEC EQU X'80' attach_exec in progress                        10500000
OTCBMULTIPROCCLP EQU X'40' 1=> Lower level processes are to be cleaned *10550000
                         up by this thread                              10600000
OTCBACTIVEACEEMANAGED EQU X'20' 1=Active ACEE managed by RACF          *10633300
                         (initACEE)                                     10666600
OTCBTOGGLEACEEMANAGED EQU X'10' 1=Toggled ACEE managed by RACF         *10699900
                         (initACEE)                                     10733200
OTCBSAVEDACEEMANAGED EQU X'08' MrPwd saved ACEE managed                 10766500
OTCBINPROCESSTERM EQU X'04' 1=> When PRTRM is terminating a process.   *10800000
                         Used to tell F.S. Termination when PRTRM is   *10850000
                         cleaning up.                                   10900000
OTCBTASKACEEUSP EQU X'02' USP created by TLS_TASK_ACEE#           @06A  10950000
OTCBMRPWDUIDSET EQU X'01' OtcbMrPwdUID field set                        11000000
         ORG   OTCBFLAGSB3+X'00000001'                                  11050000
OTCBFLAGSB4 DS 1BL1                                                     11109990
         ORG   OTCBFLAGSB4                                              11119980
OTCBPSEUDODUBBED EQU X'80' Thread is a pseudo-dubbed kernel task        11150000
OTCBTASKSEC EQU X'40'    Thread called BPX1TLS to build a task level   *11200000
                         Acee                                           11250000
OTCBENCLAVEOWNER EQU X'20' Thread is an owner of a WLM Enclave          11300000
OTCBWLMEMANAGED EQU X'10' Enclave managed by WLM                        11350000
OTCBTASKACEEINIT EQU X'08' InitUsp done for Task Level ACEE             11381200
OTCBDUBTASKACEE EQU X'04' 0=>Don't Dub Task Level ACEE 1=>Dub Task     *11412400
                         Level ACEE                                     11443600
OTCBPTCREACEE EQU X'02'  0=> No ACEE propagated on Ptcre 1=> ACEE was  *11474800
                         propagated                                     11506000
OTCBPROCINITACEE EQU X'01' 0=> No INITACEE done during dub 1=>         *11537200
                         INITACEE done during dub                       11568400
         ORG   OTCBFLAGS+X'00000004'                                    11600000
OTCBTHID DS    1CL0008   Thread ID                                      11669990
         ORG   OTCBTHID                                                 11689980
OTCBPPRT DS    1AL4      -> PPRT                                        11709970
         ORG   OTCBPPRT                                                 11729960
OTCBLIGHTWEIGHT EQU X'80' 1 Light weight thread                         11750000
         ORG   OTCBPPRT+X'00000004'                                     11800000
OTCBSEQNO DS   1FL4      Sequence number                                11859990
         ORG   OTCBSEQNO                                                11869980
OTCBSEQNOHIGHERHALF DS 1FL2 higher half of seq num                      11900000
OTCBSEQNOLOWERHALF DS 1FL2 lower half of seq num                        11950000
OTCBSIGFLAGS DS 1BL4     Signal Flags1 that are modified by signal     *12019990
                         IRBs. Serialized by Compare & Swap             12050000
         ORG   OTCBSIGFLAGS                                             12109990
OTCBSIGFLAGSB1 DS 1BL1                                                  12119980
         ORG   OTCBSIGFLAGSB1                                           12129970
OTCBSIGDISABLE EQU X'80' Signal Delivery is disabled                    12150000
OTCBSIGPENDING EQU X'40' Signal pending flag                            12200000
OTCBTIMERSIGNAL EQU X'20' SIGXCPU or SIGKILL is to be generated by the *12250000
                         syscall layer. Either OtcbSIGXCPU or          *12300000
                         OtcbSIGKILL is on. This flag exists for       *12350000
                         sycall layer performance.                      12400000
OTCBSIGALRM EQU X'10'    generate in SC layer                           12450000
OTCBALRMACTIVE EQU X'08' ALR & setitimer REAL                           12500000
OTCBIGNRBSTATE EQU X'04' Ignore RB state                                12550000
OTCBSIGDUMP EQU X'02'    Dump for terminating signal                    12600000
OTCBRAISETIMERIRB EQU X'01' Raise() function from Timer IRB             12650000
         ORG   OTCBSIGFLAGSB1+X'00000001'                               12700000
OTCBSIGFLAGSB2 DS 1BL1                                                  12759990
         ORG   OTCBSIGFLAGSB2                                           12769980
OTCBIRBSIGNAL EQU X'80'  Signal Checker routine should recheck signals *12800000
                         because one of the signal IRBs may have       *12850000
                         changed the signals pending                    12900000
OTCBPTDELAYIRB EQU X'40' Delay IRB for PTRACE                           12950000
OTCBSIRDISABLE EQU X'20' Disable invocation of SIR                      13000000
OTCBCANCELASYNC EQU X'10' Cancelation request state 0 = controlled, 1  *13050000
                         = async                                        13100000
OTCBCANCELDISABLED EQU X'08' Cancelation request type 0=enabled,       *13150000
                         1=disabled                                     13200000
OTCBSETSIGDISABLE EQU X'04' Syscall must turn on OtcbSigDisable on     *13250000
                         return                                         13300000
OTCBCTWACTIVE EQU X'02'  cond_timed_wait (BPX1CTW) is active            13350000
OTCBIGNDLVKEY EQU X'01'  Ignore Dlv key                                 13400000
         ORG   OTCBSIGFLAGSB2+X'00000001'                               13450000
OTCBSIGFLAGSB3 DS 1BL1                                                  13509990
         ORG   OTCBSIGFLAGSB3                                           13519980
OTCBCANCELPENDING EQU X'80' Cancel pending for thrd                     13550000
OTCBPTREGSINUSTA EQU X'40' Ptrace regs/PSW are in the Usta              13600000
OTCBSIGXCPU EQU X'20'    SIGXCPU is to be generated by syscall layer    13650000
OTCBSIGKILL EQU X'10'    SIGKILL is to be generated by syscall layer    13700000
OTCBSIGVTALRM EQU X'08'  generate in SC layer                           13750000
OTCBSIGPROF EQU X'04'    generate in SC layer                           13800000
OTCBALLSIGSBLOCKED EQU X'02' All signals are blocked, the same as if   *13850000
                         all bits were on in PpstSigMask                13900000
OTCBUDPINKERNEL EQU X'01' In UDP syscall                                13950000
         ORG   OTCBSIGFLAGSB3+X'00000001'                               14000000
OTCBSIGFLAGSB4 DS 1BL1                                                  14059990
         ORG   OTCBSIGFLAGSB4                                           14069980
OTCBVTALRMACTIVE EQU X'80' setitimer VIRTUAL                            14100000
OTCBPROFACTIVE EQU X'40' setitimer PROF                                 14150000
OTCBRETURNPPSD EQU X'20'                                                14177300
OTCBCALLRTM EQU X'10'    CallRTM done by IR1                            14204600
OTCBNOIRB EQU  X'08'     Avoid Irb interrupts                           14231900
OTCBREDRIVE EQU X'04'    IRB redrive is in prog                         14259200
OTCBCPUTIMEOUT EQU X'02' A terminating signal is to be generated due   *14286500
                         to the process time limit being exceeded       14289800
OTCBDLVTERM EQU X'01'    This thread is terminating due to a           *14293100
                         terminating signal                             14296400
         ORG   OTCBSIGFLAGS+X'00000004'                                 14300000
OTCBSIR2ID DS  1FL4      Alarm ID set by STIMERM. Changed by           *14350000
                         incrementing at start of alarm() and sleep()   14400000
OTCBRACGROUP DS 1AL4     Pointer to RACF structure to be deleted by    *14450000
                         next getgr* call                               14500000
OTCBRACPASSWD DS 1AL4    Pointer to RACF structure to be deleted by    *14550000
                         next getpw* call                               14600000
OTCBCOMMREQ DS 1AL4      Address of communications resource associated *14650000
                         with this task (only valid when there is an   *14700000
                         active request)                                14750000
OTCBPTMULTISTATUS DS 1BL1 Ptrace multi process mode status word value  *14800000
                         - will be one of the WastStopFlag... values    14850000
OTCBFLAGS2 DS  1CL0003   2nd Set of flags                               14919990
         ORG   OTCBFLAGS2                                               14939980
OTCBFLAGS2B1 DS 1BL1                                                    14959970
         ORG   OTCBFLAGS2B1                                             14979960
OTCBSTAXDEFERRED EQU X'80' Stax defer performed                         15000000
OTCBLUKWKEY0 EQU X'40'   User Kernwait caller is KEY 0                  15004000
OTCBKSERWAITINGF EQU X'20' Is Kser waiting?                             15008000
OTCBAFFINPGMRUNNING EQU X'10' An IPT/thread affinity program is        *15012000
                         running on this thread                         15016000
OTCBREGSINPPSD EQU X'08' User regs are in Ppsd at time of              *15020000
                         Freeze_This_Thread                             15024000
OTCBREGSINIRB EQU X'04'  User regs are in IRB at time of               *15028000
                         Freeze_This_Thread                             15032000
OTCBTIMEDKERNWAIT EQU X'02' Task is in Timed Kernwait                   15036000
OTCBSLOWPATHSYSCALL EQU X'01' This is a slow-path syscall. User regs   *15040000
                         are in USTA                                    15044000
         ORG   OTCBFLAGS2B1+X'00000001'                                 15050000
OTCBFLAGS2B2 DS 1BL1                                                    15109990
         ORG   OTCBFLAGS2B2                                             15119980
OTCBOSENVACTIVE EQU X'80' Task is active in the osenv                   15150000
OTCBOSENVGET EQU X'40'   Task issued osenv_get                          15200000
OTCBOSENVWLMJOIN EQU X'20' Task is joined to a WLM enclave as a result *15250000
                         of osenv_set                                   15300000
OTCBOSENVSECURITY EQU X'10' Security environment was saved by osenv     15350000
         ORG   OTCBFLAGS2B2+X'00000001'                                 15400000
OTCBFLAGS2B3 DS 1BL1                                                    15450000
OTCBALRMGTYEAR DS 1FL4   Alarm time in seconds greater than 365 days   *15600000
                         used by alarm() and sleep() functions          15650000
OTCBCOFPTR DS  1AL4      Address of CopyOnFork area                     15700000
OTCBDLVIRB DS  1AL4      Address of RB that called Signal Delivery      15750000
OTCBDUBRBSQN DS 1FL4     Sequence number of RB that was DUBed           15800000
OTCBREGRBSQN DS 1FL4     Sequence number of RB that registered for     *15850000
                         signals                                        15900000
OTCBSPB@ DS    1AL4      Ptr to SPB. For BPXJCSS and BPXJCNS calls,    *15950000
                         the ALET for this SPB is PRIMARY. For         *16000000
                         BPXJCSA, the ALET is HOME.                     16050000
OTCBSYSCALLCODE DS 1FL4  System call number                             16100000
OTCBLECB DS    1AL4      Ptr to ECB used to wait for a latch to be     *16150000
                         obtained                                       16200000
OTCBPPSDPTR DS 1AL4      -> PPSD                                        16259990
         ORG   OTCBPPSDPTR                                              16269980
OTCBPPSD DS    1AL4      -> PPSD                                        16300000
OTCBCTWID DS   1FL4      cond_timed_wait stimerm ID                     16350000
OTCBSTACKNONSW DS 1AL4   Dynamic stack for Non-space switched          *16400000
                         syscalls. Only valid when OTCBSYSCALLCODE is  *16450000
                         non-zero. Contains address of 1st #SAMAP area *16500000
                         following RUCA. Addressable in user home      *16550000
                         space.                                         16600000
OTCBOTIM DS    1AL4      -> interval timers                             16650000
OTCBOAPB DS    1AL4      -> OAPB                                        16700000
OTCBMEDCLEAR2 DS 1CL0248 We can't clear Oapb, multiproc quiesce        *16724590
                         references                                     16733200
         ORG   OTCBMEDCLEAR2                                            16741200
OTCBPTPICPARMSPTR DS 1AL4 Pointer to ptrace recovery environment       *16750000
                         parameters (PIC parms                          16800000
OTCBPTEVENTID DS 1FL4    Ptrace event ID, that identifies why this     *16850000
                         thread stopped for ptrace                      16900000
OTCBPTLCLPPSDPTR DS 1AL4 Ptrace local Ppsd pointer                      16950000
OTCBMVSPAUSEECBLIST DS 1AL4 Pointer to the BPXZECBL - System copy of   *17000000
                         user ECB addresses passed to MVSpauseInit      17050000
OTCBSAVEDSCB DS 1AL4     Saved SCB addr of STAI on entry to Local      *17100000
                         Child Process                                  17150000
OTCBUECBLIST DS 1AL4     Pointer to the BPXZECBL - System copy of user *17200000
                         and system ECBs address for the BPXLUKW -     *17250000
                         User KernWait service                          17300000
OTCBUIDS DS    1CL0012   User IDs for Thread                            17359990
         ORG   OTCBUIDS                                                 17369980
OTCBRUID DS    1FL4      Real Uid                                       17400000
OTCBEUID DS    1FL4      Effective Uid                                  17450000
OTCBSUID DS    1FL4      Saved Uid                                      17500000
OTCBSAVEDACEE DS 1AL4    MRPWD saved Acee                               17550000
OTCBPPRX DS    1AL4      Address of the Pprx, an extension of the Pprt  17600000
OTCBMRPWDUID DS 1FL4     Password verified UID                          17650000
OTCBPSWBYT03 DS 1FL4     Caller's PSW bytes 0-4 (Used by JCPR to setup *17700000
                         BPXZUSTA)                                      17750000
OTCBMRPWDUSERNAME DS 1CL0008 Password verified userid                   17800000
OTCBSAVEDSECENV DS 1AL4  Pointer to ACEE saved by BPX1ENV for a toggle *17850000
                         request                                        17900000
OTCBMVSUSERIDPTR DS 1AL4 Pointer to userid of this thread, points to   *17950000
                         either OtcbLoginNInfo or OasbLoginNInfo        18000000
OTCBLOGINNINFO DS 1CL0013 Task userid and length                        18059990
         ORG   OTCBLOGINNINFO                                           18069980
OTCBLOGINNLEN DS 1FL4    Task userid length                             18100000
OTCBLOGINNAME DS 1CL0009 Tasks userid, must be '00'x (null)            *18150000
                         terminated. Preceding length does not include *18200000
                         ' terminating null                             18250000
OTCBPRIN2FLAGS DS 1BL1   This field is modified by BPXPRIN1, and it is *18291290
                         used by BPXPRIN2. See PPSQ for the mapping    *18299280
                         and more details                               18307270
         DS    1CL0002   Reserved, keep word bdy                        18316600
OTCBTHLI DS    1AL4      -> Thli. This field must never change offsets *18350000
                         within the Otcb since the Thli is an external *18400000
                         control block and the user will have to go    *18450000
                         through the Otcb to get to the Thli            18500000
OTCBACTSCTBNODEPTR DS 1AL4 Active Acee SCTB node ptr, zero if ACEE is  *18569990
                         private                                        18600000
OTCBTOGGLEDSCTBNODEPTR DS 1AL4 Toggled Acee SCTB node ptr, zero if     *18679990
                         ACEE is private                                18709980
OTCBPAG  DS    1FL4      Process Auth Groups                            18750000
OTCBGIDS DS    1CL0012   Group IDs for Thread                           18809990
         ORG   OTCBGIDS                                                 18819980
OTCBRGID DS    1FL4      Real Gid                                       18850000
OTCBEGID DS    1FL4      Effective Gid                                  18900000
OTCBSGID DS    1FL4      Saved Gid                                      18950000
OTCBRACGIDSPTR DS 1AL4   Addr of saved group list                       19000000
OTCBWLMETOKEN DS 1BL8    WLM Enclave token associated with the thread   19050000
OTCBSAVEDGID DS 1FL4     Gid set by getpwname, used by setgid           19085700
OTCBALIASNINFO DS 1CL0013                                               19131390
         ORG   OTCBALIASNINFO                                           19141380
OTCBALIASNLEN DS 1FL4    Task alias length                              19157100
OTCBALIASNAME DS 1CL0009 Tasks alias, must be '00'x (null) terminated. *19192800
                         Preceding length does not include '           *19228500
                         terminating null                               19264200
         DS    1CL0003   Reserved, keep word bdy                        19300000
OTCBOSENVTOKEN DS 1CL0008 osenv environment token                       19315990
         ORG   OTCBOSENVTOKEN                                           19319980
OTCBOSENVCELLPTR DS 1AL4 Ptr to osenv environment cell element          19324000
OTCBOSENVSEQN DS 1FL4    seq number associated with the osenv cell      19336000
OTCBREDRIVETIME DS 1FL4  Time to delay signal IRB                       19348000
OTCBSHLLOADERINFO DS 1CL0048 Shared Library data                        19363990
         ORG   OTCBSHLLOADERINFO                                        19367980
OTCBSHLLOADER1DSPADDR DS 1AL4 Shared Library loader data1 addr in data *19372000
                         space                                          19384000
OTCBSHLLOADER1DSPPAGES DS 1FL4 Shared Library loader data1 len in data *19396000
                         space                                          19408000
OTCBSHLLOADER1DSPALET DS 1FL4 Shared Library loader data1 alet of data *19420000
                         space                                          19432000
OTCBSHLLOADER1DSPSTOKEN DS 1CL0008 Shared Library loader data1 stkn of *19444000
                         data space                                     19456000
OTCBSHLLOADER2DSPADDR DS 1AL4 Shared Library loader data1 addr in data *19468000
                         space                                          19480000
OTCBSHLLOADER2DSPPAGES DS 1FL4 Shared Library loader data1 len in data *19492000
                         space                                          19504000
OTCBSHLLOADER2DSPALET DS 1FL4 Shared Library loader data1 alet of data *19516000
                         space                                          19528000
OTCBSHLLOADER2DSPSTOKEN DS 1CL0008 Shared Library loader data1 stkn of *19540000
                         data space                                     19552000
OTCBSHLLOADERTOK DS 1CL0008 Shared Library loader token len used by    *19564000
                         BPXXSHLB INIT                                  19576000
OTCBSMKLATCHFLAGCOUNT DS 1FL4 OcvtSMKLatchCount incremented             19589970
OTCBSAVEPPRT DS 1AL4     Addr of Pprt saved during task term when      *19590960
                         OtcbPprt is changed so that BPXMIPCE can find *19591950
                         real Pprt of running task                      19592940
         DS    1CL0036   Reserved for future use                        19593930
OTCB_END DS    0C        Make CB end on doubleword                      19600000
OTCB_LEN EQU   *-OTCB                                                   19650000
.L0002   ANOP                                                           19700000
*                                                                       19750000
* ********************************************************************  19800000
* *                                                                  *  19850000
* * NOTE: The "OtcbCopyOnFork" is contiguous to the end of the Otcb. *  19900000
* *       IPCS modules respecify its base on the address of Otcb_End *  19950000
* *       because the field OtcbCofPtr does NOT contain an address   *  20000000
* *       that is usable by IPCS without another ?ASAXACC.           *  20050000
* *                                                                  *  20100000
* ********************************************************************  20150000
*                                                                       20200000
*                                                                       20250000
         AIF   ('&OTCBCOPYONFORK' EQ 'NO').L0005                        20300000
         AIF   ('&DSECT' EQ 'YES').L0006                                20350000
         AIF   ('&OTCBCOPYONFORK' NE 'YES').L0005                       20400000
OTCBCOPYONFORK DS 0D     These fields will be copied to the child Otcb *20450000
                         on fork()                                      20500000
         AGO   .L0007                                                   20550000
.L0006   ANOP                                                           20600000
OTCBCOPYONFORK DSECT     These fields will be copied to the child Otcb *20650000
                         on fork()                                      20700000
.L0007   ANOP                                                           20750000
OTCBSYSCALLENTRYSTATUS DS 1AL4 Ptr to regs and stuff at entry to the   *20800000
                         syscall layer                                  20850000
OTCBUSTAPTR DS 1AL4      Pointer to user status area containing the    *20900000
                         syscall issuer's regs and PSW. (Mapped by     *20950000
                         BPXZUSTA. Used by ptrace.)                     21000000
OTCBGROUPDBSEARCH DS 1CL0008 Group name for group data base search     *21050000
                         (getgrent)                                     21100000
OTCBUSERDBSEARCH DS 1CL0008 User name for user data base search        *21150000
                         (getpwent)                                     21200000
OTCBSTORAGEFORCPR DS 1AL4 Dynamic area for BPXJCPR                      21250000
OTCBSTORAGEFORCPRKEY DS 1FL1 Storage key of dynamic area for JCPR       21300000
OTCBSTORAGEFORCPRLEN DS 1FL3 Length of JCPR dynamic area                21350000
OTCBSTORAGEFORCPRSP DS 1FL1 Storage SP of dynamic area                  21400000
OTCBCOPYFLAGS DS 1BL1    Copy on Fork Flags                             21459990
         ORG   OTCBCOPYFLAGS                                            21469980
OTCBSETUIDEXEC EQU X'80' Setuid Exec in progress                        21500000
OTCBMVSAUTHLIB EQU X'40' Pgm loaded from MVS authorized library by     *21550000
                         exec/execmvs                                   21600000
OTCBEXECPROCESS EQU X'20' This process image was created by            *21650000
                         exec/execmvs                                   21700000
OTCBSIGPOSTINPC EQU X'10' Sig IRB will post ThliComECB even when a     *21726990
                         Linkage Stack is detected, signal will be     *21733980
                         rescheduled for future delivery                21740970
         ORG   OTCBCOPYFLAGS+X'00000001'                                21750000
         DS    1CL0002   Reserved                                       21800000
OTCBDAEMONINFO DS 1CL0012 This info will be set and reused to improve  *21869990
                         performance by bypassing multiple RACF calls  *21900000
                         for the same info                              21950000
         ORG   OTCBDAEMONINFO                                           21970000
OTCBSAVEDUID DS 1FL4     Remembered UID                                 22000000
OTCBSAVEDUSERNAME DS 1CL0008 Remembered UserID                          22050000
OTCBWLMUSERDATAINFO DS 1CL0016 WLM Server information. These fields    *22119990
                         are needed to manage the application data and *22150000
                         file descriptor list. A single area is        *22200000
                         obtained for both needs. The area is pointed  *22250000
                         to by OtcbWLMUserDataPtr. The application     *22300000
                         data is always first in the area followed by  *22350000
                         the FDL area.                                  22400000
         ORG   OTCBWLMUSERDATAINFO                                      22420000
OTCBWLMUSERDATAPTR DS 1AL4 Address of user data storage                 22450000
OTCBWLMUSERDATALEN DS 1FL4 Length of user data storage -- the entire   *22550000
                         area                                           22600000
OTCBWLMUSERDATAKEY DS 1FL1 Key of user data area                        22650000
         DS    1CL0003   reserved                                       22700000
OTCBWLMAPPLLEN DS 1FL4   Length of the application data portion of the *22750000
                         user data area. The file descriptors occupy   *22800000
                         the remainder of the user data area            22850000
OTCBSMFBUFFPTR DS 1AL4   Address of key 0 copy of user SMF record       22900000
OTCBSMFBUFFLEN DS 1FL4   Length of key 0 copy of user SMF record        22950000
OTCBCOFEND DS  0C        Make CB end on dword                           23000000
OTCBCOPYONFORK_LEN EQU *-OTCBCOPYONFORK                                 23016600
.L0005   ANOP                                                           23033200
*                                                                       23050000
*    *****************************************************************  23100000
*    *                                                               *  23150000
*    * **** This is end of "OtcbCopyOnFork" area ****                *  23200000
*    *                                                               *  23250000
*    *****************************************************************  23300000
*                                                                       23350000
*                                                                       23400000
*                                                                       23402100
*    *****************************************************************  23404200
*    *                                                               *  23406300
*    * The following based area is used by BPXPRGUG and BPXPRSGR. A  *  23408400
*    * copy of the last getgroupsbyname will be saved here if done   *  23410500
*    * after a __passwd() with the same name.                           23412600
*    *                                                               *  23414700
*    *****************************************************************  23416800
*                                                                       23418900
*                                                                       23421000
         AIF   ('&OTCBRACGIDS' EQ 'NO').L0008                           23423100
         AIF   ('&DSECT' EQ 'YES').L0009                                23425200
         AIF   ('&OTCBRACGIDS' NE 'YES').L0008                          23427300
OTCBRACGIDS DS 0F                                                       23429400
         AGO   .L000A                                                   23431500
.L0009   ANOP                                                           23433600
OTCBRACGIDS DSECT                                                       23435700
.L000A   ANOP                                                           23437800
OTCBRACGIDSHEADER DS 1CL0008                                            23440590
         ORG   OTCBRACGIDSHEADER                                        23441280
OTCBRACGIDSTOTNUM DS 1FL4                                               23442000
OTCBRACGIDSCURNUM DS 1FL4                                               23444100
OTCBRACGIDSLIST DS 1FL4                                                 23446200
OTCB#ID  EQU   C'OTCB'   Control Block Acronym                          23450000
OTCB#MEDCLEAR2LEN EQU 320 Length to clear                               23483300
OTCB#LEN EQU   424                                                      23516600
*                                                                       23550000
*                                      Length of OTCB                   23600000
*                                                                       23650000
OTCB#SP  EQU   230       Subpool for the OTCB                           23700000
OTCBRACGIDS_LEN EQU *-OTCBRACGIDS                                       23750000
.L0008   ANOP                                                           23800000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 23850000
         AIF   ('&LIST' EQ 'YES').P4                                    23900000
.P3      ANOP                                                           23950000
         POP   PRINT                                                    24000000
.P4      ANOP                                                           24050000
.P_EXIT  ANOP                                                           24100000
         MEND                                                           24150000
**/ BPXZOTCB_2:;                                                        24200000
* %BPXZOTCB_INCLUDED = 'YES';                                           24250000
* %DCL ZCBPRINT CHAR EXT;                                               24300000
* %DEACTIVATE ZCBPRINT;                                                 24350000
* %DCL BPXZOTCB_LIST CHAR EXT;                                          24400000
* %DEACTIVATE BPXZOTCB_LIST;                                            24450000
* %IF BPXZOTCB_LIST ^= 'NO' &                                           24500000
*    ZCBPRINT ^= 'NO' %THEN                                             24550000
*   %GOTO BPXZOTCB_3;                                                   24600000
*   @LIST PUSH NOECHO;                                                  24650000
*   @LIST NOASSEMBLE NOECHO;                                            24700000
*   @LIST OFF C NOECHO;                                                 24750000
* %BPXZOTCB_3:;                                                         24800000
*/* Start of PL/X Source                                             */ 24850000
*%IF OTCBBASE='' %THEN                                                  24900000
*  %DO;                                                                 24950000
*    %OTCBBASE='BASED(StcbOtcb)';                                       25000000
*  %END;                                                                25050000
* %IF OTCBBASE='BASED(OtcbPtr)' %THEN                                   25100000
*   %DO;                                                                25150000
*     DCL OtcbPtr Ptr(31);           /* Pointer to the OTCB          */ 25200000
*   %END;                                                               25250000
*DCL                                                                    25300000
* 1    Otcb                OTCBBASE   Bdy(DWord),                       25350000
*  3   OtcbID              Char(4),   /* EBCDIC ID - OTCB            */ 25400000
*  3   OtcbSP              Fixed(8),  /* Subpool number of this OTCB */ 25450000
*  3   OtcbLen             Fixed(24), /* Length of this OTCB         */ 25500000
*  3   OtcbPtxl            Ptr(31),   /* -> pthread parameters   @D5C*/ 25550000
*  3   OtcbKser            Ptr(31),   /* -> KSER                     */ 25600000
* 2    OtcbMedClear,                  /* Section of Otcb we clear for   25650000
*                                        medium weight processes @DPA*/ 25700000
*  3   OtcbFlags           Bit(32) Bdy(Word), /* Compare and swap flg*/ 25750000
*   4  OtcbFlagsB1         Bit(8),    /*                             */ 25800000
*    7 OtcbInitialThread   Bit(01),   /* Initial thread of a process */ 25850000
*    7 OtcbInKernelCall    Bit(01),   /* moved to PPRT               */ 25900000
*    7 OtcbSleep           Bit(01),   /* Signal sleep() flag which is   25950000
*                                        checked by pause().         */ 26000000
*    7 OtcbCalledKernel    Bit(01),   /* At sometime in its life, this  26050000
*                                        thread has made a system       26100000
*                                        call                     /CS*/ 26150000
*    7 OtcbNoPtlSir        Bit(01),   /* Signal is being sent from the  26200000
*                                        ptrace PtlSir (Ptrace Signal   26250000
*                                        Interface Routine), so signal  26300000
*                                        delivery should not deliver    26350000
*                                        the signal to the PtlSir if    26400000
*                                        ptrace mode is on (we're       26450000
*                                        already there)              */ 26500000
*    7 OtcbProcessCleanup  Bit(01),   /* Process being torn down. /CS*/ 26550000
*    7 OtcbinTaskTerm      Bit(01),   /* Thread is in the process of    26600000
*                                        task termination.  Set by      26650000
*                                        BPXRRTRM during task term   */ 26700000
*    7 OtcbBypassRACF      Bit(01),   /* Do not do RACF check in kill() 26750000
*                                        routine                 @P1A*/ 26800000
*   4  OtcbFlagsB2         Bit(8),    /*                             */ 26850000
*    7 OtcbPtExitOnly      Bit(01),   /* Thread did XAG exitonly @P6C*/ 26900000
*    7 OtcbThreadPtexited  Bit(01),   /* Marked Ptexited         @D5A*/ 26950000
*    7 OtcbThreadTerm      Bit(01),   /* Thread in terminated state     27000000
*                                                                @D5A*/ 27050000
*    7 OtcbIPT             Bit(01),   /* Indicates this thread is or    27100000
*                                        was the Initial Pthread Task,  27150000
*                                        used by BPXPRMPC to check for  27200000
*                                        IPT cleanup             @D7A*/ 27250000
*    7 OtcbProcessCreator  Bit(01),   /* 1=>Indicates the dubbing       27300000
*                                        of this thread caused the      27350000
*                                        creation of the process @DIA*/ 27400000
*    7 OtcbCancelIntr      Bit(01),   /* Cancel interrupt point  @D5A*/ 27450000
*    7 OtcbQuiescePosted   Bit(01),   /* This task posted by qut @D7A*/ 27500000
*    7 OtcbDubNewProcess   Bit(01),   /* 0=>Dub as thread,              27550000
*                                        1=>Dub as process       @L1C*/ 27600000
*   4  OtcbFlagsB3         Bit(8),    /*                             */ 27650000
*    7 OtcbAttachExec      Bit(01),   /* attach_exec in progress @L1A*/ 27700000
*    7 OtcbMultiProcClp    Bit(01),   /* 1=> Lower level processes      27750000
*                                        are to be cleaned up by this   27800000
*                                        thread                  @P7A*/ 27850000
*    7 OtcbActiveAceeManaged Bit(1),  /* 1=Active ACEE managed by RACF  27900000
*                                        (initACEE)              @PHA*/ 27950000
*    7 OtcbToggleAceeManaged Bit(1),  /* 1=Toggled ACEE managed by RACF 28000000
*                                        (initACEE)              @PHA*/ 28050000
*    7 OtcbSavedAceeManaged Bit(1),   /* MrPwd saved ACEE managed       28100000
*                                                                @PHA*/ 28150000
*    7 OtcbInProcessTerm   Bit(1),    /* 1=> When PRTRM is terminating  28200000
*                                        a process.  Used to tell F.S.  28250000
*                                        Termination when PRTRM is      28300000
*                                        cleaning up.            @P9A*/ 28350000
*    7 OtcbTaskAceeUsp     Bit(1),    /* USP created by                 28409990
*                                        TLS_TASK_ACEE#          @06C*/ 28419980
*    7 OtcbMrPwdUIDSet     Bit(1),    /* OtcbMrPwdUID field set  @DHA*/ 28450000
*   4  OtcbFlagsB4         Bit(8),    /*                             */ 28500000
*    7 OtcbPseudoDubbed    Bit(1),    /* Thread is a pseudo-dubbed      28550000
*                                        kernel task             @PDA*/ 28600000
*    7 OtcbTaskSec         Bit(1),    /* Thread called BPX1TLS to build 28650000
*                                        a task level Acee       @PEA*/ 28700000
*    7 OtcbEnclaveOwner    Bit(1),    /* Thread is an owner of a WLM    28750000
*                                        Enclave                 @DNA*/ 28800000
*    7 OtcbWLMEManaged     Bit(1),    /* Enclave managed by WLM  @DMA*/ 28850000
*    7 OtcbTaskAceeInit    Bit(1),    /* InitUsp done for Task Level    28900000
*                                        ACEE                    @01A*/ 28950000
*    7 OtcbDubTaskAcee     Bit(1),    /* 0=>Don't Dub Task Level ACEE   29000000
*                                        1=>Dub Task Level ACEE  @01A*/ 29050000
*    7 OtcbPtcreAcee       Bit(1),   /* 0=> No ACEE propagated on Ptcre 29100000
*                                        1=> ACEE was propagated @02A*/ 29150000
*    7 OtcbProcInitAcee    Bit(1),   /* 0=> No INITACEE done during dub 29200000
*                                        1=> INITACEE done during dub   29250000
*                                                                @02A*/ 29300000
*  3 OtcbTHID     Char(08) Bdy(Word), /* Thread ID               @D4A*/ 29350000
*   5  OtcbPprt            Ptr(31),   /*   -> PPRT               @D4M*/ 29400000
*    7 OtcbLightWeight     Bit(01),   /*   1 Light weight thread @D4A*/ 29450000
*   5  OtcbSeqNo           Fixed(32), /*   Sequence number       @D4A*/ 29500000
*    7 OtcbSeqNoHigherHalf Fixed(16), /* higher half of seq num  @D9A*/ 29550000
*    7 OtcbSeqNoLowerHalf  Fixed(16), /* lower half of seq num   @D9A*/ 29600000
*  3 OtcbSigFlags  Abnormal Bit(32),  /* Signal Flags1 that are      */ 29650000
*                                     /* modified by signal IRBs.    */ 29700000
*                                     /* Serialized by Compare & Swap*/ 29750000
*   4  OtcbSigFlagsB1     Bit(08),                                      29800000
*    7 OtcbSigDisable      Bit(01),   /* Signal Delivery is disabled */ 29850000
*    7 OtcbSigPending      Bit(01),   /* Signal pending flag         */ 29900000
*    7 OtcbTimerSignal     Bit(01),   /* SIGXCPU or SIGKILL is to be    29950000
*                                        generated by the syscall       30000000
*                                        layer.  Either OtcbSIGXCPU     30050000
*                                        or OtcbSIGKILL is on.  This    30100000
*                                        flag exists for sycall layer   30150000
*                                        performance.            @DDC*/ 30200000
*    7 OtcbSIGALRM         Bit(01),   /* generate in SC layer    @DGC*/ 30250000
*                                                                       30300000
*    7 OtcbALRMActive      Bit(01),   /* ALR & setitimer REAL        */ 30350000
*    7 OtcbIgnRBState      Bit(01),   /* Ignore RB state             */ 30400000
*    7 OtcbSigDump         Bit(01),   /* Dump for terminating signal */ 30450000
*    7 OtcbRaiseTimerIRB   Bit(01),   /* Raise() function from          30500000
*                                           Timer IRB                */ 30550000
*   4  OtcbSigFlagsB2     Bit(08),                                      30600000
*    7 OtcbIRBsignal       Bit(01),   /* Signal Checker routine should  30650000
*                                        recheck signals because one of 30700000
*                                        the signal IRBs may have       30750000
*                                        changed the signals pending */ 30800000
*    7 OtcbPTdelayIRB      Bit(01),   /* Delay IRB for PTRACE        */ 30850000
*    7 OtcbSirDisable      Bit(01),   /* Disable invocation of SIR   */ 30900000
*    7 OtcbCancelAsync     Bit(01),   /* Cancelation request state      30950000
*                                        0 = controlled, 1 = async      31000000
*                                                                @D5A*/ 31050000
*                                                                       31100000
*    7 OtcbCancelDisabled  Bit(01),   /* Cancelation request type       31150000
*                                        0=enabled, 1=disabled   @D5A*/ 31200000
*    7 OtcbSetSigDisable   Bit(01),   /* Syscall must turn on           31250000
*                                       OtcbSigDisable on return @D5A*/ 31300000
*    7 OtcbCtwActive       Bit(01),   /* cond_timed_wait (BPX1CTW)      31350000
*                                        is active               @D5A*/ 31400000
*    7 OtcbIgnDlvKey       Bit(01),   /* Ignore Dlv key          @D5A*/ 31450000
*                                                                       31500000
*   4  OtcbSigFlagsB3     Bit(08),                                      31550000
*    7 OtcbCancelPending   Bit(01),   /* Cancel pending for thrd @P4A*/ 31600000
*    7 OtcbPtRegsInUsta    Bit(01),   /* Ptrace regs/PSW are in the     31650000
*                                        Usta                    @D8A*/ 31700000
*    7 OtcbSIGXCPU         Bit(01),   /* SIGXCPU is to be generated by  31750000
*                                        syscall layer           @DDA*/ 31800000
*    7 OtcbSIGKILL         Bit(01),   /* SIGKILL is to be generated by  31850000
*                                        syscall layer           @DDA*/ 31900000
*                                                                       31950000
*    7 OtcbSIGVTALRM       Bit(01),   /* generate in SC layer    @DGA*/ 32000000
*    7 OtcbSIGPROF         Bit(01),   /* generate in SC layer    @DGA*/ 32050000
*    7 OtcbAllSigsBlocked  Bit(01),   /* All signals are blocked, the   32100000
*                                        same as if all bits were on in 32150000
*                                        PpstSigMask             @DMC*/ 32200000
*    7 OtcbUdpInKernel     Bit(01),   /* In UDP syscall          @DOA*/ 32250000
*                                                                       32300000
*   4  OtcbSigFlagsB4     Bit(08),                                      32350000
*    7 OtcbVTALRMActive    Bit(01),   /* setitimer VIRTUAL       @DGA*/ 32400000
*    7 OtcbPROFActive      Bit(01),   /* setitimer PROF          @DGA*/ 32450000
*    7 OtcbReturnPpsd      Bit(01),   /*                         @DGC*/ 32500000
*    7 OtcbCallRTM         Bit(01),   /* CallRTM done by IR1     @01A*/ 32550000
*    7 OtcbNoIrb           Bit(01),   /* Avoid Irb interrupts    @PKA*/ 32575000
*    7 OtcbReDrive         Bit(01),   /* IRB redrive is in prog  @DWA*/ 32600000
*    7 OtcbCPUTimeOut      Bit(01),   /* A terminating signal is to be  32607100
*                                        generated due to the process   32614200
*                                        time limit being exceeded      32621300
*                                                                @DYA*/ 32628400
*    7 OtcbDlvTerm         Bit(01),   /* This thread is terminating due 32635500
*                                        to a terminating signal @DYA*/ 32642600
*                                                                       32650000
*  3 OtcbSir2ID        Fixed(32),     /* Alarm ID set by STIMERM.       32700000
*                                        Changed by incrementing at     32750000
*                                        start of alarm() and sleep()*/ 32800000
*                                                                       32850000
*  3 OtcbRacGroup  Ptr(31),     /* Pointer to RACF structure to be      32900000
*                                  deleted by next getgr* call       */ 32950000
*  3 OtcbRacPasswd Ptr(31),     /* Pointer to RACF structure to be      33000000
*                                  deleted by next getpw* call       */ 33050000
*  3 OtcbCommReq           Ptr(31),   /* Address of communications      33100000
*                                        resource associated with this  33150000
*                                        task (only valid when there    33200000
*                                        is an active request)       */ 33250000
*  3 OtcbPtMultiStatus      Bit(8),   /* Ptrace multi process mode      33300000
*                                        status word value - will be    33350000
*                                        one of the WastStopFlag...     33400000
*                                        values                  @D8C*/ 33450000
*  3 OtcbFlags2            Char(03),  /* 2nd Set of flags        @DRA*/ 33500000
*   4  OtcbFlags2B1       Bit(08),                                      33550000
*    7 OtcbStaxDeferred    Bit(01),   /* Stax defer performed    @DRA*/ 33600000
*    7 OtcbLukwKey0        Bit(01),   /* User Kernwait caller is KEY 0  33625000
*                                                                @PNA*/ 33650000
*    7 OtcbKserWaitingF    Bit(01),   /* Is Kser waiting?        @POA*/ 33666600
*    7 OtcbAffinPgmRunning Bit(01),   /* An IPT/thread affinity program 33673200
*                                        is running on this thread      33680790
*                                                                @05A*/ 33681780
*    7 OtcbRegsInPpsd      Bit(01),   /* User regs are in Ppsd at time  33682770
*                                        of Freeze_This_Thread   @05A*/ 33683760
*    7 OtcbRegsInIRB       Bit(01),   /* User regs are in IRB at time   33684750
*                                        of Freeze_This_Thread   @05A*/ 33685740
*    7 OtcbTimedKernWait   Bit(01),   /* Task is in Timed Kernwait      33686730
*                                                                @05A*/ 33687720
*    7 OtcbSlowPathSyscall Bit(01),   /* This is a slow-path syscall.   33688710
*                                        User regs are in USTA   @05A*/ 33689700
*   4  OtcbFlags2B2       Bit(08),    /*                         @DRA*/ 33700000
*    7 OtcbOsenvActive     Bit(1),    /* Task is active in the osenv    33750000
*                                                                @DVA*/ 33800000
*    7 OtcbOsenvGet        Bit(1),    /* Task issued osenv_get   @DVA*/ 33850000
*    7 OtcbOsenvWlmJoin    Bit(1),    /* Task is joined to a WLM        33900000
*                                        enclave as a result of         33950000
*                                        osenv_set               @DVA*/ 34000000
*    7 OtcbOsenvSecurity   Bit(1),    /* Security environment was       34050000
*                                        saved by osenv          @DVA*/ 34100000
*   4  OtcbFlags2B3       Bit(08),    /*                         @DRA*/ 34150000
*  3 OtcbAlrmGtYear        Fixed(32), /* Alarm time in seconds greater  34200000
*                                        than 365 days used by alarm()  34250000
*                                         and sleep() functions      */ 34300000
*  3 OtcbCofPtr            Ptr(31),   /* Address of CopyOnFork area     34350000
*                                                                @PBC*/ 34400000
*  3 OtcbDlvIRB            Ptr(31),   /* Address of RB that called      34450000
*                                        Signal Delivery         @P2A*/ 34500000
*  3 OtcbDubRBSqn          Fixed(32), /* Sequence number of RB that  */ 34550000
*                                     /* was DUBed                   */ 34600000
*  3 OtcbRegRBSqn          Fixed(32), /* Sequence number of RB that     34650000
*                                        registered for signals      */ 34700000
*  3 OtcbSpb@              Ptr(31),   /* Ptr to SPB. For BPXJCSS and    34750000
*                                        BPXJCNS calls, the ALET for    34800000
*                                        this SPB is PRIMARY. For       34850000
*                                        BPXJCSA, the ALET is HOME.  */ 34900000
*  3 OtcbSysCallCode       Fixed(32), /* System call number          */ 34950000
*  3 OtcbLecb              Ptr(31),   /* Ptr to ECB used to wait for    35000000
*                                        a latch to be obtained      */ 35050000
*  3 OtcbPpsdPtr           Ptr(31),   /* -> PPSD                     */ 35100000
*  5 OtcbPpsd              Ptr(31),   /* -> PPSD                     */ 35150000
*  3 OtcbCtwID             Fixed(32), /* cond_timed_wait stimerm ID  */ 35200000
*  3 OtcbStackNonSw        Ptr(31),   /* Dynamic stack for Non-space    35250000
*                                        switched syscalls.  Only       35300000
*                                        valid when OTCBSYSCALLCODE     35350000
*                                        is non-zero.  Contains         35400000
*                                        address of 1st #SAMAP area     35450000
*                                        following RUCA.  Addressable   35500000
*                                        in user home space.     @D5A*/ 35550000
*  3 OtcbOtim              Ptr(31),   /* -> interval timers      @DGC*/ 35600000
* 2  OtcbOapb              Ptr(31),   /* -> OAPB                 @L1A*/ 35650000
* 2    OtcbMedClear2,                 /* We can't clear Oapb,           35750000
*                                        multiproc quiesce references   35800000
*                                                                @DPA*/ 35850000
*  3 OtcbPtPICParmsPtr     Ptr(31),   /* Pointer to ptrace recovery     35900000
*                                        environment parameters (PIC    35950000
*                                        parms                   @D8A*/ 36000000
*  3 OtcbPtEventID         Fixed(32), /* Ptrace event ID, that          36050000
*                                        identifies why this thread     36100000
*                                        stopped for ptrace      @D8A*/ 36150000
*  3 OtcbPtLclPpsdPtr      Ptr(31),   /* Ptrace local Ppsd pointer      36200000
*                                                                @D8A*/ 36250000
*  3 OtcbMVSpauseECBlist   Ptr(31),   /* Pointer to the BPXZECBL -      36300000
*                                        System copy of user ECB        36350000
*                                        addresses passed to            36400000
*                                        MVSpauseInit            @DAA*/ 36450000
*  3 OtcbSavedScb          Ptr(31),   /* Saved SCB addr of STAI on      36500000
*                                        entry to Local Child Process   36550000
*                                                                @L1A*/ 36600000
*  3 OtcbUECBlist   Ptr(31),          /* Pointer to the BPXZECBL -      36650000
*                                        System copy of user and        36700000
*                                        system ECBs address for the    36750000
*                                        BPXLUKW - User KernWait        36800000
*                                        service                 @DBA*/ 36850000
*  3 OtcbUIDs,                         /* User IDs for Thread    @DTA*/ 36900000
*   5 OtcbRUid             Fixed(32),  /*   Real Uid             @DTA*/ 36950000
*   5 OtcbEUid             Fixed(32),  /*   Effective Uid        @DTA*/ 37000000
*   5 OtcbSUid             Fixed(32),  /*   Saved Uid            @DTA*/ 37050000
*  3 OtcbSavedACEE         Ptr(31),   /* MRPWD saved Acee        @PFA*/ 37100000
*  3 OtcbPprx              Ptr(31),   /* Address of the Pprx, an        37150000
*                                        extension of the Pprt   @DSA*/ 37200000
*  3 OtcbMrPwdUID          Fixed(32), /* Password verified UID   @DHA*/ 37250000
*  3 OtcbPswByt03          Fixed(32), /* Caller's PSW bytes 0-4         37300000
*                                        (Used by JCPR to setup         37350000
*                                        BPXZUSTA)               @PCA*/ 37400000
*  3 OtcbMrPwdUserName     Char(8),   /* Password verified userid       37450000
*                                                                @PCA*/ 37500000
*  3 OtcbSavedSecEnv       Ptr(31), /* Pointer to ACEE saved by BPX1ENV 37550000
*                                      for a toggle request      @PEA*/ 37600000
*  3 OtcbMVSUseridPtr      Ptr(31), /* Pointer to userid of this        37650000
*                                      thread, points to either         37700000
*                                      OtcbLoginNInfo or OasbLoginNInfo 37750000
*                                                                @PEA*/ 37800000
*  3 OtcbLoginNInfo,                  /* Task userid and length  @PEA*/ 37850000
*   5 OtcbLoginNLen        Fixed(31), /* Task userid length      @PEA*/ 37900000
*   5 OtcbLoginName        Char(9),   /* Tasks userid, must be '00'x    37950000
*                                       (null) terminated. Preceding    38000000
*                                       length does not include '       38050000
*                                       terminating null         @PEA*/ 38100000
*  3 OtcbPrin2Flags        Bit(8),   /* This field is modified by       38116600
*                                       BPXPRIN1, and it is used by     38133200
*                                       BPXPRIN2. See PPSQ for the      38149800
*                                       mapping and more details @E1A*/ 38166400
*  3 *                     Char(2),  /* Reserved, keep word bdy  @PEA*/ 38183000
*  3 OtcbThli              Ptr(31),  /* -> Thli.  This field must never 38200000
*                                       change offsets within the Otcb  38250000
*                                       since the Thli is an external   38300000
*                                       control block and the user will 38350000
*                                       have to go through the Otcb to  38400000
*                                       get to the Thli          @DKA*/ 38450000
*  3 OtcbActSctbNodePtr   Ptr(31), /* Active Acee SCTB node ptr, zero   38500000
*                                        if ACEE is private      @DZC*/ 38550000
*  3 OtcbToggledSctbNodePtr  Ptr(31), /* Toggled Acee SCTB node ptr,    38600000
*                                        zero if ACEE is private @DZC*/ 38650000
*  3 OtcbPag               Fixed(32),/* Process Auth Groups          */ 38700000
*  3 OtcbGIDs,                         /* Group IDs for Thread   @DTA*/ 38750000
*   5 OtcbRGid             Fixed(32),  /*   Real Gid             @DTA*/ 38800000
*   5 OtcbEGid             Fixed(32),  /*   Effective Gid        @DTA*/ 38850000
*   5 OtcbSGid             Fixed(32),  /*   Saved Gid            @DTA*/ 38900000
*  3 OtcbRacGidsPtr        Ptr(31),  /* Addr of saved group list @PJA*/ 38950000
*  3 OtcbWLMEToken         Bit(64),  /* WLM Enclave token associated    39000000
*                                       with the thread          @DMA*/ 39050000
*  3 OtcbSavedGid          Fixed(32),/* Gid set by getpwname, used by   39100000
*                                       setgid                   @PIA*/ 39150000
*  3 OtcbAliasNInfo,                                          /* @DUA*/ 39200000
*   5 OtcbAliasNLen        Fixed(31), /* Task alias length       @DUA*/ 39250000
*   5 OtcbAliasName        Char(9),   /* Tasks alias, must be '00'x     39300000
*                                       (null) terminated. Preceding    39350000
*                                       length does not include '       39400000
*                                       terminating null         @DUA*/ 39450000
*  3 *                     Char(3),  /* Reserved, keep word bdy  @DUA*/ 39500000
*  3 OtcbOsenvToken  Char(8) Bdy(Word),  /* osenv environment token     39550000
*                                                                @DVA*/ 39600000
*    5  OtcbOsenvCellPtr   Ptr(31),  /* Ptr to osenv environment        39650000
*                                       cell element             @DVA*/ 39700000
*    5  OtcbOsenvSeqN      Fixed(31),/* seq number associated with      39750000
*                                       the osenv cell           @DVA*/ 39800000
*  3 OtcbReDriveTime       Fixed(32),/* Time to delay signal IRB @DWA*/ 39803200
*  3 OtcbShlLoaderInfo,              /* Shared Library data      @DXA*/ 39806400
*    5 OtcbShlLoader1DspAddr Ptr(31),                                   39809600
*                                   /* Shared Library loader data1 addr 39812800
*                                       in data space            @DXA*/ 39816000
*    5 OtcbShlLoader1DspPages Fixed(32),                                39819200
*                                    /* Shared Library loader data1 len 39822400
*                                       in data space            @DXA*/ 39825600
*    5 OtcbShlLoader1DspAlet Fixed(32),                                 39828800
*                                   /* Shared Library loader data1 alet 39832000
*                                       of data space            @DXA*/ 39835200
*    5 OtcbShlLoader1DspStoken Char(8),                                 39838400
*                                   /* Shared Library loader data1 stkn 39841600
*                                       of data space            @DXA*/ 39844800
*    5 OtcbShlLoader2DspAddr Ptr(31),                                   39848000
*                                   /* Shared Library loader data1 addr 39851200
*                                       in data space            @DXA*/ 39854400
*    5 OtcbShlLoader2DspPages Fixed(32),                                39857600
*                                    /* Shared Library loader data1 len 39860800
*                                       in data space            @DXA*/ 39864000
*    5 OtcbShlLoader2DspAlet Fixed(32),                                 39867200
*                                   /* Shared Library loader data1 alet 39870400
*                                       of data space            @DXA*/ 39873600
*    5 OtcbShlLoader2DspStoken Char(8),                                 39876800
*                                   /* Shared Library loader data1 stkn 39880000
*                                       of data space            @DXA*/ 39883200
*    5 OtcbShlLoaderTok    Char(8),                                     39886400
*                                    /* Shared Library loader token len 39889600
*                                       used by BPXXSHLB INIT    @DXA*/ 39892800
*  3 OtcbSMKLatchFlagCount Fixed(31) ABNORMAL, /* OcvtSMKLatchCount     39894600
*                                      incremented               @PRA*/ 39896400
*  3 OtcbSavePprt          Ptr(31),  /* Addr of Pprt saved during task  39898490
*                                       term when OtcbPprt is changed   39898780
*                                       so that BPXMIPCE can find real  39899070
*                                       Pprt of running task     @03A*/ 39899360
*  3 *                     Char(36), /* Reserved for future use  @03C*/ 39899650
*  3 Otcb_End   Bdy(Dword) Char(0); /* Make CB end on doubleword @PBA*/ 39900000
*                                                                       39950000
*/********************************************************************/ 40000000
*/*                                                                  */ 40050000
*/* NOTE: The "OtcbCopyOnFork" is contiguous to the end of the Otcb. */ 40100000
*/*       IPCS modules respecify its base on the address of Otcb_End */ 40150000
*/*       because the field OtcbCofPtr does NOT contain an address   */ 40200000
*/*       that is usable by IPCS without another ?ASAXACC.           */ 40250000
*/*                                                                  */ 40300000
*/********************************************************************/ 40350000
*DCL                                                                    40400000
* 1 OtcbCopyOnFork Based(OtcbCofPtr) Via(Alet(Otcb)), /* These fields   40450000
*                                       will be copied to the child     40500000
*                                       Otcb on fork()           @PBM*/ 40550000
*   3 OtcbSyscallEntryStatus Ptr(31), /* Ptr to regs and stuff at entry 40600000
*                                        to the syscall layer        */ 40650000
*   3 OtcbUstaPtr          Ptr(31),   /* Pointer to user status area    40700000
*                                        containing the syscall         40750000
*                                        issuer's regs and PSW.         40800000
*                                        (Mapped by BPXZUSTA. Used      40850000
*                                        by ptrace.)                 */ 40900000
*   3 OtcbGroupDbSearch    Char(8),   /* Group name for group data base 40950000
*                                        search (getgrent)       @DEA*/ 41000000
*   3 OtcbUserDbSearch     Char(8),   /* User name for user data base   41050000
*                                        search (getpwent)       @DEA*/ 41100000
*   3 OtcbStorageForCPR    Ptr(31),   /* Dynamic area for BPXJCPR    */ 41150000
*   3 OtcbStorageForCPRKey Fixed(8),  /* Storage key of dynamic area    41200000
*                                        for JCPR                    */ 41250000
*   3 OtcbStorageForCPRLen Fixed(24), /* Length of JCPR dynamic area */ 41300000
*   3 OtcbStorageForCPRSp  Fixed(8),  /* Storage SP of dynamic area  */ 41350000
*   3 OtcbCopyFlags        Bit(8),    /* Copy on Fork Flags      @DFA*/ 41400000
*     5 OtcbSetuidExec     Bit(1),    /* Setuid Exec in progress @DFA*/ 41450000
*     5 OtcbMVSAuthLib     Bit(1),    /* Pgm loaded from MVS authorized 41500000
*                                       library by exec/execmvs  @DFA*/ 41550000
*     5 OtcbExecProcess    Bit(1),    /* This process image was created 41600000
*                                       by exec/execmvs          @DFA*/ 41650000
*     5 OtcbSigPostInPC    Bit(1),    /* Sig IRB will post ThliComECB   41706990
*                                        even when a Linkage Stack is   41713980
*                                        detected, signal will be       41720970
*                                        rescheduled for future         41727960
*                                        delivery                @05A*/ 41734950
*     5 *                  Bit(4),    /* Reserved                @05C*/ 41741940
*   3 *                    Char(2),   /* Reserved                @DFC*/ 41750000
*   3 OtcbDaemonInfo,                 /* This info will be set and      41800000
*                                        reused to improve performance  41850000
*                                        by bypassing multiple RACF     41900000
*                                        calls for the same info @PFM*/ 41950000
*     5 OtcbSavedUID       Fixed(32), /* Remembered UID          @PFM*/ 42000000
*     5 OtcbSavedUserName  Char(8),   /* Remembered UserID       @PFM*/ 42050000
*   3 OtcbWLMUserDataInfo,            /* WLM Server information.  These 42100000
*                                        fields are needed to manage    42150000
*                                        the application data and file  42200000
*                                        descriptor list.  A single     42250000
*                                        area is obtained for both      42300000
*                                        needs.  The area is pointed to 42350000
*                                        by OtcbWLMUserDataPtr. The     42400000
*                                        application data is always     42450000
*                                        first in the area followed by  42500000
*                                        the FDL area.           @PGM*/ 42550000
*     5 OtcbWLMUserDataPtr  Ptr(31),  /* Address of user data storage   42600000
*                                                                @PGM*/ 42650000
*     5 OtcbWLMUserDataLen  Fixed(31),/* Length of user data storage -- 42700000
*                                        the entire area         @PGM*/ 42750000
*     5 OtcbWLMUserDataKey  Fixed(8), /* Key of user data area   @PGM*/ 42800000
*     5 *                   Char(3),  /* reserved                @PGM*/ 42850000
*     5 OtcbWLMApplLen      Fixed(31),/* Length of the application data 42900000
*                                        portion of the user data area. 42950000
*                                        The file descriptors occupy    43000000
*                                        the remainder of the user data 43050000
*                                        area                    @PGM*/ 43100000
*   3 OtcbSMFBuffPtr       Ptr(31),   /* Address of key 0 copy of user  43150000
*                                        SMF record              @DQA*/ 43200000
*   3 OtcbSMFBuffLen       Fixed(31), /* Length of key 0 copy of user   43250000
*                                        SMF record              @DQA*/ 43300000
*   3 OtcbCofEnd Bdy(Dword) Char(0);  /* Make CB end on dword    @PBA*/ 43350000
*   /*****************************************************************/ 43400000
*   /*  **** This is end of "OtcbCopyOnFork" area ****               */ 43450000
*   /*****************************************************************/ 43500000
*                                                               @SPACE; 43550000
*   /*****************************************************************/ 43600000
*   /* The following based area is used by BPXPRGUG and BPXPRSGR.    */ 43650000
*   /* A copy of the last getgroupsbyname will be saved here if done */ 43700000
*   /* after a __passwd() with the same name.                    @PJA*/ 43750000
*   /*****************************************************************/ 43800000
*DCL                                                                    43850000
*  1 OtcbRacGids Based,                                                 43900000
*    3 OtcbRacGidsHeader,                                               43950000
*      5 OtcbRacGidsTotNum Fixed(32),                                   44000000
*      5 OtcbRacGidsCurNum Fixed(32),                                   44050000
*    3 OtcbRacGidsList (*) Fixed(32);                         /* @PJA*/ 44100000
*                                                                       44150000
*                                                                       44200000
*DCL                                                                    44250000
*  Otcb#ID    Char(4)   Constant('OTCB'),  /* Control Block Acronym  */ 44300000
*  Otcb#MedClear2Len Fixed(24) Constant                                 44350000
*                     (Length(OtcbMedClear2)+Length(OtcbCopyOnFork)),   44400000
*                                     /* Length to clear         @DPA*/ 44450000
*  Otcb#Len   Fixed(24) Constant(Length(Otcb)+Length(OtcbCopyOnFork)),  44500000
*                                     /* Length of OTCB          @PBC*/ 44550000
*  Otcb#SP    Fixed(8)  Constant(230);  /* Subpool for the OTCB  @P5C*/ 44600000
*/* End of PL/X Source                                               */ 44650000
* %IF BPXZOTCB_LIST ^= 'NO' &                                           44700000
*    ZCBPRINT ^= 'NO' %THEN                                             44750000
*   %GOTO BPXZOTCB_4;                                                   44800000
*   @LIST POP NOECHO;                                                   44850000
* %BPXZOTCB_4:;                                                         44900000
* %END;                                                                 44950000
