*/*                                                                  */ 00001000
*/*PROPRIETARY V3 STATEMENT                                          */ 00002000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00003000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00004000
*/*5695-DF1                                                          */ 00005000
*/*(C) COPYRIGHT 1992  IBM CORP.                                     */ 00006000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00007500
*/*                                                                  */ 00009000
         MACRO                                                          00010000
&NAME    CAMLST &PAR1,&PAR2,&PAR3,&PAR4,&OPT1,&OPT2,&OPT3,&DSCBTTR=,   *00020000
               &DUMMY=                                                  00030000
         LCLA  &B1,&B2,&B3,&CTR                                         00040000
         LCLB  &P(17),&OP(3),&D(4),&NOGO                            TSO 00042000
         AIF   ('&PAR1' EQ '').E1                                       00044000
         AIF   ('&PAR2' EQ '').E2                                       00046000
.R1      ANOP                                                           00048000
&P(1)    SETB  ('&PAR1' EQ 'CAT' OR '&PAR1' EQ 'CATBX')             TSO 00048400
&P(2)    SETB  ('&PAR1' EQ 'RECAT')                                     00048800
&P(3)    SETB  ('&PAR1' EQ 'UNCAT' OR '&PAR1' EQ 'UCATDX')          TSO 00049200
&P(4)    SETB  ('&PAR1' EQ 'BLDX' OR '&PAR1' EQ 'CATBX')            TSO 00049600
&P(5)    SETB  ('&PAR1' EQ 'BLDG')                                      00049700
&P(6)    SETB  ('&PAR1' EQ 'BLDA')                                      00049800
&P(7)    SETB  ('&PAR1' EQ 'LNKX')                                      00049900
&P(8)    SETB  ('&PAR1' EQ 'DLTX' OR '&PAR1' EQ 'UCATDX')           TSO 00099900
&P(9)    SETB  ('&PAR1' EQ 'DLTA')                                      00109900
&P(10)   SETB  ('&PAR1' EQ 'DRPX')                                      00119900
&P(11)   SETB  ('&PAR1' EQ 'NAME')                                      00129900
&P(12)   SETB  ('&PAR1' EQ 'BLOCK')                                     00139900
&P(13)   SETB  ('&PAR1' EQ 'SEARCH')                                    00141900
&P(14)   SETB  ('&PAR1' EQ 'SEEK')                                      00143900
&P(15)   SETB  ('&PAR1' EQ 'SCRATCH')                                   00145900
&P(16)   SETB  ('&PAR1' EQ 'RENAME')                                    00147900
&P(17)   SETB  ('&DSCBTTR' NE'')                                        00148300
&CTR     SETA  &P(1)+&P(2)+&P(3)+&P(4)+&P(5)+&P(6)+&P(7)+&P(8)+&P(9)    00148700
&CTR     SETA  &CTR+&P(10)+&P(11)+&P(12)+&P(13)+&P(14)+&P(15)+&P(16)    00149100
         AIF   (&CTR EQ 0).E3                                       TSO 00149500
&D(1)    SETB  ('&PAR3' NE '')                                          00149600
&D(2)    SETB  ('&PAR4' NE '')                                          00149700
         AIF   (NOT &D(1) AND (&P(13) OR &P(14) OR &P(16))).E4          00149800
.R3      AIF   (&D(1) AND &P(15)).E5                                    00199800
         AIF   (NOT &D(2) AND (&P(1) OR &P(2) OR &P(6) OR &P(7) OR &P(1X00209800
               1) OR &P(12) OR &P(13) OR &P(14) OR &P(15) OR &P(16))).E 00219800
         AIF   (&P(1) AND &P(4)).R2                                 TSO 00229800
         AIF   (&D(2) AND (&P(3) OR &P(8) OR &P(9) OR &P(10))).E6       00239800
         AIF   (&D(2) AND (&P(3) OR &P(4) OR &P(5) OR &P(8) OR &P(9) ORX00241800
               &P(10))).E6                                              00243800
.R2      AIF   ('&OPT1' EQ '').CONTA                                    00245800
         AIF   ('&OPT1' NE 'DELETE').E7                                 00247800
&OP(1)   SETB  1                                                        00248200
         AIF   (NOT &P(5)).E7                                           00248600
.CONTA   AIF   ('&OPT2' EQ '').CONTB                                    00249000
&OP(2)   SETB  ('&OPT2' EQ 'EMPTY')                                     00249400
&OP(3)   SETB  ('&OPT2' EQ 'OVRD')                                      00249500
         AIF   (&OP(2)+&OP(3)  NE 1).E8                                 00249600
         AIF   (NOT &P(5) AND &OP(2) OR(NOT &P(15) AND &OP(3))).E8      00249700
.CONTB   AIF   ('&OPT3' EQ '' AND &P(5)).E10                            00299700
         AIF   ('&OPT3' NE '' AND NOT &P(5)).E11                        00309700
.CONTB1  AIF   (&P(17) AND NOT (&P(1) OR &P(2))).E12                    00319700
         AIF   (&NOGO EQ 1).END                                         00329700
&B1      SETA  128*&D(1)+64*&D(2)+32*&P(1)+20*&P(2)+8*&P(3)+2*&P(12)    00339700
&D(4)    SETB  (&P(3) OR &P(8))                                     TSO 00341700
&B1      SETA  &B1+4*(&P(11)+&P(5)+&P(6)+&P(7)+&D(4)+&P(9)+&P(10))  TSO 00343700
&D(3)    SETB  (&P(1) OR &P(4))                                     TSO 00345700
&B1      SETA  &B1+4*&D(3)+&P(13)+&P(15)+&P(16)                     TSO 00347700
&B2      SETA  128*&P(14)+64*&P(4)+32*&P(5)+16*&P(6)+8*&P(7)+4*&P(8)+2*X00348100
               &P(17)+&P(9)                                             00348500
&B3      SETA  128*&P(10)+64*&P(15)+32*&P(16)+64*&OP(1)+16*&OP(3)+8*&OPX00348900
               (2)                                                      00349300
&NAME    DS    0F                                ALIGN ON FULL WORD     00349400
         DC    AL1(&B1)                          THREE BYTES OF FLAGS   00349500
         DC    AL1(&B2)                          INDICATING THE FUNC-   00349600
         DC    AL1(&B3)                          TION TO BE PERFORMED   00399600
         AIF   (&P(5)).CONTC                                            00409600
         DC    AL1(0)                            NO OPTION THREE        00419600
         AGO   .CONTD                                                   00429600
.CONTC   DC    AL1(&OPT3)                        NO. OF ENTRIES         00439600
.CONTD   DC    A(&PAR2)                          PARAMETER TWO          00441600
         AIF   (&D(1)).CONTE                                            00443600
         DC    A(0)                              PARAM. THREE OMMITTED  00445600
         AGO   .CONTF                                                   00447600
.CONTE   DC    A(&PAR3)                          PARAMETER THREE        00448000
.CONTF   AIF   (NOT &D(2)).END                                          00448400
         DC    A(&PAR4)                          PARAMETER FOUR         00448800
         AIF   (NOT &P(17)).END                                         00449200
         DC    A(&DSCBTTR)                       PARAMETER FIVE         00449300
         MEXIT                                                          00449400
.E       IHBERMAC 5                     PAR4 MISSING                    00449500
         MEXIT                                                          00499500
.E1      IHBERMAC 2                     PAR1 MISSING                    00509500
         MEXIT                                                          00519500
.E2      IHBERMAC 3                     PAR2 MISSING                    00529500
&NOGO    SETB  1                                                        00539500
         AGO   .R1                                                      00541500
.E3      IHBERMAC 36,,&PAR1             PAR1 INVALID                    00543500
         MEXIT                                                          00545500
.E4      IHBERMAC 4                     PAR3 MISSING                    00547500
&NOGO    SETB  1                                                        00547900
         AGO   .R3                                                      00548300
         MEXIT                                                          00548700
.E5      IHBERMAC 60,,&PAR3             PAR3 W/SCRATCH                  00549100
         MEXIT                                                          00549200
.E6      IHBERMAC 39,,&PAR4             PAR4 NOT ALLOWED                00549300
&NOGO    SETB  1                                                        00549400
         AGO   .R2                                                      00599400
.E7      IHBERMAC 50,,&OPT1             OPTN1 INVALID                   00609400
&NOGO    SETB  1                                                        00619400
         AGO   .CONTA                                                   00629400
.E8      IHBERMAC 51,,&OPT2             OPTN2 INVALID                   00639400
&NOGO    SETB  1                                                        00641400
         AGO   .CONTB                                                   00643400
.E10     IHBERMAC 52                    OPTN3 MISSING                   00645400
         MEXIT                                                          00647400
.E11     IHBERMAC 53,,&OPT3             OPTN3 INVALID                   00647800
&NOGO    SETB  1                                                        00648200
         AGO  .CONTB1                                                   00648600
.E12     IHBERMAC 54,,DSCBTTR           DSCBTTR NOT ALLOWED.            00649000
.END     MEND                                                           00649100
