*/********************************************************************/ 00002800
*/*                                                                  */ 00005600
*/*  $MAC(CBRSMF) COMP(SS) PROD(OAM):                                */ 00008400
*/*                                                                  */ 00011200
*/*  MACRO NAME = CBRSMF.                                            */ 00014000
*/*                                                                  */ 00016800
*/********************************************************************/ 00019600
*/*PROPRIETARY V3 STATEMENT                                          */ 00022400
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00025200
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00028000
*/*5695-DF1                                                          */ 00030800
*/*(C) COPYRIGHT 1997, 1998 IBM CORP.                                */ 00039200
*/*END PROPRIETARY V3 STATEMENT                                      */ 00047600
*/********************************************************************/ 00050400
*/*                                                                  */ 00053200
*/*  STATUS = VERSION 1 RELEASE 4 MODIFICATION 0                     */ 00056000
*/*                                                                  */ 00058800
*/*  DESCRIPTIVE NAME = OAM SMF RECORD MAPPING MACRO.                */ 00061600
*/*                                                                  */ 00064400
*/*  POINTED TO BY = SMF85PTR - LOCAL POINTER DELCARED IN THIS       */ 00067200
*/*                             MAPPING MACRO.                       */ 00070000
*/*                                                                  */ 00072800
*/*  CREATED BY = ALL OAM MODULES RECORDING OAM SMF RECORDS.         */ 00075600
*/*                                                                  */ 00078400
*/*  SERIALIZATION = NONE.                                           */ 00081200
*/*                                                                  */ 00084000
*/*  INVOCATION = ASM:                                               */ 00086800
*/*                                                                  */ 00089600
*/*               CBRSMF                                             */ 00092400
*/*                                                                  */ 00095200
*/*  INVOCATION = PL/X-370: MACRO VARIABLE SMFBASE MAY BE USED TO    */ 00098000
*/*                         SET THE BASING EXPRESSION:               */ 00100800
*/*                                                                  */ 00103600
*/*                        1. WHEN SMFBASE IS NOT SPECIFIED (IT HAS  */ 00106400
*/*                           A NULL VALUE)                          */ 00109200
*/*                                                                  */ 00112000
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00114800
*/*                                                                  */ 00117600
*/*                           CBRSMF85 IS DECLARED AS LOCAL          */ 00120400
*/*                           AUTOMATIC STRUCTURE.                   */ 00123200
*/*                                                                  */ 00126000
*/*                        2. WHEN SMFBASE IS SPECIFIED:             */ 00128800
*/*                                                                  */ 00131600
*/*                           %SMFBASE = 'SMF85PTR'                  */ 00134400
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00137200
*/*                                                                  */ 00140000
*/*                           CBRSMF85 IS BASED ON THE VALUE         */ 00142800
*/*                           ASSIGNED TO MACRO VARIABLE SMFBASE.    */ 00145600
*/*                                                                  */ 00148400
*/*                       THE DEFAULT IS TO INCLUDE THE MAPPING FOR  */ 00151200
*/*                                                                  */ 00154000
*/*                         1. THE STANDARD SMF RECORD HEADER        */ 00156800
*/*                         2. THE OAM PRODUCT IDENTIFICATION SECTION*/ 00159600
*/*                                                                  */ 00162400
*/*                       IF YOU WANT THE SUBTYPE DATA SECTION TO    */ 00165200
*/*                       INCLUDED FOR A PARTICULAR RECORD SUBTYPE,  */ 00168000
*/*                       THEN SET PL/X MACRO VARIABLE SMF85SXX      */ 00170800
*/*                       TO A NON-NULL VALUE.  WHERE XX IS THE      */ 00173600
*/*                       SUBTYPE NUMBER BETWEEN 00 AND 87.          */ 00176400
*/*                                                                  */ 00179200
*/*                       FOR EXAMPLE, TO INCLUDE THE SUBTYPE SECTION*/ 00182000
*/*                       FOR SUBTYPE 1, SET MACRO VARIABLE          */ 00184800
*/*                       SMS85S01 TO A NON-NULL VALUE PRIOR TO      */ 00187600
*/*                       INCLUDING MAPPING MACRO CBRSMF. AS FOLLOWS:*/ 00190400
*/*                                                                  */ 00193200
*/*                           %SMF85S01 = 'YES'                      */ 00196000
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00198800
*/*                                                                  */ 00201600
*/*  CHANGE ACTIVITY = NONE.                                         */ 00204400
*/*                                                                  */ 00207200
*/*  $L0=OAMSMF   140 060194 TUCTWB: OAM SMF RECORDING               */ 00210000
*/*  $P0=K140384  140 121196 TUCBLC: ADD SUBTYPE 88              @P0A*/ 00211400
*/*  $L1=OAMPSS   150 073197 TUCTNN: PARALLEL SYSPLEX SUPPORT    @L1A*/ 00212100
*/*                                                                  */ 00212800
*/********************************************************************/ 00215600
*        %GOTO CBRSMFPL; /*                                             00218400
         MACRO                                                          00221200
&NAME    CBRSMF                                                         00224000
         EJECT                                                          00226800
*********************************************************************** 00229600
*                                                                     * 00232400
* SMF RECORD TYPE 85 - STANDARD SMF RECORD HEADER SUPPORTING SUBTYPES * 00235200
*                                                                     * 00238000
*********************************************************************** 00240800
CBRSMF85 DSECT                     SMF RECORD 85                        00243600
SMF85HDR EQU   *                   HEADER SEGMENT                       00246400
SMF85LEN DS    BL2'0'              RECORD LENGTH                        00249200
SMF85SEG DS    BL2'0'              SEGMENT DESCRIPTOR                   00252000
SMF85FLG DS    BL1'0'              HEADER FLAG BYTE                     00254800
SMF85FL1 EQU   X'40'               SUBTYPE ARE VALID                    00257600
SMF85RTY DS    BL1'0'              RECORD TYPE 85                       00260400
SMF85TME DS    BL4'0'              TIME SINCE MIDNIGHT, IN HUNDREDTHS   00263200
*                                  OF SECOND, RECORD WAS PRESENTED      00266000
*                                  TO SMF                               00268800
SMF85DTE DS    PL4'0000'           DATE RECORD WAS PRESENTED TO SMF,    00271600
*                                  IN THE FORM OCYYDDDF, WHERE F IS     00274400
*                                  THE SIGN.                            00277200
SMF85SID DS    CL4' '              SYSTEM IDENTIFICATION (FROM SID      00280000
*                                  PARAMETER)                           00282800
SMF85SSI DS    CL4' '              SUBSYSTEM IDENTIFICATION,            00285600
*                                  CONTAINS 'OAM ' FOR ALL OAM          00288400
*                                  SMF RECORDS.                         00291200
SMF85STY DS    CL2' '              RECORD SUBTYPE                       00294000
SMF85TRN DS    BL2'0'              NUMBER OF TRIPLETS IN THIS           00296800
*                                  RECORD.  A TRIPLET IS A SET OF       00299600
*                                  OFFSET/LENGTH/VALUES THAT DEFINE     00302400
*                                  A SECTION OF THE RECORD.             00305200
SMF85PSO DS    BL4'0'              OFFSET TO OAM PRODUCT IDENTIFICATION 00308000
*                                  SECTION                              00310800
SMF85PSL DS    BL2'0'              LENGTH OF OAM PRODUCT IDENTIFICATION 00313600
*                                  SECTION                              00316400
SMF85PSN DS    BL2'0'              NUMBER OF OAM PRODUCT IDENTIFICATION 00319200
*                                  SECTIONS                             00322000
SMF85OSO DS    BL4'0'              OFFSET TO OAM SUBTYPE DATA SECTION   00324800
SMF85OSL DS    BL2'0'              LENGTH OF OAM SUBYTPE DATA SECTION   00327600
SMF85OSN DS    BL2'0'              NUMBER OF OAM SUBTYPE DATA SECTIONS  00330400
         DS    CL6' '              RESERVED                             00333200
SMF85END DS    0C                  END OF SMF RECORD 85 HEADER          00336000
         EJECT                                                          00338800
*********************************************************************** 00341600
*                                                                     * 00344400
* SMF RECORD TYPE 85 - OAM PRODUCT IDENTIFICATION SECTION             * 00347200
*                                                                     * 00350000
*********************************************************************** 00352800
SMF85PIS DSECT                    PRODUCT IDENTIFICATION SECTION        00355600
R85PCID  DS    CL9' '             COMPONENT ID FOR OAM. FOR             00358400
*                                 DFSMS/MVS CONTAINS THE                00361200
*                                 CHARACTERS '5695DF180'.               00364000
R85PVID  DS    BL1'0'             VERSION NUMBER FOR DFSMS/MVS,         00366800
*                                 IN BINARY                             00369600
R85PRID  DS    BL1'0'             RELEASE NUMBER FOR DFSMS/MVS,         00372400
*                                 IN BINARY                             00375200
R85PMID  DS    BL1'0'             MODIFICATION LEVEL FOR DFSMS/MVS      00378000
*                                 IN BINARY                             00380800
R85PFMID DS    CL8' '             SMP/E FMID FOR OAM                    00383600
         DS    CL4' '             RESERVED                              00386400
R85PCPUI DS    CL8' '             CPU ID AS STORED BY STIPD             00389200
R85PJOBN DS    CL8' '             JOB NAME                              00392000
R85PSTPN DS    CL8' '             STEP NAME                             00394800
R85PPRCN DS    CL8' '             PROCEDURE NAME                        00397600
R85PPGMN DS    CL8' '             PROGRAM NAME                          00400400
R85USRID DS    CL8' '             USER IDENTIFICATION                   00403200
R85PTRXN DS    CL8' '             TRANSACTION NAME                      00406000
R85PSTRT DS    CL8' '             STARTING TIME OF FUNCTION, IN         00408800
*                                 8-BYTE S/390 STORE CLOCK (STCK)       00411600
*                                 INSTRUCTION FORMAT.                   00414400
R85PENDT DS    CL8' '             ENDING TIME OF FUNCTION, IN           00417200
*                                 8-BYTE S/390 STORE CLOCK (STCK)       00420000
*                                 INSTRUCTION FORMAT.                   00422800
R85PRESP DS    BL4'0'             ELASPED TIME OF FUNCTION,             00425600
*                                 IN MILLISECONDS (.001                 00428400
*                                 SECOND UNITS)                         00431200
         DS    CL12' '            RESERVED                              00434000
R85PEND  DS    0C                 END OF OAM PRODUCT ID SECTION         00436800
         EJECT                                                          00439600
*********************************************************************** 00442400
*                                                                     * 00445200
* OAM SUBTYPE SECTION, FOR SUBTYPES 1 - 7.                            * 00448000
*                                                                     * 00450800
* SUBTYPE FUNCTION                                                    * 00453600
* ------- ---------------------------------------------------         * 00456400
*       1 OSREQ ACCESS                                                * 00459200
*       2 OSREQ STORE                                                 * 00462000
*       3 OSREQ RETRIEVE                                              * 00464800
*       4 OSREQ QUERY                                                 * 00467600
*       5 OSREQ CHANGE                                                * 00470400
*       6 OSREQ DELETE                                                * 00473200
*       7 OSREQ UNACCESS                                              * 00476000
*                                                                     * 00478800
*********************************************************************** 00481600
ST1      DSECT                    SUBTYPES 1 - 7                        00484400
ST1COLN  DS    CL44' '            COLLECTION NAME                       00487200
ST1OBJN  DS    CL44' '            OBJECT NAME                           00490000
ST1SGN   DS    CL8' '             STORAGE GROUP NAME                    00492800
ST1SCN   DS    CL8' '             STORAGE CLASS NAME                    00495600
ST1MCN   DS    CL8' '             MANAGEMENT CLASS NAME                 00498400
ST1OFF   DS    BL4'0'             OFFSET FOR PARTIAL OBJECT             00501200
*                                 RETRIEVE (SUBTYPE 3), ZERO FOR        00504000
*                                 ALL OTHERS.                           00506800
ST1LEN   DS    BL4'0'             LENGTH,                               00509600
*                                 SUBTYPE 1 - UNUSED                    00512400
*                                 SUBTYPE 2 - LENGTH OF OBJECT STORED   00515200
*                                 SUBTYPE 3 - NUMBER OF BYTES RETRIEVED 00518000
*                                 SUBTYPE 4 - NUMBER OF QEL ELEMENTS    00520800
*                                             RETURNED.                 00523600
*                                 SUBTYPE 5 - UNUSED                    00526400
*                                 SUBTYPE 6 - LENGTH OF OBJECT DELETED  00529200
*                                 SUBTYPE 7 - UNUSED                    00532000
ST1TTOK  DS    CL16' '            OSREQ TRACKING TOKEN, SUPPLIED        00534800
*                                 WITH TTOKEN KEYWORD ON OSREQ          00537600
*                                 MACRO                                 00540400
ST1TOK   DS    CL8' '             OSREQ ACCESS TOKEN                    00543200
ST1VSN   DS    CL6' '             VOLUME SERIAL NUMBER                  00546000
ST1VMT   DS    CL2' '             VOLUME MEDIA TYPE                     00548800
ST1RC    DS    BL4'0'             OSREQ RETURN CODE, IN REGISTER 15     00551600
*                                 FOLLOWING OSREQ MACRO                 00554400
ST1RS    DS    BL4'0'             OSREQ REASON CODE, IN REGISTER 15     00557200
*                                 FOLLOWING OSREQ MACRO                 00560000
ST1FLGS  DS    BL4'0'             PROCESSING FLAGS. MEANING             00562800
*                                 DEPENDENT ON RECORD SUBTYPE.          00565600
*********************************************************************** 00568400
*                                                                     * 00571200
* SUBTYPE 2 - OSREQ STORE FLAGS                                       * 00574000
*                                                                     * 00576800
*********************************************************************** 00579600
ST2FLGS0 EQU   X'80'             OBJECT STORE TO DASD                   00582400
ST2FLGS1 EQU   X'40'             OBJECT STORE TO OPTICAL                00585200
ST2FLGS2 EQU   X'20'             OBJECT STORE TO TAPE                   00588000
ST2FLGS3 EQU   X'10'             UNUSED                                 00590800
ST2FLGS4 EQU   X'08'             UNUSED                                 00593600
ST2FLGS5 EQU   X'04'             WHEN ON, THE OSREQ STORE               00596400
*                                REQUEST RESULTED IN THE MOUNTING       00599200
*                                OF A SHELF-RESIDENT REMOVABLE          00602000
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00604800
*                                BY A HUMAN OPERATOR. ONLY VALID        00607600
*                                IF BIT 1 OR 2 IS ON.                   00610400
ST2FLGS6 EQU   X'02'             WHEN ON, THE OSREQ STORE               00613200
*                                REQUEST RESULTED IN THE MOUNTING       00616000
*                                OF A LIBRARY-RESIDENT REMOVABLE        00618800
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00621600
*                                BY A HUMAN OPERATOR. ONLY VALID        00624400
*                                IF BIT 1 OR 2 IS ON.                   00627200
ST2FLGS7 EQU   X'01'             WHEN ON, THE OSREQ STORE               00630000
*                                REQUEST WAS SATISIFIED USING           00632800
*                                AN ALREADY MOUNTED REMOVEABLE          00635600
*                                MEDIA VOLUME (TAPE OR OPTICAL).        00638400
*                                ONLY VALID                             00641200
*                                IF BIT 1 OR 2 IS ON.                   00644000
*********************************************************************** 00646800
*                                                                     * 00649600
* SUBTYPE 3 - OSREQ RETRIEVE FLAGS                                    * 00652400
*                                                                     * 00655200
*********************************************************************** 00658000
ST3FLGS0 EQU    X'80'            WHEN ON, PRIMARY COPY OF OBJECT        00660800
*                                RETRIEVED FROM DASD.                   00663600
ST3FLGS1 EQU    X'40'            WHEN ON, PRIMARY COPY OF OBJECT        00666400
*                                RETRIEVED FROM OPTICAL.                00669200
ST3FLGS2 EQU    X'20'            WHEN ON, PRIMARY COPY OF OBJECT        00672000
*                                RETRIEVED FROM TAPE.                   00674800
ST3FLGS3 EQU    X'10'            WHEN ON, THE BACKUP COPY WAS           00677600
*                                RETRIEVED FROM OPTICAL AS A            00680400
*                                RESULT OF VIEW=BACKUP BEING            00683200
*                                SPECIFIED ON THE OSREQ MACRO.          00686000
ST3FLGS4 EQU    X'08'            WHEN ON, THE BACKUP COPY WAS           00688800
*                                RETRIEVED FROM TAPE AS A               00691600
*                                RESULT OF VIEW=BACKUP BEING            00694400
*                                SPECIFIED ON THE OSREQ MACRO.          00697200
ST3FLGS5 EQU    X'04'            WHEN ON, THE BACKUP COPY WAS           00700000
*                                RETRIEVED FROM OPTICAL AS A            00702800
*                                RESULT OF THE PRIMARY COPY             00705600
*                                OF THE OBJECT RESIDING ON AN           00708400
*                                UNREADABLE OPTICAL DISK VOLUME         00711200
*                                AND THE AUTOMATIC ACCESS TO            00714000
*                                BACKUP FACILITY WAS ACTIVE.            00716800
ST3FLGS6 EQU    X'02'            WHEN ON, THE BACKUP COPY WAS           00719600
*                                RETRIEVED FROM TAPE AS A               00722400
*                                RESULT OF THE PRIMARY COPY             00725200
*                                OF THE OBJECT RESIDING ON AN           00728000
*                                UNREADABLE OPTICAL DISK VOLUME         00730800
*                                AND THE AUTOMATIC ACCESS TO            00733600
*                                BACKUP FACILITY WAS ACTIVE.            00736400
ST3FLGS7 EQU    X'01'            WHEN ON, THE OSREQ RETRIEVE            00739200
*                                REQUEST RESULTED IN THE MOUNTING       00742000
*                                OF A SHELF-RESIDENT REMOVABLE          00744800
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00747600
*                                BY A HUMAN OPERATOR. ONLY VALID        00750400
*                                IF BIT 1, 2, 3, 5 OR 6 IS ON.          00753200
ST3FLGS8 EQU    X'80'            WHEN ON, THE OSREQ RETRIEVE            00756000
*                                REQUEST RESULTED IN THE MOUNTING       00758800
*                                OF A LIBRARY-RESIDENT REMOVABLE        00761600
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00764400
*                                BY A HUMAN OPERATOR. ONLY VALID        00767200
*                                IF BIT 1, 2, 3, 5 OR 6 IS ON.          00770000
ST3FLGS9 EQU    X'40'            WHEN ON, THE OSREQ RETRIEVE            00772800
*                                REQUEST WAS SATISIFIED USING           00775600
*                                AN ALREADY MOUNTED REMOVEABLE          00778400
*                                MEDIA VOLUME (TAPE OR OPTICAL).        00781200
*                                ONLY VALID                             00784000
*                                IF BIT 1, 2, 3, 5 OR 6 IS ON.          00786800
*********************************************************************** 00789600
*                                                                     * 00792400
* SUBTYPE 4 - OSREQ QUERY FLAGS                                       * 00795200
*                                                                     * 00798000
*********************************************************************** 00800800
*********************************************************************** 00803600
*                                                                     * 00806400
* SUBTYPE 5 - OSREQ CHANGE FLAGS                                      * 00809200
*                                                                     * 00812000
*********************************************************************** 00814800
ST5FLG0  EQU    X'80'            WHEN ON, MANAGEMENT CLASS              00817600
*                                SPECIFIED ON OSREQ CHANGE.             00820400
ST5FLG1  EQU    X'40'            WHEN ON, STORAGE CLASS                 00823200
*                                SPECIFIED ON OSREQ CHANGE.             00826000
ST5FLG2  EQU    X'20'            WHEN ON, RETENTION PERIOD              00828800
*                                SPECIFIED ON OSREQ CHANGE.             00831600
*********************************************************************** 00834400
*                                                                     * 00837200
* SUBTYPE 6 - OSREQ DELETE FLAGS                                      * 00840000
*                                                                     * 00842800
*********************************************************************** 00845600
ST6FLG0  EQU    X'80'            WHEN ON, PRIMARY COPY OF OBJECT        00848400
*                                DELETED FROM DASD.                     00851200
ST6FLG1  EQU    X'40'            WHEN ON, PRIMARY COPY OF OBJECT        00854000
*                                DELETED FROM OPTICAL.                  00856800
ST6FLG2  EQU    X'20'            WHEN ON, PRIMARY COPY OF OBJECT        00859600
*                                DELETED FROM TAPE.                     00862400
ST6FLG3  EQU    X'10'            WHEN ON, BACKUP COPY OF OBJECT         00865200
*                                DELETED FROM OPTICAL.                  00868000
ST6FLG4  EQU    X'08'            WHEN ON, BACKUP COPY OF OBJECT         00870800
*                                DELETED FROM TAPE.                     00873600
*********************************************************************** 00876400
*                                                                     * 00879200
* SUBTYPE 7 - OSREQ UNACCESS FLAGS                                    * 00882000
*                                                                     * 00884800
*********************************************************************** 00887600
         EJECT                                                          00890400
*********************************************************************** 00893200
*                                                                     * 00896000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 32 - 35                         * 00898800
*                                                                     * 00901600
*   SUBTYPE FUNCTION                                                  * 00904400
*   ------- ---------------------------------------------------       * 00907200
*        32 OSMC STORAGE GROUP PROCESSING                             * 00910000
*        33 OSMC DASD SPACE MANAGEMENT PROCESSING                     * 00912800
*        34 OSMC OPTICAL DISK RECOVERY UTILITY                        * 00915600
*        35 OSMC MOVE VOLUME (MOVEVOL) UTILITY                        * 00918400
*                                                                     * 00921200
*********************************************************************** 00924000
ST32     DSECT                   SUBTYPES 32 - 35                       00926800
ST32SGN  DS     CL8' '           STORAGE GROUP NAME                     00929600
ST32VSN0 DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        00932400
*                                VOLUME. ONLY VALID FOR SUBTYPES        00935200
*                                34 AND 35, CONTAINS BLANKS FOR         00938000
*                                OTHER SUBTYPES.                        00940800
ST32VSN1 DS     CL6' '           VOLUME SERIAL NUMBER OF OPPOSITE       00943600
*                                SIDE OF OPTICAL DISK                   00946400
*                                VOLUME. ONLY VALID FOR SUBTYPES        00949200
*                                34 AND 35, CONTAINS BLANKS FOR         00952000
*                                OTHER SUBTYPES.                        00954800
ST32OMT  DS     CL2' '           OPTICAL MEDIA TYPE. ONLY VALID         00957600
*                                FOR SUBTYPES 34 AND 35, CONTAINS       00960400
*                                BLANKS FOR OTHER SUBTYPES.             00963200
         DS     CL2' '           RESERVED                               00966000
*********************************************************************** 00968800
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           00971600
* DELETED FROM DASD.                                                    00974400
*********************************************************************** 00977200
ST32PDWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              00980000
*                                WRITTEN TO DASD.                       00982800
ST32PDWK DS     BL4'0'           NUMBER OF KILOBYTES PRIMARY            00985600
*                                OBJECTS WRITTEN TO DASD.               00988400
ST32PDRO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              00991200
*                                READ FROM DASD.                        00994000
ST32PDRK DS     BL4'0'           NUMBER OF KILOBYTES PRIMARY            00996800
*                                OBJECTS READ FROM DASD.                00999600
ST32PDDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01002400
*                                DELETED FROM DASD.                     01005200
ST32PDDK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01008000
*                                OBJECTS DELETED FROM DASD.             01010800
*********************************************************************** 01013600
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           01016400
* DELETED FROM OPTICAL.                                                 01019200
*********************************************************************** 01022000
ST32POWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01024800
*                                WRITTEN TO OPTICAL.                    01027600
ST32POWK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01030400
*                                OBJECTS WRITTEN TO OPTICAL.            01033200
ST32PORO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01036000
*                                READ FROM OPTICAL.                     01038800
ST32PORK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01041600
*                                OBJECTS READ FROM OPTICAL.             01044400
ST32PODO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01047200
*                                DELETED FROM OPTICAL.                  01050000
ST32PODK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01052800
*                                OBJECTS DELETED FROM OPTICAL.          01055600
*********************************************************************** 01058400
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           01061200
* DELETED FROM TAPE.                                                    01064000
*********************************************************************** 01066800
ST32PTWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01069600
*                                WRITTEN TO TAPE.                       01072400
ST32PTWK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01075200
*                                OBJECTS WRITTEN TO TAPE.               01078000
ST32PTRO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01080800
*                                READ FROM TAPE.                        01083600
ST32PTRK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01086400
*                                OBJECTS READ FROM TAPE.                01089200
ST32PTDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01092000
*                                LOGICALLY DELETED FROM TAPE.           01094800
ST32PTDK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01097600
*                                OBJECTS LOGICALLY DELETED FROM         01100400
*                                TAPE.                                  01103200
*********************************************************************** 01106000
* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND            01108800
* DELETED FROM OPTICAL.                                                 01111600
*********************************************************************** 01114400
ST32BOWO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01117200
*                                WRITTEN TO OPTICAL.                    01120000
ST32BOWK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01122800
*                                OBJECTS WRITTEN TO OPTICAL.            01125600
ST32BORO DS     BL4'0'           NUMBER OF BACKUP OBJECTS               01128400
*                                READ FROM OPTICAL.                     01131200
ST32BORK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01134000
*                                OBJECTS READ FROM OPTICAL.             01136800
ST32BODO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01139600
*                                DELETED FROM OPTICAL.                  01142400
ST32BODK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01145200
*                                OBJECTS DELETED FROM OPTICAL.          01148000
*********************************************************************** 01150800
* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND            01153600
* DELETED FROM TAPE.                                                    01156400
*********************************************************************** 01159200
ST32BTWO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01162000
*                                WRITTEN TO TAPE.                       01164800
ST32BTWK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01167600
*                                OBJECTS WRITTEN TO TAPE.               01170400
ST32BTRO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01173200
*                                READ FROM TAPE.                        01176000
ST32BTRK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01178800
*                                OBJECTS READ FROM TAPE.                01181600
ST32BTDO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01184400
*                                LOGICALLY DELETED FROM TAPE.           01187200
ST32BTDK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01190000
*                                OBJECTS LOGICALLY DELETED FROM         01192800
*                                TAPE.                                  01195600
*********************************************************************** 01198400
* COUNTS OF ACTIVITY AGAINST THE OBJECT STORAGE DATABASE                01201200
* (OBJECT DIRECTORY TABLE, 4K OBJECT STORAGE TABLE AND 32K              01204000
* OBJECT STORAGE TABLE).                                                01206800
*********************************************************************** 01209600
ST32DTUP DS     BL4'0'           NUMBER OF ROWS UPDATED IN THE          01212400
*                                OBJECT DIRECTORY TABLE.                01215200
ST32DTDE DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01218000
*                                OBJECT DIRECTORY TABLE.                01220800
ST324KIN DS     BL4'0'           NUMBER OF ROWS INSERTED INTO THE       01223600
*                                4K OBJECT STORAGE TABLE.               01226400
ST324KDE DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01229200
*                                4K OBJECT STORAGE TABLE.               01232000
ST3232KI DS     BL4'0'           NUMBER OF ROWS INSERTED INTO THE       01234800
*                                32K OBJECT STORAGE TABLE.              01237600
ST3232KD DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01240400
*                                32K OBJECT STORAGE TABLE.              01243200
ST32NCE  DS     BL4'0'           NUMBER OF OPTICAL CARTRIDGES           01246000
*                                EXPIRED.  VALID ONLY FOR               01248800
*                                SUBTYPE 32.                            01251600
ST32FLGS DS     BL4'0'           PROCESSING FLAGS                       01254400
ST32FLG0 EQU    X'80'            WHEN ON, THIS PROCESS WAS              01257200
*                                INVOKED AUTOMATICALLY UNDER            01260000
*                                SOFTWARE CONTROL.                      01262800
ST32FLG1 EQU    X'40'            WHEN ON, THIS PROCESS WAS              01265600
*                                INVOKED BY A MODIFY OAM,START          01268400
*                                COMMAND.                               01271200
ST32FLG2 EQU    X'20'            WHEN ON, THIS PROCESS WAS              01274000
*                                INVOKED USING AN ISMF LINE             01276800
*                                OPERATOR.                              01279600
         EJECT                                                          01282400
*********************************************************************** 01285200
*                                                                     * 01288000
*   OAM SUBTYPE SECTION, FOR SUBTYPE 36                               * 01290800
*                                                                     * 01293600
*   SUBTYPE FUNCTION                                                  * 01296400
*   ------- ---------------------------------------------------       * 01299200
*        36 OSMC SINGLE OBJECT RECOVERY UTILITY                       * 01302000
*                                                                     * 01304800
*********************************************************************** 01307600
ST36     DSECT                   SUBTYPE 36                             01310400
ST36COLN DS     CL44' '          COLLECTION NAME                        01313200
ST36CNID DS     BL4'0'           COLLECTION ID                          01316000
ST36OBJN DS     CL44' '          OBJECT NAME                            01318800
ST36SGN  DS     CL8' '           STORAGE GROUP NAME                     01321600
ST36OLEN DS     BL4'0'           OBJECT LENGTH                          01324400
ST36BVSN DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        01327200
*                                VOLUME OR TAPE VOLUME FROM WHICH       01330000
*                                THE BACKUP COPY OF THE OBJECT          01332800
*                                WAS READ.                              01335600
ST36BMT  DS     CL2' '           MEDIA TYPE OF THE VOLUME FROM          01338400
*                                WHICH THE BACKUP COPY OF THE           01341200
*                                BACKUP COPY OF THE OBJECT WAS          01344000
*                                READ.                                  01346800
ST36BTKN DS     BL4'0'           VOLUME LOCATION TOKEN ASSOCIATED       01349600
*                                WITH BACKUP COPY OF THE OBJECT         01352400
*                                ON THE VOLUME SPECIFIED IN THE         01355200
*                                ST36BVSN FIELD.                        01358000
ST36TVSN DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        01360800
*                                VOLUME OR TAPE VOLUME TO WHICH         01363600
*                                THE NEW PRIMARY COPY OF THE            01366400
*                                OBJECT WAS WRITTEN.  THIS FIELD        01369200
*                                CONTAINS BLANKS IF THE NEW             01372000
*                                PRIMARY COPY WAS WRITTEN TO            01374800
*                                DASD.                                  01377600
ST36TMT  DS     CL2' '           MEDIA TYPE OF THE VOLUME TO            01380400
*                                WHICH THE NEW PRIMARY COPY OF          01383200
*                                OBECT WAS WRITTEN.                     01386000
ST36OVSN DS     CL6' '           VOLUME SERIAL NUMBER OF THE            01388800
*                                ORIGINAL OPTICAL OR TAPE VOLUME        01391600
*                                ON WHICH THE PRIMARY COPY OF THE       01394400
*                                OBJECT RESIDED PRIOR TO THE            01397200
*                                START OF THE SINGLE OBJECT             01400000
*                                RECOVERY UTILITY.  THIS FIELD          01402800
*                                CONTAINS BLANKS, IF THE PRIMARY        01405600
*                                COPY OF THE OBJECT CURRENTLY           01408400
*                                RESIDES ON DASD.                       01411200
ST36OMT  DS     CL2' '           MEDIA TYPE OF THE ORIGINAL             01414000
*                                OPTICAL OR TAPE VOLUME ON WHICH        01416800
*                                THE PRIMARY COPY OF THE OBJECT         01419600
*                                RESIDED PRIOR TO THE START OF          01422400
*                                THE SINGLE OBJECT RECOVERY             01425200
*                                UTILITY.  THIS FIELD                   01428000
*                                CONTAINS BLANKS, IF THE PRIMARY        01430800
*                                COPY OF THE OBJECT CURRENTLY           01433600
*                                RESIDES ON DASD.                       01436400
ST36FLGS DS     BL4'0'           PROCESSING FLAGS, ALL BITS             01439200
*                                CURRENTLY RESERVED.                    01442000
         EJECT                                                          01444800
*********************************************************************** 01447600
*                                                                     * 01450400
*   OAM SUBTYPE SECTION, FOR SUBTYPE 37                               * 01453200
*                                                                     * 01456000
*   SUBTYPE FUNCTION                                                  * 01458800
*   ------- ---------------------------------------------------       * 01461600
*        37 OSMC LIBRARY SPACE MANAGEMENT UTILITY                     * 01464400
*                                                                     * 01467200
*********************************************************************** 01470000
ST37     DSECT                   SUBTYPE 37                             01472800
ST37LIBN DS     CL8' '           OPTICAL LIBRARY NAME                   01475600
ST37LIBD DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01478400
ST37NOCE DS     BL4'0'           NUMBER OF OPTICAL DISK                 01481200
*                                CARTRIDGES EJECTED.                    01484000
ST37FLGS DS     BL4'0'           PROCESSING FLAGS                       01486800
ST37FLG0 EQU    X'80'            WHEN ON, LIBRARY SPACE MANAGEMENT      01489600
*                                WAS INVOKED AUTOMATICALLY UNDER        01492400
*                                SOFTWARE CONTROL, DUE TO A             01495200
*                                "STORAGE GROUP OUT-OF-SPACE"           01498000
*                                CONDITION IN THE SPECIFIED             01500800
*                                LIBRARY.                               01503600
ST37FLG1 EQU    X'40'            WHEN ON, LIBRARY SPACE MANAGEMENT      01506400
*                                WAS INVOKED BY A "F OAM,START          01509200
*                                LIBMGT,LIBNAME" COMMAND ISSUED         01512000
*                                FROM AN MVS CONSOLE.                   01514800
         EJECT                                                          01517600
*********************************************************************** 01520400
*                                                                     * 01523200
*   OAM SUBTYPE SECTION, FOR SUBTYPES 64 - 67                         * 01526000
*                                                                     * 01528800
*   SUBTYPE FUNCTION                                                  * 01531600
*   ------- ---------------------------------------------------       * 01534400
*        64 LCS OPTICAL OPTICAL DRIVE VARY ONLINE                     * 01537200
*        65 LCS OPTICAL OPTICAL DRIVE VARY OFFLINE                    * 01540000
*        66 LCS OPTICAL OPTICAL LIBRARY VARY ONLINE                   * 01542800
*        67 LCS OPTICAL OPTICAL LIBRARY VARY OFFLINE                  * 01545600
*                                                                     * 01548400
*********************************************************************** 01551200
ST64     DSECT                   SUBTYPES 64 - 67                       01554000
ST64OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   01556800
ST64OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01559600
ST64OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01562400
*                                TO THE OPTICAL LIBRARY                 01565200
ST64ODN  DS     CL8' '           OPTICAL DRIVE NAME, ONLY VALID         01568000
*                                FOR SUBTYPES 64 AND 65.                01570800
ST64ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE, ONLY        01573600
*                                VALID FOR SUBTYPES 64 AND 65.          01576400
ST64ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01579200
*                                TO THE OPTICAL DRIVE.  ONLY            01582000
*                                VALID FOR SUBTYPES 64 AND 65.          01584800
ST64VSN0 DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER OF        01587600
*                                CURRENTLY MOUNTED VOLUME.              01590400
*                                VALID FOR SUBTYPES 64 AND 65,          01593200
*                                CONTAINS BLANKS FOR OTHER              01596000
*                                SUBTYPES.                              01598800
ST64VSN1 DS     CL6' '           OPPOSITE SIDE OF                       01601600
*                                CURRENTLY MOUNTED VOLUME.              01604400
*                                VALID FOR SUBTYPES 64 AND 65,          01607200
*                                CONTAINS BLANKS FOR OTHER              01610000
*                                SUBTYPES.                              01612800
ST64OMT  DS     CL2' '           OPTICAL MEDIA TYPE OF CURRENTLY        01615600
*                                MOUNTED OPTICAL VOLUME.                01618400
ST64ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         01621200
*                                RESIDENT, S=STANDALONE.                01624000
*                                VALID FOR SUBTYPES 64 AND 65,          01626800
*                                CONTAINS BLANKS FOR OTHER              01629600
*                                SUBTYPES.                              01632400
ST64OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   01635200
*                                G = OBJECT STORAGE GROUP,              01638000
*                                B = OBJECT BACKUP STOR GROUP,          01640800
*                                S = SCRATCH OPTICAL VOLUME.            01643600
*                                VALID FOR SUBTYPES 64 AND 65,          01646400
*                                CONTAINS BLANKS FOR OTHER              01649200
*                                SUBTYPES.                              01652000
ST64SGN  DS     CL8' '           STORAGE GROUP NAME.  ONLY VALID        01654800
*                                IF ST64VSN0 CONTAINS VOLSER,           01657600
*                                BLANKS OTHERWISE.                      01660400
*                                VALID FOR SUBTYPES 64 AND 65,          01663200
*                                CONTAINS BLANKS FOR OTHER              01666000
*                                SUBTYPES.                              01668800
ST64LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01671600
*                                THIS REQUEST SPENT ON THE LCS          01674400
*                                INPUT-WORK-QUEUE WAITING TO            01677200
*                                PROCESSED.                             01680000
ST64LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01682800
*                                THIS REQUEST SPENT ON THE LCS          01685600
*                                DISPATCHER-QUEUE WAITING TO            01688400
*                                PROCESSED.                             01691200
ST64LEQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01694000
*                                THIS REQUEST SPENT ON THE LCS          01696800
*                                EXECUTION-QUEUE BEING                  01699600
*                                PROCESSED.                             01702400
ST64LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               01705200
*                                AMOUNT OF TIME (IN MILLISECONDS)       01708000
*                                THIS REQUEST SPENT ON THE LCS          01710800
*                                LIBRARY TASK QUEUE (LQE QUEUE)         01713600
*                                WAITING TO BE PROCESSED.               01716400
*                                NORMALLY, THIS FIELD REPRESENTS        01719200
*                                CARTRIDGES TRANSPORT MECHANISM         01722000
*                                WAIT TIME.  THAT IS, THE AMOUNT        01724800
*                                OF TIME WAITING FOR THE CARTRIDGE      01727600
*                                TRANSPORT MECHANISM (ROBOT) TO         01730400
*                                BECOME AVAILABLE WITHIN AN             01733200
*                                AUTOMATED STORAGE LIBRARY.             01736000
ST64LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          01738800
*                                AMOUNT OF TIME (IN MILLISECONDS)       01741600
*                                THIS REQUEST TOOK TO BE                01744400
*                                PROCESSED BY THE LIBRARY TASK.         01747200
*                                WAITING TO BE PROCESSED.               01750000
*                                NORMALLY, THIS FIELD REPRESENTS        01752800
*                                CARTRIDGES TRANSPORT MECHANISM         01755600
*                                SERVICE TIME.  THAT IS, THE            01758400
*                                TIME SPENT BY THE                      01761200
*                                CARTRIDGE TRANSPORT MECHANISM          01764000
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      01766800
*                                THE OPTICAL DISK LIBRARY.              01769600
ST64RC   DS     BL4'0'           LCS RETURN CODE                        01772400
ST64RS   DS     BL4'0'           LCS REASON CODE                        01775200
ST64FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            01778000
         EJECT                                                          01780800
*********************************************************************** 01783600
*                                                                     * 01786400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 68 - 71                         * 01789200
*                                                                     * 01792000
*   SUBTYPE FUNCTION                                                  * 01794800
*   ------- ---------------------------------------------------       * 01797600
*        68 LCS OPTICAL CARTRIDGE ENTRY                               * 01800400
*        69 LCS OPTICAL CARTRIDGE EJECT                               * 01803200
*        70 LCS OPTICAL CARTRIDGE LABEL                               * 01806000
*        71 LCS OPTICAL VOLUME AUDIT                                  * 01808800
*        72 LCS OPTICAL VOLUME MOUNT                                  * 01811600
*        73 LCS OPTICAL VOLUME DEMOUNT                                * 01814400
*                                                                     * 01817200
*********************************************************************** 01820000
ST68     DSECT                   SUBTYPES 68 - 73                       01822800
ST68OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   01825600
ST68OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01828400
ST68OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01831200
*                                TO THE OPTICAL LIBRARY                 01834000
ST68ODN  DS     CL8' '           OPTICAL DRIVE NAME                     01836800
ST68ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE              01839600
ST68ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01842400
*                                TO THE OPTICAL DRIVE.                  01845200
ST68VSN0 DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           01848000
ST68VSN1 DS     CL6' '           OPPOSITE SIDE OF                       01850800
*                                VOLSER IN FIELD ST68VSN0               01853600
ST68OMT  DS     CL2' '           OPTICAL MEDIA TYPE                     01856400
ST68ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         01859200
*                                RESIDENT, S=STANDALONE.                01862000
ST68OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   01864800
*                                G = OBJECT STORAGE GROUP,              01867600
*                                B = OBJECT BACKUP STOR GROUP,          01870400
*                                S = SCRATCH OPTICAL VOLUME.            01873200
ST68SGN  DS     CL8' '           STORAGE GROUP NAME.                    01876000
ST68LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01878800
*                                THIS REQUEST SPENT ON THE LCS          01881600
*                                INPUT-WORK-QUEUE WAITING TO            01884400
*                                PROCESSED.                             01887200
ST68LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01890000
*                                THIS REQUEST SPENT ON THE LCS          01892800
*                                DISPATCHER-QUEUE WAITING TO            01895600
*                                PROCESSED.                             01898400
ST68LEQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01901200
*                                THIS REQUEST SPENT ON THE LCS          01904000
*                                EXECUTION-QUEUE BEING                  01906800
*                                PROCESSED.                             01909600
ST68LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               01912400
*                                AMOUNT OF TIME (IN MILLISECONDS)       01915200
*                                THIS REQUEST SPENT ON THE LCS          01918000
*                                LIBRARY TASK QUEUE (LQE QUEUE)         01920800
*                                WAITING TO BE PROCESSED.               01923600
*                                NORMALLY, THIS FIELD REPRESENTS        01926400
*                                CARTRIDGE TRANSPORT MECHANISM          01929200
*                                WAIT TIME.  THAT IS, THE AMOUNT        01932000
*                                OF TIME WAITING FOR THE CARTRIDGE      01934800
*                                TRANSPORT MECHANISM (ROBOT) TO         01937600
*                                BECOME AVAILABLE WITHIN AN             01940400
*                                AUTOMATED STORAGE LIBRARY.             01943200
ST68LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          01946000
*                                AMOUNT OF TIME (IN MILLISECONDS)       01948800
*                                THIS REQUEST TOOK TO BE                01951600
*                                PROCESSED BY THE LIBRARY TASK.         01954400
*                                WAITING TO BE PROCESSED.               01957200
*                                NORMALLY, THIS FIELD REPRESENTS        01960000
*                                CARTRIDGES TRANSPORT MECHANISM         01962800
*                                SERVICE TIME.  THAT IS, THE            01965600
*                                TIM SPENT BY THE                       01968400
*                                CARTRIDGE TRANSPORT MECHANISM          01971200
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      01974000
*                                THE OPTICAL DISK LIBRARY.              01976800
ST68RC   DS     BL4'0'           LCS RETURN CODE                        01979600
ST68RS   DS     BL4'0'           LCS REASON CODE                        01982400
ST68FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            01985200
*********************************************************************** 01988000
* SUBTYPE 68 (OPTICAL CARTRIDGE ENTRY) FLAGS.                         * 01990800
*********************************************************************** 01993600
ST68FLG0 EQU    X'80'            WHEN ON, THE VOLUME SERIAL             01996400
*                                NUMBER DESCRIBED BY FIELD              01999200
*                                ST68VSN0 REQUIRED FORMATTING AS        02002000
*                                PART OF OPTICAL CARTRIDGE ENTRY        02004800
*                                PROCESSING.                            02007600
ST68FLG1 EQU    X'40'            WHEN ON, THE VOLUME SERIAL             02010400
*                                NUMBER DESCRIBED BY FIELD              02013200
*                                ST68VSN1 REQUIRED FORMATTING AS        02016000
*                                PART OF OPTICAL CARTRIDGE ENTRY        02018800
*                                PROCESSING.                            02021600
ST68FLG2 EQU    X'20'            WHEN ON, THE VOLUME SERIAL             02024400
*                                NUMBER DESCRIBED BY FIELD              02027200
*                                ST68VSN0 WAS NOT KNOWN TO OAM          02030000
*                                AT THE TIME OF BEING ENTERED           02032800
*                                INTO THE OPTICAL LIBRARY, MEANING      02035600
*                                THAT THERE WAS NOT ROW FOR THIS        02038400
*                                OPTICAL DISK VOLUME IN THE VOLUME      02041200
*                                TABLE IN THE OPTICAL                   02044000
*                                CONFIGURATION DATABASE (ODCB).         02046800
ST68FLG3 EQU    X'10'            WHEN ON, THE VOLUME SERIAL             02049600
*                                NUMBER DESCRIBED BY FIELD              02052400
*                                ST68VSN1 WAS NOT KNOWN TO OAM          02055200
*                                AT THE TIME OF BEING ENTERED           02058000
*                                INTO THE OPTICAL LIBRARY, MEANING      02060800
*                                THAT THERE WAS NOT ROW FOR THIS        02063600
*                                OPTICAL DISK VOLUME IN THE VOLUME      02066400
*                                TABLE IN THE OPTICAL                   02069200
*                                CONFIGURATION DATABASE (ODCB).         02072000
ST68TMNT DS     BL4'0'           ELASPED TIME (IN MILLISECONDS)         02074800
*                                THAT OPTICAL DISK VOLUME WAS           02077600
*                                MOUNTED.                               02080400
*                                ONLY VALID FOR SUBTYPE 73 AND          02083200
*                                SUBTYPE 69 (IN ONE SPECIAL             02086000
*                                CASE).                                 02088800
ST68NOW  DS     BL4'0'           NUMBER OF OBJECT WRITTEN TO THIS       02091600
*                                OPTICAL DISK VOLUME WHILE IT           02094400
*                                WAS MOUNTED.                           02097200
*                                ONLY VALID FOR SUBTYPE 73 AND          02100000
*                                SUBTYPE 69 (IN ONE SPECIAL             02102800
*                                CASE).                                 02105600
ST68NKBW DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02108400
*                                DATA WRITTEN TO THIS OPTICAL           02111200
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02114000
*                                ONLY VALID FOR SUBTYPE 73 AND          02116800
*                                SUBTYPE 69 (IN ONE SPECIAL             02119600
*                                CASE).                                 02122400
ST68NOR  DS     BL4'0'           NUMBER OF OBJECT READ FROM THIS        02125200
*                                OPTICAL DISK VOLUME WHILE IT           02128000
*                                WAS MOUNTED.                           02130800
*                                ONLY VALID FOR SUBTYPE 73 AND          02133600
*                                SUBTYPE 69 (IN ONE SPECIAL             02136400
*                                CASE).                                 02139200
ST68NKBR DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02142000
*                                DATA READ FROM THIS OPTICAL            02144800
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02147600
*                                ONLY VALID FOR SUBTYPE 73 AND          02150400
*                                SUBTYPE 69 (IN ONE SPECIAL             02153200
*                                CASE).                                 02156000
ST68NOD  DS     BL4'0'           NUMBER OF OBJECT DELETED FROM          02158800
*                                THIS OPTICAL DISK VOLUME WHILE         02161600
*                                IT WAS MOUNTED.                        02164400
*                                ONLY VALID FOR SUBTYPE 73 AND          02167200
*                                SUBTYPE 69 (IN ONE SPECIAL             02170000
*                                CASE).                                 02172800
ST68NKBD DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02175600
*                                DATA DETETED FROM THIS OPTICAL         02178400
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02181200
*                                ONLY VALID FOR SUBTYPE 73 AND          02184000
*                                SUBTYPE 69 (IN ONE SPECIAL             02186800
*                                CASE).                                 02189600
*********************************************************************** 02192400
* SUBTYPE 69 (OPTICAL CARTRIDGE EJECT) FLAGS.                         * 02195200
*********************************************************************** 02198000
ST69FLG0 EQU    X'80'            WHEN ON, THIS OPTICAL CARTRIDGE        02200800
*                                WAS AUTOMATICALLY EJECTED BY           02203600
*                                THE SYSTEM DUE TO AN ERROR             02206400
*                                CONDITION AND THIS CONDITION           02209200
*                                IS KNOWN AS A "SYSTEM INITIATED        02212000
*                                EJECT" REQUEST.                        02214800
*********************************************************************** 02217600
* SUBTYPE 70 (OPTICAL CARTRIDGE LABEL) FLAGS.                         * 02220400
*********************************************************************** 02223200
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02226000
*********************************************************************** 02228800
* SUBTYPE 71 (OPTICAL VOLUME AUDIT) FLAGS.                            * 02231600
*********************************************************************** 02234400
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02237200
*********************************************************************** 02240000
* SUBTYPE 72 (OPTICAL VOLUME MOUNT) FLAGS.                            * 02242800
*********************************************************************** 02245600
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02248400
*********************************************************************** 02251200
* SUBTYPE 73 (OPTICAL VOLUME DEMOUNT) FLAGS                           * 02254000
*********************************************************************** 02256800
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02259600
         EJECT                                                          02262400
*********************************************************************** 02265200
*                                                                     * 02268000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 74 - 77                         * 02270800
*                                                                     * 02273600
*   SUBTYPE FUNCTION                                                  * 02276400
*   ------- ---------------------------------------------------       * 02279200
*        74 LCS OPTICAL WRITE REQUEST                            @L1A * 02282000
*        75 LCS OPTICAL READ REQUEST                             @L1A * 02284800
*        76 LCS OPTICAL (LOGICAL) DELETE REQUEST                      * 02287600
*        77 LCS OPTICAL (PHYSICAL) DELETE REQUEST                     * 02290400
*                                                                     * 02293200
*********************************************************************** 02296000
ST74     DSECT                   SUBTYPES 74 - 77                       02298800
ST74ORMN DS     CL16' '          OAM REQUEST MEMBER NAME          @L1A  02299700
ST74OTMN DS     CL16' '          OAM TARGET  MEMBER NAME          @L1A  02300600
ST74OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   02301600
ST74OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            02304400
ST74OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        02307200
*                                TO THE OPTICAL LIBRARY                 02310000
ST74ODN  DS     CL8' '           OPTICAL DRIVE NAME                     02312800
ST74ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE              02315600
ST74ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        02318400
*                                TO THE OPTICAL DRIVE.                  02321200
ST74ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         02324000
*                                RESIDENT, S=STANDALONE.                02326800
ST74OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   02329600
*                                G = OBJECT STORAGE GROUP,              02332400
*                                B = OBJECT BACKUP STOR GROUP,          02335200
*                                S = SCRATCH OPTICAL VOLUME.            02338000
ST74SGN  DS     CL8' '           STORAGE GROUP NAME.                    02340800
ST74LIQT DS     BL4'0'           AMOUNT OF TIME (IN                     02343600
*                                MILLISECONDS) THIS REQUEST             02346400
*                                SPENT ON THE LCS                       02349200
*                                INPUT-WORK-QUEUE WAITING               02352000
*                                TO PROCESSED.                          02354800
ST74LDQT DS     BL4'0'           AMOUNT OF TIME (IN                     02357600
*                                MILLISECONDS) THIS REQUEST             02360400
*                                SPENT ON THE LCS                       02363200
*                                DISPATCHER-QUEUE WAITING               02366000
*                                TO PROCESSED.                          02368800
ST74LEQT DS     BL4'0'           AMOUNT OF TIME (IN                     02371600
*                                MILLISECONDS) THIS REQUEST             02374400
*                                SPENT ON THE LCS                       02377200
*                                EXECUTION-QUEUE BEING                  02380000
*                                PROCESSED.                             02382800
ST74LXQT DS     BL4'0'           AMOUNT OF TIME (IN                     02383300
*                                MILLISECONDS) THIS REQUEST             02383800
*                                SPENT ON THE XCF CROSS SYSTEM-         02384300
*                                QUEUE BEING PROCESSED.          @L1A   02384800
ST74OVMT DS     BL4'0'           OPTICAL VOLUME MOUNT TIME.             02385600
*                                THIS IS THE AMOUNT OF TIME             02388400
*                                (IN MILLISECONS) THAT IT               02391200
*                                TOOK TO MOUNTED THE                    02394000
*                                OPTICAL DISK VOLUME THAT               02396800
*                                WAS REQUIRED BY THIS                   02399600
*                                REQUEST. THE FIELD IS ONLY             02402400
*                                VALID IF BIT 1, 2 OR 3 IN              02405200
*                                FIELD ST74FLSGS IS ON.                 02408000
*                                THIS FIELD IS ONLY VALID               02410800
*                                FOR SUBTYPES 74, 75 AND                02413600
*                                77.                                    02416400
ST74OVDT DS     BL4'0'           OPTICAL VOLUME DEMOUNT                 02419200
*                                TIME.  THIS IS THE AMOUNT              02422000
*                                OF TIME (IN MILLISECONS)               02424800
*                                THAT IT TOOK TO DEMOUNT                02427600
*                                THE OPTICAL DISK VOLUME                02430400
*                                THAT CURRENTLY MOUNTED                 02433200
*                                PRIOR TO MOUNTING THAT                 02436000
*                                OPTICAL DISK VOLUME THAT               02438800
*                                WAS REQUIRED BY THE                    02441600
*                                REQUEST. THE FIELD IS ONLY             02444400
*                                VALID IF BIT 3 IN FIELD                02447200
*                                ST74FLSGS IS ON.  THIS                 02450000
*                                FIELD IS ONLY VALID FOR                02452800
*                                SUBTYPES 74, 75 AND 77.                02455600
*                                                                       02458400
ST74FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            02461200
*********************************************************************** 02464000
* SUBTYPE 74 PROCESSING FLAGS                                         * 02466800
*********************************************************************** 02469600
ST74FLG0 EQU    X'80'            WHEN ON, THIS REQUEST WAS              02472400
*                                PROCESSED USING A CURRENTLY            02475200
*                                MOUNTED OPTICAL VOLUME AND DID         02478000
*                                NOT REQUIRE AN UMOUNTED OPTICAL        02480800
*                                DISK VOLUME TO BE MOUNTED.             02483600
*                                ONLY VALID FOR SUBTYPES 74, 75         02486400
*                                AND 77.  NOT VALID FOR OTHER           02489200
*                                SUBTYPES.                              02492000
ST74FLG1 EQU    X'40'            WHEN ON, THIS REQUEST WAS              02494800
*                                PROCESSED USING THE OPPOSITE           02497600
*                                OF A CURRENTLY                         02500400
*                                MOUNTED OPTICAL VOLUME AND             02503200
*                                NOT REQUIRE AN UMOUNTED OPTICAL        02506000
*                                DISK VOLUME.  THEREFORE, THE           02508800
*                                REQUEST REQUIRED THE OPTICAL DISK      02511600
*                                VOLUME TO BE FLIPPED OVER TO           02514400
*                                ACCESS THE VOLUME ON THE               02517200
*                                OPPOSITE SIDE OF THE CURRENTLY         02520000
*                                MOUNTED VOLUME.                        02522800
*                                ONLY VALID FOR SUBTYPES 74, 75         02525600
*                                AND 77.  NOT VALID FOR OTHER           02528400
*                                SUBTYPES.                              02531200
*                                                                       02534000
ST74FLG2 EQU    X'20'            WHEN ON, THIS REQUEST REQUIRED         02536800
*                                AN UNMOUNTED OPTICAL DISK VOLUME       02539600
*                                AND THE OPTICAL DISK DRIVE USED        02542400
*                                TO PROCESS THIS REQUEST WAS            02545200
*                                EMPTY AT THE START OF PROCESSING       02548000
*                                THIS REQUEST.  THEREFORE, THIS         02550800
*                                REQUEST DID NOT REQUIRE A              02553600
*                                CURRENTLY MOUNTED OPTICAL DISK         02556400
*                                VOLUME TO BE DEMOUNTED PRIOR           02559200
*                                TO MOUNTED THE REQUIRED OPTICAL        02562000
*                                DISK VOLUME.                           02564800
*                                ONLY VALID FOR SUBTYPES 74, 75         02567600
*                                AND 77.  NOT VALID FOR OTHER           02570400
*                                SUBTYPES.                              02573200
ST74FLG3 EQU    X'10'            WHEN ON, THIS REQUEST REQUIRED         02576000
*                                AN UNMOUNTED OPTICAL DISK VOLUME       02578800
*                                AND THE OPTICAL DISK DRIVE USED        02581600
*                                TO PROCESS THIS REQUEST WAS            02584400
*                                FULL AT THE START OF PROCESSING        02587200
*                                THIS REQUEST.  THEREFORE, THIS         02590000
*                                REQUEST REQUIRED A                     02592800
*                                CURRENTLY MOUNTED OPTICAL DISK         02595600
*                                VOLUME TO BE DEMOUNTED PRIOR           02598400
*                                TO MOUNTING THE REQUIRED OPTICAL       02601200
*                                DISK VOLUME.                           02604000
*                                ONLY VALID FOR SUBTYPES 74, 75         02606800
*                                AND 77.  NOT VALID FOR OTHER           02609600
*                                SUBTYPES.                              02612400
ST74NOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                02615200
*                                PROCESSED IN THIS REQUEST              02618000
ST74NKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02620800
*                                DATA IN THIS REQUEST                   02623600
ST74SOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                02626400
*                                IN THIS REQUEST PROCESSED              02629200
*                                SUCESSFULLY.                           02632000
ST74SKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02634800
*                                DATA SUCESSFULLY PROCESSED IN          02637600
*                                THIS REQUEST.                          02640400
         DS     CL14' '          RESERVED.                              02643200
ST74END  DS     0C               END OF SUBTYPE 74 BASE SECTION         02646000
*********************************************************************** 02648800
* SUBTYPE 74,75,76 AND 77 OBJECT ARRAY SECTION                        * 02651600
*********************************************************************** 02654400
ST74OBJD DSECT                   ARRAY OF OBJECTS IN THIS REQUEST       02657200
ST74COLN DS     CL44' '          COLLECTION NAME                        02660000
ST74OBJN DS     CL44' '          OBJECT NAME                            02662800
ST74OLEN DS     BL4'0'           OBJECT LENGTH                          02665600
ST74OOFF DS     BL4'0'           OBJECT OFFSET, ONLY VALID              02668400
*                                ON SUBTYPE 75 FOR A PARTIAL            02671200
*                                OBJECT READ.                           02674000
ST74VSN  DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           02676800
ST74OMT  DS     CL2' '           OPTICAL MEDIA TYPE.                    02679600
ST74OTKN DS     BL4'0'           OBJECT LOCATION TOKEN                  02682400
ST74RC   DS     BL4'0'           LCS RETURN CODE                        02685200
ST74RS   DS     BL4'0'           LCS REASON CODE                        02688000
         EJECT                                                          02690800
*********************************************************************** 02693600
*                                                                     * 02696400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 78, 79 AND 88               @P0C* 02699200
*                                                                     * 02702000
*   SUBTYPE FUNCTION                                                  * 02704800
*   ------- ---------------------------------------------------       * 02707600
*        78 LCS TAPE WRITE REQUEST                                    * 02710400
*        79 LCS TAPE READ REQUEST                                 @L1A* 02712500
*        88 LCS TAPE LOGICAL DELETE REQUEST                       @P0A* 02714600
*                                                                     * 02716000
*********************************************************************** 02718800
ST78     DSECT                   SUBTYPES 78, 79 AND 88                 02721600
ST78ORMN DS     CL16' '          OAM REQUEST MEMBER NAME          @L1A  02722500
ST78OTMN DS     CL16' '          OAM TARGET  MEMBER NAME          @L1A  02723400
ST78TDUN DS     CL8' '           TAPE DRIVE UNIT NAME                   02724400
ST78TDDN DS     CL4' '           MVS DEVICE NUMBER OF TAPE DRIV         02727200
ST78TVT  DS     CL1' '           TAPE VOLUME TYPE.                      02730000
*                                G = OBJECT STORAGE GROUP,              02732800
*                                B = OBJECT BACKUP STOR GROUP,          02735600
*                                S = SCRATCH OPTICAL VOLUME.            02738400
         DS     CL3' '           RESERVED                               02741200
ST78SGN  DS     CL8' '           STORAGE GROUP NAME.                    02744000
*                                                                       02746800
ST78LIQT DS     BL4'0'           LCS INPUT-WORK-QUEUE TIME.             02749600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02752400
*                                THIS REQUEST SPENT ON THE LCS          02755200
*                                INPUT-WORK-QUEUE WAITING TO            02758000
*                                PROCESSED.                             02760800
ST78LDQT DS     BL4'0'           LCS DISPATCHER-QUEUE TIME.             02763600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02766400
*                                THIS REQUEST SPENT ON THE LCS          02769200
*                                DISPATCHER-QUEUE WAITING TO            02772000
*                                PROCESSED.                             02774800
ST78LEQT DS     BL4'0'           LCS EXECUTION-QUEUE TIME.              02777600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02780400
*                                THIS REQUEST SPENT ON THE LCS          02783200
*                                EXECUTION-QUEUE BEING                  02786000
*                                PROCESSED.                             02788800
ST78LXQT DS     BL4'0'           AMOUNT OF TIME (IN                     02789300
*                                MILLISECONDS) THIS REQUEST             02789800
*                                SPENT ON THE XCF CROSS SYSTEM-         02790300
*                                QUEUE BEING PROCESSED.          @L1A   02790800
ST78LMAT DS     BL4'0'           MVS DYNAMIC ALLOCATION (SVC 99)        02791600
*                                TIME.  THIS IS THE AMOUNT OF           02794400
*                                TIME (IN MILLISECONDS) THAT WAS        02797200
*                                REQUIRED BY MVS DYNAMIC                02800000
*                                ALLOCATION TO DYNAMICALLY              02802800
*                                ALLOCATE THE TAPE DRIVE.  THIS         02805600
*                                FIELD IS ONLY VALID IF BIT 1 IN        02808400
*                                FIELD ST78FLGS IS ON.                  02811200
ST78LMDT DS     BL4'0'           MVS DYNAMIC DEALLOCATION (SVC 99)      02814000
*                                TIME.  THIS IS THE AMOUNT OF           02816800
*                                TIME (IN MILLISECONDS) THAT WAS        02819600
*                                REQUIRED BY MVS DYNAMIC                02822400
*                                DEALOCATION TO DYNAMICALLY             02825200
*                                DEALLOCATE THE TAPE DRIVE.  THIS       02828000
*                                FIELD IS ONLY VALID IF BIT 2 IN        02830800
*                                FIELD ST78FLGS IS ON.                  02833600
ST78LDCT DS     BL4'0'           DFSMS CLOSE TIME.                      02836400
*                                THIS IS THE AMOUNT OF                  02839200
*                                TIME (IN MILLISECONDS) THAT WAS        02842000
*                                REQUIRED BY DFSMS TO CLOSE AN          02844800
*                                ALREADY-OPENED TAPE DATA SET.          02847600
*                                THIS FIELD IS ONLY VALID IF BIT 2      02850400
*                                IN FIELD ST78FLGS IS ON.               02853200
ST78LDOT DS     BL4'0'           DFSMS OPEN TIME.                       02856000
*                                THIS IS THE AMOUNT OF                  02858800
*                                TIME (IN MILLISECONDS) THAT WAS        02861600
*                                REQUIRED BY DFSMS OPEN PROCESSING      02864400
*                                TO OPEN THE TAPE DATA SET.             02867200
*                                THIS FIELD IS ONLY VALID IF BIT 1      02870000
*                                OR BIT 2 IN FIELD ST78FLGS IS ON.      02872800
ST78LDPT DS     BL4'0'           DFSMS POINT TIME.  THIS IS             02875600
*                                THE AMOUNT OF TIME (IN                 02878400
*                                MILLISECONDS) THAT WAS                 02881200
*                                REQUIRED BY DFSMS POINT                02884000
*                                PROCESSING TO POSITION TO THE          02886800
*                                CORRECT BLOCK-ID ON THE MEDIA.         02889600
*                                THIS FIELD                             02892400
*                                IS ONLY VALID IF BIT 1 OR              02895200
*                                BIT 2 IN FIELD ST78FLGS IS             02898000
*                                ON.                                    02900800
ST78LBRT DS     BL4'0'           BSAM READ TIME.  THIS IS               02903600
*                                THE AMOUNT OF TIME (IN                 02906400
*                                MILLISECONDS) THAT LCS SPENT           02909200
*                                IN BSAM READ PROCESSING READING        02912000
*                                DATA FROM THE TAPE VOLUME.  ONLY       02914800
*                                VALID FOR SUBTYPE 79.                  02917600
ST78LBWT DS     BL4'0'           BSAM WRITE TIME.  THIS IS              02920400
*                                THE AMOUNT OF TIME (IN                 02923200
*                                MILLISECONDS) THAT LCS SPENT           02926000
*                                IN BSAM WRITE PROCESSING WRITING       02928800
*                                DATA TO THE TAPE VOLUME.  ONLY         02931600
*                                VALID FOR SUBTYPE 78.                  02934400
ST78LBCT DS     BL4'0'           BSAM CHECK TIME.  THIS IS              02937200
*                                THE AMOUNT OF TIME (IN                 02940000
*                                MILLISECONDS) THAT LCS SPENT           02942800
*                                IN BSAM CHECK PROCESSING WAITING       02945600
*                                FOR I/O OPERATIONS TO COMPLETED.       02948400
*                                VALID FOR SUBTYPES 78 AND 79.          02951200
*********************************************************************** 02954000
* SUBTYPE 78 PROCESSING FLAGS                                         * 02956800
*********************************************************************** 02959600
ST78FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            02962400
ST78FLG0 EQU    X'80'            WHEN ON, THIS REQUEST WAS              02965200
*                                PROCESSED USING A CURRENTLY            02968000
*                                MOUNTED TAPE VOLUME AND DID            02970800
*                                NOT REQUIRE AN UMOUNTED TAPE           02973600
*                                VOLUME TO BE MOUNTED.                  02976400
ST78FLG1 EQU    X'40'            WHEN ON, THIS REQUEST REQUIRED         02979200
*                                AN UNMOUNTED TAPE VOLUME               02982000
*                                AND THE TAPE DRIVE USED                02984800
*                                TO PROCESS THIS REQUEST WAS            02987600
*                                EMPTY AT THE START OF PROCESSING       02990400
*                                THIS REQUEST.  THEREFORE, THIS         02993200
*                                REQUEST DID NOT REQUIRE A              02996000
*                                CURRENTLY MOUNTED TAPE                 02998800
*                                VOLUME TO BE DEMOUNTED PRIOR           03001600
*                                TO MOUNTING THE REQUIRED TAPE          03004400
*                                VOLUME.                                03007200
ST78FLG2 EQU    X'20'            WHEN ON, THIS REQUEST REQUIRED AN      03010000
*                                UNMOUNTED TAPE VOLUME TO BE            03012800
*                                MOUNTED AND THE TAPE DRIVE TASK        03015600
*                                USED TO PROCESS THIS REQUEST           03018400
*                                ALREADY HAD A TAPE DRIVE               03021200
*                                ALLOCATED AND A DIFFERENT TAPE         03024000
*                                VOLUME MOUNTED.  THEREFORE, THIS       03026800
*                                REQUEST REQUIRED A CURRENTLY           03029600
*                                MOUNTED TAPE VOLUME TO BE              03032400
*                                DEMOUNTED PRIOR TO MOUNTING THE        03035200
*                                REQUIRED TAPE VOLUME.                  03038000
ST78FLG3 EQU    X'10'            THIS REQUEST WAS PROCESSED             03040800
*                                USING A TAPE DRIVE INSIDE AN           03043600
*                                IBM AUTOMATED TAPE LIBRARY             03046400
*                                DATASERVER.                            03049200
ST78NOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                03052000
*                                PROCESSED IN THIS REQUEST              03054800
ST78NKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03057600
*                                DATA IN THIS REQUEST                   03060400
ST78SOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                03063200
*                                IN THIS REQUEST PROCESSED              03066000
*                                SUCESSFULLY.                           03068800
ST78SKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03071600
*                                DATA SUCESSFULLY                       03074400
*                                PROCESSED IN THIS REQUEST              03077200
         DS     CL16' '          RESERVED.                              03080000
ST78END  DS     0C               END OF SUBTYPE 78 BASE SECTION         03082800
*********************************************************************** 03085600
* SUBTYPE 78,79 & 88 OBJECT ARRAY SECTION                         @P0C* 03088400
*********************************************************************** 03091200
ST78OBJD DSECT                   ARRAY OF OBJECTS IN THIS REQUEST       03094000
ST78COLN DS     CL44' '          COLLECTION NAME                        03096800
ST78OBJN DS     CL44' '          OBJECT NAME                            03099600
ST78OLEN DS     BL4'0'           OBJECT LENGTH                          03102400
ST78OOFF DS     BL4'0'           OBJECT OFFSET, ONLY VALID              03105200
*                                ON SUBTYPE 79 FOR A                    03108000
*                                PARTIAL OBJECT READ.                   03110800
ST78VSN  DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           03113600
ST78TMT  DS     CL2' '           TAPE MEDIA TYPE.                       03116400
*                                02 = IBM 3480 STANDARD CAPACITY        03119200
*                                     CARTRIDGE SYSTEM TAPE.            03122000
*                                04 = IBM 3480 ENHANCED CAPACITY        03124800
*                                     CARTRIDGE SYSTEM TAPE.            03127600
*                                05 = IBM 3590 HIGH PERFORMANCE         03130400
*                                     CARTRIDGE TAPE.                   03133200
ST78OTKN DS     BL4'0'           OBJECT LOCATION TOKEN                  03136000
ST78RC   DS     BL4'0'           LCS RETURN CODE                        03138800
ST78RS   DS     BL4'0'           LCS REASON CODE                        03141600
         EJECT                                                          03144400
*********************************************************************** 03147200
*                                                                     * 03150000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 80 - 81                         * 03152800
*                                                                     * 03155600
*   SUBTYPE FUNCTION                                                  * 03158400
*   ------- ---------------------------------------------------       * 03161200
*        80 LCS TAPE LIBRARY VARY ONLINE                              * 03164000
*        81 LCS TAPE LIBRARY VARY OFFLINE                             * 03166800
*                                                                     * 03169600
*********************************************************************** 03172400
ST80     DSECT                   SUBTYPES 80 AND 81                     03175200
ST80TLN  DS     CL8' '           TAPE LIBRARY NAME                      03178000
ST80TLDT DS     CL8' '           TAPE LIBRARY DEVICE TYPE               03180800
ST80LTQT DS     BL4'0'           LCS LIBRARY TASK QUEUE TIME.           03183600
*                                THE AMOUNT OF TIME (IN                 03186400
*                                MILLISECONDS) THAT THIS REQUEST        03189200
*                                SPENT ON THE LCS LIBRARY QUEUE         03192000
*                                (LQE QUEUE) WAITING TO BE              03194800
*                                PROCESSED.                             03197600
ST80LTPT DS     BL4'0'           LCS LIBRARY TASK PROCESSING TIME.      03200400
*                                THE AMOUNT OF TIME (IN                 03203200
*                                MILLISECONDS) THAT THIS REQUEST        03206000
*                                TOOK TO BE PROCESSED BY THE            03208800
*                                LIBRARY TASK.                          03211600
ST80RC   DS     BL4'0'           LCS RETURN CODE                        03214400
ST80RS   DS     BL4'0'           LCS REASON CODE                        03217200
ST80FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            03220000
         EJECT                                                          03222800
*********************************************************************** 03225600
*                                                                     * 03228400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 82 - 86                         * 03231200
*                                                                     * 03234000
*   SUBTYPE FUNCTION                                                  * 03236800
*   ------- ---------------------------------------------------       * 03239600
*        82 LCS TAPE LIBRARY VOLUME ENTRY                             * 03242400
*        83 LCS TAPE LIBRARY VOLUME EJECT                             * 03245200
*        84 LCS TAPE LIBRARY VOLUME AUDIT                             * 03248000
*        85 LCS TAPE LIBRARY VOLUME MOUNT                             * 03250800
*        86 LCS TAPE LIBRARY VOLUME DEMOUNT                           * 03253600
*                                                                     * 03256400
*********************************************************************** 03259200
ST82     DSECT                   SUBTYPES 82 - 86                       03262000
ST82TLN  DS     CL8' '           TAPE LIBRARY NAME                      03264800
ST82TLDT DS     CL8' '           TAPE LIBRARY DEVICE TYPE               03267600
ST82TDDT DS     CL4' '           TAPE DRIVE UCB DEVICE TYPE.            03270400
*                                VALID FOR SUBTYPES 85 AND 86,          03273200
*                                CONTAINS ZEROS FOR OTHERS.             03276000
ST82TDDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        03278800
*                                TO TAPE DRIVE.                         03281600
*                                VALID FOR SUBTYPES 85 AND 86,          03284400
*                                CONTAINS ZEROS FOR OTHERS.             03287200
ST82VSN  DS     CL6' '           TAPE VOLUME SERIAL NUMBER              03290000
ST82TMT  DS     CL2' '           TAPE MEDIA TYPE                        03292800
*                                02 = IBM 3480 STANDARD CAPACITY        03295600
*                                     CARTRIDGE SYSTEM TAPE.            03298400
*                                04 = IBM 3480 ENHANCED CAPACITY        03301200
*                                     CARTRIDGE SYSTEM TAPE.            03304000
*                                05 = IBM 3590 HIGH PERFORMANCE         03306800
*                                     CARTRIDGE TAPE.                   03309600
ST82LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       03312400
*                                THIS REQUEST SPENT ON THE LCS          03315200
*                                INPUT-WORK-QUEUE WAITING TO            03318000
*                                PROCESSED.                             03320800
ST82LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       03323600
*                                THIS REQUEST SPENT ON THE LCS          03326400
*                                DISPATCHER-QUEUE WAITING TO            03329200
*                                PROCESSED.                             03332000
ST82LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               03334800
*                                AMOUNT OF TIME (IN MILLISECONDS)       03337600
*                                THIS REQUEST SPENT ON THE LCS          03340400
*                                LIBRARY TASK QUEUE (LQE QUEUE)         03343200
*                                WAITING TO BE PROCESSED.               03346000
*                                NORMALLY, THIS FIELD REPRESENTS        03348800
*                                CARTRIDGE TRANSPORT MECHANISM          03351600
*                                WAIT TIME.  THAT IS, THE AMOUNT        03354400
*                                OF TIME WAITING FOR THE CARTRIDGE      03357200
*                                TRANSPORT MECHANISM (ROBOT) TO         03360000
*                                BECOME AVAILABLE WITHIN AN             03362800
*                                AUTOMATED STORAGE LIBRARY.             03365600
ST82LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          03368400
*                                AMOUNT OF TIME (IN MILLISECONDS)       03371200
*                                THIS REQUEST TOOK TO BE                03374000
*                                PROCESSED BY THE LIBRARY TASK.         03376800
*                                WAITING TO BE PROCESSED.               03379600
*                                NORMALLY, THIS FIELD REPRESENTS        03382400
*                                CARTRIDGES TRANSPORT MECHANISM         03385200
*                                SERVICE TIME.  THAT IS, THE            03388000
*                                TIM SPENT BY THE                       03390800
*                                CARTRIDGE TRANSPORT MECHANISM          03393600
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      03396400
*                                THE OPTICAL DISK LIBRARY.              03399200
ST82RC   DS     BL4'0'           LCS RETURN CODE                        03402000
ST82RS   DS     BL4'0'           LCS REASON CODE                        03404800
ST82FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            03407600
         EJECT                                                          03410400
*********************************************************************** 03413200
*                                                                     * 03416000
*   OAM SUBTYPE SECTION, FOR SUBTYPE 87                               * 03418800
*                                                                     * 03421600
*   SUBTYPE FUNCTION                                                  * 03424400
*   ------- ---------------------------------------------------       * 03427200
*        87 OAM OWNED TAPE VOLUME DEMOUNT                             * 03430000
*                                                                     * 03432800
*********************************************************************** 03435600
ST87     DSECT                   SUBTYPE 87                             03438400
ST87TDDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        03441200
*                                TO TAPE DRIVE.                         03444000
ST87TDDT DS     CL4' '           TAPE DRIVE UCB DEVICE TYPE             03446800
ST87TVUN DS     CL8' '           TAPE VOLUME UNIT NAME                  03449600
ST87VSN  DS     CL6' '           TAPE VOLUME SERIAL NUMBER              03452400
ST87TMT  DS     CL2' '           TAPE MEDIA TYPE                        03455200
*                                02 = IBM 3480 STANDARD CAPACITY        03458000
*                                     CARTRIDGE SYSTEM TAPE.            03460800
*                                04 = IBM 3480 ENHANCED CAPACITY        03463600
*                                     CARTRIDGE SYSTEM TAPE.            03466400
*                                05 = IBM 3590 HIGH PERFORMANCE         03469200
*                                     CARTRIDGE TAPE.                   03472000
ST87TVT  DS     CL1' '           TAPE VOLUME TYPE.                      03474800
*                                G = TAPE VOLUME IS A GROUPED           03477600
*                                VOLUME BELONGING TO AN OBJECT          03480400
*                                STORAGE GROUP.                         03483200
*                                B = TAPE VOLUME IS A GROUPED           03486000
*                                VOLUME BELONGING TO AN OBJECT          03488800
*                                BACKUP STORAGE GROUP.                  03491600
         DS     CL3' '           RESERVED.                              03494400
ST87SGN  DS     CL8' '           STORAGE GROUP NAME.                    03497200
ST87RC   DS     BL4'0'           LCS RETURN CODE                        03500000
ST87RS   DS     BL4'0'           LCS REASON CODE                        03502800
ST87FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            03505600
ST87TMNT DS     BL4'0'           ELASPED TIME (IN MILLISECONDS)         03508400
*                                THAT TAPE VOLUME WAS MOUNTED,          03511200
*                                MEASURED FROM COMPLETION OF THE        03514000
*                                DFSMS OPEN MACRO TO COMPLETION         03516800
*                                OF THE DFSMS CLOSE MACRO.              03519600
ST87NOW  DS     BL4'0'           NUMBER OF OBJECT WRITTEN TO THIS       03522400
*                                TAPE VOLUME WHILE IT                   03525200
*                                WAS MOUNTED.                           03528000
ST87NKBW DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03530800
*                                DATA WRITTEN TO THIS TAPE              03533600
*                                VOLUME WHILE IT WAS MOUNTED.           03536400
ST87NOR  DS     BL4'0'           NUMBER OF OBJECT READ FROM THIS        03539200
*                                TAPE VOLUME WHILE IT                   03542000
*                                WAS MOUNTED.                           03544800
ST87NKBR DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03547600
*                                DATA READ FROM THIS TAPE               03550400
*                                VOLUME WHILE IT WAS MOUNTED.           03553200
         EJECT                                                          03556000
*********************************************************************** 03558800
*                                                                     * 03561600
*   OAM SMF RECORD 85 SUBTYPES                                        * 03564400
*                                                                     * 03567200
*********************************************************************** 03570000
SMFST01  EQU     X'01'           OSREQ ACCESS                           03572800
SMFST02  EQU     X'02'           OSREQ STORE                            03575600
SMFST03  EQU     X'03'           OSREQ RETRIEVE                         03578400
SMFST04  EQU     X'04'           OSREQ QUERY                            03581200
SMFST05  EQU     X'05'           OSREQ CHANGE                           03584000
SMFST06  EQU     X'06'           OSREQ DELETE                           03586800
SMFST07  EQU     X'07'           OSREQ UNACCESS                         03589600
SMFST32  EQU     X'20'           OSMC STOR GRP PROCESSING               03592400
SMFST33  EQU     X'21'           OSMC DASD SPACE MANAGEMENT             03595200
SMFST34  EQU     X'22'           OSMC OPTICAL DISK RECOVERY UTILITY     03598000
SMFST35  EQU     X'23'           OSMC MOVEVOL UTILITY                   03600800
SMFST36  EQU     X'24'           OSMC SINGLE OBJECT RECOVERY UTILITY    03603600
SMFST37  EQU     X'25'           OSMC LIBRARY SPACE MANAGEMENT          03606400
SMFST64  EQU     X'40'           LCS OPTICAL DRIVE VARY ONLINE          03609200
SMFST65  EQU     X'41'           LCS OPTICAL DRIVE VARY OFFLINE         03612000
SMFST66  EQU     X'42'           LCS OPTICAL LIBRARY VARY ONLINE        03614800
SMFST67  EQU     X'43'           LCS OPTICAL LIBRARY VARY OFFLINE       03617600
SMFST68  EQU     X'44'           LCS OPTICAL CARTRIDGE ENTRY            03620400
SMFST69  EQU     X'45'           LCS OPTICAL CARTRIDGE EJECT            03623200
SMFST70  EQU     X'46'           LCS OPTICAL CARTRIDGE LABEL            03626000
SMFST71  EQU     X'47'           LCS OPTICAL VOLUME AUDIT               03628800
SMFST72  EQU     X'48'           LCS OPTICAL VOLUME MOUNT               03631600
SMFST73  EQU     X'49'           LCS OPTICAL VOLUME DEMOUNT             03634400
SMFST74  EQU     X'4A'           LCS OPTICAL WRITE REQUEST              03637200
SMFST75  EQU     X'4B'           LCS OPTICAL READ REQUEST               03640000
SMFST76  EQU     X'4C'           LCS OPTICAL LOGICAL DELETE REQ    @P0C 03642800
SMFST77  EQU     X'4D'           LCS OPTICAL PHYSICAL DELETE REQUEST    03645600
SMFST78  EQU     X'4E'           LCS TAPE WRITE REQUEST                 03648400
SMFST79  EQU     X'4F'           LCS TAPE READ REQUEST                  03651200
SMFST80  EQU     X'50'           LCS TAPE LIBRARY VARY ONLINE           03654000
SMFST81  EQU     X'51'           LCS TAPE LIBRARY VARY OFFLINE          03656800
SMFST82  EQU     X'52'           LCS TAPE LIBRARY VOLUME ENTRY          03659600
SMFST83  EQU     X'53'           LCS TAPE LIBRARY VOLUME EJECT          03662400
SMFST84  EQU     X'54'           LCS TAPE LIBRARY VOLUME AUDIT          03665200
SMFST85  EQU     X'55'           LCS TAPE LIBRARY VOLUME MOUNT          03668000
SMFST86  EQU     X'56'           LCS TAPE LIBRARY VOLUME DEMOUNT        03670800
SMFST87  EQU     X'57'           OAM TAPE VOLUME DEMOUNT                03673600
SMFST88  EQU     X'58'           LCS TAPE LOGICAL DELETE REQUEST   @P0A 03673700
         EJECT                                                          03673800
*********************************************************************** 03673900
*                                                                     * 03674000
*   CONSTANTS FOR CHECKING OPTICAL MEDIA TYPE (IN SUCH FIELDS AS      * 03674100
*   ST32OMT, ST36OMT, ST64OMT, ST68OMT).                              * 03674200
*                                                                     * 03674300
*********************************************************************** 03674400
OMTLMSI  EQU     C'00'           LMSI 12-INCH 2.0 GB OPTICAL MEDIA      03674500
OMT1XRW  EQU     C'01'           3995 5.25-INCH 1X CAPACITY (650 MB)    03674600
*                                REWRITABLE OPTICAL DISK MEDIA          03674700
OMT1XWO  EQU     C'03'           3995 5.25-INCH 1X CAPACITY (650 MB)    03674800
*                                WRITE-ONCE-READ-MANY (WORM)            03674900
*                                OPTICAL DISK MEDIA                     03675000
OMT2XRW  EQU     C'11'           3995 5.25-INCH 2X CAPACITY (1300 MB)   03675100
*                                REWRITABLE OPTICAL DISK MEDIA          03675200
OMT2XWO  EQU     C'13'           3995 5.25-INCH 2X CAPACITY (1300 MB)   03675300
*                                WRITE-ONCE-READ-MANY (WORM)            03675400
*                                OPTICAL DISK MEDIA                     03675500
OMT4XRW  EQU     C'21'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03675600
*                                REWRITABLE OPTICAL DISK MEDIA          03675700
OMT4XWO  EQU     C'23'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03675800
*                                PERMANENT WRITE-ONCE-READ-MANY (WORM)  03675900
*                                OPTICAL DISK MEDIA                     03676000
OMT4XCC  EQU     C'25'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03676100
*                                CONTINUOUS COMPOSITE WRITE (CCW)       03676200
*                                WRITE-ONCE-READ-MANY (WORM)            03676300
*                                OPTICAL DISK MEDIA                     03676400
*********************************************************************** 03676500
*                                                                     * 03676600
*   CONSTANTS FOR CHECKING TAPE MEDIA TYPE (IN SUCH FIELDS AS         * 03676700
*   ST36TMT, ST78TMT, ST82TMT, AND ST87TMT).                          * 03676800
*                                                                     * 03676900
*********************************************************************** 03677000
TMT3490S EQU     C'02'           3490 STANDARD CAPACITY CARTRIDGE       03677100
*                                SYSTEM TAPE (CST)                      03677200
TMT3490E EQU     C'04'           3490 ENHANCED CAPACITY CARTRIDGE       03677300
*                                SYSTEM TAPE (ECCST)                    03677400
TMT3590S EQU     C'05'           3590 HIGH PERFORMANCE CARTRIDGE        03677500
*                                TAPE                                   03677600
*********************************************************************** 03677700
*                                                                     * 03677800
*   CONSTANTS FOR CHECKING OPTICAL VOLUME TYPE (SUCH AS FIELDS        * 03677900
*   ST64OVT, ST68OVT AND ST74OVT).                                    * 03678000
*                                                                     * 03678100
*********************************************************************** 03678200
OVTSCRTC EQU     C'S'            OPTICAL VOLUME IS A SCRATCH VOLUME     03678300
OVTGROUP EQU     C'G'            OPTICAL VOLUME IS A GROUPED VOLUME     03678400
*                                ASSIGNED TO AN OBJECT STORAGE GROUP    03678500
OVTBACKP EQU     C'B'            OPTICAL VOLUME IS A BACKUP VOLUME      03678600
*                                ASSIGNED TO AN OBJECT BACKUP STORAGE   03678700
*                                GROUP                                  03678800
         MEND            */                                             03678900
 %CBRSMFPL:                                                             03679200
    /* STANDARD SMF RECORD HEADER FOR OAM SMF RECORD                 */ 03750000
  IF SMFBASE = '' %THEN                                                 03800000
   %DO;                                                                 03850000
      DECLARE 1 CBRSMF85 BDY(DWORD), /* OAM SMF RECORD               */ 03900000
   %END;                                                                03950000
 %ELSE                                                                  04000000
   %DO;                                                                 04050000
      DECLARE 1 CBRSMF85 BASED(SMFBASE) BDY(DWORD),/* OAM SMF RECORD */ 04100000
   %END;                                                                04150000
      3 SMF85HDR,                   /* SMF RECORD TYPE 85 HEADER     */ 04200000
        5 SMF85LEN FIXED(16),       /* RECORD LENGTH                 */ 04250000
        5 SMF85SEG FIXED(16),       /* RECORD SEGMENT                */ 04300000
        5 SMF85FLG BIT(8),          /* SYSTEM INDICATOR              */ 04350000
          7 SMF85FL0  BIT(1),       /* RESERVED                      */ 04400000
          7 SMF85FL1  BIT(1),       /* SUBTYPES ARE VALID            */ 04450000
          7 SMF85FL2  BIT(1),       /* RESERVED                      */ 04500000
          7 SMF85FL3  BIT(1),       /* MVS/SP VERSION 4 (MVS/ESA) AND   04525000
                                       ABOVE.  BITS 3, 4, 5 AND 6 ARE   04550000
                                       ON.                           */ 04575000
          7 SMF85FL4  BIT(1),       /* MVS/SP VERSION 3 (MVS/ESA).      04600000
                                       BITS 4, 5 AND 6 ARE ON.       */ 04625000
          7 SMF85FL5  BIT(1),       /* MVS/SP VERSION 2 (MVS/XA)        04650000
                                       BITS 5 AND 6 ARE ON.          */ 04675000
          7 SMF85FL6  BIT(1),       /* VS2                           */ 04700000
          7 SMF85FL7  BIT(1),       /* RESERVED                      */ 04750000
        5 SMF85RTY FIXED(8),        /* RECORD TYPE                   */ 04800000
        5 SMF85TME FIXED(32) BDY(WORD,3), /* TIME SINCE MIDNIGHT, IN    04850000
                                       HUNDREDTHS OF SECONDS, RECORD    04900000
                                       WAS PRESENTED TO SMF */          04950000
        5 SMF85DTE CHAR(4),         /* DATE RECORD WAS PRESENTED TO SMF,05000000
                                       IN THE FORM OCYYDDDF, WHERE F IS 05050000
                                       THE SIGN.                     */ 05100000
        5 SMF85SID CHAR(4),         /* SYSTEM IDENTIFICATION (FROM SID  05150000
                                       PARAMETER)                    */ 05200000
        5 SMF85SSI CHAR(4),         /* SUBSYSTEM IDENTIFICATION,        05250000
                                       CONTAINS 'OAM ' FOR ALL OAM      05300000
                                       SMF RECORDS.                  */ 05350000
        5 SMF85STY FIXED(16),       /* RECORD SUBTYPE                */ 05400000
        5 SMF85TRN FIXED(16),       /* NUMBER OF TRIPLETS IN THIS       05450000
                                       RECORD.  A TRIPLET IS A SET OF   05500000
                                       OFFSET/LENGTH/VALUES THAT DEFINE 05550000
                                       A SECTION OF THE RECORD.      */ 05600000
        5 SMF85PSO FIXED(32) BDY(WORD,3), /* OFFSET TO OAM PROD SEC  */ 05650000
        5 SMF85PSL FIXED(16),       /* LENGTH OF OAM PRODUCT SECTION */ 05700000
        5 SMF85PSN FIXED(16),       /* NUMBER OF OAM PRODUCT SECTIONS*/ 05750000
        5 SMF85OSO FIXED(32) BDY(WORD,3),/* OFFSET TO OAM SUBTYPE SEC */05800000
        5 SMF85OSL FIXED(16),       /* LENGTH OF OAM SUBTYPE SECTION */ 05850000
        5 SMF85OSN FIXED(16),       /* NUMBER OF OAM SUBTYPE SECTIONS*/ 05900000
        5 *        CHAR(6),         /* RESERVED                      */ 05950000
        5 SMF85END CHAR(0),         /* END OF SMF HEADER             */ 05975000
 @EJECT;                                                                06000000
        /* OAM PRODUCT IDENTIFICATION SECTION                        */ 06050000
     3 SMF85PIS,                    /* PRODUCT IDENTIFICATION SECTION*/ 06100000
        5 R85PCID  CHAR(9),         /* COMPONENT ID FOR OAM. FOR        06150000
                                       DFSMS/MVS CONTAINS THE           06200000
                                       CHARACTERS '5695DF180'.       */ 06250000
        5 R85PVID  FIXED(8),        /* VERSION NUMBER FOR DFSMS/MVS,    06300000
                                       IN BINARY                     */ 06350000
        5 R85PRID  FIXED(8),        /* RELEASE NUMBER FOR DFSMS/MVS,    06400000
                                       IN BINARY                     */ 06450000
        5 R85PMID  FIXED(8),        /* MODIFICATION LEVEL FOR DFSMS/MVS 06500000
                                       IN BINARY                     */ 06550000
        5 R85PFMID CHAR(8),         /* SMP/E FMID FOR OAM.           */ 06600000
        5 *        CHAR(4),         /* RESERVED                      */ 06650000
        5 R85PCPUI CHAR(8),         /* CPU ID AS STORED BY STIPD     */ 06700000
        5 R85PJOBN CHAR(8),         /* JOB NAME                      */ 06750000
        5 R85PSTPN CHAR(8),         /* STEP NAME                     */ 06800000
        5 R85PPRCN CHAR(8),         /* PROCEDURE NAME                */ 06850000
        5 R85PPGMN CHAR(8),         /* PROGRAM NAME                  */ 06900000
        5 R85USRID CHAR(8),         /* USER IDENTIFICATION           */ 06950000
        5 R85PTRXN  CHAR(8),        /* TRANSACTION NAME              */ 07000000
        5 R85PSTRT CHAR(8),         /* STARTING TIME OF FUNCTION, IN    07050000
                                       8-BYTE S/390 STORE CLOCK (STCK)  07100000
                                       INSTRUCTION FORMAT.           */ 07150000
        5 R85PENDT CHAR(8),         /* ENDING TIME OF FUNCTION, IN      07200000
                                       8-BYTE S/390 STORE CLOCK (STCK)  07250000
                                       INSTRUCTION FORMAT.           */ 07300000
        5 R85PRESP FIXED(32),       /* ELASPED TIME OF FUNCTION,        07350000
                                       IN MILLISECONDS (.001            07400000
                                       SECOND UNITS)                    07433300
                                                                     */ 07466600
        5 *        CHAR(12),        /* RESERVED                      */ 07500000
        5 R85PEND  CHAR(0);         /* END OF OAM PRODUCT ID SECTION */ 07550000
 %IF SMF85S01 ^= '' |                                                   07600000
     SMF85S02 ^= '' |                                                   07650000
     SMF85S03 ^= '' |                                                   07700000
     SMF85S04 ^= '' |                                                   07750000
     SMF85S05 ^= '' |                                                   07800000
     SMF85S06 ^= '' |                                                   07850000
     SMF85S07 ^= '' %THEN                                               07900000
   %DO;                                                                 07950000
 @EJECT;                            /*                               */ 08000000
 /********************************************************************/ 08050000
 /*                                                                  */ 08100000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 1 - 7.                         */ 08150000
 /*                                                                  */ 08200000
 /* SUBTYPE FUNCTION                                                 */ 08250000
 /* ------- ---------------------------------------------------      */ 08300000
 /*       1 OSREQ ACCESS                                             */ 08350000
 /*       2 OSREQ STORE                                              */ 08400000
 /*       3 OSREQ RETRIEVE                                           */ 08450000
 /*       4 OSREQ QUERY                                              */ 08500000
 /*       5 OSREQ CHANGE                                             */ 08550000
 /*       6 OSREQ DELETE                                             */ 08600000
 /*       7 OSREQ UNACCESS                                           */ 08650000
 /*                                                                  */ 08700000
 /********************************************************************/ 08750000
 DECLARE                            /*                               */ 08800000
     1 ST1 DEFINED(R85PEND),        /* SUBTYPES 1 - 7                */ 08850000
       3 ST1COLN  CHAR(44),         /* COLLECTION NAME               */ 08900000
       3 ST1OBJN  CHAR(44),         /* OBJECT NAME                   */ 08950000
       3 ST1SGN   CHAR(8),          /* STORAGE GROUP NAME            */ 09000000
       3 ST1SCN   CHAR(8),          /* STORAGE CLASS NAME            */ 09050000
       3 ST1MCN   CHAR(8),          /* MANAGEMENT CLASS NAME         */ 09100000
       3 ST1OFF   FIXED(32),        /* OFFSET FOR PARTIAL OBJECT        09150000
                                       RETRIEVE (SUBTYPE 3), ZERO FOR   09200000
                                       ALL OTHERS.                   */ 09250000
       3 ST1LEN   FIXED(32),        /* LENGTH,                          09300000
                                       SUBTYPE 1 - UNUSED               09350000
                                       SUBTYPE 2 - LENGTH OF OBJECT     09400000
                                                   STORED               09450000
                                       SUBTYPE 3 - NUMBER OF BYTES      09500000
                                                   RETRIEVED            09550000
                                       SUBTYPE 4 - NUMBER OF QEL        09600000
                                                   ELEMENTS RETURNED.   09650000
                                       SUBTYPE 5 - UNUSED               09700000
                                       SUBTYPE 6 - LENGTH OF OBJECT     09750000
                                                   DELETED              09800000
                                       SUBTYPE 7 - UNUSED            */ 09850000
       3 ST1TTOK  CHAR(16),         /* OSREQ TRACKING TOKEN, SUPPLIED   09900000
                                       WITH TTOKEN KEYWORD ON OSREQ     09950000
                                       MACRO                         */ 10000000
       3 ST1TOK   CHAR(8),          /* OSREQ ACCESS TOKEN            */ 10050000
       3 ST1VSN   CHAR(6),          /* VOLUME SERIAL NUMBER          */ 10100000
       3 ST1VMT   CHAR(2),          /* VOLUME MEDIA TYPE             */ 10150000
       3 ST1RC    FIXED(31),        /* OSREQ RETURN CODE, IN REGISTER   10200000
                                       15 FOLLOWING OSREQ MACRO      */ 10250000
       3 ST1RS    FIXED(31),        /* OSREQ REASON CODE, IN REGISTER   10300000
                                       15 FOLLOWING OSREQ MACRO      */ 10350000
       3 ST1FLGS  BIT(32);          /* PROCESSING FLAGS. MEANING        10400000
                                       DEPENDENT ON RECORD SUBTYPE.  */ 10450000
    DECLARE                         /*                               */ 10500000
      1 ST2FLGS BIT(32) DEFINED(ST1FLGS), /* MEANING OF FLAGS FOR       10550000
                                       SUBTYPE 2 (OSREQ STORE)       */ 10600000
         3 ST2FLGS0 BIT(1),         /* OBJECT STORE TO DASD          */ 10650000
         3 ST2FLGS1 BIT(1),         /* OBJECT STORE TO OPTICAL       */ 10700000
         3 ST2FLGS2 BIT(1),         /* OBJECT STORE TO TAPE          */ 10750000
         3 ST2FLGS3 BIT(1),         /* UNUSED                        */ 10800000
         3 ST2FLGS4 BIT(1),         /* UNUSED                        */ 10850000
         3 ST2FLGS5 BIT(1),         /* WHEN ON, THE OSREQ STORE         10900000
                                       REQUEST RESULTED IN THE MOUNTING 10950000
                                       OF A SHELF-RESIDENT REMOVABLE    11000000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   11050000
                                       BY A HUMAN OPERATOR. ONLY VALID  11100000
                                       IF BIT 1 OR 2 IS ON.          */ 11150000
         3 ST2FLGS6 BIT(1),         /* WHEN ON, THE OSREQ STORE         11200000
                                       REQUEST RESULTED IN THE MOUNTING 11250000
                                       OF A LIBRARY-RESIDENT REMOVABLE  11300000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   11350000
                                       BY A HUMAN OPERATOR. ONLY VALID  11400000
                                       IF BIT 1 OR 2 IS ON.          */ 11450000
         3 ST2FLGS7 BIT(1),         /* WHEN ON, THE OSREQ STORE         11500000
                                       REQUEST WAS SATISIFIED USING     11550000
                                       AN ALREADY MOUNTED REMOVEABLE    11600000
                                       MEDIA VOLUME (TAPE OR OPTICAL).  11650000
                                       ONLY VALID                       11700000
                                       IF BIT 1 OR 2 IS ON.          */ 11750000
         3 *        BIT(24);        /* RESERVED.                     */ 11800000
    DECLARE                         /*                               */ 11850000
      1 ST3FLGS BIT(32) DEFINED(ST1FLGS), /* MEANING OF FLAGS FOR       11900000
                                       SUBTYPE 3 (OSREQ RETRIEVE)    */ 11950000
         3 ST3FLGS0 BIT(1),         /* WHEN ON, PRIMARY COPY OF OBJECT  12000000
                                       RETRIEVED FROM DASD.          */ 12050000
         3 ST3FLGS1 BIT(1),         /* WHEN ON, PRIMARY COPY OF OBJECT  12100000
                                       RETRIEVED FROM OPTICAL.       */ 12150000
         3 ST3FLGS2 BIT(1),         /* WHEN ON, PRIMARY COPY OF OBJECT  12200000
                                       RETRIEVED FROM TAPE.          */ 12250000
         3 ST3FLGS3 BIT(1),         /* WHEN ON, THE BACKUP COPY WAS     12300000
                                       RETRIEVED FROM OPTICAL AS A      12350000
                                       RESULT OF VIEW=BACKUP BEING      12400000
                                       SPECIFIED ON THE OSREQ MACRO. */ 12450000
         3 ST3FLGS4 BIT(1),         /* WHEN ON, THE BACKUP COPY WAS     12500000
                                       RETRIEVED FROM TAPE AS A         12550000
                                       RESULT OF VIEW=BACKUP BEING      12600000
                                       SPECIFIED ON THE OSREQ MACRO. */ 12650000
         3 ST3FLGS5 BIT(1),         /* WHEN ON, THE BACKUP COPY WAS     12700000
                                       RETRIEVED FROM OPTICAL AS A      12750000
                                       RESULT OF THE PRIMARY COPY       12800000
                                       OF THE OBJECT RESIDING ON AN     12850000
                                       UNREADABLE OPTICAL DISK VOLUME   12900000
                                       AND THE AUTOMATIC ACCESS TO      12950000
                                       BACKUP FACILITY WAS ACTIVE.   */ 13000000
         3 ST3FLGS6 BIT(1),         /* WHEN ON, THE BACKUP COPY WAS     13050000
                                       RETRIEVED FROM TAPE AS A         13100000
                                       RESULT OF THE PRIMARY COPY       13150000
                                       OF THE OBJECT RESIDING ON AN     13200000
                                       UNREADABLE OPTICAL DISK VOLUME   13250000
                                       AND THE AUTOMATIC ACCESS TO      13300000
                                       BACKUP FACILITY WAS ACTIVE.   */ 13350000
         3 ST3FLGS7 BIT(1),         /* WHEN ON, THE OSREQ RETRIEVE      13400000
                                       REQUEST RESULTED IN THE MOUNTING 13450000
                                       OF A SHELF-RESIDENT REMOVABLE    13500000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   13550000
                                       BY A HUMAN OPERATOR. ONLY VALID  13600000
                                       IF BIT 1, 2, 3, 5 OR 6 IS ON. */ 13650000
         3 ST3FLGS8 BIT(1),         /* WHEN ON, THE OSREQ RETRIEVE      13700000
                                       REQUEST RESULTED IN THE MOUNTING 13750000
                                       OF A LIBRARY-RESIDENT REMOVABLE  13800000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   13850000
                                       BY A HUMAN OPERATOR. ONLY VALID  13900000
                                       IF BIT 1, 2, 3, 5 OR 6 IS ON. */ 13950000
         3 ST3FLGS9 BIT(1),         /* WHEN ON, THE OSREQ RETRIEVE      14000000
                                       REQUEST WAS SATISIFIED USING     14050000
                                       AN ALREADY MOUNTED REMOVEABLE    14100000
                                       MEDIA VOLUME (TAPE OR OPTICAL).  14150000
                                       ONLY VALID                       14200000
                                       IF BIT 1, 2, 3, 5 OR 6 IS ON. */ 14250000
         3 *        BIT(22);        /* RESERVED.                     */ 14300000
    DECLARE                         /*                               */ 14350000
        ST4FLGS BIT(32) DEFINED(ST1FLGS); /* SUBTYPE 4 (OSREQ QUERY)    14400000
                                       FLAGS.  ALL BITS RESERVED.    */ 14450000
    DECLARE                         /*                               */ 14500000
      1 ST5FLGS BIT(32) DEFINED(ST1FLGS), /* SUBTYPE 5 (OSREQ CHANGE)   14550000
                                       FLAGS.                        */ 14600000
         3 ST5FLG0 BIT(1),          /* WHEN ON, MANAGEMENT CLASS        14650000
                                       SPECIFIED ON OSREQ CHANGE.    */ 14700000
         3 ST5FLG1 BIT(1),          /* WHEN ON, STORAGE CLASS           14750000
                                       SPECIFIED ON OSREQ CHANGE.    */ 14800000
         3 ST5FLG2 BIT(1),          /* WHEN ON, RETENTION PERIOD        14850000
                                       SPECIFIED ON OSREQ CHANGE.    */ 14900000
         3 *        BIT(29);        /* RESERVED.                     */ 14950000
    DECLARE                         /*                               */ 15000000
      1 ST6FLGS BIT(32) DEFINED(ST1FLGS), /* SUBTYPE 5 (OSREQ DELETE)   15050000
                                       FLAGS.                        */ 15100000
         3 ST6FLG0 BIT(1),          /* WHEN ON, PRIMARY COPY OF OBJECT  15150000
                                       DELETED FROM DASD.            */ 15200000
         3 ST6FLG1 BIT(1),          /* WHEN ON, PRIMARY COPY OF OBJECT  15250000
                                       DELETED FROM OPTICAL.         */ 15300000
         3 ST6FLG2 BIT(1),          /* WHEN ON, PRIMARY COPY OF OBJECT  15350000
                                       DELETED FROM TAPE.            */ 15400000
         3 ST6FLG3 BIT(1),          /* WHEN ON, BACKUP COPY OF OBJECT   15450000
                                       DELETED FROM OPTICAL.         */ 15500000
         3 ST6FLG4 BIT(1),          /* WHEN ON, BACKUP COPY OF OBJECT   15550000
                                       DELETED FROM TAPE.            */ 15600000
         3 *        BIT(27);        /* RESERVED.                     */ 15650000
    DECLARE                         /*                               */ 15700000
        ST7FLGS BIT(32) DEFINED(ST1FLGS); /* SUBTYPE 7 (OSREQ UNACCESS) 15750000
                                       FLAGS.  ALL BITS RESERVED.    */ 15800000
    DECLARE                         /*                               */ 15850000
      SMFST1L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     15900000
                                 LENGTH(ST1)),                          15950000
      SMFST2L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16000000
                                 LENGTH(ST1)),                          16050000
      SMFST3L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16100000
                                 LENGTH(ST1)),                          16150000
      SMFST4L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16200000
                                 LENGTH(ST1)),                          16250000
      SMFST5L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16300000
                                 LENGTH(ST1)),                          16350000
      SMFST6L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16400000
                                 LENGTH(ST1)),                          16450000
      SMFST7L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16500000
                                 LENGTH(ST1));                          16550000
   %END;                                                                16600000
 %IF SMF85S32 ^= '' |                                                   16650000
     SMF85S33 ^= '' |                                                   16700000
     SMF85S34 ^= '' |                                                   16750000
     SMF85S35 ^= '' %THEN                                               16800000
   %DO;                                                                 16850000
 @EJECT;                            /*                               */ 16900000
 /********************************************************************/ 16950000
 /*                                                                  */ 17000000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 32 - 35                        */ 17050000
 /*                                                                  */ 17100000
 /* SUBTYPE FUNCTION                                                 */ 17150000
 /* ------- ---------------------------------------------------      */ 17200000
 /*      32 OSMC STORAGE GROUP PROCESSING                            */ 17250000
 /*      33 OSMC DASD SPACE MANAGEMENT PROCESSING                    */ 17300000
 /*      34 OSMC OPTICAL DISK RECOVERY UTILITY                       */ 17350000
 /*      35 OSMC MOVE VOLUME (MOVEVOL) UTILITY                       */ 17400000
 /*                                                                  */ 17450000
 /********************************************************************/ 17500000
 DECLARE                            /*                               */ 17550000
     1 ST32 DEFINED(R85PEND),       /* SUBTYPES 32 - 35              */ 17600000
       3 ST32SGN  CHAR(8),          /* STORAGE GROUP NAME            */ 17650000
       3 ST32VSN0 CHAR(6),          /* VOLUME SERIAL NUMBER OF OPTICAL  17700000
                                       VOLUME. ONLY VALID FOR SUBTYPES  17750000
                                       34 AND 35, CONTAINS BLANKS FOR   17800000
                                       OTHER SUBTYPES.               */ 17850000
       3 ST32VSN1 CHAR(6),          /* VOLUME SERIAL NUMBER OF OPPOSITE 17900000
                                       SIDE OF OPTICAL DISK             17950000
                                       VOLUME. ONLY VALID FOR SUBTYPES  18000000
                                       34 AND 35, CONTAINS BLANKS FOR   18050000
                                       OTHER SUBTYPES.               */ 18100000
       3 ST32OMT  CHAR(2),          /* OPTICAL MEDIA TYPE. ONLY VALID   18150000
                                       FOR SUBTYPES 34 AND 35, CONTAINS 18200000
                                       BLANKS FOR OTHER SUBTYPES.    */ 18250000
       3 *        CHAR(2),          /* RESERVED                      */ 18300000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   18350000
          DELETED FROM DASD. */                                         18400000
       3 ST32PDWO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        18450000
                                       WRITTEN TO DASD.              */ 18500000
       3 ST32PDWK FIXED(32),        /* NUMBER OF KILOBYTES PRIMARY      18550000
                                       OBJECTS WRITTEN TO DASD.      */ 18600000
       3 ST32PDRO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        18650000
                                       READ FROM DASD.               */ 18700000
       3 ST32PDRK FIXED(32),        /* NUMBER OF KILOBYTES PRIMARY      18750000
                                       OBJECTS READ FROM DASD.       */ 18800000
       3 ST32PDDO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        18850000
                                       DELETED FROM DASD.            */ 18900000
       3 ST32PDDK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   18950000
                                       OBJECTS DELETED FROM DASD.    */ 19000000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   19050000
          DELETED FROM OPTICAL. */                                      19100000
       3 ST32POWO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        19150000
                                       WRITTEN TO OPTICAL.           */ 19200000
       3 ST32POWK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   19250000
                                       OBJECTS WRITTEN TO OPTICAL.   */ 19300000
       3 ST32PORO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        19350000
                                       READ FROM OPTICAL.            */ 19400000
       3 ST32PORK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   19450000
                                       OBJECTS READ FROM OPTICAL.    */ 19500000
       3 ST32PODO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        19550000
                                       DELETED FROM OPTICAL.         */ 19600000
       3 ST32PODK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   19650000
                                       OBJECTS DELETED FROM OPTICAL. */ 19700000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   19750000
          DELETED FROM TAPE. */                                         19800000
       3 ST32PTWO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        19850000
                                       WRITTEN TO TAPE.              */ 19900000
       3 ST32PTWK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   19950000
                                       OBJECTS WRITTEN TO TAPE.      */ 20000000
       3 ST32PTRO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        20050000
                                       READ FROM TAPE.               */ 20100000
       3 ST32PTRK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   20150000
                                       OBJECTS READ FROM TAPE.       */ 20200000
       3 ST32PTDO FIXED(32),        /* NUMBER OF PRIMARY OBJECTS        20250000
                                       LOGICALLY DELETED FROM TAPE.  */ 20300000
       3 ST32PTDK FIXED(32),        /* NUMBER OF KILOBYTES OF PRIMARY   20350000
                                       OBJECTS LOGICALLY DELETED FROM   20400000
                                       TAPE.                         */ 20450000
       /* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND    20500000
          DELETED FROM OPTICAL. */                                      20550000
       3 ST32BOWO FIXED(32),        /* NUMBER OF BACKUP  OBJECTS        20600000
                                       WRITTEN TO OPTICAL.           */ 20650000
       3 ST32BOWK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    20700000
                                       OBJECTS WRITTEN TO OPTICAL.   */ 20750000
       3 ST32BORO FIXED(32),        /* NUMBER OF BACKUP OBJECTS         20800000
                                       READ FROM OPTICAL.            */ 20850000
       3 ST32BORK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    20900000
                                       OBJECTS READ FROM OPTICAL.    */ 20950000
       3 ST32BODO FIXED(32),        /* NUMBER OF BACKUP  OBJECTS        21000000
                                       DELETED FROM OPTICAL.         */ 21050000
       3 ST32BODK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    21100000
                                       OBJECTS DELETED FROM OPTICAL. */ 21150000
       /* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND    21200000
          DELETED FROM TAPE. */                                         21250000
       3 ST32BTWO FIXED(32),        /* NUMBER OF BACKUP  OBJECTS        21300000
                                       WRITTEN TO TAPE.              */ 21350000
       3 ST32BTWK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    21400000
                                       OBJECTS WRITTEN TO TAPE.      */ 21450000
       3 ST32BTRO FIXED(32),        /* NUMBER OF BACKUP  OBJECTS        21500000
                                       READ FROM TAPE.               */ 21550000
       3 ST32BTRK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    21600000
                                       OBJECTS READ FROM TAPE.       */ 21650000
       3 ST32BTDO FIXED(32),        /* NUMBER OF BACKUP  OBJECTS        21700000
                                       LOGICALLY DELETED FROM TAPE.  */ 21750000
       3 ST32BTDK FIXED(32),        /* NUMBER OF KILOBYTES OF BACKUP    21800000
                                       OBJECTS LOGICALLY DELETED FROM   21850000
                                       TAPE.                         */ 21900000
       /* COUNTS OF ACTIVITY AGAINST THE OBJECT STORAGE DATABASE        21950000
          (OBJECT DIRECTORY TABLE, 4K OBJECT STORAGE TABLE AND 32K      22000000
          OBJECT STORAGE TABLE).                                    */  22050000
       3 ST32DTUP  FIXED(32),       /* NUMBER OF ROWS UPDATED IN THE    22100000
                                       OBJECT DIRECTORY TABLE.       */ 22150000
       3 ST32DTDE  FIXED(32),       /* NUMBER OF ROWS DELETED FROM THE  22200000
                                       OBJECT DIRECTORY TABLE.       */ 22250000
       3 ST324KIN  FIXED(32),       /* NUMBER OF ROWS INSERTED INTO THE 22300000
                                       4K OBJECT STORAGE TABLE.      */ 22350000
       3 ST324KDE  FIXED(32),       /* NUMBER OF ROWS DELETED FROM THE  22400000
                                       4K OBJECT STORAGE TABLE.      */ 22450000
       3 ST3232KI  FIXED(32),       /* NUMBER OF ROWS INSERTED INTO THE 22500000
                                       32K OBJECT STORAGE TABLE.      */22550000
       3 ST3232KD  FIXED(32),       /* NUMBER OF ROWS DELETED FROM THE  22600000
                                       32K OBJECT STORAGE TABLE.      */22650000
       3 ST32NCE   FIXED(32),       /* NUMBER OF OPTICAL CARTRIDGES     22653300
                                       EXPIRED.  VALID ONLY FOR         22656600
                                       SUBTYPE 32.                   */ 22659900
       3 ST32FLGS  BIT(32),         /* PROCESSING FLAGS              */ 22663200
         5 ST32FLG0 BIT(1),         /* WHEN ON, THIS PROCESS WAS        22666500
                                       INVOKED AUTOMATICALLY UNDER      22669800
                                       SOFTWARE CONTROL.             */ 22673100
         5 ST32FLG1 BIT(1),         /* WHEN ON, THIS PROCESS WAS        22676400
                                       INVOKED BY A MODIFY OAM,START    22679700
                                       COMMAND.                      */ 22683000
         5 ST32FLG2 BIT(1),         /* WHEN ON, THIS PROCESS WAS        22686300
                                       INVOKED USING AN ISMF LINE       22689600
                                       OPERATOR.                     */ 22692900
         5 *        BIT(29);        /* RESERVED.                     */ 22696200
    DECLARE                         /*                               */ 22700000
      SMFST32L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22750000
                                 LENGTH(ST32)),                         22800000
      SMFST33L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22850000
                                 LENGTH(ST32)),                         22900000
      SMFST34L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22950000
                                 LENGTH(ST32)),                         23000000
      SMFST35L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    23050000
                                 LENGTH(ST32));                         23100000
   %END;                                                                23150000
 %IF SMF85S36 ^= '' %THEN                                               23200000
   %DO;                                                                 23250000
 @EJECT;                            /*                               */ 23300000
 /********************************************************************/ 23350000
 /*                                                                  */ 23400000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 36                             */ 23450000
 /*                                                                  */ 23500000
 /* SUBTYPE FUNCTION                                                 */ 23550000
 /* ------- ---------------------------------------------------      */ 23600000
 /*      36 OSMC SINGLE OBJECT RECOVERY UTILITY                      */ 23650000
 /*                                                                  */ 23700000
 /********************************************************************/ 23750000
 DECLARE                            /*                               */ 23800000
     1 ST36 DEFINED(R85PEND),       /* SUBTYPE 36                    */ 23850000
       3 ST36COLN  CHAR(44),        /* COLLECTION NAME               */ 23900000
       3 ST36CNID  FIXED(32),       /* COLLECTION ID                 */ 23950000
       3 ST36OBJN  CHAR(44),        /* OBJECT NAME                   */ 24000000
       3 ST36SGN   CHAR(8),         /* STORAGE GROUP NAME            */ 24050000
       3 ST36OLEN  FIXED(32),       /* OBJECT LENGTH                 */ 24100000
       3 ST36BVSN  CHAR(6),         /* VOLUME SERIAL NUMBER OF OPTICAL  24150000
                                       VOLUME OR TAPE VOLUME FROM WHICH 24200000
                                       THE BACKUP COPY OF THE OBJECT    24250000
                                       WAS READ.                     */ 24300000
       3 ST36BMT   CHAR(2),         /* MEDIA TYPE OF THE VOLUME FROM    24350000
                                       WHICH THE BACKUP COPY OF THE     24400000
                                       BACKUP COPY OF THE OBJECT WAS    24450000
                                       READ.                         */ 24500000
       3 ST36BTKN  FIXED(32),       /* VOLUME LOCATION TOKEN ASSOCIATED 24550000
                                       WITHE BACKUP COPY OF THE OBJECT  24600000
                                       ON THE VOLUME SPECIFIED IN THE   24650000
                                       ST36BVSN FIELD.               */ 24700000
       3 ST36TVSN  CHAR(6),         /* VOLUME SERIAL NUMBER OF OPTICAL  24750000
                                       VOLUME OR TAPE VOLUME TO WHICH   24800000
                                       THE NEW PRIMARY COPY OF THE      24850000
                                       OBJECT WAS WRITTEN.  THIS FIELD  24900000
                                       CONTAINS BLANKS IF THE NEW       24950000
                                       PRIMARY COPY WAS WRITTEN TO      25000000
                                       DASD.                         */ 25050000
       3 ST36TMT   CHAR(2),         /* MEDIA TYPE OF THE VOLUME TO      25100000
                                       WHICH THE NEW PRIMARY COPY OF    25150000
                                       OBECT WAS WRITTEN.            */ 25200000
       3 ST36OVSN  CHAR(6),         /* VOLUME SERIAL NUMBER OF THE      25250000
                                       ORIGINAL OPTICAL OR TAPE VOLUME  25300000
                                       ON WHICH THE PRIMARY COPY OF THE 25350000
                                       OBJECT RESIDED PRIOR TO THE      25400000
                                       START OF THE SINGLE OBJECT       25450000
                                       RECOVERY UTILITY.  THIS FIELD    25500000
                                       CONTAINS BLANKS, IF THE PRIMARY  25550000
                                       COPY OF THE OBJECT CURRENTLY     25600000
                                       RESIDES ON DASD.              */ 25650000
       3 ST36OMT   CHAR(2),         /* MEDIA TYPE OF THE ORIGINAL       25700000
                                       OPTICAL OR TAPE VOLUME ON WHICH  25750000
                                       THE PRIMARY COPY OF THE OBJECT   25800000
                                       RESIDED PRIOR TO THE START OF    25850000
                                       THE SINGLE OBJECT RECOVERY       25900000
                                       UTILITY.  THIS FIELD             25950000
                                       CONTAINS BLANKS, IF THE PRIMARY  26000000
                                       COPY OF THE OBJECT CURRENTLY     26050000
                                       RESIDES ON DASD.              */ 26100000
       3 ST36FLGS  BIT(32);         /* PROCESSING FLAGS, ALL BITS       26150000
                                       CURRENTLY RESERVED.           */ 26200000
    DECLARE                         /*                               */ 26250000
      SMFST36L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    26300000
                                 LENGTH(ST36));                         26350000
   %END;                                                                26400000
 %IF SMF85S37 ^= '' %THEN                                               26450000
   %DO;                                                                 26500000
 @EJECT;                            /*                               */ 26550000
 /********************************************************************/ 26600000
 /*                                                                  */ 26650000
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 37                              */ 26700000
 /*                                                                  */ 26750000
 /* SUBTYPE FUNCTION                                                 */ 26800000
 /* ------- ---------------------------------------------------      */ 26850000
 /*      37 OSMC LIBRARY SPACE MANAGEMENT UTILITY                    */ 26900000
 /*                                                                  */ 26950000
 /********************************************************************/ 27000000
 DECLARE                            /*                               */ 27050000
     1 ST37 DEFINED(R85PEND),       /* SUBTYPE 37                    */ 27100000
       3 ST37LIBN CHAR(8),          /* OPTICAL LIBRARY NAME          */ 27150000
       3 ST37LIBD CHAR(8),          /* OPTICAL LIBRARY DEVICE TYPE   */ 27200000
       3 ST37NOCE FIXED(32),        /* NUMBER OF OPTICAL DISK           27250000
                                       CARTRIDGES EJECTED.           */ 27300000
       3 ST37FLGS BIT(32),          /* PROCESSING FLAGS              */ 27350000
         5 ST37FLG0 BIT(1),         /* WHEN ON, LIBRARY SPACE MANAGEMENT27400000
                                       WAS INVOKED AUTOMATICALLY UNDER  27450000
                                       SOFTWARE CONTROL, DUE TO A       27500000
                                       "STORAGE GROUP OUT-OF-SPACE"     27550000
                                       CONDITION IN THE SPECIFIED       27600000
                                       LIBRARY.                      */ 27650000
         5 ST37FLG1 BIT(1),         /* WHEN ON, LIBRARY SPACE MANAGEMENT27700000
                                       WAS INVOKED BY A "F OAM,START    27750000
                                       LIBMGT,LIBNAME" COMMAND ISSUED   27800000
                                       FROM AN MVS CONSOLE.          */ 27850000
         5 *        BIT(30);        /* RESERVED                      */ 27900000
    DECLARE                         /*                               */ 27950000
      SMFST37L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    28000000
                                 LENGTH(ST37));                         28050000
   %END;                                                                28100000
 %IF SMF85S64 ^= '' |                                                   28150000
     SMF85S65 ^= '' |                                                   28200000
     SMF85S66 ^= '' |                                                   28250000
     SMF85S67 ^= '' %THEN                                               28300000
   %DO;                                                                 28350000
 @EJECT;                            /*                               */ 28400000
 /********************************************************************/ 28450000
 /*                                                                  */ 28500000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 64 - 67                        */ 28550000
 /*                                                                  */ 28600000
 /* SUBTYPE FUNCTION                                                 */ 28650000
 /* ------- ---------------------------------------------------      */ 28700000
 /*      64 LCS OPTICAL OPTICAL DRIVE VARY ONLINE                    */ 28750000
 /*      65 LCS OPTICAL OPTICAL DRIVE VARY OFFLINE                   */ 28800000
 /*      66 LCS OPTICAL OPTICAL LIBRARY VARY ONLINE                  */ 28850000
 /*      67 LCS OPTICAL OPTICAL LIBRARY VARY OFFLINE                 */ 28900000
 /*                                                                  */ 28950000
 /********************************************************************/ 29000000
 DECLARE                            /*                               */ 29050000
     1 ST64 DEFINED(R85PEND),       /* SUBTYPES 64 - 67              */ 29100000
       3 ST64OLN  CHAR(8),          /* OPTICAL LIBRARY NAME          */ 29150000
       3 ST64OLDT CHAR(8),          /* OPTICAL LIBRARY DEVICE TYPE   */ 29200000
       3 ST64OLDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  29250000
                                       TO THE OPTICAL LIBRARY        */ 29300000
       3 ST64ODN  CHAR(8),          /* OPTICAL DRIVE NAME, ONLY VALID   29350000
                                       FOR SUBTYPES 64 AND 65.       */ 29400000
       3 ST64ODDT CHAR(8),          /* OPTICAL DRIVE DEVICE TYPE, ONLY  29450000
                                       VALID FOR SUBTYPES 64 AND 65. */ 29500000
       3 ST64ODDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  29550000
                                       TO THE OPTICAL DRIVE.  ONLY      29600000
                                       VALID FOR SUBTYPES 64 AND 65. */ 29650000
       3 ST64VSN0 CHAR(6),          /* OPTICAL VOLUME SERIAL NUMBER OF  29700000
                                       CURRENTLY MOUNTED VOLUME.        29750000
                                       VALID FOR SUBTYPES 64 AND 65,    29800000
                                       CONTAINS BLANKS FOR OTHER        29850000
                                       SUBTYPES.                     */ 29900000
       3 ST64VSN1 CHAR(6),          /* OPPOSITE SIDE OF                 29950000
                                       CURRENTLY MOUNTED VOLUME.        30000000
                                       VALID FOR SUBTYPES 64 AND 65,    30050000
                                       CONTAINS BLANKS FOR OTHER        30100000
                                       SUBTYPES.                     */ 30150000
       3 ST64OMT   CHAR(2),         /* OPTICAL MEDIA TYPE OF CURRENTLY  30200000
                                       MOUNTED OPTICAL VOLUME.       */ 30250000
       3 ST64ODT  CHAR(1),          /* OPTICAL DRIVE TYPE.  L=LIBRARY   30300000
                                       RESIDENT, S=STANDALONE.          30350000
                                       VALID FOR SUBTYPES 64 AND 65,    30400000
                                       CONTAINS BLANKS FOR OTHER        30450000
                                       SUBTYPES.                     */ 30500000
       3 ST64OVT  CHAR(1),          /* OPTICAL VOLUME TYPE.             30550000
                                       G = OBJECT STORAGE GROUP,        30600000
                                       B = OBJECT BACKUP STOR GROUP,    30650000
                                       S = SCRATCH OPTICAL VOLUME.      30700000
                                       VALID FOR SUBTYPES 64 AND 65,    30750000
                                       CONTAINS BLANKS FOR OTHER        30800000
                                       SUBTYPES.                     */ 30850000
       3 ST64SGN  CHAR(8),          /* STORAGE GROUP NAME.  ONLY VALID  30900000
                                       IF ST64VSN0 CONTAINS VOLSER,     30950000
                                       BLANKS OTHERWISE.                31000000
                                       VALID FOR SUBTYPES 64 AND 65,    31050000
                                       CONTAINS BLANKS FOR OTHER        31100000
                                       SUBTYPES.                     */ 31150000
       3 ST64LIQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 31200000
                                       THIS REQUEST SPENT ON THE LCS    31250000
                                       INPUT-WORK-QUEUE WAITING TO      31300000
                                       PROCESSED.                    */ 31350000
       3 ST64LDQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 31400000
                                       THIS REQUEST SPENT ON THE LCS    31450000
                                       DISPATCHER-QUEUE WAITING TO      31500000
                                       PROCESSED.                    */ 31550000
       3 ST64LEQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 31600000
                                       THIS REQUEST SPENT ON THE LCS    31650000
                                       EXECUTION-QUEUE BEING            31700000
                                       PROCESSED.                    */ 31750000
       3 ST64LTQT FIXED(32),        /* LIBRARY TASK QUEUE TIME.         31800000
                                       AMOUNT OF TIME (IN MILLISECONDS) 31850000
                                       THIS REQUEST SPENT ON THE LCS    31900000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   31950000
                                       WAITING TO BE PROCESSED.         32000000
                                       NORMALLY, THIS FIELD REPRESENTS  32050000
                                       CARTRIDGES TRANSPORT MECHANISM   32100000
                                       WAIT TIME.  THAT IS, THE AMOUNT  32150000
                                       OF TIME WAITING FOR THE CARTRIDGE32200000
                                       TRANSPORT MECHANISM (ROBOT) TO   32250000
                                       BECOME AVAILABLE WITHIN AN       32300000
                                       AUTOMATED STORAGE LIBRARY.    */ 32350000
       3 ST64LTPT FIXED(32),        /* LIBRARY TASK PROCESSING TIME.    32400000
                                       AMOUNT OF TIME (IN MILLISECONDS) 32450000
                                       THIS REQUEST TOOK TO BE          32500000
                                       PROCESSED BY THE LIBRARY TASK.   32550000
                                       WAITING TO BE PROCESSED.         32600000
                                       NORMALLY, THIS FIELD REPRESENTS  32650000
                                       CARTRIDGES TRANSPORT MECHANISM   32700000
                                       SERVICE TIME.  THAT IS, THE      32750000
                                       TIME SPENT BY THE                32800000
                                       CARTRIDGE TRANSPORT MECHANISM    32850000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN32900000
                                       THE OPTICAL DISK LIBRARY.     */ 32950000
       3 ST64RC  FIXED(32),         /* LCS RETURN CODE               */ 33000000
       3 ST64RS  FIXED(32),         /* LCS REASON CODE               */ 33050000
       3 ST64FLGS BIT(32);          /* PROCESSING FLAGS, RESERVED.   */ 33100000
    DECLARE                         /*                               */ 33150000
      SMFST64L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33200000
                                 LENGTH(ST64)),                         33250000
      SMFST65L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33300000
                                 LENGTH(ST64)),                         33350000
      SMFST66L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33400000
                                 LENGTH(ST64)),                         33450000
      SMFST67L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33500000
                                 LENGTH(ST64));                         33550000
   %END;                                                                33600000
 %IF SMF85S68 ^= '' |                                                   33650000
     SMF85S69 ^= '' |                                                   33700000
     SMF85S70 ^= '' |                                                   33750000
     SMF85S71 ^= '' |                                                   33800000
     SMF85S72 ^= '' |                                                   33850000
     SMF85S73 ^= '' %THEN                                               33900000
   %DO;                                                                 33950000
 @EJECT;                            /*                               */ 34000000
 /********************************************************************/ 34050000
 /*                                                                  */ 34100000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 68 - 71                        */ 34150000
 /*                                                                  */ 34200000
 /* SUBTYPE FUNCTION                                                 */ 34250000
 /* ------- ---------------------------------------------------      */ 34300000
 /*      68 LCS OPTICAL CARTRIDGE ENTRY                              */ 34350000
 /*      69 LCS OPTICAL CARTRIDGE EJECT                              */ 34400000
 /*      70 LCS OPTICAL CARTRIDGE LABEL                              */ 34450000
 /*      71 LCS OPTICAL VOLUME AUDIT                                 */ 34500000
 /*      72 LCS OPTICAL VOLUME MOUNT                                 */ 34550000
 /*      73 LCS OPTICAL VOLUME DEMOUNT                               */ 34600000
 /*                                                                  */ 34650000
 /********************************************************************/ 34700000
 DECLARE                            /*                               */ 34750000
     1 ST68 DEFINED(R85PEND),       /* SUBTYPES 68 - 73              */ 34800000
       3 ST68OLN  CHAR(8),          /* OPTICAL LIBRARY NAME          */ 34850000
       3 ST68OLDT CHAR(8),          /* OPTICAL LIBRARY DEVICE TYPE   */ 34900000
       3 ST68OLDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  34950000
                                       TO THE OPTICAL LIBRARY        */ 35000000
       3 ST68ODN  CHAR(8),          /* OPTICAL DRIVE NAME            */ 35050000
       3 ST68ODDT CHAR(8),          /* OPTICAL DRIVE DEVICE TYPE     */ 35100000
       3 ST68ODDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  35150000
                                       TO THE OPTICAL DRIVE.         */ 35200000
       3 ST68VSN0 CHAR(6),          /* OPTICAL VOLUME SERIAL NUMBER  */ 35250000
       3 ST68VSN1 CHAR(6),          /* OPPOSITE SIDE OF                 35300000
                                       VOLSER IN FIELD ST68VSN0      */ 35350000
       3 ST68OMT   CHAR(2),         /* OPTICAL MEDIA TYPE            */ 35400000
       3 ST68ODT  CHAR(1),          /* OPTICAL DRIVE TYPE.  L=LIBRARY   35450000
                                       RESIDENT, S=STANDALONE.       */ 35500000
       3 ST68OVT  CHAR(1),          /* OPTICAL VOLUME TYPE.             35550000
                                       G = OBJECT STORAGE GROUP,        35600000
                                       B = OBJECT BACKUP STOR GROUP,    35650000
                                       S = SCRATCH OPTICAL VOLUME.   */ 35700000
       3 ST68SGN  CHAR(8),          /* STORAGE GROUP NAME.           */ 35750000
       3 ST68LIQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 35800000
                                       THIS REQUEST SPENT ON THE LCS    35850000
                                       INPUT-WORK-QUEUE WAITING TO      35900000
                                       PROCESSED.                    */ 35950000
       3 ST68LDQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 36000000
                                       THIS REQUEST SPENT ON THE LCS    36050000
                                       DISPATCHER-QUEUE WAITING TO      36100000
                                       PROCESSED.                    */ 36150000
       3 ST68LEQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 36200000
                                       THIS REQUEST SPENT ON THE LCS    36250000
                                       EXECUTION-QUEUE BEING            36300000
                                       PROCESSED.                    */ 36350000
       3 ST68LTQT FIXED(32),        /* LIBRARY TASK QUEUE TIME.         36400000
                                       AMOUNT OF TIME (IN MILLISECONDS) 36450000
                                       THIS REQUEST SPENT ON THE LCS    36500000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   36550000
                                       WAITING TO BE PROCESSED.         36600000
                                       NORMALLY, THIS FIELD REPRESENTS  36650000
                                       CARTRIDGE TRANSPORT MECHANISM    36700000
                                       WAIT TIME.  THAT IS, THE AMOUNT  36750000
                                       OF TIME WAITING FOR THE CARTRIDGE36800000
                                       TRANSPORT MECHANISM (ROBOT) TO   36850000
                                       BECOME AVAILABLE WITHIN AN       36900000
                                       AUTOMATED STORAGE LIBRARY.    */ 36950000
       3 ST68LTPT FIXED(32),        /* LIBRARY TASK PROCESSING TIME.    37000000
                                       AMOUNT OF TIME (IN MILLISECONDS) 37050000
                                       THIS REQUEST TOOK TO BE          37100000
                                       PROCESSED BY THE LIBRARY TASK.   37150000
                                       WAITING TO BE PROCESSED.         37200000
                                       NORMALLY, THIS FIELD REPRESENTS  37250000
                                       CARTRIDGES TRANSPORT MECHANISM   37300000
                                       SERVICE TIME.  THAT IS, THE      37350000
                                       TIM SPENT BY THE                 37400000
                                       CARTRIDGE TRANSPORT MECHANISM    37450000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN37500000
                                       THE OPTICAL DISK LIBRARY.     */ 37550000
       3 ST68RC  FIXED(32),         /* LCS RETURN CODE               */ 37600000
       3 ST68RS  FIXED(32),         /* LCS REASON CODE               */ 37650000
       3 ST68FLGS BIT(32),          /* PROCESSING FLAGS, RESERVED.   */ 37700000
         5 ST68FLG0  BIT(1),        /* WHEN ON, THE VOLUME SERIAL       37701600
                                       NUMBER DESCRIBED BY FIELD        37703200
                                       ST68VSN0 REQUIRED FORMATTING AS  37704800
                                       PART OF OPTICAL CARTRIDGE ENTRY  37706400
                                       PROCESSING.                   */ 37708000
         5 ST68FLG1  BIT(1),        /* WHEN ON, THE VOLUME SERIAL       37709600
                                       NUMBER DESCRIBED BY FIELD        37711200
                                       ST68VSN1 REQUIRED FORMATTING AS  37712800
                                       PART OF OPTICAL CARTRIDGE ENTRY  37714400
                                       PROCESSING.                   */ 37716000
         5 ST68FLG2  BIT(1),        /* WHEN ON, THE VOLUME SERIAL       37717600
                                       NUMBER DESCRIBED BY FIELD        37719200
                                       ST68VSN0 WAS NOT KNOWN TO OAM    37720800
                                       AT THE TIME OF BEING ENTERED     37722400
                                       INTO THE OPTICAL LIBRARY, MEANING37724000
                                       THAT THERE WAS NOT A ROW FOR THIS37725600
                                       OPTICAL DISK VOLUME IN THE VOLUME37727200
                                       TABLE IN THE OPTICAL             37728800
                                       CONFIGURATION DATABASE (ODCB).*/ 37730400
         5 ST68FLG3  BIT(1),        /* WHEN ON, THE VOLUME SERIAL       37732000
                                       NUMBER DESCRIBED BY FIELD        37733600
                                       ST68VSN1 WAS NOT KNOWN TO OAM    37735200
                                       AT THE TIME OF BEING ENTERED     37736800
                                       INTO THE OPTICAL LIBRARY, MEANING37738400
                                       THAT THERE WAS NOT ROW FOR THIS  37740000
                                       OPTICAL DISK VOLUME IN THE VOLUME37741600
                                       TABLE IN THE OPTICAL             37743200
                                       CONFIGURATION DATABASE (ODCB).*/ 37744800
         5 *         BIT(28),       /* RESERVED                      */ 37746400
       3 ST68TMNT FIXED(32),        /* ELASPED TIME (IN MILLISECONDS)   37750000
                                       THAT OPTICAL DISK VOLUME WAS     37800000
                                       MOUNTED.                         37850000
                                       ONLY VALID FOR SUBTYPE 73 AND    37900000
                                       SUBTYPE 69 (IN ONE SPECIAL       37950000
                                       CASE).                        */ 38000000
       3 ST68NOW  FIXED(32),        /* NUMBER OF OBJECT WRITTEN TO THIS 38050000
                                       OPTICAL DISK VOLUME WHILE IT     38100000
                                       WAS MOUNTED.                     38150000
                                       ONLY VALID FOR SUBTYPE 73 AND    38200000
                                       SUBTYPE 69 (IN ONE SPECIAL       38250000
                                       CASE).                        */ 38300000
       3 ST68NKBW FIXED(32),        /* NUMBER OF KILOBYTES OF OBJECT    38350000
                                       DATA WRITTEN TO THIS OPTICAL     38400000
                                       DISK VOLUME WHILE IT WAS MOUNTED.38450000
                                       ONLY VALID FOR SUBTYPE 73 AND    38500000
                                       SUBTYPE 69 (IN ONE SPECIAL       38550000
                                       CASE).                        */ 38600000
       3 ST68NOR  FIXED(32),        /* NUMBER OF OBJECT READ FROM THIS  38650000
                                       OPTICAL DISK VOLUME WHILE IT     38700000
                                       WAS MOUNTED.                     38750000
                                       ONLY VALID FOR SUBTYPE 73 AND    38800000
                                       SUBTYPE 69 (IN ONE SPECIAL       38850000
                                       CASE).                        */ 38900000
       3 ST68NKBR FIXED(32),        /* NUMBER OF KILOBYTES OF OBJECT    38950000
                                       DATA READ FROM THIS OPTICAL      39000000
                                       DISK VOLUME WHILE IT WAS MOUNTED.39050000
                                       ONLY VALID FOR SUBTYPE 73 AND    39100000
                                       SUBTYPE 69 (IN ONE SPECIAL       39150000
                                       CASE).                        */ 39200000
       3 ST68NOD  FIXED(32),        /* NUMBER OF OBJECT DELETED FROM    39250000
                                       THIS OPTICAL DISK VOLUME WHILE   39300000
                                       IT WAS MOUNTED.                  39350000
                                       ONLY VALID FOR SUBTYPE 73 AND    39400000
                                       SUBTYPE 69 (IN ONE SPECIAL       39450000
                                       CASE).                        */ 39500000
       3 ST68NKBD FIXED(32);        /* NUMBER OF KILOBYTES OF OBJECT    39550000
                                       DATA DETETED FROM THIS OPTICAL   39600000
                                       DISK VOLUME WHILE IT WAS MOUNTED.39650000
                                       ONLY VALID FOR SUBTYPE 73 AND    39700000
                                       SUBTYPE 69 (IN ONE SPECIAL       39750000
                                       CASE).                        */ 39800000
    /* SUBTYPE 69 (OPTICAL CARTRIDGE EJECT) FLAGS.                   */ 39825000
    DECLARE                         /*                               */ 39850000
      1 ST69FLGS BIT(32) DEFINED(ST68FLGS), /* SUBTYPE 69 (OPTICAL      39853000
                                       CARTRIDGE EJECT) FLAGS        */ 39856000
         3 ST69FLG0 BIT(1),         /* WHEN ON, THIS OPTICAL CARTRIDGE  39859000
                                       WAS AUTOMATICALLY EJECTED BY     39862000
                                       THE SYSTEM DUE TO AN ERROR       39865000
                                       CONDITION AND THIS CONDITION     39868000
                                       IS KNOWN AS A "SYSTEM INITIATED  39871000
                                       EJECT" REQUEST.               */ 39874000
         3 *        BIT(31);        /* RESERVED                      */ 39877000
    /* SUBTYPE 70 (OPTICAL CARTRIDGE LABEL) FLAGS.                   */ 39880000
    DECLARE                         /*                               */ 39883000
      1 ST70FLGS BIT(32) DEFINED(ST68FLGS), /* SUBTYPE 70 (OPTICAL      39886000
                                       CARTRIDGE LABEL) FLAGS        */ 39889000
         3 *        BIT(32);        /* RESERVED                      */ 39892000
    /* SUBTYPE 71 (OPTICAL VOLUME AUDIT) FLAGS.                      */ 39895000
    DECLARE                         /*                               */ 39898000
      1 ST71FLGS BIT(32) DEFINED(ST68FLGS), /* SUBTYPE 71 (OPTICAL      39901000
                                       VOLUME AUDIT) FLAGS           */ 39904000
         3 *        BIT(32);        /* RESERVED                      */ 39907000
    /* SUBTYPE 72 (OPTICAL VOLUME MOUNT) FLAGS.                      */ 39910000
    DECLARE                         /*                               */ 39913000
      1 ST72FLGS BIT(32) DEFINED(ST68FLGS), /* SUBTYPE 72 (OPTICAL      39916000
                                       VOLUME MOUNT) FLAGS           */ 39919000
         3 *        BIT(32);        /* RESERVED                      */ 39922000
    /* SUBTYPE 73 (OPTICAL VOLUME DEMOUNT) FLAGS                     */ 39925000
    DECLARE                         /*                               */ 39928000
      1 ST73FLGS BIT(32) DEFINED(ST68FLGS), /* SUBTYPE 73 (OPTICAL      39931000
                                       VOLUME DEMOUNT) FLAGS         */ 39934000
         3 *        BIT(32);        /* RESERVED                      */ 39937000
    /* SUBTYPE 68-73 LENGTH CONSTANTS                                */ 39940000
    DECLARE                         /*                               */ 39943000
      SMFST68L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    39946000
                                 LENGTH(ST68)),                         39950000
      SMFST69L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40000000
                                 LENGTH(ST68)),                         40050000
      SMFST70L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40100000
                                 LENGTH(ST68)),                         40150000
      SMFST71L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40200000
                                 LENGTH(ST68)),                         40250000
      SMFST72L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40300000
                                 LENGTH(ST68)),                         40350000
      SMFST73L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40400000
                                 LENGTH(ST68));                         40450000
   %END;                                                                40500000
 %IF SMF85S74 ^= '' |                                                   40550000
     SMF85S75 ^= '' |                                                   40600000
     SMF85S76 ^= '' |                                                   40650000
     SMF85S77 ^= '' %THEN                                               40700000
   %DO;                                                                 40750000
 @EJECT;                            /*                               */ 40800000
 /********************************************************************/ 40850000
 /*                                                                  */ 40900000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 74 - 77                        */ 40950000
 /*                                                                  */ 41000000
 /* SUBTYPE FUNCTION                                                 */ 41050000
 /* ------- ---------------------------------------------------      */ 41100000
 /*      74 LCS OPTICAL WRITE REQUEST                            @L1A*/ 41150000
 /*      75 LCS OPTICAL READ REQUEST                             @L1A*/ 41200000
 /*      76 LCS OPTICAL (LOGICAL) DELETE REQUEST                     */ 41250000
 /*      77 LCS OPTICAL (PHYSICAL) DELETE REQUEST                    */ 41300000
 /*                                                                  */ 41350000
 /********************************************************************/ 41400000
 DECLARE                            /*                               */ 41450000
     1 ST74 DEFINED(R85PEND),       /* SUBTYPES 74 - 77              */ 41500000
       3 ST74ORMN CHAR(16),         /* OAM REQUEST MEMBER NAME   @L1A*/ 41516600
       3 ST74OTMN CHAR(16),         /* OAM TARGET MEMBER NAME    @L1A*/ 41533200
       3 ST74OLN  CHAR(8),          /* OPTICAL LIBRARY NAME          */ 41550000
       3 ST74OLDT CHAR(8),          /* OPTICAL LIBRARY DEVICE TYPE   */ 41600000
       3 ST74OLDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  41650000
                                       TO THE OPTICAL LIBRARY        */ 41700000
       3 ST74ODN  CHAR(8),          /* OPTICAL DRIVE NAME            */ 41750000
       3 ST74ODDT CHAR(8),          /* OPTICAL DRIVE DEVICE TYPE     */ 41800000
       3 ST74ODDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  41850000
                                       TO THE OPTICAL DRIVE.         */ 41900000
       3 ST74ODT  CHAR(1),          /* OPTICAL DRIVE TYPE.  L=LIBRARY   42150000
                                       RESIDENT, S=STANDALONE.       */ 42200000
       3 ST74OVT  CHAR(1),          /* OPTICAL VOLUME TYPE.             42250000
                                       G = OBJECT STORAGE GROUP,        42300000
                                       B = OBJECT BACKUP STOR GROUP,    42350000
                                       S = SCRATCH OPTICAL VOLUME.   */ 42400000
       3 ST74SGN  CHAR(8),          /* STORAGE GROUP NAME.           */ 42450000
       3 ST74LIQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN            42489200
                                       MILLISECONDS) THIS REQUEST       42528400
                                       SPENT ON THE LCS                 42567600
                                       INPUT-WORK-QUEUE WAITING         42606800
                                       TO PROCESSED.  */                42646000
       3 ST74LDQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN            42685200
                                       MILLISECONDS) THIS REQUEST       42724400
                                       SPENT ON THE LCS                 42763600
                                       DISPATCHER-QUEUE WAITING         42802800
                                       TO PROCESSED.  */                42842000
       3 ST74LEQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN            42881200
                                       MILLISECONDS) THIS REQUEST       42920400
                                       SPENT ON THE LCS                 42959600
                                       EXECUTION-QUEUE BEING            43000000
                                       PROCESSED.  */                   43044800
       3 ST74LXQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN            43052200
                                       MILLISECONDS) THIS REQUEST       43059600
                                       SPENT ON THE XCF CROSS           43067000
                                       SYSTEM-QUEUE BEING               43074400
                                       PROCESSED.  @L1A*/               43081800
       3 ST74OVMT FIXED(32) BDY(BYTE), /* OPTICAL VOLUME MOUNT TIME.    43089600
                                       THIS IS THE AMOUNT OF TIME       43134400
                                       (IN MILLISECONS) THAT IT         43179200
                                       TOOK TO MOUNTED THE              43224000
                                       OPTICAL DISK VOLUME THAT         43268800
                                       WAS REQUIRED BY THIS             43313600
                                       REQUEST. THE FIELD IS ONLY       43358400
                                       VALID IF BIT 1, 2 OR 3 IN        43403200
                                       FIELD ST74FLSGS IS ON.           43448000
                                       THIS FIELD IS ONLY VALID         43492800
                                       FOR SUBTYPES 74, 75 AND          43537600
                                       77.  */                          43582400
       3 ST74OVDT FIXED(32) BDY(BYTE), /* OPTICAL VOLUME DEMOUNT        43627200
                                       TIME.  THIS IS THE AMOUNT        43672000
                                       OF TIME (IN MILLISECONS)         43716800
                                       THAT IT TOOK TO DEMOUNT          43761600
                                       THE OPTICAL DISK VOLUME          43806400
                                       THAT CURRENTLY MOUNTED           43851200
                                       PRIOR TO MOUNTING THAT           43896000
                                       OPTICAL DISK VOLUME THAT         43940800
                                       WAS REQUIRED BY THE              43985600
                                       REQUEST. THE FIELD IS ONLY       44030400
                                       VALID IF BIT 3 IN FIELD          44075200
                                       ST74FLSGS IS ON.  THIS           44120000
                                       FIELD IS ONLY VALID FOR          44164800
                                       SUBTYPES 74, 75 AND 77.          44209600
                                       */                               44254400
       3 ST74FLGS BIT(32),          /* PROCESSING FLAGS, RESERVED.   */ 44300000
         5 ST74FLG0  BIT(1),        /* WHEN ON, THIS REQUEST WAS        44350000
                                       PROCESSED USING A CURRENTLY      44400000
                                       MOUNTED OPTICAL VOLUME AND DID   44450000
                                       NOT REQUIRE AN UMOUNTED OPTICAL  44500000
                                       DISK VOLUME TO BE MOUNTED.       44550000
                                       ONLY VALID FOR SUBTYPES 74, 75   44600000
                                       AND 77.  NOT VALID FOR OTHER     44650000
                                       SUBTYPES.                     */ 44700000
         5 ST74FLG1  BIT(1),        /* WHEN ON, THIS REQUEST WAS        44750000
                                       PROCESSED USING THE OPPOSITE     44800000
                                       OF A CURRENTLY                   44850000
                                       MOUNTED OPTICAL VOLUME AND       44900000
                                       NOT REQUIRE AN UMOUNTED OPTICAL  44950000
                                       DISK VOLUME.  THEREFORE, THE     45000000
                                       REQUEST REQUIRED THE OPTICAL DISK45050000
                                       VOLUME TO BE FLIPPED OVER TO     45100000
                                       ACCESS THE VOLUME ON THE         45150000
                                       OPPOSITE SIDE OF THE CURRENTLY   45200000
                                       MOUNTED VOLUME.                  45250000
                                       ONLY VALID FOR SUBTYPES 74, 75   45300000
                                       AND 77.  NOT VALID FOR OTHER     45350000
                                       SUBTYPES.                     */ 45400000
         5 ST74FLG2  BIT(1),        /* WHEN ON, THIS REQUEST REQUIRED   45450000
                                       AN UNMOUNTED OPTICAL DISK VOLUME 45500000
                                       AND THE OPTICAL DISK DRIVE USED  45550000
                                       TO PROCESS THIS REQUEST WAS      45600000
                                       EMPTY AT THE START OF PROCESSING 45650000
                                       THIS REQUEST.  THEREFORE, THIS   45700000
                                       REQUEST DID NOT REQUIRE A        45750000
                                       CURRENTLY MOUNTED OPTICAL DISK   45800000
                                       VOLUME TO BE DEMOUNTED PRIOR     45850000
                                       TO MOUNTED THE REQUIRED OPTICAL  45900000
                                       DISK VOLUME.                     45950000
                                       ONLY VALID FOR SUBTYPES 74, 75   46000000
                                       AND 77.  NOT VALID FOR OTHER     46050000
                                       SUBTYPES.                     */ 46100000
         5 ST74FLG3  BIT(1),        /* WHEN ON, THIS REQUEST REQUIRED   46150000
                                       AN UNMOUNTED OPTICAL DISK VOLUME 46200000
                                       AND THE OPTICAL DISK DRIVE USED  46250000
                                       TO PROCESS THIS REQUEST WAS      46300000
                                       FULL AT THE START OF PROCESSING  46350000
                                       THIS REQUEST.  THEREFORE, THIS   46400000
                                       REQUEST REQUIRED A               46450000
                                       CURRENTLY MOUNTED OPTICAL DISK   46500000
                                       VOLUME TO BE DEMOUNTED PRIOR     46550000
                                       TO MOUNTING THE REQUIRED OPTICAL 46600000
                                       DISK VOLUME.                     46650000
                                       ONLY VALID FOR SUBTYPES 74, 75   46700000
                                       AND 77.  NOT VALID FOR OTHER     46750000
                                       SUBTYPES.                     */ 46800000
         5 *      BIT(28),          /* RESERVED                      */ 46850000
       3 ST74NOBJ FIXED(32) BDY(BYTE), /* TOTAL NUMBER OF OBJECTS       46900000
                                       PROCESSED IN THIS REQUEST     */ 46950000
       3 ST74NKBP FIXED(32) BDY(BYTE), /* NUMBER OF KILOBYTES OF OBJECT 47000000
                                       DATA IN THIS REQUEST          */ 47050000
       3 ST74SOBJ FIXED(32) BDY(BYTE), /* TOTAL NUMBER OF OBJECTS       47100000
                                       IN THIS REQUEST PROCESSED        47150000
                                       SUCESSFULLY.                  */ 47200000
       3 ST74SKBP FIXED(32) BDY(BYTE), /* NUMBER OF KILOBYTES OF OBJECT 47250000
                                       DATA SUCESSFULLY PROCESSED IN    47300000
                                       THIS REQUEST.                 */ 47350000
       3 *        CHAR(14),         /* RESERVED.                     */ 47364200
       3 ST74END  CHAR(0);          /* END OF SUBTYPE 74 BASE SECTION*/ 47378400
 @EJECT;                            /*                               */ 47392600
    /* SUBTYPE 74,75,76 AND 77 OBJECT ARRAY SECTION                  */ 47406800
    DECLARE                         /*                               */ 47421000
       1 ST74OBJD(*) DEFINED(ST74END),/* ARRAY OF OBJECTS IN THIS       47435200
                                       REQUEST                       */ 47450000
          3 ST74COLN  CHAR(44),     /* COLLECTION NAME               */ 47500000
          3 ST74OBJN  CHAR(44),     /* OBJECT NAME                   */ 47550000
          3 ST74OLEN  FIXED(32) BDY(BYTE), /* OBJECT LENGTH        */   47600000
          3 ST74OOFF  FIXED(32) BDY(BYTE),  /* OBJECT OFFSET, ONLY VALID47650000
                                       ON SUBTYPE 75 FOR A PARTIAL      47700000
                                       OBJECT READ.                  */ 47744400
          3 ST74VSN   CHAR(6),      /* OPTICAL VOLUME SERIAL NUMBER  */ 47788800
          3 ST74OMT   CHAR(2),      /* OPTICAL MEDIA TYPE.           */ 47833200
          3 ST74OTKN  FIXED(32) BDY(BYTE),/* OBJECT LOCATION TOKEN   */ 47877600
          3 ST74RC    FIXED(32) BDY(BYTE), /* LCS RETURN CODE        */ 47922000
          3 ST74RS    FIXED(32) BDY(BYTE); /* LCS REASON CODE        */ 47966400
    DECLARE                         /*                               */ 48010800
      SMFST74L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48055200
                                 LENGTH(ST74)),                         48100000
      SMFST75L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48150000
                                 LENGTH(ST74)),                         48200000
      SMFST76L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48250000
                                 LENGTH(ST74)),                         48300000
      SMFST77L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48350000
                                 LENGTH(ST74));                         48400000
   %END;                                                                48450000
 %IF SMF85S78 ^= '' |                                                   48500000
     SMF85S79 ^= '' %THEN                                               48550000
   %DO;                                                                 48600000
 @EJECT;                            /*                               */ 48650000
 /********************************************************************/ 48700000
 /*                                                                  */ 48750000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 78 - 79 & 88               @P0C*/ 48800000
 /*                                                                  */ 48850000
 /* SUBTYPE FUNCTION                                                 */ 48900000
 /* ------- ---------------------------------------------------      */ 48950000
 /*      78 LCS TAPE WRITE REQUEST                                   */ 49000000
 /*      79 LCS TAPE READ REQUEST                                @L1A*/ 49037500
 /*      88 LCS TAPE LOGICAL DELETE REQUEST                      @P0A*/ 49075000
 /*                                                                  */ 49100000
 /********************************************************************/ 49150000
 DECLARE                            /*                               */ 49200000
     1 ST78 DEFINED(R85PEND),       /* SUBTYPES 78, 79 AND 88    @P0C*/ 49250000
       3 ST78ORMN  CHAR(16),        /* OAM REQUEST MEMBER NAME   @L1A*/ 49266600
       3 ST78OTMN  CHAR(16),        /* OAM TARGET MEMBER NAME    @L1A*/ 49283200
       3 ST78TDUN  CHAR(8),         /* TAPE DRIVE UNIT NAME          */ 49300000
       3 ST78TDDN  CHAR(4),         /* MVS DEVICE NUMBER OF TAPE DRIV*/ 49350000
       3 ST78TVT  CHAR(1),          /* TAPE VOLUME TYPE.                49500000
                                       G = OBJECT STORAGE GROUP,        49550000
                                       B = OBJECT BACKUP STOR GROUP,    49600000
                                       S = SCRATCH OPTICAL VOLUME.   */ 49650000
       3 *        CHAR(3),          /* RESERVED                      */ 49700000
       3 ST78SGN  CHAR(8),          /* STORAGE GROUP NAME.           */ 49750000
       3 ST78LIQT FIXED(32),        /* LCS INPUT-WORK-QUEUE TIME.       49783300
                                       AMOUNT OF TIME (IN MILLISECONDS) 49816600
                                       THIS REQUEST SPENT ON THE LCS    49850000
                                       INPUT-WORK-QUEUE WAITING TO      49900000
                                       PROCESSED.                    */ 49950000
       3 ST78LDQT FIXED(32),        /* LCS DISPATCHER-QUEUE TIME.       49983300
                                       AMOUNT OF TIME (IN MILLISECONDS) 50016600
                                       THIS REQUEST SPENT ON THE LCS    50050000
                                       DISPATCHER-QUEUE WAITING TO      50100000
                                       PROCESSED.                    */ 50150000
       3 ST78LEQT FIXED(32),        /* LCS EXECUTION-QUEUE TIME.        50183300
                                       AMOUNT OF TIME (IN MILLISECONDS) 50216600
                                       THIS REQUEST SPENT ON THE LCS    50250000
                                       EXECUTION-QUEUE BEING            50300000
                                       PROCESSED.                    */ 50350000
       3 ST78LXQT FIXED(32),        /* XCF CROSS SYSTEM-QUEUE TIME.     50358300
                                       AMOUNT OF TIME (IN MILLISECONDS) 50366600
                                       THIS REQUEST SPENT ON THE XCF    50374900
                                       CROSS SYSTEM-QUEUE BEING         50383200
                                       PROCESSED.                @L1A*/ 50391500
       3 ST78LMAT FIXED(32),        /* MVS DYNAMIC ALLOCATION (SVC 99)  50400000
                                       TIME.  THIS IS THE AMOUNT OF     50450000
                                       TIME (IN MILLISECONDS) THAT WAS  50500000
                                       REQUIRED BY MVS DYNAMIC          50550000
                                       ALLOCATION TO DYNAMICALLY        50600000
                                       ALLOCATE THE TAPE DRIVE.  THIS   50650000
                                       FIELD IS ONLY VALID IF BIT 1 IN  50700000
                                       FIELD ST78FLGS IS ON.         */ 50705500
       3 ST78LMDT FIXED(32),        /* MVS DYNAMIC DEALLOCATION (SVC 99)50711000
                                       TIME.  THIS IS THE AMOUNT OF     50716500
                                       TIME (IN MILLISECONDS) THAT WAS  50722000
                                       REQUIRED BY MVS DYNAMIC          50727500
                                       DEALOCATION TO DYNAMICALLY       50733000
                                       DEALLOCATE THE TAPE DRIVE.  THIS 50738500
                                       FIELD IS ONLY VALID IF BIT 2 IN  50744000
                                       FIELD ST78FLGS IS ON.         */ 50750000
       3 ST78LDCT FIXED(32),        /* DFSMS CLOSE TIME.                50800000
                                       THIS IS THE AMOUNT OF            50850000
                                       TIME (IN MILLISECONDS) THAT WAS  50900000
                                       REQUIRED BY DFSMS TO CLOSE AN    50950000
                                       ALREADY-OPENED TAPE DATA SET.    51000000
                                       THIS FIELD IS ONLY VALID IF BIT 251050000
                                       IN FIELD ST78FLGS IS ON.         51100000
                                       */                               51150000
       3 ST78LDOT FIXED(32),        /* DFSMS OPEN TIME.                 51200000
                                       THIS IS THE AMOUNT OF            51250000
                                       TIME (IN MILLISECONDS) THAT WAS  51300000
                                       REQUIRED BY DFSMS OPEN PROCESSING51350000
                                       TO OPEN THE TAPE DATA SET.       51400000
                                       THIS FIELD IS ONLY VALID IF BIT 151450000
                                       OR BIT 2 IN FIELD ST78FLGS IS ON.51500000
                                                                     */ 51550000
       3 ST78LDPT FIXED(32),        /* DFSMS POINT TIME.  THIS IS       51600000
                                       THE AMOUNT OF TIME (IN           51650000
                                       MILLISECONDS) THAT WAS           51700000
                                       REQUIRED BY DFSMS POINT          51750000
                                       PROCESSING TO POSITION TO THE    51800000
                                       CORRECT BLOCK-ID ON THE MEDIA.   51850000
                                       THIS FIELD                       51900000
                                       IS ONLY VALID IF BIT 1 OR        51950000
                                       BIT 2 IN FIELD ST78FLGS IS       52000000
                                       ON.                           */ 52007500
       3 ST78LBRT FIXED(32),        /* BSAM READ TIME.  THIS IS         52015000
                                       THE AMOUNT OF TIME (IN           52022500
                                       MILLISECONDS) THAT LCS SPENT     52030000
                                       IN BSAM READ PROCESSING READING  52037500
                                       DATA FROM THE TAPE VOLUME.  ONLY 52045000
                                       VALID FOR SUBTYPE 79.         */ 52052500
       3 ST78LBWT FIXED(32),        /* BSAM WRITE TIME.  THIS IS        52060000
                                       THE AMOUNT OF TIME (IN           52067500
                                       MILLISECONDS) THAT LCS SPENT     52075000
                                       IN BSAM WRITE PROCESSING WRITING 52082500
                                       DATA TO THE TAPE VOLUME.  ONLY   52090000
                                       VALID FOR SUBTYPE 78.         */ 52097500
       3 ST78LBCT FIXED(32),        /* BSAM CHECK TIME.  THIS IS        52105000
                                       THE AMOUNT OF TIME (IN           52112500
                                       MILLISECONDS) THAT LCS SPENT     52120000
                                       IN BSAM CHECK PROCESSING WAITING 52127500
                                       FOR I/O OPERATIONS TO COMPLETED. 52135000
                                       VALID FOR SUBTYPES 78 AND 79. */ 52142500
       3 ST78FLGS BIT(32),          /* PROCESSING FLAGS, RESERVED.   */ 52150000
         5 ST78FLG0  BIT(1),        /* WHEN ON, THIS REQUEST WAS        52200000
                                       PROCESSED USING A CURRENTLY      52250000
                                       MOUNTED TAPE VOLUME AND DID      52300000
                                       NOT REQUIRE AN UMOUNTED TAPE     52350000
                                       VOLUME TO BE MOUNTED.        */  52400000
         5 ST78FLG1  BIT(1),        /* WHEN ON, THIS REQUEST REQUIRED   52450000
                                       AN UNMOUNTED TAPE VOLUME         52500000
                                       AND THE TAPE DRIVE USED          52550000
                                       TO PROCESS THIS REQUEST WAS      52600000
                                       EMPTY AT THE START OF PROCESSING 52650000
                                       THIS REQUEST.  THEREFORE, THIS   52700000
                                       REQUEST DID NOT REQUIRE A        52750000
                                       CURRENTLY MOUNTED TAPE           52800000
                                       VOLUME TO BE DEMOUNTED PRIOR     52850000
                                       TO MOUNTING THE REQUIRED TAPE    52900000
                                       VOLUME.                       */ 52950000
         5 ST78FLG2  BIT(1),        /* WHEN ON, THIS REQUEST REQUIRED AN53000000
                                       UNMOUNTED TAPE VOLUME TO BE      53050000
                                       MOUNTED AND THE TAPE DRIVE TASK  53100000
                                       USED TO PROCESS THIS REQUEST     53150000
                                       ALREADY HAD A TAPE DRIVE         53200000
                                       ALLOCATED AND A DIFFERENT TAPE   53250000
                                       VOLUME MOUNTED.  THEREFORE, THIS 53300000
                                       REQUEST REQUIRED A CURRENTLY     53350000
                                       MOUNTED TAPE VOLUME TO BE        53400000
                                       DEMOUNTED PRIOR TO MOUNTING THE  53450000
                                       REQUIRED TAPE VOLUME.  */        53500000
         5 ST78FLG3 BIT(1),         /* THIS REQUEST WAS PROCESSED       53550000
                                       USING A TAPE DRIVE INSIDE AN     53600000
                                       IBM AUTOMATED TAPE LIBRARY       53650000
                                       DATASERVER.                   */ 53700000
         5 *        BIT(28),        /* RESERVED                      */ 53750000
       3 ST78NOBJ FIXED(32),        /* TOTAL NUMBER OF OBJECTS          53800000
                                       PROCESSED IN THIS REQUEST     */ 53850000
       3 ST78NKBP FIXED(32),        /* NUMBER OF KILOBYTES OF OBJECT    53900000
                                       DATA IN THIS REQUEST          */ 53950000
       3 ST78SOBJ FIXED(32),        /* TOTAL NUMBER OF OBJECTS          54000000
                                       IN THIS REQUEST PROCESSED        54050000
                                       SUCESSFULLY.                  */ 54100000
       3 ST78SKBP FIXED(32),        /* NUMBER OF KILOBYTES OF OBJECT    54150000
                                       DATA SUCESSFULLY                 54200000
                                       PROCESSED IN THIS REQUEST*/      54250000
       3 *        CHAR(16),         /* RESERVED.                     */ 54264200
       3 ST78END  CHAR(0);          /* END OF SUBTYPE 78 BASE SECTION*/ 54278400
 @EJECT;                            /*                               */ 54292600
    /* SUBTYPE 78,79 & 88 OBJECT ARRAY SECTION                   @P0C*/ 54306800
    DECLARE                         /*                               */ 54321000
       1 ST78OBJD(*) DEFINED(ST78END),/* ARRAY OF OBJECTS IN THIS       54335200
                                       REQUEST                       */ 54350000
          3 ST78COLN  CHAR(44),     /* COLLECTION NAME               */ 54400000
          3 ST78OBJN  CHAR(44),     /* OBJECT NAME                   */ 54450000
          3 ST78OLEN  FIXED(32) BDY(BYTE), /* OBJECT LENGTH        */   54500000
          3 ST78OOFF  FIXED(32) BDY(BYTE),  /* OBJECT OFFSET, ONLY VALID54550000
                                       ON SUBTYPE 79 FOR A              54600000
                                       PARTIAL OBJECT READ.             54650000
                                       */                               54700000
          3 ST78VSN   CHAR(6),      /* OPTICAL VOLUME SERIAL NUMBER  */ 54725000
          3 ST78TMT   CHAR(2),      /* TAPE MEDIA TYPE.                 54750000
                                       02 = IBM 3490 STANDARD CAPACITY  54775000
                                            CARTRIDGE SYSTEM TAPE.      54800000
                                       04 = IBM 3490 ENHANCED CAPACITY  54825000
                                            CARTRIDGE SYSTEM TAPE.      54850000
                                       05 = IBM 3590 HIGH PERFORMANCE   54875000
                                            CARTRIDGE TAPE.          */ 54900000
          3 ST78OTKN  FIXED(32) BDY(BYTE), /* OBJECT LOCATION TOKEN */  54925000
          3 ST78RC    FIXED(32) BDY(BYTE), /* LCS RETURN CODE   */      54950000
          3 ST78RS    FIXED(32) BDY(BYTE);    /* LCS REASON CODE   */   54975000
    DECLARE                         /*                               */ 55000000
      SMFST78L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55025000
                                 LENGTH(ST78)),                         55050000
      SMFST79L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55100000
                                 LENGTH(ST78)),                /*@P0C*/ 55125000
      SMFST88L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55150000
                                 LENGTH(ST78));                /*@P0A*/ 55175000
   %END;                                                                55200000
 %IF SMF85S80 ^= '' |                                                   55250000
     SMF85S81 ^= '' %THEN                                               55300000
   %DO;                                                                 55350000
 @EJECT;                            /*                               */ 55400000
 /********************************************************************/ 55450000
 /*                                                                  */ 55500000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 80 - 81                        */ 55550000
 /*                                                                  */ 55600000
 /* SUBTYPE FUNCTION                                                 */ 55650000
 /* ------- ---------------------------------------------------      */ 55700000
 /*      80 LCS TAPE LIBRARY VARY ONLINE                             */ 55750000
 /*      81 LCS TAPE LIBRARY VARY OFFLINE                            */ 55800000
 /*                                                                  */ 55850000
 /********************************************************************/ 55900000
 DECLARE                            /*                               */ 55950000
     1 ST80 DEFINED(R85PEND),       /* SUBTYPES 80 AND 81            */ 56000000
       3 ST80TLN  CHAR(8),          /* TAPE LIBRARY NAME             */ 56050000
       3 ST80TLDT CHAR(8),          /* TAPE LIBRARY DEVICE TYPE      */ 56100000
       3 ST80LTQT FIXED(32),        /* LCS LIBRARY TASK QUEUE TIME.     56150000
                                       THE AMOUNT OF TIME (IN           56200000
                                       MILLISECONDS) THAT THIS REQUEST  56250000
                                       SPENT ON THE LCS LIBRARY QUEUE   56300000
                                       (LQE QUEUE) WAITING TO BE        56350000
                                       PROCESSED.                    */ 56400000
       3 ST80LTPT FIXED(32),        /* LCS LIBRARY TASK PROCESSING TIME.56450000
                                       THE AMOUNT OF TIME (IN           56500000
                                       MILLISECONDS) THAT THIS REQUEST  56550000
                                       TOOK TO BE PROCESSED BY THE      56600000
                                       LIBRARY TASK.                 */ 56650000
       3 ST80RC    FIXED(32),       /* LCS RETURN CODE               */ 56700000
       3 ST80RS    FIXED(32),       /* LCS REASON CODE               */ 56750000
       3 ST80FLGS BIT(32);          /* PROCESSING FLAGS, RESERVED.   */ 56800000
    DECLARE                         /*                               */ 56850000
      SMFST80L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    56900000
                                 LENGTH(ST80)),                         56950000
      SMFST81L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    57000000
                                 LENGTH(ST80));                         57050000
   %END;                                                                57100000
 %IF SMF85S82 ^= '' |                                                   57150000
     SMF85S83 ^= '' |                                                   57200000
     SMF85S84 ^= '' |                                                   57250000
     SMF85S85 ^= '' |                                                   57300000
     SMF85S86 ^= '' %THEN                                               57350000
   %DO;                                                                 57400000
 @EJECT;                            /*                               */ 57450000
 /********************************************************************/ 57500000
 /*                                                                  */ 57550000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 82 - 86                        */ 57600000
 /*                                                                  */ 57650000
 /* SUBTYPE FUNCTION                                                 */ 57700000
 /* ------- ---------------------------------------------------      */ 57750000
 /*      82 LCS TAPE LIBRARY VOLUME ENTRY                            */ 57800000
 /*      83 LCS TAPE LIBRARY VOLUME EJECT                            */ 57850000
 /*      84 LCS TAPE LIBRARY VOLUME AUDIT                            */ 57900000
 /*      85 LCS TAPE LIBRARY VOLUME MOUNT                            */ 57950000
 /*      86 LCS TAPE LIBRARY VOLUME DEMOUNT                          */ 58000000
 /*                                                                  */ 58050000
 /********************************************************************/ 58100000
 DECLARE                            /*                               */ 58150000
     1 ST82 DEFINED(R85PEND),       /* SUBTYPES 82 - 86              */ 58200000
       3 ST82TLN  CHAR(8),          /* TAPE LIBRARY NAME             */ 58250000
       3 ST82TLDT CHAR(8),          /* TAPE LIBRARY DEVICE TYPE      */ 58300000
       3 ST82TDDT CHAR(4),          /* TAPE DRIVE UCB DEVICE TYPE.      58350000
                                       VALID FOR SUBTYPES 85 AND 86,    58400000
                                       CONTAINS ZEROS FOR OTHERS.    */ 58450000
       3 ST82TDDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  58500000
                                       TO TAPE DRIVE.                   58550000
                                       VALID FOR SUBTYPES 85 AND 86,    58600000
                                       CONTAINS ZEROS FOR OTHERS.    */ 58650000
       3 ST82VSN  CHAR(6),          /* TAPE VOLUME SERIAL NUMBER     */ 58700000
       3 ST82TMT   CHAR(2),         /* TAPE MEDIA TYPE                  58712500
                                       02 = IBM 3490 STANDARD CAPACITY  58725000
                                            CARTRIDGE SYSTEM TAPE.      58737500
                                       04 = IBM 3490 ENHANCED CAPACITY  58750000
                                            CARTRIDGE SYSTEM TAPE.      58762500
                                       05 = IBM 3590 HIGH PERFORMANCE   58775000
                                            CARTRIDGE TAPE.          */ 58787500
       3 ST82LIQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 58800000
                                       THIS REQUEST SPENT ON THE LCS    58850000
                                       INPUT-WORK-QUEUE WAITING TO      58900000
                                       PROCESSED.                    */ 58950000
       3 ST82LDQT FIXED(32),        /* AMOUNT OF TIME (IN MILLISECONDS) 59000000
                                       THIS REQUEST SPENT ON THE LCS    59050000
                                       DISPATCHER-QUEUE WAITING TO      59100000
                                       PROCESSED.                    */ 59150000
       3 ST82LTQT FIXED(32),        /* LIBRARY TASK QUEUE TIME.         59200000
                                       AMOUNT OF TIME (IN MILLISECONDS) 59250000
                                       THIS REQUEST SPENT ON THE LCS    59300000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   59350000
                                       WAITING TO BE PROCESSED.         59400000
                                       NORMALLY, THIS FIELD REPRESENTS  59450000
                                       CARTRIDGE TRANSPORT MECHANISM    59500000
                                       WAIT TIME.  THAT IS, THE AMOUNT  59550000
                                       OF TIME WAITING FOR THE CARTRIDGE59600000
                                       TRANSPORT MECHANISM (ROBOT) TO   59650000
                                       BECOME AVAILABLE WITHIN AN       59700000
                                       AUTOMATED STORAGE LIBRARY.    */ 59750000
       3 ST82LTPT FIXED(32),        /* LIBRARY TASK PROCESSING TIME.    59800000
                                       AMOUNT OF TIME (IN MILLISECONDS) 59850000
                                       THIS REQUEST TOOK TO BE          59900000
                                       PROCESSED BY THE LIBRARY TASK.   59950000
                                       WAITING TO BE PROCESSED.         60000000
                                       NORMALLY, THIS FIELD REPRESENTS  60050000
                                       CARTRIDGES TRANSPORT MECHANISM   60100000
                                       SERVICE TIME.  THAT IS, THE      60150000
                                       TIM SPENT BY THE                 60200000
                                       CARTRIDGE TRANSPORT MECHANISM    60250000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN60300000
                                       THE OPTICAL DISK LIBRARY.     */ 60350000
       3 ST82RC  FIXED(32),         /* LCS RETURN CODE               */ 60400000
       3 ST82RS  FIXED(32),         /* LCS REASON CODE               */ 60450000
       3 ST82FLGS BIT(32);          /* PROCESSING FLAGS, RESERVED.   */ 60500000
    DECLARE                         /*                               */ 60550000
      SMFST82L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60600000
                                 LENGTH(ST82)),                         60650000
      SMFST83L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60700000
                                 LENGTH(ST82)),                         60750000
      SMFST84L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60800000
                                 LENGTH(ST82)),                         60850000
      SMFST85L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60900000
                                 LENGTH(ST82)),                         60950000
      SMFST86L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    61000000
                                 LENGTH(ST82));                         61050000
   %END;                                                                61100000
 %IF SMF85S87 ^= '' %THEN                                               61150000
   %DO;                                                                 61200000
 @EJECT;                            /*                               */ 61250000
 /********************************************************************/ 61300000
 /*                                                                  */ 61350000
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 87                              */ 61400000
 /*                                                                  */ 61450000
 /* SUBTYPE FUNCTION                                                 */ 61500000
 /* ------- ---------------------------------------------------      */ 61550000
 /*      87 OAM OWNED TAPE VOLUME DEMOUNT                            */ 61600000
 /*                                                                  */ 61650000
 /********************************************************************/ 61700000
 DECLARE                            /*                               */ 61750000
     1 ST87 DEFINED(R85PEND),       /* SUBTYPE 87                    */ 61800000
       3 ST87TDDN CHAR(4),          /* MVS DEVICE NUMBER CORRESPONDING  61850000
                                       TO TAPE DRIVE.                */ 61900000
       3 ST87TDDT CHAR(4),          /* TAPE DRIVE UCB DEVICE TYPE    */ 61950000
       3 ST87TVUN CHAR(8),          /* TAPE VOLUME UNIT NAME         */ 62000000
       3 ST87VSN  CHAR(6),          /* TAPE VOLUME SERIAL NUMBER     */ 62050000
       3 ST87TMT   CHAR(2),         /* TAPE MEDIA TYPE                  62062500
                                       02 = IBM 3490 STANDARD CAPACITY  62075000
                                            CARTRIDGE SYSTEM TAPE.      62087500
                                       04 = IBM 3490 ENHANCED CAPACITY  62100000
                                            CARTRIDGE SYSTEM TAPE.      62112500
                                       05 = IBM 3590 HIGH PERFORMANCE   62125000
                                            CARTRIDGE TAPE.          */ 62137500
       3 ST87TVT   CHAR(1),         /* TAPE VOLUME TYPE.                62150000
                                       G = TAPE VOLUME IS A GROUPED     62200000
                                       VOLUME BELONGING TO AN OBJECT    62250000
                                       STORAGE GROUP.                   62300000
                                       B = TAPE VOLUME IS A GROUPED     62350000
                                       VOLUME BELONGING TO AN OBJECT    62400000
                                       BACKUP STORAGE GROUP.         */ 62450000
       3 *        CHAR(3),          /* RESERVED.                     */ 62500000
       3 ST87SGN  CHAR(8),          /* STORAGE GROUP NAME.           */ 62550000
       3 ST87RC  FIXED(32),         /* LCS RETURN CODE               */ 62600000
       3 ST87RS  FIXED(32),         /* LCS REASON CODE               */ 62650000
       3 ST87FLGS BIT(32),          /* PROCESSING FLAGS, RESERVED.   */ 62700000
       3 ST87TMNT FIXED(32),        /* ELASPED TIME (IN MILLISECONDS)   62750000
                                       THAT TAPE VOLUME WAS MOUNTED,    62800000
                                       MEASURED FROM COMPLETION OF THE  62850000
                                       DFSMS OPEN MACRO TO COMPLETION   62900000
                                       OF THE DFSMS CLOSE MACRO.     */ 62950000
       3 ST87NOW  FIXED(32),        /* NUMBER OF OBJECT WRITTEN TO THIS 63000000
                                       TAPE VOLUME WHILE IT             63050000
                                       WAS MOUNTED.                  */ 63100000
       3 ST87NKBW FIXED(32),        /* NUMBER OF KILOBYTES OF OBJECT    63150000
                                       DATA WRITTEN TO THIS TAPE        63200000
                                       VOLUME WHILE IT WAS MOUNTED.  */ 63250000
       3 ST87NOR  FIXED(32),        /* NUMBER OF OBJECT READ FROM THIS  63300000
                                       TAPE VOLUME WHILE IT             63350000
                                       WAS MOUNTED.                  */ 63400000
       3 ST87NKBR FIXED(32);        /* NUMBER OF KILOBYTES OF OBJECT    63450000
                                       DATA READ FROM THIS TAPE         63500000
                                       VOLUME WHILE IT WAS MOUNTED.  */ 63550000
    DECLARE                         /*                               */ 63600000
      SMFST87L FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63650000
                                 LENGTH(ST87));                         63700000
   %END;                                                                63750000
 @EJECT;                            /*                               */ 63800000
 /********************************************************************/ 63850000
 /*                                                                  */ 63900000
 /* OAM SMF RECORD 85 SUBTYPES                                       */ 63950000
 /*                                                                  */ 64000000
 /********************************************************************/ 64050000
    DECLARE                         /*                               */ 64100000
      SMFST01 FIXED(31) CONSTANT(1), /* OSREQ ACCESS                 */ 64150000
      SMFST02 FIXED(31) CONSTANT(2), /* OSREQ STORE                  */ 64200000
      SMFST03 FIXED(31) CONSTANT(3), /* OSREQ RETRIEVE               */ 64250000
      SMFST04 FIXED(31) CONSTANT(4), /* OSREQ QUERY                  */ 64300000
      SMFST05 FIXED(31) CONSTANT(5), /* OSREQ CHANGE                 */ 64350000
      SMFST06 FIXED(31) CONSTANT(6), /* OSREQ DELETE                 */ 64400000
      SMFST07 FIXED(31) CONSTANT(7), /* OSREQ UNACCESS               */ 64450000
      SMFST32 FIXED(31) CONSTANT(32),/* OSMC STOR GRP PROCESSING     */ 64500000
      SMFST33 FIXED(31) CONSTANT(33),/* OSMC DASD SPACE MANAGEMENT   */ 64550000
      SMFST34 FIXED(31) CONSTANT(34),/* OSMC OPTICAL DISK REC UTIL   */ 64600000
      SMFST35 FIXED(31) CONSTANT(35),/* OSMC MOVEVOL UTILITY         */ 64650000
      SMFST36 FIXED(31) CONSTANT(36),/* OSMC SINGLE OBJ RECV UTIL   */  64700000
      SMFST37 FIXED(31) CONSTANT(37),/* OSMC LIB SPACE MANAGEMENT    */ 64750000
      SMFST64 FIXED(31) CONSTANT(64),/* LCS OPT DRIVE VARY ONLINE    */ 64800000
      SMFST65 FIXED(31) CONSTANT(65),/* LCS OPT DRIVE VARY OFFLINE   */ 64850000
      SMFST66 FIXED(31) CONSTANT(66),/* LCS OPT LIB VARY ONLINE      */ 64900000
      SMFST67 FIXED(31) CONSTANT(67),/* LCS OPT LIB VARY OFFLINE     */ 64950000
      SMFST68 FIXED(31) CONSTANT(68),/* LCS OPTICAL CART ENTRY       */ 65000000
      SMFST69 FIXED(31) CONSTANT(69),/* LCS OPTICAL CART EJECT       */ 65050000
      SMFST70 FIXED(31) CONSTANT(70),/* LCS OPTICAL CART LABEL       */ 65100000
      SMFST71 FIXED(31) CONSTANT(71),/* LCS OPTICAL CART AUDIT       */ 65150000
      SMFST72 FIXED(31) CONSTANT(72),/* LCS OPTICAL CART MOUNT       */ 65200000
      SMFST73 FIXED(31) CONSTANT(73),/* LCS OPTICAL CART DEMOUNT     */ 65250000
      SMFST74 FIXED(31) CONSTANT(74),/* LCS OPTICAL WRITE REQUEST    */ 65300000
      SMFST75 FIXED(31) CONSTANT(75),/* LCS OPTICAL READ REQUEST     */ 65350000
      SMFST76 FIXED(31) CONSTANT(76),/* LCS OPTICAL LOG DELETE   @P0C*/ 65400000
      SMFST77 FIXED(31) CONSTANT(77),/* LCS OPTICAL PHY DELETE REQ   */ 65450000
      SMFST78 FIXED(31) CONSTANT(78),/* LCS TAPE WRITE REQUEST       */ 65500000
      SMFST79 FIXED(31) CONSTANT(79),/* LCS TAPE READ REQUEST        */ 65550000
      SMFST80 FIXED(31) CONSTANT(80),/* LCS TAPE LIB VARY ONLINE     */ 65600000
      SMFST81 FIXED(31) CONSTANT(81),/* LCS TAPE LIB VARY OFFLINE    */ 65650000
      SMFST82 FIXED(31) CONSTANT(82),/* LCS TAPE LIB VOL ENTRY       */ 65700000
      SMFST83 FIXED(31) CONSTANT(83),/* LCS TAPE LIB VOL EJECT       */ 65750000
      SMFST84 FIXED(31) CONSTANT(84),/* LCS TAPE LIB VOL AUDIT       */ 65800000
      SMFST85 FIXED(31) CONSTANT(85),/* LCS TAPE LIB VOL MOUNT       */ 65850000
      SMFST86 FIXED(31) CONSTANT(86),/* LCS TAPE LIB VOL DEMOUNT     */ 65900000
      SMFST87 FIXED(31) CONSTANT(87),/* OAM TAPE VOLUME DEMOUNT  @P0C*/ 65933300
      SMFST88 FIXED(31) CONSTANT(88);/* LCS TAPE LOGICAL DELETE  @P0A*/ 65966600
 @EJECT;                            /*                               */ 66000000
 /********************************************************************/ 66050000
 /*                                                                  */ 66100000
 /* OAM SMF RECORD POINTER AND SUBSYSTEM PC ROUTINES.                */ 66150000
 /*                                                                  */ 66200000
 /********************************************************************/ 66250000
    DECLARE                         /*                               */ 66300000
      SMF85PTR PTR(31),             /* POINTER TO SMF TYPE 85 RECORD */ 66350000
      MAX_SMF_RECORD FIXED(31) CONSTANT(32756);/* MAXIMUM SIZE OF AN    66400000
                                       SMF RECORD                    */ 66450000
