*/*                                                                  */ 00005000
*/*PROPRIETARY V3 STATEMENT                                          */ 00010000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00015000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00020000
*/*5695-DF1                                                          */ 00025000
*/*(C) COPYRIGHT 1992  IBM CORP.                                     */ 00030000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00037500
*/*                                                                  */ 00045000
*%/*                                                               @L1A 00047500
         MACRO                                                          00050000
&NAME    CHECK &DECB,&DSORG=,&RPL=                                      00100000
.*       CHANGE LEVEL = 11                                              00150000
.*$01=OY46548,HDP3330,901204,SJPLCC:  BDAM DATA ABOVE THE LINE     @01A 00183300
.*$L1=XXXXXXX,JDZ1110,930930,SJPLMET: PL/X SUPPORT                 @L1A 00199900
.*                                                                      00216600
         AIF   ('&RPL' NE '').JES                                       00250000
         AIF   ('&DECB' EQ '').E1                                       00300000
         AIF   ('&DSORG' EQ '').A1                                      00350000
         AIF   ('&DSORG' EQ 'IS').A2                                    00400000
         AIF   ('&DSORG' EQ 'ALL').A3                                   00450000
         IHBERMAC 180,DSORG,ALL                                         00500000
         AGO   .A3                                                      00550000
.A1      ANOP                                                           00600000
&NAME    IHBINNRA &DECB                                                 00650000
         L     14,8(0,1)                PICK UP DCB ADDR                00700000
         SR    15,15                                               @01A 00733300
         ICM   15,B'0111',53(14)        LOAD CHECK ROUTINE ADDR    @01C 00766600
         BALR  14,15                    LINK TO CHECK ROUTINE           00800000
         MEXIT                                                          00850000
.A2      ANOP                                                           00900000
&NAME    IHBINNRA &DECB                                                 00950000
         L     14,8(0,1)                PICK UP DCB ADDR                01000000
         L     15,76(0,14)              LOAD CHECK RTN ADDR FOR ISAM    01050000
         BALR  14,15                    LINK TO CHECK ROUT ADDR         01100000
         MEXIT                                                          01150000
.A3      ANOP                                                           01200000
&NAME    IHBINNRA &DECB                                                 01250000
         L     14,8(0,1)                PICK UP DCB ADDR                01300000
         L     15,76(0,14)              LOAD CHECK RTN ADDR FOR ISAM    01350000
         TM    26(14),X'80'             CHECK ISAM                      01400000
         BO    *+10                                                @01C 01437500
         SR    15,15                                               @01A 01475000
         ICM   15,B'0111',53(14)        LOAD CHECK ROUTINE         @01C 01512500
         BALR  14,15                    LINK TO CHECK ROUTINE ADDR      01550000
         MEXIT                                                          01600000
.E1      IHBERMAC 7                     DECB OPERAND MISSING            01650000
         MEXIT                                                          01700000
.JES     ANOP                                                           01750000
&NAME    DS    0H                                                       01800000
         AIF   ('&RPL'(1,1) EQ '(').RPLR                                01850000
         LA    1,&RPL                   LOAD RPL ADDR                   01900000
         AGO   .AREG                                                    01950000
.RPLR    LR    1,&RPL(1)                LOAD RPL ADDR VIA REG           02000000
.AREG    LA    0,X'02'                  INDICATE CHECK IN REGISTER      02050000
         L     15,24(1)                 LOAD ACB ADDR FROM RPL          02100000
         L     15,8(15)                 LOAD JES INTERFACE MOD ADDR     02400000
         BALR  14,15                    BRANCH TO INTERFACE ROUTINE     02450000
         MEND                                                           02550000
* */ CHECK: MACRO KEYS(1:1(DECB_ADDR,DECB_NAME),SYNAD_NAME,    /*@L1A*/ 02600000
*          EODAD_NAME);                                        /*@L1A*/ 02650000
*   ANS('? '||MACLABEL||' CHECKP '||MACKEYS||';') RESCAN SKIP; /*@L1A*/ 02700000
* %END CHECK;                                                  /*@L1A*/ 02750000
