*%/*                                                               @L2A 00010000
         MACRO                                                          00020000
&CNAME   CLOSE &PAR1,&MF=I,&TYPE=,&MODE=                           @02C 00021500
.*                                                                      00023000
.*CLOSE MACRO                                                      @L1A 00026000
.*                                                                 @L1A 00029000
.*$MAC(CLOSE):                                                     @L1A 00032000
.*                                                                 @L1A 00035000
.*PROPRIETARY V3 STATEMENT                                              00035700
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00036400
.*"RESTRICTED MATERIALS OF IBM"                                         00037100
.*5695-DF1                                                              00037800
.*(C) COPYRIGHT 1987  IBM CORP.                                         00038500
.*END PROPRIETARY V3 STATEMENT                                          00039700
.*                                                                 @L1A 00041000
.* STATUS = MVS/XA DFP RELEASE 2.3                                 @L1C 00042000
.*                                                                 @L1A 00043000
.*CHANGE ACTIVITY - AS FOLLOWS:                                    @L1A 00044000
.*                                                                    * 00046000
.*$L1=ACB31BIT,HDP2230,,STLSS: O/C/E SUPPORT OF 31-BIT VSAM        @L1A 00048000
.*$01=OY05946,HDP2230,,NSDRJV: EXTRA INSTRUCTION WITH MODE=31      @01A 00050000
.*$02=OY07793,HDP2230,870720,STLSS: REMOVE SPLEVEL DEPENDENCE      @02A 00051000
.*$L2=XXXXXXX,JDZ1110,930930,SJPLMET: PL/X SUPPORT                 @L2A 00051500
.*                                                                    * 00052000
.* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ** 00054000
.*                                                                 @02D 00056000
         LCLA  &ACTR,&ASUM,&CTR,&CTR1,&LGTH,&NUMBER                     00060000
         LCLB  &MFESW,&MFISW,&MFI2SW,&NULLSW,&B(5),&MSW            @L1C 00080000
         LCLC  &PARA                                                    00100000
.*                                                                 @02D 00110000
&NUMBER  SETA  N'&PAR1                                                  00120000
.*                                                                 @02D 00130000
&CTR     SETA  1                                                        00140000
&CTR1    SETA  2                                                        00160000
         AIF   (N'&SYSLIST LE 1).TYPE   IF ONLY 1 (PARMLIST)     A45585 00185000
         IHBERMAC 238                   EXCESSIVE POS. PARMS     A45585 00190000
.TYPE    AIF   (T'&TYPE NE 'O' AND '&TYPE' NE 'T').ERROR8        A45585 00195000
         AIF   (T'&MODE EQ 'O').MFTEST                             @L1A 00199100
         AIF   ('&MODE' NE '31' AND '&MODE' NE '24').ERROR9        @L1A 00203200
         AIF   ('&MODE' EQ '24').MFTEST                            @L1A 00207300
&MSW     SETB  1                         SET MODE=31 SWITCH        @L1A 00211400
.MFTEST  AIF   ('&MF' EQ 'L').RTEL                                 @L1C 00215500
         AIF   ('&MF' EQ 'I').TESTI                                     00220000
         AIF   (N'&MF LE 1).ERROR3                                      00240000
         AIF   ('&MF(1)' NE 'E').ERROR3                                 00260000
&CNAME   IHBINNRA &MF(2)                                                00280000
.*--------------------------------------------------------------------  00293300
         AIF   ('&PAR1' EQ '').RGFLIP                              @L1C 00306600
.LOOPA   AIF   ('&PAR1(&NUMBER)' NE '').LOOPB                           00320000
&NUMBER  SETA  &NUMBER-1                                                00340000
         AIF   (&NUMBER EQ 0).RGFLIP                                    00360000
         AGO   .LOOPA                                                   00380000
.LOOPB   AIF   ('&PAR1(&CTR)' NE '').TESTCTR                            00400000
&NULLSW  SETB  1                                                        00420000
.TESTCTR AIF   (&CTR EQ &NUMBER).QUITNOW                                00440000
         AIF   ('&PAR1(&CTR1)' EQ '').NULLTWO                           00460000
&MFESW   SETB  1                                                        00480000
         AGO   .CLRSW                                                   00500000
.ERTRTRN AIF   (&CTR1 EQ &NUMBER).THRUNOW                               00580000
         AIF   (&NULLSW).NOFIRST                                        00600000
         AIF   ('&PAR1(&CTR)'(1,1) EQ '(').REGISTR                      00620000
         LA    14,&PAR1(&CTR)                    PICK UP DCB ADDRESS    00640000
         AIF   (NOT &MSW).MODE24A                                  @L1A 00646600
&ACTR    SETA  &ACTR+4                                             @L1A 00653200
.MODE24A ST    14,&ACTR.(1,0)                    STORE INTO LIST   @L1C 00659800
         AIF   (NOT &MSW).NOFIRST                                  @L1A 00666400
&ACTR    SETA  &ACTR-4                                             @L1A 00673000
.NOFIRST MVI   &ACTR.(1),&ASUM                   MOVE IN OPTION BYTE    00680000
         AGO   .INCRMT                                                  00700000
.REGISTR ANOP                                                           00720000
&LGTH    SETA  K'&PAR1(&CTR)-2                                          00740000
&PARA    SETC  '&PAR1(&CTR)'(2,&LGTH)                                   00760000
         AIF   (NOT &MSW).MODE24B                                  @L1A 00768500
&ACTR    SETA  &ACTR+4                                             @L1A 00777000
.MODE24B ST    &PARA,&ACTR.(1,0)            STORE DCB ADDR IN LIST @L1C 00785500
         AIF   (NOT &MSW).MODE24C                                  @L1A 00794000
&ACTR    SETA  &ACTR-4                                             @L1A 00802500
.MODE24C MVI   &ACTR.(1),&ASUM                 MOVE IN OPTION BYTE @L1C 00811000
         AGO   .INCRMT                                                  00820000
.NULLTWO AIF   (&NULLSW).INCRMT                                         00880000
         AIF   ('&PAR1(&CTR)'(1,1) EQ '(').REGSTER                      00900000
         AIF   (&MSW).NEXT2                      BRANCH IF MODE=31 @L1A 00910000
         IC    14,&ACTR.(1,0)                    SAVE OPTION BYTE       00920000
.NEXT2   LA    0,&PAR1(&CTR)                   PICK UP DCB ADDRESS @L1C 00928800
         AIF   (NOT &MSW).MODE24D                                  @L1A 00937600
&ACTR    SETA  &ACTR+4                                             @L1A 00946400
.MODE24D ST    0,&ACTR.(1,0)                     STORE INTO LIST   @L1C 00955200
         AIF   (NOT &MSW).MODE24E                                  @L1A 00964000
&ACTR    SETA  &ACTR-4                                             @L1A 00972800
         AGO   .INCRMT                           BRANCH IF MODE=31 @L1A 00981600
.MODE24E STC   14,&ACTR.(1,0)                  RESTORE OPTION BYTE @L1C 00990400
         AGO   .INCRMT                                                  01000000
.REGSTER AIF   (&MSW).NEXT3                      BRANCH IF MODE=31 @L1A 01010000
         IC    14,&ACTR.(1,0)                    SAVE OPTION BYTE       01020000
.NEXT3   ANOP                                                      @L1A 01030000
&LGTH    SETA  K'&PAR1(&CTR)-2                                          01040000
&PARA    SETC  '&PAR1(&CTR)'(2,&LGTH)                                   01060000
         LA    0,&PAR1(&CTR)                   PICK UP DCB ADDRESS @L1A 01066600
         AIF   (NOT &MSW).MODE24F                                  @L1A 01073200
&ACTR    SETA  &ACTR+4                                             @L1A 01079800
.MODE24F ST    &PARA,&ACTR.(1,0)            STORE DCB ADDR IN LIST @L1C 01086400
         AIF   (NOT &MSW).MODE24G                                  @L1A 01093000
&ACTR    SETA  &ACTR-4                                             @L1A 01099600
         AGO   .INCRMT                           BRANCH IF MODE=31 @L1A 01106200
.MODE24G STC   14,&ACTR.(1,0)                  RESTORE OPTION BYTE @L1C 01112800
         AGO   .INCRMT                                                  01120000
.QUITNOW AIF   (&MSW).NEXT4                      BRANCH IF MODE=31 @L1A 01135000
         IC    14,&ACTR.(1,0)                    SAVE OPTION BYTE       01150000
.NEXT4   AIF   ('&PAR1(&CTR)'(1,1) EQ '(').REGST                        01165000
         LA    0,&PAR1(&CTR)                     PICK UP DCB ADDRESS    01180000
         AIF   (NOT &MSW).MODE24H                                  @L1A 01188800
&ACTR    SETA  &ACTR+4                                             @L1A 01197600
.MODE24H ST    0,&ACTR.(1,0)                     STORE INTO LIST   @L1C 01206400
         AIF   (NOT &MSW).MODE24I                                  @L1A 01215200
&ACTR    SETA  &ACTR-4                                             @L1A 01224000
         AGO   .RGFLIP                           BRANCH IF MODE=31 @L1A 01232800
.MODE24I STC   14,&ACTR.(1,0)                  RESTORE OPTION BYTE @L1C 01241600
         AGO   .RGFLIP                                                  01250400
.REGST   ANOP                                                           01260000
&LGTH    SETA  K'&PAR1(&CTR)-2                                          01280000
&PARA    SETC  '&PAR1(&CTR)'(2,&LGTH)                                   01300000
         AIF   (NOT &MSW).MODE24J                                  @L1A 01310000
&ACTR    SETA  &ACTR+4                                             @L1A 01320000
.MODE24J ST    &PARA,&ACTR.(1,0)            STORE DCB ADDR IN LIST @L1C 01330000
         AIF   (NOT &MSW).MODE24K                                  @L1A 01340000
&ACTR    SETA  &ACTR-4                                             @L1A 01350000
         AGO   .RGFLIP                           BRANCH IF MODE=31 @01A 01355000
.MODE24K STC   14,&ACTR.(1,0)                  RESTORE OPTION BYTE @L1C 01360000
         AGO   .RGFLIP                                                  01370000
.THRUNOW NI    &ACTR.(1),X'80'                  CLEAR OPTION BITS       01380000
         AIF   (&ASUM EQ 0).CONTA                                       01390000
         OI    &ACTR.(1),&ASUM           SET OPTION BITS                01400000
.CONTA   AIF   (&NULLSW).RGFLIP                                         01420000
         AGO   .QUITNOW                                                 01440000
.INCRMT  ANOP                                                           01460000
&CTR     SETA  &CTR+2                                                   01480000
&CTR1    SETA  &CTR1+2                                                  01500000
         AIF   (&MSW).MODE24L                                      @L1A 01505700
&ACTR    SETA  &ACTR+4                                             @L1C 01511400
         AGO   .MODE24M                                            @L1A 01517100
.MODE24L ANOP                                                      @L1A 01522800
&ACTR    SETA  &ACTR+8                                             @L1A 01528500
.MODE24M ANOP                                                      @L1A 01534200
&NULLSW  SETB  0                                                        01540000
         AGO   .LOOPB                                                   01560000
.RGFLIP  AIF   (NOT &MSW).SVCSVC       MODE=24..BRANCH             @L1C 01562400
         LR    0,1                                                 @L1A 01564800
         SR    1,1                                                 @L1A 01567200
.*--------------------------------------------------------------------  01569600
.SVCSVC  AIF   ('&TYPE' NE 'T').ISSST                                   01572000
         SVC   23                                ISSUE TCLOSE SVC       01600000
         MEXIT                                                          01620000
.ISSST   SVC   20                                ISSUE CLOSE SVC        01640000
         MEXIT                                                          01660000
.*--------------------------------------------------------------------  01670000
.RTEL    ANOP                                                           01680000
&CNAME   DC    0F'0'             ALIGN LIST TO FULLWORD                 01700000
         AIF   ('&PAR1' EQ '').ERROR5                                   01710000
.CLRSW   ANOP                                                           01720000
&ASUM    SETA  0                                                        01740000
         AIF   (&CTR1 GT &NUMBER).J                                     01780000
         AIF   ('&PAR1(&CTR1)' EQ '').DC1                               01800000
&B(1)    SETB  ('&PAR1(&CTR1)' EQ 'REREAD')                             01820000
&B(2)    SETB  ('&PAR1(&CTR1)' EQ 'LEAVE')                              01840000
&B(3)    SETB  ('&PAR1(&CTR1)' EQ 'DISP')                               01860000
&B(4)    SETB  ('&PAR1(&CTR1)' EQ 'REWIND')                             01870000
&B(5)    SETB  ('&PAR1(&CTR1)' EQ 'FREE') DYNAMIC UNALLOCATION   Y02134 01872000
         AIF   (&B(1)+&B(2)+&B(3)+&B(4)+&B(5) NE 1).ERROR2       Y02134 01880000
         AIF   ('&TYPE' NE 'T').CLO0100 TEST FOR TYPE=T          Y02134 01882000
         AIF   (&B(3) OR &B(4) OR &B(5)).ERROR2 TYPE=T INVLID OP Y02134 01884000
.CLO0100 ANOP                                                    Y02134 01894000
&ASUM    SETA  16*&B(1)+32*&B(5)+48*&B(2)+64*&B(4)               Y02134 01900000
.DC1     AIF   (&MFESW).ERTRTRN                                         01940000
         AIF   (&CTR1 LT &NUMBER).K                                     01960000
.J       ANOP                                                           02040000
&ASUM    SETA  &ASUM+128                                                02080000
.K       AIF   (&MFI2SW).I2ROUT                                         02100000
         AIF   (&MFISW).IROUTRN                                         02120000
         DC    AL1(&ASUM)                        OPTION BYTE            02160000
         AIF   (NOT &MSW).OLDPARM                                  @L1A 02166000
         DC    AL3(0)                                              @L1A 02172000
         AIF   ('&PAR1(&CTR)' NE '').NOBLNK2                       @L1A 02178000
         DC    A(0)                              DCB ADDRESS       @L1A 02184000
         AGO   .NOTLST                                             @L1A 02190000
.NOBLNK2 AIF   ('&PAR1(&CTR)'(1,1) EQ '(').ERROR6                  @L1A 02196000
         DC    A(&PAR1(&CTR))                    DCB ADDRESS       @L1A 02202000
         AGO   .NOTLST                                             @L1A 02208000
.OLDPARM AIF   ('&PAR1(&CTR)' NE '').NOBLANK                       @L1C 02214000
         DC    AL3(0)                            DCB ADDRESS            02220000
         AGO   .NOTLST                                                  02240000
.NOBLANK AIF   ('&PAR1(&CTR)'(1,1) EQ '(').ERROR6                       02280000
         DC    AL3(&PAR1(&CTR))                  DCB ADDRESS            02300000
.NOTLST  AIF   (&CTR1 GE &NUMBER).FINI                                  02320000
&CTR     SETA  &CTR+2                                                   02340000
&CTR1    SETA  &CTR1+2                                                  02360000
         AGO   .CLRSW                                                   02380000
.*--------------------------------------------------------------------  02395000
.TESTI   AIF   (&MSW).LPLIST                                       @L1A 02410000
         CNOP  0,4                               ALIGN LIST TO FULLWORD 02425000
&LGTH    SETA  ((&NUMBER+1)/2)*4+4                                      02440000
         AIF   (T'&MODE EQ 'O').LEV1        BR IF MODE NOT SPECD.  @02C 02446600
.* BAS INSTRUCTION REQUIRES ASSEMBLER H VERSION 2                       02453200
&CNAME   BAS   1,*+&LGTH                         LOAD REG1 W/LIST ADDR  02460000
         AGO   .CONT                                               @L1A 02464400
.LEV1    ANOP                                                      @L2A 02465500
&CNAME   BAL   1,*+&LGTH                    LOAD REG1 W/LIST ADDR. @L2A 02466600
         AGO   .CONT                                               @L2A 02467700
.LPLIST  ANOP                                                      @L1A 02468800
         CNOP  0,4                               ALIGN LIST TO HALFWORD 02473200
&LGTH    SETA  ((&NUMBER+1)/2)*8+4                                 @L1A 02477600
         AIF   (T'&MODE EQ 'O').LEV2        BR IF MODE NOT SPECD.  @02C 02479800
.* BAS INSTRUCTION REQUIRES ASSEMBLER H VERSION 2                       02482000
&CNAME   BAS   1,*+&LGTH                    LOAD REG1 W/LIST ADDR. @L1A 02484200
         AGO   .CONT                                               @L2A 02485800
.LEV2    ANOP                                                      @L2A 02487400
&CNAME   BAL   1,*+&LGTH                    LOAD REG1 W/LIST ADDR. @L2A 02489000
.CONT    ANOP                                                      @L1A 02490800
&MFISW   SETB  1                                 MF=I SWITCH      @L1C  02495200
.RTEYE   AIF   ('&PAR1(&CTR)' EQ '').ERROR5                             02500000
         AIF   ('&PAR1(&CTR)'(1,1) NE '(').CLRSW                        02520000
         AIF   (NOT &MSW).SPL1                   MODE=24; BRANCH  @L1A  02525700
         DC    A(0)                              OPTION BYTE      @L1A  02531400
         DC    A(0)                              DCB ADDRESS      @L1A  02537100
         AGO   .UPCTRS                                            @L1A  02542800
.SPL1    ANOP                                    FOR MODE=24      @L1A  02548500
         DC    A(0)                              OPT BYTE AND DCB ADDR. 02554200
         AGO   .UPCTRS                                                  02560000
.IROUTRN DC    AL1(&ASUM)                        OPTION BYTE            02580000
         AIF   (&MSW).IROUT3                     MODE=31,BRANCH    @L1A 02590000
         DC    AL3(&PAR1(&CTR))                  DCB ADDRESS            02600000
         AGO   .UPCTRS                                             @L1A 02605000
.IROUT3  DC    AL3(0)                                              @L1A 02610000
         DC    A(&PAR1(&CTR))                    DCB ADDRESS       @L1A 02615000
.UPCTRS  AIF   (&CTR1 GE &NUMBER).QUITS                                 02620000
&CTR     SETA  &CTR+2                                                   02640000
&CTR1    SETA  &CTR1+2                                                  02660000
         AGO   .RTEYE                                                   02680000
.QUITS   ANOP                                                           02700000
&CTR     SETA  1                                                        02720000
&CTR1    SETA  2                                                        02740000
.ILOOP2  AIF   ('&PAR1(&CTR)'(1,1) NE '(').UPCTR2                       02760000
&LGTH    SETA  K'&PAR1(&CTR)-2                                          02780000
&PARA    SETC  '&PAR1(&CTR)'(2,&LGTH)                                   02800000
         AIF   (NOT &MSW).PARA2                                    @L1A 02810000
&ACTR    SETA  &ACTR+4                                             @L1A 02820000
.PARA2   ST    &PARA,&ACTR.(1,0)                 STORE INTO LIST   @L1C 02830000
&MFI2SW  SETB  1                                                        02840000
         AGO   .CLRSW                                                   02860000
.I2ROUT  ANOP                                                      @L1A 02870000
         AIF   (NOT &MSW).UPCTR3                                   @L1A 02880000
&ACTR    SETA  &ACTR-4                                             @L1A 02890000
.UPCTR3  AIF   (&ASUM EQ 0).UPCTR2                                 @L1C 02900000
         MVI   &ACTR.(1),&ASUM                MOVE IN OPTION BYTE  @L1C 02910000
.UPCTR2  AIF   (&CTR1 GE &NUMBER).ZERO1                            @L1A 02920000
&CTR     SETA  &CTR+2                                                   02940000
&CTR1    SETA  &CTR1+2                                                  02960000
         AIF   (&MSW).INCR1                                        @L1A 02970000
&ACTR    SETA  &ACTR+4                                                  02980000
         AGO   .ILOOP2                                                  03000000
.ZERO1   ANOP                                                      @L1A 03000600
         AIF   (NOT &MSW).SVCSVC              LONG-FORM REQUESTED? @L1A 03001200
         LR    0,1                            POINT REG0 TO PLIST  @L1A 03001800
         SR    1,1                            CLEAR REGISTER 1     @L1A 03002400
         AGO   .SVCSVC                                             @L1A 03003000
.INCR1   ANOP                                                      @L1A 03004000
&ACTR    SETA  &ACTR+8                                             @L1A 03008000
         AGO   .ILOOP2                                             @L1A 03012000
.*--------------------------------------------------------------------  03016000
.ERROR2  IHBERMAC 49,,&PAR1(&CTR1)      INVALID OPTION OPERAND          03020000
         MEXIT                                                          03040000
.ERROR3  IHBERMAC 35,,&MF               INVALID MF OPERAND SPECIFIED    03060000
         MEXIT                                                          03080000
.ERROR5  IHBERMAC 06                    DCB MISSING                     03100000
         MEXIT                                                          03120000
.ERROR6  IHBERMAC 69                    INVALID REG NOTATION W/MF=L     03140000
         MEXIT                                                          03146000
.ERROR8  IHBERMAC 63,,&TYPE             INVALID TYPE OPERAND     M0626  03156000
         MEXIT                                                          03157300
.ERROR9  IGGERMAC 201                   INVALID MODE OPERAND      @L1A  03158600
.*                                                            D 2  @02D 03159300
.FINI    MEND                                                           03160000
**/ CLOSE: MACRO KEYS(DCB_NAME,DCB_ADDR,MODE,TYPE_T,RETCODE,   /*@L2A*/ 03210000
*        MF);                                                  /*@L2A*/ 03260000
* ANS('? '||MACLABEL||' CLOSEP '||MACKEYS||';') RESCAN SKIP;   /*@L2A*/ 03310000
*  %END CLOSE;                                                 /*@L2A*/ 03360000
