*/* START OF SPECIFICATIONS **************************************** */ 00050000
*/* $MAC(CNLMMCA) COMP(SCMMS) PROD(HBB4410): MMS MCA mapping macro   */ 00100000
*/*                                                                  */ 00150000
*/* PROPRIETARY STATEMENT =                                          */ 00183300
*/*                                                                  */ 00216600
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00350000
*/*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    */ 00362500
*/*   5695-047 (C) COPYRIGHT IBM CORP. 1990                          */ 00375000
*/*   SEE COPYRIGHT INSTRUCTIONS.                                    */ 00387500
*/*                                                                  */ 00400000
*/*   STATUS           =  HBB4410                                    */ 00412500
*/*                                                                  */ 00425000
*/*                                                                  */ 00437500
*/* START OF PUBLISHING SPECIFICATIONS ***************************** */ 00450000
*/*                                                                  */ 00500000
*/*                                                                  */ 00600000
*/* DESCRIPTIVE NAME:  Message Communication Area Mapping Macro      */ 00650000
*/*  ACRONYM:  MCA                                                   */ 00700000
*/*                                                                  */ 00750000
*/* MACRO NAME:  CNLMMCA                                             */ 00800000
*/*                                                                  */ 00850000
*/* DSECT NAME:                                                      */ 00900000
*/*  MCA                                                             */ 00950000
*/*                                                                  */ 01000000
*/* COMPONENT:  MVS Message Service                                  */ 01050000
*/*                                                                  */ 01100000
*/* EYE-CATCHER:  'MCA '                                             */ 01150000
*/*  OFFSET:  0                                                      */ 01200000
*/*  LENGTH:  4                                                      */ 01250000
*/*                                                                  */ 01300000
*/* STORAGE ATTRIBUTES:                                              */ 01350000
*/*  SUBPOOL:  228                                                   */ 01400000
*/*  KEY:      0                                                     */ 01450000
*/*  RESIDENCY:  Above 16 MB in extended CSA                         */ 01500000
*/*                                                                  */ 01550000
*/* CREATED BY:                                                      */ 01600000
*/*  CNLSINIT                                                        */ 01650000
*/*                                                                  */ 01700000
*/* POINTED TO BY:                                                   */ 01750000
*/*  SCVTMCA field of the Secondary Communication Vector Table       */ 01800000
*/*                                                                  */ 01850000
*/* SERIALIZATION:                                                   */ 01900000
*/*  Compare and Swap logic                                          */ 01950000
*/*                                                                  */ 02000000
*/* FUNCTION:                                                        */ 02050000
*/*                                                                  */ 02100000
*/*  Used to map the Message Communication Area which contains       */ 02150000
*/*  global control information for the MVS Message Service          */ 02200000
*/*  MCA contains a pointer to Message Anchor Block (MAB).           */ 02250000
*/*                                                                  */ 02300000
*/* METHOD OF ACCESS:                                                */ 02350000
*/*  ASM:  CNLMMCA                                                   */ 02400000
*/*  PL/AS:  %INCLUDE SYSLIB(CNLMMCA)                                */ 02450000
*/*                                                                  */ 02500000
*/*  END OF PUBLISHING SPECIFICATIONS ****************************** */ 02550000
*/*                                                                  */ 02600000
*/* STATUS:  Version 1 Release 1 Change Level 0                      */ 02650000
*/*                                                                  */ 02700000
*/* DELETED BY:                                                      */ 02750000
*/*  CNLSMEMT                                                        */ 02800000
*/*                                                                  */ 02850000
*/* FREQUENCY:  None.                                                */ 02900000
*/*                                                                  */ 02950000
*/* DEPENDENCIES:  None.                                             */ 03000000
*/*                                                                  */ 03050000
*/* DISTRIBUTION LIBRARY:  AMACLIB                                   */ 03100000
*/*                                                                  */ 03150000
*/* CHANGE ACTIVITY  =                                               */ 03200000
*/*                                                                  */ 03250000
*/* Code Reason   FMID    Date  Origin  Comments                     */ 03300000
*/* ---- ------- ------- ------ ------                               */ 03350000
*/* $L0= MMS     HBB4410 890401 STOW:   Original Code                */ 03400000
*/* $L1= MMSGBT  HBB4410 890705 PDBT:   Retrofit for SP4.1.0         */ 03425000
*/* $P1= PEO3044 HBB4410 891130 PDDH:   Add MCASDTA flag             */ 03431200
*/* $P2= PEO3171 HBB4410 900226 PDDH:   Add Reserve field            */ 03437400
*/* $D1= DCR 353 HBB4410 900505 PDDH:   Del Communication word       */ 03443600
*/* $P3= PKB3293 HBB4430 920617 PDBT:   Minor prolog correction      */ 03446800
*/*                                                                  */ 03450000
*/* END OF SPECIFICATIONS ****************************************** */ 03500000
*        %GOTO MCA_PLAS;                                                03550000
         MACRO                                                          03600000
         CNLMMCA                                                        03650000
MCA      DSECT                   MESSAGE COMMUNICATION AREA             03700000
MCAACRN  DS    CL4               MCA ACRONYM "MCA"                      03750000
MCAVRSN  DS    X                 MCA VERSION NUMBER                     03800000
$MCA_VERSION   EQU   X'01'       CURRENT MCA VERSION NUMBER             03850000
MCAFLAGS DS    X                 MCA FLAGS                              03900000
MCAAVAIL EQU   X'80'             MMS IS AVAILABLE                       03950000
MCASDTA  EQU   X'40'             SET/DISPLAY TASK ACTIVE           @P1A 03975000
         DS    CL2               RESERVED                               04000000
MCAMABP  DS    A                 ADDRESS OF MAB                         04050000
MCASPCNO DS    F                 SET MMS PC NUMBER                      04100000
MCADPCNO DS    F                 DISPLAY MMS PC NUMBER                  04150000
MCATPCNO DS    F                 TRANSLATE MESSAGE PC NUMBER            04200000
MCAQPCNO DS    F                 QUERY LANGUAGE PC NUMBER               04250000
MCADLANG DS    CL3               MCA DEFAULT LANGUAGE CODE              04300000
         DS    CL1               RESERVED                               04350000
MCAALCNT DS    F                 ACTIVE LANGUAGE COUNT                  04400000
         DS    F                 RESERVED                          @D1C 04450000
MCAXMTOK DS    F                 CROSS MEMORY ENTRY TABLE TOKEN         04500000
         DS    CL16              RESERVED                          @P2C 04550000
         MEND                                                           04600000
*%MCA_PLAS: ;                                                           04650000
*@SPACE;                                                                04700000
*   DCL                                                                 04750000
*     MCA_PTR           PTR(31)    /* Pointer to MCA control block   */ 04800000
*                       LOCATES (MCA);                                  04850000
*   DCL                                                                 04900000
*     1 MCA  BASED (MCA_PTR),      /* Message Communication area     */ 04950000
*       3 MCAACRN       CHAR(4),   /* Acronym "MCA "                 */ 05000000
*       3 MCAVRSN       FIXED(8),  /* MCA version                    */ 05050000
*       3 MCAFLAGS      BIT(8),    /* MCA flags                      */ 05100000
*         5 MCAAVAIL    BIT(1),    /* MMS is available               */ 05150000
*         5 MCASDTA     BIT(1),    /* SET/DISPLAY task active    @P1A*/ 05183300
*         5 *           BIT(6),    /* Reserved                       */ 05216600
*       3 *             CHAR(2),   /* Reserved                       */ 05250000
*       3 MCAMABP       PTR(31),   /* Address of MAB                 */ 05300000
*       3 MCASPCNO      FIXED(31), /* Set MMS PC number              */ 05350000
*       3 MCADPCNO      FIXED(31), /* Display MMS PC number          */ 05400000
*       3 MCATPCNO      FIXED(31), /* Translate message PC number    */ 05450000
*       3 MCAQPCNO      FIXED(31), /* Query language PC number       */ 05550000
*       3 MCADLANG      CHAR(3),   /* Default language code          */ 05600000
*       3 *             CHAR(1),   /* Reserved                       */ 05650000
*       3 MCAALCNT      FIXED(31), /* Active language count          */ 05700000
*       3 *             CHAR(4),   /* Reserved                   @D1C*/ 05750000
*       3 MCAXMTOK      FIXED(31), /* Cross Memory entry table token */ 05800000
*       3 *             CHAR(16);  /* Reserved                   @P2C*/ 05850000
*@SPACE;                                                                05900000
*   DCL                                                                 05950000
*     $MCA_ACRONYM      CHAR(4)    /* Eye catcher for MCA            */ 06000000
*                       CONSTANT('MCA ');                               06050000
*@SPACE;                                                                06100000
*   DCL                                                                 06150000
*     $MCA_VERSION      FIXED(8)   /* Current version of MCA         */ 06200000
*                       CONSTANT(1);                                    06250000
*@SPACE;                                                                06300000
