*                                                                       00050000
* %DCL CSRSIIDF_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE CSRSIIDF_INCLUDED;                                        00150000
* %IF CSRSIIDF_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99077. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSRSIIDF &DSECT=YES,&LIST=YES,&TITLE=YES,&SI00=YES,&SIV1=COND,*00450000
               &SIV1V2=COND,&SIV1V2V3=COND,&SIV1V3=COND,&SIV2=COND,    *00500000
               &SIV2V3=COND,&SIV3=COND,&SI11V1=COND,&SI22V1=COND,      *00550000
               &SI22V2=COND,&SI22V3=COND,&SI22V3DB=COND                 00600000
         GBLC  &CSRSIIDF_INCLUDED                                       00650000
         GBLC  &ZCBPRINT                                                00700000
&CSRSIIDF_INCLUDED SETC 'YES'                                           00750000
         AIF   ('&LIST' EQ 'NONE').P0                                   00800000
         AIF   ('&TITLE' EQ 'NO').P5                                    00850000
 TITLE   'CSRSIIDF  - CSRSI IDF (return codes and output area maps)  '  00900000
.P5      ANOP                                                           00950000
**/ CSRSIIDF_1:;                                                        01000000
*/* START OF SPECIFICATIONS ******************************************* 01050000
*                                                                       01100000
*  **PROPRIETARY_STATEMENT********************************************  01150000
***01* PROPRIETARY STATEMENT=                                        *  01200000
*                                                                    *  01250000
*                                                                    *  01300000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01350000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01400000
*   5647-A01 (C) COPYRIGHT IBM CORP. 1999                            *  01450000
*                                                                    *  01500000
*   STATUS= HBB6601                                                  *  01550000
*                                                                    *  01600000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01650000
*                                                                       01700000
*01* DESCRIPTIVE NAME:  CSRSI IDF (return codes and output area maps)   01750000
*02*  ACRONYM:  SI00                                                    01800000
*                                                                       01850000
*01* MACRO NAME:  CSRSIIDF                                              01900000
*                                                                       01950000
*01* EXTERNAL CLASSIFICATION: GUPI                                      02000000
*01* END OF EXTERNAL CLASSIFICATION:                                    02050000
*                                                                       02100000
*01* DSECT NAME:                                                        02150000
*           SI00                                                        02200000
*           SIV1                                                        02250000
*           SIV1V2                                                      02300000
*           SIV1V2V3                                                    02350000
*           SIV1V3                                                      02400000
*           SIV2                                                        02450000
*           SIV2V3                                                      02500000
*           SIV3                                                        02550000
*           SI11V1                                                      02600000
*           SI22V1                                                      02650000
*           SI22V2                                                      02700000
*           SI22V3                                                      02750000
*           SI22V3DB                                                    02800000
*                                                                       02850000
*01* COMPONENT:  CSR (SCCSR)                                            02900000
*                                                                       02950000
*01* EYE-CATCHER:  NONE                                                 03000000
*                                                                       03050000
*01* STORAGE ATTRIBUTES:                                                03100000
*02*  SUBPOOL:  Caller-supplied                                         03150000
*02*  KEY:  Caller-supplied                                             03200000
*02*  RESIDENCY:  Caller-supplied                                       03250000
*                                                                       03300000
*01* SIZE:  Variable                                                    03350000
*           SI00     -- X'0040' bytes                                   03400000
*           SIV1     -- X'2040' bytes                                   03450000
*           SIV1V2   -- X'3040' bytes                                   03500000
*           SIV1V2V3 -- X'4040' bytes                                   03550000
*           SIV1V3   -- X'3040' bytes                                   03600000
*           SIV2     -- X'1040' bytes                                   03650000
*           SIV2V3   -- X'2040' bytes                                   03700000
*           SIV3     -- X'1040' bytes                                   03750000
*           SI11V1   -- X'1000' bytes                                   03800000
*           SI22V1   -- X'1000' bytes                                   03850000
*           SI22V2   -- X'1000' bytes                                   03900000
*           SI22V3   -- X'1000' bytes                                   03950000
*           SI22V3DB -- X'0040' bytes                                   04000000
*                                                                       04050000
*01* CREATED BY:                                                        04100000
*     Caller and passed as parameter on InfoArea parameter              04150000
*      on call to CSRSI                                                 04200000
*                                                                       04250000
*01* POINTED TO BY:                                                     04300000
*     CSRSI parameter list                                              04350000
*                                                                       04400000
*01* SERIALIZATION:                                                     04450000
*     None required                                                     04500000
*                                                                       04550000
*01* FUNCTION:                                                          04600000
*02* Provides return code equates for the CSRSI service.                04650000
*02* Maps the InfoArea data returned by the CSRSI service.              04700000
*                                                                       04750000
*02* The data returned depends upon the request.                        04800000
*03* SIV1 DSECT maps the data returned when only V1CPC_MACHINE data     04850000
*    is requested.                                                      04900000
*03* SIV1V2 DSECT maps the data returned when only V1CPC_MACHINE data   04950000
*    and V2CPC_LPAR data are requested.                                 05000000
*03* SIV1V2V3 DSECT maps the data returned when V1CPC_MACHINE data,     05050000
*    V2CPC_LPAR data, and V3CPC_VM data are requested.                  05100000
*03* SIV1V3 DSECT maps the data returned when only V1CPC_MACHINE data   05150000
*    and V3CPC_VM data are requested.                                   05200000
*03* SIV2 DSECT maps the data returned when only V2CPC_LPAR data        05250000
*    is requested.                                                      05300000
*03* SIV2V3 DSECT maps the data returned when only V2CPC_LPAR data      05350000
*    and V3CPC_VM data are requested.                                   05400000
*03* SIV3 DSECT maps the data returned when only V3CPC_VM data          05450000
*    is requested.                                                      05500000
*03* SI00 DSECT maps "starter" information (including STIDP)            05550000
*03* SI11V1 DSECT maps the general CPC information for a machine.       05600000
*03* SI22V1 DSECT maps multiple CPU information for a machine.          05650000
*03* SI22V2 DSECT maps multiple CPU information for an LPAR.            05700000
*03* SI22V3 DSECT maps multiple CPU information when running under VM.  05750000
*                                                                       05800000
*02*   The SI00ValidityFlags fields indicates whether the data          05850000
*      returned for each requested area (other than SI00) is valid.     05900000
*      There is no bit for the SI00 area itself since that              05950000
*      area is always valid.                                            06000000
*                                                                       06050000
*02*   The infoarea length must match the length of the DSECT           06100000
*      that maps the requested data.                                    06150000
*                                                                       06200000
*01* METHOD OF ACCESS:                                                  06250000
*02*  ASM:                                                              06300000
*      CSRSIIDF                                                         06350000
*           DSECT=YES|NO  -- Request DSECT definition                   06400000
*           SI00=YES|NO|COND -- Map header information                  06450000
*                            USING on SI00                              06500000
*           SIV1=YES|NO|COND -- Map V1CPC_MACHINE information           06550000
*                            USING on SIV1                              06600000
*           SIV1V2=YES|NO|COND -- Map V1CPC_MACHINE                     06650000
*                            and V2CPC_LPAR information                 06700000
*                            USING on SIV1V2                            06750000
*           SIV1V2V3=YES|NO|COND -- Map V1CPC_MACHINE, V2CPC_LPAR,      06800000
*                            and V3CPC_VM information                   06850000
*                            USING on SIV1V2V3                          06900000
*           SIV1V3=YES|NO|COND -- Map V1CPC_MACHINE                     06950000
*                            and V3CPC_VM information                   07000000
*                            USING on SIV1V3                            07050000
*           SIV2=YES|NO|COND -- Map V2CPC_LPAR information              07100000
*                            USING on SIV2                              07150000
*           SIV2V3=YES|NO|COND -- Map V2CPC_LPAR                        07200000
*                            and V3CPC_VM information                   07250000
*                            USING on SIV2V3                            07300000
*           SIV3=YES|NO|COND -- Map V3CPC_VM information                07350000
*                            USING on SIV3                              07400000
*           SI11V1=YES|NO|COND -- Map general CPC for machine           07450000
*                            USING on SI11V1                            07500000
*           SI22V1=YES|NO|COND -- Map multiple CPU for machine          07550000
*                            USING on SI22V1                            07600000
*           SI22V2=YES|NO|COND -- Map multiple CPU for LPAR             07650000
*                            USING on SI22V2                            07700000
*           SI22V3=YES|NO|COND -- Map multiple CPU for VM               07750000
*                            USING on SI22V3                            07800000
*           SI22V3DB=YES|NO|COND -- Map directory block for VM          07850000
*                            USING on SI22V3DB                          07900000
*     Default: DSECT=YES,SI00=YES,                                      07950000
*              SIV1=COND,SIV1V2=COND,SIV1V2V3=COND,SIV1V3=COND,         08000000
*              SIV2=COND,SIV2V3=COND,SIV3=COND,                         08050000
*              SI11V1=COND,                                             08100000
*              SI22V1=COND,SI22V2=COND,SI22V3=COND,SI22V3DB=COND        08150000
*     Notes: name=YES  => expand                                        08200000
*            name=NO   => do not expand                                 08250000
*            name=COND => expand only if DSECT=YES                      08300000
*                                                                       08350000
*02*  PL/X:                                                             08400000
*      %INCLUDE SYSLIB(CSRSIIDF)                                        08450000
*                                                                       08500000
*01* DELETED BY:  Caller                                                08550000
*                                                                       08600000
*01* FREQUENCY:  Created for response to CSRSI service                  08650000
*                                                                       08700000
*01* DEPENDENCIES:  None                                                08750000
*                                                                       08800000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     08850000
*                                                                       08900000
*01* CHANGE ACTIVITY:                                                   08950000
*   $00=STSICBG  ,HBB6601,990206,PD00XB: OW38489 STSI                   09000000
*   $01=STSICSR  ,HBB6601,990206,PD00XB: OW38489 STSI                   09050000
*                                                                       09100000
* END OF SPECIFICATIONS *********************************************/  09150000
*% /*                                                                   09200000
.P0      ANOP                                                           09250000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 09300000
         AIF   ('&LIST' EQ 'YES').P2                                    09350000
.P1      ANOP                                                           09400000
         PUSH  PRINT                                                    09450000
         PRINT OFF                                                      09500000
.P2      ANOP                                                           09550000
*                                                                       09600000
* ********************************************************************  09650000
* * SI00 represents the "starter" information                        *  09700000
* ********************************************************************  09750000
*                                                                       09800000
*                                                                       09850000
         AIF   ('&SI00' EQ 'NO').L0002                                  09900000
         AIF   ('&DSECT' EQ 'YES').L0003                                09950000
         AIF   ('&SI00' NE 'YES').L0002                                 10000000
SI00     DS    0D                                                       10050000
         AGO   .L0004                                                   10100000
.L0003   ANOP                                                           10150000
SI00     DSECT                                                          10200000
.L0004   ANOP                                                           10250000
SI00CPCVARIETY DS 1FL1   SI00CPCVariety_V1CPC_Machine,                 *10300000
                         SI00CPCVariety_V2CPC_LPAR, or                 *10350000
                         SI00CPCVariety_V3CPC_VM                        10400000
SI00VALIDITYFLAGS DS 1BL1 Validity flags                                10450000
         ORG   SI00VALIDITYFLAGS                                        10500000
SI00VALIDSI11V1 EQU X'80' SI11V1 was requested and the information     *10550000
                         returned is valid                              10600000
SI00VALIDSI22V1 EQU X'40' SI22V1 was requested and the information     *10650000
                         returned is valid                              10700000
SI00VALIDSI22V2 EQU X'20' SI22V2 was requested and the information     *10750000
                         returned is valid                              10800000
SI00VALIDSI22V3 EQU X'10' SI22V3 was requested and the information     *10850000
                         returned is valid                              10900000
         ORG   SI00VALIDITYFLAGS+X'00000001'                            10950000
         DS    1CL0002   Reserved                                       11000000
SI00PCCACPID DS 1CL0012  PCCACPID value for this CPU                    11050000
SI00PCCACPUA DS 1CL0002  PCCACPUA value for this CPU                    11100000
SI00PCCACAFM DS 1CL0002  PCCACAFM value for this CPU                    11150000
         DS    1CL0004   Reserved                                       11200000
SI00LASTUPDATETIMESTAMP DS 1CL0008 Time of last STSI update, via STCK   11250000
         DS    1CL0032   Reserved                                       11300000
*                                                                       11350000
* ********************************************************************  11400000
* * SI00 Constants                                                   *  11450000
* ********************************************************************  11500000
*                                                                       11550000
*                                                                       11600000
SI00CPCVARIETY_V1CPC_MACHINE EQU 1 Value for a V1 CPC (not LPAR, not   *11650000
                         VM)                                            11700000
SI00CPCVARIETY_V2CPC_LPAR EQU 2 Value for a V2 CPC (LPAR)               11750000
SI00CPCVARIETY_V3CPC_VM EQU 3 Value for a V3 CPC (VM)                   11800000
*                                                                       11850000
* ********************************************************************  11900000
* *      Constants for Parameters and Return Codes                   *  11950000
* ********************************************************************  12000000
*   Store System Information Constants                                  12050000
*                                                                       12100000
*                                                                       12150000
CSRSI_REQUEST_V1CPC_MACHINE EQU 1 Requests information about a V1 CPC  *12200000
                         (not LPAR, not VM)                             12250000
CSRSI_REQUEST_V2CPC_LPAR EQU 2 Requests information about a V2 CPC     *12300000
                         (LPAR)                                         12350000
CSRSI_REQUEST_V3CPC_VM EQU 4 Requests information about a V3 CPC (VM)   12400000
*                                                                       12450000
*   Store System Information Return Codes                               12500000
*   Note: 0C4 abend if bad address provided in parmlist or user data    12550000
*                                                                       12600000
*                                                                       12650000
CSRSI_SUCCESS EQU 0      CSRSI service completed successfully           12700000
CSRSI_STSINOTAVAILABLE EQU 4 STSI instruction is not available on this *12750000
                         system. Only the SI00PCCACPID, SI00PCCACPUA,  *12800000
                         SI00PCCACAFM fields are valid.                 12850000
CSRSI_SERVICENOTAVAILABLE EQU 8 CSRSI service is not available on this *12900000
                         system.                                        12950000
CSRSI_BADREQUEST EQU 12  The request parameter did not specify a word  *13000000
                         with a value formed from adding any           *13050000
                         combination of CSRSI_Request_V1CPC_Machine,   *13100000
                         CSRSI_Request_V2CPC_LPAR, and                 *13150000
                         CSRSI_Request_V3CPC_VM.                        13200000
CSRSI_BADINFOAREALEN EQU 16 The value of the InfoAreaLen parameter     *13250000
                         does not match the length needed to           *13300000
                         accomodate the requested data.                 13350000
CSRSI_BADLOCK EQU 20     Service was called holding a system lock      *13400000
                         other than CPU, LOCAL/CML, CMS                 13450000
SI00_LEN EQU   *-SI00                                                   13500000
.L0002   ANOP                                                           13550000
*                                                                       13600000
* ********************************************************************  13650000
* * SIV1 represents the information returned when V1CPC_Machine      *  13700000
* * data is requested                                                *  13750000
* ********************************************************************  13800000
*                                                                       13850000
*                                                                       13900000
         AIF   ('&SIV1' EQ 'NO').L0005                                  13950000
         AIF   ('&DSECT' EQ 'YES').L0006                                14000000
         AIF   ('&SIV1' NE 'YES').L0005                                 14050000
SIV1     DS    0D                                                       14100000
         AGO   .L0007                                                   14150000
.L0006   ANOP                                                           14200000
SIV1     DSECT                                                          14250000
.L0007   ANOP                                                           14300000
SIV1SI00 DS    1CL0064   Area mapped by dsect SI00                      14350000
SIV1SI11V1 DS  1CL4096   Area mapped by dsect SI11V1                    14400000
SIV1SI22V1 DS  1CL4096   Area mapped by dsect SI22V1                    14450000
SIV1_LEN EQU   *-SIV1                                                   14500000
.L0005   ANOP                                                           14550000
*                                                                       14600000
* ********************************************************************  14650000
* * SIV1V2 represents the information returned when V1CPC_Machine    *  14700000
* * data and V2CPC_LPAR data is requested                            *  14750000
* ********************************************************************  14800000
*                                                                       14850000
*                                                                       14900000
         AIF   ('&SIV1V2' EQ 'NO').L0008                                14950000
         AIF   ('&DSECT' EQ 'YES').L0009                                15000000
         AIF   ('&SIV1V2' NE 'YES').L0008                               15050000
SIV1V2   DS    0D                                                       15100000
         AGO   .L000A                                                   15150000
.L0009   ANOP                                                           15200000
SIV1V2   DSECT                                                          15250000
.L000A   ANOP                                                           15300000
SIV1V2SI00 DS  1CL0064   Area mapped by dsect SI00                      15350000
SIV1V2SI11V1 DS 1CL4096  Area mapped by dsect SI11V1                    15400000
SIV1V2SI22V1 DS 1CL4096  Area mapped by dsect SI22V1                    15450000
SIV1V2SI22V2 DS 1CL4096  Area mapped by dsect SI22V2                    15500000
SIV1V2_LEN EQU *-SIV1V2                                                 15550000
.L0008   ANOP                                                           15600000
*                                                                       15650000
* ********************************************************************  15700000
* * SIV1V2V3 represents the information returned when V1CPC_Machine  *  15750000
* * data, V2CPC_LPAR data and V3CPC_VM data is requested             *  15800000
* ********************************************************************  15850000
*                                                                       15900000
*                                                                       15950000
         AIF   ('&SIV1V2V3' EQ 'NO').L000B                              16000000
         AIF   ('&DSECT' EQ 'YES').L000C                                16050000
         AIF   ('&SIV1V2V3' NE 'YES').L000B                             16100000
SIV1V2V3 DS    0D                                                       16150000
         AGO   .L000D                                                   16200000
.L000C   ANOP                                                           16250000
SIV1V2V3 DSECT                                                          16300000
.L000D   ANOP                                                           16350000
SIV1V2V3SI00 DS 1CL0064  Area mapped by dsect SI00                      16400000
SIV1V2V3SI11V1 DS 1CL4096 Area mapped by dsect SI11V1                   16450000
SIV1V2V3SI22V1 DS 1CL4096 Area mapped by dsect SI22V1                   16500000
SIV1V2V3SI22V2 DS 1CL4096 Area mapped by dsect SI22V2                   16550000
SIV1V2V3SI22V3 DS 1CL4096 Area mapped by dsect SI22V3                   16600000
SIV1V2V3_LEN EQU *-SIV1V2V3                                             16650000
.L000B   ANOP                                                           16700000
*                                                                       16750000
* ********************************************************************  16800000
* * SIV1V3 represents the information returned when V1CPC_Machine    *  16850000
* * data and V3CPC_VM data is requested                              *  16900000
* ********************************************************************  16950000
*                                                                       17000000
*                                                                       17050000
         AIF   ('&SIV1V3' EQ 'NO').L000E                                17100000
         AIF   ('&DSECT' EQ 'YES').L000F                                17150000
         AIF   ('&SIV1V3' NE 'YES').L000E                               17200000
SIV1V3   DS    0D                                                       17250000
         AGO   .L0010                                                   17300000
.L000F   ANOP                                                           17350000
SIV1V3   DSECT                                                          17400000
.L0010   ANOP                                                           17450000
SIV1V3SI00 DS  1CL0064   Area mapped by dsect SI00                      17500000
SIV1V3SI11V1 DS 1CL4096  Area mapped by dsect SI11V1                    17550000
SIV1V3SI22V1 DS 1CL4096  Area mapped by dsect SI22V1                    17600000
SIV1V3SI22V3 DS 1CL4096  Area mapped by dsect SI22V3                    17650000
SIV1V3_LEN EQU *-SIV1V3                                                 17700000
.L000E   ANOP                                                           17750000
*                                                                       17800000
* ********************************************************************  17850000
* * SIV2 represents the information returned when V2CPC_LPAR         *  17900000
* * data is requested                                                *  17950000
* ********************************************************************  18000000
*                                                                       18050000
*                                                                       18100000
         AIF   ('&SIV2' EQ 'NO').L0011                                  18150000
         AIF   ('&DSECT' EQ 'YES').L0012                                18200000
         AIF   ('&SIV2' NE 'YES').L0011                                 18250000
SIV2     DS    0D                                                       18300000
         AGO   .L0013                                                   18350000
.L0012   ANOP                                                           18400000
SIV2     DSECT                                                          18450000
.L0013   ANOP                                                           18500000
SIV2SI00 DS    1CL0064   Area mapped by dsect SI00                      18550000
SIV2SI22V2 DS  1CL4096   Area mapped by dsect SI22V2                    18600000
SIV2_LEN EQU   *-SIV2                                                   18650000
.L0011   ANOP                                                           18700000
*                                                                       18750000
* ********************************************************************  18800000
* * SIV2V3 represents the information returned when V2CPC_LPAR       *  18850000
* * and V3CPC_VM data is requested                                   *  18900000
* ********************************************************************  18950000
*                                                                       19000000
*                                                                       19050000
         AIF   ('&SIV2V3' EQ 'NO').L0014                                19100000
         AIF   ('&DSECT' EQ 'YES').L0015                                19150000
         AIF   ('&SIV2V3' NE 'YES').L0014                               19200000
SIV2V3   DS    0D                                                       19250000
         AGO   .L0016                                                   19300000
.L0015   ANOP                                                           19350000
SIV2V3   DSECT                                                          19400000
.L0016   ANOP                                                           19450000
SIV2V3SI00 DS  1CL0064   Area mapped by dsect SI00                      19500000
SIV2V3SI22V2 DS 1CL4096  Area mapped by dsect SI22V2                    19550000
SIV2V3SI22V3 DS 1CL4096  Area mapped by dsect SI22V3                    19600000
SIV2V3_LEN EQU *-SIV2V3                                                 19650000
.L0014   ANOP                                                           19700000
*                                                                       19750000
* ********************************************************************  19800000
* * SIV3 represents the information returned when V3CPC_VM           *  19850000
* * data is requested                                                *  19900000
* ********************************************************************  19950000
*                                                                       20000000
*                                                                       20050000
         AIF   ('&SIV3' EQ 'NO').L0017                                  20100000
         AIF   ('&DSECT' EQ 'YES').L0018                                20150000
         AIF   ('&SIV3' NE 'YES').L0017                                 20200000
SIV3     DS    0D                                                       20250000
         AGO   .L0019                                                   20300000
.L0018   ANOP                                                           20350000
SIV3     DSECT                                                          20400000
.L0019   ANOP                                                           20450000
SIV3SI00 DS    1CL0064   Area mapped by dsect SI00                      20500000
SIV3SI22V3 DS  1CL4096   Area mapped by dsect SI22V3                    20550000
SIV3_LEN EQU   *-SIV3                                                   20600000
.L0017   ANOP                                                           20650000
*                                                                       20700000
* ********************************************************************  20750000
* * SI11V1 represents the output for a V1 CPC when general CPC       *  20800000
* * information is requested                                         *  20850000
* ********************************************************************  20900000
*                                                                       20950000
*                                                                       21000000
         AIF   ('&SI11V1' EQ 'NO').L001A                                21050000
         AIF   ('&DSECT' EQ 'YES').L001B                                21100000
         AIF   ('&SI11V1' NE 'YES').L001A                               21150000
SI11V1   DS    0D                                                       21200000
         AGO   .L001C                                                   21250000
.L001B   ANOP                                                           21300000
SI11V1   DSECT                                                          21350000
.L001C   ANOP                                                           21400000
         DS    1CL0032   Reserved                                       21450000
SI11V1CPCMANUFACTURER DS 1CL0016 The 16-character (0-9 or uppercase    *21500000
                         A-Z) EBCDIC name of the manufacturer of the   *21550000
                         V1 CPC. The name is left-justified with       *21600000
                         trailing blank characters if necessary.        21650000
SI11V1CPCTYPE DS 1CL0004 The 4-character (0-9) EBCDIC type identifier  *21700000
                         of the V1 CPC.                                 21750000
         DS    1CL0012   Reserved                                       21800000
SI11V1CPCMODEL DS 1CL0016 The 16-character (0-9 or uppercase A-Z)      *21850000
                         EBCDIC model identifier of the V1 CPC. The    *21900000
                         identifier is left-justified with trailing    *21950000
                         blank characters if necessary.                 22000000
SI11V1CPCSEQUENCECODE DS 1CL0016 The 16-character (0-9 or uppercase    *22050000
                         A-Z) EBCDIC sequence code of the V1 CPC. The  *22100000
                         sequence code is right-justified with leading *22150000
                         EBCDIC zeroes if necessary.                    22200000
SI11V1CPCPLANTOFMANUFACTURE DS 1CL0004 The 4-character (0-9 or         *22250000
                         uppercase A-Z) EBCDIC plant code that         *22300000
                         identifies the plant of manufacture for the   *22350000
                         V1 CPC. The plant code is left-justified with *22400000
                         trailing blank characters if necessary.        22450000
         DS    1CL3996   Reserved                                       22500000
SI11V1_LEN EQU *-SI11V1                                                 22550000
.L001A   ANOP                                                           22600000
*                                                                       22650000
* ********************************************************************  22700000
* * SI22V1 represents the output for a V1 CPC when information       *  22750000
* * is requested about the set of CPUs                               *  22800000
* ********************************************************************  22850000
*                                                                       22900000
*                                                                       22950000
         AIF   ('&SI22V1' EQ 'NO').L001D                                23000000
         AIF   ('&DSECT' EQ 'YES').L001E                                23050000
         AIF   ('&SI22V1' NE 'YES').L001D                               23100000
SI22V1   DS    0D                                                       23150000
         AGO   .L001F                                                   23200000
.L001E   ANOP                                                           23250000
SI22V1   DSECT                                                          23300000
.L001F   ANOP                                                           23350000
         DS    1CL0032   Reserved                                       23400000
SI22V1CPUCAPABILITY DS 1CL0004 An unsigned binary integer that         *23450000
                         specifies the capability of one of the CPUs   *23500000
                         contained in the V1 CPC. It is used as an     *23550000
                         indication of the capability of the CPU       *23600000
                         relative to the capability of other CPU       *23650000
                         models.                                        23700000
SI22V1TOTALCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that      *23750000
                         specifies the total number of CPUs contained  *23800000
                         in the V1 CPC. This number includes all CPUs  *23850000
                         in the configured state, the standby state,   *23900000
                         and the reserved state.                        23950000
SI22V1CONFIGUREDCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that *24000000
                         specifies the total number of CPUs that are   *24050000
                         in the configured state. A CPU is in the      *24100000
                         configured state when it is described in the  *24150000
                         V1-CPC configuration definition and is        *24200000
                         available to be used to execute programs.      24250000
SI22V1STANDBYCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that    *24300000
                         specifies the total number of CPUs that are   *24350000
                         in the standby state. A CPU is in the standby *24400000
                         state when it is described in the V1-CPC      *24450000
                         configuration definition, is not available to *24500000
                         be used to execute programs, but can be used  *24550000
                         to execute programs by issuing instructions   *24600000
                         to place it in the configured state.           24650000
SI22V1RESERVEDCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that   *24700000
                         specifies the total number of CPUs that are   *24750000
                         in the reserved state. A CPU is in the        *24800000
                         reserved state when it is described in the    *24850000
                         V1-CPC configuration definition, is not       *24900000
                         available to be used to execute programs, and *24950000
                         cannot be made available to be used to        *25000000
                         execute programs by issuing instructions to   *25050000
                         place it in the configured state, but it may  *25100000
                         be possible to place it in the standby or      25150000
*                        configured state through manually initiated   *25200000
                         actions                                        25250000
SI22V1MPCPUCAPABILITYAFS DS 1CL4052 A series of contiguous 2-byte      *25300000
                         fields, each containing a 2-byte unsigned     *25350000
                         binary integer which is an adjustment factor  *25400000
                         (percentage) for the value contained in the   *25450000
                         CPU-capability field. The number of           *25500000
                         adjustment-factor fields is one less than the *25550000
                         number of CPUs specified in the               *25600000
                         total-CPU-count field. The adjustment-factor  *25650000
                         fields correspond to CPCs with increasing     *25700000
                         numbers of CPUs. The first adjustment-factor   25750000
*                        field corresponds to a V1 CPC with two CPUs.  *25800000
                         Each successive adjustment-factor field       *25850000
                         corresponds to a V1 CPC with a number of CPUs *25900000
                         that is one greater than that of the          *25950000
                         preceding entry.                               26000000
         ORG   SI22V1MPCPUCAPABILITYAFS                                 26050000
SI22V1MPCPUCAPABILITYAF DS 1CL0002 Each individual adjustment factor.   26100000
         ORG   SI22V1MPCPUCAPABILITYAFS+X'00000FD4'                     26150000
SI22V1_LEN EQU *-SI22V1                                                 26200000
.L001D   ANOP                                                           26250000
*                                                                       26300000
* ********************************************************************  26350000
* * SI22V2 represents the output for a V2 CPC when information       *  26400000
* * is requested about the set of CPUs                               *  26450000
* ********************************************************************  26500000
*                                                                       26550000
*                                                                       26600000
         AIF   ('&SI22V2' EQ 'NO').L0020                                26650000
         AIF   ('&DSECT' EQ 'YES').L0021                                26700000
         AIF   ('&SI22V2' NE 'YES').L0020                               26750000
SI22V2   DS    0D                                                       26800000
         AGO   .L0022                                                   26850000
.L0021   ANOP                                                           26900000
SI22V2   DSECT                                                          26950000
.L0022   ANOP                                                           27000000
         DS    1CL0032   Reserved                                       27050000
SI22V2CPCNUMBER DS 1BL2  A 2-byte unsigned binary integer which is the *27100000
                         number of this V2 CPC. This number            *27150000
                         distinguishes this V2 CPC from all other V2   *27200000
                         CPCs provided by the same logical-partition   *27250000
                         hypervisor                                     27300000
         DS    1CL0001   Reserved                                       27350000
SI22V2LCPUCHARACTERISTICS DS 1CL0001 The characteristics of the        *27400000
                         logical CPUs that are provided for this V2    *27450000
                         CPC                                            27500000
         ORG   SI22V2LCPUCHARACTERISTICS                                27550000
SI22V2LCPUDEDICATED EQU X'80' When one, indicates that one or more of  *27600000
                         the logical CPUs for this V2 CPC are provided *27650000
                         using V1 CPUs that are dedicated to this V2   *27700000
                         CPC and are not used to provide logical CPUs  *27750000
                         for any other V2 CPCs. The number of logical  *27800000
                         CPUs that are provided using dedicated V1     *27850000
                         CPUs is specified by the dedicated-LCPU-count *27900000
                         value. When zero, bit 0 indicates that none   *27950000
                         of the logical CPUs for this V2 CPC are       *28000000
                         provided using V1 CPUs that are dedicated to   28050000
*                        this V2 CPC.                                   28100000
SI22V2LCPUSHARED EQU X'40' When one, indicates that one or more of the *28150000
                         logical CPUs for this V2 CPC are provided     *28200000
                         using V1 CPUs that can be used to provide     *28250000
                         logical CPUs for other V2 CPCs. The number of *28300000
                         logical CPUs that are provided using shared   *28350000
                         V1 CPUs is specified by the shared-LCPU-count *28400000
                         value. When zero, it indicates that none of   *28450000
                         the logical CPUs for this V2 CPC are provided *28500000
                         using shared V1 CPUs.                          28550000
SI22V2LCPUULIMIT EQU X'20' Utilization limit: When one, indicates that *28600000
                         the amount of use of the V1-CPC CPUs that are *28650000
                         used to provide the logical CPUs for this V2  *28700000
                         CPC is limited. When zero, it indicates that  *28750000
                         the amount of use of the V1-CPC CPUs that are *28800000
                         used to provide the logical CPUs for this V2  *28850000
                         CPC is unlimited.                              28900000
         ORG   SI22V2LCPUCHARACTERISTICS+X'00000001'                    28950000
SI22V2TOTALLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that     *29000000
                         specifies the total number of logical CPUs    *29050000
                         that are provided for this V2 CPC. This       *29100000
                         number includes all of the logical CPUs that  *29150000
                         are in the configured state, the standby      *29200000
                         state, and the reserved state.                 29250000
SI22V2CONFIGUREDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer     *29300000
                         that specifies the total number of logical    *29350000
                         CPUs for this V2 CPC that are in the          *29400000
                         configured state. A logical CPU is in the     *29450000
                         configured state when it is described in the  *29500000
                         V2-CPC configuration definition and is        *29550000
                         available to be used to execute programs.      29600000
SI22V2STANDBYLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that   *29650000
                         specifies the total number of logical CPUs    *29700000
                         that are in the standby state. A logical CPU  *29750000
                         is in the standby state when it is described  *29800000
                         in the V2-CPC configuration definition, is    *29850000
                         not available to be used to execute programs, *29900000
                         but can be used to execute programs by        *29950000
                         issuing instructions to place it in the       *30000000
                         configured state.                              30050000
SI22V2RESERVEDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that  *30100000
                         specifies the total number of logical CPUs    *30150000
                         that are in the reserved state. A logical CPU *30200000
                         is in the reserved state when it is described *30250000
                         in the V2-CPC configuration definition, is    *30300000
                         not available to be used to execute programs, *30350000
                         and cannot be made available to be used to    *30400000
                         execute programs by issuing instructions to   *30450000
                         place it in the configured state, but it may  *30500000
                         be possible to place it in the standby or      30550000
*                        configured state through manually initiated   *30600000
                         actions                                        30650000
SI22V2CPCNAME DS 1CL0008 The 8-character EBCDIC name of this V2 CPC.   *30700000
                         The name is left-justified with trailing      *30750000
                         blank characters if necessary.                 30800000
SI22V2CPCCAPABILITYAF DS 1CL0004 Capability Adjustment Factor (CAF).   *30850000
                         An unsigned binary integer of 1000 or less.   *30900000
                         The adjustment factor specifies the amount of *30950000
                         the V1-CPC capability that is allowed to be   *31000000
                         used for this V2 CPC by the logical-partition *31050000
                         hypervisor. The fraction of V1-CPC capability *31100000
                         is determined by dividing the CAF value by    *31150000
                         1000.                                          31200000
         DS    1CL0016   Reserved                                       31250000
SI22V2DEDICATEDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that *31300000
                         specifies the number of configured-state      *31350000
                         logical CPUs for this V2 CPC that are         *31400000
                         provided using dedicated V1 CPUs. (See the    *31450000
                         description of bit SI22V2LCPUDedicated.)       31500000
SI22V2SHAREDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that    *31550000
                         specifies the number of configured-state      *31600000
                         logical CPUs for this V2 CPC that are         *31650000
                         provided using shared V1 CPUs. (See the       *31700000
                         description of bit SI22V2LCPUShared.)          31750000
         DS    1CL4020   Reserved                                       31800000
SI22V2_LEN EQU *-SI22V2                                                 31850000
.L0020   ANOP                                                           31900000
*                                                                       31950000
* ********************************************************************  32000000
* * SI22V3 represents the output for a V3 CPC when information       *  32050000
* * is requested about the set of CPUs                               *  32100000
* ********************************************************************  32150000
*                                                                       32200000
*                                                                       32250000
         AIF   ('&SI22V3' EQ 'NO').L0023                                32300000
         AIF   ('&DSECT' EQ 'YES').L0024                                32350000
         AIF   ('&SI22V3' NE 'YES').L0023                               32400000
SI22V3   DS    0D                                                       32450000
         AGO   .L0025                                                   32500000
.L0024   ANOP                                                           32550000
SI22V3   DSECT                                                          32600000
.L0025   ANOP                                                           32650000
         DS    1CL0028   Reserved                                       32700000
         DS    1CL0003   Reserved                                       32750000
SI22V3DBCOUNTFIELD DS 1BL1                                              32800000
         ORG   SI22V3DBCOUNTFIELD                                       32850000
SI22V3DBCOUNT EQU X'0F'  Description Block Count. A 4-bit unsigned     *32900000
                         binary integer that indicates the number (up  *32950000
                         to 8) of V3-CPC description blocks that are   *33000000
                         stored in the SI22V3DBs field.                 33050000
         ORG   SI22V3DBCOUNTFIELD+X'00000001'                           33100000
SI22V3DBS DS   1CL0512   From 1 to 8 64-byte V3-CPC description        *33150000
                         blocks, depending on the number of nested V3  *33200000
                         CPCs (if any) and their processing            *33250000
                         characteristics.                               33300000
         ORG   SI22V3DBS                                                33350000
SI22V3DBE DS   1CL0064   An individual entry, mapped by dsect SI22V3DB  33400000
         ORG   SI22V3DBS+X'00000200'                                    33450000
         DS    1CL3552   Reserved                                       33500000
SI22V3_LEN EQU *-SI22V3                                                 33550000
.L0023   ANOP                                                           33600000
*                                                                       33650000
* ********************************************************************  33700000
* * SI22V3DB is a description block that comprises part of the       *  33750000
* * SI22V3 data.                                                     *  33800000
* ********************************************************************  33850000
*                                                                       33900000
*                                                                       33950000
         AIF   ('&SI22V3DB' EQ 'NO').L0026                              34000000
         AIF   ('&DSECT' EQ 'YES').L0027                                34050000
         AIF   ('&SI22V3DB' NE 'YES').L0026                             34100000
SI22V3DB DS    0D        V3 CPC Description Block. When a V3 CPC is    *34150000
                         provided by a virtual-machine-hypervisor      *34200000
                         program and the hypervisor program is running *34250000
                         on a V3 CPC provided by another               *34300000
                         virtual-machine-hypervisor program, the V3    *34350000
                         CPCs are said to be "nested." V3 CPCs can be  *34400000
                         nested in this way for several layers. The    *34450000
                         collection of nested V3 CPCs that lie in the  *34500000
                         path between a program running on a V3 CPC    *34550000
                         and the actual machine is called a "V3-CPC     34600000
*                        stack." The V3 CPCs in a V3-CPC stack are     *34650000
                         consecutively numbered. The V3 CPC provided   *34700000
                         by a virtual-machine-hypervisor program       *34750000
                         running on a V2 CPC or a V1 CPC is the lowest *34800000
                         numbered (0) V3 CPC of the stack. The V3 CPC  *34850000
                         on which the issuing program is running is    *34900000
                         the highest numbered (N) V3 CPC of the stack. *34950000
                         If more than one V3-CPC description blocks    *35000000
                         are provided, they are stored according to    *35050000
                         the following rules: 1.The collection of V3    35100000
*                        CPCs described may be a contiguous subset of  *35150000
                         the total collection of V3 CPCs in the V3-CPC *35200000
                         stack. The subset always includes the highest *35250000
                         numbered V3 CPC of the V3-CPC stack. One or   *35300000
                         more V3 CPCs at the bottom of the V3-CPC      *35350000
                         stack may not be described because STSI is    *35400000
                         not provided at that level or the limit of 8  *35450000
                         description blocks would be exceeded. 2.The   *35500000
                         highest-numbered V3 CPC of the V3-CPC stack   *35550000
                         is always described by the first description   35600000
*                        block. The lowest-numbered V3 CPC of the      *35650000
                         V3-CPC stack (that is included in the subset  *35700000
                         that is described) is described by the last   *35750000
                         description block provided.                    35800000
         AGO   .L0028                                                   35850000
.L0027   ANOP                                                           35900000
SI22V3DB DSECT           V3 CPC Description Block. When a V3 CPC is    *35950000
                         provided by a virtual-machine-hypervisor      *36000000
                         program and the hypervisor program is running *36050000
                         on a V3 CPC provided by another               *36100000
                         virtual-machine-hypervisor program, the V3    *36150000
                         CPCs are said to be "nested." V3 CPCs can be  *36200000
                         nested in this way for several layers. The    *36250000
                         collection of nested V3 CPCs that lie in the  *36300000
                         path between a program running on a V3 CPC    *36350000
                         and the actual machine is called a "V3-CPC     36400000
*                        stack." The V3 CPCs in a V3-CPC stack are     *36450000
                         consecutively numbered. The V3 CPC provided   *36500000
                         by a virtual-machine-hypervisor program       *36550000
                         running on a V2 CPC or a V1 CPC is the lowest *36600000
                         numbered (0) V3 CPC of the stack. The V3 CPC  *36650000
                         on which the issuing program is running is    *36700000
                         the highest numbered (N) V3 CPC of the stack. *36750000
                         If more than one V3-CPC description blocks    *36800000
                         are provided, they are stored according to    *36850000
                         the following rules: 1.The collection of V3    36900000
*                        CPCs described may be a contiguous subset of  *36950000
                         the total collection of V3 CPCs in the V3-CPC *37000000
                         stack. The subset always includes the highest *37050000
                         numbered V3 CPC of the V3-CPC stack. One or   *37100000
                         more V3 CPCs at the bottom of the V3-CPC      *37150000
                         stack may not be described because STSI is    *37200000
                         not provided at that level or the limit of 8  *37250000
                         description blocks would be exceeded. 2.The   *37300000
                         highest-numbered V3 CPC of the V3-CPC stack   *37350000
                         is always described by the first description   37400000
*                        block. The lowest-numbered V3 CPC of the      *37450000
                         V3-CPC stack (that is included in the subset  *37500000
                         that is described) is described by the last   *37550000
                         description block provided.                    37600000
.L0028   ANOP                                                           37650000
         DS    1CL0004   Reserved                                       37700000
SI22V3DBTOTALLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that   *37750000
                         specifies the total number of logical CPUs    *37800000
                         that are provided for this V3 CPC. This       *37850000
                         number includes all of the logical CPUs that  *37900000
                         are in the configured state, the standby      *37950000
                         state, and the reserved state.                 38000000
SI22V3DBCONFIGUREDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer   *38050000
                         that specifies the number of logical CPUs for *38100000
                         this V3 CPC that are in the configured state. *38150000
                         A logical CPU is in the configured state when *38200000
                         it is described in the V3-CPC configuration   *38250000
                         definition and is available to be used to     *38300000
                         execute programs.                              38350000
SI22V3DBSTANDBYLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer that *38400000
                         specifies the number of logical CPUs for this *38450000
                         V3 CPC that are in the standby state. A       *38500000
                         logical CPU is in the standby state when it   *38550000
                         is described in the V3-CPC configuration      *38600000
                         definition, is not available to be used to    *38650000
                         execute programs, but can be used to execute  *38700000
                         programs by issuing instructions to place it  *38750000
                         in the configured state.                       38800000
SI22V3DBRESERVEDLCPUCOUNT DS 1BL2 A 2-byte unsigned binary integer     *38850000
                         that specifies the number of logical CPUs for *38900000
                         this V3 CPC that are in the reserved state. A *38950000
                         logical CPU is in the reserved state when it  *39000000
                         is described in the V2-CPC configuration      *39050000
                         definition, is not available to be used to    *39100000
                         execute programs, and cannot be made          *39150000
                         available to be used to execute programs by   *39200000
                         issuing instructions to place it in the       *39250000
                         configured state, but it may be possible to    39300000
*                        place it in the standby or configured state   *39350000
                         through manually initiated actions             39400000
SI22V3DBCPCNAME DS 1CL0008 The 8-character EBCDIC name of this V3 CPC. *39450000
                         The name is left-justified with trailing      *39500000
                         blank characters if necessary.                 39550000
SI22V3DBCPCCAF DS 1CL0004 A 4-byte unsigned binary integer that        *39600000
                         specifies an adjustment factor. The           *39650000
                         adjustment factor specifies the amount of the *39700000
                         V1-CPC or V2-CPC capability that is allowed   *39750000
                         to be used for this V3 CPC by the             *39800000
                         virtual-machine-hypervisor program.            39850000
SI22V3DBVMHPIDENTIFIER DS 1CL0016 The 16-character EBCDIC identifier   *39900000
                         of the virtual-machine-hypervisor program     *39950000
                         that provides this V3 CPC. (This identifier   *40000000
                         may include qualifiers such as version number *40050000
                         and release level). The identifier is         *40100000
                         left-justified with trailing blank characters *40150000
                         if necessary.                                  40200000
         DS    1CL0024   Reserved                                       40250000
SI22V3DB_LEN EQU *-SI22V3DB                                             40300000
.L0026   ANOP                                                           40350000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 40400000
         AIF   ('&LIST' EQ 'YES').P4                                    40450000
.P3      ANOP                                                           40500000
         POP   PRINT                                                    40550000
.P4      ANOP                                                           40600000
.P_EXIT  ANOP                                                           40650000
         MEND                                                           40700000
**/ CSRSIIDF_2:;                                                        40750000
* %CSRSIIDF_INCLUDED = 'YES';                                           40800000
* %DCL ZCBPRINT CHAR EXT;                                               40850000
* %DEACTIVATE ZCBPRINT;                                                 40900000
* %DCL CSRSIIDF_LIST CHAR EXT;                                          40950000
* %DEACTIVATE CSRSIIDF_LIST;                                            41000000
* %IF CSRSIIDF_LIST ^= 'NO' &                                           41050000
*    ZCBPRINT ^= 'NO' %THEN                                             41100000
*   %GOTO CSRSIIDF_3;                                                   41150000
*   @LIST PUSH NOECHO;                                                  41200000
*   @LIST NOASSEMBLE NOECHO;                                            41250000
*   @LIST OFF C NOECHO;                                                 41300000
* %CSRSIIDF_3:;                                                         41350000
*/* Start of PL/X Source                                             */ 41400000
*                                                                       41450000
*/********************************************************************/ 41500000
*/* SI00 represents the "starter" information                        */ 41550000
*/********************************************************************/ 41600000
*DCL 1 SI00 CHAR(64) BDY(DWORD) TYPE /*                          @01A*/ 41650000
*    ,2 SI00CPCVariety FIXED(8) /* SI00CPCVariety_V1CPC_Machine,        41700000
*                                 SI00CPCVariety_V2CPC_LPAR, or         41750000
*                                 SI00CPCVariety_V3CPC_VM        @01A*/ 41800000
*    ,2 SI00ValidityFlags BIT(8)  /* Validity flags              @01A*/ 41850000
*      ,3 SI00ValidSI11V1 BIT(1) /* SI11V1 was requested and the        41900000
*                                 information returned is valid  @01A*/ 41950000
*      ,3 SI00ValidSI22V1 BIT(1) /* SI22V1 was requested and the        42000000
*                                 information returned is valid  @01A*/ 42050000
*      ,3 SI00ValidSI22V2 BIT(1) /* SI22V2 was requested and the        42100000
*                                 information returned is valid  @01A*/ 42150000
*      ,3 SI00ValidSI22V3 BIT(1) /* SI22V3 was requested and the        42200000
*                                 information returned is valid  @01A*/ 42250000
*      ,3 * BIT(4)             /* Reserved                       @01A*/ 42300000
*    ,2 * CHAR(2)              /* Reserved                       @01A*/ 42350000
*    ,2 SI00PCCACPID CHAR(12)  /* PCCACPID value for this CPU    @01A*/ 42400000
*    ,2 SI00PCCACPUA CHAR(2)   /* PCCACPUA value for this CPU    @01A*/ 42450000
*    ,2 SI00PCCACAFM CHAR(2)   /* PCCACAFM value for this CPU    @01A*/ 42500000
*    ,2 * CHAR(4)              /* Reserved                       @01A*/ 42550000
*    ,2 SI00LastUpdateTimestamp CHAR(8)  /* Time of last STSI update,   42600000
*                                 via STCK                       @01A*/ 42650000
*    ,2 * CHAR(32)             /* Reserved                       @01A*/ 42700000
*    ,2 * CHAR(0) BDY(DWORD)   /* Reserved                       @01A*/ 42750000
*    ;                         /* Reserved                       @01A*/ 42800000
*                                                                       42850000
*/********************************************************************/ 42900000
*/* SI00 Constants                                                   */ 42950000
*/********************************************************************/ 43000000
*                                                                       43050000
*DCL SI00CPCVariety_V1CPC_Machine  FIXED(31) CONSTANT(1);  /* Value     43100000
*                 for a V1 CPC (not LPAR, not VM)                @01A*/ 43150000
*DCL SI00CPCVariety_V2CPC_LPAR     FIXED(31) CONSTANT(2);  /* Value     43200000
*                 for a V2 CPC (LPAR)                            @01A*/ 43250000
*DCL SI00CPCVariety_V3CPC_VM       FIXED(31) CONSTANT(3);  /* Value     43300000
*                 for a V3 CPC (VM)                              @01A*/ 43350000
*                                                                       43400000
*/********************************************************************  43450000
* *      Constants for Parameters and Return Codes                   *  43500000
* ********************************************************************/ 43550000
*                                                                       43600000
*/* Store System Information Constants                               */ 43650000
*                                                                       43700000
*DCL CSRSI_Request_V1CPC_Machine   FIXED(31) CONSTANT(1);  /* Requests  43750000
*                 information about a V1 CPC (not LPAR, not VM)  @01A*/ 43800000
*DCL CSRSI_Request_V2CPC_LPAR      FIXED(31) CONSTANT(2);  /* Requests  43850000
*                 information about a V2 CPC (LPAR)              @01A*/ 43900000
*DCL CSRSI_Request_V3CPC_VM        FIXED(31) CONSTANT(4);  /* Requests  43950000
*                 information about a V3 CPC (VM)                @01A*/ 44000000
*                                                                       44050000
*/* Store System Information Return Codes                            */ 44100000
*/* Note: 0C4 abend if bad address provided in parmlist or user data */ 44150000
*                                                                       44200000
*DCL CSRSI_Success                 FIXED(31) CONSTANT(0);  /*           44250000
*                 CSRSI service completed successfully           @01A*/ 44300000
*                                                                       44350000
*DCL CSRSI_STSINotAvailable        FIXED(31) CONSTANT(4);  /*           44400000
*                 STSI instruction is not available on this system.     44450000
*                 Only the SI00PCCACPID, SI00PCCACPUA, SI00PCCACAFM     44500000
*                 fields are valid.                                     44550000
*                                                                @01A*/ 44600000
*                                                                       44650000
*DCL CSRSI_ServiceNotAvailable     FIXED(31) CONSTANT(8);  /*           44700000
*                 CSRSI service is not available on this system.        44750000
*                                                                @01A*/ 44800000
*                                                                       44850000
*DCL CSRSI_BadRequest              FIXED(31) CONSTANT(12); /* The       44900000
*                 request parameter did not specify a word with a       44950000
*                 value formed from adding any combination of           45000000
*                 CSRSI_Request_V1CPC_Machine,                          45050000
*                 CSRSI_Request_V2CPC_LPAR, and                         45100000
*                 CSRSI_Request_V3CPC_VM.                        @01A*/ 45150000
*DCL CSRSI_BadInfoAreaLen          FIXED(31) CONSTANT(16); /* The       45200000
*                 value of the InfoAreaLen parameter does not match     45250000
*                 the length needed to accomodate the requested data.   45300000
*                                                                @01A*/ 45350000
*DCL CSRSI_BadLock                 FIXED(31) CONSTANT(20);  /*          45400000
*                 Service was called holding a system lock              45450000
*                 other than CPU, LOCAL/CML, CMS                 @01A*/ 45500000
*                                                                       45550000
*/* Service Entry Declarations                                      */  45600000
*                                                                       45650000
*%DCL EHAMAPS CHAR EXTERNAL;             /*                      @01A*/ 45700000
*%IF INDEX(EHAMAPS,'XM@')=0 %THEN        /*                      @01A*/ 45750000
*   %EHAMAPS = EHAMAPS || 'XM@';         /*                      @01A*/ 45800000
*                                                                       45850000
*DCL CSRSIRequest Fixed(31) TYPE;        /*                      @01A*/ 45900000
*DCL CSRSIInfoAreaLen Fixed(31) TYPE;    /*                      @01A*/ 45950000
*DCL CSRSIInfoArea CHAR(*) TYPE;         /*                      @01A*/ 46000000
*DCL CSRSIReturnCode Fixed(31) TYPE;     /*                      @01A*/ 46050000
*                                                                       46100000
*DCL CSRSI ENTRY                                                        46150000
*     (Request:=Isa(CSRSIRequest) INPUT  ! Request type                 46200000
*     ,InfoAreaLen:=Isa(CSRSIInfoAreaLen) INPUT                         46250000
*     ,InfoArea:=Isa(CSRSIInfoArea) OUTPUT                              46300000
*     ,ReturnCode:=Isa(CSRSIReturnCode) OUTPUT) ! return code           46350000
*    OPTIONS(AMODE(31) ENV(PRIMARY))                                    46400000
*    BASED (((XM@CVT+0220x)->I031P+30x)->I031P)                         46450000
*    VALRG(*);                           /*                      @01A*/ 46500000
*                                                                       46550000
*/********************************************************************/ 46600000
*/* SIV1 represents the information returned when V1CPC_Machine      */ 46650000
*/* data is requested                                                */ 46700000
*/********************************************************************/ 46750000
*DCL 1 SIV1 TYPE               /*                                @01A*/ 46800000
*      ,3 SIV1SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       46850000
*                                 by dsect SI00                  @01A*/ 46900000
*      ,3 SIV1SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD)   /* Area mapped   46950000
*                                 by dsect SI11V1                @01A*/ 47000000
*      ,3 SIV1SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD)   /* Area mapped   47050000
*                                 by dsect SI22V1                @01A*/ 47100000
*      ;                                                                47150000
*                                                                       47200000
*/********************************************************************/ 47250000
*/* SIV1V2 represents the information returned when V1CPC_Machine    */ 47300000
*/* data and V2CPC_LPAR data is requested                            */ 47350000
*/********************************************************************/ 47400000
*DCL 1 SIV1V2 TYPE             /*                                @01A*/ 47450000
*      ,3 SIV1V2SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       47500000
*                                 by dsect SI00                  @01A*/ 47550000
*      ,3 SIV1V2SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped   47600000
*                                 by dsect SI11V1                @01A*/ 47650000
*      ,3 SIV1V2SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped   47700000
*                                 by dsect SI22V1                @01A*/ 47750000
*      ,3 SIV1V2SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped   47800000
*                                 by dsect SI22V2                @01A*/ 47850000
*      ;                                                                47900000
*                                                                       47950000
*/********************************************************************/ 48000000
*/* SIV1V2V3 represents the information returned when V1CPC_Machine  */ 48050000
*/* data, V2CPC_LPAR data and V3CPC_VM data is requested             */ 48100000
*/********************************************************************/ 48150000
*DCL 1 SIV1V2V3 TYPE           /*                                @01A*/ 48200000
*      ,3 SIV1V2V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped     48250000
*                                 by dsect SI00                  @01A*/ 48300000
*      ,3 SIV1V2V3SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped 48350000
*                                 by dsect SI11V1                @01A*/ 48400000
*      ,3 SIV1V2V3SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped 48450000
*                                 by dsect SI22V1                @01A*/ 48500000
*      ,3 SIV1V2V3SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped 48550000
*                                 by dsect SI22V2                @01A*/ 48600000
*      ,3 SIV1V2V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped 48650000
*                                 by dsect SI22V3                @01A*/ 48700000
*      ;                                                                48750000
*                                                                       48800000
*/********************************************************************/ 48850000
*/* SIV1V3 represents the information returned when V1CPC_Machine    */ 48900000
*/* data and V3CPC_VM data is requested                              */ 48950000
*/********************************************************************/ 49000000
*DCL 1 SIV1V3 TYPE             /*                                @01A*/ 49050000
*      ,3 SIV1V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       49100000
*                                 by dsect SI00                  @01A*/ 49150000
*      ,3 SIV1V3SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped   49200000
*                                 by dsect SI11V1                @01A*/ 49250000
*      ,3 SIV1V3SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped   49300000
*                                 by dsect SI22V1                @01A*/ 49350000
*      ,3 SIV1V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped   49400000
*                                 by dsect SI22V3                @01A*/ 49450000
*      ;                                                                49500000
*                                                                       49550000
*/********************************************************************/ 49600000
*/* SIV2 represents the information returned when V2CPC_LPAR         */ 49650000
*/* data is requested                                                */ 49700000
*/********************************************************************/ 49750000
*DCL 1 SIV2 TYPE               /*                                @01A*/ 49800000
*      ,3 SIV2SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       49850000
*                                 by dsect SI00                  @01A*/ 49900000
*      ,3 SIV2SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD)   /* Area mapped   49950000
*                                 by dsect SI22V2                @01A*/ 50000000
*      ;                                                                50050000
*                                                                       50100000
*/********************************************************************/ 50150000
*/* SIV2V3 represents the information returned when V2CPC_LPAR       */ 50200000
*/* and V3CPC_VM data is requested                                   */ 50250000
*/********************************************************************/ 50300000
*DCL 1 SIV2V3 TYPE             /*                                @01A*/ 50350000
*      ,3 SIV2V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       50400000
*                                 by dsect SI00                  @01A*/ 50450000
*      ,3 SIV2V3SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped   50500000
*                                 by dsect SI22V2                @01A*/ 50550000
*      ,3 SIV2V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped   50600000
*                                 by dsect SI22V3                @01A*/ 50650000
*      ;                                                                50700000
*                                                                       50750000
*/********************************************************************/ 50800000
*/* SIV3 represents the information returned when V3CPC_VM           */ 50850000
*/* data is requested                                                */ 50900000
*/********************************************************************/ 50950000
*DCL 1 SIV3 TYPE               /*                                @01A*/ 51000000
*      ,3 SIV3SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       51050000
*                                 by dsect SI00                  @01A*/ 51100000
*      ,3 SIV3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD)   /* Area mapped   51150000
*                                 by dsect SI22V3                @01A*/ 51200000
*      ;                                                                51250000
*                                                                       51300000
*/********************************************************************/ 51350000
*/* SI11V1 represents the output for a V1 CPC when general CPC       */ 51400000
*/* information is requested                                         */ 51450000
*/********************************************************************/ 51500000
*DCL 1 SI11V1 CHAR(4096) BDY(DWORD) TYPE  /*                     @01A*/ 51550000
*    ,2 * CHAR(8*4)            /* Reserved                       @01A*/ 51600000
*    ,2 SI11V1CPCManufacturer CHAR(16) /* The 16-character (0-9 or      51650000
*                                 uppercase A-Z) EBCDIC name of the     51700000
*                                 manufacturer of the V1 CPC. The name  51750000
*                                 is left-justified with trailing blank 51800000
*                                 characters if necessary.              51850000
*                                                                @01A*/ 51900000
*    ,2 SI11V1CPCType CHAR(4)          /* The 4-character (0-9)         51950000
*                                 EBCDIC type identifier of the V1      52000000
*                                 CPC.                                  52050000
*                                                                @01A*/ 52100000
*    ,2 * CHAR(3*4)            /* Reserved                       @01A*/ 52150000
*    ,2 SI11V1CPCModel CHAR(16)        /* The 16-character (0-9 or      52200000
*                                 uppercase A-Z) EBCDIC model           52250000
*                                 identifier of the V1 CPC. The         52300000
*                                 identifier is left-justified          52350000
*                                 with trailing blank characters        52400000
*                                 if necessary.                         52450000
*                                                                @01A*/ 52500000
*    ,2 SI11V1CPCSequenceCode CHAR(16) /* The 16-character (0-9 or      52550000
*                                 uppercase A-Z) EBCDIC sequence        52600000
*                                 code of the V1 CPC. The sequence      52650000
*                                 code is right-justified               52700000
*                                 with leading EBCDIC zeroes            52750000
*                                 if necessary.                         52800000
*                                                                @01A*/ 52850000
*    ,2 SI11V1CPCPlantOfManufacture CHAR(4) /* The 4-character (0-9 or  52900000
*                                 uppercase A-Z) EBCDIC plant code      52950000
*                                 that identifies the plant of          53000000
*                                 manufacture for the V1 CPC. The plant 53050000
*                                 code is left-justified with           53100000
*                                 trailing blank characters             53150000
*                                 if necessary.                         53200000
*                                                                @01A*/ 53250000
*    ,2 * CHAR(999*4)          /* Reserved                       @01A*/ 53300000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 53350000
*                                                                       53400000
*/********************************************************************/ 53450000
*/* SI22V1 represents the output for a V1 CPC when information       */ 53500000
*/* is requested about the set of CPUs                               */ 53550000
*/********************************************************************/ 53600000
*DCL 1 SI22V1 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 53650000
*    ,2 * CHAR(8*4)            /* Reserved                       @01A*/ 53700000
*    ,2 SI22V1CpuCapability CHAR(4)     /* An unsigned binary integer   53750000
*                                 that specifies the capability of one  53800000
*                                 of the CPUs contained in the V1 CPC.  53850000
*                                 It is used as an indication of the    53900000
*                                 capability of the CPU relative to     53950000
*                                 the capability of other CPU models.   54000000
*                                                                @01A*/ 54050000
*    ,2 SI22V1TotalCpuCount BIT(16)     /* A 2-byte unsigned binary     54100000
*                                 integer that specifies the total      54150000
*                                 number of CPUs contained in the V1    54200000
*                                 CPC. This number includes all CPUs    54250000
*                                 in the configured state, the standby  54300000
*                                 state, and the reserved state.        54350000
*                                                                @01A*/ 54400000
*    ,2 SI22V1ConfiguredCpuCount BIT(16) /* A 2-byte unsigned binary    54450000
*                                 integer that specifies the total      54500000
*                                 number of CPUs that are in the        54550000
*                                 configured state. A CPU is in the     54600000
*                                 configured state when it is           54650000
*                                 described in the V1-CPC configuration 54700000
*                                 definition and is available to be     54750000
*                                 used to execute programs.             54800000
*                                                                @01A*/ 54850000
*    ,2 SI22V1StandbyCpuCount BIT(16)   /* A 2-byte unsigned binary     54900000
*                                 integer that specifies the total      54950000
*                                 number of CPUs that are in the        55000000
*                                 standby state. A CPU is in the        55050000
*                                 standby state when it is described    55100000
*                                 in the V1-CPC configuration           55150000
*                                 definition, is not available to be    55200000
*                                 used to execute programs, but can     55250000
*                                 be used to execute programs by        55300000
*                                 issuing instructions to place it in   55350000
*                                 the configured state.                 55400000
*                                                                @01A*/ 55450000
*    ,2 SI22V1ReservedCpuCount BIT(16)   /* A 2-byte unsigned binary    55500000
*                                 integer that specifies the total      55550000
*                                 number of CPUs that are in the        55600000
*                                 reserved state. A CPU is in the       55650000
*                                 reserved state when it is described   55700000
*                                 in the V1-CPC configuration           55750000
*                                 definition, is not available to be    55800000
*                                 used to execute programs, and cannot  55850000
*                                 be made available to be used to       55900000
*                                 execute programs by issuing           55950000
*                                 instructions to place it in the       56000000
*                                 configured state, but it may be       56050000
*                                 possible to place it in the standby   56100000
*                                 or configured state through           56150000
*                                 manually initiated actions            56200000
*                                                                @01A*/ 56250000
*    ,2 SI22V1MpCpuCapabilityAFs CHAR(1013*4)  /*                       56300000
*                                 A series of contiguous 2-byte fields, 56350000
*                                 each containing a 2-byte unsigned     56400000
*                                 binary integer which is an adjustment 56450000
*                                 factor (percentage) for the value     56500000
*                                 contained in the CPU-capability       56550000
*                                 field.                                56600000
*                                 The number of adjustment-factor       56650000
*                                 fields is one less than the number    56700000
*                                 of CPUs specified in the              56750000
*                                 total-CPU-count field. The            56800000
*                                 adjustment-factor fields correspond   56850000
*                                 to CPCs with increasing numbers of    56900000
*                                 CPUs. The first adjustment-factor     56950000
*                                 field corresponds to a V1 CPC with    57000000
*                                 two CPUs. Each successive             57050000
*                                 adjustment-factor field corresponds   57100000
*                                 to a V1 CPC with a number of CPUs     57150000
*                                 that is one greater than that of      57200000
*                                 the preceding entry.                  57250000
*                                                                @01A*/ 57300000
*    ,3 SI22V1MpCpuCapabilityAF CHAR(2) /* Each individual              57350000
*                                 adjustment factor.                    57400000
*                                                                @01A*/ 57450000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 57500000
*                                                                       57550000
*/********************************************************************/ 57600000
*/* SI22V2 represents the output for a V2 CPC when information       */ 57650000
*/* is requested about the set of CPUs                               */ 57700000
*/********************************************************************/ 57750000
*DCL 1 SI22V2 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 57800000
*    ,2 * CHAR(8*4)            /* Reserved                       @01A*/ 57850000
*    ,2 SI22V2CpcNumber BIT(16)   /* A 2-byte unsigned binary integer   57900000
*                                 which is the number of this V2 CPC.   57950000
*                                 This number distinguishes this V2     58000000
*                                 CPC from all other V2 CPCs provided   58050000
*                                 by the same logical-partition         58100000
*                                 hypervisor                            58150000
*                                                                @01A*/ 58200000
*    ,2 * CHAR(1)              /* Reserved                       @01A*/ 58250000
*    ,2 SI22V2LCPUCharacteristics CHAR(1)  /* The characteristics of    58300000
*                                 the logical CPUs that are provided    58350000
*                                 for this V2 CPC                       58400000
*                                                                @01A*/ 58450000
*      ,3 SI22V2LCPUDedicated BIT(1)  /* When one, indicates that one   58500000
*                                 or more of the logical CPUs for this  58550000
*                                 V2 CPC are provided using V1 CPUs     58600000
*                                 that are dedicated to this V2 CPC     58650000
*                                 and are not used to provide logical   58700000
*                                 CPUs for any other V2 CPCs. The       58750000
*                                 number of logical CPUs that are       58800000
*                                 provided using dedicated V1 CPUs is   58850000
*                                 specified by the dedicated-LCPU-count 58900000
*                                 value.                                58950000
*                                 When zero, bit 0 indicates that none  59000000
*                                 of the logical CPUs for this V2 CPC   59050000
*                                 are provided using V1 CPUs that are   59100000
*                                 dedicated to this V2 CPC.             59150000
*                                                                @01A*/ 59200000
*      ,3 SI22V2LCPUShared BIT(1)  /* When one, indicates that one      59250000
*                                 or more of the logical CPUs for this  59300000
*                                 V2 CPC are provided using V1 CPUs     59350000
*                                 that can be used to provide logical   59400000
*                                 CPUs for other V2 CPCs. The           59450000
*                                 number of logical CPUs that are       59500000
*                                 provided using shared V1 CPUs is      59550000
*                                 specified by the shared-LCPU-count    59600000
*                                 value.                                59650000
*                                 When zero, it indicates that none     59700000
*                                 of the logical CPUs for this V2 CPC   59750000
*                                 are provided using shared V1 CPUs.    59800000
*                                                                @01A*/ 59850000
*      ,3 SI22V2LCPUULIMIT BIT(1)   /* Utilization limit: When one,     59900000
*                                 indicates that the amount of use      59950000
*                                 of the V1-CPC CPUs that are used to   60000000
*                                 provide the logical CPUs for this V2  60050000
*                                 CPC is limited.                       60100000
*                                 When zero, it indicates that the      60150000
*                                 amount of use of the V1-CPC CPUs that 60200000
*                                 are used to provide the logical       60250000
*                                 CPUs for this V2 CPC is unlimited.    60300000
*                                                                @01A*/ 60350000
*      ,3 * BIT(5)                  /* Reserved                  @01A*/ 60400000
*    ,2 SI22V2TotalLCPUCount BIT(16)    /* A 2-byte unsigned binary     60450000
*                                 integer that specifies the total      60500000
*                                 number of logical CPUs that are       60550000
*                                 provided for this V2 CPC. This number 60600000
*                                 includes all of the logical CPUs that 60650000
*                                 are in the configured state, the      60700000
*                                 standby state, and the reserved       60750000
*                                 state.                                60800000
*                                                                @01A*/ 60850000
*    ,2 SI22V2ConfiguredLCPUCount BIT(16) /* A 2-byte unsigned binary   60900000
*                                 integer that specifies the total      60950000
*                                 number of logical CPUs for this V2    61000000
*                                 CPC that are in the configured        61050000
*                                 state. A logical CPU is in the        61100000
*                                 configured state when it is           61150000
*                                 described in the V2-CPC configuration 61200000
*                                 definition and is available to be     61250000
*                                 used to execute programs.             61300000
*                                                                @01A*/ 61350000
*    ,2 SI22V2StandbyLCPUCount BIT(16)  /* A 2-byte unsigned binary     61400000
*                                 integer that specifies the total      61450000
*                                 number of logical CPUs that are in    61500000
*                                 the standby state. A logical CPU is   61550000
*                                 in the standby state when it is       61600000
*                                 described in the V2-CPC configuration 61650000
*                                 definition, is not available to be    61700000
*                                 used to execute programs, but can     61750000
*                                 be used to execute programs by        61800000
*                                 issuing instructions to place it in   61850000
*                                 the configured state.                 61900000
*                                                                @01A*/ 61950000
*    ,2 SI22V2ReservedLCPUCount BIT(16)  /* A 2-byte unsigned binary    62000000
*                                 integer that specifies the total      62050000
*                                 number of logical CPUs that are in    62100000
*                                 the reserved state.                   62150000
*                                 A logical CPU is in the               62200000
*                                 reserved state when it is described   62250000
*                                 in the V2-CPC configuration           62300000
*                                 definition, is not available to be    62350000
*                                 used to execute programs, and cannot  62400000
*                                 be made available to be used to       62450000
*                                 execute programs by issuing           62500000
*                                 instructions to place it in the       62550000
*                                 configured state, but it may be       62600000
*                                 possible to place it in the standby   62650000
*                                 or configured state through           62700000
*                                 manually initiated actions            62750000
*                                                                @01A*/ 62800000
*    ,2 SI22V2CPCName CHAR(8)     /* The 8-character EBCDIC name        62850000
*                                 of this V2 CPC. The name is           62900000
*                                 left-justified with trailing blank    62950000
*                                 characters if necessary.              63000000
*                                                                @01A*/ 63050000
*    ,2 SI22V2CPCCapabilityAF CHAR(4)   /* Capability Adjustment Factor 63100000
*                                 (CAF). An unsigned binary integer of  63150000
*                                 1000 or less. The adjustment factor   63200000
*                                 specifies the amount of the V1-CPC    63250000
*                                 capability that is allowed to be used 63300000
*                                 for this V2 CPC by the                63350000
*                                 logical-partition hypervisor. The     63400000
*                                 fraction of V1-CPC capability is      63450000
*                                 determined by dividing the CAF        63500000
*                                 value by 1000.                        63550000
*                                                                @01A*/ 63600000
*    ,2 * CHAR(4*4)            /* Reserved                       @01A*/ 63650000
*    ,2 SI22V2DedicatedLCPUCount BIT(16)  /* A 2-byte unsigned binary   63700000
*                                 integer that specifies the number of  63750000
*                                 configured-state logical CPUs for     63800000
*                                 this V2 CPC that are provided using   63850000
*                                 dedicated V1 CPUs. (See the           63900000
*                                 description of bit                    63950000
*                                 SI22V2LCPUDedicated.)                 64000000
*                                                                @01A*/ 64050000
*    ,2 SI22V2SharedLCPUCount BIT(16)  /* A 2-byte unsigned binary      64100000
*                                 integer that specifies the number of  64150000
*                                 configured-state logical CPUs for     64200000
*                                 this V2 CPC that are provided using   64250000
*                                 shared V1 CPUs. (See the              64300000
*                                 description of bit                    64350000
*                                 SI22V2LCPUShared.)                    64400000
*                                                                @01A*/ 64450000
*    ,2 * CHAR(1005*4)         /* Reserved                       @01A*/ 64500000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 64550000
*                                                                       64600000
*/********************************************************************/ 64650000
*/* SI22V3 represents the output for a V3 CPC when information       */ 64700000
*/* is requested about the set of CPUs                               */ 64750000
*/********************************************************************/ 64800000
*DCL 1 SI22V3 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 64850000
*    ,2 * CHAR(7*4)            /* Reserved                       @01A*/ 64900000
*    ,2 * CHAR(3)              /* Reserved                       @01A*/ 64950000
*    ,2 SI22V3DBCountField BIT(8)            /*                  @01A*/ 65000000
*      ,3 * BIT(4)             /* Reserved                       @01A*/ 65050000
*      ,3 SI22V3DBCount BIT(4) /* Description Block Count.              65100000
*                                 A 4-bit unsigned binary integer that  65150000
*                                 indicates the number (up to 8) of     65200000
*                                 V3-CPC description blocks that        65250000
*                                 are stored in the SI22V3DBs field.    65300000
*                                                                @01A*/ 65350000
*    ,2 SI22V3DBs Char(8*64)   /* From 1 to 8 64-byte V3-CPC            65400000
*                                 description blocks, depending         65450000
*                                 on the number of nested V3 CPCs (if   65500000
*                                 any) and their processing             65550000
*                                 characteristics.                      65600000
*                                                                @01A*/ 65650000
*      ,3 SI22V3DBE CHAR(64)    /* An individual entry, mapped by       65700000
*                                 dsect SI22V3DB                        65750000
*                                                                @01A*/ 65800000
*    ,2 * CHAR((1024-136)*4)   /* Reserved                       @01A*/ 65850000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 65900000
*                                                                       65950000
*                                                                       66000000
*/********************************************************************/ 66050000
*/* SI22V3DB is a description block that comprises part of the       */ 66100000
*/* SI22V3 data.                                                     */ 66150000
*/********************************************************************/ 66200000
*DCL 1 SI22V3DB CHAR(64) BDY(DWORD) TYPE /* V3 CPC Description Block.   66250000
*                                 When a V3 CPC is provided by a        66300000
*                                 virtual-machine-hypervisor program    66350000
*                                 and the hypervisor program is running 66400000
*                                 on a V3 CPC provided by another       66450000
*                                 virtual-machine-hypervisor program,   66500000
*                                 the V3 CPCs are said to be "nested."  66550000
*                                 V3 CPCs can be nested in this way     66600000
*                                 for several layers.                   66650000
*                                 The collection of nested V3 CPCs that 66700000
*                                 lie in the path between a program     66750000
*                                 running on a V3 CPC and the actual    66800000
*                                 machine is called a "V3-CPC stack."   66850000
*                                 The V3 CPCs in a V3-CPC stack are     66900000
*                                 consecutively numbered. The V3 CPC    66950000
*                                 provided by a                         67000000
*                                 virtual-machine-hypervisor program    67050000
*                                 running on a V2 CPC or a V1 CPC is    67100000
*                                 the lowest numbered (0) V3 CPC of     67150000
*                                 the stack. The V3 CPC on which the    67200000
*                                 issuing program is running is the     67250000
*                                 highest numbered (N) V3 CPC of the    67300000
*                                 stack.                                67350000
*                                 If more than one V3-CPC description   67400000
*                                 blocks are provided, they are stored  67450000
*                                 according to the following rules:     67500000
*                                 1.The collection of V3 CPCs described 67550000
*                                   may be a contiguous subset of the   67600000
*                                   total collection of V3 CPCs in      67650000
*                                   the V3-CPC stack. The subset always 67700000
*                                   includes the highest numbered V3    67750000
*                                   CPC of the V3-CPC stack. One or     67800000
*                                   more V3 CPCs at the bottom of the   67850000
*                                   V3-CPC stack may not be described   67900000
*                                   because STSI is not provided at     67950000
*                                   that level or the limit of 8        68000000
*                                   description blocks would be         68050000
*                                   exceeded.                           68100000
*                                 2.The highest-numbered V3 CPC of the  68150000
*                                   V3-CPC stack is always described    68200000
*                                   by the first description block.     68250000
*                                   The lowest-numbered V3 CPC of the   68300000
*                                   V3-CPC stack (that is included in   68350000
*                                   the subset that is described) is    68400000
*                                   described by the last description   68450000
*                                   block provided.                     68500000
*                                                                @01A*/ 68550000
*    ,2 * CHAR(1*4)            /* Reserved                       @01A*/ 68600000
*    ,2 SI22V3DBTotalLCPUCount BIT(16)    /* A 2-byte unsigned binary   68650000
*                                 integer that specifies the total      68700000
*                                 number of logical CPUs that are       68750000
*                                 provided for this V3 CPC. This number 68800000
*                                 includes all of the logical CPUs that 68850000
*                                 are in the configured state, the      68900000
*                                 standby state, and the reserved       68950000
*                                 state.                                69000000
*                                                                @01A*/ 69050000
*    ,2 SI22V3DBConfiguredLCPUCount BIT(16)   /* A 2-byte unsigned      69100000
*                                 binary integer that specifies the     69150000
*                                 number of logical CPUs for this V3    69200000
*                                 CPC that are in the configured        69250000
*                                 state. A logical CPU is in the        69300000
*                                 configured state when it is           69350000
*                                 described in the V3-CPC configuration 69400000
*                                 definition and is available to be     69450000
*                                 used to execute programs.             69500000
*                                                                @01A*/ 69550000
*    ,2 SI22V3DBStandbyLCPUCount BIT(16)    /* A 2-byte unsigned binary 69600000
*                                 integer that specifies the            69650000
*                                 number of logical CPUs for this V3    69700000
*                                 CPC that are in the standby state.    69750000
*                                 A logical CPU is in the               69800000
*                                 standby state when it is described    69850000
*                                 in the V3-CPC configuration           69900000
*                                 definition, is not available to be    69950000
*                                 used to execute programs, but can     70000000
*                                 be used to execute programs by        70050000
*                                 issuing instructions to place it in   70100000
*                                 the configured state.                 70150000
*                                                                @01A*/ 70200000
*    ,2 SI22V3DBReservedLCPUCount BIT(16)    /* A 2-byte unsigned       70250000
*                                 binary integer that specifies the     70300000
*                                 number of logical CPUs for this V3    70350000
*                                 CPC that are in the reserved state.   70400000
*                                 A logical CPU is in the               70450000
*                                 reserved state when it is described   70500000
*                                 in the V2-CPC configuration           70550000
*                                 definition, is not available to be    70600000
*                                 used to execute programs, and cannot  70650000
*                                 be made available to be used to       70700000
*                                 execute programs by issuing           70750000
*                                 instructions to place it in the       70800000
*                                 configured state, but it may be       70850000
*                                 possible to place it in the standby   70900000
*                                 or configured state through           70950000
*                                 manually initiated actions            71000000
*                                                                @01A*/ 71050000
*    ,2 SI22V3DBCPCName CHAR(8)    /* The 8-character EBCDIC name       71100000
*                                 of this V3 CPC. The name is           71150000
*                                 left-justified with trailing blank    71200000
*                                 characters if necessary.              71250000
*                                                                @01A*/ 71300000
*    ,2 SI22V3DBCPCCAF CHAR(4)     /* A 4-byte unsigned binary          71350000
*                                 integer that specifies an adjustment  71400000
*                                 factor. The adjustment factor         71450000
*                                 specifies the amount of the V1-CPC    71500000
*                                 or V2-CPC capability that is allowed  71550000
*                                 to be used for this V3 CPC by the     71600000
*                                 virtual-machine-hypervisor program.   71650000
*                                                                @01A*/ 71700000
*    ,2 SI22V3DBVMHPIdentifier CHAR(16)    /* The 16-character EBCDIC   71750000
*                                 identifier of the                     71800000
*                                 virtual-machine-hypervisor program    71850000
*                                 that provides this V3 CPC. (This      71900000
*                                 identifier may include qualifiers     71950000
*                                 such as version number and release    72000000
*                                 level). The identifier is             72050000
*                                 left-justified with trailing blank    72100000
*                                 characters if necessary.              72150000
*                                                                @01A*/ 72200000
*    ,2 * CHAR(6*4)            /* Reserved                       @01A*/ 72250000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 72300000
*                                                                       72350000
*                                                                       72400000
* @LOGIC;                                                               72450000
* #PRAGMA TOOL=CBGEN.                                                   72500000
* #USEORG.                                                              72550000
* #EPRAGMA.                                                             72600000
* @ENDLOGIC;                                                            72650000
*/* End of PL/X Source                                               */ 72700000
* %IF CSRSIIDF_LIST ^= 'NO' &                                           72750000
*    ZCBPRINT ^= 'NO' %THEN                                             72800000
*   %GOTO CSRSIIDF_4;                                                   72850000
*   @LIST POP NOECHO;                                                   72900000
* %CSRSIIDF_4:;                                                         72950000
* %END;                                                                 73000000
