*                                                                       00050000
* %DCL CSRYCMPD_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE CSRYCMPD_INCLUDED;                                        00150000
* %IF CSRYCMPD_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 92335. CBGEN compile date 92322         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSRYCMPD &DSECT=YES,&LIST=YES,&CMPSCDICT_CE=YES,              *00450000
               &CMPSCDICT_SD=COND,&CMPSCDICT_SDE=COND,                 *00500000
               &CMPSCDICT_UE=COND,&CMPSCDICT_PE=COND                    00550000
         GBLC  &CSRYCMPD_INCLUDED                                       00600000
         GBLC  &ZCBPRINT                                                00650000
&CSRYCMPD_INCLUDED SETC 'YES'                                           00700000
 TITLE   'CSRYCMPD  - Compression/Expansion dictionary mappings      '  00750000
**/ CSRYCMPD_1:;                                                        00800000
*/* START OF SPECIFICATIONS ******************************************* 00850000
*                                                                       00900000
***PROPRIETARY_STATEMENT********************************************    00950000
*01* PROPRIETARY STATEMENT=                                             01000000
*                                                                       01050000
*                                                                       01100000
* LICENSED MATERIALS - PROPERTY OF IBM                                  01150000
* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                           01200000
* 5655-068 (C) COPYRIGHT IBM CORP. 1992                                 01250000
* SEE COPYRIGHT INSTRUCTIONS                                            01300000
*                                                                       01350000
* STATUS= HBB4430                                                       01400000
*                                                                       01450000
***END_OF_PROPRIETARY_STATEMENT*************************************/   01500000
*/*                                                                     01550000
*                                                                       01600000
*01* DESCRIPTIVE NAME:  Compression/Expansion dictionary mappings       01650000
*02*  ACRONYM:  CMPSD                                                   01700000
*                                                                       01750000
*01* MACRO NAME:  CSRYCMPD                                              01800000
*                                                                       01850000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* DSECT NAME:                                                        02050000
*                CMPSCDICT_CE                                           02100000
*                CMPSCDICT_SD                                           02150000
*                CMPSCDICT_SDE                                          02200000
*                CMPSCDICT_UE                                           02250000
*                CMPSCDICT_PE                                           02300000
*                                                                       02350000
*01* COMPONENT:  Callable Services (SCCSR)                              02400000
*                                                                       02450000
*01* EYE-CATCHER:  NONE                                                 02500000
*                                                                       02550000
*01* STORAGE ATTRIBUTES:                                                02600000
*02*  SUBPOOL:  Caller-supplied                                         02650000
*02*  KEY:  Caller-supplied                                             02700000
*02*  RESIDENCY:  Caller-supplied                                       02750000
*                                                                       02800000
*01* SIZE:                                                              02850000
*                CMPSCDICT_CE  -- X'0008' bytes                         02900000
*                CMPSCDICT_SD  -- X'0008' bytes                         02950000
*                CMPSCDICT_SDE -- X'0008' bytes                         03000000
*                CMPSCDICT_UE  -- X'0008' bytes                         03050000
*                CMPSCDICT_PE  -- X'0008' bytes                         03100000
*                                                                       03150000
*01* CREATED BY:                                                        03200000
*     User of CSRCMPSC service. Address passed as a parameter within    03250000
*     CMPSC area provided via CBLOCK keyword of CSRCMPSC                03300000
*                                                                       03350000
*01* POINTED TO BY:                                                     03400000
*     Not applicable                                                    03450000
*                                                                       03500000
*01* SERIALIZATION:                                                     03550000
*     None required                                                     03600000
*                                                                       03650000
*01* FUNCTION:                                                          03700000
*02* Maps the compression and expansion dictionaries.                   03750000
*                                                                       03800000
*02* The compression and expansion dictionaries must both begin on      03850000
*    page boundaries. When compressing, the expansion dictionary        03900000
*    must immediately follow (be contiguous to) the compression         03950000
*    dictionary.                                                        04000000
*                                                                       04050000
*02* Each dictionary consists of 512, 1024, 2048, 4096, or 8192         04100000
*    8-byte entries. These are indicated by a value of 1, 2, 3,         04150000
*    4, or 5 in the CMPSC_SYMSIZE field which is part of the            04200000
*    parameter information passed to the CSRCMPSC service.              04250000
*                                                                       04300000
*02* The compression dictionary consists of child entries               04350000
*    (DSECT CMPSCDICT_CE), sibling descriptors (DSECT                   04400000
*    CMPSCDICT_SD), sibling descriptor extensions (DSECT                04450000
*    CMPSDICT_SDE). Note that the latter are physically                 04500000
*    resident within the expansion dictionary.                          04550000
*                                                                       04600000
*02* The expansion dictionary consists of unpreceded entries            04650000
*    (DSECT CMPSCDICT_UE) and preceded entries (DSECT                   04700000
*    CMPSDICT_PE).                                                      04750000
*                                                                       04800000
*01* METHOD OF ACCESS:                                                  04850000
*02*  ASM:                                                              04900000
*      CSRYCMPD                                                         04950000
*           DSECT=YES|NO  -- Request DSECT definition                   05000000
*           CMPSCDICT_CE=YES|NO -- Request CMPSCDICT_CE mapping         05050000
*           CMPSCDICT_SD=YES|NO|COND -- Request CMPSCDICT_SD mapping    05100000
*           CMPSCDICT_SDE=YES|NO|COND -- Request CMPSCDICT_SDE mapping  05150000
*           CMPSCDICT_UE=YES|NO|COND -- Request CMPSCDICT_UE mapping    05200000
*           CMPSCDICT_PE=YES|NO|COND -- Request CMPSCDICT_PE mapping    05250000
*     Default: DSECT=YES,CMPSCDICT_CE=YES,                              05300000
*                        CMPSCDICT_SD=COND,                             05350000
*                        CMPSCDICT_SDE=COND,                            05400000
*                        CMPSCDICT_UE=COND,                             05450000
*                        CMPSCDICT_PE=COND                              05500000
*              where COND indicates that the mapping is included if     05550000
*              DSECT=YES but not if DSECT=NO                            05600000
*02*  PL/AS:                                                            05650000
*      %INCLUDE SYSLIB(CSRYCMPD)                                        05700000
*                                                                       05750000
*01* DELETED BY:  Caller                                                05800000
*                                                                       05850000
*01* FREQUENCY:  Created for invoking CSRCMPSC                          05900000
*                                                                       05950000
*01* DEPENDENCIES:  None                                                06000000
*                                                                       06050000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     06100000
*                                                                       06150000
*01* CHANGE ACTIVITY:                                                   06200000
*   $T0=OY59584C ,HBB4430,920901,PD00XB: Dictionary format              06250000
*   $T1=OY59584  ,HBB4430,920901,PD00XB: Dictionary format              06300000
*   Caution: Fields CE_ChildEntryIndex, SD_ExSib, and                   06350000
*            PE_PrecEntIndex are defined by #REPLACE pragmas.           06400000
*                                                                       06450000
* END OF SPECIFICATIONS *********************************************/  06500000
*% /*                                                                   06550000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06600000
         AIF   ('&LIST' EQ 'YES').P2                                    06650000
.P1      ANOP                                                           06700000
         PUSH  PRINT                                                    06750000
         PRINT OFF                                                      06800000
.P2      ANOP                                                           06850000
         AIF   ('&CMPSCDICT_CE' EQ 'NO').L0002                          06900000
         AIF   ('&DSECT' EQ 'YES').L0003                                06950000
         AIF   ('&CMPSCDICT_CE' NE 'YES').L0002                         07000000
CMPSCDICT_CE DS 0X       Dictionary format for compression, Child      *07050000
                         character entry                                07100000
         AGO   .L0004                                                   07150000
.L0003   ANOP                                                           07200000
CMPSCDICT_CE DSECT ,     Dictionary format for compression, Child      *07250000
                         character entry                                07300000
.L0004   ANOP                                                           07350000
CMPSCDICT_CE_H1 DS 1BL1  First byte of header                           07400000
         ORG   CMPSCDICT_CE_H1                                          07450000
CMPSCDICT_CE_CHILDCT EQU X'E0' Child character count                    07500000
CMPSCDICT_CE_EXCHILD EQU X'1F' Examine child bits                       07550000
         ORG   CMPSCDICT_CE_H1+X'00000001'                              07600000
CMPSCDICT_CE_H23 DS 1BL2 Second/third bytes of header                   07650000
         ORG   CMPSCDICT_CE_H23                                         07700000
CMPSCDICT_CE_AECCT EQU X'E0' Additional extension count                 07750000
CMPSCDICT_CE_EXSIB EQU X'C0' Examine sibling bits                       07800000
CMPSCDICT_CE_ADDEXTCHAR EQU X'20' If on, add ext character              07850000
CMPSCDICT_CE_FIRSTCHILDINDEX_REPLACED DS 0X                             07900000
CMPSCDICT_CE_FIRSTCHILDINDEX EQU X'1FFF' This mask can be used to      *07950000
                         isolate the 13-bits of field                  *08000000
                         CMPSCDICT_CE_H23 that represent the           *08050000
                         index of the first child                       08100000
         ORG   CMPSCDICT_CE_FIRSTCHILDINDEX_REPLACED+X'00000001'        08150000
         ORG   CMPSCDICT_CE_H23+X'00000002'                             08200000
CMPSCDICT_CE_CHILDCHAR DS 1CL0005 Child character entries               08250000
CMPSCDICT_CE_CHILDCT_1 EQU B'00100000' Value of 1 for                  *08300000
                         CMPSCDICT_CE_CHILDCT within field             *08350000
                         CMPSCDICT_CE_H1                                08400000
CMPSCDICT_CE_AECCT_1 EQU B'00100000' Value of 1 for CMPSCDICT_CE_AECCT *08450000
                         within field CMPSCDICT_CE_H23                  08500000
CMPSCDICT_CE_LEN EQU *-CMPSCDICT_CE                                     08550000
.L0002   ANOP                                                           08600000
         AIF   ('&CMPSCDICT_SD' EQ 'NO').L0005                          08650000
         AIF   ('&DSECT' EQ 'YES').L0006                                08700000
         AIF   ('&CMPSCDICT_SD' NE 'YES').L0005                         08750000
CMPSCDICT_SD DS 0X       Dictionary format for compression, Sibling    *08800000
                         descriptor                                     08850000
         AGO   .L0007                                                   08900000
.L0006   ANOP                                                           08950000
CMPSCDICT_SD DSECT ,     Dictionary format for compression, Sibling    *09000000
                         descriptor                                     09050000
.L0007   ANOP                                                           09100000
CMPSCDICT_SD_HD DS 1BL2  Header                                         09150000
         ORG   CMPSCDICT_SD_HD                                          09200000
CMPSCDICT_SD_SIBCT EQU X'F0' Sibling count                              09250000
CMPSCDICT_SD_EXSIB_REPLACED DS 0X                                       09300000
CMPSCDICT_SD_EXSIB EQU X'0FFF' This represents a 12-bit subfield       *09350000
                         of CMPSCDICT_SD_HD. Each bit indicates        *09400000
                         to examine the corresponding sibling.          09450000
         ORG   CMPSCDICT_SD_EXSIB_REPLACED+X'00000001'                  09500000
         ORG   CMPSCDICT_SD_HD+X'00000002'                              09550000
CMPSCDICT_SD_CHILDCHAR DS 1CL0006 Sibling character entries             09600000
CMPSCDICT_SD_SIBCT_1 EQU B'00010000' Value of 1 for CMPSCDICT_SD_SIBCT *09650000
                         within field CMPSCDICT_SD_HD                   09700000
CMPSCDICT_SD_LEN EQU *-CMPSCDICT_SD                                     09750000
.L0005   ANOP                                                           09800000
         AIF   ('&CMPSCDICT_SDE' EQ 'NO').L0008                         09850000
         AIF   ('&DSECT' EQ 'YES').L0009                                09900000
         AIF   ('&CMPSCDICT_SDE' NE 'YES').L0008                        09950000
CMPSCDICT_SDE DS 0X      Dictionary format for compression, Sibling    *10000000
                         descriptor entry in expansion dictionary       10050000
         AGO   .L000A                                                   10100000
.L0009   ANOP                                                           10150000
CMPSCDICT_SDE DSECT ,    Dictionary format for compression, Sibling    *10200000
                         descriptor entry in expansion dictionary       10250000
.L000A   ANOP                                                           10300000
CMPSCDICT_SDE_CHILDCHAR DS 1CL0008 Sibling character entries            10350000
CMPSCDICT_SDE_LEN EQU *-CMPSCDICT_SDE                                   10400000
.L0008   ANOP                                                           10450000
         AIF   ('&CMPSCDICT_UE' EQ 'NO').L000B                          10500000
         AIF   ('&DSECT' EQ 'YES').L000C                                10550000
         AIF   ('&CMPSCDICT_UE' NE 'YES').L000B                         10600000
CMPSCDICT_UE DS 0X       Dictionary format for expansion, Unpreceded   *10650000
                         expansion entry                                10700000
         AGO   .L000D                                                   10750000
.L000C   ANOP                                                           10800000
CMPSCDICT_UE DSECT ,     Dictionary format for expansion, Unpreceded   *10850000
                         expansion entry                                10900000
.L000D   ANOP                                                           10950000
CMPSCDICT_UE_HD DS 1BL1  Header                                         11000000
         ORG   CMPSCDICT_UE_HD                                          11050000
CMPSCDICT_UE_PARTSYMLEN EQU X'E0' Partial symbol length = 0             11100000
CMPSCDICT_UE_COMPSYMLEN EQU X'07' Completed symbol length               11150000
         ORG   CMPSCDICT_UE_HD+X'00000001'                              11200000
CMPSCDICT_UE_CHARS DS 1CL0007 Extension characters                      11250000
CMPSCDICT_UE_COMPSYMLEN_1 EQU B'00000001' Value of 1 for               *11300000
                         CMPSCDICT_UE_COMPSYMLEN within field          *11350000
                         CMPSCDICT_UE_HD                                11400000
CMPSCDICT_UE_LEN EQU *-CMPSCDICT_UE                                     11450000
.L000B   ANOP                                                           11500000
         AIF   ('&CMPSCDICT_PE' EQ 'NO').L000E                          11550000
         AIF   ('&DSECT' EQ 'YES').L000F                                11600000
         AIF   ('&CMPSCDICT_PE' NE 'YES').L000E                         11650000
CMPSCDICT_PE DS 0X       Dictionary format for expansion, Preceded     *11700000
                         expansion entry                                11750000
         AGO   .L0010                                                   11800000
.L000F   ANOP                                                           11850000
CMPSCDICT_PE DSECT ,     Dictionary format for expansion, Preceded     *11900000
                         expansion entry                                11950000
.L0010   ANOP                                                           12000000
CMPSCDICT_PE_HD DS 1CL0002 Header                                       12050000
         ORG   CMPSCDICT_PE_HD                                          12100000
CMPSCDICT_PE_PARTSYMLEN EQU X'E0' Partial symbol length ^= 0            12150000
CMPSCDICT_PE_PRECENTINDEX_REPLACED DS 0X                                12200000
CMPSCDICT_PE_PRECENTINDEX EQU X'1FFF' This mask can be used to         *12250000
                         isolate the 13-bits of field                  *12300000
                         CMPSCDICT_PE_HD that represent the            *12350000
                         index of the preceding entry                   12400000
         ORG   CMPSCDICT_PE_PRECENTINDEX_REPLACED+X'00000001'           12450000
         ORG   CMPSCDICT_PE_HD+X'00000002'                              12500000
CMPSCDICT_PE_CHARS DS 1CL0005 Extension characters                      12550000
CMPSCDICT_PE_OFFSET DS 1FL1 Offset where first character in            *12600000
                         CMPSCDICT_PE_CHARS belongs                     12650000
CMPSCDICT_PE_PARTSYMLEN_1 EQU B'00100000' Value of 1 for               *12700000
                         CMPSCDICT_PE_PARTSYMLEN within field          *12750000
                         CMPSCDICT_PE_HD                                12800000
CMPSCDICT_PE_LEN EQU *-CMPSCDICT_PE                                     12850000
.L000E   ANOP                                                           12900000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 12950000
         AIF   ('&LIST' EQ 'YES').P4                                    13000000
.P3      ANOP                                                           13050000
         POP   PRINT                                                    13100000
.P4      ANOP                                                           13150000
.P_EXIT  ANOP                                                           13200000
         MEND                                                           13250000
**/ CSRYCMPD_2:;                                                        13300000
* %CSRYCMPD_INCLUDED = 'YES';                                           13350000
* %DCL ZCBPRINT CHAR EXT;                                               13400000
* %DEACTIVATE ZCBPRINT;                                                 13450000
* %DCL CSRYCMPD_LIST CHAR EXT;                                          13500000
* %DEACTIVATE CSRYCMPD_LIST;                                            13550000
* %IF CSRYCMPD_LIST ^= 'NO' &                                           13600000
*    ZCBPRINT ^= 'NO' %THEN                                             13650000
*   %GOTO CSRYCMPD_3;                                                   13700000
*   @LIST PUSH NOECHO;                                                  13750000
*   @LIST NOASSEMBLE NOECHO;                                            13800000
*   @LIST OFF C NOECHO;                                                 13850000
* %CSRYCMPD_3:;                                                         13900000
*/* Start of PL/X Source                                             */ 13950000
*DCL 1 CMPSCDICT_CE BASED,  /* Dictionary format for compression,       14000000
*                              Child character entry             @T1A*/ 14050000
*     2 CMPSCDICT_CE_H1 BIT(8),  /* First byte of header         @T1A*/ 14100000
*       3 CMPSCDICT_CE_ChildCt BIT(3), /* Child character count  @T1A*/ 14150000
*       3 CMPSCDICT_CE_ExChild BIT(5), /* Examine child bits     @T1A*/ 14200000
*     2 CMPSCDICT_CE_H23 BIT(16), /* Second/third bytes of              14250000
*                                    header                      @T1A*/ 14300000
*       3 CMPSCDICT_CE_AecCt  BIT(3),  /* Additional extension          14350000
*                                         count                  @T1A*/ 14400000
*         4 CMPSCDICT_CE_ExSib BIT(2), /* Examine sibling bits   @T1A*/ 14450000
*         4 CMPSCDICT_CE_AddExtChar BIT(1), /* If on, add ext           14500000
*                                         character              @T1A*/ 14550000
*       3 CMPSCDICT_CE_FirstChildIndex BIT(13), /* First child index.   14600000
*                                                                @T1A*/ 14650000
*     2 CMPSCDICT_CE_ChildChar CHAR(5),       /* Child character        14700000
*                              entries                           @T1A*/ 14750000
*     2 * CHAR(0);          /* End of child entry                @T1A*/ 14800000
*DCL CMPSCDICT_CE_ChildCt_1 BIT(3) Constant('001'B);  /* Value of       14850000
*                              1 for CMPSCDICT_CE_CHILDCT within        14900000
*                              field CMPSCDICT_CE_H1             @T1A*/ 14950000
*DCL CMPSCDICT_CE_AECCT_1 BIT(3) Constant('001'B);  /* Value of         15000000
*                              1 for CMPSCDICT_CE_AECCT within          15050000
*                              field CMPSCDICT_CE_H23            @T1A*/ 15100000
*DCL 1 CMPSCDICT_SD BASED,  /* Dictionary format for compression,       15150000
*                              Sibling descriptor                @T1A*/ 15200000
*     2 CMPSCDICT_SD_HD BIT(16), /* Header                       @T1A*/ 15250000
*       3 CMPSCDICT_SD_SibCt BIT(4),   /* Sibling count          @T1A*/ 15300000
*       3 CMPSCDICT_SD_ExSib BIT(12), /* Examine sibling bits.   @T1A*/ 15350000
*     2 CMPSCDICT_SD_ChildChar CHAR(6),    /* Sibling character         15400000
*                              entries                           @T1A*/ 15450000
*     2 * CHAR(0);          /* End of sibling descriptor         @T1A*/ 15500000
*DCL CMPSCDICT_SD_SIBCT_1 BIT(4) Constant('0001'B);  /* Value of        15550000
*                              1 for CMPSCDICT_SD_SIBCT within          15600000
*                              field CMPSCDICT_SD_HD             @T1A*/ 15650000
*DCL 1 CMPSCDICT_SDE BASED, /* Dictionary format for compression,       15700000
*                              Sibling descriptor entry in              15750000
*                              expansion dictionary              @T1A*/ 15800000
*     2 CMPSCDICT_SDE_ChildChar CHAR(8),    /* Sibling character        15850000
*                              entries                           @T1A*/ 15900000
*     2 * CHAR(0);          /* End of sibling descriptor         @T1A*/ 15950000
*DCL 1 CMPSCDICT_UE BASED,  /* Dictionary format for expansion,         16000000
*                              Unpreceded expansion entry        @T1A*/ 16050000
*     2 CMPSCDICT_UE_HD BIT(8),  /* Header                       @T1A*/ 16100000
*       3 CMPSCDICT_UE_PartSymLen BIT(3), /* Partial symbol length = 0  16150000
*                                                                @T1A*/ 16200000
*       3 * BIT(2),         /* Reserved                          @T1A*/ 16250000
*       3 CMPSCDICT_UE_CompSymLen BIT(3), /* Completed symbol length    16300000
*                                                                @T1A*/ 16350000
*     2 CMPSCDICT_UE_Chars CHAR(7),     /* Extension characters  @T1A*/ 16400000
*     2 * CHAR(0);          /* End of unpreceded expansion entry @T1A*/ 16450000
*DCL CMPSCDICT_UE_COMPSYMLEN_1 BIT(3) Constant('001'B);  /* Value of    16500000
*                              1 for CMPSCDICT_UE_COMPSYMLEN within     16550000
*                              field CMPSCDICT_UE_HD             @T1A*/ 16600000
*DCL 1 CMPSCDICT_PE BASED,  /* Dictionary format for expansion,         16650000
*                              Preceded expansion entry          @T1A*/ 16700000
*     2 CMPSCDICT_PE_HD CHAR(2), /* Header                       @T1A*/ 16750000
*       3 CMPSCDICT_PE_PartSymLen BIT(3), /* Partial symbol length ^= 0 16800000
*                                                                @T1A*/ 16850000
*       3 CMPSCDICT_PE_PrecEntIndex BIT(13), /* Index of preceding      16900000
*                        entry.                                  @T1A*/ 16950000
*     2 CMPSCDICT_PE_Chars CHAR(5),  /* Extension characters     @T1A*/ 17000000
*     2 CMPSCDICT_PE_Offset FIXED(8), /* Offset where first character   17050000
*                              in CMPSCDICT_PE_CHARS belongs     @T1A*/ 17100000
*     2 * CHAR(0);          /* End of preceded expansion entry   @T1A*/ 17150000
*DCL CMPSCDICT_PE_PARTSYMLEN_1 BIT(3) Constant('001'B);  /* Value of    17200000
*                              1 for CMPSCDICT_PE_PARTSYMLEN within     17250000
*                              field CMPSCDICT_PE_HD             @T1A*/ 17300000
* @LOGIC;                                                               17350000
* #PRAGMA TOOL=CBGEN.                                                   17400000
* #USEORG.                                                              17450000
* #REPLACE.CMPSCDICT_CE_FIRSTCHILDINDEX                                 17500000
*CMPSCDICT_CE_FIRSTCHILDINDEX EQU X'1FFF' This mask can be used to    * 17550000
*                         isolate the 13-bits of field                * 17600000
*                         CMPSCDICT_CE_H23 that represent the         * 17650000
*                         index of the first child                      17700000
* #EREPLACE.                                                            17750000
* #REPLACE.CMPSCDICT_SD_EXSIB                                           17800000
*CMPSCDICT_SD_EXSIB EQU X'0FFF' This represents a 12-bit subfield     * 17850000
*                         of CMPSCDICT_SD_HD. Each bit indicates      * 17900000
*                         to examine the corresponding sibling.         17950000
* #EREPLACE.                                                            18000000
* #REPLACE.CMPSCDICT_PE_PRECENTINDEX                                    18050000
*CMPSCDICT_PE_PRECENTINDEX EQU X'1FFF' This mask can be used to       * 18100000
*                         isolate the 13-bits of field                * 18150000
*                         CMPSCDICT_PE_HD that represent the          * 18200000
*                         index of the preceding entry                  18250000
* #EREPLACE.                                                            18300000
* #EPRAGMA.                                                             18350000
* @ENDLOGIC;                                                            18400000
*/* End of PL/X Source                                               */ 18450000
* %IF CSRYCMPD_LIST ^= 'NO' &                                           18500000
*    ZCBPRINT ^= 'NO' %THEN                                             18550000
*   %GOTO CSRYCMPD_4;                                                   18600000
*   @LIST POP NOECHO;                                                   18650000
* %CSRYCMPD_4:;                                                         18700000
* %END;                                                                 18750000
