*                                                                       00050000
* %DCL CSRYUNIC_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE CSRYUNIC_INCLUDED;                                        00150000
* %IF CSRYUNIC_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99335. CBGEN compile date 99334         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSRYUNIC &DSECT=YES,&LIST=YES,&TITLE=YES,&UNIC_CONST=YES,     *00450000
               &UNIC_MVCLU=COND,&UNIC_CLCLU=COND,&UNIC_TP=COND,        *00500000
               &UNIC_PKA=COND,&UNIC_PKU=COND,&UNIC_UNPKA=COND,         *00550000
               &UNIC_UNPKU=COND,&UNIC_TRTT=COND,&UNIC_TRTO=COND,       *00600000
               &UNIC_TROT=COND,&UNIC_TROO=COND,&UNIC_TRE=COND,         *00650000
               &UNIC_CUUTF=COND,&UNIC_CUTFU=COND                        00700000
         GBLC  &CSRYUNIC_INCLUDED                                       00750000
         GBLC  &ZCBPRINT                                                00800000
&CSRYUNIC_INCLUDED SETC 'YES'                                           00850000
         AIF   ('&LIST' EQ 'NONE').P0                                   00900000
         AIF   ('&TITLE' EQ 'NO').P5                                    00950000
 TITLE   'CSRYUNIC  - Unicode Services parameter blocks              '  01000000
.P5      ANOP                                                           01050000
**/ CSRYUNIC_1:;                                                        01100000
*/* START OF SPECIFICATIONS ******************************************* 01150000
*                                                                       01200000
*  **PROPRIETARY_STATEMENT********************************************  01250000
***01* PROPRIETARY STATEMENT=                                        *  01300000
*                                                                    *  01350000
*                                                                    *  01400000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01450000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01500000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  01550000
*                                                                    *  01600000
*   STATUS= HBB7703                                                  *  01650000
*                                                                    *  01700000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01750000
*                                                                       01800000
*01* DESCRIPTIVE NAME:  Unicode Services parameter blocks               01850000
*02*  ACRONYM:  UNIC                                                    01900000
*                                                                       01950000
*01* MACRO NAME:  CSRYUNIC                                              02000000
*                                                                       02050000
*01* EXTERNAL CLASSIFICATION: PI                                        02100000
*01* END OF EXTERNAL CLASSIFICATION:                                    02150000
*                                                                       02200000
*01* DSECT NAME:                                                        02250000
*     UNIC_CONST                                                        02300000
*     UNIC_MVCLU                                                        02350000
*     UNIC_CLCLU                                                        02400000
*     UNIC_TP                                                           02450000
*     UNIC_PKA                                                          02500000
*     UNIC_PKU                                                          02550000
*     UNIC_UNPKA                                                        02600000
*     UNIC_UNPKU                                                        02650000
*     UNIC_TRTT                                                         02700000
*     UNIC_TRTO                                                         02750000
*     UNIC_TROT                                                         02800000
*     UNIC_TROO                                                         02850000
*     UNIC_TRE                                                          02900000
*     UNIC_CUUTF                                                        02950000
*     UNIC_CUTFU                                                        03000000
*                                                                       03050000
*01* COMPONENT:  Callable Services (SCCSR)                              03100000
*                                                                       03150000
*01* EYE-CATCHER:  NONE                                                 03200000
*                                                                       03250000
*01* STORAGE ATTRIBUTES:                                                03300000
*02*  SUBPOOL:  Caller-supplied                                         03350000
*02*  KEY:  Caller-supplied                                             03400000
*02*  RESIDENCY:  Caller-supplied                                       03450000
*                                                                       03500000
*01* SIZE:                                                              03550000
*                UNIC_CONST -- X'0000' bytes                            03600000
*                UNIC_MVCLU -- X'0040' bytes                            03650000
*                UNIC_CLCLU -- X'0040' bytes                            03700000
*                UNIC_TP    -- X'0040' bytes                            03750000
*                UNIC_PKA   -- X'0040' bytes                            03800000
*                UNIC_PKU   -- X'0040' bytes                            03850000
*                UNIC_UNPKA -- X'0040' bytes                            03900000
*                UNIC_UNPKU -- X'0040' bytes                            03950000
*                UNIC_TRTT  -- X'0040' bytes                            04000000
*                UNIC_TRTO  -- X'0040' bytes                            04050000
*                UNIC_TROT  -- X'0040' bytes                            04100000
*                UNIC_TROO  -- X'0040' bytes                            04150000
*                UNIC_TRE   -- X'0040' bytes                            04200000
*                UNIC_CUUTF -- X'0040' bytes                            04250000
*                UNIC_CUTFU -- X'0040' bytes                            04300000
*                                                                       04350000
*01* CREATED BY:                                                        04400000
*     Caller of CSRUNIC service and passed as parameter on PBLOCK       04450000
*     keyword on CSRUNIC                                                04500000
*                                                                       04550000
*01* POINTED TO BY:                                                     04600000
*     Not applicable                                                    04650000
*                                                                       04700000
*01* SERIALIZATION:                                                     04750000
*     None required                                                     04800000
*                                                                       04850000
*01* FUNCTION:                                                          04900000
*02* Maps the compression service parameter area.                       04950000
*02* It represents the data needed by the compression service           05000000
*    for which it is to be specified on the CBLOCK keyword.             05050000
*02* Provides equates for return codes from the compression service.    05100000
*                                                                       05150000
*01* METHOD OF ACCESS:                                                  05200000
*02*  ASM:                                                              05250000
*      CSRYCMPS                                                         05300000
*           DSECT=YES|NO  -- Request DSECT definition                   05350000
*           UNIC_CONST=YES|NO  -- Request service-wide constants        05400000
*           UNIC_MVCLU=YES|NO  -- Request mapping of UNIC_MVCLU         05450000
*           UNIC_CLCLU=YES|NO  -- Request mapping of UNIC_CLCLU         05500000
*           UNIC_TP   =YES|NO  -- Request mapping of UNIC_TP            05550000
*           UNIC_PKA  =YES|NO  -- Request mapping of UNIC_PKA           05600000
*           UNIC_PKU  =YES|NO  -- Request mapping of UNIC_PKU           05650000
*           UNIC_UNPKA=YES|NO  -- Request mapping of UNIC_UNPKA         05700000
*           UNIC_UNPKU=YES|NO  -- Request mapping of UNIC_UNPKU         05750000
*           UNIC_TRTT =YES|NO  -- Request mapping of UNIC_TRTT          05800000
*           UNIC_TRTO =YES|NO  -- Request mapping of UNIC_TRTO          05850000
*           UNIC_TROT =YES|NO  -- Request mapping of UNIC_TROT          05900000
*           UNIC_TROO =YES|NO  -- Request mapping of UNIC_TROO          05950000
*           UNIC_TRE  =YES|NO  -- Request mapping of UNIC_TRE           06000000
*           UNIC_CUUTF=YES|NO  -- Request mapping of UNIC_CUUTF         06050000
*           UNIC_CUTFU=YES|NO  -- Request mapping of UNIC_CUTFU         06100000
*     Default: DSECT=YES,UNIC_CONST=YES                                 06150000
*                        UNIC_MVCLU=COND                                06200000
*                        UNIC_CLCLU=COND                                06250000
*                        UNIC_TP=COND                                   06300000
*                        UNIC_PKA=COND                                  06350000
*                        UNIC_PKU=COND                                  06400000
*                        UNIC_UNPKA=COND                                06450000
*                        UNIC_UNPKU=COND                                06500000
*                        UNIC_TRTT=COND                                 06550000
*                        UNIC_TRTO=COND                                 06600000
*                        UNIC_TROT=COND                                 06650000
*                        UNIC_TROO=COND                                 06700000
*                        UNIC_TRE=COND                                  06750000
*                        UNIC_CUUTF=COND                                06800000
*                        UNIC_CUTFU=COND                                06850000
*02*  PL/AS:                                                            06900000
*      %INCLUDE SYSLIB(CSRYUNIC)                                        06950000
*                                                                       07000000
*01* DELETED BY:  Caller                                                07050000
*                                                                       07100000
*01* FREQUENCY:  Created for invoking CSRUNIC                           07150000
*                                                                       07200000
*01* DEPENDENCIES:  None                                                07250000
*                                                                       07300000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     07350000
*                                                                       07400000
*01* CHANGE ACTIVITY:                                                   07450000
*   $L0=UNICOCBG ,HBB7703 990915 PD00XB: CSRUNIC parameter block        07500000
*   $L1=UNICOCSR ,HBB7703 990915 PD00XB: CSRUNIC parameter block        07550000
*                                                                       07600000
* END OF SPECIFICATIONS *********************************************/  07650000
*% /*                                                                   07700000
.P0      ANOP                                                           07750000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 07800000
         AIF   ('&LIST' EQ 'YES').P2                                    07850000
.P1      ANOP                                                           07900000
         PUSH  PRINT                                                    07950000
         PRINT OFF                                                      08000000
.P2      ANOP                                                           08050000
         AIF   ('&UNIC_CONST' EQ 'NO').L0002                            08100000
         AIF   ('&DSECT' EQ 'YES').L0003                                08150000
         AIF   ('&UNIC_CONST' NE 'YES').L0002                           08200000
UNIC_CONST DS  0X                                                       08250000
         AGO   .L0004                                                   08300000
.L0003   ANOP                                                           08350000
UNIC_CONST DSECT                                                        08400000
.L0004   ANOP                                                           08450000
UNIC_WORKAREA_LEN EQU 256                                               08500000
UNIC_PBLOCK_LEN EQU 64                                                  08550000
*                                                                       08600000
*   CSRUNIC Return and Reason Code definitions                          08650000
*                                                                       08700000
*                                                                       08750000
UNIC_MVCLU_RC_OPLENGTHSEQUAL EQU X'00000000' Meaning: the operand      *08800000
                         lengths were the same Action: None required    08850000
UNIC_MVCLU_RC_TARGETLENGTHSHORTER EQU X'00000004'                       08900000
*                                                                       08950000
*                                      Meaning: The target operand      09000000
*                                      was shorter than the source      09050000
*                                      operand Action: None required    09100000
*                                                                       09150000
UNIC_MVCLU_RC_TARGETLENGTHLONGER EQU X'00000008'                        09200000
*                                                                       09250000
*                                      Meaning: The target operand      09300000
*                                      was longer than the source       09350000
*                                      operand Action: None required    09400000
*                                                                       09450000
UNIC_MVCLU_RC_TARGETLENGTHNOTEVEN EQU X'00000010'                       09500000
*                                                                       09550000
*                                      Meaning: The target operand      09600000
*                                      was not an even number of        09650000
*                                      bytes Action: Only call          09700000
*                                      CSRUNIC FUNCTION=MVCLU when      09750000
*                                      the target operand is an even    09800000
*                                      number of bytes (i.e., a whole   09850000
*                                      number of unicode characters)    09900000
*                                                                       09950000
UNIC_MVCLU_RC_SOURCELENGTHNOTEVEN EQU X'00000014'                       10000000
*                                                                       10050000
*                                      Meaning: The source operand      10100000
*                                      was not an even number of        10150000
*                                      bytes Action: Only call          10200000
*                                      CSRUNIC FUNCTION=MVCLU when      10250000
*                                      the source operand is an even    10300000
*                                      number of bytes (i.e., a whole   10350000
*                                      number of unicode characters)    10400000
*                                                                       10450000
UNIC_MVCLU_RC_WORKAREANOTALIGNED EQU X'0000001C'                        10500000
*                                                                       10550000
*                                      Meaning: The workarea provided   10600000
*                                      was not on a doubleword          10650000
*                                      boundary. Action: Make sure      10700000
*                                      that the workarea is on a        10750000
*                                      doubleword boundary.             10800000
*                                                                       10850000
UNIC_CLCLU_RC_OPERANDSEQUAL EQU X'00000000' Meaning: the two operands  *10900000
                         were equal Action: None required               10950000
UNIC_CLCLU_RC_LEFTOPLESSTHANRIGHT EQU X'00000004'                       11000000
*                                                                       11050000
*                                      Meaning: The left operand was    11100000
*                                      less than the right operand      11150000
*                                      Action: None required            11200000
*                                                                       11250000
UNIC_CLCLU_RC_RIGHTOPLESSTHANLEFT EQU X'00000008'                       11300000
*                                                                       11350000
*                                      Meaning: The right operand was   11400000
*                                      less than the left operand       11450000
*                                      Action: None required            11500000
*                                                                       11550000
UNIC_CLCLU_RC_LEFTOPLENGTHNOTEVEN EQU X'00000010'                       11600000
*                                                                       11650000
*                                      Meaning: The left operand was    11700000
*                                      not an even number of bytes      11750000
*                                      Action: Only call CSRUNIC        11800000
*                                      FUNCTION=CLCLU when the left     11850000
*                                      operand is an even number of     11900000
*                                      bytes (i.e., a whole number of   11950000
*                                      unicode characters)              12000000
*                                                                       12050000
UNIC_CLCLU_RC_RIGHTOPLENGTHNOTEVEN EQU X'00000014'                      12100000
*                                                                       12150000
*                                      Meaning: The right operand was   12200000
*                                      not an even number of bytes      12250000
*                                      Action: Only call CSRUNIC        12300000
*                                      FUNCTION=CLCLU when the right    12350000
*                                      operand is an even number of     12400000
*                                      bytes (i.e., a whole number of   12450000
*                                      unicode characters)              12500000
*                                                                       12550000
UNIC_CLCLU_RC_WORKAREANOTALIGNED EQU X'0000001C'                        12600000
*                                                                       12650000
*                                      Meaning: The workarea provided   12700000
*                                      was not on a doubleword          12750000
*                                      boundary. Action: Make sure      12800000
*                                      that the workarea is on a        12850000
*                                      doubleword boundary.             12900000
*                                                                       12950000
UNIC_TP_RC_VALID EQU X'00000000' Meaning: the operand is a valid       *13000000
                         packed number Action: None required            13050000
UNIC_TP_RC_SIGNNOTVALID EQU X'00000004' Meaning: The sign of the       *13100000
                         operand was not valid. All the digits were    *13150000
                         valid. Action: None required                   13200000
UNIC_TP_RC_DIGITNOTVALID EQU X'00000008' Meaning: One or more digits   *13250000
                         of the operand were not valid. The sign was   *13300000
                         valid. Action: None required                   13350000
UNIC_TP_RC_SIGNDIGITNOTVALID EQU X'0000000C' Meaning: The sign and one *13400000
                         or more digits of the operand were not valid. *13450000
                         Action: None required                          13500000
UNIC_TP_RC_WORKAREANOTALIGNED EQU X'0000001C' Meaning: The workarea    *13550000
                         provided was not on a doubleword boundary.    *13600000
                         Action: Make sure that the workarea is on a   *13650000
                         doubleword boundary.                           13700000
UNIC_PKA_RC_OK EQU X'00000000' Meaning: The pack operation completed   *13750000
                         successfully Action: None required             13800000
UNIC_PKA_RC_SOURCELENGTHNOTVALID EQU X'00000014'                        13850000
*                                                                       13900000
*                                      Meaning: The length of the       13950000
*                                      source operand exceeded 32       14000000
*                                      bytes (i.e., the                 14050000
*                                      LengthMinusOne exceeded 31)      14100000
*                                      Action: Avoid calling CSRUNIC    14150000
*                                      REQUEST=PKA for an operand       14200000
*                                      longer than 32 bytes             14250000
*                                                                       14300000
UNIC_PKA_RC_WORKAREANOTALIGNED EQU X'0000001C' Meaning: The workarea   *14350000
                         provided was not on a doubleword boundary.    *14400000
                         Action: Make sure that the workarea is on a   *14450000
                         doubleword boundary.                           14500000
UNIC_PKU_RC_OK EQU X'00000000' Meaning: The pack operation completed   *14550000
                         successfully Action: None required             14600000
UNIC_PKU_RC_SOURCELENGTHNOTVALID EQU X'00000014'                        14650000
*                                                                       14700000
*                                      Meaning: The length of the       14750000
*                                      source operand exceeded 64       14800000
*                                      bytes (i.e., the                 14850000
*                                      LengthMinusOne exceeded 63)      14900000
*                                      Action: Avoid calling CSRUNIC    14950000
*                                      REQUEST=PKU for an operand       15000000
*                                      longer than 64 bytes             15050000
*                                                                       15100000
UNIC_PKU_RC_SOURCELENGTHNOTEVEN EQU X'00000024'                         15150000
*                                                                       15200000
*                                      Meaning: The source operand      15250000
*                                      was not an even number of        15300000
*                                      bytes Action: Only call          15350000
*                                      CSRUNIC FUNCTION=PKU when the    15400000
*                                      source operand is an even        15450000
*                                      number of bytes (i.e., a whole   15500000
*                                      number of unicode characters)    15550000
*                                                                       15600000
UNIC_PKU_RC_WORKAREANOTALIGNED EQU X'0000001C' Meaning: The workarea   *15650000
                         provided was not on a doubleword boundary.    *15700000
                         Action: Make sure that the workarea is on a   *15750000
                         doubleword boundary.                           15800000
UNIC_UNPKA_RC_POSITIVE EQU X'00000000' Meaning: The operand            *15850000
                         represented a positive number Action: None    *15900000
                         required                                       15950000
UNIC_UNPKA_RC_NEGATIVE EQU X'00000004' Meaning: The operand            *16000000
                         represented a negative number Action: None    *16050000
                         required                                       16100000
UNIC_UNPKA_RC_BADSIGN EQU X'0000000C' Meaning: The operand did not     *16150000
                         have a valid sign Action: None required        16200000
UNIC_UNPKA_RC_TARGETLENGTHNOTVALID EQU X'00000014'                      16250000
*                                                                       16300000
*                                      Meaning: The length of the       16350000
*                                      target operand exceeded 32       16400000
*                                      bytes (i.e., the                 16450000
*                                      LengthMinusOne exceeded 31)      16500000
*                                      Action: Avoid calling CSRUNIC    16550000
*                                      REQUEST=PKA for an operand       16600000
*                                      longer than 32 bytes             16650000
*                                                                       16700000
UNIC_UNPKA_RC_WORKAREANOTALIGNED EQU X'0000001C'                        16750000
*                                                                       16800000
*                                      Meaning: The workarea provided   16850000
*                                      was not on a doubleword          16900000
*                                      boundary. Action: Make sure      16950000
*                                      that the workarea is on a        17000000
*                                      doubleword boundary.             17050000
*                                                                       17100000
UNIC_UNPKU_RC_POSITIVE EQU X'00000000' Meaning: The operand            *17150000
                         represented a positive number Action: None    *17200000
                         required                                       17250000
UNIC_UNPKU_RC_NEGATIVE EQU X'00000004' Meaning: The operand            *17300000
                         represented a negative number Action: None    *17350000
                         required                                       17400000
UNIC_UNPKU_RC_BADSIGN EQU X'0000000C' Meaning: The operand did not     *17450000
                         have a valid sign Action: None required        17500000
UNIC_UNPKU_RC_TARGETLENGTHNOTVALID EQU X'00000014'                      17550000
*                                                                       17600000
*                                      Meaning: The length of the       17650000
*                                      target operand exceeded 64       17700000
*                                      bytes (i.e., the                 17750000
*                                      LengthMinusOne exceeded 63)      17800000
*                                      Action: Avoid calling CSRUNIC    17850000
*                                      REQUEST=PKU for an operand       17900000
*                                      longer than 64 bytes             17950000
*                                                                       18000000
UNIC_UNPKU_RC_TARGETLENGTHNOTEVEN EQU X'00000024'                       18050000
*                                                                       18100000
*                                      Meaning: The target operand      18150000
*                                      was not an even number of        18200000
*                                      bytes Action: Only call          18250000
*                                      CSRUNIC FUNCTION=UNPKU when      18300000
*                                      the target operand is an even    18350000
*                                      number of bytes (i.e., a whole   18400000
*                                      number of unicode characters)    18450000
*                                                                       18500000
UNIC_UNPKU_RC_WORKAREANOTALIGNED EQU X'0000001C'                        18550000
*                                                                       18600000
*                                      Meaning: The workarea provided   18650000
*                                      was not on a doubleword          18700000
*                                      boundary. Action: Make sure      18750000
*                                      that the workarea is on a        18800000
*                                      doubleword boundary.             18850000
*                                                                       18900000
UNIC_TRTT_RC_TESTCHARNOTFOUND EQU X'00000000' Meaning: The translation *18950000
                         completed. The test character was not found.  *19000000
                         Action: None required                          19050000
UNIC_TRTT_RC_TESTCHARFOUND EQU X'00000004' Meaning: The test character *19100000
                         was found. The operation ended at that point. *19150000
                         Action: None required                          19200000
UNIC_TRTT_RC_LENGTHNOTEVEN EQU X'00000010' Meaning: The operand was    *19250000
                         not an even number of bytes Action: Only call *19300000
                         CSRUNIC FUNCTION=TRTT when the operand is an  *19350000
                         even number of bytes (i.e., a whole number of *19400000
                         unicode characters)                            19450000
UNIC_TRTT_RC_WORKAREANOTALIGNED EQU X'0000001C'                         19500000
*                                                                       19550000
*                                      Meaning: The workarea provided   19600000
*                                      was not on a doubleword          19650000
*                                      boundary. Action: Make sure      19700000
*                                      that the workarea is on a        19750000
*                                      doubleword boundary.             19800000
*                                                                       19850000
UNIC_TRTT_RC_TABLENOTALIGNED EQU X'00000020' Meaning: The table        *19860000
                         provided was not on a page boundary. Action:  *19870000
                         Make sure that the table is on a page         *19880000
                         boundary.                                      19890000
UNIC_TRTO_RC_TESTCHARNOTFOUND EQU X'00000000' Meaning: The translation *19900000
                         completed. The test character was not found.  *19950000
                         Action: None required                          20000000
UNIC_TRTO_RC_TESTCHARFOUND EQU X'00000004' Meaning: The test character *20050000
                         was found. The operation ended at that point. *20100000
                         Action: None required                          20150000
UNIC_TRTO_RC_LENGTHNOTEVEN EQU X'00000010' Meaning: The operand was    *20200000
                         not an even number of bytes Action: Only call *20250000
                         CSRUNIC FUNCTION=TRTO when the operand is an  *20300000
                         even number of bytes (i.e., a whole number of *20350000
                         unicode characters)                            20400000
UNIC_TRTO_RC_WORKAREANOTALIGNED EQU X'0000001C'                         20450000
*                                                                       20500000
*                                      Meaning: The workarea provided   20550000
*                                      was not on a doubleword          20600000
*                                      boundary. Action: Make sure      20650000
*                                      that the workarea is on a        20700000
*                                      doubleword boundary.             20750000
*                                                                       20800000
UNIC_TRTO_RC_TABLENOTALIGNED EQU X'00000020' Meaning: The table        *20810000
                         provided was not on a page boundary. Action:  *20820000
                         Make sure that the table is on a page         *20830000
                         boundary.                                      20840000
UNIC_TROT_RC_TESTCHARNOTFOUND EQU X'00000000' Meaning: The translation *20850000
                         completed. The test character was not found.  *20900000
                         Action: None required                          20950000
UNIC_TROT_RC_TESTCHARFOUND EQU X'00000004' Meaning: The test character *21000000
                         was found. The operation ended at that point. *21050000
                         Action: None required                          21100000
UNIC_TROT_RC_WORKAREANOTALIGNED EQU X'0000001C'                         21150000
*                                                                       21200000
*                                      Meaning: The workarea provided   21250000
*                                      was not on a doubleword          21300000
*                                      boundary. Action: Make sure      21350000
*                                      that the workarea is on a        21400000
*                                      doubleword boundary.             21450000
*                                                                       21500000
UNIC_TROT_RC_TABLENOTALIGNED EQU X'00000020' Meaning: The table        *21510000
                         provided was not on a doubleword boundary.    *21520000
                         Action: Make sure that the table is on a      *21530000
                         doubleword boundary.                           21540000
UNIC_TROO_RC_TESTCHARNOTFOUND EQU X'00000000' Meaning: The translation *21550000
                         completed. The test character was not found.  *21600000
                         Action: None required                          21650000
UNIC_TROO_RC_TESTCHARFOUND EQU X'00000004' Meaning: The test character *21700000
                         was found. The operation ended at that point. *21750000
                         Action: None required                          21800000
UNIC_TROO_RC_WORKAREANOTALIGNED EQU X'0000001C'                         21850000
*                                                                       21900000
*                                      Meaning: The workarea provided   21950000
*                                      was not on a doubleword          22000000
*                                      boundary. Action: Make sure      22050000
*                                      that the workarea is on a        22100000
*                                      doubleword boundary.             22150000
*                                                                       22200000
UNIC_TROO_RC_TABLENOTALIGNED EQU X'00000020' Meaning: The table        *22210000
                         provided was not on a doubleword boundary.    *22220000
                         Action: Make sure that the table is on a      *22230000
                         doubleword boundary.                           22240000
UNIC_TRE_RC_TESTCHARNOTFOUND EQU X'00000000' Meaning: The translation  *22250000
                         completed. The test character was not found.  *22300000
                         Action: None required                          22350000
UNIC_TRE_RC_TESTCHARFOUND EQU X'00000004' Meaning: The test character  *22400000
                         was found. The operation ended at that point. *22450000
                         Action: None required                          22500000
UNIC_TRE_RC_WORKAREANOTALIGNED EQU X'0000001C' Meaning: The workarea   *22550000
                         provided was not on a doubleword boundary.    *22600000
                         Action: Make sure that the workarea is on a   *22650000
                         doubleword boundary.                           22700000
UNIC_CUUTF_RC_SOURCEEXHAUSTED EQU X'00000000' Meaning: All unicode     *22750000
                         characters in the source were converted to    *22800000
                         their UTF-8 equivalents. Action: None         *22850000
                         required                                       22900000
UNIC_CUUTF_RC_TARGETEXHAUSTED EQU X'00000004' Meaning: The target      *22950000
                         operand did not have enough room to hold the  *23000000
                         UTF-8 equivalents of all of the source        *23050000
                         unicode characters. Action: Provide a larger  *23100000
                         target area.                                   23150000
UNIC_CUUTF_RC_WORKAREANOTALIGNED EQU X'0000001C'                        23200000
*                                                                       23250000
*                                      Meaning: The workarea provided   23300000
*                                      was not on a doubleword          23350000
*                                      boundary. Action: Make sure      23400000
*                                      that the workarea is on a        23450000
*                                      doubleword boundary.             23500000
*                                                                       23550000
UNIC_CUTFU_RC_SOURCEEXHAUSTED EQU X'00000000' Meaning: All UTF-8       *23600000
                         characters in the source were converted to    *23650000
                         their unicode equivalents. Action: None       *23700000
                         required                                       23750000
UNIC_CUTFU_RC_TARGETEXHAUSTED EQU X'00000004' Meaning: The target      *23800000
                         operand did not have enough room to hold the  *23850000
                         unicode equivalents of all of the source      *23900000
                         UTF-8 characters. Action: Provide a larger    *23950000
                         target area.                                   24000000
UNIC_CUTFU_RC_BADUTF8CHAR EQU X'00000008' Meaning: A character in the  *24050000
                         source operand was not a valid UTF-8          *24100000
                         character. Action: Make sure that the source  *24150000
                         operand contains only valid UTF-8 characters.  24200000
UNIC_CUTFU_RC_WORKAREANOTALIGNED EQU X'0000001C'                        24250000
UNIC_CONST_LEN EQU *-UNIC_CONST                                         24300000
.L0002   ANOP                                                           24350000
*                                                                       24400000
*                                      Meaning: The workarea provided   24450000
*                                      was not on a doubleword          24500000
*                                      boundary. Action: Make sure      24550000
*                                      that the workarea is on a        24600000
*                                      doubleword boundary.             24650000
*                                                                       24700000
*   End of CSRUNIC Return and Reason Code definitions                   24750000
* ********************************************************************  24800000
* * MVCLU                                                            *  24850000
* ********************************************************************  24900000
*                                                                       24950000
*                                                                       25000000
         AIF   ('&UNIC_MVCLU' EQ 'NO').L0005                            25050000
         AIF   ('&DSECT' EQ 'YES').L0006                                25100000
         AIF   ('&UNIC_MVCLU' NE 'YES').L0005                           25150000
UNIC_MVCLU DS  0F        MVCLU parameter block                          25200000
         AGO   .L0007                                                   25250000
.L0006   ANOP                                                           25300000
UNIC_MVCLU DSECT         MVCLU parameter block                          25350000
.L0007   ANOP                                                           25400000
UNIC_MVCLU_TARGETADDR DS 1AL4 Address of the target area                25450000
UNIC_MVCLU_TARGETLEN DS 1FL4 Length of the target area                  25500000
UNIC_MVCLU_SOURCEADDR DS 1AL4 Address of the Source area                25550000
UNIC_MVCLU_SOURCELEN DS 1FL4 Length of the Source area                  25600000
UNIC_MVCLU_TARGETALET DS 1FL4 ALET to use to access the target area.   *25650000
                         Use 0 if not in AR mode                        25700000
UNIC_MVCLU_PADCHAR DS 1CL0002 Unicode PAD character                     25750000
         DS    1CL0002   Reserved                                       25800000
UNIC_MVCLU_SOURCEALET DS 1FL4 ALET to use to access the target area.   *25850000
                         Use 0 if not in AR mode                        25900000
UNIC_MVCLU_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *25950000
                         doubleword boundary                            26000000
UNIC_MVCLU_WORKAREAALET DS 1FL4 ALET of workarea                        26050000
         DS    1CL0028                                                  26100000
UNIC_MVCLU_LEN EQU *-UNIC_MVCLU                                         26150000
.L0005   ANOP                                                           26200000
*                                                                       26250000
* ********************************************************************  26300000
* * CLCLU                                                            *  26350000
* ********************************************************************  26400000
*                                                                       26450000
*                                                                       26500000
         AIF   ('&UNIC_CLCLU' EQ 'NO').L0008                            26550000
         AIF   ('&DSECT' EQ 'YES').L0009                                26600000
         AIF   ('&UNIC_CLCLU' NE 'YES').L0008                           26650000
UNIC_CLCLU DS  0F        CLCLU parameter block                          26700000
         AGO   .L000A                                                   26750000
.L0009   ANOP                                                           26800000
UNIC_CLCLU DSECT         CLCLU parameter block                          26850000
.L000A   ANOP                                                           26900000
UNIC_CLCLU_LEFTOPADDR DS 1AL4 Address of the target area                26950000
UNIC_CLCLU_LEFTOPLEN DS 1FL4 Length of the target area                  27000000
UNIC_CLCLU_RIGHTOPADDR DS 1AL4 Address of the Source area               27050000
UNIC_CLCLU_RIGHTOPLEN DS 1FL4 Length of the Source area                 27100000
UNIC_CLCLU_LEFTOPALET DS 1FL4 ALET to use to access the target area.   *27150000
                         Use 0 if not in AR mode                        27200000
UNIC_CLCLU_PADCHAR DS 1CL0002 Unicode PAD character                     27250000
         DS    1CL0002   Reserved                                       27300000
UNIC_CLCLU_RIGHTOPALET DS 1FL4 ALET to use to access the target area.  *27350000
                         Use 0 if not in AR mode                        27400000
UNIC_CLCLU_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *27450000
                         doubleword boundary                            27500000
UNIC_CLCLU_WORKAREAALET DS 1FL4 ALET of workarea                        27550000
         DS    1CL0028                                                  27600000
UNIC_CLCLU_LEN EQU *-UNIC_CLCLU                                         27650000
.L0008   ANOP                                                           27700000
*                                                                       27750000
* ********************************************************************  27800000
* * TP                                                               *  27850000
* ********************************************************************  27900000
*                                                                       27950000
*                                                                       28000000
         AIF   ('&UNIC_TP' EQ 'NO').L000B                               28050000
         AIF   ('&DSECT' EQ 'YES').L000C                                28100000
         AIF   ('&UNIC_TP' NE 'YES').L000B                              28150000
UNIC_TP  DS    0F        TP parameter block                             28200000
         AGO   .L000D                                                   28250000
.L000C   ANOP                                                           28300000
UNIC_TP  DSECT           TP parameter block                             28350000
.L000D   ANOP                                                           28400000
UNIC_TP_AREAADDR DS 1AL4 Address of the area to be tested               28450000
UNIC_TP_LENMINUSONE DS 1FL4 Length minus one of the area                28500000
UNIC_TP_AREAALET DS 1FL4 ALET of the area to be tested. Use 0 if not   *28550000
                         in AR-mode.                                    28600000
UNIC_TP_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on           *28650000
                         doubleword boundary                            28700000
UNIC_TP_WORKAREAALET DS 1FL4 ALET of workarea                           28750000
         DS    1CL0040                                                  28800000
         ORG   UNIC_TP+X'00000040'                                      28850000
UNIC_TP_LEN EQU *-UNIC_TP                                               28900000
.L000B   ANOP                                                           28950000
*                                                                       29000000
* ********************************************************************  29050000
* * PKA                                                              *  29100000
* ********************************************************************  29150000
*                                                                       29200000
*                                                                       29250000
         AIF   ('&UNIC_PKA' EQ 'NO').L000E                              29300000
         AIF   ('&DSECT' EQ 'YES').L000F                                29350000
         AIF   ('&UNIC_PKA' NE 'YES').L000E                             29400000
UNIC_PKA DS    0F        PKA parameter block                            29450000
         AGO   .L0010                                                   29500000
.L000F   ANOP                                                           29550000
UNIC_PKA DSECT           PKA parameter block                            29600000
.L0010   ANOP                                                           29650000
UNIC_PKA_TARGETADDR DS 1AL4 Address of the target area                  29700000
UNIC_PKA_SOURCELENMINUSONE DS 1FL4 Length minus one of the source area  29750000
UNIC_PKA_SOURCEADDR DS 1AL4 Address of the Source area                  29800000
UNIC_PKA_TARGETALET DS 1AL4 ALET of the target area                     29850000
         DS    1CL0004                                                  29900000
UNIC_PKA_SOURCEALET DS 1FL4 ALET of the source area                     29950000
UNIC_PKA_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on          *30000000
                         doubleword boundary                            30050000
UNIC_PKA_WORKAREAALET DS 1FL4 ALET of workarea                          30100000
         DS    1CL0032                                                  30150000
UNIC_PKA_LEN EQU *-UNIC_PKA                                             30200000
.L000E   ANOP                                                           30250000
*                                                                       30300000
* ********************************************************************  30350000
* * PKU                                                              *  30400000
* ********************************************************************  30450000
*                                                                       30500000
*                                                                       30550000
         AIF   ('&UNIC_PKU' EQ 'NO').L0011                              30600000
         AIF   ('&DSECT' EQ 'YES').L0012                                30650000
         AIF   ('&UNIC_PKU' NE 'YES').L0011                             30700000
UNIC_PKU DS    0F        PKU parameter block                            30750000
         AGO   .L0013                                                   30800000
.L0012   ANOP                                                           30850000
UNIC_PKU DSECT           PKU parameter block                            30900000
.L0013   ANOP                                                           30950000
UNIC_PKU_TARGETADDR DS 1AL4 Address of the target area                  31000000
UNIC_PKU_SOURCELENMINUSONE DS 1FL4 Length minus one of the target area  31050000
UNIC_PKU_SOURCEADDR DS 1AL4 Address of the Source area                  31100000
UNIC_PKU_TARGETALET DS 1AL4 ALET of the target area                     31150000
         DS    1CL0004                                                  31200000
UNIC_PKU_SOURCEALET DS 1FL4 ALET of the source area                     31250000
UNIC_PKU_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on          *31300000
                         doubleword boundary                            31350000
UNIC_PKU_WORKAREAALET DS 1FL4 ALET of workarea                          31400000
         DS    1CL0032                                                  31450000
UNIC_PKU_LEN EQU *-UNIC_PKU                                             31500000
.L0011   ANOP                                                           31550000
*                                                                       31600000
* ********************************************************************  31650000
* * UNPKA                                                            *  31700000
* ********************************************************************  31750000
*                                                                       31800000
*                                                                       31850000
         AIF   ('&UNIC_UNPKA' EQ 'NO').L0014                            31900000
         AIF   ('&DSECT' EQ 'YES').L0015                                31950000
         AIF   ('&UNIC_UNPKA' NE 'YES').L0014                           32000000
UNIC_UNPKA DS  0F        UNPKA parameter block                          32050000
         AGO   .L0016                                                   32100000
.L0015   ANOP                                                           32150000
UNIC_UNPKA DSECT         UNPKA parameter block                          32200000
.L0016   ANOP                                                           32250000
UNIC_UNPKA_TARGETADDR DS 1AL4 Address of the target area                32300000
UNIC_UNPKA_TARGETLENMINUSONE DS 1FL4 Length minus one of the target    *32350000
                         area                                           32400000
UNIC_UNPKA_SOURCEADDR DS 1AL4 Address of the Source area                32450000
UNIC_UNPKA_TARGETALET DS 1AL4 ALET of the target area                   32500000
         DS    1CL0004                                                  32550000
UNIC_UNPKA_SOURCEALET DS 1FL4 ALET of the source area                   32600000
UNIC_UNPKA_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *32650000
                         doubleword boundary                            32700000
UNIC_UNPKA_WORKAREAALET DS 1FL4 ALET of workarea                        32750000
         DS    1CL0032                                                  32800000
UNIC_UNPKA_LEN EQU *-UNIC_UNPKA                                         32850000
.L0014   ANOP                                                           32900000
*                                                                       32950000
* ********************************************************************  33000000
* * UNPKU                                                            *  33050000
* ********************************************************************  33100000
*                                                                       33150000
*                                                                       33200000
         AIF   ('&UNIC_UNPKU' EQ 'NO').L0017                            33250000
         AIF   ('&DSECT' EQ 'YES').L0018                                33300000
         AIF   ('&UNIC_UNPKU' NE 'YES').L0017                           33350000
UNIC_UNPKU DS  0F        UNPKU parameter block                          33400000
         AGO   .L0019                                                   33450000
.L0018   ANOP                                                           33500000
UNIC_UNPKU DSECT         UNPKU parameter block                          33550000
.L0019   ANOP                                                           33600000
UNIC_UNPKU_TARGETADDR DS 1AL4 Address of the target area                33650000
UNIC_UNPKU_TARGETLENMINUSONE DS 1FL4 Length minus one of the target    *33700000
                         area                                           33750000
UNIC_UNPKU_SOURCEADDR DS 1AL4 Address of the Source area                33800000
UNIC_UNPKU_TARGETALET DS 1AL4 ALET of the target area                   33850000
         DS    1CL0004                                                  33900000
UNIC_UNPKU_SOURCEALET DS 1FL4 ALET of the source area                   33950000
UNIC_UNPKU_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *34000000
                         doubleword boundary                            34050000
UNIC_UNPKU_WORKAREAALET DS 1FL4 ALET of workarea                        34100000
         DS    1CL0032                                                  34150000
UNIC_UNPKU_LEN EQU *-UNIC_UNPKU                                         34200000
.L0017   ANOP                                                           34250000
*                                                                       34300000
* ********************************************************************  34350000
* * TRTT                                                             *  34400000
* ********************************************************************  34450000
*                                                                       34500000
*                                                                       34550000
         AIF   ('&UNIC_TRTT' EQ 'NO').L001A                             34600000
         AIF   ('&DSECT' EQ 'YES').L001B                                34650000
         AIF   ('&UNIC_TRTT' NE 'YES').L001A                            34700000
UNIC_TRTT DS   0F        TRTT parameter block                           34750000
         AGO   .L001C                                                   34800000
.L001B   ANOP                                                           34850000
UNIC_TRTT DSECT          TRTT parameter block                           34900000
.L001C   ANOP                                                           34950000
UNIC_TRTT_TABLEADDR DS 1AL4 Address of the 128K translate table. It    *34983300
                         must be on a page boundary.                    35016600
UNIC_TRTT_TARGETADDR DS 1AL4 Address of the target area                 35050000
UNIC_TRTT_LENGTH DS 1FL4 Length of the source and target areas          35100000
UNIC_TRTT_SOURCEADDR DS 1AL4 Address of the Source area                 35150000
UNIC_TRTT_TABLEALET DS 1FL4 ALET to use to access the translate table  *35200000
                         area. Use 0 if not in AR mode                  35250000
UNIC_TRTT_TARGETALET DS 1FL4 ALET to use to access the target area.    *35300000
                         Use 0 if not in AR mode                        35350000
UNIC_TRTT_TESTCHAR DS 1CL0002 Unicode test character                    35400000
         DS    1CL0002   Reserved                                       35450000
UNIC_TRTT_SOURCEALET DS 1FL4 ALET to use to access the target area.    *35500000
                         Use 0 if not in AR mode                        35550000
UNIC_TRTT_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on         *35600000
                         doubleword boundary                            35650000
UNIC_TRTT_WORKAREAALET DS 1FL4 ALET of workarea                         35700000
         DS    1CL0024                                                  35750000
UNIC_TRTT_LEN EQU *-UNIC_TRTT                                           35800000
.L001A   ANOP                                                           35850000
*                                                                       35900000
* ********************************************************************  35950000
* * TRTO                                                             *  36000000
* ********************************************************************  36050000
*                                                                       36100000
*                                                                       36150000
         AIF   ('&UNIC_TRTO' EQ 'NO').L001D                             36200000
         AIF   ('&DSECT' EQ 'YES').L001E                                36250000
         AIF   ('&UNIC_TRTO' NE 'YES').L001D                            36300000
UNIC_TRTO DS   0F        TRTO parameter block                           36350000
         AGO   .L001F                                                   36400000
.L001E   ANOP                                                           36450000
UNIC_TRTO DSECT          TRTO parameter block                           36500000
.L001F   ANOP                                                           36550000
UNIC_TRTO_TABLEADDR DS 1AL4 Address of the 64K translate table. It     *36583300
                         must be on a page boundary.                    36616600
UNIC_TRTO_TARGETADDR DS 1AL4 Address of the target area                 36650000
UNIC_TRTO_LENGTH DS 1FL4 Length of the source area in bytes. This is   *36700000
                         twice the length of the target area.           36750000
UNIC_TRTO_SOURCEADDR DS 1AL4 Address of the Source area                 36800000
UNIC_TRTO_TABLEALET DS 1FL4 ALET to use to access the translate table  *36850000
                         area. Use 0 if not in AR mode                  36900000
UNIC_TRTO_TARGETALET DS 1FL4 ALET to use to access the target area.    *36950000
                         Use 0 if not in AR mode                        37000000
UNIC_TRTO_TESTCHAR DS 1CL0001 Test character                            37050000
         DS    1CL0003   Reserved                                       37100000
UNIC_TRTO_SOURCEALET DS 1FL4 ALET to use to access the target area.    *37150000
                         Use 0 if not in AR mode                        37200000
UNIC_TRTO_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on         *37250000
                         doubleword boundary                            37300000
UNIC_TRTO_WORKAREAALET DS 1FL4 ALET of workarea                         37350000
         DS    1CL0024                                                  37400000
UNIC_TRTO_LEN EQU *-UNIC_TRTO                                           37450000
.L001D   ANOP                                                           37500000
*                                                                       37550000
* ********************************************************************  37600000
* * TROT                                                             *  37650000
* ********************************************************************  37700000
*                                                                       37750000
*                                                                       37800000
         AIF   ('&UNIC_TROT' EQ 'NO').L0020                             37850000
         AIF   ('&DSECT' EQ 'YES').L0021                                37900000
         AIF   ('&UNIC_TROT' NE 'YES').L0020                            37950000
UNIC_TROT DS   0F        TROT parameter block                           38000000
         AGO   .L0022                                                   38050000
.L0021   ANOP                                                           38100000
UNIC_TROT DSECT          TROT parameter block                           38150000
.L0022   ANOP                                                           38200000
UNIC_TROT_TABLEADDR DS 1AL4 Address of the 512-byte translate table.   *38233300
                         It must be on a doubleword boundary.           38266600
UNIC_TROT_TARGETADDR DS 1AL4 Address of the target area                 38300000
UNIC_TROT_LENGTH DS 1FL4 Length of the source area in bytes. This is   *38350000
                         half the length of the target area.            38400000
UNIC_TROT_SOURCEADDR DS 1AL4 Address of the Source area                 38450000
UNIC_TROT_TABLEALET DS 1FL4 ALET to use to access the translate table  *38500000
                         area. Use 0 if not in AR mode                  38550000
UNIC_TROT_TARGETALET DS 1FL4 ALET to use to access the target area.    *38600000
                         Use 0 if not in AR mode                        38650000
UNIC_TROT_TESTCHAR DS 1CL0002 Unicode test character                    38700000
         DS    1CL0002   Reserved                                       38750000
UNIC_TROT_SOURCEALET DS 1FL4 ALET to use to access the target area.    *38800000
                         Use 0 if not in AR mode                        38850000
UNIC_TROT_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on         *38900000
                         doubleword boundary                            38950000
UNIC_TROT_WORKAREAALET DS 1FL4 ALET of workarea                         39000000
         DS    1CL0024                                                  39050000
UNIC_TROT_LEN EQU *-UNIC_TROT                                           39100000
.L0020   ANOP                                                           39150000
*                                                                       39200000
* ********************************************************************  39250000
* * TROO                                                             *  39300000
* ********************************************************************  39350000
*                                                                       39400000
*                                                                       39450000
         AIF   ('&UNIC_TROO' EQ 'NO').L0023                             39500000
         AIF   ('&DSECT' EQ 'YES').L0024                                39550000
         AIF   ('&UNIC_TROO' NE 'YES').L0023                            39600000
UNIC_TROO DS   0F        TROO parameter block                           39650000
         AGO   .L0025                                                   39700000
.L0024   ANOP                                                           39750000
UNIC_TROO DSECT          TROO parameter block                           39800000
.L0025   ANOP                                                           39850000
UNIC_TROO_TABLEADDR DS 1AL4 Address of the 256-byte translate table.   *39883300
                         It must be on a doubleword boundary.           39916600
UNIC_TROO_TARGETADDR DS 1AL4 Address of the target area                 39950000
UNIC_TROO_LENGTH DS 1FL4 Length of the source and target areas in      *40000000
                         bytes                                          40050000
UNIC_TROO_SOURCEADDR DS 1AL4 Address of the Source area                 40100000
UNIC_TROO_TABLEALET DS 1FL4 ALET to use to access the translate table  *40150000
                         area. Use 0 if not in AR mode                  40200000
UNIC_TROO_TARGETALET DS 1FL4 ALET to use to access the target area.    *40250000
                         Use 0 if not in AR mode                        40300000
UNIC_TROO_TESTCHAR DS 1CL0001 Test character                            40350000
         DS    1CL0003   Reserved                                       40400000
UNIC_TROO_SOURCEALET DS 1FL4 ALET to use to access the target area.    *40450000
                         Use 0 if not in AR mode                        40500000
UNIC_TROO_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on         *40550000
                         doubleword boundary                            40600000
UNIC_TROO_WORKAREAALET DS 1FL4 ALET of workarea                         40650000
         DS    1CL0024                                                  40700000
UNIC_TROO_LEN EQU *-UNIC_TROO                                           40750000
.L0023   ANOP                                                           40800000
*                                                                       40850000
* ********************************************************************  40900000
* * TRE                                                              *  40950000
* ********************************************************************  41000000
*                                                                       41050000
*                                                                       41100000
         AIF   ('&UNIC_TRE' EQ 'NO').L0026                              41150000
         AIF   ('&DSECT' EQ 'YES').L0027                                41200000
         AIF   ('&UNIC_TRE' NE 'YES').L0026                             41250000
UNIC_TRE DS    0F        TRE parameter block                            41300000
         AGO   .L0028                                                   41350000
.L0027   ANOP                                                           41400000
UNIC_TRE DSECT           TRE parameter block                            41450000
.L0028   ANOP                                                           41500000
UNIC_TRE_AREAADDR DS 1AL4 Address of the source/target area             41550000
UNIC_TRE_LENGTH DS 1FL4  Length of the source/target area               41600000
UNIC_TRE_TABLEADDR DS 1AL4 Address of the 256-byte translate table      41650000
         DS    1CL0003   Reserved                                       41700000
UNIC_TRE_TESTCHAR DS 1CL0001 Test character                             41750000
UNIC_TRE_AREAALET DS 1FL4 ALET to use to access the source/target      *41800000
                         area. Use 0 if not in AR mode                  41850000
         DS    1CL0004   Reserved                                       41900000
UNIC_TRE_TABLEALET DS 1FL4 ALET to use to access the translate table   *41950000
                         area. Use 0 if not in AR mode                  42000000
UNIC_TRE_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on          *42050000
                         doubleword boundary                            42100000
UNIC_TRE_WORKAREAALET DS 1FL4 ALET of workarea                          42150000
         DS    1CL0028                                                  42200000
UNIC_TRE_LEN EQU *-UNIC_TRE                                             42250000
.L0026   ANOP                                                           42300000
*                                                                       42350000
* ********************************************************************  42400000
* * CUUTF                                                            *  42450000
* ********************************************************************  42500000
*                                                                       42550000
*                                                                       42600000
         AIF   ('&UNIC_CUUTF' EQ 'NO').L0029                            42650000
         AIF   ('&DSECT' EQ 'YES').L002A                                42700000
         AIF   ('&UNIC_CUUTF' NE 'YES').L0029                           42750000
UNIC_CUUTF DS  0F        CUUTF parameter block                          42800000
         AGO   .L002B                                                   42850000
.L002A   ANOP                                                           42900000
UNIC_CUUTF DSECT         CUUTF parameter block                          42950000
.L002B   ANOP                                                           43000000
UNIC_CUUTF_TARGETADDR DS 1AL4 Address of the target area                43050000
UNIC_CUUTF_TARGETLEN DS 1FL4 Length of the target area                  43100000
UNIC_CUUTF_SOURCEADDR DS 1AL4 Address of the Source area                43150000
UNIC_CUUTF_SOURCELEN DS 1FL4 Length of the Source area                  43200000
UNIC_CUUTF_TARGETALET DS 1FL4 ALET to use to access the target area.   *43250000
                         Use 0 if not in AR mode                        43300000
         DS    1CL0004   Reserved                                       43350000
UNIC_CUUTF_SOURCEALET DS 1FL4 ALET to use to access the target area.   *43400000
                         Use 0 if not in AR mode                        43450000
UNIC_CUUTF_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *43500000
                         doubleword boundary                            43550000
UNIC_CUUTF_WORKAREAALET DS 1FL4 ALET of workarea                        43600000
         DS    1CL0028                                                  43650000
UNIC_CUUTF_LEN EQU *-UNIC_CUUTF                                         43700000
.L0029   ANOP                                                           43750000
*                                                                       43800000
* ********************************************************************  43850000
* * CUTFU                                                            *  43900000
* ********************************************************************  43950000
*                                                                       44000000
*                                                                       44050000
         AIF   ('&UNIC_CUTFU' EQ 'NO').L002C                            44100000
         AIF   ('&DSECT' EQ 'YES').L002D                                44150000
         AIF   ('&UNIC_CUTFU' NE 'YES').L002C                           44200000
UNIC_CUTFU DS  0F        CUTFU parameter block                          44250000
         AGO   .L002E                                                   44300000
.L002D   ANOP                                                           44350000
UNIC_CUTFU DSECT         CUTFU parameter block                          44400000
.L002E   ANOP                                                           44450000
UNIC_CUTFU_TARGETADDR DS 1AL4 Address of the target area                44500000
UNIC_CUTFU_TARGETLEN DS 1FL4 Length of the target area                  44550000
UNIC_CUTFU_SOURCEADDR DS 1AL4 Address of the Source area                44600000
UNIC_CUTFU_SOURCELEN DS 1FL4 Length of the Source area                  44650000
UNIC_CUTFU_TARGETALET DS 1FL4 ALET to use to access the target area.   *44700000
                         Use 0 if not in AR mode                        44750000
         DS    1CL0004   Reserved                                       44800000
UNIC_CUTFU_SOURCEALET DS 1FL4 ALET to use to access the target area.   *44850000
                         Use 0 if not in AR mode                        44900000
UNIC_CUTFU_WORKAREAADDR DS 1AL4 Address of 256-byte workarea on        *44950000
                         doubleword boundary                            45000000
UNIC_CUTFU_WORKAREAALET DS 1FL4 ALET of workarea                        45050000
         DS    1CL0028                                                  45100000
UNIC_CUTFU_LEN EQU *-UNIC_CUTFU                                         45150000
.L002C   ANOP                                                           45200000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 45250000
         AIF   ('&LIST' EQ 'YES').P4                                    45300000
.P3      ANOP                                                           45350000
         POP   PRINT                                                    45400000
.P4      ANOP                                                           45450000
.P_EXIT  ANOP                                                           45500000
         MEND                                                           45550000
**/ CSRYUNIC_2:;                                                        45600000
* %CSRYUNIC_INCLUDED = 'YES';                                           45650000
* %DCL ZCBPRINT CHAR EXT;                                               45700000
* %DEACTIVATE ZCBPRINT;                                                 45750000
* %DCL CSRYUNIC_LIST CHAR EXT;                                          45800000
* %DEACTIVATE CSRYUNIC_LIST;                                            45850000
* %IF CSRYUNIC_LIST ^= 'NO' &                                           45900000
*    ZCBPRINT ^= 'NO' %THEN                                             45950000
*   %GOTO CSRYUNIC_3;                                                   46000000
*   @LIST PUSH NOECHO;                                                  46050000
*   @LIST NOASSEMBLE NOECHO;                                            46100000
*   @LIST OFF C NOECHO;                                                 46150000
* %CSRYUNIC_3:;                                                         46200000
*/* Start of PL/X Source                                             */ 46250000
*                                                                       46300000
*DCL 1 UNIC_CONST BASED,                      /*                 @L1A*/ 46350000
*      2 * CHAR(0);                           /*                 @L1A*/ 46400000
*                                                                       46450000
*DCL UNIC_WORKAREA_LEN Constant(256);         /*                 @L1A*/ 46500000
*DCL UNIC_PBLOCK_LEN CONSTANT(64);            /*                 @L1A*/ 46550000
*                                                                       46600000
*/* CSRUNIC Return and Reason Code definitions                       */ 46650000
*DCL UNIC_MVCLU_RC_OpLengthsEqual BIT(32) Constant('00000000'X) ; /*    46700000
*                        Meaning: the operand lengths were the same     46750000
*                        Action: None required                       */ 46800000
*DCL UNIC_MVCLU_RC_TargetLengthShorter BIT(32) Constant('00000004'X)    46850000
*                        ; /*                                           46900000
*                        Meaning: The target operand was shorter than   46950000
*                        the source operand                             47000000
*                        Action: None required                       */ 47050000
*DCL UNIC_MVCLU_RC_TargetLengthLonger BIT(32) Constant('00000008'X)     47100000
*                        ; /*                                           47150000
*                        Meaning: The target operand was longer than    47200000
*                        the source operand                             47250000
*                        Action: None required                       */ 47300000
*DCL UNIC_MVCLU_RC_TargetLengthNotEven BIT(32) Constant('00000010'X)    47350000
*                        ; /*                                           47400000
*                        Meaning: The target operand was not an even    47450000
*                        number of bytes                                47500000
*                        Action: Only call CSRUNIC FUNCTION=MVCLU when  47550000
*                        the target operand is an even number of bytes  47600000
*                        (i.e., a whole number of unicode characters)   47650000
*                                                                    */ 47700000
*DCL UNIC_MVCLU_RC_SourceLengthNotEven BIT(32) Constant('00000014'X)    47750000
*                        ; /*                                           47800000
*                        Meaning: The source operand was not an even    47850000
*                        number of bytes                                47900000
*                        Action: Only call CSRUNIC FUNCTION=MVCLU when  47950000
*                        the source operand is an even number of bytes  48000000
*                        (i.e., a whole number of unicode characters)   48050000
*                                                                    */ 48100000
*DCL UNIC_MVCLU_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     48150000
*                        ; /*                                           48200000
*                        Meaning: The workarea provided was not on a    48250000
*                        doubleword boundary.                           48300000
*                        Action: Make sure that the workarea is on a    48350000
*                        doubleword boundary.                        */ 48400000
*DCL UNIC_CLCLU_RC_OperandsEqual BIT(32) Constant('00000000'X) ; /*     48450000
*                        Meaning: the two operands were equal           48500000
*                        Action: None required                       */ 48550000
*DCL UNIC_CLCLU_RC_LeftOpLessThanRight BIT(32) Constant('00000004'X)    48600000
*                        ; /*                                           48650000
*                        Meaning: The left operand was less than the    48700000
*                        right operand                                  48750000
*                        Action: None required                       */ 48800000
*DCL UNIC_CLCLU_RC_RightOpLessThanLeft BIT(32) Constant('00000008'X)    48850000
*                        ; /*                                           48900000
*                        Meaning: The right operand was less than the   48950000
*                        left operand                                   49000000
*                        Action: None required                       */ 49050000
*DCL UNIC_CLCLU_RC_LeftOpLengthNotEven BIT(32) Constant('00000010'X)    49100000
*                        ; /*                                           49150000
*                        Meaning: The left operand was not an even      49200000
*                        number of bytes                                49250000
*                        Action: Only call CSRUNIC FUNCTION=CLCLU when  49300000
*                        the left operand is an even number of bytes    49350000
*                        (i.e., a whole number of unicode characters)   49400000
*                                                                    */ 49450000
*DCL UNIC_CLCLU_RC_RightOpLengthNotEven BIT(32) Constant('00000014'X)   49500000
*                        ; /*                                           49550000
*                        Meaning: The right operand was not an even     49600000
*                        number of bytes                                49650000
*                        Action: Only call CSRUNIC FUNCTION=CLCLU when  49700000
*                        the right operand is an even number of bytes   49750000
*                        (i.e., a whole number of unicode characters)   49800000
*                                                                    */ 49850000
*DCL UNIC_CLCLU_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     49900000
*                        ; /*                                           49950000
*                        Meaning: The workarea provided was not on a    50000000
*                        doubleword boundary.                           50050000
*                        Action: Make sure that the workarea is on a    50100000
*                        doubleword boundary.                        */ 50150000
*DCL UNIC_TP_RC_Valid BIT(32) Constant('00000000'X) ; /*                50200000
*                        Meaning: the operand is a valid packed number  50250000
*                        Action: None required                       */ 50300000
*DCL UNIC_TP_RC_SignNotValid BIT(32) Constant('00000004'X) ; /*         50350000
*                        Meaning: The sign of the operand was not       50400000
*                        valid. All the digits were valid.              50450000
*                        Action: None required                       */ 50500000
*DCL UNIC_TP_RC_DigitNotValid BIT(32) Constant('00000008'X) ; /*        50550000
*                        Meaning: One or more digits of the operand     50600000
*                        were not valid. The sign was valid.            50650000
*                        Action: None required                       */ 50700000
*DCL UNIC_TP_RC_SignDigitNotValid BIT(32) Constant('0000000C'X) ; /*    50750000
*                        Meaning: The sign and one or more digits of    50800000
*                        the operand were not valid.                    50850000
*                        Action: None required                       */ 50900000
*DCL UNIC_TP_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /*   50950000
*                        Meaning: The workarea provided was not on a    51000000
*                        doubleword boundary.                           51050000
*                        Action: Make sure that the workarea is on a    51100000
*                        doubleword boundary.                        */ 51150000
*DCL UNIC_PKA_RC_OK BIT(32) Constant('00000000'X) ; /*                  51200000
*                        Meaning: The pack operation completed          51250000
*                        successfully                                   51300000
*                        Action: None required                       */ 51350000
*DCL UNIC_PKA_RC_SourceLengthNotValid BIT(32) Constant('00000014'X)     51400000
*                        ; /*                                           51450000
*                        Meaning: The length of the source operand      51500000
*                        exceeded 32 bytes (i.e., the LengthMinusOne    51550000
*                        exceeded 31)                                   51600000
*                        Action: Avoid calling CSRUNIC REQUEST=PKA for  51650000
*                        an operand longer than 32 bytes             */ 51700000
*DCL UNIC_PKA_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /*  51750000
*                        Meaning: The workarea provided was not on a    51800000
*                        doubleword boundary.                           51850000
*                        Action: Make sure that the workarea is on a    51900000
*                        doubleword boundary.                        */ 51950000
*DCL UNIC_PKU_RC_OK BIT(32) Constant('00000000'X) ; /*                  52000000
*                        Meaning: The pack operation completed          52050000
*                        successfully                                   52100000
*                        Action: None required                       */ 52150000
*DCL UNIC_PKU_RC_SourceLengthNotValid BIT(32) Constant('00000014'X)     52200000
*                        ; /*                                           52250000
*                        Meaning: The length of the source operand      52300000
*                        exceeded 64 bytes (i.e., the LengthMinusOne    52350000
*                        exceeded 63)                                   52400000
*                        Action: Avoid calling CSRUNIC REQUEST=PKU for  52450000
*                        an operand longer than 64 bytes             */ 52500000
*DCL UNIC_PKU_RC_SourceLengthNotEven BIT(32) Constant('00000024'X) ; /* 52550000
*                        Meaning: The source operand was not an even    52600000
*                        number of bytes                                52650000
*                        Action: Only call CSRUNIC FUNCTION=PKU when    52700000
*                        the source operand is an even number of bytes  52750000
*                        (i.e., a whole number of unicode characters)   52800000
*                                                                    */ 52850000
*DCL UNIC_PKU_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /*  52900000
*                        Meaning: The workarea provided was not on a    52950000
*                        doubleword boundary.                           53000000
*                        Action: Make sure that the workarea is on a    53050000
*                        doubleword boundary.                        */ 53100000
*DCL UNIC_UNPKA_RC_Positive BIT(32) Constant('00000000'X) ; /*          53150000
*                        Meaning: The operand represented a positive    53200000
*                        number                                         53250000
*                        Action: None required                       */ 53300000
*DCL UNIC_UNPKA_RC_Negative BIT(32) Constant('00000004'X) ; /*          53350000
*                        Meaning: The operand represented a negative    53400000
*                        number                                         53450000
*                        Action: None required                       */ 53500000
*DCL UNIC_UNPKA_RC_BadSign BIT(32) Constant('0000000C'X) ; /*           53550000
*                        Meaning: The operand did not have a valid sign 53600000
*                        Action: None required                       */ 53650000
*DCL UNIC_UNPKA_RC_TargetLengthNotValid BIT(32) Constant('00000014'X)   53700000
*                        ; /*                                           53750000
*                        Meaning: The length of the target operand      53800000
*                        exceeded 32 bytes (i.e., the LengthMinusOne    53850000
*                        exceeded 31)                                   53900000
*                        Action: Avoid calling CSRUNIC REQUEST=PKA for  53950000
*                        an operand longer than 32 bytes             */ 54000000
*DCL UNIC_UNPKA_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     54050000
*                        ; /*                                           54100000
*                        Meaning: The workarea provided was not on a    54150000
*                        doubleword boundary.                           54200000
*                        Action: Make sure that the workarea is on a    54250000
*                        doubleword boundary.                        */ 54300000
*DCL UNIC_UNPKU_RC_Positive BIT(32) Constant('00000000'X) ; /*          54350000
*                        Meaning: The operand represented a positive    54400000
*                        number                                         54450000
*                        Action: None required                       */ 54500000
*DCL UNIC_UNPKU_RC_Negative BIT(32) Constant('00000004'X) ; /*          54550000
*                        Meaning: The operand represented a negative    54600000
*                        number                                         54650000
*                        Action: None required                       */ 54700000
*DCL UNIC_UNPKU_RC_BadSign BIT(32) Constant('0000000C'X) ; /*           54750000
*                        Meaning: The operand did not have a valid sign 54800000
*                        Action: None required                       */ 54850000
*DCL UNIC_UNPKU_RC_TargetLengthNotValid BIT(32) Constant('00000014'X)   54900000
*                        ; /*                                           54950000
*                        Meaning: The length of the target operand      55000000
*                        exceeded 64 bytes (i.e., the LengthMinusOne    55050000
*                        exceeded 63)                                   55100000
*                        Action: Avoid calling CSRUNIC REQUEST=PKU for  55150000
*                        an operand longer than 64 bytes             */ 55200000
*DCL UNIC_UNPKU_RC_TargetLengthNotEven BIT(32) Constant('00000024'X)    55250000
*                        ; /*                                           55300000
*                        Meaning: The target operand was not an even    55350000
*                        number of bytes                                55400000
*                        Action: Only call CSRUNIC FUNCTION=UNPKU when  55450000
*                        the target operand is an even number of bytes  55500000
*                        (i.e., a whole number of unicode characters)   55550000
*                                                                    */ 55600000
*DCL UNIC_UNPKU_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     55650000
*                        ; /*                                           55700000
*                        Meaning: The workarea provided was not on a    55750000
*                        doubleword boundary.                           55800000
*                        Action: Make sure that the workarea is on a    55850000
*                        doubleword boundary.                        */ 55900000
*DCL UNIC_TRTT_RC_TestCharNotFound BIT(32) Constant('00000000'X) ; /*   55950000
*                        Meaning: The translation completed. The test   56000000
*                        character was not found.                       56050000
*                        Action: None required                       */ 56100000
*DCL UNIC_TRTT_RC_TestCharFound BIT(32) Constant('00000004'X) ; /*      56150000
*                        Meaning: The test character was found. The     56200000
*                        operation ended at that point.                 56250000
*                        Action: None required                       */ 56300000
*DCL UNIC_TRTT_RC_LengthNotEven BIT(32) Constant('00000010'X) ; /*      56350000
*                        Meaning: The operand was not an even number of 56400000
*                        bytes                                          56450000
*                        Action: Only call CSRUNIC FUNCTION=TRTT when   56500000
*                        the operand is an even number of bytes (i.e.,  56550000
*                        a whole number of unicode characters)       */ 56600000
*DCL UNIC_TRTT_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /* 56650000
*                        Meaning: The workarea provided was not on a    56700000
*                        doubleword boundary.                           56750000
*                        Action: Make sure that the workarea is on a    56800000
*                        doubleword boundary.                        */ 56850000
*DCL UNIC_TRTT_RC_TableNotAligned BIT(32) Constant('00000020'X) ; /*    56858300
*                        Meaning: The table provided was not on a page  56866600
*                        boundary.                                      56874900
*                        Action: Make sure that the table is on a page  56883200
*                        boundary.                                   */ 56891500
*DCL UNIC_TRTO_RC_TestCharNotFound BIT(32) Constant('00000000'X) ; /*   56900000
*                        Meaning: The translation completed. The test   56950000
*                        character was not found.                       57000000
*                        Action: None required                       */ 57050000
*DCL UNIC_TRTO_RC_TestCharFound BIT(32) Constant('00000004'X) ; /*      57100000
*                        Meaning: The test character was found. The     57150000
*                        operation ended at that point.                 57200000
*                        Action: None required                       */ 57250000
*DCL UNIC_TRTO_RC_LengthNotEven BIT(32) Constant('00000010'X) ; /*      57300000
*                        Meaning: The operand was not an even number of 57350000
*                        bytes                                          57400000
*                        Action: Only call CSRUNIC FUNCTION=TRTO when   57450000
*                        the operand is an even number of bytes (i.e.,  57500000
*                        a whole number of unicode characters)       */ 57550000
*DCL UNIC_TRTO_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /* 57600000
*                        Meaning: The workarea provided was not on a    57650000
*                        doubleword boundary.                           57700000
*                        Action: Make sure that the workarea is on a    57750000
*                        doubleword boundary.                        */ 57800000
*DCL UNIC_TRTO_RC_TableNotAligned BIT(32) Constant('00000020'X) ; /*    57808300
*                        Meaning: The table provided was not on a page  57816600
*                        boundary.                                      57824900
*                        Action: Make sure that the table is on a page  57833200
*                        boundary.                                   */ 57841500
*DCL UNIC_TROT_RC_TestCharNotFound BIT(32) Constant('00000000'X) ; /*   57850000
*                        Meaning: The translation completed. The test   57900000
*                        character was not found.                       57950000
*                        Action: None required                       */ 58000000
*DCL UNIC_TROT_RC_TestCharFound BIT(32) Constant('00000004'X) ; /*      58050000
*                        Meaning: The test character was found. The     58100000
*                        operation ended at that point.                 58150000
*                        Action: None required                       */ 58200000
*DCL UNIC_TROT_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /* 58250000
*                        Meaning: The workarea provided was not on a    58300000
*                        doubleword boundary.                           58350000
*                        Action: Make sure that the workarea is on a    58400000
*                        doubleword boundary.                        */ 58408300
*DCL UNIC_TROT_RC_TableNotAligned BIT(32) Constant('00000020'X) ; /*    58416600
*                        Meaning: The table provided was not on a       58424900
*                        doubleword boundary.                           58433200
*                        Action: Make sure that the table is on a       58441500
*                        doubleword boundary.                        */ 58450000
*DCL UNIC_TROO_RC_TestCharNotFound BIT(32) Constant('00000000'X) ; /*   58500000
*                        Meaning: The translation completed. The test   58550000
*                        character was not found.                       58600000
*                        Action: None required                       */ 58650000
*DCL UNIC_TROO_RC_TestCharFound BIT(32) Constant('00000004'X) ; /*      58700000
*                        Meaning: The test character was found. The     58750000
*                        operation ended at that point.                 58800000
*                        Action: None required                       */ 58850000
*DCL UNIC_TROO_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /* 58900000
*                        Meaning: The workarea provided was not on a    58950000
*                        doubleword boundary.                           59000000
*                        Action: Make sure that the workarea is on a    59050000
*                        doubleword boundary.                        */ 59058300
*DCL UNIC_TROO_RC_TableNotAligned BIT(32) Constant('00000020'X) ; /*    59066600
*                        Meaning: The table provided was not on a       59074900
*                        doubleword boundary.                           59083200
*                        Action: Make sure that the table is on a       59091500
*                        doubleword boundary.                        */ 59100000
*DCL UNIC_TRE_RC_TestCharNotFound BIT(32) Constant('00000000'X) ; /*    59150000
*                        Meaning: The translation completed. The test   59200000
*                        character was not found.                       59250000
*                        Action: None required                       */ 59300000
*DCL UNIC_TRE_RC_TestCharFound BIT(32) Constant('00000004'X) ; /*       59350000
*                        Meaning: The test character was found. The     59400000
*                        operation ended at that point.                 59450000
*                        Action: None required                       */ 59500000
*DCL UNIC_TRE_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X) ; /*  59550000
*                        Meaning: The workarea provided was not on a    59600000
*                        doubleword boundary.                           59650000
*                        Action: Make sure that the workarea is on a    59700000
*                        doubleword boundary.                        */ 59750000
*DCL UNIC_CUUTF_RC_SourceExhausted BIT(32) Constant('00000000'X) ; /*   59800000
*                        Meaning: All unicode characters in the source  59850000
*                        were converted to their UTF-8 equivalents.     59900000
*                        Action: None required                       */ 59950000
*DCL UNIC_CUUTF_RC_TargetExhausted BIT(32) Constant('00000004'X) ; /*   60000000
*                        Meaning: The target operand did not have       60050000
*                        enough room to hold the UTF-8 equivalents of   60100000
*                        all of the source unicode characters.          60150000
*                        Action: Provide a larger target area.       */ 60200000
*DCL UNIC_CUUTF_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     60250000
*                        ; /*                                           60300000
*                        Meaning: The workarea provided was not on a    60350000
*                        doubleword boundary.                           60400000
*                        Action: Make sure that the workarea is on a    60450000
*                        doubleword boundary.                        */ 60500000
*DCL UNIC_CUTFU_RC_SourceExhausted BIT(32) Constant('00000000'X) ; /*   60550000
*                        Meaning: All UTF-8 characters in the source    60600000
*                        were converted to their unicode equivalents.   60650000
*                        Action: None required                       */ 60700000
*DCL UNIC_CUTFU_RC_TargetExhausted BIT(32) Constant('00000004'X) ; /*   60750000
*                        Meaning: The target operand did not have       60800000
*                        enough room to hold the unicode equivalents of 60850000
*                        all of the source UTF-8 characters.            60900000
*                        Action: Provide a larger target area.       */ 60950000
*DCL UNIC_CUTFU_RC_BadUtf8Char BIT(32) Constant('00000008'X) ; /*       61000000
*                        Meaning: A character in the source operand was 61050000
*                        not a valid UTF-8 character.                   61100000
*                        Action: Make sure that the source operand      61150000
*                        contains only valid UTF-8 characters.       */ 61200000
*DCL UNIC_CUTFU_RC_WorkareaNotAligned BIT(32) Constant('0000001C'X)     61250000
*                        ; /*                                           61300000
*                        Meaning: The workarea provided was not on a    61350000
*                        doubleword boundary.                           61400000
*                        Action: Make sure that the workarea is on a    61450000
*                        doubleword boundary.                        */ 61500000
*/* End of CSRUNIC Return and Reason Code definitions                */ 61550000
*/********************************************************************/ 61600000
*/* MVCLU                                                            */ 61650000
*/********************************************************************/ 61700000
*DCL 1 UNIC_MVCLU CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       61750000
*                 BASED,    /* MVCLU parameter block             @L1A*/ 61800000
*     2 UNIC_MVCLU_TargetAddr PTR(31),  /* Address of the target        61850000
*                             area                               @L1A*/ 61900000
*     2 UNIC_MVCLU_TargetLen Fixed(32), /* Length of the target         61950000
*                             area                               @L1A*/ 62000000
*     2 UNIC_MVCLU_SourceAddr PTR(31),  /* Address of the Source        62300000
*                             area                               @L1A*/ 62350000
*     2 UNIC_MVCLU_SourceLen Fixed(32), /* Length of the Source         62400000
*                             area                               @L1A*/ 62450000
*     2 UNIC_MVCLU_TargetALET Fixed(32),/* ALET to use to access        62750000
*                             the target area. Use 0 if not in          62800000
*                             AR mode                            @L1A*/ 62850000
*     2 UNIC_MVCLU_PadChar CHAR(2),     /* Unicode PAD character        62900000
*                                                                @L1A*/ 62950000
*     2 * CHAR(2),                       /* Reserved             @L1A*/ 63000000
*     2 UNIC_MVCLU_SourceALET Fixed(32),/* ALET to use to access        63050000
*                             the target area. Use 0 if not in          63100000
*                             AR mode                            @L1A*/ 63150000
*     2 UNIC_MVCLU_WorkareaAddr PTR(31), /* Address of 256-byte         63200000
*                                           workarea on doubleword      63250000
*                                           boundary             @L1A*/ 63300000
*     2 UNIC_MVCLU_WorkareaALET Fixed(32), /* ALET of workarea          63600000
*                                                                @L1A*/ 63650000
*     2 * CHAR(7*4),                                          /* @L1A*/ 63700000
*     2 * CHAR(0);                                                      63750000
*                                                                       63800000
*                                                                       63850000
*/********************************************************************/ 63900000
*/* CLCLU                                                            */ 63950000
*/********************************************************************/ 64000000
*DCL 1 UNIC_CLCLU CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       64050000
*                 BASED,    /* CLCLU parameter block             @L1A*/ 64100000
*     2 UNIC_CLCLU_LeftOpAddr PTR(31),  /* Address of the target        64150000
*                             area                               @L1A*/ 64200000
*     2 UNIC_CLCLU_LeftOpLen Fixed(32), /* Length of the target         64250000
*                             area                               @L1A*/ 64300000
*     2 UNIC_CLCLU_RightOpAddr PTR(31), /* Address of the Source        64600000
*                             area                               @L1A*/ 64650000
*     2 UNIC_CLCLU_RightOpLen Fixed(32), /* Length of the Source        64700000
*                             area                               @L1A*/ 64750000
*     2 UNIC_CLCLU_LeftOpALET Fixed(32),/* ALET to use to access        65050000
*                             the target area. Use 0 if not in          65100000
*                             AR mode                            @L1A*/ 65150000
*     2 UNIC_CLCLU_PadChar CHAR(2),     /* Unicode PAD character        65200000
*                                                                @L1A*/ 65250000
*     2 * CHAR(2),                       /* Reserved             @L1A*/ 65300000
*     2 UNIC_CLCLU_RightOpALET Fixed(32),/* ALET to use to access       65350000
*                             the target area. Use 0 if not in          65400000
*                             AR mode                            @L1A*/ 65450000
*     2 UNIC_CLCLU_WorkareaAddr PTR(31), /* Address of 256-byte         65500000
*                                           workarea on doubleword      65550000
*                                           boundary             @L1A*/ 65600000
*     2 UNIC_CLCLU_WorkareaALET Fixed(32), /* ALET of workarea          65900000
*                                                                @L1A*/ 65950000
*     2 * CHAR(7*4),                                          /* @L1A*/ 66000000
*     2 * CHAR(0);                                                      66050000
*                                                                       66100000
*/********************************************************************/ 66150000
*/* TP                                                               */ 66200000
*/********************************************************************/ 66250000
*DCL 1 UNIC_TP CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                          66300000
*                 BASED,    /* TP parameter block                @L1A*/ 66350000
*     2 UNIC_TP_AreaAddr PTR(31),          /* Address of the area       66400000
*                             to be tested                       @L1A*/ 66450000
*     2 UNIC_TP_LenMinusOne Fixed(31),  /* Length minus one of the      66500000
*                             area                               @L1A*/ 66550000
*     2 UNIC_TP_AreaALET FIXED(32),        /* ALET of the area to be    66600000
*                             tested. Use 0 if not in AR-mode.   @L1A*/ 66650000
*     2 UNIC_TP_WorkareaAddr PTR(31), /* Address of 256-byte            66700000
*                                           workarea on doubleword      66750000
*                                           boundary             @L1A*/ 66800000
*     2 UNIC_TP_WorkareaALET Fixed(32), /* ALET of workarea             67100000
*                                                                @L1A*/ 67150000
*     2 * CHAR(10*4),                                         /* @L1A*/ 67200000
*     2 * CHAR(0);                                                      67250000
*                                                                       67300000
*/********************************************************************/ 67350000
*/* PKA                                                              */ 67400000
*/********************************************************************/ 67450000
*DCL 1 UNIC_PKA CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                         67500000
*                 BASED,    /* PKA parameter block               @L1A*/ 67550000
*     2 UNIC_PKA_TargetAddr PTR(31),    /* Address of the target        67600000
*                             area                               @L1A*/ 67650000
*     2 UNIC_PKA_SourceLenMinusOne FIXED(31),  /* Length minus one      67700000
*                             of the source area                 @L1A*/ 67750000
*     2 UNIC_PKA_SourceAddr PTR(31),    /* Address of the Source        67800000
*                             area                               @L1A*/ 67850000
*     2 UNIC_PKA_TargetALET PTR(31),    /* ALET of the target           67900000
*                             area                               @L1A*/ 67950000
*     2 * CHAR(4),                                            /* @L1A*/ 68000000
*     2 UNIC_PKA_SourceALET FIXED(32),  /* ALET of the source           68050000
*                             area                               @L1A*/ 68100000
*     2 UNIC_PKA_WorkareaAddr PTR(31), /* Address of 256-byte           68150000
*                                           workarea on doubleword      68200000
*                                           boundary             @L1A*/ 68250000
*     2 UNIC_PKA_WorkareaALET Fixed(32), /* ALET of workarea            68550000
*                                                                @L1A*/ 68600000
*     2 * CHAR(8*4),                                          /* @L1A*/ 68650000
*     2 * CHAR(0);                                                      68700000
*                                                                       68750000
*                                                                       68800000
*/********************************************************************/ 68850000
*/* PKU                                                              */ 68900000
*/********************************************************************/ 68950000
*DCL 1 UNIC_PKU CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                         69000000
*                 BASED,    /* PKU parameter block               @L1A*/ 69050000
*     2 UNIC_PKU_TargetAddr PTR(31),    /* Address of the target        69100000
*                             area                               @L1A*/ 69150000
*     2 UNIC_PKU_SourceLenMinusOne FIXED(31),  /* Length minus one      69200000
*                             of the target area                 @L1A*/ 69250000
*     2 UNIC_PKU_SourceAddr PTR(31),    /* Address of the Source        69600000
*                             area                               @L1A*/ 69650000
*     2 UNIC_PKU_TargetALET PTR(31),    /* ALET of the target           69700000
*                             area                               @L1A*/ 69750000
*     2 * CHAR(4),                                            /* @L1A*/ 69800000
*     2 UNIC_PKU_SourceALET FIXED(32),  /* ALET of the source           69850000
*                             area                               @L1A*/ 69900000
*     2 UNIC_PKU_WorkareaAddr PTR(31), /* Address of 256-byte           69950000
*                                           workarea on doubleword      70000000
*                                           boundary             @L1A*/ 70050000
*     2 UNIC_PKU_WorkareaALET Fixed(32), /* ALET of workarea            70350000
*                                                                @L1A*/ 70400000
*     2 * CHAR(8*4),                                          /* @L1A*/ 70450000
*     2 * CHAR(0);                                                      70500000
*                                                                       70550000
*                                                                       70600000
*/********************************************************************/ 70650000
*/* UNPKA                                                            */ 70700000
*/********************************************************************/ 70750000
*DCL 1 UNIC_UNPKA CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       70800000
*                 BASED,    /* UNPKA parameter block             @L1A*/ 70850000
*     2 UNIC_UNPKA_TargetAddr PTR(31),  /* Address of the target        70900000
*                             area                               @L1A*/ 70950000
*     2 UNIC_UNPKA_TargetLenMinusOne FIXED(31), /* Length minus one     71000000
*                             of the target area                 @L1A*/ 71050000
*     2 UNIC_UNPKA_SourceAddr PTR(31),  /* Address of the Source        71100000
*                             area                               @L1A*/ 71150000
*     2 UNIC_UNPKA_TargetALET PTR(31),  /* ALET of the target           71200000
*                             area                               @L1A*/ 71250000
*     2 * CHAR(4),                                            /* @L1A*/ 71300000
*     2 UNIC_UNPKA_SourceALET FIXED(32), /* ALET of the source          71350000
*                             area                               @L1A*/ 71400000
*     2 UNIC_UNPKA_WorkareaAddr PTR(31), /* Address of 256-byte         71450000
*                                           workarea on doubleword      71500000
*                                           boundary             @L1A*/ 71550000
*     2 UNIC_UNPKA_WorkareaALET Fixed(32), /* ALET of workarea          71850000
*                                                                @L1A*/ 71900000
*     2 * CHAR(8*4),                                          /* @L1A*/ 71950000
*     2 * CHAR(0);                                                      72000000
*                                                                       72050000
*/********************************************************************/ 72100000
*/* UNPKU                                                            */ 72150000
*/********************************************************************/ 72200000
*DCL 1 UNIC_UNPKU CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       72250000
*                 BASED,    /* UNPKU parameter block             @L1A*/ 72300000
*     2 UNIC_UNPKU_TargetAddr PTR(31),  /* Address of the target        72350000
*                             area                               @L1A*/ 72400000
*     2 UNIC_UNPKU_TargetLenMinusOne FIXED(31), /* Length minus one     72450000
*                             of the target area                 @L1A*/ 72500000
*     2 UNIC_UNPKU_SourceAddr PTR(31),  /* Address of the Source        72800000
*                             area                               @L1A*/ 72850000
*     2 UNIC_UNPKU_TargetALET PTR(31),  /* ALET of the target           72900000
*                             area                               @L1A*/ 72950000
*     2 * CHAR(4),                                            /* @L1A*/ 73000000
*     2 UNIC_UNPKU_SourceALET FIXED(32), /* ALET of the source          73050000
*                             area                               @L1A*/ 73100000
*     2 UNIC_UNPKU_WorkareaAddr PTR(31), /* Address of 256-byte         73150000
*                                           workarea on doubleword      73200000
*                                           boundary             @L1A*/ 73250000
*     2 UNIC_UNPKU_WorkareaALET Fixed(32), /* ALET of workarea          73550000
*                                                                @L1A*/ 73600000
*     2 * CHAR(8*4),                                          /* @L1A*/ 73650000
*     2 * CHAR(0);                                                      73700000
*                                                                       73750000
*/********************************************************************/ 73800000
*/* TRTT                                                             */ 73850000
*/********************************************************************/ 73900000
*DCL 1 UNIC_TRTT CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                        73950000
*                 BASED,    /* TRTT parameter block              @L1A*/ 74000000
*     2 UNIC_TRTT_TableAddr PTR(31),    /* Address of the 128K          74050000
*                             translate table.                          74083300
*                             It must be on a page boundary.     @L1A*/ 74116600
*     2 UNIC_TRTT_TargetAddr PTR(31),   /* Address of the target        74150000
*                             area                               @L1A*/ 74200000
*     2 UNIC_TRTT_LENGTH Fixed(32), /* Length of the source and         74250000
*                             target areas                       @L1A*/ 74300000
*     2 UNIC_TRTT_SourceAddr PTR(31),   /* Address of the Source        74600000
*                             area                               @L1A*/ 74650000
*     2 UNIC_TRTT_TableALET Fixed(32),/* ALET to use to access          74700000
*                             the translate table area. Use 0 if not    74750000
*                             in AR mode                         @L1A*/ 74800000
*     2 UNIC_TRTT_TargetALET Fixed(32),/* ALET to use to access         74850000
*                             the target area. Use 0 if not in          74900000
*                             AR mode                            @L1A*/ 74950000
*     2 UNIC_TRTT_TestChar CHAR(2),     /* Unicode test character       75000000
*                                                                @L1A*/ 75050000
*     2 * CHAR(2),                       /* Reserved             @L1A*/ 75100000
*     2 UNIC_TRTT_SourceALET Fixed(32),/* ALET to use to access         75150000
*                             the target area. Use 0 if not in          75200000
*                             AR mode                            @L1A*/ 75250000
*     2 UNIC_TRTT_WorkareaAddr PTR(31), /* Address of 256-byte          75300000
*                                           workarea on doubleword      75350000
*                                           boundary             @L1A*/ 75400000
*     2 UNIC_TRTT_WorkareaALET Fixed(32), /* ALET of workarea           75700000
*                                                                @L1A*/ 75750000
*     2 * CHAR(6*4),                                          /* @L1A*/ 75800000
*     2 * CHAR(0);                                                      75850000
*                                                                       75900000
*/********************************************************************/ 75950000
*/* TRTO                                                             */ 76000000
*/********************************************************************/ 76050000
*DCL 1 UNIC_TRTO CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                        76100000
*                 BASED,    /* TRTO parameter block              @L1A*/ 76150000
*     2 UNIC_TRTO_TableAddr PTR(31),    /* Address of the 64K           76200000
*                             translate table.                          76233300
*                             It must be on a page boundary.     @L1A*/ 76266600
*     2 UNIC_TRTO_TargetAddr PTR(31),   /* Address of the target        76300000
*                             area                               @L1A*/ 76350000
*     2 UNIC_TRTO_LENGTH Fixed(32), /*                                  76383300
*                             Length of the source area in bytes.       76416600
*                             This is twice the length of the target    76450000
*                             area.                              @L1A*/ 76500000
*     2 UNIC_TRTO_SourceAddr PTR(31),   /* Address of the Source        76800000
*                             area                               @L1A*/ 76850000
*     2 UNIC_TRTO_TableALET Fixed(32),/* ALET to use to access          76900000
*                             the translate table area. Use 0 if not    76950000
*                             in AR mode                         @L1A*/ 77000000
*     2 UNIC_TRTO_TargetALET Fixed(32),/* ALET to use to access         77050000
*                             the target area. Use 0 if not in          77100000
*                             AR mode                            @L1A*/ 77150000
*     2 UNIC_TRTO_TestChar CHAR(1),     /* Test character               77200000
*                                                                @L1A*/ 77250000
*     2 * CHAR(3),                       /* Reserved             @L1A*/ 77300000
*     2 UNIC_TRTO_SourceALET Fixed(32),/* ALET to use to access         77350000
*                             the target area. Use 0 if not in          77400000
*                             AR mode                            @L1A*/ 77450000
*     2 UNIC_TRTO_WorkareaAddr PTR(31), /* Address of 256-byte          77500000
*                                           workarea on doubleword      77550000
*                                           boundary             @L1A*/ 77600000
*     2 UNIC_TRTO_WorkareaALET Fixed(32), /* ALET of workarea           77900000
*                                                                @L1A*/ 77950000
*     2 * CHAR(6*4),                                          /* @L1A*/ 78000000
*     2 * CHAR(0);                                                      78050000
*                                                                       78100000
*/********************************************************************/ 78150000
*/* TROT                                                             */ 78200000
*/********************************************************************/ 78250000
*DCL 1 UNIC_TROT CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                        78300000
*                 BASED,    /* TROT parameter block              @L1A*/ 78350000
*     2 UNIC_TROT_TableAddr PTR(31),    /* Address of the 512-byte      78391600
*                             translate table. It must be on a          78433300
*                             doubleword boundary.               @L1A*/ 78466600
*     2 UNIC_TROT_TargetAddr PTR(31),   /* Address of the target        78500000
*                             area                               @L1A*/ 78550000
*     2 UNIC_TROT_LENGTH Fixed(32), /*                                  78583300
*                             Length of the source area in bytes.       78616600
*                             This is half the length of the target     78650000
*                             area.                              @L1A*/ 78700000
*     2 UNIC_TROT_SourceAddr PTR(31),   /* Address of the Source        78750000
*                             area                               @L1A*/ 78800000
*     2 UNIC_TROT_TableALET Fixed(32),/* ALET to use to access          78850000
*                             the translate table area. Use 0 if not    78900000
*                             in AR mode                         @L1A*/ 78950000
*     2 UNIC_TROT_TargetALET Fixed(32),/* ALET to use to access         79000000
*                             the target area. Use 0 if not in          79050000
*                             AR mode                            @L1A*/ 79100000
*     2 UNIC_TROT_TestChar CHAR(2),     /* Unicode test character       79150000
*                                                                @L1A*/ 79200000
*     2 * CHAR(2),                       /* Reserved             @L1A*/ 79250000
*     2 UNIC_TROT_SourceALET Fixed(32),/* ALET to use to access         79300000
*                             the target area. Use 0 if not in          79350000
*                             AR mode                            @L1A*/ 79400000
*     2 UNIC_TROT_WorkareaAddr PTR(31), /* Address of 256-byte          79450000
*                                           workarea on doubleword      79500000
*                                           boundary             @L1A*/ 79550000
*     2 UNIC_TROT_WorkareaALET Fixed(32), /* ALET of workarea           79850000
*                                                                @L1A*/ 79900000
*     2 * CHAR(6*4),                                          /* @L1A*/ 79950000
*     2 * CHAR(0);                                                      80000000
*                                                                       80050000
*/********************************************************************/ 80100000
*/* TROO                                                             */ 80150000
*/********************************************************************/ 80200000
*DCL 1 UNIC_TROO CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                        80250000
*                 BASED,    /* TROO parameter block              @L1A*/ 80300000
*     2 UNIC_TROO_TableAddr PTR(31),    /* Address of the 256-byte      80350000
*                             translate table. It must be on a          80383300
*                             doubleword boundary.               @L1A*/ 80416600
*     2 UNIC_TROO_TargetAddr PTR(31),   /* Address of the target        80450000
*                             area                               @L1A*/ 80500000
*     2 UNIC_TROO_LENGTH Fixed(32), /* Length of the source and         80550000
*                             target areas in bytes              @L1A*/ 80600000
*     2 UNIC_TROO_SourceAddr PTR(31),   /* Address of the Source        80650000
*                             area                               @L1A*/ 80700000
*     2 UNIC_TROO_TableALET Fixed(32),/* ALET to use to access          80750000
*                             the translate table area. Use 0 if not    80800000
*                             in AR mode                         @L1A*/ 80850000
*     2 UNIC_TROO_TargetALET Fixed(32),/* ALET to use to access         80900000
*                             the target area. Use 0 if not in          80950000
*                             AR mode                            @L1A*/ 81000000
*     2 UNIC_TROO_TestChar CHAR(1),     /* Test character               81050000
*                                                                @L1A*/ 81100000
*     2 * CHAR(3),                       /* Reserved             @L1A*/ 81150000
*     2 UNIC_TROO_SourceALET Fixed(32),/* ALET to use to access         81200000
*                             the target area. Use 0 if not in          81250000
*                             AR mode                            @L1A*/ 81300000
*     2 UNIC_TROO_WorkareaAddr PTR(31), /* Address of 256-byte          81350000
*                                           workarea on doubleword      81400000
*                                           boundary             @L1A*/ 81450000
*     2 UNIC_TROO_WorkareaALET Fixed(32), /* ALET of workarea           81750000
*                                                                @L1A*/ 81800000
*     2 * CHAR(6*4),                                          /* @L1A*/ 81850000
*     2 * CHAR(0);                                                      81900000
*                                                                       81950000
*/********************************************************************/ 82000000
*/* TRE                                                              */ 82050000
*/********************************************************************/ 82100000
*DCL 1 UNIC_TRE CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                         82150000
*                 BASED,    /* TRE parameter block               @L1A*/ 82200000
*     2 UNIC_TRE_AreaAddr PTR(31),    /* Address of the source/target   82250000
*                             area                               @L1A*/ 82300000
*     2 UNIC_TRE_LENGTH Fixed(32), /* Length of the source/target area  82350000
*                                                                @L1A*/ 82400000
*     2 UNIC_TRE_TableAddr PTR(31),     /* Address of the 256-byte      82450000
*                             translate table                    @L1A*/ 82500000
*     2 * CHAR(3),                       /* Reserved             @L1A*/ 82550000
*     2 UNIC_TRE_TestChar CHAR(1),      /* Test character               82600000
*                                                                @L1A*/ 82650000
*     2 UNIC_TRE_AreaALET Fixed(32),/* ALET to use to access            82700000
*                             the source/target area. Use 0 if not in   82750000
*                             AR mode                            @L1A*/ 82800000
*     2 * CHAR(4),                       /* Reserved             @L1A*/ 82850000
*     2 UNIC_TRE_TableALET Fixed(32),/* ALET to use to access           82900000
*                             the translate table area. Use 0 if not    82950000
*                             in AR mode                         @L1A*/ 83000000
*     2 UNIC_TRE_WorkareaAddr PTR(31), /* Address of 256-byte           83050000
*                                           workarea on doubleword      83100000
*                                           boundary             @L1A*/ 83150000
*     2 UNIC_TRE_WorkareaALET Fixed(32), /* ALET of workarea            83450000
*                                                                @L1A*/ 83500000
*     2 * CHAR(7*4),                                          /* @L1A*/ 83550000
*     2 * CHAR(0);                                                      83600000
*                                                                       83650000
*/********************************************************************/ 83700000
*/* CUUTF                                                            */ 83750000
*/********************************************************************/ 83800000
*DCL 1 UNIC_CUUTF CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       83850000
*                 BASED,    /* CUUTF parameter block             @L1A*/ 83900000
*     2 UNIC_CUUTF_TargetAddr PTR(31),  /* Address of the target        83950000
*                             area                               @L1A*/ 84000000
*     2 UNIC_CUUTF_TargetLen Fixed(32), /* Length of the target         84050000
*                             area                               @L1A*/ 84100000
*     2 UNIC_CUUTF_SourceAddr PTR(31),  /* Address of the Source        84150000
*                             area                               @L1A*/ 84200000
*     2 UNIC_CUUTF_SourceLen Fixed(32), /* Length of the Source         84250000
*                             area                               @L1A*/ 84300000
*     2 UNIC_CUUTF_TargetALET Fixed(32),/* ALET to use to access        84350000
*                             the target area. Use 0 if not in          84400000
*                             AR mode                            @L1A*/ 84450000
*     2 * CHAR(4),                      /* Reserved              @L1A*/ 84500000
*     2 UNIC_CUUTF_SourceALET Fixed(32),/* ALET to use to access        84550000
*                             the target area. Use 0 if not in          84600000
*                             AR mode                            @L1A*/ 84650000
*     2 UNIC_CUUTF_WorkareaAddr PTR(31), /* Address of 256-byte         84700000
*                                           workarea on doubleword      84750000
*                                           boundary             @L1A*/ 84800000
*     2 UNIC_CUUTF_WorkareaALET Fixed(32), /* ALET of workarea          85100000
*                                                                @L1A*/ 85150000
*     2 * CHAR(7*4),                                          /* @L1A*/ 85200000
*     2 * CHAR(0);                                                      85250000
*                                                                       85300000
*/********************************************************************/ 85350000
*/* CUTFU                                                            */ 85400000
*/********************************************************************/ 85450000
*DCL 1 UNIC_CUTFU CHAR(UNIC_PBLOCK_LEN) BDY(WORD)                       85500000
*                 BASED,    /* CUTFU parameter block             @L1A*/ 85550000
*     2 UNIC_CUTFU_TargetAddr PTR(31),  /* Address of the target        85600000
*                             area                               @L1A*/ 85650000
*     2 UNIC_CUTFU_TargetLen Fixed(32), /* Length of the target         85700000
*                             area                               @L1A*/ 85750000
*     2 UNIC_CUTFU_SourceAddr PTR(31),  /* Address of the Source        85800000
*                             area                               @L1A*/ 85850000
*     2 UNIC_CUTFU_SourceLen Fixed(32), /* Length of the Source         85900000
*                             area                               @L1A*/ 85950000
*     2 UNIC_CUTFU_TargetALET Fixed(32),/* ALET to use to access        86000000
*                             the target area. Use 0 if not in          86050000
*                             AR mode                            @L1A*/ 86100000
*     2 * CHAR(4),                      /* Reserved              @L1A*/ 86150000
*     2 UNIC_CUTFU_SourceALET Fixed(32),/* ALET to use to access        86200000
*                             the target area. Use 0 if not in          86250000
*                             AR mode                            @L1A*/ 86300000
*     2 UNIC_CUTFU_WorkareaAddr PTR(31), /* Address of 256-byte         86350000
*                                           workarea on doubleword      86400000
*                                           boundary             @L1A*/ 86450000
*     2 UNIC_CUTFU_WorkareaALET Fixed(32), /* ALET of workarea          86750000
*                                                                @L1A*/ 86800000
*     2 * CHAR(7*4),                                          /* @L1A*/ 86850000
*     2 * CHAR(0);                                                      86900000
*                                                                       86950000
* @LOGIC;                                                               87000000
* #PRAGMA TOOL=CBGEN.                                                   87050000
* #USEORG.                                                              87100000
* #EPRAGMA.                                                             88250000
* @ENDLOGIC;                                                            88300000
*/* End of PL/X Source                                               */ 88350000
* %IF CSRYUNIC_LIST ^= 'NO' &                                           88400000
*    ZCBPRINT ^= 'NO' %THEN                                             88450000
*   %GOTO CSRYUNIC_4;                                                   88500000
*   @LIST POP NOECHO;                                                   88550000
* %CSRYUNIC_4:;                                                         88600000
* %END;                                                                 88650000
