         MACRO                                                          03000003
&NAME    CST   &DL,&A                   COMPARE WR TO TABLE & SET M/P   06000003
         GBLA  &DISP,&VAL3890(250)                             @ZA00766 07000003
         GBLC  &LBL1,&DEF3890(250)                             @ZA00766 08000003
         LCLA  &LD,&RL,&M                                      @ZA00766 09000003
         LCLC  &LABEL                                          @ZA00766 10000003
&M       SETA  1                                               @ZA00766 11000003
         AIF   (N'&DL EQ 1).CS3                                         12000003
         AIF   ('&DL(1)' LT '16').CS1                                   15000003
         MNOTE 12,'***  IHB349  DISPLACEMENT NOT 0-15 DIGITS'           19000003
.CS1     AIF   ('&DL(2)' NE '0' AND '&DL(2)' LT '17').CS2               21000003
         MNOTE 12,'***  IHB350  LENGTH NOT 1-16 DIGITS'                 24000003
.CS2     ANOP                                                           27000003
&LD      SETA  16*&DL(1)+&DL(2)-1                                       30000003
&NAME    DC    0H'0',X'5C',AL1(&LD),AL2(&A-&LBL1+&DISP)                 33000003
         AGO   .END                                                     36000003
.CS3     ANOP                                                           39000003
.CS7     AIF   (&M GT 250).CS8                                 @ZA00766 39300003
&LABEL   SETC  '&DEF3890(&M)'                                  @ZA00766 39600003
.CS5     AIF   ('&DL'   EQ '&LABEL').CS6                       @ZA00766 39900003
&M       SETA  &M+1                                            @ZA00766 40200003
         AGO   .CS7                                            @ZA00766 40500003
.CS8     ANOP                                                  @ZA00766 40800003
         MNOTE 12,'***   IHB425 &DL NOT EQUATED IN DWF MACRO'  @ZA00766 41100003
.CS6     ANOP                                                  @ZA00766 41400003
&RL      SETA  &VAL3890(&M)                                    @ZA00766 41700003
&NAME    DC    0H'0',X'5C',AL1(&RL),AL2(&A-&LBL1+&DISP)        @ZA00766 42000003
.END     MEND                                                           45000003
