*                                                                       00050000
* %DCL CSVEXRET_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE CSVEXRET_INCLUDED;                                        00150000
* %IF CSVEXRET_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95019. CBGEN compile date 94304         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSVEXRET &DSECT=YES,&LIST=YES,&EXRET=YES,&EXRET1=COND          00450000
         GBLC  &CSVEXRET_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&CSVEXRET_INCLUDED SETC 'YES'                                           00600000
 TITLE   'CSVEXRET  - Exit Return information area                   '  00650000
**/ CSVEXRET_1:;                                                        00700000
*/* START OF SPECIFICATIONS ******************************************* 00750000
*                                                                       00800000
*01* MACRO NAME:  CSVEXRET                                              00850000
*                                                                       00900000
*01* DESCRIPTIVE NAME:  Exit Return information area                    00950000
*02*  ACRONYM:  EXRET                                                   01000000
*                                                                       01050000
*01* PROPRIETARY STATEMENT=                                           * 01100000
***PROPRIETARY_STATEMENT*********************************************** 01150000
*                                                                     * 01200000
*                                                                     * 01250000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 01300000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 01350000
*   5647-A01 (C) COPYRIGHT IBM CORP. 1993, 1998                       * 01400000
*                                                                     * 01450000
*   STATUS= HBB6606                                                   * 01500000
*                                                                     * 01550000
***END_OF_PROPRIETARY_STATEMENT**************************************** 01600000
*                                                                       01700000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01750000
*01* END OF EXTERNAL CLASSIFICATION:                                    01800000
*                                                                       01850000
*01* DSECT NAME:                                                        01900000
*     EXRET                                                             01950000
*     EXRET1                                                            01975000
*                                                                       02000000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           02050000
*                                                                       02100000
*01* EYE-CATCHER:  NONE                                                 02150000
*                                                                       02200000
*01* STORAGE ATTRIBUTES:                                                02250000
*02*  SUBPOOL:  Caller-supplied                                         02300000
*02*  KEY:  Caller-supplied                                             02350000
*02*  RESIDENCY:  Caller-supplied                                       02400000
*                                                                       02450000
*01* SIZE:  Variable                                                    02500000
*                EXRET  -- X'0018' bytes                                02533300
*                EXRET1 -- X'0020' bytes                                02566600
*                                                                       02600000
*01* CREATED BY:                                                        02650000
*      Caller, passed as parameter on RETINFO keyword                   02700000
*      on CSVDYNEX REQUEST=CALL or CSVDYNEX REQUEST=RECOVER             02750000
*                                                                       02800000
*01* POINTED TO BY:                                                     02850000
*     CSVDYNEX parameter list                                           02900000
*                                                                       02950000
*01* SERIALIZATION:                                                     03000000
*     None required                                                     03050000
*                                                                       03100000
*01* FUNCTION:                                                          03150000
*02* Maps the data returned by the CSVDYNEX macro, CALL or RECOVER      03183300
*    request.                                                           03216600
*                                                                       03250000
*02* The caller indicates, via the ExretVer keyword, whether            03275000
*    entries are mapped by EXRET (the default,                          03300000
*    ExretVer=0) or EXRET1 (ExretVer=1).                                03325000
*                                                                       03350000
*02* The returned information consists of a header (EXRETHDR/EXRET1HDR) 03375000
*    which helps to indicate how many entries (EXRETINFO/EXRET1INFO)    03400000
*    follow. Those entries are contiguous (e.g., entry 2 immediately    03425000
*    follows entry 1 when more than one entry is returned).             03450000
*                                                                       03500000
*01* METHOD OF ACCESS:                                                  03550000
*02*  ASM:                                                              03600000
*      CSVEXRET                                                         03650000
*           DSECT=YES|NO  -- Request DSECT definition                   03700000
*           EXRET=YES|NO|COND -- Request return information mapping.    03750000
*                            USING on EXRET                             03800000
*           EXRET1=YES|NO|COND -- Request version 1 return information  03820000
*                            mapping. Specify ExretVER=1 on CSVDYNEX.   03840000
*                            USING on EXRET1                            03860000
*     Default: DSECT=YES,EXRET=YES,EXRET1=COND                          03880000
*     Notes: name=YES  => expand                                        03900000
*            name=NO   => do not expand                                 03950000
*            name=COND => expand only if DSECT=YES                      04000000
*02*  PL/AS:                                                            04050000
*      %INCLUDE SYSLIB(CSVEXRET)                                        04100000
*                                                                       04150000
*01* DELETED BY:  Caller                                                04200000
*                                                                       04250000
*01* FREQUENCY:  Created for response to CSVDYNEX REQUEST=CALL or       04283300
*                CSVDYNEX REQUEST=RECOVER                               04316600
*                                                                       04350000
*01* DEPENDENCIES:                                                      04370000
*02*             EXRETHDR must match EXRET1HDR                          04390000
*02*             EXRETINFO must be the first n bytes of EXRET1INFO      04410000
*                (so only add new things at the end)                    04430000
*                                                                       04450000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04500000
*                                                                       04550000
*01* CHANGE ACTIVITY:                                                   04600000
*   $L0=PE2STCBG ,HBB5510,920101,PD00XB: Return information             04650000
*   $L1=PE2STCSV ,HBB5510,920101,PD00XB: Return information             04700000
*   $01=OW10893  ,HBB5520,950110,PD00XB: AnyKey, POS                    04712500
*   $02=OW10893  ,HBB5520,940801,PD00XB: ExretVer support               04721800
*   $03=OW10893  ,HBB5520,940801,PD00XB: ExaaVer support                04731100
*   $P1=PUX0051  ,HBB6605,970630,PD00KC: Fix change activity            04740400
*   $P2=PVT0010  ,HBB6606,980114,PD00XZ: Remove CSVDYNEXRSNBADESPIE     04745200
*                 HBB6606 980303 PD00KC: Fix CDPI errors with           04746800
*                                        proprietary statement          04748400
*                                                                       04750000
* END OF SPECIFICATIONS *********************************************/  04800000
*% /*                                                                   04850000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04900000
         AIF   ('&LIST' EQ 'YES').P2                                    04950000
.P1      ANOP                                                           05000000
         PUSH  PRINT                                                    05050000
         PRINT OFF                                                      05100000
.P2      ANOP                                                           05150000
         AIF   ('&EXRET' EQ 'NO').L0002                                 05200000
         AIF   ('&DSECT' EQ 'YES').L0003                                05250000
         AIF   ('&EXRET' NE 'YES').L0002                                05300000
EXRET    DS    0F                                                       05350000
         AGO   .L0004                                                   05400000
.L0003   ANOP                                                           05450000
EXRET    DSECT                                                          05500000
.L0004   ANOP                                                           05550000
EXRETHDR DS    1CL0008                                                  05600000
         ORG   EXRETHDR                                                 05650000
EXRET#RET DS   1FL4      Number of modules for which information is    *05700000
                         returned. When RETINFO=LAST, RETINFO=LOWEST,  *05750000
                         or RETINFO=HIGHEST is specified, this         *05800000
                         indicates how many modules were called, since *05850000
                         information about only one is returned.        05900000
EXRET#REM DS   1FL4      Number of modules remaining for which         *05950000
                         information was not returned. This field will *06000000
                         be 0 for REQUEST=RECOVER.                      06050000
EXRETINFO DS   1CL0016   Return information entry                       06100000
         ORG   EXRETINFO                                                06150000
EXRETFLAGS DS  1BL1      Return flags                                   06200000
         ORG   EXRETFLAGS                                               06250000
EXRETABEND EQU X'80'     Indicates that the called module abended       06300000
         ORG   EXRETFLAGS+X'00000001'                                   06350000
EXRETRECOVERFLAGS DS 1BL1 Output from the RECOVER function. This is    *06400000
                         not set for the CALL function.                 06450000
         ORG   EXRETRECOVERFLAGS                                        06500000
EXRETRECERRORBEFOREINIT EQU X'80' Error occurred before initialization *06550000
                         completed. It is likely that the input        *06600000
                         WorkArea was not valid.                        06650000
EXRETRECEXITMODINCONTROL EQU X'40' Error occurred within an exit       *06700000
                         module.                                        06750000
EXRETRECACCRUB EQU X'20' Error occurred while accessing RUB area        06800000
EXRETRECACCRETAREA EQU X'10' Error occurred while accessing RetArea     06850000
EXRETRECACCPLIST EQU X'08' Error occurred while accessing parameter    *06900000
                         list                                           06950000
         ORG   EXRETRECOVERFLAGS+X'00000001'                            07000000
         DS    1CL0002   Reserved                                       07050000
EXRETREGS DS   1CL0012   Information from regs                          07100000
         ORG   EXRETREGS                                                07150000
EXRETCODE DS   1FL4      Return code, if bit ExretAbend is off          07200000
         ORG   EXRETCODE                                                07250000
EXRETABENDCODE DS 1FL4   Abend code, if bit ExretAbend is on. Its      *07300000
                         format matches that of SDWACMPC                07350000
EXRETRSN DS    1FL4      Reason code, if bit ExretAbend is off          07400000
         ORG   EXRETRSN                                                 07450000
EXRETABENDRSNCODE DS 1FL4 Abend reason code, if bit ExretAbend is on    07500000
EXRETR1  DS    1FL4      Return value in R1 from exit, if bit          *07550000
                         ExretAbend is off                              07600000
EXRET_LEN EQU  *-EXRET                                                  07600900
.L0002   ANOP                                                           07601800
         AIF   ('&EXRET1' EQ 'NO').L0005                                07602700
         AIF   ('&DSECT' EQ 'YES').L0006                                07603600
         AIF   ('&EXRET1' NE 'YES').L0005                               07604500
EXRET1   DS    0F                                                       07605400
         AGO   .L0007                                                   07606300
.L0006   ANOP                                                           07607200
EXRET1   DSECT                                                          07608100
.L0007   ANOP                                                           07609000
EXRET1HDR DS   1CL0008                                                  07609900
         ORG   EXRET1HDR                                                07610800
EXRET1#RET DS  1FL4      Number of modules for which information is    *07611700
                         returned. When RETINFO=LAST, RETINFO=LOWEST,  *07612600
                         or RETINFO=HIGHEST is specified, this         *07613500
                         indicates how many modules were called, since *07614400
                         information about only one is returned.        07615300
EXRET1#REM DS  1FL4      Number of modules remaining for which         *07616200
                         information was not returned. This field will *07617100
                         be 0 for REQUEST=RECOVER.                      07618000
EXRET1INFO DS  1CL0024   Return information entry                       07618900
         ORG   EXRET1INFO                                               07619800
EXRET1FLAGS DS 1BL1      Return flags                                   07620700
         ORG   EXRET1FLAGS                                              07621600
EXRET1ABEND EQU X'80'    Indicates that the called module abended       07622500
         ORG   EXRET1FLAGS+X'00000001'                                  07623400
EXRET1RECOVERFLAGS DS 1BL1 Output from the RECOVER function. This is   *07624300
                         not set for the CALL function.                 07625200
         ORG   EXRET1RECOVERFLAGS                                       07626100
EXRET1RECERRORBEFOREINIT EQU X'80' Error occurred before               *07627000
                         initialization completed. It is likely that   *07627900
                         the input WorkArea was not valid.              07628800
EXRET1RECEXITMODINCONTROL EQU X'40' Error occurred within an exit      *07629700
                         module.                                        07630600
EXRET1RECACCRUB EQU X'20' Error occurred while accessing RUB area       07631500
EXRET1RECACCRETAREA EQU X'10' Error occurred while accessing RetArea    07632400
EXRET1RECACCPLIST EQU X'08' Error occurred while accessing parameter   *07633300
                         list                                           07634200
         ORG   EXRET1RECOVERFLAGS+X'00000001'                           07635100
         DS    1CL0002   Reserved                                       07636000
EXRET1REGS DS  1CL0012   Information from regs                          07636900
         ORG   EXRET1REGS                                               07637800
EXRET1CODE DS  1FL4      Return code, if bit ExRet1Abend is off         07638700
         ORG   EXRET1CODE                                               07639600
EXRET1ABENDCODE DS 1FL4  Abend code, if bit ExRet1Abend is on. Its     *07640500
                         format matches that of SDWACMPC                07641400
EXRET1RSN DS   1FL4      Reason code, if bit ExRet1Abend is off         07642300
         ORG   EXRET1RSN                                                07643200
EXRET1ABENDRSNCODE DS 1FL4 Abend reason code, if bit ExRet1Abend is on  07644100
EXRET1R1 DS    1FL4      Return value in R1 from exit, if bit          *07645000
                         ExRet1Abend is off                             07645900
EXRET1MODNAME DS 1CL0008 Name of the recovery exit                      07646800
*                                                                       07650000
*    *****************************************************************  07700000
*    *                                                               *  07750000
*    * Return Code / Reason code constants for CSVDYNEX                 07800000
*    * It is guaranteed that no reason code will be reused (i.e., the*  07850000
*    * same reason code will not be used for more than one return    *  07900000
*    * code).                                                           07950000
*    * Also note carefully that bits 0-15 of the reason code may     *  08000000
*    * contain component-diagnostic data and must not be assumed to  *  08050000
*    * be 0.                                                            08100000
*    *                                                               *  08150000
*    *****************************************************************  08200000
*                                                                       08250000
*                                                                       08300000
CSVDYNEXRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non   *08350000
                         component-diagnostic portion of the reason    *08400000
                         code.                                          08450000
CSVDYNEXRC_OK EQU 0      Return code 0, success                         08500000
CSVDYNEXRC_WARN EQU 4    Return code 4, warning                         08550000
*                                                                       08600000
*    *****************************************************************  08650000
*    *                                                               *  08700000
*    * Reason codes for RC=4                                            08750000
*    *                                                               *  08800000
*    *****************************************************************  08850000
*                                                                       08900000
*                                                                       08950000
CSVDYNEXRSNALREADYEXISTS EQU X'00000401' The exit or module already    *09000000
                         exists                                         09050000
CSVDYNEXRSNDOESNOTEXIST EQU X'00000402' The module or exit does not    *09100000
                         exist.                                         09150000
CSVDYNEXRSNNOTALLDATARETURNED EQU X'00000403' For LIST, the provided   *09200000
                         output area was not large enough to contain   *09250000
                         all the data.                                  09300000
CSVDYNEXRSNNOMODULES EQU X'00000406' For CALL or QUERY no modules were *09350000
                         associated with the exit.                      09400000
CSVDYNEXRSNMOREMODULES EQU X'00000407' For CALL, there are more        *09450000
                         modules to be called for this exit. The call  *09500000
                         process stopped because the return area was   *09550000
                         not large enough to contain data for all the  *09600000
                         modules.                                       09650000
CSVDYNEXRSNUSERKEYDELETENOFORCE EQU X'00000408'                         09700000
*                                                                       09750000
*                                      User Key FastPath module (or     09787500
*                                      AnyKey FastPath module) delete   09825000
*                                      was specified without            09862500
*                                      FORCE=YES. Exit has been         09900000
*                                      deactivated but storage has      09950000
*                                      not been freed.                  10000000
*                                                                       10050000
CSVDYNEXRSNQUERYNOTFOUND EQU X'00000409' For REQUEST=QUERY, the exit   *10100000
                         name was not found.                            10150000
CSVDYNEXRSNIMPLICITLYDEFINED EQU X'0000040A' For REQUEST=QUERY, the    *10200000
                         exit was implicitly defined by virtue of      *10250000
                         having either its attributes set or modules   *10300000
                         added to it.                                   10350000
CSVDYNEXRC_INVPARM EQU 8 Return code 8, invalid parameter               10400000
*                                                                       10450000
*    *****************************************************************  10500000
*    *                                                               *  10550000
*    * Reason codes for RC=8                                            10600000
*    *                                                               *  10650000
*    *****************************************************************  10700000
*                                                                       10750000
*                                                                       10800000
CSVDYNEXRSNBADPARMLIST EQU X'00000801' Error while accessing parameter *10850000
                         list                                           10900000
CSVDYNEXRSNSRBMODE EQU X'00000802' Caller was in SRB mode               10950000
CSVDYNEXRSNNOTENABLED EQU X'00000803' Caller was not enabled            11000000
CSVDYNEXRSNNOTAUTHORIZED EQU X'00000804' Caller was not authorized      11050000
CSVDYNEXRSNHOMENOTPRIMARY EQU X'00000805' HASN ^= PASN                  11100000
CSVDYNEXRSNBADANSAREAALET EQU X'00000806' ALET of ANSAREA was not      *11150000
                         acceptable                                     11200000
CSVDYNEXRSNBADANSAREA EQU X'00000807' Error while accessing ANSAREA     11250000
CSVDYNEXRSNBADANSLEN EQU X'00000808' ANSLEN was not at least as long   *11300000
                         as EXAAHDR mapped by CSVEXAA.                  11350000
CSVDYNEXRSNBADREQUESTTYPE EQU X'00000809' Parameter list contains an   *11400000
                         incorrect request type. Possible overlay.      11450000
CSVDYNEXRSNBADESTAE EQU X'0000080A' ESTAE recovery could not be        *11500000
                         established. Possibly the caller had an EUT   *11550000
                         FRR.                                           11600000
CSVDYNEXRSNRESERVEDNOT0 EQU X'0000080B' Parameter list contains a      *11650000
                         non-0 value in a reserved field. Possible     *11700000
                         overlay.                                       11750000
CSVDYNEXRSNBADPARMLISTALET EQU X'0000080D' ALET of parameter list was  *11800000
                         not acceptable.                                11850000
CSVDYNEXRSNBADVERSION EQU X'0000080E' Parameter list contains an       *11900000
                         incorrect version number. Possible overlay.    11950000
CSVDYNEXRSNLOCKED EQU X'0000080F' Caller held a system lock.            12000000
CSVDYNEXRSNNOFASTPATH EQU X'00000814' The exit was not defined to      *12050000
                         allow fastpath calls                           12100000
CSVDYNEXRSNBADDSNAREA EQU X'00000815' Error while accessing area       *12150000
                         containing DSN                                 12200000
CSVDYNEXRSNBADRETAREA EQU X'00000816' Error while accessing RETAREA     12250000
CSVDYNEXRSNBADWORKAREA EQU X'00000817' Error while accessing WORKAREA   12300000
CSVDYNEXRSNBADOPEN EQU X'00000818' Unable to open supplied data set.    12350000
CSVDYNEXRSNEXITNAMENOTFOUND EQU X'00000819' EXITNAME does not exist     12400000
CSVDYNEXRSNBADRETLEN EQU X'0000081A' RETLEN was not at least as large  *12450000
                         as EXRETHDR plus one EXRETINFO entry           12500000
CSVDYNEXRSNREG2INRUB EQU X'0000081B' RUB indicated to set reg 2. Not   *12550000
                         allowed when exit allows AMODE 24 (i.e., the  *12600000
                         exit is defined as AMODE=24 or                *12650000
                         AMODE=DEFINED).                                12700000
CSVDYNEXRSNMODULENOTFOUND EQU X'0000081C' Requested module was not     *12750000
                         found.                                         12800000
CSVDYNEXRSNNORESMGR EQU X'0000081D' Unable to establish resource       *12850000
                         manager needed to track the persistence       *12900000
                         requirement of the exit.                       12950000
CSVDYNEXRSNBADNEXTTOKEN EQU X'0000081E' NEXTTOKEN is incorrect          13000000
CSVDYNEXRSNWORKAREABADDATA EQU X'0000081F' WORKAREA contains incorrect *13050000
                         data                                           13100000
CSVDYNEXRSNBADDSNAMEALET EQU X'00000820' ALET of area containing DSN   *13150000
                         is not acceptable                              13200000
CSVDYNEXRSNBADRETAREAALET EQU X'00000821' ALET of RETAREA is not       *13250000
                         acceptable                                     13300000
CSVDYNEXRSNBADEXITNAME EQU X'00000822' EXITNAME begins with blank or   *13350000
                         hex zero                                       13400000
CSVDYNEXRSNBADMODNAME EQU X'00000823' MODNAME begins with blank or hex *13450000
                         zero                                           13500000
CSVDYNEXRSNBADRUB EQU X'00000824' Error accessing RUB                   13550000
CSVDYNEXRSNBADRUBALET EQU X'00000825' ALET of RUB is not acceptable     13600000
CSVDYNEXRSNBADSDWA EQU X'00000826' Error accessing SDWA provided on    *13650000
                         CSVDYNEX REQUEST=RECOVER                       13700000
CSVDYNEXRSNBADAMODE EQU X'00000827' Exit is 31, module is 24 or vice   *13750000
                         versa                                          13800000
CSVDYNEXRSNBADKEY EQU X'00000828' Key is not 0-15 for DEFINE or        *13850000
                         caller's key does not match defined key for   *13900000
                         CALL.                                          13950000
CSVDYNEXRSNBADALLOC EQU X'00000829' Unable to allocate requested data  *14000000
                         set                                            14050000
CSVDYNEXRSNNOTREENTRANT EQU X'0000082A' Module is not reentrant         14100000
CSVDYNEXRSNNODYNALLOC EQU X'0000082B' Dsname specified when dynamic    *14150000
                         allocation is not yet allowed by the system    14200000
CSVDYNEXRSNBADABENDCONSEC EQU X'0000082C' AbendConsec=YES is not       *14250000
                         allowed for fast path user key exit            14300000
CSVDYNEXRSNNOTAPFAUTHORIZED EQU X'0000082E' Specified data set was not *14450000
                         APF authorized, so unable to load from it.     14500000
CSVDYNEXRSNREG3WITHLINKSTACKNO EQU X'0000082F' Request=CALL with       *14550000
                         LINKSTACK(NO) specified reg(3) in the RUB      14600000
CSVDYNEXRSNBADEXAAVER EQU X'00000830' EXAAVER field in parameter list  *14606200
                         has an incorrect value                         14612400
CSVDYNEXRSNANYKEYNOTRENT EQU X'00000831' Request=DEFINE with           *14618600
                         ANYKEY=YES but not REENTRANT=REQ               14624800
CSVDYNEXRSNBADPOS EQU X'00000832' POS value is incorrect.               14631000
CSVDYNEXRSNBADEXRETVER EQU X'00000833' EXRETVER field in parameter     *14637200
                         list has an incorrect value                    14643400
CSVDYNEXRC_ENV EQU 12    Return code 12, environmental error            14650000
*                                                                       14700000
*    *****************************************************************  14750000
*    *                                                               *  14800000
*    * Reason codes for RC=12                                           14850000
*    *                                                               *  14900000
*    *****************************************************************  14950000
*                                                                       15000000
*                                                                       15050000
CSVDYNEXRSNFUNCTIONNOTAVAILABLE EQU X'00000C01'                         15100000
*                                                                       15150000
*                                                                       15200000
*                                                                       15250000
CSVDYNEXRSNNOSTORAGE EQU X'00000C02' Storage was not available for a   *15300000
                         system control block or for containing the    *15350000
                         exit module.                                   15400000
CSVDYNEXRSNONEMODULEONLY EQU X'00000C03' The single module allowed by  *15450000
                         this exit has already been associated with    *15500000
                         that exit. The newly requested module cannot  *15550000
                         also be associated with that exit.             15600000
CSVDYNEXRSNNOTIMPLICITLYDEFINED EQU X'00000C04'                         15650000
*                                                                       15700000
*                                      An operator UNDEFINE request     15750000
*                                      was requested but the exit had   15800000
*                                      been explicitly defined. The     15850000
*                                      request is denied.               15900000
*                                                                       15950000
CSVDYNEXRC_COMPERROR EQU 16 Unknown, unexpected error                   16000000
*                                                                       16050000
*    *****************************************************************  16100000
*    *                                                               *  16150000
*    * Reason codes for RC=16                                           16200000
*    *                                                               *  16250000
*    *****************************************************************  16300000
*                                                                       16350000
*                                    *                                  16400000
*                                                                       16450000
CSVDYNEXRSNCOMPERROR EQU X'00001001' System error encountered by       *16500000
                         component.                                     16550000
EXRET1_LEN EQU *-EXRET1                                                 16600000
.L0005   ANOP                                                           16650000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 16700000
         AIF   ('&LIST' EQ 'YES').P4                                    16750000
.P3      ANOP                                                           16800000
         POP   PRINT                                                    16850000
.P4      ANOP                                                           16900000
.P_EXIT  ANOP                                                           16950000
         MEND                                                           17000000
**/ CSVEXRET_2:;                                                        17050000
* %CSVEXRET_INCLUDED = 'YES';                                           17100000
* %DCL ZCBPRINT CHAR EXT;                                               17150000
* %DEACTIVATE ZCBPRINT;                                                 17200000
* %DCL CSVEXRET_LIST CHAR EXT;                                          17250000
* %DEACTIVATE CSVEXRET_LIST;                                            17300000
* %IF CSVEXRET_LIST ^= 'NO' &                                           17350000
*    ZCBPRINT ^= 'NO' %THEN                                             17400000
*   %GOTO CSVEXRET_3;                                                   17450000
*   @LIST PUSH NOECHO;                                                  17500000
*   @LIST NOASSEMBLE NOECHO;                                            17550000
*   @LIST OFF C NOECHO;                                                 17600000
* %CSVEXRET_3:;                                                         17650000
*/* Start of PL/X Source                                             */ 17700000
*%IF EXRET_ALET = '' %THEN  /*                                   @L1A*/ 17750000
*  %EXRET_ALET = '0';      /*                                    @L1A*/ 17800000
*%EXRET_VIA='';             /*                                   @L1A*/ 17850000
*%IF EXRET_ALET^='0' %THEN   /*                                  @L1A*/ 17900000
*  %EXRET_VIA='VIA(EXRET_ALET)';    /*                           @L1A*/ 17950000
*DCL 1 EXRET BASED,                 /*                           @L1A*/ 18000000
*      2 EXRETHDR,                  /*                           @L1A*/ 18050000
*        3 EXRET#RET FIXED(32),   /* Number of modules for which        18100000
*               information is returned. When RETINFO=LAST,             18150000
*               RETINFO=LOWEST, or                                      18200000
*               RETINFO=HIGHEST is specified, this indicates how        18250000
*               many modules were called, since information about only  18300000
*               one is returned.                                 @L1A*/ 18350000
*        3 EXRET#REM FIXED(32),   /* Number of modules remaining for    18400000
*                            which information was not returned.        18450000
*                            This field will be 0 for REQUEST=RECOVER.  18500000
*                                                                @L1A*/ 18550000
*      2 EXRETINFO(*),              /* Return information entry  @L1A*/ 18600000
*        3 EXRETFLAGS BIT(8),       /* Return flags              @L1A*/ 18650000
*         4 EXRETABEND BIT(1),      /* Indicates that the called        18700000
*                                      module abended            @L1A*/ 18750000
*        3 ExRetRecoverFlags Bit(8),  /* Output from the                18800000
*                                      RECOVER function. This is not    18850000
*                                   set for the CALL function.   @L1A*/ 18900000
*         4 ExRetRecErrorBeforeInit Bit(1),  /* Error occurred before   18950000
*                initialization completed. It is likely that the        19000000
*                input WorkArea was not valid.                   @L1A*/ 19050000
*         4 ExRetRecExitModInControl Bit(1),  /* Error occurred         19100000
*                within an exit module.                          @L1A*/ 19150000
*         4 ExRetRecAccRUB Bit(1),  /* Error occurred                   19200000
*                while accessing RUB area                        @L1A*/ 19250000
*         4 ExRetRecAccRetArea Bit(1),  /* Error occurred               19300000
*                while accessing RetArea                         @L1A*/ 19350000
*         4 ExRetRecAccPlist Bit(1),  /* Error occurred                 19400000
*                while accessing parameter list                  @L1A*/ 19450000
*        3 * CHAR(2),               /* Reserved                  @L1A*/ 19500000
*        3 EXRETREGS,               /* Information from regs     @L1A*/ 19550000
*          4 EXRETCODE FIXED(32),   /* Return code, if bit              19600000
*                                      ExretAbend is off         @L1A*/ 19650000
*           5 EXRETAbendCode Fixed(32), /* Abend code, if bit           19700000
*                                      ExretAbend is on. Its format     19750000
*                                      matches that of SDWACMPC  @L1A*/ 19800000
*          4 EXRETRSN FIXED(32),    /* Reason code, if bit              19850000
*                                      ExretAbend is off         @L1A*/ 19900000
*           5 EXRETAbendRsnCode Fixed(32), /* Abend reason code, if     19950000
*                                      bit ExretAbend is on      @L1A*/ 20000000
*          4 EXRETR1 FIXED(32);     /* Return value in R1 from          20050000
*                                      exit, if bit                     20100000
*                                      ExretAbend is off         @L1A*/ 20150000
*DCL 1 EXRET1 BASED,                /*                           @02P*/ 20151000
*      2 EXRET1HDR,                 /*                           @02P*/ 20152000
*        3 EXRET1#RET FIXED(32),  /* Number of modules for which        20153000
*               information is returned. When RETINFO=LAST,             20154000
*               RETINFO=LOWEST, or                                      20155000
*               RETINFO=HIGHEST is specified, this indicates how        20156000
*               many modules were called, since information about only  20157000
*               one is returned.                                 @02P*/ 20158000
*        3 EXRET1#REM FIXED(32),  /* Number of modules remaining for    20159000
*                            which information was not returned.        20160000
*                            This field will be 0 for REQUEST=RECOVER.  20161000
*                                                                @02P*/ 20162000
*      2 EXRET1INFO(*),             /* Return information entry  @02P*/ 20163000
*        3 EXRET1FLAGS BIT(8),      /* Return flags              @02P*/ 20164000
*         4 EXRET1ABEND BIT(1),     /* Indicates that the called        20165000
*                                      module abended            @02P*/ 20166000
*        3 ExRet1RecoverFlags Bit(8), /* Output from the                20167000
*                                      RECOVER function. This is not    20168000
*                                   set for the CALL function.   @02P*/ 20169000
*         4 ExRet1RecErrorBeforeInit Bit(1), /* Error occurred before   20170000
*                initialization completed. It is likely that the        20171000
*                input WorkArea was not valid.                   @02P*/ 20172000
*         4 ExRet1RecExitModInControl Bit(1), /* Error occurred         20173000
*                within an exit module.                          @02P*/ 20174000
*         4 ExRet1RecAccRUB Bit(1), /* Error occurred                   20175000
*                while accessing RUB area                        @02P*/ 20176000
*         4 ExRet1RecAccRetArea Bit(1), /* Error occurred               20177000
*                while accessing RetArea                         @02P*/ 20178000
*         4 ExRet1RecAccPlist Bit(1), /* Error occurred                 20179000
*                while accessing parameter list                  @02P*/ 20180000
*        3 * CHAR(2),               /* Reserved                  @02P*/ 20181000
*        3 ExRet1REGS,              /* Information from regs     @02P*/ 20182000
*          4 ExRet1CODE FIXED(32),  /* Return code, if bit              20183000
*                                      ExRet1Abend is off        @02P*/ 20184000
*           5 ExRet1AbendCode Fixed(32), /* Abend code, if bit          20185000
*                                      ExRet1Abend is on. Its format    20186000
*                                      matches that of SDWACMPC  @02P*/ 20187000
*          4 ExRet1RSN FIXED(32),   /* Reason code, if bit              20188000
*                                      ExRet1Abend is off        @02P*/ 20189000
*           5 ExRet1AbendRsnCode Fixed(32), /* Abend reason code, if    20190000
*                                      bit ExRet1Abend is on     @02P*/ 20191000
*          4 ExRet1R1 FIXED(32),    /* Return value in R1 from          20192000
*                                      exit, if bit                     20193000
*                                      ExRet1Abend is off        @02P*/ 20194000
*        3 ExRet1Modname CHAR(8);   /* Name of the recovery exit @02A*/ 20195000
*                                                                       20200000
*    /* Return Code / Reason code constants for CSVDYNEX         @L1A*/ 20250000
*                                                                       20300000
*    /* It is guaranteed that                                           20350000
*       no reason code will be reused (i.e., the same reason code       20400000
*       will not be used for more than one return code).         @L1A*/ 20450000
*                                                                       20500000
*    /* Also note carefully that bits 0-15 of the reason code           20550000
*       may contain component-diagnostic data and must not be           20600000
*       assumed to be 0.                                         @L1A*/ 20650000
*                                                                       20700000
*Dcl CsvdynexRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this     20750000
*               mask to isolate the non component-diagnostic            20800000
*               portion of the reason code.                      @L1A*/ 20850000
*DCL CsvdynexRC_OK Constant(0);     /* Return code 0, success    @L1A*/ 20900000
*DCL CsvdynexRC_WARN Constant(4);   /* Return code 4, warning    @L1A*/ 20950000
*    /* Reason codes for RC=4                                    @L1A*/ 21000000
*Dcl CsvdynexRsnAlreadyExists Bit(32) Constant('00000401'X); /* The     21050000
*                   exit or module already exists                @L1A*/ 21100000
*Dcl CsvdynexRsnDoesNotExist Bit(32) Constant('00000402'X); /* The      21150000
*                   module or exit does not exist.               @L1A*/ 21200000
*Dcl CsvdynexRsnNotAllDataReturned Bit(32) Constant('00000403'X); /*    21250000
*                   For LIST, the provided output area was              21300000
*                   not large enough to contain all the data.    @L1A*/ 21350000
*Dcl CsvdynexRsnNoModules Bit(32) Constant('00000406'X); /* For CALL    21400000
*                   or QUERY                                            21450000
*                   no modules were associated with the exit.    @L1A*/ 21500000
*Dcl CsvdynexRsnMoreModules Bit(32) Constant('00000407'X); /* For CALL, 21550000
*                   there are more modules to be called for this exit.  21600000
*                   The call process stopped because the return area    21650000
*                   was not large enough to contain data for all the    21700000
*                   modules.                                     @L1A*/ 21750000
*DCL CsvdynexRsnUserKeyDeleteNoForce Bit(32)                            21800000
*               Constant('00000408'X);  /* User Key FastPath module     21850000
*                   (or AnyKey FastPath module)                         21875000
*                   delete was specified without FORCE=YES. Exit has    21900000
*                   been deactivated but storage has not been freed.    21950000
*                                                                @01C*/ 22000000
*DCL CsvdynexRsnQueryNotFound Bit(32)                                   22050000
*               Constant('00000409'X);  /* For REQUEST=QUERY,           22100000
*                   the exit name was not found.                        22150000
*                                                                @L1A*/ 22200000
*DCL CsvdynexRsnImplicitlyDefined Bit(32)                               22250000
*               Constant('0000040A'X);  /* For REQUEST=QUERY,           22300000
*                  the exit was implicitly defined by virtue of having  22350000
*                  either its attributes set or modules added to it.    22400000
*                                                                @L1A*/ 22450000
*DCL CsvdynexRC_InvParm Constant(8); /* Return code 8,                  22500000
*                                      invalid parameter         @L1A*/ 22550000
*                                   /*                           @L1A*/ 22600000
*    /* Reason codes for RC=8                                    @L1A*/ 22650000
*Dcl CsvdynexRsnBadParmList Bit(32) Constant('00000801'X); /* Error     22700000
*                   while accessing parameter list               @L1A*/ 22750000
*Dcl CsvdynexRsnSRBMode Bit(32) Constant('00000802'X); /* Caller was    22800000
*                   in SRB mode                                  @L1A*/ 22850000
*Dcl CsvdynexRsnNotEnabled Bit(32) Constant('00000803'X); /* Caller     22900000
*                   was not enabled                              @L1A*/ 22950000
*Dcl CsvdynexRsnNotAuthorized Bit(32) Constant('00000804'X); /* Caller  23000000
*                   was not authorized                           @L1A*/ 23050000
*Dcl CsvdynexRsnHomeNotPrimary Bit(32) Constant('00000805'X); /*        23100000
*                   HASN ^= PASN                                 @L1A*/ 23150000
*Dcl CsvdynexRsnBadAnsareaALET Bit(32) Constant('00000806'X); /* ALET   23200000
*                   of ANSAREA was not acceptable                @L1A*/ 23250000
*Dcl CsvdynexRsnBadAnsarea Bit(32) Constant('00000807'X); /* Error      23300000
*                   while accessing ANSAREA                      @L1A*/ 23350000
*Dcl CsvdynexRsnBadAnsLen Bit(32) Constant('00000808'X); /* ANSLEN      23400000
*                   was not at least as long as EXAAHDR mapped by       23450000
*                   CSVEXAA.                                     @L1A*/ 23500000
*Dcl CsvdynexRsnBadRequestType Bit(32) Constant('00000809'X); /*        23550000
*                   Parameter list contains an incorrect request type.  23600000
*                   Possible overlay.                            @L1A*/ 23650000
*DCL CsvdynexRsnBadEstae Bit(32) Constant('0000080A'X); /* ESTAE        23700000
*                   recovery could not be established. Possibly the     23750000
*                   caller had an EUT FRR.                       @L1A*/ 23800000
*DCL CsvdynexRsnReservedNot0 Bit(32) Constant('0000080B'X); /*          23850000
*                   Parameter list contains a non-0 value in a reserved 23900000
*                   field. Possible overlay.                     @L1A*/ 23950000
*DCL CsvdynexRsnBadParmlistAlet Bit(32) Constant('0000080D'X); /* ALET  24000000
*                   of parameter list was not acceptable.        @L1A*/ 24050000
*DCL CsvdynexRsnBadVersion Bit(32) Constant('0000080E'X); /*            24100000
*                   Parameter list contains an incorrect version        24150000
*                   number. Possible overlay.                    @L1A*/ 24200000
*DCL CsvdynexRsnLocked Bit(32) Constant('0000080F'X);    /* Caller      24250000
*                   held a system lock.                          @L1A*/ 24300000
*DCL CsvdynexRsnNoFastPath Bit(32) Constant('00000814'X); /* The exit   24350000
*                   was not defined to allow fastpath calls      @L1A*/ 24400000
*DCL CsvdynexRsnBadDSNArea Bit(32) Constant('00000815'X); /* Error      24450000
*                   while accessing area containing DSN          @L1A*/ 24500000
*DCL CsvdynexRsnBadRetArea Bit(32) Constant('00000816'X); /* Error      24550000
*                   while accessing RETAREA                      @L1A*/ 24600000
*DCL CsvdynexRsnBadWorkArea Bit(32) Constant('00000817'X); /* Error     24650000
*                   while accessing WORKAREA                     @L1A*/ 24700000
*DCL CsvdynexRsnBadOpen    Bit(32) Constant('00000818'X); /* Unable     24750000
*                   to open supplied data set.                   @L1A*/ 24800000
*DCL CsvdynexRsnExitNameNotFound Bit(32)                                24850000
*               Constant('00000819'X);     /* EXITNAME does not         24900000
*                   exist                                        @L1A*/ 24950000
*DCL CsvdynexRsnBadRetLen Bit(32)                                       25000000
*               Constant('0000081A'X);     /* RETLEN was not at least   25050000
*                   as large as EXRETHDR plus one EXRETINFO entry       25100000
*                                                                @L1A*/ 25150000
*DCL CsvdynexRsnReg2InRUB Bit(32)                                       25200000
*               Constant('0000081B'X);     /* RUB indicated to set      25250000
*                   reg 2. Not allowed when exit allows AMODE 24        25300000
*                   (i.e., the exit is defined as AMODE=24 or           25350000
*                   AMODE=DEFINED).                              @L1A*/ 25400000
*DCL CsvdynexRsnModuleNotFound Bit(32)                                  25450000
*               Constant('0000081C'X);     /* Requested module          25500000
*                   was not found.                               @L1A*/ 25550000
*DCL CsvdynexRsnNoRESMGR Bit(32)                                        25600000
*               Constant('0000081D'X);     /* Unable to establish       25650000
*                   resource manager needed to track the persistence    25700000
*                   requirement of the exit.                     @L1A*/ 25750000
*DCL CsvdynexRsnBadNextToken Bit(32)                                    25800000
*               Constant('0000081E'X);     /* NEXTTOKEN is incorrect    25850000
*                                                                @L1A*/ 25900000
*DCL CsvdynexRsnWorkAreaBadData Bit(32)                                 25950000
*               Constant('0000081F'X);     /* WORKAREA contains         26000000
*                   incorrect data                               @L1A*/ 26050000
*DCL CsvdynexRsnBadDsnameALET Bit(32)                                   26100000
*               Constant('00000820'X);     /* ALET of area containing   26150000
*                   DSN is not acceptable                        @L1A*/ 26200000
*DCL CsvdynexRsnBadRetareaALET Bit(32)                                  26250000
*               Constant('00000821'X);     /* ALET of RETAREA           26300000
*                   is not acceptable                            @L1A*/ 26350000
*DCL CsvdynexRsnBadExitName Bit(32)                                     26400000
*               Constant('00000822'X);     /* EXITNAME begins with      26450000
*                   blank or hex zero                            @L1A*/ 26500000
*DCL CsvdynexRsnBadModName Bit(32)                                      26550000
*               Constant('00000823'X);     /* MODNAME begins with       26600000
*                   blank or hex zero                            @L1A*/ 26650000
*DCL CsvdynexRsnBadRUB Bit(32)                                          26700000
*               Constant('00000824'X);     /* Error accessing RUB       26750000
*                                                                @L1A*/ 26800000
*DCL CsvdynexRsnBadRUBALET Bit(32)                                      26850000
*               Constant('00000825'X);     /* ALET of RUB               26900000
*                   is not acceptable                            @L1A*/ 26950000
*DCL CsvdynexRsnBadSDWA Bit(32)                                         27000000
*               Constant('00000826'X);     /* Error accessing SDWA      27050000
*                           provided on CSVDYNEX REQUEST=RECOVER @L1A*/ 27100000
*DCL CsvdynexRsnBadAmode Bit(32)                                        27150000
*               Constant('00000827'X);  /* Exit is 31, module is 24     27200000
*                                          or vice versa         @L1A*/ 27250000
*DCL CsvdynexRsnBadKey        Bit(32)                                   27300000
*               Constant('00000828'X);  /* Key is not 0-15 for DEFINE   27350000
*                   or caller's key does not match defined key          27400000
*                   for CALL.                                    @L1A*/ 27450000
*DCL CsvdynexRsnBadAlloc      Bit(32)                                   27500000
*               Constant('00000829'X);  /* Unable to allocate           27550000
*                   requested data set                           @L1A*/ 27600000
*DCL CsvdynexRsnNotReentrant  Bit(32)                                   27650000
*               Constant('0000082A'X);  /* Module is not reentrant      27700000
*                                                                @L1A*/ 27750000
*DCL CsvdynexRsnNoDynalloc Bit(32)                                      27800000
*               Constant('0000082B'X);  /* Dsname specified when        27850000
*               dynamic allocation is not yet allowed by the system     27900000
*                                                                @L1A*/ 27950000
*DCL CsvdynexRsnBadAbendConsec Bit(32)                                  28000000
*               Constant('0000082C'X);  /* AbendConsec=YES is not       28050000
*               allowed for fast path user key exit              @L1A*/ 28100000
*DCL CsvdynexRsnNotApfAuthorized Bit(32)                                28300000
*               Constant('0000082E'X);  /* Specified data set was not   28350000
*               APF authorized, so unable to load from it.       @L1A*/ 28400000
*DCL CsvdynexRsnReg3WithLinkstackNo Bit(32)                             28450000
*               Constant('0000082F'X);  /* Request=CALL with            28500000
*               LINKSTACK(NO) specified reg(3) in the RUB        @L1A*/ 28550000
*DCL CsvdynexRsnBadExaaver Bit(32)                                      28553800
*               Constant('00000830'X);  /* EXAAVER field in             28557600
*               parameter list has an incorrect value            @03A*/ 28561400
*DCL CsvdynexRsnAnyKeyNotRent Bit(32)                                   28565200
*               Constant('00000831'X);  /* Request=DEFINE with          28569000
*               ANYKEY=YES but not REENTRANT=REQ                 @01A*/ 28572800
*DCL CsvdynexRsnBadPos Bit(32)                                          28576600
*               Constant('00000832'X);  /* POS value is                 28580400
*               incorrect.                                       @01A*/ 28584200
*DCL CsvdynexRsnBadExretVer Bit(32)                                     28588000
*               Constant('00000833'X);  /* EXRETVER field in            28591800
*               parameter list has an incorrect value            @02A*/ 28595600
*DCL CsvdynexRC_Env Constant(12);   /* Return code 12,                  28600000
*                                      environmental error       @L1A*/ 28650000
*    /* Reason codes for RC=12                                   @L1A*/ 28700000
*Dcl CsvdynexRsnFunctionNotAvailable Bit(32) Constant('00000C01'X);     28750000
*                                   /*                           @L1A*/ 28800000
*DCL CsvdynexRsnNoStorage     Bit(32)                                   28850000
*               Constant('00000C02'X);  /* Storage was not available    28900000
*               for a system control block or for containing the        28950000
*               exit module.                                     @L1A*/ 29000000
*DCL CsvdynexRsnOneModuleOnly Bit(32)                                   29050000
*               Constant('00000C03'X);  /* The single module allowed    29100000
*               by this exit has already been associated with that      29150000
*               exit. The newly requested module cannot also            29200000
*               be associated with that exit.                    @L1A*/ 29250000
*DCL CsvdynexRsnNotImplicitlyDefined Bit(32)                            29300000
*               Constant('00000C04'X);  /* An operator UNDEFINE         29350000
*                   request was requested but the exit had been         29400000
*                   explicitly defined. The request is denied.   @L1A*/ 29450000
*                                                                       29500000
*DCL CsvdynexRC_CompError Constant(16); /* Unknown, unexpected          29550000
*                                      error                     @L1A*/ 29600000
*                                   /*                           @L1A*/ 29650000
*    /* Reason codes for RC=16                                   @L1A*/ 29700000
*                                   /*                           @L1A*/ 29750000
*Dcl CsvdynexRsnCompError Bit(32) Constant('00001001'X);  /*            29800000
*               System error encountered by component.           @L1A*/ 29850000
* @LOGIC;                                                               29900000
* #PRAGMA TOOL=CBGEN.                                                   29950000
* #USEORG.                                                              30000000
* #EPRAGMA.                                                             30050000
* @ENDLOGIC;                                                            30100000
*/* End of PL/X Source                                               */ 30150000
* %IF CSVEXRET_LIST ^= 'NO' &                                           30200000
*    ZCBPRINT ^= 'NO' %THEN                                             30250000
*   %GOTO CSVEXRET_4;                                                   30300000
*   @LIST POP NOECHO;                                                   30350000
* %CSVEXRET_4:;                                                         30400000
* %END;                                                                 30450000
