*                                                                       00050000
* %DCL CSVLPRET_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE CSVLPRET_INCLUDED;                                        00150000
* %IF CSVLPRET_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99111. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSVLPRET &DSECT=YES,&LIST=YES,&TITLE=YES,&LPMEA=YES,          *00450000
               &LPMEAX=COND,&LPMED=COND                                 00500000
         GBLC  &CSVLPRET_INCLUDED                                       00550000
         GBLC  &ZCBPRINT                                                00600000
&CSVLPRET_INCLUDED SETC 'YES'                                           00650000
         AIF   ('&LIST' EQ 'NONE').P0                                   00700000
         AIF   ('&TITLE' EQ 'NO').P5                                    00750000
 TITLE   'CSVLPRET  - Dynamic LPA Return Information                 '  00800000
.P5      ANOP                                                           00850000
**/ CSVLPRET_1:;                                                        00900000
*/* START OF SPECIFICATIONS ******************************************* 00950000
*                                                                       01000000
*  **PROPRIETARY_STATEMENT********************************************  01050000
***01* PROPRIETARY STATEMENT=                                        *  01100000
*                                                                    *  01150000
*                                                                    *  01200000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01250000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01300000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  01350000
*                                                                    *  01450000
*   STATUS= HBB7703                                                  *  01500000
*                                                                    *  01550000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01600000
*                                                                       01650000
*01* DESCRIPTIVE NAME:  Dynamic LPA Return Information                  01700000
*02*  ACRONYM:  LPRET                                                   01750000
*                                                                       01800000
*01* MACRO NAME:  CSVLPRET                                              01850000
*                                                                       01900000
*01* EXTERNAL CLASSIFICATION: PI                                        01950000
*01* END OF EXTERNAL CLASSIFICATION:                                    02000000
*                                                                       02050000
*01* DSECT NAME:                                                        02100000
*     LPMEA                                                             02150000
*     LPMED                                                             02200000
*     LPMEAX                                                            02225000
*                                                                       02250000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           02300000
*                                                                       02350000
*01* EYE-CATCHER:  NONE                                                 02400000
*                                                                       02450000
*01* STORAGE ATTRIBUTES:                                                02500000
*02*  SUBPOOL:  Caller-supplied                                         02550000
*02*  KEY:  Caller-supplied                                             02600000
*02*  RESIDENCY:  Caller-supplied                                       02650000
*                                                                       02700000
*01* SIZE:  Variable                                                    02750000
*                LPMEA  -- X'0028' bytes                                02787500
*                LPMEAX -- X'0010' bytes                                02825000
*                LPMED  -- X'0014' bytes                                02862500
*                                                                       02900000
*01* CONTROL BLOCK CHANGES:                                             02950000
*02*  CSVLPRET                                                          03000000
*02*   5.3                                                              03050000
*03*    New                                                             03100000
*03*    Migration Considerations: NONE                                  03150000
*01* END CONTROL BLOCK CHANGES                                          03200000
*                                                                       03250000
*01* CREATED BY:                                                        03300000
*     Caller and passed as parameter on MODINFO keyword                 03350000
*      on CSVDYLPA ADD and DELETE                                       03400000
*     System and passed as parameter to exit CSVDYLPA                   03412500
*     System and provided as information within                         03425000
*      SMF Type 90 Subtype 31 record                                    03437500
*                                                                       03450000
*01* POINTED TO BY:                                                     03500000
*     CSVDYLPA parameter list                                           03550000
*     Parameter passed to exit CSVDYLPA                                 03566600
*     Area within SMF Type 90 Subtype 31 record                         03583200
*                                                                       03600000
*01* SERIALIZATION:                                                     03650000
*     None required                                                     03700000
*                                                                       03750000
*01* FUNCTION:                                                          03800000
*02* The MODINFO area is a contiguous array of entries,                 03850000
*    mapped by the LPMEA (for ADD) or LPMED (for DELETE) DSECT          03866600
*    An LPMEAX can be provided for ADD, which is also a contiguous      03870700
*    array of entries. Each LPMEAX entry is related to the              03874800
*    corresponding LPMEA entry.                                         03878900
*02* An area of continguous entries mapped by the LPMEA DSECT           03883200
*    is provided to exit CSVDYLPA                                       03899800
*02* An area of continguous entries mapped by the LPMEA DSECT           03916400
*    is provided within the SMF Type 90 Subtype 31 record               03933000
*                                                                       03950000
*01* METHOD OF ACCESS:                                                  04000000
*02*  ASM:                                                              04050000
*      CSVLPRET                                                         04100000
*           DSECT=YES|NO  -- Request DSECT definition                   04150000
*           LPMEA=YES|NO|COND -- Request module info ADD mapping        04200000
*                            USING on LPMEA                             04250000
*           LPMED=YES|NO|COND -- Request module info DELETE mapping     04300000
*                            USING on LPMED                             04350000
*     Default: DSECT=YES,LPMEA=YES,LPMED=COND                           04400000
*     Notes: name=YES  => expand                                        04450000
*            name=NO   => do not expand                                 04500000
*            name=COND => expand only if DSECT=YES                      04550000
*                                                                       04600000
*02*  PL/AS:                                                            04650000
*      %INCLUDE SYSLIB(CSVLPRET)                                        04700000
*                                                                       04750000
*01* DELETED BY:  Caller                                                04800000
*                                                                       04850000
*01* FREQUENCY:  Created for input/response to CSVDYLPA ADD/DELETE      04900000
*                                                                       04950000
*01* DEPENDENCIES:  None                                                05000000
*                                                                       05050000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     05100000
*                                                                       05150000
*01* CHANGE ACTIVITY:                                                   05200000
*   $L0=DYLPACBG ,JBB6604,941231,PD00XB: Dynamic LPA                    05250000
*   $L1=DYLPACSV ,JBB6604,941231,PD00XB: Dynamic LPA                    05300000
*   $L2=64BITCSV  HBB7703 981204 PD00XB: ESAME                          05325000
*                                                                       05350000
* END OF SPECIFICATIONS *********************************************/  05400000
*% /*                                                                   05450000
.P0      ANOP                                                           05500000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05550000
         AIF   ('&LIST' EQ 'YES').P2                                    05600000
.P1      ANOP                                                           05650000
         PUSH  PRINT                                                    05700000
         PRINT OFF                                                      05750000
.P2      ANOP                                                           05800000
         AIF   ('&LPMEA' EQ 'NO').L0002                                 05850000
         AIF   ('&DSECT' EQ 'YES').L0003                                05900000
         AIF   ('&LPMEA' NE 'YES').L0002                                05950000
LPMEA    DS    0F        Modinfo entry for ADD                          06000000
         AGO   .L0004                                                   06050000
.L0003   ANOP                                                           06100000
LPMEA    DSECT           Modinfo entry for ADD                          06150000
.L0004   ANOP                                                           06200000
LPMEAINPUTINFO DS 1CL0010 Information provided by caller of dynamic    *06220000
                         LPA services. Provided to exit CSVDYLPA.      *06240000
                         Mapping of module entries within Type 90      *06260000
                         Subtype 31 SMF records.                        06280000
         ORG   LPMEAINPUTINFO                                           06300000
LPMEANAME DS   1CL0008   The module name                                06350000
LPMEAINPUTFLAGS DS 1BL2  Flags set by the caller Not applicable to     *06383300
                         exit CSVDYLPA or SMF record.                   06416600
         ORG   LPMEAINPUTFLAGS                                          06450000
LPMEAINPUTFLAGS0 DS 1BL1 Byte 0 of Flags. Not applicable when          *06483300
                         BYADDR=YES.                                    06516600
         ORG   LPMEAINPUTFLAGS0                                         06550000
LPMEAFIXED EQU X'80'     If on, page-fix this module                    06600000
LPMEAPAGEPROTPAGE EQU X'40' If on, page-protect only the whole pages   *06650000
                         of this module. If off, page-protect all      *06700000
                         bytes of this module.                          06750000
LPMEASTORAGEOWNERSYSTEM EQU X'20' If on, the storage in which the      *06800000
                         module is placed is to be OWNER=SYSTEM. If    *06850000
                         off, it is OWNER=HOME.                         06900000
         ORG   LPMEAINPUTFLAGS0+X'00000001'                             06950000
LPMEAINPUTFLAGS1 DS 1BL1 Byte 1 of Flags. Not applicable when          *06983300
                         BYADDR=YES.                                    07016600
         ORG   LPMEAINPUTFLAGS1                                         07020700
LPMEASVC EQU   X'80'     This entry is an SVC. The SVC number is in    *07024800
                         LpmeaxSvcnum.                                  07028900
LPMEAESVC EQU  X'40'     This entry is an extended SVC. The SVC number *07033000
                         is in LpmeaxSvcnum. The extended svc routing  *07037100
                         code is in LpmeaxESvcrnum.                     07041200
         ORG   LPMEAINPUTINFO+X'0000000A'                               07045300
LPMEAOUTPUTINFO DS 1CL0030                                              07050000
         ORG   LPMEAOUTPUTINFO                                          07100000
LPMEAOUTPUTFLAGS DS 1BL2 Output: Flags                                  07150000
         ORG   LPMEAOUTPUTFLAGS                                         07200000
LPMEAOUTPUTFLAGS0 DS 1BL1 Byte 0 of Flags. Only bit LpmeaSuccess is    *07220000
                         applicable to exit CSVDYLPA or SMF record -   *07240000
                         the module entry is only valid when that bit  *07260000
                         is on.                                         07280000
         ORG   LPMEAOUTPUTFLAGS0                                        07300000
LPMEASUCCESS EQU X'80'   Successfully processed                         07350000
LPMEAMODPROB EQU X'40'   A problem occurred processing this entry.     *07400000
                         Function with problem is indicated by         *07450000
                         LpmeaModprobFunction.                          07500000
LPMEAMODPROBABENDINFO EQU X'20' An unexpected abend occurred while     *07535700
                         processing this entry. Further information is *07571400
                         in the LpmeaAbendRsnCodes area.                07607100
LPMEAMODPROBRETURNCODEINFO EQU X'10' An unexpected return code was     *07642800
                         received while processing this entry. Further *07678500
                         information is in the LpmeaRetRsnCodes area.   07714200
         ORG   LPMEAOUTPUTFLAGS0+X'00000001'                            07750000
LPMEAMODPROBFUNCTION DS 1FL1 Function with problem. See equates        *07800000
                         beginning with LpmeaModprob. Valid when       *07850000
                         LpmeaModprob is on.                            07861100
         ORG   LPMEAMODPROBFUNCTION                                     07872200
LPMEASUCCESSCONCATNUM DS 1FL1 The concatenation number (0 to n)        *07883300
                         representing the data set in which the module *07894400
                         was located. This will be 0 when the input    *07905500
                         was by data set (as opposed to by DDNAME or   *07916600
                         DCB address). It is only valid when           *07927700
                         LpmeaSuccess is on, or for exit CSVDYLPA or   *07935100
                         SMF record.                                    07942500
LPMEASTUFF DS  1CL0028                                                  07950000
         ORG   LPMEASTUFF                                               08000000
LPMEASUCCESSINFO DS 1CL0028 Valid only when LpmeaSuccess is on.         08050000
         ORG   LPMEASUCCESSINFO                                         08100000
LPMEADELETETOKEN DS 1CL0008 Output: Token to be used on DELETE for     *08107400
                         this module.                                   08114800
LPMEAENTRYPOINTADDR DS 1AL4 Output: The entry point. (Input for        *08122200
                         BYADDR=YES.) If this is a DELETE event either *08127100
                         for exit CSVDYLPA or for an SMF record, then  *08132000
                         this field represents the entry point address *08136900
                         of the now-current LPA copy of the module, or *08141800
                         has a value of X'7FFFFFFF' when there is no   *08146700
                         remaining LPA copy of the module (in which    *08151600
                         case the LoadPointAddr and Length fields are  *08156500
                         not valid).                                    08161400
         ORG   LPMEAENTRYPOINTADDR                                      08166600
LPMEAENTRYPOINTADDRBYTES0TO2 DS 1BL3                                    08171500
         ORG   LPMEAENTRYPOINTADDRBYTES0TO2                             08176400
LPMEAENTRYPOINTADDRBIT0 EQU X'80' On if AMODE=31 or if the caller is   *08181400
                         AMODE 31 and the entry is AMODE=ANY            08196200
         ORG   LPMEAENTRYPOINTADDRBYTES0TO2+X'00000003'                 08199100
LPMEAENTRYPOINTADDRBYTE3 DS 1BL1                                        08202000
         ORG   LPMEAENTRYPOINTADDRBYTE3                                 08204900
LPMEAENTRYPOINTADDRBIT31 EQU X'01' On if AMODE=64                       08207800
         ORG   LPMEAENTRYPOINTADDR+X'00000004'                          08211000
LPMEALOADPOINTADDR DS 1AL4 Output: The load point. (Input for          *08233200
                         BYADDR=YES.)                                   08255400
LPMEAMODLEN DS 1FL4      Output: The length. (Input for BYADDR=YES.)    08277600
LPMEALOADPOINTADDR2 DS 1AL4 Output: The load point of the secondary    *08300000
                         area. A PDSE module may be split into an      *08350000
                         above-16M part and a below-16M part. When the *08400000
                         module is not split, this will be 0. (Input   *08433300
                         for BYADDR=YES.)                               08466600
LPMEAMODLEN2 DS 1FL4     Output: The length of the secondary area.     *08500000
                         When the module is not split, this will be 0. *08540000
                         (Input for BYADDR=YES.)                        08580000
         ORG   LPMEASTUFF                                               08700000
LPMEARETRSNCODES DS 1CL0008 Valid when LpmeaModprobReturnCodeInfo       08750000
         ORG   LPMEARETRSNCODES                                         08800000
LPMEARETCODE DS 1FL4     Output: Return code from function designated  *08850000
                         in LpmeaModprobFunction                        08900000
LPMEARSNCODE DS 1FL4     Output: Reason code from function designated  *08950000
                         in LpmeaModprobFunction                        09000000
         ORG   LPMEASTUFF                                               09050000
LPMEAABENDRSNCODES DS 1CL0008 Valid when LpmeaModprobAbendInfo          09100000
         ORG   LPMEAABENDRSNCODES                                       09150000
LPMEAABENDCODE DS 1FL4   Output: Abend code from function designated   *09200000
                         in LpmeaModprobFunction                        09250000
LPMEAABENDRSNCODE DS 1FL4 Output: Abend reason code from function      *09300000
                         designated in LpmeaModprobFunction             09350000
         ORG   LPMEAOUTPUTINFO+X'0000001E'                              09400000
LPMEA_LEN_V0 EQU 40      Version 0 length                               09450000
LPMEAMODPROBNOTFOUND EQU 1 The module could not be located via the     *09500000
                         data set, ddname, or DCB@ that was provided    09550000
LPMEAMODPROBNOTAUTH EQU 2 Not authorized to add this module to LPA      09600000
LPMEAMODPROBDIRECTORY EQU 3 Directory processing produced an           *09650000
                         unexpected return code                         09700000
LPMEAMODPROBFETCH EQU 4  FETCH produced an unexpected return code       09750000
LPMEAMODPROBPAGEPROT EQU 6 PGSER PROTECT produced an unexpected abend   09850000
LPMEAMODPROBTOOMANYEXTENTS EQU 7 Only load modules with 1 or 2 extents *09900000
                         defined can be processed.                      09950000
LPMEAMODPROBNOTEXECUTABLE EQU 8 The module is not executable            10000000
LPMEAMODPROBDESERVDESL EQU 10 Directory processing produced an         *10050000
                         unexpected return code                         10100000
LPMEAMODPROBDUPLICATE EQU 11 The member is a duplicate of another      *10150000
                         member.                                        10350000
LPMEAMODPROBUNEXPECTEDABEND EQU 20 An unexpected abend resulted while  *10400000
                         processing. Fields LpmeaAbendcode and         *10450000
                         LpmeaAbendrsncode contain the abend code and  *10500000
                         abend reason code.                             10550000
LPMEA_LEN EQU  *-LPMEA                                                  10600000
.L0002   ANOP                                                           10650000
         AIF   ('&LPMEAX' EQ 'NO').L0005                                10700000
         AIF   ('&DSECT' EQ 'YES').L0006                                10750000
         AIF   ('&LPMEAX' NE 'YES').L0005                               10800000
LPMEAX   DS    0F        Modinfo entry for ADD                          10850000
         AGO   .L0007                                                   10900000
.L0006   ANOP                                                           10950000
LPMEAX   DSECT           Modinfo entry for ADD                          11000000
.L0007   ANOP                                                           11050000
LPMEAXVERSION DS 1FL1    Initial version: 0                             11052700
LPMEAXMOREINPUTINFO DS 1CL0015 Information provided by the caller       11055400
         ORG   LPMEAXMOREINPUTINFO                                      11058100
LPMEAXSVCNUM DS 1FL1     Input SVC num                                  11060800
LPMEAXESVCRNUM DS 1FL1   Input extended SVC routing number              11063500
         DS    1CL0013   Reserved                                       11066200
LPMEAX_LEN_V0 EQU 16     Version 0 length                               11068900
LPMEAX_LEN EQU *-LPMEAX                                                 11071600
.L0005   ANOP                                                           11074300
         AIF   ('&LPMED' EQ 'NO').L0008                                 11077000
         AIF   ('&DSECT' EQ 'YES').L0009                                11079700
         AIF   ('&LPMED' NE 'YES').L0008                                11082400
LPMED    DS    0F        Modinfo entry for DELETE                       11085100
         AGO   .L000A                                                   11087800
.L0009   ANOP                                                           11090500
LPMED    DSECT           Modinfo entry for DELETE                       11093200
.L000A   ANOP                                                           11095900
LPMEDINPUTINFO DS 1CL0018 Information provided by caller                11100000
         ORG   LPMEDINPUTINFO                                           11150000
LPMEDNAME DS   1CL0008   The module name                                11200000
LPMEDDELETETOKEN DS 1CL0008 Token returned when this module was added. *11250000
                         Identifies the copy to delete.                 11300000
LPMEDINPUTFLAGS DS 1BL2  Flags set by the caller                        11350000
         ORG   LPMEDINPUTFLAGS                                          11400000
LPMEDINPUTFLAGS0 DS 1BL1 Byte 0 of Flags                                11450000
LPMEDINPUTFLAGS1 DS 1BL1 Byte 0 of Flags                                11500000
LPMEDOUTPUTINFO DS 1CL0002 Information provided by the system.          11550000
         ORG   LPMEDOUTPUTINFO                                          11600000
LPMEDOUTPUTFLAGS DS 1BL2 Output: Flags                                  11650000
         ORG   LPMEDOUTPUTFLAGS                                         11700000
LPMEDOUTPUTFLAGS0 DS 1BL1 Byte 0 of Flags                               11750000
         ORG   LPMEDOUTPUTFLAGS0                                        11800000
LPMEDSUCCESS EQU X'80'   Successfully processed                         11850000
LPMEDMODPROB EQU X'40'   Problem occurred processing this entry.       *11900000
                         Function with problem is indicated by         *11950000
                         LpmedModprobFunction.                          12000000
         ORG   LPMEDOUTPUTFLAGS0+X'00000001'                            12050000
LPMEDMODPROBFUNCTION DS 1FL1 Function with problem. See equates        *12100000
                         beginning with LpmedModprob. Valid when       *12150000
                         LpmedModprob is on                             12200000
LPMED_LEN_V0 EQU 20      Version 0 length                               12250000
LPMEDMODPROBNOTFOUND EQU 1 The module was not part of dynamic LPA.      12300000
LPMEDMODPROBNOTAUTH EQU 2 Not authorized to delete this module from    *12350000
                         LPA                                            12400000
LPMEDMODPROBUNEXPECTEDABEND EQU 3 An unexpected abend resulted while   *12450000
                         processing.                                    12500000
*                                                                       12550000
*    *****************************************************************  12600000
*    *                                                               *  12650000
*    * Format constants returned for CSVDYLPA REQUEST(QUERYDYN)      *  12700000
*    *                                                               *  12750000
*    *****************************************************************  12800000
*                                                                       12850000
*                                                                       12900000
CSVDYLPADYNNOTAVAILABLE EQU 0                                           12950000
CSVDYLPADYNAVAILABLE EQU 1                                              13000000
*                                                                       13050000
*    *****************************************************************  13100000
*    *                                                               *  13150000
*    * Function constants for exit CSVDYLPA                          *  13200000
*    *                                                               *  13250000
*    *****************************************************************  13300000
*                                                                       13350000
*                                                                       13400000
CSVDYLPAFUNCTIONADD EQU 0                                               13450000
CSVDYLPAFUNCTIONDELETE EQU 1                                            13500000
*                                                                       13550000
*    *****************************************************************  13600000
*    *                                                               *  13650000
*    * Return Code Information It is guaranteed that no reason code  *  13700000
*    * will be reused (i.e., the same reason code will not be used   *  13750000
*    * for more than one return code). Also note carefully that bits *  13800000
*    * 0-15 of the reason code may contain component-diagnostic data *  13850000
*    * and must not be assumed to be 0.                              *  13900000
*    *                                                               *  13950000
*    *****************************************************************  14000000
*                                                                       14050000
*                                                                       14100000
CSVDYLPARSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non   *14150000
                         component-diagnostic portion of the reason    *14200000
                         code.                                          14250000
*                                                                       14300000
*   CSVDYLPA Return and Reason Code definitions                         14350000
*                                                                       14400000
*                                                                       14450000
CSVDYLPARC_OK EQU X'00000000' Meaning: CSVDYLPA request successful.    *14500000
                         Action: None required.                         14550000
CSVDYLPARC_WARN EQU X'00000004' Meaning: Warning Action: Refer to the  *14600000
                         action provided with the specific reason      *14650000
                         code.                                          14700000
CSVDYLPARSNNOTALLSUCCESSFUL EQU X'00000401' Meaning: For ADD and       *14750000
                         DELETE request, at least one input module     *14800000
                         could not be processed successfully.          *14850000
                         Information about the problem is contained    *14900000
                         within the MODINFO entry for that module, in  *14950000
                         field LpmeaOutputFlags (for ADD) or field     *15000000
                         LpmedOutputFlags (for DELETE). The system     *15050000
                         continued to process entries after the one    *15100000
                         for which the problem occurred. Action: Fix   *15150000
                         the problem before requesting the function     15200000
*                        again.                                         15250000
CSVDYLPARC_INVPARM EQU X'00000008' Meaning: CSVDYLPA request specifies *15300000
                         parmeters that are not valid. For ADD and     *15350000
                         DELETE, when the problem occurred while       *15400000
                         processing a particular MODINFO entry, the    *15450000
                         system will not process any additional        *15500000
                         MODINFO entries. Action: Refer to the action  *15550000
                         provided with the specific reason code.        15600000
CSVDYLPARSNBADPARMLIST EQU X'00000801' Meaning: Unable to access       *15650000
                         parameter list. Action: Check for possible    *15700000
                         storage overlay.                               15750000
CSVDYLPARSNSRBMODE EQU X'00000802' Meaning: SRB mode. Action: Avoid    *15800000
                         requesting this function in SRB mode.          15850000
CSVDYLPARSNNOTENABLED EQU X'00000803' Meaning: Not Enabled. Action:    *15900000
                         Avoid requesting this function while not      *15950000
                         enabled.                                       16000000
CSVDYLPARSNHOMENOTPRIMARY EQU X'00000805' Meaning: Home address space  *16200000
                         different from primary address space. Action: *16250000
                         Avoid requesting this function in this        *16300000
                         environment.                                   16350000
CSVDYLPARSNBADREQUESTTYPE EQU X'00000809' Meaning: Request type is not *16400000
                         valid. Action: Check for possible storage     *16450000
                         overlay of the parameter list.                 16500000
CSVDYLPARSNBADESTAEX EQU X'0000080A' Meaning: Unable to establish      *16550000
                         ESTAEX. "xxxx" contains the ESTAEX return     *16600000
                         code. There could be an FRR established.      *16650000
                         Action: Refer to documentation for ESTAEX     *16700000
                         return code "xxxx".                            16750000
CSVDYLPARSNRESERVEDNOT0 EQU X'0000080B' Meaning: Reserved field not 0. *16800000
                         Action: Check for possible storage overlay of *16850000
                         the parameter list.                            16900000
CSVDYLPARSNBADPARMLISTALET EQU X'0000080D' Meaning: Unable to use ALET *16941600
                         of parameter list. Action: Make sure that the *16983200
                         ALET of the parameter list is valid. You      *17024800
                         might not have set up its access register     *17066400
                         properly.                                      17108000
CSVDYLPARSNBADVERSION EQU X'0000080E' Meaning: Bad version number.     *17150000
                         Action: Check for possible storage overlay of *17200000
                         the parameter list.                            17250000
CSVDYLPARSNLOCKED EQU X'0000080F' Meaning: Locked Action: Avoid        *17300000
                         requesting this function in this environment.  17350000
CSVDYLPARSNBADDSNAMEAREA EQU X'00000815' Meaning: Unable to access     *17400000
                         data set name. Action: Make sure that the     *17450000
                         DSNAME area is valid.                          17500000
CSVDYLPARSNBADMODINFOAREA EQU X'00000816' Meaning: Unable to access    *17550000
                         MODINFO area. Action: Make sure that the      *17600000
                         MODINFO area is valid.                         17650000
CSVDYLPARSNBADMODINFOALET EQU X'00000817' Meaning: Unable to use ALET  *17700000
                         of MODINFO area. Action: Make sure that the   *17750000
                         ALET of the MODINFO area is valid. You might  *17800000
                         not have set up its access register properly.  17850000
CSVDYLPARSNBADOPEN EQU X'00000818' Meaning: Unable to open specified   *17900000
                         data set. Action: Make sure that you          *17950000
                         specified the proper data set, that it is a   *17987500
                         PDS or PDSE program library, and that it can  *18025000
                         be located by the system.                      18062500
CSVDYLPARSNBADNUMMOD EQU X'0000081D' Meaning: The value provided by    *18100000
                         the NUMMOD parameter is 0 or exceeds 256.     *18150000
                         Action: Specify a non-zero NUMMOD parameter   *18200000
                         value. Instead of providing more than 256     *18250000
                         entries in a single call, use multiple calls  *18300000
                         each of which provides no more than 256       *18350000
                         entries.                                       18400000
CSVDYLPARSNBADDSNAMEALET EQU X'00000820' Meaning: Bad dsname ALET.     *18450000
                         Action: Make sure that the ALET of the DSNAME *18500000
                         area is valid. You might not have set up its  *18550000
                         access register properly.                      18600000
CSVDYLPARSNBADMODULENAME EQU X'00000822' Meaning: Bad modulename -     *18650000
                         first character is 0 or blank. Action:        *18700000
                         Provide a valid module name.                   18750000
CSVDYLPARSNBADDSNAME EQU X'00000823' Meaning: Bad DSNAME - first       *18800000
                         character is 0 or blank. Action: Provide a    *18850000
                         valid data set name.                           18900000
CSVDYLPARSNBADALLOC EQU X'00000829' Meaning: Unable to allocate data   *18950000
                         set. Action: Make sure that you specified the *19000000
                         proper data set, that it is a PDS or PDSE     *19037500
                         program library, and that it can be located   *19075000
                         by the system.                                 19112500
CSVDYLPARSNFUNCTIONNOTAVAILABLE EQU X'0000082B'                         19150000
*                                                                       19200000
*                                      Meaning: Required DFSMS          19237500
*                                      function or dynamic allocation   19275000
*                                      is not available or request      19312500
*                                      issued prior to the LNKLST       19350000
*                                      being available. Action: Make    19375000
*                                      sure that the required DFSMS     19400000
*                                      support is installed. Avoid      19425000
*                                      requesting the function in an    19450000
*                                      environment where dynamic        19500000
*                                      allocation is not available.     19550000
*                                      Avoid requesting the function    19600000
*                                      until the LNKLST is available.   19650000
*                                      Avoid requesting dynamic LPA     19700000
*                                      services via the PROG=xx         19750000
*                                      parameter of the IEASYSxx        19783300
*                                      parmlib member.                  19816600
*                                                                       19850000
CSVDYLPARSNNOTAUTHDCB EQU X'0000082C' Meaning: Not authorized to use   *19900000
                         DCB option. Must be supervisor state, PKM     *19950000
                         allowing key 0-7, PSW key 0-7, or APF         *20000000
                         authorized. Action: Avoid using the DCB       *20050000
                         option without the required authorization.     20100000
CSVDYLPARSNNOTAUTHCONCAT EQU X'0000082D' Meaning: If not supervisor    *20150000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *20200000
                         APF authorized, or if APFREQUIRED=YES is      *20240000
                         specified or defaulted, the concatenation     *20280000
                         represented by the input DDNAME or DCB must   *20320000
                         be APF authorized. Action: Avoid using a      *20360000
                         non-APF authorized concatenation without the  *20400000
                         required authorization.                        20450000
CSVDYLPARSNNOTAUTHMEMBERMASK EQU X'0000082E' Meaning: Not authorized   *20500000
                         to use MemberMask option. Must be supervisor  *20550000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *20600000
                         APF authorized. Action: Avoid using the       *20650000
                         MODINFOTYPE=MEMBERMASK function without the   *20700000
                         required authorization.                        20750000
CSVDYLPARSNBADMODINFOXAREA EQU X'00000830' Meaning: Unable to access   *20753100
                         MODINFOX area. Action: Make sure that the     *20756200
                         MODINFOX area is valid.                        20759300
CSVDYLPARSNBADMODINFOXALET EQU X'00000831' Meaning: Unable to use ALET *20762400
                         of MODINFOX area. Action: Make sure that the  *20765500
                         ALET of the MODINFOX area is valid. You might *20768600
                         not have set up its access register properly.  20771700
CSVDYLPARSNNOTESVC EQU X'00000833' Meaning: An extended SVC was        *20774800
                         selected, but the specified SVC number is not *20777900
                         an extended SVC. Action: Fix the SVC number.   20781000
CSVDYLPARSNBADESVCRNUM EQU X'00000834' Meaning: The routing number for *20784100
                         the selected extended SVC exceeded the number *20787200
                         of entries for that extended SVC that were    *20790300
                         defined at IPL. Action: Fix the extended SVC  *20793400
                         routine number.                                20796500
CSVDYLPARSNNOTPARTITIONED EQU X'0000083C' Meaning: For ADD request,    *20800000
                         the data set is not partitioned. Action: Make *20837500
                         sure that you specified the proper data set   *20875000
                         and that it is a PDS or PDSE program library.  20912500
CSVDYLPARSNBADBYADDRINFO EQU X'0000083D' Meaning: For ADD request with *20915300
                         BYADDR=YES, the module information is         *20918100
                         incorrect. Action: Make sure that the entry   *20920900
                         point and load point addresses represent      *20923700
                         common area storage. Make sure that the entry *20926500
                         point lies within the primary load segment.    20929300
CSVDYLPARSNNOTAUTHBYADDR EQU X'0000083E' Meaning: Not authorized to    *20932100
                         use BYADDR=YES option. Must be supervisor     *20934900
                         state, PKM allowing key 0-7, PSW key 0-7, or  *20937700
                         APF authorized. Action: Avoid using           *20940500
                         BYADDR=YES without the required               *20943300
                         authorization.                                 20946100
CSVDYLPARSNBADDCBAREA EQU X'0000083F' Meaning: Unable to access the    *20947000
                         opened DCB. Action: Make sure that the DCB    *20947900
                         has been opened.                               20948800
CSVDYLPARSNENQHELDSHARED EQU X'00000840' Meaning: The ENQ resource     *20949000
                         with QNAME SYSZCSV and RNAME CSVDYLPA was     *20949200
                         held in the shared state on entry to dynamic  *20949400
                         LPA services. Action: Avoid holding the ENQ   *20949600
                         shared when using dynamic LPA services.        20949800
CSVDYLPARC_ENV EQU X'0000000C' Meaning: Environmental error Action:    *20950000
                         Refer to the action provided with the         *21000000
                         specific reason code.                          21050000
CSVDYLPARSNNOSTORAGE EQU X'00000C02' Meaning: There is not sufficient  *21500000
                         storage to complete the request. Action:      *21550000
                         Contact your system programmer. There is a    *21600000
                         shortage of common storage.                    21650000
CSVDYLPARSNBADDIRECTORY EQU X'00000C04' Meaning: When using the        *21900000
                         MemberMask option, the data set directory was *21950000
                         in error. Either an I/O error occurred        *22000000
                         accessing the directory, or the format of a   *22050000
                         directory entry was incorrect. Action: Fix    *22100000
                         the data set directory. Make sure that the    *22133300
                         data set is a PDS or PDSE program library.     22166600
CSVDYLPARSNSTORAGELIMEXCEEDED EQU X'00000C05' Meaning: For ADD         *22200000
                         request, the amount of module storage needed  *22250000
                         for the request would have caused the amount  *22294400
                         of CSA or ECSA remaining to fall below the    *22338800
                         threshold specified by the system programmer  *22383200
                         using the LPA CSAMIN statement of PROGxx or   *22427600
                         the SETPROG LPA,CSAMIN system command.        *22472000
                         Action: Specify that fewer modules be added,  *22516400
                         or have the system programmer reduce the      *22560800
                         CSAMIN amounts.                                22605200
CSVDYLPARC_COMPERROR EQU X'00000010' Meaning: Unexpected failure.      *22650000
                         Action: Refer to the action provided with the *22700000
                         specific reason code.                          22750000
CSVDYLPARSNCOMPERROR EQU X'00001001' Meaning: Unexpected failure. The  *22800000
                         state of the request is unpredictable.        *22850000
                         Action: Contact your system programmer.        22900000
LPMED_LEN EQU  *-LPMED                                                  22950000
.L0008   ANOP                                                           23000000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 23050000
         AIF   ('&LIST' EQ 'YES').P4                                    23100000
.P3      ANOP                                                           23150000
         POP   PRINT                                                    23200000
.P4      ANOP                                                           23250000
.P_EXIT  ANOP                                                           23300000
         MEND                                                           23350000
**/ CSVLPRET_2:;                                                        23400000
* %CSVLPRET_INCLUDED = 'YES';                                           23450000
* %DCL ZCBPRINT CHAR EXT;                                               23500000
* %DEACTIVATE ZCBPRINT;                                                 23550000
* %DCL CSVLPRET_LIST CHAR EXT;                                          23600000
* %DEACTIVATE CSVLPRET_LIST;                                            23650000
* %IF CSVLPRET_LIST ^= 'NO' &                                           23700000
*    ZCBPRINT ^= 'NO' %THEN                                             23750000
*   %GOTO CSVLPRET_3;                                                   23800000
*   @LIST PUSH NOECHO;                                                  23850000
*   @LIST NOASSEMBLE NOECHO;                                            23900000
*   @LIST OFF C NOECHO;                                                 23950000
* %CSVLPRET_3:;                                                         24000000
*/* Start of PL/X Source                                             */ 24050000
*DCL 1 LPMEA Type,                 /* Modinfo entry for ADD             24100000
*                                                                @L1A*/ 24150000
*     2 LpmeaInputInfo,       /* Information provided by caller of      24170000
*                    dynamic LPA services. Provided to exit CSVDYLPA.   24190000
*                    Mapping of module entries within                   24210000
*                    Type 90 Subtype 31 SMF records.             @L1A*/ 24230000
*       3 LpmeaNAME CHAR(8), /* The module name                  @L1A*/ 24250000
*       3 LpmeaInputFLAGS BIT(16), /* Flags set by the caller           24275000
*                    Not applicable to exit CSVDYLPA or SMF record.     24300000
*                                                                @L1A*/ 24325000
*         4 LpmeaInputFLAGS0 BIT(8), /* Byte 0 of Flags.                24343700
*                    Not applicable when BYADDR=YES.                    24362400
*                                                                @L1A*/ 24381100
*           5 LpmeaFixed Bit(1), /* If on, page-fix                     24400000
*                                   this module                  @L1A*/ 24450000
*           5 LpmeaPageProtPage Bit(1), /* If on, page-protect only the 24500000
*                    whole pages of this module. If off, page-protect   24550000
*                    all bytes of this module.                   @L1A*/ 24600000
*           5 LpmeaStorageOwnerSystem Bit(1), /* If on, the storage     24650000
*                    in which the module is placed is to be             24700000
*                    OWNER=SYSTEM. If off, it is OWNER=HOME.            24750000
*                                                                @L1A*/ 24800000
*         4 LpmeaInputFLAGS1 BIT(8), /* Byte 1 of Flags.                24825000
*                    Not applicable when BYADDR=YES.                    24850000
*                                                                @L1A*/ 24875000
*           5 LpmeaSvc Bit(1),     /* This entry is an SVC.             24878500
*                    The SVC number is in LpmeaxSvcnum.          @LxA*/ 24882000
*           5 LpmeaESvc Bit(1),    /* This entry is an extended SVC.    24885500
*                    The SVC number is in LpmeaxSvcnum.                 24889000
*                    The extended svc routing code is in                24892500
*                    LpmeaxESvcrnum.                             @LxA*/ 24896000
*     2 LpmeaOutputInfo Bdy(Word,3), /* Information provided by the     24900000
*                                system (except where noted for         24933300
*                                BYADDR=YES).                    @L1A*/ 24966600
*       3 LpmeaOutputFLAGS BIT(16), /* Output: Flags             @L1A*/ 25000000
*         4 LpmeaOutputFLAGS0 BIT(8), /* Byte 0 of Flags.               25020000
*                  Only bit LpmeaSuccess is applicable to exit          25040000
*                  CSVDYLPA or SMF record - the module entry is         25060000
*                  only valid when that bit is on.               @L1A*/ 25080000
*           5 LpmeaSuccess BIT(1), /* Successfully processed     @L1A*/ 25100000
*           5 LpmeaModprob BIT(1), /* A problem occurred processing     25150000
*                  this entry. Function with problem is indicated by    25200000
*                  LpmeaModprobFunction.                         @L1A*/ 25250000
*           5 LpmeaModprobAbendInfo BIT(1),    /* An unexpected abend   25300000
*                 occurred while processing this entry. Further         25350000
*                 information is in the LpmeaAbendRsnCodes area. @L1A*/ 25400000
*           5 LpmeaModprobReturnCodeInfo BIT(1), /* An unexpected       25450000
*                  return code was received while processing this       25500000
*                  entry. Further information is in the                 25550000
*                  LpmeaRetRsnCodes area.                        @L1A*/ 25600000
*         4 LpmeaModprobFunction FIXED(8),      /* Function with        25700000
*                                   problem. See equates beginning      25750000
*                                   with LpmeaModprob. Valid when       25800000
*                                   LpmeaModprob is on.          @L1A*/ 25812500
*           5 LpmeaSuccessConcatNum FIXED(8),    /* The concatenation   25825000
*                     number (0 to n) representing the data set in      25837500
*                     which the module was located. This will be 0      25850000
*                     when the input was by data set (as opposed to     25862500
*                     by DDNAME or DCB address). It is only valid       25875000
*                     when LpmeaSuccess is on, or for exit              25883300
*                     CSVDYLPA or SMF record.                    @L1A*/ 25891600
*       3 LpmeaStuff UNION,        /*                            @L1A*/ 25900000
*        4 LpmeaSuccessInfo,       /* Valid only when LpmeaSuccess is   25925900
*                    on.                                         @L1A*/ 25951800
*         5 LpmeaDeleteToken CHAR(8), /* Output: Token to be used on    25977700
*                                      DELETE for this module.   @L1A*/ 25988800
*         5 LpmeaEntryPointAddr PTR, /* Output: The entry point.        26000000
*                                       (Input for BYADDR=YES.)         26007500
*                    If this is a DELETE event either for exit          26015000
*                    CSVDYLPA or for an SMF record, then this field     26022500
*                    represents the entry point address of the          26030000
*                    now-current LPA copy of the module, or has         26037500
*                    a value of X'7FFFFFFF' when there is no remaining  26045000
*                    LPA copy of the module (in which case the          26052500
*                    LoadPointAddr and Length fields are not            26060000
*                    valid).                                     @L1A*/ 26067500
*           7 LpmeaEntryPointAddrBytes0To2 Bit(24),  /*          @L2A*/ 26072900
*              9 LpmeaEntryPointAddrBit0 BIT(1), /* On if AMODE=31      26078300
*                    or if the caller is AMODE 31 and the               26083700
*                    entry is AMODE=ANY                          @L1A*/ 26091800
*           7 LpmeaEntryPointAddrByte3 Bit(8),       /*          @L2A*/ 26093400
*              9 * Bit(7),                       /* Not mapped   @L2A*/ 26095000
*              9 LpmeaEntryPointAddrBit31 BIT(1), /* On if AMODE=64     26096600
*                                                                @L2A*/ 26098200
*         5 LpmeaLoadPointAddr PTR, /* Output: The load point.          26100000
*                                       (Input for BYADDR=YES.)         26125000
*                                                                @L1A*/ 26150000
*         5 LpmeaModLen FIXED,   /* Output: The length.                 26200000
*                                       (Input for BYADDR=YES.)         26225000
*                                                                @L1A*/ 26250000
*         5 LpmeaLoadPointAddr2 PTR, /* Output: The load point of the   26300000
*                     secondary area. A PDSE module may be split into   26350000
*                     an above-16M part and a below-16M part. When      26400000
*                     the module is not split, this will be 0.          26450000
*                     (Input for BYADDR=YES.)                           26475000
*                                                                @L1A*/ 26500000
*         5 LpmeaModLen2 FIXED,   /* Output: The length of the          26550000
*                     secondary area. When the module is not split,     26600000
*                     this will be 0.                                   26650000
*                     (Input for BYADDR=YES.)                           26675000
*                                                                @L1A*/ 26700000
*        4 LpmeaRetRsnCodes,       /* Valid when                        26850000
*                     LpmeaModprobReturnCodeInfo                 @L1A*/ 26900000
*         5 LpmeaRetcode FIXED,      /* Output: Return code             26950000
*                     from function designated in LpmeaModprobFunction  27000000
*                                                                @L1A*/ 27050000
*         5 LpmeaRsncode FIXED,     /* Output: Reason code              27100000
*                     from function designated in LpmeaModprobFunction  27150000
*                                                                @L1A*/ 27200000
*        4 LpmeaAbendRsnCodes,     /* Valid when                        27250000
*                     LpmeaModprobAbendInfo                      @L1A*/ 27300000
*         5 LpmeaAbendCode FIXED,    /* Output: Abend code              27350000
*                     from function designated in LpmeaModprobFunction  27400000
*                                                                @L1A*/ 27450000
*         5 LpmeaAbendRsnCode FIXED,  /* Output: Abend reason           27500000
*                code from function designated in LpmeaModprobFunction  27550000
*                                                                @L1A*/ 27600000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 27900000
*Dcl Lpmea_Len_V0 Constant(Length(Lpmea));     /* Version 0 length      27950000
*                                                                @L1A*/ 28000000
*Dcl LpmeaModprobNotFound Constant(1);         /* The module could not  28050000
*                  be located via the data set, ddname, or DCB@         28100000
*                  that was provided                             @L1A*/ 28150000
*Dcl LpmeaModprobNotAuth Constant(2);          /* Not authorized to     28200000
*                  add this module to LPA                        @L1A*/ 28250000
*Dcl LpmeaModprobDirectory Constant(3);        /* Directory processing  28300000
*                  produced an unexpected return code            @L1A*/ 28350000
*Dcl LpmeaModprobFetch Constant(4);            /* FETCH produced an     28400000
*                  unexpected return code                        @L1A*/ 28450000
*Dcl LpmeaModprobPageProt Constant(6);         /* PGSER PROTECT         28600000
*                  produced an unexpected abend                  @L1A*/ 28650000
*Dcl LpmeaModprobTooManyExtents Constant(7); /* Only load modules       29050000
*                  with 1 or 2 extents defined can be processed.        29100000
*                                                                @L1A*/ 29150000
*Dcl LpmeaModprobNotExecutable Constant(8);    /* The module            29200000
*                  is not executable                             @L1A*/ 29250000
*Dcl LpmeaModprobDeservDESL Constant(10);      /* Directory processing  29300000
*                  produced an unexpected return code            @L1A*/ 29350000
*Dcl LpmeaModprobDuplicate Constant(11);      /* The member is a        29400000
*                  duplicate of another member.                  @L1A*/ 29650000
*Dcl LpmeaModprobUnexpectedAbend Constant(20); /* An unexpected abend   29700000
*                  resulted while processing. Fields LpmeaAbendcode and 29750000
*                  LpmeaAbendrsncode contain the abend code and         29800000
*                  abend reason code.                                   29850000
*                                                                @L1A*/ 29853800
*                                                                       29857600
*DCL 1 LPMEAX Type Bdy(Word),      /* Modinfo entry for ADD      @LxA*/ 29861400
*     2 LpmeaxVersion Fixed(8),    /* Initial version: 0         @LxA*/ 29865200
*     2 LpmeaxMoreInputInfo,       /* Information provided by the       29869000
*                                     caller                     @LxA*/ 29872800
*       3 LpmeaxSvcnum Fixed(8),   /* Input SVC num              @Lxa*/ 29876600
*       3 LpmeaxESvcrNum Fixed(8),  /* Input extended SVC routing       29880400
*                                      number                    @LxA*/ 29884200
*       3 * Char(13),              /* Reserved                   @Lxa*/ 29888000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @LxA*/ 29891800
*Dcl Lpmeax_Len_V0 Constant(Length(Lpmeax));   /* Version 0 length      29895600
*                                                                @L1A*/ 29900000
*                                                                       29950000
*DCL 1 LPMED Type,                 /* Modinfo entry for DELETE          30000000
*                                                                @L1A*/ 30050000
*     2 LpmedInputInfo,       /* Information provided by caller  @L1A*/ 30100000
*       3 LpmedNAME CHAR(8), /* The module name                  @L1A*/ 30150000
*       3 LpmedDeleteToken CHAR(8),  /* Token returned when this        30200000
*                     module was added. Identifies the copy to delete.  30250000
*                                                                @L1A*/ 30300000
*       3 LpmedInputFLAGS BIT(16), /* Flags set by the caller    @L1A*/ 30350000
*         4 LpmedInputFLAGS0 BIT(8), /* Byte 0 of Flags          @L1A*/ 30400000
*         4 LpmedInputFLAGS1 BIT(8), /* Byte 0 of Flags          @L1A*/ 30450000
*     2 LpmedOutputInfo,      /* Information provided by the            30500000
*                                system.                         @L1A*/ 30550000
*       3 LpmedOutputFLAGS BIT(16), /* Output: Flags             @L1A*/ 30600000
*         4 LpmedOutputFLAGS0 BIT(8), /* Byte 0 of Flags         @L1A*/ 30650000
*           5 LpmedSuccess BIT(1), /* Successfully processed     @L1A*/ 30700000
*           5 LpmedModprob BIT(1), /* Problem occurred processing this  30750000
*                  entry. Function with problem is indicated by         30800000
*                  LpmedModprobFunction.                         @L1A*/ 30850000
*         4 LpmedModprobFunction FIXED(8),      /* Function with        30900000
*                                   problem. See equates beginning      30950000
*                                   with LpmedModprob. Valid when       31000000
*                                   LpmedModprob is on           @L1A*/ 31050000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 31100000
*Dcl Lpmed_Len_V0 Constant(Length(Lpmed));     /* Version 0 length      31150000
*                                                                @L1A*/ 31200000
*Dcl LpmedModprobNotFound Constant(1);         /* The module was not    31250000
*                  part of dynamic LPA.                          @L1A*/ 31300000
*Dcl LpmedModprobNotAuth Constant(2);          /* Not authorized to     31350000
*                  delete this module from LPA                   @L1A*/ 31400000
*Dcl LpmedModprobUnexpectedAbend Constant(3); /* An unexpected abend    31450000
*                  resulted while processing.                    @L1A*/ 31500000
*                                                                       31550000
*                                                                       31600000
*    /* Format constants returned for CSVDYLPA REQUEST(QUERYDYN)     */ 31650000
*DCL CsvdylpaDynNotAvailable Fixed(8) Constant(0);            /* @L1A*/ 31700000
*DCL CsvdylpaDynAvailable Fixed(8) Constant(1);               /* @L1A*/ 31750000
*                                                                       31800000
*    /* Function constants for exit CSVDYLPA                         */ 31850000
*DCL CsvdylpaFunctionAdd Fixed(8) Constant(0);                /* @L1A*/ 31900000
*DCL CsvdylpaFunctionDelete Fixed(8) Constant(1);             /* @L1A*/ 31950000
*                                                                       32000000
*    /* Return Code Information                                      */ 32050000
*                                                                       32100000
*    /* It is guaranteed that                                           32150000
*       no reason code will be reused (i.e., the same reason code       32200000
*       will not be used for more than one return code).            */  32250000
*                                                                       32300000
*    /* Also note carefully that bits 0-15 of the reason code           32350000
*       may contain component-diagnostic data and must not be           32400000
*       assumed to be 0.                                            */  32450000
*                                                                       32500000
*Dcl CsvdylpaRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this     32550000
*               mask to isolate the non component-diagnostic            32600000
*               portion of the reason code.                      @L1A*/ 32650000
*/* CSVDYLPA Return and Reason Code definitions                      */ 32700000
*DCL CsvdylpaRc_OK BIT(32) Constant('00000000'X) ; /*                   32750000
*                        Meaning: CSVDYLPA request successful.          32800000
*                        Action: None required.                      */ 32850000
*DCL CsvdylpaRc_Warn BIT(32) Constant('00000004'X) ; /*                 32900000
*                        Meaning: Warning                               32950000
*                        Action: Refer to the action provided with the  33000000
*                        specific reason code.                       */ 33050000
*DCL CsvdylpaRsnNotAllSuccessful BIT(32) Constant('00000401'X) ; /*     33100000
*                        Meaning: For ADD and DELETE request, at least  33150000
*                        one input module could not be processed        33200000
*                        successfully. Information about the problem is 33250000
*                        contained within the MODINFO entry for that    33300000
*                        module, in field LpmeaOutputFlags (for ADD) or 33350000
*                        field LpmedOutputFlags (for DELETE). The       33400000
*                        system continued to process entries after the  33450000
*                        one for which the problem occurred.            33500000
*                        Action: Fix the problem before requesting the  33550000
*                        function again.                             */ 33600000
*DCL CsvdylpaRc_InvParm BIT(32) Constant('00000008'X) ; /*              33650000
*                        Meaning: CSVDYLPA request specifies parmeters  33700000
*                        that are not valid. For ADD and DELETE, when   33750000
*                        the problem occurred while processing a        33800000
*                        particular MODINFO entry, the system will not  33850000
*                        process any additional MODINFO entries.        33900000
*                        Action: Refer to the action provided with the  33950000
*                        specific reason code.                       */ 34000000
*DCL CsvdylpaRsnBadParmlist BIT(32) Constant('00000801'X) ; /*          34050000
*                        Meaning: Unable to access parameter list.      34100000
*                        Action: Check for possible storage overlay. */ 34150000
*DCL CsvdylpaRsnSrbMode BIT(32) Constant('00000802'X) ; /*              34200000
*                        Meaning: SRB mode.                             34250000
*                        Action: Avoid requesting this function in SRB  34300000
*                        mode.                                       */ 34350000
*DCL CsvdylpaRsnNotEnabled BIT(32) Constant('00000803'X) ; /*           34400000
*                        Meaning: Not Enabled.                          34450000
*                        Action: Avoid requesting this function while   34500000
*                        not enabled.                                */ 34550000
*DCL CsvdylpaRsnHomeNotPrimary BIT(32) Constant('00000805'X) ; /*       34800000
*                        Meaning: Home address space different from     34850000
*                        primary address space.                         34900000
*                        Action: Avoid requesting this function in this 34950000
*                        environment.                                */ 35000000
*DCL CsvdylpaRsnBadRequestType BIT(32) Constant('00000809'X) ; /*       35050000
*                        Meaning: Request type is not valid.            35100000
*                        Action: Check for possible storage overlay of  35150000
*                        the parameter list.                         */ 35200000
*DCL CsvdylpaRsnBadEstaex BIT(32) Constant('0000080A'X) ; /*            35250000
*                        Meaning: Unable to establish ESTAEX. "xxxx"    35300000
*                        contains the ESTAEX return code. There could   35350000
*                        be an FRR established.                         35400000
*                        Action: Refer to documentation for ESTAEX      35450000
*                        return code "xxxx".                         */ 35500000
*DCL CsvdylpaRsnReservedNot0 BIT(32) Constant('0000080B'X) ; /*         35550000
*                        Meaning: Reserved field not 0.                 35600000
*                        Action: Check for possible storage overlay of  35650000
*                        the parameter list.                         */ 35700000
*DCL CsvdylpaRsnBadParmlistALET BIT(32) Constant('0000080D'X) ; /*      35750000
*                        Meaning: Unable to use ALET of parameter list. 35800000
*                        Action: Make sure that the ALET of the         35850000
*                        parameter list is valid. You might not have    35900000
*                        set up its access register properly.        */ 35950000
*DCL CsvdylpaRsnBadVersion BIT(32) Constant('0000080E'X) ; /*           36000000
*                        Meaning: Bad version number.                   36050000
*                        Action: Check for possible storage overlay of  36100000
*                        the parameter list.                         */ 36150000
*DCL CsvdylpaRsnLocked BIT(32) Constant('0000080F'X) ; /*               36200000
*                        Meaning: Locked                                36250000
*                        Action: Avoid requesting this function in this 36300000
*                        environment.                                */ 36350000
*DCL CsvdylpaRsnBadDsnameArea BIT(32) Constant('00000815'X) ; /*        36400000
*                        Meaning: Unable to access data set name.       36450000
*                        Action: Make sure that the DSNAME area is      36500000
*                        valid.                                      */ 36550000
*DCL CsvdylpaRsnBadModinfoArea BIT(32) Constant('00000816'X) ; /*       36600000
*                        Meaning: Unable to access MODINFO area.        36650000
*                        Action: Make sure that the MODINFO area is     36700000
*                        valid.                                      */ 36750000
*DCL CsvdylpaRsnBadModinfoALET BIT(32) Constant('00000817'X) ; /*       36800000
*                        Meaning: Unable to use ALET of MODINFO area.   36850000
*                        Action: Make sure that the ALET of the MODINFO 36900000
*                        area is valid. You might not have set up its   36950000
*                        access register properly.                   */ 37000000
*DCL CsvdylpaRsnBadOpen BIT(32) Constant('00000818'X) ; /*              37050000
*                        Meaning: Unable to open specified data set.    37100000
*                        Action: Make sure that you specified the       37150000
*                        proper data set, that it is a PDS or PDSE      37187500
*                        program library, and that it can be located by 37225000
*                        the system.                                 */ 37262500
*DCL CsvdylpaRsnBadNumMod BIT(32) Constant('0000081D'X) ; /*            37300000
*                        Meaning: The value provided by the NUMMOD      37350000
*                        parameter is 0 or exceeds 256.                 37400000
*                        Action: Specify a non-zero NUMMOD parameter    37450000
*                        value. Instead of providing more than 256      37500000
*                        entries in a single call, use multiple calls   37550000
*                        each of which provides no more than 256        37600000
*                        entries.                                    */ 37650000
*DCL CsvdylpaRsnBadDsnameALET BIT(32) Constant('00000820'X) ; /*        37700000
*                        Meaning: Bad dsname ALET.                      37750000
*                        Action: Make sure that the ALET of the DSNAME  37800000
*                        area is valid. You might not have set up its   37850000
*                        access register properly.                   */ 37900000
*DCL CsvdylpaRsnBadModuleName BIT(32) Constant('00000822'X) ; /*        37950000
*                        Meaning: Bad modulename - first character is 0 38000000
*                        or blank.                                      38050000
*                        Action: Provide a valid module name.        */ 38100000
*DCL CsvdylpaRsnBadDsname BIT(32) Constant('00000823'X) ; /*            38150000
*                        Meaning: Bad DSNAME - first character is 0 or  38200000
*                        blank.                                         38250000
*                        Action: Provide a valid data set name.      */ 38300000
*DCL CsvdylpaRsnBadAlloc BIT(32) Constant('00000829'X) ; /*             38350000
*                        Meaning: Unable to allocate data set.          38400000
*                        Action: Make sure that you specified the       38450000
*                        proper data set, that it is a PDS or PDSE      38487500
*                        program library, and that it can be located by 38525000
*                        the system.                                 */ 38562500
*DCL CsvdylpaRsnFunctionNotAvailable BIT(32) Constant('0000082B'X) ; /* 38600000
*                        Meaning: Required DFSMS function or dynamic    38641600
*                        allocation is not available or request issued  38683200
*                        prior to the LNKLST being available.           38724800
*                        Action: Make sure that the required DFSMS      38766400
*                        support is installed. Avoid requesting the     38808000
*                        function in an environment where dynamic       38849600
*                        allocation is not available. Avoid requesting  38891200
*                        the function until the LNKLST is available.    38932800
*                        Avoid requesting dynamic LPA services via the  38974400
*                        PROG=xx parameter of the IEASYSxx parmlib      39016000
*                        member.                                     */ 39057600
*DCL CsvdylpaRsnNotAuthDCB BIT(32) Constant('0000082C'X) ; /*           39100000
*                        Meaning: Not authorized to use DCB option.     39150000
*                        Must be supervisor state, PKM allowing key     39200000
*                        0-7, PSW key 0-7, or APF authorized.           39250000
*                        Action: Avoid using the DCB option without the 39300000
*                        required authorization.                     */ 39350000
*DCL CsvdylpaRsnNotAuthConcat BIT(32) Constant('0000082D'X) ; /*        39400000
*                        Meaning: If not supervisor state, PKM allowing 39441600
*                        key 0-7, PSW key 0-7, or APF authorized, or if 39483200
*                        APFREQUIRED=YES is specified or defaulted, the 39524800
*                        concatenation represented by the input DDNAME  39566400
*                        or DCB must be APF authorized.                 39608000
*                        Action: Avoid using a non-APF authorized       39650000
*                        concatenation without the required             39700000
*                        authorization.                              */ 39750000
*DCL CsvdylpaRsnNotAuthMemberMask BIT(32) Constant('0000082E'X) ; /*    39800000
*                        Meaning: Not authorized to use MemberMask      39850000
*                        option. Must be supervisor state, PKM allowing 39900000
*                        key 0-7, PSW key 0-7, or APF authorized.       39950000
*                        Action: Avoid using the MODINFOTYPE=MEMBERMASK 40000000
*                        function without the required authorization.   40050000
*                                                                    */ 40100000
*DCL CsvdylpaRsnBadModinfoxArea BIT(32) Constant('00000830'X) ; /*      40102300
*                        Meaning: Unable to access MODINFOX area.       40104600
*                        Action: Make sure that the MODINFOX area is    40106900
*                        valid.                                      */ 40109200
*DCL CsvdylpaRsnBadModinfoxALET BIT(32) Constant('00000831'X) ; /*      40111500
*                        Meaning: Unable to use ALET of MODINFOX area.  40113800
*                        Action: Make sure that the ALET of the         40116100
*                        MODINFOX area is valid. You might not have set 40118400
*                        up its access register properly.            */ 40120700
*DCL CsvdylpaRsnNotESVC BIT(32) Constant('00000833'X) ; /*              40123000
*                        Meaning: An extended SVC was selected, but the 40125300
*                        specified SVC number is not an extended SVC.   40127600
*                        Action: Fix the SVC number.                 */ 40129900
*DCL CsvdylpaRsnBadESvcrnum BIT(32) Constant('00000834'X) ; /*          40132200
*                        Meaning: The routing number for the selected   40134500
*                        extended SVC exceeded the number of entries    40136800
*                        for that extended SVC that were defined at     40139100
*                        IPL.                                           40141400
*                        Action: Fix the extended SVC routine number.   40143700
*                                                                    */ 40146000
*DCL CsvdylpaRsnNotPartitioned BIT(32) Constant('0000083C'X) ; /*       40150000
*                        Meaning: For ADD request, the data set is not  40200000
*                        partitioned.                                   40250000
*                        Action: Make sure that you specified the       40300000
*                        proper data set and that it is a PDS or PDSE   40333300
*                        program library.                            */ 40366600
*DCL CsvdylpaRsnBadByaddrInfo BIT(32) Constant('0000083D'X) ; /*        40368900
*                        Meaning: For ADD request with BYADDR=YES, the  40371200
*                        module information is incorrect.               40373500
*                        Action: Make sure that the entry point and     40375800
*                        load point addresses represent common area     40378100
*                        storage. Make sure that the entry point lies   40380400
*                        within the primary load segment.            */ 40382700
*DCL CsvdylpaRsnNotAuthByaddr BIT(32) Constant('0000083E'X) ; /*        40385000
*                        Meaning: Not authorized to use BYADDR=YES      40387300
*                        option. Must be supervisor state, PKM allowing 40389600
*                        key 0-7, PSW key 0-7, or APF authorized.       40391900
*                        Action: Avoid using BYADDR=YES without the     40394200
*                        required authorization.                     */ 40396500
*DCL CsvdylpaRsnBadDcbArea BIT(32) Constant('0000083F'X) ; /*           40397200
*                        Meaning: Unable to access the opened DCB.      40397900
*                        Action: Make sure that the DCB has been        40398600
*                        opened.                                     */ 40399300
*DCL CsvdylpaRsnEnqHeldShared BIT(32) Constant('00000840'X) ; /*        40399400
*                        Meaning: The ENQ resource with QNAME SYSZCSV   40399500
*                        and RNAME CSVDYLPA was held in the shared      40399600
*                        state on entry to dynamic LPA services.        40399700
*                        Action: Avoid holding the ENQ shared when      40399800
*                        using dynamic LPA services.                 */ 40399900
*DCL CsvdylpaRc_Env BIT(32) Constant('0000000C'X) ; /*                  40400000
*                        Meaning: Environmental error                   40450000
*                        Action: Refer to the action provided with the  40500000
*                        specific reason code.                       */ 40550000
*DCL CsvdylpaRsnNoStorage BIT(32) Constant('00000C02'X) ; /*            40850000
*                        Meaning: There is not sufficient storage to    40900000
*                        complete the request.                          40950000
*                        Action: Contact your system programmer. There  41000000
*                        is a shortage of common storage.            */ 41050000
*DCL CsvdylpaRsnBadDirectory BIT(32) Constant('00000C04'X) ; /*         41350000
*                        Meaning: When using the MemberMask option, the 41400000
*                        data set directory was in error. Either an I/O 41450000
*                        error occurred accessing the directory, or the 41500000
*                        format of a directory entry was incorrect.     41550000
*                        Action: Fix the data set directory. Make sure  41575000
*                        that the data set is a PDS or PDSE program     41600000
*                        library.                                    */ 41625000
*DCL CsvdylpaRsnStoragelimExceeded BIT(32) Constant('00000C05'X) ; /*   41650000
*                        Meaning: For ADD request, the amount of module 41700000
*                        storage needed for the request would have      41740000
*                        caused the amount of CSA or ECSA remaining to  41780000
*                        fall below the threshold specified by the      41820000
*                        system programmer using the LPA CSAMIN         41860000
*                        statement of PROGxx or the SETPROG LPA,CSAMIN  41900000
*                        system command.                                41940000
*                        Action: Specify that fewer modules be added,   41980000
*                        or have the system programmer reduce the       42020000
*                        CSAMIN amounts.                             */ 42060000
*DCL CsvdylpaRC_CompError BIT(32) Constant('00000010'X) ; /*            42100000
*                        Meaning: Unexpected failure.                   42150000
*                        Action: Refer to the action provided with the  42200000
*                        specific reason code.                       */ 42250000
*DCL CsvdylpaRsnCompError BIT(32) Constant('00001001'X) ; /*            42300000
*                        Meaning: Unexpected failure. The state of the  42350000
*                        request is unpredictable.                      42400000
*                        Action: Contact your system programmer.     */ 42450000
*/* End of CSVDYLPA Return and Reason Code definitions               */ 42500000
* @LOGIC;                                                               42550000
* #PRAGMA TOOL=CBGEN.                                                   42600000
* #USEORG.                                                              42650000
* #EPRAGMA.                                                             42700000
* @ENDLOGIC;                                                            42750000
*/* End of PL/X Source                                               */ 42800000
* %IF CSVLPRET_LIST ^= 'NO' &                                           42850000
*    ZCBPRINT ^= 'NO' %THEN                                             42900000
*   %GOTO CSVLPRET_4;                                                   42950000
*   @LIST POP NOECHO;                                                   43000000
* %CSVLPRET_4:;                                                         43050000
* %END;                                                                 43100000
