*                                                                       00050000
* %DCL CSVMODI_INCLUDED CHAR EXT;                                       00100000
* %DEACTIVATE CSVMODI_INCLUDED;                                         00150000
* %IF CSVMODI_INCLUDED = '' %THEN                                       00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99152. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00500000
         MACRO                                                          00550000
         CSVMODI &DSECT=YES,&LIST=YES,&TITLE=YES,&MODI_HEADER=YES,     *00580000
               &MODI_1=COND,&MODI_2=COND,&MODI_SEGLEN=COND,            *00610000
               &MODI_SEGADDR=COND,&MODI_3=COND,&MODI_4=COND,           *00640000
               &MODI_5=COND                                             00670000
         GBLC  &CSVMODI_INCLUDED                                        00700000
         GBLC  &ZCBPRINT                                                00750000
&CSVMODI_INCLUDED SETC 'YES'                                            00800000
         AIF   ('&LIST' EQ 'NONE').P0                                   00816600
         AIF   ('&TITLE' EQ 'NO').P5                                    00833200
 TITLE   'CSVMODI  - Contents module information                    '   00850000
.P5      ANOP                                                           00900000
**/ CSVMODI_1:;                                                         00950000
*/* START OF SPECIFICATIONS ******************************************* 01000000
*                                                                    */ 01050000
*/***PROPRIETARY_STATEMENT********************************************/ 01100000
*/*                                                                  */ 01150000
*/*01* PROPRIETARY STATEMENT =                                       */ 01200000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01250000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01300000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1990, 2000                 */ 01350000
*/*                                                                  */ 01450000
*/* STATUS= HBB7703                                                  */ 01500000
*/*                                                                  */ 01550000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01600000
*/*                                                                     01650000
*01* DESCRIPTIVE NAME:  Contents module information                     01700000
*02*  ACRONYM:  MODI                                                    01750000
*                                                                       01800000
*01* MACRO NAME:  CSVMODI                                               01850000
*                                                                       01862500
*01* EXTERNAL CLASSIFICATION: PI                                        01875000
*01* END OF EXTERNAL CLASSIFICATION:                                    01887500
*                                                                       01900000
*01* DSECT NAME:                                                        01950000
*     MODI_HEADER MODI_1 MODI_2 MODI_3 MODI_4 MODI_5                    01983300
*     MODI_SEGLEN MODI_SEGADDR                                          02016600
*                                                                       02050000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           02100000
*                                                                       02150000
*01* EYE-CATCHER:  MODI                                                 02200000
*02*  OFFSET: 0                                                         02216600
*02*  LENGTH: 4                                                         02233200
*                                                                       02250000
*01* STORAGE ATTRIBUTES:                                                02300000
*02*  SUBPOOL: 0                                                        02350000
*02*  KEY:  User                                                        02400000
*                                                                       02450000
*01* SIZE:                                                              02490000
*                MODI_HEADER  -- X'0044' bytes                          02530000
*                MODI_1       -- X'001C' bytes                          02570000
*                MODI_2       -- X'000C' bytes                          02610000
*                MODI_3       -- X'0020' bytes                          02650000
*                MODI_4       -- X'0004' bytes                          02690000
*                MODI_5       -- X'0008' bytes                          02730000
*                MODI_SEGLEN  -- X'0004' bytes                          02770000
*                MODI_SEGADDR -- X'0004' bytes                          02810000
*                                                                       02850000
*01* CREATED BY:                                                        02900000
*     CSVINFO service                                                   02950000
*                                                                       03000000
*01* POINTED TO BY:                                                     03050000
*     This is a mapping for a parameter to the user routine             03090000
*     called by the CSVINFO service (CSVINFOM).  When the               03130000
*     user routine gets control, register 1 points to a                 03170000
*     pointer to this information.                                      03210000
*                                                                       03250000
*01* SERIALIZATION:                                                     03300000
*     Local lock for Job Pack Q and CMS lock for LPA for                03350000
*     callers that are Supervisor state and PSW key 0.                  03400000
*                                                                       03450000
*01* FUNCTION:                                                          03500000
*02* To provide information associated with an entry point.             03550000
*                                                                       03600000
*01* METHOD OF ACCESS:                                                  03650000
*                                                                       03700000
*02*  ASM: DSECTS are produced.                                         03733300
*          Usings are required for MODI_HEADER                          03766600
*          and for individual sections (MODI_1, MODI_2 ...).            03800000
*                                                                       03804500
*     Default: DSECT=YES,MODI_HEADER=YES,MODI_1=COND,MODI_2=COND,       03809000
*              MODI_3=COND,MODI_4=COND,MODI_5=COND,                     03813500
*              MODI_SEGLEN=COND,MODI_SEGADDR=COND                       03818000
*     Notes: name=YES  => expand                                        03822500
*            name=NO   => do not expand                                 03827000
*            name=COND => expand only if DSECT=YES                      03831500
*                                                                       03836000
*                                                                       03840500
*                                                                       03845000
*02*  PL/AS:                                                            03850000
*      %INCLUDE SYSLIB(CSVMODI)                                         03900000
*                                                                       03950000
*01* DELETED BY: CSVINFO                                                04000000
*                                                                       04050000
*01* FREQUENCY: 1 per CSVINFO invocation.                               04100000
*                                                                       04150000
*01* DEPENDENCIES: None                                                 04200000
*                                                                       04250000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      04300000
*                                                                       04350000
*01* CHANGE ACTIVITY:                                                   04400000
*   $L0 = PGMSP , HBB4430, 920318, PD34CA: Introduce CSVINFO      @L0A  04416600
*   $L1 = PGMSP , HBB4430, 920429, PD34EP: Add LOOP_LIMIT code    @L1A  04433200
*   $L2 = PGMSP , HBB4430, 920429, PD34NP: Add flags              @L2A  04449800
*   $L3 = PGMSP , HBB4430, 920729, PD34NP: Add MODI_USED_BY_RACF  @L3A  04458100
*   $D1 = PGMSP , HBB4430, 920617, PD34EP: Add INELIGIBLE_RB code @D1A  04466400
*                                          Add MIPR_FAILED code   @D1A  04483000
*   $P1 = PKBxxxx,HBB4430, 920618, PD34CA: Fix assembler problem        04487200
*                                          caused by double declares    04491400
*                                          for variables named x_LEN    04495600
*   $P2 = PKB3942,HBB4430, 920729, PD34NP: Multiple extents             04497800
*   $01 = OW02434,HBB4430, 940523, PD34DH: Add MODI_RB_LOOP code  @01A  04498900
*   $P3 = PN71686,HBB5520, 941006, PD00KC: Add EXTERNAL CLASSIFICATION  04499200
*                                          statement to prolog          04499500
*   $P4 = PSY0546,JBB6604, 970326, PD00XB: Document MODI_2 better       04499700
*   $L4 =64BITCSV HBB7703  981204  PD00XB: ESAME                        04499800
*                                                                       04500000
* END OF SPECIFICATIONS **********************************************/ 04550000
*% /*                                                                   04600000
.P0      ANOP                                                           04625000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04650000
         AIF   ('&LIST' EQ 'YES').P2                                    04700000
.P1      ANOP                                                           04750000
         PUSH  PRINT                                                    04800000
         PRINT OFF                                                      04850000
.P2      ANOP                                                           04900000
*                                                                       04950000
* ********************************************************************  05000000
* *                                                                  *  05050000
* *  Tell CBGEN to generate lengths for x named x_LLL.  This         *  05080000
* *  prevents a conflict with the declared names.  The default       *  05110000
* *  is x_LEN (e.g. MODI_1_LEN).                                     *  05140000
* *                                                                     05170000
* ********************************************************************  05200000
*                                                                       05250000
*                                                                       05300000
         AIF   ('&MODI_HEADER' EQ 'NO').L0002                           05350000
         AIF   ('&DSECT' EQ 'YES').L0003                                05400000
         AIF   ('&MODI_HEADER' NE 'YES').L0002                          05450000
MODI_HEADER DS 0F                                                       05500000
         AGO   .L0004                                                   05550000
.L0003   ANOP                                                           05600000
MODI_HEADER DSECT                                                       05650000
.L0004   ANOP                                                           05700000
MODI_EYECATCHER DS 1CL0004 = 'MODI'                                     05750000
MODI_USERDATA DS 1CL0016 Copy of CSVINFO USERDATA                       05800000
MODI_ABDPL DS  1AL4      Address of ABDUMP parmlist                     05850000
MODI_SECTIONS DS 1CL0044 Addresses and lengths of sections              05883300
         ORG   MODI_SECTIONS                                            05916600
MODI_1_PTR DS  1AL4      Address of the 1st section                     05950000
MODI_1_LEN DS  1FL4      Length of the 1st section                      06000000
MODI_2_PTR DS  1AL4      Address of the 2nd section                     06050000
MODI_2_LEN DS  1FL4      Length of the 2nd section                      06100000
MODI_3_PTR DS  1AL4      Address of the 3rd section                     06150000
MODI_3_LEN DS  1FL4      Length of the 3rd section                      06200000
MODI_4_PTR DS  1AL4      Address of the 4th section                     06250000
MODI_4_LEN DS  1FL4      Length of the 4th section                      06300000
MODI_5_PTR DS  1AL4      Address of the 4th section                     06350000
MODI_5_LEN DS  1FL4      Length of the 4th section                      06400000
MODI_FLAGS DS  1BL4      Flags                                          06402300
         ORG   MODI_FLAGS                                               06404600
MODI_NO_MODI_2 EQU X'80' The MODI_2 data could not be accessed from    *06407000
                         the dump                                       06410500
MODI_NO_MODI_3 EQU X'40' The MODI_3 data could not be accessed from    *06414000
                         the dump                                       06417500
MODI_NO_MODI_4 EQU X'20' The MODI_4 data could not be accessed from    *06421000
                         the dump                                       06424500
MODI_NO_MODI_5 EQU X'10' The MODI_5 data could not be accessed from    *06428000
                         the dump                                       06431500
MODI_NO_MODI_EPNAME EQU X'08' The MODI_EPNAME field could not be       *06435000
                         accessed from the dump                         06438500
         DS    1BL3      Reserved                                       06442000
         ORG   MODI_HEADER+X'00000044'                                  06445500
MODI_HEADER_LLL EQU *-MODI_HEADER                                       06450000
.L0002   ANOP                                                           06500000
*                                                                       06550000
*      ***************************************************************  06600000
*      *                                                             *  06650000
*      * Module entry point and attributes                           *  06700000
*      *                                                             *  06750000
*      ***************************************************************  06800000
*                                                                       06850000
*                                                                       06900000
         AIF   ('&MODI_1' EQ 'NO').L0005                                06950000
         AIF   ('&DSECT' EQ 'YES').L0006                                07000000
         AIF   ('&MODI_1' NE 'YES').L0005                               07050000
MODI_1   DS    0F                                                       07100000
         AGO   .L0007                                                   07150000
.L0006   ANOP                                                           07200000
MODI_1   DSECT                                                          07250000
.L0007   ANOP                                                           07300000
MODI_RB@ DS    1AL4      If the module is reentrant, this field        *07350000
                         contains the address of the last RB that      *07400000
                         controlled the module. If the module is       *07450000
                         serially reusable, this field contains the    *07500000
                         address of the RB at the top of the Waiting   *07550000
                         queue. If the module was requested only       *07600000
                         through LOAD macro instructions, contains     *07650000
                         ZERO.                                          07700000
MODI_8_BYTE_NAME DS 1CL0008 8 byte module name. This field does not    *07750000
                         contain the module name if MODI_PATHNAME is   *07800000
                         set on. In that case, this field contains an  *07850000
                         EBCDIC value indicating this is a pathname    *07900000
                         and the pathname is contained in MODI_EPNAME.  07950000
MODI_ENT@ DS   1AL4      Module's relocated entry point address         07983300
         ORG   MODI_ENT@                                                08016600
MODI_ENT@BYTES0TO2 DS 1CL0003 First bytes of ENT@                       08027700
         ORG   MODI_ENT@BYTES0TO2                                       08038800
MODI_AMODE EQU X'80'     Routine runs in 31 bit mode                    08050000
MODI_AMODE31 EQU X'80'   Routine runs in 31 bit mode                    08058300
         ORG   MODI_ENT@BYTES0TO2+X'00000003'                           08066600
MODI_ENT@BYTE3 DS 1CL0001 Last byte of ENT@                             08074900
         ORG   MODI_ENT@+X'00000004'                                    08100000
         DS    1CL0004   Reserved                                       08150000
MODI_USE_CT DS 1AL2      Value contains the TOTAL MODULE USE COUNT      08200000
MODI_ATTR1 DS  1CL0001   First byte of attributes                       08233300
         ORG   MODI_ATTR1                                               08266600
MODI_EOM EQU   X'80'     ON=Delete module at memory termination         08300000
MODI_IDENTIFY EQU X'40'  This entry point was created via IDENTIFY      08350000
MODI_RACDTY EQU X'20'    ON=Module was loaded by 'dirty' task           08400000
MODI_PLPA EQU  X'08'     ON=The module resides in PLPA                  08450000
MODI_GLOBAL EQU X'04'    ON = Module is loaded to GLOBAL                08500000
MODI_CONTAM EQU X'02'    ON = Module is contaminated. A module is      *08550000
                         considered contaminated if it is from an APF  *08600000
                         authorized library, but was fetched into      *08650000
                         subpool 251 (it is not reentrant) by a NON    *08700000
                         authorized caller.                             08750000
MODI_USED_BY_RACF EQU X'01' For use by external security manager (for  *08766600
                         RACF: user has execute authority to module)    08783200
         ORG   MODI_ATTR1+X'00000001'                                   08800000
MODI_SP  DS    1CL0001   Module subpool ID                              08850000
MODI_ATTR2 DS  1CL0001   Attribute flags                                08883300
         ORG   MODI_ATTR2                                               08916600
MODI_NIP EQU   X'80'     This module was loaded by NIP or is a         *08950000
                         FIXED/MODIFIED LPA module                      09000000
MODI_NOT_IN_CORE EQU X'40' Module is in process of being LOADed         09050000
MODI_REENT EQU X'20'     Module is REENTRABLE                           09100000
MODI_SER_REUS EQU X'10'  Module is SERIALLY REUSABLE                    09150000
MODI_NON_FUNC EQU X'08'  Module is NOT reentrant, and NOT reusable,    *09200000
                         and has been used once                         09250000
MODI_MINOR EQU X'04'     This is a MINOR entry point                    09300000
MODI_SP251 EQU X'02'     This module was loaded into subpool 251        09350000
MODI_NOT_LOADABLE_ONLY EQU X'01' Module is NOT LOADABLE-ONLY            09400000
         ORG   MODI_ATTR2+X'00000001'                                   09450000
MODI_ATTR3 DS  1CL0001   Third attribute field                          09483300
         ORG   MODI_ATTR3                                               09516600
MODI_SP_ZERO EQU X'80'   Module is in SUBPOOL ZERO                      09550000
MODI_ANY_MODE EQU X'08'  Routine runs in ANY mode                       09600000
MODI_OVERLAY EQU X'04'   Module is in OVERLAY FORMAT                    09650000
MODI_AUTH_LIB EQU X'02'  This module came from an APF authorized       *09700000
                         library (a library listed in the APF table)    09750000
MODI_AUTH_MOD EQU X'01'  This module is an authorized module           *09800000
                         (linkedited with AC=1)                         09850000
         ORG   MODI_ATTR3+X'00000001'                                   09900000
MODI_ATTR4 DS  1CL0001   Fourth attribute field                         09933300
         ORG   MODI_ATTR4                                               09966600
MODI_PATHNAME EQU X'80'  This module has an OpenMVS path name. The     *10000000
                         MODI_8_BYTE_NAME field contains an EBCDIC     *10050000
                         value indicating this is a pathname, and      *10100000
                         MODI_EPNAME contains the full path name.       10150000
MODI_SPLIT EQU X'20'     This is a "split" load module (part above,    *10155000
                         part below 16M)                                10160000
MODI_RTLS EQU  X'08'     Loaded by RTLS                                 10165000
MODI_DLPA EQU  X'04'     Dynamic LPA                                    10170000
MODI_PROTP EQU X'02'     Only whole pages are page-protected, as       *10175000
                         opposed to the entire module. Or module added *10180000
                         by CSVDYLPA BYADDR=YES so page protection     *10185000
                         state is not known. Only on for dynamic LPA   *10190000
                         CDE.                                           10195000
         ORG   MODI_ATTR4+X'00000001'                                   10200000
         DS    1CL0001   RESERVED                                       10250000
MODI_1_LLL EQU *-MODI_1                                                 10300000
.L0005   ANOP                                                           10350000
*                                                                       10400000
*      ***************************************************************  10450000
*      *                                                             *  10500000
*      * Module length and load address for each segment. When the   *  10512500
*      * number of relocation factors is greater than one, you must  *  10525000
*      * use the MODI_SEGLEN and MODI_SEGADDR mappings to reference  *  10537500
*      * the lengths and addresses. In all cases, the format of the  *  10550000
*      * area is: - The number of relocation factors - All the       *  10562500
*      * lengths (one for each relocation factor) - All the addresses*  10575000
*      * (one for each relocation factor)                            *  10587500
*      *                                                             *  10600000
*      ***************************************************************  10650000
*                                                                       10700000
*                                                                       10750000
         AIF   ('&MODI_2' EQ 'NO').L0008                                10800000
         AIF   ('&DSECT' EQ 'YES').L0009                                10850000
         AIF   ('&MODI_2' NE 'YES').L0008                               10900000
MODI_2   DS    0F                                                       10950000
         AGO   .L000A                                                   11000000
.L0009   ANOP                                                           11050000
MODI_2   DSECT                                                          11100000
.L000A   ANOP                                                           11150000
MODI_RELOC_FAC_NUM DS 1FL4 Number of relocation factors                 11200000
MODI_MOD_LEN DS 1FL4     Length of module                               11250000
MODI_LOAD@ DS  1AL4      Address of where module was loaded             11300000
MODI_2_LLL EQU *-MODI_2                                                 11350000
.L0008   ANOP                                                           11400000
         AIF   ('&MODI_SEGLEN' EQ 'NO').L000B                           11402300
         AIF   ('&DSECT' EQ 'YES').L000C                                11404600
         AIF   ('&MODI_SEGLEN' NE 'YES').L000B                          11406900
MODI_SEGLEN DS 0F        The first length is located at offset 4 from  *11408400
                         the beginning of the MODI_2 area               11409900
         AGO   .L000D                                                   11411500
.L000C   ANOP                                                           11413800
MODI_SEGLEN DSECT        The first length is located at offset 4 from  *11415300
                         the beginning of the MODI_2 area               11416800
.L000D   ANOP                                                           11418400
MODI_SEGMENT_LEN DS 1FL4 Array of module segment lengths                11420700
MODI_SEGLEN_LLL EQU *-MODI_SEGLEN                                       11421800
.L000B   ANOP                                                           11423000
         AIF   ('&MODI_SEGADDR' EQ 'NO').L000E                          11425300
         AIF   ('&DSECT' EQ 'YES').L000F                                11427600
         AIF   ('&MODI_SEGADDR' NE 'YES').L000E                         11429900
MODI_SEGADDR DS 0F       The first address is located at offset 4 plus *11431000
                         the length of the area for the lengths (which *11432100
                         is 4 * number of relocation factors)           11433200
         AGO   .L0010                                                   11434500
.L000F   ANOP                                                           11436800
MODI_SEGADDR DSECT       The first address is located at offset 4 plus *11437900
                         the length of the area for the lengths (which *11439000
                         is 4 * number of relocation factors)           11440100
.L0010   ANOP                                                           11441400
MODI_SEGMENT_ADDR DS 1AL4 Array of module addresses                     11443700
MODI_SEGADDR_LLL EQU *-MODI_SEGADDR                                     11444800
.L000E   ANOP                                                           11446000
*                                                                       11450000
*      ***************************************************************  11500000
*      *                                                             *  11550000
*      * Module name and auxiliary information                       *  11600000
*      *                                                             *  11650000
*      ***************************************************************  11700000
*                                                                       11750000
*                                                                       11800000
         AIF   ('&MODI_3' EQ 'NO').L0011                                11850000
         AIF   ('&DSECT' EQ 'YES').L0012                                11900000
         AIF   ('&MODI_3' NE 'YES').L0011                               11950000
MODI_3   DS    0F                                                       12000000
         AGO   .L0013                                                   12050000
.L0012   ANOP                                                           12100000
MODI_3   DSECT                                                          12150000
.L0013   ANOP                                                           12200000
MODI_NAME_LEN DS 1FL2    Length of the name                             12250000
MODI_ASID DS   1BL2      ASID of address space in which this module    *12300000
                         was originally loaded. In an OpenMVS forked   *12350000
                         environment, this may not equal the current   *12400000
                         child address space ASID.                      12450000
MODI_PROVIDER_ID DS 1FL4 Provider Identifier                            12500000
MODI_PROVIDER_DATA DS 1CL0016 Provider Data                             12550000
MODI_EPTOKEN DS 1CL0008  Entry point token                              12600000
MODI_EPNAME DS 0C        Entry point name. The length of the name is   *12650000
                         in MODI_NAME_LEN. For OpenMVS modules this    *12700000
                         field contains the full OpenMVS pathname.      12750000
MODI_3_LLL EQU *-MODI_3                                                 12800000
.L0011   ANOP                                                           12850000
*                                                                       12900000
*      ***************************************************************  12950000
*      *                                                             *  13000000
*      * LOAD information                                            *  13050000
*      *                                                             *  13100000
*      ***************************************************************  13150000
*                                                                       13200000
*                                                                       13250000
         AIF   ('&MODI_4' EQ 'NO').L0014                                13300000
         AIF   ('&DSECT' EQ 'YES').L0015                                13350000
         AIF   ('&MODI_4' NE 'YES').L0014                               13400000
MODI_4   DS    0H                                                       13450000
         AGO   .L0016                                                   13500000
.L0015   ANOP                                                           13550000
MODI_4   DSECT                                                          13600000
.L0016   ANOP                                                           13650000
MODI_LOAD_COUNT DS 1FL2  The total number of requests for the module   *13700000
                         via the LOAD macro                             13750000
MODI_LOAD_SYSCOUNT DS 1FL2 The number of system requests for the       *13800000
                         module via the LOAD macro                      13850000
MODI_4_LLL EQU *-MODI_4                                                 13900000
.L0014   ANOP                                                           13950000
*                                                                       14000000
*      ***************************************************************  14050000
*      *                                                             *  14100000
*      * MAJOR name - this section contains the Major name when then *  14150000
*      * current entry point is a minor (MODI_MINOR = 1)             *  14200000
*      *                                                             *  14250000
*      ***************************************************************  14300000
*                                                                       14350000
*                                                                       14400000
         AIF   ('&MODI_5' EQ 'NO').L0017                                14450000
         AIF   ('&DSECT' EQ 'YES').L0018                                14500000
         AIF   ('&MODI_5' NE 'YES').L0017                               14550000
MODI_5   DS    0X                                                       14600000
         AGO   .L0019                                                   14650000
.L0018   ANOP                                                           14700000
MODI_5   DSECT                                                          14750000
.L0019   ANOP                                                           14800000
MODI_8_BYTE_MAJOR_NAME DS 1CL0008 The 8 byte major name for a minor    *14850000
                         entry point                                    14900000
*                                                                       14950000
*    *****************************************************************  15000000
*    *                                                               *  15050000
*    * Eyecatcher for MODI_HEADER                                    *  15100000
*    *                                                               *  15150000
*    *****************************************************************  15200000
*                                                                       15250000
*                                                                       15300000
MODI_TEXT EQU  C'MODI'   Eyecatcher                                     15350000
*                                                                       15400000
*    *****************************************************************  15450000
*    *                                                               *  15500000
*    * Return codes for service module                               *  15550000
*    *                                                               *  15600000
*    *****************************************************************  15650000
*                                                                       15700000
*                                                                       15750000
MODI_OK  EQU   0         Module processing occurred normally            15800000
MODI_NOINFO EQU 4        There was no module information to return      15850000
MODI_CALLER EQU 8        Processing terminated with a nonzero return   *15900000
                         code from the caller's subroutine              15950000
MODI_LOCKS EQU 12        Locks needed to process the CSVINFO request   *16000000
                         could not be obtained                          16050000
MODI_INVALID_INPUT EQU 16 Processing terminated unexpectedly when      *16100000
                         invalid caller input was encountered           16150000
MODI_NOTAVAIL EQU 20     The CSVINFO service routine is not available   16200000
MODI_NOTRETRIEVED EQU 24 Processing terminated because requested       *16250000
                         information could not be retrieved from the   *16300000
                         dump                                           16350000
MODI_UNEXPECTED EQU 28   Processing terminated unexpectedly             16400000
MODI_BELOW430 EQU 32     A system at a level lower than 4.3.0 was      *16450000
                         trying to use the CSVINFO service              16500000
MODI_BAD_PARMLIST EQU 36 The CSVINFO parameter list is not valid with  *16550000
                         the level of CSVINFO service on the system     16570000
MODI_LOOP_LIMIT EQU 40   The CSVINFO service has exceeded a large      *16590000
                         threshold value for the number of times the   *16610000
                         MIPR is invoked on a single call.              16618000
MODI_INELIGIBLE_RB EQU 44 The RB supplied via RBADDR as input for      *16626000
                         FUNC(RB) was not a PRB or SVRB.                16634000
MODI_MIPR_FAILED EQU 48  The supplied MIPR routine failed.              16642000
MODI_RB_LOOP EQU 52      The RB supplied via RBADDR as input for       *16643600
                         FUNC(RB) has resulted in the CSVINFO service  *16645200
                         exceeding the expected number of iterations   *16646800
                         through an RB chain.                           16648400
MODI_5_LLL EQU *-MODI_5                                                 16650000
.L0017   ANOP                                                           16700000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 16750000
         AIF   ('&LIST' EQ 'YES').P4                                    16800000
.P3      ANOP                                                           16850000
         POP   PRINT                                                    16900000
.P4      ANOP                                                           16950000
.P_EXIT  ANOP                                                           17000000
         MEND                                                           17050000
**/ CSVMODI_2:;                                                         17100000
* %CSVMODI_INCLUDED = 'YES';                                            17150000
* %DCL ZCBPRINT CHAR EXT;                                               17200000
* %DEACTIVATE ZCBPRINT;                                                 17250000
* %DCL CSVMODI_LIST CHAR EXT;                                           17300000
* %DEACTIVATE CSVMODI_LIST;                                             17350000
* %IF CSVMODI_LIST ^= 'NO' &                                            17400000
*    ZCBPRINT ^= 'NO' %THEN                                             17450000
*   %GOTO CSVMODI_3;                                                    17500000
*   @LIST PUSH NOECHO;                                                  17550000
*   @LIST NOASSEMBLE NOECHO;                                            17600000
*   @LIST OFF C NOECHO;                                                 17650000
* %CSVMODI_3:;                                                          17700000
*/* Start of PL/X Source                                             */ 17750000
*/********************************************************************/ 17800000
*/*                                                                  */ 17850000
*/*  Tell CBGEN to generate lengths for x named x_LLL.  This         */ 17853800
*/*  prevents a conflict with the declared names.  The default       */ 17857600
*/*  is x_LEN (e.g. MODI_1_LEN).                                     */ 17861400
*/*                                                              @P1A*/ 17865200
*/********************************************************************/ 17869000
*@LOGIC;                                                                17872800
*#PRAGMA TOOL=CBGEN.                                                    17876600
*#LENGTHSUFFIX._LLL                                                     17880400
*#USEORG.                                                               17882300
*#EPRAGMA.                                                              17884200
*@ENDLOGIC;                                                             17888000
*/********************************************************************/ 17891800
*/*                                                                  */ 17895600
*/*Contents Module Information                                       */ 17900000
*/*                                                                  */ 17950000
*/********************************************************************/ 18000000
*                                                                       18050000
*   DECLARE                                                             18100000
*                                                                       18150000
*     /***************************************************************/ 18200000
*     /*                                                             */ 18250000
*     /* Pointers and lengths of other sections Note: any of the     */ 18300000
*     /* following may be 0.                                         */ 18350000
*     /*                                                             */ 18400000
*     /***************************************************************/ 18450000
*                                                                       18500000
*     1    MODI_HEADER BASED,                                           18550000
*      2    MODI_EYECATCHER CHAR(4), /* = 'MODI'                     */ 18600000
*      2    MODI_USERDATA CHAR(16), /* Copy of CSVINFO USERDATA      */ 18650000
*      2    MODI_ABDPL PTR(31),     /* Address of ABDUMP parmlist    */ 18700000
*      2    MODI_SECTIONS,          /* Addresses and lengths of         18750000
*                                      sections                      */ 18800000
*       3    MODI_1_PTR PTR(31),    /* Address of the 1st section    */ 18850000
*       3    MODI_1_LEN FIXED(31),  /* Length of the 1st section     */ 18900000
*       3    MODI_2_PTR PTR(31),    /* Address of the 2nd section    */ 18950000
*       3    MODI_2_LEN FIXED(31),  /* Length of the 2nd section     */ 19000000
*       3    MODI_3_PTR PTR(31),    /* Address of the 3rd section    */ 19050000
*       3    MODI_3_LEN FIXED(31),  /* Length of the 3rd section     */ 19100000
*       3    MODI_4_PTR PTR(31),    /* Address of the 4th section    */ 19150000
*       3    MODI_4_LEN FIXED(31),  /* Length of the 4th section     */ 19200000
*       3    MODI_5_PTR PTR(31),    /* Address of the 4th section    */ 19250000
*       3    MODI_5_LEN FIXED(31),  /* Length of the 4th section     */ 19300000
*       3    MODI_FLAGS BIT(32),    /* Flags                     @L2A*/ 19303500
*        5    MODI_NO_MODI_2 BIT(1), /* The MODI_2 data could not be    19307000
*                                      accessed from the dump    @L2A*/ 19310500
*        5    MODI_NO_MODI_3 BIT(1), /* The MODI_3 data could not be    19314000
*                                      accessed from the dump    @L2A*/ 19317500
*        5    MODI_NO_MODI_4 BIT(1), /* The MODI_4 data could not be    19321000
*                                      accessed from the dump    @L2A*/ 19324500
*        5    MODI_NO_MODI_5 BIT(1), /* The MODI_5 data could not be    19328000
*                                      accessed from the dump    @L2A*/ 19331500
*        5    MODI_NO_MODI_EPNAME BIT(1), /* The MODI_EPNAME field      19335000
*                                      could not be accessed from the   19338500
*                                      dump                      @L2A*/ 19342000
*        5    * BIT(3),             /* Reserved                  @L2A*/ 19344600
*        5    * BIT(24),            /* Reserved                  @L2A*/ 19347200
*                                                                       19350000
*     /***************************************************************/ 19400000
*     /*                                                             */ 19450000
*     /* Module entry point and attributes                           */ 19500000
*     /*                                                             */ 19550000
*     /***************************************************************/ 19600000
*                                                                       19650000
*     1    MODI_1   BASED(MODI_1_PTR), /*                            */ 19700000
*      2    MODI_RB@ PTR(31),       /* If the module is reentrant,      19750000
*                                      this field contains the          19800000
*                                      address of the last RB that      19850000
*                                      controlled the module. If the    19900000
*                                      module is serially reusable,     19950000
*                                      this field contains the          20000000
*                                      address of the RB at the top     20050000
*                                      of the Waiting queue. If the     20100000
*                                      module was requested only        20150000
*                                      through LOAD macro               20200000
*                                      instructions, contains ZERO.  */ 20250000
*      2    MODI_8_BYTE_NAME CHAR(8), /* 8 byte module name. This       20300000
*                                      field does not contain the       20350000
*                                      module name if MODI_PATHNAME     20400000
*                                      is set on. In that case, this    20450000
*                                      field contains an EBCDIC value   20500000
*                                      indicating this is a pathname    20550000
*                                      and the pathname is contained    20600000
*                                      in MODI_EPNAME.               */ 20650000
*      2    MODI_ENT@ PTR(31),      /* Module's relocated entry point   20700000
*                                      address                       */ 20750000
*       3    MODI_ENT@BYTES0TO2 CHAR(3), /* First bytes of ENT@  @L4A*/ 20761100
*         4  MODI_AMODE BIT(1),     /* Routine runs in 31 bit mode   */ 20772200
*           5 MODI_AMODE31 BIT(1),  /* Routine runs in 31 bit mode      20783300
*                                                                @L4A*/ 20794400
*       3    MODI_ENT@BYTE3 CHAR(1),  /* Last byte of ENT@       @L4A*/ 20805500
*      2    *        CHAR(4),       /* Reserved                      */ 20850000
*      2    MODI_USE_CT PTR(15),    /* Value contains the TOTAL         20900000
*                                      MODULE USE COUNT              */ 20950000
*      2    MODI_ATTR1 CHAR(1),     /* First byte of attributes      */ 21000000
*       3    MODI_EOM BIT(1),       /* ON=Delete module at memory       21050000
*                                      termination                   */ 21100000
*       3    MODI_IDENTIFY BIT(1),  /* This entry point was created     21150000
*                                      via IDENTIFY                  */ 21200000
*       3    MODI_RACDTY BIT(1),    /* ON=Module was loaded by          21250000
*                                      'dirty' task                  */ 21300000
*       3    *        BIT(1),       /* Reserved                      */ 21350000
*       3    MODI_PLPA BIT(1),      /* ON=The module resides in PLPA */ 21400000
*       3    MODI_GLOBAL BIT(1),    /* ON = Module is loaded to         21450000
*                                      GLOBAL                        */ 21500000
*       3    MODI_CONTAM BIT(1),    /* ON = Module is contaminated. A   21550000
*                                      module is considered             21600000
*                                      contaminated if it is from an    21650000
*                                      APF authorized library, but      21700000
*                                      was fetched into subpool 251     21750000
*                                      (it is not reentrant) by a NON   21800000
*                                      authorized caller.            */ 21850000
*       3    MODI_USED_BY_RACF BIT(1), /* For use by external security  21870000
*                                      manager (for RACF: user has      21890000
*                                      execute authority to module)     21910000
*                                                                @L3A*/ 21930000
*      2    MODI_SP  CHAR(1),       /* Module subpool ID             */ 21950000
*      2    MODI_ATTR2 CHAR(1),     /* Attribute flags               */ 22000000
*       3    MODI_NIP BIT(1),       /* This module was loaded by NIP    22050000
*                                      or is a FIXED/MODIFIED LPA       22100000
*                                      module                        */ 22150000
*       3    MODI_NOT_IN_CORE BIT(1), /* Module is in process of        22200000
*                                      being LOADed                  */ 22250000
*       3    MODI_REENT BIT(1),     /* Module is REENTRABLE          */ 22300000
*       3    MODI_SER_REUS BIT(1),  /* Module is SERIALLY REUSABLE   */ 22350000
*       3    MODI_NON_FUNC BIT(1),  /* Module is NOT reentrant, and     22400000
*                                      NOT reusable, and has been       22450000
*                                      used once                     */ 22500000
*       3    MODI_MINOR BIT(1),     /* This is a MINOR entry point   */ 22550000
*       3    MODI_SP251 BIT(1),     /* This module was loaded into      22600000
*                                      subpool 251                   */ 22650000
*       3    MODI_NOT_LOADABLE_ONLY BIT(1), /* Module is NOT            22700000
*                                      LOADABLE-ONLY                 */ 22750000
*      2    MODI_ATTR3 CHAR(1),     /* Third attribute field         */ 22800000
*       3    MODI_SP_ZERO BIT(1),   /* Module is in SUBPOOL ZERO     */ 22850000
*       3    *        BIT(1),       /* Reserved                      */ 22900000
*       3    *        BIT(1),       /* Reserved                      */ 22950000
*       3    *        BIT(1),       /* Reserved                      */ 23000000
*       3    MODI_ANY_MODE BIT(1),  /* Routine runs in ANY mode      */ 23050000
*       3    MODI_OVERLAY BIT(1),   /* Module is in OVERLAY FORMAT   */ 23100000
*       3    MODI_AUTH_LIB BIT(1),  /* This module came from an APF     23150000
*                                      authorized library (a library    23200000
*                                      listed in the APF table)      */ 23250000
*       3    MODI_AUTH_MOD BIT(1),  /* This module is an authorized     23300000
*                                      module (linkedited with AC=1) */ 23350000
*      2    MODI_ATTR4 CHAR(1),     /* Fourth attribute field        */ 23400000
*       3    MODI_PATHNAME BIT(1),  /* This module has an OpenMVS       23450000
*                                      path name. The                   23500000
*                                      MODI_8_BYTE_NAME field           23550000
*                                      contains an EBCDIC value         23600000
*                                      indicating this is a pathname,   23650000
*                                      and MODI_EPNAME contains the     23700000
*                                      full path name.               */ 23750000
*       3    * BIT(1),              /* RESERVED                      */ 23753800
*       3    MODI_SPLIT BIT(1),     /* This is a "split" load module    23757600
*                                      (part above, part below 16M)  */ 23761400
*       3    * BIT(1),              /* RESERVED                      */ 23765200
*       3    MODI_RTLS BIT(1),      /* Loaded by RTLS                */ 23769000
*       3    MODI_DLPA BIT(1),      /* Dynamic LPA                   */ 23772800
*       3    MODI_PROTP BIT(1),     /* Only whole pages are             23776600
*                     page-protected, as opposed to the entire module.  23780400
*                     Or module added by CSVDYLPA BYADDR=YES so page    23784200
*                     protection state is not known. Only on for        23788000
*                     dynamic LPA CDE.                               */ 23791800
*       3    * BIT(1),              /* RESERVED                      */ 23795600
*      2    *        CHAR(1),       /* RESERVED                      */ 23800000
*                                                                       23850000
*     /***************************************************************/ 23900000
*     /*                                                             */ 23950000
*     /* Module length and load address for each segment.            */ 23961100
*     /* When the number of relocation factors is greater than       */ 23972200
*     /* one, you must use the MODI_SEGLEN and MODI_SEGADDR          */ 23983300
*     /* mappings to reference the lengths and addresses.            */ 23994400
*     /* In all cases, the format of the area is:                    */ 24005500
*     /* - The number of relocation factors                          */ 24016600
*     /* - All the lengths (one for each relocation factor)          */ 24027700
*     /* - All the addresses (one for each relocation factor)        */ 24038800
*     /*                                                             */ 24050000
*     /***************************************************************/ 24100000
*                                                                       24150000
*     1    MODI_2   BASED(MODI_2_PTR), /*                            */ 24200000
*      2    MODI_RELOC_FAC_NUM FIXED(31), /* Number of relocation       24250000
*                                      factors                       */ 24300000
*      2    MODI_MOD_LEN FIXED(31), /* Length of module              */ 24350000
*      2    MODI_LOAD@ PTR(31),     /* Address of where module was      24400000
*                                      loaded                        */ 24450000
*                                                                       24454500
*     1 MODI_SEGLEN BASED(ADDR(MODI_MOD_LEN)), /* The first length is   24456300
*                                      located at offset 4 from the     24458100
*                                      beginning of the MODI_2 area     24459900
*                                                                    */ 24461700
*      2 MODI_SEGMENT_LEN(*) FIXED(31), /* Array of module              24463500
*                                      segment lengths           @P2A*/ 24468000
*                                                                       24472500
*     1 MODI_SEGADDR BASED(ADDR(MODI_MOD_LEN)+LENGTH(MODI_MOD_LEN)*     24477000
*           MODI_RELOC_FAC_NUM),    /* The first address is located     24478500
*                                      at offset 4 plus the length of   24480000
*                                      the area for the lengths         24481500
*                                      (which is 4 * number of          24483000
*                                      relocation factors)           */ 24484500
*                                                                       24486000
*      2 MODI_SEGMENT_ADDR(*) PTR(31), /* Array of module addresses     24490500
*                                                                @P2A*/ 24495000
*                                                                       24500000
*     /***************************************************************/ 24550000
*     /*                                                             */ 24600000
*     /* Module name and auxiliary information                       */ 24650000
*     /*                                                             */ 24700000
*     /***************************************************************/ 24750000
*                                                                       24800000
*     1    MODI_3   BASED(MODI_3_PTR), /*                            */ 24850000
*      2    MODI_NAME_LEN FIXED(15), /* Length of the name           */ 24900000
*      2    MODI_ASID BIT(16),      /* ASID of address space in which   24950000
*                                      this module was originally       25000000
*                                      loaded. In an OpenMVS forked     25050000
*                                      environment, this may not equal  25100000
*                                      the current child address space  25150000
*                                      ASID.                         */ 25200000
*      2    MODI_PROVIDER_ID FIXED(31), /* Provider Identifier       */ 25250000
*      2    MODI_PROVIDER_DATA CHAR(16), /* Provider Data            */ 25300000
*      2    MODI_EPTOKEN CHAR(8),   /* Entry point token             */ 25350000
*      2    MODI_EPNAME CHAR(0),    /* Entry point name. The length     25400000
*                                      of the name is in                25450000
*                                      MODI_NAME_LEN. For OpenMVS       25500000
*                                      modules this field contains      25550000
*                                      the full OpenMVS pathname.    */ 25600000
*                                                                       25650000
*     /***************************************************************/ 25700000
*     /*                                                             */ 25750000
*     /* LOAD information                                            */ 25800000
*     /*                                                             */ 25850000
*     /***************************************************************/ 25900000
*                                                                       25950000
*     1    MODI_4   BASED(MODI_4_PTR), /*                            */ 26000000
*      2    MODI_LOAD_COUNT FIXED(15), /* The total number of           26050000
*                                      requests for the module via      26100000
*                                      the LOAD macro                */ 26150000
*      2    MODI_LOAD_SYSCOUNT FIXED(15), /* The number of system       26200000
*                                      requests for the module via      26250000
*                                      the LOAD macro                */ 26300000
*                                                                       26350000
*     /***************************************************************/ 26400000
*     /*                                                             */ 26450000
*     /* MAJOR name - this section contains the Major name when then */ 26500000
*     /* current entry point is a minor (MODI_MINOR = 1)             */ 26550000
*     /*                                                             */ 26600000
*     /***************************************************************/ 26650000
*                                                                       26700000
*     1    MODI_5   BASED(MODI_5_PTR), /*                            */ 26750000
*      2    MODI_8_BYTE_MAJOR_NAME CHAR(8); /* The 8 byte major name    26800000
*                                      for a minor entry point       */ 26850000
*                                                                       26900000
*   /*****************************************************************/ 26950000
*   /*                                                               */ 27000000
*   /* Eyecatcher for MODI_HEADER                                    */ 27050000
*   /*                                                               */ 27100000
*   /*****************************************************************/ 27150000
*                                                                       27200000
*   DECLARE                                                             27250000
*     MODI_TEXT CHAR(4) CONSTANT('MODI'); /* Eyecatcher              */ 27300000
*                                                                       27350000
*   /*****************************************************************/ 27400000
*   /*                                                               */ 27450000
*   /* Return codes for service module                               */ 27500000
*   /*                                                               */ 27550000
*   /*****************************************************************/ 27600000
*                                                                       27650000
*   DECLARE                                                             27700000
*     MODI_OK  CONSTANT(0),         /* Module processing occurred       27750000
*                                      normally                      */ 27800000
*     MODI_NOINFO CONSTANT(4),      /* There was no module              27850000
*                                      information to return         */ 27900000
*     MODI_CALLER CONSTANT(8),      /* Processing terminated with a     27950000
*                                      nonzero return code from the     28000000
*                                      caller's subroutine           */ 28050000
*     MODI_LOCKS CONSTANT(12),      /* Locks needed to process the      28100000
*                                      CSVINFO request could not be     28150000
*                                      obtained                      */ 28200000
*     MODI_INVALID_INPUT CONSTANT(16), /* Processing terminated         28250000
*                                      unexpectedly when invalid        28300000
*                                      caller input was encountered  */ 28350000
*     MODI_NOTAVAIL     CONSTANT(20), /* The CSVINFO service routine    28400000
*                                        is not available            */ 28450000
*     MODI_NOTRETRIEVED CONSTANT(24), /* Processing terminated because  28500000
*                                      requested information could      28550000
*                                      not be retrieved from the dump*/ 28600000
*     MODI_UNEXPECTED CONSTANT(28), /* Processing terminated            28650000
*                                      unexpectedly                  */ 28700000
*     MODI_BELOW430 CONSTANT(32),   /* A system at a level lower than   28750000
*                                      4.3.0 was trying to use the      28800000
*                                      CSVINFO service               */ 28850000
*     MODI_BAD_PARMLIST CONSTANT(36), /* The CSVINFO parameter list is  28900000
*                                      not valid with the level of      28950000
*                                      CSVINFO service on the system */ 29000000
*     MODI_LOOP_LIMIT   CONSTANT(40), /* The CSVINFO service has        29014200
*                                      exceeded a large threshold value 29028400
*                                      for the number of times the MIPR 29042600
*                                      is invoked on a single call.     29056800
*                                                                @L1A*/ 29071000
*     MODI_INELIGIBLE_RB CONSTANT(44), /* The RB supplied via RBADDR    29073300
*                                         as input for FUNC(RB) was     29075600
*                                         not a PRB or SVRB.     @D1A*/ 29077900
*     MODI_MIPR_FAILED  CONSTANT(48),  /* The supplied MIPR routine     29080200
*                                         failed.                @D1A*/ 29082500
*     MODI_RB_LOOP  CONSTANT(52); /* The RB supplied via RBADDR as      29082900
*                                    input for FUNC(RB) has resulted    29083300
*                                    in the CSVINFO service exceeding   29083700
*                                    the expected number of iterations  29084100
*                                    through an RB chain.        @01A*/ 29084500
*/* End of PL/X Source                                               */ 29085200
* %IF CSVMODI_LIST ^= 'NO' &                                            29100000
*    ZCBPRINT ^= 'NO' %THEN                                             29150000
*   %GOTO CSVMODI_4;                                                    29200000
*   @LIST POP NOECHO;                                                   29250000
* %CSVMODI_4:;                                                          29300000
* %END;                                                                 29350000
