*                                                                       00050000
* %DCL CSVRTAA_INCLUDED CHAR EXT;                                       00100000
* %DEACTIVATE CSVRTAA_INCLUDED;                                         00150000
* %IF CSVRTAA_INCLUDED = '' %THEN                                       00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 97328. CBGEN compile date 97289         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         CSVRTAA &DSECT=YES,&LIST=YES,&TITLE=YES,&RTAAHDR=YES,         *00450000
               &RTAAPH=COND,&RTAADS=COND,&RTAAMO=COND,&RTAALO=COND,    *00500000
               &RTAALPH=COND,&RTAALU=COND,&RTAAPL=COND,&RTLSXTL=COND,  *00550000
               &RTLSXTLE=COND                                           00600000
         GBLC  &CSVRTAA_INCLUDED                                        00650000
         GBLC  &ZCBPRINT                                                00700000
&CSVRTAA_INCLUDED SETC 'YES'                                            00750000
         AIF   ('&LIST' EQ 'NONE').P0                                   00800000
         AIF   ('&TITLE' EQ 'NO').P5                                    00850000
 TITLE   'CSVRTAA  - RTLS Answer Area                               '   00900000
.P5      ANOP                                                           00950000
**/ CSVRTAA_1:;                                                         01000000
*/* START OF SPECIFICATIONS ******************************************* 01050000
*                                                                       01100000
*  **PROPRIETARY_STATEMENT********************************************  01150000
***01* PROPRIETARY STATEMENT=                                        *  01200000
*                                                                    *  01250000
*                                                                    *  01300000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01350000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01400000
*   5647-A01 (C) COPYRIGHT IBM CORP. 1997,1998                       *  01450000
*                                                                    *  01550000
*   STATUS= HBB6606                                                  *  01600000
*                                                                    *  01650000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01700000
*                                                                       01750000
*01* DESCRIPTIVE NAME:  RTLS Answer Area                                01800000
*02*  ACRONYM:  RTAA                                                    01850000
*                                                                       01900000
*01* MACRO NAME:  CSVRTAA                                               01950000
*                                                                       02000000
*01* EXTERNAL CLASSIFICATION: GUPI                                      02050000
*01* END OF EXTERNAL CLASSIFICATION:                                    02100000
*                                                                       02150000
*01* DSECT NAME:                                                        02200000
*     RTAAHDR                                                           02250000
*     RTAAPH                                                            02300000
*     RTAADS                                                            02350000
*     RTAAMO                                                            02400000
*     RTAALO                                                            02450000
*     RTAALPH                                                           02500000
*     RTAALU                                                            02550000
*     RTAAPL                                                            02600000
*     RTLSXTL                                                           02650000
*     RTLSXTLE                                                          02700000
*                                                                       02750000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           02800000
*                                                                       02850000
*01* EYE-CATCHER:  NONE                                                 02900000
*                                                                       02950000
*01* STORAGE ATTRIBUTES:                                                03000000
*02*  SUBPOOL:  Caller-supplied                                         03050000
*02*  KEY:  Caller-supplied                                             03100000
*02*  RESIDENCY:  Caller-supplied                                       03150000
*                                                                       03200000
*01* SIZE:  Variable                                                    03250000
*                RTAAHDR  -- X'0038' bytes                              03300000
*                RTAAPH   -- X'0048' bytes                              03350000
*                RTAADS   -- X'0038' bytes                              03400000
*                RTAAMO   -- X'0024' bytes                              03450000
*                RTAALO   -- X'0050' bytes                              03500000
*                RTAALPH  -- X'0014' bytes                              03550000
*                RTAALU   -- X'0010' bytes                              03600000
*                RTAAPL   -- X'001C' bytes                              03650000
*                RTLSXTL  -- X'0088' bytes                              03700000
*                RTLSXTLE -- X'0008' bytes                              03750000
*                                                                       03800000
*01* CONTROL BLOCK CHANGES:                                             03850000
*02*  CSVRTAA                                                           03900000
*02*   OS/390 R4                                                        03950000
*03*    New                                                             04000000
*03*    Migration Considerations: NONE                                  04050000
*01* END CONTROL BLOCK CHANGES                                          04100000
*                                                                       04150000
*01* CREATED BY:                                                        04200000
*     Caller and passed as parameter on ANSAREA keyword                 04250000
*      on CSVRTLS LIST                                                  04300000
*                                                                       04350000
*01* POINTED TO BY:                                                     04400000
*     CSVRTLS parameter list                                            04450000
*                                                                       04500000
*01* SERIALIZATION:                                                     04550000
*     None required                                                     04600000
*                                                                       04650000
*01* FUNCTION:                                                          04700000
*02* Maps the data returned by the CSVRTLS macro, LIST request.         04750000
*                                                                       04800000
*02* The returned information consists of a header (RTAAHDR)            04850000
*    which indicates how many physical entries (RTAAPH)                 04900000
*    and logical entries (RTAALO) follow.                               04950000
*                                                                       05000000
*02* RTAAHFIRSTPHADDR is a pointer to the first RTAAPH, and each        05050000
*    RTAAPH points to the next (RTAAPHNEXTADDR). The count provided in  05100000
*    header field RTAAHNumPH should be used to determine the number of  05150000
*    exit entries to examine.                                           05200000
*                                                                       05250000
*02* Each RTAAPH indicates how many data set entries (RTAADS),          05300000
*    module entries (RTAAMO), and logical entries (RTAAPL)              05350000
*    are associated with it.                                            05400000
*                                                                       05450000
*    RTAAPHFIRSTDSADDR is a pointer to the first RTAADS, and each       05500000
*    RTAADS points to the next (RTAADSNEXTADDR). The                    05550000
*    count provided in RTAAPHNumDS should be used                       05600000
*    to determine the number of data set entries to examine.            05650000
*                                                                       05700000
*    RTAAPHFIRSTMOADDR is a pointer to the first RTAAMO, and each       05750000
*    RTAAMO points to the next (RTAAMONEXTADDR). The                    05800000
*    count provided in RTAAPHNumMO should be used                       05850000
*    to determine the number of module entries to examine.              05900000
*                                                                       05950000
*    RTAAPHFIRSTPLADDR is a pointer to the first RTAAPL, and each       06000000
*    RTAAPL points to the next (RTAAPLNEXTADDR). The                    06050000
*    count provided in RTAAPHNumPL should be used                       06100000
*    to determine the number of module entries to examine.              06150000
*                                                                       06200000
*02* Each RTAALO indicates how many physical entries (RTAALPH),         06250000
*    module entries (RTAAMO),                                           06300000
*    and user entries (RTAALU) are associated with it.                  06350000
*                                                                       06400000
*    RTAALOFIRSTLPHADDR is a pointer to the first RTAALPH, and each     06450000
*    RTAALPH points to the next (RTAALPHNEXTADDR). The                  06500000
*    count provided in RTAALONumLPH should be used                      06550000
*    to determine the number of LPH entries to examine.                 06600000
*                                                                       06650000
*    RTAALOFIRSTMOADDR is a pointer to the first RTAAMO, and each       06700000
*    RTAAMO points to the next (RTAAMONEXTADDR). The                    06750000
*    count provided in RTAALONumMO should be used                       06800000
*    to determine the number of module entries to examine.              06850000
*                                                                       06900000
*    RTAALOFIRSTLUADDR is a pointer to the first RTAALU, and each       06950000
*    RTAALU points to the next (RTAALUNEXTADDR). The                    07000000
*    count provided in RTAALONumLU should be used                       07050000
*    to determine the number of user entries to examine.                07100000
*                                                                       07150000
*03* RTLSXTL maps the extent list returned by the outXTLST parameter    07200000
*    of the CSVRTLS REQUEST=LOAD function. RTLSXTLE maps an entry       07250000
*    within that extent list                                            07300000
*                                                                       07350000
*01* METHOD OF ACCESS:                                                  07400000
*02*  ASM:                                                              07450000
*      CSVRTAA                                                          07500000
*           DSECT=YES|NO  -- Request DSECT definition                   07550000
*           RTAAHDR=YES|NO|COND -- Request Header record mapping        07600000
*                            USING on RTAAHDR                           07650000
*           RTAAPH=YES|NO|COND -- Request physical data set mapping     07700000
*                            USING on RTAAPH                            07750000
*           RTAADS=YES|NO|COND -- Request data set record mapping       07800000
*                            USING on RTAADS                            07850000
*           RTAAMO=YES|NO|COND -- Request module record mapping         07900000
*                            USING on RTAAMO                            07950000
*           RTAALO=YES|NO|COND -- Request logical data set mapping      08000000
*                            USING on RTAALO                            08050000
*           RTAALPH=YES|NO|COND -- Request LPH mapping                  08100000
*                            USING on RTAALPH                           08150000
*           RTAALU=YES|NO|COND -- Request LU mapping                    08200000
*                            USING on RTAALU                            08250000
*           RTAAPL=YES|NO|COND -- Request PL mapping                    08300000
*                            USING on RTAAPL                            08350000
*           RTLSXTL=YES|NO|COND -- Request outXTLST mapping             08400000
*                            USING on RTLSXTL                           08450000
*           RTLSXTLE=YES|NO|COND -- Request outXTLST mapping            08500000
*                            USING on RTLSXTLE                          08550000
*     Default: DSECT=YES,RTAAHDR=YES,RTAAPH=COND,RTAADS=COND,           08600000
*                        RTAAMO=COND,RTAALO=COND,RTAALPH=COND,          08650000
*                        RTAALU=COND,RTAAPL=COND,                       08700000
*                        RTLSXTL=COND,RTLSXTLE=COND                     08750000
*     Notes: name=YES  => expand                                        08800000
*            name=NO   => do not expand                                 08850000
*            name=COND => expand only if DSECT=YES                      08900000
*                                                                       08950000
*02*  PL/AS:                                                            09000000
*      %INCLUDE SYSLIB(CSVRTAA)                                         09050000
*                                                                       09100000
*01* DELETED BY:  Caller                                                09150000
*                                                                       09200000
*01* FREQUENCY:  Created for response to CSVRTLS LIST                   09250000
*                                                                       09300000
*01* DEPENDENCIES:  None                                                09350000
*                                                                       09400000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     09450000
*                                                                       09500000
*01* CHANGE ACTIVITY:                                                   09550000
*   $L0=RTLS_CBG ,JBB6604,960425,PD00XB: RTLS                           09600000
*   $L1=RTLS_CSV ,JBB6604,960425,PD00XB: RTLS                           09650000
*   $L2=OWxxxxxx ,HBB6606,971201,PD00XB: Return DCB and Library ID      09675000
*                                                                       09700000
* END OF SPECIFICATIONS *********************************************/  09750000
*% /*                                                                   09800000
.P0      ANOP                                                           09850000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 09900000
         AIF   ('&LIST' EQ 'YES').P2                                    09950000
.P1      ANOP                                                           10000000
         PUSH  PRINT                                                    10050000
         PRINT OFF                                                      10100000
.P2      ANOP                                                           10150000
         AIF   ('&RTAAHDR' EQ 'NO').L0002                               10200000
         AIF   ('&DSECT' EQ 'YES').L0003                                10250000
         AIF   ('&RTAAHDR' NE 'YES').L0002                              10300000
RTAAHDR  DS    0F        Header section                                 10350000
         AGO   .L0004                                                   10400000
.L0003   ANOP                                                           10450000
RTAAHDR  DSECT           Header section                                 10500000
.L0004   ANOP                                                           10550000
RTAAHNUMPH DS  1FL4      Number of RTAAPH entries which follow          10600000
RTAAHNUMLO DS  1FL4      Number of RTAALO entries which follow          10650000
RTAAHNUMPHREM DS 1FL4    Number of RTAAPH entries which were not       *10700000
                         returned because of insufficient space         10750000
RTAAHNUMLOREM DS 1FL4    Number of RTAALO entries which were not       *10800000
                         returned because of insufficient space         10850000
RTAAHTLEN DS   1FL4      Total length of answer area needed to contain *10900000
                         all the requested information. This includes  *10950000
                         the area for the records that were returned   *11000000
                         on this call.                                  11050000
RTAAHFIRSTPHADDR DS 1AL4 Address of first RTAAPH                        11100000
RTAAHFIRSTLOADDR DS 1AL4 Address of first RTAALO                        11150000
RTAAHMAXBELOW DS 1FL4    Limitation (in bytes) of below-16M common for *11200000
                         modules                                        11250000
RTAAHBELOWUSED DS 1FL4   Number of bytes used of below-16M common for  *11300000
                         modules                                        11350000
RTAAHMAXABOVE DS 1FL4    Limitation (in bytes) of above-16M common for *11400000
                         modules. 0 indicates that there is no limit    11450000
RTAAHABOVEUSED DS 1FL4   Number of bytes used of below-16M common for  *11500000
                         modules                                        11550000
RTAAHFLAGS DS  1BL1      Flags                                          11650000
         ORG   RTAAHFLAGS                                               11700000
RTAAHNOABOVE16M EQU X'80' An attempt was made to get storage           *11750000
                         above-16M. The system was unable to comply    *11800000
                         and the storage was obtained below 16M. No    *11850000
                         subsequent caching of modules will be done.    11900000
RTAAHCACHEBELOWISFULL EQU X'40'                                         11950000
RTAAHCACHEABOVEISFULL EQU X'20'                                         12000000
         ORG   RTAAHFLAGS+X'00000001'                                   12050000
         DS    1CL0003   Reserved                                       12100000
RTAAHFULLCACHELIMIT DS 1FL4 Limit of number of times the RTLS cache    *12150000
                         could not meet the needs for the module being *12200000
                         loaded before the cache is actually marked as *12250000
                         being full.                                    12300000
RTAAHFULLCACHECOUNT DS 1FL4 Number of times that the RTLS cache limit  *12350000
                         could not meet the needs for the module being *12400000
                         loaded.                                        12450000
*                                                                       12650000
*    *****************************************************************  12700000
*    *                                                               *  12750000
*    * Return Code Information It is guaranteed that no reason code  *  12800000
*    * will be reused (i.e., the same reason code will not be used   *  12850000
*    * for more than one return code). Also note carefully that bits *  12900000
*    * 0-15 of the reason code may contain component-diagnostic data *  12950000
*    * and must not be assumed to be 0.                              *  13000000
*    *                                                               *  13050000
*    *****************************************************************  13100000
*                                                                       13150000
*                                                                       13200000
CSVRTLSRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non    *13250000
                         component-diagnostic portion of the reason    *13300000
                         code.                                          13350000
*                                                                       13400000
*   CSVRTLS Return and Reason Code definitions                          13450000
*                                                                       13500000
*                                                                       13550000
CSVRTLSRC_OK EQU X'00000000' Meaning: CSVRTLS request successful.      *13600000
                         Action: None required.                         13650000
CSVRTLSRC_WARN EQU X'00000004' Meaning: Warning Action: Refer to       *13700000
                         action provided with the reason code.          13750000
CSVRTLSRSNLISTNOMATCHES EQU X'00000401' Meaning: For LIST request, no  *13800000
                         matching logical and/or physical libraries    *13850000
                         matches the request. Action: Make sure that   *13900000
                         you specified the proper library name.         13950000
CSVRTLSRSNALIASESEXIST EQU X'00000402' Meaning: For DISCONNECT         *14000000
                         request, there are outstanding alias entries  *14050000
                         to modules loaded for this library. An        *14100000
                         ATTACH(X), LINK(X), or XCTL(X) was issued     *14150000
                         using the name of a module loaded by RTLS for *14200000
                         this library. Action: Avoid using DISCONNECT  *14250000
                         when there are such alias entries. If you     *14300000
                         cancel the jobstep, the system will perform   *14350000
                         the cleanup and disconnect on your behalf.     14400000
CSVRTLSRSNNOTALLDATARETURNED EQU X'00000403' Meaning: For LIST         *14450000
                         request, not all data was returned because    *14500000
                         the answer area is not big enough. Answer     *14550000
                         area field RTAAHTLEN indicates how much space *14600000
                         is currently required. Action: Allocate a     *14650000
                         larger area and request the function again.    14700000
CSVRTLSRC_INVPARM EQU X'00000008' Meaning: CSVRTLS request specifies   *14750000
                         invalid parameters. Action: Refer to action   *14800000
                         provided with the reason code.                 14850000
CSVRTLSRSNBADPARMLIST EQU X'00000801' Meaning: Unable to access        *14900000
                         parameter list. Action: Check for possible    *14950000
                         storage overlay.                               15000000
CSVRTLSRSNNOTAUTHORIZED EQU X'00000804' Meaning: For CONNECT or LOAD - *15050000
                         not authorized. For CONNECT, the customer has *15100000
                         requested that security checking be done. You *15147200
                         do not have read access to RACF FACILITY      *15194400
                         class resource CSVRTLS.LIBRARY.libra          *15241600
                         ry.version. For LOAD, the customer has        *15288800
                         restricted access to the program that you are *15336000
                         attempting to access. You do not have access  *15383200
                         to that program. Action: Request this         *15430400
                         function only when you have the proper         15477600
*                        authority. For LOAD, refer to the             *15524800
                         documenation for completion code 306 reason   *15572000
                         code 30 within the system codes publication,  *15619200
                         and the documentation for message CSV205I     *15666400
                         within the system messages publication for    *15713600
                         further information. While the completion     *15760800
                         code and message are not produced, the        *15808000
                         information pertaining to them does apply to  *15855200
                         this situation.                                15902400
CSVRTLSRSNBADANSAREAALET EQU X'00000806' Meaning: Bad answer area      *15950000
                         ALET. Action: Make sure that the ALET         *16000000
                         associated with the answer area is valid. You *16050000
                         might not have set up its access register     *16100000
                         properly.                                      16150000
CSVRTLSRSNBADANSAREA EQU X'00000807' Meaning: Error accessing answer   *16200000
                         area. Action: Make sure that the provided     *16250000
                         answer area is valid.                          16300000
CSVRTLSRSNBADANSLEN EQU X'00000808' Meaning: LIST - AnsLen is less     *16350000
                         than size of the header area. Action: Provide *16400000
                         a larger answer area (as indicated by the     *16450000
                         ANSLEN keyword).                               16500000
CSVRTLSRSNBADREQUESTTYPE EQU X'00000809' Meaning: Request type is not  *16550000
                         valid. Action: Check for possible storage     *16600000
                         overlay of the parameter list.                 16650000
CSVRTLSRSNBADESTAEX EQU X'0000080A' Meaning: Unable to establish       *16700000
                         ESTAEX. "xxxx" contains ESTAE(X) return code. *16750000
                         Action: Refer to documentation for ESTAEX     *16800000
                         return code "xxxx".                            16850000
CSVRTLSRSNRESERVEDNOT0 EQU X'0000080B' Meaning: Reserved field not 0.  *16900000
                         Action: Check for possible storage overlay of *16950000
                         the parameter list.                            17000000
CSVRTLSRSNBADOUTXTLSTALET EQU X'0000080C' Meaning: Bad Outxtlst ALET.  *17050000
                         Action: Make sure that the ALET of the        *17100000
                         OUTXTLST area is valid. You might not have    *17150000
                         set up its access register properly.           17200000
CSVRTLSRSNBADPARMLISTALET EQU X'0000080D' Meaning: Bad parmlist ALET.  *17250000
                         Action: Make sure that the ALET of the        *17300000
                         parameter list is valid. You might not have   *17350000
                         set up its access register properly.           17400000
CSVRTLSRSNBADVERSION EQU X'0000080E' Meaning: Bad version number.      *17450000
                         Action: Check for possible storage overlay of *17500000
                         the parameter list.                            17550000
CSVRTLSRSNLIBRARYNOTFOUND EQU X'00000810' Meaning: For CONNECT or LIST *17600000
                         request, the requested library is not defined *17650000
                         to RTLS. Action: Make sure that you specified *17700000
                         the correct library name.                      17750000
CSVRTLSRSNBADLISTTYPE EQU X'00000811' Meaning: For LIST, the ListType  *17800000
                         value is incorrect. Action: Check for         *17850000
                         possible storage overlay of the parameter     *17900000
                         list.                                          17950000
CSVRTLSRSNBADCONTOKEN EQU X'0000082C' Meaning: For LOAD, DELETE, or    *18000000
                         DISCONNECT the input contoken does not        *18050000
                         represent a valid connection. Action: Make    *18100000
                         sure that you specified the connect token     *18150000
                         that was returned by the CONNECT request.      18200000
CSVRTLSRSNMODULENOTLOADED EQU X'0000082D' Meaning: For LOAD, the       *18250000
                         module could not be loaded. A valid copy of   *18300000
                         the module was not located within the logical *18350000
                         library represented by the connect token. If  *18400000
                         you are authorized, the only copy might have  *18450000
                         been within an unauthorized library. There    *18493700
                         might not have been enough storage available  *18537400
                         to satisfy the request to load the module.    *18581100
                         Action: Make sure that you specified the      *18624800
                         correct connect token and correct module       18668500
*                        name. If you are authorized, make sure that   *18712200
                         the library containing the module is          *18755900
                         authorized. When the field designated by the  *18799600
                         OUTEPA parameter is non-zero, it contains     *18843300
                         additional diagnostic information. That       *18887000
                         information is in the format 000cccrr where   *18930700
                         ccc represents a system completion code, and  *18974400
                         rr the reason code associated with that       *19018100
                         completion code. Refer to the system codes    *19061800
                         publication for further information.           19105500
CSVRTLSRSNMODADDRNOTVALID EQU X'0000082E' Meaning: For DELETE, the     *19150000
                         provided address does not represent a module  *19200000
                         previously loaded by the LOAD request.        *19250000
                         Action: Make sure that you specified the      *19300000
                         correct connect token and correct module      *19350000
                         address.                                       19400000
CSVRTLSRSNBADTCBADDR EQU X'0000082F' Meaning: The provided TCBADDR     *19450000
                         parameter does not specify a task that either *19500000
                         is the current task or an ancestor task. The  *19550000
                         oldest task allowed is the connecting task.   *19600000
                         Alternately, the caller was not authorized.   *19625000
                         Action: Make sure that you specified the      *19650000
                         correct TCBADDR and that you are authorized.   19700000
CSVRTLSRSNBADTASK EQU X'00000830' Meaning: The task issuing a LOAD or  *19750000
                         DELETE request is neither the connecting task *19800000
                         nor a subtask of that task. The task issuing  *19850000
                         a DISCONNECT request is not the connecting    *19900000
                         task. Action: Make sure that you use the      *19950000
                         LOAD, DELETE, and DISCONNECT requests only    *20000000
                         from a proper task.                            20050000
CSVRTLSRSNBADOUTXTLST EQU X'00000831' Meaning: Unable to access the    *20100000
                         OutXtlst area. Action: Check that you         *20150000
                         provided a valid area.                         20200000
CSVRTLSRSNBADOUTXTLSTCONTENTS EQU X'00000832' Meaning: The             *20250000
                         RtlsXtlNumEntriesProvided field had an        *20300000
                         incorrect value. Action: Fill in the          *20350000
                         RtlsXtlNumEntriesProvided area using equate   *20400000
                         symbol RtlsXtlMaxNumEntries prior to invoking *20450000
                         the macro.                                     20500000
CSVRTLSRC_ENV EQU X'0000000C' Meaning: Environmental error Action:     *20550000
                         Refer to action provided with the reason      *20600000
                         code.                                          20650000
CSVRTLSRSNNOSTORAGE EQU X'00000C01' Meaning: No storage is available   *20700000
                         to complete the request. Action: Contact your *20750000
                         system programmer. There is a common storage  *20800000
                         shortage.                                      20850000
CSVRTLSRSNTOOMANYCONNECTIONS EQU X'00000C02' Meaning: The limit of 32  *20900000
                         connections from an address space by          *20950000
                         unauthorized callers been reached. Action:    *21000000
                         Restructure your program so that it requests  *21050000
                         fewer connections.                             21100000
CSVRTLSRSNLOADDELETEINPROCESS EQU X'00000C03' Meaning: For the         *21150000
                         disconnect request, at least one load or      *21200000
                         delete request is still in process. Action:   *21250000
                         Avoid requesting a disconnect when there are  *21300000
                         loads or delete requests still being done. If *21350000
                         the load or delete is being done from a       *21400000
                         subtask, your program could wait for that     *21450000
                         subtask to complete before issuing the        *21500000
                         disconnect request.                            21550000
CSVRTLSRSNTASKINRTLS EQU X'00000C04' Meaning: The issuing task is      *21555000
                         currently processing an RTLS request. Another *21560000
                         request during this time is not allowed.      *21565000
                         Action: Avoid issuing an RTLS request from a  *21570000
                         program running as an interrupt request block *21575000
                         (IRB) when the interrupted program is         *21580000
                         processing an RTLS request. Bit STCBINRT in   *21585000
                         the STCB data area will be on if the          *21590000
                         interrupted program is in this state.          21595000
CSVRTLSRC_COMPERROR EQU X'00000010' Meaning: Unexpected failure.       *21600000
                         Action: Refer to action provided with the     *21650000
                         reason code.                                   21700000
CSVRTLSRSNCOMPERROR EQU X'00001001' Meaning: Unexpected failure. The   *21750000
                         state of the request is unpredictable.        *21800000
                         Action: Contact your system programmer.        21850000
RTAAHDR_LEN EQU *-RTAAHDR                                               21900000
.L0002   ANOP                                                           21950000
*                                                                       22000000
*   End of CSVRTLS Return and Reason Code definitions                   22050000
*                                                                       22100000
*                                                                       22150000
         AIF   ('&RTAAPH' EQ 'NO').L0005                                22200000
         AIF   ('&DSECT' EQ 'YES').L0006                                22250000
         AIF   ('&RTAAPH' NE 'YES').L0005                               22300000
RTAAPH   DS    0F        RTAAPH Record data format                      22350000
         AGO   .L0007                                                   22400000
.L0006   ANOP                                                           22450000
RTAAPH   DSECT           RTAAPH Record data format                      22500000
.L0007   ANOP                                                           22550000
RTAAPHNEXTADDR DS 1AL4   Address of next RTAAPH. RTAAHNumPH must be    *22600000
                         used to determine how far along this chain to *22650000
                         go.                                            22700000
RTAAPHFIRSTDSADDR DS 1AL4 Address of first RTAADS for this RTAAPH       22750000
RTAAPHFIRSTMOADDR DS 1AL4 Address of first RTAAMO for this RTAAPH       22800000
RTAAPHFIRSTPLADDR DS 1AL4 Address of first RTAAPL for this RTAAPH       22850000
RTAAPHNAME DS  1CL0008   Name of physical data set                      22900000
RTAAPHSEQNUM DS 1FL4     Sequence number                                22950000
RTAAPHDCBADDR DS 1AL4    This is the address of the DCB, in common     *22962500
                         storage, associated with the physical         *22975000
                         library.                                       22987500
         ORG   RTAAPHDCBADDR                                            23000000
RTAAPHDCB@ DS  1AL4      This is the address of the DCB, in common     *23012500
                         storage, associated with the physical         *23025000
                         library.                                       23037500
RTAAPHNUMDS DS 1FL4      Number of RTAADS entries associated with this *23050000
                         physical data set                              23100000
RTAAPHNUMMO DS 1FL4      Number of RTAAMO entries associated with this *23150000
                         physical data set                              23200000
RTAAPHNUMPL DS 1FL4      Number of RTAAPL entries associated with this *23250000
                         physical data set                              23300000
RTAAPHFLAGS DS 1BL1      Flags                                          23350000
         ORG   RTAAPHFLAGS                                              23400000
RTAAPHDELETEPENDING EQU X'80'                                           23450000
RTAAPHCACHEBELOWISFULL EQU X'40'                                        23500000
RTAAPHCACHEABOVEISFULL EQU X'20'                                        23550000
         ORG   RTAAPHFLAGS+X'00000001'                                  23600000
         DS    1CL0003   Reserved                                       23650000
RTAAPHMAXBELOW DS 1FL4   Limitation (in bytes) of below-16M common for *23700000
                         modules                                        23750000
RTAAPHBELOWUSED DS 1FL4  Number of bytes used of below-16M common for  *23800000
                         modules                                        23850000
RTAAPHMAXABOVE DS 1FL4   Limitation (in bytes) of above-16M common for *23900000
                         modules. 0 indicates that there is no limit    23950000
RTAAPHABOVEUSED DS 1FL4  Number of bytes used of below-16M common for  *24000000
                         modules                                        24050000
RTAAPHFULLCACHELIMIT DS 1FL4 Limit of number of times the physical     *24100000
                         library cache limit could not meet the needs  *24150000
                         for the module being loaded, before the cache *24200000
                         is actually marked as being full.              24250000
RTAAPHFULLCACHECOUNT DS 1FL4 Number of times that the physical library *24300000
                         cache limit could not meet the needs for the  *24350000
                         module being loaded.                           24400000
RTAAPH_LEN EQU *-RTAAPH                                                 24450000
.L0005   ANOP                                                           24500000
         AIF   ('&RTAADS' EQ 'NO').L0008                                24550000
         AIF   ('&DSECT' EQ 'YES').L0009                                24600000
         AIF   ('&RTAADS' NE 'YES').L0008                               24650000
RTAADS   DS    0F        RTAADS Record data format                      24700000
         AGO   .L000A                                                   24750000
.L0009   ANOP                                                           24800000
RTAADS   DSECT           RTAADS Record data format                      24850000
.L000A   ANOP                                                           24900000
RTAADSNEXTADDR DS 1AL4   Address of next RTAADS. RTAAPHNumDS must be   *24950000
                         used to determine how far along this chain to *25000000
                         go.                                            25050000
         DS    1CL0002   UNUSED                                         25100000
RTAADSVOLSER DS 1CL0006  Volume ID. Represents status as of last       *25150000
                         allocation                                     25200000
RTAADSNAME DS  1CL0044   Data set name.                                 25250000
RTAADS_LEN EQU *-RTAADS                                                 25300000
.L0008   ANOP                                                           25350000
         AIF   ('&RTAAMO' EQ 'NO').L000B                                25400000
         AIF   ('&DSECT' EQ 'YES').L000C                                25450000
         AIF   ('&RTAAMO' NE 'YES').L000B                               25500000
RTAAMO   DS    0F        RTAAMO Record data format                      25550000
         AGO   .L000D                                                   25600000
.L000C   ANOP                                                           25650000
RTAAMO   DSECT           RTAAMO Record data format                      25700000
.L000D   ANOP                                                           25750000
RTAAMONEXTADDR DS 1AL4   Address of next RTAAMO. RTAAPHNumMO must be   *25800000
                         used to determine how far along this chain to *25850000
                         go.                                            25900000
RTAAMOFLAGS DS 1BL1      Flags                                          25950000
         ORG   RTAAMOFLAGS                                              26000000
RTAAMOPRELOADREQUESTED EQU X'80'                                        26050000
RTAAMOPRELOADSUCCESSFUL EQU X'40'                                       26100000
         ORG   RTAAMOFLAGS+X'00000001'                                  26150000
         DS    1CL0003   UNUSED                                         26200000
RTAAMOEPADDR DS 1AL4     Entry-point address                            26250000
RTAAMOLOADPTADDR1 DS 1AL4 Load point                                    26300000
RTAAMOLENGTH1 DS 1FL4    Length                                         26350000
RTAAMOLOADPTADDR2 DS 1AL4 Load point 2 (may be 0)                       26400000
RTAAMOLENGTH2 DS 1FL4    Length (may be 0)                              26450000
RTAAMONAME DS  1CL0008   Module name                                    26500000
RTAAMO_LEN EQU *-RTAAMO                                                 26550000
.L000B   ANOP                                                           26600000
         AIF   ('&RTAALO' EQ 'NO').L000E                                26650000
         AIF   ('&DSECT' EQ 'YES').L000F                                26700000
         AIF   ('&RTAALO' NE 'YES').L000E                               26750000
RTAALO   DS    0F        RTAALO Record data format                      26800000
         AGO   .L0010                                                   26850000
.L000F   ANOP                                                           26900000
RTAALO   DSECT           RTAALO Record data format                      26950000
.L0010   ANOP                                                           27000000
RTAALONEXTADDR DS 1AL4   Address of next RTAALO. RTAAHNumLO must be    *27050000
                         used to determine how far along this chain to *27100000
                         go.                                            27150000
RTAALOFIRSTLPHADDR DS 1AL4 Address of first RTAALPH for this RTAALO     27200000
RTAALOFIRSTMOADDR DS 1AL4 Address of first RTAAMO for this RTAALO       27250000
RTAALOFIRSTLUADDR DS 1AL4 Address of first RTAALU for this RTAALO       27300000
RTAALONAME DS  1CL0008   Name of logical data set                       27350000
RTAALOVERSION DS 1CL0008 Version name                                   27400000
RTAALOSEQNUM DS 1FL4     Sequence number                                27450000
         DS    1CL0004   UNUSED                                         27500000
RTAALONUMLPH DS 1FL4     Number of RTAALPH entries associated with     *27550000
                         this logical data set                          27600000
RTAALONUMMO DS 1FL4      Number of RTAAMO entries associated with this *27650000
                         logical data set                               27700000
RTAALONUMLU DS 1FL4      Number of RTAALU entries associated with this *27750000
                         logical data set                               27800000
RTAALOFLAGS DS 1BL1      Flags                                          27850000
         ORG   RTAALOFLAGS                                              27900000
RTAALODELETEPENDING EQU X'80'                                           27950000
RTAALODEFAULT EQU X'40'                                                 28000000
         ORG   RTAALOFLAGS+X'00000001'                                  28150000
RTAALOSECCHECK DS 1FL1   See equates beginning with RtaaloSecCheck for *28200000
                         values                                         28250000
RTAALOLIBRARYID DS 1FL2  This is the internal ID that identifies the   *28300000
                         logical library                                28350000
         DS    1CL0008   Reserved                                       28400000
RTAALONUMREQUESTS DS 1FL4 Number of times that the logical library was *28800000
                         used successfully to load a module. This is   *28850000
                         the total of the following two fields plus    *28900000
                         those cases where neither the cache nor       *28950000
                         LleJPQ was used                                29000000
RTAALONUMREQUESTSFROMCACHE DS 1FL4 Number of times that the logical    *29050000
                         library cache was used to load a module.       29100000
RTAALONUMREQUESTSFROMCSV DS 1FL4 Number of times that the contents     *29150000
                         supervisor blocks were used to locate a       *29200000
                         previously fetched copy of the module (hence  *29250000
                         avoiding a new fetch)                          29300000
RTAALONUMREQUESTSFROMLLA DS 1FL4 Number of times that the LLA located  *29350000
                         the copy to use                                29400000
RTAALOSECCHECKYES EQU 1                                                 29450000
RTAALOSECCHECKNO EQU 2                                                  29500000
RTAALO_LEN EQU *-RTAALO                                                 29550000
.L000E   ANOP                                                           29600000
         AIF   ('&RTAALPH' EQ 'NO').L0011                               29650000
         AIF   ('&DSECT' EQ 'YES').L0012                                29700000
         AIF   ('&RTAALPH' NE 'YES').L0011                              29750000
RTAALPH  DS    0F        RTAALPH Record data format                     29800000
         AGO   .L0013                                                   29850000
.L0012   ANOP                                                           29900000
RTAALPH  DSECT           RTAALPH Record data format                     29950000
.L0013   ANOP                                                           30000000
RTAALPHNEXTADDR DS 1AL4  Address of next RTAALPH. RTAALONumLPH must be *30050000
                         used to determine how far along this chain to *30100000
                         go.                                            30150000
RTAALPHNAME DS 1CL0008   Physical data set name                         30200000
RTAALPHSEQNUM DS 1FL4    Sequence number                                30250000
         DS    1CL0004   Reserved                                       30300000
RTAALPH_LEN EQU *-RTAALPH                                               30350000
.L0011   ANOP                                                           30400000
         AIF   ('&RTAALU' EQ 'NO').L0014                                30450000
         AIF   ('&DSECT' EQ 'YES').L0015                                30500000
         AIF   ('&RTAALU' NE 'YES').L0014                               30550000
RTAALU   DS    0F        RTAALU Record data format                      30600000
         AGO   .L0016                                                   30650000
.L0015   ANOP                                                           30700000
RTAALU   DSECT           RTAALU Record data format                      30750000
.L0016   ANOP                                                           30800000
RTAALUNEXTADDR DS 1AL4   Address of next RTAALU. RTAALONumLU must be   *30850000
                         used to determine how far along this chain to *30900000
                         go.                                            30950000
RTAALUASID DS  1FL2      ASID                                           31000000
         DS    1CL0002   Unused                                         31050000
RTAALUJOBNAME DS 1CL0008 Jobname                                        31100000
RTAALU_LEN EQU *-RTAALU                                                 31150000
.L0014   ANOP                                                           31200000
         AIF   ('&RTAAPL' EQ 'NO').L0017                                31250000
         AIF   ('&DSECT' EQ 'YES').L0018                                31300000
         AIF   ('&RTAAPL' NE 'YES').L0017                               31350000
RTAAPL   DS    0F        RTAAPL Record data format                      31400000
         AGO   .L0019                                                   31450000
.L0018   ANOP                                                           31500000
RTAAPL   DSECT           RTAAPL Record data format                      31550000
.L0019   ANOP                                                           31600000
RTAAPLNEXTADDR DS 1AL4   Address of next RTAAPL. RTAAPHNumPL must be   *31650000
                         used to determine how far along this chain to *31700000
                         go.                                            31750000
RTAAPLNAME DS  1CL0008   Logical name                                   31800000
RTAAPLVERSION DS 1CL0008 Version                                        31850000
RTAAPLSEQNUM DS 1FL4     Sequence number                                31900000
         DS    1CL0004   Reserved                                       31950000
RTAAPL_LEN EQU *-RTAAPL                                                 32000000
.L0017   ANOP                                                           32050000
         AIF   ('&RTLSXTL' EQ 'NO').L001A                               32100000
         AIF   ('&DSECT' EQ 'YES').L001B                                32150000
         AIF   ('&RTLSXTL' NE 'YES').L001A                              32200000
RTLSXTL  DS    0F        Extent-list format                             32250000
         AGO   .L001C                                                   32300000
.L001B   ANOP                                                           32350000
RTLSXTL  DSECT           Extent-list format                             32400000
.L001C   ANOP                                                           32450000
RTLSXTLNUMENTRIESPROVIDED DS 1FL4 This should be initialized to        *32500000
                         RtlsXtlMaxNumEntries (16) prior to calling    *32550000
                         CSVRTLS REQUEST=LOAD.                          32600000
RTLSXTLNUMENTRIES DS 1FL4 The number of entries that follow.            32650000
RTLSXTLENTRIES DS 1CL0128 Entries area. Entries are contigous. Each is *32700000
                         mapped by RTLSXTLE                             32750000
RTLSXTLMAXNUMENTRIES EQU 16                                             32800000
RTLSXTL_LEN EQU *-RTLSXTL                                               32850000
.L001A   ANOP                                                           32900000
         AIF   ('&RTLSXTLE' EQ 'NO').L001D                              32950000
         AIF   ('&DSECT' EQ 'YES').L001E                                33000000
         AIF   ('&RTLSXTLE' NE 'YES').L001D                             33050000
RTLSXTLE DS    0F        Extent-list entry format                       33100000
         AGO   .L001F                                                   33150000
.L001E   ANOP                                                           33200000
RTLSXTLE DSECT           Extent-list entry format                       33250000
.L001F   ANOP                                                           33300000
RTLSXTLELOADPTADDR DS 1AL4 Segment load point address                   33350000
RTLSXTLELENGTH DS 1FL4   Segment length                                 33400000
RTLSXTLE_LEN EQU *-RTLSXTLE                                             33450000
.L001D   ANOP                                                           33500000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 33550000
         AIF   ('&LIST' EQ 'YES').P4                                    33600000
.P3      ANOP                                                           33650000
         POP   PRINT                                                    33700000
.P4      ANOP                                                           33750000
.P_EXIT  ANOP                                                           33800000
         MEND                                                           33850000
**/ CSVRTAA_2:;                                                         33900000
* %CSVRTAA_INCLUDED = 'YES';                                            33950000
* %DCL ZCBPRINT CHAR EXT;                                               34000000
* %DEACTIVATE ZCBPRINT;                                                 34050000
* %DCL CSVRTAA_LIST CHAR EXT;                                           34100000
* %DEACTIVATE CSVRTAA_LIST;                                             34150000
* %IF CSVRTAA_LIST ^= 'NO' &                                            34200000
*    ZCBPRINT ^= 'NO' %THEN                                             34250000
*   %GOTO CSVRTAA_3;                                                    34300000
*   @LIST PUSH NOECHO;                                                  34350000
*   @LIST NOASSEMBLE NOECHO;                                            34400000
*   @LIST OFF C NOECHO;                                                 34450000
* %CSVRTAA_3:;                                                          34500000
*/* Start of PL/X Source                                             */ 34550000
*DCL 1 RTAAHDR TYPE,       /* Header section                     @L1A*/ 34600000
*     2 RTAAHNumPH FIXED(31),/* Number of RTAAPH entries which follow   34650000
*                                                                @L1A*/ 34700000
*     2 RTAAHNumLO FIXED(31),/* Number of RTAALO entries which follow   34750000
*                                                                @L1A*/ 34800000
*     2 RTAAHNumPHREM FIXED(31),/* Number of RTAAPH                     34850000
*                             entries which were not returned because   34900000
*                             of insufficient space              @L1A*/ 34950000
*     2 RTAAHNumLOREM FIXED(31),/* Number of RTAALO                     35000000
*                             entries which were not returned because   35050000
*                             of insufficient space              @L1A*/ 35100000
*     2 RTAAHTLEN FIXED(31),/* Total length of answer area needed to    35150000
*                             contain all the requested information.    35200000
*                             This includes the area for the records    35250000
*                             that were returned on this call.   @L1A*/ 35300000
*     2 RTAAHFIRSTPHADDR PTR(31), /* Address of first RTAAPH     @L1A*/ 35350000
*     2 RTAAHFIRSTLOADDR PTR(31), /* Address of first RTAALO     @L1A*/ 35400000
*     2 RTAAHMaxBelow FIXED(31),   /* Limitation (in bytes) of          35450000
*                               below-16M common for modules     @L1A*/ 35500000
*     2 RTAAHBelowUsed FIXED(31),   /* Number of bytes used of          35550000
*                               below-16M common for modules     @L1A*/ 35600000
*     2 RTAAHMaxAbove FIXED(31),   /* Limitation (in bytes) of          35650000
*                               above-16M common for modules. 0         35700000
*                               indicates that there is no limit @L1A*/ 35750000
*     2 RTAAHAboveUsed FIXED(31),   /* Number of bytes used of          35800000
*                               below-16M common for modules     @L1A*/ 35850000
*     2 RTAAHFlags BIT(8),          /* Flags                     @L1A*/ 35950000
*       3 RTAAHNoAbove16M BIT(1),   /* An attempt was made to get       36000000
*                storage above-16M. The system was unable to comply     36050000
*                and the storage was obtained below 16M.                36100000
*                No subsequent caching of modules will be               36150000
*                done.                                           @L1A*/ 36200000
*       3 RTAAHCacheBelowIsFull BIT(1),  /*                      @L1A*/ 36250000
*       3 RTAAHCacheAboveIsFull BIT(1),  /*                      @L1A*/ 36300000
*     2 * CHAR(3),                  /* Reserved                  @L1A*/ 36350000
*     2 RTAAHFullCacheLimit FIXED,    /* Limit of number of times       36400000
*                the RTLS cache could not meet the needs for the        36450000
*                module being loaded before the cache is actually       36500000
*                marked as being full.                           @L1A*/ 36550000
*     2 RTAAHFullCacheCount FIXED,       /* Number of times that        36600000
*                the RTLS cache limit could not meet the needs for the  36650000
*                module being loaded.                            @L1A*/ 36700000
*     2 * CHAR(0) BDY(WORD);   /* Word-align the ending          @L1A*/ 36750000
*    /* Return Code Information                                      */ 36950000
*                                                                       37000000
*    /* It is guaranteed that                                           37050000
*       no reason code will be reused (i.e., the same reason code       37100000
*       will not be used for more than one return code).            */  37150000
*                                                                       37200000
*    /* Also note carefully that bits 0-15 of the reason code           37250000
*       may contain component-diagnostic data and must not be           37300000
*       assumed to be 0.                                            */  37350000
*                                                                       37400000
*Dcl CsvrtlsRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this      37450000
*               mask to isolate the non component-diagnostic            37500000
*               portion of the reason code.                      @L1A*/ 37550000
*/* CSVRTLS Return and Reason Code definitions                       */ 37600000
*DCL CSVRTLSRc_OK BIT(32) Constant('00000000'X) ; /*                    37650000
*                        Meaning: CSVRTLS request successful.           37700000
*                        Action: None required.                      */ 37750000
*DCL CSVRTLSRc_Warn BIT(32) Constant('00000004'X) ; /*                  37800000
*                        Meaning: Warning                               37850000
*                        Action: Refer to action provided with the      37900000
*                        reason code.                                */ 37950000
*DCL CsvrtlsRsnListNoMatches BIT(32) Constant('00000401'X) ; /*         38000000
*                        Meaning: For LIST request, no matching logical 38050000
*                        and/or physical libraries matches the request. 38100000
*                        Action: Make sure that you specified the       38150000
*                        proper library name.                        */ 38200000
*DCL CsvrtlsRsnAliasesExist BIT(32) Constant('00000402'X) ; /*          38250000
*                        Meaning: For DISCONNECT request, there are     38300000
*                        outstanding alias entries to modules loaded    38350000
*                        for this library. An ATTACH(X), LINK(X), or    38400000
*                        XCTL(X) was issued using the name of a module  38450000
*                        loaded by RTLS for this library.               38500000
*                        Action: Avoid using DISCONNECT when there are  38550000
*                        such alias entries. If you cancel the jobstep, 38600000
*                        the system will perform the cleanup and        38650000
*                        disconnect on your behalf.                  */ 38700000
*DCL CsvrtlsRsnNotAllDataReturned BIT(32) Constant('00000403'X) ; /*    38750000
*                        Meaning: For LIST request, not all data was    38800000
*                        returned because the answer area is not big    38850000
*                        enough. Answer area field RTAAHTLEN indicates  38900000
*                        how much space is currently required.          38950000
*                        Action: Allocate a larger area and request the 39000000
*                        function again.                             */ 39050000
*DCL CSVRTLSRc_InvParm BIT(32) Constant('00000008'X) ; /*               39100000
*                        Meaning: CSVRTLS request specifies invalid     39150000
*                        parameters.                                    39200000
*                        Action: Refer to action provided with the      39250000
*                        reason code.                                */ 39300000
*DCL CsvrtlsRsnBadParmlist BIT(32) Constant('00000801'X) ; /*           39350000
*                        Meaning: Unable to access parameter list.      39400000
*                        Action: Check for possible storage overlay. */ 39450000
*DCL CsvrtlsRsnNotAuthorized BIT(32) Constant('00000804'X) ; /*         39500000
*                        Meaning: For CONNECT or LOAD - not authorized. 39550000
*                        For CONNECT, the customer has requested that   39600000
*                        security checking be done. You do not have     39650000
*                        read access to RACF FACILITY class resource    39700000
*                        CSVRTLS.LIBRARY.library.version. For LOAD, the 39750000
*                        customer has restricted access to the program  39800000
*                        that you are attempting to access. You do not  39850000
*                        have access to that program.                   39900000
*                        Action: Request this function only when you    39950000
*                        have the proper authority. For LOAD, refer to  40000000
*                        the documenation for completion code 306       40050000
*                        reason code 30 within the system codes         40100000
*                        publication, and the documentation for message 40150000
*                        CSV205I within the system messages publication 40200000
*                        for further information. While the completion  40250000
*                        code and message are not produced, the         40300000
*                        information pertaining to them does apply to   40350000
*                        this situation.                             */ 40400000
*DCL CsvrtlsRsnBadAnsareaALET BIT(32) Constant('00000806'X) ; /*        40450000
*                        Meaning: Bad answer area ALET.                 40500000
*                        Action: Make sure that the ALET associated     40550000
*                        with the answer area is valid. You might not   40600000
*                        have set up its access register properly.   */ 40650000
*DCL CsvrtlsRsnBadAnsarea BIT(32) Constant('00000807'X) ; /*            40700000
*                        Meaning: Error accessing answer area.          40750000
*                        Action: Make sure that the provided answer     40800000
*                        area is valid.                              */ 40850000
*DCL CsvrtlsRsnBadAnslen BIT(32) Constant('00000808'X) ; /*             40900000
*                        Meaning: LIST - AnsLen is less than size of    40950000
*                        the header area.                               41000000
*                        Action: Provide a larger answer area (as       41050000
*                        indicated by the ANSLEN keyword).           */ 41100000
*DCL CsvrtlsRsnBadRequestType BIT(32) Constant('00000809'X) ; /*        41150000
*                        Meaning: Request type is not valid.            41200000
*                        Action: Check for possible storage overlay of  41250000
*                        the parameter list.                         */ 41300000
*DCL CsvrtlsRsnBadEstaex BIT(32) Constant('0000080A'X) ; /*             41350000
*                        Meaning: Unable to establish ESTAEX. "xxxx"    41400000
*                        contains ESTAE(X) return code.                 41450000
*                        Action: Refer to documentation for ESTAEX      41500000
*                        return code "xxxx".                         */ 41550000
*DCL CsvrtlsRsnReservedNot0 BIT(32) Constant('0000080B'X) ; /*          41600000
*                        Meaning: Reserved field not 0.                 41650000
*                        Action: Check for possible storage overlay of  41700000
*                        the parameter list.                         */ 41750000
*DCL CsvrtlsRsnBadOutxtlstALET BIT(32) Constant('0000080C'X) ; /*       41800000
*                        Meaning: Bad Outxtlst ALET.                    41850000
*                        Action: Make sure that the ALET of the         41900000
*                        OUTXTLST area is valid. You might not have set 41950000
*                        up its access register properly.            */ 42000000
*DCL CsvrtlsRsnBadParmlistALET BIT(32) Constant('0000080D'X) ; /*       42050000
*                        Meaning: Bad parmlist ALET.                    42100000
*                        Action: Make sure that the ALET of the         42150000
*                        parameter list is valid. You might not have    42200000
*                        set up its access register properly.        */ 42250000
*DCL CsvrtlsRsnBadVersion BIT(32) Constant('0000080E'X) ; /*            42300000
*                        Meaning: Bad version number.                   42350000
*                        Action: Check for possible storage overlay of  42400000
*                        the parameter list.                         */ 42450000
*DCL CsvrtlsRsnLibraryNotFound BIT(32) Constant('00000810'X) ; /*       42500000
*                        Meaning: For CONNECT or LIST request, the      42550000
*                        requested library is not defined to RTLS.      42600000
*                        Action: Make sure that you specified the       42650000
*                        correct library name.                       */ 42700000
*DCL CsvrtlsRsnBadListType BIT(32) Constant('00000811'X) ; /*           42750000
*                        Meaning: For LIST, the ListType value is       42800000
*                        incorrect.                                     42850000
*                        Action: Check for possible storage overlay of  42900000
*                        the parameter list.                         */ 42950000
*DCL CsvrtlsRsnBadContoken BIT(32) Constant('0000082C'X) ; /*           43000000
*                        Meaning: For LOAD, DELETE, or DISCONNECT the   43050000
*                        input contoken does not represent a valid      43100000
*                        connection.                                    43150000
*                        Action: Make sure that you specified the       43200000
*                        connect token that was returned by the CONNECT 43250000
*                        request.                                    */ 43300000
*DCL CsvrtlsRsnModuleNotLoaded BIT(32) Constant('0000082D'X) ; /*       43350000
*                        Meaning: For LOAD, the module could not be     43400000
*                        loaded. A valid copy of the module was not     43450000
*                        located within the logical library represented 43500000
*                        by the connect token. If you are authorized,   43550000
*                        the only copy might have been within an        43600000
*                        unauthorized library. There might not have     43625000
*                        been enough storage available to satisfy the   43650000
*                        request to load the module.                    43675000
*                        Action: Make sure that you specified the       43700000
*                        correct connect token and correct module name. 43750000
*                        If you are authorized, make sure that the      43800000
*                        library containing the module is authorized.   43850000
*                        When the field designated by the OUTEPA        43900000
*                        parameter is non-zero, it contains additional  43950000
*                        diagnostic information. That information is in 44000000
*                        the format 000cccrr where ccc represents a     44050000
*                        system completion code, and rr the reason code 44100000
*                        associated with that completion code. Refer to 44150000
*                        the system codes publication for further       44200000
*                        information.                                */ 44250000
*DCL CsvrtlsRsnModaddrNotValid BIT(32) Constant('0000082E'X) ; /*       44300000
*                        Meaning: For DELETE, the provided address does 44350000
*                        not represent a module previously loaded by    44400000
*                        the LOAD request.                              44450000
*                        Action: Make sure that you specified the       44500000
*                        correct connect token and correct module       44550000
*                        address.                                    */ 44600000
*DCL CsvrtlsRsnBadTCBADDR BIT(32) Constant('0000082F'X) ; /*            44650000
*                        Meaning: The provided TCBADDR parameter does   44700000
*                        not specify a task that either is the current  44750000
*                        task or an ancestor task. The oldest task      44800000
*                        allowed is the connecting task. Alternately,   44833300
*                        the caller was not authorized.                 44866600
*                        Action: Make sure that you specified the       44900000
*                        correct TCBADDR and that you are authorized.   44933300
*                                                                    */ 44966600
*DCL CsvrtlsRsnBadTask BIT(32) Constant('00000830'X) ; /*               45000000
*                        Meaning: The task issuing a LOAD or DELETE     45050000
*                        request is neither the connecting task nor a   45100000
*                        subtask of that task. The task issuing a       45150000
*                        DISCONNECT request is not the connecting task. 45200000
*                        Action: Make sure that you use the LOAD,       45250000
*                        DELETE, and DISCONNECT requests only from a    45300000
*                        proper task.                                */ 45350000
*DCL CsvrtlsRsnBadOutxtlst BIT(32) Constant('00000831'X) ; /*           45400000
*                        Meaning: Unable to access the OutXtlst area.   45450000
*                        Action: Check that you provided a valid area.  45500000
*                                                                    */ 45550000
*DCL CsvrtlsRsnBadOutxtlstContents BIT(32) Constant('00000832'X) ; /*   45600000
*                        Meaning: The RtlsXtlNumEntriesProvided field   45650000
*                        had an incorrect value.                        45700000
*                        Action: Fill in the RtlsXtlNumEntriesProvided  45750000
*                        area using equate symbol RtlsXtlMaxNumEntries  45800000
*                        prior to invoking the macro.                */ 45850000
*DCL CsvrtlsRc_Env BIT(32) Constant('0000000C'X) ; /*                   45900000
*                        Meaning: Environmental error                   45950000
*                        Action: Refer to action provided with the      46000000
*                        reason code.                                */ 46050000
*DCL CsvrtlsRsnNoStorage BIT(32) Constant('00000C01'X) ; /*             46100000
*                        Meaning: No storage is available to complete   46150000
*                        the request.                                   46200000
*                        Action: Contact your system programmer. There  46250000
*                        is a common storage shortage.               */ 46300000
*DCL CsvrtlsRsnTooManyConnections BIT(32) Constant('00000C02'X) ; /*    46350000
*                        Meaning: The limit of 32 connections from an   46400000
*                        address space by unauthorized callers been     46450000
*                        reached.                                       46500000
*                        Action: Restructure your program so that it    46550000
*                        requests fewer connections.                 */ 46600000
*DCL CsvrtlsRsnLoadDeleteInProcess BIT(32) Constant('00000C03'X) ; /*   46650000
*                        Meaning: For the disconnect request, at least  46700000
*                        one load or delete request is still in         46750000
*                        process.                                       46800000
*                        Action: Avoid requesting a disconnect when     46850000
*                        there are loads or delete requests still being 46900000
*                        done. If the load or delete is being done from 46950000
*                        a subtask, your program could wait for that    47000000
*                        subtask to complete before issuing the         47050000
*                        disconnect request.                         */ 47100000
*DCL CsvrtlsRsnTaskInRTLS BIT(32) Constant('00000C04'X) ; /*            47104500
*                        Meaning: The issuing task is currently         47109000
*                        processing an RTLS request. Another request    47113500
*                        during this time is not allowed.               47118000
*                        Action: Avoid issuing an RTLS request from a   47122500
*                        program running as an interrupt request block  47127000
*                        (IRB) when the interrupted program is          47131500
*                        processing an RTLS request. Bit STCBINRT in    47136000
*                        the STCB data area will be on if the           47140500
*                        interrupted program is in this state.       */ 47145000
*DCL CsvrtlsRC_CompError BIT(32) Constant('00000010'X) ; /*             47150000
*                        Meaning: Unexpected failure.                   47200000
*                        Action: Refer to action provided with the      47250000
*                        reason code.                                */ 47300000
*DCL CsvrtlsRsnCompError BIT(32) Constant('00001001'X) ; /*             47350000
*                        Meaning: Unexpected failure. The state of the  47400000
*                        request is unpredictable.                      47450000
*                        Action: Contact your system programmer.     */ 47500000
*/* End of CSVRTLS Return and Reason Code definitions                */ 47550000
*                                                                       47600000
*DCL 1 RTAAPH TYPE,            /* RTAAPH Record data format      @L1A*/ 47650000
*     2 RTAAPHNEXTADDR PTR(31), /* Address of next RTAAPH. RTAAHNumPH   47700000
*          must be used to determine how far along this chain to go.    47750000
*                                                                @L1A*/ 47800000
*     2 RTAAPHFirstDSADDR PTR(31), /* Address of first RTAADS for this  47850000
*                                   RTAAPH                       @L1A*/ 47900000
*     2 RTAAPHFirstMOADDR PTR(31), /* Address of first RTAAMO for this  47950000
*                                   RTAAPH                       @L1A*/ 48000000
*     2 RTAAPHFirstPLADDR PTR(31), /* Address of first RTAAPL for this  48050000
*                                   RTAAPH                       @L1A*/ 48100000
*     2 RTAAPHNAME CHAR(8),   /* Name of physical data set       @L1A*/ 48150000
*     2 RTAAPHSeqNum FIXED(31),  /* Sequence number              @L1A*/ 48200000
*     2 RTAAPHDCBADDR PTR(31), /* This is the address of the DCB, in    48214200
*                                common storage, associated with the    48228400
*                                physical library.               @L2A*/ 48242600
*       3 RTAAPHDCB@ PTR(31), /* This is the address of the DCB, in     48256800
*                                common storage, associated with the    48271000
*                                physical library.               @L2A*/ 48285200
*     2 RTAAPHNumDS FIXED(31), /* Number of RTAADS entries associated   48300000
*                               with this physical data set      @L1A*/ 48350000
*     2 RTAAPHNumMO FIXED(31), /* Number of RTAAMO entries associated   48400000
*                               with this physical data set      @L1A*/ 48450000
*     2 RTAAPHNumPL FIXED(31), /* Number of RTAAPL entries associated   48500000
*                               with this physical data set      @L1A*/ 48550000
*     2 RTAAPHFlags BIT(8),   /* Flags                           @L1A*/ 48600000
*       3 RTAAPHDeletePending BIT(1),       /*                   @L1A*/ 48650000
*       3 RTAAPHCacheBelowIsFull BIT(1), /*                      @L1A*/ 48700000
*       3 RTAAPHCacheAboveIsFull BIT(1), /*                      @L1A*/ 48750000
*     2 * CHAR(3),            /* Reserved                        @L1A*/ 48800000
*     2 RTAAPHMaxBelow FIXED(31),  /* Limitation (in bytes) of          48850000
*                               below-16M common for modules     @L1A*/ 48900000
*     2 RTAAPHBelowUsed FIXED(31),  /* Number of bytes used of          48950000
*                               below-16M common for modules     @L1A*/ 49000000
*     2 RTAAPHMaxAbove FIXED(31),  /* Limitation (in bytes) of          49050000
*                               above-16M common for modules. 0         49100000
*                               indicates that there is no limit @L1A*/ 49150000
*     2 RTAAPHAboveUsed FIXED(31),  /* Number of bytes used of          49200000
*                               below-16M common for modules     @L1A*/ 49250000
*     2 RTAAPHFullCacheLimit FIXED,       /* Limit of number of times   49300000
*                the physical library cache limit could not meet the    49350000
*                needs for the module being loaded, before the cache is 49400000
*                actually marked as being full.                  @L1A*/ 49450000
*     2 RTAAPHFullCacheCount FIXED,      /* Number of times that        49500000
*                the physical library cache limit could not meet the    49550000
*                needs for the module being loaded.              @L1A*/ 49600000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 49650000
*                                                                       49700000
*DCL 1 RTAADS TYPE,                  /* RTAADS Record data format       49750000
*                                                                @L1A*/ 49800000
*     2 RTAADSNEXTADDR PTR(31), /* Address of next RTAADS. RTAAPHNumDS  49850000
*          must be used to determine how far along this chain to go.    49900000
*                                                                @L1A*/ 49950000
*     2 * CHAR(2),            /* UNUSED                          @L1A*/ 50000000
*     2 RTAADSVOLSER CHAR(6), /* Volume ID. Represents                  50050000
*                                status as of last allocation    @L1A*/ 50100000
*     2 RTAADSNAME CHAR(44),  /* Data set name.                  @L1A*/ 50150000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 50200000
*                                                                       50250000
*DCL 1 RTAAMO TYPE,                  /* RTAAMO Record data format       50300000
*                                                                @L1A*/ 50350000
*     2 RTAAMONEXTADDR PTR(31), /* Address of next RTAAMO. RTAAPHNumMO  50400000
*          must be used to determine how far along this chain to go.    50450000
*                                                                @L1A*/ 50500000
*     2 RTAAMOFLAGS BIT(8),   /* Flags                           @L1A*/ 50550000
*       3 RTAAMOPreloadRequested BIT(1),  /*                     @L1A*/ 50600000
*       3 RTAAMOPreloadSuccessful BIT(1),  /*                    @L1A*/ 50650000
*     2 * CHAR(3),            /* UNUSED                          @L1A*/ 50700000
*     2 RTAAMOEPADDR PTR(31), /* Entry-point address             @L1A*/ 50750000
*     2 RTAAMOLoadPtAddr1 PTR(31),  /* Load point                @L1A*/ 50800000
*     2 RTAAMOLENGTH1 FIXED(31),  /* Length                      @L1A*/ 50850000
*     2 RTAAMOLoadPtAddr2 PTR(31),  /* Load point 2 (may be 0)   @L1A*/ 50900000
*     2 RTAAMOLENGTH2 FIXED(31),  /* Length (may be 0)           @L1A*/ 50950000
*     2 RTAAMONAME CHAR(8),   /* Module name                     @L1A*/ 51000000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 51050000
*                                                                       51100000
*DCL 1 RTAALO TYPE,            /* RTAALO Record data format      @L1A*/ 51150000
*     2 RTAALONEXTADDR PTR(31), /* Address of next RTAALO. RTAAHNumLO   51200000
*          must be used to determine how far along this chain to go.    51250000
*                                                                @L1A*/ 51300000
*     2 RTAALOFirstLPHADDR PTR(31), /* Address of first RTAALPH for     51350000
*                                   this RTAALO                  @L1A*/ 51400000
*     2 RTAALOFirstMOADDR PTR(31), /* Address of first RTAAMO for       51450000
*                                   this RTAALO                  @L1A*/ 51500000
*     2 RTAALOFirstLUADDR PTR(31), /* Address of first RTAALU for this  51550000
*                                   RTAALO                       @L1A*/ 51600000
*     2 RTAALONAME CHAR(8),   /* Name of logical data set        @L1A*/ 51650000
*     2 RTAALOVERSION CHAR(8),  /* Version name                  @L1A*/ 51700000
*     2 RtaaLoSeqnum FIXED(31),  /* Sequence number              @L1A*/ 51750000
*     2 * CHAR(4),            /* UNUSED                          @L1A*/ 51800000
*     2 RTAALONumLPH FIXED(31),/* Number of RTAALPH entries associated  51850000
*                               with this logical data set       @L1A*/ 51900000
*     2 RTAALONumMO FIXED(31), /* Number of RTAAMO entries associated   51950000
*                               with this logical data set       @L1A*/ 52000000
*     2 RTAALONumLU FIXED(31), /* Number of RTAALU entries associated   52050000
*                               with this logical data set       @L1A*/ 52100000
*     2 RTAALOFlags BIT(8),   /* Flags                           @L1A*/ 52150000
*       3 RTAALODeletePending BIT(1),       /*                   @L1A*/ 52200000
*       3 RTAALODefault BIT(1),   /*                             @L1A*/ 52250000
*     2 RTAALOSecCheck FIXED(8),  /* See equates beginning with         52300000
*                                RtaaloSecCheck for values       @L1A*/ 52350000
*     2 RTAALOLibraryID Fixed(16), /* This is the internal ID that      52400000
*                                identifies the logical library  @L2A*/ 52450000
*     2 * CHAR(8),            /* Reserved                        @L1A*/ 52500000
*     2 RTAALONumRequests FIXED,         /* Number of times that        53000000
*                the logical library was used successfully to           53050000
*                load a module. This is the total of the following      53100000
*                two fields plus those cases where neither the          53150000
*                cache nor LleJPQ was used                       @L1A*/ 53200000
*     2 RTAALONumRequestsFromCache FIXED, /* Number of times that       53250000
*                the logical library cache was used to load a module.   53300000
*                                                                @L1A*/ 53350000
*     2 RTAALONumRequestsFromCSV FIXED,  /* Number of times that        53400000
*                the contents supervisor blocks were used to locate     53450000
*                a previously fetched copy of the module (hence         53500000
*                avoiding a new fetch)                           @L1A*/ 53550000
*     2 RTAALONumRequestsFromLLA FIXED,  /* Number of times that        53600000
*                the LLA located the copy to use                 @L1A*/ 53650000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 53700000
*DCL RtaaloSecCheckYes Constant(1);                    /*        @L1A*/ 53750000
*DCL RtaaloSecCheckNo Constant(2);                     /*        @L1A*/ 53800000
*                                                                       53850000
*DCL 1 RTAALPH TYPE,                 /* RTAALPH Record data format      53900000
*                                                                @L1A*/ 53950000
*     2 RTAALPHNEXTADDR PTR(31), /*                                     54000000
*                            Address of next RTAALPH. RTAALONumLPH      54050000
*          must be used to determine how far along this chain to go.    54100000
*                                                                @L1A*/ 54150000
*     2 RTAALPHNAME CHAR(8),  /* Physical data set name          @L1A*/ 54200000
*     2 RtAALPHSEQNUM FIXED(31), /* Sequence number              @L1A*/ 54250000
*     2 * CHAR(4),              /* Reserved                      @L1A*/ 54300000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 54350000
*                                                                       54400000
*DCL 1 RTAALU TYPE,                 /* RTAALU Record data format        54450000
*                                                                @L1A*/ 54500000
*     2 RTAALUNEXTADDR PTR(31), /* Address of next RTAALU. RTAALONumLU  54550000
*          must be used to determine how far along this chain to go.    54600000
*                                                                @L1A*/ 54650000
*     2 RTAALUASID FIXED(15), /* ASID                            @L1A*/ 54700000
*     2 * CHAR(2),            /* Unused                          @L1A*/ 54750000
*     2 RTAALUJOBNAME CHAR(8),  /* Jobname                       @L1A*/ 54800000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 54850000
*                                                                       54900000
*                                                                       54950000
*DCL 1 RTAAPL TYPE,                 /* RTAAPL Record data format        55000000
*                                                                @L1A*/ 55050000
*     2 RTAAPLNEXTADDR PTR(31), /* Address of next RTAAPL. RTAAPHNumPL  55100000
*          must be used to determine how far along this chain to go.    55150000
*                                                                @L1A*/ 55200000
*     2 RTAAPLNAME CHAR(8),     /* Logical name                  @L1A*/ 55250000
*     2 RtAAPLVERSION CHAR(8),  /* Version                       @L1A*/ 55300000
*     2 RtAAPLSEQNUM FIXED(31), /* Sequence number               @L1A*/ 55350000
*     2 * CHAR(4),              /* Reserved                      @L1A*/ 55400000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 55450000
*                                                                       55500000
*DCL 1 RTLSXTL TYPE CHAR(136) BDY(WORD), /* Extent-list format          55550000
*                                                                @L1A*/ 55600000
*     2 RtlsXtlNumEntriesProvided FIXED(31),  /* This should be         55650000
*          initialized to RtlsXtlMaxNumEntries (16) prior               55700000
*          to calling CSVRTLS REQUEST=LOAD.                             55750000
*                                                                @L1A*/ 55800000
*     2 RtlsXtlNumEntries FIXED(31),     /* The number of entries that  55850000
*          follow.                                               @L1A*/ 55900000
*     2 RtlsXtlEntries CHAR(128),  /* Entries area. Entries are         55950000
*          contigous. Each is mapped by RTLSXTLE                 @L1A*/ 56000000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 56050000
*                                                                       56100000
*DCL RtlsXtlMaxNumEntries Constant(16);     /*                   @L1A*/ 56150000
*DCL 1 RTLSXTLE TYPE,               /* Extent-list entry format         56200000
*                                                                @L1A*/ 56250000
*     2 RtlsXtleLoadPtAddr PTR(31), /* Segment load point address       56300000
*                                                                @L1A*/ 56350000
*     2 RtlsXtleLength FIXED(31),   /* Segment length                   56400000
*                                                                @L1A*/ 56450000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 56500000
*                                                                       56550000
*DCL RtlsContoken Char(8) TYPE;             /*                   @L1A*/ 56600000
*                                                                       56650000
* @LOGIC;                                                               56700000
* #PRAGMA TOOL=CBGEN.                                                   56750000
* #USEORG.                                                              56800000
* #EPRAGMA.                                                             56850000
* @ENDLOGIC;                                                            56900000
*/* End of PL/X Source                                               */ 56950000
* %IF CSVRTAA_LIST ^= 'NO' &                                            57000000
*    ZCBPRINT ^= 'NO' %THEN                                             57050000
*   %GOTO CSVRTAA_4;                                                    57100000
*   @LIST POP NOECHO;                                                   57150000
* %CSVRTAA_4:;                                                          57200000
* %END;                                                                 57250000
