*                                                                       00001000
* %DCL CSVTTEST_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSVTTEST_INCLUDED;                                        00003000
* %IF CSVTTEST_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 92057. CBGEN compile date 92042         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSVTTEST &DSECT=YES,&LIST=YES,&CSTT=YES                        00009000
         GBLC  &CSVTTEST_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&CSVTTEST_INCLUDED SETC 'YES'                                           00012000
 TITLE   '&SYSECT  CSVTTEST - Contents Supervisor TSO Test Interface   *00013000
                     '                                                  00014000
**/ CSVTTEST_1:;                                                        00015000
*/* START OF SPECIFICATIONS ******************************************* 00016000
*                                                                       00017000
*                                                                    */ 00018000
*/***PROPRIETARY_STATEMENT********************************************/ 00019000
*/*01* PROPRIETARY STATEMENT=                                        */ 00020000
*/*                                                                  */ 00021000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00022000
*/*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    */ 00023000
*/*   5695-047 (C) COPYRIGHT IBM CORP. 1992                          */ 00024000
*/*   SEE COPYRIGHT INSTRUCTIONS                                     */ 00025000
*/*                                                                  */ 00026000
*/* STATUS= HBB4430                                                  */ 00027000
*/*                                                                  */ 00028000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00029000
*/*                                                                     00030000
*01* DESCRIPTIVE NAME:  Contents Supervisor TSO Test Interface          00031000
*02*  ACRONYM:  CSTT                                                    00032000
*                                                                       00033000
*01* MACRO NAME:  CSVTTEST                                              00034000
*                                                                       00035000
*01* DSECT NAME:                                                        00036000
*     CSTT                                                              00037000
*                                                                       00038000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           00039000
*                                                                       00040000
*01* EYE-CATCHER:  CSTT                                                 00041000
*                                                                       00042000
*01* STORAGE ATTRIBUTES:                                                00043000
*02*  SUBPOOL: 205                                                      00044000
*02*  KEY:  0                                                           00045000
*                                                                       00046000
*01* SIZE:                                                              00047000
*01*             CSTT -- X'0020' bytes                                  00048000
*                                                                       00049000
*01* CREATED BY:                                                        00050000
*     CSVGETMD CSVSBRTN                                                 00051000
*                                                                       00052000
*01* POINTED TO BY:                                                     00053000
*     Register 1                                                        00054000
*                                                                       00055000
*01* SERIALIZATION:                                                     00056000
*     None                                                              00057000
*                                                                       00058000
*01* FUNCTION:                                                          00059000
*02* The CSTT maps information passed across the SVC 61 (TSO Test)      00060000
*    interface.                                                         00061000
*                                                                       00062000
*01* METHOD OF ACCESS:                                                  00063000
*02*  ASM: N/A                                                          00064000
*02*  PL/AS:                                                            00065000
*      %INCLUDE SYSLIB(CSVTTEST)                                        00066000
*                                                                       00067000
*01* DELETED BY: CSVGETMD CSVSBRTN                                      00068000
*                                                                       00069000
*01* FREQUENCY: 1 per SVC 61                                            00070000
*                                                                       00071000
*01* DEPENDENCIES: None                                                 00072000
*                                                                       00073000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00074000
*                                                                       00075000
*01* CHANGE ACTIVITY:                                                   00076000
*   $L0 = PGMSP , HBB4430, 920208, PD34CA: Introduce macro       @L0A   00077000
*   $D1 = DKB0046,HBB4430, 920318, PD34CA: Bilingual via CBGEN   @D1A   00078000
*                                                                       00079000
* END OF SPECIFICATIONS **********************************************/ 00080000
*% /*                                                                   00081000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00082000
         AIF   ('&LIST' EQ 'YES').P2                                    00083000
.P1      ANOP                                                           00084000
         PUSH  PRINT                                                    00085000
         PRINT OFF                                                      00086000
.P2      ANOP                                                           00087000
         AIF   ('&CSTT' EQ 'NO').L0002                                  00088000
         AIF   ('&DSECT' EQ 'YES').L0003                                00089000
         AIF   ('&CSTT' NE 'YES').L0002                                 00090000
CSTT     DS    0F        mapping of interface with TSO TEST used       *00091000
                         across SVC(61)                                 00092000
         AGO   .L0004                                                   00093000
.L0003   ANOP                                                           00094000
CSTT     DSECT ,         mapping of interface with TSO TEST used       *00095000
                         across SVC(61)                                 00096000
.L0004   ANOP                                                           00097000
CSTT_EYECATCHER DS 1CL0004 = 'CSTT'                                     00098000
CSTT_LEVEL DS  1FL1      Level number                                   00099000
CSTT_FLAGS DS  0BL.024   Three bytes of flags                           00100000
CSTT_FLAG1 DS  0BL.008   Flag byte                                      00101000
CSTT_DELETE EQU X'80'    =1 a DELETE is in process                      00102000
CSTT_FETCH EQU X'40'     =1 a FETCH is in process                       00103000
CSTT_PDS EQU   X'20'     =1 PDS is in use                               00104000
CSTT_PDSE EQU  X'10'     =1 PDSE is in use                              00105000
         ORG   CSTT_FLAG1+X'00000001'                                   00106000
         DS    1BL.016   Reserved                                       00107000
CSTT_DE@ DS    1AL4      Pointer to the PDS2 directory entry            00108000
CSTT_CDE@ DS   1AL4      Pointer to the CDE                             00109000
CSTT_DCB@ DS   1AL4      Pointer to the DCB                             00110000
CSTT_NAME DS   1CL0008   Name of entry being deleted                    00111000
CSTT_EPA@ DS   1AL4      Address of entry being deleted                 00112000
CSTTLNUM EQU   1         Level number of the CSTT                       00113000
CSTTTEXT EQU   C'CSTT'   Value for CSTTID.                              00114000
CSTT_LEN EQU   *-CSTT                                                   00115000
.L0002   ANOP                                                           00116000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00117000
         AIF   ('&LIST' EQ 'YES').P4                                    00118000
.P3      ANOP                                                           00119000
         POP   PRINT                                                    00120000
.P4      ANOP                                                           00121000
.P_EXIT  ANOP                                                           00122000
         MEND                                                           00123000
**/ CSVTTEST_2:;                                                        00124000
* %CSVTTEST_INCLUDED = 'YES';                                           00125000
* %DCL ZCBPRINT CHAR EXT;                                               00126000
* %DEACTIVATE ZCBPRINT;                                                 00127000
* %DCL CSVTTEST_LIST CHAR EXT;                                          00128000
* %DEACTIVATE CSVTTEST_LIST;                                            00129000
* %IF CSVTTEST_LIST ^= 'NO' &                                           00130000
*    ZCBPRINT ^= 'NO' %THEN                                             00131000
*   %GOTO CSVTTEST_3;                                                   00132000
*   @LIST PUSH NOECHO;                                                  00133000
*   @LIST NOASSEMBLE NOECHO;                                            00134000
*   @LIST OFF C NOECHO;                                                 00135000
* %CSVTTEST_3:;                                                         00136000
*/* Start of PL/AS Source                                            */ 00137000
*                                                                       00138000
*DECLARE                                                                00139000
*   1 CSTT BASED,                   /* mapping of interface with TSO    00140000
*                                      TEST used across SVC(61)      */ 00141000
*       3 CSTT_EYECATCHER CHAR(4),  /* = 'CSTT'                      */ 00142000
*       3 CSTT_LEVEL FIXED(8),      /* Level number                  */ 00143000
*       3 CSTT_FLAGS BIT(24),       /* Three bytes of flags          */ 00144000
*         5 CSTT_FLAG1 BIT(8),      /* Flag byte                     */ 00145000
*           7 CSTT_DELETE BIT(1),   /* =1 a DELETE is in process        00146000
*                                                                    */ 00147000
*           7 CSTT_FETCH BIT(1),    /* =1 a FETCH is in process         00148000
*                                                                    */ 00149000
*           7 CSTT_PDS BIT(1),      /* =1 PDS is in use              */ 00150000
*           7 CSTT_PDSE BIT(1),     /* =1 PDSE is in use             */ 00151000
*           7 * BIT(4),             /* Reserved                      */ 00152000
*         5 * BIT(16),              /* Reserved                      */ 00153000
*       3 CSTT_DE@ PTR(31),         /* Pointer to the PDS2 directory    00154000
*                                      entry                         */ 00155000
*       3 CSTT_CDE@ PTR(31),        /* Pointer to the CDE            */ 00156000
*       3 CSTT_DCB@ PTR(31),        /* Pointer to the DCB            */ 00157000
*       3 CSTT_NAME CHAR(8),        /* Name of entry being deleted   */ 00158000
*       3 CSTT_EPA@ PTR(31);        /* Address of entry being deleted*/ 00159000
*   DECLARE                                                             00160000
*     CSTTLNUM FIXED(8) CONSTANT(1), /* Level number of the CSTT     */ 00161000
*     CSTTTEXT CHAR(4) CONSTANT('CSTT'); /* Value for CSTTID.        */ 00162000
*                                                                       00163000
*/* End of PL/AS Source                                              */ 00164000
* %IF CSVTTEST_LIST ^= 'NO' &                                           00165000
*    ZCBPRINT ^= 'NO' %THEN                                             00166000
*   %GOTO CSVTTEST_4;                                                   00167000
*   @LIST POP NOECHO;                                                   00168000
* %CSVTTEST_4:;                                                         00169000
* %END;                                                                 00170000
