         MACRO                                                          03000003
&NAME    CTBL  &C                                                       06000003
         LCLA  &X                       COUNTER OF TABLE ENTRIES        09000003
         LCLA  &L                       LENGTH OF TABLE ENTRIES         12000003
         LCLA  &L1                      NEW LENGTH                      15000003
&NAME    DS    0H                       TAB BEGINS ON EVEN BYTE BOUNDRY 18000003
&X       SETA  1                                                        21000003
.A       AIF   ('&SYSLIST(&X)' EQ '').B END OF ENTRIES                  24000003
&X       SETA  &X+1                     INCREMENT COUNTER               27000003
         AGO   .A                       GET NEXT ENTRY                  30000003
.B       ANOP                                                           33000003
&X       SETA  &X-1                                                     36000003
         DC    AL2(&X)                  NUMBER OF ENTRIES IN TABLE      39000003
&X       SETA  0                                                        42000003
&L       SETA  K'&SYSLIST(1)            LENGTH OF ENTRY                 45000003
         AIF   ((&L-(&L/2)*2) NE 1).C   IS LENGTH ODD NUMBER            48000003
&L1      SETA  (&L+1)/2                 YES, MAKE EVEN                  51000003
         AGO   .D                                                       54000003
.C       ANOP                                                           57000003
&L1      SETA  &L/2                     NO                              60000003
.D       ANOP                                                           63000003
&X       SETA  &X+1                                                     66000003
         AIF   ('&SYSLIST(&X)' EQ '').END                               69000003
         AIF   (K'&SYSLIST(&X) EQ &L).E                                 72000003
         MNOTE 8,'***  IHB358  ALL TABLE ENTRIES MUST BE EQUAL LENGTH'  75000000
.E       ANOP                                                           78000003
         DC    XL&L1'&SYSLIST(&X)'      TABLE ENTRY                     81000003
         AGO   .D                                                       84000003
.END     MEND                                                           87000003
