         MACRO                                                          03000003
&NAME    CV    &DL,&A                   CONVERT BASE                    06000003
         GBLA  &DISP,&VAL3890(250)                             @ZA00766 07000003
         GBLC  &LBL1,&DEF3890(250)                             @ZA00766 08000003
         LCLC  &OP,&LABEL                                      @ZA00766 09000003
         LCLA  &LD,&RL,&M                                      @ZA00766 12000003
&M       SETA  1                                               @ZA00766 13000003
&OP      SETC  '5F'                                                     15000003
         AIF   (N'&DL EQ 1).CV3                                         18000003
         AIF   ('&DL(1)' LT '16').CV1                                   21000003
         MNOTE 12,'***  IHB349  DISPLACEMENT NOT 0-15 DIGITS'           24000003
.CV1     AIF   ('&DL(2)' NE '0' AND '&DL(2)' LT '17').CV2               27000003
         MNOTE 12,'***  IHB350  LENGTH NOT 1-16 DIGITS'                 30000003
.CV2     ANOP                                                           33000003
&LD      SETA  16*&DL(1)+&DL(2)-1                                       36000003
&NAME    DC    0H'0',X'&OP',AL1(&LD),AL2(&A-&LBL1+&DISP)       @ZA00766 39000003
         AGO   .END                                                     42000003
.CV3     ANOP                                                           45000003
.CV7     AIF   (&M GT 250).CV8                                 @ZA00766 45300003
&LABEL   SETC  '&DEF3890(&M)'                                  @ZA00766 45600003
.CV5     AIF   ('&DL'   EQ '&LABEL').CV6                       @ZA00766 45900003
&M       SETA  &M+1                                            @ZA00766 46200003
         AGO   .CV7                                            @ZA00766 46500003
.CV8     ANOP                                                  @ZA00766 46800003
         MNOTE 12,'***   IHB425 &DL NOT EQUATED IN DWF MACRO'  @ZA00766 47100003
.CV6     ANOP                                                  @ZA00766 47400003
&RL      SETA  &VAL3890(&M)                                    @ZA00766 47700003
&NAME    DC    0H'0',X'&OP',AL1(&RL),AL2(&A-&LBL1+&DISP)       @ZA00766 48000003
.END     MEND                                                           51000003
